{"published": "2015-09-15T06:04:06Z", "media-type": "News", "title": "What will happen to Peta Credlin and Brian Loughnane, Liberal power couple?", "id": "c5f8a528-cc0f-4f3e-aaef-b9e3b6b00325", "content": "Tony Abbott's last word  \nWatch the last press conference of outgoing Prime Minister Tony Abbott in full. \n PT6M11S   620  349    \n\nThey're the power couple who have run the Liberal Party back-room operation since December 2009. \n\nBut Tony Abbott's ousting as prime minister will inevitably lead to his high-profile chief of staff, Peta Credlin, quitting the blue carpet in Parliament House's ministerial wing. \n \nPeta Credlin and Brian Loughnane arrive for the Midwinter Ball at Parliament House in June. Photo: Alex Ellinghausen  \n  \nWhat will happen to her husband, long-serving Liberal Party federal director Brian Loughnane, is less clear. \n \nMs Credlin worked for Malcolm Turnbull during his stint as opposition leader in 2008-09, but the pair did not always see eye to eye and she will not be working for the incoming leader. \n\nAfter her time with Mr Turnbull, Ms Credlin became the dominant figure in the Abbott government, described as a controlling co-prime minister by her critics, lauded by her allies — not least Mr Abbott, who called her the \"fiercest political warrior I've ever worked with\".  As chief of staff, she became one of the most high-profile staffers in recent political history. \n \nFrom the first days of the Abbott opposition in December 2009, Peta Credlin was in the room as one of his most trusted lieutenants. Photo: Alex Ellinghausen  \n  \nFrom the first days of the Abbott opposition in December 2009, Ms Credlin was in the room as one of the opposition leader's most trusted lieutenants alongside press secretaries and advisers Andrew Hirst and Claire Kimball, honing and refining Mr Abbott's laser-like attack on Kevin Rudd's carbon pollution reduction scheme. \n\nAfter just less than four years in opposition,  in September 2013, Ms Credlin, a lawyer with years of experience in the Howard government, made the transition as chief of staff into government. \n\nBut the tightly controlled approach adopted in opposition did not work as smoothly in government. \n \nMr Abbott and Ms Credlin in 2013. Photo: Alex Ellinghausen  \n  \nPublic complaints about a \" command and control \" approach taken by the prime minister's office quickly surfaced, and a reliance on slogans that worked in opposition did not cut through in government. \n\nIn February 2015, when Mr Abbott faced a spill motion in the party room, some MPs were calling for a shake-up of the prime minister's office, and for political veteran Tony Nutt to be brought into the office. \n\nMs Credlin disappeared from public view, for a time, but the complaints soon resurfaced. \n \nBrian Loughnane has been federal director of the Liberal Party since 2003. Photo: Alex Ellinghausen  \n  \nBut Mr Abbott refused suggestions of change to his office: in his farewell speech, he singled out his chief of staff  \"who has been unfairly maligned by people who should've known better\". \n\nAnd now, both exit the political centre stage, at least for a time. \n\nMr Loughnane, meanwhile, has been federal director of the Liberal Party since February 2003 and party strategists told Fairfax Media on Tuesday that, if possible, he should continue in the role. \n\nOne veteran pointed out that Mr Turnbull and Mr Loughnane had worked together before, during Mr Turnbull's stint as opposition leader, and that a change in director was not \"necessary or inevitable\". \n\nThat veteran also said the prime minister's office would likely benefit from a bit of \"competitive tension\" between it and Liberal Party HQ. \n\n\"It depends on the relationship between the two of them; [Mr Loughnane] has served every leader since Howard.      But Malcolm will have to be comfortable with the director – you can't have a situation like [former prime minister] Paul Keating and [former ALP secretary] Gary Gray [in 1996].\" \n\nA second Liberal veteran said Ms Credlin was \"very talented and a good manager, but it will be hard for her to stay in the show. I do hope Brian stays on. The most important thing is corporate knowledge and experience.\" \n\nFairfax Media sought comment from Ms Credlin and Mr Loughnane. \n\nOn Tuesday, Mr Turnbull also began the process of putting together his office team. \n\nThe former secretary of the Department of Resources, Energy and Tourism, and of the Communications Department, Drew Clarke, will serve as his acting chief of staff, while Mr Nutt, who worked closely with Turnbull backer Senator Arthur Sinodinos in the office of John Howard, will return to Canberra to help manage the transition to the prime ministership. \n\nSenator Sinodinos confirmed on Tuesday that Mr Turnbull would seek to emulate the attitude of Mr Howard as prime minister by taking a team approach, \"and have a number of senior people in there who can provide advice and make sure it's an open prime minister's office, it's accessible and that there are tributaries of advice going to the prime minister,\" he told Sky News. \n\n\"The role of the office is not to be a gatekeeper and cut people off; the role of the office has to be a facilitator of contact so the prime minister knows and has early warning of whether there are concerns. \n\n\"You don't need the polls if you have backbenchers who are frank and willing to tell you what is going on.\" \n\nFollow James Massola on Facebook . \n\nFollow us on Twitter", "source": "Brisbane Times"}