{"published": "2015-09-21T23:51:58Z", "media-type": "News", "title": "9 excellent parenting hacks", "id": "8b07ce98-b39a-4bc3-a766-534e50bd8efc", "content": "10 simple steps to that will make parenting easier. \n\nFROM keeping the kids out of cupboards, to cleaning crayons off the couch — there’s likely to be a hack for that. \n\nParenting blogs, mummy magazines and social sites are awash with tips and tricks to get you — and your youngs ones — out of sticky situations. \n\nHere’s your go-to list for hacking your way through the day, and make parenting that little bit easier. \n\nHACK 1: BABY-MOP \n\nBaby-Mop! The only onesie your will ever need. Photo: betterthanpants.com Supplied \n\nHow cute is this! You can actually buy the Baby-Mop online, or make a version of your own. The mop is made using super-soft, absorbent material — perfect for getting bub to help out with cleaning the floors. Talk about teaching your baby a strong work ethic from day dot! \n\nHACK 2: BASKET IN THE BATHTUB \n\nBasket in the bathtub keeps EVERYONE from floating away. Supplied \n\nMake bath time less frustrating with this cheeky cheat. The tub can be a pretty big place for your toddler, and bath toys often tend to float out of reach. A well positioned washing basket can help bub stay with his floating friends, by keeping them all within arms-reach! \n\nHACK 3: HOT GLUE ON YOUR SHOE \n\nGlue on your shoe stops kids from slipping over. Photo: Pinterest. Supplied \n\nCombat grazed knees and stop your kids from slipping over with this handy hint. A line of hot glue along the sole of their shoe will act as slip stopper. \n\nHACK 4: SWEET TREAT HELPS SOOTHE A SORE THROAT \n\nMarshmallows can help soothe a sore throat. Photo:  Supplied \n\nYes — the fluffy, puffy campfire treat can also help relieve a sore throat. That’s thanks to the gelatine within marshmallows, which tend to coat and soothe a sore throat. Sweet treat and pain-relief all in one! \n\nHACK 5: TOOTHPASTE CLEANS MORE THAN JUST YOUR TEETH \n\nNon-gel toothpaste can help clean crayons off hard surfaces. Supplied \n\nFrom the window, to the wall — the sky is the limit when it comes to kids and crayons. Store some toothpaste in your cleaning cupboard, because this tube will be your lifesaver! The fine abrasive in non-gel toothpaste works at removing crayon off the wall, and the floor — every time. Just squirt, scrub and rinse. \n\nHACK 6: DOUBLE UP THE POOL AS A PLAYPEN \n\nThe pool can double up as the perfect sized playpen. Photo: Pinterest. Supplied \n\nHeading in to Summer, the blow up pool will be getting a workout in the backyard. But what about at night or on those colder Spring days? Pack up the pool and bring it indoors — because it makes for the perfect playpen. \n\nHACK 7: COOL DOWN \n\nThe mist of a spray bottle will cool down hot seatbelt buckles instantly. News Corp Australia \n\nHot seatbelt buckles are the worst! Try storing a mist bottle in the car to cool down hot buckles. The mist will cool down hot plastic and metal instantly. Your kids skin will thank you for it! \n\nHACK 8: STOP STICKY FINGERS \n\nSweet success! Now more sticky fingers with this life hack. Photo: Pinterest. Supplied \n\nSummer tends to call for untold amounts of iceblocks, often leaving kids with sticky fingers! Never fear — because by placing a cupcake holder or small paper plate on the stick, drips are caught — every time! \n\nHACK 9: NO MORE FALLING OUT OF BED \n\nA pool noodle will prevent your kids from falling out of bed. Make sure it's dry first, though. Picture: Reddit user Ryval, via Lifehacker Supplied \n\nKeep kids cosy and tucked in all night long with this top tip. Place a pool noodle under a fitted sheet, and it will keep them from rolling out of bed and over the edge. Sounds night for all! \n\nHOW TO BE A TECH SAVVY PARENT? \n\nREAD MORE: 5 PARENTING FAILS THAT ARE OK \n For more detail please click here", "source": "Social Dashboard"}