{"published": "2015-09-10T17:46:00Z", "media-type": "News", "title": "Two Prominent Industry Vendors Select Azimuth’s ACE RNX for Small Cell Testing", "id": "cdd950c4-8f74-4c3e-957e-02484d75a175", "content": "ACTON, Mass.--(BUSINESS WIRE)-- \n\nAzimuth Systems, Inc., a leading provider of automated, real-world mobile performance test solutions, announced today that a leading small cell vendor and a wireless infrastructure provider have both selected the Azimuth ACE RNX platform to test small cells and heterogeneous networks. Powered by Azimuth’s newly announced revolutionary Virtual Network Environment (VNE) capability, which allows users to re-create HetNet environments in the lab, the RNX with VNE delivers the only comprehensive solution for testing small cells and heterogeneous networks. Small cells play a critical role in operator’s network densification plans, which are needed to ensure widespread high-speed coverage. While small cells help meet this requirement, they inevitably introduce increased interference. LTE-A HetNet uses a variety of algorithms to mitigate that interference, but the algorithms also increase the complexity of the system—and dramatically increase the challenges to testing. \n\nMeeting the Vendors’ Needs \n\nThe world’s number one small cell vendor and a leading wireless infrastructure provider both recognized the need to expand their pre-and post deployment performance testing beyond basic channel emulation. They needed a solution that would deliver a wide dynamic range with the low insertion delay critical in small cell testing. Both vendors wanted to be able to re-create complex indoor-outdoor HetNet environments, and to incorporate indoor channel models. The timing was perfect: Azimuth has just released its groundbreaking Virtual Network Environment (VNE), the industry’s first and only complete HetNet testing solution. \n\nThe vendors were already familiar with the powerful, reliable RNX platform, which is controlled by Azimuth’s Director 3, a powerful and forward-looking test executive known for its advanced automation, cloud-based architecture, and intuitive test-creation capabilities. Driven by Director 3 and Scenario Builder, VNE greatly expands already-considerable capabilities of the RNX, adding the power to test—in the lab—the myriad interference mitigation algorithms (e.g., ICIC, eICIC, FeICIC) required for LTE-A HetNet environments. \n\n\"The ACE RNX’s capabilities, built with LTE-A in mind, have enabled these two vendors to continue building their world-class small cell portfolio,\" said Pete Paglia, president and CEO at Azimuth Systems. \"Developed collaboratively with our key customers, the RNX meets their technical and nontechnical needs for comprehensive, real-world LTE-A testing.\" \n\nYou can learn more about the requirements for testing small cells here. \n\nAbout Azimuth Systems \n\nAzimuth Systems, Inc., is a leader in mobile performance test solutions for network operators, device and module OEMs, chipset vendors, and infrastructure providers. The industry is in an unprecedented period of transition, with the introduction of major new network, device, and service technologies, and aggressive competition in an increasingly saturated market. Azimuth delivers system and software solutions that re-create real-world device-network interaction to identify and address issues, maximize quality and customer satisfaction, and reduce time-to-market. Headquartered in Acton, Massachusetts, USA, Azimuth has customer engagement offices around the world. Engage with Azimuth at www.azimuthsystems.com or on Twitter (https://twitter.com/azimuthsystems). \n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150910006510/en/ Contact:Azimuth Systems, Inc.\n\nVivek Vadakkuppattu, +1-978-263-6610\n\nVP, Product Management & Marketing\n\nvivek@azimuthsystems.com", "source": "Yahoo! Finance UK and Ireland"}