{"published": "2015-09-08T12:30:43Z", "media-type": "Blog", "title": "A Conversation with U.S. Secretary of Education Arne Duncan (Ep. 75)", "id": "6814cf88-cbbd-4e4f-8b1a-6433e6e2007d", "content": "Hey guys! I’m massively excited about this episode and want to let you jump right in, so I’ll make this summary brief; today I have the huge honor of talking with Arne Duncan, the U.S. Secretary of Education, on the podcast. \n \nSecretary Duncan’s main message throughout our conversation? Graduate, graduate, graduate . He is laser-focused on improving graduation rates all over the country, both through initiatives to increase student aid and programs to help students perform better academically. \n \nBeyond graduations rates, though, the conversation touches on picking a college, paying for school and dealing with student debt, and we also talk a bit about Secretary Duncan’s journey to becoming a member of the President’s Cabinet (which included a few years as a professional basketball player). \n \nI’m incredibly grateful for the opportunity to conduct this interview; seriously, even as I’m writing this, it’s still hard to believe this episode is a reality when this podcast started with me rambling about exercise from my tiny apartment in the middle of Iowa. \n \nEnjoy the episode! \n \nThings mentioned in this episode: \n  U.S. Dept. of Education  Information on Federal student loans  FAFSA  Don’t pay for student loan debt relief  Secretary Duncan’s recent article on improving graduation rates   \nWant more cool stuff? You can find all sorts of great tools at my Resources page . \n \nIf you enjoyed this episode, subscribe to the podcast on iTunes! It’s easy, you’ll get new episodes automatically, and it also helps the show gain exposure You can also leave a review! \n \nRSS is cool and all, but you can also view the original post here: A Conversation with U.S. Secretary of Education Arne Duncan (Ep. 75)", "source": "College Info Geek"}