{"published": "2015-09-30T03:17:11Z", "media-type": "News", "title": "Refreshed Ko ready to go", "id": "fa4bea0f-d75d-43bd-9d5b-b7f3c470e648", "content": "Two weeks into a three-week break, New Zealand golfer Lydia Ko is refreshed and ready to tackle the five-tournament Asian swing of the LPGA Tour. \n\nThe world No.2, who sits fractionally behind top-ranked South Korean Inbee Park, has been enjoying some hard-earned time off after winning her first major title at the Evian Championship earlier this month. \n\nThe 18-year-old returned to her Orlando, Florida, base for a little down time but told lpga.com she wasn't expecting to take too much of a break. \n\n\"I don't really like to do a lot of physical things outside the golf course, and just lying in bed watching movies is good enough for me,\" she said. \n\n\"Now I just kind of need to go back to square one, do my basic practices and work my way towards the Asia Swing.\" \n\nKo fashioned back-to-back wins in her last two starts, taking out the Canadian Open in August before wrapping the Evian Championship a month later. \n\nAnd although she's enjoying a break from the Tour, Ko says she's also aware that the first tournament of the Asia Swing begins in Kuala Lumpur on October 8. \n\n\"I'm pretty sure it's going to be a great couple weeks in Asia. I kind of have to think of this in the back of my mind, enjoy it, but also prepare for what's coming up next.\" \n\nIt's been seven months since Park seized the world No.1 ranking off Ko, but the pair are now the closest they've been since February. \n\nPark sits on 12.94 ranking points to Ko's 12.82, well clear of their nearest rival, American Stacy Lewis. \n\nKo and Park are almost neck and neck in every department with seven tournaments remaining in 2015 - not just the world rankings but also prize money earnings this year, along with LPGA's lucrative points race. \n\nThe season concludes in late November at the Tour Championship in Florida, which Ko won last year to see off Park for money, points and top dog status. \n\nNZN", "source": "NZCity"}