{"published": "2015-09-08T08:55:33Z", "media-type": "News", "title": "'We cannot be bought on climate change,' Pacific island leader warns Tony Abbott", "id": "6a74793f-5fe1-4b9a-808e-93d3694793ed", "content": "Several small island states are likely to walk out on the Pacific Islands Forum if Australia and New Zealand force them to compromise on a declaration demanding an ambitious target to combat climate change. \n\nPort Moresby Several small island states could walk out on the Pacific Islands Forum if Australia and New Zealand force them to compromise on a declaration demanding an ambitious target to combat climate change.\n\nThe president of Kiribati, Anote Tong, issued the ultimatum on the eve of the summit of 16 Pacific Island leaders on Tuesday, declaring: \"We cannot negotiate this, no matter how much aid. We cannot be bought on this one because it's about the future.\"\n\nMr Tong raised the prospect of either states walking out or Australia being asked to leave the forum if its two more powerful members forced a compromise on the commitment of island states to the goal of limiting global warming to 1.5 degrees Celsius.\n\n\"We expect them as bigger brothers, not bad brothers, to support us on this one because our future depends on it.\"\n\nAcceptance of such a compromise would be \"a betrayal of our people\", he said, insisting that even a 1.5 degree temperature rise would leave the most vulnerable states in deep trouble.\n\nHe challenged Tony Abbott, who arrives at the forum on Wednesday, to swap shoes with those leaders representing island states that were already being ravaged by climate change.\n\n\"If Tony Abbott was here, facing the situation we are facing now, what kind of an answer would he expect from me as prime minister of Australia?\" he asked.\n\nFairfax Media understand Australian and New Zealand officials are working hard to soften the climate change declaration to be endorsed by the meeting, including removing a reference to the goal of limiting the global temperature rise to 1.5 degrees.\n\nStrong declarations, including a call for a moratorium on new coal mines, have been endorsed by smaller island states in the lead-up to this week's summit.\n\nWarning that climate change would force the relocation of entire communities, Mr Tong said: \"It's already happening.\"\n\nMr Tong's impassioned ultimatum was backed by Tuvalu Prime Minister Enele Sopoaga, who told reporters in Port Moresby: \"I think the sentiments that have been expressed by the president of Kiribati Anote Tong are strongly shared by leaders of smaller island states.\"\n\nBut the forum chair, Papua New Guinea's Prime Minister Peter O'Neil, held out hope that the meeting would agree on a declaration acceptable to all.\n\n\"The forum has been withstanding many challenges for many, many years, so I don't think that our own differences of opinion or disagreements will be a cause of the disintegration of the forum itself,\" he said.\n\n\"I do not wish to pre-empt the outcome of the forum leaders' meeting that is going to take place over the next few days, but we will reach a common understanding one way or the other during the course of this meeting.\"\n\nHe expressed confidence that as \"a very good friend of the Pacific\", Mr Abbott would be wiling to hear the voices of those calling for more ambitious action. \"We will give him every opportunity to participate fully at the upcoming meeting,\" he said.\n\nFollow us on Twitter The story first appeared on The Sydney Morning Herald.", "source": "Eastern Riverina Chronicle"}