{"published": "2015-09-10T14:43:12Z", "media-type": "News", "title": "The Latest: Prosecutor wants a Baltimore jury in Gray case", "id": "a37f23a4-9993-47dc-917a-34899c56a2b3", "content": "The latest on a pretrial hearing in the prosecution of six Baltimore police officers charged in the arrest and death of Freddie Gray, a 25-year-old black man who died after suffering a spinal injury in custody (all times local): \n\n10:10 a.m. \n\nLawyers for six Baltimore police officers charged in connection with Freddie Gray's death say the city's $6.4 million settlement with Gray's family is one reason the trials should be held elsewhere. \n\nAttorney Ivan Bates, representing Sgt. Alicia White, argued on behalf of all six officers as the hearing began Thursday in Baltimore City Circuit Court. \n\nBates told Judge Barry Williams the settlement announced on Tuesday sends a message to prospective jurors that \"these officers are guilty, and if they are not guilty, why are we paying them $6.4 million?\" \n\nBates also says public comments by State's Attorney Marilyn Mosby make it impossible to find impartial jurors. He says she aligned herself with protesters, effectively convicting the officers before trial. \n\nGray died in April after suffering an injury in police custody. \n\nProsecutors will present arguments for why the trials should stay in Baltimore. \n\n--- \n\n9:45 a.m. \n\nSheriff's deputies have arrested a protester outside a Baltimore courthouse where a judge is to hear arguments about moving the trials of six city police officers charged in the arrest and death of Freddie Gray. \n\nShortly before the hearing was to begin at 9:30 a.m. Thursday in Baltimore Circuit Court, more deputies appeared outside the courthouse. Some had multiple plastic strips, used as handcuffs, clipped to their vests. \n\nDeputies formed a line and several surrounded one woman with a sign and a knapsack on the sidewalk in front of the courthouse. She had been the first demonstrator on the scene Thursday morning. Her sign said the trials should remain in Baltimore because, \"They didn't bother to kill him elsewhere.\" \n\nAfter deputies took her into the courthouse, her sign was behind a garbage can by the courthouse door. \n\n--- \n\n9:30 a.m. \n\nAbout 20 protesters have gathered in front of the downtown courthouse as a hearing starts for six officers charged in the arrest and death of Freddie Gray. \n\nThe hearing is over whether the officers' trials should be held in Baltimore or moved out of town. \n\nThe demonstrators chanted: \"It happened here. It has to stay here.\" Many of them were at the courthouse last week for a similar rally when a judge decided the six officers would be tried separately. \n\nThis time, with rain threatening, there weren't as many protesters at a morning rally. Police officers stood nearby in a line. \n\n--- \n\n9:10 a.m. \n\n\"Keep it here\" is the chant of demonstrators outside a Baltimore courthouse where a judge will hear arguments about the trial location for six police officers charged in the arrest and death of Freddie Gray. \n\nDefense attorneys have argued in pretrial motions that the officers can't get a fair and impartial trial in the city because of publicity about the case and because city residents were subject to a curfew in the spring after rioting broke out in the wake of Gray's April 19 death. \n\nThe Baltimore People's Power Assembly staged a small demonstration Thursday morning before the start of Thursday's pretrial hearing. Protesters carried signs saying, \"Black Lives Matter\" and seeking \"Jobs & Education, Not Police Terror.\" \n\n--- \n\n9 a.m. \n\nA judge is limiting the time for arguments in a pretrial hearing for six Baltimore police officers charged in connection with the death of Freddie Gray. \n\nEach side will get 15 minutes Thursday to make their arguments about where the trials should be held. \n\nCircuit Judge Barry Williams is hearing arguments on defense motions asserting the officers cannot get fair trials in Baltimore due heavy pretrial publicity and the effect on potential jurors of a citywide curfew after rioting in April. \n\nProsecutors say the trials should be held in Baltimore. \n\nGray was a 25-year-old black man who died in April, a week after suffering a critical spinal injury in police custody. \n\n--- \n\n8 a.m. \n\nThe first protester showed up around 8 a.m. Thursday outside Baltimore Circuit Court, where a pretrial hearing in the Freddie Gray case is planned. \n\nThe woman carried a sign urging that the trials of six city police officers charged in Gray's arrest and death remain in Baltimore. \n\n\"They didn't bother to kill him elsewhere,\" the sign read. \n\nJudge Barry Williams will hear arguments Thursday morning by attorneys for the officers to consider a change of venue. Defense attorneys have argued in court filings that pre-trial publicity means the officers can't fair and impartial trial in Baltimore. \n\nGray suffered a spinal injury during his arrest in April in West Baltimore and died a week later. \n\n--- \n\n6:45 a.m. \n\nA Baltimore pastor has been arrested a week after police say he blocked traffic while protesting during pre-trial hearings in the Freddie Gray case. \n\nPolice say they arrested 27-year-old Westley West on Wednesday after obtaining a warrant charging him with attempting to incite a riot, malicious destruction of property, disorderly conduct, disturbance of the peace, false imprisonment and failure to obey. \n\nOnline court records show West is charged with walking on a road where a sidewalk is provided, but don't list a lawyer. \n\nPolice say they recorded West, the pastor at Faith Empowered Ministries, stepping in front of a pickup truck and hitting the hood with his bullhorn. Others joined West blocking traffic, but fled when officers approached. \n\nThe arrest came a day before another pre-trial hearing for six officers charged in the death of Gray, a 25-year-old black man fatally injured in police custody.", "source": "Fresno Bee"}