{"published": "2015-09-29T00:30:33Z", "media-type": "Blog", "title": "Black Lives Matter & F*** Yo Flag Activist Arrested for Video Threats to Kill White People, Police", "id": "80df9829-e765-4127-a0fa-0e83ba770403", "content": "This is the Scum of this Country that we have no place  for except in Prison.\nBitch thought she was cool on the left and is a whiner on the right.\nA Georgia woman has been arrested for making threats against police and for declaring “open season” on white people in a video she uploaded to YouTube. Latausha Nedd, who goes by the pseudonym Eye Empress Sekhmet online, was arrestedThursday by the FBI and U.S. Marshals over threats she posted on YouTube against whites and police. Nedd was reportedly watching a news report about herself when authorities arrived at her house. A news crew from WSB Channel 2 was at the scene during the arrest. “You really want people to kill cops?” Nedd was asked as she was escorted to a waiting police cruiser. Neddreplied, “I never said that.” From inside the police cruiser she added, “All I said was defend yourself against people who want to kill us. That’s all. I never said anything more than that.” The video in which Nedd made the threats appears to have been taken down, but copies are available online. In one segment, Nedd holds a machete in one hand and points a handgun at the camera with the other as she says, “Right now we declare, it’s open season on a motherf–king cracker. All you motherf–king crackers y’all need to watch your motherf–king heads.” Elsewhere in the video, Nedd suggests taking action against police. “I say let’s have a take a gun day, and start walking up on these untrained and stealing their weapons,” she says. She also suggests trying to take over a police station. Nedd lives less than two miles from the Clayton County police headquarters. Local residents interviewed by WSB Channel 2 were disturbed by Nedd’s call for violence. “This is alarming. It really is,” one black gentleman told WSB. Sometime yesterday, before her arrest, Nedd uploaded another clip in which she says, “All you motherf–kers got me f–ked up!” The description beneath the video reads, “Sending me death threats really???? But you have no problem with the systematic killing of blacks really? Stop your madness white supremacy and white privilege got you thinking you still own slaves well you don’t Stop killing blacks!” Nedd appeared in court Friday morning and was denied bond by a judge. http://www.thegatewaypundit.com/2015/09/black-lives-matter-f-yo-flag-activist-arrested-for-video-threats-to-kill-white-people-police/ http://www.breitbart.com/big-government/2015/09/25/georgia-woman-arrested-threats-police-white-people/", "source": "Central-Illinoisand_beyond"}