{"published": "2015-09-29T15:42:11Z", "media-type": "News", "title": "CSL Retires Birchglen And Mapleglen As Part Of Fleet Renewal Program", "id": "d01f0e0c-e030-480f-aad9-ac8888656610", "content": "MONTREAL , Sept. 29, 2015 /CNW Telbec/ - In the past week, Canada Steamship Lines bid farewell to two distinguished ladies - Birchglen and Mapleglen - as they set sail on their final journey. The two bulk carriers are en route to Turkey , where they will be responsibly recycled at an eco-friendly shipyard. \nThe dismantling of the two mature vessels is part of CSL's fleet optimization and capacity management programs. Since 2012, the Great Lakes shipping company has introduced six new state-of-the-art Trillium Lakers and taken four older and less efficient ships out of service. \n   \"Great Lakes shipping is a mature market, it isn't growing,\" said \n, President of Canada Steamship Lines. \"Our Trillium program has always been about renewing our fleet, not growing it.\" \nAs new ships equipped with advanced technology continue to improve the operational and environmental performance of Great Lakes shipping, companies like CSL must adapt to maintain a fine balance between new tonnage and market demand. \n \" CSL invested in the most efficient, safe, and environmentally-responsible ships for the future of Great Lakes shipping,\" noted Paterson. \"Now it is time to responsibly recycle some of the vessels that have defined our past.\" \nThe recycling of Birchglen and Mapleglen is scheduled to begin at a facility in Aliaga, Turkey , in mid-October, and will be conducted in full compliance with international rules and regulations, and with CSL's own rigorous ship recycling policy. \n Birchglen was delivered from a Scottish shipyard in 1983 and began serving Canada Steamship Lines in 2002 when CSL bought the vessel from Fednav. The ship made history in July 2010 when she carried the largest cargo of windmill parts into the Great Lakes from Gros Cacouna, Quebec , to Burns Harbor, Indiana . Mapleglen was built in Hoboken, Belgium in 1981 and was purchased by CSL in October 2008 . She was a steady workhorse for the company until 2014. \n Canada Steamship Lines is a division of The CSL Group, the world's largest owner and operator of self-unloading vessels. Headquartered in Montreal with divisions based in the United States , Europe , Asia and Australia , CSL delivers more than 76 million tonnes of cargo annually for customers in the construction, steel, energy and agricultural sectors.  \n ", "source": "TheStreet.com"}