{"published": "2015-09-03T11:52:07Z", "media-type": "News", "title": "Bizarre alien corpse discovered in Russia has experts stumped", "id": "4b5c1ead-bd68-41dd-8242-500a7d4e005a", "content": "A tiny alien creature that washed up on the banks of a river in western Russia has locals and experts stumped. A tiny alien creature that washed up on the banks of a river in north western Russia has locals and experts stumped. At first glance it looks like something borne from the abdominal cavity of a Nostromo crew member to wreak space-horror havoc of Sigourney Weaver and the human race.\n\nBut the four-centimetre oddity that was found in the Leningrad region in the town of Sosnovy Bor by a woman named Tamara as she waded in the shallows of the Kovashi River, according to a local television news report.\n\nWith what appears to be an elongated skull, shrunken frame and taloned limb, Tamara's friends thought it was a mutant chicken embryo.\n\nBut Tamara was not convinced the creature she found -- and christened 'Kesha' -- was of such mundane origins.\n\nBiologist Yegor Zadareev at the Krasnoyarsk Institute of Biophysics agreed.\n\n\"It seems that this body is neither fish nor fowl … this creature has a mysterious skull, no neck and wings,\" he said according to a translation of an interview on Russian TV.\n\nKesha was to be sent to Moscow for further analysis, which is sufficiently vague to conjure images of top secret underground bunker laboratories, reverse-alien probes and mitochondrial sequencing.\n\nKesha had alien conspiracy theorists are dusting off their tin-foil hats.\n\nUFO Sighting Daily, whose other tops stories are \"UFO follows The Donald Trump Helicopter, Tells US Trump will be next President\", and \"City on Mars Inside Alien Skull Found In India\" is eagerly awaiting the results of further tests.\n\nBut Tamara's friends and their mutant chicken egg theory is closer to the money for Sosnovy Bor locals. The key word being 'mutant'.\n\nThe residents of the town, which is in the shadow of the Leningrad Nuclear Power Plant, are \"naturally suspicious\" of expert authority, reported the Australian duo behind the Mysterious Universe podcast report, tongues-firmly-in-cheeks.\n\nThe plant had a history of disastrous industrial accidents and cover-ups, according to a former Russian Federal Inspectorate for Nuclear and Radiation Safety, Vladimir Kuznetsov.\n\nThree people were killed when a cooling circuit unit ruptured the year the plant opened in 1975. Over last three decades there have been two fires, a radiation spill detected six kilometres from the sight and five other major accidents at the plant.\n\nIf it is a radioactive mutant spawned from a leak at the nuclear power that makes Kesha more Blinky the fish than a flesh-eating alien.\n\nIt's not the first time reports of a bite-sized extra terrestrial corpse has captivated the imagination of Earthlings.\n\nPerhaps Kesha is a distant relative of Ata, the alien-like oddity discovered in a ghost town of the Atacama Desert of Chile in 2003.\n\nThe bizarre 12-centimetre-long skeleton was the star of the UFO documentary Sirius, and paraded as persuasive evidence of alien life.\n\nThat was until an immunologist had the novel idea that a rigorous scientific analysis of the specimen might hold the answers.\n\nAfter mapping more than 500 million reads to a reference human genome and examining x-rays of the humanoid, immunologist and director of the National Heart, Lung, and Blood Institute's Proteomics Centre for Systems Immunology at Stanford Garry Nolan proved Ata was of this world.\n\nAta was human. Possibly a 22-week-old foetus with a severe form of a rare rapid ageing disease, progeria, and died in the womb or after premature birth.\n\nWill the same extensive analysis be carried out to determine the origins of tiny Kesha? Scientists say it could take years.\n\nWho knows? Perhaps Kesha could become the first confirmed proof of alien humanoid life by the time President Trump takes up his second term in the White House. The story first appeared on The Sydney Morning Herald.", "source": "Coly Point Observer"}