{"published": "2015-09-17T13:20:00Z", "media-type": "News", "title": "Equities Coverage on the Healthcare Sector -- Achillion Pharma, Perrigo, ACADIA Pharma, Kindred Healthcare, and Insulet", "id": "75c44e2a-7bff-46b2-aff1-c85c81eb3416", "content": "/PRNewswire/ -- \n\nEquity Research Institute has initiated coverage on the following equities: Achillion Pharmaceuticals Inc. ( NASDAQ: ACHN ), Perrigo Company PLC ( NYSE: PRGO ), ACADIA Pharmaceuticals Inc. ( NASDAQ: ACAD ), Kindred Healthcare Inc. ( NYSE: KND ), and Insulet Corporation ( NASDAQ: PODD ). Free research report on Achillion Pharma can be accessed at https://www.erionline.net/reports?keyword=ACHN On Wednesday, September 16, 2015 , the NASDAQ Composite ended at 4,889.24, up 0.59%, the Dow Jones Industrial Average advanced 0.84%, to finish the day at 16,739.95, and the S&P 500 closed at 1,995.31, up 0.87%. The gains were broad based as all the sectors ended the session in positive. Register for your complimentary reports at the links given below.   \n   \nAchillion Pharmaceuticals Inc.'s stock gained 2.44%, to close Wednesday's session at $7.99 . The stock recorded a trading volume of 2.22 million shares, below its three months average volume of 2.43 million shares. Over the last one month and the previous three months, Achillion Pharmaceuticals Inc.'s shares have declined 7.63% and 7.74%, respectively. Additionally, the stock has plummeted 34.78% since the start of this year. The company is trading 2.10% and 23.87% below its 50-day and 200-day moving averages, respectively. Furthermore, Achillion Pharmaceuticals Inc.'s stock has a Relative Strength Index (RSI) of 51.32. Sign up and read the free notes on ACHN at: \n\nhttps://www.erionline.net/reports?keyword=ACHN \n\nPerrigo Co. PLC's stock finished Wednesday's session 0.58% lower at $182.39 . A total of 0.95 million shares were traded, which was below its three months average volume of 1.21 million shares. Over the last one month and the previous three months, Perrigo Co. PLC's shares have fallen by 7.38% and 3.09%, respectively. However, the stock has gained 9.35% since the beginning of 2015. The company's shares are trading above their 200-day moving average by 3.38%. Perrigo Co. PLC's stock traded at a PE ratio of 200.43 and has an RSI of 48.15. The complimentary notes on PRGO can be downloaded in PDF format at: \n\nhttps://www.erionline.net/reports?keyword=PRGO \n\nOn Wednesday, shares in ACADIA Pharmaceuticals Inc. ended the session 1.07% higher at $42.66 . The stock reported a trading volume of 0.86 million shares, below its three months average volume of 1.19 million shares. ACADIA Pharmaceuticals Inc.'s shares have gained 8.16% in the last one month, 6.23% in the previous three months and 34.36% on YTD basis. The company is trading 0.28% above its 50-day moving average and 13.63% above its 200-day moving average. Moreover, shares of ACADIA Pharmaceuticals Inc. have an RSI of 56.99. Register for free on Equity Research Institute and access the latest research on ACAD at: \n\nhttps://www.erionline.net/reports?keyword=ACAD \n\nKindred Healthcare Inc.'s stock edged 0.76% lower, to close the day at $19.47 . The stock recorded a trading volume of 0.44 million shares, below its three months average volume of 0.80 million shares. Over the last one month and over the past three months, Kindred Healthcare Inc.'s shares have declined 12.61% and 9.17%, respectively. However, the stock has gained 8.85% since the start of this year. The company's shares are trading 5.73% below their 50-day moving average. Additionally, Kindred Healthcare Inc. has an RSI of 38.09. The complete research on KND is available for free at: \n\nhttps://www.erionline.net/reports?keyword=KND \n\nOn Wednesday, shares in Insulet Corp. recorded a trading volume of 0.50 million shares, lower than their three months average volume of 0.58 million shares. The stock ended the day 1.26% higher at $29.72 . Insulet Corp.'s stock has lost 1.88% in the last one month, 2.49% in the previous three months and 35.48% on YTD basis. The company is trading below its 50-day and 200-day moving averages by 3.52% and 9.86%, respectively. Furthermore, shares of Insulet Corp. have an RSI of 50.74. Free in-depth research on PODD is available at: \n\nhttps://www.erionline.net/reports?keyword=PODD \n\nAbout Equity Research Institute:   \n\nEquity Research Institute (\"ERI\") produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. ERI has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below. \n\nERI has not been compensated; directly or indirectly; for producing or publishing this document. \n\nPRESS RELEASE PROCEDURES:   \n\nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third party research service company (the \"Reviewer\"). Rohit Tuli , a CFA® charter holder (the \"Sponsor\"), provides necessary guidance in preparing the document templates. The Reviewer has reviewed and revised the content, as necessary, based on sound investment judgment and publicly available information which is believed to be reliable. The Reviewer and the Sponsor have not performed any independent investigations or forensic audits to validate the information herein. Unless otherwise noted, any content outside of this document has no association with the Author, the Reviewer, or the Sponsor (collectively referred to as the \"Production Team\") in any way. The Production Team is compensated on a fixed monthly basis and do not hold any positions of interest in any of the securities mentioned herein. \n\nNO WARRANTY   \n\nERI, the Author, the Reviewer and the Sponsor (collectively referred to as the \"Publishers\") are not responsible for any error which may be occasioned at the time of printing of this document or any error, mistake or shortcoming. No liability is accepted by the Publishers whatsoever for any direct, indirect or consequential loss arising from the use of this document. The Publishers expressly disclaim any fiduciary responsibility or liability for any consequences, financial or otherwise arising from any reliance placed on the information in this document. Additionally, the Publishers do not (1) guarantee the accuracy, timeliness, completeness or correct sequencing of the information, or (2) warrant any results from use of the information. The included information is subject to change without notice. \n\nNOT AN OFFERING   \n\nThis document is not intended as an offering, recommendation, or a solicitation of an offer to buy or sell the securities mentioned or discussed, and is to be used for informational purposes only. Please read all associated disclosures and disclaimers in full before investing. Neither ERI nor any party affiliated with us is a registered investment adviser or broker-dealer with any agency or in any jurisdiction whatsoever. To download our report(s), read our disclosures, or for more information, visit http://www.erionline.net . \n\nRESTRICTIONS   \n\nERI is not available to residents of Belarus , Cuba , Canada , Iran , North Korea , Sudan , Syria or Somalia.  \n\nCFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute. \n\nSOURCE www.erionline.net", "source": "Good Day Sacramento"}