{"published": "2015-09-07T11:00:00Z", "media-type": "News", "title": "German refugee welcome contrasts with cold reception in '90s", "id": "50898341-22dc-4fd9-9164-29f2bd7d4705", "content": "BERLIN -- Crowds greet trainloads of migrants with applause, candy and toys. A provincial town's mayor wants to take in more refugees. Top conservative politicians say Germany needs young immigrants. \n \nIt's a contrast with a frosty reception when migrant arrivals in Germany last spiked in the 1990s and mainstream politicians rushed to tighten asylum rules, while the country's top-selling newspaper asked: \"The flood is rising - when will the boat sink?\" \n \nGermany expects 800,000 new migrants to arrive this year, nearly twice the previous record. And while attacks on homes for refugees and anti-migrant protests have caused widespread alarm, the broader atmosphere has been strikingly welcoming - illustrated by the weekend's euphoric scenes in stations from Bavarian metropolis Munich to provincial Saalfeld in which throngs of Germans greeted migrants. \n \nThe previous record dates back to 1992, when nearly 440,000 asylum-seekers came as the former Yugoslavia disintegrated - coinciding with a spate of anti-foreigner attacks that shamed Germany. \n \nIn perhaps the most notorious incident back then, days of rioting in the eastern city of Rostock saw far-right extremists throw firebombs and stones at a center for refugees, then a neighboring apartment block inhabited by Vietnamese immigrants, as bystanders cheered. \n \nIn contrast to the Bild daily's 1992 headline about a sinking boat, the newspaper today has taken a pro-refugee line. A recent Sunday edition led with seven pages of supportive messages from prominent Germans under the headline \"100 voices against hatred of refugees.\" \n \n\"We stood on the edge of a moral abyss ... and we have moved on as a society,\" said Christoph Rass, an expert on contemporary history at the University of Osnabrueck's Institute for Migration Research and Intercultural Studies. Previous generations of immigrants have found their place in society, Germany has become more prosperous and racism is no longer \"socially acceptable\" in the way it was back then, he said. \n \nOrdinary Germans have been pitching in lately to help refugees. Many went over the weekend to Munich's main station, bringing everything from water to toiletries, as trains with refugees arrived. On Sunday, police tweeted that no more donations were needed at the station, then called for people to donate men's clothing and shoes to a city refugee shelter. Within three hours, no more of those were needed either. \n \nChancellor Angela Merkel says she is \"proud and grateful to see how countless people in Germany are reacting to the arrival of the refugees.\" \n \nThese days, politicians stress that the boat isn't full - in fact, it threatens to get worryingly empty due to a demographic crisis brought on by a low birth rate. Increasingly, leaders portray the wave of migrants as an opportunity for Europe's biggest economy. As it stands, deaths outpace births, and the government's statistical office said earlier this year that it expects the population of 80.8 million to shrink by a tenth or more by 2060. \n \n\"We are a country of immigration. We need people. We need young people. We need immigrants,\" Interior Minister Thomas de Maiziere told visitors to a recent government open day event. \"All of you know that, because we have too few children.\" \n \nOliver Junk, the mayor of Goslar in central Germany, has drawn attention by saying that his town of 50,000 - with a dwindling population and empty housing - could take in more refugees. He argues that \"towns like Goslar have no chance without a long-term influx\" of people. \n \nDe Maiziere's description of Germany as a \"country of immigration\" would have been hard to imagine from a leading conservative politician only 15 years ago. \n \nA bitter 1999 state election campaign centered on a conservative drive against allowing dual citizenship for many residents with foreign roots. The following year, an unsuccessful candidate to be governor of Germany's most populous state used the slogan \"Kinder statt Inder,\" or \"children, not Indians\" to argue that Germany should step up its own education rather than bring in foreign computer experts. \n \nPoliticians' response to rising asylum applications in the 1990s was \"too many are coming, we'll solve the problem by limiting the right to asylum, then it's dealt with and everyone can sleep easy,\" said Orkan Kosemen, an expert on integration at the Bertelsmann Foundation think-tank. When refugee centers were attacked at the time, there were candlelight vigils and help campaigns but \"the majority was indifferent,\" he said. \n \nAn immigration law approved in 2004 sought to balance Germany's need to attract qualified migrants with concerns about matters such as their integration, mandating government-funded German language and civics courses for newcomers. \n \n\"Germany has changed mentally in the past 20 years,\" Kosemen said. Immigration has become a less polarizing issue and is no longer considered an exception as it was in the 1990s, he said. \n \nMerkel herself acknowledges that a large population of people with foreign roots has gradually changed Germany, and that the term \"guest workers\" stuck for too long as a term for Turks and others recruited by West Germany as the economy boomed in the 1960s. Many put down roots, and \"fortunately we have for some time come around to seeing that they are our fellow citizens, of whatever origin.\" \n \n\"The fact that the third or fourth generation is living with us has changed our country,\" she said. Then-President Christian Wulff declared in 2010 that Islam is part of Germany, and Merkel reiterated last week that \"of course it now belongs in Germany.\" \n \nOver recent years, even the World Cup-winning national soccer team has become a symbol of a more diverse Germany, with Merkel describing it as an example for the successful integration of immigrants, as ethnic Germans like Bastian Schweinsteiger and Thomas Mueller played alongside stars such as Mesut Ozil, with Turkish roots, and Sami Khedira, whose father is Tunisian. \n \nStars from the national team have appeared in a video this week to promote tolerance, and leading soccer clubs have joined the effort to help. National champion Bayern Munich is organizing a training camp for migrant children, for example, and Mainz invited hundreds of migrants to its games. \n \nMeantime, many other Germans are doing what they can to pitch in to help migrants. \n \nIn Berlin, when film producer Gian-Piero Ringel heard that migrants were standing in long lines for days to register with authorities overwhelmed by the flood, he organized movie-set caterers to provide them with food and drinks. \n \nSonja Meyer, 26, a trainee teacher, said hundreds of migrants have arrived at a reception center in hear eastern Berlin neighborhood. A local group that helps refugees didn't need any more help, so she took toiletries and diapers to the refugees. \n \n\"Of course there are also people who are hostile and say they'll ruin our fences if they lean against them,\" she said. \"And I have a few friends who say poor Germans should be taken care of first, and I find that terrible. ... But most people are helping wonderfully. They are taking refugees into their apartments, offering them rooms and having barbecues for the refugees.\" \n \n___ \n \nKirsten Grieshaber contributed to this report.", "source": "Chicago Daily Herald"}