{"published": "2015-09-01T22:59:00Z", "media-type": "News", "title": "Metro police say 'bump and rob' technique on the rise", "id": "08679f4f-0b8b-452b-8cca-4cb538993417", "content": "NASHVILLE, TN (WSMV) - \n\nPolice said they have noticed a reemerging trend where criminals intentionally run into the back of a victim’s car.\n\nSgt. Rafael Fernandez with Metro police spoke to the church at Woodbine’s Joy Club on Tuesday about the topic.\n\n“I’d like to talk to everybody about the bump and rob,” Fernandez said. “Has everybody heard of the bump and rob?”\n\nPolice said the bump and rob is when criminals purposely run into the back of a victim’s car. When it’s time to exchange information, the thieves then rob them and often take their car.\n\n“Another situation is where they pull out in front of you really quickly, hit the brakes and then you hit them,” Fernandez said.\n\nPolice don’t want to alarm people. At the South Precinct, they have had two or three victims of the technique, but not enough to send out an email warning the public.\n\n“You’re already upset and you’re already like … I hope they have insurance,” said Akeylah Robinson, a victim of bump and rob. “But then you have to worry about is this person going to rob my car? Which is really scary.”\n\nA few months ago, Robinson left her car running when it was stolen and used in a bump and rob.\n\n“He actually used my car to hit another family, a husband and wife and two small children, in the back,” she said. “From what I heard, at gunpoint told them to get out of the car, fired the gun and took their vehicle. And used it in another wreck.”\n\nFernandez said drivers should be aware of their surroundings.\n\n“Lower the window a little bit. Lock your doors,” he said. “Evaluate, see if these people are quick to rush to your car. If they have something in their hands, like a weapon, then you want to leave there right away.”\n\nIf there are children in the car, let the other driver know.\n\n“At least put it out there and let them know,” Fernandez said. “I’ve got a child in the car. You take my child, you’re talking kidnapping.”\n\nPolice said most importantly, do what the thieves ask. Chances are good police will find the stolen vehicle.\n\nPolice have already solved a bump and rob that happened last week on Bell Road.\n\n“We want people to keep things in perspective,” Fernandez said. “We want everybody to be safe. It’s property, you can get that replaced.”\n\nPolice said as soon as they are in a fender bender, drivers should write down the license plate number and a few things about the occupants of the other vehicle. If they are approached by someone with a weapon who appears agitated, police said drivers should leave their keys and purse in the car, get out quickly, and leave the area immediately.", "source": "WMCTV.com"}