{"published": "2015-09-30T02:59:25Z", "media-type": "News", "title": "Redgranite Quarry will stay open", "id": "42798330-121c-48cc-a4ff-ad1fc24e1a0c", "content": "Buy Photo \nDan Powers/Gannett Wisconsin Media\nYoung people gather at the Redgranite Quarry, a popular summer swimming destination. ?You can?t climb trees. You can?t put up ropes,? Redgranite Fire Chief Jim Angelo said of efforts to keep the quarry safe.\nYoung people gather at the quarry Tuesday, August 18, 2015, in Redgranite, Wis. \nDan Powers/Post-Crescent Media (Photo: Dan Powers/Post-Crescent Media, Dan Powers/Post-Crescent Media) Buy Photo \n\nThe Redgranite Village Board resolved Tuesday to keep Redgranite Quarry Park open after discussing the matter at a special meeting prompted by recent calls to close the park after three people died there this summer. \n\nAfter emerging from closed session, board members said the quarry would remain open, with increased fines for violations and more signs warning of the danger of swimming in the quarry. The board did not vote to keep the quarry open, but will decide on specific measures at a future meeting. \n\n“The city has committed to keeping this open for people to swim in,” said board member Paul Wertz. \n\nThe village went into closed session for nearly an hour, citing protection from an exemption in Wisconsin Open Meetings law that allows municipalities to meet to discuss ongoing or likely lawsuits. \n\nPersonal Injury Attorney Mike Siddall of Fox Valley firm Herring Clark has requested police reports and other documents related to the death of Alaya HauChee Lo, who drowned at the quarry in June. Siddall did not return messages seeking comment Tuesday. Wertz said the board isn’t aware of any litigation in progress. \n\nBoard President Jerry Sieg said a committee will be created next spring to draft safety measures such as new signs, Facebook calls for safety and a beefed-up police presence. \n\nSieg said the board took into account requests from Redgranite residents, who want the quarry to remain open. \n\n“People enjoy it and the majority of people that live in Redgranite are for it,” Sieg said. “And we kind of go by our constituents.” \n\nAbout 20 people attended a village board meeting Sept. 15 to voice concerns about the quarry’s safety after a Post-Crescent Media editorial called for the closure of the quarry. An earlier Post-Crescent Media story found that 19 people have died there since 1979. \n\nDuring the meeting, Sieg said police have issued more than 125 citations at the quarry between Jan. 1 and Aug. 31, including more than 50 tickets for possessing alcohol on quarry grounds, and another 24 citations for underage drinking. \n\nMost recently, Illinois resident Marquis Hough drowned at the quarry over Labor Day weekend. Redgranite officials cleared the quarry after he went missing on Sept. 6. His body was recovered the next morning. \n\nRedgranite Police Chief Kyle Tarr said police have not yet received Hough’s toxicology results from the Fond du Lac County Medical Examiner, or results from this year’s second victim, Daniel Whitmore of Green Bay, who drowned at the quarry on Aug. 12. \n\nJohn Kroll, a lifelong Redgranite resident, attended Tuesday's meeting and said he’s “satisfied with the board’s decision to keep the quarry open. \n\n“I grew up here,” Kroll said. “I hear everybody saying, they’re making money on (the quarry). Nobody’s making money on it. And the alcohol’s coming from outside.” \n\nNate Beck writes for Oshkosh Northwestern Media.  \n\nRead or Share this story: http://post.cr/1FCzZ1Y", "source": "Post Crescent"}