{"published": "2015-09-22T03:00:32Z", "media-type": "News", "title": "John Key says Kiwis have sympathy for a Kiribati man facing deportation", "id": "d969e80b-6b4a-4cda-ba5c-18c46b0fbd39", "content": "PM: Climate change refugee an overstayer \n             \nA Kiribati family due to be deported from New Zealand on Wednesday have no future back in the Pacific Island, says an advocate fighting to keep the family here. \n \nReverend Sumalie Naisali and members of the Kiribati and Tuvalu communities presented a petition to Labour and Green Party MPs on Tuesday calling for Ioane Teitota to remain in the country. \n \nTeitota has been in custody in Mt Eden Prison after his bid to claim climate change refugee status was dismissed last week. \n \nHe was arrested by police and immigration officials at his West Auckland home on Tuesday morning for overstaying his permit. \n \nAssociate Immigration Minister Craig Foss is yet to receive a briefing on the case, which is now being appealed on humanitarian reasons. \n \nFoss is expected to receive the briefing and make a decision on deportation by the end of Tuesday. \n \nPrime Minister John Key has called Teitota an \"over-stayer\" and said while Kiwis \"feel for the guy\" his case is not \"unique\". \n \n\"If people were being forced out becasue of rising sea levles then I'd say it's a valid case but it's not like he can't return, he's an over-stayer.\" \n \nNaisali said there were no employment opportunities for the parents or education opportunities for their three children. \n \n\"The wife is a teacher here in New Zealand and the chidlren are learning here in New Zealand. \n \n\"For them to go back is just like putting someone on dialysis on a plane to fly to Fiji and something will happen to him on a plane,\" he said. \n \nNew Zealand and Australia must take climate change seriously and do more for smaller Pacific Island nations, Naisali said. \n \n\"I think it's about time for us to stand up and say 'please do not make fun of this issue of climate change'. It's real and you must do something.\" \n \nHis comments come on the back of Australian Immigration Minister Peter Dutton being caught on tape joking about low-lying islands being swamped by rising seas. \n \nThis was only days after the Pacific Islands Forum in Papua New Guinea, where climate change was a key focus. \n \nFoss said the decision-making process could slow down Teitota's deportation, scheduled for Wednesday afternoon. \n \n\"I have to make decisions like this every other day actually, some can be difficult but I have to abide by the rules that I have,\" he said. \n \n    \n \n    \n      \n    \nKey said the man's family situation and a plea to be allowed to stay on humanitarian grounds was a different issue to that of climate change.  \n \n\"I, as an electorate MP sometimes do advocate for people, who have come to my electorate office for exactly those reasons; they're well ensconced in New Zealand, they're probably really good New Zealanders.  \n \n\"But the only problem is we have a set of rules that say, you have to stick to those rules because basically the wheels fall off because everyone goes around the system,\" he said. \n \n\"But I don't think that claiming he's a refugee based on climate change, that that's a credible argument.\"  \n \nThat may become a valid argument in the future, Key said. \n \n\"We can't rule out what's going to happen 30, 40, 50 years from now. But some of the scientists are certainly predicting quite a rise in sea levels, and if that's the case then it will challenge those low lying states and we understand that.\" \n \nLabour leader Andrew Little said the Government needed to set up a framework to deal with the issue of climate change in the Pacific Islands. \n \n\"We'll need the help of Australia, we'll need the help of other Pacific nations to do that.\" \n \n\"One of the promises we made for our seat on the Security Council to Pacific island nations is 'we will help you on climate change issues.' \n \n\"That's got to be real,\" he said. \n \nLabour MP for Te Atatu Phil Twyford is advocating on behalf of Teitoa and will collect a petition at Parliament on Tuesday calling for him and his family to be allowed to stay in the country. \n \nTwyford said the Government needed to \"get real\" about climate change because \"it's happening\". \n \n\"I've asked Minister Craig Foss to intervene in this decision, as he's able to do on humanitarian grounds, to allow this family to stay.\" \n  \n ", "source": "Nelson Mail"}