{"published": "2015-09-15T12:00:43Z", "media-type": "Blog", "title": "Protecting The Work", "id": "7c388005-daef-4af5-878c-1152c763353e", "content": "[caption id=\"attachment_13287\" align=\"alignright\" width=\"300\"] Image Credit Victoria Henderson https://www.flickr.com/people/behind-the-lense/[/caption]\nIf you’ve read any writings on writing, I’m sure you’ve seen some variation on the theme “protect the work”.  Successful writers carve out time to write and guard that time as sacred.\nYes of course you think as you read it. How will I ever become a writer/meet my writing goals if I don’t sit down and WRITE? Turns out in practice, that’s harder to execute. I don’t know about you, but as a working mom who is also trying to complete the first draft of her novel, I juggle so many balls, it’s hard to execute that protection order. \nBut, sometimes? Sometimes I am my own worst enemy. I could protect the work, but I don’t, not because I don’t want to, but because I don’t believe in the value of what I’m doing. That’s PAID work, it MUST come first. Surely that non-profit organization needs my time and efforts more than my silly little story. My brain is a manipulative witch sometimes. I know my strengths and when a client, or group I belong to needs me to fill a role that plays to my strengths instead of protecting the work, I say yes. It’s the path of least resistance and it’s instant gratification. I’ve got a decent track record in marketing, communications and event planning. So I’ll do those for the positive strokes rather than toil on my writing where it’s a long, lonely and uncertain road.  Don’t get me wrong, I have lots of support but no one can get THIS story down on paper but me. \nThis all came to a head recently. I feel strongly that non-profits are can be only truly successful when all members contribute. This particular commitment had changed in a way I hadn't anticipated. As I planned out my day in my head, I realized that in order to address this change, I was going to have to sacrifice my writing time. That stopped me in my tracks. I’ve been on a roll lately, adding on average 1,000 words a day to my WIP 4-5 days a week. To some that seems a paltry sum, but to me, it’s a fantastic amount. More important to me was the consistency. I was loathe to break that streak. \nIt was a weird feeling to put MY work first, but I did it and in the end, it was the right decision for me. You know what? The world won’t end and my novel is one step closer to getting finished. \nI realized that as often as I’ve heard “protect the work”, I was still waiting for some magical superhero to come in and guard my writing time, or for someone else to say \"no you can't do that, you have to write\". Heh, turns out, *I* have the super powers. *I* protected the work. \nI did it this time, but I’m not naive.  There will be other times and other challenges. Knowing my personality, I’m always going to need to suck it up and say “but this matters to ME.”  As a matter of fact, if you’ll excuse me, I have some words to write.\n\nIs protecting the work easy for you, or is it a challenge?", "source": "Live to Write - Write to Live"}