{"published": "2015-09-23T14:10:35Z", "media-type": "News", "title": "Vepica Names Derek Blackwood New CEO", "id": "db503684-ec9b-4947-b3e1-1c0d2ef0851b", "content": "Energy industry veteran to take helm of international engineering firm  \nPR Newswire \n \nHOUSTON, Sept. 23, 2015 \n   \nHOUSTON , Sept. 23, 2015 /PRNewswire/ -- Vepica Grupo Internacional ( Vepica ), a leading energy-industry engineering, procurement and construction firm and an ENR Top 225 company, today named former Wood Group executive, Derek Blackwood O.B.E ., as its new chief executive officer. Blackwood takes over for Miguel Bocco, Jr. who will continue to serve as chairman of Vepica's Board of Directors. \n\n\"We're thrilled to have Derek on board and at the helm at this important time in our company's history,\" said Bocco. \"We've had a chance to work closely with Derek in the past and know the value that his leadership and experience will bring to Vepica and our continued expansion,\" he added. \n \nBlackwood has more than 40 years of experience in the energy industry, most recently leading Wood Group's Engineering and Production Facilities in North and South America . He began his career as a student apprentice with BP Tanker Company and has held a variety of roles within the oil and gas industry, including positions with John Brown Engineering, Marathon Oil UK, and APG/Salamis JV prior to joining Wood Group Engineering as Managing Director in Aberdeen in 1996. \n\nA registered Incorporated Engineer with the Engineering Council (UK), and a Fellow of the Institution of Mechanical Engineers, he was appointed O.B.E. in the 2007 New Year Honour's list and is a member of the Energy Institute; a director of Shawcor Ltd, a non-executive director of WFS Technologies and President and director of the BABC in Houston . \n \nVepica is differentiated by its depth of experience, well-honed processes and state-of-the-art technologies. With offices across the world and an international partnership network, Vepica provides the infrastructure and proficiency to support today's most demanding customers. \n \nAbout Vepica \nIncorporated in Spain , and with operations in Canada , China , Colombia , Mexico , the U.S. and Venezuela , privately held Vepica is a multinational engineering, procurement and construction firm specializing in the energy industry. Named among the (ENR) Top 225 International Design Firms for three consecutive years from 2013 to 2015, Vepica provides EPC, engineering, inspection/O&M and environmental services to the oil and gas, alternative energy, chemical, power generation, infrastructure, transportation, mining and telecommunications industries. Founded in 1972, Vepica today has over 2,000 employees and counts more than 37 million man-hours and 3,500 engineering projects on four continents to its credit. For more information, visit Vepica.com. \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/vepica-names-derek-blackwood-new-ceo-300147781.html \n\nSOURCE  Vepica", "source": "Reuters"}