{"published": "2015-09-21T00:39:44Z", "media-type": "Blog", "title": "Hemudu Culture", "id": "981d477d-469f-4b90-906d-214d63506beb", "content": "Hemudu Relics, a neolithic cultural site located in the lower reaches of Yangtze Valley, got its name after that of Hemudu Town in Yuyao city of Zhejiang Province where the site was initially discovered. Hemudu Culture has been verified to range from 5000 B.C. to 3300 B.C.\nLiving utensils of Hemudu Culture mainly consist of pottery vessels, with a few wooden wares as supplementary. Stone tools are mostly ground artifacts but with little delicacy. In contrast, the making of bone wares reaches certain height. Some are even carved with exquisite patterns to be featured in both practicability and aesthetics. In agriculture, rice was planted to facilitate the possibility of storing up surplus grain, which led to the discrepancy between the rich and poor. Thus a new phase of civilization development unfolded itself. Besides, the primitive spinning wheels, bone needles and ceramics engraved with cloth lines have been unearthed, which reflect the progress of weaving skills in that period. Decorative objects made of jade and fluorite materials are in great variety and with refined craftsmanship, representing the level of neolithic culture. The red-lacquered bowl uncovered here, with a history of 7,000 plus years, is the earliest lacquer ware in China.\nThe inhabited areas in the age of Hemudu Culture were in the form of all-sized villages. Plenty of house foundations have been found at the relics, which deliver the message that the architecture at that time was mainly in stilt style. It is one of the important architectural forms in the south of the Yangtze River since the neolithic age and is enormously different from the half-crypt houses in north China in the same period. Up to date, Hemudu boasts the earliest stilt houses ever.\nHemudu Culture, not similar to Yangshao Culture of the Yellow River Valley, represents the civilization of Yangtze Valley in south China as another major thread going through the development of ancient Chinese culture. The discovery of Hemudu Relics has proved the fact that Neolithic culture situated in lower reaches of Yangtze River also serves as a principal origin of Chinese civilization.\nDetails Study of Hemudu Culture\nBone Ware\nThe production technique of bone ware in Hemudu Culture of the Neolithic Age is relatively advanced, boasting elaborately-made tools in the shape of spade-like plough, harpoon, arrowhead, whistle,...\nRice Culture\nThe social economy of Hemudu Culture features mainly cereal agriculture, while integrating the activities of animal husbandry, picking, fishing and hunting. Vestiges of paddies, chaffs, wheat...\nEarthen Bowl with Pig Pattern\nEarthen bowl with pig pattern is a piece of rectangle, round-cornered and flat-bottomed pottery carved with pig patterns on two faces of the outer bowl.\nStilt-style Architecture\nLarge numbers of stilt-style architecture relics are excavated in Hemudu Site.\nPrimitive Textile Industry\nThe weaving tools excavated from the Hemudu Site are abundant, especially the spinning wheels, 300 odd in number.\nTooth Sculpture\nThis bird-shaped tooth full-round sculpture is one of the first tooth sculptures in China.\nBird-Shaped Wine Utensil\nUnearthed from Hemudu site culture (Layer 2), it has a long history of 5500-6000 years.\nPottery Spindle\nUnearthed from the Hemudu sites, the pottery spindle fully demonstrates that people in Neolithic period has already master the spinning technique.\nPottery Kettle\nUnearthed from Hemudu site, the pottery kettle is made of charcoal-mixed black pottery.\nWooden Oars\nIn remote antiquity, most people lived by rivers and lakes.\nPottery Pig\nApart from rice farming, stock raising was also carried out on a fairly big scale by Hemudu Clan with pigs, dogs and buffalos being the main domestic animals.\nWhy Hemudu Culture Is Important to Early Neolithic Studies\nThe history of the Hemudu culture is extremely important to the study of early Neolithic cultures and the origins of rice cultivation.", "source": "CHINA TRAVEL TIPS"}