{"published": "2015-09-15T00:21:59Z", "media-type": "News", "title": "Verizon and Cognizant join forces to help clients digitally transform and innovate", "id": "929ef607-855c-47a4-a9e0-fa21583d38da", "content": "Media releases are provided as is and have not been edited or checked for accuracy. Any queries should be directed to the company issuing the release. \n\nCompanies will work to define, design, deploy and manage new technology solutions that advance the digital business models of their customers \n\nMELBOURNE—September 15, 2015.  Verizon and Cognizant (NASDAQ: CTSH) today announced they are joining forces to accelerate the delivery of leading-edge, technology-based solutions to enterprise clients. \n \nTogether the companies will work with organisations to define, design, deploy and manage new technology solutions that advance the digital business models of their customers. Cognizant and Verizon will provide enterprise clients with a set of high performance, reliable solutions focused on digital transformation, integration and business process support, technical expertise, networking and other solutions. \n \nAs part of this alliance, joint customers will be able to experience large-scale technology demonstrations at Verizon’s Innovation Centers in San Francisco and Waltham, Mass. that will be powered by a new test-bed lab the companies are building. The lab and its technology will enable clients to visualise enterprise-scale projects versus simply viewing and testing point technology offerings. \n \nThe companies will leverage their extensive experience in helping clients build the digital infrastructure that integrates social, mobile, analytics, cloud and sensor technologies used to power the Internet of Things. \n \n“Together with Verizon, we are showcasing the art of the possible and can offer integrated business and technology solutions that improve user experiences,” said Rob Calloway, vice president, customer relationship management solutions leader at Cognizant. “Seeing your business through your customer’s eyes requires in-depth understanding of how and where data is generated and how to make meaning from that data to understand customers’ behaviours, interests and desires.” \n \nThe organisations will put their expertise to work in serving clients in the retail, manufacturing and logistics, insurance, banking and financial services, and healthcare industries. \n \n“Verizon is focused on delivering excellence in technology to our clients underpinned by our world-class networks,” said Adam Famularo, vice president of Global Channels for Verizon Enterprise Solutions. “Our relationship with Cognizant is one more example of how we are enabling our clients in today’s digital economy to take advantage of leading advancements in technology.” \n \nLook for Verizon and Cognizant at the Salesforce.com Dreamforce conference from September 15 through 18 in San Francisco. Verizon will be co-located in Cognizant’s booth #W400.    Visitors can see and experience the capabilities that the two companies are bringing to clients. \n \nVerizon Enterprise Solutions helps clients improve customer experience, drive growth and business performance and manage risk. With industry-specific solutions provided over the company's secure mobility, cloud, strategic networking, Internet of Things and advanced communications platforms, Verizon Enterprise Solutions helps open new opportunities around the world for innovation, investment and business transformation. Visit www.verizonenterprise.com to learn more. \n \nAbout Verizon \n \nVerizon Communications Inc. (NYSE, NASDAQ: VZ), headquartered in New York, employs a diverse workforce of 178,500 and generated more than $127 billion in 2014 revenues. Verizon Wireless operates America’s most reliable wireless network, with 109.5 million retail connections nationwide. Verizon also provides converged communications, information and entertainment services over America’s most advanced fiber-optic network, and delivers integrated business solutions to customers worldwide. For more information, visit www.verizon.com/news/. \n \nAbout Cognizant \n \nCognizant (NASDAQ: CTSH) is a leading provider of information technology, consulting, and business process outsourcing services, dedicated to helping the world's leading companies build stronger businesses. Headquartered in Teaneck, New Jersey (U.S.), Cognizant combines a passion for client satisfaction, technology innovation, deep industry and business process expertise, and a global, collaborative workforce that embodies the future of work. With over 100 development and delivery centers worldwide and approximately 218,000 employees as of June 30, 2015, Cognizant is a member of the NASDAQ-100, the S&P 500, the Forbes Global 2000, and the Fortune 500 and is ranked among the top performing and fastest growing companies in the world. Visit us online at www.cognizant.com or follow us on Twitter: Cognizant. \n \nVerizon Enterprise Online News Room: News releases, blog posts, media contacts and other information are available at Verizon Enterprise Solutions News & Insights (news.verizonenterprise.com). News from Verizon Enterprise Solutions is also available through an RSS feed at http://www.verizonenterprise.com/rss-options/. \n \nContacts \n \nCognizant: \nAsia-Pacific, \nHarsh Kabra. \n+91-855-188-2111 \nharsh.kabra@cognizant.com \n\n \nVerizon: \nJanet Brumfield. \n+1-614-582-9636 \njanet.brumfield@verizon.com", "source": "CMO"}