{"published": "2015-09-21T17:37:47Z", "media-type": "News", "title": "Adams says covering Swift's '1989' was 'incredibly humbling'", "id": "eb4ab581-92a4-4e0c-8ff0-8c486455a87e", "content": "Rocker Ryan Adams said covering Taylor Swift's entire \"1989\" album was \"incredibly humbling\" and helped him explore himself more deeply as a musician. \n\nAdams' version of \"1989\" was digitally released Monday. Swift released the original album — her first full-blown pop record — last October. \n\n\"It's actually incredibly humbling to find a connection with someone else's words and someone else's songs and to open yourself up and to feel them fully, and find out where those stories take you,\" Adams, 40, said in an interview last week. \"It felt no less genuine than any song I've ever written for myself.\" \n\nSo far, Swift's fifth album has sold 5.2 million units and launched multiple hits, including No.1s like \"Shake It Off,\" \"Blank Space\" and \"Bad Blood.\" Adams' interpretation of \"1989\" offers a slowed-down take on her upbeat anthems. \n\n\"I got to work different parts of my brain, different parts of my heart and different parts of the musical aspects of my personality,\" Adams said of covering Swift's music. \"It's really its own thing. ...It's not the same record.\" \n\nAfter completing his version, the singer-songwriter-producer played it for 25-year-old Swift before taking it any further. He namedropped Bob Mould as one his favorite musicians, but added in the same breath: \"But then I also love all those songs on (Swift's) 'Fearless' (album). I don't really have a place where my music begins and ends.\" \n\nAdams said he has known Swift for about 4 years and counts himself as a fan. \n\nAdams released his debut album, \"Heartbreaker,\" in 2000. His 2014 self-titled record, his 14th studio release, earned him two Grammy nominations earlier this year, including best rock album. He has also found success as a producer for acts like Willie Nelson and Jenny Lewis. \n\nAdams says in 1989 — the year, not the album — he remembers being in love with music and being aware he wanted to make a career out of it. \n\n\"I was already collecting albums. By 15, I was skateboarding, I had gotten my first guitar,\" he said. \"I had my first record player and I remember I got my first couple of real albums that were my own records and I was really excited about them.\" \n\n---- \n\nOnline: \n\nRyan Adams: http://paxamrecords.com/", "source": "Bellingham Herald"}