{"published": "2015-09-27T04:37:00Z", "media-type": "Blog", "title": "Puzzled Alphette, Family Time", "id": "82c0c1d4-45b1-4861-b880-c414de299948", "content": "I took the Man to his event this morning, which was a grueling miles-long loaded-rucksack hike with other vets. I really like the fact that he does stuff like this--challenges himself, stays fit, gets with his tribe, recharges himself in that way. I dropped him off and awaited him at the end hours later, armed with a sandwich and a lot of cold beer. He was exhausted and happy, that place you get into when you've done something that really challenges you and completed it, brought out the best of yourself. I could tell he was in a pretty deep space so I suggested that he go home and rest and let himself soak in the experience tonight. \nOn the way to drop him at his car, he informed me--in that funny way he does--that he'd had a lot of time to think on the hike, and presented me with a multilayered theory of what's going on with my life, how I haven't retained a boyfriend because I'm type A and they get freaked out (? I'm not sure if I remember correctly that that's what he said. In my own opinion, I just tend to wander away from guys who aren't nice, since I don't tend to volunteer a lot of information about myself in dating and it would therefore not usually be known that I have so many things going on unless you've known me for quite a while. I tell him things, but that's because he asks.) He also presented some thoughts and theories about my business, as well as letting me know that he's worried I don't sleep or eat enough. \nI was genuinely touched, surprised and amused, as I would think that on a miles long loaded rucksack hike, you'd mostly be thinking about how to get up the next hill, or where the next bathroom was, stuff like that. But, he is like that, he operates on multiple tracks. Perhaps contemplating the eccentricities of my life got his mind off the pain, eh? I have to admit that I didn't really manage to take it all in, as I was captaining a short drive in dinner hour traffic and the theory he presented was baklava-like in its complexity. I'm sure I'll hear more about it if he thinks about it some more and wants to continue. \nThen I went and had dinner with part of my adoptive family, the Flynn sisters; so good to see them and I'm giving the younger a Feldenkrais lesson tomorrow, something I used to do regularly as part of caring for three generations of their family. I've been invited to Albuquerque for a Flynn Christmas, and I'm thinking about doing it; somehow that 10 or 12 hour drive through northwest Texas is one of the magical spaces that seems to open up time. The last time I did it--to visit the Flynn brother and his wife, actually--I remember stopping at a big field full of tumbleweeds blown high against blackened wire fencing, just standing there for a long time, touching the thorny balls with my fingers, looking out over the amber and grey North Texas plains, traffic whizzing by on the road at my back. \nI always remember the way the long trains stretch into the curve of the desert for miles, the way it feels to drive alongside them into what feels like eternity; the lonely vastness of magical New Mexico space, earth meeting sky. It's a long drive, one through strange and haunting country; one I've done many times, but not in a while. It feels like I disappear out there, into some kind of ether between realms. \nSo that was today, the Man conquering with his tribe, me the puzzled alphette, family time, thoughts of the road. ", "source": "Flying Into the Light"}