{"published": "2015-09-17T15:53:00Z", "media-type": "Blog", "title": "Dangerous anti-vaccine comments spin out of control at second GOP debate", "id": "54f020a6-d62c-4f43-99d4-78a36ce94396", "content": "During last night's Republican presidential debate, moderator Jake Tapper took the opportunity to ask about the bad science espoused by another of his fellow candidates. Specifically, Tapper referenced Donald Trump's history of drawing a (completely false, by the way) connection between vaccination and autism and opened the topic for discussion — whereupon the audience was subjected to a truckload of scientific illiteracy. \n \nMore : Dear anti-vaxxers: Stop using autism as a bogeyman \n \nMost disappointing of all was the response from the two medical doctors on the stage. Dr. Ben Carson, to whom the initial question was posed, avoided flat out saying that Trump is wrong and waffled a bit, stating that no connection between vaccination and autism had been proven — and then began digging himself a hole, talking about how only certain vaccines are really important and others aren't such a big deal. Which vaccines are those, Dr. Carson? We're all very curious. Dr. Rand Paul tried to set up a false dichotomy between vaccination and freedom (kids being able to enjoy freedom from measles exposure apparently doesn't register). And of course, the Trump himself doubled down on his anti-vaccine sentiments, insisting that vaccination has caused an autism \"epidemic\" and that the current immunization schedule is somehow dangerous. \n \nThe fact is that an autism epidemic does not exist — we simply have better tools to diagnose children now and a broader definition to diagnose them by — and study after study has demonstrated that there is absolutely no link between autism and vaccination. Let's be totally clear on this, in the exact opposite of how the debaters discussed it last night: zero. Zip. Zilch. \n \nMore : A Democrat's hilarious reenactment of the second GOP debate \n\n \nBut while vaccines don't cause autism, anti-vaccine sentiment does cause problems. Every person who chooses to not vaccinate after hearing politicians regurgitate scientific untruths is exposing their children to a host of preventable — and often dangerous — diseases. \n \nThere were nearly 150 pediatric flu deaths in 2015; is the flu vaccine one of those unimportant ones Carson is suggesting don't really matter? In 2012, 4,000 women died of cervical cancer . Is that no big deal either, even if many of those deaths could have been prevented with the HPV vaccine? And how about the 145,000 deaths caused by measles around the world last year? Most of these deaths occurred in developing nations, but it's disingenuous to suggest that measles deaths should be ruled out here at home, with dropping vaccination rates and surging outbreaks. And short of death, a measles infection can cause pneumonia, encephalitis and brain damage. And those are proven (and frequent) complications, by the way, unlike the imaginary link between vaccination and autism. \n \nMore : How to change skeptical parents' minds about vaccines \n \nFor a group of people to use a platform this large to espouse wildly inaccurate and dangerous viewpoints is obscene — especially with two doctors who should know better on the stage. It's also not very surprising, if touting anti-vax nonsense happens to be politically expedient. And we're not the only ones who think so: Just ask the American Academy of Pediatrics , which released its own \"please don't pay any attention to these knuckleheads\" statement to counteract all the nonsense spewed on CNN last night, noting: \n   \n“There is no ‘alternative’ immunization schedule. Delaying vaccines only leaves a chil​d at risk of disease for a longer period of time; it does not make vaccinating safer. \n \n“Vaccines work, plain and simple. Vaccines are one of the safest, most effective and most important medical innovations of our time. Pediatricians partner with parents to provide what is best for their child, and what is best is for children to be fully vaccinated.” \n   \nParents, don't get your medical information from presidential debates: Get it from the CDC (you know, that organization these candidates want to slash funding to?) or from a doctor who's not running for president. And we can all cross our fingers that maybe four years from now, we'll see a candidate whose platform is to make sure all citizens have at least a fundamental level of scientific literacy.", "source": "What's New"}