{"published": "2015-09-03T19:04:16Z", "media-type": "News", "title": "Brand USA and CNTA host U.S., Chinese tourism officials for the ninth annual U.S. - China Leadership Summit", "id": "1ea1996f-0689-4b2a-bd3c-562c629bdb47", "content": "SOURCE Brand USA \n\nParticipants to discuss joint effort for expanding tourism between the two countries at forum in Los Angeles, California\n\nWASHINGTON \n\nFor the first time, Brand USA -- the destination marketing organization for the United States -- is taking the lead role to plan the annual summit with the China National Tourism Administration (CNTA). The premier sponsors for this year's event are Visit California and the Los Angeles Tourism & Convention Board (L.A. Tourism).\n\n\"Tourism continues to be a powerful driver for ushering in a new era of cooperation between the U.S. and China \n\n\"Visit California is honored to be part of this remarkable gathering of tourism and government leaders and to have the opportunity to showcase our Golden State for millions of potential tourists,\" said Caroline Beteta \n\nIn addition to California's \n\n\"We value the Chinese market, and as one of the world's premier travel destinations, there's no better setting than Los Angeles \n\nChina \n\n\"The increasing flow of Chinese tourists to the U.S. translates into substantial economic impact,\" Thompson said. \"Chinese visitors spend on average $6,000 \n\nThompson also said: \"The summit is a tremendous opportunity to discuss strategies for joint marketing by the U.S. and China \n\nIn November 2014 \n\nThe 2015 summit will feature the concurrent annual meeting of the tourism working group of the U.S.-China Joint Commission on Commerce and Trade (JCCT). The JCCT is a government-to-government forum to address bilateral trade issues between the United States \n\nThe first U.S.-China Leadership Summit was held in 2007, in Charlotte, N.C. \n\nU.S. Travel Association, a national advocacy group that promotes U.S. tourism among policymakers, initiated the summit in coordination with CNTA. After having prime responsibility every year for planning the summit on behalf of the United States \n\nAbout Brand USA\n\nBrand USA \n\nFor industry or partner information about Brand USA \n\nAbout Visit California\n\nVisit California \n\nAbout Los Angeles Tourism & Convention BoardLos Angeles Tourism & Convention Board is a private, non-profit business association whose primary mission is to market and promote Los Angeles \n\nMEDIA CONTACT:\n\nCamila Clark \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/brand-usa-and-cnta-host-us-chinese-tourism-officials-for-the-ninth-annual-us---china-leadership-summit-300137848.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WDAM-TV"}