{"published": "2015-09-05T11:31:00Z", "media-type": "Blog", "title": "Selfie number 1", "id": "b215d1cc-a577-43d8-88e0-57fca7d01c46", "content": "So here it is - my number one 'selfie' - a picture of me alongside the legendary Apple Computer inventor Steve Wozniak. I happened to wander into the speaker's lounge during a learning technology conference in Riyadh, Saudi Arabia, and there he was, sat preparing to give his keynote. I kind of knew he would be there, because he was scheduled to keynote the conference that morning, and it was the place all speakers prepared before they took to the stage. There was no-one else in the room at the time, and I walked over to introduce myself. He stood up and shook my hand, and then we sat down and enjoyed a one-on-one conversation that lasted about 10 to 15 minutes before anyone else came into the room to interrupt. My conversation with him is captured here. I asked him about the early days of Apple and his first meeting with Steve Jobs. He told me they knew nothing about what they were doing when they first set up the companym, except that their roles were clearly defined. Jobs was actually the business head behind Apple and had nothing to do with the design of the computers, which was solely Woz's domain. It turned out that Jobs' entreprenuerial acumen and Wozniak's innovative engineering skills were the perfect combination for one of the most successful and valuable companies the world has ever seen. What would you have asked Woz if you had a similar opportunity?\n\nThere is no question in my mind that Steve Wozniak has probably influenced my thinking as much, if not more than anyone else in the world of learning technology. He has literally changed the world with his innovative approach to designing computers. I remember tinkering with Apple Macintosh Computers back in the late 1980s and recall thinking how much more intuitive they were than IBM systems. It was these early forays into computers that shaped my later career as an academic and learning technology specialist. We have Woz to thank for the hardware and software designs behind the early success of Apple Computers, and when you hear him speak about his own education experiences, and his vision for the future of learning, you will be inspired. His down to earth, simplistic, no nonsense approach to education is refreshing and insightful - and what many people don't know is that he has given a lot of his personal fortune away to support technology programmes in schools. Woz is a man who practices what he preaches, and it was a pleasure and a privilege to spend some time with him.\n\nPhoto courtesy of the ELI Conference: Saudi Ministry of Higher Education\n\n\nSelfie number 1 by Steve Wheeler was written in Plymouth, England and is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 3.0 Unported License.Posted by Steve Wheeler from Learning with e's", "source": "Learning with 'e's"}