{"published": "2015-09-15T14:19:53Z", "media-type": "Blog", "title": "The Last of the Daisies", "id": "1920eb79-359e-4464-af7b-e3ac60fed8e3", "content": "Do you sometimes think that people are destined to live in a particular spot, even though they come from halfway around the ocean to get there? Bow did not travel far in order to arrive here at my property, as he was born in Missouri.\nBut I, on the other hand, had been living in Taiwan, and I had to cross an ocean to get here, to where Bow would be born, and I could adopt him.\nShoko and Leben , two Israeli chimpanzees raised among humans Yesterday, I read about two chimpanzees who were born in Israel. and were raised by a human couple and then sent to Zambia when they were five years old. They are now thirty and doing well.\nShoko and Leben (named for the colors black and white as represented by chocolate milk and a dairy rich fermented milk, respectively)  were adopted because their chimpanzee mothers abandoned them. But why were they sent to Zambia at age five? And who was that other adult female that Jane Goodall brought to the wildlife preserve in Zambia at about the same time? Could it have been Lucy Temerlin? Fleetingly, the thought crossed my mind.  We know that Lucy was sent to Gambia, That's a totally different country in West Africa and not the same as Zambia, so probably not. But the thought briefly crossed my mind as I listened to the story. Lucy Temerlin died a tragic death  -- killed by poachers -- when her human parents, the Temerlins, sent her \"back to Africa\", though she had never been there and was Oklahoma born and bred.\nShoko and Leben and their adoptiveIsraeli parnts I think Israeli chimpanzees should stay in Israel, American chimpanzees should stay in America. And there ought to be chimpanzees the world over, because Africa is not a safe place for them. If we want to preserve chimpanzees from extinction, we should not send those born on other continents \"back to Africa.\"  We should make sure they have good lives where they are, in touch with the people who raised them.\nYesterday, on my walk after lunch, I spotted a daisy.\n This is not the season for daisies, I thought, but there it was.\nI almost made a poem: \"It is not the time for daisies at all, but this one is here even in fall.\" I am including daisies as a plot element in the The Courtyard of the Happy Way, which is the second half of Our Lady of Kaifeng. Did you know that daisies are only partially edible, because they include a natural pesticide, but they are a great medicine, as this chemical is an antispasmodic and anti-tussive? I did not know that till yesterday. Daisies are even better than GMOs.\nA bird flew over me on the way back to the house, and its silhouette hung for a moment over the sun.\nThat bird is meant to be here, I thought,  and I am meant to be here, and Bow is meant to be here. We belong.", "source": "Notes from the Pens"}