{"published": "2015-09-24T07:09:00Z", "media-type": "News", "title": "How SMBs Can Manage Company Spend", "id": "f06d2825-91c1-4216-9878-089784fd1a86", "content": "New research from Ardent Partners, sponsored by ExpenseWatch, makes the case for SMBs to automate spending processes, proving valuable spend management insights and recommendations that unlock additional company value to help them compete.\n\nPlymouth Meeting, PA, (PRWEB) September 22, 2015 , underwritten by ExpenseWatch, provides valuable spend management insights and recommendations for small-and-midsized businesses to automate spending processes and unlock additional company value to help them compete. \n\nArdent Partners report shows that one of the top pressures SMBs face is the need to identify more cost reductions/savings (54 percent), supported by the findings that the average SMB only manages 49 percent of its spending. Less than 30 percent of SMB organizations leverage any type of accounts payable automation and only 36 percent have automated expense management processes.\n\nWhat’s more, only 21 percent of SMB organizations cite their visibility into total spending as “Very Strong,” and according to Ardent Partners, this factor speaks directly to the need for not only managing company spend, but also automation of key spending processes. \n\n“There should be a new line of thinking among SMBs in terms of managing organizational spend: There is no company too small for holistic, automated spend management,” said Christopher J. Dwyer, research director for Ardent Partners. “Increasing automation levels across spend management processes (purchasing, accounts payable, and expense management, in particular) is an effective, long-term approach towards not only driving superior cost control, but also greatly enhancing visibility into all facets of organizational spend.”\n\n“This new research underscores the value ExpenseWatch provides for small-and-midsized organizations,” said Bill Vergantino, president and CEO of ExpenseWatch. “As organizations grow, more employees spend money while nearly every position can impact how much money is ultimately spent. With ExpenseWatch, organizations are empowered to automate spending processes and gain visibility and control, while driving cost savings which frees money to be reinvested to grow the business.”\n\nTo download a free copy of How SMBs Can Manage Company Spending, visit http://www.expensewatch.com/?p=5074\n\nAbout ExpenseWatch (http://www.ExpenseWatch.com) \n\nExpenseWatch automates manual, time consuming paper-based processes, for visibility and control over organizational spending, empowering customers to spend with confidence. Modules for expense reporting, purchasing and payable invoices (bills) resolve specific spending issues, or can be combined to provide a comprehensive spend management suite. The company was founded in 2000, released the first version of its spend management service in 2003 and currently manages almost $3 billion in annual spend transactions on behalf of its customers. The company is privately held with headquarters in Plymouth Meeting, PA, a suburb of Philadelphia.\n\n###\n\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb12969464.htm", "source": "KHQ Right Now"}