{"published": "2015-09-23T06:03:56Z", "media-type": "News", "title": "Insight - Orban mobilises Hungary's troops, prisoners, jobless to fence out migrants (Reuters)", "id": "3264270d-f4b2-4a53-a2ad-d28dce059c88", "content": "The poles of a new fence on the border with Croatia are set up near Beremend, Hungary, September 21, 2015. REUTERS/Bernadett Szabo  \nBy Balazs Koranyi \n\nSAROK, Hungary (Reuters) - Built in a matter of weeks by soldiers, prison labourers and cadres of the unemployed, a vast new wall along Balkan frontiers is a monument to the ruthless efficiency with which Prime Minister Viktor Orban has mobilised Hungary against migrants. \n\nOrban describes the arrival of hundreds of thousands of refugees and other migrants in Europe this year from Asia, Africa and the Middle East as an attack on the continent's Christian welfare model. \n\nUntil last week, most trekked through Hungary, the main overland entry route into the EU's border-free Schengen zone from the Balkan peninsula, which they cross after arriving by dinghy in Greece. \n\nWhile Europe dithered over a collective response, Hungary took matters into its own hands, shutting off the route with a new fence along its entire 175 km (110 mile) border with Serbia, topped with razor wire and guarded by helmeted riot police. \n\nIt was erected at a cost of 22 billion forints (about $80 million), a rare example of efficiency in a country which built its last underground metro line ten years behind schedule at triple the projected cost. \n\nThe government says it put the military in charge of the construction so that it could act more quickly. By swiftly mobilising state resources, the authorities also managed to turn the fence into a national project, immensely popular at home even as it is denounced by European partners. \n\n\"It took a while but the government’s campaign to rouse public opinion against the refugees is bearing fruit, and having brought much of the media under control is paying dividends,\"     said Richard Szentpeteri Nagy, an analysts at Centre for Fair Political Analysis. \n\n\"By properly filtering the message through public television, what viewers at home see is that this is a mob, throwing stones and attacking police.\" \n\nIn just days since it shut the Serbian frontier, Hungary has already moved even faster to shut the border with Croatia, which is inside the European Union but outside the Schengen zone. \n\nA 41-kilometre temporary fence was thrown up within four days. Work is already underway on a permanent barrier, with machines clearing the land, fence posts driven into the ground and razor wire rolled out. \n\nNO EMOTION IN STEEL \n\nThe logistics are themselves a demonstration of Orban's vision of a powerful state flexing its muscle. \n\nThe military initially called in private contractors, but after Orban forced out his defence minister over the slow pace of work, soldiers swiftly took over most of the project. \n\nJanos, a dispatcher for a construction firm specialising in earth moving equipment, described a frenzied start. \n\n\"They found us through the Internet, I just got a call from the military asking if I could do the job,\" he said, asking that his surname not be used while discussing the process. \n\n\"They had something like two dozen private companies in the project then. But we're down to maybe a quarter of that as the military is getting its house in order and replaces us with their own capacity.\" \n\nHis firm gets paid 500 forints ($1.82) to drive a fence post into the ground. A crew needs to complete at least 200 in a day, 3 metres apart, to break even. The military schedule means working seven days a week. During the crunch when the defence minister was dismissed, his team put in more than 48 hours straight. \n\nParts of the fence have been made by firms using prison labour. Convicts receive a small portion of the wages paid for their work; the rest goes to cover prison costs. \n\nInmates from a prison on the outskirts of Dunaujvaros, Hungary's top steelmaking town, make up about a third of the 500-strong workforce at DAK Acelszerkezeti Kft., which worked on steel fence posts. Managing Director Gabor Tarany said his company did not care about politics; an order is an order. \n\n\"There’s no emotion in steel; we build things and don’t ask or care what it’s used for.\" \n\nThe state has also mobilised unemployed people who collect government benefits through a public works programme. \n\n\"Public works people have an obligation to work, otherwise they could lose their benefits,\" said Marta Varga, a spokeswoman for the Csongrad county government offices. They have been paid at a monthly wage of around $220 for work on the fence, around half Hungary's minimum wage. She said no one had refused. \n\nFENCES, DOGS, COPS AND GUNS \n\nThe project has become a defining achievement for Orban, a square-jawed former student activist who emerged in the early days after Communism at the helm of Hungary's main centre-right political party Fidesz. \n\nNow 52, Orban has made a career of defying what he considers a weak-willed European consensus. Jean-Claude Juncker, head of the EU's executive commission, jokingly greeted him as \"Dictator\" at an EU summit in May, offering a smile and a slap on the neck. \n\nFrom 2010 until this year, Fidesz held a two-thirds supermajority in parliament which allowed Orban to amend the constitution, consolidating his authority. He drew fire for steps which EU officials said undermined the independence of the courts, central bank and the media. \n\nRealising early that migration would be a major issue, he moved quickly to stir public opinion this year with a series of campaigns, amplified by friendly media, including a new state controlled news channel. \n\nThe tactic has worked. A survey out on Monday showed Orban's Fidesz party leading its nearest rival by 10 percentage points. Another showed 82 percent supported tighter immigration rules. \n\nIn recent weeks he has been denouncing European leaders for accelerating Europe's migration crisis by abandoning any pretence of defending its external borders. \n\nHe reserves particular blame for Germany, which suspended normal EU rules to announce in August it would welcome Syrian refugees no matter where they enter the bloc. Orban's speeches and interviews have included warnings that Europe's Christian culture is in jeopardy from Muslim migrants, a tone critics say crosses a line into xenophobia. \n\nAfter the fence went up last week and Hungarian riot police used tear gas and water cannon on stone-throwing migrants, Romania's Prime Minister Victor Ponta even evoked the continent's darkest era - the rise of the Nazis. \n\n\"Fences, dogs, cops and guns: this looks like Europe in the 1930s. And did we solve the refugee problem with this? No, we didn't,\" Ponta said. \"Erecting a fence only throws the problem into Serbia, into Croatia, into Romania.\" \n\nOrban's opponents abroad say Hungary should be more compassionate, not least because of its own history, including a 1956 uprising against the Soviet Union when Russian guns and tanks drove nearly 200,000 Hungarians to flee. \n\nBut many Hungarians are having none of it. They say that even if today's migrants include refugees who have fled war, they have all arrived through safe countries such as Turkey and the Balkan states and are no longer in peril. \n\n\"Did the Hungarian refugees ever attack the police in a violent mob, throwing stones?\" said Zoltan Nogradi, the mayor of Morahalom, a small town on the Serbian border. \"There's no comparison because if there was no fence, my town would have already been swept away.\" \n\nMORE DISCREET \n\nThe government says putting the military in charge was the only way to build the fence quickly, exempting the state from cumbersome procurement laws. \n\nSome who worked on the project say there are other benefits: details can be kept secret, and the army itself has learned from the work. \n\n\"It’s not just cheaper and quicker, it’s also more discreet,\" said an engineer working on the Croatian border, who asked not be identified because he was not authorised to speak to the media. \n\n\"Soldiers don’t talk, prisoners can’t talk and public works employees know it’s not in their best interest to talk. \n\n\"Politics aside, this is the best logistical exercise the army had in years,\" he added. \n\nThe Defence Ministry, the arm of the military in charge of the construction and prison officials did not respond to written questions about the project. \n\nBut while the fence is popular at home, economists say Orban's stance on migration could damage Hungary's reputation within Europe, important to its economic future within the EU. \n\n\"Hungary needs to get a bit of perspective – and, frankly, humility on this issue,\" UniCredit economist Erik F. Nielsen said. \"It is only 25 years ago that the Hungarian government stopped fencing in its own people, and a very large share of the creation of Hungarian prosperity since then has been generated by Western European solidarity with the Hungarians.\" \n\n\"I am starting to wonder whether Hungary even belongs in Europe anymore,\" Nielsen added. \n\n($1 = 274.53 forints) \n\n(Additional reporting by Bernadette Szabo; Editing by Peter Graff)", "source": "West Australian"}