{"published": "2015-09-08T18:48:04Z", "media-type": "News", "title": "Semi Sales Slip in July", "id": "fef007d8-b1d4-42b8-b9fe-086965297512", "content": "WASHINGTON — Worldwide sales of semiconductors slipped 0.9% year-over-year to $27.9 billion in July on a 90-day moving average. \n \nGlobal sales were 0.4% lower than the revised June total of $28 billion, the Semiconductor Industry Association said. \n \nRegionally, sales in the Americas were roughly flat in July compared to last year, while sales in China increased nearly 6%. \n \n“Global semiconductor sales have slowed somewhat this summer in part due to softening demand, normal market cyclicality, and currency devaluation in some regional markets,” said John Neuffer, president and CEO, SIA. “Despite these headwinds, year-to-date global sales through July are higher than at the same time last year, which was a record year for semiconductor revenues.” \n \nRegionally, year-to-year sales increased 5.6% in China, 1% in Asia Pacific/other, and 0.8% in the Americas. Sales were down 12.5% in Europe and 13.3% in Japan, in part due to currency devaluation. \n \nOn a month-to-month basis, sales increased 2.7% in Japan, 0.6% in China and 0.4% in Europe while falling 0.3% in the Americas and 2.5% in Asia Pacific/other. \n \nSIA also announced a joint release with the Semiconductor Research Corp. of a report highlighting the urgent need for research investments to advance the burgeoning Internet of Things and develop other cutting-edge, semiconductor-driven innovations. \"Implementing the recommendations in the report will help the United States harness new technologies and remain the world’s top innovator,” Neuffer said. \n \nAll monthly sales numbers are compiled by the World Semiconductor Trade Statistics (WSTS) organization and represent a three-month moving average. \n \nRegister for PCB West, the Silicon Valley's largest printed circuit trade show, Sept. 15-17 at the Santa Clara Convention Center:  pcbwest.com .", "source": "Printed Circuit Design & Manufacture"}