{"published": "2015-09-01T09:23:46Z", "media-type": "Blog", "title": "Blended(2014)", "id": "4894b5e2-cce6-4330-8eeb-3d6f0342a3d0", "content": "(source)\nDirected by Frank Coraci\nWritten by Clare Sera and Ivan Menchell\n\n Adam Sandler and Drew Barrymore know that they have good onscreen chemistry so a third movie together was definitely not a bad idea.  This was proven last year when the film was released.  They earned more than 300% than their budget.  A lot of people loved the humor plus some other stuff.  \n\nIs the story original?  Of course not.  There's THE BRADY BUNCH; YOURS, MINE, OURS plus a whole lot more.  Still, there was something that made me watch this.   \n\n\nThis movie is a combination of a comedy of disasters, family life and eventually finding true love.\n\nLauren and Jim did not like each other at first sight and it took a lot of time together before they discovered that they are probably right for each other, but even so, there were a lot of doubts each of them had to conquer.\n\nEach child had a back story and each of their stories is vital.\n\n \nI still like 50 First Dates and The Wedding Singer much, much better, but it surely isn't a waste of time watching this movie, in my opinion.  It probably is not the best story ever written(most of the critics hated it), but it is indeed very entertaining.  Something to take the blues away.\n\nCAST FROM WIKIPEDIA:\n\n\nAdam Sandler as Jim FriedmanDrew Barrymore as Lauren ReynoldsBella Thorne as Hilary \"Larry\" FriedmanEmma Fuhrmann as Espn FriedmanBraxton Beckham as Brendan ReynoldsAlyvia Alyn Lind as Lou FriedmanKyle Red Silverstein as Tyler ReynoldsShaquille O'Neal as DougTerry Crews as NickensAbdoulaye N'Gom as MfanaJoel McHale as MarkWendi McLendon-Covey[5] as Jen PalmerKevin Nealon as Eddy WarnickJessica Lowe as Ginger WarnickZak Henri as Jake WarnickDan Patrick as DickLauren Lapkus as TracyAlexis Arquette as Georgina (A reference to 'George' from The Wedding Singer)Allen Covert as 220 Tom (A reference to '10 Second Tom' from 50 First Dates)Mary Pat Gleason as Pharmacy cashierDale Steyn, a South African cricketer, as HimselfSherwyn Budraj as Featured Extra (Indian Man)George H. Washington as Busts", "source": "I am NOT a critic.  I'm merely an observer.  (Books, movies, plays, musicals etc.)"}