{"published": "2015-09-22T07:50:58Z", "media-type": "News", "title": "Elderly man sings love song to dying wife in heartbreaking video", "id": "e70f708c-eb4f-4a8f-97ec-8f50e865ad06", "content": "(NEW YORK) — An elderly man’s sweet serenade to his dying wife while in hospice care is warming the hearts of viewers across the globe. \n \nErin Solari of New Orleans, videotaped her grandfather Howard Serena, 92, singing “You’ll Never Know” by Rosemary Clooney and Harry James to his wife Laura, 93, on Sept. 12. Laura currently suffers from dementia. \n \n“We knew that this was probably the last time, so we wanted to capture that moment,” Solari told ABC News on Monday. “It was really loving. \n \n“For me, right after the video, I was so overcome,” Solari added. “I broke down and started crying. I was so happy that I’d captured this moment for my family. It touched me, so it doesn’t surprise me that it touched other people as well.” \n \nThe Gainesville, Florida, couple have nine children and 18 grandchildren. They’ve been married for 73 years. \n \n“This video is pretty awesome because she’s almost completely blind and he’s fairly deaf, so it’s difficult for them to communicate,” Solari said. “This kind of thing between them, singing to each other, wasn’t uncommon in our family. They were always singing and dancing and they’d be very vibrant in that way.” \n \nIn the video, Howard strokes his wife’s face as he sings. Laura looks at her husband and mouths the lyrics. \n \nSolari’s heart-warming video was a hit on social media. \n \n“It [the video] was posted minutes after it happened on Facebook and it had over three million views,” she said. “I know it seems private, but my family is very proud and happy to share this love with the world. As for the feedback, all the love and support we’ve gotten, being around my grandmother, I believe it maybe it had a little bit of an impact of her feeling better. She’s been able to go home and we are very appreciative of that as well.” \n \nAfter being told the video had gone viral, Laura remarked: “I told you Howard that I’d make you famous.” \n \nCopyright © 2015, ABC Radio. All rights reserved. \n \nThe post appeared first on WTOP .", "source": "WTOP"}