{"published": "2015-09-21T08:40:40Z", "media-type": "News", "title": "Chemring Group plc Receives Underweight Rating from Barclays (CHG)", "id": "4b06aa3e-7607-4859-b186-e9eb8accdaa0", "content": "Barclays restated their underweight rating on shares of Chemring Group plc (LON:CHG) in a research note published on Monday, Analyst Ratings.Net reports. Barclays currently has a GBX 205 ($3.18) price target on the stock. \n \nShares of Chemring Group plc ( LON:CHG ) opened at 222.7500 on Monday. Chemring Group plc has a one year low of GBX 197.48 and a one year high of GBX 248.00. The company has a 50-day moving average price of GBX 226.07 and a 200 day moving average price of GBX 220.84. \n \nThe company also recently disclosed a  dividend, which will be paid on Friday, September 25th. Stockholders of record on Thursday, September 3rd will be issued a dividend of GBX 2.40 ($0.04) per share. The ex-dividend date of this dividend is Thursday, September 3rd. This represents a dividend yield of 1.13%. \n \nCHG has been the subject of several other research reports. Investec  reaffirmed a buy rating and issued a GBX 230 ($3.57) price target on shares of Chemring Group plc in a research report on Thursday, July 2nd. JPMorgan Chase & Co.  reiterated a neutral rating and issued a GBX 200 ($3.11) price objective on shares of Chemring Group plc in a report on Wednesday, August 12th. Panmure Gordon  restated a buy rating and set a GBX 294 ($4.56) price target on shares of Chemring Group plc in a research note on Wednesday, July 1st. Liberum Capital  reaffirmed a hold rating and set a GBX 210 ($3.26) price objective on shares of Chemring Group plc in a research report on Monday, September 14th. Finally, BESI Research  reissued a neutral rating and issued a GBX 225 ($3.49) price target on shares of Chemring Group plc in a report on Wednesday, June 24th. Two research analysts have rated the stock with a sell rating, five have issued  a hold rating and two have issued  a buy rating to the company’s stock. The company presently has a consensus rating of Hold and an average price target of GBX 218.78 ($3.40). \n \nChemring Group PLC is a United Kingdom-based firm, which will be engaged in developing and manufacturing protection alternatives for security and defense markets predicated on countermeasures, threat detection and energetic material products. The Organization operates in three segments: Countermeasures, which is engaged in the development and production of expendable active and passive countermeasures for naval and air platforms, and land-based electronic warfare equipment; Sensors & Electronics, including the development and fabrication of improvised explosive device ( LON:CHG ) detection equipment, chemical and biological threat detection equipment, IED electronic countermeasures, network protection technologies, explosive ordnance disposal equipment and demilitarisation services, and Energetic Apparatus, which includes the development and production of signs and illumination apparatus and payloads, pyrotechnic devices for satellite launch and deployment, and propellants, amongst others.", "source": "SleekMoney"}