{"published": "2015-09-29T23:04:53Z", "media-type": "Blog", "title": "Esp Ltd B 208 Fm Bass Guitar See Thru Black Basswood Fm 8 String Lb208fmstblk", "id": "78f8854c-15c5-415f-80cf-39edfb575bcf", "content": "Esp Ltd B 208 Fm Bass Guitar See Thru Black Basswood Fm 8 String Lb208fmstblk For Sale | 8 String Guitar | 5 hours ago For Sale: Esp Ltd B 208 Fm Bass Guitar See Thru Black Basswood Fm 8 String Lb208fmstblk Location: Nixa, Missouri Zip/Postal Code: 65714 Expires: Friday, October 30, 2015 2:04 AM Time Remaining: 29 days and 21 hours left! Price: $ 569.00\nCall us: 1-877-275-4434 - Mon-Fri 8:30AM - 9:00PM CST\nSat-Sun 10:00AM - 7:00PM CST ESP LTD B 208 Fm Bass Guitar See Thru Black Basswood Fm 8 String LB208FMSTBLK SKU: LB208FMSTBLK Click On Images to Enlarge Specifications Description ESP LTD B 208 Fm Bass Guitar See Thru Black Basswood Fm 8 String LB208FMSTBLKSKU: LB208FMSTBLK Click here for a vertical detailed image of the LB208FMSTBLK Click here for a detailed image of the LB208FMSTBLK 8 String Bolt-On Construction 34\" Scale Basswood Body Flamed Maple Top 5 Pc Maple/Rosewood Neck Rosewood Fingerboard 45mm Standard Nut Thin U Neck Contour 24 XJ Frets Black Nickel Hardware ESP Tuners TOM Bridge & Tailpiece ESP SB-5 (B & N) p.u. ESP ABQ-3 3-Band Active EQ Finish: STBLK (See Thru Black) Controls: Bass Boost/Cut, Volume, Mid Boost/Cut, Treble Boost/Cut, Balance ESP LTD B 208 Fm Bass Guitar See Thru Black Basswood Fm 8 String LB208FMSTBLK The ESP B208 8 String Bass comes equipped with ESP SB-5 pickups and the ABQ-3 active 3-band EQ. A beautiful, flamed Maple top caps off a contoured Agathis body. The bolt-on, 5-piece Maple and Walnut neck supports a Rosewood fingerboard with 24 XJ frets, dot inlays and the model name at the 12th fret. Additional features include Volume and Balance controls, black chrome hardware and a Tune-O-Matic bass bridge with stop-bar tailpiece. Frequently Asked Questions for this Product: When will my order ship? Most orders placed before 3:00 PM CST will ship within 24 hours. If you need a product by a specific time please contact us at 1-877-275-4434 before ordering. When will I receive my tracking number? Most tracking numbers are sent out around 5:30 PM CST of the following business day. Please allow 24-business-hours after ordering before requesting tracking information. How fast will I receive my product? Depending on your location it may take 3-4 business days for your order to arrive. Your tracking number will tell you the exact day your order will arrive. If you need an order by a specific date we recommend you call us at 1-877-275-4434 Have questions about this product?Contact us via live support or phone:\nCustomer Service Phone:1-877-275-4434\nSe Habla Espanol - Excencion 5 Hours of Operation:\nMon-Fri 8:30AM - 9:00PM CST\nSat-Sun 10:00AM - 7:00PM CST Shipping Policy Return Policy Customer Service Payment Tax Shipping Policy Although many orders are shipped the same day that we receive them, due to a variety of factors it can take up to 24 hours to process your credit card information and ship your order. If you need this item by a certain time please call us first before ordering at 1-877-275-4434 FedEx picks up shipments daily, Monday through Friday around 4:00 PM (Central Standard Time). FedEx DOES NOT operate on weekends or holidays. If you place an order for shipping on Friday night, the next available shipping day is Monday. Transit time depends on where you are located and which warehouse we ship your order from. IMPORTANT INFORMATION on expedited shipments such as Next Day Air, Second Day Air and 3- Day Select: 1.) The pickup day is not counted as a transit day.\n2.) Weekend and holidays are not counted as transit days. Example: If you place an order Friday evening for 3-Day Select shipment and the following Tuesday happens to be a holiday, your order will be processed for Monday shipment. Since Tuesday is a holiday, the first transit day is Wednesday, the second transit day is Thursday and the final transit (and delivery) day is Friday. It is important to understand this scenario for all expedited shipment methods. To avoid delay in the processing of your order, please be sure to provide us with accurate address information. Please also make sure you provide us with an email address that you check often. If this information is not correct or you don't check your mail regularly, you may miss important correspondence from us regarding your order. We ship via FedEx and USPS depending on the item. Larger items and heavier orders will ship via FedEx services. Smaller items such as harnesses, fuses etc will ship via USPS service. In some cases we may also ship via another carrier. Each carrier has it's areas where service is better than another and we try to select the best service to get your order delivered in the most timely manner. In instances we use FedEx or another carrier, the shipping charges will be exactly as calculated on our shopping cart. We ship to both the US and Canada and we can ship internationally but PLEASE be sure to contact us first before placing an international order for more information and an exact quote. Note: For any orders shipping internationally you are responsible for any and all custom duty fees and taxes. Most items shipped via FedEx ground will arrive within 2 to 7 days depending on your location in the US and 7 to 14 days within Canada. We ship from Missouri, below is a map showing normal transit times, keep in mind this is an estimation and not a guarantee: Return Policy Within 14 days of receiving your product you may return certain items in their original condition and packaging for a refund. We are not responsible for any shipping and/or handling charges to return an item to HiFiSoundConnection. We will pay the shipping of replacements back to your location. Your refund will be subject to a 20% restocking fee with a $10.00 minimum fee. If exchanging you will NOT be subject to the 20% restocking fee. You WILL have to pay the return shipping costs. We do NOT refund the amount you paid for shipping, duties, taxes, or any other charge incurred getting the item to your location. We reserve the right to charge a 35.00 flat fee on warranty / exchanges if the original product packaging is not included. Other fees associated with items not included with the returned merchandise such as bass knobs, fuse holders, manuals, etc that were not included with the package are also subject to additional fees depending on the item not returned. All returns require an RMA (return merchandise authorization) number. Any packages sent back without an RMA number will be delayed and possibly rejected. Please contact us to obtain an RMA number. All returns will be tested before any refund is given. All International Sales are final, the return/exchange policy does not apply to International orders The return policy does not cover damage due to improper installation, if an item was physically altered by you, or services performed by anyone other than HiFiSoundConnection. Within 30 days of receiving your product, if it becomes defective you can claim our in-house HiFiSoundConnection warranty, unless otherwise stated on the product page. We are not responsible for any shipping and / or handling charges to return a defective item to HiFiSoundConnection. We will pay for the shipping on the replacement product going back to your location. We reserve the right to refer you to the manufacturer for any warranty exchanges. We reserve the right to switch you to a comparable product if the original product is out of stock or discontinued. We will not send your replacement item until we have received and checked in the defective product, this may take up to 5 business days. All returns will be tested before any refund is given. Any item that is returned MUST first have RMA (return merchandise authorization) number before sending the package, if the package does not have an RMA number clearly on the outside of the return packaging it will be automatically refused. Please contact us to obtain an RMA number. Subwoofer Exception: Our warranty does not cover blown voice coils, or subwoofers that have been punctured. This is considered abuse by the manufacturer and is not covered under warranty. Defective items cannot be returned for a refund. All International Sales are final, the return/exchange policy does not apply to International orders The return policy does not cover damage due to improper installation, if an item was physically altered by you, or services performed by anyone other than HiFiSoundConnection. If your package is missing, includes a wrong item, or if the package / item is damaged in shipping please contact us as soon as possible. We will fix these problems at no cost to you. Contact us for more information and / or to ask any questions regarding our policy. Return / Exchange Policy Exceptions: Due to the custom nature of some items we cannot accept returns on these items for any reason other than warranty/damage/missing support. The following CANNOT be returned: Cut to length Speaker / Power wire Subwoofer Enclosures and / or MTX Thunderform boxes and / or Q-Forms Any speaker or subwoofer with actual physical damage (Tears, Rips, Dents, Surround Damage, Burnt Voice Coils 'Abuse') Installation Parts (Dash Kits and Harnesses) Products without a pre-authorized (RMA) number Any product after the 14 day period\nCancellation Policy If your item has not shipped yet we can cancel your order, but your refund will be subject to a 10% processing fee with a $10.00 minimum for the cancellation. If the item has already shipped we are unable to cancel it, please refer to our return policy. Call us at 1-877-275-4434 or email us with any questions in regard to this policy before making a purchase. Customer Service We are here to help! Our customer service staff we will glad to assist you with any questions or concerns you many have. We have a service member available 5 days a week to answer your questions. You can call us at 1-877-275-4434 Monday through Friday from 8:30AM - 9:00PM Central Standard Time or Saturday through Sunday from 10:00AM to 7:00PM Central Standard Time. You can also email us and one of our friendly staff will get back to you usually within one to two hours. All emails are answered in the order they are received and we do answer them all. Include your invoice # and email address with all emails. Please make sure to check your junk mail filter for replies. Sometimes email programs will accidentally place our emails in your junk mail folder. Payment Due Date: We require payment in full within seven days of the item purchase date. Sales Tax: Sales Tax is applicable if the item is shipped to the state of Missouri or if the payment is received from a billing address in Missouri. Duty Taxes (International): We ship from the United States, if you are having an item shipped internationally please understand you may have to pay duty taxes when receiving your item. We have no control over the amount, and do not know the amount your country may charge you. This tax is your responsibility, we are unable to reimburse you for the amount. We cannot mark packages as a 'gift' to evade duty fees, or taxes. For more information please view our international shipping policy. Related 8 string guitar    Contact\rTo inquire about this ad listing, complete the form below to send a message to the ad poster. Name: Email: Subject: Message: Sum of 3 + 3 = Recent Posts\tEsp Ltd Sc-608b Baritone Stephen Carpenter Signature Guitar Black 888365219714 Esp Ltd B 208 Fm Bass Guitar See Thru Black Basswood Fm 8 String Lb208fmstblk Skervesen Guitars Custom 8-s, 8 String. Seymour Duncan Pickups. . Jackson Slathx 3-8 Quilted Maple Top 8-string Transparent Black 888365553610 Schecter Banshee-8 8-string Active Left Handed Electric Guitar Trans Black Burst", "source": "8 String Guitar"}