{"published": "2015-09-08T21:43:00Z", "media-type": "News", "title": "Anritsu Introduces CPRI-based Solution that Makes RRH Field Testing Easier, Faster and More Cost-efficient", "id": "d0f7008a-a262-4005-858a-07341c43f403", "content": "-- Field Engineers and Technicians Can Conduct RF Tests on RRH at Ground Level to Reduce Base Station OpEx -- \n\nMORGAN HILL, Calif., Sept. 8, 2015 /PRNewswire/ -- Anritsu Company introduces a CPRI RF Measurement option for its BTS Master™ handheld base station analyzer family that can significantly reduce the operational expense (OpEx) associated with troubleshooting interference at base stations. Featuring best-in-class sweep speed and unique test capabilities, the BTS Master-based CPRI RF measurement test set allows field engineers and technicians to conduct accurate RF measurements on Remote Radio Heads (RRHs) while remaining at ground level, eliminating the considerable expense and time associated with calling a tower crew to conduct interference measurements. \n\nWith the new option installed, the BTS Master can conduct RF measurements over the fiber optic CPRI link connecting the baseband unit (BBU) and RRH. To simplify configuring the CPRI link for RF measurements, Anritsu has developed preconfigured radio setups and an auto detect function in the option. \n\nA sweep speed 10x faster than other solutions in its class allows the BTS Master-based CPRI RF measurement test set to capture bursty signals missed by alternative methods. Complementing the sweep speed are two unique features – the ability to tune and pan on a displayed signal, and to zoom into a particular area of interest. Faster sweep speeds and more detailed signal analysis allow field engineers and technicians to more efficiently locate the sources of interference and PIM. \n\nUsers can conduct CPRI Spectrum and CPRI Spectrogram measurements with the test set. The overall performance and capability give operations and maintenance groups, RF performance engineers, NEM performance groups and other professionals responsible for wireless network optimization the ability to conduct all the required tests without the cost and time associated with dispatching a tower crew.    \n\nThe CPRI RF option expands the comprehensive measurement capability of the BTS Master family, which consists of the MT8820T, MT8221B and MT8222B. All the handheld base station analyzers have been specifically developed to support 2G/3G/4G wireless networks, and feature over 30 analyzers in one instrument to meet virtually every measurement need. \n\nAnritsu also offers a portfolio of optical transport testers to test and verify the CPRI links. These solutions leverage Anritsu's extensive optical test history and can be used to confirm the RRH is powered-up correctly, that the fibers are connected correctly, the condition and cleanliness of the optical connector, and that the link has no excess loss from the RRH to the BBU. The transport testers can also verify that the correct wavelength SFP/SFP+ modules are installed and that the modules support the rate configured. \n\nFor more information, visit our CTIA Super Mobility 2015 online press kit here: http://ctia.vporoom.com/Anritsu \n\nAbout Anritsu \n\nAnritsu Company is the United States subsidiary of Anritsu Corporation, a global provider of innovative communications test and measurement solutions for 120 years. Anritsu's \"2020 VISION\" philosophy engages customers as true partners to help develop wireless, optical, microwave/RF, and digital instruments, as well as operation support systems for R&D, manufacturing, installation, and maintenance applications. Anritsu also provides precision microwave/RF components, optical devices, and high-speed electrical devices for communication products and systems. The company develops advanced solutions for 5G, M2M, IoT, as well as other emerging and legacy wireline and wireless communication markets. With offices throughout the world, Anritsu has approximately 4,000 employees in over 90 countries. \n\nTo learn more visit www.anritsu.com and follow Anritsu on Facebook, Google+, LinkedIn, Twitter, and YouTube. \n\nPhoto - http://photos.prnewswire.com/prnh/20150908/264574 \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/anritsu-introduces-cpri-based-solution-that-makes-rrh-field-testing-easier-faster-and-more-cost-efficient-300139410.html \n\nSOURCE Anritsu Company", "source": "Fat Pitch Financials"}