{"published": "2015-09-29T20:57:45Z", "media-type": "News", "title": "Film Review: ‘A Sinner in Mecca’", "id": "87995a77-63bf-4532-aa09-116ae227e2a4", "content": "Following “A Jihad for Love,” his docu about gay Muslims, Indian-born, New York-based helmer Parvez Sharma again looks to prove that his faith and sexuality are compatible, this time surreptitiously shooting via iPhone in the no-filming zone of Islam’s holiest city. “ A Sinner in Mecca ” is personal docu-making at its most strident, puffed up with righteousness as Sharma (justifiably) argues that Saudi Arabia’s Wahabi fundamentalism runs counter to the religion’s true loving precepts. Sensationalizing every moment of his hajj (pilgrimage) while calling attention to his devotion, the helmer comes across as far too pleased with himself, though countering the demonization of Islam is a necessary goal. A tiny Stateside release on Sept. 4 went virtually unnoticed, though TV sales should be more lucrative. \n \nAfter the release of “Jihad,” Sharma was the target of a fatwa for apostasy, which is presumably why he approaches his hajj with such trepidation: “I am consumed by my fear of death at the hands of the Saudis,” is but one of the lines he intones, along with, “A cold, naked fear filled me as I walked towards Saudi immigration.” Ironically for a docu meant to counter the popular media perception of Islam as a religion of violence, “Sinner” indulges in blatant scare-mongering that does more to put the helmer in a heroic light than challenge anti-Muslim narratives. Curiously, it also feels distinctly anti-Shiite. \n \nSharma calls his pilgrimage his hajj of defiance: “I need evidence that my faith is strong enough to survive this journey.” But the real taboo he breaks, ostentatiously even if nominally hidden, is to film in Mecca, a city off-limits not just to cameras but to non-Muslims. The lure of forbidden sites has attracted those of other faiths long before Sir Richard Burton famously entered the city in disguise in the mid-19th century, so Sharma makes much of his rule-breaking; it’s his way of further critiquing Wahabism, even though restrictions on non-Muslims in Mecca predates Wahabism by multiple centuries. \n \nOnce there, he furtively films the various stages every pilgrim is enjoined to undertake, flagrantly ensuring that he gets selfies in prayer. Historians and cultural commentators have long lamented the way the Saudis have destroyed nearly all the old structures in the city, and Sharma rightly adds his voice, also complaining about the crass commercialization of the place. He criticizes how the Saudis have covered over and air conditioned the passageway Muslims must run between two hills (a ritual known as sa’yy), and then indignantly criticizes the lack of facilities and conveniences for the vigil on the plain of Arafat. His is a hajj of bitterness and anger, and yet at the end he states, “Islam’s beating heart will now forever beat in my heart.” \n \nRidiculous scary music accompanies Sharma’s dramatic recreation of a chat he had with a gay Saudi while waiting on line, though it’s a shame he never bothers to include an actual gay Saudi voice, even if disguised. Contrasted with the jazzy score overlaid on scenes in his Gotham apartment, the musical juxtaposition furthers Sharma’s goal of vilifying the Kingdom, always from an outsider’s p.o.v. Sequences in India allow him to reflect on his difficult post-coming-out relationship with his devout mother.", "source": "Variety"}