{"published": "2015-09-13T06:10:36Z", "media-type": "News", "title": "VS joins Munnar stir, urges govt to accept demands", "id": "c87cb35f-3ed3-4f02-bc4a-6de91fd1fccd", "content": "Munnar/Kochi: Opposition Leader V.S. Achuthanandan on Sunday arrived at Munnar to express solidarity with the agitating plantation workers. \n \nAchuthanandan met with the workers and spoke in support of the strike. \n \n\"The government should accept the demands raised by the striking workers,\" VS said as he read out a prepared speech. \n \nEarlier in the day, VS had said he was going to Munnar to express solidarity with the agitating plantation workers there and not to visit CPM MLA S. Rajendran who is on a hunger strike near the protest venue. \n \n\"I'm going to the protesting workers and will stay back at Munnar until the strike ends,\" VS said making it clear that he would take part in the strike if the government fails to keep its promise. \n \nCongress leaders face wrath \n \nBefore VS reached the venue, the protesting tea plantation workers at Munnar ousted Mahila Congress leaders from the protest venue. \n \nMahila Congress leaders Bindu Krishna and Lathika Subhash who came to offer solidarity with the workers had to face the wrath of the protesters. The protesters also turned angry at Revolutionary Marxist Party (RMP) leader K.K. Rema who arrived at the venue. \n \nMeanwhile, Youth Congress activists burned Kanan Devan company's tea powder at Kattappana and Kumily. \n \nVS should follow party stance: Rajendran \n \nDevikulam MLA S. Rajendran, who is on a hunger strike in support of the workers, said that V.S. Achuthanandan is supposed to comply with the party stance on Munnar strike. The MLA said he was not eligible to advise VS. \"The party had decided to support the strike,\" he said, adding that he did not wish to react to VS' statement. \n \nRajendran started a hunger strike near the protest venue announcing solidarity with the protesters, though he was chased away from the venue by the agitating women. The women did not allow Rajendran to enter the venue as he had called the protesters 'Tamil extremists'. \n \nThe strike against the Kanan Devan Planatation's policies entered ninth day on Sunday after appeasement talks failed to reach a consensus. The estate workers are planning to continue the strike by blocking all the roads to Munnar. \n \nLabour Minister Shibu Baby John has called for a meeting of the representatives of protesters, trade union leaders and Kanan Devan company officials at 11 am on Sunday in Kochi.", "source": "Manorama Online"}