{"published": "2015-09-08T13:56:51Z", "media-type": "News", "title": "A $60 Laser Can Bring Your Self-Driving Car to a Screeching Halt", "id": "b8eefa0e-1f59-4e04-ab51-333a62b63a56", "content": "According to a security researcher, all it takes is a laser and pulse generator to trick a self-driving car. \n\n0shares \n\nA simple trick can bring your self-driving car to a grinding halt, according to one security researcher. \n\nSpeaking to IEEE last week, Jonathan Petit, a principal scientist at software security company Security Innovation, said he developed a way to either slow down a self-driving car or bring it to a halt. \n\nPetit developed \"a kind of laser pointer\" that combines a low-power laser and a pulse generator. When it's pointed at a self-driving car, it will trick the vehicle into thinking something is ahead and slow it down. If the laser pointer overwhelms the sensors on the car, the self-driving vehicle will stop. \n\nSelf-driving cars, which were initially popularized by Google but are now in the works at most major car makers, are widely viewed as a means to reduce congestion and improve safety on our roads. Self-driving cars use a series of sensors, lasers, and GPS technology to roam around town. All the while, the person in the car doesn't need to steer or press the gas—the car does it all. \n\nThe trouble, however, is that a self-driving car's reliance upon laser-ranging systems, called Lidar, makes it susceptible to Petit's hack, he said. Lidar, which is not used in every self-driving vehicle technology, but is running in some, attempts to create a 3D rendering of the car's surroundings by using pulses of laser light. When Petit's technology is beamed back at the Lidar system, it believes there's a pedestrian or another object around it and reacts accordingly. \n\nWhether the hack will actually work in real life, however, remains to be seen. Petit tested his own technology on Lidar systems, but not on actual automated vehicles. It's also worth noting that self-driving cars are still several years off and security will be a major concern for companies. Finding bugs and addressing them sooner rather than later will undoubtedly be a focus, and sidestepping this nasty item may already be on a carmaker's docket. \n\nStill, it highlights an important fact: despite claims that they're safe, questions abound over how these vehicles will behave when they actually hit the roads. \n\nPetit will talk more about his findings at the Black Hat Europe security conference in November.", "source": "PC Magazine"}