{"published": "2015-09-29T21:58:36Z", "media-type": "News", "title": "Roundup: U.S. stocks end mixed amid IMF warnings", "id": "f0f89e39-e183-4f44-b21c-9017a2db84ca", "content": "U.S. stocks closed mixed Tuesday following the previous day's plunge, as the International Monetary Fund (IMF) warned of slower economic growth for commodity exporters over the 2015-2017 period.\n\nThe Dow Jones Industrial Average rose 47.24 points, or 0.30 percent, to 16,049.13. The S&P 500 inched up 2.32 points, or 0.12 percent, to 1,884.09. The Nasdaq Composite Index dipped 26.65 points, or 0.59 percent, to 4,517.32.\n\nIn an analytical chapter of the IMF's flagship World Economic Outlook report, which is to be published next week in Peru, IMF economists found that the weak commodity price outlook could subtract almost 1 percentage point annually from the growth rate of commodity exporters over the 2015-2017 period as compared with the 2012-2014 period.\n\nAccording to the research, analysts generally agreed that commodity prices will likely remain low, given ample supplies and weak prospects for global economic growth, and the commodity futures prices suggest future spot prices for commodities will remain low or rebound only moderately over the next five years.\n\nSome analysts said the turmoil in commodities dominated the market sentiment recently, which caused a heavy sell-off in commodity stocks.\n\nOn the U.S. economic front, the Consumer Confidence Index stands at 103.0 for September, well above market consensus of 96.0, according to the New York-based research group Conference Board.\n\nThe S&P/Case-Shiller's 20-City Index decreased 0.2 percent month-over-month in July, missing market expectations of a 0.1-percent gain.\n\nOverseas, Japanese stocks plummeted Tuesday, with the Nikkei index diving 4.05 percent to a over-eight-month closing low, as a drop in commodity prices and a global equities rout were extended further.\n\nEuropean equities also largely declined on Tuesday, with British benchmark FTSE 100 Index falling 0.83 percent, as investor sentiment turned negative despite recoveries in mining and oil prices.\n\nThe CBOE Volatility Index, often referred to as Wall Street's fear gauge, fell 2.90 percent to end at 26.83 Tuesday.\n\nIn other markets, oil prices bounced back Tuesday as U.S. consumer data came in better than expected.\n\nThe West Texas Intermediate for November delivery moved up 80 cents to settle at 45.23 U.S. dollars a barrel on the New York Mercantile Exchange, while Brent crude for November delivery increased 89 cents to close at 48.23 dollars a barrel on the London ICE Future Exchange.\n\nThe U.S. dollar fluctuated against most major currencies Tuesday amid uncertainties about the timing of U.S. interest rate hikes.\n\nIn late New York trading, the euro rose to 1.1258 dollars from 1.1234 dollars in the previous session, while the dollar bought 119.63 Japanese yen, lower than 119.83 yen of the previous session.\n\nGold futures on the COMEX division of the New York Mercantile Exchange fell on Tuesday for a third straight session, as data showed U.S. consumer confidence unexpectedly rose in September.\n\nThe most active gold contract for December delivery lost 4.9 dollars, or 0.43 percent, to settle at 1,126.8 dollars per ounce. Endit", "source": "China.org.cn"}