{"published": "2015-09-29T13:02:00Z", "media-type": "News", "title": "Beepi Brings its Hassle-Free Way of Buying and Selling Cars to the Nation's Capital", "id": "d855cc55-c7b8-4342-adbe-71a1a844da2a", "content": "SOURCE Beepi\n\nOffers Consumers in Virginia, Maryland and D.C. a Trusted, Simple and Delightful Way to Buy and Sell Cars 100% Online\n\nLOS ALTOS, Calif. \n\nAs part of Beepi's national expansion, the Washington D.C. \n\nBeepi also offers strong consumer protection measures such as addressing recalls prior to delivery. Due to its commitment to transparency, the company last week stopped accepting diesel vehicles affected by the investigations into Volkswagen. \n\n\"With its discerning and highly mobile population, the nation's capital is the perfect place for Beepi. Its busy and often transient community needs a quick and reliable service to help them buy and sell cars without the frustration of wasting time going from dealership to dealership and filling out reams of paperwork,\" said Beepi CEO and co-founder Ale Resnik. \"We're excited to offer residents a trustworthy and simple way to buy and sell cars completely online.\"\n\n\"The company's decision to enter its thirteenth market was based on strong consumer demand for change in the auto industry,\" said co-founder Owen Savir. \"Buyers and sellers are eager to embrace new platforms that eliminate the frustrations of traditional dealerships, bringing the car buying experience in line with the way people purchase everything else, from electronics to clothes to groceries.\"\n\nAccording to a Beepi-commissioned national study \n\nAbout Beepi \n\nBeepi is the first startup to take on, and successfully disrupt, the pre-owned car industry. A peer-to-peer marketplace, Beepi is a way to buy or sell a quality car completely online, giving consumers a superior experience that is fast, secure and even fun. Beepi has been licensed by the Department of Motor Vehicles since December 2013 \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/beepi-brings-its-hassle-free-way-of-buying-and-selling-cars-to-the-nations-capital-300150659.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KFVE"}