{"published": "2015-09-23T12:06:04Z", "media-type": "News", "title": "Bajaj eligible to export quadricycle to European countries", "id": "15192654-5739-4fbf-bb10-0b45b3ff23c3", "content": "(from left) R c maheswari, president and Rajiv Bajaj, MD, Bajaj Auto with RE60 \n\r  \n\r\n\tWhile the India launch of quadricycle remains uncertain Pune-based Bajaj Auto has secured the certification from Europe and will be now eligible to export its RE60 to those countries. \n \n\r\n\tThe quadricycle RE60, which is indigenously developed by Bajaj Auto, has been certified under the European Whole Vehicle Type Approval (EU WVTA) regulations, after having passed all tests successfully. The certification was done by Bengaluru headquartered TUV Rheinland India, a subsidiary of the Germany based TUV Rheinland group and a leader in testing, inspection, certification and training. \n \n\r\n\tWith this certification by TUV Rheinland India, Bajaj RE60 will now be eligible for exports to Europe and also many other countries that recognise the EU WVTA standard, without the need for any further tests. \n \n\r\n\tThe EU WVTA Regulations are one of the world's most matured and advanced in terms of stringent environmental standards for exhaust emission, noise emission, electro-magnetic radiation and high level of safety requirements for braking, lighting, exterior projection, safety belts and anchorages. \n \n\r\n\tAbraham Joseph, Chief Technology Officer, Bajaj Auto said: \"These EU WVTA regulations are one of the world's toughest in terms of 'Safety & Environment'. The project was quite challenging and full credit for the successful certification to the untiring efforts of TUV Rheinland engineers, who are qualified and authorised by the European Approval Authorities [Ministry of Transport] to conduct the vehicle & component tests in India.\" \n \n\r\n\tHemant Desai, Country Head, Mobility Division, TUV Rheinland India, said: \"The EU WVTA approval process also involves testing and certification at the component level for safety critical items like safety belts, lights, mirrors, safety glazings, horns etc. Apart from the initial Type Approval Certification, the regulations also focus on the conformity of production in manufacturing and deployment of quality management systems.\" \n\nALSO READ:  Tata Motors pits Magic Iris against quadricycle", "source": "Business Standard India"}