{"published": "2015-09-24T18:36:27Z", "media-type": "Blog", "title": "Jerusalem – Israel Approves Harsher Measures For Stone And Firebomb Throwers", "id": "7e5f4072-b69f-4819-8ed6-62bdd0100621", "content": "Jerusalem - Israel Approves Harsher Measures For Stone And Firebomb Throwers Published on: Today 01:57 PM By: Jerusalem Post Text Size   Email Post Print Post Comments (1)\tSave Article Jerusalem - The Israeli security cabinet approved a short menu of tougher steps against rock and firebomb throwers on Thursday, including the easing of open-fire regulations. The unanimous decision of the 10-member security cabinet was taken after Prime Minister Benjamin Netanyahu held a number of high-level consultations over the last month with security and legal officials looking for ways to combat the wave of violence in Jerusalem and rock and petrol-bomb attacks on the roads to Jerusalem and beyond the Green Line.\nAdvertisement: Speaking after the meeting, Netanyahu said the first decision was to “sharpen” the open fire regulations. If until now the police could only fire if their own lives were in danger, now they will be able to open fire if anyone’s lives are in danger, he said. In addition, the police will be able to use the low-powered Ruger sniper rifle, something that up until now has only been permitted for IDF use in the territories.  Secondly, Netanyahu said it was decided that a minimum four years prison sentence will be imposed on those over the age of 18 caught throwing lethal objects. In addition, he said, minimum fines and punishments will be set for minors. “We intend to change the norm that has taken root here where it is possible to throw lethal and murderous objects in Israel without an answer or impediment. This will change,” he said. The security cabinet decision includes taking measures to punish minors from the age of 14-18 with jail sentences and fines on their parents, as well as taking away national security benefits for minors in jail. Likewise, it was decided to look into whether it was legally possible to impose minimum fines on parents of minors from the age of 12-14, and to have parents of children under the age of 12 post bonds for a year to secure their children’s release. Even as the security cabinet was formulating its new policies, the Jerusalem police’s 10-day crackdown on rock and firebomb-throwing Palestinians netted 137 arrests in the eastern portion of the capital by Thursday, as security preparations were finalized for coinciding Muslim and Jewish holidays. The massive sweep – undertaken ahead of Sukkot and the Muslim festival of Id al-Adha (Feast of Sacrifice), lasting from Thursday to Tuesday – follows chronic rioting after the Defense Ministry banned two radical Muslim groups from the Temple Mount earlier this month. The latest round of rioting took place over Yom Kippur in Beit Hanina, Pisgat Ze’ev and Talpiot, Police spokesman Micky Rosenfeld said, although no arrests were made and no injuries were reported. According to Rosenfeld, the most recent arrests occurred overnight Wednesday, when 13 suspects were apprehended in the flashpoint Arab neighborhoods of Silwan, Ras al-Amud, Isawiya, Shuafat and A-Tur. Of the 137 suspects arrested, Rosenfeld said 76 are adults, while the remaining 61 are minors as young as 14. “Police will continue operations and find suspects involved in disturbances over the last few days in different neighborhoods of the capital,” he said on Thursday. Additionally, Rosenfeld said security has been markedly heightened in the Old City for Id al-Adha, which celebrates Abraham’s willingness to sacrifice his son Ishmael, and often involves the slaughter of sheep for consumption at celebratory meals. In an effort to ease ongoing tensions, the Defense Ministry said that no age restrictions will be applied on the Temple Mount for Muslims with Israeli identification cards, while married Palestinian men from the West Bank aged 45 and older will be allowed to enter. “We completed security measures in order to prevent further incidents in Jerusalem and the Old City for the Muslim festival of Id al-Adha, with an emphasis in and around different Arab neighborhoods,” said Rosenfeld. “Security arrangements have been made to allow thousands of Muslims to go to the Temple Mount, with extra units in the Old City to patrol all activity.”  Jewish visitors will temporarily be barred from the contested holy site during the Muslim holiday. In the meantime, Rosenfeld said security preparations for Sukkot have also been finalized. More of today's headlines “New York, NY - During a Wednesday interview New York City Police Commissioner Bill Bratton said that recent reports about crime rates being up are misleading; that Mayor...” New York, NY - Bratton Says Kelly And Bloomberg \"Are Gone,\" Tells Critics Of New Administration To \"Get Over It\"\t ", "source": "Vos Iz Neias (Yiddish: What's News?)"}