{"published": "2015-09-15T03:20:58Z", "media-type": "News", "title": "Fitness not part of Tuilagi call: coach", "id": "a3f0d3f5-db2d-478f-8e10-6e51b0840e44", "content": "England head coach Stuart Lancaster has denied his decision to suspend Manu Tuilagi from the team until January came in the knowledge that the centre would not be fit.\n\nLancaster revealed the disciplinary measure against Tuilagi after the 24-year-old was found guilty at Leicester Magistrates Court in mid-May of two counts of assaulting a police officer, assault by beating and causing criminal damage.\n\nThe centre this week insisted he had not assaulted anyone, despite pleading guilty, and that that was an action he had taken following advice from his lawyer in an attempt to conclude the court case as quickly as possible.\n\nHe also said he had told Lancaster he would not be fit in time for the World Cup, which begins on Friday when England host Fiji at Twickenham, because of the recurring groin injury he hopes to return from at Christmas.\n\n\"As far as we were concerned, we didn't know if he was going to be fit or not. We were hoping he was,\" Lancaster said. \"He was very much in the Ben Morgan category for me. Ben Morgan was injured at the time but we were going to bring Ben into the camp even if he wasn't quite right to allow him as long a time as possible - that was our take on it.\n\n\"The decision changed off the back of the court decision, from our point of view. You never know how long these injuries are going to take.\n\n\"I waited for the court to make their decision and reacted off the back of that. The decision was made that he was found guilty. Yes [I would have taken the same action had Tuilagi been fit].\n\n\"My decision was always going to be based on whatever the court decided, and the court decided that he was guilty.\"\n\nLancaster also revealed that on Sunday he will conclude selecting his starting XV to face Fiji and that he intends to start his strongest team.\n\n\"I think we've got to pick our strongest team to start with,\" he said. \"We obviously trust the guys in the squad, so sometimes you might freshen the team up by changing a Joe Launchbury for Courtney Lawes, Ben Morgan and Billy Vunipola, Danny Care...\n\n\"\n\n\"There's all sorts of changes we could make, but not wholesale changes. There's bound to be injuries. I don't think any team has gone throughout a tournament without one of those. I think in 2011 there were only three players who played in all seven games.\"", "source": "Canberra Times"}