{"published": "2015-09-18T09:48:20Z", "media-type": "News", "title": "Elton John 'happy to be pranked' for gay rights", "id": "b4cdb6a8-390f-4621-bd6f-0d2f9b5d41d3", "content": "Pranks may be for giggles. But gay rights -- not so much, Elton John says. \n \nThe pop star responded to a prank by a Russian TV celebrity who called him this week pretending to be President Vladimir Putin. \n\n\"Pranks are funny. Homophobia, however is never funny,\" he said in a post Thursday. \"I love Russia and my offer to talk to President Putin about LGBT rights still stands.\" \n\nThe call \n\nDuring the prank call, the singer apparently thought he was chatting about gay rights with the Russian leader. \n\nRussian state television broadcast excerpts from the phone call Wednesday night. \n\n\"Hello Sir Elton,\" a man claiming to be Putin says in the recording. \"I was told that you wanted to discuss important problems of Russian reality.\" \n\nJohn purportedly responds that he's eager to meet in person. He later posted an Instagram message thanking Putin for the call. \n\nMan admits to prank \n\nA Russian TV personality known for his pranks later said he made the call -- not the Kremlin. \n\nRussian celebrity prankster Vladimir Krasnov described how he and his comedy sidekick pranked the British singer, playing the roles of Putin and a press secretary during the call. \n\n'Happy to be pranked' \n\nJohn said while the pair can brag about the gotcha moment, he is proud to be pranked if it sheds light on gay rights. \n\n\"If this unfortunate incident has helped push this vital issue back into the spotlight, then I am happy to be pranked on this occasion,\" he said. \n\nWhile Putin's office has insisted it had no conversation with the pop star, it told state-run Sputnik News he would be open to meeting with John. \n\nHuman rights groups have criticized a Russian law passed two years ago that forbids discussion of gay issues near children. \n\nThe prank came after John told the BBC that he'd like to meet Putin to discuss gay rights in Russia.", "source": "WYFF4.com"}