{"published": "2015-09-29T14:15:28Z", "media-type": "News", "title": "LPL Financial Names Tim Hodge Executive Vice President of Service", "id": "1b64c869-5ae9-400e-a2ea-88c1493656f5", "content": "SAN DIEGO, Sept.  29, 2015  (GLOBE NEWSWIRE) -- LPL Financial LLC, the nation's largest independent broker-dealer*, a custodian for registered investment advisors (RIAs), and a wholly owned subsidiary of LPL Financial Holdings Inc. (NASDAQ:LPLA), today announced that it has named Tim Hodge as executive vice president, service. Hodge will report to Tom Gooley, managing director of service, trading and operations, effective September 21. \n\n\nHodge will be responsible for overseeing LPL’s service organization and ensuring the delivery of support to independent financial advisors, banks, credit unions, RIA firms and clearing clients. He will play a significant role in developing and implementing strategies that are designed to ensure that LPL is able to offer high quality service to meet the needs of its clients and their practices for years to come. \n\n“Tim is a proven leader in building and enhancing service operations,” said Gooley. “His leadership and knowledge will allow us to further enhance the service experience for our clients to ensure we make it easy and efficient for advisors to do business with us so that, in turn, they can focus on providing the best service for their clients.” \n\nHodge comes to LPL from Goldman Sachs, where he has served in a variety of brokerage operation and platform management leadership roles during his more than 20-year tenure. Most recently he served as managing director and head of global private wealth management operations, leading multiple teams that support private wealth advisors and clients. Prior to that, he served as vice president for Goldman’s global futures operations following a number of years serving in operations leadership roles in various divisions of Goldman Sachs. Prior to Goldman Sachs, Hodge spent several years with Bank of America. \n\n\"I am excited to join LPL and help fulfill its mission of providing objective financial advice,” said Hodge. “One of the reasons I was attracted to LPL is that the firm puts their clients at the center of everything they do. I look forward to working collaboratively with LPL colleagues and our clients to help take the firm’s service experience to the next level.”  \n\nA native of Southern California, Hodge will be based out of LPL’s San Diego office. He holds a B.A. from the University of California at Berkeley and an MBA from the Stern School of Business at New York University. \n\n*Based on total revenues, Financial Planning magazine, June 1996-2015 \n\nAbout LPL Financial \n\nLPL Financial, a wholly owned subsidiary of LPL Financial Holdings Inc. (NASDAQ:LPLA), is a leader in the financial advice market and serves $486 billion in retail assets. The Company provides proprietary technology, comprehensive clearing and compliance services, practice management programs and training, and independent research to more than 14,100 independent financial advisors and more than 700 banks and credit unions. LPL Financial is the nation's largest independent broker-dealer since 1996 (based on total revenues, Financial Planning magazine, June 1996-2015), is one of the fastest growing RIA custodians with $112 billion in retail assets served, and acts as an independent consultant to over an estimated 40,000 retirement plans with an estimated $120 billion in retirement plan assets served, as of June 30, 2015. In addition, LPL Financial supports approximately 4,300 financial advisors licensed with insurance companies by providing customized clearing, advisory platforms, and technology solutions. LPL Financial and its affiliates have 3,385 employees with primary offices in Boston, Charlotte, and San Diego. For more information, please visit www.lpl.com . \n\nSecurities and Advisory Services offered through LPL Financial. A Registered Investment Advisor, Member FINRA/SIPC. \n\nLPLA-C \n\nConnect with Us! \n\nhttp://twitter.com/lpl \n\nhttps://www.linkedin.com/company/5294 \n\nhttps://www.facebook.com/LPLFinancialLLC \n\nhttp://www.youtube.com/user/lplfinancialllc \nMedia Contact:\nBrett Weinberg\n980-321-1904\nBrett.Weinberg@lpl.com \n\n    ", "source": "CNN Money"}