{"published": "2015-09-04T07:09:18Z", "media-type": "News", "title": "Canadian Western Bank rises as profit little impacted by oil drop", "id": "a1903466-23e5-46dc-a804-0105d5d8ab0e", "content": "1800 year-old sarcophagus discovered in Israel  \nPalestinian News.Net - Thursday 3rd September, 2015 \n \nAn 1,800 year-old sarcophagus was discovered at a construction site in southern Israel's coastal town of Ashkelon, Israel's Antiquities Authority (IAA) announced on Thursday. The 1,800 year-old  ... \n   Fliqvines online short film festival begins  \nPalestinian News.Net - Thursday 3rd September, 2015 \n \nFliqvine, a social video-on-demand startup in collaboration with Bangalore International Short Film Festival (BISFF), has brought to movie lovers a large collection of short films that can be  ... \n   Palestinian children under house arrest awaiting trial  \nPalestinian News.Net - Wednesday 2nd September, 2015 \n \nDozens of Palestinian children are being held within the walls of their homes in East Jerusalem, by order of the Israeli authorities, while waiting to go on trial. This practice, denounced by  ... \n   Hamas calls on Palestinian factions to boycott Abbass meeting  \nPalestinian News.Net - Wednesday 2nd September, 2015 \n \nThe Islamic Hamas movement on Wednesday called on Palestinian factions to boycott the Palestinian's National Council (PNC) two-day session, which is scheduled for September 14 in  ... \n   Palestinians Attempt To Lynch Five American Tourists In Hebron  \nWestern Journalism - Friday 4th September, 2015 \n \nlynched by a Palestinian mob in the ancient city of Hebron in Israel today. The five yeshiva students were with driving a car on their way to the cave that houses the tombs of the  ... \n   Israeli Embassy condemns decision to withdraw exhibition about multi-faith football ahead of Wales Israel game  \nWales Online - Friday 4th September, 2015 \n \nCardiff City Stadium . The exhibition - called Jewish-Arab football: diversity and co-existence through lower-league football - was due to run for a week  ... \n   Why Israel must look ahead and deal with Iran agreement  \nSan Diego Union-Tribune - Friday 4th September, 2015 \n \nNow that enough Senate Democrats have pledged their support for the Iran nuclear deal, it is time for Israel and some of its American supporters to end their ill-conceived campaign to block it, and  ... \n   Israel back on track after Andorra stroll  \nUEFA - Friday 4th September, 2015 \n \nIsrael 4-0 AndorraIsrael revived their Group B qualifying campaign as they curtailed a losing streak of three games with a convincing victory in  ... \n   Israel exaggerates Iran threat  \nthestar.com - Friday 4th September, 2015 \n \nA few corrections to Dow Marmur’s article: Iran never talked against “Jews.” Their criticism is toward Israel. Iran has the largest Jewish community in the Middle East and they  ... \n   Israel recovers ancient sarcophagus hidden by contractors  \nRaw Story - Friday 4th September, 2015 \n \nAFP/AFP - Israel Antiquities Authority southern district director Saar Ganor cleans the lid of a Roman-era sarcophagus adorned with the carving of a young man, at a warehouse in Bet Shemesh on  ... \n   Israel Bombs Gaza Once Again  \nPrensa Latina - Friday 4th September, 2015 \n \nTel Aviv, Sep 3 (Prensa Latina) The Israeli Air Force today bombed a sector of the overpopulated Gaza Strip, without preliminary reports so far on the damage caused by the explosions on the  ... \n   Europe Doesn’t Have a Migrant Crisis It Has a Syrian Crisis  \nPalestine Chronicle - Friday 4th September, 2015 \n \n,000 , up from 112,000 over the same period in 2014, according to the International Organization for Migration. This is still higher than Europe would want, but not a number that a rich economic  ... \n   Israeli Forces Shoot Injure Child of Fisherman in Gaza  \nPalestine Chronicle - Friday 4th September, 2015 \n \nIsraeli forces shot and injured a Palestinian child near the shores of the Beit Lahiya village in the northern Gaza Strip, medics said. Medics told Ma’an that Bilal Abu Amro,11, was  ... \n   300 Palestinian Minors Held in Israeli Jails  \nPalestine Chronicle - Friday 4th September, 2015 \n \nSome 301 Palestinian minors are being held in Israeli jails, a report released yesterday revealed. Quds Press reported a report released by the Palestinian Ministry of Information in  ... \n   Judge frees skater to leave Israeli national team and join US  \nNew York Post - Friday 4th September, 2015 \n \nThis American is finally free to skate for Team USA. Andrea Davidovich, a pairs figure skater for Israel at last year's Sochi Winter Olympics, had to sue the Jewish  ... \n   Fine Print Bill Would Prohibit NJ Stake in Firms that Boycott Israel  \nNJ Spotlight - Friday 4th September, 2015 \n \nbill that passed the state Senate with bipartisan support last month seeks to bar New Jersey public-employee pension system assets from being invested in companies that participate in a movement  ... \n   French judges drop probe into Arafats death  \nMENAFN - Friday 4th September, 2015 \n \n(MENAFN - Gulf Times) French judges investigating claims that Palestinian leader Yasser Arafat was murdered have closed the case without bringing any charges, a prosecutor said yesterday. \"At  ... \n   Israeli forces may get freer hand to shoot stone-throwers  \nMENAFN - Friday 4th September, 2015 \n \n(MENAFN - Gulf Times) Israel is considering giving its security forces a freer hand to shoot at young Palestinian stone-throwers, Prime Minister Benjamin Netanyahu's office said yesterday.  ... \n   Palestine- Contractors damage ancient sarcophagus  \nMENAFN - Friday 4th September, 2015 \n \n(MENAFN - Gulf Times) Israeli authorities have recovered a Roman-era sarcophagus that construction workers sought to hide after digging it up at a building site, officials said yesterday. The  ... \n   Trump Says US Would Have to Defend Iran Against Israel Attack  \nInfowars - Friday 4th September, 2015 \n \nPresidential frontrunner Donald Trump told CNN the United States would be obliged to defend Iran against an Israeli attack under the terms of the nuclear deal reached between the United States, the  ...", "source": "Palestiniannews.net"}