{"published": "2015-09-23T18:47:00Z", "media-type": "News", "title": "Armstrong Industrial Hand Tools Celebrates 125 Years, Is Positioned as Lead Industrial Brand", "id": "e088cfb1-caf8-460a-9997-658c8234c226", "content": "SPARKS, MD -- (Marketwired) -- 09/23/15 --  Armstrong Industrial Hand Tools today announced a realignment that will bring several other well-known industrial brands under the Armstrong Industrial Hand Tools banner. Campbell® chain, JOBOX® tool storage, GearWrench® and Crescent® hand tools, and others will now be positioned in the industrial market as part of the Armstrong Industrial Hand Tools offering. \n\nArmstrong Industrial Hand Tools has long been known for its extensive line of over 4,000 Made in the USA hand tools. By leading the industrial portfolio, Armstrong will now represent over 15,000 products and 10 brands. \n     \n\"Armstrong Industrial Hand Tools has always been a leading brand in the industrial market,\" said Michael Connor, director of industrial marketing for Armstrong. \"This new unified branding structure will benefit not only Armstrong, but our extended portfolio, which includes brands that are already market leaders in their own right. The effect will be positive in every way, with a simplified identity message communicated across all sales and marketing activities. Examples of the new identity messaging include wrapping our end user specialist vans in an Armstrong theme, aligning our industrial catalog under the Armstrong banner, and communicating to our industrial customers as Armstrong Industrial Hand Tools.\" \n\nThe realignment announcement ties in to the 125th anniversary of Armstrong, which occurs this year. Armstrong Industrial Hand Tools has focused on delivering a broad range of strong, durable tool solutions to demanding industrial, commercial, government, and military operations for over 125 years. To find out more about the history of this famous American hand tool brand, go to www.armstrongtools.com and click on \"HERITAGE.\" \n\nAbout Armstrong Industrial Hand Tools: \nArmstrong now leads a full line of more than 15,000 high quality products designed for specific user needs and supported by an experienced and sophisticated network of industrial distributors. Armstrong Industrial Hand Tools is part of Apex Tool Group, LLC. For more information about Armstrong Industrial Hand Tools, go to www.armstrongtools.com . \n\nAbout Apex Tool Group : \nApex Tool Group, LLC, based in Sparks, MD, is one of the largest worldwide producers of hand and power tools, tool storage, drill chucks, chain, and electronic soldering products. Directly and through its subsidiaries, Apex serves a multitude of global markets, including automotive, aerospace, electronics, energy, hardware, industrial, and consumer retail. Apex markets its portfolio of diverse products under its own brand names in addition to being the principal manufacturer for several key private label products for certain retailers for many years. \n\nMedia Contact: \nJennifer Leckstrom \nRoseComm® \n215-681-0770 \njleckstrom@rosecomm.com", "source": "A.M. Best"}