{"published": "2015-09-01T15:34:55Z", "media-type": "News", "title": "PlacerGROWN, Crop-to-tabletop Since 1849, to Participate in the 2015 Farm-to-Fork Festival", "id": "0b3be432-95f0-4151-b68f-fe7f6ae88334", "content": "PRWeb \nOn Saturday, September 26, PlacerGROWN , in partnership with Placer County Visitors Bureau , will exhibit along with other regional producers at the 3rd annual Farm-to-Fork Festival in downtown Sacramento. With a bevy of local farmers' markets and small farms, dozens of wineries and numerous top chefs, Placer County is a veritable food and wine destination. \n\n\"Our PlacerGROWN farmers have had a crop-to-tabletop mentality since 1849,\" said Carol Arnold, CEO of PlacerGROWN. \"Farm-to-fork is a new spin on an old notion: food grown fresh from your local farmer tastes better than food that travels thousands of miles. The Placer County community has enjoyed fresh, local food and has been capitalizing on this healthy lifestyle for over a century.\" \n   \nTweet this: Meet local @PlacerGROWN farmers and taste farm-fresh food at the #SacFarm2Fork festival 9/26. #Crop2TableTop #PlacerLife \n\nRepresenting 1,244 farms and 19 award-winning wineries, Placer County will be highlighting its fresh PlacerGROWN food and wine, as well as providing games and entertainment for the whole family. Several local farm-to-fork producers will be lined up along Capitol Mall to provide tasty treats and information. Representatives from the Placer County area include: PlacerGROWN, Placer County Visitors Bureau, Placer County Vintners Association, Cattle Women and more. \n\n\"Placer County, with its rich agricultural history, has always produced amazing food and wine,\" said Placer County Agricultural Commissioner Josh Huntsinger. \"Since 1849, local farmers, vintners and producers have cultivated the fresh food that is synonymous with this region, making us the second-healthiest county in the state.\" \n\nThroughout the day, PlacerGROWN will host tastings, games and other family-fun activities to highlight Placer County agriculture and the benefits of preparing healthy meals with locally sourced, fresh ingredients. For more information about Placer County or PlacerGROWN and the farmers and ranchers they represent, visit placergrown.org and visitplacer.com. \n\n# # # \n\nMedia Notes: \nTo schedule an interview with a Placer County farmer, rancher or one of PlacerGROWN's award-winning vintners, please contact Patrick Storm of Merlot Marketing at 916-285-9835. \n\nLinks: \nPlacerGROWN \nPlacer County Visitors Bureau \nPlacer County Wine Trail \n\nAbout PlacerGROWN: \nSupported by Placer County, PlacerGROWN is the information source dedicated to educating residents about the freshest agricultural products the region has to offer. Through its website, social media channels, and other outreach programs, PlacerGROWN connects community members with the farmers' markets, farms, orchards, ranches, wineries, nurseries, and specialty food stores in one of the most diverse growing areas in Northern California. To discover the bounty of agricultural products produced by farmers who call Placer County home, or for more information about PlacerGROWN, visit placergrown.org. \n\nAbout Placer County Visitors Bureau: \nThe Placer County Visitors Bureau and California Welcome Center, Auburn, offers a variety of tourist information and maps and is located in downtown Auburn. Outdoor enthusiasts thrill at the county's abundance of year-round recreational activities, while others marvel at the array of galleries, theaters, musical and festival events. Whether you come for lunch or a lifetime, we invite you to visit and discover Placer County for yourself. For more information, visit visitplacer.com. \n\nAbout Placer County Vintners Association: \nThe Placer County Wine Trail is organized by the Placer County Vintners Association, a nonprofit association created to provide a forum for wineries to collaborate on events and programs. Together the Association also develops marketing programs to raise awareness of the Placer County wine region. The group believes that sharing best practices with all county wineries inspires the vintners to provide a high quality experience for winery visitors. For more information and maps, visit placerwine.com. \n\nRead the full story at http://www.prweb.com/releases/2015/08/prweb12884951.htm \nPRWeb.com", "source": "Market Pulse Navigator"}