{"published": "2015-09-30T08:54:30Z", "media-type": "News", "title": "WallStreet Morning Insights: Pacific Biosciences of California, Inc. (PACB), Ubiquiti Networks, Inc. (UBNT), Stock Building Supply Holdings, Inc. (STCK), L Brands, Inc. (LB), Sprint Corporation (S)", "id": "36df1317-9e17-410f-bdf6-59b61f58ca52", "content": "WallStreet Scope – Wed September 30th, 2015: \n \nPacific Biosciences of California, Inc. ( PACB ) finished down on Tues with a weekly performance of -14.62% finishing the day at $3.68, a loss of -8.00%. Wallstreet traded at a volume of 750,318 shares and relative volume of 1.3. Pacific Biosciences of California, Inc. ( PACB ) reported a quarterly performance of -36.11% and is selling from its 52 week low by -5.40% with a reported debt to equity ratio of 0.5. Pacific Biosciences of California, Inc. ( PACB )’s monthly performance is -27.42%, and a profit margin of -75.30%, overall insider transactions -10.01% and has 74.98 million shares outstanding. Pacific Biosciences of California, Inc. ( PACB ) is a buy in the Biotechnology industry with an compiled analyst rating of 2.4 and EPS growth this year of 25.40% \n \nUbiquiti Networks, Inc. ( UBNT ) of the Wireless Communications sector closed out the day Tuesday at $32.63, a gain of 3.92% with a return on investment of 25.10% trading at a volume of 525,617 shares. Ubiquiti Networks, Inc. ( UBNT ) is performing below average with a weekly performance of -6.85% moving into this week with a quarterly performance of 2.22% and a 52 week low of 27.96%. Ubiquiti Networks, Inc. ( UBNT )’s monthly performance sits at -7.43%, profit margin 21.70%, 0.00% insider transactions. Ubiquiti Networks, Inc. ( UBNT ) is neutral in the Wireless Communications industry with an averaged analyst rating of 3 and EPS growth this year of -26.40% \n \nStock Building Supply Holdings, Inc. ( STCK ) ended the day Tuesday at $17.17, a loss of -1.04%, after trading at a volume of 64,740 shares and market cap of 449.68. Stock Building Supply Holdings, Inc. ( STCK ) is performing below average at a weekly performance of -6.23% and a quarterly performance of -12.17% off their 52 week low by 28.13%. Stock Building Supply Holdings, Inc. ( STCK )’s monthly performance is -6.58%, profit margin 1.00%, 0.00% insider transactions and for the upcoming day, Stock Building Supply Holdings, Inc. ( STCK ) is a good stock in the General Building Materials industry with an averaged analyst rating of 2 and EPS growth this year of 200.00% \n \nL Brands, Inc. ( LB ) of the Services sector closed Tuesday at $89.39 with a loss of -0.03%, trading at a volume of 1,048,253 shares. L Brands, Inc. ( LB ) is performing below average with a weekly performance of -2.60% moving this week with a quarterly performance of 4.91% performing off their 52 week low by 44.84%. L Brands, Inc. ( LB )’s monthly performance is 6.87% , profit margin 9.90%, 0.00% insider transactions and, L Brands, Inc. ( LB ) is a good stock in the Apparel Stores industry with an averaged analyst rating of 2.5 and EPS growth this year of 14.80% \n \nSprint Corporation ( S ) closed at $3.74 Tuesday, a loss of -6.03%, trading at a volume of 46,990,383 shares. Sprint Corporation ( S ) is performing below average at a weekly performance of -15.00% moving into today with a quarterly performance of -17.98% and against their 52 week low by 20.65%. Sprint Corporation ( S )’s monthly performance of -27.94% , profit margin -10.00%, 381.51% insider transactions. Sprint Corporation ( S ) is a good stock in the Wireless Communications industry with an averaged analyst rating of 2.7", "source": "WallStreetScope.com"}