{"published": "2015-09-24T13:00:00Z", "media-type": "News", "title": "Quixey Launches Deep View Cards™ for Ads, Providing Better Access and Engagement with Mobile Apps", "id": "1251bc3f-8a6b-4aad-9efa-15c519c4f0c9", "content": "MOUNTAIN VIEW, Calif. , Sept. 24, 2015 /PRNewswire/ --  Quixey,  a mobile technology company, today announced Deep View Cards™ for ads – a new way for advertisers to deliver mobile app content and functionalities. Quixey is transforming how advertisers engage with consumers on mobile, with Deep View Cards outperforming other formats in conversion rates by up to 3x in direct comparison tests. \n\nDeep View Cards for ads can be used in a variety of ways. For example, Quixey has partnerships with U.S. and global companies including Adelphic, Alibaba, AskMe, Opera Mediaworks, and PocketMath; publishers such as Times Internet; and with advertisers on social networks through Flightly. To date, Quixey has served over 300 million Deep View Card ads to its advertising partners. \n   \n\"Deep View Cards allow advertisers to better engage consumers with mobile apps - and it's working,\" said Tomer Kagan, co-founder and CEO of Quixey. \"We're now serving over 60 million impressions of Deep View Cards per month. This is the evolution of deep linking that marketers have been waiting for - to not just deliver a static ad with a deep link, but to generate dynamic ads featuring functionalities from apps at scale. We've spent the last five years evolving our technology and working with top engineers from around the globe to finally make the app ecosystem more accessible. And this is only the beginning.\" \n\nSince Deep View Cards are programmatic, they help advertisers get their content discovered and surface the most relevant app functions to users at scale. In an A/B testing campaign on industry-leading ad platforms, Deep View Cards delivered 130-150 percent higher engagement in click-through rates compared to other campaigns. \n\n\"Deep View Cards are one of the mobile advertising formats of the future,\" said Deep Katyal, senior director, product innovation, Opera Mediaworks. \"They represent everything the mobile experience should be for users – easy, relevant, native, and at users' fingertips when they need them most. They capture and capitalize on user intent in an effective way because they display the exact destination within the app that will help users complete an action, not just pre-determined ad content or creative.\" \n\n\"We're always in search of innovative mobile advertising technologies that allow SeatGeek to get a leg up on our competitors and generate revenue at scale,\" said Will Flaherty , director of growth at SeatGeek. \"Quixey provided new technology solutions that did just this, and to date we've seen outstanding mobile conversion rates on the platform.\" \n\nQuixey uses a combination of content acquisition techniques and patent-pending native app mining technology, allowing Deep View Cards to be dynamic and rendered in real-time. Each Deep View Card represents the content and actions embodied by a specific function of an app, such as making a purchase or finding flight deals. \n\n\"Native advertising works phenomenally well, but mimicking the look and feel of a platform with ads is only half the solution,\" said Casey Grooms , co-founder of PocketMath. \"Quixey goes beyond native with Deep View Cards by allowing users to complete their transactions in one tap. Coupled with PocketMath, together we bring scalability wrapped up in a self-serve platform - delivering incredible engagement and results.\" \n\nDeep View Cards are also solving the challenges associated with the traditional approach to mobile app ad creative production. Quixey can programmatically extract content and generate creative at scale that is compatible with platforms like Twitter. \n\nFor more information on Deep View Cards, visit  www.quixey.com . \n\nAbout Quixey \nQuixey is a mobile technology company providing the world's leading mobile brands with Deep View Cards™ - connecting users to the functionality of apps and dramatically shortening users' time-to-action. The company was founded in 2009 and has offices in Mountain View, CA, Beijing, Bangalore , and Tel Aviv. For more information about Quixey, please visit  quixey.com  or follow the company on Twitter at @Quixey. \n\nCONTACT INFORMATION \nMedia Contacts: \nJarmila Henn \nQuixey \njhenn@quixey.com \n\nSarah Borup \nSHIFT Communications \nquixey@shiftcomm.com \n\nLogo - http://photos.prnewswire.com/prnh/20150923/270220LOGO  \n\nPhoto - http://photos.prnewswire.com/prnh/20150923/270219 \n\nPhoto - http://photos.prnewswire.com/prnh/20150923/270221 \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/quixey-launches-deep-view-cards-for-ads-providing-better-access-and-engagement-with-mobile-apps-300148391.html \n\nSOURCE  Quixey", "source": "Reliance Trust"}