{"published": "2015-09-15T07:35:36Z", "media-type": "News", "title": "HyperSolar Surpasses Critical Voltage Threshold to Split Water Molecules for Renewable Hydrogen Fuel Production", "id": "35fd2296-e230-4061-b130-6cfa42128359", "content": ") - HyperSolar, Inc. (OTCQB: HYSR), the developer of a breakthrough technology to produce renewable hydrogen using sunlight and any source of water, today announced that it had reached 1.55 volts (V), a significant milestone achievement in its effort to split water molecules for the production of renewable hydrogen fuel.\n\nWhile the Company had previously met the challenge of exceeding 1.23 V, the theoretical minimum voltage needed to split water molecules into hydrogen and oxygen, a minimum of 1.5 V is needed to do so for commercially viable real world applications. Examples of these commercial applications include hydrogen-charging stations for fuel-cell vehicles, or warehouse transportation for big box retailers. The 1.55 V breakthrough, in a low-cost single solar cell element, is representative of the tremendous progression of the technology, as the Company announced its 1.4 V breakthrough just one month ago. The results were recorded at the University of Iowa campus research location where researchers are currently focused on further increasing the voltages and currents achievable from their inexpensive light driven hydrogen generation particles. \n\nFollowing this breakthrough, the company will focus its efforts on increasing the hydrogen production efficiencies of these particles by bonding the ideal fuel production catalyst to the low-cost high-voltage solar cell. In order to achieve this, the company is currently exploring two parallel approaches. The first is to identify materials that interface with well-known hydrogen production catalysts, such as the platinum on solar particles, to improve sunlight-to-hydrogen conversion efficiency. The second is to pursue methods that further increase photo voltages of solar particles to greater than 1.7 V that allow integration of cheaper earth abundant catalysts without significant loss in hydrogen production efficiency. \"This announcement represents one of the most important milestone achievements the Company has made to date,\" said Tim Young, CEO of HyperSolar. \"Both the University of Iowa and University of California, Santa Barbara teams have been instrumental in spurring the speed at which our technology has developed, resulting in this voltage breakthrough. We are focused on identifying the next steps for the technology that will make it possible for us to scale up to make a commercial technology that can produce hydrogen fuel at or near the point of distribution, using only water and sunlight.\" \n\nHyperSolar's research is centered on developing a low-cost and submersible hydrogen production particle that can split water molecules under the sun, emulating the core functions of photosynthesis. Each particle is a complete hydrogen generator that contains a novel high voltage solar cell bonded to chemical catalysts by a proprietary encapsulation coating. A video of an early proof-of-concept prototype can be viewed at http://hypersolar.com/application.php.\n\nAbout HyperSolar, Inc.\n\nHyperSolar is developing a breakthrough, low cost technology to make renewable hydrogen using sunlight and any source of water, including seawater and wastewater. Unlike hydrocarbon fuels, such as oil, coal and natural gas, where carbon dioxide and other contaminants are released into the atmosphere when used, hydrogen fuel usage produces pure water as the only byproduct. By optimizing the science of water electrolysis at the nano-level, our low cost nanoparticles mimic photosynthesis to efficiently use sunlight to separate hydrogen from water, to produce environmentally friendly renewable hydrogen. Using our low cost method to produce renewable hydrogen, we intend to enable a world of distributed hydrogen production for renewable electricity and hydrogen fuel cell vehicles. To learn more about HyperSolar, please visit our website at www.hypersolar.com. \n\nSafe Harbor Statement\n\nMatters discussed in this press release contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. When used in this press release, the words \"anticipate,\" \"believe,\" \"estimate,\" \"may,\" \"intend,\" \"expect\" and similar expressions identify such forward-looking statements. Actual results, performance or achievements could differ materially from those contemplated, expressed or implied by the forward-looking statements contained herein, and while expected, there is no guarantee that we will attain the aforementioned anticipated developmental milestones. These forward-looking statements are based largely on the expectations of the Company and are subject to a number of risks and uncertainties. These include, but are not limited to, risks and uncertainties associated with: the impact of economic, competitive and other factors affecting the Company and its operations, markets, product, and distributor performance, the impact on the national and local economies resulting from terrorist actions, and U.S. actions subsequently; and other factors detailed in reports filed by the Company.\n\nImage Available: http://www.marketwire.com/library/MwGo/2015/9/13/11G053799/Images/thumb_IMG_4151-1_1024-914721567119.jpg \n\nPress Contact:\n\nEric Fischgrund\n\nFischTank Marketing and PR \n\nEmail contact About Marketwired .", "source": "Sys-Con Belgium"}