{"published": "2015-09-04T10:43:03Z", "media-type": "Blog", "title": "2015’s Opening Game Predictions", "id": "005d3017-7e99-492b-ac40-7b0f56366f2c", "content": "Alright, alright, alright… the time is now for us to put down our thoughts and predictions about our opening game against the Youngstown State University Penguins .  A lot of newcomers have joined this blog since the end of last season so thanks to you guys for coming onboard and please don’t hesitate to join in. \n \nOnto the main stage event.  As I write this it’s 30 hours to game time and maybe 27 hours or so to meet up with old friends and make new ones while we talk about the present, past and future of the football program and in particular this 2015 team. \n \nWe all know about the rather dramatic changes the program and the athletic department have gone through since Dec 17 th when Paul Chryst left for Wisconsin and when our new Beloved Leader, Chancellor Mark Gallagher, dropped the ax on the neck of AD Steve Pederson’s tenure at Pitt. \n \nThat has discussed over and overt and now its time to move on to real football! \n \nWith that, here is your chance to give the world your Pitt vs. YSU game predictions.  Please add your thoughts on why you feel your prediction will come true and, if you feel like it, throw in some individual player’s work that you think will make it happen. \n \nI’m asking for your thoughts so I’ll start off with mine… \n \n\n \nIn my 2015 season prediction article  I wrote about the reasons I have some trepidation regarding our new Head Coach Pat Narduzzi’s debut and how it will affect the players’ on field play and the coaching staff’s in-game coaching in determining the outcome of the match.  I’m not 100% sold that Narduzzi is going to be able to go head to head this early in his career with a good, successful and well established YSU Head Coach Bo Pelini and win the game in a fashion most Pitt fans have been assuming will happen… which would be a blow-out Pitt win. \n \nThat may not be a concern for me after the Iowa game, especially if we do well in those  two games.  But right now there has to be a lot of wondering in the clubhouse and the coaches’ offices as to what product we’ll put out on the field of play. \n \nThat said, we have talented football players, some extremely so, on offense, who should be able to play through any worries they themselves may have and through any poor in-game decisions by the staff (and there will be a few).  If our incumbent QB takes the reins right out of the gate and shows true leadership of the offense then I’ll feel better about the outcome. \n \nHowever, as our commenter “Still the One” pointed out in his comments Wednesday; Narduzzi and Chaney are looking for a good performance from transfer QB Nate Peterman early on in the game.  I don’t believe it will be a ‘ wait until we are a huge lead ahead or big deficit  behind to play the backup QB ’  situation but that the staff has real need for them to see Peterman playing actual football against an opponent.  We’ll discuss the outcome of that move on Sunday I’m sure. \n \nHowever, just the offense picking up where it left off, and actually I don’t think it will especially with the jerry-rigged  offensive line and the uncertainty at WR, doesn’t guarantee us a win.  The defense has to be there in even better form than the offense to get a win. I believe our defense is still in a state of instability and is going to be changing on the fly during this game and week to week for a few games.  As I’ve said before I think Narduzzi and Conklin’s plan for single coverage by the cornerbacks is a problem waiting to show its face, at least in this first game. \n \nHere is what I think after reading, writing and digesting all the Pitt footballs news, notes and opinions since Pat Narduzzi signed on the dotted line: \n \nReed’s Take: \n  The game will close through three quarters with both teams leading at one point.  Conner gets less than 100 yards but scores two TDs.  Passing game will be OK with more use of our TEs and Peterman will impress in his playing time.  We create turnovers by aggressive defensive play but give up more passing (at least one big pass play) and rushing yards than we hoped we would.  Pitt pulls away in the 4th quarter to win…   \nPitt 27 – YSU 20   \n \nChip in with your thoughts as to what you think we’ll see and what the outcome will be.  We’ll take a look at our predictions on Sunday and talk about the outcome of this important game. \n \nNOTE :  We didn’t get many responses for suggestions on a meeting place for the pre-game Pitt Blather meeting.drink/bull throwing festivities.  So I’m asking you guys to meet at the Bettis Grill before the game.  I’ll be there at around 11:30. I’ll try to get there earlier but have a friend’s tailgate in Red 7 to visit also – he owes me $40 so I have to break his kneecap.  After that I’ll go over to Bettis’ and then leave around 12:30 or so for the press box. \n \nI can’t wait to see old friends and meet some new Blather followers.  Again, check the picture out on this post… I’ll be the guy with his head above almost everyone else’s, a blue polo shirt with “Blather” on it and longer hair and a DW style mustache.", "source": "Pitt Blather"}