{"published": "2015-09-19T14:15:25Z", "media-type": "News", "title": "Christmas holiday dollar-saving tips", "id": "e16a1737-bc0d-46be-900f-ef855e3737b4", "content": "We've got tips, tours and deals. \n\nThe dollar may be down, but that doesn't mean packing away the passport permanently. In fact, New research, Expedia Value Tracker, reveals the best value spots for a Christmas trip overseas, and even the US figures as a possibility. That's because currency fluctuations are not the only monetary movement to factor in. Changes in accommodation, flight and living costs all contribute to the value of a holiday.\n\nFor instance, New Zealand is the only destination where the Australian dollar currently goes further than it did a year ago, up four per cent year-on-year. But the average accommodation cost there has risen nine per cent, while average flight prices between NZ and Australia have decreased five per cent. That all adds up to Expedia considering New Zealand the best value option for Aussies right now.\n\nAs for the US, the fact that flight costs have dipped 10 per cent in the past year offsets the dollar drop of 21 per cent and counting – a little. Expedia says travellers might find better value across the border in Canada this year, where the Australian dollar has only fallen six per cent against the Canadian dollar and flights decreased by six per cent year-on-year. That's especially relevant for those considering a Christmas ski break.\n\nExpedia Australia and NZ managing director MD George Ruebensal suggests, however, you think creatively. \"If travellers are flexible about where they go, there are opportunities to save. And when thinking about Europe, that's exciting as there are so many amazing places to explore. For instance, why not consider Norway where the Aussie dollar has gained ground against the Norwegian krone and average hotel and flight prices have also decreased.\"\n\nThe Aussie has also gained more than 30 per cent against the Russian ruble.\n\nNo time to monitor it all? Sites like Expedia help. Its Scratchpad app tracks flight and hotel price movements for you. See expedia.com.au.\n\nThe story first appeared on The Sydney Morning Herald.", "source": "Nyngan Observer"}