{"published": "2015-09-28T07:13:01Z", "media-type": "News", "title": "Shell To Stop Oil And Gas Drilling In Alaska", "id": "e16c3d08-00b4-4e89-bd86-868c4d9d1d4a", "content": "Royal Dutch Shell has announced it is stopping its offshore explorations in Alaska, after early drilling revealed disappointing amounts of gas and oil. \n \nThe company was granted final permission to begin explorations below the ocean floor at the Burger J well, which is located off the north-west coast of Alaska, in August of this year but have now decided to abandon the operation. \n \nThe Chukchi Sea well has already been drilled to a depth of 6800 feet, but Shell say the small amounts of oil and gas they have discovered there are insufficient to warrant continuing to drill in the area.  \n \nIn a statement, the company said it would now \"cease further exploration activity in offshore Alaska for the foreseeable future\". \n \nThe announcement will be welcome news for protesters, who have strongly opposed Shell's plans to explore possible oil reserves in the Arctic on the basis that a spill would damage an environment which is already under significant threat from climate change. \n \nBut Shell have long believed that the Arctic region holds significant amounts of oil; the company spent 10 years and around $7bn (£4.6bn) on the project before ever receiving permission to begin drilling. \n \nCommenting on the decision to halt operations, the Director of Shell Upstream America, Marvin Odum, said: \"Shell continues to see important exploration potential in the basin, and the area is likely to ultimately be of strategic importance to Alaska and the US. \n \n“However, this is a clearly disappointing exploration outcome for this part of the basin.” \n \nIn addition to the disappointing results from the well, Shell have said the high costs and \"challenging and unpredictable\" regulatory situation involved with the drilling have also played a part in the choice to halt the project. \n \nThe company is likely to face a loss of $4.1bn (£2.7bn) due to abandoning the well, which is itself valued at $3bn with another $1.1bn tied up in \"future contractual commitments\". \n  \n © 2015 Sky News, all rights reserved", "source": "Metro Radio"}