{"published": "2015-09-28T14:30:27Z", "media-type": "Blog", "title": "CD REVIEW: Jeff Herr Corporation - Layer Cake", "id": "56fa59fb-cb31-4beb-bcfb-450d79875d22", "content": "Jeff Herr Corporation - Layer Cake\n(Igloo IGL 259. CD Review by Adrian Pallant)\nLuxembourg drummer Jeff Herr's Corporation has been in existence for some twelve years, though only since 2012 in this energetic acoustic trio format with saxophonist Maxime Bender and double bassist Laurent Payfert.\nThe concept of the chordless trio is enduringly attractive, its raw, exhilarating power, pulling into sharp focus the technical and expressive attributes of each player, whilst also requiring pin-sharp group co-ordination. Herr, Bender and Payfert clearly have this off to a fine art, injecting much invention into their original compositions and flowing performances – and frequently, it's Jeff Herr's sparky, varietal drumming and percussiveness which provide the foundation.\nListen closely… and this 50-minute recording bursts into life. Opening number The Funky Monkey marks out the terrain with fidgety, clattering drums and peppy, swooning sax – shades of Pierrick Pédron or Depart, but with a decidedly penetrating edge. Pushing things further, And So It Is hits an irresistibly intensifying, raga-like groove set up by bassist Payfert – and the improvised alto sax gyrations of Bender, against Herr's thunderous, perfectly-timed syncopations, seem unstoppable. Multi-coloured percussion in A-Rabi Dub perpetuates the Eastern thrill, as sparkling soprano sax chromatics soar over its bass-and-drum impetus; and Danse Sucrée is politely sweeter, offering Payfert's bass the space to dance en l'air.\nMore expansive outings are interspersed with miniatures. Wind's breathy, honking tenor and softly-malleted percussion might suggest the graceful flight of geese into the afterglow; and Rain captures a similar mood, as Herr's intensifying rattlings mimic heavy downpour. Melancholy is drenched in tearful sax, as is the arco-bass suspension of Le Regret; and an impressively intense burst of Euphoria, with perpetual-motion snare, crackling percussion and fantastically whining soprano sax, soon becomes drained of its energy. The gem of a revelation at the centre of this album is a reworking of David Bowie's The Man Who Sold the World. Memories of Lulu's original, husky vocals pale into the background as the familiar melodic lines (stated and then extemporised by Bender's tenor) are gradually twisted out of recognition by tricksy bass-and drum-rhythms, eventually resulting in a satisfying, solid rock-out. Journey to the Bliss highlights the depth of this trio's creativity, Herr's cicada-like percussion encircling Payfert's smoothly-phrased bass melodies before the entry of an enticing, slow, bluesy lead from Bender's tenor (the crisp production here especially evident); and the ruminations of closing title track Layer Cake are fabulously shot through with calypsonian verve, Bender's fluency echoing the joyful abandon of Sonny Rollins – and Herr almost steals the final word in a suitably resounding, exuberant finish. Adrian Pallant is a proofreader, musician and jazz writer who also reviews at his own site ap-reviews.com\nJeff Herr Corporation will play their first ever UK dates:\n– 29 September 2015 at Newcastle upon Tyne's Jazz Café – 30 September 2015. Vortex London\nLINK: PREVIEW/ INTERVIEW - Jeff Herr", "source": "LondonJazz"}