{"published": "2015-09-08T12:53:32Z", "media-type": "Blog", "title": "Andrew of Crete: The Redeemer of the human race willed to arrange a new birth and re-creation of mankind", "id": "e50b3194-8e8d-4223-a735-6ddb7148138d", "content": "The first creation of mankind occurred from the pure and unsullied earth;\n\nbut their nature darkened its innate worthiness, they were deprived of grace through the sin of disobedience;\n\nfor this we were cast out of the land of life and, in place of the delights of Paradise, we received temporal life as our inheritance by birth, and with it the death and corruption of our race.\n\nAll started to prefer earth to heaven, so that there remained no hope for salvation, beyond the utmost help.\n\nNeither the natural nor the written law, nor the fiery reconciliative sayings of the prophets had power to heal the sickness.\n\nNo one knew how to rectify human nature and by what means it would be most suitable to raise it up to its former worthiness, so long as God the author of all did not deign to reveal to us another arranged and newly-constituted world, where the pervasive form of the old poison of sin is annihilated, and granting us a wondrous, free and perfectly dispassionate life, through our re-creation in the baptism of divine birth.\n\nBut how would this great and most glorious blessing be imparted to us, so in accord with the divine commands, if God were not to be manifest to us in the flesh, not subject to the laws of nature, nor deign to dwell with us in a manner known to Him?\n\nAnd how could all this be accomplished, if first there did not serve the mystery a pure and inviolate Virgin, Who contained the Uncontainable, in accord with the law, yet beyond the laws of nature?\n\nAnd could some other virgin have done this besides she alone, who was chosen before all others by the creator of nature? This Virgin is the Theotokos, Mary, the most glorious of God, from whose womb the Most Divine came forth in the flesh, and by whom He Himself arranged a wondrous temple for Himself. She conceived without seed and gave birth without corruption, since her Son was God, though also He was born in the flesh, without mingling and without travail.\n\n[...] The Redeemer of the human race, as I said, willed to arrange a new birth and re-creation of mankind: just as the first creation, taking dust from the virginal and pure earth, where He formed the first Adam, so also now, having arranged His incarnation upon the earth, and so to speak, in place of dust He chooses out of all the creation this pure and immaculate Virgin and, having re-created mankind in His chosen one from among mankind, the creator of Adam is made the New Adam, in order to save the old.\n\nAndrew of Crete (c.650-740[?]): Oration 1 – Homily on the Nativity of the Most Holy Mother of God; translation of complete homily @ St George Greek Orthodox Cathedral.", "source": "Enlarging the Heart"}