{"published": "2015-09-14T08:07:35Z", "media-type": "News", "title": "Liberal leadership: Canberra spill throws Canning byelection wide open", "id": "7fef99dc-eeba-4be3-a980-2961f1c85c2e", "content": "Liberal Andrew Hastie faces an increasingly tough fight to win this weekend's Canning byelection, with political experts suggesting he could be hurt by a federal leadership spill and a Labor source saying he was \"Tony Abbot's candidate\" Liberal Andrew Hastie faces an increasingly tough fight to win this weekend's Canning byelection, with political experts suggesting he could be hurt by a federal leadership spill and a Labor source saying he was \"Tony Abbott's candidate\"\n\nFederal Communications Minister Malcolm Turnbull on Monday afternoon challenged Prime Minister Tony Abbott for leadership of the party, bringing to a head tensions over months of poor polling and internal division.\n\nNotre Dame University expert Martin Drum said the Canning byelection was now wide open following Mr Turnbull's declaration that the Prime Minister was not \"capable of providing the economic leadership our nation needs\".\n\nThe Liberal Party holds Canning with a 11.8 per cent margin and many polls leading up to the September 19 byelection - triggered by the death of veteran MP Don Randall - were already predicting an eight to 10 per cent swing to Labor.\n\n\"You don't challenge because you think there is a chance of losing a byelection,\" Dr Drum said, disputing Mr Turnbull's suggestion Canning would now be more winnable.\n\n\"There are bigger issues here. You will have voters that go to the ballot of Saturday that are happy Tony Abbott is no longer leader or disgusted by the disloyalty by Turnbull.\n\n\"It could go either way, but there would be deep concerns among voters given the speculation over the last 24 hours.\"\n\nA source inside the Labor camp said scenarios in which the Liberal leadership changed to Malcolm Turnbull, Julie Bishop or Scott Morrison had been \"war-gamed extensively\".\n\n\"As for our chances, it's pretty messy for the Liberal party and these things never go smoothly, and they're never a one-day event, and there are always losers,\" the source said.\n\n\"Hastie was the Abbott-backed candidate.\n\n\"Hastie's views on many issues are in line with Abbott and not Turnbull's, so it's going to be interesting to see how Turnbull reacts to Hastie.\"\n\nMeanwhile, Dr Drum said Hastie was the one person within the Liberal party who certainly wouldn't be chuffed with the timing of the leadership spill.\n\nMr Hastie, who attended a seniors forum alongside Labor rival Matt Keogh on Monday morning, declined to comment when asked about the spill on Monday afternoon.\n\n\"The polls were predicting a 10 per cent swing to Labor, but Liberal voters who go to the polls this Saturday won't like the internal divisions - so there could be a backlash against the party,\" Dr Drum said.\n\n\"It just depends how messy the fallout is over the coming days.\"\n\nMurdoch University senior political lecturer Ian Cook said he still expected the Liberal party to win in Canning despite the leadership spill.\n\nDr Cook said Mr Turnbull was just setting himself to take the credit for the win.\n\n\"I think Turnbull is expecting to win Canning and will claim that a win was down to him taking over,\" he said.\n\n\"He must think the party is going to win so he's just positioning himself to say 'I turned that around' and 'I was the one that put us back on track'.\n\n\"I don't know why Turnbull didn't wait until after the byelection.\"\n\nDr Cook said there were a lot of Liberal voters who did not like Abbott and might now return to the fold.\n\n\"It is hard to know how voters will react,\" he said.\n\n\"I guess some hate Abbott so much that they might go back to the Libs.\n\n\"But I expect that people will be more confused than see Turnbull as the new hope.\"\n\n- with the Mandurah MailFollow WAtoday on Twitter The story first appeared on WA Today.", "source": "Guyra Argus"}