{"published": "2015-09-06T13:22:07Z", "media-type": "Blog", "title": "Larwyn's Linx: Top Iranian General to US: We Will Cut Your 'Hands and Fingers'", "id": "6e217e44-7170-4e23-9f22-7f0ab4a6262d", "content": "Send us tips! Bloggers: install a Larwyn's Linx widget. Get real-time news, 24/7, at BadBlue.\nNation\nTop Iranian General to US: We Will Cut Your 'Hands and Fingers': Clarion\nHow bad is the Iran deal? Let’s count the ways: Amir Taheri\nReid to prevent vote on Iran nuclear deal: Rudy Takala\nHillary admits she’s bothered that voters think she’s a liar: Geoff Earle\nHillary Clinton’s Emails Show a Staff Praising Her and Dissing Obama: Carol Felsenthal\nBaby Organ Harvester to Hillary: \"You're My Personal Hero\": Sarah Zagorski\nKate’s Parents Strike Back: Debra Saunders\nWhy this illegal alien, a convicted felon can’t be deported will infuriate you!: Unyielding\nLarge crowds turn out for pro Kim Davis rally: FAM\nHow To Restrain The Supreme Court: DavidPatten\nA Reader Has A Bumper Sticker For ”¡Jeb! “: VDARE\nThat State Dept. staffer pleading the Fifth?: Jimmy Princeton\nEconomyObama: I'll veto any budget if it limits spending: Rudy Takala\nThanks to Michelle Obama, 1/2 of School Cafeteria Workers Lose Their Jobs: RWN\nChicago has eight gun homicides in one day; #BlackLivesMatter protests budget: Twitchy\nScandal CentralThree Illegal Alien/Obama DREAMers/MS13 Gang Members Kill Teen In Virginia: Treehouse\n\"Sorry you're so confused,\" she said hopefully: Paul Mirengoff\nHillary Plotted With Idiot Blumenthal to Overturn First Amendment: Brendan Bordelon\nClimate & EnergyCould the U.S. Meet Its Electricity Needs With Solar Energy?: John Hinderaker\nWhat the President Didn’t See From Alaska: Denali\nChina’s Worst Nightmare - The US’s Oil Weapon: Tingbin Zhang\nMediahow do I get out of this suicide pact: Fredrik deBoer\nIf Republicans can’t get at least 20 ads out of this Hillary sound bite they’re doing it wrong: Doug Powers\nHillary Clinton Weighed Down By Huma Abedin Millstone: Profit Confidential\nCop Executed in Cold Blood -- Why Isn't EVERYONE Mad As Hell?: Ian Tuttle\nThe Media is Covering for #BlackLivesMatter by Ignoring Their Violence: ProgsToday\nHow Mainstream Media and Social Media Present COMPLETELY Different Views Of Syrian Immigrant Crisis: Sooper\nWorldIran Deal: Barbarity Wins: Guy Millière\nIran Deal Will Trigger Major War in Middle East: Nima Gholam Ali Pour\nMuslim Countries Refuse to Take Syrian Refugees, Cite Risk of Exposure to Terrorism: Breitbart\nTennessee: 7th graders made to write “Allah is the only God,” learn Islam: Creeping\nThe mysterious Bolivian ship and its tons of weapons: Fausta\nTanks Get Green Makeover as USAREUR Shifts Focus to Europe: John Vandiver\nSci-Tech (courtesy BadBlue Tech News)Exclusive: Google's \"New\" Search Icon Was Created in 2008 by Russian Designer: Jason Mick\nThere is Planet X after Pluto in Kuiper Belt, say Astronomers: Anirudh Madhav\nThe 10 Commandments of Rational Debate: Joseph E. Postma\nCornucopiaThe Politics of Star Trek: Timothy Sandefur\nThis Cruz Ad Serves Up Some Truth About How Americans Feel About Hillary: TPI\nTed Cruz: Will the “wacko bird” soar like an eagle?: Atarah Pinder\nImage: Trump Has Succeeded in Convincing Conservatives to Discard their Principles Overnight\nToday's Larwyn's Linx sponsored by: #ReadyForLiberty: TED CRUZ FOR PRESIDENT\nQOTD: \"As migrants continue to pour over the borders of Italy and Hungary, and from there to spread out into the rest of Europe, the continent is becoming increasingly and irreversibly Muslim. Europe is lost to Islam.\" --Guy Millière", "source": "Doug Ross @ Journal"}