{"published": "2015-09-12T00:57:12Z", "media-type": "News", "title": "Coach: Serena lost her way mentally and tactically", "id": "c3422aeb-565f-48fe-87bf-beb34963883a", "content": "NEW YORK — Time and time again Serena Williams escaped during this Grand Slam season on her quest to sweep all four majors. But finally, on Friday, she hit a roadblock that caused her not just to trip, but to fall.\n\nThat hurdle came in the most unlikely of forms in Roberta Vinci, a 32-year-old world No. 43 who was making her debut appearance in a Grand Slam semifinal.\n\nIt also came in the form of unthinkable pressure loaded onto the shoulders of the 33-year-old world No. 1, who was trying to sweep all four majors in a calendar year for the first time since 1988, when Steffi Graf did so.\n\n\"I don't think we can understand the scale of what she felt,\" said Leif Shiras, a TV commentator for British broadcaster Sky Sports and former player in an interview. \"It's tough to play against history. You have to feel like her loss is a symptom of that pressure.\"\n\nWilliams swatted away any suggestion that her Friday demise — after 26 Grand Slam match wins this year and 33 dating to Wimbledon last season — was due to expectation of the moment.\n\n\"I told you guys I don't feel pressure,\" a tired Williams told reporters in a news conference. \"I never felt pressure. … I never felt that pressure to win here. I said that from the beginning.\"\n\nFrom the beginning of 2015, however, Williams' drive for the Grand Slam has been a fragile, bumpy one. At the French Open she worked through five three-setters, the most of any major in her career; at Wimbledon she trailed Heather Watson by two breaks in the third set in the third round; a week ago Bethanie Mattek-Sands had her on the ropes in a night match.\n\nEach time, a Serena 'W;' but not today.\n\n\"Today was not a good day,\" her coach, Patrick Mouratoglou, told a small group of reporters, saying Williams woke up feeling off.\n\n\"Players are humans,\" he continued. \"How many times did it happen this year where she felt like this and she still found her way through? She didn't find her way today.\"\n\nEven Vinci, undone by Williams four times (all in straight sets) coming in, could see the most feared opponent in tennis looking tentative, double faulting, yelling at herself to find a way.\n\n\"(In) my mind, I say, 'Think about this, she's nervous,'\" a smiling Vinci said. \"So I tried to keep fighting for every single point.\"\n\n\"It was apparent to all of us who have watched her for 20 years that she was nervous today,\" Chris Evert said plainly on ESPN.\n\nIt was a different kind of match than most of her three-setters at the majors, however. Seven times she had come back from dropping the first set. But only once in a three-set match did she drop the second – as she did Friday – and then right herself.\n\nIn the third set against Vinci, Williams appeared lost and at times confounded, however. She barked at herself at one moment, all of Arthur Ashe yelling shouts of encouragement. The next, she was quieting herself — palm towards the ground — trying to stay calm.\n\n\"I was just trying to win points at that point and win the match,\" she explained.\n\nOne shouldn't underestimate the emotional impact of the Slam, Shiras said.\n\n\"The toll of this journey she was on was too much for her today,\" Shiras said. \"She was trying to dig deep and the way to generate energy for her is to get that passion out. But I think that can tire her; there is an element of fatigue that plays into this story. She was at a breaking point; she was boiling. And Vinci was drawing that out of her. It was amazing drama.\"\n\nThe pressure finally got to Serena Williams and killed her Grand Slam dream\n\nDrama with a twist: On this day, the 21-time major champion, chasing history in front of a home crowd, with more power on her racket than anyone in the game was on the losing end. A defeat with a capital 'D.'\n\n\"Every loss is difficult,\" Mouratoglou said. \"I think she lost her way mentally. Tactically she didn't know what to do. When you make the wrong choices, you lose the points you're supposed to win and then you make more and more wrong choices. She lost her way on the path tactically.\"\n\nA road that started in Melbourne ends in New York — and not in the way Williams imagined.\n\nPHOTOS: All the action at the U.S. Open semifinals", "source": "USA Today"}