{"published": "2015-09-30T12:02:24Z", "media-type": "News", "title": "China Stocks Rise, Paring World’s Worst Quarterly Performance: SouFun Holdings Ltd (SFUN), Youku Tudou Inc (ADR) (YOKU), Vipshop Holdings Ltd – ADR (VIPS)", "id": "46c48a21-560c-473f-b02c-b60773c22a0e", "content": "  \n \nChina’s stocks rose, paring the biggest quarterly loss since 2008, as the government struggled to halt a $5 trillion rout and the world’s second-largest economy showed signs of a sharper slowdown. \n \nThe Shanghai Composite Index tumbled 29 percent since the end of June, the biggest slump among benchmark global gauges. The measure rose 0.5 percent to 3,052.78 at Wednesday’s close on turnover 55 percent below the 30-day average. Automakers led gains after the government cut a tax on vehicle purchases. China’s financial markets will be shut from Thursday for weeklong National Day holidays. \n \nThe value of shares traded on mainland bourses plunged 87 percent from the June record as the equity boom turned to bust and the government took unprecedented measures to shore up stocks — including banning major shareholders from selling and curbing index futures trading. Leveraged wagers, which helped fuel gains in the first half of the year, have tumbled by 60 percent since the peak, while the government has wiped out nearly 70 percent of unregulated margin lending. President Xi Jinping said last week equities have entered a phase of “self recovery,” signaling policy makers will pare back support as volatility subsides. \n \n“The government’s clampdown on non-compliant margin financing has hit the Chinese equity markets hard,” said Bernard Aw, a strategist at IG Asia Pte in Singapore. “We however may see some upside potential in the fourth quarter, as much of non-compliant margin trading accounts have been cleared. Further weakness in the Chinese economy may see investors keeping to the sidelines.” \n \nHong Kong’s Hang Seng China Enterprises Index rose 1.9 percent, paring its losses this quarter to 28 percent. The Hang Seng Index added 1.4 percent, trimming its three-month decline to 21 percent. \n \nShares of SouFun Holdings Ltd ( NYSE:SFUN ) traded up +6.51% during last trading session on a U.S. exchange, closing at $6.22. The share price of this stock traded recently in a range of $5.78 to $6.47. The company now has a market value of $2.51 billion. The stock, after recent close, is -0.72% below their SMA 50 and -42.05% below the 52-week high. The worst hit in its 52 week range is $4.65 per share, with $11.11 as its 52 week best price. Its latest closing price has a distance of +10.08% from SMA20 and is -11.11% below than SMA200. \n \nYouku Tudou Inc ( ADR ) ( NYSE:YOKU ) closed U.S. trading at $16.84, up +0.62 points or +3.82% from previous close. The year-to-date ( YTD ) performance reflected a -5.45% below last year. During the past month the stock loses -4.37%, bringing three-month performance to -31.35% and six-month performance to +34.72%. For this company, beta value at 2.76 represents it is more volatile to the shift in the market. If we take a look on its volatility, 5.55% was seen in a week and for the month it was 5.58%. \n \nVipshop Holdings Ltd – ADR ( NYSE:VIPS ) settled at $16.21 during New York trading, up +0.36 points or +2.27% from previous close and at a distance of +1.96% from 20-day simple moving average. In the last trading session, the stock’s price moved -11.65% below its 200 day moving average, changing hands as low as $15.79 per share. The stock is currently trading -6.51% below its SMA 50. This stock is more risky when compared to the shifts in the equity markets as its beta value is standing at 1.13. To measure price-variation, we found this stock’s volatility over a week period was 5.55% and for the month was 5.58%. \n \n ", "source": "WS Observer.com"}