{"published": "2015-09-30T18:44:55Z", "media-type": "News", "title": "NVIDIA’s Equal Weight Rating Reaffirmed at Pacific Crest (NVDA)", "id": "165befb3-7750-4ac6-89b9-8f590a72a24a", "content": "Pacific Crest restated their equal weight rating on shares of NVIDIA (NASDAQ:NVDA) in a report issued on Tuesday morning, AnalystRatings.Net reports. \n \nNVDA has been the topic of several other research reports. Zacks downgraded NVIDIA from a buy rating to a hold rating in a research note on Wednesday, August 12th. Vetr upgraded shares of NVIDIA from a hold rating to a buy rating and set a $21.45 price objective for the company in a research report on Monday, June 15th. Macquarie  reiterated a buy rating and set a $26.00 target price on shares of NVIDIA in a report on Wednesday, September 23rd. Raymond James  restated a buy rating on shares of NVIDIA in a research note on Sunday, August 9th. Finally, Wedbush  reiterated an outperform rating and issued a $24.00 target price on shares of NVIDIA in a research note on Friday, June 12th. Two analysts have rated the stock with a sell rating, fourteen have given a hold rating and twelve have given a buy rating to the company. The company  has an average rating of Hold and a consensus price target of $24.13. \n \nIn other NVIDIA news, EVP Debora Shoquist sold 29,903 shares of NVIDIA stock in a transaction on Wednesday, August 12th. The shares were sold at an average price of $23.82, for a total value of $712,289.46. The transaction was disclosed in a filing with the Securities & Exchange Commission, which can be accessed through the SEC website . Also, CEO Jen Hsun Huang sold 170,000 shares of NVIDIA stock in a transaction on Monday, August 17th. The shares were sold at an average price of $23.32, for a total transaction of $3,964,400.00. The disclosure for this sale can be found here . \n \nNVIDIA ( NASDAQ:NVDA ) traded up 3.33% on Tuesday, hitting $24.50. The stock had a trading volume of 9,747,373 shares. NVIDIA has a one year low of $16.77 and a one year high of $24.58. The stock’s 50 day moving average is $22.71 and its 200 day moving average is $21.69. The stock has a market cap of $13.21 billion and a price-to-earnings ratio of 26.06. \n \nNVIDIA (NASDAQ:NVDA) last posted its quarterly earnings data on Thursday, August 6th. The computer hardware maker reported $0.34 earnings per share (EPS) for the quarter, topping the consensus estimate of $0.10 by $0.24. The firm had revenue of $1.15 billion for the quarter, compared to analyst estimates of $1.01 billion. During the same period in the prior year, the company posted $0.30 EPS. The firm’s quarterly revenue was up 4.5% compared to the same quarter last year.  Analysts anticipate that  NVIDIA will post $0.80 earnings per share for the current year. \n \nThe business also recently announced a quarterly dividend, which was paid on Friday, September 11th. Shareholders of record on Thursday, August 20th were paid a dividend of $0.0975 per share. The ex-dividend date  was Tuesday, August 18th. This represents a $0.39 dividend on an annualized basis and a dividend yield of 1.65%. \n \nNVIDIA Corporation ( NASDAQ:NVDA ) is engaged in visual computing, enabling individuals to interact with digital notions, information and entertainment. The Company is engaged in creating NVIDIA-branded products and services, offering its central processing units to original equipment manufacturers (OEMs), and licensing its intellectual property. NVIDIA- branded products and services are visual computing platforms that address four marketplaces: Automotive, Enterprise, High Performance Computing & Cloud, and Gaming. The Organization operates in two sections: Graphics Processing Unit (GPU) and Tegra Processor. The Business ‘s GPU product brands include GeForce for gamers; Quadro for designers; Tesla for learning, researchers and big-data analysts; and GRID for cloud-based visual computing users. The Organization ‘s Tegra central processing units are primarily built to enable its branded stages: SHIELD and DRIVE.", "source": "SleekMoney"}