{"published": "2015-09-05T10:31:40Z", "media-type": "News", "title": "Mercedes To Dominate – If It Stays Dry", "id": "5d2b9a6c-7d6d-43e3-89fe-e544799e5612", "content": "Boosted by upgraded engines, Lewis Hamilton topped a Silver Arrows one-two in both of Friday’s sessions with Ferrari, their distant nearest challengers, over half a second adrift. \n \nHowever, the threat of rain has loomed large over the race weekend and a storm duly drenched the Monza region on Saturday morning – although the wet weather had started to clear by 9am local time with a clear picture forecast for the remainder of the day. \n \nPractice Three was likely to take place on a wet, but drying track. \n \nSpeaking after topping both sessions on Friday, Hamilton told Sky Sports: ‘It was a good day, but a testing day, with lots of things to try. The car has been feeling good and there is great pace from the team.’ \n \nDespite being slower than Hamilton throughout both sessions, Nico Rosberg briefly threatened to record the day’s quickest laps before losing time relative to his teammate in the final sector of his last flying lap. \n \n‘I lost it in the last two corners and I’m not happy about that because he just seems to be quicker there at the moment,’ the German rued. ‘I definitely need to work on that tonight and look at his on-board to figure out what he is doing differently and try to do the same tomorrow.’ \n \nFerrari, meanwhile, are braced for a tough weekend at their home race. \n \nSignificantly slower than the works Mercedes cars after the world champions spent their remaining engine development tokens to introduce new power units at a circuit where 70% of the lap is run at full throttle, the Scuderia look to be under threat just to be the best of the rest from the Mercedes-powered customer teams of Force India, Lotus and Williams. \n \n‘We can and we have to improve for tomorrow,’ admitted Sebastian Vettel. ‘It’s always difficult to tell where people are on Friday, but they are very strong. It’s no surprise – if they are not on the front row tomorrow that would be a surprise but we like surprises so we’ll do our utmost to turn things around.’ \n \nThe Mercedes cars were described as ‘sensational’ by Sky F1 pundit Martin Brundle from his vantage point as a trackside observer, although the subsequent rain showers will have since washed away the grip levels built up from Friday’s running. \n \nWhile the remainder of Saturday isn’t yet completely clear of rain threats, conditions are set fair for race day when Mercedes will be confident of extending their lead of the Constructors’ Championship beyond 200 points. \n \nThe post appeared first on Island FM .", "source": "Island FM"}