{"published": "2015-09-19T23:32:28Z", "media-type": "News", "title": "Lewis Hamilton: I can still win Singapore Grand Prix from fifth on grid", "id": "17713a59-e893-41de-89bc-8e5d6df51da2", "content": "Lewis Hamilton was left baffled by his team's dramatic drop in performance in Singapore but he refused to give up hope of winning under the lights on Sunday. \n \r\n\t\t\r \nHamilton, bidding to match Ayrton Senna's record of 41 career wins from 161 starts, had claimed pole in 11 of the 12 previous races but qualified only fifth at the Marina Bay Circuit. \n\r  Things did not go to plan for Lewis Hamilton during Saturday's qualifying session \r \r \nThe world champion was 1.5 seconds slower than Ferrari's Sebastian Vettel, who claimed his inaugural pole in the red of Ferrari and the team's first in over three years.  Hamilton will be joined on the third row by his Mercedes team-mate Nico Rosberg. \n\r\n\t\t\t\r \n\"I did everything I could today. I am ahead of Nico, I lost a little bit of time in the last couple of corners but it would not have made any difference in terms of my position,\" Hamilton said. \n\r\n\r\n\r\n\r \n\"So I am going to approach it the same as I do every race. I want to win and there is no reason why you can't win from fifth. \n\n\"The guys ahead have been quicker all weekend, so you have to assume that is going to be the same tomorrow, but I go with the mentality of trying to win.\" \n\nHamilton and his Mercedes team are pinning the blame for their lacklustre showing on their tyres. \n\nThe Mercedes drivers, who both complained of a lack of grip on Saturday, were called to see the stewards after the last race in Italy following a tyre pressure breach. After a lengthy investigation Hamilton's win, his seventh of the campaign, stood. \n\r\n\t\t\t\r \n\"We have not lost any performance on our car, the drivers have not lost any performance, so there is only one way it can come from and it is obviously the tyres. But I don't know why that is the case,\" Hamilton, who failed to qualify on the front row for the first time in 19 races, said. \n\n\"I am challenging my team to find out what it is - whether it is in tyre pressures, temperatures, blankets, ride heights - I am challenging them to find out so we can win tomorrow. \n\n\"I don't remember another time in my Formula One career where something like this has happened, where we have not changed anything on the car but we are a second and a half down. \n\n\"It is a new experience for us but I have no reason to believe it is going to continue for more races. It might just be track dependant.\" \n\r\n\t\t\t\r \nRosberg, who trails Hamilton by 53 points ahead of Sunday's race, admitted he was blown away by Vettel's display. The four-times world champion was over half a second quicker than anyone else. \n\n\"Everybody is massively surprised and we did not see it coming,\" said Rosberg of his team's performance. \n\n\"We don't understand it for now and we tried a lot of things because we understood we had a bit of an emergency situation. \n\n\"I looked at Sebastian's on-board camera and, I  didn't  really want to, but I shouted out loud in the engineering room 'what the hell?' It seems like he is on a different planet in some  corners .\" \n\n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Horncastle News"}