{"published": "2015-09-22T13:15:27Z", "media-type": "News", "title": "From Chemo-therapy to Retail-therapy: Inspirational second half of life career change", "id": "03ff3eab-ecb9-4292-ba60-ec829abe526d", "content": "Tethered to an IV, Debbi Hensling would shop online for a pink bauble to commemorate her battle to beat breast cancer. Amazed by the talent of so many jewelry designers, she decided to introduce them to her friends & colleagues - most of whom were women balancing careers & families like her with little time to shop. As a clinical psychologist, Dr. Hensling made her entrepreneurial leap with the confidence that only comes with age. \n\nA mother of four, Hensling admits, \"The timing was right. My children were grown and I had just beat breast cancer - two milestones that made me appreciate how short life is.\" About to embark on the second half of her life in an entirely different field, she acknowledges the challenges of her e-commerce site GEMZ.GALLERY. \"I did not know very much about the jewelry industry initially and even less about e-commerce but I have always welcomed a challenge.\" And it appears she has risen to the challenge, as her warmth and humor are seen throughout the easily navigated site, introducing a much less formal and welcomed approach to selling fine jewelry online. \n\nHensling, a Baby Boomer with boundless energy and determination, quickly responds when asked if there is a relationship between fine jewelry and psychology. \"Yes, both industries serve people - one seeks your services for a problem, the other for a celebration.\" Her propensity to help others is evidenced by her donation of ALL profit during May & October to charities that have meaning in her life. \n\nGEMZ.GALLERY caters to professionals and domestic engineers with Dr. Hensling modest about her celebrity clientele. \"All our clients appreciate jewelry that accentuates their individuality.\" Unwilling to compromise quality and too busy to sort through quantity, busy individuals find GEMZ.GALLERY to be the perfect solution for jewelry that will take them from the boardroom to the Red Carpet or an anniversary dinner. They sell only fine jewelry with prices starting at $1000, made by individual designers, with many pieces made to order. Hensling personally invites the talented designers featured on her site because as she notes, \"We take the time to know what our clients are interested in.\" The site's global storefront, international selection, competitive pricing, free shipping & guarantee makes shopping with GEMZ.GALLERY an obvious choice for those with discriminating taste. Psychobabble optional. \n\nhttp://gemz.gallery \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/from-chemo-therapy-to-retail-therapy-inspirational-second-half-of-life-career-change-300145735.html \n\nSOURCE GEMZ.GALLERY \n\nhttp://rt.prnewswire.com/rt.gif?NewsItemId=LA06304&Transmission_Id=201509220900PR_NEWS_USPR_____LA06304&DateId=2015", "source": "Individual.com"}