{"published": "2015-09-03T18:30:00Z", "media-type": "News", "title": "Angkor Gold Announces Retirement of Adrian Mann", "id": "f7e16c6a-a15f-4a95-bef7-1d08155fc2d3", "content": "  \n\r GRANDE PRAIRIE, AB / TheNewswire / September 3, 2015 - ANGKOR GOLD CORP. (TSXV: ANK) (“ANGKOR” ) announced today the retirement of Dr. Adrian Mann, VP of Exploration effective August 31, 2015. Dr. Mann joined the Company in 2009 as a consultant overseeing Angkor Gold’s Cambodian properties and assumed the role of Vice President of Exploration in 2011. He has been a key contributor in helping guide Angkor towards a royalty derived revenue stream through the development of Angkor’s huge land package.\r \n  \n\r\nThe Company would like to thank Dr. Mann for his exceptional contribution to its success and wishes him well in the future.\r \n  \n\r\n“Adrian’s vision and leadership was instrumental in delivering significant value to Angkor Gold’s shareholders for many years.  In particular, his experience and judgment was crucial in the identification and eventual sale of the Phum Syarung project, which is now in the final stages of development and soon to secure its extraction license from the Cambodian authorities,” said John-Paul Dau, ANGKOR’s VP of Operations.  \r \n  \n\r\n“Adrian’s dedication to the country and company are pillars on which ANGKOR has built its suite of world-class assets which include CW and Halo.  And he has put in place an exceptional exploration team to lead the business forward,” said Dau.\r \n  \n\r\nDr. Mann will remain available to the Company on a consulting basis as required while the Company continues to advance its flagship properties.  A decision regarding the appointment of a new VP of Exploration will be made at an appropriate time in the near future.\r \n  \n\r\nCEO Mike Weeks commented, “Adrian improved the geological skillset of every person on the team; we all learned a great deal from him and he will remain our own pillar of wisdom, our ‘Obie Wan’, well past retirement.”  \r \n  \n\r\nDelayne Weeks, VP Social Development added, “Adrian exemplified everything about ANGKOR – how to accomplish far more with far less.  I am really proud to call him my colleague and wish him a wonderful retirement.  It has been a privilege and an honor to work with Adrian.” \r \n  \n\r ANGKOR ’s seven exploration licenses in the Kingdom of Cambodia cover 1,448 km 2 , which the company has been actively exploring over the past 6 years. The company has now covered all tenements with stream sediment geochemical sampling; the company has flown low level aeromagnetic surveys over most of the ground; drilled 21,855 meters of NQ core in 190 holes; and has collected in excess of 110,000 termite mound, and ‘B’ and ‘C’ zone soil samples in over 20 centres of interest over a combined area of over 140km2, in addition to numerous trenches and detailed geological field mapping. Exploration on all tenements is ongoing. \r \n  \n\r ANGKOR GOLD CORP. , a public company listed on the TSX-Venture Exchange, is Cambodia’s sole North American public gold explorer with a large land package and first-mover advantage. ANGKOR has longstanding relationships with all levels of Government (local to national). \r \n  \n\r For further information please  visit our website at www.angkorgold.ca  ; email us at info@angkorgold.ca  , or contact: \r \n \n\r Mike Weeks, President \r \n \n\r            Telephone: (780) 568-3801 \r \n \n\r             Email: mw@angkorgold.ca \r \n  \n\r NEITHER TSX VENTURE EXCHANGE NOR ITS REGULATION SERVICES PROVIDER (AS THAT TERM IS DEFINED IN POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE. \r \n \n\r THIS PRESS RELEASE, REQUIRED BY APPLICABLE CANADIAN LAWS, IS NOT FOR DISTRIBUTION TO U.S. NEWS SERVICES OR FOR DISSEMINATION IN THE UNITED STATES \r \n \nCopyright (c) 2015 TheNewswire - All rights reserved.", "source": "TheNewswire.ca"}