{"published": "2015-09-04T07:20:45Z", "media-type": "News", "title": "PATRIOTS NOTEBOOK: Cuts are coming around the NFL", "id": "6b5edf78-f388-4e1b-bcc9-bd9f9c89f346", "content": "FOXBORO – The first cut isn’t the deepest in the NFL. The second one is. This past Tuesday, teams were required to cut their rosters from the 90 men they were permitted to bring to training camp to 75. By 4 p.m. Saturday, teams will be required to cut to the regular-season limit of 53. In the Patriots’ case that means at least 21 of the players who were on their active roster for Thursday night’s 12-9 loss to the New York Giants in the teams’ preseason finale at Gillette Stadium will no longer be there come Saturday night. While the Patriots are currently at 75, with running back LeGarrette Blount staring at a one-game suspension for violating the league’s substance abuse policy, they’ll be allowed to actually carry 54 players into the regular season. “It’s an unfortunate part of the game when you can’t keep all of the players who have worked hard and done everything that you’ve asked them to do,” Patriots head coach Bill Belichick said recently. “You have to make some tough decisions, but that’s part of it. That’s the National Football League. Not the great part of the job.” Don’t think that the Patriots’ active roster will necessarily be set come Saturday night, however. In addition to establishing their 10-man roster (a process that can be undertaken on Sunday), the Patriots made 11 moves involving their active roster following the league’s final cutdown date a year ago. Obviously, in hosting Pittsburgh as the reigning Super Bowl champions in the NFL regular-season kickoff at Gillette on Sept. 10, the Patriots (like the Steelers) will be operating within a much tighter time constraint this year. Who are those guys?: Google the term “amateur hour” in today’s Internet world and you’re liable to find a YouTube video of Thursday night’s game. Even under the variable pricing format the Patriots implemented for their season ticket holders a year ago this one was overpriced. Consider some of the central figures in this NFL non-classic: Ryan Lindley threw 45 times, completing 22 for 253 yards and no touchdowns (there weren’t any scored on this night) with one interception in a complete-game effort for the Patriots that concluded with him getting sacked by Giants defensive end Damontre’ Moore and coughing up the ball for a turnover at the New York 12 in the final minute. Ryan Nassib completed 16-of-32 passes for 193 yards and no TDs with no interceptions for the Giants. Tight end Asante Cleveland, he of the zero career receptions in six regular-season games, tied for the Patriots’ team lead with four catches for 38 yards; Page 2 of 2 - Linebacker-defensive lineman Xzavier Dickson, the Patriots’ 253rd and last pick in this year’s draft, was the team’s second-leading tackler in the game with seven. Keep those names in mind. Some of them will soon be appearing in the “NFL transactions” section of a newspaper near you. Oh, well, at least those in attendance will always be able to tell their grandchildren about the night they saw Chris Boswell outkick Stephen Gostkowski, four field goals to three, in Foxboro. On this night, Tom Brady didn’t even take the field – for warmups. A woman’s touch: The officiating crew for the game included line judge Sarah Thomas, the league’s first full-time female official.", "source": "Herald News"}