{"published": "2015-09-10T14:15:00Z", "media-type": "News", "title": "Healthy Weight Commitment Foundation And Discovery Education Empower Students Nationwide To Fight Childhood Obesity With Renowned Wellness Initiative", "id": "06f62e79-b7a2-4808-8ee6-68942d1ee735", "content": "SILVER SPRING, Md. , Sept. 10, 2015 /PRNewswire/ -- The Healthy Weight Commitment Foundation (HWCF), a CEO-led coalition of more than 300 organizations dedicated to helping families and schools fight childhood obesity, and Discovery Education , the leading provider of digital content and professional development for K-12 classrooms, announced today new features of the Together Counts™ program for the 2015-2016 school year. Established in 2010, the Together Counts program is a comprehensive initiative designed to positively impact students to live active and healthy lifestyles. \n\nEducators and students across the country have access to all new resources and state-of-the-art curriculum and activities, and the chance to win more than $170,000 in prizes for their schools including: \n   Healthy Playground Makeover Sweepstakes : Administrators, teachers, parents and community members can enter this year's Sweepstakes for a chance to win one of two grand prizes for their school, including $30,000 in cash and sporting goods and two new Unity Dome Playgrounds from Playworld, a leading manufacturer of imaginative playground and fitness equipment, valued at $15,500 each. Recognizing the importance of supporting low-income schools, the Sweepstakes will award one of the grand prizes to a school that qualifies for Title I funding. Three runner-up winners will each receive a $5,000 cash prize. Sweepstakes closes March 25, 2016 . Smart From The Start Awards : The Smart from the Start Awards encourage preschool teachers to design and implement wellness initiatives in their classrooms that improve nutrition and physical activity to jumpstart healthy habits at a young age. The grand prize winner will be awarded $20,000 , while 10 runner-up participants will each win $2,500 . Smart from the Start is part of an ongoing commitment made to the Clinton Global Initiative. Entries close March 3, 2016 . Health and Wellness Curriculum : To help educators and families teach students about the importance of a healthy, active lifestyle, TogetherCounts.com is providing schools and families with free tools that promote health and wellness. This online curriculum features standards-aligned, interactive lesson plans and teacher-to-teacher guides for grades K-5. Additionally for Pre-K educators and families, SmartStartPreK.com provides age-appropriate content and hands-on activities to teach the importance of a balanced lifestyle. New Farming Spotlight Resources : The Farming Spotlight is an all-new Together Counts portal for grades 3-8 that explores important STEM and agricultural concepts and empowers educators to teach students how food is grown. Created by Discovery Education experts, the Farming Spotlight is designed for use alongside existing STEM instruction both in classrooms or STEM clubs. Interactives, lessons on soil pH, genetics and photosynthesis, and more, these resources help teachers engage students in the world of STEM. \nAvailable at no cost through TogetherCounts.com , schools, families and communities nationwide can utilize these resources to build healthy environments and reduce childhood obesity. The program also encourages community members to share their efforts around active and healthy living by using #HealthyCommunities on social channels, and become a part of the conversation by following @TogetherCounts on Twitter and on Facebook, https://www.facebook.com/togethercounts . \n\n\"The Together Counts' lesson plans and interactive activities provide my students with the knowledge and tools they need to make healthy decisions and live balanced lifestyles\" said Millie Seiber , Principal of Southside Elementary. \"This program gives us the tools and resources to help reinforce these life lessons both in and outside of the classroom.\" \n\nResults from a recent impact study show that students who engaged in the program's curriculum experienced increased understanding of the balance between food intake and physical activity. Further, data revealed students exposed to the curriculum added one or more physical activities per week to their routine while also making healthier nutrition choices. Additionally, more than 90% of educators who implemented the curriculum in their classroom felt it made an impact and their students had a better understanding of key concepts. \n\n\"We are delighted to continue our work with Discovery Education through the Together Counts campaign.  This free online curriculum is one of the most effective tools that we have to reach children through their parents and at school and provide them with the lessons they need to better understand the connection between the calories we burn with the calories we consume\" said Lisa Gable , President of the Healthy Weight Commitment Foundation. \n\n\"Discovery Education is proud to continue our partnership with the Healthy Weight Commitment Foundation to empower students across the country to fight childhood obesity\" said Lori McFarling , Senior Vice President, Discovery Education. \"Through an innovative digital platform that delivers a comprehensive range of engagement opportunities, the Together Counts program ensures that students and educators in every classroom in America have access to hands-on tools that empower healthy, active and balanced lifestyles.\" \n\n\"At Playworld, we recognize the impact and value that play provides,\" said Kevin Cook , director of sales for Playworld. \"We're proud to partner with the Healthy Weight Commitment Foundation to help low-income schools increase access to unstructured outdoor play for students.\" \n\nAbout Healthy Weight Commitment Foundation \nHealthy Weight Commitment Foundation (HWCF), formed in 2009, is a CEO-led organization whose national, multiyear effort is designed to help reduce obesity—especially childhood obesity.  As part of a commitment with the Robert Wood Johnson Foundation and the Partnership for a Healthier America, HWCF members removed 6.4 trillion calories from the marketplace in five years. HWCF is now undertaking an initiative, called Commitment To Healthy Communities, which will catalog and assess community programs designed to prevent hunger and obesity that are funded by the food and beverage industry.  The foundation is a first-of-its–kind coalition that brings together more than 300 retailers, food and beverage manufacturers, restaurants, sporting goods and insurance companies, trade associations, nongovernmental organizations (NGOs), and professional sports organizations. HWCF promotes ways to help people achieve active healthy lifestyles and focuses its efforts on two critical areas—families and schools—through its Together Counts™ campaign. To date, HWCF has awarded more than 1.37 million dollars in grants and prizing to at risk schools and its free curricular resources have been used by over 27 million students across the country. \n\nAbout Discovery Education \nDiscovery Education is the global leader in standards-based digital content for K-12, transforming teaching and learning with award-winning digital textbooks, multimedia content, professional development, and the largest professional learning community of its kind. Serving 3 million educators and over 30 million students, Discovery Education's services are in half of U.S. classrooms, over 40 percent of all primary schools in the UK, and more than 50 countries. Discovery Education partners with districts, states and like-minded organizations to captivate students, empower teachers, and transform classrooms with customized solutions that increase academic achievement. Discovery Education is powered by Discovery Communications ( NASDAQ: DISCA , DISCB, DISCK), the number one nonfiction media company in the world. Explore the future of education at www.discoveryeducation.com . \n\nAbout Playworld ®  \nPlayworld believes The World Needs Play®. Play is vital to everyone's health and well-being. It's something you are never too young or too old to enjoy. We develop playground environments where creativity is king, belly laughs are welcome and children make the rules. Playworld's equipment and surfacing are designed to unleash the transformational power of play so bodies grow stronger, children play safely and imagination can take flight. For more than 40 years, Playworld has created innovative, inclusive and meaningful outdoor play experiences for all ages and abilities. Come play with us at www.PlayworldSystems.com . \n\nLogo - http://photos.prnewswire.com/prnh/20150909/265162LOGO  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/healthy-weight-commitment-foundation-and-discovery-education-empower-students-nationwide-to-fight-childhood-obesity-with-renowned-wellness-initiative-300140716.html \n\nSOURCE  Discovery Education", "source": "Town Hall"}