{"published": "2015-09-13T02:56:18Z", "media-type": "News", "title": "Tech scores 69 in win against UTEP", "id": "490a3f6d-f119-4566-bd51-d71ed4a25c9b", "content": "Texas Tech had the ball for 20 minutes less than the University of Texas at El Paso on Saturday afternoon, but outscored the Miners 69-20  for the Red Raiders’ second win of the season. \n  \nIn just his sixth overall collegiate start, sophomore quarterback Patrick Mahomes II completed 18 of 33 passes with four touchdowns through the air. He also continued to show off his ability to run the ball, racking up 23 more yards on the ground and two rushing touchdowns. \n \nOverall on offense, the Red Raiders played even better than they did in week one, scoring on all but three of their 14 drives, and having seven different players get in the end zone. \n \nAfter his contribution last week rushing and on special teams, senior wide receiver Jakeem Grant made his impact with his catches this week. \n \nGrant had 141 yards receiving in the game, including a 60-yarder less than two minutes into the game for Tech’s first touchdown. \n \nThe biggest change on offense from week one to week two was in the backfield. Senior running back DeAndre Washington returned to his form of last season, carrying the ball for 138 yards on 12 attempts. \n \nSophomore running back Justin Stockton added 37 yards rushing, and also had one touchdown catch in the game for 46 yards. \n \nDefensively, Tech once again gave up close to 200 yards rushing, but 91 of that came on one rush by UTEP running back Aaron Jones. \n \nJones did not stay in the whole game, however, suffering an injury to his left leg with less than a minute left in the first half. \n \nTech won the turnover battle again as well forcing and recovering two fumbles in the game. Both of those turnovers led to scores by the Red Raider offense. \n \nNext on the schedule for Tech coach Kliff Kingsbury’s team is Arkansas next Saturday. The Red Raiders will then return home to take on Texas Christian in the first game of Big 12 Conference play. \n \nCheck back with  The DT  tonight and Sunday for more news and analysis.", "source": "University Daily"}