{"published": "2015-09-25T06:31:12Z", "media-type": "Blog", "title": "Mercury Rev - The Light In You (2015) [mp3]", "id": "653b5df6-4237-4f74-a077-9148e87e3d61", "content": "Mercury Rev - The Light In You (2015) [mp3] \n \nArtist: Mercury Rev \nTitle Of Album: The Light In You \nYear Of Release: 2015 \nLabel: Bella Union \nGenre: Dreampop, Indie Rock \nQuality: 320 kbps \nTotal Time: 44:23 min \nTotal Size: 101 MB \n \n1. The Queen Of Swans \n2. Amelie \n3. You've Gone With So Little For So Long \n4. Central Park East \n5. Emotional Free Fall \n6. Coming Up For Air \n7. Autumn's In The Air \n8. Are You Ready? \n9. Sunflower \n10. Moth Light \n11. Rainy Day Record \n \nBella Union are excited to announce the long-awaited return of US alt-rock legends Mercury Rev with new album The Light In You. \n \nAs Mercury Rev began recording their eighth studio album in autumn 2013, when asked what people could expect, co-pilot Grasshopper responded, “Steel Resonator Mandolin. Timpani. Sleigh Bells. All sorts of electric guitars…..” He subsequently added, “It is the best stuff we have done in a long, long time. Gonna be big sounding!” \n \nTwo years on, The Light In You more than lives up to its billing. The record is filled with wondrous and voluminous kaleidoscopic detail, but also intimate moments of calm, and altogether stands up to the very best that this notable band of maverick explorers has ever created. Its ecstatic highs and shivery comedowns also reflect a particularly turbulent era in the lives of Grasshopper and fellow co-founder Jonathan Donahue, of calamities both personal and physical, but also rebirths and real births (Grasshopper became a father for the first time in 2014). There’s a reason for the seven-year gap since the band’s last album, Snowflake Midnight. \n \n“It was one of those otherworldly life sequences, when everything you think is solid turns molten,” explains Jonathan. “But also, when something is worth saying, it can take a long time to say it, rather than just blurt it out.” \n \n \n \n http://uploaded.net/file/pf41xyuu/Sfrd462302.rar \n http://faststore.org/gtmc0gs6tn0s/Sfrd462302.rar \n http://www.uploadable.ch/file/qeFkpB3ARp...462302.rar \n http://rockfile.eu/hey9zed7okf1.html", "source": "Imaginariums"}