{"published": "2015-09-30T18:13:21Z", "media-type": "News", "title": "Occidental Petroleum Given “Buy” Rating at Deutsche Bank (OXY)", "id": "b2887860-65f6-4e06-97d8-5854916c4cb8", "content": "Deutsche Bank reissued their buy rating on shares of Occidental Petroleum (NYSE:OXY) in a report issued on Tuesday morning, MarketBeat.com reports. Occidental Petroleum (NYSE:OXY) traded up 1.13% on Tuesday, hitting $65.20. 2,661,039 shares of the stock were exchanged. Occidental Petroleum has a 12 month low of $63.60 and a 12 month high of $93.55. The… \r \nDeutsche Bank reissued their buy rating on shares of Occidental Petroleum (NYSE:OXY) in a report issued on Tuesday morning, MarketBeat.com reports. \n\nOccidental Petroleum (NYSE:OXY) traded up 1.13% on Tuesday, hitting $65.20. 2,661,039 shares of the stock were exchanged. Occidental Petroleum has a 12 month low of $63.60 and a 12 month high of $93.55. The company has a 50-day moving average of $68.97 and a 200 day moving average of $74.02. The firm’s market cap is $49.81 billion. \n\nOccidental Petroleum (NYSE:OXY) last released its earnings results on Thursday, July 30th. The company reported $0.21 earnings per share for the quarter, hitting the consensus estimate of $0.21. The company had revenue of $3.60 billion for the quarter, compared to analysts’ expectations of $3.65 billion. The firm’s revenue for the quarter was down 32.4% on a year-over-year basis. During the same period in the prior year, the firm posted $1.82 EPS. Equities research analysts expect that Occidental Petroleum will post $0.39 earnings per share for the current fiscal year. \n\nThe business also recently disclosed a quarterly dividend, which will be paid on Thursday, October 15th. Shareholders of record on Thursday, September 10th will be issued a dividend of $0.75 per share. The ex-dividend date is Tuesday, September 8th. This represents a $3.00 dividend on an annualized basis and a yield of 4.65 \n\n%. \n\nOther analysts also recently issued reports about the stock. JPMorgan Chase & Co. decreased their target price on shares of Occidental Petroleum from $85.00 to $84.00 in a research note on Tuesday, July 7th. Howard Weil reduced their price objective on shares of Occidental Petroleum from $84.00 to $83.00 in a research report on Friday, August 14th. Jefferies Group reduced their target price on shares of Occidental Petroleum to $87.00 in a research report on Friday, September 11th. Bank of America reissued a buy rating and issued a $101.00 price objective on shares of Occidental Petroleum in a report on Sunday, July 12th. Finally, Citigroup Inc. reaffirmed a buy rating on shares of Occidental Petroleum in a research note on Monday, June 1st. Three equities research analysts have rated the stock with a sell rating, eight have assigned a hold rating, eleven have given a buy rating and one has given a strong buy rating to the company’s stock. Occidental Petroleum presently has an average rating of Hold and a consensus price target of $81.37. \n\nOccidental Petroleum C…", "source": "MyInforms"}