{"published": "2015-09-21T17:33:00Z", "media-type": "Blog", "title": "How to get Emma Roberts' Emmys hair", "id": "fa6aac19-5d25-4deb-ad0c-ac063e63d19f", "content": "Despite the high frizz potential that had many actresses slicking back their hair at the 67th Primetime Emmy Awards on Sunday, several were brave enough to wear their hair down, inspired by looks from Old Hollywood.\nThe traditional Veronica Lake deep side part and flowing finger waves looked pretty and, surprisingly, didn’t show the faintest sign of heat induced fly-aways.\nEmma Roberts, January Jones, Maisie Williams, Allison Janney, Natasha Lyonne and Elisabeth Moss (who worked the deep side part to show sparkling diamond earrings from Beladora estate jewelry) all had Old Hollywood hair, which felt right for the intermediate level of formality of the Emmys.\n“We did a modern take on an Old Hollywood sultry star,” says Nikki Lee of Nine Zero One salon, who created Roberts' look.\nFULL COVERAGE: Emmys 2015\nShe prepped the actress’ hair with Unite 7 Seconds Leave in Detangler and then sprayed Unite Boosta Spray at the root to mid-shaft for volume. See the most-read stories this hour Open link “I used a blow and set lotion for her ends, blowing her out with a 2-inch round brush, adding a nice bounce to her hair,” says Lee. “After I blew her out, I set her hair by spraying 7 Seconds Glossing Dry Thermal Shine to protect her hair from the heat of the 1 1/2-inch curling iron I used.”\nTrue to how it was actually done during the Old Hollywood era, Lee coiled 2-inch sections of the hair and pinned them with a duckbill clip to hold them in place. After 15 minutes, Lee took the hair down from the clips and brushed out the curls with a boar bristled brush, then sprayed a mist of hairspray over the head to lock in the look and keep down frizz. 67th Primetime Emmy Awards - Show Kevin Winter / Getty Images Actresses Jamie Lee Curtis, left, and Emma Roberts appear onstage during the 67th Primetime Emmy Awards. Actresses Jamie Lee Curtis, left, and Emma Roberts appear onstage during the 67th Primetime Emmy Awards. (Kevin Winter / Getty Images)\nMORE:\nBest and worst looks from the red carpet\nHow to get Taraji P. Henson's Emmys' smokey eye\nEmmy Awards: HBO, Jon Hamm and Viola Davis win big", "source": "All The Rage - Los Angeles Times"}