{"published": "2015-09-21T18:45:00Z", "media-type": "Blog", "title": "Verizon Still Scamming Customers: Tries To “Upsell” Me To 75Mbps, To Get Better Quality Netflix/iPhone Streaming", "id": "72399544-259f-4aee-9eaf-25f128d38704", "content": "Verizon Still Scamming Customers: Tries To “Upsell” Me To 75Mbps, To Get Better Quality Netflix/iPhone Streaming This afternoon I called FiOS tech support to ask them to stop sending me emails about the pope’s schedule of when he is on TV and what channel to watch. Verizon provides no unsubscribe link and offers customers no way to opt out, so you have to call them to make the emails stop. I was transferred from tech support to sales who said they would remove me, but also told me that I should consider upgrading my 50Mbps service to 75Mbps a month as I was told that Verizon considers me a “heavy user” of their services. When I asked the rep how Verizon defines a “heavy user”, I was told that in the last 30 days, I have had 8 unique devices connect to my Internet connection. The rep also told me that I average between 30Mbps and 130Mbps a month, which of course makes no sense. If the rep was talking throughput, I max out at 50Mbps, there is no way I could be at 130Mbps. And if she was talking total bits delivered, 130MB would be almost nothing. I asked her if she was talking speed or throughput, but she didn’t know. She told me that based on my usage, I would get better quality Netflix streaming if I went from my current 50Mbps a month plan, to 75Mbps a month and wanted me to upgrade due to “current special offers”. When I asked her to explain to me how I would get better quality, she said if the Netflix movie were 75Mbps in size, it would download faster on a 75Mbps connection than my current 50Mbps connection. Of course we all know that Netflix doesn’t download anything, so her example is totally bogus. I explained this to the rep and pointed her to Netflix’s ISP Speed Index chart that shows for the month of August, Netflix streams delivered over Verizon averaged 3.64Mbps. So even if I had 8 devices all streaming Netflix at once, I would be at 29.12Mbps, still well below my current 50Mbps that I pay for each month. I’ve streamed HBO from 10 devices in my home, all at the same time, without any problems on my 50Mbps a month plan. Of course, the rep didn’t know what the Netflix’s ISP Speed Index chart was and still kept saying the word “download” in reference to Netflix. Not to be deterred, the rep then asked me if I had the new iPhone 6 and told me I should upgrade to 75Mbps if I did, as she said the new iPhone has “faster technology” that would work better if I had 75bps. Of course, she could not explain to me what the faster technology actually was and just used high-level and generic terms that mean nothing. When I again asked her to explain to me the difference between speed and throughput, she didn’t have an answer. This is the same Verizon FiOS scam I wrote about in April of this year. Time after time, I keep getting this same pitch from Verizon, trying to get me to upgrade my service based on a flat-out lie of “better”, “faster”, or “smoother” Netflix streaming. And why don’t their reps know the difference between speed and throughput?! Speed is the rate at which packets get from one location to another. Throughput is the average rate of successful message delivery over a communication channel. Simply saying the rep did not know or was not educated enough is not an excuse! When reps don’t know the basics, they will make stuff up. They have a responsibility to be accurate and set proper expectations with consumers as well as received the right kind of training on the services they are selling. If you think Netflix is “downloading” movies you should NOT be selling Internet services. Last time I blogged about this, Verizon said it was an isolated incident. It’s not. It’s widespread and I’ve gotten the same pitch four times now, all from different people inside the FiOS department. If Verizon is going to continue to deny to the media that they are actively trying to upsell consumers based on a lie, then I am going to start recording my calls with Verizon reps and posting them here on my blog, for everyone to hear. That will make it much harder for Verizon to say it’s an isolated incident. I am putting Verizon on notice that from here on out, every call I have with anyone in the FiOS group will be recorded. If someone from the FTC is reading this, please contact me. Verizon needs to be forced to stop this practice as the definition of a scam is, “to swindle someone by means of a trick”. That’s definitely what Verizon is doing; trying to “trick” consumers and many who don’t know better and don’t understand the technology will fall for it, and pay for something they do not need.", "source": "Media-Saver"}