{"published": "2015-09-21T20:47:00Z", "media-type": "News", "title": "CCA Prices Offering of Senior Unsecured Notes", "id": "3ad605f6-25aa-42f6-9d6e-28226cf69ff5", "content": "NASHVILLE, TN -- (Marketwired) -- 09/21/15 -- Corrections Corporation of America ( NYSE: CXW ) (\"CCA\") announced today the pricing of its offering of $250,000,000 aggregate principal amount of senior unsecured notes due 2022 (the \"Notes\"). The Notes will have a yield to maturity of 5.00%. The sale of the Notes, which is subject to customary closing conditions, is expected to be completed on September 25, 2015. CCA intends to use substantially all of the net proceeds from the offering to repay a portion of the borrowings outstanding under its revolving credit facility and pay related fees, costs and expenses and to the extent not used for the foregoing purposes, for other general corporate purposes and working capital, which may include investments. \n  \nWells Fargo Securities, BofA Merrill Lynch, J.P. Morgan, SunTrust Robinson Humphrey, PNC Capital Markets LLC and U.S. Bancorp Investments, Inc. are acting as joint book running managers for the offering.  FTN Financial Securities Corp, Macquarie Capital, RBS Securities Inc., Regions Securities LLC and Canaccord Genuity Inc. are acting as co-managers for the offering. \n   \nThe Notes are being offered pursuant to CCA's existing shelf registration statement, which became automatically effective upon filing with the Securities and Exchange Commission. A preliminary prospectus supplement describing the terms of the offering has been filed with the Securities and Exchange Commission and is available at www.sec.gov . The offering may be made only by means of a prospectus supplement and the accompanying prospectus. Copies of the preliminary prospectus supplement and accompanying prospectus, and when available, the final prospectus supplement and accompanying prospectus, relating to this offering may be obtained from Wells Fargo Securities, LLC at wfscustomerservice@wellsfargo.com or (800) 645-3751. \n\nThis news release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of the Notes in any jurisdiction in which such offer, solicitation or sale would be unlawful. \n\nThis press release includes forward-looking statements regarding CCA's intention to issue the Notes and its intended use of the net proceeds. These forward-looking statements may be affected by risks and uncertainties in CCA's business and market conditions. This information is qualified in its entirety by cautionary statements and risk factor disclosure contained in CCA's Securities and Exchange Commission filings, including CCA's reports on Form 10-K and Form 10-Q filed with the Commission, as well as the risks identified in the preliminary prospectus supplement and the accompanying prospectus relating to the offering. CCA wishes to caution readers that certain important factors may have affected and could in the future affect CCA's actual results and could cause CCA's actual results for subsequent periods to differ materially from those expressed in any forward-looking statement made by or on behalf of CCA, including the risks that the offering of the Notes cannot be successfully completed. CCA undertakes no obligation to update forward-looking statements to reflect events or circumstances after the date hereof. \n\nAbout CCA \n\nCCA, a publicly traded real estate investment trust (REIT), is the nation's largest owner of partnership correction and detention facilities and one of the largest prison operators in the United States. Following the completion of our previously announced development projects, we will own or control 55 correctional, detention and community re-entry facilities, with a design capacity of approximately 72,000 beds, and manage 11 additional facilities owned by our government partners with a total design capacity of approximately 14,000 beds, in 19 states and the District of Columbia. CCA specializes in owning, operating and managing prisons and other correctional facilities and providing residential, community re-entry and prisoner transportation services for governmental agencies. In addition to providing fundamental residential services, our facilities offer a variety of rehabilitation and educational programs, including basic education, faith-based services, life skills and employment training and substance abuse treatment. These services are intended to reduce recidivism and to prepare offenders for their successful re-entry into society upon their release.", "source": "Renewable Energy World"}