{"published": "2015-09-03T10:55:08Z", "media-type": "News", "title": "BayRing Communications, Oxford Networks Plot New England Merger", "id": "1906ebe1-8211-418f-83c7-c8c667595004", "content": "Firms staging mergers often do so in the light of significant benefit; the two firms can better work together to offer services to clients, or just reach an expanded marketplace with a better package. There's often a lot of value in mergers, though there are sometimes legal issues associated with this concept that need to be addressed. For BayRing Communications and Oxford Networks, meanwhile, a merger looked like a great idea, and has already received state and federal approval to go forth. \n\r \n\r\n\r\n\r\n\r \nThe combination makes plenty of sense at first blush, and deeper inspection proves to change little. BayRing is a New Hampshire firm specializing in telecom and data center operations, while Maine's Oxford Networks joins in on telecom services as well. The two companies will reportedly make the largest telecom firm with a New England headquarters once it's all said and done, offering around 2,000 route miles of high-capacity fiber optics and access to nearly 50,000 commercial buildings. That doesn't include four Service Organization Control data centers, as well as the direct access to several major hub data locations. Just to top it off, its service ranges from southern New Hampshire into metro Boston and beyond. \n\r\n\r \nResults are already quite telling; reports suggest that the new organization's revenue streams have doubled, and now, a large swath of New England has a major new figure in both voice over Internet protocol (VoIP) and hosted private branch exchange ( PBX ( News - Alert ) ) systems. Operations won't change much as a result, as for the time being, both will keep current names and remain in current locations. \n\r\n\r \nThis is a pretty big move; it's always noteworthy when two smaller companies get together to make a much larger firm. Economies of scale can improve, and the two companies can focus marketing efforts instead of having to compete. Plus, since there's some difference between the two companies' offerings already, it can offer up a wider range of services to both of its current customer bases. This makes each firm more valuable to its current customers as services it previously couldn't offer can now be had, potentially making for a one-stop-shopping experience for current users. After all, if someone's already writing two checks to two different companies, and one of these can suddenly offer the services offered by the other, why not make the switch and just write one check? That saves time and effort, and when time and effort are saved at a corporate level, saving money generally isn't far behind. That increased fiber concept isn't unwelcome, either, as the rapidly-increasing demand for bandwidth on nearly every front will require fiber access to keep up with it. \n\r\n\r \nThere's a lot to like in the merger between BayRing Communications and Oxford Networks, and there will likely be plenty of customers that are equally happy about the whole thing. Competitors in the region, though, may have to step up current operations in order to match the proposition this newly-merged entity will be able to offer. \n\r \n\nEdited by Rory J. Thompson", "source": "TMC Net"}