{"published": "2015-09-03T15:18:00Z", "media-type": "Blog", "title": "Driven Alfa Romeo Giulietta Business Edition", "id": "8284ef48-4f6c-47de-8867-73ca733b88d9", "content": "Traditionally a heart-over-head choice of manufacturer, Alfa Romeo is trying to up its fleet sales with the introduction of a Giulietta that will appeal to your wallet (and your fleet manager) as much as it appeals to your inner petrol-head. Cue the arrival of the Giulietta Business Edition.\nThe concept is simple: take the Italian manufacturer’s most fleet-orientated car, fit the new, more powerful, more economical 1.6-litre Euro 6 diesel engine and give it a host of technology designed to make the company car driver’s life a little easier\nAlfa Romeo Giulietta\r1.6 JTDM-2 120 Business 5dr\rProfile:\r9+35\rMileage:\r8k Miles p/a\r£151.28\rPer Month, EXC VAT\rBusiness Users Only\rView Details\rBusiness Leasing Deal by: V4B Ltd\rSee our Alfa Romeo Giulietta leasing deals here: Business / PersonalBelies the kit list\nAn asking price of just over £19,000 makes the Business Edition about £600 more expensive than the entry-level car, but the price tag belies the kit list.\nSatellite navigation, 17in alloy wheels, front and rear parking sensors, automatic lights and wipers, voice control and metallic paint all feature as standard.\nYou also get the 1.6-litre MultiJet diesel engine - a powerplant you're normally charged more than £1,000 for.\nRecently upgraded to meet the Euro 6 emissions regulations, the four-cylinder unit has had its power output increased from 103bhp to 118bhp, while carbon dioxide emissions have dropped from 104g/km to a road tax-avoiding 99g/km.\nAs a result, the Business Edition drops a company car tax bracket to 17% and now returns 74.3mpg – up more than 5% on the 70.6mpg afforded by the old engine.\nThe power hike has made sure that the new engine is faster though, with the 0-62mph sprint now dealt with in ten seconds flat (down from the old car’s 11.3 seconds) and the top speed increased by 6mph to 121mph.\nIt doesn’t sound rapid, but a bucketful of torque ensures it feels faster than the figures suggest. There's a slight flat spot low down, but as the revs build the Giulietta surges ahead with urgency and though you'll have to work the six-speed manual transmission, making swift progress is perfectly feasible.Good cruiser\nConsidering this is an Alfa Romeo, however, it isn't especially sporty. Yes, selecting Dynamic on the DNA drive mode selector will sharpen the throttle response and add weight to the steering, but a Ford Focus will provide more smiles per mile.\nThe pedals are all wrong, with poor positioning and a very spongy middle pedal controlling grabby brakes, while the car also suffers from the classic Italian short leg/long arm driving position and totally numb steering. The gearbox isn't perfect either, but it's still one of the car's better features.\nReading all that might make you think the Giulietta is totally devoid of redeeming features and unworthy of any further consideration, but don't be quite so hasty.\nAlthough the Giulietta is no hot hatch, it is quite a good motorway cruiser and, let's face it, company cars tend to spend more time cruising up and down the M1 than setting lap records at Mallory Park.\nThere's an awful lot of sound proofing under the bonnet and elsewhere in a (successful) bid to keep engine noise out of the cabin, while road and wind noise have been kept to a minimum too.\nIt's also comfortable, with supportive seats and just about enough space both in the boot and in the back to make it practical.Drop-dead gorgeous\nThe customary Alfa idiosyncrasies remain, however, with a seat adjustment that's almost totally inaccessible when the seat belt is fastened, there's absolutely nowhere to put your left foot and some of the plastics feel like they were made from recycled hard hats.\nIt may not drive like an Alfasud, but there's plenty there to remind you that it's from the same stable.\nAnd you can forgive all the problems when you park up at the end of your journey, clamber out, lock the doors (cue irritating beeps) and have a look at what brought you all that way.\nVery little in this class is even vaguely pretty, let alone this pretty. The Focus has something about it, but it's hardly drop-dead gorgeous, the Mazda3 is handsome in a slightly weird, angular kind of way and the VW Golf? Well that's quite classy but it just looks dull when parked alongside the curvy Giulietta.\nFrom every angle it's stunning, with perfect proportions, doe eyes lined by striking LED daytime running lights and the Alfa grille cleaving its way down the front to provide a fitting centrepiece. Then, when you look at it from the rear, there are the exquisite tail lights and the squat stance. Even the key fob is a thing of beauty.The verdict\nWe'd never recommend that you make the Giulietta Business Edition your next company car - it has too many quirks and too many excellent rivals for that - but if you've had your heart set on an Alfa since you were old enough to know what an Alfa was, here's one you might actually be able to justify. Sort of.Vital stats\nLength: 4,351mm\nWidth: 1,798mm\nHeight: 1,465mm\nWheelbase: 2,634mm\nBoot space: 350 litres\nEngine: 1.6 MultiJet II 120 diesel (118bhp) Transmission: 6-spd manual\nFuel economy: 74.3mpg\nCO2 emissions: 99g/km  0-62mph: 10s\nTop speed: 121mph\nPrice: £19,080", "source": "ContractHireAndLeasing.com"}