{"published": "2015-09-20T01:02:07Z", "media-type": "News", "title": "Jeb Bush goes tailgating: Selfies, Trump, selfies, economy, selfies", "id": "d6880afb-7fcb-4576-9d17-cedd343677f9", "content": "ATHENS, Georgia (CNN) – Jeb Bush was scheduled to walk right up to a small stage and give brief remarks at a tailgate on Saturday, followed by photos with students before going to the Georgia vs. South Carolina game in Athens. \n\nBut when the Republican presidential candidate ventured into the tailgate space here on campus, it took him 24 minutes to inch through a thick swarm of students and fans to get to the stage. \n\nThe enthusiastic sea of mostly UGA supporters — armed in red Bulldogs swag and smart phones — crowded around Bush to get a look at the former Florida governor, but most importantly, to get a selfie. \n\nHis staffers gently tried to usher him through the crowd, but his campaign was more than happy to let the candidate take as many photos as requested, knowing most of the pictures would end up on social media — thus, free advertising. \n\n“Just get ’em all on Facebook,” Bush said jokingly at one point. “Tweet ’em!” \n\nIt’s common for Bush to talk and take photos with audience members at his events. And while he spent more than four hours at the Iowa State Fair last month, he had yet to experience a continuous stream of fanfare like he saw on Saturday, where he was given rock star treatment from the crushing mob of people for more than 70 minutes. \n\nHis visit to Athens marked the first of three SEC football games that Bush will attend this fall, all part of an effort to court voters in the March 1 primary that will involve eight Southern states and deliver the nominating season’s first huge haul of delegates in one day. \n\nAfter he worked his way to the stage, he was met by Georgia Lt. Gov. Casey Cagle, who endorsed Bush last month and introduced the candidate as someone who “stands for everything that the party needs to be espousing.” \n\nBush, with signs behind him that tweaked his “Jeb!” campaign logo to look like the SEC logo, spoke for only three minutes. “I’m going to be very brief because I really like taking selfies,” he said to big cheers from the crowd. \n\nThe candidate performed a condensed version of his stump speech, promising to grow the economy by 4.4% so that students can get jobs when they graduate and buy homes. “A conservative can win the presidency and then fix these things so that you all will have a chance to live a great life,” he said. \n\nThen it was back to selfies for another 50 minutes. \n\nFollowing his widely praised performance at the CNN debate on Wednesday, Bush hasn’t been as eager to bring up contrasts with his rival, Donald Trump, by name in his speeches as he has been in recent weeks. \n\nStill, Bush jumped at the chance to mock Trump at one point Saturday when a voter near him commented on Bush being “high energy.” The former governor whipped around to follow up: “Very high energy!” \n\nFriday night at an event in Michigan, Bush pounced on the latest controversy involving Trump and a supporter who argued at a rally this week that the president was a Muslim and questioned his status as an American. Bush defended Obama on Friday night, asserting that he was an American and a Christian. \n\nThe initial incident, which Trump didn’t try to correct or denounce, renewed dialogue about tension in the United States between Muslims and non-Muslims. \n\n“I don’t think that there’s a problem with Muslims in America,” Bush told reporters Saturday. “I think there’s a problem with Islamic terrorism in the rest of the world and we need to confront that.” \n\nBush added that “of course” Obama was born in the United States. Pressed on whether Trump should apologize for not calling out the questioner at his rally, Bush declined to weigh in further. \n\n“I’m not really, I’m here watching the football game. Donald Trump’s not really on my mind anymore,” he said. \n\nThough the two quarreled Wednesday night in the debate, they also high-fived each other toward the end. Bush said Saturday that he doesn’t hold any “personal animus” against Trump, but when asked whether Trump should still apologize to his wife for invoking her in the debate about immigration, Bush said: “Yeah. Yeah. Absolutely.” \n\nThis week, Bush also got some attention from younger voters after he admitted on the debate stage that he smoked marijuana four decades ago. “I’m sure that other people might have done it and may not want to say it in front of 25 million people,” he said, looking around at his rivals on stage. “My mom’s not happy that I just did.” \n\nAsked Saturday whether he had heard from his mother yet, Bush said he tried calling the former first lady this week but she wasn’t available. “Thankfully, she wasn’t there,” he said. “I think she’ll forgive me after 42 years, you think?” \n\nWith a few crushed beer cans on the grass around him and the smell of alcohol in the air, it was clear that at least some of the enthusiasm at the boisterous tailgate was owed to normal game day libations. Only water was served at the event, but anyone was free to wander over and several came with drinks in tow. \n\nBush politely advised a couple of young people to pace themselves.”Slow down there,” he said to one young woman who was keenly fascinated with a sticker on his shirt. “We haven’t even gotten to kickoff yet.” \n\nAs for who the candidate was rooting for at the game, Bush said he was neutral, though he predicted Georgia would beat the Gamecocks. \n\n“I think Georgia’s going to win the SEC East,” he added, as he was taking photos with a few South Carolina fans. \n\nThe Georgia fans quickly broke out into loud cheers: “Jeb for 2", "source": "WXOK-AM"}