{"published": "2015-09-20T04:14:56Z", "media-type": "Blog", "title": "HEWBA: Boston College picked by media to win Hockey East; Merrimack Picked 10th", "id": "ad055618-aac8-4891-ba12-bdd605356e48", "content": "Boston College was selected by the Hockey East media to win the league’s regular season title for 2015-16 in the sixth annual poll of the Hockey East Writers & Broadcasters Association. The Eagles, who tied for second last season, received 20 of a possible 35 first-place votes, as five teams in all were named on ballots for first place. Last year’s regular season and tournament champion, Boston University, finished second in the balloting and was chosen for first on seven of 35 ballots. Massachusetts-Lowell ranked third and received five votes for first, while fourth was defending NCAA champion Providence with two first-place votes. Notre Dame finished fifth and was the recipient of the other first-place vote. Vermont was sixth, while Northeastern ranked seventh and New Hampshire came in eighth. Second-year league member Connecticut was tabbed for ninth, with Merrimack, Maine and Massachusetts rounding out the poll. Teams received 12 points for a first-place vote, 11 for second, 10 for third, and so on down to one point for a 12th place vote. The media also selected a preseason All-Hockey East Team, led by three seniors, forwards Danny O’Regan (Sr., Boston University) and Kevin Roy (Sr., Northeastern), and defenseman Matt Grzelcyk (Sr., Boston University). A trio of juniors joined them, as forward Tyler Kelleher (Jr., New Hampshire), defenseman Ian McCoshen (Jr., Boston College) and goaltender Thatcher Demko (Jr., Boston College) were all chosen. Alex Tuch (So., Boston College) was the other forward selected, also the only underclassman. A tie at forward resulted in four players being named at that position, along with two defensemen and one goaltender. Boston College led the media’s preseason team with three players selected, while Boston University had two and New Hampshire and Northeastern had one each. Ballots were received from print and broadcast media covering the 12 league schools as well as regional and national media. The official Hockey East preseason coaches’ poll will be released on Monday, September 21, 2015 at the league’s annual preseason luncheon in Boston. Complete poll results follow. 1. Boston College (20) 397\r2. Boston University (7) 374\r3. Massachusetts-Lowell (5) 344\r4. Providence (2) 328\r5. Notre Dame (1) 250\r6. Vermont 237\r7. Northeastern 217\r8. New Hampshire 187\r9. Connecticut 142\r10. Merrimack 119\r11. Maine 87\r12. Massachusetts 48\rF Tyler Kelleher (Jr., New Hampshire)\rF Danny O'Regan (Sr., Boston University)\rF Kevin Roy (Sr., Northeastern)\rF Alex Tuch (So., Boston College)\rD Matt Grzelcyk (Sr., Boston University)\rD Ian McCoshen (Jr., Boston College)\rG Thatcher Demko (Jr., Boston College) Related ItemsFeatured", "source": "CollegeHockeyBlogs.com all feed"}