{"published": "2015-09-09T17:28:11Z", "media-type": "News", "title": "Where NFL scandals stand with 2015 season on tap", "id": "5713c5b8-cacc-4ab5-b7e4-8bf87f81036c", "content": "Without the games to distract from the issues, fans had more time to ponder the NFL's discipline policies, its commissioner and its overall credibility during an uncomfortable offseason. \n \nYes, the draft, the scouting combine and training camp were all designed to keep the league in the headlines long after the footballs stopped flying last February. But since the Patriots beat the Seahawks in the Super Bowl, those headlines have also been filled with news about scandals ranging from trivial (\"Deflategate\") to life-or-death (concussions and domestic abuse). \n \nFor those who only checked back in when their fantasy draft took place last week, here's a quick rundown of where things stand with kickoff now less than 48 hours away. (Not in order of importance): \n \nDEFLATEGATE: Last week, Tom Brady and the Patriots got a favorable ruling from a New York judge, meaning the quarterback will be available when New England hosts Pittsburgh in the league's opener Thursday night. The NFL has appealed the ruling — hoping another court will uphold Commissioner Roger Goodell's four-game suspension of the quarterback for a plot to deflate footballs before last season's AFC title game. The league claims it is appealing \"to uphold the collectively bargained responsibility to protect the integrity of the game.\" Something to watch: What will the NFL do if an appeals court reinstates the suspension in, say, November, when the playoff chase is in full force? \n \nRAY RICE: As has been the case since last November, the running back is eligible to play and available, after a judge overturned his season-long suspension following his arrest for punching his fiancée on an Atlantic City casino elevator. There are a few teams in need of a veteran runner: Cleveland and Dallas come to mind. The NFL has always been a place of second chances, but not so much for a 28-year-old running back who was thought to be on the downside of his career before his suspension. \n \nADRIAN PETERSON: He is back with the Vikings after an offseason in which he wasn't initially eager to return, saying he felt a lack of support from the team and the state. The 30-year-old running back missed all but one game last year because of a child-abuse case and has been assured he'll make the $13 million he's owed this season even if he gets hurt. Peterson pleaded no contest last year to a misdemeanor charge of reckless assault for using a wooden switch to discipline his 4-year-old son. Earlier this summer, a Texas judge reduced his probation from two years to nine months already served. \n \nGREG HARDY: The linebacker missed all but one game with the Panthers last season after being convicted of domestic violence. The conviction was thrown out on appeal when his accuser failed to show up to testify. The Cowboys signed Hardy in March. A month later, Goodell suspended him for 10 games, but that penalty was reduced to four games by an arbitrator. \n \nRAY McDONALD: Last week, the former 49ers defensive lineman was indicted on one count of raping an intoxicated person. He'll be arraigned Sept. 25 and faces up to eight years in prison. In March, the Chicago Bears signed McDonald to a one-year contract, but they released him two months later after his arrest in a separate case — for allegedly breaking down a bedroom door to get to his former fiancée and their infant. \n \nRICHIE INCOGNITO: The former Miami Dolphins guard sat out 15 months after being suspended as the primary offender in the bullying complaint made by Jonathan Martin. Incognito went unsigned last season, but is slated to start for the Buffalo Bills. Martin, 26, played for the 49ers last year, signed with the Panthers for this season, but then retied during training camp.  \n \nCONCUSSIONS: Not so much a scandal, as a widening crisis. Payouts on the potential $1 billion concussion settlement between the league and former players are being delayed while as many as a dozen appeals are being heard. Other lawsuits from several former Chiefs and St. Louis Rams, including Neil Smith and Roy Green, are pending in Missouri, where it's possible team officials could have to testify about whether they hid the risk of repeated head injuries. How game officials handle head-to-head contact and return-to-play issues for players who may have suffered concussions will stay under the microscope. And then, there is the movie \"Concussion,\" due out at Christmas.", "source": "Bluffton Today"}