{"published": "2015-09-04T18:37:00Z", "media-type": "Blog", "title": "Larry Lessig Has Way Too Much Faith in the Power of the Presidency", "id": "2a402e44-ca5c-4438-a9ce-ef37057bd241", "content": "After years of Washington gridlock, a new conventional wisdom has taken hold among issue activists across the political spectrum: Real change has to come outside the Beltway, and state and local organizing is the best place to start. It’s the model that paved the way for victories on gay marriage and minimum wage hikes on the left, and anti-union laws, tax cuts, and anti-immigration laws on the right. The overarching hope seems to be that more incremental change will help drive a broader popular consensus, more diverse coalitions of advocates, and political will for change on the national level, ultimately making Washington less broken and dysfunctional. \nLarry Lessig doesn’t buy it. The Harvard Law professor, author, and activist believes our democracy has more fundamental problems that need to be fixed from the top down, and that’s why he’s running for president in 2016. While his diagnosis is correct, his solution is unlikely to move us in the right direction.  \nLessig is exploring a bid for the 2016 Democratic nomination that’s premised on a single idea: He’ll be president until Congress passes a single bill, the Citizen Equality Act, to eliminate roadblocks to voting, outlaw gerrymandering, and create a new public campaign financing system to counter the influence of big money in politics. Then he’ll resign. \n“The view that we can just win this incrementally, over time, and eventually have enough votes in Congress to bring this about I just think is wrong,” Lessig told me. “We need the most powerful political force in our system to stand up to that resistance, and the way that American politics works, the president is the most powerful strategic political force.” \nLessig describes his candidacy as “a bet” that America will suddenly awaken to a fundamental, profound new realization about what went wrong with its democracy and want to fix it all in one go—a moment of Gestalt recognition. “It’s a test to see if you give this bigger idea, whether they rally to it,” he said. If he’s elected, then Congress will simply feel compelled to pass the Citizen Equality Act because of the extraordinary circumstances that led to the country’s first “referendum president.” If he raises $1 million by Labor Day, he’ll officially jump into the race; as of Friday morning, he’s already raised more than $840,000, putting him well on the way there. (Lessig's interviews this week with the New Republic and other media outlets are part of his attempt to get over the finish line.)\nLessig’s assumption is that our democracy is so fundamentally broken that it can only be fixed by radical means—what he describes as “an extraordinary mandate, a super mandate”—and that any conventional president will simply preserve the structural flaws of our democracy, no matter how radical his or her politics may be. That includes Bernie Sanders, who’s also stressed the importance of overhauling campaign finance reform and refused to have a super PAC. \n“If you imagine what a Bernie Sanders administration looks like, in context of a Republican House for sure and maybe a Republican Senate, it’s hard to imagine that advancing beyond the stalemated, polarized Washington we have now,” said Lessig, who kicked off his exploratory bid in early August. His presidential bid comes on the heels of Lessig’s MayDay PAC, which was largely a flop: The “superPAC to end all superPACs,” the group spent more than $10 million backing 2014 candidates who promised to limit big money in politics, but most of them lost. \nLessig’s candidacy is essentially an intellectual stunt meant to compel the public to rethink what needs to change and how that needs to happen, as well as pressure other candidates on electoral reform and campaign finance. That’s why he’s less concerned about how such a presidency would actually work in practice, though he has answers for some of those concerns as well. \nBut Lessig’s cure-all is flawed, even if you assume it’s just a provocation. Critics have piled on Lessig for having an overinflated view of the presidency, as the president cannot simply wave a wand to force Congress to pass legislation, and there's nothing about a presidential campaign that would change the deep polarization of the Congress. Lessig insists that the extraordinary circumstances of his election would make his mandate “hard to ignore,” adding that his campaign would try to elect “referendum representatives” to Congress who’d also resign after passing the Citizens Equality Act.\nThe campaign’s more fundamental problem is its assumption that Washington needs an extraordinary forcing mechanism because it simply lacks the will to act in a broad, uniform sense, when there’s a clear partisan divide on the very issues that Lessig wants to change. The current 2016 Democratic candidates generally agree with the reforms that Lessig wants to support, while Republicans have limited access to the ballot box and blocked campaign finance reform efforts in Congress. \nLessig, however, believes that Democratic control of Washington—which we had just six years ago—is an extraordinarily improbable outcome that shouldn’t be the basis of a political strategy, unlike his own extraordinarily improbable candidacy. “Republicans are here to stay, and...a Democratic supermajority in Congress is as likely as world peace,” he wrote. Voters are too resigned to believe that partisanship is the answer, he told me. To that end, he believes it would be counterproductive to attack Republicans and more effective to go after the root causes of political polarization on both sides.  \n“We have the chance to do is to elevate the debate above the standard partisan fight to imagine a campaign that could actually cut across partisan divisions,” he said. Lessig has even gone out of his way to praise Donald Trump for raising the issue of campaign finance by going after other candidates for being bought by lobbyists. “Our teacher in chief, Donald Trump, has done a pretty extraordinary job of spreading this message about part of this equality, in funding campaigns,” Lessig said. \nLessig views himself as an alternative “teacher-in-chief” who can spread this message even farther by hinging the entire presidency on it. But it’s not as if Democrats are leaving these issue by the wayside. Though she doesn’t go as far as Lessig might like, Hillary Clinton has proposed big electoral reforms to expand voting; campaign finance reform is a huge part of Bernie’s stump speech. But the problem isn’t a failure of our political leaders to get the message out there. It’s finding those who are willing to do the less glamorous work on the ground—coalition-building, organizing pressure campaigns, electing downballot legislators—that fuels legislative change that’s more than hypothetical. And imagining that a president could, and should, fix it all doesn't help that effort.  Suzy Khimm is a senior editor at The New Republic. For more stories, like the New Republic on Facebook:", "source": "The New Republic"}