{"published": "2015-09-16T12:14:13Z", "media-type": "News", "title": "InLocation Alliance Delivers Two Use Case White Papers for Retail/Marketing and Transportation", "id": "f3a6f513-678c-4fa0-91ff-2a8bab1a5a5e", "content": "-  While exhibiting at the ION GNSS+ 2015 Conference in Tampa, Florida, the InLocation Alliance (ILA) today announced the publications of two new white papers from the group's Use Case Working Group. These white papers provide insight to Retail Industry and Transportation Industry thought leaders of the opportunities afforded by indoor location based services and technical solutions being developed by the InLocation Alliance members. These technical solutions utilize the ILA developed technology-agnostic System Architecture which provides interoperability for ILA member developed use cases. \n \nAn earlier InLocation Alliance member survey indicated Retail and Marketing at the top of their efforts to reap benefits in the short/medium horizon. The results are confirmed by the wealth of announcements or products, trials, and deployment that are unceasingly being published. \n \nThe Indoor Location Based Services in Retail and Marketing White Paper illustrates the opportunities to retailers by describing some exemplary developments and deployments in retail and marketing while highlighting the importance of the ILA -- a catalyst for open innovation. \n \nThe Indoor Location Based Services in Transportation Hubs White Paper shows that the transportation sector is investing in and expecting significant innovation from indoor Location Based Services (LBS). Earlier this year, ILA recognized three leading innovations in LBS applications, two of which were related to the transportation sector. \n \n\"LBS capabilities in transportation hubs offer significant benefits to the operation of the facility, employees, vendors and passengers, creating a classic 'win-win' scenario for all the involved parties,\" said Jouni Kämäräinen, Chair of ILA. \"The transportation focused White Paper addresses the growing value of indoor LBS, several specific applications and their value proposition, and the role of the ILA in accelerating the adoption of these capabilities.\" \n \n\"Although many notable examples of deployments in the retail and the transportation industry are already available, with some being reported here, the ILA believes that the time has come for a more extensive activity that will allow a deeper integration of the indoor location technologies in the business processes of both the retail industry and the transportation industry, to the benefit of all involved stakeholders,\" said Fabio Malabocchia, Use Case Working Group Chair for ILA. \n \nIndustry organizations and alliances as well as innovative companies in the Retail industry and in the transportation industry are invited to contact the ILA and cooperate with the alliance to fulfill this intent. \n \nThe latest news and releases from the ILA can be found at http://www.inlocationalliance.com . \n \nAbout the InLocation Alliance - Formally established August 2012, the InLocation Alliance is an industry collaboration dedicated to promoting indoor positioning solutions that directly benefit the industry and users of indoor location services and solutions on mobile devices.", "source": "MarketWired"}