{"published": "2015-09-03T15:11:49Z", "media-type": "News", "title": "U.S. Air Force Selects Chromalloy For F108 Gas Turbine Engine Module Repairs", "id": "fb5d8446-a728-4684-8825-464a12b906f1", "content": "Sep 03, 2015 01:00 pm  \n Military & Defence   \n   \n \nContract Valued At Up To $74 Million Covers Low Pressure Modules in Engines Powering Tanker, Reconnaissance Aircraft \n\r \nChromalloy announced today that it has been selected by the U.S. Air Force to provide repairs on low pressure turbine modules for the F108 aircraft engine fleet, in a contract valued at up to $74 million. \n\r \nThe one-year agreement was contracted by the Tinker Air Force Base in Oklahoma and includes four one-year options for additional repairs. \n\r \n\"With this agreement Chromalloy is pleased to build on our longstanding relationship with the U.S. Air Force,\" said Carlo Luzzatto, President.  \"Through our expertise in repairing gas turbine engine modules and components, Chromalloy offers military fleets significant cost savings over buying new parts.  Our FAA-approved repairs have logged more than 1.2 million flight hours on this engine platform and are a proven source of reliability and durability.\"   \n\r \nThe contract covers overhaul of the low pressure turbine shaft assembly, Module 14, during scheduled maintenance events of the F108 engines.  \n\r \nWork will be performed at facilities within Chromalloy's service network. \n\r \nThe F108 powers the KC-135 tanker aircraft fleet and RC-135 reconnaissance aircraft.  The F108 CFM56-2B is the military variant of the CFM56-2 commercial propulsion system.  \n\r \nChromalloy is a leading supplier of technologically advanced repairs, coatings, investment castings, and services for turbine airfoils and other critical engine components.  The company provides turbine engine manufacturers and operators in commercial aerospace, defense and energy, with complete manufacturing support and material and supply chain management.  \n\r \nChromalloy facilities include operations, annexes and sales offices in 17 countries. More information is at www.chromalloy.com . \n\r \nChromalloy has expanded from a gas turbine parts repair business into an OEM supplier of production parts and advanced repairs and services for gas turbines used in aviation and land-based applications. Chromalloy serves the airline, military, marine and energy segments with a broad range of services at locations around the globe. Chromalloy is authorized by the FAA and EASA and many other NAAs, and is qualified under ISO and NADCAP. Chromalloy is a subsidiary of Sequa Corporation. \n\r \nSequa Corporation is a diversified industrial company with operations in the aerospace, energy and metal coatings industries. Sequa is a Carlyle Group company. For additional information, visit www.sequa.com . \n \n Previous article in category  Next article in category", "source": "Evaint.com"}