{"published": "2015-09-25T10:10:57Z", "media-type": "News", "title": "Fairview Real Estate Solutions Managing Director Thomas Deane to speak at Alston & Bird’s Servicing Symposium", "id": "5c5f0adb-531b-4a13-b834-fddf5b9e773b", "content": "PRWeb \n2015-09-25 \nDeane will serve on panel exploring Rising CRE Values and Loss Severity \n \nCHARLOTTE, NORTH CAROLINA (PRWEB) September 25, 2015 \n\nThomas Deane, Managing Director of Fairview Real Estate Solutions, will be a panelist at the 6th Annual Alston & Bird Servicing Symposium, Oct. 12 and 13 at the Charlotte Convention Center in Charlotte, North Carolina. \n \nDeane will join a panel of distinguished executives from the commercial real estate and financial services fields to discuss the outlook for commercial real estate asset prices and losses. The panel is titled, “Rising CRE Values and Loss Severity — How Is This Possible?” \n \nThe event will feature industry experts addressing current issues facing the servicing industry. Leaders will explore business challenges, discuss solutions and strategize to adapt servicing practices to changing industry standards, regulation and legislation. In 2014, the symposium attracted more than 400 attendees representing a broad spectrum of companies from the financial services industry. \n \n“This is an excellent topic sure to drive discussion about what’s next for commercial mortgages,” Deane says. “I’m honored and excited to share Fairview’s insights with the audience and hear from the broad scope of expertise on this panel.” \n \nThe Servicing Symposium is complimentary to clients and guests of the Alston & Bird law firm, however, space is limited. If you are interested in receiving an invitation, please contact servicing@alston.com. \n \n### \n \nAbout Fairview Real Estate Solutions \nFairview Real Estate Solutions, a QuietStream Financial portfolio company, is a market-leading provider of research and independent underwriting for the commercial mortgage-backed securities market. Fairview independently underwrites and actively monitors CMBS and commercial real estate loans in the U.S. It delivers its unmatched market knowledge to clients via Fairview’s Trader Tool, an easy-to-use online interface that grants immediate access to Fairview’s loan data. Fairview’s Trader Tool is backed by a team of 50 analysts and real estate experts, plus a network of brokers across the U.S. Fairview also publishes the weekly subscriber-only newsletter, Ahead of the Servicer, and is a frequent contributor to Bloomberg. Learn more about Fairview at http://www.fairviewres.com . \n \nAbout QuietStream Financial \nQuietStream Financial is an innovative portfolio of businesses serving commercial real estate owners, investors, borrowers and related professionals. Founded by CEO Robert J. Finlay, the company operates a portfolio of subsidiary businesses that provide a host of services, including investor management, fundraising, CMBS research and underwriting, defeasance, crowdfunding, marketing and other alternative asset management services. QuietStream Financial has more than $10 billion in assets under management and 100 employees. The firm is based in Charlotte, N.C. To learn more visit http://www.quietstreamfinancial.com . \n \nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb12979665.htm", "source": "BizWire Express"}