{"published": "2015-09-16T15:08:27Z", "media-type": "Blog", "title": "Because it's of NATIONAL SIGNIFICANCE,  follow the REDSHIRT RALly \"LIve\" via MI...", "id": "130fc0a2-f07d-4447-a4fa-b8010e10cd35", "content": "DEAR ER, please surf to themalaysianinsider.com because somehow I have NOT Been successful in copying the PICTURES, And in such events, A PICTURE SPEAKS A THOUSAND WORDS!  ___________________ LIVE: Thousands begin march to Padang Merbok as police keep close watch Published: 16 September 2015 11:26 AM | Updated: 16 September 2015 2:17 PM One of the groups of 'red shirt' rally participants making their way to Padang Merbok. – The Malaysian Insider pic by Kamal Ariffin, September 16, 2015.Tens of thousands of protesters started their march this afternoon as the \"red shirt\" rally moves towards Padang Merbok, even as a heavy police presence created an air of tension in Kuala Lumpur. (see map below for rally march route) Hundreds of police and Federal Reserve Unit (FRU) officers lined the streets of Petaling Street, Low Yat Plaza and Pudu Sentral, keeping a close watch on protesters dressed in red T-shirts and carrying banners and placards. Protesters began arriving at different locations in KL early this morning in scores of busses, some carrying banners reading \"Hidup Melayu\" (Long-live Malays) and \"Pertahan Kerajaan Pilihan Rakyat\" (Defending the government of the people's choice). They are heading to Padang Merbok where organisers are expected to address the crowd with speeches. The protest is in direct opposition to last month’s Bersih 4 rally, which today's rally organisers claimed had insulted the integrity of the dominant Malay race. Pekida president Jamaluddin Yusof earlier described the \"red shirt\" rally as a \"jihad\" and said 10,000 members from the Malay NGO will make their presence. \"Our members are not expecting any allowance for coming here today. We consider this a 'jihad' for the good of the country. We are carrying out our duty,\" Jamaluddin told reporters at Padang Merbok. Jamaluddin had diPekida president Jamaluddin Yusof says its members consider today's rally as a 'jihad'. – The Malaysian Insider pic, September 16, 2015.sregarded the red shirt dress code and instead wore a black vest with the word Pekida and his name emblazoned on the chest. He assured that the group was not interested in provoking any violence, despite the racial sentiments of the rally. \"Pekida does not like fights. We are thinking about what outsiders think of the country and Pekida. \"We do not want to be seen as gangsters. We will be polite and respectful.\" Police have declared that the rally is legal, but have said three areas – Bukit Bintang, Petaling Street and the area around Low Yat Plaza – are off-limits to the protesters. Prime Minister Datuk Seri Najib Razak had said he will not stop Umno members from participating in the rally, but stopped short of endorsing the gathering. The 1,000-strong crowd gathered at the Kompleks Kraftangan in Jalan Conlay, starting their march towards Padang Merbok, via Jalan Raja Chulan. – The Malaysian Insider pic by Muzliza Mustafa, September 16, 2015.The rally has come under fierce criticism from opposition parties, civil society groups, Umno Supreme Council members, Tan Sri Muhyiddin Yassin and Datuk Seri Shafie Apdal, as well as former prime minister Tun Dr Mahathir Mohamad and former international trade and industry minister Tan Sri Rafidah Aziz, both of whom were top Umno leaders until a decade ago.The homeless are among those seen wearing red shirts in this photo taken near Jalan Hang Lekiu, as the Himpunan Rakyat Bersatu participants hand out food packets and red shirts. – The Malaysian Insider pic by Muzliza Mustafa, September 16, 2015. Follow The Malaysian Insider for live updates: 1.55PM: Homeless people are given food packets and red shirts at Jalan Hang Lekiu. An Indian man was seen eating a packet of rice with chiken curry and vegetable, with a pair of red shirts with him. 1.40PM: A video journalist from Astro is ushered away by police after allegedly asking provocative questions to some of the participants at Jalan Raja Chulan. Watch video clip here. 1:08pm: A 5,000-strong crowd gathered outside the Kompleks Kraftangan on Jalan Conlay sing the national anthem \"Negaraku\" before beginning their march to Padang Merbok. They are being led by traffic police. 12.43pm: Police set up roadblocks at several locations in Kuala Lumpur city centre, including the entrance to Petaling Street, the roads surrounding Padang Merbok, Dataran Maybank and Jalan Tuanku Abdul Rahman. 12.29pm: Police have blocked entry into Petaling Street (pic, right). Police have declared the area, along with the Plaza Low Yat and Bukit Bintang areas, as off-limits to protesters. 12.14pm: Around 500 prostesters are marching from Jalan Putra towards Padang Merbok carrying banners, and crying out \"Hidup Melayu\". 12.01pm: Deputy Minister of International Trade and Industry Datuk Ahmad Maslan has arrived at the National Mosque, greeted by more than 1,000 rally-goers who are shouting \"Allahuakbar\" (God is Great) and \"Hidup Melayu\" (Long-live Malays). 11.46am: The mood at Padang Merbok is sombre and the entire field is empty, save for a policeman and his dog.  A large crowd of rally-goers appear bored and restless as they wait for the action to begin and for more to arrive.Deputy Minister of International Trade and Industry Datuk Ahmad Maslan with participants of the 'red shirt' rally at the Natonal Mosque. – The Malaysian Insider pic by Nazir Sufari, September 16, 2015. 11.30am: More than 10,000 people have gathered in PWTC and are moving in batches on foot towards Padang Merbok. 11.20am: A group of about 50 people dressed in red, riding motorcycles, have begun gathering in front of Petaling Street. Police had earlier said Petaling Street, along with Bukit Bintang and the area surrounding Low Yat Plaza, are off-limits to rally-goers. – September 16, 2015. - See more at: http://www.themalaysianinsider.com/malaysia/article/live-thousands-gather-in-kl-for-red-shirt-rally/malaysia/article/live-thousands-gather-in-kl-for-red-shirt-rally#sthash.YRExmA0b.dpuf\n**************************************\nUPDATED @@11.05PM:\nFRom MI:~~~~~\n2 arrested while 2 policemen were injured in rally, say cops BY MUZLIZA MUSTAFA Published: 16 September 2015 10:11 PM The Federal Reserve Unit guards the entrance to Petaling Street as 'red shirt' rally-goers try to break through the barricades. – The Malaysian Insider pic by Afif Abd Halim, September 16, 2015. The situation in the capital city of Kuala Lumpur was under control despite a 'minor' incident earlier today at Petaling Street when the 'red shirt' rally-goers attempted to breach the barricade, Kuala Lumpur police chief Datuk Tajuddin Md Isa said. He said two rally-goers were detained for abetting in an assault while two policemen were injured when the crowd attempted to break through the barricade. \"There was a commotion in the area but police managed to control the situation,\" Tajuddin said, adding that an estimated 35,000 people took part in the rally. \"As of 8pm, the situation in Kuala Lumpur remains under control and rally-goers are slowly dispersing from the scene. We will continue to monitor the situation in the city to ensure the safety and security of the general public.\" Earlier, the situation in Petaling Street, or Chinatown turned chaotic, when the rally-goers tried to break through the barricades. The Federal Reserve Unit (FRU) was forced to use the water cannon to control the situation. Police had earlier declared that Petaling Street was out of bounds to the rally-goers. Before the rally ended this evening about 5.30pm, Ketereh MP Tan Sri Annuar Musa had declared that it was a success, saying that there were at least 250,000 participants. – September 16, 2015 - See more at: http://www.themalaysianinsider.com/malaysia/article/2-arrested-while-2-policemen-were-injured-in-rally-say-cops#sthash.grp4lXug.dpuf LIVE: Thousands begin march to Padang Merbok as police keep close watch Published: 16 September 2015 11:26 AM | Updated: 16 September 2015 2:17 PM One of the groups of 'red shirt' rally participants making their way to Padang Merbok. – The Malaysian Insider pic by Kamal Ariffin, September 16, 2015.Tens of thousands of protesters started their march this afternoon as the \"red shirt\" rally moves towards Padang Merbok, even as a heavy police presence created an air of tension in Kuala Lumpur. (see map below for rally march route)\nHundreds of police and Federal Reserve Unit (FRU) officers lined the streets of Petaling Street, Low Yat Plaza and Pudu Sentral, keeping a close watch on protesters dressed in red T-shirts and carrying banners and placards.\nProtesters began arriving at different locations in KL early this morning in scores of busses, some carrying banners reading \"Hidup Melayu\" (Long-live Malays) and \"Pertahan Kerajaan Pilihan Rakyat\" (Defending the government of the people's choice).\nThey are heading to Padang Merbok where organisers are expected to address the crowd with speeches. The protest is in direct opposition to last month’s Bersih 4 rally, which today's rally organisers claimed had insulted the integrity of the dominant Malay race.\nPekida president Jamaluddin Yusof earlier described the \"red shirt\" rally as a \"jihad\" and said 10,000 members from the Malay NGO will make their presence.\n\"Our members are not expecting any allowance for coming here today. We consider this a 'jihad' for the good of the country. We are carrying out our duty,\" Jamaluddin told reporters at Padang Merbok.\nJamaluddin had diPekida president Jamaluddin Yusof says its members consider today's rally as a 'jihad'. – The Malaysian Insider pic, September 16, 2015.sregarded the red shirt dress code and instead wore a black vest with the word Pekida and his name emblazoned on the chest.\nHe assured that the group was not interested in provoking any violence, despite the racial sentiments of the rally.\n\"Pekida does not like fights. We are thinking about what outsiders think of the country and Pekida.\n\"We do not want to be seen as gangsters. We will be polite and respectful.\"\nPolice have declared that the rally is legal, but have said three areas – Bukit Bintang, Petaling Street and the area around Low Yat Plaza – are off-limits to the protesters.\nPrime Minister Datuk Seri Najib Razak had said he will not stop Umno members from participating in the rally, but stopped short of endorsing the gathering.\nThe 1,000-strong crowd gathered at the Kompleks Kraftangan in Jalan Conlay, starting their march towards Padang Merbok, via Jalan Raja Chulan. – The Malaysian Insider pic by Muzliza Mustafa, September 16, 2015.The rally has come under fierce criticism from opposition parties, civil society groups, Umno Supreme Council members, Tan Sri Muhyiddin Yassin and Datuk Seri Shafie Apdal, as well as former prime minister Tun Dr Mahathir Mohamad and former international trade and industry minister Tan Sri Rafidah Aziz, both of whom were top Umno leaders until a decade ago.The homeless are among those seen wearing red shirts in this photo taken near Jalan Hang Lekiu, as the Himpunan Rakyat Bersatu participants hand out food packets and red shirts. – The Malaysian Insider pic by Muzliza Mustafa, September 16, 2015.\nFollow The Malaysian Insider for live updates:\n1.55PM: Homeless people are given food packets and red shirts at Jalan Hang Lekiu. An Indian man was seen eating a packet of rice with chiken curry and vegetable, with a pair of red shirts with him.\n1.40PM: A video journalist from Astro is ushered away by police after allegedly asking provocative questions to some of the participants at Jalan Raja Chulan. Watch video clip here.\n1:08pm: A 5,000-strong crowd gathered outside the Kompleks Kraftangan on Jalan Conlay sing the national anthem \"Negaraku\" before beginning their march to Padang Merbok. They are being led by traffic police.\n12.43pm: Police set up roadblocks at several locations in Kuala Lumpur city centre, including the entrance to Petaling Street, the roads surrounding Padang Merbok, Dataran Maybank and Jalan Tuanku Abdul Rahman.\n12.29pm: Police have blocked entry into Petaling Street (pic, right). Police have declared the area, along with the Plaza Low Yat and Bukit Bintang areas, as off-limits to protesters.\n12.14pm: Around 500 prostesters are marching from Jalan Putra towards Padang Merbok carrying banners, and crying out \"Hidup Melayu\".\n12.01pm: Deputy Minister of International Trade and Industry Datuk Ahmad Maslan has arrived at the National Mosque, greeted by more than 1,000 rally-goers who are shouting \"Allahuakbar\" (God is Great) and \"Hidup Melayu\" (Long-live Malays).\n11.46am: The mood at Padang Merbok is sombre and the entire field is empty, save for a policeman and his dog.  A large crowd of rally-goers appear bored and restless as they wait for the action to begin and for more to arrive.Deputy Minister of International Trade and Industry Datuk Ahmad Maslan with participants of the 'red shirt' rally at the Natonal Mosque. – The Malaysian Insider pic by Nazir Sufari, September 16, 2015.\n11.30am: More than 10,000 people have gathered in PWTC and are moving in batches on foot towards Padang Merbok.\n11.20am: A group of about 50 people dressed in red, riding motorcycles, have begun gathering in front of Petaling Street. Police had earlier said Petaling Street, along with Bukit Bintang and the area surrounding Low Yat Plaza, are off-limits to rally-goers. – September 16, 2015. - See more at: http://www.themalaysianinsider.com/malaysia/article/live-thousands-gather-in-kl-for-red-shirt-rally/malaysia/article/live-thousands-gather-in-kl-for-red-shirt-rally#sthash.YRExmA0b.dpuf", "source": "desiderata-ylchong"}