{"published": "2015-09-16T19:05:15Z", "media-type": "News", "title": "Ottawa's response to Uber compared to cities across Canada", "id": "27969a9a-fbf1-495e-a015-b3602693e5f2", "content": "Ottawa Mayor Jim Watson said the city has sped up the taxi bylaw review and expects a full report to be available by the end of December.\n\nOutside consultant KPMG is expected to review fare structures, and could recommend ways to regulate, rather than ban, Uber, which currently disregards Ottawa's licensing and insurance regulations.\n\nThe Uber app allows passengers to book a ride, track it in real time on a GPS map and does away with the exchange of cash by requiring automatic credit card payment. \n\nThe City of Ottawa maintains that Uber is illegal, and continues to target drivers in time-consuming and resource-intensive undercover stings in order to charge them.\n\nSince Uber began operating in Ottawa in October 2014, 142 charges have been laid against 64 drivers. So far, 56 drivers have pleaded guilty to 112 charges, with fines totaling nearly $40,000, according to the City of Ottawa.\n\nUber has been banned or pushed out of some Canadian cities but continues to compete with traditional, regulated cabs in others.\n\nHere's a round up of the response to Uber across the country.\n\nKitchener-Waterloo became the first municipality in Ontario to propose regulating ride sharing services, like Uber. The new bylaw would require all Uber drivers to have a GPS and closed circuit television system, as well as commercial auto insurance policies for a minimum of $2 million to qualify for A City of Toronto staff report up for debate today calls for a new licensing category that would allow ride-hailing services, such as Uber to operate, but taxi industry leaders continue to argue that would mean the \"death of the industry.\"\n\nUnder the new licence, Uber drivers would have to buy a permit, carry insurance, undergo a background check and ensure their vehicle is safe. The report also recommends that base taxi fares be dropped by $1 to $3.25 to make traditional cabs more competitive. \n\nRead more about Uber in Toronto here.\n\nThe City of Edmonton has plans to legalize Uber with new regulations — but Uber drivers say the move would drive them out of business due to high costs. Uber drivers say the cost of criminal record checks, vehicle inspections, licence applications and commercial insurance would be about $6,800 a year.\n\nPublic hearings were scheduled at Edmonton City Hall today as Uber drivers planned to hold a rally outside.\n\nThe taxi industry in Vancouver successfully fought the relaunch of Uber last year. Uber was forced to stop operating after a brief time in Calgary in 2014. Calgary taxi companies joined other Canadian taxi companies in a campaign called Taxi Truths with the goal of detailing the differences between regulated and illegal cabs.", "source": "CBC"}