{"published": "2015-09-14T05:27:34Z", "media-type": "Blog", "title": "AFIF Entrepreneurship Award 2015 Officially Open To All African-Based Entrepreneurs", "id": "182a7cfc-b969-4b6b-aba9-ab959b3471a0", "content": "In order to encourage innovation and entrepreneurship in Africa, EMRC will present the \"AFIF Entrepreneurship Award 2015\", providing an African existing small-medium business with a financial contribution and exposure/visibility for the winning project. The award winner, an existing African small-medium business, will receive a US$5.000,00 cash prize, yearlong media promotion support in and out of Africa, free AFIF 2015 participation, including the Training Workshop, and travel expenses to the AFIF 2015 covered by EMRC. “This year we are boosting the Award, by offering the chance to all those remarkable entrepreneurs based in Africa to submit their business project. We are facilitating their presence which in turn will ensure that SMEs are strongly represented at the event,” Inês Bastos, EMRC Sr Project Manager, explains. AFIF 2015, entitled “Access to Finance & Entrepreneurship” is organized in collaboration with the European Investment Bank (EIB), DEG (German Development Finance Institution) and in partnership with Agri Academy, ECOWAS-TEN, Pfizer, Rabobank, BlueCloud, ICD (Islamic Corp. for the Development of the Private Sector), IFC (World Bank) amongst others. The forum will be held in Cape Town, South Africa, from the 24th to 26th November 2015. An unforgettable moment which receives considerable international press coverage, the Award has been won by a unique group of African entrepreneurs which include: Magloire N’Dakon (2014) awarded the prize for his innovative project, Extended Finance, in Ivory Coast; Marie-Claire Matamba (2013) head of Agrimat Gabon; Anastácio Roque representing CESACOPA (2012) from Angola, Suzanne Belemtougri (2011) head of Sophavet and hailing from Burkina Faso as well as Derek Kwesiga (2009) head of Derekorp from Uganda. Read More.. Email This BlogThis! Share to Twitter Share to Facebook", "source": "The Times of Africa"}