{"published": "2015-09-08T23:34:00Z", "media-type": "News", "title": "Flight Attendants Welcome New Leadership at United Airlines", "id": "7f32fc79-ec00-4fb1-916d-190f6c474a71", "content": "SOURCE Association of Flight Attendants-CWA (AFA)\n\nWASHINGTON \n\n\"Flight attendants are dedicated to the long-term success of United Airlines. We welcome new leadership and a new direction that recognizes the value of frontline workers and the full potential of our airline,\" said AFA International President Sara Nelson \n\nUnited Airlines, Continental Airlines and Continental Micronesia merged five years ago on paper, but the airline is still maintaining separate flight attendant operations and has yet to conclude a flight attendant merged agreement. AFA recently filed for federal mediation in order to bring the negotiations to a conclusion.\n\n\"We believe a fresh perspective will be healthy for United Airlines in all areas, especially where labor relations languished under previous leadership. New leadership has the potential to improve the flying experience for our passengers and insure Flight Attendants and other frontline workers are recognized, engaged and included in the success of our airline,\" said Nelson. \"We look forward to discussing a bright future with our new CEO.\"\n\nThe Association of Flight Attendants is the world's largest Flight Attendant union. Focused 100 percent on Flight Attendant issues, AFA has been the leader in advancing the Flight Attendant profession for 70 years. Serving as the voice for Flight Attendants in the workplace, in the aviation industry, in the media and on Capitol Hill, AFA has transformed the Flight Attendant profession by raising wages, benefits and working conditions. Nearly 50,000 Flight Attendants come together to form AFA, part of the 700,000-member strong Communications Workers of America (CWA), AFL-CIO. Visit us at www.afacwa.org. \n\nLogo - http://photos.prnewswire.com/prnh/20110302/DC58223LOGO\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/flight-attendants-welcome-new-leadership-at-united-airlines-300139486.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KTUL"}