{"published": "2015-09-05T20:00:00Z", "media-type": "News", "title": "State of the Nation | Sunday, September 6, 2015", "id": "9f7315d0-b182-4072-a31d-674f2e642648", "content": "Here's a morning news snapshot from around regional Australia and beyond. \n\nHappy Father's Day, dads of Australia.\n\nDads around the country will be waking to breakfast in bed and piles of socks, jocks, hankies and homemade cards as they are celebrated by their children young and not so young.\n\nTony Van Gelder felt like he was in a different world as he watched his son Levi take his first breath this week. \n\n\"You can't match that moment,\" the new father from Glebe recalled. \"Being there was so crazy.\"\n\nMr Van Gelder said there was never any doubt that he would witness the birth of his child at RPA Hospital. \n\n\"This is a once or twice in a lifetime experience for us. It's not something you want to miss.\" Continue reading\n\n► \n\n► WINGHAM: \n\n►ARMIDALE: Four intruders armed with firearms and a knife have stormed an Armidale home in an early-morning home invasion. Continue reading \n\n► TASMANIA: The Tasmanian state government is in negotiations with its federal counterparts to allow up to 500 European and Middle Eastern refugees to call Tasmania home. Read more\n\n► GRIFFITH: Riverina farms are finding themselves increasingly reliant on foreign labour to plug gaps during high workload periods. Continue reading\n\n► ILLAWARRA: \n\n► LAUNCESTON: The body discovered by kayakers in the river near Perth and believed by police to be missing man Ben Plowright will be examined by the state pathologist on Monday. Read more \n\n► UNSW staff are scrambling to contain an embarrassing outbreak of undergraduate humour, after the university's Facebook page was hacked on its annual open day. Continue reading\n\n► More than eight out of 10 fathers would like to spend time being the primary carer of their baby. Read more\n\n► Prime Minister Tony Abbott says cabinet will make its final decision on whether to extend Australian air strikes into Syria in the coming days after the Defence Minister publicly threw his support behind the plan. Continue more ► It was a tough week for retail giant Myer, which posted a disastrous full-year result. The repercussions for its marketing spend will be particularly hard-felt, and the word around town is that cuts are looming for Myer's sponsorship and ambassador programs. Read more\n\n1620: English emigrants on the pilgrim ship, the Mayflower, depart from Plymouth, England, on their way to the New World in America. \n\n1941: Nazi Germany dictates that all Jews over the age of 6 must wear the Star of David in public.\n\n1972: Nine Israeli athletes being held hostage are killed in a bungled rescue attempt during the Munich Olympic Games. \n\n► EUROPE: Everything you need to know about the European refugee crisis | The International Organisation for Migration estimates that more than 350,000 migrants were detected at the EU's borders between January and August this year. And there is potential for this number to keep climbing. \n\nViolence and civil war in Syria and Iraq have displaced millions. An estimated 1.7 million refugees are in Turkey, 1.2 million in Lebanon, more than 600,000 in Jordan, hundreds of thousands in Iraq and Egypt. Another 7 million are internally displaced inside Syria. Roughly half of the country's entire pre-war population are refugees, at home or abroad. \n\n► UNITED STATES: A New York City millionaire has bequeathed $100,000 to her pet cockatiels, with strict instructions they be fed popcorn and nuts. Read more \n\nStephanie Hill's struggle with Type 1 diabetes has landed her in Wollongong Hospital's children's ward \"countless times\", so she grabbed the chance to raise funds for its refurbishment.\n\nThe 11-year-old Albion Park Rail girl is the youth ambassador for the 2015 Run Wollongong event which will wind its way around the Wollongong waterfront on October 18.\n\nThe event has raised more than $250,000 since its inception in 2013, with the funds significantly contributing to the construction of the Illawarra Children's Assessment Unit in North Wollongong. Read more", "source": "Port Stephens Examiner"}