{"published": "2015-09-15T08:21:41Z", "media-type": "News", "title": "By Stuart Condie Liberals Economy: Industry bodies warm to Turnbull's ways", "id": "c98dae8b-4e66-40e8-b5d1-e6359fb394f2", "content": "A change in prime minister could boost the Australian economy, analysts say. Source: AAP \n\nAUSTRALIAN businesses are anticipating a shot in the arm from the change in prime minister before Malcolm Turnbull has even spelled out policy. \n\nINDUSTRY bodies welcomed the arrival of a PM with a track record in business and warmed to the idea that the former investment banker can succeed where Tony Abbott failed, using a more collegiate and co-operative style of government to push through economic reforms. \n\nAnalysts say he could lift consumer confidence through his popularity with voters and help business by articulating the need for reform. \n\nBusiness Council of Australia president Catherine Livingstone said companies would respond to leadership that \"explains our national challenges ... while respecting the intelligence of the community to embrace change for the better\". \n\n\"A stronger economy for all will require a 10-year plan including ambitious tax reform that supports growth and fairness, a new framework for a modern and competitive workplace relations system, and a pathway to a meaningful budget surplus.\" \n\nRead more \n\nThe need for tax reform was echoed by Australian Chamber of Commerce and Industry chief executive Kate Carnell and Financial Services Council chief Sally Loane. \n\nMr Turnbull's willingness to compromise with political opponents could help get those reforms through. \n\nMs Livingstone said Mr Turnbull needed to focus on building an innovative and future-skilled economy to help boost productivity so Australia maintains its high living standards and social safety net. \n\nThe tech-savvy Mr Turnbull, who made millions from internet startup OzEmail in the 1990s, has regularly spoken on the importance of innovation. \n\nAi Group chief executive Innes Willox called him \"a world-class advocate well able to restart our stalled national reform agenda\". \n\nBusiness confidence is fragile partly due to the instability of a fourth prime minister in 28 months. \n\nWhile some analysts believe Mr Turnbull's elevation to prime minister could help improve confidence, AMP chief economist Shane Oliver sounded a note of caution. \n\n\"The change does nothing to alter the underlying fundamental challenge facing Australia, which is the end of the resources boom and the resultant sluggish economic growth,\" Dr Oliver said. \n\n\"But it does have the potential to help.\" \n\nIG market analyst Angus Nicholson said sentiment may improve after data last week showed consumer and business confidence dipping again. \n\n\"Traditionally with conservative pro-finance, pro-business leaders, which I think Mr Turnbull is regarded among the investor community, you often see a boost in consumer and investor confidence,\" he said. \n\n\"If it does provide a boost to confidence, that can also boost the real economy.\" \n\nMr Turnbull's negotiations with the then Labor government to secure passage of an emissions trading scheme directly led to his toppling as opposition leader by Mr Abbott in 2009, but analysts have downplayed concerns over his stance on climate. \n\n\"The Abbott government position on climate change even in the business community has been somewhat unpopular,\" Mr Nicholson said. \n\n\"Big companies like Shell have clearly seen the need to divest into renewables and diversify and invest in clean coal, so I don't think change on climate policy would be a deal breaker with the business community. \n\n\"The key thing is there needs to be proper discussion and consideration. The worst thing they could do would be sudden change.\"", "source": "Geelong Advertiser"}