{"published": "2015-09-30T13:41:28Z", "media-type": "News", "title": "Critical Alerts For GoPro, AFLAC, Repros Therapeutics, INSYS Therapeutics and Theravance Released By InvestorsObserver", "id": "2b91bfcb-e25f-490f-b117-003c29126e79", "content": "InvestorsObserver issues critical PriceWatch Alerts for GPRO, AFL, RPRX, INSY and THRX. \n\nTo see what our analysts have discovered about a particular stock, read the InvestorsObserver's PriceWatch Alert by selecting the corresponding link. (Note: You may have to copy this link into your browser then press the [ENTER] key.) \n\nGPRO: http://www.investorsobserver.com/pr/92920150/GPRO AFL: http://www.investorsobserver.com/pr/92920150/AFL RPRX: http://www.investorsobserver.com/pr/92920150/RPRX INSY: http://www.investorsobserver.com/pr/92920150/INSY THRX: http://www.investorsobserver.com/pr/92920150/THRX \n\n(Note: You may have to copy this link into your browser then press the [ENTER] key.) \n\nToday's PriceWatch Alerts cover the following stocks: GoPro (NASDAQ: GPRO), AFLAC (NYSE: AFL), Repros Therapeutics (NASDAQ: RPRX), INSYS Therapeutics (NASDAQ: INSY), Theravance (NASDAQ: THRX). InvestorsObserver's PriceWatch Alerts contain concise, detailed strategies for each stock we cover, including position protection tactics designed to defend investors from potential market shifts. While many other market reports only provide stock news and opinion, we offer strategies that can bulwark investments against uncertainty and increase chances of making a profit, even if a stock goes down. \n\n\"We go above and beyond typical market coverage,\" said Bobby Raines, Analyst at InvestorsObserver. \"Trading experts and beginning investors alike can find value in our PriceWatch Alerts. We provide actionable strategies that protect investments with basic hedging tactics, along with a concise explanation of our techniques.\" \n\nInvestorsObserver.com is an online newsletter which focuses on the U.S. equities and options markets. Our analytical tools, screening techniques, rigorous research methods and committed staff provide solid information to help subscribers make the best possible investment decisions. For more information go to www.investorsobserver.com. \n\nAll stocks and options shown are examples only-- not recommendations to buy or sell. Our picks do not represent a positive or negative outlook on any security. Potential returns do not take into account your trade size, brokerage commissions or taxes--expenses that will affect actual investment returns. Stocks and options involve risk, thus they are not suitable for all investors. Prior to buying or selling options, a person should request a copy of Characteristics and Risks of Standardized Options available at http://www.cboe.com/Resources/Intro.aspx. Privacy policy available upon request. \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/critical-alerts-for-gopro-aflac-repros-therapeutics-insys-therapeutics-and-theravance-released-by-investorsobserver-300151464.html \n\nSOURCE InvestorsObserver \n\nhttp://rt.prnewswire.com/rt.gif?NewsItemId=CG15591&Transmission_Id=201509300931PR_NEWS_USPR_____CG15591&DateId=2015", "source": "Individual.com"}