{"published": "2015-09-29T13:59:03Z", "media-type": "News", "title": "Time to strike while PNE ace Joe is banned", "id": "b86fa7bb-895f-475e-bb76-e0612304d9eb", "content": "Four Preston North End strikers will be looking to press a claim for a regular start in the absence of the suspended Joe Garner over the coming weeks.\n\nGarner starts a three-game ban this weekend, the legacy of his red card in the 1-1 draw with Wolves last Saturday.\n\nThe top scorer for the last two seasons will not be available until the October 24 visit to Brighton.\n\nSo the baton has now been passed to Jordan Hugill, Will Keane, Stevie May and Eoin Doyle in terms of stepping in to lead the line.\n\nThe Lilywhites head into October without any of their front men having scored a goal in the Championship. \n\nOf their six league goals, Daniel Johnson has scored four, with Paul Gallagher and Neil Kilkenny on target.\n\nHugill (2) and Keane have found the net in the Capital One Cup but when it comes to the league, the strikers are on a barren run.\n\nNorth End will be without Garner for Saturday’s visit to Sheffield Wednesday, the home game with Cardiff on October 17 and the away clash with Charlton three days later.\n\nPNE boss Simon Grayson said: “It is disappointing that we are going to be without Joe for three games.\n\n“Him being suspended now gives someone else the opportunity to impression.\n\n“We have got good strength in depth when you consider Stevie May and Eoin Doyle didn’t even come on in the Wolves game.\n\n“Jordan Hugill has played well after coming on in the last couple of games.\n\n“I thought Will Keane was outstanding last week against Bournemouth and did well again on Saturday in difficult circumstances.”\n\nGrayson has tried various combinations of strikers in a bid to get them scoring. At Brentford, Garner, May and Doyle all started.\n\nIt was Keane and May in the Bournemouth tie, with Hugill joining the action as a sub and getting on the scoresheet.\n\nGarner and Keane started against Wolves, a pairing which was broken up within 20 minutes by Garner’s red card.\n\nKeane continued as a lone striker until the 65th minute when Hugill took that mantle.\n\nMay will obviously be keen to start on Saturday – it was the Owls who sold him to PNE after just one season at Hillsborough.\n\nYou cannot ignore Hugill’s claims either, as he has impacted well from the bench.\n\nThe clash with Wednesday will form part of a 6,602-mile road trip for North End in the Championship this season.\n\nResearch done by JustPark shows that if a Preston fan drove to every league game, they would spend £1,075 and be on the road for 112 hours.\n\nThe longest trip of the season comes next month with a first ever visit to league leaders Brighton’s Amex Stadium.\n\nThat is a 568-mile round-trip by car, taking around eight-and-a-half hours.\n\nIn total, Championship clubs and their supporters will travel a total of 155,000 miles this season.\n\nBrighton have the most travelling to do, with 8,758 miles on the clock by the end of the season.\n\nDerby will spend the least time on the road, covering 4,914 miles from their East Midlands starting-point.\n\nJustPark is a parking app which allows football fans to book cut-price parking spaces on local driveways when attending matches.", "source": "Lancashire Evening Post"}