{"published": "2015-09-30T13:30:00Z", "media-type": "News", "title": "MyECheck Signs TradeRocket to Electronic Check Services", "id": "0cc13a06-8880-408f-8a2a-7039d01be91e", "content": "FOLSOM, CA -- (Marketwired) -- 09/30/15 -- MyECheck, Inc. (OTC PINK: MYEC), the leader in electronic check solutions and mobile payments technology, announced today that it has entered into an agreement to provide electronic check and related services to TradeRocket, operator of the TradeRocket invoicing and payments platform www.traderocket.net . \n\nUnder the terms of the agreement, MyECheck will provide TradeRocket with electronic payment services to facilitate secure, low cost, high speed electronic payments for business customers using the TradeRocket platform. \n     \nTradeRocket helps companies replace their paper-based manual invoice process with an electronic and automatic invoice process, enabling them to do more with less. TradeRocket also enables a company's suppliers to get paid early without negatively impacting the company's cash flow. \n\nMyECheck provides fully electronic, real-time billing and payment solutions that enable higher speed, more secure and lower cost financial transactions for people and business. \n\nMyECheck recently launched eMobile Pay, a revolutionary new mobile commerce platform. eMobile allows businesses to send bills electronically and accept real-time guaranteed payments for only a low flat fee per transaction with no hardware or other costs. For more information visit www.e-mobile-pay.com . \n\nAbout TradeRocket : TradeRocket delivers a cloud-based, enterprise platform that reduces Buyers' invoice and payment processing costs, allows Suppliers to get paid early without negatively impacting the Buyer's cash flow and helps Funders deploy low risk capital. For more information visit www.traderocket.net . \n\nAbout MyECheck: Winner of the 2015 PYMNTS Award for Best Check Innovation, MyECheck Inc. is a leading electronic payment technology developer, licensor and payment services provider. MyECheck operates under license to US Patent 7,389,913, \"Method and Apparatus for Online Check Processing\" granted June 2008. This patented new payment method is the fastest, safest and lowest cost method of processing payments and moving money in the US. MyECheck provides comprehensive payment solutions for all payment applications including mobile payments and the industry's most advanced security and fraud control technologies. MyECheck customers include corporations, retailers, governments, payment processors and financial institutions. For more information, contact sales@myecheck.com \n\nForward-looking statements in this release are made pursuant to \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995. Investors are cautioned that such forward-looking statements involve risks and uncertainties, including, without limitation, continued acceptance of mentioned products, increased levels of competition, new products and technological changes, dependence upon third-party suppliers, intellectual property rights, and other risks detailed from time to time in reports filed with the SEC. \n\nMyECheck, Inc. \nsales@myecheck.com \nir@myecheck.com", "source": "SearchBug"}