{"published": "2015-09-16T17:41:48Z", "media-type": "Blog", "title": "Japan Itinerary: The *Four* Castles", "id": "79d77589-da28-4797-8aa0-e29f7c1bba7f", "content": "The castle is one of Japan's most iconic symbols, and one of the most enduring... or, to a certain degree, the least enduring. Built as fortresses to guard important sites while taking the landscape into consideration, many of Japan's castles fell victim to feuds and wars, whether it be from the time of shogun and samurai, or World War II. While there were as many as 5,000 castles in Japan at one point by some estimates, there are now just over 100 in complete or partial form.\n\nAs Japan has lists of three most famous views, gardens, and other locations, there seem to be several different lists out there that rank Japan's top three castles.\n\nAccordingly, I've put together itineraries that take travelers to the four castles in Japan that were ranked at the top of TripAdvisor Japan's annual survey of castles, based on the reviews given on that site. Those castles are, in ranked order:\n\n[caption id=\"attachment_651\" align=\"alignright\" width=\"300\"] Kumamoto Castle. Photo by 663highland (CC BY 2.5)[/caption]\n\n1) Kumamoto Castle\nDespite it being a reconstruction, this is one of the most beloved castle sites in all of Japan, and in the last few years has been consistently ranked as the best among Travelocity reviewers. The original fortifications were laid down almost 450 years ago, but the castle was burned down during the Satsuma Rebellion of 1877. A few of the other buildings that are part of the castle keep are original, and the area has been designated as an important cultural property.\nAdmission to the castle costs 500 yen and it's open daily from 8:30 AM to 6 PM (until 5 PM during the winter months). Kumamoto Tram's A Line stops right in front of it – it's a 15 minute trip from JR Kumamoto Station. The flat fare for the tram is 150 yen, payable when you exit. A one day tram pass is 500 yen, and a two day pass is 800 yen.\n\n[caption id=\"attachment_652\" align=\"alignright\" width=\"300\"] Matsumoto Castle. Photo by MOILIP (CC BY-SA 3.0)[/caption]\n\n2) Matsumoto Castle\nThis castle is one of Japan's originals, dating back to 1504. The keep's exterior is all black, giving the castle the nickname “karasujo” or crow castle. It has survived since then, being saved from demolition during the start of the Meiji period, and has undergone several restorations, most recently in the 1950's. At one point, the castle resembled the leaning tower of Pisa when part of the keep slouched to one side. Matsumoto Castle is in Nagano prefecture, with the Japanese Alps as the backdrop, and is an easy train or bus trip from Tokyo or Nagano.\nAdmission to the castle is 610 yen and it's open daily except during the new year's holiday from 8:30 AM to 5 PM. During the Golden Week and Obon holidays, it's open longer. City buses run from Matsumoto's train station to the castle, including the tourist bus known as the “flying sneaker” (200 yen per trip or 500 yen for a day pass). The North bus will take you to the castle, and note that the day pass includes discounted admission to the castle. One other option is Matsumoto City's free bicycle rentals, available at various spots around town including the train station and castle.\n\n[caption id=\"attachment_653\" align=\"alignright\" width=\"300\"] Himeji Castle after restoration. Photo by Niko Kitsakis (CC BY-SA 4.0)[/caption]\n\n3) Himeji Castle\nInstantly recognizable as the most visited castle complex in Japan, Himeji has fallen in the Travelocity rankings over the last several years as the complex underwent a multi-year restoration project. Just recently completed, Himeji looks as beautiful as it did when it was first built, and is seeking to claw its way up to the top of the rankings. With origins dating back to the 1300's, Himeji's main castles were built in the late 1500's and early 1600's, and have survived everything from rebellions to World War II to devastating earthquakes. It was one of the first in the country to be on UNESCO's list of World Heritage sites. I visited Himeji during my first trip in 2004, a few years before the renovations began.\nAdmission to the castle costs 1,000 yen and it's open daily except December 29 and 30 from 9 AM to 5 PM (in the summer months, until 6 PM). Entry ends one hour before closing.\nFrom Himeji's main train stations (JR and Sanyo Railway) Himeji Castle is a 5 minute bus ride (100 yen) or taxi ride (~700 yen), or a 25 minute walk (which is what yours truly ended up doing).\n\n[caption id=\"attachment_654\" align=\"alignright\" width=\"300\"] Matsuyama Castle. Photo by Jyo81 (CC BY 3.0)[/caption]\n\n4) Matsuyama Castle\nLocated on the island of Shikoku in an area known for its hot springs, Matsuyama Castle is another of Japan's original castles. It was built on a small mountain – Mount Katsuyama – and the location affords a great view of the city and the Seto Sea. It has largely survived intact; the castle tower was originally destroyed by lightning and rebuilt in the 1800's, while certain sections were rebuilt as a result of World War II bombing damage.\nDue to its high location, the castle is easily accessed by chairlift or ropeway. The castle is open almost every day of the year from 9 AM to around 5 PM and the admission fee is 510 yen. If you want to save yourself the steep climb on foot, the chairlift/ropeway is 510 yen for the round trip.\nThe nearest tram stop to the bottom of the mountain is Okaido, which houses a shopping arcade. It's 10 minutes from JR Matsuyama station, and 11 minutes from Dogo Onsen hot spring. One trip costs 190 yen, and a day pass costs 400 yen.\n\nMatsuyama Castle is not to be confused with another castle of the same name located near Okayama.\n\nAs with itineraries that I have shared in the past:\n- There are two itineraries given for each mode of transit. One starts and ends in Tokyo for those coming into the country at Narita or Haneda Airport. The other starts and ends in Osaka for those utilizing Kansai Airport instead.\n- All itineraries are offered subject to the Jose's Japan Tips DISCLAIMER.\n\nIn the case of these journeys, I have opted to just provide rail itinerary suggestions.\n\nFrom Tokyo By Rail\n\nDay 1:\nIn the morning, depart from Tokyo's Shinjuku Station on the Azusa Limited Express from Tokyo to Matsumoto (2 1/2-3 hours, 6,900 yen, no charge with Japan Rail Pass)\nVISIT MATSUMOTO CASTLE\nOnce your visit is complete, depart for Kyoto using two trains: The “Shinano” limited express from Matsumoto to Nagoya, and the Tokaido Shinkansen from Nagoya to Kyoto. Connecting to the “Nozomi” in Nagoya, the entire trip takes 3 hours and costs 10,170 yen. With a Japan Rail Pass, you will have to take the “Hikari”, increasing the trip time by 30-45 minutes.\nSpend the night in Kyoto. Alternatively, continue 15 minutes along the line to Shin-Osaka to stay in that area.\n\nDay 2:\nIn the morning, depart for Himeji on the Shinkansen. From Kyoto the trip takes 45 minutes by direct Nozomi (5,590 yen) and up to 60 minutes using other services. For Japan Rail Pass holders, there are three Hikari services from Kyoto to Himeji departing between 7 AM and 8:30 AM, after which there is one direct service per hour. Otherwise you'll need to change trains in Shin-Osaka.\nVISIT HIMEJI CASTLE\nIn the afternoon, depart for Matsuyama using the bullet train and limited express across the Seto Sea to Shikoku. You'll need to take the bullet train a short distance from Himeji to Okayama, then board the “Shiokaze” limited express from Okayama to Matsuyama. The trip takes approximately 3 1/2 hours (9,570 yen). You can use the “Nozomi” or the “Sakura” depending on whether or not you have a rail pass, or your preference – both trains will offer ample connections to the Shiokaze.\n\nDay 3:\nGet up early to enjoy the historic hot springs and VISIT MATSUYAMA CASTLE.\nIn the afternoon, return to Okayama at your leisure using any of the “Shiokaze” services (2 3/4 hours, 6,830 yen) and spend the night in Okayama.\n\nDay 4:\nDepart for Hakata station in Fukuoka at your leisure and spend two nights in Fukuoka. Use the “Nozomi” or “Mizuho” unless you have a Rail Pass, in which case you'd use the “Hikari” or “Sakura” (1 3/4-2 hours). Before leaving Okayama, you could visit Okayama Korakuen Garden, one of the top three Japanese gardens.\n\nDay 5:\nTake a day trip from Fukuoka to Kumamoto by Shinkansen, using the “Sakura” or “Tsubame” (40-50 minutes, 5,130 yen each way).\nVISIT KUMAMOTO CASTLE\n\nDay 6:\nTake the Shinkansen and return all the way to Tokyo at your leisure. By Nozomi it takes 5 hours and costs 22,950 yen with no change in trains necessary. With a Japan Rail Pass, the “Sakura” and “Hikari” will bring you to Tokyo in six hours, and you will need to change trains once.\n\nFor this itinerary, a 7 day Japan Rail Pass (29,110 yen) will save you a considerable amount of money compared to regular tickets. If you have an extra day left, why not stop at one or two other Japanese cities on the way back to Tokyo? Perhaps an overnight stopover?\n\nFrom Osaka by Rail\n\nDay 1:\nIn the morning, depart for Himeji on the Shinkansen. From Shin-Osaka the trip takes 30 minutes (3,740 yen). Remember if you have a Japan Rail Pass, you can't use the “Nozomi”.\nVISIT HIMEJI CASTLE\nIn the afternoon, depart for Matsuyama using the bullet train and limited express across the Seto Sea to Shikoku. You'll need to take the bullet train a short distance from Himeji to Okayama, then board the “Shiokaze” limited express from Okayama to Matsuyama. The trip takes approximately 3 1/2 hours (9,570 yen). You can use the “Nozomi” or the “Sakura” depending on whether or not you have a rail pass, or your preference – both trains will offer ample connections to the Shiokaze.\n\nDay 2:\nGet up early to enjoy the historic hot springs and VISIT MATSUYAMA CASTLE.\nIn the afternoon, return to Okayama at your leisure using any of the “Shiokaze” services (2 3/4 hours, 6,830 yen) and spend the night in Okayama.\n\nDay 3:\nDepart for Hakata station in Fukuoka at your leisure and spend two nights in Fukuoka. Use the “Nozomi” or “Mizuho” unless you have a Rail Pass, in which case you'd use the “Hikari” or “Sakura” (1 3/4-2 hours). Before leaving Okayama, you could visit Okayama Korakuen Garden, one of the top three Japanese gardens.\n\nDay 4:\nTake a day trip from Fukuoka to Kumamoto by Shinkansen, using the “Sakura” or “Tsubame” (40-50 minutes, 5,130 yen each way).\nVISIT KUMAMOTO CASTLE\n\nDay 5:\nIn the morning, make your way from Fukuoka all the way to Matsumoto, taking the Shinkansen to Nagoya then the “Shinano” limited express to Matsumoto. Using the Nozomi, the trip takes 5 1/2 hours (21,400 yen). With a Japan Rail Pass you'll need to take the “Sakura” and “Hikari” to Nagoya, changing trains once along the way. This increases the journey time to around 6 1/2 hours.\nIf you don't want to spend time on trains for that long, you can optionally leave from Fukuoka on the evening of Day 4 and spend your evening in an intermediate city such as Kyoto or Nagoya. See my post on sample stopovers.\nSpend the evening in Matsumoto.\n\nDay 6:\nVISIT MATSUMOTO CASTLE in the morning. In the afternoon, return to Osaka by “Shinano” and the Shinkansen (190 minutes and 10,810 yen by “Nozomi”, slightly longer if switching to the “Hikari” for Japan Rail Pass holders).\n\nFor this itinerary, once again a 7 day Japan Rail Pass (29,110 yen) is the way to go.", "source": "Jose's Japan Tips"}