{"published": "2015-09-04T03:55:33Z", "media-type": "News", "title": "Oklahoma County jurors acquite ex-jailer in inmate's death", "id": "c266aa90-b9da-4601-96bc-2dfaa04676e2", "content": "Jurors on Thursday acquitted a former sheriff's lieutenant in the death of an Oklahoma County jail inmate despite surveillance video that shows the jail supervisor aggressively detain the man. \n  \nJurors indicated that they found Andres Sanchez not guilty because the evidence was not clear as to when, where and how the injury happened. Defense attorneys had argued the fatal injuries happened after the scene shown on the video. \n \nSanchez, 55, of Yukon, was charged last year with second-degree manslaughter in the December 2013 death of inmate Emmett Stanley Martin. It took jurors two hours to reach their verdict. \n \n“I think the jury agreed that Lieutenant Sanchez did not cause the injuries which led to Mr. Martin's death,” lead defense attorney Michael Johnson said after the verdict. “I also think that juries understand the important job the police officers do in our state and did not feel like second-guessing the actions that were taken by the officers on that day.” \n \nProsecutors didn't allege Sanchez killed Martin on purpose but that he used excessive and unnecessary force during the incident. \n \n“The inmate died because the defendant went too far and bullied the victim,” Assistant District Attorney Joshua Young said during his closing argument. “The defendant bullied Emmett Martin ... once (the inmate) is contained, the defendant doesn't stop.” \n \nThe video \n \nThe video from inside the jail shows Sanchez and a few other officers crowding around Martin's cell door. \n \nMartin, 53, of Midwest City, is seen with his arm out of the door making it impossible for officers to secure the cell. \n \nCourt records state when Martin stepped out of the cell he “became uncooperative and combative” and officers took him to the ground. \n  \n\r Oklahoma County jurors shown video of inmate being detained before his death (Published Sept. 2, 2015) \r Oklahoma County inmate's jail death case will go to trial (Published Jan. 25, 2015) \r Judge wants more testimony before ruling on trial for former Oklahoma County jail supervisor (Published Dec. 2, 2014) \r Former Oklahoma County sheriff's lieutenant charged with manslaughter in inmate's death (Published June 11, 2014) \r \n  \nContinue reading this story on the...", "source": "NewsOK.com"}