{"published": "2015-09-24T16:28:00Z", "media-type": "Blog", "title": "Rare super moon eclipse to be stargazer's delight", "id": "51ee7d0d-1176-48aa-b104-fcc5e5964df9", "content": "It should be an out-of-this world treat for stargazers — a rare total eclipse of a super moon on Sunday night.\nThat is, if the weather cooperates. The forecast in South Florida calls for a 30 to 40 percent chance of rain and mostly cloudy skies.\nThe last time a total eclipse coincided with a super moon — so named because it will be at its closest point to Earth this year — was in 1982 and the next time will be in 2033. Lunar eclipse spawns viewing parties in Chicago and Lowell Joan Dittmann Sunday will be a stellar evening to go outside — even better if you look up. Sunday will be a stellar evening to go outside — even better if you look up. ( Joan Dittmann ) To celebrate this celestial event, there will be some lunar partying. For instance, S3, a Fort Lauderdale beach restaurant and hot spot, will offer live entertainment and allow moon-watchers to view the eclipse from its outdoor patio.\n\"They'll have front-row seats to the eclipse,\" said Jamie Bryan, a restaurant manager. \"Every full moon, we do a party. It just so happens this one's a super moon, so that works out nicely.\"\nAlso, the Fox Observatory at Markham Park in western Sunrise will be open to the public.\n\"Weather permitting, we'll have both of our telescopes open for business,\" said Steve Luxenberg, of the South Florida Amateur Astronomers Association. lRelated Ken Kaye's Storm CenterDont expect any frost on the pumpkin this weekSee all related\n8\nEven without a telescope, the eclipse can be easily seen and, unlike a solar eclipse, there's no risk of damaging your eyes.\n\"It will be a big, bright, full moon, so it should be a spectacular eclipse,\" said Susan Barnett, director of the Buehler Planetarium & Observatory in Davie. \"Get some lawn chairs, some good friends and some good beverages because to really watch it will take a few hours.\"\nWhile a partial eclipse starts at 9:07 p.m., the total eclipse arrives at 10:11 p.m. and ends 72 minutes later, at 11:23 p.m. on Sunday. cComments Got something to say? Start the conversation and be the first to comment. Add a comment 0 The darkest point, or greatest eclipse, takes place at 10:47 p.m. The remainder of the eclipse continues until 12:27 a.m. Monday.\nA lunar eclipse occurs when the Earth falls between the full moon and the sun. Since 1900, there have been only five total eclipses of a super moon, according to NASA.\nAlthough the moon will be 14 percent larger than normal, it will be hard for the naked eye to tell the difference, Barnett said. But it also will be 31,000 miles closer than normal, making it about 30 percent brighter.\n\"The orbit of the moon is not perfectly circular, so sometimes the moon is closer to us than at others,\" she said.\nWhile the moon will rise out of east about 7 p.m. Sunday, it should be about 30 to 40 degrees above the horizon during the eclipse, said Arnold Pearlstein, a Fort Lauderdale astronomer.\n\"It doesn't matter if you're in the Kmart parking lot or in the middle of the Everglades, you'll still have a nice view of it,\" he said.\nIn addition to being a super moon, it will be considered a \"blood moon,\" because the lunar surface takes on a reddish color during a total eclipse.\nAnd if that wasn't enough, it also will be a \"harvest moon,\" or the first full moon after the start of autumn. Potentially, it could cause some minor high-tide flooding along the coast over the weekend, Pearlstein added.\nBecause some people still aren't convinced the Earth is round, its shadow on the moon will prove without a doubt that our planet is a sphere, said Eric Vandernoot, astronomy coordinator at Florida Atlantic University in Boca Raton.\n\"I occasionally have had people come to the observatory to debate the idea that the Earth is spherical and that gravity holds people on the Earth,\" he said. \"Luckily, not too often. But they are out there.\"\nkkaye@tribpub.com\nCopyright © 2015, Sun Sentinel Privacy Policy", "source": "Home - Sun Sentinel"}