{"published": "2015-09-10T13:55:44Z", "media-type": "News", "title": "Prince George's China Delegation Hits the Ground Running", "id": "fd481e36-c450-4e2e-9530-052866098177", "content": "Beijing,China - County Executive Rushern L. Baker, III is leading a 22 member delegation of business and government officials to China looking toward investment opportunities and partnerships with Chinese business owners and investors. While we were resting up for Labor Day on Sunday, the Prince George's County delegation began its first full day on the mission with a quick stop at the Great Wall of China then gathered to tour the Zhongguancun China Science Park (Z-Park) in Beijing. Z-Park is China's premier science and technology development center and was the first state-level high-tech development zone approved by the State Council in 1988. This Beijing icon is very well known in China and is often referred to as China's \"Silicon Valley\" because of its connections to information technology and its strategic cooperation with other science parks.\n\nWith a stack of bilingual business cards in their pockets, the delegates were treated to lunch at Z-Park by the Rechsand Science and Technology Group, and met with 40 tech companies that were eager to do business with members of the delegation. After lunch, EDC President Jim Coleman presented to the Z-Park companies the value of doing business in Prince George's County, why Prince George's County is the \"Gateway to the U.S. Market\", and the mission delegates' investment and partnership opportunities. Mr. Coleman also officially announced the opening of the China Business Center in the Prince George's County Economic Development Corporation. The China Business Center offers Chinese-based companies a successful 'launching pad' to enter the United States business market. With services ranging from office space to recruitment of local staff, the China Business Center is a turnkey solution for any Chinese based company seeking to grow sales by selling innovative products to U.S. based companies and government agencies.\n\n\"I am delighted by the response we have been getting from China's business and government leaders,\" said EDC President and CEO Jim Coleman. \"With the investment opportunities that our delegation is presenting this year, we are hoping to duplicate the Rechsand partnership model and confident that these projects will be coming to fruition very soon.\" \n\nThe Rechsand Science and Technology Group is a company that the Baker Administration touts as one of its successes from the 2014 China Mission. Through the partnerships that were created on that mission, the County facilitated an alliance between Rechsand and Corvias Solutions - the company that won a $2 billion contract with the County for storm-water management project. This alliance has generated a partnership/presence with Prince George's County and helped create the \"Sponge City\" initiative where Rechsand's technology (based on a model from Prince George's County) will be used in 16 cities around China to improve water quality.\n\nIf you are interested in doing business internationally, contact Elizabeth Crittenden (eacrittenden@pgcedc.com) or 301-583-465", "source": "Consumer Electronics Net"}