{"published": "2015-09-09T16:03:58Z", "media-type": "Blog", "title": "75% Bonus On Purchased Hilton Points", "id": "57ad0580-191b-467c-a731-8299b88beec5", "content": "In the interest of full disclosure, One Mile At A Time earns a referral bonus for purchases made through some of the below links. These are products and services we use ourselves, and are the best offers we know of. Thanks for your support! Through October 5, 2015, Hilton HHonors is offering up to a 75% bonus on purchased points. This comes roughly a week after Hilton concluded their previous bonus on purchased points. Through this promotion, the bonuses are tiered, meaning the more points you purchase, the greater the bonus you receive: Buy 10,000-29,000 points, receive a 25% bonus Buy 30,000-39,000 points, receive a 50% bonus Buy 40,000+ points, receive a 75% bonus The cost to purchase points with HHonors is ordinarily one cent per point (including tax), so assuming you purchase at least 40,000 points you’d be looking at a cost of ~0.57 cents per Hilton point. You can purchase a maximum of 80,000 HHonors points before any bonuses per account per calendar year, meaning the highest number of points you can pick up through this promotion is 140,000 at a cost of $800. I value Hilton HHonors points at ~0.4 cents each, though there are certainly instances where you can get more value out of Hilton points than that. To put that price into context, here are Hilton’s award categories (as you can see there’s quite a bit of variance in each category — HHonors is the closest to being a revenue based hotel program): A Category 1 property is 5,000 points per night, and Hilton offers elite members a fifth night free, bringing down the average cost to 4,000 points per night. At ~0.57 cents per point, that’s like paying ~$23 per night: Meanwhile Category 2 properties go for 10,000 points per night, so with a fifth night free that’s an average cost of 8,000 points per night. At ~0.57 cents per point, that’s like paying ~$46 per night: As you can see, in all cases these represent huge savings over the paid rates. In many cases the numbers work out quite favorably as well for higher end hotels. Here are the full terms of the promotion: Points purchased do not count towards elite tier qualification. Points.com and Hilton HHonors reserve the right to terminate bonus promotions at any time. All purchases must be made through the Purchase page on HHonors.com. The up to 75% bonus is available for purchases made between September 9, 2015, at 12:01am ET and October 5, 2015, at 11:59pm ET. All purchases are non-refundable. Offer is subject to change. Offer cannot be combined with any other offer. Points will be posted to the recipients Hilton HHonors account within 24 hours of the completed transaction. Buy transactions are final and non-refundable. All Hilton HHonors program terms and conditions apply. Hilton HHonorsTM membership, earning of Points and MilesTM and redemption of Points are subject to HHonors Terms and Conditions. * Email address is required and will only be used for transaction and marketing communications related to this purchase.Price includes all applicable fees. GST/HST will be charged to Canadian residents. Members may receive a maximum of 80,000 purchased points per calendar year. Purchased points are not refundable and are applicable towards all HHonors awards. Points purchased using this option will post within 24 hours. Email address is required and will only be used for transaction and marketing communications related to this purchase. Purchased points do not count towards HHonors status upgrades. All standard HHonors program rules and conditions apply. As you can see, purchased points should post within 24 hours, and purchases are processed by points.com, meaning they don’t qualify as hotel spend for the purposes of your credit card. Therefore you’ll want to use a credit card which maximizes your return on everyday spend for the purchase. Bottom line  In general I’m not for speculatively buying points when they’re being sold for more than I value them. That being said, that’s the beauty of non-revenue based points currencies — the way in which people value them varies wildly. I know people that value Hilton points at 0.3 cents each, and I know people that value them at 1.0 cent each. Ultimately a 75% bonus isn’t the best we’ve seen. Like I said, we saw an 80% bonus recently, and before that we saw a 100% bonus. That being said, if you have a short term use of the points in mind and the math works out, it can definitely make sense to take advantage of this promotion. I also think it’s interesting to note how HHonors seems to be a more aggressive program lately. They’ve been selling points much more frequently than in the past, and have also greatly improved their promotions. Do you plan on buying Hilton HHonors points for ~0.57 cents each? More from One Mile At A Time", "source": "BoardingArea"}