{"published": "2015-09-02T00:52:30Z", "media-type": "News", "title": "“Doesn’t the historical preservation process essentially put a hold on the sale and development? Nobody is served by...”", "id": "ac511a01-893b-40df-9a66-369fefa272fc", "content": "A developer is seeking to tear down these homes owned by James Sonnleitner in the 2300 block of Eliot Street in Denver’s Jefferson Park neighborhood. City Councilman Rafael Espinoza has sought historic designation of the home on the left. (Jon Murray, The Denver Post) \n \nUPDATE:  The Landmark Preservation Commission will have a hearing on the issue Oct. 6. \n \nThe ball is now back in the city of Denver’s court in a preservation fight that pits neighborhood activists and a City Council member against a Jefferson Park homeowner who wants to sell his property to a developer. \n \nA court recently rejected the developer’s challenge of the city’s decision to accept a preservation application filed by a group including Councilman Rafael Espinoza, who signed it before he took office July 20. But a stay remained on the Landmark Preservation Commission’s process until late last week, when the judge lifted it, according to a Denver Community Planning and Development spokeswoman. \n \nRafael Espinoza \n \nThat means the clock has restarted. The commission and, if needed, the City Council have about 90 days left to decide whether to designate James Sonnleitner’s Queen Anne-style house on Eliot Street as a historic landmark, as Espinoza and his partners argue is merited. \n \nSuch status would prevent demolition — but it also could imperil Sonnleitner’s deal to sell the property to Adams Development , which plans to build townhomes in the fast-changing neighborhood. \n \nA spokeswoman for the developer issued this statement Monday on behalf of developer Nathan Adams : “Mr. Adams will not appeal the Judge’s ruling. Adams Development plans to support Mr. Sonnleitner in his quest to retain his property rights and not be forced to designate his property as a landmark property.” \n \nA hearing before the preservation commission has been set for 1 p.m. Oct. 6.", "source": "Denver Post"}