{"published": "2015-09-07T00:00:00Z", "media-type": "News", "title": "China Slowdown, U.S. Rate Hike Transient Factors; India to See Respectable Growth: Jaitley", "id": "7602b762-458f-424f-ab9c-3b42d3df8137", "content": "NEW DELHI: India's ability to post a respectable GDP growth \"looks positive\" this year, Finance Minister Arun Jaitley has said terming as \"transient\" global factors like Chinese devaluation and uncertainty over rate hike in the U.S.\n\n\"Eventually, when these transient things blow over, then it is the real economy that is going to matter,India's ability to post a respectable growth rate looks very positive this year,\" he told agency on the sidelines of the G20 Finance Ministers and Central Bank Governors Meeting.\n\nUnion Finance Minister Arun Jaitley. AP Union Finance Minister Arun Jaitley. AP \"The Fed hike remains a matter which the U.S. will decide later this month. But, according to me, whatever situation emerges, that would be only a transient phase and therefore our response is that we have to strengthen our own real economy parameters,\" Jaitley said.\n\nSpeaking after the meeting, the minister said that India needs to ensure that the parameters of its own real economy are strengthened and the government progresses well on that track.\n\nHis comments come against the backdrop of India's GDP growth slowing to 7 percent in the three months ended June from 7.5 percent recorded in the January-March quarter.\n\nThe decline was mainly on account of deceleration in farm, services and manufacturing sectors. The GDP grew at 7.5 percent in the January-March quarter while it was 6.7 percent in the April-June quarter last year, according to data from the Central Statistics Office (CSO).\n\nTo a query on whether concerns on Chinese currency and Fed rate hike were raised at the G20 meeting, Jaitley said comments were made from various quarters in this regard.\n\nWhen asked whether industry's concerns over land acquisition would come in the way of economic growth, the finance minister said the government has already indicated an \"alternative road map\" in that regard. He said states would be free to pass their own land acquisition laws.\n\nAlso Read: Finance Ministry May Introduce MUDRA Bill", "source": "Silicon India"}