{"published": "2015-09-24T18:22:28Z", "media-type": "News", "title": "The Player: Why You Should Bet on Wesley Snipes' Return to TV", "id": "3deea828-e3a1-4c4d-9a90-482cabc020d8", "content": "NBC's new drama The Player  has one of the most ridiculous premises of any of the new fall TV shows -- but that's not a bad thing. Unlike so many of the shows trying to \"cut through the clutter\" with a splashy concept, The Player knows exactly what it wants to be: a high-octane crime thriller that doesn't take itself too seriously. And it shouldn't with a setup like this: Alex Kane ( Philp Winchester ) is a private security specialist in Las Vegas who, after the murder of his wife Ginny ( Daisy Betts ), is pulled into a long-running conspiracy involving the richest people in the world gambling on crime. With the help of \"pit boss\" Mr. Johnson ( Wesley Snipes ) and \"the dealer\" Cassandra ( Charity Wakefield ), Alex, as \"the player,\" tries to stop crimes while the fat cats in \"the house\" bet on or against his ability to save the day. Got all that? \"We knew we wanted to make a pulp show,\" co-creator John Rogers tells TVGuide.com . \"The way pulp works is to find a good, simple, defining metaphor, and we said, 'What are the elements of gambling?' If you're going to have a conspiracy, you're going to have code names, you're going to a have a structure. When we looked at the basic form of gambling, the feel of a casino, and it just came very naturally. People understand those terms -- millions of people gamble. We're not introducing obscure vocabulary to explain our very high-concept, obscure conspiracy.\" Fall Preview: Check out all the must-watch new shows But it was also important for Rogers to have some emotional context beneath all the Las Vegas window-dressing. \"Everyone right now feels as if maybe the rules were changed on them,\" Rogers says. \"You sent your kids to college, but somehow your college graduate is living in your basement because he can't get a job. It feels like we're trapped in a game that somebody changed the rules. We said, 'Why don't we externalize that? Why don't we talk about the fact we are trapped in a game, and there's one guy in the middle of it who is on our side?' That gave us the emotional stakes of the show.\" Page 2 of 3 - For Alex, his journey is entirely fueled by the heartbreak he feels over the death of his wife. \"Trying to resolve how Ginny died and why she died and who's responsible, is the primary emotional thrust of his investigation,\" Rogers says. \"That's the thing that keeps him going back undercover into this organization.\" And continuing to go back in is an issue. After all, the whole concept of a group of people profiting off of crime rather than trying to prevent it is pretty icky, right? \"They're doing a horrible thing,\" Rogers says with a laugh. \"It allows us to have some fun every week, but they're plainly bad guys. Alex is a good guy in the middle of a bad system. One of the essential questions of the show is: Is that system actually the best possible system that we can live with?\" Because of Alex's unease about what he's doing, The Player is unlike most procedurals where the team is one big happy family. Instead, when, in the pilot, Alex threatens to kill Mr. Johnson one day in the not-too-distant future, you're inclined to believe him. However, the team still has to rely on each other, regardless of how much they trust their colleagues. \"Everyone has their own agenda, everyone has their own secret plan, and everyone has their own sort of shifting allegiances,\" Rogers says. \"They are in a life-and-death world, and they have to trust each other as far as they can to not die, but never trust each other enough to make themselves vulnerable.\" The Player 's Wesley Snipes and more familiar faces in new places That central conflict will certainly begin to define Mr. Johnson's moral ambiguity, which is exactly what attracted Snipes to the role. \"I get to explore some character work in a way that I probably couldn't in a feature film,\" Snipes says. \"You never know which side he's playing for. You'll learn quickly that Mr. Johnson knows secrets that no one else knows. He's seen a lot of players come and go, and this guy is nothing special at this point. Or so we make it appear. Mr. Johnson has another card that he hasn't played yet. There's a whole deck that Mr. Johnson hasn't played yet.\" However, Rogers is quick to caution people from deciding outright that Mr. Johnson is the bad guy. \"There are weeks that Mr. Johnson does something heroic because it fits his sense of personal ethics, and you're like, 'Yeah, I love Mr. Johnson!'\" Rogers says. \"Then, there are days that he's the most horrible human being in the world. I don't know if you ever want to be rooting for him, but you should be fascinated by him. ... His views on power are not necessarily wrong, they're just horrible.\" Page 3 of 3 - Then again, Alex isn't an entirely noble hero either. \"He's saving lives. He genuinely enjoys the work, but Alex Kane has a problem. He is a man with a high capacity for violence and a tendency towards it,\" Rogers says. \"To a great degree the two themes for the show are power and addiction. We all have behaviors we're drawn to. We all have those things we can't let go of, be it Ginny's death or the constant fall into violence which comes very easily to him. We all have these desires that are beyond our control, and how we deal with them to a great degree is what defines us.\" Although the show is clearly reveling in its procedural makeup (\"I love the one-and-done of it,\" Rogers confesses), the writers are telling a longer story. However, the central mystery of Ginny's murder, which gets much more messy by the end of the pilot, won't be stretched out forever. \"The mystery of how that happened, who did it, why it was done -- all of that is meant to be an important thing that we reveal to the audience over the course of the first 12 episodes,\" Rogers says. \"We're not going to hold you over a barrel for five years. Most of the questions in the first season will be resolved by the end of the first season.\" The Player premieres Thursday at 10/9c on NBC. Will you watch? Other Links From TVGuide.com", "source": "Nevada County Picayune"}