{"published": "2015-09-15T17:30:00Z", "media-type": "News", "title": "Mudgee branch of Amnesty International welcomes decision on Syrian refugees", "id": "5690727e-12cd-4f1a-b927-e119a21db588", "content": "The Federal Government’s decision to accept 12,000 Syrian refugees into Australia is a start according to the convenor of Amnesty International’s Mudgee branch, Heather Drew. The Federal Government’s decision to accept 12,000 Syrian refugees into Australia is a start according to the convenor of Amnesty International’s Mudgee branch, Heather Drew. Ms Drew said Amnesty was pleased the Australian government has decided to take in some of the millions of Syrian’s unable to return home, especially considering how desperate the situation is getting. \n\n“It’s a start really,” Ms Drew said.\n\n“The number of Syrian people who are no longer able to return to their own country is in its millions, and all of these people are desperate to make a new home for themselves. \n\n“We’ve agreed to take 12,000 but the government may need to think about agreeing to take more.”\n\nMs Drew said while some people had made suggestions that the number was too high, Germany had agreed to house 800,000 refugees that made their way to Europe.\n\n“Twelve thousand people sounds wonderful in comparison to the number Australia agreed to take a year ago, but compared to the total number of people who need help – maybe the government will need to look at the figures again,” Ms Drew said.\n\nMs Drew said there are around four million Syrian refugees registered with humanitarian groups. \n\nA large percentage of these people are immigrated to neighbouring countries like Jordan and Lebanon, putting strain on the local economies and resources. \n\n“There are 7.6 million people who are internally displaced in Syria. People are saying this is the largest humanitarian disaster since the last world war,” Ms Drew said. \n\nMs Drew said it was fantastic to see the public becoming involved in the issue, and believed it was a continuing level of public support that pushed the government to agree to help. \n\n“There’s word that quite a few towns around the country are willing to take rather large numbers of refugees and help them create new lives,” she said. \n\n“And a lot more people than the government has agreed to take in.”\n\nAccording to the federal government, women, children, and families from persecuted minorities sheltering in Jordan, Lebanon and Turkey will take priority. \n\nThe government will also spend $44 million supplying 240,000 refugees with cash, food, water and blankets in Lebanon, Turkey and Jordan.\n\nSenior government officials said the first refugees could arrive by Christmas. \n\nIt’s intended that the 12,000 will arrive within the financial year.", "source": "Mudgee Guardian"}