{"published": "2015-09-29T05:34:30Z", "media-type": "News", "title": "Data disappearing? Turn off this feature in iOS 9", "id": "a75b8d6d-79ae-4065-90bf-855553dcb493", "content": "Apple’s latest mobile operating system iOS 9 has brought with it all manner of shiny new features. Some are excellent, but one in particular is a little suspect, promising a better mobile internet experience, if you don’t mind the associated costs, that is. And most of us, I fear, would rather have less-than-perfect connectivity than an inflated data bill. \n \nIf you go to “Settings”, then “Mobile Data”, and scroll right to the bottom, you’ll find something called “Wi-Fi Assist” on an iPad or iPhone that’s been updated to iOS 9. This feature will be turned on by default after the update. What it does is automatically switch you over to a mobile data connection once the device detects that a Wi-Fi connection is poor or weakening. So, for example, when you leave an area with Wi-Fi — like your home or office or that coffeeshop with the crummy coffee but fibre internet — you’ll see your device trying to cling to the connection until the last possible moment. This feature is meant to get around that by letting you immediately shift to mobile data. \n \nThe problem is, almost all of us are on limited data plans. Whether it’s buying a GB or two of data each month on prepaid, a monthly allowance on a contract  — which, once depleted, can result in eye-watering out-of-bundle data rates — or a combination of the two with top-up accounts, we simply can’t afford to use mobile data the same way we use Wi-Fi. \n \nHell, most of us have changed our behaviour accordingly, limiting things like updates to times when we’re in Wi-Fi range. So turn off “Wi-Fi Assist” and remind your device it’s not in South Korea, and neither are you. \n \nThe post appeared first on Stuff .", "source": "Stuff.co.za"}