{"published": "2015-09-28T07:34:01Z", "media-type": "News", "title": "Rupee trading at over 66 to the dollar Sensex down 25 points in early trade", "id": "7ef584e3-3b58-403f-9377-af7868342a8d", "content": "Sharif wants to internationalise Kashmir issue at every meeting and forum claims CPIs D. Raja  \nMumbai News.Net - Monday 28th September, 2015 \n \nCommunist Party of India (CPI) leader D.Raja on Monday said Pakistan Prime Minister Nawaz Sharif's decision to raise the Kashmir issue at the 70th session of the United Nations General Assembly  ... \n   Indias first dedicated space observatory Astrosat launched successfully from Sriharikota  \nMumbai News.Net - Monday 28th September, 2015 \n \nCountry's first dedicated satellite for astronomical research, Astrosat, was successfully launched from Satish Dhawan Space Centre today here in Bengaluru at 10 a.m.\n   \nThe Polar Satellite Launch  ... \n   Swamy advises PM Modi to sack Rajan if bank rates are not decreased  \nMumbai News.Net - Monday 28th September, 2015 \n \nBharatiya Janata Party (BJP) leader Subramanian Swamy has said that Prime Minister Narendra Modi must instruct Reserve Bank of India (RBI) Governor Raghuram Rajan to either cut rates or be ready to  ... \n   PM Modi asks UN to differentiate between terrorist humanity supporters  \nMumbai News.Net - Monday 28th September, 2015 \n \nPrime Minister Narendra Modi today pointed out that the United Nations took fifteen years to define the term 'terrorism', adding that it must clarify as to who is with terrorists and who is with  ... \n   SMS-based investment scam SEBI tightens surveillance on public media platforms  \nMumbai News.Net - Monday 28th September, 2015 \n \nWith a concern over a spurt in investment scams perpetrated through SMSes, WhatsApp and social media, on such platforms, the Securities and Exchange Board of India (SEBI) has beefed up its  ... \n   India moving ahead with JAM of all says PM Modi  \nMumbai News.Net - Monday 28th September, 2015 \n \nPrime Minister Narendra Modi here said that India is moving ahead with 'JAM of all.'\n   \n\"We are moving ahead with 'JAM of all', where 'J' stands for Jandhan account, 'A' for Aadhar Card and 'M' for  ... \n   PM Modi reiterates announcement of Air Indias direct flight to California  \nMumbai News.Net - Monday 28th September, 2015 \n \nPrime Minister Narendra Modi has reiterated the announcement of Air India's direct flight from Delhi to San Francisco that will fly thrice in a week, while adressing the Indian diaspora  ... \n   PM Modi departs for New York to meet President Obama  \nMumbai News.Net - Monday 28th September, 2015 \n \nAfter addressing the Indian diaspora here at the SAP Center, Prime Minister Narendra Modi departed for New York to meet United States President Barack Obama.\n   \n\"Goodbye California, Prime Minister  ... \n   PM Modi reiterates his commitment to fight corruption I will live and die for India  \nMumbai News.Net - Monday 28th September, 2015 \n \nTalking about corrupt practices in politics, Prime Minister Narendra Modi has said even as most of the leaders in India are indulged in corrupt practices, he has no allegations of corruption against  ... \n   PM Modi bats for e-governance in Silicon Valley  \nMumbai News.Net - Sunday 27th September, 2015 \n \nWhile addressing the Indian diaspora at SAP Centre, Prime Minister Narendra Modi reiterated the need for electronic governance in India to take the prospect of developments further.\n   \n\"It has been  ... \n   PM Modi terms `brain drain` as `gain` for India  \nMumbai News.Net - Sunday 27th September, 2015 \n \nWhile addressing the Indian diaspora at SAP Centre, Prime Minister Narendra Modi has said that \"brain drain\" is \"brain gain\" as it will be benefitting the country with added interests.\n   \n\"I think  ... \n   PM Modi remembers Bhagat Singh in his address  \nMumbai News.Net - Sunday 27th September, 2015 \n \nPrime Minister Narendra Modi has remembered freedom fighter Bhagat Singh on his birth anniversary during his address to the Indian diaspora here.\n   \n\"Today is September 28 in India and it is the  ... \n   PM Modi meets lawmakers ahead of his address  \nMumbai News.Net - Sunday 27th September, 2015 \n \nPrime Minister Narendra Modi met elected lawmakers from California ahead of his address to the Indian community in the SAP Center here.\n   \nHe was presented with San Jose shark jerseys by elected  ... \n   PM Modi discusses his initiatives with social media giants  \nMumbai News.Net - Sunday 27th September, 2015 \n \nPrime Minister Narendra Modi, during his visit to the Facebook headquarters at Menlo Park, requested the company's CEO Mark Zuckerberg to see how social media could be used for giving greater  ... \n   PM Modi meets Salman Khan Governor of California  \nMumbai News.Net - Sunday 27th September, 2015 \n \nSalman Khan, the founder and CEO of Khan Academy, called on Prime Minister Narendra Modi here today.\n   \n\"An educator with a difference. Salman Khan, founder of @khanacademy calls on PM  ... \n   PM Modi to meet David Cameron tomorrow  \nMumbai News.Net - Sunday 27th September, 2015 \n \nPrime Minister Narendra Modi will meet his British counterpart David Cameron in New York tomorrow.\n   \nMinistry of External Affairs (MEA) official spokesperson Vikas Swarup said that Prime Minister  ... \n   PM Modi discusses renewable energy collaboration with U.S Energy Secy  \nMumbai News.Net - Sunday 27th September, 2015 \n \nPrime Minister Narendra Modi met with U.S. Secretary of Energy Ernest Moniz here to discuss collaboration in renewable energy between both nations.\n   \nFollowing this, the Prime Minister will have a  ... \n   PM Modi attends India-US Start-up Konnect 2015  \nMumbai News.Net - Sunday 27th September, 2015 \n \nPrime Minister Narendra Modi attended the India-US Start-up Konnect 2015 here today.\n   \nLinkedIn cofounder Reid Hoffman speaking at the event said what Prime Minister Modi is doing in terms of  ... \n   We should encourage Hackathon culture in India  PM Modi  \nMumbai News.Net - Sunday 27th September, 2015 \n \nPrime Minister Narendra Modi today called for encouraging Hackathon culture in India so that the youth are inspired to find solutions to the country's problems.\n   \n\"For 15 hours you all sit in  ... \n   Google announces Wi-Fi hotspots for 500 railway stations in India  \nMumbai News.Net - Sunday 27th September, 2015 \n \nGoogle CEO Sundar Pichai today announced a proposal for introduction of broadband connectivity through Wi-Fi hotspots for 100 railway stations in India and said that it would be expanded to 400 by  ...", "source": "Mumbai News.Net"}