{"published": "2015-09-09T22:25:55Z", "media-type": "News", "title": "Gazan female sports journalist aims to go beyond the border", "id": "8eb0cdf7-34b1-4a59-9dee-a28fdeaee36b", "content": "With her camera and notepad at the ready, it’s a regular day’s work for  Palestinian sports reporter Nelly al-Masri. \n\nSnapping sports men and  women, she’s among the few female journalists covering sporting events in  Gaza. \n\nMasri comes from a sporting family, her father, Ismael al-Masri was  a well known soccer player and coach in the 1960s. \n\n“For sure, my  upbringing has a huge role in developing my skills in the sports field,  memorizing the information and knowing all related issues to the Palestinian  sport. \n\n“Since my father was a player on the Palestinian soccer team in  the ’60s, a well-known football coach and managed the Palestinian soccer team  until 2005, that qualified me to have a lot of information regarding Palestinian  sports, the clubs, the players and it encouraged me to love sports, play it and  later enter the field of sports journalism,’’ said al-Masri. \n\nWorking in a  male-dominated industry in a conservative environment isn’t always  easy. \n\nBut for Masri it isn’t the social barriers that are getting in the  way of her career, she says it’s the travel restrictions imposed by Israel and  Egypt that makes it hard for her to pursue certain stories. \n\n“Closing the  crossings caused me to lose many chances. I was going to participate in a  conference in Morocco with the Arab sports leaders association and [another  conference] in Sharm el-Sheikh. I have conferences that I want to attend in  October in Bahrain and Morocco, the conference for female Arab sports reporters,  but until now I don’t know if I will be able to get out of Gaza or not,’’ she  said. \n\nAs a member of the West Asian Athletics Association media committee  and vice president of the women’s sports committee in the Palestinian Olympic  Committee, Masri is making strides in her field. \n\nAnd according to her  father she’s a role model for other women wanting to follow in her  footsteps. \n\n“It’s important to me as an athlete and as a modern man who  lived the experience to encourage a role for woman in society. The woman should  pave her way in society as she likes it and it’s in line with her  hobbies. \n\nI support women to be a part of society. We are a Muslim and  modern society that understands the traditions of our country and homeland,’’  said Ismael al-Masri. \n\nA blockade imposed by Israel and Egypt means  residents cannot import many basic construction materials to rebuild, as they  can be used to build weapons and attack tunnels. Israel no longer gives work  permits to Gazans, and only a tiny few ever receive permission to set foot out  of the increasingly impoverished enclave, the rest confined indefinitely to an  area less than half the size of New York City. \n\nAccording to the World  Bank, Gaza now has the world’s worst-performing economy, with the world’s  highest unemployment at 43 percent, 68 percent among those aged 20-24. Since  1994, real per capita income has fallen by nearly a third. Manufacturing – once  the hoped-for backbone of an economic revival – has shriveled by 60  percent. \n\nBut despite the setbacks, Masri remains committed to covering  stories beyond the Gaza border.", "source": "Jerusalem Post"}