{"published": "2015-09-30T19:37:50Z", "media-type": "News", "title": "In 2015, Volatility From A Phantom Rate Hike", "id": "eea8334b-71a2-4af5-9a38-b1ec8da3cbab", "content": "by Tony Crescenzi, PIMCO  \nMany investors are familiar with the adage, “they don’t ring a bell,” to warn when it is time to get in or out of an investment. Well, sometimes they do, or so the famed scientist Ivan Pavlov would likely contend. The physiologist trained dogs to salivate at the sound of a bell, having conditioned them to associate the bell with the delivery of food. Pavlov discovered that he didn’t actually have to deliver the food to get the canines to salivate in anticipation. \n \nIt is no different in markets, where the anticipation of an event can invoke the same response as the real thing. Market participants seek to discount the future, after all. \n \nIn 2015, market volatility has been rooted in a phantom rate hike from the Federal Reserve, which throughout the year has been ringing a bell to warn markets that it is on the verge of raising interest rates for the first time since 2006. Though it hasn’t happened, the Fed has elicited a typical Pavlovian response, causing markets to shudder at the thought and prompting a very significant chain of events that has rippled throughout global financial markets. While anticipation of the Fed’s rate hike isn’t the cause of market volatility, it has been a catalyst . \n How the greenback turned markets red  \nThe chain of events began, as we noted in the April publication of the Global Central Bank Focus , with a rise in the value of the U.S. dollar at the end of 2014 (Figure 1). The ascension was predicated upon the idea that global central bank policies would begin to diverge, with the Federal Reserve expected to raise interest rates at a time when the rest of the world and, in particular the developed world, was still in the midst of providing new monetary accommodation. This started the ball rolling. Yet, there was no actual rate hike. \n \n\n \nThe strengthening U.S. dollar and the anxious anticipation of a Fed rate hike by investors throughout the world sparked a cascade of events, all inextricably linked. One of these events has been a decline in commodity prices (Figure 2), which often fall when the dollar strengthens. The decline hurt markets in commodity-producing nations, including many in the emerging markets. Declines in commodity prices and attendant weakness in emerging markets has dominated markets this year, spilling over into developed markets by weakening equity markets, widening credit spreads and suppressing interest rates. \n \n\n \nThe most prominent of the commodity price declines has been energy prices (Figure 3). Although the decline is rooted in significant global supply and demand imbalances, the dollar’s strength has played a role too, and it has wreaked havoc in many financial markets while also significantly weakening capital expenditures in the energy sector. \n \n\n   \r\n\r  Even China felt the phantom hike  \nThe biggest fallout from the Fed’s phantom rate hike has been in China. The strengthening U.S. dollar, to which China’s currency is quasi-pegged, caused China’s currency, the yuan, to strengthen on an inflation-adjusted basis at a time its economy was weakening. This is the opposite of what tends to happen and it is an undesirable outcome for a central bank seeking to stimulate economic growth by cutting interest rates, as China has. China recognized this and took action to weaken its currency on August 10, aiming to bolster its export sector (Figure 4). Global financial markets were riveted by the unexpected move, spurring substantial market volatility highlighted by a plunge in global equities prices. \n \n\n \nChina-related volatility generated a feedback loop in global markets, resulting in further weakness in commodity prices and emerging markets, keeping downward pressure on global equities and upward pressure on credit spreads. \n \nThe result has been a tightening of overall financial conditions that, if continued, would threaten the global economic outlook. These “international developments,” as the Fed has called them, are what led the Fed to delay the rate hike it otherwise was likely to deliver at its September 17 policy meeting. \n Fear of a hike in a post-crisis era enough to significantly tighten financial conditions  \nA tightening of financial conditions is a desirable outcome for central banks that embark on a path to raise interest rates, but the Fed hasn’t taken a single step onto the path. If it had, it would want its reduction in monetary accommodation to transmit through these five channels: \n Stock prices  Bond yields  Credit spreads  Lending standards  The value of the U.S. dollar  \nAs we noted in April, it’s that fifth channel – the value of the U.S. dollar – that has received the most attention this year, even though the other four have a far larger bearing on economic activity. Now that the other four have been infected by the fifth, the Fed is naturally concerned about risks to the economic outlook. \n \nThat markets have moved so significantly on the prospect of a Fed rate hike exposes the fragility of the global financial system, which remains mired in a lengthy era of deleveraging (Figure 5). It demonstrates the difficulty that central banks face in escaping crisis-era policies, including zero percent policy rates. In fact, as former Fed Chair Ben Bernanke has reminded us at our quarterly cyclical forums in Newport Beach, no nation has ever successfully escaped the zero bound in the postwar era. \n \n\n \nFor investors, what mattered this year was not whether or when the Fed would raise interest rates, but whether the markets still perceived the Fed to be the first mover. In other words, going forward, this means that as long as the divergence theme between the world’s central banks holds intact, so will the anticipatory response in the global financial markets. Mind you, several major central banks will attempt to wrestle back control for their own sake, including the European Central Bank, the Bank of Japan and the People’s Bank of China. But all, including other central banks, will remain strongly influenced by what the Fed does – or does not do – next. \n Investment implications and lessons for investors from this year’s tumult  \nThere are five primary investment implications and lessons for investors to draw from this year’s tumult in the global financial markets: \n Rates are likely to stay low for longer: In keeping with PIMCO’s New Neutral thesis, the Federal Reserve has demonstrated that it is likely to take a very gradual \nLike this article? Sign up for our free newsletter to get articles delivered to your inbox \n \r \r  Pages: 1 2   View Full", "source": "Value Walk"}