{"published": "2015-09-04T15:11:01Z", "media-type": "News", "title": "Semtech (SMTC) Trading Near $17.29 Resistance Level", "id": "feef579d-73aa-493a-a34f-4d31ed05663f", "content": "(Marketintelligencecenter.com via COMTEX) -- \n\nAfter ThursdayaEUR(TM)s trading in Semtech Corp ( SMTC ) the algorithms behind MarketIntelligenceCenter.com's Artifical Intelligence Center picked out a trade that offers a 10.19% or 18.98% (for comparison purposes only), while providing 13.67% downside protection. The trade is a Mar. '16 covered call at the $16.00 level for a net debit of about $14.52. The net debit is also the breakeven point for this trade. Technical indicators for the stock have been bearish recently and support and resistance have been in the area of $16.29 and $17.29, respectively. \n\n(C) Copyright 2015, Marketintelligencecenter.com. All rights reserved. \n\nPlease read the End User Agreement. \n\nBy accessing this page, you agree to the terms and conditions of the End User Agreement. \n\nNews provided by COMTEX. \n\nFutures Market Sectors \n\nMajor Forex Currency Pairs \n\nResources for Traders \n\nAdvertise with Us | Contact Us \n\nMarket data is the property of the Exchange. \n\nMarket data is delayed at least 10 minutes. Access to this website and use of this market data is subject to the following: (a) Market data is for the recipients own personal use and may not be redistributed without permission of the Exchange, which may depend on execution of an agreement and payment of the applicable fee; (b) the Exchange and its licensors reserve all Intellectual Property Rights to market data; (c) the Exchange and TradingCharts disclaims all liability for market data and use thereof, and any and all losses, damages or claims arising from use of market data; (d) the Exchange and TradingCharts may suspend or terminate receipt of market data by any party if the Exchange or TradingCharts has reason to believe market data is being misused or misrepresented. It is also a condition of access to this website that you agree to not copy, disseminate, capture, reverse engineer or otherwise use information provided on this site for any other purpose except for the direct display in Internet browser of the end user only, and only in the format provided. These pages © TradingCharts.com, Inc. \n\nConcerned about privacy? See TradingCharts' Privacy Statement", "source": "TradingCharts.com"}