{"published": "2015-09-05T14:52:01Z", "media-type": "News", "title": "Toronto-Dominion Bank Receives $56.75 Average Target Price from Analysts (NYSE:TD)", "id": "7530c990-69a7-44d7-b6e8-821f41ac3a1f", "content": "Shares of Toronto-Dominion Bank (NYSE:TD) have been given an average recommendation of “Buy” by the eleven research firms that are currently  covering the firm, Market Beat Ratings reports . One equities research analyst  has rated the stock with a sell rating, three have assigned  a hold rating and six have given a buy rating to  the company. The average 1-year price target among brokers that have issued a report on the stock in the last year is $56.75. \n\nA number of research firms have recently issued reports on TD. Barclays  restated an “underweight” rating and set a $55.00 price objective (up from $53.00) on shares of Toronto-Dominion Bank in a research note on Monday, June 1st. Zacks downgraded shares of Toronto-Dominion Bank from a “buy” rating to a “hold” rating in a research report on Monday, June 1st. CIBC decreased their target price on shares of Toronto-Dominion Bank from $60.00 to $58.00 and set a “sector outperformer” rating for the company in a research report on Monday, August 17th. RBC Capital  reaffirmed an “outperform” rating and issued a $55.00 price target (down from $56.00) on shares of Toronto-Dominion Bank in a report on Monday, June 1st. Finally, Canaccord Genuity  restated a “hold” rating and set a $57.00 target price (up from $55.00) on shares of Toronto-Dominion Bank in a research note on Monday, June 1st. \n\nToronto-Dominion Bank ( NYSE:TD ) traded down 1.73% during midday trading on Wednesday, hitting $38.53. The company’s stock had a trading volume of 1,181,674 shares. The company has a market cap of $71.42 billion and a price-to-earnings ratio of 12.26. The company’s 50-day moving average is $39.68 and its 200 day moving average is $42.82. Toronto-Dominion Bank has a one year low of $35.93 and a one year high of $52.85. \n\nToronto-Dominion Bank (NYSE:TD) last posted its quarterly earnings results on Thursday, August 27th. The company reported $1.20 earnings per share (EPS) for the quarter, topping the analysts’ consensus estimate of $1.17 by $0.03. During the same quarter last year, the firm earned $1.15 earnings per share. The firm had revenue of $8.01 billion for the quarter. The company’s quarterly revenue was up 6.6% on a year-over-year basis.  On average, analysts predict that  Toronto-Dominion Bank will post $4.59 EPS for the current year. \n\nThe firm also recently declared a quarterly dividend, which will be paid on Friday, October 30th. Investors of record on Tuesday, October 6th will be issued a $0.3839 dividend. The ex-dividend date is Friday, October 2nd. This represents a $1.54 annualized dividend and a yield of 3.98%. \n\nThe Toronto-Dominion Bank and its subsidiaries are collectively known as TD Bank Group ( NYSE:TD ). TD offers a full range of financial products and services to approximately 22 million customers around the world through three key business lines: Canadian Retail including TD Canada Trust, TD Commercial Banking, TD Auto Finance (Canada), TD Wealth (Canada) and TD Insurance; U.S. Retail including TD Bank, America’s Most Convenient Bank, TD Auto Finance (U.S.), TD Wealth (U.S.) and TD’s investment in TD Ameritrade and Wholesale Banking including TD Securities. It has approximately 8.8 million active online and mobile customers.", "source": "WKRB News"}