{"published": "2015-09-07T20:00:47Z", "media-type": "News", "title": "Right back where he started, Chiefs’ Fisher moves to right tackle", "id": "cf7d6846-d9b1-4423-9ab5-ba50fccae7f1", "content": "The Chiefs’ ever-shuffling offensive line took another twist with Monday’s announcement that left tackle Eric Fisher, who missed most of the preseason with a high ankle sprain, would be return to action for Sunday’s opener at Houston. \n\nAnd start at another position. \n\nFisher will open at right tackle, Coach Andy Reid said. Donald Stephenson will start at left tackle. \n\nThe rest of the starting offensive line: Ben Grubbs at left guard, Mitch Morse at center and Laurent Duvernay-Tardif at right guard. \n\n“We’re going to play the five best, and Fish gives us a whole lot of flexibility, he can play any position on the offensive line, and play at Pro Bowl caliber,” Reid said. \n\nFisher, the NFL’s overall top selection in 2013, returns to the position he played as a rookie. Asked if it was disappointing that Fisher didn’t remain on the left side, Reid didn’t bite. \n\n“Did you hear what I just said?” Reid said. “I’m not going to answer that.” \n\nWith Fisher’s injury, Stephenson had played left tackle throughout the preseason. \n\n“I said, ‘Let’s just leave him there, it looks like he’s comfortable with that,’ ” Reid said. “He was more comfortable there than at right tackle. He had some ups and downs at that right tackle spot.” \n\nReid said the offensive line was constructed in groups by pairing Fisher with second-year pro Duvernay-Tardif, who will make his NFL debut on Sunday, and the two-time Pro Bowler Grubbs with Stevenson, who has 14 career starts. \n\n“The way it sets up, it works out perfectly,” Reid said. “I think Grubbs is tremendous for Donald and Fish is tremendous for (Duvernay-Tardif). It’s a good match there. \n\n“Fish knows the offense backwards and forward, Fish had it down, he’s a very smart kid this is his third year playing, and that’s great for Larry. \n\nGrubbs and Donald kind of hit it off. I like that chemistry there.” \n\nFisher injured his ankle and projected starting right guard Jeff Allen suffered a sprained knee. Neither played after the preseason opener. That’s when Stevenson moved to left tackle and Duvernay-Tardif started at right guard. \n\nThe starting offensive line had early struggles in the second preseason game, against the Seattle Seahawks, but played better in the third game against the Tennessee Titans. The starters didn’t see the field in the fourth preseason game, at St. Louis on Thursday. \n\nStevenson started three games at right tackle and four at left tackle in 2013 and worked at left tackle during the team’s organized activities in the spring. Reid said at the time he was just giving Stephenson reps there to help develop is versatility. \n\nBut Reid said Monday the left side is a better fit for Stephenson, who played at Blue Springs High and Oklahoma. \n\n“I think he’s more comfortable on the left side than the right side,” Reid said. “I thought Fish was having a phenomenal camp on the left side. This was something I had to think through. But with Fish’s injury, Donald gets in there and it became very evident he was more comfortable on that side than on the right side.” \n\nVersatility was a buzzword for Reid and general manager John Dorsey when discussing the offensive line. \n\nThe Chiefs moved Zach Fulton, who started at right guard last season, to center against the Rams. Fulton had never played the position in an organized game but by all accounts held his own. \n\nThe signing of tackle Jah Reid, cut by the Ravens on Saturday, also supports the Chiefs needs to be flexible. \n\n“He can play all four sports, not center, both tackles, both guards,” Dorsey said. \n\nThey’re about to face a Texans defense that features reigning NFL Defensive Player of the Year J.J. Watt, but Reid likes what the Chiefs will present. \n\n“I’m very comfortable with this group right now,” he said.", "source": "KansasCity.com"}