{"published": "2015-09-09T21:35:02Z", "media-type": "News", "title": "Hero BA pilot who landed burning Las Vegas jet had previous brush with death in devastating car crash", "id": "8f85c074-0f98-449b-9ec7-c98d8823d1e9", "content": "The left engine of the Boeing 777-200 burst into flames at McCarran International Airport, Las Vegas, forcing 157 passengers and 13 crew to evacuate through emergency slides The hero British Airways pilot who saved 170 lives by safely landing his burning plane narrowly escaped death in a sports car crash decades ago, it has emerged. The left engine of the Boeing 777-200 burst into flames at McCarran International Airport, Las Vegas, forcing 157 passengers and 13 crew to evacuate through emergency slides.\n\nCaptain Chris Henkey, a veteran pilot, was at the helm and calmly performed an emergency stop on on the runway.\n\nHis friend and fellow pilot Bruce Garner, 68, from Guildford, Surrey, revealed this was not Mr Henkey's only brush with death.\n\n\"Chris and I were good friends when I lived in Wokingham. He's an all-round good guy. I remember how he survived the road crash, he was in an MG Midget, I think,' he said.\n\n\"He was quite badly disfigured but after a long period away he was fully recovered to fly again. It was one of the reasons he let his hair grow longer.\" Read more: Terrifying: A British Airways passenger jet is shown after a fire at McCarran International Airport in Las Vegas Earlier today, his daughter Charley revealed it was to be one of his last flights after 42 years of flying and spoke of her terror upon hearing about the blast.\n\nThe 26-year-old told the Reading Chronicle she was \"extremely emotional\" after her father texted her that there had been a \"massive explosion\".\n\nShe said: “I was just heading out to dinner with my best friend when I got a text from Dad saying there had been a massive explosion on the plane but that he was OK.\n\n@airlivenet/Twitter Aftermath: This picture shows the extent of the damage \"This was supposed to be one of his last flights.\n\n\"I just hope he gets to fly again before he retires so that he ends on a high.\n\nVideo loading Watch next Watch this video again Watch Next Las Vegas airport released a statement which said it was first alerted to the emergency at 4.13pm local time (12.13am BST) and within five minutes everyone was off the plane and the blaze had been extinguished.\n\nFire officials said at least 14 people were taken to hospital with minor injuries, mostly caused by them sliding down the inflatable chutes to escape.\n\nBrave: The pilot showed incredible skill and calmness Federal Aviation Administration spokesman Ian Gregor said the plane's left engine caught fire.\n\nAn airport spokeswoman said: \"All passengers were evacuated quickly and safely and taken by bus to the terminal.\n\n\"We cannot express enough gratitude to the emergency response crews, as well as the British Airways crew.\" VIEW GALLERY", "source": "Mirror.co.uk"}