{"published": "2015-09-30T05:50:06Z", "media-type": "Blog", "title": "Wasim Akram: Cricket and Beyond Conversation in Dubai", "id": "bee0dab9-3d24-481a-a59a-3ec62bebec26", "content": "United Sports Associates, the global sports, event and talent management company,today announced the launch of ‘Cricket and Beyond – Join the Conversation’, a series of unique celebrity talk show events. The inaugural event will be held in Dubai on 9 October at the sublime Rixos The Palm. \n \nThe event will feature some of the greatest cricketers of all time, Sachin Tendulkar and Wasim Akram. Cricket commentator and journalist Harsha Bhogle will moderate the talk show. \n \n\n \nRaj Ramakrishnan, Managing Director, United Sports Associates, said: ” ‘Cricket and Beyond’ will feature conversations around cricket, magic moments and the life experiences of our sporting heroes. The show will feature state-of- the-art analytical technology presented in an interactive and entertaining fashion providing its physical and online audience with a once in a lifetime event.” \n \nHe added: “Dubai has been chosen as the venue for the launch event for its increasing importance in the sporting landscape, its luxurious environment and its recent history in hosting some epic cricketing battles. We welcome you to ‘join the conversation’.” \n \nThis global series of events will see future shows in New York, Melbourne and London. Cricketing legend Sachin Tendulkar will be joined on stage in these various locations by international cricketing superstars and celebrities such as Wasim Akram, Shane Warne and Brian Lara. \n \nAs part of the ‘Cricket and Beyond’ launch event in Dubai, Sachin Tendulkar and Wasim Akram will meet the public at Arabian Center mall on 9 October at 2 pm. Two winners will be selected from the public and each will receive an invitation to attend the prestigious event. \n \nFor further information please visit the event website . \n \nCourtesy: KHALEEJ TIMES", "source": "Wasim Akram Official Website"}