{"published": "2015-09-15T14:42:49Z", "media-type": "News", "title": "Arsenal's Jack Wilshere to undergo surgery on leg fracture", "id": "b37d9997-12cb-4d7e-a25c-9b5aa37d660b", "content": "Arsenal midfielder Jack Wilshere will require surgery to fix a hairline fracture in his left leg and is set to be out for around three months, the Barclays Premier League club announced on Tuesday. \n \r\n\t\t\r \nManager Arsene Wenger last week revealed the England international had suffered a \"little setback\" in his scheduled recovery from the injury sustained in pre-season. \n\r  Arsenal's Jack Wilshere is set for several weeks of rehabilitation following surgery \r \r \nFollowing further medical examinations, the decision has now been taken that an operation is needed to properly correct the problem and is likely to take place in the next few days. \n\r\n\t\t\t\r \nA statement from Arsenal read: \" Due to a slow healing response from a fracture suffered in August, the club can confirm that Jack Wilshere is to undergo an operation to his left fibula. \n\r\n\r\n\r\n\r \n\"The decision to intervene has been taken quickly after regular reviews by specialists, who feel that Jack's scans show that the healing process is not progressing as well as expected. \n\n\"Jack will have surgery in London in the forthcoming days. This will involve inserting a small plate in his left fibula. Jack is likely to be out for approximately three months. \n\n\"Everyone at the club wishes Jack well with his rehabilitation.\" \n\nThe news will come as a blow to both the player, who has battled through a  string of fitness issues in recent seasons, and club, with forward Danny Welbeck  also set for an extended spell on the sidelines until at least Christmas  following knee surgery. \n\r\n\t\t\t\r \nArsenal travel to Croatia for their Champions League opener against Dinamo  Zagreb on the back of a 2-0 home win over Stoke which sustained their recovery  in the Barclays Premier League. \n\nForward Theo Walcott, who once netted a hat-trick playing for England at the  Maksimir Stadium, is pressing for another start after scoring the opening goal  against the Potters on Saturday. \n\nDefender Per Mertesacker is not expected to be involved having just recovered  from a virus and also being involved in a minor road traffic accident on Monday. \n\n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Burnley Express"}