{"published": "2015-09-08T20:37:49Z", "media-type": "News", "title": "Amazing; conveyed shrimps complete with heads!", "id": "137b7a58-83b0-4469-ac9c-9aed97689ba9", "content": "Because it’s still a relatively new concept, the on-site product trial is something that Geneston, France based, Liftvrac and their UK and Ireland distributor, Genesis Process Solutions is always prepared to look at. But when the request to look at a trial involving the handling of shrimps was received it did cause a few furrowed brows. \n\nCooked shrimps are extremely delicate and they need very careful handling. The process packaging company had won the order but their current machinery was unable to handle this tricky crustacean without feelers getting caught in a mesh or joint which left the shrimp hanging on the belt and finally falling on to the floor when the shrimp parted company with its feeler – which left the feeler stuck in the belt. In some cases, it wasn’t just a lost feeler; heads or tails could remain in the belt. In a business as dependant on appearance as it is on product quality, decapitated shrimps presented a problem that needed urgent solving. The packaging contractor searched on-line and found Liftvrac. \n\nThe Liftvrac conveying system is a revolutionary form of belt conveyor which is ideal for handling sticky or delicate products like shrimps. It is easy to clean and maintain and is extremely economic in terms of energy consumption. The key component is a polyurethane belt which forms a tube around the product and carries it the entire length of the elevation. A lip system effectively seals the tube and holds the product in place until it’s discharged at the end of the line. Fish, cheese, pasta, meat, plastics and a huge range of other products can be conveyed without any fear of blockages or clogging thanks to a scraper located at the discharge end of the belt. The entire system can be dismantled, cleaned and reassembled in around twenty minutes – ideal if different products are going to be conveyed. \n\n. \n\nNeedless to say, the shrimp test was a complete success. The smooth tube-shaped conveying belt delivered the shrimps into the weigher in the same state prior to conveying and after an extensive test it was found that product wastage from conveying was practically zero as opposed to around 2% with the packaging contractors existing system. ", "source": "Food Processing"}