{"published": "2015-09-22T01:57:45Z", "media-type": "News", "title": "Why Malcolm Turnbull's neighbours are glad he is not moving to Kirribilli House", "id": "fd58e81a-0fef-430f-94c4-f99fc08dd947", "content": "It is hardly humble, or peaceful, but it is home for Malcolm Turnbull. Inside Malcolm Turnbull's Point Piper pad It is hardly humble, or peaceful, but it is home for Malcolm Turnbull. The new Prime Minister says he will not be moving to Kirribilli House, but is staying put at his red-clay-coloured home in Point Piper, with its own fetching harbour views.\n\nTwo days after his swearing in ceremony last Monday, a big yellow crane appeared behind his house for building work at a neighbouring property.\n\nThere are at least five major construction and renovation projects underway in the neighbourhood, which comes to life in the early morning hours with the arrival of tradesmen in orange tops and fluorescent green socks tucked inside work boots.\n\nThe constant hum of the towering crane that swings large skips full of boulders precariously close to the Turnbull rooftop is punctuated by loud beeping and a cacophony of roaring saws, drills and cement mixers.\n\nTwo Australian Federal Police officers sit quietly inside a grey car parked outside the residence. But they have not gone unnoticed by neighbours, who have few complaints about the heightened security presence.\n\nBernice Belnick welcomed her neighbour's decision to stay.\n\n\"I've been boasting I've got a PM in my street,\" she says. \"I'm happy for him to stay.\"\n\nAnother neighbour who did not wish to be named, said: \"He's got a great house. It's close to the city. Why should he move?\"\n\n\"I think it's important that they live normally. We often see Lucy [Turnbull] walking the dogs in the morning.\"\n\nFurther down the road, where white-washed walls are draped in red bougainvillea and black Porche Boxters sit in driveways, Caryl Heilig and Belinda Goldman take time out of their morning walk to share their approval.\n\n\"I have no problem with Malcolm staying in the area,\" Ms Goldman said. \"It think that it's great he has chosen to stay in his home. We are very happy that he'll be part of the Eastern Suburbs where we live.\"\n\nMs Heilig agreed it was \"fantastic\" the Turnbulls had decided to stay in the area.\n\n\"They may just put a bit more security around the house for him,\" she said.\n\nJennifer Coyle, who moved from the US to a nearby house two months ago, said she was surprised a Prime Minister would live in the local neighbourhood.\n\n\"But we find it very refreshing that he has decided to stay in the local community,\" she said.\n\nThe police presence makes her feel a bit safer in the home, \"but it is also a little disconcerting that they are around the corner 24/7\".\n\nMs Coyle, who works for Macquarie Bank, said she could not imagine an American president living in her street.\n\n\"I think they would be so frightened for their security that they would be out of the limelight as much as possible,\" she said.\n\n\"It's really nice to see he [Turnbull] is out in the open. We saw him walking in the neighbourhood over the weekend. So it's really good to see he's part of the people.\"\n\nAndrew Muston, who has lived in the area for 23 years, said it was clear to him why Mr Turnbull wanted to stay.\n\n\"I don't know why he would want to leave. It's a pretty nice set up that he's got.\"\n\nMr Muston, who graduated from the University of Sydney last year with an economics and finance degree, jokes that the decision poses one problem.\n\n\"The only issue is we have a couple of house parties, so I was hoping that maybe he might move away and there would be no more noise complaints,\" he said.\n\n\"No, he's a good neighbour. I've lived next to him my whole life. He's a good man.\"\n\nWhen in Canberra, Mr Turnbull will live at The Lodge, which has undergone $6.4 million worth of renovations. The work is expected to be completed by the end of the year.\n\nFollow us on Twitter The story first appeared on The Sydney Morning Herald.", "source": "Eastern Riverina Chronicle"}