{"published": "2015-09-16T16:24:49Z", "media-type": "News", "title": "Island Roads volunteers dig deeper into Northwood House mystery", "id": "40da849c-6b52-44bd-a6b2-ce907a885379", "content": "Northwood House, where Island Roads volunteers have helped uncover a secret tunnel. Picture by Robin Crossley. GROUND penetrating radar is helping to unlock the secrets of historic Northwood House, Cowes, helping rediscover the route of a hidden tunnel that runs from the building to the Nunnery Steps park entrance on Baring Road.\n\nThe location, destination and purpose of tunnels have long been the subject of conjecture and now the Northwood House Charitable Trust Company Ltd is being helped by PFI contractor Island Roads to shed light on the suspected subterranean network.\n\nOver the years, it has been suggested the tunnels were used for anything from smuggling to escaping French invaders, or even allowing high profile historic figures including royalty to secretly attend lavish parties at Northwood House.\n\nThe charity is hoping the new investigation by Island Roads can separate the myth from reality.\n\nIsland Roads utility surveyor, Andrew Tunnicliff, undertook the initial survey of the house and grounds using the ground penetrating radar equipment, traditionally used to locate underground services.\n\nThe work was done under Island Roads’ volunteering programme in which staff are given two days paid leave annually in order to lend a helping hand to good causes.\n\nIn addition to tracing the route of the 200 metre tunnel, Andrew defined the boundaries of a former Roman Catholic church built in the grounds in the early 1900s for a group of Benedictine Nuns.\n\nIsland Roads offered to help with the charity’s research after Andrew read about the building’s secret past in a new history of the house by Tim Wander.\n\nTim said: \"There has been so much folklore built up around the tunnels, their locations and their uses and we are really grateful to Island Roads for helping to discover some hard facts.\n\n\"I look forward to continuing to work with Island Roads on the other side of the house to establish if there are tunnels that might lead to the Ice House, church, air raid shelter or indeed, the recently discovered game larder that was part of the original Bellevue House estate from the 1760s.\" \n\nReporter: davidn@iwcpmail.co.uk", "source": "Isle of Wight County Press"}