{"published": "2015-09-28T18:05:56Z", "media-type": "Blog", "title": "Patrizia expands into logistics, hiring Amsterdam team", "id": "a067ad13-ac3d-481a-8f7e-53607e7e4235", "content": "Get your PIE\nRegister now for PIE Dailies or Subscribe now to PIE PREMIUM. PIE DIGITAL JUNE 2015\nRSS Feed\n»Always receive the latest headlines and events from Property Investor Europe.\rPIE Events\nFRANCE PROPERTY BREAKFAST\n21 October 2015\nCity of LondonLOGISTICS PROPERTY BREAKFAST\n29 October 2015\nCity of LondonGERMAN RESIDENTIAL PROPERTY BREAKFAST\n03 November 2015\nBerlin, GermanySPAIN PROPERTY BREAKFAST\n04 November 2015\nCity of LondonGERMANY PROPERTY BREAKFAST\n26 November 2015\nCity of London Upcoming Events\nMore upcoming PIE events will be published soon. Need more information?\nPlease contact us!\r \nProperty Investor Europe News Patrizia expands into logistics, hiring Amsterdam team\n28 September 2015, 08:05 PM\nGerman listed property group Patrizia has established a new division for Europe-wide logistics property based in the Dutch capital Amsterdam. It said the move was inspired by the dynamic expansion of online shopping.\nRead more... log in or subscribe for free PIE Dailies or PIE PREMIUM Similar articles:German Palmira teams with Spain's Kefren in Spanish logisticsGerman retail defies European cycle - PatriziaGerman Patrizia at €600m in Denmark, adding €270m investmentsGerman Patrizia completes acquisition of UK’s Tamar CapitalPEPR, deleveraging, sells €72m Polish, German logisticsUSAA seals debut European property deal with Utrecht logisticsDutch newco Geneba in €584m buy from Canada's insolvent HomburgGerman Patrizia buys €4.3bn in 2013, doubles equity raiseAFI unveils €50m mall in Romanian Ploiesti, first outside BucharestNon-prime core Europe property is best investment – IVG\nFor more Property Investor Europe news, click thru to our News archive.   Property Investor EuropeThe leading source of European real estate investment intelligence for professionals.\nContinental European real estate finance for US & international investors.Real estate investment strategies/players in Europe, ex UKProperty conferencesEuropean REITsFrench SIICSItalian SIIQsDutch FBIsLuxembourg SICAVsListed real estateUnlisted property fundsReal estate asset managementResidential propertyProperty associations INREV, EPRA, FSIFReal estate banking, debt financingEuropean property reports/studiesEmerging Eastern Europe real estate investmentDeals /transactionsNon-performing loansInstitutional commercial property investmentFrench office, CBD La DéfenseGerman officeMortgage securitisationCMBSRMBSListed property stocksSpecial fundsOPCIs, SPCIsMortgage servicingUS/global capital flows into EuropePfandbriefe-covered bonds\nHomeSubscribeNewsArchiveRSSImprintContact", "source": "Property Investor Europe News"}