{"published": "2015-09-28T21:21:55Z", "media-type": "News", "title": "West Brom 2 Everton 3: Lukaku inspires superb second-half fightback", "id": "d43f649f-e166-4da1-90ba-926818716d86", "content": ":56 \n   \nRomelu Lukaku came back to haunt West Brom as he inspired a stunning second-half comeback from Everton in a 3-2 Premier League win at The Hawthorns on Monday. \n \nRoberto Martinez's side appeared to be heading for defeat after seeing West Brom take a 2-0 lead early in the second half through Craig Dawson's header. \n \nStriker Saido Berahino had broken the deadlock in the 41st minute with his second goal in three games since ending his exile from the West Brom team after failing to force a move to Tottenham. \n \nWest Brom's advantage was doubled nine minutes after the restart courtesy of Dawson, and that looked to have put them on the verge of a third win in four Premier League matches. \n \nHowever, Lukaku - who spent a season on loan at The Hawthorns in 2012-13 - pulled one back just a minute later before playing in substitute Arouna Kone to fire home a 75th-minute equaliser from close range. \n \nAnd the turnaround was completed six minutes from time when Lukaku tapped home Gerard Deulofeu's cross at the second attempt to send Everton up to fifth in the table ahead of next Sunday's Merseyside derby. \n \nA low-key opening 25 minutes was followed by a setback for West Brom when centre-back Jonas Olsson - who replaced Gareth McAuley in the starting XI - limped off with an injury, with James Chester taking his spot in the backline. \n \nThe contest finally sprung into life late in the first half when Berahino capitalised on some dreadful Everton defending to open the scoring. \n \nRamon Funes Mori and Gareth Barry combined to surrender possession in midfield, and James Morrison then threaded a perfectly placed pass into the path of Berahino to finish past Tim Howard. \n \nJames McClean fired over from the edge of the area at the end of a quick West Brom counter three minutes after the restart before Howard did well to keep out Darren Fletcher's far-post header. \n \nBut from the resulting corner Everton paid the price for more sloppy defending, Dawson losing his marker and meeting Chris Brunt's delivery with a header that went down into the ground and beyond a stricken Howard. \n \nEverton responded instantly, though, as Lukaku rose high above Chester and turned a pinpoint right-wing cross from Deulofeu beyond the diving Boaz Myhill. \n \nMartinez's men struggled to craft opportunities to level the scores, but the introduction of Kone - brought on for Steven Naismith - proved pivotal. The Ivory Coast international sprung the offside trap and lashed a strike into the bottom-left corner. \n \nAnd there was to be one final twist in the tale, which came as Lukaku latched on to another fine Deulofeu delivery, following up a heavy first touch by squeaking the ball in at the near post to complete an impressive fightback.", "source": "SoccerWay.com"}