{"published": "2015-09-01T14:11:05Z", "media-type": "News", "title": "StarMobile Announces Mobilization Solutions For SAP and Oracle Applications", "id": "4bb8fcde-23fa-4e08-a759-ac4f8e1d39aa", "content": "PRWeb \nStarMobile(R), Inc. , the leading codeless, cloud-based platform that delivers enterprise mobility faster, simpler and at a lower cost than any other solution on the planet, today announced their solution for mobilizing SAP and Oracle applications at VMworld(R) 2015 US . \n\nSAP and Oracle customers have unique challenges when trying to extend their systems to users on mobile devices. SAP Fiori requires significant upgrades to an exacting \"stack\" of SAP platform and application modules, including the implementation of SAP HANA. The Oracle Mobile Platform requires an arduous migration to Oracle Fusion architecture, middleware and applications. Both are based upon HTML5, which has renowned constraints in performance and user experience. Further, if you want to use their portfolio apps, you must modify them at the source code level to reflect the customizations you have made to their back-end applications. \n   \nStarMobile radically simplifies enterprise mobility by dynamically transforming any packaged on-premises (e.g., SAP, Oracle, Microsoft, IBM, Infor, etc.) or cloud-based application (e.g., Salesforce, Workday, etc.), or custom-built system (including legacy \"green-screen\" applications), and any workflow into a mobile app with a native user experience. Therein, StarMobile leverages the enterprise's existing investments in applications, workflows, infrastructure, data, and security without having to \"re-create\" them on each mobile device platform. StarMobile also provides the means to develop net new \"mobile first\" apps by connecting with APIs, data connectors, SQL, web services and mBaaS. \n\n\"SAP and Oracle have effectively abandoned their installed customers by using mobility as a means to force time consuming, complex and expensive upgrades upon them,\" said StarMobile President and CEO Todd Fryburger. \"StarMobile eliminates the need for such vendor-imposed upgrades. We allow SAP and Oracle customers to dynamically transform any application, without changes, for use on any endpoint, with a native user experience and integration with native device features. For about the cost of one cup of coffee per user per month, StarMobile provides the means for SAP and Oracle customers to mobilize their applications with speed, simplicity and economy that no other solution in the industry offers today.\" \n\nStarMobile customers, such as global consumer packaged goods company Mondelēz International , use the StarMobile platform to create and deploy purpose-built mobile apps that leverage their existing SAP and Oracle applications. \n\n\"The StarMobile platform has enabled Mondelēz to transform our existing investments in the systems and processes we use to run our business for use on mobile devices,\" said Carl Van Dusen, global head of mobility and integration at Mondelēz International.  \"Anytime, anywhere access is essential to empowering our mobile workforce, and StarMobile allows us to deliver enterprise mobility quickly, simply and cost effectively.\" \n\nStarMobile was recently named a \"Cool Vendor in Mobile App Development, 2015″ by Gartner and an Emerging Vendor by CRN. To schedule one-on-one meetings with the StarMobile executive team or to see a live demonstration of the StarMobile platform at VMworld 2015 US, contact kristen@starmobileinc.com or visit booth #1637. \n\nAbout StarMobile \nStarMobile is a codeless, cloud-based solution that delivers any application to any endpoint, with a native user experience, faster, simpler and at a lower cost than any other approach. Companies use StarMobile to dynamically transform any packaged on-premises or cloud-based application, or custom-built system, into a mobile app. StarMobile requires no changes to existing applications, no coding, no need for exotic skills or learning a new platform, no professional services, no re-building, simple configuration, low maintenance, no re-licensing, no app-specific downloads, with infinite scalability, end to end security, centralized mobile app management and provisioning, and detailed usage statistics, for any application, any use case, any endpoint, on any public, private or enterprise cloud platform. http://www.starmobileinc.com \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12936382.htm \nPRWeb.com", "source": "Town Hall"}