{"published": "2015-09-18T01:44:46Z", "media-type": "News", "title": "City Moves for 18 September 2015 | Who’s switching jobs", "id": "ae0a8c9d-683b-48a0-8d2d-49c41f0bb9e3", "content": "BNP PARIBAS INVESTMENT PARTNERS \nThe asset manager has announced several appointments to its institutional business. Guy Williams becomes chief investment officer. He was formerly chief investment officer of the firm’s global fixed income affiliate Fischer, Francis, Trees & Watts (FFTW) Daniel Morris joins Williams’s team as senior investment strategist and Richard Barwell (pictured) joins as senior economist. Morris previously worked at TIAA-CREF Asset Management, and Barwell arrives from RBS . \nGOODACRE UK \nAngela Knight has been appointed associate at the regulated investment industry consultancy. She is currently a board member for TfL and a senior independent director at Brewin Dolphin and Tullet Prebon. Knight has also previously worked as chief executive of Energy UK, chief executive of the BBA, and is a former economic secretary to the Treasury. \nFAEGRE BAKER DANIELS \nCostanza Russo has been appointed partner in the law firm’s corporate team in London. She previously worked at Winston & Strawn, where she focused her practice on cross-border project and infrastructure finance. Russo has particular experience working with Eastern European clients. \nITG \nThe execution-only broker and research provider has appointed Bret Goldin as director, Americas sales. He previously ran Morgan Stanley’s electronic trading business in Canada. Goldin began his career in New York as a Nasdaq market maker with Herzog, Heine, Geduld/Merrill Lynch in 1997, and has also held positions at Reuters and then Bank of America Securities, where he was head of sell-side sales and product. \nOLD MUTUAL GLOBAL INVESTORS \nThe asset manager has appointed Oliver Lee as investment director for Asian equities. He joins from Schroder Investment Management, where he worked in its alternative strategies group. Lee has also previously held positions at Sloane Robinson, Goldman Sachs and UBS. \nTRAINLINE \nThe train travel app has appointed Jonathon Moore as chief product officer. He joins from taxi app Hailo, where he was chief product officer for two years. Moore has 12 years’ experience, and has also held product development roles at Microsoft , Skype and the Guardian Media Group. \n\nTo appear in City Moves please email your career updates and pictures to citymoves@cityam.com \n\nSign up to receive the new City Moves morning update if you haven't already.", "source": "City A.M."}