{"published": "2015-09-09T12:57:07Z", "media-type": "News", "title": "Wall St. set to open higher on Chinese stimulus hopes", "id": "e544da29-cec3-4851-9d3e-a9c963be465a", "content": "By Tanya Agrawal \n \n(Reuters) - Wall Street was set to open higher on Wednesday as positive comments from Chinese officials kept alive hopes of further stimulus measures. \n \nChina's Ministry of Finance said the government will strengthen fiscal policy, boost infrastructure spending and speed up reform of its tax system, adding to other steps to reenergize sputtering growth. \n \nThe Shanghai Composite (.SSEC) closed 2.3 percent higher and the CSI 300 index  rose 1.96 percent while Hong Kong's Hang Seng (.HSI) was up 4.5 percent. \n \nAdding to the positive sentiment, Japan's Nikkei 225 (.N225) stock index rose 7.7 percent, the most it has risen in a day since the depths of the global financial crisis in October 2008, as Prime Minister Shinzo Abe signaled that the country will cut corporate taxes. \n \n\"The fear factors regarding China and the Fed is easing somewhat and that is key,\" said Peter Cardillo, chief market economist at Rockwell Global Capital in New York. \n \n\"We're also seeing some of the money that was on the sidelines following the recent volatility, come back into the market.\" \n \nS&P 500 e-minis (ESc1) were up 19.25 points, or 0.98 percent, with 261,415 contracts traded at 8:39 a.m. ET. Nasdaq 100 e-minis (NQc1) were up 51 points, or 1.19 percent, on volume of 39,401 contracts. Dow e-minis (1YMc1) were up 179 points, or 1.09 percent, with 34,638 contracts changing hands. \n \nU.S. stocks closed up more than 2 percent on Tuesday, bouncing after steep losses last week. \n \nThe stock market gains were sparked by a rally in Chinese shares on Tuesday, when weaker-than-expected August trade reinforced investors' expectations that Beijing would act to bolster slowing growth in the world's second-largest economy. \n \nInvestors will also keep an eye on data scheduled to be released later on Wednesday, including job openings and labor turnover numbers for July at 10 a.m. ET. Job openings, a measure of labor demand, are likely to have risen to 5.288 million in July from 5.249 million in the prior month. \n \nSome investors have argued that the recent market volatility will force the U.S. Federal Reserve to wait until the year-end to raise long-term interest rates. \n \nApple (AAPL.O) shares were up 1.2 percent at $113.63 premarket. The iPhone maker is expected to unveil new offerings at its annual conference. \n \nYahoo (YHOO.O) was down 1.6 percent at $30.40, a day after the U.S. Internal Revenue Service denied its request for a private letter ruling on a possible tax-free deal related to the spinoff of its stake in Alibaba (BABA.N). Alibaba was up 2.2 percent at $62.25. \n \nTetraphase Pharmaceuticals  (TTPH.O) sank 78.63 percent to $9.52 after its experimental bowel drug failed to meet the main goal in a late-stage study. \n \n \n(Editing by Don Sebastian)", "source": "Yahoo! UK and Ireland"}