{"published": "2015-09-14T13:39:31Z", "media-type": "News", "title": "Record sales for Poundworld", "id": "db785e2d-929b-4bb4-b4fa-65fca5813a80", "content": "UK-based discount chain Poundworld posted record annual sales today. \n\n\n\nThe company said that it plans to continue its rapid expansion by opening 60 new stores a year from next year. \n\nThe UK’s second-largest single price discount retailer, behind Poundland, said sales jumped 22% to £422.3m in the 12 months to the end of March in a period when it opened 38 stores, with like-for-like sales up 5.6%. \n\nThe group added that operating profits also hit a record, more than doubling by 130% to £14.6m. \n\nUS buyout group TPG took a majority stake in the business for £150m in May, in a deal which saw founder and chief executive Chris Edwards become a multimillionaire. \n\nMr Edwards founded the business from a market stall in Wakefield in 1974. \n\nPoundworld said as a result of new funding from TPG it will accelerate its store expansion programme to in excess of 60 stores a year from 2016 onwards. \n\nMr Edwards said: “We have seen a record financial year and one of landmark progress for the company.” \n\nHe added that he expected “the year ahead to be one of development and consolidation.” \n\nMr Edwards said the firm would invest in a new 500,000 square foot warehouse next to its Normanton head office in West Yorkshire, and replace its IT ordering systems. \n\nHe said these changes “will provide a strong platform for rapid growth over the next three years.” \n\nThe group added that its multi-price discount chain Bargain Buy, which trades from more than 50 outlets, saw like-for-like sales lift by 8% over the year. \n\nLarger rival Poundland, which owns around 500 stores, is in the middle of a £55m acquisition of rival 99p Stores. \n\nThe takeover was last month provisionally cleared by the UK's Competition and Markets Authority.", "source": "Breaking News.ie"}