{"published": "2015-09-17T14:26:05Z", "media-type": "News", "title": "Provision Interactive Announces Major Kiosk Shipment Milestone", "id": "a6dc985f-15b1-4bca-9c00-ca69afad4262", "content": "CHATSWORTH, Calif., Sept. 17, 2015 (GLOBE NEWSWIRE) -- Provision Interactive Technologies, Inc. (\"Provision\"), a subsidiary of Provision Holding, Inc. (OTC Pink:PVHO) announced today, that it has shipped more than 100 3D Savings Center kiosks to its retail partner. These first kiosks are being installed in New York and Los Angeles retail locations. Provision's 3D Savings Center Kiosks generate eye-popping, three dimensional, holographic videos and will include exclusive loyalty card information and promotions. \n\nUpon installation, the kiosks will be integrated with the retailer's customer loyalty program. This will allow the retailer's customers to access their account details and load digital coupons to their cards for instant savings at kiosks while in these select stores. \n   \nThe 3D Savings Center kiosk contains Provision's patented and award-winning 3D holographic display, which has been proven to generate a great deal of attention from retail customers. Each unit also has a 2D interactive touch screen that provides consumers access to loyalty card information as well as promotions, rewards, and coupons.  Brand marketers will be able to showcase their products via 3D advertising and engage viewers via the interactive touch screen interface. \n\nThe kiosks are also able to print coupon offers, allowing the retailer and other advertisers to offer customers highly effective sales influencers at the point of purchase. The 3D holographic display projects videos in front of the screen without the need for any special glasses and without any discomforting eye stress.  \n\n\"We are very excited about the first 100 stores in New York and Los Angeles\" commented Curt Thornton, President & CEO of Provision. \"Stakeholders have waited a long time for us to be in stores. This is the beginning of the next great chapter of the company.\"    \n\nAbout Provision Interactive Technologies, Inc. \n\nProvision Interactive Technologies, Inc., a subsidiary of the publicly traded company Provision Holding, Inc. (OTC Pink:PVHO), is the leading purveyor of intelligent interactive 3D holographic display technologies, software, and integrated solutions for both commercial and consumer focused applications. \n\nProvision's 3D holographic display systems represent a revolutionary technology that provides the projection of full color, high-resolution videos into space detached from the screen, without any special glasses. Provision is currently the market leader in true 3D consumer advertising display products being implemented by innovative, consumer-focused companies. \n\nForward-Looking Statements \n\nThis press release contains projections of future results and other forward-looking statements that involve a number of risks and uncertainties. Important factors that may cause actual results and outcomes to differ materially from those contained in the projections and forward-looking statements included in this press release are described in our publicly filed reports. Factors that could cause these differences include, but are not limited to, the acceptance of our products, lack of revenue growth, failure to realize profitability, inability to raise capital and market conditions that negatively affect the market price of our common stock. The Company disclaims any responsibility to update any forward-looking statements unless legally required. \n\nFor more information, visit www.provision.tv . \nCONTACT: Media Relations: The Lexicomm Group\n         Wendi Tush\n         Phone : (212) 794-4531\n         Email : Wendi@lexicommgroup.com", "source": "SearchBug"}