{"published": "2015-09-18T08:09:25Z", "media-type": "News", "title": "Monheit Frisch Group: The CFO for your Family", "id": "9a0e03e1-d1b4-4a62-b564-cadabf99f537", "content": "PRWeb \nUnder the umbrella of Monheit Frisch Group PLC and now under one roof,  the organization has two distinct businesses:  Monheit Zongolowicz Frisch CPAs PLC, a full-service accounting and consulting firm; and Monheit Frisch Wealth Management LLC, which offers comprehensive financial planning and wealth management. As a multigenerational firm, Monheit Frisch Group PLC brings decades of experience, stability and wisdom to its clients, providing advice, insight and planning. \n\n\"We take the time to fully explain your options and the logic behind our recommendations,\" said David Monheit, a partner at Monheit Frisch Group . \"Many people who manage their own financial matters use multiple advisors; one for tax and accounting and another for investments and insurance solutions. Our approach is different. We work as a holistic firm that focuses on performing as your personal Chief Financial Officer (CFO).  We believe this approach provides the best platform to increase the chances of attaining your personal and family financial goals.\" \n   \nThe company's responsibility as a client's CFO is to know one's family, personal situation and all investment objectives, and to keep their clients on track toward their present and future goals, always carefully determining how financial decisions will impact taxes, financial and estate plans. \n\n\"When your tax and wealth management come from one command center (your personal CFO) and a team of professionals working toward your vision, you are potentially much closer to improving your after-tax income, reducing your exposure to estate tax, and realizing your financial and lifestyle goals,\" said partner Gary Frisch. \n\nAbout Monheit Frisch Group PLC \nMonheit Frisch Group PLC was originally established in 1972 as a sole-proprietor individual, estate, trust and small-business tax preparation and consulting firm. They have been serving the West Valley community ever since and are proud supporters of Benevilla , which provides extensive support services for older adults, adults with disabilities, children and the families who care for them. Recently, the Monheit Frisch Group PLC relocated to one office at 12455 West Bell Road, Surprise, AZ 85378. For more information or a complementary review of your financial situation, please call (623) 975-7586. \n\nSecurities offered through 1st Global Capital Corp., Member FINRA/SIPC. Investment advisory services offered through 1st Global Advisors, Inc. \n\nAbout the NALA™ \nThe NALA offers local business owners new online advertising & small business marketing tools, great business benefits, education and money-saving programs, as well as a charity program. For media inquiries, please call 805.650.6121, ext. 361. \n\nRead the full story at http://www.prweb.com/releases/MonheitFrischGroup/TheCFOforyourFamily/prweb12969416.htm \nPRWeb.com", "source": "RCL Advisors"}