{"published": "2015-09-30T11:31:07Z", "media-type": "News", "title": "CES Synergies : Awarded Contract for Demolition on Proposed Townhome Project", "id": "df4a29ac-22d8-42ba-9828-d3dff2c4fc23", "content": "/PRNewswire/ -- \n \nCES Synergies, Inc. (OTC:CESX) (\"CES\" or the \"Company\"), a full service environmental,\nasbestos abatement and demolition company, announced today that its subsidiary, Cross\nEnvironmental Services, Inc., was awarded a contract for site demolition as part of a\nproposed townhouse project in South Tampa, Florida.  The work will be complete demolition\nof two existing metal and concrete structures with a combined 14,200 square feet and\nremoval of other site infrastructure. The former commercial site is being cleared for\nfuture development as a townhouse community in the rapidly-developing South Tampa real\nestate market.   \n \nJohn Tostanoski, CEO of CES Synergies, commented, \"As the real estate market continues\nto rebound, we are seeing more demolition contracts which we are actively bidding on. CES\nis excited to be a part of the development continuing throughout the Central Florida\nMarket.\" \n \nAbout CES Synergies Inc.  \n \nCES Synergies, Inc., through its subsidiary, Cross Environmental Services, Inc., is a\nspecialty environmental services company providing quality environmental contracting\nsolutions, demolition and remediation services to commercial and industrial customers, as\nwell as federal, state and municipal entities. More information may be found at the\nCompany's website: http://www.crossenv.com. \n \nSAFE HARBOR STATEMENT: This press release may contain \"forward-looking statements\"\nthat are made pursuant to the \"safe harbor\" provisions as defined within the Private\nSecurities Litigation Reform Act of 1995. Forward-looking statements may be identified by\nwords including \"anticipates,\" \"believes,\" \"intends,\" \"estimates,\" and similar\nexpressions. These statements are based upon management's current expectations as of the\ndate of this press release. Such forward-looking statements may include statements\nregarding the Company's future financial performance or results of operations, including\nexpected revenue growth, cash flow growth, future expenses and other future or expected\nperformances. The Company cautions readers there may be events in the future that the\nCompany is not able to accurately predict or control and the information contained in the\nforward-looking statements is inherently uncertain and subject to a number of risks that\ncould cause actual results to differ materially from those indicated in the\nforward-looking statements. Further information on these and other potential factors that\ncould affect the Company's financial results is included in the Company's filings with the\nSEC. \n  \n        Investor Relations: \n        Natalya Rudman \n        Crescendo Communications, LLC \n        +1-212-671-1020, Ext:304 \n        cesx@crescendo-ir.com   \nSOURCE  CES Synergies, Inc.", "source": "4 Traders"}