{"published": "2015-09-25T15:55:00Z", "media-type": "Blog", "title": "The Early PDA That Major Technology Companies Passed On In the 1970s", "id": "b8566483-b2c6-4dad-8041-4786d5e290b6", "content": "It’s always interesting to discover the missed opportunities that could have changed the course of tech history and here’s a doozy: In the late 1970s, it seems that major companies like HP and Apple passed on an early PDA long before they created their own. This bit of lore comes courtesy of the technology historian Evan Koblentz, whose book Abacus to smartphone: The evolution of mobile and portable computers tells the tale of the mobile computing from the very earliest days. Amidst plenty of fine-grained observations about the early days of personal tech, Koblentz mentions US Patent #4,117,542 for an “Electronic pocket directory” filed in 1977 by two young entrepreneurs named Judah Klausner and Robert Hotto. Advertisement The patent was inspired by the pocket calculators of the day, and the observation that they should be able to store more than just numbers. They envisioned a simple system that could store notes, addresses, and telephone numbers, yet they couldn’t find anyone to make it, they say. First, HP and General Dynamics both passed. Then two other giants did too, according to Hotto (who went on to become a prolific inventor with 39 patents to his name). Koblentz explains in an excerpt: Apple and Rolodex both missed opportunities to have a pre-PDA in 1978.\nThe story began when Judah Klausner started seeing pocket calculators in 1976. “I was looking at these little calculators that were very small and had these memory buttons on them, and I didn’t know what that meant,” he said. The friend explained how a memory button is used only for putting a number into an accumulator — “I thought, that’s dumb, if these things are memory systems why are they so limited?” He asked various engineers about the prospects for expanding a calculator’s memory into more useful functions such as a datebook. Most told him it wasn’t possible with modern technology in such a small package.\nKlausner, who graduated three years prior with a music degree from New York University, then met NYU senior physics major Robert Hotto who was anxious to work with microchips and understand the possibilities. In 1977 the duo filed their patent, “Electronic Pocket Directory”. [They] tried hard to find someone to manufacture their invention. Hewlett-Packard and General Dynamics both passed.\nTwo other meetings were more memorable.\nHotto said he met Steve Jobs at the Trenton (N.J.) Computer Festival.* TCF, as it’s known, still exists and celebrated its 40th edition in 2015. It’s now a minor event of local interest, but in the 1970s and 1980s it was a major corporate date, rivaling and having formed one year ahead of the famous West Coast Computer Faire. TCF also formed a shortly before the Atlantic City (later Philadelphia) Personal Computer Conference.\nHotto recalled that an energetic Jobs only wanted to talk about the Apple II microcomputer, not listen to new product pitches. Jobs’ point of view is understandable today — the Apple II was part of a far bigger market, and that market was wide-open with IBM not yet involved. If Apple had licensed the pocket directory, then the company could have had a personal digital assistant 15 years before the Newton — which many people today still incorrectly think of as the first such product. A healthy relationship with Klausner may have also helped Apple avoid a lawsuit in 2007 — Klausner obtained visual voicemail patents in 1994 and 1996, and settled with Apple in 2008 due to alleged infringement in the iPhone.\nMeanwhile, Klausner approached his uncle, Arnold Neustadter, who ran the Rolodex company. Neustadter’s employee Hildaur Neilsen invented the eponymous business card organizer product in the 1950s. Rolodex declined to get involved. It could have changed the company’s fortunes for decades to come.**\n* The location of this meeting is open for debate. Trenton Computer Festival co-founder Sol Libes said he doesn’t recall Jobs attending. However, Jobs’ attendance at the Atlantic City show is well-documented. ** Franklin Electronics in 1997 bought the Rolodex Electronics division, which made electronic organizers, but by then such products were a commodity. Franklin then sold the innovative Rex organizer, the size of a credit card, under the Rolodex name. Today the traditional Rolodex product line is owned by Newell Rubbermaid, which asserted in 2013 that there remain enough customers to keep it available. Ultimately, Koblentz says Toshiba bought the patent, producing a calculator that could store notes and phone numbers called the Memo Note 30. The original patent is cited by companies like Casio, Sharp, Canon, and other companies developing personal tech that could store data. Hotto’s anecdote about Steve Jobs is difficult to validate, but it’s a fascinating bit of lore. Perhaps the patent could have saved Rolodex from impending obsolescence. This may all seem like ancient history, but PDAs were mainstream just 20 years ago. Technology can feel like a seamless narrative, but it’s pocked with similar stories. Emerging tech is rarely isolated to one inventor–often, it’s more like a race, where only the winner is remembered. You can check out the rest of Koblentz’s book, Abacus to smartphone: The evolution of mobile and portable computers, right here. Contact the author at kelsey@Gizmodo.com.", "source": "Gizmodo"}