{"published": "2015-09-08T23:42:31Z", "media-type": "News", "title": "Major Link Soccer: Reign Drama, Beckham 007", "id": "52a24bb3-e09e-4851-a7e1-4eca745a4d3f", "content": "Creepin' - Susan Mullane-USA TODAY Sports \n   Seattle  \nAdrian Hanauer doesn’t just have an eye for talent in soccer. Seattle Sounders owner Adrian Hanauer’s interests come together in the club’s Posters by the People program. Through Posters by the People, Hanauer’s able to take an idea of the Galaxy’s and make it better, as well as mixing two passions in art and sport. \n \nRoger Levesque’s putting that Master’s degree in Business Administration to good use. In his first season as Sounders FC Director of Community Outreach, Levesque is organizing Seattle’s 30 in 30 campaign. This month, United in Green (Sounders FC’s community arm) is working with the First Team, S2 and former players to provide 30 inspirational experiences to kids and families battling cancer in 30 days. \n \nThe Reign continued their exceptional season with a hard-fought 2-1 win over the Washington Spirit, a preview of the #1 v #4 playoff matchup to come (Sunday 6:30pm at Memorial Stadium,) the exact same first round matchup as last year.  Notable in the game was some drama from the sideline , as Seattle owner Bill Predmore was at the Reign bench despite it being explicitly against the NWSL rules for him to be there, refusing to leave when asked to do so and reportedly throwing an organizing volunteer’s phone as a part of the scene. \n MLS  \nIn case you somehow missed it, Drogba’s here and debuted in dramatic fashion, simultaneously ending Chicago’s season while keeping Montreal’s alive , scoring a hat trick on his debut, including the equalizer and game-winner within 5 minutes. A particularly bitter end for Chicago, who after missing out on Jermaine Jones last year now will likely watch another transfer target help another Conference rival into the playoffs. Fire fans can only hope that the reported 300k in TAM/GAM they received from the Impact will be invested into quality defenders (not JKH or Ianni) soon, as their attack seems to be rounding into MLS 3.0 form with Mike Magee, David Accam, Harry Shipp, Patrick Nyarko, Gilberto, and Kennedy Igboananike. \n \nKevin Ellis has quite a unique background story , featuring an unknown father, a twin brother’s sacrifice, overcoming his mother’s death, leaving college to pursue pro soccer, and an overwhelming love of the game. \n USA  \n\"Maybe, just maybe, when someone like [NASL Commissioner] Bill Peterson talks about promotion and relegation, the real question isn't 'why or why not can we have promotion and relegation in America,' but  'who killed it?'\" \n \nOnce Upon a Metro has a piece up on the Freedom of Information Act and complaints filed in the past 3 years in soccer- Sounders fans might remember (and possibly reported) the first complaint, Colin Clark’s well-publicized homophobic slur that earned him a three-game suspension in 2012. Also an interesting examination of supporters’ chants and their use of profanity on broadcasts. \n \nUnivision’s version of SportsCenter, Contacto Deportivo, surpassed ESPN’s flagship program in viewership in July and August by 42% (that’s a lot), winning specifically in the key Adults 18-49 demographic, regardless of language. \n \nNWSL attendance is up 23% from last year, enjoying the bump from this summer’s Women’s World Cup.  There is cause for optimism outside the bump , however, with eight of nine teams reporting an 10% increase or more, and all teams are expected to return next season. In its third incarnation this millennium, US women’s professional soccer looks like it will reach Year Four for the first time. \n World  \nDavid Beckham thinks he can act in more than just underwear. Regardless of whether or not he can, casting the former England star as 007 would sure sell a whole lot of tickets (and possibly ruin the Bond franchise for decades.) To be fair to Beckham, he sounds humble enough about slowly working towards larger acting roles. \n \nManchester United’s transfer policy has them at a crossroads of development. Huge spending sprees are becoming the preferred mode of ‘Win Now’ as Homegrown Players fall prey to overhype and inconsistent playing time. \n \nRumors that Oriol Rosell could be returning to Sporting Kansas City soon , as the midfield at Sporting CP has gotten crowded for the 23-year-old. Rosell would be a solid player returning to MLS, though he would have to go through allocation due to the transfer fee SKC received; LA currently sits atop the allocation order. Perhaps this is a preview of the process Fredy Montero will have to go through if/when he decides to return to MLS/Seattle.", "source": "SB Nation"}