{"published": "2015-09-03T07:14:00Z", "media-type": "News", "title": "03Sep/Ashraf Mahmood Wathra: Strengthening Pakistan's economy and financial services", "id": "f4668f32-3d64-4b17-b6b3-a262e9907520", "content": "Speech by Mr , Governor of the State Bank of Pakistan, on Independence Day, Karachi, 14 August 2015. \n \nLadies and Gentlemen, \n \nAssalam-o-alaikum, \n \nIt is my pleasure and honour to speak to you on the 69th Independence Day of Pakistan. First of all, I congratulate you. \n \nThe day is celebrated in the memory of those leaders who rendered innumerable sacrifices for the liberty of the nation from shackles of slavery. It was their untiring struggle and perseverance which delivered the fruit of independence for the Muslims of the subcontinent. The Muslims of the subcontinent followed the call of the Quaid-e-Azam Muhammad Ali Jinnah and the dream of a new homeland became a reality at a time when it seemed almost impossible to win it. \n \nPakistan was created for lofty ideals. To win freedom was the first step in that direction. The real freedom means achieving the goal of becoming a self-reliant nation - one that is able to guard her interests and promote her values. Freedom will really be freedom only when we follow the principles taught by our founding fathers and remain united in confronting the challenges the country faces in its move towards growth shared by all Pakistanis. \n \nIt is our collective responsibility to play our roles to transform Pakistan into a strong, prosperous and thriving country. This may require some sacrifices on our part but if we keep the principles taught by our great leaders in mind, we will have the vision to see that such sacrifices effect great advancement for the future of a nation. \n \nA strong economic system based on strong institutions is the key to progress. No nation can hope to grow without a robust financial system and powerful economy. Despite challenges Pakistan managed established a central bank and a viable economic system early on. Although our economy has had many rises and falls and has sometimes seen crises, I believe there is still enormous potential for growth and the economy is now headed in the right direction. \n \nOn this auspicious occasion the State Bank is launching its five-year Strategic Plan. We have titled this Plan SBP Vision 2020. The Plan has devised by the management and officers of the SBP after months of ceaseless work. SBP Vision 2020 has been developed through a participative and consultative process. SBP took the Vision 2025 into account. Moreover, as a part of the process, surveys were conducted of external stakeholders. The results of these surveys were combined with a global scan of central banking issues and domestic and global economic and financial developments. \n \nOur aim is for SBP to be a role model for corporate best practices in Pakistan and to deliver effective and efficient outcomes at every level. We need to empower all staff members to help deliver SBP Vision 2020 and drive the organization's change. In this respect, our core values of Integrity, Accountability, Teamwork, Courage, Excellence and Result orientation shall be the focus for further inculcation into the SBP culture. \n \nSBP Vision 2020 organizes activities around the six strategic imperatives which include: enhancing the effectiveness of monetary policy; strengthening the financial system stability regime; improving the efficiency, effectiveness, and fairness of the banking system; increasing financial inclusion; developing modern and robust payments systems; and strengthening SBP's organizational efficiency and effectiveness. \n \nAround 50 percent of Pakistan's adult population has no access to financial services such as formal savings, payments, deposits, credit or insurance. Despite efforts, the level of financial inclusion has remained very low, and the need for a new comprehensive national strategy has been recognized. Following extensive development and consultation, the National Financial Inclusion Strategy was launched in May 2015. \n \nSBP Vision 2020 with respect to increasing financial inclusion is closely linked to implementation of the NFIS. The NFIS creates the foundation for SBP, the Government and private sector to implement a comprehensive set of coherent and sequenced reforms needed to make a meaningful impact on financial inclusion in Pakistan. The NFIS will guide efforts to promote financial inclusion over the coming five years. \n \nApart from its core functions, the SBP is playing an important in preserving the cultural heritage of the country. In this regard, State Bank Museum and Art Gallery has a prominent role. In a very short span of time the State Bank Museum has become the member of International Forums such as International Council of Museums and Commonwealth Association of Museums. As an ongoing drive State Bank has taken another pioneering initiative by inviting private collectors to be part of SBP Museum, by donating or selling their collections, which will be preserved professionally under an ideal environment, not only this but depending on the size and type of the collection, SBP Museum will reserve a corner, or show space in the name of the donor. \n \nI am very pleased to see the positive response of the citizens and collectors. I am pleased to welcome Pakistan's renowned artist Mr. Adil Salahuddin who has donated a valuable collection to State Bank. It gives me immense pleasure to acknowledge the contribution of Mr. Adil Salahuddin, who is recipient of Sitara-e-Imtiaz and President's Pride of Performance award. He played an important role in the design process of stamps and currency notes in Pakistan as well as abroad. \n \nSBP is launching the collection of Mr. Adil Salahuddin on this auspicious occasion of our Independence Day. \n \nAt the end, I would like to say that the State Bank of Pakistan is one of the few institutions that are the pride of the country. In spite of hazards and challenges, it has made great strides towards the goal of taking the economy to new heights. Our vibrant banking industry is an example of the unremitting efforts that the past and present employees of the SBP have been making. We still have a long way to move forward. There are many, many milestones that remain for us to conquer. \n \nLet us make a firm resolve today that we will live up to the ideals of the Quaid-e-Azam and further our efforts to achieve the ends for which the State Bank of Pakistan was established.", "source": "Bank for International Settlements"}