{"published": "2015-09-15T19:15:46Z", "media-type": "News", "title": "Instagram's The Fat Jew reveals he used Craigslist to find 'real' models", "id": "887403df-2c36-4e6e-bcca-b6c3bb6fd652", "content": "The Fat Jew, whose real name is Joel Otrovsky, revealed that his New York Fashion Week show will highlight 'real dads' The 30-year-old New York entertainer shot to notoriety in 2014 and gained more than 5 million followers on Instagram  Says the collection will include 'a lot of Rockports', 'sensible walking shoes', 'khakis' and 'pajamas with big giant plastic buttons'  \nHe calls himself 'the world's first plus-sized male model', and now the Fat Jew has revealed that he is bringing his brand of 'dad fashion' to the mainstream with his upcoming New York Fashion Week show. \n\nThe Fat Jew, whose real name is Joel Otrovsky, revealed some secrets about his upcoming show at the Alexander Wang tenth anniversary New York Fashion Week event on Saturday - and told  Yahoo Style  that the catwalk will be 'like nothing the industry has ever seen' because it will be 'highlighting regular dads with very normal bodies'.  \n\nIn contrast to the star-studded guests surrounding him at the glamorous event, including Lady Gaga, Zoe Kravitz, The Weeknd, Bella Hadid, Tyga, and Kylie Jenner, the 30-year-old designer said that he cast The Dad Fashion Show rather randomly using 'a lot of Craigslist, and some real dads that I know'. \n   \nDad fashion: The Fat Jew, whose real name is Joel Otrovsky, said that he scouted unknown models on Craigslist for his New York Fashion Week collection  \n\nHe explained that the presentation, which will take place at the MADE Studios​ on September 16th, will also feature 'dad s**t' including 'a lot of Rockports', 'sensible walking shoes', 'khakis' and 'pajamas with big giant plastic buttons'. \n\nBut The Fat Jew is not limiting his activities to high fashion: The funnyman also revealed that he is 'deejaying and hosting a sweet sixteen in New Jersey for a girl whose father either invented cruise control or the roof rack, I can’t remember which one'. \n\n'Yeah, I don’t know if I should be around that many 16 year olds, but this is happening. They hired me off Twitter. AND they put in the contract that I have to keep my shirt on,' he added.   \n   \nFashion faux pas? Despite his unique sense of style and outspoken views about the industry, The Fat Jew has become one of NYFW's most unlikely front row stars \n   \nFamous friends: The social media star has proved a hit with many Hollywood A-listers, including Justin Bieber (pictured) \n\nHe confessed, however, that he was tempted to show off his 'Shrek body', since 'it takes a lot of work to look this s****y'.  \n\nThe New York-based entertainer, who shot to fame in 2014 after gaining five million Instagram followers in a matter of months, went on to say that sometimes it is all about the paycheck. \n\n'I wish it was a quinceanera, so if you’re having a quinceanera, please hire me,' he added. 'I will literally do whatever you want.' \n\nOn that note, he said that in lieu of tiny canapes, his show will feature hoagies and Hotel California on repeat.   \n   \nComedy: Ostrovsky's quirky - and occasionally controversial - breed of humor has made him a huge success on social media \n\nIn the past, the self-described 'Z-list celebrity' has worked on the E! Channel as a correspondent interviewing celebrities, and was a member of genre-bending rap group Team Facelift.  \n\nAfter the group's disbandment in 2010, Ostrovsky left music and began focusing solely on entertainment and plus-size modeling. \n\nHe has created video campaigns for such brands as Virgin Mobile, Burger King,Bud Light, and Beats Electronics, and recently introduced a wine called White Girl Rosé. His rescued Cavalier King Charles spaniel, Toast, is also a social media star.  \n\nHis first book Money, Pizza, Respect will be released in November. He currently hosts a radio show on Apple Music Beats 1 called 'Money, Pizza, Respect'.  ", "source": "Mail Online UK"}