{"published": "2015-09-28T00:00:02Z", "media-type": "News", "title": "Exit poll shows separatists winning majority in Catalan assembly", "id": "131d4d64-b51e-489d-babc-5c98fbae9bda", "content": "Supporters of secessionist group Junts Pel Si celebrate after polls closed in a regional parliamentary election in Barcelona that saw separatists win a clear majority of seats in Catalonia's parliament. \n             \nSeparatists have won a clear majority of seats in Catalonia's parliament, an exit poll showed on Sunday, in an election that could set the region on a collision course with Spain's central government over independence. \n \nThe main secessionist group \"Junts pel Si\" (Together for Yes) would get between 63 and 66 seats in the 135-strong assembly, while smaller leftist party CUP would secure another 11 to 13 seats, according to the poll released by local broadcaster TV3, the largest carried out. \n \nThey would jointly obtain 49.8 per cent of the vote, amid a an expected record turnout, in what would be a big boost to a secession campaign which has been losing support over the last two years. \n \n\"Junts pel Si\" and CUP had said before the vote that such a result would allow them to unilaterally declare independence within 18 months, under a plan that would see the new Catalan authorities approving their own constitution and building institutions like an army, central bank and judicial system. \n \nThe Spanish centre-right government of Prime Minister Mariano Rajoy, which has opposed attempts to hold a referendum on secession, has called the breakaway plan \"a nonsense\" and vowed to block it in court. Spain's constitution does not allow any region to break away. \n \nCatalan secession remains highly hypothetical, but the strong pro-independence showing is a blow for Rajoy less than three months before a countrywide election. \n \nIt also creates additional uncertainty over potential talks over a more favourable tax regime and laws that better protect language and culture, which analysts say are needed to soothe Catalan discontent. \n \nMany of the 5.5 million voters had said on Sunday that they did not believe Catalonia would become independent and had used their ballot as a way to press the Catalan and Spanish authorities to discuss those issues.  \n    \n- Reuters", "source": "Southland Times"}