{"published": "2015-09-22T20:56:34Z", "media-type": "News", "title": "Rugby World Cup 2015: Jarryd Hayne's NFL agent Jack Bechta scouting for NFL recruits", "id": "44685aa3-4182-444f-b0ac-03a71e3e9157", "content": "The man who helped Jarryd Hayne break into the NFL is scouring the Rugby World Cup for the next cross-sport convert who can crack the United States market. The lowdown: Rugby World Cup 2015 The man who helped Jarryd Hayne break into the NFL is scouring the Rugby World Cup for the next cross-sport convert who can crack the United States market. As the Wallabies prepare to begin their World Cup campaign against Fiji in Cardiff, NFL agent Jack Bechta has made his intentions clear as he searches for a Hayne clone.\n\nHayne has made a remarkable transition from NRL superstar to NFL rookie with the San Francisco 49ers after he quit his Parramatta Eels deal last year.\n\nNow Bechta has his eyes on some new targets who are capable of breaking into the lucrative market.\n\n\"I'm actively scouting and trying to identify three to five guys who potentially fit the profile of an NFL player,\" Bechta told ESPN.\n\n\"Rugby players are better conditioned athletes than NFL players - from a toughness, training standpoint they won't have any problems making the transfer.\"\n\nWallabies fans can rest easy with prized possession Israel Folau recently committing to a new deal which will see him stay in Australian rugby.\n\nBut the Wallabies spent two weeks in the United States with many players showing their love of NFL with some slick moves on the training fields at Notre Dame.\n\nNFL talk has infiltrated the Wallabies camp with playmakers referred to as quarterbacks and assistant coach Stephen Larkham saying wingers were running backs.\n\n\"Only one out of every five or 10 will make it. It is a tough journey. It is more challenging than people think,\" Bechta said.\n\n\"It is the mental challenge of learning a new game ... In Hayne's case, I hired the best NFL former coaches and surrounded him with former players and gave him a crash course on the basics before we decided to sign him to a team. (function(d, s, id) (document, 'script', 'facebook-jssdk'));Post training fun! Trying some route running off the slick QB... Matt Giteau Waratahs Wallabies #IzzyRWC2015 Notre Dame Football Wallabies Rugby World CupPosted by Israel Folau on Wednesday, 2 September 2015 \"You make a substantial investment as an agent into an athlete.\"Hayne-mania hit Australia when he survived the final roster cut at the 49ers and made his debut.But his involvement was limited to just four offensive snaps at running back in last weekend's 43-18 loss to Pittsburgh.Bechta is attending World Cup games to see which players stand tall under the bright lights of international rugby.\"The World Cup is the field where players make names for themselves,\" Bechta said.\"Usually the player I'm looking for is the man among boys who dominates and is usually one of the best or fastest players on the field. It's usually the obvious ones.\" iFrameResize(,'#pez_iframe'); The story first appeared on The Sydney Morning Herald.", "source": "Manning River Times"}