{"published": "2015-09-10T02:04:51Z", "media-type": "News", "title": "Uber hits back at taxi industry claims", "id": "3011fed2-1784-47f8-834c-c1f1af79e476", "content": "UPDATED Uber says Melbourne protests are being led by investors not taxi drivers. \n\nUber has hit back at claims that its entry into Australia is hurting taxi drivers and small investors who hold taxi plates.\n\nTo get more Money more often, why not follow us on Twitter? We’re @FairfaxMoney \n\nTaxi drivers have been protesting in Melbourne this morning but the anger is felt by the taxi industry across the country. Some drivers say that they find it hard to compete with ride-sharing in their own cars. And investors who have put their life savings into owning taxi plates have seen their stakes shrink.\n\nBut despite the protests, Uber is bullish about its operations.\n\nA spokesperson said: \"The leaders of these protests are taxi investors, not drivers.\"\n\n\"These same investors are the ones who have kept drivers' wages low and working conditions poor for decades before Uber arrived.\n\n\"Instead of improving their own business, these plate owners are blaming others,\" the spokesperson said.\n\nUber is not to blame for taxi drivers' poor working conditions and taxi industry data shows that \"the taxi market has grown since Uber arrived,\" the spokesperson said.\n\nOne Brisbane taxi driver, Ross, who recently contacted Money, said he gets upset with ride-sharing because people do not understand the costs that go into a taxi.\n\nThere are the cameras that taxis have to have and car insurance of $6000 a year and \"security\" fees of $600 a year. And that is before the taxi driver put the keys into the ignition.\n\nHe said he has just put a new Toyota Aurion on the road at a cost of $46,000 and in Brisbane you see old Corollas being used for ride-sharing.\n\nAn older reader from NSW who does not want to be identified said he and his wife bought a taxi plate so that they would not have to go on to the pension.\n\nBut the value of the investment has fallen due to ride-sharing.\n\nThe retirees first bought a taxi plate in 2006 and it was worth about $440,000 in 2008. He reckons it is now worth about $320,000 or less because of ride-sharing.\n\nUber \n\n\"It is an illegal taxi service that should be banned in this state as it has been in many cities and states of the world,\" he said.\n\nData supplied to Money by Uber shows that about 30 per cent of Victorian taxi plate holders actually drive their own taxi, the rest are owned by a few big investors, some of whom hold hundreds of licences.\n\nIn NSW about one-quarter of taxi plate holders actually operate their taxi, almost half are held by those who own more than one and some investors hold over 300.\n\nThe Uber spokesperson said the time has come for political leaders to implement sensible, safety-based ride-sharing regulation as quickly as possible.\n\n@jcollett_money The story first appeared on The Sydney Morning Herald.", "source": "The Queanbeyan Age"}