{"published": "2015-09-09T08:03:00Z", "media-type": "News", "title": "5 marketing strategies to reduce user acquisition cost", "id": "58e950b9-d387-40aa-8251-424e2683d436", "content": "Is your user acquisition cost too high? These are 5 mobile game marketing strategies to reduce UA cost, attract players and grow revenue organically. \n\nUser acquisition can be a lot like that head contraption from Saw.\n\nIn the mobile game industry, paid advertising techniques on mobile devices, such as mobile ad networks, are what's typically known as user acquisition or UA.\n\nIt's the standard way to monetize mobile games.\n\nThe problem is user acquisition cost is high and rising.\n\nAnd because of that, mobile game developers seem to be either closing up shop or desperately looking for ways to reduce their user acquisition cost before they have to.\n\nThe math is simple.\n\nFor a mobile game to stay profitable its user acquisition cost has to stay below its customer lifetime value (CLV).\n\nAnd I'm absolutely hell-bent on helping mobile game developers reduce user acquisition cost.\n\nThat said, here are 5 actionable, mobile game marketing strategies that I want you to execute to reduce user acquisition cost, attract players and grow revenue organically...\n\nIf you're like most developers, you've got an email newsletter on your website because you know it's important, but it's also kind of a nuisance, right?\n\nYou might not have a ton of addresses so it's not super exciting to try and figure out what to send each week. And because of that, maybe you haven't sent anything in a while.\n\nNot good.\n\nEmail is 40x better at acquiring new customers than Facebook and Twitter combined.\n\nSo here's what I want you to do...\n\nStart investing in an \n\nYour offer could be an exclusive origin story, a PDF comic book or some type of in-game promo code.\n\nIn any case, it has to be something valuable enough for your audience to fork over their email addresses.\n\nIt all sounds very simple, but if you start doing this your email list will become one the best ways to grow revenue organically and reduce user acquisition cost.\n\nDoes this sound familiar? You've got an official website for your game, and it takes a lot of time and money to manage for what feels like very little return on investment.\n\nIts primary function has really become information or PR, rather than marketing or selling games.\n\nIf that sounds familiar then you're missing a giant opportunity to generate revenue.\n\nSo, here's what I want you to do...\n\nConvert all your official game websites into landing pages (or squeeze pages), because that's going to improve clicks through to your marketplaces.\n\nIf you're not sure how to do that please read my official game website design strategy.\n\nFollow that guide all the way through, start growing revenue with your official game websites and start relinquishing your dependency on paid advertising.\n\nLet's say you're a F2P mobile game with IAPs, and you're using mobile ad networks to monetize. That's the common mobile game business model.\n\nBut what inevitably happens is this...\n\nYou're going to get jealous of all the players those networks are sucking right out of your game. Your retention rate will drop and your IAP revenue will follow.\n\nYou'll be left making the vast majority of money by sending players away from your games.\n\nUser acquisition is a lot like that head contraption from Saw.\n\nAnd there's a lot of mobile game developers struggling to get out of it.\n\nHere's what helps unlock that...\n\nInstead of relying 100% on mobile ad networks to monetize your games implement native advertising with the goal of increasing IAPs.\n\nFor example, let's say your game is Super Mario Bros 3 and a player finds a magic flute. They should see a 3-tier, native advertisement asking them which world they'd like to warp to and at what cost.\n\nRolling your own native advertising is one of the best ways for F2P mobile games to grow revenue and reduce user acquisition cost. \n\n400 million people around the world use Dropbox, the standard in cloud storage accessible from any device anywhere. But I don't want to talk about storage.\n\nI want to talk about those 400 million users.\n\nIn the startup world, that's unbelievable. And it's a known fact Dropbox spent very little on advertising.\n\nSo, how'd they do it?\n\nThey did it with incentivized referrals.\n\nWhen you sign up for a free Dropbox account you get 2 GB of storage. But if you refer it to a friend and they sign up too, Dropbox adds another 500 MB to your account.\n\nAnd I want you to do the same type of thing for your games. It's called an incentivized referral program.\n\nYou've no doubt a reward system in your game. Utilize that system to leverage referrals from your players because that'll encourage organic shares, expanding your audience at a rapid pace.\n\nMarketing channels are places online where you talk about or post content about your games, such as websites, forums, social media and email newsletters.\n\nAnd every day you post new content in those channels such as screenshots, memes, trailers, video, articles, interviews and so on.\n\nThe problem is, everyone's basically getting the same information about your games wherever they go.\n\nNothing's exclusive.\n\nSo, here's what I want you to do…\n\nReserve big content reveals for only certain marketing channels.\n\nFor example, what if Twitter was the only place online where people could see new screenshots of your game? Here's what you might post in other channels to encourage followers...\n\nWant to see our game before anyone else? Follow us on Twitter where every Saturday we post 3 exclusive, never-before-seen screenshots of [game]!\n\nThis strategy immediately does three things:\n\nIt increases your social audience because people have an incentive (1). It increases the value of your content because it's exclusive (2). And it increases total shares because your audience will want to be the person who shares it for you (3).\n\nContent exclusivity is a powerful strategy for building an audience and reducing user acquisition cost.\n\nUser acquisition, or paid advertising techniques on mobile devices, isn't the only way to sell mobile games.\n\nDon't buy into the lie, literally or figuratively.\n\nThere are dozens of ways to reduce user acquisition cost. And when you start taking into account your specific game's experience, there's exponentially more.\n\nPut my 5 mobile game marketing strategies in place, measure them and then post a comment below or email me privately \n\nJustin Carroll runs Monastery, a mobile game marketing agency that's hell-bent on helping mobile game developers reduce user acquisition cost. Unlike other agencies, they specialize in attracting players with entertainment, not just advertising.", "source": "Gamasutra"}