{"published": "2015-09-18T16:33:11Z", "media-type": "Blog", "title": "My Dad Deserves to Die", "id": "340bb625-bb7e-49af-aa8d-781e5762f7a3", "content": "Peter Edelstein M.D. Patient Power My Dad Deserves to Die Why California’s recent assisted suicide legislation doesn’t go far enough. Posted Sep 18, 2015 SHARE TWEET SHARE EMAIL I remember sitting by her side, tears running down my cheeks, as her doctor returned her to me.  He had just given her the medication that would within minutes quietly take her from us, allowing her to pass away peacefully.  I loved her, and my heart ached, but I knew that this was best for her.  That the loss of her eyesight, her failing liver, her difficulty breathing as the fluid collected in her abdomen and lungs, her painful arthritic hips, all had finally made living much less appealing than dying surrounded by loved ones.  We were her family and owed it to her to help her die.  Because she couldn’t make the decision for herself.  And so I had forced myself to abandon all of the selfish reasons I had been using for months to avoid arriving at this day, and I did what I knew she would want me to do. Euthanizing my dog, who my then-fiancée and I had adopted from the shelter when she was only nine weeks old, who had been part of our new life together, who had eagerly waited for us to bring each of our newborn daughters home, who had played and slept with us for close to two decades, was the right thing to do.  Loving pet owners euthanize their furry family members every day, to no outcry and with popular understanding and support. Last week, the California legislature sent their governor a bill which seeks to make the Golden State the 5th in the country to legalize “assisted suicide” (following Oregon, Montana, Washington, and Vermont).  For many physicians like myself who have had the privilege of caring for terminally ill patients and their families, that such legislation has not passed in all fifty states is tragic.  To address credible concerns of misuse and abuse, there are numerous checks and balances built into these laws (such as the California bill’s requirements that two physicians independently agree that the patient has no more than six months to live, and that the patient himself or herself be able to swallow the fatal medications unassisted).  Not to mention the ultimate check against misuse:  that the patient must be deemed mentally competent to actively request assistance in life termination. Yet it is this final requirement of mental competency which is so unfortunate and unfair to thousands of terminally ill patients and their loved ones.  I speak from deeply personal experience.  My father, once a bright, warm, and gentle loving dad, husband, physician, and educator, has suffered from Alzheimer’s disease for close to two decades.  Ultimately, his Alzheimer’s made living independently with my mother (with my family down the street) unsafe and impossible, and so he has been in an Assisted Living Dementia Unit for seven years.  Over the last two years, his condition has deteriorated dramatically, and today, Dad lies in bed 24/7, communicating with no one and entirely expressionless, other than the automatic smile he now rarely displays if awake when my mom comes in the room (as she does several times a day).  He otherwise is entirely non-interactive, sitting stiff and staring at the ceiling with glazed eyes.  He is fed, washed, and toileted by nurses. My father has, in reality, already died.  But he has left his skin-and-flesh shell behind, a shell which will ultimately stop breathing and no longer generate a heartbeat as a direct result of Alzheimer’s disease (an estimated half-a-million Americans die from Alzheimer’s every year).  But for our family, and especially for my mother (his wife of more than fifty years), the lingering of Dad’s soul-less body day after day, week after week, and now year after year, is a painful, punishing, insult to the memory of my father.  And it represents exactly what my dad, once a passionate physician and beloved teacher (as well as loving father and grandfather) clearly told his wife and family he did not wish to ever be allowed to happen.  Long before his Alzheimer’s set in, he and Mom on several occasions discussed such a potential future (as Alzheimer’s runs in his side of the family).  He articulated that should he become mentally and physically dysfunctional (conditions which he met almost two years ago), he wished for her to help him end his life with dignity.  Now at 84 years of age, if he was suffering from advanced stage cancer, heart disease, or other terminal condition which did not alter his mental status, my father (a California resident) could (assuming the governor signs the bill) opt to end his suffering through legalized assisted suicide.  But despite the fact that hospice professionals are now certain that Dad will pass away in the next six months, because his terminal disease will kill him through progressive brain damage, which has robbed him of his mental competency (as well as his ability to physically function), he cannot take advantage of the California legislature’s recent show of legislative compassion and end an existence which he desperately wished to avoid.  End the endless misery suffered by my mom, his wife, who must witness the spiritless shell which has now replaced her life partner, devoid of all personality, soul, life.  And her guilt at not being able to fulfill his last wish, that he not linger on like this day after day, week after week, year after year, overwhelms her.  Her attorney and Dad’s Assisted Living team have assured her that despite her having his Medical Power of Attorney, there’s nothing that can be done.  More than five million Americans currently suffer from Alzheimer’s disease, which is the most common but only just one form of dementia.  And the Alzheimer’s population is growing dramatically as our population (and that of the world) ages.  Assisted suicide legislation is a good start to accepting the responsibility of a compassionate and honest society in dealing with end-of-life issues, and such legalization represents the right option to offer Americans throughout this great nation.  However, it is not too early to recognize the need to expand the opportunity for Americans nearing the end of their lives to choose a dignified, peaceful exit from this world in the presence of their loved ones.  Thousands of once mentally competent husbands and wives, fathers and mothers, brothers and sisters whose terminal illnesses through no fault of their own compromise their mental faculties should not have to suffer the indignity of punishing their family and friends through slow, tortuous death spirals.  Surely we can expand legalized assisted suicide to allow any and all of us to clearly define under what circumstances we wish to be eased from our pain if no longer mentally competent to make such a decision.  Checks and balances can be built in at the time that a mentally competent person requests the option for assisted suicide should they lose their mental competency in the future.  And we must trust in those who love the patient to act in their best interest in accordance with the patient’s previously defined guidance. After all, it’s the right thing to do for our beloved dogs and cats.  How can it not be the right thing to offer our dads and moms? SHARE TWEET SHARE EMAIL Patient Power Taking charge of your health Peter Edelstein, M.D., is a passionate patient advocate, former Associate Residency Director at Stanford University Medical School and current Chief Medical Officer for global publisher, Elsevier. FACEBOOK TWITTER LINKEDIN Most Recent Posts from Patient Power My Dad Deserves to Die\nWhy California’s recent assisted suicide legislation doesn’t go far enough. Are You Getting the Right Cancer Screening?\nKnowing what screening plans you should follow is part of Owning Your Health Protect Yourself from Doctors like the Michigan Oncologist\nSome tips to prevent you from suffering at the hands of a dangerous physician. See More Posts", "source": "Psychology Today"}