{"published": "2015-09-28T15:01:00Z", "media-type": "News", "title": "'I was screaming \"I can't breathe!\"'  Tetraplegic rugby star Matt Hampson speaks out", "id": "59ea49a6-a970-43e1-bae1-882b2d4efec1", "content": "HE SUFFERED one of the most well-publicised rugby injuries of all time, but Matt Hampson remains blissfully positive in the face of adversity. \nIt's been year years since a scrum collapsed and Matt, 30, suffered life-changing injuries on the rugby pitch.  \n\nAt the time, Matt was a rugby player for one of the best teams in the UK: the Leicester Tigers. He was also an England under 18 squad member.  \n\nSpeaking about what he remembers of his accident, Matt told Express.co.uk: \"I don’t remember much of the accident itself. We had a tough training session, ahead of the Friday when we were due to play the Scots.  \n\n\"We went into live scrummaging. I remember hitting the scrum and the scrum collapsing, with me left at the bottom. I said 'I can’t breathe! I can’t breathe!' I was really worried, and realised couldn’t feel my arms and legs. After that I blacked out.\" \n\nHe added: \"I remember waking up in the ambulance and the paramedics were cutting my England shirt off me. The only thing I was thinking was, 'That’s my England shirt! Don’t damage that!' I drifted in and out of consciousness with really frightening dreams.  \n\n\"In between the dreams, I’d wake up in Stoke Mandeville Hospital ward, seeing my family standing around me.\" \n\nLittle did Matt know his England shirt being ripped open was about to be the last of his worries - when the scrum collapsed it dislocated his neck, severing his spinal cord.  \n\n\"Initially, it was difficult to come to terms with,\" he said. \"I had quite a few dark days. \n\n\"Going from being a young, fit sportsman, to not being able to move from the neck down was tough.  \n\n\"The thing that was great for me was the support from my amazing family and friends. They didn’t treat me any differently to before – to them I was just the same old Matt.\" \n\nSpeaking about being in hospital, he added: \"You don’t think life is ever going to be the same again. Stoke Mandeville for me wasn’t a very pleasant place.  \n\n\"There were great people in there, who will be friends of mine for life; but some weren’t as great. \n\n\"There was so much emotion going through my mind, but they didn’t explain what was happening to me. They made you feel like a lump of meat, not a normal person – whatever normal is.  \n\n\"I didn’t have much support at Stoke Mandeville. I couldn’t see the light at the end of the tunnel at times. It was tough.\" \n\nThis year marks a decade since the accident, which left Matt paralysed and a tetraplegic, dependent on a ventilator to breath.  \n\nShowing incredible strength, tranquility and mental power, the former rugby star hasn't let his injuries consume him.  \n\nIn fact, if anything Matt is stronger than ever and opening a new centre in Melton Mowbray to inspire children and their families to continue fighting after suffering a catastrophic injury.  \n\nBut none of this would be as easy without his friends and former team mates helping him and giving their undying support.  \n\nMatt explained: \"My old teammates are a still a massive part of my life, as well as of the Matt Hampson Foundation. They support me in everything I do.  \n\n\"One of my best mates, Matt Cornwall, who was England Under 21’s captain and is now team manager at Leicester Tigers, is a great guy and has constantly been a really positive influence.  \n\n\"Then there are guys like James Haskell, Ben Foden, Toby Flood and others who I was playing alongside, who are always there for me and stay in touch. Rugby’s a big family – you go to the same events and functions.\" \n\nHe added: \"Richard Cockerill once said to me that I’ll always be a Leicester Tiger, and that they will support me for the rest of my life. What a fantastic club to do that. I’m a life-member of the Tigers, and they help with everything I do, especially with the Foundation. It means a great deal to me.\" \n\nMatt is now focusing all his efforts on the Get Busy Living Centre. He said: \"I think it will be a really important place for people to come and share positive experiences with their families. We have so many different beneficiaries; so many unique talents.  \n\n\"The Foundation can do amazing things with this new Centre, and it gives us a real focal-point.\" \n\nHe added: \"My attitude is that you need to live your life every day. You can’t sit still and wait to be helped. You need to live every day, and try to achieve something every day.  \n\n\"That’s how I feel. Like we say at the Foundation, we want to Get Busy Living. That’s the whole point of the Foundation – it’s about being proactive, to do something productive with your life.\"", "source": "Daily Express"}