{"published": "2015-09-17T06:54:02Z", "media-type": "News", "title": "India determined to reclaim its position as one of the great world powers US envoy", "id": "164094dd-4fc8-4e63-8169-cb438de61f10", "content": "Auckland News.Net  Thursday 17th September, 2015  \n U.S. Ambassador to India, Richard Verma, has said that the developments of the past year show that India is determined to emerge from its slumber as the second sleeping giant of Asia and reclaim its historical position as one of the great world powers. \n\"Indian leaders have expressed a determination to leave behind the traditions of non-alignment and strategic autonomy and, in the words of Foreign Secretary Jaishankar, to become a 'leading power',\" he added. \n \nVerma said the strategic partnership between India and the US will be unlike the geo-political alliances of the 20th century. \n \n\"Rather than remaining confined to one corner of our planet, we will work to uphold the global systems and spaces that will allow for the continued advancement of humankind. In the words of Prime Minister Modi the great promise of the U.S.-India relationship is what both countries \"can do together for the world.\" To be sure, the U.S.-India strategic partnership will be anchored in Asia,\" said Verma. \n \n\"But it will also be a truly 21st century relationship of natural allies working together in cyberspace, global hotspots, outer space, the human genome and the global biome,\" he added. \n \nAsserting that India is seeking to make up for lost time, the US envoy said India is still grappling with a legacy of systemic economic challenges that have hampered its growth in comparison to other Asian powers in the 20th century. \n \n\"However, India has exerted a profound historical impact on the global economy, and is poised to do so again. For much of recorded history, until the 18th century in fact, India's GDP matched or exceeded that of China and dwarfed production in Europe,\" said Verma. \n \n\"As the birthplace of Buddhism and a historical center of Sufi Islam, India's cultural influence extends from Southeast Asia to Mongolia and from Indonesia to the steppes of Central Asia,\" he added. \n \nThe US envoy said the relationship between New Delhi and Washington will serve as an important new buttress safeguarding open commerce and freedom of navigation in the Asia-Pacific region. \n \n\"Through dialogues such as the U.S.-India East Asia Consultations which the East West Center graciously hosted in June and the U.S.-India -Japan Trilateral Dialogue, we are working together to promote a democratic and rules-based vision for political and economic security in Asia,\" said Verma in his remarks on \"An Alliance for Global Prosperity\" at EWC, Hawaii. \n \n\"But our bilateral relationship will be much more far-reaching. The U.S. and Indian governments are engaging agricultural professionals from Kenya, Malawi and Liberia to improve food security in their countries by increasing crop yields using new technologies,\" he added. \n \nThe US envoy said India's generic pharmaceutical industry and highly skilled biotechnology workforce will be essential to addressing the greatest health challenges in all countries across the economic spectrum. \n \n\"Our countries are exchanging findings from current Mars missions and are sharing ideas about future explorations. Prime Minister Modi recently hosted the third USAID-supported Call to Action Summit to end preventable maternal and child deaths,\" said Verma. \n \n\"The United States and India have joined forces to advance a multi-stakeholder model of internet governance and are working to bring together industry, academia and regulators in both our countries in support of this vision. These are just a few examples that show how the scope of our alliance will not limited by geography or sector but will encompass the full spectrum of human endeavor,\" he added. \n \nVerma said as the Indian governments have come and gone the ideal of a multiethnic democracy has remained at the very core of the national consciousness. \n \n\"In this way India was perhaps the first truly 21st century country. In the decades after 1947, the freedom riders who were trained in Gandhi's ideals and methods, and in some cases in India by Gandhi's associates themselves, helped the United States begin to come to terms with our own history of injustice, providing the reconciliation that allowed for our post-Cold War prosperity and influence,\" he added. \n \nVerma said the commitment to a democratic system and the rule of law that have made India an island of stability in a continent that has seen tremendous upheaval in the past 50 years will continue to provide the Indian people the platform on which to construct their 21st century emergence. \n \n\"That India has lifted millions out of poverty and many of its 1.2 billion people have prospered while living under a transparent system of government demonstrates that the principles both countries hold dear are not \"American\" or \"Asian\" but human aspirations,\" said Verma. \n \n\"This shared view of a government that is inclusive and accountable to its people has resulted in India, despite its considerable economic challenges, leading the pack in a number of key indicators. Indian citizens are among the world's most numerous and active social media users - much has been written about the Indian impact on platforms such as Twitter and Instagram,\" he added. \n \nThe US envoy said the Indian innovators are among the most successful and prolific patent applicants in the world, and Indian companies, drawing on a highly educated English speaking workforce, are deeply integrated into global business processing. \n \n\"Recent controversies notwithstanding, India's civil society is composed of tens of thousands of vocal and active NGOs that are influencing policy and budgets around the country. In this century, the advancement of prosperity will require the ability to nurture innovations, energize global audiences with new ideas and build cross-cultural understanding,\" said Verma. \n \n\"I need only to consider the number of Indian citizens using Facebook on cell phones charged by village entrepreneurs selling solar power to be certain that India is primed to succeed in these challenges,\" he added. (ANI)", "source": "Auckland News.Net"}