{"published": "2015-09-16T12:34:55Z", "media-type": "News", "title": "AOXING PHARMACEUTICAL COMPANY INC : Aoxing Pharma Gains Inclusion of Zhongtongan in Procurement Lists of Hebei, Jiangsu, Shanxi, and Hubei Provinces", "id": "7d52e663-f35d-483d-9218-21f43288d014", "content": "/ Aoxing Pharmaceutical Company, Inc. (NYSE MKT: AXN) (\"Aoxing Pharma\"), a specialty pharmaceutical company focusing on research, development, manufacturing, and distribution of narcotic, pain-management, and addiction treatment pharmaceuticals, today announced that its best-selling product, Zhongtongan (an herbal extract capsule for toothache, stomatitis, bone and joint pain treatment), has been included in the government essential drug procurement lists for Hebei, Jiangsu, Shanxi, and Hubei Provinces. Hebei Province has begun procurement of the drug, and the Company expects Jiangsu, Shanxi, and Hubei Provinces will begin procurement soon. \n \n\"We're very excited that Zhongtongan has been recognized as an essential drug in four additional provinces,\" said Mr. Zhenjiang Yue, Chairman and CEO of Aoxing Pharma. \"This reaffirms the quality and acceptance of our products. Sales in those four provinces, which have a combined population of 220 million, already account for 30% of the Company's total sales. We expect government procurement to increase over time, which should cause Zhongtongan sales in the four provinces to increase several fold.\" \n \nThe inclusion of Zhongtongan in the provincial drug procurement lists is part of an overall strategy by Aoxing Pharma to take advantage of China's increasing drug reimbursement in connection with its move to universal healthcare. The Company is also working on obtaining inclusion of Zhongtongan and other products in the New Rural Cooperative Medical System, which would add the nation's rural population to the Company's market. \n \nMeanwhile, the package design and other preparations for our newly approved product, Tilidine, have been completed. The Company expects to commence a national rollout with initial production and sales in the quarter ended December 31, 2015. \n \nWe are currently estimating the effect of the above on our revenue and profitability. The Company plans to provide financial guidance at the same time we report out fiscal 2015 results at the end of this month. \n \nAbout Aoxing Pharmaceutical Company, Inc. \n \nAoxing Pharmaceutical Company, Inc. is a US incorporated specialty pharmaceutical company with its operations in China, specializing in research, development, manufacturing and distribution of a variety of narcotics and pain-management products. Headquartered in Shijiazhuang City, outside Beijing, Aoxing Pharma has the largest and most advanced manufacturing facility in China for highly regulated narcotic medicines. Its facility is one of the few GMP facilities licensed for the manufacture of narcotic medicines by the China Food and Drug Administration (\"CFDA\"). For more information, please visit: www.aoxingpharma.com . \n \nSafe Harbor Statement from Aoxing Pharmaceutical Company, Inc. \n \nCertain statements made in this press release are forward-looking and are made pursuant to the safe harbor provisions of the Securities Litigation Reform Act of 1995. Such statements involve risks and uncertainties that may cause actual results to differ materially from those set forth in these statements. All forward-looking statements included herein are based upon information available to the Company as of the date hereof and, except as is expressly required by the federal securities laws, the Company undertakes no obligation to update or revise any forward-looking statements, whether as a result of new information, changed circumstances or future events or for any other reason. To the extent that any statements made here are not historical, these statements are essentially forward-looking. Undue reliance should not be placed on forward-looking information. The economic, competitive, governmental, technological and other risk factors identified in the Company's filings with the Securities and Exchange Commission, specifically, Item 1A, \"Risk Factors,\" in the Form 10-K for the year ended June 30, 2014, may cause actual results or events to differ materially from those described in the forward looking statements in this press release. The Company undertakes no obligation to publicly update or revise any forward-looking statements, whether because of new information, future events, or otherwise. \n \nCONTACT: \n \n Aoxing Pharmaceutical Company: \n646-367-1747 \ninvestor.relations@aoxingpharma.com \n \nSOURCE: Aoxing Pharmaceutical Company, Inc.", "source": "4 Traders"}