{"published": "2015-09-09T04:45:39Z", "media-type": "News", "title": "Islamic State: Tony Abbott refuses to rule ...", "id": "36a69eec-c400-4c18-bba9-5f455a1f9006", "content": "Prime Minister Tony Abbott has declined to rule out putting Australian \"boots on the ground\" – meaning combat forces – in the fight against Islamic State as he announced an expansion of RAAF air strikes into Syria. \n\nPolitics Live: Stephanie Peatling from Parliament House 12,000 Syrians to be resettled in Australia​What Prime Minister Tony Abbott has declined to rule out putting Australian boots on the ground – meaning combat forces – in the fight against Islamic State as he announced an expansion of RAAF air strikes into Syria.\n\nMr Abbott was asked twice during a press conference in Canberra on Wednesday whether boots on the ground would eventually be required to defeat the militant group. Each time he sidestepped the question, despite having ruled out putting combat boots on the ground in the past.\n\nOn Wednesday, Mr Abbott said the campaign of air strikes against Islamic State had been effective but then added: \"As to what might happen in the long-term future, it's just not appropriate to speculate today. But we are continuing to work with our partners and allies to ensure that the response is prudent, proportionate and effective.\"\n\nShortly afterwards, in an interview with Sky News, Defence Minister Kevin Andrews was asked twice about boots on the ground. The first time, he did not directly answer the question but when asked a second time he said: \"We're not contemplating boots on the ground.\"\n\nIt is highly unlikely that Australia could consider putting combat troops into Iraq or Syria without a similar commitment from the United States. There has been no suggestion from Washington that the administration of President Barack Obama is considering such a move.\n\nWhen Mr Abbott was asked a year ago on Channel Seven's Sunrise program how far Australia would go in the battle against Islamic State, he replied: I certainly don't rule out further military involvement but I do rule out combat troops on the ground.\"\n\nHe has said repeatedly this year that the Iraqis do not want Western combat troops in their country and that such a move cannot be made without their consent.\n\nSending troops into Syria is even harder to contemplate as it could be regarded as an act of war by the regime of the dictator Bashar al-Assad.\n\nMr Andrews also revealed that RAAF Hornet jet fighters could go into Syria as far as Islamic State's de facto capital of Raqqa, about 200 kilometres across the border.\n\nBut he said they would not fly further than that into western Syria, where the Assad regime has air defences.\n\nFollow us on Twitter The story first appeared on The Sydney Morning Herald.", "source": "Bendigo Advertiser"}