{"published": "2015-09-01T14:36:45Z", "media-type": "News", "title": "The Latest: Greek Ferries Carry 4,000 Migrants to Mainland", "id": "c4f0897f-8bfa-4017-a8ef-c253e2a86ac4", "content": "The latest developments as tens of thousands of migrants flood into countries across Europe. All times local (CET): \n \n——— \n \n4:25 p.m. \n \nTwo ferries chartered by Greece are carrying more than 4,000 migrants from its overwhelmed eastern Aegean islands to the mainland. \n \nThe ferries are to arrive in Piraeus, the main port near Athens, later Tuesday night. The government began the ferry runs from islands such as Lesbos and Kos in mid-August due to a scarcity of tickets on regular ferries at the height of the summer tourist season. \n \nThousands of migrants have been stuck on the Greek islands, with families sleeping out in the open for days in streets and parks until they can get a ferry ticket to Piraeus. \n \nIn addition, Greece's coast guard says it rescued nearly 1,200 migrants from the sea off the islands in the last 24 hours. \n \n——— \n \n3:50 p.m. \n \nThe chief of Frontex, the European Union's border agency, says trafficking in fake Syrian passports has increased, notably in Turkey, creating a windfall for criminal gangs and a boon for migrants trying to get into Europe. \n \nFrontex chief Fabrice Leggeri said Tuesday that Syrians fleeing their country's civil war have the right to asylum in EU nations, making a Syrian passport very attractive. He told France's Europe 1 radio the situation is also \"extremely lucrative for criminal organizations.\" \n \nHe said those who purchase a fake Syrian passport are Arabic speaking, making them credible, but usually have a \"profile of an economic immigrant\" who, under European rules, would not receive asylum. \n \n——— \n \n3:10 p.m. \n \nThe fifth suspect in the deaths of 71 migrants found in a truck on the highway to Vienna last week has been placed under preliminary arrest for up to 30 days. \n \nThe court in the central Hungarian city of Kecskemet made the ruling Tuesday. \n \nThe 24-year-old Bulgarian man, along with three other Bulgarians and one Afghan already in custody, is suspected of cooperating in human trafficking. \n \nAuthorities say the migrants suffocated in the truck. Since then, both Austria and Hungary have stepped up efforts to crack down on possible smugglers. \n \n——— \n \n1:50 p.m. \n \nHungary, one of the hardest-hit nations in Europe's immigration crisis, says over 156,000 migrants have entered this year. \n \nThe Interior Ministry, which gave the numbers Tuesday, say around 142,000 people have requested asylum, including 45,000 migrants from Syria. \n \nHungarian officials have shut down the main international train station in Budapest, halting all trains Tuesday as police cleared out hundreds of migrants at the station. Chaos has ensued, with the migrants chanting \"Freedom! Freedom!\" and demanding to use the train tickets they bought to go to Austria and Germany. \n \nHungarian Prime Minister Viktor Orban will meet with top EU officials on Thursday in Brussels about the crisis, including EU Commission President Jean-Claude Juncker, EU Council President Donald Tusk , and European Parliament President Martin Schulz. \n \n——— \n \n1:40 p.m. \n \nThe European Court of Human Rights has upheld the case of three Tunisian migrants expelled from Italy in 2011 in the wake of the Arab Spring uprising. \n \nThe court ruled Tuesday they had been subjected to degrading and inhuman treatment during four days in an Italian detention center, suffered a collective expulsion and could not challenge their forced return home. The Strasbourg-based court ordered Italy to pay 10,000 euros ($11,215) in damages to each, plus more for costs. \n \nThe court said it took into account the overcrowding at the southern Italian island of Lampedusa as Tunisians and others — about 55,300 of them — fled their countries after the Tunisian revolution. Still, it said, there could be no skirting the prohibition against inhuman treatment. \n \n——— \n \n1:30 p.m. \n \nBavaria has opened Germany's first reception center meant to house only migrants from southeastern Europe, part of an effort to deal more quickly with people flooding in from the Balkans whose chances of being allowed to stay are minimal. \n \nThe center at a former barracks near Ingolstadt opened Tuesday and is meant to accommodate 500 migrants. The state's social affairs minister, Emilia Mueller, said authorities at the center will try to process asylum claims within six weeks. \n \nGermany has been trying to stem an influx of arrivals this year from countries such as Kosovo, Albania and Serbia, who have virtually no chance of being granted asylum \n \n——— \n \n12:55 p.m. \n \nThe small boy was lost, separated from his family in the chaos as police tried to clear out migrants from Budapest's main train station. \n \nLuckily Baba Mujhse, a Egyptian-Hungarian-Jewish volunteer helping migrants at the Keleti train terminal, was there to help Tuesday. \n \nThe 6-foot-6 Arabic-speaking textile designer held the boy in his arms as tried to calm scores of migrants who police banned from getting on the trains to Austria and Germany. The migrants had spent hundreds of euros (dollars) on the tickets but police say they did not have valid travel documents. \n \n\"This is crazy,\" Baba said as his eyes scanned the crowd in search of the young boy's family. \"This is not a solution to anything,\" he added, referring to the travel ban. \n \n——— \n \n12:40 p.m. \n \nCzech police detained an unusually large number of migrants — 214 — on trains coming from Hungary and Austria at the border town of Breclav on Monday night. \n \nThe migrants included 115 men, 38 women and 61 children, mostly from Syria, most on a train heading from Budapest to Berlin. \n \nPolice spokeswoman Katerina Rendlova said most of the migrants didn't have proper documents, including permission to enter Czech territory, so they were detained and will be sent to the country's migrant centers. \n \n———— \n \n12:30 p.m. \n \nSpain's conservative prime minister says his country is open to spreading out arriving refugees among the European Union's 28 nations, but isn't committing to take in more than the 2,739 it already has pledged to accept. \n \nPrime Minister Mariano Rajoy spoke Tuesday after meeting German Chancellor Angela Merkel, whose country has taken more migrants than any other EU country and wants quotas to spread them out more evenly. Germany expects 800,000 migrants this year. \n \nRajoy said there can be no progress on the migrant dilemma until better migrant processing centers are built in Greece and Italy. Asked whether Madrid would accept compulsory migrant quotas, he said \"we want to see the criteria,\" which should include factors such as a country's unemployment rate. \n \n——— \n \n12:20 p.m. \n \nMohammed, a 24-year-old economist from the Syrian city of Aleppo, says the chaos at Budapest's Keleti train station is the worst he has seen since leaving Syria. \n \nHungary on Tuesday suspended all rail traffic from that station and cleared it of hundreds of migrants trying to board trains for Austria and Germany after scuffles broke out. \n \nMohammed said he bought a ticket to Munich for 200 euros ($225) after Hungarian police told him Monday night that they would be allowed to leave. Despite showing a Syrian passport to police guarding the platform, they told him Tuesday he could not go through because he did not have a visa for Germany. \n \nHe refused to give his last name to an AP reporter because of concerns about his family still in Aleppo. \n \n——— \n \n12 noon \n \nTensions are flaring once again at Greece's northern border with Macedonia, where about 1,500 migrants are waiting to cross the border and head north toward the more prosperous European Union countries. \n \nFights and scuffles broke out Tuesday among the crowd near the Greek village of Idomeni when hundreds of people, mainly from Afghanistan and Pakistan, attempted to rush the border being guarded by Macedonian police. \n \nMacedonian authorities have been allowing small groups to cross at a time and head to the Gevgelija train station. Last month, Macedonian authorities briefly halted all crossings and used stun grenades and batons to push back the crowd. \n \n——— \n \n11:45 a.m. \n \nChancellor Angela Merkel says Germany isn't to blame for the stream of Syrian refugees in Hungary trying to board trains headed for Germany. \n \nHungary's government has pinpointed Germany's \"more flexible attitude\" toward Syrians as a problem that encourages migration. German authorities have advised officials not to send Syrians back to the first European Union country where they arrived, as EU rules stipulate. \n \nMerkel said Tuesday that Syrians do have a high chance of getting asylum but \"that should be no surprise ... and should actually be similar in every European country.\" \n \nMerkel said \"the current rules are clearly not being practiced.\" She said the answer is a common European asylum policy with a \"fair distribution\" of refugees across the 28-nation EU. \n \n——— \n \n11:20 a.m. \n \nHungary has suspended all rail traffic from its main terminal in Budapest and cleared the train station of hundreds of migrants trying to board trains for Austria and Germany after scuffles broke out where a train was to leave for Vienna and Munich. \n \nMigrants chanting \"Freedom! Freedom!\" congregated outside the station after being pushed out. \n \nPolice acted after authorities announced over station loudspeakers that all trains would be stopped from leaving for an indefinite period. Scores of locals, tourists and migrants with travel documents and tickets remained in the cavernous station, some staring at information boards still showing arrival and departure times. \n \n——— \n \n10:55 a.m. \n \nUNICEF says the number of women and children fleeing through Macedonia has tripled in the past three months. \n \nThe U.N.'s children's agency said Tuesday some 3,000 people are passing daily through the former Yugoslav republic — and roughly one in eight is a pregnant woman. Citing Macedonian figures, UNICEF says four out of five of the migrants come from Syria. \n \nSince June, more than 52,000 people have been registered in the town of Gevgelija on the Greek border. The agency says it is dispatching sending water and huge tents to Skopje, the Macedonian capital. \n \n——— \n \n10:45 a.m. \n \nGreece's coast guard says it has rescued nearly 1,200 migrants from the sea off its eastern Aegean islands in a single day, as the flood of people fleeing war and poverty to seek shelter in the European Union continues unabated. \n \nThe coast guard said Tuesday it had picked up 1,192 people in 31 separate search-and-rescue operations from Monday morning to Tuesday morning off the islands of Lesbos, Chios, Samos, Agathonissi, Farmakonissi, Kos and Megisti. That number is significantly higher than the average of late, which is usually in the hundreds. \n \nThe numbers do not include hundreds more who reach the islands themselves from the nearby Turkish coast each day, usually in overloaded inflatable dinghies.", "source": "ABC News"}