{"published": "2015-09-05T10:21:00Z", "media-type": "News", "title": "Carrera notches first win at Meadowcreek", "id": "756a3d1e-2174-49a2-8e44-c01df87d2f0c", "content": "NORCROSS — The Meadowcreek Mustangs opened their home schedule in style with a 43-18 win on Friday over Rockdale, giving head coach Jason Carrera a victory in his home debut, even though the teams had to wait a little longer than expected to get started. \n \nThe initial kickoff at Meadowcreek was delayed by one hour because of lightning in the area, but the Mustang offense quickly began a productive night that gave them a lead of at least eight points for the bulk of the final three quarters. \n \n“It feels great,” said Carrera, who earned his first win in his second game as the Mustangs’ head coach. “I want this to be the norm here. The kids deserve it.” \n \nRockdale (1-2) scored on its opening drive to take a 6-0 lead with 10 minutes, 13 seconds left in the first quarter, but Meadowcreek (1-1) answered with a score of its own fewer than six minutes later when Mustangs quarterback Darion Hammons, in his third game at the position, capped a nine-play drive with a quarterback sneak from the 1-yard line. \n \nKicker Michael Mendez converted the extra point to give Meadowcreek a 7-6 lead, and the Mustangs did not trail the rest of the way. \n \nTwo TD passes and another rushing score in the second quarter by Hammons gave them a 28-12 lead by halftime. \n \nRockdale closed to within 10 points of Meadowcreek’s lead midway through the third quarter when Tajee Steele scored on a 1-yard rush. However, the Mustangs held Rockdale scoreless on 50 yards of offense in its final four drives to preserve the victory. \n \nHammons led the way for the Meadcreek offense with three rushing and passing TDs each. He was 13-for-17 passing with 153 yards, and he rushed for 153 yards on 20 attempts, leading all players in each category. \n \nTwo of Hammons’ TD passes went to wide receiver Shadiah Toppin, who caught three passes total for 56 yards. Terrence Newborn Jr. caught the other pass, a 22-yard score with 10 seconds left before halftime that gave Meadowcreek a 28-12 lead as the teams entered their respective locker rooms. Newborn finished with three catches for 67 yards. \n \nThe Mustangs defense held Rockdale to 146 yards of total offense, and Bulldogs quarterback Datrevis Shorter went 10-for-25 passing with 111 yards and a TD pass. Rockdale defender Jermaine McSween recovered a fumble when Hammons tried to throw a lateral pass, and he scored with 3:52 left in the second quarter that briefly narrowed the score to 20-12. \n \nMEADOWCREEK 43, ROCKDALE 18 \n \nRockdale 6 6 6 0 - 18 \n \nMeadowcreek 7 21 0 15 - 43 \n \nFIRST QUARTER \n \nRockdale: Tajee Steele 42 pass from Datrevis Shorter (kick missed) 10:13 \n \nMeadowcreek: Darion Hammons 1 run (Michael Mendoza kick) 4:29 \n \nSECOND QUARTER \n \nMeadowcreek: Shadiah Toppin 15 pass from Hammons (Mendoza kick) 9:41 \n \nMeadowcreek: Hammons 15 run (kick blocked) 5:56 \n \nRockdale: Jermaine McSween fumble return (run failed) 3:52 \n \nMeadowcreek: Terrence Newborn Jr. 22 pass from Hammons (Qu’vella Calhoun run) 0:10 \n \nTHIRD QUARTER \n \nRockdale: Steele 1 run (pass failed) 7:31 \n \nFOURTH QUARTER \n \nMeadowcreek: Toppin 22 pass from Hammons (Hammons run) 8:38 \n \nMeadowcreek: Hammons 1 run (Mendez kick) 3:07 \n \nRD MC \n \nFirst downs: 6 12 \n \nRushes-yards: 13-35 35-199 \n \nPassing-yards: 25-111 19-162 \n \nComp-Att-INT: 10-25-0 13-19-0 \n \nFumbles lost: 0 1 \n \nPenalties-yards: 11-98 12-109 \n \nINDIVIDUAL STATISTICS \n \nRUSHING – Rockdale: Datrevis Shorter 3-22, Aaron Harris 4-8, Tajee Steele 4-8; Meadowcreek: Darion Hammons 20-123, Qu’vella Calhoun 7-46. \n \nPASSING – Rockdale: Shorter 25-111; Meadowcreek: Hammons 19-162. \n \nRECEIVING – Rockdale: Steele 3-25, Cameron Turner 2-21, Jacari Cameron 3-26; Meadowcreek Shadaiah Toppin 3-56, Terrence Newborn Jr. 3-67. \n \nstory created on Saturday 9/5/2015 at 12:13:41 am by Christine Troyke \n \nstory modified on Saturday 9/5/2015 at 12:47:42 am by Christine Troyke", "source": "Newton Citizen"}