{"published": "2015-09-11T02:54:36Z", "media-type": "News", "title": "Vietnam's oil output seen rising 4.6%", "id": "33b54601-97db-41c4-8659-d94855ca25d4", "content": "The country's crude oil exploitation output this year is estimated to reach 17.58 million tonnes, up 4.6 per cent against the government's annual target, according to the Ministry of Planning and Investment (MPI). \n\nThe ministry also made a forecast that the crude oil output next year would decline to 16.03 million tonnes, a fall of 8.8 % against this year's figure.\n\nDespite the rise in output, crude oil exports will contribute less to the State budget next time than in the previous years since prices fell sharply in the world market. The export price of crude oil, which contributes roughly 10 % to the total State budget revenue, in the first eight months of the year averaged only US$60 per barrel while the State budget estimates were approved on the basis of the then projected crude oil price of $100 per barrel.\n\nAccording to a forecast by the International Monetary Fund (IMF), oil price in Q3 this year will hover around US$48.16 per barrel after inching up to US$49.16 in Q4 this year.\n\nThe average price will be $51 per barrel this year and $50.36 next year.\n\nAccording to Luong Van Khoi, head of the Centre for Socio-Economic Information and Forecast's World Economic Department under the Ministry of Planning and Investment, world oil prices will depend on the market supply and demand sources while chances of global economic recovery remain slim.\n\nStatistics from the Ministry of Finance showed that the country's revenue from crude oil exports in the first eight months of this year dropped by more than 34 % against the same period last year to only VND47.1 trillion ($2.09 billion).\n\nHot and cold\n\nHowever, experts said the crude oil price reduction in the global market would have both negative and positive effect on Vietnam's economy.\n\nAccording to Khoi, if oil price stays at US$50 per barrel and the devaluation of China's yuan and Vietnam's dong stays at 3 % each, Vietnam's economic growth will be up by 0.03 percentage points this year. Exports will also rise by 0.2 percentage points while imports will drop by 0.08 percentage points this year.However, the country's economic growth will come down by 0.15 percentage points next year, Khoi estimated. In case oil is priced at $40 per barrel and the devaluation of the yuan and the dong is also at 3 %, Vietnam's economic growth will be reduced by 0.45 percentage points this year and 0.58 percentage points next year, Khoi said, adding that the State budget revenue will be cut by VND2 trillion ($88.88 million) this year and VND13 trillion ($577.77 million) in 2016 as per these projections.\n\nHowever, Khoi said, if Vietnam can capitalise on opportunities from the oil price reduction to boost its domestic production by helping local producers cut input costs, revenue from corporate income tax will increase significantly, thus offsetting losses from reduced crude oil export revenue.\n\nIf the country can do that, Khoi said, Vietnam's economic growth would fall by only 0.03 percentage points this year before adding 0.34 percentage points next year.\n\nIn fact, the State budget revenue from local sources increased sharply in the first eight months, reaching VND459.45 trillion ($20.42 billion), up 16.5 % against the same period last year.\n\nAccording to Khoi, if oil prices hovered around $30 per barrel and the devaluation of the yuan and the dong is at 3 %, Vietnam's economic growth this year will drop by 0.95 percentage points, while next year it will drop by 1.08 percentage points. In this case, Vietnam's economy will also fall into a deflation with a rate of -0.3 % in 2015 and -0.6 % in 2016.\n\nThe State budget revenue in this case will also be reduced by VND5 trillion ($222.22 million) in 2015 and VND25 trillion ($1.11 billion) in 2016, Khoi said.\n\nHowever, economic growth will come down by only 0.02 percentage points in 2015 and then rise by 0.26 percentage points in 2016 if the country can capitalise on falling oil prices, Khoi estimates. \n\nVNS", "source": "VietNamNet Bridge"}