{"published": "2015-09-07T17:54:45Z", "media-type": "Blog", "title": "SoftLanding launches enterprise content management solution for IBM i users", "id": "f3779a3b-23c2-4fe6-b7c2-c938efabee73", "content": "Provides a fast, cost-effective way to transform content from IBM i applications for web, mobile and email \n \nPETERBOROUGH, NH – September 7, 2015 – SoftLanding® Systems, the IBM i software division of UNICOM® Global, today announced the launch of an enterprise content management solution that quickly transforms existing system output from IBM i business applications to work with digital channels such as the web, mobile and email. \n \nThe Columbus software, developed by Macro 4, the specialist document management division of UNICOM Global, is now available for the IBM i platform as part of the SoftLanding solution portfolio. \n \nColumbus unlocks access to a wide variety of business content to improve service, raise productivity and enhance collaboration. The software can be implemented on IBM Power Systems running IBM i, AIX or Linux, without disrupting existing IT systems or applications and requires no specialist development skills. With Columbus, IBM i users can have new digital initiatives up and running in a matter of weeks. \n \n“Many enterprises find adapting core business applications to work with new digital channels highly complex and time consuming,” said Jim Fisher, SoftLanding Operations Manager. “Through Columbus, we now offer a simpler, more cost-effective approach that involves no changes to your IT systems or IBM i applications. The software transforms your existing output – including spool and data files – into new, enhanced digital formats to support initiatives such as eInvoicing and customer self-service, without impacting on existing operations.” \n \nColumbus is a system that takes output from existing applications, automatically transforms it into new digital formats – with the ability to enhance the look of newly formatted documents – and presents it within an in-built online portal. The portal permits secure web and mobile access for an organization’s internal staff, customers and business partners. \n \n“Using Columbus, you can web enable existing invoices, statements and delivery notes for eInvoicing, for example, without having to overhaul the existing IBM i finance applications,” said Fisher. “To improve customer service, a wide range of customer documents can be made accessible online – both to internal staff, and externally to support customer self-service. Business reports and ERP documents can also be turned into new digital formats, allowing wider access to enterprise information both to improve collaboration and to help streamline processes.” \n \nVisitors to the International i-Power Conference (in the UK on 9-10 September 2015) will be able to see demonstrations of the Columbus software on the SoftLanding Systems stand. \n \nMore information about Columbus for IBM i users can be found on the SoftLanding website. \n \nSoftLanding’s IBM i products and solutions are commercially available through UNICOM Global’s UNICOM Systems and Macro 4 divisions. For additional product information please visit www.softlanding.com.", "source": "Press Releases & News"}