{"published": "2015-09-06T10:00:00Z", "media-type": "Blog", "title": "For Hollywood, the road to China is littered with broken deals", "id": "ffa641b8-faf9-4ea2-94ba-bae9cac318f4", "content": "Hollywood talent agent Jeff Berg flew to Shanghai last summer to celebrate one of his biggest deals — a partnership with Chinese investors in Resolution, his new agency in Century City.\nTwo hundred business executives, government officials, actors and journalists gathered at the swank Hotel Shangri-La to mark the occasion. Celebrities posed for photographs. Guests dined on roast duck, fish and other dishes as a giant digital screen displayed the companies' logos.\nFour months later, the deal collapsed. The millions of dollars promised by Bison Capital never materialized, and Berg was forced to shut the agency down.\nSIGN UP for the free Indie Focus movies newsletter >>\nAs Hollywood increasingly looks to China as the new frontier, Berg's experience serves as a cautionary tale. See the most-read stories this hour Open link While the entertainment industry eyes China as a source of capital and customers, interests there often approach the relationship with a very different agenda, according to studio executives and others who have sought partnerships in China.\nSome investors are more interested in appearing to be in business with Hollywood than in putting serious money into deals, these people say — to boost their stock prices or profiles. (American studios also like to be seen to be doing deals in China.)\nIn other cases, entertainment industry leaders say, Chinese companies are looking to learn strategies and techniques to make their own film industry a stronger competitor. \"Making money is not necessarily the most important thing right now — it's to learn the industry. Because most people in China will tell you there isn't an industry the way there is in Hollywood,\" said Stanley Rosen, a political science professor at USC and an expert on China. \"They want to learn everything they can about the business until they don't need you anymore.\"\nWhatever the reasons, Hollywood executives have learned to greet news of a partnership with China with a healthy degree of skepticism.\n\"In many cases, there is a mutual interest in making a public announcement about a deal, whether or not it winds up happening,\" said Marc Ganis, co-founder and managing director of Jiaflix Enterprises, which helps studios distribute movies in China. \"The batting average of deals has not been great.\"\nAmong the notable strikeouts: • Beijing-based film company Huayi Bros. Media Corp. announced last year that it had agreed to invest as much as $150 million in Studio 8, the production company launched by former Warner Bros. executive Jeff Robinov. But the sides couldn't come to terms, and the partnership never materialized. Shanghai-based conglomerate Fosun International later signed a deal to invest in Robinov's company.\n• Legendary Pictures Chairman Thomas Tull announced in June 2011 that he was forming a joint venture with Huayi to co-produce movies in China. Six months later, the companies parted ways. Hull and his partners grew alarmed when Huayi's executives wanted to renegotiate terms of the deal, increasing its ownership stake from 10% to 25%, said one person with knowledge of the matter. Huayi later teamed up with Burbank-based STX Entertainment. cComments Got something to say? Start the conversation and be the first to comment. Add a comment 0 • Last year, two Hong Kong firms, I-Marker and China Railsmedia, announced they were collaborating with a state-backed entity to provide import and distribution licenses to overseas movie companies. The new operation was to have been run by Chris Lee, former head of production for Columbia Pictures. Shares in China Railsmedia soared 260% in the three months following the initial announcement, but government officials later claimed they had no knowledge of the plan, which died.\nThe failures come at a time of much closer ties between Hollywood and China, where the appetite for movies is so strong that it is poised to become the world's largest film market by 2018.\nBut as the sides meet more frequently, cultural differences are exposed.\nContracts are more fluid in China, and serious negotiations often happen only after deals are signed — and publicly announced. Deals aren't fixed but are continuously reevaluated, sometimes on a daily basis.\n\"In the U.S., if somebody signs a contract for three years, you expect it to last 1,095 days,\" Ganis said. \"In China, it's essentially 1,095 one-day deals.\"\nGanis — who co-founded Jiaflix with his cousin, Sid Ganis, the former president of Paramount Pictures, and Kenneth Huang — speaks from experience. Days before last summer's release of \"Transformers: Age of Extinction,\" Chinese developers accused Paramount and Jiaflix of breaking a $1.6-million agreement to feature a Beijing hotel, mall and office complex called Pangu Plaza in the film.\nAt a news conference, Pangu Chief Executive Lu Tao said he had been \"cheated\" by his American partners and threatened to ask Chinese regulators to block the release of \"Transformers.\"\n\"We had a contract with them that was signed at the Shanghai Film Festival,\" Ganis said. \"As we were about to release the movie, they pop up and say: 'There's another contract,' one that was never signed and that was never part of any agreement. …This was a classic shakedown effort.\"\nThe dispute ended after Paramount Vice Chairman Rob Moore and director Michael Bay flew to China to smooth things over. They organized a Beijing premiere of the film and moved a replica of the Bumblebee Transformer to the entry of the dragon-shaped Pangu hotel.\nSome problems, however, are not so easily solved.\nConsider the case of Digital Media Group, which produces entertainment and digital ads for billboards and subways throughout China.\nIn Jan. 2010, the principal owners — American private equity firm Oak Investment Partners and Gobi Partners, a venture capital firm based in Shanghai — sold DMG to a larger publicly traded ad firm called VisionChina Media. VisionChina agreed to buy DMG for $100 million in cash and common stock up front, and then pay two installments of $30 million over the next two years.\nJust before the first payment was due, VisionChina filed suit in New York state court, alleging DMG's owners had provided misleading information about its finances. Oak Investment and Gobi countersued for breach for contract.\nA judge dismissed VisionChina's claim and ordered it to pay the first $30 million.\nVisionChina's attorneys argued the firm couldn't transfer funds because China's foreign exchange regulators wouldn't allow it. Ultimately, a confidential settlement was reached. VisionChina declined to comment.\nDan Bergeson, a San Jose-based attorney who represented DMG's former shareholders, said that it's \"very, very difficult to obtain satisfaction of a U.S. judgment against entities in China. They could say: 'If you come over here, Chinese courts do not recognize U.S. judgments.'\"\nThe deal between Berg's Resolution and Beijing's Bison Capital also capsized over money that never arrived.\nBerg launched the agency in January 2013, and before long he was employing more than 30 agents and representing Chinese stars including Michelle Yeoh and Gong Li. A few months later, Jack Gao — a former head of Microsoft China who had moved on to Bison, a privately held investment firm — contacted Berg and proposed a partnership. The idea was appealing to Berg, who had done business before in China and was looking to expand his latest venture.\nResolution and Bison signed a contract in February 2014 that gave the investors an equity stake in exchange for an investment of approximately $15 million. But monthly payments from Bison arrived late or were for amounts smaller than what Berg was counting on, according to people familiar with the matters who were not authorized to discuss the issue publicly. Berg declined to comment.\nThat June, Berg flew to Shanghai for the partnership celebration and was reassured by Gao and other Bison executives that all was well.\nAfter he returned to Los Angeles, Bison continued to delay making payments and Berg became increasingly alarmed. He tried for two weeks to call Gao but got no response.\n\"Jack Gao vanished,\" said one person close to Resolution who was not authorized to discuss the matter. \"It was like a black hole.\" Berg learned that Gao had been replaced at Bison by another Beijing executive, who wanted Berg to spend more of his own money on Resolution.\nBy early October, Berg decided to close the company.\nA representative for Gao, who had taken a job at a Chinese real estate and entertainment conglomerate, said he was not available for comment.\nDespite the challenges, American studios and producers can't afford to ignore China, where the box-office potential can even rescue films that do poorly in the U.S. One example of that was Paramount's recent \"Terminator Genysis,\" which flopped domestically but made $27 million on its opening day in China. Their [market] still has huge, huge growth. You have a middle class in China that is bigger than the entire U.S. population. - Jeffrey Katzenberg\n\"We're a mature market,\" said Jeffrey Katzenberg, chief executive of DreamWorks Animation, which operates a studio in Shanghai through a joint venture. \"Theirs still has huge, huge growth. You have a middle class in China that is bigger than the entire U.S. population.\"\nAmerican executives are keenly aware, however, that prospective Chinese partners may be more interested in tapping Hollywood for its expertise in order to better compete in the global market for blockbuster films.\nThe Chinese government has employed a similar strategy in areas like information technology and aircraft manufacturing, and expanding its film industry is a major objective of the Communist Party leadership under President Xi Jinping.\nChina lacks deep experience in marketing and distributing films, recruiting talent, selling merchandise, licensing TV rights and other nuts and bolts of the movie business. So teaming up with experienced U.S. filmmakers and studios can help narrow the knowledge gap.\n\"The thing that China is committed to is building its own industry,\" Katzenberg said. \"It's always been the China way. They are there to win.\"\nrichard.verrier@latimes.com\nTwitter: @rverrier cComments Got something to say? Start the conversation and be the first to comment. Add a comment 0 MORE REEL CHINA:\n'Jurassic World' drops to No. 3 at China box office\nMel Gibson, other Hollywood directors look to China market\nA monster resembling a radish shatters a box office record in China\nCopyright © 2015, Los Angeles Times", "source": "latimes.com - Los Angeles Times"}