{"published": "2015-09-19T22:46:54Z", "media-type": "Blog", "title": "RUNNERS UP, 2015", "id": "48e15f37-4a81-4fbd-b6ef-0ac057e7b238", "content": "It was the Grand Final the All Stars basketball team should never have reached. Over the last three weeks the team had expected to be knocked out each time and what happened? They had come out onto the court and dominated their rivals. For the first time in the club's history a team had gone all the way and there were players and families from across the club out in numbers to support the team. \n\nThe first quarter was inconclusive but the next two saw the team fall behind. Number ten from the opposition was unstoppable. Small in height he had enough body strength to muscle his way in and shoot and make the basket time after time. The opposition were a comfortable ten points ahead for much of the match but then, in the final quarter, the team started to score more freely and added eight points and the crowd started to lift. \"Lets' Go Defence Lets Go\" they screamed and there were loud cheers after the team repelled the offensive play of the opposition. The coach called a Time Out in the last ten seconds and the team attempted a play to tie the match but were unsuccessful. Despite driving into the key the ball was passed at the last minute but went off court. With three seconds left on the clock the opposition coach took a Time Out and when the ball was brought in it was in their offensive half. The whistle blew and it was all over. The crowd and team were still up and about, however, having made a contest of the match. The loss wasn't so tragic as a result and the boys held their held heads high.\n\"Phew I thought we were going to choke\" said number ten, the MVP for the match from the other team. The players embraced on the court and towards made their way to the area where the presentations were being made, They were asked to keep the speeches short but afterwards stayed to take photographs and were eventually asked to leave the area as the next two teams from another Grand Final arrived for their presentations. The evenness of the competition had been marveled at by both coaches. Both teams had had their ups and downs during the season and the fact that teams one to six had been knocked out of the finals and that teams seven and eight on the ladder had played each other in the Grand Final was seen as a great achievement by all.\nAt the celebration the following night there was lots of analysis of the game and the beer started to flow freely. The food trucks seemed few in number for the size of the crowd but the bar was well stocked and kept the crowd going with drinks. As it got dark there were more and more young people and less and less families. The players left their families to go and sit near the toilets to get away from all of the cigarette smoke. Back home the jungle drums started late into the night at the bar over the road.  An inspector from the council arrived to check their paperwork but the manager couldn't find any. At least he closed the window upstairs and muffled some of the noise. There was training next day for those players who were interested and try-outs scheduled for three weeks time.", "source": "LOSING THE PLOT"}