{"published": "2015-09-06T13:08:28Z", "media-type": "News", "title": "Region’s hoteliers first in line for Iran", "id": "72191d4e-d8c4-482f-8cf0-c8c1ab06b490", "content": "Sunday, September 6, 2015 by Hind Mustafa \n\r \r \r\n     \t\t\t\t\t\r \r\n \t\t\t\t\t\r \r \r \r \nA landscape view of Abyaneh village in Iran. \n  \r \r \r \r \r\n \t\t\t\t\t\t \t\t\t\t\t\r \r \r \r \r \r \r\n \t\t\t\t\t\t\r \r \r \r \r \r\n \t\t\t\t\t\r \r \nSince Iran signed the much-anticipated nuclear deal with six of the world’s powers last July, the world has been witnessing – and predicting – the consequences of this move on the regional and international economic scene. \n \nWhile the announcement has already been inked, the actual lifting of sanctions is expected to take place in early 2016. \n \nOil and gas was one of the first sectors to be impacted by the deal. In a one-year period, comprising the months leading up to and following the announcement, oil prices have dropped from more that $100 per barrel to nearly $45 today. \n \nThe drop shook the international oil markets and caused concerns to many, including Iran’s oil-exporting neighbours in the GCC, whose status in the market could be shaken when Iran’s huge oil and gas supply gushes through once the sanctions get lifted. \n \nApart from the oil and gas industry, however, businesses from the GCC and those operating in it, have welcomed the deal. \n \nIran – with its population of 77 million, is regarded as a huge untapped market, in need of investments of all kinds. \n \n“Iran is ready for infrastructure development. The country is hungry for investments and needs to build refineries, roads, hospitals, etc.,” says international sanctions lawyer Sarosh Zaiwalla, whose high profile clients include Bank Mellat, Bank Tejarat and Petropars. \n \nOne of the first non-oil sectors expected to penetrate the Iranian market and be among the first beneficiaries is real estate, especially hospitality . \n \n“According to industry sources, while there are more than 1,100 hotels in the country [Iran], only 130 properties belong to the 3- or 4-star segment and many of the existing hotels are in need of renovation and refurbishment. The cities definitely need more mid-market, business-friendly hotels,” Laurent A. Voivenel, CEO of Hotel Management Holdings (HMH) Hotel Group, tells Aficionado . \n \nHMH is a Dubai-based hotel management group that recently announced that it is exploring opportunities for long-term partnerships in Iran. \n \n“We are already in serious talks with various developers and will be soon visiting the country to take our discussions forward,” Voivenel says. \n \nHMH was founded in 2003 and currently operates several hotel brands in different market segments across 15 cities in the MENA region. \n \nOne of HMH’s unique aspects is offering a dry (alcohol-free) environment, as none of the hotels managed by the group offer any alcohol to the guests, a feature that would suit Iran’s conservative system. \n \n“Being a pioneer in creating the first and ‘still the only’ alcohol-free chain of hotels in the Middle East, HMH is the region’s largest group to operate in the dry segment,” Viovenel says. \n \n“Today, we are the strongest player in the ‘halal-friendly’ segment in the Middle East and North Africa and hold 50 percent [of the region’s] market share in the segment,” he adds, explaining that there are only a handful of operators in the dry segment, but HMH is a market leader. \n \nBesides the obvious need for business -friendly hotels to host the volumes of business delegates visiting the country, the Iranian government is focused on a tourism boom as well. \n \nIran’s government has reportedly set a goal of attracting 20 million tourists by 2025. The country has a wide array of cultural and religious tourism attractions. Some of these are UNESCO World Heritage sites such as the Meidan Imam and Persian Garden in Esfahan, the Golestan Palace in Tehran, and the Persepolis near Shiraz, among several others. \n \n“Tehran, Esfahan, Persepolis, Mashhad and Shiraz are some of the cities we are looking at currently,” Voivenel notes. \n \n‘Unknown territory’ \n \nInternational and regional hotel brands of different segments, such as Jumeirah Group, have vaguely spoken about their interest in the Iranian market, with no plans or projects being officially announced \n \nAficionado has sent inquiries to numerous hospitality brands, asking about their potential plans for Iran, but we have not received a definitive response. \n \n“With a long economic and political embargo, Iran is no doubt an unknown territory for many businesses and brands,” Viovenel says. \n \nIt may be this mystery surrounding Iran’s market dynamics that made most businesses hesitant to announce their plans. \n \n“The first thing the country needs is to have a proper legal and arbitration system, because any investor who brings money to a new country wants to make sure his investment is safe,” Zaiwalla notes. \n \n“Therefore, it is imperative to have an international arbitration system, with an independent tribunal. Iran will have to change its laws to make sure that an arbitration awarded against a party in Iran is enforced by courts in the country,” he adds. \n \nHowever, this was not the case with HMH. “We at HMH believe that Iran is a very safe destination that holds excellent business and tourism opportunities. Assuming that there are no major turnarounds on the existing nuclear deal, it will certainly flourish as a country and emerge as an economic power,” Viovenel concludes. \n\r \r \r\n \t\t\t\t\t\r \r \r \r \nShare This Article \r \r \r \r \r \r \r \r \r\n \t\t\t\t\t\r\n \t\t\t\t\t \t\t\t\t\t\r\n \t\t\t\t\t\r\n \t\t\t\t\t\r \r\n \t\t\t\t\t\r \r \ntags \n\r \nDubai Esfahan hospitality hotel Iran Jumeirah Group Jumeirah Hospitality luxury hospitaltiy tourism \n \r\n \t\t\t\t\t\r \r \n\n\r\n \t\t\t\t\t\t\r \r \n \n\r Tommy Hilfiger launches Fall/Winter collection in Middle East \r \nRead More \n\r \r\n \t\t\t\t\t\t\t\r \r \r \r\n \t\t\t\t\t \t\t\t\t\t\r\n \t\t\t\t\t \t\t\t\t\t\r \r\n \t\t\t\t\t\r\n \t\t\t\t\t\r \r \r More On Business \r \r \r \r  BASELWORLD OPENS \r \nRead More \n\r \r \r \r \r  New iMac launches in UAE \r \nRead More \n\r \r \r \r \r  Independents find niche in a difficult Swiss watches market \r \nRead More \n\r \r \r    \r \r  Finding opportunity in struggling Puerto Rico hotels \r \nRead More \n\r \r \r \r \r  Samsung struggles with Chinese suppliers \r \nRead More \n\r \r \r \r \r  Arab Luxury World 2014: Innovation drives luxury in the Middle East \r \nRead More \n\r \r \r \r \r  Apple Unveils iOS 7 \r \nRead More \n\r \r \r   \r \r \nRead More On Business", "source": "Aficionado"}