{"published": "2015-09-24T14:06:02Z", "media-type": "News", "title": "WATCH LIVE: Pope Francis delivers historic speech to Congress", "id": "a723bc65-2c0f-4042-98d4-6c85509ddb55", "content": "WASHINGTON — Pope Francis is on Capitol Hill to make history Thursday by becoming the first pontiff to address a joint meeting of Congress in a speech that’s expected to challenge lawmakers on some of the most divisive issues in American politics. \n \nIn another gesture designed to make politicians uncomfortable, Francis won’t follow his speech with a lavish meal with lawmakers. Instead, he’ll go directly to a lunch with homeless people helped by Catholic charities. \n \nOn the third day of his visit to the United States, Francis, the first Jesuit pope, is expected to return to themes contained in his blunt address on the South Lawn of the White House on Wednesday, in which he tackled climate change, immigration, the need to respect religious liberty and President Barack Obama’s opening to Cuba. \n \nMany of his views will likely clash with the entrenched partisan positions on Capitol Hill, where Republicans control both the House and the Senate. But he could put Democrats on the spot as well if he weighs in on abortion — an issue that will come up for a vote in the Senate later Thursday — and if he calls for traditional marriage to be protected. \n \nFrancis emerged from the residence of the Vatican’s ambassador to Washington on Thursday morning and greeted well wishers, including large numbers of children, waiting outside, before climbing into his now familiar Fiat hatchback car to travel to the U.S. Capitol. \n \nHe was greeted by Republican House Speaker John Boehner, a practicing Catholic, who was seen pacing in his office as he waited for the Pope. The Speaker greeted the pontiff with the words “Your Holiness, welcome.” \n \nLawmakers were already gathering in the House of Representatives to hear how directly he would address contentious political issues. The Argentine-born Pope introduced himself Wednesday at the White House as the “son of an immigrant family,” making clear his deep personal connection to an issue that has opened up bitter fault lines in the 2016 presidential race and within the Republican Party. \n \nFrancis will give his speech from the House of Representatives, with Boehner and Vice President Joe Biden sitting behind him. Francis is expected to greet crowds following an appearance on the Speaker’s Balcony. \n \nChief Justice John Roberts, a devout Catholic, will attend the address, as will Supreme Court Justices Anthony Kennedy and Sonia Sotomayor, who also are Catholic. Ruth Bader Ginsburg, who is Jewish, will be in the audience, too. \n \nRepublican presidential candidates Ben Carson and New Jersey Gov. Chris Christie will also be in the House chamber. \n \nOn Wednesday, Francis signaled that he was ready to engage in politics as well as ministering to the Catholic Church’s 70 million U.S. believers. \n \nHe told Obama it was “encouraging” the President was committed to battling climate change, saying the planet was at a “critical moment in history.” \n \nHe also said that men and women of goodwill should redouble efforts to support the world’s most vulnerable people, in comments seen as pushing his vision of a more inclusive vision of global capitalism. \n \nBut in a sign of disagreement with the president, Francis also visited nuns belonging to the Little Sisters of the Poor order that is currently suing the Obama administration for requiring contraceptive coverage under the Affordable Care Act. \n \nFrancis will travel to New York late Thursday afternoon and will wrap up his six-day visit to the United States in Philadelphia on Sunday.", "source": "WTVR-TV"}