{"published": "2015-09-28T15:22:28Z", "media-type": "Blog", "title": "Meow the Jewels - It's real, and for a good cause", "id": "d650492f-6f79-4e48-ad33-c527bff1429a", "content": "El-P has recruited an all-star cast of producers* to help him deliver the album in its full feline glory. But first, we needed cats... Run the Jewels don't take themselves too seriously, because Meow the Jewels (playlist, NSFW lyrics) is really happening. You can download the remix album for free, or buy it in various formats, with all proceeds of the album will go to charities that benefit victims of police violence. * Featuring Lil Bub, Snoop Dogg, Maceo & Delonte, with remixes by Just Blaze, Zola Jesus, Geoff Barrow, Nick Hook, Prince Paul, BOOTS, Blood Diamonds, Little Shalimar, The Alchemist, Dan the Automator, and 3D of Massive Attack. \n\nIn case you missed the history of this oddity, Los Angeles Times wraps it up.\n\nRun the Jewels previously: \n- Got a style from the guts of the most irrational beast in the district (July 1, 2013) -- original Run the Jewels mixtape\n- The Price Is Alright (November 29, 2013) -- Exclaim!'s Top 10 Freeleases of 2013, with an honorable mention for RtJ\n- Run the Jewels Redux (October 24, 2014) -- the release of the second Run the Jewels album, which was the basis and source for Meow the Jewels (deleted post)\n- \"Abandon. Cultural immunity. I had a self.\" (December 11, 2014) -- A pair of articles, one tracing the evolution of rap's relationship with police, and a more personal look at how RUN-DMC and Parliament allowed a writer to embrace his African-American heritage\n- every generation has an action hero that's actually a villain (December 24, 2014) -- Killer Mike and El-P of hip-hop duo Run the Jewels discuss the enduring appeal of scumbag Steven Seagal\n- \"If I give up hope, you get another DC sniper\" (February 28, 2015) -- In The Guardian, Alexis Petridis interviews Killer Mike and El-P talking about Run the Jewels, their friendship and especially the show they did in Ferguson the night the grand jury declined to indict Darren Wilson for the murder of Michael Brown\n- \"I miss home before I even leave.\" (June 24, 2015) -- EL-P of Run The Jewels Interview With Mark Kozelek", "source": "MetaFilter"}