{"published": "2015-09-03T14:25:06Z", "media-type": "News", "title": "The Latest: Syrian boy's death hits Canadian vote campaign", "id": "a7e80911-fdb5-4246-9a74-25cae92c9b12", "content": "The latest Thursday on the European migrant crisis (all times GMT): \n\n--- \n\n1405 GMT \n\nTurkish President Recep Tayyip Erdogan has accused Western nations of indifference to the plight of refugees, saying they shared the blame for the deaths of migrants off the coast of Turkey. \n\nErdogan spoke Thursday, a day after 12 migrants drowned while trying to reach a Greek island. The dead included a 3-year-old boy whose body washed up on a Turkish beach, galvanizing a worldwide debate about migration. \n\nErdogan said: \"It's not just refugees who drown in the Mediterranean, it's humanity, humanity!\" \n\nHe said Turkey was hosting close to 2 million refugees, in contrast to about 200,000 in total being hosted by \"many times more\" prosperous Western countries. \n\n--- \n\n1350 GMT \n\nGerman Chancellor Angela Merkel has renewed her call for binding quotas to spread out tens of thousands of migrants among the European Union's 28 countries. \n\nDuring a visit to Switzerland, Merkel said she discussed the issue with French President Francois Hollande on Thursday morning. She said they agree that \"for those who need protection ... we need binding quotas within the European Union to share the task.\" \n\nShe stressed that a country's size and economic strength will be taken into account \"but otherwise we will not cope with this question.\" \n\nGermany has taken in more migrants than any other European Union country. It expects 800,000 new arrivals this year. \n\n--- \n\n1340 GMT \n\nGerman Chancellor Angela Merkel says the refugee influx \"is a problem that concerns us all in Europe\" and says her country is doing what is morally necessary. \n\nMerkel was asked Thursday during a visit to Switzerland whether she shared the Hungarian prime minister's opinion that the influx is Germany's problem. \n\nMerkel said: \"Germany is doing what is morally and legally necessary, no more and no less.\" She said Hungary is right to say that the EU's borders have to be better protected and migrants registered \"but of course that's not the end of it.\" \n\nShe added: \"There's also an obligation to give protection to those who deserve protection. And the Geneva Convention on refugees applies not just in Germany, but in every European member.\" \n\n--- \n\n1325 GMT \n\nGreece's caretaker government says its coast guard has been rescuing hundreds of migrants from the sea every day — sometimes over 1,000 in one day — despite a severe scarcity of resources. \n\nAlternate Economy Minister Christos Zois said Thursday that 36 percent of the Greek coast guard's 240 vessels were not operational, as were four of its seven aircraft. Only one of its six helicopters is able to fly. \n\nZois said the coast guard was facing difficulties finding funding and spare parts. \n\nGreece has been in the grip of a deep financial crisis for the past five years that has wiped out a quarter of its economy. Successive governments have imposed spending cuts across the board, leaving many state services struggling. \n\n-- \n\n1315 GMT: \n\nFinancially strapped Greece says it needs more than 1 billion euros ($1.1 billion) to deal with the current migrant crisis. \n\nThe estimate was given Thursday by the country's caretaker economy minister, Nikos Christodoulakis. Greece says it has seen over 230,000 migrants enter the country this year, most coming by sea to its eastern islands. \n\nHe said for now Greece is completing procedures to get money from nine different European funds, seeking 400 million euros ($445 million) from the asylum fund and 330 million euros ($367 million) from a fund for the poor. \n\n--- \n\n1300 GMT \n\nCanadian Immigration Minister Chris Alexander says the tragic photo of young Aylan Kurdi, a 3-year-old Syrian boy who drowned off the coast of Turkey along with his mother and brother \"broke hearts around the world.\" \n\nThe boy's aunt in Vancouver had applied to sponsor the family, but the application was rejected by Canadian authorities. \n\nAlexander says \"Like all Canadians, I was deeply saddened by that image and of the many other images of the plight of the Syrian and Iraqi migrants fleeing persecution at the hands of ISIS.\" \n\nHe said Canada has one of the most generous per capita immigration and refugee resettlement programs in the world, and was planning to accept 23,000 Iraqis refugees and 11,300 Syrians. \n\n--- \n\n1245 GMT \n\nCanada's immigration minister is suspending his re-election campaign to travel to Ottawa and look into why the Canada government rejected a request to take in the Syrian family whose mother and two young sons drowned this week trying to get to Europe. \n\nA senior government official said Chris Alexander's priority \"is to ascertain the facts of the case.\" \n\nThe photo of a 3-year-old boy who washed up on a beach in Turkey has galvanized a worldwide debate about migration. \n\nA Canadian legislator says he had submitted a request on behalf on the boys' aunt, who had wanted to bring the family to Canada, but was turned down by Canadian immigration officials. \n\n--- \n\n1235 GMT \n\nA senior ally of German Chancellor Angela Merkel is rejecting the Hungarian prime minister's assertion that the migrant influx is a German problem. \n\nPrime Minister Viktor Orban said the problem is Germany's because so many migrants want to go there. But in Berlin, Volker Kauder, the parliamentary caucus leader of Merkel's conservative bloc, noted that European Union rules say migrants are supposed to be registered in the first EU country where they arrive — and then stay there. \n\nKauder says \"where people want to go is one thing, but they are registered and they are supposed to stay where they arrive in a safe country in Europe.\" \n\n--- \n\n1200 GMT \n\nScuffles have broken out at the train station in the Hungarian town of Bicske between migrants and police in riot gear. \n\nSeveral hundred migrants excitedly packed into Thursday's first train leaving the Budapest train station, hoping to reach Austria. But when the train stopped on a police-packed platform at Bicske, which hosts a major refugee camp, disappointed migrants started chanting \"No camp!\" and refused to leave the train as police ordered. \n\nSeveral hundred migrants have remained on or beside the idling train at Bicske for hours. Police have distributed water, but many migrants have refused it or thrown it back, fearing it could contain sedatives. \n\nIn Budapest, thousands of migrants remain camped out at Keleti, the main train station. Few agreed to board another train to northwest Hungary, fearing they too will run into another wall of police. \n\n--- \n\n1135 GMT \n\nThe president of the 28-nation European Union is calling for countries to share the burden of taking in at least 100,000 asylum-seekers arriving in the nations hardest hit by the migrant influx: Greece, Italy and Hungary. \n\nEuropean Council President Donald Tusk said Thursday that the \"fair distribution of at least 100,000 migrants among the EU states is what in fact we need.\" \n\nHe warned if EU \"leaders do not demonstrate goodwill, solidarity will become an empty slogan and will be replaced by political blackmail, divisions and a new blame game.\" \n\nEU leaders promised in June to share 40,000 migrants arriving in Greece and Italy, but the controversial plan is at a standstill amid bickering over how people should be distributed. Many European nations are reluctant to take in more migrants. \n\n---- \n\n1125 GMT \n\nA Greek minister says over 230,000 migrants have arrived in Greece in the first eight months of this year, compared to roughly 17,500 in the same eight months last year. \n\nChristos Zois, the caretaker minister for the merchant marine, said 80 percent of those arriving were refugees. The migrant arrivals in just July and August alone surpassed 157,000, he said. \n\nThe country's caretaker government — in power until Greece holds an early election on Sept. 20 — is announcing immediate measures in order to tackle the refugee crisis that has overwhelmed its eastern Aegean islands and northern border with Macedonia. \n\nZois said authorities have received information that there could be millions more refugees waiting to cross toward Europe through Greece. The vast majority of refugees do not want to remain in financially stricken Greece and head north to more prosperous European countries. \n\n--- \n\n1110 GMT \n\nFrench President Francois Hollande is calling an emergency meeting of top government officials to address Europe's migrant crisis. \n\nAmong others, the meeting Thursday afternoon will include Prime Minister Manuel Valls, who earlier in the day had called for urgent solutions for Europe's migrant crisis. \n\nFrench public opinion appeared divided over the summer on whether to take in more migrants, but the government is under increasing pressure to help resolve the Europe-wide issue. \n\nGermany expects to take in over 800,000 asylum-seekers this year, the most in Europe, and Chancellor Angela Merkel has urged other EU nations to take in more migrants. \n\n---- \n\n1055 GMT \n\nTurkey's state-run news agency says police have detained four suspected human smugglers a day after 12 migrants drowned while trying to reach a Greek island. \n\nThe dead migrants included a 3-year-old boy whose body washed up on a beach, galvanizing a worldwide debate about migration. \n\nThe Anadolu Agency said organized crime police detained the suspects, including at least one Syrian citizen, on a beach on Turkey's Bodrum peninsula. They were sent to a court Thursday to face charges. Anadolu said the four were suspected of acting as intermediaries for illegal migrant crossings. \n\nThe 12 migrants drowned when two boats carrying them from Bodrum to the Greek island of Kos capsized on Wednesday. \n\n--- \n\n1045 GMT \n\nSerbia's prime minister has warned of \"huge problems\" with migrants once Hungary's deploys military on its southern border with Serbia as part of a bid to stem the influx — and urged the European Union to come up with a plan before that happens. \n\nPrime Minister Aleksander Vucic said Thursday that \"no one knows what will happen\" after Sept. 15, when Hungary's new measures against migrants and human traffickers take effect. \n\nVucic says Serbia is ready to share its part of the burden but \"we need to hear what would be that comprehensive solution.\" \n\n--- \n\n1030 GMT \n\nThe Czech Republic is releasing 230 Syrians who have been detained in migrant centers. The move comes a day after Czech authorities announced they no longer intended to prevent Syrians who had already claimed asylum in Hungary from traveling via its territory to Germany. \n\nThe Czechs previously had detained Syrian migrants, as well as those from other nations, for up to 42 days. The new policy could allow Syrian migrants to travel more freely to Berlin because the most direct Hungarian trains to Germany's capital pass through the Czech Republic. \n\nPolice spokeswoman Katerina Rendlova says the Syrians have seven days to leave the country. \n\n--- \n\n1000 GMT \n\nPrime Minister Viktor Orban says he plans to deploy the military as part of a crackdown on migrants and human traffickers in coming weeks and blames Germany for the influx through his country. \n\nArriving in Brussels for talks about the crisis, Orban said the Hungarian parliament is pushing through new measures \"that will create a new legal situation at the borders, even more strict than it was.\" \n\nAsked by The Associated Press whether the military will be deployed to defend Hungary's borders, he said: \"Yes.\" \n\nOrban said in Brussels that the migrant \"problem is not a European problem, the problem is a German problem, nobody would like to stay in Hungary.\" \n\n--- \n\n0900 GMT \n\nFrench Prime Minister Manuel Valls has tweeted the photo of the dead 3-year-old on the beach, writing: \"He had a name: Aylan Kurdi. Urgent to act. Urgent to have a European mobilization.\" \n\n--- \n\n0850 GMT \n\nCzech police say they have stopped marking the arms of migrants with numbers — a practice reminiscent of the Holocaust. \n\nPolice on Tuesday marked arms after they detained more than 200 people, mostly Syrians, in Breclav who arrived on trains from Hungary and Austria in Germany-bound trains. \n\nSpokeswoman Katerina Rendlova defended the practice, saying it was used in a chaotic situation to prevent children from being separated from mothers. Rendlova says police initially gave them the numbers on a piece of paper but the migrants threw them away. \n\nRendlova said Thursday police will use wristbands instead. \n\nKlara Holikova from the Association for Integration and Migration commended the change but said the major problem is that migrants are detained at all. \n\n--- \n\n0833 GMT \n\nGreece's coast guard says it has rescued hundreds of migrants or refugees at sea as they attempted to reach Greek islands clandestinely from the nearby Turkish coast. \n\nThe coast guard says it had picked up 751 people in 19 incidents between Wednesday morning and Thursday morning off the coasts of the islands of Lesbos, Samos, Agathonissi, Farmakonissi, Kalymnos and Symi. The figures do not include the hundreds more who reach the islands' shores each day. \n\nWith its massive coastline and proximity of its islands to the Turkish coast, Greece is the main point of entry into the European Union for a stream of people fleeing war and poverty in the Middle East, Africa and parts of Asia. \n\n--- \n\n0737 GMT \n\nMigrants poured into Budapest's Keleti rail station on Thursday as police stopped blocking its main entrance, piling into trains despite announcements that there was no service to Western Europe. \n\nHungary's railway company said it had suspended all direct trains from the Hungarian capital to western destinations. There was no immediate explanation from the government for the change in its policy.", "source": "Miami Herald"}