{"published": "2015-09-19T07:54:12Z", "media-type": "News", "title": "I gave my all, says retired Australian cricket captain Michael Clarke", "id": "10d176bc-21a0-4ab1-9f73-c47595d62c04", "content": "In the week when leadership has been the talking point around the nation former Australian captain Michael Clarke said he retired at the end of the Ashes satisfied he did everything expected from a leader. \n\nFollow SMH Sport on Twitter\n\nIn the week when leadership was the talking point around the nation, former Australian captain Michael Clarke said he retired at the end of the Ashes satisfied he did everything expected from a leader.\n\n\"I gave my all,\" said Clarke of the role described as the nation's second-most important job after the Prime Minister. \"I wouldn't swap anything, I would've loved to have finished with an Ashes series victory but it wasn't to be.\n\n\"You can only do your best, that's what [leadership] comes down to. If you do your best and it's not good enough, then it's not good enough. I think what you have to understand is you're accountable.\n\n\"For me, it was results. If we lost I always expected to be held accountable. You need to expect a few smacks in the mouth along the way but you have to get up.\"\n\nAs his successor Steve Smith prepares for his first series as skipper, Clarke - who led Australia to a World Cup victory over New Zealand earlier in the year - said the scrutiny failed to dampen his love for the job.\n\n\"It's an honour and privilege to be captain,\" he said. \"I know people say that when they get the opportunity but don't necessarily feel that at the end of their careers, but I do. I gave it everything I had and my teammates did the same.\"\n\nAs Australia's 43rd Test captain Clarke led Australia on 47 occasions, winning 24 Tests, losing 16 and drawing seven for a winning percentage of 51.06. While he is happy to allow others to \"dictate\" the successes and failings of his career, he is proud his players respected his approach.\n\n\"You need to be open and honest,\" he said. \"My decisions were never personal, they were always based on what was best for the team, and I think my teammates respected that.\n\n\"I never made it personal. I made it about the team and if someone didn't pull their weight and I didn't see it, I had good leadership in our group who'd pick that player up.\n\n\"I think that's really important in the Australian team, you work hard, you put the team first. That culture has stuck for a long time and must continue to stay there. You need good players around you because you can't do everything as captain - you need help and support and I was fortunate to have that.\"\n\nClarke, who admitted he didn't watch Australia play England during the recent one-day series, said he didn't enter the Ashes knowing it would be the last series of a career in which he played 115 Tests and 245 one-day internationals.\n\n\"My goal was to help Australia win [the World Cup and Ashes] and to make a decision after that, but unfortunately it didn't go to plan,\" he said. \"Whether I would've retired or not if we won, who knows? Win or lose, I think the result might have been the same ...\n\n\"Life doesn't feel too different other than I haven't had to pick up a bat. I didn't watch any of the one-day series in England but I'm obviously pleased the boys won that series.\n\n\"Retirement has sunk in. I thought about it long and hard before I made my decision and because I know I've made the right decision it feels fine.\n\n\"I want the boys to go to Bangladesh and enjoy success. There's plenty of talent in that team, it's just going to take them time to play together and build that camaraderie. I know Australian cricket is in good hands, there's always been talent in our domestic system.\"\n\nClarke, who has opened a coaching academy, will mentor and coach 40 young cricketers through a five-day live-in camp at Sydney's Scots College which starts on Sunday, and he vowed it won't be a holiday.\n\n\"It's five days of 6am until 7.30pm,\" he said. \"But it will provide a great insight into what it means – and takes - to play at the highest level.\" The story first appeared on The Sydney Morning Herald.", "source": "Northwest Tasmania Advocate"}