{"published": "2015-09-23T23:45:48Z", "media-type": "Blog", "title": "We Continue Our Fantastic Adventure!", "id": "e6e57be1-82bb-4bc4-9400-9604ed00c87a", "content": "Day two (Tuesday) of our trip was amazing! Each day we spend here, we can feel a piece of hearts being left behind. This morning we started the mudding process. After lunch, Red Bird's director, Earl too our team to the Senior Center to visit the elderly community that meet together twice a week, plus he gave us a scenic tour to have a home visit with a local lady..\rWe met Pansy at the Senior Center, who has connections with past WRCC teams. She overflowed with gratitude for everything Red Bird does for the seniors as well Clay County. Pansy is a young 85 year old sweetheart who beamed with pride as she showed us her quilting work. We couldn't resist her strong sales tactics, and purchased several handmade items to bring back home!\nAt the home of, Galin, we were able to visit with her and her grandchild. We instantly feel in love with this family. Her energy, kindness, and positive thoughts filled our hearts. This was an eye opening experience for our team to truly see how others live in such depressed/poor conditions in the U.S. Our team loved on them--knowing not to fix them; just love them. She proudly showed us the work Red Bird had done on her house and how much she loves each person involved in helping.\rDinner that night, our team had clean-up duty. 3 of the team met our cook, Gail, an Appalachia resident (pictured). She is beautiful! She shared her love for Red Bird--by being employed , she can make direct deposits to the dental clinic on campus for her much needed dental work. She expressed more than once her lack of confidence and beauty. However, all our team saw was her beauty shining through--even after working non-stop serving the 150+ volunteers for breakfast, lunch, and dinner!\nToday, we were reminded how BIG God is and how HIS PLANS always prevails. Over 90 years ago, six women prayed for a mission to come to this area in Kentucky. AND...this team of six women responded to God's nudge to go and Be The Light. We feel privileged to still be answering that small prayer!", "source": "Living on Mission"}