{"published": "2015-09-10T00:57:52Z", "media-type": "Blog", "title": "Blue Bell, Buzzards, and a Band: Labor Day in the Texas Hill Country", "id": "e312e64f-6350-49c3-85ad-731407f6da44", "content": "Our long national nightmare has ended\nOur Labor Day weekend had a definite theme: Hills, Heat, and Humidity. Three consecutive days of 100°+ temperatures were bad enough, but when you factored in the humidity levels (~90% in the mornings; >70% in the evenings), even the slightest physical activity entailed copious sweating. That didn't stop us from having a great time.\nWe elected to leave the bike at home, so we spent some time each day walking or running through the neighborhood. That's where the hills came into play. I keep telling myself that running over those hills without having a near-death experience is just a matter of acclimation, but I'm either deluded or acclimation will require more than a once- or twice-a-month effort. (I'm pretty sure both factors are legit.) Nevertheless, we persevered, because we like to eat.\nI didn't take any photos of the usually beautiful countryside because the drought has taken its toll on the landscape. Even the prickly pear pads are showing the effects of the lack of moisture. It's hard to conceive of how quickly the Hill Country transformed from a lush green, almost sub-tropical environment to a literal tinderbox of dead underbrush. In less than three months, the water level at Lake Travis has dropped more than three feet. The cloudy lining in this blue sky scenario is that rain is predicted for every day this week. Pray it happens.\nOne natural phenomenon in that area that isn't affected by the drought is the gathering of turkey vultures (or, as they're more affectionately known, buzzards) on the power line towers in the area. The birds begin gathering around dusk and spend the night perched on those towers. Walking near them is kind of eerie, in an Alfred Hitchcock sort of fashion. The birds are silent but never motionless, and you get the feeling that they're watching you carefully and if you stop moving for an instant, they'll assume you're road kill and swoop down for a bedtime snack.\n \nThese same towers are vacant the next morning, but the ground beneath them is littered with feathers, and reeks of...well, use your imagination.\nWe're always on the lookout for good opportunities to go dancing in the Hill Country, and this weekend was no exception. We continued our tour of the historic dance halls of Texas by visiting the Twin Sisters Hall located a few miles past Blanco on US Highway 281.\nTwin Sisters claims it's the oldest hall in Texas http://www.twinsistersdancehall.com/history/, opening to the public in 1870. It's worth noting that Greune Hall in New Braunfels makes a similar claim - qualifying it as the \"oldest continually operating dance hall\" as it opened in 1878. Regardless, Twin Sisters is certainly historic, and well-preserved. It also isn't air conditioned (here comes that second \"H\"...and also the third one). The interior has a fair number of box fans scattered around the interior, but they didn't begin to succeed as an anti-sweating measure, especially considering the high energy music of the featured band on Saturday night.\nNevertheless, Twin Sisters could become one of our favorite dance destinations. The floor is spacious and in good shape, and there's plenty of seating around the perimeter. (They also have a rule against carrying drinks onto the dance floor...something Luckenbach should adopt.)\nThere are two downsides. First, they have public dances only on the first Saturday of each month. Second, beware when someone comes out and sprinkles an unknown substance around the floor. This is a completely unnecessary attempt to make the floor easier to dance on, but what it did for us is make it almost dangerously slick.\n \nTwin Sisters Dance Hall - View of the stage\n \nTwin Sisters Dance Hall - View of the main entrance\nThe band that evening was The Georges, with members hailing from from San Antonio and New Braunfels (they have a standing Wednesday evening gig at the aforementioned Greune Hall). They specialize in rockabilly music - or as they call it, Retro Rock. I'm not sure about the genre, but I can assure you that its primary feature is speed. Holy cow, did they ever play some fast songs.\n \nThey did play a good variety of cover and original tunes, including songs by Dwight Yoakam, Waylon Jennings, Roy Orbison, and Elvis. (Conversely, there was a refreshing absence of \"bro-country.\") The lead singer, Jason George, has a powerful voice with an impressive range, and he's backed by some skilled instrumentalists. The only minor quibble we had with the performance was an occasional tendency to vary the tempo of the music during a song, which make dancing more challenging. In summary, while their musical style isn't one that we'd want for every dance, we'll certainly look for future opportunities to hear them.\nHere's a [rather sedate] sample of their music.\nIn contrast to our experiences at the Mercer Street Dance Hall in Dripping Springs, the crowd at Twin Sisters was slightly older, although there were a few families present. But the dancers were also more skilled; we never feared for our lives because of the out-of-control \"frat boy two-steppers\" that are so prevalent nowadays. This could be because the location is a bit remote. \nIn fact, if you're not glued to your turn-by-turn GPS, you can easily miss the entrance to the dance hall, which sits a few hundred yards off the highway and is hidden by trees. Ironically, it's easier to miss the entrance in the daylight, because at night they have the small sign lit from both sides by car headlights (yeah, no electricity for you!). But to make things easier for you:", "source": "The Fire Ant Gazette - A Midland, Texas Blog"}