{"published": "2015-09-15T21:27:18Z", "media-type": "News", "title": "Kevin Glenn gets the call for Riders against Redblacks", "id": "fe67bfc8-ab50-436f-ab73-147bdd26047b", "content": "The Saskatchewan Roughriders have opted go with experience over youth for Saturday's game against the Ottawa Redblacks. \n \nInterim head coach Bob Dyce announced on Tuesday that Kevin Glenn will start at quarterback ahead of rookie Brett Smith. \n \n\"Our objective this week is to win. Kevin Glenn gives us the best opportunity to win this game against Ottawa, so he will start at quarterback,\" said Dyce. \n \nThis decision was really the first major one that Dyce has had to make since being named to his new job a couple of weeks ago. \n \nThere were two prevailing thoughts when it came to Glenn or Smith this week. Should the Riders put their best foot forward to win, or try and develop for the future with the playoffs all but mathematically out of the equation? \n \n\"The playoffs may be out for (the media and fans) but not for us. There's still an opportunity,\" said Dyce. \n \n\"The real reason is this, when we walked into the room a while ago, we said our focus was winning games.\" \n [embedded content] \nGlenn has been out since tearing his pectoral muscle against the Hamilton Tiger-Cats on July 26 at Mosaic Stadium. \n \nEven though it's only been a month-and-a-half, for Glenn, it's felt like an eternity since he was able to play. \n \n\"My concern was just to get back healthy. Get back and healthy and when I can give the opportunity or I get an opportunity to help the team, then I'm just going to try and take advantage of it,\" he said. \n \nSmith will now return to the role of backup quarterback, a job he held for a few weeks after Darian Durant went down with a season ending injury in the opening week of the season. \n \nDyce feels that Smith dropping down the depth chart will actually be a good thing for him. \n \n\"Now it gives him an opportunity to see how a very successful professional quarterback operates and manages a game. That's just something Brett hasn't had the opportunity to see.\" \n \nSmith admits that taking a step back is always a little frustrating because as a player, you want to play. Overall though, he understands the decision and will do what he can to help the team. \n \n\"That's the direction that the coaches want to go, I'm going to be the best teammate I can for Kevin,\" he said. \n MESSAM MISSES PRACTICE  \nAnother big story line out of practice on Tuesday was the status of running back Jerome Messam. \n \nDuring Saturday's Banjo Bowl, Messam left the game after taking a pretty serious hit. Messam returned to the game some 10 minutes later. \n \nOn Tuesday, Dyce announced that Messam was going through the concussion protocol. That begs the question, why was he allowed to return the game? \n \n\"Here's the thing, you don't know necessarily with regards to if someone has a concussion. There's a lot of different things that go into diagnosing a concussion. More than I can understand, that's for sure,\" said Dyce. \n \n\"We have 100 per cent faith in our medical staff that they make the right decisions.\" \n NEWS AND NOTES  \nAlso absent from practice on Tuesday were defensive back Terrell Maze and fullback Scott McHenry. \n \nFullback Spencer Moore returned to practice as he's eligible to return from the six-game injured list, as did receiver Seydou Junior Hadaira. \n \nThe Riders announced on Tuesday the release of defensive back Mark LeGree and quarterback Blake Sims. \n \nLinebacker Denicos Allen, defensive back Kip Edwards and defensive lineman David Hunter were also added to the team's practice roster.", "source": "News Talk 650 CKOM"}