{"published": "2015-09-23T21:39:37Z", "media-type": "Blog", "title": "Your Young Genius Calls In Your Divine Audience", "id": "76244f4f-e4f4-4986-a046-df5af38da1f8", "content": "Has your young genius been lost somewhere along the way? \n \nAs this Equinox season unfolds, I invite you to inquire into your own young inner genius, her health, her presence in your life, how she showed up then , and how to invite her back to play, and in particular to enrich the entire fabric of your Great Work that is emerging, that is being called forth from within you. \n \nCircle/Reflections \n \nThe following challenge, started earlier in the summer, has continued to tickle my fancy behind the scenes as multiple dimensions and deep levels of change are currently playing out for me. \n \nWith acknowledgements to Jeffrey Davis of Tracking Wonder for this summertime # DareToExcel Challenge . This is #3 for #Daredevils and other conscious co-creators. \n \nTake a few minutes to remember a time when you were nine – or around that age – when you felt free to be your best. \n \nFeel an exact moment in time and place. Are you outdoors or indoors? How does the air feel? How do you feel in your body? What are you uniquely doing or making? Who are you with and how are you uniquely relating to others? \n \nLooking back with full compassion toward yourself, what 1-3 adjectives would you use to describe your younger self at her or his best? \n \nThese are your 3 Young Genius Qualities. \n \nHow can you bring some of those young genius qualities forward to this project? \n \nShare: Post written reflections or the three young genius qualities you commit to bring forward. \n \n  \n So what are my three young genius qualities?  \nCuriosity. Observing/Listening. Dreaming. \n \nAn only child, often left to my own devices, summer was for dreaming and reading, drawing, listening into the stream of imaginary friends who stepped out of the pages of books, magic, daring. Imagining myself as Nancy Drew during languid summers, reading, imagining, dreaming, reading some more. Observing the fireflies and butterflies. Tasting sweet concord grapes, stretched out in the grass made crisp by the summer sunshine. Listening to the crickets and then crackling campfires. Walking in the dark under the stars, hours with markers, and once at a dude ranch — Horses! (That one ultimately didn’t go as I dreamed…but I did learn about cleaning a cast iron skillet with sand on our breakfast trail ride.) \n \nAnd in partnership with that magical genius child, her shadowy wounded child plays around the edges. Still. She holds loss and grief that was too much to bear then, and now, in a powerful time of change, it’s all being offered up for clearing. Love and loss and grief — all reminders of how it once was and how it all changed so suddenly. \n \nWhat are your young genius qualities? \n \nIf you’re someone with curiosity rarely sated, who deeply appreciates the gifts of listening/observing, who still has a dream percolating inside, let’s see if we are growing in a garden together. (You probably also have a passion for words, images, healing/wholeness, following a spiritual path, and are deeply engaged with purpose.) \n \nI am called to focus on the wise women, women who ardently yearn for a secret weapon to see them through Kali’s fire, the chaos of their reinvention, and onto the other side. \n \nEspecially if you are a woman in the third act, you find dreams now impossible to ignore. You need your inner partners, the inner genius child and the wounded one, as well as your connection to a source (or sources) of guidance.  And outer collaborators are helpful, if you are ready to take a stand for your new and evolving, highly purposeful, change-the-world body of work (even and especially if it’s not yet fully formed). \n \nAs thought partner and sounding board for women in the third act, like you, I hold the space and help you recognize yourself as purposeful change agent, sage-hearted messenger, co-creator of a new paradigm world, and conscious collaborator with the emerging future. You’re ready for connecting in with guidance in real-time and within collaborative co-creative new paradigm spaces. \n Harvest Season  \nAt the Equinox, and with the upcoming Harvest Full Moon, (and a lunar eclipse!) big things are shaking loose on so many levels. Have you been feeling these shifts? \n \nYou know now is the time to harvest your wisdom. It’s the season for the blueprint of your Great Work to emerge. You are in a place of creative ferment, and clarity seems just out of reach. Articulating the pre-verbal birthing of your new program or book or body of work, you seek the sacred emergent words — words you didn’t even know you knew — and a way to organize and package those gifts and brilliance. \n \nFrom there, what if you could discover a sacred space, listening for the whispers of your Divine Audience just waiting to be called forth into YOUR circle? Your soul tribe is ready to connect and celebrate the birth of your revelatory manifestation and body of work. \n \nYour young inner genius has much to contribute to your body of work. When you consciously partner with your young genius, listen to the wisdom from your wounded one, and tap into real-time, practical source(s) of guidance, you are poised for making the biggest difference. YOU matter. Your divine audience is waiting for you! Your Emerging Future beckons! \n \nWelcome, young genius! Welcome, wise woman! Remember that all parts serve, so let’s have a co-creation party! \n \n  \n Related Posts: Vision Clarity Summer Camps for Conscious Creators–Part 1 Summer Camp for World-Changers Shero: Your Heroine’s Quest Questing 2015 Day 3 of 12 – Offending", "source": "Write Synergies Copywriting"}