{"published": "2015-09-24T12:45:00Z", "media-type": "News", "title": "North America's Building Trades Unions Statement on the KXL Pipeline", "id": "093141d3-4c89-4728-a449-b9228446ed3b", "content": "WASHINGTON , Sept. 24, 2015 /PRNewswire/ -- With this week's public announcement by Secretary Clinton, all Democratic candidates for President have now stated their opposition to the Keystone XL Pipeline. We find this development to be deeply disappointing not only for this vital energy infrastructure project, but for the future direction of the Party. All eyes now remain on the Obama Administration who, for nearly 8 years now, has dithered and lacked leadership on the issue by not taking a stand. \n\nThe men and women of North America's Building Trades Unions are looking for elected officials who will support measures that will put them to work. They are frustrated by and wholly reject the false choice presented to them by extreme elements of the environmental community who claim that a balanced energy portfolio is at odds with environmental stewardship while they relentlessly pursue an agenda that has stalled development and construction of critical energy projects throughout the country that employ our members, regardless of the energy source. Moreover, they and their political supporters repeatedly demean our membership for promoting family sustaining wages and benefits associated with so-called \"temporary jobs.\" \n   \nThis arrogance pushes the Party's traditional blue collar base further and further away. We need real leadership, not more empty rhetoric, to move us forward in a responsible manner. \n\nWe will continue to advocate for a broad, balanced energy portfolio that enhances our economic and national security; is produced with the safest and most skilled workers in the world; and puts millions of Americans to work by embracing the reality of global energy sources and of our domestic base load energy needs. \n\nWe again call on the Obama Administration to put hard working Americans ahead of politics and approve the KXL Pipeline. \n\nABOUT  NORTH AMERICA 'S  BUILDING  TRADES UNIONS \nNorth America's Building Trades Unions is an alliance of 14 national and international unions that collectively represent over 3 million skilled craft professionals in the United States and Canada . \n\nwww.BCTD.org \nwww.Facebook.com/NorthAmericasBuildingTradesUnions \nwww.twitter.com/@BldgTrdsUnions \n\nContact: \nTom Owens \n202-756-4623 \nEmail \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/north-americas-building-trades-unions-statement-on-the-kxl-pipeline-300148409.html \n\nSOURCE North America's Building Trades Unions", "source": "A.M. Best"}