{"published": "2015-09-27T04:33:16Z", "media-type": "News", "title": "Angels 3, Mariners 2", "id": "efec15dc-fa78-42f6-a96d-5da43903ae57", "content": "ANAHEIM, Calif. -- David Freese homered in the bottom of the ninth inning to give the Los Angeles Angels a 3-2 win over the Seattle Mariners on Saturday night in front of 37,866 at Angel Stadium. The Angels used their fourth consecutive victory to remain half a game behind the Houston Astros, who hold the American League's second wild-card spot, and move within four games of the first-place Texas Rangers in the AL West.But Los Angeles might have lost closer Huston Street, who leads the AL with 40 saves. Street left the game in the top of the ninth after running to cover third base on a ground ball. As Street was running, he pulled up and was unable to put any weight on his left leg.Street, who faced only two batters and allowed one hit in one-third of an inning, is the second reliever to suffer an injury within the week. The Angels lost right-hander Joe Smith, their eighth-inning specialist, when he sprained his left ankle while walking down a hotel stairway Sept. 19.Freese, the first batter in the bottom of the ninth, powered an 89 mph fastball from right-hander Danny Farquhar (1-5) over the outstretched glove of center fielder Shawn O'Malley and the outfield fence for his 12th homer of the season.Right-hander Fernando Salas (4-2) picked up the victory in relief.The Mariners put the potential winning run at third base in the top of the ninth. Second baseman Robinson Cano began the inning by lining a single to right field. Pinch-runner Brad Miller replaced Cano, stole second base and moved to third when center fielder James Jones grounded out, the play on which Street suffered his injury.Left-hander Jose Alvarez replaced Street and induced pinch-hitter Seth Smith to hit a sharp ground ball that first baseman C.J. Cron dived to field. Miller moved to third when Cron threw to Alvarez for the out at first. Salas then relieved Alvarez and made catcher Jesus Sucre ground out to end the inning.The Angels loaded the bases twice in the bottom of the first inning against right-hander Felix Hernandez, the Mariners' 18-game winner, but had to settle for a 1-0 lead.Right fielder Kole Calhoun singled with one out and took second base on center fielder Mike Trout's infield single. After designated hitter Albert Pujols walked to load the bases, Calhoun scored on left fielder David Murphy's sacrifice fly. Los Angeles reloaded the bases when Cron reached on catcher's interference, but Hernandez defused the threat by striking out Freese.Seattle tied the score in the top of the second. Left fielder Franklin Gutierrez walked to begin the inning, moved to third on first baseman Jesus Montero's one-out double and scored when Sucre grounded out. In the bottom of the second, the Angels had a chance to re-take the lead but squandered more opportunities.Second baseman Johnny Giavotella tripled to right-center field with one out but when shortstop Erick Aybar tried to squeeze Giavotella home, Hernandez fielded the ball and used his glove to shovel to ball to Sucre for the tag. Then with the bases again loaded, Pujols ended the inning by grounding out. Mariners shortstop Ketel Marte made the Angels pay in the top of the third when he hit his first major-league home run. On a 1-1 count, Marte propelled Andrew Heaney's 83 mph changeup into the Angels' left-field bullpen to put Seattle ahead 2-1.Trout stole a second home run in the top of the fourth. When Montero pounded a deep fly ball to center field, Trout jumped, grabbed the top of the fence with his right hand, steadied himself and made a backhanded catch about three feet from the top of the fence in front of the 396-foot sign.After he threw the ball to the infield, Trout swung his right arm, pumped a fist and yelled \"Let's go!\" The fans responded by chanting \"M-V-P, M-V-P.\"Cron tied the score in the sixth with his 16th home run of the season. He hit Hernandez's 92 mph fastball off the top of the Cypress trees behind the center-field fence.NOTES: Seattle 3B Kyle Seager played his 627th game since 2012 on Saturday night, the most of any major leaguer at any position. ... Mariners DH Nelson Cruz gave his team 106 home runs on the road when he hit his 43rd of the season Friday night, the most for the club since 2000. Seattle leads the majors in road homers. ... Josh Byrnes, former general manager for the Arizona Diamondbacks and the San Diego Padres, has emerged as a candidate for the Angels' vacant GM position. Byrnes currently works as the Los Angeles Dodgers' vice president of baseball operations. ... Angels 3B David Freese became the first player at his position to amass 10 doubles in a month for the club since Troy Glaus accomplished the feat in May 2001. Freese doubled in the seventh inning of Friday night's 8-4 win.", "source": "WDSU New Orleans"}