{"published": "2015-09-04T11:14:11Z", "media-type": "News", "title": "Newport motorsport star looking to rock Rockingham", "id": "0798f737-62c3-40b6-ac99-10bcbc8834e9", "content": "NEWPORT motorsport star Rory Collingbourne is looking to continue his move up the Renault Clio Cup table this weekend as the championship heads to the Rockingham Race Circuit for rounds 13 and 14. \n \nCollingbourne knows a top-six finish could take him to seventh in the championship table and cement Team Cooksport’s construction championship credentials with the Bristol-based outfit currently in second place. \n \nThe 17-year-old finished 10th at Knockhill in Scotland in the last race of the championship and says a top-six finish is a real possibility this weekend at one of the UK’s fastest race circuits. \n \n“Rockingham is definitely a circuit where I can perform,” said Collingbourne. \n \n“The track is very fast and built with lots of opportunities to overtake. \n \n“It’s a very technical track and the corners are extremely varied. \n \n“I’ve always performed well there and finished second in the Fiesta championships a couple of years back. \n \n“Tyres will play a big part,” he added. “Because of the nature of the track you have to look after them. \n \n“That doesn’t mean you can’t attack, but it does require judgement and knowing how far to push. \n \n“It all makes for a really exciting race and I just can’t wait to get out there now and perform.” \n \nThe British Touring Car prospect has impressed in his debut season in the championship with a succession of top-10 finishes and admitted that if he can break into the top-six at Rockingham then a podium finish will be on the cards before the end of the year. \n   \n Share article  \n   \n“I’m getting more and more confident with every race and that’s showing with the results,” he said. \n \n“This year was always about finding my feet, but I know that I can achieve a lot and intend on reaching my goals of being a championship contender next year.”", "source": "Penarth Times"}