{"published": "2015-09-24T15:50:37Z", "media-type": "News", "title": "NEWS ROUNDUP: Hundreds Killed In Hajj Stampede Outside Of Mecca…AND MORE", "id": "26b02a6d-370d-4e80-939d-c7c6ddeec9b2", "content": "Hundreds of people lost their lives in Saudi Arabia Wednesday during a stampede near the city of Mecca. Nearly two million people are in the city observing hajj pilgrimage, one of the world’s biggest annual gatherings. According to the Saudi Civil Defense, the incident took place when two big groups of pilgrims arrived at Street 204 in Mina. About 805 people were injured and 717 were killed. “Work is underway to separate large groups of people and direct pilgrims to alternative routes,” said the Saudi Civil Defense via Twitter. Read more . \n  Australia May Deny Chris Brown a Visa \n \nAlthough singer Chris Brown is working on changing his image, his past has come back to haunt him yet again. Brown recently shared that he would be going on tour in December and his announcement sparked a lot of backlash. Australian officials may stop him from entering their country due to the fact that he was convicted of domestic violence. “People need to understand, if you are going to commit domestic violence and you want to travel around the world, there are going to be countries that say to you, ‘You cannot come in because you are not of the character that we expect in Australia’,” said Senator Michaelia Cash , Australia’s Minister for Women. Read more . \n  Obesity Disproportionately Affects Blacks and Latinos \n \nObesity has plagued America for years, and a new study shows that it’s disproportionately affecting certain races and people living in certain states. According to the report, people who live in the South and Midwest have greater obesity rates than those in other areas of the country. It also shows that Blacks and Latinos have higher obesity rates than Whites. The rate for African-Americans is 47.8 percent, and 42.5 percent for Latinos. The rate amongst Whites is 32.6 percent. “In order to build a national culture of health, we must help all children, no matter who they are or where they live, grow up at a healthy weight,” said Risa Lavizzo-Mourey, President and CEO of the Robert Wood Johnson Foundation. Read more . \n \nVIDEO SOURCE: NDN \n \nDon’t Miss Our Hottest Stories! Get The NewsOne Flip App for iPhone : Flip, Skip — Or Send Us a Tip!", "source": "New Pittsburgh Courier"}