{"published": "2015-09-12T03:45:30Z", "media-type": "News", "title": "US dropping sale-of-secrets-to-China case against professor", "id": "e0048a9e-0515-466e-9893-312cd3132022", "content": "_ Federal prosecutors sought to dismiss charges Friday against a Temple University physics professor who was accused of scheming to provide secret U.S. technology to China after being confronted with statements from physicists that investigators had misunderstood the technology.\n\nThe U.S. attorney's office in Philadelphia declined to comment on the four-page motion the office filed seeking to drop four counts of wire fraud against the professor, Xi Xiaoxing.\n\nIn its filing in federal court in Philadelphia, the government said only that the motion is based on \"additional information\" it received since the charges against the 57-year-old professor were filed in May.\n\nXi was chairman of Temple's physics department until his arrest. He voluntarily stepped down as chairman and remains a faculty member. He is a naturalized U.S. citizen born in China.\n\nThe dismissal motion comes after Xi and his lawyer, Peter Zeidenberg, gave a presentation on Aug. 21 to investigators. That presentation included affidavits from world-renowned physicists and experts who looked at the emails between Xi and contacts in China and explained that he was involved in a scientific pursuit that had a very narrow commercial application and did not involve restricted technology, Zeidenberg said.\n\n\"We're very relieved that the charges against my father were dropped,\" his daughter, Joyce Xi, said by telephone from the family's home in the Philadelphia suburbs. \"It's been a very difficult time for our family and we're looking forward to regaining some normalcy in our lives.\"\n\nThe motion still must be approved by U.S. District Judge R. Barclay Surrick.\n\nFederal prosecutors want the opportunity to confer with their own outside experts and have reserved the right to bring charges again, Zeidenberg said.\n\n\"We have no reason to think that that's going to happen,\" he said.\n\nAsked how the government made such a mistake, Zeidenberg said he didn't know.\n\nProsecutors thought he was sending information related to a magnesium diboride pocket heater for which he had signed a nondisclosure agreement, Zeidenberg said.\n\nWhen they arrested Xi in May, prosecutors said he had participated in a Chinese government program involving technology innovation before he took a sabbatical in 2002 to work with a U.S. company that developed a thin-film superconducting device containing magnesium diboride.\n\nSuperconductivity is the ability to conduct electricity without resistance. A superconducting thin film could be key to making computer circuits that work faster. Films of magnesium diboride are particularly promising for this use, and Xi helped develop a way to make them.\n\nProsecutors say he \"exploited it for the benefit of third parties in China, including government entities,\" by sharing it with the help of his post-doctoral students from China. Xi also offered to build a world-class thin film laboratory there, according to emails detailed by prosecutors in May.\n\nBut Xi was sending information about a different device, which he helped invent. It was not restricted technology or supposed to be kept secret by a nondisclosure agreement, Zeidenberg said.\n\n\"It was typical academic collaboration,\" Zeidenberg said. \"Nobody's getting rich off this stuff.\"\n\nIn any case, the pocket heater is patented and plans on how to make it can be looked up online, Zeidenberg said.\n\n___\n\nLevy and Jackson reported from Harrisburg, Pa.", "source": "Estherville Daily News"}