{"published": "2015-09-17T10:00:00Z", "media-type": "News", "title": "Yingli Signs Its Largest Solar Panel Supply Agreement to Date in China", "id": "a6809b14-0ca7-4513-9261-e1b28708db82", "content": "BAODING, China , Sept. 17, 2015 /PRNewswire/ -- Yingli Green Energy Holding Company Limited (\"Yingli\" or \" Yingli Solar \") ( NYSE:YGE ), one of the world's leading solar panel manufacturers, today announced that its holding subsidiary, Yingli Energy ( Beijing ) Company Limited (\"Yingli Beijing\") has entered into an agreement with CFC Group Construction Limited (\"CFC Construction\") to supply 170 megawatts (MW) of solar panels for utility-scale power plants in China's  Hebei province. It is Yingli's largest solar panel supply agreement to date in China . \n\nAccording to the agreement, Yingli will deliver over 650,000 multicrystalline YGE Series solar panels to CFC Construction during the third quarter and fourth quarter of 2015. The panels will be installed in power plants located in the city of Zhangjiakou, one of Hebei province's largest municipalities. Once operational, the panels are expected to generate more than 200,000 megawatt-hours of clean energy, offsetting approximately 120,000 tons of carbon emissions. \n   \nZhangjiakou is an ideal location for the development of solar power plants due to its abundant solar resources, large industrial base, and high demand for electricity, so it was selected by China's State Council to be the site of the country's first renewable energy pilot zone. Zhangjiakou also recently won the rights to host the 2022 Winter Olympic Games together with Beijing , and these new solar power plants will help provide clean solar power for a green, low-carbon Olympics. \n\n\"CFC Construction is committed to the construction, operation, maintenance and innovation of solar and wind power plants. To ensure our power plants' high quality, we only select leading manufacturers for both solar panels and balance-of-system components. We have partnered with Yingli for these power plants because, as one of the world's leading solar panel manufacturers, Yingli's products meet CFC's demanding product quality requirements,\" commented Mr. Chen Jiguang of CFC Construction. \n\n\"We are pleased to enter into our largest supply agreement to date in China with CFC Construction, one of China's most competitive construction contractors,\" commented Mr. Liansheng Miao , Chairman and Chief Executive Officer of Yingli. \"Our highly durable Yingli Solar panels deliver superior performance in the harsh weather conditions that characterize Zhangjiakou and its surroundings, and we look forward to broadening access to solar power in communities across the region thanks to our partnership with CFC Construction.\" \n\nAbout Yingli Green Energy \n\nYingli Green Energy Holding Company Limited ( NYSE: YGE ), known as \" Yingli Solar ,\" is one of the world's leading solar panel manufacturers. Yingli Green Energy's manufacturing covers the photovoltaic value chain from ingot casting and wafering through solar cell production and solar panel assembly. Headquartered in Baoding, China , Yingli Green Energy has more than 30 regional subsidiaries and branch offices and has distributed more than 14 GW solar panels to customers worldwide. For more information, please visit www.yinglisolar.com and join the conversation on Facebook , Twitter and Weibo . \n\nSafe Harbor Statement \n\nThis press release contains forward-looking statements. These statements constitute \"forward-looking\" statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended, and as defined in the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements can be identified by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates,\" \"target\" and similar statements. Such statements are based upon management's current expectations and current market and operating conditions, and relate to events that involve known or unknown risks, uncertainties and other factors, all of which are difficult to predict and many of which are beyond Yingli Green Energy's control, which may cause Yingli Green Energy's actual results, performance or achievements to differ materially from those in the forward-looking statements. Further information regarding these and other risks, uncertainties or factors is included in Yingli Green Energy's filings with the U.S. Securities and Exchange Commission. Yingli Green Energy does not undertake any obligation to update any forward-looking statement as a result of new information, future events or otherwise, except as required under applicable law. \n\nFor further information, please contact: \n\nIn China : \n\nQing Miao \nVice President of Corporate Communications \nYingli Green Energy Holding Company Limited \nTel: +86 312 8929787 \nE-mail: ir@yingli.com \n\nIn the Americas: \n\nTori Clifford \nDirector of Marketing \nYingli Green Energy Americas Inc. \nTel: +1 415 728 0472 \nEmail: tori.clifford@yingliamericas.com   \n\nIn Europe : \n\nCarolin Stahler \nMarketing Communications Manager Europe \nYingli Green Energy Europe GmbH \nEmail: pr.eu@yingli.com \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/yingli-signs-its-largest-solar-panel-supply-agreement-to-date-in-china-300144804.html \n\nSOURCE  Yingli Green Energy Holding Company Limited", "source": "Town Hall"}