{"published": "2015-09-25T17:47:10Z", "media-type": "News", "title": "Ex-drug addict bears cross around Wales to show transformation", "id": "c902ad3d-3798-4c00-b09c-c9079de7bf49", "content": "The phrase \"everyone has got a cross to bear\" could not be more true for former drug addict turned family man Clive Cornish. \n \nThe 48-year-old has been carrying a heavy one-wheeled 12ft crucifix across Wales's hilly countryside for almost a fortnight. \n \nHe will have totted up more than 200 miles when he reaches his hometown of Cardiff this weekend. \n \nBorn-again Christian Mr Cornish is taking on the epic feat to raise awareness for the less fortunate in society and says he is living proof that people can turn their lives around. \n \nHe said: \"I came from a background of drink and drugs and have served six years in prison for committing robbery. \n \n\"I just want to show to people that no matter what hardship you are going through that you can overcome it. \n \n\"If I can do it then so can anyone.\" \n \nMr Cornish - who lives in Ely with 42-year-old wife Fiona and their three daughters Abbie, Alesha and Chloe - set off from Anglesey on September 13 and today passed Storey Arms in Brecon. \n \n\"My wife thought I was crazy when I told her I wanted to carry a cross for Jesus,\" he added. \"It has been really tough, especially the journey near (Snowdonia mountain) Cader Idris. But the people along the way have been fantastic and have helped lift my spirits when the going has got tough.\" \n \nAs well as aiming to spread the word of God, Mr Cornish - who attends New Life Church in Fairwater - said he also helps prisoners at HMP Prescoed near Bridgend with weekly visits. \n \n\"I know what it's like to be inside and have that feeling that no-one likes you and the world is against you,\" he added. \n \n\"It can be so easy for people to fall into a pattern of reoffending and breaking out of it can be difficult. \n \n\"We all have issues in life - the things which affected me from my past still do. \n   \n Share article  \n   \n\"But I want to show people that there is another path and a way out. \n \n\"It's all too easy to criticise people when you haven't walked in their footsteps. I think we need to be more compassionate towards people and if my walk can inspire a single person to change or be kinder to someone then that's an achievement.\"", "source": "Leigh Journal"}