{"published": "2015-09-10T07:38:59Z", "media-type": "News", "title": "Jack bows out of active politics", "id": "63dd07b3-320c-478d-957f-5d98479f7bb9", "content": "INDEPENDENT Liberal Party (ILP) leader Jack Warner is officially bowing out of active politics.\n\nThe party’s executive was expected to have met last night to discuss its future after its 31 candidates failed to garner substantial votes at Monday’s polls, Warner said yesterday after he left the Hall of Justice in Port-of-Spain, where he is appealing a judge’s order that he pay former Attorney General, Anand Ramlogan, SC, a little over $1 million in damages for defamatory statements he made at a local government campaign meeting in Chaguanas during 2013. \n\nAnd although the ILP will soon be looking to appoint a new leader, Warner said the struggle for democracy will continue. \n\nAccording to Warner, the ILP will now take up the mantle of becoming the moral compass in politics. “Many people thought the Congress of the People would have been the moral compass, but they abandoned this role, and the ILP will now fill that void,” he said. \n\nFor his part, Warner, 77, said he will continue to guide and assist the party. “It is my last hurrah, but I will not leave politics,” he said. \n\nHe also wants nothing to do with the party from which he resigned as a member and chairman in 2013. “I want to stay far away from the UNC as possible,” he said. \n\nAccording to Warner, the United National Congress (UNC), which suffered defeat at Monday’s general elections to the People’s National Movement (PNM), was still being run by a ‘cabal.’ Responding to views that UNC leader Kamla Persad-Bissessar should step down after leading the party to defeat in five consecutive elections (two by-elections, local government election, THA election and the general election), Warner said even if that happened, her possible successor of Oropouche East MP, Roodal Moonilal would be the last nail in the party’s coffin. \n\nOf the ILP’s poor showing, Warner said the party took a position not to spilt the votes to favour the People’s Partnership, pointing out that a private poll the party did in St Joseph and Tunapuna showed a division of the votes would have led to a UNC win in those constituencies.", "source": "Trinidad and Tobago's Newsday"}