{"published": "2015-09-16T07:08:33Z", "media-type": "News", "title": "The Gripping Drama, Everest released in Imax 3D", "id": "cce6875a-a873-4acd-a355-b72bb76f3d31", "content": "Based on the incredible true story – “something beyond the power of words to describe…” Nothing you have experienced can prepare you… \n \nEVEREST: the IMAX 3D Experience® releases onto Ster-Kinekor’s five IMAX® screens around the country on Friday, 18 September. If there is one film that should be experienced in the immersive IMAX theatre, it is EVEREST: a film that features the highest mountain in the world as its central character should be viewed on the country’s biggest screens. \n \nThis gripping human drama is based on the true story of two Everest expeditions in 1996. It will have audiences on the edge of their IMAX seats, gripping onto their ropes and each other, as they make the perilously dangerous climb to the summit of the world’s highest mountain, step by laboured step with the film’s characters. \n \nThe IMAX release of EVEREST has been digitally re-mastered into the image and sound quality of An IMAX 3D Experience® with proprietary IMAX DMR® (Digital Re-mastering) technology. The crystal-clear images coupled with IMAX’s customised theatre geometry and powerful digital audio, create a unique environment that will make audiences feel as if they are in the movie – and on the mountain! \n \nInspired by the incredible events surrounding an attempt to reach the summit of the world’s highest mountain, EVEREST documents the awe-inspiring journey of two different expedition teams, challenged beyond their limits by one of the fiercest snowstorms ever encountered by mankind. Their mettle tested by the harshest elements found on the planet, the climbers face nearly impossible obstacles as a lifelong obsession becomes a breathtaking struggle for survival. \n \nThis epic adventure stars a stellar cast of actors including Jason Clarke, Josh Brolin, John Hawkes, Robin Wright, Michael Kelly, Sam Worthington, Keira Knightley, Emily Watson and Jake Gyllenhaal. The film is produced by Baltasar Kormakur. \n \nSome live and some die, but as one character notes: “The last word always belongs to the mountain…” \n \nView the EVEREST trailer here: \n \n[embedded content] \n \nThe high-altitude thriller, EVEREST, makes its mark on the IMAX® 3D screens at Ster-Kinekor Gateway in Durban. The film also releases at all Ster-Kinekor cinemas nationally in 2D and 3D on the same day. Bookings are now open. The running time of the film is 2hrs 2mins and it carries a 7-9 PG restriction. \n \nFor more information on Ster-Kinekor and IMAX®, download the Ster-Kinekor App on your smart phone for updates and to book tickets from your mobile. To find out what other exciting promotions Ster-Kinekor has on offer, visit www.sterkinekor.com or sterkinekor.mobi. Follow @sterkinekor on Twitter or Ster-Kinekor Theatres on", "source": "Get It Ballito Umhlanga"}