{"published": "2015-09-21T08:05:54Z", "media-type": "News", "title": "Sept. 30 AIS Webinar to Offer Personalized Medicine Strategies for Plans, Providers", "id": "84bcbc6c-85b5-4444-9fdb-c1ae1fb2f1e1", "content": "While \"personalized medicine\" in the broadest sense has been a part of medical care for a very long time, the past decade has witnessed an explosion of genetic testing to treat a variety of conditions, most notably oncology therapies. The adage of \"getting the right drug to the right patient at the right time\" has never been more applicable. But it can be challenging for providers to determine which tests provide clinical value in treating a condition. The Sept. 30 Atlantic Information Services webinar, \"Personalized Medicine Strategies for Plans and Providers,\" will detail the rapid growth of personalized medicine, the impact it is having on the delivery of health care, and strategies providers and plans are developing to determine the clinical and business value of genetic tests. \n\nTwo experienced genetic testing professionals -- Melissa Bennett, MS, CGC and Lon Castle, MD, both of eviCore healthcare -- will provide 60 minutes of presentations, followed by 30 minutes devoted to individual questions. They will provide valuable perspectives on: \n\nHow genomics is now personalizing patient care throughout the diagnostic pathway ... and what the future holds for genetic testing. Current molecular diagnostic market trends and what they mean for the further development of personalized medicine. Commercial payer strategies for managing genomic testing -- including clinical utility requirements -- and how they are impacted by FDA and CMS decisions. How personalized medicine has been incorporated into oncology management to illustrate the potential benefits for physicians, patients and the health care system overall. The value of developing personalized medicine for providers, payers, diagnostic companies and pharmaceutical manufacturers.    \nVisit http://aishealth.com/marketplace/c5p15_093015 for more details and registration information. \n\nAbout AIS \nAtlantic Information Services, Inc. (AIS) is a publishing and information company that has been serving the health care industry for more than 25 years. It develops highly targeted news, data and strategic information for managers in hospitals, health plans, medical group practices, pharmaceutical companies and other health care organizations. AIS products include print and electronic newsletters, websites, looseleafs, books, strategic reports, databases, webinars and conferences. Learn more at http://www.AISHealth.com . \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12969763.htm \nPRWeb.com", "source": "MoneyShow.com"}