{"published": "2015-09-21T10:40:00Z", "media-type": "News", "title": "Weatherford Announces Concurrent Public Offerings of Ordinary Shares and Mandatory Exchangeable Subordinated Notes for an Expected Combined Amount of $1.0 Billion", "id": "3165dbfb-2b98-43e5-8a7b-ff48b05d625f", "content": "SOURCE Weatherford International plc\n\nBAAR, Switzerland \n\nThe Shares and the Notes will be offered pursuant to an effective registration statement (the \"Registration Statement\") filed with the Securities and Exchange Commission (the \"SEC\").\n\nThe Company intends to use the net proceeds from the Combined Offering to pre-fund potential acquisitions and for general corporate purposes. Pending such use, the Company expects that the borrowings under its revolving credit facility and commercial paper program will be temporarily reduced with the proceeds of the Combined Offering. \n\nThe Notes will have a maturity of three years, will be issued at 100% of the principal amount and will be mandatorily exchanged for ordinary shares of the Company (the \"Exchange Shares\") at the maturity of the Notes unless earlier converted at the option of the holders or Weatherford Bermuda or upon certain specified events in accordance with the terms of the Notes. The Notes will be fully and unconditionally guaranteed by the Company on an unsecured, subordinated basis. The interest rate, exchange rate and other terms of the Notes will be determined at the time of pricing of the Notes offering.\n\nUnder the terms of the Combined Offering, there will be a 60-day lock-up period for the Company on issuances or sales of ordinary shares of the Company and securities that give the holder the right to acquire ordinary shares of the Company. Weatherford Bermuda will apply to list the Notes on the New York Stock Exchange (\"NYSE\").\n\nCitigroup and Wells Fargo Securities will serve as joint book runners of the Combined Offering. \n\nThe offering of each of the Shares and the Notes are being made by means of a separate prospectus supplement and accompanying base prospectus as filed with the SEC. When available, copies of the preliminary prospectus supplements and accompanying base prospectus relating to each offering may be obtained free of charge on the Sc's website at www.sec.gov under the Company's name or from the underwriters of the offering as follows:\n\nThis press release does not constitute an offer to sell or a solicitation of an offer to buy the securities described above, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of such state or jurisdiction. The offer is being made only through the prospectus as supplemented, which is part of the Registration Statement. \n\nAbout Weatherford \n\nWeatherford is one of the largest multinational oilfield service companies providing innovative solutions, technology and services to the oil and gas industry. The Company operates in over 100 countries and has a network of approximately 1,350 locations, including manufacturing, service, research and development, and training facilities and employs approximately 44,000 people. \n\nForward-Looking Statements\n\nThis press release includes forward-looking statements as defined under federal law, including those related to the Company's potential securities offering. These forward-looking statements are generally identified by the words \"believe,\" \"expect,\" \"anticipate,\" \"estimate,\" \"intend,\" \"plan,\" \"may,\" \"should,\" \"could,\" \"will,\" \"would,\" and \"will be,\" and similar expressions, although not all forward-looking statements contain these identifying words. Such statements are subject to significant risks, assumptions and uncertainties. Known material factors that could cause the Company's actual results to differ materially from the results contemplated by such forward-looking statements are described in the prospectus as supplemented, which is a part of the Registration Statement, and the risk factors described in the Company's Annual Report on Form 10-K for the fiscal year ended December 31, 2014 \n\nLogo - http://photos.prnewswire.com/prnh/19990308/WEATHERFORDLOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/weatherford-announces-concurrent-public-offerings-of-ordinary-shares-and-mandatory-exchangeable-subordinated-notes-for-an-expected-combined-amount-of-10-billion-300146075.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WSFA"}