{"published": "2015-09-07T14:09:48Z", "media-type": "News", "title": "Here's When You Can Play Football Manager 2016", "id": "b64d107c-57fc-4501-8e09-4c6d4ecd7918", "content": "Share.  \nNew games, new modes.  By Sega and Sports Interactive have announced three new Football Manager games that are scheduled for release this year. \n \nAs expected, Football Manager 2016 will be coming out on PC and Mac, but Football Manager Touch will also be coming out for PC and tablets. Previously known as Football Manager Classic, Touch is the quick play mode which has been within the full game before (and for tablets since March). This is the first time it will be available separately through Steam and on tablets. Football Manager Mobile will also be coming to all iOS and Android devices. \n \n“For some time now it’s been clear to us that there is no ‘one size fits all’ football management experience,” says Sports Interactive head Miles Jacobson. \"The introduction of Football Manager Touch as a standalone offering – playable across computer and tablet – means that we now offer something for everyone.” \n \nAs for new features, FM2016 now includes a create-a-club mode, and a fantasy draft mode where you compete with other managers to build a squad from scratch with a fixed budget, followed by a mini-league. Other tweaks and additions include more manager customization options, a set piece creator, more realistic injuries, extended press interaction, and improved AI transfers. \n \nFM Touch will also have the create-a-club mode, and it will have cross-save, so a career saved to the cloud can be accessed on your tablet or your PC. \n \nPre-ordering FM2016 from participating retailers will also grant you a key for An Alternative Reality: the Football Manager Documentary. Additionally, you'll gain access to the full beta two weeks before the game launches. \n \nThe full Football Manager 2016 is scheduled for release on November 13, with Football Manager Touch and Mobile available \"before Christmas.\" \n \nIn IGN's review of last year's Football Manager 2015 , we said that \"better menu layouts, countless new options and improved match-day features see FM2015 remain in title-winning form.\" \n \nMatt Porter is a freelance writer based in London. Make sure to visit what he thinks is the best website in the world , but is actually just his Twitter page .", "source": "IGN.com"}