{"published": "2015-09-04T05:00:00Z", "media-type": "Blog", "title": "U.S. job gains seen solid in August, spotlight on Fed", "id": "1e9bf41e-f65c-493f-968a-812bb79a6112", "content": "By Lucia Mutikani \n \nWASHINGTON, Sept 4 (Reuters) – The U.S. economy likely added \njobs at a steady pace in August and the unemployment rate \nprobably fell to a near 7-1/2-year low of 5.2 percent, which \ncould allow a cautious Federal Reserve to consider a September \ninterest rate hike. \n \nA Reuters survey of economists forecast nonfarm payrolls \nincreased by 220,000 last month, up from 215,000 new jobs in \nJuly. \n \nThat would underscore the economy’s vibrancy in the face of \nvolatile global financial markets and China’s slowing growth, \nand keep alive the prospect of the Fed raising benchmark \novernight rates at its next policy meeting, on Sept. 16-17. \n \n“We don’t think it will detract from the possibility that \nthe Fed is considering a September rate hike, only if we saw \nominous signs of a deterioration elsewhere in the data,” said \nSam Bullard, a senior economist at Wells Fargo Securities in \nCharlotte, North Carolina. \n \nThe Labor Department will release its closely watched \nemployment report on Friday at 8:30 a.m. EDT (1230 GMT). \n \nIn the wake of the recent global equities selloff, financial \nmarkets significantly scaled back bets on a rate hike over the \npast month. But Fed Vice Chairman Stanley Fischer told CNBC last \nweek it was too early to decide whether the stock market rout \nhad made a September rate increase less compelling. \n \nEconomists acknowledge a risk that job gains could come in \nbelow expectations as the first reading of August payrolls has \ntended to be weaker in the last several years before being \nrevised higher. \n \nThey say the model the government uses to smooth the data \nfor seasonal fluctuations often does not fully capture \nstatistical noise from the start of a new school year. In \naddition, the response rate from employers to the government’s \njob survey tends to be low in August. \n \nAccording to Goldman Sachs, preliminary August payroll \nnumbers have undershot expectations by an average of 30,000 \nsince 2010, while subsequent revisions have averaged 79,000 over \nthe past five years. \n \n \nECONOMIC MOMENTUM \n \n“Despite the stock market volatility this month and the \ngrowing cracks in China’s economy … we don’t see any signs of \nslowing in the labor market yet,” said Andrew Chamberlain, chief \neconomist at Glassdoor in San Francisco. \n \nSturdy payroll gains would add to a string of upbeat data, \nincluding figures on automobile sales and housing, that has \nsuggested the economy was moving ahead with strong momentum \nearly in the third quarter after growing at a robust 3.7 percent \nannual rate in the April-through-June period. \n \nIf the jobless rate falls one-tenth of a percentage point as \nexpected that would take it to its lowest level since April 2008 \nand bring it into the range that most Fed officials think is \nconsistent with a low but steady rate of inflation. \n \nJobs gains were likely spread across nearly all sectors of \nthe economy in August. The energy sector, which is still \ngrappling with last year’s sharp drop in crude oil prices, is \nexpected to be the exception. \n \nRobust demand for autos is seen boosting manufacturing \nemployment, while solid gains are forecast for construction \npayrolls as housing gains muscle. \n \nAverage hourly earnings are expected to have risen 0.2 \npercent – the same as in July. That would leave them around 2.2 \npercent above their year-ago level, still well below the 3.5 \npercent growth rate economists consider healthy. \n \nSome analysts think earnings are being held back by falling \nwages in oil field services. \n \nBut a tightening labor market and decisions by several state \nand local governments to raise the minimum wage should \neventually translate into faster earnings growth and give the \nFed confidence that inflation, which collapsed with oil prices, \nwill move closer to its 2 percent target. \n \nA number of retailers, including Walmart, Target \nand TJX Cos, have increased pay for hourly \nworkers. \n \n(Reporting by Lucia Mutikani; Editing by Leslie Adler)", "source": "Lucia Mutikani"}