{"published": "2015-09-08T17:07:27Z", "media-type": "Blog", "title": "Metal Gear Solid 5 Quiet bug could corrupt save, Konami warns", "id": "4bd07d98-1ed7-4cef-b21f-6864a4aea4ae", "content": "Metal Gear Solid 5 Quiet bug could corrupt save, Konami warns Konami is investigating the bug, but has not yet found its cause. by GameSpot Staff @gamespot September 7, 2015 10:05 PM PDT Updated: September 8, 2015 10:07 AM PDT Konami has issued a warning to Metal Gear Solid V: The Phantom Pain players regarding a bug that could corrupt save files. As explained on the company's website, this bug can be triggered if you have Quiet as a buddy character while playing Mission 29 or Mission 42.\nTo avoid a potential headache, Konami recommends that you simply do not use Quiet as a buddy during those missions. The bug is affecting all platforms, and a Konami community manager says on Twitter that the company is currently working to determine the cause, after which it can develop a fix.\n\"We deeply apologize, and appreciate your patience for further announcements regarding this issue,\" Konami said.\nWe'll update this post with more details as they become available.\nAlthough The Phantom Pain received glowing praise upon release on September 1, the game's launch was marred somewhat by servers issues that lasted days. These problems, which affected the game's Forward Operating Base multiplayer mode, have now been largely fixed. The Phantom Pain will continue to grow next month in the area of multiplayer, as that's when Konami plans to release the game's more traditional, head-to-head multiplayer mode, Metal Gear Online for consoles. This multiplayer offering is coming in January 2016 for PC.\nEarlier this year, Konami announced that it had started development on a new Metal Gear Solid game and was actively recruiting for the project. Meanwhile, series creator Hideo Kojima is expected to exit Konami, according to GameSpot's sources.\nFor more on The Phantom Pain, check out GameSpot's 10/10 review and what other critics are saying. Tags: Gaming Previous Story Seek-and-destroy robot to stop starfish killing the Great Barrier Reef Next Story 'It's too early' to say what's next for Killzone, dev says About the author GameSpot Staff CNET's sister site GameSpot is the world's leading site for video game news, reviews, features, and more. Visit us at www.gamespot.com. See full bio Comments More From CNET", "source": "CNET News"}