{"published": "2015-09-21T00:11:19Z", "media-type": "Blog", "title": "Is Reformed Theology Catholicism", "id": "dbc798be-9a6e-48b7-8721-31f84e89c10b", "content": "Is Reformed Theology Catholicism Is REFORMED Theology Reformed Catholicism? I don't think it is. Please discuss\nPray for me,\nthe unworthy monk Brendan\nJoin Our Free Dating and Take The Christian Living Quiz\n ---Monk_Brendan on 9/10/15      Helpful Blog Vote (1) Kathr as far as Lutheran Church it was name by him because He LEFT the RCC and started teaching his view of what a Church should be. Nicole///////\nNicole, YOU SAID the Lutheran church was named BY HIM.....IT WAS NOT. Also He did not leave, he was excommunicated......two entirely different matters. Do you think Martin Luther was the ONLY person who questioned the evil the RCC had become? Hardly Nicole. Luther wanted CHANGE within the RCC, and rightly so. The RCC became wealthy off the backs of peasants, and corruption within, even to today as we see Pope Francis is still cleaning CORRUPTION out of the RCC. Makes me wonder what would have been the outcome if Pope Francis was Pope at the time of Luther. ---kathr4453 on 9/20/15 Nicole, we also know the RCC in these past years have had a mass exodus because of the evil of pedophiles the Church was covering up and even protecting. EGO again has nothing to do with calling evil evil. It's called CONSCIENCE. It's called righteousness, it's called TRUTH. The history of the Borgas is also well known. Telling poor souls they can PAY for the deceased in pergetory is pure corruption. BUT the RCC needed money to buy back property lost in a poker game and came up with that. You hate that Luther EXPOSED all this corruption? And 99 in all. Because of the reformation the RCC was forced to clean their own house, but ONLY AFTER their corruption was exposed. You should be thanking Martin Luther. ---kathr453 on 9/20/15 1 Peter 1:18-19\n18 Forasmuch as ye know that ye were not redeemed with corruptible things, as silver and gold, from your vain conversation received by tradition from your fathers,\n19 But with the precious blood of Christ, as of a lamb without blemish and without spot:\nWe see Nicole that SCRIPTURE Clearly shows one cannot buy another's soul out of a fictitious place. Listen carefully to YOUR so called first Pope. ---kathr445 on 9/20/15 Cluny said, \"I've tried several times. He things the Bible is the same as Jesus.\"\nI think Samuel statement is very appropriate in responding to Cluny's Statement, \"\nThose who do not have good arguments or verses for their views. Often resort to juvenile remarks, snide comments and personal attacks.\" excellent point Samuel... thanks man... ---john9346 on 9/20/15 Jerry said, \"Peter was DEAD when Luther lived. Did you expect him to practice necromancy?\"\nBut Peters successor (Pope Leo X) was alive, and that is who Martin Luther should have gone to.\nPray for me,\nthe unworthy monk Brendan ---Monk_Brendan on 9/20/15 I have read where Paul rebuked Peter. Galatians 2:11\nBut when Peter was come to Antioch, I withstood him to the face, because he was to be blamed.\nWhere he meet with James, Peter (Cephas) and John. Gal 2:9\nAnd when James, Cephas, and John, who seemed to be pillars, perceived the grace that was given unto me, they gave to me and Barnabas the right hands of fellowship, that we should go unto the heathen, and they unto the circumcision.\nWhere Peter was for Circumcised and Paul for gentiles. See Galatians 2:8. Which would make Paul the Pope not Peter.\nHe did spend some time with Peter and James. Who headed the council Peter had to report to James too. Galatians 1:18,19. Acts 10, 15:19 21:8\nAGape ---Samuelbb7 on 9/20/15 Nicole: \"Samuel, Paul went to Peter when there was a conflict, Luther didn't.\"\nPeter was DEAD when Luther lived. Did you expect him to practice necromancy?\n---jerry6593 on 9/20/15 Kathr, Luther was warned SEVERAL times and indeed was excommunicated, by his choice. He was a RCC Priest, DUMMY he was not.\nYou can't debate because you take things TOO PERSONALLY.\nWhy do you think I hate Luther? Did I say I did? NOPE.\nShow me my lie. Copy and Paste and lets debate it.\nYou made a statement claiming The Lutheran Church wasn't name after Martin Luther to ME accusing me of being derogatory to him.\nWhen I give you proof with common sense, you get mad.\nReally?\nSorry if I hurt your feeling.\nBut, don't attack me and get mad if I DEFEND myself.\nRob, Cluny answered you well.\nSamuel, Paul went to Peter when there was a conflict, Luther didn't.\nActs 15:1-29 V7 Peter got up.. ---Nicole_Lacey on 9/19/15 \\\\Nicole Lacey, please show from Scripture where the Apostle Paul told people to call the Pope the Holy Father, to bow and too Worship the Pope. \\\\\nrob, please show me the hard evidence that people worship the Pope.\n(If anyone does, it's despite the teaching of their church, not because of it.)\nShow me from the Scriptures where you find the terms \"accept Christ,\" \"personal savior,\" \"rapture\", invitation hymns, altar calls, and revivals.\nGlory to Jesus Christ! ---Cluny on 9/19/15 Nicole Lacey, please show from Scripture where the Apostle Paul told people to call the Pope the Holy Father, to bow and too Worship the Pope. Show where people are told to pray to the Virgin Mary, say Hail Mary, and pray the Rosary. ---Rob on 9/19/15 Wow Nicole, first you insist Luther named a Church after himself, and NOW ...what? Change the context and subject of the conversation? Just say, OK I was wrong. But no Nicloe you can't do that can you. You had to instead spew all sorts of hate and put YOUR twist on it insisting now his EGO really liked it, AND that he had the power to stop the RCC from naming those they called heretics after the heretic. This is why it's hard to debate with you Nicole, because when you are shown the truth, you can't just accept it at face value. YOU have to LIE and TWIST the truth to somehow insist YOU were right all along. But worse yet is your obvious HATRED of Luther. Were you there Nicole? Isn't the truth Luther was excommunicated? ---kathr4453 on 9/19/15 Luther through reading scripture had an awakening of CONSCIENCES, after reading Romans ( proving the Word of God is LIVING AND POWERFUL AND STRONGER THAN A TWO EDGE SWORD) again proving scripture that those who SEEK will find the truth. There is a difference between SEEKERS, and those who just follow and believe what they are told. Luther never insisted others follow him, but gave others the same opportunity of being able to read the Bible for themselves, where FAITH COMES BY HEARING THE WORD OF GOD. Not hearing the word of man. You can't LEGALIZE FAITH. If perchance you understood that Nicole, you would be a seeker and not a follower. ---kathr453 on 9/19/15 Nicole you proved your point that Luther and the Lutheran church.\nBut he followed the Teachings of Paul and left the traditions of men. He supported following the Bible and using it as the final rule of what is doctrine. Paul and Jesus fought against traditions that Jewish leaders had built up instead of following the law of GOD. Mark 7:7-11\nHowbeit in vain do they worship me, teaching for doctrines the commandments of men.\nFor laying aside the commandment of God, ye hold the tradition of men,...\nAnd he said unto them, Full well ye reject the commandment of God, that ye may keep your own tradition.\nFor Moses said, Honour thy father and thy mother, and, Whoso curseth father or mother, let him die the death:.... ---Samuelbb7 on 9/19/15 kathr, Common sense tears your statements to pieces. A RC Priest decides leave THE RCC, and changes the traditions Paul told us to hold to them.\nThe hardest part is tell people to believe in him so much they are banking on their enteral life.\nThey followed him even after being excommunicated.\nMather Luther HAD that much POWER over the people to leave what is known to an unknown on his belief system.\nBut you want me to believe He COULDN'T STOP THEM FROM NAMING THE NEW CHURCH AFTER HIM??????? REALLY?? THE egoistic was smiling ear to ear.\nBecause a MAN who can convince you to leave your core faith, CAN tell you to remove my name from the Church. Didn't happen because he like it named after him. ---Nicole_Lacey on 9/18/15 \\\\Certainly wouldn't want to enlighten him would you.\\\\\nI've tried several times. He things the Bible is the same as Jesus.\nGlory to Jesus Christ! ---Cluny on 9/18/15 Cluny you said, \"This is useless topic to discuss with someone who is totally fuzzy about who Jesus is.\" \"However, when I was a Baptist (before I got saved) we never got into essentials vs. non-essentials.\nI agree This is a useless topic to discuss with someone who thinks diversity means disunity (baptists, lutherans, and presbyterians) and who is unable to support the claims they make and when challenged resort to personal attacks?? I am still waiting for you and Brendan to show from the confessions that essentials have not been defined. ---john9346 on 9/18/15 Read These Insightful Articles About Christian Marriage But Trav he sent the Church to the world. As has been posted here many time. Verses you just ignored and refuse to comment on. ---Samuelbb7 on 9/18/15 This is useless topic to discuss with someone who is totally fuzzy about who Jesus is.\n---Cluny on 9/18/15\nCertainly wouldn't want to enlighten him would you. Might not be room for both of you. Enlighten the man...if you can. The battery appears dead on your personal light. Use scripture.\nMat_15:24 But he answered and said, I am not sent but unto the lost sheep of the house of Israel. Joh_10:4 And when he putteth forth his own sheep, he goeth before them, and the sheep follow him: for they know his voice. ---Trav on 9/18/15 \\\\Brendan and Cluny can you both show from the confessions referred to you how the essentials and non-essentials are not defined as you have stated??\n---john9346 on 9/17/15\\\\\nThis is useless topic to discuss with someone who is totally fuzzy about who Jesus is.\nHowever, when I was a Baptist (before I got saved) we never got into essentials vs. non-essentials.\nGlory to Jesus Christ! ---Cluny on 9/18/15 Samuel you said, \" Type in the name of the denomination into Google or any search engine and you will get the pages with their doctrine on it.\" no, if you want to know what a denomination believes you go to them and let them tell you what they believe not you go and tell them what they believe this is called assertions.\nBrendan and Cluny can you both show from the confessions referred to you how the essentials and non-essentials are not defined as you have stated?? ---john9346 on 9/17/15 Read These Insightful Articles About Debt Consolidation The name Lutheran originated as a derogatory term used against Luther by German Scholastic theologian Dr. Johann Maier von Eck during the Leipzig Debate in July 1519. Eck and other Catholics followed the traditional practice of naming a heresy after its leader, thus labeling all who identified with the theology of Martin Luther as Lutherans.\nMartin Luther always disliked the term, preferring instead to describe the reform movement with the term Evangelical, meaning \"good news\", i.e. \"Gospel.\nEventually Lutherans themselves began to use the term Lutheran in the middle of the 16th century in order to distinguish themselves from other groups, such as the Philippists and Calvinists. ---kathr4453 on 9/18/15 The RCC used the derogatory name Lutherens, not Martin Luther.---kathr4453 on 9/16/15 Do you know how silly that sounds?\nIt's derogatory to use your name? Think again.\nI would like for you to cite your source to support this claim??--john9346 on 9/17/15 1. 1988 states 20,000 to 30,000 David Barrett's Statistics (Goggle his name)\nI believe it has been updated as part II in 2012\n2. The Way (Following Jesus in the 21th Century.\n3. Protestantism in United States by Wikipedia.\nGoggle it if you want more sources. ---Nicole_Lacey on 9/17/15 Type in the name of the denomination into Google or any search engine and you will get the pages with their doctrine on it. Monk Brendon is correct and so is Cluny. On the other hand when I reread my last post. I am mortified. My thoughts are jumbled and there are misspelled words. I wish to apologize to those here for messing up that post badly. Some Protestants believe once saved always saved. Was part of what I meant. Not the RCC. Mea Culpa ---Samuelbb7 on 9/17/15 You wrote all that and still having NAME one Church being the same when the 5 Reformer rebelled.\n---Nicole_Lacey on 9/16/15\nNicole, is the RCC the SAME as it was before the reformation? Do people still go,to hell for eating meat on Friday? ARE indulgences still being SOLD? And where do you place Wycliffe in all of this? He protested Catholicism long before Luther. Actually Wycliffe was never RCC in the first place was he? What about Hess, again never RCC and long before Luther. The RCC HATED Wycliffe. They actually dug up his bones and desecrated his buriel place out of HATE. Can you see Paul or Peter doing such a thing? ---kathr4453 on 9/17/15 Send a Free Christian Tract Cluny you said, \"Wrong again, not only because Baptists, Lutherans, and Presbyterians would disagree with you (all three denominations consider the points I mentioned to be doctrinal), but because there is no general agreement about what is essential and what is non-essential.\"\nall baptists, lutherans, and presbyterians agree these are matters of tradition and do define essentials from nonessentials. Please see LBC 1689 (baptist), WCF (presbyterian), and the following:\n\"Lutherans believe that the Bible teaches that a person is saved by Gods grace alone through faith in Jesus Christ alone.\" Doctrine - The Lutheran ChurchMissouri Synod ---john9346 on 9/17/15 John said, \"Brendan you said, \"I am also sure that if I posted beliefs of Lutherans or Presbyterians, there are some that would disagree about those things.\"\nAnd why won't you post those beliefs my friend?\"\nBecause there is a 125 word limit on these blogs. If I had unlimited room, I could have posted more. But then all of the posts would be pages upon pages, and we would not be posting.\nPray for me,\nthe unworthy monk Brendan ---Monk_Brendan on 9/17/15 \\\\Cluny you asked, \"But all three are one in doctrine, right?\"\nYes, because all the things you mentioned are not paramount to salvation \"Nonessentials/traditions.\"\\\\\nWrong again, not only because Baptists, Lutherans, and Presbyterians would disagree with you (all three denominations consider the points I mentioned to be doctrinal), but because there is no general agreement about what is essential and what is non-essential.\nGlory to Jesus Christ! ---Cluny on 9/17/15 Yes Kathyr it stated as a derogatory term by the RCC. They recognized that Luther was the founder of that denomination which they labeled as heretical because they taught salvation was by Grace alone through faith alone. \"In 1521 Edict of Worms: The edicts of the Diet condemned Luther and officially banned citizens of the Holy Roman Empire from defending or propagating his ideas, subjecting advocates of Lutheranism to forfeiture of all property,...\" Salvation in the RCC was based on works of saints and people with grace helping. Or pushing as it says in some catechisms. Some took this to mean once saved always saved. A point you and I disagree with. But Grace in the RCC and our understanding leads to obedience. ---Samuelbb7 on 9/17/15 Read These Insightful Articles About Refinancing Cluny you asked, \"But all three are one in doctrine, right?\"\nYes, because all the things you mentioned are not paramount to salvation \"Nonessentials/traditions.\"\nThe Scriptures do not teach, \"you must be baptized (certain way) to be saved, you must take the Lord's Supper to be saved, and you must have a bishop over your church to be saved.\nWhat is the way of salvation Luke, 13:1-5, Mar 1:15, and Acts 3:19.\nI would invite you to do as these Scriptures command you my friend... ---john9346 on 9/17/15 \\\\baptists, lutherans, and Presbyterians are 1 church different in traditions,yet, one in doctrine.\\\\\nBaptists will baptize only by immersion those who have \"accepted Christ.\"\nLutherans and Presbyterians baptize infants by pouring or aspersion.\nSome Lutherans have bishops, but Presbyterians and Baptists reject episcopacy.\nLutherans believe that the bread and wine have some connection with the Body and Blood of Christ, but Baptists deny this teaching.\nBut all three are one in doctrine, right?\nGlory to Jesus Christ! ---Cluny on 9/17/15 Brendan you said, \"I am also sure that if I posted beliefs of Lutherans or Presbyterians, there are some that would disagree about those things.\"\nAnd why won't you post those beliefs my friend??\nNicole you stated, \"That's why there are 60,000 and growing Protestant Churches.\"\nI would like for you to cite your source to support this claim?? ---john9346 on 9/17/15 Nicole, the RCC would always call those they called heretics by the person's name who they believed were heretics. The RCC used the derogatory name Lutherens, not Martin Luther. Please understand your history before making statements you have no understanding of. This was a common practice of the RCC. ---kathr4453 on 9/16/15 Read These Insightful Articles About Franchises John 9346 said, \"baptists, lutherans, and Presbyterians are 1 church different in traditions,yet, one in doctrine.\" So let's take a look at the Baptists:\nSalvation involves the redemption of the whole man, and is offered freely to all who accept Jesus Christ as Lord and Saviour, who by His own blood obtained eternal redemption for the believer. In its broadest sense salvation includes regeneration, justification, sanctification, and glorification. I am sure that there are some Protestants who would disagree about this statement.\nI am also sure that if I posted beliefs of Lutherans or Presbyterians, there are some that would disagree about those things\nPray for me,\nthe unworthy monk Brendan ---Monk_Brendan on 9/16/15 Nicole you continue to ask, \"Please name one Church, just one that was started by one of the five REFORMERS still as he started TODAY?\" there is only 1 church.\nst cyprian answers your question listen closely. \"The Church is also one, though spread far and wide by its ever-increasing fruitfulness. There are many rays of the sun, but one light. There are many branches of a tree, but one strength from its mighty root. From one spring flow many streams, and though they are multiplied in rich abundance, yet they are still united in one source.\" st cyprian (Unity on the church)\nbaptists, lutherans, and Presbyterians are 1 church different in traditions,yet, one in doctrine. ---john9346 on 9/16/15 Of course he did, and infant baptism was practice in the ORIGINAL Lutheran Church. Infant baptism has been around since the 1st century\nKathr as far as Lutheran Church it was name by him because He LEFT the RCC and started teaching his view of what a Church should be.\nAs many do RIGHT NOW. They start another Church because they disagreed with their Pastor's version of being Christian.\nThat's why there are 60,000 and growing Protestant Churches.\nLuther stated the process of if you disagree with the belief start you own Church.\nOthers came to the same conclusion when they didn't like Luther's vision of a Church.\nYou wrote all that and still having NAME one Church being the same when the 5 Reformer rebelled. ---Nicole_Lacey on 9/16/15 While Luther believed the Pope was the Antichrist he did not reject all the doctrines of the RCC. Nor of the Christian church which preceded it.\nThe Lutheran church was based on the Bible and the understanding that Luther taught. It looks to him as it's founder and he is alsco called the leader of the Reformation and Protestantism. So while your point is true. I consider it nitpicking. Peter was called on the carpet before James in the Jerusalem council. So how could he have been the sole leader. A doctrine not from the Original church. Agape ---Samuelbb7 on 9/16/15 Read These Insightful Articles About Lead Generation Nicole, Luther DID NOT , say, \" Let's start a new church and name it after me\". If you can PROVE this is what happened, please provide absolute proof ..date, etc. Yes of course This denomination was named after him. But there is a difference in something named after you, and you naming it after yourself. Did he still believe in infant baptism? Well that is RCC. ---kathr4453 on 9/15/15 Nicole you said, \"St Polycarp LIVED in the 2nd Century and one of the Fathers of the Church. CATHOLIC CHURCH.\" st polycarp was catholic in its contextual meaning Smyrnaeans chapter 8, he was not rcc nor eo.\nThe councils of carthage and Hippo didn't determine \"Cannon.\" there are quotations prior to their existence.\nThe apocrypha is not in the Hebrew \"Cannon.\" ---john9346 on 9/15/15 And I did answer your question according to Smyrnaeans chapter 8.--john9346 on 9/15/15 Sorry John, I scrolled down, but didn't find that answer.\nBut I google Smyrnaeans chapter 8.\nGuess what it is?\nThe Epistle of St. Ignatius of Antioch to the Smyrnaeans.\nSt. Ignatius lived in the 1st century.\nI going to break it down for you all to answer me.\nName a Church reformed after the 16th Century by a Reformer who STARTED the Church DURING HIS LIFE TIME.\nLutheran is an example. Luther was one of the 5.\nHis Church is called Lutheran because he started it.\nBUT, the Lutheran Church has broken into several branches not under one Bishop.\nNow by following those rules, please name one. ---Nicole_Lacey on 9/15/15 It took awhile and scholars to work out an official canon. But it was done and finished by the 5th Century. The RCC actually fired Martin Luther because of his stand against the Rank hypocrisy and corruption going on. They labeled him a Heretic and he labeled the Pope the Antichrist. He also married a ex nun. Paul was approved by three people. Cephas means stone and is a nick name for Peter.\nGaltions 2:9\nAnd when James, Cephas, and John, who seemed to be pillars, perceived the grace that was given unto me, they gave to me and Barnabas the right hands of fellowship, that we should go unto the heathen, and they unto the circumcision.\nPeter was never a pope. Agape ---Samuelbb7 on 9/15/15 Read These Insightful Articles About Mortgages Cluny you said, \"Actually the canon of scripture was determined by one of the councils of the undivided church over 1000 years BEFORE 1546.\"\nAll the gosples were concluded about 90 AD no councils existed.\nCluny you said, \"That's been said by every heretic from Kerinthos onwards--for that matter, by the Scribes and Pharisees who rejected our Lord, God, and Savior Jesus Christ.\"\nIt has also been stated by every cult, \"Our church is the 1 and only True Church.\" Nicole you asked, \"Please name one Church, just one that was started by one of the five REFORMERS still as he started TODAY? ONE.\"\nAnd I did answer your question according to Smyrnaeans chapter 8. ---john9346 on 9/15/15 IF perhaps you read what I said,--kathr4453\nWhy talk about Polycarp if we are talking about the Reformers 13 centuries later???? I believe you are confused on the topic.\nLuther never founded a church,and never left the RCC.--kathr4453\nReally?\nLuther was a Catholic Priest.\nThe Lutheran Church was stared at the same time Luther was alive. His name, his church. Common Sense.\nSince the Lutheran Church isn't the RCC, then Luther HAD TO HAVE LEFT the RCC to have a Church named after his name.\nHistory can't be changed because you disagree with it.\nJesus is God, not Paul. Jesus gave Peter the keys to the KINGDOM, NOT Paul.\nFollow Jesus since His Blood saved you and I, not Paul's blood ---Nicole_Lacey on 9/15/15 Samuel, it's whether these men founded these denominations or whether denominations were founded because of these men . Luther never founded a church, and never left the RCC. But yes, your right, because of that we have churches built upon MAN. I'm of Calvin, I'm of Luther, I'm of Wesley, I'm of Apollo, I'm of Polycarp. And to have Polycarp interpretation of scripture held up as THE AUTHORITY of scripture, is insulting. Even in Paul's day it was common, he describes as carnality. But the RCC's answer is even worse. Paul never insisted on one man, or any man, the Pope, heading the church either. Christ is the HEAD, and all wisdom and knowledge come directly from Him to His Body....us. No middleman necessary. ---kathr4453 on 9/15/15 Kathyr. Some churches founded by the Reformers still in existence. Lutheran churches. Luther\nPresbyterian. Calvin\nJesus answered the Scribes with the Scripture and showed them they were only quoting parts and not following the full Scripture. Matthew 23:23\nWoe unto you, scribes and Pharisees, hypocrites! for ye pay tithe of mint and anise and cummin, and have omitted the weightier matters of the law, judgment, mercy, and faith: these ought ye to have done, and not to leave the other undone. ---Samuelbb7 on 9/14/15 Read These Insightful Articles About Personal Loans St Polycarp LIVED in the 2nd Century and one of the Fathers of the Church. CATHOLIC CHURCH. Know your history and time line.\n---Nicole_Lacey on 9/14/15\nI know when Polycarp lived Nicole. IF perhaps you read what I said, you would have understood NONE of Polycarps letters to the church ever made it into the Bible. Nor did Calvin's or Luthers. Anything apart from scripture is COMMENTARY. And ANYONE can write their own commentary whether 2nd century or 16th century. ---kathr4453 on 9/14/15 Samuel, Karen and John, you still NEVER answered by question. Please name one Church, just one that was started by one of the five REFORMERS still as he started TODAY? ONE.\n....soooooo you need mere men like Polycarp to explain to you. ---kathr4454 on 9/14/15 Soooo, you do know that the Reformers lived in the 16 century?\nSt Polycarp LIVED in the 2nd Century and one of the Fathers of the Church. CATHOLIC CHURCH. Know your history and time line. ---Nicole_Lacey on 9/14/15 \\\\rcc didn't even define books of the bible until 1546 \\\\\nActually the canon of scripture was determined by one of the councils of the undivided church over 1000 years BEFORE 1546.\nGlory to Jesus Christ! ---Cluny on 9/14/15 To say Passover or atonement is only for Jews is to say Jesus is only for Israel.\n---john9346 on 9/10/15\nBut then you provide nothing but a couple of supposed church fathers for witnesses. Judeans you haven't grasped yet are 1/13th of Israel. And why the \"New Covenant\" reads \"and with the house of Judah\": Heb_8:8 ...I will make a new covenant with the house of Israel and with the house of Judah:\nChrist himself said: Mat_15:24 ...I am not sent but unto the lost sheep of the house of Israel. Along with all the prophets, who blow the sand out from under your house. ---Trav on 9/14/15 Read These Insightful Articles About Auto Insurance \\\\The only thing we need to be quoting is scripture.\\\\\nThat's been said by every heretic from Kerinthos onwards--for that matter, by the Scribes and Pharisees who rejected our Lord, God, and Savior Jesus Christ.\nTo Him be glory. ---Cluny on 9/14/15 Good point Kathyr.\nThe Canon of Scripture was decided before the Christian church split in two. Nicole\nThe Reformers partially succeeded. Their actions brought about the counter reformation in which the worst of abuses of the RCC were curbed. You need to read some true history. There are Historians who give the facts. Nor rewrite the History of the Church to whitewash the events. I have books by Martin Luther and have read much by Wesley and Calvin even though they are not part of my church. There are Great Catholic writers which I have enjoyed. So why are you afraid to read what others have wrote?\nAgape ---Samuelbb7 on 9/14/15 Nicole you said, \"Sorry, but too many writings of TRUE Saints of the Church to waste time on writings from failed Reformers.\"\nThe reformers quoted the \"true saints.\" of the church in their writings.\n/////\nAs we see even today, many quote this one and that one calling them saints as though that was a sign to believe them.....bla bla bla. The only thing we need to be quoting is scripture...the WORD OF GOD. Some run to Polycarp or Calvin or Augustine for answers. Why not just go to scripture written by those GOD CALLED..... The Apostles and Prophets. The answer is...without the indwelling Holy Spirit, you can't understand the Scriptures....soooooo you need mere men like Polycarp to explain to you. ---kathr4454 on 9/14/15 Nicole you said, \"Sorry, but too many writings of TRUE Saints of the Church to waste time on writings from failed Reformers.\"\nThe reformers quoted the \"true saints.\" of the church in their writings.\nNicole you said, \"Again, name a Church still as when the Reformers died?\"\nthere is only 1 church, but its not rcc nor orthodox.\nNicole you said, \"The Church wrote the Bible, not the Bible wrote the Church.\"\nhistorical fabrication the rcc and orthodox didn't exist until 1054 AD rcc didn't even define books of the bible until 1546 the jews certainly weren't running to Rome or Constantinople saying, \"O tell us has God spoken?\" ---john9346 on 9/13/15 Read These Insightful Articles About Holidays GOD gave us the Bible all of it. He took none of it from us.--Samuelbb7\nStop trying to change history. Jesus or God (the same) GAVE US THE CHURCH.\nGive Scripture in the NT where Jesus gave us the Bible?\nChapter and Verse,\nMy Chapter and Verse where Jesus gave us the Church not the Bible is Matthew 16:18-19\nAnd you are Peter, and upon this rock I WILL BUILD MY CHURCH, and the gates of the netherworld shall not prevail against it.\nThe Church is complete, but even the Bible can't hold all of Jesus as written in John 21:24-25\nThere are also many other things that Jesus DID, BUT IF these were to be described individually, I do not think the whole world would contain the BOOKS THAT WOULD BE WRITTEN. ---Nicole_Lacey on 9/13/15 The apostles taught the death and resurrection of Jesus Christ. They were eye witnesses of His resurrection. Romans 10:9-10 is not the OT. However the OT testifies of Jesus, and His coming ...Jesus earthly ministry proves by the Law and Prophets Jesus is the Son of God. SOOO the Apostles did not JUST teach out of the OT. The MYSTERY wasn't even revealed until AFTER Jesus rose from the dead. ---kathr4453 on 9/13/15 GOD gave us the Bible all of it. He took none of it from us. 2Timothy 3:14-17\nBut continue thou in the things which thou hast learned and hast been assured of, knowing of whom thou hast learned them,\nAnd that from a child thou hast known the holy scriptures, which are able to make thee wise unto salvation through faith which is in Christ Jesus.\nAll scripture is given by inspiration of God, and is profitable for doctrine, for reproof, for correction, for instruction in ighteousness:\nThat the man of God may be perfect, throughly furnished unto all good works.\nThe Apostles taught out of the Bible they had. The Old Testament. Agape ---Samuelbb7 on 9/13/15 Calvin believed in infant baptism, certainly not from the original, but is RCC. Calvin murdered annabaptists who in fact believed in believers baptism, which is what the Bible teaches. Wycliffe was long before Calvin or Luther, as was Hess. There has always been from the beginning a remnant of TRUTH who never joined the RCC in the first place. They weren't called Protestants either. Protestant meaning is to protest Catholicism. True believers in the Cross, proclaimed the Gospel....... ---kathr4453 on 9/13/15 Read These Insightful Articles About Health Insurance Samuel BB said, \"...Both place traditions above scripture in their understanding of doctrine.\"\nFirst, let us define a word. Tradition does not mean the number of beads on a rosary, or the vestments a priest wears, etc. Tradition does mean the things that have come down through the ages, like the writings of St. Ignatius of Antioch, and the Divine Liturgy of St. John Chrysostom\nAlso, Tradition means fasting, prayer, almsgiving, feeding the hungry, giving water to the thirsty, clothing the naked, and visiting the sick and those in jail.\nAll these things are the traditions that we place on the same level as Scripture, not above.\nPray for me,\nthe unworthy monk Brendan ---Monk_Brendan on 9/13/15 He took the OT with him?.---micha9344\nFriend, Jewish people don't like you to call the Torah the OT.\nBecause the OT and NT makes up the Bible which means Testifying about who? Jesus being the Messiah.\nHere's a hint why: they don't BELIEVE Jesus is the Messiah.\nJust in case you didn't know.\nWhat are friends for if not to give a little information.\nAgain, name a Church still as when the Reformers died?\nYou can't.\\-Nicole_Lacey\nYou're right, not even the RCC.---micha9344\nYes, because the RCC knows there isn't a Church still standing today left by a Reformer.\nAnd your point, Micha?\nOh, you are making my point.\nThanks buddy.\nYou are a True Friend. ---Nicole_Lacey on 9/12/15 /We do agree Jesus left the Church, not a Bible when He ascended to Heaven.\\\nHe took the OT with him?\nLuke 4:4 And Jesus answered him, saying, It is written, That man shall not live by bread alone, but by every word of God. /The Church wrote the Bible, not the Bible wrote the Church.\\\nDan 4:30 The king spake, and said, Is not this great Babylon, that I have built for the house of the kingdom by the might of my power, and for the honour of my majesty? /Again, name a Church still as when the Reformers died?\nYou can't.\\-Nicole_Lacey on 9/11/15 You're right, not even the RCC. ---micha9344 on 9/12/15 Your are almost there as well, Samuel,\nNicole both the different Orthodox churches and the Roman Catholic claim to be the original. But they don't agree with each other.---Samuelbb7 on 9/11/15\nWe do agree we are not one in the same.\nWe do agree Jesus meant what HE said in John chapter 6.\nWe do agree Jesus left the Church, not a Bible when He ascended to Heaven.\nThe Church wrote the Bible, not the Bible wrote the Church.\nHave you ever read the writings of the 5 reformers??---john9346 on 9/11/15 Sorry, but too many writings of TRUE Saints of the Church to waste time on writings from failed Reformers.\nAgain, name a Church still as when the Reformers died?\nYou can't. ---Nicole_Lacey on 9/11/15 Read These Insightful Articles About Christian Dating Nicole you said, \"The word 'reform' means to re do the original.\"\nHave you ever read the writings of the 5 reformers?? ---john9346 on 9/11/15 Nicole both the different Orthodox churches and the Roman Catholic claim to be the original. But they don't agree with each other. Both place traditions above scripture in their understanding of doctrine.\nBoth have changed and modified their doctrine and it is recorded in history. So why should not the true Reformers go back to the original documents and use them as the foundation of their church. True people don't agree but them humans are not always agreeable. Agape ---Samuelbb7 on 9/11/15 The reformers wanted to reform the rcc,..---john9346\nYou are almost there, but you got lost in you own thinking.\nThe word 'reform' means to re do the original.\nSo, if the original isn't in the new it is hasn't been reformed.\nIf you have an old house that needs re-fixing, but the owner of the house refuses to allow you to touch it, so instead you build a new house copying the old house to the last nail.\nHave you remodeled the old house, or just built a new house?\nCan you claim you remodeled the old house?\nNo! As to the RCC, She has reformed Herself as Jesus instructed Her. Name one Church started by the famous 5 Reformers that is one, strong and GROWING today? ---Nicole_Lacey on 9/11/15 Brendan you asked, \"Is REFORMED Theology Reformed Catholicism?\"\n1. The reformation means to go back to that which was (from the beginning)\n2. Catholicism means universal (referring to church)\n3. The reformers wanted to reform the rcc, but realize it was impossible which led to ways to return to the beginning.\n4. Reform Theology is built on the 5 Solas (Scripture Alone, Grace Alone, Christ Alone, Faith Alone, and for the glory of God Alone.)\n---john9346 on 9/10/15 Read These Insightful Articles About Health Treatments", "source": "Christian Blogs"}