{"published": "2015-09-24T22:02:00Z", "media-type": "News", "title": "Naikon Hacking Group Has Ties with China's Military", "id": "a90d4890-5e04-4c77-ae57-fabb691f7817", "content": "Security researchers link a Chinese military officer to one of the group's servers, going way back to 2010   \nTwo security companies have found a tie between the Naikon hacking group and an officer in the Chinese People’s Liberation Army (PLA). \n \nThe research was carried out by ThreatConnect and Defense Group, and targeted Naikon, an advanced persistent threat (APT) group that had been first observed in 2010, mainly in the South East Asia region, gathering information from international companies and the governments of countries like Cambodia, Indonesia, Laos, Malaysia, Myanmar, Nepal, the Philippines, Singapore, and Vietnam. \n \nAccording to the report, a man named Ge Xing, officer in the Chinese People’s Liberation Army’s, Chengdu Military Region Second Technical Reconnaissance Bureau (Military Unit Cover Designator 78020), is believed to be controlling the greensky27.vicp.net domain, encountered many times in Naikon attacks, ranging back to its beginnings in 2010. \n \nAs security researchers point out, the IP address associated with that domain leads back to the Chinese town of Kunming. \n Evidence links a Chinese military officer to the activities of the Naikon group  \nSearching the Web for the Greensky27 moniker, researchers, to their surprise, found it being used on a slew of social media accounts and forums, all leading back to the same man, named Ge Xing. \n \nAnalyzing data shared on those accounts, researchers were able to determine that Ge Xing was not only a PLA officer but also stationed at the 78020 military unit, in the city of Kunming. \n \nStudying his activity on the social media sites, researchers were also able to determine that whenever Ge Xing would leave town or would have an important event in his family (the birth of his son), the greensky27.vicp.net would also go dormant at the same periods. \n \nAdditional evidence was also uncovered in QQ Weibo, a Chinese social networking site, where Ge Xing regularly posted photos from inside the Kunming military compound. \n \nAll these led researchers to believe that Ge Xing is one of the people behind Naikon, but more importantly, that the Chinese government is backing the group's activities. \n \nMore details can be found in the 86-pages research paper . \n \nThe link between Ge Xing and Naikon \n  \n  CHECK OUT THE GALLERY   (5 Images)", "source": "Softpedia"}