{"published": "2015-09-29T01:39:41Z", "media-type": "News", "title": "\"Designless\" brain-like chips created through artificial evolution", "id": "e4ed4ec6-f9c3-4058-bc1f-9f32775090a7", "content": "Scientists at the University of Twente in the Netherlands have devised a new type of electronic chip that takes after the human brain. Their device is highly power-conscious, massively parallel, and can manipulate data in arbitrary ways – even though it doesn't need to be explicitely designed to perform any task. The advance could pave the way for computers that think more like we do. \n (When the) chips are down  \nElectronic chips as they are currently designed come with plenty of drawbacks. Even the simplest operations, like adding or subtracting, need large numbers of transistors arranged in a very specific, well thought-out pattern. These transistors quickly add up and drain power even when idle (unless specific measures are taken). Moreover, most circuits can't effectively process information in parallel, leading to a further waste of time and energy. \n \nAll of these factors make it especially hard for today's computers to perform many crucial tasks quickly and on little power – particularly the kinds of tasks that the human brain can tackle with ease, like recognizing a visual pattern or understanding human language. In fact, when it comes to simulating brain-like functionality, many researchers have opted to abandon traditional computer architectures altogether. \n \nAlternative chip designs that try to mimic the prowess and efficiency of the brain usually do so by either resorting to massive parallelism or by using neuron-like structures as their basic building blocks. But these approaches retain one big drawback: they still rely on fallible human minds to design their hardware and software. \n No design needed  \nA research team led by professors Wilfried van der Wiel and Hajo Broersma is walking a different path. Remarkably, their device takes people out of the the circuit design equation altogether and leaves it to the chip itself to figure out how to best manipulate its inputs into the desired output through artificial evolution. \n \nTheir proof-of-principle device consists of a network of up to 100 densely interconnected gold nanoparticles, 20 nanometers in size, each acting as a tiny transistor . The researchers call it a natural computer , because the way in which the particles are interlinked is reminiscent of neural networks in the brain. Unlike in a standard circuit, the scientists themselves don't exactly know how the transistors in a natural computer connect with each other – but this doesn't stop the circuit from working as intended. \n \nHere's, in a nutshell, how it all works. The nanoparticle cluster can be thought of as a black box containing two input signals, one output signal, and six control voltages that are fed to the edge of the cluster and affect how the network elaborates its inputs. Rather than designing the entire circuit by hand, the researchers can simply look for the exact combination of control voltages that process all the inputs into the correct outputs. \n    \n\"Although we understand the generic physics principles underlying the cluster’s behavior, we do not know the actual current paths in the network on a nanoscale level,\" van der Weil told Gizmag. \n \nUsing \"designless\" systems such as this means that costly design mistakes are avoided, and in fact this approach can work around, or even take advantage of, material defects like crosstalk that must be avoided at all costs in conventional electronics. \n \nEven better, if the chip were to sustain heavy damage, it could still be reconfigured just as easily by adjusting the voltage values for the signals that control how the nanoparticle cluster manipulates the data. \n Natural selection and \"baby voltages\"  \nSelection of the optimal values for the six control voltages is not done manually or even by brute force, but instead by using something called a genetic algorithm (GA). In computer science, this is a clever (and well-known) way to optimize a set of parameters for an arbitrary condition. Just like the idea behind the circuit itself, GAs also take shameless inspiration from nature. \n \nThe basic idea behind GAs is to create successive \"generations\" of values by \"marrying\" them to each other (by combining them and adding an element of randomness), and then seeing which of the \"offspring\" is the best fit. This is in obvious analogy to the way in which natural selection picks, through successive generations, the optimal gene pool that is best adapted to live in the surrounding environment. \n \nThough this process is more complicated than mere bruteforcing, it's also much faster. In this case, the researchers say the process takes less than an hour (as opposed to several days) to find all of the six voltage parameters for a set condition. \n \nOptimizing the voltages for different functionalities, the researchers were able to indirectly \"program\" the chip to act as any one of the Boolean logic gates . This was done using a number of nanoparticles comparable to the number of transistors that would be needed to implement the same function on a standard chip. \n Toward brain-like computing  \nAccording to the researchers, this structure has great potential for saving energy compared to a standard chip: \n \n\"Natural computers have, in general, the promise to be more energy efficient,\" van der Weil told Gizmag. \"The promise for lower energy consumption is based on the fact that natural computers take more advantage of the computational power of matter than conventional computers, and that many computational processes occur in parallel as opposed to sequentially as in conventional computers.\" \n \nThe researchers also believe their device holds real promise with respect to complex tasks involving pattern recognition that the human brain excels at: \n \n\"In our device many operations can occur in parallel, analogous to information processing in the brain,\" van der Weil continued. \"We know that the brain, but also mathematical neural networks, are very suitable for pattern recognition. We believe that our system can be a physical realization of a cellular neural network with the accompanying advantages compared to conventional circuits.\" \n \nTheir invention doesn't come without drawbacks, however. One being that the system can currently only operate at temperatures close to absolute zero – though the scientists tell us this can be easily fixed. \n \n\"Our approach only works if the nanoparticles act as single-electron transistors and relies on Coulomb blockade ,\" says van der Wiel. \"For 20 nm nanoparticles this means that we have to be at temperatures lower than 5 Kelvin (-268° C, - 451° F) or so. However, there is no fundamental reason why our approach should not work at room temperature. This would require smaller nanoparticles.\" \n \nA more complex circuit may need to use clusters of 100 nanoparticles as its elementary block, since optimizing larger nanoparticle networks through signals that only reach its periphery could be difficult. \n \n\"We either need to go to interconnecting smaller networks, or to more advanced electrode configurations. This is work in progress,\" says van der Weil. \n \nThe next steps for the team's research will be to \"create larger networks with more complex functionality, preferably at room temperature.\" \n \nThe findings have been published on the journal Nature Nanoelectronics . \n\n \nSource: University of Twente", "source": "Gizmag"}