{"published": "2015-09-20T17:00:00Z", "media-type": "News", "title": "Ram 1500 EcoDiesel 2015 focuses on economy", "id": "4bc67bc3-e841-4f60-8bd6-b61bb38cb3cb", "content": "HALIFAX, N.S.  — One would think it would be an oxymoron to use the words “economical” and “pickup truck” in the same sentence.  \r \n\r \n\r\n                            But don’t tell the folks at Fiat Chrysler Automobiles (FCA), who are touting their Ram 1500 EcoDiesel as the antithesis of the traditional gas-guzzling pickup.   \r \n\r \n\r\n                            To demonstrate this fact, FCA Canada took us down to the Maritimes to drive a sampling of 2015 Ram EcoDiesel models and discover just how fuel-efficient they can be.   \r \n\r \n\r\n                            After all, Natural Resources Canada fuel consumption ratings are one thing and real-world driving is another.  \r \n\r \n\r\n                            The exercise was for four teams of two drivers to spend a half-day each in one of four Ram EcoDiesel vehicles, all with different trim levels. At the end of the two days the fuel economy numbers for all the vehicles would be tabulated to see how we fared.   \r \n\r \n\r\n                            The drive route started in Fredericton, N.B. early on a Wednesday morning, eventually heading to the picturesque Bay of Fundy area and then to the Confederation Bridge, which links New Brunswick to Prince Edward Island.   \r \n\r \n\r\n                            After an evening in Charlottetown, PEI, we headed to the Wood Islands ferry that would take us to Nova Scotia with our end point being the beautiful city of Halifax.  \r \n\r \n\r\n                            It was a wonderful drive with awesome scenery, wonderful vistas, friendly locals and some challenging roads.   \r \n\r \n\r\n                            There was quite a mixture of driving routes, but as much as possible we hugged the coastline to see the breathtaking scenery.   \r \n\r \n\r\n                            It was a nice test that demonstrates you don’t have to have a sedan, SUV or sports car to enjoy a driving holiday in this great country of ours. A fuel-efficient pickup like the Ram 1500 EcoDiesel will do quite nicely, thank you.  \r \n\r \n\r\n                            At the end of the day, the numbers tell the story. We visited three provinces, drove between 747.5 to 839.9 kilometres on a single tank of fuel and the fuel consumption numbers ranged from 8.6L/100 km to 9.3L/100 km, averaging 8.85.   \r \n\r \n\r\n                            That’s almost dead on the 8.8L/100 km EnerGuide highway number from the Government of Canada and our driving was a combination of both highway and city driving.   \r \n\r \n\r\n                            Pretty impressive numbers when you consider the size and the weight of these pickups that have a lot to offer the consumer who needs a truck for hauling or towing. And even if it’s just occasionally that you really need the utility of a pickup, with this EcoDiesel you’re not being penalized in the pocketbook.  \r \n\r \n\r\n                            Even after two days of driving through three provinces, we still had plenty of fuel left in the tanks, enough at least for another half day on the road and more than 1,200 kilometres in total on a tank of diesel fuel.  \r \n\r \n\r\n                            And for those unfamiliar with new breed of diesel, these aren’t the smoke belching, clattering engines of old. They are clean, quiet and smoke free.   \r \n\r \n\r\n                            The Ram 1500 is the only full-size, light-duty pickup on the market to offer a diesel powertrain. And it has been a popular option with customers as about one in four Ram 1500s sold in Canada this year is an EcoDiesel. As you move up the trim line, as many as 50 per cent of the high-end Laramie, Longhorn and Limited models have been diesel.  \r \n\r \n\r\n                            One wonders why other manufacturers haven’t gone this route, but FCA executives will be happy to have this market all to themselves. It has made Ram the second best-selling vehicle in the country and FCA’s top-selling model. At the end of August, Ram sales numbers sit at 62,487, a jump of seven per cent over 2014.  \r \n\r \n\r\n                            While you save at the fuel pumps, the Ram EcoDiesel is not inexpensive. Prices start at $39,295 (the EcoDiesel engine itself has an MSRP of $4,700) and the engine is available on all regular, quad or crew cabs.   \r \n\r \n\r\n                            The 3.0-litre turbocharged V6 EcoDiesel is paired with an eight-speed transmission and makes 240 hp and a class-leading 420 lb/ft of low-end torque. If you have to haul a boat or trailer, it has an impressive tow rating of 4,713 kg (9,200 lb).  \r \n\r \n\r\n                            The engine itself is built by VM Motori, an Italian manufacturer that has been a Chrysler supplier since 1992. The company was purchased outright by Fiat in 2013.  \r \n\r \n\r\n                            One model we tested is the high-end Laramie Limited in 4x4 Crew Cab format. It’s pricey, $71,760 as tested, but comes with all the bells and whistles like leather upholstery, dual zone climate control, chrome bumpers, heated first and second-row seats and ventilated front row seats. Four-wheel-drive is available on all trim levels and one feature that many buyers might find desirable is the optional four-corner air suspension ($1,695). With this system, the truck can be raised if you need more clearance and lowered for ease of entry and exit. At speed, the truck is automatically lowered for better aerodynamics and load leveling is also automatic.  \r \n\r \n\r\n                            Other models we tested included the, Big Horn 4x4 Crew Cab, Outdoorsman Quad Cab 4x4 and a Ram 1500 SLT Crew Cab 4x4. There are a multitude of variations, so visit www.ramtruck.ca for all the details.  \r \n\r \n\r\n                            The Ram 1500 is a popular choice among pickup buyers with any powertrain, but if fuel economy is your prime consideration then the 1500 EcoDiesel is the vehicle for you.  \r \n\r \n\r RAM 1500 ECODIESEL 2015 AT A GLANCE \r \n\r \n\r BODY STYLE: Full-size, half-ton light-duty pickup truck  \r \n\r \n\r DRIVE METHOD: Four-wheel-drive; eight-speed automatic transmission  \r \n\r \n\r ENGINE: Turbocharged 3.0-litre V6 EcoDiesel (240 hp, 420 lb/ft of torque at 2,000 rpm)  \r \n\r \n\r TOW RATING : 4,713 kg (9,200 lb)  \r \n\r \n\r FUEL ECONOMY : 12.1L/100 km city, 8.8L/100 km hwy.  \r \n\r \n\r PRICE: $39,295 to $56,135  \r \n\r \n\r WEB SITE:  www.ramtruck.ca \r \n\r \n\r WHAT’S BEST: The fuel economy of the EcoDiesel of course.  \r \n\r \n\r WHAT’S WORST: There’s a $4,700 premium for the diesel engine and $1,000 for the eight-speed TorqueFlite automatic transmission on certain models.  \r \n\r \n\r WHAT’S INTERESTING: Ram 1500 is the only full-size light duty pickup to offer a diesel powertrain.", "source": "DurhamRegion.com"}