{"published": "2015-09-11T04:37:12Z", "media-type": "News", "title": "Five reasons why hardware chain Masters has it all wrong", "id": "77824bc3-d85d-48bd-9643-1a8058902824", "content": "It's oh-so-ugly for Masters. There are gathering calls from investors and also from analysts to ditch the struggling hardware chain.\n\nSo where has it all gone so wrong?\n\nMasters' big box store format commands about 13,500sqm of retail real estate, which is a lot of space and a lot of stock, when the customers aren't coming through the door. \n\nAnd the only remedies are costly and complicated like sub-leasing space and sharing the floor with another retailer.\n\nMasters pricing strategy has never hit the mark for shoppers.\n\nIts big blue corporate brand didn't immediately speak value to customers.\n\nWithout the clout of some of the highest profile hardware brands, it doesn't have the firepower to go head to head on Bunnings on big name promotions. \n\nHardware is driven by the big, powerhouse brands. They give comfort to novice DIY-ers and, at the other end of the spectrum, the tradie who wants to have all their favourites.\n\nMasters seems to have underestimated the pulling power of names like Dulux and Makita.\n\nYou won't find these at Masters and it's hampered their attempts to price match Bunnings when they can't put up the same product at the same price.\n\nMasters settled for second rate locations in the hope that if they built it the shoppers would come.\n\nThe problem with these growth-belt suburbs is the consumers don't have the spending power that's within arm's reach of so much of the Bunnings network.\n\nMasters misjudged the demographics and its sales have suffered as a consequence.\n\nMasters sales need to double for the operation to break even, according to some analysts, and there's skepticism over the hardware chain's claim its new formats are driving big sales improvements.\n\nIn a year when Bunnings reported a $1.1 billion profit, Masters total sales didn't even reach that, hitting just $930 million\n\nMarket watchers are split over the solution but whatever Woolworths' new chief executive decides to do there's more pain to come.", "source": "Sydney Morning Herald"}