{"published": "2015-09-15T14:25:03Z", "media-type": "News", "title": "Caterpillar to Participate in the 2015 Morgan Stanley 3rd Annual Laguna Conference on September 17; Webcast Available", "id": "34339e57-fa55-4c2a-8ad9-dce5c6afb976", "content": "SOURCE Caterpillar Inc.\n\nPEORIA, Ill. \n\nThe event will be webcast in real-time and available to the public at https://cc.talkpoint.com/morg007/091615b_ae/?entity=30_QQ6DX2H. Listeners should go to the website at least 30 minutes before the live event to register and to download and install any necessary audio software. The webcast will be available for replay for 90 days; no transcripts from the presentation will be made available. \n\nAbout Caterpillar\n\nFor 90 years, Caterpillar Inc. has been making sustainable progress possible and driving positive change on every continent. Customers turn to Caterpillar to help them develop infrastructure, energy and natural resource assets. With 2014 sales and revenues of $55.184 billion \n\nForward-looking Statements\n\nCertain statements in this press release relate to future events and expectations and are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Words such as \"believe,\" \"estimate,\" \"will be,\" \"will,\" \"would,\" \"expect,\" \"anticipate,\" \"plan,\" \"project,\" \"intend,\" \"could,\" \"should\" or other similar words or expressions often identify forward-looking statements. All statements other than statements of historical fact are forward-looking statements, including, without limitation, statements regarding our outlook, projections, forecasts or trend descriptions. These statements do not guarantee future performance, and we do not undertake to update our forward-looking statements. Caterpillar's actual results may differ materially from those described or implied in our forward-looking statements based on a number of factors, including, but not limited to: (i) global and regional economic conditions and economic conditions in the industries we serve; (ii) government monetary or fiscal policies and infrastructure spending; (iii) commodity price changes, component price increases, fluctuations in demand for our products or significant shortages of component products; (iv) disruptions or volatility in global financial markets limiting our sources of liquidity or the liquidity of our customers, dealers and suppliers; (v) political and economic risks, commercial instability and events beyond our control in the countries in which we operate; (vi) failure to maintain our credit ratings and potential resulting increases to our cost of borrowing and adverse effects on our cost of funds, liquidity, competitive position and access to capital markets; (vii) our Financial Products segment's risks associated with the financial services industry; (viii) changes in interest rates or market liquidity conditions; (ix) an increase in delinquencies, repossessions or net losses of Cat Financial's customers; (x) new regulations or changes in financial services regulations; (xi) a failure to realize, or a delay in realizing, all of the anticipated benefits of our acquisitions, joint ventures or divestitures; (xii) international trade policies and their impact on demand for our products and our competitive position; (xiii) our ability to develop, produce and market quality products that meet our customers' needs; (xiv) the impact of the highly competitive environment in which we operate on our sales and pricing; (xv) failure to realize all of the anticipated benefits from initiatives to increase our productivity, efficiency and cash flow and to reduce costs; (xvi) additional restructuring costs or a failure to realize anticipated savings or benefits from past or future cost reduction actions; (xvii) inventory management decisions and sourcing practices of our dealers and our OEM customers; (xviii) compliance with environmental laws and regulations; (xix) alleged or actual violations of trade or anti-corruption laws and regulations; (xx) additional tax expense or exposure; (xxi) currency fluctuations; (xxii) our or Cat Financial's compliance with financial covenants; (xxiii) increased pension plan funding obligations; (xxiv) union disputes or other employee relations issues; (xxv) significant legal proceedings, claims, lawsuits or government investigations; (xxvi) changes in accounting standards; (xxvii) failure or breach of IT security; (xxviii) adverse effects of unexpected events including natural disasters; and (xxix) other factors described in more detail under \"Item 1A. Risk Factors\" in our Form 10-K filed with the SEC on February 17, 2015 \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/caterpillar-to-participate-in-the-2015-morgan-stanley-3rd-annual-laguna-conference-on-september-17-webcast-available-300142519.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "CW Richmond WUPV"}