{"published": "2015-09-26T00:10:34Z", "media-type": "News", "title": "New Hillary Clinton email chain discovered", "id": "b5bd25f7-ad0d-4933-b91f-d6cc3883de73", "content": "Official says 'small number' of Benghazi-related emails \n\nBy \n\nUpdated 09/25 2015 06:51PM \n\nCopyright 2015 Cable News Network/Turner Broadcasting System, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. \n\nAn email chain between former Secretary of State Hillary Clinton and then-commander of U.S. Central Command David Petraeus from January and February 2009 is raising questions about whether some of the emails on Clinton's private email server were mistakenly deemed personal and not included among the 55,000 pages of emails she turned over to the State Department. \n\nSeparately on Friday, a State Department official said a \"small number\" of Benghazi-related emails that had not been disclosed to the House committee investigating the 2012 terror attack had been discovered. \n\nIn the past few days, the State Department was contacted by the Department of Defense about the Clinton-Petraeus chain, two State Department officials said. The officials say the chain does not appear to include classified information, though an official determination has not been made. The chain included Clinton and Petraeus getting acquainted as well as some personnel matters, according to the officials. It was apparently considered personal by Clinton's team and therefore wasn't turned over to the State Department, the officials said. \n\nMost of the email chain was on an old email server Clinton says she no longer has access to, but the end of the email chain contained messages on the private server she used while in office, according to another official. The chain begins on January 10, 2009 and ends on Feb. 1, 2009 and contains less than 10 emails total between Clinton and Petraeus, the official said. \n\nState Department spokesman John Kirby said State received \"several copies of one email chain between former Secretary Clinton and then Commander of U.S. Central Command David Petraeus which were not previously in the possession of the Department\" from the Department of Defense and the State Inspector General. \"These emails are now in our possession and will be subject to Freedom of Information Act requests. Furthermore, we asked the IG to incorporate this matter into the review Secretary Kerry requested in March. We have also informed Congress of this matter.\" \n\nAlso on Friday, a State Department official also told CNN that in the process of turning over Libya-related emails to the Select Committee on Benghazi, it found a \"small number\" of Benghazi-related emails that had not been disclosed to the committee previously. These emails are among 925 Libya-related emails being turned over Friday and were found within the emails Clinton turned over to the State Department from her private server. The official said the emails were found because they have now been digitized and are easier to search. \n\nClinton turned over to State her work-related emails from the server and kept emails she deemed personal. The email server has since been turned over to the FBI, where investigators have been able to recover both the personal and work-related emails. The FBI is looking into whether any classified materials were mishandled.", "source": "MyEastTex"}