{"published": "2015-09-17T03:34:23Z", "media-type": "News", "title": "Hounds Tie Sets Up Win-And-In Finale In Harrisburg", "id": "e5e8111e-0afb-4e5a-9374-921a4fc892d3", "content": "The following recap was provided by the Pittsburgh Riverhounds \n \nPITTSBURGH (Sept. 16, 2015) – The Pittsburgh Riverhounds tied the United Soccer League regular season champion Rochester Rhinos 1-1 Wednesday night at Highmark Stadium to set up a pulsating finale to the Eastern Conference this Saturday night in Harrisburg. \n \nThe result allied with victories for the Harrisburg City Islanders and Richmond Kickers Wednesday leaves the Hounds needing to win in Pennsylvania’s state capital to clinch a spot in the USL playoffs. A tie or a loss will end the Hounds’ season. \n \nLebo Moloto broke the deadlock after 69 minutes of a typically cagey affair against the Rhinos with a brilliant curling shot from 30 yards. Christian Volesky leveled for the visitors with seven minutes remaining. \n \n“We didn’t play well in the first half and we played into their style,” said Hounds head coach Mark Steffens. “I thought we did well defensively and had the better of the play in the second half. \n \n“I’m proud of the guys.” \n \nThe Hounds (10-9-8, 38 points) lie in eighth place going into the final weekend. Harrisburg (11-10-6, 39 points) sits one point and one place ahead after thumping F.C. Montreal 5-0 earlier in the evening. Three points Saturday will pull Pittsburgh level with the fifth-placed Richmond Kickers (10-7-11, 41 points). Steffens’ men hold the head-to-head advantage over the Virginians. \n \nA scoreless first half was played to the tempo that the Rhinos preferred. Rochester’s towering fullback Onua Obasi proved prolific in winning his challenges and creating potentially dangerous turnovers in the midfield. \n \nRochester forward Steevan Dos Santos came closest to finding the net in the opening period with a low shot on 34 minutes that Hounds’ goalkeeper Calle Brown tipped onto his right post. \n \nMax Touloute looked lively early in the game after receiving his first start since Aug. 22. The Haitian forward dribbled through multiple opponents on 17 minutes before going down under a fair challenge in the penalty area. Kevin Kerr released Touloute into space on the right side on 29 minutes. Rochester’s stuffy defense closed him out before he could get his cross over toward the lurking Vini Dantas. \n \nMoloto netted his fifth goal of his first year in Pittsburgh with a stunning finish that left Rhinos goalkeeper Adam Grinwis helpless. The South African playmaker spun toward Rochester’s goal after receiving a pass from Rob Vincent before creating space via a sharp one-two with substitute Miro Cabrilo. Moloto arched a spectacular shot high above Grinwis’ reach and into the goalkeeper’s top left corner. \n \nGrinwis was much more active in the second half. Cabrilo hit a wicked shot on 81 minutes that looked to be slicing towards the far post until the Michigan Bucks product touched it wide. \n \nHolding onto late leads has been the Hounds’ Achilles heel this season. They were outdone again by a rapid Rhinos sequence when substitutes Colin Rolfe and Nate Bordeau combined to send Volesky clear on Brown’s goal. The 23-year-old forward clipped a neat finish over the sprawling goalkeeper. \n \nVincent almost won it for the Hounds on a 20-yard free kick two minutes later. The Steel Army’s Player of the Year unleashed a ferocious drive that drew an exceptional diving save out of Grinwis. \n \nThe Hounds travel to Harrisburg also holding the edge in the Keystone Derby series by virtue of two wins to the Islanders’ one. Kevin Kerr’s hat trick fired the Hounds to a 5-2 victory at Highmark Stadium to open the season back on March 28. Kerr then supplied the dramatic late winner on May 30 when Pittsburgh recovered from a 5-3 deficit in the final minute to record an incredible 6-5 win. \n \nHarrisburg pulled off its own breathtaking comeback at the Skyline Sports Complex on July 26 to recover from 3-1 down with 10 men to win 4-3 in stoppage time. \n \nA tie will be enough for the Riverhounds to lift the inaugural Keystone Derby Cup. Harrisburg must win by at least a 3-goal margin to keep the trophy in the Pennsylvania state capital during the offseason. \n \nScoring Summary: \nPGH – Lebo Moloto 69′ (Miro Cabrilo, Rob Vincent) \nROC – Christian Volesky 83′ (Nate Bordeau, Colin Rolfe) \n \nMisconduct Summary: \nPGH – Willie Hunt 50′ (caution) \n \nLine-ups: \nRiverhounds – Calle Brown, Mike Green, Anthony Arena, Willie Hunt, Matt Dallman, Danny Earls, Rob Vincent, Lebo Moloto, Kevin Kerr, Max Touloute (Tyler Pasher 61′), Vini Dantas (Miro Cabrilo 62′) \n \nRochester Rhinos – Adam Grinwis, Onua Obasi, Vasileios Apostolopoulos, Sean Totsch (Nate Bordeau 77′), Tony Walls, Mike Garza, Marcos Ugarte (Timi Mulgrew 73′), Alex Dixon, Jonny Mendoza (Kenardo Forbes 64′), Steevan Dos Santos (Colin Rolfe 73′), Christian Volesky (Grant Van De Casteele 88′) \n \nOfficials: \nGuido Gonzales Jr. (referee), Lucas Feathers, Justin Frear (assistants), Nathaniel Buck (fourth official) \n \nAttendance: 1,536", "source": "KDKA"}