{"published": "2015-09-03T11:37:43Z", "media-type": "News", "title": "Europe is reaching its breaking point", "id": "dd970ef6-ebd2-4be8-9226-7a3a6129891a", "content": "Laszlo Balogh/Reuters \n\nExhausted and confused, migrants crammed onto a train to the Hungarian border town of Sopron, clinging to doors and squeezing their children through open carriage windows.\n\nTrains to Vienna and beyond to Germany were cancelled, making it unclear what would be the next stop for the migrants - many of them refugees from wars in the Middle East.\n\nLeonhard Foeger/Reuters \n\nImages of a drowned three-year-old face down in the surf on Turkish beach, one of at least 12 who died there the previous day while trying to sail for a Greek island, appeared in newspapers across the continent, increasing public pressure on politicians to take action.\n\nAP \n\nThe influx has strained the European Union’s asylum system to breaking point, sowing division among its 28 nations and feeding the rise of right-wing populists.\n\nThe major EU countries have taken sharply opposing positions on whether to offer welcome. Germany plans to accept 800,000 refugees this year, while Britain has set up a program to allow in Syrians that has accepted just 216.\n\nLeonhard Foeger/Reuters \n\nNearly all of the migrants arrive on the EU's southern and eastern edges but press on for richer countries further north and west, creating havoc for a bloc that normally allows free movement internally but restricts it for undocumented migrants.\n\nLaszlo Balogh/Reuters \n\n“We want to go to Germany but that train in the station, maybe it goes nowhere. We heard it may go to a camp. So we will stay out here and wait,” said Ysra Mardini, a 17-year-old from the Syrian capital Damascus, dressed in jeans and a T-shirt.\n\nLaszlo Balogh/Reuters \n\nThey provide for the creation of holding zones on the country’s southern border with Serbia, where construction crews are completing a 3.5-metre-high fence.\n\nLaszlo Balogh/Reuters \n\nPrime Minister Viktor Orban, in Brussels for talks with European leaders, said Hungarians and Europeans were “full of fear because they see that the European leaders ... are not able to control the situation.”\n\nIn an opinion piece for Germany’s Frankfurt Allgemeine Zeitung, he wrote that his country was being “overrun” with refugees, most of which, he noted, were Muslims, not Christians.\n\n“That is an important question, because Europe and European culture have Christian roots. Or is it not already and in itself alarming that Europe’s Christian culture is barely in a position to uphold Europe’s own Christian values?” he asked. \n\nVirginia Mayo/Pool/Reuters \n\nGermany has begun accepting asylum claims from Syrian refugees regardless of where they entered the bloc, suspending rules which normally require them to register and remain in the first EU country they reach.\n\nBerlin's generosity has caused confusion for its neighbors, which have alternated this week between letting migrants pass through and blocking them. Hungary allowed thousands to board trains for Germany on Monday but then called a halt to the travel, leaving migrants camped in the summer heat in central Budapest.\n\nTwitter \n\nHis 5-year-old brother Galip and mother Rehan, 35, also died after their boat capsized while trying to reach the Greek island of Kos. His father, Abdullah, was found semi-conscious and taken to hospital.\n\nAbdullah’s sister Teema, a resident of Vancouver, said she heard the news from another of the boy's aunts: \"She had got a call from Abdullah, and all he said was, my wife and two boys are dead,\" Teema Kurdi was quoted as saying in Canada's National Post newspaper.\n\nHannibal Hanschke/Reuters \n\nEU Commission President Jean-Claude Juncker is expected to unveil proposals in an annual state-of-the-union address to the European parliament next week. Interior ministers hold an emergency meeting five days later.\n\nRead the original article on Reuters.", "source": "Business Insider"}