{"published": "2015-09-23T06:51:01Z", "media-type": "News", "title": "NASA technology to help airlines save fuel, time", "id": "aed9f5a2-2a4d-4884-ad4e-7180662fae4a", "content": "National Aeronautics and Space Administration Washington, Sep 23  \nTwo US airlines will soon begin testing a new NASA-developed software that is designed to help air carriers save time, cut fuel consumption and carbon emissions. \n \nDuring the next three years, Virgin America and Alaska Airlines will use the Traffic Aware Planner (TAP) application to make \"traffic aware strategic aircrew requests\" (TASAR), the US space agency said in a statement. \n \nTAP connects directly to the aircraft avionics information hub on the aircraft. \n \n\"It reads the current position and altitude of the aircraft, its flight route and other real-time information that defines the plane's current situation and active flight plan,\" explained David Wing, TASAR project lead at NASA's Langley Research Center in Hampton, Virginia. \n \nThen, it automatically looks for a variety of route and/or altitude changes that could save fuel or flight time and displays those solutions directly to the flight crew. \n \nTAP also scans the signals of nearby air traffic to avoid potential conflicts in any proposed flight path changes, making it easier for air traffic controllers to approve a pilot's route change request. \n \nFor airlines with internet connectivity in the cockpit, TAP also can access information -- such as real-time weather conditions, wind forecast updates and restricted airspace status -- to further increase flight efficiency. \n \nThe software is loaded onto a tablet computer, which many airline pilots already use for charts and flight calculations. \n \nEven four minutes of flight time shaved off of each leg of a trip made by an airline could result in massive fuel and time savings, according to researchers. \n \nThe software provided similar results in flight tests. A second round of flight tests was recently completed to ensure readiness for operational use by partner airlines. \n \n\"We are excited to partner with NASA to test this new technology that has the potential to help reduce fuel consumption and carbon emissions and save our guests time in the air,\" commented Steve Forte, Virgin America's chief operating officer in Burlingame, California. \n \nDevelopers say the new technology will not require changes to the roles and responsibilities of pilots or air traffic controllers.", "source": "ProKerala.com"}