{"published": "2015-09-28T17:31:31Z", "media-type": "News", "title": "Veterans 'thrilled' D-Day landing craft will be restored", "id": "e432f8bd-cec5-44c2-8741-d24b04b3e9a1", "content": "A group of veterans have visited the last D-Day landing craft in the UK as it heads for a £900,000 refurbishment after being rescued from a watery grave.\r\n\t\t\t\t\t\r\n\t\t\t\t\t\r\n\t\t\t\t\r \r \r\n\t\t\r \r \r \r \r\n\t\t\t\t\t\r \r\n\t\t\r \r\n\t\t\t\r\n\t\t\t\r\n\t\t\t\t\t\t\r \r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\t\r \r  \nA group of veterans have visited the last D-Day landing craft in the UK as it heads for a £900,000 refurbishment after being rescued from a watery grave. \n \nThe LCT 7074 was shown off at Portsmouth Naval Base after it was raised from the Liverpool Docks by the National Museum of the Royal Navy (NMRN) last year. \n \nThe Second World War Landing Craft Tank (LCT), one of the last in the world, is a veteran of the D-Day landings and is to be restored thanks to a £916,149 grant from the National Heritage Memorial Fund (NHMF). \n \nA small group of D-Day veterans, several of which served on similar LCT, were able to visit the vessel before the works commence. \n \nRon Smith, a wireman on LCT 947, a later model than the 7074 said: \"Memories immediately came flooding back as soon as I saw her. Her size, 2ft longer than HMS Victory apparently, struck me. We were thrilled to get a chance to see her today and can't wait to see her restored.\" \n \nProfessor Dominic Tweddle, director general of the National Museum of the Royal Navy, said: \"LCT 7074 is one of the last of these vital workhorses known to have participated in D-Day. Ordinary vessels, they performed an extraordinary task; carrying up to 10 Sherman tanks, and transporting almost all the heavy artillery and armoured vehicles that landed in Normandy. \n \n\"This allowed the amphibious force to win major engagements and remain equipped to fight for months without a friendly port. It is exceptionally moving to welcome the Veterans today, to share in their memories and ensure they are recorded forever.\" \n \nFiona Talbott, head of NHMF, said: \"Set-up as a memorial to those who have given their lives in service to this country, it's fitting that the National Heritage Memorial Fund has helped safeguard this remarkable survivor from the D-Day landings. She will now help future generations understand one of the most significant military campaigns in world history.\" \n \nA NMRM statement said: \"More than 800 LCTs took part in Operation Overlord, the D-Day landings on 6 June 1944, each capable of carrying 10 tanks or other heavy armoured vehicles into battle. \n \n\"Operation Neptune was the naval dimension of Overlord, the largest amphibious operation in history, in which more than 7,000 ships and craft of all sizes landed over 160,000 soldiers on the beaches of Normandy. Of this fleet, fewer than 10 are believed to survive, including LCT 7074 which is understood to be the only vessel of this kind left in Britain.\"", "source": "BT.com"}