{"published": "2015-09-13T19:10:04Z", "media-type": "News", "title": "Claudio Ranieri hails Leicester's spirit and character after comeback win", "id": "7ebc5dba-6495-4534-990a-f41ea6197392", "content": "Claudio Ranieri hailed the spirit and character of his players after seeing Leicester stage a remarkable comeback to defeat Midlands rivals Aston Villa 3-2. \n \nThe Foxes looked like losing their unbeaten start to the season after a couple of wonderful curling efforts from Jack Grealish, his first goal for Villa, and Carles Gil put the visitors firmly in the driving seat with less than half an hour to go. \n \nBut goals from Ritchie De Laet, whose effort was given with the aid of goal-line technology, Jamie Vardy and substitute Nathan Dyer, making his debut following his loan arrival from Swansea during the international break, saw Ranieri's men snatch victory from the jaws of defeat. \n \n\"My players were fantastic - fantastic spirit and character,\" said the affable Italian. \n \n\"At 2-0 I look at my players and they still believe it is possible. That is the spirit I love. The players believed in something good as a group and that is what I want. \n \n\"You can lose, of course, but it is important to fight until the end of the match. This victory is important to restart well after the break and to get three points is fantastic.\" \n \nLabelled 'the Tinkerman' from his previous spell in England with Chelsea a decade ago, Ranieri's return has actually been notable for his lack of changes. \n \nSunday was the first time he had swapped more than one player from the previous starting line-up, as Gokhan Inler was handed his full Barclays Premier League debut in place of Andy King and Shinji Okazaki replaced Ngolo Kante. \n \nBut it was his changes during the game that helped swing things back Leicester's way, introducing Dyer at half-time and moving Riyad Mahrez into a more central role before bringing on Leonardo Ulloa and Kante immediately after Villa went 2-0 ahead. \n   Promoted stories   \nThe 63-year-old received a lot of credit for the changes he made but he was quick to deflect the praise back on to his players. \n \n\"I saw that the team wanted something different, to keep the spirit going,\" he said. \n \n\"It gave motivation to the team and it was good. I told the players they were keeping the ball better than us but if we played together we could do something good, and the players did it - they did it all. \n \n\"I have a lot of experience but I said to the players that this group is fantastic and we must play this way every match because we are in this way.\" \n \nAll those months spent last season towards the foot of the table now seem like a distant memory with Leicester up to second after this victory. \n \nHowever, once again maintaining the club's top-flight status remains the aim for Ranieri. \n \n\"I talk to the players and say we have 11 points - we need another 29,\" he added. \n \n\"I don't know when we will achieve this, which month, but the sooner the better it is possible. This is our goal only at the moment. \n \n\"I don't think about what we can do, I just want the best.\" \n \nDyer's brave late header completed the fightback. The winger remained on the floor for a couple of minutes after clattering into goalkeeper Brad Guzan when heading the 89th-minute clincher, but eventually got to his feet to take the acclaim. \n \nAnd Ranieri reserved some special praise for his latest signing. \n \nHe said: \"It was very brave but every time he received the ball it was good for the team.\" \n \nFor just over and hour it was probably Villa's best performance of the season but they remain  without a league win since the opening day of the season and manager Tim Sherwood could not hide his dejection. \n \n\"I've never felt this bad, ever. Who cares? Who cares if we played well?\" he said. \n \n\"I'm bitterly disappointed for everyone associated with the club because the game is won with around 30 minutes to go. \n \n\"The game was done, it was finished with us 2-0 up. At this level the game should be dead and buried but unfortunately we've made some unforced errors and it has cost us the game. \n \n\"Individual errors. It has been happening a bit this season but it needs to stop happening. \n   \n Share article  \n   \n\"Those goals for Leicester, they haven't had to work very hard for them. \n \n\"The first goal gives them the momentum and unfortunately we couldn't wrestle it back off them. The only way you can do that is by keeping the ball off them and we just kept giving it back to them. It was not good enough.\"", "source": "Evesham Journal"}