{"published": "2015-09-05T05:51:15Z", "media-type": "News", "title": "We are realizing PM’s dream of Skilled India: Heptulla", "id": "8560f170-908e-411b-878b-b2e30c09d237", "content": "MUMBAI: Union Minister for Minority Affairs Najma Heptulla has said that her ministry is working to achieve PM Modi’s vision of making India the skill capital of the world and making it a reality amongst the minorities. \nThe first Education Minister of India, Maulana Abul Kalam Azad always considered education as the basis of human development and thus he wanted each and every citizen of India to get educated, she said. \nThe minister was speaking at the closing ceremony of skill development training programme here last evening, by Maulana Azad National Academy For Skills (MANAS), organized for awarding certificates to the students and disburse loan to the candidates preferring self employment. \nAzad always emphasised on creating a uniform education system so that the intellectual class of the country will have a balanced thought and concern, she added. \nThe PM today is concentrating more on skilling India according to modern requirements so that everybody is benefited, she said. \nHeptulla said Mumbai is the financial capital of the country and there is a trend of entrepreneurship and running one’s own business here. \n“Through MANAS, I would like to experience and prove that this trend of the city, can not only be implemented for the empowerment of Minorities, especially for women but will also open a new chapter in the history for the welfare of minorities in India. I am very happy to share with you that our efforts in Mumbai regarding empowering minorities have validated the results,” she said. \nThis initiative of MANAS will give strength to PM’s Make in India effort. Based on the positive results of the skill development efforts in suburbs like Bhandup, Mumbra, Sakinaka, Kurla and Meera Road, minorities in other areas of Maharashtra such as Bhivandi, Nagpur, and Baramati, will be trained according to the local requirements of the region, she said. \nWhile reminding people about the PM’s vision of empowering minorities and that he would like to see all Muslim youth in India hold Quran in one hand and computer in the other, she said that this will empower them and enable them in getting education as well as employment. \nSkill development centre has been created in madarsas for the benefit of minorities and this is a positive step towards involving minorities into the PM’s skill India mission towards realising Sabka Saath Sabka Vikas agenda. \nChief Minister Devendra Fadnavis, who was also present assured the minorities that the government of Maharashtra will give full support and cooperation to the works done towards their welfare. (AGENCIES) \n Share this:  Share With       Tweet", "source": "Daily Excelsior.com"}