{"published": "2015-09-18T19:31:08Z", "media-type": "News", "title": "Ciman back as Drogba, Impact get set to face first-place Revolution", "id": "d28f40d8-80c4-4a2c-8866-ad58bbfc3f26", "content": "MONTREAL - A sellout crowd will be on hand to see Didier Drogba and the Montreal Impact put their three-game unbeaten run on the line against the top team in Major League Soccer's Eastern Conference.\n\nThe New England Revolution (13-9-7) are coming off a 2-1 win over the New York Red Bulls that extended their winning streak to six games and left them unbeaten in eight. \n\nThey are up against an Impact side that looks to have new life since Mauro Biello replaced fired head coach Frank Klopas and Drogba, a former Chelsea star, made his first start two weeks ago. The Impact (9-11-6) responded with a victory at home over Chicago and followed with impressive draws of 0-0 in Los Angeles and 1-1 at San Jose.\n\nThe tie in San Jose looked unlikely when, playing without Drogba, Ignacio Piatti and other top players, they fell behind in the first half and then saw fullback Ambroise Oyongo sent off four minutes after the intermission.\n\nRarely used Kyle Bekker scored in the 65th minute to steal a much-needed point on the road.\n\n\"It's even more encouraging that we earned this point having gone into the half down a goal,\" defender Hassoun Camara, who returned from an injury, said on the Impact website. \"We want to continue this run of form and play well over our next few games to earn a playoff spot.\"\n\nDrogba and a handful of players were sent home after the Los Angeles game to rest up for the meeting with New England, the first of three straight home games that will do much to determine if the sixth-place Impact make the playoffs. After that stretch, they are on the road for four in a row.\n\n\"We had guys who hadn't played together in a while and to go down a goal and then down a man, yet come back and tie (the) game was a tremendous result,\" said Biello. \"I believe in this team and all the players that I have.\"\n\nCentral defender Laurent Ciman will return from a two-game suspension, so most of the team's first 11 will be together, although Oyongo is suspended.\n\nA party atmosphere took over Saputo Stadium for Montreal's last home game, a 4-3 win in which Drogba scored three times in his first MLS start. \n\nThe Revolution can clinch a playoff spot for a third straight year with a victory in Montreal.\n\nMidfielder Jermaine Jones will return from a suspension but defender London Woodberry will sit out a game for yellow card accumulation.", "source": "Brandon Sun"}