{"published": "2015-09-08T13:29:00Z", "media-type": "News", "title": "Strike Ten Entertainment Announces New Partnership With Richard Petty Motorsports", "id": "bc64bb5c-cf54-4ecd-bc24-8341a868c9e0", "content": "SOURCE Strike Ten Entertainment\n\nGoBowling.com to Sponsor No. 9 Car at Richmond International Raceway for the Federated Auto Parts 400 NASCAR Sprint Cup Series\n\nARLINGTON, Texas \n\nGoBowling.com is the destination for bowling fans and enthusiasts seeking news and information about one of America's favorite pastimes and the nation's number one participatory sport – bowling. This isn't GoBowling.com's first race – the website partnered with Richard Petty Motorsports \n\n\"We are very excited to once again partner with Richard Petty Motorsports \n\n\"There is so much energy and attention on this race, it's a night that you want to be a part of,\" said Tom Martino \n\n\"We couldn't be happier to have GoBowling.com continue their commitment with Richard Petty Motorsports \n\nThe last race before The Chase for the NASCAR Sprint Cup at Richmond \n\nAbout GoBowling.com \n\nGoBowling.com is the destination for bowling fans and enthusiasts seeking news and information about one of America's favorite pastimes and the nation's number one participatory sport. With more than 67 million people taking to the lanes every year, GoBowling.com is a one-stop location where people of all ages can go to satisfy their love of bowling. Consumers turn to GoBowling.com every day to find bowling fun – discovering new bowling centers, tips and tricks to use on the lanes, event news and great deals at more than 2,100+ family-friendly bowling centers across the country.\n\nAbout Strike Ten Entertainment\n\nHeadquartered in Arlington, Texas \n\nAbout Bowling Proprietors' Association of America (BPAA)\n\nFounded in 1932, the mission of Bowling Proprietors' Association of America (BPAA) is to enhance the profitability of all of its members. Headquartered in Arlington, Texas \n\nAbout Richard Petty Motorsports\n\nA performance and marketing driven company, Richard Petty Motorsports \n\nLogo - http://photos.prnewswire.com/prnh/20150907/264145LOGO Logo - http://photos.prnewswire.com/prnh/20150907/264144LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/strike-ten-entertainment-announces-new-partnership-with-richard-petty-motorsports-300138659.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KYTX CBS 19"}