{"published": "2015-09-14T13:08:22Z", "media-type": "News", "title": "PM Turnbull: change is our friend", "id": "918612c9-b7b8-4ad6-b359-fe077e1906c4", "content": "10:45 PM \n\nPRIME Minister-designate Malcolm Turnbull and Deputy Julie Bishop have emerged from the party room to face the media pack. \n\nMr Turnbull said it was a very important day for Australia and for the Liberal Party. \n\n\"I \n\n\" \n\nMr Turnbull thanked his predecessor for his work on establishing free trade agreements and border security and said he was humbled by the responsibility given to him as the new Prime Minister. \n\n\"We \n\nHe assured political conservatives it would be a \"thoroughly Liberal government\" . \n\n\"It'll be focused on ensuring \n\n\" 10:00 PM: MORE than five years after Tony Abbott took the Liberal Party leadership from him, former leader Malcolm Turnbull returned the favour in Canberra on Monday. \n\nAfter deciding not to challenge Mr Abbott for the leadership during Mr Abbott's \"near-death experience\" in February, Mr Turnbull ended weeks of speculation calling for a \"new style of leadership\". \n\nAfter a late party room meeting, Chief Government Whip Scott Buchholz announced Mr Turnbull had won the leadership ballot 54 votes to Mr Abbott's 44 votes. \n\nForeign Minister Julie Bishop remains as Deputy Liberal leader, switching her allegiance to Mr Turnbull and defeating contender and Abbott ally Kevin Andrews 70 votes to 30. \n\nMr Turnbull had originally lost the Liberal leadership to Mr Abbott by one vote in 2009, due to his support for a carbon price system at the time. \n\nPending official appointment by Governor-General Peter Cosgrove, Mr Turnbull will sit the remainder of this week in Canberra as Prime Minister-designate. \n\nWA MP Luke Simpkins, who brought on the unsuccessful spill earlier this year, told media it was time for a \"new beginning\". \n\n\"I think the Prime Minister Tony is a great guy and a man of great principle… but unfortunately people just weren't listening anymore,\" he said. \n\n\"It was difficult to get a message through and we're not looking forward to a new beginning.\" \n\nMORE: \n\nBOOKIES PICK TURNBULL TO WIN SPILL 8PM Abetz: 'changing leaders does not win elections' \n\nTHE number of politicians weighing in on the Liberal leadership spill continues as Australia waits for the results from the party room meeting. \n\nKey Cabinet allies of Mr Abbott so far include Eric Abetz, Kevin Andrews, Peter Dutton, Deputy Prime Minister Warren Truss and Treasurer Joe Hockey. \n\nFormer Victorian Liberal premier Jeff Kennett has also voiced his support for Tony Abbott, going so far as to call Mr Turnbull a \"self-centered, selfish individual\". \n\n\"It's always been about you. You and K Rudd have so much in common,\" he wrote. \n\nMr Kennett later told media Mr Turnbull was opportunistic and had committed an act of \"gross disloyal extreme egotism\". \n\nHe labelled him \"without a doubt, the Kevin Rudd of the Liberal Party\". \n\n\"We must be the laughing stock to the world… to John Key in New Zealand to David Cameron in the United Kingdom…,\" he said. \n\nMr Abetz said the public expected team work and team work. \n\nHe said good leaders had clear values, policy consistency and integrity. \n\n\"The flood of messages …. (are) clear - keep Tony Abbott as Prime Minister and don't behave like the Labor party did,\" he said. \n\n\"Changing leaders does not win elections. \n\n\"Tony Abbott won the last election and he will win the next. \n\n\"His focus has been creating job, pursing economic growth, national security and developing the infrastructure needed for the 21st century. \n\n\"Overwhelmingly the messages of support into our office is Tony Abbott is the choice … as Prime Minister.\" \n\nThe ballot is due to take place at 9.15 pm tonight. \n\nWHAT do you think? Should the LNP replace Tony Abbott as leader? If so who do you think would do a better job? Join our watercooler conversation today by leaving your comment below. \n\nMeanwhile, the realm of social media is trying to find the humour in Australia's political turmoil. \n\nThe hashtag #putoutyouronions is trending, referring to the Prime Minister's penchant for biting into whole raw onions. \n\nEARLIER: Abbott: 'there will be a ballot tonight and I expect to win' \n\nA BALLOT for the Liberal party leadership and deputy leadership will be held tonight. \n\nPrime Minister Tony Abbott called a press conference this evening to announce the meeting. \n\nHe reminded voters of his government's achievements including stopping the boats, tax cuts and increased jobs. \n\n\"We have laid the \n\n\"The Prime \n\n\" \n\n\" \n\n\"Let me finish on this \n\nMeanwhile Treasurer Joe Hockey has thrown his support behind the Prime Minister. \n\n\"The disloyalty of some has been outrageous,\" he said. \n\n\"We must not become a carbon copy of the Labor party.\" \n\n\"You have the right to hire and only you have the right to fire. \n\n\"The Australian people deserve better. \n\n\"The PM has my absolute loyalty, as I have his.\" \n\nDeputy Prime Minister and Nationals leader Warren Truss said his Coalition agreement was with Tony Abbott and a new deal would need to be renegotiated if there was a leadership change. \n\n\"Tony Abbott has been a very inclusive leader and we've achieved a great deal together,\" he said. \n\n\"The Nationals remain steadfast and united in delivering our agenda with new gains for regional Australia. \n\n\"And we want that to continue into the future.\" \n\nOpposition Leader Bill Shorten said Mr Turnbull has supported two bad budgets, rising unemployment, cuts to pension and a collapse in confidence in our economy. \n\n\"He's ambitious for himself, not our nation,\" he said \n\n\"Australians rejected MT when he was opposition leader because he was out of touch … arrogant. Nothing's changed. \n\n\"Australia needs a change of government and Labor will be up for the fight no matter who the Liberal party selects.\" \n\nTurnbull challenges Abbott: 'we need advocacy not slogans' \n\nCOMMUNICATIONS Minister Malcolm Turnbull has resigned from Cabinet and met with the Prime Minister this afternoon to request a ballot for the party leadership. \n\nJulie Bishop has also met with the Prime Minister today on the same issue. \n\nSpeaking to the media this afternoon, Mr Turnbull said he has made his decision based on the urging of \"many people over a long period of time.\" \n\n\"Now this is not a decision that anyone could take lightly. I have consulted with many, many colleagues, many Australians, many of our supporters in every walk of life,\" he said \n\n\" It is clear enough that the Government is not successful in providing the economic leadership that we need. It is not the fault of individual ministers. \n\n\"Ultimately, the Prime Minister has not been capable of providing the economic leadership our nation needs. He has not been capable of providing the economic confidence that business needs. \n\n\"Now we are living as Australians in the most exciting time. The big economic changes that we're living through here and around the world offer enormous challenges and enormous opportunities. \n\n\"We need a different style of leadership. We need a style of leadership that explains those challenges and opportunities, explains the challenges and how to seize the opportunities. A style of leadership that respects the people's intelligence, that explains these complex issues and then sets out the course of action we believe we should take and makes a case for it. We need advocacy, not slogans. \n\n\"We need to respect the intelligence of the Australian people.\" \n\nMr Turnbull said if Tony Abbott led the party into the next election, Labor would be sure to win. \n\n\"We have lost 30 Newspolls in a row. It is clear that the people have made up their mind about Mr Abbott's leadership.\" \n\nA spill ballot will be held tomorrow. \n\nMr Abbott survived a leadership challenge in February by 61 votes to 39. \n\nEARLIER: Knives out for Abbott: \"This time they will get him\" \n\nPRIME Minister Tony Abbott will face a leadership spill before the year is out, according to news reports today, with senior Ministers claiming this time \"they will get him''. \n\nThe ABC reported it had spoken to eight ministers and six believe Mr Abbott will be challenged no matter what happens at the Canning by-election in Western Australia next Saturday. \n\n\"And this time I think they will get him,\" one minister said. \n\nA double-digit swing against the Liberal Party in Canning would fuel the unrest. \n\nBoth the News Limited Galaxy poll and the Fairfax Ipsos poll point to a 10-point swing. \n\nThe Ipsos poll has the Liberal Party leading Labor after preferences are distributed by 52 to 48 per cent - it was 62 to 38 per cent at the 2013 general election. \n\n\"And that's after we spent $1 million on that seat to save the Prime Minister, and Labor has spent nothing,\" one Cabinet minister said. \n\n\"He said: 'Give me six months.' Well, he has had six months and things have gone from bad to worse. \n\n\"He should just resign.\" \n\nFairfax reported a savage swing in friendly LNP territory in WA would be a 'political death threat to the Abbott government''. \n\nThe Abbott government has now been in a losing position in the national polls for 18 consecutive months. \n\nMPs and Ministers are increasingly saying the problem comes from the PM's office and the way in which Cabinet processes are being bypassed. \n\nMPs and senators increasingly are losing confidence in Abbott's ability to turn the situation around, Fairfax reported.", "source": "Daily News"}