{"published": "2015-09-03T19:12:30Z", "media-type": "News", "title": "Wall Street higher ahead of key U.S. jobs data", "id": "cbdf1c1a-5027-4b72-9c2f-a325d7af08eb", "content": "By (Reuters) - Wall Street rose on Thursday after European Central Bank chief Mario Draghi hinted at additional stimulus measures and ahead of a key U.S. jobs report that could figure in the Federal Reserve's decision about when to lift interest rates.\n\nMajor U.S. indices relinquished stronger gains of over 1 percent but stayed in positive territory, with ongoing worries about China's economy on the minds of investors.\n\n\"Whether it's in the U.S., Japan or Europe, the market likes quantitative easing,\" said Joe Saluzzi, co-manager of trading at Themis Trading in Chatham, New Jersey. \"But China concerns have not gone away.\" \n\n\"I’m expecting choppiness for a while longer.\"\n\nDraghi's remarks came a day ahead of the monthly U.S. nonfarm payrolls data, which is expected to show that the economy added 220,000 nonfarm jobs in August, up from 215,000 in July.\n\nThe combination of a healing U.S. labour market and worries about a stumbling Chinese economy are challenging the Fed as it heads into a meeting on Sept 16-17 where it may raise interest rates for the first time since 2006.\n\nNear-zero rates have allowed the U.S. stock market to stage a spectacular bull-run since the financial crisis. But the market was rocked by volatility in the past two weeks, triggered by fears of slowing growth in China.\n\nSome investors believe the market turmoil, which left the S&P 500 with its biggest monthly drop in three years in August, may lead the Fed to delay a rate hike until the end of the year.\n\nThe CBOE Volatility index .VIX, known as Wall Street's \"fear gauge\", fell 1.65 percent to 25.64 on Thursday, slightly above the long-term average of 20. The index had spiked as much as 53.29 early last week.\n\nAt 2:53 pm, the Dow Jones industrial average .DJI rose 0.37 percent to 16,412.58 and the S&P 500 .SPX gained 0.41 percent to 1,956.93. The Nasdaq Composite .IXIC added 0.09 percent to 4,754.28.\n\nNine of the 10 major S&P sectors were higher, with the telecommunications index's .SPLRCL 1.0 percent rise leading the advancers.\n\nApple was the biggest drag on S&P 500 with a 1.36 percent drop while Intel's 2.15 percent gain helped push the index higher.\n\nJoy Global's shares were down 16 percent after the mining equipment maker reported a fall in quarterly profit and cut its full-year forecast.\n\nCaterpillar also fell 2.6 percent and was the biggest drag on the Dow.\n\nAdvancing issues outnumbered decliners on the NYSE by 1,961 to 1,012. On the Nasdaq, 1,530 issues rose and 1,236 fell.\n\nThe S&P 500 index showed no new 52-week highs and one new low, while the Nasdaq recorded 28 new highs and 32 new lows.\n\n(Reporting by Tanya Agrawal; Editing by Saumyadeb Chakrabarty and Chizu Nomiyama)", "source": "Yahoo! News"}