{"published": "2015-09-10T18:03:52Z", "media-type": "News", "title": "Newtown Township Supervisors unanimously pass resolution supporting a continued moratorium against fracking here", "id": "890ec8f3-ad38-4d1d-b319-0b748610c089", "content": "By D.E. Schlatter \nDigital First Media \n   \n\n    \nNEWTOWN TOWNSHIP >> It didn’t take long for the board of supervisors to go on the record with their opposition to fracking, unanimously approving a succinctly-worded resolution asking that two moratoriums banning the practice in Bucks County and the Delaware River Basin be kept in place. \n\nThe resolution, which passed by a 5-0 vote at the Sept. 9 supervisors’ meeting, calls on the Delaware River Basin Commission (DRBC) to make permanent its moratorium on shale gas development, which up until now, does not have a hard-and-fast expiration date. \n\nIn addition, the resolution asks the Commonwealth of Pennsylvania to also keep in place its moratorium against issuing permits to drill for oil or natural gas in southeastern Pennsylvania. \n\nThe state’s five-year moratorium on the controversial practice is set to expire on Jan. 1, 2018. \n \nVoting for the resolution were: Chairman Ryan Gallagher and Vice Chairman Mike Gallagher, as well as Supervisors Kyle Davis Phil Calabro and Jennifer Dix. \n\nCopies of the resolution will be sent to the DRBC, Gov. Tom Wolf and the state legislature asking them to support the moratoriums. \n\nAccording to the resolution, Pennsylvanians are entitled to clean air and pure water. It also claims that the state and DRBC have not conducted proper assessments of the long-term effects on hydraulic oil and natural gas drilling on residents' health and the environment. \n\nThe resolution also states: “In the absence of such assessment, it is impossible to determine whether or not shale gas development can proceed safely without creating risks to public health, property values and clean air and water.” \n\nFracking opponents who packed the meeting applauded the vote, including Elizabeth Tatham of Holland. \n\n“I appreciate you following up so quickly,” she told the board. “Thank you for being proactive and this resolution will help Newtown.” Continued... \n  According to the opponents, if fracking is allowed in the area it would create health, safety and environmental problems, with the top worry being groundwater contamination. \nFracking, which refers to hydraulic fracturing, is when large amounts of water or other chemicals are forced into a drilled shaft at high pressure to loosen oil, natural gas or other resources from thousands of feet underground. \n\nIf, or when, the state and DRBC moratoriums are lifted, drilling companies are expected to seek permission to drill in southeastern Pennsylvania in what is known as the South Newark Basin. \n\nThe basin includes all of Bucks County and parts of Montgomery County. \n\nHowever, at this time there are no known deposits in Newtown, Wrightstown and Upper Makefield townships, which make up the Joint Municipal Zoning Ordinance (JMZO), or what is commonly referred to as “the jointure.” \n\nIn order to regulate where that drilling could occur in the jointure, jointure officials have drafted a 17-page ordinance limiting fracking to a zoned area in Wrightstown Township where the quarries currently are located. \n\nThe proposed ordinance was presented to the other two jointure members for consideration. \n\nCoincidentally, Wrightstown has four-areas specifically zoned for quarries and currently there is very little quarry land now available. \n\nAll three municipalities would have to pass the proposed ordinance for it to take effect. \n\nTownship solicitors have warned that if no specific areas are designated, then drilling companies could challenge municipalities in court, claiming that restrictive zoning prevents them from conducting business. Continued... \n  However, opponents argued that such an ordinance, no matter how well-intended, should not be approved, instead claiming that officials in the jointure should ban the practice outright. \nMarguerite Chandler of the Pennswood Village retirement community in Middletown Township has been fighting fracking for years. \n\nAccording to Chandler, properties which have drilling leases on them, especially those with well-water supplies, are finding it harder to get mortgages and homeowners’ insurance. \n\nShe said that neighboring properties to those with leases are also negatively affected. \n\nIn addition, Chandler noted that local governments may also be responsible if a drilling company is underinsured and streams or the Delaware River watershed is contaminated for the millions of people who depend on it for drinking water. \n\nAt a July 8 meeting, anti-fracking activists had implored the Newtown supervisors to formally oppose the practice. \n\nVice Chairman Mike Gallagher had told the group that the board supported their efforts to keep fracking out not only Newtown Township, but all of Bucks County. \n\n“We're with you on this,” he had said. “Our job is being proactive.” \n\nAnd Gallagher had explained that the proposal to relegate fracking to the Wrightstown quarries is a legal strategy that the jointure has come up with for when the moratorium is lifted. \n\n“Let's figure out how we can stop fracking,” Gallagher asserted. “How do we defend against the driller who wants to come in and take our natural resources?” Continued... \n  Fellow supervisors agreed that they don’t want oil and natural gas drilling in the township. \nMany opponents point out that New York State banned fracking after seven years of exhaustive scientific studies, concluding that it would create unsatisfactory health and safety issues. \n\nTracy Carluccio, deputy director of the Delaware Riverkeeper Network, a non-profit volunteer group which helps protect the Delaware River watershed, has suggested that the DRBC should make its fracking moratorium permanent. \n\n“Shallow (fracked) wells are close to aquifers and will contaminate groundwater,” she had stated at the July supervisors’ meeting. “Five percent of all wells drilled leak within five years.” \n\nCarluccio attended the latest supervisors’ meeting and presented the board with updated materials on fracking’s alleged dangers. \n\nIn other action at the meeting, the board unanimously approved the hiring Gilmore &Associates, Inc. as the township's trail consultant. \n\nThe New Britain-based engineering firm was one of three finalists that the supervisors interviewed for the newly-created position. \n\nGilmore & Associates will be tasked to come up with a “Comprehensive Trail Plan” to link and enhance Newtown Township’s numerous trails to make them more attractive to hikers and bikers. \n\nFostering economic development and attracting recreational tourism will also key components of that plan, as is protecting the environment. \n\nOver the years, a number of the existing area trails have been developed by public and private entities, but the paths are now somewhat scattershot around the township. \n\nIn his State of the Township message in January, Supervisor Chairman Ryan Gallagher said that one of his goals for 2015 is creating a comprehensive trail strategy. \n\nAnd in a 4-1 vote, with Supervisor Dix dissenting, the board also approved hiring a company to update the township's somewhat antiquated website. \n\nFive bids were received and the Wrightstown-based AnchorMark Branding Co. was chosen to overhaul the municipal Web page, not only sprucing it up, but also providing residents with more information and linking the site to social media, including Facebook. \n\nAnchorMark bid $15,000 for the project, money which was allocated in the 2015 township budget for website improvement. \n\nOne of the planned upgrades would help the site integrate better with mobile devices, such as smartphones, which is a problem for the current website. \n\nIn addition, township forms for permits would still be available online, but there would also be a way to pay fees on the website. \n\nVideos of supervisors’ meetings now posted online would also be improved. \n\nThe planned changes include allowing a person who is watching the supervisors' meeting live on a cable access channel to have the capability to go online and pull up the same Google Docs packet of public information that is on each supervisor's desktop computer. \n\nWhen completed the new website is expected to be much easier for administrators to change the information, so it could be updated more regularly. \r \n NEWTOWN TOWNSHIP >> It didn’t take long for the board of supervisors to go on the record with their opposition to fracking, unanimously approving a succinctly-worded resolution asking that two moratoriums banning the practice in Bucks County and the Delaware River Basin be kept in place. \nThe resolution, which passed by a 5-0 vote at the Sept. 9 supervisors’ meeting, calls on the Delaware River Basin Commission (DRBC) to make permanent its moratorium on shale gas development, which up until now, does not have a hard-and-fast expiration date. \n\nIn addition, the resolution asks the Commonwealth of Pennsylvania to also keep in place its moratorium against issuing permits to drill for oil or natural gas in southeastern Pennsylvania. \n\nThe state’s five-year moratorium on the controversial practice is set to expire on Jan. 1, 2018. \n\nVoting for the resolution were: Chairman Ryan Gallagher and Vice Chairman Mike Gallagher, as well as Supervisors Kyle Davis Phil Calabro and Jennifer Dix. \n\nCopies of the resolution will be sent to the DRBC, Gov. Tom Wolf and the state legislature asking them to support the moratoriums. \n\nAccording to the resolution, Pennsylvanians are entitled to clean air and pure water. It also claims that the state and DRBC have not conducted proper assessments of the long-term effects on hydraulic oil and natural gas drilling on residents' health and the environment. \n\nThe resolution also states: “In the absence of such assessment, it is impossible to determine whether or not shale gas development can proceed safely without creating risks to public health, property values and clean air and water.” \n\nFracking opponents who packed the meeting applauded the vote, including Elizabeth Tatham of Holland. \n\n“I appreciate you following up so quickly,” she told the board. “Thank you for being proactive and this resolution will help Newtown.” \n\nAccording to the opponents, if fracking is allowed in the area it would create health, safety and environmental problems, with the top worry being groundwater contamination. \n\nFracking, which refers to hydraulic fracturing, is when large amounts of water or other chemicals are forced into a drilled shaft at high pressure to loosen oil, natural gas or other resources from thousands of feet underground. \n\nIf, or when, the state and DRBC moratoriums are lifted, drilling companies are expected to seek permission to drill in southeastern Pennsylvania in what is known as the South Newark Basin. \n\nThe basin includes all of Bucks County and parts of Montgomery County. \n\nHowever, at this time there are no known deposits in Newtown, Wrightstown and Upper Makefield townships, which make up the Joint Municipal Zoning Ordinance (JMZO), or what is commonly referred to as “the jointure.” \n\nIn order to regulate where that drilling could occur in the jointure, jointure officials have drafted a 17-page ordinance limiting fracking to a zoned area in Wrightstown Township where the quarries currently are located. \n\nThe proposed ordinance was presented to the other two jointure members for consideration. \n\nCoincidentally, Wrightstown has four-areas specifically zoned for quarries and currently there is very little quarry land now available. \n\nAll three municipalities would have to pass the proposed ordinance for it to take effect. \n\nTownship solicitors have warned that if no specific areas are designated, then drilling companies could challenge municipalities in court, claiming that restrictive zoning prevents them from conducting business. \n\nHowever, opponents argued that such an ordinance, no matter how well-intended, should not be approved, instead claiming that officials in the jointure should ban the practice outright. \n\nMarguerite Chandler of the Pennswood Village retirement community in Middletown Township has been fighting fracking for years. \n\nAccording to Chandler, properties which have drilling leases on them, especially those with well-water supplies, are finding it harder to get mortgages and homeowners’ insurance. \n\nShe said that neighboring properties to those with leases are also negatively affected. \n\nIn addition, Chandler noted that local governments may also be responsible if a drilling company is underinsured and streams or the Delaware River watershed is contaminated for the millions of people who depend on it for drinking water. \n\nAt a July 8 meeting, anti-fracking activists had implored the Newtown supervisors to formally oppose the practice. \n\nVice Chairman Mike Gallagher had told the group that the board supported their efforts to keep fracking out not only Newtown Township, but all of Bucks County. \n\n“We're with you on this,” he had said. “Our job is being proactive.” \n\nAnd Gallagher had explained that the proposal to relegate fracking to the Wrightstown quarries is a legal strategy that the jointure has come up with for when the moratorium is lifted. \n\n“Let's figure out how we can stop fracking,” Gallagher asserted. “How do we defend against the driller who wants to come in and take our natural resources?” \n\nFellow supervisors agreed that they don’t want oil and natural gas drilling in the township. \n\nMany opponents point out that New York State banned fracking after seven years of exhaustive scientific studies, concluding that it would create unsatisfactory health and safety issues. \n\nTracy Carluccio, deputy director of the Delaware Riverkeeper Network, a non-profit volunteer group which helps protect the Delaware River watershed, has suggested that the DRBC should make its fracking moratorium permanent. \n\n“Shallow (fracked) wells are close to aquifers and will contaminate groundwater,” she had stated at the July supervisors’ meeting. “Five percent of all wells drilled leak within five years.” \n\nCarluccio attended the latest supervisors’ meeting and presented the board with updated materials on fracking’s alleged dangers. \n\nIn other action at the meeting, the board unanimously approved the hiring Gilmore &Associates, Inc. as the township's trail consultant. \n\nThe New Britain-based engineering firm was one of three finalists that the supervisors interviewed for the newly-created position. \n\nGilmore & Associates will be tasked to come up with a “Comprehensive Trail Plan” to link and enhance Newtown Township’s numerous trails to make them more attractive to hikers and bikers. \n\nFostering economic development and attracting recreational tourism will also key components of that plan, as is protecting the environment. \n\nOver the years, a number of the existing area trails have been developed by public and private entities, but the paths are now somewhat scattershot around the township. \n\nIn his State of the Township message in January, Supervisor Chairman Ryan Gallagher said that one of his goals for 2015 is creating a comprehensive trail strategy. \n\nAnd in a 4-1 vote, with Supervisor Dix dissenting, the board also approved hiring a company to update the township's somewhat antiquated website. \n\nFive bids were received and the Wrightstown-based AnchorMark Branding Co. was chosen to overhaul the municipal Web page, not only sprucing it up, but also providing residents with more information and linking the site to social media, including Facebook. \n\nAnchorMark bid $15,000 for the project, money which was allocated in the 2015 township budget for website improvement. \n\nOne of the planned upgrades would help the site integrate better with mobile devices, such as smartphones, which is a problem for the current website. \n\nIn addition, township forms for permits would still be available online, but there would also be a way to pay fees on the website. \n\nVideos of supervisors’ meetings now posted online would also be improved. \n\nThe planned changes include allowing a person who is watching the supervisors' meeting live on a cable access channel to have the capability to go online and pull up the same Google Docs packet of public information that is on each supervisor's desktop computer. \n\nWhen completed the new website is expected to be much easier for administrators to change the information, so it could be updated more regularly.", "source": "Newtown Advance"}