{"published": "2015-09-21T08:45:05Z", "media-type": "News", "title": "Naftogaz's loss is UAH 6 bln in 2015 due to subsidized gas prices for housing – company head", "id": "5e2e9a45-ceaa-427b-847e-57dc9db4266c", "content": "2015-09-21T11:45+02:00  11:45  21.09.2015  \n  \nThe net loss of national joint-stock company Naftogaz Ukrainy in 2015 will total UAH 6 billion due to subsidized prices of gas used for heating households, Board Chairman Andriy Kobolev has said. \n \n\"If we take the average price of imported gas [in 2015], which is very optimistic, $250 per 1,000 cubic meters, the total loss of Naftogaz in 2015 would be UAH 6 billion,\" he said in the parliament on September 18. \n \nHe said that the average price at which Naftogaz Ukrainy sells gas for the needs of households and heating providers to households is slightly more than UAH 3,000 (VAT not included). \n \n\"Naftogaz could compensate UAH 6 billion from other sources to maintain the price of gas for households stipulated in resolutions of the NCER [the National Commission for Energy, Housing and Utilities Services Regulation ],\" he said. \n \nKobolev said that in 2015, 12.8 billion cubic meters of gas produced in Ukraine will be allocated to households. All the other needs of households will be covered thanks to imported gas. \n \nHe also said that not all the gas produced by public joint-stock company Ukrgazvydobuvannia goes to households, and that some gas is produced under agreements on joint operations with private companies. \n \n\"We [have for] several times proposed that the parliament and lawmakers amend the law, then there would appear a possibility of giving gas made under joint production agreements to households. This would be a kind of re-privatization. If the decision is made, Naftogaz would make it with pleasure,\" he said. \n \nIn turn, Ukrgazvydobuvannia Board Chairman Oleh Prokhorenko said that in 2015, the company could produce around 14.5 billion cubic meters of gas, including 1.2 billion cubic meters under joint production agreements, with 500 million cubic meters being required for the technical needs of the company and for the operation of gas booster stations. In 2014, around 2 billion cubic meters of gas was made under joint production agreements, he said.", "source": "Interfax-Ukraine"}