{"published": "2015-09-15T21:40:50Z", "media-type": "News", "title": "3 Six Nations sides among the top-6 teams with most foreign-born players at Rugby World Cup", "id": "13403e16-00e3-4e81-bcf8-28dd6adf983c", "content": "LONDON - Maybe it was sour grapes. Or maybe it was just immense pride.\n\nMammoth No. 8 Mamuka Gogordze didn't take too kindly to Georgia losing to Japan at Gloucester this month, blowing its last warm-up for the Rugby World Cup in the dying moments.\n\n\"It was a good experience against Japan because (our World Cup opener is) against Tonga, and there was a lot of Tongans on the field today.\"\n\nActually, there was only one Tongan-born starter in the Japan side and he was concussed, but that's beside the point. Gogordze wasn't finished.\n\n\"I am proud that the Georgian team is full of Georgians,\" he said. \"When I play against Canada, I don't play against Canadians. When I play against Japan, we don't play against the Japanese. Eighty per cent of their team was from New Zealand and Tonga. I am proud of my small team which is full of Georgians representing Georgia.\"\n\nHe was a little rough on Canada but not all wrong.\n\nSeven of the Japan starting side were foreign-born, including captain and flanker Michael Leitch, who was born in New Zealand but moved to Japan as a teenager. He returned to New Zealand this year to play for the Chiefs in Super Rugby.\n\nJapan has been criticized in the past for being filled with foreign-born players, but Australian-born coach Eddie Jones has worked to promote home-grown talent, while trying to keep Japan competitive. Since the 2011 Rugby World Cup, he's added only five players through residency.\n\nBut eligibility remains a hot topic, whether players qualify by three-year residency or a grandparent in the distant past. World Rugby said it is reviewing the rules, but it's not hard to imagine it will remain controversial.\n\nCoach Vern Cotter stirred up Scotland when he picked John Hardie, who qualified thanks to a Scottish grandmother, in the Rugby World Cup only five weeks after he arrived from New Zealand and with 57 minutes of international playing time. That might have been fine, but Hardie was chosen at the expense of regular Blair Cowan and John Barclay, who had just come out of a two-year exile.\n\nHardie calmed the critics, somewhat, with a second good show in the loss to France in Paris in the final warm-up.\n\nFour years ago, Argentina, Georgia, and Romania had entirely homegrown teams.\n\nThis year, only Argentina does.\n\nGeorgia has only one foreign-born player, centre Merab Sharikadze, born in Russia to Georgian parents who returned home.\n\nRomania has five, after the Oaks decided to beef up in search of their first quarterfinal. Three of the players qualified on residency this year, all of them aged around 30.\n\nNew Zealand-born flyhalf Mike Wiringi received a cap in June, and South African-born lock Johannes van Heerden and Tongan-born centre Paula Kinikinilau made their debuts less than two weeks ago in the home loss to Tonga.\n\nSamoa tops the list with the most foreign-born players with 15, all from neighbour New Zealand, after prop Census Johnston came out of retirement as an injury replacement last week for his third World Cup.\n\nTonga was next with 12, including nine Kiwis with Tongan parents, followed by Scotland and Wales with 11 each.\n\nScotland included South African-born No. 8 Josh Strauss, even though he doesn't qualify on residency until Friday, when the tournament starts.\n\nThe next highest with 10 each were Japan, and France, which has picked four on residency since the last World Cup.\n\nOn nine were Australia, Italy, and the United States, which used to be at the lower end of the list, but has included three players this year on residency alone.\n\nNew Zealand, often accused of pillaging the Pacific Islands, led a group with five, including Ireland, Canada, and Romania. Only two All Blacks were born in the Pacific islands: Malakai Fekitoa (Tonga), and Waisake Naholo (Fiji), while five more were of Samoan descent.\n\nThe list finished with England (3), Fiji (2), Namibia (2), South Africa (1), and Uruguay (1).", "source": "Brandon Sun"}