{"published": "2015-09-22T20:13:35Z", "media-type": "Blog", "title": "Smoke and Mirrors", "id": "74d0eff8-4798-48eb-a1e9-9ab17e29f195", "content": "Pollution, as scandals on both sides of the Atlantic show, is a physical manifestation of corruption. By George Monbiot, published in the Guardian 23 September 2015 In London, the latest figures suggest, it now kills more people than smoking. Worldwide, a new study estimates, it causes more deaths than malaria and HIV-Aids together. I’m talking about the neglected health crisis of this age, that we seldom discuss or even acknowledge. Air pollution. Heart attacks, strokes, asthma, lung and bladder cancers, low birth weight, low verbal IQ, poor memory and attention among children, faster cognitive decline in older people and – recent studies suggest – a link with the earlier onset of dementia: all these are among the impacts of a problem that, many still believe, we solved decades ago. The smokestacks may have moved to China, but other sources, whose fumes are less visible, have taken their place. Among the worst are diesel engines, sold, even today, as the eco-friendly option, on the grounds that their greenhouse gas emissions tend to be lower than those of petrol engines. You begin to wonder whether any such claims can still be trusted. Volkswagen’s rigging of its pollution tests is an assault on our lungs, our hearts, our brains. It is a classic example of externalisation: the dumping of costs that businesses should carry onto other people. The air that should have been filtered by its engines is filtered by our lungs instead. We have become the scrubbing devices it failed to install. Who knows how many people have paid for this crime already, with their health or with their lives? In the USA, 200,000 deaths a year are attributed to air pollution. For how many of those might Volkswagen be responsible? Where else was the fraud perpetrated? Of what proportion of our health budgets has this company robbed us? The fraud involves the detection of nitrous oxides (NOx), of which diesel engines are the major source in many places. This month, for the first time in our history, the UK government estimated the impact of NOx emissions on public health, and discovered that they are likely almost to double the number of deaths from air pollution, adding 23,000 to the 29,000 attributed to particulates (tiny particles of soot). The government released this discovery, alongside its useless proposals for dealing with the problem, on Saturday 12 September, a few minutes before Jeremy Corbyn’s election as Labour leader was announced. How many government press releases are published on a Saturday? How many are published on a Saturday during an event on which everyone is focused? In other words, as a Labour press officer once notoriously advised, this was “a good day to bury bad news”. Not only was the number of deaths buried by this means, but so was the government’s consultation on its feeble plans for reducing this pollution: a consultation to which it evidently wanted as few respondents as possible. Liz Truss, the environment secretary, has some explaining to do. She has her reasons for keeping us in the dark. In April, the Supreme Court ruled that the UK is in breach of the European air quality directive, and insisted that the government draw up a plan for compliance by the end of this year. Instead, Truss produced a plan to shed responsibility. Local authorities, her consultation suggests, should create clean air zones in at least eight cities, in which diesel engines are restricted or banned. But she has given them neither new money nor new powers. Nor has she offered an explanation of how this non-plan is going to address the issue in the rest of the country, as the ruling demands. Already, the UK has missed the European deadline by six years. Under Truss’s proposals, some places are likely still to be in breach by 2025: 16 years after the original deadline. I urge you to respond to the consultation she wanted you to miss, which closes on November 6. The only concrete plan the government has produced so far is to intensify the problem, through a new programme of airport expansion. This means more nitrous oxides, more particulates, more greenhouse gas emissions. Paradoxically, the Volkswagen scandal may succeed where all else has failed, by obliging the government to take the only action that will make a difference: legislating for a great reduction in the use of diesel engines. By the time this article is published, we might know whether the company’s scam has been perpetrated in Europe as well as North America: new revelations are dripping by the hour. But whether or not this particular deception was deployed here, plenty of others have been. Last week the Guardian reported that nine out of ten new diesel cars break European limits on nitrous oxides – not by a little but by an average of sevenfold. Every manufacturer whose emissions were tested had cars in breach of the legal limit. They used a number of tricks to hotwire the tests: “stripping components from the car to reduce weight, using special lubricants, over-inflating tyres and using super-smooth test tracks.” In other words, the emissions scandal is not confined to Volkswagen, not confined to a single algorithm and not confined to North America: it looks, in all its clever variants, like a compound global swindle. There are echoes here of the ploys used by the tobacco industry: grand deceptions smuggled past the public with the help of sophisticated marketing. Volkswagen sites advertising the virtues of “clean diesel” have been dropping offline all day. In 2009, the year in which its scam began, the TDI engine at the centre of the scandal won the Volkswagen Jetta 2.0 the green car of the year award. In 2010, it did the same for the Audi A3. There’s plenty that’s wrong with corporate regulation in the United States, but at least the fines, when they occur, are big enough to make a corporation pause, and there’s a possibility of guilty executives ending up in prison. Here, where corruption, like pollution, is both omnipresent and invisible, major corporations can commit almost any white-collar crime and get away with it. Schemes of the kind that have scandalised America are, in this country, both commonplace and unremarked. How can such governments be trusted to defend our health? www.monbiot.com  ", "source": "George Monbiot"}