{"published": "2015-09-08T11:29:27Z", "media-type": "News", "title": "Liverpool round-up: Scouts watching Dani Ceballos ahead of January offer", "id": "36defef7-e70f-416c-b0d5-b8735d7c3ee0", "content": "Liverpool fans, hello and welcome to your daily round-up. \n \nWith the international break coming to an end it’s almost time to get back into the usual routine of football every weekend and a smattering of rumours during the week. \n \nWhat are we talking about? Almost time? It is time! Read below for all the latest on Liverpool, and remember to watch the video embedded for the major headlines. \n SIGN UP NOW  \nWant to become a GMS writer? Sign up now and submit a 250 word test article: http://gms.to/haveyoursay4 \n \nThis summer’s transfer window may have been a profitable one for Liverpool, but Brendan Rodgers is already turning his attentions to next year’s market. \n \nThat’s according to reports that suggest the Reds continue to send scouts to watch Real Betis midfielder Dani Ceballos, ahead of a possible bid for his services in the future. \n \nThe youngster has less than a year remaining on his contract and a buy-out clause of £7.5million, with Liverpool having the option to attempt to purchase him for a cut-price fee in January. \n \n\n \nIt’s said they will face competition from Arsenal, with Ceballos looking likely to sign a pre-contract agreement for an English move next year. \n Balotelli's Real joke  \nMeanwhile Mario Balotelli has admitted that Real Madrid are a ‘dream club’, refuting reports that he made a joke about them in the past. \n \nThe Italian took to Twitter to slam those who said he had aimed a dig at Real via a statement about Barcelona, claiming he would never make fun of Los Blancos. \n Rooney on Sterling  \nBringing up the rear Wayne Rooney has had his say on Raheem Sterling’s controversial Anfield departure, and he has backed it. \n \n\n \nThe Manchester United forward said that he thought Sterling seemed ‘settled’ at Man City and had started the season excellenty. That can only mean good things for the Three Lions. \n \nDo YOU want to write for GiveMeSport? Get started today by signing-up and submitting an article HERE: http://gms.to/writeforgms", "source": "GiveMeSport.com"}