{"published": "2015-09-01T07:06:36Z", "media-type": "News", "title": "Europe Tightens Borders in Migrant Crisis", "id": "4d180452-cbe3-4ab7-99ba-45610b969c97", "content": "Ancient life found in Earths mantle rocks  \nThe Italy News.Net - Tuesday 1st September, 2015 \n \nScientists have discovered evidence of ancient life in Earth's mantle rocks deep below the seafloor, confirming a long-standing hypothesis that interactions between mantle rocks and seawater can  ... \n   Dortmund loan Blaszczykowski to Fiorentina  \nThe Italy News.Net - Tuesday 1st September, 2015 \n \nEight-time German football champions Borussia Dortmund have loaned out their attacking midfielder Jakub Blaszczykowski to Italian club Fiorentina until the end of the season. Known as \"Kuba\", he  ... \n   Ancient Roman temple in Syria completely destroyed UN  \nThe Italy News.Net - Tuesday 1st September, 2015 \n \nSatellite images have confirmed that the Islamic State (IS) terrorist group has completely destroyed an ancient Roman temple in the Syrian city of Palmyra, the UN announced. A powerful blast in the  ... \n   Kanche most ambitious film of my career Jagarlamudi  \nThe Italy News.Net - Tuesday 1st September, 2015 \n \nFilmmaker Krish Jagarlamudi says the makers spent a fortune on his forthcoming Telugu romantic war drama \"Kanche\", which he describes as the most ambitious project he has attempted in his career so  ... \n   Juventus Buffon craves to win Champions League  \nThe Italy News.Net - Monday 31st August, 2015 \n \nThe European Champions League trophy is the one glaring omission in Italian champions Juventus captain Gianluigi Buffon's glittering football career and the goalkeeping legend is determined to lift  ... \n   Hulkenberg aims to bounce back at Italian GP  \nThe Italy News.Net - Monday 31st August, 2015 \n \nForce India driver Nico Hulkenberg is aiming to bounce back at the Formula 1 Italian Grand Prix this weekend after two disappointing race weekends at Belgium and Hungary. The German had to retire  ... \n   Need to go flat out at Monza Perez  \nThe Italy News.Net - Monday 31st August, 2015 \n \nForce India driver Sergio Perez on Monday said he needs to go \"flat out all the way\" at the Formula 1 Italian Grand Prix here on Sunday, stressing on having a good qualifying session on Saturday at  ... \n   Ronaldinho jeered by own fans  \nThe Italy News.Net - Monday 31st August, 2015 \n \nFluminense coach Enderson Moreira has leapt to the defence of Brazilian football star Ronaldinho after the 35-year-old was jeered by his own fans in a 1-2 loss to Atletico Mineiro. Ronaldinho was  ... \n   IS partially destroys ancient Roman temple in Syrias Palmyra  \nThe Italy News.Net - Sunday 30th August, 2015 \n \nThe Islamic State (IS) militants destroyed parts of a famous ancient Roman temple in the historic city of Palmyra in central Syria, a monitor group reported on Sunday. The Temple of Bel, an ancient  ... \n   Chennaiyin FC sign Italian defender Potenza  \nThe Italy News.Net - Sunday 30th August, 2015 \n \nIndian Super League (ISL) franchise Chennaiyin FC on Sunday signed Italian defender Alessandro Potenza for the second season of the tournament. \"Chennaiyin FC is delighted to announce the signing  ... \n   Juventus captain Buffon demands more responsibility from team  \nThe Italy News.Net - Monday 31st August, 2015 \n \nJuventus captain and veteran goalkeeper Gianluigi Buffon says the Italian football champions will need to show a greater level of responsibility if they are to get their Serie A season back up and  ... \n   No future for Italian football team Ex-coach Prandelli  \nThe Italy News.Net - Monday 31st August, 2015 \n \nFormer Italian football team head coach Cesare Prandelli has predicted a dark future for the four-time World Cup winners primarily because of the lack of development of its emerging talents. The  ... \n   Juventus loan Coman to Bayern Munich  \nThe Italy News.Net - Monday 31st August, 2015 \n \nGerman football giants Bayern Munich signed France Under-21 international Kingsley Coman from Italian outfit Juventus on loan. Bayern bolstered their offence with the French international, who on  ... \n   Transfers Inter Milan add Adem Ljajic – from Roma – and Felipe Melo in late deals  \nThe National - Tuesday 1st September, 2015 \n \nSerie A club announced Monday.“FC Internazionale announces the club has agreed with Galatasaray over the definitive transfer of Felipe Melo,” Inter said in a brief statement.Reports in  ... \n   New Scenes of Laurel and Hardy in Italian Film Festival  \nPrensa Latina - Tuesday 1st September, 2015 \n \nRome, Aug 31 (Prensa Latina) Unpublished scenes of the classic short \"The Battle of the Century\", with the appearance of the stars of the silent comedy Stan Laurel and Oliver Hardy, will  ... \n   All good things come to an end Tammin Sursok bids farewell to Italy  \nDaily Mail - Tuesday 1st September, 2015 \n \nAides going 100 hours without sleep; orders about fish, dinnerware and 'The Good Wife' plus countless redacted exchanges: Hillary's 7,000 secret email pages revealed - with 125 ruled  ... \n   Milan wanted Witsel - Galliani  \nGoal - Tuesday 1st September, 2015 \n \nAxel Witsel but were unable to complete a transfer before the Serie A transfer window closed on Monday. Sinisa Mihajlovic was keen to bolster his midfield after revealing his  ... \n   Official Malaga sign Milan starlet Mastour  \nGoal - Tuesday 1st September, 2015 \n \nHachim Mastour on a two-year loan deal. The Morocco international, 17, is regarded as one of the top young talents in Italian football and the move to La Rosaleda will be seen as an  ... \n   Official AC Milan loan Matri to Lazio  \nGoal - Tuesday 1st September, 2015 \n \nThe experienced attacker will spend the 2015-16 season in the Italian capital after he fell further down the pecking order at San Siro  Alessandro Matri has left AC Milan once  ... \n   Napoli fail to sign Roberto Soriano from Sampdoria before deadline  \nESPN - Tuesday 1st September, 2015 \n \nNapoli failed to complete the signing of Roberto Soriano from Sampdoria in time for his transfer to go through on deadline day, after beating Serie A rivals AC Milan to the midfielder.  ...", "source": "TheItalyNews.Net"}