{"published": "2015-09-02T20:41:04Z", "media-type": "News", "title": "Catalent (CTLT) Posts Earnings Results, Beats Estimates By $0.64 EPS", "id": "46488088-3ab7-4daa-ac17-5f4ebecf6f3b", "content": "Catalent (NASDAQ:CTLT) posted its quarterly earnings results on Wednesday. The company reported $1.22 EPS for the quarter, topping the Zacks’ consensus estimate of $0.58 by $0.64, AnalystRatingsNetwork.com reports. The company earned $510.10 million during the quarter, compared to the consensus estimate of $496.91 million. CTLT has been the topic of a number of research analyst […]\nThe post Catalent (CTLT) Posts  Earnings Results, Beats Estimates By $0.64 EPS appeared first on… \r \nCatalent (NASDAQ:CTLT) posted its quarterly earnings results on Wednesday. The company reported $1.22 EPS for the quarter, topping the Zacks’ consensus estimate of $0.58 by $0.64, AnalystRatingsNetwork.com reports. The company earned $510.10 million during the quarter, compared to the consensus estimate of $496.91 million. \n\nCTLT has been the topic of a number of research analyst reports. Zacks raised shares of Catalent from a “sell” rating to a “hold” rating in a research note on Thursday, May 7th. Raymond James reissued an “outperform” rating and set a $33.00 price target (up from $31.00) on shares of Catalent in a research report on Saturday, May 9th. Three research analysts have rated the stock with a hold rating and eight have given a buy rating to the stock. The company currently has a consensus rating of “Buy” and a consensus price target of $30.43. \n\nShares of Catalent (NASDAQ:CTLT) traded up 1.71% during trading on Wednesday, hitting $31.54. 1,554,276 shares of the company traded hands. Catalent has a 52-week low of $21.21 and a 52-week high of $34.42. The company has a 50-day moving average of $32.12 and a 200-day moving average of $30.53. The stock has a market capitalization of $3.92 billion and a PE ratio of 40.13. \n\nIn related news, insider John R. Chiminski sold 33,828 shares of the company’s stock in a transaction on Monday, July 6th. The stock was sold at an average price of $29.34, for a total transaction of $992,513.52. The sale was disclosed in a document filed with the SEC, which is available at this link. Also, insider John R. Chiminski sold 33,081 shares of the company’s stock in a transaction on Monday, July 20th. The stock was sold at an average price of $29.40, for a total value of $972,581.40. The disclosure for this sale can be found here \n\n. \n\nCatalent, Inc. is a provider of advanced delivery technologies and development solutions for drugs, biologics and consumer health products. The Company operates in three segments: Oral Technologies, Medication Delivery Solutions and Development & Clinical Services. Its oral Technologies segment i…", "source": "MyInforms"}