{"published": "2015-08-31T18:26:06Z", "media-type": "Blog", "title": "BAJA BOUND PART OF THE GREAT EXPERIENCE THAT IS THE Punta Banda “GP” & the PURE UTV Events", "id": "31650852-5379-47ba-a364-1d0ef8e750c0", "content": "BAJA BOUND PART OF THE GREAT EXPERIENCE THAT IS THE \n Punta Banda “GP” & the PURE UTV Events \nEnsenada, B.C. Mexico \n \nCalifornia City, CA – Aug 30, 2015 – AVE/Baja Promotions has secured special relationship with old time friend of the Gran Carrera days, Tim Morton. Morton, who heads up the BA JA BOUND Moto Tours in Baja for many years, is giving a lending hand to AVE/Baja Promotions by laying out an incredibly fun but challenging “GP courses for this year’s PUNTA BANDA GP & PURE UTV Events, Saturday, September 12. \nMorton merely suggested a few changes to the first event last May AND PROVED TO BE EXCELLENT. Not known for passing up on a good thing, AVE’s Lou Peralta, asked Tim to help out once again for the upcoming 10-mile GP course for Motorcycles. \nThe results, according to promoter, Peralta are “fantastic! Tim really knows what the guys like and how to find those certain sections that will make each rider work a little harder. The idea is not to lay out a freeway but to give each racer a challenge. Nothing is impassible but it will certainly call on everyone’s ability to ride their bike.” \n \nMorton who does not like much attention is dedicated to motorcycles and has been all his life. His “tours” are world famous as he has participants from every corner of the earth. Moreover, he also takes on a few riders and supports them if they wish to race in any of the Baja races or in the states. He has the quality equipment, chase crew and experience to really show a neophyte or veteran in off-road racing, the necessary ropes to be competitive and to finish the events. \n \nThis two-headed group combining Morton’s great experience in Baja and Peralta’s massive experience as a promoter since 1986, an individual who is still involved in the sport, make for what most consider a great combination. \n \nThe next event is in September 12, at Punta Banda, which is part of the Ejido Coronel Esteban Cantu, where AVE/BP Racing has a multi-year contract to produce exclusively motorsports events. The event features motorcycles on Saturday at 10:00 am in a two-hour GP and a four-hour UTV race starting at approximately 1 p.m. on their own course. The UTV event is part of the 2015 PURE UTV OFF-ROAD DESERT SERIES where points are awarded according to Overall and Class positions. This event will also give out the Ensenada Cups to the Overall UTV and MC riders among the two Baja events. \n \nThe general public in Baja is invited and entry into the Ejido and to watch this great event is only $50 Pesos per car load. What a Bargain! \n \nDP Racing has posted a $1000 prize, winner take-all for the Overall motorcycle at this event. \n \nSponsors of the Series are DP Racing, the San Nicolas Hotel Casino, La Jolla Campground, Ejido Coronel Esteban Cantu, BUD LIGHT, Bibayoff Wines, Biba Pasion, Sonoco, Baja Bound Tours, Baja Bound Insurance, Fox, PCI, BP Graphics, Rugged Radios, Lazerstar, Sietesietesiete, IRC, Lawrence Motorsports, Lawrence Equipment, Supercharger Films, Can-Am, KC Hilites and Peralta Designs \n \nFor those interested in the Baja Bound Adventures can contact them at 888-664-2252 or info@BajaBoundMoto.com. \n \nTo reach AVE Racing/ Baja Promotions, and get more details about their upcoming events you can visit their website: www.averacing.com?utm_source=rss&utm_medium=rss or info@averacing.com \n #######  \n\n \n \n \n \nThe post BAJA BOUND PART OF THE GREAT EXPERIENCE THAT IS THE Punta Banda “GP” & the PURE UTV Events appeared first on race-deZert.com .", "source": "race-deZert.com"}