{"published": "2015-09-14T19:41:06Z", "media-type": "News", "title": "Is MSU helping Big Ten look like a dominant SEC?", "id": "21f3900b-0b71-4151-baa4-3f4e19b9b136", "content": "ESPN writer says Spartans and Buckeyes are leading the Big Ten's charge into prominence \n\nLawrence Thomas of the Michigan State Spartans. (Photo: Streeter Lecka, ) \n\nIs the Big Ten starting to look like the SEC that once won seven consecutive BCS championships? \n\nESPN's Ryan McGee thinks so -- and the first piece of evidence he points to is No. 4 Michigan State's 31-28 victory over then-No. 7 Oregon on Saturday at Spartan Stadium. \n\nBut a quick glance at the rest of the conference shows the Big Ten is trending up entering Week 3 of the college football season. \n\nOhio State is the defending national champion and still No. 1. Michigan earned its first win of the Jim Harbaugh era in convincing fashion, albeit against a young, inexperienced Oregon State squad. \n\n\"Minnesota rallied to beat Colorado State in OT. Iowa broke away from a tie game to defeat Iowa State. Wisconsin and Northwestern eased into the lower regions of the AP Top 25,\" McGee added. \n\n\"All of this took place while the SEC's bus caught fire. Auburn won embarrassingly in OT over FCS opponent Jacksonville State, and Arkansas lost embarrassingly to Big Ten backyard little brother Toledo. Then the self-cannibalization of the SEC West began in Starkville, Mississippi, on Saturday night with LSU's two-point win over Mississippi State. Meanwhile, the SEC East already looks like it's still the same old spaghetti pile it has been for the past decade.\" \n\nMcGee argues the SEC went on its 7-year run from 2007-13 thanks to a dependable model each season: The SEC had 1-2 dominant teams each year, enough inferior teams such as Vanderbilt, Kentucky and Tennessee to ensure conference victories, at least one big cross-conference win and a win in the conference championship game. That formula usually ensured the SEC earned a berth in the BCS Championship Game. \n\nHe sees the same thing happening in the Big Ten -- with the Buckeyes and Spartans being the dominant teams. \n\n\"For Ohio State and Michigan State, the road looks familiar,\" McGee wrote. \"The high-profile Power 5 wins are out of the way (thank you Hokies and Ducks). Now the goal will be to survive mid-fall without a letdown, bulldozing the bad teams (Indiana, Maryland, Rutgers, Purdue, take your pick) and knocking out good-but-not-great, big-brand-name opponents (Michigan and Nebraska for MSU, Penn State and Minnesota for OSU) before the Nov. 21 showdown in Columbus, Ohio.\" \n\nBuckle up, Spartans fans: You have quite an exciting fall ahead. \n\nContact Brian Manzullo: bmanzullo@freepress.com. Follow him on Twitter @BrianManzullo . \n\nDownload our new Spartans Xtra app for free on Apple and Android devices! \n\nRead or Share this story: http://on.freep.com/1FapK4g", "source": "Detroit Free Press"}