{"published": "2015-09-22T13:28:19Z", "media-type": "Blog", "title": "Review: Scarecrow Magic by Ed Masessa", "id": "7b9f6676-f2ac-4755-8728-3b525661a376", "content": "Scarecrow Magic by Ed Masessa, illustrated by Matt Myers (InfoSoup)\n\nA shivery and wonderfully strange autumn read, this picture book explores what happens on the night of a full moon. It all starts with the moon bright in the sky and a scarecrow that starts to move. Magic is building all around, and creatures begin to emerge from the ground and the shadows. As the others arrive, the scarecrow unties himself, removes his clothes and then his skin! As a skeleton, he dashes around ready to play. He jumps rope with a vine, takes a dip in the pond, bowls with pumpkins, plays hide-and-seek. At snack time they all feast on worms and slug balls. By the time the sun rises, it's all tidied up and Scarecrow is back to work on his post.\n\nThis picture book is not sweet and quiet, rather it's a wild raucous picture book that has some darkness mixed in. So it may not be for every child and may not be ideal for right before bed. There is joy in a picture book that takes a autumn figure like a scarecrow and unveils the skeleton underneath. The magic at play all around in a rural area is also a treat to see come alive. The book is written in rhyme that bounces and dashes along, carrying this zingy story forward even faster. Halloween is not mentioned at all, but this would be a great pick for a read aloud at a Halloween event where scary darkness is to be expected and embraced.\n\nMyers sets a great tone with his illustrations, creating a wonderful glow of the moon and a deep darkness of night. The skeleton's white bones pop on the page as he gallivants around. The dark purples, blues and greens capture nighttime in the country. Against that backdrop, the strange creatures who come from the shadows and the ground are a mix of friendly and fearsome that works very well. They are just enough to be creepy but not really frightening.\n\nJaunty rhyme, a spooky night and one wild skeleton make for a treat of a book for a Halloween read. Appropriate for ages 4-6.\n\nReviewed from library copy.", "source": "Waking Brain Cells"}