{"published": "2015-09-14T16:24:01Z", "media-type": "News", "title": "Thomas Rhett pulls a Swift: Is country music still country music when rap, soul and EDM are included?", "id": "87bc19b8-57df-4111-bf63-a39fcb8ad1a1", "content": "Country music sort of lives in this bubble, and everyone is a little bit scared to poke that… \r \nBy Sarah Boesveld September 14, 2015 12:09 PM \n\nThe country radio DJ pauses before biting the bullet: “Has anyone been like ‘What the hell are you doing?'” she asks. \n\n“Every single day,” Thomas Rhett says without missing a beat. \n\nA half hour earlier, a dozen industry types, seated before a massive control board and a big cake sheet lined with strawberries, bopped their heads to Rhett’s “progressive” country record — one marketed to lead a sonic shift in a genre of which they are still the gatekeepers. \n\n“Oooh, you look so dang hot in my T-shirt” thumps one track — titled T-shirt, appropriately enough — that likens the girl in the song to a model in a Guns ‘N Roses video. “Pour a little liquor in my coconut water” repeats the infectious hook of Vacation. There’s a rap interlude from Lunch Money Lewis; a sexy duet with pop star Jordin Sparks. \n\nThe artist blaring from the speakers sat just outside the listening session — too nervous, he said, to watch people take in tracks from his sophomore album ‘Tangled Up.’ He strides in when it’s over, bedroom eyes scanning the room for a reaction. \n\n“It’s fun,” the group initially declares before the question on everyone’s mind gets asked. \n\nThe son of 90’s country singer and Nashville songwriter Rhett Akins, Rhett made his debut in 2013 with ‘bro’ songs like ‘Get Me Some of That’ and ‘It Goes Like This’ — his star seemingly reliant on the dirt road theme of the day. But in the past year, Rhett’s undergone a metamorphosis: first with his BeeGees-inspired ‘Make Me Wanna’ and then with ‘Crash & Burn,’ the Sam Cooke-style debut single off a forthcoming record that marries soul, pop, disco, electronic dance music (EDM) and a dash of rap with what’s typically known as country. \n\nThe single Rhett was terrified to release has since become his fastest rising, biggest selling song. And nestled in the Country Billboard Top 10 this summer betwixt hits like Sam Hunt’s party-hearty ‘House Party’ and ‘Like a Wrecking Ball,’ the soulful sex-jam from Erich Church, his risk at least feels of the moment. There is comfort in acknowledging the chart-busting success of genre-blurring acts like Florida Georgia Line (who Rhett has supported on tour), Luke Bryan and Hunt, whose nearly pure-pop and R&B debut album has made him something of a (controversial) pioneer. \n\n“It’s very liberating” Rhett said in an interview, reflecting on his move away from “bro” and towards something entirely new. “Someone the other day was like ‘Man, I don’t know if you know this, but I feel like you’re on the brink of leading a new direction of music. \n\n’” \n\nBut in the minds of traditionalists, a new direction isn’t something to which a country musician should aspire. To guys like Kyle Coroneos, who runs the website SavingCountryMusic.com, country is a genre not to be tampered with. Country music is about preserving tradition. It always has been and always will be. \n\nHe calls this disco/EDM iteration a “bro-hangover.” The idea that bringing other genre-influences into country right now is risky, or pushing the envelope, or taking the genre somewhere new and exciting is disingenuous, he says. Instead, it contributes to one giant “mono-genre,” which he believes the merging of hip-hop and country has become. \n\n“The risk for country music is when you start going this far out of your boundaries, you begin to lose control of the music, you begin to lose control of your identity,” he said. “Country music is unique because it has so much of its own infrastructure and traditions — no other genre of music has four major awards shows every year, not even rock or EDM or rap. \n\n” \n\nThe genre-blending and trend-chasing is exactly the fate that befell rock radio, he said. “In the 1990s and early 2000s, rock became the catch-all phrase,” he said. “What happened was it lost its identity and it sort of imploded. I think it could happen” with country music. \n\nRhett doesn’t believe his music is going to cause the downfall of country music. “We’re one of those genres that sort of lives in this bubble that everyone is a little bit scared to poke that bubble, because we’re worried about what will happen when that bubble breaks,” said Rhett. “To me, I want to be that artist that when my buddies are watching me side-stage, they’ll say ‘Dang, I can’t believe they just did that in their concert.’ Or they hear a song on the record and go ‘How in the world did they cut that song and get away with it?’ There’s something kind of rebelliously fun about it. \n\n” \n\nHe cites mainstream country rebel Church as inspiration, his latest rock-influenced record ‘The Outsiders’ is stacked with successful radio hits, despite its many middle-finger-to-the-man moments. But in the minds of critics, that rebelliousness is a far cry from the stuff of Willie & Waylon and more indicative of Nashville chasing the next biggest money-making thing. \n\nDespite all of the pop experimentation, the country music genre lives in two stubborn solitudes: There’s ‘real’ country and there’s that crap you hear on the radio. But if you’re going to refer to something as ‘real’ country, you have to have a definition of what ‘real’ country is. \n\nIf Thomas Rhett wants to put out an album in the style of Bruno Mars and have EDM and R&B stuff … I am 100% for it. You go, Thomas Rhett. You do that. But don’t do it and sell it to country fans \n\nCountry music’s identity is very much rooted in geography — there’s Texas Swing out of the Lone Star State; there’s Kentucky bluegrass, there’s The Bakersfield Sound in California, which was a grittier, more direct response to the slick sounds coming out of Countrypolitan Nashville. \n\nPerhaps the current outcry of traditionalists is a little reminiscent of the origins of rock ‘n’ roll — the combination of blues, country and gospel broke all the rules in the 1950s and pushed so many gatekeeper buttons. While Rhett’s hip gyrations are the closest he’ll ever get to Elvis, maybe his Bruno Mars covers are indeed pushing the boundaries in a good way — reminding the country music world that nothing ever new or interesting has come from colouring inside the lines. \n\nAnd if there would be no rock ‘n roll without blues, country and gospel, there would be no co…", "source": "MyInforms"}