{"published": "2015-09-12T14:01:55Z", "media-type": "Blog", "title": "Cleveland Indians have Terry Talkin' about Jason Kipnis and finding outfielders -- Terry Pluto (photos)", "id": "df2da432-516d-42c0-890e-e6b6d9f526cd", "content": "CLEVELAND, Ohio -- Part of the reason the Indians spent huge money for free agents Michael Bourn and Nick Swisher before the 2013 season was their extreme need for outfielders. They had Michael Brantley, and not much else. Two years later, Bourn and Swisher are gone. The outfield picture is not as bleak as it was at the end of 2012. We're talking about the likes of Aaron Cunningham, Johnny Damon and Shelly Duncan trying to plug the holes. The Tribe now has Brantley and two Maybes ... as in Abraham Almonte and Lonnie Chisenhall. It was a public relations yawner when the Tribe picked up Almonte last month in a deal with San Diego for Marc Rzepczynski. After Bourn and Swisher were traded to Atlanta for Chris Johnson, the Tribe needed a center fielder. Almonte was given a chance, partly because the Tribe was disappointed in Tyler Holt (2-of-20). Almonte got off to a hot start and has played fairly well. Heading into the weekend, Almonte is batting .276 (.864 OPS) with 4 HR and 16 RBI in 115 plate appearances. He has impressed the Indians with his play in center field, which has been a major upgrade over Bourn. It also has been better than scouting reports. Manager Terry Francona recently said that he can't recall Almonte missing a cutoff man. He also has shown the ability to bunt. He's a good baserunner. The Tribe loves Almonte's attitude. It was impressive how he homered in one at bat on Thursday, then had a bunt single after that. Almonte is 26. He batted .243 (.628 OPS) with 2 HR and 11 RBI in 152 plate appearances for San Diego last year. He signed at 16 and has spent parts of 10 years in the minors, where he's a career .267 hitter. The Indians aren't sure if he's their regular center fielder next season, but he's in the conversation. Can he be a late bloomer? The Royals Lorenzo Cain spent parts of nine years in the minors before sticking with Kansas City in 2012 -- at the age of 26. It wasn't until 2014 -- at the age of 28 -- that Cain really began to hit. Another Royals outfielder is Alex Gordon. He spent four years going up and down from the minors. He was a third baseman. It wasn't until he was 27 and moved to left field that he became a consistent hitter. Who knows if Almonte will become another Cain or Gordon, but it does appear that the Tribe has made another small trade that is paying off well for them. ABOUT LONNIE CHISENHALL Lonnie Chisenhall has played himself back into the prospect category, at least as a platoon option in right field. Last week, I wrote about his defense being a major asset. Chisenhall was sent to the minors in June after batting .209 in 45 games. He converted from third base to right field. He is batting .327 (.852 OPS) in 108 plate appearances since he returned. But there's a warning sign: The streaky Chisenhall is 2-of-24 in September. Chisenhall has been in the Majors for parts of every season since 2011. He has had at least 100 at bats in each of those seasons. But he has been unable to establish himself. He will be 27 on October 4. The Indians are watching to see if he can pull himself out of this September slump. But just as the Royals showed patience with Gordon -- also a first-round pick who switched from third to the outfield -- the Indians want to make sure they don't give up on Chisenhall too soon. ABOUT THE OUTFIELD PROSPECTS 1. The Tribe's 2014 first-round pick, Brad Zimmer, wore down at the end of his first pro season. He was 5-of-40 (.125) in his final 10 games. Zimmer batted .308 (.896) with 10 HR and 39 RBI for Class A Lynchburg. He started fast when promoted to Class AA Akron, but finished at .219 (.687) with 6 HR and 24 RBI for the Rubber Ducks. 2. Zimmer is only 22. He was put on the fast track because he was an accomplished college player. He does a good job in center field. He was 44-of-51 in stolen bases. Overall, Zimmer batted .273 with 16 HR and 63 RBI between Akron and Lynchburg. He is a very good prospect, but not Major League ready for early in 2016. 3. Tyler Naquin would have been in the Majors right now except for injuries. He suffered a concussion and a hip injury in the final two months of the season. The team's first-round pick in 2012, the 24-year-old Naquin batted .300 (.828 OPS) with 7 HR and 27 RBI between Class AAA Columbus and Akron. Like Zimmer, he is a center fielder. 4. Naquin batted .263 (.784 OPS) when moved up to Columbus for the final two months of 2015. That also was when he was hit by injuries. He probably should open 2016 with the Clippers. 5. Clint Frazier was the team's first-rounder in 2013. The 21-year-old finished strong at Class A Lynchburg, batting .325 after the All-Star break. Overall, he batted .285 (.842 OPS) with 16 HR and 72 RBI. 6. The Indians have been addressing the need for outfielders in the draft. Naquin (2012), Frazier (2013) and Zimmer (2014) are all first-round picks. ABOUT NEXT YEAR It's possible the Tribe could come back with Brantley in left field, Almonte in center and a platoon of Ryan Raburn and Chisenhall in right field. The Indians have a $3 million option on Raburn for 2016. He entered the weekend batting .293 (.919 OPS) with 7 HR and and 27 RBI. He is a part-time player, mostly effective against left-handed pitching. Raburn has had a strange career. In 2012, he batted .171 for Detroit. The Indians signed him to a minor league contract in 2013 and he batted .272 (.901 OPS) with 16 HR and 55 RBI. But in 2014, he hit .200 and had physical problems. This season, Raburn is productive. He is 34. Can he deliver another good year, or will he slump again? Chisenhall also has been very inconsistent. The prospects aren't ready, so the Indians do need to look to add an outfielder who can hit. KIPNIS TO THE OUTFIELD? Do you want to move an All-Star second baseman to the outfield? Yes, Jason Kipnis signed as an outfielder and was converted to second base. He probably can do a decent job in the outfield. But Kipnis is rated as the American League's No. 3 defensive second baseman by fangraphs.com. In case you are wondering, the respected website rates Francisco Lindor No. 4 among shortstops and Giovanny Urshela No. 5 at third base. The Indians now have very, very good infield defense. The case for switching Kipnis to the outfield is they need outfielders. Jose Ramirez is an above average second baseman defensively. Ramirez got off to an awful start (batting .176) and was sent back to the minors. Since he returned, Ramirez is hitting .243 (.726 OPS) with 3 HR and 10 RBI in 117 plate appearances. The case for Ramirez as a starter is that he's only 22. He is a career .304 hitter in five minor league seasons. And Ramirez may develop into a starter. I just hate doing anything different with Kipnis. He turned into a .300 hitter when put in the leadoff spot. He has worked so hard to become a good second baseman. He is 28. It's very hard to think of asking him to switch positions unless you have an All-Star caliber player ready to take over at second base. ABOUT THE TRIBE 1. Trevor Bauer was the key player in the Shin-Soo-Choo three-team trade after the 2012 season. But General Manager Chris Antonetti also had Bryan Shaw added to the package. In three years with the Tribe, Shaw has become one of the league's most durable relievers. His overall record is 15-11 with a 2.82 ERA. This season, he is 3-3 with a 2.52 ERA. He'll probably appear in at least 70 games for the third year in a row. 2. Writing about Abraham Almonte led to checking how Rzepczynski is pitching for the Padres. The lefty reliever has an 8.10 ERA. 3. The Hector Rondon who pitched for the Cubs against the Tribe recently is the same Hector Rondon who was one of the organization's prospects several years ago. But Rondon had elbow reconstruction surgery in 2010. He fractured the same right elbow in 2011. He barely pitched in 2012 as he was recovering. The Cubs picked him in the 2013 minor league draft. He has stayed healthy and in the last two years, he has 56 saves and a 2.20 ERA. 4. The bullpen door is wide open for Giovanni Soto to claim a spot. The lefty came to the Tribe in 2010 in a deal for Jhonny Peralta with the Tigers. Soto is 24 and has developed into a prospect when switching from the rotation to the bullpen. The Tribe's only other lefty reliever is Kyle Crockett. Lefty Nick Hagadone had elbow surgery in July. Rzepczynski was traded to San Diego. 5. WKSU's Amanda Rabinowitz and I will be talking Tribe and Cleveland sports at the Hudson Library on September 30 at 6:30 p.m. It's free but you do need to register. Either do it online or call 330-653-6658. Terry's Talkin' Browns Terry's Talkin' Cavs", "source": "Cleveland Indians"}