{"published": "2015-09-23T13:00:00Z", "media-type": "News", "title": "Lawsuit: Blackstone Labs Is Selling Unsafe Supplement, Ostarine", "id": "107a7235-1ed7-455e-9fee-a7360c1c68f9", "content": "Lance Cpl. Laura Cardoso via Wikimedia Commons \n  \nBlackstone Labs is a heavy hitter in the weight-room-supplement game. The company is fronted by two social-media-savvy beefcakes who often take to YouTube to hawk and explain their company’s wares. But Arizona-based Nutrition Distribution, a supplement company that competes with Blackstone, claimed in an April lawsu it (filed in California) that the Florida company was trying to pass off products as “natural supplements” when they actually included “illegal synthetic ingredients .” \n\nNow, the legal action is heating up, with the competitor again claiming Blackstone is deceiving clients and flouting regulation. This month, lawyers asked a California judge to sign an injunction against the sale of one particular chemical that hasn’t even been approved for human use — a Blackstone product called Ostapure. \n\nIn promotional material and videos featuring the company’s two owners and frontmen, P.J. Braun and Aaron Singerman, the company trumpeted Ostapure’s usefulness for gym rats looking to swell up. “Ostapure has the same anabolic effect as testosterone without any of the adverse side effects that come from its use,” one of the owners says in a YouTube video. “When using Ostapure on a diet, you don’t have to worry about shrinking or flattening out while losing body fat. In fact, you’ll stay strong in the gym, keep your pumps, and maintain your sex drive.” \n\n[embedded content] \n\nAccording to Nutrition Distribution, though, Ostapure’s active ingredient, Ostarine, hasn’t been green-lit for human consumption. The drug is still going through trials, meaning “The sale of Ostarine over the counter without comprehensive evidence of its safety puts the public in significant danger,” the Blackstone competitor claims in court filings. \n\nBoth Ostarine and Ostapure are prohibited for use in sporting events by the World Anti-Doping Agency. “I was surprised to learn that Blackstone markets Ostarine as an over-the-counter steroid, promising huge muscle gains with no side effects,” Dr. Feliciano Serrano, an expert witness for Nutrition Distribution, wrote in an affidavit. “Ostarine has many side effects that we know of, and possibly more that we are unaware of, since there have never been comprehensive safety studies on humans.” \n\nOstarine is currently in phase II clinical trials conducted by its developer, Gtx Inc., for treating breast cancer and osteoporosis. “The fact that Ostarine is only in phase II trial means that there is no evidence that Ostarine is safe for humans to consume,” Serrano writes in his affidavit. “Ostarine has many recognized potential side effects, including hepatoxicity (liver damage), and markedly lower plasma HDL cholesterol (raising the risk of heart disease). Ostarine also has less serious side effects including headaches, back pain, and diarrhea.” \n\nBlackstone isn’t the only place you can get your hands on Ostarine. You can also purchase the active pharmaceutical ingredient – MK-2866 Ostarine – from a website called HardcorePeptides.com . And this isn’t the only heavy-duty drug you can scoop up from the website – we’re talking about the stuff you’d expect to only be able to get through a doctor. \n\nIn addition to Ostarine, HardcorePeptides.com sells Pramipexole , a drug used to treat Parkingson’s; Ketotifen , commonly used to treat asthma; clomiphene , an estrogen receptor modulator common in fertility treatments; exemestane , a drug used to treat breast cancer; and sildenafil , known more commonly in the bedrooms of America as Viagra. \n\nThis site is able to sell these drugs apparently because it claims to be a “peptide & research chemical supply company” that features products “sold for research purposes only.” Yet in the lawsuit claims the website was yet another “scheme to sell pharmaceuticals to bobybuilders” linked to the Blackstone crowd. \n\nHardcorePeptides parent company – Hardcore Ventures LLC – is incorporated in Washington state. Records list an “Aaron Singerman” as an officer of the company. Also, the lawsuit alleges that “Blackstone helps funnel its bobybuilding customers to Hardcore Peptides by inputting the customer’s data on Hardcore Peptides marketing listserv.” The Blackstone Labs’ Facebook account has also advertised sales on the Hardcore Peptides sites. \n\nThe injunction petition will be ruled on in the fall. Nutrition Distribution’s attorney declined to comment on the latest filings. Blackstone Labs did not return a message left at the office last week seeking comment. Attorneys representing the company also did not reply to an email seeking comment. ", "source": "Broward Palm Beach"}