{"published": "2015-09-17T06:05:57Z", "media-type": "News", "title": "Report 15-year-old girl allegedly sexually assaulted by three boys at a party in Springwood", "id": "94a039db-52f8-47c8-a0a8-49475a6eb4d5", "content": "By Sept. 17, 2015, 4:05 p.m. \n\nPolice are appealing for information after a report that a 15-year-old girl had been sexually assaulted by three teenage boys at a party in the lower Blue Mountains. \n\nOn the evening of Saturday August 15 the girl was at a party at Bellevue Road in Faulconbridge, police said. \n\nShe left later that night to attend a small gathering of teenagers at a home in Crane Street, Springwood, where the alleged attack took place. \n\nThe girl was sexually assaulted by three boys believed to be about 17-years-old, police were told. \n\nOfficers attached to the Blue Mountains Local Area Command were notified and established Strike Force Downe to investigate the alleged aggravated sexual assault. \n\nThe girl was not taken to hospital. \n\nPolice would not say whether there were adults at home at the time of the incident, or if the girl knew all the teenagers at the small gathering while their investigations were under way. \n\nDetectives are appealing to anyone with information, or anyone who was at both parties to come forward. \n\nContact Blue Mountains police on 02 4751 0299 or Crime Stoppers on 1800 333 000. \n\nThe girl attended a small gathering of teenagers at a house in Crane Street, where the attack took place, police were told.\\n\",colour:\"green\", title:\"\", maxWidth:200, open:1},\n{lat:-33.70493, lon:150.52578, text:\" \n\nThe 15-year-old girl was at a party on Bellevue Road in Faulconbridge before leaving later that night to attend a small gathering on Crane Street, Springwood. \\n\",colour:\"yellow\", title:\"\", maxWidth:200, open:0}] );\n}\n\nif (!window.gmapsLoaders) window.gmapsLoaders = [];\nwindow.gmapsLoaders.push(CreateGMapgmap201581715656);\nwindow.gmapsAutoload=true;\n/*]]>*/\n]]> \n\nThe story first appeared on The Sydney Morning Herald .", "source": "Cowra Guardian"}