{"published": "2015-09-09T13:19:00Z", "media-type": "News", "title": "College of Clinical Psychology at Argosy University Announces Continued Grant of Accreditation for Clinical Psychology Programs", "id": "32f41fe4-dd4a-49ba-8f11-12a90f07a9e0", "content": "SOURCE Argosy University \n\nChicago and Orange, Calif. campuses achieve reaccreditation from American Psychological Association\n\nORANGE, Calif. \n\nAPA accreditation reflects that the PsyD programs at the Illinois School of Professional Psychology \n\n\"Our clinical psychology program deans, leaders and faculty have demonstrated their commitment to our students and to their profession through this process and that shows in achieving continued accreditation from the Commission on Accreditation of the APA. Our clinical psychology programs are dedicated to the education and clinical training of the next generation of professional psychologists,\" said Dr. Robert Barrett \n\nThe APA's Commission on Accreditation is recognized by both the U.S. Department of Education and the Council of Higher Education Accreditation, as the national accrediting authority for professional education and training in psychology. In total, 10 programs within the College of Clinical Psychology at Argosy University \n\nThe Doctor of Psychology in Clinical Psychology programs at the Illinois School of Professional Psychology at Argosy University | Chicago and the American School of Professional Psychology | Southern California are accredited by the Commission on Accreditation of the American Psychological Association (APA). Questions related to the programs' accredited status should be directed to the Commission on Accreditation: Office of Program Consultation and Accreditation, American Psychological Association, 750 1st Street, NE, Washington, DC 20002 Phone: (202) 336-5979 / Email: apaaccred@apa.org Web: www.apa.org/ed/accreditation.\n\nPrograms, credential levels, technology, and scheduling options vary by school and are subject to change. Not all online programs are available to residents of all U.S. states. Administrative office: Argosy University \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/college-of-clinical-psychology-at-argosy-university-announces-continued-grant-of-accreditation-for-clinical-psychology-programs-300139498.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KTUL"}