{"published": "2015-09-25T17:29:04Z", "media-type": "News", "title": "Punk’s Not Passed", "id": "c9a210b1-7993-4c6a-b911-fbea4c6ef154", "content": "In her Wexner retrospective, filmmaker Penelope Spheeris excavates her iconic and primal past  \nIt was Black Flag squatting in a dilapidated church.  Darby Crash muttering his classic “puzzled panther” musings. A coked-up Ozzy cooking an egg, or the infamous scene  of W.A.S.P. guitarist Chris Holmes chugging straight  vodka from his swimming pool as his mother looks on. \n \nDirector Penelope Spheeris’ iconic Decline of Western Civilization series of documentaries were fly-on-the-wall portraits of the Los Angeles’ subcultures in full bloom—and in mid-decay. \n \nBut for the longest time, save the occasional midnight screening or happened upon bootleg VHS copy, the Decline films and their raw portrayal of the burgeoning punk and metal scenes were never given their proper due in the age of the DVD. That’s all about to change with the Shout! Factory re-issues of the entire trilogy, filled with hours and hours of extras giving Spheeris a closure to her work. There were no copyright issues or finagling with bands wanting a chunk of change in their twilight years—it was simply a matter of Spheeris feeling instinctively unnerved at watching her life pass before her. It was footage she couldn’t handle watching. \n \nSpeaking with a very confident and still invigorated Spheeris, it was apparent she knows her arena as a filmmaker. Despite being responsible for hits such as Wayne’s World , Black Sheep , and, to a lesser degree, The Little Rascals , it’s the Decline films that have become her calling card and life’s work. The only way to convey her enthusiasm about her upcoming visit to the Wexner Center to introduce the landmark first film is through our brief, but enlightening conversation. \n \nGrowing up around a lot of cultural shifts, during The Decline of Western Civilization , you were in your mid-30s. Were you a part of that scene? What drew you to document that particular punk scene in Los Angeles? I had been going to those punk clubs. I was definitely a part of the scene and I knew most of the people in the movie before I decided to make a movie. I was older, but I think I was still working out my childhood issues and I saw their childhood issues and decided to make a film about it. \n \nSpeaking of childhoods, I truly feel that the film shaped the way I appreciate music and what I appreciate, so that’s a really good answer.  Good. That’s good to hear. \n \nI guess the same question is relevant for The Decline of Western Civilization II: The Metal Years , which was made seven years later. Were you equally attracted to the metal scene in Los Angeles, or were you just playing the role of documentarian?  I’ll have to be honest with you. I was going to those clubs too. I wouldn’t have made that movie if I wasn’t a part of that scene as well. I’m ashamed to admit that I was a part of that scene. \n \nYou shouldn’t be ashamed. I think in a lot of ways, those first two films were blueprints for their respective scenes, or genres. Especially The Metal Years , where putting a band like London up against clips of Ozzy and Kiss posed an interesting juxtaposition. I haven’t talked about this much, because with these re-releases I didn’t want to watch any of it. I was forced to watch this again. I couldn’t handle it. But when I look at them I see so many aspects of attitude and style and trends that are still prevalent to everyday life. When I filmed them, they were unique. \n \nJust the jargon even, the language… the word “headbanging” for instance. I love the part when the audience members are explaining to you just exactly what “headbanging” entailed.  Yeah. I think that was eventually a cemented part of our culture with the “Bohemian Rhapsody” scene in Wayne’s World . At the same time, it kind of killed the authenticity of something that was once an honest part of a culture. \n \nI didn’t want to even touch Wayne’s World and just focus on the Decline films, but I do think that for you, Wayne’s World may have been this zenith of punk and metal—like your ironic raspberry towards what was then considered “alternative.”  I think I got to do Wayne’s World because of The Metal Years . There wasn’t anyone else who was a director in Hollywood who knew anything about that music either way. Plus I knew Lorne Michaels. It changed my life. I kind of wished I hadn’t made it only because I could have made the films I wanted to make but then I would’ve been broke. But yeah, it pokes fun at a lot from my past.” \n \nFor me, seeing the original Decline was a sort of cultural gauntlet. I was 13 and watching from a dubbed VHS copy. Did you have the foresight when you made it that it could be that type of landmark for that scene and that music?  Well there was a guy in Singapore the other day who asked me how the kids in the third Decline could have seen the first Decline since it wasn’t available, but you just explained it. What happened was, even though it wasn’t available it became an underground contraband and established it that way. \n \nIs there any kind of subculture or counter-culture that you see currently that is vital? Something that you would like to expose or document? What is IV?  The answer to that and I’m sure you’ll understand, is that today everyone has a camera. I hate to say the subject matter because of that, because anyone can go and make that movie now. But somewhere deep down in the bottom of the hard drive of one of those movies is the beginning of Decline IV . I’m looking forward to doing it and people are always for it. \n \nSpheeris will introduce the original Decline of Western Civilization on Friday, October 23 at the Wexner Center at 7 p.m. Parts II and III will screen on Saturday, October 25 at 2 p.m.", "source": "614columbus.com"}