{"published": "2015-09-18T13:33:27Z", "media-type": "News", "title": "Burkina Faso coup leaders release interim president", "id": "f156ecd6-3a22-4985-8776-810c09586cde", "content": "Michel Kafando and some ministers are released 'as a sign of easing tensions and in the general interest,' the coup leaders announce in a statement \n            \n\n\nRELEASED. Burkina Faso transitional president Michel Kafando. File photo by Legnan Koula/EPA \n \nOUAGADOUGOU , Burkina Faso – Coup leaders in Burkina  Faso announced on Friday, September 18, they had released the country's interim president Michel Kafando whom they had detained along with the premier and two ministers. \n \n\"As a sign of easing tensions and in the general interest, the national council for democracy has decided on the release of the ministers and Michel Kafando,\" said a statement, adding that Kafando had been released late on Thursday. \n \nThere were no specific details about Prime Minister Isaac Zida. \n \nSoldiers from the elite presidential guard burst into a cabinet meeting Thursday and seized Kafando and the others. \n \nThe coup – led by General Gilbert Diendere, close to ousted strongman Blaise Compaore – triggered street protests outside the presidential palace. \n \nThree people died from gunshot wounds and at least 60 others were treated for various injuries, doctors at the main hospital in Ouagadougou, the capital, said. \n \nThe unrest hit the landlocked west African nation just ahead of presidential and legislative elections scheduled for October 11 – the country's first since veteran leader Compaore was forced out last year. \n \nDiendre, speaking to Agence France-Presse (AFP) hours after seizing power, said he still wanted elections to take place . \n \n\"Our wish is to reorganize ourselves and to move towards elections soon,\" General Gilbert Diendere said, while refusing to give a date for a vote. \n \n\"But we plan to discuss all that with the concerned actors, notably the political parties and civil society organizations to establish a timetable that allows us to move towards presidential and parliamentary elections.\" – Rappler.com", "source": "Rappler"}