{"published": "2015-09-29T05:07:33Z", "media-type": "News", "title": "Hamilton powers to Japanese GP win", "id": "e97589dd-4507-4cf3-ad20-68ba0e4b15ed", "content": "Lewis Hamilton of Mercedes gestures as he stands on the podium after winning the Japanese Grand Prix at Suzuka. \n             \nMercedes driver Lewis Hamilton pulled off an aggressive passing move on teammate Nico Rosberg and went on to win the Japanese Grand Prix on Sunday, moving a step closer to claiming his second straight Formula One title. \n \nHamilton, who had his first retirement of the season at last weekend's Singapore GP, capitalised on a strong start and surged ahead of Rosberg at the first corner. He led the rest of the way, crossing the finish line a comfortable 18.9 seconds ahead. Ferrari driver Sebastian Vettel was third, 1.8 seconds behind Rosberg, who started from pole. \n \nWith five races left, Hamilton has a 48-point lead over Rosberg. \n \nHamilton claimed his eighth win of the season. It was his 41st career win, tying him with his childhood hero Ayrton Senna. \n \n\"I'm not a teary guy, but I'm full of joy and happiness today,\" Hamilton said. \n \nRosberg and Hamilton went through the first two bends side by side. Hamilton appeared to give Rosberg little room at the second turn, forcing the German partially off the track. \n \n\"I didn't think it was that close,\" Hamilton said. \"The inside line is the inside line, so it was my corner.\" \n \nRosberg was reserving judgment until he saw the incident on replay. \n \n\"It was a pity to do that on the start,\" Rosberg said. \"We battled around Turns 1 and 2. It got very close on the exit at Turn 2 and I had to back out and that cost me the race.\" \n \nWith Hamilton comfortably ahead throughout the grand prix, the focus shifted to the tight battle for second place between Rosberg and Vettel. \n \nFerrari elected to wait until Rosberg pitted before bringing in Vettel, and that proved critical. Even though Vettel's stop was four tenths of a second faster than Rosberg's, the Mercedes driver's lap on fresh rubber was enough to get him just ahead of Vettel, and that's how it stayed. \n \n\"I tried everything,\" Vettel said. \"The tyres were on the limit - not more that I could have done.\" \n \nVettel's Ferrari teammate Kimi Raikkonen was fourth followed by Williams' Valtteri Bottas. \n \nThe podium positions were exactly the same as last year's race at Suzuka which was marred by a crash involving Jules Bianchi, who died in July, having never regained consciousness. \n \n\"This is a circuit that I can honestly say I've struggled at through all the years I've come here,\" Hamilton said. \"But it's one that I've loved driving at...so you really want to come here and dominate at this track.\" \n \nForce India's Niko Hulkenberg was sixth while the Lotus pair of Romain Grosjean and Pastor Maldonado finished seventh and eighth, giving the financially strapped team a confidence boost. \n \nToro Rosso's Max Verstappen - in his last race as a 17-year-old - was ninth ahead of his teammate Carlos Sainz Jr. \n \nBoth Red Bull cars finished outside the top 10. Daniil Kvyat started from the pits, while Daniel Ricciardo had a tire-bumping duel with Williams' Felipe Massa soon after the start, leaving both with punctures that forced them to pit after one lap. \n    \nThe next race is the Russian GP in Sochi on October 11.", "source": "Dominion Post"}