{"published": "2015-09-17T06:07:15Z", "media-type": "News", "title": "Uber rivals band together to form U.S.-China alliance", "id": "7a102fb1-9f85-432d-84c4-0ee61167b2b2", "content": "(CNNMoney) -  \nTwo of Uber's biggest rivals are joining forces. \n \nSan Francisco-based Lyft and Chinese firm Didi Kuaidi announced a strategic international partnership on Wednesday that will make it easier for users to hail rides while visiting either country. \n\nIn practice, it'll mean that Lyft users can travel to China, hail a ride using their Lyft app, and pay in U.S. dollars. Chinese travelers can do the same in the U.S. using Didi's app. \n\nTravelers will be able to take advantage of the deal in early 2016. \n\nAnd there are millions who will potentially do so. According to Lyft, nearly 8 million people traveled between China and the U.S. in 2014. \n\n\"Our vision was never just about the United States,\" said Lyft cofounder John Zimmer in a press conference announcing the partnership. \"It's just the start.\" \n\nThe announcement puts both firms in a better position to take on Uber, which is pouring resources into Asia, particularly China and India. \n\nBoth Zimmer and Didi President Jean Liu seem confident in their two-against-one approach. \n\nZimmer said Lyft's business is \"stronger than ever and that the company's business in New York City alone has tripled over the past few months. \n\nLiu called the deal the marker of a \"brand new era for the global ride-sharing industry.\" \n\nDidi Kuaidi -- which offers everything from black cars and bus services to taxis and ridesharing -- closed a $3 billion round just last week. \n\nThe partnership isn't all that surprising. Earlier this year, Didi invested $100 million into Lyft as part of its latest $530 million funding round, which was led by Japanese e-commerce firm Rakuten. \n\nLyft is valued at $2.5 billion, according to CB Insights. Uber's valuation, on the other hand, is $51 billion. \n\nBut according to Liu, Uber has far from won the battle. \n\n\"People don't realize that ridesharing is still in its infancy,\" she said. \"We will be able to push the evolution of this industry to the next level.\" \n\nThat involves sharing best practices, market knowledge and technology. The partnership will also help with the regulatory hurdles that typically go along with entering new markets. \n\nZimmer did not respond to questions during the Q&A about whether Lyft would partner with other ridesharing companies in markets like India.", "source": "KWCH 12"}