{"published": "2015-09-01T13:09:02Z", "media-type": "News", "title": "Elizabeth Brunetti from The Bare Midriff Takes First Place in the Golden Girl Granola™ Blogger Recipe Challenge!", "id": "0feac66c-fca0-4868-a55f-8d423528f3ba", "content": "Golden Girl Granola is excited to announce that Elizabeth Brunetti from The Bare Midriff of Columbia, MD is the Grand Prize Winner of their first annual Blogger Recipe Challenge. For being the Grand Prize Winner, Elizabeth will receive 4 free flavors of Golden Girl Granola each month for one year. Saundra Contreras from Famished Fish, Finicky Shark takes second place and Pamela Braun from My Man's Belly is the third place winner. \n\nBloggers from across the nation were challenged to show off their creativity by submitting original recipes using one of seven flavors of granola offered by Golden Girl Granola. After weeks of judging, Elizabeth Brunetti's Granola Crusted Chicken with Blueberry Slaw was the winning recipe. The recipe was created using Golden Girl Granola's Bluesberry flavored granola. The recipe really impressed the judges based upon its creativity, originality, healthiness and use of ingredients. \n\n\"Elizabeth's dish truly embraced the essence of our philosophy that healthy is good, but healthy and great tasting is even better. It was delicious, healthy, creative, with easy-to-find ingredients,\" said Deborah O'Kelly, owner of Golden Girl Granola. \n\nFirst Annual Blogger Recipe Challenge Winning Recipe: \n\nIngredients for the chicken \n\n1. 1/2 cup Golden Girl Bluesberry Granola \n\n2. 1 boneless, skinless chicken breast (about 1/2 lb) \n\n3. 1/2 tsp each salt and pepper \n\n4. 1/4 cup goat cheese \n\n5. 1/4 cup blueberries \n\n6. 1 Tbsp butter \n\n7. 1 egg, beaten and poured into a shallow dish \n\nFor the slaw \n\n1. 2 cups Brussels sprouts, grated \n\n2. 1 cup fresh blueberries \n\n3. 1/4 cup sliced almonds \n\n4. 1/2 cup Golden Girl Bluesberry Granola \n\n5. 2 Tbsp apple cider vinegar \n\n6. 1/4 tsp salt \n\nInstructions \n\n1. Preheat the oven to 350 degrees. \n\nCrush the granola \n\n1. Pour the granola into a zip-top bag, removing most of the air before sealing. \n\n2. Use a rolling pin to crush the granola until it has the consistency of breadcrumbs. Spread it onto a plate and set aside. \n\nPound out the chicken \n\n1. Place the chicken on a cutting board and cover with a strip of plastic wrap \n\n2. Use a mallet to pound the chicken, starting from the center, working your way to the edge \n\n3. Pound out to about 1/4-inch thickness \n\n4. In a small bowl, combine the goat cheese and blueberries. Use a fork to crush the berries and mix them into the goat cheese until mostly smooth and well-combined. \n\n5. Sprinkle the chicken with the salt and pepper, then spread the goat cheese mixture on all but the top 1-1/2 inches of the chicken. \n\n6. Starting at the bottom, roll up the chicken into a log, ending with the edge that doesn't have any goat cheese on it. \n\n7. Melt the butter in an oven-safe sauté pan set over medium-high heat. \n\n8. Carefully lift the chicken and dip it first into the egg wash, letting any excess drip off, and then into the granola, pressing the granola onto all sides of the chicken. \n\n9. Place the chicken in the sauté pan and cook for 2 minutes. \n\n10. Use a wide spatula to carefully turn the chicken over, then put the pan in the oven. Bake for 7 minutes, or until a thermometer inserted in the center reads 165 degrees. \n\n11. Remove the pan from the oven and tent a piece of aluminum foil over the pan for 5 minutes to allow the chicken time to rest. \n\n12. Slice and serve. \n\nFor the slaw \n\n1. Combine all of the slaw ingredients in a medium-sized bowl. \n\n2. Gently toss to combine \n\nSecond place winner, Saundra Contreras from Riverside, CA won 14 free bags of Golden Girl Granola for her delicious Chorizo Meatballs with Sweet Mole Sauce recipe using Golden Girl Granola's Chocolate Decadence flavored Granola. \n\nThird place winner, Pamela Braun from Grapevine, TX won seven free bags of Golden Girl Granola for her wonderful Pasta Shells with Prosciutto and Lemon Crunch Topping recipe using Golden Girl Granola's Home Sweet Honey flavored Granola. \n\nLaunched in 2011, Golden Girl Granola comes in seven all natural delicious head-over-heels flavors that include Bluesberry, Chocolate Decadence, Creative Cranberry, Forest Maple, Home Sweet Honey, Original and Truly Tropical. And the best part, Golden Girl Granolas are made with whole-grains, dairy free, cholesterol free, casein free, trans-fat free, wheat free, and have no preservatives, artificial color or flavors. Golden Girl Granola™ is a family owned and operated business located in Shirley, Massachusetts and produces a branded line of gourmet granola products superior in taste and made from the highest-quality ingredients. Golden Girl Granola is a \"Healthy Snack\" alternative for health conscious consumers who appreciate good taste. Flavors include Forest Maple, Creative Cranberry, Bluesberry, Chocolate Decadence, Original, Home Sweet Honey, and Truly Tropical. Golden Girl Granola offers the complete line nationwide for Chain Supermarkets, Independent Supermarkets, Gourmet Food Stores, Club Stores and Convenience Stores. For more information contact Deborah O'Kelly at 978-425-5058 or e-mail her at deborah(at)goldengirlgranola.com.", "source": "Wall Street Select"}