{"published": "2015-09-10T12:28:00Z", "media-type": "News", "title": "BlackRock Canada Launches iShares Conservative Short Term Strategic Fixed Income ETF (XSC) & iShares Conservative Strategic Fixed Income ETF (XSE) Seeking to Maximize Yield While Managing...", "id": "d486946e-ad77-454f-8788-4d2b6799238f", "content": "TORONTO, ONTARIO -- (Marketwired) -- 09/10/15 -- (TSX: CBR)(TSX: CBR.A)(TSX: CLO)(TSX: CLO.A)(TSX: CHI)(TSX: CHI.A)(TSX: CMW)(TSX: CMW.A)(TSX: XLA)(TSX: XVX) \n\niShares, the industry-leading exchange traded fund (ETF) business(1) at BlackRock Asset Management Canada Limited (BlackRock Canada), an indirect, wholly-owned subsidiary of BlackRock, Inc. (BlackRock), announced the launch of two new iShares strategic fixed income ETFs to help generate income for investors while addressing sensitivity to interest rate volatility. Building on the success of the iShares Short Term Strategic Fixed Income ETF (XSI) -- which launched earlier this year and has attracted the largest inflows of any new Canadian ETF in 2015(2) -- the iShares Conservative Short Term Strategic Fixed Income ETF (XSC) and the iShares Conservative Strategic Fixed Income ETF (XSE) will provide investors with a model-driven suite of fixed income ETFs. \n\n\"We listened to our clients and are moving to meet their needs. The success of XSI demonstrates that investors are eager for fixed income solutions to help generate income, mitigate duration risk and navigate an uncertain interest rate environment,\" said Pat Chiefalo, Managing Director, Head of Canadian Product for BlackRock's iShares business. \"These two new funds, in combination with XSI, offer a full range of fixed income solutions, delivering investors access to BlackRock's global iShares platform.\" \n\nBuilding a Model-Driven Fixed Income Suite: Generating Yield Amidst Interest Rate Volatility \n\nLike XSI, XSC and XSE have been designed to respond to the realities that fixed income investors face in today's marketplace. Amidst the shifts around sustainable economic growth prospects, central banks continue to pursue - or maintain - low interest rate policies, making the search for yield a continued challenge. \n\nXSI responded to these market conditions by offering investors a strategic, model-driven fixed income ETF aimed at generating yield while managing the uncertain interest rate outlook. Amidst continued economic shifts, investors have indicated a desire for additional fixed income solutions that can meet the needs of investors operating within the boundaries of a lower risk profile. These two new products are expected to appeal to an investor with a relatively 'conservative' risk profile through limiting their total exposure to high yield securities to 25% of each fund's respective portfolio upon rebalancing. Both new products, like XSI, draw upon the full breadth and depth of BlackRock's global iShares platform, enabling investors to gain unique access to otherwise hard-to-reach international exposures such as emerging markets corporate bonds. \n\n\"Investors recognize that the current trends in monetary policy and historically low interest rates cannot last forever,\" said Aubrey Basdeo, Managing Director, Head of Canadian Fixed Income, BlackRock. \"The Bank of Canada's decision yesterday to maintain interest rates only reinforces the \"low for longer\" yield outlook in domestic bond portfolios. To overcome this income challenge, some investors may want to consider alternative fixed income strategies with international exposures to generate additional yield. XSI has helped address this investor demand, and XSC and XSE will provide investors with even greater optionality.\" \n\nXSC and XSE will invest primarily in securities or ETFs that provide exposure to Canadian and international fixed income securities. Both funds will seek to hedge any resulting U.S. dollar or other foreign currency exposure, as applicable, back to Canadian dollars. XSC will also upon rebalancing, generally limit its exposure to interest rate risk by maintaining a portfolio duration of less than five years. The management fees will be 0.40% for XSC and 0.50% for XSE. \n\nStructured as a \"fund of funds\", XSC and XSE will, like XSI, leverage BlackRock's global iShares platform. XSC and XSE will directly hold funds that provide exposure to both domestic and international fixed income securities that Canadian investors might otherwise have difficulty accessing. The diversification capabilities of these funds allow for rebalancing of exposures as the fixed income landscape fluctuates, in order to continue to limit interest rate sensitivity (as well as country-specific risk) and enhance opportunities for greater yield. \n\nFurther information on the iShares Funds can be found at www.blackrock.com/ca. BlackRock is a global leader in investment management, risk management and advisory services for institutional and retail clients. At June 30, 2015, BlackRock's AUM was US$4.721 trillion. BlackRock helps clients around the world meet their goals and overcome challenges with a range of products that include separate accounts, mutual funds, iShares® (exchange-traded funds), and other pooled investment vehicles. BlackRock also offers risk management, advisory and enterprise investment system services to a broad base of institutional investors through BlackRock Solutions®. As of June 30, 2015, the firm had approximately 12,400 employees in more than 30 countries and a major presence in key global markets, including North and South America, Europe, Asia, Australia and the Middle East and Africa. For additional information, please visit the Company's website at www.blackrock.com/ca - Twitter: @BlackRockCA - Blog: www.blackrockblog.com/can iShares is a global leader in exchange-traded funds (ETFs), with more than a decade of expertise and commitment to individual and institutional investors of all sizes. With over 700 funds globally across multiple asset classes and strategies and more than US$1 trillion in assets under management as of June 30, 2015, iShares helps clients around the world build the core of their portfolios, meet specific investment goals and implement market views. iShares funds are powered by the expert portfolio and risk management of BlackRock, trusted to manage more money than any other investment firm.(3) \n\nCommissions, management fees and expenses all may be associated with investing in iShares Funds. Please read the relevant prospectus before investing. Fund securities are not covered by the Canada Deposit Insurance Corporation or by any other government deposit insurer. There can be no assurances that the fund will be able to maintain its net asset value per security at a constant amount or that the full amount of your investment in the fund will be returned to you. The fund is not guaranteed, its values change frequently and past performance may not be repeated. Tax, investment and all other decisions should be made, as appropriate, only with guidance from a qualified professional. \n\n(1) Based on assets under management (\"AUM\") CAD $44.6bn, as of August 31, 2015. \n\n(2) Based on data compiled by Bloomberg and BlackRock, as of August 31, 2", "source": "Pettinga Financial Advisors"}