{"published": "2015-09-13T16:08:28Z", "media-type": "News", "title": "The trouble with women in Egypt!", "id": "88e3d4c9-c112-473a-95af-ed316a07e486", "content": "After availing themselves to much media manipulation and to political machinations, women in Egypt are back in a very familiar place and one where they have been before. The state is paying lip service to their rights but dismantling their abilities to mobilise.\n\nWomen are present but in retreat! By women, I mean the women’s movement. By retreat I refer to the deflation of a dynamism that saw women contesting, protesting, challenging and forming alliances and its replacement with a rather flaccid support for a strong state that is the champion and protector of women.\n\nThe state has delivered on many of its promises to women. The creation of specialist anti-harassment units in the Ministry of Interior was in response to a women’s movement lobby and is an important step towards safer streets.\n\nThe president spoke out against sexual harassment by visiting one of the savagely attacked victims during the presidential election celebrations and urged the government to issue a harsh harassment law. By so doing he became the first head of state to recognise and condemn such savage attacks. But there have also been other gains made on behalf of women.\n\nThe quota for women in local councils is perhaps the most significant attainment realised by women and one that can potentially change the political structures of Egypt. The 2014 constitution mandates the election of at least 13,000 thousand women to local councils.\n\nAt a more symbolic level we find more gains. The Ministry of Justice has recently appointed a female deputy minister and has confirmed the entry of women into the judiciary in response to long standing demands from women’s groups.\n\nWomen have also been celebrated as the loyal and trustworthy allies of the state. They stood firm against ‘ikhwanisation’ (Muslim Brotherhood influence) and mobilised in their millions to approve the constitution of 2014 and vote for the current president and as such are lauded and celebrated, or at least some of them are!\n\nOn the other hand and in contrast to symbolic or substantive gestures of gender justice, there have been systematic negations of women’s rights. At the formal level, evidence can be found in the neglect of the National Council for Women. The term of the current council ended in March 2015. The deliberations for selecting a new national council for women have taken place in closed circles and have not yet yielded a new council.\n\nThe council is comprised of a head and 29 members. The selection of these women and men is happening through personal nominations of ‘trusted insiders’ and filtered through the routine and excessive security and executive checks. There may well be 30 amazing people who have been selected but the process by which this organ of state feminism is being built is essentially antithetical to the idea of accountable, representative or transparent national machinery.\n\nMeanwhile, women’s organisations have suffered as collateral damage as a result of the stringent civil society restrictions and regulations that have targeted human rights work. Their ability to organise and mobilise is curtailed and their funds have been diminished. Women in political parties who were instrumental in organising the 30th of June 2015 demonstrations and sit- ins are also challenged by the dysfunctional state of their parties.\n\nWomen have been here before! A century ago women began to mobilise and form a united front to gain basic rights but it was the post 1952 revolution regime that gave them these rights as a presidential gift and not in response to political pressure. Once again, the state is recognising some rights of women but curtailing the ability of a women’s movement to make claims or to pressure for change or recognition. \n\nOnce again the state is approaching issues of gender justice and of women’s rights as a set of formal or institutional arrangements that are peppered with slogans and symbolic gestures. \n\nEgypt may well have a 30 member NCW, a women’s department in the police force, 13,000 women elected as local council members, a few female judges, a lot of lip service being paid to the “Great Egyptian Woman”, and some prominent women who are present in the public sphere and who use themselves as evidence of the high regard in which women are held by polity and by society. But none of these structures or symbols will matter if there isn’t a vibrant, veritable and free movement to guard any gains, hold power to account and represent the interests and realities of women.\n\nThe state cannot be a substitute for society or expropriate civil space in the name of paternalism or protection. The National Council for women is not a proxy for women as a whole. It is simply a machinery dedicated to the cause of gender equality and not a tool to sequester women’s voices.\n\nHopefully the new council will honour this responsibility and build on the strong voice and presence of the current (and now elapsed) NCW leadership.", "source": "Al Ahram"}