{"published": "2015-09-21T22:09:53Z", "media-type": "News", "title": "Attorney Kevin Goodno Elected First Public Member Chair of the American Brain Foundation", "id": "f074d7f9-ca36-450c-8e1f-a95ee352d163", "content": "Fredrikson & Byron attorney Kevin P. Goodno was recently elected chair of the American Brain Foundation Board (formerly known as the American Academy of Neurology Foundation). The American Brain Foundation supports research and education to discover causes, improved treatments, and cures for brain and other nervous system diseases. Goodno has served on the board since 2011 and will continue to serve as chair for a two-year term. Goodno is the first chair who is not a neurologist. \n \n“The brain is truly the great unknown. We have within our reach the ability to identify the causes of brain diseases and their cures. It is an exciting time. We have an opportunity to make a difference in the lives of millions of individuals—I am honored to be part of that opportunity,” said Goodno. \n \nGoodno is a respected and experienced advocate, effectively representing clients on complex policy and political issues before state legislative, agency and executive branch decision makers. He serves as government relations counsel for clients in his areas of special expertise—health care, social services and tax policy—and also in a variety of other issue areas including capital bonding, commerce and business, government reform and efficiency, and procurement. Recognized for excellence in his work as a lobbyist, commissioner of Minnesota’s largest state agency and state legislator, Goodno’s diverse background provides a unique blend of experiences and relationships that sets him apart from his peers. He also has extensive experience in state and local government, non-profit organizations, and the private sector. Prior to joining Fredrikson & Byron, Goodno served as commissioner of Minnesota’s largest agency, the Department of Human Services. He also served on many high-level committees, including as a member of the Governor’s Health Cabinet, as co-chair of the Minnesota Mental Health Action Group, as co-chair of the Advisory Council to End Long-Term Homelessness and as a member of the Governor’s Drive to Excellence Sub-Cabinet. In addition, he served in the Minnesota House of Representatives for twelve years being recognized for his leadership on health care, human services and tax policy issues. Goodno also has also served in leadership roles with the Epilepsy Foundation of Minnesota and the Citizen’s League. \n \nFredrikson & Byron is a 275-attorney law firm based in Minneapolis, with offices in Bismarck, Des Moines, Fargo, St. Paul, Monterrey, Mexico, and Shanghai, China. Fredrikson & Byron has a reputation as the firm “where law and business meet”. Our attorneys bring business acumen and entrepreneurial thinking to work with clients, and operate as business advisors and strategic partners, as well as legal counselors. More information about the firm is available at www.fredlaw.com . Follow us on LinkedIn and on Twitter @FredriksonLaw . \n \nMedia Contact: Kelly Griffith, Marketing Communications Manager, 612.492.7514,  kgriffith@fredlaw.com", "source": "Fredrikson & Byron"}