{"published": "2015-09-18T15:14:28Z", "media-type": "News", "title": "Memories of Malvern are stirred in Wolverhampton author's new book.", "id": "bbd65b1c-c3ee-4a7d-a80f-7b091282a053", "content": "MEMORIES of holidays in Malvern form part of a new book by Wolverhampton author Tony Perry. \n \nThe book, Of The River People, draws on Mr Perry's memories of childhood in the 1950s and 60s, which includes visit to the town and the hills. \n \nMr Perry also examines his family background, which also has links with the Malvern area. His grandmother Nora was an Amphlett, one of ten children born to William and Ellen Amphlett of Mill Cottage, Castlemorton. \n \nHe says the Amphletts were known as \"river people\" because they always lived in the Severn vale, accounting for the title of his book. \n \nHe recalls visiting his Auntie Elsie and Uncle Jim at Malvern Link on a Black and White coach that would deposit him outside the Malvern Link Co-op two hours after leaving Wolverhampton. \n \nHe said: \"Here Uncle Jim (Roan), a big, quiet man, who had been a ganger on the railway, met us to help carry the cases to their council house in Duke of Edinburgh Way. \n \n\"Auntie Elsie was a sister of my grandmother Nora. Nora had married William Averill, from Bromesberrow, who saw service in the First World War on HMS Tiger, taking part in the Battles of Dogger Bank and Jutland. His brother Thomas served with the Herefordshire Regiment, died of wounds in 1918, and is recorded on the Bromesberrow war memorial. \n   Promoted stories   \n\"Our stay in Malvern always included visits to great aunts and great uncles. Amongst the older family was Uncle Arthur, foreman at Great Malvern Station. \n \n\"We would catch a bus into Great Malvern, and here the Priory Church was a beautiful attraction, as was Priory Park, particularly if I was let loose in one of the children’s paddle boats. \n \n\"There were walks up to the summit of the Worcestershire Beacon, with the welcome little café which used to look out from the top. \n \n\"There seemed to be a good choice of Midland Red buses to reach different places in those days, for instance the Wyche Cutting, and the British Camp Hotel. \n \n\"From here we would set off up the Herefordshire Beacon, and I would always have to find the Giant’s Cave, just to say that I had been inside it. \n   \n Share article  \n   \n\"We even went as far as walking the whole length of the Malvern Hills one day. This expedition we regarded as quite an achievement, if rather tiring adventure into unknown territory, where we were warned to watch out for snakes – we never saw one.\" \n \nOf the River People is published by Brewin Books, priced £9.95, and is available from bookshops or direct from the publisher.", "source": "Droitwich Spa Advertiser"}