{"published": "2015-08-31T21:24:32Z", "media-type": "News", "title": "Obama’s Balancing Act: Climate Change And Arctic Drilling", "id": "3d546f94-463e-407a-8b90-84f1a84c9dd2", "content": "President Obama kicked off a multiday visit to Alaska on August 31, with the intention of highlighting the effects of climate change unfolding in real-time. He will point to the shrinking ice, rising sea levels, land erosion, and melting permafrost as evidence that the world must act to reduce greenhouse emissions. \n \nAlaska is bearing the brunt of climate change worse than other parts of the world. “This is an issue that is very here and now,” Brian Deese, a top climate advisor to Obama, told reporters ahead of the President’s visit. “The issue of climate change is not an issue of the future tense in Alaska. It is affecting people in their lives and livelihoods in real ways.” \n \nAt the same time, not too far from his visit, is a major Arctic oil project that his administration just approved, underscoring the contradictions within the U.S. government about fossil fuel production and the need to address climate change. \n \nRelated: Eni Announces Supergiant Gas Discovery Off Egyptian Coast \n \n“It’s inconsistent on the one hand for President Obama to lead the world toward comprehensive action on climate change, while on the other allowing companies to pursue difficult, expensive oil in dangerous and remote places,” Michael LeVine, senior counsel for environmental group Oceana, told the New York Times . \n \nThe timing is indeed a bit awkward. Royal Dutch Shell is in the midst of drilling campaign in the Chukchi Sea, which Obama’s Interior Department recently green-lighted. Shell has a tight window in which to drill. By the time Shell’s icebreaker completed repairs in Portland, OR, managed to navigate through Greenpeace protestors , and arrived on site, Shell was left with little margin for error. The Anglo-Dutch company will essentially have just August and September to drill in the Burger prospect, before it has to shut operations down for the winter. \n \nAcknowledging his approval of Shell’s drilling plans, Obama argued in his weekly radio address that he wants the nation to move beyond fossil fuels – in Anchorage on Monday he called for aggressive action on climate change – but that in the interim, while the nation is still hooked on oil and gas, it would be better to produce domestically than to import. \n \nRelated: Could Oil Sink Below $40 Per Barrel Again? \n \nThere is strong environmental opposition to Arctic drilling, and protests were held in Anchorage in response to Obama’s visit. But there is also a lot of pressure at the state level to expand oil and gas drilling in Alaska. At issue is the state’s overwhelming dependence on oil production for its economy, and state revenues have been battered by the twin calamities of falling oil production and collapsing prices. Moreover, the Trans-Alaskan Pipeline, which runs 800 miles from Alaska’s North Slope to the state’s southern coast, is running dry due to falling oil production. Oil flows in the pipeline are declining by about 5 percent per year. \n \n“We have an oil pipeline that’s two-thirds empty,” Alaska’s Governor Bill Walker, told Bloomberg. “It’s easy for people to predict what will or won’t happen, but as governor I can’t take that chance. Right now, about 75 percent of our revenue comes from that oil pipeline.” To make matters worse, the pipeline becomes more difficult to operate when oil flows drop below a certain level. More pump stations will likely be needed to keep up pipeline pressure if oil flows fall below 300,000 barrels per day. Thus, for the Alaskan government, declining oil production is an urgent problem. “I think that he’ll have a better appreciation when he’s up here, kind of what the need is in Alaska,” the state’s governor said. \n \nRelated: Why So Much Oil Price Volatility? Blame The Speculators \n \nMeanwhile, Shell is facing some pretty harsh conditions in the Arctic. On August 28, the company was forced to halt drilling operations because of high winds. But even if Shell is successful with its drilling operations in the Chukchi Sea, the company doesn’t expect to bring oil online until the end of the next decade. \n \nTaking all of these competing interests into account, the President is trying to pull off a tough balancing act. But another factor to consider is the possibility that the White House is losing enthusiasm for Arctic drilling behind the scenes, even while the administration approved Shell’s permits and the President continues to justify his government’s actions. The National Journal reported on August 28 that the Interior Department has not started work on the environmental assessment for the Arctic drilling leases that it is expected to auction off in 2016. \n \nSince that process can take two years to complete, there appears to be a growing possibility that the auction could be delayed or cancelled. If that were to happen, any new acreage would not be sold until the next administration. And if the next President is a Democrat, Arctic drilling could be shelved altogether given the candidates’ outspoken opposition to the idea. \n \nBy Nick Cunningham of Oilprice.com \n \nMore Top Reads From Oilprice.com: \n \nJoin the discussion", "source": "OilPrice.com"}