{"published": "2015-09-22T17:43:58Z", "media-type": "Blog", "title": "Open Letter to Dr. Ben Carson on His Disregard for the U.S. Constitution", "id": "14c446d0-bce8-47d3-ab97-583aee3bd859", "content": "Dear Dr. Carson,\n \n I write to express my disappointment at best for your statements on the NBC Sunday broadcast of \"Meet the Press\" on September 20, 2015. Host Chuck Todd raised the controversy surrounding Donald Trump's failure to correct an audience member in a town hall meeting in New Hampshire last week who asserted that President Obama is a Muslim, and then he advocated for the forceful deportation of Muslims from the U.S. Todd then asked you about your take on the controversy, to which you replied that a Muslim should not become president of our country: \"I would not advocate that we put a Muslim in charge of this nation. I absolutely would not agree with that.\"\n \n As a highly educated person, as a candidate for the presidency, and as someone who has co-authored, along with your wife Candy, a book titled A More Perfect Union: What We the People Can Do to Reclaim Our Constitutional Liberties, you should have a more enlightened understanding of our nation's foundational document. \n \n In the book you write generally about the \"basic principles\" of the Constitution and how \"they relate to our everyday lives.\" You go on to state: \"I believe that making a difference starts with understanding our amazing founding document, the U.S. Constitution.\" You assert that both you and Candy wrote the book to \"help defend\" the Constitution \"from those who misinterpret and undermine it.\" \n \n Well, now I'm really confused! How can you inform others and \"help defend\" the Constitution when you do not have even a basic understanding? Your recorded statements indicate that you have misinterpreted and undermined the document. If this were not the case, you would not have made your blatantly Islamophobic assertions on \"Meet the Press,\" especially when Todd asked you, \"So do you believe that Islam is consistent with the Constitution,\" and you replied, \"No, I don't. I do not.\" \n \n Your answer leads me to believe that you practice a version of \"cafeteria Constitutionalism\" picking and choosing which of the passages should refer to which groups of people. Since you are a Christian follower of the Seventh Day Adventist Church, I am assuming that you are not placing Article VI of the US Constitution on your cafeteria tray: \"No religious Test shall ever be required as a Qualification to any Office or public Trust under the United States.\" In addition, you seem to want to delete the First Amendment from the menu and toss it down the garbage disposal: \"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof ...\"\n \n When Donald Trump makes his racist and xenophobic statements about immigrants, and when he throws misogynistic tantrums about women, and when he does not correct questioners about President Obama's religion and birth status, I am not particularly surprised since Trump has centered his entire campaign on issues and discussions based on hate and fear that seem to have resonated with the base of the Republican Party. \n \n You Dr. Carson, in fact, appear to practice the same sort of despicable tactics as Donald Trump (as well as many others with whom you share the debate stage and the clown car as you all drive down the path toward the presidential primaries). I see an underlying philosophical trend among many of you Republican candidates, whether on issues around immigration, issues of equity between genders and sexual identities, and issues of religion. \n \n Once people like yourselves have entered the doorway of opportunity, you attempt to close the door in the face of others. All of the candidates are citizens of the United States, so now you want to close the door of citizenship to others. Since you all have quality healthcare, you want to take it away from the estimated 16 million people who now have health insurance for the first time under the Affordable Care Act. Though you may assume that all presidents since George Washington have followed Christian faiths -- though some have defined themselves instead as \"Deists\" -- you want to close the door of the office to anyone other than those of you with verified Christian credentials. \n \n Dr. Carson, you are running for the presidency by standing on the shoulders of the brave and tireless pioneers who came before you who made it possible for you and for Mr. Obama. I still remember seeing on television the lunch counter sit-ins, the voting rights registration drives, the \"Freedom Schools,\" the marches, and the many other forms of civil disobedience aimed at abolishing discriminatory and abusive \"Jim Crow\" laws, which advanced and strengthened white supremacy by maintaining segregation and withholding the ballot from people of color. \n \n Your statements and those of many of your challengers on the Republican side of the political spectrum are replicating discriminatory policies by advancing and strengthening Christian supremacy by maintaining segregation and withholding opportunities from non-Christians, in particular, Muslims. How \"Constitutional\" Dr. Carson are these actions? \n \n In your book you write: \"And as someone who has performed brain surgery thousands of times, I can assure you that the Constitution isn't brain surgery.\" Well, Dr. Carson, maybe you need to rethink your candidacy, and instead keep your day job, since you understand much better the structures of the brain instead of how to use it to defend and preserve the Constitution of the United States of America. \n-- This feed and its contents are the property of The Huffington Post, and use is subject to our terms. It may be used for personal consumption, but may not be distributed on a website.", "source": "Politics Blog on The Huffington Post"}