{"published": "2015-09-30T01:47:49Z", "media-type": "News", "title": "The Commuter: September 30, 2015", "id": "2b26a1f8-efd7-48ee-bd86-db28d6889119", "content": "This week The Commuter explores Nectar Creek's new meadery, the Burgerville headed for Corvallis, LBCC volleyball, and lots more. \n\n(Or read this week’s edition of The Commuter as a plain .pdf.) \n\nFollow Us \n\nThe Commuter is the weekly student-run newspaper for LBCC. Learn more about the Commuter's staff of contributing writers here. \n\nFollow Us \n\nLatest posts by Commuter Staff (see all) - September 29, 2015 \n\nThe Melee Games: Let the games begin!  - September 18, 2015 \n\nMarijuana On and Around the LBCC Campus  - September 17, 2015 \n\nRelated \n\nTags: AlbanyCorvallisLebanonLinn-Benton Community College (LBCC)OregonSweet Home \n\nWhat do you think? Cancel reply \n\nFollow: \n\nRecent Articles \n\nTrending Now \n\n17 Sep, 2015 \n\n17 Sep, 2015 \n\nSports / UO Ducks \n\n18 Sep, 2015 \n\nNews / Photo Galleries \n\n17 Sep, 2015 \n\n18 Sep, 2015 \n\nCommunity Events \n\nThis events calendar is compiled from Linn-Benton Community College, the Albany Visitor's Association and Visit Corvallis. Find events in Eugene. \n\nHappening Now on The Commuter \n\n29 Sep, 2015 \n\nEditor's Picks / News / Photo Galleries \n\n23 Sep, 2015 \n\n18 Sep, 2015 \n\nEntertainment / Reviews \n\n18 Sep, 2015 \n\n18 Sep, 2015 \n\n16 Sep, 2015 \n\nNews / Photo Galleries \n\n17 Sep, 2015 \n\nOSU Beavers / Sports \n\n18 Sep, 2015 \n\nSports / UO Ducks \n\n18 Sep, 2015 \n\n18 Sep, 2015 \n\nLauren Randolph says: \n\nTaneya14 says: \n\nEsgar says: \n\nD.K. Hummel says: \n\nD.K. Hummel says: \n\nAdvice from Weiss  Albany Back in the Day baseball basketball Beavers Bits and Pieces Breaking Common Knowledge Conservative Conservative Corner Corvallis Dear Conscience Ducks Fashion football From the Sidelines Gamer's Log Healthy World Intangible Earth Last Call Lebanon Liberal Liberally Lenient Linn-Benton Community College (LBCC) Moto Man Office Hours Oregon OSU OSU Beavers Poll Press Release Recipes Redbox Review RJ & James Roadrunners Series of Tubes Sex and the Campus Straight from the Hartsock Sweet Home Talking Sports with Andrew Three's A Crowd Video Games volleyball Women's Basketball", "source": "The Commuter"}