{"published": "2015-09-10T17:00:00Z", "media-type": "Blog", "title": "Self-described 'outsider torch singer' Mary Ocher performs at Analogue tonight", "id": "d61b0b74-ff62-491d-9b48-e0cd79b5d8fc", "content": "click to enlarge\rHadas Hinkis\rMary Ocher is about to evolve into her final form.\rBorn Mariya Ocheretianskaya in Moscow in 1986, Mary Ocher (pronounced \"Oh-chur\") moved to Israel with her family at age four, then to Berlin at 20. In 2011 she caught the attention of the inimitable King Khan at a karaoke bar (he also lives in Berlin), and she recorded what's still her most recent full-length of new material, 2013's Eden, at his Moon Studios. He's not her only famous fan either: Karen O of the Yeah Yeah Yeahs contributed a quote to Ocher's press kit. \"Mary Ocher gives me the chills,\" she says. \"She frightens me with her feral soul. Her sound is of a true outsider artist, immaculately self-possessed. Was this recorded this century? Or out of a basement that's she's been imprisoned all her life?\"\nHer DIY roots and anything-goes aesthetic notwithstanding, Ocher is obviously too well-connected to qualify as an outsider. And she's definitely not locked in a basement—tonight at 10 PM, she plays a free show at Analogue in Logan Square as part of a solo North American tour. \n\"Baby Indiana,\" the only track from Eden with a video, injects its acoustic dance trance with a vaguely Middle Eastern flavor. Ocher's broad vibrato and wildly slewing pitch center make her piercing voice sound giddy and a little loopy, but she uses the occasional dramatic overenunciation of a terminal consonant to ground it in an aura of ritual pronouncement.\nIn March of this year, Ocher released a digital-only two-volume collection of home recordings dating back to 2006. The Fictional Biography of Mary Ocher covers a dizzying amount of ground for music that sounds like it was made in a broom closet: its backing tracks include ghostly noise, sad but jaunty piano, frisky strumming, echoing ersatz funk, chintzy drum machine with vacuum-cleaner synth, and aimlessly gnawing distorted electric guitar. Ocher herself seems to have as many faces as a vaudeville performer: her multifarious singing leaps without warning from unhinged keening to warped drawling or from wobbly muttering to blustery declaiming.\nAmong tonight's openers is Gel Set, aka Laura \"Lulu\" Callier; I reviewed her first full-length, Human Salad, on the occasion of its release party in July. Ocher will be selling copies of a second edition of Eden, both on golden cassette tapes and on vinyl.", "source": "Chicago Reader"}