{"published": "2015-09-07T16:04:46Z", "media-type": "News", "title": "Labour 'shamefully attempting to rewrite history' with garden tax u-turn for pensioners", "id": "aba07188-018c-4bb4-ba42-ece2d8ba2a3a", "content": "LABOUR councillors are facing a backlash after an apparent U-turn to charge pensioners who want to get rid of their garden waste. \n \nAs of April 2016, an annual charge of £75 will be introduced for the collection of garden waste, which will be collected separately every two weeks from the existing brown bin until new bins are delivered. \n \nThe council has confirmed that concessionary rates, which will be means tested, will apply to the tax with a £25 rate for those receiving council tax support. \n \nHowever in January, a council consultation stated that, on top of the £25 rate, those with disabilities will pay a £10 charge while pensioners will face no costs. \n \n The original information is still available for viewing on the Hatch End Association website.  \n \n \n \nDuring a call-in meeting in March, councillors also discussed the circumstances under which a resident would qualify as a pensioner with the scheme – although it was noted that no firm decision on the nature and scale of concessions had been decided by the council at that point. \n \nCllr Susan Hall, leader of the Conservative group, said: “When the decision to introduce the charge went to the special scrutiny meeting in March, we spent 20 minutes discussing at what age and in what circumstances a resident would qualify as a pensioner under the scheme. \n \n“Why would we spend that long talking about it if they weren’t even considering including pensioners, which they now seem to deny. \n \n“At no point did any of the Cabinet members or officers challenge the existence of these concessions.” \n \nThe dispute was also raised at the Overview and Scrutiny Committee meeting last Thursday, in which councillors were given the opportunity to quiz the leader of the council Cllr David Perry and the chief executive Michael Lockwood. \n   Promoted stories   \nCllr Hall added: “For months, the Council was advertising on its website that pensioners would be exempt from the garden tax, and that residents with disabilities would receive a discount. \n \n“Cllr Perry is shamefully attempting to rewrite history. These concessions were in the business case, they were on the Council’s website for months, and until very recently even the Cabinet fully believed they existed. \n \n“The £75 charge Labour are levying on Harrow’s residents is bad enough, but breaking promises to some of our more vulnerable residents is even more disgraceful.” \n \nA consultation on the garden tax was held earlier in the year, and the council says the information on the Hatch End Association’s website is from an associated document on the proposals which no longer appears online. \n \nIt also adds that the consultation added that concessionary rates were only proposed for residents on means tested benefits, meaning not all pensioners would be included. \n \nA Harrow Council spokesperson said: \"Before introducing a charge for the optional garden waste collection service we undertook a borough wide consultation about the proposals and to seek residents views about introducing a discount for residents on means tested benefits. \n \n\"Following the responses we received we will be introducing a concessionary rate of £25 for households in receipt of Council Tax Support, if they wish to receive this optional service. \n \n\"This, we feel, is the fairest way to introduce this optional  service as it will extend the concessionary rate to all residents in the Borough on low incomes. \n   \n Share article  \n   \n\"Residents will receive further information over the coming months about the changes to the waste collection service, including the introduction of a free weekly food collection service and how residents can recycle more as a part of our campaign to be the Best London Borough for Recycling by 2017.\" \n \nThe council claim the tax will make savings of £1.86 million each year based on 20 per cent of households taking up the service - the equivalent of more than 30 social workers or repairing 57,000 potholes in the borough.", "source": "Harrow Times"}