{"published": "2015-09-24T15:22:19Z", "media-type": "News", "title": "Allstate Agent Lori Cicali Sells Relationships, Not Just Insurance", "id": "1725bf27-10d8-425a-bb1e-b1cf1817715e", "content": "BERKELEY HEIGHTS, N.J. - Lori Cicali looks at insurance this way, \"People have to have it, but they don't appreciate it until there's a claim (to file). Then they get it.\" \n \nCicali is the owner of the Allstate Insurance Agency at 302 Springfield Ave., and has been affiliated with Allstate for more than 23 years.  She said she began working with her personal Allstate Insurance agent when her children were five, eight and 10 and she was thinking about joining \"the workforce. My agent said, 'Why don't you come to work for me,'\" and she did. \n \nOver the years, she worked for a few different agencies, learning the business, then Allstate changed its business model and the agents were allowed to sell their businesses. When \"one of the first agencies came up for sale, I was there,\" she said. That was when, 15 years ago this past April, she bought the Berkeley Heights agency. \n\nSign Up for E-News \n \nWhile \"insurance itself is not fun, the people you meet\" make the business rewarding and, often fun, she said. Being an agent is all about \"building relationships with people over the years,\" she said. Sometimes, you first meet a young couple when they are buying insurance on their first apartment.  As the years pass, the agent helps them purchase insurance for their first house, cars and life insurance for themselves and their children, as well as other products. \n \n\"The most meaningful thing is when you give a death claim check to a family member. Many times, they don't know they have insurance,\" she said. \"It's a horrible time, but you know you were part of getting them insurance, so the family has something to fall back on.\" \n \nThings are changing in the insurance industry. \"Allstate is a very solid, stable company,\" which has agents in local communities, she said. \"People are starting to see 1-800 numbers to call for insurance. Call centers work for some people, but not everyone,\" she said. \"I sell relationships, not just insurance.\" \n \nCicali is involved with the community, in June, she received the Agency Hands in the Community Award for her commitment to helping others, including a $1,000 grant from The Allstate Foundation for the YWCA of Eastern Union County. Last year, she received two $1,000 grants from the foundation -- one for the Summit Lions Foundation, the other for the Suburban Chambers Foundation in Summit, where Cicali is a volunteer. \n \nOften people don't know exactly what is covered in their insurance policy, because, \"they seldom read their policy. We're here to educate them,\" she said. If something happens and they don't know if the policy covers it, for example a tree falling and hitting the house, \"they can call us\" and the agent can explain what is covered, she said. \n \nIf something is covered, \"We help them thru the claim process to ensure the claim is settled efficiently,\" she said. In the end, the agent is an advocate for both the insurance company and for the consumer.  \n \nAgents are not just salespeople, they make sure the client has the proper coverage for their personal needs. \"We need to know about the person ... their assets, background, occupation,\" to make sure they have the proper coverage. \"A life insurance policy is not just to cover the mortgage,\" she said. \n \nThe agency is a \"full service insurance agency,\" she said.  It offers all property, casualty, and commercial lines, as well as life insurance, workplace benefits, group life and group disability, long term care and critical illness insurance and financial services,\" she said. \n \nHer advice for the younger generation is to \"start with renter's insurance,\" which she concedes, they don't see the value of, and to \"get life insurance at a young age.\"  The life insurance is especially important because \"there's more likelihood of a person dying or being disabled than a homeowner's claim,\" she said. \n \nOne thing Cicali wants everyone to know about her business is that it isn't a solo operation, \"I can't do this without my associates. They are all licensed individuals,\" and part of the team. \n \nTo reach Cicali, call 908-464-4500, or visit her", "source": "TAPinto.net"}