{"published": "2015-09-01T17:11:58Z", "media-type": "News", "title": "The Latest: Pastor: Slain cameraman made an impact on others", "id": "9eec53ff-9819-484c-951b-859bca15496f", "content": "September 01, 2015 16:32 GMT \r \n\r \nROANOKE, Va. (AP) -- The latest on the funeral for Adam Ward, the WDBJ-TV cameraman who was fatally shot by a former co-worker on live TV Wednesday in Moneta, Virginia (all times local): \n \nNoon: \n \nThe pastor at the church attended by Adam Ward's family told mourners that just as in life, the WDBJ-TV cameraman has left an impact on others through his death. \n \nThe Rev. Rob Lough told more than 500 people at Ward's funeral at First Baptist Church in Roanoke about Ward's compassion and laughter, his passion and wit. \n \nLough related several jokes that the Virginia Tech graduate would tell at the expense of archrival University of Virginia. \n \nLough told several stories, including the time Ward's principal at Salem High School, who uses a wheelchair, challenged him to a race. \n \nAnother story was about when Ward disrupted the press box at Virginia Tech's football stadium by cheering after the Hokies scored a touchdown. \n \nLough says Ward loved people -- \"and the people loved Adam Ward.\" \n \n11:30 a.m. \n \nWith mourners packing the modern, massive First Baptist Church, the funeral of slain WDBJ-TV cameraman Adam Ward is underway in Roanoke. \n \nFive pews at the front left of the church were reserved for the family. WDBJ employees filled eight pews on the church's front right side. \n \nA wreath of Virginia Tech orange and deep red flowers was draped over Ward's closed casket. He graduated from the school in 2011. \n \nBehind the altar, an 80-member choir in white robes and a 10-member string section waited to perform as an organist played hymns before the funeral began. \n \nThree stories up in the balcony, a two-man production crew adjusted sound and light boards. \n \n5:20 a.m. \n \nA funeral is set for a 27-year-old television cameraman who was fatally shot along with a station reporter. \n \nAdam Ward's funeral will be held Tuesday at First Baptist Church in Roanoke, Virginia, a few miles from where he worked. \n \nWard and WDBJ morning reporter Alison Parker were gunned down by a former co-worker on live television during an interview Aug. 26. \n \nOn Monday, Ward was remembered at a reception at his high school for his infectious personality, youthful enthusiasm and rabid love for alma mater Virginia Tech. \n \nIn his open casket at the Salem High School auditorium, Ward's body was dressed in a Hokies cap and white shirt. Well over 1,000 mourners attended the reception.", "source": "13 WLOS"}