{"published": "2015-09-15T16:21:02Z", "media-type": "News", "title": "'I guarantee it' Zimmer launches another startup: Generation Tux", "id": "00306cca-42d8-43e8-b221-feabab026db0", "content": "George Zimmer, the grizzled founder of Men's Wearhouse, has launched a new business with an old idea: Renting tuxedos. \n \nThe startup is called Generation Tux. Zimmer is already familiar with the business of renting tuxedos, since that's an integral part of Men's Wearhouse, which he created more than 40 years ago and was forced out of in 2013. \n\nGeneration Tux charges $150 or less. Unlike more traditional tux rentals, where customers visit for fittings, customers of Generation Tux can \"build\" their tux online and get free delivery. \n\nZimmer launched another company last year called zTailors, which serves as an online marketplace for tailors. \n\n\"I'm doing my best to create a second act,\" the gravelly-voiced Zimmer told CNNMoney this summer, when zTailors went nationwide. But in a recent interview with The New York Times, Zimmer said he was having trouble getting the business off the ground. \n\nZimmer hopes that Generation Tux will give zTailors a lift, and vice versa. \n\n\"Generation Tux is different from any other tuxedo and suit rental platform today as the only service to provide access to the zTailors network of expert tailors,\" he said in a press release. \n\nZimmer became famous for his Men's Wearhouse commercials, with the catch-phrase, \"You'll like the way you look, I guarantee it.\" He no longer uses that slogan for his new businesses. \n\nMen's Wearhouse experienced a leadership blow-out two years ago when the board of directors fired Zimmer. They opposed his plan to sell the company to an investment group because it would have forced the company \"to take on a huge amount of debt.\" The board also claimed that Zimmer refused to work with executives \"unless they acquiesced to his demands.\" \n\nZimmer wrote an open letter complaining about his \"growing concerns with board decisions,\" but his 4% stake in the business wasn't big enough for him to get his way.", "source": "WYFF4.com"}