{"published": "2015-09-17T04:00:00Z", "media-type": "Blog", "title": "Diggers from down under: 11 new wasp species discovered in Australia", "id": "86722c5a-e2e3-4ca7-984a-54ddde21ea76", "content": "IMAGE: This is a female of Sphex flammeus, a new species named after its strikingly red body. view more Credit: Thorleif Dörfel, Museum für Naturkunde After being mostly neglected for more than a hundred years, a group of digger wasps from Australia has been given a major overhaul in terms of species descriptions and identification methods. This approach has led to an almost 50% rise in the number of recognized species of these wasps on the continent. The study was published in the open access journal ZooKeys.\rThey call them with names like \"Great Golden Digger\" or \"Great Black Wasp\" in the US and there is a good reason behind it. However, some of these digger wasp species do not impress solely with their looks, but also with their wide range of distribution. Members of the wasp genus Sphex can be found in almost every area of the world. Two researchers from the Museum für Naturkunde in Berlin, Thorleif Dörfel and Dr. Michael Ohl, have now reexamined the species diversity of Sphex in Australia.\rMore than a century has passed since the last revision of this group in the Down Under. Using pinned, dried individuals from museum collections all over the world, Dörfel and Ohl inspected over 900 specimens and recorded the morphological characters that they deemed most useful for species differentiation.\rA very different lifestyle sets apart some species in the genus Sphex from the common idea that most people evoke on hearing the term \"wasp\". Not being eusocial, each female constructs a separate, subterranean nest for their offspring, which is then filled with grasshoppers (or other insects, depending on the wasp species) that have been paralyzed by a sting as a food supply for the larvae. These wasps avoid contact with humans and generally do not show aggressive behavior toward us.\rWith 23 species known from Australia before this study, now the number has risen to 34. Most of these newly discovered species come from large quantities of material which had not been identified up to species level before. Dörfel and Ohl's work also provides an up-to-date identification key, both in a regular and in an interactive form, that covers all known Australian species of the genus. Specifically designed to be easily usable and containing many helpful images, it can be utilized by anyone with even minimal prior training.\r\"Many insect groups are in urgent need of a revision or reclassification\", explained Thorleif Dörfel. \"Our understanding of ecosystems depends on the ability to identify the species that are a part of them. The focus of this study was merely a single continent, but we are currently preparing a follow-up project in which we plan to examine representatives of this wasp genus from every major geographic area. Hopefully, this is going to help everybody who works on these animals, whether now or in another one hundred years.\"\r###\rOriginal source:\rDörfel TH, Ohl M (2015) A revision of the Australian digger wasps in the genus Sphex (Hymenoptera, Sphecidae). ZooKeys 521: 1-104. doi: 10.3897/zookeys.521.5995\rAdditional contact:\rDr. Michael Ohl Email: michael.ohl@mfn-berlin.de\rTelephone: ++49-30-2093-8507", "source": "EurekAlert! - Breaking News"}