{"published": "2015-09-03T17:14:26Z", "media-type": "News", "title": "SBA and NAGGL Launch \"Business Smart Toolkit\" To Elevate Entrepreneurship In Underserved Communities", "id": "b5ba0689-a903-4d51-8684-bf6fee41fb5a", "content": "SOURCE U.S. Small Business Administration\n\nWASHINGTON \n\n\"We can't wait for aspiring entrepreneurs to come to us; we need to reach out to them where they are,\" said SBA Administrator Maria Contreras-Sweet \n\n\"Small business ownership takes courage and determination. We must promote and inspire entrepreneurship and the Business Smart Toolkit is an innovative way to bring the highest-level of business insight to American entrepreneurs across the country,\" said Tony Wilkinson \n\nThe toolkit is designed to \"train-the-trainer\", such as trusted community leaders, who have the ability and the desire to educate new and potential business owners through a series of workshops in collaboration with the SBA's field offices and NAGGL members. The toolkit is intended to educate and enable small business owners – from those looking to open their first small business, to established business owners hoping to expand and grow. It contains a variety of small business and financial literacy topics that include business start-up basics, the essentials of becoming credit-ready, and resources for small business education and support. ABOUT NAGGL\n\nThe National Association of Government Guaranteed Lenders (NAGGL) serves the needs and represents the interests of the small business lending community that utilizes SBA's guaranteed government loan programs, specifically 7(a) lending initiatives. NAGGL has grown the SBA lending industry and America's small business sector as a whole, helping the 7(a) program not just survive, but flourish-burgeoning from $1 billion \n\nABOUT THE U.S. SMALL BUSINESS ADMINISTRATION (SBA)\n\nThe U.S. Small Business Administration (SBA) was created in 1953 as an independent agency of the federal government to aid, counsel, assist and protect the interests of small business concerns, to preserve free competitive enterprise and to maintain and strengthen the overall economy of our nation. We recognize that small business is critical to our economic recovery and strength, to building America's future, and to helping the United States \n\nSBA's participation in this cosponsorship does not constitute an express or implied endorsement of the views, opinions, products or services of any cosponsor or other person or entity. All SBA programs, services and cosponsored activities are extended to the public on a nondiscriminatory basis. Reasonable arrangements for persons with disabilities will be made if requested at least two weeks in advance. Cosponsorship Authorization #15-6010-44.\n\nRelease Number: 15-70\n\nCONTACTS: Sabrina Siddiqui \n\nLogo - http://photos.prnewswire.com/prnh/20110909/DC65875LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/sba-and-naggl-launch-business-smart-toolkit-to-elevate-entrepreneurship-in-underserved-communities-300137753.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "ABC 3340"}