{"published": "2015-09-18T18:24:00Z", "media-type": "News", "title": "Everest Works Best When It Focuses On The Mountain, Not The Feeble Men On It", "id": "183de50d-7772-44a2-9801-0739ef896f3e", "content": "1. If nothing else, you should see Everest on as big a screen as possible. I was fortunate enough to see it in 3-D on a digital IMAX screen—not the same as the IMAX format, mind you, there’s a difference , but still, you know, big—and I’m glad I did. The most you can hope for from a movie about Mount Everest is that it gives you a simulacrum of the experience of being on Mount Everest, and I can say that this movie absolute does. My theater actually began to feel cold  after a while. There are some story and narrative issues here, and it goes on too long and ends too many times, but it has an awe and respect for the mountain itself that is undeniable. The fundamental lesson of Mt. Everest is that it is bigger than humanity, bigger than life. This movie conveys that all too well. \n \n2. Everest tells the tale of the famous 1996 expedition that led (spoiler?) to the deaths of 12 people during a sudden blizzard. That disaster was the basis of Jon Krakauer’s 1997 book Into Thin Air , but, because some of the families and people involved weren’t crazy about every detail in Krakauer’s book, many of them wrote books themselves, and those are the basis of this film. (This might explain why Krakauer, played well here by Michael Kelly, occasionally comes off as weak and even cowardly.) We meet two groups of climbers, led by Rob (Jason Clarke) and Scott (Jake Gyllenhaal), who combine forces to guide their amateur clients to the peak of Everest during the annual two-week window. It all goes well at first, or as well as doing something as insane as climbing Mount Everest can go (Rob makes sure to remind us that “your body is dying at that height”), but then they stay a little too long up there, and the storm comes, and then it all falls apart. \n   \n   \n3. The first hour of Everest works splendidly. The film is impressively interested in the nuts and bolts of what goes into an Everest climb, and it’s fun to follow along with the trip, to see the risks involved and how guides like Rob and Scott actually constructed such an adventure. You understand the base camps, and the stopping points, and the landmarks that the climbers have to hit as they progress up the mountain; I certainly couldn’t make such a climb—I can barely make it up an escalator—but the movie helps show the amount of work and planning that goes into such a trip. It also does an excellent job of explaining why anyone would do this to themselves. We see the wonder and passion through the eyes of Buck (Josh Brolin), a brash Texan who’s secretly only able to stave off his depression on the mountain; Yasuko (Naoko Mori), a middle-aged Japanese woman who has scaled six of the planet’s seven highest summits and just has this one to go; and, most movingly, Doug (John Hawkes), a modest mailman who wants to show schoolkids at home just how much anyone can accomplish, if only you never quit. These aren’t fully fleshed-out characters, necessarily, but they’re enough to do the trick. You see why they want to do this, and you want them to succeed. \n \n4. Most of the rest of the human-scale business doesn’t work, though. It’s possible the filmmakers felt a little too respectful of the families; many of their backstories feel obligatory and rote, perhaps too unspectacular for the grandeur of the mountain. The tale of Everest is not about a man trying to be a better husband and father; it’s the awesome power of nature to remind us of our total insignificance, of our fragility. It can be hard to look at the mountain, that mountain, and worry much about how much that one random guy misses his kids. Rob, our hero, has a pregnant wife he has left behind, and while that’s sad and “raises the stakes” dramatically—and while I appreciate the real-life people involved—it still doesn’t make the scenes of Keira Knightley lying on her couch crying and waiting to hear word on her husband any more compelling. I’m sure she is very worried, but I’d like to maybe get back to the mountain, please? Mt. Everest makes all human life look small and pointless. That’s why so many want to conquer it. But it also makes their stories look perfunctory in comparison. Everest cares not of your daddy issues. \n \n5. With this many characters to address and this many fates to be resolved, the movie loses considerable moment in its back half, right when it’s supposed to be finding its finishing kick. Again, this is another issue of hewing too close to the real-life story: The movie feels obliged to make sure everyone is accounted for, which is admirable but begins to feel a bit inert after a while. (I was expected to feel sad a couple of times for characters I didn’t exactly remember meeting.) The two leads, Clarke and Gyllenhaal, are both strong, charismatic actors, and they’re both able to carve out striking impressions even in the wake of the mountain. But I didn’t learn anything about either character, and the movie probably shouldn’t have tried so hard for me to. This is Man vs. Everest, and even though we might manage to make it up to the top every once in a while, this is not a battle we are ever going to survive. Everest falls short when it’s caring about the puny mettles of men, but it understands that mountain. It will be outlast everything. It always wins. \n\n \nGrade: B \n\n \nGrierson & Leitch is a regular column about the movies. Follow us on Twitter, @griersonleitch . \n\n \n The Concourse is Deadspin’s home for culture/food/whatever coverage. Follow us on Twitter, too.", "source": "Deadspin"}