{"published": "2015-09-30T03:00:20Z", "media-type": "News", "title": "Unisys Corp., Appoints Frederick Henry to Lead its Business with DISA", "id": "cfcb580e-b5ae-4be4-9f2e-34cad5395156", "content": "Unisys Corporation (NYSE: UIS) today announced it has appointed Frederick A. Henry to lead its business with the Defense Information Systems Agency (DISA), a significant part of the company's Defense Department client base. \n\nHenry has responsibility for leading the company's work in delivering to DISA technology solutions in areas such as application modernization, cybersecurity, and data center and infrastructure services. He will lead the development of Unisys' growth strategy for driving innovation, new capabilities, and products and solutions that align to the DISA's mission and objectives. \n\nHenry, a retired Army Brigadier General, will report to Jennifer Napper, group vice president of the Department of Defense and Intelligence Group within Unisys Federal. \n\n\"We are extremely pleased to have Fred leading this important part of our business,\" said Napper . \"His experience and expertise as a technology leader in government and industry will help us bring innovative IT solutions to our clients at DISA and the Defense organizations they serve.\" \n\nHenry's 30-year military career includes stints as DISA's chief of staff from 2012 to 2014 and as deputy commander of the Army Network Enterprise Technology Command from 2010 to 2012. In these and other leadership positions at the Department of Defense, he established a reputation for leading technical teams that solved complex problems such as helping DOD address ongoing cyber threats. \n\nHenry is a member of the Information Systems Audit and Control Association (ISACA), Armed Forces Communications and Electronics Association (AFCEA) and serves as vice president for cyber outreach initiatives for the George Washington Chapter (National Capital Region) of the Association of the United States Army. In addition, he is an advocate of science, technology, engineering and math (STEM) for minority and disadvantaged students and serves on the advisory board of the DJ Dream Fund Foundation, a non-profit organization dedicated to helping kids lead healthy lifestyles through athletics, wellness and arts programs. \n\n\"Unisys has a longstanding relationship with DISA and the experience, solutions and talent to help DISA cost-effectively deliver IT solutions and services to organizations throughout the Department of Defense,\" Henry said. \"As someone who has spent much of his career leading technology initiatives at DISA and the Army, I am looking forward to leveraging Unisys' global solutions capabilities, technology edge and best practices to address DISA's key mission challenges.\" \n\nAbout Unisys  \n\nUnisys is a global information technology company that works with many of the world's largest companies and government organizations to solve their most pressing IT and business challenges. Unisys specializes in providing integrated, leading-edge solutions to clients in the government, financial services and commercial markets. With more than 20,000 employees serving clients around the world, Unisys offerings include cloud and infrastructure services, application services, security solutions, and high-end server technology. For more information, visit www.unisys.com .", "source": "Citybizlist"}