{"published": "2015-09-01T17:00:16Z", "media-type": "News", "title": "Denali is a victory, but US communities are still rebranded to be 'white friendly'", "id": "a0f271c8-4feb-43ce-b1db-06ee329c46f6", "content": "Minority neighborhoods across the country are being repackaged for investment geared towards whiter residents and investors On Monday, President Barack Obama said that the move to officially reinstate the name Denali, which means “the high one” in Athabascan, was “a step to reflect the heritage of Alaska Natives”.\n\nDenali may no longer be called after a white American president, but many urban spaces in the US continue to have their heritage stripped from them, and given white-friendly names.\n\nEven as Alaskan lawmakers and Native rights groups celebrated, others across the country point out that the “Christopher Columbus syndrome” lives on. The term was popularized last year by Spike Lee as he spoke up against gentrification; it refers to white culture’s propensity for claiming discovery and identity rights on spaces already named by other groups.\n\nMinority neighborhoods across the country are regularly subjected to this exercise as they find themselves rebranded and stripped from any association with non-white culture.\n\nFacebook Twitter Pinterest In the process of being gentrified: Gowanus in Brooklyn. Photograph: Alamy In New York, South Bronx is now routinely referred to as SoBro, which is arguably trendier-sounding. Part of West Harlem, the area directly to the north of Columbia University and currently being redeveloped by the higher education monster, is now Manhattanville in the minds of many. To cash in on Harlem and attract new residents and investors in the early 2000s, its west 110th to 125th street section was also renamed SoHa (South Harlem).\n\nIn Detroit, an area once known as the Cass Corridor has been rebranded Midtown. \n\nIn Washington, DC, a section of the north-east part of the city has been rebranded NoMa (north of Massachusetts Avenue). \n\nIn the early 2000s in Los Angeles, south-central LA was stripped of its full name and rebranded South LA after a unanimous vote by the city’s council on the matter.\n\nWhat do all of these neighborhoods have in common? They were all majority non-white when rebranded and repackaged for investment geared towards whiter residents and investors. The connotations many of them carried pre-renaming were of high-crime, dangerous areas that white people may have feared putting their toes in.\n\nBut for Dorothy Pirtle, a 34-year-old community and economic development consultant born and raised in South-Central LA, rebranding her neighborhood felt like more of an exercise in erasure than anything else.\n\n“For most folks who live and belong in these areas, it doesn’t make sense,” she says. Changing the name of her neighborhood was “disruptive” to her fellow community members, she says, but not in a way that seemed to benefit them.\n\n“When they renamed it, there wasn’t any increase in the quality of our lives,” she says. Underlying issues, including low employment and low high school graduation rates, were not addressed. \n\nToday, citizens who want to go to the library and research the history of their community will be harder pushed to find information and knowledge, she says, because of the intentional erasure of the name. The history of south-central LA is, of course, of particular significance. It is where, in 1992, days of civil and racial unrest unfolded following the shocking and brutal attack by police officers on black motorist Rodney King. Despite being videotaped and revealing what seemed to many like excessive use of force by the police, the officers in the incident were acquitted. \n\nFacebook Twitter Pinterest South-central: now South LA. Photograph: David McNew/ Real estate-led rebranding \n\nWhat invariably changes after a rebranding exercise isn’t a drop in inequality levels, but a rise in property prices.\n\nIn New York, high-end real estate specialist Spencer Means (whose past clients have actually included Spike Lee among others of the city’s black elite), says there is no doubt that the branding of a neighborhood makes property value go up. Rebranding is about “pushing borders, pushing the envelope and trying to attach value to place”.\n\nNeighborhoods such as Bushwick are laden with connotations – including those about racial makeup – that might justify it being renamed East Williamsburg from a real estate point of view, he explained. \n\nBushwick was the site of some controversy last year when a luxury condo called Colony 1209 asked bohemians to become “settlers” in “Brooklyn’s vibrant new frontier”. (Colony 1209 has since its name to a less offensive 1209 Dekalb).\n\nDavarian Baldwin, a professor in American Studies at Trinity College, says there are two starkly different ways in which American city neighborhoods get rebranded. The first is grassroots-led, which happens in a minority of cases. The second is real estate-led. \n\nRebranding driven by real estate is a worrying concept, since real estate has been a driver and sustainer of racial inequality along economic lines – whether through overt, federally sanctioned redlining practices starting in the 1930s, or via disadvantageous bank lending practices up until the present day.\n\nAs such, erasing one name and inventing another signals a continued disregard for non-white communities, Baldwin says.\n\nIn an article based on research in Philadelphia published earlier this year, Harvard doctoral candidate Jackelyn Hwang found that black, long term residents in a rapidly changing community tended to identify with large geographical boundaries that were inclusive of a broad sense of longstanding black identity – in this case, “south Philly”.\n\nWhite, often newer residents tended to define their neighborhoods in a much more hyper-localized way, with matching new names (including “Graduate Hospital”, “G-Ho” and “So-So”) that explicitly excluded areas deemed blacker, sometimes also defined as having higher levels of crime by these white resident (erroneously, as the author points out) as having higher levels of crime. \n\nAs white residents used new, unconventional, smaller and more exclusionary boundaries and names to define their neighborhoods, their definitions took hold.\n\nFacebook Twitter Pinterest A vacant, boarded up house in the once thriving Brush Park neighbourhood in downtown Detroit. Photograph: Rebecca Cook/Corbis In Detroit, which is often treated as a blank slate ready for takeover, Antonio Cosme, a 27-year-old farmer, artist and community organizer, has watched as the streets of his neighbourhood have been rebranded into a community named “Springwells Village”, a name neither he, nor the residents of the streets it encompasses, feel has any accurate historical meaning.\n\n“Most people identify as being from south-west Detroit more broadly,” Cosme says. Historically, a Springwells Village existed, but not technically in the area it has been repositioned. \n\nCosme wonders if the rebranding initiative, driven by a nonprofit community engagement group vying for foundation dollars, is a tactic to help the area get funded and survive. “If a neighborhood has an identity, it’s more fundable, I suppose.”\n\nUnder the oft-quoted Detroit Future City urban development plan used by Detroit’s mayor’s office, some neighborhoods are set to survive, and others are not. “They are choosing winners and they are choosing losers,” Cosme says. By branding itself in an identifiable way, “Springwells Village” is vouching for survival, but at what price?", "source": "Guardian.co.uk"}