{"published": "2015-09-22T00:38:00Z", "media-type": "News", "title": "Criminal probe: Volkswagen slams into huge false emission scam", "id": "d86e447d-da83-4cc3-80b1-6dc3b561ee8f", "content": "The fuel economy and smog ratings are shown on the sticker price of a 2015 Passat limited edition vehicle at a Volkswagen dealership in Escondido, California, September 21, 2015. — Reuters pic FRANKFURT, Sept 22 — German auto giant Volkswagen’s shares plummeted nearly 20 per cent yesterday as investigations spread into revelations that hundreds of thousands of its diesel cars have software that secretly thwarts US pollution tests. \n \nVolkswagen, the world’s largest automaker by sales in the first half of this year, said it had halted all diesel vehicle sales in the United States during a probe into the scandal, which could lead to fines of more than US$18 billion (RM76.786 billion). \n \nIn addition to the environmental fines, US authorities have reportedly launched a criminal investigation into the company. \n \nAccording to the US authorities, VW admitted that it had equipped about 482,000 cars in the US with sophisticated software that covertly turns off pollution controls when the car is being driven and turns them on only when it detects that the car is undergoing an emissions test. \n \nWith the so-called “defeat device” deactivated, the car can spew pollutant gases into the air, including nitrogen oxide in amounts as much as 40 per cent higher than emissions standards, said the US Environmental Protection Agency, which announced the allegations Friday along with California authorities. \n \n“Using a defeat device in cars to evade clean air standards is illegal, and a threat to public health,” said Cynthia Giles, enforcement officer at the EPA. \n \nIn Germany, currently hosting the Frankfurt motor show vaunting the industry’s strengths and environmental credentials, the government launched an investigation into whether Volkswagen or other carmakers are doing anything similar in Germany or Europe. \n \nTransport Minister Alexander Dobrindt told the Bild daily that he had asked Germany’s Federal Motor Transport Authority “to immediately have specific and extensive tests conducted on all Volkswagen diesel models by independent experts.” \n \nSouth Korea’s Yonhap news agency said that authorities there, too, would conduct emissions tests on three Volkswagen car models in mid-October to check for similar deception. \n \nBeyond the potential fines and lawsuits, and the billions of euros that evaporated in Volkswagen’s stock market value as its shares plunged 18.19 per cent to €133 (RM635), wiping out more than US$15 billion, the company faces a potentially crippling blow to its reputation. \n \n Criminal probe launched \n \nThe vehicles affected are four-cylinder VW and Audi diesel cars in the US built since 2008. \n \nIn addition to the EPA’s probe, the US Department of Justice has launched a criminal investigation into the German automaker’s alleged violation of US air pollution laws, according to media reports yesterday. \n \nFirst reported by Bloomberg, the criminal probe piles more pressure on VW. \n \nContacted by AFP, neither the Justice Department nor Volkswagen chose to comment on the probe. \n \nThe EPA said that the agency had not issued a formal recall for the VW vehicles but expects to “compel” the company to issue a recall to reduce the emissions impacts of those vehicles. \n \n“Depending on the complexity of the repair and the lead time needed to obtain the necessary components, it could take up to one year to identify corrective actions, develop a recall plan, and issue recall notices,” the US agency said. \n \nThe EPA also said yesterday that it will screen for defeat devices in other manufacturers’ diesel vehicles currently on the road, though declined to identify the automakers whose vehicles will be tested. \n \n Deeply sorry \n \nVW chief executive Martin Winterkorn issued an apology Sunday, vowing that the group would cooperate with authorities and ordering an external investigation of its own into the matter. \n \n“The board of management takes these findings very seriously. I personally am deeply sorry that we have broken the trust of our customers and the public. We will cooperate fully with the responsible agencies, with transparency and urgency, to clearly, openly and completely establish all of the facts of this case,” Winterkorn said. \n \n“We at Volkswagen will do everything that must be done in order to re-establish the trust that so many people have placed in us, and we will do everything necessary in order to reverse the damage this has caused. This matter has first priority for me, personally, and for our entire board of management,” Winterkorn said. \n \nChristian Stadler of Warwick Business School said there was “no question that this is a big problem for Volkswagen and could lead to CEO Winterkorn losing his job after all.” \n \nWinterkorn, 68, has been chief executive since 2007, but clashed with other leadership earlier this year. \n \n Image damaged \n \nStefan Bratzel, director at the Center for Automotive Management, a research group, said the damage to VW’s image would be as great as the financial fines. \n \nAnother leading German auto expert, Ferdinand Dudenhoeffer, agreed.  \n \n“It will be tough for VW to regain its credibility in the United States after this incident,” he said. \n \nIn the US, Edmunds.com analyst Jessica Caldwell said “it is in Volkswagen’s best interest to publicly address steps to fix this mess as soon as possible before it loses its customer base for good.” \n \nGerman Economy Minister Sigmar Gabriel expressed confidence that VW would clear up the matter quickly and thoroughly.  \n \nAnd he insisted the reputation of “Made in Germany” technology would not be tarnished. — AFP", "source": "Malay Mail"}