{"published": "2015-09-03T11:23:58Z", "media-type": "News", "title": "Cloud Storage Market 2015: Primary Storage Solution, Backup Storage Solution, Cloud Storage Gateway Solution, and Data Movement and Access Solution - Global Forecast and Analysis to 2020", "id": "70e07453-7769-4ad0-9226-cf54bf39a32d", "content": "Dublin, Sept.  03, 2015  (GLOBE NEWSWIRE) -- Research and Markets ( http://www.researchandmarkets.com/research/n25mgr/cloud_storage ) has announced the addition of the \"Cloud Storage Market by Solutions (Primary Storage Solution, Backup Storage Solution, Cloud Storage Gateway Solution, and Data Movement and Access Solution) - Global Forecast and Analysis to 2020\" report to their offering. \n\nThe global cloud storage market is expected to grow from USD 18.87 billion in 2015 to USD 65.41 billion by 2020, at a Compound Annual Growth Rate (CAGR) of 28.2%. \n\nThe storage solutions are evolving as several companies have entered into the market and are offering advanced solutions to store the data at minimum costs. The first digital storage device was introduced in 1890 when Herman Hollerith, founder of Tabulating Machine Company, used punch cards to read and record data. Thus, the storage market has evolved and in the present scenario, the user can save up to 1 GB of data free of cost on cloud storage and access it from any remote location. \n\nThe cloud storage technology is being widely adopted by sectors such as BFSI, healthcare, and media and entertainment verticals to store their data such as documents, movies, photos, and music at one convenient place. \n\nFactors such as rising need for big data storage and increasing adoption of cloud storage gateways are driving the demand for cloud storage solutions globally. The cloud storage market has been segmented on the basis of types into solutions and services; on the basis of solutions into primary storage solution, backup storage solution, cloud storage gateway solution, and data movement and access solution; on the basis of services into consulting services, system and networking integration, and support training and education; on the basis of deployment into public, private, and hybrid; on the basis of organizational size into small and medium businesses (SMBs) and large enterprises; on the basis of verticals into BFSI, manufacturing, retail and consumer goods, telecommunication and IT, media and entertainment, government, healthcare and life sciences, energy and utilities, research and education,  and others; and on the basis of regions into North America, Europe, Asia-Pacific (APAC), Latin America, and Middle East and Africa (MEA). \n\nCloud storage software is offered by pioneer players such as IBM, Microsoft, Google, Amazon Web Services, VMware, Box, Fujitsu, RackSpace, AT&T, and HP. The cloud storage market research report outlines the key trends, market size, and forecast for various emerging subsegments of the market. The report also emphasizes on the key adoption trends, future growth potential submarkets, key drivers, challenges, restraints, and opportunities in the market ecosystem. It also provides insights into the current and future revenues of the market from 2015 to 2020, and an understanding of the market drivers, current and upcoming players, and competitive landscape. \n\nKey Topics Covered:  \n\n1 Introduction \n\n2 Research Methodology \n\n3 Executive Summary \n\n4 Premium Insights \n\n5 Market Overview \n\n6 Industry Trends \n\n7 Cloud Storage Market Analysis, By Type \n\n8 Cloud Storage Market Analysis, By Solution \n\n9 Cloud Storage Market Analysis, By Service \n\n10 Cloud Storage Market Analysis, By Deployment Mode \n\n11 Cloud Storage Market Analysis, By Organization Size \n\n12 Cloud Storage Market Analysis, By Vertical \n\n13 Geographic Analysis \n\n14 Competitive Landscape \n\n15 Company Profiles \n\n- Amazon Web Services, Inc. \n- AT&T, Inc. \n- Box, Inc. \n- Fujitsu Ltd. \n- Google, Inc. \n \n(C)", "source": "Virtual Strategy Magazine"}