{"published": "2015-09-03T16:08:00Z", "media-type": "News", "title": "LSBF Great Minds: Strong Short-term Planning is Key to FMCG Success, Says Unilever's Kevin Havelock", "id": "b64b66f9-1ab9-4e31-99da-fd8b2b159a46", "content": "SOURCE London School of Business \n\nLONDON \n\nIn a recent video interview with London School of Business \n\nParticipating in LSBF's Great Minds series, Mr Havelock - who joined Unilever back in 1985 - spoke of the changes the sector has gone through, and must continue to go through, in order to keep up with today's fast developing environment.\n\n\"The first big challenge is the volatile world that we live in,\" he told Nadim Choudhury \n\nGiving specific examples, Mr Havelock mentioned Latin America \n\nUnilever was formed in 1930 when British soap maker Lever Brothers and Dutch margarine producer Margarine Unie came together to form a merger. Expanding to cover over 400 brands across 190 different countries, Unilever's 2014 turnover amounted to a massive €48.4 billion.\n\n\"One of the things about being in fast moving consumer goods (FMCG) is that consumers want new things every year,\" Mr Havelock explained. \"We introduce over 1000 new products every year and spend over a billion euros a year on research development to make sure we're bringing products that are new, exciting and on trend - or even slightly ahead of the trends - so that we can bring products that they want.\"\n\nNot only does Unilever have to work hard to keep the products they sell up-to-date and on trend, but their marketing and advertising techniques, as well. Mr Havelock said: \"The world has changed dramatically in the last five years. In the past, [we would have advertised using] TV, print, and posters. Today it's all about mobile technology; making sure we provide content that gives people information and inspiration is very important.\"\n\nThroughout his three decades in the company, Mr Havelock held senior leadership positions including Chairman for Unilever UK, Unilever France and Unilever Arabia, and Chairman for Unilever's Beverages business across Europe \n\nAsked about any particular personal highlights, Mr Havelock identified taking Unilever's ice cream business global as a key achievement. \"We've built some really beautiful brands such as Magnum and Cornetto so I've taken quite a lot of pride in that. If you think about it, ice cream is about giving people a smile every day and that excites me and my team.\"\n\nFor those interested in entering the FMCG sector, Mr Havelock believes Unilever is a great place to start. They take on 800 graduates every year, who receive on-the-ground training over a period of two or three years.\n\n\"If you're the sort of person that likes a lot of change every day, that's quite flexible, but also able to work with the analytics at the same time, FMCG is a very attractive area to come into. I think it's as exciting as it's ever been. If you're purpose driven and thinking about the planet, you'll probably want to have a good look at Unilever. It's work hard, play hard within our organisation; we expect to work hard together but also have some fun and enjoy what we're doing.\"\n\nLSBF Great Minds Series \n\nAs well as offering programmes dedicated to fostering leadership skills, LSBF also endeavours to provide students with insight and inspiration through a number of innovative resources. One of these initiatives is the LSBF Great Minds Series: a collection of video interviews with leading business and political leaders promoting debate on education, employability, entrepreneurship and the economy.\n\nThe video series started in 2011 with a conversation with former British Prime Minister Tony Blair, followed by an interview with former Education Secretary Lord Kenneth Baker. In 2012, entrepreneur Sir Richard Branson, founder and chairman of the Virgin Group said that universities worldwide should become hubs to boost entrepreneurship and inspire self-starters to develop their own businesses. In 2014, LSBF spoke to Will Butler-Adams from Brompton Bicycle, Guy Hayward-Cole from Nomura Bank International, with former British Prime Minister Sir John Major, entrepreneur and investor Deborah Meaden, Google UK sales director Kevin Mathers and BBC Worldwide CEO Tim Davie.\n\nKicking off 2015, LSBF hosted interviews with Andrew Miller, CEO of Guardian Media Group; Jill McDonald, CEO of McDonald's UK; Kevin Costello, CEO of Haymarket Group; Amy McPherson, CEO of Marriott Hotels Europe; veteran BAFTA-winning broadcaster Jon Snow \n\nAbout London School of Business and Finance (LSBF) London School of Business Email: news@lsbf.org.uk; Phone: +44-(0)20-3535-1294\n\n©2015 PR Newswire. All Rights Reserved.", "source": "ABC 3340"}