{"published": "2015-09-15T12:25:14Z", "media-type": "News", "title": "Pilot spots large object off Reunion", "id": "f91f4579-8325-4682-a00a-fa011a04e52f", "content": "Air France pilot reported seeing object floating in the Indian \n\nUpdated 09/15 2015 07:52AM \n\nCopyright 2015 Cable News Network/Turner Broadcasting System, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. \n\n(CNN) \n\nNearly two months after debris from the vanished Malaysia Airlines Flight 370 washed up on Reunion Island, a large object floating off the island has piqued the interest of French officials there. \n\nAn Air France pilot reported seeing the object floating in the Indian Ocean on Tuesday morning about 70 kilometers (43 miles) northwest of the French island, said Siva Vadivelou, assistant director of the French Civil Aviation Authority on Reunion. \n\nThe Air France plane was at a high altitude so \"it must be a voluminous object for the pilot to see it,\" Vadivelou said. \n\nThe aviation authority reported the sighting to marine services on Reunion, Vadivelou said. It wasn't immediately clear how long it would take to determine what the object is. \n\nFrench investigators said this month that debris that washed up on the island in July -- an airplane flaperon -- was from MH370, a Boeing 777 that disappeared with 239 people aboard in March 2014 while on a flight scheduled from Malaysia to China. \n\nInvestigators believe the plane went down in the southeastern Indian Ocean, and searchers have been looking for the bulk of the plane at the bottom of the ocean off western Australia. Officials say Reunion is within the range of where debris from the missing plane could have drifted. \n\nThe mystery of MH370 \n\nIn the early hours of March 8, 2014, Malaysia Airlines Flight 370 took off from Malaysia's Kuala Lumpur International Airport en route to Beijing. \n\nAt 1:19 a.m., as the Boeing 777-200ER was flying over the South China Sea, Malaysian air traffic controllers radioed the crew to contact controllers in Ho Chi Minh City for the onward flight through Vietnamese airspace. \n\nThe crew's acknowledgment of the request was the last thing heard from MH370: \"Good night Malaysian three-seven-zero.\" \n\nShortly afterward, air traffic controllers in Malaysia lost contact with the plane somewhere over the sea between Malaysia and Vietnam. \n\nThe aircraft's transponder, which identifies the plane and relays details such as altitude and speed to controllers, stopped transmitting. MH370 seemingly disappeared without a trace. \n\nMalaysian authorities revealed later that military radar had tracked the plane as it turned back to the west and flew across the Malaysian Peninsula, up the Strait of Malacca, before flying out of radar range at 2:14 a.m. and vanishing once again. \n\nInvestigators later determined, through an analysis of \"handshakes\" between the plane and an Inmarsat telecommunications satellite, that MH370 had eventually turned and flew south for hours. \n\nInvestigators believe the plane went down in the Indian Ocean, and searchers have focused their attention on a swath about 2,000 kilometers (1,243 miles) off Australia's west coast.", "source": "MyPanhandle.com"}