{"published": "2015-09-01T13:39:12Z", "media-type": "News", "title": "BSRIA concerned with new apprenticeship levy", "id": "236a168d-53bd-43ff-975a-a9683f9d6794", "content": "Responding to the government’s introduction of a new apprenticeship levy, BSRIA has expressed concern as to whether members will have to continue paying the statutory industry levy to CITB (Construction Industry Training Board) along with this levy and that such shake-up will “kill-off” the CITB. \n \n  \n \nGovernment plans for a new all-industry apprenticeship levy could spell the end for the current CITB system, with construction firms left in the dark as to how the new levy will interact with the existing construction-only levy. A consultation has been launched asking employers for their views on the new levy plans, making it clear the government is considering scrapping the existing system. \n \n  \n \nThe consultation document states that the apprenticeship levy will be economy wide and larger employers in the construction and engineering construction industries will be in scope of the levy alongside all other larger employers in the UK economy. On that basis government and the industries need to decide how best the existing levy arrangements respond to the apprenticeship levy. \n \n  \n \nOne option is for employers in the construction and engineering construction industries to pay the new apprenticeship levy while continuing to pay the existing industry levy and if this were to happen, the CITB would expect companies in the industries to fund their apprenticeships using the apprenticeship levy. \n \n  \n \nAnother option is to potentially remove the statutory industry levy arrangements completely, so that employers only pay the apprenticeship levy. This would represent a significant change to training arrangements in the construction and engineering construction industries and CITB would need to understand what effects this would have on the skills and capabilities of the UK construction industry. \n \n  \n \nBoth the CITB and the Engineering Construction Industry Training Board will consult with employers before the introduction of the apprenticeship levy on whether they should continue to pay the industry levy. \n \n  \n \nJulia Evans, Chief Executive, BSRIA, said: “Quality apprenticeships are essential for our industry to help strengthen the economy, deliver the skills that employers need and give millions more hardworking people financial security and a brighter future. Skilled people are the lifeblood of a strong economy to meet the demands of a competitive, global market. We hope that our members don’t have to pay such levies twice over and that the future of the CITB is safe – especially as the training it provides is dedicated to the construction industry. \n \n  \n \nAnother concern is the impact of the levy on the SME (small and medium enterprises) where most apprenticeships are situated. Given that 99.9 per cent of construction companies are SMEs, the future and livelihood of their apprentices could be under threat if larger companies resent contributing towards this new levy, smaller businesses will inevitably feel the impact. These are worrying times for the outlook of our industry’s workforce.” \n \n  \n \nThis move forms part of the government’s pledge to support 3m apprenticeships by 2020, include a requirement to take a company’s apprenticeship offer into account when awarding large government contracts, and publishing new industry standards so apprentices have the skills that firms need. \n \n  \n \nThe all-industry levy is expected to come into force from April 2017. \n \n  \n \nThe Apprenticeship Levy consultation seeks views on: \n– paying the levy; \n– how the levy should work for employers who operate across the whole of the UK; \n– how to make sure that employers paying the levy have the opportunity to get more out than they put in; \n– how best to give employers control of apprenticeships.", "source": "Building Design & Construction"}