{"published": "2015-09-23T15:15:09Z", "media-type": "News", "title": "Labour senator Jimmy Harte resigns from the Seanad", "id": "c0a61f02-b21e-406b-a3af-2b2d84a9850f", "content": "LABOUR SENATOR JIMMY Harte has formally resigned his Seanad seat nearly two years after sustaining a serious head injury after a fall in Dublin.\n\nThe Seanad was informed during the Order of Business this afternoon that the Donegal-based senator had formally resigned from the upper house.\n\nLabour’s Seanad leader Ivana Bacik paid tribute to the Letterkenny native, saying he was “well known and well-loved by all of us”.\n\nHarte was found unconscious with serious head injuries after an accidental fall on a Dublin street in 2013. He was found in Newmarket Square t about 4am on 16 November 2013, having earlier attended the Ireland versus Latvia football match at the Aviva Stadium.\n\nThe father-of-four was taken to St James’s Hospital but later transferred to Beaumont. Labour has previously said that Harte has been “making good progress in his recovery.\n\nHarte was a hugely popular figure around Leinster House and politicians from all sides of the house offered their support and sympathies after the incident.\n\nHe joined Labour in 2010 and contested the 2011 general election in Donegal North East. He failed to win a seat, coming fourth in the three-seat constituency. Harte was subsequently elected to the Seanad Industrial and Commercial Panel in April of that year.\n\nThe resignation triggers another by-election of Oireachtas members for the vacant seat - nearly a year after Fine Gael’s John McNulty debacle. A motion will be moved in the Seanad tomorrow triggering the by-election process, which takes at least six weeks.\n\nSpeaking in the house today, Fine Gael’s Seanad leader Maurice Cummins paid tribute to Harte, saying he wished him and his family well.\n\nFianna Fáil Seanad leader Darragh O’Brien wished Harte “all health and happiness” in his retirement, describing him as an “absolute gentlemen” who would be missed.", "source": "TheJournal.ie"}