{"published": "2015-09-07T09:17:30Z", "media-type": "News", "title": "Qatar jets to join anti-ISIL strikes from Turkey: Sources", "id": "66bf9fbd-6c81-4cbc-b905-afdf8102ce3f", "content": "Qatar is set to join the U.S-led coalition’s air strikes against the Islamic State of Iraq and the Levant (ISIL) from Turkey, according to Turkish sources, as France is also considering participating in the war against the jihadists. \nThe sources told daily Hürriyet improvement was achieved in talks to open air bases to southeastern Diyarbakır, Batman and Malatya, in addition to the İncirlik Air Base in Adana, where Turkey and U.S. jets have begun flights to bomb ISIL targets. \nHowever, Turkish officials declined to comment on the number of Qatari jets and the timing. \nCurrently, six U.S. fighter jets are conducting operations from İncirlik, the sources said. \nMeanwhile, France is considering air strikes against ISIL in Syria, in what would be a reversal of its current position, daily Le Monde said on Sept. 5. \nNeither the French Presidency nor the Foreign Ministry or the Defense Ministry would comment on the report, with officials saying only that President Francois Hollande may address the question during his press conference on Sept. 7, Reuters said. \nFrance currently only participates in missions against ISIL in Iraq, following that country’s request for international help against the jihadists. \nParis has refused to carry out strikes in Syria on fears foreign intervention may inadvertently help Syrian President Bashar al-Assad hold on to power. \nBut Le Monde said France has been compelled by recent events to reconsider its position and could begin reconnaissance flights over the war-torn country. \n“Hollande is considering striking ISIL in Syria,” Le Monde headlined. \nU.S. and coalition forces launched 25 airstrikes in Iraq and eight in Syria on Sept. 5 against ISIL targets, the U.S. military said. \nIn Iraq, the airstrikes were centered near 12 cities including Mosul, Ramadi, Baiji, Tuz and Sinjar, the Combined Joint Task Force said in a statement on Sept. 5. They destroyed buildings, vehicles, a homemade explosives facility and more than 50 of the militants’ fighting positions, it said. \nIn Syria, six strikes hit near Mar’a and others at Raqqa and Tal Abyad, the statement said. \nAt least 47 fighters were killed in clashes between ISIL and rival Syrian rebels, a monitor said on Sept. 5, in an area where the United States and Turkey are planning to open a new front against ISIL. \nThe renewed fighting raged on Sept. 4 around the rebel-held town of Marea, 20 kilometers from the Turkish border, the Britain-based Syrian Observatory for Human Rights said. \nThe area falls within a “safe zone” Turkey said last month it would set up in northern Syria to help keep ISIL at bay. \nISIL said late on Sept. 4 it had waged a fresh assault on Marea, killing “dozens” of Syrian rebels fighting against the group.", "source": "QatarsHub.com"}