{"published": "2015-09-02T16:02:48Z", "media-type": "Blog", "title": "Last Year, God Told Rick Joyner The New England Patriots Would Win The Super Bowl", "id": "59e56ece-e1b3-4bdb-9d06-157736e204a4", "content": "Last Year, God Told Rick Joyner The New England Patriots Would Win The Super Bowl Submitted by Kyle Mantyla on Wednesday, 9/2/2015 12:02 pm On yesterday's \"Prophetic Perspective on Current Events\" program, Rick Joyner revealed that, prior to the start of last year's NFL season, God personally told him that the New England Patriots would win the Super Bowl and that it would be \"a prophetic message that patriotism is going to win this year.\" Joyner said that God regularly shows him \"through sporting events some prophetic scenarios,\" and so, last year, he asked God when He was going to let the Carolina Panthers finally win a Super Bowl. God reportedly told Joyner \"don't give up on the Panthers,\" which Joyner interpreted to mean that the Panthers would not have a very good year but \"it could end up good,\" which is exactly what happened when the team made it into the playoffs despite having a losing record and even won a Wild Card game. But more importantly, God told Joyner that the Patriots would win the Super Bowl, though Joyner wisely decided not to share that information publicly because otherwise people would have used it to gamble. \"The Lord told me the Patriots were going to win,\" he said. \"I knew the Lord said and he was saying it as a prophetic message that patriotism is going to win this year.  And that's what's going to win and you're going to see Americans becoming patriotic again. And I knew that was a message and I think that's important for us to understand and, for that reason, I was kind of happy when the Patriots won it all, I knew we're going to see this unfold.\" Filed Under Share this post Tweet Related Items Joyner: 'Lawlessness' From Obama, Clinton, And SCOTUS Is A Sign Of The End Times 8/24/15 @ 1:05 Right Wing Bonus Tracks - 8/12/15 8/12/15 @ 5:31 Right Wing Bonus Tracks - 7/1/15 7/1/15 @ 5:30 Rick Joyner: Gay Marriage May Lead To Civil War 6/25/15 @ 4:30 Rick Joyner: Legalizing Gay Marriage Is A 'Trial Run' For The Mark Of The Beast 6/11/15 @ 12:28 Jim Bakker: ISIS Is Getting Ready To Kill Us, So Buy Mac & Cheese And Veggie Burgers Before It's Too Late 5/22/15 @ 1:40", "source": "Right Wing Watch"}