{"published": "2015-09-01T13:00:00Z", "media-type": "News", "title": "WOW! Launches 300 Mbps Internet Service for Residential and Business Customers", "id": "cb93a51e-f52f-4c8e-96f9-e5cc521851c8", "content": "ENGLEWOOD, CO -- (Marketwired) -- 09/01/15 -- WOW! Internet, Cable & Phone (WOW!), a leading provider of high-speed Internet, digital cable TV, and phone, today announced that the company will offer 300 Mbps Internet service (300 Mbps downstream, 20 Mbps upstream) for residential and business customers. \n  \nThe new speed will provide users with more flexibility, efficiency and control in how they consume media and share experiences with others. Residential users can enjoy multiple simultaneous activities such as video streaming and gaming, while business users will benefit from faster large file downloads, support for more users, and even faster cloud interaction. \n   \n\"Everything our WOW! team does is focused on making our customer experiences better. We are very excited to introduce a faster Internet service tier as a way to provide higher performance in home and business communications,\" said Karl Ossentjuk, Vice President of Product Management and Marketing for WOW! \"And with WOW!, leading-edge technology comes with our unsurpassed customer support.\" \n\nThe new 300 Mbps service, which complements WOW!'s existing residential speed tiers of 30/5, 60/5 and 110/15, and business speed tiers of 8/1, 30/5, 60/5, 110/15, is being rolled out in two waves: 300 Mbps service is available in Southeast Michigan (Detroit), Columbus, OH, and Cleveland, OH today; and Chicago, IL, Evansville, IN, Pinellas (St. Petersburg), FL, Auburn, AL and Huntsville, AL will be active on September 15. \n\nAbout WOW! Internet, Cable & Phone \nWOW! has been one of the nation's leading providers of high-speed Internet, cable TV, and phone services, serving communities in Illinois, Michigan, Indiana, and Ohio since 2001, and in Kansas and the Southeast since 2012. The company is dedicated to delighting customers with friendly, quality service at affordable prices. WOW! is privately held and controlled by Avista Capital Partners. For more information about WOW! services, please visit www.wowway.com . \n\nContact, WOW!: \nSharon Santella \n720-479-3537 \nSharon.santella@wowinc.com", "source": "Good Day Sacramento"}