{"published": "2015-09-20T11:00:00Z", "media-type": "News", "title": "Steep sharemarket losses to start the week", "id": "8437fa67-b6df-4595-acbf-98249bf00bd3", "content": "Australian stocks are poised for a heavy sell-off on Monday as the implications of the United States Federal Reserve's decision to keep interest rates at close to zero per cent last week worked through financial markets, causing losses on Wall Street. Australian stocks are poised for a heavy sell-off on Monday as the implications of the United States Federal Reserve's decision to keep interest rates at close to zero per cent last week worked through financial markets, causing losses on Wall Street. Futures indicated the S&P/ASX 200 Index would be down 76 points or 1.48 per cent at the reopen of trading after closing at 5170.5 points on Friday. This follows a 1.7 per cent loss for the Dow Jones Industrial Average and 1.6 per cent drop for the S&P 500. The Euro Stoxx index was down 3 per cent.\n\nMarkets were troubled by the Fed's admission that it held and the nature of the slowdown in China.\n\n\"I think we'll reverse a big chunk of the gains we saw last week at least at the open,\" AMP Capital chief economist Dr Shane Oliver said. \"The Fed's decision to be on hold has reminded investors that there are uncertainties regarding global growth particularly out of China and the emerging world, and that seems to have been what's driven the US and Europe towards the end of last week.\"\n\nIn an otherwise quiet week on the Australian data front, a consumer confidence survey out on Tuesday will provide the first gauge of people's feelings about the economy since Malcolm Turnbull ousted Tony Abbott.\n\nJPMorgan economist Stephen Walters said the Fed's observation of slowing Chinese activity was interesting but the Fed's tone of sudden caution was slightly at odds with that conveyed by Reserve Bank of Australia governor Glenn Stevens.\n\n\"I think we're right to be watching closely what's going on there because we're arguably more leveraged to the China economy than the US economy is,\" Mr Walters said. The Governor on Friday . \"[Stevens] was saying perhaps there is a bit too much pessimism around not only China but what's going on domestically,\" Mr Walters said. \"We've got our own central bank saying 'keep calm and carry on'. I tend to put more weight on what governor Stevens is saying.\"\n\nEven a slowing China was still providing a large degree of stimulus to the Australian economy, he said, and \"It is a very heavily planned, controlled economy, so they can pull the levers and get a pretty quick bang for their buck... there's been five interest rates cuts since November.\"\n\nMr Walters sees no change to interest rates in Australia, meaning an extended period of time at the record low rate of 2 per cent.\n\n\"We're advocating for no change in Australia because as Governor Stevens said on Friday, we're pretty content where we are. The current policy rate is very, very stimulatory.\"\n\nThe People's Bank of China cut interest rates last month as well as pumping greater liquidity into its banking system.\n\nThe Fed on Thursday in Washington voted to keep interest rates unchanged, accompanying its decision with strongly dovish commentary and lower projections for the direction of interest rates.\n\nThe Australian dollar on Friday night rallied to as high as US72.76¢ before finishing the week at US72.19¢.\n\n- with agencies The story first appeared on The Sydney Morning Herald.", "source": "The Hepburn Advocate"}