{"published": "2015-09-23T10:01:46Z", "media-type": "Blog", "title": "New products at Office Shoes", "id": "659bbbf1-01bc-44b3-9684-b981b9a67708", "content": "Office Shoes has hundreds of new items today \n   \n UGG Australia Skylah Strap Boots BLACK LEATHER,Black  £215.00 \nBoots by UGGEdgy update of a classic style the Skylah strap boots come with a bomber-finished twinface sheepskin upper, plush lining, two adjustable straps and signature EVA outsole.- Our genuine UGG boots are sold in half sizes. If you are normally a size 6 please order a size 6.5 as this is the equivalent size.- Twinface sheepskin- UGGpure™ insole- Patent-protected tread design  \n     \n UGG Australia Myrna Wedge Boots LODGE LEATHER,Brown,Black  £150.00 \nAnkle Boots by UGG Stylish, wedge ankle boots Myrna by UGG Australia come with a distressed leather upper, side zip and plush shearling lining.- Lodge leather upper- Genuine shearling lining- Synthetic sole- 8cm heel    \n Ted Baker Francki Tall Boot BLACK LEATHER,Black  £140.00 \nBoots by Ted BakerThe Francki tall knee boot by Ted Baker in premium black leather features a silver back zip fastening, two toned leather upper with contrasting leg and slim block heel.- Premium leather upper – Zip fastening – Leather sock - Mixed leather & rubber sole About Ted BakerFrom the beginning Ted Baker has had a very clear, unswerving, focus on quality, attention to detail and a quirky sense of humour. Everything produced under the Ted Baker name has his personality woven into its very heart    \n Moon Boot Caviar ANTHRACITE,Grey  £125.00 \n   \n Blundstone Chelsea Boots SLATE BLACK LEATHER,Black,Brown  £125.00 \nCasual Boots by BlundstoneThe casual Chelsea boot by Blundstone is a hard wearing pull on ankle boot in premium slate black leather with front and back pull tabs, side elastic gussets and a rubber cleated sole.- Premium Leather upper – Leather & synthetic lining – Rubber sole – Online Only About BlundstoneFounded in Tasmania in 1870, established footwear brand Blundstone specialise in making the ‘toughest, no nonsense footwear for work and play.’ This family managed brand retains its roots in Hobart Tasmania, where family values are at the core of everything they do. Sourcing materials from all over the world, Blundstone are known for their legendary elastic sided boots as well as their durable, hardwearing boots for both outdoor work and school.    \n Poste Mistress Hazel Brogue boots BLACK LEATHER,Black,Red  £120.00 \nBoots by Poste MistressHigh profile brogue style ankle boot by Poste Mistress in shiny black vintage leather with lace up front and contrasting black cleated flat sole. - Premium leather upper- Leather insole- Leather lining- Rubber sole About Poste MistressA unique and feminine luxury label the represents directional and timeless quality. Poste Mistress is a women’s footwear boutique exclusive to OFFICE that delivers expertly crafted, elegant silhouettes. Using luxurious materials, subtle texture clashes, delicate embellishment and glossy finishes, the label embodies pretty polished perfection.    \n Moon Boot Space BLACK BEIGE,Black  £105.00 \n   \n Fly London Yust Wedge Knee boots BLACK TOUCH,Black  £98.00 \nKnee boots by Fly LondonThe Yust Wedge Knee Boot by Fly London offers comfort and style in a premium black touch leather. It also features a side zip fastening, lace up calf detailing and a rubber cleated wedge outsole.- Premium leather    \n H by Hudson Piper Front Zip boots BLACK LEATHER,Black  £98.00 \nAnkle Boots By H by HudsonThe Piper Front Zip is a smart black leather ankle boot with simple vamp for a clean and crisp silhouette, front zip fastening and a block heel.- Leather upper- Leather lining- Leather sock- Leather sole- 7.5cm heel About H by HudsonBorn in 1990, Hudson has been putting their best foot forward for more than two decades with its high quality shoes. Acknowledging trends and giving them our own idiosyncratic twist is the cornerstone of the Hudson philosophy. Whether it’s music, art, style icons or film, there is always inspiration to be found.  \n   Ash Jungle Slip On BLACK PYTHON CALF LEATHER,Black  £95.00   Moon Boot Soft Met SILVER,Multi,Black  £95.00   Vagabond Tyra Back Tab Boots TAN LEATHER,Tan,Black  £90.00   Office Nala Clean Block Heel boots BLACK LEATHER,Black  £88.00   Timberland 6 Inch Premium 8 Inch Double Strap boots WHEAT NUBUCK,Tan  £88.00   Moon Boot Sport AZURE BLUE,Blue,Black  £85.00   Moon Boot Glance PLATINUM,Multi  £85.00   Poste Cobalt Neoprene Hi Top BLACK NEOPRENE,Black  £84.99   Office Acclaimed Strap BROWN LEATHER,Brown  £84.00   Moon Boot Vinyl WHITE BLACK,White  £80.00  \n Plus… \n 18 products from Womens > Flats  15 products from Womens > Ankle Boots  9 products from Mens > Casual  8 products from Womens > Sandals", "source": "Latest Fashion trends and news at All The Clothes"}