{"published": "2015-09-13T21:08:19Z", "media-type": "News", "title": "Thousands visit Kings Heath Street Festival", "id": "d8361a4b-1332-43c9-9ceb-5b72d4fe64f0", "content": "There were sofas in the street in York Road and bales of straw offering a rural alternative in Heathfield Road. \n \nWith thousands of people wandering past all day long as street traders plied hungry visitors with food and drink, thoughts began to turn to ‘What next?’ \n \nOver at the Hare & Hounds, manager Adam Regan had a bird’s-eye view of the crowds from his office. \n \nBut he also had another eye on the future. \n \n“There are people from all walks of life here and the festival has got a nice family vibe about it,” he said. \n \n“Everybody feels comfortable about bringing their kids down so enjoy a lot of entertainment, food and drink. \n \n“It complements the creative community that Kings Heath has developed over the years. \n \n  Graham Young   Adam Regan who runs the Hare & Hounds \n \n“I am keen to do something big at least once a month, even through the winter, to create something like Columbia Road Flower Market and Spitalfields Market in London. \n \n“It’s nice for people to come to spend their Sundays here because there’s art, music and food and something for the kids to do and its development all feels very organic because it hasn’t been forced by corporate business. \n \n“I think Kings Heath is on the up because it’s more affordable for young creatives than Moseley. \n \n“We have really big plans for the street festival in future years.” \n \nAs we talked upstairs, bar supervisor Sam O’Brien came up – and she couldn’t resist leaning out of the window to take her own phone pictures of the rapidly-growing crowds. \n \nBeyond the derelict remains of the historic former Ritz Ballroom – destroyed by fire in March, 2013 – a celebrity was causing a stir outside of Steve Bull’s Polar Bear second hand record shop. \n \nIt was a head and shoulders model of Elvis, waiting to be snapped up for just £15. \n \n  Graham Young   A model of Elvis - yours for £15 - at The Polar Bear record shop, with shop owner Steve Bull (left) and Elvis owner, Phil Jones \n \nFriend and Elvis model owner Phil Jones, who had found it in Leamington’s second hand centre The Big Shed, said: “It would cost £227 new plus shipping to import a new one from the United States.” \n \nNearby, artist Ruth Porter (Roots) was busy painting a 6ft board in black and white. \n \n“I’m just doing it for here,” she said. “We don’t sell these, but paint over them another time.” \n \nAcross the road, PC Andy Collis (0094) was enjoying the chance to do some community policing to try to make up for recent reductions in officer numbers. \n \nFirst, he ticked off a teenager whose real identity had proved the lad had previously been lying to him. \n \n“Sorry, but I am going to tell your school,” he told the boy after advising him to get off his bicycle first. \n \n  Graham Young   PC Andy Collis 0094 with Caydon Madden (five, left) and brother Charlie Madden (four). The second annual Kings Heath Street Festival, based on York Road and Heathfield Road on opposite sides of Kings Heath's A435 High Street at the Hare & Hounds junction. Words and pictures by Graham Young. \n \nThen, 6ft 3in PC Collis was a hit showing off his helmet and handcuffs to younger children. \n \nBrothers Charlie Madden, four, and Caydon Madden, five, were among the first to have their photographs taken on parental mobile phones with him. \n \nRobert Geoghegan, an artist with his own distinctive range of “Funny Brummie” paintings, was delighted with his early trading after also enjoying success at the Christmas craft market in Birmingham last winter. \n \n“This festival is obviously weather dependent, but today it’s fantastic... especially as I do so many pictures of Moseley and Kings Heath,” he said. \n \nAs for the children... for every one squealing on the big wheel, others were in a different world. \n \nA tiny girl dancing in front of The Tom Walker Trio on Heathfield Road had no idea which planet she was on while the musicians delivered a blistering mixture of rock and funk. \n \n  Graham Young   Chris Chilton with Sebastian Chilton, 20 months, and cuddly toy \"Ra! Ra!\" \n \nRaised up to shoulder level on York Road in front of the Stage Bus parked outside of the Hare & Hounds, 20-month-old Sebastian Chilton was also in another world as he touched cuddly toy “Rara” on top of Chris Chilton’s shoulders. \n \nBut, even in a human tide of street fever happiness, not every youngster was happy. \n \nAt the corner of Heathfield Road and Kings Heath’s High Street, near three-year-old Ivo Short had the strangest look underneath his delightful face paints. \n \nDad Richard had the answer. \n \n  Graham Young   Ivo Short, almost three, wondering when he can have another go on the carousel ride \n \n“Ivo’s been on the carousel and wants to go on again,” he said. \n \n“But there’s so many children here, he’s going to have to wait until after the next ride has been before he can ride again.”", "source": "Birmingham Mail"}