{"published": "2015-09-06T19:43:59Z", "media-type": "Blog", "title": "DSM Safety Products – Off-Duty Police Identification Banner", "id": "a82b75a3-054a-40b4-9d81-e61e24c208f1", "content": "An example of the DSM Police and Sheriff safety banner. \n \n“Don’t Shoot Me” (DSM) Safety Products recently posted a comment on our KCPD Badge Placement Study article. In the comment they referenced their police safety banner product and how it has been shown to be highly effective in identifying off-duty or undercover police officers who take police action in civilian clothing, especially in low-light situations. \n \nThese banners are lightweight, and have reflective lettering, and can be folded or rolled up to fit inside a pocket. I had briefly heard about these banners in the past, and was glad to hear from Michael Lessman of DSM Products. This safety banner has huge potential in properly identifying police officers in civilian clothes, and avoiding the unthinkable blue on blue accidental shooting of off-duty officers by on-duty officers who see a subject armed with a firearm. As such, I wanted to pass along some information on this beneficial piece of law enforcement equipment. \n \n\n \nThe DSM identification banners are lightweight, easily stored and carried, and quickly provide positive identification for civilian clothed officers. \n \nDSM Police Safety Banners \n \nDSM Products began in 2007 when a SWAT Sergeant realized during the major influx into Active Shooter training, there was no adequate and viable solution to identifying off-duty officers or officers in civilian clothing that had responded to assist. The DSM Safety Banner, with its bright ANSI green (looks more yellow) background and reflective lettering, was developed to provide these civilian clothed officers a near 360-degree identification. \n \nThese banners stand out both day and night, just like the traffic safety vests that officers wear when on a crash scene. The reflective borders and lettering will provide a very clear identification to the introduction of any light, making civilian clothed officers much more safe when performing duties in that dress. \n \nThis is a serious potential in a rapidly evolving critical incident. The DSM banner can mean the difference between success and tragedy. \n \nThe banners can be easily deployed by simply unfolding and looping the banner over the officer’s neck and one arm. Because of their lightweight and fabric type material, the safety banners can also be stored very easily and quickly in a small location. \n \nThe DSM safety banner has two distinct deployments: \n  Post-Critical Incident Deployment  – putting the bad guy down, seeking cover, tactically reloading and deploying the DSM Safety Banner to identify yourself to arriving law enforcement units. (The gunfight finds you mode)  Pre-Critical Incident Deployment – Before placing yourself into a critical incident, deploy your DSM Safety Banner so your not misidentified by possible law enforcement officers on scene already. (You find the gunfight mode)   \nThe DSM Law Enforcement Safety Banners options: \n \n\n \nLessons From the KCPD Badge Placement Study \n \nAs you may remember, the KCPD Badge Placement Study was conducted in 2011 and 2012 by the Kansas City, Missouri Police Department. The Firearms Unit of KCPD included various targets of plain clothed officers among the actual “threat” targets. An exact replica of the KCPD badge (with correct size) was placed on the plain clothed officer targets on the waist line and on an imaginary neck chain hanging at the “officer’s” chest. \n \nUltimately, the study revealed that officers were initially focusing only on the firearm when deciding to shoot. After intense training, officers learned to make split second scans of the targets to see if there was a badge or other form of identification. Accidental shootings of plain clothed officers dropped significantly, and were particularly reduced for targets wearing badges at chest level – on neck chains . This led to KCPD issuing a department-wide mandate for officers in civilian clothes to wear badges around their neck and not on their waist band. \n \n\n \nDespite this study and training model being a great benefit to plain clothed and uniformed officers alike, the placement of a badge still does not provide 360-degree identification, and is still hindered in low-light conditions. The DSM Police Safety Banner seeks to fill that void with near 360-degree identification in highly reflective material. \n \nThe Effects of a Blue-on-Blue Shooting \n \nA blue-on-blue shooting is devastating in many ways. The officer who is shot could suffer life-altering injuries or death. Their family will suffer along with their loved one. The officer who shot the other officer will undoubtedly suffer immense psychological trauma, and a strong sense of isolation. \n \nOfficers are expected to get things right, and shooting another officer is a tremendous blow to the trust officers need to function. Many officers who shoot another officer, leave police work within a short time, and some have even ended their lives over the mistake. \n \n\n \nThe Department suffers with the loss of multiple officers – the injured or killed officer, and the officer who fired the shot. Entire shifts can be effected as officers inevitably take sides of who was more at fault for the shooting. If the shooting crosses agency lines, a very real possibility in an active shooter or critical incident with multiple agencies responding, the effects can be even worse. Entire departments end relationships, and in some cases open hostilities emerge. \n \nFinal Thoughts \n \nThere is no doubt the DSM Police Safety Banner can provide a superior form of identification for officers in civilian clothing. In addition to wearing a badge at chest level, the DSM identification banner is a quick reference identification in both daylight and low-light situations. These banners should be seriously considered by any agency. \n \nBlueSheepDog is a strong proponent of officers carrying their firearms and handcuffs at all times when off-duty . We would also highly recommend that officers purchase some form of positive identification in the event they have to take action during a time when they are in civilian dress. The DSM Police Safety Banner is a great consideration for that purpose.", "source": "Blue Sheepdog"}