{"published": "2015-09-23T00:33:22Z", "media-type": "News", "title": "Taiwan Shares Expected To Hand Back Tuesday''s Gains", "id": "d23577b9-2388-4ae2-8847-afe24de71f03", "content": "(RTTNews.com) - The Taiwan stock market moved higher again on Tuesday, one session after it had snapped the three-day winning streak in which it had climbed more than 200 points or 2.3 percent. The Taiwan Stock Exchange settled just above the 8,365-point plateau, although the market is likely to see renewed consolidation on Wednesday.\n\nThe global forecast for the Asian markets is soft, thanks to ongoing uncertainty over interest rates and trouble for auto giant Volkswagen. The European and U.S. markets ended firmly in the red and the Asian bourses figure to open in similar fashion.\n\nThe TSE finished modestly higher on Tuesday, bumped into the green by support from the technology stocks.\n\nFor the day, the index climbed 58.88 points or 0.71 percent to finish at the daily high of 8,365.92 after trading as low as 8,325.78 on turnover of 69.27 billion Taiwan dollars.\n\nHTC Corp. led the gainers with a 3.1 percent jump.\n\nThe lead from Wall Street is broadly negative as stocks were stuck firmly in the red throughout Tuesday - more than offsetting the gains in the previous sessions.\n\nThe Dow slumped 179.72 points or 1.1 percent to 16,330.47, while the NASDAQ plunged 72.23 points or 1.5 percent to 4,756.72 and the S&P 500 tumbled 24.23 points or 1.2 percent to 1,942.74.\n\nThe sell-off was partly attributed to ongoing uncertainty about the outlook for U.S. monetary policy. Following last week's Federal Reserve decision to leave interest rates unchanged, traders are questioning when the central bank will eventually raise rates.\n\nConcerns that auto giant Volkswagen could face a massive fine for cheating on emissions tests contributed the sell-off by European stocks.\n\nCloser to home, Taiwan will see August numbers for commercial sales and industrial production later today.\n\nSales are tipped to fall 3.7 percent on year after slipping 4.42 percent in July. Output is called lower by an annual 2.9 percent after falling 2.99 percent in the previous month.\n\nFor comments and feedback: contact editorial@rttnews.com\n\nhttp://www.rttnews.com", "source": "Nasdaq"}