{"published": "2015-09-24T15:33:04Z", "media-type": "News", "title": "AristaMD Licenses Physician-Referral Decision-Making Guidelines From University of California, San Francisco", "id": "0c816e48-61c5-460c-8bb1-f67cf954297c", "content": "AristaMD today announced that it has entered into a licensing agreement with the University of California, San Francisco (UCSF), granting AristaMD rights to use physician-referral decision-making guidelines developed at UCSF. AristaMD plans to implement the UCSF algorithms in the development of the company's comprehensive software and service referral support program, which is designed to enhance decision-making, increase efficiency, improve patient care, and significantly reduce costs. \n\n\"As many as 40 to 60 percent of referrals to specialty physicians are unnecessary, which not only creates longer wait times before patients receive the care they need, but also costs the US health system $10 billion annually in added expenses, without improving health outcomes,\" said Rebecca Cofinas, President and CEO of AristaMD. \"A strong need exists for a solution that addresses the pain points of everyone involved in the referral process: patients, physicians, and payors -- without creating more burden. AristaMD's solution leverages UCSF's proven decision making algorithms to provide options for primary care physicians along with a technology platform to enable e-consults and a robust reporting tool to provide key business analytics. This suite of tools will optimize the specialty referral process.\" \n\nReferrals of patients to medical specialists have nearly doubled over the last decade, and that figure is set to double again in the next five years. Nearly 20 million patients annually are inappropriately referred to a care provider who is not the right match for their medical condition. \n\n\"The referral decision-making algorithms we have developed at UCSF address key aspects of the current referral system that can lead to inefficient or unnecessary specialty referrals,\" said Nathaniel Gleason, M.D., Medical Director of Health System Access and assistant clinical professor, UCSF School of Medicine. \"Guidelines created to address a specific clinical problem can support the primary care physician by highlighting the evaluation and conservative management steps to consider prior to referral to the specialist. The referral platform also supports enhanced communication with the specialist, allowing the primary care physician to quickly convey the necessary data along with expectations for the co-management relationship. Finally, by facilitating a more robust referral request, the specialist can address some questions with an electronic response, where clinically appropriate, saving the patient a visit to the specialty practice and helping to reduce unnecessary backlog.\" \n\nUnder the leadership of Dr. Gleason and Dr. Gonzales, M.D., MSPH, Chief Innovation Officer for UCSF Health and Associate Dean, UCSF School of Medicine, more than 130 problem-specific referral decision-making guidelines across a wide range of sub-specialty areas have been developed. The algorithms have been clinically validated over the course of a 5-year pilot study, encompassing more than 2,000 electronic consult exchanges between primary care and specialty care physicians. Data from this pilot study encompassing e-referrals and e-consults show: Primary care physicians found the program influenced their patient care plans 85 percent of the time Specialists were able to provide an electronic response to a clinical question under 10 minutes in the majority of cases 95% of questions were successfully answered in a one-time exchange between the primary care physician and specialist Overall specialty referrals decreased 17 percent within an average of three months ER visits decreased 12 percent Hospital admissions decreased 11 percent Access dramatically increased in specialty clinics - average of 20 percentage point shift in patients able to be seen within 14 days 91% of primary care physicians strongly agreeing program was helpful \n\n\"Building upon these important decision making algorithms will help to spread this comprehensive specialty referral management solution to a wider audience of physicians,\" said Dr. Gonzales. \"We see a synergistic alignment in UCSF's and AristaMD's respective approaches, skill sets and vision for helping physicians and specialists take care of more people in a more time and cost-efficient manner.\" \n\nUnder the terms of the agreement, AristaMD will be granted a limited exclusive license to UCSF's Electronic Physician Referral and Consultation Platform for the next five years. \n\nAbout AristaMD \n\nAristaMD provides comprehensive software and service support to optimize the specialty physician referral process from beginning to end. The company's cloud-based, HIPAA compliant software solution is physician-centric, utilizing proven clinical decision-making guidelines and other tools developed solely by practicing physicians to ensure referral questions are answered at the point of care. The AristaMD solution assists in identifying patients with an urgent referral need, helping providers decide if a referral is required and ensuring the patient is referred to the optimal resource when needed. In addition, the company's solution facilitates e-consults, enabling rapid physician-to-physician communication and coordination between primary care physicians and specialists. \n\nAbout University of California, San Francisco \n\nUCSF is the nation's leading university exclusively focused on health. Now celebrating the 150th anniversary of its founding as a medical college, UCSF is dedicated to transforming health worldwide through advanced biomedical research, graduate-level education in the life sciences and health professions, and excellence in patient care. It includes top-ranked graduate schools of dentistry, medicine, nursing and pharmacy; a graduate division with world-renowned programs in the biological sciences, a preeminent biomedical research enterprise and two top-tier hospitals, UCSF Medical Center and UCSF Benioff Children's Hospital San Francisco. Within UCSF, both the Office of Innovation, Technology & Alliances (ITA) and Center for Digital Health Innovation helped facilitate the collaboration with AristaMD. \n\nThe UCSF Office of Innovation, Technology & Alliances (ITA) coordinates UCSF's efforts in forging collaborations and licensing technologies that translate cutting-edge science on campus into therapies and products that directly benefit patients worldwide. UCSF's Center for Digital Health Innovation focuses on envisioning and realizing new digital health technologies and services developed at UCSF and beyond to power a new era of precision medicine, and facilitates collaborations such as the one between UCSF and AristaMD. \n\nUC Disclaimer: The information stated above was prepared by AristaMD and reflects solely the opinion of the corporation. Nothing in this statement shall be construed to imply any support or endorsement of AristaMD, or any of its products, by The Regents of the University of California, its officers, agents and employees. \n\nRead the full story at http://www.prweb.com/releases/aristamd/ucsf-partnership/prweb12977872.htm", "source": "Individual.com"}