{"published": "2015-09-14T00:56:07Z", "media-type": "News", "title": "Northern Ireland's crisis lifts lid on deep distrust", "id": "3875033b-836f-4f3e-84a1-d798cc2a20c5", "content": "By BELFAST (Reuters) - When IRA-linked gunmen turned their fire on one other this summer they triggered a political crisis in Northern Ireland's fragile government of pro-British unionists and republicans working for a united Ireland. \n\nThey also revealed an uncomfortable truth: 17 years after a U.S.-brokered truce to end three decades of sectarian violence, the province remains riven with old enmities. \n\nThe immediate cause of this particular crisis was the murder of a former Irish Republican Army member, Kevin McGuigan, outside his Belfast home last month. Police say the killing was revenge for the murder of another former IRA member, Jock Davison, in May over a feud that went back decades.\n\nPolice said the murders were evidence that the IRA, that fought for independence from Britain and was supposedly disarmed under the terms of the 1998 'Good Friday' peace agreement, continues to operate in the criminal underworld. \n\nNor does it operate alone, security sources, police and politicians said. Some members of the armed groups on both sides of the conflict are thriving, their focus now on racketeering.\n\nThe new generation of armed groups may be much smaller and less sophisticated than the military-style structures that were involved in the deaths of 3,600 people during the so-called Troubles, these sources said, but they continue to exacerbate the religious tensions while profiting from crime.\n\nVeterans of Northern Ireland's war warn that if the politicians fail to get a grip of the situation, the segregation along sectarian lines that still exists in many parts of the province can only get worse, exploited by these groups.\n\nOne of those briefly arrested in relation to the McGuigan killing was Bobby Storey, a senior member of the Sinn Fein party that was once the political arm of the IRA. Storey, who was released without charge, said there was no basis for his arrest and those behind the murder were enemies of Sinn Fein's embrace of peace. The police declined further comment.\n\nSinn Fein, part of Northern Ireland's power sharing government, says the IRA has \"left the stage\". The police's assertion that the IRA still exists, however, drove the pro-British Unionists to withdraw most of its ministers from government, bringing it to the brink of collapse. \n\nThe unionists say paramilitary activity must be tackled if Northern Ireland is to move forward.\n\n\"To have stability in the future we need to deal with that cancer at the heart of government now,\" said acting First Minister Arlene Foster, a Unionist who survived a bomb attack on a school bus at the age of 17.\n\n\"TEAR DOWN THIS WALL\"\n\nWhile life has changed for many in bustling central Belfast, parts of Northern Ireland remain divided.\n\nThe divide is felt strongest in the working class areas of Belfast where there is little integration and little obvious economic benefit from the peace.\n\n\"I have no friends on the other side of the community and I believe I never will,\" said Jake, a 57-year-old community worker who stood smoking on the Protestant Shankill Road underneath British flags fluttering from every building and lamp post.\n\nWhile a multi-million pound make-over draws tourists to the capital Belfast, to the docks where the Titanic was built and to the area's rolling green hills, the sprawling low-rise Belfast estates still carry the scars of the conflict.\n\nTo be sure, the end of what amounted to a war is enormous progress. Cross-community initiatives have taken off. There is a level of integration that would have been unthinkable in the past.\n\nAs a result, Peter Shirlow, director of Irish studies at the University of Liverpool, said Northern Ireland was now a very different place to the one that gave rise to sectarian violence in the late 1960s.\n\nThe paramilitary groups who have moved into crime have failed to keep support from the wider community, he said. \n\n\"I'm not saying there won't be some sporadic violence, but simply we no longer have the conditions of 1968. During each crisis, people have sabre-rattling and said we will fall back into the past, I have never seen any evidence of that,\" he said.\n\nShirlow said he took heart from the fact that of the 17 people so far arrested over the Aug. 12 murder of McGuigan, the majority have generally been in their 50's - \"part of the Troubles generation\" - and not new recruits.\n\nBut 38-year-old Kerry still walks the long way round to avoid a Protestant area when she visits her family on Belfast's Catholic Falls Road. Kerry declined to give her last name.\n\n\"If you're brought up surrounded by politics and hate then you will continue to be political and full of hate. I've just kept myself to myself, lots of us do,\" said Kerry, speaking in the shadow of the so-called \"peace walls\", 15-metre high 'fences' that separate Catholic and Protestant communities. \n\nA survey for the Economic and Social Research Council showed that the majority of people under 30 support mixed marriages between Catholics and Protestants, however less than half also believe there will be lasting peace.\n\n\"NO SURRENDER\"\n\nMurals on Protestant streets warn of the IRA - \"They Still Exist You Know\" - while others celebrate the lives of paramilitary gunmen and Queen Elizabeth. The Shankill Historical Society sells babies bibs with the Protestant resistance call: \"My cry is No Surrender\".\n\nIn the nearby Catholic Falls Road area, murals link the fight for a united Ireland to the campaigns led by Nelson Mandela and Martin Luther King.\n\nJude Whyte, a peace campaigner who lost his mother in a pro British bombing in 1984, said many people in Belfast still lived parallel lives, with separate social lives, separate education systems and separate sports - a modern day apartheid.\n\n\"Society is anything but normal here,\" Whyte told BBC Radio. \"(We have) walls that divide white English speaking Christians from each other. You could live your whole life in Belfast and never meet a Protestant, ever.\"\n\n\"They do say tall walls make good neighbors,\" said Jake, referring to the \"peace walls\" that were meant to be erected as temporary structures in 1969 but instead multiplied.\n\n\"It would be premature to remove them.\"\n\n(Additional reporting by Amanda Ferguson, and Padraic Halpin in Dublin; Editing by Guy Faulconbridge and Janet McBride)", "source": "Yahoo! News"}