{"published": "2015-09-14T12:24:00Z", "media-type": "News", "title": "Backyard birds: A time of transition around the feeders", "id": "08c9af8e-b648-4e8d-a1ba-5cda48caa68d", "content": "As anyone with a birdfeeder can attest, spring and fall can bring interesting sightings, and with a hint of autumn now in the air, the show has started in my back yard.\n\nThe breeding season is now over, juveniles have long since fledged, male birds exhibit wanderlust and migrating species soon will be on the move.\n\nMy wife has positioned feeders and a birdbath along the side of our house, near low shrubs and a Bradford pear tree. We have cardinals year round, but on Sunday, we had them in particularly high concentration, with as many as 10 visible within a 200-square-foot area.\n\nWe've been fortunate in recent years to have a nesting pair of painted buntings nearby, which frequent our feeders. Lately, we've seen only the female and figured the male had departed for post-breeding dispersal. We had it half right, anyway.\n\nThe adult male has indeed been absent from the feeder, but we noticed that it wasn't two females that continued to feed. Rather, it was one female and two male juveniles that are just now distinguishable at casual glance. This weekend, we noticed for the first time that what we thought was a female was actually a pair of juveniles, which are now transitioning into adult plumage.\n\nThis weekend brought other interesting sights.\n\nI decided to haul out my GoPro, which hadn't been turned on in a while, and position it near a hummingbird feeder. While capturing the video of a feeding ruby-throated hummingbird that is included with this post, I noticed how many other birds had gathered. At one time, I could turn my head 45 degrees and see in my yard cardinals, painted buntings, hummingbirds, tufted titmice, a white-breasted nuthatch, mourning doves, a Carolina wren and a Carolina chickadee. As the buntings flew away, a red-bellied woodpecker and a downy woodpecker flew in to feed on suet. About that time, I heard (but never saw) blue jays in a neighbor's water oaks.\n\nThen a pine warbler -- a species we have not typically seen in our yard until at least October -- plopped down on a feeder.\n\nCan goldfinches and yellow-rumped warblers be far behind?", "source": "Beaufort Gazette"}