{"published": "2015-09-01T07:40:42Z", "media-type": "News", "title": "Mayor Bill de Blasio joins Twitter", "id": "f840a513-98ec-4487-85a6-4f92dc067ea3", "content": "Fanaticism on rise in India Bangladesh Taslima Nasrin  \nCalcutta News.Net - Monday 31st August, 2015 \n \nDrawing parallels between the cold blooded killings of bloggers in  Bangladesh and the murder of M.M. Kalburgi, a writer and rationalist from  Karnataka, Bangladeshi writer Taslima Nasrin said the  ... \n   Rs.20 lakh penalty on Chandigarh discotheque  \nCalcutta News.Net - Monday 31st August, 2015 \n \nServing liquor beyond the permissible time has led to a Rs.20 lakh penalty on the discotheque of a leading five-star hotel chain here, an official said on Monday. The penalty was imposed following  ... \n   Rail services to shut in Tripura for gauge conversion  \nCalcutta News.Net - Monday 31st August, 2015 \n \nTripura would remain out of the rail network for more than six months as the Northeast Frontier Railway (NFR) would undertake gauge conversion work from September 20, an official said here on  ... \n   India inch closer to series victory against Sri Lanka  \nCalcutta News.Net - Monday 31st August, 2015 \n \nIndia remained on course for an away Test cricket series victory against Sri Lanka after 22 years, as the hosts chasing a challenging target of 386 to win, struggled to reach 67/3 in their second  ... \n   India South Korea plan $10 billion e-park in Iran  \nCalcutta News.Net - Monday 31st August, 2015 \n \nA consortium of Iranian, Indian and South Korean companies seeks to set up an energy park in Iran's Khuzestan province in a project worth $10 billion, the media reported on Monday. The project will  ... \n   India logs 7 percent growth in first quarter  \nCalcutta News.Net - Monday 31st August, 2015 \n \nThe Indian economy logged a 7-percent growth in the first quarter of the this fiscal, showing signs of slowing vis-a-vis the 7.5-percent expansion in the quarter before. But the growth was much  ... \n   Assam flood situation worsens four lakh hit  \nCalcutta News.Net - Monday 31st August, 2015 \n \nThe flood situation in Assam has deteriorated again, affecting 4.64 lakh people in some major towns and more than 1,000 villages and causing widespread destruction, officials said on Monday. The  ... \n   India-South Africa cricket series named Gandhi-Mandela Series  \nCalcutta News.Net - Monday 31st August, 2015 \n \nThe Board of Control for Cricket in India (BCCI) and Cricket South Africa (CSA) on Monday announced that they will title all future bilateral series between the two countries 'The Mahatma  ... \n   India take vital 243-run lead vs Lanka  \nCalcutta News.Net - Monday 31st August, 2015 \n \nTop order batsman Rohit Sharma struck a much needed half-century to help India gather a vital 243-run second innings lead at lunch on Day 4 of the third and final cricket Test against Sri Lanka at  ... \n   GDP numbers Mixed reaction from India Inc  \nCalcutta News.Net - Monday 31st August, 2015 \n \nThe Indian economy logged 7 percent growth in the first quarter of the this fiscal, according to figures released on Monday, showing signs of slowing vis-a-vis the 7.5 percent expansion in the  ... \n   India trying to get 129 votes to get Hindi as UN language Sushma  \nCalcutta News.Net - Monday 31st August, 2015 \n \nIndia needs 129 votes in the UN to get Hindi included as one of the official languages in the world body, and the financial burden was not a problem, External Affairs Minister Sushma Swaraj said on  ... \n   Mandy Moore to visit India for a cause  \nCalcutta News.Net - Monday 31st August, 2015 \n \nAmerican singer and actress Mandy Moore is counting the days for a visit to India. The global health advocate will be coming to the country early September to support NGO PSI India's Gender Based  ... \n   India Australia to ink agreement in mining sector  \nCalcutta News.Net - Monday 31st August, 2015 \n \nIndia and Australia are likely to sign a bilateral agreement to prepare a roadmap for using latest technologies in exploration during the four-day visit of union Steel and Mines minister Narendra  ... \n   How ozone-tolerant cultivars can boost Indias food security  \nCalcutta News.Net - Tuesday 1st September, 2015 \n \nA new study has suggested that use of ozone-tolerant cultivars can enhance the food security of India. \n   \nUniversity of Eastern study highlighted the current status of ozone research in the  ... \n   All PM Modi said in his speech was me me only me says Nitish  \nCalcutta News.Net - Tuesday 1st September, 2015 \n \nReacting to Prime Minister Narendra Modi address in Bhagalpur, Bihar Chief Minister Nitish Kumar on Tuesday said that there was nothing of substance nor was there any fact in what he said, and all  ... \n   AAP MLA protests against Delhi Govt.  \nCalcutta News.Net - Tuesday 1st September, 2015 \n \nSangam Vihar MLA Pankaj Pushkar on Tuesday protested against the Aam Aadmi Party (AAP) Government in Delhi for neglecting the demands of the people of his constituency on dengue deaths.\n    ... \n   PM Modi demands accountability of Janata Pariwar in Bihar  \nCalcutta News.Net - Tuesday 1st September, 2015 \n \nPrime Minister Narendra Modi on Tuesday demanded that the united opposition of Janata Pariwar should give an account of its 'work' done in Bihar over the last 25 years.\n   \n\"Those who have ruled the  ... \n   Pakistan lost the war with India in 1965 new documents reveal  \nCalcutta News.Net - Tuesday 1st September, 2015 \n \nThe Pakistan Army, which launched an attack in the Chamb- Jaurian sector on September 1, 1965, was on the verge of capturing Akhnoor. The force was commanded by General Akhtar Malik, an Ahmadiya.  ... \n   Nitish asks PM Modi to show moral courage stop chest thumping  \nCalcutta News.Net - Tuesday 1st September, 2015 \n \nBihar Chief Minister Nitish Kumar on Tuesday launched a fresh salvo against Prime Minister Narendra Modi by asking him to 'show moral courage and accept insufficiencies in delivering on old  ... \n   We will see whose record is broken at Bhagalpur says Congress  \nCalcutta News.Net - Tuesday 1st September, 2015 \n \nCongress leader Ashok Chowdhary on Tuesday said that till now the party has broken records with the number of people attending their rallies, and now, they will see whose record is broken at the  ...", "source": "Calcutta News.Net"}