{"published": "2015-09-04T22:26:52Z", "media-type": "News", "title": "Farrah gets a reprieve as Daniel is evicted...but did Celebrity Big Brother go too far this time?", "id": "5630274c-ca45-433f-9615-059eb954c20c", "content": "It was eviction day on Big Brother. And, after a week of pretty much everyone shouting at pretty much everyone else, that meant tough decisions for everyone. \n  \n#CBB eviction night! I can't decide who I want out! I hate/love them all! #evictionnight  #UKvsUSA \n \n— Lorraine (@lorrainemaden) September 4, 2015 \n  \nBut before we got to the eviction, we had to suffer through some more shouting. \n \nBig Brother set up a high tea, in which some of the American “servants” were given the task of making the British “royals” angry – leading to one of the most hateful segments of a TV show ever seen. \n \nWith Farrah in attendance, there was never any doubt they would succeed. She was throwing around some vile and idiotic insults at anyone and everyone – “retard” and “gay homo” were among the highlights. \n  \nFarrah overstepped the mark! Task or not! #CBB \n \n— Big Brother 24/7 (@bbuk247) September 4, 2015 \n  \nI know that Farrah is on a task, but that was too far and personal. #CBB \n \n— Foreverbbuk (@foreverbbuk) September 4, 2015 \n  \nFarrah may be on a task but I can't help but feel she's letting out her true feelings here. She is vile. There's a line. #CBB \n \n— Big Brother Superfan (@BB_Superfan) September 4, 2015 \n  \nTask or no task….. #CBBFarrah is disgusting and foul #CBB  #BBUK \n \n— Phil (@Philxxx2010) September 4, 2015 \n \nIt was horrible. Unless you were this guy. \n  \nThat was the best and funniest 5 minutes of #CBB ever  \n \n— Garry Walpole (@GJ69) September 4, 2015 \n \nThen there was a clip of Farrah being reminded of the rules about language in the diary room and apologising. And that was it. \n  \n#CBBUK so Farrah just has to say she's sorry and we're supposed to be okay about it? Fuck that homophobia is not okay & #CBB encouraged it \n \n— Molly (@__Molly) September 4, 2015 \n  \nAre you fucking serious? That's all she gets? Big Brother is only politically correct when it wants to be. #CBB  #CBBUK \n \n— J.Σ (@jayeddyy) September 4, 2015 \n  \nA new all-time low #CBB  #channel5 \n \n— Tim West (@TimDWest) September 4, 2015 \n  \nCan't believe Big Brother has just promoted bullying, shut this shower of shit down #CBB  #ofcom \n \n— Nathan Le Prevost (@nathanleprevost) September 4, 2015 \n  \nwhy is homophobic abuse acceptable on C5? Would Farrah be allowed to use racist abuse and stereotypes as part of \"a task\"disgusting! #CBBUK \n \n— Gary Bardsley (@GaryBardsley) September 4, 2015 \n \nYou want a break from the vitriol? \n \nOkay, let’s pause for a moment to take in the horrifying sight of Stevi and Chloe fumbling under the covers. \n  \nStevi and Chloe though #CBB  pic.twitter.com/w5Y3k7nYn5 \n \n— Captain Kidd (@kidd_kong78) September 4, 2015 \n  \nThere goes tonight's supper #Bleeuuggh  #CBB  #Stevi  #Chloe \n \n— MISSYOUSTEVIE❤️⚽️ (@Ellabellatwits8) September 4, 2015 \n  \nNightly Stevi & Chloe make me want to vom tweet  #CBB \n \n— H.. (@Heather_1705) September 4, 2015 \n \nBut then it was eviction time, and surely it was just a case of getting the formalities out of the way, saying Farrah’s name and getting her out of all of our lives for good. \n  \nAww, it's Daniel! Give him a RT to say goodbye. #CBB  pic.twitter.com/XVXUgWXPH2 \n \n— Big Brother UK (@bbuk) September 4, 2015 \n \nWait, what? When you said Farrah then, it sounded a lot like Daniel. \n  \nOur Baldwin brother's time in the House is up – check out his top moments: http://t.co/gINqkSV29e  #CBB  pic.twitter.com/dlwUBo16lZ \n \n— Big Brother UK (@bbuk) September 4, 2015 \n \nNo, no, no. This will never do. \n  \nNooooo why isn't Farrah out ffs #CBBUK \n \n— Hayley Whitchurch (@haywhitchurch) September 4, 2015 \n  \nI thought Farrah was a gonna! #CBB  \n \n— Tris Morris (@bigstraps) September 4, 2015 \n  \nHow the fuck is Farrah still in there??? #CBBFarrah \n \n— Owen Jones (@owen__jones__) September 4, 2015 \n  \nHow has Farrah not been evicted?! #CBBFarrah  #CBB  #getherout  \n \n— Victoria Clement (@vikiclement2) September 4, 2015 \n \nAnd how did this happen? This happened because people were voting on who should stay, rather than voting for who to evict. \n  \n#CBB clearly people have got confused with vote to stay instead of vote to leave #cbbdaniel  #CBBUK  #cbbfarrah is a tosspot \n \n— kafrin. (@stylegraduate) September 4, 2015 \n \nBut then there were also a lot of people saying things like this. \n  \nSo glad @F1abraham is still in she Sure making big brother entertaining and got the hots for james #CBBUK  #Farrah \n \n— Stephanie Thomas (@St3phani3jayn3) September 4, 2015 \n \nSo Daniel left… \n (Ian West/PA) \n…and he was funny and charming in his exit interview… \n  \nAhh! Daniel is so funny, Shame we only get to see this on his eviction night #CBB \n \n— Eliza (@Elizuch1) September 4, 2015 \n \nhttps://twitter.com/__chxrll/status/639910710001201152 \n  \nDaniel's impression of Chloe is funny & accurate  …He seems a nice guy, shame he's out! #CBB \n \n— Rachel S (@rach22uk) September 4, 2015 \n   \n Share article  \n    \n…but he’s gone. Forget about him. It’s back to the Farrah and Janice show. Good luck, fellow viewers.", "source": "Northwich Guardian"}