{"published": "2015-09-15T06:30:31Z", "media-type": "Blog", "title": "Students trying to rent apartments for papal visit", "id": "74434067-6312-472a-9011-5208e88e9d45", "content": "News Community Students trying to rent apartments for papal visit Landlords are discouraging tenants, but said they can’t monitor every case. by Julie Christie 15 September 2015 With the papal visit drawing closer, some students are renting out their apartments to the influx of tourists who will flock to the city. City officials said about 1.5 million people are estimated to come to Philadelphia for the week-long event. Pope Francis is arriving for the World Meeting of Families, an event run by the Catholic Church featuring speakers on a variety of family-related issues. More than 110 properties around Main Campus are up for rent on Airbnb, an online platform that allows rental of living space on a nightly basis. Prices range from $25 to $3,000 per night. Some students are offering up entire apartments to visitors, while others are renting out couches in their living rooms. Prices are higher at locations closer to the Benjamin Franklin Parkway, where the pontiff will celebrate Mass on Sept. 27. One five-bedroom property near Drexel University  costs $2,150 a night. The average apartment, however, comes out to only $55 more expensive than apartments in the Temple area. Areas near Drexel and Temple have several apartments listed specifically for the papal visit. Most descriptions include assets the apartments can provide for visitors, such as proximity to events and public transportation. Pope Francis is expected to appear at three events over the Sept. 26–27 weekend. The events are located at Independence Hall and the Festival of Families on the Benjamin Franklin Parkway. Due to the fact that Airbnb pays its hosts directly to their bank accounts, some landlords may be unaware of what their tenants are doing. Star Bocasan Little, the marketing manager for Temple Town Realty, said renters can have guests, and may make the decision to charge those guests on their own. “It’s technically not in the lease,” she explained. “They don’t have to tell us and we can’t keep track.” Bocasan said as long as there are no complaints and they “don’t have to go knocking on doors,” the company does not monitor the tenants’ actions. Depending on the lease, some students can rent out their spaces, while others are held to a more restricted contract. The View at Montgomery rents most of its spaces to students who attend Temple, but does not allow tenants to rent out apartments to others for short periods of time. “If we find out about it, we tell the renter it’s not allowed and take away their guest privilege,” said Genna Vakin, a community assistant for The View at Montgomery. The View policy dictates that renters are allowed to have a guest stay for three consecutive nights, but must be with the guest at all times while they are in the building. Julie Christie can be reached at  julie.christie@temple.edu or Twitter @ChristieJules.", "source": "The Temple News"}