{"published": "2015-09-08T16:21:11Z", "media-type": "News", "title": "Telit Communications Plc insider Testa,Enrico (Chicco) Sells 500,000 Shares (TCM)", "id": "3b603c0e-8c11-4092-9066-0e0ccbf2b341", "content": "Telit Communications Plc (LON:TCM) insider Testa,Enrico (Chicco) sold 500,000 shares of the firm’s stock in a transaction that occurred on Tuesday, September 8th. The stock was sold at an average price of GBX 345 ($5.24), for a total transaction of £1,725,000 ($2,619,589.98). \n\nTelit Communications Plc (LON:TCM) traded up 0.29% during midday trading on Tuesday, hitting GBX 344.00. 147,732 shares of the stock traded hands. Telit Communications Plc has a 1-year low of GBX 190.00 and a 1-year high of GBX 357.50. The company has a 50-day moving average of GBX 334.06 and a 200-day moving average of GBX 272.01. The stock’s market cap is GBX 395.68 million. \n\nTCM has been the topic of a number of research analyst reports. Berenberg Bank initiated coverage on shares of Telit Communications Plc in a report on Tuesday, June 16th. They set a “buy” rating and a GBX 410 ($6.23) target price on the stock. Canaccord Genuity lifted their price target on shares of Telit Communications Plc from GBX 325 ($4.94) to GBX 393 ($5.97) and gave the stock a “buy” rating in a research note on Monday, June 29th. Finally, Morgan Stanley boosted their target price on shares of Telit Communications Plc from GBX 290 ($4.40) to GBX 380 ($5.77) and gave the stock an “overweight” rating in a research report on Friday, August 7th. \n\nTelit Communications Plc (LON:TCM) is a global wireless technology company. The Company is engaged in developing, manufacturing and marketing communication modules, which enable machines, devices and vehicles to communicate, through cellular wireless networks. It develops, manufactures and markets global system for mobile communications (GSM)/general packet radio service (GPRS), code division multiple access (CDMA), universal mobile telecommunications system (UMTS)/ high speed packet access (HSPA), short range radio frequency (RF), including ZigBee and global positioning system (GPS) communication modules for machine-to-machine (m2m) applications. Its subsidiaries include Telit RF Technology S.A.S., Telit Wireless Solutions Srl, Telit Communications SpA and Telit Wireless Solutions (Pty) Ltd. In March 2011, the Company completed the acquisition of Motorola m2m business. On July 2011, the Company acquired GlobalConect Ltd. In January 2012, it acquired Navman Wireless OEM Solutions LP. \n\nReceive News & Ratings for Telit Communications Plc Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Telit Communications Plc and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News"}