{"published": "2015-09-15T04:51:40Z", "media-type": "News", "title": "County  supports suicide prevention  efforts", "id": "84f06db7-18a9-4e30-9bf3-ffb2b864a1d5", "content": "One Maury County organization celebrated a decade of work with a mayoral proclamation recognizing its mission and September as “Suicide Prevention Awareness” month. \n \nCowboy Up is a Maury County Junior Auxiliary service project that focuses on prevention of youth suicide through educational programs. The project began in 2005 as the brainchild of local educator Regina Peery. \n \nMaury County Mayor Charlie Norman signed the document at the courthouse last with Cowboy Up and JA members. \n \nThe proclamation states suicide is “one of the most disruptive and tragic events a family and a community can experience.” There have been 69 recorded suicides in Maury County in the past five years, including three that were between the ages of 10 and 19, according to the document. \n \n“Whereas, public awareness of the terrifying problem is the key to preventing further suffering and loss of life; and the risk for human self-destruction can be reduced through awareness, education and treatment; and as the highest risk for suicide is among the survivors of those who died by suicide or those who have attempted suicide,” it reads. \n \nThe document goes on to tout Cowboy Up’s role in the community and declares September as Suicide Prevention Month in the county. \n \nFor Peery, Cowboy Up has a personal meaning. Her brother, Marcus, committed suicide in 2003, and she founded the organization in 2005 in his memory. The name is based on a saying he used. \n \nPeery said she wants to do anything in her power to prevent another family from going through the “wrath” of suicide. \n \n“I hope that this creates more awareness for people who may be having suicidal feelings to know that there is help available and for families who have been touched by suicide,” she said. “We want them to know that they are not alone.” \n \nThe program has garnered attention from across the state. The Tennessee Suicide Prevention Network honored Peery with an award in 2013. \n \nCowboy Up is presented to all seventh grade students in Maury County and other school districts. The group’s motto is taken from her father’s words. \n \n“If we help one family, one child, then it is worth everything that we put into it,” Peery said. \n \nSuicide is the second-leading cause of death among youth and young adults ages 15-24 in Tennessee and for the entire United States, according to the TSPN. There were 945 recorded suicide deaths in the state in 2014, at a rate of 14.4 per 100,000 people, according to the organization. \n \nCowboy Up is a project of Junior Auxiliary members, the Maury County school system, the Jason Foundation, Tennessee Suicide Prevention Network and the Maury County Sheriff Reserves. \n \n“It has taken a lot of folks to make it successful, and to be able to celebrate that today and acknowledge that and create awareness, it means more than I can fit into words,” Peery said. \n \nFor more information, about Cowboy Up visit https://www.facebook.com/CowboyUpJA . For more information about TSPN call (615) 297-1077 or email tspn@tspn.org .", "source": "Columbia Daily Herald"}