{"published": "2015-09-11T09:31:03Z", "media-type": "News", "title": "Amgen Submits Application To FDA For New Delivery Option For Monthly Administration Of Repatha Evolocumab", "id": "4a4dac34-328b-4bc3-a598-6f9f536c5bac", "content": "THOUSAND OAKS, Calif. , Sept. 11, 2015 /PRNewswire/ --  Amgen (NASDAQ:AMGN) today announced the submission of an application to the U.S. Food and Drug Administration ( FDA ) seeking approval of a single-dosing option for the monthly administration of Repatha TM (evolocumab) Injection, allowing the 420 mg monthly dose to be administered as a single injection. Approved by the FDA on Aug. 27, 2015 , Repatha is a human monoclonal antibody that inhibits proprotein convertase subtilisin/kexin type 9 (PCSK9). PCSK9 is a protein that reduces the liver's ability to remove low-density lipoprotein cholesterol (LDL-C), or \"bad\" cholesterol, from the blood. 1 \n Related Biotechnology, Pharmaceutical and Healthcare News   \nRepatha is approved as an adjunct to diet and maximally tolerated statins in patients with heterozygous familial hypercholesterolemia (HeFH) or clinical atherosclerotic cardiovascular disease (ASCVD), who require additional lowering of LDL-C; and as an adjunct to diet and other LDL-lowering therapies for the treatment of patients with homozygous familial hypercholesterolemia (HoFH), who require additional lowering of LDL-C. The effect of Repatha on cardiovascular morbidity and mortality has not been determined.  \n \n\"We are very excited about the recent approval of Repatha in the U.S. as a new treatment option for patients who are in need of lowering their LDL cholesterol,\" said Sean E. Harper, M.D., executive vice president of Research and Development at Amgen. \"In addition to the SureClick ® autoinjector, we are developing this monthly single injection to provide patients with another option to administer Repatha every month. Patients who are in need of lowering their cholesterol levels are often on more than one medication and some may prefer a single-dose option for receiving Repatha once monthly.\" \n \nRepatha is available as a single-use 140 mg/mL prefilled SureClick autoinjector or prefilled syringe that patients can self-administer at the recommended dose for adults of 140 mg every two weeks or 420 mg once a month. For patients with HoFH, the recommended dose is 420 mg once a month. \n \nAbout High Cholesterol \n \nElevated low-density lipoprotein cholesterol (LDL-C) is an abnormality of cholesterol and/or fats in the blood, and is recognized as a major risk factor for cardiovascular disease. 2,3 In the U.S., there are approximately 11 million people with atherosclerotic cardiovascular disease (ASCVD) and/or familial hypercholesterolemia (FH), who have uncontrolled levels of LDL-C over 70 mg/dL, despite treatment with statins or other cholesterol-lowering therapies. 4,5  Familial hypercholesterolemia is caused by genetic mutations that lead to high levels of LDL-C at an early age. 6  It is estimated that one million people in the U.S. have FH (heterozygous and homozygous forms), yet less than one percent are diagnosed. 7 \n \nAbout Repatha TM (evolocumab) \n \nRepatha TM (evolocumab) is a human monoclonal antibody that inhibits proprotein convertase subtilisin/kexin type 9 (PCSK9). 1 Repatha binds to PCSK9 and inhibits circulating PCSK9 from binding to the low-density lipoprotein (LDL) receptor (LDLR), preventing PCSK9-mediated LDLR degradation and permitting LDLR to recycle back to the liver cell surface. By inhibiting the binding of PCSK9 to LDLR, Repatha increases the number of LDLRs available to clear LDL from the blood, thereby lowering LDL-C levels. 8 \n \nGLAGOV, the intravascular ultrasound study, is underway to determine the effect of Repatha on coronary atherosclerosis in approximately 950 patients undergoing cardiac catheterization to test the hypothesis of robust LDL-C reduction leading to a reduction or a change in the build-up of plaque in the arteries. Results from the GLAGOV study are expected in 2016. \n \nThe FOURIER outcomes trial is designed to evaluate whether treatment with Repatha in combination with statin therapy compared to placebo plus statin therapy reduces the risk of recurrent cardiovascular events in patients with high cholesterol and clinically evident cardiovascular disease and completed patient enrollment in June 2015 . Results from the approximately 27,500-patient FOURIER study are expected no later than 2017 (event-driven). \n \nImportant U.S. Product Information \n \nRepatha is indicated as an adjunct to diet and: \n Maximally tolerated statin therapy for treatment of adults with heterozygous familial hypercholesterolemia (HeFH) or clinical atherosclerotic cardiovascular disease (ASCVD), who require additional lowering of low-density lipoprotein cholesterol (LDL-C)  Other LDL-lowering therapies (e.g., statins, ezetimibe, LDL apheresis) in patients with homozygous familial hypercholesterolemia (HoFH) who require additional lowering of LDL-C \nThe effect of Repatha on cardiovascular morbidity and mortality has not been determined. \n \nThe safety and effectiveness of Repatha have not been established in pediatric patients with HoFH who are younger than 13 years old. \n \nThe safety and effectiveness of Repatha have not been established in pediatric patients with primary hyperlipidemia or HeFH. \n \nImportant Safety Information \n \nRepatha™ is contraindicated in patients with a history of a serious hypersensitivity reaction to Repatha. Hypersensitivity reactions (e.g. rash, urticaria) have been reported in patients treated with Repatha, including some that led to discontinuation of therapy. If signs or symptoms of serious allergic reactions occur, discontinue treatment with Repatha, treat according to the standard of care, and monitor until signs and symptoms resolve. \n \nThe most common adverse reactions (>5% of Repatha-treated patients and more common than placebo) were: nasopharyngitis, upper respiratory tract infection, influenza, back pain, and injection site reactions.  \n \nIn a 52-week trial, adverse reactions led to discontinuation of treatment in 2.2% of Repatha-treated patients and 1% of placebo-treated patients. The most common adverse reaction that led to Repatha treatment discontinuation and occurred at a rate greater than placebo was myalgia (0.3% versus 0% for Repatha and placebo, respectively). \n \nAdverse reactions from a pool of the 52-week trial and seven 12-week trials, included: \n \nLocal injection site reactions that occurred in 3.2% and 3.0% of Repatha-treated and placebo-treated patients, respectively. The most common injection site reactions were erythema, pain, and bruising. The proportions of patients who discontinued treatment due to local injection site reactions in Repatha-treated patients and placebo-treated patients were 0.1% and 0%, respectively.  \n \nAllergic reactions occurred in 5.1% and 4.6% of Repatha-treated and placebo-treated patients, respectively. The most common allergic reactions were rash (1.0% versus 0.5% for Repatha and placebo, respectively), eczema (0.4% versus 0.2%), erythema (0.4% versus 0.2%), and urticaria (0.4% versus 0.1%). \n \nNeurocognitive events were reported in less than or equal to 0.2% in Repatha-treated and placebo-treated patients. \n \nIn a pool of placebo- and active-controlled trials, as well as open-label extension studies that followed them, a total of 1,609 patients treated with Repatha had at least one LDL‑C value < 25 mg/dL. Changes to background lipid-altering therapy were not made in response to low LDL-C values, and Repatha dosing was not modified or interrupted on this basis. Although adverse consequences of very low LDL-C were not identified in these trials, the long-term effects of very low levels of LDL-C induced by Repatha are unknown. \n \nMusculoskeletal adverse reactions were reported in 14.3% of Repatha-treated patients and 12.8% of placebo-treated patients. The most common adverse reactions that occurred at a rate greater than placebo were back pain (3.2% versus 2.9% for Repatha and placebo, respectively), arthralgia (2.3% versus 2.2%), and myalgia (2.0% versus 1.8%). \n \nIn 49 patients with homozygous familial hypercholesterolemia studied in a 12-week, double-blind, randomized, placebo-controlled trial, 33 patients received 420 mg of Repatha subcutaneously once monthly. The adverse reactions that occurred in at least 2 (6.1%) Repatha-treated patients and more frequently than in placebo-treated patients, included upper respiratory tract infection (9.1% versus 6.3%), influenza (9.1% versus 0%), gastroenteritis (6.1% versus 0%), and nasopharyngitis (6.1% versus 0%). \n \nRepatha is a human monoclonal antibody. As with all therapeutic proteins, there is a potential for immunogenicity with Repatha. \n \nAbout Amgen Cardiovascular \n \nBuilding on more than three decades of experience in developing biotechnology medicines for patients with serious illnesses, Amgen is dedicated to addressing important scientific questions to advance care and improve the lives of patients with cardiovascular disease, the leading cause of morbidity and mortality worldwide. 9 Amgen's research into cardiovascular disease, and potential treatment options, is part of a growing competency at Amgen that utilizes human genetics to identify and validate certain drug targets. Through its own research and development efforts, as well as partnerships, Amgen is building a robust cardiovascular portfolio consisting of several approved and investigational molecules in an effort to address a number of today's important unmet patient needs, such as high cholesterol and heart failure. \n \nAbout Amgen \n \nAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology. \n \nAmgen focuses on areas of high unmet medical need and leverages its biologics manufacturing expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential. \n \nFor more information, visit www.amgen.com and follow us on www.twitter.com/amgen . \n \nForward-Looking Statements \n \nThis news release contains forward-looking statements that are based on management's current expectations and beliefs and are subject to a number of risks, uncertainties and assumptions that could cause actual results to differ materially from those described. All statements, other than statements of historical fact, are statements that could be deemed forward-looking statements, including estimates of revenues, operating margins, capital expenditures, cash, other financial metrics, expected legal, arbitration, political, regulatory or clinical results or practices, customer and prescriber patterns or practices, reimbursement activities and outcomes and other such estimates and results. Forward-looking statements involve significant risks and uncertainties, including those discussed below and more fully described in the Securities and Exchange Commission (SEC) reports filed by Amgen, including Amgen's most recent annual report on Form 10-K and any subsequent periodic reports on Form 10-Q and Form 8-K. Please refer to Amgen's most recent Forms 10-K, 10-Q and 8-K for additional information on the uncertainties and risk factors related to our business. Unless otherwise noted, Amgen is providing this information as of Sept. 11, 2015 , and expressly disclaims any duty to update information contained in this news release. \n \nNo forward-looking statement can be guaranteed and actual results may differ materially from those we project. Discovery or identification of new product candidates or development of new indications for existing products cannot be guaranteed and movement from concept to product is uncertain; consequently, there can be no guarantee that any particular product candidate or development of a new indication for an existing product will be successful and become a commercial product. Further, preclinical results do not guarantee safe and effective performance of product candidates in humans. The complexity of the human body cannot be perfectly, or sometimes, even adequately modeled by computer or cell culture systems or animal models. The length of time that it takes for us to complete clinical trials and obtain regulatory approval for product marketing has in the past varied and we expect similar variability in the future. We develop product candidates internally and through licensing collaborations, partnerships and joint ventures. Product candidates that are derived from relationships may be subject to disputes between the parties or may prove to be not as effective or as safe as we may have believed at the time of entering into such relationship. Also, we or others could identify safety, side effects or manufacturing problems with our products after they are on the market. Our business may be impacted by government investigations, litigation and products liability claims. We depend on third parties for a significant portion of our manufacturing capacity for the supply of certain of our current and future products and limits on supply may constrain sales of certain of our current products and product candidate development. \n \nIn addition, sales of our products are affected by the reimbursement policies imposed by third-party payors, including governments, private insurance plans and managed care providers and may be affected by regulatory, clinical and guideline developments and domestic and international trends toward managed care and healthcare cost containment as well as U.S. legislation affecting pharmaceutical pricing and reimbursement. Government and others' regulations and reimbursement policies may affect the development, usage and pricing of our products. In addition, we compete with other companies with respect to some of our marketed products as well as for the discovery and development of new products. We believe that some of our newer products, product candidates or new indications for existing products, may face competition when and as they are approved and marketed. Our products may compete against products that have lower prices, established reimbursement, superior performance, are easier to administer, or that are otherwise competitive with our products. In addition, while we routinely obtain patents for our products and technology, the protection offered by our patents and patent applications may be challenged, invalidated or circumvented by our competitors and there can be no guarantee of our ability to obtain or maintain patent protection for our products or product candidates. We cannot guarantee that we will be able to produce commercially successful products or maintain the commercial success of our existing products. Our stock price may be affected by actual or perceived market opportunity, competitive position, and success or failure of our products or product candidates. Further, the discovery of significant problems with a product similar to one of our products that implicate an entire class of products could have a material adverse effect on sales of the affected products and on our business and results of operations. Our efforts to integrate the operations of companies we have acquired may not be successful. We may experience difficulties, delays or unexpected costs and not achieve anticipated benefits and savings from our ongoing restructuring plan.  Our business performance could affect or limit the ability of our Board of Directors to declare a dividend or their ability to pay a dividend or repurchase our common stock. \n \nThe scientific information discussed in this news release related to our new drug presentation is preliminary and investigative. Such new drug presentation is not approved by the U.S. Food and Drug Administration (FDA) or the European Medicines Agency (EMA), and no conclusions can or should be drawn regarding the safety or effectiveness of the new drug presentation. \n \nCONTACT: Amgen, Thousand Oaks  \nKristen Davis , 805-447-3008 (media) \nKristen Neese , 805-313-8267 (media) \nArvind Sood , 805-447-1060 (investors) \n \nReferences \n Amgen Data on File, Investigator Brochure.  World Health Organization. Quantifying Selected Major Risks to Health. In: The World Health Report 2002 - Reducing Risks, Promoting Healthy Life. Geneva . 2002:49-97.  Merck Manuals website. http://www.merckmanuals.com/professional/endocrine_and_metabolic_disorders/lipid_disorders/dyslipidemia.html . Accessed September 2015 .  Centers for Disease Control and Prevention. Vital signs: prevalence, treatment, and control of high levels of low-density lipoprotein cholesterol. United States , 1999–2002 and 2005–2008. MMWR . 2011;60(4):109–14.  Amgen Data on File.  National Human Genome Research Institute. Learning About Familial Hypercholesterolemia. http://www.genome.gov/25520184 . Accessed September 2015 .  Nordestgaard BG, Chapman MJ, Humphries SE, et al. Familial Hypercholesterolaemia is Underdiagnosed and Undertreated in the General Population: Guidance for Clinicians to Prevent Coronary Heart Disease. Eur Heart J . 2013;34:3478-3490.  Repatha TM U.S. Prescribing Information. Amgen.  World Health Organization. Cardiovascular diseases (CVDs) fact sheet. http://www.who.int/mediacentre/factsheets/fs317/en/ . Accessed September 2015 . \nLogo - http://photos.prnewswire.com/prnh/20081015/AMGENLOGO  \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/amgen-submits-application-to-fda-for-new-delivery-option-for-monthly-administration-of-repatha-evolocumab-300141498.html \n \nSOURCE  Amgen \n NEXT ARTICLE  More From BioPortfolio on \"Amgen Submits Application To FDA For New Delivery Option For Monthly Administration Of Repatha™ (Evolocumab)\"", "source": "BioPortfolio"}