{"published": "2015-09-22T19:21:59Z", "media-type": "News", "title": "Middle march", "id": "097b9deb-15f4-4237-a15a-1ceb892699b7", "content": "The new Alfa Romeo is a throwback to the Italian company’s great racing days — a lightweight, turbo-charged, four-cylinder sports car, stripped to the essentials. Have they gone too far? This car is a real hooligan. \n\nPropelled by 237 horsepower and 258 pound-feet of torque, the mid-engine, rear-wheel-drive 4C Spider goes from zero to 60 in 4.1 seconds and achieves a top speed of 160 mph. It sits low and squat, a carbon fibre tub with a grumpy, growly face. Nothing is wasted. It’s gorgeous, but forget the frills. \n\nInside, the minimalism is even more apparent. The dash is spare. There’s no infotainment system. There’s no glove compartment, no centre console, and the interior storage space is limited to a tiny cubby hidden behind the cup holder. Even the hard, narrow seats, which adjust manually, seem designed to make you feel as if you’re at the track. \n\nThe engine is loud. The manual rack-and-pinion steering is stiff and twitchy. The ride is bumpy and abrasive. Knocking around town, the 4C is hard work. \n\nBut the car finds itself under acceleration. The steering steadies and the stiff suspension start making sense. And that noisy, raspy engine turns out to be fast — wicked fast. The turbo feels like a shot of adrenaline. \n\nAlfa Romeo, now owned by the giant Fiat Chrysler corporation, is hoping to find a middle ground between its siblings Fiat and Ferrari. The company is making a concerted effort to re-enter the American market, starting with this crop-top sports car. \n\nIt’s clearly not for everybody and maybe almost nobody. This car is clearly more about brand image than volume sales. First of all, the driver will have to be nimble. Getting down into the 4C requires some agility. Getting out, more so. \n\nTurning it into a convertible is complicated too. The canvas T-top, which is held in place by four levers and two bolts, rolls up and tucks into the very small trunk space. But putting the top back in place, and managing those four levers and two bolts, is more hard work. Bring two people, four hands and your engineering degree. \n\nSome devotees of the raw, unrefined sports car experience may balk at the automatic transmission. But the 4C isn’t offered with a manual transmission and won’t be, the company says, because the automatic transmission, and its paddle shifters, does a better job of shifting gears, and because too few people will order the car with a stick shift. \n\nIndeed, the paddle shifters do mean the manual transmission isn’t a necessity. The rev-matching downshift function works beautifully, and with the exception of a rather tall first gear, and the resulting tendency of the 4C to whine a bit at take-off, the automatic transmission maximises the horsepower. \n\nBut it’s hard not to imagine purists complaining that they want their pure sports car in its pure form. The manual transmission version of the new Mazda MX-5 Miata, for example, accounts for nearly half of all sales, the company said at the recent introduction of the new version of its classic two-seater though it could be argued that the smaller motor in that drop-top requires a manual where the larger, hotter Alfa motor does not. \n\nFor fuel economy, Alfa Romeo says the 4C gets 24 miles per gallon in the city and 34 on the highway. (Real-world mileage will certainly be less for drivers who put the car to its intended purpose.) \n\nA harder number for prospective buyers will be the price. The 4C starts at $65,495 and, with the track package, special wheels and custom paint on this model, can cost as much as $77,000. \n\nThat’s not a lot less than it costs to get into a comparably fast European sports car, like those made by Audi, BMW, Mercedes or Porsche which don’t require the same sacrifices in daily driver comfort. The Boxster GTS costs almost the same as the 4C, produces just as much power and handles as well or better. So does an F-Type Jaguar. \n\nThe anticipated new Fiat 124 Spider, which will have the same Japan-built chassis and some drive-train elements as the Mazda MX-5 but will have its own Italian-made bodywork, will cost considerably less than a 4C when it arrives some time in late 2016 or early 2017. \n\nThe drivers caught in this Spider’s web are going to be real enthusiasts, who remember and love the great Alfa Romeo racing history, and want to be part of the company’s push to get back on American roads. \n\nTribune News Service", "source": "The Gulf Today"}