{"published": "2015-09-17T05:00:00Z", "media-type": "News", "title": "Trainers frustrated with lack of top-level sprinting options in Sydney", "id": "fbc5dbfa-175e-4ccf-ad71-2566ff3f02d9", "content": "Frustrated trainers have taken a swipe at officials about the absence of a group 1 sprint during Sydney's spring carnival before a star-studded cast assembles for The Shorts at Randwick. Frustrated trainers have taken a swipe at officials about the absence of a group 1 sprint during Sydney's spring carnival before a star-studded cast assembles for The Shorts at Randwick. Anointed the world's best sprinter by his trainer Joe Pride, the resuming Terravista heads up a mouth-watering group 2 dash over 1100 metres on Saturday.\n\nBut Terravista's cameo in Sydney could be limited to one – maybe two – starts before being whisked to Melbourne for the spring riches on offer down south.\n\nFellow Warwick Farm trainer Gary Portelli will saddle up Rebel Dane, one of three group 1 winners in The Shorts field, and remains perplexed that he will be forced to head across the border in search of another major.\n\n\"I can't understand why we only have two group 1 [open-age sprints] in Sydney [all season],\" Portelli said.\n\n\"All these stallions get retired to stud because there aren't that many options after their three-year-old group 1s. There are only a few on as four-year-olds. We breed sprinters – that's all we do – but we don't put races on for them.\n\n\"We seem to be putting on all this prizemoney for stayers when there's probably two or three chances in a race, whereas in this race the winner could come from anywhere.\"\n\nThe state's premier trainer, Chris Waller, who will resume Delectation in The Shorts, said he was \"amazed\" by the absence of a short-course group 1 in Sydney during the spring.\n\n\"Look at this race ... it is a group 1-type of field; gee it will be tough to win,\" Waller said.\n\nRebel Dane ($9) and Delectation ($13) occupy the fifth and sixth lines of betting with Ladbrokes for The Shorts, with Terravista a dominant $2.60 favourite.\n\nPortelli is bullish about his entire's chances after a throat operation and sharp barrier trial, but is mindful he has never run his stable star over anything less than 1200 metres in his career.\n\n\"That's why I've kept him fresh and haven't given him two hard trials,\" he said. \"Hopefully he will be warming up late and going quick enough to catch them up in front.\n\n\"Physically [the throat operation] has made a huge difference to him. He's a much happier horse and he looks bigger and stronger. He weighs 494 kilos now and that's something he's never weighed going into a race first-up. He's normally around 480 [kilograms]. He's ready to run a big race on the weekend.\"\n\nWaller will send Delectation back to the races on the back of a couple of trials after the gelding was a luckless ninth in the Stradbroke Handicap during the winter.\n\n\"He will have to be near his top to match it with some of these, but we are happy with him and he usually races well fresh,\" Waller said.\n\nwith Chris Roots The story first appeared on The Sydney Morning Herald.", "source": "Hunter Valley News"}