{"published": "2015-09-23T15:48:39Z", "media-type": "News", "title": "Pogba's agent, former manager argue about his exit from Manchester United", "id": "ae1a39c9-df0c-4f8e-bdf1-1a1143b2b8dd", "content": "Juventus midfielder Paul Pogba is caught in the middle of a war of words as his former Manchester United manager, Sir Alex Ferguson, and his current agent, Mino Raiola, exchange fire regarding his 2012 exit from Old Trafford. \n\nFerguson wrote that he and Mino Raiola were like \"were like oil and water\" in his latest book, \"Leading,\" adding: \"There are one or two football agents I simply do not like. And Mino Raiola, Paul Pogba's agent, is one of them. I distrusted him from the moment I met him.\" \n\nFerguson said contract negotiations with Pogba fell apart when Raiola became involved in the proceedings. In his book, Ferguson outlined the terms of the deal, and alleges that Raiola was responsible for Pogba wanting away instead of staying at Old Trafford. \n\n\"We had Paul under a three-year contract, and it had a one-year renewal option which we were eager to sign,\" Ferguson wrote. \"But Raiola suddenly appeared on the scene and our first meeting was a fiasco. From then on, our goose was cooked because Raiola had been able to ingratiate himself with Paul and his family and the player signed with Juventus.\" \n\nRaiola responded that Ferguson, now as he did then, is forgetting the key figure in this story: Pogba himself. \n\n\"Seeing what he's written in his book, Ferguson has confirmed that he still does not know who Pogba is,\" Raiola told reporters . \"I don't see anything bad about me in what he said. In fact, coming from him it's a compliment. \n\n\"If Mr. Ferguson doesn't like me, it's a compliment because it means that I'm doing my job well. I need to do the best I can for my clients, not for coaches or managers.\" \n\nRaiola says that he had the best interests of the young French midfielder in mind. \n\n\"If I'd not taken my interests seriously, I would have tried to convince Paul to stay in Manchester to protect my relationship with United in view of future deals,\" Raiola said. \"But I'm only interested in what's good for Paul. Maybe Ferguson only likes those who do what he asks. Anyway, from the many talks we had in the past, it didn't seem to me like he really liked Pogba.\" \n\nFerguson retired in 2013, and Pogba went on to establish himself as a key figure for Juventus. But, Raiola says, the memories live on, and the real story will rest with them alone, at least for now. \n\n\"I don't have a bad memory of Ferguson,\" Raiola said. \"He was a great manager, but even the greatest managers, in my opinion, can make mistakes. I'll keep the truth to myself. One day, if he likes, Paul will reveal all. It's a fact, though, that Ferguson didn't believe in the player while others did, starting with Juve.\" \n\nCopyright © 2015 Score Media Ventures Inc. All rights reserved. Certain content reproduced under license.", "source": "TheScore.com"}