{"published": "2015-09-14T22:12:31Z", "media-type": "News", "title": "Jeremy Corbyn leaves door open over EU exit", "id": "1f91339c-5648-4c1f-9034-a8215eac19d7", "content": "Jeremy Corbyn has left the door open for Labour to campaign to leave the European Union as he addressed the party's MPs and peers for the first time as leader. \n \nLabour \"can't just give (David) Cameron a blank cheque\" and any changes the PM secures \"must be the right ones\", the left-winger told the Parliamentary Labour Party (PLP). \n \nMr Corbyn arrived at the PLP to silence, rather than the traditional table thumping a newly elected leader is often greeted with, and faced some \"hostile\" questions during the meeting. \n \nShadow foreign secretary Hilary  Benn earlier attempted to calm fears among many Labour MPs that Ed Miliband's successor could campaign for Britain to leave the EU in the in/out referendum expected next year. \n \nBut Mr Corbyn told MPs the Prime Minister \"can't just come back with whatever\", a spokeswoman said. \n \nAsked if he ruled out campaigning to leave in all circumstances, she added: \"He is saying we have to be really clear about the changes we want to see.\" \n \nMr Corbyn did not directly address the issue of military intervention in Syria, the spokeswoman said. \n \n\"On the Syria issue, he said we need to make sure we are all engaging with other countries, and with things like Isis we need to be making sure we are cutting off their arms and their supplies,\" she added. \n   Promoted stories   \nMr Corbyn, the Stop the War Coalition chairman, who is attending the Battle of Britain commemorations on Tuesday, did not directly answer questions about if he would wear a white poppy when pressed about the issue during the meeting. \n \n\"He said that people wear white poppies in remembrance of those who died,\" the spokeswoman said. \n \nMr Corbyn received \"warm applause\" in the meeting, which ran for more than an hour, and \"quite a lot\" of the questions \"weren't actually hostile\", she added. \n \nThe Opposition leader told the PLP that his top priorities are housing, next year's elections in Scotland and Wales, and winning the general election in 2020. \n \nMr Corbyn and his deputy Tom Watson will spend one day a month in Scotland ahead of the vote, a party spokesman said. Since his victory on Saturday, 28,000 people have signed up as full members of the party. \n \nThe scale of the problems Mr Corbyn faces in uniting the party were underlined as key members of his new team gave his leadership a lukewarm response. \n \nShadow education secretary Lucy Powell, who had never met the new leader in person until this evening, said accepting the role had been a \"difficult\" decision. \n \nThe for mer election campaign vice chairwoman said one of the critical problems Labour faced at the polls was economic credibility. \n \nAsked if she believed Mr Corbyn and John McDonnell could convince voters where the previous leader failed, she told BBC Radio 4's PM programme: \"Not on everything, no, not at all, and some things they have said I don't agree with.\" \n \nMr Benn declined to offer his full endorsement over the controversial  appointment of Mr McDonnell as shadow chancellor. \n \nHe told BBC Radio 4's Today programme: \"This is the choice that Jeremy has made. I respect the choice that Jeremy has made as leader. \n \n\"We have just come off the back of two bad election defeats for the Labour Party, and our principal task is to win the people's trust when it comes to the economy. \n \n\"John's first and last task as shadow chancellor will be to win the trust and confidence of the British people in arguing for a different economic policy.\" \n \nMr McDonnell, who boasts in his Who's Who entry that his hobbies include \"fermenting (sic) the overthrow of capitalism\", has backed renationalisation of the banking system, effectively printing money to fund government investment, and a 60% tax rate on earnings above £100,000. \n \nHe told the BBC: \"I have got a long history in terms of financial administration. I was chancellor of the exchequer for London at the age of 29. My new policies, with Jeremy's, have been roundly endorsed by the leadership election, so the economy would be safe in our hands but also it would be more prosperous.\" \n \nMr Corbyn accused critics of \"living in the 18th century\" amid jibes that he overlooked women for Labour's biggest jobs. \n \nThe new leader insisted he did not regard the traditional Treasury, home affairs and foreign affairs briefs as the most important - and pointed out that the majority of his shadow cabinet was female. \n \nMr Corbyn also said it was a \"bit of an achievement\" that he had managed to gather an \"inclusive\" team despite a slew of senior figures indicating they would not serve. \n \nAsked why no women were shadowing the Great Offices of State, the Islington North MP replied:  \"Is health more important? You are living in the 18th century, if I might say so. \n \n\"We have a shadow cabinet, a majority of women, covering all areas of policy and public life, and I think it is a great team we have got together. \n \n\"We have spent a lot of time doing it and a lot of care, and it reaches out to the entire party, and I think that is a bit of an achievement, if I may say so.\" \n \nIn total, 16 posts in Mr Corbyn's senior team have gone to women, with 15 filled by men. \n \nBy contrast, there are 30 Government ministers who are either members of or attend Cabinet, of whom 10 are women. \n \nJournalists waiting outside the parliamentary offices where the appointments were being made on Sunday night apparently overheard an aide to Mr Corbyn complaining that they were \"taking a fair amount of shit out there about women\". \n   \n Share article  \n   \nSoon afterwards Angela Eagle had the title of shadow first secretary of state added to her role as shadow business secretary.", "source": "St. Helens Star"}