{"published": "2015-09-17T08:10:26Z", "media-type": "News", "title": "China revives ecstatic children greeter teams for state visits", "id": "94088255-a8fc-4bc0-93ee-37b4c6fb1995", "content": "BEIJING – She is only 10, but Dai Jingya has already come face to face with more heads of state than most people will in their lifetimes. She has rubbed shoulders with Chinese President Xi Jinping four times, and greeted the leaders of Singapore, Afghanistan, Myanmar and Denmark. \n \nDai is one of a group of children culled from Beijing schools to welcome the constant stream of foreign dignitaries coming to the capital to pay their respects, alongside People’s Liberation Army soldiers and a host of top Chinese officials. \n \nThe ritual has echoes of both the personality cult rule of Communist founding father Mao Zedong and the way emperors embodied the state in the era of imperial China, experts say. \n \nIn closely choreographed performances that always take pride of place on the state broadcaster CCTV’s main evening news, Xi and his guest first review the honor guard at the Great Hall of the People on Tiananmen Square. \n \nThe pair then walk past the phalanx of around 40 children, who on cue burst into ecstatic screams of “Welcome to China” in Chinese and English, jumping up and down waving a Chinese flag in one hand and the visitor’s emblem in the other. \n \n“I really like coming here to welcome the foreigners, we get to miss school and sometimes I get to see myself on the evening news,” Dai said, waiting under a hot sun for a ceremony to begin. \n \nBut she has yet to see U.S. president Barack Obama, she said, adding he was the leader “I want to see the most.” \n \nThe welcome ceremonies have a long history, but the presence of children was re-introduced after Xi took power in 2012, following a decades-long gap. \n \nWhen then Indian Prime Minister Jawaharlal Nehru visited China in 1954, he became the first non-Communist leader to visit the People’s Republic. \n \nIt was a crucial endorsement of Mao’s rule with the world order in flux as decolonisation and revolution redrew the map, and his host pulled out all the stops in the way only an absolute leader can. \n \nAbout 300,000 people lined the roughly 10 kilometers of the route the prime minister’s limousine took from Beijing’s airport to the city, according to a report at the time in London’s News Chronicle. \n \nThe distance was “walled by unbroken banks of humanity, clapping, cheering and crying,” wrote the newspaper’s correspondent James Cameron. \n \nUnder Mao, smiling children in red neckerchiefs from the Young Pioneers, a Communist Party youth organization, were frequently on hand to welcome foreign leaders. \n \nAfter his death in 1976 and the end of the tumultuous Cultural Revolution, China moved the formal welcome ceremonies from the airport to the Great Hall of the People, and two years later the government stopped organizing citizens to line the roads. \n \nIn 1989, under Jiang Zemin, the protocol department ordered that primary and middle school students no longer take part in welcoming state visitors. \n \nBut Xi — who is seen as having acquired more power more quickly than any Chinese leader since Mao — has revived the practice. \n \n“It’s the same as when China had an emperor,” said Ines Pires, founder of the Brussels-based International School of Protocol and Diplomacy. \n \n“China has a more collectivist way of thinking and these ceremonies are supposed to be a representation of the state and of all of China.” \n \nA few other countries use children in similar ceremonies, but rarely with such prominence. \n \nBefore anyone of importance arrives, teachers drill the students with military-like commands on when to begin cheering and when to stop. \n \n“This is a great opportunity,” one teacher chastised an unruly boy. “Do not embarrass yourself and your school by doing anything that would upset the leaders.” \n \nWhen Xi arrives, the teachers must look on from afar, a mix of pride and nerves as they snap photos with their phones, while hoping their charges behave in the presence of power. \n \nDuring the welcome event for Singapore’s president, Xi, normally perpetually solemn, cracked a smile and waved as he walked the children, the only sign of joy he displayed during the proceedings. \n \nAfter the leaders left, the children rushed into the bathroom, each declaring they were unafraid of Xi, and taunting a boy they said was scared. \n \nWhen Equatorial Guinea’s President Teodoro Obiang Nguema Mbasogo visited many students were excited, albeit largely unaware of his nation’s existence, let alone the many human rights violations Obiang is alleged to committed during more than 30 years in office. \n \nIt was the second time 8-year-old You Ziniu had been mustered to join the welcoming committee, after he greeted Obama last year. \n \n“I liked Obama’s visit better,” he said. “I’ve never heard of this country.”", "source": "Japan Times"}