{"published": "2015-09-12T15:00:43Z", "media-type": "Blog", "title": "Top Pregnancy and Labor Apps", "id": "9ebcfe61-6272-47b5-8ab7-9388fbb51d53", "content": "There are apps for everything nowadays, so it is only natural that many have been created to assist in that most important of times in our lives, pregnancy and labor. Arguably this emergent technology is playing quite a significant role in shaping the ways expectant mums keep track of their physical and mental condition. \n \nThis software’s development is also pushing obstetric and health professionals to adapt to their technologically equipped patients. Of course there are also plenty of apps directly made for healthcare professionals too. \n \nSome of these apps function as reference tools or calculators, facilitating information access and providing quick access to technical guidelines. In the course of this use, the information which they provide may shape the decision-making process of both patients and experts alike. For this reason it is important to acknowledge their impact as well as ensuring their safety and trustworthiness. \n \nExpectant mums might find some of the following apps very useful. Each of these has been reviewed by UK healthcare professionals and bears their stamp of approval. \n \nPregnancy tracking \n \nAmongst the apps for pregnancy tracking, Pregnancy + is one of the most popular, being used by more than two million people. This app provides interactive images of developing babies, has a personal diary feature and users can log doctor’s appointments, browse babies’ names, store shopping lists and information about their birth plans, diet and exercise regimes. Its broad functionality and level of detail are two of its best features. \n \nMy Pregnancy Today is another app which can be used as a daily guide to pregnancy which first time parents might find particularly useful since it provides so much useful everyday information on navigating the course of a pregnancy. \n \nTracking your baby´s movements and heartbeat \n \nThere are also apps for tracking your baby’s heartbeat, such as Tiny Beats , which uses a mobile phone to listen to the baby’s heart and record it. \n \nHowever, this might be considered misleading if it is used as a reference for the wellbeing of the baby since a mum’s heartbeat can be easily confused with a baby’s. Many midwives recommend that the best way to keep track of your baby’s activity inside the womb is by the number and quality of movements. \n \nApps for keeping healthy \n \nSqueezy is an app which can help both pregnant women and mums to get into the habit of doing pelvic floor muscle exercises . Apps providing exercises for expectant mums can be useful if designed and used with care and according to health experts’ recommendations. \n \nApps for labor \n \nSome apps can also be used for tracking contractions in order to record the exact time a contraction starts and ends, which can be very useful in order to decide when to head to hospital. \n \nFor breastfeeding mums who are expressing milk, there are also apps for tracking the pumping and storage of breastmilk, such as Milk Maid . \n \nOf course for the new baby there are also a number of apps available for tracking their health, habits and development. These may well be a good subject for an upcoming article. Please let me know in the comments which apps you have found useful in pregnancy! \n \nReferences \n \nFernández, M.A. (2015) Apps móviles sanitarias para Ginecología y Obstetricia, Metas de enfermería, ISSN 1138-7262, Vol. 18, Nº. 3, 2015, pág. 15. http://dialnet.unirioja.es/servlet/articulo?codigo=5044153 \n \nImage via Syda Productions / Shutterstock .", "source": "Brain Blogger"}