{"published": "2015-09-19T23:38:14Z", "media-type": "News", "title": "The Latest on the 2016 campaign: Rick Santorum's Iowa pitch", "id": "3629a628-61f7-4a45-9beb-2f16e72d14e0", "content": "The latest on the 2016 presidential campaign from Iowa, Michigan, New York, New Hampshire and Georgia (all times local). \n\n6 p.m. \n\nRick Santorum is asking Iowa Republicans to pledge their support once again for his presidential bid, casting himself as an outsider candidate with the \"skills of an insider\" to get things done in Washington. \n\nThe former Pennsylvania senator spoke at the Iowa Faith and Freedom Coalition presidential forum, reminding audience members how they gave him a victory in the 2012 Iowa caucuses when he was at just 2 percent in the national polls. \n\nSantorum says that while in Congress he fought the tough issues on behalf of conservatives involving \"life, marriage, faith and religious freedom\" and won't hesitate to \"shake things up\" if elected to put \"this country back on the right track.\" \n\n5:15 p.m. \n\nSouth Carolina Sen. Lindsey Graham says people are responding to his message about more drinking in the White House. \n\nThe 2016 Republican presidential candidate has been mingling at an Iowa event for evangelical voters. He says that he's gotten positive feedback for his crack during the Wednesday undercard debate that if he becomes president, \"we're going to drink more.\" \n\nGraham was noting that President Ronald Reagan and House Speaker Tip O'Neill would share a drink in spite of their differences. \n\nGraham says that he's benefiting from showing a sense of humor on stage. \n\nHe points out that Regan had a good sense of humor and that \"sometimes you can make your points better with humor that you can anything else.\" \n\nAsked about what he thinks of being seen as the funny candidate in the race, Graham quips, \"The bar is low.\" \n\n4:40 p.m. \n\nJeb Bush hopes to do well in the Republican primaries in both Georgia and South Carolina, so he's not about to offend football fans in either state. \n\nBush spoke briefly and posed for hundreds of selfies on the University of Georgia campus before the Bulldogs hosted a Southeastern Conference game against the University of South Carolina. \n\nAsked who he was rooting for in the game, the former Florida governor declares that he's \"kind of neutral on the subject.\" \n\nThe politically correct answer. \n\nBut Bush predicted Georgia would win the SEC East and Louisiana State University would take the SEC's Western Division. \n\nBush says he's even \"got money on it. Five bucks I think.\" \n\n— Paul Newberry reporting from Athens, Georgia \n\n2:10 p.m. \n\nOhio Gov. John Kasich says Latino workers are \"completely involved\" in all aspects of the U.S economy and not limited to certain segments. \n\nThe presidential contender has come under criticism from Democrat Hillary Rodham Clinton for generalizing about Latinos after telling a story about a note left for him by a hotel maid that said she valued his stay. He told reporters Saturday at a Republican leadership conference on Mackinac (MAK'-ih-naw) Island, Michigan, he was just trying to \"slow down and honor people who sometimes we run past very quickly.\" \n\nKasich says he's a strong advocate \"for how Hispanics in this country can add so much in every profession.\" \n\nDuring remarks Thursday in California, Kasich talked about a Latina hotel maid and said \"a lot of them do jobs that they're willing to do, and that's why in the hotel you leave a little tip.\" The president of the U.S. Hispanic Chamber of Commerce says he didn't find the comments offensive. \n\n2:01 p.m. \n\nVermont Sen. Bernie Sanders is energizing New Hampshire Democrats by calling for a \"political revolution\" and slamming the GOP field on climate change, gay marriage and foreign policy. \n\nSanders is calling for an end to corporate greed and a need to take on the \"billionaire class,\" saying \"No president can do it alone unless we have a political revolution.\" \n\nHe says Democrats lost the 2014 midterm elections because they failed to turn out voters. \n\nSanders continues to surge in the early voting state, where he now leads Hillary Rodham Clinton in some polls. His speech during the state Democratic Party's annual convention in Manchester is drawing chants and raucous applause. Many of Clinton's supporters who dotted the stands earlier in the day left before Sanders took the stage. \n\n12:02 p.m. \n\nHillary Rodham Clinton is taking aim at the Republican presidential field, saying the GOP debate this week featured not \"a single fighter for the middle class.\" \n\nClinton has called viewers of the three-hour event \"gluttons for punishment\" and says Republicans are focusing on problems the country faces rather than solutions. \n\nClinton says voters who want a leader to tell them \"everything that's wrong with America\" have \"plenty of other choices.\" \n\nShe saved her toughest critique for front-runner Donald Trump. Clinton says Trump is \"trafficking in prejudice and paranoia\" and doesn't respect women. Those views, she says, are shared by the rest of the 15 person field. \n\nClinton is addressing a convention of New Hampshire Democrats at the end of a three-day swing through the early primary state. \n\n10:20 a.m. \n\nNew Hampshire Democrats have a message for the Democratic National Committee: Bring on more debates. \n\nActivists chanting \"We want more debates!\" drowned out DNC Chairwoman Debbie Wasserman-Schultz's speech several times at the New Hampshire Democratic Party's convention in Manchester on Saturday morning. Wasserman-Schultz became noticeably frustrated on several occasions. She asked \"What's more important? Drawing a contrast with Republicans or arguing about debates?\" \n\nIn response, the chants continued. Finally, she said, \"Enough is enough.\" \n\nThe DNC has sanctioned six debates, but supporters of Martin O'Malley and Bernie Sanders are demanding more. They say the limited number of events is an effort to coronate a nominee. Front-runner Hillary Rodham Clinton's campaign has said she's open to more debates, but has not called for more. \n\n9:28 a.m. \n\nRepublican presidential candidate Scott Walker is skipping a prestigious Michigan Republican conference this weekend, as he downshifts his campaign to focus on Iowa. \n\nWisconsin's governor was to address more than 1,000 people during breakfast Saturday morning at the Mackinac (MAK'-ih-naw) Republican Leadership Conference on the picturesque island in northern Michigan. \n\nBut Walker's campaign called at 5:45 a.m. Saturday to say he would be unable to attend. \n\nHis campaign spokeswoman, AshLee Strong, said in an email that inclement weather in Chicago grounded Walker's flight. \n\nThe Wisconsin governor was originally scheduled to kick off the event with former Florida Gov. Jeb Bush Friday evening. But he cancelled last week, saying he couldn't get from a Republican forum in South Carolina late Friday. \n\nBush attended the same South Carolina forum and headlined the Mackinac Island dinner solo. \n\nMichigan holds its primary in March. Republicans view the state as in play for the general election. \n\n7:45 a.m. \n\nRepublican presidential front-runner Donald Trump is defending his decision not to correct a questioner at a recent town hall event who erroneously stated that President Barack Obama is Muslim. \n\nObama is Christian. \n\nIn a series of tweets from New York City Saturday morning, Trump said he didn't think he was \"morally obligated to defend the president every time somebody says something bad or controversial about him.\" \n\nThe billionaire businessman then tweeted \"No chance!\" that the president would \"come to my rescue\" if someone made a nasty statement about Trump. \n\nThe billionaire businessman had been silent on the Thursday night exchange other than a statement from his campaign that raised concerns about the treatment of Christians in the U.S. \n\nHe tweeted Saturday that for the first time in his life he has \"caused controversy by NOT saying something.\"", "source": "Wichita Eagle"}