{"published": "2015-09-16T10:51:34Z", "media-type": "News", "title": "Could you live a YEAR without cash? How one 'off the grid' Australian couple built their home from scraps, bathe in rainwater... and dive in dumpsters for food", "id": "50eeaecf-aab0-4dbe-b03e-fb3010292267", "content": "Rachel Newby and Liam Culbertson live on a friend's property in Victoria The couple attempt to live a cash-free  existence, living off the land They work on local farms in exchange for food or grow their own produce When supplies run low they 'dumpster dive' searching for discarded food They live rent and rates free, having built their home for $120  \nIn a time where the housing market in major cities has skyrocketed  - a Victorian couple has realised their Australian dream off the grid. \n\nRachel Newby, 24, and her partner Liam Culbertson, 26, built their home from the ground up on a friend's plot, using scrap timber and recycled materials. \n\nThe couple grows their own food or sources it from local dumpsters, lending their labour to local farmers in exchange for their next meal. \n\nTheir lifestyle, Rachel told that's life  magazine, is experimental as they aim to live off almost no cash for 12 months. \n   \nLiving organic: Rachel Newby, 24, spent two months living on an organic farm in Canada before moving to West Gippsland with partner Liam \n   \nOff the grid: Liam Culbertson, 26, lives in rural Victoria in a cashless community \n\nThe couple lives in West Gippsland, a rural region of Victoria located in the state's east. \n\nWhen they moved in January this year, they brought with them a wealth of knowledge from their travels abroad. \n\nRachel had lived in Canada for two years on an organic farm while Liam journeyed to the arctic, both always trying to source local produce and minimise their ecological footprint by producing as little rubbish as possible. \n    \nFirst home: Liam and Rachel built their home for just $120 by using free and salvaged timbers \n\nDepsite their experience, Liam and Rachel found life on the land difficult. \n\nThe soil lacked fertility, making it hard to grow crops, and the harsh Victorian climate made living in a tent unbearable. \n\nRachel and Liam set out to build their first home - a task made possible from free timber and salvaged materials. \n\nAll up the house, which is 2.5 metre square and 3 metres high, cost $120 in supplies which they bought from the hardware store.  \n\nThe thrifty space offers privacy, but not much else. \n   \nRent free: Their home offers them privacy, but they still have to share toilet facilities and shower under cold rain water \n\nThe couple still share toilet facilities with the rest of the community, and shower under cold rainwater collected form the roof. \n\nWithout any appliances, they wash their clothes in the sink. \n\nHaving previously worked in office jobs and as lifeguards, the couple's time on the land is free to spend at their leisure. \n\nBut while they might not have to make weekly rent or pay the bills, they still need to eat. \n\nMuch of their time is spent working for local farmers - planting vegetables and picking berries - in exchange for their next meal. \n   \nLiving off the land: The couple grow their own food or work on farms in exchange for their next meal \n\nThe couple grow their own vegetables and have five ducks and two drakes they bought on Gumtree for $80, providing them with fresh eggs. \n\nWhen supplies run low they go 'dumpster diving', sifting through discarded produce for fresh vegetables, fruit and bread. \n\nWorking together with like-minded people allows them to trade goods, swapping hand-made garments for food. \n   \nEmergency fund: The couple's biggest expense was $300 in dental work for Liam  \n\nWhile they try to live completely cash-free, there are times when Liam and Rachel need to spend money. \n\nEarlier this year Liam needed dental work, costing the couple $300, and Rachel bought a bike so she could travel in to town. \n\nWith their cashless experiment coming to an end in January next year, the couple remain undecided about their future - whether they will continue to live off the land or start a similar commune elsewhere. \n\nRachel said while they acknowledged not everyone could live like they do, taking the time to educate yourself about where the food you eat comes from was good practice.   ", "source": "Mail Online UK"}