{"published": "2015-09-29T23:32:09Z", "media-type": "Blog", "title": "SPORTS STORY>>Toss-ups and mismatches in week five", "id": "8082bc84-694f-4e19-a769-ac641bc6d71d", "content": "By RAY BENTON\nLeader sports editor This Friday marks the halfway point of the football season, and presents some interesting matchups and a couple of likely blowouts. One of the more interesting games is Beebe at Jacksonville. It’s homecoming week for the Red Devils and they welcome the limping Badgers to Jan Crow Stadium. A wounded Badger is a dangerous one, however, and the Beebe Badgers are fighting for their playoff lives despite it just being the second conference game of the season. Beebe enters this week’s game with as many as four, and at least three offensive starters out, as well as two defensive starters. Only 34 players were dressed out for practice on Monday for Beebe. Jacksonville will only be missing one player, and has a lot more depth than Beebe, at least in regards to total number of players. The Red Devils still had almost as many players left at practice after the junior varsity team left for a game at PA on Monday, as the Badgershave dressing out for practice. Despite the compounded problems of low numbers, several injuries and three-straight losses, Beebe went to work on Monday with focus. The Badgers always break up into individual groups every Monday, and the majority of that time was spent on defense this Monday. Jacksonville has given a few different looks on offense and Beebe head coach John Shannon wants the team prepared for all of it. Beebe was picked as high as third in preseason and second in the conference. But after losing 14-13 to McClellan, the Badgers need to beat Jacksonville to avoid any playoff hopes at all from sliding further away. With only seven teams in the conference this year, due to the elimination of the North Pulaski program, it will likely only take three conference wins to make the playoffs. A Beebe loss, however, means needing to win three of the last four, with two currently undefeated teams still left on the schedule. SH VS. FAIR\nThe other conference matchup involving a local team is Sylvan Hills (4-0) hosting J.A. Fair (0-4). The Bears are averaging 55 points per game while the War Eagles have scored two offensive touchdowns all season. That’s about all anyone needs to know about this matchup. CABOT VS. MARION\nThe Class 7A Cabot Panthers play an utterly meaningless conference game against Class 6A Marion at home on Friday. Marion (3-1) appears to be improving under second-year coach Jed Davis. The Patriots won just one game last year after switching from longtime coach Mark Uhiren’s Diamond-T to the Spread, but have tripled that win total in four games this year. The Panthers had a mercy rule at halftime last year. That probably won’t happen this season, but Cabot (4-0) is still a heavy favorite. While the Panthers may not race out to a 42-0 lead, if they take care of the football, the final score could be very similar to last year’s 42-6. Sans J.A. Fair, Cabot’s competition level has been much better than Marion’s. The Patriots started 3-0 with three-point wins over Wynne and Blytheville, and a 20-point win over Nettleton, all three of the 5A-East. Last week, the Patriots played a struggling West Memphis team and lost 34-21, even though the Blue Devils had only beaten Wynne by one and had lost to Blytheville. While Cabot quarterback Jarrod Barnes got most of the headlines for the several big plays the offense busted in its 34-3 win over North Little Rock, the Panther defense was the key to that victory. In three first-half trips into the red zone, the Wildcats managed just three points. When a defensive touchdown early in the third quarter put the Wildcats down 27-3, they had to largely abandon the run game, and the Cabot secondary was stellar in coverage the rest of the way. If the defense continues to play that well, and the offense can avoid the fumbles that have plagued it all season long, this game won’t stay close much past halftime either. LONOKE VS. NEWPORT\nThe Lonoke Jackrabbits are coming off a terribly disappointing loss to Heber Springs while Newport enters the game riding a season-long wave of disappointment. Injuries are a big reason for Lonoke’s letdown. The Greyhounds, however, were picked by many to win the 4A-2 Conference, and that goal is still attainable. But the 0-4 Hounds have barely been competitive in three of their losses, and dropped their league opener at home to Helena-West Helena Central last week, 25-14. Newport was also upset by HWHC in the conference opener last season, and didn’t lose again until the playoffs, winning six-straight, starting with a 34-12 victory over the Jackrabbits. Lonoke was riding high after opening the season with back-to-back upset victories over Star City and Beebe. It then lost a hard-fought game to McClellan, but still carried a lot of confidence into the league opener, which it lost 20-19. The Jackrabbits started that game without their biggest threat on offense in senior speedster Justin Meadows, who suffered a shoulder injury against McClellan. During the game, the Jackrabbits also lost their quarterback and two-way starter Logan Dozier. It’s uncertain how long those players will be out, or if they will miss this week’s homecoming game. If the Jackrabbits are at full strength, they’ll be favored against the struggling Greyhounds. CARLISLE AT MARVELL\nCarlisle also lost last week, but looks like it took a big step forward in battling Des Arc to the wire. The Bison won’t be able to gauge improvement much this week. They face Marvell, who, like Sylvan Hills’ opponent, has been one of the worst programs in the state the last several years. Like Fair, the Mustangs have scored exactly 26 points all season, and have given up 200 points in four games. The only thing that could cause Carlisle any trouble this week is the temptation to look ahead to next week’s game against archrival Hazen.", "source": "THE ARKANSAS LEADER"}