{"published": "2015-09-24T19:19:50Z", "media-type": "News", "title": "Marijuana Start-ups Pitch Their Dreams to High Net Worth Investors", "id": "3bcf4287-1bc8-43fa-8652-2b8549c957e8", "content": "On the heels of Willie Nelson's cannabis brand getting serious investment, Snoop Dogg launching a cannabis media empire with venture money, and the impending prospect of new California cannabis regulations, more than 200 high net worth investors from around the world are eager to invest in the fastest growing industry in America will gather in Los Angeles, CA at the ArcView Investor Forum. The ArcView Investor Network includes more than 500 accredited investor members who have put more than $52 million behind 78 cannabis-related companies. Taking place at the LA Downtown Hotel for a two day \"Shark Tank\"-like pitch forum on Tuesday, September 29th and Wednesday, September 30th, accredited investors will be reviewing pitches from more than 25 companies who competed fiercely for the pitch slots out of a field of hundreds of applicants. It will be the highest concentration of capital and key players to ever assemble for the industry. \n\n\"The best entrepreneurial minds and the sharpest investors are turning their attention to the fastest growing industry in America: the cannabis industry. ArcView is where the deals that will make future headlines are made,\" said Troy Dayton, CEO and co-founder of The ArcView Group. \n\nTo learn more about ArcView, see this short video. To get a sense of what to expect at the Forum, see this recent episode about it on Fusion Network. \n\nFacts: \n\nWho: The ArcView Investor Network (private group of high net worth investors) \n\nWhen: Tuesday, September 29th and Wednesday, September 30th, 9:00 AM - 3:30 PM \n\nWhere: LA Downtown Hotel, 333 S Figueroa Street, Los Angeles, CA 90071 \n\nMust be pre-approved to get a media pass. \n\nAbout The ArcView Group \n\nFounded in 2010, The ArcView Group is responsible for a number of groundbreaking ventures in the cannabis industry. The ArcView Investor Network includes more than 500 accredited investors who have put more than $52 million behind 78 companies. ArcView Market Research produces the State of Legal Marijuana Markets report, which is the most oft-cited market data report. In 2015, ArcView became a partner in Canopy, the first seed-stage mentor-driven business accelerator. ArcView is also co-founder of Cannasure Insurance Services, the leading provider of business insurance to the cannabis industry. Some of the people you can meet: \n\nSteve DeAngelo, star of Discovery Channel's hit show Weed Wars, author of new book The Cannabis Manifesto, co-founder and President of The ArcView Group, co-founder of the first cannabis testing lab, Steep Hill, executive director of Harborside Health Centers. \n\nTroy Dayton, Co-founder and CEO of The ArcView Group, board member of the Marijuana Policy Project and the National Cannabis Industry Association. \n\nWillie Brown, served over 30 years in the California State Assembly before becoming the 41st mayor of San Francisco from 1996-2004, and is currently working on advocating for marijuana regulation in California. \n\nChristian Groh, COO of Privateer Holdings, former director at Nextel, and former director of sales for Silicon Valley Bank Analytics. Privateer has closed more than $75 million in funding including some from ArcView members and is best known for its investments in Leafly and Marley Natural. \n\nPatrick Rea, Managing Director of CanopyBoulder, a seed-stage, mentor-driven business accelerator that just graduated its first class. \n\nHolly Alberti-Evans, CEO of Healthy Headie Lifestyle, a graduate of CanopyBoulder that does in-home demonstrations of vaporizers and other cannabis accessories like Tupperware or Mary Kay. Holly won ArcView's best pitch prize at the last ArcView event and has raised capital from ArcView members. \n\nDoug Leighton, Co-founder and a principal partner of Dutchess Capital, a Boston-headquartered fund, which has managed an investment portfolio of over $2 billion in transactional value. Dutchess has made numerous high-profile investments in the cannabis space. \n\nMichael Straimietis, CEO of Advanced Nutrients, a leading worldwide manufacturer of fertilizer for cannabis for many years, and a strategic investor in cannabis-related start-ups. \n\nBrian McKay, CEO of GreyZone Entertainment, a Canadian game studio building Grow Show: a cannabis growing social game and entertainment brand for cannabis lovers worldwide. Brian has raised money from ArcView members. \n\nNeeraj Bhardwaj, President of Loto Labs, creators of an induction-powered vaporizer: Evoke. Neeraj has raised money from ArcView members and angel investors from Silicon Valley. \n\nEmily Paxhia, Managing Director of Poseidon Asset Management, a hedge fund for the cannabis industry. Poseidon has invested in many cannabis-related companies. \n\nLeslie Bocskor, Managing Partner at Electrum Partners, successive entrepreneur with a dual focus on disruptive businesses and nascent culture, C-level executive and board member for public and private companies, and has advised dozens of early stage businesses \n\nAmy Poinsett, co-founder and CEO of MJ Freeway Business Solutions, raised money from ArcView member Joby Pritzker of Tao Capital, listed as one of the fastest growing companies from Inc. Magazine, and her business partner Jessica Billingsley was named to the Top 10 Female Entrepreneurs by Fortune Magazine. \n\nIsaac Dietrich, Co-founder and CEO of MassRoots, prior to co-founding MassRoots he was a finalist for Peter Thiel's 20 Under 20 fellowship. MassRoots raised millions from ArcView members before going public. \n\nRob Kampia, Co-founder and Executive Director of Marijuana Policy Project. He is the architect of most of the state-level marijuana laws that have been enacted in the United States since 2000. \n\nDavid Lampach, Co-founder of Oakland-based Steep Hill Labs, the first cannabis testing lab company in the industry. \n\nFrank Marino, CEO of LA based, MJIC Fund, has decades of experience in venture finance, and MJIC has invested in numerous cannabis related companies. \n\nRalf-Rainer von Albedyhll, CEO of LA based NextRX, a cannabis consumer member network. \n\nEvent sponsors include: Kernl, Harborside Health Center, Electrum Partners, Poseidon Asset Management, MassRoots, Cannasure Insurance Services, Lexaria Energy, Indoor Harvest Corp, O.penVAPE, Marijuana Policy Project, CanopyBoulder, MJIC Fund, Aquarius Cannabis, California Cannabis Industry Association, Advanced Nutrients, Drug Policy Alliance, Steep Hill Labs, Donahue Fitzgerald, NeWay Capital, The National Marijuana News, NextRx, Poseidon Asset Management \n\nhttp://media.globenewswire.com/cache/29674/small/24177.jpg \n\nhttp://www.globenewswire.com/newsroom/ti?nf=MTMjMTAxNTA1NDUjMjk2NzQ=", "source": "Individual.com"}