{"published": "2015-09-01T07:44:30Z", "media-type": "News", "title": "Bacanora update on Sonora project", "id": "14ed0de6-edbd-49f3-83f4-2aeb9ccdfaf2", "content": "Bacanora Minerals has issued an update on the drilling programme currently being undertaken as part of the pre-feasibility study at its Sonora lithium project in Mexico. \nBacanora has now completed nine holes (totaling 1,850 metres) of the currently planned 18 hole drilling programme (approximately 4,000 metres). \n\nAs a result of the company's recent agreement with Tesla Motors, a second rig has been mobilised to site to increase the speed of drilling, with the intention to complete the remaining holes in September. \n\nAnalyses received from the first four holes from the Fleur concession indicate that weighted averages for lithium content in the Upper Clay is 1,862 ppm Li over 24.15 metres in thickness and the Lower Clay averages 4,871 ppm Li over 24.15 metres. \n\nThe programme is primarily focused on significantly increasing the Indicated Mineral Resources within the Sonora lithium project, as well as testing whether the high grades and near surface mineralisation identified at the La Ventana concession continue into the northern area of the Fleur concession, which immediately adjoins La Ventana to the south.  The Company's resource was recently updated by SRK Consulting (UK) Limited to: \n\n·     Indicated resources of 1.14 million tonnes (\"Mt\") lithium carbonate equivalent (\"LCE\") contained in 95Mt of clay, at lithium (\"Li\") grade of 2,200 ppm \n\n·     Inferred resources of 6.3Mt LCE contained in 500 Mt of clay at a Li grade of 2,300 ppm \n\nFor further details, investors are encouraged to reference the Company's press releases dated 14 May and 27 June 2015 and/or the SRK's report that was filed on May 13, 2015 and is accessible on the Company's website. \n\nThe Sonora lithium project is comprised of the following lithium properties: La Ventana lithium concession, which is 100 percent owned by Bacanora; El Sauz and Fleur concessions, which are held by Mexilit SA de CV; and the Megalit concession, which is held by Megalit SA de CV. Mexilit and Megalit are owned 70% by Bacanora and 30%  by Rare Earth Minerals, plc.   Upon completion of the drill programme and assaying, SRK will deliver an updated resource model for mine design purposes, with an initial focus on the higher grade, open pit resources on the La Ventana and Fleur concessions. \n\nChief executive Peter Secker said: \"Drilling is progressing very positively and with a second rig about to arrive on site, we expect to complete this programme rapidly.  This campaign will form a critical component of our pre-feasibility study and it is our hope and expectation that, upon completion of drilling, we will have sufficient data to update and upgrade our resources to advance the mine design.\" \n\nAt 8:41am: (LON:BCN) Bacanora Minerals Ltd Ord Npv di share price was +4.5p at 91.5p \n\nStory provided by StockMarketWire.com", "source": "MoneyAM"}