{"published": "2015-09-24T16:30:00Z", "media-type": "News", "title": "American Science and Engineering, Inc. Receives IDIQ Contract From U.S. Customs and Border Protection for Medium Energy Mobile Scanners", "id": "0ec5a9d8-f7c2-4a79-a054-31bcec2c1519", "content": "BILLERICA, Mass., Sept.  24, 2015  (GLOBE NEWSWIRE) -- American Science and Engineering, Inc. (“AS&E”) ( NASDAQ:ASEI ), a leading worldwide supplier of innovative X-ray detection solutions, today announced that it has been awarded an Indefinite Delivery Indefinite Quantity (IDIQ) contract from U.S. Customs and Border Protection (CBP). AS&E is one of four vendors that received the award and an initial delivery order under the IDIQ contract for one mobile scanner. The AS&E Medium Energy Mobile Scanner will leverage the Company’s innovative detection technology on a new mobile platform and will be used by CBP to perform non-intrusive inspection of incoming conveyances at U.S. Ports of Entry beginning in 2016. \n\n\n“We are pleased that CBP has elected to add another AS&E mobile system in support of its critical security mission,” said Chuck Dougherty, AS&E's President and CEO. “Broadening our portfolio of port and border security detection solutions with the AS&E Medium Energy Mobile Scanner will provide our customers with another innovative AS&E product that meets their rigorous requirements for performance, reliability, and cost.” \n    \nAS&E is the world’s largest supplier of advanced mobile X-ray inspection systems, having sold more than 770 ZBV® vehicle and cargo systems to 140 customers in 66 countries. AS&E’s ZBV and Z Portal® cargo and vehicle screening systems are deployed by CBP on the U.S. southwest border and other Ports of Entry to inspect cargo and vehicles for threats and contraband. For more information on the AS&E award, click here . For more information on the Multiple Award IDIQ, click here . \n \nAbout AS&E \nAmerican Science and Engineering, Inc. (AS&E) is the trusted global provider of threat and contraband detection solutions for ports, borders, military, critical infrastructure, law enforcement, and aviation. With over 50 years of experience, AS&E offers proven, advanced X-ray inspection systems to combat terrorism, drug smuggling, illegal immigration, and trade fraud. AS&E systems are designed in a variety of configurations for cargo and vehicle inspection , parcel inspection , and personnel screening . Using a combination of technologies, these systems provide superior detection capabilities, with high-energy, dual-energy, and Z Backscatter X-rays — pioneered by AS&E. Learn more about AS&E products and technologies at www.as-e.com and follow us on Twitter @ase_detects . \n \nSafe Harbor Statement : The foregoing press release contains statements concerning AS&E’s financial performance, markets and business operations that may be considered “forward-looking” under applicable securities laws. AS&E wishes to caution readers of this press release that actual results might differ materially from those projected in any forward-looking statements. Factors which might cause actual results to differ materially from those projected in the forward-looking statements contained herein include the following: significant reductions, delays or cancellations (in full or in part) in procurements of the Company’s systems by the United States and other governments; disruption in the supply of any source component incorporated into AS&E's products; litigation seeking to restrict the use of intellectual property used by the Company; limitations under certain laws on the Company’s ability to protect its own intellectual property; potential product liability claims against the Company; global political trends and events which affect public perception of the threat presented by drugs, explosives and other contraband; global economic developments and the ability of governments and private organizations to fund purchases of the Company’s products to address such threats; the potential insufficiency of Company resources, including human resources, capital, plant and equipment and management systems, to accommodate any future growth; technical problems and other delays that could impact new product development and the Company’s ability to adapt to changes in technology and customer requirements; competitive pressures; lengthy sales cycles both in United States government procurement and procurement abroad;  future delays in federal funding, the market price of the company's stock prevailing from time to time, the nature of other investment opportunities presented to the company from time to time,  the company's cash flows from operations and market and general economic conditions. These and certain other factors which might cause actual results to differ materially from those projected are detailed from time to time in AS&E’s periodic reports and registration statements filed with the Securities and Exchange Commission, which important factors are incorporated herein by reference. AS&E undertakes no obligation to update forward looking statements to reflect changed assumptions, the occurrence of unanticipated events, or changes in future operating results, financial condition or business over time. Readers are further advised to review the “Risk Factors” set forth in the Company’s most recent Form 10-Q and Form 10-K,  which further detail and supplement the factors described in this Safe Harbor Statement. Among other disclosures, the Risk Factors disclose risks pertaining to that portion of the Company’s business that is dependent on United States government contracting as well as international customers. \nPublic Relations Contact:\t\nDana Harris\t\t\t\nRed Javelin Communications, Inc.\n978-440-8392 dana@redjavelin.com Laura Berman\nAmerican Science and Engineering, Inc.\n978-262-8700\nlberman@as-e.com", "source": "Town Hall"}