{"published": "2015-09-24T15:21:00Z", "media-type": "News", "title": "Celebrate The New Season With A Special Gift From Hilton Head Marriott Resort & Spa", "id": "40117eb0-c378-426e-8a3c-ba29f6038194", "content": "HILTON HEAD ISLAND, S.C. \n\nAs part of Marriott's Fall Break-Away Event, this offer is ideal for planning a much-needed family vacation, special weekend getaway or a fun-filled trip with friends to celebrate the arrival of cooler weather. AAA members will also receive an additional 5 percent discount upon booking. \n\nLocated on the pristine shores of the Atlantic, the hotel boasts a prime oceanfront address with newly renovated guest rooms, amenities and first-rate services – all just steps from the beach. Depending on the interests of guests, the resort credit can be used at one of the resort's restaurants, Spa Soleil or for in-room dining. \n\nFeaturing three American-style restaurants and a beachside bar, dining options at the Hilton Head resort offer something for everyone to enjoy, from handcrafted sandwiches to the fresh seafood. \n\nFor guests who want to make the most of their resort retreat, the property is also connected to world-class tennis courts and three oceanfront golf courses: Arthur Hills Golf Course, George Fazio Golf Course and Robert Trent Jones Oceanfront Course, which are all part of Palmetto Dunes Golf Club. After a day on the greens, guests can retreat to the resort and pamper themselves with a rejuvenating treatment at Spa Soleil. The stylish spa features body scrubs, couples massages, and nail services that will leave guests feeling refreshed.\n\nEach night, guests will enjoy a resting in newly renovated guest rooms and suites, which boast a host of modern amenities including flat-screen TVs and mini refrigerators. All rooms feature a private balcony with inspiring views of the surrounding area, and guests with an ocean view will overlook the resort's outdoor pool and sandy beaches as they plan their next sightseeing adventure on Hilton Head Island \n\nTravelers wishing to save money with the Fall Break-Away Deal must book using promotional code ZX0. The offer is available seven days a week for reservations between Oct. 1 and Nov. 22 \n\nAbout Hilton Head Marriott Resort & SpaHilton Head Marriott Resort & Spa is located at One Hotel Circle in Hilton Head Island, South Carolina \n\nJoin Marriott Rewards now and earn points that can be redeemed for free hotel stays and room upgrades at 3,800 hotels in over 70 countries.\n\nLearn more about Marriott International Inc. \n\nPRESS CONTACT\n\nTeresa Manzolillo \n\nPhoto - http://photos.prnewswire.com/prnh/20150921/268977 \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/celebrate-the-new-season-with-a-special-gift-from-hilton-head-marriott-resort--spa-300146513.html", "source": "Wall Street Select"}