{"published": "2015-09-08T17:47:39Z", "media-type": "News", "title": "Maiden James Taylor century takes England to 300 runs against Australia", "id": "25d1fb63-a467-4f23-b8f8-a2f1eb1170fe", "content": "James Taylor's maiden international hundred helped England reach 300 for the first time in their Royal London Series campaign against Australia. \n \r\n\t\t\r \nTaylor (101) was one of three batsmen to top 50 as the hosts, needing to beat the world champions at Old Trafford to avoid a series defeat with two matches remaining, set 300 for eight after winning the toss. \n\r  James Taylor celebrates his maiden international century \r \r \nOpener Jason Roy (63) and Eoin Morgan (62) - in a stand of 119 with Taylor - were the other major contributors after England chose to bat first on an initially cloudy but soon much brighter afternoon. \n\r\n\t\t\t\r \nTaylor had to work hard, coming of age with three figures in his 21st one-day international - a 112-ball hundred which contained 46 runs in singles and just five fours. \n\r\n\r\n\r\n\r \nIt was Roy who put the pace to the innings and number three Taylor took over with much scurrying and placement to post a competitive total on a decent pitch. \n\nAlex Hales could never get going at the top of the order before clipping a catch to midwicket in Pat Cummins' first over. \n\nBut Roy batted beautifully, unfurling a stream of boundaries including four in one over from Mitchell Starc, and it was his first false shot that cost him. \n\nHe passed 50 in just 34 balls and thought he had spotted another boundary option off ODI debutant Ashton Agar but just failed to put enough into the shot to chip cover, where Glenn Maxwell jumped high to hold a juggling catch. \n\r\n\t\t\t\r \nBoth Morgan and Taylor had a little fortune on their side, the captain most notably when he should have been stumped off Agar on 15 and his partner surviving an lbw appeal by Maxwell on 41 which would have been overturned had Australia chanced DRS. \n\nTaylor did not count a boundary until he square-drove the 53rd ball he faced from James Pattinson, and had just that four to his name in his first 50. \n\nMorgan got to his half-century more quickly, from just 46 balls, as the third-wicket pair provided a perfect platform of 181 for two at 30 overs. \n\nThereafter, England stalled as the apparent possibility of 350 or above faded significantly and four wickets - including two run-outs - fell for the addition of 64 runs in the last 10 overs. \n\r\n\t\t\t\r \nTaylor nonetheless managed to complete his hundred, with a scrambled single off Cummins, before he was last out in the final over, mistiming the expensive Starc to mid-off. \n\n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Ballymena Today"}