{"published": "2015-09-22T12:04:00Z", "media-type": "News", "title": "Dental Fix RX Franchisees Support National Breast Cancer Awareness Month", "id": "a021c0e6-5d5e-4d43-b6ce-87a356e6b292", "content": "Mobile dental repair franchise kicks off national charity program to support breast cancer research\n\nDAVIE, Fla. (PRWEB) September 22, 2015 \n\nIn observance of Breast Cancer Awareness month, Dental Fix RX, a mobile dental equipment repair company, will be collecting donations throughout the month of October to benefit breast cancer research. The fundraising program encourages franchise owner/operators across North America to give back and support charities by gathering contributions from dental customers and through personal donations. A percentage of the total earned will also be matched by Dental Fix’s corporate office in Florida. \n\n“Breast cancer has personally affected several of us at Dental Fix, and we’re honored to launch this program to help find a cure,” said David Lopez, CEO of Dental Fix RX. “Our participating owners will continue their work during October, but with pink shirts, branded bracelets, and promotional materials to gather donations and better inform their dental customers just how important breast cancer research is.” \n\nDonors will be given pink branded bracelets and printed collateral highlighting the importance of their contributions. Dental Fix owners will be able to contribute themselves by purchasing specially branded pink work shirts to wear throughout the month. A percentage of the total contributions will then be matched by Dental Fix corporate, while the highest performing owner will receive special recognition at the company’s 2016 franchise convention. \n\n“From our corporate offices, to our owners and customers, we are looking forward to this program making a huge impact on breast cancer awareness,” said Lopez. “Given we have more than 200 franchise owners throughout North America and serve approximately 14,000 dental customers, we stand to make a difference on this critical issue.” \n\nAbout Dental Fix \n\nFounded in 2009, Dental Fix RX is North America’s only on-site dental equipment repair franchise. Combining centralized technological and account management services with a unique national network of locally owned and operated industry professionals, the company provides its owners with “state of the art” mobile repair centers to deliver timely and personalized services for all equipment repairs and needs. Franchise opportunities are available nationwide with an exclusive, money-back guarantee for business growth and development. For more information, call 800-586-0340 or visit http://www.dentalfixrx.com.\n\n###\n\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb129719", "source": "WOWK"}