{"published": "2015-09-19T05:05:21Z", "media-type": "News", "title": "Man attacked with a bread crate at Hornsby railway station", "id": "ee9036cf-33ec-4c17-8802-9a0b1c239fde", "content": "By Sept. 19, 2015, 3:05 p.m. \n\nA random attack by a man wielding a bread crate has left another man in hospital after an altercation at Hornsby railway station on Saturday morning. \n\nAt about 3.20am a 36-year-old man was walking through the the station concourse near Hornsby Westfield shopping centre when he crossed paths with another man who was not known to him. \n\nThe unknown man picked up a plastic bread crate and used it to crack the 36-year-old over the head, police said. \n\nThe assailant then punched the man several times before running off towards George Street. \n\nThe injured man collapsed on the ground. \n\nSydney Rail staff and a passerby found the man and waited with him until emergency services arrived. \n\nHe was taken to the Royal North Shore Hospital with minor injuries as a result of the assault, and remained in hospital to be treated for a pre-existing condition by Sunday afternoon. \n\nThe man with the bread crate was described as having a muscular build and short brown hair. \n\nHe was wearing a white T-shirt and jeans at the time of the incident. \n\nPolice Transport Command were investigating the incident and appealed to any witnesses, or anyone with information to contact police. \n\nA 36-year-old man was walking through the station concourse when he was attacked by a man with a bread crate.\\n\",colour:\"blue\", title:\"\", maxWidth:200, open:0}] );\n}\n\nif (!window.googleMaps_Icons) window.googleMaps_Icons = {};\nwindow.googleMaps_Icons[\"blue\"] = {\"marker\":{\"image\":\"http://maps.gstatic.com/mapfiles/ms2/micons/blue-pushpin.png\"},\"shadow\":{\"image\":\"http://maps.gstatic.com/mapfiles/ms2/micons/pushpin_shadow.png\"}};\nif (!window.gmapsLoaders) window.gmapsLoaders = [];\nwindow.gmapsLoaders.push(CreateGMapgmap2015819145543);\nwindow.gmapsAutoload=true;\n/*]]>*/\n]]> \n\nThe story first appeared on The Sydney Morning Herald .", "source": "Camden Haven Courier"}