{"published": "2015-09-21T17:56:49Z", "media-type": "News", "title": "Fantasy debate: Trust the vets?", "id": "ff0a797a-60ee-4a99-b50b-1227bde77a12", "content": "Seeing several members of the old fantasy guard produce big games on Sunday -- Larry Fitzgerald, Steve Smith, DeAngelo Williams, etc. -- which one do you trust the most moving forward?\n\nMatt Franciscovich NFL Media Associate Fantasy Editor Fitzgerald to remain a solid option \n\nWith Le'Veon Bell making his return with the Steelers in Week 3, DeAngelo Williams' fantasy value is about to sink like a stone. So despite his hot start, Williams cannot be trusted as an every-week fantasy option for upcoming weeks. And although Steve Smith had a big day against the Raiders and hauled in 10 of his 16 targets for 150 yards, he wasn't as much of a factor in Week 1. His age seemed like it became a factor during the second half of the 2014 season as he basically fell off of the fantasy radar, which may happen again this season despite the lack of other trustworthy pass-catching options in Baltimore. So my pick of this bunch is the one and only Larry Fitzgerald. For two straight weeks now Fitz was the most targeted wideout on the Cardinals and has collected at least 87 yards in each game. As long as he stays healthy and Carson Palmer is under center in Arizona, Fitzgerald will be a target monster in the passing game. He will be an extremely valuable asset in fantasy leagues going forward, especially in PPR formats. Alex Gelhar NFL Media Writer/Editor Faith in Fitzgerald\n\nMany were set to write off Larry Fitzgerald in recent seasons, as his once insane levels of play dipped when he was forced to catch passes from the likes of Drew Stanton, Ryan Lindley and (gulp) Logan Thomas. However, over his last eight games with Carson Palmer, Fitzgerald has 46 catches, 682 yards and five touchdowns on 58 targets. The veterans are in sync when on the field together, and with Palmer looking like the runaway Comeback Player of the Year after two weeks, my faith is in Fitzgerald. He also has talent around him as well (John Brown, David Johnson, etc.), which means he can't completely get keyed in on the way Steve Smith can in Baltimore. Smith, while still a darn good player, needs someone to emerge alongside him before I can trust him as more than a matchup-based option. He'll get the target volume, but will be tough to trust given how the Ravens offense has struggled already through the early portions of the season. Matt Harmon NFL Media Associate Fantasy Writer Prefer the pass catchers\n\nLarry Fitzgerald and Steve Smith stand out to me. Almost all of the Arizona pass catchers nearly double their fantasy points per game when Carson Palmer plays versus when he sits over the last two years. With Palmer playing, and currently scoring as the QB3 in fantasy, we want shares of his top pass catchers. You could see on film last year that Larry Fitzgerald was far from finished. With Bruce Arians moving Fitzgerald to a more full-time slot receiver role, he'll feast on plus-matchups all season. We just witnessed his best game of the season, but he's in consideration for your WR2 spot every week. Steve Smith will be among the most targeted wide receivers every week this season. If for nothing else than attrition's sake alone. Until, and even likely after, Breshad Perriman hits the field, the Ravens have no one else to throw to. His target level gives him a safe floor, but he'll be a volatile producer given his age and the overall inefficiency of the Baltimore passing attack. You still want him on your roster, and will start him in good matchups. \n\nDeAngelo Williams feels like the obvious best sell-high candidate here. If you own DeAngelo Williams, but not Le'Veon Bell, be happy you got a two week flex rental, and try to sell him to Bell's owner. If you own both, make sure you hold on to Williams because he's shown he can produce if Bell ever goes down with an injury. Finally, if there is a dolt in your league who only pays attention to points scored, try and ship Williams off (currently the top scoring running back in standard leagues) to them for a player with a better season-long outlook. Williams deserves credit for his amazing performance to start this season, but his outlook gets dealt a near death blow hit with the return of one of the NFL's best all-around running backs.", "source": "NFL"}