{"published": "2015-09-21T20:25:46Z", "media-type": "Blog", "title": "Track List - Threshold Ride, Monday, September 21, 2015", "id": "2e6b1e02-cc2a-4fc7-9bef-6f6163f14541", "content": "CRUNCH FITNESS\nTuesdays**** and Thursdays* @ 7:00am\nMondays***, Wednesdays**, and Fridays @ 9:30am\nSaturdays*** @ 9:45am\n*Every Thursday morning class is Sexy Spin!\n**Every Wednesday morning class is a #totalrequestride\n*** Every Monday and Saturday morning class is a Threshold Ride!\n**** Every Tuesday morning class is the new Peak Performance Ride!\n1. Born This Way - Lady Gaga\n2. Get This Celebration Started (mashup) - Madonna & Pink\n3. I Got My Pride - Barry Harris featuring Pepper Mashay\n4. Express Yourself - Madonna\n5. Pride (A Deeper Love) (remix) - Aretha Franklin\n6. Perfect (remix) - Pink\n7. Worth It - Fifth Harmony featuring Kid Ink\n8. Tic Tok - Ke$ha\n9. Proud (remix) - Heather Small\n10. It's Raining Men - The Weather Girls\n11. 2 On - Tinashe featuring Schoolboy Q\n12. We Can't Stop - Miley Cyrus\n13. Want To Want Me/I Want You To Want Me (mashup)(Jason Derulo & Cheap Trick cover) - Andie Case\nThis morning's class was kinda special. There were a fewer number of people there than usual. So I decided to take a little different approach to the Threshold Ride today. We did the warm up. We worked hard to set our thresholds for the usual 3-minute period. But then, I went to each person in class, face to face, and asked them what was one thing they would like to specifically work on in class this morning. I gave everyone the option to opt-out if they wanted, but everyone participated! And it was an amazing experience! I LOVED the input! I had people say they wanted to work on their endurance. I had some say they wanted to work on their power. Some said they wanted to work on their bodies. I had one woman say that wanted to focus on her \"me\" time. I followed that up by asking her if she had kids. Yes, she did. A toddler and an infant less than a year old. Oh I get it! I totally get it! I even had someone say that they wanted to work on showing the guy that broke up with them yesterday what they were missing! Yes! It is that focus on yourself, because a workout is truly just that, time to work on yourself. It is so important to take the time to provide yourself with that \"me\" time. To improve and strengthen yourself. To change your mental feeling and outlook. To change your physical body in a way that will make you feel better about you! And it can happen right here in the Ride with Tommy! @crunchgym Crunch Fitness - Sunset. But you have to take the time. And often it is not easy. But life is all about balance. You can give and give of yourself for hours and hours at a time during the day...to your kids...your significant other...your boss...your co-workers...your friends. But unless you take the time to commit to being the best you that you can be, then you won't be able to give the others in your life the best you either! So which do you want to do? The classes are here. @crunchgym is here. @ridewithtommy is here. Make the effort to take the time to create a better you. The best you. Don't you want it? I know others want and deserve the best you that can be. You deserve it! Make it happen! Just do it! See you in class soon! Until then, in good health, tommy", "source": "Ride with Tommy!"}