{"published": "2015-09-04T11:49:02Z", "media-type": "News", "title": "Loving Ripon mother’s charity bike ride to honour suicide daughter", "id": "3f44dc8b-e164-4d97-9c1b-e2b5f5f1b744", "content": "To mark one year since teenager Anna King tragically died, her mother will take part in a charity bike ride from London to Brighton in her memory. \n\r\n\t\t\r \nAnna took her own life at the age of just 19 on October 8, 2014 and now her mother Caroline is aiming to raise £5,000 for two charities in her honour. \n\r  Anna King (s) \r \r \nThe team of 12, including Anna’s brother Tom and her aunt Juliette, will now bike the 54 mile route to raise money for young suicide prevention charity Papyrus and Beat, an eating disorder support group. \n\r\n\t\t\t\r \nAfter her death, one of Anna’s friends competed in a muddy 10k in her memory which Caroline said inspired her to take on a similar challenge for charity. \n\r\n\r\n\r\n\r \nShe said: “I wanted to do something that was near the anniversary of Anna’s death. It was just me and my sister that were initially going to be taking part and she didn’t even own a bike. \n\n“But then, as I mentioned it more and more people, they said that they wanted to join in. The response has been heart warming. \n\nCaroline said that, during her short life, her daughter Anna was constantly there for others and remembered her as ‘often putting their needs before her own’. \n\nNow she is hoping that the bike ride will raise awareness of some of the difficult issues young people face and highlight the support that’s available.She said: “Anna lived her all-too-short life to the full and made lasting memories for all who knew her. \n\r\n\t\t\t\r \n“She lived all of her life in Ripon and there were so many people that knew and loved her. Some days it can be fine dealing with it but at other times it can be difficult. \n\n“The charities we are raising money for as so important. It’s really shocked me how many people have been touched by what happened with Anna because they experienced similar problems. \n\n“Unfortunately for me, other young people have been able to get through their difficult times but Anna sadly wasn’t able to. \n\n“It’s not embarrassing to admit you have a problem, you can always ask for help and let people know you’re struggling. It can just be a phase you can be helped through.” \n\r\n\t\t\t\r \nTo donate, visit https://www.justgiving.com/teams/annasangelscyclingcrew.", "source": "Wetherby News"}