{"published": "2015-09-07T11:00:35Z", "media-type": "Blog", "title": "Woman Sues NYPD After Her House Was Repeatedly Raided by Cops Trying to Arrest Her Dead Husband", "id": "507d552f-db6a-495e-b78a-95783cad9af1", "content": "In a telling example of police incompetence, a poor woman has been repeatedly subject to cops raiding her house in a futile attempt to arrest her dead husband. In 1996, James Jordan Sr. was arrested for jumping a turnstile in New York’s subway. A decade would pass without police pursuing him and in 2006, Jordan would succumb to his diabetes and died at the age of 46. It wasn’t until he died that officers began looking for this turnstile-jumping hardened criminal, and they did so by harassing his widow. In 2014 alone, cops would tear apart the apartment of Karen Fennell four times as they searched for her dead husband who was wanted on a misdemeanor charge almost two decades old.\rThe repeated raids had gotten so out of hand that Fennell was forced to hang her dead husband’s death certificate and funeral flyer on the front door. But still, police came into her home and turned furniture upside down looking for this deceased man. “I wanted it to be the first thing they saw before they came into my home and flipped it upside down,” Fennell told The Post of her morbid posting. “I can’t hide anyone in my apartment. It’s not big enough for that. But they keep coming and insisting that he’s in my house.” After being harassed by countless teams of incompetent NYPD cops Fennell hired an attorney and filed a lawsuit. Last week, Fennell had enough stress of reliving her husband’s death and settled with the city for $10,000. While Fennell’s case may seem like a fluke, the fact is that police raid the homes of innocent people in attempts to locate suspects who do not live there, all the time. Not only do they raid the wrong house, but in some instances they even kill the innocent occupants.  Perhaps the saddest aspect of Fennell’s story is that this settlement will likely have little if any effect on the NYPD. They may very well show up at her house tomorrow. Receive The Underground Insider!\rSubscribe to the Underground Insider for Exclusive Content, Breaking News, Messages from Alex and More...\rInfowars.com Videos:", "source": "Infowars"}