{"published": "2015-09-13T03:36:40Z", "media-type": "News", "title": "Five key plays from Texas State's home opener", "id": "6d899e17-59a0-4113-a86c-438ec499ac92", "content": "The Texas State football team scored 63 points in its home opener. Here's the five key plays from the win. \n \n1. A new school record \n \nPrairie View A&M was trailing 27-3 with a couple seconds remaining in the first quarter, facing a 3rd-and-15 on Texas State’s 43 yard-line. The Panthers punted in order to pin the Bobcats in their own territory, but their plan was foiled by Brandon McDowell, sophomore cornerback. \n \nMcDowell fielded the punt and found some space to make a play. The sophomore ran past a couple of Panthers and all of a sudden a lane opened up for him. McDowell broke some tackles, and ankles, and took the punt across the field for a 95-yard punt return for a touchdown. McDowell is behind Brandon Smith, senior wide receiver, for punt returns, but after a return like this, Smith might be looking over his shoulder. \n \n2. Second chance \n \nIt took 88 seconds for Texas State to get on the board. Another touchdown followed less than two minutes later. The opportunity was created because Damani Alexcee, junior safety, forced a fumble that Trey McGowan, senior linebacker, recovered at Texas State’s 39-yard line. The fumble recovery opened up the game entirely by gifting another possession to the Bobcats. \n \n3. Back on track \n \nRobert Lowe, senior running back, scored the first touchdown of the game with 13:32 remaining in the first quarter. The touchdown was set up by a 49-yard completion to Jafus Gains, senior wide receiver, that put the team on the five-yard line. This drive set the tone for the rest of the game as Texas State showed their dominance all night over Prairie View A&M. Lowe rushed to the left side with ease and gave Texas State a 7-0 lead. \n \n4. Bowling ball \n \nOn third 3rd-and-3 in the redzone, Texas State went to Chris Nutall, senior running back. Nutall did enough to get the first down but he found more running room and took his carry into the end zone for six points. Nutall’s score gave Texas State a 14-0 lead with 9:54 left in the first quarter. All hopes of an upset for Prairie View A&M were diminishing after the score. The drive was the Bobcats’ second of the game and their high powered offense was on display early on in the game. \n \n5. Going long \n \nThe play started off looking like an option play with Tyler Jones, junior quarterback, but he pulled back from the option. Smith was wide-open in the secondary. The senior wide receiver hauled in the pass from Jones and the Panthers secondary was nowhere in sight. Smith took the catch for a 65-yard touchdown. The touchdown gave the team a 20-0 lead in the game. It was the first of three passing touchdowns for Jones.", "source": "University Star"}