{"published": "2015-09-15T16:35:00Z", "media-type": "News", "title": "Half of UK banknotes 'held overseas or used for black market'", "id": "adbd35c4-0813-4851-951a-8b2156e35588", "content": "At least half of all UK banknotes in circulation are held overseas or for use in the black market, a Bank of England report suggests. \n \nThe bank said evidence suggested that no more than half of Bank of England notes in circulation are likely to held for use domestically for legitimate purposes. \n \nThese include money in ATMs, consumers' purses and wallets and shop tills - which is estimated to account for around a quarter of all cash in circulation. \n \nAround £3 billion to £5 billion may be \"hoarded\" in homes \"to provide comfort against potential emergencies\", the report said. \n \nThe remainder is likely to be held overseas or for use in the \"shadow economy\", according to the bank. \n \nBanknotes with a value of £62.6 billion were estimated to be in circulation at the end of July - the equivalent of around £1,000 for every person in the country, according to the bank's latest figures. \n \nRecent industry figures showed that the number of cashless payments in the UK via card use and smartphones had overtaken the use of notes and coins for the first time. \n \nHowever, the value of banknotes in circulation has tripled over the last 20 years, according to the report. \n \nThe report concludes: \"Over the next few years, consumers will enjoy even greater choice when paying for goods and services and for paying each other. \n   Promoted stories   \n\"As a result, cash consumption as a proportion of overall spending in the domestic economy will continue to decline. \n \n\"However, given consumer preferences, recent historical trends, and the absence of significant initiatives on the part of retailers, banks or government to push people away from cash, the absolute amount of cash used for transactions is likely to remain resilient.\" \n \nThe report said 97% of the money belonging to people in the UK is held electronically as deposits, with the remainder held in physical form. \n \nIt said hoarders \"may choose to save their money in a safety deposit box, or under the mattress, or even buried in the garden, rather than placing it in a bank account\". \n \nPrevious figures suggested that 18% of people hoarded cash, and those that  did said the primary reason was to provide comfort against potential emergencies \n \nA chunk of cash in circulation is also used in the \"shadow economy\" to avoid government regulation, but the report said the size of this had not grown. \n   \n Share article  \n   \n\"Activity in the shadow economy has not seen significant growth, so transactional holdings of cash in the shadow economy are unlikely to have been the primary driver of the growth in banknote demand in recent years,\" the report said. \n \nCash will see a significant overhaul in the coming years, with a new 12-sided £1 coin entering circulation in 2017 and plastic £5, £10 and £20 notes being introduced by the Bank of England in the next five years.", "source": "Malton Gazette and Herald"}