{"published": "2015-09-11T21:16:06Z", "media-type": "News", "title": "Foreign campaign advice not illegal", "id": "15a55892-a2ec-409c-bf6d-32f08b5e89c2", "content": "OTTAWA — The independent watchdog who enforces Canada's election laws says there's nothing wrong with the Conservative party employing the services of controversial Australian campaign fixer Lynton Crosby.\r \n \n\r\n                            The Canada Elections Act specifies that it is illegal for anyone who is not a Canadian citizen or permanent resident to \"in any way induce electors\" to vote or refrain from voting for a particular candidate.\r \n \n\r\n                            But a spokeswoman for the commissioner of elections says providing advice to a campaign or working for a campaign is not considered inducement.\r \n \n\r\n                            The Conservatives confirmed Thursday that Crosby has been helping Stephen Harper's campaign team since March — primarily doing analysis of polling data — and continues to do so.\r \n \n\r\n                            Lynton has been dubbed the \"Wizard of Oz\" for his role masterminding four consecutive election victories for former Australian prime minister John Howard and British Prime Minister David Cameron's re-election earlier this year.\r \n \n\r\n                            But he's also been described in less flattering terms as \"a master of the dark political arts\" and the \"master of dog-whistle politics\" — a reputation New Democrats are using to try to scare up donations to their party.\r \n \n\r\n                            In a fundraising email blast to supporters Friday, the NDP referred to Crosby as an \"evil genius\" and \"an ultra-right-wing political strategist from Australia.\"\r \n \n\r\n                            \"He has a long record of helping Conservatives win around the world and now he's set his sights on our election. The Conservatives really will do anything to win — we can't let them,\" says the email.\r \n \n\r\n                            \"Stephen Harper's friends have played dirty in each of the last three elections. This one will be no exception.\"\r \n \n\r\n                            Greg Barns, an Australian lawyer and political commentator, agreed with that assessment.\r \n \n\r\n                            Employing Crosby \"shows Harper is desperate,\" Barns said in an email to The Canadian Press. \"Why? Because Crosby has one strategy only and it is scare campaigns. Appeals to insecure voters on issues like race.\"\r \n \n\r\n                            Barns predicted Crosby will try to paint NDP Leader Tom Mulcair and Liberal Leader Justin Trudeau as \"soft on migration and crime.\"\r \n \n\r\n                            Crosby could not be reached for comment.\r \n \n\r\n                            Duff Conacher, co-founder of Democracy Watch, blasted the elections commissioner for \"choosing not to enforce the federal elections law by ignoring the intention and spirit of measures in the law.\" The section of the law barring foreign involvement is titled \"non-interference by foreigners\" and explicitly says a foreigner may not \"in any way\" try to influence voters, he noted.\r \n \n\r\n                            But Conservative incumbent Jacques Gourde said there's nothing unusual in hiring the services of an outside adviser.\r \n \n\r\n                            \"When we're talking about political mechanics of elections, it's international now,\" Gourde said in Victoriaville, Que., where Harper had a campaign event Friday.\r \n \n\r\n                            \"There are advisers everywhere in the world that give advice to many people. Advice is never unwelcome, and it would be applied by people in Canada.\r \n \n\r\n                            Indeed, Harper's Conservatives have been tapping the wisdom of John Howard's Australian strategists since at least 2006.\r \n \n\r\n                            Both the NDP and the Liberals have sought advice in the past from U.S. President Barack Obama's strategists.\r \n \n\r\n                            By The Canadian Press", "source": "Simcoe.com"}