{"published": "2015-09-22T18:11:03Z", "media-type": "News", "title": "Ledley King brands Gabriel 'naive' over Diego Costa clash", "id": "61c0e7f1-321b-4dd2-8986-5fa1ad0fc5e3", "content": "Former Tottenham captain Ledley King insists he would have not been wound up by Diego Costa in the same \"naive\" way as Arsenal's Gabriel was on Saturday. \n \r\n\t\t\r \nChelsea striker Costa was involved in altercations with both Laurent Koscielny and Gabriel towards the end of the first half of the Blues' 2-0 win - with the latter shown a red card for his reaction in front of referee Mike Dean. \n\r  Arsenal's Gabriel Paulista, right, was sent off after clashing with Chelsea's Diego Costa on Saturday \r \r \nArsenal have since appealed against the dismissal while Costa has subsequently been charged with violent conduct for his part in the spat. \n\r\n\t\t\t\r \nIn the end though, the absence of Gabriel saw Arsene Wenger's men struggle in the second half - with Santi Cazorla also sent off in the closing stages as goals from Kurt Zouma and Eden Hazard earned Chelsea the points. \n\r\n\r\n\r\n\r \nA Capital One Cup third-round clash with fierce local rivals Spurs is next up for Arsenal, with King saying he would have treated the challenge of Costa differently to give his side the chance of getting a result. \n\n\"It depends what kind of person you are, what kind of player you are,\" he said when asked about the best way to deal with an aggressive striker such as Costa. \n\n\"Costa is clever and he probably picked on the right player and he got what he was looking for - Gabriel was naive in that sense. As a player you have to figure out a way to get back at him at the best way possible. \n\n\"To me that is staying on the pitch and making sure you make it as hard as possible for him to score - that is the way I would have done it. \n\r\n\t\t\t\r \n\"He is a player who knows what he is doing but I would have loved to have played against him - he is different and it is not something we are used to, it is intriguing and it is up to players to work out how to deal with him and how to cope with him best. \n\n\"There weren't too many times when players wound me up but when it did happen it just gave me that incentive to really shut them down and make sure they didn't get a sniff. \n\n\"Everyone is different and has different ways of trying to deal with players but ultimately you want to win the game and the best way to win it is to stay on the pitch and have a say on the result. That was my motto.\" \n\nSpurs lost in the final to Costa's Chelsea last season but, with such a young squad at Mauricio Pochettino's disposal, King feels that experience will help the players in their quest to win a trophy this year. \n\r\n\t\t\t\r \n\"It was a great run last season - obviously just falling short against Chelsea,\" he added. \n\n\"Being at Wembley, I could see what it meant to the fans - they were proud to be there with an opportunity to win something. There were a lot of young players and maybe the inexperience cost them against Chelsea. \n\n\"Having that experience behind them will be great for the team and having the opportunity to go back to Wembley again they will expect a different outcome. \n\n\"That is the aim. Get through this tie and work their way back to Wembley again. You get a taste for it, once you have gone through that game, although you come out a loser, it is great experience and good players will take something from it to make them a better player. \n\n\"I lost to Blackburn in 2002 as a young player and you think the chance is going to come around every year and it didn't for me. I got to the final six years later and drew on those experiences and we won it.\" \n\r\n\t\t\t\r \n:: Ledley King was speaking on behalf of The Football League and Capital One - the credit card in your corner. Visit facebook.com/CapitalOneUK \n\n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Pontefract & Castleford Express"}