{"published": "2015-09-30T18:00:03Z", "media-type": "Blog", "title": "John Boos Jasmine Block Table", "id": "58e609cb-b184-4171-b2e5-3d9e8d9633ca", "content": "John Boos Jasmine Block Table\tPosted in Uncategorized - September 30, 2015 - 0 Comment\tPulltap’s Corkscrew The Pulltap’s Corkscrew from Franmara- Features a contoured steel handle, Teflon spiral, a unique hinged double-lever system and serrated knife blade. Black handle. Check Prices on Pulltap’s Corkscrew\nAll Stainless Single Door Reach-In Freezer The Super Deluxe series single door reach-in freezer from Turbo Air features:a 23 cubic feet, self-contained unit304 stainless steel exterior and interiorhinged solid door with recessed handle3 adjustable, stainless steel wire shelvesexterior LED digital thermometer4″ castersbottom mount, ENERGY STAR rated, 1/2 HP compressordigitally controlled temperature system that enables temperature control without opening the doorfreshness of products lasts longer by keeping the correct temperaturedesigned with over-sized evaporators and condensers for faster cooling and greater efficiencya bottom-mount compressor provides energy savings, high efficiency and easy servicethe bottom-mount compressor also allows the food to be placed in an ergonomically correct location and shows the status of the freezer immediatelyno plumbing required, simple installationdoor is equipped with self-closing and stay open featureself-diagnostic systemfreezer holds -10 F for the best in food preservation-holds f Check Prices on All Stainless Single Door Reach-In Freezer\nCal-Mil Euro Cases Model CAL-289 (left) 15″Wx13″Dx11″H Model CAL-P-255 (right) 15-1/2″Wx17″Dx16-1/4″H Euro front, rear door. 289 includes 2 10×14 inch trays. P-255 includes 3 10×14 inch trays. Check Prices on Cal-Mil Euro Cases\nDynamic Salad Spinner SD-92 Dries up to 6-8 heads of lettuce. 5 gallon capacity. Manual operation; dries in minutes. Check Prices on Dynamic Salad Spinner SD-92\nJohn Boos Jasmine Block Table The Jasmine Block Table from John Boos has a hard rock maple top with an end grain constructed butcher block surface in Boos Cream with beeswax finish. Painted base, shelf and self closing drawer(s). Available sizes are 24″x24″ with 1 drawer, 36″x24″ with 1 drawer, or 48″x24″ with 2 drawers. 35″ overall height. Maple top is 3″ thick. Shown in buttercup yellow, 11 other colors available. Please allow 3-4 weeks for delivery of this item. 24″x24″, 1 drawer – $675.0036″x24″, 1 drawer – $825.0048″x24″, 2 drawers – $995.00Available colors: Barn Red, Black, Cherry Stain, Eggplant, Natural Maple, Alabaster, Sporty Blue, Sage Green, Tangerine, Useful Gray Stain, Basil Green (See color chart below). Check Prices on John Boos Jasmine Block Table", "source": "The Best Chef"}