{"published": "2015-09-28T11:41:07Z", "media-type": "News", "title": "Shady dealings of William Shakespeare’s father ‘helped to fund son’s plays’", "id": "0459347b-c753-4f05-961c-95758ea5d1d1", "content": "Research into family finances gives fresh insight into the playwright’s early life story The story of how William Shakespeare’s father slipped from wealth to bankruptcy, leaving his impoverished son to struggle to establish himself as a poet and actor before making his own wealth in the London theatre, has long been an established part of the mythology surrounding the playwright. But a new study of the family’s business in the wool trade suggests this is far from an accurate account.\n\nDavid Fallow, a former financier, has spent years studying the Shakespeare family’s wealth, poring over documentary evidence from a time when “wool was to the English economy what oil is to Saudi Arabia today”.\n\nIt has long been assumed that Shakespeare’s father was a small-town glover and dealer in hides and wool, who went from riches to rags. The new research suggests that, far from going bust, John Shakespeare was reinvesting in wool and making even more money than ever, some of it via shady deals. It was also wool, not the theatre, that prompted William to leave Stratford-upon-Avon for London in 1585, where he could act as the family’s business representative.\n\nFallow analysed financial records of the time, including wool markets, the value of exports from regional ports, statistics on the rise of trade in London and industry consolidation, as well as Stratford court documents from John Shakespeare’s illegal wool trading and the modest revenue generated by the theatres. Using his business acumen, he has pored over figures that he believes literary scholars have struggled to understand: “You get some very brilliant academic writing about Shakespeare. The minute they try to talk about money or numbers, it becomes almost incomprehensible.”\n\nFinancial transactions and other surviving records have led him to conclude that the portrayal of John Shakespeare as a failed trader is a fable: “John Shakespeare was a national-level wool dealer, and legal research, coupled to analysis of the wool market, proves this. The Shakespeare family never fell into poverty.”\n\nHe also argues that the family’s wealth could not have come just from William’s theatrical activities: “Nobody made a fortune from theatrical seat sales alone.”\n\nFacebook Twitter Pinterest Detail of a drawing of William Shakespeare’s house in Stratford-Upon-Avon. Illustration: Universal History Archive/UIG via  Leading scholars Stanley Wells and Paul Edmondson of the Shakespeare Birthplace Trust, the academic charity, are so interested in Fallow’s research that they commissioned him to write a chapter for a major publication marking next year’s 400th anniversary of Shakespeare’s death. Fallow is among 25 of the world’s foremost academics and writers, including Michael Wood, Germaine Greer and Margaret Drabble, who have contributed essays to The Shakespeare Circle: An Alternative Biography, to be published by Cambridge University Press later this year.\n\nFallow, born in Glasgow, read law at Aberdeen University before working in finance for some 20 years. As senior vice-president of the US Bank in Portland, Oregon, among other posts, he specialised in structured finance – “the modern version of Shakespeare’s tithes, one of the things that drew me to this research,” he said. He also headed two money management companies in the US with multi-billion-dollar assets, making enough money to take early retirement aged 45, some 15 years ago. He then enrolled at Exeter University, for an MA in “staging Shakespeare” followed by a doctorate on the Shakespeare family wealth, on which he is now writing a book.\n\nCommenting on his research, Wells told the Observer: “He’s done a very great deal of very serious research.” Edmondson addedsaid: “It explains how Shakespeare was able to afford shares in the Lord Chamberlain’s Men [the theatrical company for which he wrote and acted]… and remarkably large purchases of land in the Stratford area.” Those purchases included a house with up to 30 rooms and extensive grounds that would have required servants.\n\nJohn Shakespeare had been an alderman, regulating Stratford’s affairs, when he withdrew from public life in 1576. Wells said: “The assumption has always been that he became hard up. Fallow builds a considerable argument on the idea that [he] withdrew not because he was poor, not because his fortunes declined – as has regularly been assumed – but because he had an alternative way of earning money, which was a bit shady.” At a time when the selling of wool trading licences was a crucial source of Crown revenue, Fallow writes: “Rising prices fuelled the growth of the wool-broking business and spawned … legal, quasi-legal and downright illegal traders … Changes in markets forced a concentration of the export trade through London. To survive, the Shakespeare family business had to have a London representative.”\n\nHe argues this could explain William Shakespeare’s activities during the seven “lost” years from 1585 in which he virtually disappears from the record. Seven years was the exact term of a traditional apprenticeship\n\nBut Wells takes issue with that theory: “It seems to be quite clear that Shakespeare had made a start in the theatre business several years before the end of that seven-year period.”\n\nFallow also challenges the assumption that desperate finances drove John Shakespeare to sell family assets at low prices. In fact, financial records show that he was putting his property, including land, in the hands of friends and family, Fallow said. “If you look at the [sale] prices, they’re all ludicrously low. In the past, people said that’s because he was in a hurry. No, you’re talking about a tiny fraction of what they’re really worth.” These sales, Fallow believes, reveal John Shakespeare’s attempt to outwit the taxman.\n\nEach scholar in the Cambridge publication has examined and reconstructed the lives of those closest to Shakespeare. This is “an original biographical approach”, said Edmondson, that has yielded exciting new insights by “working from the outside in”.\n\n• This article was amended on 28 September 2015. An earlier version of the main photo caption referred to the painting as 16th, rather than 19th, century.", "source": "Guardian.co.uk"}