{"published": "2015-09-25T19:15:07Z", "media-type": "News", "title": "99 Homes Will Devastate You, Especially if You're a Dad", "id": "ef1134cf-95a0-4fe3-8052-3860aba795bb", "content": "Broad Green Pictures / Everett Collection \n\nYou know what never fails to make audiences senselessly sad? Well, horses in peril, for one. But even worse than that—parent kryptonite —are scenes in which parents feel ashamed in front of their children. In 99 Homes , in theaters today, director Ramin Bahrani uses these scenes to great effect. Next time you worry that adulthood has made you an emotionless husk, watch 99 Homes and feel everything . \n\n99 Homes stars Andrew Garfield as Dennis Nash, a young dad who gets caught up in the 2010 housing market collapse in Florida. First Nash is evicted by irredeemable real estate broker Rick Carver (expertly played by Michael Shannon , always the bug-eyed villain.) In an effort to earn back his home and the respect of his family, Nash joins Carver, enforcing evictions and making bank by ruining the lives of families like his. \n\nIt's hard to get any sense of the indignity of the foreclosure crisis from a business story, and foreclosure is a decidedly unsexy topic for a filmmaker. But anyone who saw Man Push Cart will tell you that Ramain Bahrani has a knack for making a seemingly banal circumstance into an intense visceral experience for audiences. Nash's quandary is heartbreaking for anyone. Too ashamed to tell his family and friends (largely victims of foreclosure themselves) about his new job, he gets caught up in a lie and his life begins to unravel. Meanwhile, families are getting evicted left and right; their belongings are haphazardly strewn on lawns while their kids stand by, bewildered. It's impossible not to empathize with the parents who plead with Carver and Nash, and who invariably and understandably lose their composure. In those scenes Garfield is as unstable as Shannon is cold, and damned if those moments don't come back to haunt you. \n\nDon't miss 99 Homes , but beware. This one is a doozy. \n\n[embedded content]", "source": "GQ US"}