{"published": "2015-09-30T13:25:57Z", "media-type": "News", "title": "Microsoft SQL Server MVP Denny Cherry to Present: \"Standalone to High Availability SQL Server Clusters in Minutes\"", "id": "afda0779-81bf-4e24-bfb1-ac9747bb5276", "content": "DH2i(TM) Company, recently named a Cool Vendor by Gartner in the \"Cool Vendors in Servers and Virtualization, 20151\" report, today announced Microsoft SQL Server MVP and consultant Denny Cherry will present: \"Standalone to High Availability SQL Clusters in Minutes.\" \n\nhttp://photos.prnewswire.com/prnvar/20120924/LA79538LOGO \n\nTweet this: .@Microsoft #SQL Server MVP @MrDenny to Present: \"Standalone to High Availability SQL Server Clusters in Minutes\" http://dh2i.com/denny-cherry-presents-standalone-to-high-availability-sql-server-clusters-in-minutes/ \n\nAbout DH2iDH2i Company(TM) is the leading provider of Microsoft Windows Server application portability and management solutions. Its newly launched flagship solution, DxEnterprise(TM), containerizes and decouples Microsoft Windows Server applications and data from the host OS and underlying IT infrastructure. This decoupling provides users with the ability to move their traditional enterprise applications such as SQL Server or new multi-container-based applications with data from any host, to any host, anywhere with near-zero downtime maintaining a consistent application connection endpoint. In doing so, customers are able to better consolidate their environment, build and manage hybrid physical, virtual and/or cloud environments, dramatically simplify management, and ensure service level agreements (SLAs). The bottom line for customers equals a 30%-70% reduction in software and related infrastructure costs, ensured application availability, and a 70%+ increase in application management productivity. DH2i is included in the list of Cool Vendors in the \"Cool Vendors in Servers and Virtualization, 20151\" report by Gartner, Inc. To learn more, please visit the DH2i website: www.dh2i.com, call: 970-295-4505 or +44 20 3318 9204, or email: info@dh2i.com. \n\nAdditional Resources:- Join the conversation: Twitter, LinkedIn, or Facebook.- Read and Discuss: DH2i Blog.- Watch and Learn: DH2i YouTube Channel. \n\n[1]\"Cool Vendors in Servers and Virtualization, 2015\" by Philip Dawson, Thomas J. Bittman, George J. Weiss and Andrew Butler, April 16, 2015 \n\nGartner does not endorse any vendor, product or service depicted in its research publications, and does not advise technology users to select only those vendors with the highest ratings or other designation. Gartner research publications consist of the opinions of Gartner's research organization and should not be construed as statements of fact. Gartner disclaims all warranties, expressed or implied, with respect to this research, including any warranties of merchantability or fitness for a particular purpose. \n\n© DH2i Company 2015. DH2i, DxEnterprise, DxConsole, DxHADR, DxTransfer, DxCollect and InstanceMobility are trademarks of DH2i Company. All other brand or product names contained in this press release may be trademarks or registered trademarks of their respective holders. \n\nPR Contact:Nicole GormanCorporate CommunicationsDH2i CompanyM: 508-397-0131nicole.gorman@dh2i.com \n\nLogo - http://photos.prnewswire.com/prnh/20120924/LA79538LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/microsoft-sql-server-mvp-denny-cherry-to-present-standalone-to-high-availability-sql-server-clusters-in-minutes-300151575.html \n\nSOURCE DH2i \n\nhttp://rt.prnewswire.com/rt.gif?NewsItemId=LA15826&Transmission_Id=201509300915PR_NEWS_USPR_____LA15826&DateId=2015", "source": "Individual.com"}