{"published": "2015-09-03T13:50:00Z", "media-type": "News", "title": "September 4 Deadline in Lawsuit for Investors in Edison International (NYSE:EIX) Shares Announced by Shareholders Foundation", "id": "622acef4-c9ec-469b-b393-3d4d5732d9ab", "content": "SAN DIEGO, Sept.  03, 2015  (GLOBE NEWSWIRE) -- The Shareholders Foundation, Inc. announces that a lawsuit was filed on behalf of certain purchasers of shares of Edison International ( NYSE:EIX ) over alleged Violations of Federal Securities Laws by Edison International. \n\nInvestors who purchased shares of Edison International ( NYSE:EIX ) have certain options and for certain investors are short and strict deadlines running. Deadline: September 4 2015. ( NYSE:EIX ) investors should contact the Shareholders Foundation at mail@shareholdersfoundation.com or call +1(858) 779 - 1554. \n    \nThe plaintiff claims that defendants made certain false and/or misleading statements and/or failed to disclose that Edison International’s ex parte contacts with the California Public Utilities Commission decision makers were more extensive than the Company had reported to the California Public Utilities Commission (“CPUC”), that belated disclosure of Edison’s ex parte contacts with the CPUC personnel would jeopardize the Company’s $3.3 billion dollar San Onofre Nuclear Generating Station Settlement, and that as a result of the above, Edison International’s financial statements were materially false and misleading at all relevant times. \n \nAccording to the Complaint, on June 22, 2015, the law firm Strumwasser & Woocher released an independent report commissioned by the CPUC in connection with a review of ex parte meetings between utility lobbyists or executives and the CPUC decision makers.  The report described such ex parte meetings as \"frequent, pervasive, and at least sometimes outcome-determinative,\" and recommended banning them altogether in rate cases. \n \nOn June 24, 2015, in response to the report and earlier disclosures by Edison's largest subsidiary, Southern California Edison, the Utility Reform Network (\"TURN\") filed an application with the CPUC that charged Southern California Edison with \"fraud by concealment\" and urged the CPUC to set aside the San Onofre Nuclear Generating Station Settlement and reopen its investigation. \n \nOn June 24, 2015, a report was published that stated Edison International stock declined \"in reaction to news that the Utility Reform Network consumer group is recommending the California Public Utilities Commission throw out the already-approved settlement in the San Onofre nuclear plant investigation.\" \n \nThose who purchased NYSE: EIX shares have certain options and should contact the Shareholders Foundation, Inc. by e-mail at mail@shareholdersfoundation.com or call +1 (858) 779-1554. \n \nThe Shareholders Foundation, Inc. is a professional portfolio legal monitoring and a settlement claim filing service, which does research related to shareholder issues and informs investors of securities class actions, settlements, judgments, and other legal related news to the stock/financial market. The Shareholders Foundation, Inc. is not a law firm. The information is provided as a public service. It is not intended as legal advice and should not be relied upon. \nShareholders Foundation, Inc.\nMichael Daniels\n+1 (858) 779-1554 mail@shareholdersfoundation.com 3111 Camino Del Rio North\nSuite 423\nSan Diego, CA 921", "source": "Town Hall"}