{"published": "2015-09-29T14:15:21Z", "media-type": "News", "title": "Novo Nordisk Launches New Medical Resource for People Living with Hemophilia and Other Rare Bleeding Disorders", "id": "151a87bc-c7a4-46e7-b146-1fe38e8d7d01", "content": "PLAINSBORO, N.J., Sept. 29, 2015 /PRNewswire/ Novo Nordisk today announced the launch of RareBleedingDisorders.com, a website providing a range of medical information specifically for people in the United States living with hemophilia and other rare bleeding disorders, as well as their caregivers. The website, developed with input from members of the bleeding disorders community, is a simple, centralized repository featuring the latest diseasestate specific information and research updates. \"Patients and caregivers should be focused on successfully managing the bleeding disorder, but too often their energies are spent on the overwhelming task of piecing together the right information,\" said MaryJane Frey, nurse coordinator at Children's Hospital of Michigan and a consultant on the website. \"Tools such as RareBleedingDisorders.com address this need by providing a single point of entry, making relevant medical information easily accessible to the bleeding disorders community.\"\n\n\"Novo Nordisk collaborated with medical professionals, people with bleeding disorders and caregivers to create this dynamic resource that helps community members bcome better informed,\" said webmaster David Cooper, M.D., MBA, senior director of Medical Affairs, Novo Nordisk. \"RareBleedingDisorders.com explores the mechanism of disease, signs and symptoms, and risk factors, as well as the process for appropriate diagnosis and treatment of congenital hemophilia A and B, acquired hemophilia, congenital factor VII deficiency, congenital factor XIII deficiency, Glanzmann's thrombasthenia and other rare bleeding disorders.\" A key feature of the website is a news channel highlighting the most salient data from leading patient and health care professional congresses. The website also offers a comprehensive glossary and resource database, gathering highcaliber material available from advocacy groups, professional organizations and government agencies. \n\n\"Novo Nordisk's commitment to changing possibilities in hemophilia inspired us to create RareBleedingDisorders.com with input from the community,\" said Natalia Holot, M.D., Ph.D., executive director of Medical Affairs, Novo Nordisk. \"Our medical team worked closely with patients, their families and health care professionals to better understand the challenges they face and ensure the content provides utility to those managing these conditions each and every day.\"\n\nTo learn more, visit RareBleedingDisorders.com. \n\nAbout Novo Nordisk \n\nNovo Nordisk is a global healthcare company with more than 90 years of innovation and leadership in diabetes care. This heritage has given us experience and capabilities that also enable us to help people with other serious chronic conditions: hemophilia, growth disorders and obesity. Headquartered in Denmark, Novo Nordisk employs approximately 39,000 people in 75 countries and markets its products in more than 180 countries. For more information, visit novonordiskus.com or follow us on Twitter. \n\nNovo Nordisk is a registered trademark of Novo Nordisk A/S.\n\n© 2015 Novo Nordisk All rights reserved. September 2015 Logo http://photos.prnewswire.com/prnh/20020404/NVOLOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/newsreleases/novonordisklaunchesnewmedicalresourceforpeoplelivingwithhemophiliaandotherrarebleedingdisorders300150309.html SOURCE Novo Nordisk Inc. [ Back To Cloud Computing 's Homepage", "source": "TMC Net"}