{"published": "2015-09-15T13:36:00Z", "media-type": "Blog", "title": "What to do when business dries up at home: A thought on tailoring from the world of E&P training", "id": "cd807d89-7d6f-4968-9ff8-95fdbc37edb3", "content": "What to do when business dries up at home: A thought on tailoring from the world of E&P training Tuesday, September 15, 2015       Mark Bentley from AGR Petroleum Services More articles by this author   Follow @OilVoice\rFollow @OilVoice\r  Low oil prices, shrinking margins (or no margin at all), loss of jobs and perhaps the decline of the industry as a whole - the topic has been hanging around us like a dark cloud for over a year now.\nOne of the most persistent discussions has been whether this is just 'the cycle' or whether there is something structurally different about this down-turn for the North Sea - most people conclude it is a little different this time around.\nWhich begs the question - what is the future for the thousands of us working in the North Sea?\nIn the service sector most businesses follow the instinctive desire to hang in, hope for the local upturn and look further afield for work yet keep our companies based in the North East but is this workable in the long term? We suggest yes, but not as we know it today, and offer training as an example.\nThe notion of working globally from North East Scotland is certainly less fanciful than it would have been one or two decades ago. What is fanciful is the notion that Aberdeen can simply export Aberdeen to an eagerly waiting world that just wishes to be, well, more like Aberdeen.\nThe idea of 'internationalising' is a simple and obvious one - the tougher question is how to do it well when there are plenty of emerging providers in other regions?\nThe key would seem to be to avoid simply exporting the North Sea expertise but instead package the same skills in a more tailored way and/or offer unique bespoke products which others simply don't, or can't do so well.\nIn our world of training this is readily apparent.\nAGR's TRACS Training brand has always worked globally, and the brand distinction is the delivery of tailored courses, rather than off-the-shelf products. These take more time and effort to build and maintain than standard commodity products but they are internationally portable and no one comments on where we're based.\nAn extreme example of non-tailoring would be a training organisation known to us who designed a course based around the North Sea environment and exported it wholesale to the Middle East. The fact that the case study material embedded in the course was based on offshore projects didn't seem to phase the course designers - driven by a belief in consistency, the lack of relevance of offshore technology for desert countries was comfortably overlooked.\nThe tailored alternative of course is to drop the marine aspects. The more subtle but necessary effort is the complete deconstruction of the course to pick out the generic aspects relevant to the Middle East client group, add in the locally specific content which would not have been in the North Sea version of the course and rebuild the event around the interests of the new group.\nThis all requires effort, and goes far beyond simply cutting out the 'bits about the North Sea', but that effort is necessary to transfer the skills and knowledge of the North Sea based experts to a new domain.\nThis approach is applicable generically. It is our belief that exporting skills and experience from anywhere requires this type of approach, yet not all companies are doing it. It is easier to simply try to export the standard products and activities, and see if that works.\nThe question for each of us in our respective businesses is therefore to open up the anatomy of our skills and products - literally take them apart and consider what is special or useful about each piece. Some things we have done and learned really probably were for the North Sea only; other things are not and therein lies the value. Rather than simply package up the same products and offer them optimistically to 'interested others' elsewhere, we are required to critically think through and isolate the components which carry value internationally.\nThe result may be surprising. It may be just part of an existing product but could equally not be a product at all but rather the thoughts of the people who had the flair to the build the product in the first place.\nFor sure, it is likely to be different, and 'different' can still be based in the North East.\nThis article was originally published in the Business Bulletin of Aberdeen & Grampian Chamber of Commerce, www.agcc.co.uk . Follow @OilVoice\rFollow @OilVoice\r  Join 80,000 oil and gas professionals who receive our weekly newsletter.\rYou may unsubscribe at any time with one click.\rArticle Tags\nUnited Kingdom West Europe Finance Aberdeen North Sea Mark Bentley from AGR Petroleum Services More articles by this author  \rThis article is for information and discussion purposes only and does not form a recommendation to invest or otherwise. The value of an investment may fall. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment adviser. More\rRelated News Fracking debate needs to grow up\rExtracting the Truth\rExploration in the UKCS: Pushing the Limit\rClean Energy no longer just for tree-huggers, as oil nations look to renewables\rUK oil industry must walk a regulatory tightrope to maximise economic recovery and survive the latest crisis\r2014 Was Not 1985, So 2015 Will Not Be 1986\rUpcoming OilVoice Training Course\nIntroduction to Oil and Gas Exploration and Production\nThis module is designed for people interested in the exploration and production of oil and gas who do not have a subsurface technical background. It provides an introduction to geology and geophysics for non-geoscientists, with an emphasis on the latest interpretation techniques, showing oilfield ex...\rExpand London - 18 Nov\nTrainer\nHelen Turnell\nCost\n£500\nDiscount Code\nOilVoice-10 for 10% off any course.View Course\rAll OilVoice Training Courses", "source": "OilVoice Headlines"}