{"published": "2015-09-09T21:49:00Z", "media-type": "News", "title": "Franchise Services of North America Inc. Completes Sale of Practicar Systems Inc.", "id": "7e323721-9798-4345-a9e7-a7bb5e02dc92", "content": "RIDGELAND, MISSISSIPPI -- (Marketwired) -- 09/09/15 --   FRANCHISE SERVICES OF NORTH AMERICA INC. (\"FSNA\" or the \"Company\") ( TSX VENTURE: FSN ) is pleased to announce that it has completed the sale of all of the issued and outstanding shares of Practicar System Inc., a wholly owned subsidiary of the Company, to Grandville Equities Corp. (\"Grandville\") for an aggregate cash purchase price of $200,000 (the \"Transaction\"). Grandville intends to grow this business with additional investments to address working capital deficits and by expanding vehicle rental, car sales, leasing and insurance solutions in Canada's used car market. \n\nThe assets of Practicar constituted less than 4% of the total assets of FSNA. The Transaction is anticipated to improve the cash flow of FSNA and allow FSNA to focus on its core business units which are primarily based in the United States. \n     \nAbout Grandville \n\nSince 2000 Grandville Equities Corporation has provided Executive Leadership as a management and finance business for restructuring and emerging businesses. In 2013 Grandville expanded, offering working capital to restructure and build quality businesses. Grandville provides management, equity and innovative loans generally structured as demand, first lien position or senior secured facilities. Grandville attempts to only invest where the agreed path is to full return and repayment along with regained financial stability. Grandville also owns and operates a portfolio of businesses. \n\nAbout FSNA \n\nFSNA is a publicly traded company listed on the TSX Venture Exchange. The Company and its subsidiaries own the following brands: U-Save Car & Truck Rental® (\"U-Save\"), U-Save Car Sales, Auto Rental Resource Center (\"ARRC\"), Xpress Rent A Car, Sonoran National Insurance Group and Peakstone Financial Services. \n\nU-Save, together with its subsidiary ARRC, has over 900 locations throughout the United States and is one of North America's largest franchise car rental companies. U-Save currently services 19 airport markets in 13 different states. Although primarily based in the United States, U-Save has 18 international locations in Mexico, Greece, the Middle East, Latin America, and the Caribbean. \n\nWith more than 150 years of combined insurance experience, Sonoran National Insurance Group is licensed in all 50 states and serves customers in every part of the country. Sonoran provides an entire range of business and personal insurance solutions customized to the needs of its clients. \n\nForward Looking Information \n\nCertain statements made in this news release are forward-looking in nature, including statements concerning the potential benefits of the Transaction. The words \"may\", \"could\", \"should\", \"would\", \"expect\", \"intend\", \"estimate\", \"anticipate\", \"believe\", or \"outlook\" and similar expressions often identify forward-looking information. By their nature, forward-looking statements require FSNA to make assumptions and are subject to inherent risks and uncertainties. The forward-looking statements contained in this news release are based on certain key expectations and assumptions made by FSNA. Although FSNA believes that the expectations and assumptions on which the forward-looking statements are based are reasonable, undue reliance should not be placed on the forward-looking statements because FSNA can give no assurance that they will prove to be correct. These forward-looking statements also involve known and unknown risks, uncertainties and other factors that may cause the actual results, performance or achievements of FSNA to differ materially from the anticipated results, performance or achievements or developments expressed or implied by such forward-looking statements. If any such risks actually occur, they could materially and adversely affect FSNA's business, financial condition or results of operations. FSNA's forward-looking statements are qualified in their entirety by these cautionary statements. In addition, the forward-looking statements are made only as of the date of this news release, and except as required by applicable securities law, FSNA undertakes no obligation to publicly update these forward-looking statements to reflect new information, subsequent events or otherwise. \n\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.", "source": "MoneyShow.com"}