{"published": "2015-09-02T14:35:01Z", "media-type": "News", "title": "Perth Airport adopts Amadeus' cloud technology to...", "id": "bf5586d3-41cf-45a6-8bb4-9b8967f95e9f", "content": "Perth Airport is implementing Amadeus’ ACUS, a cloud-based technology to benefit airline customers and travelers. This agreement marks Amadeus’ continued expansion of its airport IT business in the Asia Pacific region, with Perth Airport its first customer in Australia. \n\nThe next generation, cloud-based ACUS solution will make use of application virtualisation, allowing passenger processing systems to be accessed and deployed anywhere, on demand. This means airlines can use the platform from a desktop computer, laptop or mobile device, and enables passengers to be checked-in and boarding passes to be printed from any location. \n\nGround handlers will also be able to handle passenger processing for multiple airlines at the same time from any gate or terminal and from any device. \n\nAny combination of applications can be hosted without any constraint or limitation on the actual workstation or device. The common use platform will also simplify user training, allowing for the rapid deployment of new employees. \n\nThe infrastructure and hardware reduction also means that Amadeus’ environmentally-friendly platform is expected to help Perth Airport reduce its carbon dioxide emissions and improve its environmental footprint. \n\nRowan Chalmers, Perth Airport Executive General Manager Operations and Customer Experience said that  this partnership  will put Perth Airport in a more proactive, reliable and flexible position when it comes to the check-in process. \n\n“The advanced systems we are delivering with Amadeus will provide a higher level of customer experience. During our selection process, it became clear that Amadeus was the only common use provider to truly deliver on the cloud-based model, bringing clear financial and structural benefits,” he said.  \n\nThe investment in technology aligns with Perth Airport’s AUD$1 billion overall transformation of infrastructure. \n\n“Moving to the Amadeus’ cloud-based common use system means we will be able to cut passenger processing costs by more than 25 per cent for our airline partners. That was a key consideration when selecting this new and innovative system,” Chalmers said.  \n\nCaroline Wilkie, Chief Executive Officer, Australian Airports Association said the introduction of the Amadeus platform was another example of how Australian airports were investing in the latest technology to deliver better and more flexible services for passengers and airlines. \n\n“As Australian airports continue to handle ever increasing numbers of passengers and aircraft movements, their adoption of innovative technology solutions will help in providing a better experience for passengers while also meeting the operational needs of their airline customers,” Wilkie said. \n\n“Airports across the world are under pressure to think differently in order to handle increasingly significant numbers of passengers, and modern technology has a huge role to play. The deployment of ACUS is only the beginning of our partnership with Perth Airport, and we look forward to continuing to work closely together,” said John Jarrell, Head of Airport IT, Amadeus. \n\nThis partnership follows the launch of ACUS at Innsbruck Airport, announced in February and the major deal signed with The Avinor Group in June to adopt ACUS in the airports it operates in Norway.", "source": "Network World Asia"}