{"published": "2015-09-01T20:41:29Z", "media-type": "News", "title": "Jamie Gutfreund Named Wunderman's Global CMO", "id": "2d025994-dd2c-44a8-8056-6316e909d7e0", "content": "]]> \nNEW YORK , Sept. 1, 2015 /PRNewswire/ -- Wunderman CEO Mark Read has tapped Jamie Gutfreund to be global chief marketing officer. Jamie will lead global marketing efforts grounded in Wunderman's promise of delivering data-driven creativity. She will work directly with Wunderman's 175 offices around the world to build marketing strategies that leverage the global network's data and creative capabilities. Based in New York , Jamie joins Wunderman from Deep Focus, where she served as chief marketing officer. \n\n\"Jamie has a proven track record as an outstanding storyteller who is insights-driven,\" said Mark. \"The combination of these skills and her willingness to take smart, creative risks makes her an ideal addition to the team, and one that we are confident will drive successful marketing and business campaigns.\"     \n\nWhile at Deep Focus, Jamie focused on marketing and business development helping the New York–based agency by launching new offices in Los Angeles and London . Prior to Deep Focus, she served as chief strategy officer at The Intelligence Group (formerly a division of Creative Artists Agency), a consumer–insight and youth-focused strategic consulting firm. During her tenure there she spearheaded the Cassandra Report, a quarterly research and insights study focused on engaging young consumers. Additionally, she built The Intelligence Group's successful consulting practice with clients that included Google, Victoria's Secret, Westfield , Red Bull and 20 th Century Fox. \n\n\"Wunderman is the global leader in data-driven creativity, and I am extremely excited to help expand the breadth and depth of work that they do with clients,\" said Jamie. \"The world-class team at Wunderman and their strong brand purpose offers a tremendous amount of opportunity.\"  \n \nAn active thought leader, Jamie has appeared at Google's Think Shopper, the Bill & Melinda Gates Foundation, the Milken Institute Global Conference, UCLA Anderson School of Management, the CFDA and the ICSC Global Retail Conference. She was named by Elle magazine as \"A Woman to Watch\" in 2014 and participates in the ongoing Elle initiative to support women in business.   \n\nAbout Wunderman \nWunderman is a digital and direct marketing agency that combines creativity and data to drive results for its clients. Wunderman excels in CRM, advertising, loyalty management, content, promotions and social media. Founded by Lester Wunderman in 1958, today we have 7,000 people, comprising 1,300 data scientists, 2,200 creatives and 3,500 business people working in 175 offices in 60 countries. Best Buy, Citibank, Coca-Cola, Ford, Microsoft, Pfizer, Telefonica, Shell and UnitedHealth Group are among our clients. Wunderman is part of WPP (NASDAQ: WPPGY). Find out more at www.wunderman.com and @wunderman. \n  \nCONTACT: \n   \nAndrew Sexton  \n \n  \n212.941.3726 \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/jamie-gutfreund-named-wundermans-global-cmo-300136357.html \n\nSOURCE  Wunderman", "source": "Sys-Con Media"}