{"published": "2015-09-10T21:00:00Z", "media-type": "News", "title": "Enghouse Releases Third Quarter Results", "id": "b38a93f0-1dcc-4e44-b781-fb6af98352b7", "content": "ID: 1384727 \n   \n   \n(businesspress24) - MARKHAM, ONTARIO -- (Marketwired) -- 09/10/15 --   Enghouse Systems Limited (TSX: ESL) today announced its unaudited third quarter financial results for the period ended July 31, 2015. \n\nThird quarter revenue was $71.3 million, an increase of 28.4% over revenue of $55.5 million in the third quarter last year. On a year to date basis, revenue was $203.0 million compared to $157.9 million last year, an increase of 28.5%. Hosted and maintenance services revenue was $33.8 million in the quarter, an increase of 14.7% over the same period last year. \n\nAdjusted EBITDA for the quarter was $18.5 million ($0.68 per diluted share) compared to $14.4 million ($0.53 per diluted share) in last year''s third quarter. Adjusted EBITDA for the year to date was $50.9 million ($1.88 per diluted share) compared to $40.4 million ($1.50 per diluted share) last year, an increase of 25.9%. \n\nNet income for the quarter was $8.1 million ($0.30 per diluted share) compared to the prior year''s third quarter net income of $7.2 million ($0.27 per diluted share). Results from operating activities for the quarter were $16.2 million compared to $13.5 million in the prior year''s third quarter, an increase of 20.4% over the prior year and include special charges related to acquisitions of $1.6 million. \n\nOperating expenses before special charges related to restructuring of acquired operations were $29.8 million compared to $25.6 million in the prior year''s third quarter and primarily includes incremental operating costs related to acquisitions. Non-cash amortization charges in the quarter were $5.7 million compared to $4.3 million in the prior year''s third quarter and include amortization charges for acquired software and customer relationships from acquired operations. \n\nEnghouse generated cash flows from operations of $9.3 million in the quarter after payment of $11.8 million to settle litigation matters during the quarter. Excluding litigation payments, cash flow from operations would have been $21.1 million and $50.4 million in the quarter and year to date respectively. Enghouse closed the quarter with $91.3 million in cash, cash equivalents and short-term investments, compared to $84.9 million at October 31, 2014. The cash balance was achieved after payments of $27.3 million for acquisitions (net of cash acquired) and dividends of $8.4 million year to date. The Company continues to have no long-term debt. \n   \nThe Board of Directors has approved an eligible quarterly dividend of $0.12 per common share, payable on November 30, 2015 to shareholders of record at the close of business on November 16, 2015. \n\nOn June 19, 2015 Enghouse was added to the S&P/TSX Composite Index and Composite Dividend Index which should increase the Company''s profile on the TSX and generate awareness of Enghouse to a broader range of investors. \n\nSubsequent to quarter end, Enghouse completed the acquisition of Aktavara AB (\"Aktavara\") on September 9, 2015. Headquartered in Stockholm, Sweden, Aktavara provides innovative software solutions for telecommunications service providers. Enghouse remains committed to diversifying its revenue stream and continues to seek accretive acquisitions to grow its market share. \n\nA conference call to discuss the results will be held on Friday September 11, 2015 at 8:45 a.m. EST. To participate, please call 416-640-5946 or North American Toll-Free 1-866-233-4585. No PIN required. \n\nAbout Enghouse \n\nEnghouse Systems Limited is a leading global provider of enterprise software solutions serving a variety of distinct vertical markets. Its strategy is to build a larger, profitable and more diverse software company through strategic acquisitions targeting the Contact Center, Networks (OSS/BSS) and Transportation/Public Safety sectors. Enghouse shares are listed on the Toronto Stock Exchange under the symbol \"ESL\". Further information about Enghouse may be obtained from the Company''s website at . \n\nNon-GAAP Measures \n\nThe Company uses non-GAAP measures to assess its operating performance. Securities regulations require that companies caution readers that earnings and other measures adjusted to a basis other than GAAP do not have standardized meanings and are unlikely to be comparable to similar measures used by other companies. Accordingly, they should not be considered in isolation. The Company uses Adjusted EBITDA as a measure of operating performance. Therefore, Adjusted EBITDA may not be comparable to similar measures presented by other issuers. Adjusted EBITDA is calculated as results from operating activities adjusted for depreciation of property, plant and equipment, and special charges for acquisition related restructuring costs. Management uses Adjusted EBITDA to evaluate operating performance as it excludes amortization of software and intangibles (which is an accounting allocation of the cost of software and intangible assets arising on acquisition), any impact of finance and tax related activities, asset depreciation, other income and restructuring costs primarily related to acquisitions. \n\nAdjusted EBITDA: \n\nThe table below reconciles Adjusted EBITDA to the most directly comparable IFRS measure, Results from operating activities: \n\nContacts: \nEnghouse Systems Limited \nSam Anidjar \nVice President, Corporate Development \n(905) 946-3200 \n\nKeywords (optional): \n\n\nUnternehmensinformation / Kurzprofil: \n\nLeseranfragen: \nPresseKontakt / Agentur: \n\nbereitgestellt von: Marketwired \n \nDatum: 10.09.2015 - 21:00 \nSprache: Deutsch \nNews-ID 1384727 \nAnzahl Zeichen:  \ncontact information: \nCompany: Enghouse Systems Limited \nContact person:  \nTown: MARKHAM, ONTARIO \nPhone: \n\nAnmerkungen: \n\nDiese Pressemitteilung wurde bisher 2 mal aufgerufen. \n\n \nVerlinkung-Tipps: \n\nDirekter Link zu dieser Pressemeldung: \n\n\nÜber einen Link auf Ihrer News-, Presse- oder Partner-Seite würden wir uns sehr freuen.", "source": "BusinessPress24"}