{"published": "2015-09-09T01:50:00Z", "media-type": "News", "title": "Alexandria Council votes to prohibit flying of Confederate flags by city", "id": "50d8bafb-cc12-4c5d-b725-3172f62a425e", "content": "By , \r  \nThe Alexandria City Council voted unanimously Tuesday to ban the city from flying Confederate flags, and will form a citizens’ committee to study whether to change the names of streets named for Southern  military leaders. \n \nThe action will not prevent parades or spectators from waving Rebel flags, council members said. And it will allow ethnic groups such as those who celebrate Irish or Scottish history from waving their flags. But the era of city staff raising a Confederate flag on Robert E. Lee’s birthday and Confederate Memorial Day is over. \n\nThe symbols of the Confederacy in Alexandria extend far beyond the memorial statue to the Southern war dead that greets northbound travelers on Washington Street in Old Town. \n\nStill unsettled is the name of U.S. 1, otherwise known as Jefferson Davis Highway. More than 33 streets and a public elementary school are named after Confederate military leaders. A plaque at a prominent Old Town corner presents a skewed version of a shooting at the start of the Civil War. In the council chambers itself, a portrait of Confederate Gen. Robert E. Lee silently watches the civic discourse, across the room from a portrait of George Washington. \n\nPrompted by the shooting of nine worshippers in an African American church in Charleston, S.C., and that state’s subsequent decision to remove the Confederate flag from capitol grounds, Alexandria’s elected leaders agreed that now is the time to reconsider its celebration of its history, which includes lynchings and hosting slave trades, as well as tourist-friendly taverns from the Revolutionary War. \n\n“While we’re a Southern town, this is a part of our history that should not be celebrated all these many years later,” Mayor William D. Euille (D) said in July. Euille is the first African American mayor in the city’s 266-year history. The other six members of the council agreed it is time to stop raising a rebel flag on public property.  \n\nBut that leaves the matter of the other memorials and symbols. \n\nIn a memo to the council last month, City Manager Mark Jinks said the city has full authority over the flag raising and the chamber’s Lee portrait. But limiting flags to the U.S., Virginia and city ones means that Alexandria couldn’t fly the Irish and Red Cross flags, which it does for celebrations each March, he said. \n\nThe city’s Appomattox statue of the sad Confederate soldier cannot be removed without the authorization of the General Assembly, Jinks said. \n\nWhile the General Assembly named Jefferson Davis Highway in 1922, the stretch of the road in Alexandria was called River Road until the council changed it in 1952. The city attorney believes the council has the power under its charter to change the highway’s name again, but neighboring Arlington County does not have charter authority, so it would have to get approval from the legislature. \n\n“It would be logical to jointly decide on the same new name for that stretch of Jefferson Davis Highway,” Jinks wrote. \n\nThe 1953 City Council renamed and renumbered many streets west of Old Town when it annexed what is now known as the West End. At the time, it established the protocol of naming north-south streets after Confederate military leaders, such as Gen. G.T. Beauregard, spy Frank Hume, Maj. Eli Hamilton Janney, Gen. Jubal Early and many more. In addition to the 33 streets known to be named after Southern military men, another 30 streets may have Confederate-related names, but historical documentation is lacking. \n\nThe name of Maury Elementary School, honoring Matthew Fontaine Maury, who was responsible for Southern seacoast defenses, resides with the city’s school board. \n\nThe Lee Center, which houses the city’s fire training center and a number of administrative offices, is on the site of the former Robert E. Lee Elementary School, which closed in 1978. But it is connected to the Nannie J. Lee Recreation Center, which is named for a notable African American teacher and the city staff can’t determine which Lee was being honored by the center’s name. \n\nFinally, the plaque attached to what is now Hotel Monaco, on the corner of King and Pitt streets, commemorates the 1861 fatal shooting of a Union officer by the owner of the then-Marshall House hotel. The Union officer, part of a vanguard that established Union control over Alexandria, had just removed a giant Confederate flag that flew from the roof. \n\nThe plaque is owned by the Sons and Daughters of Confederate Veterans and is on private property, Jinks said, so the council has no control over it. The city previously announced plans to erect a more complete historical report of the incident in the next six months, part of a broader effort to create a series of “mini-kiosks” of history along King Street.", "source": "Washington Post"}