{"published": "2015-09-11T10:29:50Z", "media-type": "Blog", "title": "Pumpkin Spice Granola.", "id": "63b58ef7-2bfd-446d-9feb-db5c624f2e37", "content": "Oh boy, do I have a granola recipe for you today! \n \n\n \nPumpkin spice granola. Why haven’t I made this before? It’s so good, and so easy, and is the perfect fall breakfast. I have been eating this with coconut milk in the morning, and Baby Bee is eating this by the handful, so between the two of us, this granola is disappearing very quickly. \n \n\n \nThis is very easy to make, and your house will smell amazing while you’re baking it! It’s a variation on my favorite granola recipe – and the three main ingredients are the same: oats, maple syrup, and vegan buttery spread. \n \n\n \nI just added some pumpkin puree, pumpkin pie spices, and pumpkin seeds, and boom! This granola is ready for fall. \n \nMake sure you get the pure pumpkin puree, and not the pie filling. We don’t want the added sugar and other ingredients. You can use coconut oil or regular butter in place of the vegan buttery spread if you prefer. If you can eat nuts, go ahead and add some! I love the pumpkin seeds in this granola, but nuts would also be good. \n \n\n   Pumpkin Spice Granola.       Print      Prep time   5 mins     Cook time   55 mins     Total time   1 hour        Simple and tasty pumpkin spice granola is just perfect for autumn!   Author: The Pretty Bee  Recipe type: Breakfast  Cuisine: Gluten Free, Vegan  Serves: 8    Ingredients   6 Tablespoons vegan buttery spread, melted  4 Tablespoons pure pumpkin puree  ½ cup maple syrup  2 teaspoons cinnamon  1 teaspoon ginger  ¼ teaspoon nutmeg  pinch of ground cloves  pinch of salt  4 cups gluten free old-fashioned oats  1 cup pepitas      Method   Preheat the oven to 275 degrees. Line two baking sheets with parchment paper.  In a large bowl, mix together the melted vegan butter spread, pumpkin puree, maple syrup, salt, and spices, Stir well.  Add the old-fashioned oats and stir well, making sure the oats are evenly coated.  Divide the mixture among the two baking sheets. Bake at 275 degrees for 45-55 minutes, stirring often.  Sprinkle the pumpkin seeds on the granola for the last 10 minutes of baking.  Let cool completely before storing in an airtight container.     3.3.3077  \n \n \nHave you gone into full pumpkin spice mode yet? \n \nP.S. Have you checked out the ultimate healthy living bundle yet? This is my favorite bundle, and one of the reasons is because the bonus offers are so great this time! Take a minute to read about all the fun stuff that’s included! :) \n \n\n \nLinking up to  Allergy Free Wednesdays  and some of these  parties . \n \nFollow along: \n subscribe  //  my ebook s //  pinterest  //   facebook  //  twitter  //  shop  \n\n\nThe post Pumpkin Spice Granola. appeared first on The Pretty Bee .", "source": "The Pretty Bee"}