{"published": "2015-09-04T22:01:28Z", "media-type": "News", "title": "Looking Ahead - September 4, 2015", "id": "ee788679-d92c-4966-bea9-5ca163c00a6c", "content": "Friday, September 04, 2015 3:00 PM \r\n        \r \n      \n\r\n\t\t\t\t\t\t\t\t\r\n            \r Looking Ahead items must be in writing and hand-carried, mailed, faxed or e-mailed to The Madison Courier at least two weeks before the date of the activity, meeting or event. The Madison Courier is at 310 West St., Madison, IN 47250. Office hours are 8 a.m. to 5 p.m. Monday through Friday. The fax number is (812) 273-6903 or e-mail us at zelda@madisoncourier.com. \r\n        \r \n    Special Events \n\nChelsea Jubilee: Will be held Sept. 4-5 at Chelsea Park. Friday’s schedule will include gospel music from 4 to 6 p.m., an opening ceremony at 6:30 p.m. and music by James White & Deer Creek from 7 to 11 p.m. Saturday will feature a Saluda School student reunion from 11:30 a.m. to 1 p.m., a tractor parade at 12:30 p.m., and a cornhole tournament, kids games, pedal pull, hay bale toss, water balloons, a bubble gum contest and more at 1 p.m. The No Name Band will perform from 7 to 11 p.m. Admission and parking are free. \n\nA.D.E.P.T. Level I: Will meet from 5:30 to 8:30 p.m. Sept. 11 and from 8:30 a.m. to 4 p.m. Sept. 12 at the Salvation Army, 331 E. Main St. For more information about the alcohol/drug education/prevention/pretreatment program call (812) 498-6880 or (812) 265-9059. \n\nA.D.E.P.T. Level II: Will meet from 5:30 to 8:30 p.m. Sept. 7-11 and Sept. 12 from 8:30 a.m. to 1 p.m. at the Salvation Army, 331 E. Main St. For more information about the alcohol/drug education/prevention/pretreatment program call (812) 498-6880 or (812) 265-9059. \n\nYard Sale Fundraiser: Life Choices Clinic will host a yard sale fundraiser from 9 a.m. to 5 p.m. Sept. 11-12 at the National Guard Armory. There will be a pre-sale from 4 to 8 p.m. Sept. 9. A ticket, available for $5, is required for the pre-sale. For more information, or to purchase a ticket, call (812) 493-9264. \n\nCanaan Fall Festival: The 51st annual event will be held Sept. 11-12 with a flea market, live music, food, vendors, a pie banking contest, cornhole tournament, games for kids and the 49th annual running of the U.S. Pony Express Mail Run. A parade of through town begins at 10:30 a.m. Saturday. \n\nO Madison, Where Art Thou?: The local take on the soundtrack of the film “O Brother, Where Art Thou?” will be presented at 7 p.m. Sept. 11-12 at Red Bicycle Hall. Tickets are $18 in advance or $20 at the door. Tickets can be purchased online at redbike.tixato.com or in person at Village Lights Bookstore. \n\nRural Heritage Tour: Visit three historic sites in Switzerland County and learn about hearth cooking, heirloom gardens, period music and early trades from 10 a.m. to 5 p.m. Sept. 12 and from noon to 5 p.m. Sept. 13. Admission is free, but donations are welcome. For more information, visit www.venoge.org or www.switzcomuseums.org. \n\n25th Annual Trimble County Apple Festival: Will be held Sept. 12-13 around the Trimble County Courthouse in Bedford, Ky. Event hours are 10 a.m. to 6 p.m. Saturday and noon to 5 p.m. Sunday. There will be a non-denominational outside worship service at 11 a.m. Sunday. The weekend includes apple pie judging and action, arts and crafts, live music, food, a storyteller, face painting, antiques, collectibles, a quilt exhibit and raffle, a magician and children’s activities. Admission is free. For more information, call (502) 552-4362 or (502) 255-9904, or visit www.trimbleapplefest.org. \n\nSeptember 4 \n\nRed Hatters: Will meet for lunch at 11:30 a.m. at Ponderosa Steakhouse, 327 Clifty Drive. All Red Hatters and guests are welcome. For more information, call (812) 265-4433. \n\nFirst Friday - Carrollton: Carrollton will host its final First Friday event of the year Sept. 4 on the courthouse lawn. The event begins at 4 p.m. with the River View Farmers Market, food from Relevant Church, inflatables for kids and prize drawings from the Cash Cube. There will be live music from Mark Louden from 6 to 8 p.m. and a potato head contest will be held in three categories: celebrity look-a-like, mini me and most creative. Contestants should turn in their potato entries by 6 p.m. \n\nFirst Friday - Vevay: Switzerland County Tourism will host a “Fall for Me” selfie contest scavenger hunt Sept. 4. Open to youths and adults, contestants can stop at the Visitors Center, 128 W. Main St. in Vevay, at 6 p.m. on Friday for a list of items located around Vevay. The Visitors Center will also host the opening of the Fall Adult Coloring Contest. The event features late night shopping, dining, art openings, store specials, live entertainment and free carriage rides - weather permitting. \n\nSenior Dance: Will be held by the Madison Parks Department at the Brown Gym featuring the music of Charlie Humphrey. The doors open at 5 p.m. Music begins at 6 p.m. Admission is $4 per person. \n\nMayor’s Movie Night: The City of Madison will host a free screening of the 2009 film “Sherlock Holmes” at dusk on the Lanier Mansion lawn. Prior to the movie there will be a behind-the-scenes tour of the Lanier Mansion for visitors to see areas of the mansion not usually on display. The number of guests for the tour will be limited to 25 so reservations are recommended. Admission to the tour is $10 for adults, $8 for seniors 60 and over, and $5 for children. To make reservations or for more information about the tour, call (812) 273-0556. \n\nSeptember 5 \n\nGoldenrod Gala: Will be held from 10 a.m. to 5 p.m. at General Butler State Resort Park in Carrollton, Ky. The one-day arts festival will feature handcrafted items, local merchants and a variety of demonstrations, along with entertainment, food concessions and a farmer’s market. There is no admission to the festival grounds and parking is free. \n\nRockin’ on the River: Will be held at Bicentennial Park with the River Run XIX Car Show at 10 a.m., car show awards at 4 p.m. There will be live music from The Doctors Band at 6 p.m. followed by The Monarchs at 8 p.m. Admission is free, but the event is a fundraiser for the Salvation Army, and donations will be accepted. The event also includes concessions, a kid’s bouncy house and vendor booths, along with a spider raffle to benefit Big Brothers/Big Sisters of Jefferson County. \n\nMagic Tournament: Will be held from 1 to 4 p.m. at the Carroll County Public Library. \n\n17th Annual Regional Fall Art Show Artist Reception: The Madison Art Club’s 17th Annual Regional Fall Art Show awards ceremony and artist reception will be held from 7 to 9 p.m. at Art on Main, 309 W. Main St. with the awards presentation at 8 p.m. Light refreshments will be served. The show, which runs through Sept. 16, is the largest exhibit of regional artwork in the Madison area, with more than 160 entries eligible for awards. Gallery hours are from 11 a.m. to 5 p.m. Monday through Saturday and Sunday from noon to 4 p.m. The gallery is closed Tuesdays and Wednesdays. \n\nSeptember 6 \n\nAlcoholics Anonymous - Under the Hill: Will meet from 11 a.m. to noon Sundays at St. Michael the Archangel, 599 E. Third St. Breakfast is served on every third Sunday. For more information, call (812) 577-5031. \n\nSeptember 8 \n\nJefferson County Clearinghouse: Will meet at 8 a.m. on the second Tuesday of the month at 100 E. Second St. For more information cal (812) 599-1996 or email molly@rivervalleyresources.com. \n\nCardio-Vascular Van: The St. Elizabeth Cardio-Vascular Van will be at the Carroll County Public Library from 10 a.m. to 2 p.m. \n\nNARFE: The Jeffersonville Chapter of the National Active and Retired Federal Employees will meet at 1 p.m. at the Red Cross Building, 1805 E. 8th St., Jeffersonville. There will not be a guest speaker, to allow the board to update the membership on local, regional and national news for NARFE.. For more information, call (812) 748-9747 or email joh817@att.net. \n\nKYNECT: Get assistance with Kentucky health care sign-up from 2 to 7 p.m. at the Carroll County Public Library. No appointment necessary. \n\nTIF Board: The Redevelopment Commission/TIF Board will meet at 3 p.m. on the first Tuesday of the month at Madison City Hall. For more information, call (812) 265-8300. \n\nGED Help: The Carroll County Public Library will offer GED assistance at 4 p.m. on Tuesdays and Thursdays. \n\nHouse of Health - HIV: The Jefferson County Health Department will present, “HIV, What you need to know,” from 4:30 to 6:30 p.m. at the Jefferson County Clearinghouse. Staff will be available to answer private questions about HIV. Free testing options and safe needle disposal information will be available. \n\nHomework Help: The Carroll County Public Library will offer homework help at 5 p.m. on Tuesdays and Thursdays. \n\nJefferson County Council: Will meet at 5 p.m. in the Commissioner’s Office at the Jefferson County Courthouse. \n\nEmotional Support Group: Will meet every Tuesday at Resurrection Lutheran Church, 1429 Clifty Drive, from 6 to 7:30 p.m. The free spiritually-based group supports those struggling with depression, fear, anxiety, suicidal thoughts and grief. For more information call (502) 468-6316. \n\nESL Class: The Carroll County Public Library will offer an ESL class at 6 p.m. on Tuesdays and Thursdays. \n\nCivil War Roundtable: Will host Greg Biggs at 7 p.m. at the Jefferson County Historical Society, 615 W. First St. Biggs will present, “From Secession to War — the Confederate Flags of 1861,” the story of the numerous political and battle flags of the Confederacy in its first year. All are welcome. \n\nSeptember 9 \n\nBreakfast Networking: Madison Area Chamber of Commerce, 301 E. Main St., will host breakfast networking at 8 a.m. Registration is encouraged, but not required. \n\nLego Mania: Enjoy after-school Lego fun at 3:30 p.m. at the Carroll County Public Library. \n\nZumba: Will meet at 5:15 p.m. Mondays and Wednesdays at the Carroll County Public Library. \n\nArt Journaling Group: Will gather at 6 p.m. at the Carroll County Public Library. \n\nMadison Al-Anon Family Group: Meets on Wednesdays at 6 p.m. at the Jefferson County Clearinghouse. For more information, call (812) 493-3848. \n\nCanaan Community Academy Board of Directors: Will meet at 6:30 p.m. on the second Wednesday of the month in the school cafeteria. \n\nMadison Consolidated School Board: Will meet at 6:30 p.m. in the school administration building, 2421 Wilson Ave. A project hearing will precede the meeting at 6 p.m.", "source": "Madison Courier"}