{"published": "2015-09-18T14:20:12Z", "media-type": "News", "title": "Wei-Li Crane Ship Departs Damen Shiprepair", "id": "74484aa5-8c91-4f36-aa35-70058ac5dca4", "content": "The Wei-Li crane ship slipped her lines at Damen Shiprepair Dunkerque on Friday, September 11, to make the short trip up to Rotterdam after 10 days of maintenance and repairs. \n \nThe 141-meter, 18,330 DWT crane ship required special dock bed arrangements, not least because of the 3,000-metric-ton crane mounted on her stern and her unconventional hull form.  \n \nA total of 225 blocks were required, along with an additional 56 steel pillars of up to 7 meters in length to support the stern. Wooden wedges also had to be added to the lateral blocks to take account of the unusual hull shape and to ensure complete stability in the drydock. \n \nThe scope of work over the 10-day period included, along with the standard work for class survey, blasting and painting the hull and the overhauling of the internal and overboard valves. The scope of the electrical works was extensive given the tight time frame, with a large number of motors removed and transported back to workshop for overhaul before being returned and refitted, Damen said. The last ones were fitted and tested on the same day of the vessel’s departure.  \n \nThe starboard propeller blades were also rebuilt. This required re-welding tips onto each of the blades followed by a full polish for both propellers. Six generator coolers were also removed for overhauling, as were their bearings, and some major repairs were made to the accommodation. \n \nAccording to Damen, cooperation with the project team from owner Shanghai Salvage was improved thanks in part to the assistance of a local Chinese national attending a nearby university who helped smooth the language differences. \n \n“Ensuring that the Wei-Li was properly supported in the drydock was a complex project in itself,” commented Khalil Benjelloul, head of marketing and sales at Damen Shiprepair Dunkerque. “With all the blocks and pillars, plus the positions of the vessel’s thrusters, it was not easy to position her in the centre line of the dock. Once accomplished, however, the work proceeded smoothly and after 10 days of hard work around the clock she was on her way again. It was a pleasure to work with Shanghai Salvage and its representatives.” \n \nThe Wei-Li was built by Zhenhua Heavy Industries in 2010 and this summer was involved in the installation of the 11,000-metric-ton jacket for the Ivar Aasen project in the Norwegian sector of the North Sea.", "source": "Marine Link"}