{"published": "2015-09-26T18:43:03Z", "media-type": "News", "title": "Rev. Mowery honored for fostering employment", "id": "ca7bc7ad-bff8-4e4c-9717-53929c2af78a", "content": "HONESDALE- The Wayne County Employment Coalition (WCEC) recently held a luncheon meeting at the Park Street Complex where Wayne County was honored for their support in “fostering the employment” of those with disabilities. The WCEC is a community coalition comprised of educators, employment support provider agencies, the Office of Vocational Rehabilitation, the Office of Developmental Programs, community businesses, Wayne County Office of BDP/EI staff, families and people with disabilities. WCEC members work together to “promote successful employment, choice of employment opportunities and supports needs of individuals with disabilities in pursuit of an every day life.” This recipient was Reverend Richard Mowery from St. John's Lutheran Church. Charlie Lagarenne, who is employed by the church, presented him with the award. He started working at the church through Community Vocational Services, Inc. (CVS). “ Reverend Mowery has employed Charlie at the church to help clean up and do various things around the church,” said Peggy Wilson, ID Program Specialist, Wayne County AE and the Wayne County Office of Behavioral and Developmental Programs and Early Intervention (BDP/EI). Kim Emmett, director of Community Vocational Services, said a few words about Charlie and his progress. “ It's a privilege and a gift to raise a child with their own unique set of abilities. My family's gift arrived on June 15, 2013,” she said. “In September of 2013 he was enrolled in his last year of school at Honesdale High and attended HRC twice a week. “ The Wayne Highlands School District and OVR [Office of Vocational Rehabilitation] supported Charlie's transition from high school into the community by giving him opportunities for assessments that were completed at Walmart in the electronics department, Charcoal Chucks doing food prep, IGA for stocking and St. John's.” Emmett added the assessments were completed through CVS as well as the coaching he needed to explore employment opportunities. He was able to do this for almost six months. “ Sunshine Falcone has spent time as his job coach and taught him all of the skills needed to be successful in the workplace,” Emmett stated. “She's amazing and Charlie has never missed a day of work. “ During this time Charlie was also learning to transfer the new skills he acquired at the HRC Vocational [and Community] Options Program and at home into employment skills.” She added in March of 2014, St. John's Lutheran Church was looking for a custodian. Page 2 of 3 - Emmett asked Pastor Ken Buckwalter if he would allow Charlie to volunteer and develop necessary skills for the job. She also asked if Charlie's performance was satisfactory that he could be considered for an interview for the position. “ Needless to say he [Buckwalter] gave us his blessing and Charlie, with Susnhine's guidance, learned all of the tasks of keeping a church clean and ready for services,” Emmett said. “After a few weeks, three candidates were presented to the church council for potential hire and Charlie had his first interview. “ He was hired in June of 2014 and has been there ever since.” Emmett stated Pastor Buckwalter left the church in January of this year. She said he praised Charlie's accomplishments. “ Pastor Mowery is just as encouraging and appreciative of Charlie's work,” she said. Charlie is also a member of Area P Special Olympics and has taken part in multiple sports with the organization. He was part of the group that approached the Wayne County Commissioners about installing bocce courts at the Park Street Complex. He also helped build them. “ Charlie has a goal of becoming a business owner one day and that is next on his agenda of things he will accomplish very soon,” Emmett stated. “All of this has been made possible through the Office of Developmental Programs and the Wayne County office of Behavioral and Developmental Program/Early Intervention [BDP/EI].” Lagarenne then spoke about his experience before recognizing Reverend Mowery. “ I've worked at St. John's Lutheran Church for a year and a half,” he said. “I have learned how to use time wisely, not to rush and do my job the best I can. “ I really appreciate all the people who have worked so hard to help me find and keep my job. When I first came to Honesdale I did not have the skills to find and keep a job. “ I work very hard and I participate in sports as well to stay strong and healthy.” Lagarenne also gave some advice to the public. “ I would like to send this message to everyone,” he stated. “Do your job like you mean it. When someone looks into your eye [they'll] see how much your job means to you.” Page 3 of 3 - Lagarenne added it was a “great honor” to present the WCEC award to Reverend Mowery. “ The church and church family has become a second home to me,” he stated. “I want to thank Pastor Mowery, Louise and the congregation for all that you do to support me.”", "source": "Wayne Independent"}