{"published": "2015-09-30T00:39:39Z", "media-type": "Blog", "title": "Boeing’s Strategic Carbon Fiber Supplier Hints of Global Supply Diversification Strategy", "id": "7d468d7f-243f-4749-a9e8-949584b187da", "content": "In the backdrop our previous Supply Chain Matters commentary related to Boeing and its decision to shortly assemble new 737 commercial jets in China, we provide another related development. In November of 2014, we called initial attention to the announcement that Boeing had initiated a multi-billion long-term supply agreement with Japan based Toray Industries for the supply of carbon fiber composite material. This ten year strategic supply agreement was initiated to provide continuity of supply of carbon fiber material needed for the production of Boeing’s 787 Dreamliner and new 777X aircraft. Apparently Boeing is now considering a supply risk strategy regarding this strategic material. Last week, The Seattle Times reported that Toray Composites America (TCA) celebrated the completion of a fifth production line at its plant near Tacoma Washington, but further warned that additional expansion will center on other U.S. east coast and overseas investments. Noted in this Seattle Times report is that each pre-preg carbon fiber assembly line requires a $100 million investment and 14 months of rigorous testing before such line is qualified to produce high specification material.  With the addition of this fifth assembly line, executives at parent Toray in Japan now indicate that any further investments will be directed at the existing TCA facility located in Spartanburg South Carolina. Toray has purchased an additional 400 acres of land with plans to build a $1 billion fully integrated composites production facility that will span precursor chemical to finished carbon fiber tape. According to the article, Toray has signed additional supply contracts with Bell Helicopters and Brazilian jet producer Embraer. A Toray executive is reported as indicating that diversifying supply in South Carolina is a desire by both Toray and Boeing to insure supply continuity, in the event of a shutdown at the Tacoma based facility. More revealing are statements by this same executive indicating that Boeing’s longer-term thinking centers on the labor cost intensity associated with manufacturing this material in the U.S. , with an eagerness to transfer some composite supply sourcing to perhaps India, which has a growing demand for new commercial aircraft, and could provide more attractive labor costs. In the lens of Supply Chain Matters, this may be an additional indication that growing demand for new commercial aircraft within specific Asian countries may include additional provisions for more supply chain presence and value-add activity.", "source": "Supply Chain Matters"}