{"published": "2015-09-22T07:46:06Z", "media-type": "News", "title": "Purdue Pharma L.P. and AnaBios Corporation Initiate Program to Accelerate Development of Chronic Pain Treatment", "id": "bff52b99-abd7-4d41-8322-c584c7701d02", "content": "STAMFORD, Conn. and SAN DIEGO , Sept. 22, 2015 /PRNewswire/ -- Purdue Pharma L.P. and AnaBios Corporation announced today the intent to form a joint venture aimed at accelerating the development of Purdue Pharma's Nav1.7 sodium ion channel compounds for the treatment of chronic pain . The joint research and development effort would leverage Purdue Pharma's intellectual property and lead compounds, combined with AnaBios' Phase-X ® technology. \n Related Biotechnology, Pharmaceutical and Healthcare News   \nPurdue Pharma has more than 10 years of research history in the sodium channel field that led to multiple patent applications and numerous lead compounds targeting Nav1.7 as well as other sodium channel isoforms that are potentially useful for the treatment of chronic pain. Purdue Pharma also has extensive clinical development experience in advancing new drugs for treating pain. \n \nAnaBios is an innovative drug discovery company employing its proprietary Phase-X ® technology to enable the discovery of novel drugs directly in human tissues, bypassing animal experimentation. AnaBios generates highly valuable and predictive human data that ensure the selection of the most effective and safest drugs before investing in expensive and time consuming clinical trials. AnaBios has established a unique and unprecedented capability for studying the human peripheral pain pathway in the laboratory, therefore enabling the identification of novel analgesic drugs with potential efficacy in humans. \n \n\"The prospect of combining AnaBios' unique platform and Purdue Pharma's top quality chemistry exemplifies the powerful nexus of technology-based discovery and industry collaboration,\" said Mark Timney , President and Chief Executive Officer, Purdue Pharma L.P. \"This creative partnership fits in well with our strategic plan to continue development of our existing therapeutic programs and ultimately bring value to patients suffering from pain and to healthcare providers.\" \n \n\"We are very excited to have the opportunity to employ AnaBios' Phase-X ® technology to optimize the selection of clinical candidates from the advanced leads that Purdue Pharma has generated,\" said Andre Ghetti , Ph.D, Chief Executive Officer, AnaBios Corporation. \"Employing human sensory neurons to match the selectivity and properties of sodium channel blockers with specific pain indications, we will maximize the potential success of clinical development of much needed new pain therapeutics.\" \n \nAbout Purdue Pharma L.P. \n \nPurdue Pharma L.P. and associated U.S. companies are privately-held pharmaceutical companies known for pioneering research in chronic pain. Purdue Pharma is engaged in the research, development, production, and distribution of prescription and over-the-counter medicines, as well as hospital products. Purdue Pharma is committed to advancing the care of patients with quality products that make a positive impact on healthcare — and on lives.  Purdue Pharma's headquarters are located in Stamford, Conn. For more information about Purdue Pharma, please visit www.purduepharma.com . \n \nAbout AnaBios Corporation \n \nAnaBios Corporation has developed an extensive battery of assays and technologies, Phase-X ® , that enable the study of ex-vivo human responses to drugs and the investigation of the molecular and functional basis of human physiology. AnaBios focuses primarily on ex-vivo human tissue and cell-based studies for safety, pain and neurodegeneration. AnaBios has a successful track record in employing its Phase-X ® platform to support target selection and validation, lead optimization, clinical candidate selection and clinical program de-risking for pharmaceutical drug development programs. AnaBios utilizes Phase-X ® for supporting drug discovery programs of partnering pharmaceutical companies and is also conducting internal preclinical drug discovery programs on proprietary chemical entities. \n \nLogo - http://photos.prnewswire.com/prnh/20100921/NY67262  \n \nLogo - http://photos.prnewswire.com/prnh/20150921/269096LOGO  \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/purdue-pharma-lp-and-anabios-corporation-initiate-program-to-accelerate-development-of-chronic-pain-treatment-300146930.html \n \nSOURCE  Purdue Pharma L.P. \n NEXT ARTICLE  More From BioPortfolio on \" \"", "source": "BioPortfolio"}