{"published": "2015-09-15T13:44:00Z", "media-type": "News", "title": "Residence Inn Tallahassee Universities at the Capitol Unveils Striking Hotel Renovations With $1.5 Million Price Tag", "id": "25605693-3a81-44e2-828d-038350734710", "content": "Hotel near FSU to host grand reopening party to debut reimagined public spaces, refreshed guest rooms \n  \nTALLAHASSEE, Fla. , Sept. 15, 2015 /PRNewswire/ -- Re-establishing itself as one of the premiere hotels in Tallahassee , Residence Inn Tallahassee Universities at the Capitol is hosting a grand reopening celebration on Sept. 30, 2015 to shine a light on its new, contemporary accommodations in the heart of the Sunshine State. \n\nAfter completing the renovation of its guest suites in the summer of 2014, the hotel next updated its lobby, public spaces, and conference center, which was finished in August of this year. The $1.5 million project was achieved with the help of Jacki Arena Interiors and Collective Construction & Design, both Florida leaders of superior renovation and design projects in the country's hospitality industry. \n   \nBoasting 135 updated suites , the hotel offers thoughtful amenities that cater to modern business and leisure travelers. Whether staying just a night or looking for extended-stay lodging, guests will discover an ideal home away from home at our hotel near Florida State University . \n\nThat cozy feel comes from rooms featuring separate areas for living, working, dining and sleeping in style. Visitors can prepare a meal in fully equipped kitchens with refrigerators, microwaves and dishwashers, or get down to work at large desks with ergonomic chairs and complimentary wireless Internet access. After a rewarding day of work meetings or family fun, guests will enjoy sinking into luxurious Marriott bedding while watching their favorite show on flat-panel TVs with premium cable and movie channels.  \n\nAfter a restful night, the hotel invites guests to dine at its complimentary, hot breakfast buffet in the updated lobby and return to the sophisticated space on select nights for The Residence Inn Mix, a signature, on-site social gathering with an opportunity to connect with other travelers while enjoying a selection of local foods and beverages. Before heading up to the cozy comfort of their rooms, guests can maintain their workout routine in the hotel's state-of-the-art fitness center or make a splash at the refreshing outdoor pool and whirlpool. \n\nWith 4,200 square feet of meeting and event space , the hotel can also accommodate up to 250 guests for a well-executed business meeting or social celebration. Experienced planning staff members are always on deck to make sure events are seamless from beginning to end. Whatever brings guests to town, new and improved accommodations at the Tallahassee hotel offer a fresh travel experience. \n\nAbout Residence Inn Tallahassee Universities at the Capitol  \nResidence Inn Tallahassee Universities at the Capitol at 600 W. Gaines St. in Tallahassee, FL is just minutes from Florida State University , the Florida Capitol, Wakulla Springs and other popular attractions. The hotel features 5 floors, 135 suites, 4 meeting rooms with 4,200 square feet of space, an outdoor pool and fitness center. For information, call 1-850-329-9080 or visit www.marriott.com/TLHDT . \n\nJoin Marriott Rewards now and earn points that can be redeemed for free hotel stays and room upgrades at 3,800 hotels in over 70 countries. \n\nLearn more about Residence Inn and Marriott International Inc.  \n\nPRESS CONTACT   \nKeith Hoogerheyde  \n1-850-329-9080  \nkeith.hoogerheyde@marriott.com   \n\nPhoto - http://photos.prnewswire.com/prnh/20150914/266348  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/residence-inn-tallahassee-universities-at-the-capitol-unveils-striking-hotel-renovations-with-15-million-price-tag-300143023.html \n\nSOURCE  Residence Inn Tallahassee Universities at the Capitol", "source": "MoneyShow.com"}