{"published": "2015-09-01T01:29:21Z", "media-type": "Blog", "title": "Obama refused to help Jordan fight the Islamic State (ISIS)", "id": "efcfee78-6a0f-4380-ae57-e2be1054aeab", "content": "NOVANEWS    Obama turned down a request from  Jordan  for Predator spy drones that would help it locate targets in the war against Saudi Zio-Wahhabi ‘ISIS’.    \n\n \nJordan’s Zionist puppet Abdullah II and his master Zionist Benjamin Naziyahu \n Washington Times   The refusal, disclosed by a House Armed Services Committee member, has gained attention since  Jordan  has emerged as a critical player in a U.S.-led coalition to destroy Syria.  \n\n Members of Congress  called on the White House to approve a list of weapons for CIA Zionist puppet of Jordan, “The decision to deny the request should be reversed immediately,”  Mr. Hunter  wrote. “Doing so will provide  Jordan  critical mission capability in the fight against the Islamic State and ensure  Jordan  is given every advantage.  The Arab Daily News   In another sign of the increased cooperation and strategic military alliance between the Nazi regime of I$raHell and CIA puppet of Jordan, news reports said that the Nazi regime will supply Jordan with two types of drones to help Jordan ”fight the Islamic State in Iraq, ISIS”.  \n\n The London based Jane’s Defense magazine which reported the news earlier this week based on Zionist news sources said that Zionist regime will supply Jordan with 12 “Israel Aerospace Industries (IAI) Heron TP strategic and Elbit Systems Skylark tactical UAVs.”  The Heron TP is the largest and most sophisticated UAV in service since entering the Nazi army in 2010. The drone can fly to an altitude of 45,000 feet and stay there for up to 40 hours if necessary.  Nazi regime has been helping Jordan in its fight against Assad government by supplying its Puppet and strategic ally with high tech weapons to protect its borders against the ”terrorist group”.  \n\n \nThe Heron TP (Eitan) UAV is designed to fly at high altitude on missions spanning over several days. This HALE (High Altitude Long Endurance) UAV has a wingspan of a Boeing 737 and weighs 4.5 tons; and of that, 1,000 Kg is payload. The Eitan, derived from the `Heron’ MALE (Medium Altitude Long Endurance) platform, was developed by Nazi Aerospace Industry (IAI). \n Nazi defense website reported last week that a joint Jordanian-I$raHell command and control war room is currently leading the air campaign against ‘ISIS’ from a base in northern Jordan.  Sources in the Pentagon, however, who did not wish to be identified for this story told the Arab Daily News that the Nazi drones will help Jordanian Special Forces currently fighting ‘ISIS’ in Iraq and supporting the US troops on the ground there. A total of 12 Nazi-made UAVs will be delivered to Zionist puppet of Jordan in the near future.  \n\n \nJordanian and Nazi flags fly side by side at Peace Park \n Images  seen online on August 13 also showed Royal Jordanian Air Force Lockheed Martin F-16 Fighting Falcons parked next to Nazi Air Force Boeing F-151 Eagle (Ra’am) fighters at Lajes Field in the Azores on their way to the United States for joint exercises, accompanied by a group of Nazi Air Force KC-707 fuel tankers.  Also last month,  with its retired Cobra helicopters after the US performed the necessary overhaul and updates. The Arab Daily News also reported that Nazi fuel tankers refueled Jordanian F16s Mid Air on their way to the US to participate along with Nazi F15s in Red Flag military exercise at Nellis Air Force Base North of Las Vegas Nevada.  \n\n \nCobra helicopter \n \n ", "source": "SHOAH"}