{"published": "2015-09-01T18:36:40Z", "media-type": "Blog", "title": "Donald Trump Fighting For America’s Middle Class", "id": "010d96d7-823c-4cb2-bace-4b48050eaf02", "content": "Donald Trump Fighting For America’s Middle Class \n \nA new Bloomberg Politics/Des Moines Register Iowa Poll reveals that 65% of Republican front- runner Donald Trump’s supporters say they are  “unsatisfied” or “mad as hell” at Wall Street. \n \nOverall, the poll exposed bi-partisan distane among those planning to attend Iowa’s presidential caucuses in February with those who invest in business or politics: 64% of those planning to attend a Democratic caucus voiced dissatisfaction with Wall Street, but in the stereo-typically more business- friendly Republican party, the figure was an almost equally high 62%. \n \nAmong likely Democratic caucus-goers, 94% rated themselves unsatisfied or “mad as hell” about the amount of money in politics. \n \nFor Republicans, the figure was 91%. \n \nThe Big Q: Why are people upset with a candidate who brags about how rich he is? \n \nThe Big A: Donald Trump’s position of strength with these voters is partly a product of rhetorical attacks on the financial industry. But it is also due to a series of unorthodox policy views that are uniquely tenable for the self-funded candidate who does not relying on wealthy donors to support his campaign. \n \n“Jeb Bush is a puppet to his donors,” Donald Trump told a crowd at the Iowa State Fair mid-August. Mr. Trump has vowed to fund his own campaign, is the only Republican candidate who can afford to alienate the party’s money backers. \n \n  \n \nDonald Trump says he wants to raise taxes on rich people like himself, and he has proposed to end the “carried interest loophole” that grants preferential tax treatment to hedge fund and private equity managers. \n \n“The middle class is getting clobbered in this country,” Mr. Trump said in an interview recently “You know the middle class built this country, not the hedge fund guys, but I know people in hedge funds that pay almost nothing and it’s ridiculous, OK?” \n \nDonald Trump’s posturing is uniquely suited to an election year in which financial elites and their boosters in the political establishment are hated across the ideological spectrum. \n \nA 40 yr trend of stagnating wages, combined with unpopular financial industry bailouts feeds the frustration that’s pushing political outsiders. Not only Mr. Trump but Dr.  Ben Carson, are in favor with Republican and Independent voters, the latest Iowa Poll shows. \n \nTrumpeting for Trump \n \nHeffX-LTN \n \nPaul Ebeling \n \n  \n \n  \n \nThe post Donald Trump Fighting For America’s Middle Class appeared first on Live Trading News .", "source": "Live Trading News"}