{"published": "2015-09-22T07:56:14Z", "media-type": "Blog", "title": "After 60 million years of extreme living, seabirds are crashing", "id": "10f5030e-7a92-4f2c-92ff-ec4af85577bf", "content": "Every day for sixty million years, seabirds have performed mind-boggling acts of derring-do: circumnavigating the globe without rest, diving more than 200 meters in treacherous seas for a bite of lunch, braving the most unpredictable weather on the planet as if it were just another Tuesday and finding their way home in waters with few, if any, landmarks. But now seabirds, like so many other species, may have met their match. Conservationists have long known that many seabird populations are in decline, but a recent paper in PLOS ONE finds the situation worse than anticipated. According to the researchers, seabird abundance has dropped 69.7% in just 60 years – representing the deaths of some 230 million animals. “I was very surprised with the result, it was considerably greater than I’d expected,” said Edd Hammill, co-author of the paper, with Utah State University. “What we should take away from this is that something is serious amiss in the oceans.” Facebook Twitter Pinterest The Brown Booby (Sula leucogaster) is listed as Least Concern and is found throughout the pantropical oceans. However some populations are suspected to be in decline owing to disturbance and unsustainable levels of exploitation. Photograph: Ben Lascelles/Birdlife International Ben Lascelles, a Senior Marine Officer with Birdlife, who was not involved in the study, said he found the research alarming because the decline appeared practically indiscriminate, hitting a “large number of species across a number of families.” Seabirds, which include any bird that depends largely on the marine environment, comprise nearly 350 species worldwide – an astonishing variety of extreme-loving birds. For example, the indefatigable wandering albatross, which sports the largest wingspan on the planet; the child-sized Emperor penguin, the only bird that breeds during the Antarctic winter; and the tiny storm petrel that practically capers on the water as it feeds – they are named for St. Peter after all. But, given that seabirds inhabit both the open ocean and the shoreline, this eclectic mix of birds faces a litany of threats: overfishing, drowning in fishing lines or nets, plastic pollution, invasive species like rats in nesting areas, oil and gas development and toxic pollution moving up the food chain. And as if these weren’t enough, the double-whammy of climate change and ocean acidification threatens to flood nesting sites and disrupt food sources. “Seabirds are particularly good indicators of the health of marine ecosystems,” explained lead author, Michelle Paleczny with the University of British Columbia and the Sea Around Us Project. “When we see this magnitude of seabird decline, we can see there is something wrong with marine ecosystems. It gives us an idea of the overall impact we’re having.” Bu with such a large number of species across such a wide variety of environment one is left asking: how did the scientists count so many birds? Counting Birds First, the team of researchers scoured all the population data on seabirds available. They found demographic data on 3,213 populations. But they couldn’t use all of theses counts, since conservationists had surveyed many of these far-flung populations just once or twice – not enough to show a real trend The team eventually selected 513 populations that had been counted at least five times. In all, these populations represented about 19 percent of the world’s seabirds. Still, Hammil said he believes the team’s findings “are an accurate representation of what is happening worldwide.” He added, “although we did not include every population, all seabird families were included, and we included populations from every major coastline in the world.” Paleczny also said that when the researchers looked at the differences between monitored and unmonitored populations, they saw “no evidence that the monitored populations are declining more.” Facebook Twitter Pinterest The Near Threatened Black-footed Albatross (Phoebastria nigripes) is a species at risk of accidental bycatch in fisheries of the North Pacific. However, simple mitigation measures have proved to be very effective at keeping seabirds off the hooks. Photograph: Ben Lascelles/Birdlife International The findings are also bolstered by past research. In 2012 a paper in Bird Conservation International found that 28 percent of seabird species are threatened with extinction with 47 percent in decline. This meant, in all, seabirds were about twice as likely as land-based birds to be threatened with extinction. “The trends for many seabird species have clearly been downwards for a number of years, and this paper provides further evidence of this,” Lascelles said. Still, Paleczny and Hammil’s research arguably paints an even more alarming picture of the state of the world’s seabirds. For example, according to them, the tern family has fallen by 85%, frigatebirds by 81%, petrels and shearwaters by 79%, and albatrosses by 69%. Such dismal findings point to one of the study’s patterns: open ocean birds – such as albatrosses, frigatebirds, petrels and shearwaters – are generally faring worse than birds that stick near the coasts. “[Open-ocean] seabirds are hit especially hard due to their large geographic ranges. Because these species travel so far, there is a greater chance they will encounter threats,” said Hammill who noted that coastal birds “in some cases” are doing better because of improved management of breeding areas and improved fishing gear. But even when threats were minimised, Lacalles noted that recovery requires diligence and patience. Facebook Twitter Pinterest A gannet grabs a fish by its beak, 2014, in Shetland, Scotland. Gannets, and other seabirds, depend on abundant fish populations to survive. Photograph: Richard Shucksmith/BarcroftMedia/Richard Shucksmith/BarcroftMedia “Most seabirds are long-lived and slow reproducing, this means even quite small increases in mortality can lead to significant population declines, which they take a long time to recover from.” And even some widely-dispersed coastal birds are undergoing heavy declines. For example, the study found that cormorant and shag populations have fallen by 73%. Going Forward Given all the threats facing the world’s seabirds, it’s fair to ask: where do we start when it comes to conservation?\n“We already have solutions to many of the threats...it’s just they need scaling up and implementing across industries and geographies,” Lascelles said. “Increased efforts should be made to rid seabird colonies of invasive species, reduce bycatch in fisheries or the ensnaring of birds in fish nets, and setting up conservation areas.” Facebook Twitter Pinterest Laysan Albatross adult and chick on nest dwarfed by pile of marine debris collected on Midway Atoll coast by volunteers. Plastic poses a major threat to the world’s seabirds and other marine species. The Laysan Albatross is categorised as Near Threatened by the IUCN Red List. Photograph: Alamy Paleczny also called for the creation of international marine protected areas to cover the wide ranges of seabirds. Protected areas in the oceans lag far behind those on land. Currently, only 2% of the world’s oceans are under some form of protection and less than half of those ban fishing altogether. In contrast, nearly 15% of the world’s terrestrial landscape is protected. With so little of the ocean theoretically closed to fisheries – less than 1% – it’s hardly shocking that many seabirds are suffering from overfishing. Indeed, an illuminating study from 2012 found that whenever fish abundance dropped below one-third of maximum levels, seabird populations began to fall in response. “What this is saying is that [seabirds] have evolved to exploit average to above-average feeding conditions,” co-author Ian Boyd told Mongabay in 2012. “This isn’t really very surprising, but some things don’t become obvious until the evidence is right in front of you.” At the time, Boyd said their findings should result in a new campaign to save “one third for the birds” (and other marine predators) from the world’s fisheries. But to Hammill the “most pressing issue” is plastic pollution. Long neglected by environmentalists – perhaps due to the intractability of the problem – the issue of plastic pollution in the oceans has been slowly getting more notice. A paper released last month found that 90% of the world’s seabirds likely have plastic in their stomachs. “I have seen everything from cigarette lighters...to bottle caps to model cars. I’ve found toys [inside seabird guts],” co-author Denise Hardesty, with CSIRO, told the Associated Press. Related: Up to 90% of seabirds have plastic in their guts, study finds Seabirds continually mistake plastic for fish eggs, devouring large amounts. Plastic in animals’ stomachs not only release deadly toxins, but can also lead to slow starvation by obstructing the animals’ bowels. Birds even feed plastic bits to their young, killing their fledglings en masse. In the end, large-scale actions to help seabirds could also go a long way in cleaning-up our increasingly trashed marine ecosystems. “The oceans are still woefully under protected and fisheries need greater management and enforcement. All of these activities need investment and support of governments around the world to make them happen,” Lacalles said. “These actions will build resilience in the seabird populations in the short term, which they need in the face of emerging threats such as climate change.” Facebook Twitter Pinterest No other bird breeds further south than the Near Threatened Adelie Penguin (Pygoscelis adeliae). Numbers are increasing in the Ross Sea region and decreasing in the Peninsula region, with the net global population increasing overall. But other penguin species aren’t faring so well. Photograph: Ben Lascelles/Birdlife International Facebook Twitter Pinterest The accidental bycatch of huge numbers of seabirds in a variety of fisheries (e.g. longline, trawl, gillnets) is one of the main threat facing seabirds and has driven the declines in many species, particularly albatross. However a number of simple mitigation measures are available, and where they have been implemented the reduction in bycatch has been dramatic. Photograph: Ben Lascelles/Birdlife International Facebook Twitter Pinterest The razorbill (Alca Torda) is a member of the puffin family restricted to the North Atlantic. They nest on rocky cliff faces in huge colonies, in some location reduction in sandeel, their main prey item, has caused reduced productivity and declines. Photograph: Ben Lascelles/Birdlife International", "source": "World news | The Guardian"}