{"published": "2015-09-08T13:01:27Z", "media-type": "Blog", "title": "Indian man wins $1m in Dubai Duty Free draw", "id": "78926871-23a2-4ff2-b4eb-e2453a407ddb", "content": "Indian man wins $1m in Dubai Duty Free draw\nA Porsche car and Ducati bike were also given away in other promotions\nPublished: 17:01 September 8, 2015 Staff Report\nshareRssShare on facebookShare on facebookShare on twitterShare on twitterShare on google_plusone_shareAdd on google plusShare on emailSend Email to FriendMore Sharing ServicesAddthis\nDubai: An Indian has won $1,000,000 (around Dh3.67 million) in the latest Dubai Duty Free dollar millionaire draw promotion.\nHarsh Sharma was not available for an immediate comment when his ticket won the Millennium Millionaire. The draw was conducted at Shaikh Rashid Hall in Concourse C, presided over by Dubai Duty Free senior officials headed by Executive Vice Chairman Colm McLoughlin.\nMeanwhile, Dubai Duty Free also conducted the Finest Surprise draw directly after the Millennium Millionaire and announced two winners of the latest sports model of Porsche and Ducati.\nKhalid Algburi, a 40-year-old Iraqi living in Bahrain, won a Porsche Panamera 4. He said: “This is my first time to participate in Dubai Duty Free promotions and I thank Dubai Duty Free for giving me my first ever biggest win in my life!”\nMeanwhile, a red Ducati Streetfighter 848 was won by Mohammad Majeed, a Pakistani from Jeddah, Saudi Arabia, who is a regular ticket buyer in the promotion.\nshareRssShare on facebookShare on facebookShare on twitterShare on twitterShare on google_plusone_shareAdd on google plusShare on emailSend Email to FriendMore Sharing ServicesAddthis\nMore from Society Indian man wins $1m in Dubai Duty Free draw\n‘We thought it was the end’\nFirst Gulf Bank waives obligations of martyrs\nSpecial stamps to commemorate Martyrs’ Day\nDubai Municipality Centre in Al Kefaf ready\nWorkers claim they were duped by telecom agents\nMohammad visits families of martyrs\nPostal services keep up with technological boom\ntags from this storySaudi ArabiaDubaiBahrain\ntagsSaudi ArabiaDubaiBahrain\nAlso In Society‘We thought it was the end’\nFollow usRssFollow us on FacebookFollow us on google plusFollow us on youtubeFollow us on Instagram\nMost Popular ViewedCommentedVideosPictures\n01Alert after new type of snake found in Dubai\n02Expats mourn with the rest of the country 03UAE leaders join in funeral prayers 01Expats mourn with the rest of the country 02Alert after new type of snake found in Dubai\n03UAE leaders join in funeral prayers Play\tPlay\tPlay\tPlay\n39Images\t9Images\t17Images\t9Images\nUAE: Weather today today-weather\nweather-volume Latest User Comments\nBalakrishnan V wrote: Hats off martyrs! Patriotism will be in the blood of any and everycitizen of a country and it is ... In Response To:‘Martyrs are heroes, their sons are our sons’ Heiraa Bhat wrote: I would like to express my sincere condolences to the brave soldiers ofthis country and would like... In Response To:‘Martyrs are heroes, their sons are our sons’ Kevin wrote: RTA buses are picking up children from Al Nahda Sharjah at 05.30am andschool starts at 07.30am. My... In Response To:First week of school bus problems worry parents\nMost Popular on Gulf News\nLast words: 'Sell my car to build a mosque'\nAlert after new type of snake found in Dubai\nPictures: Thousands pay respects to soldiers\nOffices and schools in UAE to remain open\nUAE jet fighters pound rebel positions in Yemen\nUAE firms grant 4% salary hike for 2015\nMohammad Bin Zayed visits martyrs' homes\n‘I can’t help but cry to quell sense of loss’\n‘Waleed, you’re going to come back’", "source": "Most viewed RSS"}