{"published": "2015-09-17T09:39:21Z", "media-type": "News", "title": "IntegReview IRB Announces Move to New Location", "id": "814f50a9-e489-4c04-91f4-f13ed057afd4", "content": "--( PR.com )-- IntegReview IRB officially announced their move to a new location along Austin’s beautiful Barton Creek Greenbelt, located at 3815 S. Capital of Texas Hwy, Ste. 320, Austin, TX 78704. “We are thrilled to be in our brand new office,” says Melissa Meyer, Vice President for IntegReview IRB. “Our team designed a forward-thinking, environmentally-friendly layout to create a great working atmosphere for our employees. Our expansion will allow us to meet the increasing clinical research needs of our clients.” \n\nWhile Austin is developing into one of the fastest-growing bio-pharma corridors in the U.S., IntegReview IRB is also growing and looking to bring new jobs to the area. “New companies are continuously being attracted to Austin at a rapid rate and we are already benefitting from this influx of business,” says Sarah Attwood, Director of Business Development. “IntegReview IRB is here to meet their needs and provide personalized service. Our custom-designed, secure online portal allows clients to submit forms, monitor the review process and retrieve study documents in real-time 24/7.” \n\nIntegReview IRB’s new location offers double their previous space including a conference room with seating for over 45 participants. It also features an additional 1000 square feet of office space to accommodate new staff, a state-of-the-art data temperature-controlled storage with continuous backups, and a modernistic, high-tech room for auditors with outstanding views of Austin’s hill-country landscape. IntegReview IRB’s new location in South Austin--just minutes from the airport and downtown--means easy access for clients. \n\nAbout IntegReview IRB: \nIntegReview IRB is an independent institutional review board that reviews biomedical, medical device, social, educational, and behavioral research involving human subjects in the U.S., Latin America, Canada and Japan. IRBs are responsible for assuring the protection of the rights and welfare of human subjects who volunteer to participate in clinical research studies. IntegReview IRB is regulated by the FDA, Office for Human Research Protections (OHRP) and Health Canada to review, approve the initiation of, require modifications to and conduct periodic review of research. IntegReview IRB was founded by Lynn Meyer, Managing Partner and has been in operation for 16 years. The business is woman-owned, certified by the Women’s Business Enterprise National Council (WBENC) and is accredited by the Association for the Accreditation of Human Research Protection Programs (AAHRPP). \n\nIntegreview IRB is dedicated to providing unsurpassed ethical review services. The ethical principles employed by IntegReview IRB are those identified in the Belmont Report: respect for persons, beneficence and justice. IntegReview IRB offers superior customer service without compromising ethical values. Ms. Attwood concludes, “We are advocates for research study subjects. Accuracy, honesty and individualized attention to details are central to our mission and what distinguishes us as an exceptional IRB.” \n\nwww.integreview.com \n\nOffice Contact: Melissa Meyer, Vice President, 512-326-3001, ext. 252, mmeyer@integreview.com \n\nMedia Contact: Sarah Attwood, 512-326-3001, ext. 225, Cell: 512-826-7709, sattwood@integreview.com \n \nContact Information: \nIntegReview IRB \nSarah Attwood \n512-326-3001 \nContact via Email \nwww.integreview.com \n \nRead the full story here: http://www.pr.com/press-release/637396 \n\nPress Release Distributed by PR.com", "source": "ECPlaza"}