{"published": "2015-09-24T19:01:36Z", "media-type": "News", "title": "Veterans, infrastructure, economy all priorities", "id": "431dfaf8-cea8-4b80-a466-819fa473e69f", "content": "QUINTE WEST -   \nThere’s a lot at stake Oct. 19. \n \nPolitical parties, and more importantly voters, all have one thing in common, and that’s priorities, whether it be lower taxes, infrastructure investment or providing better care for veterans. \n \nTom Kupecz now works on the civilian side of the street, helping to ensure veterans are well treated. \n \nThe retired Lt. Colonel spent the  bulk of his 42-year career in the Royal Canadian Air Force flying fighter jets – both the CF-100 and CF-5. \n \nA few weeks ago, Kupecz was waving a protest placard in front of Trenton Memorial Hospital. \n \nKupecz, who owns a consulting firm with his wife, is a member of Our TMH. He’s spent months studying other community hospitals and how they operate independently from their larger, corporate cousins. \n \nKupecz is also one of the key movers behind a plan to add a veterans’ care centre to the hospital. \n \nThe idea has received attention from federal leaders and candidates of all political stripes. \n \nKupecz said veterans have always come back from foreign deployments with health issues largely misunderstood or misdiagnosed. \n \n“It’s encouraging to see the initiatives that have been started in terms of veterans’ care. They are wonderful. To keep emphasizing that, we need to make sure veterans who have health issues get the very best care. And, to my mind, that means making sure they have a secure income and secure support system, with effective programs to get that support when they need it,” he said. \n \nKupecz spent about 14 years outside the country. He is also an Afghan war vet. \n \n“As a veteran I feel it’s important that we contribute to our alliances, as we’ve done with the United Nations in the past, and stepping up to the plate when it comes to international issues. At the same time we need to support refugees and send money to all causes that are helping people around the world. International and aid support is quite important to me,” he said. \n \nRed Shark Men’s Wear has been a fixture in downtown Trenton since 1970. \n \nOwner Shane O’Shaughnessy has seen a lot of other businesses come and go over the decades. He’s also seen the good and the bad when it comes to the economy, but always managed to hang on and make a good living. \n \n“Look at it this way, if the economy was good right now I wouldn’t be having a buy one, get two free sale,” said O’Shaughnessy. \n \nBut O’Shaughnessy does what he has to in order to ride out the downturn, or technical recession as he describes the state of the current economic climate. \n \nThe business owner says it’s time for the federal government to inject more cash into the economy. \n \n“People have to realize the more that’s flipped over is good. Even if that’s tax money.” \n \nBalancing the budget, he said, isn’t the answer, at least not right now. \n \n“Balanced budgets are wonderful if the economy is booming, but the economy hasn’t been booming in a very long time. In a technical recession there’s always the risk of stagnating the economy even more by cutting programs and taking other fiscal measures in order to balance the budget. What we need now is more investment by the government,” said O’Shaughnessy. \n \nA pragmatist, O’Shaughnessy says there’s no easy fix. \n \nLowering tax rates, he said, isn’t always the answer. He says the current tax structure is “fair.” \n \n“What governments need to do is stop being wasteful. It’s not that Canadians don’t mind paying taxes. We all need health care. We need infrastructure. What we don’t need government to do is waste money,” said O’Shaughnessy. \n \nO’Shaughnessy said part of the problem is the current government has hung the economy on the price of oil. \n \n“It’s a wonderful thing if oil prices are rising, but terrible if they’re not. Our dollar is falling. Our economy is falling. We pegged our dollar so high that every other manufacturing job has gone to another country. The U.S. is ramping up. They are doing a lot better than we are. There’s a lot of distrust with the government,” he said. \n \nMost municipal leaders will tell you when it comes to federal spending, cash for infrastructure is always at the top of the list. \n \n“When isn’t it at the top of the list?” said Mayor Jim Harrison. \n \nThe city is in the midst of a massive $70 million overhaul of Trenton’s waste water treatment facility. About $30 million will be spent this year. \n \nThe city has received more than $3 million in funding for the project. \n \n“But we have a long way to go before it’s completed. Any support will be greatly appreciated,” said Harrison. \n \nBut that isn’t the only project. \n \n“We’ve got a lot of underground infrastructure that needs to be replaced. As far as I’m concerned, infrastructure is the number one concern,” said Harrison. \n \nInfrastructure isn’t the only issue in town. \n \n“We want the government to continue the work that’s been done at CFB Trenton,” said Harrison. \n \nHarrison said the major political parties are addressing the infrastructure deficit, the Liberals and Conservative more so. He said the Conservative government has spent a lot of money in Quinte West, and followed that up by saying the Liberals have also committed to infrastructure funding. \n \n“I’ve talked to the candidates to make sure they follow through on their commitments,” he said. “But funding hasn’t gone far enough. We’ll push them to make sure they go beyond the envelope to help make sure our needs are met. All infrastructure is important to us. It helps us grow and makes the city a better, and safer place to live.” \n \nernst.kuglin@sunmedia.ca", "source": "Community Press Canada"}