{"published": "2015-08-07T18:51:29Z", "media-type": "Blog", "title": "GREG ADLER AND TEAM 4 WHEEL PARTS IGNITE BAJA WITH LUCAS OIL OFF-ROAD", "id": "0472c860-23b7-4ed7-bd87-2992eae25cc6", "content": "GREG ADLER AND TEAM 4 WHEEL PARTS IGNITE BAJA WITH LUCAS OIL OFF-ROAD \n \nCompton, California (August 5, 2015) – Ensenada, Mexico welcomed Greg Adler Motorsports and short course off-road racing this past weekend, as the Lucas Oil Off Road Racing Series made its much anticipated debut in the Baja California port city. The newly constructed facility on the grounds of the scenic Estero Beach Hotel and Resort featured a 1.1 mile course highlighting one of the longest straight-a-ways in short course off-road racing, along with deep, loose dirt that more closely resembled the sandy shores of Baja than the tightly compacted surface that competitors are accustomed to. \n \nAs coastal breezes and capacity crowds enveloped Adler and Team 4 Wheel Parts, driver and team were quickly tasked with preparing the 900 HP #10 for battle. A full day of practice on Friday afternoon allowed Adler the opportunity to familiarize himself with the course and prepare for the weekend of Rounds 11 & 12 of Pro4 class warfare. \n \nBaja off-road competition traditionally equates to long distance endurance competitions with spectators rarely experiencing the event beyond a few quick seconds of vehicles passing by at high speed. The fan-friendly environment at Estero Beach delivered a level of access to the teams that attendees enthusiastically embraced, and as Adler and the team worked to find their footing on the challenging track, they arrived early and en masse to take in the sights and sounds of the event. \n \n“It was quite an experience,” said Adler. “Everyone here knows off-road racing but rarely do they have a chance to see the trucks without their fiberglass bodies on and the crew in action. It was exciting for us to have the opportunity to engage with the fans as they experienced short course off-road racing for the first time in Baja.” \n \nSaturday’s qualifying session put Adler on the second row to open up the weekend’s action and at the drop of the green flag, he found himself among the leaders. As the elite of off-road racing fought in the afternoon’s marquee event of the day, he continued to contend for a podium spot, at one time sitting as high as second. A wild restart following a yellow flag shuffled him into third, and with just a two laps to go, his chance at a trophy slipped away as he entered a corner while approaching the front straight. A competitor pushed just underneath him taking the position and at the checkered flag, Adler found himself in fourth, just two seconds outside of the third place spot. \n \n“This is a big, fast, wide open track,” he said, after the race. “These trucks are flying on this course and with a field as talented as this, just one slight mistake can be costly. The crew gave us a fast truck and it ran great. Now we just need to find that extra little bit to get us to the front.” \n \nSunday’s Round 12 was less forgiving. While the group remained tight through the beginning of the race, Adler maintained a top-five position while fighting through the field. A mid-race incident brought out a caution flag and in the chaos of the ensuing restart, Adler was shuffled back into the pack. He maintained a face pace but with the loose dirt creating an enormous amount of “roost” from the truck in front of him, vision was at a premium. Resigned to bringing the truck safely home to preserve valuable points towards his season total, Adler finished the race in 8th place. \n \n“That was tough,” said Adler. “We were in the thick of the fight and after the restart we were three wide going into the corner. We got caught up with too many guys fighting for the same spot and it cost us. We finished and the truck was in great shape but we were running strong and would have been a lot happier coming home with a podium.” \n \nAfter a weekend of energetic, standing-room-only crowds, this inaugural event, a culmination of the efforts of Lucas Oil officials, Ensenada’s Ampudia family and the Estero Beach Hotel’s Gerardo Novelo and his family, was deemed a groundbreaking success as the series launched a new brand of off-road racing to the Baja California peninsula. \n \n“This was great for short course and great for the fans here in Baja,” said Adler. “Everyone was so welcoming and the entire experience was fantastic for our team. We’re already looking forward to coming back next year.” \n \nIn just three short weeks, Greg Adler and the Lucas Oil Off Road Racing Series return to the high-flying Wild West Motorsports Park in Reno, Nevada. The series will also visit Las Vegas before the season comes to its conclusion in Lake Elsinore, California for the Lucas Oil Challenge Cup. Follow Greg Adler Motorsports on Twitter, Instagram, Facebook and Team4WheelParts.com. There’s nothing like live short course off-road racing action, but if you can’t be there to see it in person, the Lucas Oil Off Road Racing Series is broadcast throughout the season on CBS, the CBS Sports Network and MAVTV. \n \nGreg Adler Motorsports is Supported by: \n4 Wheel Parts · Pro Comp Tires · ODYSSEY Battery · MagnaFlow Exhaust · AMP Research / AVS · Lund · Red Kap · Daystar Products · G2 Axle & Gear · Bushwacker · Makita Industrial Power Tools · MasterCraft Safety · Fox Racing Shox · K&N Filters · Fiberwerx · GoPro · AAM \n \nAbout 4 Wheel Parts: \n4 Wheel Parts is the global leader in off-road truck, Jeep and aftermarket performance products. With 70 locations across the U.S. and Canada and growing, 4 Wheel Parts Service Centers install all the products they sell. Maintaining the nation’s largest inventory of off-road tires, wheels, lift kits, and accessories, 4 Wheel Parts serves customers across the country and around the globe. Life is Better Off-Road™. Visit them at 4wheelparts.com or call toll-free 877-474-4821 \n \n\n \nThe post GREG ADLER AND TEAM 4 WHEEL PARTS IGNITE BAJA WITH LUCAS OIL OFF-ROAD appeared first on race-deZert.com .", "source": "race-deZert.com"}