{"published": "2015-09-20T15:00:00Z", "media-type": "News", "title": "Forget About Work-Life Balance and Try This Instead", "id": "7be35355-7374-48b0-bb96-4ed2dbbb6d6e", "content": "The pressure to do it all, have it all, be it all, and still have a perfect home to throw Pinterest parties in is pervasive and leads inexorably to talk of multitasking and time management. Balance , to me, is finding a way to spin all the plates on all our appendages. But if minimalism is a counterpoise to physical excess, then taking things out of our schedules must be the antidote to busyness and the key to being present . Here are some ways to practice presence in your daily life. \n \n 1. Put the technology away. Lose the phone, close the laptop, turn off the tablet. Whatever it is, if it has a screen, stop looking at it and look at a person, look at the sky, look at yourself in the mirror. Disconnect to connect. I'm saying this to myself, as well. \n \n 2. Take a hard look at what you do with your time. We all have things we have to do (work, cook, clean, pay bills) and things we want to do (spend time with our families, finish the baby albums, go for a girls'/guys' night out). We also have things that must be done and things that, frankly, don't have to be done. If anything falls into both categories of I don't want to do it and doesn't have to be done (at least not by me) , by all means get it off your schedule and out of your life! Time is too precious. \n \n 3. Compartmentalize your time. Do whatever you can to associate certain places with certain activities; namely, leave your work at work and when you're at home, be at home. Of course, this isn't always so clear-cut. If you work from home or you must check email, etc., outside of office hours, designate specific- preferably small- chunks of time for those activities. If you're doing work, do it well, do it wholly, so you're free in mind and heart to truly be with your loved ones when it's time for that. Exercise to be where you are . If you're home, enjoy it, live in it, interact with it and with others in it. If you're with people... you get the idea. We all know this, we all want it, but we've got to start actually doing it. \n \n 4. Make the ordinary special. Use those in-between times- those car rides to the kids' activities, the grocery shopping, the dinner-cooking, even the cleaning, all those daily \"boring\" things- as opportunities to have conversations and enjoy one another's company or even enjoy the task itself. Those activities are a means to a practical end, but we can do more to make the means count and to enjoy them, all through an awareness of our mindset. \n \"I went to the woods because I wished to live deliberately ... not, when I came to die, discover that I had not lived ... I wanted to live deep and suck out all the marrow of life.\" -Henry David Thoreau, Walden: Or, Life in the Woods   \"Remember, remember, this is now, and now, and now. Live it, feel it, cling to it. I want to become acutely aware of all I’ve taken for granted.\" \n-Sylvia Plath  \nBusyness isn't a badge of honor, and multitasking robs us all too often of what matters most. As usual, literature connects us to a sobering deeper truth. Henry David Thoreau and (tragically, poignantly) Sylvia Plath remind us that a full life isn't one that's busy or balanced, but one that's lived . \n\n (Image credits: Hayley Kessner )", "source": "Apartment Therapy"}