{"published": "2015-09-24T02:49:39Z", "media-type": "News", "title": "President won’t lead PML-N poll campaign: spokesman", "id": "6f7e4237-cb2f-4ff3-86cd-4d400c61f4db", "content": "ISLAMABAD: The Presidency clarified on Wednesday that President Mamnoon Hussain had no intention to lead the PML-N campaign for local government elections in Sindh. \n\n“President Mamnoon Hussain, as a symbol of the federation, is above politics and has no political motives,” the president’s spokesman said, rejecting the PPP’s objection to his participation in a PML-N meeting despite a ban on his taking part in political activities by the court. \n\nAccording to a press release issued by the PM Office on Monday, Prime Minister Sharif and President Hussain co-chaired a meeting of the PML-N Sindh office-bearers held at the Prime Minister’s House. \n\nThe party’s Sindh general secretary briefed the president and the prime minister on the district committees set up in all 29 districts of the province to launch mass contact campaigns, it said. \n\nThe PPP, whose Co-Chairman Asif Ali Zardari had been criticised for holding dual offices and convening meetings of the party at the Presidency, said it wondered how President Hussain could chair a political meeting of the ruling party. \n\n“The PPP is surprised that unlike former president Asif Zardari, the incumbent president is no longer restrained by the court order from participating in partisan political meetings,” PPP’s spokesman Farhatullah Babar said in a statement on Tuesday. \n\nBut the president’s spokesman said: “There is no truth in the reports that the president will lead the PML-N campaign for the local bodies’ elections in Sindh.” \n\nThe spokesman said in statement that in the past President Hussain had for long been active in politics in Sindh and had wide connections with the provincial leadership and workers due to which a large number of political workers remained desirous of meeting him in their individual capacity. \n\n“Recently, when office-bearers of Sindh PML-N came to Islamabad they expressed their desire to meet the president on a personal and social basis upon which Prime Minister Nawaz Sharif personally requested the president to informally visit the PM House and meet his former colleagues,” the spokesman said. \n\n“There were no political motives of the president behind that meeting,” he added. \n\nThe Lahore High Court had on May 12, 2011, ruled that (then) President Asif Zardari should relinquish the post of PPP co-chairman and the Presidency should not be used for political activities. \n\n“The use of Presidency for political activity is inconsistent with its sanctity, dignity, neutrality and independence. Therefore, it is expected that the president of Pakistan would cease the use of the premises of Presidency for political meetings of his party,” the four-judge bench of the LHC had said in its order on a petition filed by senior lawyer A.K. Dogar on behalf of the Pakistan Lawyers Forum challenging the holding of political office by Mr Zardari. \n\nPublished in Dawn, September 24th, 2015 \n\nOn a mobile phone? Get the Dawn", "source": "DAWN Group"}