{"published": "2015-09-20T04:52:30Z", "media-type": "News", "title": "Neosho falls in old-fashioned barnburner, 20-19", "id": "8a2f5f4d-823c-4de2-a77b-ea13e601d4bc", "content": "CARTHAGE — For the second time this season, the Neosho Wildcats battled a state-ranked Central Ozark Conference Large opponent down to the final play. The Wildcats fell behind 14-0 to Class 5’s No. 9 Carthage late in the first quarter and trailed 20-6 at halftime Friday night at K.E. Baker Stadium. However, the Wildcat defense came through with consecutive drive-ending stops on fourth down and Devin Hames’ 4-yard touchdown run with 2 minutes, 10 seconds remaining in the game made it 20-19 Carthage. Neosho head coach Dustin Baldwin and the Wildcats decided to go for the two-point conversion and the lead, showing confidence in their offense and their defense. Jake Kleindl and Zach Thornton stopped a scrambling Coleman Scott short on the conversion after a play-action pass broke down and dodged a bullet on the ensuing onside kick, the ball trickling out of bounds before Neosho could gain possession. Neosho’s D stuffed Carthage’s Kendall Young on fourth-and-2 at the Neosho 42 and the Wildcats took over possession with only 7 ticks left. On first down, Scott missed Hames on a short pass. On second, Scott connected with Payton Klier over the middle. Klier gained 19 yards, tackled at the Carthage 39 as time expired for a 20-19 Carthage victory on its homecoming. Neosho’s two losses this season have come by a total of four points. Defensive stands fuel Wildcats In the second half, the Wildcats were very much a bend and don’t break defense. Taking first possession, the Tigers worked two first downs on third-down plays, a 9-yard pass and catch with quarterback Keith Guest and running back Young and a 33-yard pass from Guest to fellow junior Logan Kabance, a play that burned Neosho on three different occasions for nearly 100 yards and three first downs. Guest’s 12-yard run down to the Neosho 11 gave the Tigers a first down. After Carthage’s signal-caller ran for four yards on first down, Neosho stiffened, dropping Trey Collins for a two-yard loss and forcing an incomplete pass on second and third downs, respectively. With a fourth-and-8 at the Neosho 9, Carthage went for it and Guest’s pass to Tyler Ralston took the senior wide receiver out-of-bounds. On the subsequent Neosho possession, the Wildcats moved the ball near Carthage territory behind a pair of first-down runs by Hames and Scott, Scott’s 11-yard run a highlight of the drive. The Tigers were whistled for a 15-yard personal foul penalty, giving Neosho first-and-10 at the Carthage 37. The Wildcats dialed up a little trickeration, as backup quarterback Gavin Kelley hit Ethan Siler for a 37-yard TD pass on a halfback pass. Brett Williams’ extra point made it 20-13 Carthage with 2:30 left in the third. Page 2 of 4 - We had a brand new game. Dillon Lancaster’s 21-yard kickoff return gave Carthage possession at its own 30 with 2:21 remaining in the third. Once again, Carthage pieced together a drive into Neosho territory and the Tigers had an apparent first down on fourth-and-1 at the Neosho 21 taken away by a holding penalty. With a fourth-and-13 at the Neosho 33, Guest overshot Ralston down the middle and the Tigers had their second 10-plus play drive stall out with no points. Taking over at their own 33 with 9:04 left on the clock, the Wildcats answered with their own meticulous drive lasting 6:54 and taking 17 plays before Hames’ 4-yard TD run. Hames leaped into the end zone from about the Carthage 2. Key plays on the drive included a Jarvis Funk 10-yard reception that gained 10 yards back after an illegal block. Then, on the next play, rather than a fourth-and-long, Neosho faced a fourth-and-1 and Scott earned it with a 2-yard keeper. Klier made a 13-yard catch, followed by a Hames 10-yard run and the Wildcats earned first-and-goal after Scott rushed for six yards on a fourth-and-2. Turnovers, not penalties Two Neosho turnovers proved costly in the first half. On the first play of the game, Neosho worked a shuffle pass to Klier for a 33-yard gain down to the Carthage 32. Six plays later, with a second-and-5 at the Carthage 10 after a Funk 10-yard reception and a Hames 5-yard run, Klier fumbled the ball and Carthage recovered it at the 12. Four first downs and one Kabance 37-yard reception down to the Neosho 1 later, Carthage scored the first TD on a Collins 1-yard run. Down 20-6 late in the first half, Collins intercepted Scott in the flat on the Wildcats’ first play after Carthage took its 14-point lead on a Collins 10-yard scamper. That was Scott’s first interception since three in the season opener against McDonald County. Fortunately, for the Wildcats, their defense came through with a stand, gang-tackling Guest short of a first down on fourth-and-5 at the Neosho 25. After surrendering 20 points on three of Carthage’s first four possessions, the Wildcat defense answered the bell the rest of the game and Carthage’s last four possessions all ended in Neosho fourth-down stops. On the bright side, Neosho avoided the penalties that had plagued the Wildcats the previous four weeks. There were no touchdowns called back on penalties or opponents’ drives extended due to a needless personal foul. Wildcat offense in shuffle mode Neosho’s first touchdown came on a Klier 66-yard gain off a third-and-3 shuffle pass only 11 seconds into the second quarter and the Wildcats had 99 yards and one TD off those two plays. Page 3 of 4 - All other plays in the first half resulted in a net of 15 yards, the Wildcats hurt by three quarterback sacks on Scott totaling in losses of 25 yards. Neosho picked it up in a second half during which both teams each had three possessions, scoring on its first two after going 1 for 6 in the first half. Up next Neosho, 3-2 overall and 1-2 in the COC Large, hosts the Nixa Eagles on Friday for homecoming. The Wildcats’ juggernaut schedule continues with state-ranked Nixa after state-ranked Carthage and before state-ranked Webb City, the five-time defending Class 4 state champions ranked in the top 20 high school football teams in the United States by USA Today. The Cardinals are currently ranked No. 17. Webb City defeated Nixa 31-16 on Friday night. Cardinals running back Hunter Vanlue rushed for 102 yards and two touchdowns on seven carries, his 53-yard TD run giving Webb City a 14-0 lead in the first half. Keaton Burroughs’ 95-yard TD run opened the scoring, while Nixa’s Logan Tyler, a Florida State recruit at placekicker, scored on a 53-yard TD run for Nixa’s first score. Cory Duley kicked a 44-yard field goal for Webb City and backup quarterback Andrew Greek made it 24-6 halfway through the second quarter with a 9-yard run. Nixa’s backup quarterback Andrew Rivera hit Chase Allen on a 16-yard TD pass for a 24-13 halftime score. Burroughs finished with 165 yards on a night when the Cardinals played without their regular starting quarterback Tyson Roderique. Tyler briefly came out in the second quarter after landing awkwardly on a run. The Eagles and the Wildcats share at least two similarities entering their game next Friday: both teams own 3-2 overall records with both their losses coming against state-ranked opponents, Neosho to fellow Class 5 district opponents Willard and Carthage and Nixa to Class 6 Francis Howell and Class 4 Webb City. The Eagles defeated Willard two weeks ago to knock their rival Tigers out of the Class 5 rankings. Carthage, winners of four straight games after a 31-0 season-opening loss to Webb City, travel to Republic for their second meeting with a fellow Tigers squad in three weeks, coming off Ozark two weeks ago. Republic improved to 3-2 with a 42-20 win over winless Branson. The Pirates’ losing streak increases to 13 games. CARTHAGE 20, NEOSHO 19 NHS                       0 6 7 6 —  19 CAR                     14 6 0 0 — 20 SCORING SUMMARY First quarter C — Collins 1 run (Monzon kick), 6:09 C — Guest 4 run (Monzon kick), :40 Second quarter N — Klier 66 pass from Scott (kick failed), 11:49 C — Collins 10 run (kick failed), 3:12 Page 4 of 4 - Third quarter N — Siler 37 pass from Kelley (Williams kick), 2:30 Fourth quarter N — Hames 4 run (run failed), 2", "source": "Neosho Daily News"}