{"published": "2015-09-23T11:38:52Z", "media-type": "News", "title": "CCECC in Nigeria: Five airport terminals set to wear a new face", "id": "319129ea-4286-4342-94b1-a06331daee7d", "content": "Nigeria has begun upgrading her aviation infrastructure to showcase the country’s rising profile as Africa’s economic powerhouse. With a $500 million loan from the Export and Import Bank of China, five airport terminals at its principal aviation hubs are under construction by the China Civil Engineering Construction Company. Despite the promise which the project holds for commercial flights in Nigeria’s dominant economic centres, uncertainty still surrounds the immediate completion and future sustainability of these airport terminals. reports. \n \nIt’s the wet season in Nigeria, a slow period for construction work owing to the onset of heavy rains. As expected, the giant cranes above the new terminal building under construction at the Murtala Muhammed International Airport in Lagos seem to have stopped moving — at least temporarily. \n \nAlthough the signage at the entrance to the project site proudly announces the client as the Federal Ministry of Aviation/Federal Airports Authority of Nigeria, not much comings and goings can be seen of the contractor, the China Civil Engineering Construction Company (CCECC). Passers-by and passengers alike may assume the halt in construction is due to the monsoon weather but lack of finance has been pointed to as the culprit behind the delay. How can the clientsuddenly run out of cash? \n \n“Fraud! The money has been removed…over 70% of that money has been removed by the previous minister of aviation. Where is the money to complete the project? \n \nAlhaji Mohammed Tukur, an aviation analyst and former managing director of Chanchangi Airlines, responded when I spoke to him on the telephone. “Call the contractors—ask them what is going on—they will tell you. It’s just (the Nigerian face of) corruption.” \n \nAll efforts to obtain information from the contractor, China Civil Engineering Construction Company in the course of this investigation proved abortive. \n \nNigeria has a long history of public funds mismanagement and diversion of foreign loans to private pockets or sometimes, toward totally unrelated government expenditures — away from the original purposes for which such credit were obtained in the first place. \n \nFor example, the Federal Ministry of Finance was recently queried by President Muhammadu Buhari on the alleged diversion of a $1 billion loan that was secured from China by the last administration for the construction of the Lagos-Kano railway project. Still, the Chinese government is more than willing to extend credit to Nigeria without any sort of probity in the utilisation of these funds — an offshoot of China’s policy of non-interference in the domestic affairs of sovereign states. \n \nThe $500 million loan for the five airport terminals is part of a bigger $1.1 billion credit facility obtained from the Export and Import Bank of China for the building of critical infrastructure that includes the Abuja Light Rail and the Galaxy Backbone ICT projects. Both Chinese-funded aviation and rail projects are being executed by CCECC, a symbol of Beijing’s growing influence in Africa. \n \nThis strategic policy of the Chinese government—giving with one hand and taking back with the other, undermines the competitiveness of Nigeria’s construction firms and outsources domestic jobs to Chinese expatriates. The decision to award the contract to CCECC, a foreign company that had until the 2000s played no role in the construction of public infrastructure in Nigeria begs for an independent inquiry. \n \nA press release issued by the Finance Ministry on its website states that the facility was obtained on highly favourable concessional terms: 2.5 per cent interest over 20 years with a grace period of seven years. Captain Dele Ore, president of the Aviation Roundtable and former pilot and manager of defunct Nigeria Airways, disapproves Nigeria’s decision to obtain credit from China to finance capital projects. \n \n“A decision like that to take a loan to expand airport infrastructure is a tonne of debt that will be hanging on the neck of our children for generations to come. Normally when you want to develop infrastructure, invite investors…and there are so many ways of doing it. Besides not being transparent, I think it was not a very good decision. They are getting more and more debt for people yet unborn.” \n \nA few kilometres from the international terminal under construction by CCECC, is the domestic terminal of Lagos airport, commonly referred to as ‘MMA2’. Through a concession agreement between Bi-Courtney Aviation Services Ltd and the Federal Government of Nigeria, the facility was commissioned in 2007. The concession entrusted the development and management of the terminal to Bi-Courtney, a leading Nigerian airport operator, for a maximum period of 25 years after which the ownership of the facility will be transferred to the Federal Airports Authority of Nigeria. This Public-Private Partnership (PPP) model transformed the domestic terminal of Lagos airport into the best of its kind in Nigeria, providing a model for similar projects in the future. \n \nWhy can’t the federal government use this successful PPP approach to develop and operate the international terminals across Nigeria? \n \n“In determining long-term sustainability of concessions over development loans or vice-versa, a number of factors have to be considered,” Abiodun Keripe, head of research at Lagos-based Elixir Investment Partners explains in an email. “Firstly, financing and cash-flows. Management and profitability of the project is also another factor to be considered. The financial status of our international airports and the need to upgrade and expand airport capacity clearly does not give much room for other [financing] alternatives. As with many capital-intensive projects, debt financing is one of the viable sources of financing as long as the cost of borrowing (interest rate) and the tenor (duration) is favourable to allow for a good gestation period of the project.” \n \nFor a megacity of 12 million people and an economy of about $90 billion which dwarfs that of several West African countries combined, the scale of the international terminal being built at Lagos airport is unimpressive. In this decade and the coming ones, Lagos is poised to play the role which great cities such as Tokyo and Seoul played in the development of their respective countries in the last century. The metropolis needs world-class infrastructure to perform this role effectively. \n \nWhy do we even need to build five international terminals when we can focus on one or two whose capacity and standard can rival that of the best airports in the world? For instance, the airport in Port Harcourt is currently being served by four foreign airlines, two of which operate on regional routes yet a brand new terminal is being built for it. \n \nApart from the international terminal at the Murtala Muhammed International Airport in Lagos, the other international terminals under construction are in Abuja, Enugu, Kano and Port Harcourt. The Nnamdi Azikwe International Airport in Abuja is projected to serve 16 million passengers annually, up from its current capacity of 5 million. The remaining three terminals: Akanu Ibiam International Airport in Enugu, Mallam Aminu Kano International Airport in Kano and the Port Harcourt International Airport will serve 7 million passengers each upon completion. With a capacity for 25 million passengers per annum from the current 7 million passengers it presently serves, the international airport in Lagos will retain the lion’s share of the projected capacity of 62 million passengers for the nation’s new aviation hubs. \n \nPresently, there are no direct flights between China and Nigeria. Most intending travellers to China from Nigeria and vice-versa still have to connect flights at regional aviation hubs in Addis Ababa and Nairobi or via the mega-hubs of the two biggest Gulf carriers — Qatar Airways and Emirates Airlines. \n \nSince the dissolution of Nigeria Airways in 2004 after decades of loss making due to mismanagement, successive administrations have tried with varying degree of mixed results to float a national carrier. Now, there is renewed interest by the current administration to float another national airliner. But the lack of critical infrastructure will certainly hamper such plans. Alhaji Tukur dismisses the idea. “A national carrier is an old-fashioned idea! Do we have a terminal like Dubai? Do we have a terminal like Heathrow?” \n \nAnother aviation consultant and industry veteran, Chris Aligbe, faults the scale of the international terminals. “$500million is too small to develop a good terminal. Terminals take up to $1 billion.” \n \nSpeaking further on China’s capacity to develop our aviation sector, he said, “China doesn’t have a pedigree in airline management. Do you know of any world-class Chinese airline? You don’t invite people who don’t have a pedigree to come and help you — they will only lead you with the extent of the knowledge they have which will lead you nowhere.” \n \nThe recent update by Binta Bello, the permanent secretary of the Federal Ministry of Aviation, on the current halt in the construction of the airport terminals confirms that the delay in completion is due to shortage of funds. Nonetheless, the new completion date has been shifted to the first quarter of 2016. Between now and then, the new administration still needs to probe how the loans were disbursed and utilised. \n \nIdeally, this period should also be used to determine how the terminals will be managed upon their completion since the absence of a maintenance culture over the past decades led to the dereliction of the current terminals. Perhaps the Federal Airports Authority of Nigeria should enter into another agreement with CCECC on the future management of the terminal buildings. \n \nIt is important that we create a holistic strategy for attracting foreign investors, especially from the private sector, to develop and manage Nigeria’s crumbling aviation infrastructure. Granted, we may also have to source for credit from abroad. Nonetheless, the knowledge of our home-grown experts is essential for transforming our airports into premier facilities that meets the demands of international travellers for business or leisure. \n \nTajudeen Folarin, a Nigerian passenger commented: “We hope when the new [terminal] is ready for use, it will be properly managed. This airport used to be among the best in the world but look at it now. In fact, it used to be worse, but some renovation work was done by the last government. All they need to do is to maintain the new one well and travellers won’t have to suffer like we now do.” \n \n Related  \nComments \ncomments", "source": "Daily Times Nigeria"}