{"published": "2015-09-22T09:05:08Z", "media-type": "Blog", "title": "Costco Provides a Fabulous Customer Experience Example to Follow - Transforming the Customer Experience", "id": "a46ee549-8937-445d-a68f-fbcd619ae30f", "content": "Costco Customer Experience Example  \nIt was an ordinary work day filled with phone conferences and content creation. Hours spent on the phone and on my computer all focused on teaching companies how to make more money by building better relationships with their customers. \n \nImagine my surprise, no delight, when I opened up an ordinary envelope from Costco in the mail. I could feel that there is a card in the envelope so I figured there was a new membership card enclosed. \n \nInstead, there was a letter with a cash card. \n \nApparently, a shirt that I purchased for my husband for father’s day was in fact not 100% silk as it had been labeled. Costco took the initiative to notify everyone who had purchased this specific shirt and give a $20 cash card for each shirt purchased. They ALSO provided the option to return the shirt as well if we were not satisfied with it. They made sure to include a statement to specify that we were free to keep the cash card even if we decided to return the shirt. \n \nThey apologized and expressed appreciation for our continued loyalty. \n \nThe first words out of my mouth were “I will continue to do business with Costco FOREVER.” This was amazing. \n \nIn a world where companies are quick to hide behind policies, or hide the issue completely, Costco decided to bring it to MY attention and make it BETTER THAN RIGHT before I even knew there was an issue to be concerned about. \n \nThis is an example that we should all try to live up to both professionally and personally. It’s a simple premise really. Just be forthcoming and honest with your customers and they’ll appreciate it. Do it well, and they’ll be loyal to you. \n \nNow, I fully understand that there is likely a backstory that I’m sure involved a lot of rigmarole (yes, that’s how you spell it, I looked it up) and hard decisions. This is an especially notable response to the issue since I don’t remember this shirt costing a full $ 20. But the company made the decision to stand behind their products, found that this one didn’t measure up to what had been advertised, and took more than full responsibility for it. As a consumer, I really do appreciate that. \n \nAs a Customer Experience Expert, I’m so delighted to see large companies setting the example. It truly comes down to the premise I try to live by. \n \nDo the right thing. Always. \n \nHave you experienced anything similar? OR – Have you found that companies HIDE issues and create distrust? Sound off below…", "source": "Transforming the Customer Experience"}