{"published": "2015-09-06T08:00:00Z", "media-type": "News", "title": "NFL putting its online playbook to the test", "id": "5904cc20-e8b6-4a10-b93f-0ad8204a96c0", "content": "On TV, the National Football League is king. On the Internet, not so much. \n\nAs more Americans cut the cable cord, migrating online to get their fix of shows, movies and cat videos, the nation's biggest professional sports league has been experimenting with apps and other digital initiatives, so far with only fair results. \n\nNow, the NFL's media division in Culver City is moving more aggressively to complement its vast TV empire with an online presence worthy of a major sports league. \n\nOver the last year, it has replaced mobile app and NFL.com executives, welcomed four engineering and project leaders from the tech industry and increased its outreach to fans and Silicon Valley. An overhauled NFL Mobile app just launched, with a streamlined online subscription package that includes live audio of games and shows such as \"A Football Life\" and \"Hard Knocks.\" \n\nIn October, a regular season game will be broadcast for free only on the Internet for the first time. For now, the NFL isn't looking to regularly live-stream games online only - even though the technology and demand are there - because it doesn't want to jeopardize its relationships with major television networks and the billions of dollars it receives a year to show games on TV. Instead, its Internet strategy for the time being is to build online features and portals that will enhance fans' ties to the sport - and pull in some additional revenue. \n\nLeague executives know they face stiff competition online. Third-party football apps, Twitter and other sports are all vying for fans' attention, and the near-ubiquity of smartphones makes all of those options available at any time - not just when you're sitting in front of your TV. \n\n\"We know people love the NFL, but at the same time, we know we have to do things differently,\" said Brian Rolapp, who oversees the NFL's media group. \"We have to be more flexible.\" \n\nIt's a crucial strategy, given the rapid change in how and where content is viewed. Last month, media company stocks nosedived after Walt Disney Co. lowered profit-growth forecasts for its cable business, led by ESPN, because of a decline in pay-TV subscribers. \n\nAlthough analysts say access to live sports is the top reason many people stick with cable - the NFL last year saw its U.S. revenue, mostly from TV network fees, jump 21 percent to $7 billion - they warn that professional sports leagues aren't immune to changing consumer preferences. \n\n\"There's definitely a horizon people are trying to figure out for TV, and that's why most leagues are being aggressive and creative about digital opportunities,\" said Chris Russo, managing director at investment bank Houlihan Lokey and an NFL Media executive from 1999 to 2005. \n\nSome sports leagues are on their way. \n\nMajor League Baseball's media division, for one, has become so successful that it's reportedly seeking to become its own company at a market value of about $5 billion. MLB Advanced Media not only runs the league's website and apps, but also provides video-streaming technology to HBO, Sony and other heavy hitters. Last month, it agreed to take over digital operations for the National Hockey League. \n\nThe NFL is making strides: Its growth in revenue from online ads, licensing and subscriptions is surpassing every other business segment, including merchandise sales and national sponsorships. But Rolapp said that the industry is shifting at a \"velocity greater than we anticipated,\" which makes pulling off an ambitious digital plan vital. \n\nThe league's latest online projects are led by Perkins Miller, who put the 2008 Olympics on the Web for NBC and launched the World Wrestling Entertainment's online video service. Hired in April 2014 as the NFL's chief digital officer, he quickly set out to identify problems. \n\nMiller noticed that although NFL Media had bolstered digital operations over the last few years, the department tried to do too much, developing apps such as one to find bars to watch games. The league rushed to react to trends, rather than responding with a bigger strategy in mind. \n\nGroups didn't collaborate. They released apps with bugs - videos took long to load, for instance - or without organization. In one of its apps, a team's schedule sat in several places. \n\n\"It's easy to build and think we're the NFL and we're big, therefore it will work,\" Miller said. \n\nHe sought to replace complacency with urgency: A fan could drift toward a new sport any moment. The NFL wanted to ensure that football was the first thing people searched for when they opened their phone, launched Google or turned on the TV. \n\nWithin a week, Miller gave social media managers new latitude to chat with fans instead of just inundating them with content. Posts came with more sass, and they sought more feedback on hot topics. Clicks from social media to NFL.com rose. \n\nIn the following months, NFL Media struck major video-related deals for the first time with Facebook Inc., YouTube, Snapchat and Yahoo Inc., relenting on what had been rigid control over video rights. This month, NFL expanded a deal to post more content on Twitter. \n\nMiller also went straight to fans, commissioning innovation consulting firm Ideo to ask people what they wanted from the NFL. \n\n\"If you aren't waking up every morning making sure that the experience on NFL applications is the best we can imagine, we're not in the long term going to do right by the business,\" Miller said. \n\nThe top request: Seeing short, national football news tidbits before stuff about their favorite teams. The news blurbs had to make them \"pub smart,\" or able to hold their own at the water cooler. They also wanted to watch games live on the go, and this season, all prime-time and some afternoon games will be accessible for free on Verizon Wireless phones. \n\nReshaping a 95-year-old league is a team effort. So Miller hired executives who could build on the feedback. \n\nTodd Berman, the new vice president of technology, brought from Silicon Valley an app development process in which improvements reach fans' screens sooner. He's also open-sourcing, or making freely available, some of the programming for others in tech to use. Longer, secretive development cycles are common at old-line businesses, but not at today's hot companies. \n\n\"Fans spend all day on Facebook and Twitter and if they come to the NFL and it looks, feels and acts different, it's not compelling,\" Berman said. \n\nMiller then tasked David Jurenka, a former Microsoft Xbox executive, with getting workers \"to think NFL digital media instead of their individual product.\" \n\nA third new vice president, Linda Tong, is using her background in tech start-ups and venture capital to design online features. Last month, Miller added Dan Hogan, vice president of engineering in media services, to sift through decades of video, articles and game data to find new uses for them. \n\nIn response to the survey responses, the new NFL Mobile app opens to a scoreboard on game days. It features stats and key facts before games, access to video highlights during them and video summaries after. On other days, users see news first. New graphics brighten the look. \n\nThe NFL also merged subscriptions services into a new package called GamePass. It includes highlight videos and shows the league had once charged for in the now-scuttled NFL Now app. U.S. subscribers also get live video of preseason games, live radio of regular season games and \"game rewind\" clips. The offering could serve as a test case for consumer tolerance to pay for live online streams of every game someday. \n\nRusso, the sports-media expert, said turning kids into lifelong fans rests on stronger online options. \n\n\"While not driving the bulk of revenue today,\" he said, \"digital is driving the fandom, the excitement and the TV viewership.\"", "source": "Rock Hill Herald"}