{"published": "2015-09-01T16:30:14Z", "media-type": "News", "title": "Rocket Fuel's Board Rejects Unsolicited, Conditional Proposal", "id": "16a45569-d0ce-4d10-b6ab-c8bb6aebf218", "content": "Rocket Fuel (NASDAQ: FUEL), a leading programmatic marketing platform provider that uses artificial intelligence (AI) at Big Data scale to optimize marketing ROI for global agencies and enterprise marketers, today confirmed that it has received and rejected an unsolicited, conditional proposal from Gravity4 to acquire Rocket Fuel. \n\nConsistent with its fiduciary duties, the Rocket Fuel Board of Directors, in consultation with its independent advisors, has evaluated the proposal and concluded that the proposal, which is highly conditional and inconsistent with customary public company transactions, is not credible. In May . Rocket Fuel sent the following response letter to Gravity4 today: \n\nDear Mr. Chahal, \n\nWe are in receipt of your letter dated August 30, 2015 regarding your unsolicited proposal to acquire Rocket Fuel (\"August 30th Proposal\"). The August 30th Proposal is identical, except for the date and proposed \"purchase price\", to Gravity4's May 7, 2015 proposal to Rocket Fuel. Our Board of Directors evaluated the May 7, 2015 proposal with its independent advisors and concluded at that time that the highly conditional and non-customary nature of the proposal did not constitute a credible offer. Rocket Fuel's Board of Directors has reviewed your August 30th Proposal in consultation with its independent advisors, and concluded that the highly conditional and non-customary nature of the August 30th Proposal does not constitute a credible offer. Sincerely, \n\nMonte Zweben \n\nInterim Chief Executive Officer \n\nAbout Rocket Fuel \n\nRocket Fuel combines the science of Artificial Intelligence with the scale of Big Data to improve the effectiveness of programmatic marketing. Customers trust Rocket Fuel's Marketing That Learns™ technology to achieve brand and direct-response objectives in diverse industries across North America, Latin America, Europe, and APAC. Rocket Fuel offers a complete programmatic marketing platform for the world's most innovative, always-on marketers. The platform includes data management, programmatic media-buying, site optimization, and predictive analytics capabilities that extend across a marketer's paid and owned channels, and personalize every customer interaction. Rocket Fuel operates in more than 20 offices worldwide and trades on the NASDAQ Global Select Market under the ticker symbol \"FUEL.\" \n\nView source version on businesswire.com: \n\nInvestor Relations Contact:\n\nThe Blueshirt Group\n\nWhitney Kukulka, 415-489-2187\n\nir@rocketfuel.com\n\nor\n\nMedia Contact:\n\nErica Jacobs, 650-481-6178pr@rocketfuel.com", "source": "Benzinga.com"}