{"published": "2015-09-14T13:39:46Z", "media-type": "News", "title": "The Latest: Egypt PM visits Mexicans wounded by army", "id": "9bfe7335-2765-449b-ae8c-1e0784178815", "content": "The latest developments after Egyptian troops mistakenly opened fire on a group of Mexican tourists on a safari in the country's western desert. All times local: \n\r \n___ \n\r \n2:30 p.m. \n\r \nIbrahim Mehleb, Egypt's acting prime minister has visited several Mexican citizens injured by Egyptian security forces in Egypt's western desert. Mehleb, whose government resigned last week but who remains in his post until a successor can be chosen, visited the wounded in Dar el-Fouad Hospital in suburban Cairo on Monday. \n\r \n\"We are standing next to the Mexican people in their tragedy. The circumstances surrounding the incident are part of Egypt's fight against terrorism. The Mexican side is receiving the best care and we will take care of the Egyptian victims,\" Mehleb said after his visit. \"This is a painful incident and I give my deepest condolences to the Egyptian people and our guest the Mexicans, and I have spoken to the Mexican ambassador and relayed my condolences.\" \n\r \n___ \n\r \n1:00 p.m. \n\r \nEgyptian Foreign Ministry spokesman Ahmed Abu Zaid says acting Foreign Minister Sameh Shoukry spoke by telephone Monday morning with his Mexican counterpart Claudia Ruiz Massieu and explained to her the circumstances that surrounded the incident, saying the tourists were in a restricted area and the army and police were chasing militants who were in SUVs similar to those used by the tourists. Shoukry assured Massieu that the Interior Ministry is investigating the incident and that the Egyptian government will extend all possible assistance, including medical treatment for the injured and transporting the bodies of the dead back to their home country. \n\r \n___ \n\r \n9:15 a.m. \n\r \nMexican President Enrique Pena Nieto is condemning the deaths of Mexican tourists after Egyptian troops mistakenly opened fire on a desert safari convoy. \n\r \nIn a statement on his Twitter feed Monday morning, Nieto says his government \"condemns these acts against our citizens\" and demands a thorough investigation. \n\r \nThe attack killed at least 12 people and injured 10. The victims are Mexican and Egyptian. \n\r \nEgyptian authorities say the four-car convoy had entered a restricted area of the desert without permission and without informing authorities.", "source": "KELOLAND TV"}