{"published": "2015-09-29T20:16:16Z", "media-type": "News", "title": "Tractors, cattle on Ottawa streets as farmers express trade talk fears", "id": "6e45d64d-5fa4-4e6c-963a-ba77af65d67c", "content": "Dairy farmers parked tractors at the foot of Parliament Hill, walked cows through downtown Ottawa and dumped milk on the pavement Tuesday to protest what they say is a looming trade deal that threatens their way of life. \n \nFarmers in Ontario and Quebec fear that the Trans-Pacific Partnership, a massive 12-country trade deal that's said to be near an agreement in principle, could spell the end of the supply management system that keeps their operations profitable. \n \nDozens of tractors clogged Wellington Street in front of the Parliament Buildings, snarling traffic, while some farmers led cows down the street and others splashed milk on the pavement. \n \nRobbie Beck, a dairy farmer in Shawville, Que., brought his dairy cow Lea to the protest in Ottawa. \n \nBeck said he believes the Conservative government's approach to supply management could ultimately cost them votes in key rural ridings -- particularly in eastern Ontario and Quebec -- when voters head to the polls Oct. 19. \n \n\"I'm a small-c conservative thinker, that's probably the natural home for my vote,\" Beck said. \n \n\"I'm with the Harper government on nearly everything except trade.\" \n \nNegotiations are currently underway on the ambitious trade deal involving Canada and 11 other countries. Sources say an agreement in principle could be announced as early as Friday. \n \nFarmers fear the federal government will make concessions on supply management, a system of production limits and import tariffs that shields the dairy market from competition at the hands of foreign producers. \n \nThe U.S. has been pushing for Canada to loosen its system, but the federal government says the government will protect Canadian interests at the negotiating table. \n \n\"This government remains absolutely committed to making sure we preserve our system of supply management through trade negotiations,\" Conservative Leader Stephen Harper said Tuesday. \n \nOpposition parties remain concerned about how the system could be affected in TPP talks. \n \nThe NDP's Mathieu Ravignat, who is running for re-election in the Quebec riding of Pontiac, said supply management allows for many small farms to exist in Quebec and across Canada. \n \n\"We have to be shoulder-to-shoulder with our farmers, support their livelihood,\" said Ravignat, who was on hand at Tuesday's protest. \n \n\"That's why I'm here today.\"", "source": "Stratford Beacon Herald"}