{"published": "2015-09-14T13:52:02Z", "media-type": "News", "title": "Air New Zealand \"Pleased to Seat You\" Tour Showcases New 777-200 Products for North American Travelers", "id": "f72a61d7-cfdf-47bf-bfd8-b49942d9ebce", "content": "SOURCE Air New Zealand\n\nLOS ANGELES \n\nTraveling more than 7,000 miles, the Air New Zealand \"Pleased to Seat You\" Tour will be on the road Monday, September 14 \n\nFans who stop by one of the above \"Pleased to Seat You\" Tour locations during the designated date and time, and have their photo taken in the seats by an Air New Zealand brand ambassador, have a chance to win two roundtrip tickets to New Zealand \n\nFor more information on the Air New Zealand \"Pleased to Seat You\" Tour and Sweepstakes, please visit www.airnz.com/seat-tour.\n\nThe refurbished Boeing 777-200 will operate Air New Zealand's Vancouver Vancouver Houston\n\nFor more information on Air New Zealand's award-winning products and routes, please visit www.airnewzealand.com.\n\n*Special terms and conditions apply. Please visit www.airnz.com/seat-tour for official rules, terms and conditions. \n\nIssued by Air New Zealand. For more information contact: \n\nCharli Sharp, MWW Group, +1-213-402-1435\n\nAbout Air New Zealand\n\nAir New Zealand \n\nAir New Zealand is proud to be a member of Star Alliance. The Star Alliance network was established in 1997 as the first truly global airline alliance to offer worldwide reach, recognition and seamless service to the international traveller. Its acceptance by the market has been recognized by numerous awards, including the Air Transport World Market Leadership Award and Best Airline Alliance by both Business Traveller Magazine and Skytrax. The member airlines are: Adria Airways, Aegean Airlines, Air Canada, Air China, Air India, Air New Zealand, ANA, Asiana Airlines, Austrian, Avianca, Avianca in Brazil \n\nFor more information about Air New Zealand visit www.airnewzealand.com and for more information about Star Alliance visit www.staralliance.com and/or follow Star Alliance on Facebook, Twitter, Youtube, LinkedIn or Instagram.\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/air-new-zealand-pleased-to-seat-you-tour-showcases-new-777-200-products-for-north-american-travelers-300141881.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WDAM-TV"}