{"published": "2015-09-27T16:31:25Z", "media-type": "News", "title": "Georgia Man Files Class Action Lawsuit Amid Volkswagen Emissions Scandal", "id": "4c47b955-28d0-40a6-a695-f6ddb56813d3", "content": "(September 27, 2015) BIRMINGHAM, Ala. (PRWEB) September 27, 2015 \n\nLast week Aaron Peacock filed a class action lawsuit (1:15-cv-03349-MHC, US District Court, Northern District of Georgia, Atlanta Division) against Volkswagen of America amid allegations from the EPA that the company programmed engine management software in some diesel cars to turn on emission controls only when being tested. Once those cars were put on the road, they would emit up to 40 times more emissions, the Environmental Protection Agency said. According to court documents, Peacock intentionally sought out this vehicle in a conscious effort to reduce my consumption and environmental impact and VW explicitly marketed to people with similar goals.\"\n\nThe class action lawsuit accuses Volkswagen of fraudulent concealment, deceptive trade practices, false advertising, breach of contract and warranties, and violating consumer rights laws. According to a September 18th report from the EPA, Volkswagen installed its defeat device in at least the following diesel models of its vehicles: \n\nVW Jetta, 2009 2015 \n\nVW Jetta SportWagen, 2009 2014 \n\nVW Beetle, 2009 2015 \n\nVW Golf, 2009 2015 \n\nVW Golf SportWagen, 2015 \n\nVW Passat, 2012 2015 \n\nAudi A3, 2009 2015 \n\nThe defeat devices Volkswagen allegedly designed and installed work by switching on the full emissions control systems in Volkswagen diesel cars only when the car is undergoing periodic emissions testing. The technology needed to control emissions from Volkswagen diesel cars reduces their performance, and limits acceleration, torque, and fuel efficiency. To hide this, the defeat device simply shuts off most of the emissions control systems in the car once the car has completed its emissions test. This resulted in VW cars sending up to 40 times as much pollution into the environment as is allowed under the Clean Air Act and state regulations. \n\nMr. Peacock is represented by Lew Garrison at Heninger Garrison Davis. Garrison's firm, which includes many lawyers working on the VW emission lawsuit is representing these clients on an individual basis in all states for its lawsuits. Heninger Garrison Davis would like to help VW diesel and Audi A3 diesel owners. The law firm recently launched http://www.vwemissionslawyer.com to provide information and a new way to contact our VW emissions lawyers. The website contain statistics about the price premium paid by VW TDI diesel owners and other important information. Please visit http://www.vwemissionslawyer.com/ or call 1-800-222-9128 for an immediate free consultation.\n\nAbout Heninger Garrison Davis LLC Heninger Garrison Davis, LLC is a national firm of trial lawyers with offices in Atlanta, Birmingham, Los Angeles, New Jersey, New York, and D.C. Metro.While continuously recognized as one of the nations leading trial firms, our firm represents clients in some of the most significant legal controversies playing out in courtrooms across the country. Our attorneys are recognized as some of the most qualified and skilled in their fields. They are routinely appointed by federal and state courts to serve as leaders in national litigation. Heninger Garrison Davis possesses the sophisticated legal skills, financial resources, and administrative support to take on the worlds most powerful corporations.\n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12986825.htm.\n\nFB.init(\"4112331804fd1df554354de5f28d86f9\", \"/xd_receiver.htm\");", "source": "Review Seeker"}