{"published": "2015-09-08T21:00:00Z", "media-type": "News", "title": "The South Coast Brekkie Wrap : Wednesday, September 9, 2015", "id": "a00f1089-fa41-4fca-b310-997551dda41e", "content": "Welcome to our regional morning report, the South Coast Brekkie Wrap! Over the next two hours we will bring you information from across the NSW South Coast and nationally. \n\nIt's good news all-round on South Coast roads and the rail line. No interruptions or accidents at this stage.\n\n► BLACK HILL, VICTORIA: An RMIT student pilot has been killed after crashing on a solo training flight just west of Gordon.\n\n► BIRDSVILLE, QUEENSLAND: A police officer who patrols three states and territories has worked his last “Schoolies for over 40s”: when he retires. ► MAITLAND, NEW SOUTH WALES: Beaten with a hammer and covered in blood, a woman screamed “help me” outside her central Maitland home on Tuesday afternoon. \n\n► TASMANIA: Police have confirmed that a body recovered from the South Esk River on Friday afternoon is that of missing Launceston man Ben Plowright.\n\n► JERVIS BAY, NEW SOUTH WALES: With just 15 minutes of fuel left, a rescue helicopter crew using night vision goggles managed to locate three missing paddleboaders on Tuesday night.\n\n► CANBERRA: A plebiscite or referendum on same-sex marriage would cost taxpayers nearly , according to an estimate by the Australian Electoral Commission.\n\n► NEW SOUTH WALES: A surfer who was bitten on the hand by a shark on Tuesday morning is , lifeguards say. ► SYDNEY: Xavier smiled as he held his home-made sign among a 14,000-strong crowd in Sydney's Hyde Park on Monday night. \"There's room in my house\" could have been the unofficial held in cities across Australia.\n\n►SYRIA: The US and Australia's policy of fighting the Islamic State terror group without having a plan to dislodge Syrian dictator Bashar al-Assad is \"madness\", a former during a visit to Australia.\n\n►THAILAND: Video clips and photographs captured a mysterious fireballstreaking to Earth above Bangkok, quickly lighting up social media.\n\n►ZIMBABWE: A startled bull elephant sent tourists running for cover when it at a Zimbabwe safari park.\n\nBALLARAT'S littlest crossing supervisor has never had a sick day and is arguably the state’s most beloved lollipop man. \n\nSuper pooch Shylo can be seen waiting obediently by the Pleasant Street Primary School gate, unmissable in his fluro supervisor uniform.\n\nCrossing lady and Shylo’s partner-in-crime, . Ms McLean has helped kids from Pleasant Street Primary School cross safely for 10 years. The story first appeared on South Coast Register.", "source": "Kiama Independent"}