{"published": "2015-09-01T21:43:37Z", "media-type": "News", "title": "Wrestling legend charged with murder", "id": "9f14a213-28cf-4ccc-a46c-6331641feff1", "content": "Source: Supplied WRESTLING legend Jimmy “Superfly” Snuka has been charged with murdering his girlfriend in the 1980s. Snuka, now aged 72, will face charges of third-degree murder and involuntary manslaughter for the death of Nancy Argentino in May 1983. The 23-year-old died after an assault at a motel. The charges were announced at a media conference overnight.\n\nSnuka was arrested Tuesday morning at his New Jersey home and appeared briefly in court before being sent to Lehigh County Jail under $100,000 bail.\n\nWhen Ms Argentino died, Snuka was one of the World Wrestling Federation’s (WWF) biggest stars and was known for his signature move the “Superfly Splash”, where he leapt off the ring’s top rope onto his opponent.\n\nThe investigation into Ms Argentino’s death was reopened by prosecutors last year after a previously unreleased autopsy report indicated the case was a homicide, The Morning Call reported.\n\nAccording to records, Snuka returned to his Pennsylvania motel room after a WWF show on May 10, 1983 to find Ms Argentino struggling to breathe and with fluid coming from her mouth and nose. She died the next day, the New York Post reports.\n\nA post-mortem revealed she had a head injury and was covered in cuts and bruises to her head. She may also have been struck with an object. Source: Supplied Source:  \n\nWhen he was first interviewed, Snuka said the couple had argued and he pushed her, causing her to fall. Later, he insisted she slipped and fell, and the people he’d first spoken to misunderstood him.\n\nFrom then on he denied any wrongdoing and wrote in his 2012 autobiography that “terrible things have been written about me hurting Nancy”, but said they weren’t true.\n\nHer family pursued him through court and won $500,000 in damages in a wrongful death case, but the celebrity wrestler said he couldn’t afford to pay.\n\nIn a statement, WWE said: “WWE expresses its continued sympathy to the Argentino family for their loss. Ultimately this legal matter will be decided by our judicial system.”", "source": "NEWS.com.au"}