{"published": "2015-09-24T18:38:29Z", "media-type": "News", "title": "Border Patrol agent indicted in fatal 2012 shooting of teenager along Arizona-Mexico border", "id": "dd271178-bcf2-4c7c-ae4c-90abba1bdb1a", "content": ", EDT. FILE - In this July 29, 2014, file photo, Araceli Rodriguez handles a rosary during a news conference in Nogales, Mexico, that belonged to her son Jose Antonio Elena Rodriguez, pictured behind her, who was shot and killed by U.S. Border Patrol agent in October 2012. Federal authorities have charged a U.S. Border Patrol agent who killed a Mexican teenager in a cross-border shooting with second-degree murder. Luis Parra, the attorney for the mother of Jose Antonio Elena Rodriguez, told The Associated Press that a federal grand jury on Wednesday, Sept. 23, 2015, indicted agent Lonnie Swartz. (Kelly Presnell/Arizona Daily Star via AP,File) ALL LOCAL TELEVISION OUT; PAC-12 OUT; MANDATORY CREDIT; GREEN VALLEY NEWS OUT; MANDATORY CREDIT\" \n  \nTUCSON, Ariz. - A Border Patrol agent has been charged with second-degree murder in the death of a Mexican teenager who was shot from the U.S. side of the border in 2012. \n\nLonnie Swartz was indicted Wednesday by a federal grand jury that reviewed the death of 16-year-old Jose Antonio Elena Rodriguez, who was shot about 10 times. \n\nThe Border Patrol has said that Elena Rodriguez was among a group of rock throwers endangering agents' lives. His family insists the boy was walking home from a basketball game with friends and was not armed or hurling rocks. \n\nLuis Parra, the attorney for the boy's mother, said the family was grateful to the Department of Justice \"for this first step in the pursuit of justice,\" and they \"remain steadfast in their resolve to seek full transparency\" from the Border Patrol. \n\nSwartz's attorney, Sean Chapman, did not respond to a call seeking comment. He told The Arizona Daily Star that he expects his client to plead not guilty at an Oct. 9 arraignment. The U.S. Attorney's Office did not respond to a request for comment. \n\nSwartz also faces a federal civil rights lawsuit in the death of the teen, who was in Nogales, Sonora, on Oct. 10, 2012, when Swartz fired from Nogales, Arizona. \n\nThe case happened amid criticism that the Border Patrol uses force indiscriminately, a charge the agency has denied. Border Patrol agents are generally allowed to use lethal force against rock throwers because rocks can be deadly. Rock throwers have attacked agents more than 1,700 times since 2010, according to the agency. \n\nChapman tried to get the family's lawsuit thrown out on the grounds that the Constitution does not apply to the boy, a Mexican citizen, because he was in Mexico at the time of the shooting. \n\nA federal judge in July ruled that the lawsuit can go forward. \n\nIn a similar case in Texas, a federal appeals court ruled that a teen killed in Mexico by a border agent in El Paso, Texas, was not protected by the Constitution. \n\nBorder Patrol agent Jesus Mesa Jr. shot 15-year-old Sergio Adrian Hernandez Guereca in 2010 near a bridge between El Paso and Ciudad Juarez, Chihuahua. \n\nAuthorities said Mesa was trying to arrest immigrants who had illegally crossed into the country when rock throwers attacked him. Mesa fired his weapon across the Rio Grande, striking the teen twice. \n\nA three-judge panel of the 5th U.S. Circuit Court of Appeals originally said Hernandez Guereca's family could sue Mesa. But the full court overturned that ruling in April. \n \nContent Provided By Canadian Press.", "source": "1057 EZRrock"}