{"published": "2015-09-17T16:14:34Z", "media-type": "News", "title": "Jenson Button remains hopeful future will be resolved soon", "id": "9efb88ce-46a6-48d5-8539-053871968b63", "content": "Jenson Button is confident his Formula One future will be resolved by the end of the month. \n \r\n\t\t\r \nSpeaking after the Italian Grand Prix a fortnight ago, Button was hopeful an announcement would be made ahead of this week's iconic night race in Singapore. \n\r  Jenson Button is hoping to have his future resolved soon \r \r \nButton signed a two-year contract with McLaren in December, but the British team have an option on whether to retain him for 2016 - a clause which is said to expire at the end of September. \n\r\n\t\t\t\r \nYoung McLaren charges Kevin Magnussen, not here in Singapore this weekend after falling off his bike and breaking his hand, and Stoffel Vandoorne, the runaway GP2 series leader, are waiting in the wings. \n\r\n\r\n\r\n\r \nBut Button appears to be growing ever-optimistic that he will extend his evergreen grand prix career into a 17th campaign. \n\n\"I said the next couple of weeks at the last race and I was wrong,\" Button said when asked about a time frame for an announcement. \"So, I think the next couple of weeks - by the end of the month definitely. \n\n\"It is not frustrating at all but there is a lot that you have got to think about over that period of time. It is an important couple of weeks but I am in a good place.\" \n\nLast year, Button's future was dragged out until the end of the season with McLaren not announcing their driver line-up until December. \n\r\n\t\t\t\r \nBut the 2009 world champion, who has ruled out a move to the newly-formed American outfit Haas, is confident a repeat scenario will be avoided this term. \n\n\"It is a massive difference to last year and I think everyone has learnt from that being a bit of a mess,\" Button added. \n\n\"I am very happy with what I have done this year and I think the team are as well. It is not what you may think.\" \n\nButton has endured a testing season with McLaren as the British team's renewed relationship with Honda has failed to take off. But the 35-year-old is optimistic that their partnership with Honda will deliver the goods in the long term. \n\r\n\t\t\t\r \n\"If I am in F1 it will be with this team,\" he added. \"I have had some tough times with this team but I have a lot of respect for them and for Honda. \n\n\"I think this team is for the future and I do not think there is any point looking at a smaller start-up programme. This team is very young still in terms of our relationship with Honda. This will improve a lot over the years, it just depends on how long.\" \n\n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Spalding Guardian"}