{"published": "2015-09-17T04:53:11Z", "media-type": "News", "title": "Modi's Canada visit in April cost taxpayers dearly: Report", "id": "253bd489-6739-44cf-a6d2-149b39908fc6", "content": "Prime Minister Narendra Modis three-day visit to Canada this year cost taxpayers more than 373,000 Canadian dollars ($283,100), a media report said. \n\nThe information on the expenditure on his visit includes 17,600 Canadian dollars ($13,340) on beverages such as alcohol, 80,000 Canadian dollars ($60,600) on receptions, and 106,400 Canadian dollars ($80,600) on motorcade cost, said. \n\nThe Huffington Post Canada on Wednesday, citing Canadas Access to Information Acts report. \n\nThe other expenditures include $10,448 Canadian dollars ($80,600) on hotel rooms, 30,000 Canadian dollars ($22,750) on audio-visual equipment, 21,708 Canadian dollars ($16,455) on unspecified consultants. \n\n\"About 73,213 Canadian dollars ($55,519) on public servants travel, 14,790 Canadian dollars ($11,215) on health services were spent during Modis visit,\" the report added. \nNearly 3,650,00 Canadian dollars ($277,285) on flowers and wreaths, 1,584 Canadian dollars ($1,200) on gifts, 5,981 Canadian dollars ($4,535) on interpreters and translation and 75 Canadian dollars ($56) for a flag were spent during the events he participated in. \nThe bill did not include security costs. \n\nAccording to the report, the largest expense during Modis visit was an event in Toronto and the cost was not borne by taxpayers but by private citizens and businesses. \n\n\"The event at the Ricoh Coliseum arena, in which Modi and Canadian Prime Minister Stephen Harper addressed over 10,000 Indo-Canadians, cost 600,000 Canadian dollars ($454,997),\" president of National Alliance of Indo-Canadians Azad Kumar Kaushik was quoted as saying. \n\nThe event also became controversial as it proved to be a shot in the arm for Progressive Conservative Party (PCP) MP Patrick Brown, who was campaigning for leadership of Ontario province. \n\n\"We did not look at it from (an electoral) perspective. Our goal was to create bonding between India and Canada,\" Kaushik noted. \n\nMeanwhile, Gilles Bisson, leader of New Democratic Party of Ontario, has demanded that Brown -- who is now leader of the PCP, should pay taxpayers back for some of the cost of Modi visit. \n\n\"You cannot have somebody do a political activity and then have it paid by the state,\" Bisson pointed out.", "source": "Deccan Herald"}