{"published": "2015-09-02T03:48:45Z", "media-type": "News", "title": "Subway or 7-Eleven? Bill Shorten's awkward slip of the tongue", "id": "1623a87b-9235-4730-aac3-484250aad8dd", "content": "Interactive: explore the 7-Eleven investigation Opposition Leader Bill Shorten has apologised after confusing a fast food operator with 7-Eleven, the convenience store chain rocked by allegations of exploitation and a wage fraud cover-up.\n\nIs it lunchtime yet? Might grab a sub \n\nIn a slip of the tongue, Mr Shorten said Australians had been \"appalled and disgusted by the scenes at Subway\" while speaking at a media engagement in Sydney on Wednesday.\n\nMr Shorten had wanted to use the exploitation of workers on visas by 7-Eleven to highlight Labor's concerns about aspects of the China free trade deal but instead named the sandwich chain.\n\n\"We've all been appalled and disgusted by the scenes at Subway where literally thousands of people on visas are being ripped off,\" he said.\n\nThe blunder was quickly picked up by commentators and Mr Shorten posted an apology on Twitter.\n\n\"Apologies to @SubwayAustralia, I meant to say @7ElevenAus. Is it lunchtime yet? Might grab a sub.\"\n\nA joint Fairfax Media and Four Corners investigation revealed massive underpayment of 7-Eleven workers, many of whom are students on visas earning as little as $10 an hour.\n\nLabor has been under pressure to agree to a free trade deal the government has struck with China but is holding out because of concerns about foreign workers being brought in on projects worth more than $150 million without having to conduct labour market testing.\n\nPrime Minister Tony Abbott has said this will not be the case and former prime minister Bob Hawke, former foreign minister Bob Carr and former Labor leader and minister Simon Crean have urged the Opposition to support the deal. \n\n\"We want to ensure that we don't see people coming here on visas being exploited and undercutting Australian jobs,\" Mr Shorten said on Wednesday.\n\nIn a separate statement, Mr Shorten corrected his earlier mistake and said the government should be doing more for 7-Eleven workers.\n\n\"What's been reported to be happening at 7-Eleven stores is just appalling,\" he said.\n\n\"If workers are being ripped off like this the authorities should be urgently investigating.\n\n\"Why is the government so quick to pile in on its political opponents but missing in action when workers are being exploited.\n\n\"If this brings more attention to the plight of these workers, then I welcome that.\"\n\nFollow us on Twitter", "source": "Melbourne Age"}