{"published": "2015-09-10T13:02:04Z", "media-type": "Blog", "title": "Cheryl Dunn: New York Soul", "id": "6383793f-7f2e-44d0-a484-061dd965061a", "content": "Cheryl Dunn: New York Soul\rCheryl Dunn was born in Old Tappan, NJ, and currently resides in New York City. She received her BA in Art History from Rutgers University. Cheryl has had numerous group and solo exhibitions around the world, and has had several books published, including “She Swallowed It,” “Sometimes the Answer,” and “Some Kinda Vacation.” Below she speaks to Alex Coghe about her photographic efforts and her film “Everybody Street,” which documents the lives and works of New York’s iconic street photographers and the city that inspires them. Q: How and when did you get started with photography? A: I have been shooting pictures since I was a teenager. In my early 20’s, I went to Europe and lived for 2 years. I did not speak the language of the countries I was living in, so sometimes I wouldn’t speak for weeks. I walked the streets, took pictures, and looked at art most of the time. My observational skills became quite keen because that is all I had really. I would make up stories about people, and what was happening in a scene, and I guess this is when I really started to do street photography. When I returned home, I became a photo assistant and did personal documentary projects. Photography was the only thing that fully engaged me in every way. Q: You are a great street photographer, but you do commercial work too. I love both souls of your work, and I consider your work with models to be very inspiring. Do you feel there is a way to integrate your documentary vision into your commercial work? I am particularly interested to learn about your experience as a street photographer as you made stunning works on assignment for your clients. A: I embrace the challenges of assignments. I like to shoot assignments and fashion on the streets because of the uncontrollable variables. A fashion shoot on the street is not necessarily documentary in nature but when you go to the streets to do something, you are in a sea of other people and anything can and does happen, particularly when you are shooting models; it’s really fun and funny. At this point of my career, I get hired to do what I do for the most part, which is awesome. So I get to put the documentary, discovery, and the unpredictability of street photography into my work most of the time. As a street photographer, you really have to react fast, predict behavior, chase light, or wait for action to happen. All of these skills are very helpful while doing assignments. On the street, maybe you don’t have a time limit to make the shot, but you certainly do on assignment. Being able to see the best situation quickly and solve problems fast comes from all of these shooting experiences. You just get better at it. Q: Apart from still photography, you are also a filmmaker. How did you get started making films? A: I started making films in the mid ’90s. I always seemed to be shooting film of artists and sub-cultures, and I also documented a lot of graffiti writers. I thought it was super important to document artists and their processes, because things change so fast, so that is why I started making films about individual creatives and collaborations between artists. Q: Your 2013 documentary “Everybody Street” is considered one of the best films ever dedicated to photography, and you received a lot of awards for it. When did you get the idea to make this film? A: I was asked by a museum in lower Manhattan to come up with a film idea that could play within an Alfred Stieglitz exhibition, so I pitched the idea to make a film about photographers who went to the streets of NY, and created a substantial body of work inspired by that practice. Selfishly, I wanted to meet my idols (and I did) after showing the short at the museum, and then I was invited to show it at the Tate modern. I went back into the project to expand it to feature-length because there was so much more to say. Quoting a review about the movie: “I appreciate the diversity of thought and approach in the street that Dunn’s documentary depicts: this is an invitation to reflect for everyone. There is not homologation, and this is an invitation to reflect for everyone. We can see photographers more focused on portraits, others on the decisive moment. Bruce Gilden is very different by Joel Meyerowitz…” Q: I think the great merit of this movie is how it presents a diversity of approach and aesthetics without simply demonstrating a way to take pictures in the street. Do you agree? Aren’t we all street photographers? A: Yes, I agree. I wanted to show all the different ways people do it. The photographers in my film are all very different, with varied approaches. There are so many great street photographers, but there is more to photography than simply pressing a button. Q: “Everybody Street” presents New York City as the city for excellence in street photography. What are some of the unique characteristics that come with taking street photography here? A: The one thing about NY that makes it interesting for me is the way the light is here. Manhattan is a small island surrounded by water. Skyscrapers of glass and steel, and tons of people in concentration. Light is bouncing everywhere; people are on top of each other with crazy scenes unfolding before your eyes. It’s ripe for street photographers. Q: And do you think the Big Apple still represents the capital of street photography? A: There are many great cities for street photography as populations increase all over the world. But in the last century, NY was the center of the arts, it was in what they called “The New World.” This city was having an industrial revolution and most of all, it is maybe one of the most multicultural cities; there is every type of person walking the streets. And yes, it is a city that everyone walks in. Q: Among all the photographers presented and interviewed in the documentary, do you have a favorite? A: Not really. They are all so different, and I am a fan of each of them. I became good friends with Jill Freedman and Boogie in the making of the film. Q: It’s been two years, is there anything you wish you could change about the project? A: This film took me four years. And what I want to change is having more time to shoot on the streets. Q: Are you preparing another documentary? What will be the theme this time? A: Yes, I am starting on a new film about the New York artist Dash Snow. I think the ’60s and ’70s, but also the ’80s in the Big Apple with photographers like Garry Winogrand and Joel Meyerowitz, and then Bruce Gilden and Bruce Davidson, representing an unrepeatable period for this genre. They choose to go out to take pictures as a genuine need; they never imagined that they would become recognized as the masters today, when street photographers are living in the social network era where everyone thinks of being famous. Q: What is the state of Street Photography today? And what are the main differences from the golden era of street photography? A: There are great street photographers today, but the judge of what is great now are followers on Instagram and likes. And who are those people? Are they the same people that make Instagram accounts about cats and dogs the most popular? So who is really deciding what is great or not now? It is a different time. The golden age of photography included artists that knew every aspect of the medium and did them all –processing film, printing pictures, etc. They all had darkrooms. They were artisans. Most people that are popular on Instagram don’t know anything about that stuff. And does it matter? I don’t know, but that is one of the differences. Q: Is there an artist that you feel shares your attitude and approach to the photographic medium? A: In my film I would say Boogie. (Bruce Davidson) Q: What does street photography mean to you? A: It’s something I need to do. I am always riddled with anxiety because I have a lot of other work to do, and I don’t get to the streets as much as I want to. Q: How did you first become interested in Leica? A: I think probably studying the masters: Cartier-Bresson, Bruce Davidson, Garry Winogrand, and the like. I wanted to be as nimble and quick as I could, and I knew this was my camera. It took me a while to save up for the gear I have. Since Leica really stands the test of time, it’s fine to buy used gear, and I have done that a lot, one piece at a time; if I got a decent job, I would buy a new lens or something. It’s just the best camera for me, such a beautiful machine. The lenses are incredible, and I can handle the weight. I am always shooting them, so they are like an extension of my body at this point. Q: You are using Leica M6, M7, and M9. Do you have you a preference between film and digital photography? When you prefer to use film? When do you go digital? A: I shoot film mostly for my personal work. I’m trying to like digital more. I use it commercially more so, but my film pictures are what I love. Q: Do you have any favorite lens? A: I mostly had a 35 f/1.2. for so long. Then a 90 mm, and a 21 mm. After that, I got the 50 mm f/1.4 Summilux. I love it so much. The last one I got was a 28 mm ASPH. Q: What about Leica today? What are the reasons your cameras are Leica, and not from other brands? A: They are like a beautiful diamond ring: forever the best. Q: If you could test a new Leica camera what would it be, and why? A: I would like to try the Monochrom. I just ran into Boogie in my neighborhood, and he was rocking one. He kept going on about how great it was. And I have heard this from other people as well. I would like to try it. Q: What are some of your challenges? What will be the new goals for Cheryl Dunn? A: A balance of film and photography, and being able to have the time to explore the subjects that inspire me. Thank you for your time, Cheryl! - Leica Internet Team Learn more about Everybody Street here, or visit Cheryl’s website and tumblr to view more of her work. Alex Coghe is an Italian editor and photojournalist currently based in Mexico City whose professional activity ranges from editorial photography to events. Learn more about Alex on his official website and download his book “THE STREET PHOTOGRAPHY GUIDE” here and other publications on iTunes. He is also the publisher of The Street Photographer Notebook, an inspirational monthly edition electronic magazine dedicated to street photography worldwide. Check out the pages on Facebook, tumblr and on Alex’s website. This entry was posted\ron Thursday, September 10th, 2015 at 3:02 pm\tand is filed under Alex Coghe, Interviews, M-System.\rYou can follow any responses to this entry through the RSS 2.0 feed.\rYou can leave a response, or trackback from your own site.", "source": "The Leica Camera"}