{"published": "2015-09-30T04:16:53Z", "media-type": "News", "title": "'Downton' Spoiler Alert! Crew Slip-Up Reveals Plot Details", "id": "7d2f9e54-b5e2-42a3-ada7-b856d45bd694", "content": "‘Downton Abbey’ is in its sixth and final season, and despite best efforts to keep all plot details under wraps, it seems a crew slip-up has led to a huge reveal. \n\nIf you don’t want to find out what’s coming up, then look look away now. You’ve been warned… \n\n\n\nReady? OK… \n\nAccording to reports, a wedding order of service was left behind in an Oxfordshire village hall, and the detailed prop revealed that Lady Edith is set to finally get hitched, marrying a man called Herbert, who is presumed to be Bertie Pelham, from the recent Christmas special. \n\nThe Sun claims that a member of the public found the prop, which was in a village church in Bampton, a village which has frequently been used to film previous episode of the ITV drama. \n\nA source tells the paper: “The cast and crew of ‘Downtown’ have gone to great lengths to hide the storylines for the six and final series. \n\n“As it’s the last one, there are going to be some absolutely massive plot lines. One of them is this wedding. \n\n“It seems a bit ridiculous that all those security measures could be put in place and then someone just leaves an order of service lying around for anyone to find.” \n\nWe’re currently two episodes into the final series of ‘Downton’, and while a number of cast members are understandably devastated to be waving goodbye to the period drama, Elizabeth McGovern isn’t going to be reaching for the tissues. \n\nWhen quizzed on which cast members she’ll miss, the star replied : “I don’t know how much socialising we’ll do in the future.” \n\n“I’ll miss everybody in a different way. But I don’t think there’s one person that I can bring to mind.” Lovely…", "source": "Huffington Post UK"}