{"published": "2015-09-20T07:18:15Z", "media-type": "News", "title": "Expanding companies should assess risk from overseas operations", "id": "3223c733-a542-4390-a1d8-388f3a7f8bca", "content": "Many organizations are seeking to expand their operations overseas as part of their growth strategies. In Bahrain, as well as around the world, globalization has entered a new phase, posing greater challenges for anti-bribery and corruption (ABC) compliance than ever before. Two factors are creating new issues for companies, according to a recent report by KPMG International.\n\nFirst, a growing number of governments around the world are tightening ABC regulations or introducing new ones as we see in Bahrain. In the light of Kingdom’s expanding corporate culture, the government has introduced Law Number 01/2013 to expand the Amiri Decree Number 15/1976, in order to address bribery and corruption across both the public and private sectors. Second, as companies globalize their operations, they rely more heavily on third parties than before to do business in far-flung parts of the world, often in areas where there is a high risk of corruption. said: “the government has worked hard to enforce strict laws on bribery and corruption. However, as the global report highlights, with GCC based organizations and businesses increasingly investing overseas, reliance on and managing risk with third parties can be a challenge and adequate controls and monitoring must be put in place.” \n\nThe survey, conducted by KPMG International with respondents from around the world, shows that companies are rising to the challenge but that a great deal more needs to be done to create a sturdy ABC compliance structure. For full details, read the report . The main findings of the survey include:\n\n“Despite greater efforts to build ABC frameworks, it’s clear that there are gaping holes in them,” says Petrus Marais, Global Leader of Forensic Services for KPMG. “The problem is particularly acute in the management of third parties who increasingly act as conduits for bribes, making it harder to track. Respondents to the survey admit it’s the biggest challenge in the field of ABC, but they are not doing enough to develop a culture of compliance both among their employees and their vendors and other business associates.” \n\nAbout the survey\n\nThe survey targeted 659 respondents covering 64 countries, with 140 respondents based in Central & Eastern Europe (including Russia), 113 in Western European countries (excluding the UK), 105 from the Asia – Pacific region, 66 respondents in the U.S., 64 from the South American continent (31 in Mexico), 61 in South Africa and 41 in the UK. Industries were widely represented: banking comprised 20 percent, life sciences 12 percent, manufacturing 10 percent and energy & natural resources 8 percent. The survey was completed in October 2", "source": "Albawaba"}