{"published": "2015-09-14T19:51:02Z", "media-type": "News", "title": "Enablence Technologies : Announces a Proposed Debt for Equity Conversion", "id": "3d0060a6-8180-4508-8d1c-3bae025015a4", "content": "-  Enablence Technologies Inc. (\"Enablence\" or the \"Company\") (TSX VENTURE:ENA), a leading supplier of optical components and subsystems for access, metro and long-haul markets, today announced a proposed debt for equity conversion of up to $3.0 million in conjunction with the announcement made on August 21, 2015 (the \"Financing\") and for up to an additional $1.0 million with certain insiders of the Company. \n \nSubject to TSX Venture Exchange approval, the Company proposes to convert up to $3.0 million of existing debt arrangements into units at a price of $0.0525 per unit, each unit comprised of one common share and one half warrant. Each full warrant is exercisable for a period of 18 months at an exercise price of $0.07 per warrant. Additionally, the Company proposes to convert up to $1.0 million of existing debt arrangements, with certain insiders of the Company, for shares at a price of $0.0525 per share. Such Insiders will receive no warrants as part of this conversion. \n \nAbout Enablence Technologies Inc. \n \nEnablence is a publicly traded company that designs, manufactures and sells optical components and subsystems to a global customer base. It utilizes its patented technologies, including planar lightwave circuit (\"PLC\") intellectual property, in the production of an array of photonic components and broadband subsystems that deliver a key portion of the infrastructure for current and next-generation telecommunication systems. The Company's product lines address all three segments of optical networks: access - connecting homes and businesses to the network; metro - communication rings within large cities; and long-haul - linking cities and continents. For more information, visit www.enablence.com. \n \nForward-looking Statements \n \nThis press release may contain forward-looking statements regarding potential financing transactions, lending facilities, debt to equity conversion, future sales and orders, funding of ongoing operations based on current expectations, forecasts and assumptions which involve risks and uncertainties associated with our business and the economic environment in which the business operates. All such statements are made pursuant to the 'safe harbour' provisions of, and are intended to be forward-looking statements under, applicable Canadian securities legislation. Any statements contained herein that are statements of historical facts may be deemed to be forward-looking statements. By their nature, forward-looking statements require us to make assumptions and are subject to inherent risks and uncertainties. We caution our readers of this press release not to place undue reliance on our forward looking statements as a number of factors could cause actual results or conditions to differ materially from current expectations. Please refer to the risks set forth in the Company's continuous disclosure documents that can be found on SEDAR www.sedar.com. Enablence does not intend, and disclaims any obligation, except as required by law, to update or revise any forward looking statements whether as a result of new information, future events or otherwise. \n \nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.", "source": "4 Traders"}