{"published": "2015-09-30T14:30:00Z", "media-type": "Blog", "title": "Let's Appreciate Farrah Abraham's Wild, Brilliant, Self-Destructive Run on Big Brother", "id": "f145795e-03be-4cef-b18e-3674b9a57b4a", "content": "Farrah Abraham acquired her celebrity status (such as it is) in the most American way possible: she progressed from Teen Mom reality show to Backdoor Teen Mom unreality sex tape. So her role as the American Bad Guy on the latest season of the U.K.’s Celebrity Big Brother, which she left earlier this month in a flurry of verbal and physical violence, was a natural one for her. Love her or hate her, she played it perfectly.\nhttp://gawker.com/heres-the-firs...\nSince the rise and fall of her two sex tapes, Farrah has taken an entrepreneurial approach to making money off her, uh, name. She’s dipped her toes into stripping and writing erotic novels, and she’s dipped her vagina into selling sex toys molded in its exact shape. Celebrity Fit Club veteran Dustin “Screech” Diamond once testified that playing the bitchy, pure-evil antagonist on a reality show came with extra pay. Did Farrah agree to play the villain on Big Brother for the money? Maybe. Who knows? Would she do it for the money? Judging by her past career choices: 100% yes.\n\nhttp://gawker.com/farrah-abraham...\nBut maybe she also did it for her, because she likes playing the villain and because she’s great at it. Behold, Farrah’s greatest talent: making everyone hate her and reveling in the attention.Day 1: “I’m happy I’m so real, and ... other people are not.” \nThis season of Celebrity Big Brother pits a team of American pseudocelebs against their U.K. counterparts. Within hours of entering the house for the first time, Farrah—wearing a half-stars-and-stripes, half-Union-Jack dress in an act of inspired trolling—identified the weakest link on the U.K. team: Atomic Kitten singer Natasha Hamilton, and proceeded to make an enemy of her. \nAfter Team America lost a challenge, Farrah was the first one selected to go to the tower (basically jail) instead of to a party with the rest of the housemates. For the rest of the night, she seethed in her cell at her new archnemesis, Natasha, for voting to exile her.\nInstant drama. Farrah’s off to a great start, and she hasn’t even (allegedly) assaulted anyone yet.Day 2: “Grow the fuck up!”\nFarrah quickly makes another enemy, eventual winner James King, after accusing him of staring at her every time he walks by. \nNot everything is about Farrah, but she always acts like it is, thereby ensuring her position as the perpetual center of attention. And if normal human conversation doesn’t work—I guess we don’t know whether it does, because Farrah never tries it—there’s always yelling.\nStanding up for herself is Farrah’s strong suit as a reality TV personality. Letting anyone else talk, ever, is not.Day 10: “I’m sorry, I have profanity.” \nBy now, Farrah has formed an alliance with ex-porn-star Jenna Jameson. The two are calling themselves “Jarrah,” and ganging up on other housemates. Around bedtime on day 10, Farrah goes after comedian Bobby Davro for a perceived slight against her new BFF, Jenna. And also for briefly setting down his microphone in an area she wanted to use. \nDavro makes an attempt to be civil, but, you know what? Farrah “has profanity,” and spends like five minutes screaming at a basically polite old man while he tries to go to sleep. \nThis sets the tone for Farrah’s entire time in the house, but it barely scratches the surface of her trolling capabilities. She has several more gears of unhingedness available to her.Day 12: “Because I was going to obliterate the fucking scum that you have in this fucking house?!”\nAfter an argument breaks out over food rations, Farrah goes fully psychotic. She gets into a screaming match with Natasha and is then called to the diary room. Once there, she threatens to “obliterate” and “fucking kill” everyone in the house. Day 16: “This is, like, a rollercoaster of emotion right now. Look at my nails!” \nHaving established herself as the villain, Farrah is a shoo-in to get evicted early, but the drama and entertainment she brings to the house is too valuable for the showrunners to let that happen. So instead, they let the audience vote to send Farrah through a “secret back door” to a hidden luxury spa. Big Brother then reunites her with Jenna, and gives “Jarrah” the ability to spy on the house and cast judgment on all the other D-listers.\nCertainly, any capable performer could create total havoc given this juicy setup. And so will Farrah, despite her limitations as an actress, for she is blessed with the ability to generate a typhoon of chaotic clusterfuckery just by being herself.\nIt’s here, in this relatively calm moment where Farrah is given some good news, that we can see the seams of her reality-show act showing a little bit. She’s at her best when she’s charging up her rage-cannon and firing it indiscriminately at the nearest target.\nBut when she’s forced out of her wheelhouse, the invulnerable, uninterruptable veneer falls apart. And therein we find the essential tragedy of Farrah the villain (and maybe of Farrah the person): She’s much less believable when she has to convince us she can be happy.Day 17: “That could have been fun, but it wasn’t.”\nHere are Farrah and Jenna, in possession of zero total chill between them, bitchily mocking the other housemates’ attempt to put on a lighthearted talent show. Farrah may not be capable of exhibiting shame when it comes to her own behavior, but here she shows she can certainly feel embarrassment on behalf of others. Day 18: “Were you a celebrity? When?” \nIn perhaps the highlight of this entire dumb season of a dumb, dumb show—elevated only by the glorious trainwreck that is Farrah Abraham—Big Brother has tricked Jarrah (of course), and allowed all the other housemates to listen in on their shit-talking in the luxury suite. To make matters worse, all the enemies they nominated for eviction are now immune from same.\nThe other housemates plead with Jenna to detach herself from Farrah, the land mine in high heels, but she foolishly remains loyal. Jarrah 4 lyfe. Day 23: “Love you guys, bye!”\nFarrah is finally evicted, and she flounces out with an “I heart Jarrah!” for Jameson and a sarcastic “Love you guys, bye!” for everyone else. An ideal exit. \nFor Farrah, the show is over, but she still finds time for one final, spectacular meltdown.Bit on the Side: “Hag, be quiet!”\nLetting the drama die after the season ends is certainly not Farrah’s style—just look at her various flirtations with a Teen Mom reunion—and Celebrity Big Brother was no exception. A panel last Tuesday on the Big Brother spinoff chat show Bit on the Side had to be pulled from the air 12 minutes early after Farrah provoked a brawl among cast members that ended with broken glass, at least one injury, and possible criminal charges.\nJust before the show cut its live feed and threw up the Big Brother logo, Farrah was heard saying “hag, be quiet, hag be quiet,” to fashion-designer and Big Brother season six alumna Aisleyne Horgan-Wallace. Aisleyne reached toward her wine glass, and there’s no public video of what happened next.\n“It was absolute chaos. Glasses and then a chair went flying and Vicki ended up injured in the process,” a source told The Sun.\nFarrah released her official statement last week, claiming she was the victim of an attack by not only Horgan-Wallace, but also 60-year-old supermodel Janice Dickinson: \n“I was assaulted twice by Aisleyne Horgan Wallace and Janice Dickinson. “After speaking with the police and my lawyer, I have pressed charges against Aisleyne and am considering issuing a lawsuit against Janice. I can confirm that Aisleyne did assault me and it is now in the hands of the police.”\nThe Mirror reports Farrah and Janice Dickinson have both received police cautions for common assault, implying the two admitted guilt, but the government won’t be pursuing a full prosecution. \nHorgan-Wallace still faces assault charges, though. \n“Enquiries in connection with another assault allegation continue, therefore it would be inappropriate to comment further at this time,” a police spokeswoman told the Mirror.\nActress Vicki Michelle, 64, was reportedly sent to the hospital after being caught in the middle of the fight and hit by a glass, and she told the Mirror, “I’m in complete and utter shock. If I had been looking the other way I could have got it full in the face, [Farrah] could have blinded me. It was awful.”\n“She whacked the glass hard like a discus. It was the base of the glass and it shattered in my hair.”\nMichelle is still deciding whether to press charges. In her version of the story, Aisleyne splashed her glass of Cava “over Farrah and me,” and then Farrah started hurling her own glasses across the set, breaking one on Michelle’s head. Then Janice Dickinson threw a chair at Farrah to “stop her doing anything else.”\nFarrah claimed she just threw a glass at the wall “as a defense mechanism,” and she played up her alleged injuries in the following days by appearing in a wheelchair (and an “On Fleek” tee.)\n\nHere is the arm-bruise she says she incurred during the fight. I can imagine it would be difficult to walk under your own power with that thing. \nBy all accounts, the Bits on the Side fight was a shitshow, and another masterful act of trolling by provocateur extraordinaire. We can only be sad that it didn’t make it to air.\nThere was a final episode of Celebrity Big Brother after the CBBBTS, but I declined to view it because, for some unexplained reason, Farrah wasn’t allowed back on.\n“In regards to the Celebrity Big Brother final, both Farrah and Celebrity Big Brother mutually agreed it would be best for her not to attend,” a spokesperson for Farrah told the Mirror.\nShe now intends to pursue a lawsuit against Dickinson, because once she spots an opportunity for profit or attention, she bites down on it like a bulldog. A young, pseudo-famous, very entrepreneurial bulldog. A bulldog with a line of silicon products in the shape of its genitalia. She’s extremely tenacious, is what I’m saying. \n“At the end of the interview, I told [Farrah] that she’s a hustler,” Rich Juzwiak wrote, after talking to Farrah for Gawker last year, “She agreed.”\nThat’s Farrah, the epitome of a hustler. And her turn as villainess was just another hustle, one that made Celebrity Big Brother better and more ridiculous, and briefly held back the inexorable ticking clock-hands that are currently eating up her 15 minutes.  \nFarrah didn’t technically “win” Celebrity Big Brother, but she claimed victory for herself through ungracious defeat, tantrums, and (allegedly) throwing glass at people. She did more than the job truly required of her. And, when you get right down to it, isn’t that the mark of a real winner?", "source": "Gawker"}