{"published": "2015-09-01T16:34:31Z", "media-type": "News", "title": "New Car Smell Is Even Sweeter with GAP Waivers", "id": "5f2473a8-2098-4d37-a9ad-88283a775c67", "content": "SOURCE Guaranteed Asset Protection Alliance\n\nTALLAHASSEE, Fla. \n\nBlack, white, red, blue ... the choice of color is up to you. But don't be fooled into thinking your shiny new vehicle is invulnerable to unforeseen, costly accidents. The best way to watch your back and ensure protection for your wallet is by purchasing a guaranteed asset protection (GAP) waiver, which helps protect your investment from the moment you receive the keys.\n\n\"Accidents happen unexpectedly and often lead to stress and tremendous debt,\" said Tim Meenan \n\nWhile driving around in your new set of wheels might be the only thing on your mind, it's important to remember that the value of your car depreciates the minute it leaves the lot. From a stolen to completely totaled car, most insurers only cover the cost of the vehicle's current market value, and since your vehicle's value has fallen since you bought it, you'll pay the difference in cost out of pocket.\n\nGAP waivers help cover the difference, and offer other important stress-relieving benefits. In the case of an accident, you might be left paying for a car you no longer have. GAP waivers can alleviate some or all of your loan debt.\n\nWith a GAP waiver, you can simply relax and enjoy your new car – after all, that's why you bought it. Don't waste time worrying about how you'll pay for an unexpected accident, because GAP waivers have you covered.\n\nFor more information about GAP waivers, visit www.gapalliance.org.\n\nAbout GAPA\n\nThe Guaranteed Asset Protection Alliance (GAPA) was formed in 2006 and consists of companies experienced in offering quality guaranteed asset protection products throughout the country. GAPA members include insurance companies, lenders and administrative services companies that, together, bring valuable products to market in a responsible and competitive way. GAPA's mission is to promote fair and equitable regulation of its members and their products, and to continue to offer meaningful options to consumers who choose to purchase this protection.\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/new-car-smell-is-even-sweeter-with-gap-waivers-300136089.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WAFF"}