{"published": "2015-09-15T14:49:15Z", "media-type": "News", "title": "Jeremy Corbyn slams 'poverty denier' David Cameron in blast at 'free market'", "id": "03e0951b-ee08-44e2-97c9-8795223e366b", "content": "Jeremy Corbyn has launched a furious attack on \"poverty denier\" David Cameron as he rejected claims his radical policies were \"dreams\". \n \r\n\t\t\r \nIn a defiant speech to the TUC conference, he insisted the Government's welfare reforms had cost lives and branded proposed restrictions on strikes an attack on civil liberties. \n\r  Labour leader Jeremy Corbyn during a service at St Paul's Cathedral in London to mark the 75th anniversary of the Battle of Britain \r \r \nHe also called for \"solidarity\" with workers around the world, blaming a \"free market philosophy\" for workplace tragedies in China. \n\r\n\t\t\t\r \nThe rallying call came after a tricky start to Mr Corbyn's stewardship of the party following his overwhelming election victory. \n\r\n\r\n\r\n\r \nMany MPs, including frontbenchers, have signalled disquiet over the appointment of hardliner John McDonnell as shadow chancellor. \n\nThere are also complaints that none of the most senior jobs in his top team have gone to women. \n\r  Labour Party leader Jeremy Corbyn arrives for a service at St Paul's Cathedral in London to mark the 75th anniversary of the Battle of Britain \r \r \nThe 20-minute quick-fire address to delegates in Brighton, delivered tieless, was originally intended to include a passage invoking Margaret Thatcher's 1980s phrase to warn that the Conservatives still regard unions as \"the enemy within\". \n\nHowever, Mr Corbyn did not deliver the pre-briefed lines, with Labour officials saying he was working from notes and simply \"forgot\". \n\r\n\t\t\t\r \nMr Corbyn said the TUC conference was a \"shared celebration of our values as a Labour and trade union movement\". \n\n\"Values of solidarity, of compassion, of social justice, of fighting for the under-privileged, and for all working people at home and abroad. Those are the values that have shaped me and my political life,\" he said. \n\r  New Labour party leader Jeremy Corbyn chairs his first shadow cabinet meeting in the House of Commons \r \r \nHe signalled that Labour would now oppose all the Tories welfare changes, including the benefit cap. \n\n\"Labour will oppose the Welfare Bill in full. We oppose the benefit cap. We oppose social cleansing,\" he said. \n\r\n\t\t\t\r \n\"We will bring the welfare bill down by controlling rents and boosting wages, not by impoverishing families and socially cleansing our communities.\" \n\nThe new Labour leader delivered an angry retort to jibes that he is a \"deficit denier\". \n\n\"But then they spend billions cutting taxes for the richest families or for the most profitable businesses,\" he said. \n\n\"What they are is poverty deniers - ignoring the growing queues at food banks, ignoring the growing housing crisis, cutting tax credits when child poverty rose by half a million under the last government to over four million. \n\n\"Let's be clear - austerity is a political choice, not an economic necessity.\" \n\r\n\t\t\t\r \n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Rye and Battle Observer"}