{"published": "2015-09-15T13:48:07Z", "media-type": "News", "title": "Assam ex-minister quits assembly on joining BJP", "id": "eda35706-6540-481e-9796-398a139e7e5e", "content": "Guwahati, Sep 15 (IANS) Former Assam minister Himanta Biswa Sarma, who joined the BJP last month, on Tuesday resigned from his seat in the legislative assembly. \n \n  \n \nSarma, who was elected on a Congress ticket from the prestigious Jalukbari assembly constituency in 2011 by a record margin of around 78,000 votes, submitted his resignation letter during a meeting with Speaker Pranab Gogoi at the latter’s residence here on Tuesday evening. \n \n  \n \n“As you know, when a legislator resigns from his party, the party should recommend to the speaker to disqualify that legislator,” Sarma told media persons outside the speaker’s residence after submitting the resignation letter. \n     \n“I waited for over 15 days (since joining the BJP on August 28) but the Congress remained completely silent about me,” he said. \n \n  \n \n“Hence, in the best democratic traditions, I have gone ahead and tendered my resignation.” \n \n  \n \nSarma, who held the health and education portfolios, quit his ministerial post in July last year after a major fallout with Chief Minister Tarun Gogoi. Sarma was once seen as Gogoi’s blue-eyed boy. \n \n  \n \nIn his interaction with the media on Tuesday, Sarma also thanked the people of his constituency and sought their forgiveness for not having completed his term. \n \n  \n \nHe was elected to the assembly from Jalukbari constituency three consecutive times in 2001, 2006 and 2011. \n \n  \n \nHe said he would make available to the media a copy of the resignation letter he submitted to the speaker and Congress president Sonia Gandhi among others, in which he has listed his charges against the state party leadership. \n \n  \n \n“I hope people of my constituency will elect me again if byelection or election is held in my seat,” he added. \n \n  \n \nSpeculations are rife whether byelection will be held in the now vacant Jalukabari constituency as the 2016 assembly elections are barely six-seven months away. \n \n  \n \nMeanwhile, principal secretary Pranab Das told the media that it was for the Election Commission to take a call on whether to hold a byelection for the Jalukbari seat or hold the election along with the rest of the state next year. \n \nThe post appeared first on The Morung Express .", "source": "Morung Express"}