{"published": "2015-09-22T16:42:03Z", "media-type": "News", "title": "Meet the guy behind the $750 AIDS drug", "id": "9449e639-baf9-48ed-8a9f-e065ad9bf0c6", "content": "Martin Shkreli has been called everything from a boy genius to a vulture. Now he's earned the title \"most-hated man in America.\" \n \nThe 32-year-old CEO of Turing Pharmaceuticals is at the heart of a brewing controversy this week over alleged \"price gouging\" by drug makers. \n\nHillary Clinton called out Turing and other drug makers on Twitter for jacking up prices on old drugs. Shkreli's company raised the price on a drug called Daraprim from $13.50 a pill to $750 overnight. \n\nThe Daily Beast quickly declared Shkreli the \"most-hated man\" in the United States, surpassing the dentist who killed Cecil the Lion. \n\nThe drug is used by some AIDS and cancer patients. It's been around for 62 years, but Shkreli's company bought the rights to it in August. The main use of the drug is to treat life-threatening parasitic infections. \n\nShkreli rants on Twitter \n\nShkreli responded in a way that will only increase his controversial reputation. \n\n\"It seems like the media immediately points a finger at me so I point one back at em, but not the index or pinkie,\" Shkreli wrote on Twitter with a link to the Eminem song \"The way I am.\" \n\nHe also said Twitter \"seems to be a great medium for socialist and liberal rage\" and declared the Daraprim price hike \"a great thing for society.\" \n\nShares of Retrophin, another biotech company Shkreli founded in 2011, have plunged more than 20% since the Clinton tweet about price gouging on Monday. \n\nShkreli was fired as Retrophin's CEO last year for poor management skills, including his outspoken Twitter use. \n\nShkreli learned his investing ABCs on chessboard \n\n\"I love social media and just being myself,\" Shkreli told CNNMoney in an interview in March. \n\nShkreli doesn't disclose his wealth, but sources estimate it at about $50 million so far. He has founded several companies, although he hasn't stayed long in many of his ventures. \n\nHis path to becoming a millionaire began on a chess board in Brooklyn. Shkreli's childhood was spent playing chess with an older man named Marty who lived in his building. In between moves, Marty would educate him about stocks, especially biotechs, back in the 1990s. \n\n\"I kept thinking even as a young kid -- at 10 or 11 years -- I could have a company as big as Eli Lilly or Merck,\" Shkreli says. \n\nThose early discussions led Shkreli to buy shares of Compaq when he was just 12 years old (he still remembers its ticker: CPQ). He followed that by buying Amazon stock shortly after it went public in 1997. \n\n\"As a kid, my friends knew all the Yankees and Mets players batting averages and how many home runs they hit. I knew everything about all the public companies,\" he recalls. \n\nA big donation to high school \n\nThe child of Albanian immigrants, he credits Hunter College High School as key to his success, even though he never graduated from the school. \n\nEarlier this year he donated $1 million to the school-- the largest individual gift in the New York City public school's history. \n\nShkreli went on to get a business degree from Baruch College (part of the City University of New York). \n\n\"For me and many entrepreneurs, it goes back to the high school more than the university,\" he says, calling college a time when he just \"went through the motions.\" \n\nStarted at Jim Cramer's firm at age 16 \n\nShkreli got his start on Wall Street before shifting gears to starting companies. \n\n\"If you look at the Forbes list and focus on that kind of stuff, you tend to find out that most people who have made a real fortune have done it by making a company, not by investing,\" he said. \n\nShkreli spent about a decade working in hedge funds, getting his start as an intern at Jim Cramer's firm at the age of 16. He did stints at UBS and Intrepid Capital Management and ultimately opened two hedge funds of his own. \n\nHe made a name for himself on Wall Street for shorting biotech stocks -- betting that shares would fall after the companies' drugs wouldn't work -- and being very vocal about companies he didn't like on social media. \n\nShkreli was ousted from his other company \n\nShkreli tries to cast himself as someone who wants to make a difference, not just make money. \n\n\"Speculating on stocks is like an incomplete journey in capitalism,\" he says. \n\nOn Twitter this week, he defended his decision to raise the drug price by over 1000% saying \"I guarantee better access at lower prices to patients than ever.\" \n\nHe began to use his mostly self-taught knowledge of drugs to try to develop some of his own. In 2014, Retrophin was granted a patent for a drug that treats PKAN, a relatively rare disorder that causes iron to build up in the brain and slow down or even halt the ability to move. It can be fatal. Shkreli was listed as one of the inventors of the drug. \n\n\"Health care is complicated. I never studied biology or chemistry, but with a little hard work and the Internet, you can get there,\" he said. \n\nRunning a drug company proved a lot harder than shorting stocks for Shkreli and he was ousted from his own company shortly after it went public. Shares of Retrophin doubled in the months after he left. \n\nHis employees get free Uber rides \n\nNow he's back again with Turing Pharmaceuticals. Based in New York's SoHo neighborhood, Turing told CNNMoney it had 35 employees earlier this year. \n\nShkreli said he gives employees free Uber rides and was handing out more stock to employees, since the difference between his wealth being $50 million and $100 million was \"de minimis\" to him. \n\nShkreli had hoped to take Turing public this year, but that now appears to be up in the air.", "source": "KSBW Channel.com"}