{"published": "2015-09-30T11:19:12Z", "media-type": "News", "title": "Things to Do Wednesday, September 30, 2015", "id": "9f0b125c-d3a5-45b7-92a3-0111576ad032", "content": "File/Melissa Haneline/Staff\r\nIf you think you're a 'wine-o' check out the wine related events going on around town today. \r \n Admission Discount \r \n\r\n\t\tWhat: Magnolia Plantation and Gardens and the South Carolina Aquarium are offering families an opportunity to visit both attractions with a $5 discount off the admission price to both attractions through the month of September, meaning today is the final day to take advantage of the discount.\r \n\n\r\n\t\tWhen: 8 a.m.-5:30 p.m. (Magnolia) and 9 a.m.-5 p.m. (Aquarium)\r \n\n\r\n\t\tWhere: Magnolia Plantation and Gardens, 3550 Ashley River Road, Charleston; South Carolina Aquarium, 100 Aquarium Wharf, downtown Charleston\r \n\r \n\r\n\t\tMore Info: Click here. \r \nArts & Crafts Market \r \n\r\n\t\tWhat: The Bay Creek Park will have weekly Arts and Crafts Market on Wednesdays through October, featuring many local artisans, presented by the town of Edisto Beach.\r \n\n\r\n\t\tWhen: 9 a.m.-5 p.m.\r \n\n\r\n\t\tWhere: Bay Creek Park, 3706 Docksite Road, Edisto Beach\r \n\n\r\n\t\tPrice: Free\r \n\n\r\n\t\tMore Info: Click here. \r \nWine Down Wednesday \r \n\r\n\t\tWhat: Guests can enjoy wine, hors d’oeuvres, and live music from Henri Gates at this hidden gem located in West Ashley, the scenic Old Towne Creek County Park, which is not yet regularly open to the public. Admission price also includes a commemorative wine glass.\r \n\n\r\n\t\tWhen: 5-7 p.m.\r \n\n\r\n\t\tWhere: Old Towne Creek, 1447 Old Towne Road, Charleston\r \n\n\r\n\t\tPrice: $20 general; $15 Charleston County residents (advance)\r \n\n\r\n\t\tMore Info: Click here. \r \nYoga Unplugged \r \n\r\n\t\tWhat: Bask in the sights and sounds of the beach during this sunset yoga series with live acoustic music.\r \n\n\r\n\t\tWhen: 5:30 p.m.\r \n\n\r\n\t\tWhere: Folly Beach County Park, 1100 West Ashley Ave.\r \n\n\r\n\t\tPrice: $8-$10\r \n\n\r\n\t\tMore Info: Click here. \r \nYoga in the Meadow \r \n\r\n\t\tWhat: With an outdoors backdrop, teachers guide participants through a flowing series of yoga postures while maintaining a focus on alignment and breath to build heat, flexibility and strength.\r \n\n\r\n\t\tWhen: 5:30 p.m.\r \n\n\r\n\t\tWhere: Wannamaker County Park, 8888 University Blvd., North Charleston\r \n\n\r\n\t\tPrice: $8-$10\r \n\n\r\n\t\tMore Info: Click here. \r \nWine Tasting \r \n\r\n\t\tWhat: This tasting will feature affordable wines from lesser known regions wines by Grassroots Wine, paired with seasonal snacks. A portion of the ticket sales will benefit Slow Food Charleston.\r \n\n\r\n\t\tWhen: 5:30-7:30 p.m.\r \n\n\r\n\t\tWhere: The Glass Onion, 1219 Savannah Highway, Charleston\r \n\n\r\n\t\tPrice: $10 per person\r \n\n\r\n\t\tMore Info: Click here. \r \nMake Scented Candles \r \n\r\n\t\tWhat: Experience a hands-on, behind the scenes look at how to make scented, soy wax candles. Class participants will participate in every step of scented candle-making process guided by expert chandlers. BYOB.\r \n\n\r\n\t\tWhen: 6 p.m.\r \n\n\r\n\t\tWhere: Candlefish, 71 Wentworth St., downtown Charleston\r \n\n\r\n\t\tPrice: $45\r \n\n\r\n\t\tMore Info: Click here. \r \nBarn Jam \r \n\r\n\t\tWhat: This week's Barn Jam will feature live music from Bo DePea (folk/Americana/country), Kylie Odetta (indie/pop/soul), SIRSY (indie rock), Eric Sommer (pop, folk, acoustica and some experimental electronica), Weigh Station ('dirty Southern funk rock' and Forlorn Strangers (folk/Americana).\r \n\n\r\n\t\tWhen: 6-10 p.m.\r \n\n\r\n\t\tWhere: Sewee Outpost, 4853 Highway 17, Awendaw\r \n\n\r\n\t\tPrice: $5 suggested donation\r \n\n\r\n\t\tMore Info: Click here. \r \nPoetry and Storytelling \r \n\r\n\t\tWhat: Huggy Bear Da Poet writes from the heart and performs from the soul. He uses spoken word to motivate, empower,and agitate people toward social change.\r \n\n\r\n\t\tWhen: 6-7 p.m.\r \n\n\r\n\t\tWhere: Dock Street Theatre, 135 Church St., Charleston\r \n\n\r\n\t\tPrice: Free\r \n\n\r\n\t\tMore Info: Click here. \r \nFuneral Advantage \r \n\r\n\t\tWhat: Funeral Advantage (indie pop rock) with The Arctic Flow (indiepop) & Lightness (alternative/shoegaze).\r \n\n\r\n\t\tWhen: 9 p.m.\r \n\n\r\n\t\tWhere: Tin Roof, 1117 Magnolia Road, Charleston\r \n\n\r\n\t\tPrice: $5\r \n\n\r\n\t\tMore Info: Click here.", "source": "Charleston Post and Courier"}