{"published": "2015-09-26T16:22:20Z", "media-type": "News", "title": "Russia and Estonia swap alleged spies", "id": "a0d47797-47be-41be-8742-fd086fc597f6", "content": "PM Modi should have credited Rajiv Gandhi for Indias IT revolution say Tewari Dikshit  \nMumbai News.Net - Sunday 27th September, 2015 \n \nReacting to Prime Minister Narendra Modi's Digital India reiteration made in San Jose, California, Congress leader Manish Tewari on Sunday said the current government is only reaping the benefits of  ... \n   Apple CEO desirous to be part of game changer Digital India initiative MEA  \nMumbai News.Net - Sunday 27th September, 2015 \n \nThe Ministry of External Affairs (MEA) here today said that Apple CEO Tim Cook has lauded Prime Minister Narendra Modi for his idea of 'Digital India', adding that the former has expressed his  ... \n   PM Modi stresses on expansion of internet connectivity  \nMumbai News.Net - Sunday 27th September, 2015 \n \nPrime Minister Narendra Modi today called for the expansion of internet connectivity across India, saying that he aims to connect the nation by expanding the public Wi-Fi hotspots.\n   \n\"We are  ... \n   PM Modi praises tech giants for removing social barriers  \nMumbai News.Net - Sunday 27th September, 2015 \n \nPrime Minister Narendra Modi here today praised the technological giants for reducing the social barriers, saying that internet connects people on the strength of human values, not just  ... \n   Top tech giants hail PM Modis `Digital India` initiative  \nMumbai News.Net - Sunday 27th September, 2015 \n \nTop technological giants from the Silicon Valley today hailed Prime Minister Narendra Modi's for his 'Digital India' initiative, saying technology is the future and India is moving in the right  ... \n   Tech-savvy PM Modi tours Tech giant Tesla Motors  \nMumbai News.Net - Saturday 26th September, 2015 \n \nPrime Minister Narendra Modi visited the premiere American automobile giant- Tesla Motors - at their plant in Fremont, where he discussed ideas of electricity generation in rural India.\n   \nThe  ... \n   Representatives of Sikh Gujarati communities call on PM Modi in San Jose  \nMumbai News.Net - Saturday 26th September, 2015 \n \nRepresentatives of the Sikh and Gujarati communities called on Prime Minister Narendra Modi in San Jose today. \n   \nThe Prime Minister exchanged pleasantries and shook hands with the members of the  ... \n   PM Modi meets Apple CEO Tim Cook  \nMumbai News.Net - Saturday 26th September, 2015 \n \nApple CEO Tim Cook called on Prime Minister Narendra Modi here today. \n   \nThe duo had a one-on-one meeting at Hotel Fairmont here. \n   \n\"Dialling India for Digital. An exciting evening begins, as  ... \n   PM Modi interacts with members of Indian community  \nMumbai News.Net - Saturday 26th September, 2015 \n \nPrime Minister Narendra Modi interacted with members of the Indian community at San Jose, California, today.\n   \nThe members of the Indian community called on Prime Minister Modi at Hotel Fairmont  ... \n   PM Modi arrives in California  \nMumbai News.Net - Saturday 26th September, 2015 \n \nPrime Minister Narendra Modi arrived here today for the penultimate leg of his two-nation tour during which he will interact with the Indian community.\n   \nThere were loud cheers and chants of 'Modi  ... \n   Kailash Kher comes to defence of Irish students and Indian PM Modi  \nMumbai News.Net - Saturday 26th September, 2015 \n \nSinger Kailash Kher, who will perform live for Prime Minister Narendra Modi with his band Kailasa at Silicon Valley, California, today appreciated the recitation of shlokas in Sanskrit by the Irish  ... \n   PM Modis initiative will make significant difference in Indias progress feels  Indo-American Community  \nMumbai News.Net - Saturday 26th September, 2015 \n \nExpressing delight over Prime Minister Narendra Modi's visit to San Jose, Convener of Indo-American Community of West Coast, Khande Rao, on Saturday said that the initiatives taken by the former  ... \n   Prime Minister Modi departs for California  \nMumbai News.Net - Saturday 26th September, 2015 \n \nPrime Minister Narendra Modi has departed for San Jose, California, where he will visit Tesla Motors and meet top officials of IT companies, including Tim Cook (Apple Inc.), Satya Nadella  ... \n   Bengaluru to host three-day Northeast festival says Jitendra Singh  \nMumbai News.Net - Saturday 26th September, 2015 \n \nUnion DoNER Minister Dr. Jitendra Singh said that after having successfully showcased Northeast in New Delhi and other important towns in North India, the next step would be to carry forward the  ... \n   NDRF conducts tsunami mock drills in AP Odisha Tamil Nadu Puducherry and West Bengal  \nMumbai News.Net - Saturday 26th September, 2015 \n \nTo check and review the preparedness of states along the East Coast of India to meet a tsunami threat, the National Disaster Response Force (NDRF) conducted tsunami mock exercises on Saturday in  ... \n   Pakistan waging proxy terror war against India says Rajnath  \nMumbai News.Net - Saturday 26th September, 2015 \n \nUnion Home Minister Rajnath Singh on Saturday accused Pakistan of waging a proxy war against India and said it is a big challenge for the country.\n   \n\"Pakistan has waged a proxy terror war against  ... \n   Nagpur Police hound actor of Indias Oscar nominated film Court for Maoist links  \nMumbai News.Net - Saturday 26th September, 2015 \n \nAn actor of India's official entry to the Best Foreign Language film category of the 2016 Academy Awards \"Court\", Vira Sathidar, said on Saturday he was still being hounded by police for his links  ... \n   An online tea retailer offers hope for Indian tea industry  \nMumbai News.Net - Saturday 26th September, 2015 \n \nAt a time when doubts are being cast on the fate of India's colonial-era tea gardens, an online tea seller based in West Bengal's Siliguri District may finally have the formula for revival of the  ... \n   PM Modi makes strong pitch for UNSC reforms  at G4 summit  \nMumbai News.Net - Saturday 26th September, 2015 \n \nPrime Minister Narendra Modi on Saturday made a strong pitch for reforms of the United Nations Security Council (UNSC), saying that it would lend greater credibility and legitimacy to the  ... \n   PM Modi can only speak will never do justice to Bihar Nitish Kumar  \nMumbai News.Net - Saturday 26th September, 2015 \n \nBihar Chief Minister Nitish Kumar on Saturday targetted Prime Minister Narendra Modi for not fulfilling promises made to the electorates ahead of 2014 general elections, saying that the latter only  ...", "source": "Mumbai News.Net"}