{"published": "2015-09-08T11:23:16Z", "media-type": "News", "title": "Whitbread says living wage will force up prices at Costa Coffee", "id": "50b10ad9-38b6-4a37-9cd4-7eb14db4e3e6", "content": "Costa Coffee has warned that prices could be forced up because of the introduction of the national living wage next… NICK GOODWAY \n\nTuesday 8 September 2015 12:18 BST \n\nBean counting: Whitbread says price increases and efficiency measures will be implemented to offset the living wage costs Phil Noble/Reuters \n\nCosta Coffee has warned that prices could be forced up because of the introduction of the national living wage next year. \n\nAndy Harrison, chief executive of the company, which also owns Premier Inn, said there would be “selective price increases” among other measures to deal with the extra £15 million to £20 million that he expects the living wage to cost his business. \n\n“I cannot rule out price increases,” said Harrison. “People are our biggest single cost. \n\n“We are supportive of a steady increase in the national living wage, but this is quite a big one which came out of the blue in the summer Budget. \n\n” \n\nHe added that the group had not yet decided which prices might be raised and would reveal details with its first-half results next month. \n\nOut of Whitbread’s total hourly paid staff of 42,000, around 34,000 are currently paid £7.20 or less — and of those 16,000 are over 25 and so will qualify for the living wage. \n\nThe company also owns the Beefeater, Brewers Fayre, Table Table and Taybarns restaurant chains. \n\nHarrison said: “We shall mitigate this substantial price increase over time with a combination of productivity improvements boosted by investments in systems and training and efficiency improvements. \n\n“At least it is much easier to absorb something like this in a fast-growing business which is set to create around 3,000 jobs this year. \n\n” \n\nBut he highlighted the knock-on effect of the national living wage, saying: “We are also looking at our differentials — because if the minimum wa…", "source": "MyInforms"}