{"published": "2015-09-14T20:24:08Z", "media-type": "News", "title": "» #AliciaVikander Alicia Vikander Eddie Redmayne, Alicia Vikander, Dakota Johnson Turn Out in Toronto » NEWS »…", "id": "36f7404b-ec47-4070-bc1d-61d3c23f11e5", "content": "Alicia Vikander, The Man From U.N.C.L.E. \nWith her star on an epic trajectory, Alicia Vikander is already a regular at glitzy red carpet events. \nWe all were quite aware that this was going to be quite a different animal from the old series, and still paying, of course, homage to it. \n\nIt's Wednesday, which means it's socially acceptable to crush on your favorite lady. \n\nAre they already dating but just keeping quiet because of Vikander ? There are few signs that would suggest that Michael and Alicia's relationship is on the rocks. \n\nFrom a calculating fembot in Ex Machina to an undercover agent in The Man from U.N.C.L.E., Alicia Vikander has proven hypnotic as an actressso it's no surprise that her style has, as well. \n\nHere is Oscar winner Eddie Redmayne and Alicia Vikander in the official trailer for Focus Features' The Danish Girl. \n\nEddie Redmayne and Alicia Vikander leave a boat together during the 2015 Venice Film Festival at Sala Grande on Sunday in Venice, Italy. \n\nAnd stars of The Danish Girl, Eddie Redmayne and Alicia Vikander also made an appearance last night with Alicia looking as stylish as always. \n\nFrom a calculating fembot in Ex Machina to an undercover agent in The Man from U.N.C.L.E., Alicia Vikander has proven hypnotic as an actress—so it's no surprise that her style has, as well. \n\nFresh from the premiere of their film “The Danish Girl,” Eddie Redmayne and Alicia Vikander both made appearances. “We're alive at this point in the evening, so that's good,” said Redmayne. \n\nAlicia Vikander walks the red carpet looking chic as ever while attending the premiere of her movie The Testament of Youth on Monday at UGC Cine Cite Bercy in Paris, France. \n\nAlicia Vikander 's hair blows in the wind while stepping out in a dark red leather jacket on Thursday in London, England. \n\nBut the signs are all there – Alicia Vikander backed out of a project to shoot Assassin's Creed with supposed BF Michael Fassbender and instead swapped to a Bourne project shooting at the same time. \n\nALICIA VIKANDER : We all were quite aware that this was going to be quite a different animal from the old series, and still paying, of course, homage to it. \n                                    Alicia Vikander  The Man From U.N.C.L.E.", "source": "Canadian News"}