{"published": "2015-09-09T05:02:26Z", "media-type": "Blog", "title": "Gun Rights Group Sues Over FSU Football ‘Game Day Plan’", "id": "5a7111d0-2846-4a15-8783-6f6701ad5e13", "content": "Gun Rights Group Sues Over FSU Football ‘Game Day Plan’ CLICK HERE FOR AN UPDATE TO THIS STORY. A gun-rights group filed a lawsuit Tuesday to try to force Florida State University to change its football “Game Day Plan 2015,” a 28-page information packet sent out by campus police that advises visitors firearms can’t be stored in vehicles parked on campus. Florida Carry Inc. announced late Tuesday it and FSU graduate student Bekah Hargrove, a member of Florida Students for Concealed Carry, are seeking an injunction against university President John Thrasher and university Police Chief David Perry over the “game day” guide. Florida Carry and Hargrove argue the “game day” guide fails to follow a 2013 ruling by the 1st District Court of Appeal that said the University of North Florida cannot prevent firearms from being stowed in cars. The “game day” guide provides general information on parking, traffic patterns, tailgating, concessions, and other items such as banners, drones and smoking. Under a section titled “weapons,” the packet states that weapons are prohibited on campus and that a “fan may not store firearms or other weapons in their vehicles parked on campus while attending the game.” In a release, Florida Carry Executive Director Sean Caranna called the planner “a blatant attempt” to “enforce illegal gun control with the threat of throwing good people in jail for the lawful exercise of their right to bear arms.” A university spokesman said Tuesday officials had not seen the legal documents and could not comment. The state university system and Florida Carry are awaiting a separate decision from the 1st District Court over the gun-rights group’s argument that the Second Amendment should supersede a Florida law that bans firearms from university housing. by The News Service of Florida", "source": "NorthEscambia.com"}