{"published": "2015-09-13T14:17:05Z", "media-type": "News", "title": "Oman Air backs people with special needs", "id": "3e9a626b-3d5d-455c-bb86-8703a6b3e8bc", "content": "National carrier Oman Air, in partnership with the Oman’s Ministry of Social Development, has made exclusive travel arrangements to assist people with special needs, on low incomes. \n\nPaul Gregorowitsch, Oman Air’s chief executive officer, said: “Oman Air is pleased to be working closely with the directorate general for People with Special Needs with their airline tickets requirement. The tickets will enable them to access treatment or education or take part in other relevant activities.” \n\n“This initiative underlines Oman Air’s long-standing commitment to working with public and private institutions to offer a helping hand to those who are in need. As the national carrier of Oman, we have a duty to support and enable the people of the country. This is an important element of our corporate social responsibility programme and we are proud to be working with the Ministry of Social Development in achieving it,” he said. \n\nHilal Mohamed Al Abri, director general for People with Special Needs at the Ministry of Social Development, added: “This new initiative with Oman Air will provide vital support for people with special needs who are living on low incomes. It will mean that they can more easily access the help and services that they need. We are grateful to our national carrier for their commitment.” \n\nOman Air has been long involved in providing support for people with special needs. Most recently, the airline partnered with the Public Authority for Small and Medium Enterprises and the Al Raffad Fund to run a workshop in Muscat. Here, the importance of providing financial backing for students with special needs was emphasised, and students learned about the significance of economic independence. The steps necessary for creating one’s own business, and the availability of practical and financial support provided by the Al Raffad Fund were also outlined. – TradeArabia News Service", "source": "Gulf Daily News"}