{"published": "2015-09-04T21:00:02Z", "media-type": "News", "title": "Three sought in attempted robbery of elderly woman in Oakville", "id": "3813bca6-4186-403b-bb20-9f2c22aacee8", "content": "Halton police are looking for three suspects following the attempted robbery of an elderly woman at Bloomfield Park, 2531 West Oak Trails, on Friday, Aug. 28.\r \n \n\r\n                            The incident began at around 1:30 p.m., when three teen boys approached an elderly woman walking in Bloomfield Park, police said.\r \n \n\r\n                            One of the boys attempted to grab the woman’s purse, but she was able to hold on.\r \n \n\r\n                            The would-be thief removed the woman’s wallet from the purse and threw it to another boy.\r \n \n\r\n                            The individuals went through the wallet before throwing it to the ground and running away.\r \n \n\r\n                            The woman was not injured and nothing was stolen from her wallet.\r \n \n\r\n                            The first suspect is described as 5-foot-8 to 5-foot-10, approximately 17 years old with black medium length hair, stubble on his face and a skinny build.\r \n \n\r\n                            He wore a red and green plaid shirt, a grey/green zippered sweatshirt and dark blue jeans.\r \n \n\r\n                            The second suspect is described as white, 5-foot-8 to 5-foot-10, approximately 16-17 years old with brown medium length hair, and a skinny build.\r \n \n\r\n                            He wore a blue/green plaid shirt, a black sports vest with white piping on it and dark blue jeans.\r \n \n\r\n                            The third individual is described as white, 5-foot-8 to 5-foot-10 with a skinny build and brown medium length unkempt hair.\r \n \n\r\n                            He wore a beige t-shirt and dark blue jeans.\r \n \n\r\n                            Anyone with information about this incident is asked to contact the Oakville Criminal Investigations Bureau at 905-825-4747 ext. 2285 or Crime Stoppers at 1-800-222-TIPS (8477).", "source": "Inside Halton"}