{"published": "2015-09-16T06:33:00Z", "media-type": "News", "title": "Uber, Lyft officially operating in Las Vegas", "id": "53826a7e-4a0d-4869-9191-eb858b6214c3", "content": " Las Vegas, NV (KTNV) -- It's what fans of Uber and Lyft have been waiting for, both ride sharing services are officially up and running in Las Vegas. But it's not without its controversy, the rides are being offered without the blessing of Clark County Commissioners. \n \nAn Action News crew decided to take both and Uber and Lyft rides to see how they are operating and how drivers feel about everything that's happened. \n \nIt started with the push of a button and within seven minutes our crew had a Lyft from Robert Archer. \n \n\"I was fiddling with my phone and the app came up, a ride that was on Gilespie, so I just punched it in and away we went,\" said Archer about how he officially learned that he could start offering rides. \n \nOur crew was his second ride. Earlier in the day officials from both Uber and Lyft went in front of the Clark County Commission to request temporary business licenses but were denied. Just hours later both services decide to start operating anyway with their state licenses.  \n \n\"When they make up their mind then fine and dandy, I'll go get a county license, if that's what it takes, I've got a state license now to operate,\" said Archer. \n \nRobert dropped our crew off at Charlie Frias Park where we asked people if they are comfortable with taking an Uber or Lyft ride, eventhough they don't have a county business licese. \n \n\"Yes I would, yes I would, it's a big help,\" said Las Vegas resident Ioianna Athalone. \n \n\"Yes I would because it's an easy way to get around especially if you don't have a car,\" said Bernard Matis. \n \nAnd to get back our crew used Uber. After just five minutes, Joshua Kaufman, our Uber driver arrived. Like Archer, he's happy the services are finally up and running. \n \n\"Even beyond the price, it's simply because it's a clean car, you get friendly service in general and there are all these things that make it a better deal,\" said Kaufman. \n \nBoth companies were licensed by the state on Monday and in a statement Uber said it's complying with all existing rules.", "source": "KTNV"}