{"published": "2015-09-03T17:10:59Z", "media-type": "News", "title": "A Guess Model's Food and Fitness Diary", "id": "e7f97a75-10f8-42f9-baf6-4d1c043e65a8", "content": "Photo:  Megan Williams \n \n“ Woahhh ” is probably the first thought that comes to mind when you spot Guess model Megan Williams in one of her fashion campaigns. At 5′ 9.5,” the British-born, New York-based blonde is all legs, and flaunts the kind of body that belongs on a billboard. \n \nEven if you don’t know her by name, you’ll probably recognize that face (and, um, body) from her recent work. Right now you can spot Williams in her seventh campaign for Guess, but she’s also graced the glossy pages of Elle , Glamour , Marie Claire and worked with Victoria’s Secret. \n \nSo while, sure, lucky genetics have a big part to play in Williams’ killer physique, when the model offered up a page from her food and fitness diary , we jumped at it. She’s a cook, a coconut water addict and a Pilates-fan, and told us all about the workout trend she’s obsessed with right now. Take notes, folks, this is how you eat and work out like a bonafide model. \n \nFor breakfast I had… \nGluten-free pancakes—I make them myself. \n \nFor lunch I had…\\ \nChicken salad and iced tea. \n \nFor dinner I had… \nFish tacos. \n \nToday I snacked on… \nFruit, fruit and more fruit. \n \nMy go-to healthy drink is… \nCoconut water. \n \nThe one thing I would never eat is… \nOysters. \n \nMy favorite workout is… \nPilates. \n \nMy guilty pleasure food is… \nChocolate; it’s my addiction. \n \nThe next big health and fitness trend will be… \nSLT . \n \nMy favorite healthy restaurant is… \nHu’s Kitchen . \n \nMy favorite healthy snack is… \nI love to snack on a bag of granola when I’m traveling. \n \nSome of the fitness blogs I love include… \nZuzka Light is awesome for quick home workouts. \n \nPhoto: Guess \n \nI’m obsessed with following… \nChrissy Tiegen on Instagram—I love her style and humor. \n \nThe three ingredients you’ll always find in my kitchen are… \nEggs, cheese and peanut butter. \n \nMy biggest health tip for travelers is to… \nStay hydrated and drink loads of water to keep your skin fresh. \n \nMy signature healthy dish is… \nThai red curry. \n \nThe health app I couldn’t live without is… \nNike Training app . It’s great when I travel for home and hotel workouts. \n \nThe top three songs on my workout playlist right now are… \n“House Every Weekend” by David Zowie, “Run the World” by Beyoncé, and my favorite classic is “Push It” by Salt-N-Pepa. \n \nThe best part of my job is… \nTraveling and meeting new people. \n \nWant more food and fitness diaries? Step this way .", "source": "StyleCaster"}