{"published": "2015-09-17T14:06:00Z", "media-type": "Blog", "title": "West Virginia Defense Not Meeting Own Expectations", "id": "867c3890-c2f9-440b-a5e8-ae11081ce914", "content": "Two weeks into the 2015 football season, West Virginia ranks second in the Big 12 scoring defense, giving up just 8.5 points per game. The Mountaineers are fifth in total defense, giving up a little less than 300 yards per contest. But for second-year defensive coordinator Tony Gibson, they’re not quite good enough. \n\nWelcome, By-Godders, to the Shotgun/Throwdown, WVU's best place for sports links, information, sophomoric humor and daily distractions.\n\n\n    \n\n\n\n\nFootball:\n\nWVU defense not yet meeting own lofty expectations for 2015 | Beckley Register-HeraldTwo weeks into the 2015 football season, West Virginia ranks second in the Big 12 scoring defense, giving up just 8.5 points per game. The Mountaineers are fifth in total defense, giving up a little less than 300 yards per contest. In 2012 and 2013, when WVU was ranked among the worst defenses in all of college football, those numbers would have seemed dreamlike. But for second-year defensive coordinator Tony Gibson, they’re not quite good enough.\n\nWVU coach Holgorsen, QB Howard on same wavelength | Pittsburgh Tribune ReviewSkyler Howard became West Virginia's starting quarterback once he earned coach Dana Holgorsen's trust. Holgorsen discovered early in the decision-making process that he and Howard think alike. Howard is Holgorsen's kind of quarterback.\n\nTeammates glow about WVU QB’s dedication | Charleston Gazette-MailThrough two starts in 2014, an offseason that bridges the winter, spring and summer months and now two starts this season, Skyler Howard has become the caretaker of West Virginia’s offense.\n\nMountaineers continue work with zone read | The Exponent TelegramThere has been a certain fascination in watching Dana Holgorsen’s offense evolve since he came to West Virginia. Expectations were that Holgorsen would fill the air with footballs while the running game, once the staple of the Mountaineer program, was to be phased out like the traditional blue and gold uniforms.\n\nWVU Focused on Internal Improvement, Maryland During Bye | WV IllustratedA bye week after two games is not the ideal scheduling for any football team, West Virginia included. Dana Holgorsen and the Mountaineers get an early break, but any college coach will tell you a perfect-world bye comes after the fourth game of the season.\n\nTime for Shell to step up | The Exponent TelegramThe time for talking is over. Rushel Shell has to take that leap forward that everyone has been waiting for and become the running back West Virginia thought it was getting when he made UCLA only a brief intermediate stopover on his way here from Pitt.\nBasketball:\n\nFormer WVU men’s basketball player donates $6.1K to WVU Cancer Center | WVU Health NewsFormer WVU Men’s Basketball player John Flowers is helping the WVU Mary Babb Randolph Cancer Center provide optimal cancer care.\nWest Virginia Athletics:\n\nBlack to Miss Remainder of 2015 Season | WVU AthleticsWest Virginia University junior Carly Black is expected to miss the remainder of the 2015 women’s soccer season after suffering a torn ACL during the Mountaineers’ 2-0 win at No. 15 Ohio State on Friday, Sept. 11.\n\nLarmond carves out a role in freshman season after club experience | The Daily AthenaeumThe West Virginia University men’s soccer team may have found a future cornerstone player when Rushawn Larmond signed his letter of intent this May.\n\n\n    \n\n\n\n\nAround The Big 12:\n\nNew interim Longhorns AD Mike Perrin comes with deep Texas roots | Sporting NewsUniversity of Texas president Gregory L. Fenves on Wednesday introduced Mike Perrin as a man who \"has sat in every seat at this university,\" adding interim athletic director to a list that includes athlete, student, booster and volunteer.\n\nTexas will LOVE its next AD—Patterson made sure of that | WV MetroNewsGiven the damning stories pouring out at Texas, can we assume Steve Patterson will have a cameo in Horrible Bosses 3?\n\nPlenty of positives in Jay Norvell's debut Texas' play-caller | ESPNTexas' win against Rice provided a revealing glimpse at the Longhorns' offense under Jay Norvell.\n\nAustin, Texas restaurant pokes fun at Steve Patterson | ESPNThe Austin-based Mexican restaurant El Arroyo had a little fun after this week's firing of Texas athletic director Steve Patterson, who angered many Longhorn fans for raising ticket prices.\n\nNew DC David Gibbs trying to solve Texas Tech's panic problem | ESPNDavid Gibbs doesn’t have to be a psychologist to diagnose the tendencies that get Texas Tech’s defenders in trouble.\n\nOklahoma State Cowboys focus on creating turnovers | ESPNOklahoma State is putting greater focus on practicing turnovers. The Cowboys have set aside more time to focus on trying to create turnovers, even though they have forced just one thus far in 2015.\nAround The NCAA:\n\nT.W.I.S., where one Terps fan thinks Maryland could've landed Jim Harbaugh | SBNationHello! This Week In Schadenfreude is our weekly trawl for the most upset people on the college football Internet! It's amazing there's not a Rutgers section, but check back next time, probably!\n\nCOLLEGE FOOTBALL GAMBLING: Alabama, Georgia Tech and Week 3's 24 other best bets | SBNationIt's time to pick only the best wagers from the weekend schedule, including several of the season's biggest games so far.\n\nRutgers suspends Kyle Flood for three games | Sporting NewsRutgers coach Kyle Flood has been suspended three games and fined $50,000 following a university investigation.\n\nTHE NINE DUMBEST THINGS IN THE RUTGERS REPORT ON KYLE FLOOD | Every Day Should Be SaturdayGREAT JOB, EVERYONE\n\nIt's Time for Steve Spurrier to Retire | Team Speed KillsThe Head Ball Coach is fun to watch and has led South Carolina to unprecedented heights. But he's not what the program needs anymore\n\n\n    \n\n\n\n\n\nGeno Smith still 'extremely' angry about punch | NFL.comIt's been more than a month since the early portion of Geno Smith's season was derailed by a locker room sucker punch, and it appears he's still trying to come to terms with what happened.\n\nTavon Austin takes NFC special teams player of the week | ProFootballTalkThe Rams weren’t lacking for standout performers in last Sunday’s 34-31 overtime victory over the Seahawks and two of them were honored by the league for their efforts.\n\nAdam Jones of Cincinnati Bengals fined $35,000 for incident involving Amari Cooper of Oakland Raiders | ESPNBengals cornerback Adam Jones said Wednesday he was fined $35,000 by the NFL for slamming Raiders receiver Amari Cooper's head into his helmet during the teams' Week 1 matchup Sunday in Oakland, California.\n\nOn Sundays he's 'Pacman'; every other day he's simply Adam Jones | ESPNSports, like other forms of entertainment, love a good alter ego story. Good vs. evil. Right vs. wrong. Superhero vs. villain. When those sides play out within the psyche of a single individual, they can be even more intriguing. That helps explain the longtime fascination with Adam \"Pacman\" Jones, the Cincinnati Bengals cornerback who has often drawn headlines because of some controversial on- or off-field incident in which he played a role.\n\n\n    \n\n\n\n\n\n\n\n\n    \n\n\n\n\n\nToday's Miss Throwdown needs no introduction. CLICK HERE for today's gallery of Kate Upton.", "source": "The Smoking Musket -  All Posts"}