{"published": "2015-09-03T20:33:40Z", "media-type": "News", "title": "Georgia man headed to trial in murder of 'go-go' dancer in East Orange", "id": "43fb1e1d-133f-42b6-a37e-d416e75ba745", "content": "Brian Love, 42, of Riverdale, Georgia, is scheduled to go on trial next month on murder and weapons charges in the stabbing death of Denise Ramsey, who was found on Jan. 25, 2012 in East Orange. Essex County Correctional Facility    \nNEWARK  -- With his co-defendant still at large, a Georgia man is scheduled to go on trial next month on charges of stabbing a \"go-go\" dancer to death and leaving her body in an empty lot in East Orange. \n\nBrian Love, 42, of Riverdale, Georgia, is facing murder and weapons charges in the killing of Denise Ramsey, who was discovered under a mattress on Jan. 25, 2012 after her sister had reported her missing. \n \nLove is set to return to court on Oct. 16 for a status hearing, and jury selection in the trial is scheduled to begin on Oct. 19. \n \nHis co-defendant, Johnny Jones III, is also charged in Ramsey's murder, but he remains a fugitive, according to Katherine Carter, spokeswoman for the Essex County Prosecutor's Office. \n \nLove remains in custody at the Essex County Correctional Facility in lieu of $1 million bail. \n RELATED:  Man says he missed son's birth after false arrest in murder of 'go-go' dancer \n\nThe upcoming trial comes as another Georgia resident, Corey Fallen, pursues a federal lawsuit over the case, claiming he was falsely arrested and unlawfully imprisoned in connection with Ramsey's murder . \n \nWitnesses had identified Fallen as being with Ramsey when she went missing in December 2011, but his DNA was not found on her body and detectives ultimately confirmed that Fallen was not in New Jersey at the time of Ramsey's disappearance, court documents state. \n \nFallen spent nearly six months in custody, before he was released on his own recognizance in April 2013. About a month later, an Essex County grand jury decided to not indict Fallen in Ramsey's death. \n \nIn May 2014, Love and Jones were indicted in the murder. \n \nAuthorities have said Ramsey, 33, was last seen in the early morning hours of Dec. 3, 2011, when she was working at the Doll House in Irvington. \n \nAt the time, two male suspects at the club became angry when they gave Ramsey three one-hundred-dollar bills and asked her for change in the form of singles, but then only received change for one hundred-dollar bill, according to eyewitnesses, court documents state. \n \nThe witnesses recalled one of the suspects saying, \"if we don't get the money, then we gonna go outside, pop the trunk and kill everybody in here,\" court documents state. Ramsey was last seen by witnesses leaving the Doll House that evening and getting into a vehicle with the male suspects, court documents state. \n \nAt a hearing for Love on Tuesday, Essex County Assistant Prosecutor Naazneen Khan indicated that Jones and Love were the male suspects with Ramsey on the night of her disappearance. \n \nInvestigators later found Love's DNA under Ramsey's fingernails, Khan said. Jones's DNA was linked to DNA found in a sweatshirt that was wrapped around Ramsey's body and DNA found under Ramsey's fingernails, according to court documents. \n \nDuring Tuesday's hearing, Khan also said that, after detectives arrested Love in Atlanta, he gave a statement in which \"he indicates his presence at the scene at the time that the victim is being stabbed to death and indicates that he did assist in disposing of the victim's body,\" according to an audio recording of the proceeding. \n \nThe empty lot where Ramsey was discovered is less than a mile from where Jones and Love were residing at the time, Khan said. \n \nEssex County prosecutors have offered a plea deal to Love in which they would recommend a sentence of seven years in state prison. Under that offer, Love would have to serve nearly six years before becoming eligible for parole. \n \nLove's attorney, Olubukola Adetula, indicated on Tuesday that he has been looking for a plea deal that includes a seven-year prison sentence with no period of parole ineligibility. \n \nBut when Superior Court Judge Ronald Wigler questioned Love on Tuesday about whether he wanted to proceed to trial, Love said he had not decided yet, according to the audio recording. \n \nWigler then asked Love if he had an opportunity to speak with Adetula, but Adetula interjected, saying he had discussed the matter with Love and that he \"fully understands what the state's position is.\" \n \n\"I think he's very clear on that and, if anything changes, of course, I will notify the court and the prosecutor, but for now, we're where we are,\" Adetula said. \n \nThe judge said he wanted to avoid having the case resolved on the \"eve of trial if it doesn't have to be,\" and asked Adetula whether it would be beneficial to return to court in September to ensure Love has \"everything he needs to make that informed and intelligent decision.\" \n \nBut Adetula said such a court hearing was not necessary, saying he will make sure Love has everything he needs and that he will continue to have discussions with Love. If anything changes, Adetula said he will notify the court. \n \nBill Wichert may be reached at bwichert@njadvancemedia.com . Follow him on Twitter @BillWichertNJ . Find NJ.com on", "source": "Star Ledger"}