{"published": "2015-08-31T23:27:40Z", "media-type": "News", "title": "Virginia TV shooting: NRA tells grieving parents not to be 'emotional'", "id": "487361e3-7385-4d70-a010-abc0296614f9", "content": "A prominent National Rifle Association advocate's 10-minute video suggests the parents of the reporters killed on air not be \"emotional\" in calling for gun control. \n\nTelevision journalists shot in on-air attack Washington: A prominent National Rifle Association advocate has released a 10-minute video message in which he suggests the parents of the reporters killed on air in Virginia last Wednesday not be \"emotional\" in calling for gun control.\n\nThe statement was made by Colion​ Noir, who fronts an NRA web video program designed to appeal to young people.\n\n\"To the parents of Alison Parker and Adam Ward, I have no right to tell any parent how to grieve for their child,\" Mr Noir says in the video.\n\n\"Grief-inspired advocacy can be extremely effective and powerful and I say run full speed to find the way to end violence like this.\n\n\"However, sometimes in a fight we can become so emotional that everyone and everything starts looking like the enemy even when they are there to help us. I am deeply sorry for your loss.\"\n\nThe video also includes a broadside at Australia's gun laws, with footage of an unnamed man warning that Australia has lost \"its freedoms\" due to an overreaction to gun violence. US President Barack Obama has previously . So far this video appears to be the most significant response by the NRA to the murder of the two journalists, shot dead live on air by a disgruntled former colleague, who also shot and wounded their interview subject.\n\nOn Sunday Parker's parents appeared on CNN and vowed to fight for increased gun control in her memory.\n\n\"Alison would be really mad at me if I didn't take this on,\" her father Andy Parker said. \"And I promise you, these people are messing with the wrong family. We are going to effect a change.\"\n\nParker's mother, Barbara, said she was not discouraged that other prominent shootings had not yet prompted change, or that those who opposed new gun control measures were so well funded and organised.\n\n\"There are people out there whose minds we will never change,\" she said. \"If you are a parent, if you are a mother, if you have children – how can you look your child in the eye and say 'we are willing to allow you to be collateral damage in order to keep what some people perceive to be their constitutional rights'. If we as a society are willing to accept that, what kind of society are we?\"\n\nIn a separate interview, Mr Parker said he had already been in contact with other gun control advocates, including Mike Kelly, the astronaut whose wife, congresswoman Gabby Giffords, was shot in the head in a mass shooting, to see how to help push \"sensible gun control legislation\".\n\nMr Parker authored an opinion piece published on Sunday reiterating that he plans to make his life's work \"trying to implement effective and reasonable safeguards against this happening again\".\n\nOfficially the NRA's response was silence, though it has used its growing in-house media arm to respond to calls for increased gun control made by, among others, US President Barack Obama and Hillary Clinton, the Democratic Party's frontrunner for the next year's presidential election.\n\nHours after the murders, NRA radio personality Cam Edwards, host of a program called Cam & Company, complained the shootings were already being used to promote an anti-gun agenda.\n\n\"It has been really disheartening to see in a matter of minutes how this story became politicised,\" Mr Edwards said.\n\n\"This is a community that is absolutely heartbroken right now and you've got people who are trying to turn this tragedy into some sort of political advantage for them[selves]. I just think it's gross.\"\n\nHe went on to call new gun laws \"the wrong response to take here. I think it shows a lack of shared humanity\".\n\nMr Noir was even more aggressive in the video.\n\n\"Let's face it, the gun issue is nothing less than low hanging fruit for Hillary and the rest of the gun control zealots,\" he says.\n\n\"She can stand on top of the gun control issue, beat her chest and make it sound like she is talking about something, when she is not, and it is getting disrespectful that you think American people are that stupid.\"\n\nIn an allusion to the controversy over Ms Clinton's use of a personal email server as secretary of state, he adds: \"So do me a favour, take all of those useless gun control laws, type them up in a neat little email and then delete them.\"\n\nOf the man who killed Parker and Mr Ward, he says, \"This man's issue wasn't a gun, the same way a morbidly obese person's isn't a spoon or fork.\"\n\nMr Noir is not an official spokesman for the NRA, but a paid advocate who hosts a YouTube channel with more than 313,000 subscribers.\n\nA self-described \"urban gun enthusiast \" in his early 30s, he has become one of the most visible faces for an organisation that is usually associated with, as he puts it, \"old fat white guys\".\n\nMr Noir, whose real name is Collins Idehen, is a native of Houston, Texas, and a practising attorney who earned his law degree from Texas Southern University's Thurgood Marshall School of Law.\n\nHis show – called Noir – is designed to appeal to minorities and young people, two demographics that do not show great support for the NRA.\n\nThe NRA has been contacted for comment.\n\nFollow FairfaxForeign on Twitter Follow FairfaxForeign on", "source": "Merredin Wheatbelt Mercury"}