{"published": "2015-09-24T00:35:43Z", "media-type": "News", "title": "Netflix knows how long it takes to get you hooked on a show", "id": "c6c111bd-7109-4089-ada9-6e0d9c8cfe81", "content": "Streaming service has crunched the numbers and has come up with a nifty equation that pinpoints the moment audiences commit to watching a show all the way to the end. \n\nUnlike traditional television, which puts viewers on a slow-drip diet of one or two shows a week, Netflix lets you hit the entertainment heroin as hard and as frequently as you want.\n\nAnd it knows exactly how long you need to inject a stream into your main vein (your brain), before you get hooked.\n\nThe streaming service has crunched the numbers and has come up with a nifty equation that pinpoints the moment audiences commit to watching a show all the way to the end.\n\nNetflix analysed data from January to July of this year in countries including Brazil, Belgium, Canada, Denmark, Finland, France, Germany, Ireland, Mexico, the Netherlands, Norway, Sweden, the UK and the US. It took data from Australian and New Zealand accounts used between April and July.\n\nIt defines \"hooked\" as when 70 per cent of viewers who watched an episode went on to complete season one.\n\nNetflix identified the hooked episodes first by country and then averaged them out to create a global hooked episode.\n\nSo how does Australia stack up?\n\nLike most recreational drugs, different shows have different effects on viewers, and the data on the addiction equation therefore is a little all over the place. How long it takes to get addicted to a show on Netflix depends on the type and strength of the show.\n\nAccording to the streaming company, Australians — we of discerning tastes — apparently remain eminently more resistant to the binge than our American brothers and sisters. \n\nIt takes Australians one-to-two more episodes per show than the rest of the world before they are hooked. Australia takes six episodes of Daredevil to get hooked, whereas the rest of the world took five. It took the rest of the world only three episodes to get hooked on House of Cards. It took Australia five.\n\nThe resistance rate was slightly lower for ensemble dramedy Orange is the New Black, it took Australia only four episodes to get hooked. It only took three to hook the rest of the surveyed countries.\n\nSurprisingly, the threshold for Netflix addiction was lowest in Australia for legal drama Suits and thriller The Killing, which took just three episodes to hook viewers into completing the entire series.\n\nCrunching the numbers, Netflix also revealed the diminishing power of the pilot. Contrary to popular opinion, pilots are not what get viewers hooked, at least not according to Netflix' numbers.\n\n\"Given the precious nature of primetime slots on traditional TV, a series pilot is arguably the most important point in the life of the show,\" said Ted Sarandos, Chief Content Officer for Netflix. \"However, in our research of more than 20 shows across 16 markets, we found that no one was ever hooked on the pilot. This gives us confidence that giving our members all episodes at once is more aligned with how fans are made.\"\n\nThis is a pretty interesting revelation by Netflix that supports the serialisation of entertainment.\n\nIt supports the idea that consumers that subscribe to TV streaming services have a longer attention span than traditional television studies assume.\n\nIt also means content creators get second, third, fourth and sometimes even fifth chances to impress viewers.\n\nThe data compiled by Netflix has the potential to create new metrics for TV viewing. Instead of counting the number of eyeballs on a particular show at a particular time, this data allows Netflix and other streaming services to measure a level of engagement and commitment not given priority in traditional entertainment measurements.\n\nHowever, I do wonder what this means for the old fashioned movie.\n\nStudios tightening their belts, producing less movies per year is already helping to hasten the demise of the action film, according to The New York Times \n\nBut with the Netflix-isation of entertainment, could this data encourage a move away from film altogether? What will this do to the quality of independent cinema? Studios are already dependent upon the Marvels and LEGO movies of the world to fund the rest of their cinematic portfolio.\n\nI can't imagine this data from Netflix is going to do anything to reverse those numbers.\n\nFollow Digital Life on Twitter The story first appeared on The Sydney Morning Herald.", "source": "Eyre Peninsula Tribune"}