{"published": "2015-09-07T15:14:18Z", "media-type": "Blog", "title": "A Labor Day Salute to Diversity", "id": "8af97503-8a66-483b-b364-a1f2b207d7a7", "content": "Recently,  Corrine Bauer and Pat Melody, members of my Mindfulness Meditation Group,  held a vigil on behalf of Hispanic immigrants locked up in the Ramsey County Adult Detention Center. Thanks to Corrine and Pat for being mindful of the welfare of others. I'm re-posting the text below from Labor Day 2007 as it continues to be relevant in the context of the status of immigrants in this country and around the globe. Too many Americans oppose immigration as they fear competition for jobs from immigrants seeking safe haven within US borders. The success of an initiative by my employer a few years ago should lay those fears to rest. Nevertheless, we continue to harass Hispanic immigrants in the US, while around the globe, Syrian refugees are too often turned away. Picture this: I’m a young WAF assigned to clerical duties in an office on Scott Air Force Base, near East St. Louis, Ill. On this particular morning I overhear an Air Force major and a colonel, both Caucasian, discuss the qualifications of a civil service employee under consideration for promotion; the colonel apparently likes her resume. Then he asks, “Is she Caucasian?”\n“Negative,” the major replies.\nHere's the deal: I’m a Caucasian who grew up in lily-white, rural northwestern Ohio, and this was the first time I’d seen up close the ugliness of racial discrimination. Stunned, I sat there at my typewriter, trying to focus on my work.\n(In the weeks that follow, I notice the employee in question is not promoted.)\nOn the upside, my stint in the military provided my first opportunity to make friends with members of other races and ethnic backgrounds.\nI’ve not forgotten Hispanic Maria Venegas; African-Americans Katie Harmon, Annie Terry, and Adeline Lincoln; Parisian French Caucasian Monique Horlaville; and New Orleans French Caucasian Priscilla Bertrand.\nYears passed before I encountered a comparable diversity in civilian life ― diversity fostered intentionally in the regional office of a large corporation located in a thriving upscale suburb.\nAdmittedly, the company’s motives were more practical than altruistic. At a department meeting, Tony, our African-American assistant manager, asked if any of us knew what was behind the diversity initiative. He rolled his eyes when I suggested that our company supported diversity because it was the right thing to do.\nTony then explained the business case for diversity: “If we want to sell our products to the Hmong community, African-Americans, Hispanics, Gays, women, or other minority group, we’d best include their members in our workforce.”\nAltruistic or not, it’s amazing how quickly people can adapt to an inclusive environment when their livelihoods are at stake and before long, the 2000 plus employees in that huge office building formed a genuine community featuring many of the amenities and rituals of a small town.\nSad to say, our community ― by then a model of diversity ― became a casualty of corporate downsizing when, thanks to technology, our work was moved elsewhere. But for quite a few years each of us had good cause for celebrating Labor Day.\nPerhaps the time will come when a majority of Americans will have matured sufficiently to create similar communities, whatever their context, purely because it’s the right thing to do.    Posted by VIRGINIA BERGMAN at 6:44 AM No comments: Links to this post Email ThisBlogThis!Share to TwitterShare to FacebookShare to Pinterest   Labels: African-American, Air Force, civil rights, community, corporate downsizing, diversity, equal opportunity, Gays, Hispanic, Hmong, inclusive, Labor Day, military, minority groups  ", "source": "Katalusis"}