{"published": "2015-09-04T22:30:51Z", "media-type": "News", "title": "7 things you didn't know about matcha", "id": "646c394e-7631-4e27-96eb-d97463c5177a", "content": "What’s not to like about matcha? It’s been around for thousands of years, is full of elements to have you feeling your best, and can be enjoyed in dozens of different ways. It might be time to tap into the “matcha madness” and discover its magic for yourself! 1. Not your ordinary tea Matcha (pronounced “MA-cha\") is a kind of green tea. However, unlike regular tea, in which the leaves are steeped in hot water and then disposed of, matcha leaves are ground into a fine powder. This way, the entire leaf is used, amplifying the positive effects of the drink. 2. Ancient origins Ancient Origins Matcha isn’t some new fad — in fact, this tea has been sipped for thousands of years. Matcha originated in the Tang Dynasty in China, where the leaves were harvested, pulverized, and then blended into hot water with a bamboo whisk. (We think they were on to something!) 3. Matcha in the marketplace Today, most matcha originates from Japan. The highest quality is grown organically and hand-picked in early spring. Matcha is available at most tea shops, health food stores, and even online!  4. It's all in the antioxidants Most people are familiar with the benefits of consuming antioxidant-rich foods, such as boosting your immune system and decreasing risks of diseases like cancer. Since matcha is so highly concentrated, it’s much more potent — 137 times more than regular green tea, according to this study. Delicious and nutritious? That’s a win in our book. 5. Boost your \"zen-ergy\" Not only does matcha help your immune system — it can also boost your energy and help clear your mind. A unique property of matcha is that it contains L-Theanine, an amino acid that works with cayeine to leave you in a calm-yet-energized state of mind. What better way to start your day? 6. Matcha’s many forms While matcha is traditionally enjoyed whisked into some hot water, matcha and food enthusiasts alike have found dozens of ways to enjoy the tea in other ways. Smoothies, ice cream, and even cupcakes have all undergone a major matcha makeover, and we like what we see.", "source": "Coldwater Daily Reporter"}