{"published": "2015-09-15T07:11:49Z", "media-type": "News", "title": "AllianceBernstein adds to liquidity warnings as US Fed lift-off looms", "id": "15d398e6-ff28-40f1-9067-55a249217e1b", "content": "A series of interest rate increases in the US could trigger asset selling that would dry up liquidity and lead to big losses for investors, the head of global credit for US-based investment manager AllianceBernstein​ says. \n\nAshish Shah said although the long-anticipated start to monetary tightening by the US Federal Reserve was unlikely to force panic selling, it could signal the start of renewed volatility in risk assets such as corporate bonds and overpriced growth stocks. \n\nThese have proved popular among yield-seeking investors – particularly from the retail side – since the advent of quantitative easing (QE), or bond buying, by the Fed and other central banks in the wake of the global financial crisis. \n\nWhile the QE programs brought stability to sovereign bond markets and long-term financing, they had also given rise to crowded trades in credit, equity and other markets, Mr Shah said. \n \nWhen financial markets are liquid, the easy match-up of buyers and sellers means pricing and timing suits both parties. However, a market event which triggers mass selling of an asset can quickly drive down prices if vendors far outnumber buyers.  \n\nThe decline of proprietary trading by US investor banks because of regulatory changes had compounded problems of illiquidity, Mr Shah said, as had a growing tendency by fund managers, exchange-traded funds (ETFs) and other retail investors to trade bonds rather than hold them to maturity. \n\nEven large institutional investors such as insurers and pension funds, which normally looked to cover long-term liabilities with long-dated investments, had become more skittish in times of market upheaval, he said. \n\nThe explosion in the popularity of ETFs had also widened the universe of investors looking to move in and out of assets to pocket short-term gains rather than sit on their investments, he said. \n\n\"The challenge with that is that they don't feel any transaction cost when they're allocating the risk; they go online, they click and they change an allocation,\" Mr Shah said. \n\nHis comments are the latest from a range of fixed-income experts to warn of price gyrations when the Fed's first tightening cycle in almost a decade gets under way.  \n\nA sell-off in emerging market and other high-risk assets in 2013 when the Fed first signalled it would wind down what became its $US3.5 trillion QE program gave the world a taste of what could ensue when the central bank actually started lifting interest rates. \n\nThe flight to safe haven assets became known as the \"taper tantrum\". \n\nFutures market pricing suggests the Fed will not lift interest rates at this week's Open Market Committee meeting, which ends early on Friday Australian time.  \n\nMr Shah agreed with this, but expected chairwoman Janet Yellen to leave no doubt in her statement about when and how the central bank would begin the tightening cycle. \n\n\"The market reacted very violently when the Fed talked about tapering,\" he said. \n\n\"But the reality of tapering was actually quite constructive while it was going on. \n\n\"I think [the Fed] would be better off hiking in the near-term, just to get it out of the way.\"", "source": "Brisbane Times"}