{"published": "2015-09-22T11:24:10Z", "media-type": "Blog", "title": "Gbege!!! Label Sues Zeez For Breach Of Contract", "id": "f10fa099-0c3b-4b17-b9a6-b46d7879a0ec", "content": "Ent News Gbege!!! Label Sues Zeez For Breach Of Contract\nBy Bilo -\nSep 22, 2015\n0\nA few weeks ago, Zeez was billed to host a show in Houston, U.S.A. However, there are reports from an anonymous source who claimed that the organizers in USA received a letter from the law firm representing HF Music, the record label Zeez is currently signed to, informing them that Kingsley Elikpo, a.k.a Zeez, has a case currently pending in court, instituted against him by his label for breach of contract.\nIn the letter, the record label urged the organizers of the show not to allow itself to be used to flout the authority of the court by allowing Zeez to perform at their show; warning that their involvement in the illegality would render them liable for luring Zeez to breach his contract with HF Music, and that they should desist from such action.\nFrom our investigations on the report, we were able to find a document which shows that HF Music had indeed filed a lawsuit against Zeez following his inability to meet his obligations as outlined in his contract for some time, and rumour has it that it was an uphill task for the label to get him into the studio to even record the 6 track EP which was released last year November.\nAn anonymous source disclosed that “Zeez acts more like a model than a recording artist due to lack of focus, dedication and commitment to his craft. “It sometimes appear as though he has lost the drive and is simply wasting the label’s time and resources.  A one-page apology letter he wrote to the label earlier in the year in which he admitted to gross misconduct testifies to this fact,” The source concluded.\nOur investigations further revealed that Zeez has been truly served the court processes, including the motion for injunction to restrain him from performing at shows and engaging in music-related business with other persons or organisations in violation of his contract with HF Music. Zeez, in an affidavit submitted to the court, denied that he was performing shows for other organizations (paid or free) without the label’s consent. However, we found some event/concert posters (which clearly shows his image and name printed on the bill) and videos of Zeez’s performance at shows on his Instagram page so whether it was with or without the label’s consent is what we are yet to find out.\nStick around for more information as the story unfolds.\nTAGSHF Musiczeez\nSHARE\nFacebook Twitter Previous articleNew Music: Bolson - This Feeling (Prod. By GospelOnDeBeatz)\nNext articleNew Music: Young D - Shaba Ft. Ayo Jay & Timaya\nBilo\nThe T in perfect et complete.... God's Craft! CONNECT WITH ME ON TWITTER @BILO_MILOV1\nRELATED ARTICLESMORE FROM AUTHOR\nNew Music: Harmonee | Obim ft. Zeez\nNew Video: Zeez – Madam\nVIDEO: Zeez | Ba Mi Jo", "source": "Jaguda.com"}