{"published": "2015-09-20T17:21:24Z", "media-type": "News", "title": "Last Post, September 21", "id": "a4e53794-51ca-49bb-a2c3-0a7fc028ec56", "content": "Thank you, Malcolm. With the announcement of your cabinet I had hoped for a breath of fresh air. You delivered a hurricane. Hold on to your hat, Bill. Geoff Watkins, Subiaco, WA\n\nMalcolm Turnbull is someone I could see myself supporting (“Malcolm not so much in the middle as the centre’’, 19-20/9). But I wont be voting Liberal no matter how good Turnbull is or looks, because he will still be surrounded by clowns and jokers in his ministry.\n\nGraeme Rankin, Holder, ACT\n\nThe true cost of Bronwyn Bishop’s charters must include Tony Abbott’s lost earnings.\n\nKeith Russell, Mayfield West, NSW\n\nJeff Kennett is quoted saying “the public wants to slam shut the revolving door” (“Revolving door: a passing phase or the new normal?”, 19-20/9). If I might channel Sir Bernard Woolley: “You can’t slam shut a revolving door, minister; if you slam a revolving door it just spins faster. But perhaps the metaphor is still apt.’’\n\nAnthony Strahan, Hawthorn, Vic\n\nI would like to suggest to Malcolm Turnbull that it might be an idea to include the LNP logo on his website so we can be clearly assured of his political allegiance.\n\nVal Spencer, Kingscote, SA \n\nMay the Gods that regulate the affairs of the Fourth Estate be thanked for Niki Savva (“Yes, we’re not a banana republic, and no, the system ain’t broke’’, 19-20/9). She is a national treasure.\n\nJohn McHarg, Maylands, WA\n\nAt the next election the Coalition simply has to put up signs with a photo of Bill Shorten with his minders the CFMEU behind him and ask: ‘‘Do you want the CFMEU running Australia?’’\n\nC.H. Ainsworth, Kingscliff, NSW \n\nJudith Sloan, will you marry me (“Arithmetic not really one of the former PM’s strong suits’’, 19-20/9)? No Saturday is fulfilled without your raw analysis and wisdom.\n\nAviva Gordon, Bayswater, WA\n\nThe ad for a managing director of the ABC has the words “disruptive trends” and “strong bias” separated only by a comma.\n\nHenry Street, Latrobe, Tas\n\nMost letters about building new subs stress the job opportunities. I can only assume the defence of the nation is of little, if any, relevance.\n\nJohn Kelly, Wanniassa, ACT\n\nThe invisibility cloak is nothing new (“See here, invisibility now a reality’’, 19-20/9). All Blacks captain Richie McCaw has been wearing one for years in front of all referees, who can never see him off-side in the ruck.\n\nBrian Kable, Mt Gravatt, Qld", "source": "The Australian"}