{"published": "2015-09-26T02:27:09Z", "media-type": "News", "title": "Cancer Society praises Guelph’s action on radon gas", "id": "559ee2e2-67e2-4b47-94e1-795aff43512a", "content": "TORONTO — What would you do if you found out your home might be harbouring a substance known to cause lung cancer? According to a recent survey commissioned by the Canadian Cancer Society, 51 per cent of Canadians would move if they found out there was radon — an odourless, colourless, cancer-causing gas — in their home. Yet 96 per cent of those surveyed have not had their homes tested. And the consequences could be deadly.\r \n \n\r\n                            Radon is found in certain soils and rocks and is released as they break down. It then seeps into buildings through foundations, joints and vents. Over time, exposure to radon can lead to lung cancer. In fact, this silent health hazard is the second-leading cause of lung cancer (with smoking as the primary cause).\r \n \n\r\n                            That's why in 2014, Health Canada tested for radon across the country and found that 6.9 per cent of homes in Canada have unsafe levels of the gas. One of those radon hotspots was Guelph. \r \n \n\r\n                            \"The results of Health Canada's testing showed 18 per cent of the 131 buildings in Guelph exceeded safe levels of radon,\" said Nicholas Rosenberg, technical services specialist with the City of Guelph. That result, he says, warranted action.\r \n \n\r\n                            The resulting action was Guelph's new radon mitigation program, which came into effect on Sept. 1. The program gives builders three radon mitigation options for all new builds. It's a move Dave Brix, president of Guelph's Terra View Homes, applauds.\r \n \n\r\n                            \"Until now, we have informed people about radon and given them the option of having a radon pipe installed in their basements,\" he said. \"It's a problem that's easily mitigated in the planning and building stage.\" And though there are no retrofit requirements for existing buildings, the city is offering to pay for first and second testings for all buildings in Guelph.\r \n \n\r\n                            That's precisely the kind of action the Canadian Cancer Society would like to see when it comes to radon. And, as Canadian Cancer Society spokesperson, Karen Griffiths explains, people need to put concerns about radon — responsible for 850 deaths in Ontario each year — on the political radar.\r \n \n\r\n                            \"We're looking for people to go to their local hardware store and buy a radon testing kit,\" she says. \"We're also looking for the Ontario government to harmonize the Ontario Building Code with the National Building Code because it has stronger measures to mitigate the risks of radon.\"\r \n \n\r\n                            Taking action is simple. Just go to takeaction.cancer.ca and let your MPP know your concerns about radon.\r \n \n\r\n                            \"Health Canada has already done the testing for radon,\" points out Rosenberg. \"It was not good news to find out that we have a radon problem in Guelph, but I'm proud of the work we are doing to address it.\"", "source": "Guelph Mercury"}