{"published": "2015-09-17T01:42:30Z", "media-type": "News", "title": "All Blacks uniform judged best of Rugby World Cup teams", "id": "80ad41f1-e699-42f3-ab86-513212dcc4cc", "content": "The All Blacks jersey has been rated No 1 for the Rugby World Cup. \n             \nThe All Blacks find themselves No 1 in the fashion stakes when it comes to Rugby World Cup uniforms. \n \nLondon's Telegraph  newspaper has run the rule over the 20 uniforms that will be on display and rated New Zealand's totally black outfit No 1. \n \nThey described the All Blacks jersey as \"one of sport's most celebrated and storied objects\" with the latest edition incorporating a tribute to the 1905 Originals. \n \n\"Yes, the mythology can be a bit wearisome in the end but if the purpose of a sporting uniform is to make its wearers look scary, unbeatable, awe-inspiring and downright brilliant, then this one does the job. Any colour, as long as it's black.\" \n \n READ MORE: \n* 10 players braced to light up RWC   \n* All Blacks tall timber chase squirrels \n* NFL scout seeks RWC 'Lomus'  \n \nThey gave it a 9.5 mark out of 10 for style rating, the only deduction coming from the tight fit. \n \nThe All Blacks have dropped the white collar from their 2011 cup-winning jersey and removed the white hoops from the top of their socks to give an even darker look to their defence of the title. \n \nSamoa's \"stunning\" blue jersey, with a tribal theme, rated No 2 and \"came straight out of a superhero comic book\", according to the reviewers. \n \nNamibia, the lowest-ranked team in the tournament and a pool opponent of the All Blacks, surprisingly took third with a red, white and blue ensemble that was \"easy on the eye\". \n \n RUGBY WORLD CUP ZONE: \n*   Play fantasy rugby with Stuff \n*  Stuff's RWC printable wallchart \n*  RWC standings and fixtures  \n \nHosts England were fourth with their all white uniform \"looking very smart...until the first visit to the turf, anyway.\" \n \nDouble World Cup winners South Africa and Australia didn't far too well. The Springboks were eighth and the Wallabies 14th. \n \nThe United States came last with their jersey likened to a \"cheap polo shirt\" rather than something more appropriate for an  \"elite-level sportsman\" and rating only two out of 10. \n    \n- Stuff \n             \r     Comments", "source": "Dominion Post"}