{"published": "2015-09-29T07:55:22Z", "media-type": "News", "title": "£50m benefits going unclaimed in Stoke-on-Trent, claims...", "id": "c2c5fc72-7155-4a3b-96cb-d72bc0120c7e", "content": "The Sentinel revealed yesterday that more than 60,000 people in Stoke-on-Trent don't have enough money to live on. Today, PHIL CORRIGAN continues his week-long series on the city's poverty problems with a look at the benefits system. \n\nADVICE on benefits and other financial issues could help improve the lives of the poorest people in Stoke-on-Trent, according to a new report on poverty. \n\nThe city's Hardship Commission estimates that £50 million in benefits is going unclaimed every year – which is the equivalent of £200 for every man, woman and child in the Potteries. \n\nIn their initial report, the commissioners recommend that more efforts should be made to maximise the take-up of benefits in Stoke-on-Trent, in order to ease the hardship faced by families and individuals who are struggling to make ends meet. \n\nCommissioners believe that along with confusion over what they may be entitled to, claimants can also experience negative attitudes due to portrayals of them as 'scroungers'. \n\nThose on low-incomes are also less likely to be 'active consumers', in that they cannot shop around for better deals for things such as utilities, due to a lack of access to the internet access or a bank account. \n\nA Financial Inclusion Group will now build on the report and advise the Hardship Commission on ways to minimise costs and maximise income for those facing hardship. \n\nThe report states: \"The most significant factor associated with non-take up appears to be the level and accuracy of knowledge about an entitlement and its eligibility rules, linked with the perceived cash value of the benefit when compared to the effort involved in claiming and maintaining entitlement. \n\n\"Take-up rates can be improved by increasing the level of knowledge about entitlements and the eligibility rules and by reducing stigma and the complexity of claiming. Local initiatives are most effective.\" \n\nVoices Of Stoke is a lottery-funded project which seeks to help residents who are facing multiple complex needs, such as through assisting them in claiming benefits. \n\nAndy Meakin, director of the Stoke-based project, believes that increasing an individual's income even by a small amount could make all the difference. \n\nMr Meakin said: \"Being poor actually limits a person's choices. Sometimes all they have is a choice between two negatives options. \n\n\"For example, they might not be able to afford the bus fare to get to a job interview. \n\n\"That's why we support the recommendations in the report, such as trying to help people maximise their benefits. Something like that can enhance people's choices, by giving them just a bit more money. \n\n\"The Hardship Commission's report highlights a lot of the issues that come through our door, particularly in terms of the increased negativity towards people on benefits. Things like Benefits Street give the impression that people are making the choice to be poor, and that they could make the choice not to be poor.\" \n\nMary-Anne Rapson is a carer for her son Arthur, who has special needs, and is currently dependent on benefits, including Carer's Allowance and Income Support. She believes there is a widespread lack of understanding of the difficulties faced by people reliant on welfare. \n\nThe 41-year-old, of Sneyd Green, said: \"I tried working as a bookkeeper but there was no way I could work enough to make it worthwhile. \n\n\"People might say that I made the choice to look after my son, rather than put him in care. I was speaking to a friend about going on holiday, and she was saying that the taxpayer should not have to pay for me to go on holiday, when she works full-time and struggles to afford things like that. \n\n\"But what people don't understand is I'm actually saving the state hundreds of pounds a week by taking care of Arthur. It's not like I'm sat at home watching TV. And I do volunteer for Stoke-on-Trent Foodbank as well.\" \n\nUniversal Credit is set to replace the six main means-tested benefits in Stoke-on-Trent from next February. \n\nAbi Brown, cabinet member for finance at the city council, said: \"We will be looking at all the recommendations. The introduction of University Credit next year will be a good opportunity for us to review the way we help people understand benefits.\" \n\n* Read more of today's top news stories here. \n\nFollow us on   Facebook   and   Twitter \n\nLooking for a job? * Check out our jobs channel. \n\nDownload The Sentinel Evening Edition App from the App Store or Google Play store now.", "source": "The Sentinel"}