{"published": "2015-09-01T06:28:54Z", "media-type": "News", "title": "Working stronger, for longer", "id": "b6500365-191a-421c-94f6-aefd532fa81c", "content": "A few extra years in the workforce – including in part-time work – can boost incomes in retirement significantly, writes Clancy Yeates. \n  \nWorking for longer is worth thinking about. Photo: Glen Hunt  \n   \nTreasurer Joe Hockey is urging more Australians to continue working until later in life, and it seems some are taking his advice. But putting aside what Hockey may think, experts say working for longer, including  in a part-time job, can have a surprisingly big impact on retirement income. \n \nSubscribe to Money’s weekly newsletter , delivered to your inbox every Wednesday \n  \nRising  numbers of Baby Boomers are deciding to extend their working life, official figures show. \n \nThe proportion of 60 to 64-year-olds in the labour force has jumped from 45 per cent in 2008 to about 55 per cent today, and more people aged 65 and over are working, too. \n \nPart-time work is also becoming more common.The share of people aged over 55 in part-time work has risen from 35 per cent to 37 per cent, as shown in the graph from the Commonwealth Bank. \n \nNo doubt this is encouraging news for Hockey and the Treasury boffins, who are nervously eyeing the mounting cost of medical care and pensions as the population ages. \n \nHowever, working for longer can also make financial sense for an individual. \n \nThat is because a few extra years in the workforce – including in part-time work – can boost incomes in retirement significantly. \n \nWorking for longer lifts retirement income in two main ways. It allows you to save up a larger sum of money – such as by making extra contributions to superannuation. Plus, it means the spending of your retirement savings is spread over fewer years. \n \nThe head of retirement income solutions at Towers Watson, Nick Callil​, uses the hypothetical example of someone who is 60, and is thinking about retiring. \n \nIf they retire at 60, they'd be converting their super savings into an income stream of about $32,500 a year. Working for another two years would lift this significantly. \n \n\"If that person retires at age 62 rather than 60, the income goes up to about $34,600, which is a 6.6 per cent increase,\" he says. \n \nThe numbers Callil sets out take into account the age pension's means test, which pares back the pension payments  our  hypothetical worker gets. \n \nBut what about part-time work? \n \nCallil says that as workers get older, the bigger impact on retirement savings comes from delaying drawing down on your pool of savings, rather than the extra money you contribute to savings. So, working part-time can still give retirement savings a healthy boost. \n \nOf course, plenty of people don't want to work longer. And it's not always a matter of choice: some can't because of the physical toll of labour-intensive work. But the figures suggest that if it's possible, and a priority, it can lift your income later on. \n \n\"What these numbers show is that in terms of self-provision and the system working for you, as against being forced to keep working, it's worth thinking about if you're capable of doing it,\" Callil says. \n \n@clancyyeates  ", "source": "Brisbane Times"}