{"published": "2015-09-30T10:46:27Z", "media-type": "News", "title": "Hindi Ka Nag-Iisa", "id": "ee1a8213-9840-4537-952e-dd09a9be316b", "content": "CONFUSIONS ABOUT MULTICULTURATION \nJan Pakulski \nJournal Sociology 2004, Vol. 50(1) 23-36 \nCRITIQUE PAPER \n\nSubmitted to: Prof. Jennelyn Gomez \n\r\nGood Samaritan Colleges City of Cabanatuan, Nueva Ecija \n\r\nIn Partial Fulfillment of the Requirement in Ed 106 Social Dimensions in Education \n\r\nSubmitted by: Mary Joy V. Lumbania \n\nPurpose of the Study \n\r\n\tThe purpose of the study is to provide a clarification of the original meaning of multiculturalism as adopted in Austria. By means of a careful review of theoretically relevant literature and through different sociologist views about multiculturalism. This study seeks clarification about what will happen to Australian if they embrace multiculturalism.   The purpose of this study is to know the main goal of multiculturalism in Australian. \n\r\nApparatus and Procedure \n\r\nResults \n\r\n\tThe clarification about the confusions of multiculturalism is not clear. The study is ended up in wide comparative analysis, comparing the outcomes in societies when Australian embraced the multiculturalism. After studying the possible outcomes of multiculturalism the Australian interpreted the multiculturalism as a form of ‘social contract’ between the majority and the diverse minorities. And the ‘social contract’ is about the majority accepts and protect minorities, affirms cultural differences and supports a degree of the majority. Law, justice system, parliamentary democracy and market economy is involves in the ‘social contract’. \n\r\nConclusion \n\r\n\tThis paper suggests that multicultural has good effect in Australian. Multiculturalism’s main goal is to respect the diversity in Australia. Australian multiculturalism has always been ‘reciprocal’ in the sense of promoting both rights and duties/obligations. These rights are spelt out in a more explicit manner, including ‘the freedom to choose and maintain one’s own cultural identity’. Multiculturalism involves respect for cultural differences and sense of belonging and attachment to a particular way of...\r \n\nView Full Essay", "source": "TermPaperWarehouse.com"}