{"published": "2015-09-25T20:20:13Z", "media-type": "News", "title": "Modi hardsells India dream to America Inc", "id": "5a3e6c7a-562f-4524-aad5-b2972373a337", "content": "UNI \n \n  \n \nNEW YORK \n \nIt was a day full of business for Prime Minister Narendra Modi on the second day of his six-day official visit to the United States. \n \nMedia moguls of the world on Friday lined up to meet Modi here, followed by a series of bilateral meetings that he had with the leading CEOs of US-based companies. \n \nThe Prime Minister gave a sneak-peak into the flagship programme of his government, aptly balancing India’s interest with expectations that the US Inc may have with the country of 1.3 billion people, a market which they are keenly looking at. \n \nThe Prime Minister observed that the changes in technology in media in recent times have led to an enormous democratisation of knowledge. \n \nHe said the world was now technology-driven society where growth of digital infrastructure is as important as the growth of physical infrastructure. He suggested to the CEOs that India represents both the biggest opportunity and the biggest challenge for them and urged them to keep regional languages in mind as they develop their content and as they firm their investment plans for India. \n \nHe also spoke of the government’s vision for Digital India, the plan to connect 6,00,000 villages through broadband connectivity and he asked the CEOs to visualise the citizens of the 21st century and think about what values they will represent and what challenges they will face. \n \nModi also spoke of the role that digital technology could play in human resource development and further strengthening democracy and in India’s development narrative. He also gave a number of suggestions to them in terms of how media and communications companies could be part of nation’s development story. One idea that he gave was that a communication university could be setup in the country, which could then help further progress in the areas that they are really interested in. \n \nThe round table meeting on media, technology and communications, the growth story for India was attended by range of CEOs including Rupert Murdoch, the Executive Chairman of Newscorp and 21st Century Fox, his son James Murdoch, CEO of 21st Century Fox, Robert Thomson, CEO, Newscorp, Uday Shankar, CEO Star India, David Zaslav, President and CEO, Discovery Communications, Michael Lynton, CEO Sony Entertainment, Michael Roth, CEO Interpublic Group of Companies, Shane Smith, CEO, Vice Media, Martin Sorell, CEO, WPP, Jeff Bewkes, CEO, Time Warner, Nancy Dubuc, CEO, A+E Networks, Anthony Pratt, Chairman, Visy Industries, William Duhamel, Route One Investment Company and Jeff Ubben, CEO ValueAct Capital. \n \nAs James Murdoch himself summed it up, 40 per cent of the world’s entertainment industry was present in that room and this was a combination of executives dealing with media and entertainment and also executives who are venture capitalist and investors in media related companies. \n \nAfter finishing the meeting with media honchos, Prime Minister had a series of bilateral meetings with the leading CEOs of US based companies. \n \nExternal Affairs Ministry spokesperson Vikas Swarup said in a media briefing that 42 of the world’s leading CEOs of Fortune 500 companies were together in that one room. “I was told that the net worth of all the companies put together is USD 4.5 trillion,” he said.", "source": "Navhind Times"}