{"published": "2015-09-08T13:02:02Z", "media-type": "News", "title": "HydroRevolution Announces A Direct Public Offering To Construct California's First Solar Desalination Plant", "id": "987b0468-955c-415d-acb3-53f78486f61f", "content": "This marks the first time a DPO has been used for a desalination project and made the purchase of dividend-yielding shares available to the general public. Profits from the sale of water will be distributed through a dividend to preferred shareholders. \"We can shape the future when it comes to water and this public offering allows professional investors, as well as individuals, to directly participate in delivering a sustainable source of water in California ,\" said Aaron Mandell , Chairman of WaterFX and Member of the Board of HydroRevolution SM . \"Being a part of this water revolution will provide more than just a financial return, it will put California on a course towards water independence,\" continued Mr. Mandell.Â  \n \nThe DPO is a State of California registered Qualification by Permit (permit #3499), regulated through the Department of Business Oversight. This investment platform enables HydroRevolution SM to sell shares to both accredited and non-accredited investors in California . The company is issuing $10 million of preferred equity and anticipates raising $20 million in debt financing for the construction of the project. In keeping with the company's open source philosophy, participation in the HydroRevolution project is open to the California public and the company will be majority owned by California residents upon close of the campaign. The investment is also open to organizations, foundations and corporations based in California . \n \nThe company is offering up to 2,000,000 shares of Series A Preferred stock at a price of $5 per share. The HydroRevolution DPO has several investment benefits, including a fixed annual yield, just like a public stock dividend, and protections that ensure proceeds are only deployed for construction of the plant. The minimum investment in HydroRevolution SM is $2,000 (400 shares) for non-accredited investors and $5,000 (1,000 shares) for accredited investors. The stock is non-voting and provides a 6% annual dividend. Proceeds from the DPO are to be held in a third party managed impound account until the company meets pre-determined conditions. The DPO campaign will run for a period of up to one year, but may be terminated early once the offering has been fully subscribed. \n \nThe HydroRevolution SM plant is the first commercial solar desalination plant to be constructed in California . At full scale, the plant will occupy up to 100 acres of land in the Panoche Water and Drainage District and produce 5,000 acre-feet of freshwater per year, enough water to satisfy 10,000 homes or irrigate 2,000 acres of cropland. The system is capable of treating water with greater than 90% recovery rate, isolating salt and mineral by-products for downstream commercial uses. The plant expands on the demonstration project operated by WaterFXâ„¢ in 2013 in the Panoche Water and Drainage District. The expansion will utilize clean, solar energy to treat irrigation drainage water from 6,000 acres of salt-impaired cropland and generate a new supply of freshwater for the district. WaterFX is providing the technology for the project and will service and operate the plant through a partnership with ATSI Engineering.Â  \n \nUnlike conventional desalination plants, HydroRevolution SM will not treat seawater; rather it will draw from a replenishing supply of shallow irrigation water, known as subsurface drainage water, which has previously been unusable. Irrigation drainage water is a natural consequence of agricultural activities but poses a serious threat to cropland, wildlife and waterways in the Central Valley as its high salinity content can damage freshwater ecosystems. By treating this source of water, HydroRevolution SM will help farmers solve two difficult problems: obtaining a consistent and reliable source of freshwater and restoring impaired ecosystems. Without this solution, an additional 10% of farmland in California will have to be retired every year to create additional storage for untreated drainage water. \n \nBehind the HydroRevolution SM plant is the Aqua4â„¢ technology, a concentrated solar still developed by WaterFXâ„¢, that harnesses the energy from the sun to produce thermal energy, which powers the distillation process. As the solar receivers capture solar thermal energy, mineral oil is heated and carries thermal energy to the heat pump that optimizes energy efficiency and feeds heat to a multi-effect distillation system (MED). The MED evaporates freshwater from the water source and the condensate is recovered in the form of purified water. The system is capable of freshwater recovery rates higher than 90%, the remaining brine is further treated to isolate salt and mineral by-products and eliminate liquid discharge. \n \nMedia representatives can contact Ivy Wisner , teamwaterfx@mercury360.com , (415) 580-3089, for more information or to set up interviews with company representatives Â  \n \nCalifornia residents interested in investing in HydroRevolution offering can visit www.hydrorevolution.co to learn more. \n \nDISCLAIMER: These securities are offered only to California residents who meet certain suitability standards and other requirements pursuant to the Department of Business Oversight permit #3499.Â  THE COMMISSIONER OF THE DEPARTMENT OF BUSINESS OVERSIGHT OF THE STATE OF CALIFORNIA DOES NOT RECOMMEND OR ENDORSE THE PURCHASE OF THESE SECURITIES. This is not an offer to sell or a solicitation of any offer to buy any securities. Offers are made only by prospectus or other offering materials. To obtain further information, you must verify your state of residency and, in order to subscribe, you must verify that you meet the suitability standards required by law. \n \nArticle source and copyright ©  PR Newswire Europe Limited, all rights reserved. \nTrademarks, logos, pictures and other items may be copyright of firms mentioned in this article.", "source": "ITbriefing"}