{"published": "2015-09-09T01:21:20Z", "media-type": "News", "title": "30 Red Crescent members complete leadership programme", "id": "d7d2e5bf-71d5-4287-8ca1-42fd26d15618", "content": "THIRTY junior members of the Brunei Darussalam Red Crescent Society (BDRCS) yesterday concluded their participation in the Youth as Agent of Behavioral Change (YABC) programme. \n\nat the Sports Village of the Sultan Hassanal Bolkiah Sports Complex in Berakas.\n\nThe participants, who comprised of students from secondary schools nationwide, received the YABC certificates for completing the programme that was designed to train their leadership skills.\n\nPresenting the certificates to the participants at a ceremony held at the Sports Village of the Sultan Hassanal Bolkiah Sports Complex in Berakas was the former president of BDRCS, Datin Hjh Siti Hajar Pehin Orang Kaya Seri Setia Dato Paduka Hj Mohd Yussof.\n\nSpeaking at the event, the director of BDRCS Youth Development, Ya-Aneta Wati Hj Md Yusof, said that the YABC programme is a prime initiative of the BDRCS to promote a culture without violence as well as to generate youth that have leadership capabilities.\n\nIn her speech, she urged the participants to adopt a positive way of thinking, attitude and behaviour.\n\n“We hope that from this programme they can become an agent of behavioural change, possessing a positive mindset and capable of helping others to become positive,” she said.\n\nShe also announced the establishment of the formal group of YABC under BDRCS with 30 members and two leaders.\n\nSpeaking with The Brunei Times, 16-year-old Sheh Waez Hj Sheh Aubid said that through the programme, participants learned the importance of generating leadership skills.\n\n“The future needs young leaders. We believe this could be achieved in so many ways and changing our mindset to become better is the first step,” said Waiz.\n\nThe five-day programme was organised by officers from the International Federation of Red Cross and Red Crescent, Anne Leclerc and Kum Ju Ho, and was facilitated by three invited Red Crescent officers from Singapore and Egypt.\n\nThe Brunei Times", "source": "Brunei Times"}