{"published": "2015-09-09T16:45:00Z", "media-type": "News", "title": "IASLC Wednesday Press Briefing Summary", "id": "ddf619ef-fca4-4e9c-8cc0-b4854da84f52", "content": ") - Oncology researchers must \"lace up our running shoes,\" to keep up with the fast pace of lung cancer research, said Dr. David R. Gandara, Professor of Medicine, Division of Hematology/Oncology, director, Thoracic Oncology Program, Senior Advisor to the Director, UC Davis Comprehensive Cancer Center, Sacramento, Calif. \n\nDr. Gandara introduced the press conference panel that focused exclusively on the science of lung cancer research and noted that it is unlikely that there will be a single solution to defeating lung cancer. But recent research shows that investigators are refining the concept of \"bench to bedside\" and that the pace of bringing laboratory discoveries into the clinic is accelerating. \n\n\"The evolution of non-small cell lung cancer (NSCLC) subtyping from histologic to molecular based, integration of predictive biomarkers for genomically defined therapies into clinical practice, and translation of improved understanding to immune-biology into checkpoint immunotherapies are all examples of 'bench to bedside,'\" he said. \"Further multidisciplinary collaboration and increasingly international collaboration are imperative to rapid scientific advancement of lung cancer research and treatment. Already, precision medicine based on molecular characteristics of the tumor has dramatically changed the life prospect for many lung cancer patients, and there is much more to come.\"\n\nAdding Monoclonal Antibody to Chemotherapy Treatment Does Not Improve Overall Survival\n\nBetween 2007 and 2013, the research team led by Dr. Wakelee enrolled 1,501 patients with NSCLC. The study randomized patients to receive either chemotherapy alone or chemotherapy with bevacizumab every three weeks for one year. \n\nPatients with resected stage IB (  4 centimeters) to IIIA (American Joint Committee on Cancer (AJCC) 6th Edition) NSCLC were enrolled within six to 12 weeks of surgery and stratified by chemotherapy regimen, stage, histology, and sex. All patients were to receive adjuvant chemotherapy consisting of a planned four cycles of every three week cisplatin at 75 mg/m2 \n\nThe research randomized patients 1:1 to arm A (chemotherapy alone) or arm B, adding bevacizumab at 15 mg/kg every three weeks starting with cycle 1 of chemotherapy and continuing for one year. Post-operative radiation therapy was not allowed. The study had 85 percent power to detect a 21 percent reduction in the overall survival (OS) hazard rate with a one-sided 0.025-level test. The addition of bevacizumab to adjuvant chemotherapy failed to improve survival for patients with surgically resected early stage NSCLC. \n\n\"The study highlights the importance of randomized trials to prove -- or disprove -- the utility of drugs in different stages of disease,\" Dr. Wakelee said. \"With the development of other active agents in metastatic lung cancer, it will be important to investigate them fully in earlier stages and not assume the benefit seen in advanced stage will also be proven in earlier stages, though we can remain hopeful.\"\n\nStopping Smoking Reduces Mortality in Low-Dose CT Screening Volunteers\n\nDr. Pastorino and his team analyzed 3,318 heavy smokers enrolled in LDCT screening efforts. Subjects were divided into two groups: current smokers and former smokers, the latter including ex-smokers at the time of baseline screening and those who stopped smoking during the screening period. \n\nDr. Pastorino developed this study because, while screening programs like the National Lung Screening Trial (NLST) achieved a 7 percent reduction in mortality from any cause with LDCT screening, no study previously examined the impact of smoking habits on screening outcome. \n\nAfter following up with enrolled patients, Pastorino's team noted 151 deaths among the smoking group and 109 deaths among those who had stopped smoking. Compared with the group of current smokers, those who stopped smoking had a 23 percent reduction in mortality. \n\n\"Stopping smoking is associated with a significant reduction of the overall mortality of heavy smokers enrolled in LDCT screening programs,\" he reported. \"The benefit of stopping smoking appears to be three to five-fold greater than the one achieved by earlier detection in the NLST trial.\"\n\nNew Study Reveals Novel Mechanisms of TKI Resistance\n\nA team led by Dr. Daniel SW Tan, Consultant, Medical Oncology, National Cancer Centre Singapore and Clinician Scientist Fellow at the Genome Institute of Singapore, undertook a study performing whole exome and RNA-sequencing to determine genomic architecture of treatment naïve EGFR mutant lung cancers, (N=9, 47 sectors), as well as to elucidate mechanisms of resistance from analysis from a series TKI resistant biopsies. \n\nHe found that EGFR mutations consistently occur in trunks and that these tumors generally had a low-mutation burden across the exome (median 48, Range 9-98). The team also observed short trunks and high clonal diversity amongst East Asian lung cancer patients. Trunk mutations are found across all regions of a particular tumor, whereas private or branch mutations are found only in certain parts of the tumor. \n\nMultiregion sequencing further identified co-existing driver trunk alterations as a possible mechanism for primary resistance in EGFR TKI, which is seen in 10-20 percent of patients with activating EGFR mutations. \n\n\"It is likely that additional subgroups within T790M positive and negative patients such as those with high mutation burden, will further emerge, and may form the basis for novel therapeutic approaches including immunotherapy,\" Dr. Tan said.\n\nEGFR Inhibitor Cetuximab Study Supports a Biomarker-Driven Strategy for Particular Patients\n\nAnalysis of a large Phase III trial (S0819) investigating the addition of a monoclonal antibody targeting the epidermal growth factor receptor (EGFR) to chemotherapy in patients with non-small cell lung cancer (NSCLC) suggests that squamous cell lung cancer patients with tumors positive for the EGFR gene copy number (FISH) have a survival benefit, while non-squamous histology patients and those EGFR FISH-negative derive no survival advantage. \n\nDr. Roy Herbst, Ensign Professor of Medicine, Professor of Pharmacology, Chief of Medical Oncology, Director, Thoracic Oncology Research Program, Associate Director for Translational Research, Yale Comprehensive Cancer Center, Yale School of Medicine, New Haven, Conn. presented the research on behalf of SWOG, a National Cancer Institute-funded national group, and the National Clinical Trials Network (NCTN).\n\nPrevious research demonstrated that cetuximab moderately increases survival in patients with advanced NSCLC. \n\n\"Our prior work suggested that EGFR gene copy number measured by fluorescent in-situ hybridization (FISH) could identify those patients most likely to benefit from adding cetuximab,\" Herbst said. \n\nPatients eligible for this Phase III trial had newly diagnosed Stage IV NSCLC. Patients with controlled brain metastases were allowed entry. The study required all patients to have tumor tissue available for molecular testing, including EGFR FISH, which was a co-primary endpoint of the trial. Randomization was stratified by appropriateness for bevacizumab treatment, smoking status, and M-substage. The co-primary objectives were progression-free survival (PFS) in EGFR-FISH positive (FISH+) patients and overall survival (OS) in the overall study population (OSP). \n\n\"Squamous cell carcinoma is a minority subtype of lung cancer for which we have seen few new targeted therapies in the last 20 years. These data are hypothesis generating, suggesting that EGFR FISH is a potential biomarker that can be used for study of cetuximab or similar drugs in the future,\" Herbst said. \"These data support using this biomarker for determining who should receive an EGFR antibody inhibitor with chemotherapy, within the squamous subgroup.\"\n\nEGFR IHC and FISH Correlative Analyses (SQUIRE trial)\n\nAnalysis showed no consistent trend or obvious cut-points for the relationship between either overall survival or progression-free survival with EGFR protein across the range of IHC values when comparing treatment arms. Archived tumor tissue with evaluable results for exploratory EGFR FISH analysis was available for 51.0 percent of patients. Of these patients, 208 patients (37.3 percent) had increased EGFR gene copy number (FISH positive). The study did observe a trend for greater necitumumab benefit in EGFR FISH positive patients. Treatment HR for FISH positive and negative patients were 0.70 and 1.02 for OS, and 0.71 and 1.04 for PFS. However, the interaction of EGFR gene copy number gain with treatment was not statistically significant for either OS or PFS. \n\nHirsch concluded that the analysis of EGFR protein expression did not identify consistent trends related to efficacy outcomes across the range of IHC values. However, EGFR gene copy number gain showed a trend for a more favorable HR. Both biomarkers, however, and particularly the FISH biomarker, showed sufficient potential trends to be investigated further in future trials.\n\nThe press briefing was moderator by Dr. Paul A. Bunn, Jr., former IASLC CEO, Distinguished Professor, Division of Medical Oncology at the University of Colorado Cancer Center of the Univ. of Colorado School of Medicine.\n\nAbout the WCLC: \n\nThe WCLC is the world's largest meeting dedicated to lung cancer and other thoracic malignancies, attracting more than 7,000 researchers, physicians and specialists from more than 100 countries. The conference goal is to increase awareness and collaboration so that the latest developments in lung cancer can be understood and implemented throughout the world. Falling under the theme of \"Fighting Lung Cancer,\" the conference will cover a wide range of disciplines and unveil several research studies and clinical trial results. For the first time, IASLC has invited survivors to attend the conference free of charge. For more information on the 2015 WCLC, visit: http://wclc2015.iaslc.org/.\n\nAbout the IASLC: \n\nThe International Association for the Study of Lung Cancer (IASLC) is the only global organization specifically dedicated to the study of lung cancer. Founded in 1974, the association's membership includes nearly 4,000 lung cancer specialists in 80 countries. For more information, visit: https://www.iaslc.org/.", "source": "Sys-Con Media"}