{"published": "2015-09-04T06:50:56Z", "media-type": "News", "title": "Looking Up: Find the double star cluster", "id": "7352bdc4-d618-4185-85c9-db9b969ea1c1", "content": "Looking high in the northeast after darkness falls, the glittering stars of the “BIG W” shine forth. No, not a neon sign for a chain department store. This is the constellation Cassiopeia, whose five principal stars wonderfully form the letter “W.” Of course it depends on orientation. Sometimes it appears like an “M.” While the constellation is rising in the northeast, the “W” is more on its side. In early September around 1 a.m., it is high up in the north, perhaps straight overhead where you live. It is then shaped like an “M.” Twelve hours later, the constellation is at its low point, and appears as a true “W.” At this time of year, that is close to 1 in the afternoon. The “W” is there, just like all the rest of the stars, but you won’t see it in broad daylight. The only star you can see by day is the Sun! Like all constellations, Cassiopeia seems to circle around an imaginary point on the sky next to the North Star. Directly opposite from Cassiopeia on the other side of the North Star is the famed seven stars of the Big Dipper. The Earth’s rotation, of course, makes the sky seems to spin around. As we advance towards new moon on Sept. 13, we can enjoy moonless nights, and the maaximum amount of stars you can see. Cassiopeia is amidst the hazy glow of the Milky Way Band which at this time of year in the evening extends across the sky and down in the south. The view with eyes alone is spectacular enough, but just try it with binoculars! With binoculars, scan the stars the next September evening just below the “W” on its side. Look below the “W”’s bottom segment, by a little more than the length of that segment. You should quickly be able to spot the “Double Cluster,” a pair of open star clusters of similar brightness and size. With unaided eyes under a dark sky you can see the Double Cluster as a small pair of fuzzy patches. Binoculars will begin to reveal the myriad stars in each cluster. The view in a small telescope at low power is stunning. The planet Saturn may be currently seen low in the southwest once darkness falls, appearing like a bright star. If you arise early (or stay up very late), look low in the eastern sky about an hour before sunrise. Venus is very bright. To the upper left is the planet Mars, much dimmer and reddish. Be sure to look on the mornings of Sept. 9, 10 and 11, should skies be clear. The crescent moon will be gliding between Venus and Mars. Mark your calendar: North America is favored by a total lunar eclipse on Sunday evening Sept. 27! An upcoming column will discuss this further. Keep looking up! Peter W. Becker is managing editor of The News Eagle in Hawley, Pennsylvania. Notes may be sent to news@neagle.com.", "source": "Record Online"}