{"published": "2015-09-10T13:00:00Z", "media-type": "News", "title": "American Creek Resources Corporate Update", "id": "db05680b-f805-486c-bd39-233fc092dc81", "content": "CARDSTON, ALBERTA -- (Marketwired) -- 09/10/15 -- . (TSX VENTURE: AMK) (\"American Creek\") (\"the Corporation\") is pleased to provide a general corporate update. \n\nTreaty Creek Litigation \n\nAs previously reported, both the BC Supreme Court and the BC Court of Appeal confirmed American Creek's 51% controlling interest in the Treaty Creek property. The Treaty Creek litigation has now been concluded with Teuton Resources Corp. (\"Teuton\") having made the final costs and special costs payments to American Creek. \n\nThe Treaty Creek property is adjacent to Seabridge Gold's KSM property and located in the same region as Pretivm Resources' Brucejack property in northwest British Columbia. \n\nAllan Burton, CEO, stated the following: \"We are very glad to see the Treaty Creek litigation, and all that it entailed, behind us. We have some great properties and are very much looking forward to getting back to focusing on mineral exploration and exploring all avenues to see those properties reach their full potential.\" \n\nGold Hill Property \n\nThe Gold Hill property was recently acquired by American Creek (see previous news release dated March 9, 2015). The property is located in the heart of the historic Wildhorse River gold rush area near Fort Steele, BC and holds promise for potentially being an originating source of the historic placer gold. An initial field program involving sampling, mapping and locating the historic adits has begun. Also, the Corporation has received multiple offers to option/JV/purchase the property and is in the process of evaluating those offers. \n\nIn addition to moving the Treaty Creek and Gold Hill projects forward, American Creek intends to prosecute the economic interference / conspiracy / defamation law suit against Teuton, Mr. Cremonese (Teuton's president) and others. \n\nAmerican Creek Resources Ltd. is a Canadian junior mineral exploration company focused on the acquisition, exploration and development of mineral deposits within the Province of British Columbia, Canada.", "source": "Pettinga Financial Advisors"}