{"published": "2015-09-20T11:22:26Z", "media-type": "News", "title": "Wednesday, September 23", "id": "79205745-b593-4b98-8a94-da6b8238fefc", "content": "Clothes to Die For gradually changes in mood from the innocent and matter-of-fact to the utterly heartbreaking. \n\nFREE TO AIR\n\nThe Bachelorette, Ten, 7.30pm \n\nFourteen blokes – several of whom we suspect are wearing a suit for the first time in their lives – tonight introduce themselves to the fascinating Sam Frost. She’s a lady who’s been battered by life and reality TV shows and yet here she is fronting up for another bout. Of course, this time it’s she who’ll be wielding the roses (and forcing her suitors to accompany her on a series of bizarre dates) and the dynamics of that promise to make this intriguing. Tonight is the traditional getting-to-know-you exercise.\n\nThe Block, Nine, 7.30pm \n\nWe know reality TV is all about casting, all about the characters, but few series develop/manipulate their characters with quite the same expertise or finesse as The Block. To its credit, it’s less interested in creating heroes and villains than in showing us the strengths and frailties of everyone involved. Tonight the contestants face their first challenge, during which (a) Scotty proves why he’s not a judge on this show, and (b) various rivalries are played out face to face. There are some splendidly broad moments (including some death stares worthy of Real Housewives). But there is also some delicately handled progression. In one scene, one character displays herself in a genuinely unattractive light. But by the end of the episode we’re suddenly realising just how fragile she actually is, and how close to cracking. It’s a masterly piece of editing.\n\nClothes to Die For, ABC2, 9.20pm \n\nIn style, this British documentary is reminiscent of the many films made in the wake of 9/11 and the London bombings: beautifully-shot to-camera pieces (interspersed with archival footage) that gradually change in mood from the innocent and matter-of-fact to the utterly heartbreaking. And that only seems appropriate, because while the collapse of the clothing factory in Bangladesh’s Rana Plaza that killed almost 1200 people and injured thousands more was not politically motivated, its cultural, social and personal ramifications are very much the same. This thoughtful, unsensational piece lets the facts, and the people affected, tell the story in a way that’s both compelling and thought-provoking. The overarching message is corporate greed inevitably has a profound human cost. \n\nMelinda Houston\n\nPAY TV\n\nLost in Transmission, A&E, 8.30pm\n\nSouthern hipster and Top Gear USA presenter Rutledge Wood has set up a business that helps Americans get old and unusual cars back on the road. The problem is that he usually underquotes and so has to come up with wacky money-making schemes to get the cash he needs to finish the job. Tonight, for instance, he agrees to restore a 1972 Land Cruiser that hasn’t run in 20 years, only to find that it’s a bigger job than he thought. His solution? Spend $5000 on a little old Volkswagen Jetta and a conversion kit that will turn it into a two-door ute. Such a vehicle, he imagines, should sell immediately for $10,000. It’s all fairly entertaining and even a little inspiring. \n\nBrad Newsome\n\nMOVIES\n\nWonderland (2003), SBS2, 10.20pm \n\nIn a 1995 Details magazine profile of Val Kilmer, Bret Easton Ellis wrote, “in movies he has the open-faced, slightly flawed, amiable American beauty that Bruce Weber taps into: a thick-lipped insolence ... a masculinity so effortless it borders on the perverse.” Kilmer was the native Californian who went to Juilliard to study acting and then returned to Hollywood, where for many years he was spoken of as a major star in the making. But the starring roles (The Doors, Batman Forever, The Saint) didn’t match up to the compelling supporting turns (Tombstone, Heat), and early in this century he changed tack, jumping into independent productions such as James Cox’s crime drama about 1981 revenge murders of a Los Angeles crew who had robbed a drug dealer. The central figure was 1970s porn star John Holmes, whose cocaine addiction resulted in multiple bloody betrayals, and Kilmer capably catches the character’s desperation even as the film descends into low-life pungency that never finds a purpose. The same events inspired the firecracker-punctuated drug sting in Boogie Nights, but Cox can’t match a sweating, discombobulated supporting cast, including that master of malice Dylan McDermott, to such coolly inspired filmmaking, and Kilmer’s opportunity is once more lost.\n\nBlood Simple (1984), stan.com.au Critics were divided when Joel and Ethan Coen announced themselves as twentysomething filmmakers more than three decades ago with this Texan-set thriller – “a crude, ghoulish comedy on thriller themes,” wrote Pauline Kael in TheNew Yorker. But looking at the movie now, a neo-noir confection of desire and murder assembled from the stories of James M. Cain and Dashiell Hammett, it’s obvious how self-contained and identifiable the siblings already were. “I know where you can get those framed,” aprivate eye named Visser (M. Emmet Walsh) tells a bar owner, Marty (Dan Hedaya), when he presents him with photos of his wife, Abby (Frances McDormand) in bed with his bartender, Ray (John Getz), and from that staring point nocturnal acts of cruelty take shape not through nefarious schemes but crude assumptions and mistaken identity. These lives are like bitter clockwork designs no one can see, but the difference from latter Coen brothers works is the lack of ironic distance – there’s a rage in Hedaya’s performance that isn’t undercut by the bloody B-movie violence. At one point the camera tracks down the bar top, hopping over the head of a passed-out patron without pause, making for a witty, self-referential arrival.\n\nCraig Mathieson\n\nThe story first appeared on The Sydney Morning Herald.", "source": "Merredin Wheatbelt Mercury"}