{"published": "2015-09-29T10:54:49Z", "media-type": "News", "title": "Veterinary Memorial Fund donations honor special connections with companion animals", "id": "2ce9068f-f9c0-4585-8a98-fd4e90058719", "content": "BLACKSBURG, Va., Sept. 29, 2015 – When Libby Whitley of Lovingston, Virginia, found Rosie, a Walker coonhound, limping along the side of the highway, she made an instant connection. After finding out that Rosie’s owner didn’t want her back, Whitley kept Rosie on the family farm. \n \n“Unlike many hounds that started life as hunting dogs, Rosie never roamed far, but was content to patrol ‘her’ nearby valley for rabbits when she wasn’t camped out on the bench by the kitchen,” Whitley said. “She lived a good, long life until cancer and other maladies took her away from us. We will always miss her loving, indomitable spirit.” \n \nTo memorialize this special dog and the bond she shared with her owner, Rosie’s veterinarian, Al Henry of Peaks View Animal Hospital in Lynchburg, Virginia, made a contribution to the Veterinary Memorial Fund on behalf of Rosie and her family. \n \nThis gift, along with others over the years, funds life-enhancing research at the Virginia-Maryland College of Veterinary Medicine at Virginia Tech. Supported projects help develop knowledge, improve procedures, and perfect techniques in areas such as hyperthyroidism in cats, chemotherapy, wound healing, and equine laminitis. \n \nEstablished in 1985, the Veterinary Memorial Fund enables pet owners and families to leave a legacy of support for scientific investigations that improve the quality of health care for future generations. The fund accepts contributions, both small and large, from veterinarians and owners in memory of a pet, as well as from family and friends in memory of a person who loved animals. \n \nMark Finkler, owner of the Roanoke Animal Hospital and longtime contributor to the fund, emphasized how contributing can help pet owners and families during the grieving process. “By contributing to this fund on behalf of a client’s cherished pet, I know that I’m helping to transform a profound loss into a meaningful legacy,” he said. \n \nShawna Klahn, assistant professor of oncology in the Department of Small Animal Clinical Sciences, said she hopes that legacy is readily apparent in her Veterinary Memorial Fund-funded project, which has the potential to benefit dogs with cancer. \n \n“We are in the middle of a clinical trial to find the appropriate dosage of a human chemotherapy drug, oxaliplatin, in dogs with cancer,” Klahn said. “The overall goal is to expand the arsenal of anti-cancer agents that veterinarians can use in treating their canine patients.” \n \nThe clinical trial began last year and is still enrolling dogs with solid tumors of all types. According to Klahn, early results have shown that the chemotherapy drug is well tolerated by dogs. Researchers must first determine appropriate dosage of the drug before determining its effectiveness at fighting cancer. \n \nMany of the Veterinary Memorial Fund grants provide funding for projects that can have a near-term impact on patient care. For example, Noah Pavlisko, assistant professor of veterinary anesthesiology, and his colleagues used an $18,000 grant to develop a better way to monitor oxygen delivery to critically-ill veterinary patients. They used near-infrared spectroscopy — a new, non-invasive technology that provides real time assessment of oxygen delivery — to better understand oxygen tissue saturation in dogs under general anesthesia. \n \nAfter presenting their promising results in the American Journal of Veterinary Research and at national and international meetings, the researchers are working to apply the technology in the clinic to improve patient outcomes. \n \nEstablished in partnership with the Virginia Veterinary Medical Association and the Maryland Veterinary Medical Association, the Veterinary Memorial Fund has raised almost $1.5 million for more than 100 research projects. \n \nDonations boost core support for the college’s clinical research at the Veterinary Teaching Hospital and enable more animals to participate. Specially designated donations of $2,500 and above will be recognized with a new donor wall, which will be installed in the Veterinary Teaching Hospital this fall. To learn more or to donate, visit the Veterinary Memorial Fund website or contact Mindy Quigley , clinical trials coordinator, at 540-231-1363. \n  The Virginia-Maryland College of Veterinary Medicine is a leading biomedical teaching and research center, enrolling more than 700 Doctor of Veterinary Medicine, master of public health, and biomedical and veterinary sciences graduate students. The college is a partnership between the land-grant universities of Virginia Tech and the University of Maryland. Its main campus in Blacksburg, Virginia, features the Veterinary Teaching Hospital and large animal field services which together treat more than 79,000 animals annually. Other locations include the Marion duPont Scott Equine Medical Center in Leesburg, Virginia, and the Gudelsky Veterinary Center in College Park, Maryland.", "source": "Virginia Tech"}