{"published": "2015-09-23T20:01:02Z", "media-type": "News", "title": "Gucci geek chic sparkles in Milan rain", "id": "698663b6-b676-422d-80af-d163b22e690a", "content": "Alessandro Michele’s second womenswear collection since taking the creative reins at Gucci was unveiled to rave reviews on Wednesday as Milan’s Spring/Summer 2016 shows got off to a flier. Milan (AFP) \n\nA collection immediately dubbed “geek chic” featured elements including oversized glasses of a kind last seen on 1970s librarians, pussy bow blouses, lots of berets, much intricate embroidery, including some on biker jackets featuring as one of several androgynous pieces.\n\nThe overall feel was quirky feminine in line with the direction Michele signalled with his first collection in February — but there was also something almost perversely anti-glamour about it too.\n\nOne translucent dress was paired with what looked like an oversized pair of control pants.\n\nIt seems, however, that Michele can do no wrong at the moment and the tone of early reaction online was fairly rapturous with glossy magazine commentators confidently predicting another season of waiting lists for the hottest items.\n\nHollywood stars Dakota Johnson and Salma Hayek were among the Michele fans to brave the torrential rain in Milan to take in a show staged in a disused old train platform.\n\nWith a chilly breeze sweeping down from the Alps, it was not the day to be strutting around in a diaphonous number but it was not until the courtesy cars started getting stuck in the mud outside that the models started to complain.\n\nIn his show notes, Michele said he had drawn inspiration from the “Carte de Tendre”, an imaginary map charting the path to love that was published in the 17th Century by French literary figure Madeleine de Scudery.\n\n“Each object in the collection is offered up as a small atlas of emotions,” he says.\n\n“A treasure chest of aesthetic references, a sentimental cartography in which patterns, extraordinary craftsmanship and rarefied materials are interwoven.”\n\nAlthough Gucci is owned by French holding company Kering most of its production and design are still Italian and the prospect of another sell-out season for such a big player will come as welcome news for an industry which entered this fashion week in upbeat mood.\n\nA backdrop of strong sales at home and abroad and a revamp of Milan’s fashion week infrastructure have contributed to the optimistic feel.\n\nMichele, a shaggy-haired Roman, went from being an accessories designer known only to fashion insiders to one of the biggest jobs in the industry following the abrupt departure of his long-standing predecessor Frida Giannini at the start of this year.\n\nFamously, he only had five days to finish off Giannini’s final menswear collection and barely a month to put on his first womenswear show in February.\n\nHe pulled it off in triumphant fashion with a collection that bore many of the hallmarks of his own, eccentric personal style — best described as a time travel tapestry in which English civil war royalist meets California dropout from the 1970s.\n\nGucci’s bosses had said they wanted a new direction to turn around the brand’s flagging fortunes, and they got it. Now it seems he has delivered again.\n\n– Business booming –\n\nItaly’s textile and clothing exports, dominated by the high value-added fashion sector, hit a record high in July and the national fashion body Camera della Moda is anticipating growth of 5.5 percent in all sales in 2015.\n\nFor an industry that turned over 61.2 billion euros last year, that translates to a lot of secured jobs and significant margins for new investment.\n\n“Italian fashion has benefited from a stronger dollar and a return of confidence among European and American consumers,” said Gaetano Marzotto, head of the textile group Marzotto.\n\n“It is true that in China, luxury products, watches and jewellery in particular have seen a fall in sales due to anti-corruption measures, but the accessible luxury that characterises the made-in-Italy trademark have held up well.”\n\nGiuseppe Angiolini, honorary chairman of the Italian chamber of fashion buyers, says his compatriots appear to be falling in love with fashion again.\n\n“More than a recovery, I’d say it is an awakening,” he said. “Two years ago everyone was totally fed up with fashion. Now we are seeing customers’ desire and interest is back.”\n\n© 2015 AFP", "source": "Citizen.co.za"}