{"published": "2015-09-08T12:05:54Z", "media-type": "News", "title": "COLUMN-RPT - As Chinese capital flees, impact can be major -James Saft", "id": "a6c36733-ae7b-4c95-8bae-14e00b0bf884", "content": "(Repeats to additional subscribers. The opinions expressed here\nare those of the author, a columnist for Reuters.) \n\nBy James Saft \n\n(Reuters) - How sellers of everything from Maui real\nestate to fine art reinvest the proceeds will be key in\ndetermining the global impact of Chinese capital flight. \n\nThat is, of course, if China carries on allowing capital to\nflee, far from a certainty. \n\nChina logged its biggest-ever fall in foreign exchange\nreserves in August, down $93.9 billion last month to $3.557\ntrillion as it battled a slide in the yuan prompted by capital\nflight, People's Bank of China data showed on Monday. \n\nHow, for how long and under what rules of engagement China\nfights this battle will matter a great deal for it and the\nglobal economy. \n\nWhere the money leaving China goes, what it buys and what\nthose who sell to Chinese capital owners do with the cash will\nalso have a big impact; potentially changing the global price of\nmoney and with it the price of financial assets. \n\nMoney leaving China does so for a complex set of reasons.\nSome individuals fear further devaluation of the yuan and falls\nin Chinese asset prices and go abroad seeking better\ninvestments. Some, especially those with fears over corruption\nprosecution and the rule of law, seek safety, often by buying\nproperty in places like London, New York, Hawaii or Canada, or\neven art. Property can act as an escape hatch as well as a store\nof value, while art is easy to store and easy to own\nanonymously. \n \nTo understand the impact these flows might have on markets\nit is important to remember how and why China built up the\nlargest foreign exchange reserves in history, and what it bought\non the way up. \n\nThe foreign exchange pile was largely built up in an effort\nto hold down the value of the yuan and support exports. To do so\nChina needed to hold on to many of the dollars it earned in\nexchange for exports. The PBoC did this not like a pension fund,\nseeking to maximize risk-adjusted return, but simply with the\neconomic and exchange rate management as a goal. The result was\nthat China became the biggest creditor to the United States,\nowning at least $1.5 trillion of U.S. debt. \n\nSo when money flows out of China, as it is now, the PBoC\nmust either allow the yuan to fall in value or stabilize it by\nselling reserves, mostly Treasuries, and handing over the cash\nto owners who are expatriating it. The vast majority of this is\ndone against regulations, but happens none the less. \n\nDIFFERENT PREFERENCES \n \nWhile the amount of dollars doesn't change, the preferences\nof these dollar's new owners is likely to be hugely different.\nSome Chinese will park some of their money in Treasuries, but\nmany will instead buy real estate, art or other assets. \n\n\"If China is forced to significantly run down FX reserves to\ndefend its economy from disorderly capital outflows (which we\nbelieve would be dominated by domestics looking abroad as\nopposed to foreigners repatriating) and undesired currency\ndepreciation, then this could have a notable impact on the U.S.\nterm premia,\" economists at Societe Generale led by\nMichala Marcussen wrote in a note to clients. \n\n\"However, that would depend also on which assets capital\noutflows seek out; if the Chinese private sector buys U.S.\nTreasuries as the official sector sells then it is merely a swap\nof Chinese external assets from the public sector to the private\nsector. In the real world, such perfect matching is unlikely.\" \n \nThis is where the preferences of the sellers of Picassos and\nluxury apartments come in. They too are unlikely to want to turn\ntheir new cash piles into exclusively liquid Treasuries. The\nupshot is a drop in overall supply of Treasuries offered,\ncombined with a drop in demand, forcing interest rates up or\nincreasing longer-term rates particularly. \n\nRemember too that the 10-year Treasury price is\nsometimes called the most important price in the world for a\nreason. Treasuries have a special power of influencing the value\nof other assets in financial markets. The higher the price of\nTreasuries, the cheaper other, riskier assets look in\ncomparison. Reverse the first part of that and you reverse the\nsecond. \n\nThe trend of capital flows does not appear over. \n\n\"The evidence indicates not that the market is settling back\ndown but rather that the market is betting more and more against\nthe RMB stabilizing. Capital appears to be flowing out at a\nfaster rate,\" writes Christopher Balding, an associate professor\nat Peking University HSBC Business School. www.baldingsworld.com/ \n\nThe open question is how China might try to stem flows,\nthough many of those efforts may only make money more eager to\nleave. \n\nFrom Maui to Wall Street, the impact will be large. \n\n(At the time of publication James Saft did not own any\ndirect investments in securities mentioned in this article. He\nmay be an owner indirectly as an investor in a fund. You can\nemail him at jamessaft@jamessaft.com and find more columns at blogs.reuters.com/james-saft )\n \nnL1N0ZM2CC\n\n (Editing by Dan Grebler)", "source": "Reuters"}