{"published": "2015-09-15T10:00:00Z", "media-type": "News", "title": "Magna and Argus collaborate on cyber security solution", "id": "f2ff0372-6fc4-417c-8fd9-8e81f4443e8a", "content": "Bridging the gap between car connectivity and security \n\nAURORA, ON and TEL-AVIV, Israel , Sept. 15, 2015 /PRNewswire/ - Magna International Inc. and Argus Cyber Security Ltd. announced today that they are partnering to deliver a robust solution to the automotive industry that addresses vehicle security concerns related to cyber attacks in the rapidly growing car connectivity market.  \n\n(Photo: http://photos.prnewswire.com/prnh/20150915/266551 ) \n\nThe Argus technology is a ready-to-embed, cyber security solution for automobiles and aftermarket connectivity platforms. The solution protects a vehicle's critical on-board systems from being hacked and can be seamlessly integrated into any vehicle product line with no changes required to the vehicle's architecture.  The technology is applicable to any connected vehicle, anywhere in the world. \n\nThrough this partnership, Magna brings a comprehensive range of automotive electronic systems, as well as safety-critical system design expertise, while Argus delivers its Intrusion Prevention System (IPS) solution and cloud-based monitoring service, resulting in a complete integrated package.  \n\n\"With the connected car market growing, the need to have a protected environment and secure data is becoming more urgent and we are taking a proactive approach in delivering a solution to our customers,\" said Swamy Kotagiri , Magna's Chief Technology Officer. \"We feel confident in the Argus team, their expertise and speed-to-market. In addition, this partnership is key to our focus on vehicle-based connectivity solutions as a core part of our electronics strategy.\"  \n\n\"Argus' mission is to promote car connectivity without compromising on security. We are certain that our joint offering would help enhance passenger safety and make the road a safer place,\" said Ofer Ben-Noon , Argus's Co-Founder and CEO. \"Magna's strong commitment and unique market position will allow Argus to expedite its growth strategy and further strengthen its market reach.\"    \n\nAbout Magna International \nWe are a leading global automotive supplier with 287 manufacturing operations and 81 product development, engineering and sales centers in 29 countries. We have approximately 124,000 employees focused on delivering superior value to our customers through innovative products, processes and World Class Manufacturing. Our product capabilities include producing body, chassis, exterior, seating, powertrain, electronic, vision, closure and roof systems and modules, as well as complete vehicle engineering and contract manufacturing. Our common shares trade on the Toronto Stock Exchange (MG) and the New York Stock Exchange (MGA). For further information about Magna, visit our website at www.magna.com . \n\nAbout Argus  \nArgus is an automotive cyber security pioneer, helping car manufacturers, their Tier 1 suppliers and aftermarket connectivity providers protect connected cars and commercial vehicles from car-hacking. Founded in 2013 by cyber security experts, Argus solutions combine innovative security methods and proven computer networking know-how with deep understanding of automotive best practices. Argus' R&D is based in Tel-Aviv, Israel , with offices in Michigan , the Silicon Valley, Stuttgart and Tokyo . For further information visit www.argus-sec.com .  \n\nTHIS RELEASE MAY CONTAIN STATEMENTS WHICH CONSTITUTE \"FORWARD-LOOKING STATEMENTS\" UNDER APPLICABLE SECURITIES LEGISLATION AND ARE SUBJECT TO, AND EXPRESSLY QUALIFIED BY, THE CAUTIONARY DISCLAIMERS THAT ARE SET OUT IN MAGNA'S REGULATORY FILINGS.  PLEASE REFER TO MAGNA'S MOST CURRENT MANAGEMENT'S DISCUSSION AND ANALYSIS OF RESULTS OF OPERATIONS AND FINANCIAL POSITION, ANNUAL INFORMATION FORM AND ANNUAL REPORT ON FORM 40-F, AS REPLACED OR UPDATED BY ANY OF MAGNA'S SUBSEQUENT REGULATORY FILINGS, WHICH SET OUT THE CAUTIONARY DISCLAIMERS, INCLUDING THE RISK FACTORS THAT COULD CAUSE ACTUAL EVENTS TO DIFFER MATERIALLY FROM THOSE INDICATED BY SUCH FORWARD-LOOKING STATEMENTS. THESE DOCUMENTS ARE AVAILABLE FOR REVIEW ON MAGNA'S WEBSITE AT WWW.MAGNA.COM . \n\nSOURCE  Magna International of America Inc. \n    ", "source": "CNN Money"}