{"published": "2015-09-29T15:14:33Z", "media-type": "Blog", "title": "Should The Black Lives Matter Movement Hold A Presidential Candidate Forum To Address Our Issues?", "id": "8f4cf6fa-0ba4-46f1-8ae3-889735d5c886", "content": "On Monday’s edition of NewsOne Now, Roland Martin posed a question about the upcoming presidential election and one of the largest movements in recent history: “Should the Black Lives Matter movement invite Republican and Democratic presidential candidates to a debate/forum in an attempt to force them to address issues important to the African-American community?” There would be pros and cons behind holding the forum, NewsOne Now panelist Paris Dennard told Martin: “It would be very telling to those candidates who take this seriously and who may not agree with the slogan or the hashtag, but understand there are pros behind it.” He added, “Those who get it and have staff that say ‘This is something that you should do, if you want to reach and have these inroads and tap into how America feels’ will show up. Those that won’t, they’re not going to be there.” Lauren Victoria Burke, Managing Editor of Politic365.com, said, “I think we know who would not show up.” “Most of the Republicans would not show up.” She continued, “Jeb Bush, maybe Marco Rubio would show up.” Martin then interjected with Bush’s “free stuff” faux pas from last week, to which Burke said, “That is how they market to Black voters — the welfare queen.” Later, Martin suggested the forum would raise the Black Lives Matter movement to a different level. “Because if you go back to 2012, when you have the Tea Party that sponsored debates — Black Lives Matter movement should do it as well,” Martin said. Martin believes a Black Lives Matter-sponsored presidential debate would “force every Democratic candidate to have to show up and speak to our issues.” Watch Roland Martin, GOP strategist Paris Dennard, and Lauren Victoria Burke discuss the notion of the Black Lives Matter Movement hosting/sponsoring a 2016 presidential candidate debate/forum in the video clip above. TV One’s NewsOne Now has moved to 7 A.M. ET, be sure to watch “NewsOne Now” with Roland Martin, in its new time slot on TV One. Subscribe to the “NewsOne Now” Audio Podcast on iTunes. SEE ALSO:  What Is The Ask: Iyanla Vanzant Addresses #BlackLivesMatter Controversy Don’t Miss Our Hottest Stories! Get The NewsOne Flip App for iPhone: Flip, Skip — Or Send Us a Tip! Join the Conversation! Share and Discuss!\tShare on Facebook Also On Magic 95.9:\nOriginally seen on http://newsone.com/", "source": "Magic 95.9"}