{"published": "2015-09-28T17:59:19Z", "media-type": "News", "title": "Rick Holmes: It’s not true just because you think it is", "id": "215f3971-fba7-4399-95a5-a6f4c5408c25", "content": "It’s one of the most dismaying poll results I’ve seen: In October 2008, a month before they elected him president, 12 percent of Americans thought Barack Obama was Muslim.  Seven years later, now that they know him better, 29 percent have the religion of their president wrong. During those seven years, Obama has done nothing to indicate he is anything other than the practicing Christian he’s always said he was. It’s not that he’s become more Muslim. It’s that Americans have gotten more stupid. Some things are matters of fact, and technology has made it easier than ever to confirm facts. But instead of getting everyone on the same page, technology – email, the Web, social media – has accelerated the distribution of myths, caricatures, falsehoods and lies. Call it the Misinformation Age. Ignorance isn’t new, of course. Seven percent of Americans think Elvis is alive and the moon landing was a hoax. But the persistence of untruths in the political sphere, among people supposedly paying attention, is a problem on many levels. Obama’s biography isn’t the only example. Al Gore never said he invented the Internet, a lie that has dogged him for decades. The most recent Republican presidential debate offered several untruths: Carly Fiorina misidentifying a grisly video – and challenging others to go watch it; Donald Trump peddling long-discredited links between vaccinations and autism; Jeb Bush praising his brother George W because “he kept us safe” – as if someone else was president when terrorists struck on Sept. 11, 2001. But the myths about Obama have a special persistence, including the much-discussed and much debunked fact of where he was born. I’ll risk being obvious, because apparently 20 percent of Americans require it: Obama was born in Honolulu in 1961. We’ve seen his birth certificate, of course. But his birth was also announced in the newspapers. Faking a birth certificate is hard; it’s even harder to falsify newspaper pages that have been on microfilm for 50 years. As for the president’s religion, Obama has told his story, and it has been confirmed by reporters and biographers: The grandfather he never met converted from animism to Islam but was not devout. The father he barely knew was an atheist. His mother and the grandparents who raised him were Unitarian Protestants. His Indonesian stepfather was a non-practicing Muslim. Obama converted to Christianity in 1988 and joined a Protestant church. Settling some disputes require both evidence and definitions. In common American usage, your religion is what you were brought up as, or the faith you choose and follow as an adult, taking its oaths, celebrating its sacraments, honoring its scriptures, and attending its services. Both point to Obama’s Christianity. He was not raised a Muslim and there’s no evidence that he acts like a Muslim in his religious life. So by the common American definition, he’s a Christian, not a Muslim. Page 2 of 2 - I’ve heard theories that purport to prove Obama is a secret Muslim, using some other definition of religious identification. But redefinition cannot change a fact. Nor can repeating a lie over and over again make it the truth. Unless it’s a lie people want to believe is the truth. A lot of Republicans prefer the lie: A recent CNN poll found 43 percent of registered Republicans think Obama is a Muslim, and among supporters of Donald Trump, the number grows to 54 percent. “A lie will go round the world while truth is pulling its boots on,” wrote 19th century humorist C.H. Spurgeon, a quote often wrongly attributed to Mark Twain. Even faster, he might add today, if it comes with a note line screaming “Forward to all your friends!” Today’s lies come with Photoshopped images of Obama dressed like a Islamic scholar and mash-up videos labeled “Obama Admits He Is a Muslim!” They are peddled relentlessly by websites that have incorporated conspiracy-mongering and partisan libels into their business models. But they are just as false as the rumors spread by political enemies about every president since Washington. The truth is out there, provided by credible fact-checking organizations, but truth has always been optional in politics. Stephen Colbert had it right on his very first show, when he coined the term “truthiness” to describe things that may not be true, but that FEEL like they should be true. For 29 percent of American voters, truthiness is good enough. Rick Holmes writes for GateHouse Media and the MetroWest Daily News. He can be reached at rholmes@wickedlocal.com. Like Rick on", "source": "Leesville Leader"}