{"published": "2015-09-18T05:12:00Z", "media-type": "News", "title": "NIU trustees approve interim budget", "id": "3d7514c2-8b6e-4b60-8417-84b580417efc", "content": "DeKALB – Northern Illinois University trustees Thursday approved a $389 million interim budget, and the school anticipates a large loss of state funding. \n   \nThe budget, down 8.7 percent from last year’s $426 million spending plan, will be in effect for at least a month, but could last until the next scheduled Board of Trustees meeting Dec. 10. NIU officials hope that by then the state has adopted a budget so the school can finalize its financial plan. \n\n“In most years we [NIU] would have a budget by July 1, but we don’t,” NIU President Doug Baker said. “We don’t have a state budget by July 1. So when we put this together, we had to put it together with our best estimates of what our revenues are going to be.” \n\nThe budget estimates the university will lose $27.2 million in state funding this fiscal year, which ends June 30. It anticipates $63.9 million in general state aid, down from $91.1 million last year. \n\nUniversity officials said they want to hold off making any moves that affect staffing, but the budget approved Thursday has a $29.8 million gap between revenue and operating expenses, according to university data. \n\nIllinois Gov. Bruce Rauner in May vetoed a Democrat-backed budget plan that included appropriations for all of the state’s nine public universities. That budget called for an 8 percent state funding cut. Rauner has proposed cutting state funding for higher education aid by 30 percent. \n\nThe difference between Democrats’ proposal and Rauner’s is about $22 million, NIU Vice President of Administration and Finance Alan Phillips said. \n\n“We do not have any idea what our appropriation will be from the state,” Phillips said. “You can’t make any firm decisions on spending until you know what your budget is actually going to be.” \n\nThe governor and Democrat-led General Assembly remain at loggerheads as the state has moved into its third month without a budget. Without the state spending plan, NIU is among the legion of entities left in financial limbo wondering how much it will be appropriated. \n\n“These are unprecedented cuts,” NIU Trustee John Butler, the board’s vice chairman, said. \n\nTrustees expressed concern Thursday that the interim budget could push the university into deficit spending. The $389.4 million plan it approved was $29.9 million less than its expected operating expenses. \n\nThe Academic Affairs department had the greatest expenses, according to budget information presented to trustees. The department, which includes the colleges of business, education and law, as well as libraries and NIU’s graduate school, expects to spend $189.3 million, more than double that of Student Affairs, which handles student services such as housing and admissions. \n \nNIU is the largest employer in DeKalb County. The school, Illinois’ third largest public university, has a staff of more than 1,100 faculty and more than 3,400 nonfaculty workers. Phillips said that if the school doesn’t know by year-end what state money it will receive – and actually start to have it roll in – there could be furloughs or layoffs. \n\n“We’re in process of cutting back in areas that we can, short of personnel,” Phillips said. “The last thing we want to do is cut personnel.” \n\nIn the previous fiscal year, NIU made 161 hires, including its first diversity chief. Vernese Edghill-Walden started Aug. 3 with a base salary of $185,000. The university also lost 389 employees to retirement and terminations, according to NIU spokesman Joe King. \n\nThe university’s payroll includes Baker’s $450,000 base salary. Football coach Rod Carey makes just less than Baker’s salary at $408,000, with his boss, Associate Vice President and Athletic Director Sean Frazier at $280,000. \n\nThis summer, several NIU staffers decided to unionize. Most of those employees looking to join the American Federation of State, County and Municipal Employees earn less than $50,000, according to NIU data. The school cited budget constraint for not giving them raises. \n\nGeneral state aid payments will stop coming in after this week, when Phillips said NIU received its final fiscal 2015 disbursement. \n\nThat approximately $8 million payout could be the last of the checks cut to the school until a new budget is in place. \n\nBut there were bright sides to be considered, NIU Trustee Cherilyn Murer said, pointing out that the school needs to start moving away from dependence on general state aid, which represents about 20 percent of its budget. Murer suggested increasing research to help forge more corporate partnerships. \n\nThis year’s budget plan calls for spending $4.8 million on research and partnerships. \n\n“Only with optimism do we have growth,” Murer said. “If we’re looking at things in too dismal a fashion, we will become paralyzed. And that will be the downfall of the univ", "source": "Daily Chronicle"}