{"published": "2015-09-03T12:44:00Z", "media-type": "News", "title": "Pirelli inquiry places blame for F1 tire problems on debris", "id": "ea264b9d-0e1b-493c-9036-89c31f616d61", "content": "MONZA, Italy — Formula One tire supplier Pirelli blamed debris on the track and prolonged usage for a \"highly unusual number of cuts\" at the Belgian Grand Prix, which was marred by frightening tire deterioration on the cars of Sebastian Vettel and Nico Rosberg.\n\nPirelli released findings Thursday from its investigation into the incidents two weeks ago, with practice at the Italian GP beginning Friday.\n\nIn Spa, the right rear tire of Vettel's Ferrari was torn to shreds at 320 kph (200 mph) in the penultimate lap. That came two days after the same thing happened to Rosberg in practice, prompting the Mercedes driver to demand action from Pirelli before Monza.\n\n\"Tests have shown that the failures at Spa were down to the exceptional combined effect of debris on the track and prolonged tire usage on a circuit that is particularly demanding,\" Pirelli said in a statement.\n\nThe company said the debris was left over from numerous accidents in support races that surrounded the centerpiece F1 event.\n\n\"In order to guarantee greater safety, Pirelli proposes with the FIA to undertake a study to optimize the way in which circuits are cleaned,\" the tire supplier said.\n\nThere were 63 cuts in the tires at the Belgian GP, compared to an average of 1.2 cuts per circuit in the previous 15 events — also including tests.\n\n\"All this indicates an anomalous amount of detritus on the track in Spa, with a consequent increased risk of encountering a foreign object,\" Pirelli said.\n\nFerrari used a single pit-stop strategy which added stress on the tires. A statement from governing body FIA based on Pirelli's conclusions said the remaining tread thickness on Vettel's rear tires \"was approximately 30 percent at the time of the failure, making the tire more susceptible to damage from even small pieces of debris.\"\n\nRosberg's incident was blamed on a cut that reached the belt of his tire.\n\nThe conclusions will do little to alleviate concern ahead of the race in Monza, which is F1's fastest circuit.\n\nStill featuring long straight sections from an old oval track, speeds at Monza can exceed 360 kph (220 mph). The premium on straight-line speed means teams use minimal wing resistance, forcing drivers to brake more heavily.\n\n\"The FIA is satisfied with the thoroughness of the investigation and Pirelli's conclusions,\" the governing body said. \"Based on this, the FIA is willing to consider any safety recommendations made by the tire supplier for the Italian GP and for the remainder of the season.\" \n\nAndrew Dampf can be followed at www.twitter.com/asdampf", "source": "Beaufort Gazette"}