{"published": "2015-09-23T04:00:00Z", "media-type": "Blog", "title": "The Quiet Man", "id": "9662058b-fca5-4771-8058-c7fd7bd548a3", "content": "Rick Perry is gone. Scott Walker is gone. It doesn't make a bit of difference. Donald Trump will be the Republican nominee this time around – unless it's Carly Fiorina or Ben Carson. The polls show that – it has come down to the bombastic real estate mogul and reality star, a guy who has never held elective office in life and with no experience in government, and the former CEO who had been fired in 2004 and never worked a day since, with no experience in government, and the retired neurosurgeon who's a little shaky on the Constitution and stuff. These three, combined, have the majority of the party behind them. Jeb Bush is polling at a bit less than five percent, for a reason – prior experience in elected office seems to be a disqualifier now, and everyone knows why. Most Republicans are seething with anger that their party let them down for eight years. Abortion is still legal. Obamacare is still the law of the land. Gays can get married now. Confederate flags came down. We didn't send a half a million troops to the Middle East to get rid of ISIS once and for all. We didn't get rid of Assad in Syria. We haven't stopped Vladimir Putin from doing anything and we're actually talking with the Cubans. And Mexicans are pouring across the border and murdering Americans left and right, and laughing at us. The list goes on and on. No Republican in office stood up and stopped any of this. That's the issue.\n\nThe other issue is noise. Donald Trump is an insult-machine. He specializes in Hispanics and women. Carly Fiorina is an acid-tongued ball-buster. One quip from her and Donald Trump is reduced to a limp stammering schoolboy. Her specialty is emasculation (and with Donald Trump that's a good thing). They go at each other day after day after day – no one can get a word in edgewise.\n\nBen Carson doesn't even try. He doesn't have to. While those two make all the noise, saying one outrageous thing after another, he's the quiet guy who is far more radical than either of them will ever be. That's why he's right up there with these two, while Jeb Bush and all the others have faded into the background. Those who are seething with anger that their party let them down for eight years, or maybe longer, sense this guy will actually blow everything up. Donald and Carly is the sideshow. He's the main event. He'll go where no one else dares.\n\nCarson does skirt the edge:\nBen Carson is changing his position on whether Muslims are fit to be president. After sparking a controversy over the weekend by saying he doesn't think a Muslim should be in the White House, the Republican presidential contender said Tuesday that he is more interested in the president prioritizing the U.S. Constitution over his or her faith. \"I don't care what a person's religion beliefs are or religious heritage is,\" he said at a news conference in Sharonville, Ohio. \"If they embrace our Constitution and are willing to place that above their religious beliefs, I have no problem with that.\"\nThat's a significant shift from Sunday when, during an appearance on \"Meet the Press,\" NBC's Chuck Todd asked Carson, \"Do you believe that Islam is consistent with the Constitution?\"\n\"No, I do not,\" Carson responded. \"I would not advocate that we put a Muslim in charge of this nation. I absolutely would not agree with that.\"\nBut Carson told an audience in Cedarville, Ohio, he was \"asked about who should be allowed to be President of the United States.\"\n\"And I said I think anybody, regardless of their religion, if they are willing to embrace the values and principles of America and our Constitution and subject their beliefs to the Constitution,\" he said. \"I have no problem with that at all. And that's perfectly reasonable.\"\nThe Washington Post's Chris Cillizza goes to the transcript. That's not how it happened, and Cillizza offers this:\nWhen Carson says he is being misquoted or taken out of context, what he really seems to mean is that the words he used didn't convey the fullness of what he meant. Like, he meant to condemn Sharia law and radical Islam in that interview with Todd. But Todd isn't a mind-reader and shouldn't be. Carson's argument - \"Trust me, that's what I meant even if it's not what I said\" - is a tough one to swallow without any further proof of his intent.\nRunning for president is hard - especially if you, like Carson, have never run for any office before. You make mistakes; you say one thing and mean another. But, to refuse to acknowledge those mistakes - or at least try to deflect blame before acknowledging them - is the sort of stuff that hurts the political process in the long run.\nOwn up to what you say and/or what you believe. If you make a mistake, say it and explain what you really meant. Looking around for someone to blame is the stuff my six-year old does - and what I scold him for.\nCillizza knows better. Politics doesn't work that way:\nIn a post on Facebook on Monday night, Carson said a Muslim could serve as president if they disavow Sharia law in order to get his support.\n\"I could never support a candidate for president of the United States that was Muslim and had not renounced the central (tenet) of Islam: Sharia Law,\" he wrote. \"I know that there are many peaceful Muslims who do not adhere to these beliefs. But until these tenets are fully renounced ... I cannot advocate any Muslim candidate for President.\"\nHe was back on track and more popular than ever:\nOn Monday, former neurosurgeon Ben Carson was bailed out of the controversy over his views of Islam by an unexpected ally. Nihad Awad, executive director of the Council on American-Islamic Relations, called a news conference to \"ask Mr. Ben Carson to withdraw from the presidential race.\"\nThe mild disrespect of calling a medical doctor \"mister\" was apparently unintentional, but the sheer audacity of CAIR's ask lit a fire on the right. CAIR, which plays a role in Islamic controversies similar to the one the Anti-Defamation League plays in Jewish ones, is not viewed that way by elements of the conservative movement. To many, like Center for Security Policy founder Frank Gaffney, it's viewed as a veritable fifth column that may be \"engaged in money-laundering foreign funds to pay for civilizational jihad here.\"\nSo things went well for Carson:\nGaffney and others were reacting to more than Carson's stumbling interview with \"Meet the Press\" host Chuck Todd. In a subsequent interview with The Hill's Jon Easley, Carson had said that he had been talking not about Islam generally but about sharia law specifically. \"Obviously if a Muslim was running for president, there would be a lot more education about sharia, about taqiyya,\" he said, referring to Islam's term for concealing one's religion in the face of a credible threat. On the \"anti-sharia\" right, Carson was being railroaded.\n\"Let me help out these genius journalists, a.k.a. Democrats, a.k.a. liberals, a.k.a. know-nothings,\" snarked conservative radio host and author Mark Levin. \"There's a difference in Islam that does not apply to Judaism and Christianity and other religions. That is, sharia law is not just a governing law in your personal lives. It is a governing law. That's why in Saudi Arabia, they set up sharia courts.\"\nAh, Carson was being railroaded. There are votes there, and Slate's Jim Newell notes this:\nCarson's rival candidates sensed that the political novice had committed something in the ballpark of a gaffe. They attacked his position from different angles, many hoping to affix themselves to the outrage du jour to secure more attention for their own presidential efforts. Sen. Lindsey Graham, who has about as much support in the presidential contest as you do, encouraged Carson to apologize to the \"American Muslim community\" and concluded \"that Mr. Carson may be a good doctor, but he is not ready to lead a great nation.\" Sen. Ted Cruz hardly expressed a love for Islam, but he did note that Carson's approach is at odds with the spirit of the Constitution. Louisiana Gov. Bobby Jindal, as usual, submitted the most hilarious take thus far. In an unsolicited statement sent to the press that whines about how the press is always nagging candidates with questions, Jindal explained that he'd be fine with a Muslim president who submits to certain conditions, such as being sworn in on a Bible.\nCarson and his team aren't sweating the modest rebukes from oxygen-deprived competitors.\nNewell says Carson need not worry:\nWhat's the simplest way to put this? The American public is broadly hostile to Islam, and the Republican base is especially hostile. Sure, we've had one GOP presidential candidate overtly defend the \"American Muslim community,\" but that was just Lindsey Graham - and the Republican base is hostile to Lindsey Graham, too. No one else, even the candidates who won't go so far as to affirm Carson's stance, is going to be seen hugging the neighborhood imam anytime soon.\nFor evidence of this hostility: Look around. A Huffington Post/YouGov survey conducted earlier this year found that only 21 percent of the American public has either a very or somewhat favorable opinion of Islam. Fifty-five percent has either a somewhat or very unfavorable opinion. Among Republicans, 13 percent has either a somewhat or very favorable opinion, while 76 percent has either a somewhat or very unfavorable opinion. (As with many surveys, one imagines the thought process here. Muslims, you ask? You bet I view them somewhat unfavorably!) A 2014 Pew survey found that Muslims were viewed even less favorably than the dreaded atheists; an Arab American institute from the same year found that 57 percent of Republicans \"doubt that Muslim-Americans or Arab-Americans would be able to perform in a government post without their ethnicity or religion affecting their work.\" And not affecting their work in a good way, either.\nAnd there's that other factor:\nForty-three percent of Republicans, per the most recent CNN poll, believe President Obama to be a Muslim. That's a lot of people. They believe that the country has already \"put a Muslim in the White House,\" and the experiment didn't turn out very well. President Obama, in their minds, was unable to perform his government job without his religion affecting his work. Why else would he agree to hand Iran nukes or take it easy on ISIS? Why would we ever put another Muslim in the White House?\nCarson simply did what no one else would do, not even Trump or Fiorina:\nPerhaps we should expect more from potential presidential nominees. Well, go ahead and try that; be sure to tell the rest of us how it works out. Carson's response was so obviously in his political self-interest that it only would've been surprising had he responded a different way.\nTrump and Fiorina make all the noise, but Carson, the quiet man, will go places they wouldn't dare go. One shouldn't underestimate how appealing that is to the angry Republican base, and Jamelle Bouie notes how deceptive this is:\nBen Carson's brand is \"nice.\" \"Carson has the bedside manner of the physician he is,\" says the Christian Science Monitor. \"Ben Carson doesn't shout,\" writes Adam C. Smith for the Tampa Bay Times. \"He doesn't throw zingers, and he rarely disparages rival presidential candidates. In a period when Donald Trump's bluster dominates the 2016 presidential race, Carson seldom says anything provocative enough to generate TV news coverage.\"\nThey got it wrong:\nThe Council on American-Islamic Relations slammed the retired neurosurgeon, who with Donald Trump leads the Republican presidential pack. \"Mr. Carson clearly does not understand or care about the Constitution, which states that 'no religious test shall ever be required as a qualification to any office,'\" said the group's national executive director in a statement.\nThe Carson campaign wouldn't budge. \"Mr. Carson has great respect for the Muslim community,\" said spokesman Doug Watts, \"but there is a huge gulf between the faith and practice of the Muslim faith, and our Constitution and American values.\" Despite the reality of the American Muslim community, which is as loyal and patriotic as any group of Americans, Carson - the soft-spoken, genial doctor who runs on his religious faith - believes they are unqualified for high public office and that Islam is fundamentally incompatible with \"American values.\"\nBut this isn't shocking. Of course Carson believes in the disloyalty of American Muslims. His genial reputation conceals a deep commitment to paranoid politics, honed over years of conservative activism and deployed in speeches, op-ed columns, and now a presidential campaign.\nBouie reviews the record:\nAt the Values Voter Summit in 2013, for example, he compared the Affordable Care Act - President Obama's signature health care law - to chattel slavery. \"You know Obamacare is really I think the worst thing that has happened in this nation since slavery,\" said Carson in his remarks to the conservative gathering. \"It is slavery in a way because it is making all of us subservient to the government, and it was never about health care. It was about control.\"\nThere's no question this is outrageous. But it pales next to the reactionary paranoia of much of his other rhetoric. \"I mean, our society is very much like Nazi Germany,\" he said last year, in a rant against \"political correctness.\" \"You know, you had a government using its tools to intimidate the population. We now live in a society where people are afraid to say what they actually believe.\"\nIf political correctness is akin to German fascism, then it's no shock the doctor thinks the IRS is a bona fide secret police. \"You know, we live in a Gestapo age, people don't realize it,\" he said, in reference to the federal tax agency. He believes that President Obama might suspend elections in 2016, that Democrats want immigrants to increase the welfare population and keep themselves in power, and that - as he explained in the first Republican presidential debate this year - Hillary Clinton and \"the progressive movement\" are \"trying to destroy this country\" by driving up the national debt and stepping \"off the stage as a world leader.\"\nThis is beyond Trump and Fiorina:\nCarson, the doctor, is a brilliant pediatric neurosurgeon. Carson, the candidate, is a crank - a creature of deep suspicion and conspiratorial thinking, who gives the mainstream a rare glimpse into the American Negative Zone of far-right fear and fetid fever dreams. There, anti-Muslim prejudice is common and unapologetic while Carson's claim - that Islam is inherently anti-American - is axiomatic. Given his political background, his remarks were typical, if not even expected. …\nIf his comments surprised, it's because of his style. Carson's gentle affect is his greatest asset; it soothes listeners and obscures the degree to which he's the most extreme candidate in the race. With that said, he's a Kessel Run away from the Republican nomination. Barring the catastrophic collapse of every other \"establishment\" or conventional candidate, he has little chance of becoming the GOP nominee, much less president. But that's no consolation.\nThat may not matter:\nRight now, the top candidates in the Republican primary are a nativist demagogue and a right-wing paranoiac. They're channeling and emboldening the worst impulses in American politics, and winning the polls because of it. They will fall, but not before making a dangerous, and potentially enduring, mark on our politics.\nAnd Bouie doesn't even mention Carly Fiorina, the new Queen of Mean. Leona Helmsley step aside. You didn't destroy Hewlett-Packard, lay off tens of thousands of Americans and send their jobs to Asia, and get rich. You went to jail. Carly Fiorina is running for president – but Ben Carson, the quiet man, is the sleeper here. He's not mean – bat-shit crazy maybe, but not mean.\n\nThere's another factor at play here too. Leah Wright Rigueur is an Assistant Professor of Public Policy at the Harvard Kennedy School and the author of The Loneliness of the Black Republican: Pragmatic Politics and the Pursuit of Power so she sees this:\nThat an African American that has never held political office is now a front-runner in the Republican primaries has surprised many observers. But his candidacy is perhaps less surprising if you consider two things: the long traditional of black conservatism in America, and how black Republicans like Carson have often appealed to largely white voters. …\nAfrican Americans are no strangers to conservatism. It crops up in the 19th and early 20th centuries, especially among black churches, despite their political radicalism. Conservative thinking was evident even in some of the most progressive civil rights leaders of the 1960s and 1970s. Even today, studies have shown that about a third of black people self-identify as conservative, although their conservatism rarely translates into support for the Republican Party.\nnd this is how we make sense of Ben Carson. He comes from a long conservative tradition, one that is rooted in a belief in religious morality, personal responsibility, self-help, individualism and free-market enterprise, and one that sometimes exists outside the boundaries of partisanship. Some have attributed Carson's switch from ardent Democrat to conservative Republican as a matter of opportunism. That may very well be true, but Carson's book, Gifted Hands, indicates that he has long exhibited the kind of \"everyday black conservatism\" that defines a portion of black communities. … It's a rhetoric that conservative audiences, almost exclusively white, embrace.\nThen there's the matter of race:\nFor white conservative audiences, Carson is \"safe.\" His words on racism, for instance, while profoundly critical of racist acts, differ sharply from the words of black liberals. For Carson, racism is something to be changed through individual acts rather than something to be eradicated through structural change. Conservative voters can thus look at Carson and have their personal beliefs on race validated, especially because a black man is articulating these same beliefs.\nHe has all his bases covered. Ben Carson, not Donald Trump, may be the man of the moment. You have to watch out for the quiet ones. And yes, they're often dangerously crazy. But that's what the Republicans seem to want this time.", "source": "Just Above Sunset"}