{"published": "2015-09-13T14:09:49Z", "media-type": "News", "title": "7 reasons why our marriage works -- and how to make yours work too", "id": "ed17304d-81f1-4329-bc5b-ac381e5223e5", "content": "After decades of marriage, we’ve figured out a few things. Here are seven actions that have helped make our marriage work. 1. Put a sock in it. Not in your mate’s mouth — in your own. When you’re annoyed by your spouse, don’t automatically spout off with, “How many times do I have to tell you to ... ?” Give things a chance to cool down. Mostly you will find that ignoring a few unimportant things pays off. You’ve heard the saying, “Don’t make a mountain out of a mole hill.” It applies to a lot of silly situations in marriage. There is nothing to be gained by making a big deal out of something that is simply not worth the fight. Ask yourself, will this even matter tomorrow? Most things won’t. 2. Buck up and take the blame. When you’ve done something stupid or unkind, apologize for it. Be responsible for your mistakes and step forward in a better direction. Only when people acknowledge their part in a problem can change happen. Along with this, be forgiving when your mate apologizes. Holding a grudge in marriage is a catastrophe waiting to happen. Don’t let ill feelings build up. Apologize and forgive. Then hug. 3. Kiss like there’s no tomorrow. Savor those kisses. Keep them coming, daily -- several times a day. Never be too busy to greet each other with a kiss, one that is filled with honeymoon-type passion. This will stoke your romantic fires and keep your hearts warm for all the years of your lives, especially when the words “I love you” are spoken along with those kisses. 4. Work like the devil to stay out of debt. Too much debt is an enemy to marriage. Any debt is a burden. Some experts say there are two purchases that warrant their monthly payments — a house and a car. When you do stick your neck out for these items, make sure to keep it within your budget. Think, what would we do if we lost our jobs? That will help you be wiser in your purchases. Pay these debts off as quickly as possible. For other things you think you can’t live without, save up. Paying cash will save you a ton of interest and make it possible for you to have more of the things your really want and need. 5. Get giddy over making your spouse happy. Think of things you can do that will put a big smile on your honey’s face. You know what she or he likes, so make it happen — often. It doesn’t have to be much. Making the bed in the morning, going for a walk together, getting excited over your mate’s promotion, snuggling the kiddies, helping with their care, noticing how cute your wife looks and telling her, or how handsome he looks and telling him. We all love compliments, especially from the ones we love most. Do everything in your power to help your mate feel those happy feelings. Page 2 of 2 - 6. Be an elephant when it comes to remembering important dates. It’s simple nowadays. All you have to do is program it into your smart phone or computer. Easy peasy. Just do it. Always remember your wedding anniversary and your mate’s birthday. Those are a must. Think about ways to spoil your spouse, even if it's just with one rose, or one package of BBQ ribs. Do something to make the day special for her or him. Make it as nice as your wallet can handle. Think about it beforehand, even plan together in advance for a special date. Looking forward can be as fun as the actual happening. 7. Kick the word divorce out of your vocabulary. When it comes to your relationship, that word is an absolute no-no. You don’t even use it in jest. Make the decision together that your marriage is going to last. Be committed — both of you — verbally to each other. Then stand by that commitment all the days of your life. And not only stand by it, but make it happen by showing respect, loyalty and love for each other in all you do. Then the lasting will be joyful. This is not an all-inclusive list. So many more things can be a blessing to your marriage. Take a minute and list a few of the ones that have helped strengthen your marriage. Then express appreciation to your spouse for doing his or her part in helping your marriage blossom into the beautiful relationship it is becoming.", "source": "GalvaNews.com"}