{"published": "2015-09-01T20:35:49Z", "media-type": "News", "title": "HeartWare International Enters Into Definitive Agreement To Acquire Valtech Cardio, Ltd.", "id": "03376461-adb0-42c0-b606-1d51b7e786aa", "content": "HeartWare International, Inc. (Nasdaq: HTWR), a leading innovator of less invasive, miniaturized circulatory support technologies that are revolutionizing the treatment of advanced heart failure, announced today that it has entered into a definitive agreement to acquire Valtech Cardio, Ltd. (\"Valtech\"). Valtech is a privately held company that specializes in the development of innovative surgical and transcatheter valve repair and replacement devices for the treatment of the most prevalent heart valve diseases - mitral valve regurgitation (MR) and tricuspid valve regurgitation (TR). \n\nhttps://photos.prnewswire.com/prnvar/20150901/262901LOGO https://photos.prnewswire.com/prnvar/20150901/262902LOGO \n\nThe vast majority of patients with MR and TR also suffer from advanced heart failure, and the progression of heart failure can accelerate considerably as a result of valvular dysfunction. Patients with advanced heart failure who receive a ventricular assist device (VAD), like HeartWare's HVAD® System, commonly undergo a concomitant, therapeutic mitral or tricuspid valve procedure. This transaction provides HeartWare with a highly complementary portfolio of technologies to broaden the treatments it offers heart failure patients and enhance patient outcomes. \n\nMR is a condition in which the mitral valve leaflets fail to close properly, allowing backflow of blood from the left ventricle into the left atrium during systole. Left untreated, severe MR can eventually lead to a meaningful deterioration in cardiac function and, eventually, death. Approximately 4.2 million patients are affected by mitral valve disease in the U.S., which represents a several-billion-dollar market opportunity. TR is estimated to affect 1.6 million patients in the U.S. and complements the mitral patient population, as a significant percentage of patients suffer from both MR and TR. \n\n\"We have been actively monitoring the mitral space for several years, given the overlap of patient population and referral channel with our VAD business,\" said Doug Godshall, President and CEO of HeartWare. \"We identified Valtech as having the broadest, most compelling portfolio several years ago, which led to an investment in 2013. This investment gave us a unique opportunity to observe Valtech's significant progress across their portfolio of valve repair and replacement technologies. It is from this vantage point that we have concluded that Valtech's platforms represent the most innovative and comprehensive portfolio of interventional and surgical products for mitral and tricuspid repair and replacement in development today. Valtech provides HeartWare with commercial-stage products for mitral repair, as well as a robust technology pipeline, an advanced R&D center and an impressive, experienced team with a proven track record. This combination represents an attractive opportunity for value creation for HeartWare shareholders, customers, employees and patients by expanding HeartWare's footprint in the high-growth structural heart market.\" \n\nSince incorporation in 2005, Valtech has developed an expansive portfolio of innovative technologies for the treatment of mitral and tricuspid valve disease. Highlights of Valtech's product platforms include: \n\n-- Cardioband® is the first interventional, transfemoral, direct annuloplasty system designed for mitral and tricuspid repair. To date, Cardioband has been used to treat more than 50 patients and is expected to receive CE Mark approval for mitral valve repair in 2015. Following regulatory approval, Cardioband is expected to be commercially launched on a limited basis in Europe in late 2015. A U.S. Investigational Device Exemption (IDE) is planned for submission in 2016. The first human procedures using the Cardioband system, modified for the treatment of tricuspid valve disease, are anticipated in late 2016. \n\n-- Cardinal(TM) is a differentiated, semi-rigid, adjustable annuloplasty ring system that provides surgeons with the ability to optimize annuloplasty results by enabling fine-tuning of the ring diameter and leaflet coaptation on a beating heart under real-time echocardiographic guidance. To date, Cardinal has been used to treat more than 75 patients globally. Already CE Mark-approved for mitral repair, production scaling will drive an anticipated commercial launch in 2016 for mitral repair, followed by tricuspid repair in 2017. \n\n-- CardioValve(TM) is a transseptally delivered, low-profile, transcatheter mitral valve replacement (TMVR) system with five degrees of steering maneuverability. The CardioValve platform has an orientation-indifferent structure for reduced implant complexity, was designed from inception to enable transseptal delivery, and can also be delivered transapically. CardioValve is currently being tested in chronic animal studies and is anticipated for human clinical studies in early 2017. \n\n-- V-Chordal® is a surgical and interventional chord replacement system for MR repair. V-Chordal, which has been successfully evaluated in a first-in-man clinical trial, is expected to expand the range of percutaneous solutions offered for treating degenerative mitral valve pathologies and allow more patients to be treated without the risk of open-heart surgery. The timing for a CE Mark study is being evaluated in relation to the commencement of multiple other Valtech trials. \n\n\"Valtech's robust portfolio of repair and replacement technologies provides us with the most comprehensive product suite to treat the mitral and tricuspid populations. We believe it will be critical to offer patients and physicians a multifaceted approach in the treatment of MR and TR, with both repair and replacement options,\" added Mr. Godshall. \"The mitral repair market is already a well-established and rapidly growing market with a significant, unmet, immediate clinical need. The Cardioband transfemoral annuloplasty system represents a more reproducible and predictable platform for mitral valve repair than existing solutions. We believe Cardioband will be a natural and clear selection as a first-line treatment for the broadest spectrum of MR patients, since it offers a safer option and, even in early clinical use, has already demonstrated a strong efficacy profile.\" \n\n\"Valtech has benefited significantly from HeartWare's early investment in our company. Since then, we have developed a strong relationship based on a shared mission to deliver transformative products to patients with advanced heart failure and degenerative heart conditions,\" said Amir Gross, Founder and CEO of Valtech. \"By joining HeartWare, we can more quickly and fully realize the potential of our pipeline technologies and further influence the underpenetrated markets that we serve. HeartWare's existing market development experience and commercial infrastructure provide a compelling platform from which to launch multiple products worldwide, including a near-term launch of Cardioband in international markets following anticipated CE Mark approval this year. Together, we can offer clinical heart failure teams a compelling portfolio of surgical and interventional technologies to serve the advanced heart failure population.\" \n\nStrategic and Financial Benefits of the Transaction \n\n-- Significant Market Expansion Opportunity - By expanding its footprint into the high-growth structural heart market, HeartWare establishes itself as one of the most broadly equipped leaders in the treatment of patients with advanced heart failure. This acquisition provides HeartWare with multiple, innovative, new, commercial opportunities in the significantly underserved areas of mitral and tricuspid valve diseases, from which many VAD patients today also suffer. \n\n-- Comprehensive Technology Portfolio - Valtech's pipeline offers a comprehensive product portfolio of progressive technologies across four platforms, including two near-term commercial-stage products. The acquisition accelerates and expands HeartWare's ability to deliver transformative technologies to patients and customers with a range of innovative VAD and valve therapies, leveraging the clinical overlap of the heart teams performing these procedures. \n\n-- Commitment to Improving Patient Outcomes - Valtech has developed repair and replacement technologies that can be delivered via the transseptal approach, which offers a safer, less-invasive delivery method for patients. Valtech's product platforms align with HeartWare's strategic objective of delivering transformative, less-invasive therapies for patients with chronic heart failure. \n\n-- Innovative and Experienced Team - The strength of HeartWare's existing leadership team and commercial, manufacturing and development organizations, coupled with Valtech's experienced and inventive R&D team, creates a world-class organization of experts well-suited to develop and commercialize breakthrough technologies for advanced heart failure patients. HeartWare plans to lead the commercialization of the Valtech product portfolio, while maintaining Valtech as a separate business unit. \n\n-- Enhanced Platform for Growth - The combined portfolio provides HeartWare with leading technologies in two of the highest-growth markets in heart failure today. We believe this portfolio positions HeartWare to deliver accelerated revenue growth and attractive shareholder returns over time. \n\nTerms of the AgreementAccording to the terms of the agreement, Valtech shareholders will receive an up-front consideration of 4.4 million shares of HeartWare common stock; 800,000 shares of HeartWare common stock, contingent upon CE Mark approval for Cardioband; and 700,000 shares of HeartWare common stock upon the earlier of first-in-man implants for either Cardioband tricuspid or CardioValve. The transaction also includes warrants to purchase 850,000 shares of HeartWare common stock at an exercise price of $83.73 per share (based on a volume weighted average price of HeartWare shares) exercisable upon attainment of $75 million in net sales (trailing 12 months) of Valtech products, and an earn-out payment of $375 million (payable in cash or stock, at the discretion of HeartWare), upon attainment of $450 million of net sales (trailing 12 months) of Valtech products. \n\nThis transaction was approved by the Boards of Directors of HeartWare and Valtech, with holders of more than 70% of Valtech's shares having signed support agreements committing to the transaction. The transaction is subject to regulatory approvals, as well as HeartWare stockholder and Valtech shareholder approvals. The closing of the transaction is expected in late 2015. \n\nPerella Weinberg Partners is acting as financial advisor to HeartWare, and Canaccord Genuity Inc. provided a fairness opinion to the Board of Directors of HeartWare in connection with the transaction. \n\nInvestor and Analyst Conference Call and WebcastHeartWare will hold a conference call to discuss the transaction on Sept. 1, 2015 at 5:00 p.m. EDT. The conference call may be accessed by dialing 1-877-407-0789 five minutes prior to the scheduled start time and referencing \"HeartWare.\" For callers outside the U.S., please dial +1 (201) 689-8562. A slide presentation to accompany commentary may be accessed in the Investors section of HeartWare's website at http://ir.heartware.com. \n\nA live webcast of the call may be accessed in the Investors section of HeartWare's website at http://ir.heartware.com. A replay of the webcast will be available through the same link above immediately following completion of the call. \n\nAbout Valtech Cardio Valtech Cardio, Ltd., founded in 2005, is a privately held company specializing in the development of devices for mitral and tricuspid valve repair and replacement. Valtech Cardio has full, in-house development, manufacturing, and clinical research capabilities, and over 130 patents and patent applications. The company, comprised of multidisciplinary development teams, works in close collaboration with world-renowned heart specialists to provide the best possible therapy for mitral patients. Valtech Cardio is headquartered in Or Yehuda, Israel. For more information, visit the company's website: www.valtechcardio.com. \n\nAbout HeartWare InternationalHeartWare International, Inc. develops and manufactures miniaturized implantable heart pumps, or ventricular assist devices, to treat patients suffering from advanced heart failure. The HeartWare® Ventricular Assist System features the HVAD® pump, a small full-support circulatory assist device designed to be implanted next to the heart, avoiding the abdominal surgery generally required to implant competing devices. The HeartWare HVAD System is approved in the United States for the intended use as a bridge to cardiac transplantation in patients who are at risk of death from refractory end-stage left ventricular heart failure, has received CE Marking in the European Union and has been used to treat patients in 46 countries. The device is also currently the subject of a U.S. clinical trial for destination therapy. For additional information, please visit www.heartware.com. HeartWare International, Inc. is a member of the Russell 2000®, and its securities are publicly traded on The NASDAQ Stock Market. \n\nParticipants in the SolicitationHeartWare, Valtech and their respective directors, executive officers, certain members of management and certain employees may be deemed to be participants in the solicitation of proxies in connection with the proposed transaction. A description of the interests in HeartWare of its directors and executive officers is set forth in HeartWare's proxy statement for its 2015 Annual Meeting of Shareholders, which was filed with the Securities and Exchange Commission (the \"SEC\") on April 30, 2015. This document is available free of charge at the SEC's website at www.sec.gov or by going to HeartWare's Investors page on its corporate website at www.heartware.com. Additional information regarding the persons who may, under the rules of the SEC, be deemed participants in the solicitation of proxies in connection with the proposed transaction, and a description of their direct and indirect interests in the proposed transaction, which may differ from the interests of HeartWare stockholders or Valtech shareholders generally, will be set forth in a proxy statement/prospectus when it is filed with the SEC. \n\nAdditional Information and Where You Can Find ItA new holding company will file a Registration Statement on Form S-4 containing a joint proxy statement/prospectus and other documents concerning the proposed transaction with the SEC. Investors are urged to read the joint proxy statement/prospectus when it becomes available and other relevant documents filed with the SEC because they will contain important information. Security holders may obtain a free copy of the proxy statement/prospectus (when it is available) and other documents filed by HeartWare and the new holding company with the SEC on the SEC's website at www.sec.gov. The joint proxy statement/prospectus and other documents may also be obtained for free by contacting HeartWare Investor Relations by e-mail at investors@heartware.com or by telephone at +1 (508) 739-0864. \n\nForward-Looking Statements This announcement contains forward-looking statements that are based on management's beliefs, assumptions and expectations and on information currently available to management. All statements that address operating performance, events or developments that we expect or anticipate will occur in the future are forward-looking statements, including without limitation our expectations with respect to the: commercialization of HeartWare and Valtech products; timing, progress and outcomes of clinical trials and regulatory approvals; research and development activities; our ability to integrate, manage and take advantage of acquired and pipeline technology; and the costs and benefits to be achieved from the Valtech transaction. Management believes that these forward-looking statements are reasonable as and when made. However, you should not place undue reliance on forward-looking statements because they speak only as of the date when made. HeartWare does not assume any obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as may be required by federal securities laws and the rules and regulations of the SEC. HeartWare may not actually achieve the plans, projections or expectations disclosed in forward-looking statements, and actual results, developments or events could differ materially from those disclosed in the forward-looking statements. Forward-looking statements are subject to a number of risks and uncertainties, including without limitation those described in Part I, Item 1A \"Risk Factors\" in HeartWare's Annual Report on Form 10-K filed with the SEC. HeartWare may update risk factors from time to time in Part II, Item 1A \"Risk Factors\" in Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, or other filings with the SEC. \n\nHEARTWARE, HVAD, MVAD, PAL, SYNERGY, CIRCULITE and HeartWare logos are trademarks of HeartWare, Inc. or its affiliates. VALTECH, CARDIOBAND, CARDINAL, CARDIOVALVE, V-CHORDAL and Valtech logos are trademarks of Valtech Cardio, Ltd. \n\nFor additional information:Christopher TaylorHeartWare International, Inc.Email: ctaylor@heartware.com Phone: +1 (508) 739 0864 \n\nLogo - http://photos.prnewswire.com/prnh/20150901/262901LOGO Logo - http://photos.prnewswire.com/prnh/20150901/262902LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/heartware-international-enters-into-definitive-agreement-to-acquire-valtech-cardio-ltd-300136319.html \n\nSOURCE HeartWare International, Inc. \n\nhttp://rt.prnewswire.com/rt.gif?NewsItemId=LA91886&Transmission_Id=201509011615PR_NEWS_USPR_____LA91886&DateId=2015", "source": "Individual.com"}