{"published": "2015-09-02T22:24:32Z", "media-type": "Blog", "title": "Suspects wanted in Philadelphia taxi-cab robberies", "id": "1f141263-979c-444e-b396-951ba90310a4", "content": "NEWS\tSuspects wanted in Philadelphia taxi-cab robberies Wednesday, September 02, 2015 06:24PM PHILADELPHIA (WPVI) -- Police are asking the public's help in identifying three suspects wanted for the robbery a taxi driver and two other attempted robberies in Philadelphia.\nAuthorities say that on August 23rd, the trio hailed a cab along the 16-hundred block of Sansom and were taken to 1500 Deal Street.\nThey allegedly pulled a gun on the 39-year-old driver who was able to get away.\nThe first Suspect is described a black male, 17-19-years-of-age, carrying a yellow backpack, and armed with a handgun.\nThe second suspect is a black male, 18-years-of-age, with a round face.\nThe third suspect is a black male, 18-19-years-of-age, beard, wearing a grey or black t-shirt.\nThe suspects tried the same thing the next day but that driver also got away.\nA 53-year-old female was driving a cab for Freedom Cab and picked up three unknown black males in the area of 12th and Race Street.\nThey directed her to the 1500 block of Deal Street when one of the males pointed a handgun at her and demanded money.\nWhen the victim pushed the gun away and all three males fled and were last seen going through a fence on Deal Street.\nNothing was taken and there were no injuries reported during the incident.\nThe first suspect is described a black male, dark complexion, 5'6' tall, 150 lbs. and 17-years-of-age. He has a box hair cut faded on the sides, and wearing a black t-shirt.\nThe second male is a black male, light complexion, 18 years-of-age, 5'9\" tall, 160 lbs. He was clean shaven, wearing dart rust colored shirt.\nThe third suspect is a black male, light complexion, 14-years-of-age, and 100 lbs., 5'5\"-5'6\" tall. He was last seen wearing a tan shirt, and carrying a multi colored book bag.\nFinally, on August 26th, police say a 50-year-old cab driver was picking up a customer on the 4200 block of Orchard Street.\nWhen he arrived he noticed the location was an empty lot and was approached from behind by two suspects.\nThe victim was then hit on the head with a gun and his wallet was stolen.\nThe first suspect is described as a black male, 20-years-of-age, wearing a black t-shirt, green camouflage shorts, and armed with a handgun.\nThe second is a black male, 14-15-years-of-age, wearing a burgundy t-shirt.\nClick here to watch the surveillance video\nIf you recognize the suspects, call 9-1-1. Related Topics:\nnews robbery taxi philly news (Copyright ©2015 WPVI-TV. All Rights Reserved.) Load Comments NEWS Another Gay Couple Denied Marriage License by Kentucky Clerk DC official: Woman tried to grab girl from stroller on train Air show part of Atlantic City's resurgence New food options at Sugarhouse Athletes strive to avoid concussions More News Top Stories Papal visit: Ticket info, pedestrian routes, banned items DA: North Penn grad shared explicit pics of classmates 4 dead in Jersey shore house fire that may be murder-suicide AG rules 2013 Trenton shooting justified In Philadelphia, Kerry seeks support for Iran nuclear deal One-on-one: Matt O'Donnell interviews John Kerry Fun, excitement fly high at AC Air Show Show More FOP: Wait to ID police officers involved in shootings Vehicles damaged in Gloucester Twp. vandalism spree DA: Delco woman stole $88,500 from dying neighbor AccuWeather: Heat Wave Continues Delco man accused of stealing charity jar for military member More News Map My News Photos PHOTOS: Celebrities join 'Dancing with the Stars' season 21 cast PHOTOS: Deadly crash in Northeast Philadelphia PHOTOS: Action News in Louisiana after Katrina PHOTOS: Inside Alicia Keys' NJ home on the market for $14.9 million More Photos Home AccuWeather Traffic Local News PhiladelphiaPennsylvaniaNew JerseyDelaware Map My News Categories Video Photos U.S. & World Healthcheck Consumer Saving with 6abc Community News Sports Station Info About 6abc/Contact Us! Action News Biographies 6abc Contests & Promotions TV Listings Jobs & Internships at 6abc Community Shows Watch Action News Online FYI Philly Puerto Rican Panorama Live Well Network Laff TV Mobile Apps GO Follow Us Home AccuWeather Traffic Video Photos Mobile Apps Map My News PhiladelphiaPennsylvaniaNew JerseyDelaware U.S. & World Healthcheck Consumer Saving with 6abc Community News Sports About 6abc/Contact Us! Action News Biographies 6abc Contests & Promotions TV Listings Jobs & Internships at 6abc Community Privacy Policy Children's Privacy Policy Your California Privacy Rights Terms of Use Interest-Based Ads Public Inspection File Copyright © 2015 ABC Inc., WPVI-TV Philadelphia. All Rights Reserved. Personalize your weather by entering a location. Sorry, but the location you entered was not found. Please try again. Sections Traffic Video PhiladelphiaPennsylvaniaNew JerseyDelaware Home AccuWeather Traffic Video Photos Mobile Apps Local News PhiladelphiaPennsylvaniaNew JerseyDelaware Map My News Categories U.S. & World Healthcheck Consumer Saving with 6abc Community News Sports Troubleshooters Investigation Entertainment Politics 6abc Loves the Arts Jim Gardner One-on-One Station Info About 6abc/Contact Us! Action News Biographies 6abc Contests & Promotions TV Listings Jobs & Internships at 6abc Community Shows Watch Action News Online FYI Philly Puerto Rican Panorama Live Well Network Laff TV Map My News Join the Action! Send your pictures and videos to Action News! Follow Us GO Follow Us Privacy Policy Children's Privacy Policy Your California Privacy Rights Terms of Use Interest-Based Ads Public Inspection File Copyright © 2015 ABC Inc., WPVI-TV Philadelphia", "source": "6abc.com RSS Feed"}