{"published": "2015-09-21T06:02:11Z", "media-type": "News", "title": "Construction vs. Maintenance: Do You Know Which OSHA Standards Apply?", "id": "3c3eb2ed-5c83-442d-bc0a-9d9e3c572c5b", "content": "By Charles B. Palmer  and Miguel A. Manriquez \nFor a Limited Time receive a FREE Safety Special Report on the \"50 Tips For More-Effective Safety Training.\"  Receive 75 pages of useful safety information broken down into three training sections. Download Now  \nYou send workers up on the flat roof to fix an HVAC unit. Is  the work considered “maintenance,” covered under OSHA’s general industry fall protection  rules, or “repair,” subject to OSHA’s construction rules? You send workers in  to a tank to clean and paint it. Is the work covered under OSHA’s confined  space rule for general industry or under the new OSHA confined spaces in  construction rule? You may be surprised at the answer. \n \nGeneral industry operations (manufacturing,  health care, service, retail, trucking transportation, etc.) are covered under  standards contained in 29 CFR 1910, while construction work is governed by 29  CFR 1926.  However, the type of work that  employees are performing on any given day, not the industry in which they are  employed, dictates the applicable standards. \n \nFor example, when a  manufacturer’s employees are engaged in building an addition onto the  employer’s plant, they may be covered by construction standards. Mobile  factories, tool yards, and fabrication plants can be covered by the  construction standard, provided they are “dedicated exclusively, or nearly so,  to performance of the contract or project, and are so located in proximity to  the actual construction location that it would be reasonable to include them.” \n \nMere delivery to a construction  site is not construction work; however, the amount of time spent at a site  discharging a load, regular and recurring deliveries, and time spent erecting,  repairing, or dismantling delivered materials at a construction site are  factors that may determine if a delivery is subject to construction regulations. \n “Construction” and “Maintenance” Defined  \n“Construction work” is defined in  both § 1910.12(b) and in § 1926.32(g) as “work for construction, alteration,  and/or repair, including painting and decorating.” Maintenance work is covered  by the general industry standards. \n \nAlthough there is no regulatory  definition for \"maintenance,\" an OSHA letter of interpretation from November  18, 2003 defines “maintenance” as making or keeping a structure, fixture, or  foundation (substrates) in proper condition in a routine, scheduled, or  anticipated fashion. An employer should make the distinction between  construction and maintenance on a case-by-case basis. \n Construction vs. Maintenance: Factors to Consider  \nThe following are relevant  factors and examples set forth by OSHA to help distinguish between construction  and maintenance: \n The scale  and complexity of the task (large scale tasks and objects indicate  construction). This takes into consideration concepts such as the amount of  time and material required to complete the job.  For example, if a steel beam in a building had  deteriorated and was to be replaced by a new, but identical beam, the project  would be considered a construction repair rather than maintenance because of  the replacement project's scale and complexity.    Whether  the task improves the original condition or preserves it (improvement  indicates construction, preservation indicates maintenance). Construction work  is not limited to new construction, but can include the repair of existing  facilities or the replacement of structures and their components.  For example, the replacement of one utility pole  with a new, identical pole would be maintenance; however, if it were replaced  with an improved pole or equipment, it would be considered construction;  Whether  the task is scheduled at regular intervals (indicating maintenance). This  factor must be considered in light of the scale and complexity of the project.  For example, if the painting of power poles is  an anticipated, routine, and periodic event to keep them from degrading and to  maintain them in their original condition, then the painting is generally  considered maintenance work. However, if a bridge was to be stripped and  re-painted, that would be considered construction work even if the repainting  were done on a scheduled basis because of the complexity and scale.  The  system-wide impact of the task (major disruptions indicate construction)  Removing  and replacing a valve in a processing system would be considered construction if  the valve constitutes a major portion of the equipment it is in and much of the  rest of the system's parts must be moved or altered in the process of doing the  job.  \nWhen deciding  between maintenance and construction, keep in mind that the prevalence of one  or two factors may be sufficient to determine the appropriate standard. \n Tips for compliance  \nConstruction  industry employers should evaluate the work that is performed by employees away  from actual construction sites and determine the applicability of general industry  standards to that work. Complex standards, such as the OSHA Lockout/Tagout  standard (29 CFR 1910.147), Confined Space (29 CFR 1910.146) and Forklift  Certification and Training (29 CFR 1910.178) are but a few of the general  industry standards that often apply to construction employers for tasks  performed away from actual construction sites.  \n \nGeneral  industry employers who engage employees to perform construction work should be  aware of 29 CFR 1926.20 and .21. Together, these two standards require an  employer to develop safety programs to provide for regular and frequent inspections  of the job site, materials, and equipment by a competent person; to only permit  employees qualified by experience and training to operate equipment or  machinery on the job site; and to instruct each employee in the recognition and  avoidance of unsafe conditions and the regulations applicable to his work  environment. \n \nTherefore, if  an employer’s employees engage in construction work as described above, the  employer is required to understand, to teach employees to understand, and to enforce  the applicable construction industry standards. \n \nIn many cases,  depending on the size of the job, it may be safer and less expensive to engage  construction contractors to perform construction work than to train  non-construction employees to do the work.  \n \nFor more  information, please contact your Michael Best attorney or Charles B. Palmer at cbpalmer@michaelbest.com or  262.956.6518; or Miguel A. Manriquez at mamanriquez@michaelbest.com or  608.257.3", "source": "Safety.BLR.com"}