{"published": "2015-09-03T15:03:18Z", "media-type": "Blog", "title": "Re: [AvC] Re: 7 year old atheist banished from school", "id": "5a39e350-4bab-4e7d-b4de-c05e8a4fc092", "content": "In case anyone missed the connection, this is why America the Beautiful needs an ACLU. \nIf the average Christian had any sense of fairness and compassion at all such an organization would not be necessary. \nLL\nOn Sep 3, 2015, at 5:22 AM, \"'Dingbat' via Atheism vs Christianity\"<atheism-vs-christianity@googlegroups.com> wrote:\nOn Thursday, September 3, 2015 at 7:03:20 AM UTC-4, Dingbat wrote:\nOn Wednesday, September 2, 2015 at 11:17:22 PM UTC-4, GT wrote:\nOn Thursday, September 3, 2015 at 5:08:30 AM UTC+10, Dingbat wrote:\nNot quite; he seems to have been barred from close contact with classmates.\nhttp://rebrn.com/re/school-banishes-yo-student-for-saying-he-doesnt-believe-in-god-427859/\nsomeone who, because he showed opposition to there being a God, is told he shouldn't be in contact with others in his school.\n... or is it because the girl showed opposition to his not falling in line with her and other theist pupils' belief in God? Could it be for his protection from her hostility and in the view of the school, the potential for other theist pupils' hostility upon her informing them about his lack of theism, that they set him apart from other pupils?\n \nTo put the question another way, if she'd responded, \"Ah, I see,\" would the school have set him apart from other pupils?\n \nA case in point:\nhttp://www.rt.com/usa/311664-school-child-lawsuit-god/\nDavid Norris 06.08 16:14\nI recall in Highschool, in Indiana, that one time a student stated she wished not to participate in any Easter related activities because they were blasphemous. She explained why (bunny rabbits and jesus and whatnot) to the class and everyone supported her decision, atheists, muslims, hindus, buddhists and a sikh as I recall in that class. We all had a brief laugh about people worshipping rabbits that lay eggs and went on with life. Imagine if the jackass teachers had taken that approach instead of shaming the child. The girl who cried would have learned a valuable lesson in understanding other belief systems and the boy would not have been punished and scarred for the rest of his time in that school system. -- You received this message because you are subscribed to the Google Groups \"Atheism vs Christianity\" group.\nTo unsubscribe from this group and stop receiving emails from it, send an email to atheism-vs-christianity+unsubscribe@googlegroups.com.\nVisit this group at http://groups.google.com/group/atheism-vs-christianity.\nFor more options, visit https://groups.google.com/d/optout.", "source": "Atheism Versus Christianity"}