{"published": "2015-09-01T00:26:03Z", "media-type": "News", "title": "Thousands of pounds of NHS funds 'spent on treats for patients'", "id": "bb0fb97f-730f-47ca-b39a-db150429616c", "content": "Thousands of pounds of NHS cash is being spent on treats for patients, including  holidays, aromatherapy, new clothes and a summer house, according to an investigation. \n \r\n\t\t\r \nPersonal health budgets are being spent on activities such as horse riding, art classes, massage and personal trainers, Pulse magazine found. \n\r  Together with an NHS team or GP, patients can develop a care plan on how the money should be spent \r \r \nThe budgets were introduced by the Government to allow people with long-term conditions and disabilities greater choice and control over the healthcare and support they receive. \n\r\n\t\t\t\r \nTogether with an NHS team or GP, patients develop a care plan on how the money should be spent. \n\r\n\r\n\r\n\r \nThe pot of cash can be used to pay for a wide range of services, including therapies to help with depression, help with personal care such as dressing and washing, and equipment. \n\nThe amount of money varies from person to person and depends on a patient's needs. \n\nPulse used the Freedom of Information Act to find out how much was spent in 2014/15 on personal health budgets. \n\nSome 33 Clinical Commissioning Groups out of 209 in England provided full responses. \n\r\n\t\t\t\r \nThe NHS Nene Clinical Commissioning Group (CCG) and the NHS Corby CCG, which handle health money for Northamptonshire, spent £2.55 million between them on personal health budgets for 161 patients. \n\nFrom this, some money was spent on a family holiday to allow a patient to \"re-establish relations\" with their children while another went on holiday with a dog. \n\nCash was also spent on a satnav, new clothes, an iRobot cleaner and the construction of a summer house so one patient could have \"their own space\". \n\nFurther money was spent on  hydrotherapy, shiatsu, Indian head massages, art classes and kitchen equipment, including a food processor. \n\r\n\t\t\t\r \nA spokesman said the money was to achieve outcomes that \"focus on improving an individual's health and wellbeing.\" \n\nHe added: \"All personal health budgets are clinically agreed and monitored.\" \n\nIn Kernow in Cornwall, £267,000 was spent on five people, including £2,080 on aromatherapy, £248 on horse riding and just over £7 on hiring pedalos. \n\nA spokesman said \"We follow national guidance when agreeing personal health budgets.\" \n\nThe NHS Stoke on Trent CCG spent £114,000 between 115 patients, including money for a Wii Fit computer game and more than £1,000 on music lessons. \n\r\n\t\t\t\r \nA spokesman said these were judged to help patients and \"represent excellent value for the NHS.\" \n\nIn Horsham, Crawley and coastal West Sussex, £2.6 million was spent on care packages for 44 people, the highest spend per patient of any of the CCGs. \n\nThe 33 CCGs also submitted details to Pulse of their predicted spend on personal health budgets in 2015/16, with an expected spend of £589,000 each. \n\nExtrapolated across all CCGs, this would lead to a spend of more than £120 million on fewer than 5,000 patients. \n\nDr Richard Vautrey, deputy chairman of the British Medical Association's General Practitioners Committee, said: 'We continue to have real reservations about this scheme and the inappropriate use of scarce NHS money on non-evidence-based therapies. \n\n\"While individuals may themselves value a massage or summer house, others will understandably start to question why they can't also have such things paid for by the state - and that will just fuel demand.\" \n\nDr Vautrey said CCGs were always looking to \"penny-pinch\" in order to maintain current NHS services. \n\nHe said a small loss of income could jeopardise a whole service. He added: \"This can have serious implications for large numbers of people just based on the whims of a small number.' \n\nA spokesman for NHS England said: \"Personal health budgets are designed to meet identified health needs in ways that give patients more control over the care and support they receive. \n\n\"The spending must be agreed between the individual and the NHS, meet the patient's individual health needs and achieve the desired outcomes. \n\n\"An independent evaluation has shown that personal health budgets are cost effective, help people manage their health and improve quality of life.\" \n\nResearch by Nick Watson, professor of health and wellbeing at the University of Glasgow, has found that patients who received the budgets had £4,000 more spent on them than others receiving usual care, irrespective of the complexity of their needs. \n\nHe said: \"The policy fits the current rhetoric - it is very consumerist and individualistic. \n\n\"Looking at the level of resourcing for the project and the evidence it has been based on, I would say it's at best spurious. I think we are going forward on poor evidence and there is a clear ideological drive behind it.\" \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Northamptonshire Telegraph"}