{"published": "2015-09-20T17:09:49Z", "media-type": "News", "title": "Vergara, Delpero victorious at Longboard Pro Vieux Boucau", "id": "526e80a5-cde7-4692-ada6-ee1ce61f5b14", "content": "Longboard Pro Vieux Boucau  \n \nWorld Surf League LQS event \nPlage Centrale Vieux Boucau, France \n​16 - 20 September 2015 \n \nAlice Lemoigne and Antoine Delpero crowned European Longboard Champs \n \nSurfersvillage Global Surf News , 20 September, 2015 -  Vieux Boucau,  France  - Victoria Vergara (FRA), 21, and Antoine Delpero (FRA), 29, have won the Longboard Pro Vieux Boucau in excellent two-to-three foot waves in Vieux Boucau.  \n \nDelpero overtakes younger brother Edouard in the regional rankings to be crowned European Longboard Champion, while Alice Lemoigne (REU), 18, eliminated in the semis, belts second European title watching the women’s final from the sand. \n \nAntoine Delpero and Timothee Creignou (FRA), 29, started their final with an interesting exchange going Delpero’s way with an excellent 8.10 over Creignou’s 5.50. Delpero continued to built momentum and belted a 9.4 to put his opponent in a combination situation he could never recover from. \n \n“I’m super happy, that was a dream final against my good friend Tim,” Delpero said. “I wish it could have been against Edouard but that’s how it goes. Conditions today were absolutely perfect for longboarding and we all were able to display our best surfing out there. I started with good waves early and that made Tim’s job pretty hard. I’m stoked to clinch the European title as well, I had a lot of fun today.” \n \n \nAntoine Delpero © WSL/Poullenot \n \nDelpero previously dispatched of younger brother Edouard in the semifinals, with a buzzer-beater near-perfect score of 9.93. Both Delpero brothers will represent Europe at the upcoming World Longboard Championship event in China, and will look to post a big result when the event commences. \n \n“I don’t have a particular preparation for this event, but we’re starting to know the wave well at Riyue Bay, we’ve been going there for three years.” Delpero continued. “I was a little frustrated last year when I got a 10 and couldn’t back it up.” \n \nCreignou, former semifinalist at the GoPro World Longboard Championship in 2014, couldn’t overcome Delpero’s rhythm but kept his composure in a difficult situation to keep improving his scoreboard throughout the final and try to get out of combination. \n \n“Timing was perfect and we really finished the event in the very best conditions,” Creignou said. “It’s an awesome event, unfortunately I couldn’t find the waves I needed to beat Antoine, I would have loved to win here. It’s a great warm-up for China, and we’re going to have a good team there, we want to keep showing that French and European longboarding are relevant.” \n \nA slow first half of the women’s final saw Vergara and Justine Mauvin (REU) 22, exchange medium waves and average scores before Mauvin caught the first major wave with a long hang five all the way from the outside for a 7.17. Vergara answered shortly after with a 7.57 and kept things interesting for the crowds. \n \n \nJustine Mauvin & ​Victoria Vergara © WSL/Poullenot \n \nBoth surfers went blow for blow on a succession of exchanges with Mauvin taking the lead back on an 8.27 before Vergara, with two minutes remaining in the final, started a ride with a beautiful hang ten followed by a couple of turns for the winning 8.40 ride. \n \n“I’m super happy to win here,” Vergara said. “Waves were really fun and I surfed with one of my best friends. We had a lot of fun, I gave everything I had and was a little bit lucky. It’s cool to surf here with friends and family being able to come support and watch us perform. We have two months now to train for China, I can’t wait to go there again and hope I can better my ninth place from last year.” \n \nA finalist in the opening event of 2015 in Newquay, Mauvin was one heat away from clinching a maiden regional title, but unfortunately couldn’t overcome Vergara’s poise and grace in the clean little peaks of Vieux Boucau in the final. \n \n“That was a fine day of surfing with good friends in super fun waves,” Mauvin reflected. “We both got good scores and it came down to almost nothing. We did our best and really enjoyed competing and putting on a good show. I’m going to keep training, improve and hopefully be ready for China.” \n \nThe European team going to the World Longboard Championships in China will be composed of Antoine and Edouard Delpero, Timothee Creignou, Ben Skinner (GBR), Adam Griffiths (GBR) for the men, and Vergara, Mauvin, Alice Lemoigne (REU) and Lucie Milochau (FRA) for the women. \n \nThe Longboard Pro Vieux Boucau is scheduled from September 18-20, 2015 at Plage Centrale, Vieux Boucau - France. For all results, photos, video highlights and press releases, log on to worldsurfleague.com.  \n \nThe Longboard Pro Vieux Boucau is supported by SeventyOne Percent, La Maison de L’Espadrille, the Conseil Général des Landes, MACS Landes Côte Sud, the city of Vieux Boucau, the Vieux Boucau Surf Club, Surf Report and Virgin Radio among others. \n \nLONGBOARD PRO VIEUX BOUCAU MEN’S FINAL RESULTS: \n1 - Antoine Delpero (FRA) 18.13 \n2 - Timothee Creignou (FRA) 15.40 \n \nLONGBOARD PRO VIEUX BOUCAU WOMEN’S FINAL RESULTS: \n1 - Victoria Vergara (FRA) 15.97 \n2 - Justine Mauvin (REU) 15.44 \n \nLONGBOARD PRO VIEUX BOUCAU MEN’S SEMIFINAL RESULTS: \nSF 1: Timothee Creignou (FRA) 17.00 def. Adam Griffith (GBR) 8.07 \nSF 2: Antoine Delpero (FRA) 18.56 def. Edouard Delpero (FRA) 16.50 \n \nLONGBOARD PRO VIEUX BOUCAU WOMEN’S SEMIFINAL RESULTS: \nSF 1: Victoria Vergara (FRA) 17.66 def. Alice Lemoigne (REU) 13.56 \nSF 2: Justine Mauvin (REU) 11.03 def. Justine Dupont (FRA) 1", "source": "Surfers Village"}