{"published": "2015-09-11T13:15:35Z", "media-type": "News", "title": "Catholic church promotes 'Joke with the Pope'", "id": "046b37f8-8ef7-4ccd-a1f5-5ca7bd9632e8", "content": "(CNN) -  \nYou may not be lucky enough to meet Pope Francis when he visits New York, Philadelphia and Washington later this month. \n \nBut you can still try to make him laugh. \n\nA new digital campaign, \"Joke with the Pope,\" is encouraging people to submit jokes -- no dirty ones, please -- as part of a contest to fund charitable causes, sanctioned by the Catholic Church, that help the world's less fortunate. \n\nBetween now and October 2, anyone -- not just Catholics -- can post a written joke or upload a brief video of themselves telling a joke to JokeWiththePope.org. Contestants choose one of three causes to support: helping street children in Buenos Aires, Argentina; housing the homeless in Addis Ababa, Ethiopia; or feeding the hungry in Nairobi, Kenya. \n\nA panel of judges, with the possible help of actor-comedian Bill Murray, will choose a winner October 5. The funniest joke may even get shared with the pontiff himself. \n\n\"I like to laugh. It helps me to feel closer to God and closer to other people. When we laugh with each other -- and not at each other -- God's love is present in a special way,\" said Pope Francis in a statement provided by the Pontifical Mission Societies, which created the campaign. \n\n\"I invite you to share your joy with a laugh! God longs for you to be happy!\" the pope said. \"Share your jokes and your funny stories: the world will be better, the Pope will be happy and God will be the happiest of all.\" \n\nA handful of celebrities, including magician David Copperfield and TV weatherman Al Roker, have already submitted videos of themselves telling jokes. Conan O'Brien offered this: \"The California drought is so bad, people in Napa are asking the pope to change the wine into water.\" \n\nThe Pontifical Mission Societies will bestow the title of \"honorary comedic adviser to the pope\" on whoever wins the contest and donate $10,000 to the cause chosen by the winner. \n\nThe Catholic Church's official support organization for overseas missions, the Pontifical Mission Societies provide education, health care and other services to the world's neediest people while spreading Christianity around the globe. The mission societies just launched a new mobile app, Missio, to help users explore worthy causes and donate to specific projects. \n\nThe Rev. Andrew Small, national director of the Pontifical Mission Societies in the United States, said the \"Joke with the Pope\" campaign is a way to spread laughter and unite people while helping the world's neediest communities. The campaign is also a tribute of sorts to Pope Francis, who has a well-documented sense of humor. \n\n\"Humor is something that we all share -- every culture, every people,\" Small said. \"If you can tell a joke and laugh at someone else's joke, it shows there's a certain level of comfort with one another.\" \n\nReligious jokes and even pope jokes are welcome, Small said. But contestants must respect limits of decency. In other words, Small said, don't submit a joke you wouldn't tell in front of the pope.", "source": "ABC 17 News"}