{"published": "2015-09-27T16:11:05Z", "media-type": "News", "title": "Rights group demands Chinese supporters of HK democracy be freed", "id": "09e98050-6844-47eb-b9c7-f056b89b3c7e", "content": "By Clare Baldwin \n \nHONG KONG (Reuters) - Amnesty International called on Monday for the release of eight mainland Chinese activists who face long prison sentences for posting messages and pictures supporting Hong Kong's 2014 pro-democracy protests. \n \nSix of the activists, arrested after holding up banners with messages such as \"Support Hong Kong's fight for freedom\", face up to 15 years in prison. \n \nThey have been charged with \"inciting subversion of state power\", \"picking quarrels and provoking trouble\" and \"gathering a crowd to disrupt order in a public place\". \n \nHuman Rights Watch also issued a statement last week demanding the Hong Kong government drop charges against Hong Kong activists, investigate its handling of the city's pro-democracy protests and restart the electoral reform process. \n \nChina's Ministry of Foreign Affairs and its Liaison Office in Hong Kong did not respond to requests for comment. The Hong Kong police and Justice Department also did not respond to requests for comment. \n \nThe Independent Police Complaints Council has said previously it was reviewing complaints from the protests. \n \nMonday marks the one-year anniversary of Hong Kong's pro-democracy protests, during which activists blocked major roads in the city for 79 days to demand open nominations for the city's next chief executive election in 2017. \n \nWhile largely peaceful, the size and duration of the protests - and the fact that they took place in full view of international media, who filmed the activists using umbrellas to defend themselves against police tear gas, pepper spray and batons - raised a serious challenge to China's Communist Party, which has been tightening control over civil society. \n \nCiting the need to buttress national security and stability, President Xi Jinping's administration has tightened government control over almost every aspect of civil society since 2012. \n \nIt has adopted a sweeping new national security law, launched a months-long campaign in state media to discredit human rights activists for undermining national stability by using social media, and recently detained dozens of lawyers and activists. \n \nAccording to the Amnesty report, Chinese activist Sun Feng, who tried to travel to Beijing with his own proposal for Hong Kong electoral reform, and five others - Su Changlan, Chen Qitang, Wang Mo, Xie Wenfei and Zhang Shengyu - face up to 15 years in prison. \n \nActivist Ji Sizun faces up to 10 years in prison and Ye Xiaozheng faces up to five. \n \nSu said she was denied adequate medical treatment and Zhang said he was beaten and chained to a bed for 15 days, according to the report which cited the activists' lawyers. \n \nPresident Xi is returning to China from a state visit to the United States. \n \n(Reporting by Clare Baldwin; Additional reporting by Stella Tsang; Editing by Tom Heneghan)", "source": "Town Hall"}