{"published": "2015-09-29T22:39:00Z", "media-type": "News", "title": "Victory Is Cheesy - Chester Cheetah Inducted Into Madison Avenue Walk Of Fame", "id": "cf8b984d-3f3c-4ce7-bf1c-6527636d6e10", "content": "PLANO, Texas , Sept. 29, 2015 /PRNewswire/ -- Chester Cheetah, the official spokes-cheetah of the Cheetos brand, one of the flagship brands from PepsiCo's Frito-Lay division, has earned his paw print and a permanent place on the Advertising Week Walk of Fame in New York City . The winning brand icons were announced yesterday at the NASDAQ Market Site in Times Square. \n\n\"We're thrilled that fans love Chester Cheetah as much as we do,\" said Jeannie Cho , senior director of marketing, Frito-Lay North America . \"He perfectly embodies the Cheetos brand - he's dangerously cheesy!\" \n   \nInduction into the Advertising Week Walk of Fame is reserved for only the most influential brand icons, and is decided by the general public each year. Chester's cool cat charisma has made him a fan favorite over the years and a spot on Madison Avenue is one step closer in Chester Cheetah's journey to liberate mischief for families everywhere.   \n\nThe Grand Central Partnership and Advertising Week organizers have brought the Walk of Fame to life with a combination of bronze plaques and permanent lamppost street banners on Madison Avenue. The Advertising Week Walk of Fame is made up of icons that have successfully defined brands for years and, according to the organizers, Chester Cheetah has undeniably earned his spot among them. \n\nAbout Cheetos \nCheetos is one of the many brands that makes up Frito-Lay North America , the $14 billion convenient foods business unit of PepsiCo ( NYSE: PEP ), which is headquartered in Purchase, N.Y.  Learn more about Cheetos by visiting www.facebook.com/Cheetos . \n\nAbout PepsiCo \nPepsiCo products are enjoyed by consumers one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $66 billion in net revenue in 2014, driven by a complementary food and beverage portfolio that includes Frito-Lay, Gatorade, Pepsi-Cola, Quaker and Tropicana. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including 22 brands that generate more than $1 billion each in estimated annual retail sales. \n\nAt the heart of PepsiCo is Performance with Purpose – our vision to deliver financial performance over the long term by integrating sustainability into its business strategy, leaving a positive imprint on society and the environment. We do this in part by offering a wide range of products; increasing the number of our nutritious foods and beverages; reducing our environmental impacts; and supporting our employees and the communities where we do business; all of which will help position the company for long-term sustainable growth. For more information, visit www.pepsico.com . \n\nFollow PepsiCo: \nTwitter  (@PepsiCo) Facebook  PepsiCo Blogs  PepsiCo Press Releases  PepsiCo Multimedia  PepsiCo Videos  \n\nPhoto - http://photos.prnewswire.com/prnh/20150929/272124   \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/victory-is-cheesy---chester-cheetah-inducted-into-madison-avenue-walk-of-fame-300151248.html \n\nSOURCE Frito-Lay North America", "source": "A.M. Best"}