{"published": "2015-09-26T14:20:42Z", "media-type": "Blog", "title": "Omega Healthcare eyes more biz and to hire 450 people", "id": "721f89d2-6400-4837-8dd5-1c4b0ddac8ae", "content": "Expected change in U.S. healthcare industry will have a positive rub off on Indian outsourcing sector s the United States gears up to implement the ICD-10 (International Classification of Diseases) coding system from October 1, Omega Healthcare,  an offshore provider of medical revenue cycle services, said this would open up large scale employment opportunities for medical coders, especially in India. “ObamaCare and ICD-10 implementation open up vast opportunities for us as the demand for certified medical coders will go up sharply,” said Gopi Natarajan, Chief Executive Officer and Co-Founder, Omega Healthcare. “The market is hot. Both ObamaCare and migration to the ICD-10 new coding system provides an opportunity which is equal to the Y2K shift, a decade and half ago,” Mr. Natarajan said. Complying with the new regulation, for accurate identification of diseases and reimbursement of health insurance claims to healthcare service providers, will be difficult as the number of codes will go up from 16,000 as per ICD-9 to 1,25,000 codes in ICD-10. As per World Health Organisation, each disease has been assigned with a code based on which service providers get paid. This would require high level of specificity to identify the actual disease or ailment suffered or treated. It calls for very detailed documentation to establish the code and only experienced coders - life science graduates with the adequate training - can help in assigning the code leading to accurate billing. It is believed that the implementation of ICD-10 will change the healthcare industry in United States and the outsourcing industry across the globe and the transition will create huge demand for certified medical coders across the globe, especially in the U.S., Middle East and in India. “We are fully prepared for the change. We already have 2,500 coders from our 9,000 employee base and we will be hiring more people in the coming months,” Mr. Natarajan said. “Ninety seven per cent of our 2,500 coders have been retrained for the transaction. They have undergone 40 hours of training. We project a huge demand for trained coders in the coming months,” he said. Omega Healthcare is on an expansion mode and plans to hire more than 1,000 people by January. While 300 people will be added at its facility at Chennai, 450 people will be hired at Tiruchi and 250 people at Bengaluru. Last year, the company opened a facility at Manila in Philippines where it has employed 400 people and this facility has capacity to accommodate 650 personnel, mainly nurses who take patients’ calls. In three years Omega Healthcare plans to have 13,000 people as the market has potential for growth.     Mr. Natarajan said the company would invest $8 million to $10 million a year from internal accruals to expand capacity to cater to the growing demand for outsourced medical services from the U.S. Medical coding and billing is considered very crucial in the healthcare industry but the Business Process Outsourcing (BPO) industry which provides these services is facing deficit of talent in the sector.", "source": "Trichy on Move"}