{"published": "2015-09-29T13:59:20Z", "media-type": "News", "title": "Total Shareholder Return is Not the Magic Metric Driving Company Performance", "id": "4e5bac84-c46e-4778-91ae-b7c3e3ba2b05", "content": "(BUSINESS WIRE) -- \n \nTotal Shareholder Return (TSR) is not the magic metric driving company \n      performance according to findings from research conducted by the \n      Institute for Compensation Studies at Cornell University's ILR School.(1) \n      Executive compensation consulting firm Pearl Meyer collaborated on the \n      study of S&P 500 companies' use of TSR in long-term incentive plans in \n      order to uncover its impact. \n\nThis Smart News Release features multimedia. View the full release here: \nhttp://www.businesswire.com/news/home/20150929006170/en/ \n\nDespite a sharp increase in the use of TSR in long-term incentive plans, \n      rising from 17% in 2004 to nearly 50% in 2013, the study found that this \n      metric has little to no bearing on the performance of these companies. \n      The research showed: \n\n--\n        There is no evidence that using TSR in an incentive plan improves \n        future TSR; \n\n--\n        There is a weak negative relationship between TSR's use and revenue \n        growth; and \n\n--\n        Firms with TSR-based incentive plans are typically larger (based on \n        market cap and revenue), yet less profitable (based on 10 year \n        compound annual growth rate). \n\n\"As we suspected, the study revealed that TSR does not lead to improved \n      company performance, and our experience as Board advisors tells us it \n      does little to provide line of sight from management's actions to \n      ultimate results,\" said David Swinford, President and CEO of Pearl \n      Meyer. \"However, many companies feel compelled to create an incentive \n      program that aligns well with proxy advisory policies, which use TSR to \n      measure pay-for-performance. Unfortunately, while this approach \n      satisfies external pressures and conforms to market norms, it is not \n      effective.\" \n\nIn a recent opinion survey of executives and outside Directors(2), \n      a significant majority--75% of those surveyed--said the importance of \n      including relative TSR in an incentive plan is either somewhat or very \n      important in response to peer practices, while 56% pointed to investor \n      concerns and more than half (52%) cited the influence of proxy advisory \n      groups. The same study also found that most firms do not believe TSR \n      results accurately reflect the performance of their executive team. \n\n\"The academic literature around TSR awards and firm performance is very \n      limited. This project is an important step in examining compensation \n      plans of top executives and the ultimate sustainable financial success \n      for the firms they lead,\" said Linda Barrington, Executive Director of \n      the Institute for Compensation Studies and one of the study's co-authors. \n\nThe study showed that while more companies are including TSR in their \n      incentive plans, those who more recently implemented TSR-based plans are \n      putting less weight on the metric than those companies who have used it \n      longer. \n\n\"The pressure to use TSR may only become more intense with the SEC's \n      proposed rules to mandate disclosure of pay-for-performance through the \n      TSR lens,\" said Swinford. \"While TSR can be a helpful tool for rewarding \n      executives who outperform peers and it does generally align executive \n      and shareholder interests, it is not fundamentally an effective \n      incentive metric. We understand the reasons for the popularity of TSR, \n      but when the primary objective of an executive compensation program is \n      to better enable strategy execution through incentives, proxy advisory \n      policies and external pressures should be secondary considerations. \n\n\"We believe Compensation Committees would be well served to evaluate \n      other financial and operational measures,\" Swinford said. \"It's our \n      experience that the most effective incentive plan metrics reflect the \n      company's business model, economic cycles and any unique challenges and \n      opportunities facing the organization; and therefore should be chosen on \n      a company-by-company basis to ensure they provide clear alignment with \n      the corporate strategy.\" \n\nStudy methodology \n\nPearl Meyer collaborated with the Institute for Compensation Studies at \n      Cornell University's ILR School to research the use of Total Shareholder \n      Return in incentive plans. Companies included in the study were \n      identified using the 2014 S&P 500 index. Compensation and financial data \n      covers fiscal years 2004 to 2013. Pearl Meyer provided data and insight \n      into how executive compensation is structured in public corporations to \n      ensure statistical models reflected real-world practice and terminology. \n      Technical research was conducted by Cornell University which included \n      empirical examination of TSR's inclusion in long-term incentive plans. \n      Regression analysis was used in the analysis and extensive robustness \n      and sensitivity checks were conducted including controlling for time, \n      industry, and company characteristics. \n\nFor additional information and insight about the study: \n\nTSR, Executive Compensation, and Firm Performance A Brief Prepared by \n      the Institute for Compensation Studies, ILR School, Cornell \n      University, Hassan Enayati, Kevin F. Hallock, and Linda Barrington http://www.ilr.cornell.edu/institute-for-compensation-studies/insights-research \n\nPearl \n      Meyer As We See It - Total Shareholder Return: It's Not the Magic Metric \n\nAdditional resources from Pearl Meyer: \n\nArticle \n      - Compensation as a Catalyst: Value Creation and Executive Compensation \n\nVideo \n      - Balancing TSR as a Long-Term Incentive \n\nAbout Cornell University ILR School Institute for Compensation \n      Studies \n\nThe Institute for Compensation Studies (ICS) is an interdisciplinary \n      center housed in the ILR School of Cornell University. Its mission is to \n      improve teaching, research, practice, and public discourse around \n      compensation and rewards to work by bridging between academic \n      researchers and compensation practitioners. ICS seeks to enhance \n      understanding of how rewards to work can influence outcomes for \n      companies, individuals, and economies. \n\nAbout Pearl Meyer \n\nPearl \n      Meyer is the leading advisor to Boards and senior management on the \n      alignment of executive compensation with business and leadership \n      strategy, making pay programs a powerful catalyst for value creation and \n      competitive advantage. Pearl Meyer's global clients stand at the \n      forefront of their industries and range from emerging high-growth, \n      not-for-profit, and private companies to the Fortune 500 and FTSE 350. \n      The firm has offices in New York, Atlanta, Boston, Charlotte, Chicago, \n      Houston, London, Los Angeles, and San Francisco. \n\n(1) TSR, Executive Compensation, and Firm Performance A \n      Brief Prepared by the Institute for Compensation Studies, ILR \n      School, Cornell University, September 24, 2015 http://www.ilr.cornell.edu/institute-for-compensation-studies/insights-research \n\n(2) Pearl Meyer On Point: Looking Ahead to Executive Pay \n      Practices 2016, September, 2015 www.pearlmeyer.com/executive-pay-practices-2016 \n\nhttp://cts.businesswire.com/ct/CT?id=bwnews&sty=20150929006170r1&sid=cmtx6&distro=nx&lang=en \n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150929006170/en/ \n\nSOURCE: Pearl Meyer \nPearl Meyer \nShawn-Laree O'Neil \n773-802-0377 \nshawnlaree@gmail.com  \nCopyright Business Wire 2", "source": "TradingCharts.com"}