{"published": "2015-09-05T18:13:33Z", "media-type": "News", "title": "Robert W. Baird Reaffirms “Buy” Rating for Joy Global (JOY)", "id": "f96e3a6a-04dd-4cdd-adcd-c0cdcbd0f89b", "content": "Joy Global (NYSE:JOY)‘s stock had its “buy” rating reissued by equities research analysts at Robert W. Baird in a report issued on Saturday, Market Beat reports. \n\nSeveral other brokerages have also commented on JOY. Zacks lowered Joy Global from a “hold” rating to a “sell” rating in a research note on Monday, May 25th. Jefferies Group cut their price target on Joy Global from $43.00 to $34.00 and set a “hold” rating for the company in a report on Tuesday, July 14th. Longbow Research restated a “hold” rating on shares of Joy Global in a report on Tuesday, May 26th. JPMorgan Chase & Co. reaffirmed a “hold” rating on shares of Joy Global in a research report on Wednesday, July 22nd. Finally, Goldman Sachs reissued a “sell” rating on shares of Joy Global in a research report on Tuesday, July 28th. Three investment analysts have rated the stock with a sell rating, twelve have given a hold rating and five have issued a buy rating to the company’s stock. Joy Global presently has a consensus rating of “Hold” and a consensus target price of $34.97. \n\nIn other Joy Global news, Director Richard B. Loynd bought 5,000 shares of Joy Global stock in a transaction that occurred on Monday, June 8th. The stock was purchased at an average cost of $38.51 per share, for a total transaction of $192,550.00. The acquisition was disclosed in a document filed with the Securities & Exchange Commission, which is accessible through this link. \n\nJoy Global (NYSE:JOY) traded down 1.43% during midday trading on Friday, reaching $18.63. The company’s stock had a trading volume of 15,158,917 shares. The firm’s 50-day moving average price is $25.20 and its 200-day moving average price is $36.01. Joy Global has a 52 week low of $17.70 and a 52 week high of $60.48. The stock has a market capitalization of $1.82 billion and a PE ratio of 7.51. \n\nJoy Global (NYSE:JOY) last announced its quarterly earnings data on Thursday, September 3rd. The company reported $0.54 earnings per share for the quarter, missing the Zacks’ consensus estimate of $0.62 by $0.08. The business earned $792 million during the quarter, compared to the consensus estimate of $798.17 million. During the same quarter in the previous year, the company earned $0.80 earnings per share. The company’s quarterly revenue was down 9.5% compared to the same quarter last year. On average, analysts anticipate that Joy Global will post $2.27 earnings per share for the current year. \n\nThe firm also recently disclosed a quarterly dividend, which will be paid on Friday, September 18th. Investors of record on Friday, September 4th will be paid a dividend of $0.20 per share. The ex-dividend date is Wednesday, September 2nd. This represents a $0.80 annualized dividend and a yield of 4.29%. \n\nJoy Global Inc. is a manufacturer and servicer of high productivity mining gear for the extraction of coal and other minerals and ores. The Company manufactures and marketplace aftermarket parts and original equipment and services for both underground and surface mining and specific industrial uses. The Company’s equipment is utilized in important mining regions to mine coal, copper, iron ore, oil sands, gold and other minerals throughout the whole world. The Company operates Underground Mining Machines and Surface Mining Equipment. The Company is a producer of underground mining machinery for the extraction of coal and other bedded minerals and provide service places near important mining areas worldwide. The Organization is an important producer of surface mining equipment for the extraction of minerals and ores and offers extensive operational support for several kinds of gear found in surface mining. \n\nReceive News & Ratings for Joy Global Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Joy Global and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News - Forex"}