{"published": "2015-09-16T21:30:00Z", "media-type": "News", "title": "Taulupe Faletau hoping pool of death can fire Wales to World Cup glory", "id": "874a583b-ddf0-4528-a02e-49b9a5359462", "content": "TAULUPE FALETAU knows the pool of death can breath life into Wales' World Cup bid. \nFour years ago in New Zealand, Faletau played every minute of a thrilling Welsh campaign that began with him scoring against the Springboks and ended inches short of the final. \n\nThis time England, Australia, Fiji and Uruguay stand in Wales' way in arguably the toughest group in World Cup history. \n\nBut Faletau said: \"All that competition will only benefit the two teams that get through to the knockout stages and hopefully we will be one of them. \n\n\"In New Zealand we got so much belief from the pool and built momentum. Of course you look back with real disappointment at the France game, but it just wasn't meant to be. \n\n\"There is no getting around the fact we have a tough group again. It's up for anybody to take and Fiji should not be overlooked. \n\n\"They've got a strong squad and will give everyone a run for their money. They have been in good form to win the Pacific Nations Cup and have all their big players fit and available. \n\n\"Whoever gets through will be in good shape because they will have had competitive rugby from the start.\" \n\nFaletau knows what he is in for. During the pool stage alone he will potentially come up against his cousin Billy Vunipola, former team-mate Netani Talei and familiar opponents Australia. \n\n\"I've played against Billy a few times now but it will be extra special if we do again at the World Cup,\" he said. \n\n\"They've always been good battles, just like they were when my brother and I would play Billy and Mako when we were kids growing up in south Wales. \n\n\"But this time it will be all about England versus Wales and it's nothing personal. \n\n\"Ben Morgan got the nod for the Fiji game with Billy on the bench and they have different qualities but are both dangerous players. Billy won't settle for that and will be determined to start against us. \n\n\"It's great to see Netani there with Fiji after his injury problems. He is a hard-working guy and has got what he deserves by making the squad. \n\n\"As for Australia, having two out-and-out sevens obviously strengthens them at the breakdown. They are quality players and it will be interesting to see what Australia do.\" \n\nFour years ago in New Zealand, according to Warren Gatland, little-known Faletau was \"an overweight Tongan\", recognisable only for his mop of hair. But his transformation is now complete. \n\nIn a record back-row partnership with Dan Lydiate and Sam Warburton, he has been at the heart of one of the most successful Wales teams of all time. He has started the last 19 Tests for Wales and barely misses a training session. \n\nNow Faletau is ready to become more than just Mr Reliable as he peaks once again for the World Cup. \n\n\"It was new territory for me four years ago - I'd never travelled with the squad before and suddenly I was visiting these great places and playing in all the games,\" he said. \n\n\"There is a group of us now that have come through together. We've had time together and understand each other better. We've got to try and build on that and use the experience that we've gained over the last four years to go one better than last time.\"", "source": "Daily Express"}