{"published": "2015-09-18T01:41:54Z", "media-type": "News", "title": "Stephen Harper bashes rivals over economy at second leaders' debate", "id": "37e9ef55-dfe6-47e6-9e47-6711675323d8", "content": "OTTAWA - Canadian Prime Minister Stephen Harper, taking the offensive after an election campaign marred by setbacks and missteps, on Thursday said his rivals would badly damage the economy if they took power. \n \nWith polls showing a tight three-way race ahead of the Oct. 19 vote, Harper needs to break away from his two centre-left opponents if his right-leaning Conservatives are to have any chance of extending their near 10-year term in office. \n \nHarper has long portrayed himself as the only leader able to handle a sluggish economy amid global weakness. This week trumpeted the fact the federal budget had returned to surplus a year earlier than predicted. \n \n\"The other parties are trying to tell us they will deal with the challenges of our economy, of our labor market, of international markets, by raising taxes and running deficits to finance vastly increased amounts of spending,\" he told a televised debate about the economy. \n \n\"That is not the way to protect our economy in this environment,\" he said in often testy exchanges with New Democratic Party leader Thomas Mulcair, 60, and Liberal leader Justin Trudeau, 43. \n \nHarper says Canada should stick to Conservative policies designed to keep taxes low and attract investment. He brushes off calls for more government spending. \n \nThe Liberals are proposing to run budget deficits for three years to help finance a major national infrastructure program. \n \n\"Mr Harper wants to hit the snooze button while Mr Trudeau is hitting the panic button,\" said Mulcair. His party - which has never held power federally - said this week it would raise the corporate tax rate.. \n \nThe debate, the second of the campaign, was sponsored by the Globe and Mail newspaper. \n \nIt took place in Harper's adopted hometown of Calgary in the western energy-producing province of Alberta, which has been hard hit by slumping crude prices. \n \nMulcair accused Harper of relying far too much on oil exports to buoy government finances. The price of crude has dropped by more than half since mid-2014. \n \n\"Mr. Harper put all his eggs in one basket and then he dropped the basket,\" he said. \n \nTrudeau said Harper had presided over the worst growth rate of any prime minister since the Great Depression. \n \n\"Canadians are worried about their jobs, and that's what this election is about,\" said Trudeau. \n \nGreen Party leader Elizabeth May, who performed well in the first televised encounter, was left off the roster and could only offer commentary on Twitter.", "source": "Kingston Whig-Standard"}