{"published": "2015-09-17T12:56:20Z", "media-type": "News", "title": "Powerful Chile quake kills at least eight, 1 million evacuated", "id": "fac238d3-02d8-4800-a266-1c56ba7e2695", "content": "SANTIAGO, Sept 17, 2015 (AFP) – \n\nA powerful 8.3-magnitude earthquake struck off Chile Wednesday, killing eight people, forcing the evacuation of a million and sparking warnings that tsunami waves could reach Japan. \n\nBuildings swayed as far away as in Buenos Aires, Argentina, 1,500 kilometers (1,000 miles) to the east. In Chile, people ran out into the streets in terror. \n\nTV footage showed stores with floors strewn with a mess of broken bottles, jars and other spilled merchandise. \n\nIt was the sixth most powerful quake in the history of geologically volatile Chile and the strongest anywhere in the world this year, Deputy Interior Minister Mahmoud Aleuy said. \n\nThe death toll of eight was given by Interior Minister Jorge Burgos. \n\nStrong aftershocks followed the first quake, and a tsunami alert was imposed for hours for the Chilean coast. But it was lifted before dawn Thursday. Many people were evacuated to higher ground. \n\nTsunami warnings were issued in New Zealand and other countries in the Pacific. \n\nIn Chile, more than 135,000 families were left without power in the north-central coast area, the National Emergency Office reported, lowering an early figure. \n\nCentral Choapa province, which is closest to the epicenter, was declared a disaster zone and placed under military rule. \n\nThe United States Geological Survey (USGS) said the quake occurred at 2254 GMT and measured a 8.3 on the so-called moment magnitude scale. \n\nIt occurred at a shallow depth, 228 kilometers (about 140 miles) north of Santiago, a city of 6.6 million people. \n\nThe Chilean government put the main earthquake at 8.4 on a slightly different measurement, the Richter scale. \n\n“The motion began lightly, then stronger and stronger,” said Santiago resident Jeannette Matte. \n\n“We were on the 12th floor and we were very afraid because it was not stopping. First it was from side to side, then it was like little jumps.” Interior Minister Burgos said evacuation of coastal towns and cities had been ordered as a precautionary measure. Classes were cancelled in coastal areas. \n\nAmong the dead were a woman in Illapel, close to the epicenter, and an 86-year-old man in Santiago, where there were scenes of pandemonium as thousands fled swaying buildings. \n\nHardest-hit Illapel, a coastal city of 30,000, saw its electricity fail and several homes collapsed. Around a dozen people were injured. \n\nIn coastal La Serena, in the north of Chile, “people were running in all directions,” said resident Gloria Navarro. \n\nWaves crashed across costal roads in the regions of Coquimbo and Valparaiso. Rough seas were also forecast for Thursday. \n\n– Fear in Argentina – ===================== Fear also seized residents in Argentina. \n\n“We went into a panic and the floor kept moving. We went out into the hallway and down the stairs,” Celina Atrave, 65, who lives in a 25-story high-rise near downtown Buenos Aires, told AFP. \n\nChilean President Michelle Bachelet said she would travel to the quake-hit area to assess the relief effort. \n\nThe Hawaii-based Pacific Tsunami Warning Center said tsunami waves were also possible in French Polynesia, Hawaii and California, officials said, as well as smaller waves as far afield as Japan and New Zealand. \n\nThe first tsunami waves struck Chile’s coast, including the tourist city of Valparaiso, local television pictures showed, but there were no immediate details of damage or injuries. \n\nA precautionary alert for Peru was later called off, civil defense officials said, but scared residents in the city of Ilo, close to the border with Chile, remained out on the streets and on higher ground nonetheless. \n\nIn April last year, a deadly 8.2-magnitude earthquake in northern Chile killed six people and forced a million to leave their homes in the region around Iquique. \n\nAnd a February 2010 quake that struck just off the coast of Chile’s Maule region measured 8.8 in magnitude, making it one of the largest ever recorded. \n\nIt killed more than 500 people and inflicted an estimated $30 billion in damages.", "source": "Sri Lanka Sunday Times"}