{"published": "2015-09-14T03:30:00Z", "media-type": "News", "title": "Tributes for deceased Macarthur boxer Davey Browne", "id": "3e8bf5da-cb3f-4816-8fc8-914a8e22ee2c", "content": "Bradbury boxer and father of two Davey Browne has died after being knocked out during a bout at Ingleburn RSL Club on Saturday night. Bradbury boxer and father of two Davey Browne has died after being knocked out during a bout at Ingleburn RSL Club on Saturday night. Fighting Filipino Carlo Magali for the IBF Pan Pacific Junior-Lightweight title, the 28-year-old was knocked out late in the last round.\n\nWitnesses reportedly said Mr Browne regained consciousness momentarily and was placed on a stool in the corner but slipped off and back into unconsciousness.\n\nHe was taken to the Liverpool ospital and placed on life support but died in on Tuesday morning.\n\nLocal boxer and former world champion Daniel Geale said he knew Mr Browne well and the two had met while they were training at Grange Old School Boxing in Smeaton Grange.\n\nHe said the incident was devestating for Mr Browne, his family and the Macarthur and wider boxing community.\n\n‘‘When I first heard the news, being a boxer myself it was pretty devestating,’’ he said.\n\n‘‘The first thing my wife said to me was ‘are you going to stop boxing now?’ but that wasn’t on my mind.\n\n‘‘But [incidents like these] do knock you for six a bit.\n\n‘‘Davey has always been tall for his weight, a fast boxer and great on his feet.''\n\nTommy Mercuri, a trainer at West Side Boxing in Leppington, first encountered Mr Browne as a 12-year-old.\n\nMr Mercuri had been the hospital to visit the boxer he described as a ‘‘great kid and a great bloke’’.\n\n‘‘He was a beautiful kid all over,’’ he said.\n\n‘‘I trained Davey and his brother Tommy and their dad used to train out of the gym also.\n\n‘‘I can’t say a bad word about any of them.\n\n‘‘This is just a tragedy.’’\n\nEarlier this month the Australian Medical Association — a long time opponent of boxing — called for those aged under 18 to be banned from combat sports.\n\nIt has also pushed for boxing to banned from the Commonwealth and Olympic games.\n\nAssociation president Professor Brian Owler said combat sports were ‘‘inherently dangerous’’.\n\n‘‘As medical practitioners, the AMA is concerned by any sports that involve displays of interpersonal violence, and where the goal is to injure the opponent to the point that they are unable to continue,’’ he said.\n\nMr Mercuri said while the dangers to boxers were not unique..\n\n‘‘People rubbish boxing but it [and incident like this] can happen anywhere — look at Michael Schumacher, motor bike riders and footballers,’’ he said.\n\nMr Geale also called for calm.\n\n‘‘I love the sport of boxing and everyone knows it’s dangerous ... but there are a lot of other sports where people get hurt in a bad way,’’ Mr Geale said.\n\nIt is believed Mr Browne was training out of the Out West Fight Club in Eagle Vale.", "source": "Wollondilly Advertiser"}