{"published": "2015-09-25T18:57:02Z", "media-type": "News", "title": "Influencer Comedy Film \"Bob Thunder: Internet Assassin\" Trailer Debuts", "id": "3f24aad6-66b8-43ca-b5a8-6a4f6461ac93", "content": ") - The trailer for \"Bob Thunder: Internet Assassin\" debuts today on YouTube at https://youtu.be/KyYZjvikyFM . \n\nFilmOn will release the action comedy from writer/director/influencer Joe Nation , Bob Thunder: Internet Assassin, on October 27th . on demand at FilmOn.com/BobThunderMovie via MondoTunes. Newly relaunched digital music and movie disrtibution site MondoTunes gives independent creators major label release power,  distributing to over 600 top Internet music and video stores including iTunes, GooglePlay, AppleTV, and Amazon. FilmOn CEO Alki David produced the film. \n   \nIn the satirical film, Joe Nation, a struggling YouTuber searching for Internet fame, accidentally hires Bob Thunder, a cold-blooded killer, to help him. Meanwhile, Mr. Network (played by Alki David) and his Multi Channel Network, FilmOn.com, are signing new internet talent with a sinister plan to turn them into product placement robots. \n\nProduced in association with Relativity Digital Studios , FilmOn's movie parodies the digital industry, online celebrities and their relationships with MCNs. It features 50 cameos from YouTube personalities including Adande \"Swoozie\" Thorne, Jesse and Jeana of PrankvsPrank, Olga Kay, Chester See, Joey Graceffa, Steve Greene, Michael Gallagher of TotallySketch, Evelina Barry and Jacks Douglass of JacksFilms.  Janice Dickinson and MMA's Rampage Jackson also have roles in the film. Alki David's previous onscreen credits include The Bank Job , Guido and Lord of The Freaks ). \n\n'It's the ultimate in digitally native entertainment,\" says producer Alki David. \"Its subject is the digital world, its got the biggest stars in social media, and its being released directly to consumers in the broadest and easiest possible way.\" \n\nThe trailer for Bob Thunder, Internet Assassin is here . More photos available upon request. \n\nThe movie's home page is here . \n\n#BobThunderMovie \n\nhttps://www.facebook.com/officialbobthunder \n\nhttps://instagram.com/bobthundermovie/ \n\nhttps://twitter.com/bobthundermovie \n\nAbout FilmOn TV Networks: Founded by Greek billionaire and media entrepreneur, Alki David, FilmOn is the world's number one free TV service and number one live TV app with 40 million downloads. FilmOn offers over 600 live TV channels including original programming, 600 video and audio podcasts from premium brands as well as over 45,000 video on demand titles at FilmOn.com. It's Battlecam.com is a pioneer in social television and the new offering etv.com gives users the ability to monetize their own pay-per-view events for the first time. Last month the site's 75 million users generated 1.2 billion video streams. The service is available globally via computers, smartphones, tablets as well as the FilmOn App for iOS 7, Android, Windows 8 and IP-enabled set-top boxes and devices. With offices in Beverly Hills and London and data-centers in Los Angeles, London, and Geneva, FilmOn curates the best of free televised entertainment from around the globe. FilmOn TV is also an Independent TV Broadcaster with stations in the UK (Sky Channel 292 and Freesat channel 410 and throughout the US. For more information please visit FilmOn.com and connect with us on Twitter and Facebook . \n\nThe following files are available for download: \nBobThunder group still BOB THUNDER \nFor more info about Bob Thunder, Internet Assassin \nor to request interviews with Joe Nation or Alki David: \nTom Paul Jones \ntompauljones213@gmail.com \n310-383-4991", "source": "Financial Content"}