{"published": "2015-09-07T23:45:57Z", "media-type": "News", "title": "Potholes and poor surfaces top gripe for drivers on local roads", "id": "b0cf709e-ea4f-4311-994c-345150d9d420", "content": "01:13 Tuesday 08 September 2015 The state of Britain's local roads is the number one gripe among drivers, according to a survey. \n\nOne in 10 motorists said the condition of local roads was their top concern, while a further 20% listed it as one of their four main issues. \n\nThe RAC said the figures show that councils should be under the same legal obligation to maintain roads as they are to provide minimum standards for education and social services. \n\nThe Local Government Association (LGA) insisted that current funding levels mean councils cannot afford to carry out long-term improvements on roads.\n\nHalf of the 1,500 motorists polled believe the quality of roads in their area has deteriorated in the past 12 months with just 10% claiming it has improved. The remainder reported no change. \n\nThe study was commissioned for the RAC's 2015 Report on Motoring. \n\nAmong the 50% who believe the roads in their area are getting worse, the vast majority (99%) attribute this to potholes and general damage to the road surface. \n\nLitter is a source of annoyance for a quarter of people (24%), while poor maintenance of verges annoys one in five (21%).\n\nRAC chief engineer David Bizley urged councils to spend more of their funds on repairing and replacing road surfaces. \n\n\"They are under specific legal obligation to provide minimum standards in education and social services whereas their obligations to maintain roads are far less prescriptive,\" he said. \n\n\"It is therefore inevitable that expenditure is biased against investment in the likes of road maintenance where prescriptive legal obligations do not exist and councillors therefore do not face legal sanctions.\"\n\nMr Bizley warned there is a \"damaging disconnection\" between what a \"large proportion\" of council tax payers want local government to spend their money on and where it actually goes.\n\nBut councillor Peter Box, transport spokesman for the LGA, said councils have to prioritise their expenditure. \n\n\" While councils share the frustration of motorists at the state of our roads, it is impossible to compare repairing potholes with keeping children safe and caring for our elderly,\" he said. \n\n\"With demand on these life and death services continuing to rise and funding from central government continuing to reduce, councils have little choice but to squeeze budgets for other services, such as maintaining our roads.\" \n\nHe added: \"Current funding levels mean councils are only able to keep pace with patching up our roads and filling potholes rather than carrying out more cost-effective and long-term improvements.\" \n\nMichael Dugher, Labour's shadow transport secretary, said: \"Ministers are just not listening to motorists' concerns. They promised they would fix our local roads and the pothole crisis, but it was just all talk. \n\n\"Road users have understandably had enough of their failure and broken promises.\" \n\nBut the Department for Transport (DfT) insisted that it was \"playing our part\". \n\nA DfT spokesman said: \"A well maintained local road network is essential for all road users. \n\n\"We are playing our part by providing nearly £6 billion to councils in England to maintain local roads over the next six years. This funding includes incentives so councils plan ahead and repair roads properly so potholes never form in the first place.\" \n\nCopyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Derbyshire Times"}