{"published": "2015-09-10T12:03:41Z", "media-type": "News", "title": "WallachBeth Maintains $134 TP On Clovis Oncology (NASDAQ:CLVS), Maintains “Buy” Rating", "id": "27a3e826-0484-473d-b705-2b01017a9645", "content": "Clovis Oncology (NASDAQ:CLVS) Rating Kept  \nThe company have set target of $134 on Clovis Oncology (NASDAQ:CLVS) shares. This is 39.51% from the last close price. In a report revealed to investors on 10 September, WallachBeth kept their “Buy” rating on shares of CLVS. \nNASDAQ:CLVS is right now trading 13.83% higher at $96.05 as of 08:03 New York time. Clovis Oncology’s stock is up 89.11% in the last 200 days. It has outperformed the Standard & Poor’s 500 index, which has dropped -5.39% in the same time. \n \nOut of 5  analysts covering Clovis Oncology, 6 rate it a Buy, 1 indicate a Hold while 0 suggest a Sell. The highest target is $125 and the lowest is $92 according to Thomson/First Call. The 12-month mean target is $109, which means upside potential of 13.48% over the current price. \n NASDAQ:CLVS Price Chart & Trend  \nThe stock price of Clovis Oncology increased 89.11% over the last 200 days, and is in very strong up trend. In the last 50 and 100 days, Clovis Oncology is up 14.6% and up 11.49%, respectively. Our stocks momentum model is shown on the price chart below.  \nSource: RightEdge Systems , Yahoo Split & Dividend Adjusted Data and OctaFinance Trading Models \n Institutional Ownership  \nPalo Alto Investors Llc had the largest stake with ownership of 2.40 million shares as of q2 2015 for 9.38% of the US long equity exposure. Partner Fund Management L.P. is another very bullish institutional investor who is owning 2.71 million shares of Clovis Oncology or 6.04% of their US long equity exposure. Furthermore, Partner Investment Management L.P. have 5.8% of their US long equity exposure invested in the company for 46,974 shares. The California-based fund Redmile Group Llc revealed it had bought so far a stake worth about 5.47% of the institutional investor’s stock portfolio in Clovis Oncology. The Delaware-based fund Clifton Park Capital Management Llc is also positive about the stock, possessing 759,479 shares or 5.29% of their US long equity exposure. \n Insider Activity  \nOver the last 6 months, Clovis Oncology NASDAQ:CLVS has seen 0 insider buys, and 7 insider sales. The net result was for 7 transactions, worth $1.81M. \n Clovis Oncology (NASDAQ:CLVS) Profile  \nClovis Oncology, Inc. (Clovis) is a biopharmaceutical company focused on acquiring, developing and commercializing anti-cancer agents in the United States, Europe and additional international markets. The Company is developing three product candidates: Rociletinib, Rucaparib and Lucitanib. Rociletinib, an oral epidermal growth factor receptor (EGFR), is a mutant-selective covalent inhibitor that is in advanced clinical development for the treatment of non-small cell lung cancer. \nClovis Oncology (NASDAQ:CLVS) traded up 13.83% on 10 September, hitting $96.05. A total of shares of the company’s stock traded hands. This is down from average of 589,642 shares. Clovis Oncology has a 52 week low of $39.45 and a 52 week high of $102.28. The company has a market cap of $3.21 billion and a P/E ratio of 0. \n \nGet the latest Clovis Oncology (NASDAQ:CLVS) Stock Ratings at Octafinance. Completely free access to our Analyst Ratings Database for 6000+ stocks. \n \nThe post appeared first on Octafinance .", "source": "Octafinance"}