{"published": "2015-09-22T12:21:00Z", "media-type": "News", "title": "Financial Advisors Play Critical Role in Retirement Success, Franklin Templeton Survey Finds", "id": "624e5334-e93a-4dc3-9068-094512e8eee6", "content": "SAN MATEO, CA -- (Marketwired) -- 09/22/15 --  According to Franklin Templeton's 2015 Retirement Income Strategies and Expectations (RISE) survey , Americans who work with a financial advisor are much more likely to have already begun saving for retirement, compared to those who have never worked with an advisor (93 percent versus 54 percent). The annual survey, which polled more than 2,000 Americans, found that nearly half of those who have never worked with a financial advisor have no retirement savings, and nearly one-quarter of pre-retirees who have never worked with an advisor never plan to retire. \n\n\"People should absolutely take an active approach when it comes to retirement planning, and financial advisors can help,\" said Michael Doshier, vice president of retirement marketing for Franklin Templeton Investments. \"Our survey results clearly demonstrate the critical role financial advisors play in empowering their clients to become active participants in both financial and emotional retirement preparation. Advisors can provide the necessary tools and support their clients' need to be smart, engaged investors, which ultimately leads to their greater sense of security in the time leading up to and during retirement.\" \n\n Preparing for What's Next  \n\nFinancial advisors can both increase retirement preparedness and help clients align their retirement expectations with reality. \n\nAccording to the survey, pre-retired Americans who have never worked with a financial advisor are more than twice as likely to answer \"don't know\" when asked what percentage of their current income they expect to live on in retirement, compared to those who work with a financial advisor (49 percent versus 20 percent). In addition, pre-retirees who have never worked with a financial advisor are nearly twice as likely as those who work with an advisor to feel the most likely cause of a retirement delay would be because they believe they do not have enough money saved (42 percent versus 24 percent). \n\nFinancial advisors can also help investors better understand how Social Security can fit into their retirement income plans and when to initiate their benefits. In fact, nearly three-quarters (72 percent) of those who work with a financial advisor indicate they are confident that their Social Security benefits will provide expected income in retirement, much higher compared to those who have never worked with an advisor (58 percent). \n\nSimilarly, those who work with a financial advisor are also more likely to express confidence that their workplace retirement plan (77 percent) and personal investments (89 percent) will provide expected income in retirement, compared to those who have never worked with an advisor (both 58 percent). \n\n Living in Retirement  \n\nIn the same way that financial advisors can facilitate preparation and reinforce a fundamental understanding of retirement-related issues leading up to retirement, they can also enable their clients to experience a retirement reality that aligns with their expectations. \n\nMore than half (59 percent) of retired Americans who work with a financial advisor say they have spending habits that are similar to their expectations, while only 40 percent of those who have never worked with an advisor can say the same. \n\nWorking with a financial advisor helps with addressing many fundamental concerns surrounding day-to-day life during retirement. For those who have never worked with a financial advisor, their top concern during retirement is running out of money (32 percent). Americans who work with an advisor cite health and medical issues (37 percent) as their top concern. \n \nAt the same time, affording medical expenses appears to be less of a concern for those who work with a financial advisor -- with more than three-quarters (77 percent) indicating that they know how they will pay for medical expenses in retirement -- than those who do not work with an advisor (just 40 percent of whom know how they will pay). \n\n Reducing Stress  \n\nThose who work with a financial advisor appear to exhibit less stress in response to normal short-term market volatility. For example, two-thirds (67 percent) indicate that they would not worry if their retirement investments declined by 5 percent, compared to 53 percent of their counterparts who have never worked with an advisor. \n\n\"Understanding market mechanics and structuring your portfolio to weather ups and downs are vital to your peace of mind in retirement. Those lacking access to an advisor and sound investment guidance generally experience more stress surrounding natural market moves and the implications on their personal investments,\" said Doshier. \"In order to set yourself up for success in retirement, it's important to work with your financial advisor to build an individualized plan that takes your specific needs, expectations and apprehensions into account.\" \n\n Methodology  \n\nThe Franklin Templeton Retirement Income Strategies and Expectations (RISE) survey was conducted online among a sample of 2,002 adults comprising 1,001 men and 1,001 women 18 years of age or older. The survey was administered between January 8 and 22, 2015, by ORC International's Online CARAVAN®, which is not affiliated with Franklin Templeton Investments. Data is weighted to gender, age, geographic region, education and race. The custom-designed weighting program assigns a weighting factor to the data based on current population statistics from the U.S. Census Bureau. \n\n About Franklin Templeton Investments  \n\nAll investments involve risks, including possible loss of principal. Investors should carefully consider a fund's investment goals, risks, charges and expenses before investing. To obtain a summary prospectus and/or prospectus for a Franklin Templeton Fund, which contains this and other information, talk to your financial advisor, call us at (800) DIAL BEN/(800) 342-5236 or visit franklintempleton.com. Please carefully read a prospectus before you invest or send money. \n\nFranklin Templeton Distributors, Inc., is a wholly owned subsidiary of Franklin Resources, Inc. (NYSE: BEN), a global investment management organization operating as Franklin Templeton Investments. Franklin Templeton Investments provides global and domestic investment management to retail, institutional and sovereign wealth clients in over 150 countries. Through specialized teams, the company has expertise across all asset classes -- including equity, fixed income, alternative and custom solutions. The company's more than 600 investment professionals are supported by its integrated, worldwide team of risk management professionals and global trading desk network. With offices in 35 countries, the California-based company has more than 65 years of investment experience and approximately $806 billion in assets under management as of August 31, 2015. \n\nFor more information, please visit franklintempleton.com or connect with Franklin Templeton on Twitter (@FTI_US). Read the Beyond Bulls & Bears blog featuring perspectives from Franklin Templeton investment professionals around the world. \n\nThis material is being provided for general information purposes only and should not be construed as investment, tax, or legal advice, or as a solicitation to buy or sell any specific securities product, or used to determine when to claim Social Security benefits. We strongly advise you to consult with the appropriate financial, legal or tax advisors about your specific circumstances and individual goals. \n\nCopyright © 2015. Franklin Templeton Investments. All rights reserved.", "source": "Ulitzer"}