{"published": "2015-09-13T21:20:00Z", "media-type": "Blog", "title": "You Can't Miss Monique Lhuillier's Dazzling Runway Show", "id": "54620d0c-af83-47cd-9349-e1cdc075fa47", "content": "POPSUGAR Fashion Monique Lhuillier Monique Lhuillier Spring 2016 Collection You Can't Miss Monique Lhuillier's Dazzling Runway Show by Allison McNamara 9/13/15 15 Shares Like us on Facebook Sign up for our daily newsletter > When you think of Monique Lhuillier, beautiful ballgowns and bridal might come to mind. But this season, she is shaking things up — and there isn't a princess-style ballgown in sight on her Spring 2016 runway. Her entire collection is fun, youthful, modern, and everything we want to wear next season. See for yourself — take a look! View Transcript » Transcript Download our fashion week app Back to Homepage Comments Read More RunwayPopsugarMonique LhuillierFashion Week Stay Stylish With Our\nFashion and Beauty Newsletter Personalize Fashion and Beauty News Beauty Tips Street Style Celebrity Style Sign up with facebook or By signing up, I agree to the Terms and to receive emails from POPSUGAR. What’s Your Reaction? Thanks for your reaction Don’t forget to share this with your friends! 0 0 0 0 0 0 0Reactions Featured Videos Follow POPSUGAR Fashion Smarties Are Different in the US?! Canadian Stars Spill on What They Miss About Home 38 Shares A Flat-Belly Workout That Only Takes 10 Minutes! 453K Shares Chisel Your Core With This 15-Minute Workout 208 Shares This Insane Watermelon Skinning Trick Will Make Your Jaw Drop 3.9K Shares Re-Create In-N-Out's Magical Animal Style Fries at Home 539 Shares Why This Video of a Little Girl and Her Shadow Is Going Viral 3.2K Shares All Videos Entertainment Latest on POPSUGAR Entertainment POPSUGAR News The Buzz POPSUGAR Rush Celebrity Interviews I'm a Huge Fan Top That! Fashion Latest on POPSUGAR Fashion We Spy Style Fashion Flash Fashion Lookbook One of a Kind Beauty Latest on POPSUGAR Beauty Celebrity Secret Weapon Beauty How To Fitness Latest on POPSUGAR Fitness Class FitSugar Get the Bod Fit or Fiction Food Latest on POPSUGAR Food Eat the Trend Just Add Sugar Get the Dish Happiest Hour Tech Latest on POPSUGAR Tech The Sync Up Home Latest on POPSUGAR Home Get the Room Load More", "source": "POPSUGAR Fashion"}