{"published": "2015-09-01T17:31:06Z", "media-type": "News", "title": "College football notebook: Golson named Florida State starting QB", "id": "df39e945-d76b-4945-8db9-67e2837382a5", "content": "Everett Golson, a senior transfer from Notre Dame, will start for Florida State in the season opener against Texas State on Sept. 5. \n \nCoach Jimbo Fisher chose Golson over junior Sean Maguire, who led FSU to a win over Clemson last season as starter Jameis Winston was suspended. \n\nThat is the only game Maguire has started in his career. Meanwhile, Golson has 25 starts under his belt, including the 2012 BCS National Championship game, which the Irish lost to Alabama. \n\n--Ohio State coach Urban Meyer has not made a final decision on his starting quarterback and isn't ruling out playing both stars in the Buckeyes' season opener. \n\nJ.T. Barrett and Cardale Jones have been battling in training camp to determine the No. 1 quarterback to lead the defending national champions. \n\nThe Buckeyes open the 2015 season at Virginia Tech in Blacksburg, Va., next Monday night. \n\n-- UCLA cornerback Ishmael Adams, an All-Pac-12 player last season, reportedly remained in jail on a robbery charge. \n\nAdams allegedly took a cellphone from an Uber driver early Sunday morning, the UCLA police department told ESPN.com. He was arrested, and his bail was set at $100,000, ESPN.com reported. \n\nThe school said it was aware of the arrest and will not comment further. The 13th-ranked Bruins open the season Saturday against Virginia. \n\n--LSU head coach Les Miles visited the hospital after feeling ill in the morning, but he was back at the football operations building by Monday afternoon. \n\nMiles, who turns 62 in November, was scheduled to attend his weekly media conference at 12:30 p.m., but when Miles did not appear for about 40 minutes, athletic director Joe Alleva made a brief statement, saying Miles was not feeling well and was advised to go to the hospital by LSU trainers. \n\nAlleva said Miles went to the hospital \"on a precautionary basis,\" and expected Miles to return for Monday afternoon's practice.", "source": "KCCI"}