{"published": "2015-09-30T15:31:56Z", "media-type": "News", "title": "Senate OKs bill to fund government until Dec. 11", "id": "533e7b29-68ad-4656-b297-cb344fb2bcc0", "content": "(CNN) -  \nThe Senate moved Wednesday to prevent the first part of a multi-step budget crisis when it voted overwhelmingly to keep the government funded through Dec. 11. \n \nThe bill passed 78 to 20 and now goes to the House, which must act before midnight to prevent a shutdown, and House Republican leaders have said they plan to pass the bill in time. \n\nMeanwhile, top-level negotiations between Republican leaders in Congress and the White House to resolve the remaining steps -- including a longer-term government funding bill, an increase in the debt ceiling, approval of new funds for highway construction, passage of expiring tax provisions -- could begin \"very soon,\" Senate Majority Leader Mitch McConnell said Tuesday. \n\nBut those talks could be marred before even getting started after McConnell insisted in a phone call last week with President Barack Obama that House and Senate Democratic leaders not be allowed at the table, a demand the President refused to accept, multiple officials told CNN. \n\nMcConnell has suggested for weeks he expected to open talks directly with the White House, bypassing Senate Democratic Leader Harry Reid, Sen. Chuck Schumer and other Democratic leaders with whom he has a tenuous relationship. A spokesman for McConnell wouldn't comment on why he wanted to bar Democrats from the talks. \n\nWhite House officials also declined to discuss the call, which took place last Thursday just before Obama met with Reid and House Democratic Leader Nancy Pelosi in the Oval Office, according to a Pelosi aide. But they pointed to recent comments by White House Press Secretary Josh Earnest who said that Democrats must be part of any negotiation. \n\nReid insisted Tuesday he would be part of any negotiations. \n\n\"We've been calling for responsible budget negotiations for months,\" he said. \"If there are any talks, I will be invited.\" \n\nMcConnell said he hoped the stopgap spending measure would \"allow time for cooler heads to prevail.\" \n\nNews of the anticipated but long-awaited talks came days after House Speaker John Boehner, a known dealmaker, complicated the process by announcing he would leave Congress at the end of October. It was not clear what impact his sudden departure would have on what will be his final major budget negotiation. But some Democrats -- who fear Boehner's replacement will cower to demands from the right not to cut a deal -- said they hope Boehner will wrap up all the remaining issues before retiring. \n\n\"I would hope that Boehner would make it easier on the people who are going to follow him,\" Reid said. \"Get it all done before he leaves.\" \n\nIn an interview on CBS's \"Face the Nation\" on Sunday, Boehner suggested he may want to do just that. \n\n\"I don't want to leave my successor a dirty barn. I want to clean the barn up a little bit before the next person gets there,\" Boehner said. \n\nMcConnell said he had \"no earthly idea\" how much work would be completed before Boehner leaves. \n\n\"We are going to have to deal with all of these issues between now and December 11,\" McConnell said. \"How much of that could come together before Speaker Boehner leaves, I have no earthly idea.\" \n\nAt issue in the negotiations is how much to spend on the government operations. \n\nMany Republicans want to break existing budget caps to increase spending for defense while most Democrats want to break the caps to increase funding for domestic programs. But the conservatives in the House who helped force Boehner's exit say they want to rein in government spending and don't want to break the caps at all. \n\nMcConnell said one of his biggest priorities in the talks will be to set a top line spending figure for this year and 2016, which would allow Congress to carry out a normal appropriations process next year. Washington has run on \"continuing resolutions\" for some time, which don't allow Congress to make changes to the way money is spent or to alter policies within government agencies. \n\n\"Let us at least be honest. With a continuing resolution, no waste will be cut. No spending will be cut. No regulations will be stopped. And the debt will continue to mount,\" Kentucky Sen. Rand Paul said in a floor speech explaining why he would vote against the continuing resolution.", "source": "WCYB-TV"}