{"published": "2015-09-24T06:05:35Z", "media-type": "News", "title": "Replimune Ltd Raises $30 Million Series A Financing", "id": "992e431a-b51e-4686-9b40-2e692af840bd", "content": "/PRNewswire/ --\n\nAtlas Venture leads Series A, joining existing seed investors Omega Funds and Forbion Capital Partners Replimune Ltd (Replimune) today announced the closing of a $30 million Series A financing led by Atlas Venture (Atlas). Atlas joins previous seed investors Forbion Capital Partners (Forbion) and Omega Funds (Omega) as investors in this funding round.\n\nReplimune, headquartered in Oxford UK and with a significant presence in Cambridge, MA, was founded in April 2015 to develop the next generation of 'oncolytic immunotherapies' for the treatment of cancer.\n\nJason Rhodes, Partner at Atlas, will join the board of Replimune together with Otello Stampacchia and Sander Slootweg of Omega and Forbion, respectively.\n\nOncolytic immunotherapy is an emerging class of cancer therapeutics which exploit the ability of viruses to selectively replicate in and kill tumor tissue, while at the same time inducing a potent, patient-specific, anti-tumor immune response. Oncolytic viruses have the unique ability to generate an autologous immune response to the patient's particular complement of tumor antigens, including neoantigens, with a truly off-the-shelf approach. While clear single agent clinical activity has been achieved with oncolytic immunotherapy, it is anticipated that particular synergy may be observed in combination with immune checkpoint blockade and other immune-modulatory approaches. Immune checkpoint blockade relies on a pre-existing inflamed tumor microenvironment and a pre-existing immune response to tumor neoantigens for clinical activity, which are only present in some patients. Oncolytic immunotherapy can provide both of these and therefore combination of these two proven modalities is particularly logical and attractive.\n\nReplimune is developing novel, proprietary oncolytic immunotherapies intended to improve both the direct anti-tumor effects of selective virus replication and the potency of the immune response to the tumor antigens released. Replimune intends to progress these rapidly through clinical trials and to combine these with checkpoint blockade at an early stage of clinical development.\n\n\"We are at the beginning of the age of immune-oncology and believe that oncolytic viruses will be a powerful component of this emerging therapeutic approach,\" said Jason Rhodes, Partner at Atlas, \"Atlas is very pleased to be working with the exceptional and experienced team at Replimune.\"\n\nRobert Coffin, Replimune CEO (and previously Founder and CSO of BioVex Inc) said \"Replimune is excited to be at the forefront of oncolytic immunotherapy, and to partner with leading healthcare investors such as Atlas, Forbion and Omega in this funding round. The funds raised will allow us to progress our next generation approach through to clinical data in multiple cancer indications, including in combination with checkpoint blockade.\"\n\nIn addition to stand-alone product development, Replimune will pursue a partnering strategy with companies with promising approved or experimental checkpoint blockade or other complementary immuno-oncology drugs.\n\nFor further information contact:\n\nReplimune Ltd\n\ninfo@replimune.com\n\nAtlas Venture\n\nKristen Margeson\n\n+1-857-201-2700\n\nlifesciences@atlasventure.com\n\n400 Technology Square, 10th Floor\n\nCambridge, MA 02139\n\nForbion Capital Partners\n\nSander Slootweg\n\nManaging Partner\n\n+31(0)35-699-3015\n\nSander.Slootweg@forbion.com\n\nOmega Funds\n\ninfo@omegafunds.net\n\nSuite 502\n\n185 Dartmouth St\n\nBoston MA\n\nhttp://www.omegafunds.net\n\nSOURCE Replimune", "source": "Financial Content"}