{"published": "2015-09-01T11:18:11Z", "media-type": "News", "title": "Dappy has three N-Dubz albums ready", "id": "dff3eae0-aa0b-423d-84d0-a3f3d766ff75", "content": "Dappy has three new N-Dubz albums ready to release when the band reforms to make them bigger than the \"Black Eyed Peas\".\r \n\nThe hip-hop group went on indefinite hiatus from November 2011 just a few months after parting company with Def Jam Records but reunion rumours have persisted for the past two years.\r \n\nNow Dappy has admitted he has a host of songs ready to record with his bandmates Tulisa and Fazer and is desperate to reunite N-Dubz so the band can \"finish what we started\" because he is unhappy about the circumstances surrounding their split. \r \n\nSpeaking to BANG Showbiz at Fusion Festival, he said: \"I'm going to bring back the dynamite trio that is N-Dubz and finish what we started. We'll be bigger than the Black Eyed Peas I reckon. I've got three massive records that I wrote for me and the group, so I'm just waiting for the right time.\"\r \n\nWhile N-Dubz have been apart, Dappy has released one solo album 'Bad Intentions' and is due to bring out his second LP 'Miracles' later this year, but he only after he has topped the charts with a succession of singles.\r \n\nThe 28-year-old pop star is confident he will have several hits because he's recorded some amazing \"raunchy club music\".\r \n\nDappy explained: \"I'm not releasing the album just yet. All I want is three or four consecutive hits for people to say, 'Wow, he's killing it at the moment.' Once I get that response, then the demand will be massive for my album and I'll do it ... I've got about eight massive, great records, and they're not just emotional, connecting records with the crowds, there's also a lot of sexual, raunchy type of club type music. They'll be thinking, 'He looks good, he's killing it right now!' I'm going to be huge this year. This year or the next year, I'm going to be massive.\"\r \n\nDappy was joined on the bill at Fusion Festival - which raises money for youth charity the Prince's Trust and is held in Birmingham's Cofton Park - by Rudimental, Labrinth, MNEK and Grammy Award winners Clean Bandit among others.\r \n\nTo catch up on all the highlights from Fusion Festival 2015, tune into 4Music (Freeview 18, Sky 360 and Virgin 330) on Saturday (05.09.15) from 3pm to watch 'Fusion Festival 2015: The Best Bits'.", "source": "Irish Examiner"}