{"published": "2015-09-25T20:00:50Z", "media-type": "News", "title": "The Latest: Switzerland to ban sales of some VW group cars", "id": "2207637b-15e5-4e8a-9b2d-30c757f7690b", "content": "The latest developments on the Volkswagen emissions scandal. All times local. \n\n--- \n\n9:45 p.m. \n\nSwitzerland is banning sales of Volkswagen Group cars with outdated emissions systems in the wake of the emissions-rigging scandal that started in the United States. \n\nThomas Rohrbach, spokesman for the Swiss federal office of roadways, says Friday that the ban is on all cars with diesel engines in the \"euro 5\" emissions category. It includes all VW models — as well as Seat, Skodas and others in the VW group. \n\nBut the ban only affects cars not yet sold or registered, not ones already in circulation. It doesn't apply to cars now in production with \"euro 6\" engines, which aren't affected by the emissions scandal. \n\nRohrbach said the ban potentially could affect 180,000 vehicles that have 1.2-liter, 1.6-liter and 2.0-liter diesel engines. \n\n--- \n\n9 p.m. \n\nVolkswagen says the 11 million vehicles worldwide that contain software involved in the emissions-rigging scandal include some 5 million cars made by its core Volkswagen brand. \n\nThe Volkswagen Group includes 12 brands, and the company has yet to detail fully what cars where were involved. A Volkswagen statement Friday said some diesel models and model years — such as the sixth-generation Golf, seventh-generation Passat and first-generation Tiguan — are equipped exclusively with the EA 189 engines in which it says there are \"discrepancies.\" \n\nIt didn't detail where in the world the 5 million Volkswagens were sold. \n\nVolkswagen brand chief Herbert Diess says \"we are working at full speed on a technical solution that we will present to partners, to our customers and to the public as swiftly as possible.\" \n\n--- \n\n7:20 p.m. \n\nVolkswagen says it is reorganizing its North America business under Winfried Vahland, until now chairman of the board of directors at Skoda. \n\nThe company says Michael Horn will remain as president and CEO of Volkswagen Group of America, but its U.S, Canada and Mexico markets will be \"combined and significantly strengthened\" to form a new \"North America region.\" \n\n--- \n\n6:50 p.m. \n\nIncoming Volkswagen CEO Matthias Mueller is pledging to do everything to win back the trust of the public in the wake of the emissions scandal that erupted in the U.S. \n\nHe said after being appointed to the job on Friday that \"we stand by our responsibility.\" He also said, however, that \"carefulness is even more important than speed.\" \n\nMueller said the company would introduce \"even tougher compliance rules\" and pledged to make VW \"an even stronger company.\" \n\n--- \n\n6:40 p.m. \n\nVolkswagen AG has chosen the head of its Porsche division, Matthias Mueller, to succeed Martin Winterkorn as chief executive. \n\nVolkswagen's supervisory board appointed the 62-year-old Mueller, a longtime company insider, on Friday. \n\nWinterkorn resigned on Wednesday, taking responsibility for the car emissions scandal in the U.S. but saying he wasn't aware of any wrongdoing on his own part. \n\n--- \n\n3:50 p.m. \n\nCzech Transport Ministry says it is awaiting information from Volkswagen about how many of the EA 189 diesel engines at the center of the company's emissions-rigging scandal were used in Skoda Auto vehicles. \n\nFriday's announcement comes after Skoda Auto, a Czech carmaker owned by VW, acknowledged it used the engines in the past. \n\nIt didn't give any further details except that they are not used anymore. \n\nIt's not clear whether those Skoda cars cheated on any emissions tests. \n\nThe ministry says it is in touch with counterparts in Germany and Britain, where Skoda cars received the necessary clearance for use in the European markets. \n\n--- \n\n3:40 p.m. \n\nThe European Union wants quick answers as to how Volkswagen was able to use stealth software in its vehicles so they could pass lab tests on emission pollution standards. \n\nThe top official responsible for the European single market, Elzbieta Bienkowska, said Friday that \"we need full disclosure and robust pollutant emissions tests in place.\" \n\nGermany, Italy and France are among the countries known to be investigating, and the commission says their probes would include carmakers beyond VW. \n\nThe EU plans to introduce new emissions tests next year involving on-road monitoring. They would complement the lab tests currently used. \n\n--- \n\n3:25 p.m. \n\nGermany's transport minister says 2.8 million vehicles in Germany were among those containing software at the center of the emissions-rigging scandal that started in the United States. \n\nThe U.S. Environmental Protection Agency has accused VW of installing the so-called \"defeat device\" used to cheat emissions tests in 482,000 cars sold in the United States. \n\nVW later acknowledged that similar software exists in 11 million diesel vehicles worldwide, but hasn't given details of the models and their whereabouts. \n\nTransport Minister Alexander Dobrindt told lawmakers Friday that 2.8 million of the vehicles were in Germany, news agency dpa reported. \n\n--- \n\n2:25 p.m. \n\nGermany's transport minister says that light commercial vehicles at Volkswagen appear to be affected by the scandal over software used to cheat U.S. emissions test. \n\nThe U.S. Environmental Protection Agency accused VW a week ago of installing the so-called \"defeat device\" in 482,000 cars sold in the United States. VW later acknowledged that similar software exists in 11 million diesel vehicles worldwide. The German government has said that those included cars in Europe but it's not yet clear how many. \n\nGerman Transport Minister Alexander Dobrindt said Friday: \"According to our current information, light commercial vehicles as well as cars at Volkswagen are affected by the improper manipulation of diesel engine emissions.\" He didn't give details. \n\n--- \n\n2:00 p.m. \n\nDaimler AG, the maker of Mercedes cars, is rejecting claims by a German environmental group that it appears to have been involved in manipulation of emissions data. \n\nThe Deutsche Umwelthilfe group said Friday that it had information that almost all German manufacturers of diesel cars — including Daimler — exceed emissions limits by such a level that it has to assume illegal devices to reduce nitrogen oxide readings are in play. \n\nDaimler on Friday issued a statement strongly denying any manipulation. It said that so-called defeat devices have never been used by the company, and that goes for all diesel and gas engines. It said that it sticks to all laws and rules, and it isn't aware of any measurements showing that its vehicles fail to keep to legal requirements. \n\n--- \n\n1:00 p.m. \n\nItaly's transport minister says spot-checks will be done on at least 1,000 diesel vehicles of all brands following the Volkswagen emissions-rigging scandal. \n\nGraziano Delrio said on a late-night talk show that checks will be conducted at dealerships before sale. That will cost 8,000 euros per vehicle, meaning an overall tab of 8 million euros (nearly $9 million). Delrio, citing a \"problem of health, trust,\" said the truth must be established. \n\nAn Italian consumer group, Altroconsumo, said Friday a class action suit was planned and called on Volkswagen to either correct the software employed in the emissions-rigging or substitute the vehicle. \n\nIn Turin, Italy, Prosecutor Armando Spataro said prosecutors there will look into whether a criminal probe is warranted, clarifying earlier reports that investigators had ordered tests on Volkswagens in Italy. \n\n--- \n\n12:20 p.m. \n\nNorwegian authorities have launched an investigation to find out whether the Volkswagen emissions-rigging scandal affects the Nordic country. \n\nNorway's economic crimes unit said Friday it will investigate whether \"there has been a criminal offense in Norway and whether the fraud has any significance for the cars in question that have been imported to the country.\" \n\nThe agency said it was working on the case jointly with the customs and transportation authorities. \n\n--- \n\n10:55 a.m. \n\nShares in German carmakers are leading a rebound in the country's stock market. \n\nThe DAX index is up 2.6 percent in morning trading, helped by a 4 percent rise in shares in BMW AG. The company had seen a big drop the day before on a report that one of its models exceeded European emissions limits. The report did not allege any cheating by BMW. \n\nShares in Volkswagen, which plunged early in the week before stabilizing, were up 1.5 percent as its board meets to find a new CEO and discuss the scandal.", "source": "Charlotte Observer"}