{"published": "2015-09-17T20:31:49Z", "media-type": "News", "title": "Rapid Reaction: Cubs 9, Pirates 6", "id": "5b5a578f-1d67-489f-adb0-fe952896046a", "content": "PITTSBURGH – The Chicago Cubs beat the Pittsburgh Pirates 9-6 on Thursday afternoon. Here’s a quick look at the game. \n\nHow it happened: After giving up a 3-0 lead to trail 4-3, the Cubs scored six runs before making an out in the top of the fifth inning. Anthony Rizzo homered for the 30th time this season, putting the Cubs back in front 5-4, but they didn’t stop there. Addison Russell and Tommy La Stella singled home runs, while reliever Clayton Richard doubled home two more. \n\nThe Cubs took a 1-0 lead in the first as a double-play grounder by Rizzo brought home Dexter Fowler . But three Pirate home runs off Cubs starter Kyle Hendricks changed the tone of the game until that fifth inning. Hendricks was pulled after just three innings while giving up six hits and four runs. Richard pitched 3 1/3 innings, giving up two runs in his final inning of work. \n\nWhat it means: The last two days could give immense meaning to games in October. The Cubs showed the ability to come back from different kinds of adversity. On Thursday, their starter got rocked after being handed a 3-0 lead but the offense didn’t go to sleep -- they picked up their pitcher in emphatic fashion. And so did Richard who lasted into a fourth inning of relief before tiring. Joe Maddon likes him in his current bullpen role but once again there could be more value with him in the rotation for a spot start. Hendricks and Dan Haren aren’t performing up to capabilities right now as the former simply got behind in the count and/or left pitches up in the strike zone. His 4.22 ERA is a good description of his season. With the Cubs magic number at nine and 16 games remaining, it’s not like they need a whole bunch of gems from the back-end of their rotation, but one or two nice outings wouldn’t hurt. Plus, they need to get someone ready for the playoffs. \n\n“Statement” games might sound like a cliché but the Cubs made at least one to themselves if they have to return here in October for a wild card game. Their offense and even bullpen -- along with the right starter -- can be a scary proposition for the opponent. They drew to within two games of the Pirates as Pittsburgh heads to California to face Zack Greinke and Clayton Kershaw . The first wild card spot in the National League is now in their sights after a huge series win. \n\nRizzo 30 HR’s: Rizzo is just the second Cubs lefty hitter ever to produce multiple 30 home run seasons as he’s done it two years in a row. Billy Williams did it five times between 1964-1972. \n\nWhat’s next: The Cubs return home to open a 3-game series on Friday against the St. Louis Cardinals with Dan Haren (9-9, 3.87) taking on Lance Lynn (11-10, 3.17).", "source": "ESPN.com"}