{"published": "2015-09-01T08:38:49Z", "media-type": "Blog", "title": "Zam: Umno can save gov’t if Najib quits", "id": "8ac3f468-4b2e-45e0-b088-fc685204cf62", "content": "KUALA LUMPUR: A former Information Minister has urged the Umno Supreme Council, scheduled to meet on September 9, to work out an honourable exit strategy for Prime Minister Najib Abdul Razak in the wake of the massive Bersih 4 rallies over the weekend. “Former Prime Minister Mahathir Mohamad himself had to go down to the streets in Kuala Lumpur to meet with the people at Bersih 4 to tell them that he only wants Najib to resign as Prime Minister, as they were demanding, but he wants the Barisan Nasional (BN) to remain the government in Putrajaya.” \n \n“Bersih 4 means that the MCA was dead and was just waiting to be buried come the 14th General Election in 2018.” \n \nZainuddin Maidin reckons that it’s too late for Najib to play the politics of race and win back Malay support in order to hang onto power amidst Tunku Abdul Aziz pushing the line, too late, that the DAP was the real enemy of the Malays. “However, it’s not too late for Najib to withdraw as Prime Minister so that Umno and the government headed by it in Putrajaya can be saved.” \n \n“Bersih 4 is the clearest indication that efforts by the late Tun Ismail, Deputy Prime Minister under Prime Minister Abdul Razak, to protect MIC and MCA have been buried by Razak’s son, Najib, the current Prime Minister.” \n \nThe destruction of MIC and MCA, warned Zainuddin, has opened the way for DAP to dismantle the Malay Government in Putrajaya. “How will the Malays and the non-Malays alike ever respect a leader like Najib? The Chinese, as witnessed during Bersih 4, want a new government to follow Najib’s departure. They no longer want the old politics of race. This is a message to Umno to re-configure their politics based on Malays dealing with non-Malays.” \n \n“The Chinese have looked at Najib as a weak leader, a coward, ever since he blamed the narrow BN win in 2013 on them and called it a Chinese tsunami. He has not repeated his allegations after being advised by his people.” \n \nIn tearing into Najib, Zainuddin pointed out that no Prime Minister has showed himself as having so little dignity and this he added was evident in the RM2.6 billion donation which in Najib’s own words was from a foreign power. “He has admitted in his own words to being a tool of foreigners.” \n \n“At the same time, he has humiliated government servants and dragged them down through transfers and removals, arrests and investigations.” \n \nZainuddin appeared to accept the NGO Bersih 2.0’s figures that 500,000 people turned up in Kuala Lumpur alone for the weekend Bersih 4 rallies. The Bersih 4 rallies were held in Kuala Lumpur, Kota Kinabalu, Kuching and 70 cities worldwide.", "source": "Free Malaysia Today"}