{"published": "2015-09-11T05:44:33Z", "media-type": "News", "title": "BinckBank receives approval for appointment of COO", "id": "f83aacfd-29a5-4a06-b8a6-2a626ccb29a0", "content": "Comments\n\nSeptember 11, 2015 - London\n\nThe supervisory board of BinckBank has the intention to appoint Mr. Steven Clausing (1971) as Chief Operating Officer (statutory director). With this intended appointment the executive board of BinckBank is complete and will consist of three members: Mr. Vincent Germyns (Chairman of the executive board), Mr. Evert Kooistra (CFRO) and Mr. Steven Clausing (COO). The appointment of Steven Clausing will come into effect from the date of the Extraordinary General Meeting of Shareholders to be held in the fourth quarter of 2015. The term of the intended appointment of Mr. Steven Clausing will end at the annual shareholder meeting of 2019. The intended appointment of Steven Clausing is approved by De Nederlandsche Bank (DNB) and the works council has provided positive advice. Steven Clausing will be responsible for IT and product management and his appointment will give a strong impetus to the realization of \"operational excellence\", one of the key objectives of BinckBank. This new split of responsibilities enables the chairman of the executive board to focus on the execution of the strategy.\n\nVincent Germyns, Chairman of the executive Board: \"I am pleased with the intended appointment of Steven Clausing as COO at BinckBank. With his background in BinckBank he is familiar with the business and knows our people and our processes well. With Steven on board we can keep focus and gear up in realizing our strategy. Recently, the new organizational structure has been implemented. All key positions have been filled, and we continue to focus on the realization of our ambitions for the benefit of our customers and other stakeholders. \"\n\nSteven Clausing joined BinckBank in 2013 where he became responsible for risk management. Prior to BinckBank he held several senior management positions in the areas of commerce, internal organization and audit & risk management at ABN Amro Bank and RBS. This announcement is distributed by NASDAQ OMX Corporate Solutions on behalf of NASDAQ OMX Corporate Solutions clients.\n\nThe issuer of this announcement warrants that they are solely responsible for the content, accuracy and originality of the information contained therein.\n\nSource: BinckBank N.V. via Globenewswire\n\nHUG#1951260 GlobeNewswire Comment on this story", "source": "AndhraNews.net"}