{"published": "2015-09-30T11:49:04Z", "media-type": "News", "title": "MY TAKE ON THIS: Politicians should give us a break on empty promises", "id": "0d2211a7-7dd4-49de-ae02-5737f8bff7fe", "content": "Listening to politicians campaigning you a picture you get is that after October, Tanzanians will be living in heaven. Candidates’ promises paints a flawless Tanzania in which no one will labour for anything. \n\nIf you critically look at things which politicians in the campaign trail promise they are going to accomplish if elected, you will be petrified. Anyone with sober mind will be horrified and left wondering on how and when these politicians are going to fulfil these pledges. \n\nIt seems also that even those who are defending their seats have forgotten that in 2010 they issued a lot of promises majority of which they have not accomplished. They now go out to dish out even more promises.  \n\nWhile Mwalimu Nyerere used to tell Tanzanians that they will develop only through hard work, our candidates are competing to show that they have solutions to all problems and these solutions do not entail people working, let alone working hard, to resolve their problems. \n\nCandidates are promising each and everything but none of them have been heard telling Tanzanians that they will have to toil for them to earn their daily bread. \n\nMaking promises to the effect that people will not be required to work in order to better their lives amounts to making them complacent. And this will not only affect the individuals but the entire nation. For the nation to make strides it needs hard working people who will be able to first change their personal lives and then contribute for the national economy. \n\nCrave for victory should not blind the candidates and push them to give promises which in actual fact are not reasonable. We should only look back into 2010 and take stock of what was promised and what has been accomplished for us to be able to gauge what promising mean to the individuals and the nation. \n\nThe promises we have been hearing would need a lot of money to be implemented. But we are not told where this money will come from. Other candidates have started to cite natural gas as one source of money with which they will accomplish their promises. But we know that a better expert’s guess is that the next leadership will leave the office before the country starts to see real money from the natural gas. So, there is no point in cheating the public that gas will provide enough money for implementation of these many plans which we are hearing. \n\nPoliticians should campaign knowing that this country or its people are not going to end tomorrow. They should practice considerate politics which respect the fact that cheating would only give them satisfaction but subject the country and its people to pointless argony. \n\nPeter Nyanje is the Political/Election Editor of The Citizen", "source": "Tanzania Citizen"}