{"published": "2015-09-24T09:16:00Z", "media-type": "News", "title": "HCL Launches a Digital Service Exchange Platform", "id": "333a0c37-7de0-4424-aacd-48a96a261a07", "content": "SOURCE HCL Technologies Ltd\n\nNOIDA, India \n\nHCL Technologies (HCL), a leading global IT services provider, today announced the launch of a new Digital Service Exchange Platform enabled by ServiceNow software. This platform provides Service Integration and Management (SIAM) capabilities to enterprises allowing them to request and receive business services efficiently across their organizations.\n\nThe Digital Service Exchange Platform is where service demands such as content requisitions from various departments will be generated and standard catalogue with defined service utility and warranty will be provided to business, and IT and users, which can then be consumed via multiple access channels.\n\nThis offering combines ServiceNow's industry-leading service management platform with HCL's expertise in enterprise service management process design, process and technology integration and organizational change enabling a united service experience. Examples of the services in the digital exchange include Smart Content-as-a-Service, Smart Analytics-as-a-Service, Smart Commerce-as-a-Service and Smart Asset Services.\n\n\"Most organizations are trapped in too much e-mail and excessive administration, and need to automate their business processes,\" said Tom Moore, vice president of Global Service Providers and Integrators, ServiceNow. \"By transforming the service model, HCL is helping customers escape from the e-mail morass to automate tasks and drive business performance.\"\n\n\"The 21st century enterprises will need to be extremely agile to deliver best in class united experience to its users. Enterprises therefore need an on-demand access to a pool of dynamically configurable set of smart business services,\" said Kalyan Kumar, Senior Vice President & Chief Technologist - ITO, HCL Technologies. \"The Digital Services Exchange Platform will leverage HCL's unique DryIce orchestration concept which aggregates business services such as content and analytics to deliver in an outcome based everything-as-a-service model (XaaS).\"\n\n\"The HCL Digital Service Exchange Platform has a customizable and intuitive role-based user interface with built-in scalability and flexibility which makes it easy to use and deploy for enterprises across industries,\" said Jaco Van Eeden, Executive Vice President & Global Head, Beyond Digital Business Unit, HCL Technologies.\n\nToday, more than 100 global customers use HCL's offerings on the ServiceNow platform, and HCL's certified ServiceNow professionals manage more than one million assets through its platform.\n\nhttp://www.hcltech.com/press-releases/it-infrastructure-management/hcl-launches-digital-service-exchange-platform\n\nKunal Takalkar \n\n©2015 PR Newswire. All Rights Reserved.", "source": "State Journal"}