{"published": "2015-09-08T18:21:29Z", "media-type": "News", "title": "Squirrels going nutty in the gutters", "id": "9c267a9a-df7f-4281-b2bc-6d6fb0de32e8", "content": "DEAR JOAN: I have seen many inquiries about squirrels in your column, but nothing that addresses our situation. \n\nSquirrels are making problems for us all around the gutters of our house. \n\nI first heard the noise about three weeks ago, but this has obviously been going on for some time. The noise sounded like something was dragging a huge piece of concrete across our roof. When I went out to check, I found a squirrel attacking one of our gutters, which are now badly scratched. \n\nOur son has gone on our roof and found the same problem all around the perimeter of our house. Can you explain this behavior? What can we do to keep our gutters from being damaged further? We appreciate your advice. \n\nSquirrels anywhere you don't want them can be problem. (Courtesy of Mike Gordon) \n\nSandy Esposito \n\nDanville \n\nDEAR SANDY: Although squirrels will sometimes gnaw on gutters to because of their continuously growing teeth, I think in this case the squirrels have built a nest in the gutters. \n\nIt can happen when the gutters get filled with debris, which makes them pretty attractive to squirrels. \n\nYou'll want to check to see if you have any young squirrels still in the nest. If it's all clear, clean them out and try putting gutter guards over them, or cover them with a mesh. \n\nIf the squirrels still have youngsters in the nest, wait until they are grown before doing anything disruptive. \n\n\nDEAR JOAN: Are ants blind? \n\nJames J. \n\nSan Jose \n\nDear James: Some are, but most just have poor to mediocre eyesight. \n\nAs they can't afford glasses or contacts, they rely more on scents and pheromone trails to find their way into our houses and pantries. \n\nToo many bunnies \n\nThe Hayward Animal Shelter is inundated with bunnies, and volunteers and staff are hoping you can help. \n\nRabbits always are a bit of a difficult placement because most people going to shelters are looking for dogs and cats. But the shelter recently took in 14 rabbits, all of which had been cruelly left in boxes alongside the road. \n\nA kind soul spotted the boxes and checked them out, finding more than a dozen rabbits that most certainly would have died if they hadn't been found. \n\nTwo rescue groups -- House Rabbit Society and East Bay Rabbit Rescue -- stepped in to help, but they also are now at capacity. In an attempt to find these rabbits their forever homes, East Bay Rabbit Rescue is having an adoption event featuring mostly Hayward Animal Shelter bunnies. \n\nAll the bunnies are friendly, volunteers report, and all will be spayed or neutered before the event, which is slated for noon to 3 p.m. Saturday at Petsmart, 6960 Amador Plaza Road, Dublin. \n\nThe adoption fee is $70 and includes a care packet and cardboard carrier. \n\nIf you're wondering how to care for a rabbit, volunteers will be on hand to answer your questions. Rabbits are different from cats or dogs, but they make good pets for the right person. \n\nFor more information, call East Bay Rabbit Rescue at 925-519-1723, the Hayward Animal Shelter at 510-293-7200; online go to www.facebook.com/eastbayrabbit or www.facebook.com/haywardanimalshelter . \n\nContact Joan Morris at jmorris@bayareanewsgroup.com . Follow her at Twitter.com/AskJoanMorris .", "source": "Berryessa Sun"}