{"published": "2015-09-09T16:20:08Z", "media-type": "News", "title": "ETFs gather assets in August despite market woes", "id": "5a4575ec-1d82-4c11-9e91-2877db928a77", "content": "Against the backdrop of a global equity market sell-off, exchange-traded funds invested in equities still managed to see positive net asset flows, with $2.4bn of new money flowing in during August. Short and leveraged exchange-traded products also had a stellar month with $7.5bn of net inflows, according to data from ETF industry consultants  ETFGI . \n \nGlobal ETF and ETP asset growth is on course for a record year. \n \n“Worries about China’s stock market, currency and economy mixed with falling commodity prices helped to cause a correction in the US stock market. The S&P 500 Index ended August down 6%,” said Deborah Fuhr, managing partner at  ETFGI . \n \nAccording ETFGI, ETFs and ETPs listed globally gathered $20.8bn during August, marking their nineteenth consecutive month of positive net inflows. \n \nNet inflows into ETFs and ETPs remain on pace to beat the record levels set in 2014. So far this year $219.7bn in assets have made their way into the products, a 16% increase over the first eight months of 2014. \n \nFixed income ETFs and ETPs gathered the most assets during August with $8.8bn of net inflows, followed by short and leveraged products with $7.5bn, equity with $2.4bn and commodities with $1.5bn. Year-to-date (YTD), equity products have gathered the largest net inflows with $139.3bn, followed by fixed income with $52.8bn, and commodities with $3.7bn. \n \nVanguard topped the leaderboard in August as $4.7bn flowed into their ETF range. They were followed by DB x-trackers , with $3.4bn, Nomura with $3.1bn, UBS with $1.7bn and Lyxor with $1.2bn. \n \nIt is iShares , however, that has gathered the most assets so far this year – $63.4bn as of the end of August. Vanguard takes second place with $54.9bn, followed by DB x-trackers with $25.2bn, WisdomTree with $21.0bn, and Nomura with $13.5bn. \n \nThe trend in record-setting growth could also be seen at the country and regional level. In the United States YTD net inflows have reached $127.5bn, 19% higher than the prior record set last year. Europe’s YTD net inflows climbed to $59.7bn, a 17% increase on the record set in 2014. While in Japan, YTD net inflows were up 74% on last year, with $28.9bn gathered. \n \nAt the end of August, the global ETF/ETP industry had 5,926 ETFs/ETPs, with 11,451 listings, assets of $2.86 trillion, from 267 providers listed on 63 exchanges in 51 countries.", "source": "ETF Strategy"}