{"published": "2015-09-15T12:09:18Z", "media-type": "Blog", "title": "Backyard Bliss", "id": "90cecaa6-f494-4d73-8cf9-8c1a7aa4acfb", "content": "It’s funny – you would think we spent the entire summer in our backyard, but we actually avoided the deck and grass at all costs through the months of June, July, August, and most of September.  It was TOO HOT.  But now that it’s cooling off, we’re actually getting back outside as a family.  Hoorah! \n \n\n \nSpeaking of being outside… \n \n\n \nI made Candy Cane Lane iced tea this weekend, and it was THE BOMB. \n \n  \n \nAnyway… We did a major backyard renovation when we moved into our home three and a half years ago.  But here are the best part of our backyard! \n \n  \n \nThe Hammock \n \n  \n \nThe Husband gave me this hammock for my birthday (I think for #30?  Not sure – the years have started to blend together!).  I love laying in it and looking up at the trees.  It’s also a pretty good kiddo toy.  Hah. \n \n\n \nThe Large Deck \n \n  \n \nOur original deck was super small .  The design was so poor – for a decent-sized backyard, a little rectangle where you could hardly fit a few chairs just didn’t make sense. \n \n\n \nThe first time my mom saw the house, she said, “You should expand this deck out so it touches the top of the hill.”  Kristien and I were like… “You’re a GENIUS!” So that’s exactly what we did.  I love how much room there is now for eating, lounging and playing. \n \n\n \nOur Sun Sails are pretty cool, too – they were only $20 each at Costco and create so much shade.  \n \n  \n \nThe Sand Box \n \n  \n \nIn the back corner of the yard is our sandbox, which I got on Craiglist for $30 for Henry’s 1st birthday.  It is BY FAR his most loved and used toy.  I love the sandbox because he’ll head outside to the backyard and entertain himself forever – I love that it’s open-ended play. \n \n\n \nThe Geodome Climber \n \n  \n \nSO EXCITED about this addition!  I originally saw this product featured on a post by Janet Lansbury about Outdoor Play Spaces and knew I immediately had to buy it. I have been LUSTING for a swing set (things that parents say…) but decided that a geodome climber was much more cost and space efficient.  \n \n\n \nWe get an incredible amount of use out of this thing (BFF Nicole and I even climbed on it the other night!) and it’s so fun to watch Henry learn to navigate it.  I can tell that it will be used for many years by both kids.  And get this… it was only $200 or so! \n \n\n \nThings I Want to Add to the Backyard… \n \n  \n \nA Mud Kitchen \n \nRock climber grips along the side of the fence so Henry can climb along the side \n \nA tire swing \n \n  \n \nA kiddie-sized picnic table \n \n  \n \nWhat do you love most about your backyard from a grown-up or kiddo perspective?", "source": "Healthy Tipping Point"}