{"published": "2015-09-06T00:17:18Z", "media-type": "News", "title": "To hell and back: how a little girl survived 10 operations in six weeks", "id": "41ff4080-bb8b-4f65-8e83-16a0f56f9dae", "content": "Comment  ·  print ·  T  T \n\nT+·  T- \n\nTen-year-old K. Tejasri who recovered after undergoing 10 surgeries in Andhra Hospitals in Vijayawada. —Photo: V. Raju \n\nTen-year-old Tejasri got into RTC bus on May 16 not knowing that she was embarking on a trip to hell. \n\nIt was her own spirit and the assistance of several organisations that brought her back. \n\nThe bus collided with another near Kondapalli and several passengers were hurt. But Tejasri’s injuries were horrendous. \n\nTrauma section \n\nWhen she was wheeled into the trauma section of Andhra Hospitals, her case did not offer much hope. \n\nThere was a bleed in her brain. Her chest had been crushed and several ribs were broken. \n\nThere were injuries in her stomach and one leg was crushed. \n\nOver the next six weeks, she had to undergo 10 procedures, including a brain surgery. \n\nVentilator \n\nShe endured six weeks under a ventilator and for several more weeks, oxygen was supplied to her windpipe through a hole in her neck. Paediatric intensive care specialist P.V. Rama Rao said at a press conference at Andhra Hospital on Saturday that a surgery had to be performed within a couple of days to plug the bleed in the brain. A second operation was performed on the chest, a third on the abdomen and six more on the limbs to fix several fractures. \n\nArtificial leg \n\nHundred days after the accident, doctors finally declared Tejasri out of danger. Her head injury had healed, but the leg was lost. \n\nShe will, however, be able to walk with an artificial leg, doctors said. \n\nAndhra Hospitals group MD P.V. Ramana Murthy said Andhra Pradesh State Road Transport Managing Director N. Sambasiva Rao visited the child in hospital the day after the accident. \n\nTouched by the plight of the girl, Mr Rao told the hospital not to spare any expense to save the child’s life. \n\nMr Sambasiva Rao was also present at the media conference. \n\nDr Ramana Murthy said RTC released Rs 10 lakh for Tejasri’s treatment. \n\nMinister for Major Irrigation Devineni Umamaheswara Rao visited the girl and promised all support from the government. \n\nHundred days after the accident, doctors finally declare Tejasri is out of danger \n\nMore In: Vijayawada", "source": "The Hindu"}