{"published": "2015-09-21T19:38:43Z", "media-type": "Blog", "title": "HYENA ROAD - Review By Greg Klymkiw - TIFF 2015 - Yet another Gross Canadian movie", "id": "19ce812a-ac8c-456b-893a-c483e5080dae", "content": "This is not a scene from HYENA ROAD.\nIt is a scene from the genuinely brilliant\nBRING ME THE HEAD OF TIM HORTON:\nThe Making of \"Hyena Road\" Hyena Road (2015)\nDir. Paul Gross\nStarring: Paul Gross, Rossif Sutherland, Christine Horne, Niamatullah Arghandabi\nReview By Greg Klymkiw\nEven though the word \"Hyena\" is in the title, try not to confuse the abomination that is Hyena Road with the superb 2014 Hyena. The former is yet another dreadful Paul Gross war film, the latter a grim, gritty UK crime picture about police corruption and the Albanian Mob in contemporary London. The former will be released wide across Canadian screens later this year, whilst the latter has disappeared without a trace. Both films, however, played at the Toronto International Film Festival (TIFF). The former this year, the latter last year.\nCanadians have a real treat in store for them. They will not see Hyena. They will, however, see Hyena Road. This is primarily thanks to the largesse of the Canadian taxpayers themselves, who forked over a good chunk of the $12.5 million needed to put this rah-rah slice of propagandistic pro-war excrement on the screen and, of course, the ever - ahem - visionary Cineplex Entertainment theatre chain (monopoly) which would prefer to exhibit endless prints of awful studio pictures and, naturally, Paul Gross movies, rather than genuinely great Canadian films (or, for that matter, the very best indie foreign films).\nHyena Road has one thing going for it, though. While it's genuinely awful, it's not quite as laughably horrendous as Gross's previous war picture Passchendaele. That said, it might even be worse - not in terms of craft - but the fact that it extols the virtues of Canada's role in a war the country should never have become a part of. There isn't a single war in the Middle East which should have happened, never mind with the assistance of Canada's Armed Forces, but happen they did AND with Canada's help (not to mention the senseless deaths of our soldiers and those of innocent Afghanis and Iraquis).\nSo, what does the director of Men With Brooms (a witless purported comedy about the sport of curling) do? As he proved successful enough with Passchendaele, his WWI anti-war effort (a film which had its box-office grosses in Canada bought and paid for with oodles of marketing assistance from the Canadian taxpayer and the screen-count-largesse of the - ahem - visionary Cineplex Entertainment), Gross scratched his noggin and crapped out the fine idea of a pro-war propaganda film in Afghanistan.\nOh Canada. We stand on guard for thee by wiping out Afghani villages to ensure the safety of the American armed forces.\nYup, this is what we get with Hyena Road:\nPete Mitchell (Paul Gross) is the Canuck in charge of safely building a road through Taliban territory to allow for the safer passage of coalition forces (America, really). Mitchell, however, is no mere lean, mean, fighting machine, he's a military intelligence (a bit of an oxymoron, mais non?) officer. His real goal is to ferret out The Ghost (Niamatullah Arghandabi), a mujahideen who could prove to be an excellent ally. To this end, Mitchell puts the brave sniper (a bit of an oxymoron, mais non?) in the role of front man for this operation.\nRyan Sanders (Rossif Sutherland) has scruples, however. He doesn't like being manipulated and he refuses to kill children. Isn't that special? Good thing too, since he's been boinking Jennifer Bowman (Christine Horne), the film's token female window dressing who runs the command centre (and also appears afflicted with - horrors - morning sickness). It sure would be Gross if he killed kids whilst his girlie-pie is carrying his eventual progeny (to no doubt grow up to kill more people in battle during the next senseless war).\nAmidst the simplistic military maneuvers and soap suds outlined above, Gross stages several big violent action set pieces with both Jordan and Manitoba's Carberry Desert nicely standing in for Afghanistan. Here is one aspect that the film modestly excels at. Gross wisely crews up with artists who've plied their trade on good, if not great Canadian films.\nThanks to one of Canada's most gifted cinematographers Karim Hussain (We Are Still Here, Hobo With A Shotgun), and the equally gifted Canuck editor David Wharnsby (Guy Maddin's Saddest Music in the World and Sarah Polley's Away From Her), the action more-than-ably rip-snorts along, providing superb war-porn for action aficionados.\nWhere these sequences fail, however, is Gross's awful screenplay which puts dull dialogue in the mouths of the characters - if one can even call them characters as opposed to simple types - and, of course, unlike genuinely great (if not even good war pictures) we have no human being to hang our hopes and dreams upon as they march forward into the carnage of battle.\nThough Hyena Road is a disgrace and has no business receiving taxpayer financing and even less business being featured as a Gala Presentation during TIFF, one of the world's most prestigious film festivals, its real problem lies in the fact that the movie is just plain bad as opposed to being the unmitigated stinker Passchendaele was.\nThat film was so awful I blessed it with my lowest Film Corner rating imaginable: THE TURD FOUND BEHIND HARRY'S CHARBROIL GRILL & DINING LOUNGE. But WOE! I could not even bring myself to affix my second-lowest Film Corner Rating to Hyena Road, the ever-famous, ONE PUBIC HAIR (which I proudly bestowed upon Sharknado).\nNope. Hyena Road belongs to a special class of bad movies - a picture so dull and mediocre it rates the most dull and mediocre of all the Film Corner Ratings.\nTHE FILM CORNER RATING: * One-Star\nHyena Road enjoys its World Premiere as a GALA at TIFF 2015. For further info visit the TIFF website HERE. It will be seen all across Canada via Elevation Pictures.", "source": "The Film Corner with Greg Klymkiw"}