{"published": "2015-09-16T15:49:00Z", "media-type": "News", "title": "Toshiba's Hybrid Cloud and On-premise VoIP Networking Solution Wins 2015 Communications Solutions Product of the Year Award", "id": "b3905ca9-ffa7-49fc-8860-40038c448273", "content": "SOURCE Toshiba America Information Systems, Inc., Telecommunication Systems Division\n\nIRVINE, Calif. \n\n\"We are honored to receive a 2015 Communications Solutions Product of the Year Award for our Hybrid Cloud and On-premise Networking Solution,\" said Brian Metherell \n\nDanny Simmons, PC \n\n\"With Toshiba's Hybrid Cloud Solution, our employees can communicate using a variety of devices, including their own mobile phones and tablets,\" added Bobby Awtrey Toshiba's Hybrid Cloud and On-premise Networking Solution Delivers Integration\n\nToshiba's new hybrid on-premise and cloud solution delivers networking support among its on-premises IPedge® and Strata® CIX business telephone systems and VIPedge® cloud-based business telephone solution. Networking together on-premise and cloud systems provides users with a robust hybrid business communication solution that helps users expand features and reduce costs while utilizing the deployment platforms of their choice.\n\nBenefits include:\n\nAbout TMC\n\nTMC is a global, integrated media company that supports clients' goals by building communities in print, online, and face to face. TMC publishes multiple magazines including Cloud Computing, IoT Evolution, Customer, and Internet Telephony. TMCnet is the leading source of news and articles for the communications and technology industries, and is read by 1.5 million unique visitors monthly. TMC produces a variety of trade events, including ITEXPO, the world's leading business technology event, as well as industry events: 2015 Connecticut Mobile Summit; Asterisk World; AstriCon; ChannelVision (CVx) Expo; DevCon5 - HTML5 & Mobile App Developer Conference; Drone Zone 360; IoT Evolution Conference & Expo; IoT Evolution Developers Conference; IoT Evolution Fog, Analytics & Data Conference; IoT Evolution Connected Transportation Conference; IoT Evolution Connected Home & Building Conference; MSP Expo; NFV Expo; SIP Trunking, Unified Communications & WebRTC Seminars; Wearable Tech Conference & Expo featuring Fitness and Sports Wearable Technology (FAST) Expo; WebRTC Conference & Expo; and more. \n\nFor more information about TMC, visit www.tmcnet.com.\n\nAbout Toshiba America Information Systems, Inc.\n\nTelecommunication Systems Division (TSD)\n\nToshiba America Information Systems, Inc., Telecommunication Systems Division is one of the five business units of Toshiba America Information Systems, Inc. (TAIS) and offers business communication solutions for SMB enterprises and enterprises with multi-site or regional locations. Toshiba's VIPedge cloud-based business telephone solution supports up to 500 users, and the IPedge and Strata CIX systems support from 8 to 1,000 users and offer Voice over IP, voice mail and unified messaging, conferencing and collaboration, unified communications applications, networking, mobility and more. Together with Toshiba's PCs, tablets, copiers, and surveillance video cameras/recorders, Toshiba's Telecommunication Systems Division helps enterprises maximize business efficiency in communications and mobility. Headquartered in Irvine, Calif. \n\nAbout Toshiba\n\nToshiba Corporation, a Fortune 500 company, channels world-class capabilities in advanced electronic and electrical product and systems into five strategic business domains: Energy & Infrastructure, Community Solutions, Healthcare Systems & Services, Electronic Devices & Components, and Lifestyles Products & Services. Guided by the principles of The Basic Commitment of the Toshiba Group, \"Committed to People, Committed to the Future\", Toshiba promotes global operations towards securing \"Growth Through Creativity and Innovation\", and is contributing to the achievement of a world in which people everywhere live in safe, secure and comfortable society. Founded in Tokyo \n\nFor additional information, or to purchase Toshiba telecommunication products, visit http://www.telecom.toshiba.com for an Authorized Toshiba Dealer. \n\nTo subscribe to the Toshiba Telecom Blog, visit http://blog.telecom.toshiba.com/.\n\nFollow us on Facebook (ToshibaPhoneSystems), Twitter (toshibaphonesys) and LinkedIn (Toshiba-telecommunication-systems-division).\n\n© 2015 Toshiba America Information Systems, Inc. All rights reserved. All product, service and company names are trademarks, registered trademarks or service marks of their respective owners. Information including, without limitation, product prices, specifications, availability, content of services, and contact information is subject to change without notice.\n\nToshiba PR Contact:\n\nTeri Sawyer \n\nTMC Contact:\n\nRebecca Conyngham \n\nLogo - http://photos.prnewswire.com/prnh/20150916/267054LOGO Logo - http://photos.prnewswire.com/prnh/20150408/197413LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/toshibas-hybrid-cloud-and-on-premise-voip-networking-solution-wins-2015-communications-solutions-product-of-the-year-award-300143980.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KYTX CBS 19"}