{"published": "2015-09-21T14:00:52Z", "media-type": "Blog", "title": "Northeast India – Matchless Opportunities for Ecotourism", "id": "410902a8-2c41-4045-86d6-e1b4b34ac8da", "content": "There is a certain mysticism associated with the states of Northeast India, mostly due to the fact that people from the rest of the country do not know much about this largely hilly terrain. Another factor why the seven states that make up this land remain so mysterious is because they are extremely remote and also difficult to access due to the many entry and travel restrictions imposed by the government of India. The good thing about the remoteness and lack of accessibility is that the natural environs have largely remained unspoiled. Today, the entire region is a source of great delight to animal lovers as well as botanists and nature conservationists. Here’s a peek at some of the top ecotourism attractions of the region. Kaziranga National Park, Assam The natural habitat of the famed Great One-horned rhinoceros, the Kaziranga National Park is a world heritage site. Spread over a mammoth 430 sq. km. the park is famous for an extremely varied ecosystem fostered by the rich alluvial soil fed by the Brahmaputra River and its many tributaries. The river system has also carved out geographical features that are unique and provide substance to much of its charm. Visitors will be enthralled by the formation of sandbars, chapories, and beels. While the rhinos are definitely the star attraction, there are fabulous opportunities to get up and close with tigers, leopards, jackals, foxes, bears as well as a large assortment of avian, insect and reptilian lives. For those fascinated by snakes, the park happens to be one of the largest homes to the King Cobra, the Rock Python and the Reticulated Python. Majuli, Assam Majuli enjoys the distinction of being the world’s largest river island. Situated in Assam’s Brahmaputra River, it is famed for being home to a large number of migratory birds and amphibians. The majority of the inhabitants belong to Mising, SonowalKacharis, and Deon tribes. Tourists can enjoy the many festivals that are held on the island; the principal one being Raas which is a celebration of the life of Lord Krishna and is held annually around the time the rest of the country observes Janmastami. The Majuli Festival is a big carnival that attracts many cultural troupes from other states of the North East. You can pick extremely fine specimens of pottery and face masks that are the specialty of the island’s craftsmen as souvenirs. Mawlynnong, Meghalaya Situated in Meghalaya’s East Khasi Hills, Mawlynnong has earned the well-deserved reputation for being the cleanest village in Asia. The place is also famous for its rich biodiversity as tourists will discover. The village is nestled in an evergreen forest that is home to a large variety of animals, birds, and plant life. Chief attractions for the visitors include the many waterfalls, the Living Root Bridge, and many natural caves that beg to be explored. An 80-foot high observatory offers the perfect view of the abundant natural beauty of Mawlynnong. Another point of great wonder is the Natural Balancing Rock. During the monsoons the entire character of the place changes; the greenery become denser and lush, the wild orchids start flowering and create a riot of colors, and there is an abundance of waterfalls and streams that can keep you captivated during your treks. You can also catch some breathtaking views of the plains of Bangladesh as Mawlynnong sits right on the border. Jotsoma village, Nagaland Situated deep in Nagaland in the proximity of the state capital, Kohima, Jotsoma is perhaps the remotest Indian village. The village sits right in the center of a highly-diversified ecosystem and is also immensely scenic. The abundance of birds makes it ideal for bird lovers who flock there during the migratory season. Namdhapa National Park, Arunachal Pradesh Namdhapa National Park covering a humongous 1,985 sq. km. has a place in ecotourism due to the presence of four felines; the tiger, the clouded leopard, the snow leopard, and the Indian leopard. Large predators such as the Asiatic Black Bear and dhole abound along with the Red Panda, Oriental small-clawed otter, Eurasian otter, a variety of civets and cats. The highly-endangered Hoolock Gibbons can be spotted sometimes, however non-human primates such as Capped Langurs, Slow Loris, Assamese Macaques, Stump-tailed macaques, and Rhesus Macaques are more easily seen. There are lots of elephants, musk deer, hog deer, gaur, goral, sambhar, takin, mainland serow, and bharal as well as wild boar. The large expanse of forest harbors a rich diversity of plant life that changes with the altitude that ranges from just 500 m to a lofty 4,500 m. Author bio: Sujain Thomas is a well-known traveler and loves to travel around world. She travels frequently across the world and has visited almost all the tiger resorts in India.", "source": "buildingmybento"}