{"published": "2015-09-15T07:33:42Z", "media-type": "News", "title": "La Granja Restaurants Takes Top Honors at the Almuerzos Y Cenas Awards 2015, Miami, FL, September 2015", "id": "194c20ff-80af-462b-aa1a-93d33726a856", "content": "La Granja Restaurants was the recipient of three awards for its achievements in restaurant hospitality throughout the state of Florida at the 2nd annual Almuerzos Y Cenas Awards 2015.  La Granja's Racso Bartra and Gustavo Bartra Jr. were both awarded with the Restaurateur of the Year 2014 award. La Granja Restaurants was also honored with an award for Most Successful Peruvian Restaurant 2014, and Chef Ivan Tucker of La Granja was presented with an award for Lunch and Dinner Special Recognition 2014. La Granja Restaurants was acknowledged at the awards ceremony for serving Floridians with the highest quality of Peruvian food. \n\nThe Bartra brothers established their first restaurant in 1993 on the island of Aruba.  After a very successful reception in Aruba, they opened their first  restaurant in South Florida, introducing their fresh, family style, healthy Peruvian food dishes.  They expanded along the way with locations from Miami to Orlando. In 2007 they began to offer franchises of their popular restaurant. They currently have 9 franchises in South Florida, all offering the same delicious cuisine. \n   \nThe Bartra family credits La Granja's great success to their hard work, as well as being afforded the chance to prosper in the United States of America, which they truly believe is the land of opportunity. \n\nIn addition to providing great home cooked Peruvian meals that are also affordable, La Granja also supports the South Florida community by partnering with grass roots youth organizations like ASPIRA, honoring veterans, and offering scholarships to Florida residents of Hispanic and Latino descent to Palm Beach Community College. \n\nFor further information, please contact: \nLa Granja Corporate Office \n3907 NW 49th Street \nTamarac, Fl 33309 \nPhone: (954) 968-7988 \ninfo(at)lagranjarestaurants(dot)com \nhttp://lagranjarestaurants.com/ \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12957984.htm \nPRWeb.com", "source": "BioSpace"}