{"published": "2015-09-15T13:00:00Z", "media-type": "News", "title": "Ellipse Technologies Enhances Executive Management Team", "id": "d6b9fbf9-2714-4925-abe7-86e83f1d30d9", "content": "ALISO VIEJO, Calif., Sept. 15, 2015 (GLOBE NEWSWIRE) -- Ellipse Technologies, Inc., a global medical device company, announced today the appointments of Jeff Rydin as Chief Sales Officer and Bob Krist as Chief Financial Officer. \n\nJeff Rydin joins Ellipse after most recently serving as President of Global Sales at NuVasive, Inc. ( NASDAQ:NUVA ), a medical device company focused on developing products for minimally invasive surgical treatments for the spine. Prior to NuVasive, Mr. Rydin was Area Vice President at DePuy Spine, Inc. where he managed a $100 million division and established a sales team in the Southeastern U.S. over his three-year tenure. Mr. Rydin also served in various executive and leadership sales roles at Orquest (acquired by Johnson & Johnson), Symphonix, General Surgical Innovations (acquired by Tyco International), Baxter Healthcare, and Xerox. \n   \nBob Krist most recently served as Chief Financial Officer at Endologix, Inc. ( NASDAQ:ELGX ), a developer and marketer of innovative minimally invasive treatments for aortic disorders. At Endologix, Mr. Krist was responsible for building the company's financial infrastructure, overseeing several equity capital raises. Prior to Endologix, Mr. Krist served as Chief Financial Officer of CardioNet, Inc., a privately held marketer of mobile cardiac outpatient telemetry tools and services, where he also played a key role in developing the company's business model and overseeing several equity and debt capital raises. Mr. Krist has held several other executive management positions at public and private healthcare companies. \n\nEd Roschak, President and Chief Executive Officer of Ellipse commented, \"the addition of these two seasoned executives significantly enhances our leadership team. As NuVasive's President of Global Sales, Jeff helped grow revenues from $38 million to over $600 million. Bob offers deep public company CFO and SEC reporting experience. While at Endologix, the company experienced rapid product adoption while he oversaw several public equity financings. We are very fortunate to have these two highly experienced, proven executives join the Ellipse team, and we look forward to the contributions they will both make as we drive adoption of our adjustable implant technology.\" \n\nAbout Ellipse Technologies \n\nEllipse Technologies, Inc. is a privately held medical technology company located in Aliso Viejo, California. The Company is focused on revolutionizing orthopedic surgery by developing and marketing a new generation of magnetically adjustable implant systems based on the MAGnetic External Control, or MAGEC® technology platform. The Company's novel and proprietary implants are adjustable at the time of implantation and non-invasively over the course of treatment to accommodate the changing clinical needs of patients as they heal, grow or age. This technology provides significant improvements in patient clinical outcomes and quality of life while generating significant cost savings to the healthcare system. For more information, visit www.ellipse-tech.com . \nCONTACT: Investor Contacts:\n         \n         Nick Laudico or Zack Kubow\n         The Ruth Group\n         646-536-7030 / 7020 nlaudico@theruthgroup.com  zkubow@theruthgroup.com", "source": "BioSpace"}