{"published": "2015-09-16T12:00:00Z", "media-type": "News", "title": "Eastplats and Hebei Zhongbo Receive Approval from the South African Competition Authorities", "id": "0ebc6376-d7f2-42c9-94e4-0191f40a2457", "content": "VANCOUVER, BRITISH COLUMBIA -- (Marketwired) -- 09/16/15 -- Eastern Platinum Limited (the \"Company\") (TSX:ELR)(JSE:EPS) is pleased to announce that the Competition Authorities of South Africa have granted unconditional approval for the transaction whereby Hebei Zhongbo Platinum Co. Limited (\"HZP\") is to acquire the Company's entire platinum group metals (\"PGM\") business and all investments and loan agreements that Eastplats has with its subsidiary companies (the \"Original Transaction\"). \n\nThe Company announced on June 8, 2015 that the parties had agreed to a restructuring of the Original Transaction whereby the parties would first proceed to complete the purchase and sale of the Crocodile River Mine and associated inter-corporate loans for US$85,000,000, payable in cash on closing, followed by the purchase and sale of the balance of the Company's remaining PGM business (the Spitzkop, Kennedy's Vale and Mareesburg projects and inter-corporate loans) for US$140,000,000, also payable in cash on closing. As of the date hereof, the restructuring and the closing of the above referenced transactions remain subject to the execution of definite agreements and the receipt of all necessary South African regulatory approvals, including the approval of the Department of Mineral Resources.\n\nFurther to the proposed restructuring, the Company announced on August 10, 2015 that it had sought to extend the \"Final Date\" under the original agreements with HZP (as detailed in the Company's news release of November 7, 2014) (the \"Original Agreements\") from August 7, 2015 to December 31, 2015 (the \"Final Date\" being the date under the Original Agreements following which either party may elect to terminate the Original Agreements without recourse). As at the date hereof, letter agreements giving effect to such extension remain outstanding.\n\nNo stock exchange, securities commission or other regulatory authority has approved or disapproved the information contained herein. \n\nCautionary Statement Regarding Forward-Looking Information \n\nThis press release contains 'forward-looking information' within the meaning of Canadian securities legislation. Forward-looking information in this press release includes information about the completion, timing and potential benefits of the proposed transaction between Eastplats and HZP. These forward-looking statements are subject to a variety of risks and uncertainties which could cause actual events or results to differ materially from those anticipated, including, the contemplated transaction not being completed as a result of a number of factors including, without limitation, required regulatory approvals not being obtained; and other risks and uncertainties. Readers should not place undue reliance on the forward-looking information contained in this news release. Eastplats does not undertake to update any forward-looking information, except as required by applicable securities laws. \n\nEastern Platinum Limited\n\nSource: Eastern Platinum Limited", "source": "Nasdaq"}