{"published": "2015-09-28T05:00:00Z", "media-type": "News", "title": "Party Perfect Carvings for Halloween", "id": "df9e82d3-f399-4a3c-a4b8-3f8175f89e6d", "content": "(Family Features) It’s that time of year – jack-o-melon carving time! Watermelon carvings are a fun and different way to show off your spookiest Halloween faces. \n  \nThrowing a Monster Mash has never been more fun, and this watermelon carving makes the ultimate centerpiece as the head of Frankenstein. Then round out your party menu with these kid-friendly Watermelon Glazed Meatballs and let the spooktacular celebrating begin. \n \nBefore you start carving, check out a few helpful carving tips and tricks: \n The whole watermelon should be at room temperate when you carve to make cutting and slicing easier. Then chill the watermelon after cutting and before serving. Cut a small, thin, flat piece from the bottom of the watermelon before carving. This will provide a flat base, making the watermelon more stable when carving. Draw the design on the watermelon rind with a fine/medium point waterproof marker or a sharp pencil before you cut. Use a sharp knife with a pointed tip – the sharper the knife, the easier and cleaner the cuts will be. \nFor more wicked watermelon carving inspiration, visit www.watermelon.org/Carvings . \n \nRecipe: Watermelon Glazed Meatballs \n\nIngredients: \n2 tablespoons vegetable oil 24-36 frozen prepared mini meatballs 1 cup watermelon puree (instructions below) 1 cup prepared barbecue sauce \nPreparation: \nHeat oil in large heavy saute pan over medium high heat or electric skillet set on 325°F. Saute meatballs until browned and hot. Reduce heat to low. To make the watermelon puree, remove seeds from fresh watermelon and cut into large chunks. Place in a blender and process until smooth and well pureed. Mix together barbecue sauce and watermelon puree. Pour over meatballs and simmer for a few minutes. Serve hot. \n6 to 8 \n \nRecipe: Head of Frankenstein \n\nIngredients: \nOblong shaped seedless or seeded watermelon Large kitchen and paring knives Melon baller Honeydew Green dry erase marker Straight pins or toothpicks Chocolate wafer cookies, large and mini sizes Black edible sugar sheets or construction paper Black licorice strings Pair of chop sticks Chocolate covered mini donuts Spooky decorations \nPreparation: \nWash watermelon under cool running water and pat dry. On cutting board, place watermelon on its side and cut 1/2 to 3/4 inch from each end, creating a sturdy base and top portion of carving. Stand watermelon upright. Scoop out a good amount of red fruit from top of watermelon with melon baller, also using a melon baller scoop a generous portion of honeydew to make fruit salad. Refill top portion of watermelon with balls of watermelon and honeydew. From ends that were cut off, draw nose with dry erase marker and use paring knife to cut it out. Attach to watermelon using straight pins or toothpicks. For eyes peel two large and two small chocolate wafer cookies in half. Using sturdy toothpicks or straight pins, attach large cookies with white icing facing out from watermelon and attach small black cookie portion to white icing to create Frankenstein's pupils. Cut black edible sugar sheets or construction paper half length wise then make zig zag cuts to create hair; attach this to top of watermelon using straight pins. Use straight pins to attach black licorice to create mouth and stitches randomly on face. Three-quarters down watermelon on each side of face, insert a chopstick and attach a chocolate covered mini donut to each chopstick to resemble screws in Frankenstein's neck. Complete carving with additional spooky decorations.", "source": "Western Courier"}