{"published": "2015-09-14T15:03:57Z", "media-type": "News", "title": "Fyber Achieves 250% Revenue Growth for Mobile Video Ads, Doubles Down on Programmatic Video Capabilities", "id": "8b298e5a-21f4-4b14-90b7-f2ae4d162a5e", "content": "Self-service Supply-Side Platform Fyber Connects Publishers and App Developers to Over 120 Leading Dsps \n\n\nBERLIN, GERMANY --(Marketwired - September 14, 2015) - Fyber, a leading advertising technology platform, announced that it has seen a weekly revenue increase of more than 250% for its next generation Mobile Video product on the Fyber Exchange between May and August 2015 while impressions increased by over 330%. Mobile video in general saw strong growth on the Fyber platform in recent months. This underscores a strong monetization and growth opportunity in mobile and multi-screen video as Fyber's prominent ad format. \n\nThe exponential growth in the number of mobile devices globally is driving mobile video ad spend at a faster rate than any other type of digital marketing. According to eMarketer, advertisers will spend $3.94 billion on mobile video next year, an increase of 50 percent. This growth is further supported by increases in programmatic ad spend, which is projected to reach $2 billion for video on all devices, and double again in 2016. \n\n\"To capitalize on mobile video as the fastest growing ad format, we need to make the campaign buying process as easy and transparent for advertisers as possible,\" said Janis Zech, Fyber's co-founder. \"This means a continuous investment in Fyber's programmatic capabilities to strengthen the value provided by our own Exchange, on top of our vast mediated demand offerings.\" Earlier this year , the company acquired RTB (real-time bidding) platform Falk Realtime to strengthen its own programmatic stack by offering premium programmatic pre-roll and in-app inventory. \n\nThe results of this strategy are underlined by the impressive roster of demand-side platforms that are working with Fyber. Over 120 of the world's leading DSPs and demand source partners -- including AppNexus, DataXu, MediaMath, The Trade Desk, TubeMogul, and YuMe -- now bid on Fyber's global inventory. \n\n\"Growing our sources of quality inventory has been essential to our business,\" said Tim Sims, head of inventory partnerships at The Trade Desk. \"We're pleased to be partnering with Fyber to deliver programmatic video campaigns on a global scale with Fyber's multi-format, multi-screen inventory.\" \n\n\"Partnering with industry leaders like Fyber is critical for us as we build out a broad and deep portfolio of supply for an open video marketplace,\" said Eric Hoffert, senior vice president of video technology at AppNexus. \"Fyber's focus on mobile video and global inventory is particularly attractive to many of our buyers. Together we are committed to maximizing reach and value for marketers to deliver campaigns for video users across multiple devices.\" \n\nIn addition to Fyber's programmatic capabilities, the company recently rolled out a new wave of market-leading enhancements to its mobile video products. These include an improved video player UX and advanced pre-caching controls that allow app developers to choose when and how many video ad network SDKs they want to initialize at app-start, resulting in a reduction in data and memory usage, loading times, and an overall improvement in app performance. The company has also extended its mobile video product offering to Android devices to better cater to cross-platform advertisers. \n\n\"As advertisers move toward a cross-screen approach, having highly-viewable mobile video inventory available for automated buying is vital,\" said Keith Eadie, chief marketing officer at TubeMogul. \"We applaud Fyber for its momentum and are proud that our software is contributing to that growth by offering brands a single solution to centralize buying and optimization across screens.\" \n\nMeet us at DMEXCO \nFyber will highlight its recent product innovations at DMEXCO in Hall 6, B071 on September 16-17th in Cologne, Germany. \n\nAbout Fyber  \nFyber is a leading mobile advertising technology company that empowers app developers to execute smart ad monetization strategies across all connected devices through a unified mobile Supply­-Side Platform. Serving approximately 330 million monthly active users, Fyber works with thousands of the world's leading app developers, publishers and advertisers. For more information, visit www.fyber.com .", "source": "MarketWired"}