{"published": "2015-09-08T09:30:44Z", "media-type": "News", "title": "BG Group plc’s Outperform Rating Reaffirmed at Sanford C. Bernstein (BG)", "id": "753e3c64-c640-44f7-8f89-db1e6c02e0d3", "content": "BG Group plc (LON:BG)‘s stock had its “outperform” rating reaffirmed by analysts at Sanford C. Bernstein in a note issued to investors on Tuesday, ARN reports. They presently have a GBX 1,460 ($22.17) target price on the stock. Sanford C. Bernstein’s target price would suggest a potential upside of 52.00% from the company’s previous close. […]\nThe post BG Group plc’s Outperform Rating Reaffirmed at Sanford C. Bernstein (BG) appeared first on Ticker… \r \nBG Group plc (LON:BG)‘s stock had its “outperform” rating reaffirmed by analysts at Sanford C. Bernstein in a note issued to investors on Tuesday, ARN reports. They presently have a GBX 1,460 ($22.17) target price on the stock. Sanford C. Bernstein’s target price would suggest a potential upside of 52.00% from the company’s previous close. \n\nA number of other brokerages also recently issued reports on BG. RBC Capital reissued a “sector perform” rating and issued a GBX 1,325 ($20.12) price target on shares of BG Group plc in a report on Thursday, May 21st. HSBC reaffirmed a “hold” rating and set a GBX 1,230 ($18.68) price objective on shares of BG Group plc in a report on Wednesday, May 13th. Equita SIM SpA restated a “hold” rating on shares of BG Group plc in a report on Monday, August 10th. Barclays reaffirmed an “equal weight” rating and issued a GBX 1,350 ($20.50) price objective on shares of BG Group plc in a research report on Monday, May 11th. Finally, BNP Paribas reissued a “neutral” rating and set a GBX 1,261 ($19.15) price target on shares of BG Group plc in a research report on Friday, May 15th. One research analyst has rated the stock with a sell rating, thirteen have given a hold rating and ten have issued a buy rating to the company. BG Group plc has a consensus rating of “Hold” and a consensus price target of GBX 1,182.69 ($17.96). \n\nIn other BG Group plc news, insider Patrick W. Thomas acquired 1,117 shares of the company’s stock in a transaction on Monday, June 15th. The shares were bought at an average cost of GBX 1,088.50 ($16.53) per share, with a total value of £12,158.55 ($18,464.00). \n\nBG Group plc (LON:BG) opened at 976.9000 on Tuesday. The firm’s market capitalization is GBX 33.33 billion. BG Group plc has a 1-year low of GBX 780.55 and a 1-year high of GBX 1,301.62. The company has a 50 day moving average of GBX 1,037.51 and a 200 day moving average of GBX 1,050.91. \n\nBG Group plc is a United Kingdom-based natural gas company. The Company has a portfolio of business interests focused on gas and oil exploration and production and on liquefied natural gas (LON:BG). It’s two business segments: Upstream, including production and exploration a…", "source": "MyInforms"}