{"published": "2015-09-28T05:49:40Z", "media-type": "News", "title": "Canberra Capitals set to sign reigning WNBL player of the year Abby Bishop", "id": "2df6c190-8610-4b41-9838-b18e472ff504", "content": "The Canberra Capitals are poised to re-sign reigning WNBL player of the year Abby Bishop in a massive boost to the club's hopes of ending a four-year finals drought. The Canberra Capitals are poised to re-sign reigning WNBL player of the year Abby Bishop in a massive boost to the club's hopes of ending a four-year finals drought. Bishop has been granted a release from her contract with Hungarian club UNIQA Sopron, and the Capitals are deep in discussions with their incumbent captain.\n\nThe 26-year-old picked up a minor hamstring injury playing for Seattle Storm and was due to head to Hungary next week, but Bishop and Sopron have come to a mutual agreement.\n\nIt is understood the Capitals hope to make an official announcement as early as this week.\n\nBishop dominated the WNBL last year, averaging 23 points and 10.6 rebounds, and was a clear winner of the player of the year.\n\nThe Capitals are very confident Bishop's injury isn't a risk and she will get through the full season.\n\nJust a few weeks ago the Capitals' roster was severely depleted, but they now look very much a finals contender after recruiting shrewdly since.\n\nBishop's recruitment helps ease the Capitals' concerns in the post, as they had been struggling to find a quality replacement after Belgian centre Ann Wauters withdrew late due to family reasons.\n\nStar centre Lauren Jackson, herself returning from knee surgery, is the only specialist post player Canberra currently has on its books.\n\nBut if both stay fit, Jackson and Bishop will from arguably the most imposing front court partnership in the WNBL.\n\nJackson's rehabilitation is progressing well and she plans to be back on court early in the season.\n\nOpals point guard Kathleen MacLeod also pulled out after falling pregnant, but the Capitals compensated by signing former WNBA All-Star Renee Montgomery last week.\n\nMontgomery's Minnesota Lynx has qualified for the WNBA Finals after disposing of Phoenix in the western conference finals.\n\nIt means Montgomery will miss at least the season-opener against Dandenong at AIS Arena on October 10, and the week two games at Sydney and Townsville should the WNBA Finals go the full five games.\n\nA lack of personnel, particularly in the front court, has forced the Capitals to cancel its pre-season game in Sydney on Saturday.\n\nWith Jackson, Bishop and Montgomery still absent, just seven contracted players suited up in three games against South-East Queensland last weekend.\n\nHanna Zavecz injured her ribs at training last week and Opals youngster Steph Talbot hit her head on the court against the Stars.\n\nThe Capitals aren't willing to risk the pair this week before the start of the WNBL season, but both will be fit to play.\n\nMeanwhile, the Capitals are yet to finalise a deal which would see the majority of their home games shifted from AIS Arena to the Royal Theatre.\n\nHowever, it is understood the club is confident an agreement will be reached before season tip-off.\n\nIt is hoped the move into the city to a smaller venue will ensure bigger crowds and a better atmosphere as the Capitals shoot for a first finals appearance since 2010-11. The story first appeared on The Sydney Morning Herald.", "source": "Daily Liberal"}