{"published": "2015-09-04T07:05:16Z", "media-type": "News", "title": "Badger culls begin in Dorset despite opposition from animal rights groups", "id": "cc075a78-8516-4f3e-b0b9-11c47c82e83d", "content": "Badger culls have begun in Dorset and are continuing in other parts of England, despite a call from Queen guitarist and campaigner Brian May for them to stop while he seeks a judicial review. \n \nThe Government's decision to extend the cull of badgers was announced last week, and the Department for Environment Food and Rural Affairs (Defra) has now confirmed the culls have begun. \n \nNatural England authorised a four-year licence for Dorset, where between 615 and 835 badgers are due to be killed over a six-week period this year, alongside the third of four years of culling in Gloucester and Somerset. \n \nA spokeswoman for Defra said: \"The culling activity is now under way in Dorset, Somerset and Gloucestershire.\" \n \nAnimal rights groups have voiced their anger over the move, pointing to an independent expert panel's findings that the trials had proved neither humane nor effective and should be halted. \n \nSpeaking last week Dr May, who founded the animal charity Save Me Trust, said: \"The Government should quit now, and save the taxpayer more fruitless expense. \n \n\"This is a tragedy for our farmers, cattle and wildlife. The scientific advice has been ignored by ministers with more badgers set to die again this year.\" \n \nFarming minister George Eustice said \"strong action\" was needed to protect the dairy and beef industry by controlling the spread of TB in cattle, claiming the support of \"leading vets\" for the culling policy. \n \nAnd farmers' leaders said they were disappointed the cull had not been extended to other areas. \n   \n Share article  \n   \nFigures released earlier this week showed culling badgers has cost the taxpayer £16.8 million in the past few years, or £6,775 for each animal killed. \n \nThe costs were revealed by Defra in response to a Freedom of Information request by the Badger Trust, who said the figures show the policy is an \"unacceptable burden on the taxpayer\".", "source": "Durham Times"}