{"published": "2015-09-24T23:49:20Z", "media-type": "News", "title": "Hall of Fame Village plans start to change", "id": "08d4ca03-cbb0-45b3-9276-d97ecc5f17f4", "content": "Plans for the Hall of Fame Village have begun to shift and are expected to continue changing. While the eight major components of the plan remain intact, new ideas for the estimated 75-acre complex were introduced publicly this week: n There could be a second hotel built to accommodate teams in town to use the youth fields. n Legends Landing — the retirement community planned for former NFL players — likely will be moved. n Residential development might be included. “When we share renderings, we are very clear to point out those are renderings,” said Pete Fierle, vice president of communications for the Pro Football Hall of Fame. The Hall of Fame Village design team had a full day of meetings scheduled Thursday, but no final decisions about the location or inclusion of elements at the Village were anticipated, those involved said. Details of the $476 million, eight-part Hall of Fame Village expansion on the Pro Football Hall of Fame campus were first announced in The Repository in May. Construction of the new Tom Benson Hall of Fame Stadium — the first phase of the Village — started this month, and representatives of the Pro Football Hall of Fame continue to attempt to acquire property in the area. THE PLAN The original plan presented for the Village included the stadium, upgrades to the museum, a four-star hotel and conference center, an NFL-themed attraction area, youth fields, an assisted living facility, a center for excellence, and retail and restaurant space, with a targeted completion date of 2018. Pro Football Hall of Fame executives at the time cautioned the plan would fluctuate. At Wednesday’s Plain Local Schools Board of Education meeting, executives from Industrial Realty Group — the master developer for the project — talked about some new ideas for the complex. There could be a residential component added to serve as a buffer between the Village and adjacent neighborhoods. Offices for Pro Football Hall of Fame officials might be moved out of the museum and into a new structure, and other high-profile clients — including the NFL and USA Football — might potentially be interested in opening offices there, too. Memorabilia not on display in the museum might decorate restaurants and the hotel. There likely will be nine youth fields, and a second hotel, possibly with a more moderate room rate, could be built. Legends Landing, which initially was plotted on the far end of the campus near the interstate, will be moving, but it’s not clear where. Tracy Green, president of IRG Realty Advisors, said Thursday he didn’t have more information about potential changes and that the design team wouldn’t make final decisions Thursday. Page 2 of 2 - FINANCING THE PROJECT Also on Wednesday, developers asked Plain Local Schools board members to consider approving a tax-increment financing agreement to help fund the project. Under a TIF, developers would pay property taxes as normal on the existing value of the property, but a chunk of the new taxes they’d pay when the property value rises as Hall of Fame Village is built would be diverted for future improvements. At the meeting, project leaders said they already have approached the Canton City Schools, city of Canton officials and Plain Township trustees about a TIF agreement. Plain Township Trustee Scott Haws on Thursday said a TIF was mentioned during individual meetings trustees had about development at the Village, but they haven’t received information about a suggested abatement percentage or length of the agreement. Canton Deputy Mayor Fonda Williams could not be reached immediately for comment. Representatives for both Plain Local Schools and Canton City Schools said Thursday the terms of the proposed TIF agreement haven’t been shared with their districts yet. Other financing options for the project include designating the acreage a tourism development district to recoup additional sales taxes from leased property or sales; pitching the concept to foreign investors; and using the developer’s capital. Staff writer Kelli Young contributed to this report. Reach Alison at 330-580-8312 or alison.matas @cantonrep.com.On Twitter: @amatasREP", "source": "Canton Repository"}