{"published": "2015-08-31T18:07:08Z", "media-type": "Blog", "title": "IN YOUR PLACE - Chapter XIX", "id": "d713f719-9717-46ef-a9a0-fbc79cf97f56", "content": "New chapter! Sorry for the delay, I am more complicated daily that this fic! :)\nAlternative 1980: John and Paul are working, Some chat nice between them... Linda...in suspicion,,, Good News for someone...?.\n\nhope you like it.\n\nEverything is fiction !!!! Not forget.\nPlease comment and it not is much more to reach the end, I hope to post more often.\nThank you for your support, ignore the errors of language.\nThank you!\n\n\nChapter XIX\n\nThe long white corridors of the clinic will twisted his stomach.\nNeatness, dry \"inert\" floral arrangements, the absence of aromas, of any kind and only minimal details reminded him he was in a not cozy place.\nThe only thing warm there, was rebel sun that filtered through the blinds, a few meters.\n\nHe crossed his legs. Waiting.\n\nHe did not know what was really happening. He did not suffer for his contusion, but apparently had some dark bumps in his memory, however, he told himself, if none of this affected his work or his family should not be alarmed.\n\nSuddenly, the mischievous smile of John came yet again to his mind.\nHe realized that just thinking about him, his heart racing ... heck! What brought about this sudden change occurred in both? ... How would he carry these feelings without affecting his current life? ...\n\nDoes he was unfaithful to Linda?\n John assured him that no, always, even in the Asher time, this was never admitted as such ... They knew they were beyond the common relations between men and women, were united in various aspects and levels, and everything that happened among them, are born of the deep need of unification.\nAnd he believed it.\nSometimes he saw himself as a coin, on one side, his life as it was exposed to the outside world, the pop star and his beautiful family ... and on the other side, John, his secret love, his weakness. And although they tried to keep this just between them, a handful persons knew almost certainly, he thought, George, Ringo ... Mike ...\n\nAfter, their horrendous separation  ... years apart, learning to live without him and trying to rise from his own ashes ... until, no apparent reason, the encounter happens, passion, uncontrolled, again.\n\nShould I now declare this to his inner circle, that is, Linda? ... Could she understand it? Suddenly he felt very insecure.\nThat would take time, he thought, to sort these sensitive issues.\n\nLinda was walking towards him with an envelope and sealed several papers. In these cases, it is when he left her to take care, doctors, patients, and analysis procedures, were things that Paul preferred to avoid. She had insisted on checking to see the aftermath of the hit in his head and Paul had no choice, accompanied her as a child who will reluctantly behind his mother.\n\nShe motioned for him to go up and both entered the office of Dr. Cayce.\nAfter the presentations, and see the results of the studies, Dr. had some doubts.\n\n- Do you feel pain at some moment?\n\n- Not at all - Paul reply, he wanted to leave the clinic as soon as possible.\n\n- According to studies, there was no internal injury. But the hit has left marks that can be momentary or permanent - Dr. Cayce adjusted his glasses - I understand that you have trouble remembering ... certain things ... This is called Selective Amnesia.\n\n- Is there a cure for that? - Linda asked, somewhat alarmed.\n\n- There is treatment.... precise methods to exercise the lost memory. Sometimes the patient forgets inexplicably traumatic sequences and retrieves it  in the same way.\n\nPaul paid attention to the latter.\n\n- In that case, I do not know why it would be best to remember, perhaps the mind thus protects us from bad experiences - concluded Paul.\n\n- It is one hypothesis, yes, but I think it is always better to know than  to ignore - Cayce answered - and if you ever need it, hypnosis is there, as highly efficient resource.\n\n- I will have in mind, Dr. - Paul got up, held out his hand kindly to the  professional, looked rushed. Linda quickly picked up the papers and greet Cayce before leaving. Paul was in the hallway going to the exit.\n\n- Wait a minute! - Linda said while she was trying to carrying the portfolio, the papers and jacket - Why such a hurry?\n\n- Oh, sorry Lyn, George Martin is waiting for me  in the studio, I have a lot of work and chats to do with him . We have two full months to deal with the new songs.\n\n- Great !!!... - Linda sighed, at least for a couple of months there would not travel to New York and they would \"normally\" to live  their lifes.\nThere no would be \"John\" on the horizon for now.\n\n-----------------------------------------------------------------------------------------------------------------------------\n\nJohn, across the ocean, also had plans with his music.\nAlthough he had never been very organized, nor practical, nor foresight now, he had planned to start working on songs for a new album. He had some material recorded on tape and much in the mind waiting to get out .\n\nIt seemed a miraculous revival. The emotional closeness with Paul and experiences in Bermuda had renewed her inspiration.\nBut above all the incredible epic in command of the ship, struggling  against fierce storm in front of him, and the fact that he could return unscathed and he could  save Paul,  was a hinge, and had returned part of their lost confidence in himself.\n\nHe felt with new strength and reason to follow, and their natural way of expressing was music.\n\nYoko saw this change in him, just he came back from his days off. And as usual, he was there to encourage him in what he wanted to do, more if it means he is far from Paul.\n\n- I think Geffen Records is the place - she said hanging up the phone - this brochure Look, John, no doubt, is the best studio ...\nJohn checked the pages and seemed happy with the photos, services and details of available technology.\n His situation was equally distant with Yoko, but at some point, he believed she was being flexible about let it be freer about his choices. Avoiding disputes. He knew she did not approve the days he spent with Paul, but neither said anything about it. Yoko, thinking, was the same woman that always.\nNow, John believe, was the need to bring forward to this new album, like it or not, she was better than him to take commercial advantage. John knew she was his \"necessary evil\"\n\n- Sounds good, when you have the finished material, perhaps opt for this study - said John.\n\nYoko was pleased, slowly, she is thinking regain control of their marriage, while John is recording, would not have Paul on the horizon.\n\n-----------------------------------------------------------------------------------------------------------------------------\n\nPaul's birthday was a special day, particularly festive.\nLinda had arranged for part of the family of Paul who had long not come. Some cousins and their children, Mike and his family, and other close relatives gathered at his house and soon became a bustling party.\n\nPaul looked happy, he had recovered his smile without shadows, like he had before the episode Japan. \"Maybe forget, was a blessing, now,\" she thought.\nShe took a tray laden with snacks and went into the yard, when the phone rang in the room.\n\n- Hello?\n\n- Lyn? How nice to hear! - Warm voice of John.\n\n- Oh, John, how you been? - She said cordially.\n\n- Well, very good, I just wanted to say hello to Paul, if he's available, I hear several voices Clan McCartney out there! - He smiled\n\n- I'd say they are all here and are enough! But I will look him ...\n\n- Thank you!\n\nLinda left the tube on the couch ... made three steps and she come back  to resume communication.\n\n- John? Are you there? I meant something more ...\n\n- Yes ... yes... What? - He asked intrigued.\n\n- What exactly happened with you and him, on the boat ...?\n\nJohn fell silent a few seconds ... almost disoriented . What the hell was that question?\n\n- I do not understand ... Why do you ask?\n\nLinda gained momentum. - Well, Paul came with a severe hit on his head, the doctor says he have amnesia about some issues that have lived ... and I realized he did not remember anything about Japan ... Do you understand!? ... Nothing at all! ... But I do not even know what happened on the boat ... What happened?\n\nJohn thought and finally said.\n\n- I'm sorry, look, he struck a door, there was a passing storm ... it was just that, I guess he did not tell you not to worry. But ... I want to know what else he has forgotten .... Now…. under the circumstances, I think it's better not remember the prison, was traumatic for him, you know.\n\n- I thought the same, yes - Linda paused - but I do not like that he hide nothing to me, John, I'm strong, I can hear any truth, but, I assure you... I do not tolerate any lie.\n\nJohn noticed a strange tone in his voice ... reproach?\n\n- I'll get  for him - she finally said.\n\nThis was unexpected and revealing to John. Linda suspects? Her voice was straighter than in the past, Or she was just nervous? ... Mmm.\nAlso, Paul does not remember Japan,  therefore suffered no abuse there. Knowing how bad he felt about this ... forget, it was the best thing that could happen to him. Undoubtedly, nature was sometimes wise ...\n\n- Hello Johnny! - Paul said cheerfully\n\n- Happy birthday, old fox!\n\nThey talked bluntly about everything, including their musical projects. Both were with many plans for the future. John paused.\n\n- What are you wearing, baby?\n\nPaul smiled at the question.\n\n - Well ... a pink shirt with two buttons open top and gray pants ... - he said with sensual tone.\n\n- Mmm ... imagine what would do my hand after opening another button ... - whispered John.\n\n- Johnny! ... Do not do this now!\n\n- Ok ... Luv ... But let me think that the next meeting between us, you will wear the same ... Yes?\n\n- I think it's a good idea…\n\n Linda went back to the room heading to the kitchen for more snacks. She saw Paul still on the phone. He spoke smiling while playing with the cable of the device, screwing in his finger ... Linda recalled that the same was Heather when she spoke with her boyfriend ...\n\nWhat would be what John was saying?\n\nIf she wished she could go to the room upstairs, now and pick up the other tube to hear the talk.\nShe looked at the stairs. She could. Should she...?\nMaybe she  will.\n\nJohn kept talking - Sorry, Linda asked me about your hit and I had to tell what happened about the storm on boat, and you did not want to worry ... Is it true you've forgotten ... certain things?\n\n- So it seems I have forgotten experiences, I guess anything important, you know ... but I will not worry, I promise. I have much to think forward, backward left behind.\n\n- I hope that does not include me, luv. -  joked John\n\n- You're always in my future, no doubt - said laughing, Paul.\n\n-------------------------------------------------------------------------------------------------------------------------\n\nAugust, 1980\n\nYang was in his cell, reading for the hundredth time the last letter received by Paul.\nSince he was gone, at least once a month received a letter from the former Beatle, telling his things, projects and asking how he was.\nThe latter was last May, which recounted how he had exalted in front of journalists, hitting one of them, thinking that threatened the life of John. He also said that June would make a trip to Central America, John and him, alone together, he was very happy, and also reminded to call him when finally left prison.\n\nBut Yang had no received letters since.\n\nHow would his things now? ... Would he have said to John about his terrible threat? ... Or perhaps Yang thought sadly, he's just busy with life and there is no time to write ...\n\n- Yang !!!\n\nThe voice echoed through the corridors of the prison. Yang flinched from his bed in the cell. A guard was accompanied by a lawyer, the man greeted him respectfully, carrying a folder meticulously unfolded before him.\n\n- Mr. Yang, I'm the state attorney appointed to inform the latest developments in your case.\n\n- It's ... it's a pleasure ... What's new? - Yang said, something fearful.\n\nThe lawyer sought the precise clause between the roles of the folder and began to read.\n\n... \"And in view of the good behavior shown by the accused ..., who is serving actual conviction, we decided unanimously, that his departure scheduled for late October 1980 , ordering that as of August 15, 1980, is released and recover all his rights as a free citizen ... \"- The man looked at him and smiled slightly - In five days you can go from here, Mr. Yang. You Is a completely free man.\n\nYang was paralyzed with joy. Finally ended his imprisonment, unfair, and could meet with his beloved family again. Some emotion tears\nran down her cheek , and hugged the lawyer, who did not expect this demonstration of joy.\n\n- I'll be free again! - He shouted smiling.\n\nAnd while he feel optimist, he had a thought filled with happiness to his friend Paul.\n\"I will call him!\" ...", "source": "Lennon//McCartney"}