{"published": "2015-09-20T00:33:39Z", "media-type": "News", "title": "MSU has trouble with Falcons’ triple option", "id": "029140c8-6fd2-4505-ab23-fff3a5bd3bc1", "content": "Autoplay \n\nShow Thumbnails \n\nShow Captions \nLast Slide Next Slide \nMichigan State's RJ Williamson tackles Air Force's DeAnthony Arnett during second half action on Saturday, September 19, 2015 at Spartan Stadium in East Lansing Michigan. (Photo: Kirthmon F. Dozier, DFP) \n\nEAST LANSING  --  Were there concerns? Of course. \n\nPromising results? Without seeing the tape, Michigan State coaches felt there were at least some. \n\nHarlon Barnett’s main reason to be happy after Saturday’s 35-21 victory? \n\n“Thank God we’re done with Air Force,” said the Spartans’ first-year co-defensive coordinator. \n\nFourth-ranked MSU began readying to face the Falcons’ deceptive triple option offensive attack during spring practices. Coaches said they continued to sprinkle in a preparation period throughout preseason camp in August. \n\nIt resulted in a bend-but-don’t-break performance Saturday. Air Force’s 279 rushing yards were the most since the Spartans allowed since conceding 313 yards to Nebraska on Nov. 3, 2012. The Falcons averaged 5.5 yards per carry. \n\nSenior safety RJ Williamson said the Spartans “don’t normally see teams like this.” \n\nPart of why the Spartans devoted extra time to Air Force, which is rare for coaches while prepping for other games, is that playing against a triple option goes against much of what coach Mark Dantonio and his staff teach defensively about swarming to the ball. One missed assignment by overpursuing the wrong Falcon could lead to big plays. \n\nAt times, it did. However, MSU players avoided mental fatigue thanks in part to Dantonio rotating players throughout the game. \n\n“I think you look at things and correct things and you learn from it,” Dantonio said. “You put this in the bank and say, ‘This is a way we did this.’ … But it will be a different offense next week, so we’ll go back to what we do a little bit more, but there’s components of it that we’ll use.” \n\nOnce MSU began keying on the run, the Falcons opened up their rarely used passing attack. Backup senior quarterback Karson Roberts was 5 of 8 passing for 150 yards in the second half. \n\nRoberts faked an option run to his left, and hit receiver Jalen Robinette in stride behind the befuddled MSU secondary for a 38-yard touchdown that made it 35-14. \n\nThe Spartans got a pair of fourth-down stops in the red zone, as well as a fumble return touchdown and an interception from Williamson. \n\n“They have a good team,” Air Force coach Troy Calhoun said. \n\nThe Spartans won’t face another triple option team this season, which renders much of the preparation and some of the problems a one-game issue. \n\nDantonio cited missed tackles and improper technique in taking on blocks that will command fixing. \n\n“When it comes for us to play those types of teams and run into other teams who excel in the option, then we know how to stop it, because we’ve been there before and we can make adjustments from there,” Williamson said. “But as far as today? I don’t think we look at it too much.” \n\nRead or Share this story: http://on.freep.com/1KnPSbh", "source": "Detroit Free Press"}