{"published": "2015-09-30T17:10:31Z", "media-type": "News", "title": "Gander Mountain Celebrates Grand Opening in Snellville", "id": "8c5144e3-e3ce-4ab6-9ccb-7b2febc81fcd", "content": "SNELLVILLE, Ga., Sept. 30, 2015 /PRNewswire/ --  Gander Mountain , the nation's largest and fastest-growing outdoor specialty retailer is celebrating its new store in Snellville with a Grand Opening ceremony, including celebrity appearances, family activities and giveaways. \n \n\"We are excited to open our new Gander Mountain location and provide Snellville outdoors enthusiasts with the gear they need,\" said Eldrich Granger, general manager of the Snellville Gander Mountain store. \n \nThe 52,000-square-foot store is located at 1200 Scenic Hwy, Ste G, Lawrenceville, Ga. 30045. The first 1,000 customers through the door each day of the Grand Opening weekend (Thursday, Oct. 1-Sunday, Oct. 4), will receive a free scratch-off card for prizes and gift cards. \n \nEvents and appearances include: \n \nThursday, Oct. 1--Sunday, Oct. 4 \n Live performance by country music star Crystal Hopkins at 9 a.m; meet-and-greet from 11 a.m.-noon (Thurs.)  Gwinnett County Board of Commissioners Chairman Charlotte Nash Official Ribbon Cutting Ceremony at 9:40 a.m.; doors open at 10 a.m. (Thurs.)  Atlanta Falcons' Jake Matthews autograph signing from 6 p.m.-7:30 p.m. (Fri.)  Troy Landry, Star of History's Swamp People , autograph signing from noon – 3 p.m. (Sat./Sun.)  Travis \"T-Bone\" Turner, Host of Michael Waddell's Bone Collector on the Outdoor Channel, autograph signing 3 p.m.-7 p.m. (Fri.) and 10 a.m.-2 p.m. (Sat.)  Elite Bassmaster Angler and Gander Mountain Pro-Staffer Dean Rojas product demos and customer interaction 3 p.m.-7 p.m (Thurs./Fri.)  Former Atlanta Braves player and Hardcore Hunting co-host Ryan Klesko autograph signing 11 a.m.-1 p.m. (Sat.)  \nA full schedule of events and appearances is available at GanderMountain.com . \n \nAbout Gander Mountain Company \n \nGander Mountain Company headquartered in St. Paul, Minn., is the nation's largest and fastest-growing retail network of outdoor specialty stores for hunting, fishing, camping, marine and outdoor lifestyle products and services. Since 1960, Gander Mountain has offered the best selection of outdoor equipment, technical apparel, active casual wear, and footwear featuring national, regional and specialty brands at competitive prices. Focused on a \"We Live Outdoors®\" culture, Gander Mountain dedicates itself to creating outdoor memories.  Gander Mountain has 160 conveniently located outdoor lifestyle stores in 27 states. For the nearest store location call 800-282-5993 or visit www.GanderMountain.com  Gander Mountain is also the parent company of Overton's ( www.overtons.com ), a leading catalog and Internet based retailer of products for boating and other water sports enthusiasts. \n \nCONTACT: Myreete Wolford, 1-312-228-6815, myreete.wolford@ketchum.com \n \nLogo - http://photos.prnewswire.com/prnh/20150925/270740LOGO  \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/gander-mountain-celebrates-grand-opening-in-snellville-300151732.html \n \nSOURCE  Gander Mountain \nhttp://www.prnewswire.com/news-releases/gander-mountain-celebrates-grand-opening-in-snellville-300151732.html", "source": "International Business Times"}