{"published": "2015-09-10T15:10:05Z", "media-type": "News", "title": "Cost Savings and Revenue Growth Opportunities: Flooring Contractors Benefit From New Supplier Partners Joining DSSG", "id": "ed79b8b9-a8df-48c8-8736-9b6bf4948719", "content": "The Decorative Surface Solutions Group (DSSG) is thrilled to announce the first wave of Preferred Suppliers who have signed on to support the network.  The DSSG's mission is to closely connect the industry's best suppliers with the premier contractors across several decorative flooring channels to achieve market leading growth through collective sourcing programs and national marketing services. \n\n\"Right on the heels of our announcement of our first group of Charter Members, we wanted to highlight a great group of suppliers who are supporting DSSG and our members,\" said Curt Thompson, President and CEO of the DSSG. \"We could not be happier with the response the industry has had to the launch of the Decorative Surface Solutions Group. In just 6 months, we have built a very solid foundation of both member and suppler partners and the interest level continues to grow as people now see the strength of group.\" \n   \nThis is a Flooring Category That Will See Tremendous Growth \n\nThe DSSG is focused on the rapidly expanding architectural concrete and decorative flooring solutions that include polished concrete, concrete topping slabs, terrazzo, epoxies, and other hybrid flooring choices. DSSG announced its Charter Members list on July 28, 2015. The initial roster of Supplier Partners represents some of the top companies serving the market in line with DSSG's mission to connect the best-of-the-best from the flooring contractors and supplier community. \n\nNew supplier partners include Aggretex, ARDEX, Blastrac, B.R. Funsten & Co., Ermator, Brickform, Capital Planning Partners,  Diamatic, EPIC Insurance, Fidelity Capital, Hubbell, Jon Don, Procrete Resources, Prosoco, QC Construction Products, Scanmaskin, Schonox, Solomon Colors, SpecChem, Specified Surfaces, and Tom Duffy Company. \n\n\"DSSG has done a great job in bringing in the right suppliers to the organization and we know this is just the first round of companies to be included,\" said Lance Boyer, President of Trademark Concrete in Southern California and one the early Charter Members.   \"This is why we joined DSSG, to develop closer ties to the top suppliers and together, drive more business in the category.\" \n\n\"Our team has done an excellent job of bringing together a very solid foundation of suppliers to work with our growing membership,\" noted Mike Price, one of the Founding Partners of DSSG.  \"We're excited to see the momentum build as we start to roll into the fourth quarter and prepare for our first official member/supplier meeting scheduled for Las Vegas in February.\" \n\nAbout us: \nThe Decorative Surface Solutions Group (DSSG) is dedicated to increasing the sales and profits of its members specializing in hard surface solutions such as polished concrete, concrete topping slabs, epoxies, terrazzo and other alternative flooring options both inside and out.   We connect the best manufacturers, contractors and products to serve markets across North America. DSSG is focused on aggregating the \"best of the best\" in each category in order to accelerate the overall growth of this relatively new industry segment while positively impacting our members and supply partners. Our office is located in Livermore, California and more information can be found at http://www.decorativesurfacesolutions.com . \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12948396.htm \nPRWeb.com", "source": "MoneyShow.com"}