{"published": "2015-09-02T14:01:29Z", "media-type": "News", "title": "Oregon districts hustle to fill vacancies amid teacher shortage", "id": "321d2b1b-7111-48de-ab3c-bacaaa110799", "content": "Sandy High teacher Audrey Stroh guided her students through algebraic equations on the second day of classes Aug. 25. She'd considered a more lucrative career as an actuary, but thought teaching would be more fulfilling.\n\nAt Oregon Trail Academy charter school in Boring, fifth-grade teacher William Krolik introduced his students to scientific inquiry. Krolik, also a first year teacher, said he wants his students glean big ideas and not just facts. First year teachers offer insight about pursuing education careers First year teachers Audrey Stroh and William Krolik talk about why they wanted to become educators. Some Oregon districts are reporting a shortage of candidates to fill teaching vacancies. Krolik and Stroh are both well-qualified, coveted hires, their supervisors say. And other Oregon education officials agree there are not enough teachers like them to go around.\n\nMirroring national trends, Oregon is in the midst of a teacher shortage that's sending districts hustling to fill vacancies, especially in areas such as math, science, special education, art, second language and substitute teaching. In some cases, districts have hired by the hundreds and are still planning for substitutes to cover vacancies as school starts.\n\nSandy High Principal Kim Ball felt lucky to fill her six openings by early summer. Applicant pools can decrease rapidly, often prompting a speedy hiring process, Ball said. Stroh went from first interview to signing a contract in four days.\n\n\"Every day is anxiety,\" Ball said. \"Will I get the perfect fit for my kids and my school? When you know you have somebody good, you will lose them if you don't move fast.\"\n\nState agencies don't have statewide figures on vacancies but numbers from the districts and hiring fairs give an idea of the shortage.\n\nJim Buck, Oregon Professional Educators' Fair coordinator, said the Portland event sold out this year with 221 districts from Oregon and other states in attendance. About half as many candidates participated compared to 2008 but teaching needs increased, he said. In 2013, about 40 attending agencies were hiring math teachers compared to about 155 this year, he said. And the number of districts looking for PE teachers ballooned from six to 51 for those same years.\n\nBuck said districts have moved away from a uniform hiring platform to post job openings, which makes it hard to gather data. One online site showed that almost 200 Oregon teaching jobs have been posted since Aug. 3, which Buck said is unusual to see so late in the summer.\n\nThe shortage isn't just in Oregon. California had more than 21,000 open teaching positions, National Public Radio reported last month. One Nevada district has launched a nationwide campaign offering hiring bonuses.\n\nDistrict start dates Shown is the first day of class for each district. Students in some grades may start later. Aug. 24 Oregon Trail Aug. 27 Portland Aug. 31 Banks\n\nCanby\n\nLake Oswego\n\nOregon City\n\nRiverdale\n\nWest Linn-Wilsonville Sept. 1 Forest Grove Sept. 8 Beaverton\n\nColton\n\nGladstone\n\nGresham-Barlow\n\nHillsboro\n\nMolalla\n\nNorth Clackamas\n\nParkrose\n\nSherwood\n\nTigard-Tualatin Sept. 9 Centennial\n\nReynolds Sept. 10 David Douglas source: Amy Wang/staff The shortage is in part the product of a recovering economy combined with fewer new teacher candidates, according to school human resource representatives and state officials.\n\nOregon schools cut 3,600 teaching jobs, or 12 percent of the teacher workforce, from 2009 to 2012. Now, as state school funding rebounds, schools can hire more teachers to lower class sizes, restore and expand programs and cover Oregon's move to full-day kindergarten. But, teacher preparation programs aren't turning out enough new teachers to keep up with retirements and added positions.\n\nNationwide the number of new teaching candidates dropped 20 percent from 2009 to 2013, according to federal data.\n\nIn Oregon, the number of teaching program graduates has dropped by more than 830 since 2007-2008, according to data from the Teacher Standards and Practices Commission. Oregon Department of Education data shows that about 7 percent of Oregon's 29,420 teachers last school year were new to the profession.\n\nSome of Oregon's largest programs specifically noted major drops. For example, Western Oregon University went from about 197 graduates to approximately 152 over a seven-year span, according to data. And Portland State University teaching programs saw a 15 percent decrease before reporting an upswing last year, according to Graduate School of Education Dean Randy Hitz.\n\nPortland Public Schools listed some tough-to-fill jobs, like for Spanish and math programs, back in November, like for Spanish and math programs, said Sean Murray, the district's human resources chief. As of Monday the district had hired about 330 teachers and brought in 28 subs to fill vacancies. \n\nOther districts are reporting similar situations and a fluid hiring period. Hillsboro School District had hired about 150 teachers and had about 30 vacancies as of Aug. 19. According to data from Monday, Beaverton School District hired nearly 400 teachers and has 23 vacancies and North Clackamas hired nearly 160 educators and whittled the vacancy list down to about four positions.\n\nThe shortage has prompted districts to get creative about recruitment with some encouraging their own students or current staff to consider teaching.\n\nWestern Oregon has joined with a few districts to provide scholarships to bilingual students interested in becoming educators and returning to teach in their home districts, said College of Education Dean Mark Girod. Forty-three freshmen are enrolled in the program this fall.\n\nJohn Beight, executive director of human resources for Salem-Keizer Public Schools, said the district is helping current staff to pursue special education endorsements or licenses. As of Monday Salem-Keizer had about 80 vacancies left for licensed positions after hiring about 590 staff for this school year, Beight said. He hoped to get the list down to 50 by the time school starts Sept. 8.\n\n\"Just because there's a shortage today doesn't mean that in six weeks a bunch of people can go be teachers,\" Beight said. \"It takes time for the system to catch up to the demand.\"\n\nBack in Stroh's math class, sophomore Oliver Jacobson focused on copying down notes projected on the white board. Stroh may not have as much experience as well-seasoned teachers, the student said, but it's helpful to have younger teachers, too. \n\n\"They understand us better,\" he said. \"They know how we think.\" \n\n--Laura Frazier\n\nlfrazier@oregonian.com\n\n503-294-4035\n\n@frazier_laura", "source": "Oregonian"}