{"published": "2015-09-30T21:21:14Z", "media-type": "News", "title": "MMYST: a crowd-funded, human-animal hybrid building by François Roche and Camille Lacadee of New-Territories/M4", "id": "f88eff96-3baf-4720-bf0b-4aad963660f0", "content": "\"What we propose here is a different format for making architecture,\" Camille Lacadee states in a deadpan tone, \"with multiple clients, multiple users, bakers, lovers, following a bottom-up mode of exchanges and desire.\" A robotic arm extends into the frame and offers her a bowl of bird's nest soup, which she takes. \"Oh it's hot!\" \n\nAlongside François Roche, Lacadee heads the ever-mutating, radically-experimental architecture studio currently-known-as New-Territories / M4 . For their new project MMYST, or \"mke_Me_yungR_sheltR_tmptation,\" they've launched a Kickstarter campaign that includes what is likely one of the most wonderfully strange videos that's ever been on the crowd-funding website. \n\n\n\n\nAccording to the campaign description, MMYST would comprise a 140 sqm (1500 ft²) \"experimental hybrid building\" to be shared by humans and swiftlets, a species of bird that makes unique nests out of saliva that are prized for their culinary applications. \n\nSited on an outcropping of cooled-lava in the lush landscape of Thailand, MMYST would be constructed using robots and a \"bio-foam with scrap wood\" that resembles lava. The building would be split about evenly between its avine and hominid clients, the latter in turn determined much like a normal time-share. If you donate to the Kickstarter, you can get a slot reserved. \n\n\n\n\"One of the motives behind this crowdfunding is sharing: concepts and time,\" states Lacadee in the video. \"As architects we now have the opportunity to address a multitude through social networks and social media.” \n\nWhile the video is humorous and eccentric, the project demands serious attention. Actively invoking ecosophy , the ground-breaking field of practice developed by Felix Guattari that links \"environmental ecology to social ecology and to mental ecology,\" MMYST is very ambitious: seeking to activate new and complex potentials for human and non-human cohabitation, in addition to developing novel models for architecture funding, construction, and use. \n\n\n\nThe issues at play in MMYST are all deeply relevant to the ecological and economic context of today, and it's exciting to see a project that attempts to consider them simultaneously. It's an architectural iteration of a rare, but urgent, mode of thinking that endeavors to consider psychology, ecology, economics, and politics within a singular, but heterogeneous, mesh-like fold. \n\nThe Kickstarter page is abundantly populated with explanations of MMYST's form, conceptual framework, program, as well as recipes for bird's nest soup (and information on its health benefits) and the juridical principle of usufruct that backgrounds the project as a whole. It includes an explanation of the (not-too-shabby) human perks – a pool, AC, sauna, polished-concrete floors – as the, drastically different, avine ones – darkened windows, humidifiers.  Admittedly, and in typical-Roche fashion, the writing can be a bit difficult to parse: wavering somewhere between poorly-translated French and the theoretical language of late-20th century French philosophers. \n\nSo far, the Kickstarter has only had 10 backers, generating $1,675 towards their $200,000 goal. But there's still 25 days left to donate!  \n\nClick  here  to find out more or back the project. Or, head to  Next Up at the Chicago Biennial of Architecture  this Saturday, where  Archinect  will be interviewing François Roche and Camille Lacadee live!", "source": "Archinect"}