{"published": "2015-09-17T16:17:06Z", "media-type": "Blog", "title": "Derby announce ex-European Golden Boot winner as assistant coach", "id": "1feca1fe-08b1-405f-b18f-b11e1f53da70", "content": "Derby County have announced ex-European Golden Boot winner and former Leicester City coach Kevin Phillips as their new assistant coach, the club’s official website has confirmed .  \nThe 42-year-old made 660 professional appearances during his playing career, scoring 282 goals and assisting a further 31. Phillips also made eight appearances for England but failed to find the net. \n \nAfter finishing his career helping Leicester City secure promotion to the Premier League, Phillips became a first-team coach at Leicester and helped the club to keep their status in the league last season. \n \nThe ex-forward becomes Clement’s third coaching staff appointment since taking over as Derby boss in the summer. John Peacock joined the club at the start of pre-season training and Pascal Zuberbuhler arrived as goalkeeping coach. \n \nSpeaking about the appointment with Derby’s official club website , manager Paul Clement discussed the move by saying “I’m delighted that Kevin Phillips is joining my coaching staff; he will complement the excellent individuals and skills that we have on the coaching team already. \n \n“Kevin enjoyed an illustrious playing career. He was successful at a number of clubs, experienced being promoted to the Premier League on several occasions and his goalscoring record certainly demonstrates what an excellent striker he was. \n \n“He is now embracing a new pathway in his career and has successfully made the transition from player to coach in the last year at Leicester City. \n \n“I believe Kevin has a lot to offer with his skills and expertise and I would like to thank Leicester City for their co-operation in allowing Kevin to join us.” \n \nPhillips will assist his team in training and will take his place on the Derby bench for their game against Burnley on Monday evening. \n \nThe post Derby announce ex-European Golden Boot winner as assistant coach appeared first on The72 .", "source": "The72"}