{"published": "2015-09-02T03:43:00Z", "media-type": "News", "title": "How Carly Fiorina earned a spot on the big stage at the GOP debate", "id": "172960c6-cb26-4cd1-99a8-d7cb92f8dec8", "content": "The organizers of the next Republican presidential debate have announced changes to debate criteria that mean former Hewlett-Packard CEO Carly Fiorina will almost certainly join the rest of the top-tier candidates on the main stage at the Reagan Library on Sept. 16. \n\n\"CNN re-evaluated its criteria and decided to add a provision that better reflects the state of the race since the first Republican presidential debate in August,\" the network announced. \"Now, any candidate who ranks in the top 10 in polling between August 6 and September 10 will be included.\" \n \nThe CNN move is being greeted as a positive development, and not only for the most obvious reason, which is that a woman will be in the mix, in contrast to the 10-man tableau that a huge national television audience saw at the first debate on Aug. 6 in Cleveland. \n\nFiorina also had fairness on her side, say supporters. The original rules would have made the cut according to an average of polls conducted between July 16 and Sept. 10. That arithmetic minimized the significant rise in Fiorina's numbers since she gave what was widely reviewed as the single best performance of the evening in Cleveland, despite being relegated to the earlier, non-prime-time \"undercard\" debate of longshot contenders. \n  \nNow, Fiorina's presence on the main stage — which, under the new formula, may end up including more than 10 candidates — is likely to make that faceoff a far more interesting debate. \n\n\"We are very pleased that CNN changed its mind. We've been hearing from people across the country,\" said John Heubusch, executive director of the Ronald Reagan Presidential Foundation. \"They want to see the best debate possible.\" \n\nIn the enormous Republican field, she is the only one who has demonstrated anything that rivals the thrust-and-parry skills of front-runner Donald Trump — another political outsider who comes from the business world. Trump dominated the main stage in Cleveland, in part because none of his rivals had any idea how to take him on. \n \nThus far, she has demonstrated more finely honed reflexes for the punch and the counter-punch than any of the other Republican candidates, with the exception of Trump. \n\nShe first got the attention of many GOP activists with her sharp, memorable attack lines against the Democratic frontrunner, former secretary of state Hillary Rodham Clinton. Among them: \"Like Hillary Clinton, I too have traveled hundreds of thousands of miles around the globe. But unlike her, I've actually accomplished something. You see, Mrs. Clinton, flying is not an accomplishment; it is an activity.\" \n\nIn Cleveland, she may have gotten off the best jab at Trump, even though she wasn't on the stage with him. Referring to a Washington Post report that former president Bill Clinton had called Trump while the New York real estate mogul was considering whether to run, Fiorina said: \"I didn't get a phone call from Bill Clinton before I jumped in the race. Did any of you get a phone call from Bill Clinton? I didn't. Maybe it's because I hadn't given money to the foundation or donated to his wife's Senate campaign.\" \n\nThe other candidates seem to recognize that someone has to take on Trump. That role would seem to be a natural one, for instance, for combative New Jersey Gov. Chris Christie. \n\nIn an appearance Monday on NBC's \"The Tonight Show Starring Jimmy Fallon,\" Christie acknowledged that he hadn't lived up to his reputation in the first debate. \n\n\"I didn't feel it was appropriate for that night,\" Christie said. But he added: \"Stay tuned — we may be changing tactics.\" The governor then joked that viewers should be ready for him to \"go nuclear now.\" \n\nOn the trail, former Florida governor Jeb Bush has also gotten more aggressive against Trump lately. \n\n\"He personalizes everything,\" Bush said Tuesday. \"If you're not totally in agreement with him, you're an idiot, you're stupid, you have no energy, blah, blah, blah. That's what he does.\" \n\nBut that is a defensive argument, which drew the equivalent of a shrug by Trump on Twitter: \"Yet another weak hit by a candidate with a failing campaign.\" \n\nFiorina's past performance — to borrow a phrase from the finance world — is no guarantee of future results. And even her skills may be no match alongside Trump. \n\nShould they get into a tussle at the debate, she can expect Trump to bring up the facts — as he has before — that she was fired from her post at Hewlett-Packard, and that in her only previous run for elective office, Fiorina was trounced by Sen. Barbara Boxer, D-Calif. \n\nTrump has also tweeted that listening to Carly Fiorina for more than a few minutes brings on \"a massive headache. She has zero chance!\" \n\nThe debate will be Fiorina's best opportunity yet to show whether Trump is wrong. \n Copyright © 2015, The Baltimore Sun", "source": "Howard County Times"}