{"published": "2015-09-24T19:46:55Z", "media-type": "News", "title": "Roux Provincetown Bids Au Revoir to First Star-Studded Summer, Gears Up for Fall Women's Week Events", "id": "83768dbe-ae02-45cb-88a0-0988b2e500c2", "content": "(September 24, 2015) PROVINCETOWN, Mass., Sept. 24, 2015 (GLOBE NEWSWIRE) -- Roux Provincetown, a lovingly restored Victorian bed and breakfast located in Provincetown's East End Gallery District and a 2015 Best of Boston recipient, today announced that in celebration of Women's Week (October 12th – 18th) it will sponsor a daily pick-up basketball game during the week-long event. Each afternoon, Roux's owners Ilene Mitnick and Alli Baldwin will lace up their Chuck Taylors, hit the newly-renovated basketball court across the street (Bradford Street) and host informal games. But it's more than just about the game. Women's Week creates a platform for thousands of women to connect. \"We want to give them a reason to head East and introduce the amazing galleries, restaurants and shops in the less traveled East End neighborhood,\" Baldwin said. This is just one of the game changers that the two latest members of the exclusive Women Innkeepers of Provincetown are bringing to their new bed and breakfast that recently celebrated its one-year anniversary and its first season with the organization. \"Ilene and Alli are our newest members, and they have offered us tremendous energy, new ideas and a delightful flair for innkeeping and for life,\" said Lynn Mogell of the Women Innkeepers of Provincetown.\n\nIt's that delightful flair that has left top celebrities and artists including Jennifer Holiday, Jennifer Coolidge, Cherry Jones and Sandra Bernhard fans of Roux and its vision.\n\n\"Roux is classy. It's beautiful. It's a getaway. They make a breakfast that will blow your mind,\" Bernhard said. \"Alli and Ilene have really separated themselves from everybody else,\" she added. According to guest reviews, nothing at Roux is ever normal or predictable, and that was exactly the vibe that Baldwin and Mitnick were seeking as they worked to create a highly curated, customized experience for their guests.\n\nThe Inn's name derives from the classic French base of flour and butter - everything starts with a roux. However, for Baldwin and Mitnick- who have a love of all things French and a focus on culinary experiences- Roux became the perfect metaphor for the experience they hoped their guests would find. \"Roux provides a blank canvas where guests create their own experience during vacation, but hopefully in life, too,\" Baldwin said. \"Things start when you're on vacation,\" she added.\n\nWith nearly 6,000 women coming to town for the week-long legacy that is Women's Week, Baldwin and Mitnick expect a full and vibrant house and look forward to discovering new and creative ways to make this 31-year old event even more spectacular.\n\n\"We wanted to host something new for Women's Week. The excitement and grit of a pick-up basketball game just adds to the street cred already resident in our beautiful East End neighborhood,\" said Mitnick.\n\nAbout Roux Provincetown:\n\nRoux Provincetown is a unique bed and breakfast in the heart of Provincetown, Massachusetts whose owners share a love of art, music, and cuisine. After a 4-month and 11-day renovation, the inn – a beautiful Victorian house- opened its doors July 11, 2014. Roux was awarded Boston Magazine's Best of Boston title for 2015 Best Inn on Cape Cod, and is consistently ranked among the top five Provincetown B &Bs on Trip Advisor. Innkeepers, Allison Baldwin and Ilene Mitnick, strive to create an enchanting environment where guests can experience \"The Art of Staying.\"\n\nFor more information and to book a stay at Roux Provincetown, please visit: www.rouxprovincetown.com.\n\nPhotos accompanying this release are available at:\n\nhttp://www.globenewswire.com/newsroom/prs/?pkgid=36396http://www.globenewswire.com/newsroom/prs/?pkgid=36397\n\nCONTACT: Amanda Santucci\n\namanda@goodwinpr.com\n\n508-404-1745 (w)\n\n508-498-6671 (c)\n\nFB.init(\"4112331804fd1df554354de5f28d86f9\", \"/xd_receiver.htm\");", "source": "Review Seeker"}