{"published": "2015-09-04T01:22:47Z", "media-type": "News", "title": "Photos of dead 3-year-old refugee boy become symbol of the misery of the migration crisis", "id": "14904a84-83d5-4a0e-bfb4-19a3664a728f", "content": "BODRUM PENINSULA, TURKEY – They come by land, walking across continents. They come by water, sailing over the Mediterranean sea. \n \nThey are the lucky ones, the ones who make it to Europe alive. \n \nPhotos of the body of a 3-year-old Syrian boy who washed ashore in Turkey have become the haunting symbol of the dangers, and of the miseries, endured by the hundreds of thousands of refugees and migrants from North Africa and the Middle East. \n \nReports say the boy and his 5-year-old brother were among 12 refugees who died while trying to reach Greece. \n \nOther reports say Canadian authorities told the boy’s family in June that they could not enter the country. \n \nThe International Organization for Migration estimates that more than 2,600 refugees and migrants have died this year trying to cross the Mediterranean sea to get to Greece and Italy. \n \nThousands of weary refugees and migrants keep hoping to get on trains and buses out of Budapest, Hungary. But government officials and red tape won’t let them move on to other European Union countries like Germany, which expects to take in about 800,000 before the end of the year. \n \n\"The moral, human thing is to make clear: don't come,” said Hungarian prime minister Viktor Orban. “Why you have to go from Turkey to Europe? Turkey is a safe country. Stay there. It's risky to come.\" \n \nThe human cost of the migrant crisis can also be seen in a lost generation of children. \n \nA new UNICEF report says wars in the Middle East and North Africa have kept 13 million children from going to school, that’s about 40 percent of the school-age population. \n \nA price a generation is paying today, and that the world will pay for generations to come.", "source": "CW39 NewsFix"}