{"published": "2015-09-08T21:37:09Z", "media-type": "News", "title": "Finally, a standing desk for kids that will help break bad habits early", "id": "20f4cb12-6777-4de5-831e-bf3aa552fb2e", "content": "share \n \n  share  \n \n  tweet  \n \n  pin  \n \n  email  \n \nResearch has shown that sitting too much is bad for you in a variety of ways. But it's a tough habit to break, and it's one we learned at a very young age. Even in preschool we were taught to sit at our desks, not stand at them. \n \nBut it doesn't have to be the same for kids today. That's what Jaswig , an ergonomic furniture manufacturer, believes. The startup, which has offices in both Belgium and the U.S, has created the StandUp, a height-adjustable standing desk. Adults can use it too, but it was created with kids in mind. \n  Jaswig   \n\"The idea behind making a version for children is that if standing regularly has many benefits, we should allow children to stand up as well if they want,\" Jaswig co-founder Mathias Ellegiers told TODAY.com. \n \n RELATED: Don't let sitting all day kill you — 5 easy ways to keep moving at your desk  \n \nJaswig launched a Kickstarter campaign for the desk last month. So far they've raked in more than $60,000 — surpassing their goal of $54,735. Not only is the desk attractive to parents looking to instill healthy habits in their kids, it's also appealing to families who share a workspace. \n \n\"Parents particularly like the desk because it fits the whole family,\" said Ellegiers. \"Both mother and son can use the same desk.\" It's also pretty simple to put together. \n  Courtesy of Jaswig    Courtesy of Jaswig   \n\"All the pieces are designed for easy (dis)assembly so each part can be taken out and replaced if it's damaged,\" said Ellegiers. There are nine pieces to the desk that are connected with screws and dowel nuts, which are shipped in the package. And you don't need any tools to put it together: The screws tighten with the aid of an included Allen wrench. \"There will also be online videos where one of us actually puts the desk together,\" he said. \n \n RELATED: Study reveals that women who sit too much have increased risk of cancer  \n \nAlthough the Kickstarter ends Sept. 17, the desk, which is made of sustainably sourced wood, is available for pre-order . You can get the small version for $255, the medium for $320 or the tall one for $400. \n  Courtesy of Jaswig  \nThe StandUp desk comes in three different sizes. \n   \nshare \n \n  share  \n \n  tweet  \n \n  pin  \n \n  email", "source": "NBCNews.com"}