{"published": "2015-09-18T17:28:24Z", "media-type": "News", "title": "Fahrbring fights fever to lead in Italy", "id": "2a7551be-75d9-4c80-8354-841fb6ba066e", "content": "Jens Fahrbring overcame illness to fire a stunning 64 and take a share of the lead after the second round of the 72° OPEN D'ITALIA presented by DAMIANI. \n \nThe Swede won the D+D REAL Czech Challenge in May on the Challenge Tour but has missed the cut in all four of his European Tour events so far this year. \n \nHe looked very much like he belonged on Friday, though, as he picked up shots on the 11th and 12th before giving one back on the 13th but further gains on the 14th, 16th and 17th saw him turn in 32. More birdies followed on the first, second and sixth, and a four on the ninth moved him into a share of the lead with Lucas Bjerregaard. \n \nThe duo are 13 under par, two shots clear of Pedro Oriol, Romain Wattel, Fabrizio Zanotti and overnight leader Nicolas Colsaerts, but Fahrbring admits he has been battling a cold as well as the course. \n \n\"I am quite surprised where I am because I was not well at the start of this week,\" he said. \"I picked up a cold and a fever last week in Kazakhstan on the Challenge Tour so yesterday was a struggle and I didn't expect to play so well. Today was a little better in terms of how I felt, and perhaps being unwell helped calm me down and lowered my expectations. \n \n\"It was great to be out there with Lucas as he was playing well and we have played a lot of golf together over the years so I think we helped each other along. \n \n\"Winning this year on the Challenge Tour has taught me a lot about my game. The more you can do that and put yourself under pressure then the better player you will become. Hopefully that helps into this weekend but this is the first time I have been this high at a European Tour event.\" \n \nBig-hitting Bjerregaard, who is 118th in the Race to Dubai, made two birdies on his opening nine but an eagle on the first proved the catalyst as he picked up shots on the third, fourth and eighth to sign for a 65. \n \n\"It was great to be able to follow up yesterday's score with another good one today – I can take a lot of confidence from that,\" he said. \"I didn't play as well as I did yesterday, especially off the tee but I made some good par saves. \n \n\"I am looking forward to the weekend – hopefully I can keep it going and draw on the experiences I have built up to get into contention. It's been a tough summer for me so it's nice to be in this position again.\" \n \nOriol also went round in 65 as a blistering back nine of 29 catapulted him up the leaderboard. The 29 year old was level at the turn but five birdies and an eagle on the way in took him to 11 under alongside Wattel who followed up an opening 67 with a 66. \n \nColsaerts looked like he was going to slip away from the pack as he bogeyed the third and fifth holes and was level par for his round as he stood on the 16th tee. But back-to-back birdies got him to 11 under. \n \nZanotti also birdied the 16th and 17th on his way to a 67 with the Paraguayan yet to drop a shot this week. \n \nMartin Kaymer and Bernd Wiesberger are well placed for the weekend in the group at 10 under alongside Rikard Karlberg, David Lipsky and Andrea Perrino, who is the leading challenger from the home contingent. \n \nDanny Willett, who is currently second in the Race to Dubai, birdied four of his last five holes to get to nine under, the same score as playing partner Miguel Angel Jiménez and Peter Lawrie. \n \nThere was disappointment for home favourite Matteo Manassero who finished one shot adrift of the cut line on three under while Italian golfing great Costantino Rocca, playing in his final European Tour event, shot a level par 72. \n \nHe finished the tournament eight over after an 80 on Thursday but that did not dampen the spirits in emotional scenes on the 18th green as he bade farewell to his home crowd.", "source": "PGA European Tour"}