{"published": "2015-09-25T20:58:23Z", "media-type": "News", "title": "Tracer Products Promotes Gary Testa to National & OEM Sales Manager", "id": "cc109cde-cd12-4b20-b001-67f147f270cf", "content": ") - Tracer Products has announced the promotion of Gary Testa to the position of National & OEM Sales Manager. \n\nGary joined Tracer Products 14 years ago as a Sales and Marketing Assistant. For the past 13 years, he has held the position of Sales Operations Manager. \n   \nBefore joining the company, Gary was the owner and operator of an auto parts store and installation center for 12 years. He also holds an FAA Airframe and Powerplant license from the College of Aeronautics. \n\nIn his new role, Gary will have overall responsibility for managing and growing sales to the automotive, heavy duty, and OEM channels throughout North America. He will not only be responsible for existing accounts but will also develop new, large sales opportunities. \n\n\"I look forward to supporting and growing Tracer Products prestigious list of OEM Approvals with many of the industry leaders,\" states Gary. \n\nHeadquartered in Westbury, New York, Tracer Products has been at the forefront of leak detection technology for over 60 years. Tracerline ® fluorescent dyes are so effective they have been successfully installed in more than 205 million vehicles to date, and are OEM approved by Acura, Audi, BMW, Honda, Ford, GM and Volkswagen, amongst others. In addition to fluorescent dyes, the company offers a full line of rugged, top-quality, award-winning leak detection lamps, diagnostic tools and dye injection systems used in automobiles and heavy duty vehicles. Tracer Products is dedicated to upholding high standards in design manufacturing, ensuring customer satisfaction and in continuing to lead the world in leak detection solutions. For additional information, call toll-free 1-800-641-1133. Outside the U.S. and Canada, call 516-333-1254. Website at www.tracerline.com . \n\nImage Available: http://www.marketwire.com/library/MwGo/2015/9/21/11G054675/Images/Gary_Testa_head_shot-911995872703.jpg \n\nAttachment Available: http://www.marketwire.com/library/MwGo/2015/9/21/11G054675/2014_Tracer_Heavy_Duty_Brochure-24370979206.pdf  \nAttachment Available: http://www.marketwire.com/library/MwGo/2015/9/21/11G054675/2015_Tracerline_Auto_Brochure-4597889226", "source": "BioSpace"}