{"published": "2015-09-23T08:33:34Z", "media-type": "News", "title": "Ballymoney Cycling Club is getting ready for the winter season ahead", "id": "58d69d93-2a61-4864-bc35-8491f100a2df", "content": "​Ballymoney Cycling Club Biesty’s Centra Race, Youth and Triathlon teams are now at the end of the road competition phase and are now getting ready to take part in Off Road events like mountain biking, cyclo cross and duathlons. \n\r\n\t\t\r \n​Ballymoney Cycling Club Tri team’s Nadine McCandless was the first Woman runner home at the Bushmills Distillery 10 k run for Chest Heart and Stroke Charity. \n\r  the 4 BCC youth racers at the finish in Ballygalley \r \r \nNadine has been working hard this year and as well as a full time mum, she manages to swim, cycle and run with a great selection of results acumulating to her credit. \n\r\n\t\t\t\r \nIn the Boom 10K run in Coleraine on ​19th Sept, European Duathlon Champion was third and hard man Eddie Hampton completed the Belfast Half Marathon. \n\r\n\r\n\r\n\r \nIn the Mourne Triathlon David and Claire McAvoy were in family action and a recent report just received tells about Swim coach and BCC stalwart Richard Timms completing the London Prudential 100 mile challenge. This was on roads that in the past have seen world Champion and Tour de France winner Bradley Wiggins blast his way to meteoric rise over the past couple of years. Richard has been using the bike to lose weight and has been an inspiration to so many. \n\nSo many people have asked about Richard’s achievements that a feature will be covered in the coming weeks. \n\r  Arlene completes the 50 mile and Reece 9yrs does the 20 miler \r \r \nThe Lindsay Torr Head Challenge \n\nThe Lindsay Torr Head Challenge is run over 50 and 75 miles on some of the toughest roads in Ireland. It takes in Torr Head and the scenic and beautiful Glens of Antrim and the Lindsay Challenge and Charity Sportive for the Northern Ireland Hospice is organised by Madigan Cycling Club. \n\r\n\t\t\t\r \n​Ballymoney Cycling Club’s team of experience and youth saw Uel Cunningham and a bunch to top class youth riders who showed a pair of clean heels as they scampered up the hills and dived down the neck break descents around the sea line. \n\nUlster and Irish racers, Robbie Doherty, Kevin McCambridge, Finn Sands Robinson led the way. In the 50 mile event just getting started into cycling was Arlene Doherty, Arlene completed the 50 mile event and in the 20 miler 9 year old Reece Doherty was in the heart of the action. \n\nCOMING EVENTS \n\nThe Saturday and weekened runs will be starting soon, watch the press for details as well as a very exciting announcement about a special guest coming to visit Ballymoney Cycling Club in the next few weeks \n\r\n\t\t\t\r \nSPORTS EXTRA - BALLYMONEY DARTS LEAGUE \n\nBlackwater arrows win the Johnny and Sue Cup \n\nThe Johnny and Sue cup was played on Friday night with a good turnout from all teams. There was one preliminary game in which Joey’s Bar defeated North Irish Horse. \n\nIn the first round there were victories for Joey’s Bar over Three Oaks, Rough Diamonds over Blackwater Bar, Diamond Bar over Joey’s 2 and Blackwater Arrows over Joey’s 3. \n\nIn the semi finals Joey’s bar defeated Rough Diamonds and Blackwater Arrows beat Diamond Bar. That left the final between Joey’s Bar and Blackwater Arrows and after some very good darts Blackwater Arrows emerged victorious, congratulations to them and thanks to all who took part. This Friday 25th it is back to league action and the fixtures are as follows: North Irish Horse v Diamond bar, Blackwater bar v Three Oaks, Joey’s Bar v Blackwater Arrows, Rough Diamonds v Joey’s 3.", "source": "Ballymoney Times"}