{"published": "2015-09-20T06:54:45Z", "media-type": "News", "title": "How one US state went from two quakes a year to 585", "id": "80242441-59ba-44a4-844b-b92755318585", "content": "by Juliana Keeping \nCrescent (United States) (AFP) | 20 September 2015 5:43 \n\nLocated in the middle of the country, far from any major fault lines, Oklahoma experienced 585 earthquakes of a magnitude of 3.0 or greater in 2014. That’s more than three times as many as the 180 which hit California last year. \n \n“It’s completely unprecedented,” said George Choy, a seismologist at the US Geological Survey. \n \nAs of last month, Oklahoma has already experienced more than 600 quakes strong enough to rattle windows and rock cars. The biggest was a 4.5-magnitude quake that hit the small town of Crescent. \n \nSandra Voskuhl, 76, grew up in the rural oil boomtown and said she has never felt the earth shake like it did on July 27. \n \nFirst came a thunderous boom. Then the red earth shook hard, Voskuhl said. \n \n“You heard it coming,” she said. “Everything shook.” \n \nShe recalled screaming as framed pictures toppled over in her home. \n \nThen, when things got quiet, she drove over to the town’s Frontier Historical Museum to help clean up antique dishes that had crashed to the ground and shattered. \n \n“We need the oil for our workers and our economy,” she said. “But these earthquakes are a little scary.” \n \n– Could a ‘Big One’ hit? – \n   File picture shows anti-fracking demonstrators in New York as world leaders gathered for a UN General Assembly | © /AFP/File | Bryan Thomas   \nHydraulic fracturing, or fracking, is the process of shooting water mixed with sand and chemicals deep into the earth to crack rock formations and bring up oil and natural gas trapped inside. \n \nThe process has unlocked massive amounts of oil and gas in Oklahoma and other states over the past decade. \n \nBut along with the oil and gas comes plenty of that brackish water, which is disposed of by injecting it into separate wells that are dug as deep as a mile (less than two kilometers) below ground. \n \nThe unnatural addition of the water can change pressure along fault lines, causing slips that make the earth shake, said Choy of the US Geological Survey. \n \nThere is debate among scientists over how large of a fault could be reawakened, and how hard that fault might shake. \n \nOne camp believes Oklahoma won’t see bigger than a 4.0 to 5.0-magnitude earthquake, which would be enough to break windows and knock things off shelves. \n \nOthers believe a 7.0-magnitude earthquake could come about, which would be strong enough to topple buildings. \n \n“What’s at risk is that when you put water into the ground, it’s never going to come back out. You’re putting it in places it has never been before,” Choy told AFP. \n \n“The bigger the volume, the greater the area will be affected. And we don’t know what the long-term effect will be.” \n \n– 4,500 injection wells – \n \nThe pace at which earthquake activity has increased has rattled many in Oklahoma, who are also worried about groundwater contamination brought on by fracking. \n \nFrom 1975 to 2008, the state experienced anywhere from zero to three earthquakes a year which registered at 3.0 or higher. \n \nThen the numbers jumped: there were 20 in 2009, 35 in 2010, 64 in 2011, 35 in 2012, 109 in 2013 and 585 in 2014. \n \n“We are the only state where once this problem came up, we just kept going (with fracking),” said Johnson Bridgwater, the executive director of the Oklahoma chapter of the Sierra Club, a prominent environmental group. \n \n“We want public safety to come first, rather than treating this state as a giant lab.” \n \nThe danger is particularly acute given that Oklahoma has such an enormous oil and gas industry, and its pipelines, refineries and storage facilities were not built to withstand constant quakes, Bridgwater said. \n \nOklahoma has about 4,500 disposal wells, with about 3,200 operating on any given day. \n \nState Governor Mary Fallin, a pro-business Republican, was slow to accept the link between fracking and earthquakes. \n \nShe took action earlier this year after the science became clear, spokesman Alex Weintz said. \n \nIt appears that an area known as the Arbuckle rock formation is most vulnerable because of its “unique geological features,” he noted. \n \nState regulators are now scrutinizing the operations of disposal wells in that area to ensure they don’t go too deep or inject too much water. \n \nSome operators have been told to cut the amount of water they inject into their wells and the state has also stepped up its monitoring. \n \nThree wells were shut down on Friday after two quakes – a 3.5 and a 4.1 – struck near Cushing, which has one of the largest crude oil storage facilities in the world. \n \n“We are hopeful that the actions taken by the Corporation Commission will have a significant impact on seismicity, but the process is ongoing and we’ll continue to evaluate the results that we’re getting now and potential future actions,” Weintz told AFP. \n \nThe Sierra Club insists that much more needs to be done and has called for a moratorium on wastewater injection wells in the 21 Oklahoma counties identified to be most at risk. \n \n© 2015 AFP", "source": "Middelburg Observer"}