{"published": "2015-09-17T00:40:00Z", "media-type": "News", "title": "This Month, Dr. Adam Tan Encourages Barrie, ON Residents to Take Advantage of a Minimally Invasive Receding Gums Treatment Option", "id": "b2be327c-c6fc-4e6c-9705-53366bfab11c", "content": "To honor Self-Improvement Month this September, Dr. Adam Tan, with Georgian Dental, is offering patients with receding gums in Barrie, ON, the opportunity to improve their oral health, by undergoing the Chao Pinhole® Surgical Technique. This procedure allows the doctor to treat the damaging effects of periodontal disease with less invasive techniques.\n\nBarrie, ON (PRWEB) September 16, 2015 \n\nDr. Adam Tan, a dentist with a special interest in periodontics, is honoring Self-Improvement Month this September by encouraging patients with receding gums in Barrie, ON, to undergo the Chao Pinhole ® Surgical Technique (PST). This type of procedure becomes necessary when periodontal disease progresses to such a degree, where the gums have receded to a detrimental point, or no longer cover the gums sufficiently. If the condition is ignored, the risk increases for loosened or lost teeth.\n\nPeriodontal disease is a serious condition that affects millions of Canadians every year. If the teeth are not properly cared for with daily brushing and flossing, bacteria can infect the gums, consistently leaving open wounds that worsen over time. As the disease progresses, recession can occur and immediate action may be necessary to prevent the condition from worsening. Receding gums may cause many patients in Barrie, ON, to experience increased pain and sensitivity, without prompt treatment.\n\nPST can help treat the effects of gum disease by bringing the gums back to their original position, covering the roots of the teeth. This is traditionally remedied by utilizing extremely invasive and uncomfortable measures, such as gum grafting and surgery. In these procedures, tissue is extracted from the roof of the mouth to graft onto the gums, covering any visible root. This involves an extensive healing period and may be prove to be incredibly painful. Conversely, PST requires no cutting or sutures, and is completed in as little as an hour, depending on the number of teeth that require treatment. During the procedure, Dr. Tan simply uses small, specialized tools, to manipulate the gums accordingly into their proper position.\n\nBernie, ON, patients who would like to take advantage of Self-Improvement Month, by visiting Dr. Tan for treatment of their receding gums, can visit his website for additional information about the technique. Those with periodontal disease are especially encouraged to call and initiate the route to better oral health today.\n\nAbout the Doctor\n\nGeorgian Dental is a general practice providing personalized dental care for patients in Barrie and Orillia, ON. Dr. Adam Tan received his Doctorate of Dental Medicine from the Boston University Goldman School of Dental Medicine. Dr. Tan is among the first group of periodontists and dentists in the country to undergo the training required to perform the Chao Pinhole Surgical Technique, a new minimally invasive alternative to traditional gum grafting surgery. Dr. Tan is the best-selling co-author of Healthy Input: America’s Leading Dentists Reveal the Secret Truths to a Healthy Body, Starting with What You Put in Your Mouth, which features advice and practices from leading dental experts. To learn more about the dental services available at Georgian Dental, please visit http://www.barriedentist.ca or http://www.OrilliaDentist.com for the Orillia location, or call (705) 739-6725 to reach the Barrie office and (705) 325-1765 to reach the Orillia office.\n\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb12966434.htm", "source": "ABC6.com"}