{"published": "2015-09-23T08:23:13Z", "media-type": "Blog", "title": "Girls Vs Boys Reaction to a Breakup.", "id": "4a58fe6d-57ca-4191-bfa7-e1dbf7db65c8", "content": "“That’s it! it’s not working anymore! We should break-up now”. She said and then sipped the remaining mocha-chino from her cup. He was searching for an answer. They have been through this conversation almost a dozen times. Now he was really tired of this relationship. It’s been 2 years. He had tried a lot to make it work. He has sacrificed a lot. He has crossed all his limits. And he loved her more than anything. A boy loves with all his heart. A girl loves with her brain. A boy will love the girl without knowing her, her family, her tastes, her likes, her dislikes and then try to fit into her image of a good boyfriend/husband. A girl also starts to love without knowing anything, but then rest of the relationship she tries to modify or reshape the boys interest, his style, his likes, his dislike, his passions and even his way of thinking. For a boy it’s, “if you are with me I’ll do anything for you”. But for a girl it’s “if you do this, this and this, for me than I will ‘think’ about you”. A boy will convince his family, his friends and relatives for her. But a girl will not do the same and instead say, how can I. A girl needs a secure future, a stable monthly income, a good house, a good car, a high-profile school for her children. And that too when she is 23 and the boy is 24. She won’t allow the boy some time to earn and settle down. She wants it now and once for all. “Ok”, he said and went up to the billing corner, paid off the bill and left her sitting alone. She knew he will call him after an hour and apologize and say “baby, give me some time, I know it’s my fault, I am looking for a better job and will soon be earning good. And I have talked with my dad we will soon be selling off the land in village and build a home in town, and baby I know you are doing this for us. You just stay with me I’ll do whatever you say.” …………… And the chutzpa (foolishness) continues until she eventually will stop receiving his calls and settle down with a wealthy, good guy. ©fidoic", "source": "Some Serious Stuff!"}