{"published": "2015-09-15T16:41:51Z", "media-type": "Blog", "title": "Pop! - Volume 1", "id": "671365c5-01c0-4beb-b88a-81cc50ebb6a8", "content": "a collection of erotic M/F paddling stories by Katie Bradford\nPublished: Aug 4, 2015\nWords: 24,855\nCategory: general\nOrientation: M/F\nClick HERE for further details and purchase options. OPENING EXTRACT Attitude Adjustment Emma stared hard at the door. So far she had seen three people go in but no-one had yet come back out. That meant one of two things. Either there was another way out once you got on the other side, or no one left alive! She prayed it was the former. She'd been waiting for quite a while. Not that she was really in a great hurry to get back there but she did want to get the whole stupid thing over with. Practically every nail on her right hand was chewed down to the quick from nerves. She was the only one left in the waiting room. Everyone else had been called. She wondered what would happen if she just got up and walked right out of the door and went home. But she didn't. She knew she'd be caught and her punishment would just be worse. So, she sat and waited. Finally, the older woman behind the desk looked straight at her and said, \"They're almost ready for you. Please go in and strip from the waist down. They'll be with you in a moment.\" She wondered who 'they' were but was afraid to ask. She thought she was seeing one man but apparently she was seeing several. Slowly, standing on shaky legs, Emma walked towards the door. Each step she took seemed to grow heavier and heavier until finally she reached her destination. Turning the knob with a sweaty palm, she opened the door. At first glance upon stepping into the room, Emma didn't see that it looked much different from how a doctor's office might look. There was an examination table in the middle, a sink on the side and plenty of cabinets. But on a closer inspection of her surroundings, Emma discovered a few rather alarming corporal punishment items she'd never seen before pushed into one of the corners. And one wall was totally lined with paddles of different shapes and sizes. Emma shivered apprehensively. Reluctantly, she closed the door behind her and began following the directions she had been given. Before long her new linen skirt and black panties were both draped across one of the many chairs occupying the room. She wasn't sure whether or not she was supposed to be sitting or standing. The lady hadn't said anything about that. So she simply stood leaning against the examination table and stared once more at the stupid door. It seemed like she had been standing for an eternity before she heard a loud knock on the door. She hadn't even said, \"Come in,\" before three men came waltzing in, practically ignoring her very existence as they continued talking with one another. In fact, it was several long seconds before they seemed to realize there was a fourth person in the room. \"Miss Banks?\" the oldest of the three men asked as he read the name off of a chart that he held tightly in his hands.", "source": "LSF Publications: Spanking Stories"}