{"published": "2015-09-20T12:18:17Z", "media-type": "News", "title": "Europe takes 10-6 lead over US in controversial fashion", "id": "7ff8426f-0b5b-4a19-a6c3-2902d7b633da", "content": "ST. LEON-ROT, Germany -- Charley Hull and Suzann Pettersen beat Alison Lee and Brittany Lincicome 2 up in controversial fashion at the Solheim Cup to give Europe a 10-6 lead over the United States going into Sunday's singles matches. \n\nLee missed a short putt for a birdie on the 17th of their resumed fourball match and then picked up her ball under the assumption Europe had conceded -- Hull already was walking toward the last hole -- only for Pettersen to claim Europe hadn't conceded the short putt. The umpire intervened and Europe was awarded the hole. \n\n\"I missed it but I had just under two feet, like a foot and a half left coming back. And I looked at it and I thought I heard it was good,\" Lee said. \"To me it looked good. I mean, it was a really short putt, easy putt. And at the same time Charley was walking off the green and Suzann was already off the green so there was no doubt in my mind that that putt was good. I didn't even think twice about it. So I just picked it up.\" \n\nLincicome said Hull and Pettersen were both heading to the last hole. \n\n\"So maybe that's why Alison thought she heard them say it was good, because their backs were almost to us and they were kind of walking away. And then she just picked it up because she thought she heard someone say it was good. And they both said, `No, we didn't say it was good.' I don't know if it was somebody in the crowd that said it,\" Lincicome said. \"The putt was a foot. They had given us putts farther than that all day. And Alison just thought she heard it was good.\" \n\nReferee Dan Maselli said there was nothing he could do to allow Lee to \"put that ball back down and putt.\" \n\n\"It would have to be something that was uttered by the team, a caddy, one of the helpers, one of the assistant captains, or the captain, other than that. But nothing was said by anybody,\" Maselli told NBC's Golf Channel. \n\nLee and Lincicome had been 1 up after 15 holes before England's Hull made a birdie on the 16th to draw the Europeans level. \n\nHull's birdie on the 18th sealed Europe's second win from the fourballs and leaves the Americans at a huge disadvantage before the 12 singles matches. \n\n\"It's just B.S. as far as I'm concerned,\" U.S. captain Juli Inkster told NBC. \"Everything was going great. I thought it was a great week for women's golf and to put a damper on that ... I mean, there's no way they could ever justify that. I don't care what you say, you just don't do that to your peers.\" \n\nThe 20-year-old Lee, the only rookie on either team, and the 19-year-old Hull were both in tears after the match. \n\nEurope captain Carin Koch said the ball went too far to concede. \n\n\"We all feel bad for Alison. She made a mistake and it's very unfortunate. We don't want things like that to happen. She made a mistake in the rules of golf. We had a rules meeting and we clearly stated that you have to concede a putt very clearly and she didn't go with the rule,\" Koch said. \"The rules are the rules. You have to follow the rules.\" \n\nEarlier Sunday morning in the resumed fourballs, Americans Stacey Lewis and Gerina Piller held onto their lead to defeat Caroline Masson and Caroline Hedwall 1 up, while Karine Icher of France and Catriona Matthew of Scotland finished with three consecutive birdies to beat Brittany Lang and Lizette Salas 2 and 1. \n\nEurope was leading 8-5 on Saturday before the three fourball matches were suspended due to bad light. \n\nEurope needs 14 points to win a third straight Solheim Cup for the first time. The U.S. needs 14 to extend its series lead to 9-5. \n\nIn the singles, it was Carlota Ciganda of Spain vs. Lexi Thompson; Matthew vs. Morgan Pressel; Icher vs. Lincicome; England's Melissa Reid vs. Lang; Gwladys Nocera of France vs. Lee; Caroline Masson of Germany vs. Piller; Anna Nordqvist of Sweden vs. Lewis; Azahara Munoz of Spain vs. Salas; Norway's Pettersen vs. Angela Stanford; Hull vs. Cristie Kerr; Hedwall vs. Michelle Wie; and Sandra Gal of Germany vs. Paula Creamer.", "source": "LocalNews7.com"}