{"published": "2015-09-01T21:05:28Z", "media-type": "News", "title": "ION awarded contract to conduct 2D seismic survey of Somalia Puntland offshore margin", "id": "f32a25c2-f684-4ded-b8a0-099e9f76d96a", "content": "SOURCE ION Geophysical Corporation\n\nFederal State of Puntland announces new block boundary demarcation\n\nHOUSTON \n\nIn addition, the PPMA today announced the demarcation of its offshore territory into 25 exploration blocks covering 180,000 square kilometers of the Somalia Puntland seaboard. In total, there are seven Blocks in the Gulf of Aden and 18 Blocks in the Indian Ocean that have been defined. Block sizes range from 5,000 square kilometers in the inshore area to 25,000 square kilometers in the deeper water.\n\nDr. Issa Farah \n\nJoe Gagliardi \n\nAbout ION\n\nION is a leading provider of technology-driven solutions to the global oil & gas industry. ION's offerings are designed to help companies reduce risk and optimize assets throughout the E&P lifecycle. For more information, visit iongeo.com.\n\nContacts\n\nION (Investor relations)\n\nExecutive Vice President and Chief Financial Officer\n\nSteve Bate \n\nION (Media relations)\n\nVice President, Marketing & Communications\n\nKaren Abercrombie \n\nThe information herein contains certain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. These forward-looking statements may include information and other statements that are not of historical fact. Actual results may vary materially from those described in these forward looking statements. All forward-looking statements reflect numerous assumptions and involve a number of risks and uncertainties. These risks and uncertainties include risks associated with the timing and development of the Company's products and services, the competitiveness of offers, pricing pressure, decreased demand, and changes in oil prices; and political, execution, regulatory, and currency risks. Additional risk factors, which could affect actual results are disclosed by the Company in its fillings with the Securities and Exchange Commission (\"SEC\"), including its Form 10-K, Form 10-Q and Form 8-ks filed during the year. The Company expressly disclaims any obligation to revise or update any forward-looking statements.\n\nPhoto - http://photos.prnewswire.com/prnh/20150901/262943 \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/ion-awarded-contract-to-conduct-2d-seismic-survey-of-somalia-puntland-offshore-margin-300136368.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WSET"}