{"published": "2015-09-16T16:06:01Z", "media-type": "Blog", "title": "The FOMC Star Chamber", "id": "60dfc0a3-9baf-4f50-9184-1ec446ff537c", "content": "By Jeff Deist\nEconomists, bankers, fund managers, and investors around the world are absolutely fixated on the Federal Reserve’s anticipated announcement this week... In a world of social media and 24-hour news cycles, it’s fair to say Wednesday’s FOMC meeting in the Eccles Building has been the most widely reported and discussed central bank action in history. But missing from the coverage is one fundamental point: “monetary policy” and bureaucratic control over interest rates is not capitalism, it is outright centralized planning. What else can we call the orchestration of a pivotal price signal in the worldwide economy by 12 individuals sitting in one room? If one accepts the Fed’s role in setting interest rates, it’s hard to understand where and when to draw the line. Why not prices of goods, services, and wages? If experts can determine the price of money, why can’t they determine the price of a bushel of wheat or an automobile? When the former Soviet Union’s State Committee on Prices attempted exactly that, western capitalists scoffed. Yet we accept centralized monetary planning as part and parcel of free markets! David Stockman explains that the Fed Funds Rate-- the overnight rate at which commercial banks trade reserves with each other for liquidity-- is the single most important price in the entire world economy: As I always say, the money-market price, that is the Federal Funds Rate or Overnight Money or a short term treasury bill, is the most important price in all of capitalism because that determines the cost of carry, the cost of speculation and gambling. When you conduct a monetary policy that says to the speculators, to the gamblers, “come and get it,” you are guaranteed free money to carry your positions, whether you’re buying German Bonds or you’re buying the S&P 500 Stock Index or the whole array of yielding or price gaining assets that are available in the financial market. This monetary policy also sends the message that you can leverage and carry those positions for free and roll it day after day without worry because the central bank has pegged your cost and production, and in a sense has pledged on its solemn honor that it will not change without many months of warning. And that’s what this whole thing is about — changing the language and so forth. I think you have created a massive distortion in the very heart of capitalism in the financial system. So while price fixing is illegal, when the Fed does it it’s called… capitalism. The above originally appeared at Mises.org", "source": "EconomicPolicyJournal.com"}