{"published": "2015-09-12T16:38:05Z", "media-type": "News", "title": "Drill Sergeant, AIT Platoon Sergeant of the Year named 10:44 am", "id": "e7ea7dd7-0266-431a-bfb4-c8e88532c0d4", "content": "After four days of intense competition, the Army has named its 2015 Drill Sergeants and AIT Platoon Sergeant of the Year. Staff Sgt. Jacob Miller of Fort Leonard Wood, Missouri, is this year's Drill Sergeant of the Year. Staff Sgt. Mark Mercer is the Army Reserve Drill Sergeant of the Year. Mercer is assigned to the 95th Division, 108th Training Command. This year's Advanced Individual Training Platoon Sergeant of the Year is Sgt. 1st Class Samuel Enriquez of Joint Base San Antonio-Fort Sam Houston, Texas. All three soldiers were recognized Thursday evening at an awards ceremony at Fort Jackson, South Carolina. Each received the Meritorious Service Medal. The Drill Sergeant and AIT Platoon Sergeant of the Year event is a four-day, \"best-of-the-best\" contest that puts competitors through physical and mental tests, according to information from the Army. Competitors must battle fatigue, weather and surprise events to earn the coveted titles. They must perform and instruct more than 50 tasks and drills including unknown distance runs and foot marches, rappelling, orienteering, obstacle courses, physical readiness training and appearances before a board of command sergeants major to demonstrate their knowledge of leadership and training tasks. While the Drill Sergeant and AIT Platoon Sergeant competition is similar to other competitions across the Army, this event focuses on competitors' ability to teach, as their day-to-day job requires them to effectively teach the Army's newest soldiers. This year, four active-duty and two Army Reserve drill sergeants competed for the Drill Sergeant of the Year title. Eight AIT platoon sergeants competed this year. All were competition winners at their respective installations or Army Reserve divisions. A closer look at this year's winners: •  Staff Sgt. Jacob Miller As Drill Sergeant of the Year, Miller will be moving to Fort Eustis, Virginia, where he will work at the Center for Initial Military Training. There, he’ll have a chance to provide input and help shape the way the Army trains new soldiers. Miller, 30, joined the Army in November 2006. He completed military police one station unit training at Fort Leonard Wood in April 2007 and has served in MP units at Fort Carson, Colorado, Fort Wainwright, Alaska, and Fort Leonard Wood. Miller, who is working on his bachelor’s degree in criminal justice, has deployed twice to Iraq. His awards and decorations include an Army Commendation Medal with Valor, the Army Commendation Medal, the Army Achievement Medal, the Iraq Campaign Medal, and the Combat Action Badge. Miller, who has been a drill sergeant since March 2013, was in disbelief that he won. “It’s unreal,” he said. ‘It was definitely a long competition, a long week of hard, intense training.” Page 2 of 3 - To prepare for the competition, Miller trained hard, including lots of foot marches, long-distance running and sprints. He also studied up on Army drill and ceremony and all the other tasks soldiers must know. “This competition was very intensive,” Miller said. “Everybody that came here were all winners. Going up against the top of the top here was just unreal.” At the same time, the soldiers shared a common camaraderie, Miller said. “We all came together, we helped each other out, pushed each other,” he said. His advice for those looking ahead to next year’s competition: “Prepare for anything. You need to be fully well rounded when you come here.” •  Staff Sgt. Mark Mercer Mercer joined the Army in July 2002, training as an X-ray technologist. He has served primarily in Oklahoma and has deployed in support of Operation Enduring Freedom. Mercer is a graduate of the University of Oklahoma, with a degree in administrative leadership. His awards and decorations include the Army Commendation Medal, the Army Achievement Medal, and the Afghanistan Campaign Medal. The 31-year-old said he was “relieved, excited” when he learned he had won. “Just so many emotions wrapped up in my body right now,” he said. “I don’t know if I’m in shock still or what’s going on. It shows that hard work pays off.” Mercer started training for the competition in October. In addition to the physical training, Mercer spent three hours every night studying every Army regulation, field manual and publication he could find. “My wife’s glad this is over because we can spend time together now,” he said. “It was very long, strenuous, and I may have trained too hard physically in the end, but I got where I needed to be. Determination and adrenaline go a long way.” Mercer said he’s glad for the experience. “I’ve made some good friends here, met a lot of great people, a lot of knowledgeable people,” he said. “It was an honor to compete against and alongside every single person that was here this week.” • Sgt. 1st Class Samuel Enriquez Enriquez, 30, is a combat medic who joined the Army in August 2002. Before his assignment as an AIT platoon sergeant at Fort Sam Houston, Enriquez served multiple tours with the 82nd Airborne Division at Fort Bragg, North Carolina. He deployed in support of Operation Enduring Freedom and has served in Germany and South Korea. His awards and decorations include the Meritorious Service Medal, the Army Commendation Medal, the Afghanistan Campaign Medal, the Expert Field Medical Badge, the Senior Parachutist Badge and the Air Assault Badge. Page 3 of 3 - Winning the competition “still seems surreal,” he said. “I’m still soaking it in.” Enriquez, who has been an AIT platoon sergeant since January, also will be moving to the Center for Initial Military Training. “I’m part of something bigger now,” he said. “I’m part of a different level of the Army where I can make huge changes. Before, I loved it, and I could always make change, but it was more incremental. Here I can help make gigantic changes that could shape the future of the Army.” In his new assignment, Enriquez will be responsible for providing input that will shape the initial entry process, whether it’s basic training or AIT. “It’s a pretty grand thing, just thinking about the fact that you’re changing the way the Army trains its soldiers,” he said. “I never thought I’d be in this position.”", "source": "Waynesville Daily Guide"}