{"published": "2015-09-22T10:39:53Z", "media-type": "News", "title": "Councillor calls for emergency funding to repair flash-flood damage", "id": "7be53a8c-39d8-4ce0-b5fc-bfa728c07064", "content": "Councillor calls for emergency funding to repair Achill flash flood damage \n\n\nAnton McNulty \n\r \nAN Achill councillor has called on Mayo County Council to apply for emergency funding to repair damage to roads and drains caused by flash flooding two weeks ago. \nTorrential rain resulted in flash flooding in areas around Achill with a number of roads flooded and damaged last Sunday. Debris washed down hills and mountains have resulted in a number of drains being blocked and calls have been made for them to be cleared before the winter. \nLocal Fianna Fáil councillor Paul McNamara has called on Mayo County Council to apply for emergency funding to ensure remedial work is carried out as soon as possible. He told The Mayo News access to lands have been cut off because of damage to roads and many householders are fearful of their lands being flooded because of damage to drains. \n“I have never seen anything like it before, three houses in Belfarsad had their access road taken away and there were three areas on the main R319 at Tonregee impassable for traffic. The recent torrential rainfall has done a lot of damage with a lot of drains in villages full of debris washed down from the mountains and hills. \n“I have to compliment Mayo County Council and their staff in Achill for the quick response and good work over the weekend. But they need to apply for emergency funding from the relevant departments and get the work done as soon as possible. The work needs to be done in the next five to six weeks before the winter because if it isn’t done the drains will not be able to cater for the rain. \n“I am getting calls every day since the weekend from people whose gardens are being flooded due to the drains being blocked and are afraid it will come up to their homes,” he said. \nCllr McNamara said that because of the poor summer a number of homeowners still had turf on their bogs which he said were now inaccessible because of damage to bog roads. He said their was concern that many people won’t be able to get their turf home and there was a real need for emergency funding. \n“I know some of the roads which are damaged are for access to hills and bogs and are not in the care of Mayo County Council. That is why they need to get emergency funding. I feel a couple of hundred thousand euro would repair a lot of the drainage and access roads to areas.” \nThe rain was so intense last Sunday week that it resulted in rivers flowing down from Corrymore lake in Dooagh which is the main water supply for the island. The beach at Keem Bay was covered in stones washed down from the hills and the normally turquoise coloured water was turned brown by the debris. \nCllr McNamara added that there needs to be a survey of the drainage system and to identify what networks need upgrading to deal with similar conditions in the future.", "source": "Mayo News"}