{"published": "2015-09-22T09:23:05Z", "media-type": "News", "title": "Is Bridge A Sport? High Court Judge To Decide", "id": "e394fa29-afee-421b-8423-4f1555522df5", "content": "A High Court judge has been asked to get involved in the argument about whether the card game bridge is a sport or a game.\n\nMr Justice Dove will hear arguments about the issue at a High Court hearing in London over the next two days.\n\nAt the heart of the row is a question of money.\n\nIf bridge is deemed to be a sport, then it will be eligible for a number of grants and competitions exempt from VAT payment.\n\nBut if the status remains as it is, then HMRC will continue to be quids in.\n\nThe English Bridge Union (EBU) brought the action after Sport England said it would not agree that the card game was a sport.\n\n\"Sport England refused to recognise bridge as a sport, a position which the EBU believes to be inconsistent with both the wishes of Parliament, and the opinion of significant international sporting organisations,\" said an EBU spokesman.\n\n\"When ruling on what constituted a sport in the 2011 Charities Act, Parliament specifically included 'mind sports', stating that sport comprised 'activities which promote health involving physical or mental skill or exertion'.\"\n\nThe spokesman said bridge required \"undoubted levels of mental skill\" and had \"known health benefits\".\n\nThe EBU does have some supporters in its corner, with the 2011 Charities Act saying sports are activities \"which promote health involving physical or mental skill or exertion\".\n\nThe World Bridge Federation records that in 1995 the International Olympic Committee (IOC) admitted the federation as part of the Olympic Movement, awarding it the status of a Recognised Sport Organisation. \n\nAnd the judge who decided there was a case to answer, Mr Justice Mostyn - himself a bridge player - was quoted in saying in his ruling: \"You are doing more physical activity playing bridge, with all that dealing and playing, than in rifle shooting.\"", "source": "KL.FM 96.7"}