{"published": "2015-09-05T04:27:00Z", "media-type": "News", "title": "See How to Celebrate Snake's Birthday in MGS5: The Phantom Pain", "id": "610f05d7-3ce0-454a-9b46-df62ac4baada", "content": "After Snake wakes up from his coma in Metal Gear Solid 5: The Phantom Pain , you're bombarded with options and settings. One of those options is choosing Big Boss' birthday. Whatever you set as that date, MGS5 has something special for you. \n \nWhether you're new to the series or just getting your feet wet in Diamond Dogs , it's important to learn there's always something new to discover. Sliding down hills with the cardboard box or turning into the Six Million Dollar Man with a bionic punch, MGS5 is full of weirdness. That includes this awesome little birthday Easter egg. \n \nDelve deeper into the wide world of Metal Gear secrets. Learn how to get Hideo Kojima in MGS5: Phantom Pain and put him to work in Mother Base while he's in between jobs. \n  \n[b]Warning! Minor Spoilers Ahead![b] \n  \nAs The Phantom Pain begins, a doctor lays out your grim situation, and establishes that we're playing an eccentric game with a few simple questions. \n \nYou'll input a name and a birthday, along with customizing your own avatar's face. What's important here is that birthday -- whatever date you set, something special occurs if boot up then. \n \nMiller, Ocelot, and several other important characters make an appearance after calling Snake back to Mother Base. They say it's under attack, but in reality it's a surprise party for everyone's favorite legendary soldier. \n \nIf you've advanced far enough in the story, Emmerich, Quiet and Code Talker all appear alongside Miller and Ocelot. They sing their own version of a Birthday song, and wheel out a cake so Snake can blow out the candles. \n \nOcelot even gives Big Boss a real cigar for old time's sake. Check out the full scene for yourself by changing the date on your PS4/PS3/PC/Xbox One/Xbox 360. \n \nSource: [ 1 ]", "source": "Escapist Magazine"}