{"published": "2015-09-24T00:48:34Z", "media-type": "News", "title": "Breakfast briefing: Thursday, September 24", "id": "ff56417b-6359-4d99-a5c3-ef73a1db5b9f", "content": "Market wrap: US stocks ended down slightly on Wednesday, led by losses in materials and energy shares as weak Chinese and US factory data added to growth worries. Trading was choppy once gain, with the S&P 500 briefly trading higher following afternoon comments by Chinese President Xi Jinping that his country was capable of maintaining a relatively high growth rate for a long time. - Reuters \n\nThe DJIA fell 50.58 points, or 0.31%, to 16,279.89, the S&P 500 lost 3.98 points, or 0.2%, to 1,938.76 and the Nasdaq dropped 3.98 points, or 0.08%, to 4,752.74. \n\nForex summary \n\n*The ringgit lost 0.83% to 4.3795 per US$ \n\n*It declined 1.35% to 4.8947 per euro \n\n*Up 0.20% to 6.6508 to the pound sterling \n\n*0.23% lower to 3.0612 per Singapore dollar \n\n*0.17% higher to 3.0570 per Aussie \n\n*Down 0.86% to 3.6425 per 100 yen \n\nEnergy \n\nGlobal oil markets tumbled on Wednesday, with US crude futures settling down 4% after bullish impact from lower crude inventories was offset by large gasoline builds that raised concerns about high autumn fuel supplies. Also weighing on crude were Colonial Pipeline's efforts to fix an outage on one of its lines that had been supporting prices of gasoline, and the larger oil complex, since Tuesday. Brent, the global benchmark for oil, settled down US$1.33, or 2.7%, at US$47.75 a barrel. - Reuters \n\nTop foreign news \n\nCEO Winterkorn quits over diesel emissions scandal: Volkswagen chief executive Martin Winterkorn resigned on Wednesday, succumbing to pressure for change at the German carmaker, which is reeling from the admission that it deceived US regulators about how much its diesel cars pollute. \"Volkswagen needs a fresh start - also in terms of personnel. I am clearing the way for this fresh start with my resignation,\" Winterkorn said, following a marathon meeting with the executive committee of the VW board. - Reuters \n\nVolkswagen could pose bigger threat to German economy than Greek crisis: The Volkswagen emissions scandal has rocked Germany's business and political establishment and analysts warn the crisis at the car maker could develop into the biggest threat to Europe's largest economy. Volkswagen is the biggest of Germany's carmakers and one of the country's largest employers, with more than 270,000 jobs in its home country and even more working for suppliers. - Reuters \n\nWal-Mart presses suppliers to share benefits of cheaper yuan: Wal-Mart Stores Inc is seeking price cuts from suppliers that produce goods in China, saying the retailer should share in the savings generated by China's devaluation of the yuan, sources said. Wal-Mart managers in recent weeks have contacted more than 10,000 suppliers in various countries, all of which have manufacturing facilities in China, seeking cost cuts of 2%to 6% on mainly general merchandise including home furnishings, apparel, health and beauty products, appliances, electronics and toys, according to a consultant who advised Wal-Mart on the move. - Reuters \n\nUS factory activity stuck at near two-year low in September: Growth in the US manufacturing sector showed no month-over-month change during September, staying at August's sluggish pace which was the weakest in almost two years, according to an industry report released on Wednesday. Financial data firm Markit said its preliminary US Manufacturing Purchasing Managers' Index for September was 53. That was the same as August, which was its lowest since October 2013. - Reuters \n\nMarkets overlook US strength: Fed's Lockhart: Investors that have roiled global markets and thrown Federal Reserve policy off track should focus on the strength of the US economy rather than the more remote risks of a global slowdown, Atlanta Federal Reserve bank president Dennis Lockhart said on Wednesday. - Reuters \n\nTop local stories \n\nPetronas’ new line-up: Petroliam Nasional Bhd (Petronas) has made some changes to its board, bringing in the former head of the Securities Commission, Tan Sri Zarinah Anwar, and shuffling the heads of some of its board committees. It is speculated that more board changes are in the offing, with a few new ones to come in while some existing board members may leave when their terms end. - StarBiz \n\nTropicana aborts land deal: Property developer Tropicana Corp Bhd has terminated a proposal to acquire a 34.2ha leasehold land in Johor Baru from Iskandar Waterfront City Bhd. It cited non-fulfilment of certain conditions as provided in the sale and purchase agreement, without giving further details. - StarBiz \n\n\r\nY&G plans to buy Johor land for RM31mil: Property developer Y&G Corp Bhd is planning to buy two parcels of freehold land measuring 23.39ha in Pontian, Johor, for RM30.96mil. The company intends to develop the land into a mixed project comprising both commercial and residential properties. - StarBiz \n\nTHHE starts work on FPSO topside: TH Heavy Engineering Bhd (THHE) has started work on its floating production, storage and offloading (FPSO) topside for client JX Nippon Oil & Gas Exploration of Japan in Pulau Indah, a project that should help its ailing fortunes. THHE won the US$900mil FPSO project, its first, in May 2014. - StarBiz \n\nMetrod to diversify into hotel business: Copper rod producer Metrod Holdings Bhd is proposing a move into the hotel sector with the purchase of a five-star deluxe resort hotel in Goa, India, known as The Leela Goa. The company, together with unit Metrod Holdings (Singapore) Pte Ltd and imajor shareholder MetTube Sdn Bhd, and subsidiary MetTube International Pte Ltd, said it had entered into a conditional subscription agreement to invest in Ceres Hotel Pte Ltd. - StarBiz \n\nQatar bank halts talks on KFH unit buy: Qatar National Bank (QNB) has halted talks with Kuwait Finance House (KFH) to buy its Malaysian unit, the Gulf Arab region’s largest bank said. KFH chief executive Mazin al-Nahedh said the bank had ruled out a sale or merger for its Malaysian unit, adding that the bank “will begin restructuring the unit with immediate effect”. – Reuters \n\nAnalysts upbeat on ECO World’s land buy: Eco World Development Group Bhd’s move to buy more than 2,000 acres in Kuala Selangor has come as a surprise to many people. Analysts however are positive on the deal in the long term as long as Eco World is able to secure the right partners to develop the land. - StarBiz \n\n1MDB shortlists firms for Edra sale: 1Malaysia Development Bhd (1MDB) has reportedly shortlisted several foreign parties, including Qatar’s Nebras Power QSC, Hong Kong- listed CGN Meiya Power Holdings Co and Saudi Arabia-based ACWA Power International for the sale of its power generation arm, Edra Global Energy Bhd. Tenaga Nasional Bhd has also been selected to participate in the sale of 1MDB’s power plants. - StarBiz \n\nHeiTech wins RM38mil immigration contract: HeiTech Padu Bhd has secured a RM38.35mil contract from the Home Affairs Ministry for the maintenance of the Immigration Department’s systems. The contract is for a period of three years to Sept 15, 2018. - StarBiz", "source": "TheStar.com.my"}