{"published": "2015-09-30T13:08:00Z", "media-type": "News", "title": "The 7ft 6in German who quit his job with a US freak show to join Hitler's army... only to get captured by a 5ft 3in British corporal and end up a Broadway star ", "id": "90e54c96-b854-4963-818b-74b951716c19", "content": "German giant Jakob Nacken surrendered during the Allied invasion in WW2 David-and-Goliath image of his capture by 5ft 3in corporal made headlines around the world Nacken later returned to New York to cash in on his international stardom He became world's largest Father Christmas and starred in Ripley's Believe It Or Not on Broadway \nBy\n\nSimon Tomlinson for MailOnline \n   \nView \ncomments \n     \nDavid and Goliath: The moment 5ft 3ins British corporal Bob Roberts captured 7ft 6ins Jakob Nacken in World War Two in an encounter that, bizarrely, spawned a successful career on Broadway for his giant German counterpart \n\nAmid the horrors of World War Two, it was a fleeting moment of comic relief – but a colossal encounter that endures to this day. \n\nOn one side towered a 7ft 6in man mountain who quit his job with an American freak show to join the Nazis. \n\nOn the other stood a 5ft 3in British corporal who, despite his diminutive stature, went on to capture his opposite number. \n\nIt was a humorous David and Goliath match-up that bizarrely went on to spawn a successful career on Broadway, of all places, for the German giant Jakob Nacken. \n\nDusseldorf-born Nacken was working in a circus in America when war broke out and returned to the Fatherland to be conscripted into the German Army. \n\nHe may well have been killed when Allied troops, including Corporal Bob Roberts, stormed five pillboxes and gun emplacements near Calais that were pounding Dover with shells. \n\nBut his surrender instead meant he was sent over to Britain as a PoW - and later went on to find stardom. \n\nHis capture by Mr Roberts, then in the Canadian Army, made headline news at the time and was recorded on widely-distributed Pathe newsreel film. \n\nAnd the then 38-year-old Nacken later returned to New York to capitalise on this new-found international celebrity. \n\nHe was signed up at first as the world's biggest Father Christmas then broke into the minor limelight of showbiz through the circus - nicknamed 'The Giant Uranus' and appearing at the New York World Fair. \n\nIn 1959, he starred in Ripley's Believe It Or Not on Broadway. \n\nThe tourist attraction - ironically now part of a Canadian conglomerate - showcased unusual acts and exhibits. \n\nNacken was billed as 'The Tallest Man On Earth' and named in a roll of honour in Ripley's 'Odditorium'. \n\nHis height was recorded variously as 7ft 3in and 7ft 7in. Confusingly, Nacken's fellow soldiers on the Normandy battlefield told Corporal Roberts he was 7ft 6in. \n\nThe discrepancy might be explained by Nacken's civilian background in freak shows. Circus owners often lied about the dimensions of their tallest, fattest or shortest stars to enhance their popularity. \n  \nMan mountain: Jakob Nacken returned to New York to capitalise on this new-found international celebrity - at first signing up as the world's biggest Father Christmas (left) and starring in Ripley's Believe It Or Not on Broadway. He is pictured (right) with one of somewhat smaller co-stars \n\nAt least one giant was sacked on the spot when the circus boss found someone two inches taller, archives record. \n\nNacken eventually returned to Germany and died 1987 at the age of 81. \n\nSpeaking previously, Mr Roberts, who settled in Britain after the war, said he was 'delighted' when his PoW had finally been identified after so many years. \n\nHe said: 'I never knew his name, only that he was a lance corporal. \n\n'But he spoke very good English and one of my mates later asked him where he learned it and he explained he used to be in the circus in America.  \n\n'I'm not surprised he made the most out of his height - there couldn't have been many taller than him.' \n\nMrs Roberts, now 92, has now been awarded France's top honour 71 years later.  \n  \nWar hero: Corporal Bob Roberts pictured, left, during World War Two and, right, with his Legion d'honneur medal after being awarded France's highest honour for bravery \n\nHe escaped death when a sniper's bullet grazed his temple, survived a shell blast that killed the man next to him, saw an enemy spy shot dead just as she was about to kill him and came out on top of a duel with a German officer.  \n\nLast year, the French government announced it was to honour all living Allied servicemen who helped liberate the country from the Nazis by awarding them the prestigious Legion d'honneur. \n\nWhen Bob's granddaughter, Melanie Vass, wrote to the MoD for his medal in April, the application joined a queue of 3,000 others. \n\nNothing was heard until this week when the great-grandfather received the award in the post without ceremony. \n\nMr Roberts, from Bournemouth, Dorset, said: 'I thought it was never going to come and was a bit surprised when it arrived recorded delivery in the post. \n\n'But I am glad it has and I feel very lucky and privileged to have it.I just doing my bit in the war and was very lucky a number of times. \n\n'I think that if you are entitled to it you should have it without having to beg or chase after it.'", "source": "Capital Bay"}