{"published": "2015-09-30T18:12:25Z", "media-type": "News", "title": "Stewart To Retire After 2016 Season; Passes Torch To Bowyer In 2017 23 minutes ago", "id": "68c46b01-c45a-4617-ae5b-7c9468cee783", "content": "Sprint Cup Series driver Tony Stewart (14) looks on during driver introductions prior to the Federated Auto Parts 400 at Richmond International Raceway. (Photo: Amber Searls-USA TODAY Sports) \n\nKANNAPOLIS, N.C.  --  After 17 years competing at NASCAR’s highest level, Tony Stewart has decided his 18th year in the NASCAR Sprint Cup Series will be his last. The three-time series champion will retire following the 2016 season, whereupon Clint Bowyer will take the wheel of the No. 14 machine beginning in 2017. \n\nSince 2009 Stewart has held the dual title of driver/owner at Stewart-Haas Racing (SHR). He co-owns the team with Gene Haas, founder of Haas Automation, the largest CNC machine tool builder in North America. Stewart will join Haas as a fulltime owner in 2017, with Bowyer being Stewart’s hand-picked successor to drive the No. 14 car. \n\n“This is a moment every driver eventually comes to terms with, and I know this is the right decision for me,” said Stewart, owner of 48 Sprint Cup victories, 15 of which have come with SHR. “2016 will be my last year in a Sprint Cup car, but it’s not my last year in NASCAR. I love this sport and I love being a part of it, and instead of seeing me in a firesuit on Sundays, you’ll see me in a pair of jeans, and maybe even a pair of khakis. \n\n“I plan to make the most of my final year as a driver in the NASCAR Sprint Cup Series, and part of that is to ensure that when Clint Bowyer takes over the No. 14 in 2017, he has everything he needs to win races and contend for the championship. I’m very comfortable with this decision and what the future holds for me and Stewart-Haas Racing.” \n\nBowyer is an eight-time race winner in the Sprint Cup Series and finished second in the 2012 championship standings. \n\n“Today is an incredible opportunity and I’m proud and excited to take over the No. 14 in 2017,” said Bowyer, the 2008 NASCAR Xfinity Series champion. “Whether it’s racing him on Sunday or watching my dirt late model teams race at his famed Eldora Speedway, Tony and I share the same passion for racing. That makes this opportunity a perfect fit for me. I appreciate everything he’s done for me and the sport of auto racing. These are big shoes to fill, but boy am I ever looking forward to getting behind the wheel of a champion’s ride, and have Tony there with me along the way.” \n\nHaas, who formed Haas CNC Racing in 2002 before partnering with Stewart to create SHR in 2009, embraces the transition. \n\n“Tony Stewart has been a game-changer for Stewart-Haas Racing and for motorsports,” Haas said. “I always had an incredible amount of respect for what he could do with a racecar – any racecar, as he’s been successful in everything he’s ever driven. In getting to know Tony Stewart the businessman, I found a very smart person with excellent people skills. He’s extremely valuable to our race team and a strong voice in our sport. His passion for motorsports is unmatched, and I’m proud that his future outside of the No. 14 Chevrolet remains with Stewart-Haas Racing.” \n\nThe primary partners currently represented on the No. 14 Chevrolet include Bass Pro Shops, Mobil 1, Rush Truck Centers, Code 3 Associates, Coca-Cola, Jimmy Johns and Haas Automation. Announcements regarding the partnership lineup for the No. 14 team in 2016 and beyond will be made in the lead up to the 58th Daytona 500 on Feb. 21 at Daytona (Fla.) International Speedway. \n\n“I have been blessed with fantastic partners throughout my racing career, and I take a lot of pride in the lifelong friendships formed and the great business successes we’ve been a part of,” Stewart said. “I never would’ve accomplished all that I’ve achieved in racing if it weren’t for the support of corporate America. They helped a kid from Columbus, Indiana, reach his dreams and I’ll be forever grateful.” \n\nRead or Share this story: http://on.wfmy.com/1FEP5UH", "source": "WFMY News 2"}