{"published": "2015-09-23T07:50:29Z", "media-type": "News", "title": "Sparks rally falls short vs. Lynx in Game 3", "id": "d32075ca-82cd-4f1a-8660-5c91e67e85e4", "content": "MINNEAPOLIS >> Through injuries, trades and upheaval, the Minnesota Lynx have struggled at times to find their footing this season. \n\nThey have overcome the unfamiliar feelings of instability to land in a most familiar spot one step away from the WNBA Finals. \n\nMaya Moore had 20 points and eight rebounds to help the balanced Lynx advance to the Western Conference finals with a 91-80 victory over the Sparks in Game 3 of the conference semifinals Tuesday night. \n\nMoore was just 6 for 21 from the floor, but Seimone Augustus added 16 points and Deveraux Peters scored 12 big points off the bench to push the top-seeded Lynx into their fifth straight conference finals. They will play Phoenix, which swept Tulsa in the other semifinal. Game 1 is on Thursday night in Minnesota. \n  \n“The longer this team plays, the better we’re going to get,” Lynx coach Cheryl Reeve said. \n\nCandace Parker had 28 points and 13 rebounds for the Sparks, who haven’t been to the conference finals since 2012. They trailed by 14 points in the first half but rallied to cut the deficit to one in the fourth quarter. \n\nThe Lynx responded with a 9-0 run to hold off Los Angeles. \n\n“We were stagnant in the first half and we shot ourselves in the foot,” Parker said. “But we were able to bounce back and make it a game.” \n  \nMinnesota outscored Los Angeles 22-4 in second-chance points and converted 15 turnovers into 20 points to improve to 18-2 all-time at home in the postseason, the best record in WNBA history. \n\n“That was the Lynx team I was hoping for in that we were aggressive in everything that we did,” Reeve said. \n\nJust like everything else this season for the Lynx, who won two championships in three seasons before losing to the Mercury in last year’s conference finals, nothing came easy in this series. They edged the Sparks by two points in Game 1, were beaten convincingly in Game 2 in Los Angeles and had a runaway in Game 3 get a little too close for comfort in the second half. \n  \nThe Lynx entered the season among the favorites to get out of the West and only bolstered those odds when they acquired Sylvia Fowles from Chicago midway through the season. But injuries to Augustus and Lindsay Whalen and Fowles’ gradual transition back to playing after sitting out in Chicago made it difficult for them to forge any kind of continuity heading into the playoffs. \n\nAfter dropping Game 2, the Lynx were in danger of a massively disappointing first-round exit entering the elimination game. \n \n\r\r \n  \nMoore and Augustus struggled mightily in the early going, shooting just 2 for 13 in the first quarter. \n\nBut the suffocating Lynx defense squeezed Parker and the Sparks. Los Angeles shot just 26.7 percent in the first quarter and turned the ball over 10 times in the first 13 minutes to fall behind by 14 points. \n\n“They put a lot of pressure on us and we didn’t deal with it very well,” Sparks coach Brian Agler said. \n\nParker was whisper quiet in the first half, rendered ineffective by Rebekkah Brunson’s physical defensive presence. She didn’t hit a shot until 90 seconds into the second quarter and didn’t hit her second field goal until there was less than two minutes to play in the half. \n  \nShe came alive in the third quarter, scoring 13 points on 5-for-6 shooting to bring the Sparks roaring back. Her two free throws with just under nine minutes to go in the game cut the deficit to one, but the Lynx scored the next nine points and Parker gave them another one when she picked up a technical foul for arguing with the officials after a five-second call that gave Minnesota a 75-67 lead with 3:30 to play. \n\nFowles scored nine of her 13 points in the fourth quarter and Whalen had 14 points and six rebounds. \n  \n“We really came together, especially at the hardest parts of the game,” Whalen said. “That cohesion was huge for us. We needed it.”", "source": "Inland Valley Daily Bulletin"}