{"published": "2015-09-22T13:15:32Z", "media-type": "Blog", "title": "Want To Put A #FullStop To Child Sexual Abuse? Then Raise Your Hand With Kailash Satyarthi #MMKarma", "id": "d798a8e0-e0d5-4321-9556-0e5707ebbd26", "content": "MissMalini \n \nMake a difference. Be the change. \n \nIt’s hard, isn’t it? Or for the very least, it can be overwhelming. I mean, where does one even begin… And can one person really make a difference? \n \nYes! You can. \n \nThere are many problems that cannot be solved with a like and a share, a tweet and a post. This isn’t one of them! \n \nSource: Giphy \n \nIf you’re a little skeptical (very normal!), here’s what you need to know. \n \n#FullStop is the national campaign being launched by Bachpan Bachao Andolan in association with Kailash Satyarthi Children’s Foundation (founded by Nobel Peace Laureate Kailash Satyarthi ) on September 24th. Why? Because every hour, more than 2 children are sexually abused in India. The scary truth is that child sexual abuse can happen anywhere, and it does. It happens to girls as well as boys, in public places as well as in the safety of their homes. And the impact is severely damaging, often lifelong. \n \nAnd that’s why we need you. Because every post, every share, every tweet makes a difference! #MMKarma \n \n#FullStop is a campaign to raise awareness on all forms of child sexual abuse. By talking about the problem, you become a part of the solution. Together, we need to end the silence, end the hurt. Full Stop. \n \nWhere do you start? Right here! Sign up for the Thunderclap at  http://thndr.it/1Nu5Cvi and be a part of the launch of #FullStop on September 24th (PS: the dedicated website, that’s www.fullstop.org.in , goes live at the same time). \n \nWe’ve already spotted Kalki Koechlin, Vijender Singh, Ashwin Mushran, Nikhil Chinapa, Sarah Brown, Pooja Dhingra , and many others, joining the #Thunderclap to pledge their support! \n  \nYou guys are SO awesome! Thank you for pledging your support: http://t.co/pv6VDnqYw1 :) @FullStop_IN  #MMKarma  pic.twitter.com/BiEaHXFzcA \n \n— MissMalini (@MissMalini) September 21, 2015 \n \nTara Sharma even hosted an episode on child sexual abuse awareness on The Tara Sharma Show , to put the spotlight on this cause. \n \n\n \nHope to hear your voices (roar!) :) \n \nThe post Want To Put A #FullStop To Child Sexual Abuse? Then Raise Your Hand With Kailash Satyarthi #MMKarma appeared first on MissMalini .", "source": "MissMalini"}