{"published": "2015-09-08T14:39:50Z", "media-type": "News", "title": "Depomed Issues Statement on Horizon Pharma plc's Unsolicited Exchange Offer", "id": "c417d868-67d2-42fa-b5cd-b20fd2418d92", "content": "NEWARK, Calif. , Sept. 8, 2015 /PRNewswire/ -- Depomed, Inc. (NASDAQ: DEPO) (\"Depomed\" or the \"Company\") today confirmed that Horizon Pharma plc (NASDAQ: HZNP) (\"Horizon\") has announced that it has commenced an unsolicited exchange offer to acquire all of the outstanding shares of Depomed. Under the terms of the offer, Horizon is offering an exchange ratio of 0.95 of Horizon shares for each share of Depomed, remaining unchanged from its prior unsolicited proposal. \n \nThe Company noted that on August 19 , the Depomed Board unanimously rejected Horizon's revised proposal that provided for an exchange ratio of 0.95 of Horizon shares for each share of Depomed.  The Board strongly believed that the revised proposal significantly undervalued Depomed, and did not reflect the value Depomed would contribute to the combined company or the value of the synergies from the transaction.    \n \nDepomed's Board of Directors, in consultation with its financial and legal advisors, will carefully review and evaluate Horizon's exchange offer.  Following completion of this review and evaluation, Depomed will advise shareholders of the Board's position regarding the exchange offer by making available to shareholders, and filing with the Securities and Exchange Commission, a solicitation/recommendation statement on Schedule 14D-9. Applicable securities laws prevent Depomed from making any further comments on Horizon's exchange offer or its terms until after this filing is made on Schedule 14D-9 which will be no later than 10 business days from today. Until that time, Depomed shareholders are advised to take no action. \n \nMorgan Stanley & Co. LLC and Leerink Partners LLC are serving as financial advisors to Depomed and Baker Botts L.L.P. and Gibson, Dunn & Crutcher LLP are serving as legal counsel. \n \nAbout Depomed \n \nDepomed is a specialty pharmaceutical company that commercializes products for pain and neurology related disorders. Our NUCYNTA® franchise includes NUCYNTA® ER (tapentadol) extended release tablets indicated for the management of pain, including neuropathic pain associated with diabetic peripheral neuropathy (DPN), severe enough to require daily, around-the-clock, long-term opioid treatment, and NUCYNTA® (tapentadol), an immediate release version of tapentadol, for management of moderate to severe acute pain in adults. Gralise® (gabapentin) is a once-daily treatment approved for the management of postherpetic neuralgia. CAMBIA® (diclofenac potassium for oral solution) is a non-steroidal anti-inflammatory drug indicated for acute treatment of migraine attacks with or without aura in adults (18 years of age or older). Zipsor® (diclofenac potassium) Liquid Filled Capsules is a non-steroidal anti-inflammatory drug indicated for relief of mild to moderate acute pain in adults. Lazanda® (fentanyl) Nasal Spray is an intranasal fentanyl drug used to manage breakthrough pain in adults (18 years of age or older) who are already routinely taking other opioid pain medicines around-the-clock for cancer pain. Gralise, Nucynta ER and various partner product candidates are formulated with Depomed's proven, proprietary Acuform® drug delivery technology. Additional information about Depomed may be found at www.depomed.com . \n \nForward-Looking Statements \n\"Safe Harbor\" Statement under the Private Securities Litigation Reform Act of 1995. The statements that are not historical facts contained in this release are forward-looking statements that involve risks and uncertainties including, but not limited to, those related to Depomed's prospects as a standalone business, Depomed's business strategy, expectations regarding Depomed's future financial results and the ability to create shareholder value, expectations regarding anticipated growth and the future contributions and potential of NUCYNTA, and other risks detailed in the company's Securities and Exchange Commission filings, including the company's Annual Report on Form 10-K for the year ended December 31, 2014 and its most recent Quarterly Report on Form 10-Q. The inclusion of forward-looking statements should not be regarded as a representation that any of the company's plans, objectives or expectations will be achieved. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date hereof. The company undertakes no obligation to publicly release the result of any revisions to these forward-looking statements that may be made to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events. \n \nImportant Additional Information \nThis communication does not constitute an offer to buy or solicitation of an offer to sell any securities.  Depomed may file a solicitation/recommendation statement on Schedule 14D-9 with the U.S. Securities and Exchange Commission (\"SEC\").  Any solicitation/recommendation statement filed by Depomed that is required to be mailed to shareholders will be mailed to shareholders of Depomed.  INVESTORS AND SHAREHOLDERS ARE STRONGLY ENCOURAGED TO READ THESE AND OTHER DOCUMENTS FILED WITH THE SEC IF AND WHEN THEY BECOME AVAILABLE AS THEY WILL CONTAIN IMPORTANT INFORMATION.  In addition, Depomed intends to file a revocation statement and revocation cards with the SEC in connection with the proposed solicitations by Horizon Pharma plc to be able to call special meetings of Depomed shareholders (the \"Horizon Special Meeting Solicitations\").  INVESTORS AND SHAREHOLDERS ARE STRONGLY ENCOURAGED TO READ THE REVOCATION STATEMENT (INCLUDING ANY AMENDMENTS AND SUPPLEMENTS) AND OTHER DOCUMENTS FILED WITH THE SEC IF AND WHEN THEY BECOME AVAILABLE AS THEY WILL CONTAIN IMPORTANT INFORMATION. \n \nThese documents, including any solicitation statement (and amendments or supplements thereto) and other documents filed by Depomed with the SEC, will be available for no charge at the SEC's website at http://www.sec.gov and at the investor relations section of Depomed's website at http://www.depomed.com .  Copies may also be obtained by contacting Depomed's Investor Relations by mail at 7999 Gateway Blvd., Suite 300, Newark, CA 94560 or by telephone at 510-744-8000. \n \nCertain Information Regarding Participants \nDepomed, its directors and certain of its executive officers may be deemed to be participants in the solicitation of revocations in connection with the Horizon Special Meeting Solicitations.  Information regarding the names of Depomed's directors and executive officers and their respective interests in Depomed by security holdings or otherwise is set forth in Depomed's proxy statement for the 2015 Annual Meeting of Shareholders, filed with the SEC on April 6, 2015.  To the extent holdings of such participants in Depomed's securities have changed since the amounts described in the 2015 proxy statement, such changes have been reflected on Initial Statements of Beneficial Ownership on Form 3 or Statements of Change in Ownership on Form 4 filed with the SEC. Additional information can also be found in Depomed's Annual Report on Form 10-K for the year ended December 31, 2014, filed with the SEC on February 26, 2015 and in Depomed's latest Quarterly Report on Form 10-Q. \n \nInvestor Contact: \n \nDepomed, Inc.  \nAugust J. Moretti  \nChief Financial Officer \n510-744-8000  \namoretti@depomed.com   \nor \nChristopher Keenan  \nVP, Investor Relations and Corporate Communication \n510-744-8000 \nckeenan@depomed.com  \n \nInnisfree M&A Incorporated \nLarry Miller / Jonathan Salzberger / Scott Winter  \n(212) 750-5833 \n \nMedia Contact :  \n \nJoele Frank , Wilkinson Brimmer Katcher  \nEric Brielmann  \n415-869-3950  \n \nAndy Brimmer and Averell Withers  \n212-355-4449 \n \nSOURCE  Depomed, Inc.", "source": "Biotechgate"}