{"published": "2015-09-12T07:47:52Z", "media-type": "News", "title": "Williams exit has Djokovic, Federer on high alert", "id": "2d752b63-be1a-469d-8f2e-9d450ded23a0", "content": "The tremors started early at Arthur Ashe Stadium with Flavia Pennetta crushing second seed Simona Halep. \n\r\n\r\n                            \r\n\r\n                            \r\n                            \r\n                            \r\n\r\n\r\n\r\n                            \r\n                            \r \n\r \nNEW YORK – On high alert after a day of upsets during which Serena Williams was sent packing from the US Open, Novak Djokovic and Roger Federer made sure their names were not added to the list of shocks on Friday as they posted emphatic semi-final victories. \n\nThe tremors started early at Arthur Ashe Stadium with Flavia Pennetta crushing second seed Simona Halep 6-1 6-3, before Roberta Vinci rocked Flushing Meadows delivering one of the biggest upsets in tennis history with her semi-final win over Williams that punctured the American's calendar Grand Slam dream. \n\nTwo victories from becoming the fourth woman to win all four majors in one year, a brittle-looking Williams crumbled as unseeded Vinci, playing in her first grand slam singles semi-final, battled to an improbable 2-6 6-4 6-4 win. \n\nThe results set the stage for an equally improbable all-Italian final on Saturday. \n\n“I don’t want to talk about how disappointing it is for me,” a grim-faced Williams told reporters. “I told you guys I don't feel pressure. I never felt pressure. \n\n“I never felt that pressure to win here. I said that from the beginning.” \n\nWith the National Tennis Center buzzing over the exit of Williams, world number one Djokovic and second seed Federer restored order to the year’s final grand slam. \n\nDjokovic needed just 85 minutes to secure passage to his fourth consecutive grand slam final, crushing defending US Open champion Marin Cilic 6-0 6-1 6-2. \n\nThe demolition was the worst ever in a US Open semi-final, the three games lost one fewer than the four Yevgeny Kafelnikov managed against Lleyton Hewitt in 2001. \n\nFederer, a five-times US Open winner, was equally efficient as he beat Swiss compatriot Stan Wawrinka 6-4 6-3 6-1. \n\nThe all-time grand slam singles king with 17 titles, Federer heads into Sunday’s final gunning to add to his record haul. He has not won a grand since 2012 Wimbledon. \n\nThe final will mark the 42nd meeting between the two great rivals, with Federer holding a wafer 21-20 advantage. \n\n“Novak it’s been more straightforward, my opinion,” said Federer. “That’s what I like about the rivalry. \n\n“I think it’s just a straight shootout and I think that’s the cool thing about our rivalry. It’s very athletic. \n\n“We both can handle ... whatever we present to one another, and I think our matches, it’s very even.” \n\nVINCI 300-1 SHOT \n\nVinci, a 300-1 shot to win the US Open when the tournament began, pulled off one of the most remarkable ever tennis upsets by ending Williams’ streak of 33 consecutive match wins in the grand slams. \n\nA five-times doubles grand slam winner, the 32-year-old Vinci had never been beyond the quarter-finals in singles play at 43 majors. \n\nIn the other corner stood Williams, a 21-times grand slam champion who had lost only two matches all season and had not dropped a set against Vinci in their four previous meetings. \n\nForced to wait a day after rain wiped out Thursday’s semi-finals schedule, the weight of expectation appeared to take its toll on a 33-year-old who was chasing the first calendar Grand Slam since Steffi Graf in 1988. \n\nEverything was going according to script as Williams easily took the opening set but things began to unravel after a composed Vinci registered a key break in the fifth game of the second that allowed her to even the match. \n\nWith the contest slipping away, Williams tried to will herself back into the match, screaming and fist-pumping after each point and feeding off the support of the crowd. \n\nBut with nothing lose, an undaunted Vinci continued to pressure Williams, who could not match previous great escapes. \n\nWhile a stunned Vinci celebrated, a scowling Williams quickly departed a stunned stadium. \n\n“This is an incredible moment for me,” Vinci said. “It’s amazing. It’s like a dream. I’m in the final. I beat Serena.” \n\nLost in the drama of the Williams match was a brilliant performance by Pennetta, who needed less than an hour to deal with Romanian Halep. \n\nPennetta, was a clear underdog but the 26th seed tapped into her vast experience and was not overwhelmed on the big stage. \n\nShe had reached the quarter-finals at Flushing Meadows in six of the previous seven years, but the final will be uncharted territory.", "source": "Eye Witness News"}