{"published": "2015-09-03T11:30:00Z", "media-type": "News", "title": "Gevo Announces First Marina Sales of Isobutanol-Blended Gasoline at Harbor Marina Pumps at Lake Pomme de Terre in Missouri", "id": "70be203f-e276-47da-90f5-9f11fa5f2c87", "content": "ENGLEWOOD, Colo., Sept. 3, 2015 (GLOBE NEWSWIRE) -- . (NASDAQ:GEVO), has announced that Harbor Marina at Lake Pomme de Terre in Missouri is the first U.S. marina to sell gasoline blended with Gevo's renewable isobutanol at the pump.\n\nIntroduction of the initial isobutanol and gasoline fuel blend took place on Wednesday, Sept. 2 on the marina docks, as Gevo, Harbor Marina, boaters, and Mark Piatt, owner of fuel supplier Oil and Octane Shop gathered to celebrate.\n\nLake Pomme de Terre is located in one of the premier recreational boating regions of the country. Gevo is now working to strategically roll out its marine fuel blend to marinas on other lakes including Lake of the Ozarks and Table Rock Lake, as the company ramps up isobutanol sales to marine, outdoor equipment and off-road vehicle markets.\n\nOil and Octane Shop of Springfield, Missouri enabled testing of Gevo's isobutanol by supplying test blends to major marine engine manufacturers, such as Mercury Marine. Following the success of these tests, Oil and Octane Shop has been recommending the use of isobutanol to its marina customers, including Harbor Marina.\n\nIn June, the National Marine Manufacturers Association (NMMA) officially endorsed isobutanol as a drop-in fuel for marine and recreational boat engines. Gevo's bio-based isobutanol helps meet renewable fuel and clean air standards, while solving concerns that many boaters have with ethanol-blended fuels, which can damage internal engine parts.\n\nHarbor Marina owner Todd Spencer said he made the decision to offer isobutanol-blended gasoline to his recreational boating customers once he concluded that it would be a superior renewable fuel for their boats. Gevo's isobutanol is moisture resistant, does not cause phase separation and helps reduce engine corrosion. It is a highly stable, high octane marine fuel.\n\n\"My fuel supplier introduced me to the idea of blending Gevo's renewable isobutanol with the straight, ethanol-free gasoline my marina was previously offering,\" Spencer said. \"At Harbor Marina, we pride ourselves on providing the best in entertainment, food and beverages – and now we can add: the best-in-marine fuel.\"\n\n\"I thank the Harbor Marina team for helping us to launch the marine market for isobutanol in this key region of the country,\" said Dr. Patrick Gruber, Chief Executive Officer of Gevo. \"I look forward to seeing commercial marine sales of our proprietary biofuel increase dramatically when word gets out about the benefits of isobutanol as a clean, high-performing, renewable fuel source that boaters can rely on. It's fun to prove to people that biofuels can deliver high performance – it's a new paradigm.\" Gevo is a leading renewable technology, chemical products, and next generation biofuels company. Gevo has developed proprietary technology that uses a combination of synthetic biology, metabolic engineering, chemistry and chemical engineering to focus primarily on the production of isobutanol, as well as related products from renewable feedstocks. Gevo's strategy is to commercialize bio-based alternatives to petroleum-based products to allow for the optimization of fermentation facilities' assets, with the ultimate goal of maximizing cash flows from the operation of those assets. Gevo produces isobutanol, ethanol and high-value animal feed at its fermentation plant in Luverne, MN. Gevo has also developed technology to produce hydrocarbon products from renewable alcohols. Gevo currently operates a biorefinery in Silsbee, TX, in collaboration with South Hampton Resources Inc., to produce renewable jet fuel, octane, and ingredients for plastics like polyester. Gevo has a marquee list of partners including The Coca-Cola Company, Toray Industries Inc. and Total SA, among others. Gevo is committed to a sustainable bio-based economy that meets society's needs for plentiful food and clean air and water. Learn more at our website.", "source": "Wall Street Select"}