{"published": "2015-09-20T11:22:00Z", "media-type": "News", "title": "Popular novelist Jackie Collins passes away at the age of 77", "id": "f1f6590b-bbf6-4421-9931-c51d75b6cb31", "content": "Even after being diagnosed with cancer, she wrote five more books. Her latest, 600-plus-page novel, 'The Santangelos,' was published in June. The family statement said the writer lived \"a wonderfully full life and was adored by family, friends and readers. \n         \nJackie Collins, the renowned British-born novelist who penned best-selling novels such as Hollywood Wives and The Stud , has died in the US at the age of 77 after a long battle with breast cancer. \"It is with tremendous sadness that we announce the death of our beautiful, dynamic and one-of-a-kind mother, Jackie Collins, who died of breast cancer today,\" her family said in a statement on her death in Los Angeles. \n \nCollins, whose all 32 novels made it to the New York Times bestseller list, was diagnosed with stage-four cancer six-and-a-half years ago, her spokeswoman said. Her actress sister Joan Collins told media that she was \"completely devastated\" following the news of sister Jackie Collins. \n \n\"She was my best friend. I admire how she handled this. She was a wonderful, brave and a beautiful person and I love her,\" Joan, 82, said. In a career spanning four decades, Collins sold more than 500 million copies in 40 countries across the world. \nEven after being diagnosed with cancer, she wrote five more books. Her latest, 600-plus-page novel, 'The Santangelos,' was published in June. The family statement said the writer lived \"a wonderfully full life and was adored by family, friends and readers. \n \n\"She was a true inspiration, a trailblazer for women in fiction and a creative force. She will live on through her characters but we already miss her beyond words,\" it added. She began writing as a teenager, making up racy stories for her school-friends. Her first novel, 'The World is Full of Married Men', was published in 1968 and became a bestseller.  \n \nHer first novel 'The World is Full of Married Men' was published in 1968 and became a bestseller. It was, however, banned in Australia. In 1985, her novel 'Hollywood Wives' was made into a mini-series by ABC, starring Anthony Hopkins and Candice Bergen. 'The Stud' was her second novel published in 1969. ", "source": "DNA India"}