{"published": "2015-09-22T04:15:00Z", "media-type": "News", "title": "High schools: Volleyball notebook for Sept. 22", "id": "d271eba4-6348-44fd-9598-b647c21d6b5f", "content": "Volleyball Notebook \n\nAnother tourney title for Trojans: Class 6A No. 2 Jenks extended its winning streak to 16 matches with a 3-1 (22-25, 25-10, 25-20, 25-22) victory over third-ranked Edmond Santa Fe in the finals of the Jenks Invitational on Saturday. \n\nThe Trojans (22-2) beat Norman North, Chisholm and NOAH in pool play before advancing and beating Cascia Hall in the semifinals. \n\nIt’s Jenks’ second straight tournament title, after claiming the Bishop Kelley tournament crown on Sept. 12. \n\n“Having two tournament wins feels great, not because of the wins so much as the girls reaching two of their four goals they set early on in the season when we were at team camp,” Jenks coach Tanna Smith said. “I know my girls are excited as they hit milestone after milestone down their road to the state tournament.” \n \nJenks’ win over Edmond Santa Fe atoned for the Trojans’ 3-0 loss to the Wolves on Aug. 21. The two 6A powers will meet again Thursday at Frank Herald Fieldhouse. \n\nThe Trojans’ Anabella Pope was named the tournament’s most valuable player, and Jenks’ Maggie Hembree and Ally Stoner joined her on the all-tournament team. Cascia Hall’s Amanda Outlaw, Broken Arrow’s Makina Wratten, NOAH’s Malia Leatherland and Claremore Sequoyah’s Karlye Wagner also picked up all-tournament accolades. \n\nSilver for Lincoln Christian: Mount Saint Mary, ranked third in Class 4A, knocked off 4A’s top team, Lincoln Christian, 3-1 (25-21, 23-25, 25-19, 25-18) in the finals of the LCS Invitational on Saturday. The Bulldogs had gone 4-0 in tournament play before settling for second place. \n\n“We really played well this weekend, I thought,” said Lincoln Christian coach Zac Briscoe, whose team had beaten Mount Saint Mary 3-1 on Aug. 31. “We just didn’t play our best in the final, and Mount Saint Mary probably had a lot to do with that.” \n\nLincoln Christian is now 19-3 and will find out its regional tournament assignment Thursday. \n\n“We’ve played great all season, and we are off to our best start in school history,” Briscoe said. “But we need to retool some things and get better in the next few weeks to be ready for state.” \n\nMustangs charging hard: Okay missed out on last year’s Class 3A state tournament, and that didn’t sit well with the Mustangs, coach Belinda Clark said. \n\n“Losing at regionals last year by just three points served as a motivator for these girls,” she said. \n\nThe 3A No. 2 Mustangs have turned that inspiration into a 21-6 record with the playoffs fast approaching. Clark also alluded to another reason for success. \n\n“Having a court full of good hitters has also helped us,” she said. “We are not dependent on one or two. We can hit from anywhere.” \n\nAsked to point to a couple of key contributors, Clark couldn’t help but name nearly everyone on her team — hitters/blockers Karleigh McMahan, Kirstyn Anderson, Summer Milligan and Blake Judkins, setter Jade Hopkins, libero Macy Haley and junior varsity call-up, Emily Taylor. \n\n“To ask who is leading the way, I would have to say they all are,” Clark said. \n\nWe wouldn’t be where we are today without all of them together. They are all key players in our game.” \n\n— BEN JOHNSON, World Correspondent", "source": "Tulsa World"}