{"published": "2015-09-10T12:00:55Z", "media-type": "News", "title": "Feedzai Partners with Socure, Offering Joint Fraud Prevention Solution for Financial Institutions", "id": "f5dc5e19-dac8-49f8-ad2e-1b623ecfbec3", "content": "SAN MATEO, Calif. , and NEW YORK , Sept. 10, 2015 /PRNewswire/ -- Feedzai , a data science company that uses real-time, machine-based learning to analyze big data and minimize risk in the financial services industry, today announced a partnership with Socure , the industry leader in real-time online identity verification solutions. Working together, the two companies will provide their mutual clients with a \"plug-and-play\" solution that combines online and social data-based authentication with fraud risk scoring. \n\nFeedzai will incorporate the Socure Social Biometrics™ Platform as part of its Fraud Prevention That Learns™ software to provide ultra-fast processing of Big Data to minimize fraudulent transactions, chargebacks and reduce manual reviews costs for financial institutions. \n\nClick here to share this news on Twitter: http://ctt.ec/8aC9a \n\nFeedzai also announced updates to its software platform that provide improved risk management and fraud prevention solutions. Its powerful machine learning software is now being used for a variety of financial applications beyond transaction authorization, such as new account opening and loss prevention. \n\n\"Financial organizations today face many risks that were not present even a few years ago, like 'card not present' fraud and the large number of consumers who are creditworthy but credit history -poor,\" said Nuno Sebastiao , co-founder and CEO of Feedzai. \"At the same time, there is an enormous amount of data that these organizations can use, not only to provide better experiences for their customers and prospects, but to differentiate themselves in the marketplace as well. Over the last year, we've fine tuned our machine learning platform to help organizations manage risks and rationalize data output from various internal systems.\" \n\nWith the Socure partnership, online and social data becomes another source of data that Feedzai's software uses to detect fraud and minimize risks. Additional data sources used by Feedzai include session clickstream, access frequency, and malware signatures, among others. Feedzai's Fraud Prevention That Learns™ platform is now being used in the following cases outside of transaction authorization: \nMerchant Signup : Verifies, underwrites and monitors merchants against collusion and insolvency.  Account Opening : Works to onboard and verify new account applications and \"thin-file\" applications.  Chargeback Management : Prevents payment chargeback reversals, disputes, penalty fees or merchandise loss due to fraudulent sales.  Information Services : Performs advanced data visualization through its analytics platform.  Loss Prevention : Monitors internal processes and external data sources to protect against data exfiltration and employee collusion. \n\"The transaction fraud protection Feedzai provides for financial institutions is best of breed for the industry,\" said Sunil Madhu , co-founder and CEO of Socure. \"Social Biometrics from Socure is the perfect complement, making it even more powerful.  The power of the joint solution from Socure and Feedzai is the biggest innovation to the B2C identity lifecycle for some time to come,\" he added. \n \nAs instances of credit card fraud, identity theft, and related risks to financial payments systems continue to grow, the danger for private citizens, banks and other institutions takes an increasingly costly toll. Socure works to protect them by leveraging its patented Social Biometrics technology--at the cutting edge of analytics, machine learning, facial recognition and artificial intelligence. \n\nFeedzai Fraud Prevention That Learns™ technology fuses big data and machine learning to allow analysts to distinguish normal from abnormal behaviors, which can predict and prevent losses in real-time. The software uses complex event processing to aggregate and process high-volume streams of big data, including mobile and social data streams, to create deep learning profiles for each customer, merchant, location or POS device, product, with up to a three-year history of data behind it. This analysis and process helps acquirers, issuers, and retailers mitigate risk, guard every transaction, and preserve the customer experience. \n\nAbout Feedzai \n\nEvery day, the world produces petabytes of data, and Feedzai enables businesses to accurately analyze this information to keep their customers' data and transactions safe at any place in real-time. Customers use Feedzai's Fraud Prevention That Learns™ software to reduce risks associated with banking and shopping, whether it's in person, online or via mobile devices, by detecting fraud through deep historical and behavioral analysis of the organization's data. Feedzai's customers, consisting of payment networks, processors, banks, and retailers have found that Feedzai's machine learning software detects fraud by as much as 10 days earlier than other solutions and exposes up to 60 percent more fraud cases with lower false alarms, which can save millions of dollars in fraud loss. Feedzai is a global company with US headquarters in San Mateo , and is backed by OAK HC/FT, Sapphire Ventures, Data Collective and other international investors. For additional information, visit  http://www.feedzai.com . \n\nAbout Socure \n\nSocure ( www.socure.com ) is the leader in real-time online identity verification solutions. Its cloud-based solution allows enterprises to reduce third party identity and synthetic fraud, increase the acceptance of valuable customers and reduce the cost of compliance/manual review. Socure was founded in 2012 and is based in New York City . \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/feedzai-partners-with-socure-offering-joint-fraud-prevention-solution-for-financial-institutions-300140653.html \n\nSOURCE Feedzai", "source": "Ulitzer"}