{"published": "2015-09-29T15:53:00Z", "media-type": "News", "title": "Financial Advice From a Gambler", "id": "b5178c11-5763-4475-a447-aebba3ab6863", "content": "Some of the wisest words on financial planning this year come from a poker champion named Annie Duke . \nWhat, a gambler has anything worthwhile to tell investors? Isn’t that like Hannibal Lecter giving you tips on personal safety? Actually, her insights into human foibles, which she exploits to great success at the gaming table, are very helpful for managing your investments. \nDuke, who has won top honors at the World Series of Poker, gave a bravura presentation a few months ago to the Investment Management Consultants Assoc., or IMCA , in (where else?) Las Vegas. As Financial Planning magazine’s Scott Wenger wrote, channeling the famed Kenny Rogers song, “The Gambler ,” Duke shared her thoughts with financial advisors on “how to know when to hold ’em, know when to fold ’em, and how to advise clients who may want to walk away or run.” \nWhen she was younger, Duke pursued a Ph.D in cognitive psychology at Columbia University. She shucked the ivy-walled academic life for the world of felt-topped tables and cards, but used her knowledge of human behavior to great effect in the casino. As the Gambler tells Kenny Rogers: “I’ve made a life/Out of readin’ people’s faces/Knowin’ what the cards were/By the way they held their eyes.” \nAt first blush, financial planning seems far afield from poker. But that isn’t so. Both involve human psychology and guarding against bad luck. \nIf you had a soundly diversified portfolio during the 2007-09 financial crisis, when the Standard & Poor’s 500 slid almost 56%, your fall would have been far less severe. And if you sold all your stock in March 2009, which turned out to be the trough of the bear market, you missed an enormous run-up that obliterated your losses. \nBack in the Cold War, Pentagon strategists sought to find a game to model how to anticipate and counter Soviet actions, Duke told IMCA conferees. At first, the war planners favored chess due to its intricate moves. But then they settled on poker, owing to its dependence on psychology and its need for sussing out a host of unknowns. “Poker is a game of decision making under conditions of uncertainty over time,” she said. \nDuke ticked off numerous mistakes that investors make. One is to keep at a course of action because they already have committed a lot of money to it, even though the evidence suggests the odds of future success are low. Perhaps you’ve centered your investments on gold , despite its epic fall – almost 40% over the past four years. Absent an economic collapse or rabid inflation, a turnaround in the yellow metal is unlikely anytime soon. Too bad if you want to pay Junior’s tuition bill with your gold-trading profits. With gold, you should’ve folded ‘em. \nAnother common failing, Duke said, is failure to invest for the future – because seeing yourself years from now is difficult. “We actually don’t know our future selves,” she said. Since that person is a stranger, you direct all your financial decisions to meeting today’s wants and needs, tending to the person you know well: you, circa 2015. The retirement account gets short shrift. A good poker player thinks several hands ahead. \nShe noted that advisors strive to teach clients how to learn from such past mistakes. Advisors, she said, combat investors’ self-delusion. “If you credit all wins to your skill and all losses to bad luck, you never learn and never improve.” \nThe Gambler described his secret as “knowin’ what to throw away, and knowin’ what to keep.” \nHe and Annie Duke have much to teach us. \nFollow AdviceIQ on Twitter   at  @adviceiq .  \nAdviceIQ delivers quality personal finance articles by both financial advisors and AdviceIQ editors. It ranks advisors in your area by specialty, including small businesses, doctors and clients of modest means, for example. Those with the biggest number of clients in a given specialty rank the highest. AdviceIQ also vets ranked advisors so only those with pristine regulatory histories can participate. AdviceIQ was launched Jan. 9, 2012, by veteran Wall Street executives, editors and technologists. Right now, investors may see many advisor rankings, although in some areas only a few are ranked. Check back often as thousands of advisors are undergoing AdviceIQ screening. New advisors appear in rankings daily.  \n  \n  \n  \n  \n  \n ", "source": "Sun Current"}