{"published": "2015-09-29T15:31:08Z", "media-type": "News", "title": "SC to hear pleas seeking relaxation …", "id": "8e56a7c3-0070-4f0a-9fc4-b2b4885ae888", "content": "By | IANS India Private Limited/Yahoo India News  –  \nNew Delhi, Sep 29 (IANS) The Supreme Court will hear applications by the Gujarat government, the RBI, the SEBI and the UIDAI seeking modification of its order restricting the government - both at the central and in state level - not to insist on Aadhaar card except for the disbursal of food grains under PDS, and cooking fuel including kerosene and cooking gas. \n \nA bench of Justice J.Chelameswar, Justice S.A. Bobde and Justice C. Nagappan directed the listing of the applications for hearing on October 6 as senior counsel Shyam Divan appearing for the main petitioner opposing Aadhaar scheme said that the applications were not served on them and they knew nothing about their contents. \n \nDivan appeared for Karnataka High Court's former judge K.S. Puttaswamy, whohas contended that biometric data that was being collected for the issuance of Aadhaar card violated the fundamental right to privacy of the citizens as personal data was not protected and was vulnerable to misuse. \n \nAppearing for Gujarat government, senior counsel Harish Salve told the court that in 2015, it could not be anyone's case that privacy was not a right of a citizen. \n \nHe urged the court that August 11 order may be relaxed to permit the use of Aadhaar number for various socio-economic welfare schemes of the central and the Gujarat government on voluntary basis so that they reach the targeted people without delay. \n \nReferring to the six central schemes covered under different statutory regimes, the Gujarat government, in its plea, said that the court's earlier order permitting state agencies to link Aadhaar card for accessing food grains under PDS, cooking fuel, and kerosene recognised the right to food under the constitution's article 21 guaranteeing right to life and personal liberty. \n \nSimilarly, the state said that right to work under the rural job guarantee scheme, and right to receive old age or disability pension too should be treated at par to right to food as they too come under article 21 \n \nMarkets regulator Securities and Exchange Board of India, in its application, has urged the court to modify its order to permit it to use Aadhaar number in the securities market for the confirmation of address of the brokers and intermediaries under the Know Your Customer (KYC) scheme. \n \nSimilarly, the Reserve Bank of India has sought the modification of the order saying that if customers voluntarily shares their Aadhaar number, then they may be permitted to do so for the purpose of banking transactions. \n \nThe Unique Identification Authority of India in its application too has urged the court to permit it to issue Aadhaar number to the people who are voluntarily approaching it for the same. \n \nHowever, as court directed the listing of the matter for hearing on October 6, the bench raised the doubt whether it, now, had the jurisdiction to entertain the applications seeking modification of its August 11 order. \n \nThe bench by its August 11 order while issuing four directions saying that Aadhaar card could only be used for the distribution of food grains under PDS, cooking fuel, such as kerosene and LPG has referred all the petitions before it to a larger bench to determine whether right to privacy was a fundamental right. \n \nThe issue arose as the central government contended that right to privacy was not a fundamental right as it pointed to conflicting apex court judgments on the issue.", "source": "Yahoo! India"}