{"published": "2015-09-18T11:19:12Z", "media-type": "News", "title": "Nike Given a $116.00 Price Target at HSBC (NKE)", "id": "9677d69c-47a7-4335-96bc-ae478f8634c2", "content": "Equities researchers at HSBC set a $116.00 price objective on shares of Nike (NYSE:NKE) stock in a report issued on Friday, AnalystRatings.Net reports. The brokerage currently has a a “neutral” rating on the footwear maker’s stock. HSBC’s price target points to a potential upside of 0.63% from the stock’s previous close. \n\nIn other news, insider Trevor A. Edwards sold 97,345 shares of Nike stock in a transaction on Thursday, July 2nd. The stock was sold at an average price of $109.41, for a total value of $10,650,516.45. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which is available through the SEC website. \n\nA number of other analysts have also recently issued reports on the company. Sterne Agee CRT reiterated a “hold” rating on shares of Nike in a research note on Thursday. Susquehanna restated a “positive” rating and set a $133.00 price objective (up previously from $122.00) on shares of Nike in a research note on Thursday. Deutsche Bank raised their target price on Nike from $120.00 to $125.00 and gave the company a “buy” rating in a report on Wednesday. Vetr cut Nike from a “buy” rating to a “hold” rating and set a $118.31 price target for the company. in a report on Tuesday. Finally, B. Riley assumed coverage on Nike in a research report on Tuesday. They issued a “buy” rating and a $126.00 target price on the stock. One investment analyst has rated the stock with a sell rating, eight have assigned a hold rating and twenty-two have assigned a buy rating to the stock. The company presently has a consensus rating of “Buy” and an average price target of $117.22. \n\nShares of Nike (NYSE:NKE) opened at 115.27 on Friday. Nike has a 52 week low of $79.27 and a 52 week high of $117.72. The company has a 50-day moving average price of $112.50 and a 200 day moving average price of $105.66. The firm has a market cap of $98.60 billion and a price-to-earnings ratio of 31.15. \n\nNike (NYSE:NKE) last released its quarterly earnings data on Thursday, June 25th. The footwear maker reported $0.98 earnings per share (EPS) for the quarter, beating the Zacks’ consensus estimate of $0.83 by $0.15. During the same period last year, the firm posted $0.78 earnings per share. The business earned $7.78 billion during the quarter. The firm’s revenue was up 4.8% on a year-over-year basis. Analysts expect that Nike will post $4.20 EPS for the current fiscal year. \n\nThe business also recently announced a quarterly dividend, which will be paid on Monday, October 5th. Stockholders of record on Tuesday, September 8th will be issued a $0.28 dividend. The ex-dividend date is Thursday, September 3rd. This represents a $1.12 dividend on an annualized basis and a dividend yield of 0.97%. \n\nNIKE, Inc. (NYSE:NKE) is engaged in design, development, promotion and selling of athletic footwear, clothing, equipment, accessories and services. NIKE is a seller of athletic footwear and athletic apparel around the world. The Organization sells its products through NIKE owned retail stores and internet websites, to retail accounts. The Business concentrate its NIKE Brand product offerings in eight groups: Jogging, Basketball, Football (Soccer), Men’s Training, Women’s Training, Action Sports, Sportswear and Golf. Basketball and Men’s Training include its Brand Jordan merchandise offerings and United States soccer merchandise offerings and its baseball, respectively. The Company markets products designed for children, in addition to for other athletic and recreational uses, like cricket, lacrosse, tennis, volleyball, wrestling, walking and outdoor activities. The Organization operates in Western Europe, Central & Eastern Europe, North America, Greater China, Japan and Emerging Markets. \n\nReceive News & Ratings for Nike Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Nike and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News - Forex"}