{"published": "2015-09-28T11:12:17Z", "media-type": "Blog", "title": "Clarification on What Is Solar Technology", "id": "46908d52-924f-4b65-87a4-68700678ee00", "content": "The idea of ​​using sunlight as an energy source is not so new. In 1839, for the first time, this effect was discovered by Alexandre Edmond Becquerel. He found in some experiments with electrolytic cells that current flows are little more light than in the dark. However, it will still take some time before this discovery could be used in practice. \n \n1883 the first forerunner of today’s solar cells was developed, it was built by Charles Fritts. 1921 managed to Albert Einstein, the theoretical explanation of this effect, for which he received the Nobel Prize in Physics. Two years later, the effect could also be confirmed in an experiment, and so he also received a Nobel Prize. \n \nSolar technology \n \nSolar technology is constantly evolving ever since and always find new applications. The first systems were equipped with solar cells, US satellites were in the fifties, and now there are solar cells in the areas of daily life. Seventy years, in most calculators that has been used either as the only power source or in combination with a normal battery. In addition, solar technology has been used for several years for independent illumination of objects or buildings, or as a source of energy for street lighting and parking meters. Especially in the last decade is mostly in Germany are also increasingly used to produce electricity and hot water. All these methods, however, are based on the same technology. \n \nIf you could use all the energy of the annual solar radiation on the earth to produce electricity, which would be able to respond to 15,000 times the annual energy needs of humanity. This use, however, is practically impossible, but the figures clearly show the amount of energy that the sun can provide. Strikes sunlight in different wavelengths on earth. The range is very short light UV wavelength in the range of visible to infrared light in very long wave lengths of light. Some of this light can be used to produce energy without CO2 or other harmful gases. This occurs in solar cells, used to generate electricity. These cells are usually connected together in larger units, such solar modules. They only produce direct current, which can not be introduced in the normal diet. Before the direct current is converted by an inverter into alternating current so that the power supply is easily possible. \n \nThe development of solar technology \n \nToday, the development of solar technology is quite advanced, but there are still some problems in the production of solar cells at low cost. At present, these are not mass produced and production are not cheap. However, the current boom and the high market growth can, in the near future make manufactured by mass production and lower prices to come.", "source": "Latest solar news"}