{"published": "2015-09-07T05:02:15Z", "media-type": "News", "title": "Shocking image has changed\nthe mind of a government", "id": "9bbdf942-76b6-425c-baf4-ec5954d8ddbd", "content": "It’s an image that has changed the mind of a government. \n\nThe comparison couldn’t get any more stark: a toddler, Aylan Kurdi, whose family were fleeing for their lives from a regime in Syria that deals in persecution, torture and suffering, ends up dying to get to a resort where thousands of westerners spend their summer holidays.\n\nThat they had to rely on the human traffickers, the smugglers, to get them that far points to a family desperate to risk everything to find safe harbour. \n\nOnly the father survived and he, once released from a Greek hospital, will return to Syria to bury his wife and two sons before, presumably, trying for a third time to leave.\n\nJust telling the story in words should be enough to horrify right-minded people into accepting that these people are not camping at Calais or barricading themselves on trains in Budapest, or drowning in the Med, for nothing. \n\nThey are people who need help, desperately.\n\nSome have called for newspapers and broadcasters not to show that boy lying on the beach and some editors have instead used this picture of him being carried, tenderly, by a medic away from the water.\n\nLast week I wrote about publishing horrifying pictures in the wake of the Virginia journalists’ murders, wondering whether the last moments of a reporter’s life should be splashed across front pages in a sensational way. \n\nBut this picture tells a story, a story of something far more important, and has led to a call to change the government’s policy on allowing these refugees into Britain to find safe harbour.\n\nAnd, as a direct result of that one picture, the government has announced Britain will accept more refugees. \n\nIt’s too late to help Aylan, but perhaps others will now be saved from the water.\n\nIn the meantime, an author and good friend of mine has set up a fundraising page to send books, pencils and paper and bouncy balls to refugee children in Kos.\n\nI’d love it if you could have a look and maybe donate. \n\nThe link is: https://www.indiegogo.com/projects/send-a-book-to-a-refugee-child-who-has-nothing#/story", "source": "Portsmouth Today"}