{"published": "2015-09-16T01:17:48Z", "media-type": "News", "title": "Striking Seattle teachers to return to classroom", "id": "9acd926d-443a-4094-b221-caf95ba503df", "content": "SEATTLE  -- School will soon be back in session for more than 50,000 Seattle students after leaders of the teachers union voted to accept a new contract and end their five-day strike. \nThe union reached a contract agreement Tuesday with Washington state's largest school district. The Seattle Education Association Representative Assembly voted Tuesday evening to end the strike and recommended its members ratify the contract. \n\nThe union says Wednesday will be a work day for all district employees, and students could return to the classroom as early as Thursday. \n\nUnion leaders have emailed details of the deal to all SEA members, and a general membership and ratification meeting is set for Sunday. \n\nThe agreement addresses major sticking points around pay, testing, student equity, teacher evaluations and length of the school day, Knapp said at a news conference. He declined to provide other specifics, saying he was waiting for the teachers to review it. \n\n\"This is great news for our 53,000 students. We are eager to open schools, welcome students and begin learning,\" district Superintendent Larry Nyland said in a statement. \n\nThe teachers walked out Sept. 9, delaying the start of the school year. They complained that living expenses have become unaffordable as the city's high-paid technology industry booms and they have gone six years without a cost-of-living increase. The district provided raises totaling 8 percent out of local levy money in that time. \n\nThe district is preparing for school to resume Thursday, Seattle Public Schools spokeswoman Stacy Howard said Tuesday. \n\nSchool librarian Sean Harvey picketed Tuesday outside Loyal Heights Elementary, saying he and his colleagues want to go back to work, but \"it isn't over until it's over.\" \n\nSeveral hundred parents, children and other supporters waved signs and chanted as they walked nearly 2 miles from Seattle's Pioneer Square to school district headquarters Tuesday in a previously arranged march to support teachers. \n\n\"I'm really ready for school. It's been boring,\" said Tyler Simpson a senior at Nova High School who joined the march. \"I stand by teachers. They should get raises. They're a hugely important part of our society. They deserve more.\" \n\nThe Seattle City Council also threw its support behind the striking educators, passing a resolution Monday recognizing the union. \n\nPay has been a big sticking point. The union made a counterproposal over the weekend that called for raises totaling 9.75 percent over two years - far less than the 21 percent over three years they initially sought. \n\nTeacher salaries in Seattle range from about $44,000 to more than $86,000, depending on experience and education. \n\nThis year, lawmakers - facing a court order to increase spending on education - came up with money for new teachers and supplies. Some $37 million of that will go to Seattle. The district says it has offered raises totaling 14 percent over three years - including cost-of-living adjustments from the state - but it also wants to extend the school day by 20 minutes, arguing that Seattle has one of the shortest instructional days in the state, at 6 hours and 10 minutes. \n\nThe union said the proposal would have forced teachers to work that extra time for free. Over the weekend, the district offered to pay teachers for the added instructional minutes, Howard said. The union proposed studying the pros and cons of an extended school day. \n\nSome teachers and parents said they were eager to see what's in the deal. Jeanne Bastasch, a physical education teacher at Greenwood Elementary, said she won't vote for just anything. \n\nParent Heather Dachary joined the picket line at that school Tuesday with her two children and said teachers shouldn't have to. \n\n\"I really want my kids back in school, but I want it done fairly,\" she said.", "source": "KOMO 4"}