{"published": "2015-09-16T06:04:00Z", "media-type": "News", "title": "September 16, 2015 Success of Aussie at global third gender beauty pageant; dedicates her performance to trans* youth Read more", "id": "3c227b7b-00e1-4ad3-a111-99f81db3d9e9", "content": "Ella Collins, winner of Miss Fa’afafine Australia 2015, Sydney PHOTO: THE first-ever Australian contestant to compete in a unique global third gender beauty pageant has claimed second place at the contest. \n \nElla Collins, from Merrylands in western Sydney, nabbed the runner-up position earlier this month at the annual Miss Fa’afafine international competition, held in the Samoan capital Apia. \n \nFa’afafine, which in Samoan means “in the manner of women”, are biologically male but commonly express female identities and are generally considered to be a distinct non-binary gender. \n \nIn a Facebook post after the event, which attracts contestants from across the Pacific, Collins said it was the “best experience” she had ever had: \n \nCollins, who has a background in dance, won a place at the finals after taking out the crown last month at the inaugural Miss Fa’afafine Australia contest held in south western Sydney. \n \nThe pageant included traditional rounds such as swimwear and eveningwear but also featured elements like a round focused on traditional Samoan dancing. The competition is also known for the flamboyance and creativity of its costumes. \n \nCollins took many of the routines she premiered in Sydney, including a high energy and tongue-in-cheek performance mixing Beyoncé and a traditional war dance, to Samoa. \n \nIn Sydney, Collins wowed the judges when she said that she hoped her success would be a positive example to young trans* people. \n \n“I’m just all about saving lives and knowing there is a high suicide rate among transgenders I want to be an advocate to stop that and bring awareness to help those kids,” she told the Star Observer at the time. \n \nThe overall crown was taken out by New Zealand’s entry, Steve Auina, who had previously won the Miss Auckland Fa’afafine completion. \n \nWatch the video below of highlights from the event in Samoa: \n \n[embedded content] \n \nIn this month’s Star Observer magazine, out on Thursday, we go behind the scenes with Ella Collins and the other contestants at this year’s Miss Fa’afafine Australia to explore the fa’afafine culture.", "source": "Sydney Star Observer"}