{"published": "2015-08-28T15:51:26Z", "media-type": "Blog", "title": "The GATE’s Interview Lounge at TIFF 2015 | Omni King Edward Hotel & Awake Chocolate", "id": "1d939719-9418-4f70-8d43-ff22865db375", "content": "TORONTO (August 28, 2015) – The GATE is pleased to announce that its Interview Lounge at TIFF 2015 will be hosted at the Omni King Edward Hotel from September 10 to September 14. Located in the heart of Toronto, and just steps away from key attractions and entertainment and dining, the Omni King Edward Hotel represents luxury, style, and a VIP experience for The GATE’s guests during the 2015 Toronto International Film Festival. \n \nFeaturing brand partnerships with Parrot and The Macallan Single Malt Scotch Whisky , The GATE is also pleased to welcome Awake Chocolate to the lounge: the perfect treat for when you gotta get stuff done, and just don’t have the energy to do it. \n \nThe GATE’s Interview Lounge at TIFF 2015 will complement the online entertainment magazine’s TIFF 2015 coverage, including interviews, reviews, and news coverage throughout the 11 days of the 40th anniversary of the festival. \n \nTo schedule a visit to the lounge, or for brand opportunities, please contact W. Andrew Powell, editor@thegate.ca . \n \nFollow The GATE’s TIFF 2015 coverage, and watch for special giveaways, at www.thegate.ca/tiff-2015 . \n \nAbout Omni King Edward Hotel: \n \nThe Omni King Edward is Toronto’s first luxury hotel, welcoming guests since 1903. The hotel was originally designed by Chicago architect Henry Ives Cobb and Toronto architect E.J. Lennox. Located in downtown Toronto, it offers a blend of old-world charm with modern furnishings and amenities. With over 300 rooms, 22,000 sq. feet of meeting space, two restaurants and luxurious on-site services (salon and spa, tailor, café, and fitness centre), it caters to those who enjoy fine experiences. \n \nAddress: 37 King St. E, Toronto, ON M5C 1E9 \n Phone: Main: 416-863-9700; Concierge: 416-863-4110 \n \nWebsite:  http://www.omnihotels.com/hotels/toronto-king-edward \n Twitter:  @KingEddyHotel \n Facebook:  @OmniKingEdward \n Instagram:  @omnikingedward \n   \nAbout Awake Chocolate: \n \nHere’s the deal–we’ve packed these delicious new Awake chocolate bars with as much caffeine as a cup of coffee (or a 250ml energy drink). Perfect for when you gotta get stuff done, and just don’t have the energy to do it. \n \nWebsite:  http://awakechocolate.com/ \n Twitter:  @AwakeChocolate \n Facebook:  @Awakechocolate \n Instagram:  @awakechocolate \n   \nAbout The GATE: \n \nFounded by W. Andrew Powell in 2000, The GATE celebrates its 15th anniversary covering film , television , music, gadgets, style, culture, and events this November. In that time, The GATE has enjoyed contributions from a number of journalists and authors, with coverage of numerous major festivals and events, including the Toronto International Film Festival, the Juno Awards , Canadian Music Week , North by Northeast, Sundance, E3, and CES, just to name a few. \n \nWebsite:  http://www.thegate.ca \n Twitter:  @TheGATE \n Hashtag:  #GATELounge \n YouTube:  @TheGATEmag \n Instagram:  @TheGATEmag \n Facebook:  @TheGATEMagazine \n \nThe post The GATE’s Interview Lounge at TIFF 2015 | Omni King Edward Hotel & Awake Chocolate appeared first on The GATE .", "source": "The GATE"}