{"published": "2015-09-29T01:00:02Z", "media-type": "Blog", "title": "'Gotham' Reference Guide 2x2: Nothing More Contagious Than Laughter", "id": "2d362c68-ab1b-4e3a-ae32-5e656d4f9da0", "content": "Is this Ra’as al Ghul and the Joker? MAYBE. (photo: Nicole Rivelli/FOX) Let’s talk about Jerome Valeska. After all, that’s all Gotham seems to want to talk about. Have you seen the promotional materials? Or any of the trailers? Or TV spots? Or, you know, watch one or two episodes from Gotham‘s second season? Gotham creator Bruno Heller and Co. are really, really proud of their little red-haired, wide-grinned villain it seems, and it’s becoming a little grating. “Nothing more infectious than laughter,” indeed. Not to say Cameron Monaghan isn’t currently winning Scenery-Chewer of the Year right out from under Jessica Lange’s torture-porn leg-stumps. After a, ahem, less than complimentary first impression of his performance, I’ve learned to appreciate Mr. Monaghan’s performance. At the very least, he’s great at doing other actor’s Joker. I’m not sure he’s brought one unique tic or trait to the character, but if you were looking for a perfect amalgam of Jack Nicholson (the smile), Mark Hamill (the low laughs), and Heath Ledger (literally everything else), boom you got it. And at the very best, Monaghan is most definitely going for it. Actually, as I pointed out last week, that seems to be the theme of season two — just throw bat-shit at the wall and see what sticks. Trying to burn a bus full of cheerleaders alive? Russian roulette? Cannibalism? Mass shootings? A villain team-up named the Maniax, a name I’d think was cool as hell if I happened to still be in 4th grade? Check, check, check to everything, and then some. For the record, though, I love this tactic. Love it. It’s almost like watching an entirely different show, a show that isn’t concerned by wowing you with serious, gritty comic book stories and instead throws a vaguely clown-shaped fist into your face for 40-something minutes. But the worry here is that Gotham becomes so off-the-wall, that the actual storytelling of the entire thing falls entirely to the wayside. I watched “Knock Knock” twice and the second viewing, where I paid closer attention, was not flattering. Underneath the madness is a narrative laziness, an assumption that if Gotham can distract you with loud bangs and bright lights, you won’t notice that nothing makes sense. The show has become a fun, but insane, train ride, but that train is dipping dangerously close to running completely off the tracks. Here are just five examples of some plot-points that are unforgivably lazy: The fact that Bruce Wayne and his most trusted confidante Alfred have a massive falling out, Bruce fires Alfred and banishes him from Wayne Manor, and the two have a reconciliation — all over the course of a half an hour. Harvey Bullock’s advice to Jim: “Those lunatics specifically chose that shipyard.” Uh, no they didn’t? Why does he think that? They robbed exactly one shipyard. Robbing one out of one shipyards is not a pattern, or a motive. The “detective work” on Gotham has always been weak, but this wasn’t even an attempt. What saves the bus full of cheerleaders from a fiery doom? A lighter failing to work….twice. After, I don’t know, three or four MASS SHOOTINGS, why doesn’t the GCPD station have better security? AND WHO LET THAT 13-YEAR OLD MILLIONAIRE ON TO THE CRIME SCENE OF A MASS SHOOTING? Just… come on, Gotham. I love ya’. But take a chill pill for ten seconds. Just ten seconds. Check your work. Dot your I’s, cross your T’s, and maybe spell Maniax correctly, and then you wouldn’t have a spare body to throw off the roof. Just saying. As always, let’s run down every reference, fact, and nugget of Bat-history brought up season two, episode two,” Knock, Knock.” Alfred and Luscious Fox This isn’t so much a reference as it is a fun little tid-bit. The last time I caught up with Sean Pertwee, he said the first time he performed this (fantastic) scene was years ago, as part of his audition for Alfred Pennyworth. The problem was, due to the secretive nature of Gotham‘s casting process no one could tell Mr. Pertwee he even was playing Alfred Pennyworth. The only direction given for the audition was “a Brit walks into an American bar and has a conversation.” An entire season later, and London native Bruno Heller finally saw the opportunity to plant the Alfred-audition dialogue into a Gotham scene. Also, I noticed this scene was filmed in The Campbell Apartment, which is a speakeasy in Grand Central Station. So, if you did not know there was a speakeasy in Grand Central Station, there you are. The Maniax The reference here is that the name Maniax is lame as hell, but it could have been even lamer. There isn’t a Maniax in DC comics history, but there is a Maniaks. The Maniaks are a fictional rock band modeled off Te Monkees and appeared in four 1967 issues of Showcase. They looked like this. If you click that picture and wonder “gee that guy in the cover looks like Woody Allen,” it’s because that is Woody Allen. For some reason, probably having to do with a substantial amount of drugs, author E. Nelson Bridwell decided The Maniaks needed to interact with the real life Woody Allen. The Death of Sarah Essen So, Gotham actually did it. It killed off a character that, in comics canon, actually grows old and meets an adult Batman. It would have been awkward, though, because comics Sarah Essen is a love interest to Jim Gordon, and Gotham Jim Gordon is super busy dating homicidal murderers and the IRL mother of his child. Strictly talking death, though, Sarah Essen has a terrible track record when it comes to Joker run-ins. In 2000 The Joker murdered Sarah in Detective Comics #741, pictured here in this REALLY, REALLY disturbing comic book panel. Um, is Barbara the Joker?  Okay, so…bear with me. I first floated this idea casually after the season one finale. ComicBook.com’s Lucas Siegel posed the question a week ago. It…kind of makes sense. I know Jerome is around, but as a #swerve, there is evidence for Barbara jumping in as a last minute future-Joker. There was her sudden, drastic turn to the homicidal side last season. Then she mocked Jim this episode with “You could always make me laugh!” In the alleyway, after Aaron Helzinger gives Jim a beating, Barbara lands a kiss on Jim’s bleeding forehead. When she sits up, the blood totally resembles sloppily applied red lipstick, underneath a wide, psychotic smile. What I’m saying is — If the Frank Miller, Dark Knight Returns Joker just happened to be a bisexual blonde woman, he’d rock that exact white jacket and red gloves combo Barbara wore in the GCPD station.", "source": "Observer"}