{"published": "2015-09-22T20:11:51Z", "media-type": "News", "title": "WebMD To Webcast Annual Meeting Of Stockholders", "id": "444e4e24-bcdf-49ba-a651-a389bea53335", "content": "SOURCE WebMD Health Corp.\n\nNEW YORK \n\nAt its Annual Meeting of Stockholders, David Schlanger \n\nInvestors can access a live audio webcast of the meeting at www.wbmd.com (in the Investor Relations section). A replay of the webcast will be available at the same web address.\n\nAbout WebMD \n\nWebMD Health Corp. (NASDAQ: WBMD) is the leading provider of health information services, serving consumers, physicians, healthcare professionals, employers, and health plans through our public and private online portals, mobile platforms and health-focused publications. \n\nThe WebMD Health Network includes WebMD Health, Medscape, MedicineNet, eMedicineHealth, RxList, Medscape Education and other owned WebMD sites and apps.\n\n***************************** All statements contained in this press release, other than statements of historical fact, are forward-looking statements, including those regarding: our future financial results, operational performance and sales; market opportunities, trends or momentum and our ability to capitalize on them; and the benefits expected from new or expected contracts with customers, new or updated products or services and from other potential sources of additional revenue. These statements speak only as of the date of this press release, are based on our current plans and expectations, and involve risks and uncertainties that could cause actual future events or results to be different than those described in or implied by such forward-looking statements. These risks and uncertainties include those relating to: market acceptance of our products and services; our relationships with customers and other factors affecting their use of our services and the timing of entry into and implementation of specific contracts with customers, including regulatory matters affecting their products and services; our ability to deploy new or updated services and to create new or enhanced revenue streams from those services; our ability to attract and retain qualified personnel; and changes in economic, political or regulatory conditions or other trends affecting the healthcare, Internet and information technology industries. Further information about these matters can be found in our Securities and Exchange Commission filings and this press release is intended to be read in conjunction with information contained in those filings. Except as required by applicable law or regulation, we do not undertake any obligation to update our forward-looking statements to reflect future events or circumstances. ***************************** WebMD®, Medscape®, CME Circle®, Medpulse®, eMedicine®, MedicineNet®, theheart.org® and RxList® are among the trademarks of WebMD Health Corp. or its subsidiaries.\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/webmd-to-webcast-annual-meeting-of-stockholders-300147292.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "CW Richmond WUPV"}