{"published": "2015-09-18T14:15:20Z", "media-type": "News", "title": "Advertising drives the nation's true sport", "id": "f726b750-279f-4497-affa-223765d2838c", "content": "Events in Canberra this week seem to have been like a national sport: a series of own-goals, captain's picks, head high tackles, even a shirtfront or two. Events in Canberra this week seem to have been like a national sport: a series of own-goals, captain's picks, head high tackles, even a shirtfront or two. A lot of blue ties running at each other.\n\nAnd then, towards the end of the game, a score correction in which the February result was reversed leaving a few injured players on the bench. \"Not the front bench, surely,\" says Louise.\n\nBut the real sport in September is not who will be prime minister, even though we've now had five in five years.\n\n\"It sounds ridiculous when you see it in print,\" says Charlie.\n\nAnd some of my overseas friends think it's our new annual event.\n\nThe real sport in Australia in September is the two great football codes. It's finals time and we are quite rightly more worried about who's going to take out the AFL or NRL premiership rather than who's standing in front of the national flag making grave announcements to the press gallery.\n\nUltimately sport rules over politics, despite what the pollies might think, and my background in advertising tells me that sport is a lot more than just fun and games.\n\nWhen I left the industry just two years ago, Australia had the highest per-capita advertising spend in the world. For less than 1 per cent of the world's population, we had more than 5 per cent of the advertising share, making our market bigger than France with nearly three times our population.\n\nAnd advertising drives the business of sport.\n\nHuge numbers will be tuning into the great sporting stadiums across the country rather than the national capital. Our love of sport is legendary but the truth is that it's also true in the United States where the news has just come out that sport accounts for 37 per cent of broadcast TV advertising and more than one third of the giant US advertising spend goes into the sports programs of the ABC, CBS, NBC and Fox.\n\nThat's a 35 per cent increase from five years ago. The biggest of the networks, CBS, raked in US$2.8bn ($3.8 billion) up 11 per cent on the previous year making its sports broadcasting revenue bigger than the entire Australian television industry.\n\nThe big advertisers are dominating screens between the plays. The biggest spenders are automotive, telephone and insurance companies plus the beer brands.\n\nLast year, the biggest in the US was Chevrolet, spending nearly half a billion dollars in sports. It's a sign of what's going to come here in Australia.\n\nAnd the football codes are winning, the AFL announced a deal worth US$2.506 billion over 6 years. And the . How big are sports on Australian television? At the end of last year, figures show that 15 of the top 40 free to air TV shows were sports programs and of the top five, four were sports. The two State of Origin matches were numbers one and two followed by the Rugby League Grand Final. My Kitchen Rules was fourth and the AFL Grand Final fifth.\n\nThe other great sporting events followed including The Australian Open and the presentation of the Melbourne Cup. Free to air sports is regarded as a national right and attracts huge audiences with the top program getting 4.25 million viewers.\n\nThe TV industry is aware of the international figures and what's happening with advertisers. I'm told that the advertising sports share of Australian television has doubled in the last several years but is still behind the United States. But it will get there.\n\nFoxtel makes a notable contribution to Australian news and other programming but its top 40 programs are all sport.\n\n\"Wow,\" says Louise, \"blokes are mad about sports.\"\n\nBut the truth is that it's not just the blokes. It draws in the whole family, largely because it's often live and no one can pick the result.\n\n\"So it's really no different to the race for prime minister,\" chirps Charlie.\n\nWell there sure are plenty of similarities, but the teams in Canberra would do well to remember that Australian sports followers know that changing captains halfway through a game is going to make a win pretty difficult to achieve. In fact, they would never do it.\n\nThe story first appeared on The Sydney Morning Herald.", "source": "Southern Highland News"}