{"published": "2015-09-01T17:33:09Z", "media-type": "News", "title": "Book Notes: Memoir of an undocumented scholar", "id": "3d91810f-8f60-4a1e-9458-6217ff786b45", "content": "“Undocumented: A Dominican Boy’s Odyssey from a Homeless Shelter to the Ivy League,” by Dan-el Padilla Peralta. Penguin Press, New York, 2015. 312 pages. $27.95. Dan-el Padilla Peralta’s journey from the Dominican Republic to the United States when he was 4 years old was intended to be one leg of a round-trip. But his mother’s complicated pregnancy kept the family in New York City longer than expected. By the time she was well enough to return to Santo Domingo with Dan-el, his father and new brother Yando, she reconsidered. They would stay put, she said, in part for the sake of the children’s educations. People had begun to notice that Dan-el was an exceptionally bright and motivated boy. “Undocumented: A Dominican Boy’s Odyssey from a Homeless Shelter to the Ivy League” is Peralta’s memoir about being a gifted but undocumented student. He is a young scholar now, teaching the classics at Columbia. His book will speak for the many who, because of their illegal status, dare not speak for themselves. “Undocumented” is far from a political screed. Peralta lets his personal narrative — told with an attractive mix of youthful bravado, humor, humility and angst — illustrate the human side of the immigration issues we have yet to resolve in the United States. Peralta portrays himself as a thoughtful, fun-loving, intellectually curious student with a competitive drive. But he is made uncharacteristically cautious by circumstance. It isn’t until he is a senior at Princeton that he finds the courage to tell his friends about his undocumented status. Peralta’s story can be read as a chronicle of one smart student’s acquisition of an education. But it plays out against the backdrop of homelessness, inhospitable shelters, poverty, fear and lack of papers. Because Peralta is so gifted, his situation can’t be viewed as emblematic of the problems immigrants confront. He lived a double life, moving adroitly between prep school and public housing, between hours immersed in the Greek and Roman classics in America’s most hallowed educational institutions and the private, agonizing hours spent facing the dire implications of his undocumented status. Despite his rarified experiences in academia, reality bore down and began to strangle his options, one by one. Of course he couldn’t be a work-study student and get a paycheck because he had no Social Security number, nor could he leave the country for junior study abroad. If he were to take advantage of the opportunity to study at Oxford, he might not get back into the United States for 10 years. He says, in a recent interview on CSPAN, that his early memories are infiltrated by foreboding, anxiety, unease and dislocation. Page 2 of 2 - Many generous people stepped up to help Peralta, beginning with a young photographer named Jeff who spotted the young boy’s intelligence and who initiated a number of strategic measures to help him gain admission to Collegiate, a lauded prep school in New York City. Peralta did his part. He worked hard as a student ultimately moving from prep school through Princeton, Oxford and Stanford. He studied and mentored over summer vacations, feeling energized by learning, steeped in gratitude and humbly indebted. According to the CSPAN interview, he is still not a fully legal resident. Peralta’s story is significant and universal because he has been an exemplary member of society. He, like most immigrants, is not bent on exploiting the system. He is part of this society that he has life bonds with, and he offers his own unique contributions. As a teacher and mentor of the young, he touches many lives every day. In the Epilogue, we learn that many undocumented students contact him with questions about how to gain legal status. He knows his example is not easily transferable, but there is something about his persistence that is. And Peralta’s example, however special, resonates with the kind of gumption and hopefulness that we recognize as the American spirit. Even with the support of former President Clinton and George W. Bush, among others of high esteem, Peralta has been denied a clear path to citizenship. “Undocumented” leads readers to wonder: What about all the other immigrants, those who do not learn Latin and memorize Whitman? New York, where Peralta lived as a child and lives now, is a beautiful example of the depth of riches derived from a diverse and lively population. Peralta’s “Undocumented,” set primarily in New York City, brings this wealth of talent to life for those who choose to see it. From the vantage point of “Undocumented,” the hurdles for immigrants are daunting and depressing. Even presidents cannot make exceptions to a problem locked down and frozen by Congress’s resistance to negotiate despite our citizens’ demands to find fair and humane solutions. We as a people cannot seem to break free from the hatred, prejudice and absence of generosity. Yet Peralta finds wisdom and comfort in the humanities he now teaches, and whose lessons he shares in “Undocumented.” People like Peralta are part of the solution. Rae Padilla Francoeur’s memoir, “Free Fall: A Late-in-Life Love Affair,” is available online or in some bookstores. Write her at rae.francoeur@gmail.com. Read her blog at freefallrae.blogspot.com or follow her on Twitter @RaeAF.", "source": "Waynesboro Record Herald"}