{"published": "2015-09-14T05:00:07Z", "media-type": "Blog", "title": "First Sentences In (Fan)Fiction the 7th", "id": "ad48adf4-2bc8-479c-9c2d-33d53088fbd6", "content": "The mini-hiatus is over, but I must admit that Canterlot Boutique didn't do much for me.  It certainly wasn't a bad episode, but I couldn't make much of the message behind it.  Or the economics; how is Rarity planning to support both the Canterlot and Ponyville stores with only stuff she makes?  I've seen other people suggest she'll be able to support herself with a \"unique designs only\" policy based on the last part of the episode, but I don't buy it; her manager sold 100 Princess Dresses at full price in less time than it took Rarity to unload five original designs, and those five were all at sale prices to boot.  Seems to me that Canterlot Boutique isn't long for this world, unless Rarity either learns to embrace mass production and a designer role for herself in her fledgling empire, or closes down the Ponyville branch to focus on supporting a single store.\nOr maybe the Magic of Friendship will prove as effective at handling unsustainable business practices as it is at vanquishing unbeatable monsters.  Yeah, probably that one.  Anyway, click down below the break for my thoughts on the first sentences I've read recently! As a reminder, the first sentences here are being judged as first sentences, using my patented HEITSIBPMFTSIATRAEMTCR (\"how effective is this sentence in both preparing me for the story I'm about to read, and encouraging me to continue reading\") scale.  On that scale, a five equates roughly to \"immediately evokes a specific tone, prepares the reader for the rest of the story, and encourages me to continue reading,\" a one is \"makes me less likely to continue reading,\" and a three is \"a perfectly adequate first sentence, which neither inspires great excitement or great dread.\"  For each story, I'll give the title with a link to my review of it, and the star rating I initially gave that story.    Additionally, we're changing the format in a few ways this week: first, I'll be clarifying that the rating after the title is the original rating I gave to the story, and second, the review of the sentence will be split into two parts.  The first part will be my thoughts after reading ONLY the first sentence, and the second, my thoughts on it after having read the story, graded as BETTER, WORSE, or THE SAME when taken in its larger context.    Oh, and if you still don't like the format... well, let's just say you'll want to make sure to check out Wednesday's post! Of Apples and Roses and Thick Purple Proses, by Ravensdagger (story: 2 stars)\nThe first sentence:  The mare focused. Initial thoughts:  What this lacks in detail or scene-setting, it makes up in succinctness.  It's a very forgettable first sentence, but it pretty much demands that the reader continue on to the next one (the next paragraph, in fact, as this sentence stands alone at the start of the fic).  As such, I'd call this an unremarkable but nonetheless effective first sentence.  Three stars. After reading:  The fact that the sentence sets up the mare's accidental destruction of a century-old bonsai tree leaves a sour taste in my mouth, I must admit.  It's a \"sad funny\" sort of thing; a scene played as slapstick, but which ends up feeling too tragic for its own good.  The first sentence, in context, also becomes one of a number of similar emphasizers, showing how careful she's trying to be (and then failing due to her \"friend\"'s antics).  In the end, further reading makes it WORSE. Mortality Report, by Bad Horse (story: 3 stars) The first sentence:  While pacing back and forth along the length of the castle's finest guest room, Princess Celestia paused in mid-stride, her attention caught by the full moon. Initial thoughts:  There's certainly nothing wrong with this sentence in terms of construction or prose... but it's an awfully generic sentence nevertheless.  \"Celestia looks at the moon\" is, at least in the context of an MLP fandom where stories about Celestia and Luna's relationship are a dime a dozen, a total non-event in terms of engendering reader interest, and the one noteworthy detail (that Celestia's in a guest room, rather than hers, her sister's, or the like), is easy to gloss over.  Still 2 stars, as it's hardly a bad first sentence; it's just unmemorable and general.\nAfter reading:  It turns out that the first sentence is part of a double-fake.  The first fake is in presenting a \"normal\" situation, before revealing that somepony is dying.  This is also the expected (and very common) fake.  The second, unexpected one comes when we discover that the story isn't about Celestia saying goodbye to a dying Twilight, but something else entirely.  I'm still not convinced I can say it's great in the context of a first sentence--you have to get to that second fake before there's any payoff, and that's a good dozen paragraphs into the story.  Lots of readers will give up on something that looks boring after the first dozen paragraphs, and what I'm trying to judge here isn't whether the story is good, but whether that first sentence is effective in and of itself.  Still, it certainly looks BETTER in context.\nPirates for a Day, by Dawnfade (story: 1 star)\nThe first sentence:  Trees are strange things.\nInitial thoughts:  I like this a lot.  It's the sort of slightly odd, eye-catching statement that gets one's attention without resorting to excessive zaniness or gore or the like.  It's not particularly quotable, but it's reasonably memorable and draws a reader in.  4 stars.\nAfter reading:  I don't think I mentioned this in my review, but the first few paragraphs of Pirates are quite nice, promising something a bit more thoughtful (but still fluffy) than the story delivers (it being pure, unadulterated fluff).  Tense issues notwithstanding, the explanation for the strangeness of trees definitely sells the story to come as a friendly, accessable story of the sort that leaves one's heart just a little warmer for having read it, and if the rest of the fic doesn't deliver, that's outside the purview of a first sentence to fix.  If anything, the first sentence looks BETTER as part of that introduction.\nThe Monster in the Twilight, by Georg (story: 3 stars)\nThe first sentence:  Princess Celestia paced the quiet paths between buildings in her School for Gifted Unicorns, trying not to display the nervous tension that ate at her soul.\nInitial thoughts:  Compare this to the first sentence from Mortality Report, which also features Celestia pacing (doing these posts has made me more aware of first sentences in general, and I've noticed that \"Celestia pacing\" is all over this fandom's first sentences).  On the plus side, the setting and her explicit nervousness give the reader something to immediately latch onto that falls outside what might be considered her \"ordinary\" set of locations and moods.  On the downside... \"the nervous tension that ate at her soul\" sounds really hokey, and feels overwrought and almost silly without context.  I'll go 2 stars for this, since it's triggered a warning bell or two in my head.\nAfter reading:  Turns out that sentence leads straight into some old-school \"Celestia angsts over Luna's banishment,\" which doesn't really excite one to continue.  On the other hand, the reason why Celestia's so nervous makes sense in context, enough that \"ate at her soul\" might not even be overstatement.  Still, this one feels about THE SAME to me after reading further.\nTyrant, by PaulAsarian (story: 1 star)\nThe first sentence:  There was a knock on the throne room doors.\nInitial thoughts:  This falls into the same \"unremarkable but effective\" catagory as Of Apples etc.'s first sentence.  I... don't really have much to say beyond \"this does what it sets out to do, without being otherwise exceptional.\"  On my scale, that's the definition of 3 stars.\nAfter reading:  It's THE SAME.  I mean, it goes exactly where \"There was a knock on the throne room doors\" has to go: we find out who's knocking, who our viewpoint character is, and proceed from there.  It's still perfectly fine for what it is.\nI'd Do Her, by Fire Gazer the Alchemist (story: 1 star)\nThe first sentence:  Rainbow hovered mere feet away from an immensely sweaty Applejack.\nInitial thoughts:  I like that this highlights and contrasts the salient attitudes toward work of Applejack and Rainbow Dash (a belief in the value of manual labor, and an intense focus on flying) entirely through their physical descriptors.  For a SoL/Comedy story called I'd Do Her, that probably constitutes overthinking, but there you go.  Anyway, another 3 star sentence in my book, giving us characters and some small context without being otherwise noteworthy.\nAfter reading:  The weird fixation on AJ's sweatiness through the opening scene feels almost fetishistic, which casts that first sentence in an unfortunate light in retrospect.  Reading on definitely makes this one WORSE.\nThe Life and Times of a Winning Pony, by Chengar Qordath (story: 2 stars)\nThe first sentence:  “C’mon Blossom, we’ve got celebrating to do!”\nInitial thoughts:  I've seen people comment that they don't like cold opens into dialogue, but I think they can be perfectly effective--as this one is.  It's not a memorable or otherwise interesting line, but it gives us an immediate sense of the piece's tone while inviting us to read further to find out crucial bits of context (like who's doing the talking).  3 stars.\nAfter reading:  The first sentence is indeed indicative of the story's early going, in that it's a celebratory scene and mood at the start.  In other words, this is of about THE SAME effectiveness as I initially took it to be.\nThe Price of Grace, by Sparkle (story: 2 stars)\nThe first sentence:  It was midnight, but the lights in Canterlot Tower were still burning.\nInitial thoughts:  I find this evocative in its simplicity.  \"Burning the midnight oil\" is a common expression for a reason, and this is essentially that expression writ large.  It's true it doesn't give us much hint of mood (this could mean tragedy, general labor, or even extended revelry), but I'll still give it 4 stars for catching the imagination without using any unusually tired phrasing for its classic imagery.\nAfter reading:  The opening's got some poor writing, and leans heavily on tired, banal storytelling elements.  The former doesn't really matter as far as that first sentence is concerned, but the latter does; it suggests that the difference between classic and cliche in that first sentence is a happy accident rather than deliberate, and even paints it with the same brush as the later bromides.  I still think it's a nice first sentence, but I'd say that it seems WORSE for having read further.", "source": "One Man's Pony Ramblings"}