{"published": "2015-09-08T04:47:16Z", "media-type": "Blog", "title": "More Work on the Van.", "id": "d30e7384-2838-4de0-966d-39afab052c86", "content": "  The last couple of days I have been continuing the work on my old Chevy van in preparation for the trip to northeast Nevada. Body stuff I have gone over the doors and windows with a combination of sticky back foam and some scrap plastic “U” channel that just happened to fit. Now the windows and doors don’t rattle quite as bad as they did. I found out that I am going to have to do some extensive body work on the side doors. About six inches of the bottom of one is rusted away. The other isn’t in as bad of shape but definitely needs work. Unfortunately I am not a body repair man so whatever I do will be rough; but all that will have to wait until next summer. Patti helped me take the top bunk out of the van. This will make a lot more room to move around. The van is perfect for a one person “camper”. It will work for two (Patti and I used it as our only RV for about 30 years) but you don’t have much room inside if the weather gets bad or is real cold. Under the van Once I had done as much as I could do for the doors, etc., it was time to crawl under the van to check the fluids. First I checked the front differential and found that it was almost full. I topped it off and then crawled under the drivers side to check the transmission. “Oops! Its on the other side.” Worn Bushings As I was crawling back out I noticed that one of the bushings on the transmission linkage looked to be worn out. I reached up and tried jiggling the linkage; it flopped back and forth. Uh-oh!\nThere are two long rods coming back from the box on the steering column. One rod is for shifting first and reverse gears and the other one is for second and third. These rods are connected to the transmission via other short linkages. Where the end of the rod connects to said linkage there is a bushing. The bushings were originally made of plastic and these were almost completely warn away. Since I don’t have any plastic I made the new bushings out of brass. Unfortunately I have been so involved in all the little things I’ve had to do that I haven’t taken any pictures. There were several other things under the van that had to be tightened or repaired. Back to the fluids. Eventually I got back to checking the fluids. I crawled under the passenger side to check the transmission oil and found it very low so I filled it. The transfer case was full but the rear differential was very low so I filled that. I know why the transmission was low as it has some leaks but I find no evidence of leakage from the differential. All the fluids are topped off and everything that I could find to fix under the van has been worked on. Under the hood This morning it was time to drain the oil out of the van and replace it with new oil. That all went well.\nAs I was finishing up I noticed that the air cleaner was loose. After further inspection I found that the part on the carburetor that holds one side of  the air cleaner had a screw missing; it looked stripped out.\nI decided that the best way to fix this problem was to pull the carb so I could work on it on a bench and hopefully retrieve the missing screw.\nI had an old carburetor in a cabinet under one of my benches and thought that maybe I could just swap carb’s. As it turned out, even though it was a very similar carburetor, some important parts were broken or different enough that I couldn’t use it directly but I was able to get the part that I needed off the old carb to fix the new one. Eventually I got the carb back on the engine and fired it up, the engine ran just great. While I was working on the carburetor the missing screw fell out.  Other optional projects I’ve got several more small jobs to get done before the trip. Like finish installing the CB radio. I was going to buy a new am/fm radio for the van but I realized that I don’t need to buy one. The old radio has a separate power amp and I think that it still works. If so I can just hook my XM radio audio output to the power amp and I will be all set for tunes and entertainment on the road. If not I can listen to the radio through ear buds or some small powered speakers that I have. I still have to shop and load all the stuff I won’t be able to live without. I hope there is enough room in the van. Other stuff Patti and I are also getting ready for a weekend at the cabin so we have been kind of busy. Talk to you later.", "source": "The new adventures of Patti and Marty"}