{"published": "2015-09-16T10:05:44Z", "media-type": "News", "title": "SIGN CHINA, LED CHINA, and LED LIGHTING CHINA 2015 Open 16-19 September in New Host City Shanghai", "id": "61407f35-3f9e-4c77-a218-29d453edb7d0", "content": "Trifecta Trade Events Serving the Digital and Traditional Sign, Advertising and LED Industries \n\nCreate Wider Global Opportunities \n\nSHANGHAI, Sept. 16, 2015 /PRNewswire/ -- Organised by UBM Trust, a joint venture company of UBM Asia – the region's largest trade show organiser and largest organiser in Mainland China - SIGN CHINA, LED CHINA and LED LIGHTING CHINA debut in the new host city Shanghai, China. \n\nThis trifecta of events serving the digital and traditional sign, advertising and LED industries takes place from 16-19 September 2015 at The Shanghai New International Expo Centre. \n\nThe decision to move this 12-year old event previously held in Guangzhou to Shanghai marks the longer term strategy to create greater international business and networking opportunities for the entire industry.  \n\nThe last edition of SIGN CHINA and LED CHINA in 2014 delivered 1,083 exhibitors and 88,502 professional visitors from 167 countries and 31 Chinese provinces. Compared to 2010, the exhibition had more than double in size and in the number of exhibiting companies/brands, together with nearly the same exponential increase in domestic and international trade visitors. \n\nPhoto - http://photos.prnewswire.com/prnh/20150916/267090 \n\nPhoto - http://photos.prnewswire.com/prnh/20150916/267091 \n\nWith 1,200 exhibitors/brands across 120,000 sqm of exhibition space, the 2015 edition of the event looks set to attain yet another new milestone. \n\n\"Our event has evolved since its launch in 2003 with less than a hundred exhibitors to become the world-leading must-attend exhibition for indoor and outdoor format printers, engravers, exhibition and display equipment, as well as LED displays, components and lighting,\" reminisces UBM Trust Managing Director David Tang. \n\n\"The move from Guangzhou to Shanghai this year is a long-term strategic step in the event's continuous evolution to position itself as the premier international business platform for these sectors and to better facilitate interaction, exchange and business dealings amongst professionals from all over the world.\" \n\nThe \"W\" halls of SNIEC have been dedicated to SIGN CHINA showcasing all areas of digital and traditional sign products from laser engravers, fiber laser cutters, laser welding machines, indoor and outdoor large format printers and materials to lightboxes, acrylic panels and other POP items. LED CHINA and LED LIGHTING CHINA occupy the \"E\" halls of SNIEC and house indoor and outdoor LED lighting products, decorative lighting, OLED and LED Chips, packaging, testing instruments and illuminants.   \n\n\"In order to maximize the business opportunities for the attendees, we have introduced a new, onsite Buyer Programme,\" says Mr. Tang, \"The Buyer Programme is designed to encourage and increase efficiencies in product sourcing during the exhibition. Our VIP buyers can enjoy exclusive first-time discounts on over 1,000 products from 100 participating exhibitors, so as to get a real sense of the quality of Chinese and Asian products and components.\" \n\nFor more information about SIGN CHINA, LED CHINA, and LED LIGHITNG CHINA including participating brands of the 2015 Buyer Programme, please visit: \n\nPublished Sep. 16, 2015 \n\nCopyright © 2015 SYS-CON Media, Inc. — All Rights Reserved. \n\nSyndicated stories and blog feeds, all rights reserved by the author.", "source": "Virtualization Conference & Expo"}