{"published": "2015-09-17T22:41:55Z", "media-type": "Blog", "title": "Overnight Healthcare: Cornyn says Senate will vote on defunding Planned Parenthood", "id": "8405f9bf-6b67-4461-88ef-bf211c4d6b89", "content": "The No. 2 Senate Republican said Thursday the chamber is planning a vote to defund Planned Parenthood as part of this fall's government spending bill.\n\"I think we'll have votes associated with the [Continuing Resolution] on defunding,\" Senate Majority Whip John Cornyn (R-Texas) told several reporters Thursday, referring to a short-term government funding bill.\nADVERTISEMENTCornyn offered no details on the plan and how it could emerge in the six legislative days left to fund the government. Senate Majority Leader Mitch McConnell (R-Ky.) has ruled out a government shutdown to defund Planned Parenthood, though he remains under intense pressure from dozens of congressional Republicans who have pledged defund the health provider at all costs.\nIt will be the Senate's second vote to defund Planned Parenthood since controversial videos emerged this summer. The first, a procedural vote, fell six votes short of clearing the chamber. Read more here.\nAYOTTE TO CRUZ: WHAT'S YOUR ENDGAME? Sen. Kelly Ayotte (N.H.) is challenging fellow Republican Sen. Ted Cruz (Texas) to reveal his \"strategy for success\" as he risks a government shutdown in an attempt to end federal funding of Planned Parenthood.\nIn a letter sent Thursday, Ayotte tells Cruz to show his hand, and presents the math for why the GOP can't win on the shutdown fight.\n\"It is abundantly clear that we lack the votes in the Senate to redirect these funds,\" Ayotte, one of four female Republicans in the Senate, wrote. Read more here.\nWHITE HOUSE DIGS IN AGAINST GOP: With just one week to go, the Obama administration is basking in the GOP's lack of a strategy to fund the government.\nWhite House spokesman Josh Earnest said Wednesday that the GOP's \"fascination\" with defunding Planned Parenthood this summer has brought the government to the brink of a shutdown.\n\"The way that Republicans, including some Republican candidates last night, have injected this ideological issue in the midst of the budget debate, has made it more difficult to reach a bipartisan budget deal,\" he said, offering a preview of the White House's plan of attack if Republicans fail to reach a government funding deal by Sept. 30.\nThe White House has been notably vocal this week after weeks of declining to go into specifics about the controversy that has plagued Planned Parenthood since July, with the release of a series of videos detailing the group's fetal tissue program. Read more here.\nBIRTH CONTROL MANDATE HEADED TO HIGH COURT? A federal appeals court on Thursday ruled against ObamaCare's birth control mandate in a decision that could invite a Supreme Court review.\nThe 8th Circuit Court of Appeals ruled that four Christian nonprofits should not have to comply with the ObamaCare rule that all employer healthcare plans include contraception options or face a fee. While employers can seek exemptions to the law, the court argued that doing so poses a \"substantial burden\" on that organization's religious rights. Read more here.\nFriday's schedule:\nThe House will vote Friday on two bills tightening federal rules on abortion.\nThe health subcommittee of the Energy and Commerce Committee will hold a hearing on improving Medicaid.\nWhat we're reading\nPlanned Parenthood accuses Carly Fiorina of lying during debate\nThe five states with the biggest drops in uninsured residents\nEbola drug fast-tracked by FDA\nState by state\nJudge hears case over Arkansas defunding Planned Parenthood\nMaine tries to ban food stamps for those with more than $5,000\nTennessee attorney general: Governor can't unilaterally expand Medicaid\nWhat you might have missed from The Hill\nLawmakers clash over Planned Parenthood videos shown in hearing\nSenators introduced bipartisan bill targeting 'Cadillac' tax\nFiorina: 'Shame on us' if Congress funds Planned Parenthood\nPlease send tips and comments to Sarah Ferris, sferris@thehill.com, and Peter Sullivan, psullivan@thehill.com. Follow on Twitter: @thehill, @sarahnferris, @PeterSullivan4", "source": "The Hill: Healthcare Policy"}