{"published": "2015-09-09T17:41:19Z", "media-type": "News", "title": "Researchers at Sandler O’Neill Increased EMC Insurance Group (NASDAQ:EMCI) from Hold to Buy Rating", "id": "eea3c424-ebf8-40b7-8811-a0ffd176f363", "content": "EMC Insurance Group (NASDAQ:EMCI) Upgrade  \nIn analysts note shared with investors and clients today, Sandler O’Neill upgraded shares of EMC Insurance Group (NASDAQ:EMCI) to Buy rating from Hold rating. \nThe stock rating upgrade is well received by stock investors, as NASDAQ:EMCI is now trading 3.39% higher at $23.17 as of 13:41 New York time. EMC Insurance Group’s stock is down -25.32% over the last 200 days. It has underperformed the Standard & Poor’s 500 index, which has decreased -3.87% over the same time period. \n NASDAQ:EMCI Price Chart & Trend  \nThe stock price of EMC Insurance Group is down 25.32% over the last 200 days, and is in strong down trend. In the last 50 and 100 days, EMC Insurance Group is down 11.28% and down 35.19%, respectively. Our stocks momentum model is shown on the price chart below.  \nSource: RightEdge Systems , Yahoo Split & Dividend Adjusted Data and OctaFinance Trading Models \n Institutional Ownership  \nCapital Returns Management Llc had the biggest stake with ownership of 203,865 shares as of Q2 2015 for 2.87% of the equity exposure. Novare Capital Management Llc is another quite bullish institutional investor who is possessing 219,652 shares of EMC Insurance Group or 1.43% of their equity exposure. In addition, Grace & White Inc Ny have 0.99% of their equity exposure invested in the company for 192,796 shares. The Illinois-based fund Perritt Capital Management Inc disclosed it had acquired so far a stake worth about 0.86% of the institutional investor’s stock portfolio in EMC Insurance Group. The New York-based fund Dalton Greiner Hartman Maher & Co is also positive about the stock, possessing 192,608 shares or 0.37% of their equity exposure. \n Insider Activity  \nOver the last six months, EMC Insurance Group NASDAQ:EMCI has seen 0 unique insider buys, and 4 insider sales. The net result was for 4 transactions, worth $69,242. \n EMC Insurance Group (NASDAQ:EMCI) Profile  \nEMC Insurance Group Inc. (EMC Insurance Group) is an insurance holding company. The Company, through its subsidiaries, conducts operations in property and casualty insurance and reinsurance. The Company focuses on the sale of commercial lines of property and casualty insurance to small and medium-sized businesses. \nEMC Insurance Group (NASDAQ:EMCI) traded up 3.39% on 9 September, hitting $23.17. A total of 20,635 shares of the company’s stock traded hands. This is down from average of 26,288 shares. EMC Insurance Group has a 52 week low of $18.76 and a 52 week high of $26.52. The company has a market cap of $478.95M and a P/E ratio of 9.97. \n \nGet the latest EMC Insurance Group (NASDAQ:EMCI) Stock Ratings at Octafinance. Completely free access to our Analyst Ratings Database for 6000+ stocks. \n \nThe post appeared first on Octafinance .", "source": "Octafinance"}