{"published": "2015-09-04T00:00:00Z", "media-type": "News", "title": "Oil recycling refinery looks at putting on apprentices", "id": "a26ec81d-441d-4103-b66c-e5b9518cff2c", "content": "GLADSTONE'S Northern Oil Refinery is looking at expanding by taking on two apprentices and a lab technician. \n\nThe refinery at Yarwun is the only facility in Queensland that recycles waste lube oil back into base lube oil. \n\nNorthern Oil Refineries general manager Andrew Smith, who has been on the job for six months, said the refinery was already looking to take on two apprentices and a lab technician. \n\n\"We have the capacity to do 100 million litres per annum but we are currently doing 50,\" he said. \n\n\"If more businesses gave us their used oil we could employ more people. We've only developed half of the site as well.\" \n\nQueensland shadow minister for environment Stephen Bennett visited the oil refinery yesterday. \n\n\"They have taken on an exciting challenge and the innovation here has made them world leaders,\" Mr Bennett said. \n\n\"It's a great example of things to come in the waste management field. \n\n\"It's the most environmentally responsible treatment of waste lube oil, where every component of the waste lube oil is reused and 99% of the lube oil is recovered as high quality lube oil for use. \n\n\"We need more companies to have vision and continue to invest and properly deal with their waste.\" \n\nJJ Richards and Sons is responsible for transporting used oil to the site. \n\nGladstone branch manager Lockie McGaw said oil came from all over Queensland. \n\n\"We can transport around 47,000L of oil. It's not a big part of our region because we're diversified here in Gladstone,\" he said. \n\nJJ Richards and Sons business development manager Richard Taylor said most oil in the region came from mines and industries. \n\n\"It's great to be able to have a circular economy where we can get something that is used and refine it back to quality lube oil to put back into the system,\" he said. \n\nTOP GLADSTONE NEWS Get your local news, your way.\n\nUpdate your news preferences and get the latest news delivered to your inbox.", "source": "Lismore Northern Star"}