{"published": "2015-09-22T06:00:57Z", "media-type": "Blog", "title": "Google Street View Now Available in Sharjah and Ajman!", "id": "201d495e-a031-4cfc-8072-2b741615d6f0", "content": "Google today announced the arrival of Street View in Sharjah and Ajman, a feature by Google Maps that will allow users to view and navigate 360 degree street-level imagery of major streets across the two Emirates. \n \n\n \nThe first Street View Special Collect in the UAE was launched in 2013 for Burj Khalifa followed by the Sheikh Zayed Grand Mosque Center and the Liwa desert in Abu Dhabi. In 2014, Dubai was the first Arab city to have Street View on a street level. \n \n  \n \nGoogle Street View imagery provides users with a rich, immersive browsing experience and allows users to explore world landmarks, view natural wonders, navigate a trip or other points of interest. Street View was first launched in May 2007 and is already available in more than 3000 cities across 63 countries around the world. \n \n\n \nSome of the special areas captured by Street View are Al Noor Mosque, the Khor Fakkan and Kalba enclaves on the East, the Al Tamal camel track and the Al-Murabaa Watchtower on the Corniche. The Trekker equipment gathered imagery of the Al Majaz Waterfront and the Al Qasba with its “Eye of the Emirates”  ferris wheel. The Trekker equipment  is a wearable Street View backpack with a camera system on top that is designed to go down footpaths, tracks and narrow pathways to get images of areas of natural beauty or tourist sites.   \n \n  \n \nThe Street View car covered the following streets in Sharjah: Al Khan, Al Wahda and Corniche Street – and the following streets in Ajman: Al Muntazah Street, Sheikh Rashid Bin Humeed, Sheikh Khalifa Bin Zayed and Sheikh Ammar Bin Humaid street.   \n \n\n \nThe Google street also returned to Sheikh Zayed road to update its imagery since its initial capture last year.   Antony McLoughlin, Street View Program Manager, for Google in Europe, Middle East and North Africa, said: \n \n“We have been expanding Street View across the UAE and hope to do add additional imagery in the future. Street View is a great feature that benefits users and businesses, we’ve received great feedback wherever we’ve launched around the world.” \n \n  \n \nStreet View Process   \n \nStreet View imagery is gathered by a vehicle equipped with advanced imaging technology— a camera mounted on the roof of a car that collects imagery and location data. After collection, the imagery is stitched together to create the 360° panoramic images that allows you to move around and explore locations as if you were there.   \n \n\n \nGoogle is constantly improving its maps with tens of thousands of updates everyday throughout the world – from the latest road names, business addresses to public transit schedules and photos. Street View  provides easily accessible tools for flagging inappropriate or sensitive imagery for review and removal. Each image contains a link to a “Report a problem” tool where users can report objectionable images.  \n \n  \n Google Street View Now Available in Sharjah and Ajman! % Overall Score Reader Rating: ( 0 Votes) 0% \nThe post Google Street View Now Available in Sharjah and Ajman! appeared first on UthMag.com .Author Roshan Ajit Kumar", "source": "UthMag.com Middle East Youth Portal News Feed"}