{"published": "2015-09-02T15:38:23Z", "media-type": "News", "title": "Technology Pioneer Steve Wozniak will Keynote 2016 DattoCon", "id": "3e18745c-a073-473c-b150-7087bb422a87", "content": "PRWeb \nDatto , an innovative provider of comprehensive data backup, recovery and business continuity solutions, today announced that Apple co-founder, inventor, and philanthropist, Steve Wozniak will keynote DattoCon 2016 , which will take place June 20 to 22 in Nashville, Tennessee. DattoCon brings Managed Service Providers (MSPs), Value-Added Resellers (VARS), and IT business owners together for three days of sessions, technical training, best practices and networking opportunities designed to help Datto partners dramatically grow their businesses. \n\nDatto is dedicated to innovation and with that spirit in mind, the company tapped one of the world's leading thinkers, Steve Wozniak, for a session entitled \"iWoz: A Conversation with Steve Wozniak\" during DattoCon. As an Apple co-founder, Steve Wozniak is best known as the developer of the Apple I, one of the first personal computers and a catalyst for the launch of Apple. \n   \n\"DattoCon gets better every year, and in 2016 we will not only provide content that helps IT professionals get ahead in their careers, but also inspires,\" said Austin McChord, CEO of Datto. \"Steve Wozniak is an inspirational leader in the technology industry and attendees will undoubtedly benefit from Steve's wisdom.\" \n\nWith more than 700 attendees expected in 2016, DattoCon will offer a range of sessions focused on two tracks: a sales and marketing track as well as a technical track, to address challenges such as how to best provide total data protection. \n\n\"While there are many benefits to attending DattoCon, increasing your company's bottom line is one of the most important advantages,\" said Rob Rae, Vice President, of Business Development at Datto. \"Datto partners have the opportunity to collaborate with fellow partners and learn specifically what works and what doesn't. We found that 2014 DattoCon attendees grew their Datto sales 151 percent on average within one year's time.\" \n\nIn addition to receiving tremendous educational resources at DattoCon, attendees will get a first look at new Datto products before they are generally available. \n\nTo register for DattoCon 2016, visit http://www.dattocon.com . The first 100 people to register for the event will be entered to win a private dinner with Steve Wozniak and Datto CEO Austin McChord. Early bird registrants will save $200 by registering before the end of the year. \n\nAbout Datto \nDatto is an innovative provider of comprehensive backup, recovery and business continuity solutions used by thousands of managed service providers worldwide. Datto's 160+ PB private cloud and family of software and hardware devices provide Total Data Protection everywhere business data lives. Whether your data is on-prem in a physical or virtual server, or in the cloud via SaaS applications, only Datto offers end-to-end recoverability and single-vendor accountability. Founded in 2007 by Austin McChord, Datto is privately held and profitable, with venture backing by General Catalyst Partners. In 2015 McChord was named to the Forbes \"30 under 30\" ranking of top young entrepreneurs. To learn more, visit http://www.datto.com . \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12939017.htm \nPRWeb.com", "source": "Wall Street Business Network"}