{"published": "2015-09-28T13:56:50Z", "media-type": "Blog", "title": "Modi convinces Silicon Valley about Digital India, lauds Facebook & Google", "id": "03416d64-c7f7-4d2a-972b-d399a39ddc01", "content": "News Headline | Modi convinces Silicon Valley about Digital India, lauds Facebook & Google share this on 0 0 0 Email this pagePrint this page By indiantelevision.com Team Posted on : 28 Sep 2015 07:26 pm 0 0 0 NEW DELHI: As he entered the extensive office of Facebook in California, he was greeted with the song ‘Chak de India’ and when he left, Prime Narendra Modi left a huge impression about India’s seriousness ongoing digital.\n \nThe euphoria was the same when he visited Google, or addressed a meeting of persons from LinkedIn or start-ups.\n \nIn various speeches during his visit, Modi said Facebook, Twitter and Instagram were the new neighbourhood.\n \n“If Facebook were a country, it would be the third most populous one and the most connected,” he said. \n \nSimilarly, he said Google “has made teachers less awe-inspiring and grandparents more idle. Twitter has turned everyone into a reporter. The traffic lights that need to work the best are on CISCO routers.” \n \nThe status that now matters, he said, “is not whether you are awake or asleep but whether you are online or offline. The most fundamental debate for our youth is the choice between Android, iOS or Windows.”\n \nFrom computing to communication, entertainment to education, from printing documents to printing products, and, now to Internet of Things, it’s been a long journey in a short time. \n \nReferring to digital networks, he said, “We have attacked poverty by using the power of networks and mobile phones to launch a new era of empowerment and inclusion: 180 million new bank accounts in a few months; direct transfer of benefits to the poor; funds for the unbanked; insurance within the reach of the poorest; and, pension for the sunset years for all.”\n \nBy using Space technology and internet, the country had been able to identify in the last few months 170 applications that will make governance better and development faster. \n \n“The pace at which people are taking to digital technology defies our stereotypes of age, education, language and income,” he added.\n \n“Customers, more than creators, are defining the use of a product. The world may be driven by the same ancient impulses. We will continue to see human struggles and successes. We will witness human glory and tragedies,” Modi said. \n \nHe added that in this digital age, there was an opportunity to transform lives of people in ways that was hard to imagine just a couple of decades ago. \n \n“Today, technology is advancing citizen empowerment and democracy that once drew their strength from Constitutions. Technology is forcing governments to deal with massive volume of data and generate responses, not in 24 hours but in 24 minutes. When you think of the exponential speed and scale of expansion of social media or a service, you have to believe that it is equally possible to rapidly transform the lives of those who have long stood on the margins of hope. So out of this conviction was born the vision of Digital India,” he said. \n \n“It is an enterprise for India's transformation on a scale that is, perhaps, unmatched in human history. Not just to touch the lives of the weakest, farthest and the poorest citizen of India, but change the way our nation will live and work,” he said. “We will transform governance, making it more transparent, accountable, accessible and participative. I spoke of E-Governance as a foundation of better governance – efficient, economical and effective.” \n \nAfter MyGov.in, Modi said he had just launched the Narendra Modi Mobile App.\n \nInformation, education, skills, healthcare, livelihood, financial inclusion, small and village enterprises, opportunities for women, conservation of natural resources, distributed clean energy – entirely new possibilities have emerged to change the development model. \n \n“We want our 1.25 billion citizens to be digitally connected. We already have broadband usage across India go up by 63 per cent last year. We need to accelerate this further,” he further said. \n \nAn aggressive expansion of the National Optical Fibre Network had been launched that will take broadband to our 600,000 villages. “We are expanding our public Wi-Fi hotspots. For example, we want to ensure that free Wi-Fi is not only there in airport lounges, but also on our railway platforms. Teaming up with Google, we will cover 500 railway stations in a short time. We are also setting up Common Service Centres in villages and towns. We will also use information technology to build smart cities,” Modi informed. \n \n“We are also setting up an Electronics Development Fund to support design, development and launch of new products,” he added. \n \nIndians account for 15 per cent of startups in the United States. “Hundreds of thousands of Indian professionals here and in India are contributing to the global success of US enterprises. Many are leading them today. This is the possibility of the digital bridge - to connect distant lives and change fortunes and future,” he said.\n \nModi said he was delighted that Qualcomm announced a fund of $150 million for startups in India.", "source": "Indian Television Dot Com"}