{"published": "2015-09-10T10:32:03Z", "media-type": "Blog", "title": "Interview: The Diary Of A Teenage Girl", "id": "3462b002-72e4-4974-91c0-fa93b10f3d50", "content": "Interview: The Diary Of A Teenage Girl\rPosted on August 10, 2015 Don’t let the title fool you, The Diary of a Teenage Girl is no Angus, Thongs and Perfect Snogging, in fact, it’s probably the coolest film we’ve seen this year so far. Set in ’70s San Francisco, it follows 15 year old Minnie Goetze as she goes from girl to woman at a super high speed after embarking on an affair with her mum’s boyfriend (awks). The best thing about the film? It’s actually believable, and incredibly honest about what it feels like growing up as a young woman which obviously we’re very into. Plus, the sun-soaked retro sets and costumes make the whole thing look like a moving Pinterest board for this season. We caught up with leading lady Bel Powley ahead of the film’s New York premiere to talk teenage memories, London loving and being a secret geek. Tell us about your character, are you alike?  I was very earnest like Minnie is, but I think she represents every young woman, that butterfly feeling that you get in your stomach. The way you feel when you’re a teenager is so extreme, it’s exhausting. I was so irrational, I’m like how did I survive? How did I live?! You’ve been compared to Carey Mulligan, what actresses do you look up to?  There’s so many that I admire but I don’t want to be like anyone else, I want to be my own person. I really admire actresses of older generations who didn’t succumb to the pressures on women in Hollywood, like Francis McDormand and Meryl Streep. Let’s talk about that ’70s wardrobe…  I loved it! It’s so funny because I was wearing all those flares for the film and now it’s out and bell-bottoms are really in, I’m like why didn’t I keep them?! How was shooting in San Francisco? I basically had a tour of the city through shooting. There were so many cool places, I was staying in Potrero Hill which is basically their Hackney – kind of hipster. The food there is amazing, my favourite restaurant was called Foreign Cinema, it’s so good! Do you prefer the UK or the US?  I love coming back to London. I love New York, I love LA, they all have their own amazing qualities but I could never leave London. There’s something about it that just has a sort of grittiness and an edge. We loved the animation in the film…\nIsn’t it amazing? It was all done by an Icelandic animator called Sara Gunnasdottir, she drew every single frame – her arm nearly fell off! They’re incredible. I just got really good at tracing because I am not good at art! I was better at maths and more rational subjects. If I hadn’t become an actress I was going to study Eastern European history and politics (I know, I am such a geek!). What’s next for you?  I’m doing an indie thriller where I play a pole dancer – which is interesting… Then I’m doing another period piece called A Storm in Our Stars. My pole dancing costume is the best so far though, it’s literally covered in tassels.  Want to work ’70s style yourself? Head here.  ", "source": "Inside-Out - The Official Topshop Blog"}