{"published": "2015-09-14T23:45:57Z", "media-type": "Blog", "title": "San Diego Entrepreneur of the Week: Doris Dunkel of San Diego Events Company", "id": "0c1bbbf7-5a7f-4f49-8e96-ae62fae385c8", "content": "SD Entertainer is a huge fan and supporter of entrepreneurs in San Diego. We admire the dedication and long hours it takes to build and develop a successful business. Each week, the SD Entertainer sits down with one a successful entrepreneur and discusses the goals, dreams, and plans for their company. This week, the SD Entertainer had the opportunity to speak with Doris Dunkel, owner of the San Diego Events Company. \n \nDescribe the history of your company and how you got involved with event coordination. \n \nI started San Diego Events Company in March of 2012. I came from a marketing background, working for a major liquor company. I managed the San Diego territory and fell in love with the event-side of the job. I executed sponsorship events in San Diego, Las Vegas, Los Angeles and Miami. I organized everything from intimate manicure and martini parties to celebrity hosted events. I took my love of events and started San Diego Events Company \n \nWhat type of events does your company organize? \n \nSan Diego Events Company organizes a variety of events from weddings to corporate events. \n \nWhat are some services you provide? \n \nFor a full service wedding or special event, we provide access to our preferred vendors list, assistance with budget management, full event design and event management. \n \nWhat is your favorite type of event? \n \nMy favorite type of event would have to be anything that is themed. I love taking ANY theme and figuring out how to make it spectacular. For example, I did an event for the Young Presidents Organization of San Diego that was inspired by the film Titanic. The event was held at a multimillion dollar mansion in Carlsbad hand crafted by a well-known ship designer, featuring mahogany throughout. The event had three areas to experience; the first class tented dinner complete with a string quartet, VIP dinner service and opulent décor. The second area was the first class lounge featuring an oyster bar, cigar bar and premium cocktails surrounded by replicas of the paintings from the Titanic film. The third area was the 3 rd class party (my favorite area of the event), made to resemble the cargo portion of the ship where the 3 rd class passengers had their party. This area was located on the bottom floor of the estate. Featuring a traditional Irish band, Irish dancers, a psychic, a premium level bar, cargo boxes, steam from a smoke machine and of course an arm wrestling table. The event was a holiday party for YPO and was intended to emphasize their theme of the year; perspective. \n \nWhat signifies a successful event to you? \n \nA successful event is an event that inspires joy within the guests, runs smoothly and is talked about with excitement afterwards. \n \nWho are some of your typical clients and events you organize? \n \nI plan wedding and special events of all types. On the wedding side, I work with brides and their families. On the corporate side, I work closely with the decision makers. I have worked with Vavi Sport and Social Club, The Wipe Out Run, Young Presidents Organization, Maintenance Net, Dos XX, Ole Smoky Moonshine, The Rockefeller Center for Antiaging and Bodhi Animal Hospital, just to name a few. \n \nWhat is one of the most memorable events you organized? \n \nOne of the most memorable events I have worked on was the Titanic Event previously mentioned. The event had so many levels of detail and was a catalyst for gaining new YPO clients. \n \nWhere do you see the future of your company going? \n \nI see the future of San Diego Events Company continuing to grow upward. I am proud to say that in 3 years of business, we hold the title of A-List San Diego’s Best Wedding Planner two years running, our client list continues to grow and our creative efforts are rewarded with \ncountless 5 star reviews on Yelp. I am looking forward to what is in store for San Diego Events Company. \n \nWhy is San Diego a great place to host an event? \n \nSan Diego is a great place to hold an event because of the beautiful year round weather, wide variety of venues, stunning views and proximity to some of the country’s best eateries. I have brides coming from as far as Hong Kong to get married in San Diego. It is America’s finest city!", "source": "SD Entertainer Magazine"}