{"published": "2015-09-30T20:03:00Z", "media-type": "News", "title": "The Washington Nationals Certainly Seem To Hate Matt Williams", "id": "bb323eaa-ba4a-450f-abf8-32b0681edb71", "content": "The Washington Post’s Barry Svrluga has a deep, perfectly-timed dive into the Washington National’s disaster of a season. Not only is it a complete tick-tock of how the team fell apart, it features a number of quotes and anecdotes from inside the locker room, each one revealing that Matt Williams’s performance as manager was, somehow, even worse than you imagined. \n \nThere’s a lot to be drawn from Svrluga’s story, so you should definitely go read the whole thing , but the biggest revelation is that nobody on the team seems to think much of Williams. \n \nHere’s one anonymous Nationals player talking about Williams’s various strategic missteps : \n  \n   \n“The first time he does something odd, you’re like, ‘All right, I see, I get it, I’m with you,’” one Nationals veteran said. “The next time you’re like, ‘Ooookay. All right. I’m trying to get it. Yeah.’ And then when it keeps happening, guys are watching him like, ‘Well, here comes this guy again.’” \n \nNot every manager needs to have Joe Maddon’s ability to inspire confidence in order to be successful, but I’m fairly certain that “Well, here comes this guy again,” is not a thing that many good managers have had said about them by their own players. \n \nIt gets even worse! One of the things consistently brought up to Svrluga by the players he talked to is Williams’s apparent lack of interest in communicating with his players, a source of friction that eventually led to a blowup when Williams failed to inform Jayson Werth that he was going to be out of the lineup one day: \n \nAccording to individuals with direct knowledge of the situation, Werth hadn’t received such a message from Williams. This wasn’t the first time, and Werth wasn’t the first veteran to experience what players considered an oversight once, an egregious error beyond that. \n\nWhat might have been a minor blip in a successful season became a boiling point. Incensed, Werth ripped the lineup card off the wall, bellowing that it was going to change. Then, according to several people who were present, he confronted Williams — not just about whether he would play that day, but about what most of the clubhouse considered to be a chronic lack of communication with his players. Among the most jarring barbs, from Werth to Williams: “When exactly do you think you lost this team?” \n \nReferencing that same confrontation, another player had this to say about Williams: \n \n“He’s like the guy in his house who hears a sound, like someone breaking in,” one player said. “And his reaction isn’t to take care of the problem or investigate. It’s to put his head under the pillow and hope it goes away.” \n \nAbout a year ago, Matt Williams was voted the N.L. Manager of the Year. Since then, he’s presided over the stunning collapse of a team that should have been a lock for the playoffs and transformed himself into baseball’s version of Michael Scott. It’s just too bad we’ll never see what he had in store for next season, because this dude is definitely getting fired. (In fact, how has he not been?) \n \n[ Washington Post ]", "source": "Deadspin"}