{"published": "2015-09-10T09:26:51Z", "media-type": "Blog", "title": "Network syncroniser", "id": "ce435aa9-0db9-4094-b48a-a0a2dadf3c85", "content": "Feel like a chat with Moneydance developers, support team, and other customers? Please join us in our new unofficial Infinite Kind Slack Chat.\rPlease note that this chat system is not an official support channel but is an experiment in providing a place for people to connect and discuss trending topics with our products.\rHome → SyncSpace → Network syncroniser Edit donaldgorst1 07 Sep, 2015 02:16 PM I have Moneydance on my tower ( Vista ) and laptop (10) Does your sync program enable me to sycronise them both so I can always be up to date on either. Do I have to pay for it? Support Staff 1 Posted by Ethan on 08 Sep, 2015 01:15 PM To share your data between your two desktop systems, you will need to share your main data file between your computers via either a shared local network drive or through an online syncing service. The instructions I'm going to give are for doing this via Dropbox, but you could use any equivalent service. First, you will want to locate your main data file on the desktop version of Moneydance that is most up to date. Assuming that you haven't specified a custom location, your data file will be saved at a location described at http://help.infinitekind.com/kb/moneydance-2015/where-is-my-data-st..., and will be called something like yourfilename.moneydance. You will want to move this file to your Dropbox folder by following the instructions at http://help.infinitekind.com/kb/moneydance-2014/how-to-move-your-da... Once your data file has been moved, reopen Moneydance, use the Open Other option from either the welcome screen or from the menu bar at File -> Open -> Open Other, and select the data file in its new location. If you can now see your data, this computer should now be set up. Make sure that the Dropbox program is running and you are connected to the internet. Moving on to the other computer, assuming that you have Dropbox set up and installed on this computer and either are using the same Dropbox account or have shared the data file with whatever account you are using, you should now be able to see your data file in the Dropbox folder on this computer. Follow the same instructions using the Open Other option in Moneydance to point the program to this file. Your data should now be available on this computer. Moneydance will remember the locations of your data file once you tell it using this 'open other' option, so all of this setup should be a one time event. In the future, you should just have to launch the program, and Moneydance will open the last known location of your data file. If you are using multiple data files, you can quickly switch between them by using the File -> Open menu. It is also important to only have Moneydance open on one of your computers at a time. Otherwise, you will run the risk of one of your computers overwriting the data that the other one is trying to make at the same time. You should get in the habit of completely closing the program when you are not actively using it. Finally, Dropbox uses SSL connections and AES-256 bit encryption to store your data, which provides a high level of security. If you are using a different service, you should check whether they have similar levels of security for your financial data. You can also make your data file more secure by going to File -> Encryption from the Moneydance menu bar to encrypt your data file itself. This will mean that you (or anyone trying to access your data file) will have to enter a password to open it no matter where the data file is stored. Note that we haven't built any 'backdoors' into our encryption, so if you forget your password, we have no way to help you retrieve your data. Please let me know if I can be of further assistance, Ethan\nMoneydance Support Edit Ethan closed this discussion on 08 Sep, 2015 01:15 PM. DONALD GORST re-opened this discussion on 10 Sep, 2015 09:26 AM 2 Posted by DONALD GORST on 10 Sep, 2015 09:26 AM -------------------------------------------- On Tue, 9/8/15, Ethan <[email blocked]> wrote:  Subject: Re: Network syncroniser [SyncSpace #365]  To: [email blocked]  Date: Tuesday, September 8, 2015, 2:15 PM                        #yiv0322719443 pre   #yiv0322719443 blockquote                                               // Please reply above this  Thank You Ethan. I have saved your e mail and will refer it to my IT adviser on Friday. I am 80 years old and ex Quicken getting Moneydance some time back. I have two computers a tower on vista and a lap top now on windows 10, perhaps unwise. The computers share a BT modem infinity. Before I installed the infinity update I used allwaysync to update Moneydance and other files between laptop and tower. That installation downloaded a firewall which blocked the link and I made a cockup of things changing the headings on sync. I am now trying to get things back as they should be. I like moneydance, frankly as an old man I need to keep my assets in one place and am terrified of computer failure. I back up to BT cloud but in the event of failure can I recover from cloud to my laptop or another computer. I dont want my sons saying the silly old sod made a mess of thing if I turn my toes up. Donald Edit Reply to this discussion Internal reply Name Email Formatting help / Preview (switch to plain text) No formatting (switch to Markdown) Attached Files Remove Attach File You can attach files up to 10MB Verify Human Spam protection: What is three plus three? If you don't have an account yet, we need to confirm you're human and not a machine trying to post spam. Comment Keyboard shortcuts Generic ? Show this help ESC Blurs the current field Comment Form r Focus the comment reply box ^ + ↩ Submit the comment You can use Command ⌘ instead of Control ^ on Mac Recent Discussions 10 Sep, 2015 09:26 AM Network syncroniser 10 Sep, 2015 06:33 AM Inconsistent Transaction Reports when using Tags 10 Sep, 2015 05:10 AM transaction rate 10 Sep, 2015 04:35 AM Lending Money 09 Sep, 2015 09:59 PM Cannot open Moneydance when installed on Windows 10 Recent Articles Moneydance 2015 preview changelog How Many License Keys do I Need? How can I transfer my data from Quicken into Moneydance? Can I set a Starting Balance for my checking/savings/etc. Account? Recreating a connection", "source": "Infinite Kind: Recent Discussions"}