{"published": "2015-09-27T02:57:29Z", "media-type": "News", "title": "Dame Joan Collins 'nagged' sister Jackie about breast cancer checks", "id": "df13cc43-53fd-4f09-9a7e-d69b12a4adc0", "content": "Dame Joan Collins said she used to \"nag\" her sister Jackie about getting mammograms but she \"refused\". \n \r\n\t\t\r \nJackie, who sold more than 500 million novels in more than 40 countries in her  four decades-long career as a writer in raunchy female fiction, died of breast  cancer last Saturday aged 77. \n\r  Joan and Jackie Collins during the filming of the 2013 New Year's Eve Graham Norton Show \r \r \nDame Joan said she and her sister were \"thick as thieves\" but admitted they did have \"estrangements\" in the past. \n\r\n\t\t\t\r \nDespite being diagnosed six-and-a-half years ago, British author Jackie, who lived  in Beverley Hills, told few people about her illness, saying she did not want to  ''burden'' others with it. \n\r\n\r\n\r\n\r \nIn an online post called A Tribute To My Beloved Sister, Dame Joan wrote: \"I used to nag my sister about getting mammograms, as our darling mother Elsa had succumbed to the disease in 1962 when she was only in her early fifties. \n\n\"I was religious about doing mammograms regularly. Jackie however refused - she didn't even like going to doctors. Like my brother and I she was needle-phobic.\" \n\nDame Joan, who said she and Jackie were \" thick as thieves\", also revealed the moment Jackie rang her to say she had stage four breast cancer. \n\nShe only found out about her sister's illness in the fortnight before her death. \n\r\n\t\t\t\r \nShe said Jackie told her that she did not want to upset her, adding that she said: \" I know all the problems you've been having in the past few years - I didn't want to burden you with mine.\" \n\nDame Joan wrote: \"My voice was so choked with tears I could hardly speak.\" \n\nThe pair, who had been rumoured at times to have a difficult relationship, were pictured together in London just a few days before the death when Jackie was on a promotional tour for her new novel The Santangelos. \n\nIn her tribute, Dame Joan wrote: \"Jackie really enjoyed her life so much and lived it to the hilt, and when we were together, even if we hadn't seen each other for a few months, we were thick as thieves.\" \n\r\n\t\t\t\r \nDame Joan said Jackie \"hated\" her fourth husband Peter Holm, adding: \"She begged me not to marry him but unfortunately I went ahead - one of the worst decisions of my life. Jackie and I didn't see each other so much during that period.\" \n\nShe went on: \"Unfortunately, a couple of years later another relationship I had came between us and, having moved back to Europe, we couldn't be as close as we wanted to be. \n\n\"Sisters will have their estrangements but happily when that relationship ended and I moved back to LA Jackie and I resumed our devotion to each other.\" \n\nShe added: \"I've never had a better girlfriend than Jackie, with whom I shared so much in common and could enjoy talking and gossiping away about everything when we were together, going to our favourite restaurants or to the movies or on long distance phone calls.\" \n\nIn her concluding few lines, Dame Joan said: \"I don't think I will ever recover from the sadness of losing my beautiful baby sister.\" \n\r\n\t\t\t\r \nShe added: \"She will live on in the wonderful memories I have of her from our childhood and particularly from the last fifteen years, during which we were closer than ever. I feel her spirit, I hear her wonderful laugh and I see her all the time in the hundreds of photos of her that are sprinkled around my home. \n\n\"She wasn't just a star - to me she was an entire galaxy.\" \n\nDame Joan has requested that people who read her online tribute make donations to Penny Brohn Cancer Care in the UK and the Susan G. Komen breast cancer organisation in the USA. \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "West Sussex Today"}