{"published": "2015-09-25T01:44:59Z", "media-type": "News", "title": "Ekso Bionics(TM) to Present at Ladenburg Thalmann 2015 Healthcare Conference", "id": "465935b6-053e-4fe9-91e0-2fd1203fb9f8", "content": "RICHMOND, Calif., Sept. 24, 2015 (GLOBE NEWSWIRE) -- Ekso Bionics Holdings, Inc. (OTCQB: EKSO), a robotic exoskeleton company, announced today that Nathan Harding, chief executive officer and co-founder, will present a corporate overview at the Ladenburg Thalmann 2015 Healthcare Conference on Tuesday, September 29, 2015 at 9:30AM EDT in New York City. A demonstration of the company's robotic exoskeleton technology will also be provided.\n\nA webcast of the presentation can be accessed by visiting the investors tab of the company's website at www.eksobionics.com. The webcast will be archived for 90 days.\n\nAbout Ekso Bionics\n\nSince 2005, Ekso Bionics has been a leader in the field of robotic exoskeletons, or wearable robots, to augment human strength, endurance and mobility. The company's first commercially available product called Ekso has helped thousands of people living with paralysis take millions of steps not otherwise possible. By designing and creating some of the most forward-thinking and innovative solutions for people looking to augment human capabilities, Ekso Bionics is helping people rethink current physical limitations and achieve the remarkable. Ekso Bionics is headquartered in Richmond, CA and is listed on the OTC QB under the symbol EKSO.\n\nForward-Looking Statements\n\nAny statements contained in this press release that do not describe historical facts may constitute forward-looking statements. Forward-looking statements may include, without limitation, statements regarding (i) the plans and objectives of management for future operations, including plans or objectives relating to the design, development and commercialization of human exoskeletons, (ii) a projection of financial results, financial condition, capital expenditures, capital structure or other financial items, (iii) the Company's future financial performance and (iv) the assumptions underlying or relating to any statement described in points (i), (ii) or (iii) above. Such forward-looking statements are not meant to predict or guarantee actual results, performance, events or circumstances and may not be realized because they are based upon the Company's current projections, plans, objectives, beliefs, expectations, estimates and assumptions and are subject to a number of risks and uncertainties and other influences, many of which the Company has no control over. Actual results and the timing of certain events and circumstances may differ materially from those described by the forward-looking statements as a result of these risks and uncertainties. Factors that may influence or contribute to the inaccuracy of the forward-looking statements or cause actual results to differ materially from expected or desired results may include, without limitation, the Company's inability to obtain adequate financing to fund the Company's operations and necessary to develop or enhance our technology, the significant length of time and resources associated with the development of the Company's products, the Company's failure to achieve broad market acceptance of the Company's products, the failure of our sales and marketing organization or partners to market our products effectively, adverse results in future clinical studies of the Company's medical device products, the failure to obtain or maintain patent protection for the Company's technology, failure to obtain or maintain regulatory approval to market the Company's medical devices, lack of product diversification, existing or increased competition, and the Company's failure to implement the Company's business plans or strategies. These and other factors are identified and described in more detail in the Company's filings with the SEC. The Company does not undertake to update these forward-looking statements.", "source": "Benzinga.com"}