{"published": "2015-09-13T15:06:50Z", "media-type": "News", "title": "Zuma hails move to beatify South Africa’s first Catholic martyr", "id": "43a81c52-9f36-4292-afe3-274d71779c85", "content": "The beatification of Tshimangadzo Samuel Benedict Daswa, a school principal in Limpopo Province, is scheduled for September 13, an event described by Zuma as “momentous” and “historic”. \n \n JACOB ZUMA “This is a significant moment for our country and indeed the African continent as a whole. Such ceremonies are extremely rare in the history of the Catholic Church. \n \n“This is the first ever beatification in Southern Africa. We are truly humbled that a South African is being honoured in this manner,” Zuma said. \n \nDaswa will from tomorrow be known as Blessed Benedict Daswa. \n \nDaswa was beaten, stoned and burnt to death for his beliefs on February 2, 1990, the very date on which then President FW de Klerk announced the release of Nelson Mandela, who later became South Africa’s first black president, and the unbanning of political organisations. \n \n“The beatification service will restore the dignity of Mr Daswa and inspire people all over the world to do good at all times even under extremely difficult situations,” Zuma said. \n \nZuma said Daswa lost his life because he believed in human rights and dignity and did not support the persecution of fellow villagers on allegations of witchcraft. \n \nMany people, especially elderly women, have lost their lives due to accusations of witchcraft in some communities. \n \n“Such practices have no place in our country and we are happy that this is not widespread,” Zuma said. \n“May this ceremony remind all of the need to unite in fighting this dangerous practice of stigmatizing and condemning innocent people, especially women, due to gossip and innuendo,” Zuma said. \n \nDeputy President Cyril Ramaphosa will represent the government at the beatification ceremony which will be watched by millions of people in South Africa and beyond. \n \nThe Catholic Church has described Daswa as a man who led a holy life, a diligent worker, a good family man, an industrious educator, an active layman, an avid sportsman, an involved community leader, a man of charity and, above all, a person of deep prayer and spirituality.  Enditem \n \nSource: Xinhua", "source": "Spy Ghana"}