{"published": "2015-09-16T14:15:03Z", "media-type": "News", "title": "Amgen to Buy Dezima, Signs Pact With Xencor -- Update", "id": "5dd652dc-facd-4593-96ff-41dfb72775ed", "content": "Amgen will pay $300 million in cash upfront and up to $1.25 billion in milestone payments for cholesterol-drug maker Dezima. The deal, which could be valued at more than $1.5 billion, is expected to close in the fourth quarter. \n \n\r\n     Dezima is currently developing TA-8995, an oral drug that reduced low-density lipoprotein cholesterol by up to 48% in a mid-stage trial. \n \n\r\n     In August, the Food and Drug Administration approved Amgen's cholesterol-lowering Repatha, teeing up a rivalry with a similar treatment that was approved just weeks earlier. \n \n\r\n     The agreement with Xencor covers six programs for which Amgen will be fully responsible for preclinical and clinical development and commercialization. \n \n\r\n     The collaboration, which includes molecular engineering by Xencor and preclinical development of bispecific molecules for five programs proposed by Amgen, brings together Amgen's capabilities in target discovery and protein therapeutics with Xencor's XmAb antibody engineering technology platform, the companies said. \n \n\r\n     Amgen, which has faced pressure from activist shareholders, like other big drug companies needs to bring new treatments to market as older ones face the threat of low-price competition. \n \n\r\n     An appeals court recently denied California-based Amgen's request to block Swiss rival Novartis AG from selling a biosimilar version of Amgen's cancer-care medicine Neupogen. Last year, the drug brought in $5.76 billion and represented a quarter of Amgen's top line. Novartis said it would start selling the first biosimilar drug in the U.S. at a 15% discount to the original. \n \n\r\n     Xencor, also based in California, specializes in developing monoclonal antibody therapeutics for the treatment of cancer, autoimmune disorders and asthma, among other conditions. \n \n\r\n     Under the terms, Xencor will receive a $45 million upfront payment and is eligible for up to $1.7 billion in milestone payments. Xencor may also receive royalties, the companies said. \n \n\r\n     Write to Lisa Beilfuss at lisa.beilfuss@wsj.com \n \r  \n\r\nSubscribe to WSJ: http://online.wsj.com?mod=djnwires \n \r  \n\r\n  (END) Dow Jones Newswires \n \n\r\n  September 16, 2015 09:57 ET (13:57 GMT) \n\r\n\r\nCopyright (c) 2015 Dow Jones & Company, Inc.", "source": "Morningstar.com"}