{"published": "2015-09-22T14:15:00Z", "media-type": "News", "title": "Central Melbourne divided in battle for hotel beds", "id": "6a3bc1e5-7be0-4a4e-8006-c17e4a99946e", "content": "Once shunned by business and visitors as a barren streetscape, the western half of Melbourne's CBD over the past decade has been transformed. \n\nThe \"battle of the beds\" in Melbourne is shifting in favour of hotels in the city's western precincts as weary travellers choose venues close to major transport hubs.\n\nOnce shunned by business and visitors as a barren streetscape, the western half of Melbourne's CBD over the past decade has been transformed by rapidly rising apartment towers and a dramatic shift of thousands of office workers and apartment dwellers to the Docklands.\n\nThat change is being reflected in visitor habits, STR Global data shows.\n\nA shift in room and occupancy rates has taken place as guests are more likely to place their heads on a hotel pillow to the west of Elizabeth Street.\n\nAnalysis of all hotels in the CBD, Southbank and Docklands – divided geographically to the east and west of Elizabeth Street – shows occupancy rates in the west have climbed between 1 and 2 percentage points higher and there has been a much sharper jump in revenue per room.\n\nAverage revenue per room in hotels in the city's western end were $15 higher in 2014 than those in the east and $14 more over this year to August, STR Global data shows.\n\nThe different occupancy and revenue rates might be linked to contrasting accommodation standards at each end of the city as well as \"demand metrics\", STR Global's business development manager, Matthew Burke, said.\n\nThe city's premium five-star hotels clustered around the Paris end of Collins Street have traditionally experienced better than average visitor metrics.\n\nCBRE's latest Australian Hotel Markets Snapshot shows Melbourne's revenue per average room (REVPAR) was up 3.8 per cent in financial year 2015.\n\n\"The short-term outlook for Melbourne is for continued room demand growth,\" it said.\n\nUntil relatively recently, most hotel accommodation was concentrated in the city's east.\n\nGary Stickland, general manager of the boutique Alto Hotel on Bourke, said the redevelopment of Southern Cross Station to include the SkyBus depot had put the western end of the city on travellers' radar.\n\nAlto had an average occupancy rate of 93.1 per cent last financial year.\n\nMajor events at the Melbourne Convention Centre, Etihad Stadium and the Grand Prix in Albert Park also attracted guests wanting the convenience of proximity to venues.\n\n\"In February 2016, we are already fully booked for one weekend for the Royal [Edinburgh] Military Tattoo,\" Mr Stickland said.\n\n\"At the end of the day, people don't come to Melbourne to stay in a specific hotel . . . they come to a city or destination for a reason. They want to be close to the event that they're attending or the activity they're wanting to participate in,\" he said.\n\nThe expansion of Docklands has relocated the demographic centre of Melbourne to the west.\n\nMr Burke said that shift was likely to accelerate with the vast bulk of future hotel room development in the Docklands end of town.\n\nHoteliers and developers have moved to exploit the trend.\n\nAt least 2246 rooms are in the development pipeline in the western end of the CBD. In contrast, only 432 are expected to be built in the east, STR Global figures show.\n\nNewer hotel stock can also attract more visitors, a factor working in the west's favour. However, it could also prove difficult for existing operators.\n\n\"It's certainly going to be a bit of a challenge,\" Mr Stickland said. The story first appeared on The Sydney Morning Herald.", "source": "Lakes Mail"}