{"published": "2015-09-03T10:33:12Z", "media-type": "News", "title": "Johnny Manziel's elbow injury has Jon Gruden worried", "id": "9e817c44-4d91-450f-bb05-340964b99638", "content": "Johnny Manziel hasn't exactly had the best of starts to his NFL career, to say the very least. \n Bad Start  \nThe Cleveland Browns spent a first round pick on the quarterback from Texas A&M, hoping that he would become the new face of the franchise. Instead, Manziel decided to party and drink rather than learn the playbook, and was soundly beaten out by Brian Hoyer to the Browns starting QB. \n \nBut Manziel looked like he was turning his career around, until an elbow injury basically handed the starting job this year to Josh McCown. And that injury has this former NFL head coach worried. \n SIGN UP NOW  \nWant to become a GMS writer? Sign up now and submit a 250 word test article: http://gms.to/haveyoursay4 \n Gruden Worried  \nSuper Bowl winning head coach Jon Gruden was speaking on a conference call ahead of the new season, and revealed that he was concerned about Manziel's elbow and the long term consequences it could have. \n \n“It was a little bit of a surprise to me,” Gruden said, according to Cleveland.com . “I don’t remember hearing about a lot of arm problems until recently. I had not had that brought to my attention, so I would be very concerned. His arm never came up when I met with him.” \n \nGruden worked with Manziel in the summer, with the ESPN employee and host of Gruden's QB Camp helping Manziel improve his game ahead of the 2015 season. \n Concerned Coach  \nGruden said that he didn't know anything about any elbow problems with the former Heisman Winner, and the former Oakland Raiders head coach seemed very surprised to learn that Manziel was having to spend time on the sideline. \n \r \n\"Hopefully it's nothing severe, but I'd be very concerned anytime a young quarterback or any quarterback is on the shelf for arm reasons,\" Gruden said. \"I haven't seen that anywhere else in pro football this year.\" \n\r  \nThe elbow problems have prevented Manziel from playing at a time when he was making real progress on the field, showing more maturity off the field and generally being a calmer presence on it, while under center. \n \n\n \nDo YOU want to write for GiveMeSport? Get started today by signing-up and submitting an article HERE: http://gms.to/writeforgms", "source": "GiveMeSport.com"}