{"published": "2015-09-08T18:52:42Z", "media-type": "News", "title": "Why You Ought to Think Twice Before Assigning a Pricey Textbook", "id": "9d78a781-0a42-4b52-8b31-22a72c066187", "content": "L ast fall one of my sons anguished over the price of a $150 textbook for a college calculus class. \n\r \nHe looked for a used version or a rental, to no avail. So he dutifully bought the new book, put it on his desk in his dorm room, and never looked at it again. He used parts of a digital supplement packaged with it. The book, though, still in pristine condition, lies in a bin in his room at home. He wasn’t able to sell it back. \n\r \nThere’s nothing unusual about that story, which makes it all the more disturbing, especially as college costs escalate. I hear similar examples all too frequently from the students I work with. A few semesters ago, a student in one of my classes even asked me outright: \"If I buy this book, will we use it?\" \n\r \nFederal regulations that took effect in 2010 were intended to provide clarity on textbook costs and, ideally, to make course materials more affordable. The regulations require publishers to disclose prices to faculty members and allow students to purchase books, CDs, and other supplemental material separately rather than as a bundle. The law also requires colleges to provide a list of required books and materials for students when they register for classes. \n\r \nThat approach seems to be working, at least to an extent. Recent data from the National Association of College Stores show that students spent nearly 20 percent less on required course materials in the 2014-15 school year than they did in 2007-8. But that still amounts to $563 for an academic year, with a typical textbook selling for $79 (up from $57 in 2007). \n\r \nIncreasingly, students simply refuse to buy textbooks even if professors require them, which is not surprising. Over the past four years, surveys have found that two-thirds to three-quarters of college students refused to buy textbooks because costs were too high and many instructors used only a few chapters. Others buy bootleg digital copies or photocopy chapters from books that other students have bought. Many alter their class schedules based on the price of textbooks. \n\r \nSo what’s the point of textbooks? I’ve never been a fan of them, either as a student or as a professor. By textbooks, I mean books that survey the breadth of a topic, chapter by boring chapter. They are intended to feed required information to students, not to help them think or learn. As an undergraduate, I found these types of books turgid and pedantic. They offered little in the way of enlightenment. Rather, they felt like punishment. Like students today, I avoided them whenever I could. \n\r \nAll too often, professors use textbooks and lectures in tandem. They start with the book and plan a course around it, picking a chapter here and a chapter there, or simply following along with the author’s outline and instructor’s supplement. Then they assemble students in a lecture and tell them the points of the textbook they should pay attention to. (Or should have paid attention to had they bought the book.) \n\r \nThat approach emphasizes facts over thinking. It looks at information as rare and static rather than abundant and dynamic. The world has moved on from that model. But in far too many cases, education hasn’t, treating students as empty vessels that need filling rather than as distinct individuals who need guidance in learning on their own. It’s an information-first approach rather than a learning-first approach, one that emphasizes the what rather than the how and the why. \n\r \nI certainly understand textbooks’ attraction for teachers, especially overworked, underpaid adjuncts and graduate students who lack the time and resources to teach any other way. The books provide a ready-made framework for classes. They offer a consistent form of information that instructors can rely on across multiple class sections. They save time by cutting down on the need to constantly search for new material, especially when publishers provide lesson plans, PowerPoint presentations, and quizzes. And yes, even in a world of dynamic information, students need some foundational information and understanding to work with. \n\r \nSo I’m not arguing that textbooks are evil or that instructors who use them are remiss. But here’s what I would like to see teachers do: Before you assign a textbook, check the price. Ask yourself whether students really need it and will truly learn from reading it. Check to see whether an open-source alternative is available. Scour the web and enlist your college’s librarians to find articles and posts that provide the same — or even better — information as in the textbook. Have your students find and recommend readings for your class. Work with colleagues to create a shared pool of effective course materials. Work with your teaching center to improve your approach to using class materials and class time for learning. \n\r \nIn short, work through the decision to assign a textbook as you would a research question: Gather information. Weigh competing options and opinions. Move beyond the obvious. Innovate wherever possible. Revise. Seek feedback from peers. Revise again. Then justify your conclusion in clear, convincing terms. \n\r \nThat’s what you expect your students to do. It’s not easy. But then neither is paying hundreds of dollars a semester for unused textbooks. \n\r \nDoug Ward is an associate professor of journalism and associate director of the Center for Teaching Excellence at the University of Kansas.", "source": "Chronicle of Higher Education"}