{"published": "2015-09-08T13:11:39Z", "media-type": "News", "title": "Los Angeles CFOs Reveal Hiring Plans For Next Six Months", "id": "460126ff-0236-4c9f-bc58-723875ee9885", "content": "LOS ANGELES, Sept. 8, 2015 /PRNewswire/ -- The just-released Los Angeles Professional Employment Forecast from Robert Half indicates 19 percent of Los Angeles chief financial officers (CFOs) expect their company to create new jobs in the next six months. Another 62 percent plan to hire for open roles. \n \nCFOs were asked, \" What are your company's hiring plans for full-time, professional-level employees in the next six months? \" Their responses: \n \nSept. 2015 – Feb. 2016 \n \nMarch – Aug. 2015* \n \nExpanding – adding new positions \n \n19% \n \n19% \n \nMaintaining – only filling vacated positions \n \n62% \n \n64% \n \nFreezing – not filling vacated positions or creating new ones \n \n13% \n \n13% \n \nReducing – eliminating positions \n \n5% \n \n4% \n \nDon't know/no answer \n \n1% \n \n1% \n \n*Responses do not total 100 percent due to rounding. \n \nView an infographic featuring the survey results. \n \n\"With the current business growth in Los Angeles, there is tremendous competition among companies to attract and retain professional-level candidates with industry-specific experience, especially in the areas of accounting, real estate and human resources,\" said Brandi Britton, district president for Robert Half in Los Angeles. \"Compensation is constantly improving, and the time to fill positions is being shortened as skilled candidates have more and more options. If you need to hire, move fast.\" \n \nRecruiting Challenges \nOrganizations looking to add staff may face difficulties, Robert Half's research shows. Fifty-three percent of Los Angeles CFOs surveyed said it's somewhat or very challenging to find skilled candidates for professional-level positions today. \n \nBusiness Confidence \nAccording to the Professional Employment Forecast, Los Angeles CFOs are optimistic about their company's growth. Ninety-three percent of executives reported being somewhat or very confident in their company's prospects for growth in the next six months. This compares to 91 percent in the previous six months. \n \nCompensation Upgrades \nTo address staffing challenges, some firms are strengthening the salary and benefits they offer. Thirty-four percent of Los Angeles CFOs surveyed said they have modified their company's compensation plan in the past 12 months as a way to enhance recruiting and retention efforts. \n \nAbout the Professional Employment Forecast \nThe Professional Employment Forecast was developed by  Robert Half , the world's first and largest specialized staffing firm, and conducted by an independent research firm. The local results reflect a two-period rolling average based on interviews with 200 CFOs from a stratified random sample of companies in the Los Angeles area with 20 or more employees. Executives were asked about their hiring and business outlook, including plans to add professional-level employees in areas such as accounting, human resources, administrative, legal, marketing and information technology. \n \nAbout Robert Half \nFounded in 1948, Robert Half is the world's first and largest specialized staffing firm. The Menlo Park, Calif.-based company has more than 340 staffing locations worldwide and offers online job search and management tools at roberthalf.com . For career and management advice, follow our blog at roberthalf.com/los-angeles .  \n \nPhoto - http://photos.prnewswire.com/prnh/20150904/263900-INFO \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/los-angeles-cfos-reveal-hiring-plans-for-next-six-months-300138371.html \n \nSOURCE  Robert Half \nhttp://www.prnewswire.com/news-releases/los-angeles-cfos-reveal-hiring-plans-for-next-six-months-300138371.html", "source": "International Business Times"}