{"published": "2015-09-12T21:57:40Z", "media-type": "News", "title": "Many in Milford fighting to keep memory of scrappy Silver Sands squatter alive", "id": "a52180cb-1ec2-4469-9749-f851e4fb7d80", "content": "MILFORD >> A group of more than 1,000 residents lobbying to have the boardwalk at Silver Sands State Park named after the park’s legendary squatter, the late Doris Gagnon, and is showing the same kind of spunk that Gagnon showed when the state took her house by eminent domain in 1971. \n  \nThe new movement in honor of Gagnon began when resident Greg Smith was walking on the boardwalk with his wife, Christine, this summer and recalled Gagnon, who he saw many times as a youngster while delivering newspapers and fishing. Smith’s family had rented a place on Joy Avenue and was forced to leave because of redevelopment. \n  \n“She was the nicest lady in the world,” Smith said. “As I got older, I understood the situation and I admired her for it.” \n  \nOn a whim, after that stroll, he decided to start a group Facebook page to remember the redevelopment plan for the area that never came to fruition, with an emphasis on remembering Gagnon and the contribution she “made to the unique character of Silver Sands and the surrounding community.” \n \n\r\r \n  \nSmith was shocked that within a week, there were more than 1,000 members  of the “ Doris Gagnon Boardwalk at Silver Sands State Park ” Facebook group. Since then, they’ve picked up 10-15 members a week for some 1,220 to date, Smith said. \n  \n“She became sort of a folk hero,” Smith said of Gagnon. \n  \nThe state isn’t going for it so far — Department of Energy and Environmental Protection spokesman Dennis Schain told the Register the agency does not name boardwalks or parks after people. \n  \nState Rep. Kim Rose, D-Milford, intervened and got the state to agree to a historical kiosk outlining the history of the area, including Gagnon in the mix. There is also a bench dedication program that for a fee could result in a bench named after Gagnon, Rose said. \n  \n“She was a woman who stuck by her guns and for what she believed in,” Rose said. “I admire her. She was very courageous.” \n  \nBut Smith says the group won’t easily accept just a kiosk and bench, and will keep the movement going to have the boardwalk named for the feisty Gagnon, a strong symbol in the historic redevelopment plan that still impacts the city today. \n  Drumming up support \nThe Facebook page says: “Join our group to support remembering Doris Gagnon at Silver Sands State Park, which would be a little bit of justice and a great ending to her story.” \n  \nThe group is having a meet up at 2 p.m. Sunday on the boardwalk to talk about Gagnon and redevelopment and there are some surprises in store, Smith said. \n  \nPart of Gagnon’s popularity to this day, he said, is that there is still “a lot of sensitivity,” in the area to the redevelopment plan that never happened and Gagnon represents the resistance. Dozens of houses in the shore area by Silver Sands were taken by eminent domain — disrupting many a family, lifestyle — and close-knit neighborhood of many mostly summer homes. \n  \nAlthough her home was demolished — while she was detained at the grocery store, as legend has it,  — Gagnon refused to leave and while squatting, spent years fighting the state. The state acquired Silver Sands after hurricane “Diane” destroyed 75 homes in 1955, officially acquiring the beach in 1960, according to DEEP’s website . \n  \nGagnon, who was through the years widely known as the “chicken lady,” “crazy old woman” “the squatter” and a “pain in the backside,” was a folk hero to many, for standing her ground and refusing to leave her property. \n  \nA widow who stood 4 feet 10 inches tall and had a cherubic face and few wrinkles, despite her lifestyle, Gagnon claimed the state had illegally demolished her house and she refused to accept the $15,000 offered as compensation. \n  \nAt one juncture, when she tried to prevent the demolition of her home, she was sent to jail and a psychiatric hospital for evaluation, according to Register archives. Doctors determined after a 12-day stay that she was sane. \n  \nGagnon went on to live in her car at Silver Sands for a year, then a tin shack, and finally, a trailer without running water, a flushing toilet, phone or electricity. She maintained that the state should build her a new house and pay her damages. \n  \nHer makeshift homestead and menagerie that included 50 chickens and a few dogs and geese, remained at the park for 23 years until her death in 1994 at age 77 from cancer she had battled since 1988. She died at Connecticut Hospice. Gagnon often noted she had an incredible view of Charles Island. She had no children — often mentioning she had two miscarriages — and complained openly that her late husband was a problem drinker and the marriage was bad, according to Register archives. \n  \nHer squatting story made the New York Times, attracted the interest of Hollywood producers at one point, and the local press corps often fought for the latest “Doris” scoop. \n  \nAccording to Register archives, Gagnon persevered through three trips to jail. One was when her home still stood — she got four days for refusing to pay tickets for parking in front of her home. Another was related to her refusal to leave the park and another was in 1977 when Gagnon used a pellet gun to fend off a man she said was trying to rape her. When she asked police to chase the man, records show two officers charged her with breach of peace and carrying a dangerous weapon. Gagnon sued for wrongful arrest and was awarded $14,000 in damages, most of which she used to buy a new car. \n  \nThe state moved to evict her from the park in January 1989 after Milford health officials said they had found bags of human waste in the trailer behind her compound — something Gagnon denied. The state in 1990 dropped eviction plan, but left the option open legally. \n  Gagnon’s legacy \nOn the occasion of her death, the now late Mayor Fred Lisman told the Register he would miss Gagnon, who often showed up at his office with complaints. \n  \nLisman said at the time Gagnon would become legend and any history of Milford would have a notation to her. \n  \nLisman told the Register: “Many times, many people disagreed with what Doris had to say. Whether she was correct or not is irrelevant at this point but she stayed there and got what she wanted. She fought for what she believed in. Doris fought the city of Milford, the state and the federal government and she basically won.” \n  \nThe city offered Gagnon senior housing, but she declined. In a 1993 interview with the Register, Gagnon said she was still holding out for “enough money to buy me a great big farm somewhere and be well-off the rest of my life.” She also said she would never enter a convalescent home, “because I couldn’t bring my animals and I hate Bingo.” \n  \nGagnon was a familiar face on city streets where she tooled around in her beat-up, old Toyota. \n  \nBecause of the media exposure given her battle, Gagnon said she received letters from around the nation urging her not to give up. Gagnon was known for her confrontational manner, once picketing a local newspaper because it refused to publish one of her letters. \n  \nBut friends and fans told the Register that Gagnon had an extraordinarily kind side, despite her sometimes gruff demeanor. \n  \nGagnon volunteered to take the elderly to shopping, church and doctor visits. She also was popular among veterans, as she did a lot to help them. Gagnon’s car was plastered with “God Bless Our Troops” stickers and the American Flag flew at her compound. \n  \nKathleen Schurman, owner of Locket’s Meadow Farm and Animal Sanctuary in Bethany, met Gagnon when she moved to the Silver Sands area decades ago, and the women, both animal lovers, became fast friends. \n  \nSchurman said she admired Gagnon because she never quit fighting for what she believed in. \n  \n“She set the standard for principles really high,” Schurman said. “Many people admired her and counted her as a friend.” \n  \nFlora Brooks Santagata, who called Gagnon “Aunt Dot,” as Gagnon was Santagata’s grandmother’s sister, wrote on the Facebook page: “…Thank you everyone for keeping her spirit alive. Aunt Dot did help a lot of Veterans, even though the country she was born & raised in was taking her only home away. A very sad day to the homeless & Veterans when she left us. Even if this doesn’t turn out the way we all want it to, her soul is on that beach everyday & night watching the tides come & go! What a blessing this page is! She is watching us & over her part of that beach. Thank you all!” \n  \nGagnon once told the Register of her fight against the state, the politicians and police, “They’ve met their match in me… God has been on my side through all this. I get tired sometimes, but I plan to keep on fighting.” Some city politicians recommended the state build Gagnon a house in the park and appoint her an honorary ranger. Both the state and Gagnon rejected the idea. \n  \nGagnon, who lived on social security in later years, once told the Register she had an eighth-grade education and had moved here from New Hampshire. Gagnon said she owned a beauty salon at one time, worked as a machinist and made lawn ornaments. \n  \nWhen she began living in the trailer, Gagnon kept her tin shack, calling it her “exercise” room, according to a Register interview in the early 1990s. \n  \nGagnon survived the Blizzard of 1978 at her makeshift compound and once in later years when the Fire Department notified her of an impending winter coastal storm, Gagnon, with the help of a wrecking company, managed to get her two small house trailers off the sandy beach to higher ground, Register archives say. She escaped most of the flooding that damaged or devastated dozens of shorefront houses. \n  \nGagnon fought the state with the help of prominent attorney John Williams, whose firm took the case pro bono. Even after she filed a complaint against the attorneys, charging that they didn’t properly handle her eviction fight, Williams said he continued to admire Gagnon’s gumption. \n  \nWhile some believed Gagnon’s squatting delayed plans to convert Silver Sands into a recreational area, it was widely known at the time that the state didn’t have enough money to move ahead with the work and did not upgrade the park until years after her death. \n  \nDEEP now has a major $8 million upgrade planned at Silver Sands that will include amenities such as a bathhouse, snack stand and toll both, where are parking fee will be charged. Many residents are opposed to parts of the plan, particularly the charge for parking that would apply to Milford residents as well.", "source": "New Haven Register"}