{"published": "2015-09-26T17:14:24Z", "media-type": "News", "title": "Plato saves tenth, bemoans 'small engine issue'", "id": "92377bb9-92e6-4ec0-86be-cf83052b155c", "content": "Jason Plato: I think the balance is OK but we re just struggling with a little engine problem. We re not quite sure what is but the boys are going to pull it apart and have a… \r \n26 September 2015 \n\nJason Plato: I think the balance is OK but we're just struggling with a little engine problem. We're not quite sure what is but the boys are going to pull it apart and have a look. \n\nAlthough Jason Plato was happy to salvage tenth during today's qualifying at Silverstone, the Team BMR driver was left to rue a small engine issue, which could potentially thwart the double British Touring Car champion's quest for a third title. \n\nThe Volkswagen CC driver spent most of the 30 minute session mired in thick of the midfield runners but a last minute flyer pulled Plato back into the top-ten as his chief championship rival Gordon Shedden qualified onto the front row. \n\nTo compound Plato's woes, the 93-time race winner said his best lap was then compromised when Rob Austin made a slight error in front but didn't hold it against the Audi driver. \n\n\"Yeah a bit of a save,\" Plato told crash.net \"I lost a tenth on my best lap with Rob Austin, which wasn't his fault. He made a mistake going into Luffield and didn't realise I was on the inside so he then cut across and I had to back out of it. \n\n\"What would a tenth do? Put me further up the road maybe but we've got an engine problem. The car at Rockingham wasn't quick in a straight line and it's not quick in a straight line here.\" \n\nPlato says the issue is isolated to his side of the garage and admits he and his BMR squad are still yet to determine what the underlying cause for the loss of power is. \n\n\"We've seen a big deviation between my speeds down the straights compared to Colin [Turkington] and Aron [Smith]. It's just on my side,\" Plato continued. \n\n\"Also with the weight delta, Colin and I should be closer together while Aron should be up the road. I'm a further away from Colin down the straight, than he is to Aron. \n\n\"We get to the straights and they keep accelerating but I start slowing up. That's not just weight, that's something else and we saw that at Rockingham. Normally, with no weight on, the VW's – apart from the Ford's – are the quickest in the straight line. At Rockingham with no weight I was mid grid. \n\n\"Here [Silverstone] I think we'll be at the bottom of the speed traps in cle…", "source": "MyInforms"}