{"published": "2015-09-28T02:51:52Z", "media-type": "News", "title": "Long Live Rogue", "id": "0e6be27f-718d-4a80-9cdf-3fe6c527da1e", "content": "Rogue Ales is a Pacific Northwest institution. They’ve been brewing big beers with bold flavors and premium ingredients since long before the craft beer revolution was just a twinkle in Santa Claus’ eye (Santa Claus is responsible for the craft beer revolution right?). It was way back in 1988 that Jack Joyce, Bob Woodell, Rob Strasser, and Jeff Schultz launched the first incarnation of Rogue along Lithia Creek, and they’ve done nothing but be increasingly awesome since then. \n \nJoyce, the CEO, is quoted as saying: \"We try to do four things – keep making great product, keep trying to make our packaging great, keep trying to integrate ourselves in our communities, and keep creating unique thunder (in promotions)…\" \n \nCertainly, Rogue has a wide line of wonderful, inventive brews, and even if they don’t all light up your tastebuds like a San Diego fireworks display, it’s easy enough to agree that their commitment to crafting beer that is free of chemicals, preservatives, or additives is beyond admirable. I haven’t had the pleasure of living near Rogue’s Oregon world headquarters, so it’s hard for me to judge their level of community integration, but my guess is that they’re pretty damn good neighbors. \n \nThat leaves us with two items that go hand in hand: creating eye-catching, noteworthy packaging and offering \"unique thunder\" in promoting brand awareness. And it is in these two elements that Rogue really outdoes itself. They devote time, money, and endless creative energy towards cultivating and crafting packaging and promotional ideas that set them apart from the marketing white noise of countless craft breweries. Rogue wants you to notice them because they believe they deserve to be noticed, and that makes all the difference. \n \nTake for instance our pint-sized tumblers made from recycled Rogue beer bottles . The design of each glass is indisputable evidence of Rogue’s commitment to personality through packaging. The labels double as commercial art that communicates the fun-loving irreverence combined with serious, dedicated craft brew know-how that is the corporate personality of Rogue Ales. \n \n\n \n\n \nIf you’re on the forefront of Santa Claus’ great craft beer movement, these glasses are a must-have. Have them ready for your next pint with friends and you’ll be marking yourself as a truly dedicated craft aficionado who would never settle for boring old clear glass. Long live beer, long live fun, long live Rogue! \n \n\n ]]>", "source": "WNY Media Network"}