{"published": "2015-09-28T12:22:52Z", "media-type": "News", "title": "Will Carling blasts England head coach Stuart Lancaster after Wales defeat", "id": "a542e5c1-a8ef-4262-b87e-cfbce637dd42", "content": "England begin the countdown to the defining match of Stuart Lancaster's reign amid accusations by former captain Will Carling that their head coach has created a \"classroom orientated environment\" among players treated as \"schoolboys\". \n \nWorld Cup survival hinges on the outcome of Saturday's showdown with Australia after Wales left Twickenham with a stunning 28-25 upset victory. Should England lose, they will become the first single host nation to exit the tournament at the group stage. \n \nCaptain Chris Robshaw has been condemned for opting for an attacking line-out in the closing moments when awarded a penalty instead of giving Owen Farrell the chance to kick for goal - albeit from a difficult position near the touchline - that would have secured a draw. \n \nCarling, who led England 59 times, is scathing of Robshaw's \"unbelievable\" decision and of the selection against Wales, but saved his most savage criticism for the failure by Lancaster - a former schoolteacher - to empower his leaders. \n \n\"I got the sense that England were panicking. I don't blame Chris as much as I blame others. I blame the environment,\" Carling told Radio Five Live. \n \n\"We have a very prescriptive environment in the England team. I've listened to Stuart Lancaster say for years that 'I don't have the leaders and therefore we're having to make all the decisions as coaches'. It's a very classroom orientated environment. \n \n\"My view is that he has had leaders and that he needed to have trusted them and develop them. \n \n\"What we watched in the last 10 minutes was a confused debate between people who have never been given responsibility to lead and drive the team. Instead, we've treated them as schoolboys.\" \n \nHad England secured a draw against Warren Gatland's underdogs, they would have been in a stronger position come the final reckoning of an unprecedented tough Pool A. \n   Promoted stories   \n\"You have to kick the penalty. Farrell was kicking brilliantly and if we'd drawn, that would not have been a disastrous result,\" Carling said. \n \n\"We got a bonus point against Fiji with the game against Australia to come, so we would have been very much still in the pool with no sense of panic. It was such an unbelievable decision and sadly the wrong one. \n \n\"We were far more likely to get those three points than a line-out. There are so many more variables in going for a line-out drive, especially when we executed it as badly as we did.\" \n \nLancaster's decision to drop George Ford at fly-half in favour of Farrell and start Sam Burgess at inside centre paid off to the extent that Wales' power game was nullified, but Carling insists it also deprived England of the creativity they needed to kill off the match. \n \nCarling, who won 73 caps from 1988-1997, has called for Ford to be restored to the starting XV and for Henry Slade to be picked in the centres. \n \n\"England have to pick sides to win games rather than being hard to beat. There's a very subtle difference, but a very important one,\" Carling said. \n \n\"I think we picked a team against Wales that would be hard to beat, would survive off mistakes and pressure when we have players who are good enough to go out and win games. \n \n\"Some of the selections were bizarre and the timings were strange. To me the mindset was all wrong. We'd beaten Wales on a Friday night in Cardiff in February by attacking them and we should have done the same on Saturday. \n \n\"I don't know where Lancaster goes now. Henry Slade is a great footballer and should have been playing against Wales. We need some footballers in there. \n   \n Share article  \n   \n\"What we witnessed was England dominating in the pack, but we didn't have footballers in the backline who managed to translate the possession and territory into points. \n \n\"If we pick the footballers again, so Ford at 10, Farrell at 12 and Slade at 13, then suddenly we have a backline who can play.\"", "source": "Runcorn and Widnes World"}