{"published": "2015-09-08T16:14:28Z", "media-type": "News", "title": "SmartHalo Turns Any Bike into a Smart Bike", "id": "073beb9e-da75-47b0-b55f-2f386b40ba4f", "content": "If you’re a cyclist, you probably know the feeling: you want to make sure you’re heading in the right direction but that means stopping to pull out your phone or taking your eyes of the road to check Google Maps as you ride. \n \nA Montreal-based startup wants to change that. \n \nSmartHalo has made a device that turns any bicycle into a smart bike. \n \n“Within the team we’re all cyclists. Obviously cycling is perfect, perfectly simple,” says Xavier Peich, SmartHalo’s business director and co-founder. \n \n“But there are a few things that could be improved, so we thought maybe with technology there would be a way to change a few things and make them better,” he notes. \n \nAt the core of the SmartHalo device is a circle of LEDs which guide riders to their destination. \n \nPeich says the circular design allows the device to give cyclists more directional information than a simple directional indicator could. That could come in handy on twisty streets, like those in many European cities, that don’t follow a grid. \n \n“The circle which is awesome because it’s both simple and complex at the same time,” he says. \n \nThe device, which connects to a rider’s phone via Bluetooth, can also track how much and how far a user has been cycling as well as acting as a light and anti-theft alarm. \n \nIt also can give riders notifications about the weather - if its about to start raining, for instance - or when they have an incoming call. \n \nPeich says one of the main things that sets the device apart from other products for bikes is the fact that its intended to remain mounted on a bike, rather than be removed after each ride. \n \nWhile that opened the door to it being used as an anti-theft alarm, he says the actual development of the alarm came out of another problem the team was trying to solve. \n \nPeich says that they wanted the device to go into sleep mode when its not being used while also seamlessly connecting to a user’s phone when they came near. \n \nThey solved that problem with a sensor that would trigger the device to look for the user’s phone whenever the bike moved. If the user is nearby, the device turns on. If it’s not, the alarm is triggered. \n \nSmartHalo is currently raising money for production on Kickstarter . So far, the campaign has raised more than $320,000, well above its goal of $67,000. \n \n“We’ve been very pleased with how it went,” he says. “We’ve been preparing for this for a year now, we did our job before the campaign started to make sure that it would go quickly. My objective was to get to the goal within the first day and we got there in 15 hours.” \n \nPeich says he thinks a device that makes any bike smart will have a broader appeal than purpose-built smart bikes. \n \n“We’ve seen smart bikes, they’re really nice, they’re really expensive,” he says. “I think most people have a bike already, they don’t want to buy a new one just to have smart features.” \n \nWhile many riders might interested in smart features, they’re probably emotionally attached to their current bike, he says. “I know I am.”", "source": "Tech Vibes"}