{"published": "2015-09-08T07:27:54Z", "media-type": "News", "title": "British father 'reunited with son' after El Salvador orders DNA tests", "id": "9b565fe1-1251-4965-af04-bb8b52c282a4", "content": "A British father who feared his baby had been swapped at birth and sold to human traffickers in El Salvador has reportedly been reunited with his son after authorities tracked down the child by ordering other new mothers have their babies DNA tested. \n \r\n\t\t\r \nRichard Cushworth, 41, originally from Bradford, West Yorkshire,  and his Salvadoran wife Mercedes Casanellas had suspected that a doctor at the hospital where she gave birth exchanged their child for another as she slept. \n\r  It is feared the youngster was switched at birth \r \r \nAfter attending a special court hearing before a judge yesterday the couple were told that their biological baby had been identified before the swapped babies were handed back to their respective families, according to news website  Elsalvador.com. \n\r\n\t\t\t\r \nAttorney general Luis Martinez told reporters: \"We have returned the babies to their legitimate parents.  We hope that this has not happened on other occasions.\" \n\r\n\r\n\r\n\r \nMr Martinez said that a review of private and public hospitals' protocols would take place. \n\nThe couple's doctor, Alejandro Guidos, was arrested over the matter but had protested his innocence after being bailed. \n\nProsecutor Dinora Siguenza reportedly alleged yesterday that Dr Guidos was responsible for not following correct procedures and is still being investigated. \n\nThe couple left the Gynaecological Hospital Centre in the country's capital San Salvador with the newborn but made a public appeal on local TV three months on, after a DNA test revealed the boy was unlikely to be their biological son. \n\r\n\t\t\t\r \nMs Casanellas, 39, initially became suspicious when she noticed the features of her newborn differed from those of the boy doctors handed her the day after she gave birth by emergency Caesarean in May. In particular, she thought the second baby had darker skin. \n\nShe took the child to the couple's home in Dallas, Texas, but the pair, both missionaries working in El Salvador, returned to the Central American country after family members also expressed doubts. \n\nA Foreign Office spokesman said: \"We are in regular contact with the Cushworth family to provide support. \n\n\"A full investigation has been launched by local police and we will provide all the assistance that we can.\" \n\r\n\t\t\t\r \n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Luton News"}