{"published": "2015-09-16T20:33:45Z", "media-type": "News", "title": "Sealy & Company and AEW Announce the Disposition of a 437,760-SF Class A Warehouse in Atlanta Industrial Park", "id": "bff70fea-d8d1-414f-8d58-4d14fea7780c", "content": "Transaction Marks Third Disposition for JV in 2015 \n\nDALLAS, TX--(Marketwired - September 16, 2015) - Sealy & Company, a fully-integrated commercial real estate investment and operating company and recognized leader in the industrial real estate market, and AEW Capital Management (AEW) announced the disposition of 200 Interstate South Drive in McDonough, Georgia. The Class A, multi-tenant bulk warehouse is located in the South Atlanta Industrial market, the second-largest submarket in Atlanta. The 434,760-square-foot property features modern amenities, a superior location, and national credit tenants. 200 Interstate South is located in the Interstate South Business Park and features four (4) ingress/egress points with excellent access to I-75 and high visibility. AEW sold the property on behalf of AEW Partners VII, L.P. \n\nWhen the property was acquired in 2013, it was 90% occupied and the in-place rents were 5 to 10% below historical market rental rates. Over the 24-month ownership period, Sealy & AEW successfully executed their strategy to increase occupancy to 100% and brought rents to at or above market while maintaining national credit tenant quality. This was achieved by completing a new 10-year lease for 300,000 square feet to a national credit tenant prior to the existing tenant’s termination and by renewing an existing tenant at a rental increase, both of which created value and enhanced the return upon disposition. \n\n“Sealy’s partnership with AEW has been a tremendous success due to our entrepreneurial approach, local market expertise, and ability to implement creative strategies that add value. We look forward to potential future opportunities with AEW,” stated Scott Sealy Jr., Vice President and Business Development for Sealy & Company. \n\nThe JV is actively pursuing assets and portfolios in major industrial markets with a defined investment size between $5 million and $100 million. \n\nFor more news and information regarding the Sealy/AEW Joint Venture or Sealy & Company, please visit the company’s website at www.Sealynet.com. \n\nAbout Sealy & Company \n\nSealy & Company, a fully-integrated commercial real estate investment and operating company, is a recognized leader in acquiring, developing, and redeveloping regional distribution warehouse, industrial/flex, and other commercial properties. Sealy provides a full service platform for high-net-worth individuals and institutional investors through our development, management, and brokerage divisions. Sealy & Company has an exceptional team of over 100 employees, located in eight offices, with corporate offices in Dallas, TX and Shreveport, LA. In addition to this Joint Venture, Sealy & Company is the sponsor of SSEP, a private equity offering and diversified limited partnership, primarily comprised of industrial real estate assets. For more information please visit www.sealynet.com. \n\nAbout AEW: \n\nFounded in 1981, AEW Capital Management, L.P. (AEW) provides real estate investment management services to investors worldwide. One of the world’s leading real estate investment advisors, AEW and its affiliates manage over $48 billion of property and securities in North America, Europe and Asia (as of June 30, 2015). Grounded in research and experienced in the complexities of the real estate and capital markets, AEW actively manages portfolios in both the public and private property markets and across the risk/return spectrum. AEW and its affiliates have offices in Boston, Los Angeles, London, Paris, Hong Kong and Singapore, as well as additional offices in eight European cities. For more information please visit www.aew.com. \n\nImage Available: http://www.marketwire.com/library/MwGo/2015/9/16/11G054331/Images/200InterstateSouth-418153548738.jpg \n\nFor further information, please contact: \n\nKayte H. Hollowell \n\nCorporate Marketing and Communications \n\nSealy & Company \n\n318.222.8700 \n\nPublished Sep. 16, 2015 \n\nCopyright © 2015 SYS-CON Media, Inc. — All Rights Reserved. \n\nSyndicated stories and blog feeds, all rights reserved by the author.", "source": "Virtualization Conference & Expo"}