{"published": "2015-09-09T06:02:00Z", "media-type": "News", "title": "Giving back to good causes", "id": "f613a41b-50a3-413b-9e3b-df9e8545ff5d", "content": "FINDING a way to pair items with the needs of individuals set Australian Local Hero Juliette Wright on the path to establish GIVIT. \n\nIT all began with a fat baby and a husband’s dirty undies.\n\nThis is how founder and chief executive of GIVIT Juliette Wright described the inception of the not-for-profit organisation, which is now a lead partner for the Queensland government during state disasters.\n\n“My baby was so fat that my father-in-law – a dairy farmer – kept dropping hints about what he did with his weaners,” Juliette told a chortling crowd at the QRRRWN gala dinner last Friday night.\n\nThe Australia’s Local Hero of 2015 recipient and finalist in Cosmopolitan Woman of the Year Award explained it began when her breastfed baby was too big to fit his designer clothes sent from friends and family overseas.\n\n“I received these clothes that were hardly worn and I was about to put them in a clothes bin in Dayboro, but someone had put a severed pigs head in there and I couldn’t put these beautiful clothes in there.”\n\nSo she decided to donate them directly to charity.\n\n“I was so grateful for my life, so I decided to give them away.”\n\nThe only problem was, no charity wanted them. Even when she explained they weren’t just ordinary baby clothes – they were designer baby clothes.\n\n“I called up a shelter, and they wouldn’t take them, so I asked them what they wanted. They said new undies,” she said.\n\nAnother shelter she called said they needed sanitary pads, and another needed a pair of closed in work boots.\n\nIt was an eye-opener. The boots were needed as a family was homeless because the father had lost his job and couldn’t afford a pair of work boots that he needed to get a job on road works.\n\n“We seem to think that what charities need is what we want to donate,\" she said.\n\n“These charities don’t have a big shed at the back to house the fridge and shed waiting for our donation.”\n\nWith this epiphany, Juliette was determined to help and skimmed from her grocery money, buying new undies, a new pair of boots and sanitary pads. She delivered these to the shelters.\n\n“I felt so good and really connected to the community.”\n\nIt also got her thinking. What if she had a website that matched what charities wanted with what people had ready to donate?\n\n“I spent $500 building a website, and it absolutely failed,” Juliette said.\n\nThe website was not able to remove items from the list once they were donated.\n\n“Every single person I know said it would fail.”\n\nAnd Juliet was filled with rage - she was not going to give up, so she spent another $900, drew up a contract to ensure what was donated fell off the list, and had another website developed.\n\nSo began GIVIT.\n\nFor the next few weeks, Juliette spent the days glued to her computer, watching for donations that would match charity needs.\n\nThen she would get them together. It eventually came to a head.\n\n“My husband asked me if I would have the time to buy him some undies, and I said I couldn’t because I was waiting for donations.”\n\nWhen she asked him, why, he pointed to the two-week pile of washing – mainly his – pushed in the corner.\n\n“He said, ‘This website is not automatic’.”\n\nThat night, he came home with a bottle of wine and an idea. The virtual warehouse was born.\n\nNow the system works where donations are kept at the donor's place until a person with need selects it. That way, there are no more situations as seen in the Black Friday fires, where 40,000 pallets of donated goods are still in storage.\n\nThese pallets take up more than 50,000 square metres and cost $8 million to store, and no one has the time to sort through.\n\nAs a result of the virtual system, and the fact needs are matched directly with donations, GIVIT now handles national disasters for the Queensland government.\n\nIn 2011, when Queensland was hit by devastating floods, GIVIT had 1.8 million hits resulting in 33,500 goods matched in three weeks.\n\n“Charities can go into the virtual warehouse, and the homeless person sitting with them can choose what they need – and it is like buying it because it’s their choice.”\n\nBecause people have a sense of control and ownership, they are more likely to look after what has been donated.\n\n“It’s easy how it works. What is essential for one person is completely different for another, so I need to have no judgement.”\n\nNow GIVIT can handle up to eight disasters at one time.\n\nSo far, it has raised over $600,000 for the Ravenshoe disaster, and it is still dealing with the aftermath of Cyclone Marcia, where it has made 7500 donations.\n\nNow, Juliette has just launched GIVIT Kids, a safe online platform for children to give new or pre-loved belongings.\n\n“I am doing a drought campaign for the next GIVIT project,” she told her inspired audience.\n\nThe story first appeared on Queensland Country Life.", "source": "The Ararat Advertiser"}