{"published": "2015-09-18T07:45:59Z", "media-type": "News", "title": "Roxas nasa Naga para ‘ligawan’ si Robredo", "id": "e60cb74a-9166-488d-bf8d-fa71990baa72", "content": "3:45 pm | Friday, September 18th, 2015 \n   \n\nKINUMPIRMA ng Palasyo na nasa Naga si dating Interior secretary at pambato ng Liberal Party (LP) na si Mar Roxas para kumbinsihin si Camarines Sur Rep. Leni Robredo na kanyang maging bise presidente sa 2016 elections. \n\nSa isang briefing, sinabi ni Deputy Presidential Spokesperson Abigail Valte na hinihintay pa ang magiging sagot ni Robredo sa alok ni Roxas. \n\n“Si former DILG Secretary Mar Roxas has been talking to her about a possible VP run. Sa akin pong pagkakaalam ay magkasama po sila ngayon sa Naga,” sabi ni Valte. \n\nIdinagdag ni Valte na may iba pang grupo na kumukumbinsi kay Robredo na maging running mate ni Roxas matapos namang pormal nang magdeklara si Sen. Grace Poe ng kanyang kandidatura sa pagkapangulo. \n\nIto’y matapos na ring umpisahan ni Presidential Spokesperson Edwin Lacierda sa kanyang Facebook account ang hashtag para sa kandidatura ni Robredo. \n\n“The President is aware of the ongoing talks with Congresswoman Robredo,” ayon pa kay Valte. \n\nHindi naman masabi ni Valte kung bakit hindi si Robredo ang unang pinili ni Aquino para maging bise presidente ni Roxas. \n\n“That I cannot answer. I am not privy to the decisions that were made previously and siguro po mas — the President will be in a better position to explain how they arrived at the process,” giit ni Valte. \n\nNauna nang inalok ni Aquino si Poe na maging running mate ni Roxas. \n     \nRecent Stories: \n    \nComplete stories on our Digital Edition newsstand for tablets, netbooks and mobile phones; 14-issue free trial. About to step out? Get breaking alerts on your mobile.phone. Text ON INQ BREAKING to 4467, for Globe, Smart and Sun subscribers in the Philippines. \n      \nDisclaimer: The comments uploaded on this site do not necessarily represent or reflect the views of management and owner of Bandera. We reserve the right to exclude comments that we deem to be inconsistent with our editorial standards. \n     \nTo subscribe to the Philippine Daily Inquirer newspaper in the Philippines, call +63 2 896-6000 for Metro Manila and Metro Cebu or email your subscription request here. \n   \nFactual errors? Contact the Philippine Daily Inquirer's day desk. Believe this article violates journalistic ethics? Contact the Inquirer's Reader's Advocate. Or write The Readers' Advocate: c/o Philippine Daily Inquirer Chino Roces Avenue corner Yague and Mascardo Streets, Makati City, Metro Manila, Philippines Or fax nos. +63 2 8974793 to 94", "source": "Bandera"}