{"published": "2015-09-06T02:26:44Z", "media-type": "News", "title": "Queen to become longest reigning monarch with business-as-usual approach", "id": "ecec4d75-d3ac-447d-ad39-f3132d7dd861", "content": "The Queen will soon make history when she becomes the longest reigning British monarch - but on the day it will be business as usual for the head of state and her family. \n\nOn Wednesday, she will pass the record set by her great-great-grandmother Queen Victoria who, Buckingham Palace has calculated, reigned for 23,226 days, 16 hours and 23 minutes. \n\nThere has been speculation a celebratory private event is planned but it is understood that in keeping with the Queen's business-as-usual approach it will be a normal working day for the monarch with no special dinner party. \n \nAt this time of year the Queen is taking her traditional summer break at her private Scottish home of Balmoral. \n \nBut on the day she passes Victoria's milestone, the monarch, joined by the Duke of Edinburgh, will open the new Scottish Borders Railway and take a steam train ride on the new £294 million railway. \n \nMembers of the Royal Family including the Prince of Wales and Duchess of Cornwall will also be working. \n \nCharles will be filming a documentary with TV presenters Ant and Dec, believed to be about his Prince's Trust organisation which celebrates its 40th anniversary next year, while Camilla will visit the ITV studios in London to celebrate the organisation's 60th anniversary. \n \nA royal source said: \"You need to remember for the Queen this is a date whose calculation rests on the death of her father and great-great-grandmother, that naturally colours the way she sees it. \n \n\"While she acknowledges it as an historic moment, it's also for her not a moment she would personally celebrate, which is why she has been keen to convey business as usual, and no fuss.\" \n   Promoted stories   \nHistorian Dr Kate Williams described the length of the Queen's reign as a great source of strength for the monarch. \n \n\"It's a very significant milestone. The Queen will become the longest reigning British monarch in history. She came to the throne when she was older than Victoria. Victoria was only 18,\" Dr Williams said. \n \n\"It shows that our female monarchs last the longest. The Queen's longevity is a great source of her strength and popularity. She has lived through World War Two and throughout the 20th century. Many people will not have known a different monarch.\" \n \nQueen Victoria, who died in 1901, acceded to the throne on June 20 1837 and became the figurehead of a vast empire amid great industrial, cultural and scientific changes to society. \n \nBut she mourned the early death of her consort Prince Albert in 1861 for the rest of her life. \n \nPrincess Elizabeth became Queen Elizabeth II when she was 25 on the death of her father King George VI on February 6 1952. Like Victoria, she has acted as a figure of continuity as the country has modernised. \n \nShe has served, with Philip at her side, through the 20th century and into the 21st century, witnessing technological advances and a succession of British governments of different political persuasions. \n \nThe Queen has become accustomed to countless milestones during her decades on the throne. \n \nIn December 2007, she became the longest living British monarch, overtaking Victoria who died when she was 81, and in May 2011 she became the second-longest reigning monarch in British history when she overtook George III. \n \nAccording to Guinness World Records, the Queen also holds the world record for most currencies featuring the same individual. \n \nThe Queen is also the first British monarch to have sent an email, to have a message put on the moon, have conducted a royal ''walkabout'' and to have held a public concert in her back garden. \n \nShe is the second-longest serving monarch in the world after King Bhumibol Adulyadej of Thailand, who took to the throne in 1946 but who is now rarely seen in public. \n   \n Share article  \n   \nThe record of length of time on the throne can be calculated in different ways, but the Palace considers the total number of days plus hours and minutes to be the most accurate. \n \nThe Queen passes Victoria's record at around 5.30pm on Wednesday when she will have reigned for 23,226 days 16 hours and approximately 30 minutes - but the exact moment she became Queen is hard to calculate as George VI died in his sleep in the early hours of the morning, possibly at around 1am.", "source": "Northern Echo"}