{"published": "2015-09-04T18:58:52Z", "media-type": "News", "title": "Authorities: Mitchell man fatally shot with own gun by police officer", "id": "c82e56f7-0aef-42f1-8f53-947ea7f28006", "content": "Curtis James Meyer died at the scene of the incident, authorities said. \n\nThe Mitchell Police Division responded to a disturbance call at a Mitchell residence located at the 500 block of North Mentzer Street, according to a press release from the South Dakota Attorney General’s Office. \n\n“During the call to service, the officer encountered a subject with a gun,” said a statement in the release. “The incident escalated, and during an ensuing struggle Mitchell Police Officer Russ Stevenson shot the armed subject with the subject’s gun.” \n\nThe shooting, which occurred at approximately 1:52 a.m. Friday, involved one gun, said Mitchell Chief of Public Safety Lyndon Overweg. It was the subject’s gun, and the officer’s gun was not involved in the incident, he said. \n\nOverweg declined to provide additional details because the Division of Criminal Investigation, at the request of the Mitchell Police Division, is investigating the shooting. \n\nAt the completion of the investigation, the South Dakota Division of Criminal Investigation will issue a case report and shooting summation to be reviewed by the Attorney General for a final determination on the officer’s action. The release of the summary is anticipated within 30 days. \n\nNo other information about the early-morning incident was immediately available. \n\nThe last time a Mitchell Police officer fatally shot a person was Nov. 8 at the Quality Inn in Mitchell. Sgt. Dave Beintema, an officer with the Mitchell Police Division, was justified, according to a report from the South Dakota Attorney General’s Office, in his use of lethal force when he shot Joy Ann Sherman, a 52-year-old Mitchell resident, after she barricaded herself in her room at the Quality Inn, located at 1221 S. Burr St., and threatened to shoot herself and others.", "source": "Mitchell Daily Republic"}