{"published": "2015-09-15T22:00:02Z", "media-type": "News", "title": "Give pupils balanced diet - MCE", "id": "25b0d1e3-e73a-44ee-a0a6-07166f834a6f", "content": "Nkoranza, Sept. 15, GNA - Madam Stella Amoatemaa, Nkoranza Municipal Chief Executive (MCE), has advised parents and guardians to provide balanced diets to their children and wards before and during school hours.\n\nShe stressed that in schools where launch was not served, parents and guardians must take the necessary steps with the school authorities for the pupils to be fed well.\n\nThat, she said, encouraged the pupils to feel not only psychologically happy to stay in schools, but also provided them with good nutritional values for their proper physical growth and mental development, the MCE added.\n\nMadam Amoatemaa gave the advice when she addressed parents and teachers at the 'My First Day at School' programme for the 2015-2016 Academic Year at basic schools in some selected communities within the Municipality.\n\nThe visit was to welcome newly-enrolled pupils to start their formal education.\n\nThe communities included Bredi Number One, Donkro-Nkwanta, Nkwabeng, Asonkwaa and Akumsa- Domase.\n\nThe MCE emphasized the need for teachers to work with commitment, dedication and 'loving hearts' for the pupils, by handling them as their own children, because that would motivate and sustain their interests in the schools, she said.\n\nEarlier, Madam Amoatemaa commended Bayport Financial Services Limited (BFSL), a Ghanaian micro-finance company, for assisting the Assembly with a quantity of edible and non-edible items valued at GH¢ 500 towards the success of the 'My First Day at School' programme.\n\nThe items provided by the Techiman branch of the company at a short ceremony at Nkoranza included a quantity of Kalypo juice drinks, some boxes of biscuits, and packets of pencils.\n\nThey were distributed to the pupils, particularly the new entrants.\n\nMr. Ernest Asare Gyan, the Techiman branch Manager of BFSL said the donation was part of the company's corporate social responsibility to ensure quality education delivery in the Municipality.\n\nGNA\n\nMore Education » Comments:\n\nThis article has 0 comment, leave your comment.", "source": "Modern Ghana"}