{"published": "2015-09-22T17:32:12Z", "media-type": "News", "title": "Steve Clarke v Everton: How has the Reading FC boss fared against the Blues?", "id": "11ad5adf-9170-45a6-999f-447fd5facaa8", "content": "Reading take on Everton this evening (8pm kick-off) for only the 11th time in their long history. \n\nThe Merseyside club have shaded the previous meetings, winning six while Royals have emerged victorious on three occasions. \n\nThere has been one draw, a 1-1 stalemate at Goodison Park in 2007 which will always be remembered for Sylvester Stallone’s half-time appearance on the pitch. \n\nBut as well as looking at previous meetings between the sides, we thought we would take a look at how Steve Clarke has fared against the Toffees since hanging up his boots. \n\nWe’ve gone back to when he arrived at Newcastle in 1998 alongside Ruud Gullit. Then we’ve looked as the statistics from his time as assistant manager at Chelsea, West Ham and Liverpool, as well as his stint in charge at West Brom. \nRelated:  An expert view on Everton   Newcastle: Played 4 - Won 1, Lost 2, Drew 1 \nIn his first season at St James’ Park, Clarke suffered home and away defeats against Everton during the 1998/99 campaign. \n\nThings improved the following year, however, as the Magpies followed up a 1-1 stalemate with a 3-1 success in March 2000. \nChelsea: Played 12 - Won 8, Lost 0, Drew 4 \n There were plenty of reasons to smile for Steve Clarke when Chelsea met Everton. \n\nAs you would expect, Clarke’s time at Stamford Bridge saw him enjoy an excellent record against the Blues. \n\nIn fact, he never lost to the Merseysiders while he was with Jose Mourinho in west London. \n\nThey met 12 times in all competitions, with Chelsea winning eight and drawing four. \n\nIncluded in those victories was a League Cup semi-final success during the 2007/08 season. \nWest Ham: Played 4 - Won 0, Lost 3, Drew 1 \nHaving enjoyed several seasons of dominance over Everton while at Chelsea, things changed when Clarke moved to West Ham alongside Gianfranco Zola. \n\nOver two campaigns from 2008 to 2010, West Ham failed to beat the Blues home or away. \n\nThey met on four occasions, with the Toffees winning three. The only draw came in April 2010 when the sides shared a four-goal thriller. \nLiverpool: Played 4 - Won 3, Lost 0, Drew 1 \n Steve Clarke celebrates with Kenny Daglish after Liverpool beat Everton in the FA Cup semi-final. \n\nClarke moved to Liverpool in January 2010 and had a good record against the Blues while on Merseyside. \n\nThe two teams met four times, with Liverpool never losing to their neighbours. \n\nThe Reds won three, including an FA Cup semi-final, and drew the other of their meetings. \nWest Brom: Played 3 - Won 1, Lost 1, Drew 1 \nThis was Clarke’s first job as a head coach and he enjoyed mixed results against Everton during his spell in charge at the Hawthorns. \n\nHe picked up one victory, a 2-0 success in September 2012, and then had a draw and a defeat in his other two games against the Blues. \n Steve Clarke's record v Everton", "source": "Reading Post"}