{"published": "2015-09-09T00:13:46Z", "media-type": "News", "title": "OPINION: Vaccinating your kids is parenting 101, surely?", "id": "e8c09a7a-c434-4c3d-98b7-d44513c7e0e1", "content": "Opinion, - The DEX acting editor \n\nTODAY'S front page story about a Tabulam woman wanting to start up an anti-vaxers child care is absolutely ludicrous. \n\nI am all for people having their own ideologies and beliefs, but when something as serious as health is concerned - and children's health for that matter - it's not something we can afford to be all non-conformist about. \n\nIf you decide you want to eat 100% the paleo way - great, do it. If you choose to live off the grid and not use electricity - awesome. If you don't want to protect your children from harmful diseases and infections - well, that's your call. But remember, by choosing not to vaccinate your children for whatever reason, that's not just affecting you and your family, it's affecting everyone in the community. \n\nChildren are grubs. They run around the playground getting dirty, they touch yucky things, their immune systems aren't as strong as adults' and they're surrounded by other children doing the exact same thing every day. \n\nSurely it's somewhere in the Parenting 101 handbook - thou shall keep thy own children safe from harm. I imagine a group of kids with no shield against these diseases can only breed an unhealthy environment. \n\nWhat happens when these kids meet a vaccinated friend from another part of town and they play together? Has that vaccinated child now been opened up to a super-virus from the cesspit of germs that's festering at the anti-vaxxers centre? Too harsh? Perhaps. But it raises a point. \n\nIf you don't want to protect your own children from these horrible diseases and viruses, that's your decision. But before you do make that call, don't let your own ideas sacrifice the health of your precious children - and everyone else's. \n\nGot an opinion? Send us a letter to the editor to letters@dailyexaminer.com.au. \n\nGet your local news, your way.\n\nUpdate your news preferences and get the latest news delivered to your inbox.", "source": "Lismore Northern Star"}