{"published": "2015-09-26T04:06:07Z", "media-type": "News", "title": "Volleyball Mocs win SoCon opener 3-1 and other sports news", "id": "4491eb0e-0779-475e-b987-3b4db884b1ae", "content": "Lauren Greenspoon set 48 assists and Catherine Chason had 37 digs as the University of Tennessee at Chattanooga volleyball team began Southern Conference play Friday night with a 3-1 home win over UNC Greensboro. The set scores were 25-16, 25-21, 17-25, 25-22. Allie Davenport had 15 kills and Kristy Wieser and Sarah Batterton had 12 and 11 in the 12-2 Mocs' eighth win in a row. Miranda Elpers had 17 digs and Lauren Gainer was in on eight blocks in the win. Jessica Brezwyn had 18 kills and 16 digs and Katherine Santiago had 34 digs for UNCG (10-6). \n \n* Bryan College lost 3-2 to Union College in the Appalachian Athletic Conference's first-place volleyball showdown Friday night in Dayton. Union is 13-3 overall, 7-0 in the AAC after the 25-23, 14-25, 23-25, 25-19, 15-13 battle, while Bryan is 8-10, 5-1. Kara Stamper had a match-high 18 kills and Ashley Mattoch had 15 in defeat for the Lady Lions, while Shelby Grace Enochs had 48 assists and she and Kayla Rymer each contributed 17 digs. In Athens, Tennessee Wesleyan won 3-1 (25-15, 19-25, 25-23, 25-21) against visiting Bluefield and is 6-7, 4-3 in the AAC. \n \n*  Lee University lost 3-0 to nationally 20th-ranked West Florida (10-2, 3-0) in Gulf South Conference volleyball Friday in Cleveland. Silvia Sartori had 10 kills and 10 digs and Emily Bento and Blaire Beamer had seven kills apiece for Lee (5-4, 1-3) in the 25-19, 25-19, 25-18 match, while Sadie Johnson and Hillary Hoffpauir had 18 and 14 assists and Stephanie Hernandez had 12 digs. \n \n*  The Coastal Georgia volleyball team, ranked 13th in the NAIA, won 3-0 (25-18, 25-18, 25-19) in a Southern States Athletic Conference match Friday at Dalton State. Anna Metzler had 11 kills and Michala Askew had 18 assists for DSC (4-7, 0-4). Emma Anderson had nine kills and four aces for the Mariners (14-1, 5-0). \n \nSoccer \n \n*  UTC and Wofford played to a 2-2 draw in the rain at Finley Stadium in their Southern Conference women's soccer opener Friday night. Rachel Fenner gave Wofford a lead just 6:10 into the match, but UTC's McKenzie Gregg scored nine minutes later from 25 yards out, assisted by Emily Moseley, and Abby Linder netted a Skylar Brewer assist for a 2-1 Mocs lead at 62:33. Mary Beth Bleekrode equalized from an Emily Gaid assist at 83:03 for Wofford (1-3-3), which outshot the Mocs 29-14. Katie Emig made 11 saves for UTC (2-6-2) in its second consecutive tie and fourth overtime match in a row. \n \n*  Morgan Sandifer's goal with four minutes left in regulation time gave Lee University a 1-0 Gulf South women's soccer win Friday at West Georgia. That made the Lady Flames 2-3-2 overall, 1-1 in the GSC, while dropping the Wolves to 4-4, 2-2. Lee had a 14-7 edge in shots — 4-3 in on-goal attempts. \n \n*  The Dalton State men's soccer team lost 1-0 to visiting Bob Jones on Friday and now is 6-2-1. The Roadrunners outshot the Bruins (5-2) 11-4. \n \n*  The Covenant College soccer teams were rained out of their USA South Conference games Friday at Greensboro College, and today's games against Ferrum have been pushed back from afternoon to 7:15 in Martinsville, Va. The men's game Friday was suspended in the 31st minute with Greensboro leading 1-0. \n \nGolf \n \n*  Todd Burgan from Powell, Tenn., won his third Tennessee Mid-Amateur golf championship Friday with a 3-under-par 68 that gave him a 54-hole 204 at the Ridgeway Country Club in Memphis and a six-shot margin over runner-up Philip Lee of White Bluff. Ken Lee of Manchester closed with a 71 for a ninth-place 217, while Cleveland's Wes Farris tied for 17th at 223 and Signal Mountain's Tom Baird shared 23rd at 225. \n \nField Hockey \n \n*  Virginia Barry celebrated her birthday with two second-half goals as the Sewanee field hockey team beat visiting Ferrum 3-0 on Friday, giving coach Michele Dombrowski her 100th career victory. She got to 100 in lacrosse last spring. Emma Horgan scored 12:24 into the match for the Tigers (5-0), who outshot Ferrum (1-6) 23-6 and had a 21-2 advantage in penalty corners. Kat Mulligan, Devon Davis and Katie Wilson had assists. \n \nFootball \n \n*  After skunking Sewanee's archrival Rhodes last Saturday, 24-0, Berry College visits the Tigers today at 2 p.m. EDT in a Southern Athletic Association game on the South's oldest football field. The third-year Berry program lost to Sewanee the last two years, including 31-26 in 2014, but is 2-1 this season. Sewanee is 1-2 after falling 21-3 last week at Birmingham-Southern. The Tigers got an early 25-yard field goal from Ooltewah's Callum Wishart but managed only 161 yards of offense.", "source": "Chattanooga Times Free Press"}