{"published": "2015-09-01T00:47:00Z", "media-type": "News", "title": "Hayne hits the shelves after surviving first cut", "id": "c19d0d6c-5949-4275-ab2d-e01ce1529833", "content": "The Niners this morning announced they have waived 10 players and, as expected, the Australian superstar is not among them.\n\nIt means Hayne, who is firming as a starter in the punt return position, needs only to get through one more cut this Sunday (AEST).\n\nThe 49ers roster currently stands at 75 and must be trimmed to 53 by 1p.m. on Saturday here in California.\n\nHayne jersey available ‘off the rack’\n\nJarryd Hayne merchandise is being sold ‘off the rack’ in the San Francisco 49ers team store — six days before the NFL team is even announced. Source: DailyTelegraph \n\nThe Daily Telegraph this morning purchased a Hayne #38 jersey — for the bargain price of US$99.95 before tax — from the club’s main retail outlet at Levi’s Stadium.\n\nUntil now, the only way fans could buy a Hayne jersey was to go online, or into stores, and have one specifically made to order.\n\nHAYNE HUB: MORE JARRYD HAYNE NEWS \n\nIndeed, only last week it was suggested neither Nike or the 49ers would put Hayne merchandise ‘on the rack’ until the 27-year-old superstar had made the 53-man roster.\n\nYet so staggering is the desire for gear bearing the name of the Australian cult figure, the 49ers have this week taken the extraordinary step of putting a range in their stores prior to the final pre-season game against San Diego.\n\nIndeed, in the few minutes it took us to take pictures of the #38 jersey on sale, a staffer came and grabbed two off the rack to put on hold behind the counter.\n\nAsked about the demand, she said: “Oh, this guy sure is hot. Source: Supplied “Every time I pick up the phone people are saying ‘Have you got Hayne, have you got Hayne?’.\n\n“It’s crazy.”\n\nOnline, the 49ers price for a customised Hayne jersey remains US$99.95. However to have one made here at Levi’s Stadium costs US$149.95.\n\nHowever, with interest in the Aussie now teetering on chaotic, and the franchise playing San Diego at home Thursday, club officials have decided to try and help meet the demand.\n\nA store manager said he was unable to say exactly how many Hayne jerseys had been made available in-store or whether more would be produced prior to the Chargers game.\n\nHowever, The Daily Telegraph understands the current batch were only put out over the weekend, when the team was playing the Denver Broncos at Mile High Stadium.\n\nCertainly, the decision to sit Hayne’s jersey beside that of Kaepernick — in the official team store, no less — is staggering when you consider the Sydneysider is yet to be guaranteed a contract. Source: Supplied Currently, the traditional red and white home jerseys are the only ones for sale at Levi’s Stadium. However, should Hayne make the cut Nike are ready to mass produce a variety of jerseys with his name and number.\n\nThey will also consider other ‘accessories’ such as caps and T-shirts.\n\nThe find comes only a day after 49ers coach Jim Tomsula said he had already “seen what I need to see” in terms of Hayne as a punt returner.", "source": "NEWS.com.au"}