{"published": "2015-09-27T08:46:00Z", "media-type": "News", "title": "College football Week 4 winners and losers 8 hours ago", "id": "2021d66d-9a18-4660-a413-2f4d887f4572", "content": "Michigan's not jumping for joy yet, but things are looking up for the Wolverines. (Photo: Rick Osentoski, USA TODAY Sports) \n\nMichigan’s rate of growth under first-year coach Jim Harbaugh is seen most plainly in the Wolverines’ active winning streak, which reached three games with a dominating 31-0 win against Brigham Young. \n\nAfter dropping the opener at Utah, the Wolverines have also embraced Harbaugh’s vision for the program, which marries a traditional offensive approach with a physicality lacking under his predecessors, Rich Rodriguez and Brady Hoke. \n\nMichigan has averaged 244.3 rushing yards per game in its winning streak. Opponents, meanwhile, have averaged 67 rushing yards per game on just 2.2 yards per carry. The Cougars managed just 50 yards on the ground, while true freshman quarterback Tanner Mangum completed 12-of-28 attempts for 55 yards. \n\nThe Wolverines are improving with each passing week. That makes Michigan more than just trendy, courtesy of Harbaugh’s ballyhooed arrival. It might make the Wolverines a dangerous contender in a loaded Big Ten Conference East Division. \n\nOther winner and losers from this week in college football: \n\nColorado:  Colorado’s victory against Nicholls State means nothing in the Pac-12 Conference South Division, where the Buffaloes might be headed for another last-place finish. Yet the win on Saturday pushed Colorado to 3-1 for the first time since 2010 and just the third time since 2006. \nFollow the road to the 2015 College Football Playoff at The Football Four , our home to rate and debate the nation's best. \nWest Virginia:  The Mountaneers continued to state their case as a Big 12 Conference contender with a 45-6 non-conference win against Maryland. A balanced offensive attack gained 297 yards through the air and 304 on the ground, while the Mountaineers’ defense harassed Maryland quarterbacks into just 14 completions in 36 attempts with five interceptions. \n\nFlorida:  The Gators’ come-from-behind win extended their winning streak against Tennessee to 11 games. The star was Florida quarterback Will Grier, who was outplayed for much of the game by his Tennessee counterpart, Josh Dobbs, but led the Gators on back-to-back scoring drives in the fourth quarter. If Tennessee couldn’t beat Will Muschamp-coached Florida or Jim McElwain’s first team … well, the Volunteers may never win another game in this series. \n\nDuke:  The Blue Devils’ continued success should come as no surprise to anyone familiar with the work David Cutcliffe and his staff have put in building one of the nation’s weakest programs into an annual Atlantic Coast Conference contender. Saturday’s 34-20 win against No. 20 Georgia Tech is the latest reminder of how far Duke has come in the last few seasons. \n\nIndiana:  After beating Wake Forest, the long-suffering Hoosiers are 4-0 for the first time since 1990. Indiana needs only two victories in Big Ten play to reach bowl eligibility for just the second time in two decades, which would do wonders for Kevin Wilson’s job security. \n\nCentral Florida:  Two years after reaching the Fiesta Bowl and one season after sharing the American Athletic Conference championship, UCF stands as perhaps the most disappointing team in the Football Bowl Subdivision. You’d say George O’Leary’s job is in jeopardy, but he’s the school’s acting athletics director; here’s guessing he doesn’t fire himself. \n\nTexas:  Oklahoma State was able to pull out a 30-27 win thanks to another bungle by Texas’ woeful special teams. One week after missing an extra-point try that would have forced overtime against California, the Longhorns botched a snap on a punt and handed the Cowboys possession inside the red zone. Oklahoma State hit the winning field goal with seconds left to drop Texas to 1-3. \n\nMichigan State:  Michigan State’s 30-10 win against Central Michigan raised further concerns over the health of the Spartans’ pass defense and third-down defense. Meanwhile, the offense accounted for just 324 total yards for the second game in a row, and finished with fewer than 400 yards for the third game in a row. \n\nPurdue:  Bowling Green’s 35-28 victory marked the Boilermakers’ third loss against a team from the Mid-American Conference in coach Darrell Hazell’s two-plus seasons with the program. In comparison, Hazell compiled a 12-4 record in regular-season MAC play during his two seasons at Kent State. \n\nHOW THE TOP 25 FARED IN WEEK 4 \n\nAutoplay \n\nShow Thumbnails \n\nShow Captions \nLast Slide Next Slide \nRead or Share this story: http://usat.ly/1FqOm9p", "source": "News-Messenger"}