{"published": "2015-09-22T06:27:24Z", "media-type": "News", "title": "Sheriff's department says San...", "id": "b7d890c6-ac0c-4df1-80ce-f5cfd885fd71", "content": "The San Bernardino County Sheriff's Department said it was a matter of public safety when deputies opened fire from a helicopter on a wrong-way chase suspect on the 215 Freeway. \nOn Friday, a suspect led authorities on a dangerous high-speed chase through surface streets in Fontana and San Bernardino before he drove the wrong way in the northbound lanes of the freeway. He reached speeds as high as 100 mph and deputies deemed him a threat to public safety. \n\nLt. Mitch Datillo said there is a lot for deputies to take into account before firing from a helicopter. \n\n\"If you're near schools, if you're in residential areas. We have had times where we fully intended that it was getting to that level and we could not deploy, based on the backdrop and the public safety there,\" he said. \n\nBut when the suspect jumped out of his SUV after being shot, the car continued to move and slammed head-on into another SUV, injuring three people. A relative of that family told Eyewitness News that he questions the decision by deputies to open fire from the air. \n\nWhile shooting from a helicopter is rare, it does happen. In 2004, a deputy with the Orange County Sheriff's Department opened fire from their helicopter on a suspect who was firing at deputies at a recycling plant near Irvine. \n\nEyewitness News spoke with use-of-force expert and Inyo County Sheriff's Deputy Ed. Obayashi, who said he agrees with the decision to shoot, based partly on the fact of the suspect's speed while heading in the wrong direction on the freeway. \n\n\"It could have been worse,\" he said. \"That constitutes an immediate grave danger to the public and that justifies deadly force.\" \n\nThe Los Angeles County Sheriff's Special Enforcement Bureau is authorized and trains deputies to shoot from a helicopter. Ventura County sheriff's deputies are not trained, but after hearing about the deadly chase, officials said they may consider changing the policy and training deputies.", "source": "LocalNews7.com"}