{"published": "2015-09-19T19:04:08Z", "media-type": "News", "title": "What you can learn from Matt Damon about Mars", "id": "1eba3050-1cd2-4184-be76-bbe6f0b8f024", "content": "(CNN) -  \nMatt Damon plays an astronaut stranded in space in his latest movie, and NASA is capitalizing on his star power to promote its future travels to Mars. \n\n\"The Martian\" star was tapped for a NASA video about real-life efforts to explore Mars in the latest cross-promotion between the film and the space agency. \n\nNASA collaborated on the film with 20th Century Fox Entertainment, providing guidance on production design and technical consultants. For its part, NASA is making the most of its Hollywood connection to educate the public on space exploration and burnish its brand in the process. It even launched a page, \"The Real Martians,\" dedicated to the topic. \n \nThe film combines fictional and factual narratives about Mars based on work of NASA and others have done. In the film, which takes place in the 2030s, astronauts regularly travel to Mars and live on the surface to explore. \"The Martian\" is set to open October 2. \n\n\"Sending people to Mars and returning them safely is the challenge of a generation,\" Damon says in the NASA video. \"Journey to Mars will forever change our history books, rewriting what we know about the red planet and expanding the human presence deeper into the solar system.\" \n\nFor better or worse, it often takes a little Hollywood magic to capture the public's attention, especially when it comes to science. So, how does a mission to Mars play out? \n\nJourney to Mars begins on International Space Station \n\nRight now, some 250 miles above land on the International Space Station, American astronaut Scott Kelly and Russian cosmonaut Mikhail Kornienko are studying the effect of long periods without gravity on the human body. The \"One Year Mission\" on the space station will help prepare for future journeys. Kelly led a Twitter chat Saturday, six months into his mission, sharing insights into what they've learned so far. \n\nNo drop of sweat, coffee or urine goes to waste on the station thanks to the Environmental Control and Life Support System. The system recovers and recycles water from various sources so it can be reclaimed and filtered for consumption through the Water Recovery System. \n\nThe International Space Station uses a deployable fresh-food production system known as Veggie to build a continuous source of food. Using red, blue, and green lights, Veggie helps plants grow in pillows, small bags with a wicking surface containing media and fertilizer, to be harvested by astronauts. Astronauts used the system to grow red romaine lettuce in 2014 -- a huge step in space farming. \n\nGetting there \n\nFuture trips to Mars could take 500 days or longer so it better be a smooth ride. The vehicle that will bring crews to space is the Orion spacecraft, which will provide emergency abort capability, sustain the crew during the space travel and bring them back safely. Orion will launch on NASA's new heavy-left rocket, the Space Launch System \n\nStaying there \n\nAlthough \"The Martian\" takes place 20 years in the future, NASA is already working on many of the technologies that appear in the film. \n\nDamon's character, astronaut Mark Watney, spends time in the habitation module known as \"the Hab.\" Future astronauts who land on Mars will need such a home to survive. At Johnson Space Center in Houston, crews train for long-duration deep-space missions in the Human Exploration Research Analog known as HERA, a self-contained environment that simulates a deep-space habit. \n\nThe two-story habitat contains living quarters, workspaces, a hygiene module and a simulated airlock. Crews stay in the habitat for 14 days at a time conducting operational tasks, completing payload objectives and learning how to live together in an isolated environment. \n\nIn the film, Watney fends for himself with limited supplies after his crew leaves him behind, believing him dead. To pass time, he goes for a spin on his rover, which is based on NASA's Multi-Mission Space Exploration Vehicle. The vehicle has been used in NASA's analog mission projects to troubleshoot and develop capabilities to support missions to an asteroid, Mars, its moons and elsewhere. It's built to handle address issues such as range, rapid entry and exit and radiation protection. Some versions of the vehicle have six pivoting wheels for maneuverability. In the instance of a flat tire, the vehicle simply lifts up the bad wheel and keeps on rolling. \n\nWatney spends most of his sol (Martian day) in a spacesuit to protect himself from the cold atmosphere, lack of breathable air and dust. \n\nNASA is working on two new prototypes to identify technology gaps between current spacesuits and ones sufficient for setting foot on Mars. Through the Z-2 and Prototype eXploration spacesuits, spacesuit engineers are examining the tradeoff between hard composite materials and fabrics to strike a balance between durability and flexibility.", "source": "Channel4000"}