{"published": "2015-09-08T04:21:32Z", "media-type": "Blog", "title": "Deciding on Warfarin after a TIA - calculate/document a CHA2DS2-VASc and HASBLED score", "id": "38e0b9c9-54b4-479e-831c-ab996c0b9a24", "content": "NICE updated their guidelines on the management of atrial fibrillation (AF) in 2014. They suggest using the CHA2DS2-VASc score to determine the most appropriate anticoagulation strategy. This scoring system superceded the CHADS2 score.\nRisk factor Points C Congestive heart failure 1 H Hypertension (or treated hypertension) 1 A2 Age >= 75 years 2 Age 65-74 years 1 D Diabetes 1 S2 Prior Stroke or TIA 2 V Vascular disease (including ischaemic heart disease and peripheral arterial disease) 1 S Sex (female) 1 The table below shows a suggested anticoagulation strategy based on the score:\nScore Anticoagulation 0 No treatment 1 Males: Consider anticoagulation\nFemales: No treatment (this is because their score of 1 is only reached due to their gender) 2 or more Offer anticoagulation NICE recommend that we offer patients a choice of anticoagulation, including warfarin and the novel oral anticoagulants (NOACs). There are complicated rules surrounding which NOAC is licensed for which risk factor - these can be found in the NICE guidelines. Aspirin is no longer recommended for reducing stroke risk in patients with AF\nDoctors have always thought carefully about the risk/benefit profile of starting someone on warfarin. A history of falls, old age, alcohol excess and a history of previous bleeding are common things that make us consider whether warfarinisation is in the best interests of the patient. NICE now recommend we formalise this risk assessment using the HASBLED scoring system.\nRisk factor Points H Hypertension, uncontrolled, systolic BP > 160 mmHg 1 A Abnormal renal function (dialysis or creatinine > 200)\nOr\nAbnormal liver function (cirrhosis, bilirubin > 2 times normal, ALT/AST/ALP > 3 times normal 1 for any renal abnormalities\n1 for any liver abnormalities S Stroke, history of 1 B Bleeding, history of bleeding or tendency to bleed 1 L Labile INRs (unstable/high INRs, time in therapeutic range < 60%) 1 E Elderly (> 65 years) 1 D Drugs Predisposing to Bleeding (Antiplatelet agents, NSAIDs)\nOr\nAlcohol Use (>8 drinks/week) 1 for drugs\n1 for alcohol There are no formal rules on how we act on the HAS-BLED score although a score of >= 3 indicates a 'high risk' of bleeding, defined as intracranial haemorrhage, hospitalisation, haemoglobin decrease >2 g/L, and/or transfusion.", "source": "www.MedicalAtoZ.co.uk"}