{"published": "2015-09-24T14:41:18Z", "media-type": "News", "title": "With a little help, Cueto could deliver Royals first division title in 30 years", "id": "53b61f3c-3850-4ef1-90e2-489b8afe851a", "content": "A day after his team may have turned a corner, Johnny Cueto wants to keep showing that he has, too. \n \nThe right-hander hopes to build on a breakthrough effort as the Royals look to wrap up their first division title in 30 years Thursday night against the visiting Seattle Mariners. \n \nCueto's surprising struggles were one reason Kansas City starters posted a 6.00 ERA during a 5-12 stretch which had cut the club's hold on the AL's best record to 1 1/2 games. However, the Royals (88-63) could finally be headed back in the right direction following a come-from-behind, walkoff victory. \n \nJarrod Dyson hit a tying sacrifice fly in the ninth inning and Lorenzo Cain delivered an RBI single in the 10th to give Kansas City a 4-3 win Wednesday. \n \n\"Champagne tomorrow, that would be nice,\" said Cain, who had three hits after entering in a 4-for-29 slump. \n \nThe Royals could finally clinch their first division title since 1985 if they win Thursday's series finale while Minnesota loses to Cleveland. \n \n\"We definitely know,\" first baseman Eric Hosmer said of the magic number being down to two. \"This kind of victory can give us a boost.\" \n \nCueto, acquired at the trade deadline to be the ace, hadn't helped with a 9.57 ERA during a five-start skid before allowing two runs over seven innings in Friday's 5-4, 12-inning loss at Detroit. \n \nEarlier last week, the 29-year-old met with manager Ned Yost and pitching coach Dave Eiland to discuss how to fix what had been giving him trouble. What they discovered was that catcher Salvador Perez needed to make the adjustment, not Cueto (2-6, 5.12 ERA). \n \n\"He thought that with Salvy being so tall, he was setting up a high target,\" Yost told MLB's official website. \"Johnny is a guy who throws to the glove. So if the target is set up high, he's going to miss high.\" \n \nNow it could be Drew Butera setting up low after Perez left Wednesday's game with a bruised knee. \n \nCueto hasn't faced the Mariners since 2010 when he was with the Reds. Now he's taking on a Seattle team that has hit .303 and averaged 6.4 runs while going 8-2 on the road this month. \n \nKetel Marte went 3 for 5 with his third home run Wednesday. He's batting .415 over a 10-game hitting streak for the Mariners, who fell to 13-7 in September. \n \nRobinson Cano singled to become the 14th player to reach 2,000 hits in his first 11 seasons. \n \n\"I feel blessed,\" Cano said. \"Like I said, it doesn't mean too much because we were losing.\" \n \nJames Paxton (3-4, 3.70) will try to help Seattle (74-78) improve to 5-1 at Kansas City over the past two seasons. The left-hander is continuing to work through some wildness after missing more than three months due to a blister problem. \n \nAfter yielding three walks and three runs over three innings in a 3-2 loss to Colorado on Sept. 13, he overcame four free passes to give up one run over 4 1-3 in Friday's 3-1 win at Texas. \n \nIn his only career start versus Kansas City, Paxton surrendered four hits while striking out a career-high 10 in seven innings of a 4-0 win in September 2", "source": "FOXNews.com"}