{"published": "2015-09-01T11:22:54Z", "media-type": "News", "title": "Headlines: Reviewing Monday's Trade", "id": "f50e8e5e-2875-4fc8-8957-5499a9770b09", "content": "Thu., Sep. 03, 2015  7:00 PM EDT     Buccaneers @ Dolphins  Preseason Week 4 \n\nTue., Sep. 08, 2015  11:30 AM - 1:30 PM EDT     Back to Football Forum with the Buccaneers Luncheon  The Tampa Bay Buccaneers invite local business leaders and Bucs fans to enjoy lunch and a 2015 season preview with Buccaneers Co-Chairman Bryan Glazer, Head Coach Lovie Smith and General Manager Jason Licht, along with various players. \n\nWed., Sep. 09, 2015  9:00 AM EDT     Buccaneers Academy FDOT Backpack Caravan  While getting ready for their own kickoff on the football field, the Tampa Bay Buccaneers are proud to also help kick off the school year for young Bay-area Bucs fans! \n\nWed., Sep. 09, 2015  11:30 AM - 1:30 PM EDT     Downtown Tampa SIEGE Celebration  The Bucs will “SIEGE” Joe Chillura Courthouse Square Park to celebrate the upcoming Hispanic Heritage Month, the City of Tampa’s historic Hispanic roots and the beginning of our regular season! This fun, free event will feature autographs from Bucs Legends, the Buccaneers Street Team, a Buccaneers Cheerleader performance and various food truck vendors! \n\nThu., Sep. 10, 2015  6:00 PM - 9:00 PM EDT     Launch Party for RED, the Buccaneers new Women’s Movement \n\nJoin the Tampa Bay Buccaneers on September 10th from 6pm-9pm at Raymond James Stadium to be a part of the Buccaneers all-new RED, the Women’s Movement! \n\nSat., Sep. 12, 2015  12:00 PM - 4:00 PM EDT     Back to Football Celebration at Glazer Children’s Museum  Celebrate the season opener with the Tampa Bay Buccaneers by joining us at a special Back to Football event at the Glazer Children’s Museum! \n\nSun., Sep. 13, 2015  4:25 PM EDT     Buccaneers vs. Titans  Week 1 \n\nTue., Sep. 15, 2015  12:00 PM EDT     UnitedHealthcare Learning Garden Build  UnitedHealthcare volunteers, Bucs players, cheerleaders, and Captain Fear will construct Learning Garden kits at One Buccaneer Place that will teach students about growing healthy, sustainable foods. \n\nSun., Sep. 20, 2015  1:00 PM EDT     Buccaneers @ Saints  Week 2 \n\nTue., Sep. 22, 2015  12:00 PM EDT     UnitedHealthcare Learning Garden Delivery  Buccaneers staff will install Learning Gardens in seven Buccaneers Academies. \n\nSun., Sep. 27, 2015  1:00 PM EDT     Buccaneers @ Texans  Week 3 \n\nTue., Sep. 29, 2015  12:00 PM EDT     Bucs Vision Mobile powered by Glazer Family Foundation Vehicle Unveiling  The new and improved Bucs Vision Mobile powered by Glazer Family Foundation will be unveiled at Twin Lakes Elementary School! \n\nSun., Oct. 04, 2015  1:00 PM EDT     Buccaneers vs. Panthers  Week 4 \n\nTue., Oct. 06, 2015  12:00 PM EDT     Rookie Club: Metropolitan Ministries LAMPLighters Fall Festival  The Tampa Bay Buccaneers Rookie Club, Cheerleaders, and Captain Fear will interact with the children through games, dancing, arts & crafts, and more during Metropolitan Ministries' Fall Festival.", "source": "Buccaneers.com"}