{"published": "2015-09-20T13:24:16Z", "media-type": "Blog", "title": "A Review Of The DFW Yoga Studio & Other Airports Where You’ll Find Yoga", "id": "d73ea7e0-ee60-4fe7-b9b2-fd706d3862e9", "content": "Is that a mirage or really a yoga studio at Dallas Fort Worth Airport Terminal?! Call me crazy, my husband already thinks so, how giddy with joy I was when I saw the yoga area at DFW (airport code listed to impress you, dear husband ). After a sitting on a plane and emerging with stiffness and aches of pains this is a place where I can decompress and take care of “ME” in between flights. You guys can take the fancy lounges, this is my happy place. The studio is located between the B and D terminals, in a walkway near gate D40.  DFW is a really big airport, so you may need to take the train or ask one of the info volunteers for directions on how to find your way there. Once there, only a partition separates you from the stressful hustle and bustle of air travel and enjoying a moment enjoying a peaceful Savasana. It’s not the most private relaxation area I’ve ever done yoga in, but the hallway was pretty empty.  This fully equipped studio (not that you need much for yoga) includes mats and hand sanitizer. You do need to bring your you own yoga pants.  Better yet, just wear them on the plane so your comfortable.  There was nobody in the studio when I showed up, so I had it all to myself. There was a television that seemed to play videos on a continuous loop.  The picture quality was pretty bad and the video was definitely a bit, well, dated.  A better choice here is to bring your own app. Sworkit, which I reviewed last week, includes a yoga option of sun salutations, basic stretches or you can create your own on your flight so it’s ready when you land.  I’ll also be reviewing another app focused solely on Yoga shortly. DFW isn’t the only airport with yoga.  You can see pictures and descriptions of yoga areas in Chicago O’Hare, Burlington VT, San Francisco and Helsinki in this article. I also found yoga areas at Albuquerque International Sunport and Raleigh-Durham International Airport. I’ll keep searching to find more and update my list for the future!", "source": "BoardingArea"}