{"published": "2015-09-26T11:00:03Z", "media-type": "News", "title": "Pakistan to hang man who claims he was 15 at time of crime", "id": "735186cf-f804-4bb9-94f8-9e66f865dd8a", "content": "ISLAMABAD (Reuters) - Pakistani authorities are set to hang a man who says he was 15 when he was arrested for a murder he claims he did not commit, lawyers said on Saturday, in the latest case to shine a spotlight on Pakistan's crumbling criminal justice system. \n\nAnsar Iqbal says he was 15 when he and a friend were arrested 16 years ago for the murder of neighbour, which the victim's family said was over an argument at a cricket match. Iqbal says police framed him because he was poor by planting two guns at his house. \n\nPakistani law forbids the execution of juveniles, but the country's courts have refused to examine Iqbal's school records and birth certificate because they say they were submitted too  late, said Maya Foa of British legal aid group Reprieve. \n\nHis old school record and a new birth certificate issued this year give his age as 14 and 15 respectively. Record keeping in Pakistan is poor and records are easily forged. \n\nInstead, the court concluded he was in his early 20s based on a policeman's estimate at the time of his arrest, Foa said. Iqbal's friend was tried as a juvenile. \n\n\"The onus has to be on the government and prosecution to prove that the individual facing the gallows is not a juvenile if all the available evidence points otherwise,\" she said. \n\n\"Otherwise it puts the defendant in an impossible position.\" \n\nIqbal's lawyer, Munir Basit, confirmed his client had been tried as an adult and had been notified he was to hang at Sargodha jail next week. \n\n\"He has received his black warrant in the concerned jail,\" Basit said. \n\nCourt and prosecution officials were not available for comment. \n\nPakistan brought back hanging in December as a way to crack down on militancy after Taliban gunmen massacred more than 130 pupils at an army-run school. \n\nBut very few of the 240 people hanged have any links to militancy. Most, like Iqbal, were convicted of murder. Many of their families say they were falsely accused and too poor to get good lawyers. Few, if any, wealthy convicts have been hanged. \n\nPakistan's criminal justice system is widely considered corrupt. Police frequently ask for bribes and few are trained in preserving a crime scene or collecting evidence. Instead, they rely on easily manipulated oral statements. Accusations of torture are common. \n\nUnskilled, poorly paid court-appointed lawyers often fail to examine witnesses or do not turn up for hearings, and tales of judges who ask for bribes are common. \n\n(Editing by Edmund Klamann)", "source": "TheStar.com.my"}