{"published": "2015-09-22T11:56:17Z", "media-type": "News", "title": "Prankster puts some fun into his local Sainsbury's with hilarious alternative product labels ", "id": "e09f3ab2-9b54-4cea-870d-1481c302e172", "content": "John Strick replaced labels in the Sainsbury's supermarket in West Ruislip Replaced store's usual descriptions with his own versions two weeks ago 41-year-old said he wanted to 'put a smile on the face of other shoppers' One tells shoppers to try something new and 'throw broccoli at racists'   \nA supermarket prankster has put some fun into the weekly shop with his own hilarious alternative product labels.  \n\nJohn Strick secretly replaced the description labels on 15 items at the Sainsbury's store in West Ruislip during a visit two weeks ago.  \n\nThe civil servant said when he and partner in crime Lesley Atkins returned to the store several days later four of the labels were still hiding in plain sight. \n \nGag: Supermarket prankster John Strick has written some alternative product labels. This one reads: 'Nut allergy advice: Due to our nuts being package in a nut factory environment that specialises in the packing of nuts, these packets are very likely to contain nuts.'  \n   \nHilarious: According to Mr Strick's labels vodka 'removes fears, inhibitions and nail polish' \n   \nPrankster: John Strick, pictured with partner Lesley Atkins, changed the labels to put a smile on the faces of fellow shoppers \n  \nJoke: The Lynx label, left,  reads: 'Ah, the old standby of every 15-year-old and minicab driver who can't be bothered to have a shower for three days.' The mushroom description, right, states: ''These mushrooms contain absolutely no hallucinogenic properties whatsoever. We do, however, sell absinthe, which will mess you up BAAAAAAD' \n\nThe father-of-two said: 'I made the labels for a laugh and went and placed them in the supermarket a couple of weeks ago with Lesley, my partner, providing stealth-like cover. \n\n'I wanted to put a smile on the faces of other shoppers and liven it up for people, because the shopping experience is a bit dull. \n\n'I wanted to make the labels funny but not necessarily obviously not real and I did them quite well with the logos and everything. There is nothing offensive, just things to make people laugh.' \n \nOne of Mr Stricks labels, spotted at the Sainsbury's supermarket in West Ruislip, encourages shoppers to buy jars of 'magic' honey. \n\nIt states: 'We keep this honey locked up so as not to unleash its incredible magical powers. To purchase this honey, take it to the till, hand it to a member of staff and say the words; 'oh mystic keeper of the keys, unleash the amber goodness'. You will then enter the fourth dimension of honeytopia'. \n\nAnother reads: 'Try something new today: throw broccoli at racists'. \n\nHe said it is not the first time he has made 45-year-old Lesley, a teacher, laugh with his silly pranks - many of which he could not reveal. \n   \nMr Strick's labels also offered shoppers handy hints. In the frozen vegetables section he wrote: #Cold here isn't it? Go and buy some gloves' \n   \nTrick: Mr Strick branded the Sainsbury's honey 'magic.' He wrote: 'We keep this honey locked up so as not to unleash its incredible magic powers.'  \n   \nFun:  This description by Mr Strick suggested throwing 'broccoli at racists' \n   \nLark: Another of his amusing posts told customers to 'take off your clothes and run down Aisle 19 yelling 'i'm today's special' \n\nThe 41-year-old clearly has a soft spot for supermarket joking though - and admits to putting chocolates in the diet drinks section and on another occasion moving tissues and bottles of wine next to chocolates for women going through a break up. \n\n'I am a bit of a big kid,' Mr Strick added. \n\n'I have done similar stuff in the past which I can't divulge. I definitely like to be a prankster and have a bit of a wacky sense of humour.'  \n   \nCaper: This label tells shoppers they have found 'the Golden Ticket' and won a free trip to Willy Wonka's factory \n   \nJape: Mr Strick suggested Sainsbury's customers try something new today 'like Sintoism,' which is an ancient religion in Japan \n\n ", "source": "Mail Online UK"}