{"published": "2015-09-01T14:49:32Z", "media-type": "News", "title": "Altair Semiconductor Adopts Cadence Palladium XP Platform for Advanced IoT SoC Development", "id": "ef2beb3e-d888-45f6-b33c-b41d5ace7019", "content": "Altair reduces the development-cycle turnaround time by 20 percent \n\nSAN JOSE, Calif., Sept. 1, 2015 /PRNewswire/ -- Cadence Design Systems, Inc. (NASDAQ: CDNS) today announced that Altair Semiconductor adopted the Cadence® Palladium® XP platform for the verification and validation of its Internet of Things (IoT) system-on-chip (SoC) designs. Using the Palladium XP platform, Altair is able to conduct SoC hardware and software integration and validation three to four months ahead of silicon availability. \n\nAltair utilized the Palladium XP platform to accurately model the register-transfer level (RTL) design running with software and flash memory, enabling them to capture half of all hardware and software bugs in a pre-silicon environment. This reduces the development-cycle turnaround time by 20 percent compared to their previous process. LTE software development for L1, L2 and L3 protocols was completed and verified in the hardware context three to four months before silicon availability. \n\n\"As the Internet of Things expands beyond consumer devices to include all types of connected 'things,' high-performance, ultra-low-power silicon solutions enabling these connections become key,\" said Eli Zyss, vice president of Silicon Design, Altair Semiconductor. \"Recently we deployed the Palladium XP platform to address the design and verification challenges of our next-generation IoT and broadband LTE silicon development. This allowed us to shorten the development cycle, improve turnaround-time, and address hardware and software issues pre-silicon.\" \n\nThe Palladium XP platform, which is part of the Cadence System Development Suite, is a high-performance, special-purpose verification computing platform that unifies best-in-class simulation acceleration and emulation capabilities in a single environment. For more information on the Palladium XP platform, visit http://www.cadence.com/news/pxp. \n\nAbout Cadence \n\nCadence enables global electronic design innovation and plays an essential role in the creation of today's integrated circuits and electronics. Customers use Cadence software, hardware, IP and services to design and verify advanced semiconductors, consumer electronics, networking and telecommunications equipment, and computer systems. The company is headquartered in San Jose, Calif., with sales offices, design centers and research facilities around the world to serve the global electronics industry. More information about the company, its products and its services is available at http://www.cadence.com. \n\n© 2015 Cadence Design Systems, Inc. All rights reserved worldwide. Cadence, the Cadence logo, and Palladium are registered trademarks of Cadence Design Systems, Inc. in the United States and other countries. All other trademarks are the property of their respective owners. \n\nFor more information, please contact: \n\nCadence Newsroom \n\nCadence Design Systems, Inc. \n\n408-944-7039 \n\nLogo - http://photos.prnewswire.com/prnh/20140102/SF39436LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/altair-semiconductor-adopts-cadence-palladium-xp-platform-for-advanced-iot-soc-development-300131861.html \n\nSOURCE Cadence Design Systems, Inc.", "source": "InvestorPoint.com"}