{"published": "2015-09-25T10:16:06Z", "media-type": "News", "title": "Christian right summit speakers list: Trump yes, Jeb no", "id": "bf3546a4-7713-4c0c-b7dc-2e867dd2c685", "content": "Donald Trump (L) talks with fellow candidate and former Jeb Bush during a commercial break at the first official Republican presidential candidates debate of the 2016 U.S. presidential campaign in Cleveland, Ohio, August 6, 2015.  Reuters/Brian Snyder    \nWhen several thousand Christian conservative activists gather in Washington on Friday, they will hear from Donald Trump and seven other Republican presidential candidates. But one big name with religious bona fides will be absent: Jeb Bush. \n\nBush, who was not invited to the Values Voter Summit last year, was not able to attend this year, his campaign said. A Bush spokeswoman said he had offered to send a video message to the event, but a summit spokesman said the offer was declined. \n\nBush is not the only notable Republican candidate seeking to represent the party in the November 2016 presidential election to skip the event. \n\nFormer Hewlett-Packard chief Carly Fiorina, who at last week's Republican debate gave the type of strong anti-abortion message that social conservatives want to hear, will be in the early voting state of Iowa instead. \n\nOhio Governor John Kasich, who frequently mentions his faith on the campaign trail, will not attend either. Nor will New Jersey Governor Chris Christie. \n \nBut religious conservatives said ahead of the event that Bush - a convert to Roman Catholicism who was just in Washington to see Pope Francis - could be missing a valuable opportunity to connect with an influential part of the Republican voting base as he tries to recover from the summer surge of Trump and expand his appeal. \n\n\"For the life of me I can't figure out Governor Bush's strategy for the nomination,\" said Gary Bauer, former president of the Family Research Council, which is staging the summit. \"He's pro-life. He's got plenty to talk about to this group.\" \n\nTimothy Head, executive director of the Faith and Freedom Coalition, another Christian conservative group, said evangelicals are responding more enthusiastically right now to retired neurosurgeon Ben Carson, Senator Ted Cruz of Texas,  former Senator Rick Santorum of Pennsylvania and Senator Marco Rubio of Florida. All four will appear at the event. \n \n\"They speak with a tremendous amount of conviction and resolve, and I think that Jeb's style, his personality and personal countenance is more contemplative and analytic,\" Head said. \n\nBush has not shied away from the conservatives' \"cattle calls\" of presidential candidates that populate campaign calendars. But Bush, who has spoken at length of the role of religion in shaping his political views, has not seen a need to attend them all. \n \nFor Trump, however, there is a clear need to convince evangelicals that he is not dismissive of religion after he said in Iowa in July that he had not asked God for forgiveness and referred to the Communion wafer as a \"little cracker.\" \n\nIn advance of the event, Trump gave an interview with political journalist David Brody of the Christian Broadcast Network in which he extolled the benefits of the Bible and said he had in fact asked for forgiveness from God by way of taking Communion. \n\n\"I consider Communion to be a very important thing. When I go to church and take Communion, I think that's asking for forgiveness in my own way,\" Trump said. \n\n\n(Editing by Jonathan Oatis )", "source": "Reuters"}