{"published": "2015-09-28T20:41:00Z", "media-type": "News", "title": "Kelly: Getting our stories straight on Washington’s Newspaper Row", "id": "327f60c2-7418-4802-a97c-81a7e354d4d6", "content": "By , \r  \nThere was a reason Washington’s old Newspaper Row grew up near the corner of 14th Street and Pennsylvania Avenue NW: That’s where the Western Union telegraph office was. \n \nMake that two reasons: Next to Newspaper Row was a stretch of E Street called Rum Row. It was full of saloons. \n\nAnd thus Washington’s 19th-century scribes had easy access to two vital forms of journalistic technology: the telegraph and the inebriating beverage. \n\nThat was just one bit of D.C. media history I learned as I prepared to speak with a BBC camera crew recently. The BBC was in town to film material for “Great Railway Journeys,” a show that will probably air sometime next year in the States. \n\nThe Washington Post was founded in 1877 by Stilson Hutchins . A Democrat, Hutchins was so irritated that the disputed election of 1876 gave the White House to Republican Rutherford B. Hayes and not Democrat Samuel J. Tilden that The Post seldom referred to Hayes as “President,” preferring “His Fraudulency.” \n\nNewspapers rose and fell like mushrooms after a rain back then, but from the start, The Post seemed to punch above its weight. It was lucky when it came to publicity. When new owners Frank Hatton and Beriah Wilkins approached John Philip Sousa in 1889 to write a march celebrating the newspaper’s young authors competition , they couldn’t have known that it would spread The Washington Post’s name around the globe. \n\nThe teddy bear also owes its existence to The Post. I knew that, but after doing my research, I had to recalibrate my understanding of the events. I always thought Theodore Roosevelt had refused to shoot a poor, orphaned bear cub. Not exactly. \n\nIn November 1902, Roosevelt escaped a typically fractious Washington to blow off steam on a much-publicized bear hunt in Mississippi. His host was that state’s governor, and the guide on the trip was a former slave named Holt Collier . \n\nRoosevelt had been guaranteed he would see a bear, but he went bearless on the first day of the hunt. The next day, Collier was able to corner a large black bear. He stunned it with his rifle butt and tied it to a tree. The president thought it unsporting to shoot a bear in such circumstances. \n\n Clifford Berryman’s cartoon of the scene ran on the front page of The Post on Nov. 16, 1902. As a man holds a tethered bear, Roosevelt raises his hand in refusal. “Drawing the line in Mississippi” is the caption. \n\nIt was just one of five Berryman front-page illustrations that recounted recent political events. But it was the one that resonated. The story and drawing inspired the husband-and-wife owners of a New York candy store to make a plush bear and put it in their window. They wrote Roosevelt asking permission to sell the toys, and the teddy bear was born. \n\nRoosevelt’s act of mercy was probably lost on the bear. It was killed anyway, ushered out of its misery by the knife of Holt Collier. \n\nIn 1905, The Post was sold to John McLean , a Cincinnati newspaperman. McLean didn’t run the paper very well, and in 1907, Berryman fled to the Evening Star, where he stayed for 42 years and earned a Pulitzer Prize. \n\nIt was McLean’s playboy son, Ned McLean , who was the real horror show. A drunk, he ran The Post into the ground. His wife, Evalyn Walsh McLean — owner of the Hope Diamond — hoped to save the paper for their sons, but it had to be sold at a bankruptcy auction. \n\nThat’s how it ended up in the hands of Eugene Meyer , the financier who plowed his money into The Post for years, setting it on the path to become the newspaper (and, eventually, Web site) it is today. \n\nI’m always impressed by people who have a plan for their lives, rather than live them the way I’ve lived mine: making it up as I go along. In his history of The Post, Chalmers Roberts writes that as a young man, Meyer divided his life into 20-year increments. The first 20 he would spend learning, the next 20 earning a “competency” and starting a family. Meyer would spend his 40s and 50s engaged in public service and his 60s and 70s growing old gracefully. \n\nDamn if Meyer didn’t actually do that, getting rich on Wall Street, then heading the Federal Reserve, then buying The Post. \n\nThis Post history has been on my mind lately, not just because of the BBC travel show, but because we’ll be moving to a new building in December. I’m sure we’ll make history there, too. \n\n Twitter: @johnkelly  \n\n  For previous columns, visit washingtonpost.com/johnkelly.", "source": "Washington Post"}