{"published": "2015-09-05T22:46:31Z", "media-type": "News", "title": "WEISSMANN | Poetic Justice", "id": "e79be2a8-ec13-4df0-97c9-c8e6f8e5982d", "content": "By RUTH WEISSMANN \n \nA week ago, the nice people at Goodyear Auto Service left me stranded in downtown Ithaca for nine hours. My “check engine” light had come on, a persistent yellow glow on my dashboard that demanded attention before I could continue my biweekly Wegmans runs. I dropped the car off (hold on, let me get the sweaty socks and granola bar wrappers out) and left on my bike, figuring — incorrectly — that it’d be an hour or so before they called me back in. \n \nAfter coming to terms with to the fact that I would spend my day biking around town searching for a stronger Wi-fi signal, I wound up at Barnes & Noble, my childhood mecca for all things fact and fiction. I wandered the aisles with no agenda, delighting in the idea that the employees would shelve the Kama Sutra in the “Living Your Best Life” section and stopping to flip through the cookbooks. I like to circle the store, nabbing titles that pique my interest, and I ended up by the daily planners, where it is quiet and I am left virtually alone to peruse my selections. \n \nI had picked up a book called “Good Poems,” a massive collection of the poetry read by Garrison Keillor on the radio every morning. My experience with poetry stops with the third grade state test — I don’t read too much of it, and I get upset when it doesn’t rhyme. As I skimmed through a couple of the poems, names like Thoreau and Dickinson jumped off the page. Holding the book felt so adult, so scholarly — and because ‘Scholarly Ivy Leaguer’ is my day job, I bought it. To date, I’ve read about eight of the poems. The book sits on my nightstand, glaring at me; It wants me to further my poetic education instead of rewatching Parks and Recreation for the umpteenth time. I started to wonder: Did I buy the book because I had the sudden urge to read poems, or because I wanted to be somebody that reads poetry? \n \nSpoiler: It’s the latter. I wanted to be caught examining those lengthy stanzas; to appear brainy, like someone who spends her free time turning the cogs of her brain rather than turning the radio up on her way to get Thai food. To some extent, I did enjoy the poetry. But its purchase was a thinly veiled attempt to brand myself as an intellectual. Exactly how much of what we do is an effort to become something we believe we should be? How much of our lives do we spend biting our bottom lips through things we don’t find fun in an effort to maintain an image in our own minds? I think we all strive to keep up certain appearances in the name of viewing ourselves as athletic or effortlessly popular or tolerant of a level of alcohol that in truth makes us cringe. It’s that old American ideal — fake it ’til you make it. \n \nOf course, far be it from me to decry those who own yoga pants without actually practicing yoga — it’s like wearing a cloud. But ever since that poetry book, there’s been an annoying voice in the back of my head (one that sounds eerily akin to the genie in Aladdin). Am I only part of a pre-law frat because I want to say I’m taking the bar? Do I do keep a shelf of classic novels because I want to slyly reference Hemingway in conversation? Am I nodding at cultural references I don’t understand to avoid people discovering that I grew up without cable television? \n \nI don’t mean to suggest that everything we do has an ulterior motive — quite the opposite. But I think there are small things hidden in the corners of our lives that we always wanted to be, and aren’t yet. That poetry tome, for all its quiet mocking, informed an excellent point — instead of choosing the qualities you want like candy out of a vending machine, you ought to be focusing on what you do for yourself and nobody else. In my mind, there lies happiness. \n \nPeople who live authentically are rare, and you can spot them a mile away. They don’t profess who they are — they don’t have to. These people are content with simple internal validation. Often they aren’t dressed the part; They do yoga without the tell-tale yoga pants. Maybe someday I will stop buying books to appear more bookish, but for now, I’m going to set a reminder every night before bed. Because I’m finishing that poetry book, one verse at a time. \n \nRuth Weissmann is a junior in the College of Agriculture and Life Sciences. He can be reached at raw287@cornell.edu. A Word to the Weiss appears alternate Thursdays this semester.", "source": "Cornell Daily Sun"}