{"published": "2015-09-15T11:30:03Z", "media-type": "News", "title": "Dempsey: 'Terrible Human Suffering' in Syrian Conflict", "id": "aaae2215-0041-46bc-bdda-3863d8df330f", "content": "(This article originally appeared on the Department of Defense website ) \n \nBy  Lisa Ferdinando DoD News, \nDefense Media Activity \n\nTALLINN, Estonia, September 14, 2015 — The Syrian refugee crisis and the \"terrible human suffering\" could cause Europe to become \"more involved in the Syrian conflict,\" according to the top U.S. military officer. \n\nArmy Gen. Martin E. Dempsey, the chairman of the Joint Chiefs of Staff, did not predict what sort of additional actions Europe could take, but he did note the refugee crisis in the Balkans in the 1990s \"galvanized\" European political leaders and eventually led to NATO intervention in the Balkans. \n\nDempsey spoke to reporters aboard his plane Sunday as he traveled from a NATO Military Committee Conference meeting in Istanbul, on to Estonia for meetings with military and government leaders. \n\nRefugee Crisis Impacts Strategy \n\n\"One of the things we are going to carry back home and recommend to elected officials, in Europe in particular, is greater collaboration with the European Union on this crisis,\" he said. \"There's already collaboration.\" \n\nDempsey, who retires at the end of this month, said he could not predict if the current U.S. strategy for Syria would change. \"The reason I don't know is literally the refugee crisis,\" he said. \n\nThe U.S. strategy, the chairman said, focuses on efforts against the Islamic State of Iraq and the Levant. The efforts include a partnership with the Iraqi government, trying to create a diplomatic path to Syria, and conducting air strikes in Iraq and Syria against ISIL. \n\nHe said he was satisfied with the actions of the United States in carrying out the mission it planned. But he said, speaking as \"General Dempsey\" and \"citizen Dempsey,\" there is no way anyone could be satisfied with the outcome. \n\nSpillover Effects \n\n\"It would be inconceivable for me to say I'm satisfied with the way things have evolved given the terrible human tragedy,\" Dempsey said. \n\nThe chairman added, \"I ask myself, is this one of those moments where we will see kind of a convergence of this terrible human suffering in the form of refugees … and will at some point, Europe have to become more involved in the Syrian conflict, because of the spillover effects? \n\n\"I think the answer is probably yes,\" he said. \n\nThe Office of the United Nations High Commissioner for Refugees says there are more than four million registered Syrian refugees in countries neighboring Syria. \n\nThe UNHCR says thousands of Syrians are fleeing deteriorating conditions inside Syria and neighboring countries, and risking \"everything on perilous journeys to Europe.\" \n \nRelated \n \n U.S. to welcome additional Syrian refugees\nBackground \n \nBriefing On the Mechanics of the United States Refugee Admissions Program \n \nDoD's Dempsey: Future of ISIL Increasingly Dim", "source": "US Embassy United Kingdom: London"}