{"published": "2015-09-15T13:09:56Z", "media-type": "News", "title": "Lord Falconer as shadow Lord Chancellor", "id": "0530987f-9e67-434e-8856-a4e43fdc7620", "content": "David Allen Green asks what lawyers should make of the appointment of On the face of it, this is one of the better choices for the shadow cabinet by new Labour leader Jeremy Corbyn. \n \nFalconer certainly has the political and professional experience required, and held the very job he is shadowing a decade ago (2003-2007), when the department - the old Lord Chancellor's Department (LCD) - was temporarily called something about 'constitutional affairs', before becoming the Ministry of Justice (MoJ). He is also a senior and successful lawyer in his own right - a genuine QC in front-line politics, as opposed to the politicians who hold 'honorary' and 'parliamentary' silk statuses. \n \nBut there is ground for concern. As Lord Chancellor, Falconer promoted and toyed with compulsory competitive tendering for legal aid, and played about with restricting rights in freedom of information. He was, in those days, a 'government' politician, going native in his department, as most politicians do when they get into their agreeable ministerial offices. \n \nHeath-Robinson MoJ \n \nFurthermore, Falconer was responsible for the creation of the now expanded 'super-department' MoJ, formed by bolting on the Home Office's prisons and probation services to the old LCD. At a stroke, it went from being the guardian of the rule of law, led by a senior lawyer-politician, to a clumsy, major spending department, which would be headed up by ambitious career (non-lawyer) politicians, clambering and spinning their way up. Many of the problems which currently bedevil the unwieldy MoJ come from this misconceived structural reform, although Falconer appears to be proud of his creation. \n \nOn Falconer's firm's website it states: \n \n'In 2007 he became the first secretary of state for justice, bringing together courts, prisons, and justice policy for the first time. He was responsible for leading a department with a budget over £10 billion and over 80,000 employees.' \n \nPerhaps it is appropriate that the politician most responsible for the creation of the dysfunctional Heath-Robinson MoJ should now be required to shadow it. \n \nAfter 2007, Falconer went back to private practice, and joined the US-based international law firm Gibson Dunn, which is about as far removed from a high street legal aid practice as one can imagine. Significantly, he broke with convention and returned to advocacy - being perhaps the first former Lord Chancellor to stand on his feet before a judge. A close reading of the Borah case , where the judge held that a Gibson Dunn lawyer had gone off on a frolic of his own and misled the court over a freezing injunction, shows Falconer's impressive prowess as a barrister. \n \nReturn to legal aid \n \nFalconer could have left politics behind (he would not be the first former minister to leave for more lucrative activities), but he has returned, it seems, to concentrate on legal aid. \n \nIn a highly impressive recent piece in the New Statesman , Falconer provides an outstanding analysis of the impact of legal aid policy over the last five years. One can, perhaps, easily sneer and say that he was not much better when it came to legal aid when responsible for it, but the fact that he makes these points at all is welcome, and he deserves to be listened to. \n \nFalconer has, in fact, nominally held this shadow role since May, when Sadiq Khan resigned to launch what became a successful campaign for the nomination as Labour candidate for Mayor of London. But, during this period, the opposition was preoccupied with the leadership issue. By appointing (or re-appointing) Falconer as shadow Lord Chancellor, Corbyn has, in my view, made the best possible choice; the only pity is that Falconer cannot face Michael Gove directly over the despatch box. \n \nI asked Falconer's office yesterday for a statement on the appointment. With commendable promptness, I received the following: \n \n'I'm delighted to stay on in my role as shadow Lord Chancellor and shadow secretary of state for justice. \n \n'The Lord Chancellor has a constitutional duty to uphold and protect the rule of law and, as such, a unique role around the cabinet table. \n \n'There is much we need to focus on in the months ahead: \n \n• Reforms to legal aid are restricting access to justice to the very few; \n \n• Too many of our prisons are unsafe, overcrowded, and understaffed, with prisoners not being rehabilitated as a result; and \n \n• This government is gradually eroding people's rights and freedoms, with the promised repeal of the Human Rights Act a worrying example. \n \n'I look forward to continuing to hold the government to account on these, and many more, issues.' \n \nBoth Gove and Falconer have recently emphasised the distinctive role of the Lord Chancellor in upholding the rule of law; both have the measure of the MoJ - one created it, and the other is sorting out the mess left by Christopher Grayling - and both are political heavyweights. \n \nGove versus Falconer is going to be fascinating. \n \nDavid Allen Green is a solicitor at Preiskel & Co and writes the Jack of Kent legal blog \n  \nIssue:  \n  \nVol 159 no 35 22-", "source": "Solicitors Journal"}