{"published": "2015-09-18T07:46:03Z", "media-type": "News", "title": "Wenger will continue risky Arsenal policy that will impact Tottenham showdown", "id": "a5f987b4-94e3-4db0-9e72-f95b5783e7f9", "content": "Arsenal boss Arsene Wenger will continue to rotate his goalkeepers despite Wednesday's Champions League defeat against Dynamo Zagreb. \n \nThe Gunners slipped to the shock defeat at the Stadion Maksimir after Wenger made a raft of changes following the 2-0 win against Stoke on Saturday. \n \nDavid Ospina stepped in for Petr Cech in goal while Olivier Giroud started up front - however the French international was sent off for two yellow cards after just 40 minutes. \n SUBMIT AN ARTICLE  \nApply to become a GMS writer by signing up and submitting a  250-word test article: http://gms.to/haveyoursay5 \n \nDespite the loss, the Daily Mail reports that Wenger has no intention of stopping his rotation experiment with a deluge of games to come. \n \nCech will step into goal for the showdown against Chelsea this weekend, however, Ospina is likely to get the nod for the Capital One Cup showdown against north London rivals Tottenham. \n \nThe Mail claim that's because Wenger has promised Ospina more playing time following the arrival of Cech from Chelsea. The Colombian had the chance to leave and join Galatasaray in the summer but opted to stay put after receiving assurances from Wenger that he would have a chance to show what he can do. \n Selection  \n\n \nAlthough Ospina will likely play against Spurs, the Mail report that Wenger will name a stronger-than-normal side for the game. The French boss has a history of naming young starting XIs in the competition, but will respond to fan expectations by selecting some senior players in order to get a result. \n \nDespite that, the Mail add that 17-year-old  Jeff Reine-Adelaide could feature at White Hart Lane on Wednesday. \n Should Petr Cech start in goal for every Arsenal game?  \nDo YOU want to write for GiveMeSport? Get started today by signing-up and submitting an article HERE: http://gms.to/writeforgms", "source": "GiveMeSport.com"}