{"published": "2015-09-29T14:53:03Z", "media-type": "News", "title": "Heidi Flick: Eggplant shines in caponata", "id": "ad2fda91-acb4-4777-b828-a54e7eb1cce8", "content": "Well, the calendar, and the trees, say fall, but where I live, the heat lingers and lingers. Our taste buds have grown weary of salads, but no one is ready for hearty fall casseroles and soups. Caponata, a side dish of Sicilian origin, fills the gap between fall and Indian summer. It’s hearty but light, and while it can be served hot, it is much better at room temperature or with a little chill factor. Technically a relish, caponata serves as main dish around here. Scoop it up into warm pieces of pita and let the Mediterranean flavors take you away to sunlit shores. Actually, the other day, I made some for lunch with a friend, and we scooped it up with warm pieces of Indian naan bread. I love it when a hands-across-the-water dish comes together. Traditionally, caponata contains anchovies, capers and olives to give it that taste of the sea. Even this salt lover thinks that’s a tad too much. So I ditch the anchovies and olives and add golden raisins. Or, confession, regular raisins, because I rarely keep the golden kind in my pantry. The trick to caponata is low heat and plenty of olive oil when you sauté the eggplant because it sucks the oil up like a sponge. In fact, tests have shown that eggplant fried in oil absorbs four times more of the liquid than potatoes. If you want less oil in your dish, use a pot with a nonstick surface. As fruits go, (a member of the nightshade family, eggplant, like the tomato is the fruit of the plant), eggplant is low in nutrients and offers an average amount of fiber. But its rich texture and ability to play well with others make it a frequent guest at dinners. Use small eggplants for caponata, because the larger ones are often bitter on the outside and pulpy on the inside, and no one wants to deal with that. Caponata ¼ cup olive oil 3 small eggplants, diced 2 tomatoes, diced 1 onion, diced 2 cloves garlic, minced 3 Tbsp. capers, drained ¼ cup red wine vinegar ¼ cup golden raisins ¼ cup pine nuts ¼ cup fresh basil leaves, torn In a large pot, heat the olive oil over medium-low heat until the oil shimmers. Add the eggplant and cook, stirring occasionally for 10 minutes, until eggplant has softened and started to turn golden brown. Add tomatoes and juices, onion and garlic. Cook and stir another 10 minutes. Add capers, vinegar and raisins. Cook, stirring occasionally, another 10 minutes. Meanwhile, heat a small pan over medium-low heat, add the pine nuts and toast until golden brown. Remove from the pan and set aside to cool. Page 2 of 2 - Taste the caponata and add salt, if necessary. Pour the caponata into a serving bowl and allow it to cool to room temperature. You can serve it then, or refrigerate it. Stir in the toasted pine nuts and basil just before serving. Columnist Heidi Flick writes about cooking for The Gaston Gazette and The Shelby Star in North Carolina. Read more from her at heidislivingtoeat.wordpress.com .", "source": "The Randolph County Herald Tribune"}