{"published": "2015-09-30T18:41:19Z", "media-type": "News", "title": "Wolf Popper LLP Investigates Claims That the Proposed Acquisition of Rentrak Corp. May Not Be In the Best Interests of Its Investors", "id": "f0698be4-1c33-4d6e-839d-41eac42d043e", "content": "NEW YORK, Sept. 30, 2015 /PRNewswire/ -- Wolf Popper LLP is investigating claims on behalf of investors in Rentrak Corporation (\"Rentrak\") (NASDAQ: RENT), concerning the proposed acquisition of Rentrak by comScore, Inc. (NASDAQ: SCOR). Rentrak shareholders seeking more information about this acquisition can contact Carl L. Stine at (212) 759-4600 or cstine@wolfpopper.com. \n\nThe investigation concerns whether Rentrak's directors are breaching their fiduciary duties by failing to adequately maximize shareholder value. Under the terms of the proposed acquisition, each share of Rentrak will be converted into the right to receive 1.15 shares of comScore. The all-stock offer is valued at $47.69 per share. However, the offer price is below Rentrak's 52-week high of $85.69 per share and the 52-week average of $63.75 per share, and also below the median analyst price target of $74.80 per share. \n\nWolf Popper LLP has extensive experience representing investors in mergers and acquisition lawsuits and has successfully ensured that investors receive the maximum compensation. Twelve Wolf Popper attorneys were named Rising Stars or Super Lawyers in the 2015 Super Lawyers New York City Metro Edition, including Wolf Popper partner Carl Stine, who was included in the Super Lawyers Top 100 List for the New York City Metro area. View Wolf Popper attorney biographies at www.wolfpopper.com. \n\nAttorney Advertising: Prior Results Do Not Guarantee A Similar Outcome. \n\nWolf Popper LLP \n\n845 Third Avenue \n\nNew York, New York 10022 \n\nTelephone: 212-759-4600 \n\nToll Free Tel: 877-370-7703 \n\nToll Free Fax: 877-370-7704 \n\nEmail: cstine@wolfpopper.com \n\n  \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/wolf-popper-llp-investigates-claims-that-the-proposed-acquisition-of-rentrak-corp-may-not-be-in-the-best-interests-of-its-investors-300151875.html \n\nSOURCE Wolf Popper LLP \n\nPublished Sep. 30, 2015 \n\nCopyright © 2015 SYS-CON Media, Inc. — All Rights Reserved. \n\nSyndicated stories and blog feeds, all rights reserved by the author.", "source": "Virtualization Conference & Expo"}