{"published": "2015-09-17T15:55:59Z", "media-type": "Blog", "title": "Saturday's clash between Texas Tech and Arkansas may not seem like a particularly compelling matchup on paper, but it does feature a head-coaching battle for the ages: the", "id": "2c8305c4-e797-434b-b834-04bbbbf3be62", "content": "A Brief History of Bret Bielema’s Hideous Trolling David Quinn/AP College Football September 17, 2015 by Matt Borcas\tFacebook Twitter Email Print Saturday’s clash between Texas Tech and Arkansas may not seem like a particularly compelling matchup on paper, but it does feature a head-coaching battle for the ages: the biggest sex symbol in college football history versus Kliff Kingsbury, who’s also somewhat handsome. Like any great showdown, the matchup between Bret Bielema and Kingsbury brings a clear good-evil dichotomy. With his utopian brand of football, uncanny resemblance to beloved actor Ryan Gosling, and popularity with the kids, Kingsbury represents the side of righteousness and light. Meanwhile, Bielema is an unapologetic troll whose face is chiseled onto the Mt. Rushmore of odious FBS coaches. His chief redeeming quality might be his candor. Naturally, Bielema’s reputation made Toledo’s shocking Week 2 upset of Arkansas rife with schadenfreude for the neutral observer — especially on the heels of Bielema’s accurate but irrelevant complaints about Ohio State’s schedule, which smacked of sour grapes.1 As a result, jokes about the Head Hog have abounded IRL and on Twitter in recent days. Even Rex Ryan got in on the action: #Bills coach Rex Ryan with a solid shot at Bret Bielema. pic.twitter.com/dfqZCvVjlx — Zach Heilprin (@ZachHeilprin) September 16, 2015 It wasn’t always this way. In terms of public perception, Bielema’s head-coaching career began auspiciously enough, with the former Iowa nose guard first making waves back in 2006, during his rookie campaign helming the Badgers. The NCAA had just instituted a dumb, ill-advised rule that required (among other things) the clock to start as soon as the ball was kicked off, not when it was received, which was ridiculous for a whole slew of reasons — primarily because it artificially shortened college football games, and who in their right mind would want less college football? This rule was unceremoniously discarded after one season, in part because Bielema had exploited it so ingeniously in a November game against Penn State. With 23 seconds left in the first half and the Badgers set to kick off, Bielema instructed his players to intentionally go offside twice, thus reducing the amount of time the Nittany Lions had to mount a drive before halftime. Joe Paterno was FURIOUS, but there was nothing the officials could do but shrug their shoulders and point to the rulebook. It’s a damn shame that video of this incident has been removed from YouTube. Initially, Bielema was lauded for exposing Rule 3-2-5-e as a sham. He was sticking it to the establishment, and as we all know, there aren’t many establishments more loathsome than the NCAA. In retrospect, though, it’s fair to wonder if Bielema’s motives were less altruistic than plain evil; maybe he got off on bullying his easily agitated peer. To quote noted college football guru Stephanie Tanner: How rude! Bielema’s standing as a bully became more evident over time, most notably when he went for a two-point conversion at the end of a blowout win over Minnesota in 2010, a wholly unnecessary move that led to a postgame dust-up with then–Golden Gophers coach Tim Brewster: Listen to Bielema try in vain to defend such a monstrously wicked decision. That right there is the voice of a coaching sociopath, ladies and gentlemen. Want more proof? Later that season, the Badgers posted a preposterous 83 points on Indiana, the poverty-stricken child of college football teams. Hilariously, Bielema proceeded to make an appearance on Mike and Mike in an ill-fated attempt at damage control, but no one was buying the “Who, me?” routine. At least Woody Hayes had the decency to run up the score on good teams. In 2012, Bielema criticized new Ohio State coach Urban Meyer’s widely practiced method of attempting to “flip” recruits, famously declaring that “We at the Big Ten don’t want to be like the SEC — in any way, shape, or form.” Bielema would infamously end up bolting for Arkansas less than a year later, where he presumably remains insecure that Meyer is a far better recruiter. At Arkansas, Bielema fully blossomed into the grade-A troll that he is today. He’s feuded with too many SEC coaches to name, generally due to his self-serving and baseless contention that hurry-up offenses pose a serious player-safety risk. However, it was his wife, Jen, who caused his greatest controversy to date with the Razorbacks. As you surely remember, Wisconsin got utterly jobbed by the notoriously awful Pac-12 officials in a 2013 game against Arizona State — so much so that the refs faced sanctions afterward: That’s not how Jen saw it, though. On the contrary, Jen genuinely believed that Badgers fans were receiving a well-deserved dose of karmic retribution from the football gods, apparently because they weren’t pleased with the way Bert handled his departure from Wisconsin. While she quickly deleted this tweet, #karma has lived on as a meme in the college football Twittersphere, and it never gets old. In fact, it started trending in Columbus, of all places, moments after Toledo sealed its 16-12 upset of the Razorbacks. Jen’s mentions have been a sight to behold over the past few days. So, when Arkansas takes on Texas Tech on Saturday in a must-win game for Bielema, remember that it is your moral duty as a discerning college football fan to root for Kingsbury’s Red Raiders, your imperative to root against Bielema and his bullying ways. Bert is many things: a frat bro who never grew up, a troll with a persecution complex, and an opportunistic propagandist, and he deserves your scorn. If Bert wanted to face a Big Ten schedule, he should have stayed at Wisconsin! Nobody forced him to move to Fayetteville.\tFiled Under: College Football, Bret Bielema, Arkansas Razorbacks, Wisconsin Badgers, Urban Meyer, Ohio State Buckeyes, Big Ten, SEC, Toledo Rockets, trolls, College Football Recruiting, College Football Coaches, NCAA, NCAAF, Football, Matt Borcas Matt Borcas is a contributing writer for Grantland. Archive @ mattborcas More From Matt Borcas More College Football More The Triangle More from Matt Borcas A Brief History of Bret Bielema’s Hideous Trolling September 17, 2015 Who’s That Guy? Notre Dame’s New QB (and Savior) DeShone Kizer! September 14, 2015 2015 College Football Weekly Watchability Rankings September 2, 2015 2015 Preseason Heisman Watch: The Dak Attack, a Bunch of Bucks, and the Sophomore RB Trio of Your Dreams September 1, 2015 Woodson Redux: USC’s Adoree’ Jackson Wants to Front-Flip Into Your Heart, Win the Heisman, and Then Go to the Olympics August 24, 2015 See all from Matt Borcas More College Football A Brief History of Bret Bielema’s Hideous Trolling September 17, 2015 College Football Week 3 Preview: Ring the Bells That Still Can Ring September 17, 2015 Volunteer Work: Tennessee Football and the Devils You Know September 16, 2015 The Pac-12 and the Smartest Way to Pay College Athletes September 16, 2015 Part Mangum, Part Machine: BYU Chases Renewed National Relevance, One Hail Mary at a Time September 15, 2015 See all College Football More The Triangle A Brief History of Bret Bielema’s Hideous Trolling September 17, 2015 Run the Jewels: Could This Be the Best Rookie Running Back Class in Years? September 17, 2015 Denver’s Dilfer: If the Old Peyton Manning Never Comes Back, Can the Broncos Defense Carry Him? September 17, 2015 College Football Week 3 Preview: Ring the Bells That Still Can Ring September 17, 2015 ‘The Grantland NFL Podcast’: Midweek News and an Interview With Charlie Whitehurst September 17, 2015 See all The Triangle Want to keep up with all things Grantland? Sign up and don't miss a thing. Subscribe to the Grantland Newsletter × We know, Grantland publishes a lot of words. Worried you missed something? Keep up with the best of Grantland\nwith our weekly newsletter.\nSign-up is easy. So what are you waiting for?\tBy selecting submit you agree to the FanBridge Privacy Policy Top Stories Run the Jewels by Robert Mays\t2015 Fall TV Preview: Sifting Through the Historically Uninspiring Offerings by Andy Greenwald\tLocked Up: The 10 Best Movie Prisoners by Shea Serrano and Jason Concepcion\tWondering how to fill your TV time now that the thrilling summer season has concluded? Here’s what you need to know about the fall slate. Most Popular Features The EDM Ennio Morricone The Pitch: President George W. Bush in Yankee Stadium What Grantland Got Wrong The Triangle Could This Be the Best Rookie Running Back Class in Years? What If the Old Peyton Manning Never Comes Back? College Football Week 3 Preview A Brief History of Bret Bielema’s Hideous Trolling The Pac-12 and the Smartest Way to Pay College Athletes Hollywood Prospectus 2015 Fall TV Preview: Burn It All Down Locked Up: The 10 Best Movie Prisoners The 'Law & Order' Awards: Celebrating 25 Years of Bah-BHMMM Jon Snow Finally Gives 'Game of Thrones' Truthers Ammo Deerhunter's Bradford Cox Talks About His Band's New Album Previous Story Run the Jewels: Could This Be the Best Rookie Running Back Class in Years? ➤ The Grantland NFL Podcast September 16, 2015 Cheap Heat – For Whom the Bellatron Tolls September 16, 2015 The Jonah Keri Podcast – Evan Drellich & Jamey Newberg September 15, 2015", "source": "ESPN Feed: - blog"}