{"published": "2015-09-11T21:18:27Z", "media-type": "News", "title": "UpSnap Closes Fully Subscribed Non-Brokered Private Placement", "id": "ed1f73d9-1871-44b7-8e0d-a558f985d88d", "content": "TORONTO, ONTARIO--(Marketwired - Sept. 11, 2015) - UpSnap Inc. (CSE:UP) (\"UpSnap\" or the \"Company\"), is pleased to announce that the Company has closed its fully subscribed non-brokered private placement offering for gross proceeds of $800,000 (\"Offering\"). \n\nAs a result of the closing, the Company issued an aggregate of 32,000,000 units (\"Units\") at a price of $0.025 per Unit (\"Offering Price\"). Each Unit consists of one common share of the Company, and one-half of a share purchase warrant. Each whole warrant will be exercisable into one additional common share (\"Warrant Share\") of the Company at $0.05 per Warrant Share for a period of three (3) years from closing of the private placement. \n\nThe Offering remains subject to final approval of the Canadian Securities Exchange (\"CSE\"). All securities issued and issuable in connection with the Offering is subject to a four-month statutory hold period from the date of closing of the Offering. \n\nThe Company intends to use the proceeds from the private placement for general working capital purposes. While the Company intends to use the funds for the foregoing purposes, there may be circumstances where, for sound business reasons, funds may be reallocated. \n\nCertain insiders of the Company have acquired securities under the private placement. This participation is considered as a \"related party transaction\" as defined under Multilateral Instrument 61-101. The transaction is exempted from the formal valuation and minority shareholder approval requirements of Multilateral Instrument 61-101 as neither the fair market value of any shares issued to or the consideration paid by such persons will exceed 25% of the Company's market capitalization. The material change report in respect of the Offering is being filed less than 21 days before the closing of the Offering as the Company requires the gross proceeds it received under the Offering immediately to finance general working capital. \n\nAbout UpSnap \n\nUpSnap provides highly targeted, data-driven mobile advertising to attract the ideal audience for brands big and small. Combining first-party proprietary data and real-time analytics, UpSnap goes beyond location to deliver site agnostic and results-driven campaigns that produce qualified, engaged customers. UpSnap tailors each campaign to align with unique business goals, delivering the right customers for more meaningful exposure and better business results. \n\nThe CSE has not reviewed, approved or disapproved the content of this press release.", "source": "Stockhouse Canada"}