{"published": "2015-09-18T13:59:10Z", "media-type": "News", "title": "Cintas’ Reno Distribution Center Earns Recertification to Voluntary Protection Program Star Status by OSHA", "id": "20ac1362-0d29-45df-92c1-09a018036554", "content": "Cintas Corporation (NASDAQ: CTAS) today announced that its distribution center in Sparks, NV. received the Nevada Occupation Safety and Health Administration’s Voluntary Protection Program\n  (VPP) STAR Recertification. VPP is OSHA’s highest recognition for the practice of and commitment to exemplary occupational safety and health. \n \n“This recertification is confirmation of our company and employee-partner commitment to safety,” stated Rick Gerlach, Sr. Director of Safety and Health. “At Cintas, safety is paramount. We could\n  not succeed without employee-partners who are dedicated to working safely each and every day and insuring that those around them are working safely as well.” \n \nCintas’ Sparks location employs approximately 40 employee-partners and was the first of Cintas’ 9 Distribution Centers to achieve Star distinction three years ago. \n \n“Safety is instinctual in the distribution center and woven into every aspect of the job. Employee-partners take safety beyond these four walls and incorporate it into their lives at home,” stated\n  Elisha Harrison, General Manager. “I am extremely proud of all the employee-partners and the hard work they perform on a daily basis.” \n \nThe Sparks Distribution Center is one of only nine sites in the entire state of Nevada achieving VPP Star status. Cintas Corporation currently has 33 VPP Star Sites in total. The company ranks\n  10 th nationally in OSHA’s tracking of the number of Star Sites across various companies. \n \n About Cintas Corporation:  \n \nHeadquartered in Cincinnati, Cintas Corporation provides highly specialized services to businesses of all types primarily throughout North America. Cintas designs, manufactures and implements\n  corporate identity uniform programs, and provides entrance mats, restroom supplies, first aid, safety and fire protection products and services. Cintas is a publicly held company traded over the Nasdaq Global Select Market under the symbol CTAS and is a component of the Standard & Poor’s 500 Index. \n \n \n \n View source version on businesswire.com:  http://www.businesswire.com/news/home/20150918005434/en/", "source": "Wallstreet Online"}