{"published": "2015-09-29T23:03:07Z", "media-type": "News", "title": "Penalty rates back on the table but any changes would be put to the people: Michaelia Cash", "id": "6993ceed-0380-4bc3-93cf-d0156188eaa8", "content": "Senator Cash says there was evidence high weekend rates of time and a half on Saturday and double time on Sunday \"do deter weekend work\". Any proposal to reduce Sunday penalty rates will be taken to the next election, Employment Minister Michaelia Cash has declared.\n\nSenator Cash on Monday said there was evidence high weekend rates of time and a half on Saturday and double time on Sunday \"do deter weekend work\".\n\nThere is revived debate about cutting penalty rates after . On the weekend, Resources Minister Josh Frydenberg went further and advocated slashing the Sunday rate if doing so would boost the economy and jobs. But Treasurer Scott Morrison then , saying reforming the tax system in a low-wage environment was the priority and not industrial relations reform.\n\nBut Senator Cash on Monday put the issue back on the table in an interview with the ABC, and said any changes would be put to the people.\n\n\"There is no recommendation to remove penalty rates at the moment [but] I welcome a debate in relation to penalty rates,\" the minister cautioned.\n\n\"There is an argument now that they were set a number of years ago, they certainly seem to deter weekend work and we have more and more people wanting to work on the weekend.\"\n\nThe minister stressed the two bodies examining the issue, the Productivity Commission and Fair Work Commission, were independent of the government.\n\nBut she said if the Productivity Commission's final report into the workplace relations framework recommended reducing Sunday rates, the government would take the advice on board.\n\n\"If there is a good case for sensible and fair changes to bring balance to the Fair Work framework these will be clearly outlined by the government and taken to the next election to seek a mandate from the Australian people,\" Senator Cash said.\n\nDave Oliver from the ACTU warned on Monday that the movement would unleash a \"fierce\" campaign bigger than the Your Rights at Work campaign, which neutered the former Howard government in 2007.\n\nThe minister described the union's response as predictable and \"very, very sad\".\n\n\"When the unions say the Turnbull government is going to strip your penalty rates, quite frankly, that frankly that is an outright lie,\" she said.\n\nThe minister noted that there was no proposal to abolish weekend rates entirely, only to bring the Sunday rate into line with Saturday for the retail, entertainment and hospitality sectors.\n\nThis is the view of the Productivity Commission, which is examining Australia's industrial relations laws. The commission's draft report in August said that overall, penalty rates \"have a legitimate role in compensating employees for working long hours or at unsociable times\" and argued \"they should be maintained\".\n\nUnions reject this argument. The Australian Council of Trade Unions said in its response to the Productivity Commission that it had overlooked the issue of inequality in considering reducing penalty rates. \n\nFollow Latika Bourke on", "source": "Riverina Leader"}