{"published": "2015-09-10T23:32:41Z", "media-type": "News", "title": "Codefendant: Armed robbery and triple shooting near KU campus happened so lovers could ‘go on the run’ together", "id": "ddfeabe2-f75c-4e6c-85af-9f9d4522b296", "content": "_ Robert Long, 24, allegedly committed the armed robbery that led to the shooting of three Lawrence men in February so he could get money to “go on the run” with his then-girlfriend Rachael Hampton, a codefendant testified Thursday. Robert Long, left, and Rachael Hampton appear in Douglas County District Court, Thursday, June 4, 2015. Caleb Chrisman, 22, is charged with Long and Hampton in the Feb. 8 shootings of three men — two of them Kansas University students — in a central Lawrence home. The shootings allegedly happened as Chrisman helped Long rob a KU student known to sell illegal drugs.\n\nAs part of a plea deal, Chrisman testified Thursday for the prosecution at Hampton and Long’s joint preliminary hearing. In exchange for his testimony, prosecutors agreed to drop Chrisman’s three charges of aggravated kidnapping, leaving him with just two charges of aggravated robbery and one aggravated burglary charge.\n\nIn his testimony, Chrisman said Long and Hampton came to his Blue Springs, Mo., home the morning of the shooting to “hang out” when Long asked him to help with a robbery.\n\n“(Long) needed money and him and Rachael needed to go on the run,” Chrisman said. “Robert had an upcoming court date. He had just lost his job.”\n\nAccording to Douglas County District Court records, Chrisman failed to appear for a sentencing hearing Feb. 17 after pleading guilty to one count of felony attempt to elude a police officer. \n\nChrisman said that although Hampton and Long had been dating only “a few weeks,” Long told him Rachael was a “rider” — a colloquialism for “ride or die,” meaning loyal to the end.\n\n“(Long) made it obvious they were going to do it with or without me,” Chrisman said.\n\nLater that day, Chrisman said that he told Long he would go with them to Hampton’s Lawrence apartment, bringing a gun with him at Long’s request. Hampton then drove the two to her apartment, where Chrisman said Long began convincing him to help with the robbery.\n\nAfterward, Long allegedly sold some “molly,” or MDMA, to two customers, then had Hampton drive them to Wal-Mart so Long could show Chrisman how “easy” it is to rob someone, Chrisman claimed. There, a man got into Hampton’s car to buy drugs from Long, but Long and Chrisman pulled guns on him, taking $100, a wallet and an iPhone from the victim, Chrisman said.\n\nAfter the robbery, the victim was let go, Chrisman said. Long then had Hampton drive him and Chrisman to 1621 W. 19th Terrace, where two of the victims ¬– Phillip Hawley and Seth Peterson ¬– lived at the time.\n\nFirst, Long went in to buy Xanax from Hawley so he could leave the home’s back door unlocked as he left, Chrisman said. After some time, Long and Chrisman got out of Hampton’s car with guns and went down to the basement where Hawley and friend Arthur “C.J.” Perez were studying for an economics exam. Hampton was directed to circle the block and be the getaway car, Chrisman said.\n\nInside, Chrisman said Long demanded cash and drugs from the victims, and a third person — Peterson — came down to the basement. Chrisman said he told Peterson to get on the ground, and when he refused, Chrisman pistol-whipped Peterson two or three times in the head.\n\nDuring the altercation, Chrisman said Long began shooting at the victims, ultimately striking Hawley in the ear and neck area, Perez in the buttocks and Peterson in the arm. Later, Long would allegedly pull Hawley into a bedroom to take Hawley’s cash and marijuana, marijuana concentrates and “pills,” Hawley testified Wednesday.\n\nAfter Long had taken the items from Hawley, he allegedly shot Hawley in the back, puncturing a lung, Hawley said. \n\nWhen Chrisman and Long left the home, Chrisman said Hampton was nowhere to be found. The two then ran north onto the KU campus. Chrisman said he eventually stopped in the yard of a “big white house with a chain-link fence” and called Hampton. She later picked up Chrisman and Long, Chrisman said.\n\nChrisman said the three then went back to his house in Missouri, and Hampton and Chrisman left the day after. Chrisman said Long believed he’d killed Hawley and was “looking at life (in prison,)” so Long would shoot any police officer who tried to pull them over as they fled.\n\n“(Long said he was) going to need the (guns) to pave the way so that he and Rachael could start a new life together,” Chrisman said.\n\nLong and Hampton were found and arrested in Las Vegas in March after spending a month on the run.\n\nAfter Thursday’s testimony, Douglas County District Judge Kay Huff bound Long over on aggravated burglary, two counts of aggravated robbery and two counts of possession of a firearm by a convicted felon. Long is also charged with three counts of aggravated kidnapping and attempted first-degree murder, but Huff is taking those charges under advisement.\n\nHuff found that there was probable cause to bind Hampton over on charges of aiding and abetting aggravated burglary and two counts of aggravated robbery. Hampton is also charged with aiding and abetting Long’s three aggravated kidnapping charges, but Huff took those charges under advisement as well.\n\nThough Huff has not yet found probable cause in the aggravated kidnapping charges on both Hampton and Long, she did find probable cause for kidnappings’ alternative charges of aggravated battery. \n\nHuff will announce her decision at Hampton and Long’s arraignment Oct. 30. Chrisman is expected to appear next in court on Tuesday. We strive to uphold our values for every story published.", "source": "Lawrence Journal-World"}