{"published": "2015-09-23T17:26:36Z", "media-type": "Blog", "title": "5 Tips to Help Your New Mattress Last Longer", "id": "f79c74a1-4a70-4863-b246-6a7373b68c19", "content": "If you’re in the market for a new mattress, you want something that is both comfortable and durable. Comfort is easy; durability isn’t. That’s why we’ve come up with this list of five things that will help your new mattress last longer. You already have to spend a big chunk of money — it just makes sense to extend the life of your mattress as long as possible. \n Use a Waterproof Mattress Pad  \nMattress pads are not just for children. They help protect mattresses from moisture and wear . When you buy a new mattress, make sure to get a protection pad to go with it. This will help your mattress last longer. Mattress pads are relatively inexpensive, especially if you don’t opt to get a memory foam pad or something extra that you don’t need with a new mattress. Some pads include a moisture-proof barrier, and these will protect your mattress the best. \n Rotate the Mattress Every Couple of Months  \nIf you’re like most people, you sleep in the same position every night. Over time, this causes your mattress to sag and become uneven. Don’t let this happen to your new mattress. Instead, rotate your mattress 180 degrees every couple of months. Just make it part of your deep cleaning routine or think about whether your mattress needs to be rotated when you are changing the linens. Some of the longest lasting mattresses can be flipped over, too. Mattresses are heavy — you might have to enlist someone’s help to rotate or turn it over. \n Change the Linens and Vacuum Often  \nBed linens collect dust and allergens and absorb body odors. If you leave them on your bed too long, these problems transfer to your mattress. That’s why it’s recommended that you change your sheets every week and wash your duvet frequently. Not only does this help your mattress last longer, it helps you sleep better, too. You should also vacuum your mattress so that dust and allergens do not sit on it for too long. \n Don’t Let Your Pet Sleep with You  \nIt doesn’t matter how clean you think your pet is — he will drag unwanted things like dirt and dander onto your mattress. Accidents are also a possibility, even for well-trained pets. To help your mattress last longer, don’t let your pet sleep with you. The pet snuggles are best kept for when you’re both awake and off the bed and can enjoy them better. \n Choose a Good Mattress in the First Place  \nImage via Flickr by Noodles and Beef \n \nThere are a lot of different mattresses out there and the prices vary widely. Don’t buy the cheapest thing you can find because it probably won’t last very long. Instead, read as many mattress reviews as you can, and try mattresses out for yourself. Buying a reliable mattress that fits your particular needs and sleep habits will give you a bigger bang for your buck. \n \nThese tips should help your new mattress last longer. Start implementing them as soon as your mattress comes through the door. Sweet dreams! \n \nImage via Flickr by mah_Japan \n \nThe post 5 Tips to Help Your New Mattress Last Longer appeared first on INFOtainment News .", "source": "INFOtainment News"}