{"published": "2015-09-26T02:34:50Z", "media-type": "News", "title": "Former NFL player McDonald pleads not guilty to rape", "id": "4afcf991-7378-4277-a651-c6b4297cc910", "content": "SAN JOSE, Calif. (Reuters) - Former San Francisco 49ers defensive lineman Ray McDonald pleaded not guilty on Friday to a charge of rape by intoxication of a woman who reported being sexually assaulted at his home last December.\r\n … \r \nSep 14, 2014; Santa Clara, CA, USA; San Francisco 49ers defensive end Ray McDonald (91) looks on during the second quarter of the game against the Chicago Bears at Levi's Stadium. Mandatory Credit: Ed Szczepanski-USA TODAY Sports \n\nSAN JOSE, Calif. Former San Francisco 49ers defensive lineman Ray McDonald pleaded not guilty on Friday to a charge of rape by intoxication of a woman who reported being sexually assaulted at his home last December. \n\nMcDonald, 31, has remained free on $100,000 bond since shortly after his arrest last month in the case, marking the latest criminal charges brought against a National Football League player. \n\nDefense lawyers entered the not guilty plea on his behalf in Santa Clara County Superior Court. The eight-year NFL veteran, dressed in a pinstripe suit, was silent, except to answer, \"Yes, your honor\" to procedural questions put to him by the judge. \n\nMcDonald, who has previously asserted that he and his accuser had a consensual sexual encounter, did not address reporters outside the courthouse. He walked without comment to a waiting sport utility vehicle and was driven away. \n\nIf convicted, he faces up to eight years in prison. \n\nCurrent 49ers linebacker Ahmad Brooks has been charged separately with misdemeanor sexual battery of McDonald's alleged victim on the same night. His charge carries a maximum sentence of six months in jail. \n\nJudge Shelyna Brown granted a request by McDonald's lawyers to seal grand jury transcripts in the case, which Deputy District Attorney Chris Lameiro did not oppose. \n\nProsecutors have divulged few details about the circumstances of the alleged assault. \n\nIn a civil lawsuit brought by McDonald's accuser, the woman said she repeatedly slipped on the pool deck of his home and fell, losing consciousness from a head injury…", "source": "MyInforms"}