{"published": "2015-09-14T14:57:04Z", "media-type": "Blog", "title": "Remembering 9/11", "id": "e0ffa4c3-1d98-43a1-8b76-c6e7ebdeee77", "content": "I am writing this on September 11, 2015, remembering September 11, 2001. Those of you reading this email will remember where you were that fateful morning. About half an hour after I arrived at work at OM USA, that morning, evidently someone had called to say we needed to turn the TV on. The big TV was turned on and we gathered in horror to see the first tower smoking. We were stunned and watching in disbelief. Then when the plane was seen headed for the other tower we were transfixed, unable to move, our eyes not believing what we were seeing as the plane hit the second tower and flames erupted like we had not seen before. We had watched in disbelief some gasping hearing Oh NO’s, other things, until the plane hit the second tower and the horror hit all of us with different reactions but tears flowed , weeping, cries as people jumped from the burning building to escape the heat of the flames, a sight played over and over on the news outlets. We learned of the other attack on the Pentagon and the bravery of people taking down the fourth plane in a field in Pennsylvania. The bravery of the First Responders was amazing and many lost their lives trying to save those trapped in each situation Over 3,000.00 lost their lives in this inexplicable tragedy.\n\nThe pain of all those involved in that tragedy was beyond understanding. As I remember, the sight of those trapped, those suffering in the building, trying to flee, the sight of those jumping had broken my heart. The desperation they must have felt as they faced death!!! Some of the people who died were ready for eternity and are with their Lord and Savior Jesus Christ. Others were not and in their desperation either ran away from the flames or jumped to a Christ less eternity. Others scenarios of the different tragedies have been told in books and repeated to many people, especially the brave men who took down flight #93 before it could hit the capitol. Todd Beamer, a strong believer and a several others said “Let’s Roll,” and changed the course of that flight. None of them knew at the beginning of their day what would happen. None of us know at the beginning of our day what can happen. Are you ready for eternity? What is your destination? Please do not say I think I will go to heaven, that means you are not ready. You can change the course of your life today. If you are not sure please pray today to receive His free gift of salvation. acknowledge that you are a sinner, repent of your sin, ask forgiveness and cleansing of your sin and ask Jesus to come into your heart and life.", "source": "Sheila Shares"}