{"published": "2015-09-10T09:53:43Z", "media-type": "News", "title": "'Europe!' shouts refugees as …", "id": "4534c10a-d6d4-435a-852d-eec63d3afa1e", "content": "AFP  –  \nAfter two hours of terror, there is a roar of relief as the boat nears the shore. The oars are thrown overboard in triumph -- Europe at last. \n\nThere are cries of \"Allahu Akbar!\" (God is greatest). Men stagger onto the beach. They kiss the sand and each other's cheeks. \n\n\"Is this the European Union?\" one asked anxiously. He knows it is, but he wants to be sure. \n\nFew of the refugees and migrants landing at the lovely beach at Skala Sikamineas on Lesbos seem aware that their arrival in Greece will start with a marathon walk. \n\nIt is 50 kilometres (31 miles) to the island's main town, and many will have to walk. But right now, many don't even care. \n\n\"As soon as I put my feet down (on dry land), I stopped feeling tired,\" said Feras Tahan, a 34-year-old Syrian graphic designer, his shoes and trousers soaked. \n\n\"The difficult part was the sea. Now we have finished Part One, it will be better,\" he declared. \n\nIn the space of an hour on Wednesday, AFP correspondents watched six boats land along this stretch of the island's northern coastline. Four more could be seen in the distance, each boat carrying between 40 and 60 people. \n\nElated migrants, many of them Syrians who have paid $1,000 or more for the crossing from Turkey, rejoiced on the shore. \n- 'We are lost' - \nBut it is a different story on the long road to the main town, Mytilene, where the new arrivals must go to be registered. \n\nA dozen kilometres from the beach, exhaustion was etched on every face. Along with their possessions, many were carrying small children and the sun was scorching. \n\n\"We have been walking for four hours. There is no bus, no taxi, no water, no anything,\" said Mohammed Yassin al-Jahabra, a 23-year-old English literature student, surrounded by a crowd of anxious and exhausted friends and family. \n\nA few hours ago, they were celebrating having fled daily destruction in the Syrian cities of Aleppo and Daraa -- at the start of what they hoped would be new lives. \n\nNow, they are ready to drop. At their current pace, it would take them more than a day to finish this gruelling walk -- the first of many on the journey to Germany, Sweden and elsewhere. \n\nDarkness was falling and with the children they didn't want to sleep on the road. \n\nA couple of buses passed, the Syrians waving frantically, but the drivers didn't stop. \n\n\"We are lost,\" said Jahabra. \n- Non-stop arrivals - \nEarlier this week, officials on Lesbos registered a staggering 15,000 refugees in just over 24 hours after a huge backlog had built up, leaving people stranded on the island for days in filthy conditions. \n\nBut the boats are still arriving at an astonishing pace. \n\nAuthorities on this island of 86,000 residents are evidently still struggling to cope. Officials were nowhere to be seen at the busy arrival point near Skala Sikamineas on Wednesday afternoon. \n\nBuses run by the UN refugee agency and private companies were later seen heading to the coast, but too late for the hundreds who set off on the long road earlier in the day. \n\nThe only people there to welcome the arrivals on the beach were a handful of Danish volunteers who came at their own initiative. \n\n\"We set up a Facebook page and people gave donations. We have come here with a few thousand euros, said 20-year-old Marie Bach, as she gave out bread, water and bananas to soaking wet Syrians and Afghans. \n\nHer mother gave her some cash as a graduation present and she decided to spend it coming here. \n\nOn the long walk to Mytilene, a mountain of hundreds of discarded orange life jackets gives a sense of the scale of recent arrivals. \n\nAnd closer to town, aid workers at one of island's two main refugee camps were under no illusions. \n\n\"This is a sort of a lull where we have a chance to regroup and improve conditions in the camp,\" says Lani Fortier, Deputy Field Director at the International Rescue Committee, as she collected huge piles of litter left after the recent mass exodus. \n\n\"The problem is people are still landing every single day,\" she added. \n\n\"It's just going to fill right back up again.\" \n\nkjl/fg", "source": "Yahoo! India"}