{"published": "2015-09-28T15:54:18Z", "media-type": "News", "title": "US will work with Russia and Iran to beat IS - but Assad must go, says Obama", "id": "8b02a786-7fe7-44fe-acea-cd36cc635e8c", "content": "The United States is ready to work with Russia and Iran to defeat the \"apocalyptic\" Islamic State (IS) cult in Syria but Bashar Assad must be deposed, Barack Obama has told world leaders.\n\nEfforts to engage Tehran - a close ally of Assad's regime - in a push to end the protracted civil war have been spurred on by a thaw in relations with the West b ut Iranian president Hasan Rouhani - who is holding talks with David Cameron - has insisted it is essential the regime stays in place. \n\nPresident Obama told the United Nations summit in New York the international community must work together to defeat the jihadi group, also known as Isil, that has taken over large parts of Iraq and Syria. \n\nHe said: \"There is no room for accommodating an apocalyptic cult like Isil.\"\n\nMr Cameron is meeting Mr Rouhani on the fringes of the summit in a fresh bid to revive the stalled Syrian peace process.\n\nThe Iranian premier earlier told a meeting of scholars and experts: \"If we are to succeed in defeating terrorism, the government in Damascus cannot be weakened. It must be able to carry on the fight.\" \n\nPresident Obama told the summit that while military action is necessary it is not enough to secure lasting stability. \n\n\"The United States is prepared to work with any nation, including Russia and Iran, to resolve the conflict,\" he added.\n\n\"But we must recognise that there cannot be, after so much bloodshed, so much carnage, a return to the pre-war status quo.\"\n\nHe added: \"Realism dictates that compromise will be required to end the fighting and ultimately stamp out Isil, but realism also requires a managed transition away from Assad and to a new leader.\"\n\nPresident Obama's comments come amid concerns over an unexpected build-up of Russian troops in support of the Moscow-backed Assad regime - which the Kremlin says is the best way to take on IS. \n\nThe conflict - which has cost more than 250,000 lives, left Europe struggling to deal with a huge influx of refugees and enabled the rise of Islamic State extremists - is set to dominate the annual UN General Assembly. \n\nMr Cameron hopes to build on the summer signing of an international deal on Iran's nuclear programme to bolster regional support for a political settlement in Syria.\n\nBut he was accused by Labour leader Jeremy Corbyn of failing to show leadership on the issue by choosing not to address the main UN General Assembly session in person, leaving it to Foreign Secretary Philip Hammond to speak for the UK on Syria.\n\nThe Prime Minister will use one-to-one talks with a number of key figures - though not Mr Putin - to press his case that the Syrian president \"can't be part\" of a peaceful solution to the civil war. \n\nBut with Europe increasingly overwhelmed by the upsurge of refugees fleeing the conflict and IS in control of large swathes of the country, he has joined Western allies such as the US and France in signalling a willingness to discuss whether he could play a transitional role.\n\nSpeaking to reporters accompanying him on the visit - which will also focus on climate change and new UN development goals - Mr Cameron said it was about \"stepping up\" international efforts to take on the militant threat.\n\n\"Assad can't be part of Syria's future. He has butchered his own people. He has helped create this conflict and this migration crisis. He is one of the great recruiting sergeants for Isil,\" he said.\n\n\"He can't play a part in the future of Syria and that position hasn't changed.\n\n\"Obviously conversations about how we bring about transition are very important and that's what we need to see greater emphasis on.\"\n\nCopyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Sussex Express"}