{"published": "2015-09-25T10:31:57Z", "media-type": "News", "title": "Iloilo expects boost from APEC hosting, sees zero unemployment", "id": "ff627363-9507-4fc3-a004-8b1e000c2404", "content": "Iloilo City – Iloilo City is anticipating a major economic boost from its hosting stint of the ongoing Asia Pacific Economic Cooperation (APEC) meetings in the country, which, in the long term, should help the local city government achieve its zero unemployment rate target in 2020. \n \n“The population of Iloilo City is close to 500,000 and our goal is to have at least three million visitors by year 2020. We all also know that for every six tourists that come to a certain locality, it provides one job. With three million visitors, that could take Iloilo a zero unemployment rate in 2020,” Iloilo City Mayor Jed Patrick Mabilog said in an interview with reporters. \n \n“But [our APEC hosting] is a good start for Iloilo’s vision for unemployment at the same time to increase purchasing power. It will boost the local economy, which is already happening right now because with Iloilo’s hosting of APEC, it accounts for additional 3,000 to 5,000 people [foreign delegates] now in Iloilo City participating in APEC,” he added. \n \nMabilog emphasized that its hosting of this major regional forum will help develop Iloilo’s meetings, incentives, conferences, and exhibitions (MICE) industry, which will create more jobs in the process. \n \nThe 22nd APEC SME Ministerial Meeting and related activities, which were held at the recently opened government-owned Iloilo Convention Center (ICON), already concluded yesterday. \n \nMabilog said ICON required the national government the biggest investment allocation for its preparation of APEC meetings, while the local government of Iloilo alone allotted as much as P5 million for securing locations, peace and order, and providing world-class entertainment for the delegates of member economies. \n \n“Of course, we expect an ROI [return of investment]. If the delegates had good experience, they can share this to their friends and relatives, they can bring them here. Because that would show that if a delegate would come to a certain area, certain locality, and would have a nice experience, the tendency is they would go back,” Mabilog said. \n \n“The big investments came from the national government, especially from the office of the president, which pushes for the development of ICON, which will boost the local economy because although the convention center is now fully booked until October 6, it has already reservations of about 30 conventions until the end of the year,” he further said. \n \nOther than the MICE industry, Iloilo is also expecting to grow its retail industry with the arrival and expansion of the country’s biggest conglomerates, such as the “Ayala Group, Gaisano, SM group, Megaworld, Filinvest,” among others. \n \nThe city government of Iloilo also hosted the “Fostering APEC’s Infrastructure through Long-Term Investment and Capital Market Development” meeting last July.", "source": "Manila Bulletin"}