{"published": "2015-09-16T10:30:00Z", "media-type": "News", "title": "Fossil Fuels Fuel Inequality, but There Is a Solution", "id": "813a70ff-47a8-4ba7-9582-9a3bbd0a367b", "content": "Much of the world is still held captive by last century's dirty-energy system that has a long history of locking inequality into place, economically and politically.      \nAs the nations of the world tackle the problem of inequality, remember this: clean energy is part of the solution. \n\nMuch of the world is still held captive by last century's dirty-energy system that has a long history of locking inequality into place, economically and politically. Look across the world and you will find the vast majority of people subject to the whims of a very few. And they are forced to pay exorbitant prices just to keep their lights on and water flowing. Here in the United States, this dirty, old-energy system has protected the profits of special interests while continuing to pollute our water and air -- essentially making the rest of us carry the health costs. This hits the poorest the hardest, whose asthma rates are skyrocketing and who have to choose between their health and putting food on the table. And this system has propped up despots and oligarchs, creating some of the least egalitarian, least democratic nations in the world. \n\nBut what if everyone had the freedom to create and control their own energy? Imagine a world where we were not dependent on ever-more costly fuels controlled by the ever-shrinking few? Imagine a world where the \"fuel\" was limitless, free and healthy. \n\nThis is not a pipe dream. It is happening in communities around this country and world, who are embracing energy democracy. In New York State, organizations like PUSH Buffalo are helping families reduce high energy bills through efficiency and solar energy, while creating new living-wage jobs for local residents. In Los Angeles, LAANE and the unions came together to triple the budget for energy efficiency and create a pipeline into good jobs targeted to those workers who have been on the bench the longest. \n\n\n\nWind turbines in South Dakota. (image: NREL ) \n\nIn Iowa and South Dakota, residents are harnessing the wind to produce more than a quarter of their electricity and creating economic opportunity for farmers in the process. In Arizona, Barry Goldwater, Jr. is fighting for rooftop solar because, as a standard bearer for the Republican Party, he believes every American has the right to capture and use energy from the sun. In South Carolina, Boeing employees make airplanes using clean renewable energy, strengthening pathways to the middle class through manufacturing. \n\nFrom neighborhoods to states, from the suburbs to the city, and from farms to factories, people are blazing a clean-energy path to economic growth and greater equality. Affordable clean energy for everyone is 100 percent possible and it is up to our leaders in government, business, and in communities around the world to make it so. \n\nWhen people are provided the opportunity to produce their own energy in a way that grows the economy and protects their health and the environment, every person has a chance at a better life. And since the fuels involved -- like the sun and the wind -- are free and can never run out, clean energy opens the door to generations of sustainable growth. This is exactly the kind of development the United Nations is trying to achieve through its new global Sustainable Development Goals. \n\nAnd as clean technology's costs continue to fall, a wonderful possibility emerges: developing countries can leapfrog fossil fuels entirely, skipping the dirty-energy sources of the past and going right to the cutting-edge clean and renewable-energy sources of the future. It happened with cell phones -- developing countries might not have much in the way of landline systems, but everyone has a mobile. If it happens with clean energy and localized ownership is prioritized, this world will be a very different place. \n\n\n\nSolar lamps provide new opportunities for families in India. (image: Swayam Shikshan Prayog/ USAID ) \n\nAnd just as mobile phones have been a force for democratization, so too will local renewable energy. Just imagine a world where the people own and control their own energy, instead of having to rely on a troubled regime or faraway company for power. \n\nMore than a billion people still lack access to electricity. It's hard to envision ending poverty, hunger, and want -- or achieving any of the other Sustainable Development Goals -- if a billion people can't turn on a light when they need one, much less a computer. \n\nClean renewable energy offers a way to bring people out of darkness, while developing local jobs and local economies -- and all this without doing damage to the planet or to the health of those who share it. It offers a way to unleash the human spirit -- the most powerful and equitably distributed energy of all. \n\nYOU MIGHT ALSO LIKE \n\nMark Ruffalo to Jon Stewart: We Have a 50-State Plan to Power America on 100% Renewable Energy \n\nAmazing New Process Treats Wastewater, Captures Carbon and Makes Renewable Energy \n\nThe Big Reason Why America Is Turning to Renewable Energy \n\n7 Surprising Realities Behind the Transition to Renewable Energy \n\nGoogle to Convert Coal Power Plant Into Data Center Powered by 100% Renewable Energy \n\n  \n   Related Stories To Fight Inequality, Turn On Clean Energy Everywhere New York, London, Hong Kong and Tokyo Will Be Under Water If All Fossil Fuel Is Burned Burning All Fossil Fuels Will Melt Entire Antarctic Ice-Sheet, Study Shows", "source": "AlterNet.org"}