{"published": "2015-09-29T16:08:47Z", "media-type": "News", "title": "Ohio bill would protect property seized by police", "id": "8c135f86-7335-4142-820a-f3c284888644", "content": "Tom Brinkman Jr.\nTom Brinkman Jr. (Photo: Submitted, Submitted) \n\nCOLUMBUS -- Police can seize your car, cash and home as evidence then force you to prove your innocence to get them back. \n\nIt's something at least one U.S. Congressman calls \"legal robbery,\" and some state lawmakers want it to stop. \n\nRep. Rob McColley, R-Napoleon, and Rep. Tom Brinkman, R-Mount Lookout, introduced a bill Tuesday that would force prosecutors to convict a person of a crime before keeping their seized property as profit. Police could take property as evidence, but they would have to prove the person committed a crime to keep it. \n\nThe proposal also would prohibit local police from coordinating with federal authorities unless the amount of property seized was more than $50,000. \n\nThat's important because 13 Cincinnati-area law enforcement agencies earned more than $7.5 million in seizure money by coordinating with federal authorities in the last five years. Nationally, a total of $4.1 billion in such funds have been seized by local police and federal agents since 2006 using civil forfeiture laws. \n\n\"We want law enforcement to focus on criminals not just cash and cars,\" said Lee McGrath, legislative counsel for the Institute for Justice, a libertarian law firm. \n\nBut the Ohio Prosecuting Attorneys Association opposes the change, saying property is seized in criminal cases and convictions aren't always possible. A defendant might die or flee the area. Some illegal money is sent through the mail and the sender cannot be identified, said John Murphy, executive director of the Ohio Prosecuting Attorneys Association. \n\n\"We are being tagged with the sins of others in other states or even the federal government who in some situations have played fast and loose,\" Murphy said. \n\nMcColley disagreed, saying prosecutors are trying to prosecute property rather than individuals in many cases. \n\nProperty rights and individual's rights should trump prosecutors' need to keep seized cash and vehicles, said Rep. Jonathan Dever, R-Maderia, who supports the bill. \n\n\"Prosecutors should have to prove their case, just like defense attorneys have to prove their case,\" said Dever, who is also an attorney. \n\nA recent poll showed 81 percent of Ohio voters want changes to the way police seize money and property. Support for change is bipartisan with 83 percent of Republicans and 87 percent of Democrats asking for a fix, according to the poll by Fix Forfeiture, a coalition of conservative Americans for Tax Reform, progressive American Civil Liberties Union, the National Association for the Advancement of Colored People and others. \n\n\"This legislation is long overdue and will provide a welcome to relief to the many Ohioans whose property is taken away from them oftentimes without any recourse or hope of recouping their lost assets,\" said Mike Brickner, senior policy director of ACLU of Ohio. Fix Forfeiture is pushing for changes to Michigan and Pennsylvania laws as well. \n\nReporter James Pilcher contributed to this article. \n\nRead or Share this story: http://ohne.ws/1KICr5W", "source": "Bucyrus Telegraph Forum"}