{"published": "2015-09-12T15:43:21Z", "media-type": "Blog", "title": "Pregnancy: Weeks 21-24", "id": "0db49efd-ca96-4c96-b4aa-7171e7c96155", "content": "Pregnancy: Weeks 21-24 12 Sep It’s been another month! Let’s take a look at how my pregnancy’s going. Here are my previous updates: weeks 1-7, weeks 8-12, weeks 13-16, and weeks 17-20. We’ll start with a bump pic… Weight Gained: By 20 weeks I gained 11 lbs total. Wk 21= +0 lbs, Wk 22= +2 lbs, Wk 23= +1 lb, Wk 24= +0 lb. So by week 24 I gained 14 lbs total. Symptoms: I tend to over heat more easily. I’ve noticed I get much sweatier than normal in body pump. TMI- I also get constipated regularly and only poop (hey, everyone does it!) every few days. For me, that’s out of the norm. I was a regular once-a-day-er, haha. My feet and belly seem to be more swollen/bigger by the end of the day. Nothing crazy or uncomfortable, just noticeable. Food Cravings/Aversions: Again this update, nothing out of the ordinary. I’ve been keeping an eye on my sugars and only indulging once a week (although I tend to over indulge), and that doesn’t even include froyo/soft serve ;) Good news though, I passed my glucose test! I’ve been eating a lot of nut butters and nuts in general. I tend to keep dipping the spoon in the jar or my hand in the container. Misc: I bought some new workout clothes that fit better. I never liked tight tops when running, but now I’m all about them to show off my bump!  My mom got me some work pants that I really like. I won this Mud Love bracelet from Carlee’s Blog. I got to pick which word I wanted off a list and I went with “family” because a) family is everything b) my family is always there for me and c) I’m starting my own family. All good things to remember and think about throughout the day. Workouts: Took things easy after my big race last Sunday ;) J/K, it was only a 5k. This week was the same as most. I’m just happy to be able to run still <3 Mon– Rest\nTues– 1 m walk on tread/ Body Pump\nWed– 4m on tread @ 9:22 pace\nThurs– 1.5 m walk on tread/ Body Pump\nFri– 4m on tread @ 9:15 pace\nSat– Body Pump\nSun– 1 hr on the Elliptical This bruise from the glucose test was especially fun to show off at body pump. My veins are full and plump, but small, so I almost always bruise after giving blood. It was really fun when I had to give blood every few days for a month for the IUI. Hopefully people don’t think I’m doing drugs while pregnant, haha. I doubt they do. I’m sure it’ll look good on the elliptical on Sunday, too when my arm stretches out holding the handles (or whatever they’re called.) Linking up with Erin for my weekend snapshot. Do you bruise easily after giving blood? Tags: Belly Bump, Family, Mud Love, Pregnancy, Weekly Workout, Weeks 21-24\tComments Leave a Comment Categories Family, Food, HRF Baby, Pregnancy, Running", "source": "Heather Runs Fast"}