{"published": "2015-09-10T14:29:24Z", "media-type": "Blog", "title": "Hiring software firm gatherDocs merges with Colorado-based Efficient Hire", "id": "d77cf4fc-3546-43fe-8b1b-60679c6cfa46", "content": "gatherDocs , a company that makes mobile hiring software, merged with Efficient Hire , an employee onboarding software firm in Littleton, Colo. \n \ngatherDocs’ three employees are splitting up, with cofounder Alex King leaving the company, developer TJ Robleto heading to Colorado and cofounder Bruce Marable staying in Philly. Both Robleto and Marable will keep working on gatherDocs, which will take on Efficient Hire’s branding. Financial term of the deal were not disclosed. \n \nBruce Marable. (Courtesy photo) \n \nMarable, 32, of Northern Liberties, said he’s staying in Philadelphia because he wants to be part of the city’s future. \n \n“With things growing so fast including population rates, startup creation, real estate development, etc, it’s an exciting place to be and I want to participate in creating that excitement versus watching others create it and I watch from a distance,” he wrote in an email. \n \nHe continued: “Having been born and raised in Philly, with the combination of being a minority in the tech space, I want to represent for the city and for minorities to show that we can compete in the startup space. I also hope that as my journey continues it inspires others to take the leap of faith to believe in themselves and go for it.” \n \nMarable is also on the board of youth coding nonprofit Coded By Kids . He works out of Benjamin’s Desk in Rittenhouse Square. \n \nAlex King. (Courtesy photo) \n \nThe Efficient Hire relationship started with a cold call. \n \nKing, 34, called Efficient Hire to learn more about them and it turned into a conversation about a partnership, Marable wrote in an email. \n \n“After partnering closely with Efficient Hire for a year before the merger, we realized that their rapidly growing customer base and internal support team would allow gatherDocs to reach exponential growth and provide even better customer service,” Marable said in a statement. \n \ngatherDocs’ former CTO, Dan Lopez , is now the senior director of product development at venture-backed edtech company ApprenNet . (Lopez left gatherDocs in early 2014.)", "source": "Technical.ly Philly"}