{"published": "2015-09-21T09:35:43Z", "media-type": "News", "title": "Look up median household, family incomes in your Michigan county", "id": "29573b6c-c550-4130-a01e-2190795d88cb", "content": "Email By Julie Mack | jmack1@mlive.com The Kalamazoo Gazette \n\non September 21, 2015 at 5:30 AM, updated September 21, 2015 at 5:35 AM Comments Michigan incomes are continuing to inch up after the Great Recession, with the state\n\n's median household income estimated at $49,847 for 2014.\n\nThat's up from $49,013 in 2013 and $48,519 in 2009.\n\nDatabase: Median income by county The last week for the 50 states as well as counties with a population of at least 65,000 residents.\n\nYou can use this database to look up the numbers for each of the 29 Michigan counties included in the Census release.\n\nThe database shows each county's estimated median household and family income for 2010 through 2014.\n\nMeanwhile, the data shows median family income was $62,143 in 2014, up from $61,641 a year earlier.\n\nUnder the Census definitions, a family consists of two or more people (one of whom is the householder) related by birth, marriage, or adoption residing in the same housing unit.\n\nA household consists of all people who occupy a housing unit regardless of relationship. A household may consist of a person living alone or multiple unrelated individuals or families living together.\n\nAlso shown are the percentages of all county residents who were living below the poverty line in 2014, and the percentage of children age 18 and under living in poverty.\n\nStatewide, the 2014 poverty rate was 16.2 percent for all residents and 22.6 percent for those 18 and under. Both numbers were down slightly from the previous year.\n\nTo see all the information available in the database, click on \"details\" when looking at a county.\n\nJulie Mack writes for the Kalamazoo Gazette. Email her at jmack1@mlive.com, call her at 269-350-0277 or follow her on Twitter @kzjuliemack. Comments", "source": "Kalamazoo Gazette"}