{"published": "2015-09-15T23:23:00Z", "media-type": "News", "title": "Subi office values slide (The West Australian)", "id": "616d0a5b-7e14-46b7-a911-5df090ef91ff", "content": "There has been a dramatic drop in Subiaco office rental values — with a massive jump in vacancies — but Colliers International is confident about the area’s mid-term future. \n\nNew research by Colliers International presents a dismal set of statistics for investors in Subiaco office market, with a 15.1 per cent office vacancy and 24,425sqm of empty stock in July. \n\nPrime office rents ranged from $295sqm to $395sqm, down 17.5 per cent in the past year and by 30 per cent since its peak in 2012. \n\nIf that were not bad enough, Colliers director office leasing Neil Kidd believes vacancy rates will take another hit when the stadium closes, with the closure to undermine the perception of Subiaco as a vibrant hub of activity. \n\nHowever, he said investors were voting with their feet, confident that Subiaco’s fortunes would rebound. \n\nA further 12,525sqm of office space is under construction, due for completion by the end of next year, in developments such as the old Ace Cinema development and an office at 23 Railway St. \n\n“The new space  ... shows a level of confidence in Subiaco being able to sustain not only more residents and more retail, but increased office and commercial space,” he said. \n\nMr Kidd said the quality of the Subiaco stock was better than neighbouring West Perth, with a much lower 11 per cent vacancy rate. \n\nHowever he said  better public transport options and better quality stock would soon make Subiaco the more attractive market. \n\n“There are some critical factors that have to be in place to sell suburban space,” he explained.“It has to be a recognised location. \n\n“Next is security, including after-hours activation of the area. \n\n“If you can’t walk out at night after work and feel safe, it is hard for businesses to get employees on board. \n\n“This is where the retail and restaurant trade makes a difference in Subiaco versus other areas — more so than in West Perth.” \n\nThe latest Metro Office report shows Subiaco has approximately 162,000sqm of commercial space in buildings with more than 1000sqm of office space with two-thirds of this space less than 10 years old.", "source": "West Australian"}