{"published": "2015-09-18T06:00:00Z", "media-type": "News", "title": "Matt Giteau and Sam Burgess can be Rugby World Cup gamebreakers: Jonny Wilkinson", "id": "936414ca-2f08-4c1c-b6bb-49f1ce83307b", "content": "Jonny Wilkinson has a sharp eye. Anyone who has seen him kick a ball knows that, especially those who saw his 2003 World Cup-winning drop goal in extra time in the final between Australia and England. Jonny Wilkinson has a sharp eye. Anyone who has seen him kick a ball knows that, especially those who saw his 2003 World Cup-winning drop goal in extra time in the final between Australia and England. Wilkinson doesn't raise the subject of that kick in an interview with Fairfax Media, but when asked he still fondly recalls the moment that is etched in rugby folklore.\n\n\"As soon as I dropped it I knew I wasn't going to smash it out the back of the stadium, but I knew it was going to go straight. It was exactly what I was asking for,\" he says with the softest of laughs.\n\nFast forward to today. Even in retirement, Wilkinson, 36, still has that sharp eye. Okay … he no longer needs to use it for sizing up kicks, or reading a game from his old playmaking position at No.10.\n\nHowever, Wilkinson, who retired from Test rugby in December 2012 - with 97 Test caps for England and the British and Irish Lions - and all professional rugby in May last year, has a sharp eye for talent.\n\nWhen asked about two World Cup players of contrasting size, experience and - arguably – rugby ability, who could be much spoken of by the time the World Cup ends on November 1, Wilkinson says ...\n\nWallabies veteran Matt Giteau, 32, 85kg, 178cm and the sole survivor in this Wallabies squad of that losing 2003 side with 96 Tests caps since his 2002 Test debut. and England rookie Sam Burgess, 26, 116kg, 196cm, with two Test caps and a World Cup debutant a little less than one year since leaving the 2014 NRL premiership winning Rabbitohs.\n\nPending selections, both centres could square off in their crucial Pool A game at Twickenham on October 4 (6am AEST); or even in the final if both teams qualify.\n\nWilkinson's esteem for Giteau was clear in May last year when he said: \"I don't quite know how a team ever let him go in Australia\" after Giteau missed World Cup selection in 2011 and joined Toulon.\n\nWilkinson believes the Wallabies' fate will largely hinge on Giteau, who returned to the team after the Australian Rugby Union changed its selection policy on overseas-based players. The previously closed door is now open to those with 60 Tests and seven non-consecutive years in an Australian Super Rugby team.\n\nAsked if Giteau's most valuable asset is his ability or experience, Wilkinson says: \"The fact he has been able to accumulate all that experience - all that decision-making ability, all that composure, all that wealth of knowledge and rugby wisdom - is huge.\n\n\"But what's amazing is that he is still plays with a kind of youthful exuberance that allows him to still be a game breaker at any point.\n\n\"That combination makes him dangerous. He is still one of the guys who can make the 50 or 60-yard break.\n\n\"He is still the guy that is creating things. But he is still the guy sitting back saying, 'Now is the time to do this', and directing the team. He could be the one who could turn a game from losing to winning in an instant.\"\n\nWilkinson believes players like Giteau are crucial to any World Cup team.\n\n\"The game is largely at the feet of these kind of players,\" Wilkinson says.\n\n\"It is amazing how dominant and the effect the guy has had on the Top 14.\n\n\"And the Top 14 in France is not a competition - in the way it is played - that should allow itself to be defined by someone playing in the centre role. But he has done it.\n\n\"When you leave space or offer options and you give him a platform to play with, give him some decent ball when he wants it, it is like a red rag to a bull after that.\n\n\"That is exactly what he did and that is exactly what he will do for Australia.\"\n\nDespite voices to the contrary, Wilkinson steadfastly believes Burgess should be in England's World Cup squad just one year into his code switch. \"He is an enormous talent,\" Wilkinson says.\n\nWilkinson says Burgess' \"leadership\" traits are a \"top priority in terms of being a team guy\".\n\nHe also cites as \"inspirational\" qualities, \"his strength in defence and attack\", adding that with \"what he brings to a team with his aura you have a very special player\".\n\nHowever, Wilkinson recognises Burgess is far from the finished product.\n\n\"There are certain elements that are just rugby – you can take off union or league, it's just rugby,\" Wilkinson says.\n\n\"He has all that, the rugby part. The union part is just positional. There are the subtle nuances and largely to a degree it goes beyond that to managing the game and everyone has to do that nowadays.\"\n\nWilkinson believes picking Burgess or not should come down to balancing his strengths and weaknesses.\n\n\"You have got to weigh up, 'How much are we willing to take, knowing that maybe there may have been another season in there to build [his game] up',\" Wilkinson says.\n\n\"But then you look at the weight of the balance on the other side and say, 'This guy is just too strong. His presence is too formidable in terms of how it affects other guys'.\n\n\"And you say, 'Actually that is going to be the most beneficial thing', in terms of how you might want to use him.\n\n\"And if they are using him off the bench, they can control that game management side because they will be able to send messages on with him.\"\n\nWilkinson hopes Burgess enjoys a long future in English rugby, saying: \"He is a once in a generation kind of player in what he brings with that personal strength.\n\n\"I am a big fan of his and a lot of the other guys coming across [from league].\n\n\"This game of ours is won just like any other game: it takes a lot of time to learn it.\n\n\"That goes for us who've played it all our lives, not just guys who are coming over.\"\n\nJonny Wilkinson is a Land Rover ambassador. Land Rover's #WeDealInReal campaign champions and celebrates the people that are the heart and soul of the game, by putting local clubs on the global stage. Find out more at landrover.com/rugby The story first appeared on The Sydney Morning Herald.", "source": "Singleton Argus"}