{"published": "2015-09-24T11:25:00Z", "media-type": "Blog", "title": "Microsoft Drops Bing For Baidu In China To Strengthen Windows 10 Adoption Rate", "id": "5ccb3b56-467b-4c3f-8cd2-f3c07e9829bf", "content": "by\rBrandon Hill\r—\rThursday, September 24, 2015\rMicrosoft Drops Bing For Baidu In China To Strengthen Windows 10 Adoption Rate\rMicrosoft really wants you to use Bing. The company makes Bing a focal point of its new Windows 10 and Windows 10 Mobile operating system and even pays customers to use its search engine with Bing Rewards. The company has even received some flak for making Bing the default search engine in Windows 10 if they choose the Express upgrade options, since this overrode the user’s previous default search option. Bing has roughly 20 percent of the U.S. search engine market, and a little less than 11 percent of the global search engine market. In an effort to push Windows 10 growth in China, Microsoft’s isn’t going to try to force Bing upon users. Instead, it has teamed up with Chinese giant Baidu, making it the default search engine in Windows 10’s Edge browser. In addition, Microsoft will make Baidu.com the default homepage in Edge as well. Baidu has over 600 million active users globally, so Microsoft was wise to concede on this front. And given Baidu’s dominance in China, it makes sense to play to a home audience. “Together, we will make it easy for Baidu customers to upgrade to Windows 10 and we will deliver a custom experience for customers in China, providing local browsing and search experiences,” said Microsoft’s Yusuf Mehdi. “We remain deeply committed to delivering Bing around the world and we’re also committed to offering locally relevant experiences – like Baidu in China – to provide great Windows 10 experiences.” In addition, Microsoft is hoping that more Chinese users will abandon the piracy route in order to purchase a genuine copy of Windows 10. So Microsoft is also giving its blessing for Baidu “Windows 10 Express”, which is Baidu’s official Windows 10 distribution channel. And to top things off, Baidu will also provide Universal Windows Apps for Search, Cloud, Video and Maps in Windows 10. At last official count, Windows 10 had been installed on 75 million computers around the world. Within the next two to three years, Microsoft wants that figure to balloon to over one billion. Partnerships like this one with Baidu are key to making that lofty figure a reality. \rTags: \rMicrosoft, China, Bing, Baidu, Windows 10, (nasdaq:msft), microsoft edge\rVia: \rMicrosoft blog comments powered by Disqus", "source": "HotHardware.com News Rss Feed"}