{"published": "2015-09-07T22:34:11Z", "media-type": "Blog", "title": "NEVER TOO LATE", "id": "070fd7f7-c3e5-4b69-91f7-0675ecca21e8", "content": "Former New Jersey mayor, 71, pleads guilty to raping child relative when she was six for two years Former Republican Marlboro mayor Matthew V. Scannapieco, 71, admitted to detectives he began abusing the female relative when she was a child He admitted to abusing girl 50 to 60 times over two years and even after he was released from prison  Scannapieco already served 21 months in prison for taking $245,000 bribes  Chris Christie called him a 'glaring example' of corruption  Lawyer says he is 'disgusted' with himself and not the 'usual' pedophile  By Kiri Blakeley For Dailymail.com Published: 14:30, 13 August 2015 | Updated: 18:53, 13 August 2015 219 shares 69 View comments +2 Former New Jersey, 71, mayor Matthew V. Scannapieco pleaded guilty to child rape charges A former New Jersey mayor could spend the rest of his life in prison for raping a child relative. Former Republican Marlboro mayor Matthew V. Scannapieco, 71, admitted to detectives that he had sexual contact with a female child relative 50 to 60 times between 2006 and 2008, reports the Asbury Park Press. The sexual abuse began when the girl was six, reports Delaware Online. The now-teen girl told her mother in June 2014 about the abuse while she was younger. In May, he pleaded guilty to pleaded guilty to the repeated sexual abuse of a child, first-degree rape and unlawful sexual contact in the first degree. Scannapieco was the mayor of Marlboro, in Monmouth County, from 1992 to 2003. He was also an honorably discharged veteran. The abuse mostly stopped after Scannapieco went to prison for taking about $245,000 in bribes from New Jersey developers, but he reportedly admitted to 'touching' her once after his release from prison in 2010. Scannapieco's sketchy past includes collecting bribes for the then-mayor to push multiple projects through the township's planning board. Scannapieco then turned around and ratted on three developers who were being prosecuted, including Anthony Spalliero, who had admitting paying the then-mayor thousands of dollars, according to NJ.com. +2 Matthew V. Scannapieco, 71, who served as Marlboro's mayor from 1992 to 2003, pleaded guilty in May to the repeated sexual abuse of a child, first-degree rape and unlawful sexual contact in the first degree - he had already served 21 months in prison for taking bribes Republican party presidential candidate Chris Christie, who at the time was U.S. States Attorney in Newark, called Scannapieco 'one of the most glaring examples of public corruption.'  Scannapieco began his sentence in 2008 and was released in spring of 2010 -  his sentence was reduced from 15 years for cooperating with prosecutors. The ex-mayor is now awaiting sentencing in Delaware, where the crimes happened, on the rape charges. He moved there after he was released from prison in order to 'make a fresh start,' his lawyer told Delaware Online. RELATED ARTICLES Previous 1 Next NYC mayor Bill de Blasio gave unadvertised $150k job to... Three new women accuse Bill Cosby of sex assault and rape... Share this article Share But Scannapieco even reportedly touched the girl once after his release from prison, according to court documents. His public defender, T. Andrew Rosen, says that Scannapieco is 'disgusted with himself,' and that he doesn't fit the profile of the typical pedophile - he had no child porn in his home and his lawyer says there are no other victims. 'He wanted to take responsibility and not put her through anything more,' Rosen told Daily Mail Online of Scannapieco's decision to plead guilty.  His plea means he can ask for no less than 15 years in prison but prosecutors can ask for no more than 25. 'He has hopes he will get out of prison someday,' Rosen said, despite the ex-mayor's advanced age.  Rosen says it's baffling how the ex-mayor and former veteran went from high-regarded to bribe taker and admitted pedophile: 'I can't even imagine his mental state when that stuff happened.'   Scannapieco remains in custody on $238,500 bond, is scheduled for sentencing on September 4 at the New Castle Superior Court in Wilmington, according to NJ.com.  \n  Read more: Former N.J. mayor accused of rape in Delaware Former N.J. mayor admits to raping child, report says | NJ.com Former Marlboro mayor sentenced to 2 years in prison for taking bribes | NJ.com EXCLUSIVE: Ex-Marlboro mayor pleads guilty to Delaware rape charges Read more: http://www.dailymail.co.uk/news/article-3196522/Former-New-Jersey-mayor-pleads-guilty-raping-child-relative-starting-six-years-old.html#ixzz3l5wiXUyJ Follow us: @MailOnline on Twitter | DailyMail on Facebook", "source": "HOLLIE GREIG HOAX ? : NA FULL PUBLIC ENQUIRY  YEP LETS GO WITH THAT!"}