{"published": "2015-09-20T17:01:56Z", "media-type": "Blog", "title": "Grand Canyon and Phoenix with two grandbabies", "id": "7a20cb77-983c-4636-9bd2-ffd78652d86b", "content": "At some point I am going to have to have to get real and start referring to my 12 year old and almost 11 year old granddaughters Belle (Izabel) and Hana (Sahana) as young ladies but I'll leave that for when they become teenagers. For now, I am going to hold on to the clock and refer to them as grandbabies. \nRobin and I are taking our 8 year old grandbabies Sabreena and Ronin on a Caribbean cruise in August so Belle and Hana got a consolation prize of going to Phoenix with me (I am presenting a paper of quality assurance in higher education). Well, Phoenix is not really a consolation prize. We took the two of them to Alaska four years ago when they were 7 and 8 so now it's the younger ones turn. \nWe stayed at the Arizona Grand which was a pretty amazing family hotel with an onsite water park and a few pools for the kids to enjoy. Mostly though, I wanted to take them to the Grand Canyon. Oh yes, I forgot to mention that Sharm and Sunita accompanied the girls too. \nSharm decided not to go to the Canyon because we were doing this 8-9 hour round trip in one day and she doesn't like or do well with long car trips. So Sunita and I took the girls to the Canyon and then on a slight detour to Sedona to see the rock formations. I've been to both places a few years ago and it is still awe inspiring the second time. \nIt's incredible to be at the Grand Canyon and not marvel at Mother Nature. We saw the canyon from the South side and It doesn't matter where you are, the view is magnificent. I would have liked to have enough time to hike down into the canyon but there were enough signs around to indicate that some hikers have died because they were ill-prepared. It is not a spur-of-the-moment decision to do the hike so that was off the list for today. \nThen there was Sedona which is supposed to have a high concentration of vortexes. Everyone has seen a vortex at some time or another without thinking about it. Watch your toillet flush or your sink dispose of water and that's a vortex. In Sedona, a vortex is not visible in the same way as it is an energy field. I was not intuitive or sensitive enough to feel the energy but the place is breathtaking, nevertheless. \nOne of the interesting sites is the Church in the Rock - literally built in a rock. Last time I was there, I did not go into the church but this time we did. Belle wanted to say a prayer and light a candle for Nana (my Dad passed away in 2011) so it was a good enough reason to go inside. \nEnjoy the view and if you ever get a chance, go and visit. \nsandra", "source": "Sandra S - Life as I Live It"}