{"published": "2015-09-23T20:57:52Z", "media-type": "Blog", "title": "In Defense of the Pantherz: Why the Film \"The Black Pantherz: Vanguard of the Revolution\" Should be Put Down, and the book \"Black Against Empire\" Picked Up", "id": "d5b7d3ce-9c8c-4817-a8ac-c00d2236584d", "content": "by Danny Haiphong The author endorses former Panther leader Elaine Brown’s critique of the movie, However, Blacks Against Empire, the acclaimed book on the Party, meets his approval as “actual historical analysis that is useful for those seeking lessons from the lived struggle of the Panthers.” In Defense of the Panthers: Why the Film “The Black Panthers: Vanguard of the Revolution” Should be Put Down, and the book “Black Against Empire” Picked Up by Danny Haiphong “It is critical that we to study the history and politics of the Black Panther Party and derive lessons from their struggle.” The Black Panther Party is one of the most demonized organizations in US history. White supremacists, corporate media tools, and ruling class parasites of all stripes have attempted to soil its legacy since it declined along with the entire radical political movement of the mid 1970’s. The overtly racist critics have called the Black Panther Party gangsters and a Black version of the Ku Klux Klan. These are relatively simple narratives to dispel given the wealth of historical material on the politics and programs of the Black Panther Party. What is harder to address, but just as important to condemn, are the supposedly honest interpreters of the Black Panther Party who debase its history despite claims of doing the opposite. Meet Stanley Nelson’s new documentary The Black Panthers: Vanguard of the Revolution. In nearly two hours, Nelson displays a montage of interviews and video clips that effectively depict the Black Panther Party as a non-ideological, disorganized, and infantile group. There is ZERO mention of the Black Panther Party’s revolutionary, socialist orientation. No historical context is given on why or how the Black Panther party formed, or what activities and actions helped grow the organization. Eldridge Cleaver is elevated to superstar status in the film, while Huey Newton is portrayed as a gangster whose best days were spent behind prison walls. Even worse, Nelson brings on former Panther members and historians who outright smear the Party’s legacy. One historian claims in the film that the Panthers “repudiated” the armed struggle in place of their survival programs. In actuality, the Black Panther Party was disarmed by the state through the California legislature’s passage of the Mulford Act, which banned the open carry of firearms. The act was specifically created to weaken the Black Panther Party’s influence in the Black community. Survival programs thus represented a logical transition in the Party’s political work. What the film mentions only briefly is how the Panthers maintained armed self-defense when it came to raids on their offices, programs, and residences. More absurdly, the film completely erases how survival programs, which included not only the free breakfast program but also liberation schools, health clinics, and ambulatory services, were adopted under the principle of “survival pending revolution.” The Black Panther Party saw the poor Black community as a revolutionary class. Survival programs were formed as a means to relate to the struggle of poor Black Americans and at the same time give the party an opportunity to develop the revolutionary consciousness of the masses. Of course, the truth does not matter to a film maker intent on debasing the Black Panther Party. Nelson’s documentary makes so many errors that it is difficult to focus on just one. Elaine Brown’s critique of the film condenses some of the more critical offenses. For one, the film glorifies the erratic Eldridge Cleaver and demonizes Huey P. Newton. Newton was a founder of the Party and his leadership was critical to its growth. In the response to the North Richmond police murder of 22 year-old Denzell Dowell, Newton helped organize the small Oakland chapter to take up an independent investigation of the murder in conjunction with their regular police patrols. The Panthers became adored in North Richmond, as evidenced by the arms they brandished during a Panther-led rally for Dowell. The rally drew national attention and requests for Black Panther chapters elsewhere in the country began to mount. This is just one way Newton was instrumental in the organization’s success throughout its existence. “Survival programs represented a logical transition in the Party’s political work.” It should be of no surprise that a film so intent on demonizing one of most important ideological and political leaders of the Black Panther Party omitted the context that indeed made the organization the vanguard of the period. Nelson’s highlight reel not only misses the context that gave rise Black Panther Party, it contains more than one historical distortion. No mention was made of COINTELPRO’s role in fueling the split of the Oakland and New York chapters through a forged letter sent to Huey Newton informing him of a future assassination attempt on his body by the east coast branch. Bobby Hutton’s murder was chalked up to his desire to “shoot em up” when in reality it was the Oakland police, and possibly Cleaver’s misleadership, who murdered him in cold blood.  And finally, another historian makes the claim that independence movements in Vietnam, China, and Algeria were logically attracted to the Black Panthers Party’s “Anti-Americanism.” Such a racist simplification erases the heroic struggle against imperialism waged by these national liberation struggles and strips the Black Panther Party of their active and independent efforts to forge internationalist solidarity with them. Luckily for us, there is a secondary account of the Black Panther Party that paints a more accurate picture of the organization’s history and politics. Black Against Empire: A History and Politics of the Black Panther Party uses interviews with members and archived Panther newspapers to present a narrative of the Party’s rise and fall. In it, one can find entire chapters dedicated to the historical context that gave rise to the Party, as well as the conditions and efforts that led them to choose Marxist thought as their guide. Rather than tokenize Fred Hampton’s assassination as the single expression of the FBI’s desire to “prevent the rise of a Black Messiah”, Black Against Empireexplicitly shows that the US government indeed viewed the Party as a “threat to the internal security of the nation” and employed a multifaceted war against them. The authors of Black Against Empire rightfully take the war on the Panthers seriously and explore the impact the repression on the Party’s growth and fall. Repression had the effect of publicizing the Black Panther Party in a way that drew supporters of a growing anti-establishment movement that made the connection between the US government’s war in Vietnam and its war on Black America. This brought political and financial support to the Party’s survival programs. The Panther’s organizational response to repression was action. They rallied the anti-war movement at home and built relationships with the anti-imperialist struggle abroad. At their height, the Black Panther Party had chapters in dozens of countries including Algeria, Japan, and numerous European nations. But perhaps the most important contribution of Black Against Empire is its examination of the Black Panther Party’s decline. Rather than mimic Nelson’s racist attacks on Huey Newton, Black Against Empire offers an actual historical analysis that is useful for those seeking lessons from the lived struggle of the Panthers. The book concludes that a shift in social conditions withdrew public support and isolated its revolutionary approach. The Vietnam War eventually ended and so did the draft. Additionally, US imperialism renewed diplomatic relations with many of the Panther’s international allies. And a Black misleadership class was created to isolate the Black Panther Party’s politics in the Black community. Changing social conditions only exacerbated the impact of the splinters and divides created by the US government’s war on the Panthers. These developments paved a difficult terrain from which to operate, forcing most chapters to close by the latter half of the 1970. A sober analysis of the Black Panther Party is impossible without the exploration of the social conditions that fueled its growth and decline. It is even less possible to understand the true character of the Black Panther Party without knowledge of the historical context of their politics. Not only does the documentary The Black Panthers: Vanguard of the Revolutionfail to meet both requirements, but also it simultaneously forwards the same racist, anticommunist filth that has dominated narratives of the Panthers since their decline. The film concludes that the Party’s demise happened in part through Newton’s connections to the “underground scene” and “former prisoners.”  This heinous demonization of the Black Panther Party falls in line with the entire film. Rather than acknowledge that working class Black Americans and prisoners were the foundation and life of the Party, the film paints the Black Panther Party as a childish group of gangsters who merely had some interesting moments. Such a characterization could be nothing further from the truth.Black Against Empire and the numerous primary works created by former Panthers, some of whom remain political prisons to this day, provide ample evidence of the Black Panther Party’s revolutionary legacy. One can read Black Against Empire, Huey Netwon’s Autobiography, or Elaine Brown’s A Taste of Power for a critical history and analysis on the formation of the Black Panther Party. Newton’s doctoral dissertation War on the Panthers gives all the information one needs to know about the extent and significance of the US government’s war on the Black Panther Party. And these just skim the surfaces of the works available for those interested in a true education on the Black Panther Party. It is critical that we to study the history and politics of the Black Panther Party and derive lessons from their struggle. Political education is a revolutionary act. US imperialism cannot maintain its parasitic existence from sheer exploitation alone. The state, and all of its connections to the mass media, is the force from which the ruling class manages resistance to imperial rule.  This includes the physical repression levied from the police, military, and the courts as well as the psychological repression experienced through schools and media institutions. The Black Panther Party has received massive levels of both forms of repression precisely because of the threat they posed to the state and the imperialist system as a whole. But you wouldn’t know this from watching Stanley Nelson’s documentary. It is essential for those who claim to be in the movement against capitalism and white supremacy to study and learn from those who came before us. We can start by putting down Nelson’s documentary and picking up Black Against Empire and the work that inspired it. source: http://blackagendareport.com/in_defense_of_panthers", "source": "Moorbey'z Blog"}