{"published": "2015-09-29T01:17:53Z", "media-type": "News", "title": "Qatar does Gilas Pilipinas a favor by beating South Korea", "id": "237c0091-4eab-4351-b122-5dc916315d43", "content": "09:17 AM September 29th, 2015 \n\nRecommended \n\nQatar may end up giving Gilas Pilipinas a favor by beating South Korea late Monday night. Photo from Fiba.com \n\nCHANGSHA CITY, China – South Korea, a side which has given the Philippines so many heartbreaking losses in the past, may even be out of the Final Four picture for the Filipinos in the Fiba Asia Olympic Qualifying here. \n\nThis developed late on Monday night after Qatar tripped the Koreans, 69-63, to move closer towards No. 2 ranking in their merged group and put Korea in a collision course with defending champion Iran in the quarterfinals. \n\nWith still one playing day left before the knockout stages, Gilas looks to be headed into a quarterfinal showdown with Jordan, which is now being coached by former Gilas mentor Rajko Toroman of Serbia, or Lebanon. \n\nShould the current standings hold after expected victories on Tuesday by the Filipinos over India; by China over Qatar; by the Koreans over ousted Kazakhstan; Iran over Palestine and Japan over Hong Kong, the Koreans and the Iranians will be eliminating each other on Thursday. \n\nQatar, because of that win over the Koreans, could still make it as No. 2 behind the Chinese in their group even if Korea defeats the Kazakhs. Both would end up with 3-2 records but the Qataris will gain the edge because of the winner-over-the-other rule. \n\nThe Qataris will then battle Japan in the quarterfinals, with the winner the potential foe of the Filipinos in the semifinals. \n\nGilas’ epic 87-73 conquest of the Iranians on Monday has given the defending champions the tougher road to the gold medal match as Iran would have to contend with the Sokors in the quarters and then battle most possibly China in the Final Four. \n\nChina, with Yi Jianlian and the upcoming Zhuo Qi leading the way, will battle India in the quarterfinals. \n\nIndia, whose swingman Amjyot Singh is leading everyone in scoring with an average of 25.4 points, will still end up with No. 4 rank in the Gilas group even if it loses to the Filipinos on Tuesday. \n\nPalestine, the team that authored the first upset of the tournament when it downed Gilas, 75-73 on Wednesday last week, will bow out of contention even if it ends up tied with India at 2-3. \n\nIndia defeated Sani Sakakini in this round as the Palestinians have gone without a win after topping Group B play undefeated in three games. \n\nFOLLOW INQUIRER ON: \n\nDisclaimer: Comments do not represent the views of INQUIRER.net. We reserve the right to exclude comments which are inconsistent with our editorial standards. FULL DISCLAIMER \n\nTAGS: 2015 Fiba Asia, Basketball, China, Fiba Asia Championship, Gilas Pilipinas, Iran, Jordan, Lebanon, Qatar, Rajko Toroman, South Korea", "source": "Philippine Daily Inquirer"}