{"published": "2015-09-04T01:18:57Z", "media-type": "News", "title": "Now its confirmed, RSS controls Modi government", "id": "39a51390-0f59-435e-92d6-7ca3108d7289", "content": "New Delhi: Opposition Congress party has attacked the Modi government on Thursday for its meeting with the RSS.  The party said now it has been confirmed that the RSS is controlling this government and its Ministers are answerable to RSS rather than being accountable to the people of India. \n \nIn a statement, party’s in-charge-Communication Randeep Singh Surjewala said  Modi’s ministers  are  giving presentations to non elected shenanigans of a supposedly non political organization and getting appraised by the RSS for the work that they are doing is nothing but grave travesty of democracy- its mores and processes. \n \nHe said it explains why the Prime Minister has remained mum through all the scams, the slide in the economy and the rapid fall in development of the country. \n \n“What we are witnessing today is that a constitutionally elected Government is reporting to and is being held captive to the diktats of an extra constitutional, divisive and fascist organization like RSS whose greatest claim to fame is helping the colonial rulers against a nation fighting for independence”. \n \nSharply attacking , Prime Minister Narendra Modi, Congress leader said it only goes on to prove that the government of the day is neither run by the elected representatives of the people nor is it guided by the idea of welfare of the ?people. \n \n“It is run by ministers who report to and take orders from an organization- the RSS- that does not believe in India as defined by the constitution. In that sense this entire drama is a grave mockery of the constitution itself”. \n \nHe said people of this country have not voted for the RSS. The BJP clearly has neither the autonomy nor the permission to govern the country. The people of India have been taken for a ride. \n \nThe Prime Minister and his colleagues in the Government are functioning as per whims of an organization whose violent and intolerant ideology killed Mahatma Gandhi, and it is not surprising thus that this Government has, in line with its masters in the RSS, unleashed a divisive, anti people and fascist agenda on the country. \n \nHe advised the PM to realize that his reporting, appraisal and accountability lies with the people of India, people who are being continuously short changed, exploited and repressed by him and his Government. \n \nSurjewala also condemned the government for trying to subvert and dilute the essential spirit and character of the Nehru Memorial Museum and Library (NMML). \n \nDevoid of any legacy that comprises of the building of our nation, the Rashtriya Swayamsevak Sangh (RSS) & the Bharatiya Janata Party (BJP) are playing a diabolical game of rewriting and misappropriating our rich and proud heritage of struggle for Independence, he added. \n \n“Any attempts by the BJP, the RSS and Shri Narendra Modi to diminish and downplay  the legacy of Pandit Jawaharlal Nehru, the first Prime Minister of  Independent India and one of the greatest sons of the country is not going to hold water with the people of our country,” he warned. \n \n  \n \n  \n \n–Courtesy “Muslim Mirror” \n \nThe post appeared first on The Siasat Daily .", "source": "Siasat Daily"}