{"published": "2015-09-17T12:11:14Z", "media-type": "News", "title": "Men Should Understand the Emotional Effects of Menopause According to Mary Jo Rapini Co- Author of Re-Coupling: A Couple’s 4-step Guide to Greater Intimacy and Better Sex", "id": "f642dff5-2cd3-46a0-b530-792529a8ebb2", "content": "“While menopause affects women physically, it’s not the lack of sex, night sweats or fatigue that leave men feeling unloved. It’s the emotional loss of their partner.\"  \n\r Houston TX (PRWEB) \r September 17, 2015 \r \n\nMenopause is no longer just for ‘older women’ with hot flashes, irritability and night sweats.  An estimated 6,000 baby boomer women in the U.S. reach menopause every day and suffer both physical and emotional symptoms that can linger and interfere with their relationships and marriages.  Hesitant to share her new emotions with her husband, divorce sometimes ensues. \n \n“Men often wonder why she rejects him in the bedroom, why she doesn’t want to go out as much, and why she seems colder, more anxious and feels old, unattractive, overweight, tired,  overwhelmed and confused or depressed,” says  Mary Jo Rapini, a licensed psychotherapist and co-author of newly published, Re-Coupling: A Couple’s 4-step Guide to Greater Intimacy and Better Sex. “While menopause affects women physically, it’s not the lack of sex, night sweats or fatigue that leave men feeling unloved. It’s the emotional loss of their partner. He sees her as still being beautiful, witty, charming, sexy and his main confidante’. Anyone who has ever tried to tell a woman she is beautiful when she believes she is not understands how futile it is and how easily she will dismiss the comment even if it was said with sincerity.” \n \nThese 10 tips help couples cope with the change and can even draw one another closer: \n \n1.    Don’t take menopause symptoms personally.\r \n2.    Explore new ways to be intimate, the ones you traditionally used may not be comfortable anymore.\r \n3.    When she’s most irritable or angry ask her what’s going on--it most likely has nothing to do with you.\r \n4.    If there’s a problem, don’t ignore it--talk about it. \r \n5.    If she’s having hot flashes, cuddling or sleeping together might be too uncomfortable. Allow her space, but let her know you’re there.\r \n6.    Many women suffer with their loss of fertility. Be patient, listen and don’t make jokes.\r \n7.    There are no quick medical treatments available for the physical or emotional aspects as helpful as a loving, supportive partner. Hormone therapy helps, but it isn’t a magic cure, and many women cannot use it. \r \n8.    If sex is being avoided, it doesn’t mean she doesn’t love you anymore. It might be painful. Replens is a non-hormonal moisturizer that provides comfortable relief for three days and a good silicone lubricant like Wet Platinum or Replens Silky Smooth should be used just before and during sex. \r \n9.    Fifty is a tough time for men too, so be patient with one another. Mid-life is a couple’s challenge. Many men are silently suffering from erectile dysfunction. Stronvivo is a nutritional supplement that improves blood flow and erectile function by keeping blood circulating smoothly throughout the body, delivering nutrients and oxygen to the brain, muscles, organs, and skin. Natural pharmaceutical-grade ingredients including L-Arginine and L-Citrulline among others to support healthy hormone levels resulting in stronger erections for men making it a perfect companion to testosterone replacement therapy and increased sexual desire for women enhancing lubrication, arousal and orgasms while reducing vaginal pain.\r \n10.    Depression and anxiety can be part of menopause. Take it seriously and encourage her to talk to a mental health care professional if her symptoms become severe or persistent. \r \n“Couples who embrace the change in life as a temporary condition and go through it together do much better and remain much closer than those who don’t,” adds Rapini. \n  \nShare article on social media or email", "source": "PRWeb"}