{"published": "2015-09-28T16:05:19Z", "media-type": "Blog", "title": "Four Blood Moons And Nothing Happened!", "id": "01b0f13e-58f9-4744-aac2-35c00a17754c", "content": "Blog: Max Dawson \nSeptember 28, 2015 \nYou probably heard some of the amazing claims about a series of four “blood moons” and what this could mean relative to Bible prophecy. Well, number four just took place (September 27 or 28, depending on where you live) and nothing happened! That’s right. Nothing. \n \nJohn Hagee (author of “Four Blood Moons”) has been promoting a theory that God is sending signs in the skies that may precede the second coming of Jesus. Hagee says we are the last generation, and that God is sending signs to indicate that “…we’re going to see something dramatic happen in the Middle East involving Israel that will change the course of history in the Middle East and impact the whole world.” \n \nWell, four blood moons have come and gone and nothing happened. \n \nWhat is a blood moon? it is a total eclipse of the moon–a lunar eclipse, where the earth blocks the direct light of the sun from reaching the moon. The moon sits in the earth’s shadow. During a total lunar eclipse the moon appears red because indirect light from the sun passing through the earth’s atmosphere takes on a red hue and illuminates the moon. There is no blood on the moon. \n \nBlood moons are not rare at all. We get two of them every year. They often fall on Jewish holidays because of the way the Jewish calendar works. Sometimes it happens that four consecutive eclipses fall on Jewish holidays. And that’s what all the hype is about. When that happens, eclipses in the spring occur on Passover; the fall eclipses occur on the Feast of Tabernacles. That’s it. \n \nAre blood moons related to Bible prophecy. Not at all. Though that is what Hagee and others claim. Hagee says that every time four blood moons fall on Jewish holidays, something significant happens. But the historical record will not vindicate that claim. \n \nWhat about Bible passages that speak of “the moon being turned into blood”? Don’t those texts indicate something significant connected with the blood moons? No. The three texts ( Joel 2:28-32 , Acts 2:16-2 1 Revelation 6:12-13 ) have to do with judgments of God against sin. Those judgments took place long ago. \n \nThose texts were not about lunar eclipses, but were about the darkness associated with judgments of God. For more on this kind of highly dramatic figurative language, read Isaiah 13:1-10 and Ezekiel 32:1-11 . Those texts speak of God’s judgments on Babylon and Egypt. Those, too, have already taken place. \n \nA FINAL WORD \n \nFolks often ask me, “What about signs that tell us when Jesus is coming back?” \n \nSorry, there are no such signs in the Bible. Jesus said this in Matthew 24:36 … \n \n“But of that day and hour no one knows, not even the angels of heaven, nor the Son, but the Father alone.” \n \nNote that Jesus said that even He did not know. Hagee doesn’t know. John Hagee is a false teacher. You and I don’t know when Jesus will return. Just be ready. \n \n–Max \n \nFYI: My presentation on “Blood Moons” can be viewed online @ dowlenroad.com. Just type “blood moons” in the search box.", "source": "Dowlen Road Church of Christ"}