{"published": "2015-09-30T11:00:00Z", "media-type": "News", "title": "32 Advisors Spins Out & Completes Financing For Measure, The First Nationwide Commercial Drone Operator", "id": "193c8799-bdf2-4805-82d5-65ac854d62dd", "content": "WASHINGTON , Sept. 30, 2015 /PRNewswire/ -- 32 Advisors and Measure, the leading Drone as a Service® company announced today that Measure completed a significant capital raise and will become an independent entity. The company provides turnkey solutions to acquire, process, and deliver cost-effective, actionable aerial data to enterprise customers. The round was led by Hudson Bay Capital with participation from a large sovereign wealth fund. \n\n\"The opportunity for Measure to work with both the public and private sectors to utilize drones in a safe and secure way can be transformational,\" said Measure Chairman Robert Wolf . \"In its first year alone, Measure has already established itself as the market leader by launching a revolutionary way of incorporating drones into commercial and industrial operations that improves the bottom line for companies worldwide.\" \n   \nIn the past year, Measure has established itself as the pre-eminent provider of Drone as a Service® with a focus on the agriculture, energy, insurance, and infrastructure inspection industries. In early September 2015 , Measure received approval from the Federal Aviation Administration (FAA) to operate more drone platforms than any other commercial operator in the nation. Measure has partnered with leading organizations to demonstrate and quantify the return on investment for commercial drone services, including work with both the American Red Cross and the American Farm Bureau Federation. In addition, as the only drone company based in Washington, D.C. , Measure is a leading voice in the development of commercial drone regulation. \n\nThe funding will be used to expand Measure's sales, marketing, operations, and customer support functions as well as establish a new office in Houston, Texas . \"Measure doesn't make drones, we make drones work,\" said Measure CEO Brandon Torres Declet . \"The value of drones is not in the hardware, it is in the ability to provide companies with easy to use, affordable access to the data they need. We spent our early days as a startup putting into place a sustainable platform agnostic business model; now with the legal approvals in place and a significant commitment of capital from investors, Measure is in the stage of rapidly expanding commercial operations nationwide.\" \n\nAbout 32 Advisors: \n\n32 Advisors is a cross-border advisory firm operating at the nexus of business, finance, and public policy. 32 Advisors provides clients with expertise in infrastructure, project finance and economic intelligence. www.32Advisors.com   \n\nAbout Measure: \n\nMeasure is the world's leading Drone as a Service® company with Federal Aviation Administration approval to fly more than 300 different types of drones for a broad range of commercial applications. We provide turnkey solutions to acquire, process, and deliver cost-effective, actionable aerial data to enterprise customers. www.measure.aero  \n\nContact: Nayyera Haq \n(202) 793-3052 \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/32-advisors-spins-out--completes-financing-for-measure-the-first-nationwide-commercial-drone-operator-300150427.html \n\nSOURCE  Measure", "source": "Marketplace"}