{"published": "2015-09-12T09:39:30Z", "media-type": "News", "title": "D’Alberto/Denyer triumph in AGT opener", "id": "0a7a65a7-2733-430b-a698-4b8fae9f8bc2", "content": "The Maranello Motorsport Ferrari of Tony D’Alberto and Grant Denyer produced another faultless drive to win opening Australian GT Championship race of the Sandown 500 w… \r \nThe Maranello Motorsport Ferrari of Tony D’Alberto and Grant Denyer \n\nThe Maranello Motorsport Ferrari 458 of Tony D’Alberto and Grant Denyer produced another faultless drive to win the opening Australian GT Championship race of the Sandown 500 weekend. \n\nD’Alberto hassled the Trass Family Motorsport Ferrari 458, driven by Graeme Smyth, for the lead as the pair broke away from the field in the early stages. \n\nAfter rejoining the race in 11th following the mandatory pit stop, Denyer scythed his way through the field. \n\nThe Maranello Ferrari received a boost when championship leader Nathan Antunes (Audi), who inherited the lead prior to his pit stop, ran deep into the Turn 9 gravel trap on his in lap. \n\nWith the Smyth/Jono Lester Trass Ferrari and the Christopher Mies/Ryan Millier Jamec-Pem Audi pushed to the rear of the field following their longer compulsory pit stops, Denyer pushed hard to reel in the lead duo of James Koundouris (Porsche) and Morgan Haber (Erebus Mercedes SLS). \n\nSlick moves on Haber and Koundouris in quick succession saw Denyer take the lead with 11 minutes remaining where he remained until the chequered flag to score a second consecutive AGT victory. \n\nA hard charging Lester produced a stunning stint to haul the Trass Ferrari from 24th spot after the pit stops to second in the closing laps. \n\nHaber clung onto to the final place on the podium ahead of the Mies/Millier Audi R8, which managed to snatch fourth from Koundouris in the dying minutes. \n\nKlark Quinn enjoyed a solid drive to sixth in the Darrell Lea McLaren 650S ahead of the AMAC Motorsport Porsche of Andrew Macpherson and Brad Shiels. \n\nAfter his costly excursion at Turn 9, Antunes brought his Beechwood Audi R8 home in eighth, while Tony Quinn (McLaren 650S) and Steve McLau…", "source": "MyInforms"}