{"published": "2015-09-19T01:22:32Z", "media-type": "News", "title": "Insider Selling: Hanesbrands insider Sells 166,906 Shares of Stock (HBI)", "id": "da40dd58-46f7-4e28-a8a2-c84bb71ee722", "content": "Hanesbrands (NYSE:HBI) insider W Howard Upchurch, Jr. sold 166,906 shares of the business’s stock in a transaction dated Wednesday, September 16th. The shares were sold at an average price of $30.06, for a total transaction of $5,017,194.36. Following the sale, the insider now directly owns 473,844 shares of the company’s stock, valued at approximately $14,243,750.64. The sale was disclosed in a filing with the SEC, which can be accessed through this hyperlink. \n\nThe company also recently disclosed a quarterly dividend, which was paid on Wednesday, September 9th. Investors of record on Tuesday, August 18th were paid a dividend of $0.10 per share. This represents a $0.40 annualized dividend and a yield of 1.33%. The ex-dividend date was Friday, August 14th. \n\nShares of Hanesbrands (NYSE:HBI) traded down 2.85% on Friday, hitting $30.01. 4,854,368 shares of the stock traded hands. The firm’s 50 day moving average is $29.70 and its 200 day moving average is $32.20. The firm has a market capitalization of $12.08 billion and a PE ratio of 34.38. Hanesbrands has a 52 week low of $24.92 and a 52 week high of $34.80. \n\nHanesbrands (NYSE:HBI) last released its quarterly earnings data on Thursday, July 30th. The company reported $0.50 earnings per share for the quarter, hitting the consensus estimate of $0.50. The firm had revenue of $1.52 billion for the quarter, compared to the consensus estimate of $1.57 billion. On average, analysts expect that Hanesbrands will post $1.64 EPS for the current fiscal year. \n\nHBI has been the subject of several recent analyst reports. Credit Suisse reaffirmed a “buy” rating on shares of Hanesbrands in a research note on Saturday, August 1st. Zacks lowered shares of Hanesbrands from a “buy” rating to a “hold” rating in a research note on Thursday, May 21st. Goldman Sachs upgraded shares of Hanesbrands from a “neutral” rating to a “buy” rating and upped their price target for the company from $32.00 to $40.00 in a research report on Thursday. Finally, Barclays reiterated an “overweight” rating and issued a $38.00 price objective on shares of Hanesbrands in a research note on Thursday, July 2nd. Two analysts have rated the stock with a hold rating and ten have assigned a buy rating to the company. The company has an average rating of “Buy” and an average price target of $37.21. \n\nHanesbrands Inc. is a producer and marketer of clothes. The Company operates through four sections: Innerwear, Activewear, Direct to Consumer and International. The Company’s innerwear and activewear clothing brands contain Hanes, Champion, Bali, Playtex, Maidenform, JMS/Just My Size, L’eggs, Flexees, barely there, Wonderbra, Gear for Lilyette and Sports. Its international brands also include DIM, Nur Die/Nur Der, Rinbros, Zorba and Shock Absorber, among others. The Innerwear segment of the Company’s focuses on clothing products, such as intimate apparel, men’s underwear, children’s underwear and socks. It sells products, such as T-shirts and fleece to retailers and wholesalers. Its Direct to Consumer operations contain its national Company-operated Website operations and outlet stores, catalogues which sell its branded products to consumers in America. The Company’s international markets are Europe, Canada, Japan, Mexico, Brazil and Australia. \n\nReceive News & Ratings for Hanesbrands Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Hanesbrands and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News - Forex"}