{"published": "2015-09-28T08:00:00Z", "media-type": "News", "title": "Pistons' Jackson emerging as team's leader", "id": "a9f74632-228d-4cfc-a771-74917a711ac5", "content": "The house-hunting is going slowly for Reggie Jackson. \n\nJackson, the Pistons' starting point guard, is looking at several areas in close proximity to his nightly workplace - the Palace. \n\nThough Jackson's ultimate residence is still in question, he has started establishing one fact. \n\nDuring this streak of six seasons missing the playoffs, leadership has been a big question mark with the Pistons. But observers - including coach Stan Van Gundy - say Jackson has emerged as a main guy. \n\n\"He's the guy trying to pull it together,\" Van Gundy said Friday. \n\nJackson, a 25-year-old military brat, said leadership could come naturally for someone who is a good follower and listener. \n\n\"The best leaders are normally the best followers,\" Jackson said. \"I have a tendency - I want to do everything perfect. I want to know why it works, why it doesn't work and everybody's position on the floor. I like to know what's going on. \n\n\"Everybody doesn't deliver the message well, but you have to filter out and listen to the message. I think that goes a long ways. I think a lot of my leadership comes from being willing to listen and in following. If I know how to do things right, then I feel like I'm confident enough to steer you in the right direction without hindering you, questioning myself if I'm giving you good advice.\" \n\nThe Pistons acquired Jackson from the Oklahoma City Thunder at February's trade deadline. Because he was an impending restricted free agent, some observers thought the Pistons were kicking the tires, but Van Gundy insisted \"this isn't a tryout\" and the Pistons were going to sign Jackson. \n\nBut the Pistons suffered through a 10-game losing streak shortly after Jackson's arrival. And Jackson admitted struggling while trying to balance his newness to the locker room with his leadership responsibilities. \n\nBut a talk with Van Gundy settled things. \n\nJackson said Van Gundy told him to find a way to fit in first and let the guys get to know you. \n\n\"They have to trust you before they follow you,\" Jackson recalled Van Gundy saying. \n\nJackson relaxed, and he started playing well. \n\nHe excelled down the stretch and put up solid averages of 17.6 points and 9.2 assists while shooting 44 percent over 27 games. \n\nJackson - like other free agents - benefited from the NBA's exploding salary cap. He signed a five-year, $80-million deal. \n\nJackson is quick to say leadership isn't just his responsibility. \n\nCenter Andre Drummond - poised to become the highest-paid Piston ever - desperately wants to provide leadership. Rookie small forward Stanley Johnson looks as if he eventually will emerge as a strong locker-room voice. \n\n\"I probably bear a lot of the weight in terms of leadership,\" Jackson said, \"but everybody does their part, and that makes it easier. We have a locker room full of guys that are hungry to win, and we're trying to mesh all together and just make it work.\" \n\nBut as the point guard - who has the ball most often - Jackson will have primary leadership responsibility. \n\nAnd with a five-year deal in hand, Jackson is ready to take ownership. \n\n\"Not having an opt-out or anything here, it's good to know that I'm locked here for five years and someone wants me,\" Jackson said. \"Hopefully we do this thing right where we don't have a new regime or changeover and that I'm literally here for five years. \n\n\"That's a great feeling to know somebody wants you for that long. They believe in you, and I have the backing of my teammates, and I have the backing of the staff here. So I'll just put in the work and find ways to get the best results for myself and my teammates every night.\"", "source": "KansasCity.com"}