{"published": "2015-09-25T15:19:00Z", "media-type": "Blog", "title": "The Federal Reserve uses fraud to enslave the American people!", "id": "8542fac5-2ad0-47f1-9e06-835f972433f7", "content": "The Federal Reserve uses fraud to enslave the American people! http://anticorruptionsociety.com/2015/09/24/the-federal-reserve-uses-fraud-to-enslave-the-american-people/#more-10318 AS EXPLAINED BY ATTORNEY MELVIN STAMPER IN HIS BRILLIANT BOOK, FRUIT FROM A POISONOUS TREE Excerpts from the book, pages 58-60: Edward M. House Col. Edward Mandell House, who was the agent provocateur of Rothschild, the head of the European Central Banks, was assigned to oversee the President and the Congress in the implementation of the central bankers’ plans. House is attributed with giving direction and strategy to be implemented by the president and the senators to enslave the American people with the passage of the Federal Reserve Act and Amendments 16 and 17. Support for the legal presumption that the American people had volunteered to participate in the United States democracy was legislated with the 17th Amendment in 1913 in that participation in federal elections for U.S. Senator established the legal presumption necessary in determining that you were a federal citizen. [The American BAR Association] The scheme also provided for the control of the courts via the 1913 creation of the American Bar Association [1], whose parent organization was the European International Bar Association, which was the creation of Rothschild. This allowed the International Bankers to control the practice of law, in that the only ones permitted to practice before the courts were those who were educated under their brand of law, which was only Admiralty and Contract law. Common law of the people was to be replaced as it gave the natural man many jurisdictional protections from the bankers’ legislation. When the Congress made its first attempt to throw out the common law and replace it with Admiralty law, the Supreme Court rejected the proposed rules of court, explaining that the proposed rules would bring into existence a national police state. So, Roosevelt stacked the high Court and waited for a case upon which the demise of the common law could be accomplished. Erie v. Tompkins came along in 1938 [2] and gave the court the opportunity that the Constitution did not. Thereafter, Common law at the federal level was to be no more. The 1920s were an eat, drink and be merry time, with the majority of the population living the good life with no care in the world and no attention to what was happening in Congress. The stock market crashed, and those not on the inside were not warned to take their money out of the market and, as a result, lost everything. This set the stage for socialism and Roosevelt’s New Deal. It was a new deal, all right – a one-sided deal, as you are about to learn. [The Birth of the STRAWMAN] Contract law is above the Constitution and under the jurisdiction of Equity/Admiralty courts, so the governments began to contract with everyone. The 1930s saw federal legislation providing for the registration of babies through applications for birth certificates. Government workers could get maternity leave with pay. The States pushed for registration of cars through applications for certificates of title and for registration of land through registration of deeds of trust. Constructive trusts were created secretly by adhesion contracts, giving benefits either present or future and as a result, each of the people blindly walked into the trap of United States democracy and its jurisdiction by the signing of contracts, thereby agreeing to be sureties for the debts of the United States and collateral for the Federal Reserve Bank, Inc. [3] The Great Depression supplied the diversion needed to keep the people’s attention away from what the government was doing. The Social Security program was implemented, along with numerous other socialistic “New Deal” programs that invited the American people to volunteer to be the sureties behind the United States’ new registered property and adhesion contracts through the legal presumption that they were 14th Amendment United States subjects. [4] We are permitted to contract with anyone, even the government, so for the promise of benefits from the federal government, we traded away our unalienable rights and put on a mask of the subject [juristic] person. Massive registration of property through United States agencies, including the States of the Union as instrumentalities of the federal government in bankruptcy, assured the United States and its officers and instrumentalities (the states) that they would become wealthy beyond their wildest expectations, as predicted by Colonel House. Edward Mandell House had this to say in a private meeting with Woodrow Wilson (President, 1913-1921) From the private papers of Woodrow Wilson:\n“[Very] soon, every American will be required to register their biological property in a National system designed to keep track of the people and that will operate under the ancient system of pledging. By such methodology, we can compel people to submit to our agenda, which will affect our security as a charge back for our fiat paper currency. Every American will be forced to register or suffer not being able to work and earn a living. They will be our Chattel and we will hold the security interest over them forever, by operation of the law merchant under the scheme of secured transactions. Americans, by unknowingly or unwittingly delivering the bills of lading [5] to us will be rendered bankrupt and insolvent, forever to remain economic slaves through taxation, secured by their pledges. They will be stripped of their rights and given a commercial value designed to make us a profit and they will be none the wiser, for not one man in a million could ever figure our plans and, if by accident one or two would figure it out, we have in our arsenal plausible deniability. After all, this is the only logical way to fund government, by floating liens and debt to the registrants in the form of benefits and privileges. This will inevitably reap to us huge profits beyond our wildest expectations and leave every American a contributor to this fraud which we will call “Social Insurance.” [6] Without realizing it, every American will insure us for any loss we may incur and in this manner every American will unknowingly be our servant, however begrudgingly. The people will become helpless and without any hope for their redemption and, we will employ the high office of the President of our dummy corporation [7] to foment this plot against America.” All of this was done without disclosure of the material facts that accompanied each application for contract registration. That fraud would have been sufficient reason to charge all the United States officers and elected officials with treason, unless a legal remedy could be legislated for the people to recoup their property and collect for the damages they suffered as a result of the fraud if ever discovered. [Hidden ‘Legal Remedy’] If a legal remedy was available, and the people chose not to or failed to secure their remedy, no charge of fraud could be brought, even to a common law court. The United States Congress needed only to provide the legal remedy. It was not required to explain it or even tell the people where the remedy could be found; if they did that then the entire conspiracy would be revealed and every cherry tree in Washington would be decorated with hanging bodies of Congressmen and bankers. The attorneys did not even have to be taught about the remedy in law school. Remaining quiet, Congress had plausible deniability if the people discovered the deception. The majority of the legislators did not have to have the intricate details of the law explained to them regarding the bills they were passing; the pressure was on by the leadership to pass this legislation, and that was all they needed to know. If the people failed to exercise due diligence, the United States became the holder in trust of all the land and labor of every subject in the American Empire. If, however, the people did discover their legal remedy, the United States would have to honor it and release the registered property back to the people, but only if the people were cognizant that they had a remedy, and only if they exercised it in the proper technical manner. It was a great plan, and it has worked for over 70 years. Having established plausible deniability, even if the people became enlightened that they had a remedy and pursued it, the attorneys, judges, and legislators could claim that they did not understand the people’s claims, especially if the technical requirements for achieving it were not followed pursuant to the statutory requirements. Requiring the public schools to teach civics, government, and history classes out of federally-approved politically correct textbooks written by the publishing houses owned by the owners of the Federal Reserve would assure that the people would not discover the remedy for a long time, if ever. NOTE: Fruit from a Poisonous Tree is available at Amazon and Barnes and Noble. Here is a link to Chapter Two – Magicians (31 pages) that contains these excerpts. [1] See: The Legal Craft (The BAR Card) [2] See Who’s Running America; Barefoot’s World.com [3] “The U.S. citizen (tenant, franchisee) was registered as a ‘beneficiary’ of the trust via his/her birth certificate. In 1933, the federal United States hypothecated all of the present and future properties, assets and labor of their ‘subjects,’ the 14th  Amendment U.S. citizen, to the Federal Reserve System.”  See:Congressional Record, March 17, 1993 [4] See: The Great American Adventure by Judge Dale, retired [5] The “bills of lading” refer to the documents presented to the harbor master when goods are delivered – i.e. the “Certificate of Live Birth” signed by the Mother after she delivers her baby, as demanded by the hospital or mid-wife. [6] Social Security [7] See: United States Corporation Of Importance In August 1999, President Bill Clinton signed Executive Order 13132, Federalism, which states in Section 2 (d): The people of the States are free, subject only to restrictions in the Constitution itself or in constitutionally authorized Acts of Congress, to define the moral, political, and legal character of their lives. This Executive Order pointed to the American people’s remedies. If they refuse to vote in the “Federal Elections”, declare their legal character as a flesh and blood living man or woman (versus a “juristic person”), and sign all documents “without prejudice UCC 1-308” restricting their assent; then they can challenge statutory (Admiralty) rules/statutes being falsely portrayed as laws. Suggestions for doing this can be found in LAWFULLY YOURS – The People’s Empowerment Guide to our Corporate-commercial Legal System. Related: Treason – A Notice to Public Servants Is your dead legal-fiction STRAWMAN still enslaving you? Federalism, “personage” and freedom   This entry was posted on Friday, September 25th, 2015 at 11:19 AM and is filed under World Politics.\tYou can follow any responses to this entry through the RSS 2.0 feed. Both comments and pings are currently closed. Post navigation « Previous Post", "source": "A NATION BEGUILED"}