{"published": "2015-09-03T14:07:37Z", "media-type": "News", "title": "New CDC Report: Most Americans' hearts are older than their age", "id": "bbaea22d-1b5c-49a0-9e3f-5437ed3e5662", "content": "PRWeb \nYour heart may be older than you are - and that's not good. According to a new CDC Vital Signs report, 3 out of 4 U.S. adults have a predicted heart age that is older than their actual age. This means they are at higher risk for heart attacks and stroke. \n\n\"Heart age\" is the calculated age of a person's cardiovascular system based on his or her risk factor profile. The risks include high blood pressure, cigarette smoking, diabetes status, and body mass index as an indicator for obesity. \n   \nThis is the first study to provide population-level estimates of heart age and to highlight disparities in heart age nationwide. The report shows that heart age varies by race/ethnicity, gender, region, and other sociodemographic characteristics \n\nCDC researchers used risk factor data collected from every U.S. state and information from the Framingham Heart Study to determine that nearly 69 million adults between the ages of 30 and 74 have a heart age older than their actual age. That's about the number of people living in the 130 largest U.S. cities combined. \n\n\"Too many U.S. adults have a heart age years older than their real age, increasing their risk of heart disease and stroke,\" said CDC Director Tom Frieden, M.D., M.P.H.  \"Everybody deserves to be young - or at least not old - at heart.\" \n\nKey findings in the report include: \n\nOverall, the average heart age for adult men is 8 years older than their chronological age, compared to 5 years older for women. Although heart age exceeds chronological age for all race/ethnic groups, it is highest among African-American men and women (average of 11 years older for both). Among both U.S. men and women, excess heart age increases with age and decreases with greater education and household income. There are geographic differences in average heart age across states. Adults in the Southern U.S. typically have higher heart ages. For example, Mississippi, West Virginia, Kentucky, Louisiana, and Alabama have the highest percentage of adults with a heart age 5 years or more over their actual age, while Utah, Colorado, California, Hawaii, and Massachusetts have the lowest percentage. \nFor more information, visit http://www.cdc.gov/heartdisease and http://www.cdc.gov/stroke . Visit millionhearts.hhs.gov to learn about Million Hearts, a national initiative to prevent 1 million heart attacks and strokes by 2017. \n\nVital Signs is a report that appears on the first Tuesday of the month as part of the CDC journal, Morbidity and Mortality Weekly Report. The report provides the latest data and information on key health indicators. These are cancer prevention, obesity, tobacco use, motor vehicle passenger safety, prescription drug overdose, HIV/AIDS, alcohol use, health care-associated infections, cardiovascular health, teen pregnancy, food safety, and viral hepatitis. \n\nRead the full story at http://www.prweb.com/releases/2015/08/prweb12916089.htm \nPRWeb.com", "source": "Bradenton Herald"}