{"published": "2015-09-09T07:12:28Z", "media-type": "News", "title": "DUP puts ‘ultimatum’ to Villiers amid crisis", "id": "8d798538-d285-40a0-a445-729c0a633305", "content": "While details have not yet emerged, it makes the ongoing situation at Stormont ever more serious. \n \nThree senior republicans were arrested on Wednesday morning in connection with the murder of Kevin McGuigan. \n \nMr Robinson tweeted that his party will again seek the adjournment of the Assembly, after his previous bid to do failed. \n \n“These events were predicted in my statement on Monday,” the DUP leader said. \n \n“No one can be above the law. That is why we sought adjournment of the Assembly. We will do so again. Hopefully the UUP will support us this time rather than voting with SF for business as usual.” \n \nCrisis talks are due to resume at Stormont later without the Ulster Unionists, who walked out during Wednesday evening’s meeting. \n \nUUP leader Mike Nesbitt said his party would not discuss the Stormont House Agreement, which tackled legacy issues, until paramilitarism had been resolved. \n \n\"This is the issue and the only issue that we will speak on,” he said. \n \nThe DUP accused Mr Nesbitt of “hokey cokey politics”, while Sinn Féin claimed his “stunt politics” are part of an electoral battle within unionism. \n \nThe UUP has withdrawn its one minister from the Executive and his replacement will be announced on 21 September. \n \nThe power-sharing Executive has been under threat of collapse since police said IRA members were involved in the murder of Kevin McGuigan in east Belfast last month. \n \nThe killings have overshadowed wider issues at Stormont, where divisions over the implementation of controversial welfare reforms have already plunged the devolved Assembly into financial peril. \n \nGoing into the talks, Sinn Féin, which rejects the PSNI's assessment about the PIRA, said the party is keen to resolve all the issues at the heart of the crisis as part of the latest talks process. \n \nSecretary of State Theresa Villiers, who was hosting the talks with Irish Foreign Affairs Minister Charlie Flanagan, said the tone of the opening meeting was “genuinely constructive”.", "source": "UTV"}