{"published": "2015-09-16T16:09:27Z", "media-type": "Blog", "title": "'Unhinging' a Government Culture Resistant to Change", "id": "5d6d2707-034b-4c2d-9816-dc4ee1b49ad9", "content": "'Unhinging' a Government Culture Resistant to Change Lightspring/Shutterstock.com By Camille Tuutti 12:09 PM ET NEXTGOV\nNEWSLETTER SUBSCRIBE related stories Can Social Media Tracking Make Medication Safer? How 3-D Printing Could Make Criminals Harder to Catch The Small Government Office That's Funding the Next Big Idea Innovation in Federal IT? Sorry, Not in the Budget This Year Share this on Facebook Tweet this on Twitter Share this on Google Plus Share this on LinkedIn Print this article Email this article Increase size Despite agencies' willingness to adopt emerging technologies, changing the entrenched culture of many agencies remains more difficult. As new political appointees come in, they often meet resistance to their ideas from federal government lifers, some new recruits say. \r“There’s this what I call scar tissue between that level and the actual bureaucracy,” said Greg Godbout, chief technology officer at the Environmental Protection Agency, during a Sept. 15 AFCEA Bethesda panel discussion about emerging technologies. “And you can imagine if you work within that bureaucracy for decades, yes, someone is always going to come in with some new thing, a change, and you build up an immunity to new ideas.”\rFor years, the government has not changed its methodologies to take advantage of new technologies, so even as new tech comes in, the processes to work around them remain the same, Godbout said.\rThe key to the future is not recreating legacy systems, he said, but creating an ecosystem “so we’re no longer ever building legacy systems.”\r“You have to build culture first and that’s really the difficult part in government,” Godbout added. \"You’ve got to sort of tear up that scar … and say, ‘We need you to be open to learning and changing yourself and build on that internally and continuously.”\rTo “unhinge” that culture, Godbout said, “we have to accept risks and really embrace the small failures that we can learn from.”\rChange to that risk averse environment starts at the top, said Rafael Diaz, chief information officer at the Department of Housing and Urban Development. Leaders have to help guide their staff “through change and uncertainty, and guide them through what they don’t understand,” he added.\r“Someone has to say, “This is where we’re going, this is why we’re going there and this is how we’re going to get there,’” Diaz said. “And if you don’t have that laid out for somebody who doesn't understand, they’re going to want to keep doing what they’ve been doing.”\rDavid Bray, CIO at the Federal Communications Commission, objected to the scar tissue analogy. He said the federal government is populated by people eager to transform the government. Many are “hungry and desperate” for a change, but they haven’t been empowered to make real changes, he added.\rGodbout said the status quo doesn’t occur just because of lack of empowerment. That “angst of change” is “very difficult” and something he said he sees often at his own agency. As the federal government doesn’t have a profit motive like commercial entities, “ultimately, your job is to deliver,\" he said. In that type of environment, it’s hard to discern what’s positive change or just part of someone’s legacy, he added.\rBut what does disrupt the status quo is someone willing to take risks -- and all the blame when something goes wrong. Bray calls that role “the human flack jacket.\" Godbout agreed, saying that mindset is key to transformation.\r“There needs to be leadership in that organization that is willing to take the blame, that is willing to say, “It’s on me. Don’t worry; I told you to do this. I’ll take the risk,’” Godbout said. “And I think that element -- ‘I’ll take the risk’ -- is part of every moving-forward experience I’ve experienced in government.”\r(Image via Lightspring/ Shutterstock.com)\rrecommended for you Threatwatch Alert Thousands of cyber attacks occur each day See the latest threats ADD A COMMENT Step Inside the Digital Agency Enable Workforce Collaboration Sign Up for Government Rewritten Raise Your Agency's Energy I.Q. sponsored Get Smart. Get The D Brief. Subscribe to Defense One's new national security newsletter. JOIN THE DISCUSSION By using this service you agree not to post material that is obscene, harassing, defamatory, or otherwise objectionable. Although Nextgov does not monitor comments posted to this site (and has no obligation to), it reserves the right to delete, edit, or move any material that it deems to be in violation of this rule.", "source": "Nextgov - All Content"}