{"published": "2015-09-16T17:13:43Z", "media-type": "News", "title": "Electric Microgrids Could Shore Up Cities for Future Disasters", "id": "553a5982-338c-4506-9e11-44844204155b", "content": "New York has seen the lights go out in spectacular ways in recent years. \n \nAlmost the entire state went dark during the Great Northeast Blackout of 2003, and power outages sporadically shut down the 911 emergency services system. \n \nIn 2008, more than 1.7 million upstate residents were plunged into darkness after a major ice storm split trees and crumbled the grid. And in 2012, Hurricane Sandy damaged power plants and equipment, shutting the power to millions of residents for days. \n \nThese events - and the certainty of more in the future - have given the state plenty of reasons to look for new ways to prevent power loss in emergencies. \n \nIn the search for solutions, though, a major problem keeps popping up. The standard model for a region’s electric grid is built around one or a few large plants producing electricity and shipping it often long distances on transmission lines to customers. \n \nIf the plant or the line goes down, so does the grid. For authorities trying to overcome this structural issue, one idea is getting a serious look. \n \nIt’s called a microgrid , and officials from Potsdam to Brooklyn are betting that the concept will keep the lights on the next time an unwelcome visitor threatens the flow of electricity to hospitals and other vital facilities. \n \n“Much of New York’s effort is predicated on resiliency,” says Lavelle Freeman, the manager of distribution, planning and engineering for GE’s Energy Consulting business. “Sandy is just the most recent example that has people asking: what you do to prevent the grid from collapsing for an extended period of time?” \n \nAt its heart, a microgrid is a standalone power system embedded within a region’s grid that can operate independently when a power outage starts. During a disruption, a microgrid acts as a powered island that keeps critical infrastructure like fire and gas stations, clinics and telecommunications systems running.", "source": "Product Design and Development"}