{"published": "2015-09-06T19:00:04Z", "media-type": "News", "title": "Campaigns crank up after Labour Day", "id": "7fd5d35e-4cc5-4ee7-a08d-652a94cbf384", "content": "OTTAWA — That's it, there's no more escaping it —  the holidays are over, the kids are in school, and there's a federal candidate in your riding to settle on before Oct. 19.\r \n \n\r\n                            There might have been a low-key start to this election campaign, triggered by Stephen Harper on the long weekend in August. But Labour Day brings a more official feeling to the campaign — and some harder edges.\r \n \n\r\n                            All three parties will now have their official planes in their air, and the pace of events will pick up. The people who staff the various war rooms, devising communications strategies and monitoring what their opponents say or do, will find themselves working longer hours.\r \n \n\r\n                            More journalists will join the campaigns, with some news media outlets having saved scarce resources for the latter part.\r \n \n\r\n                            And get ready for a tidal wave of campaign ads. The longer campaign has meant that parties get a proportionately larger spending limit, which they can hoard and spend for the moments they want.\r \n \n\r\n                            \"We will see the power of money and I believe it will make a difference in this election campaign; millions will get spent on political advertising,\" said Scott Reid, a former senior aide to Liberal prime minister Paul Martin.\r \n \n\r\n                            \"It's going to be really interesting to see what kind of impact that has, if it feels like there's a slow leak to the Conservatives. Can they halt that general trajectory with the power of millions of dollars in paid media towards the end of September, in October?\"\r \n \n\r\n                            The long weekend might also be a chance for the parties to evaluate the past five weeks, and make tactical adjustments.\r \n \n\r\n                            The Conservatives have been bumped significantly off of their message twice in the first stretch of the campaign. First, the trial of Sen. Mike Duffy forced Harper to answer questions on ethics and honesty over several days.\r \n \n\r\n                            Then last week, the Syrian refugee crisis again put the Conservatives on the back foot, trying to explain the slow pace of accepting applicants fleeing violence. Harper devoted an entire event to addressing the issue, postponing a campaign announcement to fund public transit.\r \n \n\r\n                            Lisa Samson, a Conservative activist and Ottawa consultant, says she doesn't think the party will be retooling their message of good economic stewardship in any significant way.\r \n \n\r\n                            \"August did count in terms of people paying attention. I think people maybe had half an ear towards what was going on in the campaign, but I think impressions are already starting to be made,\" said Samson, managing partner of StrategyCorp.\r \n \n\r\n                            \"Where I see things happening right now, barring any unforeseen circumstances, I think the election is going to turn on questions of the economy. So, who can provide the best economic management for Canada during a time of global uncertainty.\"\r \n \n\r\n                            Liberal Leader Justin Trudeau came out of an early August leaders' debate with good marks. Still, he was ridiculed for saying last month that the Liberal plan was to \"grow the economy from the heart outwards,\" a clumsily worded phrase meant to convey a focus on the middle class.\r \n \n\r\n                            His economic plan to build growth by investing in infrastructure, while running deficits for a number of years, was designed to set the party sharply apart from its rivals — but is also a major gamble.  \r \n \n\r\n                            For the NDP, the challenge is to continue building momentum.\r \n \n\r\n                            Mulcair hasn't had any major stumbles. His challenges are more deeply imbedded. He still needs to convince the Canadian public that the New Democrats can properly govern the country, and that he is a competent, trustworthy potential PM.\r \n \n\r\n                            Former NDP aide Robin MacLachlan says that Mulcair's campaign to both build the case for change and strengthen the leader's credibility among Canadians began as far back as January.\r \n \n\r\n                            \"The strategy continues, but in this next phase it's about demonstrating the path to victory for the NDP, and in doing so they reinforce the message that the NDP wants to take hold of the voters, that only the NDP can defeat Stephen Harper,\" said MacLachlan, an Ottawa public affairs executive.\r \n \n\r\n                            Still, if there will be any coalescing of anti-Conservative vote behind either Trudeau or Mulcair, it might not happen until the next long weekend — Thanksgiving.\r \n \n\r\n                            Former interim Liberal leader and ex-Ontario premier Bob Rae predicts families will be together then, discussing how they will cast their ballot.\r \n \n\r\n                            \"I mean I look at the numbers and everybody's a contender right now. It would be very unwise to say that the result is determined,\" said Rae.\r \n \n\r\n                            \"For one thing, a lot of people are still undecided … and the other unpredictable thing is events. Things happen.\"\r \n \n\r\n                            —With files from Joan Bryden.\r \n \n\r\n                            By Jennifer Ditchburn, The Canadian Press", "source": "Northumberland News"}