{"published": "2015-09-02T20:58:58Z", "media-type": "News", "title": "Embrace change to make a change", "id": "458c2f76-9a8a-464b-9eca-1bd42fa15f75", "content": "Later this month, you're going to notice a change when it comes to garbage collection in your neighbourhood. Starting the week of Sept. 21, the city-contracted company that handles its composting, recycling and waste collection will only collect garbage every other week. \n \nWhile blue-box, green-bin and yard waste will continue to be collected weekly, some will lament the change to every-other-week waste collection is a decrease in service and scratch their heads at the logic; after all, the municipality is only expecting to save about $44,000 as a result of the move. \n \nBut this is not about savings or service. The indisputable reality is -- despite many years of ongoing, concerted efforts to educate the public about the merits of recycling and composting -- an estimated 50% of the contents of each garbage bag collected should have been deposited in a recycling box or a green bin. Half of all garbage that ends up in the landfill should have been diverted elsewhere. \n \n\"We are trying to ensure materials that are recyclable or compostable do not get buried in the city's landfill,\" said Greg Preston, the city's manager of waste management. \"These are resources that can be recovered and made into new products, such as compost. Collecting garbage every other week is meant to get us to think about how we can reduce the waste we throw away and to think about what we can put in the weekly recycling and green-bin collection programs.\" \n \nThe other compelling factor in the decision is the finite life of our -- and all -- landfills. \"As landfills across Ontario fill and new ones become harder to set up, municipalities are having to look at ways we can prolong the life of our existing landfills,\" said Preston. \n \nSo, unless you want a landfill in your backyard, it's time to step up your recycling efforts. If the city's data is correct, and there is no reason to doubt it, it should be easy for most residents to change their ways and, without much trouble, be able to reduce the amount of garbage they put out to the curb. \n \nA big part of the equation is education. Many people still are uncertain what can go in the blue box or what can be put in the green bin. It's not rocket science, but the city distributed, via last week's Packet & Times, a comprehensive, easy-to-read solid-waste-collection guide that includes useful information, helpful tips and a year-long calendar that should avoid confusion as to when garbage is collected. You can also find tips and details at orillia.ca/recyclingtips . If you don't have Internet access, you can call the waste-diversion site at 705-325-3522. \n \nOrillia, like other municipalities, has long known many people require incentives to do the right thing; it's why they moved to a garbage-tag system several years ago. Over time, slowly, the allotted number of \"free\" tags has dwindled. Today, each residence annually receives 30 \"free'\" tags. If more are required, residents have to pay for them -- that has helped people buy into recycling and composting efforts. But with every garbage bag half-full of recyclable and compostable waste, it's evident the message is not getting through to some. A move to every-other-week waste collection is another way to encourage people to be diligent and to properly sort their trash. If they do so, putting garbage out to the road every other week shouldn't be much of a challenge. And, frankly, it's the least we can do to help extend the life of our landfill and do our little part to be environmentally conscious. \n \ndavid.dawson@sunmedia.ca   \n \nSubmit your letter to the editor", "source": "Packet & Times"}