{"published": "2015-09-15T07:00:59Z", "media-type": "News", "title": "Corporate Compliance: Two Ways to Manage the Risk of Third-Party Vendors", "id": "c309445f-f4d7-4f86-8f59-2d7d21f0924e", "content": "“ Not invented here ” is never a very nice attitude to come across in business. The idea that something is better just because it has been worked on and tweaked by a company’s own staff is at best arrogant and, at worst, means the company will miss countless opportunities to produce better products or do so more cost effectively. \n \nBringing in third-party vendors – anything from a single contractor to a team from a big multinational – will bring fresh ideas and often fresh impetus to a project. But there is also risk involved too. \n \nCorporate compliance teams – whose job it is to ensure the business is managing that risk – are typically bought into help evaluate of third-party vendors after they’ve been selected. It’s much better for all concerned if the compliance teams is in on the process from the beginning. \n \nAs the global compliance counsel at a global manufacturer in CEB’s compliance membership recently said, “If you’re only getting involved at the last step, when the business has already decided to bring on a third party, you’re managing the process but you’re not managing the risk” (see chart 1). \n \n\n \nChart 1: Ability to control risk decreases throughout the procurement process   Risk variability among prospective third parties, illustrative  Source: CEB analysis \n \nThat’s why the compliance team takes a role early on in the procurement process. Compliance can exert greater influence when there are more third party options to consider and has a better chance to proactively affect the level of risk the business is willing to accept. \n Two Ways Compliance Can Help with Choosing the Right Third-Party Vendor  \nThis approach has helped line managers at the large manufacturer select third parties with the best risk-reward tradeoffs and also help shape demand for compliance services. It has two main components. \n   \nHelp business partners question their assumptions : First, the compliance team challenges ingrained assumptions that line managers may have about who might be the best external candidates for a particular project (see chart 2). \n \n\n \nChart 2: Assumptions line managers make about using third-party vendors  Source: CEB analysis \n \nThe compliance team doesn’t add any layers of bureaucracy; it simply asks these questions at its regular meetings with regional business partners. This helps the compliance team gather intelligence about the potential third party relationships required to achieve a given business goal while there is still an opportunity to meaningfully alter the level of risk associated with a project. \n   \nMake compliance costs transparent : Second, the compliance team prices out the amount of compliance-related costs associated with a particular third party. While most compliance teams assume that line managers won’t care about this kind of information, providing a more accurate cost-benefit analysis that includes compliance costs will show the value of the expertise that the compliance team can provide. \n \nOnce business partners see this, they will become increasingly receptive to any perspectives from the compliance team in future discussions (see chart 3). \n \n\n \nChart 3: Adding the compliance-related costs of using third parties  Source: CEB analysis \n   \nThis two-pronged approach helps line managers select the third-party vendors with the right level of risk and reward, while ensuring their work will support the firm’s business goals. \n \n  \n  More On…    \nLearn more about how risk and compliance teams can help align managers’ decisions with their firm’s risk appetite (pdf). \n    \n ", "source": "Corporate Executive Board"}