{"published": "2015-09-22T14:29:02Z", "media-type": "News", "title": "CEI Reveals Five Goals to Improve the Developing World", "id": "ccfc9089-442c-4e4c-9e73-6dba06e96c2e", "content": "What are the best ways to help developing countries in the years ahead? According to “Real Goals to Improve the Developing World,” a paper by Iain Murray of the Competitive Enterprise Institute (CEI) released today, true help for developing countries is about building resiliency. Contrary to the United Nation’s Agenda for Sustainable Development, CEI outlines five proven ways to reduce the impact of extreme events such as weather or disease on the poorest in the world by delivering real prosperity. \n\n“Developing countries should adopt certain strategies that are proven to work to deliver a healthier, greener, more prosperous planet – strategies that also improve the resiliency of communities to whatever nature throws at them,” said Iain Murray, vice president for strategy at CEI. \n\nThe Five Goals for a Resilient Planet are: \n\nSecure Property Rights \n\nSecure the Rule of Law/Ending corruption \n\nEnsure Access to Affordable Energy \n\nEnsure Access to Capital and Credit \n\nAllow Markets in Education \n\n“Real Goals to Improve the Developing World” explains how Hong Kong and Singapore have already been successful in implementing these values to create strong communities. Small states such as Botswana, Honduras, and Ghana are examples of the next locations in the world where these five goals would be fertile ground for moving toward resiliency. \n\nMurray continued, “Taken together, these coherent principles will allow for a much stronger, prosperous, more resilient planet than the bundle of often contradictory targets advanced by the UN and other sustainability advocates. An agenda that empowers people rather than bureaucrats, building a resilient and in that sense truly healthy society, is the best way to achieve human health and flourishing.” \n\nTo read click here. For more background on Iain Murray, click here. ", "source": "Before It's News"}