{"published": "2015-09-22T21:33:57Z", "media-type": "News", "title": "We do well to cherish and protect all life", "id": "8692c4fb-871d-4c7d-b5ba-bdbe7976d4e3", "content": "Editor’s note: “Matters of faith” is a column that provides local religious leaders a place to write about how their respective faiths provide hope, courage and strength in these modern times. \n \nA few weeks ago on KUER’s “Radio West,” the host interviewed a woman who defended Planned Parenthood, a woman’s right to choose to end her pregnancy, and the general arguments that continue to be debated on this perennial topic. \n \nWhen people debate abortion, it seems that there is a prepared script — the same things are said over and over. \n \nThere seems to be three main arguments. The first: One cannot be forced to do something they don’t want to do; therefore, a woman may terminate her pregnancy according to her sole discretion. Otherwise, she is not free and would be oppressed by government, church, family, or medical authorities. Fundamentally, it is not an argument for privacy but an argument for freedom. \n \nThe second argument has to do with whether the fetus is a human person or not. The developing child is either a grouping of cells, pieces of tissue, or in some way at a developing stage that makes it not quite a person yet. \n \nAdditionally, it is often argued that the developing creature does not feel anything. A medical procedure that destroys the being does not cause it pain, but could be compared to having one’s appendix removed. If one has an appendectomy, one doesn’t fret about the state of the organ after it is removed. \n \nThe third argument has to do with a woman’s health. If one chooses to have an abortion, there must be a trained physician in a sterile hospital or clinic to provide the service. If this is not available, then women may find other means to end their pregnancy, which could be life-threatening to them. \n \nOne cannot debate the first and third arguments in the sense the person is thinking in an erroneous manner. The person chooses to be free of the pregnancy. It is a statement, not an argument. It is a fundamental value that person holds. \n \nThe third argument is also true. If one has the procedure done by an untrained person in an unsanitary setting, that woman is putting her life on the line. \n \nThe second argument can be debated and it has largely to do with religious beliefs and personal philosophy. What do we call a human being? When does the spirt/soul/whatever you want to call it, come into the blastocyst, embryo, fetus or infant? When do we call it a baby, a child, a pumpkin, a person, or as my grandmother called me, a peanut? \n \nThe law states some definite things, such as the child is protected as a person with rights only after it leaves the mother’s body or the birth canal. For example, if a couple, by their negligence, allows their baby to die, they could be charged with manslaughter. \n \nRoe v. Wade states that a woman may only have an abortion until the developing child in her reaches viability, or when it is able to survive outside of the mother’s body. At the time of Roe v. Wade, viability was about 6 months, so the woman could terminate her pregnancy until the end of the second trimester. \n \nIt should also be noted the period may be extended if a doctor deems the mother’s life is in danger. Now, this is where the law is unclear. This has been interpreted not in a strict sense that the woman’s life is in danger, but may include negatively impacting the woman in any manner. Therefore, one may have an abortion up until the baby is delivered. One more thing to consider is that the point of viability is becoming earlier and earlier due to medical technology. \n \nThe Catholic Church, and those who are pro-life, believe that life begins at conception. The spirit/soul/life force enters some time shortly after the sperm enters the egg and the cells start to divide. We also state that life begins before the embryo implants itself into the endometrium, or lining of the uterine wall. Since life begins at conception, we would view as immoral the practice of in vitro fertilization. Many eggs are fertilized in a petri dish in order to increase the chance of one of them implanting into the uterus. Excess embryos are destroyed, frozen, or used for experimentation. \n \nWe state that personhood is granted at the moment of conception, since it is no longer part of the woman’s body. It has its own unique genetic sequence that makes it not an additional part of the woman, but a separate being that is growing and developing inside of her. \n \nLike those who are pro-abortion, we hold these points as facts based upon our belief system regarding when life begins. It is a mixture of scientific data with a belief system that is influenced by religious faith and our understanding of what it is to be a human being. \n \nGoing back to the first argument for abortion remaining safe and legal, in my experience only those who are arguing for this right based on intellectual principles of freedom and self-determination would ever use this argument. It seems just too selfish, cold and intellectual. People may elect to have abortions, but they don’t do so waving their right-to-choose flag. Even those who are pro-abortion admit that a woman having an abortion is tragic and should be avoided, as the Bill Clinton administration said that abortions should remain legal, but rare. \n \nThere is a high correlation between abortion and poverty. One may picture the woman who has an abortion as one who is still in school and wants to end the pregnancy, since she is unable emotionally and financially to be pregnant, give birth and support the baby after it is born. \n \nThat is the case for some; however, it is more likely that woman is older, poor, a minority, has other children, and may be in an unstable relationship with her husband or boyfriend. Her family is already in great difficulty due to all sorts of factors related to poverty, so the woman cannot imagine having to care for another child, so she elects to end her pregnancy. She sees it as her only option for her good and for the good of her children who are already born. \n \nOne can see the veracity of this argument if they look at statistics of abortions per number of live births in poor countries or in certain regions of the U.S. where there are high rates of poverty. The poorer the people and the less stable the government, the more abortions per live births, generally speaking. \n \nThe way to reduce abortions is not necessarily to have the better argument, a certain person in office, or the better-funded lobbyists. It is to see what causes one to consider abortion as an option in the first place. For many, it is not an exercise of freedom, but an expression of despair. Also, for many, it is not because the baby’s mother wants to end the pregnancy, it is that she sees it as her only option. It is more an issue of a lack of resources and support. \n \nAbortion is a symptom of our greed, our racism, our xenophobia, and our hatred for the poor. Since both sides of this issue agree that abortion should be avoided, it is unfortunate that we do not put forth greater effort and resources to help those who are more vulnerable and in consequence reduce the number of abortions. \n \nSo what could reverse the tide of abortions almost overnight?    Government-funded child care, more head start programs, more money for food stamps and WIC, universal healthcare for all families, free education at community colleges, and raising the minimum wage to a living wage would help make it so that families would not be put into the situation where each new child is seen as such a great burden. It would truly be the rising tide that lifts all boats. \n \nIt is unfortunate that liberals have largely made keeping abortion legal one of their key tenets of faith. While seeking to help the poor, they fail to see the poor family doesn’t want access to the abortion clinic. They want access to health care, good schools, adequate housing and safe communities. \n \nConservatives may decry the evil of abortion; however, they wish to defund the programs that the poor need to live a dignified life. The dreadful cycle continues, and the rate of abortion increases as the lives of the poor become more miserable. \n \nIt all comes down to money. The more money and services that are hoarded by the richest percentiles of our population, the greater misery and hopelessness is experienced by the poor. To quote 1 Timothy, “If we have food and clothing, we shall be content with that. Those who want to be rich are falling into temptation and into a trap and into many foolish and harmful desires, which plunge them into ruin and destruction. For the love of money is the root of all evils, and some people in their desire for it have strayed from the faith and have pierced themselves with many pains.” \n \nAbortion is a symptom of our unjust society. When we attempt to better the quality of life for all, especially the poor, we would be amazed how this would impact all parts of our society and help all people from womb until tomb. \n \nAs Pope Francis in his latest encyclical, “Our Common Home,” stated to Catholics, Christians, and to all people of good faith, that whether we are talking about the poor, the environment, children, the elderly, animals, or future generations, everything is part of God’s creation. Destruction of ecosystems, cruelty to animals, or harming the vulnerable, are sins against God. . \n \nRev. Dinsdale is the priest at St. Marguerite Catholic Church in Tooele.", "source": "Tooele Transcript Bulletin Online"}