{"published": "2015-09-02T01:01:33Z", "media-type": "News", "title": "Charges likely for key figures in Petrobras scandal", "id": "7031320f-14ab-431b-bd09-09e8d3e5b81a", "content": "Brasília - Arab Today  \nEvidence gathered against two leading members of Brazil's ruling Workers Party in the Petrobras graft scandal is sufficient for them to face criminal charges, police said Tuesday. \n \nProsecutors now must review the evidence against Jose Dirceu and Joao Vaccari and decide on charges against them and 12 others, police sources said. \n \nProsecutors suspect Dirceu, a former cabinet chief under ex-president Luiz Inacio Lula da Silva (2003-2010) and a cofounder of the leftist party known as PT, of having masterminded the operation. \n \nThe alleged scheme skimmed billions of dollars from the state oil giant and sent the money to political parties, and people's private accounts. \n \nPolice also said evidence shows that Vaccari -- who was arrested when he was treasurer of the Workers Party, and has already been charged in connection with the scandal  -- actively and passively engaged in corruption, money laundering and racketeering. \n \nLula was in office from 2003 to 2010 and was the country's first democratically elected leftist leader. \n \nHe spent generously on social programs to reduce the number of Brazilians living in poverty and the economy boomed to the world's seventh largest. \n \nOn his heels, President Dilma Rousseff has been re-elected, but her popularity is at a staggering low eight percent, with the economy in recession and her government rocked by corruption scandals. \n \nRousseff herself has not been accused, but she chaired the board at Petrobras between 2003 and 2010, when much of the alleged corruption was flourishing. \n \nProsecutors estimate that $2.1 billion in bribes were paid as part of the scheme. \n \nLula is being investigated in an unrelated influence-peddling probe, but has not been charged. \n \nSource", "source": "Arabstoday.net"}