{"published": "2015-09-17T15:00:00Z", "media-type": "News", "title": "Jumpshot Gives Marketers Renewed Visibility Into Paid and Organic Keywords With Launch of Jumpshot Elite", "id": "609772bc-0672-4db5-8516-4c025cfd54ca", "content": "New Product Gives Marketers Access to Real Keywords, Conversions and Results Along With 13 Months of Historical Data \n\nSAN FRANCISCO, CA -- (Marketwired) -- 09/17/15 -- Jumpshot, a marketing analytics company that uses distinctive data sources to paint a complete picture of the online customer journey, today announced the launch of Jumpshot Elite, giving marketers insight into what their customers are doing the 99% of the time they're not on your site. For years, marketers have been unable to see what organic and paid search terms users were entering, much less tie those searches to purchases. Jumpshot not only injects that user search visibility back into the market, but also makes it possible to tie those keywords to conversions -- for any web site. \n\n\"Ever since search engines encrypted search results, marketers have been in the dark about keywords, impacting not only the insight into their own search investments, but also their ability to unearth high converting keywords for their competitors,\" said Deren Baker, CEO of Jumpshot. \"Our platform eliminates the hacks, assumptions, and guesswork that marketers are doing now and provides real data: actual searches tied to actual conversions conducted by real people with nothing inferred.\" \n\nUnlike other keyword research tools that receive data through the Adwords API or send bots to cobble together various data inputs and implied metrics, Jumpshot leverages its panel of over 115 million global consumers to analyze real search activity. As a result, Jumpshot is able to provide companies with actionable data to improve the ROI of their search marketing campaigns, SEO tactics and content marketing initiatives. \n\nAvailable today, Jumpshot Elite provides 13 months of backward-looking data as well as: \n\nAccess to real queries used by searchers \n\nPaid and organic results for any website \n\nVisibility into organic keywords, eliminating the \"not provided\" outcome in web analytics \n\nReal user queries, clicks and transactions instead of machine-generated clicks with inferred results \n\nAbility to tie keywords to real transactions on any website \n\nVariable attribution models and lookback windows \n\nLaunched in January, 2015, Jumpshot grew out of the ambitions of a group of smart marketers and data scientists who were frustrated about the limitations of the data they had access to, and excited about the opportunity to provide new insights into online behavior. \n\nThe company uses distinctive data sources to paint a complete picture of the online world for businesses, from where customers spend time online to what they do there and how they get from place to place. By tracking the online customer journey down to each click, Jumpshot reveals how and why customers arrive at purchase decisions. The company tracks more data in more detail than other services, tracking 160 billion monthly clicks generated by its extensive data panel. \n\nAbout Jumpshot \n\nJumpshot is a marketing analytics platform that reveals the entire customer journey -- from the key sources of traffic to a site, to browsing and buying behavior on any domain. With a panel of 115 million users, Jumpshot provides marketers with the insight to understand what their customers are doing the 99% of the time they're not on their own site -- a scope of information never before attainable. Jumpshot was founded in 2015 and is headquartered in San Francisco. \n\nFor more information, please visit www.jumpshot.com. \n\nImage Available: http://www2.marketwire.com/mw/frame_mw?attachid=2889222 \n\nKelly Mayes \n\nThe Bulleit Group \n\n615-200-8845 \n\nPublished Sep. 17, 2015 \n\nCopyright © 2015 SYS-CON Media, Inc. — All Rights Reserved. \n\nSyndicated stories and blog feeds, all rights reserved by the author.", "source": "Virtualization Conference & Expo"}