{"published": "2015-09-16T14:00:00Z", "media-type": "News", "title": "Thanking Research and Hope honorees for their efforts fighting cancer", "id": "0d07e617-00d4-4866-aee2-0ae197ae366f", "content": "WASHINGTON, Sept. 16, 2015 /PRNewswire-USNewswire/ -- Each year, PhRMA and other biopharmaceutical industry leaders honor those who have made a significant contribution to the health care field. The Research and Hope Awards recognize the men and women conducting groundbreaking research, giving back to their community, advocating for patients and bringing awareness to particular diseases. This year, the awards honored those who are changing the world of oncology research and care. As we continue to gain new insight into the many variations of cancer, new tools are created, medicines are developed and new treatments emerge. With the help of dedicated individuals like the 2015 Research and Hope honorees, we move a little bit closer to transforming once-devastating diseases into manageable conditions.\n\nhttps://photos.prnewswire.com/prnvar/20150915/266923\n\nThis year's recipient of the Excellence in Biopharmaceutical Research award was the KEYTRUDA Team from Merck & Co., Inc. This team developed an approved treatment for advanced melanoma and it has the potential to treat many other types of cancer. We look forward to seeing the continued development of their breakthrough work.\n\nJ. Silvio Gutkind, Ph.D., professor, Department of Pharmacology; associate director, Basic Science, Moores Cancer Center, University of California San Diego, is this year's recipient of the award for Excellence in Academic or Governmental Research. His extensive work with G proteins ultimately led to novel strategies for treating and preventing many types of cancer. These advances have the potential to save the lives of many patients in years to come.\n\nThe Community Champion Award went to Rick Dunetz, executive director and founder of the Side-Out Foundation. Rick, a local volleyball coach, invited his mother to work with his team after her breast cancer diagnosis. She found hope in their victories and the team was inspired to win not only for themselves, but for her as well. After seeing the transformation of his mother and his team, Rick founded the Side-Out Foundation to reach other athletes and cancer patients. His work is bringing hope and energy to the cause of ending breast cancer.\n\nVicki Kennedy, co-founder and president of the Board of the ; senior counsel, Greenberg Traurig LLP, was this year's recipient of the Award for Excellence in Advocacy and Activism. Since the passing of her late husband, Senator Ted Kennedy, Mrs. Kennedy has spoken publicly on coping with stress and enhancing quality of life for brain tumor patients and their loved ones. Her dedication to telling her story, and the story of thousands of other families whose lives have been impacted by cancer is inspiring to many.\n\nThe recipients of the Visibility and Progress Award are Liz and Jay Scott, co-founders of Alex's Lemonade Stand. In 2000, their four-year-old daughter, Alex, founded Alex's Lemonade Stand to raise money to find a cure for childhood cancer after her own diagnosis. Following Alex's death in 2004, her parents set up the foundation to continue her dream of finding a cure. Since Alex's first stand in 2000, the foundation has raised more than $100 million to fund more than 475 cutting-edge research projects. Alex's spirit of determination and hope lives on through the foundations work.\n\nThese five awardees are just a few of the individuals doing outstanding work in the field of oncology research. With their dedication and our continued commitment to finding a cure, the future for cancer patients and their families looks a little bit brighter. To read more about this exciting progress, take a look at some of the honoree's response to the latest Conversations question: What are you most excited about in the fight against cancer?\n\nOn behalf of PhRMA and the co-sponsors of the 2015 Research and Hope Awards, we thank you for your contributions to this important effort.\n\nThe following organizations authored this post: ., American Lung Association, Bladder Cancer Advocacy Network (BCAN), CancerCare, Cancer Support Community, Chris4Life Colon Cancer Foundation, Friends of Cancer Research, No Stomach For Cancer, The Sarcoma Foundation of America\n\nContact: Andrew Powaleny; 202-835-3460; newsroom@phrma.org \n\nhttp://photos.prnewswire.com/prnvar/20091027/PHRMALOGO\n\nPhoto - http://photos.prnewswire.com/prnh/20150915/266923 \n\nLogo - http://photos.prnewswire.com/prnh/20091027/PHRMALOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/thanking-research-and-hope-honorees-for-their-efforts-fighting-cancer-300144093.html SOURCE", "source": "Freshnews.com"}