{"published": "2015-09-01T17:47:07Z", "media-type": "News", "title": "Dolphins practice report: DeVante Parker progressing, Jamil Douglas at RG", "id": "6e931a0c-041e-4f9d-91b4-8308e8603b4e", "content": "Parker \n \nDolphins rookie receiver DeVante Parker isn’t sure if he’ll be ready for the season opener, but he’s making a lot of progress in his first week of practice. \n \nParker, who returned to practice on Monday after undergoing foot surgery in early June, has already progressed to 7-on-7 team drills. He had said he initially expected to start with just individual drills. \n \n“There’s been no effects on the foot,” he said. “It feels pretty good when I go out there and run routes.” \n \nParker’s hopeful that he’ll be out there on Sept. 13 against Washington. But he won’t get the benefit of the doubt like a veteran. It’ll be a decision that coaches and trainers ultimately make. \n \n“That’s been a goal since I had (the surgery),” he said of returning for the opener. “We just have to wait and see how it feels.” \n \nDouglas at RG : While coach Joe Philbin won’t publicly name a starter yet, rookie fourth-round pick Jamil Douglas has supplanted Billy Turner at right guard for now. \n \n“It’s definitely an honor,” Douglas said. “I know that I’ve got to keep coming out every week and proving myself.” \n \nDouglas played exclusively on the left side in college at Arizona State but said he’s adjusting to right guard. \n \nDallas Thomas will start at left guard. \n \n“The first I did it, it was a little uncomfortable,” Douglas said. “But now I’m able to go back and forth without any problems. I’m glad they put me in that situation early.” \n \nInjury updates : A day after all but one of Miami’s active roster players participated in practice, several Dolphins players were out on Tuesday. \n \nCornerback Jamar Taylor, who has been out since injuring his quadriceps muscle in a preseason loss to Carolina, remains out. \n \nJason Fox, who missed last week’s game with a concussion but returned to practice on Monday, did not participate on Tuesday. \n \nRunning back Mike Gillislee (quad), Don Jones (illness), Anthony Johnson (foot) were also out. \n  View Comments     Previous  Dolphins release Brandon Fields; Matt Darr is the new punter", "source": "The Palm Beach Post"}