{"published": "2015-09-04T19:50:59Z", "media-type": "News", "title": "Pygmy killer whales stranded in an unusual spot", "id": "0f64a4f9-5cec-433d-9d6e-b9274c3a1605", "content": "(CNN) -- A discovery in a Mississippi bayou is giving scientists a glimpse into a rarely-seen marine species. \n\nAttracted to the telltale \"swoosh\" sound of a blowhole, a fisherman this week found two stranded pygmy killer whales in Waveland, along the Gulf Coast - far from their natural habitat. \n\n- USING OUR APP? Click here to watch the video. \n\n\"Very little is known about this species,\" says Moby Solangi, Director of the Institute of Marine Mammal Studies in nearby Gulfport, Mississippi. He told CNN affiliate WLOX that the discovery is like finding so-called \"black boxes\" that give insight and history in to an otherwise mysterious sea creature. \n\nEven though the animal has \"killer whale\" in its name, it is a member of the dolphin family. Pygmy killer whales also have a very strange body shape. According to National Marine Fisheries Service \"they have a small head with a rounded melon that extends in front of the mouth and there is no discernable beak.\" \n\nThe pygmy killer whales were a long way from their natural habitat of deep water in the Northern Gulf of Mexico. Their numbers in the region are estimated at just over 400. They are also located in Hawaii and the Western North Atlantic Ocean. \n\nThe animals were rescued and transferred to the institute, where they arrived disoriented and unable to swim. Blood tests showed the whales were dehydrated. \n\nIn the last few days, their conditions have been improving. The larger pygmy whale is swimming on its own. But the smaller one is being treated for a possible shark bite wound. \n\nWhen first rescued, the whales were separated and the smaller one started to panic. But the social animals are now kept in the same pool, as staff and volunteers continue to nurse them back to health. \n\n\"The little one is hugging close to the big one. He always goes in to nuzzle. Always touching him,\" said an institute volunteer. \n\n---------- \n\nBy Andreas Preuss \n\nThe-CNN-Wire™ & © 2015 Cable News Network, Inc., a Time Warner Company. All rights reserved.", "source": "NBC 2"}