{"published": "2015-09-06T15:24:17Z", "media-type": "Blog", "title": "Russia hints at Saudi Arabia deal as OPEC pain deepens", "id": "30290e0e-4c3a-49cd-a05d-170c38f2b655", "content": "Russia: Kremlin energy tsar says OPEC may have to ditch its low-price policy within months. But Russia needs to cut output quietly too\n\n\n\n\n\n\n\nGazprom's revenues are likely to drop by almost a third to $106bn this year Photo: Bloomberg News\n\n\n\n\n\n\n\n\n\n\n\n\nBy Ambrose Evans-Pritchard, Cernobbio, Italy\nThe Telegraph\n.\n\n\n\nThe OPEC oil cartel cannot withstand the pain of low crude prices indefinitely and may be forced to abandon its pugnacious bid for market share within months, Russia's chief energy official has predicted.\n\n\n\n\nArkady Dvorkovich, the deputy prime minister, said OPEC producers are suffering the ricochet effects of their attempt to flush out rivals by flooding the world with excess output.\n\n\n\n\n\"I don't think they really want to live with low oil prices for a long time. At some point it is likely that are going to have to change policy. They can last a few months, to a couple of years,\" he told The Telegraph.\n\n\n\n\nSaudi Arabia took a fateful decision last November to crank up production to record levels despite a glut of 1-2m barrels a day (b\\d) accumulating in global markets, hoping to halt the advance of US shale and kill off high-cost projects in the Arctic and deep off-shore waters.\n\n\n\n\nWorkers adjust a valve of an oil pipe as smoke rises from burning excess gas in Zubair oilfield in Basra  Photo: REUTERS\n\n\n\n\nRiyadh has made it clear that it will not cut output to shore up prices unless non-OPEC producers share of the burden. This essentially means Russia, the world's biggest producer.\n\nMr Dvorkovich, the head of Russia's economic and energy strategy, said his country was in constant talks with OPEC in order to bring about a \"more rational policy\" but was coy on whether the Kremlin would break the impasse and strike a deal with the Saudis.\n\n\"Our consultations do not imply directly that we are going to see any coordinated action. Perhaps 'yes', perhaps 'no', most likely 'no',\" he said, speaking at the Ambrosetti forum of world policy-makers on Lake Como. \"We are sending signals to each other.\"\n\nRussia insists that it cannot switch off output as easily as the Saudis, given the harsh weather in the Siberian fields, a claim dismissed by OPEC as a negotiating ploy.\n\nNor can the Kremlin order Russian drillers to slash production without under-cutting its insistence that these oil groups are genuine companies, answerable to their shareholders. Yet there are subtle ways of achieving the same outcome.\n\nThe Kremlin, Moscow  Photo: CORBIS\n\nThe head of Russia's oil giant Rosneft, Igor Sechin, has been the right-hand man of president Vladimir Putin for more than twenty years. The company is 70pc state-owned. \"If Putin wants to cut, of course he can do it. Everybody knows that, \" said one OPEC veteran.\n\nMr Dvorkovich hinted that output cuts could be on the way. \"We are not going to cut supply artificially. Oil companies will act on their own. They will look at market forces and decide whether to invest more or less,\" he said.\n\n\"If prices stay low it is in the nature of oil companies to stabilise production, or even to cut production. The government will not decide on the behalf of oil companies what to do,\" he said.\n\nAdnan Shihab-Eldin, the former secretary-general of OPEC, said the oil cartel is in \"bad shape\" and may have to rethink its current strategy. \"Can OPEC really afford to the policy started in November of letting the market determine prices,\" said at the Ambrosetti forum.\n\nMr Shihab-Eldin said US shale drillers have proved remarkably resilient, slashing costs from $70 a barrel to nearer $50 through new technology and a switch to higher-yielding \"sweet spots\". The rig-count has halved but production has hardly fallen.\n\n\n\nHe said OPEC will make a hard-headed decision over how best to extract maximum revenue, ditching its current policy if it does not pay. \"Keeping market share at any price is not an ideology for OPEC,\" he said.\n\nRussia is in deep crisis. The economy has contracted by 4.6pc over the last year. The rouble has halved against the dollar since mid-2014, falling pari passu with the price of Brent crude. While this provides a shock-absorber of sorts, it makes life much harder for Russian firms struggling to repay $12-15bn a quarter in external dollar debt.\n\nThese companies are largely shut out of global capital markets by Western sanctions, forcing them to rely heavily on the Russian state for dollar liquidity. Yet the central bank is trying to conserve its foreign reserves. The treasury itself failed to sell all its bonds at an auction last month.\n\n\n\nRussia's strategic embrace with China has so far failed to produce much beyond warm words. A $400bn gas deal signed in May 2014 has run into trouble as the Chinese haggle hard over prices and stall on $55bn of financing for the construction projects. Hopes for a second pipeline to China from West Siberia have come to little.\n\nAn informal 'super-OPEC' with Russia would control roughly 45pc of the global oil market, roughly equal to OPEC's glory days in the 1970s. Industry experts say the Saudis might consider a deal if Russia offered a gentleman's agreement to trim its 10.7m b\\d output by 500,000.\n\nEventually, this may happen by default. The main Russian wells in Western Siberia are Soviet vintage and depleting at a rate of 8-11pc a year. Sanctions have paralyzed new investments in the Arctic and the Bazhenov shale basin.\n\nSaudi Arabia is also in some trouble, and lacks Russia's industrial depth and strategic strengths. Riyadh's foreign reserves have fallen to $661bn from $737bn over the last eleven months.\n\nThe Saudis still have an ample cushion but are running a budget deficit of 20pc of GDP to cover their social welfare spending and military expansion. They must either drain reserves at a pace of $12bn a month, or issue debt.\n\n\n\nOne foreign policy veteran said it is mystifying what the Saudis really intend to do under the new regime of King Salman. \"They have gone from being the most predictable of countries, to the most unpredictable,\" he said.\n\nThe Russians and the Saudis have powerful reasons to co-operate on energy policies. Until now they have been on opposing sides in Syria, poisoning everything. This may be changing. King Salman has been invited to visit Moscow as the thaw in relations deepens.\n\nMr Putin is building up Russia's troop presence in Syria but he has also sent shockwaves through Damascus by backing some form of \"power-sharing\" in the country, a sign that Bashar al-Assad's days may be numbered.\n\nThe contours of a realpolitik entente between Saudi Arabia and Russia are emerging, with major implications for the global oil markets and the world economy.\n\nMr Dvorkovich said the Kremlin would stand behind its long-standing ally for now. \"There are many people who still support Assad, We're not going to put anyone aside, except the terrorists,\" he said.\n\nhttp://www.telegraph.co.uk/finance/11847300/Russia-flirts-with-Saudi-Arabia-as-OPEC-pain-deepens.html\n\n.", "source": "Peace and Freedom"}