{"published": "2015-09-15T14:00:00Z", "media-type": "News", "title": "Investors given chance to dip into The Well in Camberwell", "id": "1ca51fb7-f37f-45f1-a281-9d74064ee62d", "content": "Anchored by a Coles supermarket, The Well returns $4.9 million a year in income. \n\nThe Well shopping centre in Camberwell is tipped to fetch more than $70 million.\n\nAndrew V. Myer, scion of the Myer retailing family, said it was time to move on from his project.\n\nHe started to develop The Well in 2004 as a mixed project with a seven-level apartment building and 2500 square metres of office space.\n\nThe 9325-square-metre shopping centre opened in 2008, just as the global financial crisis hit the economy.\n\nAnchored by a Coles supermarket, it returns $4.9 million a year in income.\n\nMr Myer said it was time for a change.\n\n\"It's been very rewarding. It was tough during the GFC, but everything was tough then,\" he said.\n\n\"I'm ready to do new things – some boutique residential projects and films – and need some new capital so I can do that. It's been a trophy asset for us and I expect it will be for the next owner.\"\n\nOther tenants at the centre at 793 Burke Road include Dymocks, JB Hi-Fi and the Goodlife Health Club, as well as 23 specialty shops.\n\nJLL head of retail Simon Rooney, who is handling the expressions of interest campaign, said the centre was in the middle of one of Melbourne's most affluent areas.\n\n\"Not only is it a demographic with high spending power, it is one that continues to grow,\" Mr Rooney said.\n\nMr Myer is the grandson of Sidney Myer.\n\nSidney Myer built the eight-level Myer department store in Bourke Street in 1914. It was the fifth-largest centre in the world at the time.\n\nMr Rooney said more than $1.1 billion worth of neighbourhood shopping centres had changed hands in 2015, which could rival last year's record $1.8 billion of transactions. The story first appeared on The Sydney Morning Herald.", "source": "Great Lakes Advocate"}