{"published": "2015-09-06T14:13:35Z", "media-type": "Blog", "title": "Lively Lessons: Germs", "id": "10b31e2e-a0d9-4e4e-9015-0393260c6d6e", "content": "  \n \nWorking on your weekly lesson plans? This Sunday blog series, Lively Lessons, will provide you with Discovery Education content and lesson plan ideas! \n \nBack to school is a great time to remind students the best way to protect themselves from germs. Whether you’re learning about how to prevent germs by washing your hands and how germs work in Elementary grades or if you’re exploring how diseases have evolved over time and effected communities in high school, there are numerous resources to support your lesson. Discovery Education’s recently updated content collection on Germs provides a number of digital resources to use with students of all age groups. Keep reading for ideas on how to make use of digital resources in your classroom. \n \nHow many germs are in a sneeze?  \nFind out the science behind your sneeze with  Head Rush: How Many Germs are in a Sneeze? \n \n  \n  \nK-2: Surround Sound : As students enter the classroom, have the sound effect Human: Cough: Female from Discovery Education Streaming playing. If possible, set the sound to a loop so that it continues playing as long as needed. When students take their seats, ask them to close their eyes and visualize a scene in which the sound is occurring… Click here  to access the full Germs Content Collection and all K-5 lesson starters. \n \n3- 5: Respiratory System Partner Time: After students view the “ Keeping the Respiratory System Healthy ” video segment, discuss with students some of what they have learned about the respiratory and circulatory systems and keeping these systems healthy. Next, provide each student with a copy of the clock partners template. Instruct students to place their name in the upper right-hand corner of the paper. Explain to students that they will be circulating around the room to make appointments to discuss the video segment with different partners…   Click here  to access the full Germs Content Collection and all K-5 lesson starters. \n \nStudent Created Board from Rockwood South Middle School \n \n  \n \n6- 8: Vaccine Infographic: Instruct students to read the encyclopedia article “ Germ ,” and tell them to think about what they know about vaccines, and how they can help stop the spread of disease. Invite students to work in small groups with Board Builder to create an infographic that describes how vaccines were developed and why they work…  Click here  to access the full Germs Content Collection and all 6-8 lesson starters. \n \n9- 12 Going Viral: After viewing The PBS NewsHour: Disease Detectives Track Ebola at the CDC  ask students questions about what they saw. Then, guide students to discuss the menaing of the phrase “going viral” in a digital context, and elicit critical thought and discussion about the relationship between that use of the term “viral” and the use of the term in a public-health context…   Click here  to access the full Germs Content Collection and all 9-12 lesson starters. \n \n  \n \n\n \n  \n  \nShare your ideas! We know you’re using resources and tools from Discovery Education everyday- in fun and creative ways. We’d love to highlight your ideas in an upcoming Lively Lesson. \n \nIt’s easy- just share your favorite content and a few ways you incorporate it into a lesson. To participate, complete this form and keep your eye on the blog- you may be featured in an upcoming post!", "source": "Discovery Education"}