{"published": "2015-09-14T18:14:42Z", "media-type": "News", "title": "Pool Upgraded by Zacks to “Hold” (POOL)", "id": "501bed41-667f-48c8-a68e-0186a3b69f93", "content": "Filed Under: Analysts Upgrades • Market News \n\nPool (NASDAQ:POOL) was upgraded by Zacks from a “sell” rating to a “hold” rating in a research report issued on Monday, Analyst Ratings Net reports. \n\nAccording to Zacks, “Pool Corp.’s should continue to benefit in the near term from base business sales growth, along with favorable trends in the housing market. The continued strong growth in the pool renovation category along with the reasonable growth of green segment’s sales (the Horizon segment) is another positive. However, the new pool construction remains well below the pre-recession levels, which is a cause for concern. Further, the seasonality of Pool’s business would remain a headwind. Further, currency headwinds weighed on international sales.” \n\nIn related news, Director George T. Haymaker sold 7,000 shares of Pool stock in a transaction on Friday, August 14th. The shares were sold at an average price of $70.80, for a total value of $495,600.00. The sale was disclosed in a document filed with the Securities & Exchange Commission, which is available at the SEC website. Also, Director Robert C. Sledd sold 8,500 shares of Pool stock in a transaction on Thursday, June 25th. The stock was sold at an average price of $71.40, for a total transaction of $606,900.00. The disclosure for this sale can be found here. \n\nShares of Pool (NASDAQ:POOL) traded down 0.43% on Monday, hitting $71.88. 51,541 shares of the company traded hands. The company has a market capitalization of $3.09 billion and a PE ratio of 26.89. The stock’s 50-day moving average price is $69.89 and its 200-day moving average price is $69.12. Pool has a 12 month low of $51.61 and a 12 month high of $72.85. \n\nPool (NASDAQ:POOL) last announced its quarterly earnings data on Thursday, July 23rd. The company reported $1.75 EPS for the quarter, missing the Zacks’ consensus estimate of $1.79 by $0.04. The business had revenue of $851.90 million for the quarter, compared to the consensus estimate of $903.55 million. The company’s revenue was up .4% on a year-over-year basis. During the same quarter in the previous year, the company posted $1.61 earnings per share. On average, equities analysts predict that Pool will post $2.78 earnings per share for the current year. \n\nThe business also recently declared a quarterly dividend, which was paid on Wednesday, August 26th. Stockholders of record on Wednesday, August 12th were issued a $0.26 dividend. The ex-dividend date of this dividend was Monday, August 10th. This represents a $1.04 dividend on an annualized basis and a dividend yield of 1.44%. \n\nA number of other brokerages also recently commented on POOL. KeyBanc upgraded shares of Pool from a “sector weight” rating to an “overweight” rating and set a $79.00 target price for the company in a report on Tuesday, September 8th. Pacific Crest upgraded shares of Pool to an “overweight” rating and set a $79.00 price target for the company in a research note on Tuesday, September 8th. Finally, William Blair upgraded shares of Pool from a “market perform” rating to an “outperform” rating in a research report on Monday, July 27th. One equities research analyst has rated the stock with a hold rating and four have issued a buy rating to the company’s stock. Pool presently has a consensus rating of “Buy” and an average price target of $77.33. \n\nPool Corporation is a distributor of swimming pool supplies, equipment and related leisure products. The Company is also a distributor of irrigation and landscape products. The Company operates approximately 328 sales centers in North America, Europe, South America and Australia through its four distribution networks: SCP Distributors (NASDAQ:POOL); Superior Pool Products (Superior); Horizon Distributors (Horizon), and National Pool Tile (NPT). The Company’s product offerings also include building materials used for pool construction, installations and remodeling, such as concrete and pool surfacing and decking materials. The Company’s products include maintenance products, repair and replacement parts for pool equipment, packaged pool kits, pool equipment and components for pool construction and irrigation and landscape products, among others. \n\nTo get a free copy of the research report on Pool (POOL), click here. For more information about research offerings from Zacks Investment Research, visit Zacks.com \n\nReceive News & Ratings for Pool Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Pool and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News"}