{"published": "2015-09-11T15:05:43Z", "media-type": "News", "title": "How's the Market? Getting permits up front saves time, money and headaches", "id": "fe4d045d-6c97-4ccf-a7d5-08aafb72a0db", "content": "If you plan to undertake major repairs or structural improvements to your home, you will undoubtedly need a permit to do so legally. Whether you live within the Ukiah city limits or in the unincorporated part of Mendocino County, there’s a planning and building department for you. \n\nWhen do you need a permit? Any time you mess with a utility like gas or electricity, any time you do structural work, any time you build a retaining wall taller than three feet, and any time you build a deck, for starters. If you simply plan to paint your bedroom a lovely shade of lavender, you need not alert the authorities, but if you build a walk-in closet, it’s permit time. \n  \nDepending on where you live, you’ll either choose the city or county building department. You’ll likely need to submit drawings of your intended repair or improvement, as well as structural calculations. The building department folks will then assess a fee and issue a permit (provided your plans adhere to building and zoning codes). Once the work is done, a city or county inspector will confirm that the work is complete and to code, and issue a final permit. \n\nI cannot tell you how many unpermitted repairs and improvements have been discovered during the sale of a property. And even without a sale, if you started the permit process but never obtained final approval, you not only have no permit, you have notified the authorities of this fact. \n  \nBecause many people (or their contractors) are competent to do repairs or improvements, they think they don’t need a permit, but they do. If they ever want to sell the property, they’re now obligated by law to disclose to prospective buyers that unpermitted work was done. \n\nSo in addition to paying a hefty penalty, the work that was done must meet current code (not the code that was in effect when the repair or improvement was completed). If the repair or improvement cannot be brought up to code, or if it does not comply with current zoning requirements, the building department may require that the repair or improvement be removed. No, I am not kidding. \n  \nBear in mind that not all repairs or improvements are brick and mortar. Grading a driveway, for example, requires a permit depending on how much earth is moved and the driveway’s proximity to nearby bodies of water. I am aware of a situation where a driveway was constructed without a permit and not to code, and the county required that the property be restored to its original condition. The restoration cost exceeded the value of the property. So a word to the wise: get a permit. \n\nIn addition to building and zoning codes, some houses must comply with covenants, conditions and restrictions (CC&Rs)—go to http://richardselzer.com/2014/09/08/covenants-and-conditions-and-restrictions-oh-my  for more about those. Long story short, if you live in a subdivision, there are likely limitations about the height of fences, whether you can build a second story, or even what color you can paint your house. \n \n\r\r \n  \nJust save yourself the time, money and headache of trying to get a permit after the fact, and get it up front. Do the work, get the inspection, then put the final permit somewhere you can put your hands on it, should you ever need to. Remember, if you sell your home, improvements can be deducted from the sales price in determining if and how much capital gains tax you pay. Generally, the first $500,000 is deductible for a married couple who has lived in the house for at least two of the last five years. \n  \nIf you have questions about real estate or property management, please contact me at rselzer@selzerrealty.com or visit www.realtyworldselzer.com. If I use your suggestion in a column, I’ll send you a $5 gift card to Schat’s Bakery. If you’d like to read previous articles, visit my blog at www.richardselzer.com. Dick Selzer is a real estate broker who has been in the business for more than 35 years", "source": "Ukiah Daily Journal"}