{"published": "2015-09-09T11:12:58Z", "media-type": "News", "title": "Array Architects Hosts Knowledge Sharing Among Healthcare Industry Experts Focusing on Project Delivery", "id": "5e0f0f34-5e49-40eb-a444-0518f83fa239", "content": "Array Architects recently reconvened a group of healthcare facility leaders to continue their discussion on alternative delivery methods. At the top of the discussion list, the panel noted that capital is often a challenge, therefore health systems have to be creative by finding new methodologies to get a quicker, more cost effective project. A diverse group of healthcare design and construction professionals were asked what their experiences were with the following project delivery methods. \n\nIntegrated Project Delivery Model (IPD) \n   \nIn an IPD model, the owner, PM, builder and design team are partners with trades brought in early to assist.  The necessary components of IPD are team assembly, education, project cost validation, contract negotiations, collaborative interaction and definition of scope.  Leaders need buy-in at the administrative level as there tends to be concerns about spending money up front. The mindset is that if the money will be saved in the future anyway, then why invest more at the beginning? Audits are done on the regular basis, but you have to get past this hurdle. \n\nThe group talked about best practices of this delivery model, and participants came to the agreement that risk should be defined up front so it is managed effectively throughout the life of the project.  There are check points that can be used to keep everything on track such as performing audits on a regular basis, and perhaps creating a clinical advisory team that meets on a regular basis to review the design intent and the input from users for consistency and cross-checking.  Committees help each other be more accountable and then it's less about what they want as an individual.  Often times a master plan is used as a guide book and definition of the intent. \n\nAside from a clinical advisory team, it's also beneficial when the contractors and trades have check points and analyze one another. IPD is a very collaborative process where each team member works to be more efficient as a team and diminish the cost of the execution of work. The team becomes motivated to spend less time on the job, yet still protect their interests by managing the risk.  Their time is tracked and the risk is equally shared amongst them.  It may sometimes be T&M (Time & Materials) in order to get started if there is a fixed fee set aside, and then submit a bill of sale for materials plus timesheets for employees to show hours and rates. It is tracked and audited every month. \n\nFor a renovation as an IPD project, there are many unknowns that can be eliminated up front and it is helpful to have more people involved earlier. In order to deal with concealed conditions with an IPD contract, do a site investigation and spend this money up front. The money is spent before the IPD contract is put in place and ultimately rolls into the overall value of the contract. It is a T+M contract with shared risk, with profit set aside for the whole team if goals are met, therefore no traditional change orders. \n\nThere are many reasons and barriers why IPD is not adopted more across the industry, first and foremost being that it is a change in culture.  Owners often tend to be apprehensive due to regulatory issues and union challenges.  It is tough to get subcontractors on board early and agree to the initial outlay of cash. There are concerns about not seeing an immediate return, hoping that it will indeed show on the back end - which may be hard to prove. Similar to the statement made about the administrators above, people may assume the money would be saved down the road anyway, so why invest it at the beginning? \n\nConstruction Management Model \nIn a Construction Management Model, it is not as much about how the contract is structured, but more about how to bring the team together early as collaboration is still important.  CMs and architects can still be brought on immediately to spend energy during the pre-construction stage to help eliminate Value Engineering.  The hope is to never have to open up the contract so there is still a feeling of being a team, not multiple entities working on a project; the entire team is together with a common goal. \n\nDesign/Build Model \nThe Design/Build Model also requires early involvement of architects, engineers, and even medical equipment planners.  Some systems bundle multiple projects into one. There is an initial feasibility study, test fit and programming; then turn it over to the CM and design team. \n\nHybrid Models \nHybrid Models are integrated project delivery methods that are modified.  They take on the collaborative approach but with independent contracts which differs from true IPD. These hybrids can close the gap between projects too small for IDP and very large projects that become onerous under traditional contracts.  Like the earlier models, hybrids use incentives based on cost and schedule. You cannot be successful with one at the expense of the other because the counter balance is not there.  Often the budget incentives are challenging however, because the team may assume there was a change at some point that they should not be responsible for. Was it in the original scope; or was it added afterwards?  Tips to be successful are early involvement, collocation, and lots of design participation with the trades and the builder through processes such as Design-Assist. \n\nDesign-Assist is when subs are brought in up front during plan and specification development, which will ultimately reduce the time and cost of construction.  This is because often times the construction team has suggestions for improvements, so incorporating them early on will ultimately enhance constructability. \n\nIt was also recommended to document a pricing process when the contract is put into place, trying ways to get an affordable price, understanding who will have the final word.  Also make sure design, process and input from the users stays consistent throughout the process. Don't just focus on the beginning of the process because different users come on board throughout the project. If changes are desired, team members will know the pricing will change. \n\nPublic Agencies are more likely to use hybrid models versus a true IPD contract.  Without the protection of an IPD contract in place, these agencies use other forms of protection such as making the incentives have incentives; i.e. using clawbacks--the recovery of money already disbursed. Agencies would claw back pieces of other incentives to mitigate that risk. That is how those groups saw it as sharing the risk. The team would have to give back some of the base fee for the upside potential of getting the full set of incentives. It works better on large projects, because incentives need meat to get attention. Public owners can be the sole arbiters, grading at key milestones and having a third party measure the milestones against metrics. \n\nAll project delivery models have common themes that lead to successful projects.   For any delivery method, it is important to understand the goals and then measure against them.  Make sure to involve as many people as possible early on including the users, and explain how the process will flow.  Cross conversations should always happen because users' comments often inform the design. Conduct training sessions so the team understands how the contract works, and create a matrix to measure goals and successes. Consistency is key for any of these methods. \n\nKnowledge sharing amongst an elite group within the Boston, New York, Philadelphia and Washington DC healthcare design and construction markets has been enlightening. It is interesting to see the similarities and differences from institution to institution, borough to borough and urban to suburban. \n\nRead the full story at http://www.prweb.com/releases/2015/08/prweb12926675.htm \nPRWeb.com", "source": "MoneyShow.com"}