{"published": "2015-09-25T14:14:00Z", "media-type": "News", "title": "THE EVOLUTION OF MARTONE Out of the Closet and Hard to Contain", "id": "5f0ff4b7-c02a-466f-ad08-74f69d9358b8", "content": "DALLAS , Sept. 25, 2015 /PRNewswire/ -- When Michigan native and openly gay entertainer/recording artist Martone decides that he wants to achieve something out of life, nothing can stop him. The re-release of his debut album, The Evolution of Martone 2 nd  Edition, is sure to keep dance fanatics from around the world leaping from their seats straight to the dance floor.  \n\nThe Evolution of Martone 2 nd Edition contains new remixes from Platinum Keyz Recordings Producer, Michael E. Williams, II and popular D.C. DJ, Tyrone Spencer , aka DJ Suspence. The opus has caught the attention of industry professionals and House/EDM/R&B fans alike, here's what they had to say:  \n   \nYvette from Dallas, TX – \"These contagious beats have me dancing my car, Groove Tonight is my Favorite.\" \n\nMike White Presents from London, UK – \"Wicked beat programming, cool seductive vocals for Groove Tonight .\"  \n\nChad Burleson – The Chad Report \"I stand by my endorsement, Love You I Do is a Hit.\"  \n\nListen to Dj Suspence's Remix here: https://www.reverbnation.com/martone9/song/24356754-love-you-i-do-dj-suspence-remix \n\n\"It is my hope that everyone enjoys my music and shares their experiences from listening to it. It was a labor of love that will not soon be forgotten,\" said, the Chocolate singer. \n\nMartone has a clear vision on how he wants to proceed with The Evolution of Martone 2 nd  Edition . \"It is my hope to see my vision for this project come to fruition with spreading positive messages about lasting relationships, between same gender-loving people,\" said the singer. In the months to come, Martone plans to film several music videos with former Michael and Janet Jackson dancer and legendary choreographer, Jimmy Locust . \"I would also like to do some touring, acting, and television commercials promoting my songs as well, whether it is automotive or clothing lines,\" said Martone. \n\n\"A few people have tried to discourage me from coming out as a gay artist, especially being African-American. I politely told them that it is my choice and I had spent so many years in the closet and I am not going back in for anyone. Whether they love it or hate it you really have to respect the authenticity behind it,\" said the singer. \n\nMartone recently wrote an article about his experiences growing up gay for Our Queer Art an online LGBT magazine read the article here: www.ourqueerart.com/martone to listen to the LGBT themed love song Chocolate (Spoken Word Mix) please visit here: https://www.reverbnation.com/martone9/song/23649047-chocolate-spoken-word-mix \n\nThe Evolution of Martone 1 st  Edition remained at the top of the ReverbNation's website for 13 weeks and has stayed in the top three for the past 20 weeks. All listeners can purchase the 1 st and 2 nd  Edition of The Evolution of Martone at these online stores: \n\nTo order compact discs and digital downloads: http://www.martoneonline.com/gallery.php \n\nFor digital downloads and online streaming: \n\nItunes: \n\nhttps://itunes.apple.com/us/album/evolution-martone-1st-edition/id1010747332 \n\nReverbNation: \n\nwww.reverbnation.com/martone9  \n\nGoogle Play: https://play.google.com/store/music/album/Martone_The_Evolution_of_Martone_1st_Edition?id=Bnein2buwmarjvwrnhovpllnx74 \n\nSpotify: \nhttps://play.spotify.com/album/7hmzbPoKWWWj9lwTf0x1js?play=true&utm_source=open.spotify.com&utm_medium=open \n\nFor more Martone news please visit or follow him at these sites: \n\nwww.martoneonline.com  \n\nwww.facebook.com/TheRealMartone  \n\nwww.Reverbnation.com/martone9 \n\nwww.twitter.com/iam_martone  \n\nwww.instagram.com/iam_martone  \n\nFor interviews please contact publicist Stacey L. Miller 510-435-7868 or bookings@martoneonline.com  \n\nPR CONTACT: \nStacey L. Miller , Publicist \n510-435-7868 email: info@thegotogirlsonline.com website: www.thegotogirls.com    \nYour Go-To-Girl \n\nPhoto - http://photos.prnewswire.com/prnh/20150923/270211   \n\nLogo - http://photos.prnewswire.com/prnh/20150923/270242LOGO   \n\nAudio - http://origin-qps.onstreammedia.com/origin/multivu_archive/ENR/270212-Love-You-I-Do.mp3  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/the-evolution-of-martone-out-of-the-closet-and-hard-to-contain-300148246.html \n\nSOURCE  Enotram Entertainment", "source": "Financial Content"}