{"published": "2015-09-11T01:42:12Z", "media-type": "News", "title": "Jeremy Corbyn creates new wave of left enthusiam with old-school socialism", "id": "6f04dc44-fad8-47e4-b146-6832152dca9e", "content": "In a small hall in Islington on Thursday night, a scruffy, bearded, bicycle-riding, vest-wearing, anti-austerity maverick made his final speech as Labour's unlikely, likely next leader. \n\nLondon: In a small hall in Islington on Thursday night, a scruffy, bearded, bicycle-riding, vest-wearing, anti-austerity maverick made his final speech as Labour's unlikely likely next leader.\n\nUnder a sign saying \"A new kind of politics\" Jeremy Corbyn ran through the hundredth variation of a stump speech that has proven the political hit of the summer.\n\nIt's been music to leftist ears, a greatest hits compilation of the socialist dream.\n\n\"We can change politics in Britain,\" he promised the cheering crowd.\n\n\"Common good is the aspiration of all of us … end discrimination … end poverty and misery … a society where nobody is sleeping rough and everybody is cared for to the best of our collective efforts … fairer distribution of wealth and resources…\"\n\nAnd the enemy: \"Brutality of the system … excessive profits… out-of-control banking system … grotesque and glaring levels of inequality… the very rich have got very much richer and the very poor have got very much poorer, that is Tory Britain.\"\n\nYou half expected Billy Bragg to come on and sing the Internationale at the end.\n\nBut the loudspeakers blared Working On a Building of Love by the Chairmen of the Board, certainly the only board members in Corbyn's good books.\n\nThis is Corbyn. To the frothing punditocracy, who have been in hysterics over a '#JezWeCan' win since polls in early August revealed it to be startlingly likely, he is either the saviour of left politics in Britain, or one of the signs of the Labour Party Apocalypse.\n\nThere is no apparent middle ground.\n\nTo say his rise and rise has come as a surprise to Britain would be an understatement, along the lines of \"please welcome the next president of the USA, Kanye West\", or \"Abbott, Putin return from fishing trip, report they bonded over campfire chats, cuddles\".\n\nIt is not so much that he is saying things thought unsayable in modern politics, it's that he's also winning over voters by saying them.\n\nCorbyn has been the MP for Islington North since 1983, and many of his policies sound even older. He wants to renationalise the railways, get rid of the UK's nuclear weapons, print money to pay for new infrastructure and hit the banks with a windfall tax on \"excessive profits\".\n\nHe only just made it to the shortlist of candidates in June, after a few Labour MPs gave him their vote even though they didn't want him to win, for the sake of broadening the debate.\n\nJon Cruddas, who wrote Labour's last election manifesto, was one of them. On Thursday he told BBC radio he thought Corbyn had \"changed the whole character of the conversation … my son rings up at the beginning of the campaign and says 'I'm rejoining the party'. A couple of days later my mum rings up and says she has joined the party, something she has equivocated over for nearly a decade. They are enthused by something that's going on and around Labour.\"\n\nBut while the enthusiasm is welcome, exactly what is going on has Cruddas more concerned.\n\n\"I am worried that [Labour] might turn into quite an early '80s tribute act, a Trotskyist tribute act ... The unpalatable truth for the left is that the Tories did not win despite austerity, but because of it.\"\n\nWhile many Labour MPs are cool on Corbyn, the party grassroots can't get enough of him. More than 100,000 people have joined Labour since the election. He has played rallies while his opponents played small rooms. More than three times as many people will vote for this leader than the last one, according to a BBC estimate.\n\nBut this surge of popularity is a mirage, Corbyn's opponents warn. Dragging the party left will lose more votes than it gains.\n\nPeter Mandelson, one of the architects of New Labour in the 1990s, wrote in the Financial Times that a Corbyn win \"would be a sad and possibly final chapter in the British Labour party's history\".\n\nCorbyn's policies would make the party unelectable, Lord Mandelson said.\n\n\"The Corbyn insurgency … is fuelled by a mixture of idealism, frustration, naivety and trade union bank balances. Some of the people trying to cast votes are clearly wreckers from outside the party.\"\n\nIt was Labour's \"Syriza moment\", he said, referring to Greece's leftist surge – and ignoring the fact that Syriza won government.\n\nAnd he said it reminded him of the moment \"30 years ago almost to the day, when I was appointed Labour's campaign director … following colossal electoral defeat, moderates in disarray, the soft left not knowing which way to turn, sensible policy thinking dried up\".\n\nCruddas says Corbyn's success illuminated deeper problems in Labour: \"He's not causing the crisis … his campaign is symptomatic of the nature of the crisis. He is inhabiting that crisis and diagnosing it and I think that needs to be welcomed.\"\n\nConservative Times columnist Matthew Parris says Corbyn's surge is the manifestation of the party's malaise and division: \"Labour has been hollowing beneath a hard crust for more than 40 years. It ran out of big political ideas in about 1973.\"\n\nIn part it is a victim of its own success, Parris said. \"The story of economic and social progress among what Labour used to call the working class … is hugely to the credit of that party. There exists today no great mass of weak and impoverished citizens in need of their own political party … so who is the party for? Labour has ended up with the nuts that won't open at the bottom of the bowl: a party for the nation's casualties.\"\n\nOf course, the success of Corbyn's campaign proves the lie to at least a part of Parris' thesis. Corbyn's message is exactly the opposite of an appeal to self-interest, it is an appeal to solidarity and community. YouGov polled thousands of Labour members and found that 67 per cent of Corbyn supporters identified with the phrase \"you may say that I'm a dreamer\".\n\nOther focus groups in the wake of May's bloodbath identified a few rays of hope for Labour. People were receptive to the idea of a passionate leader who talked to them about the NHS and education – issues that affected them and their children.\n\nBut they also showed some pitfalls for a Corbyn-led Labour. People weren't particularly interested in a return to broad-brush socialism such as re-nationalised railways, they wanted Labour to rebuild credibility on economic issues. They wanted it to be united, with less internal bickering. And they wanted their concerns over immigration and the impact on public services, house prices, pay and society in general to be taken seriously, not dismissed as xenophobia.\n\nConservative pollster Lord Ashcroft called his latest research on Labour \"Red Dawn\". He found that voters in the May election who switched from Labour mostly said they had been turned off by Ed Miliband​ – but the second biggest factor was a distrust of Labour's \"spend and borrow\" tendencies.\n\nLabour's problem, Ashcroft said, was the half of its supporters who now thought Labour's priority should be to stick to its principles and policies, rather than win elections.\n\nThis was one of the consequences of a heavy electoral defeat, Ashcroft said. \"Activists want to give their time, money and emotional energy for a cause they believe in, among people they agree with – and the more remote victory seems, the truer this is. The voters who have rejected them have also disappointed them, especially if they have gone back to the principal enemy; they do not yet have the appetite to try to woo such people back.\"\n\nCorbyn and his supporters, however, argue that he doesn't need to woo Tories. He will draw new voters to Labour from the many who gave up on same-same politics or didn't bother voting, especially the young. Young people were \"written off as an apolitical generation, when in reality they were a generation that politics had written off\", he said on Thursday. The Greens worry that their 1.2 million voters may return en masse to a Corbyn Labour party.\n\nCherub-faced Guardian columnist Owen Jones has been banging on for years from Labour's left wing, but even he didn't see the #JezWeCan bandwagon coming.\n\nHis immediate reaction to Corbyn's nomination was \"somewhere between nervousness and trepidation\", he wrote, because he thought any \"left\" candidate would be crushed and Labour would \"perform the last rites of the left, dismiss us as irrelevant and tell us to shut up forever\".\n\nBut in retrospect, he realises, \"the Corbyn surge is part of a general trend of political discontent bubbling across the Western world, manifesting itself in progressive ways but also reactionary ways, too: Podemos (in Spain), Syriza (in Greece, Bernie Sanders (USA), the SNP (Scotland), UKIP, the National Front (France), the True Finns, and so on\".\n\nBeyond his delight at being proven wrong, though, he's worried about the consequences.\n\n\"There is no doubt that the odds against a party led by Jeremy are formidable,\" he says. \"See those guns in the distance? Yeah, well we're running towards them.\"\n\nThe media campaign against a Labour Party led by Corbyn will be \"brutal and utterly unrelenting\", he predicts, \"far worse than anything dealt out to Ed Miliband, Neil Kinnock or Michael Foot. The Tories are currently compiling the mother of all dossiers to throw at him\".\n\nIn the end, of course, Corbyn may not even win the leadership. His opponents hope for \"Anyone But Corbyn\" tactical voting, and anyway UK pollsters were spectacularly wrong this year in picking the May general election.\n\nThe last official poll was on August 10 before Labour leader voting opened. Since then, every major Labour leader from the past three decades has warned against a Corbyn-led Labour, and the media have joyfully trawled through his long record, highlighting embarrassing out-of-context quotes and guilt by association (Private Eye magazine recently compiled an amusing list of Corbyn's measured answers manufactured into hyperbolic headlines).\n\nBut even if he falls short, Jeremy Corbyn will leave a heavy bootprint in British politics. The story first appeared on The Sydney Morning Herald.", "source": "Rouse Hill-Stanhope Gardens News"}