{"published": "2015-09-24T10:42:00Z", "media-type": "Blog", "title": "BetteBack Review November 27, 1991: Director’s scattered efforts weaken ‘For the Boys’", "id": "205ace09-be99-4e21-92ed-6e7011bbccd1", "content": "Doylestown Intelligencer\nNovember 27, 1991 “For the Boys,” an unapologetically sentimental tale, wears its heart on its sleeve the way an Army general wears medals on his chest. Director Mark Rydell gives the $50 million picture a first-class polish, but fails to infuse the 2 plus hour project with any get-up-and-go Like a Porsche with a lawnmower engine, “For the Boys” sputters across the screen, sometimes moving so slow that one almost expects to see the performers start to rust. Combining two feisty performers like Bette Midler and James Caan was inspired, but the broadbased script never fleshes out their characters Basically, “For the Boys” is a relationship picture where a viewer cares little about the totally unfocused relationship. The story follows the long-time partnership between Dixie Leonard (Midler) and Bronx-born Eddie Sparks (Caan), entertainers who come across as Burns and Allen with an edge. As the story begins, Sparks is a star on the order of Bob Hope, a talented comic and soft shoe specialist who devotes every hour possible to entertaining World War II troops. When Sparks needs a replacement for his USO show, the comic’s writer-friend, Art Silver (George Segal), suggests his talented niece Dixie, a woman with the bawdy humor of a burlesque comic and the sweet voice of an angel. Their initially uneasy relationship — need I tell you? — turns into a professional partnership, and “For the Boys,” which sometimes raises an anti-war sentiment but never explores it, follows Dixie and Eddie as they entertain through the Korean War and then in Vietnam. To his credit, Rydell creates some stirring moments, such as Midler singing “P.S. I Love You” during a World War II blackout and in a later scene when performing for battle-weary Americans in Vietnam Whenever she sings, Midler stops the film, making one wish she had vocalized more often For some reason, Rydell, whose credits include “The Rose” (also with Midler) and “On Golden Pond,” felt obligated to turn what’s basically a simple story into an epic motion picture. He throws in far too many elements, such as having Segal’s left wing Jewish character fired — on Christmas day, no less — by Caari’s Eddie during the “red scare” of the ’50s The scene is forced, unnecessary and contrived. The Vietnam sequences have some genuine sting, since Eddie Sparks fails to comprehend the craziness of that paralyzing war and — as he did in World War II — says to the soldiers, “I hear you’re mixing it up pretty good!” Their empty stares to his upbeat remark about killing an enemy they can’t even locate make it clear that Eddie’s time has come and gone.", "source": "BootLeg Betty"}