{"published": "2015-09-02T22:09:05Z", "media-type": "News", "title": "Universal Insurance Holdings, Inc. Announces Authorization of New $10 Million Share Repurchase Program", "id": "2b920b20-71aa-4e38-8ecd-8796c5e00e0c", "content": "SOURCE Universal Insurance Holdings, Inc.\n\nFORT LAUDERDALE, Fla. \n\n\"This share repurchase program underscores our confidence in our strategy, the long-term prospects of our business and our commitment to delivering value to our shareholders,\" said Sean P. Downes \n\nShare repurchases may be made by the Company from time to time in open market transactions at prevailing market prices and are subject to relevant rules under the Securities Exchange Act of 1934, as amended (Exchange Act). The Company will effect repurchase transactions in compliance with Rule 10b-18 under the Exchange Act and the Company's insider trading policy.\n\nAbout Universal Insurance Holdings, Inc.Universal Insurance Holdings, Inc., with its wholly-owned subsidiaries, is a vertically integrated insurance holding company performing all aspects of insurance underwriting, distribution and claims. Universal Property & Casualty Insurance Company (UPCIC), a wholly-owned subsidiary of the Company, is one of the leading writers of homeowners insurance in Florida \n\nForward-Looking Statements and Risk Factors\n\nThis press release may contain \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. The words \"believe,\" \"expect,\" \"anticipate,\" and similar expressions identify forward-looking statements, which speak only as of the date the statement was made. Such statements may include commentary on plans, products and lines of business, marketing arrangements, reinsurance programs and other business developments and assumptions relating to the foregoing. Forward-looking statements are inherently subject to risks and uncertainties, some of which cannot be predicted or quantified. Future results could differ materially from those described and the Company undertakes no obligation to correct or update any forward-looking statements. For further information regarding risk factors that could affect the Company's operations and future results, refer to the Company's reports filed with the Securities and Exchange Commission, including Form 10-K for the year ended December 31, 2014 \n\nInvestor Contact: \n\nAndy Brimmer \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/universal-insurance-holdings-inc-announces-authorization-of-new-10-million-share-repurchase-program-300137207.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "12 News Now"}