{"published": "2015-09-29T13:44:01Z", "media-type": "News", "title": "Pak vs Zim T20 'live' cricket score: Zimbabwe need 81 off 48 balls", "id": "21985f7b-e6bc-4258-984f-14fcc5b5bc19", "content": "OUT! Wasim claims his first wicket beating Mutumbami through the gate. Zim 24-4, 6.1 overs. \n\nRichmond Mutumbami b Imad Wasim 3 (9b 0x4 0x6) \n\nOUT!  A terrible mix-up results in Afridi and Maqsood combining to run out Ervine. Zim 16-3, 4.3 overs. \n\nCraig Ervine run out 1 (3b) \n\nOUT! Irfan has the last laugh as Mazakadza slashes a rising delivery to third man. Zim 15-2, 4 overs. \n\nHamilton Masakadza c Imran Khan b Mohammad Irfan 9 (14b 0x4 1x6) \n\nMazakadza brings up 1,000 runs in T20 cricket in style by clobbering giant Irfan for a maximum. \n\nOUT! Tanvir has struck in his second over trapping Chibhabha leg before. Ziim 7-1, 2.4 overs. \n\nChami Chibhabha lbw b Sohail Tanvir 3 (7b 0x4 0x6) \n\nPakistan innings \n \nAkmal clubs a six off the penultimate ball of the innings to steer Pakistan to 136-6 remaining unbeaten on 38 while Imad weighed in with 13. \n\nPanyangara and Jongwe claimed two wickets apiece. \n\nOUT! Afridi also perishes mistiming Panyangara straight to long-off. Pak 111-6, 17.3 overs. \n\nShahid Afridi c Williams b Panyangara 2 (2b 0x4 0x6) \n\nOUT! Jongwe strikes with a well disguised slower ball to dismiss Rizwan. Pak 106-5, 16.4 overs. \n\nMohammad Rizwan c Williams b Jongwe 16 (16b 1x4 0x6) \n\nAkmal attacks slamming two consecutive boundaries off Utseya. Pak 82-4, 12 overs. \n\nOUT! Pakistan are stuttering yet again with Maqsood trying to hit Utseya inside out only miscuing it. Pak 72-4, 11.2 overs. \n\nSohaib Maqsood c Chigumbura b Utseya 26 (25b 3x4 0x6) \n\nRizwan is quick off the blocks cutting Cremer with the ball running to the third man fence off a thick outside edge. Pak 71-3, 11 overs. \n\nOUT! Cremer gets a breakthrough as Malik going for a big one fails to clear long-on. Pak 64-3, 10.3 overs. \n\nShoaib Malik c Sikandar Raza b Cremer 15 (13b 2x4 0x6) \n\nMalik swings Utseya for his second boundary as Pakistan step up the tempo. Pak 63-2, 10 overs. \n\nMalik gets going glancing Cremer to fine leg for a boundary. Pak 54-2, 9 overs. \n\nJongwe takes the big wicket of Hafeez who clips the ball to midwicket. Pak 34-2, 6.2 overs. \n\nOUT! Mohammad Hafeez c Utseya b Jongwe 17 (18b 3x4 0x6) \n\nMaqsood gets into his stride cracking Raza through the covers for a boundary. Pak 33-1, 6 overs. \n\nOUT! Panyangara draws first blood as Shehzad slices a loose ball straight to Cremer at point. Pak 24-1, 3.5 overs. \n\nAhmed Shehzad c Cremer b Panyangara 7 (9b 1x4 0x6) \n\nHafeez hits the first boundary of the match swinging a short ball from Chibhabha to backward square leg. Pak 6-0,1 over. \n\nAfridi has won the toss for the second time in a row and has not hesitation in batting first. \n\nZimbabwe are unchanged while for Pakistan, Hafeez and Mohammad Irfan come in for Mukhtar Ahmed and Wahab Riaz. \n\nTeams \n\nZimbabwe: CJ Chibhabha, Sikandar Raza, H Masakadza, CR Ervine, SC Williams, E Chigumbura, R Mutumbami, LM Jongwe, P Utseya, AG Cremer, T Panyangara \n\nPakistan: Ahmed Shehzad, Muhammad Hafeez, Shoaib Malik, Umar Akmal, Sohaib Maqsood, Shahid Afridi, Imad Wasim, Mohammad Rizwan, Mohammad Irfan, Sohail Tanvir, Imran Khan jr \n\nPreview \n\nPakistan will aim to seal the two-match T20 cricket series against hosts Zimbabwe when they face off at the Harare Sports Club on Tuesday. \n\nThe visitors held their nerve to win the opening match on Sunday by 13 runs, defending a modest total of 136 thanks to left-arm Imad Wasim heroics. \n\nThe 26-year-old Wasim finished with figures of 4 for 11 from four overs, and was named man of the match having also contributed 19 runs from just 12 balls. \n\n“The batsmen need to take up their responsibility,” said Pakistan captain Shahid Afridi after Sunday’s victory. \n\n“The bowlers used the pitch, and I am very happy with the bowlers, especially Imran Khan in that last over.” \n\nPakistan slumped to 29 for three early in their innings as seamer Chamu Chibhabha grabbed three wickets in six deliveries. \n\nAfridi even backed Imad to eventually replace spin ace Saeed Ajmal in the side. \n\n“Imad displayed some extraordinary skill and he can be an alternate to Ajmal,” said the skipper. \n\nDefeat for Zimbabwe means they have now failed to beat Pakistan in eight T20 internationals. \n\n“We just lost too many wickets at the end,” Zimbabwe captain Elton Chigumbura said in the post match conference. “We have come close on many occasions but we keep on losing. \n\n“I’m not going to sit here and make excuses, at the end of the day we were chasing 137 and, despite how well they bowled and how well their spinner [Imad] bowled, it’s just a score that you need to get. We were supposed to get that score, with the kind of players we have.” \n\nread more", "source": "UAE NewsApp.com"}