{"published": "2015-09-07T08:13:31Z", "media-type": "News", "title": "Internal Communications Solution DeskAlerts Rolls Out Version 8.0.8.27", "id": "35921b1f-a5ba-4e27-a45d-d82892bdae56", "content": "Company News: Page (1) of 1 - 09/07/15     print\n\t    \tpage          (September 07, 2015) \n (PRWEB)  September 07, 2015  \n\nThe internal communications solution , DeskAlerts has confirmed the roll out of version 8.0.8.27 today. The latest generation version of the service marks a major milestone with the official inclusion of the ground breaking DeskAlerts cloud service. \n \nAnton Vdovin, Project Manager at DeskAlerts said Were delighted to roll out this latest version of DeskAlerts, which is part of our regular scheduled updates. We are particularly proud of this particular issue of the system as it includes the cloud version of our corporate communications product. \n\nWe feel that a cloud-based service is a strategic addition to DeskAlerts, giving users even more control over how and where they use the service for internal communications. It is a perfect fit for DeskAlerts and an asset along similar lines as our mobile apps. \n\n \nThe DeksAlerts cloud solution which is debuting in version 8.0.8.27 allows existing DeskAlerts users to deploy their own version of the corporate communications software on DeskAlerts own services. The cloud version will be migrated to cloud.deskalerts.com, offering secure, convenient access from any device, on any operating system and in any geographical location. \n \nCarefully developed over a number of months, DeskAlerts Cloud has a user-friendly interface, with a premium placed on ease of set up. For users wanting to create their own DeskAlerts server in the cloud, the process is no more complex than entering their own corporate email address and hitting the log in button. If a server hasnt yet been set up, a streamlined interface does the job in a few minutes, with no technical or coding know how required. Once the server is set up, users log in as usual with their existing DeskAlerts credentials and are directed to their own corner of the cloud right away. \n \nA number of other performance improvements have also been squeezed into this scheduled August update, including a series of enhancements which have been introduced to speed up the service itself. These include the unveiling of a new, optimized dashboard calendar and campaign area. \n \nIn addition to the launch of the DeskAlerts cloud service, many existing tools and functions also benefit from performance boosts, giving an overall quicker and ever more streamlined experience. \n \nVersion 8.0.8.27 of DeskAlerts follows hot on the heels of another launch, that of the newest DeskAlerts iOS app.  Version 3.0 of the app went live in the  App store earlier this week with a raft of changes and improvements. Most notable of these advances was a better, more intuitive interface. Other changes included enhanced functionality and a series of fixes to make the app faster and smoother than ever. \n \nUsed by businesses large and small across a growing number of industries, DeskAlerts can be accessed online, via the cloud and through the app. It makes access to a number of powerful internal communication tools easy through the web, in the office or on the move. \n \nTo sign up for a free trial of the latest DeskAlerts software release and to experience version 8.0.8.27, go to: http://www.alert-software.com/demo/ \n \nAbout \n \nDeskAlerts is the alert software that works in technologically and geographically diverse networks. It is a completely web-based solution that can be used to send desktop alerts and news updates to any employee within your organization, improving communications and productivity with a more efficient communication strategy than traditional email alone. View the DeskAlerts video to find out more. \n \nRead the full story at http://www.prweb.com/releases/2015/09/prweb12940743.htm . \n \nPage: 1  \n \nRelated Keywords: \n\nSource:PRWEB.COM Newswire.\n All Rights Reserved", "source": "Creative Mac"}