{"published": "2015-09-16T17:20:41Z", "media-type": "News", "title": "Tom Brady: Rex Ryan's Buffalo Bills defense 'pushed around' rival Indianapolis Colts", "id": "31aed840-d4c5-4303-a9ab-a018e296dad4", "content": "FOXBOROUGH -- Tom Brady is getting ready for one of his biggest rivals, a Rex Ryan-led Bills group that just dominated another New England Patriots rival, the AFC-favorite Indianapolis Colts. \n \nWhile discussing his prep for Ryan's defenses, which have held Brady to an 88.9 passer rating (his career rating is 96.1) , Brady took a subtle jab at the Colts. \n \n\"You can expect the worst and expect the loudest and that's what we practice when we're out there,\" Brady said in regards to the Bills' stadium noise. \"(Coach Belichick) tries to make it harder for us in the game. Not really being able to hear anything, it just requires a lot of non-verbal communication -- everyone being on the same page, knowing your calls, knowing your assignments.\" \n \n\"Being able to work on things that we're doing really well so we can go out there and play confidently,\" Brady continued. \"If you don't play that way, you get really defensive as an offense. I think the Colts, they got really, they got pushed around.\" \n \nAndrew Luck completed just 53.1 percent of passes a week ago in Buffalo, throwing two touchdowns and two interceptions. His 63.6 passer rating was the 13th-worst of his career. \n \n\"I think (Ryan) tries to play to the strength of the players,\" Brady said. \"I think he tries to give those guys a chance every week, and that's all you can ask for as a coach -- to put the guys in the best position they can to take advantage of opportunities and make the plays, and not put them in the position where they can't do the things the coaches ask them to do. That's probably our philosophy on offense, too...You develop a style and rhythm, and you try to keep teams off balance by scheme and how you run certain plays, and you complement one play with the next. And I think that's how he plays defense. He complements one scheme with another, makes it hard to (identify) what you're looking at.\"", "source": "MassLive"}