{"published": "2015-09-15T06:52:21Z", "media-type": "News", "title": "Suspect in fatal shooting at Mississippi campus kills himself -Reports", "id": "971fde0c-1be6-4d1c-959f-7970b75e8f37", "content": "The killing was the latest in a series of similar events on US college campuses in recent weeks, including deadly incidents at Sacramento City College in California, Texas Southern University and Georgia's Savannah State University. \n    Shannon Lamb  Reuters     \nA man suspected of gunning down a Mississippi college professor in his campus office has died of a self-inflicted gunshot wound after a day-long manhunt, media reports said on Tuesday. \n \nThe killing was the latest in a series of similar events on US college campuses in recent weeks, including deadly incidents at Sacramento City College in California, Texas Southern University and Georgia's Savannah State University. Shannon Lamb, a social science instructor at Delta State University, killed himself after being cornered by police as they tried to initiate a traffic stop, the Jackson Clarion Ledger and WALA-TV reported. \n \nThe reports, which cited the Greenville Police Department and the Washington County Sheriff's Department, could not immediately be independently confirmed by Reuters. \"Suspect apprehended,\" university president William N. LaForge tweeted early on Tuesday, but university officials were not immediately available to clarify the comment. \n \nLamb was being sought for the early Monday killing of Ethan Schmidt, an assistant professor of American history at Delta State, as well as the earlier shooting of Amy Prentiss in Gautier, a town 300 miles (480 km) away, authorities have said. \n \nThe Cleveland, Mississippi shooting left students and staff at the school on edge for several hours as police locked down the campus and searched buildings following reports of active gunfire. Schmidt's colleagues said they could not speculate on the motive for his killing. \n \nDelta State officials said no students were injured in the shooting in Jobe Hall, home to the university's division of social sciences and history. (Reporting by Victoria Cavaliere; Editing by Clarence Fernandez)", "source": "DNA India"}