{"published": "2015-09-16T08:04:06Z", "media-type": "News", "title": "Pragma Selects smartTrade Technologies for FX Aggregation Software", "id": "41e2413f-c2ed-449e-aa48-44546da686e0", "content": "Pragma Securities, an independent provider of quantitative trading \n      technology, has selected smartTrade Technologies, a global leader of \n      multi-asset end-to-end trading solutions, to provide Pragma with an FX \n      liquidity aggregation platform. \n \nPragma 360 FX is Pragma’s flagship algorithmic trading platform, \n      providing banks and buy-side firms with customized, high-performance \n      Spot FX algorithmic trading as a pure technology solution. \n \nsmartTrade’s expertise in providing proven trading solutions for the FX \n      market was a key factor for Pragma in selecting LiquidityFX. \n      LiquidityFX's large library of connectors and smartTrade’s agility in \n      responding to Pragma’s requirements for customization allowed Pragma to \n      offer its customers liquidity aggregation with a wide range of FX \n      liquidity providers with quick time-to-market. \n \n“smartTrade’s LiquidityFX offering is impressive, and its flexible \n      components allow us to meet the needs of clients who prefer us to \n      provide them with liquidity aggregation as well as algorithmic trading \n      logic. The fact that smartTrade provides a pure technology solution that \n      we can host and manage as an integrated part of our offering was \n      essential to us,” commented David Mechner, Chief Executive Officer of \n      Pragma  Securities . \n \n“We are excited to help Pragma grow their FX business. Our \n      out-of-the-box and agile LiquidityFX solution allowed for a seamless \n      integration and their clients can now benefit from an unparalleled low \n      latency connectivity to a large range of FX liquidity providers \n      including ECNs, banks, and non-banks,” commented David Vincent, Chief \n      Executive Officer of smartTrade Technologies.  \n \n About Pragma Securities  \n \nPragma is an independent quantitative trading technology provider \n      specializing in algorithmic trading solutions for Equities, Futures and \n      Spot FX. Pragma has a strong track record working with large scale, \n      complex global organizations since its founding in 2003. \nFor more \n      information please email sales@pragmatrading.com  \n \n About smartTrade Technologies  \n \nFounded in 1999, smartTrade is a global leader in sophisticated \n      cross-asset Liquidity Management Systems, supporting Foreign Exchange, \n      Fixed Income, Equities and Commodities. smartTrade works with a variety \n      of clients ranging from tier 1 banks to broker-dealers, buy-side, \n      regional and private banks, as well as retail institutions who leverage \n      smartTrade’s technology across their global electronic trading \n      platforms. smartTrade’s agile multi-asset end-to-end trading solutions \n      are based on a number of modular components which can be used either \n      standalone or combined to provide Connectivity, Aggregation, Smart-Order \n      Routing, Matching/Internalisation and Distribution. \n \nsmartTrade also offers end-to-end trading solutions for Foreign Exchange \n      and Fixed Income. These solutions, LiquidityFX and smart-FI , \n      are available as software only or fully managed/hosted, taking advantage \n      of smartTrade’s private cloud. For more information, visit www.smart-trade.net . \n \n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150916005050/en/ \n\nCopyright Business Wire 2015 \nSource: Business Wire\n\t\t\t\t(September 16, 2015 - 4:00 AM EDT) \nNews by QuoteMedia \nwww.quotemedia.com", "source": "InvestorPoint.com"}