{"published": "2015-09-20T14:15:59Z", "media-type": "News", "title": "Sarnia woman who hid fentanyl in her vagina gets two years in prison", "id": "8aa10ea6-e622-41ae-bfb0-73cfb3d5449a", "content": "A Sarnia woman could have killed herself by hiding fentanyl patches internally, says the judge who sentenced her to two years in prison. \n \nNicole Marie Janson, 30, previously pleaded guilty to the July 9, 2013 possession of fentanyl for trafficking but sentencing was delayed until Friday in Sarnia Superior Court. \n \nJanson had been caught with 34 fentanyl patches worth $6,400 in her vagina. \n \n“You could have killed yourself,” said Superior Court Justice Steven Rogin. \n \nFentanyl, a painkiller 20 times more powerful than heroin, has been responsible for 12 deaths in Sarnia-Lambton during the past two years, said federal prosecutor Michael Robb during his sentencing submissions. \n \nThe drug is a prescription painkiller administered through a patch applied to a person's skin so it can be absorbed slowly. Fentanyl addicts modify the patches so they can be chewed, smoked or made into an injectable solution. \n \nUneven distribution of the drug on a patch is factor in overdose deaths. When the patch is cut into strips to be burnt so the smoke can inhaled, there is the potential to get a lethal dose. \n \nPrior to Janson's 2013 arrest, Sarnia police had placed a tracking device on a vehicle in the belief a man was driving to London to get fentanyl. Janson was a passenger. \n \nThe vehicle was driven to Woodstock for a four-minute stop before heading back to Sarnia. \n \nPolice started surveillance as the vehicle neared Sarnia, but it is believed the officers were spotted. \n \nJanson threw a used tampon from the vehicle as she was moving about in the vehicle. \n \nAt a hospital she removed a bag with 34 patches. \n \nJanson also had $1,000 in her purse. \n \nThere was a joint sentencing submission by Crown and defence lawyers for a two-year sentence to be served in a penitentiary. \n \nThe nature of fentanyl “ups the ante” regarding custody and if another drug had been involved penitentiary time would likely not have been considered, said defence lawyer Ken Marley. \n \nJanson had one prior conviction for drug possession and was not the main player in the July 2013 incident. Janson was under pressure by the driver to hide the fentanyl, the court was told. \n \nThe vehicle's driver was sentenced to 42 months. \n \nThe prison time is a opportunity for Janson to get serious about addiction treatment, said Robb. \n \nAddiction treatment is available in penitentiary. \n \n“I am not a criminal. I am a drug addict who needs help,” said Janson. \n \nAn addiction is an illness but Janson did something criminal, said Rogin who wished her luck with her treatment. \n \nA 10-year weapons ban was imposed and Janson must give police a DNA sample. \n \nneil.bowen@sunmedia.ca", "source": "Fort Erie Times"}