{"published": "2015-09-30T17:14:00Z", "media-type": "News", "title": "London's big associations poised to sign up to NHF's Right to Buy Deal", "id": "873ba379-77de-44b5-acb0-0fba7d83a4b6", "content": "London’s largest housing associations are set to support the National Housing Federation’s deal on extending the right to buy to housing association tenants but several smaller organisations have rejected the proposal. \n \nBut several smaller organisations have already said they will reject the offer , which associations must vote on by Friday. \n\nThe chair of the G15 group of London’s largest associations, David Montague, said the group’s members were signed up to the deal “in principle”. \n\nThe G15 also said it would work with the capital’s local authorities to ensure there is no loss of housing as a result of the deal. \n\nMr Montague, who is also chief executive of L&Q Group, said the G15, housing associations and local authorities in London needed to work together to decide how to replace the homes sold. \n\nWhen asked whether the homes sold could be replaced with social rented housing, he said:  “What we need to do next is have a conversation with local authorities about what is needed. There is no point building one tenure for the sake of it. We should stand back and ask ourselves what is needed and re-provide on that basis. If social housing is needed, that is what we should prioritise.” \n\nThe G15’s published statement promised the organisation would work with London boroughs to ensure there is no loss of social housing; that each housing association home sold under the right to buy would be replaced and that the G15 would build 93,000 new homes in London and the south east over the next 10 years. \n\nAsked whether it would be feasible to replace each home sold with another in the same borough, Mr Montague said: “It will be easier in some boroughs than others, which is why we need a London-wide discussion on this. There are very difficult questions that need to be addressed. If we lose homes in Kensington and Chelsea and Westminster and Wandsworth nobody would pretend those homes are easy to replace. We have to ask ourselves whether affordable housing will need to be provided in more affordable places. \n\n“If there is little or no grant and rents are reducing, we will have to answer  those difficult questions but we can only provide for London’s housing needs if we work together.” \n\nA number of London boroughs had hit out at the NHF’s Right to Buy deal. Islington, Lambeth and Hackney wrote to local housing associations asking them not to vote for it. \n\nMatthew Bennett, cabinet member for housing at Lambeth Council, wrote to the NHF’s chief executive David Orr to express his “outrage” at the “backroom deal” which he said would require Lambeth to sell over 120 homes a year to fund the replacement homes and housing association tenants’ discounts. \n\nIn reply, Mr Orr said he was confident that homes sold could be replaced on a one for one basis nationally and at a higher rate in London. He added that the NHF had “never advocated” that the policy be paid for through the sale of local authority property. “How this proposal is paid for is matter for the government,” he wrote.  \n\nThe government’s proposal was that councils sell high value properties in order to ensure housing associations were paid the full market value for their properties and to replace properties sold.   \n\nThe NHF’s offer document makes little mention of sales of council property apart from saying it expects the government to ensure “the cost of sales does not exceed the value of receipts received from the sale of high value council assets”. It does not suggest any other ways in which the government could fund the Right to Buy extension. \n\nThe offer document also said homes would be replaced on a one for one basis nationally. The replacements do not have to be in the same areas as the homes sold, although the NHF recognised that some organisations would want to replace homes sold locally. It also said the definition of a replacement was broad including starter homes, shared ownership and other part-buy part-rent models. It could include buying homes on the open market or bringing empty homes into use rather than solely building new properties. \n\nA number of associations have said they will reject the deal including Redkite and Hastoe. \n\nIn a statement, Redkite’s chairman Jennie Ferrigno, said there had been insufficient discussion and transparency around the deal.  She hit out at the way the NHF had handled the deal and said her organisation would be reviewing its membership. She added: “Working with Government should be in the form of a true partnership, yet agreeing to a deal as a result of a threat does not bode well for the future. We have a legislative process where unfair or contentious proposals can be debated and challenged and some sections of our democratic process have expressed the desire to do just this. We must think carefully on these broader issues, or we risk damaging the reputation of our sector.” \n\nThe G15’s members are: A2Dominion Group; Affinity Sutton; AmicusHorizon; Catalyst Housing; Circle; East Thames Group; Family Mosaic; Genesis Housing Association; The Hyde Group; L Metropolitan; Network Housing Group; Notting Hill Housing; Peabody; Southern Housing Group.", "source": "Social Housing Magazine"}