{"published": "2015-09-28T22:48:46Z", "media-type": "News", "title": "Howell (1) at Freehold Township (0) - Girls Soccer", "id": "e99ed1b5-016e-4484-9952-851357c6e143", "content": "REEHOLD -- Jessica O'Brien's biggest responsibility on Monday afternoon was to keep one of the biggest goal-scoring threats in New Jersey off the board. \n\nBut it was O'Brien's offensive play that turned the game around. \n\nO'Brien shut down Rutgers commit Nicole Whitley, but her steal and ensuing through ball to forward Betty Feinstein in the 65th minute sent Howell to a stunning 1-0 win over Freehold Township, No. 18 in the NJ.com Top 20, in a typical Shore Conference showdown. \n\nFeinstein took O'Brien's pass along the right side of the box and slipped the only goal of the game past Freehold Township keeper Kaela Chadziutko and inside the left post to give Howell its fourth straight win since starting the season 1-2. \n\n\"We knew we had to mark up on Whitley, so we marked her 1-on-1 and everyone else just had to play tough D,\" Howell coach Courtney Bonura said. \"We knew we could muscle it out against them. We were fortunate enough to get the through ball that we capitalized on.\" \n\nFreehold Township controlled possession throughout the game and had a number of chances in the contest, but Howell's back line -- led by Penn State commit Rebecca Hamilton -- never let Freehold Township find the back of the net. Rebels goalkeeper Rachel Kern made 11 saves, six in the second half, to earn the shutout. \n\n\"It felt really good because I know a lot of people on that team, I know how they play,\" Feinstein said. \"I know a lot of people on Township usually step up. I was happy that through ball was there, and the goalie wasn't able to get down fast enough to stop my shot to the bottom left. So that's where I placed it.\" \n\nHowell nearly took the lead in the 30th minute, when Feinstein fed forward Sierra Enea, but Chadziutko made the diving save. Whitley countered with a strong chance in the 32nd minute, but her shot was spiked wide of net. \n\nLaura Noseworthy, after making a couple of moves to slip behind Howell's defenders, found herself in alone in the 61st minute, but Kern kicked out her left leg to keep the ball in front of the goal line and preserve the shutout. \n\nSince starting the season 5-0, Freehold Township has gone 0-1-1 in its last two games after a 1-1 tie with Freehold Borough and its first loss of the season to Howell. \n\n\"Coach Bonura had a good game plan, she really dug in tight defensively,\" Freehold Township coach Dave Patterson said. \"While they were allowing us to posses, we were having trouble turning that into quality opportunities. We did outshoot them, but we knew their plan was going to be to counterattack. They caught us once.\"", "source": "Star Ledger"}