{"published": "2015-09-01T15:09:50Z", "media-type": "Blog", "title": "Fields Are Fertile For Now, But Marchionne Has a Long View", "id": "3c8d7f01-ec43-4764-b779-a7f7eb938c40", "content": "Farmers are the ultimate craftsman when it comes to small-scale production. The level of management needed to stay competitive and above the high water line is, simply put, astounding. Consolidation in certain areas of agriculture has lead to factory farming, the widespread adoption of automation and genetically modified seeds that keep seed producers competitive. Private farmers are constantly at war with the market and their own budgets. \n \nThe agriculture industry has wholly transformed itself over the last 100 years. The automotive industry, which has only really existed for that same period of time, has seen similar levels of change. We are now building more cars, trucks, SUVs, crossovers, trikes and quadracycles than ever before, just like we are growing more food than we’ve ever seen in human history. \n \nBut, there’s one major stumbling block ahead — and Sergio Marchionne sees it. \n \n\n \nMarchionne, at this point in his tenure as CEO of one of the largest automobile manufacturers in the world, is a farmer with a cliff-side plot of land. He’s also the only farmer in his town with a massive debt bill to pay and no cash on hand to clear the ledger . \n \nThe reality of farming is, at the point of sale, the vast majority of consumers couldn’t care less where their produce is grown. On a macro level, produce buyers will purchase strawberries in the middle of winter, even if they are grown in Mexico. Locally, during in-season months, as long as those strawberries are juicy and ripe, produce buyers don’t check the label to figure out where they were grown. Sure, there are those who buy organic, gluten-free options at the grocery store — and they are a statistically significant in their numbers to deserve a whole aisle devoted to their tastes — but the rest of us are completely apathetic. \n \nThe same goes for cars. \n \nCar enthusiasts — us folks who write, comment, drive, wrench on, wash and generally love our cars — are one percent of the overall consumer market. The other 99 percent of people are totally agnostic to the efforts of automotive research, engineering, manufacturing and branding, with a few exceptions for those who want to “Buy American!” or some other loyalties of varying degrees. Enthusiasts do buy a very specific type of product, and automakers are more than willing to provide those products to the degree they are demanded on the market, but we still only get a single aisle in a vast dealer lot. \n \nCorn enthusiasts, if there is such a thing, might see the agriculture industry thusly: \n \n“The General Farms corn stays fresh much, much longer than the new American-Italian corn from Marchionne Farms,” a connoisseur of corn might say. \n \n“But, the Marchionne Farms’ Hellcat Corn  tastes better ,” an equally loyal corn enthusiast might rebuff. \n \nThe other 99 percent of corn buyers are, well, not talking about corn. They don’t care where it comes from. They don’t care who made it. They look at the corn in the produce aisles, figure out the best deal for their needs, and buy the corn that makes the most sense — a combination of number of ears of corn and how much it costs. All the while, corn enthusiasts are trying to push their corn consuming friends one way or another. Sometimes they succeed in their suggestions, but not enough to make a real market impact. (See: SKYACTIV Corn.) \n \nStanding at the cliff’s edge of his farm, Marchionne — with a hefty bank note on his mind — has an epiphany: Why am I spending all this money growing different corn than my neighbor? The components of corn — the cob, kernels and the way it’s packaged — are essentially the same. How you dress it up and sell it, that’s the only real difference! \n \nBut, it isn’t the sameness of corn — or automobiles — that’s the real issue here. \n \nIn probably a distant future, we aren’t going to need corn. We will plug some instructions into a machine, a whirring sound will emanate, and a meal will be replicated for consumption. You won’t need to own the food replicator. Instead, you will pay a fee to use it that’s magnitudes less than the current cost of food. The farm as we know it will be a thing of the past. \n \nAutomakers are staring down the barrel of a similar fate. \n \nGoogle and automakers themselves are developing fully autonomous vehicles to be used by the masses. Their solutions are similar to the food replicator of the future: plug in a destination, a whirring sound will emanate and you’ll arrive at your destination. You won’t need to own the autonomous car of the future. Instead, you will pay a fee to use it that’s magnitudes less than the current cost of personal transportation. The car as we know it will be a thing of the past. \n \nThe autonomous car is the ocean lapping against the cliff’s edge, slowly — but with increased intensity — swallowing Marchionne’s farm. \n \nNow, please, don’t get me wrong. I am in no way saying that the things we love — cars as we know them today — will be gone next year or even in the next 20 years. There might be a few companies still catering to the enthusiast, offering cars as artisanal luxury good for those of us who enjoy the speed and knowledge needed to pilot just such a machine. But the days of the automobile as a privately owned consumer necessity are numbered. Those who enjoy the act of driving will be the gasoline-fed hipsters of tom0rrow. \n \nMarchionne, I assume, knows this. The day his farm is  needed is coming to an end. But not today. Today there’s corn to grow and money to be made, and he’s looking at his neighbor at General Farms that grows the same crop. \n \nFarmer Barra, let’s grind some corn together, shall we? \n \nThe post Fields Are Fertile For Now, But Marchionne Has a Long View appeared first on The Truth About Cars .", "source": "The Truth About Cars"}