{"published": "2015-09-07T19:59:44Z", "media-type": "News", "title": "China stock rout delaying market links with Hong Kong, HKEx says", "id": "214d3928-ecb2-4950-965a-d7284b15be10", "content": "g market links with Hong Kong, HKEx says \n \nChina’s stock rout is hampering efforts to link mainland markets to the rest of the world via Hong Kong, said Charles Li, who runs the city’s bourse operator. \n“Psychologically, this is not the time to talk a lot about mutual market access when you’ve just put out a fire,” Hong Kong Exchanges & Clearing Ltd. Chief Executive Officer Li said at a conference in Singapore yesterday. “You’d want to calm down, figure out how to clean up and then move forward.” \nMore than nine months after the start of a trading link between equity markets in Hong Kong and Shanghai, investors are still waiting for news on when a similar program with Shenzhen will begin. Hong Kong Exchanges shares have tumbled 43 percent from their May peak as optimism waned that the connect would boost turnover and revenues. \n“Sentiment in mainland markets needs to get better” before regulators will consider setting a start date for Shenzhen, said Sam Chi Yung, a strategist at Delta Asia Securities Ltd. in Hong Kong. “If the sentiment on the A-share market is not good, people may not be too interested if they launch the program now.” \nHong Kong’s benchmark Hang Seng Index is down 21 percent this quarter, the worst performer among major developed markets tracked by Bloomberg. The Shanghai Composite Index has fallen 25 percent in the same span, and almost USD5 trillion has been wiped off mainland markets since a mid-June peak. \nHKEx Chairman Chow Chung Kong said in April the bourse planned to announce the start date of the Shenzhen-Hong Kong stock link in the first half of this year after a similar program began with Shanghai last November. Technical work has been completed and HKEx is now waiting for regulatory approval, Li said last month. Jasmine Ng and Kana Nishizawa , Bloomberg", "source": "Macau Daily Times"}