{"published": "2015-09-18T13:32:57Z", "media-type": "News", "title": "Crude Oil Pressures Ethanol", "id": "a918c4ce-a881-4fd5-83bc-e640358628cc", "content": "(Page 1 of 2) \nOMAHA (DTN) -- It has become the question of the day for U.S. ethanol producers: What happens to the industry if crude oil prices continue to tumble? \n \nLower corn prices are good for ethanol producers; lower gasoline prices at the pump, not so much. (Photo courtesy of Matt Merritt at Poet) \n\nCrude oil prices fell below $39 a barrel Monday for the first time since 2009, just ahead of the end-of-the-summer driving season and expected lower demand for gasoline to come. \n \nThough the price of crude oil is one of many factors ethanol producers watch -- along with the price of corn and other feedstocks -- to produce ethanol, a major impetus for the passage of the Renewable Fuel Standard in 2005 and an even more aggressive RFS in 2007 was the steady rise in crude oil prices that peaked at around $145 a barrel in 2008. \n \nDonna Funk, certified public accountant with K-Coe Isom in Lenexa, Kansas, who works with more than 10 ethanol plants, said producers are closely watching the crude market along with the current corn crop. \n \n\"Yes, ethanol plants I talk to are definitely feeling the squeeze in margins,\" she said. \n \n\"Financial results definitely vary depending on the location of the plant and the corn basis they are experiencing. I think producers are obviously watching crude, corn and gasoline prices daily as well as imports. I don't think they watch just crude prices as ethanol prices do not always follow crude directly. Commodity pricing can be as big a factor as crude prices if corn gets low enough, then crude can stay low.\" \n \nFunk said ethanol producers are keeping a close eye on their production volumes and commodity prices with harvest approaching. \n \n\"I think a lot of plants are focused on what they can do today with available cash, financing, etc., to distinguish themselves from a traditional corn starch ethanol plant so that they are in a different place in a year or so,\" she said. \n \nIf crude, gasoline and ethanol prices continue to slide and demand doesn't increase, \"I think it is almost certain we will see plants slow down even more or shut down; this could also lead to more consolidation in the market,\" Funk said. \n \nMARGINS NARROW \n \nEthanol margins in the past month or two already have been narrow to negative based on DTN's hypothetical ethanol plant. \n \nA bump in corn prices Monday pushed production costs at the hypothetical Neeley Biofuels ethanol plant higher, resulting in a net loss of 2.4 cents per gallon. The hypothetical plant is used to measure how changes in commodity markets might affect actual plant margins. \n \nDTN Analyst Rick Kment said margins have been hovering around breakeven for the past month or so. \n \n\"The fact that corn prices are still well manageable with the national cash index value for corn under $3.50 is easing production costs and allowing plants to stay at breakeven or profitable levels even with lower gasoline and crude oil prices,\" he said. \"Even though crude oil prices have moved below $40 per barrel, the softness in gasoline prices has helped at least temporarily to maintain firm demand support across the country, allowing prices to stabilize.\" \n \nEthanol futures still are trading at a discount to the RBOB gasoline market, he said, \"Although the current discount is the narrowest level since January 2015.\" \n \nIf ethanol prices move to a premium to gasoline for a long period of time, Kment said, some moderate demand pressure is likely and could limit plant and product margins.", "source": "Progressive Farmer"}