{"published": "2015-09-02T06:46:43Z", "media-type": "News", "title": "F-16s scrambled when model threatens to bring down jet after crew take her cat", "id": "a107fc37-e2be-4982-bde2-d6a5289eca91", "content": "Fighter jets were scrambled and an airliner diverted after a passenger who snuck a cat on board the flight became unruly. \n\nUS fighter jets were scrambled and an airliner diverted after a European model who sneaked a cat on board the flight became unruly.\n\nThe passenger, reported by The Denver Post \n\nReports said the woman had the cat in her purse when she boarded the Condor Airlines Boeing 767 flight from Las Vegas to Frankfurt.\n\nCabin crew decided to put the cat in a toilet, at which point the woman became enraged and punched a female flight attendant in the face.\n\nPassenger Dashenka Giraldo told ABC News in the US: \"She said that she was part of the Mafia and that the mafia follows her around the world and that she was able to bring the plane down if that needed to be the case if she couldn't see her cat.\"\n\nFollowing the threat, the pilot alerted authorities and two F-16 fighter jets were scrambled from Buckley Air Force Base in Colorado.\n\nThe incident happened over Wyoming about 6pm on Friday (local time).\n\nPassenger Fritz Peterson told CBS: \"That lady wasn't happy with the crew putting their cat in the lavatory and then everything went wrong. She started screaming and shouting in the back.\"\n\nA Condor spokesman said it had not been possible to continue with the flight, so the plane was diverted to Denver International Airport, where it landed safely, escorted by the F-16s.\n\nPassengers were put in hotels in Denver for the night, with the flight resuming the next day.\n\nThe FBI said it decided the disturbance was a customer service issue, and was not life-threatening.\n\n\"The airline handled the matter according to their policy for customer service related matters. No arrest was made.\"\n\nHowever, CBS and Denver Post reported that Hucikova was in immigration detention for overstaying a visitor's visa.\n\nCBS said that one online posting said she called Las Vegas her home.\n\nApparently the cat is in federal custody.\n\nStuff.co.nz The story first appeared on The Sydney Morning Herald.", "source": "Wagga Wagga Daily Advertiser"}