{"published": "2015-09-24T00:19:07Z", "media-type": "News", "title": "Donald Trump Boycotts Fox News for Treating Him \"Very Unfairly\"", "id": "13c78cdc-950c-4a2c-8d28-d1ba5d8792e4", "content": "Don't expect to see Donald Trump doing interviews on Fox News anytime soon. On Wednesday, he announced via Twitter that he won't be visiting the network since they have been treating him \"very unfairly,\" apparently by not letting him control the coverage. \n. @FoxNews has been treating me very unfairly & I have therefore decided that I won't be doing any more Fox shows for the foreseeable future.— Donald J. Trump (@realDonaldTrump) September 23, 2015 \nIn response to his public denouncing of Fox programs, Fox News released a statement to Entertainment Weekly that accused the press of giving Trump the attention he wants rather than shedding light on Trump's actions. \"At 11:45 a.m. [Wednesday], we canceled Donald Trump's scheduled appearance on The O'Reilly Factor on Thursday, which resulted in Mr. Trump's subsequent tweet about his 'boycott' of Fox News,\" the statement reads. \"The press predictably jumped to cover his tweet, creating yet another distraction from any real issues that Mr. Trump might be questioned about. When coverage doesn't go his way, he engages in personal attacks on our anchors and hosts, which has grown stale and tiresome. He doesn't seem to grasp that candidates telling journalists what to ask is not how the media works in this country.\" Stephen Colbert apologizes (sincerely) to Donald Trump on The Late Show Trump's issue with the network began after the first Republican primary debate, when he deemed that moderator Megyn Kelly was \"unfair\" by asking him about past things he has said about women. He later told CNN's Don Lemon that Kelly had \"blood coming out of her eyes... blood coming out of her wherever\" when questioning him. This week Trump took to Twitter to declare that Kelly was \"highly overrated\" and added that Bill O'Reilly features \"the same old Trump haters\" on The O'Reilly Factor . \n. @oreillyfactor was very negative to me in refusing to to post the great polls that came out today including NBC. @FoxNews not good for me!— Donald J. Trump (@realDonaldTrump) September 22, 2015 \n\n. @oreillyfactor , why don't you have some knowledgeable talking heads on your show for a change instead of the same old Trump haters. Boring!— Donald J. Trump (@realDonaldTrump) September 22, 2015 \n\nDo you ever notice that lightweight @megynkelly constantly goes after me but when I hit back it is totally sexist. She is highly overrated!— Donald J. Trump (@realDonaldTrump) September 23, 2015 \nVideo: Carly Fiorina's response to Donald Trump and his insults on her appearance Other Links From TVGuide.com", "source": "Stuttgart Daily Leader"}