{"published": "2015-09-17T12:36:00Z", "media-type": "News", "title": "Credit Suisse Publishes Report on Evolving Consumer Perceptions about Fat", "id": "cdeb22c4-1d29-4cec-8b83-a5fa0436a65c", "content": "NEW YORK , Sept. 17, 2015 /PRNewswire/ -- The Credit Suisse Research Institute today released a report entitled \"Fat: The New Health Paradigm\" which explores the influence of medical recommendations on fat consumption globally, the recent change in consumer perceptions of fat, and what impact this shift has for investors. \n  \nWhile historically medical recommendations encouraged dramatically reducing consumption of saturated fats and cholesterol and placed no limits on polyunsaturated fats and carbohydrate intake, consumer buying patterns and medical research are now moving gradually away from these recommendations to favor food products with more natural unprocessed fats and rich in saturated and monounsaturated fats (organic dairy, grass-fed meats, natural oils, and nuts). The report illustrates this evolution by evaluating over 400 medical research papers and books written by academics and industry experts, and at the same time reveals the results of two proprietary surveys of doctors, nutritionists, and consumers. \n \n\"We found that 40% of nutritionists and 70% of general practitioners surveyed believe that eating cholesterol-rich foods has damaging cardiovascular effects. This is not true, according to the extensive research that has become available in recent years. Furthermore, they have limited knowledge of the potential benefits and risks of increased fat consumption,\" said Giles Keating, Vice Chairman of Investment Strategy & Research and Deputy Global Chief Investment Officer for Private Banking & Wealth Management. \"There is a concerning knowledge gap between the facts on fat and what consumers have been told.\" \n \nIn spite of this, consumer purchasing habits reveal that consumers are making new choices, which presents powerful investment ideas: global consumption of butter is growing globally at a rate of 2-4% annually; whole milk sales are up 11% while skim milk sales are down 14% in the US in the last six months; and organic egg consumption in the US is up 21% in the last 12 months. The report shows that fat consumption will continue to grow over the next fifteen years with fat accounting for 31% of calorie intake by 2030, up from 26% currently. Saturated fat should account for 13% of all calorie intake by 2030, from just above 9% now. \n \n\"We believe that consumers are at a turning point and this has distinct implications for investors. The report's conclusion is simple – natural unprocessed fats are healthy and are integral to transforming our society into one that focuses on developing and maintaining healthy individuals,\" said Stefano Natella, Global Head of Equity Research and an author of the study. \n \nAdditional forecasts for macronutrient and fat-containing food consumption levels by 2030 include: \n \nGLOBAL \n Fat consumption per capita is likely to soar by 23%, protein by 12%, and carbs will likely decline by 2%. Total demand for fat will be much higher—up 43% or 1.9% a year—given the 16% growth in the global population expected over the next fifteen years.  Within fat: Saturated fat is likely to grow from 9.4% in 2011 to 12.7% of daily energy intake and monounsaturated from 10.2% to 12.2%.  Polyunsaturated omega-6 is expected to decline slightly from 6% to 5.4% and omega-3 will grow from 0.50% to 0.55% (excluding supplements).   Carbohydrates will decline from 60% of global energy intake in 2011 to 55% by 2030. The rising awareness of the link between excess carbohydrate consumption and metabolic syndrome, type 2 diabetes, and cardiovascular issues will largely contribute to this decrease.  Red meat consumption is expected to grow 23% over the next fifteen years.  Egg consumption is expected to grow at a rate of 4% a year, as the cholesterol-heart link gradually disappears from people's minds. By 2030, the world could consume close to 300 eggs a year per capita (just over five eggs a week).  \nREGIONAL \n The US :  Meat consumption is forecasted to trend higher with red meat in the lead.  Egg consumption should be 350 per year (almost one a day) up from 235 currently.  Among solvent-extracted oils, a small decline is expected, with soybean oil still as the best-selling, including the new high-oleic versions.  Butter should grow faster as the market learns the benefits of eating butter and as negative perceptions linked to saturated fats gradually disappears.   Europe :  Red meat consumption per capita is expected to grow 9% and poultry 19%.  Fish consumption should grow slower at 12%, as consumption is already at a relative high level and availability is more constrained.  Milk, cheese and yogurt should expand 11% or 0.7% a year, but butter consumption should grow 4% a year. The 5.5 kg per capita expected for 2030 is almost 10% below consumption in 1990.  Egg consumption should increase sharply and expand by 42% or over 2% a year to 300 eggs a year per person.  Vegetable oil consumption on a per capita basis should remain basically flat.  Solvent-extracted oils should decline 10%, while natural oils (olive, palm, and coconut) should grow more than 30%, albeit from a small base.   \nFor a copy of the report, please click here: Credit Suisse Research Institute: Fat: The New Health Paradigm . \n \nCredit Suisse AG  \nCredit Suisse AG is one of the world's leading financial services providers and is part of the Credit Suisse group of companies (referred to here as 'Credit Suisse'). As an integrated bank, Credit Suisse is able to offer clients its expertise in the areas of private banking, investment banking and asset management from a single source. Credit Suisse provides specialist advisory services, comprehensive solutions and innovative products to companies, institutional clients and high net worth private clients worldwide, and also to retail clients in Switzerland. Credit Suisse is headquartered in Zurich and operates in over 50 countries worldwide. The group employs approximately 46,600 people. The registered shares (CSGN) of Credit Suisse's parent company, Credit Suisse Group AG, are listed in Switzerland and, in the form of American Depositary Shares (CS), in New York. Further information about Credit Suisse can be found at www.credit-suisse.com . \n \nLogo - http://photos.prnewswire.com/prnh/20091204/CSLOGO    \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/credit-suisse-publishes-report-on-evolving-consumer-perceptions-about-fat-300144839.html", "source": "Yahoo! Finance"}