{"published": "2015-09-15T13:08:22Z", "media-type": "News", "title": "Bundesliga players to wear message of support for refugees", "id": "ff0f52d4-f0c1-4060-ab8e-2d3bb73254a6", "content": "German . All 36 clubs in the first and second divisions are taking part in the initiative in which a message on the arm of the players' shirts will read \"Wir Helfen #refugeeswelcome\".\n\nThe \"we help\" campaign logo of the Bild newspaper replaces the patch held by Hermes, the logistics group which is a partner of the German Football League (DFL).\n\nHermes waived its right to the sleeve advertising space for the fixtures from Friday to Sunday.\n\nSeveral Bundesliga managers have welcomed the initiative. Bayer Leverkusen sports director Rudi Voeller was quoted by Bild Tuesday: \"We want to make it clear that everyone should help where and how they can.\"\n\nAugsburg chief executive Peter Bircks said: \"With this logo on the sleeve the whole league is giving a clear sign in the current refugee discussion.\"\n\nMany Bundesliga clubs have taken part in initiatives to help refugee aid projects, have invited migrants to matches, or have backed the Bundesliga's \"Welcome in Football\" foundation.\n\nAmong some of the initiatives, champions Bayern Munich are to hold a training camp for young refugees and will donate 1 million euros (1.3 million dollars) from a friendly match to refugee support projects.\n\nIn Gelsenkirchen Sunday, 60,000 fans stood up holding #stehtauf (#standup) placards ahead of Schalke's home game against Mainz as part of a campaign by the club to help people in need. The club also invited child refugees Sunday to a football camp.\n\nThe DFL has said it would raise to 1.2 million euros by 2019 its aid fund for the integration of refugees.\n\nElsewhere clubs taking part in the Champions League and Europa League have pledged one euro from every ticket sold for their first home fixtures in the group stage this season to go towards refugee aid projects.", "source": "Albawaba"}