{"published": "2015-09-22T20:15:00Z", "media-type": "Blog", "title": "Meanwhile in the Future: Now You Can Buy an Invisibility Cloak", "id": "a73e6286-be43-483c-9c4a-a2f628a456a1", "content": "Scientists now have a way to cloak something very small, making it effectively invisible. But what if scientists and engineers created a much larger version? What if we all had access to invisibility cloaks? A few days ago, a team at Berkeley published a paper called “An ultrathin invisibility skin cloak for visible light” in Science. It’s the first step in a long slog toward invisibility cloaks. But in this future, their discovery has become a gadget you can buy anywhere.\nAdvertisement The first person I talk to in this week’s episode is David Smith from Duke University, who works on these kinds of cloaking systems, also called “transformation optics.” In 2006, Smith and his team demonstrated that they could cloak something at microwave frequency. Since then, they’ve managed to cloak things using visible light. And this is all possible because of something called metamaterials—materials made from mixing a lot of different things together. To help explain what transformation optics and metamaterials are, I also talked to Ainissa Ramirez, a former professor of materials science and the author of a book called Newton’s Football. She explains the premise behind this whole “transformation optics” idea, which goes like this: Imagine a stone in a river. The water passes over the stone, moves around it, and then continues to flow on the other side. A little ways down from the stone, looking at the water you might have never known the stone was there. That’s what they’re trying to do with light, move it around an object and to the other side such that it appears to have moved in a straight line. That might seem simple, but it’s actually pretty complicated to do. Right now, scientists can only disappear very small things. And often, it’s only invisible if you look at it from the right direction, not all the way around. You see, to make a big invisibility cloak this way, there’s a pretty fundamental obstacle: the speed of light. If the object is big, scientists have to push light to travel faster than the speed of light — that way, it can get to the other side at the same time it would have if it passed right through the object.\nInvisibility cloaks are a staple of science fiction and fantasy stories. Of course there’s the Harry Potter cloak, but Smith says that he thinks a different movie showed a more realistic version of what this might be like: Predator. In Predator, the alien can turn his invisibility mechanism on and off. But it requires a power source, and it’s not perfect. Smith says that if they do manage to build a bigger cloak, it will be more like that than like any kind of magical item. But since this podcast tends to be unconstrained by reality, let’s say that scientists could make invisibility cloaks. There are an endless number of ways people might use them: to spy on people, to hide things, to sneak around. Personally, I would use it to help with social anxiety at parties and conferences. When things get a little too overwhelming, I’d just slip it on and take a little break. We talk about a lot of other uses in the episode too. So with all these uses, how would this kind of technology be regulated? To answer that question, I called up Margot Kamisnki, a professor of law at Ohio State University. Kaminski says that actually some states have a law that might apply: in some places there are anti-mask laws on the books. So in New York for example, it’s illegal to wear a mask in public. An invisibility cloak would probably fall under the same umbrella. But anti-mask laws don’t always stand up to supreme court decisions. Kaminski explains how other decisions might impact our use of invisibility to do things like peacefully assemble. Now, invisibility cloaks aren’t coming any time soon. But the way we think about these cloaks is closely related to the way we think about privacy and anonymity today. How do you deal with anonymity on the internet? How do you regulate cameras in public spaces? Should you be notified when some company or person is watching you? In the episode we talk more about that, as well as some of the other ways the cloaks might be used, regulated and built. Have a listen! If you have thoughts about futures we should explore on the podcast, leave us a note in the comments, on Twitter, on Facebook, or email us at overthinkingit@gizmodo.com. You can subscribe to the podcast on iTunes, Soundcloud or via whatever RSS reading app you chose. The intro music is by Asura and the outtro music is by Broke for Free. Sound effects for this week’s intro scene came from Vlatko Blažek and Zabuhailo on Freesound.org. Illustration by Sam Woolley", "source": "Gizmodo"}