{"published": "2015-09-30T12:21:00Z", "media-type": "News", "title": "Philadelphia Criminal Lawyers Open Boutique Criminal Law Practice in Center City Philadelphia; Focusing on Philadelphia, Bucks, Montgomery, Delco, Chester, & New Jersey.", "id": "844aba6c-7e06-4337-91d7-1123b7151ec8", "content": "Philadelphia Criminal Lawyer, Amato T. Sanita has had tremendous success in the courtroom fighting for individuals and their rights. Attorney Sanita has taken on everything from homicide cases, drug cases, weapons cases, to assault cases; and has done so brilliantly providing clients with exceptional results time after time. His reputation for keeping clients informed of the law, and truly caring about his clients has earned him a stellar reputation amongst clients and his colleagues. \n\n\"It is an exciting time for my career, and I am eager to help individuals who have found themselves on the wrong side of the law. I love my job, I love what I do, I love to win, and most importantly, I love helping people,\" said Attorney Sanita. \"I plan to make our firm stand out from the rest, I pride myself on my work and knowledge of the law; SKA LAW GROUP, LLC is the place to go when you or your loved one is looking for the utmost professional and aggressive representation.\" \n\nLawyer Michael N. Kotik has represented clients arrested in Pennsylvania and New Jersey for various types of crimes, including aggravated/simple assault, drug charges, violations of probation, and DUI. Attorney Kotik believes that every case has the potential of turning into a great result for a client; the most important part of representing clients is making sure that the lawyer thinks outside the box and really dedicates himself to the case and his/her client. \n\n\"I always understood that when there's a will there's a way. Any time I sign up a difficult case I know that it's only difficult because the right solution has not yet been identified,\" said attorney Kotik. \"You have to work these cases up, you have to look for clues that other people missed, but more importantly you have to work!\" \n\nAttorneys Amato T. Sanita and Michael N. Kotik pride themselves on their work, and their law firm, SKA LAW GROUP, LLC., will surely exemplify their talents. Both lawyers identify with each other through their ability to help people and truly fight for individuals who have been incarcerated and/or arrested. SKA LAW GROUP, LLC., lawyers are available 24 hours a day, 7 days a week. They can be reached by calling 267-265-4553; or 267-738-7766. To check out some of their most recent results go to http://www.legalphilly.com/cases.php; or check them out at http://www.Legalphilly.com.", "source": "Wall Street Select"}