{"published": "2015-09-02T01:46:00Z", "media-type": "News", "title": "Voyager volleyball rolling", "id": "4680bb09-abc4-4e33-80e5-6de12d725413", "content": "DURHAM — Voyager’s volleyball team earlier this week went on the road and beat Northern Durham High School 3-0 (25-23, 25-21, 25 - 21). \n\nMackenzie Allison had a strong game for the Vikings. \n\n\"The ladies played well and were definitely tested in this match. Mackenzie truly stepped up her game to help our team to victory,” Voyager coach Mariah Jackson said. \n \nOn Saturday, Voyager beat N.C. School of Science and Mathematics and Wendell’s Corinth Holders. \n\nPanthers cut WR Boykin, CB White to trim roster to 75 \n\nCHARLOTTE — The Carolina Panthers waived wide receiver Jarrett Boykin and waived-injured former starting cornerback Melvin White on Tuesday. \n\nThe team also waived safety Robert Lester, defensive tackle Kenny Horsley and wide receiver De'Andre Presley, and waived-injured defensive tackle Micanor Regis. Also, wide receiver Kelvin Benjamin was placed on injured reserve as the team reached the 75-player roster limit. \n\nThe Panthers boasted about their depth at wide receiver throughout the offseason, but that core has dwindled. Benjamin and Stephen Hill both tore ACLs during training camp and Boykin, despite leading all wide receivers with 91 yards on nine receptions in the preseason, didn't show the consistency. \n\nThe Panthers traded on Monday with Seattle to acquire for Kevin Norwood, a fourth-round pick in 2014 who caught nine passes last season. \n\n\"He's a guy who is used to winning,\" quarterback Cam Newton said. \n\nCarolina's receivers have been plagued by several drops the last two preseason games, but Newton said he isn't allowing it to affect his approach to the game. \n\n\"Those are things I can't worry about,\" Newton said. \"It doesn't affect me one bit. I want guys who are ready to come in and play and I think (Norwood) is ready to come in and do that. This is a production league. We're all getting critiqued and watched each and every day.\" \n\nCarolina's first-team offense has scored 20 points — two touchdowns and two field goals — in 15 possessions. \n\nCarolina's Staal, Ward focusing on the ice, not contracts \n\nRALEIGH — Eric Staal and Cam Ward aren't worrying now about their uncertain futures with the Carolina Hurricanes. \n\nThe only remaining players from the club's lone Stanley Cup championship team a decade ago are entering the final season of their lengthy contracts. \n\nBoth players said Tuesday that they're keeping their focus on the things they can control on the ice. \n\nStaal says that if there's no resolution before the season, he's \"sure I'll get those questions\" throughout the year and added, \"how many different answers can you give?\" \n\nCoach Bill Peters called his veterans' contract uncertainty a \"nonissue.\" \n\nStaal will make $9.5 million in the last year of a seven-year deal he signed in September 2008. The Hurricanes will pay Ward $6.8 million in 2015-16 in the final year of the six-year contract he signed a year later. \n\nStaal, 30, took over as team captain in 2010, has led the team in scoring in seven of his 10 seasons and is the only player in club history with four straight All-Star game appearances. Ward, 31, won the Conn Smythe Trophy as the MVP of the playoffs as a rookie in 2006. \n\nNice week in net for Duke’s Proctor \n\nDURHAM — Duke women’s soccer goalkeeper E.J. Proctor is the defensive player of the week in the Atlantic Coast Conference, and the sophomore also earned a spot on TopDrawerSoccer.com National Team of the Week. \n\nProctor collected her first two career shutouts this past week against Penn State and William & Mary, both nationally ranked teams. \n \nDuke’s cross-country team off and running \n\nDURHAM — The Duke women’s cross-country both hosted and won the inaugural Duke Alumni Meet here Tuesday. \n\nThe Blue Devils beat an alumni team comprised of six former Duke student-athletes by placing all eight of their competitors in front of the first alumni finisher. The score was 15-50. \n\nSenior Anima Banks earned the individual victory after covering the 4-kilometer course in a time of 14:07. Banks improved on her season-opening 4K effort of 14:24 from a year ago, run at the Virginia Duals. \n\nFellow senior Olivia Anderson finished less than 10 seconds behind Banks, placing third overall with a time of 14:16. \n\nECU gets best of NCCU at net \n\nDURHAM — East Carolina’s volleyball team beat N.C. Central 3-0 (25-21, 25-22, 25-13) Tuesday at the L.T. Walker Complex. \n\nNCHSAA announces essay contest \n\nCHAPEL HILL — The N.C. High School Athletic Association has announced its fourth NCHSAA Scholar-Athlete Essay Contest, sponsored by the N.C. National Guard. \n\nStudent-athletes enrolled at an NCHSAA member school and participating in at least one sanctioned sport or cheerleading have until midnight Sept. 30 to submit a 400-word essay answering this prompt: \"What challenge(s) have you overcome to develop as a Scholar-Athlete?\" \n\nOne male and female winner will be selected from the pool of entries to receive a prize pack from the N.C. National Guard and the NCHSAA, including a FitBit Flex fitness wristband. \n\nEssays will be judged on originality, content, organization of material, grammar and spelling.", "source": "Durham Herald-Sun"}