{"published": "2015-09-30T16:42:07Z", "media-type": "News", "title": "SECANT MEDICAL : to Present the Prevention of Device Implant Infections at MD&M Philadelphia", "id": "df8f65a4-0736-4e38-be1a-7e85938e0871", "content": "Jeremy Harris, technical director at Secant Medical, will present \n      “Medical Materials to the Rescue: Leveraging Polymer Innovation to \n      Prevent Device Implant Infections” at the MD&M Philadelphia Conference \n      during the New Materials/Medtech Polymers session on October 8 th from 11:15-11:45 a.m. The presentation will address the use of polymers \n      to prevent infections in medical device implants. \n \n“Utilizing polymers in medical device development has the potential to \n      reduce or even prevent a device-related infection,” said Harris. “One \n      polymer technology platform we have been studying, poly(glycerol \n      sebacate) (PGS) is a surface eroding, resorbable polymer which has \n      exhibited antimicrobial activity that may help prevent secondary site \n      infections when used as a device coating.” \n \nHarris will discuss the problem with bacteria, using antimicrobial \n      polymers and antibacterial agents, and the benefits this technology \n      offers to prevent infection. The MD&M Philadelphia Conference takes \n      place October 7-8 in Philadelphia at the Pennsylvania Convention Center. \n \n Key Information \nPresentation : \n      Medical Materials to the Rescue: Leveraging Polymer Innovation to \n      Prevent Device Implant Infections \nWhen : Thursday, October 8, \n      2015 11:15 am – 11:45 a.m. \nWhere : Pennsylvania Convention \n      Center, Philadelphia, PA \n \n About MD&M Philadelphia: MD&M Philadelphia brings together \n      the regions Medtech Community to delve into the latest challenges and \n      opportunities that are impacting the industry. The conference will \n      feature a multi-track agenda focusing on five areas of interest \n      including, innovations in 3D printing, packaging design that sells, \n      human centered design, new materials/Medtech polymers, and medical \n      device innovation. \n \n About Secant Medical: Secant Medical designs and manufactures \n      biomedical textiles and advanced biomaterials for medical devices and \n      pharmaceuticals. Employing medical fabric engineering technologies, we \n      blend polymeric, metallic and resorbable biomaterials to create custom, \n      high-performance structures that are used in the cardiovascular, general \n      surgery, neurovascular, orthopedic and regenerative medicine fields. \n      Built on a 70-year history, we’re committed to the future of \n      biomaterials and their role in the healing process and are actively \n      engaged in research partnerships to advance next-generation biomaterial \n      development. Secant Medical is a business unit of Fenner PLC, a \n      worldwide leader in reinforced polymer engineering headquartered in \n      Yorkshire, England. For more information, visit www.secantmedical.com . \n \n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150930006491/en/", "source": "4 Traders"}