{"published": "2015-09-24T05:12:26Z", "media-type": "News", "title": "Lawyers cheer Treasurer taking responsibility for competition policy", "id": "72c7eb78-6aa8-4a9c-8581-3dcbb730f3bd", "content": "Scott Morrison confirmed he was taking over responsibility for competition policy, along with the response to David Murray's Financial System Inquiry. Bloomberg   by Marianna Papadakis  \nLawyers say the shifting of competition law policy to the Treasury portfolio could progress much-needed reforms, leaving behind ongoing controversy over proposed changes to misuse of market power provisions. \n\nNew Treasurer Scott Morrison confirmed he was taking over responsibility for competition policy, along with the response to David Murray's Financial System Inquiry, given their importance to the economy.  \n\n\"I expect there will be a temptation to be pragmatic – pick up the political and economic winners and leave controversy well enough alone,\" said Allen & Overy partner Peter McDonald. \n\nMr McDonald said the path for reform was always going to be treacherous, but a change of minister added extra spice. \n \nLawyers predict that it could lead to more objective and less polarising progress, given the clear conflict of interest of having competition policy fall under the small business portfolio. But small business fears that removing competition law to the ambit of the new Treasurer could signal the government is leaning more towards the interests of big business. \n\nDespite hopes for progress, many corporate lawyers would rather one element be left behind: the so-called \"effects test\", one of 56 recommendations proposed by the Harper review, which would amend the current long-standing misuse of market power rules. \n\nPrime Minister Turnbull has assured that the effects test will be dealt with by cabinet after it was pushed as part of the new Nationals' coalition agreement. Before Mr Turnbull's successful leadership challenge, the issue had been dumped despite the protestations of former small business minister Bruce Billson who had pushed for the reform. \nBusiness community on edge  \nWith Mr Morrison indicating he was \"going to take my time on it\" the timeframe remains unclear leaving the business community on edge. \n\nThe Productivity Commission supports the reform. If introduced, a company would need to have the \"purpose, effect or likely effect\" of substantially lessening competition to breach misuse of market power restrictions. The current provision requires proof that a company \"took advantage\" of its market power and its purpose was to damage a competitor. \n\nProductivity Commission chairman Peter Harris lamented this week that controversy over the reform was derailing progress on other Harper-supported recommendations that could boost the nation's productivity, income and employment. \n\nThose who oppose the changes include Professor Bob Baxt, an emeritus partner at Herbert Smith Freehills, who said it would not help to protect small business against bigger, more efficient competitors. \n \n\"It's an absolute fallacy to think it will change the way the courts deal with their concerns,\" he said. \n\n\"Competition law was never intended to protect small business from more efficient competitors.\" \n\nHe said misuse of market power laws should be left alone until the right case came to the High Court for determination. This could occur if the ACCC wins a bid for special leave to appeal to the High Court over its loss against Flight Centre in a price fixing case . It will also be a matter for determination by the full bench of the Federal Court in November when it will hear the  ACCC's appeal against Pfizer  for misusing its market power. \n\nPricewaterhouseCoopers partner Murray Deakin said the new cabinet should be very wary about introducing an effects test, which would place Australia at odds with the rest of the world. \n \n\"The introduction of an effects test with such a low market power threshold is likely to constrict, not expand economic activity, which is not what this country needs,\" he said. \n\nClifford Chance partner Dave Poddar said it was Australia's competition law equivalent of a \"zombie section\" that kept coming back from the dead. \n\n\"Competition policy is a whole of economy issue and it's important that the pro-competitive reforms in the Harper Report are taken forward to unlock productivity benefits to the economy as a whole,\" Mr Poddar said.", "source": "Australian Financial Review"}