{"published": "2015-09-29T10:48:47Z", "media-type": "Blog", "title": "Microsoft Moves Xbox Division To Different Financial Segment", "id": "43478c63-bbba-4eca-aaf6-f8674255687f", "content": "Due to changes in the reporting of their financial results, Microsoft has moved the Xbox gaming division into the same segment as Windows. \n\n\n\nMicrosoft announced this yesterday on their website : \n\nMicrosoft Corporation today announced that it will change the reporting of its financial results to reflect the company’s strategy and ambitions to build best-in-class platforms and productivity services for a mobile-first, cloud-first world. Beginning in fiscal year 2016, the company will report revenue and operating income based on three operating segments: Productivity and Business Processes, Intelligent Cloud, and More Personal Computing \n\nAdvertisements     \n\nPrior to this change, the Xbox division was part of the Entertainment & Devices division. With the Xbox gaming division being placed into the ‘More Personal Computing’ segment, the financial results of Xbox gaming will be even harder to discern. According to Neogaf user ZhugeEX, this also shows how Microsoft has changed as a company to focus on Cloud and Office. Even more so the chance shows how Microsoft is trying to fade the lines between PC and the Xbox brand. \n\nThe More Personal Computing segment includes results from licensing of the Windows operating system, devices such as Surface and phones, gaming including Xbox consoles, and search. \n\nThe Xbox brand is part of Microsoft’s gaming division, which was established back in 2002 as Microsoft Game Studios. In 2011 Microsoft rebranded the production wing to ‘Microsoft Studios’. Microsoft Studios consists of 30 studios worldwide, including Rare, Lionhead, 343 Industries and The Coalition. \n\n  \n\nThe post Microsoft Moves Xbox Division To Different Financial Segment by Aernout van de Velde appeared first on WCCFtech .", "source": "WCCFtech"}