{"published": "2015-09-08T19:07:39Z", "media-type": "Blog", "title": "New Pullips Announced for October-  New Versions of Favorite Ribbon & La Robe Vert Clair", "id": "31c5b877-ed4a-4d23-8c58-b811548105f4", "content": "Groove has recently announced a pair of new dolls due for release in October via their blog . Both of the new Pullips may look a bit familiar because they are recolored variants of last year’s surprise darlings La Robe Vert Clair and Favorite Ribbon. \n Like last time, these dolls are the results of a triple collaboration between Groove, Baby, the Stars Shine Bright and models Aoki Misako and Fukasawa Midori.  Baby, the Stars Shine Bright   is a world famous lolita company, they made the outfits that the dolls wear which are more or less the same as last time’s except for the colors and the addition of an apron to Favorite Ribbon Chocolate Version’s outfit. Aoki Misako and Fukasawa Midori are both models here there are featured in a picture from BtSSB ‘s blog when the original dolls inspired on them were announced. \n \nBoth dolls are priced at 21000 yen which is a little bit more expensive than the last time around. They do have a release date of October in Japan, which means that we will not get them here in the US until late November. \n \n Aoki Misako × Favorite Ribbon Chocolate version \n I absolutely love and adore the new version of Favorite Ribbon, I think this is the first recolored release that I actively prefer over the original release. I think Favorite Ribbon Chocolate Version is absolute perfection, I’m normally not a fan of brown but I love the color palette on her and how well all the colors play off each other. I always felt like the red was very discordant with the rest of the outfit in the original release. \n The apron is addition to this release, there was no apron on the original release. The new outfit looks pretty cute even with the apron, I wonder why they chose to include the apron this time? It makes me wonder if Favorite Ribbon will not come with a second outfit like the original did. \n \nThe apron is a cute addition! \n Back view of the dress, it’s even pretty darn cute from behind. \n I like that they changed the hairstyle this time, the color is really nice it’s a very rich honey blond. \n The face up looks to be the same as the original’s but in a slightly different color scheme. I think the color scheme looks nice, it reminds me a bit of Tiphona’s face up with the coloring. \n \nFukasawa Midori × la robe vert Bleu royal Ver. \n I really loved the original La Robe Vert Clair because she had such a lovely color palette with the like sea foam green dress, I think in this case I prefer the original color scheme over the revised color scheme ^^;. I’m just not the biggest fan of that shade of blue, I guess. \n I do like the pale yellow ribbon details, it provides a striking bit of contrast to the rest of the outfit. \n \nThe outfit is very detailed, all the ruffles are almost overwhelming! \n Back view of the dress. \n The wig looks to be the same style but in a shade of pale blond. \n I love her face up and the colors they chose for it, it’s another case of Groove redoing the face up but in slightly different colors but it works for her. \n \nI will be sure to update this once the dolls become available preorder via Pullipstyle / JPGroove . On a related note, Pullipstyle is taking preorders for a restocks due in September for the original versions of La Robe Vert Clair  and Favorite Ribbon  which served as an inspiration for the new girls.", "source": "Pullips and Junk"}