{"published": "2015-09-29T14:23:16Z", "media-type": "News", "title": "Toyota Adds Vellfire Car Model to Rollout of Microchip MOST50 Networking Devices in Toyota Infotainment Systems", "id": "8ba94d7e-37ee-41fa-bd0a-d4d816db5c03", "content": "CHANDLER, Ariz. , Sept. 29, 2015 /PRNewswire/ --Microchip Technology Inc. (NASDAQ:MCHP), a leading provider of microcontroller, mixed-signal, analog and Flash-IP solutions, today announced that its MOST50 Intelligent network Interface Controllers (INICs) are powering the infotainment systems of the new Toyota Vellfire executive-lounge vehicles. This is the latest deployment among a wide variety of the Toyota Motor Corporation's brands, which have been using MOST50 in their infotainment systems for more than a decade, including both volume and luxury vehicles. In the new Vellfire implementation, Toyota is once again using MOST technology to ensure high-quality digital audio throughout the vehicle. \n  \nTo learn more about Microchip's MOST networking products, visit http://www.microchip.com/MOST-092915a . \n \nTo date, more than 170 million MOST devices have been installed in 191 car models since 2001. Toyota and all major carmakers have for many years successfully implemented MOST technology in their multi-node infotainment networking systems, as it provides a field-proven, low-risk, whole-system solution. Toyota's networks utilize Microchip's MOST50 INICs, which feature an Electrical Physical Layer (ePHY) that is optimized for use with Unshielded Twisted Pair (UTP) copper wire. The result is a system that can predictably and efficiently transport video, audio, packet and control data throughout the vehicle without time-synchronization protocols, using dedicated channels for minimal processor overhead in the main infotainment control unit processors. The remote-connection-management and remote-control capabilities of all MOST INICs enable further options, including the ability to build slim (processor-less) network nodes. MOST INICs also provide industry-standard hardware interfaces to processor and peripheral devices for the efficient routing of audio, video and packet data, which greatly simplifies module designs. End users can immediately access the vehicle's infotainment system, due to the MOST INIC's ultra-fast network startup feature. \n\n \n\"The Toyota Vellfire emphasizes strength and luxury, and uses our MOST50 technology in its infotainment system to provide high-quality digital audio,\" said Dan Termer, vice president of Microchip's Automotive Information Systems Division. \"Toyota has been using MOST technology for more than a decade, and Vellfire is the latest entrant into the market. MOST provides a flexible platform to develop feature-rich infotainment systems.\" \n \nThe MOST Cooperation standards enable automotive OEMs and their Tier 1 suppliers with a proven and well-supported methodology for defining and implementing high-bandwidth infotainment and Advanced Driver Assistance (ADAS) systems, including a standard physical layer and a robust method for system management and control with superior reliability and Quality of Service (QoS). Using MOST technology also results in reduced weight for easier compliance with environmental regulations. \n \nTo learn more about Microchip's MOST networking products, visit http://www.microchip.com/MOST-092915a . \n \nResources \nHigh-res Image Available Through Flickr or Editorial Contact (feel free to publish): http://www.microchip.com/Logo-092915a \n \nFollow Microchip: \n \nAbout Microchip Technology \nMicrochip Technology Inc. (NASDAQ: MCHP) is a leading provider of microcontroller, mixed-signal, analog and Flash-IP solutions, providing low-risk product development, lower total system cost and faster time to market for thousands of diverse customer applications worldwide. Headquartered in Chandler, Arizona , Microchip offers outstanding technical support along with dependable delivery and quality. For more information, visit the Microchip website at http://www.microchip.com/Homepage-092915a . \n \nNote: The Microchip name and logo, and MOST are registered trademarks of Microchip Technology Incorporated in the U.S.A. and other countries. All other trademarks mentioned herein are the property of their respective companies. \n \nTags / Keywords: High Speed Networking, MOST Networking Technology, Infotainment System, Networked Infotainment System, Electrical Physical Layer, Remote Controls, Processor-less ECU Architectures \n \nLogo - http://photos.prnewswire.com/prnh/20141115/158835LOGO \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/toyota-adds-vellfire-car-model-to-rollout-of-microchip-most50-networking-devices-in-toyota-infotainment-systems-300150519.html \n \nSOURCE  Microchip Technology Inc. \n \nCopyright 2014 PR Newswire.  All Rights Reserved \n\nApplications, Networking, Business Issues, Hardware, Law & Regulations, Management, Video,  Inc., Science, Other, \n\nSource:PR Newswire.\n All Rights Reserved", "source": "Consumer Electronics Net"}