{"published": "2015-09-08T22:28:10Z", "media-type": "News", "title": "Aussie cricket has new line-up to take on English", "id": "d054e6f4-f788-46f5-af15-6df1fd61cc76", "content": "AUSTRALIA will have a new-look line-up when it attempts to wrap up the ODI series against England at Old Trafford tonight. \n \nBut the old tensions between the teams will be the same after debate raged on about the dismissal of England all-rounder Ben Stokes for obstructing the field in the second game at Lord's. \n \nStokes was given out after Mitchell Starc's attempted run-out hit the palm of his glove, England captain Eoin Morgan arguing his batting partner had acted instinctively to save himself from injury. \n \nBut former Australian one-day captain George Bailey added fuel to the fire by questioning Morgan's insistence that he would have withdrawn the appeal. \n \nBailey, who led Australia in 28 Twenty20 internationals and 29 ODIs before losing his place in the team ahead of this year's World Cup, also poked fun at Morgan for taking the moral high ground, questioning whether he would be so sporting over other contentious dismissals. \n \n\"It's a big call for Eoin to say that,\" Bailey said. \"I assume, if that's how he feels, then any time a batter nicks one onto his pad and gets given out lbw, or gets wrongfully given out caught behind, he'll call them back as well.\" \n \nBailey also backed new Australian captain Steve Smith and Starc over their stance. \n \n\"I think the correct decision was made,\" Bailey said. \"I don't think the ball was going to hit him (Stokes). I think the ball was going to hit the stumps and he was out of his crease. I don't think there was any need for him to put his hand up to defend himself.\" \n \nWhile Australia went on to win the game by 64 runs, it lost three players to injury for the rest of the series. \n \nAll-rounder Shane Watson injured his calf, opener David Warner broke his thumb and seamer Nathan Coulter-Nile strained his hamstring. \n \nNot only did Watson's injury end his series, he also took the opportunity to call time on his Test career. \n \nThe 34-year-old played 59 Tests, finishing with four centuries, 24 half-centuries and 3731 runs, as well as 75 wickets at an average of 33. \n \nA two-time Allan Border medal winner and 2011 Test player of the year, Watson said he knew it was time to move on. \n \n\"I don't have that real fight in me, especially for Test cricket, knowing the lengths physically that I'd have to go through, mentally and technically as well, to be at my best,\" he said. \n \nHis place in the one-day squad has been taken by Victorian all-rounder John Hastings, while Aaron Finch and Peter Handscomb were called in to replace Warner and Coulter-Nile. \n \n- with INM", "source": "Coffs Coast Advocate"}