{"published": "2015-09-28T15:31:41Z", "media-type": "News", "title": "Jordan Spieth: Golfer sets prize money record", "id": "6d8aadb7-8085-463a-b240-fb7693ba5755", "content": "American regains No. 1 ranking with Tour Championship win   (CNN) -  \nRecord-breaker and history-maker Jordan Spieth has reaped the rewards of becoming golf's new superstar this year -- and now the American is planning to share his riches. \n\nHis spectacular season culminated in landing an $11.5 million jackpot on Sunday, when he regained the world No. 1 ranking by winning the PGA Tour's FedEx Cup finale. \n\nSpieth's four-stroke victory at the Tour Championship clinched the $10 million prize for winning the four-tournament series, and took his total earnings for 2015 past $22 million. It surpassed the record of $20.9 million set by Tiger Woods in 2007. \n \n\"For me it's important to give it back to not only the people that need it, but also to our team who made it possible,\" the 22-year-old told CNN. \n\n\"This is a bonus that isn't just for me, I promise you that. \n\n\"This is going to a lot of various places because this season was magical and there was a lot of behind the scenes work done by a lot of people, and I want to be able to share that with them.\" \n\nWith Australian Jason Day failing to finish in the top five on Sunday, Spieth took the PGA Championship winner's place at the top of the rankings. \n\nThe Texan was able to celebrate his incredible weekend of success with his whole family and says it was made all the more special by the presence of his autistic sister Ellie, who missed out on his previous wins. \n\n\"It was really cool, it was great. When she came out I didn't even see her,\" he said. \n\n\"I wasn't expecting it, she just kind of ran into me and gave me a hug. It was awesome. \n\n\"It was special to have everybody here, it was just like the Masters except that Ellie was added in too. \n\n\"I owe everything to my family. They're my inspiration, they're the ones who put in the sacrifice to allow me to be here so I'm able to now celebrate with them and it's going to be fun.\" \n\nSpieth's season started with victories in the opening two majors -- the U.S. Open and the Masters -- and he fell just short of becoming the first player since Ben Hogan in 1953 to win the opening three when he missed out on a playoff at the British Open by one shot. \n\nHe then tied for second at the PGA Championship, but missed the cut in the opening two FedEx Cup playoff events before bouncing back when it most mattered at East Lake. \n\nThe Atlanta venue was the home course of golf legend Bobby Jones, the only man to win a calendar grand slam -- in 1930, when two of the majors were amateur championships. \n\n\"It's amazing. It's almost like a major championship,\" Spieth said of the elite 30-player event. \n\n\"What an unbelievable venue this is, the scene of a lot of Bobby Jones' history. \n\n\"It's cool to come back here and attack this golf course and play it the right way. I didn't make it easy on myself but all in all that last walk up 18 was pretty fun.\"", "source": "Click2Houston.com"}