{"published": "2015-09-29T18:11:31Z", "media-type": "News", "title": "Paul Gambaccini accuses colleagues of being 'Good Germans' over Yewtree probe", "id": "30f526bc-5975-4552-9f4a-6039b9e557c4", "content": "BBC broadcaster Paul Gambaccini, who was accused and cleared of sexual offences under Operation Yewtree, has called the investigation a \"witch-hunt\" - and accused his colleagues of standing by. \n \nThe American-born 66-year-old was arrested on suspicion of historical sex crimes in 2013. Looking back at the McCarthyism he witnessed growing up, he commented that this was the \"same deal, just different crime du jour\". \n \nSpeaking at the Radio Festival at the British Library in London, an industry conference, he told the audience: \"None of you offered me jobs. You became Good Germans. You should resent what the police have done to you.\" \n \n\"Good Germans\" refers to people in Nazi Germany who distanced themselves and looked away. Gambaccini said the police had changed the terms of the debate, with Yewtree \"eating\" at the idea of \"innocent until proven guilty\". \n \nLooking back, he said he immediately became a \"non-person\" within the BBC - and was even edited out of an ITV documentary. \n \nDespite this, he said, a number of famous friends stuck by him, including Graham Norton, Dermot O'Leary, Tony Blackburn and Clare Balding. Only Terry Wogan steered clear, he said, after social media speculation initially identified him as the potential suspect before Gambaccini was named. \n \nThe broadcaster agreed to step down from the programmes he presented after the news broke, but he says they refused to put him back on air when the case was dropped after five months. \n \nThe accusations came from two strangers, including an allegation that he'd had a threesome with a neighbour and a 14-year-old boy - all \"total fiction\", he said. \"I knew that the so-called file on me wouldn't have anything in it.\" \n \nHe added: \"This is a complete overreaction to the failure of the police to take seriously the plight of the genuinely abused for many years. And now, as you've seen through some of the more ridiculous cases which are beginning to unravel, we now know the police made a fundamental error in devising this witch-hunt. \n   Promoted stories   \n\"They did not consider the essence of the relationship between the celebrity and the public. The man on the street is known to the people he has met in his life. The celebrity is known to the people he has met in his life, plus millions of others. \n \n\"So when you invite the public to accuse a celebrity, you have a pool of people who include not only possibly people who have been abused, but many people to whom a celebrity may have satisfied an emotional need throughout the years even without knowing it. And this is precisely what has happened.\" \n   \n Share article  \n   \nHe said he \"wasn't surprised\" to be accused, as he had previously spoken publicly about Jimmy Savile's crimes and was once pictured alongside him on a newspaper front page, creating an association in the public's mind. \n \nGambaccini has previously called for bail reform, and for rape suspects to be given anonymity until charged.", "source": "Malton Gazette and Herald"}