{"published": "2015-09-16T14:10:43Z", "media-type": "News", "title": "Liraglutide provides greater blood sugar reduction than lixisenatide in new trial", "id": "7d9c2795-1250-4a40-9450-5a8544d075ba", "content": "Findings from a head-to-head trial comparing Novo Nordisk’s Victoza (liraglutide) and lixisenatide, both in combination with metformin, have demonstrated a significantly greater reduction in blood sugar for liraglutide compared to lixisenatide in adults with type 2 diabetes.\n\nIn the LIRA-LIXI trial, people in the liraglutide arm achieved a significantly greater reduction in HbA1c versus lixisenatide at 26 weeks, meeting the trial’s primary endpoint. In addition, more people treated with liraglutide achieved HbA1c targets of 7% and ≤6.5% compared with lixisenatide. A reduction in HbA1c can provide both a huge personal benefit and a significant cost saving through the reduction of complications. A one percentage point drop in HbA1c can lead to a 37% reduction in microvascular complications, a 14% reduction in myocardial infarctions and a 21% reduction in overall diabetes-related mortality.\n\nProfessor Sudhesh Kumar from the Warwickshire Institute for the Study of Diabetes, Endocrinology and Metabolism, University Hospitals Coventry and Warwickshire, commented, “Many people living with type 2 diabetes remain poorly controlled, which can lead to severe complications. These complications are extremely prevalent and can account for up to 80% of the cost of diabetes to the NHS. Therefore, it is crucial that these patients gain control of their blood glucose levels early in treatment. The significant difference in blood glucose control between liraglutide and lixisenatide reinforces the value of liraglutide as an effective treatment option for those with type 2 diabetes.”\n\nLiraglutide also demonstrated significantly greater reductions in fasting blood sugar and mean self-measured blood sugar compared with lixisenatide. Lixisenatide, however, had smaller changes in blood sugar after eating a meal following injection compared to liraglutide.\n\nWeight loss was observed in both treatment groups (liraglutide: -4.26 kg vs. lixisenatide: -3.67 kg). Systolic and diastolic blood pressure decreased with both liraglutide and lixisenatide treatment.", "source": "European Pharmaceutical Review"}