{"published": "2015-09-11T04:58:11Z", "media-type": "News", "title": "Fairfax Media wins at the 2015 Our Watch awards", "id": "7d48d699-2fb7-4bdc-ad2a-0b1e334616d8", "content": "Fairfax Media was recognised at the 2015 Our Watch awards on Thursday night for its exemplary reporting of domestic violence, receiving the award for best journalism campaign. Fairfax Media was recognised at the 2015 Our Watch awards on Thursday night for its exemplary reporting of domestic violence, receiving the award for best journalism campaign. The multi-platform Fairfax Media \"Shine a Light\" campaign was a body of work both thought- and action-provoking published across titles The Sydney Morning Herald, The Sun Herald, Daily Life and smh.com.au.\n\nThe campaign, which gave prominence to the extent and impact of domestic violence in NSW, was a group submission by Fairfax journalists Nick Ralston, Josephine Tovey, Rachel Olding, Amy Corderoy and Candice Chung.\n\n​The Our Watch judges Kelly Banister, Andrew Eales and Lisa Wilkinson commended the campaign for partnering industry-leading journalism with interactive responses to family violence. \"From exclusive page one stories to fearless opinion pieces, the Fairfax Media team's approach to creating awareness across media platforms was outstanding,\" they said.\n\n\"I think the thing that was so special about this campaign was how it really was a whole-of-Fairfax project. Domestic violence has a huge impact on every part of Australian life, so to cover it properly we needed to have the input in expert reporters covering crime, social affairs, health and more,\" Amy Corderoy, Sydney Morning Herald health editor, said.\n\n\"It was also really important the way it was backed by our editor-in-chief, Darren Goodsir, and all the news directors and platform editors, so we were able to have a massive impact across a range of platforms. But the biggest thing was how our audience responded, showing they cared about these women, wanted to share their stories and stop these awful tragedies from continuing.\"\n\nThe hashtag #shinealight was shared tens of thousands of times on social media, reaching a combined audience of more than one million.\n\nJess Hill won three awards, including the inaugural Our Watch award, for her work published in The Monthly, The Guardian and on Radio National ABC. Best use of social media was awarded to Destroy the Joint team, and Jayne Margetts and the ABC News Team were winners of best news coverage. Best local/community journalism went to Simon Mann, Bec Zajac and Ania Dutka from The Citizen. The story first appeared on The Sydney Morning Herald.", "source": "Port Stephens Examiner"}