{"published": "2015-09-25T06:31:20Z", "media-type": "News", "title": "Stuart Lancaster realises enormity of Wales and Australia World Cup matches", "id": "714317c4-56a5-4ee0-83b1-d78e3a4799d4", "content": "Pictured: England coach Stuart Lancaster \n\nStuart Lancaster accepts the visit of Wales and Australia to Twickenham over the next two weekends will define his stewardship as England's World Cup enters a critical phase. \n\nThe magnitude of Saturday's Pool A showdown with Warren Gatland's men was vast even before Lancaster dropped the selection bombshell of demoting George Ford at fly-half in favour of Owen Farrell and picking Sam Burges at inside centre. \n\nBut the radical overhaul of England's midfield after Jonathan Joseph was stricken by a chest injury, including the fielding of the 14th centre pairing of Lancaster's reign in Burgess and Brad Barritt, has added a new dimension to a match already billed as the biggest in the old rivals' long history. \n \nLancaster has been accused of gambling and abandoning his attacking philosophy shaped around the vision of Ford at a decisive moment in his three and a half year reign and while he denies the claims, he is aware his reputation is on the line. \n \nWhen asked if the evaluation of his tenure hinged on the outcome against Wales, he replied: \"It was always going to be the case for this game and the one against Australia. \n \n\"Clearly the selection has heightened it. If we win the game it will be judged a success. If we lose the game regardless of what selection I made, I'd be questioned. \n \n\"It will come down ultimately to the next two games. I understand the consequences and the stakes because it's the World Cup.\" \n \nOf all the collisions looming at Twickenham on Saturday evening, it is the wince-inducing battle between 17-stones centres Burgess and Jamie Roberts that is the most anticipated. \n \nIt has been 11 months since Burgess switched codes and after only 112 minutes of Test rugby comprising of a solitary start and two substitute appearances, he must duel with a two-tour British and Irish Lion in possession of 73 caps. \n \nOn paper it is a mismatch, but Lancaster is banking on Burgess' \"big game experience\" in league to help him nullify Welsh battering ram Roberts while imposing his own power in attack.", "source": "Bailiwick Express"}