{"published": "2015-09-04T16:18:17Z", "media-type": "News", "title": "In policy shift, Cuba welcomes back doctors who deserted", "id": "920df132-a770-4bc0-bdf1-665c1c2a7279", "content": "Havana (AFP) - Cuba has decided to allow doctors who deserted while on foreign missions to return home without punishment or loss of position in the state health care system, the government said Friday.\n\nThe action comes amid worries of a brain drain of Cuban medical professionals as the Communist-ruled island loosens long-time restrictions on emigration.\n\nDoctors in particular have faced stringent restrictions on travel since the 1960s, and stiff sanctions awaited those who deserted from government-sponsored missions in foreign countries.\n\nUnder the new policy announced by the ministry of public health, doctors who deserted while on foreign missions are being welcomed back.\n\nThey \"have the opportunity, if they so desire, to rejoin our National Health System, and will be guaranteed work placement in conditions similar to those they had before,\" a ministry statement said.\n\nLikewise, Cuban doctors who have emigrated under a more open policy introduced in 2013 can also return, although with no guarantee of working for the state system.\n\nIn the past, deserters and emigres alike were barred from visiting the country for periods of five to 10 years, or even for life in some cases.\n\nAn estimated 25,000 doctors and a similar number of health professionals currently serve in international missions in 68 countries.\n\nBut the missions have been plagued by complaints about low pay and defections.\n\nIn recent weeks, about 100 medical deserters turned up in Colombia seeking to travel to the United States under a program adopted in 2006 during the administration of George W. Bush.\n\nCuba insists it still has one of the highest doctor-patient ratios in the world.\n\nThe island receives about $10 billion a year for the medical services it provides other countries, mainly Brazil and Venezuela, making it the top source of hard currency revenues.", "source": "Yahoo! News"}