{"published": "2015-09-04T19:25:26Z", "media-type": "News", "title": "It's cruel to laugh at Floyd Mayweather's reading problems", "id": "d94da874-42c0-4daf-805d-b5e8eca6f036", "content": "There are plenty of reasons to criticize Money Mayweather. His struggle with literacy isn't one of them. There's nothing funny about Floyd Mayweather's reading ability, and it is stupid and cynical to think otherwise. Moreover, the situation should induce an uncomfortable… \r \nThere's nothing funny about Floyd Mayweather's reading ability, and it is stupid and cynical to think otherwise. Moreover, the situation should induce an uncomfortable amount of pity and shame from the world, rather than laughter. Mayweather is reprehensible, that much can't be argued, and no amount of boxing genius can change the corruptness of the human spirit or the damage that he has done to the women he has encountered. But deriding the man for his struggles with reading is not only elitist, with roots in racism, it's just downright crass. \n\nA recent war of words with Destroyer of Worlds Ronda Rousey went something like this: Dana White spent a few months last year proclaiming that Rousey could beat Mayweather in an MMA fight. When asked about this, Mayweather claimed to not know who Rousey was and even referred to her as \"he.\" Rousey shot back by bringing up Mayweather's history of domestic violence, before taking another verbal jab at the boxing champion at the 2015 ESPYs. Mayweather responded with the \"I'm richer than you\" route and then attempted to dismiss the situation. \n\nRousey countered his insult (that she needed to make $300 million before speaking to him) with: \"I actually did the math and, given the numbers of my last fight, I'm actually the highest-paid UFC fighter, and I'm a woman. I think I actually make two to three times more than he does per second ... so when he learns to read and write, he can text me.\" \n\nThe entire exchange is childish. It's embarrassing for both parties and their respective fans. It's entirely forgettable except for the strain at the end of Rousey's last retort. That snarky comment belittling him for his reading ability is insidious. Of course the public digested it and laughed with her, just as they had laughed when 50 Cent (a former friend of Mayweather's) introduced the embarrassing reality to Instagram some time ago. In one post, he even bet that if Mayweather could read one page out of a Harry Potter book, he would donate a specified cash amount to charity. \n\nThis led the leaking of an audio file of Mayweather struggling to read a drop for a New York radio show. In it, Mayweather could be heard struggling beyond the initial, \"This is Floyd Mayweather.\" He tried multiple times and towards the end, it felt repulsive for the hosts to push for a completion, knowing that he was being recorded. After it was revealed, the jokes poured in from all angles. Mayweather, untouchable in the square circle, was now utterly human in the most public way possible. His defense had been breached and behind it was a fallible being who responded that he all needed to be able to read was his checks. \n\nThe problem here is that literacy still is and has historically been a weapon of the elite. Consider that 18 percent of Michigan, Mayweather's home state, is functionally illiterate. And that 21 percent of citizens in Grand Rapids, where he was born, are as well \n\n. \n\nAcknowledge that he dropped out of high school and grew up poor, and that poverty and illiteracy are heavily linked. That Mayweather was once a black child, and that black children are more than three times as likely to live in extreme poverty than white children in America. That these black children enter school already behind and usually into lower quality institutions. \n\nThe problem here is that literacy still is and has historically been a weapon of the elite. \n\nFactor in that poor black children are almost three times more likely to be held back in school than their white counterparts. That while they are only 17 percent of the public school population, they represent 35.6 percent of students who experienced corporal punishment, 37.4 percent of all students suspended and 37.9 percent of all students expelled. That around 12th grade, out of the remaining children who have not dropped out or been expelled, 84 percent of them can't read at grade level. \n\nB e conscious of the fact that Mayweather took special education classes for reading in school. That black children are twice as likely as white children to be placed in a class for students with intellectual disability. \n\nYou have to know that we are a society in which literacy and intelligence are inseparable and yet, by design, the intermingling demographic of poor and black receive the short end of the stick. Then the labels and stereotypes feed the beast and the world acts as if no one knows why they suffer. \n\nIt's not by chance that the poorest of us are forced to live in the worst neighborhoods and given the worst education possible. And it's neither bad luck nor divine retribution for his atrocious nature that Mayweather struggles to read. He is just the most famous face of the many millions who are burdened with that indignity. \n\nThe cowardly rationalization will be to say that Mayweather is ridiculously rich and still hasn't changed his situation. But that assumes that people only look down on…", "source": "MyInforms"}