{"published": "2015-09-29T17:20:53Z", "media-type": "News", "title": "New National Poll Shows Strong Republican Support for Clean Energy Policies", "id": "1b9e7cae-10db-4ca3-980b-2e06a713febb", "content": "From the Wires First-of-its-kind study by three leading GOP pollsters \n \nSep. 29, 2015 01:09 PM \n   \n\r \n\nCHARLOTTE, N.C. , Sept. 29, 2015 /PRNewswire-USNewswire/ -- Today, a trio of leading GOP pollsters discussed the results of a groundbreaking national survey conducted on behalf of ClearPath, a private foundation dedicated to building support for market-based clean energy solutions. \n\n\"As we dug into this groundbreaking national survey of U.S. voters, it became clear that the big, myth-busting news was how wide and deep support for clean energy policy is among conservatives,\" said Jay Faison , founder of ClearPath. \n\nThe survey ( http://polling.clearpath.org/docs/clearpath_survey_report.pdf ) of 1200 registered voters – including interviews with 500 Republicans – was conducted in late August by Kristen Soltis Anderson of Echelon Insights in collaboration with Glen Bolger of Public Opinion Strategies and Whit Ayres of North Star Opinion Research. In a joint memo ( http://polling.clearpath.org/docs/clearpath_pollster_memo.pdf ) released today, the pollsters write, \"…support for clean energy is strong both with the overall electorate and with the conservative Republicans that form a core constituency for many Republican elected officials.\" \n\nKey findings include: \n84% of registered voters, including almost three-quarters of Republicans, favor taking action to accelerate the development and use of clean energy in the United States .  Energy independence, less pollution, and job growth are viewed by GOP voters as the \"big 3\" of clean energy benefits.  Solar policy enjoys enormous support among Republicans, with rooftop solar (82%) and net metering (86%) scoring highest among seven clean energy policy ideas tested.  Most voters – including a majority of Republicans (56%) – think the climate is changing and human activity is playing a role.  Among different approaches that win over voters on the issue of climate and clean energy, positive messages that emphasize what America can achieve are the most effective.  In particular, Republican and independent voters favor a candidate who says regardless of the debate over climate we should expand the use of clean energy because of its benefits and to mitigate risk. \n\"Voters are looking for leaders who want to solve problems and go beyond party politics. Voters, including Republicans, want to take a step back from the politicization of energy and climate issues and pursue clean energy on its own merits,\" said Kristen Soltis Anderson , co-founder of Echelon Insights. \n\n\"This research shows that conservative Republicans overwhelmingly support clean energy policy and respond favorably to positive solution-based messages,\" said Whit Ayres , founder and president of North Star Opinion Research. \n  \n\"These results underscore that clean energy has support not just with voters overall, but also with conservative Republicans. The innovation and independence that clean energy offers strikes a chord with voters across party lines,\" added Glen Bolger , partner at Public Opinion Strategies. \n\nSurvey Background \nTo test the generally accepted belief that conservatives do not support clean energy solutions, ClearPath engaged three prominent GOP polling firms to test voters' responses to clean energy messages.  From August 24-27, 2015 , Echelon Insights completed 1200 live telephone interviews with registered voters nationwide, including an oversample of 500 Republicans. Approximately 60% of the interviews were conducted on landlines and 40% were completed on cell phones. The margin of sampling error for the full national sample is +/- 2.83%. \n\nClearPath polling center:  www.polling.clearpath.org  \n\nMemo on national poll findings: http://polling.clearpath.org/docs/clearpath_pollster_memo.pdf \n\nCharts and analysis of poll results: http://polling.clearpath.org/docs/clearpath_survey_report.pdf \n\nAbout ClearPath \nClearPath is a private foundation dedicated to accelerating America's clean energy future through conservative solutions. We advance policy analysis, policymaker education, and public engagement on a national level and at home in North Carolina through high-impact grants, major partnerships and our own strategic initiatives. Founded in 2014, ClearPath is led by entrepreneur Jay Faison . For more information, visit ClearPath.org . \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/new-national-poll-shows-strong-republican-support-for-clean-energy-policies-300150875.html \n\nSOURCE  ClearPath \n About PR Newswire \nCopyright © 2007 PR Newswire. All rights reserved. Republication or redistribution of PRNewswire content is expressly prohibited without the prior written consent of PRNewswire. PRNewswire shall not be liable for any errors or delays in the content, or for any actions taken in reliance thereon.", "source": "Sys-Con India"}