{"published": "2015-09-04T20:35:39Z", "media-type": "News", "title": "PINK SLAMS DEMI?!", "id": "9842e4a1-3640-43c0-a92f-1726ab16c010", "content": "AKM-GSI   \nWill the VMAs drama ever end? \n\nPink isn't feeling red in the face after comments she allegedly made on a private Instagram went public. The 35-year-old singer-songwriter made headlines Thursday after she reportedly weighed in on the  earlier that week, confessing to a fan she felt \"embarrassed,\" \"sad\" and \"old\" while watching this year's show. \"In all seriousness; I felt sad because music is supposed to inspire. It saved my life. This trash won't save any kids life. In a world that is even scarier and with lives still worth saving, who will stand up and have soul?\" she asked. \"Disenfranchised to say the least. Let down by my industry and peers.\" \n\nPink then name-dropped a few acts, writing, \"Beside Macklemore and Pharrell and [ Justin ] Bieber (pre-sob fest) and The Weeknd , Tori Kelly was dope too. The rest was gross and embarrassing and hard for this aging pop star to believe.\" \n\nE! News reached out to Pink's rep to confirm or clarify her comments Thursday. \n Kevin Mazur/MTV1415/WireImage   \nRight or wrong, many people assumed the \"Just Give Me a Reason\" singer was slamming host Miley Cyrus , as well as performers and pop peers Iggy Azalea , Demi Lovato , Nicki Minaj and Taylor Swift , as she didn't offer them any praise. \n\nPublicly, Pink trashed the annual awards show, , \"I'm convinced MTV just bought up all dispensaries before airing this show.\" Pink did give props to one performer, though, , \"Ok @ToriKelly - fan for life. Great freaking performance tonight, you live singing, guitar playing accapella sanging woman.\" \n\nAfter her alleged Instagram comments made the rounds, Pink defended herself via  that night. \"Please look for a feud elsewhere. I have no issue with Demi Lovato or anyone else. I actually forgot she performed. I have opinions. MANY,\" she told her followers, , \"I stand by what I said. However, I didn't intend for the angry people of the world to latch on and make it into something it isn't. Peace.\" \n\nPink then retweeted several supportive messages: \n\n@Pink Pink doesn't play the trashy tabloid game and is in a league of her own so you're bitchy tweets are meaningless. You cannot touch her. \n— Billy (@evrybdygegeget) September 4, 2015 \n@luv_npnk  @Pink shouldn't you be asleep for work tomorrow instead of trying to start an argument \n— ️ (@HolyDemiPerry) September 4, 2015 \n@Pink Their own thoughts. People should just agree to disagree and move on in life. \n— Kaleb (@KalebA_M) September 4, 2015 \n@Pink I have no clue why people were angry over your comment, I think people on the Internet just love to be offended. \n— David Atkins (@DavidAtkins42) September 4, 2015 \n@Pink Dont feed the trolls, they never get enough  \n— Luis Dzo (@LuisDzo) September 4, 2015 \n@hgunn23  @Pink she's honestly saying she forgot...that's not being disrespectful she literally forgot \n— Maddie Roberts (@maddiie_roberts) September 4, 2015 \nFinally, she , \"K this was fun. You guys are a hoot.\" \n\nLovato, meanwhile, responded to Pink via Twitter Friday: \n \nCool For The Summer may not \"save kid's lives\" or \"inspire\" but I'd say Skyscraper & Warrior have done a pretty good job of helping people \n— Demi Lovato (@ddlovato) September 4, 2015 \ncope with mental illness. VMA's are sexy and fun. There's a time and place for everything. \n— Demi Lovato (@ddlovato) September 4, 2015 \nI'm excited for you all to hear the inspirational/honest/soulful songs on this album. #Lionheart  #Father  #StoneCold  #Confident ... Oct. 16!! \n— Demi Lovato (@ddlovato) September 4, 2015 \nI'm learning so much every day by this new chapter in my life. I'm no longer the victim. I am the survivor. \n— Demi Lovato (@ddlovato) September 4, 2015 \nThen, Pink responded: \n \nYou know, this is part of why I'm sad about the VMas and the world in general. Everyone is so nasty and waiting for a fight. I never said \n— P!nk (@Pink) September 4, 2015 \nAnything about Demi Lovato or called out anyone. I was talking to a friend in response to his disappointment about the show. I agree w him. \n— P!nk (@Pink) September 4, 2015 \nYou can make this into whatever you like, cause that's who we are now, I guess. I'm out \n— P!nk (@Pink) September 4, 2015 \nIn other news, it's gonna be a beautiful day, I hope you look up from your keyboards and enjoy it ❤️ \n— P!nk (@Pink) September 4, 2015   \n(Originally published on Friday, Sept. 4, 2015, at 4:36 a.m. PDT.)", "source": "UK E Online"}