{"published": "2015-09-03T07:00:00Z", "media-type": "News", "title": "Southeastern Home Building Executive Joins Mark Systems Consulting Team", "id": "2940125b-3cdb-4380-998a-c6a0d396b8e3", "content": "Curt Boatright brings extensive industry experience and expert level IHMS skill to Mark Systems client base. \nMOUNT HOLLY, NJ, September 03, 2015 /24-7PressRelease/ -- Mark Systems, the residential construction industry's leading provider of single-database ERP home builder software, is pleased to announce the addition of Curt Boatright to the Consulting team. \n\nCurt Boatright, the newest Senior Consultant at Mark Systems, played a major role in bringing two separate home building companies from start up to building 600 units per year. The first, he did without IHMS home builder software. The second, he immediately implemented IHMS and saw a major difference. \n\n\"The single database meant a lot to me. I only had to have one software package that covered everything we did as a builder! I knew it would improve communication between all my team members, and that is what we struggled with as we grew in the first company. The second time around I knew that if we didn't communicate effectively, seamlessly across all departments; in that market we would fail,\" said Boatright. \n\nCurt Boatright brings extensive industry experience and expert level IHMS skill to Mark Systems client base. Most recently serving as the Vice President of Operations at Legendary Communities, one of the fastest growing, privately held home building companies in the Southeast, Mr. Boatright decided to join Mark Systems a year after Legendary Communities was acquired by Meritage Homes. \n\n\"I love to help people and I always have. I am looking forward to helping other builders communicate better and improve operations from beginning to end using IHMS. While IHMS is a fantastic product, it is only the beginning,\" Boatright continues, \"I am an operations guy. I know that what I've learned can help others.\" \n\nMr. Boatright came to the construction industry from Winn-Dixie Stores retail grocery chain with vast experience in executive level Information Technology management, where he held the position of Regional Director of IT Operations. He also comes to the Mark Systems consulting staff with a builder's license for residential, single family, detached homes. \n\n\"Curt worked through the implementation of IHMS, exploring all possibilities offered within the system. His ability to manage different products in multiple markets including Atlanta, Alabama, South Carolina, and North Carolina has provided him with invaluable experience that he can now share with our customers. Curt is a great leader and we are very happy to have him on our team,\" said Robert Cain, Vice President Consulting Services for Mark Systems. \n\nAbout Mark Systems \n\nMark Systems' IHMS (Integrated Homebuilder Management System) is the industry's only single-database, enterprise wide home builder software suite. \n\nNo other home builder software offers the power, flexibility, ease of use, and return on investment like IHMS. The premier residential construction accounting software on the market today, IHMS combines a proven track record of performance with cutting edge technology to provide the financial control today's tough business climate demands. \n\nOffering support for every home building activity, IHMS delivers full back-office and field operations functions directly to the desktop of every person in the building process. \n\nMark Systems' single-database architecture means that residential construction information is delivered instantly and transparently to every team member. Purchasing , scheduling , field operations , trade partners , sales office , and design center personnel all effortlessly share critical information. \n\nFor more information contact Kayla Ware at 609.702.9901 x124, email us at Info@MarkSystemsUSA.com , or visit us online at MarkSystemsUSA.com . \n\n--- \nPress release service and press release distribution provided by http://www.24-7pressrelease.com", "source": "SearchBug"}