{"published": "2015-09-18T18:38:38Z", "media-type": "News", "title": "New Promoter For Clio Cup Series From 2016", "id": "a958d92c-8f53-43d0-a440-3bd697fd699d", "content": "Credit: Jakob Ebrey Photography \n  \nIn a statement released today (18 th September) ahead of the 2015 season finale this weekend, Michelin Clio Cup Series championship promoter Grovewood Sport have announced that the tin-top series will be in new hands in 2016. \n \nThe championship was conceived in 2013 as a home for the third-generation Clio Renaultsport race cars when the latest generation was introduced to the BTCC-supporting Renault UK Clio Cup a year later. \n \nInitially running as a four-event series, the Clio Cup Series received full championship status last season, with a two class system seeing the third-gen racers joined by converted Clio Renaultsport 197 road cars. \n \nMike Robinson was crowned the inaugural ‘Race Series’ champion in 2014, and this season went on to be crowned British GT4 vice-champion, while Anton Spires secured the ‘Road Series’ honours. \n \nAfter overseeing the introduction of the championship and the three seasons so far, Grovewood’s Simon North says it’s the correct time for change. \n \n“The time is right for a new promoter to build on the solid foundations we have created over the past three seasons and I’m delighted to be handing over control of the championship,” he said. \n \n“I must say a huge thanks to both title sponsor Michelin and tyre service provider Protyre who have given fantastic support to the Clio Cup Series and enabled us to put it firmly on the UK motorsport map.” \n \nOver the years, Grovewood Sport has become synonymous with Renault racing in the UK, having acted as the promoter of the Formula Renault UK Championship, Renault UK Clio Cup, Formula Renault BARC Championship and Michelin Clio Cup Series. \n \nYou can read our preview for the 2015 Clio Cup Series season finale here.", "source": "The Checkered Flag"}