{"published": "2015-09-07T01:15:13Z", "media-type": "News", "title": "Machines replace migrants as Maine blueberry harvest booms", "id": "028d042c-56d2-4818-9673-550267bf1721", "content": "Mary Marshall grew up living the life of a migrant farmer, spending hours under the hot summer sun picking wild blueberries with her parents and eight siblings, then ending the day bathing in a lake. \n\nIt was grueling work that she looks back on fondly – a way of life that brought people of different cultures to the camps in Maine’s vast blueberry barrens. And she laments the way it is disappearing. \n\n“Machines are taking over. Even just going down to the camps, I see a lot of machinery. That’s pretty sad,” said Marshall, who harvested berries 40 years ago. “Our people could really pick that.” \n\nA steady push toward mechanization in Maine’s blueberry industry is reducing the number of migrant farmers who travel to the state to rake the crop, which is vitally important to the state’s economy, state officials and industry leaders said. Maine’s blueberry harvest attracted more than 5,000 migrant farmers 10 years ago and it’s down to about 1,500 today, said David Yarborough, a University of Maine professor of horticulture. \n\nWorkers have come to Maine to rake blueberries for years, and many of today’s rakers are of Latin American or Caribbean origin. Others are Native American or aboriginal people of Canada, like Marshall, who hails from Nova Scotia, and some are Mainers. Reliance on migrant farming grew with the growth on the crop, which exploded from 20 million pounds per year in the 1970s to 50 or 60 million pounds per year 10 years ago and 90 million pounds per year now, said Yarborough. \n\nThis year, migrant farmers will pick some 90 million pounds of the wild blueberries – praised for their benefits as an anti-oxidant rich food – that are indigenous in Maine and parts of Canada. They will form communities of their own that revolve around hubs like the Blueberry Harvest School and ethnic restaurants such as the migrant-founded Vazquez Mexican Takeout. There’s even an end-of-harvest Wyman’s Cup soccer competition for pickers at Jasper Wyman and Son. \n\nThe increasing harvests came alongside the development of mechanized harvesters – heavy pieces of machinery operated by a driver – which started to play more of a role in the 1990s, workers in the industry said. Some blueberry operations have gone almost completely mechanized, and more are headed in that direction, Yarborough said. \n\nThe trend means less work for migrant farmers who have long relied on blueberry season as a chance to earn several hundred dollars per week in the summer. The season typically begins in late July and ends around Labor Day. \n\n“It’s really gone down considerably,” Yarborough said. “It’s subject to drop as we produce more and better machines.” \n\nGrowing mechanization is also making the nature of the remaining work more difficult. Rakers are left to work in parts of the fields that the mechanical harvesters can’t reach, like ditches and uneven land. \n\nThat makes a form of labor that already includes repetitive lifting and bending in the hot sun even more difficult. \n\n“Our people are sent out to the gullies,” said Marshall, who now travels to Maine every summer to work at Blueberry Harvest School. \n\nThe state has some 44,000 acres of wild blueberries, based mostly in the rural Downeast area, and the state relies on the berries for about $250 million per year in economic value, official said. Blueberries are also one of the state’s key cultural identifiers, along with lighthouses and lobsters. \n\nEd Flanagan, chief executive officer of blueberry producer Jasper Wyman and Son, said his business has gone from about 20 percent mechanized ten years ago to 70 percent mechanized today. A spokesman for Passamaquoddy Wild Blueberry Company said the business has gone from 100 percent rakers just six or seven years ago to 40 percent mechanized today. \n\n“Things are changing as more machines take to the fields in place of hand crews,” Flanagan said. \n\nIt remains to be seen if the trend will eventually jeopardize the existence of the community that has grown around migrant blueberry farming every year. But Briana Mejia, a raker who has been coming to work the fields for seven years, said the trend toward machines and away from workers is clear. \n\n“When someone builds a bigger, better machine that can do the gullies, what’s going to happen then?” Mejia said. “It’s all about making money.”", "source": "Charlotte Observer"}