{"published": "2015-09-06T22:00:00Z", "media-type": "News", "title": "DSI has much to answer for in shoddy Krungthai case", "id": "586346a9-1642-48c9-8b1c-3bbd9a575a37", "content": "The Department of Special Investigation (DSI) appears to be in the hot seat after the Supreme Court's Criminal Division for Political Office-Holders handed down its verdict on Aug 26 in the Krungthai Bank (KTB) case. \n \nThe long drawn-out case involved the granting of 9.9 billion baht in loans to subsidiaries of real estate company Krisdamahanakorn (KMN) under the government of Thaksin Shinawatra. \n  \nNineteen executives of the bank (including then president Viroj Nualkhair and chairman Suchai Jaovisidha) and Krisdamahanakorn affiliates were sentenced to heavy jail terms ranging from 12 to 18 years. \n \nThaksin, charged as the first defendant in this case, was not convicted by the court because he ran away before the trial started in 2012. The case against him was suspended and an arrest warrant issued by the court. \n \nImmediately after the verdict was announced, a big question was raised by those who had followed this loan scandal about four other figures who allegedly received a windfall from the loans but who were spared prosecution by the Office of the Attorney-General (OAG). \n \nThe four individuals are Thaksin's son Panthongtae; Kanchana Honghern, the personal secretary of Khunying Potjamarn, Thaksin's ex-wife; Wanchai Honghern, Mrs Kanchana's husband; and Manop Thivaree, father of Sitha, a former executive of the disbanded Thai Rak Thai Party. They were implicated in the loan scandal by the Assets Scrutiny Committee (ASC) which was set up by the junta after the 2006 coup to investigate shady or unusual deals endorsed by Thaksin, or which had his consent. \n \nThe ASC recommended the four individuals be charged with receiving stolen property in accordance with Article 357 of the Criminal Code and with violating the anti-money laundering law. \n \nThe question is, why were the stolen property charges against the four dropped? Who buried the charges? Why did it not proceed? \n \nFormer ASC spokesman Kaewsan Atibodhi helped shed light on the stolen property case. He said an investigation of the money trail for the 9.9 billion baht loan showed Mr Panthongtae received 17 million baht from Ratchada Krisdathanont, an executive of Krisdamahanakorn who was jailed for 12 years by the Supreme Court, and another 105 million baht was given to the other three figures by the company. \n \nMr Kaewsan said the ASC decided not to charge Mr Panthongtae and the other three for involvement in the loan scandal but recommended instead they be charged with receiving stolen property and violation of anti-money laundering laws. \n \nIn testifying to the ASC, Mr Panthongtae said the cheque he received was an investment from Ratchada for a joint venture project they were working on. \n \nAll the case files covering every charge and individual implicated, including the stolen property case, were handed over to the DSI by the ASC eight years ago. But only the shady loan case against Thaksin and the then executives of KTB and KMN was sent to the Supreme Court by the OAG. \n \nHere is the clarification from the OAG about why it did not take the stolen property case to court. A press conference was held at the OAG's office on Aug 31 to clear the air about the case by Vinai Damrongmongkolkul, an inspector-general who was in charge of the overall investigation. \n \nTo sum up, the OAG said Mr Panthongtae and the other three were not state officials or assistants to state officials, so neither the National Anti-Corruption Commission nor the ASC had the authority to investigate them from the beginning. \n \nThe OAG also said the case should have been put in the hands of the police like any normal criminal case. \n \nMr Vinai said the case was being handled by the DSI. But the DSI had sat on it for all these years. Since the DSI accepted the case in 2008, there had been no word about it from its department heads -- Pol Col Thawee Sodsong, Tarit Pengdit, Pol Gen Chatchaval Sooksomchit and the incumbent Suwana Suwanchutha. \n \nThat was probably why Justice Minister Gen Paiboon Kumchaya appeared annoyed when he was asked last week about the progress -- or the lack of it. \n \nThe DSI has called a meeting today to discuss the case and expects to come up with a decision within a month. That means eight years have now elapsed without the DSI having done anything about the case. \n \nMeanwhile, there is another worry -- that of the statute of limitations of the case. The alleged offences occurred in 2004 and now it is 2015. Has the statute of limitations already expired? \n \nLooking back at this whole disgraceful saga, I see several victims among those who deserve punishment by the court. \n \nThey are the ones who simply took orders from the \"boss\" and who did not receive any financial gain from the loan deal. Ironically, Mr Panthongtae might possibly be one of those dragged -- willingly or unwillingly -- into this shady deal which finally backfired.  \n \nVeera Prateepchaikul is a former editor, Bangkok Post.", "source": "Bangkok Post"}