{"published": "2015-09-21T12:38:09Z", "media-type": "News", "title": "Agnico Eagle provides Mexican exploration update - El Barqueno mineralized zones continue to expand - Potential..", "id": "650dbfef-f312-4afa-9454-7e6eb6a3dcb4", "content": "Stock Symbol: AEM (NYSE and TSX) The Company last reported drill results from El Barqueno in its news release dated June 9, 2015. \n\nAt Creston Mascota and the La India mine, ongoing infill drilling and the refinement of geological and metallurgical models are expected to result in an expansion of the mineral reserves and mineral resources at both open pit operations. \"Drilling at El Barqueno continues to expand the known deposits, and we are aiming to declare the first resource by mid-February 2016. \n\nSummer Drill Program Expands Known Deposits at El Barqueno \n\nAgnico Eagle has a 100% interest in the El Barqueno project. The 32,840-hectare property is in the Guachinango \n\n[link to El Barqueno project location] \n\nThe El Barqueno project contains a number of known mineralized zones and several prospects that require further evaluation. There are currently 10 drill rigs operating on the project. From January 2015 \n\nApproximately 32,000 metres of additional drilling is expected to be completed by the end of 2015, principally at the Azteca-Zapoteca, Angostura \n\n[El Barqueno project geology map] \n\nGold, silver and copper grades of recent intercepts from the Azteca-Zapoteca, Angostura \n\nSelected recent exploration drill results from the El Barqueno project \n\n* Cut-off grade of 0.4 g/t gold; only intervals longer than 2.8 metres estimated true width were included \n\nEl Barqueno project exploration drill hole collar coordinates \n\n* Coordinate System UTM WGS84 13N Zone \n\nAzteca-Zapoteca prospect \n\nTo date, the Azteca-Zapoteca prospect has been defined over more than 1.2 kilometres of strike length along a northeastern direction and has been intersected as deep as 300 metres, which is 100 metres deeper than previously reported. The prospect remains open at depth and along strike. Much of the planned exploration drilling for this year is done, and infill drilling has commenced and is expected to be completed in the early part of 2016. \n\nThe mineralization appears to form a shallow to moderately dipping arc, ranging from a southwest plunge in the southwest portion, to a northeast plunge in the northeast portion. Two structures (Azteca and Zapoteca) appear to coalesce at a depth of 100 metres below surface into an almost vertical structure with higher grades than the separate zones. \n\nOn the northeast side of the prospect, high grades were encountered both at depth and near surface. The deepest intercept to date from the 2015 drill program in this area of the prospect was hole BRQ15-174 that yielded 8.04 g/t gold, 41.9 g/t silver and 3.83% copper over 5.0 metres at 227 metres depth. Shallow intercepts included hole BRQ15-187 that yielded 5.82 g/t gold, 5.0 g/t silver and 0.01% copper over 4.9 metres at 8 metres depth, while BRQ15-185 yielded 4.84 g/t gold, 5.1 g/t silver and 0.03% copper over 9.8 metres at 33 metres depth, and hole BRQ15-180 yielded 4.51 g/t gold, 5.9 g/t silver and 0.14% copper over 11.0 metres at 13 metres depth. At mid-depth was hole BRQ15-166 that intersected 1.29 g/t gold, 9.7 g/t silver and 0.64% copper over 7.6 metres at 145 metres depth including 2.22 g/t gold, 11.6 g/t silver and 0.62% copper over 3.4 metres. \n\nIn the southwest portion of the prospect, which has had little previous drilling, the recent intercepts were between approximately 100 and 300 metres depth. Hole BRQ15-226 intersected four lenses between 173 and 303 metres depth including 2.25 g/t gold, 15.7 g/t silver and 0.75% copper over 3.6 metres at 303 metres below surface. Nearby, hole BRQ15-203 intersected 2.18 g/t gold, 16.1 g/t silver and 0.79% copper over 6.4 metres at 128 metres below surface including 3.98 g/t gold, 21.9 g/t silver and 1.27% copper over 3.0 metres. The location of the drill hole collars is shown on the Azteca-Zapoteca and Angostura \n\nDrilling to date suggests this prospect has the greatest potential for near-term gold resources at the El Barqueno project. Additional drilling is required along strike to the northeast and southwest to better define the extent and geometry of the mineralized zone, to search for other potential moderately plunging shoots, and to test for higher-grade feeder zones in the southwest portion of the prospect as part of an underground mine target. There is excellent potential for parallel mineralized structures between Azteca-Zapoteca and Angostura \n\n[Azteca-Zapoteca an\n\nAngostura local geology] The Angostura \n\nFour recent holes tested the area beneath the younger basalt cap, including hole BRQ15-206 that intersected 15.49 g/t gold, 11.8 g/t silver and 0.03% copper over 3.0 metres at 87 metres below surface. Another hole that drilled through the basalt cap, BRQ15-227, is approximately 100 metres farther west than any other holes in Angostura \n\nDrilling to date suggests Angostura \n\nPeña de Oro \n\nThe Peña de Oro \n\nA large part of this year's planned drill program at Peña de Oro \n\nHole PDO15-086 near the centre of the prospect intersected 2.69 g/t gold, 1.5 g/t silver and 0.04% copper over 27.5 metres at surface, suggesting that the zone is wide in this area. The highest grade results in the current drilling were in hole BRQ15-172 that intersected 10.82 g/t gold, 2.5 g/t silver and 0.02% copper over 4.9 metres at 32 metres below surface; this hole is approximately 65 metres southwest of any previous drilling. \n\nTwo other recent intercepts extended the prospect farther to the south and west. With a collar located 200 metres west-southwest of hole BRQ15-172, hole BRQ15-188 intersected 3.22 g/t gold, 4.5 g/t silver and 0.04% copper over 5.9 metres at 132 metres below surface. Between holes BRQ15-172 and BRQ15-188, but farther south, hole BRQ15-210 intersected 1.83 g/t gold, 1.2 g/t silver and 0.05% copper over 4.9 metres at 167 metres below surface. The location of the drill hole collars is shown on the Peña de Oro \n\nThe current drilling is testing an extension to the southwest and at depth. Additional drilling is required along strike to the northeast searching for other potential shallowly-plunging shoots. As well, recent mapping and sampling suggest that there is excellent potential for parallel mineralized structures to the north and northeast, such as at Peña Blanca. Potential mineralization needs to be investigated in the hanging wall (to the south) and the footwall (to the north) as well as at depth (potential feeder zones). \n\n[Peña de Oro local geology] \n\nZapote-Mixteca prospect \n\nApproximately 1 kilometre east of Azteca-Zapoteca is the Zapote-Mixteca (formerly \"Zapote\" and \"Poncho West\") prospect consisting of northeast-striking veins. A small exploration drill program of 13 holes (2,800 metres) is underway in order to confirm the subsurface extents of the alteration and mineralization noted at surface as well as the encouraging sampling results. The results from initial drill-testing in this area are expected in the coming weeks. \n\nSurface Mapping and Sampling Program \n\nMapping and sampling is being done in select areas on the El Barqueno property including in the Tarasca, Huichol (La Luz \n\nThe results of recent trenching at the Tarasca (formerly \"Falco\") area include 5.0 metres grading 0.70 g/t gold, 10.5 g/t silver and 0.14% copper. Another trench 130 metres to the east yielded 3.0 metres grading 3.81 g/t gold, 63.4 g/t silver and 0.67% copper. A third trench 1.7 kilometres to the east-northeast of the first trench yielded 3.0 metres grading 10.40 g/t gold, 28.6 g/t silver and 0.10% copper. \n\nWhile detailed mapping is being carried out at Olmeca, trench sampling has yielded encouraging results including 4.0 metres grading 5.72 g/t gold; approximately 600 metres to the west, a separate trench yielded 3.0 metres grading 3.44 g/t gold. \n\nAdditional Work \n\nA mineralogical study indicates that the gold and silver at El Barqueno occurs as electrum. Recent analysis of 79 samples at the KCA laboratory in Reno, Nevada \n\nDrilling will continue at El Barqueno until the end of the year. An initial inferred mineral resource estimate is expected to be completed by the end of the year for the Azteca-Zapoteca, Angostura \n\nConceptual design studies and additional metallurgical testing are underway at El Barqueno. The project may host gold-silver deposits that could potentially be developed into a series of open pits utilizing heap leach processing, similar to Creston Mascota and the La India \n\nWhile it is too early to estimate the extent of the mineral resources and the number of deposits with economic potential at El Barqueno, the Company already has the experience of developing cost-efficient mining operations in Mexico \n\nDrilling Confirms Mineralization Below Creston Mascota Pit \n\nAs reported in the Company's July 29, 2015 \n\nSelected recent infill drill results from the Creston Mascota deposit \n\n* Holes at the Creston Mascota deposit use a capping factor of 9 g/t gold and 88 g/t silver. \n\nCreston Mascota drill hole collar coordinates \n\n* Coordinate System UTM NAD27 Z12 \n\n[Creston Mascota plan map] \n\n[Creston Mascota composite cross section] \n\nThe infill drilling has revealed higher grades and/or longer intercepts than expected, with some intercepts outside the block model but within the ultimate pit outline. In the north-central part of the pit, hole CM15-452 intersected 4.15 g/t gold and 29.6 g/t silver over 23.0 metres at 42 metres below surface, including 5.82 g/t gold and 44.1 g/t silver over 10.0 metres. This intercept is shown in the Creston Mascota cross section. \n\nAbout 570 metres farther south, in the south end of the pit, hole CM15-453 intersected 4.44 g/t gold and 47.6 g/t silver over 10.0 metres almost at surface, while nearby hole CM15-451 intersected 3.00 g/t gold and 50.5 g/t silver over 9.0 metres at 15 metres below surface. These results are expected to increase both the tonnage and the grade of the deposit's mineral reserves. \n\nOver its mine life, Creston Mascota has succeeded in adding approximately 50% (179,000 ounces of contained gold) to its mineral reserves through infill drilling and improved geological understanding. When the project was given the development go-ahead in mid-2009, it was estimated to have mineral reserves of 6.7 million tonnes grading 1.65 g/t gold (containing 357,000 ounces gold). By year-end 2014, Creston Mascota had mineral reserves of 5.8 million tonnes grading 1.25 g/t gold (containing 235,800 ounces of gold), as described in the Company's news release dated April 30, 2015. \n\nThe results of recent infill drilling in the pit and the potential of nearby satellite deposits could extend the life of the Creston Mascota operations beyond 2018. \n\nLa India Resource Growth Potential - Oxides and Sulphides \n\nThe La India mine commenced commercial production in February 2014 \n\nAbout Agnico Eagle \n\nAgnico Eagle is a senior Canadian gold mining company that has produced precious metals since 1957. Its eight mines are located in Canada \n\nForward-Looking Statements \n\nThe information in this news release has been prepared as at September 21, 2015 \n\nSuch statements include without limitation: estimates of mineral grades, the estimated extent and timing of anticipated future exploration activity; the results of future interpretation of geological information; whether results thereof will lead to estimated mineral reserves or mineral resources and the timing of such estimates; and the nature and timing of permitting work for the El Barqueno project and whether the project will ever be developed into a mine. Such forward-looking statements reflect the Company's views as at the date of this document and are subject to certain risks, uncertainties and assumptions, and undue reliance should not be placed on such statements and information. Many factors, known and unknown could cause the actual results to be materially different from those expressed or implied by such forward-looking statements. Such risks include, but are not limited to: the volatility of prices of gold and other metals; uncertainty of mineral grades; cost of exploration and development programs; governmental and environmental regulation; and the volatility of the Company's stock price. The material factors and assumptions used in the preparation of the forward-looking statements contained herein, which may prove to be incorrect, include, but are not limited to, the assumptions set forth herein and in management's discussion and analysis (\"MD&A\") and the Company's Annual Information Form (\"AIF\") for the year ended December 31, 2014 \n\nFor a more detailed discussion of such risks and other factors that may affect the Company's ability to achieve the expectations set forth in the forward-looking statements contained in this document, see the Company's AIF, MD&A and Form 40-F, as well as the Company's other filings with the Canadian securities regulators and the SEC. The Company does not intend, and does not assume any obligation, to update these forward-looking statements and information other than as required by law. For a detailed breakdown of the Company's reserve and resource position see the Company's Annual Information Form or Form 40-F. \n\nNotes to Investors Regarding the Use of Resources Cautionary Note to Investors Concerning Estimates of Measured and Indicated Resources This document uses the terms \"measured resources\" and \"indicated resources\". Investors are advised that while those terms are recognized and required by Canadian regulations, the SEC does not recognize them. Investors are cautioned not to assume that any part or all of mineral deposits in these categories will ever be converted into reserves. Cautionary Note to Investors Concerning Estimates of Inferred Resources This document also uses the term \"inferred resources\". Investors are advised that while this term is recognized and required by Canadian regulations, the SEC does not recognize it. \"Inferred resources\" have a great amount of uncertainty as to their existence, and great uncertainty as to their economic and legal feasibility. It cannot be assumed that all or any part of an inferred mineral resource will ever be upgraded to a higher category. Under Canadian rules, estimates of inferred mineral resources may not form the basis of feasibility or pre-feasibility studies, except in rare cases. Investors are cautioned not to assume that part or all of an inferred resource exists, or is economically or legally mineable. Scientific and Technical Disclosure \n\nCautionary Note To U.S. Investors - The SEC permits U.S. mining companies, in their filings with the SEC, to disclose only those mineral deposits that a company can economically and legally extract or produce. Agnico Eagle reports mineral resource and reserve estimates in accordance with the CIM guidelines for the estimation, classification and reporting of resources and reserves in accordance with the Canadian securities regulatory authorities' (the \"CSA\") National Instrument 43-101 Standards of Disclosure for Mineral Projects (\"NI 43-101\"). These standards are similar to those used by the SEC's Industry Guide No. 7, as interpreted by Staff at the SEC (\"Guide 7\"). However, the definitions in NI 43-101 differ in certain respects from those under Guide 7. Accordingly, mineral reserve information contained herein may not be comparable to similar information disclosed by U.S. companies. Under the requirements of the SEC, mineralization may not be classified as a \"reserve\" unless the determination has been made that the mineralization could be economically and legally produced or extracted at the time the reserve determination is made. A \"final\" or \"bankable\" feasibility study is required to meet the requirements to designate reserves under Industry Guide 7. Agnico Eagle uses certain terms in this news release, such as \"measured\", \"indicated\", and \"inferred\", and \"resources\" that the SEC guidelines strictly prohibit U.S. registered companies from including in their filings with the SEC. \n\nPrior to 2013, mineral reserves and mineral resources for all properties were typically estimated using historic three-year average metals prices and foreign exchange rates in accordance with the SEC guidelines. These guidelines require the use of prices that reflect current economic conditions at the time of reserve determination, which the Staff of the SEC has interpreted to mean historic three-year average prices. Given the current lower commodity price environment, Agnico Eagle has decided to use price assumptions that are below the three-year averages. The assumptions used for the mineral reserves and mineral resources reported by the Company on April 30, 2015 \n\nNI 43-101 requires mining companies to disclose reserves and resources using the subcategories of \"proven\" reserves, \"probable\" reserves, \"measured\" resources, \"indicated\" resources and \"inferred\" resources. Mineral resources that are not mineral reserves do not have demonstrated economic viability. \n\nA mineral reserve is the economically mineable part of a measured and/or indicated mineral resource. It includes diluting materials and allowances for losses, which may occur when the material is mined or extracted and is defined by studies at pre-feasibility or feasibility level as appropriate that include application of modifying factors. Such studies demonstrate that, at the time of reporting, extraction could reasonably be justified. \n\nModifying factors are considerations used to convert mineral resources to mineral reserves. These include, but are not restricted to, mining, processing, metallurgical, infrastructure, economic, marketing, legal, environmental, social and governmental factors. \n\nA proven mineral reserve is the economically mineable part of a measured mineral resource. A proven mineral reserve implies a high degree of confidence in the modifying factors. A probable mineral reserve is the economically mineable part of an indicated and, in some circumstances, a measured mineral resource. The confidence in the modifying factors applying to a probable mineral reserve is lower than that applying to a proven mineral reserve. \n\nA mineral resource is a concentration or occurrence of solid material of economic interest in or on the Earth's crust in such form, grade or quality and quantity that there are reasonable prospects for eventual economic extraction. The location, quantity, grade or quality, continuity and other geological characteristics of a mineral resource are known, estimated or interpreted from specific geological evidence and knowledge, including sampling. \n\nA measured mineral resource is that part of a mineral resource for which quantity, grade or quality, densities, shape and physical characteristics are estimated with confidence sufficient to allow the application of modifying factors to support detailed mine planning and final evaluation of the economic viability of the deposit. Geological evidence is derived from detailed and reliable exploration, sampling and testing and is sufficient to confirm geological and grade or quality continuity between points of observation. An indicated mineral resource is that part of a mineral resource for which quantity, grade or quality, densities, shape and physical characteristics are estimated with sufficient confidence to allow the application of modifying factors in sufficient detail to support mine planning and evaluation of the economic viability of the deposit. Geological evidence is derived from adequately detailed and reliable exploration, sampling and testing and is sufficient to assume geological and grade or quality continuity between points of observation. An inferred mineral resource is that part of a mineral resource for which quantity and grade or quality are estimated on the basis of limited geological evidence and sampling. Geological evidence is sufficient to imply but not verify geological and grade or quality continuity. \n\nInvestors are cautioned not to assume that part or all of an inferred resource exists, or is economically or legally mineable. A feasibility study is a comprehensive technical and economic study of the selected development option for a mineral project that includes appropriately detailed assessments of applicable modifying factors together with any other relevant operational factors and detailed financial analysis that are necessary to demonstrate, at the time of reporting, that extraction is reasonably justified (economically mineable). The results of the study may reasonably serve as the basis for a final decision by a proponent or financial institution to proceed with, or finance, the development of the project. The confidence level of the study will be higher than that of a pre-feasibility study. \n\nGuy Gosselin \n\nThe scientific and technical information related to the geology and mineral reserves at the Creston Mascota and La India mines contained herein has been approved by Daniel Doucet The scientific and technical information related to metallurgical work at the La India mine contained herein has been approved by Tim Haldane \n\nAdditional information about the Creston Mascota deposit and the La India \n\nSOURCE Agnico Eagle Mines Limited", "source": "ADVFN UK"}