{"published": "2015-09-30T20:14:50Z", "media-type": "News", "title": "Closing Bell Reports: GoPro, Inc. (GPRO), Market Vectors Oil Services ETF (OIH), The Kroger Co. (KR), Mattel, Inc. (MAT), ARM Holdings plc (ARMH)", "id": "727214c7-e7cd-4a23-b9d9-0275fb72106d", "content": "WallStreet Scope – Wednesday September  30th: Closing Bell Reports \n \nGoPro, Inc. ( GPRO ) of the Consumer Goods Sector closed the day at $31.22 (a change of 4.55%)  at a relative volume of 0.72. GoPro, Inc. ( GPRO ) had a change from open of  3.04% trading at a volume of 6,575,004 shares.  GoPro, Inc. ( GPRO )’s weekly performance is -10.36% and against their 52 week low GoPro, Inc. is 8.03% with total insider ownership of 9.60%. GoPro, Inc. ( GPRO )’s monthly performance stands at -38.02% in the Photographic Equipment & Supplies industry with an analyst recommendation of 2.00 \n \n\n \nMarket Vectors Oil Services ETF ( OIH ) of the Financial sector (Exchange Traded Fund) closed the day at $27.48 losing 0.51%, a change from open of- 0.11% after trading at a volume of 6,556,160 shares.  Market Vectors Oil Services ETF ( OIH )  weekly performance is – 5.92% .Market Vectors Oil Services ETF ( OIH )’S monthly performance ended at-11.06% and Market Vectors Oil Services ETF ( OIH ) has a YTD performance of -23.89% in the Exchange Traded Fund industry. \n \n\n \nThe Kroger Co. ( KR ) finished up today at $36.07 with a volume of 6,540,419 shares, changing by 1.29% ( 0.250% change from open) with a profit margin of 1.80%.  The return on investment for The Kroger Co. ( KR ) is currently13.10% and The Kroger Co. ( KR )’s weekly performance is – 2.20%.  The Kroger Co. ( KR )’s monthly performance stands at  1.92% with current market cap of 34,663.84million  and insider ownership of 0.60% in the Services sector of the Grocery Stores industry.  We give this an analyst recommendation of 2.00 \n \n\n \nMattel, Inc. ( MAT ) of the Consumer Goods sector closed out today at $21.06, a change of 0.14% at a volume of 6,516,502 shares with return on investment of 11.20%.  Mattel, Inc. ( MAT ) currently has a weekly performance of – 8.05% and return on investment of 11.20%.  Mattel, Inc. ( MAT )’s monthly performance stands at – 9.35% and Mattel, Inc. ( MAT ) YTD performance of -28.89% in the Toys & Games industry.  Current analyst recommendation  2.60 \n \n\n \nARM Holdings plc ( ARMH ) of the Technology sector was up 2.83% finishing up today at $43.25, a change from open of 0.32% at a volume of 6,513,521 shares.  ARM Holdings plc ( ARMH ) has a weekly performance of – 2.25% and ARM Holdings plc ( ARMH )’s monthly performance stands at – 0.96% with YTD performance of -8.48% in the Semiconductor – Specialized industry with an analyst recommendation of 1.8", "source": "WallStreetScope.com"}