{"published": "2015-09-19T12:20:18Z", "media-type": "Blog", "title": "What If FOSJOAS Intelligent Electric Scooter Can Carry Goods?", "id": "f3230046-cbcf-4ba2-b513-6e1d007093e7", "content": "19, September 2015: The whole sector of scooter has gone through triple phase. FOSJOAS intelligent self-balancing scooter transformed from the single-wheeled scooter to the twin-wheeled scooter, and then from the twin-wheeled scooter to the two-wheeled scooter. The triple transformation also marked the change in purpose of use. The single-wheeled scooter mainly serves the end of entertainment. The twin-wheeled scooter primarily fulfils the end of increasing the customer base. And the last model aims to meet the demand from production and locomotion. However, there is no model that serves the end of carrying goods. What if FOSJOAS electric intelligent scooter can carry goods? \n \n\n \nMany young people like FOSJOAS electric self-balancing scooter . Some who are energetic and enthusiastic ride FOSJOAS scooter tend to ride FOSJOAS electric self-balancing scooters to show off their thrilling riding skill in the street and in the parks. They represent the youth and vibration. And the two-wheeled scooter is used mainly in works and occasions like golf paddocks. The workers in the plant ride FOSJOAS scooters as transports. The speed of FOSJOAS scooters is enough in works. There is no need to worry about the crash accident. \n \n\n \nExcept the recreational and functional purpose, many city dwellers appeal for the purpose of life. They usually go shopping or go to the supermarket for weekly purchase. They need purchase much goods. But the current FOSJOAS scooter cannot carry much goods. Especially when they go to the supermarket, they will buy many commodities for weekly use. A pile of goods is a laborious job to them. They cannot carry them home. A personal vehicle that is able to carry much goods is much needed. Therefore, this function of carrying goods is a very promising. In the near future, this function must be added to FOSJOAS scooter. \n \nMore modifications and changes in FOSJOAS scooters are worth waiting. \n \n For Media Contact: \n Person Name: Mr Tang \n Company: Changzhou Moben Technology Co.,Ltd \n Phone: +8618861270200 \n Email Id: moben@fosjoas.com \n Website: http://www.fosjoas.com/", "source": "12 Press Release"}