{"published": "2015-09-13T12:54:23Z", "media-type": "News", "title": "14 years on: media lies continue to wreak havoc. It’s unequivocal – without the guaranteed support of Corporate media, 9/11 would never have made the drawing board.‏", "id": "f5709734-9463-4965-992e-1bbff4df34ea", "content": "FOR THE MILLIONS THAT HAVE DIED & THE UNTOLD MILLIONS WHO’VE LOST LOVED ONES!  Thanks to John Miranda for this caption –  \n \n9/11 was the mother of false flags, yet successful as it’s undoubtedly been manufacturing a war on terror out of thin air, the operation itself had so many holes in it, quite how so many people were daft enough to believe what they were told is mystifying to say the least. Yet, this alone inadvertently exposes the identity of the true conspirators. To have that many glaring discrepancies in the official account, one can safely assume those of lower than average intelligence were far more likely to succumb to lies than relatively smart folk. Loathed as I am to say this, reporters, journalists & TV media personnel are exclusively in the higher than average intelligence bracket. Therefore, it’s a nailed on certainty – the vast majority of media employees, sooner or later, had to realise, what they were being instructed to tell viewers, simply did not add up. \n \n\n \n9/11: The investigation that never was. For the world, it all but seemed imperative the media adhered to a certain ‘impossible’ narrative. Moreover, since they’ve continued to perpetuate these lies surely one is obliged to conduct a little research to confirm media control is the domain of Zionists. The natural extrapolation here is to ask the all-important question – WHY IS THE MEDIA LYING? Or better still, would the Zionist controlled media cover up 9/11 if the Outer Mongolians, Albanians or anyone else was responsible? Media barons know they’re lying as do the media whores. Whichever way you look at it, it’s unequivocal – the only people the media would cover up for are those with close ties to the very people who own & control it! Indeed, a prerequisite to even consider such an outrageous crime is if media control is iron clad. \n \n\n \nThis is why I make a point of reiterating false flag events are strictly restricted to those able to guarantee this. As most of us know, the whole purpose is to blame your enemy or as it often is, someone you’d like to attack, either for an event that never happened or something you initiated. The Gulf of Tonkin incident which sparked the Vietnam War is a classic example. Capitol Hill needed an excuse to escalate the conflict into full-blown war so they simply conjured up a story and on the 4th of August 1964 they acted it out as if Vietnamese torpedo gun-boats had actually attacked US destroyer Maddox. President Johnson went on national TV citing why the US had to retaliate. The media, on cue, hailed his speech as if it was a momentous rallying cry. The truth was, Johnson ordered U.S. bombers to “retaliate” for an attack that never happened. What’s more – HE KNEW IT! Some months later Johnson commented: “For all I know, our Navy was shooting at whales out there!” \nThree years later, the Israelis tried the same trick except here the stakes were far greater. On the 8th of June 1967 the Israelis sure had some nerve attacking the USS Liberty, an unarmed reconnaissance ship. To commit such a heinous act on your ally & benefactor is one thing but to do it against the most powerful country on the planet? I still have to pinch myself because there can be no question – Israel risked nuclear annihilation and for what? Their aim was to sink the Liberty and blame Egypt, their great enemy at the time, so that America would enter the 6 day war or god forbid, even flatten Cairo! After 2 hours of relentless pounding, the Liberty somehow remained afloat. 34 US sailors were killed and 174 injured. Yet almost immediately, incredible as it may seem, the whole sordid episode was covered up. \n \n\n \nIncredible as it may seem, the Israelis admitted they were the ones behind the attack on the USS Liberty. They got away with saying they ‘made a mistake’ yet a media black-out was imposed!   \n \n\n \nThis should alert folk to the ungodly level of Zionist influence in America back in 1967. So many high-ranking US officials, all the way up to the President, by initiating a cover up on what was nothing short of an act of war, were prepared to commit Treason. Of course, without a fully compliant media, it’s hard to imagine any of them even considering doing such a thing! Imagine – an independent media would have delved, looked and searched under every nook and cranny and as a result Americans would have inevitably discovered the truth. Had this treachery been unearthed it would have proved to be a history defining moment. It could have all stopped there but as we know Americans would go on to pay an incalculable price as would many other countries. \nThanks to Geoff Dahlgren for the caption –  \n\n \nFalse flag events as well as major assassinations require unsuspecting patsies. In the case of JFK, the Boston Bombers & Charlie Hebdo, a common denominator sticks out like a sore thumb – those allegedly responsible are known quicker than if Lieutenant Columbo was on the job! Then the accused are captured yet somehow, miraculously, never have an opportunity to write a statement or give any kind of interview. In the case of Lee Harvey Oswald this seems inconceivable. This is what nailed it for me with 9/11. An hour before the event, those who should have known something claimed they knew nothing! An hour after the event, those who claimed they knew nothing SUDDENLY KNEW EVERYTHING! At the BBC where Ehud Barak just happened to be conveniently plotted up, this Zionist war criminal was positively chomping at the bit to point the finger at Osama Bin Laden. He even had the gall to call for an all-out war on terror……. ALL AN HOUR AFTER THE EVENT! If you don’t think that stinks….. then you don’t think period! \n\n\nListen to this lying scumbag. Look at the body language. Look how he couldn’t wait to blame Bin Laden. Above all, how the hell did he know who to blame. From this I know at least one person who was part & parcel of the 9/11 plan – his name is EHUD BARAK!  \n  \nWatch Video:  \n \nAt what point does one begin to suspect something is terribly amiss? The only way this can be explained is by understanding the one specific requirement with any false flag event – YOU HAVE TO GET AWAY WITH IT! You see, even if the entire operation is a resounding success, being found out doesn’t just mean abject failure; it could very well start a ball-rolling that would mean the end for Israel & all those involved, even a major re-write of the history books! The only way to pretty much guarantee this is if you’re certain no meaningful investigation can or will ever take place. No one must delve anywhere near the truth. The only story is your story. Truthers have to ridiculed, even if they are esteemed professors; those who question the official account are branded unpatriotic, even if they’ve lost loved ones! Therefore total control over the entire mass-media is essential, indeed a prerequisite for a successful false flag operation. Otherwise these questions would be asked on national TV – \n1) What the hell happened to U.S. Civil air defense. How in the blazes could these planes fly around as if they were on a sight-seeing tour? \n2) There are 16 intelligence agencies. How could such an attack occur without any of them having any idea something big was going down? This is impossible. How could so many people drop the ball? \n3) Dan Rather and Peter Jennings immediately stated the obvious – the destruction of the Twin Towers and WTC7 had all the hallmarks of controlled demolitions, as if they were deliberately brought down. Why wasn’t this ever followed up? \n4) On the day, scores of eye-witnesses, fire-fighters and Policemen said on live TV, there were explosions going off all over the place within the Towers. Why did the media totally ignore these crucial eye-witness accounts? \n5) Similarly when the 2nd plane hit the South Tower several eye-witnesses stated on camera that it was a large grey military plane; definitely not a passenger jet. Once again the media neglected to follow up the most crucial evidence. \n6) Why didn’t they evacuate the Pentagon when they knew a hijacked plane was closing in? HOW CAN THE MEDIA IGNORE THIS QUESTION? \n \nWatch Video:  \n \n7) And speaking of the Pentagon, Norman Mineta all but grassed Dick Cheney up! He said Cheney directly issued a ‘stand-down’ order which allowed the Pentagon to be attacked \n \n\n \n8) Why didn’t the media ever investigate the incredible insurance payout to owners of the Towers Larry Silverstein and Frank Lowy and the unbelievable fact that Silverstein stipulated that he should be paid double if the Towers were destroyed in a terrorist attack? \n9) Why didn’t the media make more of Larry Silverstein’s admission that “they decided to ‘PULL’ the building (WTC7). \n10) And on the subject of WTC7, why didn’t the media question the fact that the 9/11 commission did the unthinkable by failing to mentioned the mysterious collapse of WTC7? \nAnyone can become a terrorist but if the Police and media are free to investigate, it’s a shoe in you’ll be caught. It goes without saying – the only people capable of pulling off 9/11 are those who know the media will cover up the whole sordid episode. No proper terrorist would even consider such a feat because it’s impossible! Terrorists know enough to realise even if they managed to hijack 4 planes pretty much at the same time, US civil air defense would kick in immediately. No plane would get near downtown Manhattan, not even Flight 11, the first one that hit the North Tower. It is unequivocal – each and every media baron has to be either directly or indirectly linked to the true terrorists behind 9/11. \nFor the record I’ll challenge anyone, anywhere that I’m right about everything I say regarding 9/11. Moreover, I can name another 90 patently obvious questions the media should have asked but inexplicably neglected to. \n \nhttp://gmmuk.com/14-years-on-media-lies-continue-to-wreak-havoc-its-unequivocal-without-the-guaranteed-support-of-corporate-media-911-would-never-have-made-the-drawing-board-%E2%8", "source": "Before Its News"}