{"published": "2015-09-05T05:00:00Z", "media-type": "News", "title": "Vycom’s Thermax Provides Economical Solution for Plastics Design’s Clean Room Furniture", "id": "a903d9a0-45ac-4d35-b8a5-708ac4c35d29", "content": "Plastics Design, Inc., of Chelmsford, MA, a leading fabricator of clean room equipment and furniture, has selected Vycom's Thermax for a high-profile lab equipment job, in which meeting fire and smoke standards were required. \n   \nScranton, PA (PRWEB) September 04, 2015 \n \nPlastic Design, Inc., of Chelmsford, MA, a leading fabricator of clean room equipment and furniture, has selected Vycom’s Thermax for a high-profile job with a longtime customer.  The latest product in Vycom’s Flametec family, Thermax helps fabricators like Plastic Design meet the strict requirements of Factory Mutual (FM) 4910, which are designed to reduce fire and smoke threats to worker safety and damage to delicate semiconductor wafers used in electronics manufacturing. \n \n“We always strive to provide value to our customers,” said co-owner/co-president Daryl Flynn, whose family business began in 1976.  “Thermax is a PVC that has great workability and performance, while meeting 4910 standards very economically.”  Flynn is proud of his fabrication company’s ISO 9000 registration and says quality has to be number one. \n \nFor a current job with Draper Laboratory, a not-for-profit research and development laboratory, Plastic Design is using Thermax to create cabinetry, bottle holders and large fume hoods with protective covers for a clean room lab environment. \nFlynn says semiconductors and chip manufacturing clean rooms are tough environments and the materials his company fabricates have to withstand harsh chemicals.  “We don’t want staining or corrosion on the chemical side,” he said.  “Thermax has never given us any issues with corrosion or workability.” \n \nIn fact, Plastic Design uses such high volumes of Flametec products, the company is listed as a distributor.  “The new Thermax seems to be a good fit and a way to add value to our projects,” said Flynn.  The material is also lighter weight, which is a plus for handling during manufacturing phase and results in reduced shipping costs. \n \nIn addition to FM4910, Flametec Thermax PVC also meets UL-94 V-0, ASTM E-84 and is RoHS and REACH compliant.   To learn more about Thermax, visit http://www.vycomplastics.com .   For more about Plastic Design, visit http://www.plasticdesigninc.com . \n \nAbout Plastic Design \nPlastic Design, Inc. is dedicated to resolving equipment and process issues with innovative, well-engineered solutions. Utilizing the unique properties of the many plastic materials available today, Plastic Design, Inc. supplies systems and products to meet the demanding needs of industries from biomedical and pharmaceutical to micro-electronics and photonics. \n \nAbout Vycom: \nVycom, a division of CPG International, maintains an environment where quality meets performance, with the largest range of products, capabilities and inventory for all your Olefin and PVC needs. For more information, visit http://www.vycomplastics.com . \n Read Full Article        \nFor the original version on PRWeb visit: http://www.prweb.com/releases/VycomThermax/PlasticsDesign2015/prweb12944887.htm", "source": "Stamford Advocate"}