{"published": "2015-09-22T17:59:14Z", "media-type": "News", "title": "Eva Carneiro leaves Chelsea - to FA board member's dismay", "id": "bf50e97c-1e22-448d-abbb-9a6c5c0b72f2", "content": "Football Association board member Heather Rabbatts has expressed her \"sadness and anger\" at news of Chelsea team doctor Eva Carneiro's departure from the club. \n \nCarneiro is understood to have parted company with Chelsea following the incident on the opening day of the season when she was criticised by manager Jose Mourinho. It is understood likely that she will launch a claim for constructive dismissal. \n \nRabbatts said Carneiro had been subjected to verbal abuse and criticism after running on to the pitch to treat Eden Hazard - Chelsea were then temporarily reduced to nine  men against Swansea as Hazard had to leave the field. \n \n\"News of Dr Eva Carneiro's departure from Chelsea FC makes me feel sadness and anger,\" said Rabbatts, who is chair of the FA's inclusion advisory board. \n \n\"Eva was one of the few very senior women in the game, a highly respected doctor who has acted with professional integrity in difficult circumstances and whose skills have been highly praised by her colleagues, the club and governing bodies.\" \n \nCarneiro has not been at Chelsea's Cobham training ground since she was removed from first team duties on August 8. Rabbatts said she had been effectively demoted for doing her job properly. \n \nA Chelsea spokesman said he could not comment on internal staffing matters. \n \nRabbatts added: \"On the 8th August Eva fulfilled her duty as the senior medic and responded to the referee to enter the field of play to treat a player. Any other response would have been a dereliction of her duty and a breach of GMC guidelines as confirmed recently by the organisation of Premier League doctors. \n \n\"In acting properly she was then subject to verbal abuse and public criticism and in effect demoted by her removal from the bench. \n   Promoted stories   \n\"Her departure raises a serious question on how players are safeguarded if their medical support is compromised.\" \n \nCarneiro was also the victim of sexist abuse from opposing fans last season. The FA is still investigating a complaint from a member of the public that Mourinho used sexist language towards her after the incident on August 8 - he denies doing so. \n \nRabbatts added: \"In addition, as chair of the Inclusion Advisory Board, I have a responsibility to support women in the game and Eva has been a role model for many girls and women who aspire to work in football. Her treatment sends all the wrong messages. \n \n\"The footage of the abuse she has endured in silence from the stands during her career is something we should all be ashamed of. \n \n\"Being passionate about the game is also about standing up against abusive chanting, bullying and insults to a fellow professional. \n \n\"As a member of the board of the FA, I can make no comment on the FA investigation currently under way and this is rightly a matter for the regulation team. \n \n\"However, I believe that all those who have an interest in these issues and who have a duty to safeguard relevant policies and procedures raise their voice in support of Eva and question how she has been treated. \n \n\"I hope that Eva's own situation can be resolved quickly and positively, that she will be able to continue to work in a senior position within the game and that steps are taken to ensure that professional integrity is protected and women are properly encouraged to be a part of our national game, including at elite level.\" \n \nThe issue of team doctors has been discussed by the FIFA medical committee as a result of the incident. \n \nEarlier this month, FA chief executive Martin Glenn said: \"We work to a FIFA mandate on medical support. The duty of the doctor is to the player, not the employer. It is the Hippocratic oath. \n \n\"It is an issue for Chelsea to sort out but I don't believe they are playing a dangerous game.\" \n \nMinutes after the final whistle of the opening-day game, Mourinho explained why he  was upset with Carneiro and head physiotherapist Jon Fearn. \n \nHe said : \"I was unhappy with my medical staff. They were impulsive and naive. \n \n\"Whether you are a kit man, doctor or secretary on the bench you have to  understand the game. \n \n\"You have to know you have one player less and to assist a player you must be  sure he has a serious problem. I was sure Eden did not have a serious problem.  He had a knock. He was tired.\" \n \nThe Football Association has received a complaint against the Chelsea boss, it was confirmed last week. \n \nPrior investigation into the incident in question has shown Mourinho is  likely to avoid a reprimand from the FA, unless new evidence comes to light. \n   \n Share article  \n   \nMourinho is thought to  have said \"filho da puta\", which translates as \"son of a bitch\", on the  touchline in footage which was swiftly uploaded to the internet.  It is understood the complaint received by the FA claims Mourinho said \"filha  da puta\", which translates as \"daughter of a whore\". \n \nThe complainant was implying Mourinho was referring to Carneiro directly after  she followed Fearn on to the field to treat Hazard, but the comment has  already been examined.", "source": "This is the West Country"}