{"published": "2015-09-17T09:40:13Z", "media-type": "Blog", "title": "Exchange Your Skills for Free Accommodation with Worldpackers", "id": "afe4b326-72b4-4c2d-975d-3cb46b6a7b7e", "content": "Brought to you by Worldpackers \n \nPicture this. \n \nHuge barracuda and trevally jump onto your line while crocodiles patiently watch with one eye above the water. \n \nYou’ve not long finished your shift out on the boats, working in a pristine area that can only be accessed by water or by air. It’s also a favourite birthing place for humpback whales. \n \n\n \nA short walk takes you to a freshwater spring – a safe swimming hole. Snakes and dingoes roam around the campsite and ancient aboriginal rock art adorns the red rocky escarpments cliff walls. \n \nFrom up here, you can see out over the boab-lined bay, brilliant blue water and nearby islands. \n \nRemote. Wild. Stunning. \n \nYou laugh at the luxury tourist boats that cruise on by – they’re paying around $1,000 for the privilege. You’re getting this experience for free every day as well as a cute cabin for a home and up to three meals a day. \n \nSure beats the cubicle. \n \nThis is what can happen when you look at travel as a portal for having unique and life changing experiences that costs you hardly anything. \n \nWe love and are always blowing the working holiday horn! \n \nFrom the top of the Golden Mountain with my students \n \nNot only does a working holiday save you money (and earn you some too) but it helps you get a deeper appreciation and understanding of the local culture. \n \nOur richest travel memories come from our experiences living and working in other countries. \n \nWe frequently receive emails from people wanting to travel but are worried about the money, or losing out on their careers. \n \nWorking holidays can help you fill that gap, adding and improving your CV. Employers are looking more favourably on hiring people who’ve had life experiences. \n \nYou can’t get better than working in another country. It doesn’t have to be working for salary either, volunteer working achieves the same purpose and can often be easier to find. \n How to get free accommodation when you travel  \n\n \nSometimes, you might not want to live long-term in a place and get a real job. You just might want to pick up some work, or exchange your skills for a few weeks as you’re passing by a region or country. \n \nJust something to keep your travel funds full so you can travel for longer and have better stories to tell. \n \nI’ve met plenty of people on my travels who have cleaned hostel rooms, handed out party flyers, or served behind bars, just to get free accommodation. \n \nA friend worked the bar for a couple of hours a night at a hostel on the Greek Island of Ios. He stayed there for the entire summer and had a blast! \n \nAccommodation is often one of your biggest travel expenses – a couple of hours of work a day can give you more cash for travel fun. \n \nThanks to the amazing internet world, finding these experiences are much easier than my Aussie mate in Ios – he just had to turn up to the island with his cheeky grin and hope for the best. \n Worldpackers – exchanging skills for accommodation platform  \n\n \nWorldpackers is an online community that connects travelers looking to exchange their skills for accommodation with incredible hosts from all around the world. \n \nIt’s founded by two travellers, who often exchanged their skills for accommodation. \n \nWorldpackers works for anyone who likes travelling and saving on accommodation, plus those who like to have meaningful, local experiences. \n \nWhether you’re a student, a gap year traveller, or sick of the daily grind, you can join Worldpackers and find places where you can  exchange your skills for accommodation. \n \nWorldpackers likes to view it more than just doing work to get a free bed. To them it’s about collaborating, sharing your unique experiences and skills with the hosts who chose you as their volunteer and also the guests staying there. \n \nI really love the soulful concept behind this. It’s focused on rich travel experiences. \n How Worldpackers works  \n\n \nIf you consider yourself as someone with any sort of talent and a love for travel and meaningful experiences, sign up to Worldpackers.  \n \nCreate a profile, including where you would like to go and what kind of experience you would like to have. Once you have a profile you can find the right experience for you. \n \nYou can search for host/volunteer experiences based upon the skills you offer, location and dates of travel. \n \nWorldpackers also sends personalised emails to users based on their profile (skills, languages, wishlist, hosts they have visited). \n  Most hosts look for help (on average) for 2 weeks, 25 hours per week with 2 days off (and often meals). You can stay with a host from 2 weeks – 3 months  Worldpackers have hosts in over 92 countries and over 65,000 registered users.  All hosts are verified as safety is paramount  Volunteers/host can review each other after their exchange  Each host offers a volunteer position which lets users see exactly what will be required of them  You can travel with Worldpackers for free (getting endorsements below) or pay USD$50 trip per trip confirmation . It’s free to join the community.  You can travel for free by getting your friends to endorse you. Endorsements are where you can get your friends to vouch for what your skills are.  Worldpackers offers 24/7 support to travellers. You get your own personal travel expert before, during, and after your trip.   Skill exchange experiences for Worldpackers include:   making caipirinhas in Rio de Janeiro  welcoming guests at reception in the Swedish countryside  Zen gardening in Japan (like the sound of this!)  a musician at Coral Bay, Ningaloo Reef (OMG – do you know how amazing this place is? Seriously awesome opportunity.)  teaching sports at a school in Ghana!  hosts include hostels, eco villages, pousadas and guesthouses   \n(and many more. I had to actually kick myself off the site because I was getting lost checking them all out!) \n \nCaz in Malawi, Africa \n \nYou can read other traveller experiences with Worldpackers: \n  Daniel who exchanged his video editing skills with a hostel in Lisbon, Portugal. Read more .  Sylvia who exchanged her administrative skills with a hostel in Brazil (and improved her English while there). Read more   My thoughts on Worldpackers  \nI want to be a backpacker again!! Ah the fun and freedom. I wish there were innovative platforms and communities like this available when I did travel pre-kids. \n \nWorldpackers is a great way to find those enriching travel experiences that can also help you save money. I also think it’s a fantastic opportunity to learn another language and give back to the local community you travel through. \n \nI think Worldpackers is an easy platform to use and takes away the hassle of you trying to find these unique experiences yourself. I’ve done the door-to-door knocking thing before to find them and it sucks! \n \nOnce you’ve found the perfect match, I think the fee Worldpackers charges is of great value. \n \nYou can find an opportunity that might change your life from your living room. For anyone wanting to experience Australia, I highly encourage you to check out that Ningaloo experience! There are non-muso positions as well!! \n \nThis is Coral Bay: \n \nCoral Bay, Western Australia \n \nWorldpackers is only quite new, I’m looking forward to seeing how it evolves and how the number of skill accommodation exchange opportunities increases. \n \nI really like the concept and am happy to share them with you. You can check it out more yourself here. \n \nThese will be the experiences that will change our life and the stories you’ll share over and over again. \n \nHave you exchanged skills or services for  accommodation before?  \n \nShare your story in the comments. \n \nExchange Your Skills for Free Accommodation with Worldpackers \nThanks so much for subscribing! Don't forget to sign up for our monthly newsletter and free ebook> Connect with us on facebook>", "source": "y Travel Blog"}