{"published": "2015-09-14T11:30:00Z", "media-type": "News", "title": "Newmarket Gold Continues to Intercept High-Grade Visible Gold Mineralization at Fosterville Eagle Fault Discovery, Strong Potential to Increase Mineral Resources", "id": "ec2d1934-d620-4b75-8a7f-0d745c2c903d", "content": "VANCOUVER, BRITISH COLUMBIA -- (Marketwired) -- 09/14/15 -- Newmarket Gold (\"Newmarket\" or the \"Company\")(TSX: NMI) is pleased to announce positive drill results from an additional 28 holes, totaling 7,157 metres (m), at the Fosterville Gold Mine, Victoria, Australia. These holes represent the balance of the first half of Fosterville's 2015 exploration program. Drilling outside of current mineral resources focused on further defining and exploring targets on the Phoenix, Lower Phoenix, Lower Phoenix Footwall, East Dipping, Kestrel and newly identified Eagle Faults (Figures 1, 2 and 3). Drill results include continued intercepts of high-grade gold mineralization with the Eagle Fault discovery returning intervals of significant visible gold. To date, drill results indicate the continuance of high-grade zones to depth and suggest strong potential to increase Fosterville's Mineral Reserves and Resources. \n\nHighlights and Key Drill Intercepts (Outside Mineral Resources Reported December 2014) \n\n(1) Visible gold present in drill intercept, ETW - Estimated True Width, All drill results are presented in Table 1 \n\nMr. Douglas Forster, President and Chief Executive Officer, Newmarket Gold commented: \"Ongoing drilling at Fosterville continues to intercept high-grade gold mineralization containing visible gold in previously undrilled areas proximal to current infrastructure. Drilling results associated with the Eagle Fault, East Dipping Faults and Lower Phoenix zones are extremely encouraging as they extend the size of our discovery and support our view that gold grades are continuing to increase at depth. All of the high-grade Eagle drill intercepts reported to date are located outside of Newmarket's December 31, 2014 Indicated Mineral Resources but will be included in the 2015 year-end Mineral Resource and Reserve update.\" \n\nFosterville Drilling Program \n\nSince Newmarket's press release announcing the high-grade Eagle Fault discovery, dated July 27, 2015, Drilling at Fosterville has continued to focus on definition and exploration of multiple targets including the Phoenix, Lower Phoenix, Lower Phoenix Footwall, East Dipping, Kestrel and newly identified Eagle Faults. The reported results are outside of Measured and Indicated Resources from 28 drill holes (7,157 m) at a cost of US$0.85M. A total of four underground diamond drill rigs were in operation during this period. Additionally during this period, mining activities continued on the upper plunge areas of structures like the Eagle Fault with reconciliation and metallurgical recoveries performing well, suggesting future mineralization identified in these systems will provide additional ounces to the Fosterville Mine. \n\nAll drill assay intercepts are provided in Table 1 and drill collars in Table 2. \n\nEagle and East Dipping Faults \n\nResults from a total of 13 drill holes have been returned from holes targeting the down plunge extensions of the Eagle Fault between the 6,575 m North (mN) and 6,850 mN since the press release dated July 27, 2015 (Figure 4). These results reaffirm the structural continuity and grade tenor of the Eagle Fault over a strike length of approximately 500 m. The structure continues to provide significant opportunity for Mineral Reserve and Mineral Resource growth laterally and adjacent to existing Mineral Reserves within the Lower Phoenix zone. The most significant intercept of 16.38 g/t Au over 18.0 m (ETW 16.56 m) in hole UDH1364 is associated with the junction of the west dipping Lower Phoenix and east dipping Eagle Fault and exhibits visible gold mineralization. \n\nIn addition, intercepts from 12 drill holes between the 6,550 mN and 7,000 mN have further defined East Dipping mineralized faults, footwall to the Lower Phoenix Fault (Figure 4). Several of these intercepts host substantial visible gold mineralization including hole UDH1321 which returned 141.1g/t Au over 5.8 m (ETW 4.59 m). East Dipping fault mineralization proximal to west dipping fault junctions continue to provide encouraging resource growth potential at Fosterville. \n\nIn the second half of 2015, drilling will continue to focus on the down plunge extents of known Eagle and East Dipping fault mineralization to increase confidence southwards to the 6,550 mN as well as test beyond the down plunge extents of the known mineralization from the Central Decline drill platform. The Central Decline drill platform is planned to extend southwards to provide drilling platforms to support further drill testing of these highly prospective easterly dipping structures. \n\nLower Phoenix, LPFW and Phoenix \n\nResults from a total of 6 drill holes have been returned from holes targeting down dip extensions of the westerly dipping Lower Phoenix Fault between the 6,850 mN and 7,050 mN (Figure 4). Significant drill intercepts below current Measured and Indicated Mineral Resources that have high potential to increase Mineral Reserve and Mineral Resource growth to the north above the 4,200 mRL include UDH1314 6.03 g/t Au over 10.2m (ETW 5.54 m) and UDH1316 6.36 g/t Au over 3.7 m (ETW 2.45 m). Down-dip drill targeting of the Lower Phoenix Fault from footwall drill positions is scheduled to continue in the second half of 2015, between 7,050 mN and 7,400 mN, and will test the northern resource potential above the 4,200 mRL. Down-plunge definition of the Lower Phoenix Fault southwards to the 6,500 mN will also be undertaken from drill rigs positioned in the C4440 Drill Drive. \n\nFurther significant mineralization associated with Lower Phoenix Footwall westerly dipping faults adjacent to the Lower Phoenix Fault (Figure 2) has also been identified through 7 hole intercepts between 6,575mN and 7,000 mN (Figure 4). Drill holes UDH1322 intersected 16.83g/t Au over 11.1 m (ETW 1.68 m) and UDH1222 352.2g/t Au over 0.5 m (ETW 0.38 m) demonstrating that these structures continue to host high grade mineralization with the latter hosting visible gold mineralization. \n\nResults returned from 3 drill holes targeting along-strike and down-dip extensions of the Phoenix Measured and Indicated Mineral Resource (Figure 4). The best result was from hole UDH1303 which returned 7.91 g/t Au over 6.9 m (ETW 5.07 m) demonstrating growth potential down plunge of the existing December 2014 Mineral Reserve. Drilling on this structure in the second half of 2015 will primarily be undertaken from the Central Decline as it advances southwards. Down plunge extents will be adequately tested to the 6,350 mN and will test the continuity of structure and grade between the existing Mineral Reserve and UDE113A (as reported in the press release dated July 27, 2015). \n\nIn addition to continued resource definition drilling on the Lower Phoenix structure, Newmarket will initiate three surface based growth exploration drill holes totaling US$1.5 million in in the second half of 2015. These drill holes are designed to target the projected down-plunge and up-plunge extensions of the Lower Phoenix system, at step outs of 200 m and 230 m respectively, beyond the current delineated extents of mineralization (Figure 3). Results from these programs will determine resource potential ahead of current mine developments to optimize life of mine capital plans. \n\nTo view Figure 1, please visit the following link: http://media3.marketwire.com/docs/1024813_1.jpg\n\nTo view Figure 2, please visit the following link: http://media3.marketwire.com/docs/1024813_2.jpg\n\nTo view Figure 3, please visit the following link: http://media3.marketwire.com/docs/1024813_3.jpg\n\nTo view Figure 4, please visit the following link: http://media3.marketwire.com/docs/1024813_4.jpg\n\nQualified Person \n\nMark Edwards, MAusIMM (CP), MAIG, General Manager, Exploration, Newmarket Gold, is a \"qualified person\" as such term is defined in National Instrument 43-101 and has reviewed and approved the technical information and data included in this press release. \n\nQAQC information is provided at the bottom of Table 1. \n\nON BEHALF OF THE BOARD \n\nDouglas Forster, M.Sc., P.Geo. \n\nPresident & Chief Executive Officer \n\nAbout Newmarket Gold Inc. \n\nNewmarket Gold is a Canadian-listed gold mining and exploration company with three 100% owned operating mines across Australia. The Company is focused on creating substantial shareholder value by maintaining a strong foundation of quality gold production, over 200,000 ounces annually, generating free cash flow and maintaining a large resource base as it executes a clearly defined gold asset consolidation strategy. The Company is focused on sustainable operating performance, a disciplined approach to growth, and building gold reserves and resources while maintaining the high standards that the Newmarket Gold core values represent. \n\nCautionary Note Regarding Forward Looking Information \n\nCertain information set forth in this news release contains \"forward-looking statements\", and \"forward-looking information under applicable securities laws. Except for statements of historical fact, certain information contained herein constitutes forward-looking statements, which include the Company's expectations about its business and operations, and are based on the Company's current internal expectations, estimates, projections, assumptions and beliefs, which may prove to be incorrect. Some of the forward-looking statements may be identified by words such as \"will\", \"expects\", \"anticipates\", \"believes\", \"projects\", \"plans\", and similar expressions. These statements are not guarantees of future performance or outcomes and undue reliance should not be placed on them. Forward-looking statements are based on the opinions and estimates of management as of the date such statements are made and they are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking statements or forward-looking information. Although management of the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. The Company does not undertake to update any forward-looking statements or forward-looking information that are included in this press release or incorporated by reference herein, except in accordance with applicable securities laws. Newmarket Gold has in place quality-control systems to ensure best practice in drilling, sampling and analysis of drill core. All diamond drill hole collars (Table 2) are accurately surveyed using a Leica Total Stations instrument and down hole deviations are measured by electronic multi-shot cameras. \n\nAll reported drill intercepts are from NQ2 sized diamond drill core that was either whole core sampled or cut longitudinally in half with a diamond saw depending on the requirements to keep core for future reference. In the cases of sawn drill core, one-half of the drill-core was sent for assay and the other half retained for reference. Drill core sample intervals vary between 0.2 and 1.5m in length and were determined from logging of sulphide and visible gold. Were recognized in drill core all visible gold zones have been noted in the tables reported above. \n\nAssay results are based on a 25-gram charge fire assay. Mean grades are calculated using a variable lower grade cut-off (generally 2 g/t Au) and maximum contiguous 2m internal dilution. No upper gold grade cut has been applied to the data. However, during future resource work the requirement for assay top cutting will be assessed. \n\nDrill samples from Fosterville were assayed at On Site Laboratories Pty Ltd, an independent laboratory in Bendigo, Victoria. The facility is registered ISO9001:2008 (CERT-C33510). A lesser number of samples were also assayed at Gekko Systems in Ballarat, Victoria. \n\nAll Mine Geology and Exploration teams conduct site audits and reviews from time to time at the independent laboratories as well as conduct intra-laboratory analysis of results to test the quality of reported results. All reviews of QAQC data has not identified any significant issues that cannot be resolved prior to results being used for modelling or reporting. \n\nContacts:\n\nNewmarket Gold, Inc.\n\nLaura Lepore\n\nDirector, Investor Relations\n\n416.847.1847\n\nllepore@newmarketgoldinc.com", "source": "Stock Nod"}