{"published": "2015-09-02T05:12:58Z", "media-type": "News", "title": "Field hockey team triumphs over Red Dragons in 3–1 win 1 hour ago | Sports", "id": "e1495e6a-8928-4a61-a495-6ead7c2f27bc", "content": "  Yana Mazurkevich/The Ithacan \n \nJunior defender Hannah Gerber dribbles the ball past two defenders during the team's match against Utica College on Oct. 11, 2014, at Higgins Stadium. \n  \nThe Ithaca College field hockey team kicked off its 2015 campaign Sept. 1 against SUNY Oneonta in a neutral site competition at Hartwick College. The Bombers were looking to improve on their 8–8 record from last year, which included a 2–0 win over the Red Dragons, who finished 11–8 last season. \n \nThe Bombers wasted little time, peppering Oneonta’s senior goalkeeper Krista Servedio, with three shots in the first six-plus minutes of action. It was the fourth shot, however, that found the back of the net for the Bombers’ first tally of the season. Junior forward Colleen Keegan-Twombly tipped in a shot from the top of the circle off the stick of senior back Caitlin O’Brien for an early 1–0 lead. \n \nTen minutes later, the Bombers extended their lead when junior forward Cassie Schuttrumpf came up with a loose ball and knocked it home for a 2–0 advantage. The offensive onslaught did not stop there. Sophomore Amanda Schell got in on the action, netting her first goal of the year off a rebound to boost the Blue and Gold to a 3–0 lead. \n \nThe Red Dragons finally broke through in the 28th minute, with senior Hannah Hayward tallying her first goal of the season, off an assist from freshman Allyson Wells, a dribbling shot that found its way past the South Hill squad’s junior goalkeeper Katie Lass, making it a 3–1 Bombers game. \n \nThe offensive fireworks diminished as the second half got underway. The Bombers added only four shots to bring their shot total on the night to 17, while the Red Dragons were held to just three shots, for a total of seven on the evening. Lass made a key save late in the game, but the Red Dragons never mounted a serious rally and the game ended in a 3–1 Bombers victory. \n \nWith the win, the South Hill squad moves to 1–0, while the loss drops SUNY Oneonta to 0–1. The next contest for the Bombers will be their home debut against Washington College at 1 p.m. Sept. 5 at Higgins Stadium.", "source": "Ithacan"}