{"published": "2015-09-12T13:33:15Z", "media-type": "Blog", "title": "Westlife - Angel's Wings lyrics", "id": "318a19c8-1cca-4090-9734-66c94a450a1a", "content": "3 meanings Write my explanationnew\nTo explain lyrics, select line or word and click \"Explain\".\nCreate lyrics explanation Select some words and click \"Explain\" button. Then type your knowledge, add image or YouTube video till \"Good-o-meter\" shows \"Cool\" or \"Awesome!\". Publish your explanation with \"Explain\" button. Get karma points! OK, got it!\nNew! Read & write lyrics explanationsHighlight lyrics and explain them to earn Karma points. Westlife – Angel's Wings lyrics\nI would die for you\nLay down my life for you\nThe only thing that means everything to me\n'Cause when you're in my arms\nYou make me prouder than\nThan anything I ever could achieve\nAnd you make everything that used to seem so big\nSeem to be so small since you arrived\nOn angel's wings, an angelical formation\nAngel's wings, like letters in the sky\nNow I know no matter what the question\nLove is the answer\nIt's written on angel's wings\nAnd I often wonder why,\nSomeone as flawed as I\nDeserves to be as happy as you make me\nSo as the years roll by\nI'll be there by your side\nI'll follow you wherever your heart takes me\nCause you make everything that used to be so big\nSeem to be so small since you arrived\nOn angel's wings, an angelical formation\nAngel's wings, like letters in the sky\nNow I know no matter what the question\nLove is the answer\nIt's written on angel's wings\nNow anyone who's felt the touch of heaven in their lives\nWill know the way I'm feeling, looking\nIn my baby's eyes\nThat's why I can't bear to be too far away\nI know that god must love me cause\nHe sent you to me on angel's wings\nOn angel's wings, an angelical formation\nAngel's wings, like letters in the sky\nNow I know no matter what the question\nLove is the answer\nIt's written on angel's wings\nLove is the answer\nIt's written on angel's wings\nLyrics taken from http://www.lyricsmode.com/lyrics/w/westlife/angels_wings.html\nExplanations\nnew\nTo explain lyrics, select line or word and click \"Explain\".\nMeanings\nShare\nlink: Embed: Email\nPrint\nCorrect\nAdd song structure elements Click \"Correct\" to open the \"Correction form\". There you can add structure tags, correct typos or add missing words. Send your correction and get karma points! Result of your work will appear after moderating. OK, got it!\nTweet\nLike\nTweet\n+1\nhotlyrics\nDrag Me Down\nOne Direction\nShe's Kinda Hot\n5 Seconds Of Summer\nGood For You\nSelena Gomez\nCan't Feel My Face\nThe Weeknd\nTrap Queen\nFetty Wap\nWorth It\nFifth Harmony\nsongmeanings BestRecent3 meanings u\n0UnregisteredMar 24, 2012 at 5:13 am\nMy daughter gave birth to her first child little did we know we would have to bury him exactly 2 years, 8 months to the day of his birth. My daughter was an amazing young mom, she worship her son, she would have changed places with him in a heart beat. I am so happy there is also another song out there called precious child who have given me permission to play my grandson's video on utube, I just wished westlife would let us all use their song for our little ones memorial, like I am not selling it or making money on their song, I just loved the song and wanted to add it to joshua's memorial. Joshua came into my daughter's life at the right time, he changed her and she went on to the right side of life, he saved her,. So joshua arrived on angel's wings, and saved her for awhile. Add your reply\nu\n0UnregisteredNov 8, 2011 at 6:03 am\nI believe there are no lyrics that can mean more than this do, I am not regretting but I just loosed some one so special, I let him go and am happy he is happy because I could never make him happy, I was a broken soul and may be still am. But he was an angel he did evrything he could for me, it was unbelivable he was like my back and call, he was there no matter what. He didn't see my flaws he dindnt even lookfk father he just loved me all the way. He was an angelical formation. Peter what ever you are doing just know you are appriciated and I hope you get to be so happy. Love sophie. Add your reply\n0caseysbabyNov 17, 2008 at 7:37 pm\nI have never heard this song before. I was just looking through the westlife lyrics and stumbled across this song. And I absolutely love it! It made me cry when I read the words, and they are so true. This song reminds me of the love I have for my boyfriend and how he has made my life so much happier. I love you baby and I love this song! Add your reply\nWrite about your feelings and thoughts\nKnow what this song is about? Does it mean anything special hidden between the lines to you? Share your meaning with community, make it interesting and valuable. Make sure you've read our simple tips\nHey! It's useful.\nIf this song really means something special to you, describe your feelings and thoughts. Don't hesitate to explain what songwriters and singer wanted to say. Also we collected some tips and tricks for you: Don't write just \"I love this song.\" Hidden between the lines, words and thoughts sometimes hold many different not yet explained meanings Remember: your meaning might be valuable for someone Don't post links to images and links to facts Write correctly Don't spam and write clearly off-topic meanings Don't write abusive, vulgar, offensive, racist, threatening or harassing meanings Do not post anything that you do not have the right to post Please note: We moderate every meaning\nFollow these rules and your meaning will be published. Write song meaning Type your knowledge till \"Good-o-meter\" shows \"Awesome!\". Then send your meaning with \"Post meaning\" button. Get karma points! OK, got it!\nU\nSign up or log in with Post meaning\nMin 50 words Not bad Good Awesome! Lyrics→Westlife→Angel's Wings lyrics This page is missing some information about the song. Please expand it to include this information. You can help by uploading artist's image, adding song structure elements or creating lyrics explanation. more artist lyrics\nMy Love\nI Wanna Grow Old With You\nYou Raise Me Up\nIf I Let You Go\nI Lay My Love On You\nI Have A Dream\nFlying Without Wings\nSeasons In The Sun\nFool Again\nAll Westlife Lyrics →\nFeaturedlyrics·California Cruisin' LyricsJustin Bieber·Jealous LyricsNick Jonas·Love Me Harder LyricsAriana Grande·Uptown Funk LyricsMark Ronson·I Really Like You LyricsCarly Rae Jepsen·All Of Me LyricsJohn Legend·Dear Future Husband LyricsMeghan Trainor·Chandelier LyricsSia·Take Me To Church LyricsHozier\nExplain\nView 10 more explanations\nAdd your explanation\nWrite an explanation\nUsername\nYour explanation\nBoldItalicLinkAdd an image new!\nExplain\n20 words Good Cool Awesome! Explanation guidelines:\nDescribe what artist is trying to say in a certain line, whether it's personal feelings, strong statement or something else. Provide song facts, names, places and other worthy info that may give readers a perfect insight on the song's meaning. Add links, pictures and videos to make your explanation more appealing. Provide quotes to support the facts you mention. Before you get started, be sure to check out these explanations created by our users: good, very good, great. ×\n×\nCongratulations!\nKeep posting annotations and earn\nrespect from LyricsMode community. Yep, I'm cool!", "source": "New lyrics for Sep-12-2015 at LyricsMode.com"}