{"published": "2015-09-21T22:24:47Z", "media-type": "News", "title": "U.S. ALS Diaphragm Pacing Study Showing Safety and Benefit Trend Is Suspended Due to Slow Recruitment", "id": "3c993310-3fe5-4ea6-b1a3-87ccaf64230e", "content": "PR Newswire \n \nCLEVELAND, Sept. 21, 2015 \n   \nCLEVELAND , Sept. 21, 2015 /PRNewswire/ -- Synapse Biomedical Inc. ( www.synapsebiomedical.com ) received word that the Northeast ALS Consortium (NEALS) Data and Safety Monitoring Board (DSMB) has recommended suspending new enrollment of the NEALS randomized control trial (RCT) of diaphragm pacing in patients with ALS. While there was no safety concern seen in the interim analysis, the decision is based on slow recruitment and inability to meet enrollment benchmarks in the next six months. The interim data analysis also indicated a trend toward a benefit to ALS patients using the NeuRx ® Diaphragm Pacing System. In fact the DSMB has recommended that the investigators continue to follow (with pacing in those patients who were implanted) all enrolled patients. In a letter on September 16 to study sites, the principal investigators stated that they plan to completely reassess all available data in 6 months and ask the DSMB to reconsider its recommendation to suspend enrollment if the data continues to indicate the lack of risk and possible benefit to patients. \n \n\"Obviously we are disappointed that enrollment in this study has been this slow, but we are still committed to continuing to study the diaphragm pacing system for ALS patients,\" said Anthony Ignagni President /CEO of Synapse Biomedical, \"We are confident in the safety and therapeutic utility of DPS when patients are carefully selected and screened according to FDA approved criteria. We will pour our support behind the U.S. Post Approval Study (PAS). The PAS has already surpassed its initial enrollment target and interim data shows a positive benefit for ALS patients. In fact the PAS exceeds the survival results as reported in the IDE pivotal trial with 21 months survival from implant.\" \n\n\"There is a select group of patients that diaphragm pacing works in and we need to continue to do research in ALS to continue to confirm the results and optimize patient selection.\" said Dr. Raymond Onders , co-inventor of the NeuRx DPS ® and Professor of Surgery, Remen Chair in Surgical Innovation, University Hospitals Cleveland Case Medical Center. . \n \nAbout   NeuRx DPS ® Technology \nNeuRx Diaphragm Pacing System ® (NeuRx DPS ® ) is a four-channel, battery-powered neurostimulator with implanted electrodes. The device provides electrical stimulation to the muscle and nerves of the diaphragm. The NeuRx DPS ® received CE Marking (CE Registration #518356) on November 20, 2007 and is approved for treating patients with diaphragm dysfunction in the European Union. The NeuRx DPS ® received FDA approval for ventilator dependency from spinal cord injury on June 17, 2008 . In Spinal Cord Injury (SCI), the NeuRx DPS ® provides ventilator support in patients with diaphragm dysfunction of neuromuscular origin. Diaphragm dysfunction can result in abnormal or absent respiration in patient populations of high-level spinal cord injury and other injuries or diseases affecting the neuromuscular respiratory pathways. \n \nThe NeuRx DPS ® received FDA approval for treating chronic hypoventilation from ALS on September 28, 2011 . The NeuRx DPS ® has demonstrated that it can help people with ALS live longer and sleep better than the current standard of care, alone. \n\nFor more information please visit www.synapsebiomedical.com/products/patientInfo.shtml \n \nPhoto - http://photos.prnewswire.com/prnh/20150921/269034 \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/us-als-diaphragm-pacing-study-showing-safety-and-benefit-trend-is-suspended-due-to-slow-recruitment-300146562.html \n\nSOURCE  Synapse Biomedical Inc.", "source": "Reuters"}