{"published": "2015-09-08T16:17:41Z", "media-type": "News", "title": "Amaya Enters U.S. Daily Fantasy Sports Market By Launching 'Starsdraft By Pokerstars'", "id": "aba0bb8b-8879-41cf-8554-1070a2d565c6", "content": "Reddit   Email  Print  Reprint     \n AUSTIN, Texas , September 8, 2015 /PRNewswire/ -- \nAmaya Inc., (Nasdaq: AYA, TSX: AYA) (\"Amaya\"), a leading consumer technology company and owner of PokerStars, the world's largest online poker site, today announced the launch of StarsDraft by PokerStars, a Daily Fantasy Sports (DFS) website, ahead of the start of the NFL season. Amaya acquired Austin -based DFS site Victiv.com in August and its management team, led by CEO Matthew Primeaux , has re-branded the site and integrated it into the PokerStars platform. \n   \"PokerStars is one of the most dominant and trusted brands in online gaming. We're proud to add our innovative platform to Amaya's portfolio of leading technology companies, and offer the thrill of daily fantasy to sports fans across the country,\" says Matthew Primeaux , CEO of StarsDraft. \"Amaya's gaming brands have more than 95 million registered players globally, including an estimated 1 in 10 U.S. adults. With the launch of StarsDraft by PokerStars, we provide a safe and secure daily fantasy sports experience that millions of U.S. consumers can trust.\" \nStarsDraft features a user-friendly and intuitive platform that makes drafting your favorite athletes each day a thrill. In combination with Amaya's extensive IT infrastructure, which manages millions of micro-transactions every hour, and best in class customer experience teams, StarsDraft brings fantasy sports fanatics an unrivaled playing experience. \nStarsDraft provides first time users a simplified and effortless way to learn to play by offering a unique set of games named Bankroll Builder. Free to enter, but with real-money prizes, Bankroll Builder offers users the opportunity to participate in practice sessions against a computer-generated opponent to build skill and learn the game in a no-risk environment. Another original feature, the Victron, which is beneficial to both new and experienced users, allows the player to research and build a lineup with ease by simply adjusting sliders to weight which stats are most important to them. \n         1 of  2", "source": "TheStreet.com"}