{"published": "2015-09-10T09:55:03Z", "media-type": "News", "title": "Cash Converters International Ltd (CKKIF) Strategy Update, Board and Management Changes", "id": "f21359b6-8940-47f9-b29a-804f9c53680b", "content": "- (ABN Newswire) - In FY2015 Cash Converters International Ltd (ASX:CCV) (OTCMKTS:CKKIF) (\"the Company\") faced a number of operational and regulatory challenges. Despite these factors the business operations in Australia generated revenue growth and a strong underlying profit. The Company has a strong market position, a well-established store network, a rapidly growing online business and a product range that provides a solid platform to expand the business going forward. However, the Company also recognises that in a rapidly changing market it needs to review the way it manages itself and how it continues to evolve. As a result of these challenges the Company today has announced three key changes: \n\n1. Board Change \n\nMr Reginald Webb has advised the Company that he intends to retire from the Board following completion of the 2016 financial year. To assist in the transition of the Chairman role Mr Stuart Grimshaw has today been appointed as interim Non-Executive Chairman and will immediately undertake a review of the Company's Board structure and composition. \n\nMr Webb has been Chairman of the Cash Converters Board since January 2005 and he has provided the Company with strong leadership over a time that has seen the Company's performance improve dramatically. We are grateful that he is available to assist during the transition period. \n\nMr Grimshaw joined the Board in November 2014 and is a very experienced financial services executive with over 30 years' experience in the industry. Mr Grimshaw is currently Chief Executive Officer of EZCorp Inc and prior to this was Chief Executive Officer and Managing Director of Bank of Queensland Ltd. During his 30-year career in financial services, Mr Grimshaw has held a wide variety of other roles across many functions of banking and finance, including eight years at the Commonwealth Bank of Australia (CBA) which, amongst other roles, included him being the Chief Financial Officer for that Company. \n\n2. Appointment of CEO, Australia \n\nThe Company is pleased to announce the appointment of Mr Mark Reid to the position of CEO, Australia to replace Mr Ian Day who is retiring after 23 years with the Company. Mr Reid is a highly experienced banking and finance executive having held senior roles at BankWest, including CEO Retail Banking, and recently as CEO of Greenstone Financial Services. His operational experience in retail banking and people leadership will greatly enhance our Australian business, in particular the financial services business and products. \n\nThe Board of Cash Converters welcomes Mr Reid to the Company and would like to thank Mr Day for his tremendous 23-year service to the Company and wishes him well in his retirement. \n\n3. Strategic Review \n\nIn light of the rapidly changing environment, the Company has appointed the experienced consulting group, CACE Partners, to conduct a full review of the business across geographies, distribution channels and product lines. As an outcome of this review, CACE Partners and the Company will formulate its three year strategic growth plan - the scope of this work is expected to take around 16 weeks to conclude. CACE Partners is experienced in assessing, delivering and implementing operational performance improvements to financial services and retail businesses. \n\nThe Company expects to be in a position to provide a market update on the outcomes of the review and the forward strategic plan around January 2016. \n\nRalph Groom \n\nCompany Secretary \n\nPerth, Western Australia \n\nDate: 10 September 2015 \n\nAbout Cash Converters International Ltd: \n\nCash Converters International (ASX:CCV) is a franchised retail network listed on the ASX. It specialises in the sale of second-hand goods. The Cash Converters group employs modern retailing practices, professional management techniques and high ethical standards to the management of its stores throughout the chain which appeal to a wide cross section of the community. As a result, Cash Converters has been able to position its outlets as credible retail merchandise stores, resulting in a profitable market for the group. \n\nContact: \n\nCash Converters International Ltd T: +61-8-9221-9111 F: +61-8-9221-9011 WWW: www.cashconverters.com \n\nSource: \n\nCash Converters International Ltd \n\nCopyright (C) 2015 ABN Newswire. All rights reserved. \n\n© 2015 Canjex Publishing Ltd. All rights reserved.", "source": "Stockwatch"}