{"published": "2015-09-15T10:28:19Z", "media-type": "News", "title": "FDA Starts Submission Tracker Program", "id": "f3effea3-941f-4fd2-b4e7-243e23a7a3b5", "content": "The U.S. Food and Drug Administration (FDA) has been developing a pilot program aimed at making it easier for medical device companies to see, at a glance, how their device is progressing through the agency’s regulatory processes. The initiative is an effort to add transparency and eliminate confusion surrounding the often misunderstood “FDA Review Clock.” \n\n“We are in the initial stages of designing a website-based portal that would allow sponsors to check on the status of their 510(k) submissions that are under review by the FDA,” said Nels Anderson, a biomedical engineer within the FDA’s Vascular Surgery Device branch. \n\nThe current mock-up—which in an interview with Regulatory Focus, Anderson emphasized was preliminary—includes an overview of the device, the FDA staff reviewing the device and their contact information, the status of the submission and the dates at which the device passed key review milestones, the current status of the FDA’s “review clock” under the Medical Device User Fee Act’s metrics, and the number of days an application has been with a sponsor (e.g., if FDA requests additional information). \n\nShelton, Conn.-based Orchid Design has been selected by the agency to be the sole regulatory consulting firm to participate in its submission tracking initiative. \n\n“The insights gained from working directly with the FDA on this project will allow us to efficiently and effectively navigate the regulatory submission process, as well as bring important issues to the FDA’s attention from a perspective they may otherwise not have considered in the development of the Submission Tracker program,” said Kellen Hills, senior quality and regulatory consultant for Orchid Design. \n\nOrchid Design will be working alongside two of the largest medical device manufacturers to collaborate with the FDA on this project. Orchid Design, a division of Holt, Mich.-based Orchid Orthopedic Solutions, provides design, development and regulatory submission services. The company has two design centers located in Shelton and Memphis, Tenn., focused on the orthopedic medical device market. \n\n“We’re looking for three small companies that are willing to work with us on [the] project,” Anderson said. “While we have a number of large corporations working on this with us, we know that smaller companies will have different needs and a different take on the information and we want to make sure they are included in this process.” \n\nThe input gained from this project will be used to create a larger pilot program. ", "source": "ODT Mag"}