{"published": "2015-09-14T17:40:43Z", "media-type": "Blog", "title": "Enter Feature Shoot’s 2nd Annual Emerging Photography Awards!", "id": "b48624aa-e3b0-40c6-be47-cfb6344f3cd7", "content": "After a truly incredible inaugural year, Feature Shoot is thrilled to announce our second annual Emerging Photography Awards , a competition devoted entirely to supporting and propelling the careers of promising up-and-comers. \n \nWe understand that this business can be tough, and the Feature Shoot 2015 Emerging Photography Awards is all about equipping photographers with the tools they need to succeed. We’re looking for photography from all genres with a powerful narrative element. \n \nThis year’s jury is composed of five esteemed names within the business, including Jessie Wender, Senior Photo Editor at National Geographic Magazine, Fiona Rogers, Magnum Photos’s Global Business Development Manager, photographer and Executive Director at Houston Center for Photography Sarah Sudhoff, Kevin Wy Lee, photographer and Founder of Invisible Photographer Asia (IPA), and Liz Lapp, curator and Content Manager at Yahoo. \n \nThe five winners of the Feature Shoot 2015 Emerging Photography Awards will be exhibited at a gallery show in New York City at United Photo Industries in Dumbo, Brooklyn with top-of-the-line printing by Ken Allen Studios and will be announced on Feature Shoot and throughout our social media channels, with an estimated reach of more than one million viewers. Additionally, selected photographers will be awarded with $500 dollars in cash, a Lomo’Instant Montenegro Camera , and a camera strap from Cecilia . \n \nTo apply , photographers may simply submit online with up to five images of any genre at 760 pixels on the shortest side, saved for wed at under 200KB, and titled with your first and last name and sequence number. Please also include a brief bio and Artist Statement to accompany your images. Each person is allowed only one entry, with a fee of $20 for each submission. \n \nPlease find the Terms and Conditions here . The deadline for submissions is February 15, 2016 , and the exhibition will open Spring 2016. \n \nWe’ll be featuring some of our favorite entries on our blog and through social media so apply today! \n \nThe Feature Shoot Emerging Photography Awards are generously sponsored by United Photo Industries , Ken Allen Studios , Lomography , and Cecilia . \n \nThe post Enter Feature Shoot’s 2nd Annual Emerging Photography Awards! appeared first on Feature Shoot .", "source": "Feature Shoot"}