{"published": "2015-09-18T00:00:00Z", "media-type": "News", "title": "St. Jude Medical Gains CE Mark for 27mm & 29mm Portico TAVR Valves to Complete a Full Portfolio of Portico Sizing Options for Physicians Treating Patients With Aortic Stenosis", "id": "4bd7473e-a822-4b8f-8180-3b7155921390", "content": "St. Jude Medical Gains CE Mark for 27mm & 29mm Portico TAVR Valves to Complete a Full Portfolio of Portico Sizing Options for Physicians Treating Patients with Aortic Stenosis \r \nThe latest approval increases patient access to the Portico system, a TAVR valve that provides excellent patient outcomes and the opportunity to optimize device placement\r \n\nST. PAUL, Minn.--(BUSINESS WIRE)--\r \n\nSt. Jude Medical, Inc. (STJ), a global medical device company, today announced the European CE Mark approval for the 27mm and 29mm Portico™ Transcatheter Aortic Valve Replacement System. The approval follows previous approvals of the 23mm and 25mm Portico valves, allowing St. Jude Medical to offer physicians an expanded range of fully repositionable, retrievable TAVR valve sizes. The Portico valve accommodates a patient’s native anatomy with diameters ranging from 19 to 27 mm.\r \n\nAortic stenosis is one of the most common forms of cardiovascular disease in the world, and develops as the aortic heart valve becomes calcified, narrowing the valve and preventing a complete opening. Over time, aortic stenosis disrupts the blood flow from the heart, which causes the heart to pump harder and results in weakening. TAVR procedures provide physicians an additional treatment option for patients with severe aortic stenosis who are considered high risk for open heart surgery.\r \n\n“Aortic stenosis is a serious, potentially life-threatening condition for patients who are unable to receive a traditional open-heart valve transplant,” said Dr. Helge Mollmann, the cardiology head of Transcatheter Valve Therapies at Kerckhoff Heart Center Bad Nauheim, Germany. “Transcatheter aortic valve replacement has revolutionized how we treat these patients, and by offering a complete portfolio of Portico valve sizing options, St. Jude Medical has further helped broaden the patient population that can be treated with this family of valves.”\r \n\nThe Portico system was developed to simplify TAVR procedures for physicians by improving control, ease of use and accuracy over other commercially-available TAVR valves. The system offers the ability for the Portico valve to be fully recaptured and repositioned prior to full deployment and release from the delivery system, providing physicians more options to place the valve in the targeted location. The Portico system has also demonstrated low rates of permanent pacemaker utilizations post valve implant as a result of heart block and was designed to minimize the risk of paravalvular leak (a leakage of blood caused by a space between the heart tissue and a replacement valve).\r \n\n“Transcatheter aortic valve replacement is a complex procedure, and feedback from physicians worldwide has continued to press upon us the fact that offering a system that provides physicians more control and a simplified procedure is important,” said Eric Fain, M.D., group president at St. Jude Medical. “In developing our Portico valve, we took such feedback into account, designing a full portfolio of sizing to ensure physicians could comfortably rely on one device family for a range of patients.”\r \n\nDuring a transfemoral implant procedure, the Portico valve is delivered by catheter through the femoral artery in the leg and is positioned while the patient’s heart continues to beat. Use of the Portico valve alleviates the use of cardiopulmonary bypass, which involves a machine taking over a patient’s heart and lung function during surgery and can cause added strain on an already frail heart.\r \n\nThe 23mm the 25mm Portico Transcatheter Aortic Heart Valve are both CE Mark approved and commercially available in Europe. In the United States, the Portico valve is currently being evaluated in a clinical trial through an investigational device exemption (IDE) by the U.S. Food and Drug Administration (FDA). The Portico IDE trial originally launched in May 2014, and is designed to support U.S. approval of the Portico system.\r \n\nAbout St. Jude Medical\r \n\nSt. Jude Medical is a global medical device manufacturer dedicated to transforming the treatment of some of the world’s most expensive epidemic diseases. The company does this by developing cost-effective medical technologies that save and improve lives of patients around the world. Headquartered in St. Paul, Minn., St. Jude Medical has four major clinical focus areas that include cardiac rhythm management, atrial fibrillation, cardiovascular and neuromodulation. For more information, please visit sjm.com or follow us on Twitter @SJM_Media.\r \n\nForward-Looking Statements\r \n\nThis news release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 that involve risks and uncertainties. Such forward-looking statements include the expectations, plans and prospects for the Company, including potential clinical successes, anticipated regulatory approvals and future product launches, and projected revenues, margins, earnings and market shares. The statements made by the Company are based upon management’s current expectations and are subject to certain risks and uncertainties that could cause actual results to differ materially from those described in the forward-looking statements. These risks and uncertainties include market conditions and other factors beyond the Company’s control and the risk factors and other cautionary statements described in the Company’s filings with the SEC, including those described in the Risk Factors and Cautionary Statements sections of the Company’s Annual Report on Form 10-K for the fiscal year ended January 3, 2015 and Quarterly Report on Form 10-Q for the fiscal quarter ended July 4, 2015. The Company does not intend to update these statements and undertakes no duty to any person to provide any such update under any circumstance.\r \n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150918005078/en/\r \n\nContact: \n\nSt. Jude Medical, Inc. \n\r\nJ.C. Weigelt, 651-756-4347 \n\r\nInvestor Relations \n\r\njweigelt@sjm.com \n\nor \n\nLaurel Hood, 651-756-2853 \n\r\nMedia Relations \n\r\nlhood02@sjm.com\r \n\nHelp employers find you! Check out all the jobs and post your resume .", "source": "BioSpace"}