{"published": "2015-09-14T10:14:11Z", "media-type": "News", "title": "Beaming Cat Deeley debuts tiny baby bump as she steps out with Patrick Kielty at Emmy awards", "id": "e03c1b45-1ebb-4b2d-ac0d-615d49975f3a", "content": "Cat Deeley may have lost out to Jane Lynch for an Emmy last night, but the pregnant star was winning in the style stakes. \n \nThe So You Think You Can Dance host was joined by her husband Patrick Kielty at the annual Creative Arts Emmy Awards in Los Angeles last night, and showed off her tiny bump in a stunning black gown. \n \nCat, 38, wore the high neck black number with a statement thigh-high split for the red carpet awards. \n \nShe teamed it with a pair of silver strappy sandals and scraped her hair back into a chic up-do to let the cut-out dress do the talking. \n \nWith a slick of nude lipstick, Cat went for a smoky eyes to add a bit of drama to the look and carried a small black clutch. \n \nCat’s husband Patrick, 44, proudly walked the red carpet with his wife and held her hand as the parents-to-be posed for the cameras. \n \nShe is gearing up for her next big role in life, becoming a mother to her first child . \n \nPatrick shared a photo of the couple, and gushed: “@catdeeley About to walk this amazing woman up the red carpet. #wife nominated #husband already a winner #emmys.” \n MORE: Paddy Kielty and Cat Deeley announce they are expecting their first child   \nWhile the pregnant star also shared a few photos, with one captioned: “Giggles for two.....plus one.... @patrickielty #emmy.” \n \nCat has been the host for the popular dance show since it kicked off in 2006, and has been nominate four times for the Primetime Emmy Award for Outstanding Host for a Reality or Realtiy-Competition program. \n \nShe faced stiff competition from the likes of Tom Bergeron, Anthony Bourdain and Heidi Klum and Tim Gunn. \n \n Cat Deeley and husband Patrick Kielty attend the 2015 Creative Arts Emmy Awards at Microsoft Theater in Los Angeles, California \n \nBut it was Hollywood Game Night star Jane Lynch who walked away with the gong. \n \nThe British TV presenter, who wed the comedian in a secret ceremony in Rome in 2012, announced the happy news on Twitter late on Thursday night. \n \n“Exciting news... Paddy and I are so happy to be expecting our first child in the spring... Lucky us,” the 38-year-old shared with her 354,000 Twitter followers. \n \nThe pair were soon flooded with messages of congratulations and well wishes. \n \nIt comes just a month after funnyman Patrick opened up about having kids, joking about how their accents might sound. \n \n“I hope any child we might have has Cat’s looks and my accent,” he told the Birmingham Mail. \n \n“With our two strong accents, we basically needed subtitles or a UN translator.” \n \nThe 44-year-old was also quizzed about when the loved-up pair might add to their family and he replied: “I don’t know. I generally find that when joy like that comes along, it’s a surprise.” \n \nThe pair tied the knot at the picturesque St Isidore’s College chapel in Rome in 2012. \n \nPatrick’s parish priest, Father Gary Donegan jetted from Belfast to officiate. \n \nAn insider said at the time: “It was a beautiful ceremony, just close friends and family. \n \n“We only found out at the last minute. It was a really perfect day. \n \n“They’ve been pals for ages and we all just wonder what took them so long.” \n MORE: Heroes of Youth Awards Northern Ireland 2015: Big day finally arrives", "source": "Belfast Live"}