{"published": "2015-09-02T21:55:11Z", "media-type": "News", "title": "Roy Hodgson urges England to step it up for Euro 2016 trophy bid", "id": "ed152924-3272-4373-9df4-8e26a01e5db6", "content": "Roy Hodgson has told his England squad they must step up their performances if they want to become serious contenders for Euro 2016. \n \nEngland will qualify for the European Championship on Saturday if they beat San Marino and Slovenia fail to defeat Switzerland. \n \nGroup E may contain some of the weaker sides in Europe, but Hodgson deserves praise for guiding England through a perfect qualifying campaign so far. \n \nThe England manager is not resting on his laurels, however, and he was keen to spread that message to all 22 squad members when they met for a team meeting at St George's Park on Tuesday. \n \n\"The manager said we can either go one way, keep winning and stay the way we are, or we can go up another level in our performances,\" England midfielder Jonjo Shelvey said. \n \n\"Because there's no reason why the England team with the players we've got in this country can't go to the European Championship and win it. That's what Roy Hodgson wants us to do and what we want to do. \n \n\"It was quite an upbeat meeting. He wants us to win and I'm sure we can.\" \n \nAfter three years without a cap, Shelvey has Hodgson to thank for giving him a second chance with England. \n \nShelvey said recently he regards Hodgson as a \"tremendous manager\" but the 68-year-old's words caused the tide of public opinion to turn against the Swansea player last year. \n   Promoted stories   \nHodgson claimed 10 months ago that Gareth Southgate had told him Shelvey was \"reticent\" to play for the England Under-21 team after being capped by the senior side. \n \nThe backlash was fierce.  Stuart Pearce was the most scathing. \n \n\"How the hell has he got an England senior call-up?\" the former England Under-21 coach asked, when Shelvey was brought into the senior squad last year. \n \nLast week Pearce criticised Shelvey's latest call-up, claiming the 23-year-old was \"fortunate\" Hodgson bore no \"malice\" towards the player after his apparent Under-21 snub. \n \nMidfielder Shelvey was quick to set the record straight at St George's Park on Wednesday, however. \n \n\"I can assure you on my daughter's life I have never refused to play for England. If I did my dad would kill me. If I had hair, he would rip it off,\" Shelvey said. \n \n\"I see Stuart Pearce said something about it the other day. I was in bed at time and I was a bit upset really because that ain't me.\" \n \nPerhaps in previous years, Shelvey would have taken to a social media platform and reeled off a furious tirade at Pearce, but the midfielder says he is a changed man. \n \nShelvey has previously verbally abused managers - including Sir Alex Ferguson - other players, and officials. \n \nAfter being branded \"lazy\" by Swansea manager Garry Monk last season, Shelvey recruited a personal trainer and a chef. The binges, curries and late nights were cut out of his life. He is a father and a husband now and he takes his responsibilities seriously. \n \nShelvey said: \"I can understand why people don't like me. I'm a bit like Marmite, you either love me or hate me. \n \n\"But if you get to know me you'll realise I just want to win. \n \n\"But I've changed my ways. I don't have as many rows on the pitch as I did. I was a bit immature before, but  I think I've controlled that red mist in the last six months.\" \n \nSwansea psychiatrist Ian Mitchell has helped. \n \n\"He's a top man. His phone is always on if you want something or want to meet up,\" Shelvey added. \n \nMonk, who is a future England manager according to Shelvey, also played a big part in the player's journey from erratic midfielder to one of the most impressive top-flight performers this year. \n \n\"Last year he said in the press that I was lazy,\" Shelvey said of the Swansea boss. \n   \n Share article  \n   \n\"It could have gone one way or the other. You either just sit around and sulk on the bench or you get the bit between your teeth and really kick on. \n \n\"I did that and that is paying off now.\"", "source": "Haringey Independent"}