{"published": "2015-09-22T12:54:57Z", "media-type": "News", "title": "Susanna Reid's top 6 most flirty moments on TV", "id": "1d23d5d6-740d-4510-8bd3-af384d0edb12", "content": "Susanna Reid’s sizzling interview with David Beckham on Good Morning Britain is the latest in a history of flirty moments with male guests (and butterscotch pudding) for the morning TV presenter. \n \nHere are the top six times she has raised the temperature in the studio. \n 1. David Cameron  [embedded content] \nSusanna got the giggles when she sat down with the Prime Minister for an interview at his home in March. While asking questions about parents’ evenings and family life in Number 10, she nibbled the end of her pen and laughed, while displaying her legs in a short blue dress. \n 2. Luke Evans  [embedded content] \nSusanna’s flirty encounter with Dracula Untold star Luke Evans in October last year ended with the actor nibbling her neck. \n \nShe asked the actor: “What is it like when you go in for the big bite?” and suggested: “Shall we do it?” \n \nLuckily Luke was game and flashed: “You’ve got to show me your neck first, though,” before jokingly nuzzling in. “That was quite nice, actually,” Susanna finished. \n 3. Jeremy Renner  [embedded content] \nSusanna left Avengers star Jeremy Renner looking embarrassed when she praised his physique on the GMB sofa. \n \nWhen asked about whether he’d be taking part in charity football match Soccer Aid earlier this year, Jeremy replied: “I’d always be honoured to go do that but I’d have to get in better shape.” \n   Promoted stories   \nSusanna quickly replied: “You look in pretty good shape by the way. You look in great shape.” \n \nThey were left in stitches as she quipped of her reputation: “Now you’ve landed me in it. I always get into trouble for these things.” \n 4. Alex Turner  [embedded content] \n“I bet you look good on the dance floor,” ended Susanna’s teasing interview with Arctic Monkeys frontman Alex Turner in 2013 while she was still working for BBC Breakfast. \n \nThe presenter, who is 15 years Alex’s senior, asked him if he’d ever take a twirl on Strictly Come Dancing as she flicked her hair and giggled. Alex replied back: “I should have been the one that said you look good on the dance floor.” \n 5. David Beckham (again)  [embedded content] \nSusanna struck again when she interviewed Becks for GMB in February this year. She hung onto the footballer’s every word as he discussed his new fund to mark 10 years as a Unicef ambassador and flapped her hands to her face as he spoke lovingly of being an embarrassing dad to his four children. \n 6. Angel Delight  [embedded content] \nTwitter went into meltdown in July when Susanna turned her attention to a bowl of Angel Delight dessert. Realising she had no spoon in a retro-food cooking segment, she suggestively licked the butterscotch-flavour pudding off her little finger. \n   \n Share article  \n   \n“You know what, I wasn’t given a spoon, but I find with Angel Delight you can just use your finger,” she said. “Mmmm that’s good. That’s sweet. That’s really sweet,” she added.", "source": "Yeovil Express"}