{"published": "2015-09-30T14:11:06Z", "media-type": "News", "title": "Rev. Dr. Otis Moss: Accept Your Desert Assignment", "id": "523968b8-7665-433a-9c2b-3befaf83d02f", "content": "Rev. Dr. Otis Moss, III, Senior Pastor of Trinity United Church of Christ in Chicago, spoke during this year’s Congressional Black Caucus Annual Legislative Conference prayer breakfast, and NewsOne Now was there to capture his inspirational message. \n \nMoss connected the plight of the Black Lives Matter movement with the mission of a monumental Biblical figure. Rev. Moss expounded upon his point, saying John the Baptist was put in place to “design and create a ministry that will help the next generation.” \n \n“John comes in a period of history when the synagogue had been captured by Roman rule. Because previous to the period there was something known as the Maccabean Revolt. The Maccabean Revolt was the revolt that pushed back those Persians that sought to destroy the Hebrew community,” said Moss. \n  \nLater during his remarks, Moss explained that High Priests at the time were in place to “preach about the personal, but not preach about the public,” which Rev. Moss considered to be “prophetic.” \n \n“As long as you are talking about how I’m doing personally, you can say whatever you want. But if you start talking about poverty, if you start talking about mass incarceration, if you start talking about food deserts, the powers that be will attempt to ‘take you out.’” \n  \nAccording to Moss, John the Baptist connected with “a decentralized movement” because he recognized that “Hebrew lives matter.” Moss continued to explain that John moved out into the desert to “understand and communicate to people of this decentralized movement” because it was about “the next generation.” \n \nMoss considered this to be John’s “desert assignment.” He continued, saying John’s assignment was in a “place of little resources, a place that will never grow and develop” and implored those in attendance to “accept” their own desert assignments. \n \nRev. Moss further explained his point: “Many of those who are collectively here (attending the Congressional Black Caucus Annual Legislative Conference), your constituency is not on the fruited plain, but in the desert. Your constituency is a constituency that has low resources, deals with mass incarceration, is dealing with a food desert, and if we are to be who God calls us to be, we must be willing to accept our desert assignment.” \n \n “There is a desert inside our communities from food, education to mass incarceration and miseducation, and let us be clear here – this is the new Jim Crow,” said Moss. \n  \nMoss then quoted Michelle Alexander, acclaimed civil rights lawyer and author of  The New Jim Crow,  saying, “It’s not because people have some type of cultural or moral or ethical deficit.” \n \n“We must understand that because of their proximity to poverty, there is limited access to and availability and because of their racial identity, they end up being incarcerated because of their proximity to opportunity and limited opportunity, and so we must accept our desert assignments,” said Moss. \n  \nRev. Moss added that things will not grow at the same rate they would if you were not in a desert, but ” you have to be comfortable where God calls you.” \n \nWatch excerpts of Rev. Otis Moss’ CBC prayer breakfast address and the NewsOne Now panel’s reaction in the video clip above. \n \nBe sure to watch Wednesday’s edition of NewsOne Now for part two of Rev. Moss’ address. \n \nTV One’s NewsOne Now has moved to 7 A.M. ET, be sure to  watch  “ NewsOne Now ” with  Roland Martin , in its new time slot on TV One . \n \nSubscribe to the “NewsOne Now” Audio Podcast on iTunes. \n \nSEE ALSO:  \n   \nJustice Or Else: Min. Farrakhan Talks #BlackLivesMatter & Young Activists \n    \nDon’t Miss Our Hottest Stories! Get The NewsOne Flip App for iPhone : Flip, Skip — Or Send Us a Tip!", "source": "Buzz 1230 AM"}