{"published": "2015-09-18T20:34:10Z", "media-type": "News", "title": "Get a taste of turning wool into yarn in Stony Plain", "id": "9c32df9c-c4d4-44c4-a45e-48e7a2a6467f", "content": "A rare find in today’s manufacturing world, Stony Plain’s Cathy Eisenmenger still spins wool into yarn like the pioneering women of old. \n \nEisenmenger, who spent 10 years in the army working in dentistry, will be giving a spinning demonstration with explanations on how to turn raw wool into yarn at the Multicultural Heritage Centre on Sept. 26 as part of Alberta Culture Days. \n \n“With handmade yarn, I love the process of taking it right from a raw state, right off the animal, and washing and processing it,” said Eisenmenger. \n \n“I am faithful to the old ways and old techniques, the way they used to do it for hundreds of years.” \n \nEisenmenger does have some background in fibre arts, in the form of knitting, which she has been doing for as long as she can remember. \n \nHer German grandmother first taught Eisenmenger the skills, and she has never looked back since. \n \n“My real love is knitting, and I have always admired my Oma’s ability to knit and crochet.” \n \nHowever, Eisenmenger became fascinated with spinning after taking a few classes in the art at the Edmonton Weaver’s Guild. \n \nThe Internet has also been instrumental in helping Eisenmenger develop her skills. \n \n“The expertise is online, which is wonderful,” she said. \n \n“We can record and experience these experts in spinning that we have, before those skills and memories are lost.” \n \nAccording to Eisenmenger, the Internet has created a resurgence in the art of spinning, which is particularly helpful because she purchases many of her spinning tools and wheels online. \n \nEisenmenger owns six wheels, including a handmade Hutterite wheel from 1932. \n \nFor her demonstration at 10 a.m. during Alberta Culture Days, Eisenmenger will be using a 100-year-old spinning wheel. \n \n“I have a soft spot for wheels that are faithful to the old designs, but there are other spinners out there who use wheels that can fold up into a backpack,” she said. \n \n“Wheels are all incredible engineering feats … there’s a lot the craftsmen have to go through and they have to be precise.” \n \nBut no matter type of wheel you have, learning how to spin takes time and dedicated practice. \n \n“It’s a lot like learning an instrument, and it’s not easy to pick up.” \n \nThat being said, Eisenmenger believes there is no such thing as perfect spinning and that every spinner does it a bit differently. \n \n“There are a dozen different ways to learn, so try them all out and see what makes you feel good.” \n \nEisenmenger hopes by the end of her demonstration people will have an appreciation for how clothing and material was made in the old days. \n \n“In those days, everything textile had to be made by hand,” she said. \n \n“It’s very nice to keep that tradition alive.” \n \nyasmin.mayne@sunmedia.ca \n \nTwitter: @YasminMayne", "source": "Stony Plain Reporter"}