{"published": "2015-09-13T13:17:12Z", "media-type": "News", "title": "Video Donald Trump Interviews Himself in 'Tonight Show' Mirror 22 hours ago", "id": "2389c639-92af-4c84-b46f-33b3c152541b", "content": "Despite being fired from The Apprentice in June, Donald Trump  found himself back on NBC Friday night as the Republican presidential frontrunner and current Rolling Stone cover star visited Tonight Show Starring Jimmy Fallon for a pair of interviews: A long chat on Fallon's couch as well as a sketch where Trump conducted a Q&A with his own reflection, played by Jimmy Fallon. \"The only one qualified to interview me is me,\" Fallon, as Trump, said. \n Sidebar    Trump Seriously: On the Trail With the GOP's Tough Guy »  \nMuch like when Mitt Romney mocked himself in a Tonight Show mirror conversation with \"Mitt Romney,\" Fallon uses the reflection gag to poke fun at the Donald. As \"Trump\" admires the real Trump, the host quips, \"I'm like a Greek god that just took a bath in a Pumpkin Spice Latte.\" Later, when the two discuss Trump's potential running mate, Trump jokes, \"[Gary Busey] is more of a Supreme Court Justice, in my opinion. Vice President is a very serious job so I'm probably going to go with somebody else. Maybe Kanye West.\" \n \nTrump managed to squeeze some actual policy talk into the sketch, commenting on how he'd invoke higher taxes on hedge funders and cut government spending. However, Fallon teased Trump about the vagueness of his campaign promises when he asked Trump how he's going to create jobs in this country. The mogul simply answers, \"I'm just gonna do it.\" \"But how,\" \"Trump\" asks. \"By doing it, it just happens,\" Trump says, to which \"Trump\" replies, \"Genius!\" \n \n[embedded content] \n \nIn addition to their mirror chat, Fallon had so many questions for Trump that the host unleashed them all in a speed interview, with Trump being asked to succinctly chime in on a variety of topics, from the Hillary Clinton email scandal and his Mexican border wall to Kanye West's 2020 presidential run . \"Kanye has been so nice to me. He always says great things about me so I love Kanye,\" Trump said. \"Kanye is actually a much better people than some people would think. Now if he runs for office, and I happen to be running against him, I'm going to take that back.\" \n \nTrump said similar things to say about the rapper when he spoke to Rolling Stone after West announced his 2020 bid at the MTV Video Music Awards. \"He's actually a different kind of person than people think. He's a nice guy,\" Trump said of West. \"I hope to run against him someday.\" \n \n[embedded content] \n \nDuring the interview, Trump discussed about becoming the unexpected frontrunner for the Republican presidential nomination. \"Once I announced I was doing it, no one believed I was doing it,\" Trump said, noting his lead is \"a lot.\" \"I think [the citizens] want our country to be respected again. I think they feel that if I'm President that I will do some great things for our country. We're going to be respected again. We're not going to be scoffed at, we're not going to be laughed at.\" \n \n[embedded content] \n \nThe mogul also talked about the first Republican debate's enormous ratings and how he prepares for debates even though he doesn't rely on notes. \"I'm blessed with a great memory,\" Trump said. \"If you're reading, if you have a teleprompter… you're not going to get the reaction of the crowd.\" As for which other GOP candidates he's targeting at the next debate, Trump shrugged and said, \"To me, they're all the same to me.\"", "source": "Rolling Stone"}