{"published": "2015-09-23T15:44:36Z", "media-type": "News", "title": "78 more executives on path to compliance certification", "id": "4d67b478-c957-427c-b07f-9501faa7919e", "content": "HANOVER, Md. -  \n\nThe National Automotive Finance Association enjoyed another great turnout for the opening module of its Consumer Credit Compliance Certification program. \n \nThe most recent session last week in Irvine, Calif., drew 78 participants from 55 different companies. Hudson Cook partner Patty Covington, one of the instructors for the opening module of the four-part training endeavor, told SubPrime Auto Finance News in an email message that the topics drawing the most questions from attendees included: \n \n— Adverse action notice requirements \n \n— Furnishing to the credit bureaus \n \n— Text messaging \n \n— Collections \n \n— Compliance management systems \n \nAfter two days of classroom style learning in Irvine to complete Module 1, participants will move onto the 29 self-paced, Web-based sessions covering federal and state laws and regulations that govern the auto financing business. \n \nSuccessful testing throughout the program is necessary before progressing in the program, which is available to the staff of NAF Association member companies at the price of $2,000 per person and non-member companies at $3,000 per person. \n \nThe certification of Compliance Professional is awarded upon completion of Module 4, a live classroom session covering the Consumer Financial Protection Bureau. The next time the NAF Association is offering Module 4 is ahead of the SubPrime Forum at Used Car Week , which begins on Nov. 16 in Scottsdale, Ariz. \n \nWhether or not they’re participating in Module 4, NAF Association members can take advantage of $100 discount off of the registration fee for the SubPrime Forum, which includes a wide array of presentations as well as networking opportunities at the Phoenician, the site of Used Car Week. \n \nWhen completing registration, NAF Association members can use the code NAF2015 when prompted. \n \nAgenda and registration details all can be found at www.usedcarweek.biz . \n \nFor more information about the Consumer Credit Compliance Certification program, visit nafassociation.com or contact executive director Jack Tracey at (410) 865-5431 or jtracey@nafassociation.com .", "source": "Auto Remarketing"}