{"published": "2015-09-01T23:58:31Z", "media-type": "News", "title": "Napa City-County Library (CA) selects the Polaris ILS and Polaris Leap, will hoin LINK+", "id": "2371a731-4120-4377-82d6-b77b2b20cd7f", "content": "-- Emeryville, CA. Innovative announced today that Napa City-County Library (NCCL) in northern California has selected the Polaris ILS and Polaris Leap--the responsive-design Web client that performs key library workflows on tablets and laptops. NCCL has a collection size of 150,000 and an annual circulation of over 1 million items. NCCL is also joining the ranks of the LINK+ resource-sharing consortium, which is powered by Innovative's INN-Reach consortial borrowing system. As a member, NCCL will have access to materials from over 60 academic and public libraries that hold over 11 million items. NCCL is replacing a Carl.X system by TLC. \n\n\"The Polaris ILS and Polaris Leap will allow NCCL to connect more effectively with patrons through the Web and mobile devices,\" says Innovative's SVP of Global Sales Bill Schickling. \"In addition, its new participation in LINK+ gives its community access to millions more books and direct requesting of these items through the PAC. We believe that Innovative's solution will significantly improve the patron experience and help NCCL sustain excellent services into the future.\" \n\nAbout Napa City-County Library \n\nNapa City-County Library's mission is to enrich people's lives with books and information. NCCL values: free and equal access to information and materials; convenient hours of service; service that is thorough, impartial, and confidential; educational and recreational programs that inspire thought, ideas and a love of reading; technology and linkages to many resources that enable wide access to information; and the American Library Association Library \"Bill of Rights\". On the Web: www.countyofnapa.org/library. \n\nAbout Innovative \n\nInnovative (www.iii.com) is dedicated to providing leading technology solutions and services that empower libraries and enrich their users worldwide. Innovative offers one of the broadest and most complete portfolios of library automation products on the market today. Headquartered in Emeryville, California, Innovative serves thousands of libraries in 66 countries and has offices around the world.", "source": "Library Technology Guides"}