{"published": "2015-09-30T20:30:00Z", "media-type": "Blog", "title": "Monkeys See Optical Illusions Too", "id": "f92eb2ef-52dc-4e50-9e3f-539e6971cbac", "content": "Monkeys See Optical Illusions Too Shaunacy Ferro Image credit: \niStock\nLike us on Facebook Scientists have discovered yet another quality humans share with our primate cousins, monkeys. We’re both susceptible to optical illusions.  Visual illusions are an important technique for studying how species perceive and interpret the world. In the Journal of Experimental Psychology: Animal Learning and Cognition, scientists from Georgia State University find that monkeys seem to misperceive the world in similar ways to people.  To test this, capuchin and rhesus monkeys looked at the Delboeuf illusion, a visual illusion where two dots are surrounded by rings. Though the dots are the same size, one looks bigger because it’s surrounded by a smaller ring. The same scientists had previously shown that chimpanzees fall prey to this illusion when it’s represented by circular food on large and small plates.  The Delboeuf illusion. Image Credit: Georgia State University First, the monkeys were trained to choose the larger of two central dots surrounded by rings. If they chose larger dots, they got a banana-flavored food pellet. Then they were shown different dots surrounded by rings—a small dot surrounded by a small ring and the larger dot surrounded by a large ring. Per the illusion, the small dot appears larger than it is. In a different choice, the dots were the same size but appeared different. In this first experiment, most of the monkeys didn’t show a bias toward the small dot surrounded by the small ring. However, the researchers worried that they had developed a bias toward selecting the dot surrounded by a large ring, so they designed a new experiment.  In the second test, the monkeys decided whether the dot on the computer screen was small or large in relation to a central target size that didn’t appear onscreen. The dots were surrounded by a variety of different ring sizes, and the monkeys would move the cursor to say whether the dot onscreen seemed large or small. In this test, the illusion seemed to hold up. Just like the human participants tested, the monkeys overestimated the size of dots surrounded by small rings and underestimated the size of the dots surrounded by large rings.  While this study wasn’t perfect, it hints that humans and monkeys might perceive the world in similar ways, and provides an opportunity for further study into where optical illusions come from and why we experience them.  More from mental_floss...  Meet the Beer Fridge That Opens Only for Canadians  7 Book Dedications that Basically Say \"Screw You\"  The Origins of 10 Great Insults  How Marty McFly and Doc Brown Became Friends September 30, 2015 - 4:30pm Shaunacy Ferro shaunacysays Shaunacy Ferro is a staff writer for MentalFloss.com. She has previously covered architecture and design for FastCoDesign.com, and psychology and neuroscience for Popular Science. She lives in Brooklyn and spends most of her free time taking photos of her cat.", "source": "Mental Floss"}