{"published": "2015-09-24T01:48:00Z", "media-type": "News", "title": "FHS girls invited back to Nike Tournament", "id": "06032db4-6d02-48a1-9b11-dd149de0aacf", "content": "The Nike Tournament of Champions thought enough of Fremont High School's first appearance in the event last winter that organizers have invited the Tigers back in 2015. \n\nThe FHS girls will be competing in the event, that showcases some of the top prep talent in the nation, Dec. 17-22 in Phoenix. The 96-team tournament is divided into six brackets, but only 32 teams are invited to participate in the top two divisions, including the Tigers. \n\n\"We received a letter from Nike back in April inviting us to come back,\" Fremont coach Tony Weinandt said. \"When we were there last year, we had a really great following. We also heard a lot of positive comments from the people from Nike about the way our kids behaved and the way we competed against some really good teams. We're excited to be going back.\" \n\nThe Tigers, led by current University of Nebraska freshman Jessica Shepard, competed in the top bracket of the tournament last December. Fremont finished with a 2-2 record, including wins over Bishop O'Dowd of Oakland, Calif., and Millennium of Goodyear, Ariz. FHS will play in the second bracket this year. \n\nWeinandt credited FHS Activities Director Bill Fitzgerald and assistant AD Heidi Moran with helping with the administrative details to make the trip happen. \n\n\"A lot of work goes into this, including some fundraising,\" Weinandt said. \"There are also some logistics in school that Bill and Heidi have done a good job with for us.\" \n\nThe Tigers are having a silent auction to help with the costs of the trip. Several items have been donated including: \n\n* Four Skybox tickets and a parking pass to the Nebraska vs. Michigan State football game on Nov. 7. \n\n* Four Skybox tickets and a parking pass to the Iowa vs. NU game on Nov. 27. \n\n* Four NU vs. Samford men's basketball tickets and parking pass on Dec. 20. \n\n* Four Creighton vs. DePaul men's basketball tickets and parking pass for Feb. 6. \n\n* Four UNO vs. Air Force hockey tickets on Oct. 23. \n \n* Four tickets for the NU vs. Southeastern Louisiana men's basketball game and parking pass on Nov. 22. \n\n* Four tickets for the Creighton vs. IUPUI basketball game and parking pass on Dec. 12. \n\n* Four UNO vs. University of Minnesota-Duluth hockey tickets on Nov. 6. \n\nTo bid on an item, go to: www.fpsweb.org and click on the FHS girls basketball silent auction banner. Once there, items will be displayed with instructions. The auction ends at 4 p.m. Friday. \n\nThe Tigers return University of South Dakota commitment Rylie Cascio Jensen, senior guard Meghan Luper and sophomore Sam Shepard from last year's 16-7 squad. \n\n\"We've got a good group of girls,\" Weinandt said. \"We're going to miss our senior class of last year, but we have some girls that played a lot of minutes for us. We might have to change our style a bit, but we have a good nucleus back and we have a lot of kids eager to fill the other open spots.\"", "source": "Fremont Tribune"}