{"published": "2015-09-21T18:36:00Z", "media-type": "News", "title": "Donald Trump thinks Joe Flacco is an elite quarterback", "id": "b6bf619b-bd17-4d50-bfe8-409205ca6966", "content": "Whenever a presidential candidate (or anyone, really) decides to host a Q&A on Twitter, it's always going to be full of smart alecks thinking of a funny tweet instead of wanting earnest answers. Case in point: during Donald Trump's #AskTrump hashtag today, I asked the GOP frontrunner candidate and real life Scrooge McDuck what he thought of Lana Del Rey's highly-curated persona and how it relates to pop music's fascination with artificiality. As of press time, Trump has not answered the question but he did respond to another jokester with total sincerity. \n\nWhen the dude asked, \"Is Joe Flacco an elite quarterback?\" the Trump-meister said, yes, of course he is! While that seems like a surface-level innocuous question, over the years the topic has become a meme, a way to make fun of sports news outlets like ESPN for their redundant coverage of Baltimore Ravens football and its middle-of-the-road quarterback. \n\nWatch his answer below and consider the matter settled. \n\n. @HighSock_Sunday  #asktrump  pic.twitter.com/qVakUzXZAb \n— Donald J. Trump (@realDonaldTrump) September 21, 2015 \nHis GOP opponent Mike Huckabee on the other hand, could not answer the question. Quit being so wishy-washy, pastor. Is Flacco elite or not? \n \nBelow, check out some of the other highlights from the predictably disastrous Q&A. \n\n#AskTrump I got on this organic bulk gainer my lifting buddies recommended and now I can't stop gulping. Can I sue? pic.twitter.com/RhQo7FDkl4 \n— Big Sexy Jeb! Lund (@Mobute) September 21, 2015 \n#AskTrump Can you promise us hovercars I don't even care if you're lying just promise us hovercars \n— Drew Magary (@drewmagary) September 21, 2015 \n#AskTrump Do you think this potato looks like you? pic.twitter.com/E6RUFPcwth \n— joe heenan (@joeheenan) September 21, 2015 \n. @realDonaldTrump is there anything Meek Mill could do to come back & what advice do you have for him? #AskTrump \n— Desus Nice (@desusnice) September 21, 2015 \njterry@redeyechicago.com ,  @joshhterry \n\nFor more music, click here . \n\nWant to learn how to brew beer or make an awesome cocktail? Click here  to teach yourself through the RedEye Skillz page.  \n Copyright                      © 2015, RedEye", "source": "Red Eye Chicago"}