{"published": "2015-09-03T05:15:00Z", "media-type": "News", "title": "Cambridge's 'travel to work' area now reaches Bishop's Stortford...", "id": "841f2beb-e081-4319-b418-0023982378fe", "content": "Cambridge's commuting belt is now one of the biggest in the country – prompting fresh questions about the value of its green belt. \n\nThe city's reach for drawing in workers now stretches as far down as the M25 to places like Bishop's Stortford, Harlow and Ware, according to new Government analysis. \n\nThe Office of National Statistics has updated its so-called travel to work areas. \n\nIt does this by using an algorithm that maps the country out by areas where 75 per cent of residents live in the area and work in the area, and likewise where 75 per cent of workers work in the area and also live in the area. \n  \nThis means these areas ignore the usual administrative boundary. \n\nAnd Cambridge has seen an explosion in this area over the past 10 years, absorbing the areas that were once centred around Harlow and Bishop's Stortford. \n\nThis means Cambridge is now the regional capital for more than 1,000 square miles. \n\n\"This is a reminder that neighbouring places are more inter-dependent, economically, than many political leaders would care to admit,\" said Jonathan Schifferes in a blogpost for the specialist urban publication City Metric. \n\n\n\nTravel to work areas for 2011 (above) and 2001 (below) \n\n\n\n\"In part, the shape of the map also shows us some of the failures of policies of the past. \n\n\"When green belts were introduced, just one in seven households had access to a car: today it's 80 per cent. \n\n\"By constraining housing growth immediately around Oxford and Cambridge, in particular, green belts explain the large travel-to-work areas for these cities, as thousands of commuters drive across each city's green belt to get to work each day. \n\n\"This somewhat defeats the original rationale: green belts simply displace, rather than prevent sprawl.\" \n\n2011 travel to work area map \n\n\nOpen PDF \n\n\n2001 travel to work area map \n\n\nOpen PDF", "source": "Cambridge News"}