{"published": "2015-09-01T06:30:37Z", "media-type": "News", "title": "Quantum Crush Releases Two Brand New Herb Grinders", "id": "0e285360-bbd8-4377-a3c2-3a424d8d9fcf", "content": "SAN FRANCISCO - Sept. 1, 2015 - -- SAN FRANCISCO, CALIFORNIA, AUGUST 31, 2015 – Quantum Crush is excited to announce the release of two new products and the best herb grinders on the market in 2015 – the black crush and silver crush herb grinders. These 4 piece herb grinders offer premium results and ease of use.\n\nThe designers at Quantum Crush created these herb and spice grinders with meticulousness in order to help others crush and shred herbs, teas, and spices to the exact fineness a user may need. Those looking for a weed grinder or weed accessories can also find use for the brand new herb grinders. Each grinder comes as part of a 4 piece herb grinder set in which each of these pieces work in harmony to flawlessly filter and hold more ground herbs.\n\nUsers of the Quantum Crush Herb Grinders will find that there are less spills and odors due to the potent neodymium magnets which also allow the grinder to seal completely to keep herbs fresh. These herb grinders are made with high grade O-rings and 45 diamond cutting teeth, a combination that yields a smooth grinding motion and cleaner cuts. The Quantum Crush Herb Grinders are designed to work flawlessly, but they also to offer storage for the fresh herbs, tobacco, teas and spices. The storage compartment holds up to five tablespoons of herbs.\n\nOne of Quantum Crush’s most recent herb grinder reviews from Alistair DuPont states, “The kitchen grinder is an awesome tool and comes in pretty packaging - a black pouch with a scraper inside the last grinder piece. I use it to grind garlic into tiny pieces instead of the messy 'squeezy' thing. It works wonders! First you peel off the garlic skin and break it into its cloves. Then you stick the cloves into the grinder and give it a few spins. Out come perfectly minced pieces. One morning I didn't have time to cook my steal-cut oatmeal, so I tried sicking it in this grinder and then stuck the contents into the microwave like quick oats for two minutes. This thing works wonders. Do check it out!\n\nThe team at Quantum Crush is pleased to offer a herb grinder for enthusiasts who have long awaited a premium quality, affordable way to crush and cut their favorite herbs.\n\nAbout Quantum Crush\n\nQuantum Crush was founded in San Francisco by a group of amazing people who shared a passion and quest for excellent herb grinding in order to create affordable, top-notch products for other herb grinding enthusiasts.\n\nWebsite:\n\nwww.quantumcrush.com\n\nContact\n\nQuantum Crush\n\n***@quantumcrush.com", "source": "PRLog"}