{"published": "2015-09-23T16:40:06Z", "media-type": "News", "title": "Sick and Single, Who Will Care for Me?", "id": "eb0a5c78-e1e3-4b7e-9bf1-86cf44ebb940", "content": "A wave of relief swept over me when, at my first appointment to a new rheumatologist, she said she had a name for the elusive condition that threatened my life and sickened me for more than a decade and a half. I now knew, for certain, that I was right; all of my symptoms were tied to just one disease. However, my joy was short-lived. Seconds later, I was told that the autoimmune disease battering my body, igG4 related systemic disease, had no cure.  As a single woman, I wondered, who would care for me if I could not. \n \nAt that time, I lived alone in a townhouse, in a city where I knew no one other than my next door neighbor.  My home had stairs, slot of them, which often, pain would not allow me to climb. I worked full-time to maintain health insurance and prescription coverage. My job also allowed me to try meeting the debilitating obligations of my never-ending medical bills because there was no one else providing me with financial support. \n \nMy rheumatologist ordered blood tests, CT scans, x-rays and MRI’s to confirm her diagnosis and then came a new round of drugs, aimed at controlling the inflammation that damaged organs in my body.  The “what ifs” flooded in and gave me a headache over the next few months as.  What if I can’t work anymore? How will I survive? Will I have to sell my home?  How will I pay for in house care or a nursing home?  If I can stay in my townhome, is it safe? What if I fall ill in the house alone? Who will be able to get in to get me help? \n \nI thought I was prepared for anything when I bought more life insurance and had my will, healthy proxy, living will and power of attorney updated.  But, that only took care of my financial matters, my funeral and medical wishes but not my everyday needs. I’d neglected to buy long term disability insurance when I was well. By the time I finally applied my pre-existing condition prevented from getting it. \n \nI thought about rebuilding my savings so I could pay for private care on my own if I couldn’t work. However, trying to avoid being sued over doctor’s bills or being forced to file for bankruptcy made it impossible for me to accumulate any real wealth. \n \nI knew I didn’t want my parents to shoulder all the burden of caring for me nor did I want to move into their house.  So, I was motivated to get creative to solve the question: Who will care for me? I jotted down a list of relatives and close friends who I could call upon, in a rotation, to avoid stressing any one person out or abusing their generosity.  I looked for services that I could afford that could help me maintain my independence: carpet cleaners, maid services, grocery stores that let you shop from home and have your groceries delivered, and handyman services. I put handheld shower heads in all the bathrooms so I could sit down and wash myself. I also got a car that had seats that folded down for the times I could walk on my own and required a walker or wheelchair. I switched most of my bills from paper to electronic so they could be paid online. \n \nBy far, the hardest thing I had to learn to do was ask for help and learn to take it when it’s offered. I had to change my attitude by not seeing myself as helpless just because I need some help; that made a world of difference. I began letting other people know when my doctor’s appointments and procedures were scheduled so they knew when I might need to be picked up or require assistance. Before I knew it is assemble an army, that’s ready, willing and able to care for me at those times I can’t care for myself. \n \nnikabeamon.com", "source": "HealthMediciNet.com"}