{"published": "2015-09-15T23:51:22Z", "media-type": "Blog", "title": "Elle Fanning-Nicole Kidman Drama ‘How to Talk to Girls at Parties’ Bought by A24", "id": "68d2a52f-6ddc-491f-a1de-d2201702952b", "content": "variety-yahoopartner:\n\n\nA24 has acquired U.S. rights to John Cameron Mitchell’s drama “How To Talk To Girls At Parties,” starring Elle Fanning, Nicole Kidman and Alex Sharp.\n\nThe film, set to start production in November, is based on a short story by Neil Gaiman. Producers are Howard Gertler (Mitchell’s “Shortbus”), Iain Canning and Emile Sherman. Mitchell is exec producing.\n\n“How to Talk to Girls at Parties” focuses on a shy teenage punk rocker in 1970s suburban London and his two closest friends who sneak into a party where they meet a group of otherworldly girls — and realize the girls are literally from outer space. The lead character falls in love with one of the girls, despite the nefarious plans of the aliens.\n\nThe project reteams Mitchell with Kidman, who collaborated on the 2010 drama “Rabbit Hole.” Kidman received an Oscar nomination for Best Actress.\n\n“A24 is the best U.S. indie film distributor for a film like ours,” said Mitchell. “They combine today’s market strategies with the daring taste that flourished in the 90’s and 00’s.”\n\nMitchell co-wrote the screenplay with Philippa Goslett. Nico Muhly, Jamie Stewart of Xiu Xiu and Matmos are on board to compose original music and songs for the project.\n\nSharp won a Tony for “The Curious Incident of the Dog in the Night-Time.” Fanning was most recently seen in “Maleficent” and stars opposite Bryan Cranston in “Trumbo.”\n\nMitchell’s credits include “Hedwig and the Angry Inch” and “Shortbus.”\n\nCAA negotiated the deal on behalf of the filmmakers.\n\nRelated stories\nBrian De Palma Documentary Acquired by A24\nA24 Teams With Brad Pitt’s Plan B for ‘Moonlight’\nPatrick Stewart’s ‘Green Room’ Bought by A24\nGet more from Variety and Variety411: Follow us on Twitter, Facebook, Newsletter", "source": "Neil Gaiman"}