{"published": "2015-09-04T07:34:00Z", "media-type": "News", "title": "Health Food Emporium Announces Back to School Sale on Multivitamins for Moms and Kids", "id": "8fb825f5-467d-4010-9b29-cac958f7da20", "content": "Health Food Emporium is having a sale on multivitamins, probiotics and Omega 3s for Moms and Kids to support healthy immune systems as children head back to school this month.\n\n(PRWEB) September 04, 2015 \n\nA recent article by CNN stated, \"On average, elementary school children get eight to 12 colds or cases of the flu each school year, according to the CDC. For the older kids, it is about half that. Teachers and parents commonly refer to it as the Back-to-School Plague.\"\n\nKeeping the family heathy this back to school season can be challenging. Gail Bowman, owner of Health Food Emporium said, \"The key to keeping your kids healthy, and to keeping them from bringing sickness back home to the rest of the family this back to school season is a good diet with plenty of fresh greens and fruits (including berries), plenty of sleep, teaching them to wash their hands as often as possible, and good multivitamins, probiotics and Omega 3s to give their growing bodies the base nutrition they need to fight off the bugs. Here at Health Food Emporium, we are offering Kid's and Women's multis, probiotics and Omega 3s for an extra 10% off this month.\"\n\nChildren's bodies are designed to recognize and utilize nutrients best when they come from food. When vitamins or minerals are isolated from food or synthesized in a lab, their cofactors can be removed, inhibiting their ability to effectively nourish the body. While a diet rich in whole foods is the best way to give children the nutrients they need, if supplements are a consideration, seeking out a whole food multivitamin may be the best way to go. Vitamin Code Kids chewable are for children ages four and up and are vegetarian, gluten-free, dairy-free, Non GMO and contain no soy allergens.\n\nAnother big key to a healthy immune system is probiotics. Probiotics are living microflora that play a critical role in maintaining good health by supporting normal bowel function and a healthy immune system. They can maximize the benefits of a healthy diet by supporting normal absorption and assimilation of nutrients in the gut. Primal Defense for Kids is a powder mixed with dried bananas that kids don't mind taking. Primal Defense for Kids can be mixed with milk or juice, or placed right on the tongue. \n\nOmega 3 fish oils have been shown to support brain health, immune system strength and a positive mood. Oceans 3 for Kids is a complete Omega 3 for children that is chewable and has a pleasant berry flavor.\n\nThe American Red Cross has published this reminder: \"Proper and consistent hand washing is one of the easiest ways to prevent the spread of flu. Teach kids by example by showing them proper hand washing technique:\n\n\"*Wet hands with water and apply an amount of soap recommended by the manufacturer to hands. \n\n*Rub hands together vigorously for at least 20 seconds, covering all surfaces of the hands and giving added attention to fingernails. \n\n*Rinse hands with water. \n\n*Dry thoroughly with a disposable towel. \n\n*Use towel to turn off faucet.\n\n\"For younger children who tend to rush their hand washing, have them sing a short song such as 'Row Row Row Your Boat,' or the 'Happy Birthday' song – this will ensure they wash for at least 20 seconds. Placing hand-washing reminders at children's eye level will also help them become consistent hand washers.\"\n\nHealth Food Emporium has been an internet health food store for 12 years with an emphasis on helping families find quality whole food multivitamins and probiotics. Gail Bowman is the owner of Health Food Emporium and can be reached at 888-244-8948.\n\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb129398", "source": "WDAM-TV"}