{"published": "2015-09-16T08:23:09Z", "media-type": "News", "title": "ContiTech: a double rail ride on auto and industrial businesses in China", "id": "31836cb5-13bd-4bdc-a341-98a1659b1d1b", "content": "Officially opened in July, the €10 million compounding facility in Changshu, China, is the largest investment in the history of ContiTech's Compounding Technology business unit. Hans-Jürgen Duensing, CEO of ContiTech and Member of the Executive Board of Continental AG, discussed the company's plan in China. \n \nQuestion: How was ContiTech's business in 2014? \n\n\r\nMr Duensing: Excluding Veyance Technologies, sales of ContiTech in 2014 grew €50 million to €3.9 billion. Earnings Before Interest and Tax (EBIT) amounted to €432 million. \n \nVeyance was officially acquired by us on January 30, expanding our global position in rubber and plastics technologies. \n \nQuestion: How Will the acquisition benefits your company? \n\n\r\nMr Duensing: Merging Veyance into ContiTech is important to our global business, particularly in China. Boosted by the acquisition, our sales outside the automotive original equipment sector is up from 42% to 54%. \n \nAt the same time, the strengths in rubber and plastics solutions from both companies will serve the automotive industry well. Our presence is strengthened especially in North America. \n \nThe pipes and tubes business in China has also been vastly improved. I would say acquiring Veyance is the correct decision. \n \nQuestion: Is there any differentiation between Veyance's products and ContiTech's new compounding site? \n\n\r\nMr Duensing: In the meantime we do not offer a comparison yet, but the management will decide soon on how to provide an optimized product portfolio and to better serve our Chinese customers. \n \nFrom our perspective, Veyance has more experience in production and operation in China, so it is better equipped at the moment to serve the domestic market. \n \nQuestion: What is your opinion on the Chinese market? \n\n\r\nMr Duensing: China is very important for us if we are to do well globally. In fact, over 60% of ContiTech's sales here come from the auto industry. But we are not resting on it and are also constantly expanding into other industries as well. For example, a rubber coatings plant will be built in China next year. \n \nMoreover, we do not see China as simply as a market or a production base. It will also become our major Research & Development (R&D) center, pushing the boundaries for global innovations. That's why we are also building up research and development capacity here. \n \nQuestion: Can the new rubber compounding site satisfy the growing demand in China? \n\n\r\nMr Duensing: The answer is absolutely yes. ContiTech's rubber compounds serve mainly segment markets like air spring, vibration control, damping system, among others. We have enough capacity to serve these high-end applications. \n \nIn fact, the company has outlined a five year strategy, with plans to build another factory that would double our current capacity to meet the growing demand in the future. \n \nQuestion: Will you elaborate further on ContiTech's five year plan? \n\n\r\nMr Duensing: The five year strategic planning is closely related to ContiTech's investments. At present, there is one compounding line in Changshu, offering an annual capacity of 10,000 tons. Our plan is to bring in new investment every other year, boosting the capacity by 50-70% in the next few years. After that we will decide on building a second compounding line. \n \nCPRJ: Is the new factory running in full operation now? \n\n\r\nMr Duensing: We are just at the beginning. In the next few months, we hope to get it going with a 25% usage rate, then 60-70% next year and hopefully 100% after two years.", "source": "China Plastic and Rubber Journal"}