{"published": "2015-09-09T03:25:00Z", "media-type": "News", "title": "Sycamore approves pair of facade grant requests", "id": "8154b207-5d9c-4f0c-becd-dbdf79291ddb", "content": "SYCAMORE – Renovations at a few downtown businesses have been awarded facade grants. \n   \nThe Sycamore City Council on Monday approved the funds for the former DiMarzio building, on the corner of State and California streets, Shawn’s, 204 Somonauk St., and Princess Alex Ice Cream, 210 W. Elm St. Both requests were previously supported by the Architectural Review Committee. \n\nFirst Ward Alderman Alan Bauer sat in for Mayor Ken Mundy, who was out of town Monday. \n\nCurt Lang, 1st Ward Alderman, and his wife Karen requested facade grants after recently purchasing the former DiMarzio building, with plans to renovate the property with new windows, cleaned side brick, new roofing materials, gutters and downspouts. \n\nThe estimated cost of the renovations is $40,000. \n\nThe measure was approved 7-0, with Lang abstaining. Karen Lang spoke their behalf. \n\n“It’s been a big undertaking for us and so we’re excited about it,” she told the council. \n\nThird Ward Alderman Steve Braser commended the Langs for renovating the building, which the last time he knew of that happening was 60 years ago. \n\nShawn Thrower, owner of Shawn’s and Princess Alex Ice Cream has requested facade grants for both his businesses. The repairs include replacing the shingled awning, installing roofing materials, adding lights under the awning to brighten the corner, repair and replace front panels, removing signs and painting the wood siding. \n\nThe estimated cost of the exterior renovations are between $10,000 and $12,000. \n\nFunding for the Downtown Facade Grant Fund comes from a $25,000 transfer made from the Hotel/Motel Tax Fund, City Manager Brian Gregory said. \n\n“Currently, there’s several buildings within the past year that have undergone or are undergoing significant renovation, and the city has assisted with those renovations through the program,” Gregory said. “The sole source of revenue for the downtown development fund is the $25,000 transfer, and the fund is dedicated toward downtown improvement.” \n\nOnce receipts for the renovations are received by the city, an applicant is eligible for a 50 percent match-up to $5,000 – in Thrower’s case, for each property. Since the Langs’ new property has four different addresses attached to the building the grant could total $20,000. \n\n“(Both grants) will take us over our annual allocation,” Gregory said. “However, we could amend the budget given there is a fund that is specifically set aside for these types of agreements, but haven’t been utilized in the past.” \nComments", "source": "Daily Chronicle"}