{"published": "2015-09-25T06:09:59Z", "media-type": "News", "title": "Baptist church members vote to FIRE pastor who kicked out a 103-year-old member after she disagreed with his services", "id": "2e74cca6-409c-415b-9001-df66558318dd", "content": "Members at Grove Baptist Church voted to oust Rev. Tim Mattox Sunday Last Friday Rev. Mattox bannished Genora Hamm Biggs, a member of 92 years, for saying she wasn't happy with his services  Rev. Mattox was sent a letter asking him to collect his things He then took out a restraining againt Biggs' grandson and another member   Hamm Biggs used to be a church officer, and her father was a founder  \nMembers of a northeast Georgia church have voted to fire a pastor who controversially banned a 103-year-old from the congregation after she disagreed with his services. \n\nThe votes were cast Sunday against Reverend Tim Mattox, who have since issues him a 'Letter of Termination' asking him to remove his belongings from the Union Grove Baptist Church of Elberton. \n\nRev. Mattox hit headlines last Friday after it was revealed he had banished Genora Hamm Biggs - a church member of 92 years - for displaying conduct that was 'detrimental' to others after she spoke out about his practices, including laying hands on members. \n\nAccording to The Atlanta Journal‑Constitution , Rev. Mattox has now taken a restraining order out against the grandson of Hamm Biggs, as well as a former church secretary.  \n\n    \n   \nGenora Hamm Biggs, known as the 'mother of the church', has been going to Union Grove Baptist Church in Elberton since she joined it 92 years ago, but was banished last week for disagreeing with the pastor \n\nThe outspoken Hamm Biggs, a retired teacher, said at the weekend that the practices used by Rev. Mattox were not Baptist. \n\n'He is a holy sanctified minister or so he says. We voted him in and we didn't know it until he was there. We are Baptists and that's what we want to stay,' Biggs said. \n\nA statement from the Union Grove church to the Athens Banner-Herald said fellow members decided to expel Hamm Biggs. \n\n'It was determined by the congregation during a church conference meeting, which Mrs. Biggs was present at the time of the meeting, that the behavior of Mrs. Biggs and others was detrimental to the church at large and could no longer be allowed,' according to the statement. \n\nChurch members voted in August to revoke Hamm Biggs' membership, although she has continued attending services. \n \nHamm Biggs was previously a church officer, and her father was one of its founders. She received a letter about her expulsion. \n\n'I was unhappy and shocked,' said Biggs. 'I joined the church when I was 11 years old.' \n\nAlso banned from the church was Hamm Biggs' grandson, Eliott Dye, a member for 30 years, and Kevin Hamm, an ordained minister who was also a member of the church. \n\nHamm said: 'I tried to talk with [Mattox] and he was just determined to say, 'You can't come over here, period.' \n\nHamm Biggs said despite the ban, she still considers herself a member of the congregation. She attended the Sunday service last weekend.  \n   \nHamm Biggs was left heartbroken after she received a letter in the mail from church members who banned her from stepping foot inside the church \n \nHamm Biggs explained: 'He told police he wanted to put us out, but the police told him 'you can't do that' \n\nHamm Biggs said the entire debacle unfolded after she told the Reverend Mattox she did not agree with his preaching style.  \n\nBut her complaints did not sit well with him. \n\nSoon after she voiced her opinion, the letter arrived. In the letter, sent by certified mail, Hamm Biggs learnt that her church-going privileges were being 'revoked.'  \n\nIt stated: 'Dear Mrs. Genora Hamm Biggs, This letter is to inform you that according to the by-laws of the Union Grove Baptist Church, and by vote of the active members, any membership or associations that you have had with this church are now officially revoked.  \n\n'Therefore, you cannot attend Union Grove Baptist Church for any reason whatsoever. You are not to come to the property of the Union Grove Baptist Church located at 680 Pulliam Street, Elberton, Georgia 30635.  \n\nSincerely, The members and officers of the Union Grove Baptist Church.'  \n\n\nThe devout Christian was a former city clerk and a school teacher who taught first grade for 40 years.  \n\nShe says she prays daily but is having her faith tested  after she received the letter.  \n\nAnd it got worse when she defied the church's orders and went back to worship. She said she was met by the frosty priest who wanted police to escort her out.  \n\nHamm Biggs said: 'The letter said we're not to come back, but we went back – police were there.'  \n\nShe told Fox Carolina : 'He told police he wanted to put us out, but the police told him 'you can't do that.' \n\nAfter that,  the pastor dismissed the service. The lights were turned off and Hamm Biggs was left sitting on the pew of a darkened sanctuary. \n\n'I was shocked. It was not a good feeling. I haven't seen anything like this before,' she said shaking her head. \n   \nIn the letter, sent by certified mail, it was signed by members and officers of the Union Grove Baptist Church' \n   \nHamm Biggs' name is etched on the side of the church, but she's been scarred by the entire bad experience \n\nElberton police officers say it is a civil matter and have not made any arrests.  \n\nHamm  Biggs' grandson, Eliott Dye and Kevin Hamm say they are upset over the way Hamm Biggs was treated. \n\nHamm told Online Athens : 'To disrespect a pillar and a mother of the church; how can we sit back and watch something like this go forward?' \n\nHer grandson describes his granny as 'outspoken'. He recalls an incident when  a  woman in the church called his grandmother 'Jezebel,' but she didn't hear what she'd said. \n\nHe said: 'I never told her because her feelings would have been hurt. They have been so rude and I don't understand why it's been directed at my grandmother...[But] my grandmother can be pretty outspoken and that could have a lot to do with it.' \n\nThe embattled centenarian, has, however, received the backing of quite a few of the church's 150 parishioners. \n\nEzell Land, who used to be a deacon at the church, said the Hamm Biggs' family literally founded the church. He said quite simply: 'It's not right!' \n\n'They brought it here on a mule and a wagon from the country when I was a little boy,' Land said.  \n\nLand also attended the church for 56 years before he decided to leave after a run-in with the pastor over his singing. \n\n'Every time I would get up, the pastor would get up and make remarks when I sang and stuff. So, I just got my hat and I left,' he said.  \n   \nEzell Land, who used to be a deacon at the church, said the Hamm Biggs' family literally founded the church. He said quite simply: 'It's not right!' \n\nHamm Biggs' name is etched on the side of the church, but she says she's been scarred by the entire experience.  \n\nShe never expected to be thrown out of a church she loved. \n\n'I wanna get my church straight like it has been,' she said sadly.  \n\nHamm Biggs is receiving widespread support from people on social media. Many have taken to the church's Facebook page to voice their disgust at the church's actions. \n\nShataphy Baugns wrote: 'This is a disgrace to all the children of God....The devil is what you serve @ this church bless the elder lady soul. I pray God keep her covered and give her strength from the hurt she felt with this ridiculous decision made by this pastor.' \n\nScott Allen wrote: 'I have never heard of such an act in all my life. It's bad enough that non believer are attacking us believers, but to hear of this kind of action is shame.  \n\n'Those who signed that mean letter should apologize and allow Miss Hamm Biggs back into the church. Make things right again. This is not your house, it is God's House.'", "source": "Mail Online UK"}