{"published": "2015-09-16T20:30:01Z", "media-type": "News", "title": "Bowyer Enjoys 'Undercover' Work To Surprise TMS Fans", "id": "4b63744e-9afa-4ffa-a7fc-9b5405b65bbb", "content": "Darrin Spier, of Garland, Tom Porter, of Plano, and Judy McMains, of Whitesboro, were under the assumption that they were at the park to film a Texas Motor Speedway \"Fan Appreciation Day\" segment for \"Big Hoss TV\" that would air during the AAA Texas 500 Chase race on Sunday, Nov. 8. Little did they know the fan appreciation would come from none other than the affable Bowyer. \nBowyer, wearing a Texas Motor Speedway ball cap and Oakley sunglasses, was disguised as a pestering videographer for the interviewer - the speedway's Total Access Radio Network host Rich Phillips - that was part of the media contingent on hand. He badgered all three throughout their interviews before revealing his identity much to their surprise and delight. \n\n\"I've done a lot of things with fans in the past, but this was the best,\" Bowyer said. \"The folks at Texas always seem to come up with the best ideas. This was like being on Jimmy Fallon. In fact, I got to be Jimmy Fallon for a few minutes here today and that is awesome. All of the people that we surprised had great reactions and it was fun to do a little different skit with each of them.\" \n\nBowyer relished his role as he bluntly interjected and interrupted the season ticketholders during their interviews. He jumped in to adjust Spier's lapel microphone after \"encountering\" audio issues, chastised Porter for projecting Dale Earnhardt Jr. to fare better than him in the Chase, and stepped out from behind the camera and earned a hug from McMains after she proclaimed Bowyer as her favorite driver. \n\n\"You totally got me,\" said Porter, a season ticket holder for eight years and a Speedway Club member. \"That was awesome. I still can't believe it.\" \n\nMcMains, a Texas Motor Speedway season ticketholder for nine years and also a Speedway Club member, jumped with enthusiasm as she realized it was Bowyer, her favorite NASCAR driver, behind the camera. \n\n\"Oh my gosh, I was so excited when I noticed it was Clint,\" McMains. \"I love me some Clint. I have some pictures of him on my phone from the last race at Texas. This is a thrill I will never forget.\" \n\nBowyer's surprise also included a gift package for each season ticket holder from Texas Motor Speedway Assistant General Manager Kenton Nelson. He presented each with a Charlie 1 Horse cowboy hat - the same ones the Sprint Cup Series winner receives in Victory Lane at Texas - and an oversized AAA Texas 500 ticket bearing Bowyer's likeness with their exact seat location to go along with a bag of speedway merchandise. Bowyer enhanced the cowboy hat and oversized ticket by autographing them for each of the season ticketholders. \n\n\"This was a great opportunity today to promote the Chase and the AAA Texas 500 here on November 8, but it also was an opportune time to show our appreciation for a few of our loyal season ticket holders with the dynamics of this media event,\" Nelson said. \"It's very rewarding to have the chance to connect our fans with a driver like Clint, especially a surprise meeting where their expressions were priceless.\" \n\nBowyer concluded his visit with a stop at KXAS-NBC 5 in Fort Worth to celebrate NASCAR's new television partnership with parent company NBC that began this season. The AAA Texas 500 - as well as the O'Reilly Auto Parts Challenge on Saturday, Nov. 7 at Texas Motor Speedway - both will be broadcast live on NBC. \n\nKXAS Sports Director Newy Scruggs conducted a Q&A session with Bowyer for the news staff, the two picked their Chase brackets and the NASCAR star also presented station general manager Tom Ehlmann, Telemundo GM John Trevino and Scruggs with signed cowboy hats. Bowyer's pick to win it all in the bracket was fellow Toyota driver Matt Kenseth of Joe Gibbs Racing. \n\nMaking the Chase for the sixth time in his career did not come without its struggles for Bowyer. He learned last month that this would be his final season with Michael Waltrip Racing as a result of primary investor Rob Kauffman announcing Aug. 22 that the organization would cease operations at the conclusion of the season. \n\nWithout a ride for 2016, Bowyer enters the Chase with little to lose and perhaps an extended audition for potentially interested teams. He remains proud of the No. 15 5-Hour Energy team and its efforts to battle adversity and find its way into the Chase and the chance at what would be a historic Sprint Cup Series championship. \n\n\"This is just a huge relief,\" Bowyer said of making the Chase after his 10th-place finish at Richmond secured his berth in the field. \"It's our last year together, period. As a unit, as MWR exists, this is our last opportunity at bat here to get it all. You just have to have that mentality, and being in the situation you are in enables you to do just that. It's literally anything above and beyond what we've already accomplished at Richmond last weekend is blue sky.\" \n\nA quest for the Sprint Cup championship includes a stop to Texas Motor Speedway for the AAA Texas 500 on Sunday, Nov. 8 - the second of three races in the Eliminator 8 Round of the Chase and eighth event in the 10-race format. \n\n\"I have always liked racing at Texas,\" said Bowyer, a 10-year Sprint Cup veteran still in search of his first Cup win at Texas Motor Speedway. \"The track is wide and fast and it has been a good place for us in the past. I always look forward to racing here and hopefully we are in the Chase when we come back here in November.\" \n\nThe Chase for the Sprint Cup - NASCAR's playoffs - is a 10-race culmination to the season that crowns a battle-tested champion. Starting with a 16-driver field, four drivers will be eliminated after every three races, setting up a \"winner-take-all\" championship showdown at Homestead-Miami Speedway on Sunday, Nov. 22 (2 p.m. CT on NBC). The top finisher among the Championship 4 at Homestead-Miami Speedway will win the NASCAR Sprint Cup Series championship. The Chase for the NASCAR Sprint Cup gets underway this weekend at Chicagoland Speedway on Sunday at 2 p.m. CT on NBC Sports Network. \n\nFans can select their Chase bracket on www.texasmotorspeedway.com and have a chance to win a free trip to the 2016 Sprint All-Star Race at Charlotte Motor Speedway. \n\nPaddockTalk Perspective", "source": "PaddockTalk"}