{"published": "2015-09-07T05:20:15Z", "media-type": "Blog", "title": "Minnesota dentist who killed Cecil the lion breaks his silence, returns to work", "id": "118e3e65-9264-4c3d-b9b1-c98a3aed3535", "content": "Walter Palmer, the Twin Cities area dentist who has faced enormous criticism for killing a popular lion on a hunting trip to Zimbabwe earlier this summer, plans to return to his dental practice Tuesday, he told reporters.\n\nAfter being out of the public eye for weeks, Palmer conducted his first interview since the July incident with the Associated Press and the Star Tribune Sunday evening.\n\nDuring the 20-minute session, Palmer reiterated that he believes he was acting legally when he killed Cecil, a beloved lion who was a popular attraction at the Hwange National Park. He added that he was \"stunned\" when he learned that his hunting party had killed the well-known animal.\n\nCecil had a distinctive black mane, and he was wearing a GPS collar which was monitored for research purposes by Oxford University.\n\nAccording to the Associated Press, Palmer said some of the details of the hunt that were made public were incorrect.\n\nPalmer explained that he shot the lion with a compound bow and the animal didn't die immediately. He said he tracked the lion and killed it with an arrow the next day, disputing reports that the lion was alive for another 40 hours and that he used a gun to kill it, the Associated Press reports.\n\nPalmer also noted that he couldn't see the radio collar because it was hidden by Cecil's mane, and he again expressed remorse for killing the beloved animal.\n\nhttps://twitter.com/stevesilberman/status/640748181798567937\n\nIt was reported that Palmer paid $55,000 to participate in the hunt, but he would not answer questions about how much he paid, or about other hunting trips he has taken, according to the Associated Press.\n\nPalmer also did not allow photos or video to be taken, and said this would be his only interview on the matter, the Star Tribune said.\n\nOnce his identity was made public, Palmer was vilified by animal rights groups, conservationists, celebrities and others. Protesters showed up at his Bloomington dental clinic, and he received threats.\n\nPalmer, 55, closed his clinic for a period of time because of the public backlash, and he has kept a low profile.\n\nHis office reopened a few weeks ago, but he himself has not returned to work yet. He told the reporters he plans to do that on Tuesday.\n\n\"I need to get back to my staff and my patients, and they want me back,\" he said, according to the Star Tribune.\n\nhttps://twitter.com/TelegraphWorld/status/640745823874093057\n\nPalmer said his wife and daughter have been particularly affected by the ordeal, and he said they feel threatened.\n\nThe hunting guide and the owner of the property on which Cecil was killed have both been charged with participating in an illegal hunt, and some officials in Zimbabwe have called for Palmer's extradition to that country for possible charges as well. But no formal steps have been taken to that end.\n\nAn attorney who said he was an unpaid adviser to Palmer said he has not heard from officials in the U.S. or Zimbabwe in several weeks about their investigations into the incident, the Associated Press reports.", "source": "BringMeTheNews.com"}