{"published": "2015-09-26T01:25:01Z", "media-type": "Blog", "title": "Additional Non-Personal Email Found Among Among Clinton’s Deleted Email Threating To Further Weaken Her Candidacy", "id": "a02c3fac-e382-4bfc-8ece-e1e2ad8fdbef", "content": "It has been another bad week for Hillary Clinton. On Tuesday the State Department contradicted Hillary Clinton’s claims about the Justice Department investigation, stating it was prompted by Clinton’s exclusive use of a private email system. The week ended with two separate reports of business related email being among the email which Clinton deleted, claiming it to be personal. \n \nAP reports : \n \nThe Obama administration has discovered a chain of emails that Hillary Rodham Clinton failed to turn over when she provided what she said was the full record of work-related correspondence as secretary of state, officials told The Associated Press Friday, adding to the growing questions related to the Democratic presidential front-runner’s unusual usage of a private email account and server while in government. \n \nThe messages were exchanged with retired Gen. David Petraeus when he headed the military’s U.S. Central Command, responsible for running the wars in Iraq and Afghanistan. They began before Clinton entered office and continued into her first days at the State Department. They largely pertained to personnel matters and don’t appear to deal with highly classified material, officials said, but their existence challenges Clinton’s claim that she has handed over the entirety of her work emails from the account. \n \nThe Hill reported on a second case of business related email which was not turned over, along with the above AP report noting, “they fly in the face of Clinton’s previous claim that she had turned over all of her work-related emails.” \n \nObama administration officials made new revelations about Hillary Clinton’s emails on Friday, as the ongoing controversy continues to spin against the Democratic presidential front-runner. \n \nIn one announcement, a senior State Department official said that the department was handing over “a small number” of new emails related to the 2012 attack in Benghazi, Libya, to a House committee investigating the incident. \n Separately, the  Associated Press reported  that the administration had discovered a new chain of emails that Clinton had declined to turn over, despite her claims to have provided the government with all work-related messages.  \nThe news builds on the growing scrutiny on Clinton, which has threatened to derail her White House campaign. \n \nThe AP report in particular is likely to add to mounting allegations that Clinton had repeatedly tried to deceive the public by using a personal email address routed through a private server… \n \nThe emails have been implicated in nearly  three-dozen ongoing public-records lawsuits  against the State Department, and the ongoing fallout threatens to stretch at least into 2016. \n \nThe Guardian had more on the email exchange with Petraeus, showing further false from Clinton regarding the email: \n \nThe Petraeus emails, however, represent a more serious breach of protocol. The State Department’s record of Clinton emails begins on 18 March 2009 – almost two months after she entered office. Before then, Clinton has claimed, she used an old AT&T Blackberry email account, the contents of which she no longer can access. \n \nThe Petraeus emails, first discovered by the Defense Department and then passed to the State Department’s inspector general, challenge that claim. They start on 10 January 2009, with Clinton using the older email account. But by 28 January – a week after her swearing in – she switched to using the private email address on a homebrew server that she would rely on for the rest of her tenure. There are fewer than 10 emails back and forth in total, officials said, and the chain ends on 1 February. \n \nThey also commented on the political ramifications: \n \nThe revelations could not come at a worse time for Clinton, who has been dogged for months by questions about her email practices. \n \nHer poll numbers have also been slipping in recent weeks. The latest poll of likely Democratic primary voters in New Hampshire show the former secretary of state 16 points behind the frontrunner, Vermont senator Bernie Sanders. \n \nHer favorability rating has dropped six points since last March, and a Fox News national poll this week found 58% of responders believed she had lied about how her emails were handled while secretary of state. \n \nI don’t know how much we can trust information from a Fox poll, but other polls have similarly shown a growing distrust of Hillary Clinton. \n \nThis is not the first example which has been uncovered of email related to Libya and terrorism which was missing from the email turned over by Hillary Clinton. Missing and altered email was uncovered when compared with Sidney Blumenthal’s email conversations with Clinton. \n \nIt is unfortunate that the investigation of deleted email is centered around Benghazi. There is unlikely anything further to find about Benghazi, with no evidence having been found to support the Republican conspiracy theories. It would be more interesting to see if there is any email regarding parties in cases where Clinton was making a decision happened to make large contributions to the Foundation, or happened to pay extraordinarily high speaking fees to Bill at the time. While Congressional Republicans are currently concentrating on Benghazi, information on other topics might come out in further Congressional investigation or in the multiple Freedom of Information Act suits in progress. \n \nDo Democrats really want to nominate a candidate whose ethical misconduct will likley be the subject of headlines well inton 2016? \n \n ", "source": "Liberal Values"}