{"published": "2015-09-28T20:22:43Z", "media-type": "Blog", "title": "Public meetings planned on Blasco 'idea lab'", "id": "e872b9ce-ec0c-48d7-93eb-a8ab122fb3bc", "content": "Public meetings planned on Blasco 'idea lab'\rBy Kevin Flowers\n814-870-1693\nErie Times-News\rSeptember 28, 2015 03:22 PM By Kevin Flowers\n814-870-1693\nErie Times-News\rSeptember 28, 2015 03:22 PM ERIE, Pa. -- Two public meetings will take place in October regarding plans to expand Blasco Library's public computer lab and create a business, technology and idea center there.\nBoth meetings are set for the Hirt Auditorium at the library, 160 E. Front St. The first will be at 6 p.m. on Oct. 13; the second will take place Oct. 16, starting at 10 a.m.\nLibrary Director Mary Rennie has said that public meetings would be part of the expansion plan, to give local residents a chance to ask questions about and hear details of the project, which includes a physical redesign of the library's second floor.\nThe work would also expand the existing public computer lab, which currently serves about 125,000 patrons a year at no cost; and provide on-site research assistance, as well as meeting space, for local entrepreneurs or those looking to start a business.\nLibrary staffers and representatives from Bostwick Design Partnership, 2631 W. Eighth St., will attend the meeting. Bostwick has prior experience in creating library space and was selected by the Erie County Library Foundation in March to handle the renovations.\rThe project's budget is still being determined, but its first phase could cost about $200,000, Rennie said.\nIt was announced in June that the project was awarded a $100,000 grant from the Cafaro Foundation, an affiliate of Youngstown, Ohio-based Cafaro Co., which owns the Millcreek Mall.\nKEVIN FLOWERS can be reached at 870-1693 or by e-mail. Follow him on Twitter at twitter.com/ETNflowers.\r\"; } else\r// Add the individual content recommendation created above to the set of recommendations\rvar div = document.createElement('div');\rdiv.id = 'd132a0d072e7060d3fe11f211ab058accadeb0e2_recDiv' + i;\rdiv.className = \"col-xs-12 col-sm-4 buffer-bottom\"; // This configures the bootstrap framework's behaviour\rdocument.getElementById('myContentRecs_d132a0d072e7060d3fe11f211ab058accadeb0e2').appendChild(div); document.getElementById(div.id).innerHTML = recContent;\t} }\rvar cX = cX || ; cX.callQueue = cX.callQueue || [];\rcX.callQueue.push(['insertWidget',]);\r} else\rWhat do you think?\rRead our commenting policy\rRead our privacy policy", "source": "GoErie.com Top Headlines"}