{"published": "2015-09-22T16:26:49Z", "media-type": "Blog", "title": "Today’s news update -Written complaint against Haggenmiller “He refuses to leave me alone”;  Council meets for work session; Only 10% of addicts seek treatment; The Y celebrates 1 year and hosts “Mindful Eating”;  Heritage Square Block party", "id": "65f43347-9763-4a8a-8c1d-b544761aa26a", "content": "“He refuses to leave me alone…” “In trying to terminate a romantic relationship, Nick Haggenmiller has refused to leave me alone”, that’s part of an email sent to the City of Northfield’s Human Resources Manager Michelle Mahowald from the person who filed a complaint against the City Administrator.  The email is dated August 21st but within the formal complaint is an indication that this person complained in May when, according to the complaint, she tried to end the relationship for a 2nd time.  Her name and other information has been redacted from the complaint. The Northfield news reported that it is a female department head after listening at the door of the first closed meeting on September 8th.  There are only 2 of them at City Hall.  No one from City Hall is talking.  The only communication is through data request forms sent to Mahowald.   According to Haggenmiller’s separation agreement his employment formally ends September 30th.  He’ll receive another 2 months salary and health insurance paid through November 30th. redacted written complaint Haggenmiller separation agreement Council meets for work session The Northfield City Council meets tonight for a work session.  They’ll hear from Bike Northfield who is proposing more bike lanes in an effort to be get a bronze certification in the Bicycle Friendly Community program.  Leah Eby with Growing Up Healthy will give a mid-contract report as will Executive Director of the Northfield Historical Society.  Public Works Director Dave Bennett will report on the public works organizational analysis.   Mayor Graham will be in studio tomorrow morning at 7:20 with a recap. Only 10% of addicts seek treatment September is Recovery month, a time to celebrate those in recovery and take away the stigma of addiction.  Rice County Chemical Health Social Worker Yvette Marthaler says we have a great support system here to offer hope.  Marthaler says only 10% of addicts seek help.  She assesses indivduals through the County.  [listen to her full quotes on the podcast below]  Marthaler says Steve’s Law was passed during the last legislative session to promote calling 911 if you’re with someone overdosing on opioids.  The law gives them amnesty for calling and staying with the person until police arrive.  Naloxone is a drug given to someone overdosing that reverses the effects.  On September 30th at 5:30, the Moravian Church is sponsoring a one hour training event on Steve’s Law and on the use of naloxone.  The drug is administered by shot and is available as a prescription.  Marthaler says addiction needs to be treated as a mental health issue and remove the stigma. The Y celebrates 1 year and hosts “Mindful Eating” It’s the Northfield Area YMCA’s One-Year Anniversary and they’re celebrating all week with fun themes each day!  There are over 4,800 current members and another 75-125 community members visit each week.  The Y has over 80 full and part-time employees.  This Thursday they’ll host “Mindful Eating”.   Northfield Hospital & Clinics registered dietician nutrionist coordinator Kristi Von Ruden will lead the seminar designed to help participants shift out of a diet mentality, and enjoy eating instead.  The one-hour session starts at 6:30.  The event is free and open to the public. Registration is preferred; walk-ins are welcome as space allows.  Often when people think about food and health, they focus on diet and weight control. Mindful eating is a different perspective that helps people approach nutrition and wellness from a positive viewpoint.  All participants for “Mindful Eating” will receive two free days at the Y. Heritage Square Block party Heritage Square Retail Center off Highway 3 is under new ownership and they’re having a block party today!  The Northfield Real Estate Fund is a group of local citizens who’ve joined together to invest in the Northfield Community and they’re celebrating with food, games, live music by the Counterfactuals, tours and a cash bar from 4:30 till 7.   KYMN will be broadcasting live from 4:30 to 6. Click below to listen to FULL newscast: 9-22-15 news\nListen for news updates on-air at 6, 7, 8, Noon, 3 and 5 Related", "source": "KYMN Radio -  Northfield, MN"}