{"published": "2015-09-18T11:07:04Z", "media-type": "News", "title": "TRACON Pharmaceuticals Reports Ongoing Complete Response in Choriocarcinoma Patient Treated With Company's TRC105 in Compassionate Use Phase 2 Clinical Trial Conducted at Dana-Farber Cancer Institute", "id": "fead704f-288e-4324-9d02-bbc261bf7038", "content": "SAN DIEGO, Sept. 18, 2015 (GLOBE NEWSWIRE) -- TRACON Pharmaceuticals (NASDAQ: TCON), a clinical stage biopharmaceutical company focused on the development and commercialization of novel targeted therapeutics for cancer, wet age-related macular degeneration and fibrotic diseases, today announced results from two oral presentations, one by Dr. Kevin Elias and one by Dr. Neil Horowitz, both of the Dana-Farber Cancer Institute and Harvard Medical School, at the 18th World Congress on Gestational Trophoblastic Diseases in Densapar, Bali, Indonesia. The single patient compassionate use Phase 2 clinical trial enrolled a 37-year old woman with persistent and unresectable metastatic choriocarcinoma, an aggressive form of gestational trophoblastic neoplasia (GTN). Prior to entry into the trial, the patient had received multiple treatments, including laparoscopic hysterectomy, five prior chemotherapy regimens and stem cell transplant.\n\nThe patient was treated with TRC105 dosed 10 mg/kg weekly in combination with Avastin® (bevacizumab) dosed 10 mg/kg every other week. As of the time of the presentation, the patient had completed 7 cycles (28 weeks) of treatment. Beta human chorionic gonadotropin (β-hCG), a known, reliable marker of disease burden in choriocarcinoma, normalized during the fourth cycle of treatment, decreasing from greater than 3,000 IU/L at treatment initiation to less than 1 IU/L from cycles 4 through 7, indicating an ongoing complete response. \n\nChoriocarcinoma represents the second tumor type known to express high levels of endoglin in which complete durable responses have been observed following treatment with a combination of TRC105 and a VEGF inhibitor. In June 2015, Dr. Steven Attia of the Mayo Clinic reported complete responses in two patients with angiosarcoma, treated with TRC105 and Votrient® (pazopanib), at the American Society of Clinical Oncology (ASCO) annual meeting in Chicago.\n\n\"We have now seen complete responses in two orphan tumor types that overexpress endoglin, choriocarcinoma and angiosarcoma. There are currently limited treatment options for patients with either of these cancers who progress on first-line chemotherapy,\" said Charles P. Theuer, M.D., Ph.D., President and CEO of TRACON. \"We intend to treat additional patients with GTN in a Phase 2 multicenter trial that we expect to initiate in the fourth quarter of 2015, and to apply for orphan drug status for TRC105 in GTN, as well as soft tissue sarcoma, by the end of the year.\"\n\nAbout Choriocarcinoma1\n\nGestational trophoblastic disease (GTD) is the term used to describe a group of rare diseases that originate in the placenta and have the potential to locally invade the uterus and metastasize. The pathogenesis of GTD is unique because the maternal tumor arises from gestational rather than maternal tissue. The major histologic entities for this disease include complete molar pregnancy, partial molar pregnancy, invasive mole, and choriocarcinoma. The term gestational trophoblastic neoplasia (GTN) is used when molar and non-molar pregnancies become malignant, and comprise the morphologic entities of invasive mole and choriocarcinoma. Choriocarcinoma metastasizes hematogenously and can follow any type of pregnancy, but most commonly develops after complete hydatidiform mole. The reported incidence of GTD in the United States is about 110 to 120 per 100,000 pregnancies. The reported incidence of choriocarcinoma, the most aggressive form of GTD, in the United States is about 2 to 7 per 100,000 pregnancies. 1Source: National Cancer Institute\n\nAbout TRC105\n\nTRC105 is a novel, clinical stage antibody to endoglin, a protein overexpressed on proliferating endothelial cells that is essential for angiogenesis, the process of new blood vessel formation. TRC105 is currently being studied in multiple Phase 2 clinical trials sponsored by both TRACON and the National Cancer Institute for the treatment of multiple solid tumor types in combination with VEGF inhibitors. TRC105 is also being developed in combination with VEGF inhibitor treatments in wet AMD. For more information about the clinical trials, please visit TRACON's website at http://www.traconpharma.com/clinical_trials.php.\n\nAbout TRACON\n\nTRACON develops targeted therapies for cancer, wet AMD and fibrotic diseases. TRACON's current pipeline includes two clinical stage product candidates: TRC105, an anti-endoglin antibody that is being developed for the treatment of renal cell carcinoma, soft tissue sarcoma, hepatocellular carcinoma, glioblastoma and choriocarcinoma, and TRC102, a small molecule that is being developed for the treatment of lung cancer and glioblastoma. To learn more about TRACON and its product candidates, visit TRACON's website at www.traconpharma.com.\n\nForward-Looking Statements\n\nStatements made in this press release regarding matters that are not historical facts are \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Because such statements are subject to risks and uncertainties, actual results may differ materially from those expressed or implied by such forward-looking statements. Such statements include, but are not limited to, statements regarding TRACON's plans to further develop its product candidates, expectations regarding the initiation and timing of future clinical trials by TRACON or third parties, and expected regulatory submissions and determinations. Risks that could cause actual results to differ from those expressed in these forward-looking statements include: risks associated with clinical development; whether TRACON, the NCI or others will be able to complete or initiate clinical trials on TRACON's expected timelines, if at all; the fact that future preclinical studies and clinical trials may not be successful or otherwise consistent with results from prior studies; potential changes in regulatory requirements in the United States and foreign countries; TRACON's reliance on third parties for the development of its product candidates, including the conduct of its clinical trials and manufacture of its product candidates; whether TRACON will be able to obtain additional financing; and other risks described in TRACON's filings with the Securities and Exchange Commission under the heading \"Risk Factors\". All forward-looking statements contained in this press release speak only as of the date on which they were made and are based on management's assumptions and estimates as of such date. TRACON undertakes no obligation to update such statements to reflect events that occur or circumstances that exist after the date on which they were made.", "source": "Benzinga.com"}