{"published": "2015-09-28T23:04:28Z", "media-type": "News", "title": "'NCIS: New Orleans': Shalita Grant on Percy's past and adjusting to the team", "id": "b01e2b95-c786-42c4-8b11-92900f5165aa", "content": "Shalita Grant's Sonja Percy may have been an ATF agent before joining Pride's NCIS team, but to her teammates, she's still the NFG. Examiner.com had the chance to chat with the actress about what's coming up for Percy, \"NCIS: New Orleans\" season2, her dream \"NCIS\" crossover and more. \n\nExaminer.com: What do you like most about playing Percy in season 2 as a member of the team versus just working with the team like in season 1? \n \nShalita Grant: \"The relationships are a lot more specific. Also, there's a lot of probie jokes and ribbing, so she sort of comes in – even though she's ATF – she's not really in the position of the know-it-all whatever. LaSalle and Brody they give her a rough time, and she's all game for it. Also, the stunts are bigger because I have more show now so we have a lot more stunts and they're explosive and crazy and I get to do a lot of really cool stuff. It's a good time.\" \n \nSpeaking of Percy as the probie, or NFG as they're calling her, how long is that going to last? Any more pranks like with her badge coming up? \n \nYeah, there is. She's not new for only one episode. It's also Sonja too getting used to being on a team and having a boss. Pride and her relationship is getting more specific and she's getting used to having someone to report to, which she didn't really have before because she was doing these solo undercover missions and so she didn't have someone that she had to run things by every day. It was more of a check-in thing. And now she has a real boss, so she has to get used to that too. So everybody's getting used to everybody on the show, and LaSalle and Brody take full advantage of it for as long as they can. \n \nHow long is the adjustment period going to be for Percy? \n \nIt's long. The one that we're on now – we're on episode 8 – she's still having a tough time. Also her backstory, her past is coming up as well. Percy's very private, and so the fact that she is working on a team of people who feel like a family, she really has to get used to that. So a lot of the stuff from her past comes up, and she would prefer to deal with it her own way, which eventually becomes a problem. We'll see that work out too. It's an adjustment period. \n \nYou mentioned that her backstory is coming up. Is there an episode number for that or is it over multiple episodes? \n \nThere are a few episodes that her backstory kind of comes up. But we're going to see tomorrow night some of that. We're going to get introduced to some of what Percy has in her backyard, but definitely episode 4 and episode 6 are pretty heavy. You get a lot more information about Percy. \n \nWhat can you tease about tomorrow's episode and case? \n \nWell, I watched the preview and they didn't show what the crime is, but there is a Navy superstar who dies and we have to find out if this was a terrorist group, if this was an inside job and I think for Percy and also for LaSalle, it kind of hits home a little bit for them, so we'll get to see some Percy and LaSalle action, fighting some bad guys. \n \nSo is Percy going to be partnered up with LaSalle mostly? \n \nWe do kind of toss around a bit, but this episode is a lot of Percy and LaSalle. \n \nPercy worked undercover at ATF. Will we see that now that she's with NCIS, or is that not in the cards as she adjusts? \n \nOh yeah, that definitely comes up. In the first episode, when Percy's old ATF boss came on, so there is definitely, Percy's relying on her prior work with that agency, and that definitely shows up in the season. …You might [see her undercover soon]. \n \nAt the end of the premiere, Percy tells Pride that there's a bounty out on him. Can you tease anything about what's coming up with that or how often it will be brought up? \n \nWhat I can say is that from where I'm standing, I believe that Zed is a much crazier adversary than Baitfish. His network, the separatist militia, they hold a grudge, and it's worth watching. It's worth watching how they work out trying to get my boss. \n \nDoes Percy think that this is a bigger deal than Pride does? \n \nI think what we saw at the end of the first episode – I think that Pride is a seasoned officer, right? So he knows that if someone puts a bounty out on a cop, that that's a pretty big deal and it's no small potatoes, like $2000. It's a $50,000 bounty. So, I think Pride knows that this is definitely a problem, but at the end of that scene, he just really wanted to celebrate opening up the bar. But Percy, being a younger agent, [to her] there's an immediacy there that Pride just doesn't have because he's been on the job for so long. So it does come up again and we will see Zed become a bigger problem and we'll see how Pride deals with it. \n \nCBS put up a sneak peek (above) of Percy having to clean the bar in the next episode. How often are we going to see them at the bar? Every episode? Every few episodes? \n \nI think you see the bar almost every episode. You get to see how he's coming along with it, the progress of getting the bar off the ground. But I'm excited about the bar. There's so many possibilities with Pride's bar, it's kind of crazy. \n \nThat's where we'll bring in music too more, right? \n \nYeah. I'm excited to see what the writers have for that space. So far, we're really just setting it up, just getting it off its feet. \n \nCan you tease any fun upcoming episodes? \n \nEpisode 2 is really good and it's really touching, and I think for LaSalle too, we get to see a little bit more about what happened with the mermaid and we're going to talk a little bit about that too, so it's a good episode. I watched it when I was doing ADR, and I was really touched and excited too because the stunts, all the action that we have is really cool. What I can speak to is that the first six episodes have felt like an action movie. The crew, everybody, we're doing so much more in these episodes. It's crazy. I can't wait for you to see episode 6. That's crazy. It feels like an action film. It really does. \n \nThe first season of the show had a few crossovers. Anyone from the other \"NCIS\" shows that you would like to work with? \n \nI've been such a big LL Cool J fan, and I thought it was cool – no pun intended – that he was on \"NCIS: LA,\" so I would love if we did an NCIS: LA crossover. That would be pretty cool, and I think it would be awesome for Percy to work with LL's character. \n \n\"NCIS: New Orleans\" season 2 airs Tuesdays at 9 p.m. on CBS .", "source": "Examiner.com"}