{"published": "2015-09-01T11:19:18Z", "media-type": "News", "title": "RGU_OPTI-kompakt", "id": "782df84e-d34c-4564-b7ca-07e3ba9e2705", "content": "Do you think existing ERP (Enterprise Resource Planning) not suitable to \nmeet the requirement of the foundries? Why? What could be the solution? \n \nERP is not the new term for most of the foundryman. ERP was introduced with \nthe main intention to handle large data of manufacturing. Existing ERP \nfulfills the requirement of foundries? Probably not because today the \nbiggest requirement of foundry is \"Single system used by all the departments \nof foundry\" as most ERP does not include many vital operation/flow/process \nof foundries. \n \nDoes your ERP include Tool-Pattern management, production planning, Core \nproduction, shift planning, Record material composition from Spectrometer \nfor each heat, Historical data of each quality test? - Probably most of the \nERP does not include this. \n \nCan there be any solution? - RGU GmbH, Germany has been developing FRP - \nFoundry Resource Planning think beyond ERP. Dedicated FRP system developed \nonly for foundries not applicable for other manufacturing process other than \nfoundry. Over 120 foundries across pan Europe are running successfully on \nRGU-FRP software since last 30 years. \n \nLimitations of the existing ERP: \n \n1) How to calculate cost of casting part or total production/day: \n \nIf you are Foundry owner or top level management, the biggest challenge \nwould be, to calculate the CTC (cost to the company) for a single part or \ncost of total production/day etc. Most of the foundries never know this \ncost exactly, because foundry deals with so many possibilities, and \nnonlinear flow of process which are not part of the existing ERP. To \ncalculate this foundries should consider design & simulation cost, tool \nmanagement, rejection, scrap, energy cost, slag, material cost variations, \nlabor cost, unplanned activities (machining, external machining/services or \nsurface improvement), underutilization of man or machine, idle machine time \nand cost, return circuit etc. Any solution? - RGU.OPTI - FRP software read \nbelow. \n \n2) Resource planning \n \nMost of the ERP system cannot do the fully resource planning, because it \ndoes not have modules for production planning, Fettling & machining, quality \ncheck/test. If the foundry is able to specify each the resources required \nfor their casting part, and if ERP allows to record all the required \nresources in the system, the remaining job would be very easy for foundries \nto order, track, store, use and dispatch the required resources. But if ERP \ndoes not integrate with production, tool room, quality it would be \nimpossible to streamline your resource planning, and despite use of ERP it \nincreases burden of lots of work, email communication or miscommunication, \npaper work despite using the technology. Can any ERP software do complete \nresource planning even for new order booked? - YES IT IS POSSIBLE with \nRGU.OPTI - FRP software read below. \n \n3) Tool management \n \nTool & pattern management is one of the biggest need of foundry which is \nmissing in most ERP. For any production planning concern person should know \navailability of tool, mould box, or die casting machine. Tool & pattern \nmanufacturing, required time for making, cost, maintenance time and cost \netc. If ERP does not included this how could one calculate exact cost of \npart or total life cycle of tool cost? Can any ERP system includes \ntool-pattern management? - YES IT IS POSSIBLE with RGU.OPTI - FRP software \nread below. \n \n \n \n4) Design & Simulation data \n \nFoundries do various trial and error, or try possible ideas of various \ngating system design for which they have various drawings for each trial, 3D \nCAD model, Casting simulation data, if it is not recorded on ERP how would \nyou consider required time, effort and cost to develop one part? And even in \nfuture when similar part , it would be very easy for foundries to see the \nvarious design they have done in past and calculate cost and required time \nbased on past history saved. Does any ERP really in", "source": "Scribd"}