{"published": "2015-09-09T20:41:10Z", "media-type": "News", "title": "Basic Energy Services Reports Selected Operating Data For August 2015", "id": "6e58ac84-f3cd-428c-ab7d-73f2ffaf15cf", "content": "PR Newswire \n \nFORT WORTH, Texas, Sept. 9, 2015 \n   \nFORT WORTH, Texas , Sept. 9, 2015 /PRNewswire/ -- Basic Energy Services, Inc. (NYSE: BAS) (\"Basic\") today reported selected operating data for the month of August 2015.  Basic's well servicing rig count remained unchanged at 421. Well servicing rig hours for the month were 51,900 producing a rig utilization rate of 53%, compared to 52% and 74% in July 2015 and August 2014 , respectively. \n\nDuring the month, Basic's fluid service truck count increased by eight to 1,015. Fluid service truck hours for the month were 188,100 compared to 193,200 and 215,100 in July 2015 and August 2014 , respectively. \n\nDrilling rig days for the month were 86 producing a rig utilization of 23%, compared to 19% and 83% in July 2015 and August 2014 , respectively. \n\nRoe Patterson, Basic's President and Chief Executive Officer, commented, \"Given the volatility in oil prices during the month of August and the corresponding impact on our customers' spending, we were pleased to maintain utilization at relatively flat levels compared to July for our production related services. However, to maintain these utilization levels, we did give additional rate concessions in all business segments. Activity levels for our completion related services were lower in August than July due to lower customer spending resulting from the drop in oil prices. \n \n\"We continue to take defensive measures to maximize utilization and control costs under the existing business environment. Due to the recent volatility we experienced in August and our outlook for September, we now expect that our third quarter 2015 revenues will be 3 to 5% lower sequentially.\" \n   \nOPERATING DATA \n \n\n \n \n \n  \nMonth ended \n \n \n \n \n  \nAugust 31, \n  \n  \nJuly 31, \n \n \n \n \n  \n2015 \n   \n2014 \n  \n  \n2015 \n \n \n \n \n \n \n \n \n \nNumber of weekdays in period \n  \n \n  \n21 \n   \n21 \n  \n  \n23 \n \n \n \n \n \n \n \n \n \nNumber of well servicing rigs: 1 \n  \n \n \n \n \n \n \n  Weighted average for period  \n  \n \n  \n421 \n   \n421 \n  \n  \n421 \n  \n  End of period \n  \n \n  \n421 \n   \n421 \n  \n  \n421 \n  \n  Rig hours (000s)  \n  \n \n  \n51.9 \n   \n72.4 \n  \n  \n55.4 \n  \n  Rig utilization rate 2 \n  \n \n  \n53% \n   \n74% \n  \n  \n52% \n \n \n \n \n \n \n \n \n \nNumber of fluid service trucks: 1 \n  \n \n \n \n \n \n \n  Weighted average for period \n  \n \n  \n1,011 \n   \n1,022 \n  \n  \n1,010 \n  \n  End of period \n  \n \n  \n1,015 \n   \n1,024 \n  \n  \n1,007 \n  \n  Truck Hours (000s) \n  \n \n  \n188.1 \n   \n215.1 \n  \n  \n193.2 \n \n \n \n \n \n \n \n \n \nNumber of drilling rigs: 1 \n  \n \n \n \n \n \n \n  Weighted average for period \n  \n \n  \n12 \n   \n12 \n  \n  \n12 \n  \n  End of period \n  \n \n  \n12 \n   \n12 \n  \n  \n12 \n  \n  Drilling rig days \n  \n \n  \n86 \n   \n310 \n  \n  \n69 \n  \n  Drilling rig utilization \n  \n \n  \n23% \n   \n83% \n  \n  \n19% \n \n \n \n \n \n \n \n   \n(1) \n   \nIncludes all rigs and trucks owned during periods presented and excludes rigs and trucks held for sale. \n  \n(2) \n   \nRig utilization rate based on the weighted average number of rigs owned during the periods being reported, a 55-hour work week per rig and the number of weekdays in the periods being presented.  \n \n \n\nBasic Energy Services provides well site services essential to maintaining production from the oil and gas wells within its operating area.  The company employs more than 4,400 employees in more than 100 service points throughout the major oil and gas producing regions in Texas , Louisiana , Oklahoma , New Mexico , Arkansas , Kansas , and the Rocky Mountain and Appalachian regions. \n \nAdditional information on Basic Energy Services is available on the Company's website at http://www.basicenergyservices.com . \n\nSafe Harbor Statement \nThis release includes forward-looking statements and projections, made in reliance on the safe harbor provisions of the Private Securities Litigation Reform Act of 1995.  Basic has made every reasonable effort to ensure that the information and assumptions on which these statements and projections are based are current, reasonable, and complete.  However, a variety of factors could cause actual results to differ materially from the projections, anticipated results or other expectations expressed in this release, including (i) changes in demand for our services and any related material impact on our pricing and utilizations rates, (ii) Basic's ability to execute, manage and integrate acquisitions successfully and (iii) changes in our expenses, including labor or fuel costs and financing costs.  Additional important risk factors that could cause actual results to differ materially from expectations are disclosed in Item 1A of Basic's Form 10-K for the year ended December 31, 2014 and subsequent Form 10-Qs filed with the SEC.  While Basic makes these statements and projections in good faith, neither Basic nor its management can guarantee that anticipated future results will be achieved.  Basic assumes no obligation to publicly update or revise any forward-looking statements made herein or any other forward-looking statements made by Basic, whether as a result of new information, future events, or otherwise. \n   \nContacts: \n   \nAlan Krenek, Chief Financial Officer \n \n  \nBasic Energy Services, Inc. \n \n  \n817-334-4100 \n \n \n\n  \nJack Lascar / Stephanie Smith \n \n  \nDennard – Lascar Associates \n \n  \n713-529-6600 \n   \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/basic-energy-services-reports-selected-operating-data-for-august-2015-300140305.html \n\nSOURCE  Basic Energy Services, Inc.", "source": "Reuters"}