{"published": "2015-09-22T19:30:00Z", "media-type": "News", "title": "Goyder gardens open", "id": "5891accc-d3e8-444e-a057-9af7c4d173b1", "content": "Garden lovers are in for a treat over the October long weekend. Garden lovers are in for a treat over the October long weekend. Gardeners in Burra, Hallett, Mount Bryan and Farrell Flat will throw open their gates and welcome visitors to view the results of their labours of love.\n\nThe gardens will showcase a range of styles, the Burra Community Garden, cared for by a group of volunteers, to a small courtyard garden, and feature a variety of plants from hardy succulents and natives to roses, bulbs and cottage gardens.\n\nGardens in Burra, Farrell Flat and Mount Bryan will be open on Saturday and Sunday from 10am until 4pm. \n\nHallett gardens will only be open on Sunday.\n\nOn Saturday morning, Burra itself will take on a carnival feel with market stalls selling many plant themed goodies, both in the town square and at Burra north.\n\nTake the time to sit outside at one of the outdoor cafes and have a relaxing morning tea before setting off on your garden tour. \n\nWith 4 towns and more than 20 gardens on offer, it should be a weekend of paradise for garden lovers.\n\nSee the Burra District Open garden website for more information http://burradistrictsopengardens.weebly.com/ maps \n\nThe Garden theme continues at the Burra Regional Art Gallery with their annual competition 'Art of the Flower and Garden'.\n\nThe exhibition brings together both regional and local artists, including art work by students from Goyder schools. \n\nThe official opening will be held on Saturday, October 3 at 5.30pm, with guest speaker Vick Winnall, Chair of Open Gardens SA and competition judge, Dr Jennifer Gardner, Curator for the Waite Arboretum.\n\nA life long love affair with capturing the beauty of botanical subjects on silk and paper has culminated in an annex show for Burra artist Nan Annells.\n\nBoth exhibitions are open from the long weekend until mid November. \n\nIinformation on exhibitions can be found online at http://www.burragallery.com/", "source": "Northern Argus"}