{"published": "2015-09-04T18:56:13Z", "media-type": "Blog", "title": "Disney Books - Review", "id": "de0bc186-b649-4a52-b792-8dbf50a7057d", "content": "Disclosure - free sample provided. My kids always get so excited when we get books from Disney to review.  They can't wait to open the package.  Disney offers a huge selection of books for children of all ages.  They offer picture books, early readers, board books, chapter books, and more.  Their books make reading so much fun because they feature great Disney characters. Palace Pets - Pumpkin is a book about the puppy for Cinderella.  This is a touch and feel book.  The pages have different textures throughout the pages that your child can feel.  This really is a hands on way to get your child into reading.  This book is beautifully illustrated.  It has a handle, so your little one can carry it around with them wherever they want.  This is a great Fall themed book that would make a great gift for back to school, Halloween, or just because!  This book will retail for about $9.99.   Disney Tails - Figaro's Halloween Surprise is an adorable board book.  This is great for pre-schoolers or pre-k level readers.  This is another touch and feel book.  The front of the book is adorable and it features a fuzzy Figaro on it.  This book also has different textures that your child can use to touch, and learn while you are reading.  This Fall themed book is about Halloween.  This book will retail for $6.99.  This is a great Halloween treat for your child instead of the traditional sweet treat. Doc McStuffins - A Dragon's Best Friend is a Disney Junior Classic Tale.  This book is really neat because it is a picture book, and it is written perfectly for early readers.  The pages have colorful illustrations.  They also have simple text that isn't frustrating.  This is a fun story about a little fuzzball.  The fuzzball decides his best friend is a dragon.  This book will retail for $8.99. 5 Minute Stories - Frozen is a really great book to add to your child's book collection.  We are in love with the 5 Minute Story books from Disney.  These are books that are loaded with short stories.  This particular one is all about all of your favorite Frozen characters.  This is a great book if your child loves Frozen.  This book includes stories like A Royal Sleepover, The Frozen Monster, Across the Sea, and many more!  This beautifully illustrated book will retail for $12.99. You can learn more about all of the great books that Disney offers by visiting their website. Disclosure - I received a free sample to facilitate my review.  No monetary compensation was provided.  All opinions are completely my own.  My participation is voluntary.   I am disclosing in accordance with FTC 16 CFR Part 255.  ", "source": "Mommie of 2"}