{"published": "2015-09-17T10:44:00Z", "media-type": "News", "title": "Recipe of the Day: A buckle for any season", "id": "cabaf232-8041-47ed-baec-2c71a22406e3", "content": "You can use any kind of ripe, juicy summer fruit you like here. You can even take this recipe into the fall. As long as the fruit you use is soft and juicy, it should work well. Beware of harder fruit like apples and pears, which would probably need to be cooked through before being folded into the batter. A buckle doesn’t bake long enough to soften them. \n\nIn winter, feel free to substitute frozen fruit if that’s what you have. Just don’t thaw it first, or its seeping liquid will thin out the batter too much. Stir it in quickly while still frozen, then add a couple of minutes onto the baking time to compensate for the chill. \n\nBecause of all that fruit, buckles are best eaten on the same day they are baked. They tend to get soggy as they sit. \n\nBERRY BUCKLE \n\n1/2 cup (1 stick) butter, at room temperature, plus more for greasing pan \n\n1/2 cup sugar, more for sprinkling \n\n1/4 cup light brown sugar \n\n3 large eggs, at room temperature \n\n1 tablespoon finely grated lemon zest \n\n1 teaspoon vanilla extract \n\n1 1/4 cups all-purpose flour \n\n1/2 teaspoon fine sea salt \n\n1/2 teaspoon grated nutmeg \n\n1/4 teaspoon baking powder \n\n4 1/2 cups berries (a mix of blueberries, raspberries, blackberries or use any one kind) \n\nCinnamon, for dusting (optional) \n\nPowdered sugar, for dusting \n\n1. Heat oven to 375 degrees. Butter a 9-inch round cake pan. \n\n2. In the bowl of an electric mixer, add butter, sugar and brown sugar and beat until light and fluffy. Add eggs one at a time, then add lemon zest and vanilla and mix until combined. \n\n3. In a separate bowl, combine flour, salt, nutmeg and baking powder, and whisk to combine. Add dry ingredients to egg mixture and mix until just combined. \n\n4. Gently fold berries into the batter, then spread batter in pan and sprinkle lightly with more sugar. Bake 40 to 50 minutes, or until top is golden and cake is cooked through. \n\n5. Allow cake to cool, then sprinkle with cinnamon, if using, and powdered sugar. Yield: 8 servings. \n\nMelissa Clark, New York Times", "source": "Belleville News Democrat"}