{"published": "2015-09-15T15:03:20Z", "media-type": "News", "title": "Formerly SkinFit Austin, POREspective Debuts New Branding, Packaging and Website September 15, 2015POREspect​ive, formerly SkinFit Austin, has completed a major rebrand and debuted new packaging and a new website to position...", "id": "893b837a-6fd0-497f-958e-f160c40ebe10", "content": "POREspective Acne Control logo \n  POREspective is a salvation for acne sufferers who have been failed repeatedly by expensive medications and dermatologist visits.  \n\r Austin, TX (PRWEB) \r September 15, 2015 \r \n\nPOREspective, formerly SkinFit Austin, is proud to introduce its new identity, product packaging and enhanced website. Aimed at elevating branding and increasing differentiation and distance from competitors, the changes position the company for major growth and leadership in the acne control space. Licensed esthetician Alissa Chasen, who garnered national acclaim after founding SkinFit Austin in 2011, remains the face of the company. \n \n“POREspective is a salvation for acne sufferers who have been failed repeatedly by expensive medications and dermatologist visits,” said Chasen. “Our new brand identity and website allow us to connect even more powerfully with new and existing clients while remaining laser-focused on what we do best: clearing acne. We offer proven skin care products and personalized services, and our complimentary acne analysis and convenient in-person, phone or FaceTime consultations make it easy for anyone to get started.” \n \nThe POREspective method clears six distinct acne types and includes individualized acne treatments, home care regimens, nutritional recommendations, and lifestyle education. \n \nThe new POREspective website was designed and built entirely with the user in mind. It includes a nutrition blog, the ability to upload a photo and receive an online acne analysis, and a more robust e-commerce experience, among other features. Most importantly, it allows users to more quickly and easily browse POREspective’s comprehensive line of products and find acne products based on their specific needs.  For those wanting additional assistance, Acne Care Consultants are available to work one-on-one to create personalized acne treatment plans. \n \n“We believe acne is 20% inherited and 80% self-inflicted and that no single acne home care or treatment regimen is right for everyone,” continued Chasen. “POREspective is the only acne clinic in the U.S. that combines proven dermatology products and treatments with holistic nutrition and a functional medicine approach to identify the root cause of a client’s acne. By addressing the underlying causes of the disease through education, lifestyle choices, and an acne-safe topical care program, rather than the dermatologist approach of merely treating symptoms with oral antibiotics and Accutane, we can achieve clear skin and improved whole body health.” \n \nOnce an acne sufferer herself, Chasen has 20 years of experience in health care, dermatology, and acne treatment . Prior to founding POREspective, she held a wellness position with Methodist Health Care System’s Institute for Preventative Medicine and held pharmaceutical positions with Bristol-Myers Squibb and the dermatology division of Sanofi-Aventis. She has completed training in the anatomy and physiology of acne and pharmacology of prescription-level and over-the-counter (OTC) acne medications. Specializing in treating acne, pigmentation and acne scars, Chasen has personally cleared the skin of more than 600 clients over the last four years, both in-clinic and through virtual consultations with a proven set of treatment protocols and acne home care products. Chasen personally tests and approves all new product formulations with partner laboratories in California, Florida, and Texas. \n \nWhile the causes of acne vary from person to person, Chasen offers three practical tips everyone can use to help get clearer skin and reduce breakouts:\r \n\n\r\n  Take a 2-week dairy vacation. Cows’ milk increases insulin levels and kicks oil production into high gear, causing acne. Try substituting the cream in coffee or the milk in oatmeal for carrageenan-free almond milk. \r Keep mobile phone screens clean. Touchscreens transfer dirt and germs from fingers to faces. Use a cleansing wipe or rubbing alcohol every few days. Better yet, use headphones. \r Modify workout habits. Dirty yoga mats, bike helmets, hats, and sweat all contribute to breakouts. Clean skin and all exercise props before and after workouts.  \nPOREspective offers complimentary online acne analyses and accepts new clients via clinical appointments and virtual FaceTime or phone acne consultations. In-clinic services include: new client consultations, acne treatment, back acne treatment and emergency extractions. POREspective Acne Control kits and other products are available exclusively on the company’s website and at its flagship Austin acne clinic . More information about POREspective, Alissa Chasen and the company’s products and services is available at http://www.porespective.com . \n \nAbout POREspective:\r \nPOREspective is skin care that defies the ineffective one-size-fits-all approach to treating acne. Driven to find an effective alternative to frustrating dermatologist visits and expensive medications that don’t work, POREspective researchers created an easy-to-use home care system that combines a comprehensive line of acne products with proven nutrition and lifestyle modifications to individually treat and clear six unique types of acne commonly seen in teens and adults. POREspective also provides in-person treatments in its Austin-based clinic, offers virtual consultations, and maintains a wealth of free advice and information on its website. \n  \nShare article on social media or email", "source": "PRWeb"}