{"published": "2015-09-15T20:24:18Z", "media-type": "News", "title": "Eight Mexicans confirmed dead in Egyptian military strike on tourist convoy", "id": "e7a7cb64-0ea5-48ea-911c-1616fba3163b", "content": "Mexico's Foreign Affairs Ministry on Tuesday confirmed a total of eight Mexican tourists have died in an Egyptian military airstrike on their convoy.\n\n\"Six more Mexicans have been identified among the fatal victims of the attack perpetrated against a group of tourists Sunday in Egypt,\" the ministry said in a statement.\n\n\"Regrettably it has been confirmed that 8 Mexicans lost their lives in the tragic incident in Egypt,\" President Enrique Pena Nieto announced at the same time via Twitter.\n\nAt least six others were wounded.\n\nReina Torres, director of the ministry's department for protecting nationals abroad, said Monday the wounded were in \"stable\" conditions, and at least one of them would be released from hospital in the coming hours.\n\n\"Several of them suffered burns or have shrapnel from the bombs,\" Torres said in a radio interview.\n\nInitially, two Mexican tourists were confirmed dead in what Egyptian officials described as a case of mistaken identity after military troops and police officers pursuing anti-government guerrillas shelled the four-vehicle convoy from the air.\n\nThe Western Desert, where the incident took place, has traditionally been a tourist attraction for its tall sand dunes and verdant oases. The area is currently a restricted zone off-limits to civilians, but the group's travel agency had secured the necessary permit.\n\n\"It's customary to grant permits for tourist visits\" to the site, Mexico's Foreign Affairs Minister Claudia Ruiz Massieu said at a press conference Monday.\n\nThe strike has also raised questions on targeting the convoy from the air as the passengers had reportedly stopped for a picnic-style meal.\n\nRuiz Massieu flew to Cairo late Monday, accompanied by families of the victims, personnel from the Health Ministry and police forensics experts, local daily La Jornada reported.\n\nSo far, only one of the fatal victims has been identified: Rafael Bejarano Rangel, a musician whose mother Marisela Rangel Davalos, one of the hospitalized, organized the visit to Egypt.\n\nRangel Davalos' sister, Araceli Rangel Davalos, has said similar trips to Egypt had been organized many times before, with the same guide and travel agency, and that there had never been a problem.\n\nFour Egyptians, including guides and drivers, were also killed, and another two wounded, according to a spokesman for Egypt's Interior Ministry, Ayman Helmi.\n\nMexico's government Monday demanded Egypt launch a \"swift and in-depth\" investigation into the accidental strike.\n\nEygpt's embassy in Mexico said the government will establish an \"investigative committee headed by the prime minister himself to resolve the case and publish the results,\" according to Mexico's ministry. Endit", "source": "China.org.cn"}