{"published": "2015-09-22T09:45:00Z", "media-type": "News", "title": "Joe Launchbury expects Wales to be strong despite injuries", "id": "de03c398-3778-4cfb-a4c7-e795234bfc48", "content": "Joe Launchbury points to England's success in Cardiff earlier this year as the reason why he is paying little attention to Wales' injury problems ahead of the pivotal World Cup clash on Saturday. \n \r\n\t\t\r \nWarren Gatland's underdogs have lost star backs Leigh Halfpenny, Jonathan Davies and Rhys Webb to injury for the entire tournament, and Cory Allen has now joined them after a hamstring injury ended his involvement. \n\r  Joe Launchbury knows Wales will still be incredibly tough to beat \r \r \nAdding to the problems facing Gatland are the concerns over props Paul James, Samson Lee and Aaron Jarvis as Wales find their playing resources being stretched to the limit. \n\r\n\t\t\t\r \nLaunchbury, however, recalls when England visited the Millennium Stadium in February while contending with a lengthy casualty list of their own yet still claimed a rousing 21-16 victory. \n\r\n\r\n\r\n\r \n\"It's bit of role reversal because we went to Cardiff in the Six Nations with some injuries and the guys put in a great performance. The shoe is now on the other foot,\" Launchbury said. \n\n\"Wales are coming to an away ground and have a huge opportunity to upset us in the World Cup. \n\n\"From when Warren and Shaun Gatland were at Wasps, I know the sort of messages they will be giving to their players in the week. I am sure they are hugely excited. \n\n\"Warren will be telling them to make a fast start and really try and use their forward pack to get a foothold in the game. \n\r\n\t\t\t\r \n\"They have some nasty injuries which is huge shame and they will miss those players, but others are coming in who are exceptionally talented with a lot of caps behind them.\" \n\nLaunchbury made an impression from the bench in Friday's 35-11 victory over Fiji and is among a number of players pushing hard for a starting place when head coach Stuart Lancaster names his team on Thursday morning. \n\n\"What a huge challenge this will be against a really strong Welsh side. It's important that everyone keeps on pushing because this is a tournament that you are desperate to be involved in. They guys who came off the bench really made a difference against Fiji,\" Launchbury said. \n\n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Wakefield Express"}