{"published": "2015-09-04T13:32:17Z", "media-type": "News", "title": "Spanish volume -50%, first estimate Peru positive", "id": "6a743d10-1871-4917-bc97-81461a562628", "content": "More demand Europe ready-to-eat and fibreless mango Worldwide, the production of mangoes seems to be unable to keep up with demand. More markets are opening up for the tropical fruit, which is expected to push up prices. In addition, the market is rather changeable because of the short seasons for each origin. In Europe, there's a clear preference for the fibreless varieties, with the Keitt and Kent doing particularly well. On the other side of the world, in China, there's a preference for varieties like Big Tai Mango, Small Tai Mango and Aiwen. Both in the United States and in Europe, good prices are achieved. Supplies from Spain are significantly lower this year, due to an 'off year'. Israel profits from this gap, but volumes aren't very big. Peru is expecting better volumes starting in December, but El Niño could still disrupt the harvest.\n\nIsrael has good market in EuropeThe mango season is in full swing, and lasts until mid-October. Different varieties, such as Shelly, Omer, Kent en Keitt, provide European importers with many opportunities for ripening. This year, the volume turns out roughly 40% lower. The season is traditionally difficult from late July until mid-August. When the Keitt and Kent become available on August 20, the market will bounce back.\n\nFor the coming months, Israel expects a good market in Europe, caused by smaller volumes and growing demand. Israel has a smaller harvest due to the winter weather, and Spain is expecting lower volumes, providing Israeli exporters with opportunities. The export volume will increase, by the way, since more growers are offering the products for export. They're also looking at new markets, including the United Kingdom, Russia, South Africa, Canada and East Asia. The country has an acreage of 1600 hectares, with the most important production regions in the Jordan Rift Valley.\n\nBelgium: more demand ready-to-eat and fibreless mangoOne Belgian importer, accounting for about 6500 tonnes of mangoes each year, says that the market is going more and more toward ready-to-eat. The amount of produce sold unripened decreases every year in favour of ripened mangoes. The importer focuses on fibreless mangoes. A challenge which makes the importer consciously ignore the Tommy Atkins from Brazil, which have good availability year-round, but too much fibre in the flesh. The Kent and Keitt make up the top of the mango market. Some years ago, the importer tried importing yellow mangoes from India and Pakistan. Although the fruit can be counted among the top of the market, there was no market for it in Belgium.\n\nSpanish volume decreases by 50%After an exceptionally good year, called an 'on year' in the sector, Spain expects an off year this season, with a decrease in volume by 50%. Last year, the volume surpassed 24,000 tonnes. For the Osteen variety, with a 90% market share in the Spanish acreage, a 50% decrease is expected. For Keitt and Kent, a 15% increase is reckoned with. Growers are expecting high prices again this year. Last year, prices were good already, with 2 euros per kilo for the grower. \"This year, we're expecting comparable or even higher prices,\" a Spanish trader says. And while last year the season began with prices between 6 and 14 euros per box, another trader reckons with prices over 10 euros. The Spanish mango is conquering the European market, with prices comparable to those of flown mangoes.\n\nFrench market limited during summerDuring the summer months, there's a limited market for mangoes. Competition with summer fruit is fierce. With that season ending, the market for mangoes is expected to bounce back in the coming weeks. Toward the end of September, the market reaches a peak. One trader says that the biggest part of the import, 60%, goes to the French market, the remaining volumes are shipped to other European countries. The main countries of origin are Brazil, Peru, Senegal, South Africa and Ivory Coast. \"For both Europe and France, the Keitt and Kent are favourites,\" the importer says. This month, the import flow shifts from Senegal, accounting for 800 of the importer's tonnes, to Brazil, where the importer hopes to import 1200 tonnes.\n\nGermany: Tommy Atkins losing groundIn the past three years, demand for ripened, fibreless mangoes has increased sharply in Germany as well. The Tommy Atkins are losing ground in this market to the Kent, Keitt and Palmer. Main suppliers are currently Puerto Rico and Brazil. The Senegalese season is nearly over, and soon the start of the season is expected from Israel and Spain. The German consumer prefers the sizes 7, 8 and 9, which are abundantly available. Demand is highest between October and June.\n\nLatin AmericaBrazil and Peru are the main export countries for the Kent and Keitt varieties. Brazil enters the market with these varieties between October and January, while the Palmer is available virtually year-round. Peru is strong between January and March, mainly with Kent.\n\nGuatemala: first mangoes to Spain and GermanyIn Latin American Guatemala, eight companies are currently exporting mangoes. 2.9% of the production goes to the American market, about 10% is destined for the European market. This year, the first mangoes were flown to Germany and Spain. The export to these countries is expected to increase next year. At government level, the government is working on opening up the Chilean market. \"We think there's an opportunity, because the season doesn't overlap with Peru, Ecuador and Brazil, countries that can export to Chile. Our season runs from March until May,\" an exporter says. All in all, the acreage numbers roughly 6000 hectares. 5,000 of those hectares are planted with Tommy Atkins. The other hectares are divided up among Ataulfo (500 ha), Kent (300 ha) and Keitt (200).\n\nPeru: better season expectedThe mango cultivation is an important employer for many Peruvians. The cultivation covers about 27,000 hectares across 14,000 growers. Especially in the regions of Piura, Lambayeque and Ancash, many of the inhabitants depend on the cultivation of mangoes. The 2013-2014 season (December to March) had a good harvest, this year the harvest will turn out lower. The export in the 2014-2015 season amounted to 130,000 tonnes, 104,000 (80%) of which fresh, and 18,000 tonnes (14%) frozen. The remaining tonnes were processed in juices or dried. For the upcoming season, a good production is expected, although El Niño can still impact the production. At the end of October, more will be known about the expected volumes.\n\nMain markets are the Netherlands, accounting for 37.08%, followed by the United States (34.02%) and England (11.94%). The biggest competitor at the start of the season is Ecuador, although one Peruvian exporter believes the countries also complement each other. For the European market, Brazil is the biggest competitor, particularly because African countries haven't gained a foothold yet, the exporter says.\n\nUnited States: good prices for small sizesOn the West Coast, demand for small sizes is particularly high. Not good for trade, because most traders have large calibres of Keitts available. These mangoes are imported from Mexico. Brazilian mangoes are finding their way to the East Coast, where demand is higher. Reason is the low supplies, with the Mexican season nearing its end and Brazil not having spikes in volume yet. When supplies from Ecuador, generally at the end of October, get going later than usual, the prices will still remain high for a while. On average, a box of mangoes from Brazil yields between 9 and 10 dollars.\n\nChinese demand peaks around Spring FestivalTaiwan and Thailand are the biggest suppliers of mangoes to China. These countries export the highest volume, especially of the Aiwen and Golden varieties. The import season generally runs from June until August. For the top segment, however, the Chinese importers are looking to Australia. The peak of the Australian import is in February, coinciding with the Chinese Spring Festival, pushing up prices.\n\nIn addition to import, the country also has its own cultivation. After India, China is the biggest producer of mangoes in the world. Major cultivation regions are Guangxi and Hainan. The season in Hainan starts in April, with the mangoes of the Big Tai Mango and Small Tai Mango varieties competing with the import from Australia and Taiwan for quality, but they are cheaper. In Guangxi, the most produced variety is the Guiqi mango.\n\nThe mango is a popular fruit in China, and domestic cultivation is on the rise, with regions like Huaping, in the province of Yunnan, having invested in cultivation. At the moment, about 6500 small growers are planting. In 2020, the region wants to have increased the acreage to 20,000 hectares, with a yield of 300,000 tonnes. The mangoes from the region are less popular than the fruit from Hainan and Guangxi, however.\n\nAustralia exports to ChinaSince 2004, Australia has had access to the Chinese market. China mostly imports the top segment from the country. The most popular variety for export to China is the Bowen.\n\nThe biggest news is just that there will be a split crop for the Northern Territory - additional flowering will mean trees get picked twice. Exports still expected to increase to 20%, and harvest to kick off by mid November. Every week, FreshPlaza publishes an overview of the market situation of a product in a worldwide context. With these articles, we're aiming to give an idea of a global market that's becoming ever smaller as a result of globalization. Next week, the spotlight is on mandarins.", "source": "Fresh Plaza"}