{"published": "2015-09-22T16:20:08Z", "media-type": "News", "title": "LANDMARK, A HALLIBURTON BUSINESS LINE (NYSE : HAL) and Palantir Solutions Form a Strategic Alliance", "id": "c876ed58-f31f-48d0-967c-7f7944f24d8c", "content": "CALGARY, Sept. 22, 2015 /CNW/ - \"Landmark, a Halliburton (NYSE:HAL) business line and a leading provider of software for the upstream oil and gas industry, and Palantir Solutions, a leading provider of asset and corporate-level scenario planning software, have formed an alliance to develop a fully integrated economics, planning and decision support framework. The joint solutions will be aimed at helping exploration and production organizations respond more effectively to changes in technical data and market conditions. This responsiveness, in the face of uncertainty, will help enable companies to more effectively manage economic risk and increase the returns on their portfolio of investments. \n \nThe current market outlook for the oil and gas industry indicates the need for a more efficient decision support system to improve petroleum investment lifecycle management. Connecting Landmark's DecisionSpace® software directly to the Palantir PlanningSpace(TM) will create end-to-end petro technical and economic workflows. Operators will be able to continuously calibrate surface and subsurface risks with economics to implement planning workflows that are integrated, collaborative and dynamic. \n \nLandmark's VP, Nagaraj Srinivasan states: \"To meet the requirements of a dynamic supply, demand and pricing environment in a global setting, world class organizations need next generation systems for a near-real time view of their business and to achieve strategic cost management objectives. The joint solution from Landmark and Palantir allows customers to manage costs, reserves and optimize their portfolio and investment decisions therefore driving overall business performance.\" \n \nPalantir's MD, Jason Ambrose adds:  \"Palantir and Landmark have started this alliance by bringing integrated reserves, capital budget and financial forecasting solutions to market.  The speed at which we were able to jointly develop these products is a testament to how complementary our technology platforms are.  Together, we will be able to provide our clients with innovative, 'cloud ready' solutions that can be rapidly deployed to create investment lifecycle planning workflows that are responsive, repeatable and reliable.\" \n \nSOURCE  Palantir Solutions", "source": "4 Traders"}