{"published": "2015-09-15T12:11:31Z", "media-type": "News", "title": "De-mystifying stop smoking services", "id": "741b6506-d0ac-45f0-9f1f-dff6a123b6d2", "content": "Melanie Powell hasn't had a cigarette since 2012. Credit: Melanie Powell \nFACT: Support from Stop Smoking Services, when used with prescription medications, such as nicotine replacement therapies (NRT), roughly triples your chances of successfully quitting smoking, in comparison to trying to go it alone. \n \nFACT: Over half of those who used a Stop Smoking Service last year successfully quit, when followed up four weeks later. \n\r \nFACT: Stop Smoking Services are free and give non-judgmental support in person, on the phone and online. \n\r \nBut evidence suggests that some people are still reluctant to visit their local Stop Smoking Services and this may be because of misconceptions about what it's going to be like. \n\r \nSo to try and dispel some of the uncertainties, with the help of Smokefree South West, we spoke to someone who successfully quit smoking with their local Stop Smoking Service, to find out what they're really all about. \n\r \nMeet Melanie Powell, a mother of two from Wiltshire, who started smoking when she was 15 and continued to do so for nearly 20 years. She used to smoke 20 cigarettes a day and, while she tried to quit a few times on her own using various forms of nicotine replacement , she kept relapsing. \n\r \n\"I tried all the things – patches, lozenges – but nothing helped me,\" she remembers. \n\r \nBut one day, three years ago, the financial burden of buying a pack of cigarettes a day finally made her decide \"that's it!\" \n\r \nAnd so, after seeing the local Stop Smoking Service posters in her doctor's surgery and an extra nudge of a recommendation from her GP, Melanie marched herself over to her local clinic. \n\r \n\"It was really nice,\" she says, \"It was held at our local hall and it's just a walk-in clinic so you don't have to sit in a group or in a circle and say 'oh yeah my name is Mel and I'm a smoker'. And it's a walk-in session, so you can go whenever you want.\" \n\r     Melanie took up running to distract herself from the cravings. Now she runs half marathons. \nSo what actually happened at the clinic? \n\r \n\"They have two very approachable ladies there, and I went in and saw one of them. I explained that I wanted to stop smoking , and she asked what I would prefer to use, instead of them telling me what they thought was best\". \n\r \nStop Smoking Services offer a variety of options to help you quit and keep yourself on track, including prescription medication like NRTs and Champix, free carbon monoxide testing to monitor your progress, and weekly support and advice. You can find out about your local service here . \n\r \nAfter her previous attempts, Melanie wanted something that was nicotine-free and didn't mimic the action of smoking. So she decided to try a 12-week course of Champix – a prescription drug that can help people quit by blocking nicotine receptors in the brain and reducing withdrawal symptoms including minimising or removing cravings. \n\r \nAs well as taking the medication every day, she would get extra support by seeing her local Stop Smoking Service advisor every other week. \n\r \n\"The staff were very supportive. If you wanted a cigarette, you could call them and talk about why you wanted a cigarette, although I didn't do that.\" \n\r \n\"I couldn't have done it without their support, and the support of my family,\" she says. \n\r \nMelanie hasn't had a cigarette since April 2012, and still pops in to her local centre from time to time, and has the following to say to those who may still be apprehensive. \n\r \n\"Go and try it! If you haven't tried it, then you don't know. But definitely definitely go with an open mind.\" \n\r \nAs well as being three years smoke-free, Melanie – who used to get out of breath running up a flight of stairs – now runs half marathons – something she initially took up to distract her from her cravings. \n\r \n\"I've run three so far, and I'm going to run two more in September,\" she says. \n\r \n\"Now I've stopped smoking, I'd never go back. I've worked so hard to give up.\" \n\n  Explore further:  E-cigarettes can help smokers to quit, new research shows  \n  \n Provided by:  Cancer Research UK", "source": "Medical Xpress"}