{"published": "2015-09-24T14:05:21Z", "media-type": "News", "title": "VW European Cars Affected By Emissions Evading Software", "id": "a22f4513-3cd7-4634-a0dd-94cf00a313cc", "content": "Endeavour International Corp. (USOTC:ENDRQ) \nIntraday Stock Chart  \nToday : Thursday 24 September 2015 \n  \nBERLIN—Volkswagen AG has told the German government that some of its European-sold diesel passenger cars are affected by software that evaded emissions-testing standards in the U.S. \n \nAfter Volkswagen said earlier this week that the software was installed on some 11 million cars world-wide, it had long been expected that the auto maker's home market in Western Europe would also be affected. But Thursday's disclosure underscores the logistical challenges faced by Volkswagen, as well as governments, regulators, dealers and car buyers on both sides of the Atlantic, in sorting out which cars are affected and what can be done about it. \n \n\"We have been informed that there are also 1.6- and 2-liter diesel cars that are affected in Europe,\" Germany's Transport Minister Alexander Dobrindt told journalists in Berlin. \"We will continue to work intensively with Volkswagen to find out which vehicles are affected,\" he said. \n \nMr. Dobrindt said the ministry didn't yet have specific numbers for Europe, but that should be clarified in the \"coming days\" as the ministry continues to work closely with Volkswagen. Mr. Dobrindt said the government would wait until it had defined the scope of any damages with Volkswagen to decide on possible consequences for those cars where manipulation was detected. \n \nUnderscoring the new jitters across the global auto industry amid the Volkswagen scandal, investors also dumped shares of BMW AG early Thursday after a report by a local auto magazine that a road test of one of its diesel-powered sport-utility vehicles showed higher emissions than in laboratory testing. BMW said it wasn't familiar with the specific test but that many of its diesel models had been tested satisfactorily both on the road and in the lab. \n \nVolkswagen has disclosed that as many as 11 million cars world-wide contained software alleged by the U.S. Environmental Protection Agency to have allowed Volkswagen cars to pass emissions lab tests, despite much higher emissions in real-world driving. The EPA could force Volkswagen to recall almost 500,000 U.S.-made cars because of the software. \n \nVolkswagen has apologized and said it is working to identify affected cars and fix the problem. It has set aside €6.5 billion ($7.27 billion) to deal with liability and other costs stemming from the software issue. Volkswagen on Thursday declined to comment further on the German disclosure, beyond its previous statements about the number of cars affected world-wide. \n \nWestern Europe is Volkswagen's most important market. The company's market share in the region approaches 25% for light vehicle sales, compared with less than 5% in North America. That share has been growing quickly in Europe and Asia, while stalling in North America. \n \nIt is still far from clear whether the software identified by the EPA helped cars in Europe beat emissions tests. Analysts say that because of Europe's much-looser rules on diesel emissions like nitrogen oxide, diesel engines that might fail U.S. emissions standards could still pass European Union rules. \n \nStill, it further complicates Volkswagen's challenge in sorting out which cars are affected and which ones may fall afoul of government regulations. Once that is determined, executives will face the more challenging questions of whether the cars can be fixed in a recall, or whether owners and dealers may need to be compensated in other ways. Some European governments, meanwhile, have provided subsidies for so-called clean diesel cars, and they may seek to claw back funds if Volkswagen cars weren't as clean as advertised. \n \nMr. Dobrindt said the transport ministry is also investigating vehicles of other car makers as part of the probe into the Volkswagen scandal. He didn't name companies being investigated. \n \nMeanwhile, BMW shares fell more than 8% early Thursday, after magazine Auto Bild reported one of the German car maker's model's emissions on the street were much higher than allowed in Europe under standardized testing conditions. \n \nEnvironmental groups have in the past reported on discrepancies in emissions levels between test performance and road performance, but the issue has become much more sensitive to investors and car buyers in the wake of last week's EPA accusations against Volkswagen. \n \nAuto Bild, said Thursday in a pre-release of an article to be published later this week that BMW's X3 xDrive 20d SUV, powered by a diesel engine, emitted more than 11 times more nitrogen oxide than permitted by the European Union under standardized conditions. The magazine said the results came through a street test conducted by the International Council on Clean Transportation, a nonprofit research organization. \n \nBMW said Thursday it hadn't manipulated test results. \"At the BMW group, there are no specific activities or technical provisions which influence the emissions recorded during the test mode,\" said a spokesman. The company's exhaust treatment systems are active whether on the test bench or on the road, he added. \n \nBMW also said that two studies carried out by the ICCT had shown that the BMW X5 and 13 other BMW models complied with the legal requirements concerning nitrogen oxide emissions. \"We are not familiar with the test mentioned by Auto Bild concerning the emissions of a BMW X3 during a road test,\" BMW said in a statement. \"No specific details of the test have yet been provided and therefore we cannot explain these results. We will contact the ICCT and ask for clarification of the test they carried out.\" \n \nRepresentative of the ICCT weren't immediately available for comment. \n \nThe new report comes after BMW received an early reputational boost amid the Volkswagen scandal. Researchers at West Virginia University, who led some of the research that focused U.S. regulatory scrutiny on Volkswagen in the first place, compared BMW and Volkswagen diesel models in road tests in California. In those tests, emissions from a BMW X5 SUV matched or came in under what the vehicle produced in laboratory tests, the researchers said they found. But two Volkswagen models, a Jetta and a Passat, far exceeded emissions levels from lab testing. \n \nWilliam Boston and Costas Paris contributed to this article. \n \nWrite to Ruth Bender at  Ruth.Bender@wsj.com and Friedrich Geiger at  friedrich.geiger@wsj.com \n   \nAccess Investor Kit for \"BMW AG\" \n \nVisit http://www.companyspotlight.com/partner?cp_code=P479&isin=DE0005190003 \n \nAccess Investor Kit for \"Volkswagen AG\" \n \nVisit http://www.companyspotlight.com/partner?cp_code=P479&isin=DE0007664039 \n \nSubscribe to WSJ: http://online.wsj.com?mod=djnwires \n   \n(END) Dow Jones Newswires \n \nSeptember 24, 2015 09:45 ET (13:45 GMT) \nCopyright (c) 2015 Dow Jones & Company, Inc.", "source": "ADVFN India"}