{"published": "2015-09-18T01:00:00Z", "media-type": "News", "title": "Selena Gomez Gives Her Fans a Big Surprise at Mysterious Event for Her Upcoming Album", "id": "b7cf4caf-d739-48c0-9e0c-183e945476ae", "content": "By @chiumelo  \n 09/17/2015 AT 09:00 PM EDT  \n Super fans of Selena Gomez got the treat of a lifetime Wednesday night at the singer's mysterious Revival event in Los Angeles. \nHeld at The Palace Theatre downtown, Gomez kicked off the event by giving her audience of 800 what they thought was a first-look at her music video for her new single \"Same Old Love.\"\r \n \nThe video had a movie-quality feel and featured the star walking through the streets watching various couples before being rushed on stage to perform – then cut off just as she was about to take the mic. \r \n\nBut back at the Palace Theatre, the curtains lifted and Gomez finished off the song live for her fans wearing the same black dress in her video before giving her fans one exciting surprise: they are all going to be featured as audience members in her new music video when it's released. \r \n\n\"This is a new chapter for me,\" Gomez told screaming fans about taking on new management and signing with her new record label Interscope. \"I'm sure most of you know that. You guys have been the most consistent thing in my life and my career. This is all for you.\"\r \n\nThe star was exuberant on stage and chatted casually with the crowd about her \"most incredibly personal record\" yet before launching into her summer hit \"Good for You.\"\r \n\n#goodforyou  #REVIVALevent  @selenagomez  pic.twitter.com/FBCLhphyCg \n— Melody Chiu (@chiumelo) September 17, 2015  \nRevealing that it took her a full year to write her upcoming album (out Oct. 9), Gomez also gave her fans a sneak peek at her title track \"Revival,\" which featured lyrics like \"No more hiding / The light inside me is bursting / It's my time to butterfly / This is my revival.\"\r \n\nAfterwards, the star took a (massive) group photo with all her fans before giving a full performance of \"Same Old Love.\"\r \n\nLater in the evening, the singer, 23, mingled at a private cocktail reception before meeting every single fan who was invited to the event, where she chatted, posed for silly selfies and gave out hugs.", "source": "People"}