{"published": "2015-09-10T08:43:32Z", "media-type": "News", "title": "Disabled cycling enthusiast wins chance to watch Tour of Britain thanks to sister", "id": "d3607330-975e-4a88-884c-e872feef4bfd", "content": "A DISABLED cycling enthusiast won the chance to clap eyes on his heroes after his sister secretly entered him into a competition. \n \nJames Quinn, 21, secured VIP tickets to watch the Tour of Britain finish on Monday in Colne thanks to his sister, 11-year-old Alana, who wanted his 'dream to come true'. \n \nOnce a keen bike rider himself, the former Dallam School, Milnthorpe, pupil suffers from a rare condition called rapid onset dystonia-parkinsonism which left him wheelchair bound around two years ago. \n \nIn an effort to surprise her brother, Alana nominated him in the Chain Reaction Cycles prize draw in The Westmorland Gazette. \n \nShe wrote: \"My brother James has to be the bravest person ever! He still loves to watch any cycling programme on TV and adores the Tour of Britain. \n \n\"If he got the once-in-a-life chance to see it, it would be a dream come true!\" \n \nAfter the event, James told the Gazette: \"Being in VIP was great fun. The atmosphere was euphoric. I don't think I've ever seen so many people cheering so loud since the Olympic torch relay. As a lifelong cycling fan, I'm not going to forget this day.\" \n \nHis mum Caroline, 46, of Bolton-le Sands, said: \"We didn't expect to win so we were so pleased. \n \n\"James was over the moon and thrilled about seeing Bradley Wiggins and Mark Cavendish.\" \n \nJames, his brother Kieron, 18, and their dad Paul, 46, who works at Heysham Power Station, made the trip to the Colne leg of the Tour de Britain on Monday to watch the race. \n \n\"We're a cycling family and James' grandparents have a bike shop (Dyno Start, in Carnforth) where he works on a Saturday,\" added Mrs Quinn. \"He was always keen from a young age and always had different bikes. \n \n\"He would like nothing better that to go off on a bike ride but he can't do that now.\" \n   \n Share article  \n   \nJames, who is set to embark upon an Open University course this year, started to lose the strength in his legs aged 16 and steadily lost his mobility over an 18-month period. \n \n\"He lost the muscles in his mouth and face so he is unable to hold a conversation although he talks to us in the family,\" added Mrs Quinn. \"We were devastated as a family but he's a great lad and he's always smiling. He's a tough one.\"", "source": "Messenger Newspapers"}