{"published": "2015-09-09T15:08:29Z", "media-type": "News", "title": "Celebrate Our Waters in Orleans includes Pochet Island Tour", "id": "dc7a59d4-7cba-4ac9-8a91-7a84c5b33b3e", "content": "When Cape Cod National Seashore was on the cusp of creation, officials reached out to the Paysons, ardent supporters of the park. They said they wanted to build a comfort station on Pochet Island, which the family had owned for centuries. “Over our dead bodies,” Erica Parra, a member of the family, recalled them saying. “But let’s work something out.” What the family decided was to keep the middle of the island - although they promised not to build new structures there –and they gave the federal government the rest. And they put up signs, which are still up, that welcome everyone to the island. “The family feels very strongly you should share,” Parra said. “Loads of people come out and use the island.” And that sentiment fits right in with the mission of Celebrate Our Waters, a weekend sponsored by the Orleans Pond Coalition that educates and showcases the town’s watery wealth. “When I joined the OPC Board, I knew, there were many special places in Orleans that were unknown to me. But I did know Pochet Island, and I knew many people in Orleans did not,” said Fran McClennen. “In creating the Celebrate our Waters weekend, one of the goals always has been to offer opportunities for people to experience many special places on and around our ponds and estuaries. The assumption behind Celebrate our Waters is that if people can experience and appreciate the special places we have here in Orleans, they will want to preserve and care for them.” For the first time in the weekend’s six-year history a tour of Pochet will be among the free 50 or so water-related events offered across the town, Sept. 18 through Sunday, Sept. 20. “From the beginning of Celebrate our Waters, I have wanted to find a way for people to experience Pochet Island. Not only is it extraordinarily beautiful but it illustrates how a family who owned and cared for this island made it available for others to enjoy – forever,” McClennen said. In the past, it was difficult to find a way out to the island as it is a bit isolated, but this year the pond coalition is working with Orleans Conservation Trust and the Payson family to offer a tour that melds ecology and history. The Pochet Island walk (reservations are required) is scheduled for Sunday at 9 a.m. and it’s not for the faint-hearted. It’s approximately 5 miles round trip, often through loose sand and changing topography. If folks want to go they should pack a lunch and plenty of water, and bring an extra pair of socks in case their feet get wet while reaching the island from Nauset Beach. Page 2 of 2 - The beginning of the walk, past the dunes, will be led by Kris Ramsey, former director of the Orleans Conservation Trust, and will focus on the natural world and all the species that call the narrow barrier beach home. The second leg of the journey will be on the 8-square-mile island and will be led by a member of the Payson family. Samuel Russell Payson, Parra’s great great grandpa, bought the island- as well as Hog, Sampson, Little Pochet and the tip of Barley Neck,for $3500 in 1885. One of the houses on the island is even older than that. It was built in 1680 and floated from Chatham in 1730. “You can still see traces of how they got it up the bank,” said Parra. Parra said Samuel Payson built another house in 1886 because his wife wanted a “decent” house. Pigs had been kept in the old one. “So that was why the new house was built,” she said. “Because she didn’t like sleeping where the pigs had been sleeping.” In addition to the historic homes, and the wealth of stories behind them, there are buildings, such as the rough house, that are linked to the history of the town as a whole. The rough house was once on Nauset Beach where it used to protect those who were shipwrecked, and one of the original Life Saving Stations was on Little Pochet – an island the Paysons gave to the town. Although Orleans, and the Cape has changed, the island has stayed much as it was hundreds of years ago. Parra chuckled at the memory of one family member suggesting to the others (there are more than a 100 relatives) that they really should build a golf course on the island. “You could hear the explosion,” she said with a laugh.    ", "source": "Wicked Local Chatham"}