{"published": "2015-09-13T15:32:46Z", "media-type": "Blog", "title": "Happy New Year! Free Rosh Hashanah Printable Card", "id": "b840e605-3e9b-4aca-87e5-0cab014932f0", "content": "Share !tweet\nMost Christians don’t know about the Fall Holidays of ancient Israel; Trumpets (Rosh Hashanah), Day of Atonement (Yom Kippur), and Tabernacles (Sukkoth). If the spring festivals so clearly prophesied the first coming of Messiah, it stands to reason that the fall festivals are also prophetic of His second coming. The way these holidays are celebrated reveals specific information of the way they will be prophetically fulfilled.\n2105 Fall Holiday DatesRosh Hashanah or New Year: Sept 14-15, 2015Yom Kippur or Day of Atonement Sept 23, 2015Sukkot or Feast of Tabernacles Sept 28- Oct 4, 2015Rosh Hashana Overview\nThe Feast of Trumpets (Rosh Hashanah) was celebrated at the beginning of the month Tishri, the first month of the civil year. It was one of the seven days of holy convocation. Tishri is the seventh month of the Biblical calendar, and as such parallels the Sabbath as a special and holy time to seek God. The previous month of Elul is the time of preparation just as Friday is the Day of Preparation for Shabbat. This season is a time of reflection, contemplation, and putting things in order and getting right our relationship with God.\nGod named the other holidays, Sabbath, Passover, Day of Atonement, etc.; however, this holiday has no name. It’s simply referred to as Yom Teruah (the day of the sounding of the shofar), so it became known as the Feast of Trumpets, a special day calling attention to the coming holy day—the Day of Atonement (Yom Kippur). A shofar (ram’s horn) is blown during the Feast of Trumpets service.\nLeviticus 23 calls the blowing of trumpets a memorial but does not say what it is a memorial of. Many believe it is a memorial of God’s grace to Abraham when He substituted a ram to be sacrificed instead of Isaac (Gen. 22). It is also regarded by both Jews and Christians as a memorial of the creation of the world, at which the sons of God shouted for joy (Job 38:7). This holiday was the new year’s day, on which the people rejoiced in a grateful remembrance of God’s benefits and implored His blessing for the future year.\nThe Feast of Trumpets and Day of Atonement (Yom Kippur) are the holiest days of the Jewish year. These ten days are called the Days of Awe or High Holy Days. Unlike other holy days, they do not celebrate a season or historical event. This season is a time for looking inward to spiritual growth. The themes surrounding this holiday include:Jewish New Year (Rosh Hashanah literally is “Head or beginning of the year.”)God’s Royalty (Coronation Day)Day of JudgmentRemembrance (Yom Ha-Zikaron, the day of remembrance)Birthday of the worldNew Year\nThe Feast of Trumpets is the Jewish New Year. There is little resemblance between the Feast of Trumpets, one of the holiest days of the year, and a typical New Year’s Eve midnight drinking party. It is a celebration of the earth’s physical birthday on Tishri 1, the seventh month of the religious calendar, the first month of the civil calendar. It is the first of the fall holidays and usually occurs in September.\nJudaism has several different new years. This is similar to the calendar year starting in January, the new school year starting in September, and many businesses starting fiscal years in July and September. In Judaism, Nisan 1 is the new year for the purpose of counting the reign of kings and months on the calendar. Regardless when the king became ruler, the coronation was on Tishri 1. Elul 1 (in August) is the new year for the tithing of animals. Shevat 15 (in February) is the new year for trees (determining when first fruits can be eaten, etc.), and Tishri 1, the Feast of Trumpets (Rosh Hashanah) is the new year for years.Coronation Day\nAnother theme of this holiday is God’s royalty. The Jewish liturgical tradition has preserved tunes for many of the prayers that aptly accompany what the Chassidim called “Coronation Day.” The shofar, in this light, announces God’s Kingship: With trumpets and sound of cornet [shofar] make a joyful noise before the LORD, the King (Ps. 98:6).\nThrough repentance we become God’s subjects. It is said that the day that God manifests His Royalty, the day He created His world, is also naturally the day He sits in judgment. Coronation Day is a joyous day and world celebration.\nJudgment Day\nThe history of the Feast of Trumpets as a “Day of Judgment” is from the legend that God sits in judgment between the New Year and the Day of Atonement over mankind to determine fates for the coming year.\nThis symbolism is drawn upon to great effect by the authors of the liturgical poems written to heighten the prayers of the season. The sages say that destiny — whether financial, physical, or other– is pre-ordained on one day each year for the entire duration of that year (Talmud Rosh Hashanah).\nIt is said that on this day God has three books that are opened. Those who have returned to God are written in the Book of Righteousness. All other people are divided into two groups. The first is the wholly wicked whose names are written in the Book of the Wholly Wicked. The other group are considered intermediates. They are people who have not been judged and have ten more days to repent. If they repent by the Day of Atonement their names will be written in the Book of Righteousness. Hosea 14:1-9 expresses this theme.\nThe sages of the Jerusalem Talmud (Rosh Hashanah 1:3) say, “Normally, someone standing in judgment would dress somberly, cloaking himself in black robes and not trim his beard. After all, he does not know how it will turn out. Israel is different, though. We dress in white and cloak ourselves in white and trim our beards and eat and drink and are joyous for we know that God will do miracles for us. Being judged by God is at once an awesome thing — He knows all — but He is a merciful God. Even judgment itself need not be devoid of joy (Talmud Rosh Hashanah 1:3).Remembrance\nThe theme of “remembered” is thought to be from God remembering Sarah and Hannah. A Talmudic dictum (Rosh Hashanah 10b) says that on Yom Teruah, Sarah, Rachel, and Hannah were “remembered.”Birthday of the World\nJewish tradition believes this day is the birthday of the world because the first part of Genesis, Bereishit, “in the beginning,” when changed around, read Aleph b’ Tishri, or “on the first of Tishri.” Therefore the Feast Of Trumpets is known as the birthday of the world (Adapted Chumney 1994).\nThe Shofar\nThe shofar has always had a special place for the Hebrew people. Trumpets were of a great variety of forms, and were made of diverse materials. Some were made of silver (Num. 10:2) and were used only by the priests in announcing the approach of festivals and in giving signals of war. Some were also made of rams’ horns (Josh. 6:8). They were blown at special festivals, and to herald the arrival of special seasons (Lev. 23:24; 25:9, 1 Chron. 15:24, 2 Chron. 29:27, Ps. 81:3 98:6). Trumpets are among the symbols used in the Book of Revelation (Rev. 1:10 8:2) (Bushnell 1995).\nSpecific uses for the shofar:It was sounded to bring Moses to the top of the mountain to receive the Commandments. And when the voice of the trumpet sounded long, and waxed louder and louder, Moses spake, and God answered him by a voice. And the LORD came down upon mount Sinai, on the top of the mount: and the LORD called Moses up to the top of the mount; and Moses went up (Ex. 19:19-20).It was a signal during time of war. And it came to pass, when he was come, that he blew a trumpet in the mountain of Ephraim, and the children of Israel went down with him from the mount, and he before them (Judges 3:27).It was blown at the start of the Jubilee year. Then shalt thou cause the trumpet of the jubilee to sound on the tenth day of the seventh month, in the day of atonement shall ye make the trumpet sound throughout all your land (Lev. 25:9).It was blown during coronation services of a new King. And let Zadok the priest and Nathan the prophet anoint him there king over Israel: and blow ye with the trumpet, and say, God save king Solomon (1 Kings 1:34).It is a sign of the regathering of dispersed Israel. And it shall come to pass in that day, that the great trumpet shall be blown, and they shall come which were ready to perish in the land of Assyria, and the outcasts in the land of Egypt, and shall worship the LORD in the holy mount at Jerusalem (Isa. 27:13).\n* It was sounded as a warning of danger. Shall a trumpet be blown in the city, and the people not be afraid… (Amos 3:6).\n* And the greatest anticipation of all is the day of the arrival of the Messiah. And the LORD shall be seen over them, and his arrow shall go forth as the lightning: and the Lord GOD shall blow the trumpet, and shall go with whirlwinds of the south (Zech. 9:14).\nRelated", "source": "Heart of Wisdom Blog"}