{"published": "2015-09-08T10:43:00Z", "media-type": "News", "title": "Media General, Meredith To Combine To Create Meredith Media General: A New Powerful Multiplatform And Diversified Media Company", "id": "073bd2d5-a29f-4030-9399-c6784bb38dac", "content": "SOURCE Meredith Corporation\n\nRICHMOND, Va. \n\nFINANCIAL HIGHLIGHTS:\n\nSTRATEGIC RATIONALE:\n\nMedia General, Inc. (NYSE: MEG; www.mediageneral.com) and Meredith Corporation (NYSE: MDP; www.meredith.com) announced today a definitive merger agreement under which Media General will acquire all of the outstanding common stock of Meredith in a cash and stock transaction currently valued at approximately $2.4 billion \n\nUnder the terms of the agreement, Meredith shareholders will receive cash and stock valued at $51.53 \n\nMedia General has formed a new holding company, which after closing will be named Meredith Media General. Media General shareholders will receive one share of the new holding company for each share of Media General they own upon closing. Meredith shareholders will receive $34.57 \n\nUpon the closing, the Board of Directors will consist of 12 directors, eight appointed by Media General and four appointed by Meredith. J. Stewart Bryan III \n\nStephen M. Lacy \n\nMeredith Media General will be well positioned to grow in a rapidly consolidating and evolving media industry. It will use its strong financial profile to deliver substantial value to shareholders, customers and employees. This financial profile includes:\n\nMedia General Chairman J. Stewart Bryan III \n\nMeredith CEO Steve Lacy \n\nMeredith Media General will boast a portfolio of best-in-class media platforms including:\n\nAPPROVALS AND TIME TO CLOSE\n\nThe transaction has been approved by the Boards of Directors of Media General and Meredith. The transaction is subject to approval of Media General and Meredith shareholders as well as customary closing conditions and regulatory approvals, including approval by the Federal Communications Commission and clearance under the Hart-Scott-Rodino Antitrust Improvements Act. The transaction is expected to close by June 30, 2016 \n\nD. Mell Meredith Frazier \n\nFINANCING \n\nRBC Capital Markets and JPMorgan Chase Bank, N.A. have committed $2.8 billion \n\nADVISORS\n\nRBC Capital Markets is serving as exclusive financial advisor; and Fried, Frank, Harris, Shriver & Jacobson LLP is serving as legal advisor to Media General. BDT & Company and Moelis & Company are providing financial advice, and McDermott Will \n\nINVESTOR CONFERENCE CALL\n\nMedia General and Meredith will hold a joint conference call with investors to discuss this announcement today at 8:30 a.m. Eastern Daylight Time \n\nABOUT MEDIA GENERAL\n\nMedia General is one of the nation's largest connected-screen media companies that operates or services 71 television stations in 48 markets, along with the industry's leading digital media business. Its robust portfolio of broadcast, digital and mobile products informs and engages 23 percent of U.S. TV households and more than two-thirds of the U.S. Internet audience. Media General has one of the industry's largest and most diverse digital media businesses that includes LIN Mobile \n\nABOUT MEREDITH\n\nMeredith Corporation has been committed to service journalism for more than 110 years. Today, Meredith uses multiple distribution platforms – including broadcast television, print, digital, mobile and video – to provide consumers with content they desire and to deliver the messages of its advertising and marketing partners.\n\nMeredith's Local Media Group includes 17 owned or operated television stations reaching 11 percent of U.S. households. Meredith's portfolio is concentrated in large, fast-growing markets, with seven stations in the nation's Top 25 – including Atlanta \n\nMeredith's National Media Group reaches 100 million unduplicated women every month, including 60 percent of American millennial women. Meredith is the leader in creating and distributing content across platforms in key consumer interest areas such as food, home, parenting and health through well-known brands such as Better Homes and Gardens, Allrecipes, Parents and Shape. Meredith also features robust brand licensing activities, including more than 3,000 SKUs of branded products at 4,000 Walmart stores across the U.S. Meredith Xcelerated Marketing is a leader at developing and delivering custom content and customer relationship marketing programs for many of the world's top brands, including Kraft, Lowe's and NBC Universal. For more information, visit www.meredith.com.\n\nNO OFFER OR SOLICITATION\n\nThis communication is for informational purposes only and is neither an offer to purchase, nor a solicitation of an offer to sell, any securities or the solicitation of any vote in any jurisdiction pursuant to the proposed transactions or otherwise, nor shall there be any sale, issuance or transfer of securities in any jurisdiction in contravention of applicable law. No offer of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the Securities Act of 1933, as amended.\n\nADDITIONAL INFORMATION AND WHERE TO FIND IT \n\nThis communication is not a solicitation of a proxy from any shareholder of Media General, Inc. (\"Media General\") or Meredith Corporation (\"Meredith\"). In connection with the Agreement and Plan of Merger by and among Media General, Montage New Holdco, Inc. (to be renamed Meredith Media General Corporation after closing) (\"Meredith Media General\"), Meredith and the other parties thereto (the \"Merger\"), Media General, Meredith Media General and Meredith intend to file relevant materials with the Securities and Exchange Commission (\"SEC\"), including a Registration Statement on Form S-4 filed by Meredith Media General that will contain a joint proxy statement/prospectus. INVESTORS AND SECURITY HOLDERS ARE URGED TO READ THESE MATERIALS WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION ABOUT MEDIA GENERAL, MEREDITH, MEREDITH MEDIA GENERAL AND THE MERGER. The Form S-4, including the joint proxy statement/prospectus, and other relevant materials (when they become available), and any other documents filed by Media General, Meredith and Meredith Media General with the SEC, may be obtained free of charge at the SEC's web site at www.sec.gov. The documents filed by Media General and Meredith Media General may also be obtained for free from Media General's Investor Relations web site (http://www.mediageneral.com/investor/index.htm) or by directing a request to Media General's Investor Relations contact, Courtney Guertin \n\nPARTICIPANTS IN THE SOLICITATION \n\nMedia General and Meredith and their respective executive officers and directors may be deemed to be participants in the solicitation of proxies from the security holders of either Media General or Meredith in connection with the Merger. Information about Media General's directors and executive officers is available in Media General's definitive proxy statement, dated March 13, 2015 \n\nCAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTS\n\nThis document contains forward-looking statements. You can generally identify forward-looking statements by the use of forward-looking terminology such as \"anticipate,\" \"believe,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"explore,\" \"evaluate,\" \"intend,\" \"may,\" \"might,\" \"plan,\" \"potential,\" \"predict,\" \"project,\" \"seek,\" \"should,\" or \"will,\" or the negative thereof or other variations thereon or comparable terminology. These forward-looking statements are only predictions and involve known and unknown risks and uncertainties, many of which are beyond Media General, Meredith and Meredith Media General's control.\n\nStatements in this document regarding Media General, Meredith and the combined company that are forward-looking, including projections as to the anticipated benefits of the proposed transaction, the methods that will be used to finance the transaction, the impact of the transaction on anticipated financial results, the synergies from the proposed transaction, and the closing date for the proposed transaction, are based on management's estimates, assumptions and projections, and are subject to significant uncertainties and other factors, many of which are beyond the control of Media General and Meredith. In particular, projected financial information for the combined company is based on management's estimates, assumptions and projections and has not been prepared in conformance with the applicable accounting requirements of Regulation S-X relating to pro forma financial information, and the required pro forma adjustments have not been applied and are not reflected therein. None of this information should be considered in isolation from, or as a substitute for, the historical financial statements of Media General or Meredith. Important risk factors could cause actual future results and other future events to differ materially from those currently estimated by management, including, but not limited to: the timing to consummate the proposed transaction; the risk that a condition to closing of the proposed transaction may not be satisfied and the transaction may not close; the risk that a regulatory approval that may be required for the proposed transaction is delayed, is not obtained or is obtained subject to conditions that are not anticipated; the combined company's ability to achieve the synergies and value creation contemplated by the proposed transaction; management's ability to promptly and effectively integrate the businesses of the two companies; the diversion of management time on transaction-related issues; change in national and regional economic conditions, the competitiveness of political races and voter initiatives, pricing fluctuations in local and national advertising, future regulatory actions and conditions in the television stations' operating areas, competition from others in the broadcast television markets served by Media General and Meredith, volatility in programming costs, the effects of governmental regulation of broadcasting, industry consolidation, technological developments and major world news events.\n\nFor more discussion of important risk factors that may materially affect Media General, Meredith and Meredith Media General, please see the risk factors contained in Media General's Annual Report on Form 10-K for its fiscal year ended December 31, 2014 \n\nNo assurances can be given that any of the events anticipated by the forward-looking statements will transpire or occur, or if any of them do occur, what impact they will have on the results of operations, financial condition or cash flows of Media General, Meredith or the combined company. None of Media General, Meredith nor Meredith Media General assumes any duty to update or revise forward-looking statements, whether as a result of new information, future events or otherwise, as of any future date.\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/media-general-meredith-to-combine-to-create-meredith-media-general-a-new-powerful-multiplatform-and-diversified-media-company-300138841.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WAND TV"}