{"published": "2015-09-04T20:45:56Z", "media-type": "News", "title": "Northern Spirit Resources Inc. Announces Third Closing of Private Placement Financing", "id": "2daafa69-c4e2-40a2-82b0-6c09156d4972", "content": "CALGARY, ALBERTA--(Marketwired - Sept. 4, 2015) - \n \nNOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION IN THE UNITED STATES. ANY FAILURE TO COMPLY WITH THIS RESTRICTION MAY CONSTITUTE A VIOLATION OF U.S. SECURITIES LAWS. \n \nNorthern Spirit Resources Inc. (\" Northern Spirit \" or the \" Corporation \") (TSX VENTURE:NS) is pleased to announce that it has closed a third and final tranche of\n    the previously announced non-brokered private placement (\" Private Placement \"), issuing an aggregate of 6,755,555 common shares in the capital of the Corporation (\" Common\n    Shares \") at a price of $0.03375 per Common Share for total proceeds of approximately $0.23 million (the \" Final Closing \"). The securities issued pursuant to the Final\n    Closing are subject to a four-month trade restriction which will expire January 5, 2016. \n  \nAs announced on August 4 and August 31, 2015, respectively, the Corporation previously closed the first two tranches of the Private Placement issuing an aggregate of (i) 620,479,701 Common Shares\n  at a price of $0.03375 per Common Share and (ii) 102,239,526 Units at a price of $0.03375 per Unit, to the new management team (the \" New Management Team \") and new board of\n  directors together with other individuals and financial institutions identified by the New Management Team, for total proceeds of approximately $24.4 million. \n \nThe combined proceeds of the three tranches of the Private Placement is approximately $24.6 million, providing the Corporation with an anticipated cash position of approximately $23.3 million net\n  of transaction costs with no debt. \n \nThe Private Placement remains subject to the final approval of the TSX Venture Exchange (the \" TSXV \"). The proceeds from the Private Placement will be used to continue the\n  development of Northern Spirit's existing properties, to pursue organic growth initiatives, to fund potential acquisitions and for working capital. \n \nThe Corporation announced on August 26, 2015 that it has set September 8, 2015 as the record date (the \" Record Date \") for the previously announced rights offering (the\n  \" Rights Offering \") to the registered holders of Common Shares of the Corporation. Pursuant to the Rights Offering, each registered holder of Common Shares on the Record Date will\n  receive one transferable right (a \" Right \") for every Common Share held. Every nine Rights will entitle the holder to purchase one Common Share at a price of $0.03375 until the\n  Rights expire at 4:00 p.m. (Calgary time) on October 8, 2015. There is no additional subscription privilege and no standby commitment in respect of the Rights Offering. The completion of the Rights\n  Offering is not subject to the Corporation receiving any minimum amount of subscriptions from shareholders. Subscribers to the Private Placement are not eligible to participate in the Rights\n  Offering. Accordingly, a maximum of approximately 38,837,110 million Common Shares are issuable pursuant to the Rights Offering for maximum aggregate gross proceeds of approximately $1.31 million. \n \nFollowing the Final Closing but not including the anticipated Rights Offering, the Corporation has approximately 1,079.0 million Common Shares outstanding (basic) and 1,246.0 million Common Shares\n  outstanding (fully diluted). It is anticipated that the shareholders of Northern Spirit will be asked to approve a change of the Corporation's name to \"Altura Energy Inc.\", and to approve a\n  consolidation of the Common Shares of the Corporation at a special meeting to be held in conjunction with other corporate business on September 30, 2015. \n \n About Northern Spirit Resources Inc.  \n \nNorthern Spirit Resources Inc. is a public oil and gas Corporation active in the exploration and development of oil and natural gas in east central Alberta. \n \n Forward-Looking Cautionary Statements  \n \nThe reader is advised that some of the information contained herein may constitute forward looking statements within the meaning assigned by National Instrument 51-102 and other relevant securities\n  legislation. It includes, but is not limited to, statements with respect to: the use of proceeds of the Private Placement; the proposed name change of Northern Spirit; the growth strategy proposed\n  by the New Management Team; and the ability to obtain the final approval of the TSXV in respect of the Private Placement. Forward-looking information is frequently characterized by words such as\n  \"plan\", \"expect\", \"project\", \"intend\", \"believe\", \"anticipate\", \"estimate\", \"scheduled\", \"potential\", or other similar words, or statements that certain events or conditions \"may\", \"should\" or\n  \"could\" occur. \n \nForward-looking information is based on the Corporation's expectations regarding its future growth, results of operations, production, future capital and other expenditures (including the amount,\n  nature and sources of funding thereof), competitive advantages, plans for and results of drilling activity, environmental matters, business prospects and opportunities. Such forward-looking\n  information reflects management's current beliefs and assumptions and is based on information currently available to it. \n \nThe reader is cautioned that assumptions used in the preparation of such information, although considered reasonable by the Corporation at the time of preparation, may prove to be incorrect and\n  readers are cautioned not to place undue reliance on forward-looking information, which speaks only as of the date hereof. The Corporation does not undertake any obligation to release publicly any\n  revisions to forward-looking information contained herein to reflect events or circumstances that occur after the date hereof or to reflect the occurrence of unanticipated events, except as may be\n  required under applicable securities laws. \n \nAny number of important factors could cause actual results to differ materially from those in the forward-looking statements including, but not limited to, shareholder, regulatory and third party\n  approvals not being obtained in the manner or timing set forth in the Corporation's reorganization and investment agreement dated July 6, 2015, the ability to implement corporate strategies, the\n  state of domestic capital markets, the ability to obtain financing, changes in general market conditions and other factors more fully described from time to time in the reports and filings made by\n  Northern Spirit with securities regulatory authorities. \n \n Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or\n  accuracy of this release.", "source": "Wallstreet Online"}