{"published": "2015-09-01T20:10:56Z", "media-type": "News", "title": "2016 Lincoln MKZ", "id": "cc0098e6-c674-45e9-8c41-df4140cb8bad", "content": "Overview  \nThe Lincoln MKZ is a star for the brand, sporty, responsive, enthusiastic and entertaining. Some might see it as just a swoopy Ford Fusion because it’s built on the same platform, but it’s more than that. For one thing, the MKZ comes with Lincoln Drive Control, with three modes to set the dampers, steering response, stability and traction control, and active noise cancellation. Front-wheel drive is standard, all-wheel drive available. \n \nThe standard engine is the EcoBoost 2.0-liter turbocharged four-cylinder that is reasonably quick most of the time, and gets an EPA-estimated 33 Highway miles per gallon with front-wheel drive. It makes 240 horsepower and is mated to a paddle-shifting 6-speed automatic transmission. \n \nThen there is a more Lincoln-like 3.7-liter V6 making 300 horsepower that gets 26 mpg Highway. \n \nAt the other extreme there’s the MKZ Hybrid that gets 40 mpg Combined, and many have topped that on test drives. It uses a 2.0-liter four-cylinder engine combined with lithium-ion batteries that are lighter and packaged better than on previous Ford hybrids, and a CVT. \n \nThe MKZ can be equipped with inflatable rear seatbelts in addition to the latest safety technology, including adaptive cruise control, lane-keep assist and collision warning with braking. There’s also parking assist, which takes control of the steering and parks the car for you. \n Model Lineup  \nWith the standard EcoBoost four-cylinder, the MKZ is $35,190, and the Hybrid is the same MSRP. All-wheel drive is about $2000. The cost peaks with the all-wheel-drive Black Label model, at $47,495. \n Exterior  \nGive Lincoln credit for daring design, without glitz and glamour. The MKZ has bold and curious styling. It emanates character, but might not be for everyone. It’s way modern; elegant, smooth and aerodynamic from the nose to the deck lid, almost a fastback like the Audi A7. But if you look deep into the winged grille, you might see homage to the 1938 Lincoln Zephyr that started it all. \n Interior  \nDominating the cabin is an available panoramic roof that opens up 15 square feet of ceiling to the sky. But the standard luxury fittings are fairly conventional, and even spartan compared to some competition; there’s a lot of real wood trim, but leather isn’t standard. It has a European touch. \n \nThe transmission shifts by paddles on the steering wheel, while its main setting is by pushbuttons lining the LCD screen; there is no lever on the console, so the screen is lowered and wrapped in metallic trim, and it dominates the instrument panel. It’s not bad, it suits the cohesive arrangement of the gauges, and their glow. \n \nThe screen content is another matter, especially MyFord Touch with its four displays that step on each other. Ford keeps updating the system, trying to streamline it. If, like us, you can’t fathom the distracting touch method, there are steering wheel controls and voice command. But be prepared for your Lincoln to disobey your voice commands. \n Driving Impressions  \nThe 240-horsepower EcoBoost four cylinder accelerates to 60 mph in a leisurely 7.5 seconds, dragging the MKZ’s weight of nearly two tons; its 270 pound-feet of torque and 6-speed automatic transmission are frequently challenged and fully used. During two-lane passing, throttle response is prompt, with nary a hint of turbo lag, so acceleration decent. However the engine can sound coarse at full throttle, overpowering the noise cancellation system that otherwise keeps noise down. \n \nThe paddle-shifting 6-speed automatic transmission is sharp, but in manual mode it’s necessary to stay in a gear that keeps the revs up, or else the engine lags and acceleration fades. Some cars in this class have 7- or 8-speed transmissions, which help keep the revs up because with tighter gear spacing there’s less of a drop between shifts. \n \nThe 300-horsepower V6 accelerates to 60 mph in 6.0 seconds, that’s more like it. It’s mated to the same transmission, controlled by the pushbuttons. It’s smooth and calm, compared to the turbo four. \n \nThe Hybrid mates its 2.0-liter four-cylinder engine to lithium-ion batteries and a continuously variable transmission to get its 40 miles per gallon. It only comes in front-wheel drive, and the acceleration is tepid. You can feel more differences, including lighter steering and slower response with the CVT than the automatic; but it’s smooth and quiet, and encourages satisfying efficient driving with smart and engaging displays. \n \nThanks partly to a rigid chassis, the MKZ handles well, competent and sure-footed. It changes direction quickly, especially in Sport mode, with level cornering and good grip for a car this size with all-season tread on the tires. The electric power steering is nicely weighted but a little numb; it’s accurate and quick, from lock to lock just 2.7 turns. \n \nThe ride is taut, firm but not harsh in the Sport mode, where we kept it most of the time; we found the other modes too soft. In Sport mode you feel only the big bumps. \n Final Word  \nDistinctive styling, sporty handling, taut ride, and three powertrains to choose from. It’s not your father’s Lincoln Town Car. MyFord Touch could be a dealbreaker, so try before you buy.", "source": "New Car Test Drive"}