{"published": "2015-09-28T08:47:41Z", "media-type": "News", "title": "India gets its own space observatory, joins select group", "id": "015eb5ca-1db1-4f09-adfc-58ad0ac3e456", "content": "in BOLYWOOD / \t\t\t\t\tby / \t\t\t\t\ton September 28, 2015 at 8:47 am /  \nSriharikota (Andhra Pradesh) : India on Monday joined a select group of nations owning space observatory with the successful launch of ASTROSAT by its rocket, which also put into orbit six other foreign satellites. \n \nWith the successful launch of ASTROSAT, India gained an entry into the select club of nations having its own space observatory after the US, Japan, Russia and Europe. \n \nExactly at 10 a.m. the 44.4 metres tall weighing around 320 ton polar satellite launch vehicle's XL variant (PSLV-XL) blasted off the first launch pad at the rocket port here, around 80 km from Chennai. \n \nThe PSLV-XL rocket with seven satellites cumulatively weighing 1,631 kg climbed up steadily gathering speed amidst the cheers of Indian space agency officials and the media team assembled here. \n \nThe expendable rocket carried Rs.180 crore ASTROSAT, India's first dedicated multi-wavelength space observatory that will help in understanding the universe, and six other foreign satellites. \n \nWhile ASTROSAT with a five year life span weighed 1,513 kg, the six foreign satellites (four from the US and one each from Indonesia and Canada) together weighed 118 kg. \n \nIncidentally, this is the first time that an Indian rocket launched satellites from the US. \n \nAccording to an official of Antrix Corporation - the commercial arm of India Space Research Organisation (ISRO) - a deal has been signed to put into orbit nine American nano/micro satellites by the end of 2016. \n \nWhile four US satellites have been put into orbit on Monday, the remaining five would also piggy back on a bigger satellite later. \n \nAt the mission control room, space scientists at Indian Space Research Organisation (ISRO) were glued to their computer screens watching the rocket escaping the earth's gravitational pull. \n \nJust over 22 minutes into the flight, the rocket slug ASTROSAT at an altitude of 650 km above the earth. \n \nSoon after, six other satellites were put into orbit and the whole mission ended in just over 25 minutes. \n \nFor the third time a PSLV rocket has launched seven satellites in a single mission. In 2008, ISRO had launched 10 satellites in one go, including India's Cartosate-2A satellite. \n \nImmediately on the successfully ejection, scientists at the mission control centre were visibly relieved and started clapping happily. In the process India crossed the half century milestone when it its rocket injected the six foreign satellites successfully into their intended orbit. \n \nTill date, India has launched 45 foreign satellites for a fee. \n \nISRO chairman A.S.Kiran Kumar described it as an \"eventful day\" and congratulated the entire ISRO team. \n \nP.Kunhi Krishnan, director, Satish Dhawan Space Centre, said: \"PSLV's success is continuous. Today it injected seven satellites in \nprecise orbit.\" \n \nHowever, it will not be right to call ASTROSAT as India's 'Hubble'. The Hubble owned and launched by the US in 1990 is 10 times heavier than the ASTROSAT and is said to cost $2.5 billion. \n \nWhile the Hubble space telescope is still working now, India's ASTROSAT's life span is five years. \n \nASTROSAT, will observe the universe through optical, ultraviolet, low and high energy X-ray components of the electromagnetic spectrum, whereas most other scientific satellites are capable of observing through a narrow wavelength band. \n \nThe five payloads/instruments of ASTROSAT are selected to facilitate deeper insight into the various astrophysical processes occurring in the various types of astronomical objects constituting our universe, ISRO said. \n \nThe payloads are developed by different institutions-domestic and foreign- on their own or collaborating with ISRO. \n \nOf the five payloads, the Ultraviolet Imaging Telescope (UVIT) is jointly developed by Indian Institute of Astrophysics (IIA), Bengaluru and Inter University Centre for Astronomy and Astrophysics (IUCAA) at Pune in collaboration with Canadian Space Agency and ISRO. \n \nThis instrument can observe the sky in the visible near ultraviolet and far ultraviolet regions of the electromagnetic spectrum. \n \nThe second payload Large Area X-ray Proportional Counter (LAXPC) is developed by Tata Institute for Fundamental Research TIFR), Mumbai and Raman Research Institute (RRI), Bengaluru. \n \nThe third payload Soft X-ray Telescope (SXT) is developed by TIFR in collaboration with the University of Leicester, UK and ISRO. \n \nThe fourth payload Cadmium Zinc Telluride Imager (CZTI) was developed by TIFR and IUCAA in collaboration with ISRO. \n \nAnd the fifth one Scanning Sky Monitor (SSM) was jointly developed by ISRO Satellite Centre at Bengaluru and IUCAA. \n \nThe Indonesian 76 kg LAPAN-A2 is a micro-satellite from the National Institute of Aeronautics and Space, meant for providing maritime surveillance using automatic identification system (AIS), supporting Indonesian radio amateur communities for disaster mitigation and carrying out earth surveillance using video and digital camera. \n \nThe 14 kg NLS-14 (Ev9) of Space Flight Laboratory, University of Toronto Institute for Advanced Studies, is also a maritime monitoring Canadian nano satellite using the next generation AIS. \n \nThe remaining four LEMUR nano satellites from Spire Global Inc., San Francisco, US, are non-visual remote sensing satellites, focusing primarily on global maritime intelligence through vessel tracking via AIS and high-fidelity weather forecasting using GPS radio occultation technology, the ISRO said. \n\n   Tweet  [embedded content]", "source": "Punjab Star News"}