{"published": "2015-09-12T12:20:03Z", "media-type": "News", "title": "Audi Q7 wins for best premium interior design", "id": "f7a13d83-7109-4366-80e2-56e720161a44", "content": "Back   You are here: Markets  Section Motors The new Audi Q7 has been named \"Best of the Best\" in the German Design Council's Automotive Brand Contest 2015. \n \nThe new Audi R8 is being honored in three categories. In addition, the Audi prologue concept cars are receiving \"Special Mention\" for exceptional innovation. In all, Audi is receiving 16 awards at the fifth edition of the competition. \n \nWith the award for the Q7, Audi takes first place in the \"Interior Premium Brand category. The SUV impresses with its progressive interior design and high-end technical solutions. \"For the new Q7 generation, the design has succeeded in implanting a feeling of expansiveness, roominess and cultivated elegance,\" the jury stated in its reasoning. \"Here, a clear architecture and logical control concept immediately make one feel at home – and the tasteful and perfectly crafted materials convey the feeling of sitting in a stylish lounge. With this interior, the Q7 sets the standard in this segment.\" \n \nIn addition, the Audi R8 is also being honored for its design. The sports car is the winner due to outstanding achievement in the categories \"Exterior Premium Brand\" and \"Interior Premium Brand.\" Moreover, the laser headlights of the Audi R8 are being honored for winning the \"Future, Mobility & Parts\" category. \n \nAudi is also well-equipped for the future when it comes to design. This is demonstrated by the Audi prologue, Audi prologue Avant and Audi prologue allroad concept cars. They earned \"Special Mention\" in the \"Concepts\" category – an honorary award for exceptional innovation. Audi has won an additional eleven prizes in this year's Automotive Brand Contest in the areas \"Architecture & Events,\" \"Campaign,\" \"Corporate Publishing\" and \"Digital.\" \n \nThe awards will be presented on September 15, 2015, during the first Press Day of the IAA in Frankfurt. The highly respected German Design Council initiated the Automotive Brand Contest in 2011 – one of the leading international centers of excellence in design. The Automotive Brand Contest quickly developed into one of the most important competitions in the industry.", "source": "Josour Magazine"}