{"published": "2015-09-30T05:22:47Z", "media-type": "News", "title": "Bank Muscat to offer exciting cash prizes on debit card promotion", "id": "33b58ecc-f29f-4447-a13e-75c646a160f0", "content": "Bank Muscat, the flagship financial services provider in the Sultanate, in line with its ‘Let’s Do More’ vision and commitment to partnership in enhancing the banking experience, has launched an exciting promotion offering attractive cash prizes for Bank Muscat debit cardholders. The promotion, which rewards Bank Muscat customers with the attractive value proposition of cash prizes, begins on October 1, 2015 and runs for 3 months till December 31, 2015. \n\nThe exclusive debit card promotion is yet another value addition launched as part of the bank’s year-long activities lined up to reward customers in celebration of the Sultanate’s 45 years of Renaissance under the leadership of His Majesty Sultan Qaboos. Reflecting the 45th Renaissance anniversary theme, 45 Bank Muscat cardholders will win cash prizes of RO 100 each every month during the 3-month promotion period. In all, three monthly draws will be held rewarding a total of 135 customers. \n\nAll Bank Muscat debit cardholders are eligible to participate in the promotion. All that they need to do is use their debit cards to settle payments across merchant outlets in Oman or abroad as well as online transactions. Each PoS transaction using Bank Muscat debit card is valid and a minimum of five transactions a month entitle customers for a chance to enter the monthly draw. The more the debit card transactions, the more the chances to participate in the draw. \n\nTariq Atiq, AGM — Cards & eBanking, said: “Bank Muscat is delighted to launch yet another promotion offering an attractive value proposition for customers. Time and again, Bank Muscat takes the lead in launching novel campaigns and promotions that continuously enhance value as well as create unique opportunities that enrich life for customers.” \n\nTariq Atiq added: “Bank Muscat cards, which spell convenience and security, is the preferred mode of payment in Oman. The wide range of Bank Muscat cards provide a secure option to pay for a host of transactions across millions of merchant outlets in Oman and abroad. The campaign reiterates the bank’s commitment to promoting secure card payment in Oman.”\r\nIn another ongoing debit card promotion supported by over 60 leading restaurants, cafes, spas and retail outlets across Oman, Bank Muscat customers are rewarded with an attractive value proposition of discounts. \n\nThe 6-month campaign launched by the flagship financial services provider in the Sultanate on May 31, 2015 runs till December 31, 2015. Bank Muscat cardholders can avail discount at the outlets by simply settling the bill with his/her Bank Muscat debit card. The list of outlets offering the discounts can be viewed on the bank’s website.\r \n \n\r\n\t\t\t\t\t\t\t\t\tOman Daily Observer", "source": "GulfBase"}