{"published": "2015-09-27T02:46:41Z", "media-type": "News", "title": "Ed Sheeran packs Gillette Stadium", "id": "51cb45c2-64d2-4c5e-a04f-2ac573d8ddd4", "content": "By \r \r\n\tAngela Smith\r \r \r \r Posted Sep. 26, 2015 at 12:01 am \r Updated at 5:11 PM \r \n  British pop star Ed Sheeran made a stop in Foxborough at Gillette Stadium for the first time as a headliner. His unique style and catchy beats brought in more than 52,000 people to the venue, making it his largest tour stop in the United States so far. Sheeran, who opened for Taylor Swift on her Red Tour at Gillette in 2013, has made a name for himself over the past two years with a lot of mainstream radio play. The thing about Sheeran’s live show is that he performs solo with nothing but his guitar. He doesn’t have a band or a backing track. Instead Sheeran uses a device called a loop pedal that records his voice and guitar and plays it back as he’s going through each song. It’s an impressive feat for any performer, especially one playing a large stadium such as Gillette, however the issue with this is that many of the beats begin to sound repetitive since Sheeran uses his guitar as a drum as well. That being said, any artist who can pull such a hard task off during a live show is definitely worth seeing. Sheeran started his set with “I’m A Mess,” followed by “Lego House” and “Drunk.” At one point, he told a story about a Canadian couple who were unhappy with the show because they assumed he was not performing live. Sheeran made it very clear that he was, in fact, completely live send even had the cameras pan in on his looping pedal to prove it. Though many artists need a band or theatrics to make their show a hit, Sheeran didn’t need any of that. The fact that he played alone on a massive stage that appeared to swallow him up from afar, made the entire set feel a lot more intimate. Sheeran made sure to involve the audience and talk with them as if they were his friends. His entire two hour set seemed to be about making everyone comfortable and happy, though he did say he writes a lot of depressing songs that “you listen to at 2 a.m. with an empty bottle of wine.” “You sound beautiful, thank you so much,” he told the crowd after asking them to sing along with him. It’s no secret that the 24-year-old has a lot of very famous friends. One of those friends joined him on the Gillette stage on Friday night. Chris Martin, lead singer of Coldplay and ex-husband of actress Gwenyth Paltrow, took the stage with Sheeran for “Thinking Out Loud” as well as Coldplay’s “Yellow.” Though they were good together, Sheeran was much better off solo as that seems to be his niche. Sheeran ended his set with an encore of “You Need Me, I Don’t Need You” and “Sing.”", "source": "Wicked Local Swansea"}