{"published": "2015-09-07T13:59:36Z", "media-type": "News", "title": "PM to meet industry leaders tomorrow on global economic scene", "id": "f35ecb25-02e9-4067-a77e-6aba4ae94f45", "content": "Prime Minister Narendra Modi will tomorrow meet business leaders including Reliance Industries head Mukesh Ambani, Tata Group chairman Cyrus Mistry as well as bankers and economists to discuss global economic… \r \nNEW DELHI: Prime Minister Narendra Modi will tomorrow meet business leaders including Reliance Industries head Mukesh Ambani, Tata Group chairman Cyrus Mistry as well as bankers and economists to discuss global economic scenario. \n\nThe meeting is being held amid turbulence in global markets caused by a slowing Chinese economy and concerns as the US prepares to raise interest rates. \n\nAs many has 27 business leaders, bankers and economists have been invited for the meeting to deliberate on the recent developments in the global economy and the opportunities they present for India, sources said. \n\nRBI Governor Raghuram Rajan and Niti Aayog vice chairman Arvind Panagariya will also attend the meeting to which other invitees include Bharti Airtel chief Sunil Bharti Mittal, Essar Group head Shashi Ruia, Reliance Group chairman Anil Ambani, Adani Group head Gautam Adani, ICICI Bank CEO Chanda Kochhar and SBI Chairperson Arundhati Bhattacharya. \n\nMahindra Group chairman and managing director Anand Mahindra and Aditya Birla Group head Kumar Mangalam Birla are said to be among the other invitees for the meeting for which industry chambers' heads -- Sumit Mazumder of CII, Jyotsna Suri of FICCI and Rana Kapoor of Assocham have also been called. \n\nFinance secretary Ratan P Watal, commerce secretary Rita Teaotia, economic affairs secretary Shaktikanta Das and chief economic advisor Arvind Subramanian will be present at the meeting. \n\nSources said the agenda for the meeting is 'Recent Global Events - Opportunities for India', but other issues plaguing the Indian industry may also come up for discussion. \n\nEach speaker will be given three minutes to make initial remarks. \n\nModi had in his first interaction with…", "source": "MyInforms"}