{"published": "2015-09-01T13:16:39Z", "media-type": "News", "title": "West Ham make triple signing on deadline day", "id": "9f762b30-ecfe-41ad-b194-9fe382b4f2a3", "content": "MANCHESTER, England -- West Ham was the biggest early mover on the final day of trading in Britain's summer transfer window, taking midfielders Alex Song and Victor Moses on loan and buying Croatia striker Nikica Jelavic on Tuesday. Everton signed Argentine defender Ramiro Funes Mori from River Plate for 9.5 million pounds ($14.5 million) on a five-year deal. Plenty more moves are expected on what is usually a frantic day at activity among Premier League clubs. The biggest deal is likely to be Monaco forward Anthony Martial's move to Manchester United in a reported deal worth at least 36 million pounds ($55 million), which would make the 19-year-old Frenchman the most expensive teenager in the history of the game. Premier League clubs have already spent nearly 800 million pounds ($1.2 billion) in this window, which is close to breaking its record of 835 million pounds set last summer, according to football finance expert Deloitte. ''This level of spending continues to be driven in large part by the increases in domestic and overseas broadcast revenue in recent years,'' said Alex Thorpe, senior manager in Deloitte's Sports Business Group. Song will spend a second straight season on loan at West Ham from Barcelona. The Cameroon midfielder's children play in the West Ham academy. Moses will spend a third straight season away from Chelsea, with the Nigeria winger having previously had loan spells at Liverpool and Stoke. And Croatia striker Jelavic left Hull - relegated from the Premier League last season - to join West Ham on a two-year deal. Funes Mori, one of River Plate's best players in the team that won the 2014 Copa Sudamericana and 2015 Copa Libertadores, moved to Everton for 9.5 million pounds ($14.5 million) on a five-year deal to provide competition for Phil Jagielka and John Stones at center back. Funes Mori attended Everton's Premier League match against Manchester City last month, and was pictured wearing a blue-and-white Everton scarf, but had to wait more than a week before sealing his move.", "source": "FOXSports.com"}