{"published": "2015-09-09T13:17:25Z", "media-type": "News", "title": "BiVi Sicilian Vodka Reveals First New York Meet-and-Greet Events With Chazz Palminteri", "id": "ec49dfa7-c9d0-4db4-b757-07daad444ab7", "content": "PR Newswire \n \nNEW YORK, Sept. 9, 2015 \n   \nNEW YORK , Sept. 9, 2015 /PRNewswire/ -- BiVi Sicilian Vodka, a subsidiary of Iconic Brands (OTC PINK:  ICNB), announced today two upcoming store appearances for brand celebrity spokesperson, Chazz Palminteri . The events, which are scheduled for late September and early October, will take place exclusively at Stew Leonard's Wines in Carle Place, N.Y. and Stew Leonard's Wines in Yonkers, N.Y. These events will mark the first in-store appearances in the New York market. \n\nBiVi Sicilian Vodka is hand-crafted in an \"Old World\" artisan distillery in Messina, Sicily with local pristine waters and the finest semolina wheat. The stills are fired using the finest Sicilian fruitwoods from Blood Orange and Lemon trees. BiVi, a super-premium spirit, is the first-of-its-kind 100% Sicilian vodka available state side. \n\n\"We are excited to team up with the folks at BiVi Sicilian Vodka to host appearances with legendary actor, Chazz Palminteri ,\" said Stew Leonard, Jr. of Stew Leonard's Wines. \"We know that our customers will love the vodka tasting and their time with Chazz.\" \n\nThe meet-and-greets will take place at the Stew Leonard's Wines store in Carle Place and the Stew Leonard's Wines store in Yonkers on the following dates and times: \n\nDate: Saturday, September 26 , 2015  \nTime: 11:00 a.m. to 1:00 p.m.  \nStew Leonard's Wines  \n215 Glen Cove Road, Suite A \nCarle Place, NY 11514 \nPhone: 516-742-2588 \n\nDate: Saturday, October 3 , 2015  \nTime: 1:00 p.m. to 3:00 p.m.  \nStew Leonard's Wines  \n1 Stew Leonard Drive  \nYonkers, NY 10710 \nPhone: 914-375-4700 \n \n\"We are delighted to co-host our first New York meet-and-greets with Chazz Palminteri at Stew Leonard's Wines,\" said Rich DeCicco , President and CEO of BiVi Sicilian Vodka. \"It is our goal to connect with as many consumers and fans as possible, and the industry professionals at Stew Leonard's will surely provide that platform.\" \n\nTo learn more about BiVi Sicilian Vodka and upcoming events, please visit: www.bivivodka.com . \n\nAbout Stew Leonard's Wines   \nStew Leonard's Wines, named the 2011 Wine Enthusiast Retailer of the Year, is known for the personal service it provides to customers and its knowledgeable staff, many of whom are certified wine professionals. Each wine store is independently owned and operated and is not part of a cooperative buying group, or affiliated with the Stew Leonard's food stores. The store carries 2,600 wines from around the world, including more than 200 bottles of hard-to-find, highly rated wines in the fine wine cellar. Sign up to be notified of future events via email by filling out a form at the store. Visit www.stewswines.com for more information and follow us on social facebook.com/StewLeonardsWines, instagram.com/stewswines, and twitter.com/stewswines. \n \nAbout BiVi Sicilian Vodka  \nLaunched in the summer of 2015, BiVi Sicilian Vodka is a subsidiary of Iconic Brands (OTC PINK: ICNB). Produced in an \"Old World\" artisan distillery in Messina Sicily , BiVi Sicilian Vodka is hand-crafted with Sicily's local pristine waters and the finest semolina wheat. The stills are fired using the finest Sicilian fruitwoods from Blood Orange and Lemon trees. BiVi, a super-premium spirit, is the first-of-its-kind 100% Sicilian vodka available state side. The brand, along with its celebrity spokesperson, legendary actor Chazz Palminteri , have joined forces to raise awareness for the product as it becomes available across the U.S. \n\nShare an olive. Share the tradition. Drink BiVi. \n\nTo learn more, visit www.bivivodka.com  \n \nFollow us on Twitter @BiviVodka  \n\nLike us on Facebook www.facebook.com/pages/BiVi-Vodka/1642936352589096 . \n\nAbout Iconic Brands, Inc.  \nIconic Brands Inc. (\"Iconic\") is a beverage company with the highest expertise of developing, from inception to completion, alcoholic beverages for itself and third parties. Iconic Brands markets and places products into national distribution through long standing industry relationships. Iconic is also a leader in \"Celebrity Branding\" of beverages, procuring superior and unique products from around the world and branding its products with internationally recognized celebrities.  \n\nForward-Looking Statements  \nThis press release may contain forward-looking statements that involve risks and uncertainties. These statements relate to future events or our future financial performance. In some cases, you can identify forward-looking statements by terminology including \"could\", \"may\", \"will\", \"should\", \"expect\", \"plan\", \"anticipate\", \"believe\", \"estimate\", \"predict\", \"potential\" and the negative of these terms or other comparable terminology. While these forward-looking statements, and any assumptions upon which they are based, are made in good faith and reflect our current judgment regarding the direction of our business, actual results will almost always vary, sometimes materially, from any estimates, predictions, projections, assumptions or other future performance suggested in this report. Except as required by applicable law, we do not intend to update any of the forward-looking statements so as to conform these statements to actual results. Investors should refer to the risks disclosed in the Company's reports filed from time to time with the Securities and Exchange Commission and available at  www.sec.gov . \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/bivi-sicilian-vodka-reveals-first-new-york-meet-and-greet-events-with-chazz-palminteri-300139608.html \n\nSOURCE  BiVi Sicilian Vodka", "source": "Reuters"}