{"published": "2015-09-08T14:45:41Z", "media-type": "News", "title": "Amazon Wants to Lure In Budget-minded Customers with $50 Fire Tablet", "id": "1640d795-7e76-4958-9c9e-eb02c168dd12", "content": "It’s easy for Apple Inc. to sell expensive merchandise – but for some reason, Amazon has repeatedly failed in getting customers interested in pricier tablets. That’s why a recent announcement presented an upcoming launch for a $50 tablet, looking to appeal to the budget-conscious customers later this year. \n \nIts target audience is rather clear: buyers interested in a simple tablet that allows them to easily browse online while shopping on Amazon or streaming videos. Inside sources revealed that the tablet will not only be half the price of Amazon’s 6-inch Fire HD tablet, but will also boast a 6-inch screen. \n \nSo get you holiday-shopping money ready, because the new tablet is set to hit the shelves by then. But also get ready to experience a lower quality experience that automatically comes with paying less money, such as having the stereo replaced by a mono speaker. \n \nOther Amazon devices are scheduled to be released within the year, according to the same source, including two different tablets that will feature 8- and 10-inch screens, respectively. What’s surprising, however, is the fact that, in a time when the trend is to go bigger and better – see Apple’s upcoming 12.9-inch iPad Pro – Amazon has chosen to downsize its devices. \n \nBut Apple and Amazon alike face the same challenge: attracting consumers interested in buying tablets in a market where interest for devices has been slowly but surely decreasing. Users are looking to more important hardware or software innovations, and since companies have hit a plateau due to limitations of upgrades, they’re not baiting as much as they used to. \n \nReports support this theory, with the International Data Corporation showing a 7 percent decrease in the worldwide tablet market, as market saturation turned tablet sales rather erratic. \n \nInitially, Amazon CEO Jeff Bezos had wanted to keep the Kindle e-reader and Fire tablet under the price tag goal of $50, as a means of luring budget-minded customers. But because the e-reader screen technology cost too much for the retail price to be that low, Amazon ended up selling its cheapest Kindle for $79. \n \nMarket analysts are not sure that this is the way to go in order to attract more customers. Some people might not tolerate a potentially inferior experience just for the sake of a low price, but more will be said when the tablet’s specifications will be revealed. \n \nBut Amazon might need this kind of drastic measures, as the company is still reeling from a big $170 million flop from October 2014, when the Fire smartphone – priced in the range of an iPhone – produced a massive unsold inventory. \n Image Source: Mobile Advertising Watch \n \nThe post appeared first on Utah People's Post .", "source": "The Utah People's Post"}