{"published": "2015-09-13T12:23:27Z", "media-type": "News", "title": "Rugby – Stewarts-Melville v Edinburgh Accies, BT National League, Div. 1", "id": "0c8d5315-7fed-42ac-80c0-d24cebc45488", "content": "Accies get their season off the ground at Inverleith \n \n\n \nPlaying all of 0.9 miles away from home, Edinburgh Accies ‘travelled’ to Stewart-Melville’s home ground at Inverleith for their third round match in the BT National League’s Division 1. Stew-Mel came into the match with two wins from two matches while Accies had suffered two losses. According to various sources, however, neither team had played particularly well in the run up to the match, so it was all eyes to the pitch as the referee blew to start the match. \n \nInitially, it looked like a poor start for the visitors as the wind took the kick off beyond Stew-Mel’s dead ball line, forcing a scrum restart from the centre. It was immediately apparent that the home side scrum was in for a long afternoon as they just managed to retain the ball. However, less than two minutes in, the Accies pack turned over the ball from a ruck and, exploiting a gap up the left, wing Neil Armstrong galloped in from 30+ metres for the try. Facundo Beltrami, then stepped up to score with the conversion and Accies were 7-0 ahead. \n \nFor the next 20 minutes of the first half, play was fairly evenly distributed between the teams, with Stew-Mel possibly having the territorial advantage, but suffering a couple of turnovers in the process as the bigger Accies pack exerted a bit of dominance. But, ‘evenly distributed’ possession counted for little as Beltramino knocked over two penalties in the period of the match to stretch the visitors lead to 13-0. \n \nDespite the penalty count against Stew-Mel climbing, they did have their own chance at points with just about 10 minutes to play, but, the, usually reliable, boot of Nick McCashin failed, and his attempt just made it across the goal line. From the 22 restart the home side pressed for the next score, but had to settle for a, this time, successful penalty goal from McCashin with about five minutes of the half left. Accies then regained the restart ball and pushed the home side deep, pressure which was rewarded with a successful Beltramino penalty on 40 minutes, so the sides went in 16-3 at the break. \n \nFive minutes into the second half and McCashin pulled back three points for Stew-Mel with a finely struck penalty from distance to close the score up a touch to 16-6. \n \nBy this time, the referee was losing patience with Stew-Mel’s penalty count and, with another ruck infringement in the home 22, sub, Neil Bowie, saw yellow and was off for 10 minutes. Accies saw their chance, but their own penalty count was increased by two as they were penalised in a ruck and then again following the penalty lineout. This put Stew-Mel deep in the visiting half, but a dropped ball handed possession back to Accies. \n \nThey then used their extra man to great effect and, despite desperate defence from Stew-Mel, they scored their second try from a rolling maul off the top of a five metre lineout, Jamie Sole coming up with the ball. With another successful Beltramino kick, the score had now opened up to 23-6 with just over 20 minutes left to play. \n \nJust as in the first half, the home side found their feet and were easily the better side for the next 10 minutes or so. They came near to scoring down the right, but eventually crossed the line with a fine passing move which saw No. 14, Ross McCann forcing himself over near the left corner. With McCashin’s conversion just shaving the front of the posts, the score remained at 23-11. \n \nAlmost chasing down a clearance from the restart saw Stew-Mel inside Accies 22 again, but some fine play had the visitors clear after a few neat moves and deep in the home half. A ruck on the right was badly dealt with by the Stew-Mel defence and Accies no. 6, Alistair Pollock had a virtually clear run in to the line – almost losing his shorts, but displaying a fine line in Edinburgh Accies branded underwear in the process! Once again, Beltramino was on song with his kicking and, with just enough time for the restart, the score was 30-11. \n \nAnd it was a restart that one Stew-Mel player soon wished had never happened. \n \nWith Stew-Mel on the attack, the ball was lost forward and Accies set up to clear. With frustration mounting, one of the Stew-Mel players ‘got in the way’. He was then ‘moved on’ by Accies Swanepoel, but Matt Stevens from the home side saw red, picked up the Accies player and dumped him on his head. Needless to say, this initiated a, thankfully, brief mêlée and the whole thing ‘kicked off’ with players flying in from all angles. When the dust had settled, the referee had no option but to have Stevens literally see red as he carded him following a short conference with his assistant on the touch line. \n \nAccies then cleared the ball to touch to bring, what had been a fairly scrappy match, to a disappointing – for Stew-Mel – conclusion. \n \nImages from the match will appear here over the next few days. As Matt Stevens will, in all likelihood, be facing an SRU disciplinary hearing, images of the incident will be withheld.", "source": "The Edinburgh Reporter"}