{"published": "2015-09-21T05:05:36Z", "media-type": "Blog", "title": "#IAA: The Agents DETAIL The All-New Toyota Prius' INTERIOR — Do YOU Think Its A STUD or DUD?", "id": "201d3969-0321-490a-b035-22ea2eb38182", "content": "#IAA: The Agents DETAIL The All-New Toyota Prius' INTERIOR — Do YOU Think Its A STUD or DUD?\nAgent00R submitted on 9/21/2015Auto Spies Photos Timestamp: 1:05:36 AM\n1 user comments | Views : 260 | Category: New Cars | Source: www.autospies.com\rTag Links: #toyota, #prius, #2016prius, #frankfurtmotorshow, #iaa\nSHARE THIS ARTICLE\rRight now the third-generation Toyota Prius is essentially in its final days.\nWe've known it was rounding a bend not too long ago, but now we're finally seeing its replacement, the fourth-generation Prius. If we're honest, the jury is still out on it. 2015 Frankfurt Motor Show (IAA)\nAlthough Toyota has promised it will be a nice evolutionary step from the third-gen product, one thing's for sure: it certainly will feature a revolutionary design. Not just on the outside, either. Looking inside, the cabin is changing in a BIG way. Toyota said in its initial press release that the fourth-gen Prius would benefit from a more luxurious cabin equipped with better materials. But, that's looking harder to believe thanks to Agent 001's detailed photographs. What I will say, however, is that it appears there are quite a lot of screens to display information on. Seen for the very first time, 001 went through the cabin and leafed through its screens to show YOU what you can expect once this vehicle arrives in showrooms. After you scope out the images below, let us know if you think the interior on the fourth-gen Prius is a STUD or a DUD.\n2015 Frankfurt Motor Show (IAA)\nMost Viewed Photos on AutoSpies.com RIGHT NOW!\rFrankfurt Motor Show IAA\nFrankfurt Motor Show Preview\nPorsche 911 (991) REFRESH\nBMW 225xe and 330e\nMercedes-Benz S-Class Cabriolet\rLAST 5 GALLERIES\rAbout the Author\r\"There are two opinions in this world. Mine and the wrong one.\" -- Jeremy Clarkson\n— Agent00R (View Profile)", "source": "AutoSpies.com News"}