{"published": "2015-09-18T03:28:50Z", "media-type": "Blog", "title": "GOP scrambles to avoid shutdown over planned parenthood", "id": "2c63df98-0eea-4c13-a5b8-fa7662a8fa47", "content": "GOP scrambles to avoid shutdown over planned parenthood\rBy ANDREW TAYLOR and ALAN FRAM\nAssociated Press\nPublished: Thursday, September 17, 2015 at 6:01 a.m.\rLast Modified: Thursday, September 17, 2015 at 11:28 p.m.\rWASHINGTON — House Republican leaders scrambled Thursday to head off a politically damaging government shutdown in two weeks over rebellious conservatives’ demand that any stopgap spending bill block federal funds for Planned Parenthood.\rLeadership sought an outlet for GOP lawmakers’ outrage after this summer’s release of videos secretly recorded by abortion foes, who contend they show that Planned Parenthood illegally profits from selling tissue from aborted fetuses to medical researchers.\nUnclear is whether a vote Friday to defund Planned Parenthood and other steps will be enough to placate conservatives, emboldened by widespread criticism of the organization at Wednesday’s GOP presidential debate.\nTemporary funding legislation is needed to give the chronically dysfunctional Congress more time to sort through huge differences over a full-year spending bill that could ease a budget freeze facing the Pentagon and domestic agencies. Top congressional Democrats exiting a meeting with President Barack Obama on Thursday said any temporary funding measure should have a short time-span and that Democrats would demand increases for domestic agencies.\n“We want to make sure we have equal money for defense and non-defense,” said Senate Minority Leader Harry Reid, D-Nev. In the final months of the year, another possible shutdown looms over Obama’s demand that the GOP-led Congress to increase the nation’s borrowing authority.\nWhat is clear is that the once-routine job of advancing a short-term spending bill to keep the government open past an Oct. 1 deadline remains a major headache for House GOP leaders, chiefly Speaker John Boehner. Some hard-right lawmakers and tea partyers are threatening to try to topple the Ohio Republican, a fierce foe of abortion who has held the speakership since January 2011.\n“We’ve seen promises to fight tooth and nail on things in the past and it hasn’t really materialized,” said tea party-backed Rep. Matt Salmon, R-Ariz. “I think there will be a point where the thin ice breaks.”\nThe ice could be breaking between Boehner and Minority Leader Nancy Pelosi, D-Calif., who met for 20 minutes after she returned from meeting with Obama. Aides declined to characterize the session.\nRep. Thomas Massie, R-Ky., accused Boehner of “subverting our republic,” and working for lobbyists rather than “what the constituents of our district want.”\nBoehner’s clear but unstated preference is to pass a temporary funding bill that’s free of the Planned Parenthood controversy. Democrats are sure to filibuster any bill defunding Planned Parenthood should it come to a vote in the Senate, and Obama has promised a veto regardless.\nThe organization, which provides birth control, abortions and various women’s health services, says it’s done nothing wrong.\n“If you’re pro-life, the last thing you want to do is have the focus changed to the government shutdown ... rather than the activities of Planned Parenthood,” said Rep. Mike Simpson, R-Idaho, a Boehner ally. “At some point in time you’ve got to face reality.”\nThe White House, in a statement released Thursday evening, said Obama called the shutdown threat “a game of chicken with our economy that we cannot accept.”\nAt a closed-door GOP meeting Thursday, Republicans were shown party polling data that showed most Americans haven’t seen the videos and that more Americans associate Planned Parenthood with women’s health than with abortions. The numbers also showed that most Americans don’t want a government shutdown, lawmakers at the meeting said.\nA significant majority of Republicans would support Boehner if he were to press for a temporary bill disentangled from the dispute over Planned Parenthood. But a few dozen of the most conservative Republicans have vowed to oppose any such effort, and some are weighing a challenge to Boehner’s leadership.\nAsked how confident he was that he could defeat an effort to remove him from the post, Boehner said, “Very.”\nOther GOP members say tea party lawmakers have repeatedly driven GOP leaders into unwinnable fights. They highlight the 16-day partial government shutdown over health care two years ago and a failed attempt this year to use a Department of Homeland Security funding bill to reverse Obama’s moves easing the threat of deportation for millions of immigrants living in the country illegally.\n“They’re kind of like their own party,” said Rep. Devin Nunes, R-Calif. “You can’t really do anything about it because they’re right-wing Marxists. It’s unpredictable what they’re going to do.”\nHillary Clinton went on the offensive Thursday, the day after the attack on Planned Parenthood was front and center in a debate of GOP presidential candidates.\n“It’s bad enough to see hateful rhetoric and lies in a presidential debate. But just like the candidates on stage last night, Republicans in Congress want to defund Planned Parenthood. And they’re willing to shut down the federal government to do it, no matter how bad that is for our country,” said the Democratic front runner.\nSo for now, GOP leaders are pushing free-standing bills blocking Planned Parenthood’s money and curbing abortion that are not tied to money to keep the government functioning. In addition, four congressional committees are investigating Planned Parenthood.\nRight to Life’s leaders released a statement this week endorsing a bill by Rep. Diane Black, R-Tenn., halting federal payments to Planned Parenthood for a year. The House plans to approve that bill on Friday, along with another by Rep. Trent Franks, R-Ariz., setting criminal penalties for medical providers who don’t try to save babies born live during abortions.\n——\nAssociated Press reporters Stephen Ohlemacher and Erica Werner contributed to this report.", "source": "Local News from Gadsden Times"}