{"published": "2015-09-27T08:00:15Z", "media-type": "Blog", "title": "S. Korea readies for reunions amid N. Korea’s rocket threats", "id": "dfbbc164-423d-44b4-8cf1-b18ba7a7fe3c", "content": "Amid growing speculation over the North’s fourth nuclear test, the US-based Institute for Science and global Security says that a new facility under construction at the Yongbyon complex appears to be designed to separate isotopes from spent fuel that can be used to produce powerful nuclear weapons. Pardon our skepticism, but we concur with the widely held view that it’s a test of an intercontinental ballistic missile capable of hitting the USA mainland. \n \n\n \n \n \nNorth Korea has a particularly bad reputation in the world, but the North Koreans are oblivious of that fact. \n \nRice said China is “a fulcrum of influence” for the North, referring to Beijing’s status as the main provider of economic assistance and diplomatic support for Pyongyang . \n \nThe summit comes as tensions on the Korean Peninsula flare anew after the North strongly hinted it would conduct a banned long-range rocket launch, possibly around next month’s ruling party anniversary. \n \nIn a typically bellicose statement on Tuesday , the head of the country’s atomic energy agency warned that Pyongyang was ready to deploy nuclear weapons against the U.S.at “any time” if it didn’t desist with its “reckless hostile policy”. \n \nThe AEI director said scientists had been “steadily improving” both the quality and quantity of the North’s nuclear deterrent and he issued a by-now standard warning to the US. \n \n“North Korea’s missile programs and provocative actions necessitate a firm response from the worldwide community”, the 26-nation alliance said in a statement. \n \n“Any intention or attempt to disrupt peace of the Korean Peninsula and security in Northeast Asia is unjustified and undesirable”, Wang said at a forum in the Chinese capital, where representation from North Korea was conspicuous by its absence. \n \n“Our assessment is that they have the ability to put a nuclear weapon on a KN-08 and shoot it at the [U.S.] homeland”, said Navy Adm. Bill Gortney, commander of North American Aerospace Defense Command, in a briefing with reporters in April 2014. \n \nIn December 2012, North Korea launched a three-stage rocket that placed a crude satellite into orbit. \n \n“And, we never shy away from pressing our concerns”, Rice said. \n \nThe secretive nation has previously ruled out an Iran-style deal to shut down its nuclear program, apparently concluding that it has more to gain from developing more nuclear warheads and longer-range missiles. \n \nChina is presumed to have provided North Korea with around 500,000 tons of crude oil so far this year, a similar amount that Beijing offered to its traditional ally last year, despite their apparently strained ties, the Unification Ministry said Thursday. \n \nNorth Korea has said it guarantees “true freedom and rights” to its people, but defectors in South Korea have refuted such claims. He added the underwater launch test was closely related to the development of a missile-firing submarine and represented “a first step in achieving a very serious and risky new military capability”. \n \n\n \nAmb. Sung Kim special representative for North Korea policy", "source": "Rapid News Network"}