{"published": "2015-09-26T00:00:00Z", "media-type": "News", "title": "RECIPE: Vibrant variety with Mexican mix", "id": "69ba1f64-8d7c-46c1-8622-d7d6960acbdd", "content": "T HERE are many different ways to have Mexican night at home thanks to the varieties of tacos, burritos and quesadillas. \n \nWe love having Mexican - it's an array of fresh, vibrant ingredients and you don't have to use mince. \n \nWe sometimes have fish tacos using fresh whiting, while at other times we have chicken burritos. \n \nWe even make our own flat bread - it's super easy and cheap. We have included our Mexican chicken with bean salad and yogurt recipe this week. It's a healthy Mexican dinner alternative and you will have leftovers for lunch the next day. \n \n Mexican chicken with bean salad  \n \n INGREDIENTS: Chicken  \n \n4 x chicken breasts \n \n4 tbs of tomato paste \n \n2 tbs of olive oil \n \n2 tsp of ground cumin \n \n1 tsp of ground coriander \n \nSprinkle of salt and pepper \n \n Bean Salad  \n \nJuice of 1 lime \n \n2 tbs of red wine vinegar \n \n1/4 cup of olive oil \n \n1/2 cup finely chopped red onion \n \n1/4 cup chopped fresh coriander \n \n2 red chillies, seeded and finely chopped \n \n2 cloves garlic, minced \n \n1 x 440g can of red kidney beans, rinsed and drained \n \n1 x 440g can of white cannellini beans, rinsed and drained \n \n4 zucchini, cut lengthwise into 1cm thick slices \n \nSalt and freshly ground black pepper \n \n Flat Bread  \n \n4 cups flour \n \n1 tsp salt \n \n100g butter, melted \n \n375ml milk \n \n¼ cup olive oil \n \n Spiced Yogurt  \n \n250ml of Greek yogurt \n \n1/4 tsp of ground cumin \n \n1/8 tsp of ground coriander \n \nSqueeze of lemon \n \n METHOD  \n \n Chicken : In a small bowl add olive oil, tomato paste, cumin and coriander and stir to combine well. Trim any fat off the chicken breasts and sprinkle with salt and pepper. Rub the marinade all over the breasts and allow to marinade in the fridge for at least one hour. \n \n Bean salad : Prepare the barbecue grill to heat on high. In a medium glass bowl, whisk the lime juice, vinegar and oil until slightly thickened. Add the red onions, coriander, chillies and garlic and toss gently until the vegetables are coated. Add the beans and stir to combine. Season with salt and pepper. Brush the zucchinis on both sides with olive oil. Sprinkle with salt and pepper. Grill the zucchini on a lightly oiled barbecue grill until tender, turning once, about four minutes per side. Cut the zucchini crosswise into 2cm pieces. Add the zucchini to the bowl with the dressing and beans. Toss to combine. \n \n Flat bread : Combine the flour and salt in a bowl. Heat the butter and milk in a jug until the butter is just melted. Make a well in the centre of the flour and pour the milk and butter in, gradually bringing the flour in from the sides. When the flour is all incorporated, you should have a soft dough. Knead the dough for at least five minutes on a floured surface, until it is stretchy. If the dough is too sticky, add a little more flour. Wrap the dough in plastic wrap and allow to rest at room temperature for half an hour or so. Divide the dough into eight pieces (or more, if you want smaller flatbreads) and roll out on a floured surface as thinly as you can. Heat a generous splash of olive oil in a frypan over medium high heat. When the oil is hot, place one piece of flatbread in the base. It will immediately start to bubble up. When the edges are starting to look golden and the bread is becoming less floury looking around the edges (about 40 seconds to 1 minute), flip the bread carefully with a spatula. Cook for a further 40 seconds to a minute and remove to a piece of paper towel. \n \n Spiced yogurt : Mix all ingredients together. \n \nTo assemble, eat like a taco. Rip the chicken apart and spoon on salad and yogurt. \n \nDan and Steph Mulheron won My Kitchen Rules in 2013. Visit http://www.danandsteph.com.au or find them on", "source": "Coffs Coast Advocate"}