{"published": "2015-09-06T12:39:31Z", "media-type": "News", "title": "Here's what it's REALLY like to work at Google, the 'world's most attractive' employer", "id": "742ed01b-abb2-40c3-9a96-18f1f4ea91f2", "content": "Google is quite possibly the best place to work in the world.The tech giant headquartered in Mountain View, California, frequently ranks top tier on Business Insider's Best Companies To Work For In America list, landing in the No. 2 spot this year. Google was also judged to be the World's Most Attractive Employer this year by global research and advisory firm Universum, and employee ratings on Glassdoor earned the company the No. 1 spot on Glassdoor's Employees' Choice Awards, Best Places to Work 2015.Google's more than 57,000 employees love everything the \"Googleplex\" has to offer, including free Wi-Fi-enabled shuttles to and from work, free healthy meals, laundry and fitness facilities, 18 weeks of fully-paid maternity leave for birth moms and on-site childcare, and competitive pay they report 84% high job satisfaction and earn a median salary of $133,000 after five years, according to survey data from PayScale.Laszlo Bock, Google's HR boss, explains in his book, \"Work Rules!,\" that the key to a successful workplace is constantly innovating, experimenting, and keeping things fun.\"What's beautiful about this approach is that a great environment is a self-reinforcing one: All of these efforts support one another, and together create an organization that is creative, fun, hardworking, and highly productive,\" he writes.Google has over70 offices in more than 40 countries around the world.Mayra Felix, a strategic program manager for the Americas with Google's Global Account Management team, works in the company's California headquarters.Shestarted her career at Google in 2013 as a regional account manager, and prior to that moved to the US from Ecuador to attend Georgetown University.We spoke toFelixto find out what it'sreally like to work for one of the world'stop employers.Here's what she said:SEE ALSO:Here's what it's REALLY like to work in an Apple storeCurrent roleAs a program manager, I manage and oversee projects across many areas of the business. A typical day for me consists of working cross-functionally with marketing, data, and sales teams, keeping track of performance, identifying challenges, and planning the next initiative that will move the needle in our business.As a Googler, I start my day by taking the shuttle from San Francisco to Mountain View (which has Wi-Fi so I can work if I'm awake enough!). Once at the office, I get freshly made breakfast and coffee to kick off the day. I then go to my desk, reply to urgent emails, and attend meetings.I get lunch at one of the three cafs on my side of the campus and will venture to new ones across campus if I have time. I try to take breaks by walking my coworkers' dog, getting a snack in the microkitchen, or working out at the gym if I'm feeling energetic.Hiring processGoogle's hiring process is holistic and focuses on looking for a person who's a great fit for the job, for Google, and for other things outside their core role. Each interview focuses on discovering a different aspect of a candidate's strengths.In my case, I went through five interviews focused on leadership, role-related knowledge, problem solving, and \"Googleyness.\" I was askeda series of analytical and sales-related \"fire drills\" based on real business cases. It was challenging, but they were really the type of questions I deal with on a daily basis, so I think it was great preparation for my current role.Advice for applying to GoogleDo your homework. Make sure you understand our vision, know our products, and are aware of how your unique story contributes to making Google such a special place.Also, make sure you understand the role you're applying for, the impact it brings to Google, and how your skills make you a great candidate for it. Before applying to Google I spent days watching videos on Google's cultureand early days, read articles on tech trends and Google's big bets, dove deep into product research, and reached out to my network for advice and feedback.My second piece of advice: Don't be afraid to ask questions. Asking the right questions is the key to gaining more insights, putting your curiosity to the test, and showing that you are eager to learn that is at the core of being a Googler.See the rest of the story at Business Insider NOW WATCH: The insanely successful and unorthodox life of Google founder Sergey Brin \nClick here to read full news..", "source": "Latest Nigerian News.com"}