{"published": "2015-09-22T17:46:53Z", "media-type": "News", "title": "One Direction's fifth album finally has a title: Made In The A.M.", "id": "a584d2af-fc4d-4378-bdd5-5558541f67a1", "content": "One Direction have announced that their much-anticipated fifth album will be titled Made In The A.M and released globally on Friday, November 13. \n \nThe album, which is available to pre-order now, was unveiled via a video message. \n One Direction (Charles Sykes/Invision)  \nIt follows the massive success of Drag Me Down, the first single lifted from Made In The A.M, which topped the UK singles chart, climbed to third spot in the Billboard Chart in the US and broke streaming records globally. \n [embedded content] \nTo celebrate the launch of Made In The A.M, One Direction have released Infinity, a track from the album, as a special surprise for anyone who pre-orders the album or streams through online retailers. \n  \nThe guys have an exciting announcement for you… https://t.co/J2IdOIJSYD \n \n— One Direction (@onedirection) September 22, 2015 \n \nThe song, a rousing slice of guitar pop, is written by John Ryan, Jamie Scott and Julian Bunetta, the team behind One Direction smash Story Of My Life. \n  \nSo our new album is called Made in the A.M. Can't wait for you all to hear it ! \n \n— Liam (@Real_Liam_Payne) September 22, 2015 \n \nShowcasing a more mature sound for the band, Infinity is a taster of what to expect from the forthcoming album. \n \nOne Direction will kick off the UK and Irish leg of their On The Road Again Tour with six nights at London’s O2 Arena from Thursday, September 24, as well as headlining the Apple Music Festival at the Roundhouse in London tonight supported by special guests Little Mix. \n \nNiall Horan tweeted his excitement about the gig: \n  \nCamden its Gona be fun tonight ! Who's coming down ? \n \n— Niall Horan (@NiallOfficial) September 22, 2015 \n \nBoth One Direction and Little Mix found fame on The X Factor with the boy band having gone on to enjoy global success, acquiring millions of fans who are known as ”Directioners”. \n [embedded content] \nLittle Mix, who won the ITV talent show in 2011, have also had success on both sides of the Atlantic. \n \nLast month the band hit the headlines over rumours about their future – shocking millions of devoted fans. They have confirmed they are taking a break. \n \nUnsurprisingly the news had fans taking to Twitter to voice their excitement. \n  \nThat moment when you realize that this is the first Album without Zayn… #MadeInTheAM  #EMABiggestFans1D  pic.twitter.com/4kHj8wfVfG \n \n— One Direction (@OneDrecti0nFans) September 22, 2015 \n  \nAOIFGJHUGHOGHSDOAIGHSIPGHOI´DGDFGPIAHJSAPOIHJSAPOHJSAPOJGISPJGSFIGJH #madeintheam \n \n— One Direction  (@1DFAMlLY) September 22, 2015 \n  \n@onedirection I seriously can't wait for this album to come out!!! #MadeInTheAM ❤️❤️❤️❤️❤️ I want to hear Infinity! pic.twitter.com/DxZtNgHbw2 \n \n— Abby Buehler (@AbbyAbbyb1) September 22, 2015 \n  \nSo excited about one direction new album coming out they never fail to deliver \n \n— Emma (@emgerrie31) September 22, 2015 \n  \nI feel like this is going to be @onedirection 's best album .. \n \n— AshlEEy. (@AshlEEyJauregui) September 22, 2015 \n  \nOne Direction slaying my life rn. I CANNOT be more excited for the album. afghkfjsjsjskxxndn!!! #MadeInTheAM \n \n— Shweta Deshmukh (@shweta2398) September 22, 2015 \n  \n@onedirection dfditddrjtdutduteios \n \n— makynsie (@nightskyylwt) September 22, 2015 \n  \n#Infinity is SOOO GOOD  @onedirection  #MadeInTheAM \n \n— ingrid.  (@itsjustingrid_) September 22, 2015 \n  \nI CAN'T WAIT TILL NOVEMBER 13TH @onedirection \n \n— Carmen (@cccarmennn_) September 22, 2015 \n  \nI loved the album name I am very eager to hear all the songs @onedirection  pic.twitter.com/0Vm9swzDiO \n \n— E V E R  (@099a12182dc049c) September 22, 2015 \n  \nMY EARS ARE SO BLESSED RIGHT NOW THANK YOU ONE DIRECTION THANK YOU FOR MAKING US HAPPY AND POOR AT THE SAME TIME #Infinity  #MadeInTheAM \n   \n Share article  \n   \n— lybienne✨ (@NIALLH0ERUN) September 22, 2", "source": "Gloucestershire Gazette"}