{"published": "2015-09-22T17:46:37Z", "media-type": "News", "title": "A date with destruction", "id": "c79bfe72-4cdc-4454-9804-0bbcfe5e8b3d", "content": "A cracked, weathered sign warns drivers not to park in the driveway of the old Skidmore fire station which soon will be demolished. Firemen built the station in 1960; it served as their city’s fire station for 30 years. slideshow Precinct 4 Justice of the Peace Joe Lyvers stands inside the old Skidmore fire station soon to be demolished. The station, which is adjacent to his office, was active from 1960 to 1990. slideshow One of the few remnants that indicates the Skidmore building next to the justice of the peace was a fire station is this poster and brochures with applications for the Citibank Fireman’s Credit card program. slideshow The old Skidmore Fire Station has a date with demolition.\n\nThe building, at 303 E. Sullivan St., has not been a fire station since around 1990. It is adjacent to the offices of Precinct 4 Justice of the Peace Joe Lyvers, who will shed no tears when a county backhoe does its business.\n\n“Skidmore has a lot of eyesores. Maybe tearing down this one will serve as an example for the rest of the town,” Lyvers says. “It’s just been sitting there.”\n\nWhen the volunteer fire department moved to a new station, about 10 blocks away, the old building was used for AA meetings.\n\nThe wooden building was the town’s first fire station, built around 1960. It housed two trucks and an ambulance.\n\n“It was built by donations and firemen labor,” says Ricky Bohac, the current fire chief. “It’s made of telephone poles, wood and scrap oilfield pipe.”\n\n“I would like to think some of these farmers around here would like to have the telephone polls used to reinforce the walls,” Lyvers says.\n\nAbout the only evidence of the building’s former life is a cluster of application brochures for a Citibank American Firefighter credit card.\n\nBehind the station are two, taller poles, once used to house the station’s radio antenna and siren.\n\nBohac recalls when 25 active volunteer firemen would meet at the station every Monday night for training and to perform maintenance on the trucks.\n\n“A lot of our brush trucks were homemade then,” he says. “We would take a surplus Army truck and add equipment we needed. Sometimes that truck was the only thing that can get to those brush fires.”\n\nToday, the department claims only 15 active members. “We’re hunting for members,” he says.\n\n“Scratch a volunteer fireman,” he predicts, “and more than likely you will find an adrenaline junkie.”\n\nBohac doesn’t view the station with much nostalgia.\n\n“We went through some pretty tough financial times,” he remembers, “but, we managed to pull through.”\n\nAt Christmas, firemen would decorate the interior for the group’s annual party for members and their families.\n\n“I kinda grew up with it,” he says. It’s the best way to give back to the community.”\n\nBohac has been fire chief since 2000.\n\nOnce Bee County commissioners approve the use of county equipment, the county’s Road and Bridge department will demolish the old station. While not mourning its demise, Bohac does admit “we had a lot of fun times there.”\n\nBill Clough is a reporter at the Bee-Picayune and can be reached at 343-5222, or at beepic@mySouTex.com.", "source": "My Soutex"}