{"published": "2015-09-02T10:22:53Z", "media-type": "Blog", "title": "3 Tips for Finding (and Embracing) Your Personal Style", "id": "d63e978b-9c80-4266-8a74-9b77780563f9", "content": "Style isn’t just about what you wear. It’s how you express and empower yourself. The clothes on your back are just one of the many ways you convey that. A lot of times people try to put style in a box: trendy, preppy, formal, etc. – but like most things, no one’s style fits inside one little box. \n \n\n \nWith a lot of you starting class, internships and work, you be thinking of whether you should try to tweak your style for the new season. After all, you could use your back to school budget to completely overhaul your style, right? It’s tiring trying to keep up with what’s cool or embrace a style that’s not really you; it’s much easier to take time to come into your own and highlight your true self. Remember: this is your year. But if you’re not exactly sure what your style is in the first place, here’s a short 3-step guide to figuring it out! \n How to Find Your Personal Style  \nLook for keywords, not categories – The terms above – trendy, preppy, formal – aren’t going to be complete representations of your unique style. They’re great categories for placing an outfit in, but you likely don’t rep them every single day. Instead, think of how you’d describe yourself, like daring, experimental, laidback. Let these words help you pull clothes off the rack for the dressing room. That way when you look at a piece, you can see whether it will embody your spirit, not put you in a box. \n \nMake tweaks, don’t overhaul – Be real, how many of you want to start from scratch with your closet at times? I like to think of myself as always evolving, not completely transforming. As humans, it’s practically our jobs to change over time, slow and steady. Style works the same way. If you’ve changed from last year – you’re willing to take more risks, less into checking in with trends, hoping to come off as more mature – now is the time to find clothing that reflects that. No need to go too crazy, just add those words to your original list. \n \nPut an end to the comparison game – Now is the time to be inspired, not envious. Your peers and coworkers’ styles, the blogger of the moment, street style inspiration on Pinterest , there’s a wealth of information out there. But once you stop being inspired and start making comparisons, it’s time to separate yourself form those sources. If you struggle with comparison, try this: the moment your mind begins to compare your look to the one on your digital feed, shut it down. Close your laptop or put your phone in your pocket. You can’t always remove yourself from the person sitting next to you, but when your comparison is digital, it’s best to try a little self-induced timeout. Before logging on, empower yourself with positive thoughts and self-love. \n \nHow do YOU embrace your personal style? Share with me below! \n \n<3 Mish \n \nThe post 3 Tips for Finding (and Embracing) Your Personal Style appeared first on MichellePhan.com .", "source": "MichellePhan.com"}