{"published": "2015-09-09T16:21:18Z", "media-type": "News", "title": "Outward Hound® Acquires Nina Ottosson Puzzle Games & Toys", "id": "03286dc0-8abd-4f5c-a6a9-6c73be1ebaca", "content": "SOURCE Outward Hound \n\nAdd-On Acquisition A Game Changer For Pet Product Company \n\nDENVER, Sept. 9, 2015 /PR Newswire/ -- Outward Hound®, a portfolio company of The Riverside Company, has acquired Nina Ottosson Puzzle Games & Toys (Zoo Active Products AB) in a deal announced today. This is the second acquisition for Outward Hound® since being acquired by Riverside in August 2013. Offering new global distribution channels and entry into new product segments, the move will advance Outward Hound's mission to improve the lives of pet parents with meaningful innovations.  \n\nWinner of the 2015 Pet Age Women of Influence Award and named one of \"45 People Who Changed The Dog World\" by Dog Fancy Magazine, Nina Ottosson has pioneered the design and development of dog games and puzzle toys that utilize reward-based play patterns to keep pets stimulated. By exercising the dog's mind and body, these unique treat puzzles prevent boredom, improve digestion and help strengthen the bond between pet parents and their pups.  \n\n\"Since 1990, Nina Ottosson has consistently contributed some of the most innovative products in the pet space and our new partnership will be a huge win-win,\" said Outward Hound® CWO (Chief Woof Officer) Kyle Hansen. \"Nina's expertise will be invaluable for future product development and her influence in the dog trainer and behaviorist community worldwide cannot be overstated.\"  \n\n\"We are thrilled to become a part of the Outward Hound® family,\" said Nina Ottosson. \"They are the ideal partner to help accelerate our distribution and expand the ways that we can innovate and continue to improve and enrich pets' lives.\" \n\nThe deal signals Outward Hound's own expansion into Europe with the opening of a new distribution center in the Netherlands as well as a new EU office that will be run by Nina and her staff.  \n\n\"We're excited to add Nina's line of products to the Outward Hound® portfolio,\" said Riverside Vice President Steve Rice. \"This strategically complimentary combination creates exciting opportunities and a new platform for growth for the Outward Hound® brand.\"   \n\nAbout Outward Hound  \n\nOutward Hound® is a Riverside Portfolio Company that is an award-winning innovator, creator, manufacturer and distributor of the highest quality toys, games, gear and feeders for pets and pet parents.   \n\nLearn more at outwardhound.com and nina-ottosson.com. \n\nMedia Contact:   \n\nMichael Parness  \n\nOutward Hound  \n\nmichael.parness@outwardhound.com  \n\n303-792-9600  \n\nRelated Links: \n\nPhoto - http://photos.prnewswire.com/prnh/20150909/264845LOGO \n\nPhoto - http://photos.prnewswire.com/prnh/20150909/264844LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/outward-hound-acquires-nina-ottosson-puzzle-games--toys-300139992.html \n\n©2015 PR Newswire. All Rights Reserved.", "source": "KUSI.com"}