{"published": "2015-09-23T09:12:03Z", "media-type": "Blog", "title": "Research Associate (Digital Creativity Hub) – University of Goldsmiths – deadline 9 October 2015", "id": "f409f384-f16e-4d27-810e-4ee49cab00cb", "content": "https://jobs.gold.ac.uk/vacancy/research-associate-digital-creativity-hub-229868.html Department: Computing\nVacancy Type: Fixed-Term\nFull-Time/Part-Time: Full Time\nSalary: £36,009 – £40,161\nInterview Date: w/c 19 October 2015\nContact Details: Rose Hepworth\nClosing Date: 09/10/2015\nRef No: 171\nDocuments: Job Description (Word, 38.46kb) The Digital Creativity Hub (DC Hub) is a major (£18 million) investment by two UK research councils, four universities, and over 80 collaborative stakeholder organisations to create a world centre of excellence for impact-driven research in digital creativity, which will launch in late 2015. The DC Hub will focus on digital interaction and media convergence: digital games, interactive media and the rich space between. In the DC Hub researchers, industry, government, the third sector and the general public will co-create the means for interaction and expression in the future digital society, jointly realising the huge potential of games and interactive media for economic, social and cultural impact. Research ideas will find a fast route into the commercial space through close partnerships between the Hub and industry. Within the DC Hub scientists, social scientists, government and the third sector will work together to harness the enormous potential of games and interactive media to achieve social good. The DC Hub will engage with museums, galleries and publishers of games and media to maximise the positive impact of the digital world on creative culture. We have a growing group of more than 80 collaborative partners (over half of them small- and medium-sized) across digital games, media, heritage, museums and galleries, education, healthcare and analytics. We also have strong support from key organisations such as the Knowledge Transfer Network, TIGA, UKIE, Game Republic, funding agencies and local and national government. The project is seeking to appoint a Research Associate to work on the core research themes of: Art, Data Visualisation, Virtual Reality, Graphics, Interactivity, Procedural Content Generation and Design under the DC Hub Project, performing research work and carrying out software design and development work. The successful applicant will work with a range of collaborators in multiple disciplines across two principal sites: at Goldsmiths and at the Hub site at the University of York, as well as working with partners at other UK sites. You should have a PhD in an appropriate computing, scientific or art discipline or equivalent work experience or publication record in the games, computing and movie special effects industries, or other Creative Industries. It is essential that you have a proven track record in software development and design in some or all of the domains of Data Visualisation, Art, Graphics, Interactivity, Virtual Reality, Procedural Content Generation and Design. Based at Goldsmiths. Strong candidates with a preference for living in the York area and being based at The University of York, should not be deterred from applying. Candidates will be expected to undertake regular travel between locations, and the cost of this will be met by the DC Hub.", "source": "chris joseph"}