{"published": "2015-09-25T01:13:28Z", "media-type": "News", "title": "China's Xi arrives in Washington DC for first state visit", "id": "88eb2437-93ce-452d-ada0-905a90d0ccac", "content": "Chinese President Xi Jinping has arrived in Washington for talks with US President Barack Obama. Key themes are expected to be Chinese cyber spying, economic policies and the territorial disputes in the South China… \r \nChinese President Xi Jinping has arrived in Washington for talks with US President Barack Obama. Key themes are expected to be Chinese cyber spying, economic policies and the territorial disputes in the South China Sea. \n\nWashington rolled out the red carpet for President Xi on Thursday evening, hastily replacing Vatican banners in front of the White House with Chinese flags. \n\nThe Chinese president was greeted at Andrews Air Force Base by United States Vice President Joe Biden, soon after Pope Francis left the US capital for New York. Xi stood shoulder-to-shoulder with Biden as a band played the US and Chinese national anthems. \n\nA private working dinner between Xi and Obama was scheduled at the Blair House, the official US guest residence across the road from the presidential mansion. Washington officials said key issues of division would start to be addressed at the low-key meal. \n\nThe two leaders took an informal walk to the dining venue from the White House's West Wing. \n\nThe full pageantry of a state visit was to be reserved for Friday, when Xi will be given a 21-gun salute, and a formal summit and news conference will take place before a black-tie state dinner. Meanwhile, US first lady Michelle Obama was scheduled to take Xi's wife, Peng Liyuan, to the National Zoo, to see the giant pandas. \n\nAmong the issues that divide the US and China is that of cyber security , with Washington threatening sanctions against Chinese companies and individuals that it claims have stolen US trade secrets. \n\nPressure to 'open up' \n\nObama is also expected to urge Xi to put into effect economic reforms that would make the Chinese economy more open to foreign competition. The US president was also thought likely to address China's increasing assertiveness in the South China Sea, where Beijing has been staging a military build up and land reclamation exercise. \n\nThe issue of human rights could also find its way onto the agenda, but is not expected to be central. Protests were expected outside the White House from rights…", "source": "MyInforms"}