{"published": "2015-09-21T17:36:13Z", "media-type": "News", "title": "Nottinghamshire Police 'took two days to investigate Amber Peat sighting'", "id": "b616b2ee-5fa4-4b4f-a600-4290a04e0e21", "content": "Police took two days to investigate a sighting of missing 13-year-old schoolgirl Amber Peat close to where she was found dead, a report has found. \n \nThe Independent Police Complaints Commission is looking into Nottinghamshire Police's search for the missing teenager after her body was discovered in Mansfield, Nottinghamshire, on June 2. \n \nDocuments released by the IPCC reveal a member of the public told officers about a girl who matched Amber's description disappearing into the bushes close to her home on Bosworth Street on Sunday, May 31. \n \nBut the intelligence was not followed up until 48 hours later, when officers went with the caller to the location where Amber's body was found. \n \nThe IPCC's initial assessment says there were \"significant concerns\" with the search for the schoolgirl, including officers only upgrading her disappearance to \"high risk\" 16 hours after she went missing following a family dispute. \n \nAmber was reported as a missing person by her family at 12.56am on May 31 and was classed as a medium risk, and this was only increased to high risk at 4.55pm. \n \nThe report said: \"It is very worrying to read this matter was classed as medium risk on its initial assessment, I am of the opinion that this should have been categorised as high risk. Given that Amber was merely 13 years of age and had an extensive history as a missing person, I am of the view that this scenario constituted a high risk. \n \n\"My concerns have heightened given the officers actions when handling potential leads. After scrutinising the incident report, I do acknowledge Nottinghamshire Police recieved a copious amount of suggestions for Amber's location. \n \n\"However, given that Amber was located at the same scene that they were informed about on 31/5/2015, I am of the view that the investigation may need to scrutinise how officers handled the intelligence. \n   Promoted stories   \n\"I also note that soon after this incident was reclassified as high risk, intelligence was receieved from a member of the public which ultimately would lead to the discovery of Amber's body. \n \n\"Therefore, it will be for the investigaftoin to consider whether this incident had been classified as high risk fom the outset valubale intelligence could have been obtained sooner.\" \n \nNottinghamshire Police's log, which was submitted to the IPCC, said: \"On June 2 officers spoke to the member of the public who had called the police on May 31. In order to identify the location of the sighting they went with the caller to the location they had last seen the female. \n \n\"Officers found her body well hidden within a large thicket of bushes. \n   \n Share article  \n   \n\"It appears she died before the member of the public made contact with the police and before she was reported missing.\" \n \nAs well as the IPCC investigation, Amber's death will also be the subject of an inquest and serious case review.", "source": "York Press"}