{"published": "2015-09-12T14:00:00Z", "media-type": "News", "title": "How to make a spring vegie garden", "id": "3b590f67-0838-476d-9286-1eefb1363e5c", "content": "THERE'S nothing better than fresh herbs and vegetables from your own garden. With temperatures warming now's the time to start planning for produce such as lettuce, spinach, peas, zucchini, pumpkin, tomatoes and strawberries. \n \n Step 1. Prepare the soil  \n \nBefore you plant any vegetables, prepare your garden beds by digging the soil and adding organic compost at least 1-2 weeks before you start planting. Most vegetables only need 15-20 centimetres of good soil for their roots to grow. If you're planning to grow crops with deeper roots, like potatoes or carrots, dig and compost deeper - up to 30 centimetres. Water-in the compost and let it break down before you plant your vegetables. To get the most out of your vegetable garden, choose vegetables that you will use and plant seasonally. \n \n Step 2: Planting seeds  \n \nDraw a line in the soil with your finger to the depth prescribed for your chosen vegetable seed. Sow seeds at the specified distance apart and cover with soil. Water well. \n   \n Step 3: Planting spinach  \n \nSpinach is a good source of vitamin A and one of the healthiest sources of minerals and nutrients that you can grow. Gently remove the spinach plants from their container and separate each plant. Use the gardening trowel to dig a hole deep enough, so that the leaves are sitting just above the soil and cover the roots. Plant the rest of the spinach in a row, about 30 centimetres apart. \n \n Step 4: Planting peas  \n \nPeas are easy to grow and also help to improve the soil you're growing them in. Take each pea plant out of its container. Dig a hole deep enough for the peas, so the leaves are sitting just above the soil. Put the peas in the hole, and then fill it in. When planting your peas, remember that they will need some kind of support as they grow, so take that into account when working out the distance between them. Ideally they should be about 30 centimetres apart. \n \n Step 5: Planting onions  \n \nOnions are a popular vegetable because they are easy to grow and don't take up a lot of space in your garden. After taking the onion seedlings out of their container, separate each plant by gently washing them in a bucket of water to get rid of the soil. Separate each plant and dig a shallow trench. Plant each onion plant in the trench and cover the roots with soil. \n   \n Step 6: Fertilise your vegetable plants  \n \nVegetables need regular fertilising when they're growing. To give yours a good head start, and to help with the shock of being transplanted, dilute a seaweed concentrate, approximately two capfuls in 10 litres of water in a watering can. Soak your vegetables in this mixture. \n \n Step 7: Apply mulch  \n \nMulch helps your plants grow in a number of ways. As it breaks down it will provide nitrogen to the soil and your plants, keep the roots cool in summer and stop weeds from growing in your vegetable garden. Apply the mulch around your vegetable plants but not touching them. If the mulch gets wet it can rot the plant. \n \n Step 8: Water the vegetables  \n \nTo give your vegetable garden a good start, water the plants at least every day for the first few days. Then reduce the amount of water you give them, which will encourage the plant's roots to grow deeper as they look for water. This will also help the plant to grow, establish itself and produce home-grown food for your kitchen table. \n   \nNEXT SATURDAY: Don't miss our interview with Indira Naidoo, author of The Edible City, plus the launch of our Free Seeds garden giveaway. \n \n Tools:  \n Bucket and water  Gloves  Dust mask  Watering can  Gardening trowel  Materials:  Seaweed extract  Sugar cane mulch  Vegetable seeds and seedlings  \nAll tools and materials are available at your local Bunnings Warehouse. Visit http://www.bunnings.com.au", "source": "Gympie Times"}