{"published": "2015-09-16T22:22:19Z", "media-type": "News", "title": "Dalai Lama Tickets: CapitalCityTickets.com is Slashing Their Prices on Dalai Lama Tickets for his 2015 Tour Dates for Cities like Salt Lake City, Amherst, and Philadelphia", "id": "f92a6a34-8cf0-4e41-83f2-ac393097b360", "content": "Buy Dalai Lama Tickets Online at CapitalCityTickets.com with Promo Code Dalai Lama concert tickets for their 2015 tour dates are on sale now for cities like Salt Lake City, Amherst, and Philadelphia. Trusted secondary ticket market provider CapitalCityTickets.com is providing Blind Guardian fans with a promo code CITY5 to save an additional 5% on all orders. \nCapitalCityTickets.com  carries a vast selection of Dalai Lama tickets at affordable prices. Dalai Lama is visiting the US in 2015 and kicking it all off on October 18 th  in Salt Lake City, UT. \n\nThe Dalai Lama is a monk of the Gelug or “Yellow Hat” school of Tibetan Buddhism, the newest of the schools of Tibetan Buddhism founded by Je Tsongkhapa. The 14th and current Dalai Lama is Tenzin Gyatso. \n   \nCLICK HERE  to browse all levels of seating for Dalai Lama at CapitalCityTickets.com \n\nDalai Lama tickets are always a popular and highly searched for ticket. CapitalCityTickets.com stocks all levels of seating and price ranges to all Dalai Lama events! \n\nCapitalCityTickets.com also offers a safe online buying experience for Dalai Lama tickets. \n\nSave time and money with CapitalCityTickets.com \n\nFollow on Social Media for Special Deals and Discounts: \n\nFacebook:  http://www.facebook.com/CapitalTickets \nTwitter:  http://www.twitter.com/CapitalTix \n\nCapitalCityTickets.com   \nLive Customer Support  \nOrder By Phone Toll Free 7 Days a Week \n(855) 514-5624 \n\nBrowse the inventory of tickets for Dalai Lama at CapitalCityTickets.com today and save!  http://www.capitalcitytickets.com/Dalai-Lama-Tickets \n\nDisclaimer: CapitalCityTickets.com is not associated with any artists, teams, venues, organizations, institutions, bands, or artists featured on their website in any way.   Also, any names or titles used in this press release are solely for descriptive purposes and do not imply, indicate, or suggest any type of affiliation, partnership, or endorsement. \n\nCapitalCityTickets.com is a reliable online marketplace serving the secondary market with tickets for all major concerts, sports, and theatre events. Online shoppers can take advantage of Promo Code “CITY5” while tickets last. \n\nCheck out the discount codes online for all upcoming events. CapitalCityTickets.com keeps low overheads which allow this trusted ticket site to keep prices competitive. \n\nCapitalCityTickets.com | Live Customer Support | Order By Phone Toll Free | 7:00am-1:00am EST | (855) 514-5624 \n\nMedia Contact \nCompany Name:  CapitalCityTickets.com \nContact Person: Media Relations \nEmail:  Send Email \nPhone: 1-855-514-5624 \nCountry: United States \nWebsite:  http://www.capitalcitytickets.com/Dalai-Lama-Tickets \n\n\nSource: www.abnewswire.com", "source": "Marketplace"}