{"published": "2015-09-18T15:13:46Z", "media-type": "News", "title": "Potts Law Firm Files 90 New GM Ignition Switch Claims in St. Louis", "id": "ba92b817-c59f-45e8-a97f-16a88fda3086", "content": "]]> \n\nST. LOUIS , Sept. 18, 2015 /PRNewswire/ -- Attorneys from the Houston and Kansas City offices of the Potts Law Firm, LLP , have filed a new lawsuit against auto manufacturing giant General Motors LLC (NYSE: GM) in St. Louis City Circuit Court on behalf of 90 individual victims of a deadly ignition switch defect that led to the recall of more than 28 million GM vehicles worldwide and has caused more than 120 deaths and thousands of injuries. \n\nThe new claims for serious injuries and wrongful death follow this week's announcement that GM will pay a $900 million criminal settlement as part of a deferred prosecution agreement with U.S. Department of Justice for misleading the government and the public about the company's handling of the faulty ignition switches. \n\nThe Potts Law Firm represents hundreds of individuals and their families in lawsuits against GM in Missouri courts and other jurisdictions across the U.S. The new claims filed in St. Louis allege that the GM ignition switches caused vehicles to shut off while being driven, prevented protective airbags from inflating, and caused seatbelts to malfunction. The new filing is Patricia Foreman , et al. v. General Motors LLC . Overall, the firm represents nearly 150 ignition switch victims in St. Louis . \n\nAccomplished trial attorney and Potts Law Firm Managing Partner Derek Potts represents the families of Tabatha Rogers , 26, and Tara Yates , 27, who died in 2014 when their car unexpectedly careened off a level stretch of highway. Their case is tentatively set for trial in January 2016 in St. Louis . \n\nMs. Rogers lost control of her 2001 Pontiac Grand Am on the day after Valentine's Day on old State Highway 35 in Sevier County, Tennessee . The car hit an embankment before becoming airborne and striking a utility pole. Ms. Rogers died at the scene and Ms. Yates died shortly after at a nearby hospital. Mr. Potts says he plans to prove that a faulty GM ignition switch caused the fatal crash. \n\n\"We believe the evidence clearly shows that these young women would still be here today if not for an ignition switch that General Motors knew was defective,\" says Mr. Potts. \"It is extremely telling that airbags in their car didn't inflate at any point despite this violent, fatal wreck.\" \n\nThe Houston -based Potts Law Firm represents clients in a variety of personal injury claims and mass tort matters, from complex pharmaceutical cases to automobile defect cases to product liability claims. The firm currently is accepting new GM ignition switch cases and referrals. Visit www.potts-law.com   for more information. \n\nFor media interviews or to discuss your GM ignition switch case, please contact Bruce Vincent at 800-559-4534 or bruce@androvett.com . \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/potts-law-firm-files-90-new-gm-ignition-switch-claims-in-st-louis-300145573.html \n\nSOURCE  Potts Law Firm, LLP", "source": "Sys-Con Canada"}