{"published": "2015-09-04T17:40:51Z", "media-type": "Blog", "title": "For the first time ever, the US women’s final sold out before the men’s.", "id": "930a7155-aa91-4561-a7d7-52a72ad2e971", "content": "They’re calling it the ‘Serena Williams’ effect. Want a ticket to the women’s final of the US Open? WELL YOU CAN’T HAVE ONE. For the first time ever, the US Open women’s singles final sold out before the men’s singles final.\nAccording to ESPN, there are often empty seats at the women’s final. However this year the grand slam hasn’t started yet (it starts on Monday,) and yet there are no tickets left. And it’s all because of Serena Williams. If Williams wins the finals of the US Open she will be the first woman to win all four grand slams in a single season since Stefi Graff (Graff did so back in 1998). On top of all her glory on court, Serena Williams has been winning battles off court too.  She recently called out body shamers who referred to her as ‘manly’.?= display_ad('x18', 'hidden-xs hidden-md mm_incontent', 'MM In Content'); ??= display_ad('x20', 'visible-xs mm_mob_incontent', 'MM In Content (Mobile)'); ? (Post continues after the video)… Williams took to the media to call out her body shamers, telling America’s abc news, “I just don’t have time to be brought down. I have too many things to do, you know. I have Grand Slams to win. I have people to inspire. And that’s what I’m here for.” And in other sporting news this week… Our women’s cricket team, The Southern Stars, have regained the Ashes by defeating England on home turf. The host’s secured a five-wicket win over Australia in Cardiff last Monday, but it wasn’t enough to take out the test. The Southern Stars had already secured the Women’s Ashes overall in the multi-format series with a 20-run win at Hove on the 28th August.  Australia thrashed England by 161 runs in an earlier test in the series. Australia’s women’s water polo team has finished in a disappointing fourth place at the Kazan World Championships, leaving the Stingers coach Greg McFadden with some difficult decisions to make ahead of an Olympic training camp.  Training at the mid-September camp will give the players and coaches time to re-group before the 21-member squad is cut down to a final 13 for the Olympic team.\nFinally to netball, Melbourne Vixens defender Jo Weston will be joining the Diamond’s squad for Australia’s four-test Constellation Cup against New Zealand next month. The 15-player squad includes nine players returning from Australia’s World Cup victory in August and four debutants, including 21-year-old Weston. The team will head to Christchurch for the series starting on October. What spot have you been watching or playing this week? Join the conversation No comments", "source": "Mamamia"}