{"published": "2015-09-24T15:50:28Z", "media-type": "Blog", "title": "The USA needs to CONTROL Space !   Must have Shuttle Capabilities!", "id": "75fec7f2-b6c1-4020-8089-a98cfc6f636e", "content": "Ben Carson: Okay. Well, you know, as I've mentioned, we have enormous energy resources. We have enough natural gas to last for over 1000 years if we just waste it. And we now have the ability to liquefy it, which means we can export it, uh, and, uh, you know, really if we get rid of the silly energy exportation rules, um, we can make Europe and other places dependent on us for energy rather than on Putin. And, uh, that can have a profound effect in terms of his adventurism, so we can use our energy and those sources. We sit between two oceans. Can you imagine all the hydroelectric power that is available to us if we begin to do the appropriate types of research into that? And a lot of the money that we generate, once we get over our aversion to using our energy appropriately, can be used to fund the research into other renewable energy sources. So, you know, these things don't have to be polar opposites with one group on this side and one group on this side throwing barbs at each other. We can work in a cooperative way, uh, because development of energy is critical for our future. And, you know, I, you know, I…I think about these things a lot and all the different interlocking parts. You know, I would bring back our space program, uh, because we discovered so many things. It's not so much that I'm interested in men walking on Mars, but look at all the things that – and, uh, we use in our everyday life that came out of the space program. Your cell phone. You know, that came out of the space program. And new energy sources will come out of that. A whole bunch of things will come out of that, not to mention the fact that we need to have control of space. Not the Russians and not the Chinese, because it's going to eventually impact upon our security.\rSent from my iPad", "source": "Keep the shuttle flying"}