{"published": "2015-09-25T05:26:59Z", "media-type": "News", "title": "Lightfoot wins Boss of Moss", "id": "f9068264-1e16-4f77-9211-722bf5940cee", "content": "Adin Masencamp during the competition. \n  \nSOUTHERN CAPE NEWS - Dylan Lightfoot (Jeffreys Bay) triumphed over Sebastian Williams and Joshe Faulkner, both from Jeffreys Bay in the premier U/20 Boys division of the Boss Of Moss surfing contest hosted in Mossel Bay last weekend. \n\nIt was Williams who took the initiative early on, taking to the air and pulling-off an incredibly high air 360. This sparked a fire in Lightfoot, which sent him into the air on the very next wave. Not to be outdone, goofy-footed (surfs with his right foot forward) Faulkner launched a backhand air to reverse but was unable to hold on. Three waves ridden with back-to-back air 360’s, a fitting climax to what was a very successful event. \n\n“It was a really cool event,” commented a stoked Lightfoot afterward. “It’s always nice coming to Mossel Bay, I seem to always get good results here and the waves are usually really fun!” \n\nNicole Pallet (KZN) took out the highly completive U/20 Girls division ahead of Ollie Brand and Sophie Bell. Tristan Lev – who has based himself in Cape St Francis this year – took out the U/16 Boys division ahead of some big names. Ever the dark horse, he once again showed why he will be force in the future of South African surfing. \n\n“The final day saw awesome waves with lights winds making for very contestable conditions,” commented contest organiser Llewellyn Whittaker after the event. \n\n“The Boss of Moss in it’s first year was a huge success. Events like these are only achievable by a team effort, people who are passionate about what they do and why they doing coming together with one goal on mind,” Whittaker commented. \n\n“Special thanks to Jo Krone for going the extra mile and Albert Phillipson and Chris Dunt for all his hard work behind the scenes,” he said. \n\nThe event saw over 90-entrants jam packed into five divisions, which made for 25 heats per day over the two days, some 16 hours of surfing. \n\nThe Von Zipper Expression Session, held under floodlights on the Saturday evening was also a huge success. The format different from traditional ‘expression sessions’ – where there is one heat with a whole bunch of surfer in the water – in that it had four heats of 20 minutes each with four surfers in each heat. \n\n“The kids were rather nervous but had a great time despite the howling onshore,” Whittaker said. “The NSRI where awesome, they braved the windy and cold conditions till the very last heat. \n  \n Surfer Dylan Lightfoot from Jeffreys Bay overcame Sebastian Williams and Joshe Faulkner, both also from Jeffreys Bay in the premier U/20 boys division of the Boss Of Moss surfing contest.   \n\nPhotos: Llewellyn Whittaker \n\n'We bring you the latest Garden Route, Klein-Karoo, Hessequa news'", "source": "Knysna-Plett Herald"}