{"published": "2015-09-03T14:09:12Z", "media-type": "News", "title": "Mediacom Business Provides Affordable Gigabit Broadband Service to the Burlington Community School District", "id": "e980d482-987a-4fd0-8361-3606e17a6ab8", "content": "PRWeb \nActing on their commitment to help schools and libraries realize their best return on federal funds to subsidize ultra-fast Internet connections in classrooms and libraries, Mediacom Business, a division of Mediacom Communications Corporation, today revealed details about providing affordable 1 Gigabit broadband service to one of the largest school districts in the region, Burlington Community School District (BCSD). \n\nIn preparing for the return of 4,000 students to the District's 15 individual locations this fall, William Brackett, Supervisor of Technology for BCSD, said he faced extensive bandwidth needs to handle the sheer volume of individual users seeking Internet access simultaneously. \n   \n\"Right now, students in grades 6-12 have a device, and next year it will be grades 3-12,\" said Mr. Brackett. \"That's why it's important to have a pipe with bandwidth that is ready to scale for our students and teachers. Mediacom Business came to us with their Gigabit+ Fiber Solutions™, and I'm confident this 1-Gig service will meet and exceed our needs.\" \n\nMr. Brackett reflected on a well-known past initiative in Iowa called the Decorah Eagle Cam, when students and teachers alike watched streaming video 24 hours a day of a bald eagle hatching eggs. He said every classroom across his District was streaming this event simultaneously and crashing the system as a result. \n\n\"Events like this emphasized to the District that we needed high capacity bandwidth so every school day could be a day to access events and information from around the world without interruption,\" Mr. Brackett continued. \"The infrastructure provided by Mediacom Business is transparent to our students and teachers. They no longer have to wonder if they can get online or not, and having this infrastructure will allow our teachers to experiment and try new things.\" \n\nMediacom Business leveraged its existing fiber infrastructure connecting all 15 BCSD locations, according to Dan Templin, Senior Vice President of Mediacom Business. \"The already-built network, combined with new E-rate funding, gave BSCD an extremely affordable opportunity to scale their broadband to 1-Gig, and also accommodate future growth,\" said Mr. Templin. \"As a cloud-based school district, it was also critical that the BCSD have a network that was powerful and reliable to connect to the cloud.\" \n\nMr. Templin explained that the federal subsidies available to schools and libraries for broadband expansion are part of a plan administered by the Federal Communications Commission (FCC) known as E-rate. \"Because of this FCC initiative, it's estimated that 10 million students and teachers will be connected to the Internet next year who otherwise would not be online,\" stated Mr. Templin. \"Mediacom Business has the experience, certifications, and expertise to support these E-rate initiatives in the communities we serve.\" \n\nAbout the Burlington Community School District \n\nThe Burlington, Iowa Community School District (BCSD) is among the largest school districts in the region, with some 4,000 students in 15 individual locations. Burlington Community School District strives to have a profoundly positive impact on each student's adult quality of life brought about by students' individual and collective educational experiences. Core values include high expectations, outstanding educators, unsurpassed opportunities, nurturing respect, developing citizenship, and supporting tolerance. Long-range goals of the BCSD are to develop and reward positive work habits, increase productive partnerships with family and community, increase student engagement, continuously improve student growth and achievement, and maintain a safe and positive classroom environment. Go to http://www.bcsds.org for more information. \n\nAbout Mediacom Communications \n\nMediacom Communications Corporation is the eighth largest cable operator in the U.S. serving about 1.3 million customers in smaller markets primarily in the Midwest and Southeast. Mediacom offers a wide array of information, communications and entertainment services to households and businesses, including video, high-speed data, phone, and home security and automation. Through Mediacom Business, the company provides innovative broadband solutions to commercial and public sector customers of all sizes, and sells advertising and production services under the OnMedia brand. More information about Mediacom is available at http://www.mediacomcc.com . \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12940398.htm \nPRWeb.com", "source": "Wall Street Business Network"}