{"published": "2015-08-12T13:41:43Z", "media-type": "Blog", "title": "Sierra Valley Museum of Medical History in Sacramento", "id": "abe09c7a-de78-4ba9-ac69-d04d169a70bb", "content": "When I was exploring Sacramento, I attempted to visit Sutter’s Fort but it happened to be closed for renovations when I was there. Since I had time to kill before my plane I scoured the internet for something else to do and stumbled upon this unique medical museum. I headed over to check it out and I was glad I did as it had a ton of fantastic and strange old medical tools and after visiting it made me happy to be living in the time that I currently do. Here is all the info. \n \n\n \nDetails \n  Hours: Closed Sat-Sun, Mon-Fri: 9AM-4pM  Cost: Free  Location: 5380 Elvas Ave, Sacramento, CA 95819   \n\n \nOne of the best parts about this museum is that it is completely free. It does not appear to be super popular based on what one of the workers told me, but I found it to have a lot of interesting stuff, especially for a free museum. \n \n\n \nThe museum itself is just in a hallway and one room on the bottom of a medical research facility. When you walk in, the first thing you will see is an old iron lung device that was used to help people with Polio. It was a crazy contraption, they even had marketing materials from the time period showing people using it.  \n \n\n \nNext to that there are a lot of instruments in a glass case with the most interesting thing for me being the collection of different types of fake eyes.  \n \n\n \nFrom here you can head across the hall into the main room of the museum where everything is located. The items on display include things ranging from an old nurse uniforms to wooden wheelchairs. It is overwhelming how much stuff they have. Below are a few photos. \n \n\n \n\n \n\n \nOne of the most interesting things for me was seeing the area based on leeches. I have always found it pretty crazy that they used leeches in the past so I enjoyed reading about how there are still a few areas where they use leeches now as well.  \n \n\n \nThey also had a history of the bed pan in the corner, I doubt the history of the bedpan is on display in very many other places. \n \n\n \nLastly, there was this big old dental cabinet against one wall. I am not even sure what the tools that go with the cabinet look like, but just the cabinet and the creepy doll mimicking a child, made me glad for the dentist I have. \n \n\n \nAll in all I explored the Sierra Valley Museum of Medical History for about a half hour and learned a bunch of new things about medical tools. Sure, this is not for everyone, but it is a good free museum if you are looking to kill some time in Sacramento. Let me know your thoughts if you have been in the comments. ", "source": "California Through My Lens"}