{"published": "2015-09-16T03:58:01Z", "media-type": "News", "title": "Neonode Stock Rating Upgraded by Zacks (NEON)", "id": "43c17491-4cbc-4580-a989-8d1885502287", "content": "Neonode (NASDAQ:NEON) was upgraded by Zacks from a “sell” rating to a “hold” rating in a report released on Tuesday, Market Beat reports. \n\nAccording to Zacks, “Neonode is a company that designs, develops and sells patented technologies and products focused on unique user experiences. With offices in Stockholm, Sweden and San Ramon, California, Neonode Inc. is a company with licenses and products sold worldwide through both direct web sales and local distribution partners. “ \n\nIn other Neonode news, Director Per Ivar Gosta Bystedt purchased 20,000 shares of the firm’s stock in a transaction that occurred on Wednesday, July 1st. The stock was purchased at an average cost of $3.01 per share, with a total value of $60,200.00. The acquisition was disclosed in a filing with the SEC, which is available at the SEC website. Also, Director Mats Dahlin purchased 10,000 shares of the firm’s stock in a transaction that occurred on Monday, August 10th. The shares were acquired at an average cost of $2.61 per share, with a total value of $26,100.00. The disclosure for this purchase can be found here. \n\nA number of other brokerages have also weighed in on NEON. Cowen and Company reissued an “outperform” rating and set a $10.00 price target on shares of Neonode in a research note on Friday, August 7th. Ascendiant Capital Markets reduced their target price on Neonode from $7.00 to $6.00 and set a “buy” rating on the stock in a research note on Friday, August 7th. \n\nNeonode (NASDAQ:NEON) traded up 2.03% during midday trading on Tuesday, hitting $3.01. The company had a trading volume of 75,086 shares. The stock’s market cap is $121.98 million. The stock’s 50-day moving average price is $2.66 and its 200-day moving average price is $3.28. Neonode has a 52-week low of $1.72 and a 52-week high of $4.83. \n\nNeonode (NASDAQ:NEON) last issued its quarterly earnings results on Thursday, August 6th. The company reported ($0.04) earnings per share (EPS) for the quarter, beating the Thomson Reuters’ consensus estimate of ($0.05) by $0.01. The company earned $2.80 million during the quarter, compared to analyst estimates of $2.72 million. On average, equities research analysts expect that Neonode will post ($0.12) EPS for the current fiscal year. \n\nNeonode Inc., is a technologies and solutions company. The Company is engaged in development and license user interfaces and optical infrared touch technology. The Company provides Touch Technology and Solutions to the customers. Touch Technology, is a various technologies for touchscreen and touch-enabled surfaces available in the market with differing profiles, power consumption, level of maturity, and cost. The main types of touchscreen technologies available include: Capacitive technology, technology used in the Apple iPhone, and Resistive technology, technology used in automatic teller machines. Solution, provides Optical Infrared and Controller Chips. Optical Infrared, develops user interfaces and optical infrared touch solutions. Controller Chips, provides NN1001 and NN1002 controller chips designed to simplify integration, reduce cost, and increase performance. \n\nTo get a free copy of the research report on Neonode (NEON), click here. For more information about research offerings from Zacks Investment Research, visit Zacks.com \n\nReceive News & Ratings for Neonode Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Neonode and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News"}