{"published": "2015-09-06T05:57:13Z", "media-type": "News", "title": "'No' vote on constitution pushes Thai elections back to 2017 at earliest", "id": "56bcafc1-9fa4-46f9-a1b7-2bcbbca1a8a3", "content": "The junta-stacked legislature prolongs the junta's rule after the draft constitution was widely criticised. \n\nBangkok: Thailand's military has prolonged its direct rule of the country after a junta-stacked legislature voted to reject a new constitution.\n\nThe National Reform Council's rejection of Thailand's 20th constitution, by 134 votes to 105, will push back any prospect for elections and a return to civilian rule while the military maintains its firm grip over the country's often turbulent politics.\n\nThe military toppled Thailand's democratically-elected government to seize power in May last year.\n\nMilitary members on the council backed away from endorsing the constitution in response to criticism of it by almost all of Thailand's political parties.\n\nThe new charter would have significantly weakened the parties, using a system where it would have been much harder for any one party to win an overall majority, forcing the formation of multi-party coalitions.\n\nBut analysts said no matter what the vote, the military would benefit.\n\nIf the charter had passed it would have enshrined a military-dominated 23-member politburo-style committee to co-exist alongside parliament that would have had the power for five years to take over at any time in what it deemed a crisis situation.\n\nBorwornsak Uwanno, chairman of the drafting committee, said the proposed body - called the National Strategic Reform and Reconciliation Committee - would be a \"special tool\" to ensure a smooth transition to democracy and prevent future coups.\n\nThe \"no\" vote means the process of drafting another constitution will start again, delaying any election until 2017 at the earliest.\n\nThe Pheu Thai party, which was ousted from power last year, described the constitution as \"totally disregarding the sovereignty of the Thai people\".\n\nPheu Thai's rivals in the pro-military Democrat Party called for it to be rejected pending further discussion.\n\nWhat ordinary Thais thought about it is unknown, because the military did not allow it to be debated.\n\nA small group of protesters who defied orders not to protest were arrested on Sunday.\n\nThailand is currently using an interim constitution drafted by the junta last year. It gives sweeping unchecked powers to the junta led by former army commander Prayuth Chan-ocha.\n\nThailand has had on average a new constitution every four years since the end of the absolute monarchy in 1932.\n\nThe vote came at a time of unease in the county over the health of 87-year-old King Bhumibol Adulyadej, a faltering economy and an unprecedented bombing in central Bangkok on August 17 that killed 20 people and injured 120 others. The story first appeared on The Sydney Morning Herald.", "source": "Oberon Review"}