{"published": "2015-09-18T18:22:11Z", "media-type": "News", "title": "Cooking with N.C. apples", "id": "9fc6e7f3-dda9-4970-b0c8-881407543c55", "content": "This week’s cool, crisp mornings have reminded me that apples are officially in season in North Carolina, with the harvest continuing through October. \n  \nNorth Carolina is the seventh largest apple-producing state in the nation. The state’s apple crop is mostly grown in four regions around Cleveland, Haywood, Henderson and Wilkes counties, according to the N.C. Department of Agriculture. \n      \nGrowing up in Asheville, I have fond memories of apple picking in Henderson County, the largest apple-producing county in the state. \n \nEach fall, my family took the short drive to Stepp’s Hillcrest Orchard, a fourth generation working farm just northeast of Hendersonville. The Stepp family has been inviting guests to pick their own apples for 45 years at its “U-Pick Apple Orchard.” \n \nA not-so-fond memory from my childhood involves the crabapple, the only native North American apple variety. A large crabapple tree in our backyard frequently shed the small, sour fruit across our yard. Perhaps the most dreaded of our chores, my brother and I were responsible for picking up the often-rotten crabapples scattered in the grass before my parents mowed the lawn or hosted a backyard party. \n \nThere are plenty of apple orchards to visit in Wilkes County this fall. To see a list, visit www.visitwilkesboronc.com/explore/attractions/orchards . \n \nEven if you can’t make it to an apple-picking orchard, there are plenty of other ways to savor fall’s sweetest flavor in the coming weeks. \n \nJust around the corner, the Brushy Mountain Apple Festival will be Oct. 3 in downtown North Wilkesboro. From 8 a.m.-5 p.m., you can enjoy mountain heritage exhibits, music, crafts and food—including, of course, a bounty of apple products. \n \nBelow are a few recipes (two sweet, one savory) that highlight the fruit. \n \nApple crumb pie \n \n2/3 cup sugar \n \n2 tablespoons all-purpose flour \n \n3/4 teaspoon ground cinnamon \n \n6-8 apples, pared, cored and sliced (6 cups) \n \n1 9-inch unbaked pastry shell \n \n1/2 cup all-purpose flour \n \n1/4 cup sugar \n \n1/4 cup cold butter \n \nCombine first 3 ingredients; stir into apples. Turn apple mixture into pastry shell. Combine remaining flour and sugar, and cut in butter until crumbly. Sprinkle over apples. Bake at 400 degrees for 45 to 50 minutes or until done. If pie shell browns too quickly, cover the edge with foil. \n \nApple cheddar sage frittata \n \n8 eggs \n \n1 tablespoon milk or cream \n \n1 tablespoon butter \n \n2 shallots, thinly sliced \n \n4 ounces pancetta (or bacon) finely diced \n \n1/4 teaspoon cinnamon \n \n1 red apple, cored and diced \n \n4 ounces cheddar cheese, in small cubes \n \n1 tablespoon sage, finely chopped, plus extra whole leaves for topping \n \nSalt and pepper to taste \n \nPreheat oven to 350 degrees \n \nIn a bowl, beat eggs with milk, salt and pepper. Set aside. \n \nHeat a cast iron skillet on medium heat. Melt butter and add shallots, cook for 2 minutes. Add pancetta and cook another 2 minutes. Add diced apple. Cover skillet and cook until apples begin to soften, about 5 minutes. Add cinnamon and stir to combine. Spread shallot, apple and pancetta mixture evenly throughout skillet. Add egg mixture. Cover and cook without disturbing 6 minutes or until edges begin to set. Sprinkle with chopped sage and diced cheddar. \n \nTransfer skillet to oven and bake 7-9 minutes so the eggs can finish setting. Serve directly from skillet. Serves 6-8. \n \nItalian apple torta (torta di mele) \n \n1 cup butter \n \n4 golden delicious apples \n \n2 1/4 cups flour \n \n1 tablespoon baking powder \n \n1/2 teaspoon cinnamon \n \n1/2 teaspoon salt \n \n4  large eggs \n \n1 teaspoon vanilla extract \n \n1 cup sugar \n \n1 tablespoon amaretto liqueur \n \n1/2 teaspoon lemon zest \n \n4 tablespoons butter, melted \n \n3 tablespoons sugar \n \nWhisk together flour, baking powder, salt and cinnamon and set aside. \n \nIn a large mixing bowl, cream butter and sugar. Add eggs one at a time, beating well after each addition. Beat at medium speed for 3 minutes until mixture is pale yellow in color, creamy and thick. Turn speed down and gradually add flour mixture. Add lemon zest, vanilla and amaretto until blended; increase speed to medium for 2 more minutes. \n \nPeel, quarter, core and slice apples into 1/2-inch-wide slices. Cut half of the apple slices into small chunks and fold them into batter. \n \nPour batter into a buttered and floured 9-inch springform pan. Arrange remaining apples slices, core side down, on top of the batter in circles over the entire surface with edges slightly overlapping. The apple arrangement should resemble a flower in full bloom. \n \nBrush apples and batter with melted butter and generously sprinkle with the remaining 3 tablespoons sugar. \n \nPlace in center of oven and bake at 350 degrees for 70-90 minutes, until cake pulls away from sides of pan and the top of the cake is golden brown. \n \nRemove from oven and allow to cool on a wire rack for 15 minutes, then remove sides of the springform pan and cool cake completely. \n \nDust powdered sugar with cinnamon all over the cake.", "source": "Wilkes Journal Patriot"}