{"published": "2015-09-25T00:00:00Z", "media-type": "News", "title": "From art school to brew master: Half Acre cofounder pays homage to SAIC with anniversary beer", "id": "6823e9fb-db7e-4782-a05c-ba33fc6179fc", "content": "The beverage industry is about giving back to the community. Producers of craft beer and spirits possess an underrated power, humbly changing water into magical elixirs that give us lushes life. But Half Acre Beer Company co-founder Gabriel Magliaro is taking the community service act to another level by giving back to a place that’s partially responsible for his success. Introducing Harshad kolsch, a super-clean beer with an earthy, citrusy nose, brewed specially for the 150th anniversary of his alma mater, the School of the Art Institute of Chicago. The beer was released at a private event for SAIC alumni, but the curious can head to the Lincoln Square taproom (4257 N. Lincoln Ave.) for a pint on draft ($5) or a bomber ($7.99 and worth it for the label), while the beer lasts. \n\nMagliaro, 37, went to SAIC from 2001 to 2003 and worked in advertising for three years after he graduated. Before SAIC, he lived in Colorado, where he got a taste of the culture behind microbreweries, and though he didn’t see himself opening a brewery while in school, it eventually became his dream job. Half Acre got its start in 2006, brewing with Sand Creek Brewing Company in Wisconsin when there wasn’t much going on in Chicago’s craft beer scene. Magliaro teamed up with Matt Gallagher, and the two took off from there. Now, the pair operate two brewing facilities—the original in Lincoln Square with a taproom and a new 60,000-square-foot, 30-barrel brewhouse (2050 W. Balmoral Ave.) in Bowmanville, where flagship beers such as Daisy Cutter are produced and that soon will house a restaurant and biergarten. Magliaro sat down to chat about Harshad and how an art school kid rose to running a successful business.  \n\nTell me about the name Harshad. What does it mean? \n \nMagliaro: Harshad is a mathematical reference to the number itself, 150, but it’s also a Sanskrit word that means joy seeker. [Half Acre and SAIC] thought that was very appropriate, seeing as the artistic process really centers on that—whether it’s on the creative’s side or on the observer’s side. \n\nWhat did you study at SAIC? \n\nI studied visual communication, photography and writing. The great thing about the school is you can experience a lot of different things while you're there, and it can be as narrow or as broad as you choose. … I got to experience a range of ideas that tie back to Half Acre and being an entrepreneur almost perfectly because doing what we do for a living, just being an entrepreneur and starting a business, you really have to be proficient, if not good, at a lot of different things and be able to tackle different subject matter quickly and effectively. \n\nComing from an art school, were you ever fearful about starting your own business and not having a cut-from-the-fabric business background? \n\nSure. Still am. I think that’s part of the gig kind of. I think the types of insecurities change. They exist today, but different types of fears. But I did not go to business school. I did not have an MBA. Getting into this, that factual, raw tax-law mindset was not something I possessed, but I think what I did have was some guts and also the ability or confidence to think about things creatively. I could bob and weave in a way that allowed me ... to think creatively about what was happening and how to approach it, and that certainly speaks to my experience at the school. … A lot of things that you might learn in business school are out there right now in books, but at art school and SAIC, that sort of ongoing training in the process of creativity, you can’t really access that in the same way. \n  \nYou take a very creative approach to your business, and I think some people are really stuck in this idea that business-minded people have to be really clean-cut and uncreative. \n \nBut the challenge is to interject your art into whatever you're doing, so you have to really be willing to define or redefine whatever your undertaking is and apply your arts education or the way you think into making your artwork. Here, it was about looking at how we approach making beer when we’re doing it, our labels and how we communicate and interjecting ourselves in a way that best suits our creative self. When I was at school, I saw [Mark Bello] from Right-On Futon speak—he went to the Art Institute—and at the time, he had this corner store at Milwaukee and Division, and he talked about, like, “I sell futons, but every month in my window I have a revolving display,” and they were really good. I can remember going by them all the time. So he took it upon himself to interject that part of him in what he was doing. So you gotta get out there and apply your creativity wherever you land, and there is that outlet \n\nAny other inspirations? \n\nJust the Right-On Futon guy. [Laughs.] No, everywhere there were little bits, and I try to be a student of everything. Today we don't pretend to have this mapped out. We’re very much still students of this, and it's an ongoing learning process and we'll try to evolve. We’ll try to be the same type of students from ’06 until whatever it is, we’ll keep going. \n\nIt's interesting that you have such a creative background, but when you started in the craft beer scene, it wasn't necessarily super creative. \n\nNo, it was definitely the opposite at the time. It was really about regurgitating the same sales over and over with the same institution brewers. That was an initial challenge for sure, but we had a part in changing that, and also the world around us was changing. People were thinking differently about consumption in general, whether that was what they were drinking or what they were consuming from a buyer's perspective. Just the makers’ movement as a whole, people were all of a sudden interested in [trying new things], and that's been an essential advantage with us being able to do what we do. \n\nMoney can be an intimidating factor for any business, and it's especially something that hinders artists who get in their heads about not having money. So were you sitting on a gold mine? \n\nOh, God no. We started brewing at another brewing company because we couldn't afford to do this, which is not uncommon. We didn't possess a lot of the things to build a brewery at the time … and we started making beer up north and bringing it back to Chicago and begging people to try it. That was pre-’08 market collapse. Matt and I wrote up a business plan and we pitched some banks, and they bit. They loaned us what we thought at the time was a colossal amount of money, and we knew some other brewers in Colorado, they had just built their new brewery, so we offered to buy their entire old brewery. \n  \nWhat’s your advice to students on how they can be better artists? \n \nReally think about the definition of what that is. I would say don't be afraid to completely define it and redefine it and redefine it again. It's really just about taking a creative approach to life and to really get after it. A lot of what allowed us to do this was risk and laying it out there and working a lot of hours. … The success of the early days of Half Acre was on our sweat. It’s really not any more complicated than that. I think we made some good choices, but we did it at the expense of ourselves. ... And hopefully you're doing something you feel really good about. Otherwise, I can't imagine it happening any other way. If I wasn’t pumped about really everything, start to finish—what we were making, who I was working with, the people coming in and connecting with it—if all that didn't feel right to me, we would have definitely bailed or something because it's hard enough if all of those things feel good. Definitely shoot for things that feel good, and don't be afraid to sweat a bunch. \n  \nSince Half Acre was one of the early breweries in the Chicago craft scene, you could very easily just keep doing what you're doing and be successful, but do you find that other new breweries popping up challenge you? \n\nSure, but I'd say they uplift us too. Just doing [Harshad] is a way for us to invigorate [ourselves] and invigorate the people that are drinking our beer and connect back to the community and serve Chicago and probably will stand as an example for other breweries too. That's something you can do, connect with an educational institution that meant something to your business and highlight your path through what they do. So I’d say we [challenge] other people, and we have others that [challenge] us, and it's a positive thing. \n\nFor more eat & drink news, click here . \n Copyright © 2015, RedEye", "source": "Red Eye Chicago"}