{"published": "2015-09-04T16:55:35Z", "media-type": "News", "title": "Teen killed in Loudoun Co. shooting identified", "id": "192c0701-f12a-4a1b-bf8d-1da9870b1352", "content": "Students react to death of Loudoun teen  \n Michelle Basch, WTOP  \n  http://wtop.com/wp-content/uploads/2015/09/2-student-shot-mba.mp3 \nDownload audio  \n  \nWASHINGTON – A Loudoun County teen was killed in a morning shooting near a school bus stop in Sterling that led to tight security measures at multiple schools in the area. \n \nDanny Centeno Miranda, 17, was a student at Park View High School and he was gunned down in a neighborhood not far from the school’s campus, according to the Loudoun County Sheriff’s Office. \n \nMiranda transferred to the high school in January 2014 and officials believe that he came to the area after leaving El Salvador, says Wayde Byard, spokesman for Loudoun County Public Schools. \n \nThe teen wasn’t an active participant in student activities and he wasn’t a troublemaker, says Byard. \n \n“According to the principal, he was an under (the) radar kid,” he says. \n \nSheriff Mike Chapman says the teen knew his attackers and that the shooting was not a random crime. \n \nTwo or three suspects involved in the shooting ran off. Chapman says investigators knew where at least two of them were and were looking for the possible third. \n \nMultiple shots were fired about 8:30 a.m. at the corner of East Cornell Drive and North Duke Drive as children waited for the bus, Chapman says. \n \nThe area where the shooting occurred is a few blocks off Sterling Boulevard, which is home to multiple county schools. Park View High is just a few-minute drive away. \n \nSchool officials took extra security precautions including keeping the school locked down throughout the day and additional police patrols at dismissal. \n \nStudents “stayed in first period all day,” Byard says. \n \nSix other nearby schools were placed on “lockout mode,” which means the exterior doors of the school are locked, but normal school activities continue. It differs from lockdown mode, under which interior doors are locked and students must stay in their classrooms. \n \nCrisis counselors will be on hand all next week to help students, Byard says. \n \n“This is the first time a lot of these students have dealt with death. So you can image emotions are rather high right now,” he says. \n \nWTOP’s Neal Augenstein and Michelle Basch contributed to this report from Sterling, Virginia. \n \nThe post appeared first on WTOP .", "source": "WTOP"}