{"published": "2015-08-09T07:01:02Z", "media-type": "Blog", "title": "Weekly Achievements for 02Aug15 thru 08Aug15", "id": "ddd3c909-ee01-46de-aae1-b8b471e97fd4", "content": "(0 comments - 370 views) \n#1 Video Ronda Rousey on her physique and \"Do Nothing Bitches\" by iaui \n\nWhy CG Sucks (Except It Doesn't) by ant \n\nEpic Response After Motorcycle Wreck by eric3579 \n\nWhen you don't have money for a fancy exhaust.. . by blacklotus90 \n\nI Want To Report This Man For Slinky Abuse!!!! by Barseps \n\nVery Cool Rare BridgeType - The Newport Transporter Bridge by eric3579 \n\nAWKWARD!! (Public Display of Affection ALERT!) by eric3579 \n\nStephen Colberts Heartfelt Thank You To Jon Stewart by eric3579 \n\nJust Another Day In The Snake Room by newtboy \n\nUltimate Pomeranian Sneeze by nock \n\nJon Stewart's Last 'Bulls**t' Rant On 'The Daily Show' by PlayhousePals \n\n\nTop 15 Videos Science of Stupid - Big Boys and Their Toys by PlayhousePals reached #2 \nPeople hate Bill Nye? by PlayhousePals reached #2 \nWould Love To Play Counter Strike With These Guys by eric3579 reached #2 \nIndoor kitty must hunt for food by PlayhousePals reached #2 \nAnti-Christian Discrimination in Arkansas by RFlagg reached #2 \nFast Food Drive Thru Robot Driver Prank by eric3579 reached #3 \nCharger prototype finding its way to Model S by ctrlaltbleach reached #3 \nDownhill mountain bike run, filmed cinematically in one take by fuzzyundies reached #3 \nCome on Barbie Let's Go Party by Daldain reached #3 \nDeadpool - Redband Trailer by RFlagg reached #3 \nHesitant horse masters a ditch by YearofthePuma reached #3 \nWhy are there dangerous ingredients in vaccines? by PlayhousePals reached #3 \nWhose Line Scenes From a Hat: Breakfast by SDGundamX reached #3 \nSpongebob bass pants by blacklotus90 reached #3 \nLast Week Tonight with John Oliver: Washington DC Statehood by mintbbb reached #4 \nLab is terrible at filling the kiddie pool by PlayhousePals reached #5 \nMaster Penman Jake Weidmann by RFlagg reached #5 \nHow to end a relationship by Mordhaus reached #5 \nSpider Car-French Electric Off Road Vehicle by newtboy reached #5 \nZoolander 2 - If god exist then why did he make ugly people? by eric3579 reached #5 \nAh....the calmness of the sea...the beauty of the...WHOA!!!! by Barseps reached #5 \nB-e-a-u-t-i-f-u-l Bouncing Bubbly Backlash . by Barseps reached #5 \nSurfing A Wave On A Dirt Bike by eric3579 reached #5 \nBattle of the Old Spice spokesmen by PlayhousePals reached #6 \nA Clown Takes A Pratfall-Wait For It by newtboy reached #6 \nMan Stuns Family By Shaving Off His Beard After 14 Years by oritteropo reached #6 \nStrongbad freaks out about the death of Flash by blacklotus90 reached #6 \nSpace cat in quiet contemplation by PlayhousePals reached #7 \nMassive Crane Failure In The Netherlands by eric3579 reached #7 \nMeeting The Most Amazing Person At An S&M or M&M Party by eric3579 reached #7 \nThe Dancing Strawhats by nock reached #8 \nAustralian Cliff Diving Champion....Dog by newtboy reached #8 \nKTLA Reporter Wendy Burch Scared on LIVE TV in Los Angeles by ant reached #8 \nGerman Cranes Just Showing Off by eric3579 reached #8 \nRobot Butler by lucky760 reached #8 \nStar Wars EP 4: Laser Moon Awakens by blacklotus90 reached #9 \nReplacing the 100 year old control system in the NYC subway by oritteropo reached #9 \nJim Henson vs Stan Lee. Epic Rap Battles of History Season 4 by Zawash reached #9 \nKevin Bacon Complains About the Lack Of Male Onscreen Nudity by Barseps reached #10 \nCompilation Of Amazing Watches by newtboy reached #10 \nRHNB vs Floral Foam - Not the result you might think by Mordhaus reached #10 \nYou go to bathroom at night, and there.. . by oritteropo reached #11 \nHitchBOT Murdered in Philadelphia by nanrod reached #11 \nCop Frees Baby Skunk From Yogurt Container by oritteropo reached #11 \nEPIC View of Moon Transiting the Earth by Grimm reached #11 \nStructure Fire from Firefighter's helmet cam by Enzoblue reached #12 \nCanada vs. USA -- Debates by notarobot reached #12 \nGiant Minion Escape And Attack In Dublin . by Barseps reached #12 \nFIFA Bribe for North Korea 2026 World Cup by Mordhaus reached #13 \nWhat is Dark Energy and Dark Matter? by shagen454 reached #14 \nVery Good Tribute to Hayao Miyazaki by RFlagg reached #14 \nDeadpool Trailer Official by OverLord reached #14 \nHow to start a VW Beetle with a flat battery by oritteropo reached #14 \nKorean Dubstep Mannequin . by Barseps reached #15 \nScience of Stupid - Falling Down Ladders by PlayhousePals reached #15 \n\nTop Comments And that's how baby Tesla's get made . by ex-jedi (15 votes) \nSkunk: \"HOW FUCKING LONG IS THIS TUNNEL???\".. . by Payback (13 votes) \nHow bout this .. . by eric3579 (12 votes) \nCalls other people sheep. Gets all his opinions from.. . by gorillaman (10 votes) \nThe worst part is that now that he's dead, some other.. . by dag (9 votes) \n\nMost Votes Cast Why CG Sucks (Except It Doesn't) by ant (68 votes) \nI Want To Report This Man For Slinky Abuse!!!! by Barseps (62 votes) \nWhen you don't have money for a fancy exhaust.. . by blacklotus90 (54 votes) \nEpic Response After Motorcycle Wreck by eric3579 (53 votes) \nVery Cool Rare BridgeType - The Newport Transporter Bridge by eric3579 (49 votes) \n\n\n\n- siftbot", "source": "Latest Blog Entries  at VideoSift.com"}