{"published": "2015-09-22T21:34:39Z", "media-type": "News", "title": "Kevin de Bruyne and Raheem Sterling star as Manchester City crush Sunderland", "id": "31472719-740a-455e-8ceb-ab0edf9e6014", "content": "Kevin de Bruyne and Raheem Sterling were on top-form as Manchester City cruised  to a 4-1 Capital One Cup victory at Sunderland to end a two-game losing run in explosive fashion. \n \nThe £100million duo tore the Black Cats apart on a night when the Barclays Premier League leaders demonstrated a brutal efficiency in front of a largely horrified crowd of 21,644 at the Stadium of Light. \n \nSergio Aguero started the ball rolling from the penalty spot before De Bruyne, Vito Mannone's own goal and Sterling made it 4-0 by the break to extend bottom-of-the-table Sunderland's first-half goals conceded tally for the season to 17 in just eight games and make Ola Toivonen's late header irrelevant. \n \nCity boss Manuel Pellegrini made just three changes to the side beaten 2-1 at home by West Ham at the weekend - the club's second reverse inside five days - as Willy Caballero, Martin Demichelis and Fernando replaced Joe Hart, the injured Eliaquim Mangala and Fernandinho. \n \nAs a result, his team was eye-wateringly strong for an early domestic cup-tie, but even the Chilean could not have dreamt what would happen during a remarkable opening 45 minutes. \n \nSunderland had actually started the brighter when hapless full-back Patrick van Aanholt clumsily barged Jesus Navas to the ground as he carved his way into the penalty area and Aguero expertly dispatched the resulting 10th-minute spot-kick past goalkeeper Mannone, whose evening was to deteriorate much further. \n \nThe Black Cats thought they were back in it within six minutes when Fabio Borini out-muscled Nicolas Otamendi and fired past Caballero, only for referee Roger East to rule that he had fouled the defender in the process, much to the ire of home fans still contesting City's penalty. \n   Promoted stories   \nSweden international Toivonen should have levelled with a 25th-minute header after meeting debutant DeAndre Yedlin's cross with a firm header, but he picked out Caballero. \n \nBut once De Bruyne had embarrassed Mannone at his near post seconds later after exchanging passes with Sterling with 25 minutes gone, the game was heading only one way. \n \nThe Italian was culpable once again as he could only push full-back Bacary Sagna's cross into Sterling's path, although he was unfortunate to see the midfielder's initial shot come back off the post and go in off his body. \n \nSterling did not need the help of the woodwork nine minutes before the break when he beat Mannone comprehensively after being played in by De Bruyne, and had Aguero not tried to be too clever after rounding the keeper five minutes later and allowed Yedlin and Sebastian Coates to cover back, it would have been 5-0 at the break. \n   \n Share article  \n   \nCity picked up where they had left off with Sterling passing up two opportunities to add to his tally within the opening five minutes of the second half, but Jeremain Lens tested Caballero with a well-struck 63rd-minute effort as the home side battled on gamely. \n \nCaballero blocked Borini's 73rd-minute shot with his legs after Yedlin had slid him in, but there was nothing he could do to prevent Toivonen from glancing a header past him from another Yedlin cross with seven minutes remaining.", "source": "Chelmsford Weekly News"}