{"published": "2015-09-22T09:30:00Z", "media-type": "Blog", "title": "September 22 - The Kind and Faithful God", "id": "d78e2671-74b5-424a-884c-adcb1e5c75bf", "content": "Today's Reading:\nGenesis 23:1-24:51\nLuke 5:12-28\nPsalms 9:1-6 \nClick on Text Link to Read Online\nFocus Verses: Genesis 24:26-27\n26 Then the man bowed down and worshiped the LORD, 27 saying, \"Praise be to the LORD, the God of my master Abraham, who has not abandoned his kindness and faithfulness to my master. As for me, the LORD has led me on the journey to the house of my master's relatives.\"\nInsight:\nWhen the time came for Isaac to have a wife, Abraham sent his most trusted servant to find a wife from among the kinsmen Abraham had left behind. The servant was extremely faithful to Abraham. On his journey, he displayed responsibility, focus, honesty, and faith, and he was continually in prayer. God blessed his way and gave him success.\nResponse and Action:\nI want to be a faithful servant—faithful to God and to others. I want to approach the tasks and responsibilities God has given me with a whole heart. I need to avoid distractions, pray continually, and be faithful and honest. I want to approach my days, my tasks, and my challenges with a prayerful attitude and with eyes ready to see how God is providing.\nO Lord, help me to be a good steward of all you have given me. Grant me the wisdom and the will to guard my heart, feed my spirit, stimulate my mind, and care for my body. Help me, by faith, to do the good things you've prepared in advance for me to do. To be fruitful, faithful, and effective as a husband, father, son, brother, friend, neighbor, and co-worker. Through Christ, I pray. Amen.\nSpiritual Formation Verses: Matthew 25:23\n23 \"His master replied, 'Well done, good and faithful servant! You have been faithful with a few things; I will put you in charge of many things. Come and share your master's happiness!' Resources:\nHow To Read Genesis by Tremper Longman", "source": "Useful Breath"}