{"published": "2015-09-01T08:30:00Z", "media-type": "News", "title": "Fonesalesman Empowering Homes With Wireless Charging FurniQi Range", "id": "28079d60-00ce-4a9b-8891-20bf322ac691", "content": "/PRNewswire/ -- \n \nFurniQi side table is the first in the range of furniture from leading innovators in wireless technology   \n \nFonesalesman, the experts in wireless charging solutions, have today announced an all-new range of products designed to combine stylish furniture and wireless power. \n \n     (Photo: http://photos.prnewswire.com/prnh/20150831/262488 ) \n\n \nThe first product to be released in the FurniQi range, the side table, features wireless charging technology seamlessly integrated into its smart and minimalistic design, which blends into any home or office environment naturally. \n \nBuilt using hand-harvested Mao Zhu Bamboo, material which is beautiful, resilient and pleasant to the touch, the table is easy to assemble and compliments any decor. \n \nBavan Palasanthiran , Founder of Fonesalesman, comments, \"Marking our entry into the world of furniture, we have put a lot of thought into the table's design and usability. The FurniQi side table is incredibly easy to assemble taking a mere 60 seconds from opening up the box to having a complete table ready to charge your device. This table brings wireless power naturally to your home, making charging your smartphone more convenient than ever.\" \n \nThe table's minimalist and simple design means that it can blend in with ease as a bedside, lounge or hallway table, or used to add some style to the office.   \n \n\"Stylish and practical furniture has never been so useful\", comments Palasanthiran. \"Something that has so effortlessly complimented your daily environment is now also paving a way towards a truly wireless future.\" \n \nIt was announced that all of the FurniQi range, including the side table, will be infused with Qi technology, an interface standard for wireless charging developed by the Wireless Power Consortium. It is supported by countless phone manufacturers including Samsung, LG, Sony, Microsoft and many more. \n \nWireless charging is a smart and convenient way to power your device. The technology enables users to quickly and easily drop their phone to charge, then simply pick it up and go. This effortless efficiency helps us to move one step further into a world free of wires.   \n \nWith latest Samsung flagships, Samsung Galaxy Note 5 and Samsung Galaxy S6 Edge+, many current and upcoming Google Nexus and Microsoft Lumia devices supporting wireless charging out of the box, consumer awareness of this technology has doubled in the last 12 months. Now is the time that people want to know more about how easy it is to use and what they need to start charging their phone wirelessly at home and on the move. \n \nTo find out more about the FurniQi wireless charging range visit http://www.furniqi.com . Signing Up will entitle early access to details about the FurniQi range and Early Bird perks in its imminent crowdfunding campaign, going live in October 2015 . \n \nAbout Fonesalesman   \n \nFonesalesman is determined to make a world without wires a reality for its customers. They are responsible for the Nature-Infused WoodPuck: Bamboo Edition and the First Completely Wireless Mobile Battery QiStone+, both of which have received great praise from consumers and critics alike. They launched an incredibly successful Indiegogo campaign which introduced iPhone users to Wireless Charging for the first time with iQi Mobile, surpassing the initial campaign goal by more than 500%. \n \nLinks:   \n \nFurniQi Mini Site: http://www.furniqi.com \n \nMain Website: http://fonesalesman.com \n \nSOURCE Fonesalesman", "source": "PR Newswire UK"}