{"published": "2015-09-30T20:29:00Z", "media-type": "News", "title": "Mariano's considering delivery service", "id": "3ff6eca5-2001-4811-88d9-dcba9bf5655d", "content": "Count Mariano's among the grocery store chains trying to gauge consumers' appetite for home delivery. \n\nBob Mariano, chairman and CEO of Mariano's parent company Roundy's, said the company is researching delivery. Mariano didn't tip his hand much beyond that but said the key would be for such a service to complement the in-store experience of visiting one of the 33 Mariano's in the Chicago market. \n \n\"We are studying it very closely,\" Mariano said in an interview Monday. \"It's something we're very aware of. … Most people still like to visit the store. So, it's not one thing or the other. There's no one way.\" \n\nCurrently, Instacart, a third-party delivery service, shops for customers who request groceries from Mariano's, said Mariano's spokesman Jim Hyland, who added that Mariano's does not partner directly with Instacart. \n \nWhat the company is studying is whether it should offer a grocery delivery service directly, Hyland said. \n\nGrocery delivery options have proliferated in the past year or so, with companies like Amazon and Google rolling out service in various markets. Meanwhile, Wal-Mart has expanded its own model of online shopping and pickup. \n\nThe first Mariano's store opened in 2010. Since then, the chain has expanded rapidly, boosted by the acquisition of 11 former Dominick's stores. The 34 t h Mariano's, which will be its largest store in Chicago proper and located in the NewCity development in the Goose Island neighborhood, is expected to open next month. \n\nReflecting another industry trend for experience-based shopping, Mariano's stores offer various opportunities to eat and drink while you shop, such as a sushi bar and a barbecue restaurant among others. The future of grocery stores will involve \"more technology, more interaction,\" Mariano said. \n\n\"You can't be in the middle. You have to differentiate yourself,\" Mariano said. \"That's in all retail.\" \n\ngtrotter@tribpub.com \n\nTwitter @GregTrotterTrib", "source": "Supermarket News"}