{"published": "2015-09-25T22:03:49Z", "media-type": "News", "title": "Video Wesley Snipes Talks Being Michael Jackson's 'Bodyguard' September 18, 2015", "id": "10ad5c8b-476e-4bc2-9009-477bf994c771", "content": "Michael Jackson  went epic with his video for 1987's \"Bad,\" recruiting Martin Scorsese to direct a lengthy short film about urban gangs with choreography nods to West Side Story . Among the sprawling cast was a young Wesley Snipes, who played \"Mini Max\" – and while the actor went on to higher-profile work in films like 1991's New Jack City , his brush with the King of Pop remains a formidable notch on his resume. Snipes reflected on the experience Thursday on The Tonight Show , recalling how he became Jackson's \"de-facto\" bodyguard during the Harlem shoot.  \n Sidebar    Reaching Out: The Best Michael Jackson Slow-Jams »  \n\"I auditioned for Scorsese and Q – Quincy Jones – and they selected me out of, I don't know, maybe hundreds of guys who auditioned,\" Snipes says in the clip. After Fallon asks about his impressions of Jackson, Snipes tells the hilarious story – earning uproarious laughs from Questlove and the Roots.  \n \n\"The great Michael: the inspiration, the muse,\" he says. \"Michael was very interesting – very, very interesting. He actually was a little nervous filming in Harlem because we filmed some of the 'Bad' video there in Harlem ... He was a little nervous because the fans were a little ambivalent with him. Some of them loved him. Some of them hated him. So you hear them literally yelling out, 'Michael Jackson! We love you! Oh my God – I want to have your baby.' And you have other people going, 'You ain't bleep ! Michael Jackson, you ain't never coming back to the 'hood! Michael Jackson, what you do for us?'  \n \n\"So Michael turned to me and was like, 'Are you scared?'\" he continues. \"I was like, 'Yo, Mike, what are you talking about?' 'Are you scared? Really, are you scared?' I was like, 'No, Mike, this is Harlem, baby! This is where we grew up. They love you. Really, you're scared?' He was like, 'A little.'\"  \n \n[embedded content] \n \nSnipes jokes that he was \"demoted\" from actor to \"bodyguard.\" But he says the unorthodox gig was worth it: \"I'd do it again any time,\" he says. \"He was such an inspiration, such a wonderful talent.\"", "source": "Rolling Stone"}