{"published": "2015-09-29T17:59:14Z", "media-type": "News", "title": "Inside Jim Carrey's relationship with tragic girlfriend and how he was her rock after her dad's death", "id": "cb125296-87f0-4b63-a553-8d42984b1a2e", "content": "By The Hollywood star and aspiring actress dated on/off from 2012 and split again just days before she killed herself         Get daily news by email         Jim Carrey and Cathriona White      \n Jim Carrey was a huge support to girlfriend Cathriona White when they first got together as she was grieving the loss of her father. \n \nThe Hollywood star and aspiring actress started dating in 2012 and the new couple were seen on holiday together around the time she flew back to her native Ireland for her dad's funeral. \n \nA source exclusively told Mirror Celeb: \"Her father suffered from a long-term illness and Jim was Cathriona's rock when he passed away.\" \n \nThe 53-year-old star has now been left heartbroken, along with her family, after she took her own life. \n \n Cathriona White, Jim Carrey May 18, 2015 \n \nThe couple first met in late summer 2012, but by March the following year they had split. \n \nThey kept in constant touch as friends before rekindling their romance in May this year and split just days before Cathriona was found dead . \n \nOur source continued: \"Cathriona's family are fiercely protective, as are the people in Cappaghwhite, the small village where she is from, and everyone was extremely proud of her. They are normal country people. \n \n\"Cathriona had been mad about Jim since she met him and was thrilled when they got back together earlier this year. \n \n  Splash   Jim Carrey and Cathriona White \n \n\"Jim loves Ireland and loved Tipperary, showing his support for it recently by wearing the local hurling jersey.\" \n \nIt is thought they made a secret trip to Ireland to meet her family earlier this year and they recently visited Canada together. \n \n\"Cathriona and Jim were both into the outdoors and keeping fit,\" our source added. \n \n\"They cycled and mountain climbed together and she spent most of her time at his house. \n \n  Getty   Actor Jim Carrey \n \n\"They were really into healthy eating – she wasn't much of a party girl and was happy to live a low key life with Jim out of the limelight, something he also wanted.\" \n \nCathriona, 28, doted on her nephews and nieces in Tipperary and missed them terribly while away in Los Angeles, trying to get back home as often as possible. \n \nSeven weeks ago, Cathriona's older sister Lisa and her husband John Aherne had travelled out to Los Angeles to spend some time with her. \n \nHer funeral is expected to take place in her native Tipperary once arrangements are made. \n \n   VIEW GALLERY", "source": "Irish Mirror"}