{"published": "2015-09-16T17:30:18Z", "media-type": "Blog", "title": "Walking around New York City with the Platypod Pro", "id": "46e721eb-623a-4ed6-b87c-d3c2a656637f", "content": "New York City is probably my favorite place in the world. I grew up outside the city in a small town in Connecticut, and love taking the train into New York to enjoy the hustle-and-bustle sights and sounds of a city that never sleeps. \nRecently, I met a friend of mine in New York City to walk around and make a stop to my new favorite restaurant in Little Italy. He’s not as into photography as I am so I opted for a smaller camera bag with less gear. I only took one body, one lens, a cell phone tripod, and 2 Platypod Pro portable tripods. \n[gallery type=\"rectangular\" ids=\"59658\"]\nWalking Around\nWith less gear, my bag was super-lightweight and it wasn’t bad carrying it around all day. We ended up covering a lot of ground…We arrived in Grand Central Terminal, then hiked up to Rockefeller Center before jumping into Central Park to explore the large reservoir.\n[youtube=https://youtu.be/tTKgJf5OGoA]\nAfter some photos and a timelapse, we hopped on the subway and rushed downtown to World Trade Center and Battery Park just in time for sunset. Using everything I brought, I set up a timelapse of the new One World Trade Center building with my Nikon D7000, and then used my iPhone 6 Plus to shoot a timelapse of the sun setting across the Hudson River. Timelapsing takes time, and since you’re waiting anyway it’s helpful to have multiple cameras to shoot different angles. \n[youtube=https://youtu.be/JP5-czgm8Hs]\n\nI shot raw with the D7000, making it possible to pick a frame and process it, for the image below.\n\n[gallery type=\"rectangular\" ids=\"59685,59690\"]\nI was impressed with the Platypod Pro when I first saw it in Las Vegas. After shooting with it, I can see myself carrying at least one with me in my bag everywhere I go. It’s so small and light, but stable enough to hold a DSLR with a zoom lens and keep it steady anywhere. \n\nBonus Tip\nThe Platypod Pro comes in a cool little carrying case, but there’s no need to carry two cases around. These are small enough that you can fit multiple Platypod’s in just one case.\n*Behind the scenes shot taken by Mike Lano.\n\n\n\nNick Minore is a video professional and avid photographer based in Florida. Be sure to follow Nick for more photo and video updates by clicking on the links below!\nwww.facebook.com/nickminore\nwww.twitter.com/nickminore\n\n\n\n\nThis Post Sponsored by:\n\nPerfectly Clear for Photoshop or Lightroom is all about saving you time so you can focus on doing what you love best. Get a free trial of the award winning plug-in here.\n\n\nThe HDR Learning Center. Check out new ways to use High Dynamic Range photography to make compelling images. Free tutorials and posts to get results. Produced in partnership with HDRsoft\nArizona Highways Photo Workshops. For more than 30 years, Arizona Highway Photo Workshops has been committed to helping photographers find inspiring destinations, quality education and spectacular images. Get more information (and enter our contest) at http://www.ahpw.org/FindIt/\nPlatypod Pro™– the world’s most compact camera support. Use it with your ballhead in place of a tripod. Click here for more info — http://bit.ly/platypodpro\nCreative Cloud Photography plan. Take your best shot and make it even better with the Creative Cloud Photography plan. Get all the essential tools, including Adobe Photoshop Lightroom and Photoshop, to craft incredible images every day, everywhere — whether you’re a beginner or a pro. It’s all your photography. All in one place.\n\nlynda.com Learn photography anytime, anywhere, and at your own pace—from bite-sized tutorials to comprehensive courses. Try lynda.com free for 10 days by visiting lynda.com/Photofocus", "source": "Photofocus"}