{"published": "2015-09-15T05:38:06Z", "media-type": "News", "title": "Second Child Dies of Dengue After Being Turned Away by Delhi Hospitals", "id": "661652f9-c46a-4c62-9081-4146c56c4cd4", "content": "11:08 IST \n\nDelhi is battling its worst dengue crisis in five years \nNew Delhi: A week after a seven-year-old boy died of dengue after being denied admission in various hospitals, another child has died in a similar manner. The Delhi government had ordered an inquiry into the first case. \nHere are the latest developments: \n\nThe second death took place on Sunday. The child was allegedly denied admission by the government-run Safdarjung hospital, which asked his family to take him home and \"not worry.\" \n\nThe child's condition reportedly worsened within 24 hours, after which he was taken from hospital to hospital but not taken in. \n\nLast Tuesday, seven-year-old Avinash died of dengue after his desperate parents went from hospital to hospital for his treatment. After he died, his parents allegedly committed suicide by jumping off a four-story building. \n\nA magisterial probe has been ordered into the tragic case, which highlighted the extent of the dengue crisis in Delhi and spurred the government into action. \n\nDelhi Health Minister Satyender Jain told NDTV that an inquiry has been initiated against five hospitals, adding that their licenses could be cancelled if found guilty. \"Five hospitals have been given notice... We will examine the CCTV footage and check all records,\" Mr Jain said. \n\nNine people have died of dengue in the city which is battling the disease's worst outbreak in the last five years. Over 1,800 dengue cases have been reported so far with just 600 in the last week. \n\nOn Monday, the government ordered 1,000 extra beds in hospitals to treat dengue patients. Doctors, nurses and paramedics at state-run hospitals have been told to cancel their leave immediately. \n\n\"This is the worst outbreak in the last five years and it is going to further increase as the weather remains humid,\" YK Mann, director of the Municipal Corporation of Delhi, told news agency AFP. \n\nDengue fever, also known as \"breakbone disease\" which has no known vaccination or cure, strikes fear into the citizens of Delhi when it arrives with the monsoon rain. \n\nTransmitted to humans by the female Aedes Aegypti mosquito, dengue causes high fever, headaches, itching and joint pains that last about a week. \n\nStory first published: Sep 15, 2015 08:", "source": "NDTV"}