{"published": "2015-09-16T11:18:18Z", "media-type": "News", "title": "RPT-Contrarian CEOs tell the Fed: Go ahead, raise my rates", "id": "413222e8-3c87-4bc8-89c9-f00bc2d4a172", "content": "NEW YORK, Sept 15 (Reuters) - Some U.S. chief executives think it is time to pick interest rates off the floor, even as many of their peers campaign to maintain the status quo.\r\n … \r \n(Repeats Sept 15 item with no changes to text) \n\nBy Timothy Aeppel \n\nNEW YORK, Sept 15 (Reuters) - Some U.S. chief executives think it is time to pick interest rates off the floor, even as many of their peers campaign to maintain the status quo. \n\nThe Federal Reserve meets this week and the first rate rise in nearly a decade - albeit a small one - is on the table. Most businesses, including over 64 percent of those surveyed last week by the National Association of Manufacturers, think it is a bad idea. Many say the economy is still too shaky to risk it. \n\nBut not everyone feels that way, interviews with manufacturers representing a broad range of industries and regions, show. \n\nNeal J. Keating, chief executive of Kaman Corp in Bloomfield, Connecticut, says \"a measured\" quarter point hike would be beneficial. He foresees no real impact on business investments from a modest hike, and his company would get a boost because higher rates would reduce pension liabilities that weigh down the balance sheet. \n\n\"It would actually remove some of the uncertainty\" hovering over the economy, says Mr. Kaman, whose company sells $1.8 billion a year in aerospace and defense parts, including cockpits for Black Hawk helicopters and bomb fuses. When rates are low, the calculations of future returns decline. Many companies, including Kaman, faced underfunded plans in recent years. \n\nScott Wine is another contrarian, who says a rate rise would boost confidence that the economy is truly getting stronger. \n\n\"A nominal interest increase would signal that we're on our way to normalization,\" says the chief executive of Polaris Industries Inc, a maker of outdoor sports equipment which employs 7,000 people worldwide. He notes that \"a rising interest rate environment\" is usually a signal that the economy is thriving. \n\nThis week's two-day Fed meeting, which ends on Thursday, was once viewed as a likely moment for the central bank to raise rates for the first time since 2006, but expectations have diminished since a sharp slowdown in China has roiled global markets. \n\nNO EASY FIX \n\nAdvocates of a hike say what is holding the economy back is flaccid growth in demand and misguided policy from Washington, including allowing tax breaks that encouraged capital spending to expire at the end of 2014 and endless budget battles in Congress. None of those problems are being addressed by near-zero interest rates. \n\n\"Even with rates extremely low, you only invest when you see opportunities for growth,\" says Wine. (Graphic: Business Confidence:link.reuters.com/kug77v \n\n) \n\nSome are more conflicted. Robert Stevenson, chief executive of Eastman Machine Co, a maker of industrial fabric cutting machines with 50 workers in Buffalo, New York, and 100 at a plant in China, says higher rates would almost certainly hurt exports, which account for half his business, so he is \"not enthused\" about the prospect of higher rates. Many manufacturers worry a boost in rates would attract foreign investors to buy dollars, pushing up the value of the U.S. currency. \n\n\"But as a citizen, I take a somewhat contrary position,\" says Stevenson. \"I think it's a problem that there's no savings in this country because there's no point to save.\" \n\nThe NAM survey released last week showed larger manufacturers were more likely to want the Fed to hold rates steady, while roughly equal shares of small, medium and large firms said they would like to see an increase. \n\nWhen the Fed pushed rates near zero during the depths of the 2007-2009 recession, it wanted to stimulate business spending of all kinds. A number of studies have concluded that the central bank's efforts staved off a deeper crisis. But business investment has been unimpressive: One broad measure of spending, which includes investments by businesses in structures as well as machines, less depreciation, has averaged only 2.7 percent of gross domestic product since 2010, down from the 4.9 percent average since 1980. (Graphic: link.reuters.com/pyh65w \n\n) \n\nAnd there is no sign of an upswing. Duke University's…", "source": "MyInforms"}