{"published": "2015-09-28T18:22:51Z", "media-type": "News", "title": "WALK! with Aegis Therapies 2015 Kicks Off with Featured Health and Wellness Events During Active Aging Week", "id": "0777f3f3-ef2c-4f46-95ee-efb22f16a3b4", "content": ") - In its seventh consecutive year, the nationwide WALK! with Aegis Therapies kicks off senior wellness events around the country while bringing health and wellness activities online for anyone who would like to participate in Active Aging Week, Sept. 27 to Oct. State representatives, council members, mayors and the lieutenant governor of Mississippi will be in attendance at featured events. \n\nAnyone can join our seniors and participate in Active Aging Week through an online, at-home guide by registering at www.walkwithaegis.com . A welcome e-mail will outline the steps to join the WALK! with Aegis Therapies 2015 program. \n\nWALK! is a five-day event, that runs Monday, Sept. 28 through Friday, Oct. 2, and features wellness activities at more than 760 locations where Aegis Therapies provides rehabilitation services. The WALK! is jointly presented by the EnerG™ by Aegis wellness program and the International Council on Active Aging® (ICAA) in support of ICAA's annual Active Aging Week ® . \n\nThe WALK! features nationally-recognized fitness and wellness expert, Chris Freytag, who will lead a series of activities among our nation's senior population in the greater Minneapolis, Philadelphia and Springfield, Mo. areas. Local mayors, Minnesota Vikings cheerleaders, farmers' markets, Minnesota Rep. Jon Applebaum and various organizations plan to attend featured events with Chris. \n\nIn addition to Chris Freytag's participation, Golden Living, a nationwide leader in post-acute healthcare services, lends its Executive Chef and Director of Dining and Hospitality, Darin Leonardson, to the WALK! program providing antioxidant smoothies and healthy recipes after a series of activities throughout the week. Chef Darin will participate in events at healthcare communities beginning today in Atlanta and Memphis, Tenn. areas. Local mayors, council members, various organizations, and Mississippi Lieutenant Governor Tate Reeves will be attending featured events with Chef Darin. \n\n\"Though our WALK! with Aegis Therapies 2015 events during Active Aging Week, we hope to bring health and wellness to the forefront for every person no matter if they are 99 years old or 20 years old. The online registration helps to reach the younger generation who does everything online as well as seniors who are living at home,\" said Martha Schram, President of Aegis Therapies. \"Aegis Therapies, along with the participation of Chris and Darin, are committed to caring and engaging our senior population, so that we can collectively reinforce the importance of being active and healthy at any age.\" \n\nEach of the more than 760 WALK! locations organizes a series of 15- to 30-minute daily walking sessions and an activity that supports a different dimension of wellness: physical, intellectual, occupational, emotional, social, spiritual and environmental. This award-winning program attracts seniors of all ages and mobility, families, facility staff and community members with a week of scheduled events to celebrate health and wellness. \n\nSchedule of Events: \n\nMonday, Sept. 28, Chef Darin will present healthy dishes and a cooking demonstration at the WALK! with Aegis Therapies featured event at Salude in Suwanee, Georgia outside of Atlanta. \n\nTuesday, Sept. 29, Chef Darin will host a chef cook off while presenting healthy dishes at the WALK! with Aegis Therapies event at Golden LivingCenter - Southaven in Southaven, Miss. outside of Memphis, Tennessee. \n\nWednesday, Sept. 30, Chris Freytag will lead the WALK! with Aegis Therapies event at Jordan Creek Nursing and Rehab in Springfield, Missouri. \n\nThursday, Oct. 1, Chef Darin will make tasty recipes and talking about healthy eating at the WALK! with Aegis Therapies events at Pin Run in Doylestown, Pennsylvania outside of Philadelphia, Pa. \n\nFriday, Oct. 2, Chris Freytag will lead seniors during WALK! events at Parmly LifePoints in Chisago City, Minn. and Golden LivingCenter - Hillcrest of Wayzata in Wayzata, Minnesota in the greater Minneapolis area. \n\nAbout the Talent \n\nChris Freytag holds the titles of certified group fitness instructor, personal trainer, weight management coach, and is a published author and speaker. Her high energy and dynamic personality led to national media appearances in \"Success\" magazine, as a regular contributor to \"Prevention\" magazine, an appearance on \"The Today Show,\" and as a regular healthy lifestyle guest on QVC. \n\nDarin Leonardson brings 20 years of culinary and hospitality experience to the table. He joined Golden Living from One Eighty, the parent company of Leisure Care Retirement Communities, where he was the corporate food and beverage manager for 38 Leisure Care properties globally. Previously, Leonardson worked for Google as a general manager and executive chef overseeing the dining rooms of five Google offices, where he began composting corporate wide and started on-site vegetable and herb gardens. \n\nAbout Aegis Therapies ( www.aegistherapies.com ) \n\nAegis Therapies is one of the nation's leading providers of contract physical, occupational and speech language therapy services. Offering contract rehabilitation and wellness services, Aegis Therapies operates in 1,000 locations across 42 states and the District of Columbia with over 900 partnerships and employs more than 8,400 employees providing short-term and long-term therapy, At Home with Aegis, and EnerG® by Aegis wellness programs to help people increase their independence and maximize their functionality in a health care or home setting. Working together to provide better patient care at a lower cost, Aegis therapists receive state-of-the-art, evidenced-based practice training to measure and quantify therapy impact as well as continuing education to help them respond to the ongoing regulatory requirements while delivering clinical outcomes to their patients. \n\nAbout the International Council on Active Aging® (ICAA) ( www.icaa.cc ) \n\nICAA, a professional association that leads, connects, and defines the active-aging industry. ICAA supports professionals who develop wellness facilities, programs, and services for adults over 50. The association is focused on active aging -- an approach to aging that helps older adults live life as fully as possible within all dimensions of wellness -- and provides its members with education, information, resources, and tools. \n\nAbout Golden Living ( www.goldenliving.com ) \n\nGolden Living is a family of companies that specialize in recovery care and is a national leader in providing skilled nursing and post-acute care. Our mission is to share our passion for improving quality of life through innovative healthcare, one person, one family, and one community at a time. We help people recover their health and improve their quality of life through a network of healthcare services including rehab, assisted living, skilled nursing care, hospice, and palliative care. The Golden Living family of companies includes Golden LivingCenters, Aegis Therapies, AseraCare, and 360 Healthcare Staffing. There are 295 Golden LivingCenters in 21 states. Golden Living also offers assisted living services at 12 locations. In addition, the Golden Living companies provide services to more than 1,000 nursing homes, hospitals, and other healthcare organizations in 41 states and the District of Columbia. Collectively, the Golden Living family of companies has more than 40,000 employees who provide quality healthcare to more than 60,000 patients every day.", "source": "Stockboard Media Inc."}