{"published": "2015-09-25T07:06:10Z", "media-type": "News", "title": "Newcastle college massacre plot teenager Liam Lyburd to be sentenced", "id": "fd3eb8ec-41ca-4afd-846f-bcf1eed34b15", "content": "A teenager who plotted a massacre at his former college with a deadly arsenal he had amassed will be handed a \"very substantial\" jail sentence today. \n \r\n\t\t\r \nLoner Liam Lyburd made up a \"kill bag\" containing pipe bombs, a semi-automatic pistol and hollow-tipped expanding bullets which police discovered when they raided his Newcastle bedroom in November. \n\r  Liam Lyburd was convicted following a trial at Newcastle Crown Court in July \r \r \nThe 19-year-old had admitted nine charges relating to making five pipe bombs, two home-made explosive devices, possessing a 9mm Luger Calibre Glock gun, the hollow-point ammunition and CS gas. \n\r\n\t\t\t\r \nA jury convicted him of eight charges of possessing those items with an intent to endanger life at Newcastle College following a trial at Newcastle Crown Court in July. \n\r\n\r\n\r\n\r \nHe had been kicked out of the college for bad behaviour and retreated into a reclusive world, playing computer games and using the dark web to fund his obsession with guns and Batman's enemy, The Joker. \n\nAfter the trial Judge Paul Sloan QC adjourned sentence so a psychiatric report could be prepared. \n\nHe told Lyburd: \"You will appreciate that only a very substantial sentence in custody is appropriate in the circumstances of this case.\" \n\nPolice had been alerted by a member of the public who was concerned about posts Lyburd made talking about launching a murderous attack. \n\r\n\t\t\t\r \nThey were led to the bedroom which he had rarely left for months and found the cache of weapons, the bag containing his sinister overalls, mask, boots and pipe bombs, and incriminating evidence on his laptop. \n\nA computer specialist recovered a deleted file from his computer in which he wrote about getting vengeance on the college which had kicked him out two years before. \n\nIt said: \"You people ruined my whole life, don't expect me to show mercy today. No-one disrespects me and gets away with it. \n\n\"I'll teach you people a little lesson on respect with my 9mm jacketed hollow points. \n\r\n\t\t\t\r \n\"It's time for extreme civil disobedience. \n\n\"Fantasy will become reality today for sure. Where the mind goes the body will follow and, yes, people will die, there's no question about that.\" \n\nAs Lyburd was taken away by police, he laughed and told officers they had saved lives, preventing what would have otherwise been a massacre at the college. \n\nThey found webcam pictures he took of himself dressed for combat, armed with a Glock and brandishing a knife. \n\nThe estate where he lived with his mother and sister near Newcastle United's stadium was cordoned off for days while police carried out searches. \n\r\n\t\t\t\r \n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Belper Today"}