{"published": "2015-09-10T08:56:23Z", "media-type": "News", "title": "Young Reporter scheme expands to reach all of London", "id": "cfea5210-818a-440b-92ca-1a1f4d29c36d", "content": "Newsquest’s Young Reporter scheme is beginning its eighth year, offering students from around the capital the chance to publish their own news stories on to websites visited by thousands daily. \n \nIn addition, as well as appearing on all our area-specific websites, the stories will be hosted on thisislocallondon.co.uk, covering every corner of our great city. \n \nDesigned to encourage aspiring writers and journalists to think independently, explore and enquire about the world around them and build their confidence, the scheme is open to all schools and colleges in London for pupils aged between 14 and 18. \n \n \n \n Award winners Katie Harris and Nicola Evans at Newsquest South London offices in Sutton  \n \nStudents start their “writing career” producing one article a month for a period of eight months and the scheme is carefully structured so that they feel they are working directly for the online newspaper. \n \nThey are given deadlines to work to and encouraged to write local articles, take photographs and then upload their work directly to our website. \n \nJudith Forshaw, head of English at Croydon High School, said: “The Young Reporter scheme continues to give our students a unique opportunity to see their articles published for a real audience.” \n   Promoted stories   \nAt the end of the programme, the students who have completed eight articles receive a letter of recognition from a Newsquest editor, congratulating them on their achievement. \n \nThose who write their articles within the deadlines are given the opportunity to compete against other students to win prizes and spend a day at a London university. \n \nKingston University hosted the event this year. \n \n \n \n Young reporters at Kingston University in June  \n \nSchools have wholeheartedly endorsed this scheme as it is hard to secure work experience placements in the media and Newsquest organises the entire project, so it can be run with minimal effort from teachers. \n \nKathryn Pullen, headteacher, Sydenham High School, said: “This is our first year in the scheme and it has been a pleasure to see our girls rising to the challenge and publishing some excellent articles. \n   \n Share article  \n   \n“We will definitely be taking part again.” \n \nSchools are now registering for this year. For more information, call Diana Jarvis on 020 8722 6378 or email her at djarvis@ london.newsquest.co.uk.", "source": "Borehamwood Times"}