{"published": "2015-09-18T13:11:57Z", "media-type": "News", "title": "College Savings Foundation Finds that 72% of Children have Accumulated Savings for College", "id": "ee4fca67-53ea-423d-be3f-69e2823b9556", "content": "PR Newswire \n \nWASHINGTON, Sept. 18, 2015 \n   \nWASHINGTON , Sept. 18, 2015 /PRNewswire-USNewswire/ -- Nearly three quarters (72%) of children age 18 or under have accumulated savings for college, and for many of them utilizing a 529 college savings plan has been the savings vehicle of choice.  In recognition of College Savings Month, the College Savings Foundation has released a snapshot of Americans' savings behaviors by the age of their children.  For the vast majority of children with college savings, the saving process had started by the time they were five years old.  www.collegesavingsfoundation.org \n\nThe data, drawn from CSF's annual State of College Savings survey of parents across the country, showed that the 72% of children with college savings benefited from starting early and utilizing 529 college savings plans: \n 76% have savings starting by age five, 21% starting between the ages of 6-10, 9% starting between 11-13, and 4% starting at ages 14-18.  44% had utilized a 529 college savings plans. \n\"Higher education is a major life event and people are saving for it.  At a time of mounting student loan debt and repayment concerns, it is gratifying to see Americans saving to brighten their children's future,\" said Mary Morris , Chair of CSF, a leading nonprofit helping families save for higher education.  \n \n\"Nearly 20 years ago, policymakers created 529 plans to help American families save for college.  Since then, year over year, we have seen their usage increase dramatically,\" she added. \n\nOverall the survey found that 28% of children of all respondents did not yet have savings set aside for college.  \"We know that every dollar saved is one less that may have to be borrowed in the future, so it's never too late to benefit from saving at any stage of a child's life,\" said Morris. \n \nThe data shows that savings starts and increases as the children get older.  The amount of savings increased by the age of the child, demonstrating that American families view savings for college as an important financial goal.  See the attached link of charts of savings by age and amount. \n\nAmong all children, families demonstrated a strong consistency in saving discipline:  81% had saved at least as much this year than one year ago. \n \nThe College Savings Foundation's 2015-2016 State of College Savings Survey was conducted by Survey Monkey of over 800 parents across the country.  \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/college-savings-foundation-finds-that-72-of-children-have-accumulated-savings-for-college-300145469.html \n\nSOURCE  College Savings Foundation", "source": "Reuters"}