{"published": "2015-09-04T20:36:48Z", "media-type": "Blog", "title": "Jovial’s Groundbreaking Ceremony", "id": "43d45431-5c4f-44cd-b871-3c360b1992cf", "content": "Yesterday was an exciting day for our company, as we celebrated the official start to the construction of our new company headquarters, which will be located in North Stonington, Connecticut. Although jovial founder, Carla, has had this piece of property near and dear to her heart for many years, her family became the official owners about six months ago. “I used to come here for dinner with my family and it has always been a dream of mine to someday own this beautiful and historic land,” Bartolucci said. \n \n\nAlong with revealing the plans for the new jovial warehouse and administrative building, Carla also took the time to thank the many people who helped her dream come to fruition.  This included the  project’s architect, Friedrich St. Florian, whose very prestigious resume includes designing the WWII Memorial in Washington, DC.  Frederich explained that after spending time with Carla in Italy to discuss plans and then walking the site together in Connecticut, he was able to fully appreciate the vision that Carla had for the John Randall homestead. He knew she was the perfect person to bring the inspiring piece of property back to life and back to it’s full potential. \n \n\n \nRandall’s Ordinary is anything but ordinary, built circa 1685, the house is on the National Register of Historic Places and one of North Stonington’s most famous sites.  In her speech on Thursday, Carla explained that she holds the property dear to her heart and although changes will be made, the historic integrity of the land will be honored and respected completely. She also added that the Randall homestead is the perfect place for jovial’s mission to unfold, looking to the past for a better future. \n \nState Representative Diana Urban and First Selectman Nick Mullane were also there to join Carla, her family, Fredrich and John Carlin of Carlin Construction Company in the first official dig.  The concrete work will commence as early as November, and the grand opening of the office and warehouse will be in the early summer of 2016.  Following the company relocation, work will begin to restore the inn so that Carla can begin her Culinary Getaways in Connecticut. The inn was originally constructed in an Old World barn that was transported to the site from upstate New York. The beautiful timber frame structure will house 10 guest rooms, and jovial will be building an additional that will include a large kitchen, dining area, and an outdoor courtyard. Following completion of the inn renovation, the company will set it’s sites toward the 1685 home and adjacent barn. \n \n\n \nTo celebrate the release of her new cookbook, Einkorn: Recipes for Nature’s Original Wheat , Carla prepared a selection of 10 savory and sweet recipes to serve after the ceremonies.  Carla told the story of the company beginnings and how much it means to her to meet her customers face-to-face at the villa in Italy and how excited she is to do the same in Connecticut. She concluded her speech by inviting people to try einkorn: “I wanted to tell you that I baked for you. How many people here have tasted einkorn? Well, today, you are going to taste the oldest food that there is.” \n \n\n \n\n \nFollowing the ceremony Carla and all those who helped make her dream happen, gathered under the tent and together celebrated the next chapter for North Stonington and, of course, Jovial Foods. It was a great way to end an exciting evening. \n \n\n \n  \n \n\n \n  \n \n\n \n  \n \n  \n \n ", "source": "Jovial Recipes » Blog"}