{"published": "2015-09-10T22:03:21Z", "media-type": "News", "title": "Rain delays Serena's quest for Grand Slam history", "id": "bba78068-8be8-4cec-83e7-33ddafd8e150", "content": "Related Story: \r\n       Slam-seeking Serena sinks Venus, Djokovic to meet Cilic in semis \r \r \nTwo triumphs from completing a calendar Grand Slam, top-ranked defending champion Serena Williams was confronted Friday (AEST) at the US Open by an opponent even she cannot defeat - rain. \n\nUS Tennis Association officials postponed the two scheduled women's semi-final matches to Saturday due to forecasts of rain lasting through the night. \n\nTop-ranked defending champion Williams now will play Italy's 43-ranked Roberta Vinci in Saturday's second semi-final after Romania's second-ranked Simona Halep faces Italian 26th seed Flavia Pennetta in the opener at Arthur Ashe Stadium. \n\nThe winners will meet in Sunday's final. \n\nMen's semi-finals on Saturday would be delayed two hours to allow for the extra matches. \n\nThe delays come in the final uncovered year for Arthur Ashe Stadium, which starting in 2016 will have a retractable roof to avoid any bad weather postponements. \n\nA supporting superstructure is in place around the venue now but there was not enough time to secure the roof in place before the tournament. \n\nAnother day of tension only heightened the anticipation and drama around Williams and her quest for more tennis history. \n\nThe 33-year-old American, who already holds all four major titles, is chasing the first calendar Grand Slam since Steffi Graf in 1988 and trying to match Graf's Open Era career record of 22 Slam singles titles, two shy of Margaret Court's all-time record. \n\n\"I never really thought I would be in this position where I would even be talking about records, talking about passing Steffi Graf or even mentioning Margaret Court,\" Williams said. \n\n\"I just grew up trying to be the best that I could and do the best that I could. I worked really hard for everything, so to even be mentioned in that conversation is great.\" \n\nAFP", "source": "ABC Online"}