{"published": "2015-09-14T15:12:25Z", "media-type": "Blog", "title": "This Is What Will Happen When You Start Putting Down Your Phone More", "id": "18df9c3e-c3f7-4bc2-956d-b384070a3b79", "content": "  \n \nI have long been interested in the problems associated with excessive smartphone use because we live in a time when our lives are dominated by technology. Smartphones (as well as laptops and tablets) seem to dictate our lives now. \n \nTake a look around in public. Everyone seems to be glued to their smartphones everywhere you look. Many people have forgotten what it feels like to simply be a person and live life in the present. \n \nBack in August 2013, I did an experiment. I turned my smartphone off for one month. That’s right. For one entire month, I was without a smartphone. There was no texting, no phone calls, no mindless internet browsing, no anxiously checking my e-mail every two minutes, and no social media. \n \nI know what happens when you start putting your smartphone down and I’m happy to share the benefits with you. Here they are: \n 1. You will initiate small talk on a more consistent basis.  \nStand in a line at any place or event with a decent wait time. What do you usually see? You usually see a line of people just standing there mindlessly staring down at their smartphones. They are oblivious to the world around them. They have little awareness of their surroundings. Their only focus is whatever is on that smartphone screen. \n \nThis really is a shame because when you think about it, you have to wonder about all the missed opportunities. Who knows what kind of friendships or relationships could be started just by putting your phone away and engaging in simple small talk? \n \nYou will know if you decide to put the phone away and pay attention to your immediate surroundings. You will have no other choice. Without a smartphone, life is boring if you just stand around and don’t talk to people. Without a smartphone to rely upon for ‘entertainment’, you will place evolutionary pressure on yourself to start making small talk with strangers. From there, the possibilities are endless. \n 2. You will become more observant.  \nWhen you allow yourself to be dominated by constant smartphone use, life follows one big pattern. You tend to do the same thing over and over throughout the week. You get up. You go to work. You talk with the same people every day. You go to lunch. You leave work. Maybe you go to the gym or take a class. And then you go to bed and do it all over again. This is reality for many people, especially those who are constantly on their smartphones throughout the day. You don’t really remember the details about your day. You don’t really remember specific people that you come across. It’s all one big blur. \n \nThis will change once you start putting your phone down more. Again, you will not be able to rely upon your smartphone as a means of numbing yourself from the rigors of your daily routine. You will be forced to actually look around and gain a deeper understanding of life around you. You will become more observant of people. You will also become more observant of the social situations developing in front of your eyes. \n 3. You will give yourself a chance to reset your dopamine levels to “normal”.  \nIt’s very common for people to say that we are “addicted to our smartphones.” But what does this really mean and is this accurate? It’s somewhat true. It’s not so much that we are addicted to our smartphones. In reality, we are addicted to dopamine , the “pleasure chemical” that is released in our brains as a reward mechanism. Simply put, we live in a society where constant access to technology and instant gratification at our fingertips has our collective dopamine levels way out of whack. \n \nRecent research indicates that dopamine causes “ seeking behavior .” Our brains are always seeking stimulation- hence, why we are a “click happy generation.” How many times have you found yourself searching on Google or YouTube for something specific only to end up looking at something totally unrelated an hour later. We’ve all been there. \n \nWhen you make it a habit to put down your phone, you will start to alleviate this extreme seeking behavior. Eliminating the constant clicking, searching, and communicating will enable you to give yourself a chance to reset your dopamine levels to their normal range. \n 4. You will relax and be in a good mood more often.  \nConstant smartphone use throughout the day can take its toll on you. This is especially the case if you make it a long term habit. Constantly looking at a small screen and mindlessly clicking away wears down your brain. Again, this relates back to abnormal stimulation and dopamine release. This habit, that so many of us engage in, adds another element of stress to our lives that is simply unnecessary. \n \nThe world is stressful enough. People have jobs. People have personal lives. Stress is inevitable. There is no reason to add to it. Yet, this is exactly what many of us unknowingly do when we do something like check our e-mail inbox ten times just on the elevator ride up to the office. \n \nWhen you eliminate, or at least drastically cut down on this habit, you give yourself a chance to relax. Suddenly, life doesn’t seem to be moving so fast. There is time to fully enjoy something as simple as going to the grocery store. When you are able to put your phone down and relax, you will give yourself the opportunity to be in a good mood. \n \n  \n \nVia", "source": "Broccoli City"}