{"published": "2015-09-29T11:50:34Z", "media-type": "News", "title": "Injury-hit Wales make three changes for World Cup clash against Fiji", "id": "58035272-4391-42b6-9004-400af73de37a", "content": "Wales head coach Warren Gatland has made three injury-enforced changes for Thursday's World Cup Pool A clash against Fiji in Cardiff. \n \nBristol full-back Matthew Morgan replaces Liam Williams, who is recovering from concussion, while centre Tyler Morgan replaces knee injury victim Scott Williams and wing Alex Cuthbert takes over from Hallam Amos, who is sidelined from the rest of the tournament with a shoulder problem. \n \nIt is otherwise the same team that beat England at Twickenham three days ago, with James Hook, who was called into the squad as a replacement on Monday, named among the replacements. \n SIGN UP NOW  \nWant to become a GMS writer? Sign up now and submit a 250 word test article: http://gms.to/haveyoursay4 \n \nGatland retains the pack on duty against England, with flanker Dan Lydiate and number eight Taulupe Faletau both winning their 50th caps. \n \nMatthew Morgan, 23, and 20-year-old Tyler Morgan make their first World Cup starts as Wales look to take another major step towards the quarter-finals, with Gatland's selection reflecting the huge importance of Thursday's game. \n \nTyler Morgan missed out on original World Cup selection but was then drafted in as a replacement for Cory Allen, who suffered a tournament-ending hamstring injury after scoring three tries against opening opponents Uruguay. \n Must keep up momentum  \nVictory for Wales would put them within touching distance of the last-eight, and also leave England having to beat Australia at Twickenham on Saturday or the host nation will suffer an embarrassing pool stage exit. \n \n\"It is important we build on the success and momentum from last weekend and take that into Thursday,\" Gatland said. \n \n\"Fiji have performed very well in their opening two games, and they will be coming to Cardiff looking to build on that themselves. \n \n\"We have made three changes through injury, but go into this game with a strong side. \n \r \n\"We are looking forward to being back at the Millennium Stadium on Thursday and having the crowd right behind us in an important World Cup fixture.\" \n\r  \n\n Injury woes  \nApart from beating Fiji, Wales will also hope they can emerge unscathed in terms of injuries, with Australia looming at Twickenham nine days later. \n \nGatland has so far lost almost a sixth of his original 31-man World Cup squad through injury - a casualty count comfortably higher than any other team - with Amos and Scott Williams following Allen, full-back Leigh Halfpenny and scrum-half Rhys Webb in being sidelined from the tournament. \n \nHook apart, the bench is unchanged from that on duty at Twickenham last Saturday, with again no place in the match-day 23 for Ospreys prop Paul James, who went off with calf muscle trouble during the Uruguay game. \n \n\n \nHow far do you think Wales can progress at the Rugby World Cup? Give YOUR opinion in the comment box below! \n \nDo YOU want to write for GiveMeSport? Get started today by signing-up and submitting an article HERE: http://gms.to/writeforgms", "source": "GiveMeSport.com"}