{"published": "2015-09-30T07:08:00Z", "media-type": "News", "title": "Notre Dame sweeps Byron-Bergen", "id": "2d518965-cba2-4631-b565-1081fd27c85d", "content": "BATAVIA — It was a battle of girls volleyball unbeatens between Byron-Bergen and Notre Dame Tuesday afternoon in Genesee Region League action, but it was the host Fighting Irish who completely stole the show. \n  \nShea Norton had a monster night with 20 kills, 13 digs and three blocks as Notre Dame swept the Bees in straight sets — 25-23, 25-18, 25-17. \n \nRebecca Krenzer also had a big night with 10 kills and seven digs and Nichol Salvador added 11 digs in the win. \n \nMary Kate Miceli handed out 23 assists as Notre Dame improved to 7-0 in the league and 8-0 overall. \n \nLauren Burke led the way for the Bees with five aces, 18 assists and a dig. \n \nBryanna D’Agostino finished with 12 kills and three digs, while Bethany Ezard added six kills as Byron-Bergen dropped to 6-1, 7-1. \n \nIn other girls volleyball on Tuesday: \n \nLivingston Conference \n \nPERRY over LETCHWORTH: After winning the first two sets, the Yellowjackets were brought to five sets before they outlasted the Indians, 25-20, 25-22, 21-25, 20-25, 25-19. \n \nBrianna Holderer had 10 kills and Kaitlyn Fisher handed out 25 assists to go with seven aces in the win for Perry. Jessica Aubert added 12 digs in the win for the Yellowjackets. \n \nTatiana Aaron had four digs and four kills and Leah Shafer finished with six digs for Letchworth. \n \nLE ROY over YORK: Ally Uberty finished with seven aces and six kills as the Oatkan Knights coasted to an easy, three-set win — 25-9, 25-4, 25-3. \n \nRiley Pasquale added nine kills and Riley Chester chipped in with three aces as Le Roy remained perfect at 3-0, 9-0. \n \nNiagara-Orleans \n \nALBION over CSAT: Kiara Smith had six acces and two assists, Cassidy Hastings finished with five aces and Emilie Barleben added two kills, two aces and two assists as the Purple Eagles won in three sets. \n \nSet scores were 25-11, 25-13, 25-15. \n \nKelsee Soule had three kills and two aces, Sierra Newton and Caitlynn Snook each had three aces and Aleah Foos chipped in with two kills as Albion moved to 7-0 in the league and 8-0 overall.", "source": "The Daily News Online"}