{"published": "2015-09-12T23:00:00Z", "media-type": "News", "title": "Robin Hood or hoodlum robber? The audience decides in Crotty the Highwayman", "id": "66e7af7a-0401-42fa-b2e2-bb3835a95f08", "content": "The true story of Crotty the Highwayman has been dramatised for a performance in the hills where he once roamed, writes Colette Sheridan \n\nAN 18th century highwayman, regarded by some as a Robin Hood-type character, is the subject of a play by an up-and-coming Waterford playwright. Martina Collender’s drama about William Crotty, entitled Crotty the Highwayman, will be performed in the open air at Coumshingaun Lake as part of the Comeraghs Wild Festival in County Waterford. \n \nTwenty-three year old Collender was commissioned by Waterford County Council to write the play. “I’ve always had a huge interest in William Crotty. I grew up with stories about him. The reason why he’s so legendary is because he escaped being captured so many times. One story has it that he put the shoes on his horse backwards to throw people off his trail. The legend goes that he robbed the rich and gave to the poor. \n \n“He made his home in a cave in the Comeragh Mountains ,where he stored his gold. His wife, Mary, lived with him there until she became pregnant and moved in with her brother in Lyre at the foot of the mountain.” \n \nCollender admits to having a soft spot for Crotty. “I hold onto the story that he stole from the rich to give to the poor and fed children and gave people a way of life. But the facts can’t be denied. At his trial, his main crime was that he shot a man dead. Crotty claimed he did it in defence but if he was robbing this man’s house in the dead of night, I’m not sure if there was much reason for killing him. It’s a tricky one. I leave it up to the audience to decide for themselves.” \n \nCrotty’s many enemies described him as a bloodthirsty murderer while the country people claimed he was generous with any money he robbed. He was the leader of a gang of marauding highwaymen. \n \n“I’ve done my best to try and tell the story from three different points of view. There’s Crotty (played by Brian Coady), Mary and Crotty’s best friend, David Norris, who betrayed him in the end. There’s the argument that Norris didn’t have much choice but to be bribed by the authorities. Crotty was hurting more and more people and Norris, who was his accomplice, would have ended up in jail. A deal was struck that Norris would be excused from the law if he gave Crotty’s whereabouts.” \n \nCrotty knew the Comeraghs inside out, hiding out in them when being pursued, making his capture very difficult. According to legend, one night in February 1742, Norris poured enough whiskey into Crotty to make him sleepy. He then wet Crotty’s gunpowder and stole his dagger. When the police arrived to arrest him, Crotty didn’t stand a chance. He was put on trial in Waterford city and was found guilty. After being hanged, his head was cut off and was left on display outside the county jail as a warning to anyone thinking of following in his footsteps. Crotty’s heartbroken wife also came to a tragic end. \n \nComeraghs Wild festival (September 17-20) is designed to showcase the beauty and heritage of the Comeraghs. Heritage events, mountain activities, music and other art forms are all part of this festival that takes place across the communities of the Comeragh Mountains and along the Copper Coast. \n \nSinger Mary Black will also perform in the courtyard of Curraghmore in Portlaw on September 19 with support from Kila and Rue de la Coup. \n \nCrotty the Highwayman is on September 18. The audience will leave Rathgormack Hiking Centre at 6.30pm for a 40-minute walk to Coumshingaun Lake. www.ComeraghsWild.com \n\n© Irish Examiner Ltd. All rights reserved", "source": "Irish Examiner"}