{"published": "2015-09-16T06:58:57Z", "media-type": "News", "title": "Celebrity Big Brother 2015: Fatman Scoop and Gail Porter evicted", "id": "f6751420-3d72-483a-bc32-a0f71f70b447", "content": "Emma Willis revealed tonight which two housemates out of Gail, Janice, Scoop and Stevi and Chloe-Jasmine were to be leaving the Big Brother House in a double eviction. \n \nBut before that announcement was made, the show began with highlights of Stevi jumping into a bath in his bright green mankini and a blonde wig, typically. \n  \nTake the bloody wig off man #CBB  #CelebrityBigBrother  pic.twitter.com/QFvk6l9PNE \n \n— Auntie Pegg (@AuntiePegg) September 15, 2015 \n \nBig Brother gave the housemates some drinks for the night and Chloe-Jasmine rushed into the storage room to take some alcohol for Stevi and Bobby. \n \nThis angered Austin saying:  “it’s just ironic that the other day you couldn’t get out of bed because you couldn’t be around alcohol and now you are running to the fridge to grab booze for him.” \n  \nOooooops calm down #cbbaustin  #cbb  #CelebrityBigBrother  pic.twitter.com/FR4EnAL6qU \n \n— Auntie Pegg (@AuntiePegg) September 15, 2015 \n \nChloe-Jasmine responded by crying, obviously. \n \nBobby tried to calm Austin down and Austin swore at him. It was all very awkward. \n  \nWhere's Jeremy Kyle with an intervention when you need him #CBB  #cbbuk \n \n— AISLEYNE (@Aisleyne1) September 15, 2015 \n \nAnyway…back to the point. \n \nThe first eviction of the night saw Scoop say bye-bye and take his top off. It got very weird very quickly. \n  \nScoop is out! RT if you're happy, favourite if you're sad. #CBB  pic.twitter.com/bZ1dovjbUX \n \n— Big Brother UK (CBB) (@Bbuk_ukvsusa) September 15, 2015 \n \nHis highlights reminded us of how he tried to (barely) keep up a reputation as peacemaker in the house, and this Twitter user made a really brilliant/hilarious point about his tiff with Natasha. \n  \nwhen Scoop was shouting listen at Natasha, I actually thought he was singing #CBB  #CBBUK \n \n— Vladimir Raul (@EmperorMendoza) September 15, 2015 \n \nThe second to go was Gail which revealed a very troubling reality for Twitter. Katie Hopkins had actually been right about something. \n  \n@KTHopkins  @TheSun  @TheSunTV No. I'd rather have my finger & toe nails removed by a pliers!! \n \n— Anonyman (@MensTroubles) September 15, 2015 \n  \nOne for all of @KTHopkins doubters: Katie has correctly predicted the General Election, Labour Leadership Race and tonight's #CBB Eviction. \n \n— Kathryn (@Kathryn0291) September 15, 2015 \n \nShe also predictably tweeted a rather rude comment about the former housemate. Sigh. \n  \nSay bye bye Gail. You have let being bald determine who you are #CBB \n \n— Katie Hopkins (@KTHopkins) September 15, 2015 \n   \n Share article  \n    \nIs a world where Katie Hopkins is right really worth living in? We don’t know.", "source": "Winsford Guardian"}