{"published": "2015-09-29T13:39:23Z", "media-type": "News", "title": "Asian stocks plunge as China woes hit resources firms", "id": "0b003903-7680-4c98-ba4b-304e3b6aad39", "content": "September 29, 2015 9:39 pm \r\n                \t\t               \r \r [embedded content] \r \r \r \r\n\r \r \r Tweet \r \r \r \nHONG KONG: Resources firms led by mining giant Glencore headed a deep sell-off in Asian markets on Tuesday following painful losses across Europe and New York as fears about China’s slowing growth resurfaced. \n \nThe yen rallied while higher-risk emerging market currencies took another hit ahead of key US jobs data Friday that could sway the Federal Reserve’s decision on when to raise interest rates. \n \nIndia’s rupee suffered added selling pressure after the country’s central bank cut interest rates again. \n \nTrading floors around the planet have witnessed extreme volatility since mid-August, when China devalued its yuan currency, fanning fears about the state of the world’s number two economy and crucial driver of global growth. \n \n“The slowdown in China is spreading to other Asian economies, Brazil and Australia, and weakness in emerging countries could echo throughout the overall world economy,” Toshihiko Matsuno, chief strategist at SMBC Friend Securities, told Bloomberg News. \n \n“We still don’t know when market fears will end about China’s slowdown, and because of this investors are turning to cash and safe assets.” \n \nChina’s growth has been slowing for several months and the economy is this year expected to see its worst performance in a quarter of a century. \n \nLast week already fragile confidence was rattled by news that a gauge of factory activity in the country recorded its lowest level for six-and-a-half years in September. \n \nOn Monday Beijing said key industrial companies saw profits fall 8.8 percent in August—hit by last month’s shock devaluation, weak demand and plunging stocks. \n \nWith China’s demand for resources waning and prices sitting at multi-year lows, commodities-linked firms took a hit. \n \nThe hardest hit was Glencore, which lost 29.3 percent in Hong Kong. The losses followed a near 30 percent plunge in its London-listed arm after online brokerage Investec warned about the impact of soft commodity prices on the group’s future. \n \n“We know all their businesses including agricultural, energy, or mining, all are in trouble,” securities analyst Jackson Wong told Agence France-Presse. \n \n“They are in a very tough situation . . .” said Wong, associate director at Simsen Financial Group. \n \nRush to safety \nOther resources firms also sank. In Sydney BHP Billiton plunged 6.65 percent and Rio Tinto shed 4.57 percent, while Origin Energy plunged 10.43 percent and Santos gave up more than 9 percent. \n \nIn Tokyo, oil firm JX Holdings lost 4.32 percent and Kubota—which makes tractors and heavy equipment—fell 7 percent. Industrial robot maker Fanuc, which has close links to China, was down 3.8 percent. \n \nThe losses dragged all Asia’s bourses lower. Tokyo was down 4.05 percent at the close, while Sydney shed 3.8 percent. Hong Kong lost 2.97 percent and Shanghai was 2.02 percent lower. Wellington and Singapore both shed more than 1 percent. \n \nMarkets in New York and Europe were equally sideswiped Monday. The Dow, S&P 500 and the Nasdaq all saw hefty selling, while London, Frankfurt and Paris each lost more than 2 percent. \n \nForeign exchange dealers also fled to assets such as the yen which are considered safe in times of turmoil. The dollar fell to 119.37 yen from 119.93 yen Monday in New York, while the euro slipped to 134.54 yen against 134.83 yen. \n \nOn currency markets the resources-linked Australian dollar was down 0.6 percent against the US dollar at 69.48 cents, around six-year lows. \n \nThe South Korean won fell 0.58 percent against the US unit, the Thai baht shed 0.19 percent and Indonesia’s rupiah was 0.26 percent lower. Malaysia’s ringgit was down 1.2 percent. \n \nThe rupee eased 0.11 percent after the Reserve Bank of India (RBI) surprised analysts by lowering borrowing costs more than expected to try to shore up a tentative economic recovery. \n \nTuesday’s move was the fourth by the RBI this year. \n \nOil prices edged up after losing around 2.5 percent Monday. \n \nUS benchmark West Texas Intermediate added 0.05 percent to $44.45 and Brent was 0.19 percent up at $47.43. \n \nAFP \n \r\n\r \r \r\n\r \r\n\r\n\t\t\t\r\n\r \r\n        \r\n\t\t\r \r\n\r \n\n\r\n\r \r \n\r\n\r \n \n\r\n\r\n\r \r \n [embedded content] \r\n\r \n\r \r \n  \r\n            \r \r\n\r\n\r\n\t\t\r Columnists  \nThe US surrenders on AIIB (and that’s a generally good thing) \nBEN KRITZ \nROUGH TRADE \n\nGoing the way of horses? \nREAL CARPIO SO \nMANAGING FOR SOCIETY \n\nPNCC does not pay \nEMETERIO SD. PEREZ \nDUE DILIGENCER \n\nCherry-picking: Choosing the best \nREYLITO A.H. ELBO \nBEYOND BUZZWORDS \n\nA weak attempt to resurrect nanny-state stupidity \nBEN KRITZ \nROUGH TRADE \n At a Glance  London considers tie-up with Shanghai bourse Trade group backs probe on flour E- vehicle group defends DTI Iloilo Negosyo Center opens Asian shares mixed Japan Dec inflation slows again Megaworld to build 2nd Davao condo tower Globe catches repeater users AirAsia flies to Davao 1M subscribers", "source": "Manila Times"}