{"published": "2015-09-17T07:06:59Z", "media-type": "News", "title": "Tommy Middaugh Travel To Go Vice President Lists Top 3 Things to Do in New York", "id": "03642db7-203b-4500-b131-8d9b852aff92", "content": "PRWeb \nFor world travelers, there is probably no more iconic city to visit than New York. From the Empire State Building to the Statue of Liberty, the city's many historic structures and sites were famous long before they were glamorized on film. \n\nTravel To Go knows planning a New York vacation can be overwhelming with so many things to do and places to see. That is why Tommy Middaugh has released his list of top three things to do while in New York this fall. \n   \n1. Visit Times Square: The world-famous Times Square is a feast for the senses. From the massive digital billboards that light up the Square so that night remains day to the people peddling art and jewelry on the street to the street musicians like the Naked Cowboy -- who plays guitar in his tighty-whities -- this stretch of Midtown is what most people imagine when they hear the words \"New York.\" Visitors can take pictures with wax celebrities at Madame Tussauds or grab a meal along Restaurant Row (West 46th Street, between Eighth and Ninth Avenues), where many eateries offer prix-fixe deals. \n\n2. See a show on Broadway: Visitors don't have to walk far from Times Square to catch one of the many theater shows on Broadway. Seeing a show has become an essential part of any New York vacation. While ticket prices for some of the more popular shows can be high if purchased at the box office, there are discount tickets available online and at vendors in Time Square. For some shows, Tommy Middaugh of Travel To Go recommends travelers purchase their tickets well ahead of their trip as they sell out for weeks in advance. \n\n3. 9/11 Memorial: This is a more somber site, but Tommy Middaugh believes it is also an essential New York experience. Admission to the 8-acre memorial is free. The Memorial Plaza, which features more than 400 trees, also features waterfalls that flow into two large reflecting pools, in the towers' footprints. The bronze parapets that surround the pools are inscribed with the names of the people who lost their lives. The museum part of the memorial, which is located beneath the Plaza, houses exhibitions with artifacts, pictures, videos and accounts from people from around the U.S. and the world. \n\nIn New York and around the globe, Travel To Go is the industry leader people trust when seeking luxury accommodations for their next vacation. With years of experience and expertise, Travel To Go has the ability to help travelers find the vacation they have always wanted. To learn more, visit http://www.traveltogo.com \n\n### \n\nTravel To Go \n7964 B Arjons Drive \nSan Diego, CA 92126, USA \nPhone: (800) 477-6331 \n\nPress release distributed by JW Maxx Solutions, a leader in content management solutions and part of a family of companies that includes Enterate Ahora . \n\nRead the full story at http://www.prweb.com/releases/TravelToGoVacations/TommyMiddaugh/prweb12949156.htm \nPRWeb.com", "source": "SearchBug"}