{"published": "2015-09-29T07:49:29Z", "media-type": "Blog", "title": "Failure iOS 9 commits motion sensors of the iPhone 6s – Pplware", "id": "3f9a848a-f602-437f-9d3d-594695490a3c", "content": "The new iPhones arrived in force and already a sales success story, showing that Apple returned to hit full on their formula for success. However, and beyond these figures, there have been some problems with these new equipment. The latest is associated with a bug in iOS 9 and allocating the motion sensors of the iPhone 6s. This problem is affecting only new iPhones 6S and was discovered by those who try to use applications that use the sensors of the new M9 motion co-processor. This happened to be now included in the SoC A9 processor from Apple and serves as the interface between the operating system and the different sensors that equip the iPhone 6S. The problem is reflected in the inability to use applications that make use of data from the various motion sensors, and in particular InvenSense gyro six axes and the accelerometer Bosch Sensortec three axes. When sensors that these are intended to be used fail to transpose the data and applications are left with strange behavior, making it impossible to use. The problem is, for now, contained the new iPhone models and appear to affect only third-party applications that try to use these sensors. Any of the Apple applications that make use of these sensors, such as maps, do not have these problems and also older iPhone models do not seem to be affected for the problem. The problem was first discovered in the application Sky Guide, which uses these sensors to display on the iPhone screen a map of the stars that adjusts according to the user’s movement. The team that developed this application addresses the problem to an implementation with failures iOS API 9th Gathering M9 coprocessor information. This team is also trying to find a solution to this problem, returning the possibility of using the Sky Guide in the new iPhones. But it’s not just this application that is experiencing this problem. Several programmers, responsible for other similar and that make use of the iPhone motion sensors applications are to complain of it. From what has been possible to ascertain, this is not an exclusive problem of the iOS 9 and even the latest version, 1.9, is showing the same behavior. It is also the first time that this problem arises in iPhones. Already in 2013, at the launch of iPhone 5s, there was a similar situation at the time was attributed to lack of calibration of the new accelerometer Bosch now being used. So far, and how is normal in these situations, Apple has not yet issued any comments or additional information about the problem. It is expected very soon news that should come in the form of an update to iOS and that should correct the problem.", "source": "Information Technology Current News"}