{"published": "2015-09-30T20:15:00Z", "media-type": "News", "title": "The Cheesecake Factory to Webcast Third Quarter Fiscal 2015 Earnings Conference Call on October 26, 2015", "id": "6a5069de-87a1-4230-b56e-76cda896195f", "content": "The Cheesecake Factory Incorporated ( NASDAQ: CAKE ) today announced it \n      will release third quarter fiscal 2015 financial results after market \n      close on Monday, October 26, 2015. The Company will hold a conference \n      call to discuss its results on the same day beginning at 2:00 p.m. \n      Pacific Time. The conference call will be webcast and can be accessed on \n      the Company’s website, investors.thecheesecakefactory.com . \n      A replay of the webcast will be available on the Company’s website \n      through November 26, 2015. \n\nAbout The Cheesecake Factory Incorporated \n   \nThe Cheesecake Factory Incorporated created the upscale casual dining \n      segment in 1978 with the introduction of its namesake concept. The \n      Company, through its subsidiaries, operates 194 full-service, casual \n      dining restaurants throughout the U.S. and Puerto Rico, including 181 \n      restaurants under The Cheesecake Factory ® mark; 12 \n      restaurants under the Grand Lux Cafe ® mark; and one \n      restaurant under the RockSugar Pan Asian Kitchen ® mark. \n      Internationally, nine The Cheesecake Factory ® restaurants \n      operate under licensing agreements. The Company’s bakery division \n      operates two bakery production facilities in Calabasas Hills, CA and \n      Rocky Mount, NC that produce quality cheesecakes and other baked \n      products. In 2015, the Company was named to Fortune magazine’s “100 Best \n      Companies to Work For” list for the second consecutive year. To learn \n      more about the Company, visit www.thecheesecakefactory.com . \n\nFORTUNE and 100 Best Companies to Work For® are registered trademarks of \n      Time Inc. and are used under license. From FORTUNE Magazine, March 15, \n      2015 ©2015 Time Inc. FORTUNE and Time Inc. are not affiliated with, and \n      do not endorse products or services of, The Cheesecake Factory \n      Incorporated. \n\n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150930006543/en/", "source": "Town Hall"}