{"published": "2015-09-04T20:42:45Z", "media-type": "News", "title": "Public invited to patriotic event at Waky elementary", "id": "03384b5b-5413-4eb8-9d51-b115d786a0c8", "content": "WAKARUSA — The staff and students of Wakarusa Elementary School invite the public to celebrate Patriot Day with a visit to the school gym Friday at 8:10 a.m. \n  \nThe school is located at 400 N. Washington St. near downtown Wakarusa. \n \nThis annual tradition, more generally known as “National Anthem Day” for the school, began as a way to educate the students on the significance of the song, “The Star Spangled Banner,” which was penned in 1814 by Francis Scott Key as the War of 1812 was ending. \n \nAccording to vocal music teacher Shawn Skaggs, the realization that so few knew of the powerful message behind the lyrics was worth taking the time to educate. \n \n“The idea to start National Anthem Day came from a national poll which showed less than 40 percent of Americans today know the words to their national anthem, and many have little understanding of the meaning behind the text, and why they hear it sung or played at events across America,” Skaggs explained. \n \nThis year marks the eighth commemoration of the event, “and it continues to be something the students look forward to yearly,” she added. In the days prior to this ceremony, the children spend time learning about the history of “The Star Spangled Banner,” as well as “the poetic language of the lyrics, the correct note values and melody, and the proper behaviors to demonstrate whether it’s sung or played,” Skaggs said. \n \n“This day has really become a chance for our students to reflect on what they’re truly thankful for in their everyday lives and what freedom means. Students have also learned and will present other patriotic songs demonstration their knowledge of our country’s heritage through music,” she said. The entire community is welcome to attend, with particular reverence for those who have been or are currently in service to America. \n \nFor more information, contact Wakarusa Elementary School at 574-862-2000 or connect with Skaggs via email at sskaggs@wanee.org .", "source": "Goshen News"}