{"published": "2015-09-07T02:17:51Z", "media-type": "News", "title": "20 evacuated as fire tears through flats and shops", "id": "d81baeec-038c-4bfe-a2c0-27eaefb53f04", "content": "Around 20 people were evacuated from their homes after an \"apocalyptic\" fire broke out in a market town. \n\nFire crews rescued several people trapped inside a flat as a blaze erupted in Sudbury in Suffolk this evening. \n\nThe fire broke out in a nail salon and then locals said they heard an explosion and it quickly spread to adjoining shops and the flats upstairs. \n\nHundreds of people spilled on to the street below as flames ripped through the old building and thick, black smoke billowed into the sky. \n\nFamilies, some with small children and in tears, were evacuated from their homes and given blankets by ambulance crews. \n\nSarah Pheby, 28, an administrator whose flat is across the street, said: \"The fire looks apocalyptic. \n\n\"I could feel the heat of the flames on my face when I looked at it through the window, and that was through my double glazing. \n\n\"The first floor of the building has collapsed, it is just a shell now. The roof has gone. \n\n\"It started in Celebrity Nails, which isn't a particularly big shop. Then there was an explosion and it just spread incredibly quickly.\" \n\nShe said firefighters in cherry pickers were sent up to people trapped in the flats above. \n\nShe said: \"There was someone in the top floor, I hope they got out OK. I could see them in the top floor window, the firefighters went up there.\" \n\nAround 15 fire engines and dozens of crew rushed to the town centre to tackle the blaze, which they have been battling for hours. \n\nPolice were called at 6.25pm to help and at 7pm a full evacuation of the area was launched. \n\nLuke Cresswell, a teaching assistant and local councillor, said: \"I saw around 20 people being evacuated. They were given covers and looked really upset. \n\n\"There were families including children. They looked really shaken up, some of them were crying. A couple of the young girls only looked around five or six years-old and were very upset. \n\n\"They were given blankets and taken to the side by an ambulance where they were being looked after.\" \n\nOthers were trapped inside a flat and had to be rescued. \n\nCllr Cresswell, 27, said: \"You could see them come out with firemen and women. \n\n\"The fire is huge and proper black. I kept thinking it had died down but it flared up again. The fire is literally right in the middle of the town centre.\"", "source": "AOL UK"}