{"published": "2015-09-15T18:09:43Z", "media-type": "News", "title": "ANST Qualifies EoPlex CSI™ Platform", "id": "c465d7e7-68b0-40ee-bfd2-2650b9fe0c4b", "content": "3D Printed Interconnect Disrupts Semiconductor Packaging World  \n      \nSAN JOSE, Calif. , Sept. 15, 2015 /PRNewswire/ -- EoPlex, Inc., a subsidiary of ASTI Holdings, Ltd. (ASTI:SP) and developer of the world's first 3D printed interconnect for semiconductor packaging announces the qualification of its CSI™ platform with Wuxi China Resources Micro-Assembly Technology Co., Ltd. (ANST), a leading Chinese IC assembly and test company. \n  \n \nEoPlex is the only company with multi-material additive printing capability, enabling 3D printing using polymer, metal, and ceramic materials. Today, the CSI™ platform is used to print semiconductor interconnect and enable significant cost and size reduction of QFN, QFP, and BGA packages while improving electrical and thermal performance. The CSI™ platform is also applicable to advanced multi-die, multi-chip applications such as SiP and PoP. \n \n\"EoPlex 3D HVPF™ technology is a radical departure from traditional 3D technology, and the CSI™ Platform is transforming semiconductor packaging, beginning with QFN packages. We are delighted to forge a partnership with ANST in reshaping the semiconductor packaging world, allowing companies to better respond to the explosive demand in the mobility market,\" said Robert Bagheri , EoPlex COO. \n \nANST has qualified the CSI™ Platform for use in QFN packages, and the CSI™ Platform will be available to select customers for disruptive consumer, automotive and medical product designs. \n \n\"ANST has worked with EoPlex to qualify the CSI™ Platform and provide our customers with a versatile interconnect solution that offers superior electrical and thermal performance. The CSI™ Platform offers the thinnest possible form factor available, and enables the development of thinner, lighter, and more reliable packages. ANST is now accepting designs for single and multiple die products for high volume production,\" said Mr. Zhang Xiao-Jian , General Manager, ANST. \n \nContact EoPlex at info@eoplex.com , ANST China Sales contact Wilson Ma at Wilson_ma@anst.crmicro.com , or ANST USA Sales contact Paul Emmett at paul.emmett@anst.crmicro.com . Contact Linda Chan at pr@eoplex.com for all media inquiries. \n \nAbout EoPlex, Inc. \n \nEoPlex, Inc . is based in San Jose, CA , and has developed a disruptive, multi-material additive printing platform, which facilitates the manufacture of 3D-printed components for advanced products in diverse applications as batteries, fuel cell components, energy harvesters, sensors, and more. Today this platform is being used for 3D-printing semiconductor packaging interconnect. The CSI™ platform enables remarkable package designs, which provide significant reductions in cost and size while improving thermal and electrical performance. EoPlex is a subsidiary of ASTI (ASTI: SP), and is backed by ATA Ventures, Draper Fisher Jurvetson, Labrador Ventures and Draper-Richards. Visit us online at http://www.eoplex.com for more information. \n \nAbout Wuxi China Resources Micro-Assembly Technology Co., Ltd. (ANST) \n \nWuxi China Resources Micro-Assembly Technology Co., Ltd. (ANST) is one of the largest full turnkey OSAT semiconductor companies in China , located 100km east of Shanghai , mainly providing lead frame based package and test service. \n \nTogether with sister companies under China Resources Micro-electronics (CRM), ANST provides full semiconductor turnkey services from Wafer Mask Design, Wafer Foundry,  Wafer Sorting, and to Assembly & Test with its 1 Mask Manufacturing Line, 5 Foundry Lines, 1 wafer Sorting Line, 1 Assembly Line and 1 Final Test Line in Wuxi.  \n \nCRM is a subsidiary of China Resources, which was ranked as 115th in TOP 500 Fortunes worldwide with US$74.8Billion annual revenue. \n \nVisit us online at http://www.crmicro.com . \n \nLogo - http://photos.prnewswire.com/prnh/20150915/266739LOGO  \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/anst-qualifies-eoplex-csi-platform-300143386.html \n \nSOURCE EoPlex, Inc. \n Back to top  \nRELATED LINKS \nhttp://www.eoplex.com", "source": "Michigan Live"}