{"published": "2015-09-15T14:22:11Z", "media-type": "News", "title": "Alcohoot Successfully Demonstrates Power of Innovation by State Governments to Combat Drunk Driving", "id": "86467bc2-478a-4c9c-a6cf-c9c127266cc9", "content": "SOURCE Alcohoot\n\nColorado's Department of Transportation leads the charge to utilize smartphone breathalyzer technology to breathe new life into existing statewide drunk driving awareness campaigns\n\nNEW YORK \n\nAlcohoot connects with a smartphone to allow users to monitor and track their personal blood-alcohol level, and is the latest development in activity tracker technology that can be used to promote health and wellness. To encourage people to use this technology, the Colorado Department of Transportation (CDOT) hosted a number of events during the Labor Day \n\n\"We're extremely excited to be partnering with two industry leaders that help people stay safe while drinking,\" said Sam Cole \n\nOver three days, representatives from Alcohoot let nearly 800 people sample the device in LoDo district \n\nThe public response was overwhelmingly positive. Stories were shared by participants at the events about how drinking and driving had affected their lives and Alcohoot provided insight into the numerous factors that play a role in blood alcohol content. The events coincided with the Labor Day \n\n\"Alcohoot is extremely proud to have joined CDOT and Uber in this innovative approach to promoting safety and responsibility,\" said Chris Ayala \n\nAbout Alcohoot\n\nAlcohoot, the flagship brand of Vertisense Inc., is the world's most advanced smartphone alcohol tracker. Alcohoot's FDA-registered device uses a police grade fuel cell sensor to accurately measure blood alcohol content through iOS and Android apps. The free app lets users track their blood alcohol content, connects to ride-share services, and locates nearby restaurants.\n\nVertisense Inc. is a Techstars company based in New York City developing innovative hardware and software solutions for human condition monitoring to accurately test and track a person's health. For more information, visit www.alcohoot.com.\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/alcohoot-successfully-demonstrates-power-of-innovation-by-state-governments-to-combat-drunk-driving-300143197.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WXTX Fox 54"}