{"published": "2015-09-01T14:31:01Z", "media-type": "News", "title": "Second Suspect In Bangkok Bomb Attacks Arrested", "id": "5f16a643-0ee5-409d-9556-e0fbbb1a1b36", "content": "By Minggu Simon Lhasa \nBANGKOK, Sept 1 (Bernama) -- Thai security authorities arrested a foreigner suspected of being involved in the bomb attacks in Bangkok last week in a province close to the Thai-Cambodia border. \n\nPrime Minister General Prayuth Chan-ocha, said the male suspect was arrested this morning in Thai territory, indicating that the country has achieved a lot of progress in the case since the arrest of the first suspect on Saturday. \n\n\"I have been informed about the suspect's arrest during lunch time. He was arrested in Parai village in Sakeaw province,\" he announced in a media briefing this afternoon. \n\nHe described the man as an important suspect. Sakaew province is located in the eastern part of Thailand and about three hours' drive from Bangkok. \n\nWhile the Thai authority is reluctant to name the suspect or his nationality, the social media already provided the information. \n\nAccording to the info in social media, Twitter, LINE chat application and Facebook, the latest suspect who was arrested today is a 25-year-old Chinese national who came from Xinjiang, the home province of Muslim Uighur ethnic group. \n\nHe is charged with exiting Thailand without permission. \n\nMeanwhile, Thai police spokesman Police Lieutenant General Prawuth Thavornsiri said the suspect is believed to be in the same group of the first suspect arrested last Saturday that was responsible for the bomb attacks in Bangkok. \n\nThe suspect was detained and was under questioning at a military camp, Prawuth said. \n\nHe said witnesses were also asked to identify and confirm the suspect, and DNA from the suspect will be compared with the DNA found in the rented rooms that were raided by the authorities a few days ago in the districts of Minburi and Nong Chok, both in Bangkok. \n\nSo far, the Thai court has issued warrants of arrest for seven suspects in connection with the two bomb attacks in Bangkok, one at the Erawan shrine at Ratchaprasong intersection in central Bangkok and another at Sathorn pier at the Chao Phraya river. \n\nThe Minburi Court today issued warrants of arrest against three foreign male suspects, but the police refused to reveal their nationalities. \n\nYesterday, the same court issued two warrants of arrest for a Thai Muslim woman, 26-year-old Wanna Suansan, who is believed to be in Turkey at the moment and an unidentified man. \n\nThe Royal Thai Police chief, Police General Somyot Pumpanmuang said Wanna who is considered as a suspect has contacted the authority and wanted to return to Thailand to clear her name. \n\nHowever, there is still no date yet of her return, he added. \n\nIn the same case last week, two warrants of arrest were issued against the bomber at the Erawan shrine, identified only as the man in a yellow shirt and just a police sketch, and an unidentified man in relation to the bomb attack at Sathorn pier. \n\n-- BERNAMA", "source": "Bernama"}