{"published": "2015-09-19T11:24:08Z", "media-type": "News", "title": "Brotherly love is all you need, insist Andy and Jamie Murray", "id": "55ffaf7f-9925-463f-927b-a9b705da7d62", "content": "Andy Murray felt his brotherly bond with Jamie helped edge Great Britain into a Davis Cup lead over Australia following an epic doubles match in Glasgow. \n \nThe Murrays overcame Lleyton Hewitt and Sam Groth after five gruelling sets at a noisy and packed Emirates Arena to put Britain 2-1 up and within touching distance of their first Davis Cup final for 37 years. \n \nThe Australians took the first set 6-4 but the brothers hit back to claim the second 6-3 and turned the next set around after Groth missed the chance to put his team 5-2 up when he volleyed wide. The Scots broke their opponents in that game and the next service game to take the set 6-4. \n \nThe fourth set veered one way and another before Andy Murray missed the chance to serve it out. Some good net play from Groth averted a match-point on the tie-break before the two brothers handed Australia the set when they went for the same ball at 6-7. \n \nBut the powerful Groth began to struggle on his serve throughout the decider to allow the Murrays to win it 6-4 despite being broken back. \n \nAndy Murray said: \"It was an incredible match, especially to come back from the disappointment of losing the fourth set. We kept creating chances and stuck together like brothers should. We just managed to come up with enough good returns to get through it.\" \n   Promoted stories   \nHis older brother added: \"They kept fighting and we had to win in five and thankfully we did. We kept fighting hard and didn't panic. \n \n\"It's so noisy in there, it's hot, it's draining with all the emotions from the first point to the last. I'm just really glad we could get through it.\" \n \nThe brothers were roared on by more than 7,000 fans, including all of their close family. \n \n\"It was brilliant,\" Jamie Murray said. \"For us to come back and play in Scotland is always a lot of fun. Obviously there was a lot at stake for the team, doubles is always such an important rubber in Davis Cup.\" \n \nAndy Murray can now clinch a final against Belgium or Argentina in Sunday's first singles match. He is due to face world number 23 Bernard Tomic but Hewitt could be afforded another chance to prolong his Davis Cup career. \n \nAfter four hours and 20 minutes on court, Murray has a job freshening himself up for the final day, but Tomic looked tired after his four-set win over Dan Evans on Friday. \n \nThe British number one said: \"Physically it's tough but also emotionally matches like that are draining. I don't think enough is made of that.  They are very, very tough, matches like that, a lot of ups and downs and chances for both teams. \n \n\"Doubles matches are not as physically demanding as you are covering less of the court but there are certain movements I'm not used to making, so after doubles matches sometimes my body gets a little bit stiffer in certain places. \n \n\"But I had a quick match on Friday and it's more of the emotional toll for me in a match like that.\" \n \nAustralia captain Wally Masur insisted his side still have a good chance of victory and he will make a late call on who faces the Olympic champion. \n \n\"It was a great doubles, the crowd made it interesting and got behind their boys,\" Masur said. \n \n\"I'm extremely proud of our boys, they left everything out on the court and came within a whisker of winning. \n \n\"We're still in this and one of the great things, that was a four hour and 20-minute match. We didn't quite get the result we wanted but we did take a little bit out of Andy for tomorrow's match. \n   \n Share article  \n   \n\"Andy was scintillating in his singles but he won't feel as good as he did on Friday, that's for sure, because that was brutal. Playing with that tension for that amount of hours is tiring in itself. \n \n\"We do have that versatility with four singles players but we will make our decisions in the morning. We will assess how everyone is feeling and come up with something.\"", "source": "Chard & Ilminster News"}