{"published": "2015-09-14T10:06:59Z", "media-type": "News", "title": "West Brom captain Darren Fletcher gave Saido Berahino a pep talk", "id": "775c15f7-dc68-49d4-af52-e195106f967b", "content": "Darren Fletcher revealed he has given Saido Berahino a pep talk to aid the striker's West Brom recovery. \n \r\n\t\t\r \nThe Baggies skipper has spoken to the forward after he threatened to strike when a deadline day move to Tottenham was blocked. \n\r  Tony Pulis thinks Callum McManaman tried to win a penalty with a dive \r \r \nBerahino returned to the Albion team, after being left out of their previous three games, as a second-half substitute in Saturday's 0-0 draw with Southampton. \n\r\n\t\t\t\r \nHe had tweeted threatening to never play again after the Baggies rejected Spurs' deadline day offers but Fletcher has offered his advice. \n\r\n\r\n\r\n\r \n\"I have had a word to him and we'll keep that private and the lads have given him a bit of stick,\" said the former Manchester United midfielder. \n\n\"Sometimes that's the best way because it takes away the tension. \n\n\"Somebody comes in and has a little bit of a go at him and a little bit of banter and I'm sure he feels like one of the lads again, which he very much is. \n\n\"I think a couple of the older lads have maybe tried to help him but there has not been anyone having a go it. \n\r\n\t\t\t\r \n\"All you can do is do your best and speak to him. \n\n\"He might not take on board everything you say but if he only takes on board a little bit and it makes him stop and think for a little bit then I've done my job.\" \n\nBut Fletcher admitted he did not understand why Berahino took to Twitter to vent his frustration on deadline day. \n\n\"Not really, no. You try to speak to him and tell him a certain way to do things but it's about emotions really,\" said the 31-year-old. \n\r\n\t\t\t\r \n\"People are emotional and you do silly things and when you're on Twitter it is there and you can voice your opinions. \n\n\"If he had sat quietly for 48 hours he wouldn't have done it, but it's just emotions at the time.\" \n\nThe game was forgettable, Berahino's return apart, as Jay Rodriguez wasted Southampton's best chance and Callum McManaman had a penalty appeal turned down for the hosts but was criticised by boss Tony Pulis for diving. \n\nVirgil van Dijk impressed in his Saints debut after a £13million switch from Celtic and the Dutch defender hopes his move can improve his international prospects. \n\nHe said: \"That's something for the future. I've been called up for second game now and didn't play, so I'm close but not close enough but just need to keep improving. \n\r\n\t\t\t\r \n\"I just played my first game in the Premier League and kept a clean-sheet, which you never know what happens next week, but we just need to keep going. Keep the good team spirit high. \n\n\"It means a lot to play for Ronald Koeman, it's an honour for me. He was an amazing player. He played for the biggest clubs. I think I can learn a lot off him. \n\n\"He was a coach at the biggest clubs, so I'm very happy and can't wait to keep him improving.\" \n\n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Ballymoney Times"}