{"published": "2015-09-25T03:55:36Z", "media-type": "News", "title": "Roberto Baggio hails Mario Balotelli as one of the world's best", "id": "15266138-7ad9-4ff0-8177-d99ef74d1868", "content": "It's not every day that a former professional, arguably considered to be one of Italy's finest imports, tells you that you that you are the creme de la creme of world football. \n \nPerhaps it was just former Italy and Juventus forward Roberto Baggio trying to be nice, or maybe he was just trying to give the childish Mario Balotelli an ounce of positivity that could help reignite his career. \n \nUnfortunately for Baggio, who is considered to be one of Italy's greatest ever footballers, the 48-year-old's questionable compliments could either result with the 1993 Ballon d'Or winner being heralded as a master of persuasion, or a figure responsible for the eventual implosion of the ticking time bomb that is the 25-year-old Balotelli. \n SUBMIT AN ARTICLE  \nApply to become a GMS writer by signing up and submitting a 250 word test article: http://gms.to/haveyoursay5 \n \nWhatever way you look it at, there was no reason why Baggio, during his meeting with Balotelli, should have told the AC Milan striker that he is one of the best strikers in the world. \n \nOn one end of the spectrum, Baggio probably thought that the best way to get to Balotelli's heart would be flattery - something the striker has been short of in recent years. \n \nHowever, on the flip side, and which is seen as much more of a concerning matter, is that no one knows how Balotelli would have received the message, and what implications it could have on the rest of his loan spell from Liverpool at the Italian giants. \n \nBaggio, known around the world for bowing his head when he missed the decisive penalty kick in the 1994 World Cup final, could be about to do the same again if Balotelli decides to take his foot off the gas now that he has been hailed to such extents. \n \n\n \nDubbed as being his 'last chance ever' by AC Milan vice-president Adriano Galliani, Balotelli, since his arrival back at the club he left for Liverpool last summer, has been out to prove that he still has a future at the top of European football, even revealing to the media that he is 'starting to behave in the home dressing room'. \n \nIf this is anything to go by, it is fair to say that Balotelli is giving 100% to not revert back to his old ways, with his behaviour still likened to that of an ill-mannered school boy on probation. \n \nWhilst there is no doubt that Galliani and AC Milan are aware of the talent that Balotelli possesses, it remains to be seen whether they have the patience to allow him to rediscover his touch. \n \n\n \nAfter all, AC Milan, despite being replaced by Juventus as Italy's most valuable outfit, know that a player such as Balotelli could be a threat to their position in the global economy if he does anything to tarnish the club's name. \n \nRegardless, though, one free kick against a struggling Udinese side does not make you a sight to behold, and Balotelli must be aware that he needs to deliver on a regular basis in order to justify Baggio's opinion of him. \n \n\n \nIt will be interesting to see how Balotelli takes this compliment when he lines up against Genoa on Sunday, with Baggio surely hoping that he hasn't gone and created more of a monster than has been already. \n \nDo YOU want to write for GiveMeSport? Get started today by signing-up and submitting an article HERE: http://gms.to/writeforgms", "source": "GiveMeSport.com"}