{"published": "2015-09-25T12:44:00Z", "media-type": "News", "title": "Saudi Arabia Faces Criticism Over Hajj Stampede That Killed 700", "id": "24bb4379-d23e-446f-9567-5bf712df478c", "content": "Saudi Arabia is defending itself against criticism after a stampede in Mecca killed at least 717 hajj pilgrims and injured more than 850 others — the worst such incident in a quarter century. \n\nThe BBC reports that Iran's Supreme National Security Council accused Riyadh of \"incompetence\" for the government's handling of security and called on the Saudis to take responsibility for the deaths. Saudi King Salman has ordered a safety review of the annual pilgrimage. \n\nPilgrims from Iran make up the bulk of the deaths reported so far. \n\n\"Unfortunately, these incidents happen in a moment,\" Interior Ministry spokesman Maj. Gen. Mansour al-Turki said at a news conference. \n\nThe stampede occurred Thursday as the faithful carried out a symbolic stoning of the devil by throwing pebbles against three stone walls. Turki said that initial reports indicated that \"two crowds coming from opposing directions converged at an intersection in Mina, on the outskirts of Mecca, when the pushing and shoving started,\" according to Associated Press reports. \n\nAP reporter Aya Batrawy, speaking on Thursday's All Things Considered , said that \"from the survivors that I spoke to, they say that for them, it's pretty clear that the Saudi authorities didn't manage the crowds properly.\" \n\nNPR's Ofeibea Quist-Arcton reports that \"there's been sharp criticism of the Saudi organizing authorities and a backlash against reported comments on Saudi-owned al-Arabiya TV. The network reportedly quotes the head of the central hajj committee blaming the stampede on the lack of discipline by some African pilgrims.\" \n\nThe AP says that hajj drew 2 million people from more than 180 countries this year and adds that it's \"a huge logistical challenge for Saudi Arabia. The kingdom has spent billions of dollars to accommodate the growing number of pilgrims and maintain safety and security at Islam's holy cities of Mecca and Medina for the annual event.\"", "source": "WWNO"}