{"published": "2015-09-22T19:12:14Z", "media-type": "News", "title": "5 Questions to Ask Before Signing a Term Sheet", "id": "3d692190-474d-4e67-b34a-0e520465691c", "content": "Startups looking for a venture capital investor often struggle to navigate the different options out there. How do you find the best VC to help turn your startup into a major player? What do good VCs do that the not-so-good ones don't? \n \nRelated: VC 100: The Top Investors in Early-Stage Startups \n \nHere are five things to look for when evaluating potential investment partners. \n 1. Can they actually measure and predict their performance?  \nIf you want to impress a VC, says OpenView’s founder, Scott Maxwell , you should be able to predict the performance of your operating model -- by offering a clear understanding of the model, knowing your warning indicators and benchmarking against other competitors. This holds true for VCs as well. \n \nThey need to be able to show you the system they use to track their portfolio companies, look for signs of success and warnings and predict what they (and you) can do with this information. Such tracking comes from documenting their own real results; measuring any increase in sales or decrease in sales cycles; and opening up new markets for their portfolio companies. \n 2. Are they experts in their field?  \nA good venture capital firm will employ people who have actually worked in software and led software companies. In other words, they have some real world experience in the market that you operate in and care about. True experts will be able to help you develop go-to-market strategies, create in-depth marketing blueprints, recruit new talent, help train your sales team, help with market research and much more. \n \nRelated: Everything You Need to Know About Attracting Venture Capitalists \n \nWhile any VCs can say they have value-add teams and experts on staff, only a handful of firms actually follow through. Just as VCs need to do their due diligence, startups need to check references, too. Be sure to speak with a firm’s existing portfolio companies to see if all that talk actually translates into action once the term sheet is signed. \n 3. Do they provide a quick response?  \nThis may not seem like much, but when you're trying to run your business and need help from your VC, you'll want to know you can get the help you need when you need it. \n \nIf you want to test a VC firm, email someone there (an associate or partner you’re interacting with, or someone on the value-add team) and see if that person actually responds. You should be able to get a response back in fairly short order. After all, the VC firm's goal is to help its portfolio succeed. If its personnel aren't doing that, you really can’t be sure what they’re doing. \n 4. Do they recognize their own weaknesses?  \n In a recent blog post I noted that one of the five things great entrepreneurs do is recognize their own weaknesses and work to overcome them. They see their problem areas and are willing to fix them. \n \nIt's the same with a VC firm. If its personnel have a hole or gap in their core competencies, they'll work to close it up by hiring professionals with the necessary skills and experience to solve the problem. \n 5. Are they intellectually curious?  \nIf you've never met with VCs, be prepared to answer a lot of questions. A lot of questions. Think of a time when you were peppered with questions fired at you from all directions. It's like that, only more intense. They should want to know a lot about you, your company, idea, market and competition and be willing to go beyond the superficial. \n \n As one of my partners, Blake Bartlett, has said , “Much of a VC’s time is spent meeting with people who all make big, hairy, heavily-biased claims. Taking everyone at face value is a recipe for disaster -- competitors bash their rivals; startups minimize the threat of an incumbent; executives inflate their departments’ achievements; and customers can be over-eager early adopters, on one hand, or stubborn hold-outs on the other. \n \n\"You must ask, “why?” over and over until you have enough dots to connect.” \n \nWhen you're looking for a VC, then, keep in mind that you're looking for a partner whose mission will be to help your company grow and succeed. The good VC firms will help you grow by providing you with as much talent, expertise and work as you can handle. \n \nThe not-so-good ones won't. \n \nSo, find one whose staff know what they're doing, can prove it and have the experience and knowledge to help you meet your goals. \n \nRelated: Venture Capitalists Can Be a Blessing or a Curse", "source": "FOXNews.com"}