{"published": "2015-09-18T20:15:44Z", "media-type": "News", "title": "Schedule now released – January 2016 PADI IDC Gili Islands, Indonesia | Asia’s Best", "id": "60f2fae8-afeb-4593-b1f5-e53456f032be", "content": "Gili Islands, Indonesia - All Instructor level training is conducted by Holly Macleod; resident Platinum PADI Course Director at Trawangan Dive; the first established PADI 5 Star IDC Career Development Center (CDC) and resort in Lombok and the Gili Islands. \n\nJanuary 16th – 26th January (Pre-IDC 11th - 15Jan) \n   \nCandidates are safe in the knowledge that courses are conducted at a facility that not only meets, but exceeds the highest possible standards when it comes to dive center rating criteria. Candidates can also be confident that the program is conducted by one of the most globally recognized scuba instructor trainers active in the industry. \n\nThe pre-IDC preparation courses starts on 11th January and is designed to review the knowledge and skills from the Divemaster Course including dive theory and mastering the dive skills circuit. It is also a great chance to meet others on the course and take advantage of the free fun diving option that the IDC includes. \n\nThe PADI Instructor Course (IDC) starts on the 16th January and runs for approximately 11 days. The program covers all of the mandatory components required by PADI including General Standards and Procedures, Risk Management, Business of Diving, Sales, Marketing. Other workshops include training in Open Water, Adventures in Diving, Controlled Emergency swimming Ascent and descent workshops, dive site setup and student control. During the program candidates will also learn about the various PADI programs such as Discover Scuba Diving (DSD) program, PADI Specialty Courses, the Rescue Diver Course, the Divemaster Course and the Adventures in Diving program. Another large portion of the program involves mastering how to deliver course components in the classroom, confined water and open water environments in a fun and educational way. \n\nTo find out more about the Award Winning PADI IDC Gili Islands Achievements check out the PADI IDC Indonesia Group or contact Holly Macleod Platinum PADI Course Director \n\nhttp://idc-indonesia.blogspot.co.id/2015/09/changing-lives-padi-instructor-padiidcgiliislands.html \nhttps://www.youtube.com/watch?v=dqI7GjWPgEI \n\nContact: \nJustin Time Publications \nThe PADI IDC Indonesia \n+62 (0)821-4785-0413 \nidc@trawangandive.com \nwww.idc-gili.com", "source": "Town Hall"}