{"published": "2015-09-23T16:15:34Z", "media-type": "News", "title": "UberX rides are safe, says Choice, busting the taxi council's risk claims", "id": "6e9e28ee-22c0-49d1-823d-c66946225367", "content": "Choice says it has debunked the NSW Taxi Council's claims that ride-sharing services places passengers at risk, declaring leading disrupter Uber as safe and reliable. UberX drivers hauled through courts\n\nA consumer advocacy group says it has debunked the NSW Taxi Council's claims that ride-sharing services places passengers at risk, declaring leading disrupter Uber as safe and reliable.\n\nIn the wake of the state government's announcement a , the lobby rolled out an advertising campaign with the slogan: \"Ridesharing. It's no safer than hitch-hiking\".\n\nChoice scrutinised the claim. Its staff made 56 trips around Sydney - half UberX rides and half regular taxi rides - in pairs and at seven different times to capture surge pricing.\n\nIt concluded that ride-sharing service UberX, which is illegal under the NSW Passenger Transport Act, was safe, reliable and cost effective.\n\n\"When we looked at a comparative between UberX and the taxi industry on things like checks, record of trip, GPS tracking, rating system and insurance, UberX performed very well, as did the taxi industry,\" said Choice's Tom Godfrey.\n\n\"The taxi industry is running an almighty scare campaign. But what we need to do is to stand back and have a level-headed approach to any regulations required, with consumers interests firmly at the centre.\"\n\nThe NSW Taxi Council said it stood by its slogan and that Choice had compared a legal industry, with an illegal and unregulated one.\n\n\"[We] believe it is in the consumer's interest to make them aware that if they get into a private illegal ride-sharing vehicle with a private driver where there are no government-backed checks for safety and security; it is akin to hitch-hiking,\" it said.\n\nThe Australian Taxi Drivers Association, which is attempting \"to put UberX out of business\", said the fact there were no incidents or accidents in the 56 trips did not prove it was a safe service.\n\nChoice found UberX was cheaper than a taxi about nine times out of 10. It also said taxis were 40 per cent more expensive on average.\n\nOn three occasions, UberX was an average of 6 per cent more expensive because of surge pricing. Of the 28 UberX rides, Choice encountered surge pricing four times.\n\nIt found taxis showed up quicker on average, largely because they could be hailed off the street.\n\n\"However, when taxis were booked they tended to take longer to show up than UberX. There were also two times taxis didn't show up at all, pointing to the well-known issue across the industry around reliability,\" said Choice's campaigns director, Matt Levey.\n\n\"Part of the problem may be that taxi drivers are told the passenger's destination, which may make short trips less attractive. Uber drivers on the other hand aren't given your destination until they turn up.\"\n\nMichael Jools, president of the Australian Taxi Drivers Association, conceded the taxi booking process was flawed.\n\n\"The reliability of a booked service is vastly improved when a confirmation takes place between the accepting driver and the passenger,\" he said.\n\n\"The ATDA believes that such confirmation should occur with taxis, and that it is a fault of the taxi networks not to have such procedures. Fix that up,\" he said.\n\nChoice released the findings ahead of the taskforce delivering its recommendations to the Government in late October.\n\n\"The point of regulating should be to protect consumers and encourage competition in the market, not to protect one particular business from its competitors,\" said Mr Levey. The story first appeared on The Sydney Morning Herald.", "source": "Wagga Wagga Daily Advertiser"}