{"published": "2015-09-30T18:12:00Z", "media-type": "Blog", "title": "Why The Nazis Believed They Could Win the Battle of Britain", "id": "8eddaa3b-b41d-4235-a9ec-89a8f8666002", "content": "This year marks the 75th anniversary of the Battle of Britain, the first time in history that one nation tried to defeat another using airstrikes. Here’s how the Nazis thought they could do it—and how agonizingly close they actually came to achieving victory. The Fall of France The future looked exceptionally bleak for Britain in the summer of 1940. After just six weeks of frantic fighting, its only remaining ally, France, signed an armistice with Nazi Germany on June 22. To rub it in, Adolf Hitler had the signatories sign it in the same railway carriage where the armistice of November 11, 1918 was signed, officially marking the end of the First World War. Advertisement With France fallen, Britons fell into a state of shock. The remarkable evacuation at Dunkirk offered some consolation after the disaster, but nearly all of the British army’s weapons and vehicles were left abandoned on the other side of the English Channel. Many Britons convinced themselves that it would only be a matter of time before the Nazis marched on British soil. Left: British troops evacuating Dunkirk’s beaches (public domain)\nBut in the immediate days following Germany’s stunning victory, Hitler had other ideas. Given just how quickly the Wehrmacht had overtaken France, and given the sorry state of the British Army, the Fuhrer was certain that Winston Churchill—Britain’s newly appointed prime minister— would have no choice but to enter into peace talks. Churchill steadfastly refused, telling the House of Commons that the British government was prepared to fight despite the costs or the odds, “so that if the British Empire and its Commonwealth last for a thousand years, men will still say: ‘This was their finest hour.’” One month later, a clearly irritated Hitler made one last appeal to the British in a speech at the Reichstag: In this hour, I feel it to be my duty before my own conscience to appeal once more to reason and common sense in Great Britain, as much as elsewhere. I consider myself in a position to make this appeal since I am not the vanquished begging favors, but the victor speaking in the name of reason. I can see no reason why this war must go on. Churchill disagreed, vowing to protect Britain from sinking “into the abyss of a new dark age.” Operation Sea Lion German plans to invade Britain appeared as early as 1939, but it wouldn’t be until the collapse of the French Third Republic that the idea took on an added fervor. In early July 1940, Hitler issued Directive No. 16 for “Preparations of a Landing Operation against England,” a plan that would evolve into Operation Sea Lion.\nThe German plan was ambitious—if not completely unrealistic. After reviewing the directive, Grossadmiral Erich Raeder complained to Hitler about Germany’s naval inferiority as it stood in contrast to the Royal Navy. He argued that the Kriegsmarine couldn’t possibly provide sufficient transports for the 40 divisions which the Wehrmacht planned to land; the German Navy, with only a few weeks to prepare, were suddenly tasked with transporting the first wave of 100,000 men, along with tanks, motor transport, and equipment across the Channel. And it would have to do so against the formidable Royal Navy and Royal Air Force (RAF). Raeder explained to Hitler that an invasion should only be attempted after the German air force, known as the Luftwaffe, achieved air superiority over the Channel and along the English coast. By comparison, the Normandy landings of 1944 involved 156,000 men from over a dozen countries spread across 10 divisions. But unlike the Allies, the German planners didn’t have the benefit of an entire year to prepare, nor the industrial might of the United States. German forces would have to cross the choppy waters of the 20 mile long (32 km long) English Channel, which was dubbed the “greatest anti-tank ditch in the world.” What’s more, the German army, which had a long and prestigious history of land warfare, had never attempted an amphibious landing quite like this. Likewise, its navy was of little help. German military planners weren’t entirely sure how to proceed, and considered deploying canal barges across the Channel, debated whether or not to invade beaches or seaports, and mulled over the tremendous logistical challenges. Peering across the Channel: As close to Britain as the Nazis would ever get (Credit: IWM HU 1185) Hitler himself became lukewarm about the invasion. He wondered about the geopolitical ramifications of a defeated British Empire, and was concerned that its undefended colonies would be gobbled up by Japan, Russia, and the United States. As the weeks went by, and as the unrealistic timelines became increasingly obvious, few in the German high command took Operation Sea Lion very seriously. As noted by historian Antony Beevor in The Second World War, the “invasion of Britain was never treated with urgency at the highest levels.” But that didn’t stop Reichsführer-SS Heinrich Himmler and his cronies in the Gestapo from producing a briefing on Great Britain that included a Special Search List of 2,820 people who were to be rounded up and arrested after the invasion. Hitler, who was now thinking ahead to his planned invasion of the Soviet Union, wasn’t quite ready to let go of the idea. Saying that the upcoming war in the East would be “child’s play,” he wanted to avoid a war on two fronts, hence his ongoing interest in Britain and the defeat of the RAF in particular. Agreeing with Raeder, Hitler asked Reichsmarschall Hermann Göring, chief of the Luftwaffe, how long it would take to subdue the RAF and eliminate its ability to defend the British Isles. With typical overconfidence, Göring told him that it would take less than a month (he would go on to make similarly outrageous claims later in the war, including at the Battle of Stalingrad when the Luftwaffe was tasked with supplying entrapped German forces via an “air bridge”). Göring’s Luftwaffe was charged with the responsibility of destroying the RAF’s ground-support organization, the British armaments industry, as well as its ports and warships. It was to secure airspace over northwest France and the Low Countries, the English Channel, and southeastern England. To that end, the Luftwaffe moved into the Channel airfields of France, Belgium, and France from where they would launch its attacks. At the same time, the Wehrmacht began its preparations for the looming land invasion. Dutch and French ports soon became filled with barges and tugs, while German troops began to practice their beach-landing maneuvers. Weapons and Tactics Neither side was completely prepared for the battle to come. The German army and airforce, just weeks after the Fall of France, was asked to launch yet another major campaign. Britain itself was still reeling from the disaster, in which the British, along with France, had suffered 360,000 casualties and a tremendous loss of weapons and equipment. Spitfires in action (public domain)\nFor the coming air battle, the Luftwaffe had managed to amass 656 Messerschmitt Bf109e fighters, 168 Me 110 twin-engined Dornier, Heinkel and Junkers 88 bombers, and 316 Ju 87 Stuka dive bombers. The RAF had only 504 Hurricanes and Spitfires to defend the British Isles. Messerschmitt Bf109e fighter (Credit: Bundesarchiv, Bild 101I-487-3066-04 / Boyer / CC-BY-SA 3.0) These figures don’t tell the entire story, however. The Messerschmitt Bf109e was definitely a very good fighter, but it was only marginally better than the Hurricane, and certainly worse than the new Spitfire. But the real problem lay with its other planes. The ME110 would “prove disastrous” in the words of historian James L. Stokesbury, while the Heinkel and Dornier were already obsolete, lacking range, cargo capacity, and defensive armament. The state of these planes was a consequence of a mid-1930s German policy to prioritize tactical aircraft and medium bombers. As noted by Stokesbury, the demands of the upcoming battle would overreach the capacities of German equipment. These figures also fail to show the impressive manufacturing capacity of Britain at the time—an impressive industrial feat, made possible by the work of Lord Beaverbrook, Britain’s newly appointed Minister of Aircraft Production. Under his tutelage and firm hand, factories ensured a steady flow of aircraft. During the battle, Britain was consistently able to produce 470 planes each month—double the rate of Germany’s armaments industry. This replenishment capacity was completely lost on the Germans, much to its detriment. But Germany’s overconfidence and misassessments of the enemy didn’t stop there. In addition to believing that its pilots and aircraft were significantly superior, Germany also failed to acknowledge the power of Britain’s radar net—a relatively new innovation that allowed for the early warning of German aerial approaches. Britain’s industrial and technical might aside, it struggled to provide a steady supply of experienced pilots throughout the battle. Incredibly, only about 3,000 Allied pilots took part in the entire battle, and losses were significant. The national breakdown of these pilots were as follows: 2,334 British, 145 Poles, 126 New Zealanders, 98 Canadians, 88 Czechs, 33 Australians, 29 Belgians, 25 South Africans, 13 Frenchmen, 11 Americans, and 10 Irishmen. The vast majority of British pilots were under the age of 22. A Battle of Phases The Battle of Britain consisted of several different phases as German military planners consistently changed the focus of the Luftwaffe’s aerial attacks. During the first two phases, collectively dubbed Kanalkampf, or “channel war,” German planes attacked Britain’s east coast shipping lanes, followed by attacks on the ports and docking facilities of southeastern England. Stuka dive-bombers and fast S-Boote (motor torpedo boats) attacked British convoys. German pilots tried to wear down British fighters and strike at coastal radar stations, which proved exceptionally difficult to hit. And when they were hit, the radar stations were repaired relatively quickly. German Heinkel He 111 bombers over the Channel in 1940 (Credit: Bundesarchiv, Bild 141-0678 / CC-BY-SA 3.0) This prelude to the more intense battles to come lasted from early July to the second week of August. While the Germans were certainly happy to sink ships and destroy critical infrastructure, the larger plan was the destruction of the Royal Air Force. Ultimately, the Germans were hoping to outlast Britain in a war of attrition. The RAF, headed by Air Chief Marshal Sir Hugh Dowding, wasn’t prepared for this early assault, but quickly adapted. Given their dire situation, it was critical for the British to avoid wastage, both in terms of equipment and manpower. At this early stage, RAF planes were still flying in formations of V-shaped “vics” of three. Eventually, they copied the superior German system of flying in double pairs, known as “finger fours,” which it developed during the Spanish Civil War. This configuration allowed pilots to scan for enemy aircraft in all directions, rather than focusing on close formation, which allowed for enhanced situational awareness. The British defense system (Credit: Strategy for Defeat, The Luftwaffe 1933-1945 by Williamson Murray/Public domain) To counter the German onslaught, the British set up a rapid response system in which RAF pilots were “scrambled” once it became clear that an attack was coming. They waited until the German planes were at the limit of their range, and then dispatched a small group of fighters. The challenge was to intercept, and then engage, the incoming bombers and their high-level fighter escorts. Historian Antony Beevor explains: The priority was to break up the bombers before the umbrella of Me 109s could intervene. If several squadrons had been ‘vectored’ on to the enemy force, the faster Spitfires would take on the enemy fighters, while the Hurricanes tried to deal with the bombers. Within seconds, the sky was a scene of chaos, with twisting, diving aircraft jockeying for position to ‘squeeze off’ a rapid burst of gunfire, while trying to remember to watch out behind. As hostilities commenced throughout July, neither side was able to take control of the battle. What was clear, however, was that both sides were taking heavy losses—though both sides overestimated the damage they were inflicting on the other. The British continually experienced communications problems, and its military leaders continually bickered about the best way to engage the enemy. German planners were never entirely sure if their planes were striking the right targets, or the degree to which they were hurting the enemy’s capacity to fight. When in doubt, however, the Germans tended to err on the side of overconfidence. As early as late July, the Germans were certain that the RAF was nearing collapse, which at this stage of the battle was far from true. The Eagle Attacks The Battle of Britain escalated dramatically in August with the launch of Germany’s massive assault dubbed Adlerangriff, or Eagle Attack. The Luftwaffe’s mission was now focused on the complete destruction of the RAF and its support systems. It was an all-out effort to achieve final air superiority. On August 12, a day before Adlertag, or Eagle Day, German planes struck the English coast in a mostly unsuccessful effort to knock out radar towers. The main attack was supposed to have happened on the 13th, but it turned into a half-hearted fiasco as bad weather and miscommunication hampered plans; only half of the units were involved. The next day, the Germans launched a full-scale assault consisting of 1,500 sorties. Bomber pilots attacked radar stations, airfields, and aircraft factories. In desperation, the RAF responded best it could, dispatching 700 sorties of its own. Pattern of condensation trails left by British and German aircraft after a dogfight. (Credit: Puttnam (Mr), War Office official photographer - This is photograph H 4219 from the collections of the Imperial War Museums (collection no. 4700-37))\nJust two days later, the Luftwaffe launched another massive assault, an armada that was supplemented by dispatches across the North Sea in Denmark and Norway. The RAF lost about 50 planes, and the Germans a few more than that. But the Germans thought the attack was a disaster, dubbing the 15th of August “Black Thursday.” Shockingly, the German high command failed to realize how much damage they were inflicting on the RAF during this assault. As James Stokesbury observed, “They decided that their attacks on the radar stations were not paying off—just as they were beginning to—and they discontinued them, another in their chain of fatal mistakes.” The last week of August marked the climactic point of the battle. In another all-out effort, the Germans sent wave after wave of planes across the Channel. Both sides suffered heavy losses. RAF pilots were utterly exhausted; men were so tired they were falling asleep at meals and even during conversations. New recruits were being sent into battle with only rudimentary training. The Blitz On August 25th, a rather fateful incident occurred. A German bomber crew got lost and they dropped their bombs on the center of London—a non-military target. A clearly outraged Churchill responded by ordering an aerial attack on Berlin. The exchange established a new precedent for the bombing of civilians in Europe, something the Japanese had been doing for years in China. What’s more, the (supposedly) inadvertent attack on London contributed to Göring’s decision to switch targets away from airfields, effectively marking the beginning of the Blitz. It was a fateful decision—one that saved RAF Fighter Command at a crucial stage in the battle. On September 7, nearly 1,000 German bombers struck at London. The planes covered an expanse of sky measuring 20 miles wide (32 km) by 40 miles long (64 km), and almost two miles (3 km) thick. It was an awesome spectacle, one that Göring himself couldn’t resist seeing with his own eyes. He arrived at the coast just to watch the planes as they flew towards Britain. The ensuing attack on London resulted in 300 civilians dead, and another 1,300 injured. View from St. Paul’s Cathedral after the Blitz (Public domain)\nThis startling change in German tactics was predicated on the popular assumption that a nation could be defeated from the air. In 1932, British politician Stanley Baldwin famously said that “there is no power on earth that can protect [the man on the street] from being bombed,” and that “the bomber will always get through.” Baldwin, like Winston Churchill—and now the Germans—were convinced that victory could be achieved by bombing a nation into submission. Indeed, things looked incredibly bleak for the RAF during the first week of September. It had run out of fresh squadrons to provide rotations. The assaults in late August were so intense that, on some days, the British lost more planes than its factories could produce. What’s more, British aircraft factories were increasingly under attack. Germany’s attempt to outlast Britain in an aerial war of attrition appeared to be working, yet it was at this stage in the battle that the Luftwaffe abandoned its direct strikes against the RAF. Had they continued their unrelenting assault, the Nazis may have very well established air supremacy, paving the way for a land invasion. British Group Captain Peter Townsend believed that “on the 6th September victory was in the Luftwaffe’s grasp.” On September 7, he said that Wehrmacht divisions, panzers, and artillery “could have begun massive landings on British soil.” Despite the fact that many Britons expected a land invasion at any time, Hitler declared that, if the RAF was not destroyed by mid-September, then Operation Sea Lion would have to be postponed. Fearing that he’d be blamed, Göring ordered another major assault on September 15. But as noted by historian Alan Bullock: The switch from attacks on the RAF to the bombing of London proved to be a major mistake in tactics. The weeks’ comparative respite gave the RAF Fighter Command the chance to recover when it had been on the verge of exhaustion. On the 15th [of September] it broke up the waves of German bombers and drove them off with heavy losses to the attackers. Despite Hitler’s waning enthusiasm, preparations for an invasion continued in earnest. But on September 6, the Fuhrer met with Raeder, telling him that Operation Sea Lion was unnecessary. As Raeder wrote, “He is finally convinced that Britain’s defeat will be achieved, even without the landing.” Hitler finally decided to postpone Operation Sea Lion on September 19th. Barge fleets were dispersed, and German soldiers were reassigned to other tasks. It’s important to note, however, that even if the operation was allowed to continue, and even if air supremacy had been achieved, the Germans would have been forced to deal with increasingly difficult weather conditions in the Channel. As Churchill had correctly observed earlier, an autumn invasion was extremely unlikely given the rough and choppy conditions on the water. It would be a consideration of great concern during the planning of D-Day some four years later. Hardened Resolve The Luftwaffe continued its attacks on London and other major cities well into the winter of 1940-41. As Hitler increasingly focused his attention on the Soviet Union, he was perfectly content to see, in the words of Bullock, “whether the heavy German air-raids might not shake the British resolution to continue the war.” There’s no official end-date to the Battle of Britain, but many historians say it occurred in late October 1940 when German planes switched from day raids to night raids over the cities and Midland factories. This switch in tactics signified that the RAF was winning the battle and was very much in control of the skies. In total the RAF lost about 1,500 aircraft, the Luftwaffe over 2,000. Compared what was to come, however, it proved to be a rather small affair. The Blitz resulted in over 90,000 civilian casualties, of which 40,000 were fatal. In the end however, the Blitz changed the complexion of the war, and the resolve of British citizens who saw it as a moral victory. What’s more, it justified the British bombing of Germany and did much to sway the opinion of the war in the United States. Sources: James L. Stokesbury: A short History of World War II | Antony Beevor: The Second World War | William Manchester and Paul Reid: The Last Lion | Alan Bullock: Hitler: A Study in Tyranny Email the author at george@io9.com and follow him at @dvorsky. Top image by New York Times Paris Bureau Collection/Public Domain", "source": "Kotaku"}