{"published": "2015-09-20T16:10:53Z", "media-type": "Blog", "title": "Granger on Movies: ‘The Visit’", "id": "28c6298d-2c6b-45e0-bee7-c440c7f9756f", "content": "Fairfield Citizen film critic Susan Granger reviews the new movie, “The Visit.” Halloween horror season starts early with M. Night Shyamalan’s strangely creepy, suspenseful tale of a brother and sister who spend a week on their maternal grandparents’ remote Pennsylvania farm. Realizing that their recently divorced mother (Kathryn Hahn) needs a vacation, teenage Becca (Olivia DeJonge) and her exuberant, rap-loving, younger brother Tyler (Ed Oxenbould) encourage her to take a Royal Caribbean cruise with her boyfriend. Having disapproved of their mother’s marriage to their father, the grandparents have been estranged for years and have never met the grandkids, but are now eager to mend the relationship. So aspiring filmmaker Becca intends to make a documentary about this experience. Meeting the train, Nana (Deanna Dunagan) and Pop Pop (Peter McRobbie) are, admittedly, a bit odd. Nana’s always baking and laughs hysterically in a rocking chair, facing the wall. And Pop Pop can be unexpectedly curt, cautioning them to never leave their bedroom after 9:30 p.m. Hearing strange nocturnal noises, they peek out and spy Nana wandering around nude, clawing the walls. Pop Pop explains that she’s “sundowning,” a medical term referring to dementia patients’ reacting restlessly or aggressively when evening approaches. Becca functions as the compassionate commentator as they curiously explore their mother’s childhood home and come to realize how age has impaired their grandparents’ functionality, resulting in bizarre behavior. Utilizing weird camera angles and a “found footage” gimmick, Shyamalan then delivers a stunning twist to this intense family drama. In 1999, writer/director M. Night Shyamalan catapulted into pop culture with “The Sixth Sense,” followed by “Signs,” “The Village” and “Unbreakable.” Unfortunately, his next four films — “Lady in the Water,” “The Happening,” “The Last Airbender” and “After Earth” — misfired. Collaborating on TV’s quirky “Wayward Pines,” Shyamalan learned how to create chaotic visual energy with fewer resources. Which led to this comedic thriller, financed with $5 million of his own money. Once dubbed “the next Spielberg” by Time magazine, Shyamalan is the highest-profile director to team up with micro-budget producer Jason Blum (“Insidious,” “Paranormal Activity”). On the Granger Movie Gauge of 1 to 10, “The Visit” is a spooky, scary 6. As Nana says, “You have to laugh to keep the deep darkies in a cave.”\nVisit www.susangranger.com\nfor more about movies and entertainment. Article source: http://www.fairfieldcitizenonline.com/news/article/Granger-on-Movies-The-Visit-6517148.php Related", "source": "EntertainmentNutz"}