{"published": "2015-08-17T13:00:54Z", "media-type": "Blog", "title": "Challenges of Pneumonectomy Surgery", "id": "12ff185a-6314-46c3-b88e-324e0a83e40d", "content": "Challenges of Pneumonectomy Surgery\nPublished August 17, 2015 | By GRACE Video\tDownload PDF of this page\n  Dr. Eric Vallières, thoracic surgeon, describes the phsycial challenges and risks for patients who undergo a pneumonectomy for lung cancer. Podcast: Play in new window | Download (Duration: 3:06 — 21.5MB) Download Transcript How Did You Like This Video?\nPlease feel free to offer comments and raise questions in our Discussion Forums.   Transcript The pneumonectomy, which I’ve described as when you remove the entire lung, for most patients is, physiologically, a bigger challenge. It is also a more risky operation; in general, patients who undergo a pneumonectomy — their risk of operative death, meaning dying as a result of surgery in the next 30 to 90 days, is three to four times higher than if they had only required a lobectomy. So the more lung you remove, the higher the risk. Now, that’s not true for everyone. If someone comes to us and they already have a tumor that is completely occluding their lung, and they’ve been living like this for months, for us to go in and remove that lung — they’ve already shown everyone, including themselves, that they don’t need that lung, they’re living fine. But for someone who is utilizing that lung, for a significant portion, and when in the operating room you just take it out in one swoop, that is a physiological challenge, and that’s something that we have to evaluate seriously. So the mortality is higher, and the complication rates of a pneumonectomy are also higher — two to three times higher, so it is a bigger challenge to take someone through a pneumonectomy short-term, and long-term. There is evidence now that there are a significant number of patients where they may survive the operation, but two years, three years, five years down the line, the fact that they only have one lung takes a toll on them, and there are some long-term issues for some patients — not all, but for some patients, in having undergone what’s called a pneumonectomy. Interestingly enough, a left pneumonectomy is not as challenging to the patient, nor to the surgeon, as a right pneumonectomy. Our right lung is a bigger lung, and losing your right lung, in general, it’s not universal, is more of a challenge that losing the left lung. There is an alternative for some patients to pneumonectomy, and that’s called a sleeve resection. Now, a sleeve resection is an operation where the tumor that you’re removing is fairly central, and what you do is you cut the airway above the tumor, cut the airway below the tumor, take out the tumor and the lobe — usually the upper lobe on either side, and then you reimplant the bottom part of the lung to where you cut things up. That’s a good alternative, oncologically — so as far as cancer results, it’s as good as a pneumonectomy. But it is physiologically, in the long run, a much better operation for the patients. Some patients who are considered for a pneumonectomy are candidates for these sleeve type of resections, which are done in centers of excellence, but that’s something to be aware of. Related Posts:Types of Lung Surgery: From Wedge Resection to Pneumonectomy by GRACE Video August 14, 2015 Surgery Options for Smaller, Slow-Growing Lung Cancers by GRACE Video by GRACE Video September 4, 2015 I think I’m too old for a big lung surgery: What can… by GRACE Video by GRACE Video by Dr West October 27, 2013 Special Considerations for Lung Cancer Surgery in the… by GRACE Video by GRACE Video by Dr West by GRACE Video August 19, 2015 Pre-Operative/Neoadjuvant Therapy: Rationale and Indications by GRACE Video by GRACE Video by Dr West by GRACE Video by GRACE Video September 7, 2015 Posted in A Reference Library on Lung Cancer, GCVL-Lung, General Lung Cancer Issues, GRACE Cancer Video Library, GRACEcast, Lung Cancer, Lung Cancer, Miscellaneous Other Problems from Lung Cancer, Non-Small Cell Lung Cancer (NSCLC), Resectable locally advanced NSCLC, Small Cell Lung Cancer (SCLC), Surgery Issues, Treatment | Tagged Eric Vallières, GCVL, GCVL-Lung, pneumonectomy, surgical risk, thoracic surgeon, thoracic surgery", "source": "GRACE :: Lung Cancer"}