{"published": "2015-09-07T20:29:47Z", "media-type": "News", "title": "Kaya Scodelario: Maze Runner location left me with 'hangover every day'", "id": "c2cd3f1b-697a-4998-b000-fc47f372da32", "content": "Former Skins star Kaya Scodelario said filming the sequel to the Maze Runner was like \"waking up with a hangover every day\". \n \r\n\t\t\r \nScodelario, who stars as Teresa in the Maze Runner: The Scorch Trials, was referring to hours spent filming at a high altitude in New Mexico. \n\r  Kaya Scodelario plays Teresa in the Maze Runner: The Scorch Trials \r \r \n\"It feels like you wake up with a hangover every single day,\" Scodelario explained. \"But it's beautiful. The landscape is really important to the movie, it's so vast.\" \n\r\n\t\t\t\r \nShe and her co-stars, Thomas Brodie-Sangster (Newt), and Ki Hong Lee (Minho), surprised fans at a special screening of the film in London's Leicester Square. \n\r\n\r\n\r\n\r \nThey also starred in the first film, 2014's The Maze Runner, alongside lead Dylan O'Brien, who plays Thomas. \n\nA select group of  200 fans won the chance to attend the screening. \n\nScodelario said she'd closely watched the competitions: \"I've seen a bunch of stuff. They're amazing. They're so on it with social media, it's really impressive.\" \n\nIn the sequel, their journey takes them to the Scorch - a desolate landscape filled with dangerous obstacles. \n\r\n\t\t\t\r \nThey team up with resistance fighters to take on the powerful WCKD, and uncover the organisation's shocking plans. \n\nBrodie-Sangster, who has previously starred in a Game of Thrones and Love Actually, said: \"We were 5000 feet above sea level and we were filming in the mountains. The lack of oxygen up there is really quite something.\" \n\nDirector Wes Ball revealed it was a bit of a shock taking on the new landscape: \"Filming for the first film was flat and humid and full of bugs. Now we're in this mile-high city with a big change in atmosphere. \n\n\"Shooting in these crazy environments of sand and rock and rusty metal was a completely different environment for us, but it adds to the movie in a really cool way.\" \n\r\n\t\t\t\r \nMaze Runner: The Scorch Trials is released on September 10 \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Eastbourne Herald"}