{"published": "2015-09-29T12:23:00Z", "media-type": "News", "title": "Google triples self-driving car fleet in four months", "id": "ddc52996-7230-4f76-94bd-9e3e26549e55", "content": "Many are yet to hit public streets Google is expanding its self-driving car fleet quickly: in the last four months the number of cars it is permitted to drive on California streets has more than tripled.\n\nAs of Monday, Google has licenses for 73 self-driving vehicles, up from 23 cars in mid May, according to records from California’s Department of Motor Vehicles. Under state law, companies wishing to test autonomous vehicle technology on public roads need a permit for each vehicle from the DMV.\n\nAll of the expansion of Google's fleet is for its latest model, a small, rounded car with a distinctive LIDAR laser imaging sensor on its roof and a top speed of 25 miles per hour.\n\nGoogle has licenses for 50 of the vehicles although only a handful are currently on public roads. They can be seen driving close to the offices of Google X in Mountain View. \n\nA Google self-driving navigates streets near the company's headquarters in Mountain View, California, on June 29, 2015.\n\nThe remainder of Google's self-driving car fleet consists of previous generation Lexus RX450h SUVs.\n\nThese look a good deal more industrial with sensors bolted to the sides and front of the car and a similar laser imaging system on the roof.\n\nA Google self-driving navigates streets near the company's headquarters in Mountain View, California, on June 29, 2015.\n\nTogether, the Google driverless cars were averaging about 10,000 miles per week on public roads as of early September, according to the company.\n\nTo date, Google has reported a handful of accidents and incidents involving the cars, but none have been attributed to the software. In all reported cases, accidents were either due to other drivers or happened when the car was under manual control, the company says.\n\nWith the latest Google fleet expansion, there are now 102 autonomous vehicles licensed to take to the streets in California.\n\nTesla's Model S on the road in Palo Alto, California\n\nThe second biggest fleet after Google is Tesla's, which has 12 licensed cars and has been testing out an autonomous driving mode for use on highways. Tesla is expected to release that to owners . Mercedes Benz has 5 cars and then Volkswagen, Delphi, Bosch, Nissan and Cruise Automation each have 2 cars. BMW and Honda each have one autonomous car licensed in the state, according to the DMV.\n\nThe state also requires drivers be issued licenses for autonomous vehicles and in this area too, Google is well ahead of the competition. It has 219 licensed drivers of the 344 in the state.", "source": "Computerworld Australia"}