{"published": "2015-09-18T21:45:32Z", "media-type": "News", "title": "Coalition’s Shorten dividend", "id": "15d96c82-1705-431f-83ca-bac60a6efcf5", "content": "Factional unanimity in the ALP could facilitate any move to dump Bill Shorten as leader. Source: AAP Australians woke to a new Prime Minister on Tuesday morning and feedback from opinion pollsters has been coming in thick and fast. The new incumbent, Malcolm Turnbull, is preferred by up to 70 per cent of voters according to the Morgan Poll and by a staggering 94 per cent of Coalition voters according to ReachTEL.\n\nTurnbull is opposed by a somewhat stressed Labor leader, Bill Shorten, who is supported as alternative prime minister by only 24 per cent of voters, according to Morgan, with more than a quarter of ALP voters preferring Turnbull as PM.\n\nNo wonder Shorten wants to meet Turnbull to discuss the China free-trade agreement — he’s probably after a joint shot for his campaign brochure.\n\nEven more tellingly, ReachTEL shows a clear majority of Greens voters — the ones supposed to deliver 90 per cent of their prefer­ences to Labor — support Turnbull over Shorten.\n\nThis majority support for Turnbull from Greens voters came in a poll held after Turnbull was politically mugged on the way to Yarralumla and forced to hand control of waterways to the Nationals, a move that will cost votes for Nationals candidates at the next election, leading to more of their state and federal seats progressively being knocked off by challenges from Labor, the Greens and independents.\n\nReachTEL also estimates that the election of Turnbull as PM means the swing in Western Australia’s Canning by-election today should be about minus 5 per cent, instead of the 10 per cent predicted by all polls before the leadership spill.\n\nA week ago, an upset Labor win in Canning was possible and this result would have been consistent with the seat’s former position as an ALP marginal during the Hawke and Keating years.\n\nA 5 per cent swing against the Coalition would equal the personal support attracted by Canning’s former Liberal MP, the late Don Randall, suggesting the Liberals effectively retained all of their party vote.\n\nThat in turn would imply the Howard battlers are firmly in the grip of the Coalition 12 months out from the next election, in Canning and comparable seats across the country, such as Lindsay in NSW or Longman in Queensland.\n\nThis conclusion is confirmed by a ReachTEL national poll showing a two-party preferred vote of 50 per cent for the Turnbull-led Coalition, with a Galaxy poll showing 51 per cent. This is an increase of 4 per cent to 5 per cent over the figures under Tony Abbott, and I suspect the Coalition’s standing will improve ­further, given the former prime minister’s net dissatisfaction scores and the likely positive scores for Turnbull.\n\nA rough guide to the impact of Abbott on his party vote can be obtained by dividing his net dissatisfaction scores by about five, and this corresponds to an interim sugar hit to the Coalition vote of about 6 per cent.\n\nHow long the hit lasts depends to some extent on how quickly disaffected conservatives in the Coalition stop sabotaging the new PM before he has had a chance to save their seats from their own poor judgment. It would help if Turnbull’s backers stopped provoking Abbott loyalists by boasting about their hatchet job on the ousted PM as this is a story that appeals to political insiders but not to voters.\n\nCheering on yesterday’s men among the conservatives is yesterday’s man for the ALP, Shorten, who less than a week ago was cruising to a certain victory for Labor with about 54 per cent of the two-party preferred despite net satisfaction ratings almost as bad as those of Abbott.\n\nComplacency on the part of Labor and the timidity of its leadership left the party reliant on the visceral dislike of Abbott among key groups to insulate Labor from the Greens in the ALP’s inner-city seats and to make gains in marginal urban seats, especially in Victoria and South Australia.\n\nThis strategy became redundant within 24 hours of Abbott’s demise as many of the middle-class and professional voters Shorten thought were in the bag switched their support to the new Turnbull government. Now Shorten is Turnbull’s greatest asset and the Prime Minister should do everything he can to ensure the Opposition Leader survives until the next election.\n\nMy profiles of elections back to 1966 make it clear that Labor gains broad-based community support when it develops credible economic and social policies for working families in provincial cities and outer suburbs, and for middle-class families in marginal urban seats. Labor has been able to build on this foundation and go on to win elections when it has chosen leaders capable of articulating these policies during an extended period of opposition and making them relevant to key groups in marginal seats.\n\nShorten’s insipid leadership means Labor has done neither — and now it may be too late.\n\nThe party’s first problem is the rules put in place by Kevin Rudd to protect the leader from caucus challenges. If Shorten’s net satisfaction scores don’t improve and the ALP’s vote begins to decline towards 45 per cent, Labor will be looking to dump him as quickly and as quietly as possible. But the rule changes make it potentially harder — unless there’s a complete agreement across all the factions to ignore the rules, in effect, and let the caucus get on with it.\n\nThis means a challenge could become a protracted and public fight, which would hurt Labor’s vote even further. If the factions agreed Shorten had to go, his replacement would be difficult to find as the factional gene pool in the ALP is so shallow, there are no natural leaders who seem capable of dominating Turnbull in parliamentary or public debates.\n\nEven with a competent leader, Labor and the union movement have a long-running problem in rebuilding the support base they once had among skilled blue-collar men in Labor’s safer urban seats and in outer urban marginals such as Canning.\n\nTo become PM you need to be able to control a majority of seats on the floor of the House of Representatives, and it helps to win more than 50 per cent of the vote, but you don’t need it if you can win more than 50 per cent of the votes in more than half the seats.\n\nIf you win the votes in the right seats the swing pendulum also becomes meaningless because it’s ­really only a retrospective device to measure what happened and does not predict what can happen.\n\nIn 1998, the ALP needed a two-party preferred swing of about 4 per cent to win a majority of seats on the pendulum and it actually managed a swing of 5.1 per cent, yet that left it still needing a swing of 0.8 per cent to win. This is because winning votes in your opponents’ key seats reshuffles the seats along the pendulum even if the swing doesn’t change.\n\nJohn Howard achieved this in 1998 by winning support from traditional Labor-voting welfare recipients and skilled blue-collar tradies in seats such as Canning.\n\nProfiling of elections back to 1966 shows that the Labor vote from tradies trended downwards from 1980 and split about 50-50 between Labor and the Coalition in 2004. The tradies profile for Labor bounced back a little in 2007 and 2010, but once more split 50-50 in 2013.\n\nShould that remain the case next year, the Coalition is likely to continue to maintain a lead of about 6 per cent among men.\n\nThe decline in support for the ALP among blue-collar men during the 1980s and 90s was counterbalanced by an increase in the ALP vote among women.\n\nThe female ALP vote rose in proportion to the increase in women’s workforce participation rates, which went up from 34 per cent in 1961 to 53 per cent in 1993.\n\nThe two-party preferred ALP vote among women pulled ahead of the equivalent figure for men in the early 80s, with many crossing to Labor via the Australian Democrats. The ALP’s primary vote from women is now consistently about six points ahead of its primary vote from men. Politically this means that, since 2001, you would be likelier to find a safe Labor seat dominated by female clerks than by male tradies, and you would be just as likely to find a Labor seat dominated by female professionals as male tradies.\n\nThis increased participation in the workforce by clerical and professional women has had a big pay-off for unions. Just as Labor’s power base became more feminised and shifted its centre of gravity from traditional outer urban seats to move closer to the goat cheese circle, so too did the power base for the union movement.\n\nWhile the proportion of male union members in the private sector continues to decline, the proportion of female union members in the public sector has remained steady, although it temporarily rose in tandem with Rudd and Wayne Swan’s stimulus in 2009.\n\nPublic sector jobs in administration, education and health are keeping the union movement afloat, and these three industries in both sectors now account for 52 per cent of all union members.\n\nThese workers have been easily persuaded by their union officials to support quotas for union members in hospitals and schools, and this focus on membership growth rather than outcomes for patients and students requires a lot of public spending and commensurately higher taxes, which of course hit private sector blue-collar jobs for blokes.\n\nThis is why Labor was incapable of cutting public spending under Rudd and Julia Gillard, and why the ACTU has been desperate to secure the election of another big-spending Labor government under a weak leader who considers themselves to be dependent on union support.\n\nThe evidence, however, shows that although more than half of the extra million jobs created by Labor were in public administration, education and health, there was no political return for Rudd in 2013 in terms of bigger swings to Labor from electorates containing larger numbers of voters working in these industries.\n\nLabor’s lead among female voters comes from the seats domin­ated by the 50 per cent of employed women in full-time jobs. They voted Labor in 2013 and swung to Labor, irrespective of their industry or union membership. The other 50 per cent of working women in the more vulnerable part-time jobs live in the aspirational middle-class seats that voted strongly for the Coalition and swung to Abbott.\n\nThese tend to be the women who temporarily have given up full-time work to have children and who are seeking to re-enter the workforce by juggling childcare and effective marginal tax rates to help pay off a family mortgage and send their children to the best school they can afford.\n\nThey have high levels of debt and spending, and they tend to cluster in similarly priced housing estates in marginal seats. They were political gold when I first profiled them in the early 70s and they are still political gold in the present undernourished Labor market.\n\nThe challenge for Turnbull in selecting his new ministry is primarily to protect his base vote among Howard battlers.\n\nHe can do this by selecting an industrial relations minister who can relate directly to blue-collar working men, and a welfare minister who doesn’t poke sticks at the huge numbers of welfare recipients clustered in outer urban and provincial seats, as these voters don’t consider living in relative poverty as an entitlement.\n\nTo regain a degree of parity among middle-class and professional women, Turnbull clearly needs to select more of them as members of his cabinet — including women who understand what it’s like to hand over a crying toddler at the childcare centre or comb the headlice out of their four-year-old after kindy, all to pay off the mortgage, save for school fees and help provide a better life for their families.\n\nIf he can do that, balance the budget and generate 220,000 jobs a year, winning the next election against whoever is leading the ALP at the time should be a cinch.\n\nI wish him well. However you vote at present, given the state of our economy and our labour ­market, we all need Turnbull to succeed.\n\nJohn Black, a former Labor senator for Queensland, is chief executive of Australian Development Strategies, a demographic profiling company. His original profiling for the ALP campaign in 1983 is now being published online on elaborate.net.au.", "source": "The Australian"}