{"published": "2015-09-04T13:20:40Z", "media-type": "News", "title": "Zift Solutions and Partner Marketing Provider SharedVue Join Forces", "id": "fa85d78c-763e-472c-81b1-7047e264f96b", "content": "SOURCE The Channel Company\n\nThe Combined Entity is now the Dominant Channel Marketing Automation Platform Provider\n\nWESTBOROUGH \n\nThe SharedVue Through Partner Marketing Automation platform provides Web content syndication, automated email marketing and social media syndication. Zift Solutions will control and run the combined entity, while The Channel Company will retain an ownership stake in Zift Solutions. The Channel Company will continue to own and operate all of its other properties including CRN®, XChange® Events, IPED® and Managed Marketing Services.\n\n\"The addition of SharedVue continues Zift Solutions' growth trajectory and will allow us to deliver on the next wave of channel marketing automation capabilities,\" said Ken Romley \n\nThe new entity creates the most experienced and largest Channel Marketing Automation platform provider with more than 30,000 partner users around the globe. Zift Solutions will incorporate the core capabilities of SharedVue into its well-established platform. SharedVue personnel will transition to become Zift Solutions employees this week, while the SharedVue brand and solutions will be consolidated into Zift Solutions over time, increasing Zift Solutions' reach, effectiveness and customer service on a global basis. Zift Solutions' R&D team also will effectively double in size, allowing the company to deliver the advanced features and functionality that channel sales and marketers require at an even faster pace. As the channel community's trusted authority for growth and innovation, The Channel Company will work with Zift Solutions to integrate SharedVue functionality and promote the enhanced Zift Solutions platform moving forward.\n\n\"We are excited about the future capability of the combined SharedVue and Zift Solutions platform,\" said Robert Faletra \n\n\"The race to provide channel marketers with the automation tools they need to create demand is heating up,\" said SiriusDecisions' Laz Gonzalez \n\nLearn more about the combined entity and read our Frequently Asked Questions.\n\nAbout Zift Solutions\n\nZift Solutions increases channel sales and boosts marketing impact with a superior technology platform, a complete channel marketing success framework and global customer care. Leading channel-driven organizations around the world leverage Zift Solutions' cloud-based platform to automate co-branded marketing, empower collaborative selling and measure results with powerful analytics. To learn more, join the conversation via the blog Channel Chatter and follow us on Twitter @zift.\n\nAbout The Channel Company\n\nThe Channel Company, with established brands including CRN®, XChange® Events and IPED®, is the channel community's trusted authority for growth and innovation. For more than three decades, we have leveraged our proven and leading-edge platforms to deliver prescriptive sales and marketing solutions for the technology channel. The Channel Company provides Communication, Recruitment, Engagement, Enablement, Demand Generation and Intelligence services to drive technology partnerships. Learn more at www.thechannelcompany.com and follow us on Twitter @TheChannelCo.\n\nZift Solutions Press Contact:\n\nDavid Buffaloe \n\nThe Channel Company Press Contact:\n\nKim Sparks \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/zift-solutions-and-partner-marketing-provider-sharedvue-join-forces-300137680.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "Kait 8"}