{"published": "2015-09-05T10:15:03Z", "media-type": "News", "title": "Making top race stuff of Legends", "id": "50363919-667c-4c24-b726-fa91a8231845", "content": "It is now less than a month before the country’s top long distance runners and others from across the globe converge on East London to take part in the annual Legends Marathon.This year’s edition on October 3 – the third in the marathon’s short history, promises to be a spectacle never seen before in the history of long-distance running in the Eastern Cape.\n\nWith an overall amount of R1-million up for grabs in prizemoney for participating athletes – the cherry on top is in the form of a car competition.\n\nAll athletes registered to run the race qualify for the car competition, as do all the fans attending the race.\n\nThe old saying: ‘Go big or go home’ could not have been more appropriate.\n\n“It is important to reward the competitors in the race, but we also wanted to reward and thank those spectators who come out and support our events and runners on the day,” Legends Marathon founder and chairman Luthando Bara said.\n\nFor athletes, various lucrative cash prizes will be up for grabs. In the main event – the ultra marathon over 68km – the grand prize for the lucky runner, who reaches the finish line before everyone else, is a head-spinning R120 000. From big-name roadrunners known worldwide, to unknown rising stars still trying to crack it on the global stage, will be aiming for the first prize.\n\nThe prizes in the open division go all the way down to number 10 with the runner-up claiming, R80 000 while the third-placed runner will go home R60 000 richer. The fourth-placed runner will pocket R20 000, while R15 000 is up for grabs for the sixth athlete home. There is a R10 000 prize for seventh R8 000, eighth gets R6 000, ninth R4 000, while the 10th runner home receives R2 000 – all in the open division.\n\nThree further age group divisions of 40-49 years, 50-59 years and 60+ will also receive cash prizes with the winner of each receiving R6 000, R5 500 and R4 500 respectively.\n\nIn the half marathon, the prize pool is considerably lower, with the male and female winner each taking home R15 000, while the runners-up receive R12 000 and third place R10 000.\n\nPrizes go down to 10th in the open division, while age group prizes of juniors, 35-39 years, 4049 years and 50-59 years will be available for the first five runners in, with the winners claiming R4 500. Having received a major upgrade in the form of the International Association for International Marathon Standards (Aims) accreditation, Legends Marathon remains inclusive to all, unlike Comrades and Two Oceans, where only those affiliated to clubs can participate.\n\nBara said: “Running a marathon is a huge accomplishment but in addition to the gruelling race and their combined passion for running, we have a unique marathon that should be supported by all and sundry”.\n\nThe race is expected to also bolster the province’s tourism. — Additional reporting by Ross Roche.", "source": "Daily Dispatch"}