{"published": "2015-09-24T13:27:54Z", "media-type": "Blog", "title": "Espresso Brownie Pie", "id": "84401cde-c257-4cc0-a452-0046882088fd", "content": "Hi again. I came to interrupt your pumpkin-spice latte time this morning with this Espresso Brownie Pie . That’s right. Pumpkin takes a back seat to make room for this fudgy chocolate pie. \n \nWhen I first discovered the original Brownie Walnut Pie in the recipe archives, I thought, hmm, “brownie plus pie, you can’t really go wrong there”. You’ve got a traditional pastry style crust filled with a fudgy chocolate brownie and served with whipped cream. I’m sold. \n \n\n \nThe bakery where I worked in high school had this amazing chocolate walnut pie, which I hope to make some day, but I thought this recipe would be a good place to start. \n \nThis recipe is rather simple. You start with a homemade crust, throw together a few ingredients to make the brownie layer and pop it in the oven for about 45 minutes and ta-da, you’ve got pie! \n \n\n \nInstead of following the original recipe, I swapped out the walnuts for crushed espresso beans (chocolate covered ones!). A few weeks ago, I stocked up on chocolate covered espresso beans and still had some left. If you have never baked with these, I must say, you are missing out! I first tried them in a cookie , and then again in some cookie dough ice cream . Both were down right awesome. \n \nIt is best to pulse the beans in a food processor a few times to break them into small pieces. All you need to do is stir them into the brownie batter, and you’re done. \n \n\n \nI happened to use a deeper-than-normal pie plate, but not quite “deep dish”. It was perfect for this pie because the brownie rose a bit in the oven as it baked. I allowed it to cool completely before cutting. The top of the brownie was nice and flaky and the middle was very fudgy! I brought this into work and my coworkers loved it! \n \nWalnuts are great, but the chocolate covered espresso beans really take this recipe over the top. Here is original recipe for Brownie Walnut Pie , just leave out the walnuts and add 1 cup of crushed chocolate covered espresso beans.", "source": "BHG Delish Dish"}