{"published": "2015-09-09T04:35:48Z", "media-type": "News", "title": "Tim Hudson belts home run and wins his 221st game in a stirring return to rotation, but changes are coming for Giants' starting five", "id": "a75e4e24-d256-429e-a9a5-e67bce0aac6d", "content": "Running game story... \n  \nPHOENIX - During most of Tuesday s pregame session with reporters, Giants manager Bruce Bochy discussed the imperative need to make offseason adjustments to an aging and tire-slicked rotation. \n  \nThen 40-year-old Tim Hudson returned to the rotation, spun six effective innings and even blasted a home run into the left field seats in the Giants 6-2 victory over the Arizona Diamondbacks \n  \nThis game will age you. And yet there are nights when it can make you feel like a kid again. \n \n\r\r \n  \nAt this point where I am, I never know if it s going to be my last one, said Hudson, a day earlier. I ll go for as long as I can get, and hopefully it s further than what people would expect for me anymore. \n  \nOdds are, this one won t be the last. Hudson raged against the dying light while picking up his 221st major league victory, the most among all active pitchers, after holding Arizona to a run on four hits. He joined 38-year-old Ryan Vogelsong, who homered five days earlier on this trip, as the oldest Giants pitchers to hit a home run since 41-year-old Steve Carlton in 1986. \n  \nHis home run in the third inning loosened up a Giants dugout that had become a tense place as the club fell to the extreme fringes of two playoff races. But it was not all guffaws and grins. \n  \nThe Giants had their All-Star middle infield combination reunited on the field again for all of four innings. Second baseman Joe Panik made his first start since Aug. 1, but shortstop Brandon Crawford left the game in the fourth after aggravating both his tight oblique and his swollen calf. Crawford made a difficult play to his right in the first inning and then did not appear comfortable while striking out twice. \n  \nHudson, making his first start since July 26, utilized his middle infield as much as he could. His first six outs were ground balls to Crawford or Panik, and his sinker remained true all night. \n  \nHudson was making the start in place of Vogelsong, who struggled in his last two outings. It s the kind of cobbling that Bochy has done most of the season, hoping to get a reliable run of starts from a rotation that had far too many flaws after Madison Bumgarner. \n  \nBochy made no secret that he would like to re-sign Mike Leake, who will be a free agent. Jake Peavy is under contract for another year and should have a longer offseason to recuperate. Bochy also is committed to Matt Cain reestablishing himself after a rocky season of self-discovery while pitching with a different range of motion following elbow surgery a year ago. \n  \nWith Cain, time will help him and he ll be a fixture in this rotation, Bochy said. \n  \nTim Lincecum could return, too, although the Giants cannot put themselves in a position to rely on him. They learned their lesson after this season. \n  \nThe window doesn t stay open all the time, Bochy said. It s amazing how healthy they ve all been until recently. It s why you sit down and discuss it, because we are getting a little older and we ll have to make some adjustments. \n  \nCould the Giants get by with a rotation that includes Leake and the returnees, with Chris Heston a part of the starting five and Clayton Blackburn in position to provide depth? Could they seek to win by outhitting teams, instead? Or do they need to be in the wildly expensive market for a potential free agent such as Jordan Zimmermann, David Price or Zack Greinke? \n  \nBochy made it clear: he d like his new window to resemble the old one, stressing pitching and defense. \n  \nThat would be our preference because of the success we ve had, and because of our ballpark, Bochy said. Also when you look at the pitchers we have in our division, you ve got to match up with them. The reason for our success is our pitching and being able to match up against those other teams top three. \n  \nThe thing you don t forget is what these guys have done for you. You always have a special place for these guys. We ll have to get this figured out, though. \n  \nVogelsong is almost certainly in his final month as a Giant after a heartwarming career renaissance. Hudson, who plans to retire after this season, pitched the first eight innings of the Giants critical, 18-inning win at Washington in the NL Division Series last year. \n  \nOh, he s been a pleasure, Huddy, a great teammate and a great asset, Bochy said. He was a big part of our winning a World Series. I ve enjoyed my time with Huddy. That was a great sign for us. One of the huge motivators we had was to win with Huddy on the club. \n  \nThe Giants five-run third inning started from the bottom up, as the Nos. 8-9 hitters crushed back-to-back home runs. Gregor Blanco initially slid into third base with a triple before umpires singled that his drive to center cleared the yellow line and sent him home. Then Hudson turned on a 1-1 fastball from Chase Anderson and sent the Giants dugout roaring its applause. Hudson s fifth career home run, and his first since 2013, was a no-doubt shot off the bat. And it was a reminder that long ago, he once broke Frank Thomas single-season RBI record at Auburn. \n  \nFirst Vogelsong. Then Hudson. Since when is Budweiser a performance enhancing drug? \n  \nPanik tapped into the power show as well, following up his pinch double Monday night with a banner game that included an RBI double and his eighth home run of the season. \n  \n-- \nThe Giants activated left-hander Jeremy Affeldt from the disabled list and made one other roster move, purchasing the contract of right-hander Cory Gearrin from Triple-A Sacramento. \n  \nGearrin, 29, had a nice year in relief for the River Cats, posting a 2.72 ERA in 33 games while striking out 46 against 14 walks in 43 innings. Gearrin made 77 appearances for the Atlanta Braves from 2011-13 before undergoing Tommy John surgery. The Giants transferred catcher Hector Sanchez to the 60-day disabled list to clear a space for Gearrin on the 40-man roster. \n  \nThe post appeared first on Giants Extra .", "source": "Red Bluff Daily News"}