{"published": "2015-09-04T03:45:33Z", "media-type": "Blog", "title": "Influencer Marketing: Should You Pursue High Profile or Socially Authoritative Brand Advocates?", "id": "3ad77257-a06a-4ec7-81f6-06d46c5b9f74", "content": "We’ve been talking a lot about influencers lately – and with good reason. The right mix of thought leaders and valuable content can catapult any integrated marketing campaign into vast new heights and audiences. Finding and connecting with those ideal influencers, however, has always been the challenge.\nWhile there are multiple discovery tools available for influencer marketing research, identifying your influencers is only part of the battle. The next part is reconciling them with your overall program objectives. It’s here that we’ve witnessed disconnects between marketing teams and their executive leadership – and where the need for executive buy-in is crucial for any influencer marketing campaign. Executives may crave big names – chief executives of major industry organizations who may/may not have an active social presence.\nAdditionally, any influencer marketing campaign should always provide value to your influencers (as well as your brand). In order to get the right influencers on board, it needs to be a mutually beneficial relationship.\nAs you look to achieve executive buy-in for any influencer campaigns, recognize the pros/cons of social influence as the primary determinant for your research.Seeking High Profile Influencers\nThose who venture into the world of influencer marketing may dream of attracting major executives or thought leaders into their campaigns. These influencers may likely contribute regularly to high-visibility blogs like Forbes, Search Engine Watch, or their own personal blogs.\nCollaborating with a high profile influencer could add instant credibility to your marketing initiatives, though relying on this metric alone can reduce overall amplification potential.Pros of Collaborating with High Profile InfluencersImmediate access to a large audience, with a variety of audience and traitsInstant credibility for your message with media, press relationsPotential Hurdles of Collaborating with High Profile InfluencersIf social presence is limited, campaign might not have long-term viabilityGetting participation from high profile influencers may be challenging\nAvailability is the primary barrier for connecting with big names for your content. Assume that most high-visibility influencers are fielding requests like yours every day, and might not have the time to fully dedicate themselves to your program. Again, this is where the value you offer to the influencers you work with comes into play. Do what you can to make it easy for them to participate and clearly articulate the potential value to them for collaborating.Focusing on Socially Active Influencers\nWhen we look to define what makes an influencer, clout definitely plays a factor. But what if we also look for those who trade major publication bylines for frequent social activities?\nThese are your potential advocates – influencers who already dedicate significant time to foster their social communities. They may or may not have the immediate draw of big name contacts, but they can offer sustained support beyond the initial campaign launch.Pros of Socially Active InfluencersBuilt-in social amplification opportunities with current audienceGreater availability and variety in verticals and messagingPotential Hurdles Working with Socially Active InfluencersOverall reach limited may be limitedMust build credibility overtime without well-known influencers\nBuilding credibility is the main challenge in collaborating with influencers that are socially active but are not high profile. However, they in turn offer greater opportunities for long-term relationships between themselves and your brand.Circle Back to the Objectives\nWhen weighing the decision to prioritize what types of influencers you pursue, it always helps to review the overall program objectives. Is your influencer campaign built around awareness of a major initiative or product launch? Perhaps you may want to consider collaborating with some high profile influencers to add credibility to your brand message.\nConversely, are you looking to build a long-term campaign that dissects industry changes and teaches new processes? In this case, socially active influencers might be advantageous in that evergreen scenario.\nWhat combination of high profile and socially authoritative influences have you found works best for your organization?\nImage via Shutterstock \nGain a competitive advantage by subscribing to theTopRank® Online Marketing Newsletter.\n© Online Marketing Blog - TopRank®, 2015. | Influencer Marketing: Should You Pursue High Profile or Socially Authoritative Brand Advocates? | http://www.toprankblog.com \nThe post Influencer Marketing: Should You Pursue High Profile or Socially Authoritative Brand Advocates? appeared first on Online Marketing Blog - TopRank®.", "source": "Alfred Animal & Pest Control serving all of New Jersey...."}