{"published": "2015-09-10T15:32:50Z", "media-type": "News", "title": "Trump, Republicans under fire from rock stars over campaign songs", "id": "1cde83db-3f3a-4142-a309-c4efc433bf78", "content": "U.S. Republican presidential candidate  Donald Trump addresses a Tea Party rally against the Iran nuclear deal at the U.S. Capitol in Washington September 9, 2015.  Reuters/Jonathan Ernst    \nRock band R.E.M. lashed out at Republican presidential candidate Donald Trump for using its hit song \"It's the End of the World\" at a rally, with former frontman Michael Stipe slamming politicians for their \"moronic charade\" of a campaign. \n\nThe angry statement by the band, known for it support of liberal causes, followed a protest this week over the playing of \"Eye of the Tiger\" at a jubilant news conference for Kim Davis, the Kentucky clerk jailed for refusing to issue gay marriage licenses. \n\nTrump played the 1987 R.E.M. song as he began a rally in Washington, D.C., on Wednesday. \n\nIn a statement on its official Facebook page on Wednesday, R.E.M. said it neither authorized nor condoned the use of its music at the event. \n\n\"Let us remember that there are things of greater importance at stake here,\" said the statement from the band, which split up in 2011. \"The media and the American voter should focus on the bigger picture and not allow grandstanding politicians to distract us from the pressing issues of the day and of the current presidential campaign.\" \n \nStipe went further in a Twitter posting that slammed politicians as \"sad, attention-grabbing, power-hungry little men. Do not use our music or my voice for your moronic charade of a campaign.\" \n\nRepublican politicians have a history of run-ins with musicians over the uses of hit songs at their rallies. \n\nOn Tuesday, the 1982 Survivor hit \"Eye of the Tiger,\" was played as Davis emerged from jail to hold an impromptu news conference with Republican presidential contender Mike Huckabee. \n \n\"NO! We did not grant Kim Davis any rights to use My Tune -‘The Eye Of The Tiger,'\" Survivor frontman Frankie Sullivan wrote on Facebook. \"C'mom Mike, you are not The Donald but you can do better than that.\" \n\nCanadian singer Neil Young objected to Trump's use of his 1989 song \"Rockin' in the Free World\" when he announced his presidential campaign in June. Trump's campaign said it had paid to license it. \n \nTom Petty asked Tea Party politician Michele Bachmann to refrain from using his \"American Girl\" in her 2012 presidential campaign. \n\nIn perhaps the best known case, President Ronald Reagan attempted to co-opt Bruce Springsteen's 1984 hit \"Born in the USA\" into his political message despite the song's anti-nationalistic themes. \n\n\n(Reporting By Jill Serjeant ; Editing by Bill Trott )", "source": "Reuters"}