{"published": "2015-09-11T17:58:53Z", "media-type": "News", "title": "On Sept. 11 Anniversary, Appeals to Remember as Time Passes", "id": "57bd95b6-3410-4ecf-bd17-51fb40a72dd4", "content": "NEW YORK—Relatives of Sept. 11 victims marked the anniversary of the terror attacks Friday at ground zero with grief, gratitude and appeals to keep the toll front of mind after the passage of 14 years. \n \nOver 1,000 people — fewer than thronged the observance in its early years — gathered for what has become a tradition of tolling bells, moments of silence and the reading of the names of the nearly 3,000 people killed in the terror strikes at the World Trade Center, the Pentagon and a field near Shanksville, Pennsylvania. \n \n“We come every year. The crowds get smaller, but we want to be here. As long as I’m breathing, I’ll be here,” said Tom Acquaviva, 81, who lost his son, Paul Acquaviva. \n \nCarrying photos emblazoned with the names of their loved ones, victims’ relatives praised first responders, thanked the armed forces and hoped for peace and security: “Pray to our God to keep America safe and give the politicians the knowledge to keep America safe,” said Maria Perez, who lost her son, Anthony Perez. \n \nOne woman in the crowd collapsed during the ceremony, apparently overcome by grief; bystanders helped her to her feet. But mostly, victims’ relatives sent personal messages of enduring loss and remembrance to loved ones some had never even had the chance to know. \n \n“Please know,” Kristin Vanacore said to the memory of her brother, Edward Raymond Vanacore, “that you and all of the other victims will never be forgotten.” \n \nIn Washington, President Barack Obama and first lady Michelle Obama stepped out of the White House at 8:46 a.m. — when the first plane hit the north tower — to observe a moment of silence. Later Friday, President Obama was scheduled to observe the anniversary with a visit to Fort Meade, Maryland, in recognition of the military’s work to protect the country. \n \nA woman holds a photograph during a ceremony at the World Trade Center site in New York on Friday, Sept. 11, 2015. (AP Photo/Bryan R. Smith) \n \nThe Flight 93 National Memorial near Shanksville in western Pennsylvania was marking the completion of its $26 million visitor center, which opened to the public Thursday. At the Pentagon, Defense Secretary Ash Carter and other officials were joining in remembrances for victims’ relatives and Pentagon employees. \n \nSacramento, California, was commemorating 9/11 in conjunction with a parade honoring three friends who tackled a heavily armed gunman on a Paris-bound high-speed train last month. Two tunnels in Idaho Springs, Colorado, were renamed the Veterans Memorial Tunnels, and a cross-shaped steel sculpture taken from the rubble of the World Trade Center went on display at Dallas Love Field airport. \n \nSome Americans were observing the anniversary in their own ways. \n \n“I don’t go to the memorial. I don’t watch it on TV. But I make sure, every year, I observe a moment of silence at 8:46,” electrician Jeff Doran, 41, said Friday as he stood across the street from the trade center, where the signature, 1,776-foot One World Trade Center tower has opened since last Sept. 11. \n \nAfter years of private commemorations at ground zero, the anniversary now has become an occasion for public reflection on the site of the terror attacks. \n \nAn estimated 20,000 people flocked to the memorial plaza on the evening of Sept. 11 last year, the first year the public was able to visit on the anniversary. The plaza was to open three hours earlier after the anniversary ceremony. \n \nIn Washington, some members of Congress planned to spend part of the anniversary discussing federal funding for the ground zero memorial. The House Natural Resources Committee has scheduled a hearing Friday on a proposal to provide up to $25 million a year for the plaza. The federal government contributed heavily to building the institution; leaders have tried unsuccessfully for years to get Washington to chip in for annual costs, as well. \n \nA flag is placed along the South Pool prior to a ceremony at the World Trade Center site in New York on Friday, Sept. 11, 2015. (AP Photo/Bryan R. Smith) \n \nAn estimated 21 million people have visited the plaza for free since its 2011 opening. The museum, which charges up to $24 per ticket, has seen almost 3.6 million visitors since its May 2014 opening, topping projections by about 5 percent. \n \nThis year’s anniversary also comes as advocates for 9/11 responders and survivors are pushing Congress to extend two federal programs that promised billions of dollars in compensation and medical care. Both programs are set to expire next year. \n \nArmy Sgt. Edwin Morales had those responders in mind as he attended the ground zero ceremony in remembrance of his cousin firefighter Ruben “Dave” Correa. \n \n“People are still dying because of what happened,” both on battlefields and from illnesses that some who responded to the attacks have developed after exposure to toxic dust, Morales said. \n \nAfter Jyothi Shah read names in memory of her slain husband, Jayesh Shantitlal Shah, she paused to send him her love and the public her appreciation. \n \n“My kids and I would like to humbly thank everyone who has helped us, through the last 14 years, to be able to gently go through the sorrows, the suffering, the pain,” she said. “Thank you all very much — the city, the nation, the friends, the family.” \n You may also like", "source": "Epoch Times"}