{"published": "2015-09-14T13:55:53Z", "media-type": "News", "title": "Train travel 'has surged since rail privatisation'", "id": "bb53933a-3ed1-4437-a848-324ba9e67e7f", "content": "The number of rail journeys made each year has more than doubled since privatisation, according to a new report. \n \r\n\t\t\r \nSome 1.65 billion passenger train journeys were taken in the past 12 months compared to 801 million in 1997. \n\r  A total of 1.65 billion passenger train journeys were taken in the past 12 months, figures show \r \r \nThe figures come from analysis by the Rail Delivery Group (RDG) -  which represents operators and Network  Rail - based on  data from KPMG. \n\r\n\t\t\t\r \nThe study found 24.7 rail trips are taken per head of population each year, a 60% increase from 1998. \n\r\n\r\n\r\n\r \nThis growth in journeys in the UK is faster than in France (25%), Germany (23%) and the Netherlands (10%) over the same period. \n\nThe RDG found income from passengers covers the £9.5 billion annual operating cost of the railways, with government support being used to fund infrastructure. \n\nAccording to the report, the average price paid per passenger mile has increased by 6.7% (adjusted for inflation) since the mid-90s. \n\nMeanwhile, the profit made by operators has fallen from 3.6% of revenue in 1997 to 2.3% last year. \n\r\n\t\t\t\r \nThe study also found that the country's busiest rail termini - London's Waterloo and Victoria - have more arrivals per platform in the morning peak than European stations such as the Gare du Nord in Paris, Zurich and Frankfurt. \n\nEdward Welsh, spokesman for the Rail Delivery Group, said the rail network is better able to serve passengers and businesses because of its transformation over the past two decades into \" a great British success story\". \n\nHe went on: \"Crucial to this success has been the partnership between the private and public sectors, working together to deliver better value to passengers, freight customers and the nation. \n\n\"There is much more we need to do to improve services for our customers. Our greatest challenge is to plan and build for the ever growing demand for rail by increasing capacity cost effectively and generating revenue to support investment in more and better services.\" \n\r\n\t\t\t\r \n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Banbury Guardian"}