{"published": "2015-09-01T11:47:00Z", "media-type": "News", "title": "Aramark Kicks Off 2015 Football Season With New Slate Of Menu Options", "id": "1fad79e2-dc95-4c0a-af2a-daf2fa9c7063", "content": "SOURCE Aramark\n\nWith new items from James Beard Award winning chefs, to increased healthy menu choices, Aramark has football fans' cravings covered this NFL season\n\nPHILADELPHIA \n\nServing more than six million football fans annually, Aramark (NYSE: ARMK), which partners with more NFL teams than any other hospitality company to provide food and beverage services, is opening the new football season with a full roster of new menu items.\n\n\"We take pride in offering a great dining experience for football fans and are looking forward to another promising football season with great tasting and enjoyable menu options,\" said Carl Mittleman \n\nNEW CELEBRITY CHEF DISHES \n\nAramark partners with five James Beard \n\nNEW IN GENERAL CONCESSIONS\n\nAramark's culinary team is constantly looking for ways to innovate and update offerings. This season, the culinary team focused on local flavors and trends. \n\n\"BETTER FOR YOU\" OPTIONS\n\nAs part of Aramark's Healthy for Life® commitments and menu initiatives, Aramark is balancing the traditional stadium favorites it offers with a variety of healthier choices. Some fresh and flavorful new options available at stadiums around the country this season include:\n\nAramark partners with 17 National Football League teams to provide food and beverage, retail and/or facilities services – Baltimore Ravens, Chicago Bears, Cincinnati Bengals, Cleveland Browns \n\n**Photos of Aramark's new NFL menu items can be found here**\n\nAbout Aramark\n\nAramark (NYSE: ARMK) is in the customer service business across food, facilities and uniforms, wherever people work, learn, recover, and play. United by a passion to serve, our more than 270,000 employees deliver experiences that enrich and nourish the lives of millions of people in 21 countries around the world every day. Aramark is recognized among the Most Admired Companies by FORTUNE and the World's Most Ethical Companies by the Ethisphere Institute. Learn more at www.aramark.com or connect with us on Facebook and Twitter.\n\nContact:\n\nErin Noss Photo - http://photos.prnewswire.com/prnh/20150831/262445 \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/aramark-kicks-off-2015-football-season-with-new-slate-of-menu-options-300135481.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KFVE"}