{"published": "2015-09-21T13:49:16Z", "media-type": "News", "title": "The Pet Hut links with PDSA as 100th store opens", "id": "6114b922-2c09-4e11-ba40-710a157d8152", "content": "Published on 21 - September - 2015 Claiming to be the UK's fastest-growing pet retailer, The Pet Hut has celebrated a milestone with the opening of its 100th store. \nThe Pet Hut wants to raise over £50,000 for PDSA, with a drive in all 100 of its outlets \nThe discount chain, which is owned by Poundstretcher, has also partnered with veterinary charity PDSA in order to give customers access to its animal expertise. \nThe move will see PDSA's free PetCheck programme introduced at a number of its stores, with veterinary nurses giving free wellbeing checks to dogs from vans and offering care advice for other pets. \r \n\nThe Pet Hut also plans to provide information points in all its stores to offer help and advice to shoppers on how to look after their animals.\r \n\nTo mark the alliance, the retailer is pledging to raise over £50,000 for the charity over the coming year, with a fundraising drive in all outlets.\r \n\nThe Pet Hut's 100th store opened in Chesterfield on Friday in a programme that has seen the business expand by 25 stores in the last nine months.\r \n\nThe Pet Hut and Poundstretcher managing director Ian York said: \"This is an exciting partnership for both us at The Pet Hut and for PDSA as, as we grow our business, the more opportunities there will be to raise money for their excellent cause. \r \n\n\"Our stores are opening across the UK every single month, with our 100th store a real flagship moment for us.\"\r \n   \nDIYWeek.net does not edit comments which are submitted directly by our users to express their own views. Please report abuse of our comment system here.  \n© Datateam Business Media Limited 2015. DIY Week.net news articles may be copied \r\nor forwarded for individual use only. No other reproduction or distribution is permitted without prior written consent.", "source": "DIYWeek.net"}