{"published": "2015-09-06T04:57:18Z", "media-type": "Blog", "title": "Haiti: The Girl Next Door", "id": "b2236b36-94cc-4b47-8e6e-8891906962c9", "content": "MY GIRLFRIEND AND I flew to the Dominican Republic in the spring for a short vacation before starting our summer jobs. Almost as soon as we landed, however, Haiti began to beckon us. It was not the kind of siren song one hears from places like Thailand with its romantic beaches or France with its alluring culinary offerings. Haiti called to us like a bad conscience, more of a haunting than an enticement.\nYou could not read about Haiti without hearing that it was the poorest country in the western hemisphere, that it was still recovering from the earthquake of 2010, or that the United Nations had been present in the country for over ten years on an extended \"Stabilization Mission\".\n\"But we're so close,\" I said.\nHayley cut to the chase. \"Then let's go. We've been in the Dominican Republic for almost a week and all we seem to talk about is Haiti.\"\nIt was true, Haiti was the elephant in the room. The DR was itself a poor country, but it had a thriving tourist industry and a stable government. Playing tourist on the beaches of the Dominican Republic, a few miles from a humanitarian crisis zone, somehow felt wrong. So we began looking into our options for travel across the border. Dominican buses traveled to two destinations in Haiti: Port-au-Prince and Cap-Haïtien. That was the easy part. Finding a place to stay was more difficult. There didn't seem to be any affordable options. The hostel sites were blank and the other websites offered nothing but luxury accommodations which all but screamed, \"Your safe-house in Haiti!\" We managed to locate a reasonably priced bungalow on the beach near Jacmel in the south, but when we contacted the owner for directions he sent us the following e-mail:\nFrom Port-Au-Prince (PAP) take a taxi to the Jacmel Bus Station at Portail Leogane in PAP ($30 US). At the Jacmel Bus Station (in PAP) take a minivan or bus to Jacmel ($ 4.40; Peak Times: $6.70). The buses run from dawn to 6 pm and leave every 15 min. or so. During Rush Hour: The buses will stop at the PAP Bus Station on the outskirts of Jacmel. From there, travelers have 2 options: Hire a moto-taxi from the PAP Bus Station to Coterelle Breeze in Coterelle ($5.50), or hire a moto-taxi from the PAP Bus Station to the Marigot Bus Station in downtown Jacmel ($0.55). During NON Rush Hour: The buses will stop in downtown Jacmel. From the Marigot Bus Station, take a minivan (taptap) going towards Marigot ($0.90) or moto-taxi ($4.50). You are going to Coterelle which is right before Marigot. Ask the driver or a fellow rider to stop the taptap at the first gate on the right after Port Pigeons in Coterelle (about 5 minutes past Plage Ti Mouillage). It’s the only port in Coterelle so you could just say the Coterelle Port...\nAnd it went on. Almost as an afterthought he suggested that for $50 he could send someone to meet us in Port-Au-Prince and walk us through the entire process.\nWe decided to head north to Cap-Haïtien instead. In every country that I've traveled there is a place which is nicknamed, \"The Paris of so-and-so.\" There was Buenos Aires, The Paris of South America; San Francisco was The Paris of the West; and Shanghai was known as The Paris of the East. The expression has been so liberally applied to so many places that it says less about the subject than its object, ie. Paris is the center of the world. Nevertheless, I was surprised when I read that Cap-Haïtien was once known as \"The Paris of the Antilles.\" Was Haiti ever considered a five-star destination? Not really, unless you were an 18th-century French slave owner with a large sugar plantation. What a difference three centuries can make!\nThere was a direct bus from Santo Domingo to Cap-Haïtien so Hayley and I booked a next-day departure. We found a reasonably priced room at the grand-sounding Hotel Imperial for two nights and hoped for the best. The journey began in the early morning and we took our seats on the nearly empty bus, fingering our packs for reassurance: Tickets, check. Money, check. Rum, check. Our passports had been taken before boarding and we were told they would be returned to us at the border. Once we left the garbage-strewn cityscape of Santo Domingo the landscape became green and inviting. As we passed through this verdant country I thought about all the other countries I'd visited and how I only ever seemed to relax once I'd left the populated areas and journeyed to the remote regions. This was perhaps the motivation that drove humankind across the Bering Strait and allowed us to populate the entirety of the Earth: the search for a place to call one's own. As the rum took effect and I began to wax philosophic about the destiny of Man, Hayley - a freshly-minted Anthropology major - scoffed at my theories and called me a racist.\nWe crossed into Haiti at the Massacre River, a large and mostly dry riverbed, where a tall, lanky man came aboard holding a brick of money. I handed him fifty dollars and received well over two-thousand gourdes in return. It's a bit silly, but for me one of the great pleasures of travel is receiving enormous quantities of foreign currency in exchange for a few American dollars and savoring, albeit briefly, the illusion of great wealth (which is one of the reasons I don't like traveling to England). Our passports were stamped and returned and we drove on. The first noticeable difference was in the architecture. Although most houses appeared to be little more than shacks with corrugated roofs, the more permanent homes resembled French cottages. Built from cinder blocks and uniformly gray, all were embellished with decorative balustrades and other ornamental touches which lent them a certain elegance, as if they were simply awaiting a final and festive dash of paint. A few miles from the border we found ourselves rolling through green fields with picturesque hills and mountains beyond. I could already feel my preconceptions fading, being forced aside by this pleasant scenery, but before I could say \"What a lovely country!\" Cap-Haïtien came into view.\n\nMy first impression was of a place that had fallen apart. A place that no longer worked. There was a bunkered UN compound with blue-helmeted soldiers standing guard in watchtowers, their rifles held close to their chests, the walls around them crowned with barbed wire. Hazy hills enclosed a bay where a few barges lay immobile in the sea. Scattered palm trees rose above an empty beach that was no beach; it looked like a sidewalk after being violated by jackhammers. We crossed the Mapou River and stared down into a vast sewer. Floating trash extended from either bank and narrowed the channel to only a few navigable feet. The hills themselves were thick with flimsy homes as the outer slums crawled upslope, away from the city, like a wounded animal. Our bus was swallowed by traffic when it entered the downtown area. Motorcycles buzzed past like mosquitoes while tap-taps and trucks blared their horns impatiently or made their own lanes around us. I looked, appalled, at gutters that were nothing more than rivers of plastic waste, and above us French balconies clung precariously to buildings and threatened to collapse under the weight of residents who noted our passing without interest. Then the bus stopped. We'd arrived.\nFrankly, I didn't want to get off the bus. Cap-Haïtien had confirmed all of my worst fears about Haiti except the fear of violence, which is why I wanted to stay on the bus. Then I realized that Hayley was relying on me to take care of business here. In the Dominican Republic she had used her Spanish skills to translate for me. Now, in French-speaking Haiti, it was my turn. I grabbed my bag and hopped off the bus, landing in the middle of a crowd of young touts. Instead of descending upon me with offers of hotels, taxis, and \"clean girls\" as I'd anticipated, they stopped talking and just stared at me. I realized that they were just surprised to see a white face. It only took them a moment to regain their composure, and then the offers came. I said the name of our hotel and they shouted prices at me, which sounded extortionate, but only because the quotes were in gourdes.\n\"Five hundred!\" the first one shouted.\n\"Four hundred!\" another countered.\n\"I will take you there for three hundred!\" a third offered.\nThere was no need to haggle. They were doing it for me. I simply took the lowest price and we dove into his car.\nThe Hotel Imperial was not far away, but our driver fought for every gourde of his fare. Traffic was so chaotic it was like being treated to a preview reel of potential ways to die. The scenery, however, was constant: a monotonous landscape of decay. Hayley and I had fallen into a silent reverie, common to edgy travelers and the condemned, so it came as a pleasant surprise when our taxi pulled into a shady courtyard in front of a peach-colored hotel with a pool surrounded by deck chairs. It hardly mattered that the pool was filled with greenish water and the air-conditioning in the room didn't work. We were in Haiti, and we weren't dead.\nHayley and I unpacked, showered, played cards, finished the last of our rum, and finally decided to explore the city. Hand in hand, like children, we sortied into the street. Everyone stared at us, even a group of ladies who were carrying enormous loads on their heads paused to watch us pass. A group of kids from a nearby school followed us, but kept a safe distance until they could goad one of their number into approaching us.\n\"Bonjour,\" he said.\n\"Bonjour,\" I said back.\nHe looked over his shoulder at his classmates, who urged him on.\n\"Give me money,\" he said in English.\nI smiled. \"Pourquoi?\"\nHe looked at his friends again and they ran off. Hayley gave him some candy and we crossed the street to a cafe.\nPushing open a metal door we entered a dirt-floored room with a few bored ladies sitting at flimsy plastic tables. They exchanged glances until one of them sighed and approached us with a menu, then slumped back in her chair. Hayley and I scanned the overpriced menu and wordlessly devised an escape plan. It seemed that in Haiti you either paid the tourist price or the local price. There was nothing in between.\nI handed the menu back to the lady. \"Maybe later,\" I said.\nShe glanced at her cohorts and they smiled knowingly. I wouldn't pay these prices either.\nWe continued down the street, hopping over broken pieces of sidewalk and trying not to breathe too deeply around the sewage channels. \"What am I doing here?\" I thought. Granted, that thought went through my mind everywhere I traveled, but it seemed to carry more weight here in the midst of such poverty. I did what any sane individual would do. I looked for a bar.\n\nWe wandered the streets for an hour or so, meeting a motorcycle taxi gang who supported their families on a dollar a day and a few street hustlers who considered it a good day's work if they separated a tourist from a gourde or two, and then returned to our hotel. We'd given up on getting a drink when we noticed that the hotel bar was open. The barman, a handsome man in his mid twenties, was chatting with one of his co-workers in Creole. As we approached he turned to us with a smile.\n\"Je m'appelle Gil,\" he said, extending his hand in welcome.\nI introduced myself and my companion.\n\"D'où venez vous?\" he asked.\nI told him we'd come from the United States and he asked if Hayley spoke French. When I said non he immediately addressed her in English.\n\"Is this your first time in Haiti?\"\nIt is one of those nonsensical truths about the world that you often meet people in your travels who are far better educated or talented than yourself, people who should be lecturing you about your shortcomings, who are instead pouring you a drink or cleaning up after you.\nUpon hearing her native tongue Hayley perked up and began to barrage him with questions about his country. As was her wont, she ignored any small talk and went straight for the larger issues.\n\"What do you think about the United Nations?\" she asked.\nHe hesitated.\n\"I'm just wondering because we saw a UN compound on the way into town,\" she added, taking a sip of Prestige beer. \"Do Haitians like having them here?\"\nHe looked around. You could almost see the disclaimer appear below his face: The views of the bartender do not necessarily represent those of the hotel or any of its affiliates...\n\"They have done some good things,\" he said diplomatically.\n\"But...\" Hayley prodded.\n\"But they should leave now,\" he conceded.\n\"Why?\"\n\"They are taking jobs that Haitians can do, and...\" he glanced around once more.\nSensing his discomfort, I tried to change the subject.\n\"Did you feel the earthquake here?\" I asked.\nBoth he and Hayley laughed.\n\"Port-au-Prince is over a hundred miles away,\" Gil said.\n\"Yeah, James,\" Hayley snickered, then leaned closer to the barman. \"Anyway...\"\nSo I shut up and let them continue.\nGil lowered his voice.\n\"They have killed our people,\" he said. \"Hundreds have been shot by the UN.\" He noted our surprise and added, \"You don't hear about it in your press, but here it is common knowledge.\"\nThis was explosive stuff. My inner journalist stirred to life and I decided to check on his claim. I discovered that what Gil said was not true. The reality, however, was worse. The UN had sent several international brigades into Haiti after the 2010 earthquake in order to provide aid and stability. One of these groups came from Nepal and brought, along with food and water, a deadly strain of cholera that ended up killing over 6,000 Haitians. Riots erupted when outraged locals learned who was to blame for the epidemic and over a dozen protesters were shot by UN security forces in the ensuing clashes. Despite its honorable intentions the international community was beginning to realize that getting involved with Haiti was like sleeping with a damaged girl: there was going to be drama.\nI SAT ALONE in the dining room the next morning, waiting for Hayley to join me. Ceiling fans whirled noiselessly in the empty room while I jotted notes in my journal. The Imperial felt like one of those forgotten colonial enclaves you see moldering in hot countries the world over. The Imperial had never been a colonial haunt, it had simply gone straight to seed. The night before, Gil had made arrangements for us to be picked up by one of his friends on a motorcycle taxi. Our destination was the Citadelle LaFerrière. The Citadel is the largest fort in the Americas, constructed by Henri Christophe, a slave who became a general in Haiti's war of independence against the French. After the war, the rebel general Jean-Jacques Dessalines proclaimed himself Emperor. He was soon assassinated, but Henri Christophe followed his lead, proclaiming himself \"King of Haiti, Sovereign of [the] adjacent islands, Destroyer of tyranny, Regenerator and Benefactor of the Haïtian nation, Creator of her moral, political, and martial institutions, First crowned monarch of the New World, Defender of the faith, Founder of the Royal Military Order of Saint Henry.\" He was an unpopular autocrat and, consumed by paranoia, took his own life.\nAlexander arrived on his Haojin motorcycle and we climbed aboard. At first I wondered if the three of us might be too much for his Chinese bike, which was no more than a 250cc, but there were entire families packed onto similar bikes so I stopped worrying about it. Alexander, however, was in a bad mood. He managed to force an occasional smile but generally kept silent. I asked him to pull over at a convenience store so we could pick up some water and he followed us dutifully through the musty aisles without comment. I told him to grab something for himself. \"C'est moi qui l'offre,\" I told him. He scanned the cooler and pulled out a 22-ounce Red Bull, confirming my suspicion that he was simply hung over. We hopped back on his bike and Alexander wove his way expertly through Cap-Haïtien traffic, which was not as terrifying as I'd anticipated, not like Bangkok. Before long we were in the countryside and he opened the throttle. Hayley's hair whipped against my face as we tore through a beautiful landscape of lush farmland.\nIt only took twenty minutes to reach the town of Milot at the base of the mountain where the Citadel was perched. Our white faces were spotted at once and an entrepreneurial assault was launched. Several motorcycles pulled up alongside us as we cruised through town and a young man shouted, \"Bienvenu au Milot! Je m'appelle Joseph, votre guide pour La Citadelle!\" We had found our guide, or rather, he had found us.\nAlexander pulled into a parking area and seemed to enjoy our discomfort as we staggered backwards under a press of guides and merchants waving everything from sodas to wooden swords in our faces. Joseph elbowed his way through the group and grabbed my arm.\n\"Vous vous me souvenez? Joseph! Suivez-moi!\"\nHe led us to the ticket booth where Hayley and I bought our entrance tickets and then he pulled us away to introduce another motorcycle taxi driver, which he said would be necessary for the steep climb up the mountain. Wherever we went we were surrounded by a throng of people shouting at us in French. Hayley looked at me with an expression that said, \"Do you know what's going on here?\" I asked Joseph how much his guide service would cost, but before he could answer there was a heightened chorus of excited voices.\n\"Forty dollars!\" someone offered.\n\"Thirty dollars!\" another countered.\n\"Twenty-five dollars!\"\n\"I need a guide that speaks English,\" I said.\nThere was a noticeable lull and once again Joseph stepped forward.\n\"I will give you an excellent tour,\" he said in English, \"for twenty dollars.\"\nI got back on Alexander's bike and Hayley took her seat on the other. Joseph led the expedition from his own chariot and we roared away under the midday sun.\nThe road was a steep cobblestone path that nearly destroyed my spine, but what a view! Mountain ridges undulated down to the sea, which was green and indistinct from charcoal fires, while a heavy sun forced all clouds from the bright blue sky. As we came to the end of the road we were again surrounded by desperate merchants. I wanted to buy something. I wanted to help. But they were hawking cheap souvenirs; shoddy hats and wooden swords emblazoned with the words La Citadelle or I ♥ Haiti. I couldn't bring myself to fork out for this shit.\nAs Hayley and I dismounted to walk the final kilometer to the fort we found ourselves accompanied by an entourage of donkey dealers.\n\"You need!\" they said.\n\"Very far!\"\n\"Very hot!\"\n\"You tired!\"\n\"Good price!\"\nHayley relented and rented a donkey. \"I didn't want a fucking donkey,\" she told me later. \"I just wanted to get everyone off my back.\"\nAnd it worked. Once a sale had been made the rest of the troupe dissolved away.\n\nThe fort is usually described as resembling the prow of a ship, and that is an accurate description. It rises above the hilltop like a battleship cresting a wave and it would not seem unnatural if the entire edifice suddenly plunged toward the sea. There isn't much to distinguish one fort from another, and like chateaux along the Loire Valley they all share certain accoutrements. The Citadelle was no exception. There were high walls with small windows, massive cannons on swivels and pyramids of cannonballs, and a drawbridge. Built to withstand an assault from the colonial French army, it was never put to the test, either because the French lost interest or because the fort was considered impregnable. It certainly seemed impregnable to me with its thick walls, inaccessible location, and the fact that it afforded a 360-degree view of the surrounding valleys. Not to mention the fact that it was a sweltering climb to the top. Even the ladies who carried tubs of chilled soda - no less an effort than soldiers carrying arms - took frequent rest stops in the shade.\nJoseph began his monologue and I quickly lost interest when I realized that his spiel amounted to little more than a verbatim reading of the free brochure for the site. That may not be precisely true, but it was certainly delivered with all the enthusiasm of a waiter listing the available choices of salad dressing. Hayley was kinder and listened his speech, leaving me free to wander the grounds.\nOn our way downhill we crossed paths with a contingent of UN workers huffing under the weight of their weapons. At first I thought it was admirable that these workers were taking an interest in local culture, but why bring rifles? I later discovered that because of its elevation the hilltop was used as a radio tower for the UN. The rifles were apparently just for show.\nAlexander sped us back to Cap-Haïtien, from farmland to wasteland. Back at the hotel we handed over the agreed-upon sum plus a generous tip. Alexander took the money with a smile and shook my hand. As I started to walk away he called me back.\n\"Regardez!\" he said, pointing to the exhaust pipe on his motorcycle.\nThere was a small section where the chrome was black.  Then he pointed at my feet.  I lifted one of my sandals and saw that the sole had nearly burned through.  I'd been resting my foot on the hot surface the entire trip.\n\"I thought I smelled something,\" I said.\nHayley gave a droll shake of her head.  \"Consider yourself lucky.\"\nAnd that was the lesson I took with me from Haiti.", "source": "squattersinparadise"}