{"published": "2015-09-07T19:00:00Z", "media-type": "News", "title": "Shoemaker shot dead in Shahdara", "id": "37401429-eafd-4db9-b7a3-6c2961bf1872", "content": "LAHORE \n\nA shoemaker was shot dead by some unidentified people in Shahdara police limits on Monday. \n\nPolice removed the body to morgue for autopsy and registered a case on the complaint of Arshad, a brother of the victim. Ghulam Mustafa, 55, a resident of Lajpat Road, was working at his shop when some unidentified men shot at him and fled. He was shifted to a nearby hospital where doctors pronounced him as brought dead. \n\nDIES: A 55-year-old man admitted to a hospital a few days ago died. SI Manzoor said the man was found unconscious on August 26. He was admitted to Jinnah Hospital. \n\nTWO DACOITS ARRESTED: Sadr CIA police claimed to have arrested two members of an inter-district Bali Gang and recovered cash, valuables and illegal weapons from them. The accused were identified as Iqbal alias Bali and Ghulam Shabbir alias Shabo. They were arrested by a special police team and recovered cash and valuables. Police said the accused were history sheeters and jailbirds. They confessed many dacoities. SSP Investigations Rana Ayyaz announced commendatory certificates and cash prize for the police team. \n\n688 ACCIDENTS REPORTED: At least 688 accidents were reported in Rescue 1122 Provincial Monitoring Cell in all 37 districts of Punjab during the last 24 hours in which six lives were lost. During the accidents, 519 serious injured were shifted to different hospitals and some 271 victims sustaining minor injuries were provided first aid on the spot. \n\n257 criminals arrested in August: Lahore police claimed to have arrested 257 accused persons of 104 gangs and 240 cases have also been traced against them during the month of August, 2015.According to a handout, police also recovered booty worth Rs14.6 million from the gang members besides arresting 1,632 proclaimed offenders and court absconders during the same period. \n\nDIG Operations Dr Haider Ashraf directed the police officers for the implementation of National Action Plan and to utilise their full energies to curb crime in the city and arrest the criminals involved in different unlawful activities. On his directions, all divisional SPs increased their efforts against criminals and showed excellent results. \n\nDuring the August, 522 cases registered against 522 accused on having illicit weapons and police also recovered 10 Kalashnikovs, 30 rifles, 51 guns, 424 revolvers and pistols, 1 carbine, 10 daggers and 2,708 bullets from their possession. During the action against drug dealers, 681 cases were registered and 694 culprits were arrested and 58.351kg heroin, 181.10kg chars, 6.485kg opium and 4,796 bottles of liquor recovered from them. Moreover, 110 cases were registered against gamblers and 479 accused arrested and also recovered more than Rs400,000 stake money. In the same period during the special crackdown, 783 cases were registered against 785 culprits on the violation of law. \n\nSI held for taking bribe: Anti-Corruption Establishment (ACE) has arrested a sub-inspector for taking bribe. \n\nComplainant Azam approached the provincial watchdog, accusing SI Amjad Ali of taking bribe from him in a case. On Monday, ACE officials arrested SI when he was taking Rs 10,000 bribe from Azam.", "source": "The News International"}