{"published": "2015-09-04T14:38:21Z", "media-type": "News", "title": "Pahrump Special Olympics pioneer to be honored in Times Square", "id": "dd664b41-b1b8-4c01-89cc-c6c40c263e96", "content": "David 2014 Volunteer of Year Award DSOSN    By Vern Hee \nPahrump Valley Times    \nDavid Abraham Jr. came to Pahrump 15 years ago as a young man and left a lasting impression on the valley with his spirit of volunteerism. He was a pioneer in the early days of Special Olympics in Pahrump and helped Audrey Gourley, the founder of Special Olympics in this town, to collect money for the organization. \n\nThis tireless volunteer has Down syndrome, but you wouldn't know if from all the work he does for his community wherever he lives. \n\n\"David was born with Down syndrome, but it has never stopped him from doing anything and he is now 51,\" said his mother, Sara Abraham. \n\nHer son now lives in Las Vegas and he continues to volunteer. \n\nHis efforts are being rewarded in a big way this year. The National Down Syndrome Society is honoring David Abraham Jr. in its annual video in New York City at Times Square. \n\nEvery year, the NDSS reminds the world in a big way about the gifts that people with Down syndrome bring to their communities through a special video presentation on a jumbo screen in the heart of Times Square. \n\nOver 1,000 photos are submitted each year and David Abraham Jr.'s photo was chosen. \n\nAccording to Deann Cline, director of fund development for the Down Syndrome Organization of Southern Nevada, only five other photos from the area were selected. His photo will be displayed on Sept. 19 at 10 a.m. in Times Square. After this presentation, the NDSS will place the video on Youtube. \n\nDavid Abraham Jr. learned from his parents at an early age to volunteer. His mother recalled that his favorite organization has been Special Olympics. \n\n\"He was a teenager when he first started helping Special Olympics,\" Sara Abraham said. \"Our whole family supported him and also helped out with Special Olympics.\" \n\nWhen asked why he liked volunteering, David Abraham Jr.replied, \"I just like helping people.\" \n\nIn Pahrump, he volunteered wherever he went and also held a job while he lived in Pahrump for six years. \n\nThe Abrahams spent their years in Pahrump working to get Special Olympics off the ground with Gourley. While in town, David Abraham worked for the Pahrump Valley Times inserting ads into the paper. \n\nKay Jones, former coordinator of Pahrump Special Olympics after Audrey Gourley, remembered helping David Abraham Jr. with his job. \n\n\"We went in to the paper at 11 p.m. to do this and we wouldn't leave until 4 a.m. two nights a week,\" Jones said. \"He was pretty smart. I remember teaching him about money and change and he could count money back. He was always a good worker.\" \n\nWhen he left Pahrump for Las Vegas, he continued to help people. In 2010 he started working for the DSOSN. His mother said he would do everything for them. \n\nCline has known him since he started at DSOSN and said he was always willing to work hard. \n\n\"Whenever we need him he is always the first one down here to start working,\" she said. \"David is now on the board of directors and helps make decisions.\" \n\nShe added that David Abraham Jr. works hard volunteering for the DSOSN Festival of Trees and Lights. This is where the organization has sponsors design Christmas trees and then they are auctioned off in a fundraiser. \n\nHe was chosen in Las Vegas as the volunteer of the year for DSOSN last November. \n\nSara Abraham said her son just likes to work hard. \n\n\"He likes to do yard sales to raise money for various organizations, he has painted the offices of DSOSN in Las Vegas and has helped print the calendar for DSOSN,\" she said. \"My son is now retired from working, not volunteering. He worked hard for 38 years.\" \n\nHis mother said he still participates with Special Olympics and does bowling and bocce ball.", "source": "Pahrump Valley Times"}