{"published": "2015-09-30T22:57:00Z", "media-type": "News", "title": "IMPORTANT INVESTOR ALERT: Khang & Khang LLP Announces the Filing of a Securities Class Action Lawsuit against Pier 1 Imports, Inc. and Encourages Investors to Contact the Firm", "id": "8196cdbf-f1e3-46a8-9dbe-3742066a4529", "content": "Khang & Khang LLP (the “Firm”) announces that a class action lawsuit has \n      been filed against Pier 1 Imports, Inc. (“Pier 1” or the “Company”) \n      (NYSE: PIR ). \n      Investors who purchased or otherwise acquired shares between December \n      19, 2013 and February 10, 2015, inclusive (the “Class Period”) are \n      encouraged to contact the Firm immediately to discuss their legal \n      options. \n\nIf you purchased shares of Pier 1 during the Class Period, please \n      contact Joon M. Khang, Esquire, of Khang & Khang, 18101 Von Karman \n      Avenue, 3rd Floor, Irvine, CA 92612, by telephone: (949) 419-3834, or by \n      email at joon@khanglaw.com . \n   \nThere has been no class certification in this case. Until certification \n      occurs, you are not represented by an attorney. You may choose to take \n      no action and remain a passive class member. \n\nAccording to the complaint, the Company made false and/or misleading \n      statements and failed to disclose the truth regarding “unplanned” \n      expenses that had led the Company to lower its financial guidance. When \n      the truth was revealed to the public, shares dropped causing investors \n      harm. \n\nIf you purchased shares of Pier 1 during the Class Period you have until \n      October 26, 2015 to ask the Court to appoint you as lead plaintiff. If \n      you wish to learn more about this lawsuit, or if you have any questions \n      concerning this notice or your rights, please contact Joon M. Khang, a \n      prominent litigator for almost two decades, by telephone: (949) \n      419-3834, or by email at joon@khanglaw.com . \n\nThis press release may constitute Attorney Advertising in some \n      jurisdictions. \n\n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/201509300069", "source": "Marketplace"}