{"published": "2015-09-28T22:33:02Z", "media-type": "News", "title": "UN serves world leaders ‘landfill salad’ to highlight food waste", "id": "01da175a-e136-41c1-9931-a417467bc196", "content": "When 30 world leaders sat down to lunch at the United Nations, they weren’t treated to a fancy meal that the political crème de la crème are accustomed to. Instead, they ate items like “landfill salad,” “chickpea water” and “repurposed bread bun.” \n\nThe US-themed menu at the UN’s Sunday lunch was prepared by world-renowned chefs, and designed to highlight food waste and how agricultural production contributes to climate change. It was a far cry from Monday’s lunch, where heads of state dined on smoked trout and cucumber timbale, caramelised beef short ribs and spiced wild berry compote. US President Barack Obama and Russian President Vladimir Putin toasted each other with glasses of rosé at the luncheon. \n\n“It’s the prototypical American meal but turned on its head,” prominent New York chef Dan Barber, who helped design the menu, told AFP. “Instead of the beef, we’re going to eat the corn that feeds the beef. The challenge is to create something truly delicious out of what we would otherwise throw away.” \n\nBarber and former White House chef Sam Kass worked together to create the vegetarian meal. Kass is known as the architect of US First Lady Michelle Obama’s anti-obesity campaign called Let’s Move. \n\n\"Our lunch was produced from food that would otherwise end up in landfills, emitting methane, a potent greenhouse gas,\" UN Secretary-General Ban Ki-moon Ban told reporters. \n\nFood production and agriculture contribute as much to climate change as transportation does, he noted. \nREAD MORE: Americans trash about 1/3 of their food, worth $161bn - USDA \n“More than a third of all food produced worldwide ‒ over one billion tonnes of edible food each year ‒ goes to waste,” Ban said. “That is shameful when so many people suffer from hunger.\" \n\nAccording to UN figures, more than a quarter ‒ 28 percent ‒ of agricultural lands around the world go to produce food that is lost or wasted, the equivalent of 3.3 billion tonnes of carbon responsible for climate change. \n\nSo Barber and Kass composed lunch items out of compost. The “landfill salad” was made from unwanted vegetable scraps salvaged from the waste of big food producers, rejected apples and pears, and dressed with the liquid drained from a can of chickpeas. “Spent grain bread” was baked from grain mash normally tossed out by brewers and distilleries. \n\nThe veggie burger consisted of “off-grade vegetables,” cucumber scraps from the pickling industry, “pulp left over from juicing,” and was served on a “repurposed bread bun.” “Cow corn fries” served as a side dish, made from field corn ‒ different from sweet corn that people usually eat ‒ that represents 99 percent of the corn grown in the US. It is used to feed cattle. “Bruised beet ketchup” was the condiment. \n\nFor dessert, “cocoa husk custard” was made from the outer shell of a cocoa bean, the dried skin and the material leftover after pressing nuts for oil. \n\nKass dreamed up the themed lunch after he learned of the year-end UN climate negotiations in Paris, he told AFP. Those talks aim to create a far-reaching global agreement to tackle climate change. Yet the world leaders heading to those negotiations weren’t talking about food waste, “except in small environmental circles,” he said. \n\nIt’s not the first time that Barber has tackled the food waste concept. Earlier this year he ran a pop-up restaurant in New York City that featured food scraps. \n\n“The idea of doing a ‘waste dinner’ would not have existed in the 1700s,” he said. “The westernised conception of a plate of food is enormously wasteful because we’ve been able to afford waste.” \n\nHe hopes that the menu is enough to get the world leaders ‒ including Ban and the meal’s hosts, French President Francois Hollande and Peruvian President Ollanta Humala.‒ to spread the message of the dangers of food waste, gradually changing food culture. \n\n“The long-term goal of this would be not to [be able to] create a waste meal,” Barber said. “You don’t do that by lecturing ‒ you do it by hedonism, by making these world leaders have a delicious meal that will make them think about spreading that message.”", "source": "Russia Today"}