{"published": "2015-09-28T07:09:02Z", "media-type": "News", "title": "John McDonnell defends direct action to protest about tax dodgers", "id": "f19e1948-9eba-41ed-8a27-aa6acf76ddd3", "content": "Shadow chancellor John McDonnell has defended the use of direct action tactics to protest about tax dodgers as he called for a \"national debate\" about the future of the economy.\n\nThe left-winger insisted that alongside parliamentary debates \"we do need a bit of protest in this country\" as he set out his plans for a \"new economics\" to redistribute wealth which will shift the burden of taxation away from low and middle earners.\n\nConservatives accused Mr McDonnell of planning \"damaging tax rises on jobs, investment and earnings\", after he said his plans would ensure the economy \"serves everybody, not just the rich few\".\n\nBut Mr McDonnell claimed the Tory warnings were a \"fantasy\" and joked they \"must have been affected by the lunar eclipse\".\n\nThe veteran campaigner defended the use of street protests and occupations as tactics to highlight problems with the way the economy worked.\n\nAhead of his first Labour Party conference speech since his appointment as shadow chancellor, he told ITV's Good Morning Britain: \"I have called for direct action campaigns because that is the right of people to protest.\n\n\"I will give you one example, on tax justice. Years ago I was part of a tax justice campaign where we had meeting after meeting about how we make sure we tackle tax evasion, tax avoidance in this country.\n\n\"Along come a group of young people called UK Uncut and they took some direct action - they protested in the street, they occupied a couple of offices that were not paying their taxes.\n\n\"Eventually that meant that we started addressing the issue and even George Osborne then had to start addressing the issue.\n\n\"So sometimes, in addition to parliamentary debates, we do need a bit of protest in this country. That is exactly what I have been advocating.\n\n\"But it is purely non-violent protest.\"\n\nHe added: \"If you upset people, people stop listening.\n\n\"But the whole point of today, actually, is to give people the opportunity to channel their ideas into a real national debate about the future of our economy.\n\n\"In that way, people don't need to protest, they simply need to join the Labour Party and become part of that discussion.\"\n\nMr McDonnell's speech comes as leader Jeremy Corbyn seeks to regain the initiative after activists denied him a vote at Labour's annual conference in Brighton on whether to keep the Trident nuclear deterrent.\n\nMr Corbyn wants to scrap the missiles, but unions Unite and the GMB insist they should be kept and delegates decided on Sunday that the subject should not even be debated in the four-day conference.\n\nMeanwhile, The Times reported that a Unite official had proposed \"stuffing\" constituencies of centrist MPs who refused to serve under Mr Corbyn with supporters, in an apparent bid to force out moderates.\n\nIn a leaked email obtained by the paper, executive council member Tony Woodhouse reportedly said the union should \"do a massive recruiting drive in the CLPs (constituency Labour parties) where MPs have said they wouldn't serve in his shadow cabinet\".\n\nBut a Unite spokeswoman said: \"As we have made consistently and regularly clear, Unite does not and will not support any moves to target MPs.\"\n\nMr McDonnell told ITV he wanted a \"rational debate about our tax policies\" and insisted that today was \"the start of that debate, not the conclusion of it\".\n\n\"We are going to set out our proposals this morning for opening up a national debate about where our economy is and where we need to grow it,\" he said.\n\n\"I have heard some of the rumours about massive tax increases - I think the Tory party must have been affected by the lunar eclipse last night, we have said nothing whatsoever. We are actually not making any major statements on tax today.\n\n\"What we are saying is we recognise there is a deficit and we are going to tackle that deficit. Yes, we are going to vote against some of the tax cuts for the rich that the Conservatives are introducing, our main thrust is around making sure that we tackle tax evasion, tax avoidance.\n\n\"But more importantly, we want to start growing the economy. So where they have got these fantasy figures about increases in taxes from, I have got no idea.\"\n\nMr McDonnell said he wanted to have access to public finance watchdog the Office for Budget Responsibility and the Bank of England to help Labour \"model our proposals\".\n\nMr McDonnell said that the general public would be given a say in the direction of Labour's economic policy.\n\nThe shadow chancellor told BBC1's Breakfast: \"What we are doing today is opening up one of the biggest debates on our economy this country has ever seen.\n\n\"Everyone will have their say, so the future policies of the Labour Party will be determined by the British people themselves, having faith in the people - trust the people.\n\n\"We will be able to come up with the ideas, then we will rigorously test them and test them again until we know they will work in the interests of everybody and not just the rich elite in this country.\"\n\nHe said Labour was \"an anti-austerity party now - that's the basis on which Jeremy Corbyn was elected\". \n\nAnd he added: \"We will take measured steps to ensure that we create a secure, growing, prosperous and more importantly sustainable economy.\n\n\"Most importantly we have got to grow this economy. If we can grow the economy we can tackle the deficit.\n\n\"We don't support a lot of the tax cuts the Conservatives have given to the rich in this country and we will vote against them.\n\n\"But also, what we will try to do is bring forward really detailed policy on how we tackle tax evasion and avoidance by big corporations. We want these organisations to pay their taxes.\n\n\"If we grow the economy and make sure the corporations pay their taxes and we halt the tax cuts for the rich, we can solve the issue of the deficit.\"\n\nMr McDonnell confirmed he will launch a review of Britain's tax system, including the functioning of HM Customs and Excise and the question of whether to introduce a Robin Hood Tax on financial transactions.\n\n\"The Robin Hood Tax is Labour Party policy at the moment if we can introduce it globally,\" he said. \"That's been Labour Party policy for some time.\n\n\"Today we are going to launch a review of our taxation system. We are going to bring the greatest economic minds in the world to bear on that issue, consult the British people and then we are going to arrive at our decision on the way forward.\"\n\nAsked whether he stood by the entry in Who's Who in which he described his pastime as \"fomenting the overthrow of capitalism\", Mr McDonnell said: \"What I'm saying is we have got to transform the existing economic system because it's simply not working for people.\"\n\nFormer home secretary Alan Johnson, who has previously been approached to stand as party leader, said he expected Mr Corbyn to remain in post for a decade.\n\nHe told BBC Radio 4's Today programme: \"He'll perhaps be the servant of the party that I never was, that perhaps I should have been. Many people criticised me for that.\n\n\"I think he will be the leader at the next election, yes,\" he added. \n\n\"Anyone who is voted in that emphatically should be there for, I think Tom Watson said ten years. I think that's probably true.\" \n\nMr Johnson said he was \"totally confident\" that Mr Corbyn was committed to Britain remaining within the European Union.\n\n\"He's made it clear since being elected leader he wants to stay in Europe.\"\n\nCopyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Littlehampton Gazette"}