{"published": "2015-09-17T00:05:09Z", "media-type": "Blog", "title": "Journalism professor to run on platform of education reform", "id": "31019551-536c-4752-a10e-3d659d13beb9", "content": "STORY BY LAUREN VELASCO As a new election cycle kicks into full gear, Drake professor and alum Jennifer Glover Konfrst is beginning her political campaign to be District 43’s Representative in the Iowa House. Konfrst would represent the cities of Clive, West Des Moines, and Windsor Heights. Konfrst is also a professor in public relations and political advocacy. When it comes to having two different jobs, she knows how to keep them separate from one another. “I see myself as wearing two separate hats. These paths are parallel but are never crossing,” Konfrst said. Although Konfrst is a novice to the campaigning process, she is familiar with policy and legislation. Aside from teaching political advocacy, Konfrst has also worked for the US Senate. Konfrst’s political background makes her no stranger to Iowa District 43 either. She has several ideas that she hopes to implement if she is elected. “I feel like this is a time when my skills in public service are needed to bring people together and not keep dividing them,” Konfrst said. One of Konfrst’s main focuses is on the public education system in Des Moines. The low funding for public education and mental health programs provides a challenging but necessary goal for Konfrst. “It is very important to me that public education and mental health programs are funded in Iowa because everyone deserves to be treated well by the state,” Konfrst said. Konfrst has an important group of people helping her throughout her campaign. One notable volunteer is Drake PR alum Taylor Larson. “Before attending Drake, I had no background in politics. But by living in Des Moines, you just get immersed in the political atmosphere,” Larson said. Larson is currently a first-year law student and hopes to someday work in policy and legislation. After graduating from Drake as an undergraduate in public relations she has always stayed close to Konfrst. “(Konfrst) would be a great representative. I know she is listening (to her district) and she would be a great person for the job,” Larson said. “She would do everything in her power to let people know what’s going on.” State Senator of Iowa Janet Peterson is also one of Konfrst’s supporters for the election process. She endorsed Konfrst’s campaign and will volunteer for her as well. Peterson has served in the Iowa Legislature for 15 years total, as a representative and as a senator. “I love it when I see great people make a decision to run for public office. That’s why I was thrilled to see my friend Jennifer Konfrst announce her run for the Iowa House,” Peterson said.“She’s smart and successful. She shares our Democratic values and she knows how to get things done,” Konfrst and her outside team of supporters and volunteers will work towards getting a primary election, which will take place in June of 2016, followed by the general election in November of 2016. In the meantime, Konfrst will continue to advocate her goals for District 43. “When I make changes, I want to make sure people are represented fairly and all voices are heard equally.”", "source": "The Times-Delphic"}