{"published": "2015-09-29T11:24:33Z", "media-type": "News", "title": "Local investigators, prosecutors using wiretaps", "id": "ad64b2c0-205a-4b5d-90cc-a6d84891f085", "content": "CLEVELAND, Ohio -- Cleveland police and Cuyahoga County prosecutors have started using wiretaps in some criminal investigations, taking a page from the playbook of the U.S. Justice Department. \n \nThe move is in part a result of local investigators seeing the results the Justice Department obtained with wiretaps in high-profile cases, said Assistant Prosecuting Attorney Matthew Meyer. \n \n\"We've seen the technique used with great success locally in rooting out corruption and there's no reason why we should leave that tool on the shelf,\" Meyer said in an interview with Northeast Ohio Media Group. \n \nSecretly recorded phone conversations figured prominently in the Justice Department's investigation of corruption in Cuyahoga County. The investigation resulted in convictions of some 60 contractors and public officials, including former County Commissioner Jimmy Dimora. \n \nThis summer, county prosecutors acknowledged in court that local investigators used wiretaps in two high-profile cases, both handled by Meyer. \n \nOne case involves suspected mobster Carmine \"The Bull\" Agnello , who is charged with running a $4.2 million car-scrapping scheme. The second involves Tevaughn \"Big Baby\" Darling, accused of being a \"heroin kingpin.\"   \n \nWhy wiretaps haven't been used before \n \nCounty Prosecutor Timothy J. McGinty, who has spent more than three decades in the county's criminal justice system as either a prosecutor or judge, said he's not aware of the prosecutor's office ever before using a wiretap without help from federal agents. \n \nMcGinty said he suspects time and money are the reasons previous prosecutors did not seek permission from a judge to use the listening devices. \n \nThe equipment costs hundreds of thousands of dollars, he said, and officers have to be trained to use the equipment. \n \nMostly, though, the use of wiretaps is time-consuming. Officers often have to be committed to spending hundreds or even thousands of hours listening in on phone conversations, many of which are irrelevant to the investigation. \n \nMcGinty credited the Cleveland police department with initiating the local use of wiretaps and getting the process up and running, along with financial assistance and training from Attorney General Mike DeWine's office. \n \nA spokeswoman for the police department declined to comment, citing a need for secrecy because wiretaps involve \"investigative strategy.\" \n \nMcGinty said wiretaps are worth the investment of time and money. \n \n\"When you have sophisticated, diabolical, and dangerous criminals such as the ones we've targeted and others, we want to use all the tools at our disposal, and this is a powerful tool,\" he said.  \n \nDefense lawyers take notice \n \nDefense attorney Marcus Sidoti, who faces wiretap evidence in representing the accused \"heroin kingpin,\" could not recall an earlier case in which county prosecutors used wiretaps without assistance from federal agents. \n \n\"It's uncharted territory for me in the state realm,\" he said.  \n \nAnd Ian Friedman, an adjunct faculty member at the Cleveland-Marshall College of Law and the defense attorney representing Agnello, called the use of wiretaps in his client's case \"very unusual.\" \n \nBut now that the prosecutor's office has shown its hand, Friedman said defense attorneys will be better prepared for wiretap evidence. \n \nFriedman said he has always advised clients to be wary of what they discuss over the phone. Now, he said, he's pointing to the Agnello case to show that the state has invested in the technology, and is expected to use it frequently.  \n \n\"It's my understanding that there are hundreds of hours of recordings in the Agnello case alone, so it looks like this is going to be a new area of fight between prosecutors and defense lawyers in Cuyahoga County,\" Friedman said. \n \nFriedman and Sidoti have yet to hear the contents of the wiretaps used in their cases, but they said they will need to make sure the wiretaps were obtained legally and that the recorded conversations are admissible at trial.  \n \nProsecutors and police need permission from a judge to conduct a wiretap. To get that permission, they have to show they have probable cause that criminal activity is taking place, and that other investigative means haven't worked. \n \nFuture uses \n \nMcGinty said he intends to reserve the use of wiretaps for criminals who are the \"worst of the worst.\" \n \n\"In the long run, if we're successful...at using these wiretaps in our efforts to attack organized crime in Cleveland, whether it be Mafia, drug dealers or gang activity, this will be a safer place,\" he said. \n \nHe said wiretaps are particularly useful in understanding all the players in a criminal network and how they operate. \n \nHe also hopes the use of wiretaps by local investigators will have a deterrent effect. \n \n\"We're sending a message,\" he said. \"To the criminals: We're coming to get you. This is not the county to operate in. Go get a job.\"", "source": "Cleveland.com"}