{"published": "2015-09-16T13:30:00Z", "media-type": "News", "title": "TransData Files Patent Infringement Lawsuits Against Smart Meter Manufacturers General Electric, Itron, Landis+Gyr", "id": "bd8e0e6c-360d-47e8-adc8-74bfbf3a6530", "content": "TransData, Inc., a leading developer and manufacturer of digital electricity meters and related energy measurement products for the electric utility industry for over 45 years, today announced that the company has filed patent infringement lawsuits in the United States District Court for the Eastern District of Texas against General Electric (NYSE: GE), Itron, Inc. (NASDAQ: ITRI) and Landis+Gyr AG (60% owned by Toshiba Corp (TYO: 6502), and 40% by Innovation Network Corporation of Japan (INCJ), a public-private partnership between the Japanese government and more than 25 individual corporations). \n  \nDALLAS , Sept. 16, 2015 /PRNewswire/ -- TransData, Inc., a leading developer and manufacturer of digital electricity meters and related energy measurement products for the electric utility industry for over 45 years, today announced that the company has filed patent infringement lawsuits in the United States District Court for the Eastern District of Texas against General Electric ( NYSE: GE ), Itron, Inc. ( NASDAQ: ITRI ) and Landis+Gyr AG (60% owned by Toshiba Corp (TYO: 6502), and 40% by Innovation Network Corporation of Japan (INCJ), a public-private partnership between the Japanese government and more than 25 individual corporations). \n\nIn the lawsuits, TransData asserts that General Electric, Itron and Landis+Gyr are willfully infringing TransData's U.S. Patent Nos. 6,181,294; 6,462,713 and 6,903,699 (the \"Smart Meter Patents\") by making, using, selling, and/or offering for sale in the United States , or importing into the United States various digital electric meters equipped with an internal \"under-glass\" wireless communication circuit and antenna. \n   \nTransData's Smart Meter Patents relate to the Company's development of the first digital electric meter to be equipped with an internal \"under-glass\" wireless communication circuit and antenna. Current licensees of TransData's Smart Meter Patents include Sensus USA , Sensus Metering, Southern Company, Alabama Power, Georgia Power, Mississippi Power, Gulf Power, M2M Technologies and Telensa Ltd., among others. \n\nFive years ago, TransData instituted litigation over these same patents against several electric utilities, including Oncor Electric Delivery (an Energy Future Holdings Corp. company), CenterPoint Energy, Texas-New Mexico Power Co., Oklahoma Gas & Electric Company, San Diego Gas & Electric Company, CoServ Electric, Denton Municipal Electric, and Tri-County Electric Cooperative. These electric utility cases are currently ongoing and are proceeding toward trial. \n\nAs a result of the electric utility litigations, TransData's Smart Meter Patents have been subjected to 13 validity challenges at the U.S. Patent and Trademark Office, including four challenges filed by Itron and nine by General Electric. In each instance, the Patent Office reconfirmed the validity of all claims in TransData's Smart Meter Patents. \n\nAbout TransData \nIn business for 46 years, TransData is the only certified Women's Business Enterprise (WBE) specializing in the design and manufacture of solid-state electric meters and related products that enable its global client base to more efficiently measure, monitor and control the flow of power and energy variables on the smart grid. Founded in 1969, TransData is a privately-held corporation with headquarters in suburban Dallas , serving over 2,000 customers in more than 25 countries worldwide, including all of the top 50 largest U.S. electric utilities. More information on TransData can be found at www.transdatainc.com . TransData is a registered trademark of TransData Inc. \n\nFor additional information, please contact Mark Annick at 800-559-4534 or mark@androvett.com . \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/transdata-files-patent-infringement-lawsuits-against-smart-meter-manufacturers-general-electric-itron-landisgyr-300143844.html \n\nSOURCE  TransData Inc.", "source": "MoneyShow.com"}