{"published": "2015-09-22T05:28:26Z", "media-type": "News", "title": "Interview: High time the Karnataka Lokayukta is arrested", "id": "6d0baa45-749a-4aab-b86b-4322dbe37132", "content": "New Delhi, Sept 22: There appears to be no solution in sight where the fate of the Karnataka  Lokayukta is concerned. Justice Bhaskar Rao, the Lokayukta has been on leave for the past two months and there have been allegations that he has not deputed his work to anyone else. \n\nRead more:  Does Karnataka Lokayukta have moral right to probe corruption? \n\nThe Lokayukta's office is facing corruption charges and to add to it the son of Justice Rao has been accused of making extortion calls using his father's name. Former Lokayukta of Karnataka, Justice Santhosh Hegde says, \"enough is enough.\" \n\n\n\nIn this interview with OneIndia he says that the time has come to arrest the Lokyaukta for permitting his son to indulge in illegal activities. \n\nIs there any solution in sight? \n\nThe Lokayukta's office is in disarray and Justice Rao is on leave for the past two months. \nIt seems as though the people have gone quiet now. Yes the Lokayukta is on leave for the past two months and he has not deputed his work to anyone. Files are piling up and cases are pending. \n\nDo you think Justice Rao needs to be arrested? \nYes, he should be arrested. Section 109 of the Indian Penal Code states that whoever abets a crime must be punished. I feel this should be made applicable here. I want to ask if Section 109 is applicable only to the poor? \n\nHow has Justice Rao abeted the crime? \n\nCan he deny that he was not aware of what his son was doing? He allowed both his house and office to be misused. \n\nThe investigation shows that call of the alleged extortion were made from the home number of the Lokayukta. Moreover why is on leave for the past 2 months? He himself has admitted that he had been misled. \n\nThe Lokayukta is almost non-functional today. What are your views? \n\nHe cannot think that the Lokayukta is only him, it is an institution. For a person who has been a Chief Justice of a High Court he should have handled this better. \n\nIf you recall the High Court Bar Association had passed a resolution against his appointment as Lokayukta. \n\nWhat effect is the absence of the Lokayukta having on the institution? \n\nThe Lokayukta of Karantaka today is in disarray. Files are accumulating and the pendency of cases has shot up. Basically the Lokayukta himself is not present. He is on extended leave and it appears he has not delegated the work to anyone else. \n\nThis is leading to the pendency and files accumulating. Ideally the Upa-Lokayukta should have looked into these cases, but in the absence of any authorization cases are pending and work has come to a virtual standstill. I even get to hear that the administrative work has not been delegated. This is creating problems and also adding to the existing mess. It is a total breakdown and failure of the system. \n\nDo we need a Lokayukta at all? \nThe intention should be to cure the defect and the problem. Shutting down an institution due to corruption allegations against a few is not the solution. Think about all those people who depend on the Lokayukta. That appears to be the problem. None are acting in the right direction. \n\nAnother point I would like to make out here is that if there are rumours of corruption one needs to act immediately upon it by thoroughly investigating into the matter. Do not let issues prolong forever, it never does any good. \n\nOneIndia news", "source": "Oneindia"}