{"published": "2015-09-14T21:37:33Z", "media-type": "News", "title": "MLB RUMORS: NY Mets, Yoenis Cespedes Headed for Divorce in Free Agency? Contract Issues Likely to Arise", "id": "0301b656-5d17-475c-943c-2a2de015a6af", "content": "It will be no easy task for the New York Mets to retain Yoenis Cespedes, especially after his performance following the trade deadline. \n \nBy Thomas Carannante  t.carannante@hngn.com | Sep 14, 2015 05:37 PM EDT \n    \nYoenis Cespedes (Photo : Mike Ehrmann/) \n    \nThe unprecedented rise of Yoenis Cespedes is still taking place right before our eyes. As the New York Mets storm through the MLB and lead the Washington Nationals by 9.5 games in the NL East, rumors are beginning to focus on the outfielder's future with the team. \n\n \nCespedes, 29, is batting .308/.353/.680 with 35 runs scored, 16 home runs and 41 RBIs in 40 games with the Mets, which is incredible considering he was batting .293/.323/.506 with 62 runs scored, 18 home runs and 61 RBIs in his previous 102 games with the Detroit Tigers. \n\n \nCespedes signed a four-year, $36 million deal with the Oakland Athletics before the 2012 season, but it wasn't until this year that he was regarded as an elite outfielder. In case you don't recall, Cespedes batted just .269/.296/.423 with 27 runs scored, 5 home runs and 33 RBIs in 51 games with the Boston Red Sox after he was traded for Jon Lester last season. \n\n \nOn top of that, rumors suggested Cespedes \"marched to his own drum and the coaches all hate him,\" indicating he was a poor team player, and, perhaps at times, insubordinate. Well, much has changed over the past year. \n\n \n\"Besides Oakland, the teams most interested in Yoenis Cespedes when he came from Cuba were the Indians, White Sox, Phillies and Marlins,\" FOX Sports' Ken Rosenthal said in his MLB weekend update. \"Of course, that was almost four years ago, and the market now won't necessarily include those teams, but it does stand to reason that it will be considerably larger. Cespedes has proven that he can solidify a lineup like few players in the game. We saw Oakland miss him after he was gone last year, and we've seen how the Mets have benefitted from his presence.\" \n\n \nLast week we wrote the Los Angeles Angels could be a top destination for Cespedes , and a lot of that had to do with what was reported last week. \n\n \n\"Cespedes won't be an easy sign, as people who know him say 'he's a businessman' at heart, and he's not likely to take an offer that isn't the best one he gets,\" writes Jon Heyman of CBS Sports . \n\n \n\"Many others also wouldn't mind an outfield bat with impact power, not to mention an all-world arm, plus speed and unusual flair (a bonus), and he's probably raised his take by as much as 50 percent with his amazing stretch-run play, to the point where he looks like he's moved to the top of a star-studded free-agent outfield list that also includes Justin Upton, Jason Heyward and presumably Alex Gordon once he opts out. Even in this environment, Cespedes could fetch $175-million-plus.\" \n\n \nA $175-million-plus deal does not sound like the New York Mets, does it? New York's payroll exceeded $100 million this season for the first time since 2011 . Aside from David Wright's 14-year, $192 million deal, the next biggest contract on the Mets belongs to Curtis Granderson - a paltry four-year, $60 million deal (for a New York franchise). \n\n \n\"Yoenis Cespedes leaving Flushing after this season becomes evermore realistic,\" writes Jeff Passan of Yahoo! Sports . \"Do not see this as the tooting of the sad trombone so much as a reminder that Cespedes has played himself into the sort of monetary range from which the Mets have shied since double-barreling Carlos Beltran and Johan Santana. \n\n \n\"And unlike Beltran and Santana, who were long among the best at their position, Cespedes crystallized his place near the top of this monstrous free-agent class only in the past few months. Coming into this season, Cespedes, 29, was regarded as a good outfielder with monstrous power and enough flaws to keep him from ascending into that elite class.\" \n\n \nThere are a number of MLB clubs that could use Cespedes' all-around contribution. The Mets did adjust the clause in his contract that would have forced them to re-sign him within five days after the World Series, but they're going to need much more help than that.", "source": "Hngn.com"}