{"published": "2015-09-06T21:19:33Z", "media-type": "Blog", "title": "CAS(E) this Sketch #139", "id": "19753d78-b054-410c-8e96-0f0a6465eed1", "content": "I love the sketch over at the CAS(E) this Sketch blog its number 139 if you want to play along click here.\n I started off by applying my spider web stencil with some painters tape on a 4 by 5 1/4 white card stock matt.\n I am using a firm touch in the center and fading out near the edges. I used a light grey ink.\n I have a sentiment stamp that I previously cut apart.\n They easily line up right back together like they were originally intended to be used.\n Here I left this picture in because I stamped crocked so I restarted but not by cutting another mat I just flipped over my card stock.\nThe card stock I am using is a heavy weight white card stock.\n Added some tiny google eyes with some Tombow glue and a quick stick.\nThe spider is from a retired Stampin Up stamp set.\nI put the card mat on a base that matches my ink. Close up. Back of the card. Inside of the card. Some basic supplies I use I purchase from Hobby Lobby or Micheal’s with coupons or on sale Hobby Lobby brand is called The Paper Studio their website is http://www.hobbylobby.com/home.cfm Micheal’s brand is called Recollections their website is http://www.michaels.com/ Dollar Store site http://www.dollartree.com/home.jsp Target Store site http://www.target.com/ Find me on Face Book, click here https://www.facebook.com/Craftyjennifer Find me on Pinterest, click here http://www.pinterest.com/craftyjeffiners/ I am on Instagram too, craftjeffiner These ARE NOT affiliate links, no way involved with these company’s, I just love their products. These are links to their stores. My demo is Jenny Rast Find a Stampin UP demon here http://www.stampinup.com/home/en-US/ I used Smokey Slate ink and card stock I used a retired stamp set called Googly Ghouls To purchase My Favorite Things products click here http://mftstamps.com/ I used their 6X6 spider web stencil I used their Spider Web stamp set ", "source": "Cricut When I Can"}