{"published": "2015-09-09T20:31:45Z", "media-type": "News", "title": "Refugee crisis: why aren't the rich Gulf Arab states doing more?", "id": "d799898c-fbac-4294-8d30-dad07e1a1973", "content": "As the West grapples with the most serious refugee crisis since World War II, there is deepening concern over the failure of oil-rich Gulf Arab states to open their doors to asylum seekers. \n\nGermany opens door but questions remainAustralia will take 12,000 refugeesRefugee crisis: full coverage\n\nBeirut: As the West grapples with the most serious refugee crisis since World War II, where the majority of people making the desperate flight from their homes are Syrians, there is deepening concern over the failure of oil-rich Gulf Arab states to open their doors to asylum seekers.\n\nThe Gulf countries – Saudi Arabia, the United Arab Emirates, Qatar, Oman, Bahrain and Kuwait – have been among the world's largest donors to Syrian refugees, via United Nations agencies and private charities.\n\nWith a combined annual GDP of around $US2 trillion ($2.8 trillion) for a collective population of less than 55 million people, they can afford to be generous.\n\nBut the Gulf States have also stood out for their decision to pledge no – that is zero – resettlement places to Syrian refugees.\n\nGulf countries \"due to their geographical proximity, historical links with Syria and relative integration potential due to common language and religion, should make a significant contribution to the resettlement of Syrian refugees,\" Amnesty International argued.\n\nIt notes other high-income countries, such as Russia, Japan, Singapore and South Korea have also offered zero resettlement options.\n\nKuwait is by far the most generous donor, delivering nearly one-third of all aid pledged to the Syrian crisis through the UN, or $US800 million since 2012, while the UAE has given $US364 million, Jane Kinninmont, the senior research fellow at the Middle East and North Africa Program at Chatham House, wrote on Tuesday.\n\nThis is less than the $US1 billion from Britain or $US3 billion from the US, but considerably higher as a proportion of GDP, she notes.\n\n\"This is not a specific issue of hostility to Syrian refugees: the six Gulf monarchies have never signed the international conventions on refugee rights and statelessness,\" Ms Kinninmont writes.\n\nDespite this, Gulf States have taken in those fleeing war and persecution.\n\nAlthough they are never referred to as refugees, many Palestinians, Lebanese and Yemenis live in the Gulf after being displaced in conflicts in their own countries, notes Sultan Sooud al-Qassemi, a Gulf commentator and Media Labs Director's Fellow at Massachusetts Institute of Technology.\n\n\"There also exists a precedent for the Gulf States taking in refugees,\" he wrote in the International Business Times. \"A quarter of a century ago hundreds of thousands of Kuwaitis were given refuge in the Gulf after the invasion … by Saddam Hussein.\"\n\nKuwait has granted its 120,000 Syrian residents long-term residency permits, which means that they would not be asked to leave if their legal status expires, Mr al-Qassemi says.\n\nThe United Arab Emirates has done the same for 242,000 of its Syrian residents, but providing permits to skilled workers is a world away from offering a safe haven for refugees, Michael Stephens, a research fellow in Middle East studies at the Royal United Services Institute, told Fairfax Media.\n\nIt is true, he says, that Gulf States have contributed an enormous amount to support Syria's refugees in Lebanon, Jordan and Turkey.\n\nBut their belief that this is enough, when hundreds of thousands of Syrians are fleeing not just the war, but their miserable existence in refugee camps, is misguided, Mr Stephens says.\n\n\"Everybody is talking about yesterday's solutions … but being generous to refugees in 2012 does not excuse you from facing the fact that in 2015, today's solutions are about people as refugees wanting to come to your country.\n\n\"It seems nationalist identity of the Gulf Arab is stronger than a sense of moral duty to house refugees inside their border.\"\n\nUltimately, he says, the issue of Syrian refugees is not just a Gulf Arab issue, it is one for the Gulf, as well as Western countries, to work on together.\n\n\"Now is the time to stop the bickering, come together and find a solution.\"\n\nAnd while the bickering continues, the conflict in Syria and consequently, the refugee crisis, has escalated over the northern summer, says Maya Yahya, a senior associate at the Carnegie Middle East Centre.\n\n\"There are no safe havens, there is no place where people feel safe or feel they can secure any kind of future not for themselves and not for their children.\"\n\nIn the meantime, Gulf countries are trying to maintain political stability, \"and there is a concern that refugees will bring with them the instability their country is facing\".\n\nDr Yahya holds out little hope that the Gulf will soften its stance.\n\n\"Even with the heavy criticism that the Gulf is coming under, I don't see a change with the current environment.\"\n\nIn the meantime, Turkey, Lebanon, Jordan, Iraq and Egypt continue to bear the burden of the bulk of the four million Syrian refugees who have fled the civil war that has killed at least 250,000 and displaced another seven million.\n\nOf those, Turkey, Lebanon, and Jordan have shouldered most of the responsibility – in Lebanon, for example, a quarter of its population are Syrian refugees.\n\nDespite the closed-door policy of the Gulf States, it is impossible for the West to say countries with large Arab or Muslim populations are not doing their fair share.\n\nFollow FairfaxForeign on Twitter Follow FairfaxForeign on", "source": "Summit Sun"}