{"published": "2015-09-06T15:30:29Z", "media-type": "Blog", "title": "Hamilton wins at Monza despite FIA tyre investigation", "id": "41ee8c08-1f0d-4be0-b4f9-17669adc7980", "content": "Lewis Hamilton took his fortieth victory of his Formula 1 career at the Autodromo Nazionale Monza to extend his championship lead to 53 points as his Mercedes AMG PETRONAS team-mate and closest rival Nico Rosberg was forced to retire with two laps remaining due to an engine failure. \n \nHowever the race win was in doubt when the stewards announced they were investigation both Hamilton and Rosberg for having under-inflated tyres pre-race, with the race winner running 0.3psi below Pirelli ’s 19.5psi guidelines. \n \nHowever after the investigation, the stewards decided to take no action, and having controlled the race from the start, Hamilton was able to take home the twenty-five points on offer, winning the race by 25.042s from Scuderia Ferrari’ s Sebastian Vettel . \n \nVettel drove a relatively lonely race after jumping ahead of team-mate Kimi Raikkonen at the start as the Finn made a mess of his getaway, dropping from second on the grid to the rear of the field, but fought back superbly to take fifth at the chequered flag. \n \nCompleting the podium was former Ferrari driver Felipe Massa , who held off the late advances of Williams Martini Racing team-mate Valtteri Bottas , but both inherited their places when Rosberg’s engine expired while running third and catching Vettel. \n \nBehind Raikkonen in fifth was Sergio Perez of the Sahara Force India team, who consolidated his Spa-Francorchamps form from two weeks ago to claim sixth, just ahead of team-mate Nico Hulkenberg , while Daniel Ricciardo climbed from the back of the field to finish eighth for Infiniti Red Bull Racing . \n \nMarcus Ericsson secured his third points finish in as many races with a good drive in his Sauber to ninth, with the second Red Bull of Daniil Kvyat completing the top ten. \n \nThe Scuderia Toro Rosso ’s missed out on points after their engine chances, with Carlos Sainz Jr eleventh and Max Verstappen , including taking his drive-through penalty at the end of the opening lap, twelfth, while the second Sauber of Felipe Nasr was thirteenth after a pit stop on the opening lap to change his front wing. \n \nJenson Button was the sole McLaren-Honda to see the chequered flag in fourteenth having run inside the top ten in the opening couple of laps after a good start, but team-mate Fernando Alonso was a late casualty, retiring with three laps remaining with an electrical issue. \n \nThe two Manor F1 Team drivers both saw the chequered flag, with Will Stevens ahead of Roberto Merhi , while both Lotus F1 Team drivers were out by the end of the second lap with un-repairable damage to their E23 Hybrids. \n Monza Race Result     POS NO. DRIVER NAT TEAM TIME/LAPS      1 44 Lewis Hamilton GBR Mercedes 1hr18.00.688s    2 5 Sebastian Vettel GER Ferrari +25.042s    3 19 Felipe Massa BRZ Williams-Mercedes +47.635s    4 77 Valtteri Bottas FIN Williams-Mercedes +47.996s    5 7 Kimi Raikkonen FIN Ferrari +1m08.860s    6 11 Sergio Perez MEX Force India-Mercedes +1m12.783s    7 27 Nico Hulkenberg GER Force India-Mercedes +1 Lap    8 3 Daniel Ricciardo AUS Red Bull-Renault +1 Lap    9 9 Marcus Ericsson SWE Sauber-Ferrari +1 Lap    10 26 Daniil Kvyat RUS Red Bull-Renault +1 Lap    11 55 Carlos Sainz Jr ESP Toro Rosso-Renault +1 Lap    12 33 Max Verstappen NED Toro Rosso-Renault +1 Lap    13 12 Felipe Nasr BRZ Sauber-Ferrari +1 Lap    14 22 Jenson Button GBR McLaren-Honda +1 Lap    15 28 Will Stevens GBR Manor-Ferrari +2 Laps    16 98 Roberto Merhi ESP Manor-Ferrari +2 Laps    17/RET 6 Nico Rosberg GER Mercedes +3 Laps    18/RET 14 Fernando Alonso ESP McLaren-Honda +4 Laps    RET 8 Romain Grosjean FRA Lotus-Mercedes Retired    RET 13 Pastor Maldonado VEN Lotus-Mercedes Retired      \nView the original post at Hamilton wins at Monza despite FIA tyre investigation", "source": "The Checkered Flag"}