{"published": "2015-09-25T10:52:00Z", "media-type": "News", "title": "Elbit Imaging Announces Receipt of a Motion to Approve a Derivative Claim", "id": "90dbe555-a368-4ddf-8ffc-dd919451eb92", "content": "/PRNewswire/ -- \n\nElbit Imaging Ltd. ( \" EI \" or the \" Company \" ) (TASE, NASDAQ: EMITF ) announced today the filing of a Motion for approval of a derivative claim against the Company and its directors (the \"Motion\" and the \"Derivative claim,\" respectively) on behalf of the Company. The Motion was filed by Mr. Shlomi Kelsi, a director of the Company. \n   \nThe Claim alleges, among other things, a breach of fiduciary duty and duty of care by the Company's directors as a result of resolutions that were taken in recent Board meetings. The Claim further alleges, that such resolutions should be void or at least to be declared as voidable. The regard resolutions mainly concerning the approval of the board to convey a shareholders meeting of the Company to re-elect the Company's board members, as described in the Company's announcement dated September 3, 2015 , and the convening of extraordinary general meeting in Plaza Centers NV a subsidiary of the Company (\"Plaza\" ) to dismiss certain directors from their position as board members in Plaza, as described in the Company's announcement dated September 21, 2015 . \n\nThe Applicants also filed an interim injunction for temporary remedies to postpone the general meeting of the Company from discussing and voting on the size of the Company's board of directors and from re-electing of the Company's board of directors, and to instruct the Company to withdraw its request to convene a general meeting in Plaza or to instruct the Company to vote against any change in Plaza's board of directors in such general meeting. \n\nThe Applicants further requested a splitting of remedies and a reimbursement of expenses and legal fees. \n\nAt this preliminary stage, the Company is currently reviewing and evaluating the Motion and will submit its response accordingly. \n\nAbout Elbit Imaging Ltd.   \n\nElbit Imaging Ltd. operates in the following principal fields of business: (i) Commercial centers - initiation, construction, and sale of commercial centers and other mixed-use property projects, predominantly in the retail sector, located in Central and Eastern Europe and in India . In certain circumstances and depending on market conditions, the Group operates and manages commercial centers prior to their sale. (ii) Hotels - hotels operation and management. (iii) Medical industries and devices - (a) research and development, production and marketing of magnetic resonance imaging guided focused ultrasound treatment equipment, and (b) development of stem cell population expansion technologies and stem cell therapy products for transplantation and regenerative medicine. (iv) Residential projects - initiation, construction and sale of residential units or plots designated for residential located primarily in India . \n\nSafe Harbor Statement under the Private Securities Litigation Reform Act of 1995   \n\nAny forward-looking statements in our releases include statements regarding the intent, belief or current expectations of Elbit Imaging Ltd. and our management about our business, financial condition, results of operations, and its relationship with its employees and the condition of our properties. Words such as  \" believe, \" \"would,\"  \" expect, \"   \" intend, \"   \" estimate \" and similar expressions are intended to identify forward-looking statements but are not the exclusive means of identifying such statements. Actual results may differ materially from those projected, expressed or implied in the forward-looking statements as a result of various factors including, without limitation , the factors set forth in our filings with the Securities and Exchange Commission including, without limitation, Item 3.D of our annual report on Form 20-F for the fiscal year ended December 31 , 201 4 , under the caption  \" Risk Factors. \" Any forward-looking statements contained in our releases speak only as of the date of such release, and we caution existing and prospective investors not to place undue reliance on such statements. Such forward-looking statements do not purport to be predictions of future events or circumstances, and therefore, there can be no assurance that any forward-looking statement contained our releases will prove to be accurate. We undertake no obligation to update or revise any forward-looking statements.   \n\n\nFor Further Information: \nCompany Contact     \nRon Hadassi     \nChairman of the Board of Directors     \nTel: +972-3-608-6048 \nFax: +972-3-608-6050     \nron@elbitimaging.com \n\n\nSOURCE  Elbit Imaging Ltd.", "source": "CEOWorld Magazine"}