{"published": "2015-09-02T18:00:01Z", "media-type": "News", "title": "Brazil's president says Uber costs jobs, needs regulation", "id": "a264fecb-d5a8-4a1a-9b04-4340a5059ed9", "content": "1 p.m. CDT \n \nBy Lisandra Paraguassu and Anthony Boadle \n \nBRASILIA (Reuters) - Brazil's President Dilma Rousseff criticized ride-sharing software Uber on Wednesday for increasing unemployment, adding to a chorus of labor concerns about the world's most valuable venture-backed start-up. \n \nRousseff said local authorities must regulate the service, which has led conventional taxi drivers to stage protests and lobby lawmakers in Brazil's three biggest cities. \n \nSao Paulo, Rio de Janeiro and the capital Brasilia have all moved to ban the mobile application, which lets users hail Uber drivers for rides. None of the bans has yet taken effect, as mayors weigh whether to approve the laws. \n \nIn June, French President Francois Hollande said the low-cost UberPop service should be illegal, following violent protests by Parisian taxi drivers. Uber drivers in the United States won class action status on Tuesday for litigation demanding employee benefits. \n \n\"Uber is complicated because it takes jobs away from people... It leaves taxis with less work,\" Rousseff said in response to a reporter's question on Wednesday. \"It's not an easy issue. It depends on the rules of each city and state, because it is not a federal government decision,\" she said. \n \nThe San Francisco-based start-up declined to comment. \n \nIn Brasilia, lawmakers have voted to ban the unregulated services of Uber, but the federal district governor vetoed the ban and set up a commission to decide what is best for the city. \n \nIn Rio, the city council proposed a bill to prohibit unregulated taxi services in a move designed to ban Uber. \n \nMayor Eduardo Paes has not yet decided whether to sign it into law, but has said he would like to develop a rival technology for the city's taxi drivers. \n \nThe chilly reception for Uber contrasts with Rio's embrace of another icon of the so-called \"sharing economy.\" Home-rental marketplace Airbnb Inc is an official accommodation provider for the 2016 Olympic Games next year in Rio, which has a paucity of affordable hotel options. \n \nIn Brazil's largest city, Sao Paulo, a vote to ban the ride-sharing software is also awaiting a second vote from the city council and the signature of Mayor Fernando Haddad. \n \nUber has support from Brazil's antitrust watchdog Cade, where officials see the advantages that increased competition could bring to users and advocate a negotiated co-existence between the ride-share service and city taxis. \n \nTaxi drivers complain that Uber drivers are not properly regulated and have fewer overhead costs, giving them an unfair advantage. \n \n(Reporting by Lisandra Paraguassu and Anthony Boadle; Additional reporting by Brad Haynes and Luciana Bruno in Sao Paulo; Editing by Phil Berlowitz)", "source": "WTAQ News Talk"}