{"published": "2015-09-14T09:53:33Z", "media-type": "News", "title": "Liberal Party rips itself apart", "id": "5cf349da-0ccf-4000-9751-c5e58faaa704", "content": "The crisis could spell the end of Joe Hockey as Treasurer with Social Services Minister Scott Morrison favoured to slip into the role if Mr Turnbull wins. \n\nThis is despite Mr Morrison deciding to back Mr Abbott, as did Finance Minister Mathias Cormann and Immigration Minister Peter Dutton. \n\nMr Turnbull's supporters told The Australian Financial Review that he comfortably had the numbers to defeat Mr Abbott but both men were hitting the phones hard Monday while a cavalcade of senior ministers who backed Mr Abbott called press conferences and made live television appearances to protect the Prime Minister. \nAbbott defiant \nA defiant Mr Abbott told reporters on Monday evening he would fight. \n\n\"This country needs strong and stable government and that means avoiding, at all costs, Labor's revolving-door Prime Ministership,\" he said. \n\n\"We have laid the foundation for a better deal for families and for small business. You can trust me to deliver a stronger economy and a safer community. \n\n\"The Prime Ministership of this country is not a prize or a plaything to be demanded. It should be something which is earned by a vote of the Australian people.\" \n\nHe demanded the destabilisation stop. \n\n\"I firmly believe that our party is better than this, that our Government is better than this and, by God, that our country is so much better than this.\" \n\nIn a brutal critique of Mr Abbott, Mr Turnbull declared he needed to move because Mr Abbott was incapable \"of providing the economic leadership we need\" or \"the economic confidence that business needs\". \n\n\"The big economic changes that we're living through here and around the world offer enormous challenges and enormous opportunities,\" he said. \n\n\"We need a style of leadership that explains those challenges and opportunities, explains the challenges and how to seize the opportunities. \n\n\"A style of leadership that respects the people's intelligence, that explains these complex issues and then sets out the course of action we believe we should take and makes a case for it. We need advocacy, not slogans.\" \nTurnbull brutal \nMr Turnbull also attacked Mr Abbott's style of government, including his notorious \"captain's picks\" and the cabinet process. \n\n\"We have to remember that we have a great example of good Cabinet government. John Howard's government most of us served in and yet few would say that the Cabinet government of Mr Abbott bears any similarity to the style of Mr Howard,\" he said. \n\nMr Turnbull said it was his duty to protect Australia from Labor leader Bill Shorten becoming Prime Minister  \n\n\"We have lost 30 Newspolls in a row,\" he said. \n\n\"If we continue with Mr Abbott as Prime Minister, it is clear enough what will happen. He will cease to be Prime Minister and he'll be succeeded by Mr Shorten\".  \n\nMr Turnbull would not make changes to climate policy nor bring forward a vote on same sex marriage. \n\nIn a sign of the rancour to come, a bitter Mr Hockey also pledged support for Mr Abbott, refused to stand down and slammed Mr Turnbull's critique that the government in its current form could not provide economic leadership. \n\n\"(Mr Turnbull) has never said to me or to the Cabinet that we are heading in the wrong economic direction. The disloyalty of some has been outrageous.\" \n\n\"We must put the national interest ahead of any self-interest. The Prime Minister has my absolute loyalty as I have his.\" \n\nLabor has feared a transition to Mr Turnbull who is vastly more popular than Mr Abbott, especially among Labor voters. \n\nMr Shorten said a switch to Mr Turnbull \"changes nothing\" because Mr Turnbull had been part of a dysfunctional government. \n\n \"Australia has been going nowhere for the last two years,\" he said.  \n\n\"Australia does not need another out of touch, arrogant Liberal leader.\" \nSudden move \nAfter days of intense speculation that another challenge was coming, Ms Bishop visited Mr Abbott at noon on Monday to tell him he had lost the support of the backbench and the cabinet. She told him he should stand aside. \n\nSources said the meeting was very brief and Mr Abbott \"wasn't happy to say the least\". \n\nWhen Question Time finished at 3.10pm, Mr Turnbull followed the Prime Minister back to his office and, during a 20-minute meeting, told Mr Abbott that unless he stood aside, there would challenge. Mr Turnbull resigned from the frontbench and more of his supporters were threatening to do the same unless Mr Abbott stepped aside.  \n\nMr Turnbull was rolled by Mr Abbott as Opposition leader on December 1, 2009. \n\nMr Abbott is the fourth longest serving Liberal leader following Robert Menzies, John Howard and Malcolm Fraser. \n\nBut but if Mr Abbott loses to Mr Turnbull, he would have served as Prime Minister for just two years, less than both Julia Gillard and Kevin Rudd, both of whom he vanquished. \n\nA transition to Mr Turnbull would not guarantee peace. Ministers such as Senator Abetz, Mr Hockey, Mr Dutton and Mr Andrews would be most likely to be dumped and Mr Abbott would go to the backbench.  \n\nNationals leader Warren Truss threatened to tear up the Coalition agreement and negotiate a new one of Mr Turnbull because leader. \n\nFormer Victorian Liberal Premier Jeff Kennett savaged Mr Turnbull.", "source": "Australian Financial Review"}