{"published": "2015-09-24T12:37:58Z", "media-type": "News", "title": "Super Blood Moon To Give Sky Gazers A Rare Treat This Sunday: Here’s When And Where You Can Watch It", "id": "f68945ff-9e61-413f-bd82-977f84add13b", "content": "Sky gazers can look forward to a rare treat this coming Sunday when a super blood moon will grace the skies for the first time in 30 years. The unusual occurrence, which sees the sun, earth and moon come together for a lunar eclipse, will be doubly special as it coincides with a supermoon, a phenomenon when the moon’s mostly elliptical orbit brings it closest to Earth’s surface. \n \nAccording to Phys.org , the celestial show will be visible from the Americas, Europe, Africa, west Asia and the east Pacific, and sky gazers can witness the blood-soaked supermoon for just over an hour from 0211 GMT. \n \nIn the weeks leading up to the spectacular event, meteorologists, astronomers, bloggers, as well as amateur star gazers, have all dubbed the extra-large moon as a ‘blood moon’, primarily because of the reddish tint the moon gets from an eclipse. Though Sunday’s lunar eclipse will be the fourth in a tetrad, with three lunar eclipses have already taken place in the last two years, the unusual size and the color of the moon on Sunday is keeping astronomers juiced up for the event. \n \nSam Lindsay of the Royal Astronomical Society was one of the people to have expressed his excitement at the prospect of the approaching blood supermoon. \n \n“It will be quite exciting and especially dramatic. It’ll be brighter than usual, bigger than usual.” \n \nWired reports that the moon on Sunday evening will appear about 14 percent larger and 30 percent brighter than Earthlings are used to seeing it. Our planet will take position in a straight line between the moon and the sun, in the process blotting out the direct sunlight that usually makes our satellite glow whitish-yellow. But on Sunday, some light will still creep around Earth’s edges and be filtered through its atmosphere, casting a strange red light, thus creating the ‘blood moon’. \n \nOn Sept. 27, stargazers will be seeing red: http://t.co/gPtOdeHOPe  #Supermoon  #LunarEclipse  pic.twitter.com/aiAbfmQq4i \n \n— Notre Dame News (@nd_news) September 23, 2015 \n \nFor people who are not yet 33 years of age, this will be their first chance to witness a blood supermoon, and the rare occurrence will not take place again until 2033, according to CNN. \n \nHowever, much of what will be witnessed will depend on the weather, and consequently where the event is being viewed from. For people in the United States, residents in large parts of the Northeast and East Coast of the country may have to be disappointed, with Accuweather (via Mass Live ) predicting cloudy skies on Sunday evening. \n \nBut residents and sky gazers will do well to anticipate the blood moon in any case, especially if the weather is clear. For those of you who might not be in the best place to view the blood moon in its full splendor, NASA’s Marshal Space Flight Center plans live coverage and commentary of the eclipse on its UStream channel, which can be viewed by clicking here . The Slooh Community Observatory network will also be livestreaming views of the blood supermoon from different continents, including a spectacular broadcast from Stonehenge, starting at 8 pm EST. \n  \n[Photo by Phil Walter / ] is an article from: The Inquisitr News", "source": "Inquisitr"}