{"published": "2015-09-15T20:16:49Z", "media-type": "News", "title": "Legco duo in no-show - as witnesses for case", "id": "1a168db9-597b-4288-97f1-b2763119cc43", "content": "Legislative Council president Jasper Tsang Yok-sing and House Committee chairman Andrew Leung Kwan-yuen failed to appear at Eastern Court yesterday, in response to summonses to act as witnesses in the case of 12 activists who pleaded not guilty to storming the Legco complex in June last year.\n\nLo & Lo, a law firm representing the Legco Commission, issued a letter saying both Tsang and Leung were busy at work and would like to cancel the summonses.\n\nThe lawyers suggested a few candidates to replace the pair.\n\nLegco's representative lawyer Wong Sze-wing told magistrate Jason Wan Siu-ming that the reason for calling police was clearly explained in the press release issued by Legco the day after the June 13 protest.\n\n She said the prosecution planned to summon Legco's assistant secretary general Matthew Loo Sze-yuen to testify, saying she believed Lo's testimony would be more straightforward.\n\nThirteen protesters faced the dock for the incident during the protest outside the Legco complex, when the controversial northeast New Territories development was being debated.\n\nThe 12 activists, aged between 21 and 40, include students from Lingnan University, City University, League of Social Democrats member Yim Man-wah, and People's Liberation Army barracks trespasser Billy Chiu Hin- chung.\n\nAnother activist, Wong Kan- yuen, 24, pleaded guilty to one count of unlawful assembly and one of attempted forcible entry.\n\nLast week, Wong was jailed for three weeks after being convicted of another charge of violating Legco's administrative instructions, but has been released on bail pending appeal.\n\nThe court heard the 13 defendants tried to force open the glass door on the ground floor of Legco complex, causing damage amounting to more than HK$421,000.\n\nLeung Hiu-yeung, 21, and Raphael Wong Ho-ming, 26, also denied obstructing a Legco officer who fractured his left toe.\n\nThe trial continues today for the 12. \n\nJANE CHEUNG and JASMINE SIU", "source": "Hong Kong Standard"}