{"published": "2015-09-06T07:51:00Z", "media-type": "News", "title": "Make a Style Statement While Correcting Your Vision with New GlassShop.com Eyeglasses", "id": "2ffa6a3c-247f-497a-bb6a-211a025aa497", "content": "FARMINGTON HILLS, Mich. , Sept. 6, 2015 /PRNewswire/ -- GlassShop.com is proud to announce the arrival of new prescription  glasses that not only allow wearers to enjoy  a  clear vision, but also make  people feel good when  wearing them . \n \n\"While our site offers hundreds of uniquely designed frames, we strive hard to update our collection, so that our customers have access to affordable yet stylish products,\" says Ivy Wood , Senior Manager GlassesShop.com. \n \nThe new frames are a perfect blend of style and functionality. However, what really makes them special is the ability to cater to vision correction needs of the customers. \n \nIt has become the norm to check out and buy glasses online . Yet this also leaves customers uncertain about the quality of the frames. With GlassesShop.com, customers never have to worry about quality, as the site is renowned for offering  high quality glasses.  \n \nCustomer testimonials about GlassesShop.com reveal the site truly believes in making it easy for customers. Local opticians are expensive when it comes to glasses and when customers need vision correction through prescription glasses , they have no other choice  but to pay exorbitant prices. With GlassesShop.com and its new arrival of discount glasses , customers have a choice to buy functional and affordable glasses . \n \nThe new  arrivals at GlassesShop.com are fascinating, stylish and affordable. They come in a range of styles, colors and materials. Customers also can pick and choose the price range they can afford. \n \n\"We are inviting customers who need vision correction to come and check our new collection of glasses. We  have faith that  they will love our quality, style and colors. Once they buy glasses from us, they will realize we never compromise on quality and  stick to keeping the prices affordable,\" said Ms. Wood. \n \nAbout GlassesShop.com \n \nEstablished in 2004, GlassesShop.com is a Michigan -based online store for prescription eyeglasses . Since its launch, the online store has sold over a million  glasses for varied vision correction purposes. This online retailer takes pride in offering top quality glasses , commonly-prescribed prescription lenses and sunglasses. \n \nYou can find out more about the comprehensive range of products sold at GlassesShop.com by clicking http://www.glassesshop.com . \n \nSOURCE  GlassShop.com \n \nRELATED LINKS \nhttp://www.glassesshop.com", "source": "PR Newswire"}