{"published": "2015-09-03T17:03:28Z", "media-type": "News", "title": "A Post-Kojima Metal Gear", "id": "92262502-02b3-4fb8-9656-c7aef74370b4", "content": "By Reid McCarter \n \nSeptember 1 st will see the release of the final Metal Gear game directed by Kojima Productions’ Hideo Kojima. Barring an incredible surprise, the creator of the long-running stealth/action series will be moving on to new projects, completely divorced from the universe he’s lead development on for close to 30 years. \n \nThis isn’t the first time Kojima has announced plans to abandon Metal Gear . As far back as the launch of 2001’s Metal Gear Solid 2: Sons of Liberty , the designer has told press he wants to leave the series behind. Four sequels later, it finally seems Kojima is truly moving on. Unfortunately, his departure doesn’t seem to be on great terms, publisher Konami having stripped Kojima’s name from Metal Gear Solid V:  The Phantom Pain ’s cover art (and, even more bizarrely, forthcoming reprints of some of the previous games). While Konami has released confusing information claiming Kojima will still be involved in future Metal Gear titles, rumours suggest he’s already split from the publisher. \n \nCombined with Konami’s apparent pivot toward non-console videogame development following corporate restructuring earlier this year, the future of Metal Gear seems pretty dire. Even if the publisher does appoint a new development team to create another entry following The Phantom Pain ’s release, the question remains: would Metal Gear even work without its creator? \n \nThere are very few videogame series that are tied so directly to their creative leads, but Metal Gear has always been one of them. From the first Metal Gear I played— Solid , back on the PlayStation One—it was impossible to separate the experience playing out onscreen with the developer responsible for its creation. This is made explicit at several points. A fourth wall-breaking fight against psychic villain Psycho Mantis pauses the action to display a fake TV input screen with HIDEO in place of the usual VIDEO in Metal Gear Solid.  Metal Gear Solid V: Ground Zeroes goes so far as to allow the player to rescue a digitally recreated Kojima from an interrogation camp. But, more than these outright winks, the tone of the series is the direct result of its writer/director’s development sensibilities. \n \nMetal Gear has garnered both admiration and criticism for its trademark design choices. There’s the long-winded character dialogue that finds ways to cover everything from world history and cultural theory to cinema and junior high-level jokes. There’s the exhaustive attention to detail that sees Solid Snake popping cold medicine to treat a cold or sneak through a swamp by wearing a costume alligator’s head. And, crucially, there’s the tightrope walk between serious war drama and slapstick cartoon that every game manages to navigate without veering too far in either direction. \n \nTrying to imitate all of this without Kojima’s input seems like a tricky feat. It also makes it hard to imagine that a Metal Gear developed without its original creator’s involvement would feel like a real continuation of the series. This obviously overlooks the fact that Hideo Kojima is not the sole creative force behind the series. Kojima Productions is made up of more than a single person—some of whom have been around since the earliest titles. But, given that the same rumours regarding Kojima’s split from Konami state that many other senior members of the team are also set to depart, there aren’t likely to be many left from the core Metal Gear team to assume creative leadership. \n \nThe dramatic, public manner by which Kojima Productions seems to have dissolved—and, more importantly, information regarding the poor working conditions development teams at Konami’s Japanese offices face—mean that many may not be interested in purchasing another Metal Gear regardless of its direction. Still, the larger question is whether or not a game made with new creative talent would even feel like a natural extension of the previous titles. \n \nToo often, videogames are thought of as products and not the result of real people creating work that results from their own unique personalities and artistic sensibilities. Though publishers may own the rights to series like Metal Gear , there’s no way to own the process that goes into their development. Without Hideo Kojima and the team at Kojima Productions, Konami won’t be able to replicate what’s made the games they own so popular in the first place. A new studio may be able to create something new—possibly something just as good as what came before—but without the involvement of an original work’s creators, it can’t ever be the same. \n \n\n \nThis post is by www.cgmagonline.com read the original post: A Post-Kojima Metal Gear", "source": "Comics & Gaming Magazine"}