{"published": "2015-09-10T18:09:06Z", "media-type": "Blog", "title": "GTA V adding 'entirely new way to play' for Xbox One, PS4 and PC", "id": "f6f0fdb7-a976-4b3c-948a-013c5dae4bbd", "content": "GTA V adding 'entirely new way to play' for Xbox One, PS4 and PC Get the scoop on GTA Online's new emergent Freemode Events Update, which also comes with the Rockstar Editor. by GameSpot Staff @gamespot September 9, 2015 11:00 PM PDT Updated: September 10, 2015 11:09 AM PDT Grand Theft Auto V may be nearly two years old, but it's continuing to get new updates. Rockstar Games has announced that the game's multiplayer mode, GTA Online, will soon add Freemode Events. The studio describes this as an \"entirely new way to play.\"\nFreemode Events are challenges in GTA Online that you can hop directly into without seeing a loading screen, menu, or lobby. Watch the video below to see how they work. These events take \"full advantage\" of Xbox One, PlayStation 4 and PC hardware. As such, it doesn't sound like they will be available on Xbox 360 and PlayStation 3. We have followed up with Rockstar to find out for sure.\nFreemode Events can start \"at any given moment,\" but they won't necessarily be entirely random. Players can customize their session to determine which events occur in their game session. \"So you can play as much or as little of this new content as you like,\" Rockstar explained.\nRockstar says there will be \"countless variations\" of each Freemode Event, each of which will offer rewards such as GTA$ and RP.\nBelow are the GTA Online Freemode Events announced so far, with descriptions courtesy of Rockstar. King of the Castle -- An every-man-for-himself turf war where you'll need to ascend and claim the designated 'castle' as your territory, and then fend off everyone else as they go all out to dethrone you.Hunt the Beast -- Where one volunteer is temporarily transformed into a faster, stronger, beastly character who must escape relentless pursuers.\nThese events will also come in the form of \"insane stunt challenges,\" including things like popping a wheelie for the longest time or catching the most air with a car.\nThe GTA Online Freemode Events update arrives on September 15. It also comes with two new Adversary Modes, descriptions for which you can see below.Hunting Pack -- You're part of a team tasked to deliver a priority vehicle rigged to explode if it drops below a minimum speed, while your opponents race, ram and batter to take it down.Cross the Line -- Heavily armed squads face off across a neutral zone with the goal of having all team members strategically penetrate their opponents territory to claim victory.\nLastly, GTA Online's September 15 update also brings the Rockstar Editor to Xbox and PS4; this video-editing tool suite was already available on PC. Although Rockstar has continually updated GTA Online with new content, fans are still waiting to hear about the game's promised story DLC. Tags: Gaming Previous Story See Destiny: Taken King's PlayStation-exclusive content in action Next Story Human, raven and thylacine skulls join Fire & Bone About the author GameSpot Staff CNET's sister site GameSpot is the world's leading site for video game news, reviews, features, and more. Visit us at www.gamespot.com. See full bio Comments More From CNET", "source": "CNET News"}