{"published": "2015-09-24T18:27:16Z", "media-type": "Blog", "title": "LSU seeking to oust operator of Shreveport, Monroe hospitals", "id": "f55d02ff-7db5-4413-a10e-007410cc6ed2", "content": "BATON ROUGE — LSU is seeking to end its deal with the private manager of its Shreveport and Monroe hospitals, two years after hospital operations were turned over to a research foundation as part of Gov. Bobby Jindal's effort to privatize the state's charity hospital system. The university system sent formal notice Thursday to the Biomedical Research Foundation of Northwest Louisiana, or BRF, that it considers the hospital manager in breach of its contract. It gave the foundation until Oct. 5 to withdraw as hospital operator. \"We have exhausted all avenues to resolve our differences amicably and now must take action that we hoped would not be necessary,\" LSU System President F. King Alexander said in a statement. In a July letter to the research foundation, Alexander said BRF had not established a sustainable financial model for the hospitals, had damaged the LSU Shreveport medical school's reputation and threatened the stability of both the medical school and the hospitals. Foundation leaders deny any mismanagement and say they have followed the contract's terms. They've said LSU has thwarted efforts to ease the transition and remedy concerns. The foundation didn't immediately respond Thursday to the breach of contract letter. It wasn't clear who would operate the hospitals if BRF agrees to remove its management. The university system said a group of \"civic leaders\" will help manage the hospital until LSU finds a new operator to replace the foundation, but didn't name any of the people involved. Alexander said the hospitals will continue normal operations during the transition. BRF took control of the two north Louisiana hospitals in October 2013 through a no-bid contract, part of Jindal's push to privatize most of the university-run public hospital system that cares for the uninsured and provides much of the state's medical student training. Privatization of the hospitals in Shreveport and Monroe was in contrast to the approach the Jindal administration took in south Louisiana, where LSU's facilities are being overseen by companies that run other private hospitals in the area. Created in 1986 to boost regional economic development, BRF had more limited resources and no background in hospital management. It had never previously run a patient care facility. Problems and disagreements developed between LSU and the research foundation nearly from the start. \"We want to secure operational and financial stability through a viable partnership, so we can continue to ensure both high quality health care and medical education,\" Alexander said Thursday.", "source": "Louisiana Politics & Government"}