{"published": "2015-09-24T01:26:00Z", "media-type": "Blog", "title": "3-Day Refresh - Day 1", "id": "871d6d59-ef51-4333-b343-e38bec27041a", "content": "3-Day Refresh - Day 1 Posted by : Jameson Durall Wednesday, September 23, 2015 Follow @JamesonDurall\nThe last couple of weeks have been pretty rough with travel, lack of sleep and excessive beer enjoyment.  So, now that I'm back home and things are back to normal...I decided to give the 3-Day Refresh a try.  I'm hoping it will kick-start me back to my normal healthy lifestyle.  I'm going to document the process here and share my results at the end!\nDay 1 Upon Waking - 10 ounces of water\nThis is something I've been doing recently in order to get my 100+ ounces in easier.\nBreakfast - Shakeology\nI normally use 2% milk or Almond milk...but the plan requires water.  Luckily I was allowed to mix in a serving of fruit, so I used some mixed frozen strawberries and mango.  The plan also suggests using the Vegan Shakeology version, so I went with Tropical Strawberry and it ended up tasting pretty good in the end.\nMid-Morning - Fiber Sweep\nThis packed mixed in with 8 ounces of water and looked totally gross when I poured it in...I was not optimistic.  But, it actually tasted refreshing and went down very easy.\nLunch - Vanilla Fresh\nI'm really missing the flavor and thickness that milk gives the shakes at this point, but the Vanilla Fresh actually tastes decent with water.  I didn't have a blender at work to mix in my serving of fruit, so I had half of a banana with it.\nI then chose a vegetable and healthy fat from the list and was happy that carrots and hummus were an option since I eat that regularly.  I'm not at all hungry at this point and actually feel kinda stuffed.  My snack is at least one hour from lunch, but I may try to extend out a bit further since I'm not hungry.\nAfternoon Snack\nMeetings forced a 3 hour gap before this snack and I was pretty hungry by the time I got to it.  Carrots and hummus again and it hit the spot.\nDinner - Vanilla Fresh\nI had about a 5 hour time gap before dinner, so I was pretty hungry...luckily I got to add a vegetable based dinner in.  I chose the green bean recipe from the booklet, but was pretty bummed to see that I was only allowed 12 beans.  Really?  I would have thought there would be a number based on weight.  But, apparently the 100 lb person gets the same amount as the 300 lb person. Conclusion\nAll in all, I'd say day one was a big success.  I was rarely hungry and the shakes were actually pretty good.  I drank a ton of water that wasn't listed above.  Time to see how I sleep tonight :)\nYou should follow me on Twitter and Facebook. You can also subscribe via RSS or email.  Please support the blog by doing your Amazon.com purchases through this link. See other Fitness posts Share This Post a Comment PREV HOME", "source": "Fatherhood, Video Games, and Ice Cream"}