{"published": "2015-09-15T09:47:52Z", "media-type": "News", "title": "South Australian MPs confident of local submarine build under a Turnbull government", "id": "b6c844d8-9aad-41bf-a28a-253f7d7c5140", "content": "A greater share of a $50 billion submarine-building program will likely be done in Australia under a Malcolm Turnbull-led government in a major strategic and industrial shift, according to buoyant South Australian MPs. A greater share of a $50 billion submarine-building program will likely be done in Australia under a Malcolm Turnbull-led government in a major strategic and industrial shift, according to buoyant South Australian MPs. Liberal MPs who were facing electoral wipe-out under Tony Abbott in part because of the broken promise to build 12 submarines in Adelaide say they are confident Mr Turnbull is more inclined than his predecessor to build the next generation of boats locally.\n\n\"In the conversations I've had with him, Malcolm was more receptive to building as much as possible locally than the current PM,\" one South Australian Liberal said on Tuesday morning before Mr Turnbull was sworn in.\n\nSouth Australian senator Sean Edwards, who extracted the pledge from Tony Abbott for a \"competitive evaluation process\" for the submarine program during the last leadership crisis in February, also expressed confidence.\n\n\"From the conversations I've had overnight, there will be more work locally and a big focus on smart industries and advanced manufacturing,\" said Senator Edwards, while stressing he had not spoken personally with Mr Turnbull.\n\n\"I've never been more confident about the process than I am today … I'd welcome Christopher Pyne because the role of defence minister is an extremely important one and Christopher has a good track record as an effective operator.\"\n\nThe Department of Defence is undertaking a \"competitive evaluation process\" to assess bids by Japan, Germany and France to build the new fleet of subs.\n\nMr Abbott was widely regarded as having favoured a partnership with Japan, which initially meant much of the building work would likely be done in that country.\n\nHowever he announced the competitive evaluation process amid fears of a major electoral backlash in South Australia because the government had made a pre-election promise to build 12 submarines in Adelaide.\n\nA shift towards doing more building work locally should be manageable because Defence has asked the three bidding countries to prepare a range of options: building locally, building overseas, or a \"hybrid\" build partly onshore and partly offshore.\n\nReports emerged on Monday night that Education Minister Christopher Pyne, the most senior South Australian Liberal, would shift to the defence portfolio, all but guaranteeing a boost to local building work on the new fleet.\n\nHowever government sources cast doubt on those reports and suggested Abbott-backer Kevin Andrews may remain in the portfolio.\n\nMr Andrews said on Tuesday he wanted to remain in the job given the major challenges still facing Defence.\n\n\"We're about to bring out a White Paper, we're in the midst of the submarine evaluation, we're in the midst of replacing the navy almost completely over the next decade or so. It takes a long time to get on top of the complexity of Defence and I would be happy to continue in this role,\" Mr Andrews told the ABC.\n\n\"I don't think it's good for the security and safety of this country and for the wellbeing of our defence forces to keep changing defence ministers.\"\n\nOne perceived driver of Mr Abbott's inclination towards Japan was to build a closer strategic relationship with that country – a move that is supported by Washington.\n\nSince then, however, Japan has largely matched Germany and France in saying it was prepared to do much of the building work in Australia. One South Australian MP said he had been \"pleasantly surprised\" by recent conversations with Japanese representatives.\n\nFollow us on Twitter The story first appeared on The Sydney Morning Herald.", "source": "Wauchope Gazette"}