{"published": "2015-09-16T14:01:00Z", "media-type": "News", "title": "Matildas star becomes latest City coup", "id": "51cc6ab3-0929-496a-9036-9c982df5da62", "content": "ShareShare on FacebookShare on TwitterShare on Google+Share on RedditEmail a friend\n\nFROM the World Cup, to the cover of the FIFA 16 video game to Melbourne City.\n\nIt’s been a hectic few months for Matildas star Steph Catley.\n\nThe Victorian defender on Wednesday became the latest player to defect from Melbourne Victory to new W-League entity City for the upcoming season, following in the footsteps of striker Lisa De Vanna, goalkeeper Brianna Davey, midfielder Beattie Goad and coach Joe Montemurro.\n\nMelbourne City’s men’s team also moved a step closer to completing their squad list ahead of the round one clash away to Sydney FC on October 10, signing former Western Sydney midfielder Jason Trifiro for the 2015-16 season.\n\nThe high-profile women’s switches ensure that the first W-League derby at AAMI Park on October 25 will be a heated affair, although the prospect of Matildas matches being played around the same time appears likely to rob the game of some of its starpower.\n\nCatley said, after being approached by Montemurro, she spent months mulling over the decision to move.\n\n“It was a massive decision for me because I’d been at Victory for seven years,” Catley said.\n\n“But I think for me as a player I’m at the stage in my career where I really need to use this year as a development year to grow my game.\n\n“And for me to do that I needed to challenge myself and get myself out of my comfort zone.”\n\nThe 21-year-old arrived back in Melbourne on Monday from a stint with American side Portland Thorns and on Wednesday trained at City headquarters after putting pen to paper on a one-year deal.\n\nCity, who are away to Sydney in their W-League debut on October 18, will be one of the title favourites even in year one, particularly given the prospect of an influx of international stars still looms large.\n\n“I think it’s always hard for a new team coming in to a league and I think it’s hard to find consistency right away,” she said.\n\n“But we’ve already got such a good base of players who are willing to work hard ... and everyone’s hungry.”", "source": "NEWS.com.au"}