{"published": "2015-09-03T14:18:29Z", "media-type": "News", "title": "Record level of drug poisoning deaths 'paints a stark picture'", "id": "a8b26e39-0a5e-4c86-bf66-c4dfdcacf485", "content": "Record numbers of people are dying from drug poisoning, new figures reveal. \n \nThere was also a sharp jump in fatalities involving cocaine last year, while the number of deaths linked to anti-depressants was at its highest level for 15 years. \n \nData published by the Office for National Statistics (ONS) show there were  3,346 drug poisoning deaths registered in England and Wales in 2014, the highest  since comparable records began in 1993. Two in three involved illegal drugs. \n \nThe mortality rate from drug misuse was the highest ever recorded, at 39.9 deaths per million population.  Statisticians said the increase in mortality rate for all drug-related deaths for both men and women is likely to be related to the availability and consumption of heroin and morphine. \n \nCampaigners described the figures as \"tragic\", while public health officials said they showed an increase in availability and purity of heroin around the world is taking effect here. \n \nThe figures cover accidents and suicides involving drug poisonings, as well as deaths from drug abuse and dependence. \n \nThey indicate that drug-related fatalities are now concentrated among the middle aged.   For the first time the highest mortality rate from drug misuse is for people aged between 40 and 49. \n   Promoted stories   \nThe ONS report said the pattern is broadly in line with figures showing people receiving treatment for drug misuse are getting older. \n \nDeaths involving cocaine increased to 247 from 169 the previous year, an increase of almost 50%, with research suggesting an increase in purity has been a factor in the trend. \n \nThere were 517 deaths involving anti-depressants in 2014, the highest number since 1999. \n \nDeaths involving heroin and/or morphine increased by almost two-thirds between 2012 and 2014, from 579 to 952, with increases seen across all age groups except people aged 70 and over between 2013 and 2014. \n \nThe ONS highlighted evidence that suggests an increase in purity and volume of the substance following a \"heroin drought\" in 2010/11, while also citing cost as a possible factor. \n \n\"Prices  of heroin have also changed over this period - the purity-adjusted price of heroin per gram in the  United Kingdom has fallen from £74.32 in 2011 to £49.55 in 2013,\" the report said. \" This means people can now take stronger heroin for the same price.\" \n \nThere were 67 deaths involving new psychoactive drugs (NPS) - sometimes referred to as \"legal highs\" - and a record 258 linked to diazepam, which is used to treat anxiety. \n \nFifty fatalities involved ecstasy, following reports raising concerns about \"super strength\" versions of the party drug. \n \nThe drug misuse mortality rate increased in England but fell in Wales. Regionally, it was highest in the North East, and lowest in London. \n \nSimon Antrobus, chief executive of substance misuse charity Addaction, said: \" These tragic figures paint a stark picture of the shifting landscape of drug misuse in England and Wales. \n \n\"Drug treatment services across the country have seen an increase in the number of people seeking help for opiates and/or crack cocaine and this is only likely to increase further as the effect of increased opiate availability and purity is felt.\" \n \nRosanna O'Connor, of Public Health England, said the rise in deaths caused by heroin use is a \"great concern\". \n   \n Share article  \n   \nShe added: \" The increased global availability and purity of heroin is clearly having an impact in England.\" \n \nThe Department of Health said that, although there are less users of heroin, any death related to drugs is a \"tragedy\".", "source": "Ealing Times"}