{"published": "2015-09-12T18:30:00Z", "media-type": "News", "title": "ABVP win all 4 Dusu posts for second year", "id": "6fcc5ac2-5bd5-4d79-b2e6-0a4e4d6a1dc8", "content": "ABVP panel candidates celebrate their victory in the Delhi University Students Union elections (Photo: PTI) \n \nThe right-wing students’ organisation Akhil Bharatiya Vidyarthi Parishad (ABVP)  swept the Delhi University Students’ Union (Dusu) polls for the second year in row, winning all the four seats. Aam Aadmi Party (AAP) student wing Chhatra Yuva Sangharsh Samiti (CYSS), which made its electoral debut in the Dusu polls, finished third, behind the Congress’ student wing, National Students’ Union of India (NSUI). \n \nThis year the ABVP not only retained its tally but also increased its victory margin. All the four ABVP candidates won with  comfortable margins, bettering last year’s performance. The ABVP has won the seats of president, vice-president, secretary and joint secretary by a margin of over 4,500 votes each.  ABVP’s Satinder Awana, an MA Buddhist Studies student, won the president’s post by margin of 6,327 votes. Mr Awana got 20,439 votes while his nearest rival, Pradeep Vijayran of the NSUI, got 14,112 votes. \n \nThe vice-president’s post was won by Sunny Dedha, a law student, by a margin of  7,570 votes, defeating Garima Rana of the CYSS. \n \nAnjali Rana of the ABVP defeated NSUI’s Amit Sehrawat to win the post of secretary by a margin of 4,610 votes. Chhattarpal Yadav bagged the position of joint secretary, defeating NSUI’s Deepak Choudhary by 6,065 votes. \n \nPolling in the Dusu elections on Friday witnessed a marginal drop in voting percentage from last year. On Friday, Dusu recorded a voter turnout of 43.3 per cent while in 2014 it was 44 per cent. NSUI had trailed in second place in three posts, except the vice-president’s post where CYSS came second. For president, CYSS candidate Kuldeep Bhiduri came fourth. Another CYSS candidate, Hitanshi Chauhan, contesting for joint secretary, came in fourth. \n \nAttacking Delhi chief minister Arvind Kejriwal, on whose posters the CYSS sought votes from students, ABVP Delhi secretary Saket Bahuguna said the use of money and muscle power by the AAP leadership has been rejected by the student community of Delhi University. “Students have given a befitting reply to Mr Kejriwal and his party, that they cannot be fooled by false and misleading promises,” added Mr Bahuguna. \n \nTerming the victory historic, ABVP national joint secretary (organisation) Srinivasan said Delhi University has rejected the Arvind Kejriwal-style of negative politics and supported constructive politics. \n \nNewly-elected Dusu president Awana said the students had elected ABVP for its work and rejected the other for its misleading propaganda. “CYSS presence was only felt in the posters, banners and hoardings across the city instead of among the students. They were unaware of students’ issues and had no support among the student community,” added Mr Awana. \n \nNewly-elected Dusu secretary Garima Rana said the new office-bearers would work to provide a safe campus for girl students and a dedicated U-Special for them. In 2014, the ABVP won all four seats; the last time it had done so was in 1997, a gap of 17 years.", "source": "Asian Age"}