{"published": "2015-09-03T05:00:00Z", "media-type": "News", "title": "Can't make it to the tailgate? Host the ultimate 'staygate' instead", "id": "336bd374-3daa-4b80-b342-a28baed5d036", "content": "(BPT) - With college football season upon us, there’s no better way to enjoy time with family and friends than getting together to cheer on your favorite team. This year, with rising ticket, concession and travel costs, why not gather your friends and family together for a private “staygating” party in your own living room? Here are five tips to hosting the ultimate staygate this fall to do game day right. \n  \n* Pick your game day early! Do you have a favorite rivalry game? Is there a certain Saturday that promises lots of good conference showdowns? Plan now and let your friends and family know you’ll be hosting an all-day staygate so you can get a full house and an accurate headcount. Email invites make it easy to get an accurate headcount, especially if your staygating party is a larger affair. They are also more environmentally friendly, and best of all, free! \n \n* Impress your guests by watching the game on an amazing television — like the OLED 4K TV s from LG, which allow your fans to experience each moment with the best picture quality on the market. OLED technology delivers a breathtaking picture with perfect blacks and amazing color, even at wide viewing angles — so every seat in the house feels like the 50-yard line. \n \n* Create a stadium atmosphere to set the stage for game day. Easily set up a Wi-Fi and Bluetooth-capable multi-room speaker system, like LG’s Music Flow , to play a game day soundtrack featuring your team’s fight song and popular in-game anthems to get your crowd pumped up before kickoff and keep them energized throughout the game. Just use your smartphone to stream your playlist from your favorite service via the Music Flow Player App to get the party started. By adding a Music Flow sound bar and surround system, it will enhance the viewing experience with enveloping game day sounds of bands and cheering crowds. \n \n* Serve a creative spread. Game day snacks can make or break the atmosphere of a staygate, so make certain your fans aren’t calling foul on what you serve. Go online to order local favorites, from wings and pizza to sliders and nachos, to give your guests a taste of what it’s like to be back on campus, or color-coordinate your spread to create a celebratory vibe. For inspiration, check out your favorite team sites or regional food blogs. \n \n* Stock up on game day essentials. Once your RSVP list is finalized, don’t forget to stock up on festive game day favorites. Encourage your guests to dress for the occasion! Just because the team can’t see you, doesn’t mean your lucky socks are any less lucky. Break out those team colors, wear them with pride and challenge your fellow staygaters to do the same. Do you cheer on your team with shakers or foam fingers? Cowbells or clappers? Recreate that stadium electricity by offering your fans the same fun noisemakers at your staygate.   \n \nFor more tips and advice on how to “do game day right” from Official NCAA Corporate Partner LG Electronics USA, visit www.lg.com/us/do-game-day-right .  ", "source": "Doaneline"}