{"published": "2015-09-19T18:16:00Z", "media-type": "News", "title": "American voter is mad -- and perfectly rational: Susan Shelley", "id": "316eac8d-d36a-42d4-a004-7961bfcbed00", "content": "No one is sure exactly how it happened. It may have been part of a plea bargain on charges related to the kidnapping of two early primary states. All we know is that Mr. American Voter agreed to go to anger management counseling, and the Democratic and Republican parties agreed to split the cost. \n\n“Mr. Voter,” the counselor began cautiously, “do you know why you’re here?” \n\n“Everybody’s got to be somewhere,” Mr. Voter snapped. \n\n“Your friends in the Republican and Democratic parties care about you,” the counselor said. “The party leaders think your anger has made your life unmanageable.” \n  \nMr. Voter’s answer was unprintable in a family newspaper. \n\nThe counselor picked up a small notepad and a pen from a side table. “Tell me, Mr. Voter, when did you first experience a feeling of strong anger?” \n\n“September 11, 2001,” Mr. Voter said. “Things were going along all right. We had just had a long national debate over whether oral sex was adultery. It was football season, baseball playoffs were coming up. Things were all right. And then, somebody took a shot at us. Angry? I was volcanic. And I waited for the government to do something. Seemed like forever before they figured out what to do. \n  \n“And what they did was a disaster. Fourteen years of war and it feels like the terrorists have won. Now we’re helping Iran sponsor terrorism and get a nuclear bomb. And when I go to the airport, they throw out my shampoo. \n\n“Angry? The government takes over the health insurance business and now it’s costing me more, and my doctor retired at 55 years old. \n\n“The financial markets crash in 2008 and what does the government do? Bail out everybody who caused it. Meanwhile I’m getting zero percent interest on my savings and it seems like the stock market is rigged with computer trading and inside information. \n  \n“And everything’s more expensive. Food, energy, insurance, housing, college. And what does the government say? ‘There’s no inflation!’ \n\n“All the jobs that used to pay $60,000, $70,000 a year, so you could live, they’re gone or out of the country now. And what does the government say? ‘Job creation is strong!’ Over 90 million people have left the workforce. What does the government say? ‘They’re not unemployed!’ \n\n“And on top of everything, we’ve got an open border and millions of people who came into the country without legal authorization. What does the government say? ‘It’s all good!’ \n \n\r\r \n  \n“I’m angry all down my left side and all down my right side,” Mr. Voter said. “I’m angry that CEOs are getting obscene payouts approved by corporate boards they recruited themselves. I’m angry that anybody who stands up for the interests of Americans is called a nativist or an isolationist or a wing nut. Where are you going?” \n\n“To get a bigger notepad,” the counselor said. \n\n“And another thing,” Mr. Voter raged. “I’m sick of hearing that American history is some kind of criminal record. I want Andrew Jackson on the 20. I want Alexander Hamilton on the 10. I want William McKinley on the mountain. I want George Washington taught in elementary school.” \n  \n“I think that’s enough for our first day,” the counselor said. \n\n“Just give me the bill, we’re done,” Mr. Voter growled. \n\n“No, sir!” the counselor insisted. “The Democratic and Republican parties promised to pay for this.” \n\nMr. Voter slammed his fist through the top of a coffee table. “You know they’ve run up $19 trillion in debts, right?” he yelled. “I’ll write you a check. My kids have enough bills to pay.”", "source": "Inland Valley Daily Bulletin"}