{"published": "2015-09-18T09:44:00Z", "media-type": "News", "title": "Smart Grid IT Systems: MDMS, CIS, GIS, SCADA, EMS, DMS, OMS, AMS, MWMS, DRMS, DERMS, and Utility Data Analytics Solutions: Global Market Analysis and Forecasts - Reportlinker Review", "id": "ab0f4dd1-1872-4687-b948-04c2c5e705b9", "content": "As power grid operators worldwide face new and growing challenges—to stability, reliability, and even economic feasibility—those charged with managing the grid are turning increasingly to sophisticated IT systems. Modern solutions can help managers leverage the growing connectivity of grid equipment and devices in order to automate control and maintenance functions and better engage with customers. The proliferation of new sensing devices in the grid is providing vast quantities of granular data and grid-edge visibility. Meanwhile, newer platforms like mobile devices and social media are delivering real-time intelligence never before available to utility managers. Add in sophisticated predictive analytics solutions, and the possibilities for utilities to improve efficiency, reduce costs, and better interact with their constituents are nearly endless.Indeed, Navigant Research projects that IT systems and analytics will account for a significant—and growing—portion of utility smart grid investment over the next decade. That said, financial constraints and competing budget items, as well as sunk investments and depreciation schedules based on established rate cases, mean that utility investment in new IT solutions will happen in an incremental fashion in most regions. According to Navigant Research, the global market for smart grid IT software and services is expected to grow from $8.5 billion in 2014 to $17.1 billion in 2024.This Navigant Research report provides a comprehensive overview of the global market for utility smart grid IT systems. The study discusses the potential benefits and challenges to utilities deploying new IT systems and describes a dozen major utility IT applications. Global market forecasts for utility smart grid IT software and services, segmented by category (software purchases and upgrades, software maintenance fees, services, and software as a service, or SaaS), application, and region, extend through 2024. The report also provides in-depth profiles of numerous vendors involved in the utility smart grid IT space.Key Questions Addressed:What are the major smart grid IT systems available to utilities today and what do they do?How much do utility IT systems cost and how are they sold?What are the key challenges faced by utilities seeking to upgrade their IT capabilities?What are the most important trends in the utility IT space today?How large will the market for utility smart grid IT software and services grow?Which global regions will see the fastest growth in the adoption of utility IT software and services?What purchase models are dominant today and how will that change over the next decade?Who needs this report?Utility IT application developersUtility IT systems integratorsUtilitiesIT hardware vendorsGovernment agenciesUtility regulatorsInvestor communityRead the full report: http://www.reportlinker.com/p02877939-summary/view-report.htmlAbout Reportlinker ReportLinker is an award-winning market research solution. Reportlinker reviews, finds and organizes the latest industry data so you get all the market research you need - instantly, in one place.http://www.reportlinker.com__________________________Contact Clare: clare@reportlinker.comUS: (339)-368-6001Intl: +1 339-368-6", "source": "CEOWorld Magazine"}