{"published": "2015-09-07T22:10:27Z", "media-type": "Blog", "title": "Puerto Rico's healthcare debt looms", "id": "9adce1fd-e829-428c-8ccd-15fe47baa011", "content": "   Menu LISTEN    Health Care Health Care No Title «DONATE Search Shows Marketplace Morning Report Weekend Marketplace Tech Mid-Day Update Marketplace Money (Archive) QuickLinks Latest Stories\nMarketplace Music\nPodcasts\nYork & Fig Topics Home Shows Business Economy Elections Education Life Sustainability Tech Wealth & Poverty World Money Special Sections The Whiteboard LearningCurve I've Always Wondered BBC on Marketplace American Futures Corner Office Diagnosis: Camden The Big Book Freakonomics Radio Must Reads Budget Hero Secret Life of a Food Stamp Income Upshot The Datebook Work in America Innovators The new Cold War? Oyler Yearbook A lot to give Tools Newsletters Mobile Apps Facebook Twitter Podcasts RSS Access Home Sign In My Account Contact About ShowsMarketplace Marketplace Morning Report Marketplace Weekend Marketplace Tech Marketplace Mid-Day Update Business World Economy Tech Sustainability Education Money Wealth & Poverty Video About Contact Donate Listen Button - Responsive Listen\n Latest Stories\nMarketplace Music\nPodcasts\nYork & Fig Search Share It!\nPuerto Rico's healthcare debt looms Puerto Rico's healthcare debt looms Play Pause 0:00 Pop-Up Embed Subscribe Help Support Us ​ ​ Joe Raedle/Getty Images\nThe Puerto Rican flag flies near the Capitol building as the island's residents deal with the government's $72 billion debt on July 1, 2015 in San Juan, Puerto Rico. With another deadline looming, health care has become an important issue to be addressed, especially for Puerto Ricans enrolled in Medicare or Medicaid. by Andy Uhler Tuesday, September 8, 2015 - 05:00 Story Tuesday marks the latest deadline for cash-strapped Puerto Rico. The group put in charge of putting together a comprehensive plan to restructure Puerto Rico’s debt has been told to deliver the plan to the governor by today. But given Puerto Rico’s inability to reach other deadlines, many experts say they wouldn’t be surprised if the deadline was pushed back again. But as nearly half of the island’s residents are enrolled in Medicare or Medicaid, healthcare is one item in the debt restructuring plan that might need more immediate action.  Rafael Cox Alomar, a law professor at the University of the District of Columbia, says the Clinton administration abolished a tax break that had, for years, brought investment to the island. Many pharmaceutical and medical supply businesses subsequently moved to the mainland. “They harp back to the Clinton years and the mismanagement and lack of commitment and strategy that administration showed in its dealings with Puerto Rico,\" he says. \"It’s sad to say, but it’s the truth.” People have steadily been leaving Puerto Rico for the mainland since the 1990s, and the island is on track to lose another half million people by 2050. Dr. David Lenihan, President and CEO of Ponce Health Sciences University, says Puerto Ricans who decide to stay may or may not have access to healthcare. “We’re kinda screwed,\" he says. \"Because it’s not like living on the mainland, where if you’re on Medicare or Medicaid your doctor just bills the federal government. We don’t have that right. The government has said 'You’re a territory so you don’t have the right to do it.' So what happens is, the government gives a block grant down to PR and if you spend it all, you can’t go get more money.” That could leave patients without access to healthcare. Senators introduced legislation last month to eliminate that cap on the grant for Puerto Rico’s Medicaid. Professor Charles Venator Santiago, a professor of political science at the University of Connecticut says, if adopted, it would treat the territory more like a state. “There would have to be local reforms in the island because the public healthcare system we have there is fairly corrupt,\" he says. \"There has to be a lot more accountability and it can be done. It can be done quickly if the federal government would move forward, but I don’t see that impetus right now.\" There’s no hard deadline for restructuring Puerto Rico’s healthcare funding issues, but it’s inseparable from its larger debt problem and demands a solution. For one thing, if funding for Medicare and Medicaid runs out, the island’s residents don’t have the safety net of the Affordable Care Act.   Featured in: Marketplace Morning Report for Tuesday, September 8, 2015 Share It!\nYou Might Also Like... Explore Stories that share this feature's tags Puerto Rico, healthcare, ACA, Obamacare, debt, leverage What can candidates for president do for Puerto Rico? Politicians make a push for debt-free college Doctor housecalls are back with the click of button In debt crisis, Puerto Rico's economy is pressured California leads in lowering health insurance premiums View Complete List     You Might Also Like... Explore Stories that share this feature's tags Puerto Rico, healthcare, ACA, Obamacare, debt, leverage What can candidates for president do for Puerto Rico? Politicians make a push for debt-free college Doctor housecalls are back with the click of button In debt crisis, Puerto Rico's economy is pressured California leads in lowering health insurance premiums View Complete List   With Generous Support From... Marketplace thanks our sponsors for their continued support in the following categories. Sustainability Coverage The Kendeda Fund Education Coverage The Kresge Foundation The Gates Foundation Asia Coverage The Starr Foundation The Henry Luce Foundation Wealth & Poverty Coverage The Ford Foundation General Support The John D. and Catherine T MacArthur Foundation Newman's Own Foundation Annie E. Casey Foundation", "source": "Latest Stories on Marketplace.org"}