{"published": "2015-09-21T14:01:40Z", "media-type": "News", "title": "Music Hall supporters plan for hall closure", "id": "7a914a37-4d71-40b6-be80-c7fc320617d4", "content": "The rescued and restored art-carved panels that graced the organ screen on Music Hall’s 1878 Hook and Hastings organ, on display in Corbett Tower at Music Hall. (Photo: The Enquirer/Janelle Gelfand) \n\n“It is an exciting time of transformation at Music Hall, and SPMH is right in the middle of it,” said Don Siekmann, outgoing president of the Society for the Preservation of Music Hall. \n\nWhile officials have been finalizing the big-ticket renovation of Music Hall, the hall’s support group – SPMH – has continued to make improvements behind the scenes, raise money and conduct tours of the landmark building. \n\nThe society, founded by volunteers 27 years ago, held its annual meeting in Corbett Tower on Tuesday, a day after the Music Hall Revitalization Company announced a firm timeline and design team to lead extensive renovations. Members heard further details about the construction plans from Stephen Leeper, president and CEO of Cincinnati Center City Development Corporation (3CDC), developer of the project. Among the revelations: The historic, now-hidden carriageways will be re-purposed as VIP and concession areas. \n\nSPMH’s hand is evident everywhere you look in Music Hall – from cleaning the chandeliers to funding plumbing repairs. This past year, the society paid $15,000 to “deep clean” the marble and slate lobby floor, which is original to the 1878 hall. \n\nDocent guides took a record 2,400 people on backstage tours. And this year, SPMH took ownership of the superb “Mighty Wurlitzer Organ,” which formerly graced the long-gone Albee Theater. It was gifted to the group by the Ohio Valley Chapter of the American Theatre Organ Society. An anonymous donation of $1.4 million funded its installation in Music Hall’s Ballroom, where organ concerts are presented to sell-out crowds. \n\nAlso on Tuesday, board member Kathleen Janson introduced a display of art-carved wooden panels from Music Hall’s original Hook and Hastings organ. They are temporarily on exhibit in Corbett Tower. She has led the project to rescue and restore the panels – many which were lost in Music Hall’s last renovation – and announced several privately-owned panels that have been donated to the effort. Their restoration is being funded by the Patricia Corbett Endowment Fund of SPMH. \n\nIt is the society’s goal, she said, to display these rare pieces in Corbett Tower after Music Hall’s renovation, shown as they would have been mounted on the organ screen. They are fine examples of Cincinnati’s own art-carved movement. \n\nSPMH’s new president, Peter E. Koenig, partner in Buechner Haffer Meyers & Koenig Co, LPA, said it is his aim to keep Music Hall in the public eye after it closes in June. \n\n“I envision that while Music Hall is dark during up to18 months of construction, SPMH will continue to increase the visibility of this iconic landmark in the consciousness of our community,” Koenig said. “We look forward to re-emerging with Music Hall’s re-opening in the fall of 2017 with abundant tours to showcase what will be the best concert hall in America.” \n\nTo join, or for information, visit spmhcincinnati.org. \n\nComposer Libby Larsen visits CCM \n\nGrammy Award-winning American composer Libby Larsen, the first woman to serve as a resident composer with a major orchestra, will return to the University of Cincinnati College-Conservatory of Music on Sept. 26 for a performance of her new work, “The Birth Project.” \n\nA trio of faculty and alumni artists will perform the Cincinnati premiere in Robert J. Werner Recital Hall as part of CCM’s Fall Faculty Artist Series. Larsen has written her newest song cycle for CCM associate professor of voice Gwen Coleman Detwiler and CCM graduate Audrey Luna. \n\nLydia Brown, who joined the CCM opera faculty last year, will collaborate at the piano. The piece lends a fresh perspective to childbirth, a topic rarely addressed in vocal literature. Larsen’s “The Birth Project” explores the emotions of childbirth, in songs set to texts by modern authors, such as Jennifer Gilmore, Langston Hughes and many others. \n\nLarsen is one of America’s most prolific and most performed composers living in America today, with more than 400 works, including chamber music, orchestral works and 12 operas. \n\nDetails: 2 p.m. Saturday, Sept. 26 in Werner Recital Hall. Admission is free. Information: 513-556-4183, ccm.uc.edu. \n\nRead or Share this story: http://cin.ci/1KqxvlP", "source": "Cincinnati Enquirer"}