{"published": "2015-09-22T12:19:34Z", "media-type": "News", "title": "Modi government clears multi-billion dollar deal with US for military helicopters", "id": "26e91234-d6a2-44ff-a4d1-8d58f6b1dbb9", "content": "Ahead of Prime Minister Narendra Modi's visit to the US, the Cabinet Committee on Security (CCS) on Tuesday cleared a multi-billion dollar deal for 22 Apache attack helicopters and 15 Chinook heavy-lift choppers with American aviation giant Boeing.\r \n\n\n\r\n\"The deal for Apache and Chinook (helicopters) has been cleared,\" government sources said. \n\nThe CCS met after a Cabinet meeting, they said.Many in the defence sector had expected the deal, valued \n\r\nto be over USD 2.5 billion and pending since 2013 following finalisation of cost negotiations, to be signed during the visit of US Defence Secretary Ashton Carter in June this year. \n\nThe deal for Apache is \"a hybrid one\", with one contract to be signed with Boeing for the helicopter and the other with the US government for its weapons, radars and electronic warfare suites. \n\nThe US has been pushing for this contract as it will further bolster American presence in the burgeoning defence market of India. \n\nAmerican companies have over the last decade bagged defence contracts from India worth around USD 10 billion, including for aircraft like P-8I maritime surveillance planes, C-130J 'Super Hercules' and C-17 Globemaster-III in the transport category. \n\nPrime Minister Narendra Modi will leave for the US tomorrow to attend the UN General Assembly. \n\r\nThe helicopter deal had survived over 10 price extensions from the American side with the last one being for a month as desired by India. \n\nThe contract will have clauses to place follow-on orders for 11 more Apaches and four extra Chinooks. \n\nBoth platforms, which have been in combat in Afghanistan and Iraq, had beaten off competition from Russia, which had offered its Mi-28N Night Hunter and Mi-26 heavy-lift copters. \n\nThe 22 Apache AH 64D Longbow helicopters are one of the most advanced multi-role combat helicopters, featuring all-weather and night fighting features, ability to track upto 128 targets in less than a minute and engage with 16, besides stealth characteristics, advanced sensors and beyond visual \n\r\nrange missiles.India will also be acquiring Hellfire missiles and rockets.", "source": "Samaylive"}