{"published": "2015-09-18T07:36:27Z", "media-type": "News", "title": "Vietnam, Spain hold political consultation", "id": "f657fa32-4436-4f01-ba65-aea8a39b4354", "content": "Spain wishes to deepen the strategic partnership with Vietnam, while Vietnam wants to step up wide-ranging result-oriented co-operation with Spain for mutual development and integration.\n\nDeputy Foreign Minister Bui Thanh Son.\n\nThe remarks came from the two countries’ deputy-ministerial political consultation held during Vietnamese Deputy Foreign Minister Bui Thanh Son’s visit to Spain from September 16 to 18. The consultation was co-chaired by Spanish State Secretary for Foreign Affairs Ignacio Ybanez Rubio.\n\nSpain said it considers Vietnam as one of the three most important partners in Southeast Asia and values the country’s important role in the region and ASEAN.\n\nBoth sides agreed that bilateral cooperation has been expanded in security-defence, justice, transport, education, tourism, economy and investment but needs to be more productive in coming time.\n\nVietnam and Spain posted US$2.92 billion in trade revenue in 2014, from US$2.4 billion in 2013.\n\nThe two sides committed to facilitating business connectivity, particularly in infrastructure, energy and the environment. Deputy Minister Son said he hopes for an increasing inflow of Spanish investments in Vietnam.\n\nThey affirmed mutual support at multilateral forums such as the Asia-Europe Meeting (ASEM) and the ASEAN-EU co-operation forum.\n\nSpain vowed to back Vietnam in sealing a free trade agreement with the EU and being recognised as a market economy.\n\nOn the East Sea issue, Spain supports Vietnam’s peaceful approach that is in line with international law, including the 1982 UN Convention on the Law of the Sea (UNCLOS), and the Declaration of the Conduct of Parties in the East Sea (DOC).\n\nDuring his three-day Spain visit starting September 16, Deputy Foreign Minister Bui Thanh Son met with the state secretary of economy and competitiveness, and presented a friendship order to former Danish Ambassador in Vietnam John Nielsen, who is now working in Spain.\n\nNhan Dan", "source": "VietNamNet Bridge"}