{"published": "2015-09-27T14:46:42Z", "media-type": "Blog", "title": "25th - 27th September 2015", "id": "79e6bfbe-762a-4aae-b705-0f5a04859941", "content": "Sunday, 27th September: Another lovely day, though with the north-easterly breeze picking up during the morning..... Ferry Pool: There were three Spotted Redshanks, three Green Sandpipers, a Common Sandpiper, a Snipe and 24 Dunlin on the pool at high tide, along with half a dozen Lapwing, c30 Black-tailed Godwits and c80 Lapwing. There were also 25 Shoveler and over 100 Teal present - with the drakes starting to come out of eclipse plumage, plus eight Shelduck and around 400 Black-headed Gulls, with the the whole place looking very busy! (AH) Spotted Redshank (above), Snipe, Shoveler & Teal on the Ferry (AH) Chichester GPs: Ivy Lake area - No sign of the Black Tern this morning, and fairly quiet bar a large roaming flock of Long-tailed, Blue and Great Tits, plus 15 or more Chiffchaffs, two Cetti's Warblers and six Goldcrests. (OM) Drayton pits were no better; apart from Coots, wildfowl numbers were surprisingly low with the only interest being 20 Gadwall and a single drake Wigeon still in partial eclipse (doubtless the same bird that summered in this exact area). Two Cetti's Warblers were present and a about a dozen Chiffchaffs were in the hedges, whilst a single Snipe put in an appearance, but these apart, the only other interest was up to four Jays collecting acorns and a family party of three green Woodpeckers (OM).  Medmerry: Easton Lane to the Stilt Pool - The two Garganey were still present this morning, and there was a Green Sandpiper and six Gadwall on the pool, and a dozen yellow Wagtails were flying around nearby. Along the banks/path to the Stilt Pool there were up to four Whinchats, eight Wheatears, two Stonechats, a Lesser Whitethroat, a few Chiffchaffs and two Corn Buntings, along with 30+ Stock Doves, 100+ Linnets and Goldfinches and up to 500 Meadow Pipits. There was a continuous flow of hirundines - most of which were House Martins, though there were a fair few Swallows and 30+ Sand Martins among them. Also a female/juvenile-type Marsh Harrier was over the sea. There was not much on view out on the reserve, bar a few Curlew and plenty of Teal, and the two Bar-headed Geese with the Canada Geese early on. The Pool itself was quiet, with just two juvenile Avocets and eight Dunlin being the only waders present. (AH/A&YF/RJS/PH) Whinchat (above), Wheatear, House Martin, Meadow Pipit & Stock Doves at Medmerry (AH) North Wall area: There were some 300 Wigeon in and around White's Creek this morning, whilst on the Breech Pool there were 70 Black-tailed Godwits, 2 Common Snipe and 1 Spotted Redshank. A flock of 11 Long-tailed Tits was along the Wall, with another eight in Owl Copse along with two Goldcrests.  Also, there were at least 22 Yellow Wagtails amongst the cattle at Marsh Farm and four Stonechats amongst the maize at Bramber. (JDW)  Yellow Wagtail at Marsh Farm, Sidlesham (above) & Stonechat at Bramber (JDW) Saturday, 26th September: A fine, dry and sunny morning with some scattered cloud and a gentle E/NE breeze; with high pressure now dominating the weather seems set fair for the week ahead.... Selsey Bill (0640 - 0900hrs):  Sunny, ENE2-3  (Obs: SH/PB/SR/C&ME/JA)\nGannet - 13E, 11W, 8os\nRed-throated Diver - 2W\nBrent Goose - 3W\nCommon Scoter - 3E\nSandwich Tern - 7E\nMediterranean Gull - 6W\nKittiwake - 5W\nAuk sp -1W, 2os\nGreat Spotted Woodpecker - 3 present\nMeadow Pipit - 120E\nYellow Wagtail - 18E\nPied Wagtail - 24E\nGrey Wagtail - 1E, 1W, 3N\nSwallow - 1510E\nHouse Martin - 633E\nSkylark - 1W\nChiffchaff 13 - gardens  Siskin - 13E Chaffinch - 10E\nGreenfinch - 11E\nGoldfinch 16 - p\nLinnet - 2W\nChurch Norton: Around the orchard at Greenlease farm were a Redstart, 3 Blackcaps and a Spotted Flycatcher, whilst along the beach were 3 Stonechats and a Wheatear, a Peregrine hunting and 6 Sandwich Terns offshore. A Willow Warbler was in the bluebell wood plus a couple of Chiffchaffs and 3 Goldcrests in the area (S&SaH/PB/IP) North Wall: Fairly quiet today, but sightings included Whitethroat and lesser Whitethroat, and a Grey Heron devouring a large fish! (CG)\nGrey Heron with large fish, North Wall(CG)\nChichester GPs: Ivy Lake - The Black Tern was still there at 9am and again at 1pm. There was also a large roaming mixed Tit flock with 12+ Chiffchaffs among them along the paths. (BI) Black Tern on Ivy Lake (BI) Medmerry: The two Garganey were still present on Easton pool early morning with four Gadwall, a Grey Heron, a Little Egret and a Little Grebe. A Whinchat and four Stonechat were around Marsh Barn and lots of Meadow Pipits over & around.  A Peregrine was in the middle of the reserve and a Razorbill was on the sea by the defences and later at the breach. Twelve Grey Herons, a Curlew and two small groups of Dunlin were along the way to the breach and three Sandwich Terns were fishing successfully offshore. Only a single Wheatear was on the fenceline but again there were many Meadow Pipits, and there were still plenty of Canada Geese on the stilt pools along with an Avocet and nine Dunlin. (BI) A Spoonbill was on the east side of the reserve this morning (PH). An Osprey was also present, and later only one of the Garganeys could be located (CG) Razorbill (above) & Meadow Pipit at Medmerry (BI) Garganey and Wheatear at Medmerry (CG) Ferry Pool: There were four Green Sandpipers early on, along with six Avocets and a dozen Black-tailed Godwits, and a Kingfisher shot through. (AH) Long Pool: There was a huge amount of activity early on, mostly involving c60 Chiffchaffs and 30+ Reed Buntings, but there were also two Sedge Warblers, a Reed Warbler and at least a dozen Blackcaps present, along with a Yellowhammer, briefly, and two or three calling Cetti's Warblers. A Kingfisher was in the channel, a Greenshank went over and there were 200+ Swallows feeding overhead. (AH) Kingfisher (above), Blackcap & Chiffchaff along Long Pool (AH) Friday, 25th September: A lovely autumn's day after a cloudy start.... Selsey Bill (0715-0930hrs): The most notable aspect today was the visible migration going on overhead, although the totals herewith for the period shown are a little disjointed and without doubt do not reflect the entire morning's passage.... (Obs: GH/JA/C&ME/SR/OM) Mute Swan - 1E\nGannet - c.20W in half an hour\nCommon Tern - 2W\nSandwich Tern - 3E\nMediterranean Gull - 2W\nKestrel - 1 gardens\nHouse Martin - c.400W\nSwallow - c.250W\nPied Wagtail - 28W\nYellow Wagtail - 7W\nGrey Wagtail - 2W\nMeadow Pipit - 50W\nGreenfinch - 20W\nGoldfinch - 158W\nLinnet - 28W\nSiskin - 62W\nChiffchaff - 16 gardens\nBlackcap - 3 gardens\nSelsey East Beach pool: An early look around the pool produced 12 Chiffchaffs, plus 15 Siskins and 5 Pied Wagtails moving west. There was also an apparent influx of Blackbirds, with 15 in this small area alone. (OM)\nSelsey (West): Warner Lane paddocks/area: A few migrants in this little patch, with two Stonechats, a Whitethroat, five Chiffchaffs, 10 Meadow Pipits and a dozen Siskin W, plus a stream of Swallows overhead. (OM) \nNorthcommon Farm: Not overly productive here, though a Redpoll flew over calling, followed by a few Siskins, but otherwise there were just c.10 Chiffchaffs, 4 Goldcrests, 2 Kestrels and a Grey Wagtail in the puddles! (OM)\nGrey Wagtail at Northcommon Farm (OM)\nAlmost an action replay of yesterday, with six Spotted Redshanks, two Green Sandpipers, a Common Sandpiper and a Snipe all present, along with a dozen Black-tailed Godwits and six Avocets. (OM/AH) Spotted Redshanks (above) & Green Sandpiper on the Ferry (AH) North Wall: There were three Spotted Redshank in White's Creek, along with an Avocet, 60 Black-tailed Godwit and 80 Redshank. Along the east side there were two Greenshank, five Yellow-legged Gulls, 40 Knot, 75 Grey Plover and c200 Dunlin, along with a single Brent Goose, up to a dozen Pintail and 100+ Wigeon and Teal. A Common Sandpiper was along the wall, a Peregrine went over east and a steady flow of Swallows and House Martins went west but, bar a few Chiffchaffs, migrants were few, though there were a pair of Stonechats present by the sluice, along with ten or more Reed Buntings. Very little was on the Breech Pool except 50 or so Black-tailed Godwits and similar of Teal. (AH/PC) Later, by early afternoon on the falling tide, there were 40 Pintail, two Brent Geese and eight Great Crested Grebes in the channel, but only a single Yellow-legged Gull. The Spotted Redshanks and Greenshank were still present but numbers of other waders had reduced considerably. A few Siskins were on the move heading west, and two calling Redpoll circled low overhead before also heading west. (OM) Spotted Redshanks (above), Greenshanks, Common Sandpiper, Grey Plover, Yellow-legged and Herring Gulls, Peregrine & Stonechat around the North Wall (AH) North Wall regular Peter Callis and friend (!!) taking a breather on the North Wall (AH)\nYellow-legged Gull, east side (early afternoon) (OM) Church Norton: There were six Chiffchaffs behind the hide and a few Blackcaps and Chiffchaffs along the beach today. (BI) Chichester GPs: Ivy Lake - The juvenile Black Tern was present again today. (BI) Black Tern on Ivy Lake (BI) Medmerry: Breach area - From the east side later today, the Osprey was sat in the middle of the reserve and there were six Wheatears, a Stonechat, a flock of Linnets and plenty of Meadow Pipits around what remains of the rubble. (BI) Very distant (!) Osprey at Medmerry (BI) Easton Lane to the Stilt Pools - The Osprey was in centre of the reserve eating a fish, before going over towards the east side (see above), an immature Spoonbill was present on the reserve (RJS), and the two Garganey were still on the  first pool. Other birds seen included 14 Stonechat, 3 Whinchat, 1 Wheatear, 2 Whitethroat and  2 Reed Bunting, along with 2 Buzzard, 3 Kestrel, 3 Black-tailed Godwit, a Bar-tailed Godwit, 8 Greenshank, a Redshank, 4 Dunlin and 3 Common Sandpiper. (CRJ) Between the Stilt pool and the breach there were at least 12 Wheatears and probably more, two Stonechats and very many Meadow Pipits and Linnets along the fence line and beach path. There were twenty Dunlin, twenty Teal and a Curlew around the pools on the reserve, a Sandwich Tern was offshore and a few Pied Wagtails went over. (BI) Stonechat (above) & Wheatear at Medmerry (BI)", "source": "Birding the Selsey Peninsula"}