{"published": "2015-09-18T08:51:33Z", "media-type": "Blog", "title": "COLD TURKEY “REMIX” by Geechi Mouf – @HAVNOTMUZIC", "id": "9d086326-6698-4fa4-93e2-93a3c090621f", "content": "Geechi Mouf is an American rapper and songwriter, and also the founder and CEO of Hav-Not Muzic Group Record Label. He is most known for the rising popularity of his hit single “Cold Turkey” which covers the controversial topic of dealing drugs. \n \nSynopsis: \nGeechi Mouf was born Beau Knox, in 1978 Volusia County, Florida, on October 26, 1978. Raised in Deland, Florida, Geechi was influenced by street-oriented rappers like 8Ball & MJG, Trick Daddy, Tupac, Master P. \nDuring his incarceration in 1998, he began to write rap lyrics of his own \nthat geared toward the street life and drug dealing & money. Known then as Lil Loc formed Tha Hav-Notz and joined a rap group from his \nneighborhood which combined local rap groups and solo acts forming C.O.D (City of DeLand). \nIn 2000, Geechi Mouf (then Lil Loc) and Tha Hav-Notz signed to Full Moon Records, an independent record label owned by Brain “DJ FURY”Graham, a Southern bass legend”. However,the label folded \nthe following year and The Hav-Notz were released from their contract. \nIn 2003, Geechi Mouf and the group began working with Tra Thomas, a former NFL athlete, who funded their early rap careers and moved \nthem to New York. \n \nAfter yielding little success, Geechi Mouf and Tha Hav-Notz decided to head back to Florida. Shortly after their move back to Florida, Geechi Mouf learned how to engineer his own music and began the DIY-method of building and structuring Hav-Not Muzic Group. \nIn 2014, Geechi Mouf released his first mix tape under the HNMG recording label, entitled A Mouf Full which featured his first single “MJ KILLA”. \nHis follow up debut “Cold Turkey” which tackled his controversial lifestyle as a drug dealer, was released in early 2015, and has since gained popularity across the southern regions of the United States. \n \nThe post COLD TURKEY “REMIX” by Geechi Mouf – @HAVNOTMUZIC appeared first on Hip Hop Illustrated . \n  \nNo related posts. \n  \nHip Hop Illustrated » Artist On The Rise \n \n\n \nThe post COLD TURKEY “REMIX” by Geechi Mouf – @HAVNOTMUZIC appeared first on Hip Hop Extra . \n Related posts:  Tax G – Dead End (Cold Water Version) [HD] Directed by Nimi Hendrix @TaxG  Deep – Pound Cake [Remix] – @DeepTheGr8est  Deep – Pound Cake [Remix] – @DeepTheGr8est  [New Music Alert] Troy Ave “Coco” Remix  [New Music Alert] Plies – “Fancy” (Remix)", "source": "Hip Hop Extra"}