{"published": "2015-09-22T14:15:00Z", "media-type": "News", "title": "It's a Mad world at the Melbourne Bar, as long as you're a man", "id": "ebcd41ea-e5b4-43a4-9e16-4406d81cfcda", "content": "Have you ever felt like trading in the politically correct strictures of the mordern office for the world of Mad Men? Have you ever felt like trading in the politically correct strictures of our modern day office environment for the world of Mad Men? It still exists, apparently, if you are a Melbourne barrister.\n\nThat was the gist of a very non-PC marketing campaign by the trouble-prone financial services shop, IOOF.\n\nA male adviser at its subsidiary, Shadforth Financial Group, sent the email soliciting for financial planning business from Melbourne's barrister community.\n\nAccording to an article in Lawyers Weekly, it had a very specific idea about who our \"typical barrister\" is. Let's just say that the girls and boys have very specific roles.\n\nAccording to the article, \"After marrying their 'school sweetheart' in their 30s, he suggested barristers in their 40s are likely to find themselves in the following position – 'Your wife is a 'home engineer', managing two children under 10, and you are finding the 'cottage' which was never quite finished is becoming a little crowded'.\"\n\nThings are better by the time this archetypal barrister hits his 50s. His career is established and \"your wife has gone back to part-time work and the money flow is good for a while\".\n\nThe report said several barristers had complained about this stereotype of a very male Bar with stay-at-home wives.\n\n\"Are we not thrust back to the beginnings of Mad Men?\" an anonymous QC told the publication.\n\nA Shadforth​ spokesperson told Lawyers Weekly: \"This does not reflect the view of Shadforth​ and is not the Shadforth​ way.\"\n\nIt won't be help Shadforth's​ parent, IOOF, which needs all the legal help it can get. The ASX-listed company has faced a Senate grilling, and an investigation from ASIC over allegations of front running, insider trading and faulty research reports. Degree of pain \n\nCBD would like to admit that we might have been a tad unappreciative of just what the Hawke-Keating era minister, John Dawkins, achieved during his all-too brief stint chairing education dunce, Vocation.\n\nMuch has been written about the disastrous unravelling of its business, and carnage for investors who were flogged the stock at more than $3 a pop. It is now worth 10¢.\n\nGood thing they have the luxury of three different class actions at their disposal.\n\nBut they should have known better. The risks were all reported in the previous annual report signed by Dawkins, according to his replacement in the chair, Doug Halley.\n\nIn this year's report, Halley referred to last year's effort saying: \"Our annual report also referred to risks that might restrict Vocation's ability to deliver on its strategy. With hindsight, two of these risks – the company's dependence on the support of government funding, and damage to its brand – were prescient.\"\n\nThat is one way of putting it.\n\nThere is some good news for investors. The new chief executive, Stewart Cummins, said he plans new initiatives to get the company back on track like, \"build a strong management team\" and upgrade its systems \"to provide accurate management information\".\n\nWow, why didn't they think of this before the IPO in December 2013.\n\nThe most sobering information is that the company paid out a $9.5 million dividend pre IPO, and another $6.5 million in 2014.\n\nThat is $16 million in cash dividends for a company now worth $23 million. NAB's Poach \n\nASIC's national media manager, Andre Khoury, will be playing on the other side of the fence, taking up a position with NAB next month.\n\nBut NAB confirmed that he will not be working with its wealth boss, Andrew Hagger.\n\nIt is an important point given Hagger has been moonlighting for ASIC thanks to the bank's wealth fiasco.\n\nIn March this year, a Senate committee heard how Hagger has had to check no fewer than five ASIC media releases that had been sent to the bank in draft form.\n\n\"Our practice of sending media releases to external entities has been that, with a negotiated outcome – and only with a negotiated outcome such as an Enforceable Undertaking – ASIC will generally provide the party with our media release shortly ahead of publication,\" explained Khoury's current boss, Greg Medcraft​. Fat loss\n\nSingaporean dotcom \"incubator\" Fatfish​ Group came back to the market with a Plan B on Tuesday after its investors gave it a lesson in democracy last week. They unceremoniously dumped its plan to spin-off, and list, mobile phone game maker, iCandy.\n\nFatfish​ said that, after consulting with iCandy's​ board, the ASX, and its own investors, it remains \"committed to pursuing the proposed spin-off and listing\" of iCandy​.\n\nTo avoid another rejection by shareholders at the next meeting, it proposes to retain a larger stake in iCandy​ and distribute fewer shares to its shareholders.\n\nMind you, its investors might have been reacting to the restatement of Fatfish's accounts last week by its auditors from MSI Ragg Weir.\n\nIt appears the backdoor listing of the Fatfish business in July last year, via Atech Holdings, did not meet certain accounting standards.\n\nThis means the purchase of one particular Fatfish​ business should have been accounted for as a cost rather than as \"goodwill on acquisition\".\n\nThis basically doubled the company's net loss for the year ending December 31, 2014, from $6.5 million to $12.5 million. It reported revenue of $507,310 for that year.\n\nGot a tip? ckruger@fairfaxmedia.com.au The story first appeared on The Sydney Morning Herald.", "source": "Daily Liberal"}