{"published": "2015-09-02T21:53:10Z", "media-type": "News", "title": "Three of 4 Nissan outlets shut, car owners driven to despair", "id": "f462eef8-a006-4ad0-8c17-f422d30d9732", "content": "By Aditya Anand and Amit Kotkar \nAndheri and Worli outlets latest to close; deliveries delayed, service requests on hold. \n\nNissan Motor India has terminated its dealership in Andheri and suspended operations of an outlet in Worli, reducing the number of showrooms and workshops it operates from four to one, much to the displeasure of its customers, who are either awaiting delivery of new vehicles or wish to have their cars serviced. \n\nThe Japanese car manufacturer on Wednesday shut down services offered by Torrent Nissan in Andheri by issuing a public declaration that customers aren't to do business with that dealer. Nissan also temporarily suspended Kamla Nissan, its outlet in Worli. \n\nMalad-based businessman BU Trivedi, 55, who booked a Datsun Go Plus in May after making a downpayment is yet to receive delivery but is paying an EMI on the loan he was offered. \"In June I was told that the delivery was delayed. While Kamla Nissan has closed down for now, the car is yet to be delivered,\" Trivedi said. \n\nThe businessman, who has paid about Rs 20,000 as instalments, added that officials at Kamla Nissan told him that could not deliver the car since the company had blocked their code temporarily. \n\nArchitect Dinesh Patil had his new car delivered five months ago but cannot drive it on the streets as it is yet to be registered. \"My family has to be content watching it parked outside our house since the dealer did not register its number with the RTO,\" Patil said. \n\nThe Jogeshwari resident has sent copies of the debit note (issued by Torrent Nissan) reflecting the amount for registration of vehicle recoverable/payable, insurance with Bharti AXA general, extended warranty recoverable/payable and depot charges to Nisan Motors India hoping that something will come of it. \n\n\"I have received a reply saying they will get back to me. But I expected it to be prompt,\" Patil said adding that he would wait and watch. Trivedi has decided he will initiate legal action and has appointed a lawyer. \"After issuing them with a legal notice, I intend to move the consumer court for a solution,\" he said. \n\nWhile a Nissan India spokesperson sought time to respond, a company official informed that most cases had been sorted. \"Till we resolve issues of payment defaults and slowing down of sales with dealers, customers will have to use services of Ritu Nissan in Bhandup and Thane,\" the official said. \n\n\"There were problems with funding arising out of partnership issues. But that has been resolved and we shall be starting afresh from October 1,\" Anil Jagtiani, Kamla Nissan executive director, told Mirror. \"Kamla Nissan is opening a new showroom in the central suburbs, while Ritu Nissan would open a new outlet in Andheri,\" he added.", "source": "Mumbai Mirror"}