{"published": "2015-09-07T12:33:09Z", "media-type": "News", "title": "Every Destiny: The Taken King Court of Oryx, Player Events Detail We Know So Far", "id": "4d2a496d-6c6f-47c2-8aed-4083ae1c0fa8", "content": "Destiny's Iron Banner game modeGamespot \n\nBungie's Destiny has been one of the most popular games in the last couple of years. And still, the game drives more and more players each day with its regular player events, loots and DLCs that add more to the overall experience. \n\nCurrently, Destiny fans are awaiting the upcoming The Taken King DLC for the game. There are a host of details that have been revealed for the game, including the fact that the digital download edition of the DLC can be purchased for $39.99 and is intended for players who already own Destiny. \n\nHowever, during Bungie's recent Destiny: The Taken King livestream reveal, Court of Oryx architect Ben Wommack was present to provide some details on the area, located within the Dreadnaught. \n\nWommack, for the details on Court of Oryx, reached further into the belly of the ship that will be featured in the upcoming DLC. \n\nAccording to the details provided, it seems like players will travel through the Hall of Souls to reach the Court of Oryx, described at the livestream as a \"giant arena\". While only Tier 2 was up for show at the livestream, the developer said lower tiers will also face different bosses each time, making way for variable encounters and dynamic dialogue. \n\nThis, obviously, has been done to keep things as fresh as possible. For example, a Tier 1 and Tier 2 event can be combined to chalk out harder difficulty, with the option to add up to four bosses into the event alongside the standard enemies. \n\nMoreover, there are as many as three Tiers for The Court of Oryx. Tier 1 bosses will be around level 36 difficulty, while Tier 2 bosses will be much harder, something very similar to Nightfall difficulty. However, all bosses will come with special mechanics. \n\nAt the livestream, as many as two events for the Court of Oryx were shown. The first one featured two Knights that needed to be lured together to bring their shields down. The second one featured a large Ogre, and the only way to bring his shield down is via an exploding Thrall. \n\nAccording to Bungie, there will be various player events, alongside mysteries such as Taken objects (we don't know much about them). However, these events aren't random, and all of them will be established by the players. \n\nThere are up to six other friends that can assist the player's Fireteam in the Court of Oryx, although the entire Fireteam needs to enter the court or the event will be cancelled. \n\n\"To trigger an event, a player must hand over a Rune to one of the statues, which spawn challenge missions. The player, which presents the Rune to the statue, will receive better loot than the rest of the team upon the event's completion. However, Bungie has put a debuff in place called Summoner's Exhaustion, which allows other players an opportunity to initiate the next event,\" a VG247 reports states. \n\n\"Antiquated Runes are rare drops in Tier 2, the Nightfall, and Raids. They are used to start Tier 3 events, which Bungie did not show. Wommack said players will have to wait until The Taken King's release to get a look at Tier 3.\" \n\nAre you excited about the upcoming The Taken King DLC for Destiny? Let us know in the comments section below. \n\nStay tuned for more updates! \n\n[Source: VG247] \n\nArticle Published: September 7, 2015 18:", "source": "International Business Times India"}