{"published": "2015-09-21T11:53:07Z", "media-type": "News", "title": "Wedbush Reiterates “Buy” Rating for Xencor (XNCR)", "id": "0d6e5f47-c3d4-4eb4-a02a-abc62650bac6", "content": "Xencor (NASDAQ:XNCR) ‘s stock had its “buy” rating reiterated by investment analysts at Wedbush in a research note issued to investors on Thursday, AnalystRatingsNetwork.com reports. They presently have a $27.00 price target on the biopharmaceutical company’s stock. Wedbush’s target price would indicate a potential upside of 44.46% from the stock’s current price. \n\nIn other Xencor news, Director John S. Stafford III sold 10,000 shares of the firm’s stock in a transaction that occurred on Thursday, September 3rd. The shares were sold at an average price of $17.22, for a total transaction of $172,200.00. Following the sale, the director now owns 77,500 shares of the company’s stock, valued at $1,334,550. The transaction was disclosed in a filing with the SEC, which can be accessed through the SEC website . Also, insider Edgardo Baracchini, Jr. sold 2,500 shares of the firm’s stock in a transaction that occurred on Wednesday, July 1st. The stock was sold at an average price of $22.24, for a total transaction of $55,600.00. The disclosure for this sale can be found here . \n\nOther equities analysts also recently issued research reports about the stock. Zacks lowered Xencor from a “buy” rating to a “hold” rating in a research report on Tuesday, July 7th. Oppenheimer initiated coverage on Xencor in a research report on Tuesday, June 30th. They set a “buy” rating and a $28.00 target price on the stock. Leerink Swann  restated an “outperform” rating and issued a $25.00 price objective on shares of Xencor in a report on Wednesday, September 16th. Finally, MLV & Co.  reiterated a “buy” rating and issued a $29.00 target price (up from $22.00) on shares of Xencor in a research report on Wednesday, August 5th. Two analysts have rated the stock with a hold rating and five have given a buy rating to the company. The stock presently has a consensus rating of “Buy” and a consensus target price of $24.67. \n\nShares of Xencor ( NASDAQ:XNCR ) opened at 18.69 on Thursday. Xencor has a 52-week low of $9.00 and a 52-week high of $24.82. The company’s market cap is $756.42 million. The stock’s 50 day moving average is $18.44 and its 200 day moving average is $18.08. \n\nXencor (NASDAQ:XNCR) last issued its quarterly earnings results on Tuesday, August 4th. The biopharmaceutical company reported ($0.22) earnings per share for the quarter, missing the Thomson Reuters’ consensus estimate of ($0.18) by $0.04. The company had revenue of $1.01 million for the quarter, compared to the consensus estimate of $1.90 million.  Equities analysts forecast that  Xencor will post ($0.74) EPS for the current year. \n\nXencor, Inc. is a clinical-stage biopharmaceutical company. The Company is focused on discovering and developing engineered monoclonal antibodies to treat severe and life threatening diseases. The Company uses its XmAb technology platform to create antibody product candidates designed to treat autoimmune and allergic diseases, cancer and other conditions. The Company’s product pipeline includes three lead XmAb-engineered antibodies, which include XmAb5871, XmAb7195 and XmAb5574/MOR208. XmAb5871 is indicated for the treatment of moderate-to-severe rheumatoid arthritis. XmAb7195 is the Company’s wholly owned program being developed for the treatment of severe asthma and allergic diseases. XmAb5574/MOR208 is being developed for the treatment of blood-based cancers.", "source": "WKRB News"}