{"published": "2015-09-10T01:04:44Z", "media-type": "News", "title": "Postal worker Steve Hodge, shot dead by police, not sacked but sick: union", "id": "05390a0b-392d-4113-b63f-cdaa90452372", "content": "An Australia Post worker who was shot dead after lunging at police with a knife on the NSW Central Coast was not sacked from his job on the day of the shooting, but had left work because he was feeling unwell, according to union officials. \n\nWarning: some people may find the attached video distressing\n\n﻿ \n\nSteve Hodge, a long-term Australia Post employee who had a history of mental health issues, on Wednesday afternoon in a tense confrontation with police that a witness recorded on a mobile phone camera.\n\nThe footage, taken about 3.15pm, shows police repeatedly pleading with Mr Hodge to drop the large knife he was carrying.\n\n\"C'mon mate. You don't want to do this ... Put it on the ground or we'll shoot,\" one officer can he heard saying, before Mr Hodge advanced on one of the officers with his knife raised.\n\nThree shots rang out and Mr Hodge fell to the ground. He died at the scene.\n\nIt has been reported that Mr Hodge was sacked from his job on the day of the shooting, before returning to the post office that afternoon with the knife.\n\nHowever, the Communications, Electrical and Plumbing Union (CEPU), which represents postal workers, said Mr Hodge, a union employee, had not been terminated from his job.\n\nInstead, Mr Hodge had gone home from work that day \"because he was unwell\", a union spokesman said.\n\nAn Australia Post spokesman said the organisation was providing counselling and support to staff following Mr Hodge's death.\n\n\"We are saddened by the loss of a valued, long-term team member and our thoughts are with his family and colleagues,\" the spokesman said.\n\n\"We will do everything we can to provide them with support at this difficult time, and we are providing counselling services to our staff and customers.\n\n\"Nothing is more important to Australia Post than the safety of our people and we will work with relevant authorities to thoroughly investigate all aspects of this tragic event.\"\n\nCEPU branch secretary Jim Metcher said that Mr Hodge was \"always held in high regard and supported by his colleagues\".\n\n\"Our thoughts and prayers are with his family and friends along with our local retail members who have been subjected to this horrific ordeal,\" Mr Metcher said.\n\nWith the Newcastle Herald The story first appeared on The Sydney Morning Herald.", "source": "Nambucca Guardian News"}