{"published": "2015-09-08T14:06:47Z", "media-type": "News", "title": "Hypocrisy of UC Berkeley liberalism is unacceptable", "id": "87f46866-cdfc-4dfb-8b62-db336860f03e", "content": "“Don’t take this class if you believe the Bible is inspired or infallible.” \n \nWhen I started taking classes a year ago as an entering doctoral student here at UC Berkeley, I knew I was entering a very liberal environment. I had heard that the campus was the flagship of liberal academia, and I was also familiar with other bastions of liberalism during my time in the Ivy League and at Oxbridge as an undergraduate and a master’s student, respectively. But despite UC Berkeley’s ultra-liberal reputation, I took it as a given that there was still significant latitude for free thought and expression in the classroom. \n \nThus, I was not expecting the unapologetically heavy-handed double standard I encountered from the professor, a well-respected biblical scholar. His initial cutting remark within five minutes of the start of class was soon followed by more: “This stuff isn’t taught in synagogues or churches because they don’t want to piss people off. … Anyone can take this class, as long as you play by the rules of the game. … If you disagree with the approach we use, that’s an F.” \n \nI was shocked — not only by his contempt for religion but also by the fact that he wasn’t even trying to be subtle about his narrow-minded academic approach. Apparently, free thought and academic curiosity were off limits from the get-go. “I don’t want people who are going to disagree with me all semester,” the professor declared in no uncertain terms. \n \nTo be fair, part of me understood where my professor was likely coming from. After all, as Thomas Kuhn writes in his classic book “The Structure of Scientific Revolutions,” prevailing paradigms within any disciplinary study (including the study of the Bible) demand adherence to certain assumptions or ground rules that allow the field to advance within that paradigm. Thus I understood that my professor probably wanted to operate within a historical-critical framework of studying the Old Testament without having to deal with students questioning the fundamental basis of that approach to literary criticism. \n \nKuhn, however, also points out that paradigms are often flawed. \n \nSo, undeterred, I politely peppered my professor with questions to try to better understand his intellectual paradigm. Just to be clear, there is a correct answer you want us to accept, I asked. “Correct.” What about rigorous biblical scholarship claiming, for instance, that Moses did, in fact, write the vast majority of the Pentateuch? “That doesn’t exist.” It does, I argued. “I don’t want people who are going to disagree with me all semester,” he repeated. I thought a university was an environment in which multiple viewpoints and debates were encouraged, I countered. “Not in this classroom” came the maddeningly smug response. \n \nAfter the class, I was left shaking my head, a mixture of indignation, sadness, confusion and frustration exploding inside me. As I packed up my things, other students came over to me and thanked me for my questions, explaining that they, too, were upset about the professor’s overly harsh attitude toward religion and religious students. We all felt the arrogance of the professor and the injustice of the situation, but did not know what to do about it. \n \nAs I have continued to process the encounter over the past year, I have realized that the attitude and ultimatum of my professor troubled me for two major reasons. \n \nFirst, I was deeply troubled by the hypocrisy of a famously “liberal” school employing such a closed-minded professor. In fact, the professor’s actions ran directly counter to the stated diversity values of the University of California. According to the UCnet website , “Diversity is a defining feature of the University of California and we embrace it as a source of strength. Our differences — of race, ethnicity, gender, religion, sexual orientation, gender identity, age, socioeconomic status, abilities, experience and more — enhance our ability to achieve the university’s core missions of public service, teaching and research. We welcome faculty, staff and students from all backgrounds and want everyone at UC to feel respected and valued.” Not only did the professor make no effort to value students with academic and religious perspectives differing from his own, but he actively persecuted us, essentially forcing us to drop his class or suffer. \n \nSecond, the fact that religious persecution was flaunted so unabashedly by a well-established professor in front of an entire classroom of students — at the premier public university in the world, no less — speaks to a teaching culture that, at best, tacitly acquiesces to his attitude and, at worst, actively encourages it. This was certainly not the first class this professor has taught, nor is he the only professor to openly criticize religion in a UC Berkeley classroom, nor is UC Berkeley the only campus where this type of persecution is a problem. A number of my friends, at UC Berkeley and other universities, have experienced similarly hypocritical discrimination based on their unpopular religious or scholarly perspectives, thanks to a certain “liberal” fundamentalism as narrow-minded as any conservative, religious fundamentalist. Such a deep-seated posture of indifference toward the religious and academic freedom of students — in general, but particularly for those of strong religious faith, who are often the minority — is shameful and outrageous. Everyone deserves a seat at the table. \n \nAs Kuhn points out, recourse to criteria outside existing paradigms is essential when two schools of thought are in competition with each other. After all, what better place to explore the intricacies and nuances of competing academic paradigms than the modern university? The permission to explore, think and argue is invaluable in both advancing scholarship and protecting religious freedom. As such, the “liberal” double standard — by which all views and scholarship is permissible and encouraged, except those deemed too traditional, passe or otherwise unpalatable for the sophisticated 21st century thinker — is simply unacceptable at the modern pluralistic university. \n\nDavid Kurz is a second year doctoral student at UC Berkeley.", "source": "Daily Californian"}