{"published": "2015-09-01T22:13:11Z", "media-type": "News", "title": "Lawyers in DUI set-up could have come clean", "id": "6322c6b2-f4a6-43a6-bb98-2647a3149452", "content": "For three Tampa attorneys gone rogue, it's about to end as badly as possible. But maybe it didn't have to. \n     \nThe judge overseeing the infamous disciplinary case against attorneys Stephen Diaco, Robert Adams and Adam Filthaut is recommending what amounts to a career death sentence: All three should be disbarred for good for plotting and pulling off the DUI arrest of opposing counsel one night after court. \n \nI say one night, though according to testimony, weeks earlier one of them tried to get attorney C. Philip Campbell similarly arrested with the help of a friend who was a sergeant on the police DUI squad. There was a stakeout, though Campbell wasn't stopped that night. \n \nBut you know what they say: If at first you don't succeed, try, try again — next time, with the help of a comely undercover paralegal cozying up to your mark at a dark downtown bar. \n \nNow a state Supreme Court that does not look kindly upon lawyerly high jinks that embarrass the profession will decide punishment for the three. \n \nSo how about a what if. \n \nWhat if, instead of insisting they were upstanding citizens acting nobly to get a drunk off the streets that night, these three stepped up and admitted what they did? \n \nWhat if, once accused and confronted with damning evidence, they stopped behaving like high-powered hot dog lawyers who never met a line they wouldn't cross? \n \nWhat if they said they got caught up in a bitter, high-profile, high-stakes court battle and made a terrible, grievous mistake? \n \nIn a different but also notable story involving attorneys, the Times ' Susan Taylor Martin reported this week that the Bar is hiring a public relations firm to the tune of $96,000. Critics fear most of that money will got to putting a positive spin on controversial \"reciprocity.\" In lawyer-speak, that's letting out-of-state lawyers ply their trade here without taking the Bar exam. Plenty of Florida lawyers do not like this idea, since our state is already thick with lawyers and law schools churning out more. \n \nImagine the Bar instead spending that kind of money on, say, free legal services to people in need. That could help offset the damage done to their image by lawyers gone wild. \n \nSo back to what did and did not happen in the Diaco deal. The Florida Bar, which acts as prosecutor, often settles disciplinary cases short of trial, particularly when there is contrition. This happens sometimes in cases involving lawyers with substance abuse issues, though rarely when client money has been stolen. The Bar appears to have zero sense of humor on that subject. \n \nIn fact, the Bar had been ready to agree to plea deals in this case — Diaco disbarred for at least five years and 91 days for the other two. But nowhere in those deals did the lawyers accept responsibility for what they were accused of. The judge rightly rejected them. \n \nYes, an FBI investigation continues into the DUI set-up, and that's enough to give the lawyers for the lawyers pause about their clients coming clean. \n \nBut all that ugly evidence against them would be laid bare either way — as the judge put it, evidence of \"a deliberate and malicious effort to place a heavy finger on the scale of justice.\" \n \nSue Carlton can be reached at carlton@tampabay.com.", "source": "Tampa Bay Times"}