{"published": "2015-09-21T03:12:17Z", "media-type": "News", "title": "Special golf tournament adds new element this year", "id": "36981ef2-ed1a-49d8-a5be-34bfe3f18c4a", "content": "The EnVision It Golf tournament is continuing to grow.\n\nThe fourth affair was held at the Quarry Golf Club on Sunday and 44 golfers, including those visually impaired, blind and sighted, participated on 10 teams in a shotgun scramble format.\n\nMoney raised from the fundraiser went to help run programs for local visually impaired and blind individuals to enable them to live life with vision loss. There was an added attraction to this year’s event.\n\nWith several people from TandemEyes golfing this year, event organizer Pam Struwing said they were able to present them with a cheque for $1,500 to go toward the cost of a new tandem bike.\n\n“This was a surprise for them and we were happy to do it,’’ said a smiling Struwing. “It meant a lot to us.’’\n\nStruwing also said there were plans to start a visually impaired curling group this winter. They are also looking into bowling and water skiing.\n\n“I am so excited to be able to start helping other programs now,’’ she stated.\n\nThe golf tournament has been a successful venture with between $12,000 to $15,000 raised the first three years, about $4,000 last year.\n\nWith a theme of a lack of sight is not a lack of vision, the tournament featured nine holes of golf, cart rental, dinner, silent auction and an opportunity to golf with other golfers including a list of celebrities, including wildlife artist Eddie LePage, former CKPT morning host John Mariasine and Chemong Lodge owner Doug Northey.\n\nThe tournament featured a group who took lessons for the visually impaired, blind and those who coach them at the Tamarac Golf and Country Club in Ennismore.\n\nStruwing stated it was about helping the visually impaired live their life to the fullest with vision loss and raise awareness that being visually impaired didn’t have to be a disability.\n\nThere was a silent auction and door prizes at yesterday’s tournament, including a blind golf challenge where participants donned special glasses mimicking vision loss for a one shot challenge for a golf bag. The longest drive contest was on a hole in memory of Peter DeCarlo.\n\nThe Quarry offered a getaway for two as one of the prizes.\n\n“People are starting to recognize what people with visual impairment can do,’’ said Struwing.\n\nPeterborough’s Maija Tuohimaa, 58, developed retinitis pigmentosa 25 years ago and said taking part in the tournament for the first time was a phenomenal opportunity and she thoroughly enjoyed herself. She was assisted by her husband Teuvo.\n\nThe Ontario Visually Impaired Golf Association (OVIG) assisted in setting up the tournament. OVIG is a branch of the Canadian Council of the Blind, bringing visually impaired people in Ontario together to learn and play the game of golf.\n\ndale.clifford@sunmedia.ca", "source": "Peterborough Examiner"}