{"published": "2015-09-08T08:07:49Z", "media-type": "News", "title": "Listen up: Japan needs startups now more than ever", "id": "b73866a0-375d-42b5-b35a-78f9c47c6f9d", "content": "Jesper Koll \n \nWhen we talk about startup and entrepreneurial activity in East and Southeast Asia, the countries that readily come to mind are Singapore, Malaysia, and Indonesia. Despite the fact that Japan is the world’s third-largest economy, the startup ecosystem in the country isn’t on par with its counterparts. \n \nBut that may soon change. Jesper Koll, CEO of Wisdom Tree Investments, opined the country is at the “beginning of a new golden age.” Speaking today at Tech in Asia Tokyo 2015 , Jesper said prospects for the next five to 10 years are extremely promising, and Japan is now poised to offer entrepreneurs a significant return for their blood, sweat, and tears. \n \n“Japan is unbelievably rich in intellectual property,” said Jesper. “R&D as a share of national income stands at 3.4 percent of GDP, compared to Germany at 2.5 percent, and China at 1.5 percent.” \n \nEncouragingly, 82 percent of all research activity in Japan is undertaken by the corporate and private sectors. This stands in stark contrast to the US, where the majority of investment in research is done by the government, the results of which are unavailable to entrepreneurs and startups. \n \nThe relentless focus on innovation is also starting to pay off in some “weird industries,” claimed Jesper. Japan is on track to recover and become the world’s largest shipbuilder in a few years. This is because corporate Japan never lost focus, continued to invest in research, and is now reaping the rewards for this approach. \n \nThe depreciation of the Japanese yen, while not welcomed by all citizens, is nevertheless a positive indicator and one which may well encourage more entrepreneurial activity. Rice, a staple across most of Asia, is cheaper in Japan than in China. This means the agricultural sector is competitive and agricultural engineering is a vertical that offers significant opportunity. \n \n“In general, Japan has priced itself back into the global economy,” said Jesper. \n \nThe weak yen also means minimum wage in the country is lower than the US and UK. This helps reduce upward price pressure. \n \n\n Stability is key  \nJesper highlighted the fact that in the past 30 years, Japan has only seen two prime ministers that governed the country for a sustained period of time. Political and regime stability is fundamental for investor confidence. Hence, the longevity of current prime minister Shinzo Abe will prove to be beneficial for businesses in the long run. “Whether you like Abe or not […] the government is unequivocally pro-business. They’re trying to reduce corporate taxes, mobilize capital, and they have longevity. There’s no uncertainty of whether rules might change in the near future,” he said. \n \nAs for macroeconomic factors, an important point Jesper highlighted was how Japan currently has a savings and labor deficit, unlike previous trends. This deficit is actually positive news for entrepreneurs as it necessitates thinking, strategizing, and foresight. How do you reorganize capital and labor to be more productive? As Japan is a net deficit country, it is more dependent on global capital than ever to maintain existing quality of life. As a result, opportunities for both international and domestic entrepreneurs open up. \n Ageing demographic an opportunity  \n“Look at the ageing population as a potential market,” Jesper told the audience. “Make products and conceptualize solutions, which will be needed by this segment.” \n \nJapan’s young population is shrinking – by 231,000 people every year in the 25 to 35 age bracket. Jesper said this shortage actually creates competition. It’s important to do something sensible and mobilize the population. \n \nIn the meantime, the job market in Japan is heating up. The overwhelming majority of fresh college students are finding work several months before they graduate. Moreover, Japanese students are debt-free, meaning they have disposable income. Because of new regulations and cultural shifts, the trend of lifetime employment is also almost over. The salaryman phenomenon is as good as dead, said Jesper. \n \nThere’s a huge premium to be an entrepreneur. \n \nJapanese companies less than five years old have created over two million jobs. Those between five to 10 years of age have contributed another 500,000 jobs. And companies 10 years and older have actually destroyed jobs. For the well-being of Japan, Jesper urged entrepreneurs to start a company there. \n  \n Editing by Judith Balea and Michael Tegos", "source": "Tech In Asia"}