{"published": "2015-09-24T12:48:19Z", "media-type": "News", "title": "Belarusian, Indian industrial companies to bring common brand to third-country markets", "id": "da26a5c8-1a30-49f3-a819-89c348687d2a", "content": "(BelTA) – Industrial companies of Belarus and India intend to enter third-country markets with a common brand. Belarusian Deputy Industry Minister Dmitry Korchik made the statement during the online conference hosted by the BelTA website on 24 September. \nThe official noted that during the latest session of the Belarusian-Indian intergovernmental commission the sides discussed the establishment of Belarusian industrial enterprises in India using the economic conditions the Indian side offers. Apart from that, an agreement to start assembling Belarusian tractors in India was signed. “As far as assembly enterprises are concerned, we are now looking into the matter together with Indian partners. It is necessary to decide on joint actions in October because there are certain peculiarities to take care of. As you know, India is an internationally recognized leader in tractor manufacturing. The country puts serious effort into developing the automobile engineering industry. We should find a joint niche, a joint product in order to get it made at assembly enterprises in India,” explained the Belarusian Deputy Industry Minister. \n\nAt the same time shipments to third countries — Africa and Asia — where India already enjoys certain influence are under consideration. “We are talking about a new product in the countries where Belarus is not present for now while India has achieved certain success. We plan to reach those markets with a joint brand, a joint product in order to further develop our export geography. We cannot stay idle in this regard. It is necessary to act as fast as possible to agree business operation terms with the partners, to make up our minds on the products we are going to assemble together, and the technologies and conditions for setting up the joint ventures. The work has to be completed in H1 2016 at the latest,” informed Dmitry Korchik. \n\nThe official also said he stays in touch with Indian partners of the Belarusian automobile manufacturing company BelAZ. There are plans to set up a service center by the end of the year. It will allow shipping more mining vehicles. “Those are complicated vehicles. It would be very hard to sell them in this region without comprehensive aftersales service,” explained the Deputy Industry Minister. \n\nThe official pointed out that just like China and Pakistan India represents a serious market for Belarus. Among other things Belarus intends to be part of the Make in India program. “The program is a major step on the part of the Indian government to attract investors, develop the manufacturing industry and other ones. India has created the program to get investments and create jobs. The country does not want to import merchandise. India wants to make it instead. It is a good offer for us,” Dmitry Korchik was convinced. \n\nIn his words, the Make in India program provides for creating more attractive conditions — customs, taxation, transport, and manpower ones — for foreign companies. Belarusian companies such as MTZ, BelAZ, MAZ, and Gomselmash can take part in the program.", "source": "Belta"}