{"published": "2015-09-22T07:10:08Z", "media-type": "News", "title": "Eastern and Western Medicine Combine Forces at Texas Fertility Center", "id": "428cb9cf-1e66-469f-a719-f99c73abe6c3", "content": "PRWeb \nTexas Fertility Center (TFC) and its newest South Austin fertility clinic now offer patients the convenience of on-site acupuncture as an adjunct therapy to infertility and andrology services. Dr. Natalie Burger heads up the South Austin fertility clinic and refers her patients to Sage Acupuncture and Axis Acupuncture. \n\n\"With the opening of the South Austin fertility clinic , we realized that we were in a unique position to share space with reproductive acupuncturists,\" Dr. Burger said. \"At TFC, we regularly refer to these holistic clinics, and now our patients can truly reap the benefits of integrated medicine without having to travel far for services.\" \n   \nThe MIT graduate, M.D. and board certified Reproductive Endocrinologist sees this as an opportunity to \"combine the forces\" of Eastern and Western medicine. Dr. Burger points to the Cleveland Clinic, a well-known academic medical center that has made it clear that it is open to the idea of a different approach to medicine--not Eastern or Western, but both. \n\nWhile there is no direct affiliation between Texas Fertility Center and the acupuncture providers, the traffic flows both ways in the hallway connecting the two offices. \"If I see a patient having issues with stress or unexplained infertility, I can suggest an appointment with an acupuncturist,\" Dr. Burger explains. \"Conversely, if Sage and Axis have patients struggling with infertility, they know that we can help with basic treatments or advanced reproductive technologies.\" \n\nThe ideal fertility patient for acupuncture \n\nDr. Burger says acupuncture may be appropriate in a number of scenarios. The South Austin fertility specialist, named to the Best Doctors™ in America list, considers acupuncture for anyone experiencing the negative effects of stress , and those presenting with a very low egg count (oftentimes related to maternal age) or an unexplained cause of infertility. \n\nAcupuncture is a nice transition from minimally invasive to more advanced options, she says. \"If a woman needs to move to a more intense treatment, she will likely feel better prepared for the rigor and stress because of acupuncture.\" \n\nMost acupuncture and infertility studies explore stress reduction or how acupuncture affects IVF success rates. It appears that acupuncture may lead to an improved egg count, and so fertility specialists commonly recommend the therapy for women of advanced maternal age to optimize egg yield with IVF. \n\nWhen Dr. Burger refers a patient to Sage or Axis, the therapist may recommend an acupuncture regimen of one or two appointments per week. Visits also incorporate nutritional advice and wellness strategies. Patients usually report benefits and fertility improvements after two to three months of acupuncture treatments. \n\nAbout Dr. Natalie Burger \nDr. Burger is an experienced fertility specialist and noted researcher who joined the TFC team of physicians in 2007. She provides basic and advanced infertility treatment options, including preimplantation genetic diagnosis , donor services, ICSI and fertility preservation, at the TFC South Austin fertility clinic at 5000 Davis Lane, Ste. 100, Austin, TX 78749. Contact the clinic at 512-451-0149 or visit http://www.txfertility.com . \n\nAbout Texas Fertility Center \nTexas Fertility Center (TFC), one of the nation's leading full-service infertility practices, provides advanced infertility and Reproductive Endocrinology services to patients throughout Texas, the Southwestern United States and the Americas. Since 1980, TFC has been recognized nationally for outstanding pregnancy rates, cutting-edge laboratory procedures and innovative research programs. \n\nRead the full story at http://www.prweb.com/releases/2015/03/prweb12562671.htm \nPRWeb.com", "source": "Town Hall"}