{"published": "2015-09-10T08:00:00Z", "media-type": "News", "title": "James Pattinson wants to form pace battery with Mitch Starc and Pat Cummins", "id": "cc1d5da9-8c54-49ba-b497-4fc64c8d317e", "content": "Fast bowler James Pattinson hopes his two-year battle to get fit has only improved his game. \n\nLeeds: James Pattinson hopes his recent appearance for Australia alongside Mitch Starc and Pat Cummins heralds the start of something lasting, with a rare appearance by all three simultaneously fit and well.\n\nFast-bowler Pattinson was wicketless from six overs in his comeback to international cricket on Tuesday. Nevertheless, he was happy with his pace and, more significantly, that he was able to put into practice the remedial tweaks to his bowling action he needs to ease pressure on his back.\n\n\"They are [coming naturally]. That was a big goal of mine,\" he said. \"Last year I was still thinking about my action.\n\n\"Now my attention has gone away from that to actually concentrating on the batter and trying to find a way of getting the batter out.\"\n\nHe is more relaxed about the future. \"I think you can get caught up in wanting everything to happen now. But look at someone like Mitchell Johnson, who debuted at my age, at 25, he's had a great career.\n\n\"As a fast bowler you've got to look to the future a bit and know that most fast-bowlers go until they're 35, and for me that's 10 years away.\n\n\"I've just got to build everything up and build up a really solid foundation, which I've done in the gym over the last couple of years. Hopefully it allows me to play a lot of cricket now.\"\n\nPattinson has made only one Test appearance since being withdrawn midway through the 2013 Ashes after injuring his back. In that next appearance in 2014, in Cape Town against South Africa, he played an important role in Australia's victory but suffered another back injury that forced him again on to the sidelines.\n\nThe 25-year-old hopes his two-year hiatus has been good for his game.\n\n\"It might be a blessing in disguise. Hopefully it gives me an extra two years at the back end of my career when I really will know my game,\" he said.\n\nPattinson, Starc and Cummins each made their Test debut within a fortnight of each other in late 2011: Cummins in Cape Town against South Africa, Pattinson and Starc in Brisbane against New Zealand.\n\nAll three – less so Starc – have battled injury, which has helped build camaraderie between them as they sought to support each other during their stints on the sidelines.\n\nPattinson hopes they are now at a point where they can build camaraderie through their shared on-field experiences.\n\n\"Hopefully now we're hitting that mid-20s mark . . . we can try and play some real consistent cricket together and really work on our games together,\" he said.\n\n\"That's the [crucial] thing – it's hard to learn and improve your game when you're not playing. The big thing for me now is to try and get better by playing games and being in those situations.\" The story first appeared on The Sydney Morning Herald.", "source": "Albury Border Mail"}