{"published": "2015-09-17T11:23:00Z", "media-type": "News", "title": "Vandals paint anti-Islamic messages on Louisville mosque", "id": "59ebad24-3c4b-4d4b-a030-e08539bc9f85", "content": "LOUISVILLE, KY (WAVE) – Red spray paint was used to write several anti-Islamic messages on the exterior of a building of worship.\n\nThe vandalism was discovered Wednesday afternoon at the Louisville Islamic Center, located in the 4000 block of River Road.\n\n[MORE: Children getting drunk on hand sanitizer]\n\nCurse words and a Star of David were among the graffiti sprayed all over the Islamic Center.\n\nDespite the hateful messages, it didn't take long for members of the Jewish community to come to Mosque. Those who were there were quick to back their brothers and sisters of the Muslim faith.\n\nThe mosque has been a place of worship for the Muslim community of Louisville for years. But this, this is the first time it has been the target of vandalism.\n\nMuhammad Babar, a spokesman for the Louisville Islamic Center, sent the following letter to the city's Islamic community early Thursday morning:\n\nDear All,\n\nI know that this has been a long tiring evening for everyone. We knew that hatred will hit us one day but there was always a brink of hope that our community outreach efforts may deflect it away from us. But fact of the matter is that we are hit hard right here in our compassionate city of Louisville at a place that is center of tolerance and compassion.\n\nThis is the same house of God where few months ago we condemned acts of brutality committed by ISIS in the name of our faith. Today hate crime is committed by someone who shares the similar philosophy of hatred and bigotry like ISIS. This reminds us extremists belonging to every faith tradition share common thought process to further their agenda.\n\nBelieve me, we will come out even stronger as a community of people of faith and more importantly as Muslim Americans. USA is our home and nobody can scare us away from our adopted homeland. We love land of free more than ourselves and will not let anyone push us away as if we do not exist or if our voices do not matter. We will fight hatred and bigotry with compassion and love as Prophet Muhammad (pbuh), Jesus and Moses did centuries ago. God willing our compassion will overcome all kind of adversities and troubles that future may hold for us.\n\nA quick update on the proceedings of the evening. Police report has been filed with Indian Hills police and FBI is investigating it as a hate crime as well. We were also able to activate media at such a short notice and all four local tv channels (WHAS, WLKY, WAVE 3, WDRB), courier journal and WFPL ((NPR) have covered this incident. Tomorrow morning at 8.30 am, Mayor Fischer will hold a press conference at Islamic center along with local interfaith leaders. Most importantly, on Friday at 3.00 pm there will be a community cleanup to paint over the acts of vandalism at the Islamic center.\n\nWe are especially thankful to Mayor Fischer for his leadership and our law enforcement agencies for their prompt action. We also appreciate outpouring of support from many dear community friends including Tom Williams (Compassionate Louisville), Rhody Streeter and many others. Our own Maira Ansari as usual was at her best in supporting community.\n\nWe hope that you all will be able to join Friday's community cleanup with CHILDREN and YOUTH as they need to witness this act of compassion to understand that every adversity brings out something good. Unfortunately they will be facing tougher challenges than us in coming days and we need to prepare them for it.\n\nIn the end, we are lucky to call USA home as this the most tolerant place on earth as we know well what minorities are going through in our land of birth. May God keep you all safe and sound with families. Ameen.\n\nRegards,\n\nMuhammad Babar\n\nLouisville Mayor Greg Fischer, Councilwoman Angela Leet along with Babar and members of the Islamic faith announced a press conference for 8:30 a.m. Thursday at the Islamic Center.\n\nThe community plans to cleanup and paint over the graffiti at 3 p.m. on Friday.\n\nOfficers with the Indian Hills Police Department are investigating the case. Anyone with information about the vandalism is asked to contact Indian Hills police at (502) 893-1375 or the Louisville FBI Office at (502) 263-6", "source": "WNEM"}