{"published": "2015-09-21T14:32:04Z", "media-type": "Blog", "title": "Cakes & Cuts: Victory rolls", "id": "6ce39d04-05e4-433f-b833-4cffc94bdc13", "content": "Matching our deserts is such a fun way to enter into any party! In this second edition of our Cake & Cuts matching party series we are pairing miniature victory roll cakes (aka cinnamon rolls) with a victory roll hair style reminiscent of the 1940’s jubilee for classically fun fall style. Be the Betty of the brunch table with this simple match that boosts of golden hues and supreme style victory. First let’s start with the victory cinnamon rolls. These tasty little treats are one of my favorite sweets. I love cinnamon rolls because they are an acceptable form of birthday cake to eat everyday. Even for breakfast! A miniature version flecked with gold is a fabulous way to present sweets at any birthday, anniversary, shower, bakesale, or even a busy Monday morning. Victory Cinnamon Rolls To make these miniature victory rolls you will need: For the dough: 1 package (2-1/4 tsp) active dry yeast, 3/4 cup whole milk, warmed, 1/4 cup granulated sugar, 4 large eggs, 4-1/2 cups flour, plus more as needed, 1-1/2 tsp kosher salt, 6 tbsp unsalted butter, at room temperature, cut into chunks. For the caramel: 6 tbsp butter, melted, 1 cup firmly pack light brown sugar, 3 tbsp dark honey, pinch of salt, 1 cup coarsely chopped pecans. For the filling: 4 tbsp butter, at room temperature, 1/2 cup firmly packed light brown sugar, 1 tsp ground cinnamon. For the cream cheese icing: 2-1/2 oz cream cheese, softened, 3 tbsp milk, 1-1/2 cups powdered sugar, more if needed. Plus edible gold flakes. 1. Start by making the dough. In the bowl of a stand mixer, dissolve the yeast in the warm milk and let stand until foamy, about 10 minutes. Add the granulated sugar, eggs, flour, and salt. Attach the dough hook and knead on low speed, adding a little more flour if needed, until all your ingredients come together. 2. Toss in the butter and continue to knead until the dough is smooth and springy, about 7 minutes. Lightly oil a large bowl. 3. Form the dough into a ball, put it in the bowl, and cover the bowl with plastic wrap. Let the dough rise at room temperature until it is doubled in size, 1-1/2 to 2 hours. 4. While the dough is rising butter the pans, using a cupcake pan will give you a perfect mini cinnamon roll. 5. Make the caramel by stirring together the melted butter, brown sugar, honey, salt, and pecans. Divide and spread the mixture in each pan.\n6. Punch down the dough and dump onto a floured work surface. Cut the dough in half. Roll out each half into a rectangle about 10 by 15 inches. Position the rectangles vertically. 7. Fill the dough. Spread each rectangle with 2 tablespoons of the room temperature butter, then half of the brown sugar and half of the cinnamon. Take a pizza cutter or sharp knife and cut about 8 strips from each rectangle. 8. To make the center of each “victory roll” take one strip and starting at the end closest to you, loosely roll up the strip. Place the roll in the center of the pan. Coil two other strips around the center roll by joining the strip to the end of the previous one, until the cupcake pan is filled. 9. Cover the pans loosely with plastic wrap and let stand in a warm, draft-free spot until puffy, about 1 hour. 10. Preheat the oven to 350F. Bake until the victory rolls are golden brown, 12-18 minutes (watch for doneness sooner). 11. Let the cakes cool in the pans on a wire rack for 5 minutes. 12. While cakes are cooling, make the icing by whisking the cream cheese in a stand mixer until creamy. Add the milk and whisk until combined. Sift in the powdered sugar and whisk until smooth. Drizzle cream cheese icing over the top of each of the victory rolls adding small pieces of gold foil with tweezers as you go. Serve on golden plates and enjoy! Victory Roll Hair To make the matching victory roll hairstyle start with a clean head of wavy hair. 1. Take a 2 inch section from one side of the head (the best way to find a starting spot for this section is by lining it up with the outside eyebrow line). Back comb the section to add dramatic height to the hair. Spray 2. Take a smoothing comb and gently pull the section over the top front of the head smooth out the top while keeping the height underneath. 3. Use a curling iron to get a wide thick curl right at the end of this section and use a couple Bobbie pins to hold the curl into shape. Pair this fresh party look with pink lipstick for a nod to the perfect 40’s hostess in a completely modern way. Grab your sweet rolls and make a serious statement at brunch this week. Cinnamon roll recipe adapted from our own cinnamon roll birthday party cake. (Photography ©A Subtle Revelry by Jesy Almaguer | Hair Colorist – Karina Soto | Desserts – Vanilla Couture | Set – Cest Marie | Styling – Knock Your Wear | Models – Monica Paulina, Coquis Valdez, Julieta, Gaby, Anette Morgan | Assistant – Tania Rivera & Jaque Rdz) Like that? There's more!Cakes & Cuts: Pastel rainbow sand art hairSand art party cakecinnamon roll birthday cakerainbow waffles with pot-of-gold whipped creamSparkly heels can cure winter bluesBuilding indoor forts", "source": "A Subtle Revelry"}