{"published": "2015-09-07T19:48:15Z", "media-type": "News", "title": "'Senseless loss of a beautiful life'", "id": "e7157bbf-6ad4-477d-a4e4-14a0bb9ad9f5", "content": "Story highlights Family posts, \"We are devastated by this senseless loss of a beautiful life\" A man confessed to killing Dahlia Yehia, police in Nepal say Her body has not been found, according to authorities \nDahlia Yehia, 25, arrived in Nepal on July 20 to serve in Pokhara, where she was killed by a teacher named Narayan Paudel, according to Hari Bahadur Pal, the Kaski District Police superintendent:. \n\nPolice said Paudel confessed to beating Yehia to death, putting her body in a sack and dumping it in the river. Paudel, who met Yehia through a Couchsurfing website, said he killed her August 4, the superintendent said. Her body has not been recovered. \n\nThe site connects travelers with local hosts for accommodations. \n\nYehia, an art teacher, was backpacking through Nepal, according to the Facebook page of Sci-Tech Preparatory , a school in Austin, Texas, where she taught last year. \n\n\"The kids loved having her for their art teacher last year, especially the high school kids who went to the graffiti park downtown on city buses with their backpacks loaded with cans of spray paint!! We are all saddened by the loss of such a special spirit!\" a post read. \n\nPeople at the school are planning a memorial. \n\n\"Dahlia was an artist, art was pretty much an extension of her being,\" her friend Meghan Moharter said. \"She was incredibly talented.\" \n\nAfter the former art teacher appeared to be missing, her friends and family contacted the U.S. Embassy in Nepal. Local authorities launched an investigation. \n\nOn a Facebook page originally set up to \"Find Dahlia,\" her relatives said they had \"received word from the US Embassy that Dahlia's life has been taken from us.\" \n\n\"We are devastated by this senseless loss of a beautiful life,\" the page reads. \"For those who haven't had the joy of spending time with Dahlia, know that she is a giver, lover, and humanitarian, who devoted her life to others less fortunate both domestic and abroad. \n\n\"Even though Dahlia was taken from us much too soon, she surely made her mark on the world, and will be remembered lovingly by all of us.\" \n\nThe family quoted the Quran: \"Indeed we belong to God, and indeed to Him we will return.\" \n\nYehia went to Nepal after the April 25 quake , which killed more than 8,000 people and left hundreds of thousands homeless. \n\nCNN's Justin Lear and Mayra Cuevas contributed to this report.", "source": "CNN"}