{"published": "2015-09-07T10:20:23Z", "media-type": "News", "title": "Liberty Global and Volta Ventures Invest €2 Million in Amsterdam-based Startup LookLive", "id": "d7fc8ade-48fd-47bf-809d-3585279f30de", "content": "AMSTERDAM , September 7, 2015 /PRNewswire/ -- \n\nToday LookLive announced a €2M Series A funding led by Liberty Global Ventures and Volta Ventures. LookLive identifies items in TV shows and celebrity images, creating contextual shopping experiences for consumers, enhanced user engagement, and advanced advertising opportunities for brands and publishers. LookLive will use the new funding to accelerate platform development and partnerships with broadcast and consumer brands. \n\n\"We're excited about the LookLive Platform and what it brings to the online viewing experience,\" said Christopher Archer , LookLive CEO. \"From being able to shop characters' wardrobes in your favorite TV shows, to helping advertisers deliver more effective messages, this new funding will help expand our offerings.\" \n\nThe cloud-based LookLive Platform uses deep machine learning to identify products, such as apparel, shoes and accessories, in TV shows and images. These capabilities will soon include music, location, furniture, automobiles and other items. LookLive partners are using this contextually relevant content to deliver enhanced viewer experiences, drive online and offline sales, and deliver more effective advertising by embedding LookLive data into their digital video players, apps and websites. \n\n\"We are very impressed with the quality of the executive team at LookLive, who have experience at Amazon, Hyves, Backbase and Liberty Global,\" said Frank Maene , Volta Ventures Managing Partner. \"LookLive serves multiple uses, from consumers - who want to know the clothes Claire Underwood from House of Cards is wearing - to broadcast/operators - who want to create more engaging user experiences. With TV advertising under pressure to innovate, Looklive provides important metadata and insights to drive new revenue models for broadcasters and global brands.\" \n\n\"Working with best-in-class start-ups such as Looklive helps Liberty Global keep on top of the most innovative new ideas in the market while offering partners the scale and benefits of our expertise as a long-standing international TV platform operator,\" said John Paul , Managing Director, Advanced Advertising and Data at Liberty Global. \"Data and advanced forms of advertising support a fundamental part of Liberty Global's strategy and we look forward to developing and nurturing our relationship with Looklive to create new revenue streams.\"  \n\nAbout LookLive   \n\nLookLive creates highly relevant contextual information from entertainment and broadcast media providing new revenue opportunities for brands, broadcasters, media companies and cable/satellite operators. Using deep machine learning the LookLive Platform identifies the exact items in TV programs and attaches them to the video timeline. Currently focusing on fashion and apparel, LookLive is quickly expanding into furniture, travel, music, CPG and automotive. This new metadata is also used to leverage advanced advertising opportunities for both brands and television ad inventory owners. \n\nhttp://www.looklive.com   \n\nAbout Liberty Global   \n\nWe connect people to the digital world and enable them to discover and experience its endless possibilities. Our market-leading products are provided through next-generation networks and innovative technology platforms that connected 27 million customers subscribing to 56 million television, broadband internet and telephony services at June 30, 2015 . In addition, we served five million mobile subscribers and offered WiFi service across six million access points. \n\nLiberty Global's businesses are currently attributed to two tracking stock groups: the Liberty Global Group (NASDAQ: LBTYA, LBTYB and LBTYK), which primarily comprises our European operations, and the LiLAC Group (NASDAQ: LILA and LILAK, OTC Link: LILAB), which comprises our operations in Latin America and the Caribbean.  \n\nLiberty Global's consumer brands are Virgin Media, Ziggo, Unitymedia, Telenet, UPC, VTR and Liberty. Our operations also include Liberty Global Business Services and Liberty Global Ventures. For more information, please visit  http://www.libertyglobal.com \n\nAbout Volta Ventures   \n\nVolta Ventures Arkiv invests in young and ambitious internet and software companies in the Benelux. The fund's team, with active support from some 30 business angels, expects to make a substantial impact on every company it invests in by working with the founders and management to identify new markets and customers, hire senior talent, provide ongoing guidance and arrange further financing rounds. Volta Ventures Arkiv is supported by the European Investment Fund and ARKimedes-Fund II. \n\nhttp://www.volta.ventures \n\niOS App \n\nSOURCE  LookLive", "source": "Sys-Con Canada"}