{"published": "2015-09-07T10:02:25Z", "media-type": "News", "title": "Freo fans know not to boo Goodes, says Lyon", "id": "f4f91787-3e99-4590-8c9a-3b4c66b0de23", "content": "Swans star Adam Goodes will face Fremantle at Domain Stadium on Saturday \n  \nROSS Lyon says he does not feel the need to remind Fremantle fans not to boo Sydney Swans star Adam Goodes despite Domain Stadium beefing up its security for the qualifying final. \n\nDomain Stadium's management announced on Monday it would have 200-plus extra security staff in place for each of the two qualifying finals in Perth. They will also have a mobile security team that will be particularly focused on monitoring the crowd for any racist behaviour. \n\nGoodes is set play at Domain Stadium for the first time since he was booed vociferously in the round 17 clash between the Swans and West Coast. \n\nTwo fans were ejected from Domain Stadium during the match for two separate incidents of racial vilification. \n\nThe dual Brownlow medallist took a leave of absence following that game and missed the Swans' round 18 clash with Adelaide at the SCG. \n\nLyon coached Goodes when he was an assistant at the Swans in their 2005 premiership season. He made a strong public statement in support of Goodes following the round 17 incident. \n\nLyon said on Monday that there was no need to reiterate those comments as he felt Fremantle fans were aware of the consequences of booing Goodes. \n\n\"I don't have to reinvent any messages,\" Lyon said. \n\n\"I don't have to request anyone not to boo. I think it's clearly inappropriate to do it in the context of the past so if you choose to do that you are putting yourself at risk in terms of how you're viewed. \n\n\"There is no place for any form of racism or prejudice against anyone in AFL. \n\n\"It's not something we expect, it's not something we condone and I think everyone is really focused on football. \n\n\"If it becomes anything other than that, I'd be disappointed. But we'll focus on football and I'm sure Adam wants that. \n\n\"We won't be rolling out the red carpet for anyone. The Bloods will be the opposition, they're playing the purple and we're all going for a great spectacle of great AFL football. \n\n\"I just encourage everyone to make that be their motivation to attend the game.\"", "source": "Australian Football League"}