{"published": "2015-08-03T11:00:19Z", "media-type": "Blog", "title": "Summer 2015 Restaurant Roundup", "id": "3dffbbf6-4031-4b6f-ab30-0aa148838326", "content": "Rooftop seating at Taverna Agora \n  \nThis summer, there have been some big time openings in the downtown Raleigh Eats scene. One of them even puts us in the Guinness Book of World Records. \n \nFor a complete list of eats, drinks, and coffees in and around downtown, make sure to bookmark the DT Eats page . Try something new! \n \nFirst, here’s a flier for a new pop up sandwich shop, Linus and Pepper’s, that will be open for three weeks on Salisbury Street starting today. It’ll be student run and is backed by Jon Seelbinder ( Level Up Kitchen and Barcadium , The Architect ) who also is working on other projects in downtown. Read more about it in the N&O . \n \n\n  Pictured above is the rooftop seating at the new location for Taverna Agora . The restaurant moved from North Raleigh to 326 Hillsborough Street and that empty, shell of a building is now more lively than ever.  Ashley Christensen’s Death and Taxes has finally opened at the corner of Salisbury and Hargett Streets.  Christensen has also announced that she is working on a pizza restaurant that will be located next door to Poole’s Diner .  Now that the Charter Square south tower is complete , we’re waiting to see what Eschelon Experiences brings to one of the ground-floor spaces in the building.  Construction fencing is up where Whiskey Kitchen will go at the corner of McDowell and Martin Streets.  Near Person Street, Standard Foods may actually open. At least that’s what they say as they are now hiring.  Person Street Pharmacy has finished their makeover with a new cafe.   \n\n  \nPhoto of the back patio at the Raleigh Beer Garden a few days before opening. \n   In Glenwood South, Niall Hanley and Cliff Bleszinski have set a Guinness World Record for most beer taps. The Raleigh Beer Garden is now open and has 366 beer taps spread across two floors. The place is huge and should be quite a draw within and outside the city.  In 510 Glenwood, Big Boom is now open. The new restaurant is from Vincent Barresi, of Vincent’s Italian Cuisine fame in North Raleigh.  JMR Kitchens ( Taste , The Oak ) is opening up more. on West Street in the former Mantra location. The new restaurant will serve “Italian-inspired small plates.”  Near Moore Square, Treat is now open and serves Maple View Farm ice cream.  I’m still keeping track of Provenance , planned to open in the Skyhouse Apartments building.  The N&O reported that Larry’s Beans is opening up a retail shop in the same building.  Still in Skyhouse, Taz is opening up a convenience store (as he does) called Oak City Market.  A dive bar called Ruby Deluxe is opening on the 400 block of Fayetteville Street.  Renovation work is taking place at 313 West Hargett Street. Twitter chatter says a wine bar is in the works.  Zinda has dropped their restaurant concept and is focusing on being an event space and club.   \nSimilar Posts:   Fall 2014 Restaurant Roundup (October 29, 2014, 6 Comments)  Spring 2015 Restaurant Roundup (April 28, 2015, 1 Comments)  Winter 2015 Restaurant Roundup (February 9, 2015, 14 Comments)", "source": "The Raleigh Connoisseur"}