{"published": "2015-09-06T12:00:00Z", "media-type": "Blog", "title": "George Will: Out with Redskins ... and everything else!", "id": "61aa539a-21c3-4540-94dd-805c22ffc4f5", "content": "George Will: Out with Redskins ... and everything else! Sun, 09/06/2015 - 7:00am | George Will WASHINGTON — Autumn, season of mists and mellow fruitfulness, also is the time for The Washington Post and other sensitivity auditors to get back on — if they will pardon the expression — the warpath against the name of the Washington Redskins. The niceness police at the U.S. Patent and Trademark Office have won court approval of their decision that the team's name \"may disparage\" Native Americans. We have a new national passion for moral and historical hygiene, a determination to scrub away remembrances of unpleasant things, such as the name Oklahoma, which is a compound of two Choctaw words meaning \"red\" and \"people.\" Connecticut's state Democratic Party has leapt into the vanguard of this movement, vowing to sin no more: Never again will it have a Jefferson-Jackson Day dinner. Connecticut Democrats shall still dine to celebrate their party's pedigree but shall not sully the occasions by mentioning the names of two slave owners. Because Jefferson-Jackson Day dinners have long been liturgical events for Democrats nationwide, now begins an entertaining scramble by states' parties — Georgia's, Missouri's, Iowa's, New Hampshire's, and Maine's already have taken penitential actions — to escape guilt by association with the third and seventh presidents. The Post should join this campaign for sanitized names, thus purging the present of disquieting references to the past. The newspaper bears the name of the nation's capital, which is named for a slave owner who also was — trigger warning — a tobacco farmer. Washington, D.C., needs a new name. Perhaps Eleanor Roosevelt, D.C. She had nothing to do with her husband's World War II internment of 117,000 persons of Japanese descent, two-thirds of whom were native-born American citizens. Hundreds of towns, counties, parks, schools, etc., are named for Washington. The name of Washington and Lee University is no mere micro-aggression, it is compounded hate speech: Robert E. Lee probably saluted the Confederate flag. Speaking of which: During the Senate debate on the 1964 Civil Rights Act, when Virginia's Willis Robertson waved a small Confederate flag on the Senate floor, Minnesota's Hubert Humphrey, liberal hero and architect of the legislation, called this flag a symbol of \"bravery and courage and conviction.\" So, the University of Minnesota should seek a less-tainted name for its Humphrey School of Public Affairs. Princeton University can make amends for its Woodrow Wilson School, named after the native Virginian who aggressively resegregated the federal workforce. Jacksonville, Florida — a state where Andrew Jackson honed his skill at tormenting Native Americans — Jefferson City, Missouri, Madison, Wisconsin, and other places must be renamed for people more saintly. And speaking of saints: Even secularists have feelings. And the Supreme Court says the First Amendment's proscription of the \"establishment of religion\" forbids nondenominational prayers at high school graduations. What, then, of the names of St. Louis, San Diego, San Antonio and numerous other places named for religious figures. Including San Francisco, the Vatican, so to speak, of American liberalism. Let the renaming begin, perhaps for liberal saints: Gore City, Sharpton City. Tony Bennett can sing, \"I left my heart in Pelosi City.\" Conservatives do not have feelings, but they are truculent, so perhaps a better idea comes from Joseph Knippenberg, who is an American rarity — a professor with good sense and a sense of humor. He suggests that, in order to spare everyone discomfort, cities, buildings and other things should be given names that are inoffensive because they have no meaning whatsoever. Give things perfectly vacuous names like those given to car models — Acura, Elantra and Sentra. Unfortunately, Knippenberg teaches at Atlanta's Oglethorpe University, which is named for James Oglethorpe, who founded the colony that became the slave state of Georgia. So, let us move on. To Massachusetts and Minnesota, which should furl their flags. Massachusetts' flag shows a Native American holding a bow and arrow, a weapon that reinforces a hurtful stereotype of Native Americans as less than perfectly peaceful. A gimlet-eyed professor in Wisconsin has noticed that Minnesota's flag includes the state seal, which depicts two figures, a pioneer tilling a field, and a Native American riding away — and carrying a spear. A weapon. Yikes. The farmer is white and industrious; the Native America is nomadic. So, Minnesota's seal communicates a subliminal slander, a coded message of white superiority. Who knew that Minnesotans, who have voted Democratic in 10 consecutive presidential elections since 1972, are so insensitive? This is liberalism's dilemma: There are so many things to be offended by, and so little time to agonize about each. George Will's email address is georgewill@washpost.com. Sections (2):Columns, Opinion More Columns Jim Dey: SB 1229 battle mixes politics, policy George Will: Out with Redskins ... and everything else! Dan Corkery: The not-so-great future in plastics Esther Cepeda: Why it's called work More Columns Jim Dey: SB 1229 battle mixes politics, policy George Will: Out with Redskins ... and everything else! Dan Corkery: The not-so-great future in plastics Esther Cepeda: Why it's called work Comments News-Gazette.com embraces discussion of both community and world issues. We welcome you to contribute your ideas, opinions and comments, but we ask that you avoid personal attacks, vulgarity and hate speech. We reserve the right to remove any comment at our discretion, and we will block repeat offenders' accounts. To post comments, you must first be a registered user, and your username will appear with any comment you post. Happy posting. Login or register to post comments", "source": "News-Gazette.com"}