{"published": "2015-09-25T15:03:33Z", "media-type": "News", "title": "Tyson Fury sorry for fans as Wladimir Klitschko pulls out of heavyweight bout", "id": "4eec5d99-231d-406a-9604-527c339901c9", "content": "Tyson Fury said he feels for his supporters after his world heavyweight title challenge to Wladimir Klitschko was postponed due to the Ukrainian sustaining a calf injury in training. \n \r\n\t\t\r \nFury had been due to face Klitschko in Dusseldorf on October 24 but the bout will have to be re-scheduled following the announcement by Klitschko on Friday. \n\r  Tyson Fury's world title challenge to Wladimir Klitschko has been postponed. \r \r \nIt is the latest misfortune to befall Fury after two bouts against David Haye were postponed in 2013, and a domestic meeting with Dereck Chisora was also delayed last year. \n\r\n\t\t\t\r \nFury told Sky Sports: \"All my supporters and fans - they always lose out. \n\r\n\r\n\r\n\r \n\"It's all right for us - we're in training camps, we get our expenses back, but what about all the people who have travelled and paid money for the tickets. \n\n\"Things are hard. People are doing this because they're showing support, because some of my fans can't afford to go really, but they pushed the boat out because it's a massive occasion, a once-in-a-lifetime thing. \n\n\"I'm wounded for all these people and this happens too much in boxing, and it's not the fighters that pay for it, it's the fans. We get our bits and pieces back - they don't.\" \n\nKlitschko's announcement comes just two days after Fury dressed as Batman and wrestled a man dressed as The Joker during a press conference to promote the fight in London. \n\r\n\t\t\t\r \nKlitschko said he would aim to recover \"as fast as possible\" so that the contest can be re-arranged, with a new date expected as early as next week. \n\nKlitschko said: \"Especially after the exciting press conference last Wednesday, I was looking forward to this fight very much. I know that a lot of fans have already organised their trips to support me in Dusseldorf. \n\n\"I am so sorry that I am not able to fight on October 24. I also apologise to my opponent, who has spent many weeks preparing for this fight. I will do my very best to recover as fast as possible.\" \n\nKlitschko sustained the injury during a training session on Wednesday and a subsequent MRI scan revealed a partial musculotendinous tear of the left calf. \n\r\n\t\t\t\r \nKlitschko's manager Bernd Boente told the German newspaper Bild:  \"Next week we will make it known when the fight will be re-staged. \n\n\"We will definitely remain in Dusseldorf. The tickets which have already been sold will remain valid.\" \n\n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Scarborough Evening News"}