{"published": "2015-09-07T20:31:55Z", "media-type": "News", "title": "Posted: 10 hours agoComments (0)Beverly King tapped her foot along to “Devil Went Down to Georgia” and occasionally sang a phrase of the popular country tune “Friends in Low Places” sung by My Yellow Rickshaw on Sunday at the city’s Labor Day Bash in Shad", "id": "ecdd2a4a-34b8-47e5-b7f4-128b5c652c1e", "content": "ANDERSON – Beverly King tapped her foot along to “Devil Went Down to Georgia” and occasionally sang a phrase of the popular country tune “Friends in Low Places” sung by My Yellow Rickshaw on Sunday at the city’s Labor Day Bash in Shadyside Park.\n\nBut when the versatile Indianapolis-based band broke out its hip-hop medley spanning from the ‘80s to today, King jumped out of her red lawn chair to bust a move to “Gangster’s Paradise,” “Party Up (Up in Here)” and “Thrift Shop.”\n\n“I came out to party,” the lifelong Anderson resident said. “I am blessed to be here.”\n\nShe was one of hundreds of people who cascaded down the hill west of the playground at Shadyside on blankets and in lawn chairs to hear My Yellow Rickshaw and another popular Indianapolis band, Toy Factory.\n\nThe bash was one of several events around the county, including a concert featuring The Daddy-O’s at Elwood’s Callaway Park.\n\nSome brought their own refreshments, rolling coolers along the walkways and cooking out, while others took advantage of the vendors brought by the city to provide barbecue, ice cream and lemon shakeups to celebrate the last big holiday of the summer.\n\nMayor Kevin Smith also took the opportunity to mingle with the concert-goers.\n\n“Do you feel that sense of community?” he asked the audience. “That’s what Anderson is getting back to. That’s where we’re going.”\n\nAnderson residents Greg and Liza Pierce couldn’t wait to get the party started, dancing to the Michael Jackson recording “PYT,” Kool and the Gang’s “Celebration” and Beyonce’s “Love On Top” between bands.\n\nThe Pierces, and Anderson residents Bea Brumback and her daughter Meranda Turner, said having the event on the day before Labor Day was a good idea.\n\n“We wouldn’t be here tomorrow,” said Greg Pierce, who plans to cook out at home.\n\n“A lot of people have plans for tomorrow. I know we do,” Bea Brumback said.\n\nBrumback said she likes the many events the city offers, including the recent sesquicentennial events.\n\n“I participate in all of them all the time,” she said.\n\nLabor Day picnic\n\nThe Madison County Solidarity Labor Council’s annual Labor Day picnic is scheduled from 11 a.m. to 3 p.m. today at Beulah Park in Alexandria.\n\nFollow Rebecca R. Bibbs on Twitter at @RebeccaB_THB, or call 640-4883.\n\nWe have sent a confirmation email to . Please check your email and click on the link to activate your account.\n\nPlease confirm the information below before signing in. Already have an account? Sign In.\n\nWe've sent an email with instructions to create a new password. Your existing password has not been changed.", "source": "Herald Bulletin"}