{"published": "2015-09-24T01:20:32Z", "media-type": "Blog", "title": "Mille Lacs Lake walleye committee forms", "id": "49ae632f-598c-4b46-8fa7-60f41697dfc5", "content": "The Minnesota Department of Natural Resources released information Sept. 10 about how interested people can apply to be a member of the Mille Lacs Fisheries Advisory Committee that will work with the DNR on issues and programs relevant to Mille Lacs Lake. \nThe action comes in the wake of the DNR closing the lake to walleye fishing Aug. 3 because the fishing limits had been reached. Before the close, a community meeting on the potential of it drew 75 or so people anxious about their livelihood and way of life – walleye fishing – and angry about what some called mismanagement of the lake over the years. Gov. Mark Dayton visited Mille Lacs Lake after the meeting to learn more about the issues. \nThe DNR has released information in the past days and weeks relevant to the situation. \nWalleye committee forms \nAccording to news releases and DNR communications director Chris Niskanen, the committee is open to 12-16 people who may apply online at www.dnr.state.mn.us/millelacslake/index.html; scroll down to the underlined text link for “apply to serve on a newly formed Mille Lacs Lake Fisheries Advisory Committee.” People can also call 651-259-5221 for more information about the committee. \nThe deadline to apply is Sept. 24, when applications will be considered and DNR Commissioner Tom Landwehr will appoint the members. Niskanen said a media announcement of the new members would be made sometime before the committee’s first meeting Oct. 8. Members serve a two-year term of service, and the new committee replaces the Mille Lacs Fisheries Input Group, which was formed in 1997 and consisted of citizens and business owners from the Mille Lacs Lake area, the release says. \nMembership on the committee will include diverse angling interests such as local business, tourism, tribal, academic and local and county government. The DNR release said, “To improve openness and transparency of technical discussions, two committee members will also be asked to attend meetings of the state and tribal fisheries technical committee as observers.” \nLandwehr said in the release: “This committee will play an important role in furthering the dialogue about Mille Lacs Lake and focusing on issues relevant to the state’s management of the lake. We want committee members and the public to have a more structured and participative process to provide meaningful input, with a goal of reaching a shared understanding with the DNR about issues and potential solutions affecting the Mille Lacs Lake fishery.” \nPlan includes hatchery \nAn Aug. 27 news release says the DNR will work with the Legislature during the 2016 session to secure bond funding for a new fisheries management facility that will include a cool-water hatchery to be built in the Mille Lacs community. It would provide room for monitoring equipment and staff and accommodate educational and visitor functions, as well as be a place to hold public-information meetings. Niskanen said it is too soon to know when the hatchery might be built because the project is “still in the design and funding phase.” \nLocal fisheries office, project leader in the works \nUntil a new hatchery building is available, the DNR will lease an office in a community near the lake to house the project leader and other Mille Lacs Lake staff. The people will provide more capacity to monitor conditions, communicate with local stakeholders, help with hatchery and stocking efforts and help the community with outreach and marketing. Niskanen said the staff and location for the office have not yet been chosen but will be announced when in place. \nStock fish, stop cormorants \nThe DNR will stock walleye fry in Mille Lacs Lake in 2016 in a pilot effort to develop and refine techniques. A news release says stocking is not necessary, but the DNR wants to be ready to go if and when it becomes necessary. The pilot will help develop techniques to maintain the unique genetics of the lake, ensure that aquatic invasive species in Mille Lacs are not spread to other water bodies and identify appropriate stocking levels. The DNR staff will chemically mark walleye fry to study their survival throughout their life cycle. Egg-take, hatching and stocking will occur in spring of 2016. \nDNR information about Mille Lacs Lake also says the DNR is talking with the U.S. Fish and Wildlife Service to secure control permits for double-crested cormorants. Niskanen said the techniques for control will be determined in partnership with the USFWS but said in other state and national control projects, the birds are either shot or vegetable oil can be applied to their eggs to render them unviable. \nPromote alternates \nThe DNR release says it will promote other fishing opportunities in the lake, including northern pike, smallmouth bass and muskellunge plus the many recreational resources in the region, such as hunting lands, state parks, bike trails, ATV and snowmobile trails and paddling opportunities. The DNR and Explore Minnesota Tourism are collaborating on a “Do the Lake” outreach campaign.", "source": "The Princeton Union-Eagle"}