{"published": "2015-09-05T14:23:17Z", "media-type": "Blog", "title": "It is Saturday......Already.", "id": "a95d1701-d8a7-4dbd-93f8-1a5875e622bd", "content": "I have rare openings in my canopy of trees. When I do find an area to take a photo the trees frame the sky.  I have a very difficult time shooting any sky photo with out an electric wire cutting through it.  The clouds are light and fluffy but a cold front will be coming in today or tomorrow.  Those clouds will look a lot more threatening than what is shown here.\nWhen the shop class built my shed the instructor made a lot of changes on the building.  I turned in plans to the zoning people and the shop guy, Dale, reinterpreted it.  It was to be a shorter garden shed and he just decided to use full 8 foot lengths of wood on the walls.  It looked like a giant bird house that way it was proportioned to the floor size.  I then required him to add a porch, one that reminded me of the horse barns of the south.  I of course got a call immediately from the zoning guy having a fit over my garden shed.  He knew the shop teacher and when I explained it. The zoning guy knew he was a free spirit.  I offered to reissue the new plan with twenty bucks to shut the inspectors up but he finally backed off.  I was suppose to scold Dale and tell him the inspector was angry. It was just a shed and we are a poor old looking community.  The shed was making the town look better.\nOut of all the creativity of the shop teacher I had him add the window and he made the door.  The door I liked as it was a larger version of the original plan.  Dale the shop teacher died a few years back with heart problems but his work lives on.  He was younger than me.  The second shop teacher who was my friend also died this summer suddenly from a stroke. He also was younger than me. They could not replace him at school with anyone with a shop degree so the have switched the classes into agricultural classes with a woman teaching them this year. I will not become friends with the new agricultural teacher.  Here is the garden shed with its apple crop on the roof. When it cools this week I am going to start doing some serious picking.  The apples fall on the ground end up with a bruise that starts problems with the apples within a few days.\nI had a pair of wrens hatch out babies in the house but I never got a single photo of them this year.  I heard a lot of singing and I did see them come and go from the nest.\nI shared a single bloom from this miniature rose earlier and a couple of days later I found a full bouquet.  I do remember seeing all the buds around the single bloom but I never expected them to bloom all at once.  I am planning to bring it in this fall to keep it grown.  I have friends that leave them out all winter but I won't chance it this time.   It makes me more interested to pick up these small roses when there is a close out sale after a holiday.\n  I shared a photo of the crochet in the rough and now this is the mat that I cut for it.  The woman who makes these always makes a heart to go with the name.  After the first one that I did years ago I dug out my groove making tool and decorated up the mat some.  It got me into trouble as every crochet she made including the ones given to neighbors came to our gallery and I had to frame them and cut grooves in the mat.  She keeps bringing a photo of one that I did before for her neighbor to remind me how beautiful it looks with all the grooves.  Every time I have a laugh with my wife after she leaves. The photo shows the one where I cut way too many grooves because I was covering up a mistake.  This is actually the second mat I cut for this one in the photo.  I was cutting my final groove and the tool went shaky in my old hands and I ended up with a wavy line.  I don't get mad but I get tired.  I know that everyone in the entire wedding party and the world will notice that wavy line.  I tried to fix it and I ended up with an opening that looked like a Chevy symbol.   So I just started it all over again. No two of these kinds of mats are every done alike. The frame is made and ready for a finish today.  By Monday I will have the job done and I promise to share again.  I wish everyone a great weekend.  I hope that it includes the eating of something good along with a great beverage.  We have no big plans but will try to take things as easy as possible.   Thanks for stopping by today.", "source": "Larry's Creative Zone"}