{"published": "2015-09-29T10:33:00Z", "media-type": "News", "title": "Michelle Obama gives Stephen Colbert advice for the next first spouse", "id": "0ef6b514-620d-4e8a-9405-e390e16c6cd7", "content": "Obama dropped in on \"The Late Show with Stephen Colbert\" on Monday night, taking a break from the action at the United Nations to promote her \"Let Girls Learn\" campaign and joke with the host about state dinners and the next first family who could occupy the White House. \n\nColbert highlighted a letter to Obama by former first lady Laura Bush upon leaving the White House, asking, \"Without naming names, if we have a female president next, would you leave a letter for her husband? What would you say? What's the thing he needs to know more than anything else about the job?\" \n\nObama replied, \"I would say, follow your passion, just be you.\" \n\nWithout missing a beat, Colbert made an apparent jab at Bill Clinton, saying \"I think he does,\" prompting a big laugh from the audience. \n\nWhile Obama protested, \"That wasn't me! I didn't say it,\" Colbert added, \"I have never met Carly Fiorina's husband, but I imagine he's a lovely man.\" \n\nWith the White House recently wrapping up a visit from Chinese President Xi Jinping, Colbert took the opportunity to prod Obama about not getting an invitation to the high-profile state dinner held last Friday. Colbert, who attended a previous state dinner for French President Francois Hollande, quipped, \"Haven't heard from you much since then. You just had one with the Chinese president, didn't get the call.\" \n\nColbert also turned the conversation to Obama's international campaign for education equality, which the White House touts as \"a government-wide effort that will leverage the investments we have made and success we have achieved in global primary school and expand them to help adolescent girls complete their education.\" \n\nColbert highlighted his own advocacy on the issue at the Global Citizens Festival in New York, cracking, \"My issue for that weekend was girls' education around the world, and I'm not saying you're kind of jumping on my thing, but you are here to talk about 'Let Girls learn.' OK.\"", "source": "CNN"}