{"published": "2015-09-14T18:28:42Z", "media-type": "Blog", "title": "DREAM Big", "id": "b135908f-c85d-435e-a59a-f5eca4afcf10", "content": "I just got home from an amazing trip to Beaver Creek, Colorado. 4 days up in the mountains at an amazing resort working on business and working on self with my Mastermind Group. My spirit and energy are feeling refreshed, rejuvenated, reenergized and raring to go. \n \nIt was a special time up in the Rockies. We had approximately 70 fit pros from the TD Mastermind up in the mountains for our annual Fall Retreat. Besides these guys and gals coming from all over the country, we had one fit pro in from Australia (Scott Rawcliffe), one from Kuwait (Omar AlHamad), and one couple from north of the border (Duncan & Jenn Waller, Vancouver, CA).  The rest of the folks were from all over the country. \n \nWhile I have the opportunity to work with these great folks and the rest of their Mastermind teammates on a regular basis (on-line/virtually), there is NOTHING like a live meeting when we are all together. LIVE connect time is always BEST. \n \nThe theme of our retreat this Fall was “ DREAM the imPOSSIBLE .”  I challenged the Mastermind attendees to dream big. And to put pen to paper as I facilitated some deep personal development & business exercises over 2-days. It went deep. \n \nI also shared my dreams. I shared my BHAG’s (big hairy audacious goals). I shared my best practices. And I shared what is most moving my soul today. \n \nAnd I encouraged them to do the same. We had time to write.To journal. To listen. To be inspired. \n \nAnd we took time to work-out. To swim. To hike. To get massages. And go in the hot tub. \n \nAnd we had time to DREAM. \n \n\n \nThis week, the WOW is DREAM. \n \nYou don’t need to go to a world-class resort like the Westin Riverfront Spa & Resort to DREAM (although it doesn’t hurt!  ). \n \nYou can dream by: \n  Taking 10-20 minutes in the AM to journal and write down your DREAMS.  Getting out and going for a walk or run and listening to an inspirational podcast.  Visiting your local beach, nature-trail, mountain, or park and getting an outdoor workout.  Writing down your BIG 5 for Life & your BIG 5 for the Year . Your BIG 5 for Life ware the 5 things you want to achieve in your life. Your BIG 5 for the Year are the 5 things you want to achieve in the next year.   \nLastly, never underestimate the power of 2 more things: \n \n1.  Immersing yourself in a magical environment . When you put yourself in a “world-class” environment, it affects your mindset. You think world-class, you are exposed to world-class, and you THINK world-class. This can be at a resort, destination spot, or even a gym (like Fitness Quest 10  ). But seriously, this environment can be anywhere. It can be your home, your garden, or somewhere “simple” that stirs your spirit and moves your soul. \n \n2.  Surround yourself with “world-class” people. The folks in the Mastermind are world-class people. When I’m at Fitness Quest 10, the people are world-class, both teammates and clients. IT MATTERS! Who you put yourself around matters. Who your kids hang out with matters. Who YOU hang-out with matters. So spend more time with people thatbring out the BEST in you. And that support your dreams and visions. \n \nMy friends, DREAM this week. Eat well. Train hard. Surround yourself with people that inspire you. Listen or read messages that inspireyou. Eliminate “head trash” and junk in your life that is holding you back. \n \nAnd go out and be the BEST that you can be. Dream big this week and take action steps that will massively support your dream to happen. #IWILL \n \nMuch love…and many DREAMS. \n \nTodd \n \n  \n \nWANT TO USE THIS ARTICLE/BLOG IN YOUR NEWSLETTER, IN YOUR BLOG, OR ON YOUR WEBSITE? You can, as long as you include this complete blurb above with it. If you would like a Word Document of the article sent to you, please email us at  durkin@fitnessquest10.com to let us know and we will be glad to supply it to you.", "source": "Todd Durkin"}