{"published": "2015-09-08T15:13:39Z", "media-type": "News", "title": "ShipTrack Roadshow Sparks Attendance", "id": "1ee5e01f-973f-4e0e-ae8a-57f50c8d01bd", "content": "OTTAWA, ON, Sept. 8, 2015 (GLOBE NEWSWIRE) -- ShipTrack, an innovative track and trace platform designed to provide complete control and visibility of any shipment's movement worldwide, today announced they have extended their Simplify Your Business Logistics Roadshow. The coast to coast event series added additional dates and locations based on positive attendance and increasing demand for further sessions.\n\nWith ShipTrack, the simple, easy-to-use track and trace service provides highly accurate shipment tracking to the masses while maintaining affordability. The shipping system benefits businesses of all sizes by increasing delivery speed and reliability, improving customer service and retention, while streamlining their operations through ShipTrack's industry leading track and trace software.\n\nThe main objective of the event series is to introduce logistics professionals to ShipTrack through the means of a three-hour information sharing session designed to be engaging and interactive. A key feature is a moderated panel discussion with existing users which covers topics related to package, mail, shipment and other related types of tracking.\n\nThe event attendance has included Business Process Managers, Business Owners, and IT Directors who are in charge of firms where shipping, parcel, courier and other types of tracking is at the core of their business needs. During the roadshows, attendees received firsthand knowledge of how ShipTrack can help their businesses stand out from the competition using ShipTrack's unique track and trace software, increase customer satisfaction through advanced tracking, and improve driver safety by tracking drivers which helps eliminate redundancies. Attendees also learned ways that ShipTrack can enable businesses to lower cost structures, offer new services, and capitalize on the explosive growth of e-commerce.\n\n\"Attendees were enthusiastic about the ability to support Bring Your Own Device (BYOD) initiatives and that delivery drivers can simply use their own smartphones. When they became aware of the fact that with ShipTrack they do not have to invest in purchasing, training, or managing additional devices, they definitely saw value in reduced operating costs and increased profit growth.\" said Brock Gourlay, VP of Business Development at ShipTrack.\n\n\"ShipTrack has changed the way retailers, logistics firms, distributors and manufacturers are facing the challenges and opportunities of last mile delivery.\" said Shawn Winter, Chief Marketing Officer at ShipTrack. \"With engaging content developed for customers' specific needs, the ShipTrack event series helps businesses find the strategic insight and solutions they need to leverage a transportation management platform to transform their businesses.\"\n\nThe next stop in the Simplify Your Business Logistics Roadshow will be in Halifax, Nova Scotia on Tuesday September 15th, 2015. For additional information on future dates and locations and to register, please contact info@shiptrackapp.com. Space is limited per location and early registration is recommended to avoid disappointment.\n\nAbout ShipTrack\n\nShipTrack is an innovative logistics track and trace management platform that provides complete control and visibility of any shipment's movement worldwide. ShipTrack enables vendors all over the world to provide complete visibility and control that their customers demand of their deliveries. ShipTrack is a simple, easy-to-use service that provides highly accurate shipping tracking to the masses. The shipping system has the potential to benefit companies of all sizes by increasing delivery speed and reliability, improving customer service and retention, and streamlining operations. The ShipTrack smartphone app is an industry leading real-time shipping tracker that allows for easy management of multiple drivers, deployment of a fully branded web portals, and the collection of valuable reports and business metrics. \n\nA photo accompanying this release is available at: http://www.globenewswire.com/newsroom/prs/?pkgid=35861\n\nCONTACT: Shawn Winter\n\nChief Marketing Officer \n\nshawn.winter@shiptrackapp.com\n\n+1.613.679.4377", "source": "IT Business Net"}