{"published": "2015-09-07T13:55:47Z", "media-type": "News", "title": "Germany, France Announce Plans To Welcome Thousands Of Migrants", "id": "8c1392a2-c8c3-4337-8bf5-2b9bcc4680c0", "content": "A vonlunteer hands over care bags to refugees at the Central Registration Office for Asylum Seekers in Berlin Monday. The numbers of migrants have spiked since Sept. 4, when Austria and Germany threw open their borders and eased travel restrictions to allow in thousands who had made it to Hungary, which has balked at the influx. \n \nTobias Schwarz, AFP/ \n  \nAfter a weekend in which tens of thousands of Syrian war refugees and other migrants reached Austria and Germany, Chancellor Angela Merkel says Germany is putting 6 billion euros ($6.7 billion) toward coping with the influx; France has committed to receiving 24,000 migrants. \n\nIt’s all part of a scramble to accommodate a portion of the more than 322,000 migrants the U.N. says have reached Europe from Syria and other countries, in a humanitarian crisis that has set off tensions between European Union nations. \n\nIn Britain, Prime Minister David Cameron is poised to announce a plan to accommodate Syrian refugees, the BBC  reports. \n\nMost of the migrants have crossed the Mediterranean Sea, hoping to find safety and the prospect of a brighter future in Europe. So far in 2015, more than 200,000 people have reached Greece and another 100,000 reached Italy, the U.N. says. From Greece, thousands of the arrivals then moved on to Hungary, Macedonia, and Serbia. \n\nOver the weekend, Germany received an estimated 20,000 people seeking asylum – and with the country expecting as many as 800,000 new arrivals this year, Merkel announced a funding boost Monday. \n\nFrom Berlin, Esme Nicholson reports for our Newscast unit: \n\n“In addition to the provision of extra funds for federal states and town councils, the German government plans to increase the capacity of asylum-seeker reception centers, finance an additional 3,000 federal police officers and invest more in integration and language courses. \n\n“But there will also be restrictions. Kosovo, Albania and Montenegro will be added to the list of ‘safe’ countries and cash allowances for asylum-seekers will be replaced by goods and services. Speaking to journalists this morning, Merkel stressed that Germany cannot solve these issues alone. \n\n” ‘The entire EU needs to make an effort. We can’t do this without European solidarity,’ Merkel said. \n\nOn Monday, French President Francois Hollande announced his country will accept 24,000 migrants over the next two years. \n\n“The EU is pushing its member countries to each take in more migrants, to share the burden with front-line nations such as Italy and Greece,” NPR’s Eleanor Beardsley reports, noting France’s plan. “But other eastern E.U. nations such as Poland and the Czech Republic say setting migrant quotas would be unacceptable.”", "source": "Oregon Public Broadcasting"}