{"published": "2015-09-08T19:35:29Z", "media-type": "Blog", "title": "Kansas State Band and the Art of Nebulous Damage Control", "id": "7731236c-cc56-4c89-a1bc-0f4c0d03a517", "content": "https://www.youtube.com/watch?v=NeOFC1xmlqo\n\nKansas State's marching band attacked the Kansas Jayhawk with a \"Starship Enterprise.\" Many felt the spaceship resembled a penis. It sort of does from that angle. It doesn't from elsewhere in the stadium, where it looks like a spaceship.\n\nThe school apologized, while affirming the alleged phallus was the \"Starship Enterprise.\"\n\nhttps://twitter.com/kstate_pres/status/640352863462428672\n\nToday, Kansas State announced it suspended its band director for the Kansas game and will pay a $5,000 fine to the Big 12 for a \"violation of the league's sportsmanship policy.\"\n\nThen the Big 12 issued a \"public reprimand\" for inappropriate use of a member institution logo. The punishment was for having the mascot disintegrate, not for the alleged fellatio.\n\"The actions of the marching band depicting the disintegration of a member institution's mascot was inconsistent with the principles and expectations of the Big 12 Sportsmanship and Ethical Conduct Policy,\"\nLeft unclear is how a group of humans could form the shape of a mascot without having it undergo \"disintegration\" in some fashion. Are Big 12 teams now banned from forming their own mascot as well?\n\nThe issue seems cut and dry. It either was a dick or it was a spaceship. The latter warrants a clarification. The former, if verified, probably warrants the band director being terminated. No determination is made.\n\nInstead, we have an apology from Kansas State (for nothing specific), a self-imposed punishment (for nothing specific), and a moralizing statement from the Big 12 about an illogical precept that is beside the point. It's nonsense.\n\nThe rational conclusion is Kansas State doesn't feel it did anything wrong. There's an entirely plausible argument the band did nothing wrong. But, reality is now dictated by social media, where the power of suggestion and imperfect information and real time run roughshod.\n\nIt's now easier to \"handle\" a situation with a pretense of contrition than to affirm the truth, which is unfortunate for the people involved.\n\nhttps://twitter.com/WilliamShatner/status/641292845568032768", "source": "The Big Lead"}