{"published": "2015-09-11T22:48:06Z", "media-type": "Blog", "title": "Apple Special Event September 2015 #apple", "id": "7665c596-5e5f-4fdb-8ac8-eaa0bec7f4e9", "content": "Apple Special Event September 2015 #apple\tApple’s September event has come and gone. Re-watch the keynote at Apple’s website. Well, all the common rumours are pretty much on the spot. Tim Cook is changing the keynote style. Unlike Jobs who likes to talk about statistics before the actual announcements, Tim Cook seems to prefer to just go straight to the announcements. First, Apple Watch. WatchOS 2, and new models (color) and bands. I thought smartwatch is just an expensive fad. I do own a Motorola 360, and I only bought it due to the price cut when the Apple Watch was released. At $400, I’m still not convinced whether it is worth it to get a first gen product. Time has proven again and again that Apple’s second revision of the product is much better (iPad, iPhone, iPod nano). With Apple pushing apps on the Apple Watch, I am going to wait for the next revision to see if it is finally worth the price. The more important here to me is the partnership with Hermes. The lay people amy brush this away, but this is the next step of Apple as a business. Apple is making itself into more of a brand company, and it is selecting luxury partners. We will see how Apple progress, and how the other tech companies are confused how Apple is making so much money. Next up is iPad, and yes, the rumours are correct. We are getting a 12.9″ iPad Pro, with stylus support called Apple Pencil, and a smart keyboard cover. Yes, sounds like the same concept as Microsoft’s Surface. What’s amazing is the inside. It is sporting an A9X chip, and simply listening to Apple’s claim on what the chip can do is quite mind boggling. Apple claims that it is faster than 80% of the laptops out there. That’s a huge claim, considering intel has been making great improvements on its Atom and Core processors. GPU performance claim is also huge, 2x the 8X, and Apple is claiming it is faster than 90% of laptops out there. Being able to edit 4K movies is a jaw-dropping capability, considering that even my Macbook Pro is still choking on 1080p videos in Final Cut Pro X.I am wondering how Apple does it. Having said that, I am guessing majority of laptops out there are running Atom and low end Celeron and Pentium processors, and thus explain the claim of GPU superiority of the A9X. I mean intel integrated graphics are not the greatest, but I doubt the A9X can match the Iris GPUs, which are in the Macbook Pros. Other features are 4 speakers, and the new connectors for accessories, including the smart keyboard. However, just like Microsoft, the keyboard cover is sold at a premium, for $170. Oh and there’s the stylus called Apple Pencil, for an extra $100. But it is charging from the lightning connector? It is stupid, having the pencil sticking out on the huge iPad Pro. Maybe Apple Pencil 2 will have a rotatable lightning connector. I harp on Microsoft for note including the keyboard cover with the Surface, but at least Microsoft included the stylus on the Surface Pro. As usual, Apple made videos starring Johnny Ive to narrate technology into an alluring advertisement. This is the magic of Apple, as it made me interested into getting the iPad Pro. However, I think 12.9″ is too big. I think the iPad Pro is a test bed. When you look at the models available, it has a weird lineup, inconsistent with previous iPads offering. Apple only offers it in 3 models, 32GB, 128GB, and 128GB + cellular. There’s no 32GB + cellular, nor 64GB models. They are expensive too. 32GB model is $800, and the 128GB + cellular is $1080. Yes, finally a $1000 iPad… Sounds like Apple is still determining how the market would react and what kind of demands they would have. Personally, I will be waiting for an updated regular iPad with the Pencil support. That would be a more ideal size for students. Interestingly, Apple updated the iPad mini into iPad mini 4 without actual announcement. The iPad mini 3 was silly, only adding Touch ID over the iPad mini 2. The mini 4 is a more appropriate update, adding the A8 chip. Interestingly, Apple is keeping the mini 2 for the lower price point instead of the mini 3. iPad mini 2 now starts at $270, which is quite a steal imo (the refurbished 16GB wifi is getting close to the $200 price point, being sold at $230). Imagine an iPad at almost the same price as an iPod Touch. On the other hand, Apple now has a sale of iPad lineup, contrasting their typical simple product line up. Now Apple has iPad mini 2, mini 4, iPad Air, Air 2, and the Pro. That’s a lot of models. Next up Apple TV. Apple finally is making its long-rumored attempt at gaming console, again. The interesting part is the Siri user interface, using the Siri remote with a trackpad on it. It is powered by the A8 chip. It is interesting how this can be clocked as now it doesn’t have as much physical restrictions as Apple’s portable devices. Apple is selling this new Apple TV at two capacity sizes, 32GB for $150 and 64GB for $200. I think this class of device should be simplified, meaning Apple should just sell the 64GB model for $149. I think this is Apple’s trick in upselling. Why? Apps. The new TV will run sophisticated apps just like other iOS devices, including games. I’m guessing Apple is banking for consumers to pay more for more storage for the apps. It will be interesting to see how Roku and Amazon would react to this. Apple’s huge advantage is its huge movie library. And lastly, the iPhone 6S/6S+. The rumours are pretty much spot on. It has the same outer appearance as the 6 obviously, and there’s a rose gold color option. It is running the A9 chip, and retaining the same capacities and price points as the previous iPhone 6. It has the force touch called 3D touch. Camera is upgraded, with 12MP on the rear and 5MP at the front. It is 4k capable also. Can’t wait to get my hands on this, although I am concerned about the smaller battery and rumours that it still only has 1GB of RAM. One interesting feature is Live Photos. Basically the camera will be capturing extra frames for a second before and a second later when you press the shutter button, giving you a quick video clip in addition to the picture itself. It reminds me of HTC Zoe, which I said in the past for Apple to copy it. The problem with HTC Zoe is that it is keeping multitude of pictures, creating confusion when backing up the photos as now you have tons of pictures of the “same” thing (which creates the frames of the quick snippet). Looks like Apple made things more seamless. Will be interesting how services like dropbox would deal with live photos. Another interesting move is for Apple to do its own iPhone instalment plan, which makes you “subscribe” to Apple starting at $32 a month. Apple will give you an unlocked iPhone with AppleCare+, and you will get the new one every year. This is definitely a jab at the carriers as now people can get an iPhone for just $384 a year, and it’s unlocked to boot. This is Apple’s solution to attack the cheap Android phones. Very bold and interesting move, and I hope it gets adopted outside the US where people prefer unlocked and no-contract. iCloud storage is also updated, with 50GB for 99cents a month. Sounds pretty sweet to me and I might finally bite (although it has not shown on the iCloud purchase setting page yet on Yosemite). Online, you will see people claiming that the whole thing is underwhelming, mainly because the rumours pretty much nailed everything down, thus no “new” surprises.  However, I think this is a huge turning point for Apple. I can see the A9X as the starting point for Apple to consider an Ax powered Macbook. The Apple Pencil might create a new feature set for future iPads. The new Apple TV is Apple’s attempt to attack the gaming console market with a full app store ecosystem. And finally the iPhones 6S/6S+, creating a new UI experience with 3D Touch. People judge books by its cover. So people will be more excited when they see a new Android device that look different (but only having minuscule improvements inside), while scoff off Apple’s S-cycle iPhones that carry a lot inside but appear the same externally. I mean seriously, look at the Xperia Z3, Z4 and Z5. The 6S brings a ton more over the 6 than Sony did for its Xperia flagship. I have posted about how I am considering switching back to iPhone, and the 6S is the obvious candidate. I will be waiting on the side for Apple Watch 2 and iPad Air 3 with Pencil support. I was considering getting the retina Macbook when Apple updates it with Skylake, but the iPad Pro muddles the water. Can’t wait what Apple can do next year with the A10.   Leave a comment Posted by pika2000 on September 11, 2015 in impression, Keynote   Tags: 6S, apple, iPad, ipad pro, iphone, keynote", "source": "pika2000's Blog"}