{"published": "2015-09-18T15:00:14Z", "media-type": "Blog", "title": "It’s Official, Konami Is Severing Ties With Triple-A, Aside From PES", "id": "d5ebd79e-1b42-4a6e-8659-86355cbbb260", "content": "I’ve voiced my hatred for Konami on way too many occasions on this site, but I still think it’s for good reason. From a beloved company that published some of the best gaming franchises in the world, to a hollowed out mess that should honestly be euthanized. While the terrible events kind of trickled down for a while, the biggest shock came when they flat out cancelled Silent Hills, a game that looked like it had so much potential and was probably going to be the next revelation in the survival horror genre. \n \nAfter that we heard reports of Hideo Kojima being treated like garbage and that the company was actively pushing him out, nevermind that his games put the damn place on the map in the first place. Then shit just got stupid with them releasing Pachinko machines, Japanese gambling machines, of our favourite franchises, reducing them to nothing but novelty items. It was physically and symbolically abhorrent. \n  Popular Articles  Recent Articles     Be Quiet, Stop Telling Creators What They Can And Can’t Do | 1 week ago    WhatsApp “VirusCard” Vulnerability Allows Attackers To Compromise WhatsApp Web Users | 1 week ago    Review: Metal Gear Solid V: The Phantom Pain Will Divide Die-Hard Fans | 1 week ago    Review: Mad Max Is A Moronically Serious Heap Of Scrap | 1 week ago       It’s Official, Konami Is Severing Ties With Triple-A, Aside From PES | 1 day ago    MSI And Corsair Create The GTX 980 Ti Sea Hawk | 1 day ago    Star Fox Zero Barrel Rolls Into 2016 | 1 day ago    Star Wars Battlefront’s Hero System Gets Explained | 1 day ago      \nWe also knew that they were going to focus primarily on the mobile market in the future and this is for obvious reason. Mobile has the best return on investment. Konami have completely lost touch with what gaming is and have shown no remorse to the legion of dedicated fans it was actively alienating. They became a hollow shell of their former self and one that pains me to witness. \n \nA recent report from French site, Gameblog , stated that Konami is now officially done with AAA game development and with the exception of Pro Evolution Soccer which does count, I guess. This report has since been confirmed to be factual. MGS V was possibly the last major AAA game that we will see from Konami. \n \nKonami have officially packed their bags and called it in. They will not be relevant anymore in the gaming industry and will only be a painful reminded every time we see their name on some free-to-play nonsense on app stores. Our favourite franchises will either be whored out on mobile or be forgotten within the annals of gaming. \n \nIt’s been a good run Konami. We wish you didn’t fly off the goddamn handle and still produced some of the most beloved games in gaming history, but this is the road you picked. I genuinely hope you fail miserable and crash and burn into obscurity. \n \nFuck Konami. \n \nThe post It’s Official, Konami Is Severing Ties With Triple-A, Aside From PES appeared first on #egmr .", "source": "#egmr"}