{"published": "2015-09-15T20:00:00Z", "media-type": "News", "title": "Back on track", "id": "2229413b-8755-42c0-8911-a47016be559b", "content": "A CHANGE to the rail time table and extra services for Goulburn are a step closer, following a meeting between local rail users and the NSW Transport Minister. A CHANGE to the rail time table and extra services for Goulburn are a step closer, following a meeting between local rail users and the NSW Transport Minister. Members of the Southern Tablelands Rail Users Group (STRUG) have hailed the meeting with Transport Minister Andrew Constance as an “exceptional success”.\n\nSpecifically, STRUG asked the Minister to consider timetable changes, which could accommodate an earlier train out of Goulburn in the weekday mornings to arrive in Central by 8am.\n\nSTRUG President Greg Price said an earlier train out of Goulburn at 4.45am could get to Campbelltown by 6.52am and from there users could catch a 7am express to get people to Central at 7.52am.\n\nThey also asked for a service on weekends and public holidays that could link in with special events and combined rail-entry tickets in Sydney as well as an earlier return service to Goulburn in the afternoons.\n\nSTRUG President Greg Price said the Minister was also considering STRUG’s ideas about electrification of the Southern Highlands Line, suggesting to him that the use of tilt trains could reduce the cost of this project from $10 billion to $2 billion by reducing the amount of track re-alignment required.\n\nThey also suggested reusing former 2805 and 2855 trains on the Southern Highlands line.\n\nThese trains have recently been out of service being cannibalised for spare parts for other trains.\n\nSTRUG President Greg Price said Minister Constance agreed to have his “experts” take the suggestions on board and check their feasibility.\n\n“The upshot of the meeting was that the Minister ordered the bureaucrats to go away and come back with some answers to STRUG’s requests,” Mr Price said.\n\nHe said the Minister seemed “embarrassed” at the lack of knowledge displayed by the rail officials he had assembled to answer the STRUG representative’s questions.\n\nIn the meeting on September 10 were: NSW Transport Minister Andrew Constance, Member for Goulburn Pru Goward, Member for Wollondilly Jai Rowell, Trainlink CEO Rob Mason, Chief Engineer of Sydney Trains Stuart Mills and Business process analyst with Sydney Trains Kieran Ryan.\n\n“This was the first time our meeting included any Train Link managers,” Mr Price said.\n\n“Between Pru, Jai, John and myself we very quickly had them on the back foot and we never let them get back on the front foot again.\n\nWe embarrassed them in front of the Minister.\n\n“We showed that they had the Minister sign a letter to us saying that there was a mechanic at Moss Vale and Goulburn now - when there is no mechanic at Goulburn at all.\n\n“When the Minister asked Mr Mason if our timetable would work he said that he would have to check it against the ARTC master roster, which proved that they had made no attempt to improve our timetable over the past 18 months despite us clamouring for changes to it.”\n\nMr Price said when the officials were asked by Minister Constance about whether the 2805 and 2855 trains were being cannibalised for spare parts they couldn’t answer, it was left to him to confirm this.\n\nHe also said the rail experts showed they actually had no idea where Goulburn was.\n\n“We showed the Minister a letter he had sent stating that rail services to the Southern Tablelands had been improved because of an additional 55 additional services a week that were running between Moss Vale and Campbelltown.\n\n“I asked the rail management people there do any of them know where Goulburn is actually situated and I was met with blank expressions,” Mr Price said.\n\n“I pointed out that 55 extra services a week between Moss Vale and Campbelltown do not run through Goulburn - and that these services were of no use to residents on the Southern Tablelands - I don’t think that went too well with the minister, either.”\n\nMr Price said STRUG was looking forward to the next meeting with the Minister.\n\nNo date for this meeting has been advised at this point.", "source": "Goulburn Post"}