{"published": "2015-09-30T14:15:00Z", "media-type": "News", "title": "Homeland returns with a new direction - and the spies are happy", "id": "31af5582-ed72-4b70-9d25-eb4d7b5f2fc4", "content": "Carrie leaves the Middle East but her core mission remains. \n\nWhen Homeland returns this week, the series will be in a very different place – physically and mentally – from where it started.\n\nLong gone is Brody (Damian Lewis), the former al-Qaeda prisoner of war who returned to the US a possible sleeper agent to be watched by CIA agent Carrie Mathison (Claire Danes).\n\nLong gone too is Carrie's CIA career. She's now living and working in Berlin for a private security firm. And that's fine by the intelligence world's real agents.\n\nThe series might have won millions of fans around the world, but for those doing the job for real, the TV agents, and Carrie in particular, just didn't ring true.\n\n\"The problem is that they portray most women in such a one-dimensional way; whatever the character flaw is, that's all they are,\" Gina Bennett, an analyst in the American Counterterrorism Centre for more than 25 years told The New York Times.\n\n\"It can leave a very distinct understanding of women at the agency – how we function, how we relate to men, how we engage in national security – that is pretty off.\n\nAnother CIA veteran, Sandra Grimes, agreed.\n\n\"I wish they wouldn't use centrefold models in tight clothes. We don't look that way. And we don't act that way.\"\n\nHow the spy world reacts to the newest Homeland characters (including Australian Miranda Otto who will play the CIA's Berlin chief of station with Mandy Patinkin as her boss) remains to be seen.\n\nIt's not something that weighs heavily on the mind of series showrunner Alex Gansa, who is unsurprisingly more interested in the fact the new locale (Homeland is the first US television series to be shot entirely in Germany) and players will let him take the long-running series in a completely new direction.\n\nAnnouncing the series return, the producers said: \"Season five will pick up two years after Carrie Mathison's ill-fated tenure as Islamabad station chief.\n\n\"Struggling to reconcile her guilt and disillusionment with years of working on the front lines in the 'war on terror,' Carrie finds herself in a self-imposed exile in Berlin, estranged from the CIA and working for a private security firm.\"\n\nShe has a new boyfriend, new colleagues – almost none of last year's Homeland stars will be returning – and a new direction.\n\nWhat will remain, Gansa said, is her core mission, to keep the world safe.\n\n\"Look at what's going on in the Middle East, look at what's going on in Syria and Iraq, look what's happening in the Ukraine,\" he told The Hollywood Reporter.\n\n\"We'll be in Europe telling this story. It's all going to be part of the world (Carrie) is in.\"\n\nWHAT\n\nHomeland\n\nWHEN\n\nTen, Monday, 9.30pm The story first appeared on The Sydney Morning Herald.", "source": "Mandurah Mail"}