{"published": "2015-09-26T19:30:44Z", "media-type": "News", "title": "Danger still lurks", "id": "1a2e4385-067a-4a0d-893c-b38b18eadbda", "content": "Filaria may be deemed a scourge of the past, but...: \n\nby In the mid 1930s Lymphatic filariasis (LF) was one of the most dreaded and rampant diseases in the country. Scars on untreated victims were horrendously disfiguring causing permanent disability. Today, after years of battling the disease with new methods of both killing the filarial mosquito and treating the victims, Sri Lanka has successfully brought the disease under control and eliminated it to the extent that filaria, like many other communicable diseases that ravaged the island in the past is now considered a disease of the past. Health officials from the Anti- Filariasis campaign, addressing a media seminar at the Health Education Bureau, however warned the disease could re-emerge as small pockets of resistance had been detected in a few endemic districts. So what does one have to watch out for? Here, Consultant Community Physician, Anti-Filariasis Campaign, Dr S. D. Samarasekera explains the lurking dangers, about LF, its symptoms, treatment procedures and why it is always wise to be cautious. \n\nQ:How many people are currently affected with LF worldwide? \n\nA: Lymphatic filariasis (LF) is the fourth leading cause of permanent and long-term disability. It is a neglected tropical disease endemic in 83 countries, with over a billion people at risk of infection. \n\nQ: What are the filaria endemic areas in Sri Lanka and why? \n\nA: In Sri Lanka, filariasis is endemic in the Western (Colombo, Kalutara, Gampaha), Southern (Galle, Matara, Hambantota) and the North-western (Kurunegala and Puttalam) Provinces, mainly due to rapid and unplanned urbanization, increased population density and also due to the suitable climate for mosquito breeding. There are Regional Anti Filariasis Units (RAFUs) in seven endemic districts. \n\nQ: When was the first survey on filariasis conducted in Sri Lanka? \n\nA: The first authentic description was found in 1936-1939: an island-wide survey reported a microfilaria (mf) rate of 20-24% (mf rate-percentage of persons positive for mf in night blood samples). \n\nThe Anti Filariasis Campaign (AFC) of the Ministry of Health, was established in the Department of Health in Sri Lanka in 1947 to reduce the burden of the disease. Two types of filarial parasites were reported from Sri Lanka i.e. 'Wuchereria bancrofti' and 'Brugia malayi'. Since 1949 more cases of Bancroftian filariasis have been reported and there were almost no reported cases of Brugian filariasis since 1969. At present, 'Wuchereria bancrofti' is the main LF infection being transmitted and few cases of Brugian filariasis have been reported. \n\nThe insect vector responsible for the spread of Bancroftian filariasis in Sri Lanka is the female mosquitoes of Culex quinquefasciatus. \n\nThis mosquito serves as the intermediate host and the microfilaria count coincides with the biting habits of the vector. It breeds in highly polluted collections of water, such as blocked drains, damaged septic tanks, and latrine pits, which abound in urban habitats. Female mosquitoes of Mansonia species transmit the Brugian filariasis. \n\nBreeding of Mansonia spp. is associated with aquatic plants such as Pistia and Salvinia. \n\nQ: In what part of the human body does the parasite breed and for how long? \n\nA: The male and female adults of the filarial parasite live in the lymphatic system of the affected person. The adults mate and produce microfilaria (mf), which find their way to the blood stream and are capable of living for about one year without developing further in the human body. \n\nWhen mosquito vector takes a blood meal, mf enters the mosquito from an infected person and moults to LI, L2 and L3 larval stages of the parasite. L3 larval stage is the infective stage where enters the human body when a blood meal is taken by vector. Infective L3 larva converts to adult-stage after another two months in the human body. \n\nQ: Do all infected persons develop the disease? \n\nA: Only a proportion of persons infected with filarial parasites develop clinical symptoms. Lymphatic filariasis is characterized by a wide range of clinical manifestations. The signs and symptoms may be acute or chronic. Q: What are these symptoms? \n\nA: Patients with chronic lymphatic filariasis are usually amicrofilaraemic (normal) and there is no currently available test to prove active filarial infection, the diagnosis of filariasis should be established on clinical grounds. \n\nAcute symptoms include: fever, muscle pain, lymph node enlargement (Lymphadenitis,) Lymphangitis, painful red patches, mild swelling of the affected body parts. Eg: legs (more common), arms, joints (especially knee joints and ankle joints), breasts in females, scrotum in males. inflammatory nodules in breasts and subcutaneous tissue. \n\nChronic symptoms are: Hydrocele (for males), swelling of vulval area in females, Lymphoedema, Elephantiasis, recurrent episodes of limb lymphoedema, first pitting oedema with loss of skin elasticity and fibrosis, are results of functional dilatation of the lymphatics. Legs are more commonly affected than the arms. \n\nQ: How are these patients managed? \n\nA: Our staff routinely conducts the following activities; parasitological surveys (through night blood filming among humans to detect microfilaria) and treat microfilaria (mf) positive persons; entomological surveys and vector control activities; manage lymphoedema patients. \n\nQ: Any advances and strategies in treatment and control of the disease in recent years, here and abroad? \n\nA: In 1997, following advances in diagnostics and treatment of LF, the disease was classed as one of the six infectious diseases considered to be 'potentially eradicable'. \n\nThe 50th World Health Assembly (WHA) adopted a resolution (WHA 50.29) calling all member states to work towards elimination of LF as a public health problem by 2020. \n\nElimination status was defined as a microfilaria rate of below 1%. Main strategies of WHO were: (i) to stop the spread of infection (interrupting transmission through Mass Drug Administration) -MF rate below 1%/ Ag positivity below 2%, (2) to alleviate the suffering of affected populations (controlling morbidity). With the support from the international partners and the WHO, Sri Lanka successfully completed five rounds of Mass Drug Administration (MDA) in 2006, which covered more than 80% of the population residing in endemic eight districts in the three provinces (Western, Southern and North Western). Two drugs regime (DEC and Albendazole) was given during the MDA. \n\nQ: What activities does the AFC engage in at present? \n\nA: Conducting routine and special night blood filming programmes in endemic areas; treating mf positive and clinically suspected cases; managing lymphoedema patients and educating them and their caregivers on morbidity management measures (exercise, elevation, washing, bandaging, wearing of comfortable footwear etc.), conducting research activities and special surveys in non-endemic areas.... We also conduct vector surveillance and control activities in endemic areas and hold awareness raising programmes for health staff and general public. Q: Your vision for the future? \n\nA: To have a filariasis-free Sri Lanka; interruption of transmission by 2020, alleviating suffering and disabilities of affected individuals by bringing together a group of central and regional partners to mobilize financial and technical resources to ensure success. \n\nQ: How will you achieve these goals? \n\nA: By strengthening parasitological surveillance and control activities; strengthening entomological surveillance and control activities; strengthening laboratory facilities at AFC and regional areas, and most importantly, preventing complications and disabilities of affected individuals by morbidity management. \n\nQ: Compared to a decade ago, what is the prevalence rate of filaria in Sri Lanka today? \n\nA: In Sri Lanka, mf rate has been below 1% over the past 10-15 years and current (2014), mf rate is 0.05%. This is very much below the WHO elimination target. \n\nQ: Yet despite this decline you say there are some areas that show an increase in positive cases? \n\nA: Even though the district data showed low mf rates, routine and special survey data in some Medical Officer of Health (MOH) areas in Galle District showed higher mf rate, antigen rate and mosquito positivity. With the recommendation of the Technical Advisory Group for National Lymphatic Filariasis Elimination Programme, Anti Filariasis Campaign of Ministry of Health decided to give the special single dose treatment programme in fourteen MOH areas (Akmeemana, Ambalangoda, Balapitiya, Bope-Poddala, Elpitiya, Galle MC, Gonapinuwala, Habaraduwa, Hikkaduwa, Rathgama, Induruwa/Bentota, Baddegama, Imaduwa and Yakkalamulla)out of 20 MOH areas in Galle District during 2014 and 2015 considering mf positivity in the area or geographically locating closer to a mf positive MOH area with the assistance of the Health Authorities and Public Health Staff of the District. \n\nThe programme commenced last week and the Health staff of the MOH will conduct it for a period of about six weeks. \n\nResidents above two years of age in these 14 MOH will be given a single dose of Diethylcarbamazine citrate (DEC) tablets and 400mg tablet of albendazole. It has shown that the annual single-dose co-administration of two drugs (DEC and albendazole) reduces blood microfilariae by 99% for a full year. \n\nHence it is important to co-administer these two drugs regardless of recent intake of anti-helminthic treatment among persons in the area. Residents in these MOH areas are expected to consume these drugs to control the transmission of filariasis. \n\nThe drugs will be distributed through Public Health Midwives and Public Health Inspectors of respective MOH offices. by house to house distribution or via drug distributing centres. \n\nPeople are advised to take the drugs after meals to reduce the minor side effects. Mass Drug Administration (MDA) is not given to: Pregnant women, mothers breastfeeding a child below 2 years, children below 2 years and acutely ill patients. \n\nQ: Your message? \n\nA: The media has an important role in raising awareness on filaria prevention activities. We appeal to you for your co-operation..", "source": "Sunday Observer"}