{"published": "2015-09-02T01:17:47Z", "media-type": "News", "title": "Robbins Arroyo LLP Is Investigating the Officers and Directors of ConforMIS, Inc. (CFMS) on Behalf of Shareholders", "id": "9b0d685a-9b1f-4863-b4ea-e54e032fe3fd", "content": "Shareholder rights law firm Robbins Arroyo LLP is investigating whether certain officers and directors of ConforMIS, Inc. (NASDAQGS: CFMS) violated the Securities and Exchange Act of 1934. ConforMIS is a medical technology company that uses its iFit Image-to-Implant technology platform to develop, manufacture, and sell joint replacement implants that are individually sized and shaped to fit each patient's unique anatomy. \n\nhttp://photos.prnewswire.com/prnvar/20130103/MM36754LOGO \n\nView this press release on the law firm's Shareholder Rights Blog:www.robbinsarroyo.com/shareholders-rights-blog/conformis-inc \n\nConforMIS Recalls Its Products \n\nOn July 1, 2015, ConforMIS stock opened for trading at $18.00 and sold 9 million shares of stock in its initial public offering. On August 31, 2015, ConforMIS issued a press release announcing that it had initiated a voluntary recall of specific serial numbers of patient-specific instrumentation for certain of its knee replacement product systems. ConforMIS instigated the recall in response to three recent complaints of moisture on the patient-specific instrumentation sets, 950 of which are affected by the recall. On this news, the company's stock fell $4.23, or 21.4%, to close at $15.95 on August 31, 2015, a considerable drop from its share price of $26.93 just several weeks ago. \n\nIn light of this news, Robbins Arroyo LLP's investigation focuses on whether ConforMIS and/or its officers misled shareholders by making false and misleading statements regarding the company's business prospects. \n\nConforMIS Shareholders Have Legal Options \n\nConcerned shareholders who would like more information about their rights and potential remedies can contact attorney Darnell R. Donahue at (800) 350-6003, DDonahue@robbinsarroyo.com, or via the shareholder information form on the firm's website. \n\nRobbins Arroyo LLP is a nationally recognized leader in shareholder rights law. The firm represents individual and institutional investors in shareholder derivative and securities class action lawsuits, and has helped its clients realize more than $1 billion of value for themselves and the companies in which they have invested. \n\nAttorney Advertising. Past results do not guarantee a similar outcome. \n\nContact:Darnell R. DonahueRobbins Arroyo LLP600 B Street, Suite 1900San Diego, CA 92101DDonahue@robbinsarroyo.com (619) 525-3990 or Toll Free (800) 350-6003www.robbinsarroyo.com \n\nLogo - http://photos.prnewswire.com/prnh/20130103/MM36754LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/robbins-arroyo-llp-is-investigating-the-officers-and-directors-of-conformis-inc-cfms-on-behalf-of-shareholders-300136558.html \n\nSOURCE Robbins Arroyo LLP \n\nhttp://rt.prnewswire.com/rt.gif?NewsItemId=LA92274&Transmission_Id=201509012106PR_NEWS_USPR_____LA92274&DateId=2015", "source": "Individual.com"}