{"published": "2015-09-26T00:34:23Z", "media-type": "News", "title": "EDITORIAL: Building bridges", "id": "9680181d-d994-45cb-a78a-4e798bb2a597", "content": "The autopsy report on the DOA TransLink funding plebiscite are in. \n \n\r\n\tCause of death: Apathy. \n \n\r\n\tOf the 1.5-million ballots issued, less than half came back. Another 38,000 were sent to the bin because the well-intentioned voters didn’t follow the instructions. \n \n\r\n\tOnly 36 per cent of voters age 24 to 35 (the blasted millennials) bothered to cast a ballot. This is particularly baffling, as this is the demographic that’s most likely to be taking transit. The 55-plus crowd was the only demographic to crack the 50 per cent turnout; the 60-per cent No vote likely reflects that. \n \n\r\n\tThe whole futile effort cost Elections B.C. about $5.3 million and we have absolutely nothing to show for it. Our transportation minister seriously misjudged Lower Mainland residents’ appetites to vote on funding an organization they don’t trust or like. \n \n\r\n\tBut transportation infrastructure projects outside of TransLink’s reach roll on. \n \n\r\n\tWith a so-called Massey Bridge in the works, and study now underway into whether the sleepy Sunshine Coast needs a billion dollars of concrete and highway to plug into the Lower Mainland’s road network, our provincial leadership has made clear their priorities: encouraging more cars into the same space. No mention of a plebiscite for those projects. \n \n\r\n\tHow about a study into the costs and benefits reforming TransLink into an organization both the Yes and No voters alike can agree is accountable? Meanwhile, we’re left with the same traffic headaches and no more confidence in our transit agency. The government has offered TransLink some Band-Aid fixes. We say take it to the morgue. \n \n\r What are your thoughts? Send us a letter via email by clicking here or post a comment below. \n \n© 2015 North Shore News  \n Sign up for the North Shore News FREE digital newsletter to receive top headlines from each issue in your Inbox.", "source": "North Shore Outlook"}