{"published": "2015-09-03T20:17:12Z", "media-type": "News", "title": "St. Jude Medical to Present at the Morgan Stanley Global Healthcare Conference", "id": "e3cb7a97-e1fe-4708-a5e9-c729ebb08091", "content": "St. Jude Medical, Inc. (NYSE:STJ) will present at the Morgan Stanley Global Health Care Conference on Wednesday, Sept. 16, in New York City. Mike Rousseau, chief operating officer and Don Zurbay, vice president, finance and chief financial officer, will address the conference at 9:20 a.m. EDT. A live webcast of the presentation will also be available on the St. Jude Medical Investor Relations website: investors.sjm.com \n\nAbout St. Jude Medical \n\nSt. Jude Medical is a global medical device manufacturer dedicated to transforming the treatment of some of the world's most expensive epidemic diseases. The company does this by developing cost-effective medical technologies that save and improve lives of patients around the world. Headquartered in St. Paul, Minn., St. Jude Medical has four major clinical focus areas that include cardiac rhythm management, atrial fibrillation, cardiovascular and neuromodulation. For more information, please visit sjm.com or follow us on Twitter, @StJudeMedicalIR. \n\nForward-Looking Statements \n\nThis news release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 that involve risks and uncertainties. Such forward-looking statements include the expectations, plans and prospects for the Company, including potential clinical successes, anticipated regulatory approvals and future product launches, and projected revenues, margins, earnings and market shares. The statements made by the Company are based upon management's current expectations and are subject to certain risks and uncertainties that could cause actual results to differ materially from those described in the forward-looking statements. These risks and uncertainties include market conditions and other factors beyond the Company's control and the risk factors and other cautionary statements described in the Company's filings with the SEC, including those described in the Risk Factors and Cautionary Statements sections of the Company's Annual Report on Form 10-K for the fiscal year ended January 3, 2015 and Quarterly Report on Form 10-Q for the fiscal quarter ended July 4, 2015. The Company does not intend to update these statements and undertakes no duty to any person to provide any such update under any circumstance. \n\nhttp://cts.businesswire.com/ct/CT?id=bwnews&sty=20150903006191r1&sid=cmtx6&distro=nx&lang=en \n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150903006191/en/ \n\nSOURCE: St. Jude Medical, Inc.", "source": "Individual.com"}