{"published": "2015-08-13T12:00:20Z", "media-type": "Blog", "title": "Spider Mites Eating Your Plants?", "id": "86563fb8-5293-4eb1-88ec-01881064c795", "content": "Source- eternallygreen.com \n \nMost Spider Mites, especially the Two Spotted Spider mite love hot weather and dry conditions, so the race is on!  Batten down the hatches and Katie bar the door, it’s Spider Mite season! \n \nSpider mites attack a variety of plants in your landscape including Burning Bush, Dwarf Alberta Spruce, Boxwood, almost all spruce varieties and other plants. \n \nBut they are tiny!  Tiny, destructive creatures that easily move around in your plants undetected because they are so small you don’t notice them.  They are only 1/50 of an inch long in their adult stage.  That’s small! \n \nThen they often hang out on the underside of the foliage feeding away like thieves in the night. \n \nSo how can you tell if you have them?  Look for tiny yellow spots on the leaves and needles of your plants.  Spider mites have tiny mouths that are designed to suck the juice out of  individual plant cells.  So they attack your plants one cell at at time and the damage really doesn’t start to show up until they have destroyed the majority of cells on a leaf or an area of the plant. \n \nIf you hold a piece of white paper under a branch that you are concerned about, then sharply wrap the branch with a pencil you might knock some off onto to the paper where you can see them.  But you really have to look closely because they look like walking dust particles. \n \nSince they like it hot and dry you can actually blast them off your plants with a sharp stream of water from the garden hose.  Or you can spray your plants with an insecticidal soap that will get rid of the mites but not harm your plants. \n \nSource- GeorgeWeigel.net \n \nSpider mites can completely defoliate a large Burning Bush, but fortunately the plant is usually not permanently damaged.  They also do a lot of damage to Dwarf Alberta Spruce, and the damage there is more permanent. \n \nKeep an eye out for them and give them a good hosing.", "source": "Mike's Backyard Nursery"}