{"published": "2015-09-17T15:21:45Z", "media-type": "News", "title": "Groundbreaking Ferrari N.A.R.T. Daytona Offered at 'Rolling Sculpture' -- Inaugural Auction Event by Keno Brothers Fine Automobile Auctions", "id": "8f67ca25-4777-4150-9efb-b18ce69c8ef1", "content": "SOURCE Keno Brothers Fine Automobile Auctions\n\nArt and Automotive Worlds Combine During New York Art Auction Season\n\nNEW YORK \n\nJust as some of the greatest masterpieces of art were produced in Italy \n\n\"Our goal as a company is to channel the trust, integrity and knowledge that we have built throughout our entire lives into every aspect of this new auction house,\" said Leslie Keno \n\nThe 1971 24 Hours of Le Mans N.A.R.T. 365 GTB/4 Daytona VIN 12467\n\nAt its unveiling at the Paris Auto Salon in 1968, the striking Ferrari 365 GTB/4 was immediately hailed as a masterwork. However, through June of 1971, the beautiful Berlinetta had not yet proven itself as the dominant competition machine it would become. A prototype race version was built and promptly crashed at the 1969 24 Hours of Le Mans, and only a middle field finish came much later in 1971. Nonetheless, North American Racing Team patriarch Luigi Chinetti Sr. \n\nAccordingly, Daytona 12467 was modified from a standard road car for N.A.R.T. and entered in the 1971 24 Hours of Le Mans. This era is still considered the golden age of road racing, due to the colossal battle between Ferrari and Porsche, and their awe inspiring 5-liter World Sports car Championship machines. Out of the box, in the world's most grueling race, '12467' finished a stunning fifth position overall, behind only the much larger and more powerful WSC machines. It came in eight laps ahead of the GT cars that it would be classified against in the future. By the end of that summer, with the requisite 500 road cars completed for homologation, the first of three batches (eventually totaling 15) of official Ferrari factory-prepared Daytona Competiziones were at the 1972 24 Hours of Le Mans. The racing world watched as a flank of Daytonas took fifth through ninth place overall, once again behind only WSC machines, and swept the GT class podium. The Ferrari 365 GTB/4 Daytona represents the final front engine road-based racecar built under the gaze of Enzo Ferrari \n\n\"The N.A.R.T. Daytona is an example of our vision to carefully curate and celebrate, when possible, automobiles with unique origins, or notable achievements in history,\" said Co-CEO and Founder, Leigh Keno \n\nThe Keno Brothers Method: A Passion for Provenance, An Appreciation for Clarity\n\nWidely known for their appraisals on the Emmy-nominated PBS television show Antiques Roadshow, the Keno brothers are applying the same advanced evaluation techniques, cutting-edge scientific technology and 'fresh eyes' approach to the ways cars are assessed and represented.\n\nUnique to Keno Brothers Fine Automobile Auctions is an all-new proprietary software, developed by COO and Founder, Bradley Farrell \n\n\"Whether a potential buyer is considering acquiring a work of art, or an exceptional automobile, a clear and complete vision of its market value, current condition and historical context is our prime objective,\" commented Leigh Keno \n\nKeno Brothers Fine Automobile Auctions is proud to announce that they have enlisted Simon Hope Keno Brothers Fine Automobile Auctions will be announcing more offerings in the days leading up to the Rolling Sculpture Auction Event. Visit www.kenobrothers.com for more information or to discuss consigning your fine automobile.\n\nABOUT THE KENO BROTHERS\n\nWorld renowned for having discovered and sold numerous masterpieces across the fields of art, antiques and vintage cars, Founders and Co-CEOs Leigh Keno \n\nThey are internationally recognized experts in the field of antiques and collectibles. In addition to volunteering as appraisers on Emmy-nominated PBS's Antiques Roadshow, they are also familiar from: MSN's Collect this! with the Keno Brothers; PBS's series FIND!; FOX's Buried Treasure and the History Channel's The White House: Behind Closed Doors with First Lady Laura Bush \n\nPhoto - http://photos.prnewswire.com/prnh/20150917/267615 Photo - http://photos.prnewswire.com/prnh/20150917/267616 \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/groundbreaking-ferrari-nart-daytona-offered-at-rolling-sculpture----inaugural-auction-event-by-keno-brothers-fine-automobile-auctions-300144934.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "12 News Now"}