{"published": "2015-09-01T11:09:51Z", "media-type": "News", "title": "AFL Tribunal: Courtenay Dempsey hit for four", "id": "04747909-e308-479c-9e98-47aaa70693b9", "content": "The incident: Courtenay Dempsey slings Brett Deledio to the ground. Photo:   \n  \nCourtenay Dempsey's future in the AFL was thrown into further doubt after he was suspended for four matches for rough contact on Tuesday night. \n\nIn pleading for a two-game suspension, Dempsey's advocate Adrian Anderson spoke about a racist message that had been allegedly directed at the player over social media after the Saturday's game. \n\nThe offensive message had been hurtful to Dempsey and his family,  Anderson said, which meant the Bomber had already suffered as a result of the on-field incident. But it appeared that the online message and the player's  spotless record were considered important by the jury, which chose to impose the penalty suggested by the AFL's legal counsel. \n \nDempsey laid the \"spear tackle\" on the Richmond veteran late in the final quarter of Essendon's loss to Richmond on Saturday night. The AFL's match review panel on Monday graded the tackle careless with severe impact to the head. \n\nDempsey pleaded guilty after being referred directly to the tribunal, but he challenged the severe grading. He pushed for it to be considered high impact, which would generally attract a smaller penalty. \n\nFootage on the incident shows Dempsey throwing his right arm around the Tigers' vice-captain, then following with his left arm, spinning Deledio around and pulling him backwards, lifting him well off the ground. \n\nThe timing could not be worse for Dempsey, whose contract with the Bombers finishes at the end of the season and who has not had a strong year on-field. \n\nThen, after the weekend's match, he contacted Victoria Police  after a social media user alleged racially abused him online. \n\nAnderson said the tackle should be graded of high impact because the injury to Deledio was minor. \n\nThere had been no incident graded severe since 2005 when the injury that had occurred had been so minor. \n\nDempsey did not have both Deledio's arms pinned, Anderson said, and he had an arm free to break his fall. \n\nThe AFL's legal counsel Jeff Gleeson said there was no clear line that could be drawn between what was high and severe, but the tribunal jury should be guided by their own reaction when watching the tackle, based their experiences of watching and playing football. \n\nIt was an \"ugly\" incident and the way Deledio landed was distressing, he said. Gleeson said the jury should consider the potential for injury, not just the actual injury that Deledio suffered. \n\nAfter the jury decided on a severe impact grading, Anderson argued Dempsey should be given a suspension of just two matches, because he had never been suspended in more than 100 games of football. \n\nThe Bomber had immediately expressed remorse for the tackle and was at a unique stage of his career, where a longer suspension could severely impact on his ability to be re-signed for another season of football. Dempsey and his family had suffered as a result of the racist online message, which was sparked by the tackle, Anderson said. \n\nFormer Essendon coach Kevin Sheedy, on the phone from Hawaii, told the jury that Dempsey was of good character and had simply made a mistake. \n\nThe AFL's indigenous affairs advisor Jason Mifsud also gave evidence by phone about the impact of racism on Aboriginal Australians. \"Racism is real ... it still plays a really significant role in the way that Aboriginal people are seen in our own country,\" he said.  \n\nMifsud said Dempsey had great pride in his heritage and while he had not spoken with the player directly about the message, was in no doubt it would have been hurtful to the family.", "source": "Brisbane Times"}