{"published": "2015-09-02T19:19:21Z", "media-type": "News", "title": "Strategic IP Planning Seminar (London, UK - November 23-25, 2015)", "id": "37105414-c3a1-4ad3-9e4b-2acd713486a9", "content": "DUBLIN, Sept. 2, 2015 /PRNewswire/ -- Research and Markets (http://www.researchandmarkets.com/research/33rgcb/strategic_ip) has announced the addition of the conference to their offering. \n\nTopics To Be Covered At This Seminar: \n\n- Step-by-step practical guide to strategic IP planning \n\n- Utilising a structured and rationalised IP strategy toolbox \n\n- Competitive IP analysis: market positioning \n\n- IP SWOT: align IP with R&D and business goals \n\n- Performance: benchmarking, measures and KPIs \n\n- Defining and prioritising an IP roadmap \n\n- IP planning as part of your daily role: presenting your plan persuasively \n\n- Experience IP planning and implementation during a business simulation \n\nDocumentation \n\n- Pre-Reader: contains all cases plus facts and data used during examples given by speakers and during teamwork assignments - Theory book: contains all the models and frameworks learned during the seminar lectures \n\n- Practice book: contains all the practical information needed to apply the cases to the frameworks during the teamwork assignments \n\n- Post-reader: contains all the speaker feedback provided after teamwork assignments, plus extra insights and guidelines to best apply the frameworks to your own environment \n\nBenefits of Attending: \n\n- Gain a good understanding of the principles of the drafting process \n\n- Develop their drafting skills in accordance with European practice \n\n- Compare European and US practices \n\n- Learn to avoid common drafting mistakes \n\n- Benefit from practical workshop exercises, led by two highly experienced trainers \n\nFor more information visit \n\nhttp://www.researchandmarkets.com/research/33rgcb/strategic_ip \n\nMedia Contact: \n\nLaura Wood, +353-1-481-1716, press@researchandmarkets.net About PR Newswire", "source": "Sys-Con Belgium"}