{"published": "2015-09-12T22:00:33Z", "media-type": "News", "title": "FBC angles for SMEs", "id": "9eca3fed-5f7d-4c2e-8a46-c8df5e737f55", "content": "Written by: 2015/09/13   \nLivingstone Marufu \nFBC Holdings is actively angling for the informal market and will soon be opening a branch in Graniteside, Harare that is oriented towards providing finance for small and medium scale enterprises (SMEs), particularly those operating in Mbare and surrounding areas. \n \nPolicy makers believe that the informal sector will become the engine of future economic growth. \n \nAlready, independent estimates suggest that SMEs contribute over 50 percent of gross domestic product (GDP) while employing about 60 percent of the population. \n \nFBC Holdings’ chief executive officer Mr John Mushayavanhu told The Sunday Mail Business that the plans are at an advanced stage. \n \n“We will focus on new customer acquisition and financial inclusion to target the unbanked by opening an SME inclined branch in Graniteside for our Mbare clients in the coming weeks. . . \n \n“FBC Holdings is going to follow where the money is. \n \n“There is some serious money out there in the informal sector so we need to capitalise on that and make sure that the money is returned to the formal sector so that we can carry out more projects for the local people . . . \n \n“After realising that there is no money circulating in the formal sector, we decided to go informal so that we can snap up all the money from Graniteside, Mbare Siyaso and all the surrounding areas,” said Mr Mushayavanhu. \n \nThe bank will also use various platforms such as FBC’s SMEs Banking Mobile Moola, a mobile payment platform; Eagle Insurance’s Hospital Cash Plan scheme; and micro-finance services through Microplan to interface with the informal sector. \n \nWhile the Reserve Bank of Zimbabwe (RBZ) estimates that there could be US$2,5 billion circulating in the informal sector, a FinScope MSME (micro, small and medium enterprises) survey that was conducted by the Ministry of Small and Medium Enterprises and Cooperative Development in conjunction with FinMark Trust and the World Bank in 2012 concluded that the turnover in the informal sector was more than US$7,4 billion. \n \nThe FinScope MSME survey is a research tool that was developed by FinMark Trust, a Johannesburg-based non-profit research consultancy. In coming up with the report that was released in June 2013, FinMark Trust researchers first polled over 57 000 households in 500 areas and by extrapolating their findings to the broader population, the researchers estimated that there were 2,8 million MSME business owners in the country, running about 3,5-million businesses during the review period. \n \nMeanwhile, FBC says it has fully deployed its syndicated loan facility of US$60 million that was raised last year. \n \nA syndicated loan is offered by a group of lenders (a syndicate) who work together to provide funds for a single borrower. \n \nStandard Chartered Zimbabwe, Commerzbank Aktiengesellschaft and Investec Asset Management Proprietary Limited acted as joint mandated lead arrangers in the three-year syndicated term loan facility for FBC. \n \nFBC, which is leveraging on its strong liquidity position to support business development initiatives, used part the funds to construct housing units in Greendale, Waterfalls (Masotsha Ndlovu Phase 3 and 4), Glaudina and Mbizo. \n \nIn the half year ended June 30, 2015, FBC reported that its net profit climbed 22 percent to US$8,2 million from the same period a year ago, while its total assets jumped 4 percent to US$498 million, spurred by significant growth in deposits and lines of credit. Total deposits also increased by 3 percent to US$375,4 million due to growth in credit lines. \n \nHowever, loans and advances slumped 1 percent to US$311,7 million on the back of “aggressive efforts implemented by the group towards collections.” \n \nThe bank also plans to reduce non-performing loans to below 10 percent in the short to medium term. \n \nGovernment and private investors are increasingly focusing on SMEs as high growth zones. \n \nThe Small Medium Enterprises and Development Corporation (SMEDCO) is now under the supervision of the RBZ following the amendment to the Small and Medium Enterprises Act. \n \nIn addition, Proparco, a development finance institution that is partly owned by the French Development Agency, recently extended two facilities worth US$20 million in support of SMEs through NMB Bank and CABS in February and March 2014, respectively.", "source": "SundayMail.co.zw"}