{"published": "2015-09-23T11:32:48Z", "media-type": "News", "title": "Dan Carter: All Blacks star seeks holy grail at Rugby World Cup", "id": "0dd8944c-391a-4618-8481-1a5b34786a29", "content": "(CNN) – He’s the pinup boy of international rugby — a chiseled, highly-paid Adonis who has scored more points than any other player. \n\nBut when it comes to career-defining moments, Dan Carter’s odyssey on the biggest stage has been one of sporting tragedy — the gods have not smiled kindly on his journey from small-town New Zealand to global superstar. \n\nOne of rugby’s most gifted individuals, his World Cup experiences have so far been a bitter mixture of heartbreaking injury and disappointment. \n\n“This is my fourth World Cup and I haven’t had a lot of success at each of them,” Carter told CNN’s Human to Hero series in typically understated style ahead of the All Blacks’ bid to become the first team to retain the title. \n\nLike Sisyphus, condemned to endlessly push a boulder uphill before starting over again, Carter has faced constant trials and tribulations during the tournament’s four-year cycles. \n\nIn 2003, the season of his international debut, he was an unused replacement as New Zealand lost in the semifinals against big rival Australia in Sydney, then broke his leg playing the Wallabies two years later. \n\nIn 2007, Carter was a key member of another All Blacks team heavily favored to triumph, but he went off injured during a crushing quarterfinal defeat by host France which triggered much angst in the rugby-mad nation. \n\nIn 2011, when New Zealand ended a 24-year wait and won the tournament on home soil, a disconsolate Carter watched from the sidelines on crutches after being ruled out due to a freak groin injury while practicing ahead of a group-stage match. \n\nHe was able to lift the coveted Webb Ellis Cup as his teammates celebrated, but behind the brave face lay another reality. \n\n“That World Cup was really tough for me,” the 33-year-old says. “As a team we performed extremely well and to win it was really exceptional, but on a personal level to be knocked out just before the playoff stages with such a serious injury was really tough to take. \n\n“I’ve had a few injuries throughout my career but that was probably my toughest one, and I was forever asking the whys. Why me? Why now? \n\n“I needed to remain really positive, not only for me to be able to bounce back from such a serious injury like that but also for the team as well. I wanted to help out the guys who moved into my position, and sobbing around the team wasn’t going to help anyone.” \n\nUnlike Sisyphus, who was punished by the Greek gods for his deceitful and self-important ways, Carter is one of rugby’s genuine nice guys. \n\nFor all the individual plaudits he receives, for all the endorsement deals that put his picture up on billboards around the world — often dressed in just underwear — he is at heart a dedicated team man. \n\n“One of his greatest qualities is that the team always comes first,” New Zealand captain Richie McCaw told CNN. \n\n“He’s been one of the best players in the world for a long time but it’s still the All Blacks and the team performing that’s more important than him. He’s always just one of the boys who wants to see the team do well, which is a pretty special trait.” \n\nAfter McCaw famously played with a broken foot to help New Zealand beat France in the 2011 final, Carter focused on rehab as he banished thoughts of ending his international career and signing with an overseas club — having already had a brief, lucrative stint with Perpignan during a six-month sabbatical which was predictably cut short by injury — this time a ruptured Achilles tendon. \n\nIn 2012, he was named IRB world player of the year for the second time, and in 2013 he became just the fifth New Zealander to play 100 Test matches — though he had to leave the field after less than half an hour of that milestone game against England at Twickenham. \n\nInjuries continue to haunt him. Carter broke his leg in last year’s Super Rugby final, playing for the Crusaders franchise in the southern hemisphere competition. \n\nAnother setback in February sparked doubts he would feature at another World Cup, but a commanding performance in his final international on home soil against Australia last month sealed his place in the squad traveling to England. \n\n“I really wanted to finish on a high and the fact that it was a do-or-die game playing for the Bledisloe Cup — which means so much to this team — was huge, there was a lot riding on that game,” Carter says. \n\n“It wasn’t until after the final whistle when I had all this joy, and I just loved this feeling of standing out on Eden Park with my teammates feeling so happy, and then I realized this was going to be the last time that I get to experience this feeling in New Zealand. It was quite sad, I didn’t want that feeling to end.” \n\nRegularly listed among sport’s sexiest athletes, Carter now has a young family to look after — in late 2011 he married his longtime girlfriend, former New Zealand hockey player Honor Dillon, and this year their second boy was born. \n\n“I probably only see them about 50% of the year, which can be really challenging,” he says. “At the same time you realize it’s such a small window being a professional rugby player in terms of your lifetime, so you want to make the most of the opportunity and live each day like it’s your last. When you do spend time with your family, you just make the most of it.” \n\nAfter this World Cup, Carter will join French club Racing Metro, having agreed a three-year deal worth a reported $1.6 million each season that will make him rugby’s highest-paid player. \n\nIt’s a long way from his formative days in the tiny South Island town of Southbridge — population less than 800 — where he spent endless hours kicking a ball over goalposts his dad built for him in the family’s front garden. \n\n“That’s where it all started — that’s probably the best birthday present I ever received,” recalls Carter, who as a child was inspired by the New Zealand team that won the inaugural World Cup at home in 1987. \n\n“It was always a dream to play for the All Blacks but I never really thought it would happen, so I was out there just having fun, just throwing the ball around, kicking the ball around with my mates, by myself, with whoever I could find. I think that gave me the skill set and the base to be at the level I am playing at today.” \n\nMcCaw, who first played with Carter in Canterbury’s provincial team in 2002, said his friend has never lost that approach to training. \n\n“I think people perhaps watch him on TV and think this is a great player, but they don’t see how much hard work he puts in. He practices harder than anyone I know and he’s always the last one to leave — extra kicking, extra things that make him the man he is,” McCaw says. \n\n“He can do it all — ball in hand, he can tackle, he can kick, so as a fly-half he’s got all the skills to be a threat wherever and he’s a great man to have in your team.” \n\nFor Carter it’s all about being part of a team, on and off the field. \n\n“Rugby is something that builds friendships. I don’t think I could compete in an individual sport,” he says. \n\n“The beauty of rugby is as soon as that final whistle has gone, your enemies are also your friends as well, and I love that camaraderie about the game. \n\n“My friendships, my best mates, are all because of rugby. Whether teammates or opponents, they are friends for life.” \n\nCarter’s role in the No. 10 jersey means he is the team’s playmaker, directing tactics once the forward pack controls possession. \n\n“My role within the team has changed over the years. My first few years I was a young, pretty quiet guy,” he says. \n\n“Now I am very vocal when I am out on the field, I am demanding of other players. I also have to be a good listener because the guys are often telling me what they are seeing, and I have to take that information in to make sure I’m making the right decision. \n\n“It’s my 13th year in the side so I’m one of the older guys and so I need to be working really hard with the younger guys and get them up to speed, but be a real leader.” \n\nCarter needed all his experience in the All Blacks’ opening match of the 2015 World Cup, as New Zealand came from behind to beat Argentina 26-16 in front of a record rugby crowd of almost 90,000 at London’s Wembley Stadium on Sunday. \n\nHe kicked 16 points to extend his record tally to 1,532 in his 107th international appearance, putting him 286 clear of nearest rival Jonny Wilkinson, whose final Test was in 2011. \n\n“For me it’s more about the bigger picture of doing whatever I can to help this team go all the way — I am just a small cog in this side,” says Carter, who will sit out Thursday’s second Pool C match against Namibia at London’s Olympic Park as coach Steve Hansen makes 12 changes. \n\n“To be there at the end of the tournament and be lifting that Rugby World Cup up would be a dream come true. We are wanting to create history, do things that other teams have never done before and just have this mindset of being the most dominant team in the history of world rugby.” \n\nIf Carter can finally land rugby’s holy grail in the final on October 31, there will be few denying that he’s earned it. The sporting gods, no doubt, are keeping a close eye on his progress.", "source": "949 KCMO"}