{"published": "2015-09-25T17:59:35Z", "media-type": "News", "title": "Bill to help Matao well supported", "id": "9ce46abd-081d-4fef-88ea-416aa17e9cae", "content": "Guam men's national team logo (Photo: Guam Football Association) \n\nA public hearing for Bill 152-33 received overwhelming support Friday from the community on Guam. \n\nThe bill proposes to provide the Guam Football Association with $400,000, allowing the Guam national team, the Matao, to host, attend and participate in FIFA 2018 World Cup and AFC Asian Cup 2019 Preliminary Joint Qualification matches. The $400,000 will be appropriated to Guam Visitor’s Bureau from the fiscal year 2014 Hotel Occupancy Tax Surplus Fund. \n\n\n\r\nThe president of the Guam Football Association, Richard Lai, noted in his presentation that in order to participate and host these World Cup Qualifying games, a total of $1.2 million would be needed. FIFA provided seed money to Guam in the amount of $300,000, the Guam Visitors Bureau provided $300,000, and $200,000 came from selling TV broadcast rights. The $400,000 appropriation from the fiscal year 2014 Hotel Occupancy Tax Surplus Fund will round off the needed funding. \n\nLai also mentioned that if they can’t get the needed funding to host and participate in the competition, the Matao would have to withdraw from the competition. As a result, the momentum of soccer on Guam that the team built from past qualifying matches would be lost. \n\n\n\r\nThe testimonies at the hearing brought together a well-rounded discussion from the public, and the return on the investment was one of the most important topics covered in the hearing. One return anticipated is the financial gain from the tremendous exposure of Guam. \n\n\n\r\nGFA Vice President Joe Cepeda spoke about the immediate return on investment that hosting and participating in these qualifying events would have.“With our participation, hosting and recent success in the FIFA 2018 World Cup and AFC Cup 2019 Preliminary Joint Qualification matches, Guam has received tremendous worldwide publicity. This publicity will enhance Guam as a sports tourism destination,” Cepeda said. \n\n\n\r\n“Our return on investment will be great and far-reaching, from developing the community, improving our society, and creating opportunities through sports tourism,” he said. \n\nInformation was provided in a press release. \n\nRead or Share this story: http://www.guampdn.com/story/sports/2015/09/25/bill-help-matao-well-supported/7279119", "source": "Guam Pacific Daily News"}