{"published": "2015-09-02T13:00:00Z", "media-type": "News", "title": "Ed Skrein: Me and Statham would be dream team", "id": "55eae05b-22a6-4bab-9dc2-b9947736451c", "content": "2nd Sep 15 | Entertainment News  \nEd Skrein is desperate to team up with Jason Statham. \n \nEd Skrein dreams of being as impressive in action scenes as Jason Statham. \n\nThe two stars have a little something in common, as Ed is appearing in The Transporter Refuelled. It's the fourth film in The Transporter franchise and sees Ed replacing Jason as lead character Frank Martin. Frank is a highly-skilled driver who is known for being able to get any package from one place to another, no questions asked. \n\nStepping into Jason's shoes was a big moment for Ed, who is in awe of the older star. \n\n\"I'd love to work with him at some point if he was interested and it was right for the both of us. He's incredible and his skills in the action field are incredibly advanced. If I work hard and train hard, I can only hope to be close to what he's achieved,\" he told screenrant.com. \n\nThis isn't the only major flick Ed is involved with. He's also scored a role in the eagerly-anticipated Deadpool, where Ryan Reynolds takes on the eponymous antihero. \n\nEd's character is villain Ajax, but he's tight-lipped about whether we'll be seeing him on screens again. \n\n\"[Tim Miller is] one of the directors I've most enjoyed working with. I feel like he got the best out of me in a lot of ways, so I'd love to work with him again whether it's another Deadpool movie or whether it's something else,\" he said. \"We'll have to wait and see. I'm just such a fan of what Ryan has done with the role and I'm just so proud to have done the one movie. Again, if it turns into 20 movies, great, or if it's just the one, I'm happy to have had the experience and the growth.\" \n\nAlthough he's achieved a lot so far, there are still career areas Ed wants to explore. One of those would be taking on a superhero role himself, as he isn't all about the bad guy. \n\n\"There's so many superheroes that I'd love to play, man. I always looked at Thundercats. I'd love to play Panthro! He was always a really cool dude, but then there's Lion-O!\" he laughed.", "source": "TV3 Ireland"}