{"published": "2015-09-15T00:58:37Z", "media-type": "News", "title": "Liberal leadership: Zed Seselja 'disappointed' after Tony Abbott loses to Malcolm Turnbull", "id": "80afa7ab-bf2d-4e1d-908e-b7cd0d6e5daf", "content": "What the ACT politicians said, including the man who backed Tony Abbott to the end. Liberal senator Zed Seselja is \"very disappointed\" the leader he loyally served, Tony Abbott, was toppled by Malcolm Turnbull on Monday night and says the party should not forget its conservative supporters across the nation.\n\nThe ACT's only Liberal senator said he would \"back Tony Abbott 100 per cent\" going into the leadership challenge and on Tuesday was dealing with the setback of Mr Abbott's ousting and the prospect of the Liberal Party facing division.\n\n\"I'm very disappointed,\" Mr Seselja said.\n\n\"It's critically important that the Liberal Party continues to strongly represent conservative Australians.\"\n\nSenator Seselja had previously told media . At the time, he said those moving the spill motion did not represent a majority of Liberal MPs and senators.\n\nBut Liberal member for Eden-Monaro Peter Hendy supported the leadership change, voting for Mr Turnbull on Monday night.\n\n\"I thought the timing was an issue obviously, and there was a view taken by Malcolm and Julie Bishop that rather than see a very, very bad result in the Canning byelection... the time to act was yesterday and that's what happened,\" he said on ABC radio on Tuesday morning.\n\nMr Hendy said accusations that the Liberal's party right voted against Mr Turnbull were inaccurate, describing the right as \"splintered\" and Mr Turnbull's winning margin as \"very big\".\n\nIf Mr Hendy's bellwether seat was an indicator of political opinion across Australia, the tide was turning against Mr Abbott, he said.\n\n\"I was getting a lot of commentary from my constituents that the government needed to strengthen the strategy, particularly on the economy and particularly on explaining it to them and to Australians what we were doing,\" he said.\n\n\"I think Malcolm Turnbull, with his pre-parliamentary career, his time as a cabinet minister for many years, will strongly, strongly improve on that ability of the government.\"\n\nBut Labor MP Andrew Leigh said Australia \"can't move beyond the current national paralysis\" while the Liberal Party remained in power.\n\n\"Malcolm Turnbull has said he supports 'every element' in the Liberals' two unfair budgets,\" Dr Leigh said.\n\n\"He has promised there will be no change to their ineffective climate policies, and no progress on critical social issues like marriage equality.\n\n\"So it makes no difference whether it's Tony Abbott or Malcolm Turnbull who leads the Liberals – it's their entire party that is holding Australia back.\"\n\nDr Leigh swept aside suggestions Mr Turnbull's leadership would threaten Labor in the lead-up to the federal election while speaking on ABC radio Tuesday morning.\n\n\"If we can have a more sensible conversation about the future then I think that's terrific,\" he said.\n\n\"We're up for a policy-focused conversation. The question is whether Malcolm Turnbull is willing or able to move beyond the bad polices that have brought the Liberal Party to this point.\"\n\nDr Leigh acknowledged Mr Turnbull was a good speaker but said he wouldn't tie himself to unreliable, \"horse race\" opinion polls.\n\n\"Malcolm Turnbull is a good speaker; I've said to him that he should have the permanent role as parliamentary eulogist,\" he said.\n\nACT Chief Minister Andrew Barr said Mr Turnbull's ascendancy should herald in a time for \"serious progress on a number of key areas that impact upon Canberrans and the broader Australian public\".\n\n\"Primarily the Commonwealth's funding cuts to hospitals and schools,\" Mr Barr said.\n\n\"This was a broken promise by the Coalition that will have significant ramifications in the years to come.\n\n\"I hope Mr Turnbull will be willing to work closely with the state and territory leaders on reversing these decisions to ensure that all Australians continue to have access to quality public health and education.\n\n\"I would encourage Mr Turnbull to prioritise progress on reform of the Federation and a serious discussion on taxation reform.\n\n\"It's also crucial that the government tackles marriage equality and climate change – two areas in which Tony Abbott failed to take significant action in line with community expectations.\n\n\"The rollout of the National Broadband Network should also be a priority for a Turnbull government, especially to areas of Canberra that are experiencing poor internet service.\"\n\nACT Chief Minister Andrew Barr congratulated Mr Turnbull agreeing it was \"a very exciting time in Australia\".\n\n\"Our country needs strong leadership from the federal government, and I hope Mr Turnbull will bring this leadership and face some of the economic challenges the nation is experiencing,\" Mr Barr said.\n\nMr Barr said Mr Abbott's downfall was another example of the brutality of modern politics. The story first appeared on The Sydney Morning Herald.", "source": "Grenfell Record"}