{"published": "2015-09-02T12:13:00Z", "media-type": "News", "title": "$10 million from Robert Fox '59 gives rise to $27 million financial aid partnership at Colgate University", "id": "59b520dc-db8f-4309-b282-87312d75490a", "content": "HAMILTON, N.Y. , Sept. 2, 2015 /PRNewswire-USNewswire/ -- Robert Fox '59, of Reno, Nev. , has been a leader, mentor, and friend to many people at Colgate University , and beyond. So when he invested $10 million in financial aid at his alma mater in Hamilton, N.Y. , last July, others were quick to trust his wisdom and join the Fox Partnership. \n\nKeen to sustain the momentum of financial aid fundraising at Colgate , Fox offered his gift as inspiration. Ultimately, 26 partners each invested a minimum of $250,000 . They amassed a total of nearly $27 million in just 12 months, in some cases directing their support to financial aid for the first time. \n   \nAt a dinner held recently in his honor, Fox told guests, \"I've had a great life, and it happened because I went to Colgate . I was only able to be there because of financial aid.\" \n\nFox, now 78 and mostly retired, knows his gift will impact hundreds of lives while also raising awareness for the impact of financial aid. \"Financial aid can enable students to live their lives to their full potential,\" he said. \n\nEvery one of the Fox partners expresses love and gratitude for Colgate . Of the 26 partners, 16 have sent one or more of their children to Colgate . Fourteen graduated in the 1980s, and there are three Colgate couples. \n\nAt Colgate , where the average aid award in 2015–2016 was $46,602 , Fox Partnership proceeds will go a long way, especially when combined with the $142 million raised for financial aid during the university's recent Passion for the Climb campaign and the $45 million raised in the two years since. \n\nThe partnership total includes $11.77 million in estate and life-income arrangements and $15.05 million in cash — it also provides ongoing incentive for others to support Colgate's financial aid program in years to come. \n\n\"Financial aid ensures not only access and socioeconomic diversity, it also widens the pipeline for the best and brightest students,\" said Murray Decock '80, senior vice president for external relations, advancement, and initiatives. \"Access is a passport to opportunities, achievement, and career fulfillment. Thanks in large measure to Bob Fox and his partners, the word is out that Colgate is more accessible than ever, and counselors are now steering an ever-more diverse group of students to our campus.\" \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/10-million-from-robert-fox-59-gives-rise-to-27-million-financial-aid-partnership-at-colgate-university-300136386.html \n\nSOURCE Colgate University", "source": "CEOWorld Magazine"}