{"published": "2015-09-23T00:17:39Z", "media-type": "News", "title": "Belichick credits Brady’s work ethic for his longevity in NFL", "id": "3f5570bd-18b3-4071-b00b-c829c1babebc", "content": "Tom Brady has already stated that he won’t retire until he sucks . In that case, the Patriots’ 38-year-old quarterback seems to have a lot of football ahead of him. \n \nThrough his first two weeks in the 2015 season, Brady has completed 69.2 percent of his passes for 754 yards, seven touchdowns, and zero interceptions. New England Patriots head coach Bill Belichick credited Brady’s diligence when discussing his continued success during a conference call on Tuesday. \n \n“Tom works really hard,” Belichick told reporters . “He takes great care of himself, and he works really hard physically to be ready to go. I have great respect for the way he competes all over the field in terms of his preparation, physically and as far as knowing our opponent and the game plan and all that. That’s a big part of it.” \n  - Continue Reading Below \n   \nEarlier this week, Brady cited his mental preparation and experience as reasons why he’s rarely fooled in pre-snap reads. A February 2015 profile in The New York Times Magazine  chronicled the lengths that Brady physically prepares to play as long as possible, tailoring his diet, sleeping habits, and workout plans. \n \n“He’s a tremendous worker,” Patriots offensive coordinator Josh McDaniels said Tuesday when asked about Brady’s battle against Father Time . “He spends the entire year preparing his body and his mind, and I would go so far as to say the emotions and those types of things that we have to put into this job and that he has to put into it as a player. He spends a huge chunk of time getting himself prepared and ready to do the things that he wants to do. \n \n“He has high expectations and high goals for himself. He knows that it’s going to take a tremendous amount of work to continue performing at the level that he wants to play at. I think he deserves a lot of credit for that.” \n \n Tom Brady Career Timeline  \n         In 29 college games with the Michigan Wolverines, Brady completed 61.9 percent of his passes for 4,773 yards with 30 touchdowns and 17 interceptions. \nAP/John L. White \n       Brady had a very unspectacular NFL combine, failing to impress NFL scouts in athletic testing drills. \nNFL \n       The Patriots drafted Brady with the 199th pick in the sixth round of the 1999 NFL Draft. He spent his rookie season backing up Drew Bledsoe at quarterback. \nBill Greene/Boston Globe \n       Bledsoe suffered a sheared blood vessel in his chest after a brutal hit against the Jets in Week 2 of the 2001 season. Brady became QB1 for the Patriots. \nJim Davis/Boston Globe \n       After Brady started the next eight games, Patriots coach Bill Belichick opted to stick with the kid even when Bledsoe was cleared to return. \nJim Davis/Boston Globe \n     \n       Brady ran for a touchdown — in the snow — in his first playoff game, the AFC divisional round game vs. the Raiders. It was the final game in the old Foxboro Stadium. \nBarry Chin/Boston Globe \n       On one of the most controversial plays in NFL history, Brady’s fumble against the Raiders is overturned on the “Tuck Rule,” preserving the Patriots’ season. \nMatthew J. Lee/Boston Globe \n       Brady sustained a leg injury in the AFC Championship game at Pittsburgh, but Bledsoe came off the bench to lead the Patriots to the Super Bowl. \nBarry Chin/Boston Globe \n       Brady threw a touchdown pass to David Patten on this play in Super Bowl XXXVI. Brady was named MVP as the Patriots defeated the Rams, 20-17. \nBill Greene/Boston Globe \n       Brady is in disbelief following the Patriots upset victory over the Rams in Super Bowl XXXVI. \nJim Davis/Boston Globe \n     \n       Following the Patriots’ Super Bowl victory over the Rams, Brady went to Disney World. \nAP/Peter Cosgrove \n       Brady made the Pro Bowl in his first season as a starting quarterback. Through the 2014 season, he’s made 10 Pro Bowls. \nAP/Reed Saxon \n       Bledsoe was traded to the division rival Bills in 2002. The Patriots won five out of six games against the Bledsoe-led Bills teams from 2002 through 2004. \nJim Davis/Boston Globe \n       The Patriots went just 9-7 and missed the playoffs in 2002, Brady’s first full season as the starter. \nMatthew J. Lee/Boston Globe \n       The Patriots returned to the playoffs in 2003 with a league-best 14-2 record. Here, Brady connects on a deep touchdown to Bethel Johnson in a 17-14 win over the Titans in the divisional round. \nBarry Chin/Boston Globe \n     \n       Brady outdueled Peyton Manning in the 2003 AFC Championship game at Gillette, and the Patriots beat the Colts 24-14. \nStan Grossfeld, Boston Globe \n       Brady throws a touchdown pass to linebacker/redzone tight end Mike Vrabel in Super Bowl XXXVIII. \nMatthew J. Lee/Boston Globe \n       Brady celebrates Adam Vinatieri’s game-winning field goal to beat the Panthers in Super Bowl XXXVIII. \nStan Grossfeld, Boston Globe \n       Brady dated movie star Bridget Moynahan for three years between 2004 and 2006. The couple had a child together in 2007. \nAP/Chris Pizzello \n       Brady and the Patriots made three trips to the White House during George W. Bush’s time in office. \nAP/Ron Edmonds \n     \n       The Patriots traded for running back Corey Dillon in 2004. He ran for a franchise-record 1,635 yards in 2004 and gave Brady the most productive backfield mate of his career. \nMatthew J. Lee/Boston Globe \n       The Patriots set an NFL record with 21 consecutive victories between 2003 and 2004, but the streak was snapped by the Pittsburgh Steelers  in Week 8 of the 2004 season. \nJohn Bohn/Boston Globe \n       Brady topped Manning again in the AFC divisional round, as the Patriots bested the Colts 20-3. \nBarry Chin/Boston Globe \n       Brady and the Pats enacted revenge over Pittsburgh with a 41-27 victory in the AFC Championship game. \nJim Davis/Boston Globe \n       Brady connected with Vrabel for a second Super Bowl touchdown in as many years. The Patriots beat the Philadelphia Eagles 24-21 and cemented themselves as a dynasty with a third championship in four years. \nBarry Chin/Boston Globe \n     \n       Brady hoists his third Lombardi Trophy. \nJim Davis/Boston Globe \n       Brady and the Patriots paraded through Boston following the team’s third Super Bowl in four seasons. A decade would pass before they would do it again. \nStan Grossfeld/Boston Globe \n       Brady hosted Saturday Night Live in April of 2005. Yes, that’s Amy Poehler and Beck on stage with him. \nAP/Dana Edelson \n       Ben Watson caught this touchdown pass from Brady, and the Patriots rolled past the Jacksonville Jaguars in the 2005 wild card round. \nJim Davis/Boston Globe \n       Brady’s 10-0 postseason record went up in flames in the divisional round in Denver. The Broncos beat the Patriots 27-13. \nBarry Chin/Boston Globe \n     \n       The Patriots trounced the Jets 37-16 in the wild card round of the 2006 playoffs. \nBarry Chin/Boston Globe \n       Brady threw an interception late against the Chargers in the divisional round, but Troy Brown’s strip kept the season alive and Brady finished the comeback win. \nJim Davis/Boston globe \n       But a stunning comeback by Manning and the Colts knocked the Patriots out of the 2006 AFC Championship game. \nJim Davis/Boston Globe \n       Brady begins dating supermodel Gisele Bundchen in 2006. They are currently married with two children. \nGlobe file photo \n       The Patriots traded for star receiver Randy Moss in 2007, proving to ignite the offense and helped Brady take his game to new heights. \nJim Rogash/ \n     \n       This  touchdown pass in week 17 set single-season records for passing (Brady, 50) and Moss (receiving, 23) scores in a season. The Patriots went 16-0 in the 2007 regular season, and Brady was voted league MVP. \nBarry Chin/Boston Globe \n       For the second straight year, Brady and the Patriots knocked the Jaguars out of the playoffs. \nJim Davis/Boston Globe \n       Brady and the Pats moved to 18-0 with their AFC Championship game victory over the Chargers. \nMatthew J. Lee/Boston Globe \n       TV reporter Ines Gomez Mont proposed to Brady at Super Bowl Media Day. \nStan Grossfeld/Boston Globe \n       The New York Giants pulled off the biggest upset in Super Bowl history, ruining the Patriots’ perfect season with a 17-14 win. \nBarry Chin/Boston Globe \n     \n       Brady tears the ACL in his left knee in Week 1 of the 2008 season, ending his season. \nJim Davis/Boston Globe \n       Brady returned in 2009 and threw a pair of TD passes in a comeback win over the Bills in Week 1. \nBarry Chin/Boston Globe \n       Brady and the Patriots got smoked on their home field in the AFC wild card round in 2009, falling to the Ravens 33-14. \nJim Davis/Boston Globe \n       In a sign of things to come, Brady hooks up with rookie tight end Rob Gronkoswi for three touchdowns in a Week 10 win over the Steelers. Brady was voted NFL MVP in 2010. \nJim Davis/Boston Globe \n       The Patriots throttled the Lions on Thanksgiving Day in 2010, and Brady got a tasty postgame snack for his efforts. \nMatthew J. Lee/Boston Globe \n     \n       Brady and the Patriots were upset on their home field by the rival New York Jets in the divisional round of the 2010 playoffs. \nStan Grossfeld/Boston Globe \n       Brady hits Wes Welker for a 99-yard touchdown, matching the longest play from scrimmage in NFL history and leading the Patriots over the Miami Dolphins in Week 1 of the 2011 season. \nJim Davis/Boston Globe \n       Brady has connected on more passes with Welker than any other receiver in his career (632). Deion Branch is second with 384. \nBarry Chin/Boston Globe \n       The Patriots knocked off the Ravens in the 2011 AFC Championship game, advancing to the fifth Super Bowl of Brady’s career. \nStan Grossfeld/Boston Globe \n       The Giants best Brady and the Patriots again in the Super Bowl, this time winning 21-17 after Brady’s “Hail Mary” goes unanswered on the final play. \nJim Davis/Boston Globe \n     \n       The Patriots blew out the Jets on Thanksgiving night in 2012, and Brady celebrated with teammates Vince Wilfork and Steve Gregory after the game. \nMatthew J. Lee/Boston Globe \n       Brady connected with Shane Vereen on this touchdown pass in the Patriots’ 2012 divisional round win over the Houston Texans. \nJim Davis/Boston Globe \n       The Ravens got revenge on Brady and New England in an AFC Championship rematch to end the Patriots’ 2012 season. \nJim Davis/Boston Globe \n       The Patriots overcame a 24-0 halftime deficit to beat the Broncos 34-31 in overtume in Week 12 of the 2013 season. \nMatthew J. Lee/Boston Globe \n       The Patriots dominated the Colts in the 2013 divisional round. \nStan Grossfeld/Boston Globe \n     \n       The Broncos were too much for Brady and the Patriots in the 2013 AFC Championship Game, which Denver won 26-16. \nMatthew J. Lee/Boston Globe \n       Brady and the Patriots got off to a rough start to the 2014 season, which hit rock bottom when Brady was benched in a Week 4 loss to the Kansas City Chiefs. \nAP/Charlie Riedel \n       In the five games following the loss to the Chiefs, Brady threw 18 touchdown passes and just one interception. The Patriots rebounded and finished 12-4 on the season. \nBarry Chin/Boston Globe \n       Brady ran for a touchdown in a thrilling 35-31 win over the Ravens in the 2014 divisional round. \nStan Grossfeld/Boston Globe \n       Another postseason beatdown of the Colts had Brady and the Patriots headed to their sixth Super Bowl in 14 years. \nBarry Chin/Boston Globe \n     \n       In the wake of the AFC Championship game, reports surfaced that the NFL was investigating the Patriots for using underinflated footballs. The Deflategate scandal was born. \nJohn Tlumacki/Boston Globe \n       Julian Edelman caught this touchdown pass that ultimately proved to be the game winner in Super Bowl XLIX. The Pats topped the Seattle Seahawks 28-24. \nBarry Chin/Boston Globe \n       At long last, Brady had won his fourth Lombardi Trophy. \nBarry Chin/Boston Globe \n       Brady gave his Super Bowl MVP truck to Malcolm Butler, a rookie cornerback who made the interception to clinch the game for the Patriots. \nAP/Josh Reynolds \n       Brady threw out the first pitch on Opening Day at Fenway Park in 2015. \nMaddie Meyer/ \n     \n       NFL investigator Ted Wells released a report on the Deflategate scandal, and determined Brady was “at least generally aware” of the Patriots “more probable than not” tampering with the footballs. \nGlobe File Photo \n       The NFL suspended Brady for four games for his role in Deflategate, and Commissioner Roger Goodell appointed himself to hear Brady’s appeal. \nAP/Charles Rex Arbogast \n       On June 23, 2015, Brady’s team makes their case for exoneration during a 10-hour testimony in New York City. \nAP/David J. Phillip \n       More than a month after the NFL heard Brady’s appeal, Goodell upheld the original four-game suspension handed down by the league. In its announcement, the NFL cited information about the destruction of Brady’s cell phone disclosed after the release of the Wells Report. \nReuters/Lucy Nicholson \n       Tom Brady’s team wins in federal court. After several weeks of failed negotiations between Brady and the NFL, U.S. District Court Judge Richard Berman ruled to nullify the New England Patriots quarterback’s four-game suspension.Platt/) \nSpencer Platt \n     \nAdvertisement", "source": "Boston.com"}