{"published": "2015-09-18T22:00:49Z", "media-type": "Blog", "title": "Why only eight years?", "id": "d63353aa-58f1-413d-8f60-fac44c41d4b7", "content": "The Dom Post reports : \n \nA Wellington woman tried to explain to a brutal rapist that she could be pregnant with her first child and begged him not to hurt her. \n \nIt did not matter to Bailey Meredith, 17, who violated her over and over during an attack on the Hutt River riverbank on June 11 before beating her unconscious. \n \nShe had been out walking when he had grabbed her from behind, ordering her to her knees before saying he intended to rape her. \n \nThe victim went on to explain about IVF which she and her husband had been going through but it made no difference.  They were to find out if she was pregnant that weekend instead she was being treated for her injuries and tested for sexually transmitted diseases. \n \nMeredith had pleaded guilty to rape, four charges of unlawful sexual connection, abduction with intent to rape, wounding with intent to injure and threatening to kill.  He has been jailed for eight years. \n \nThat seems light to me. In 2010 I blogged the Court of Appeal guidelines being : \n  Rape Band 1 (6 to 8 yrs) – offending at the lower end of the spectrum where there are no aggravating factors, no serious violence, no abduction, the victim is not very young or very old.  Rape Band 2 (7 to 13 yrs) – involves moderate violence, pre-meditation, a rape involving more than one offender, or an especially vulnerable victim  Rape Band 3 (12 to 18 yrs) – offending with serious additional violence, wit multiple (three or more) aggravating factors. For particularly cruel, callous or violent rapes.  Rape Band 4 (16 to 20 yrs) – for multiple offending over considerable periods of time, gang or pack rape.   \nThere was obvious serious violence that left her unconscious.  It would seem to me the case would be Rape Band 2 or 3, not Rape Band 1. \n \nOfficer in charge of the investigation, Detective Sergeant Nick Pritchard, said it was one of the worst cases he had investigated. \n \n“This was a sexual attack that involved extreme violence. It was one of the most violent sexual attacks I’ve seen in my career,” he said. \n \nSo eight years seems rather light. He did plead guilty which gets 10% to 33% knocked off.  But in theory he could be out of jail in under three years. \n \n  \nTags: rape", "source": "Kiwiblog"}