{"published": "2015-09-08T13:05:00Z", "media-type": "News", "title": "Gerstein Fisher Multi-Factor® Growth Equity Fund (GFMGX) Receives Five-Star Morningstar Rating Business Wire", "id": "892a598c-d554-457b-a016-6a5c9aaa844a", "content": "3 minutes ago \n\nDone \n\nNEW YORK--(BUSINESS WIRE)-- \n\nGerstein Fisher, an investment management firm specializing in multi-factor investing, today announced that the Gerstein Fisher Multi-Factor® Growth Equity Fund (GFMGX) received a Five-Star Overall Morningstar Rating™ as of August 31, 2015. This rating, the highest possible from Morningstar, is based on a 3-year (vs. 1,528 funds) and 5-year (vs 1,325 funds) weighted-average of risk-adjusted total return in Morningstar's Large Growth Category. \n\nMorningstar rates mutual funds from 1 to 5 stars based on how well they've performed after adjusting for risk and accounting for sales charges, in comparison to similar funds. \n\n“Our distinct approach to factor-based investing aims to deliver the best potential for sustainable long-term results for investors through well diversified, smartly constructed portfolios,” said Gregg S. Fisher, Gerstein Fisher’s Chief Investment Officer and Portfolio Manager of Gerstein Fisher Funds. “We are proud of the integrity of our process and the resulting performance of not only GFMGX, but also our two other Multi-Factor® funds.” \n\nThe Gerstein Fisher Multi-Factor® Growth Equity strategy uses a quantitative investment model that provides diversified exposure to domestic growth-oriented companies. This strategy is designed to add value over benchmarks by tilting the portfolio toward investment factors that include, but are not limited to, profitability, price momentum, relative valuation, and company size. \n\nGerstein Fisher Funds also include Gerstein Fisher Multi-Factor® International Growth Equity Fund (GFIGX, also rated Five Stars by Morningstar vs. 300 funds in the Foreign Large Growth category as of August 31, 2015 based on 3-year return), which invests in large international growth companies, and the Gerstein Fisher Multi-Factor® Global Real Estate Securities Fund (GFMRX), one of few global REIT funds to employ a quantitative management approach. \n\nAbout Gerstein Fisher \n\nGerstein Fisher is an investment management and advisory firm headquartered in New York City. Founded in 1993 by Chief Investment Officer and Portfolio Manager Gregg S. Fisher, the firm manages assets using a quantitative approach grounded in economic theory and time-tested academic research. Drawing on a deep understanding of both market dynamics and investor behavior, Gerstein Fisher has more than two decades of experience creating innovative solutions for the challenges faced by today’s investors. For more information, please visit www.GersteinFisherFunds.com. \n\nAbout the Gerstein Fisher Multi-Factor® Investment Approach \n\nThe Gerstein Fisher Multi-Factor® investment approach is designed to offer core asset class representation plus the potential for strong, consistent results for investors with a long-term investment horizon. This approach can leverage market-based information to help identify securities with the potential for higher expected returns. \n\nAbout Morningstar Ratings \n\nFor each fund with at least a three-year history, Morningstar calculates a Morningstar Rating™ based on a Morningstar Risk-Adjusted Return measure that accounts for variation in a fund’s monthly performance (including the effects of sales charges, loads, and redemption fees), placing more emphasis on downward variations and rewarding consistent performance. \n\nThe top 10% of funds in each category receive 5 stars, the next 22.5% receive 4 stars, the next 35% receive 3 stars, the next 22.5% receive 2 stars and the bottom 10% receive 1 star. (Each share class is counted as a fraction of one fund within this scale and rated separately, which may cause slight variations in the distribution percentages.) The Overall Morningstar Rating™ for a fund is derived from a weighted average of the performance figures associated with its three-, five- and ten-year (if applicable) Morningstar Rating metrics. \n\nGerstein Fisher Multi-Factor® International Growth Equity Fund (GFIGX) was rated against the following numbers of Foreign Large Growth Category funds as of August 31, 2015, over the following time periods: 300 funds in the last three years. With respect to these Foreign Large Growth Category funds, Gerstein Fisher Multi-Factor® International Growth Equity Fund (GFIGX) received a Morningstar Rating of five stars. Fund inception date January 2012. Past performance is no guarantee of future results. \n\nGerstein Fisher Multi-Factor® Growth Equity Fund (GFMGX) was rated against the following numbers of Large Growth Category funds as of August 31, 2015, over the following time periods: 1,528 funds in the last three years and 1,325 funds in the last 5 years. With respect to these Large Growth Category funds, Gerstein Fisher Multi-Factor® Growth Equity Fund (GFMGX) received a Morningstar Rating of four stars in the 3 year period, five stars in the 5 year period, and a Five-Star Overall Morningstar Rating™. Fund inception date January 2010. Past performance is no guarantee of future results. \n\n© 2013 Morningstar, Inc. All Rights Reserved. The information contained herein: (1) is proprietary to Morningstar and/or its content providers; (2) may not be copied or distributed; and (3) is not warranted to be accurate, complete or timely. Neither Morningstar nor its content providers are responsible for any damages or losses arising from any use of this information. Past performance is no guarantee of future results. \n\nAlpha measures the difference between a fund’s actual and expected returns, based on beta, and is generally used as a measure of a manager’s added value over a passive strategy. Beta measures a fund’s sensitivity to market movements. The beta of a market is 1.00 by definition. \n\nGerstein Fisher is an SEC registered investment adviser located in NYC. A copy of our written disclosure statement discussing the scope of our services, fees and conflicts is available upon request or at www.GersteinFisher.com. Please remember that different types of investments involve varying degrees of risk, and it should not be assumed that future performance of any specific investment or investment strategy (including the investments and/or investment strategies recommended and/or undertaken by Gerstein Fisher) or any investment-related or financial planning consulting services will be profitable, or prove successful. \n\nRankings and/or recognition by unaffiliated rating services and/or publications should not be construed by a client or prospective client as a guarantee that he/she will experience a certain level of results if Gerstein Fisher is engaged, or continues to be engaged, to provide investment advisory services, nor should it be construed as a current or past endorsement of Gerstein Fisher by any of its clients. Rankings published by magazines, and others, generally base their selections exclusively on information prepared and/or submitted by the recognized adviser. \n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150908005232/en/", "source": "Yahoo! Finance"}