{"published": "2015-09-04T21:25:57Z", "media-type": "Blog", "title": "September is Ice Cream Sandwich Month #tastefullysimple", "id": "1232ffd9-3908-42d9-941a-69fcd503e5dc", "content": "Disclosure of Material Connection: I received one or more of the products or services mentioned above for free in the hope that I would mention it on my blog. Regardless, I only recommend products or services I use personally and believe will be good for my readers. I am disclosing this in accordance with the Federal Trade Commission's 16 CFR, Part 255: \"Guides Concerning the Use of Endorsements and Testimonials in Advertising.\"TASTEFULLY SIMPLE ICE CREAM DESSERTS\nSumer might be ending soon but having Ice Cream will never end in our house.  My kids will eat ice cream every day if they can- maybe they do already!  My daughter loves to make our dessert on weekends and Tastefully Simple makes it so easy for her.  Did you know September is Ice Cream Sandwich month?   I didn’t but my daughter knew and so on September 1st she made us all sandwiches in the bowl though- you see how much she loves the Caramel! I had to tell her not so much on mine but it sure did taste wonderful!  Making the cookies was so easy for her- I didn’t have to help her at all, she is 11 yrs old.  We enjoying using Tastefully Simple products for all our meals.   Here are some recipes we want to share with our readers~  Image courtesy of Tastefully Simple, Inc. Used with permission Chewy Chocolate Ice Cream Sandwiches Recipe featuring Chewy Chocolate Cookie Mix ($7.99) and Ice Cream Salt Trio ($12.99) Image courtesy of Tastefully Simple, Inc. Used with permission Grilled Banana Split Recipe and Truffle Fudge Ice Cream Cake Recipe featuring Truffle Fudge Brownie Mix ($7.99) and Creamy Caramel Sauce ($8.99) BONUS: Ice Cream Bread featuring Bountiful Beer Bread Mix ($5.99) and Ice Cream Salt Trio ($12.99) Mix 1 box of Beer Bread Mix with a 48 oz or 1.5 qt tub of softened ice cream (Butter Pecan or Toffee recommended). Combine well and pour into 8X8 baking pan Top with Cinnamon and sugar or an Ice Cream Salt Bake as directed on Beer Bread Mix The Ice Cream Bread is this weekends special treat for our BBQing we are doing. We will be sharing with our new neighbors. Tastefully Simple is one of our main staples in the house, I know everything I make with their products turn out so good and tasty.  Please check out all their PRODUCTS- HERE   We also used the brownie mix – Sahara made a Waffle Bowl Sundae with Brownie and Carmel:  Connect with Tastefully Simple on Facebook–Twitter–Pinterest   I couldn’t believe all the yummy recipes and ideas I saw. Please Share Related", "source": "Kellys Thoughts On Things"}