{"published": "2015-09-15T05:32:01Z", "media-type": "News", "title": "Yay! for ArtsWest’s American Idiot", "id": "f03cc662-fc1c-439e-ae0a-594164f969e8", "content": "Justin Huertas, Frederick Hagreen, Michael Cole Grey appear in Green Day's American Idiot now in production at ArtsWest in the West Seattle Junction. By Amanda Knox \n \nArtsWest Theatre’s latest production, Green Day’s American Idiot, is so ambitious it’s hard to know where to start to describe it. \n \nNinety percent of the theatre facility is actively in use. Seventy members comprise the cast and crew. With a full house, there are 180 audience members, sixty of which are split up into three immersive tracts herded through a stage comprised of main floor, scaffolding, traveling staircase, trap doors, underground rooms, and back hallways. \n\n \nThe organization that went into this production is impressive. Stunning, even, considering that Mat Wright’s cabaret series ran all summer and the production team had full access to the performance space for only a few weeks prior to opening night. In true punk-rock spirit, the production team, directed by Eric Ankrim, brought together the biggest show possible with lots of small parts and under the most pressure. \n \nWhether observing from a seat or roaming the stage, for the audience member there is never a moment when or a direction from which there isn’t something to look at. Indeed, if you aren’t running into something—like a druggy having a fit in the back stairwell—, something is running into you. On one of the immersive tracks myself, Trent Moury, playing St. Jimmy, hovered so intimidatingly close to my face that the microphone taped to his cheek brushed my nose. A little later, a female ensemble member took my hand and skipped down the stairs with me to the next location, jittery with excitement about the party we were apparently going to together. \n \nIf you’re familiar with American Idiot the album, you’ll recall that while it was originally written with strong narrative qualities that tackled dramatic, post-9/11 realities, it was still a pump-you-up rock album. American Idiot the musical is darker. It tackles the themes of drug-abuse, sex, domestic boredom and trauma, and wartime violence more directly and viscerally. \n \nProps to the production team for not censoring the portrayal of any of these dramatic scenarios. Standing in the room during the sex scene, I could only think, “Wow. Umm…” before I was whisked off to a military hospital surgery nightmare that brilliantly swung back and forth between panicked screaming and doped-up cereal-box smiles. \n \nThe downside of this production that moves the immersed audience through multiple locations is that the audio quality is sometimes compromised. There was a noticeable volume and energy drop in some locations where you couldn’t hear the music as well as onstage. \n \nThe upside of this production is that it holds itself together with a powerful and reliable cast that always picks up the energy wherever the music necessarily lets down. Protagonists and ensemble members alike can engage the audience, can perform intricate and vulnerable choreography, can really sing. Standing out in particular for their stunning voices and powerful stage presence were Jimmie Herrod as Extraordinary Girl and Chelsea LeValley as Heather. \n \nGreen Day’s American Idiot is being performed at ArtsWest Theatre (4711 California Ave SW) September 10—October 11, Wednesdays through Saturdays at 7:30pm, Sundays at 3pm. Run time is 95 minutes with no intermission. Tickets cost $15—$39.50 and may be bought at the box office or online:https://artswest.secure.force.com/ticket.", "source": "West Seattle Herald"}