{"published": "2015-09-15T10:05:09Z", "media-type": "News", "title": "Frank Pritchard found not guilty by NRL judiciary of kneeing opponent", "id": "c0ce2c0d-0c06-4cb1-980e-8fd009fca8a5", "content": "RENEE McKAY/    \nFrank Pritchard has been cleared of a kneeing charge and can play for the Bulldogs in their NRL semifinal against the Roosters. \n             \nCanterbury forward Frank Pritchard is free to play in Friday's must-win semifinal against the Sydney Roosters after being found not guilty of a dangerous contact charge at the NRL judiciary. \n \nPritchard, a former Kiwis international, was cited for an incident in which his leg came into contact with the back of St George Illawarra playmaker Gareth Widdop in the Bulldogs' 11-10 win on Saturday night at ANZ Stadium. \n \nHowever, he was cleared by the judiciary on Tuesday night, clearing him to take his place in the side against the Roosters at Allianz Stadium. \n \nI'm very grateful for the hearing and it's good news,\" Pritchard said. \n \n\"So, I can just move forward and focus on the game ahead. \n \n\"I just want to thank everyone that helped me today.\" \n \nThe three-man judiciary panel of Bronson Harrison, Mal Cochrane and Sean Garlick took just 13 minutes to exonerate Pritchard. \n \nThe result is a huge win for the Bulldogs as they prepare to take on the minor premiers who boast a big, strong pack. \n \nPritchard's defence counsel Nick Ghabar argued the Bulldogs' forward stepped on Widdop with his right foot and tripped over him while running at full speed. \n \nPritchard told the hearing while he did make contact with Widdop's back, he connected with his lower leg or shin rather than his knee after successfully pulling out at the last moment. \n \nGhabar said Pritchard was running at full speed trying to retrieve the ball and had actually done well to avoid heavy contact with his knee. \n \nWhen asked if contact could have been avoided, Pritchard said: \"Not at all - not at full speed.\" \n \nGhabar further argued that the \"nature of the contact was innocuous\" and did not satisfy the criteria of carelessness and dangerous, required to prove a dangerous contact charge. \n \nNRL counsel Peter McGrath unsuccessfully argued his case that despite Pritchard's best efforts, he still made careless contact. \n \nPritchard has signed with Hull FC in Super League next season.  \n    \n- AAP", "source": "Waikato Times"}