{"published": "2015-09-18T10:00:00Z", "media-type": "News", "title": "The Cartel Expands Into Europe and Hires New Head of Global Business Development", "id": "6e210a80-af4b-46be-863d-4851ac607ccb", "content": "LOS ANGELES , Sept. 18, 2015 /PRNewswire/ -- The Cartel is pleased to announce that Steven Hawthorne has joined the company as Head of Global Business Development, bringing with him over 20 years experience in foreign business and representation, combined with a wealth of European and International media contacts and internationally renowned talent. Hawthorne will also launch the Cartel office, and operations, in England . \n\nLogo - http://photos.prnewswire.com/prnh/20150918/267882LOGO  \n   \nSteven's role at the Cartel, in addition to expanding the Cartel's reach into Europe , will include the development of international distribution networks, new market penetration, investor relations and generating new business for the Cartel's properties and talent overseas. He will also be responsible for targeting potential global talent, intellectual property, and formats for the Cartel to represent and produce. He will also assist in representing the Cartel at global film and television markets. \n\nFounded in 2011 and run by partners Stan Spry , Jeff Holland , Evan Corday, Geoff Silverman , and Eric Woods , the Cartel is a feature film and television production and management company representing top-tier show runners, show creators, writers, directors, producers and production companies in film, TV and new media. The Cartel also has been involved in more than 30 movie and television productions since inception, including Executive Producing the series \"Ties That Bind\" for Up TV, and \"A Place in the Sun\" for Discovery as well as several recent feature films, including \"Guns, Girls, & Gambling,\" \"The Wedding Pact,\" \"Out of Reach,\" \"Defending Santa,\" \"Merry ExMas,\" \"Crimes of the Mind,\" and \"The Town Came A-Courtin',\" to name a few. The Cartel will also be producing \"Jeepers Creepers 3\" with Francis Ford Coppola and Odyssey Media in 2016. In 2013 the Cartel purchased and renovated Tamarind Lithography Studios, which is their new headquarters as well as a full-service production and post-production complex. \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/the-cartel-expands-into-europe-and-hires-new-head-of-global-business-development-300145464.html \n\nSOURCE  The Cartel", "source": "Indianapolis Business Journal"}