{"published": "2015-09-02T07:39:17Z", "media-type": "News", "title": "The Wall Street Journal China tightens capital controls in bid to keep money at home", "id": "704a609a-9090-4085-b763-932b305fdfbd", "content": "Pope Francis urges pardon for women who had abortions  \nThe Italy News.Net - Tuesday 1st September, 2015 \n \nPope Francis on Tuesday urged that women who have had abortions be pardoned. Now, women who have had an abortion and anyone who helped them get one will be forgiven of what the Church still  ... \n   Hulkenberg to stay at Force India till 2017  \nThe Italy News.Net - Tuesday 1st September, 2015 \n \nJust days before the Formula 1 Italian Grand Prix on Sunday, Force India on Tuesday extended the contract of Nico Hulkenberg for another two years which will keep the German at the Silverstone-based  ... \n   Ancient life found in Earths mantle rocks  \nThe Italy News.Net - Tuesday 1st September, 2015 \n \nScientists have discovered evidence of ancient life in Earth's mantle rocks deep below the seafloor, confirming a long-standing hypothesis that interactions between mantle rocks and seawater can  ... \n   Ancient Roman temple in Syria completely destroyed UN  \nThe Italy News.Net - Tuesday 1st September, 2015 \n \nSatellite images have confirmed that the Islamic State (IS) terrorist group has completely destroyed an ancient Roman temple in the Syrian city of Palmyra, the UN announced. A powerful blast in the  ... \n   Juventus Buffon craves to win Champions League  \nThe Italy News.Net - Monday 31st August, 2015 \n \nThe European Champions League trophy is the one glaring omission in Italian champions Juventus captain Gianluigi Buffon's glittering football career and the goalkeeping legend is determined to lift  ... \n   Hulkenberg aims to bounce back at Italian GP  \nThe Italy News.Net - Monday 31st August, 2015 \n \nForce India driver Nico Hulkenberg is aiming to bounce back at the Formula 1 Italian Grand Prix this weekend after two disappointing race weekends at Belgium and Hungary. The German had to retire  ... \n   Need to go flat out at Monza Perez  \nThe Italy News.Net - Monday 31st August, 2015 \n \nForce India driver Sergio Perez on Monday said he needs to go \"flat out all the way\" at the Formula 1 Italian Grand Prix here on Sunday, stressing on having a good qualifying session on Saturday at  ... \n   Ronaldinho jeered by own fans  \nThe Italy News.Net - Monday 31st August, 2015 \n \nFluminense coach Enderson Moreira has leapt to the defence of Brazilian football star Ronaldinho after the 35-year-old was jeered by his own fans in a 1-2 loss to Atletico Mineiro. Ronaldinho was  ... \n   Italy coach Conte quashes predecessor Prandellis no future claims  \nThe Italy News.Net - Tuesday 1st September, 2015 \n \nItaly head coach Antonio Conte has quashed claims of his predecessor Cesarre Prandelii, who has predicted a tough road ahead for the four-time FIFA World Cup champions due to the slow development of  ... \n   Dortmund loan Blaszczykowski to Fiorentina  \nThe Italy News.Net - Tuesday 1st September, 2015 \n \nEight-time German football champions Borussia Dortmund have loaned out their attacking midfielder Jakub Blaszczykowski to Italian club Fiorentina until the end of the season. Known as \"Kuba\", he  ... \n   Kanche most ambitious film of my career Jagarlamudi  \nThe Italy News.Net - Tuesday 1st September, 2015 \n \nFilmmaker Krish Jagarlamudi says the makers spent a fortune on his forthcoming Telugu romantic war drama \"Kanche\", which he describes as the most ambitious project he has attempted in his career so  ... \n   Juventus captain Buffon demands more responsibility from team  \nThe Italy News.Net - Monday 31st August, 2015 \n \nJuventus captain and veteran goalkeeper Gianluigi Buffon says the Italian football champions will need to show a greater level of responsibility if they are to get their Serie A season back up and  ... \n   No future for Italian football team Ex-coach Prandelli  \nThe Italy News.Net - Monday 31st August, 2015 \n \nFormer Italian football team head coach Cesare Prandelli has predicted a dark future for the four-time World Cup winners primarily because of the lack of development of its emerging talents. The  ... \n   Juventus loan Coman to Bayern Munich  \nThe Italy News.Net - Monday 31st August, 2015 \n \nGerman football giants Bayern Munich signed France Under-21 international Kingsley Coman from Italian outfit Juventus on loan. Bayern bolstered their offence with the French international, who on  ... \n   The EU migrant crisis explained in 90 seconds  \nThe Telegraph - Tuesday 1st September, 2015 \n \nSome migrants suffer beatings from gang masters who say they will give them secure passage to Europe. Watch our 90 second video to see the reasons why the migrants attempt dangerous crossings into  ... \n   Italy Factory Growth Solid But Slows More Than Expected  \nRTT News - Tuesday 1st September, 2015 \n \nItaly's manufacturing sector growth momentum remained solid during August, though the pace of expansion eased more-than-expected amid slower increases in output and new orders, survey results  ... \n   Italy Jobless Rate Lowest Since Feb 2013  \nRTT News - Tuesday 1st September, 2015 \n \nCorrects fourth paraItaly's jobless rate dropped in July to the lowest level in nearly two and half years, preliminary figures from the statistical office Istat showed Tuesday.The seasonally  ... \n   Rockhopper Exploration commences sidetrack well at Guendalina gas field  \nOilVoice - Tuesday 1st September, 2015 \n \nRockhopper Exploration plc (AIM: RKH), the oil and gas exploration and production company with interests in the North Falkland Basin and the Greater Mediterranean and North  ... \n   EU-supported films to compete at 72 Venice International Film Festival  \nNew Europe - Tuesday 1st September, 2015 \n \nEuropean Commission has invested around EUR260,000 through?the Creative Europe MEDIA program. Each year, the EU supports roughly 2,000 film and television projects. During 2015, the EU  ... \n   From Everest to Depp highlights of the Venice Film fest  \nMiami Herald - Tuesday 1st September, 2015 \n \nPeople take souvenir photos in front of the logo of the 72nd edition of the Venice Film Festival, at the Venice Lido, Monday, Aug. 31, 2015. The world's oldest movie festival will  ...", "source": "TheItalyNews.Net"}