{"published": "2015-09-11T00:51:16Z", "media-type": "News", "title": "11A powers clash in Madison", "id": "a9fe6f7b-a6b6-4bb1-97f3-00ca29d78ee5", "content": "Madison quarterback Mitch Hansen, one of the state’s premier signal callers, will have to contend with an experienced West Central defense Friday night. (Photo: Elisha Page / Argus Leader) \n\nWest Central (2-0) vs. Madison (2-0) \n\nWHEN/WHERE: 7 p.m. Friday at Madison \n\nCOACHES: West Central – Kent Mueller (13th year with Trojans, 104-18); Madison – Max Hodgen (6th year with Bulldogs, 32-19) \n\nSEASON TO DATE: Through two games, the Bulldogs and Trojans have each played bully to Dakota Valley. West Central opened the season with a 44-7 victory over the Panthers, and Madison last week tallied a 49-14 win. Stiffer tests presented in their other games, but you’d never know looking at the final scores. West Central flirted with a shutout against Canton, eventually winning 30-7. Madison got a heavy measure of revenge in walloping Dell Rapids – the team that beat them in the 11A championship last November – to the tune of 41-6. \n\nPOSTSEASON PRECURSOR: The No. 1 Bulldogs and No. 2 Trojans come in heavy 11A favorites, as Milbank Area (2-0), newcomer St. Thomas More (2-0) and a veteran team in Sioux Falls Christian (2-0) all vie for a spot at the table. Friday’s matchup, then, could be a preview of what’s to come in November. In Mitch Hansen, Madison has one of the state’s best quarterbacks. The Bulldogs have an assortment of weapons with Brodie Frederiksen, who averaged over 7.9 yards a carry last season, and Mason Leighton, whose three catches last week all went for touchdowns. West Central is less likely to air it out, and will lean heavily on the ground attack of Jonah Rechtenbaugh, who has rushed for over 100 yards in each of their two wins. The Trojans also sport a veteran defense, with eight starters making their return, led by defensive linemen Hunter Hanley and Bryce Edberg. \n\nWHAT TO EXPECT: The two teams have a rich history as rivals, squaring off in the state finals as recently as 2013 when the Trojans won 28-21. Friday’s early-season showdown isn’t likely to trend the way of blowout. Madison might be best diversifying their attack, but it won’t come easy against the Trojan defense. The Bulldogs are somewhat inexperienced on defense, by contrast, but have allowed just 20 points in two games. If home crowds count for anything then the slight edge goes to Madison, but this battle of top-ranked squads won’t disappoint either way. \n\nRead or Share this story: http://argusne.ws/1UKjLVY", "source": "Argus Leader"}