{"published": "2015-09-22T15:31:17Z", "media-type": "Blog", "title": "Pandora and SoundExchange Each Get Small Wins in Rate Proceeding", "id": "4bc5fe21-b0ff-45cc-b224-ff47b23daf58", "content": "Pandora, other webcasters and SoundExchange all got something they like in a determination that will guide how the Copyright Royalty Board judges in \"Webcasting IV\" -- the rate proceeding that will set webcasting royalty rates for the next five years -- should consider and weight evidence. The U.S. Register of Copyright, Maria Palante, writes in her 15-page memorandum that the judges who will determine the new rates may reference a direct licensing deal as a benchmark. That's a win for Pandora, which last year inked a licensing deal with independent rights organization Merlin, and other webcasters. \"We are pleased that the Copyright Office affirmed the admissibility of Pandora’s agreement with Merlin as a valid benchmark in the Copyright Royalty Board proceedings,\" said Dave Grimaldi, Pandora spokesman, in a statement. But Palante went further, telling the judges they may consider the existence and overall impact that the Webcaster Settlement Act of 2009, and the statutory license generally, might have on direct licensing agreements. That's a possible win for SoundExchange, which had argued the Merlin deal is inadmissible because the WSA 2009 says that current statutory rates and terms for \"pureplay\" webcasters are inadmissible. (Pureplay webcasters do not simulcast their terrestrial radio broadcasts on the Web.) In Webcasting IV, SoundExchange has proposed rates that would start at 0.25 cents in 2016 and rise 0.01 cents each year, to 0.29 cents in 2020. Pandora has, of course, proposed much lower rates, starting at 0.11 cents for ad-supported streams (increasing 0.02 cents per year) and 0.215 cents for subscription streams (increasing 0.03 cents in the second year and 0.04 cents the following three years). Since these rates are more in line with what non-pureplay webcasters are paying, the fact that the CRB can, with this ruling, consider how these rates have impacted other webcasters may be a plus for SoundExchange. It may seem strange that future statutory rates can't take into account current statutory rates and terms. The explanation starts with the royalty rates set by the Copyright Royalty Board judges in 2007 for the years 2006 to 2010. After much outcry from the Internet radio services and their listeners -- Pandora mounted a grassroots campaign that generated widespread attention -- Congress gave both sides additional time to negotiate more favorable rates. Rather than operate under rates that would have critically wounded a burgeoning digital service category, the marketplace worked out a solution -- the WSA 2009, a bill that allowed pureplay webcasters like Pandora to negotiate rates lower than those set by the judges in 2007. While webcasters were spared the tougher rates, the Act wasn't supposed to set a precedent. The WSA 2009 says Copyright Royalty Board judges cannot take into account its provisions when setting statutory royalty rates in the future. Instead, Congress explicitly stated the Act should be seen as \"a compromise\" motivated by the parties' unique situation.  Webcasters aren't required to use the statutory license and its corresponding royalty rates (currently 0.14 cents per stream for a pureplay webcaster). So last year, Pandora signed a licensing deal with Merlin that pays Merlin labels and artists a discounted royalty rate for incremental streams beyond what would normally be played. To Pandora, the Merlin deal is just the sort of market-based licensing agreement that CRB judges' determination is suppose to mimic. (Since there is no market for a statutory license, the CRB tries to figure out what the rates would be if the parties were to negotiate on an open market.) To SoundExchange, the Merlin deal is inadmissible because it is influenced by the WSA 2009. So the Copyright Royalty Board judges asked the Register of Copyrights if they may consider some or all of a direct licensing deal that copies or was influenced by the WSA 2009. It was a fight over the admissibility of evidence, with fairly grand consequences. Evidence that pushes the statutory rates down or up a fraction of a cent will swing the annual royalties paid to artists and labels -- or saved by webcasters -- by many tens of millions of dollars each year. Creators are relying on growing segments like Internet radio to build a bridge to their digital futures. Internet radio services want rates fair enough to allow their segment of the marketplace to grow. Both sides got a win Monday, but the ultimate question is who wins when rates are announced in December?", "source": "Billboard.com Music News"}