{"published": "2015-09-07T05:13:00Z", "media-type": "News", "title": "Bishop named LCSO employee of month for September", "id": "19b01455-3c9e-4f95-9225-d270df982054", "content": "The Employee of the Month for September for the Liberty County Sheriff’s Office is 15-year veteran employee, Bonnie Bishop, who is the commissary clerk for the jail division of the sheriff’s office. \n  \nSheriff Bobby Rader’s selection committee for this monthly honor found the selection process rather easy to select Bishop for this designation as she is highly praised by her supervisors for her work ethics as well as her vast knowledge of the workings of the agency itself. \n \n“There are many positions within any organization that work behind the scenes in order for the entire organization to function at a high level of proficiency. Bonnie heads up one of those type positions that is probably little known to the general public and often times, receives little recognition for the day to day operations that the sheriff’s office is obligated to fulfill,” said Capt. Ken DeFoor, LCSO spokesperson, in a written statement. “However, to those people immediately effected by Bonnie’s office and the functions that she is charged with overseeing, it is abundantly clear to those individuals just how important the commissary clerk’s office is to them.” \n \nThe commissary clerk’s primary responsibility is to account for the monies that inmates have on them when they are brought into the jail facility as well as money orders that may be sent in by family members for commissary items for their friends or family members who are in the county jail. \n \n“Then when these inmates are released, it’s Bonnie’s responsibility to issue checks for any funds these people may have coming to them. She also handles the phone cards, which allows inmates to communicate with friends or family members outside the facility,” he said. “Needless to say, this accounting must be exact and with proper documentation of all monies accounted for while the inmate is in detention as well as upon their release. This is, by no means, a small task and Bonnie excels at this assignment.” \n \nBishop was born in Duarte, Calif., and when she was 6 years old, her family moved to Humble, Texas, where she eventually graduated from high school and moved to Liberty County at the young age of 17. As time moved on, she accepted a job with the U.S. Postal service, but due to other work she had been doing with the elderly and persons with health issues, she wanted something more where she felt she could be of benefit to the community at large. \n \nWhen an opportunity presented itself to join the Liberty County Sheriff’s Office as a dispatcher, this seemed to be the position that she had been seeking. So, in June, 2000, Bonnie became a dispatcher and has worked for four sheriffs thus far. She has chalked up well over 600 hours of dispatching and communications schooling. She says her first love is “watching out for our deputies on the streets.” \n \nWhen asked what her most memorable calls were when she worked both as a dispatcher supervisor and handling calls herself, Bishop immediately becomes emotional when she recalls that she took a 911 call that night, in 2002, when a Liberty County deputy was killed in a patrol car wreck while en route to a call. This was not only just a sheriff’s deputy, but a close friend as well. \n \nOne other call that stands out in her memory is a 911 call from a 14 year old boy who pleaded for help because he knew when his parents got home that he would be beaten with a 1” X 4” board. Bishop was on the telephone listening to the beating as a patrol deputy was en route to the scene. \n \nShe was later able to meet the young man who, tearfully, thanked her for saving him from further beatings and physical abuse from his parents. The commissary clerk’s position is a great deal less stressful, as Bishop is quick to point out, but her first love still remains with dispatching and watching out for the sheriff’s deputies. \n \nBishop is married to Corporal Hugh Bishop, also a longtime veteran with the sheriff’s office, and says that her two young children take up about 90 percent of her off duty time. But it still leaves a little time for her favorite past time of watching sports on television as well as NASCAR races and such. This honor of receiving “Employee Of The Month” was also a special gift as it happened to be the 12th wedding anniversary for the Bishops. \n \nBishop said she was shocked at being selected as September’s “Employee Of The Month” but it was a very pleasant surprise and an honor that she will cherish for many years. She wants to thank everyone that had anything to do with her selection.", "source": "Dayton News"}