{"published": "2015-09-29T14:08:43Z", "media-type": "News", "title": "Doctor accused of performing ‘inappropriate’ womb removals breaks down when describing his move to Ireland", "id": "214bf944-0c35-4513-b074-c17f2c2a8f4c", "content": "Updated 14.59\n\nDR PETER VAN Geene continued his evidence to his Fitness to Practice Medical Council inquiry this morning.\n\nDr van Geene faces allegations that he performed a number of ‘inappropriate’ hysterectomies on four women at the Aut Even hospital in Kilkenny between 2009 and 2011.\n\nVan Geene became slightly overcome this afternoon under questioning from Medical Council committee member and medical expert Professor Anthony Cunningham as he described the circumstances which led to his move to Ireland from London in 2006.\n\n“My wife was on a tube train in London that immediately preceded a train that was bombed during the events of the July bombing in London in 2005,” he said.\n\nAppearing visibly emotional Dr van Geene said that his wife was so traumatised by the experience that she couldn’t bear to live in London any longer.\n\nCross examination\n\nContinuing where she left off yesterday evening Neasa Bird, representing the Medical Council, asked van Geene whether it was appropriate that he would have performed a vaginal hysterectomy on Ms Helen Cruise, a then 57-year-old mother of seven, without previously meeting her.\n\nVan Geene replied that she had been referred to him by an expert, a Dr O’Sullivan, and ‘who was he to question him’.\n\nMs Cruise was referred to Dr van Geene via the National Treatment Purchase Fund (NTPF). She had presented with severe incontinence. It was previously suggested to the inquiry by the former Master of the Rotunda Hospital Dr Peter McKenna that a vaginal hysterectomy would have in no way solved Ms Cruise’s problems.\n\nMs Cruise was in attendance at the inquiry this morning.\n\nHelen Cruise \n\n“Not ideal”\n\nVan Geene said that it is not unheard of for him to not meet a patient such as Ms Cruise prior to her coming to the operating theatre.\n\nHe agreed that the situation Ms Cruise found herself in was “entirely not ideal”.\n\n“Absolutely I would have preferred to see her on the ward but with her having reached theatre I thought surgery was the best option,” he said.\n\nBird countered that van Geene had performed a surgery designed to alleviate a prolapse, something that Ms Cruise didn’t have.\n\nA prolapse is a slipping-down of a part or organ of the body.\n\nVan Geene replied that as far as he was concerned, she did indeed have a prolapse.\n\nVan Geene said it was “quite impossible” that he could have obtained Ms Cruise’s consent to undergo surgery the first time he met her, which was while fully scrubbed up pre-surgery in the operating theatre.\n\nThe allegation that this consent was obtained after Ms Cruise had undergone a spinal anaesthetic and was lying on the surgical table is one of the key charges against van Geene with respect to Ms Cruise.\n\n“It is absolutely incorrect that I discussed the consent with Ms Cruise in the theatre, it was done outside, I cannot be more categorical than that,” he said.\n\nLong exchange\n\nThere followed a lengthy exchange where Ms Bird asked Dr van Geene extensively about his dealings with Ms Cruise following her second visit to theatre to have her post-operative bleeding stopped.\n\n“There were no complications during the surgery,” he said.\n\nMs Bird contended that Dr van Geene had told Ms Cruise following the surgery that he had “thrown her womb in a bucket”.\n\n“Absolutely not,” he replied.\n\n“Ms Cruise had a recollection of it and that it had been upsetting,” replied Ms Bird.\n\n“Did you say when meeting several members of her family after Ms Cruise’s second trip to theatre: ‘My God how many generations have we got here’, did you say that?”\n\n“Did you say ‘she’s not out of the woods yet,’ and walk off?”\n\n“Did you say ‘your mother is a smoker, she coughed and put pressure on her organs’? You removed one ovary, did you tell her family ‘and I ripped the other one out too’?”\n\n“Did you say: ‘your mother didn’t lose enough blood to become brain damaged’?”\n\n“Did you say: ‘well at least she won’t get ovarian cancer’?”\n\n“I put it to you that you did use all these phrases?”\n\nFault\n\n“If she’s suffered a bleed surely the operation is at fault?” asked Ms Bird.\n\n“Did you say: ‘I already told your family what happened, why don’t you ask them’,” asked Ms Bird.\n\n“Did you say: ‘you coughed and busted yourself open’?” asked Ms Bird.\n\n“Did you say: ‘sue me, sue me, sue me’?” asked Ms Bird.\n\n“Did you say that you weren’t getting paid to be there?” asked Ms Bird.\n\nThe hearing continues.\n\nOriginally published 11.18 am", "source": "TheJournal.ie"}