{"published": "2015-09-17T11:30:02Z", "media-type": "Blog", "title": "Boston Day Three", "id": "4db4e362-b242-4e88-9503-132243828817", "content": "Back to Boston...\nOn Sunday our biggest plan was making the trek over to Fenway for the Red Sox game.  The game didn’t begin until 1:00 so we had time to kill in the morning.  Since we walked all over the city the day before we decided to spend the morning somewhere different - Cambridge.  Harvard had been on our “must see” list, but we weren’t sure if we’d be able to fit it in.  Luckily, we had some time to spare on Sunday morning so we made it happen.  We got up early, walked about a mile to the T station and took the T (Boston’s subway) to Cambridge. Instantly felt smarter as soon as we walked into Harvard Yard, I’m not going to lie.  It was really a beautiful campus and soooo very different from where I went to college.  Case in point - Harvard was established in 1636; UCF (my alma mater) was established in 1963.  Different worlds.  It was cool to see a campus with so much history and heritage.  And Cambridge itself is a cool little town, and home to the only Curious George shop in the world.  Fun fact there.   I even picked up a little souvenir for Jillian... I have also taught her to say “I’m going to Harvard!” whenever she wears the shirt.  It doesn’t hurt to start that early.  Hee. After putzing around Cambridge for a little while, we made our way back to Boston with just enough time to get changed and take a bunch of shameless selfies in Red Sox gear.  Neither of us are Red Sox fans at all, but when in Boston...  (Go Cubs) Once we got that out of our systems, we walked over to another T station to get the train to Fenway.  Two subway experiences in one day!   Fenway was just as awesome as everyone says it is.  So big, so green, so much history.   Our seats were really good but in direct sunlight, so we literally just baked for the first three innings. In need of a reprieve from the sun, we went down under and walked around Fenway for a few innings and ate baseball stadium things like hot dogs and Cracker Jack.   We went back up to our seats for a few more innings and got to sing Take Me Out to the Ballgame and Sweet Caroline and then made our way back to the T.  (They were winning like 6 to 2 when we left) We got back to downtown and wandered around Quincy Market and Faneuil Hall for a bit to pick up souvenirs before returning to our hotel for showers.  Our plan was to have a nice dinner on the North End for our last night.  And that’s exactly what we did.  Even got a little dressed up for the occasion. On Saturday we had scoped out where we wanted to eat and decided on a place called Cafe Florentine on Hanover.  Many of the restaurants on the North End were tiny and had lines wrapped around the block.  I’m sorry but if a restaurant has a line wrapped around the block, it is not a restaurant I want to go to.  Who want to wait that long to eat?  Luckily Cafe Florentine was pretty easy to get into.  We only had to wait for them to clear off a two top before we sat down. The food was really really good.  I had gnocchi and Hubs had spinach lasagna accompanied by the most amazing bread and wine.  It was all very very good.  And then of course afterwards we had to make a pastry run.  Because that’s what you do in Boston.  Since we had been to Mike’s the day before we decided to try Modern. This was the line outside of Modern.  I won’t wait in a restaurant line that’s wrapped around the block, but I will wait in line for pastries for that long.  Twice. Yes, after we got our pastries from Modern, we went over to Mike’s and stood in line there and got more pastries.  Because we’re gluttons.  Hey, when in Boston...   Yes, that is Hubs skipping down the street with his pastry boxes.   Thankfully our mileage tally for the day was over 10 miles, so that helped a bit. And that was our last evening in Boston. The rest of the evening was spent packing and resting.  In the morning we had to get up and drive back to Hartford to catch our flight home.   All in all, GREAT vacation!  I loved every minute in Boston and cannot wait to go back! How about you ... Who is your favorite baseball team?  ", "source": "Half Healthy, Half Nuts"}