{"published": "2015-09-30T08:36:41Z", "media-type": "News", "title": "Malt firm Muntons leads by example as it unveils £5.4million AD plant", "id": "cf1c9e74-1513-4eae-af83-0d029d85d64a", "content": "The official opening of the new anaerobic digestion plant at Muntons in Stowmarket by Baroness Scott. \n \nArchant \n   \nA malt firm underlined its commitment to practical sustainability as it unveiled its £5.4million state-of-the-art anaerobic digestion plant. \n  Share link    The official opening of the new anaerobic digestion plant at Muntons in Stowmarket by Baroness Scott. Baroness Scott and Nigel Davies (manufacturing and sustainability director). \nStowmarket-based Muntons is set to generate a quarter of its electricity from the new plant, as well as recycling its own waste products into energy and into fertiliser for farmers. \n\nAt a stroke, the just-completed plant has cut out about 3,000 tanker movements a year, thus reducing the site’s CO2 emissions by 340 tonnes. \n\nMuntons has led the way in establishing a policy of “sustainability that pays”, showing other businesses how investing in environmentally-friendly measures can be good for their bottom lines. \n\nIt expects to recoup the cost of the plant within the next four and a half years. \nThe official opening of the new anaerobic digestion plant at Muntons in Stowmarket by Baroness Scott. \nGuests, including Baroness Scott of Needham Market, who officially opened the plant on Friday, were shown how it treats liquid waste streams from Muntons’ malt extract production by taking it through a process where micro-organisms break down biodegradable material in the absence of oxygen. \n\nA second process generates biogas, used to power a Combined Heat and Power unit providing 500KWh of electricity, around 25% of Muntons’ base load requirement. Visitors were also taken on a nature trail set up around the plant so that staff could enjoy a wildlife walk. \n\nManufacturing and sustainability director Nigel Davies said their aim was to influence their supply chain to do things more sustainably. \n\nFarmers growing barley to make the malt had the biggest carbon footprint, but the company would now be able to supply them with phosphate-rich fertiliser. \nThe official opening of the new anaerobic digestion plant at Muntons in Stowmarket by Baroness Scott. \n“We are making this work for us locally,” he said. “It was important for us to lead by example.” \n\nThe project has an “excellent” payback, and was meticulously researched and trialled before it was given the go-ahead, guests heard. \n\nEven so, it was initially hard to find lenders willing to back it because of scepticism about AD schemes. \n\nBaroness Scott described it as a “magnificent” project and said she was not surprised the company had won awards for sustainability. It was a scheme people in Suffolk could be proud of, she added.", "source": "East Anglian Daily Times"}