{"published": "2015-09-15T09:50:57Z", "media-type": "News", "title": "Russian service provider Caravan Aero selects Flexiant to help customers reduce the cost of business by 25%", "id": "0b4f30d9-9eaf-45eb-8502-e6b7f5d2ecc9", "content": "Caravan Aero, the subsidiary of Caravan Telecom, the longest established datacenter provider in Moscow, has selected Flexiant to provide Virtual Data-Center (VDC) capabilities on-demand. Flexiant Cloud Orchestrator delivers the flexibility to meet Caravan Aero's requirements to deliver self-service VDC to its SMB customers as well as managed services for its large enterprise customers. Caravan Aero Cloud VDC will reduce operating costs for its customers by at least 25%. \nAlready an Odin Virtuozzo customer, Caravan Aero evaluated Flexiant Cloud Orchestrator extensively prior to selecting the cloud management technology. Stanislav Drugalev, General Manager at Caravan Aero said, \"Prior to launching our cloud services, we undertook extensive testing to ensure Flexiant Cloud Orchestrator would allow us to provide the range of virtual infrastructure offers to our customers.\" \n\nCaravan Aero was impressed with Flexiant Cloud Orchestrators breadth of functionality including the ability to manage two datacenter locations easily, multi-hypervisor support so Caravan Aero could go live on both Virtuozzo and KVM, and localization so the platform could be localized for the Russian language and currency. \n\nStanislav Drugalev said, \"Flexiant gives us the ability to support a multi-pronged business approach delivering a ranged of self-service and managed services all through the same control panel.\" \n\nGeorge Knox, CEO, Flexiant said, \"By selecting Flexiant with Odin, Caravan Aero has a complete solution to launch new cloud services, open new lines of revenue with existing customers and attract new ones. We give our service provider customers the technology needed to deliver the cloud in a way that extends beyond technology to support business growth.\" \n\n\"Virtuozzo leads the industry in container virtualization and is very well-suited for delivering infrastructure services on-demand,\" said Alex Danyluk, Vice President, Partner Ecosystem and Alliances, Odin. \"We are pleased to see Caravan Aero evolve their service offerings using their existing investments in Odin technology and that Flexiant is helping to enable this.\" \n\nAbout Flexiant \n\nFlexiant provides solutions aimed solely at helping service providers capture the cloud market opportunity. Its portfolio of solutions includes Flexiant Cloud Orchestrator and Flexiant Concerto. Since 2009 Flexiant has armed service providers with the solutions necessary to launch revenue generating cloud services quickly and easily. \n\nFlexiant has been named a Gartner Cool Vendor in Cloud Management and received the Info-Tech Research Group Trendsetter Award for two consecutive years. Flexiant is a Gold Parallels Partner and a Dell certified technology partner. Customers include Brinkster, Acens part of Telefonica Group, FailProof Technology and ThinkGrid Ceano, part of Colt Telecom. Flexiant is also a key participant in the EU's Horizon 2020 program. \n\nFor more information, please visit : https://www.flexiant.com", "source": "Your Communication News"}