{"published": "2015-09-16T20:22:12Z", "media-type": "Blog", "title": "Mistakes were made, let's not forget.", "id": "a255750a-01c0-4de4-a691-329cec3ddf4a", "content": "A long long time ago, my best friend and I liked the same guy and instead of letting her have him, I agreed to go halvsies on him with her.\n\nJust before they broke up a year later, he was talking to me and he said (and this is as verbatim as memory will let me be), \"If one of you breaks up with me, I'm probably going to break up with the other one. Together, you have everything I need, but apart, you just don't have enough value to keep me.\" This should have been my first warning. He recanted this statement later, but I think it was always in the back of his mind, especially after poly and Dom gave him the tools he needed to try to enforce his arrogance. That and another quote he said around the same time (which I remember less clearly), \" I mean, no one should owe another person sex, but once she's agreed to a relationship, what am I supposed to do?\" or something like that.  Both of those add up to things: entitlement. Arrogance. I'm better than you. You are only as good as what you can give me.  That was the first year. And I get it: if you experience sexual needs, and you are bound to one partner, it seems like there's no outlet for your sex drive. But there are always options: masturbation, poly, cheating, or leaving the person whose needs clearly don't match up with your own.\n\nThere were six years of continual rape and gaslighting to make me feel like it was my fault. The last couple of years, I figured out that abuse was happening, but by them my image of reality was so skewed that I couldn't figure out if it we me or he who was the abuser. I eventually decided that it didn't matter and for both of our sanity, I needed to end it. It still boggles my brain how tightly he clung to me, especially after it became heart-shreddingly clear that we had oppositional needs. Even when our relationship devolved into nothing but him poking me, needing me to desire him for sex, and me refusing him and trying to interact with him in literally any other way; he still clung to me.  I broke up with him, and he persuaded me to get back together, even though nothing had changed and the resulting last few months of breakup were the same horrible the last 2 years had been.\n\nAnd yes, it was rape. I see that now. When you tell someone repeatedly that sex hurts you, emotionally and physically, and there response is to try to mold you while you're in sub space into a slut (not just someone who desires sex. a slut, specifically.)  When the boundaries you discuss and the agreements you make while heads are cool and emotions are banked vanish like they were never there in the face of his desire.  When you break up with him and say you want to stop doing physical(sexual) stuff, but he cries and bleeds until you agree to phase it out slowly, rather than all at once.  When you actually try to phase it out and he screams at you about shutting him out of your life and that this lack of accessability is \"what he's been dreading all along\" and browbeats you into having more sex.  When you say \"casual friends with benefits\" and he hears \"poly girlfriend\" and blames you, not only for not having sex with him, but for his failure to get another girlfriend, because he \"doesn't think you're ready for him to move on.\"  When you've been broken up for a year and wear a dress that he likes, and he gets you somewhere alone and tries to kiss you.  When you tell him you feel raped by him, and he asks you to \"use less inflammatory language.\"  And you DO because your entire reality now consists of his pain and you would do anything for just one pain free breath of air. Yeah, that's rape.\n\nHowever, I am NOT a rape victim. I have been raped, repeatedly for years, by someone I should have been able to trust, but I refuse to be a victim. I will process this, and use the anger that thinking about these circumstances engenders to set my boundaries and defend them. I will learn from my mistakes and make different ones next time. I will be clear in my desires and my boundaries and I will not allow anyone to push past them. I am going to therapy to see what else I can do to strengthen myself so this kind of thing does not happen again. I refuse to be a victim.", "source": "Evolution in Progress..."}