{"published": "2015-09-05T12:31:55Z", "media-type": "News", "title": "Uber plans more safety measures for passengers", "id": "d28cc5ee-a85d-42be-8ec3-3463e6ec7f81", "content": "Comment  ·  print ·  T  T \n\nT+·  T- \n\nSOS button will enable police to monitor cabs \n\nU.S.-based taxi-hailing app Uber will involve the police to enhance the safety of commuters and to enable real-time monitoring of cabs. \n\n“We are testing the SOS button in the app which will enable the police to monitor the cab’s movement. It is being tested in Kolkata and will be launched in south India soon,” Vignesh Anand, launcher and in-charge of the expansion in south, Uber told The Hindu on Friday. \n\nTalks were underway for providing more security to passengers and the police would be imparted training, Mr. Anand said. The SOS button would be in addition to the facility to share ride details with five friends of the passenger who can alert local authorities. \n\nThe capital had become the 22nd city in the country to be on Uber’s radar. The service launched here on August 21 had received overwhelming response, he said. The coverage offered on the Kazhakuttam-Thiruvallom stretch would be expanded to Kovalam and an office would be set up as part of expanding operations. \n\nIndividual partners would receive the app-based request and reach the passenger’s door-step, after tracing the path using GPS. The passenger would get the number of the vehicle, driver’s name, and photo in his/her mobile phone. The driver would call the customer only if the location could not be traced. \n\nThe partners in the venture mostly owned the vehicles, which were registered after 2010. \n\nThe base fare was Rs.50. In addition, Rs.9 was being levied per km and Re.1 for every minute of the ride. Receipts were given online and the fare would be displayed in the mobile. The partner would get 80 per cent of the fare and 20 per cent would go to Uber. \n\nMore In: Thiruvananthapuram", "source": "The Hindu"}