{"published": "2015-09-17T14:14:00Z", "media-type": "News", "title": "New National Survey Gives Voice to Cancer Patients and Caregivers, Reveals Gaps in Cancer Care", "id": "0f824a2e-4784-4984-95c0-a3bfb5fa431e", "content": "BOCA RATON, Fla. , Sept. 17, 2015 /PRNewswire/ -- New data from The 2015 Cancer Experience: A National Study of Patients and Caregivers reveals that overall satisfaction among cancer patients and caregivers with the care they received has improved significantly since the study was first fielded in 2012. The survey results also mirror the ongoing national health care debate and reveal significant gaps between patients' expectations and the quality of care they receive. While having access to advanced oncology therapies is important, survey respondents indicated that health care providers need to address their dissatisfaction with the lack of care coordination, confusion and frustration surrounding health care terminology (literacy), and the inability to obtain timely information from their care team. \n\nAccording to Gerard van Grinsven , President and CEO of Cancer Treatment Centers of America®, the company that sponsored the survey, it is critically important for health care leaders to understand and design care systems that enhance patient satisfaction. \"As leaders, we must integrate clinical excellence with service excellence to close any existing gaps that might negatively impact a patient's care experience,\" said van Grinsven . \"The ongoing insights from this annual survey should guide our thinking about how delivering outstanding clinical care and superior patient experiences converge to make a meaningful difference for cancer patients and their families.\" \n   \nKey findings from this year's survey include: \nCoordinated Care is The Key to Improving Overall Patient Satisfaction Sixty-two percent of cancer patients say that having a specific individual coordinate their care is important; however, only 32 percent experienced this type of coordination while undergoing treatment. Among patients who currently have coordinated care, the majority (74 percent) were \"completely satisfied,\" suggesting a direct correlation between the delivery of coordinated care and the overall patient experience. \nLost in Translation : Patients and Caregivers Struggle to Understand Complex Health Care Terminology Less than half of patients (46 percent) and caregivers (49 percent) understand terms such as genomic testing, immunotherapy, precision cancer treatment and molecular testing. Even fewer know the benefits, suggesting there is a lack of clear and important communication between care teams, patients and caregivers. While the field continues to develop advanced therapies, patients and caregivers must come away with a clear understanding of the benefits and risks of specific treatment options in order to make informed decisions about their care. \nLack of Confidence in Care Teams Causes Patients and Caregivers to Switch Providers Nearly 20 percent of caregivers switched their patient's health care provider because of a lack of confidence in his/her treatment plan and care team. This finding underscores the need to establish a coordinated and trusting relationship between the provider's care team and patients and caregivers, as well as the influence caregivers have on patients' selection of a treatment provider. \nThe Next Generation of Patients is More Actively Involved and will \"Shop\" Providers Nearly 40 percent of cancer patients seek a second opinion, and these are typically younger patients. This finding suggests that younger cancer patients, in general, take a more proactive role in their treatment decisions. It also suggests there is considerable uncertainty about their initial diagnosis, including expectations about longevity, a lack of implicit confidence in the first opinion, and/or the fact that we are living in an age of far more enlightened consumers who are seeking more comprehensive information about their treatment options. \n\"It is great news that the satisfaction of cancer patients is improving, but cancer care as a whole still needs to improve to make a bigger difference for patients, especially in ways that increase comfort, care coordination and access to essential information,\" said Maurie Markman , M.D., President of Medicine & Science at Cancer Treatment Centers of America®. \"Clinical excellence alone cannot replace the need to focus attention on patient comfort and coordinated care.\"   \n\nAbout The Cancer Experience: A National Study of Patients and Caregivers \nThe Cancer Experience survey is a national online survey of 1,060 cancer patients and 1,051 caregivers who received treatment at hospitals across the United States , including at least 250 patients diagnosed at each stage of cancer no more than three years prior to their participation in the survey. This third annual edition of the survey and was conducted from April 14 through May 18, 2015 . It is intended to measure the comprehensive experience of cancer patients and caregivers, providing a barometer for the quality of the cancer care experience in the U.S. The survey measures gaps between patients' expectations about their care and the reality of the care they received. A pdf link to the survey slide presentation may be found here: https://edelmanftp.app.box.com/s/2rx414b09hfogrgapqmuuz99yy6bcgxd \n\nAbout Cancer Treatment Centers of America® \nCancer Treatment Centers of America® (CTCA), headquartered in Boca Raton, Fla. , is a national network of five hospitals that serves adult patients who are fighting cancer. CTCA® offers an integrative approach to care that combines advancements in genomic testing and precision cancer treatment, surgery, radiation, immunotherapy and chemotherapy, with evidence-based complementary therapies that support patients physically and emotionally, enhancing their quality of life while reducing side effects both during and after treatment. CTCA serves patients from around the world at its hospitals in Atlanta , Chicago , Philadelphia , Phoenix and Tulsa. Consistently rated among U.S. hospitals that deliver the highest quality of care and patient experience, CTCA provides patients and their families with comprehensive information about their treatment options and encourages their active participation in treatment decisions. For more information, visit cancercenter.com , Facebook.com/cancercenter and Twitter.com/cancercenter . \n\nContact:  \nJerica Pitts \njerica.pitts@edelman.com \n312-233-1393 \n\nEllen Crane \nellen.crane@ctca-hope.com \n561-923-3149 \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/new-national-survey-gives-voice-to-cancer-patients-and-caregivers-reveals-gaps-in-cancer-care-300144901.html \n\nSOURCE  Cancer Treatment Centers of America", "source": "Market Pulse Navigator"}