{"published": "2015-09-07T18:09:09Z", "media-type": "News", "title": "U.S. stealth fighters visit Estonia", "id": "96b993b2-320f-457a-bab2-6bc214c05013", "content": "Story highlights Estonia, a neighbor of Russia, welcomes U.S. stealth fighters U.S. jets conducting training in Europe \nThe Baltic nation of 1.3 million people shares a border with Russia, and tensions have escalated in the region since Russia's takeover of Crimea from Ukraine in early 2014 and subsequent fighting between Ukraine government forces and pro-Russian separatists in eastern Ukraine. \n\n\"Over the past year and a half we've seen the security situation in Europe change quite fundamentally,\" Estonian Defense Minister Sven Mikser said during Friday's visit of the F-22s, as reported in the military newspaper Stars and Stripes . \"The more aggressive and provocative behavior by our eastern neighbor Russia has made it necessary for ... the NATO alliance to readjust.\" \n\nThe Raptors, based at Tyndall Air Force Base in Florida, have been on temporary assignment at Spangdahlem Air Base in Germany as part of the European Reassurance Initiative, \"which provides support to bolster the security of our NATO allies and partners in Europe while demonstrating the U.S. commitment to regional and global security,\" according to an Air Force statement. \n\n\"It is also a huge recognition of the Estonian state, the Estonian Air Force and, more specifically, of the Amari (Air Base). We are ready to and capable of welcoming such aircraft,\" Mikser said, according to a report from Estonia's Postimees English news website. \n\nA-10 Thunderbolt II attack jets joined the F-22s in the Estonia flyover. The A-10s, nicknamed \"Warthogs,\" have also been conducting training missions in the Baltics. \n\n\"This as a whole is the most important message in a situation where our eastern neighbor is still aggressive and is carrying out different unnecessarily aggressive and provocative activities,\" Mikser said, according to Postimees.", "source": "CNN"}