{"published": "2015-09-16T05:34:17Z", "media-type": "News", "title": "'Bad tax law': experts warn Hockey on crackdown", "id": "a9378b0a-2a2e-40a2-968a-610fa548a699", "content": "Treasurer Joe Hockey, pictured with Tax Commissioner Chris Jordan on Wednesday, announce their crackdown on multinationals suspected of tax avoidance. Photo: Alex Ellinghausen  \n  \nTreasurer Joe Hockey's crackdown on 1000 large companies accused of not paying enough tax in Australia is \"bad tax law' and will result in revenue wars with other nations, experts have warned. \n\nOn Wednesday Mr Hockey introduced new legislation to Parliament that boosts anti-avoidance laws and could see companies with annual global revenue of $1 billion or more hit with double tax, plus interest, if they are found to be illegally shifting profits offshore. \n\nThe laws, which apply from January, were initially expected to apply to 30 companies with with annual global revenue of $1 billion or more, but will now affect 1000 companies. This is because the $1 billion figure applies to global revenue, and a company's local subsidiary, could have a revenue figure below that amount. \n\nMr Hockey has refused to put an exact figure on the tax revenue expected to be recouped.  \n \nTax Commissioner Chris Jordan, who joined Mr Hockey at a press conference on Wednesday where they announced the new laws, said he hoped that multinationals would come forward and co-operate with the Australian Taxation Office, before the January start date. \n\nThe government could collect hundreds of millions of dollars of revenue, simply by using the new legislation as a threat, and encouraging companies to restructure and pay more tax ahead of the laws. \n\nBut tax experts are warning that the laws could deter business investment and spark revenue wars with overseas tax authorities. \n\n\"This is a dangerous strategy for Australia to pursue,\" Tax Institute President Stephen Healey said. \n\n\"The bill that has been introduced to Parliament today [on Wednesday] includes provisions in relation to country-by-country reporting that have been hastily drafted, with inadequate consultation, before global efforts directly relevant to these matters are finalised. \n\n\"The result is further uncertainty, complexity and, if passed, potentially bad tax law.\" \n\nAlready, one of the US Treasury's top officials, has labelled the Australian measures as evidence the debate is heading \"in a disturbing direction\" . \n\nUS deputy assistant secretary for international tax affairs at US Treasury, Robert Stack, has singled out Australia and Britain for unilaterally moving ahead of other countries, and criticised both governments for putting politics ahead of good policy. \n\nCPA Australia chief executive Alex Malley also expressed concerns with the legislation, saying it had gone beyond capturing only the so-called Dirty Thirty, \n\n\"Treasurer Hockey is now expanding the net to 1000 companies, which is potentially a lot of uncertainty, which will need detailed and considered explanation to ensure compliance,\" he said. \n\nMr Malley said Australia needed to work within the OECD and the G20 crackdown against multinational tax avoidance, known as Base Erosion and Profit Shifting. \n\n\"This is important to ensure we can plug into the international grid and don't have our own unique system that is out of kilter with what may ultimately be the accepted multilateral approach,\" he said. \n\nChartered Accountants Australia and New Zealand tax leader Michael Croker said the government needed to come up with a clearer formula about how profits are going to be taxed. \n\n\"The legislation being introduced into Parliament may need to be more explicit about where the profits are being taxed,\" Mr Croker said. \"It doesn't talk about the extent to which the multinational company has paid tax elsewhere ... and there could be disputes between countries as a result.\" \n\nPitcher Partners tax partner Leon Mok said he was worried mid-market companies could be impacted. \"Given the implications of non-compliance are very harsh, the government needs to clarify what concessions and carve outs will be given for mid-market businesses with global parents,\" he said. \n\nTax Justice Network spokesman Mark Zirnsak​ welcomed the laws, but said the government should be prepared to take further action should companies simply develop new tax dodging techniques. \n\n\"This would include if they reduce their profits in Australia by artificially loading up their subsidiary here with things like inflated intellectual property charges,\" Mr Zirnsak said. \n\n\"We also think the net of companies caught by the legislation should have been widened to include those with global revenues of over $250 million.\" \n\nKPMG tax partner Grant Wardell-Johnson said although the wording of the bill was simpler, more taxpayers would have to work out whether they would be hit. \"How the ATO applies these provisions will be critical and early guidance will be important,\" he said. \n\nPwC international tax services partner Peter Collins​ said Australia was taking unilateral action ahead of its OECD counterparts, but it would be better to gain international consensus. ", "source": "Brisbane Times"}