{"published": "2015-09-21T08:37:38Z", "media-type": "News", "title": "Party must work like Steve Jobs' Apple, Rahul Gandhi tells Congress workers", "id": "f9770040-3eda-4107-af6a-efb4c64851de", "content": "Congress vice-president Rahul Gandhi on Monday addressed an 'open house' meeting with Congress workers in Uttar Pradesh's… \r \nNEW DELHI: Congress vice-president Rahul Gandhi on Monday addressed an 'open house' meeting with Congress workers in Uttar Pradesh's Mathura. \n\n\"All party workers have Congress in their DNA,\" Rahul Gandhi said. \"I don't see myself as your leader, but as part of a family,\" Rahul added. \n\n\"All party workers are like my family, and no one can be removed from a family,\" Rahul Gandhi said. \"We accept everyone's opinion, whether we agree or not,\" the Congress vice-president added. \n\nAttacking PM Narendra Modi, Rahul Gandhi said that 'Modi had said don't be scared, achche din will come, now farmers are committing suicide.' \n\n\"Farmers are not criticising Modi, but abusing him. \"Modiji is attacking himself,\" the Cong vice-president said. \n\nRahul Gandhi also urged his partymen to imbibe the 'team culture' of Steve Jobs' Apple and shun rigid hierarchies like the RSS in its bid to regain lost ground in UP. \n\n\"Party must work like Steve Jobs' Apple and be open to all opinions and not just some leaders. We (Congress) allow people to have different ideologies, unlike the RSS,\" the Congress leader told his party members at a chintan shivir in Mathura. \n\nRahul Gandhi is in the Mathura to assess the party's strategy in the state which goes to assembly polls in early 2017. \n\n\"The Congress party is not like the RSS which guides the government. Every member's voice is heard here unlike what happens under (RSS chief) Mohan Bhagwat,\" Gandhi said at the meet, which is the party's first major programme to deliberate on the issue of toning of the outfit after the 2014 Lok Sabha polls that saw Congress securing just two of the total 8", "source": "MyInforms"}