{"published": "2015-09-17T17:23:32Z", "media-type": "News", "title": "McCain calls for U.S. to challenge China claims with patrols near islands", "id": "996ec860-211b-4a63-ade1-c381ce1f4f92", "content": "By WASHINGTON (Reuters) - The head of the U.S. Senate's military committee criticized the Obama administration on Thursday for failing to challenge China's building of artificial islands in the South China Sea by sailing within 12 nautical miles (22.2 km) of them, saying this amounted to de facto recognition of Chinese claims.\n\nAssistant Secretary of Defense David Shear responded to Senator John McCain, the chair of the Senate Armed Services Committee, by saying that such patrols had not been conducted since 2012, but were among future U.S. options.\n\nThe exchange at a hearing of the committee came ahead of a visit to Washington next week by Chinese President Xi Jinping, when U.S. concerns about China's pursuit of territorial claims in the South China Sea will be high on the agenda.\n\nMcCain said it was time the United States conducted patrols within 12 nautical miles of China's artificial islands in the Spratly archipelago. \n\n\"The administration has continued to restrict our Navy ships from operating within 12 nautical miles of China's reclaimed islands,\" he said. \"This is a dangerous mistake that grants de facto recognition of China's man-made sovereignty claims.\"\n\nMcCain said the restrictions had continued, even after China sent naval vessels within 12 nautical miles of the Aleutian Islands off Alaska last week. \n\nMcCain said sailing within 12 miles of the artificial islands would be \"the most visible assertion of freedom of the seas.\"\n\nShear responded by saying: \"We have in recent years conducted freedom-of-navigation operations in the vicinity of those features, and doing so again is one of the options, one of the array of options we're considering.\" \n\nU.S. Pacific commander Admiral Harry Harris said China's building of airfields on the artificial islands and their further militarization was of \"great concern militarily\" and posed a threat to all other countries in the region. \n\n\"China is building three runways of 10,000-foot (3,048- meter) length, which is only a thousand feet shorter than would be required for landing a space shuttle,\" he said.\n\n\"And they're also building deep-water port facilities there, which could put their deep-water ships, their combatant ships, there, which gives them an extra capability.\n\n\"And if you look at all of these facilities then you can imagine a network of missile sites, of runways, their fifth-generation fighters and surveillance sites and all of that, it creates a mechanism by which China would have de facto control over the South China Sea in any scenario short of war.\"\n\n(Reporting by David Brunnstrom and David Alexander; Editing by Eric Walsh)", "source": "Yahoo! UK and Ireland"}