{"published": "2015-09-12T15:00:00Z", "media-type": "News", "title": "Take Chance With Rancho Poker", "id": "8ac32569-20d8-47bb-a288-c45624e8e908", "content": "We all like to think we’re gamblers at heart. \n\nYou know it’s true. Whether it’s actually gambling — a friendly bet on the big game, the weekly lottery ticket, those trips to the casinos — or taking a risk in life, we all want to be seen as that bold adventurer. \n\nClichés abound. “Nothing ventured, nothing gained.” — Anonymous “You’ll always miss 100% of the shots you don’t take.” — Wayne Gretzke “Only those who dare to fail greatly can ever achieve greatly.” — Robert F. Kennedy \n \nOf course, there are just as many sayings warning against gambling: “A fool and his money are soon parted.” — Anonymous “Gambling: The sure way of getting nothing for something.” Wilson Mizner “ And my favorite: “Horse sense is a good judgment, which keeps horses from betting on people.” \n\nIn my younger days, one of my favorite pastimes was a road trip to Vegas. I fancied myself a bit of a Blackjack expert, even though I seldom won big. Okay, I usually lost. But I set myself a limit and quit when I lost that amount. Most of the time. \n\nI still go to Vegas, but now it’s for business or to take in the spectacle. The blackjack tables have gotten too pricey for me, and I do like to pretend that there is some skill involved in games I play, so slots hold no fascination. \n\nI admit to watching big money poker on television a time or two (when there wasn’t baseball, football, basketball, soccer, golf, tennis, etc. on ESPN), and now I have a bit of affinity for Texas Hold ‘Em. That’s the poker game of choice for poker tournaments. \n\nNow if you go to fundraisers, you know that one of the more popular attractions is a “casino” where you gamble play money to win play money, with the charity getting the real money. It’s a more active pastime than listening to speakers drone on, and it adds to the charity’s bottom line. \n\nSome of the more ambitious groups have tried to capitalize on poker’s popularity, and added a poker tournament to the mix. The leader in that regard is Rancho Los Alamitos, where a Texas Hold ‘Em tournament has been part of the Ranch Roundup fundraiser since day one. \n\nAnd yes, I have been sucked into that vortex. I have played every year. \n\nIt started out as a charitable thing. I plunked down my money, took my cards, and after only a few hands got up and walked away empty-handed. \n\nBut then there were a few players who, shall we say, enjoyed winning just a bit too much. The gleeful grin as I pushed my last few chips to the center of the table was more than I could handle. \n \nSo I studied up and got serious. The last two years, I’ve made it to the final table. Last year, I finished fourth — just out of the money. \n\nIronically — or not — last year’s winner wore that same gleeful grin as he flipped over his aces to beat my lowly threes. So you can bet I’ll be back at the table this Saturday night, hoping Lady Luck will be just a bit kinder to me. \n\nWhat does all this have to do with you? Well, you too can do some semi-serious gambling while supporting Rancho Los Alamitos. You don’t even have to decide to play until you get to the Rancho on Saturday evening — there will be day-of signups until 6 p.m. \n\nThere will be plenty of other activities as well — auctions, a barbecue dinner, other casino games, western music and line dancing — but we both know the real attraction. Beating the guy with the gleeful grin. \n\nGo to www.rancholosalamitos.com for details and come on out. I bet you can’t beat me.", "source": "Gazettes Newspaper"}