{"published": "2015-09-13T16:51:12Z", "media-type": "Blog", "title": "Choices", "id": "d0554668-0db6-4014-aa04-927663c3dbcd", "content": "If you’re voting for a better economy and more jobs, good luck. No party can deliver. As the US and China go, so do we. \n \nIf this election is about financial security for you and your family, well, that’s another dog. Your choice could have big long-term consequences. For example, the Liberals want to drop taxes by 7% for people earning between $45,000 and $89,000, which would yield a tax cut (they state) of about $650 per person per year. To finance that they’d raise taxes by 13% on the paltry 313,000 people in Canada who earn more than $200,000. They’d pay an extra $9,600 each, which means over 50% of wages would be removed in tax. \n \nBy the way, about one-third of all those higher-income earners are doctors, who make an average of $328,000. If your community is lacking in medical care, don’t expect that taxing them more will make it a whole lot better. (An orthopedic surgeon in the US earns $440,000, compared to $208,000 in Canada and $324,000 in Britain – all in US$.) \n \nThe NDP is not planning to diddle with tax brackets, except for corporations. They propose lowering the small business tax rate and hiking the one for big businesses, in order to raise about $3 billion. Of course, large companies have no national allegiance, so tightening the screws on profits too much could lead to a factory or head office crossing the border where costs are less. So much for jobs. \n \nThe Dippers, by the way, would spend all of the $3 billion on cheap day care spaces, leaving nothing additional (except deficits) for infrastructure spending or keeping their promise of $36 billion more for the provinces for health care – to pay all those expensive doctors. This is NDP math. Like taking a new mortgage on the same house 11 times. \n \nThe Libs would also give families more money than the Cons for each kid, while both the opposition parties would nix the current Harper plan to extend income-splitting to all families with stay-at-home moms. \n \nThere is no doubt, in other words, that both the Liberals and NDP would have to sustain deficits for a long period of time in order to pay for the spending proposed, since tax increases alone cannot do the trick – and will exacerbate our existing tax load. Trudeau has already said that, if elected, he would continue Mr. Harper’s legacy of spending more than is raised. By the way, since coming to office in late 2005, the Conservatives have added $135 billion in new debt ( check this out ). More to come. Tell your grandkids! \n \nWhat’s likely the defining financial issue for your family, your finances and your personal economic future is the TFSA. As you know, the Cons did what they promised and jacked the annual contribution limit to $10,000 this year. That means you can take up to ten grand in after-tax savings, invest it through this vehicle and the money you accumulate will not be taxed when you remove it – presumably to finance your retirement. The Liberals and NDP, if elected, would reverse this. Trudeau would roll the annual limit back to $5,000, and Mulcair to $5,500. \n \nBoth argue this is somehow unfair because most Canadians cannot invest to the limit since they lack the money. They neglect to mention TFSA contributions are made from income that’s already been taxed and, unlike RRSPs, there is no reduction in tax or loss of direct federal revenue when the plan is used. \n \nAlso unlike RRSPs, the benefit for which rises dramatically for rich people, the TFSA limit is egalitarian and uniform. Everybody gets the same chance, regardless of income or wealth. Additionally, it is cumulative. A 25-year-old might not be able to use it now, but when she’s 40 all that room will be there to benefit from. Finally, encouraging private savings is massively cheaper for society than trying to create and administer a public income support system, especially with an aging population. This is why I first proposed the TFSA to that elfin deity known as F. \n \nAs you mull this, it might be useful to have some facts. \n \nFirst, consider a couple of fortysomethings deciding to max their TFSAs as the primary retirement vehicles. If they start in 2015, contribute the limit thereafter and invest in a balanced portfolio earning a long-term average of 7% (consistent with the last thirty years), here’s how much tax-free money they will have accumulated in 25 years, under these political plans… \n \nConservative ($20,000 max between them): $1,373,529, of which $853,000 is growth. \n NDP  ($11,000 max between them): $755,441, of which $469,000 is growth \n Liberal  ($10,000 max between them): $686,764, of which $426,000 is growth. \n \nNow, for a 25-year old single person who decides to focus only on her TFSA, and is able to make the maximum contribution annually (no inflation adjustment), earning a 7% average investment return over 40 years, here is the scorecard: \n \nConservative ($10,000 max): $2,146,095 (growth is $1.7 million) \n NDP  ($5,500 max): $1,180,320 (growth is $954,000) \n Liberal  ($5,000 max): $1,073,047 (growth is $868,000). \n \nIf you trust politicians more than you trust yourself, if you think wealthy people should pay dearly for their success, if you believe employers will embrace lower profits and doctors less compensation and you’ll never be an investor, you have two great choices. If you just want change, without more tax or more government, you have a problem. \n \nIsn’t democracy wicked?", "source": "Greater Fool - Authored by Garth Turner - The Troubled Future of Real Estate"}