{"published": "2015-09-10T18:08:49Z", "media-type": "News", "title": "Heritage Texas Properties Names Chaille Ralph as New President", "id": "b4968e78-ec5a-466e-863f-fef18e8ae99d", "content": "From the Wires Sep. 10, 2015 02:00 PM \n   \n\r    \n\nHOUSTON, TX -- (Marketwired) -- 09/10/15 -- Heritage Texas Properties (Heritage), the largest independently owned residential real estate firm in the Greater Houston region, names Chaille Ralph, last year's Chair of the Houston Association of Realtors®, as its new President. \n\nMrs. Robin Mueck, owner and CEO of one of Houston's most recognized and honored real estate brokerages, becomes Chairman and CEO to lead the firm's business development and local community outreach efforts. Jerry Mueck, Executive Vice President and husband of Robin, is also an owner. \n\n\"Our people are our greatest strength,\" says Mueck, \"and we now have in place a vibrant new management team -- led by an admired and proven leader, Chaille Ralph. Our leadership team has a shared vision to provide exciting new growth and innovation that will deliver even greater geographic reach, and inspired personal service to delight our clients.\" \n\n Heritage , which will celebrate its 40th Anniversary next year, has grown under Mueck's leadership from a few dozen agents in one office to 16 locations from the Gulf Coast to Central Texas, home to more than 300 licensed Realtors. It has been recognized as one of the top brokerage firms in the U.S. by REAL Trends. As a member of the prestigious Leading Real Estate Companies of the World and Luxury Portfolio, and a past recipient of its Most Innovative Brokerage Award, Heritage also is part of a global marketing network of 500+ real estate firms with 3,500 offices and 120,000 sales associates spanning 50 countries. This exclusive partnership allows Heritage to promote its properties to potential buyers all over the world. \n\nMs. Ralph, a licensed real estate broker since 1982, has been with Heritage since 2009, most recently as Senior Vice President of Sales for the company's Post Oak, Downtown and Galveston locations. A respected industry leader, she serves as a Director of the National Association of Realtors, the Texas Association of Realtors and the Houston Association of Realtors. She's a native Houstonian, alumnae of St. Thomas Episcopal School, and graduated from Texas Christian University with a Bachelor's degree in Business Administration. \n\nMs. Ralph will lead the day-to-day operations, heading the new leadership team for Heritage . In related moves, Sandy Benson, Senior Vice President, is now responsible for sales companywide, supporting top line growth and overseeing branch leaders. Kristen Abney, Senior Vice President, heads up the highly profitable relocation division as well as strategic initiatives and special projects. Senior Vice President Bill Jones has been selected to head up an exciting new venture that Heritage will reveal in the coming weeks. \n  \n\"This may be the most exciting time in our company's treasured journey,\" says Mrs. Mueck. \"I am honored and humbled to help Chaille and our management team write our next chapter of success. We are the company to watch.\" Mrs. Mueck believes that her burgeoning enterprise will continue to expand, as it attracts the best talent from both the \"Next Gen\" and seasoned veterans. \n\n\"While these innovative moves create an energy and excitement among the Heritage family that will help us grow and serve our clients better than ever,\" Mrs. Mueck adds, \"Our traditional values remain unchanged: We have built our culture around attracting people of integrity who genuinely care and have concern for our clients and each other, which is rare. We do it right. That won't change.\" \n\nMrs. Mueck, as Chairman and CEO, will be focusing on expanding Heritage market share throughout the communities it serves, both through business development and taking a more direct role in local community leadership activities throughout the Greater Houston Region. \"I'm thrilled to transition Chaille to lead the day-to-day operations to allow me to focus on exciting new growth initiatives and deepen our long-standing relationship with the community.\" \n\nMrs. Mueck notes that Ms. Ralph's appointment to President is the third major initiative Heritage has undertaken in recent months. In June, the company unveiled its new logo and brand identity. The effort, says VP of Marketing Jaclyn Reed who spearheaded the effort, was designed to \"visually align our brand with the modern company Heritage has become, yet underscore our long-standing image of quality, service and sophistication based on our tradition of excellence and integrity.\" \n\nSecond, Heritage is renovating its flagship Post Oak Park office, which reopens on October 1, 2015. \"It's a complete overhaul of the entire 12th floor of this Class A office building,\" Mrs. Mueck says, \"and it symbolizes our penchant for quality in everything we do.\" \n\nWith 360-degree sweeping views of the downtown Houston skyline, River Oaks, Uptown Park, the Galleria and 1,500-acre canopy of Memorial Park, Ralph, Mueck and the rest of the leadership team will have created a stellar environment for its agents, staff and clients. \"This expansion will enable increased marketing support,\" says Mrs. Mueck, including marketing for builders, development support, and personal branding for agents. \"Our flagship office paints a new picture of innovation and progress, still suitable for our established traditions,\" she adds. The location will be used for state-of-the-art corporate video production, video conferencing, and distance learning to support Heritage Texas Properties located throughout the state. \n\n Heritage Texas Properties has a legacy of leadership that includes five former Chairs of the Houston Association of Realtors, with four still part of the Heritage Texas Properties team, including Mrs. Mueck, Ms. Ralph, Mr. Jones and Lynn Zarr, Sr. \n\n About Heritage Texas Properties  \n\n Heritage Texas Properties , founded in 1976, is the largest independently owned residential real estate firm in the markets it serves, including Houston (5 offices), Katy, Cypress, The Woodlands, Sugar Land, Galveston, New Braunfels, Seguin, Round Top, Brenham, Bellville, and La Grange. Recognized for providing distinguished residential brokerage services, a tradition of integrity, and a track record of technology innovation, the company employs more than 300 licensed real estate professionals selling homes from 16 office locations. Heritage celebrates its 40th Anniversary on January 7, 2016. For more information about Heritage, go to www.heritagetexas.com . \n\nImage Available: http://www2.marketwire.com/mw/frame_mw?attachid=2885480 \nImage Available: http://www2.marketwire.com/mw/frame_mw?attachid=2885477 \n\n About Marketwired . \nCopyright © 2009 Marketwired. All rights reserved. All the news releases provided by Marketwired are copyrighted. Any forms of copying other than an individual user's personal reference without express written permission is prohibited. Further distribution of these materials is strictly forbidden, including but not limited to, posting, emailing, faxing, archiving in a public database, redistributing via a computer network or in a printed form.", "source": "Sys-Con India"}