{"published": "2015-09-08T22:22:38Z", "media-type": "News", "title": "eRelevance Corporation Extends its Marketing Service to the SMB Market", "id": "c795b8e9-bd98-487c-afff-54d2ea40894d", "content": "]]> \n\nAUSTIN, Texas , Sept. 8, 2015 /PRNewswire/ -- eRelevance Corporation ( www.erelevancecorp.com ), announced today that it has extended its next-generation, technology-enabled marketing service to the SMB market (small to medium-sized businesses) across multiple industries. \n\n\"The healthcare market has been our initial focus where over the last year we've taken over the internal marketing for nearly 200 healthcare accounts.  However, our service can cater to SMBs in any industry,\" stated Bob Fabbio , co-founder and CEO of eRelevance Corporation.  \"We combine marketing expertise with advanced technology to deliver a service that can serve any organization that is challenged with the effort required to effectively generate additional business and would prefer to outsource their internal marketing.\" \n\nThe eRelevance service uniquely leverages its advanced technology to market to an organization's internal contact database.  While most organizations primarily use email to market to their contacts, eRelevance leverages multiple communication channels including email, text, web, social, and digital conversations.  The eRelevance service surfaces leads for its customers with 2-3 times the effectiveness of their own efforts. \n\neRelevance's next-generation marketing service replaces expensive software tools and work done by staff by leveraging proprietary marketing and analytics technology and conversational digital assets to stimulate engagement using multiple channels. The affordable service starts at just $20 a day! \n\n\nAbout eRelevance Corporation \n\neRelevance Corporation , based in Austin, Texas , provides a next-generation marketing service to help companies generate revenue and reduce risks.  The eRelevance service uses its industry leading, cloud-based marketing automation and analytics technology to \"nurture\" contacts intelligently and cultivate interest, discover needs, offer promotions, and educate them to generate more business! As a service, no labor burden is placed on the client's staff. \n\nPRLog ID: www.prlog.org/12491463 \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/erelevance-corporation-extends-its-marketing-service-to-the-smb-market-300139301.html \n\nSOURCE  eRelevance Corporation", "source": "Sys-Con Italia"}