{"published": "2015-09-14T14:12:00Z", "media-type": "News", "title": "Kim Kardashian Shares Pregnancy Secrets and North West’s Style Tips on Sisters’ New Lifestyle Apps", "id": "a12b21e3-33f3-4d54-9406-f86294a4dcfe", "content": "Here's yet another way to keep up with the Kardashians. \n\nComing off the success of Kim Kardashian's smart phone game , the reality star and her famous sisters have all launched new websites and mobile apps that will give fans an inside look into their lives that not even their reality shows can show. \n\nThe apps will be free to download, and will include a mix of subscription and free content. The subscription fee will be $2.99 per month. \n\n\r\nWATCH: Demi Lovato Joins Kim Kardashian in Mobile Video App Craze\r \n\nThe new platforms will allow the famous sisters to share personal diary entries, live stream with their fans and offer beauty tutorials and workout tips. Giveaways and access to events are also some perks of subscribing. \n\n[embedded content] \n\n\nKim has already shared a video diary about her second pregnancy, revealing that this time around the baby is kicking. \"I didn't experience this a lot my last pregnancy so it's a lot of fun,\" she says. \n\n\r\nWATCH: How the #KardBlock App Will Help Give You a Kardashian-Free Life\r \n\nShe also gave advice on how to dress up when pregnant. \"My tip to anyone who is trying to dress their growing bump is to be prepared for trial and error and just wear what you know works best, even if it's repetitive!\" Kim says. \"If it works, it works!\" \n\nAnd if you don't think you can pull off 34-year-old's style, she also has a section dedicated to her daughter's fashion statements called  \"Get North's Look.\"\r \n\n\r\nMORE: Kim Kardashian on the Success of Her Mobile Game and Her Social Media Empire\r \n\nAs for the youngest sister , Kylie Jenner, she has posted a video about under-eye concealer. Meanwhile, Kendall Jenner will be sharing some \"model moments.\" \n\n[embedded content] \n\n\nKhloe Kardashian's app will also feature some fun tips and tricks. The super-fit reality star will be posting workout videos titled Khlo-Fit. \n\n[embedded content] \n\n\nWhile we can't wait to see what the Kardashian-Jenner clan will show us next, ET caught up with Kim's makeup artist , Mario Dedivanovic, who revealed some of the reality star's biggest beauty secrets. \n\n\r\nWATCH: Kylie Jenner Praises Lip Fillers, Disses Heavy Makeup\r \n\n\"She does love her contour,\" Dedivanovic shared, \"a little bit of contour and highlight and lashes.\"\r \n\nWill you be downloading the new Kardashian-Jenner apps? \n  %perl>     You might also like       \n  MOST  POPULAR", "source": "ETonline"}