{"published": "2015-09-25T10:47:20Z", "media-type": "News", "title": "Turf grass to grassroots: The unlikely force behind Ben Carson’s Iowa campaign", "id": "665f495d-79da-4da6-9e00-40f5b0feaaba", "content": "DES MOINES, Iowa (CNN) – Ryan Rhodes has a degree in Turf Grass Management from Iowa State University, but these days, he’s more concerned with grassroots management in the state of Iowa. \n\nRhodes is Dr. Ben Carson’s Iowa state director, helming the ship of a once fledgling campaign that’s now polling competitively in the Hawkeye State. \n\nHis background is a little unorthodox: Rhodes dabbled in golf course management and worked as a chef before finishing up school and running for the Iowa legislature in 2008. \n\n“Politics hit me in the face,” Rhodes told CNN. He was frustrated with what he calls a “stagnation of ideas” in the political class. \n\nHe lost that race, and in 2009, was selling cars when he got involved with the tea party movement. Since no one else was stepping up to collect data and organize, Rhodes took action and founded the Iowa Tea Party. \n\n“We started to organize groups, and trying to help set up groups, do trainings, harvest people, and connect them around the state,” Rhodes said. \n\nThe relative political newcomer held rallies and events, did a bus tour, and trained Iowans on how to caucus. Rhodes’ experience with the tea party helped him predict the anti-establishment wave of the 2016 election. \n\n“The one thing I noticed more and more on the ground was that people stopped listening to some of the same endorsers,” he said. “To a much larger extent in this cycle, it’s less about the power brokers than it was before.” \n\nIt’s the neurosurgeon and political outsider’s candidacy, coupled with Rhodes’ unusual background, that has injected creativity into an Iowa campaign scene filled with cattle call forums and town halls at the local Pizza Ranch. Just after the first Republican debate in early August, Carson held a dinner fundraiser on a train in Boone, which raised $30,000. \n\nRhodes became an overnight tea party sensation during the 2011 campaign season for confronting President Barack Obama at a rural economic forum in Decorah. At the town hall-style stop, Rhodes asked the President about a reported remark by Vice President Joe Biden comparing tea partiers to terrorists. \n\n“I said, hold on a second, I’ve got a question. How can you demand civility if your vice president is calling tea party members like myself terrorists?” Rhodes said. “Next thing I know, I have every news truck from Fox and CNN parked in my driveway asking to talk about it. It was one more thing that raised the size of the platform.” \n\nFast-forward a few years and a few business ventures later, and five prospective presidential candidates came calling, including Carson. \n\nRhodes initially wrote Carson off until hearing him speak at the Polk County Republicans Summer Sizzle in the summer of 2014. He was surprised that Carson filled the room with many people he hadn’t already seen before. \n\n“I saw somebody who could actually lead and bring people together that weren’t the normal political people … When you see a phenomenon like that, you can either decide you want to check it out and dismiss it or go, ‘Wait this is something you can build off of.'” \n\nEventually, Rhodes got on board with Carson, a decision he was told he’d regret by other Iowa GOP operatives. \n\n“I narrowed it down to somebody that I could believe in on principle, and my heart went with Ben, that’s just what it was … They asked, ‘Why would you choose somebody who’s never going to be up there, not going to even be in contention, you just don’t get this process and you had the chance to be with other people.’ … Originally I didn’t have a great answer, other than I said, ‘I see something you don’t see.'” \n\nThe Carson operation in Iowa is small. Rhodes has a staff of three, with two additional members coming on board this month. The team he’s assembled is young, but what they lack in experience, they make up for with enthusiasm for Carson and his message. \n\nAlso bolstering Carson’s grassroots efforts: his super PAC, the 2016 Committee. It is on a mission to deliver books to every caucus-goer, Midwest regional director Tina Goff said while handing out books, bumper stickers, and pins on Carson’s behalf at the Iowa Faith & Freedom forum. The super PAC, which cannot coordinate with the campaign, makes about 40,000 phone calls per month with a staff of about 32 in the Midwest over the summer. And it has about a dozen well-placed billboards across the Des Moines metro area, and attend county meetings and festivals across Iowa. \n\nGoff began assembling her team in April 2014, first focusing on building Carson’s name recognition in the Midwest. \n\n“We’re seeing a different cycle this time,” Goff explained. In the 2016 race, super PACs are able to organize and mobilize voters independently of the campaign. \n\nCraig Robinson, a Republican activist and founder of TheIowaRepublican.com, said it’s possible that the super PAC can build an effective grassroots operation. \n\n“They have been in existence for quite a while, long before Carson even started showing up in the state. That longevity gives them an advantage, because for a long time, it was people’s only way to contact anyone in the Carson orbit, so people are used to dealing with them,” Robinson said. \n\n“I think the big problem is that campaign is going to be in the dark about what the PAC is doing. For example, does the PAC have someone lined up to speak at my caucus or does the campaign? What if there are two people who think they are going to do it, or worse, nobody? Caucus campaigns require a lot of attention to detail, so extra hands in the kitchen on caucus night could make things messy in a hurry,” he added. \n\nOn the campaign side, Rhodes learned how to organize during his statehouse run, and the same principles apply to his operation. One tactic that’s worked particularly well: asking others to help. \n\n“You can catch the wave, but if you don’t capitalize off the wave, then it doesn’t do you a whole lot of good. And that’s kind of the thing in Iowa: if you can get those people to do something, whether it’s walk in a parade, whether it’s pick up a phone, whether it’s give three or five dollars, they have some sort of investment in the campaign … The number one thing is getting people involved that love Ben that know him. They’ve read his books. When you find somebody like that — when you find the kid he operated on, the father, saved his son’s life or something like that, you really have to give those people something to do because they’re your evangelists,” Rhodes said. \n\nIt’s a textbook behavioral economics concept: if you want someone to support you, ask them for help. They’ll feel more connected and, in turn, more invested in your success. \n\nRhodes said his team has built a “massive volunteer network.” They have chairs or co-chairs in all 99 Iowa counties, and is well on its way to organizing at the precinct level, with about 800 of 1,682 precinct chairs. \n\nAnd that kind of engagement is building a grassroots apparatus: “It can turn a staff of a few people into something that’s a much larger machine of somebody who may have a staff of 10 or 12,” he said. \n\nIn a Monmouth University poll released Aug. 31, Carson was tied with Donald Trump in Iowa, becoming the only candidate so far to pose a major threat to billionaire mogul in what pundits have dubbed the “summer of discontent.” \n\nIt’s the neurosurgeon and political outsider’s candidacy, coupled with Rhodes’ unusual background, that has injected creativity into an Iowa campaign scene filled with cattle call forums and town halls at the local Pizza Ranch. Just after the first Republican debate in early August, Carson held a dinner fundraiser on a train in Boone, which raised $30,000. \n\nThat same weekend, the campaign held three family festivals across the state in Cedar Rapids, Council Bluffs, and on a bridge in downtown Des Moines. It had food vendors, live music, and face painters, princesses, and ponies for the kids. Carson spoke at each event, took questions, and posed for photos with attendees. \n\n“It set the groundwork for him to take off,” Rhodes said. The three events, Rhodes said, turned out around 5000 people, and created a buzz. \n\n“When you can get out in front of that many people in Iowa and people love you and are excited about it, that’s a lot of evangelists to go send out. All they got to do is tell a friend, tell a friend, and tell a friend,” he said. \n\nThat grassroots, word-of-mouth campaign networking is crucial to building an organization in Iowa, the first-in-the-nation caucus state. \n\nAnother new tactic: the campaign is driving a Carson logo-wrapped bus to different churches across the state and holding tailgates after Sunday services. Staffers chat about Carson with churchgoers, handing out books, bumper stickers, hot dogs, chips, and drinks in church parking lots. This strategy is key for Carson, who is looking to shore up the evangelical vote in a crowded field. \n\nCarson Iowa volunteer director Megan Assman said the campaign’s innovative strategy reflects their unique candidate, who has never held public office. \n\n“Dr. Carson’s not a politician. We’re not going to do things on a campaign that normal campaigns would … I don’t know of a lot of campaigns that are going to church with people and then afterward just chilling and grilling hot dogs and just getting to talk to people afterwards … This isn’t a politician, so we’re not going to run his campaign like that,” she said. \n\nOne challenge for the Carson campaign is that about half of the Iowans committed to Carson are first-time caucus-goers. Staffers are tasked with making sure they know how to caucus, making sure they have a plan and a strategy to get them out on caucus night on Feb. 1. \n\nAssman said Carson’s message is getting those new to the caucus process excited and committed. \n\n“I thought it was going to be very hard. Just about every other person that I talk to has never caucused before. So in my job, I’ll do whatever it takes to walk them through this,” Assman said. “My job should be a lot harder, but with him, people will do whatever it takes to get this man elected.” \n\nUltimately, the goal is to get Carson in front of as many Iowans as possible before caucus night. \n\n“If they listen to Ben, they’ll vote for him, or they’ll at least think about voting for him,” Rhodes said. “It’s just a matter of doing the work to put him in the position to win.”", "source": "WXOK-AM"}