{"published": "2015-09-14T17:27:48Z", "media-type": "News", "title": "More Than 1,100 Wildfire Evacuees Turn to Red Cross for Shelter", "id": "c29c7369-c7f5-4ebf-b356-0191d809d3ef", "content": "SOURCE American Red Cross\n\nWASHINGTON \n\nRed Cross workers have shelters open and are providing meals, personal hygiene items, cleaning supplies, health services such as replacing medications and eyeglasses and emotional support for the people affected by the fires. The Red Cross is also working with partners to provide care for evacuated pets and animals.\n\n\"Many of the people we are helping had to leave their homes quickly, taking very little with them as they evacuated. We are making sure they have a safe place to stay, food to eat and a shoulder to lean on during this terribly difficult time,\" said Brad Kieserman \n\nPreliminary reports indicate that the Valley Fire in California \n\nIn total, 84 wildfires are burning out west which have consumed more than two million acres. Red Cross workers are also responding to wildfires in Washington \n\nDOWNLOAD EMERGENCY APP People can download the all-inclusive Red Cross Emergency App which combines more than 35 emergency alerts to help keep the user safe, including information about what to do in case of wildfires and more. Users can find it in smartphone app stores by searching for the American Red Cross or going to redcross.org/apps. \n\nHOW YOU CAN HELP People can help by donating to Red Cross Disaster Relief by visiting redcross.org, calling 1-800-RED CROSS or texting the word REDCROSS to 90999 to make a $10 \n\nAbout the American Red Cross:\n\nThe American Red Cross shelters, feeds and provides emotional support to victims of disasters; supplies about 40 percent of the nation's blood; teaches skills that save lives; provides international humanitarian aid; and supports military members and their families. The Red Cross is a not-for-profit organization that depends on volunteers and the generosity of the American public to perform its mission. For more information, please visit redcross.org or visit us on Twitter at @RedCross.\n\nLogo - http://photos.prnewswire.com/prnh/20090108/RedCrossLOGO\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/more-than-1100-wildfire-evacuees-turn-to-red-cross-for-shelter-300142366.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KSWO"}