{"published": "2015-09-04T15:01:08Z", "media-type": "News", "title": "The Latest: Amnesty says Greeks attacked migrants on Kos", "id": "c851cc0f-bb9b-4394-9f84-ed610c4e27d4", "content": "The latest news from the crisis of migrants pouring into countries across Europe. All times local (CET): \n\n--- \n\n4:40 p.m. \n\nSpanish Prime Minister Mariano Rajoy says the migration influx into Europe will be the continent's most important challenge for years and that European nations cannot refuse asylum to those who deserve it. \n\nBut Rajoy would not commit Spain to taking more than the 2,739 refugees it has pledged to accept. His position has been criticized by opposition politicians and contrasts with the 800,000 migrants Germany expects to take in this year. \n\nSpeaking Friday in Madrid with British Prime Minister David Cameron, Rajoy said pain is creating a commission to determine \"what is the joint position we will offer\" on asylum seekers. \n\nCameron said earlier Friday that Britain was willing resettle thousands more Syrians. \n\n--- \n\n4:25 p.m. \n\nHundreds of migrants have broken through a Hungarian riot police cordon at the Bicske train station, running westward on a train track and interrupting train traffic. \n\nSurprised riot police scrambled for their helmets Friday as the huge crowd suddenly surged from the front of the train, site of a day-long standoff. Police pushed some migrants back onto the train amid much shouting, screaming and infants crying but were only able to block a minority of the estimated 500 people there. \n\nAn Associated Press reporter saw at least 200 migrants, probably more, running in a wide group along the railway line west of Bicske, heading for Austria 135 kilometers (84 miles) away. \n\nThe migrants had refused police demands to go to a processing center. \n\n--- \n\n3:55 p.m. \n\nHundreds of frustrated migrants are marching out of Budapest, vowing to reach the Austrian border by foot after Hungarian authorities blocked them from taking west-bound trains. \n\nCarrying bags and backpacks, they snaked through Budapest in a line nearly a half-mile long, hampering traffic at times, as they began the 171-kilometer (106-mile) journey to Austria. \n\nThe people, many Syrians fleeing war, want to eventually reach Germany or elsewhere in the West and are trying to avoid registering in economically depressed Hungary, which is more likely to return them to their home countries. \n\n--- \n\n3:35 p.m. \n\nAuthorities in northern Greece say a refugee from Syria has been killed by a train while walking along railway tracks in the dark after entering the country from neighboring Turkey. \n\nThe 45-year-old man, who was carrying transit documents issued to migrants in Turkey, was hit early Friday near the village of Petrades. The train driver told police he was unable to brake in time. \n\nWhile most migrants entering Greece from Turkey arrive by boat, some still cross the land border in Thrace, which mostly follows the Evros River. Greece has built a 12-kilometer (7.5-mile) fence along the remaining stretch where there is no natural obstacle. \n\n--- \n\n3:25 p.m. \n\nGermany is calling on European Union nations to restore a sense of unity in the face of the Europe's worst refugee crisis since World War II. \n\nGerman Foreign Minister Frank-Walter Steinmeier said Friday \"we will not cope with this task if we do not stop pointing with the finger at our neighbor.\" He said \"blaming one another will not lead us to get the problem under control.\" \n\nSteinmeier said that \"Europe cannot let itself be divided, even in the face of such a challenge.\" \n\nMore than 340,000 migrants have arrived in Europe since the beginning of the year. Around 160,000 of them have entered Hungary, which blames Germany for encouraging more Syrians to apply for asylum. \n\n--- \n\n3 p.m. \n\nEU Migration Commissioner Dimitris Avramopoulos says a fast-track processing center will be set up at Greece's main port of Piraeus, near Athens, where European teams will quickly fingerprint and process migrants. \n\nHe spoke Friday during a visit to the Greek island of Kos, which has been overwhelmed by a flood of migrants from the nearby Turkish coast. The center will determine who among those arriving is a refugee fleeing persecution or war and therefore entitled to asylum in Europe, and who is an economic migrant, who will be sent home. \n\nAvramopoulos said the migration crisis is \"directly linked to the geopolitical instability\" of nearby countries. He added it \"will not end in a night. And no measure can deal with it quickly and effectively. Method, system are needed, political will is needed.\" \n\n--- \n\n2 p.m. \n\nIreland has announced it will take in at least 1,800 refugees, tripling initial plans announced in July to accept roughly 600 over the next two years. \n\nJustice Minister Frances Fitzgerald said Friday that a more comprehensive response is needed to the \"heartbreaking and tragic\" events unfolding. She said the number accepted will be \"in the thousands\" but that no precise figure has been determined yet. \n\nFitzgerald is also calling for increased aid programs and an extension of the naval search and rescue operation in the Mediterranean. \n\n--- \n\n1:55 p.m. \n\nSlovak police say a small truck with 23 refugees from Syria on the way from Hungary to Germany has been involved in a fatal crash in northwestern Slovakia. \n\nPolice spokesman Martin Waldl says the Peugeot Lamar vehicle with a Polish plate carrying the migrants collided head-on Thursday with a car near the town of Cadca, near the border with the Czech Republic and Poland. \n\nWaldl says the Polish driver was detained as well the refugees — 20 men and three teenagers — who fled the site of the crash. One person from the other car was killed. Waldl says investigators are questioning the driver and the migrants on Friday. \n\n--- \n\n1:50 p.m. \n\nThe German government is declining to offer advice to Hungary on how to deal with migrants who refuse to be registered at camps there. \n\nGovernment spokesman Steffen Seibert said Friday he \"can't give any recommendations to the Hungarian authorities or anyone else in the absence of precise knowledge of the situation in and around Budapest.\" \n\nRefugees are trying to avoid Hungarian camps because they don't want to pursue asylum claims there. Hungary says the influx is Germany's problem because most want to go to Germany. \n\nSeibert reiterated Berlin's position that a pan-European response is required. He noted Budapest's obligation to register, process and take care of migrants and said Germany \"assumes that Hungary, as part of the Western community of values, will do justice to its legal and humanitarian obligations.\" \n\n--- \n\n1:45 p.m. \n\nThe mayor of the eastern Aegean island of Lesbos is appealing for \"immediate measures\" to help alleviate the acute refugee and migrant crisis on his island, which is the entry point for about half of the hundreds of thousands who have arrived in Greece so far this year. \n\nSpyros Galinos described the situation as a bomb about to explode in his hands. \"I appeal to the prime minister for immediate measures,\" he told state television Friday. \"We will have victims.\" \n\nEarlier Friday, clashes broke out between police and about 1,000 people, mostly Afghans, who attempted to rush onto a ferry heading to Greece's main port of Piraeus, near Athens. Police fired stun grenades to repel the stone-throwing crowd. \n\nGalinos said there were currently about 15,000 refugees and migrants on his island, of whom 7,000-8,000 were already registered and waiting to leave Lesbos for Athens but were unable to find ferry tickets due to fully booked ships. The government has chartered two ferries to transport the migrants, but with thousands of new arrivals each day, they have not been enough. \n\nGalinos said he had proposed extra ferries as well as charter flights to defuse the overcrowding on the island. \"I don't need one ship, I need a fleet,\" he said. \n\n--- \n\n1:40 p.m. \n\nEuropean Commission Vice President Frans Timmermans says the refugee and migrant crisis is nothing less than \"a moment of truth in European history.\" \n\nSpeaking amid the chaos of arriving migrants and refugees on the Greek island of Kos, Timmermans said the EU is still looking for a balance between protecting those needing shelter and keeping those out who only seek economic fortune. \n\nHe said the \"organized solidarity\" of the European welfare state \"would be completely undermined if we simply say everybody can come in.\" Timmermans added though that \"Europe cannot survive either if we take leave of our values and our legal obligations\" for those seeking protection from persecution and war. \n\nHe said that when it came to refugees fleeing the war in Syria, the EU and international partners, had done much less that they could have during the four years of conflict. \n\n--- \n\n1:20 p.m. \n\nPolice say the 71 people found dead in a truck last week on an Austrian highway probably suffocated but it will take weeks to be able to say so for sure. \n\nThey also said the victims, found Aug. 27 on the safety lane of the main highway from Hungary, included Syrian, Iraqi and Afghan refugees. \n\nHans Peter Doskozil, police chief in Burgenland where the truck was found, said Friday that in a similar case on the same day the bodies were found, 81 migrants managed to pry open another truck with a crow bar to gain access to fresh air. \n\nHe said no identities have yet been established and forensic work will continue for weeks to definitively establish the cause of death. \n\nThis entry has been corrected to show that the second truck incident happened on the same day that the bodies were found. \n\n--- \n\n12:45 p.m. \n\nGerman police say they're investigating a fire at home for asylum seekers in the western state of Hesse in which five people were injured. \n\nPolice told the dpa news agency Friday that it was too early to say when they might be able to determine whether the blaze overnight in the entrance hall to the building in Heppenheim was arson. \n\nOne man was seriously injured after he jumped from the second floor, while four others are being treated for minor smoke inhalation. The approximately 60 residents are being cared for by the Red Cross as the damage to the building is assessed. \n\nGermans have generally been welcoming to the recent flood of migrants but there have been a string of similar attacks, primarily on unoccupied homes for asylum-seekers. \n\nIn Estonia, more than 50 people, including 13 children, were evacuated from an asylum center in Vao on Thursday following a fire that is being investigated as arson. No one was injured. \n\n--- \n\n12:30 p.m. \n\nThe U.N. refugee agency says Britain will take a further 4,000 Syrian refugees from camps in the Middle East. \n\n\"We obviously welcome very much the move to increase resettlement spaces for Syrians in the UK. Those spaces are going to be critical to the lives and future of 4,000 people,\" said spokeswoman Melissa Fleming. \n\n\"We certainly believe that there's the momentum here\" for other countries to follow suit. \n\nEarlier, British Prime Minister David Cameron said only that his country would accept \"thousands\" more people, on top of the 5,000 already announced, and would give details next week. \n\nA spokeswoman in the 10 Downing Street press office refused to confirm or deny the figure of 4,000, saying that no specifics would be provided until next week. She declined to be identified in line with government policy. \n\n—By Jamey Keaten in Geneva and Greg Katz in London. \n\n--- \n\n12:10 p.m. \n\nGreece's coast guard says it has rescued hundreds of refugees and migrants from the sea near the eastern Aegean islands, a daily occurrence as hundreds of thousands flee war and poverty in the Middle East, Africa and Asia toward Europe. \n\nThe coast guard said it picked up 535 people in 12 incidents off the islands of Lesbos, Samos, Agathonissi, Kalolymnos and Kos from Thursday morning to Friday morning. That doesn't include hundreds who make it to the islands from the nearby Turkish coast themselves. \n\nGreece's eastern islands have been overwhelmed by the massive influx, and ferry tickets to the mainland have been scarce during the tourist season. Scuffles broke out with police at Lesbos port Friday when about 1,000 people tried to rush onto a ferry to Piraeus, local media reported. \n\n--- \n\n11:50 a.m. \n\nBritish Prime Minister David Cameron says the United Kingdom will accept \"thousands more\" Syrian refugees to help Europe cope with a massive influx of migrants and refugees. \n\nCameron said Friday his country has already agreed to take around 5,000 Syrians fleeing from their country's war but as the crisis has grown it planned to accept more. \n\nHe said in a statement during an official visit to Lisbon, Portugal, that his government will announce next week how many more people it will receive and under what terms. \n\nHe said Britain intends to take Syrians directly from refugee camps in the Middle East, not from places where they have arrived in Europe. \n\nHe said \"Britain will act with our head and our heart\" on the issue. He did not take reporters' questions.", "source": "Rock Hill Herald"}