{"published": "2015-09-01T16:07:11Z", "media-type": "News", "title": "Harper deflects StatsCan recession report", "id": "f0725f36-5394-4470-baae-aab24822a8eb", "content": "OTTAWA — Fresh data showing that Canada's economy now meets the definition of a recession sent immediate ripples across the federal election campaign trail this morning.\r \n \n\r\n                            Statistics Canada reported that the economy contracted at an annual pace of 0.5 per cent in the second quarter of 2015. It's the second straight quarter of contraction, fitting the technical definition of a recession.\r \n \n\r\n                            But Stephen Harper tried to find a silver lining — the Conservative leader seized on the agency's finding that the economy began to bounce back in June as GDP grew by 0.5 per cent after shrinking over five straight months.\r \n \n\r\n                            \"Elsewhere there's growth, and today one of the greatest monthly growths occurred in June, so it's clear that the Canadian economy is growing,\" the prime minister said in Burlington, Ont. where he pledged new support for Canadian manufacturers.\r \n \n\r\n                            Harper said the Conservative plan of a balanced budget, low taxes and affordable investments was the best course for the country in the face of greater global problems.\r \n \n\r\n                            \"If we change plans, we'll have a permanent recession like is occurring in many other countries. We're on the right track,\" the prime minister said.\r \n \n\r\n                            But New Democrat candidate Andrew Thomson, a former Saskatchewan finance minister, says today's numbers mean Conservative economic policies aren't working.\r \n \n\r\n                            \"The forecast today confirms that Stephen Harper is presiding over Canada's second recession in only seven years,\" Thomson told a press conference in Ottawa, while NDP Leader Tom Mulcair was in British Columbia for events later in the day.\r \n \n\r\n                            \"This is not about one day's statistics,\" he added. \"Under Stephen Harper, this has been Canada's lost decade.\"\r \n \n\r\n                            He accused Harper's government of 10 years of job losses, allowing infrastructure to crumble and for giving tax breaks to the wealthy while the middle class struggles.\r \n \n\r\n                            Liberal Leader Justin Trudeau said he agreed with a suggestion that the size of the recession might be marginal. But he said the bigger picture is that Canadians are struggling in an economy being hampered by low growth.\r \n \n\r\n                            Trudeau said Canadians have been living with the reality of a weak economy for months now, and don't need official numbers to confirm what they already know.\r \n \n\r\n                            \"What they would have needed is that politicians rather than getting hung up on definitions, invest in their future and in their jobs,\" Trudeau said in Gatineau, Que.\r \n \n\r\n                            Trudeau reiterated his platform plank — which distinguishes the Liberals from the Conservatives and the NDP — to run deficits before balancing the budget in 2019 in order to spur growth by investing infrastructure.\r \n \n\r\n                            \"That's why our plan will invest in real growth and isn't really dependent on this morning's announcement.\"\r \n \n\r\n                            By Mike Blanchfield, The Canadian Press", "source": "Simcoe.com"}