{"published": "2015-09-08T10:30:00Z", "media-type": "News", "title": "Yingli Green Energy Reports Second Quarter 2015 Results", "id": "db73aab4-839a-4750-a12b-b62945acf06f", "content": "-Shipments in the second quarter of 2015 met previous guidance \n  \nBAODING, China , September 8, 2015 /PRNewswire/ -- Yingli Green Energy Holding Company Limited (\"Yingli Green Energy\" or the \"Company\") (NYSE:YGE), one of the world's leading photovoltaic (PV) module manufacturers, known as \" Yingli Solar \" or \"Yingli\", today announced its unaudited consolidated financial results for the quarter ended June 30, 2015 and an expected non-cash impairment charge on long lived assets in the quarter ending September 30, 2015 . \n \nSecond Quarter 2015 Consolidated Financial and Operating Summary \n Total net revenues were RMB2,716.1 million ( US$438.1 million ).  Total photovoltaic (\"PV\") module shipments (including shipments for PV systems to the Company's own downstream PV projects[1]) were 727.9 MW.  Gross profit was RMB171.0 million ( US$27.6 million ), representing a gross margin of 6.3%. The gross margin on sales of PV modules was 7.9%.  Operating loss was RMB178.3 million ( US$28.8million ), representing a negative operating margin of 6.6%.  On an adjusted non-GAAP basis, earnings before interest, tax expenses, depreciation and amortization (\"EBITDA\") were RMB198.8 million ( US$32.1 million ).  Net loss[2] was RMB598.1 million ( US$96.5 million ) and loss per ordinary share and per American depositary share (\"ADS\") was RMB3.29  (US$0.53) . On an adjusted non-GAAP[3] basis, net loss was RMB596.9 million ( US$96.3 million ) and loss per ordinary share and per ADS was RMB3.28  (US$0.53) .   \n[1] Revenues were not recognized for internal shipments as required by U.S. GAAP. \n \n[2] For convenience purposes, all references to \"net loss/income\" in this press release, unless otherwise specified, represent \"net loss/income attributable to Yingli Green Energy\" for all periods presented. \n \n[3] All non-GAAP measures other than EBITDA exclude, as applicable, share-based compensation, interest expenses related to the changes in the fair value of the interest rate swap and the amortization of the debt discount, the amortization of intangible assets, inventory provision, impairment of long-lived assets and non-cash provision for inventory purchase commitments. EBITDA excludes interest, tax expenses, depreciation and amortization. For further details on non-GAAP measures, please refer to the reconciliation table and a detailed discussion of the Company's use of non-GAAP information set forth elsewhere in this press release. \n  \n\"The Company achieved a PV module shipment volume of 727.9MW in the second quarter, which made our cumulative PV module deliveries exceed 14GW worldwide since our inception.\" commented Mr. Liansheng Miao , Chairman and Chief Executive Officer of Yingli Green Energy. \n \n\"During the second quarter of 2015, our shipments to China and the U.S. grew significantly and increased by 110% and 35%, respectively, compared to the first quarter of 2015. Due to our continuous efforts in market diversification, our shipments to emerging markets, such as Northern and Southern Africa , Central and Southern Asia , Middle East and Latin America , continued to make remarkable progresses.\" \n \n\"We successfully repaid the RMB1.2 billion three-year unsecured medium-term notes due in May 2015 , and we are actively taking measures to prepare for repayment of the RMB1.0 billion five-year unsecured medium-term notes when they become due this October and are exploring a number of financing options including liquidation of idle assets, introduction of strategic investors and potential new cooperation model with our business partners. Also, for our downstream project development business, we have adopted and will follow a core principle of 'less investment, and quicker turnover' in order to maintain a stable cash flow. We believe these measures will help us to enhance our cash position, and allow us to gradually improve our balance sheet.\" Mr. Miao concluded. \n \nSecond Quarter 2015 Financial Results \n \nTotal Net Revenues \n \nTotal net revenues were RMB2,716.1 million ( US$438.1 million ) in the second quarter of 2015, compared to RMB2,905.8 million in the first quarter of 2015 and RMB3,408.9 million in the second quarter of 2014. Total PV module shipments (including 43.2MW shipments for PV systems of the Company's own downstream PV projects) were 727.9MW in the second quarter of 2015, compared to 754.2MW in the first quarter of 2015 and 887.9MW in the second quarter of 2014. Revenues were not recognized for 43.2MW of internal shipments as required by U.S. GAAP. \n \nThe decrease in total net revenues in the second quarter of 2015 compared to the first quarter of 2015 was mainly due to a decrease of PV module shipments in the second quarter of 2015 and decline in the average selling price of PV modules, which was primarily due to higher proportion of our shipment to China market and the depreciation of Euro and Japanese Yen against Renminbi in the quarter. \n \nGross Profit and Gross Margin \n \nGross profit was RMB171.0 million ( US$27.6 million ) in the second quarter of 2015, compared to RMB410.8 million in the first quarter of 2015 and RMB532.1 million in the second quarter of 2014. \n \nGross margin was 6.3% in the second quarter of 2015, compared to 14.1% in the first quarter of 2015 and 15.6% in the second quarter of 2014. The decrease in gross profit and gross margin from the first quarter of 2015 to the second quarter of 2015 was mainly due to the decline in average selling price of PV modu les a nd the increase in unit manufacturing cost as a result of a lower utilization rate of production facilities in the second quarter of 2015. Gross margin on sales of PV modules was 7.9% in the second quarter of 2015. \n \nOperating Expenses \n \nOperating expenses decreased to RMB349.3 million ( US$56.3 million ) in the second quarter of 2015 from RMB477.2 million in the first quarter of 2015, and compared to RMB618.1 million in the second quarter of 2014. The decrease in operating expenses from the first quarter of 2015 to the second quarter of 2015 was mainly due to the recognition of a gain from disposal of the land use rights held by Fine Silicon, a wholly-owned subsidiary of Yingli Green Energy. \n \nOperating expenses as a percentage of total net revenues were 12.9 % in the second quarter of 2015, reduced from 16.4% in the first quarter of 2015 and 18.1% in the second quarter of 2014. \n \nOperating Loss and Margin \n \nOperating loss was RMB178.3 million ( US$28.8 million ) in the second quarter of 2015, compared to operating loss of RMB66.4 million in the first quarter of 2015 and operating loss of RMB85.9 million in the second quarter of 2014. \n \nOperating margin was negative 6.6% in the second quarter of 2015, compared to negative 2.3% in the first quarter of 2015 and negative 2.5% in the second quarter of 2014. \n \nEBITDA \n \nOn an adjusted non-GAAP basis, EBITDA (earnings before interest, tax expenses, depreciation and amortization) were RMB198.8 million ( US$32.1 million ) in the second quarter of 2015, compared to RMB199.8 million in the first quarter of 2015 and RMB279.3 million in the second quarter of 2014. \n \nInterest Expense \n \nInterest expense was RMB242.1 million ( US$39.1 million ) in the second quarter of 2015, compared to RMB236.8 million in the first quarter of 2015 and RMB232.4 million in the second quarter of 2014. The weighted average interest rate was 6.75% in the second quarter of 2015, compared to 6.76% in the first quarter of 2015 and 6.25% in the second quarter of 2014. \n \nForeign Currency Exchange Loss (Gain) \n \nForeign currency exchange loss was RMB10.3 million ( US$1.7 million ) in the second quarter of 2015, compared to foreign currency exchange loss of RMB130.6 million in the first quarter of 2015 and foreign currency exchange gain of RMB2.8 million in the second quarter of 2014. The decrease in foreign currency exchange loss from the first quarter of 2015 was mainly due to less fluctuation of the exchange rates between Euros and Renminbi in the second quarter of 2015. \n \nIncome Tax Expense \n \nIncome tax expense was RMB232.6 million ( US$37.5 million ) in the second quarter of 2015, compared to income tax expense of RMB0.5 million in the first quarter of 2015 and income tax expense of RMB1.2 million in the second quarter of 2014. The significant increase in income tax expense in the second quarter of 2015 mainly resulted from RMB200.0 million of valuation allowance on deferred tax assets recognized in this quarter and areversal of deferred income tax assets of Fine Silicon, a wholly-owned subsidiary of Yingli Green Energy . \n \nNet Loss \n \nNet loss was RMB598.1 million ( US$96.5 million ) in the second quarter of 2015, compared to RMB363.2 million in the first quarter of 2015 and RMB285.2 million in the second quarter of 2014. Loss per ordinary share and per ADS was RMB3.29  (US$0.53) , compared to RMB2.00 in the first quarter of 2015 and RMB1.64 in the second quarter of 2014. \n \nOn an adjusted non-GAAP basis, net loss was RMB596.9 million ( US$96.3 million ) in the second quarter of 2015, compared to RMB353.0 million in the first quarter of 2015 and RMB275.0 million in the second quarter of 2014. Adjusted non-GAAP loss per ordinary share and per ADS was RMB3.28  (US$0.53) in the second quarter of 2015, compared to RMB1.94 in the first quarter of 2015 and RMB1.58 in the second quarter of 2014. \n \nBalance Sheet Analysis \n \nAs of June 30, 2015 , the Company had RMB575.0 million ( US$92.7 million ) in cash and cash equivalents, compared to RMB1,140.9 million as of March 31, 2015 . The decrease in cash and cash equivalents was mainly due to the repayment of the medium-term notes in the principal amount of RMB 1.2 billion due in May 2015 . \n \nAs of June 30, 2015 , the Company had RMB1,201.8 million ( US$193.8 million ) in restricted cash, compared to RMB1,323.2 million as of March 31, 2015 . \n \nAs of June 30, 2015 , the Company's accounts receivable had decreased to RMB3,854.4 million ( US$621.7 million ) from RMB4,320.6 million as of March 31, 2015 . Days sales outstanding were [128] days in the second quarter of 2015, compared to 134 days in the first quarter of 2015. \n \nAs of June 30, 2015 , the Company's accounts payable had decreased to RMB5,432.2 million ( US$876.2 million ) from RMB5,617.1 million as of March 31, 2015 . Days payable outstanding were 192 days in the second quarter of 2015, decreased from 203 days in the first quarter of 2015. \n \nAs of June 30, 2015 , the Company's inventory had decreased to RMB1,522.4 million ( US$245.6 million ) from RMB2,020.3 million as of March 31, 2015 . Inventory turnover days were 54 days in the second quarter of 2015, decreased from 73 days in the first quarter of 2015. \n \nAs of the date of this press release, the Company had approximately RMB 6,627 million in unutilized short-term lines of credit and approximately RMB 1,195 million in committed long-term fac ilities. The Company repaid the RMB1.2 billion three-year unsecured medium-term notes when they became due in May 2015 . For the R MB 1.0 billion five-year unsecured medium-term notes du e in October 2015, the Company is exploring various measures for the repayment of these notes . The C ompany is also working on a number of financing options to continue to manage the Company's liquidity and to enhance its financial flexibility. \n \nDownstream Development in 2015 \n \nIn China , the Company began the construction of 78 MW of PV projects and connected 94 MW of PV projects to the grid in the second quarter 2015. As of June 30, 2015 , the Company had a total of over 400 MW of PV projects under construction across a dozen provinces in China . \n \nIn July, the Company was selected to develop and construct a 50 MW PV project in Shanxi Province , China , which will be one of the key demonstration projects of National Energy Administration's \"Top Runner\" program. \n \nIn consideration of China's nationwide delay in subsidy allocation, long-term operation of large ground-mounted PV stations would require significant capital. Accordingly, the Company has adopted a more prudent approach to downstream project development business and is in active negotiations with certain leading corporations about potential sale of the PV projects developed by the Company. The Company has approximately 100MW of PV projects sold or close to sale to those parties. \n \nExpected Non-Cash Impairment Charge on Long Lived Assets in Third Quarter and Fiscal Year 2015 \n \nAs a result of the lower-than-expected utilization of certain production facilities of the Company in the second quarter of 2015 and the expected continuation of such utilization in the remaining quarters of 2015, the Company has concluded that impairment triggering events have become apparent in the third quarter of 2015 and has begun the process of performing its long-lived asset impairment analysis with respect to those production facilities. While the impairment analysis has not been completed yet, the Company expects to recognize a significant amount of non-cash impairment charge on those production facilities in the third quarter of 2015, which will have a material adverse effect on the Company's financial results for the third quarter of 2015 and fiscal year 2015. \n \nBusiness Outlook for Third Quarter and Fiscal Year 2015 \n \nThird Quarter of 2015 \n \nBased on current market conditions, the Company's current operating conditions, estimated production capacity and forecasted customer demand, the Company expects its PV module shipments to be in the estimated range of 550 MW to 580 MW for the quarter ending September 30, 2015 . \n \nFiscal Year 2015 \n \nBased on current market conditions, the Company's current operating conditions, estimated production capacity and forecasted customer demand, the Company expects its total PV module shipments to be 2.5 GW to 2.8 GW for the fiscal year ending December 31, 2015 . \n \nNon-GAAP Financial Measures \n \nTo supplement the financial measures calculated in accordance with GAAP, this press release includes certain non-GAAP financial measures of adjusted gross profit, adjusted gross margin, adjusted operating loss, adjusted operating margin, adjusted net income (loss), adjusted diluted earnings (loss) per ordinary share and per ADS and EBITDA, each of which (other than EBITDA) is adjusted to exclude, as applicable, items related to share-based compensation, interest expense related to the changes in the fair value of the interest-rate swap and the amortization of the debt discount, the amortization of intangible assets, inventory provision and non-cash provision for inventory purchase commitments. EBITDA excludes interest, tax expenses, depreciation and amortization. The Company believes excluding these items from its non-GAAP financial measures is useful for its management and investors to assess and analyze the Company's on-going performance as such items are not directly attributable to the underlying performance of the Company's business operations and/or do not impact its cash earnings. The Company also believes these non-GAAP financial measures are important to help investors understand the Company's current financial performance and future prospects and compare business trends among different reporting periods on a consistent basis. These non-GAAP financial measures should be considered in addition to financial measures presented in accordance with GAAP, but should not be considered as a substitute for, or superior to, financial measures presented in accordance with GAAP. For a reconciliation of each of these non-GAAP financial measures to the most directly comparable GAAP financial measure, please see the financial information included elsewhere in this press release. \n \nCurrency Conversion \n \nSolely for the convenience of readers, certain Renminbi amounts have been translated into U.S. dollar amounts at the rate of RMB6.2000 to US$1.00 , the noon buying rate in New York for cable transfers of Renminbi per U.S. dollar as set forth in the H.10 weekly statistical release of the Federal Reserve Board as of June 30, 2015 . No representation is intended to imply that these translated Renminbi amounts could have been, or could be, converted, realized or settled into U.S. dollar amounts at such rate, or at any other rate. The percentages stated in this press release are calculated based on Renminbi amounts. \n \nConference Call \n \nYingli Green Energy will host a conference call and live webcast to discuss these results at 8:00 AM Eastern Standard Time (EST) on September 8, 2015 , which corresponds to 8:00 PM Beijing/ Hong Kong time on the same day. \n \nThe dial-in details for the live conference call are as follows: \n \n-- U.S. Toll Free Number: +1-866-519-4004 \n \n-- International Dial-in Number: +1-845-675-0437 \n \n-- Passcode: 14832918 \n \nA live and archived webcast of the conference call will be available on the Investors section of Yingli Green Energy's website at www.yinglisolar.com . A replay will be available shortly after the call on Yingli Green Energy's website for 90 days. \n \nA replay of the conference call will be available until September 15, 2015 by dialing: \n \n-- U.S. Toll Free Number: +1-855-452-5696 \n \n-- International Dial-in Number: +1-646-254-3697 \n \n-- Passcode: 14832918 \n \nAbout Yingli Green Energy \n \nYingli Green Energy Holding Company Limited (NYSE: YGE), known as \" Yingli Solar \" or \"Yingli\", is one of the world's leading photovoltaic (PV) module manufacturers. Yingli Green Energy's manufacturing covers the photovoltaic value chain from ingot casting and wafering through solar cell production and PV module assembly. Headquartered in Baoding, China , Yingli Green Energy has more than 30 regional subsidiaries and branch offices and has distributed more than 13 GW solar panels to customers worldwide. For more information, please visit www.yinglisolar.com and join the conversation on Facebook , Twitter and Weibo . \n \nSafe Harbor Statement \n \nThis press release contains forward-looking statements. These statements constitute \"forward-looking\" statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended, and as defined in the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements can be identified by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates,\" \"target\" and similar statements. Such statements are based upon management's current expectations and current market and operating conditions, and relate to events that involve known or unknown risks, uncertainties and other factors, all of which are difficult to predict and many of which are beyond Yingli Green Energy's control. Forward-looking statements involve risks, uncertainties and other factors that could cause actual results to differ materially from those contained in any such statements. Further information regarding these and other risks, uncertainties or factors is included in Yingli Green Energy's filings with the U.S. Securities and Exchange Commission. Yingli Green Energy does not undertake any obligation to update any forward-looking statement as a result of new information, future events or otherwise, except as required under applicable law. \n \nFor further information, please contact: \n \nQing Miao \nVice President of Corporate Communications \nYingli Green Energy Holding Company Limited \nTel: +86 312 8929787 \nEmail: ir@yingli.com \n  \nYINGLI GREEN ENERGY HOLDING COMPANY LIMITED AND SUBSIDIARIES \n \nUnaudited Condensed Consolidated Balance Sheets \n \n(In thousands) \n \n \n \n \n \n \n \n \nMarch 31,2015 \n \n \nJune 30,2015 \n \n \n \nRMB \n \n \nRMB \n \n \nUS$ \n \nASSETS \n \n \n \n \n \n \n \nCurrent assets: \n \n \n \n \n \n \n \nCash and restricted cash \n \n \n2,464,129 \n \n \n1,776,784 \n \n \n286,578 \n \nAccounts receivable, net \n \n \n4,320,560 \n \n \n3,854,423 \n \n \n621,681 \n \nInventories \n \n \n2,020,290 \n \n \n1,522,440 \n \n \n245,555 \n \nPrepayments to suppliers \n \n \n847,193 \n \n \n877,746 \n \n \n141,572 \n \nPrepaid expenses and other current assets \n \n \n1,941,446 \n \n \n2,289,622 \n \n \n369,294 \n \nTotal current assets \n \n \n11,593,618 \n \n \n10,321,015 \n \n \n1,664,680 \n \n \n \n \n \n \n \n \nLong-term prepayments to suppliers \n \n \n668,808 \n \n \n614,390 \n \n \n99,095 \n \nProperty, plant and equipment, net \n \n \n11,687,807 \n \n \n11,055,028 \n \n \n1,783,069 \n \nProject assets \n \n \n1,619,613 \n \n \n2,258,298 \n \n \n364,242 \n \nLand use rights \n \n \n604,608 \n \n \n416,369 \n \n \n67,156 \n \nIntangible assets \n \n \n58,547 \n \n \n58,485 \n \n \n9,433 \n \nInvestment in and advances to affiliates \n \n \n443,100 \n \n \n443,359 \n \n \n71,509 \n \nOther assets \n \n \n476,522 \n \n \n250,019 \n \n \n40,326 \n \nTotal assets \n \n \n27,152,623 \n \n \n25,416,963 \n \n \n4,099,510 \n \n \n \n \n \n \n \n \nTOTAL LIABILITIES AND SHAREHOLDERS' EQUITY \n \n \n \n \n \n \n \nCurrent liabilities: \n \n \n \n \n \n \n \nShort-term borrowings, including current portion of medium notes and long-term debt \n \n \n9,752,969 \n \n \n10,078,470 \n \n \n1,625,560 \n \nAccounts payable \n \n \n5,617,102 \n \n \n5,432,205 \n \n \n876,162 \n \nOther current liabilities and accrued expenses \n \n \n3,109,849 \n \n \n3,737,622 \n \n \n602,842 \n \nTotal current liabilities \n \n \n18,479,920 \n \n \n19,248,297 \n \n \n3,104,564 \n \n \n \n \n \n \n \n \nLong-term debt, excluding current portion \n \n \n2,861,665 \n \n \n2,063,767 \n \n \n332,866 \n \nMedium-term notes \n \n \n1,700,000 \n \n \n300,000 \n \n \n48,387 \n \nAccrued warranty cost, excluding current portion \n \n \n715,627 \n \n \n752,696 \n \n \n121,403 \n \nOther liabilities \n \n \n2,469,105 \n \n \n2,745,482 \n \n \n442,819 \n \nTotal liabilities \n \n \n26,226,317 \n \n \n25,110,242 \n \n \n4,050,039 \n \n \n \n \n \n \n \n \nShareholders' equity: \n \n \n \n \n \n \n \nOrdinary shares \n \n \n13,791 \n \n \n13,791 \n \n \n2,224 \n \nAdditional paid-in capital \n \n \n7,244,999 \n \n \n7,246,252 \n \n \n1,168,750 \n \nTreasury stock \n \n \n(127,331) \n \n \n(127,331) \n \n \n(20,537) \n \nAccumulated other comprehensive income \n \n \n323,332 \n \n \n328,609 \n \n \n53,001 \n \nAccumulated deficit \n \n \n(8,015,574) \n \n \n(8,613,700) \n \n \n(1,389,306) \n \nTotal deficit attributable to Yingli Green Energy \n \n \n(560,783) \n \n \n(1,152,379) \n \n \n(185,868) \n \nNon controlling interests \n \n \n1,487,089 \n \n \n1,459,100 \n \n \n235,339 \n \nTotal shareholders' equity \n \n \n926,306 \n \n \n306,721 \n \n \n49,471 \n \nTotal liabilities and shareholders' equity \n \n \n27,152,623 \n \n \n25,416,963 \n \n \n4,099,510 \n \n \n \n \n \n \n \n \n   \nYINGLI GREEN ENERGY HOLDING COMPANY LIMITED AND SUBSIDIARIES \n \nUnaudited Condensed Statements of Comprehensive Income \n \n(In thousands, except for share, ADS, per share and per ADS data) \n \n \n \n \nThree months ended \n \n \n \nJune 30, 2014 \n \n \nMarch 31, 2015 \n \n \nJune 30, 2015 \n \n \n \n \n \nRMB \n \n \nRMB \n \n \nRMB \n \n \nUS$ \n \nNet revenues: \n \n \n \n \n \n \n \n \n \nSales of PV modules \n \n \n3,248,354 \n \n \n2,682,294 \n \n \n2,403,693 \n \n \n387,692 \n \nSales of PV systems \n \n \n55,864 \n \n \n62,507 \n \n \n86,869 \n \n \n14,011 \n \nOther revenues \n \n \n104,684 \n \n \n160,955 \n \n \n225,539 \n \n \n36,377 \n \nTotal net revenues \n \n \n3,408,902 \n \n \n2,905,756 \n \n \n2,716,101 \n \n \n438,080 \n \nCost of revenues: \n \n \n \n \n \n \n \n \nCost of PV modules sales \n \n \n(2,722,706) \n \n \n(2,284,443) \n \n \n(2,213,431) \n \n \n(357,005) \n \nCost of PV systems sales \n \n \n(53,834) \n \n \n(54,244) \n \n \n(76,888) \n \n \n(12,401) \n \nCost of other revenues \n \n \n(100,213) \n \n \n(156,230) \n \n \n(254,775) \n \n \n(41,092) \n \nTotal cost of revenues \n \n \n(2,876,753) \n \n \n(2,494,917) \n \n \n(2,545,094) \n \n \n(410,498) \n \nGross profit (loss) \n \n \n532,149 \n \n \n410,839 \n \n \n171,007 \n \n \n27,582 \n \nSelling expenses \n \n \n(314,272) \n \n \n(208,263) \n \n \n(257,077) \n \n \n(41,464) \n \nGeneral and administrative expenses \n \n \n(178,386) \n \n \n(134,915) \n \n \n(1,659) \n \n \n(268) \n \nResearch and development expenses \n \n \n(125,429) \n \n \n(134,058) \n \n \n(90,585) \n \n \n(14,611) \n \nTotal operating expenses \n \n \n(618,087) \n \n \n(477,236) \n \n \n(349,321) \n \n \n(56,343) \n \nIncome(Loss) from operations \n \n \n(85,938) \n \n \n(66,397) \n \n \n(178,314) \n \n \n(28,761) \n \nOther income (expense): \n \n \n \n \n \n \n \n \n \nInterest expense \n \n \n(232,404) \n \n \n(236,820) \n \n \n(242,145) \n \n \n(39,056) \n \nInterest income \n \n \n9,178 \n \n \n5,427 \n \n \n7,396 \n \n \n1,193 \n \nForeign currency exchange gains (losses) \n \n \n2,797 \n \n \n(130,632) \n \n \n(10,281) \n \n \n(1,658) \n \nOther income \n \n \n14,078 \n \n \n36,141 \n \n \n30,220 \n \n \n4,874 \n \nLoss before income taxes \n \n \n(292,289) \n \n \n(392,281) \n \n \n(393,124) \n \n \n(63,408) \n \nIncome tax (expense) benefit \n \n \n(1,213) \n \n \n(500) \n \n \n(232,593) \n \n \n(37,515) \n \nNet loss \n \n \n(293,502) \n \n \n(392,781) \n \n \n(625,717) \n \n \n(100,923) \n \nLess: Loss attributable to the non controlling interests \n \n \n8,344 \n \n \n29,609 \n \n \n27,591 \n \n \n4,449 \n \nNet loss attributable to Yingli Green Energy \n \n \n(285,158) \n \n \n(363,172) \n \n \n(598,126) \n \n \n(96,474) \n \n \n \n \n \n \n \n \n \n \nWeighted average shares and ADSs outstanding \n \nBasic and diluted \n \n \n173,796,737 \n \n \n181,763,770 \n \n \n181,763,770 \n \n \n181,763,770 \n \nLoss per share and per ADS \n \n \n \n \n \n \n \n \n \nBasic and diluted \n \n \n(1.64) \n \n \n(2.00) \n \n \n(3.29) \n \n \n(0.53) \n \nNet loss \n \n \n(293,502) \n \n \n(392,781) \n \n \n(625,717) \n \n \n(100,923) \n \nOther comprehensive income (loss) \n \n \n \n \n \n \n \n \n \nForeign currency exchange translation adjustment, net of nil tax \n \n \n745 \n \n \n11,768 \n \n \n4,879 \n \n \n787 \n \nCash flow hedging derivatives, net of nil tax \n \n \n4,681 \n \n \n431 \n \n \n0 \n \n \n0 \n \nComprehensive loss \n \n \n(288,076) \n \n \n(380,582) \n \n \n(620,838) \n \n \n(100,136) \n \nLess: Comprehensive loss attributable to the non controlling interest \n \n \n8,327 \n \n \n28,632 \n \n \n27,989 \n \n \n4,514 \n \nComprehensive loss attributable to Yingli \nGreen Energy \n \n \n(279,749) \n \n \n(351,950) \n \n \n(592,849) \n \n \n(95,622) \n \n \n \n \n \n \n \n \n \n \n \n \nThree months ended \n \n \n \nJune 30, 2014 \n \n \nMarch 31, 2015 \n \n \nJune 30, 2015 \n \n \n \nRMB \n \n \nRMB \n \n \nRMB \n \n \nUS$ \n \nNon-GAAP loss attributable to Yingli Green Energy  \n \n \n(274,978) \n \n \n(352,982) \n \n \n(596,856) \n \n \n(96,269) \n \nShare-based compensation \n \n \n(10,208) \n \n \n(10,190) \n \n \n(1,270) \n \n \n(205) \n \nNet loss attributable to Yingli Green Energy  \n \n \n(285,158) \n \n \n(363,172) \n \n \n(598,126) \n \n \n(96,474) \n \nNon-GAAP diluted loss per share and per ADS \n \n \n(1.58) \n \n \n(1.94) \n \n \n(3.28) \n \n \n(0.53) \n \nDiluted loss per share and per ADS \n \n \n(1.64) \n \n \n(2.00) \n \n \n(3.29) \n \n \n(0.53) \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \nReconciliation of EBITDA measures to income before income tax & minority interest measures \n \n \n \nThree months ended \n \n \n \nJune 30, 2014 \n \n \nMarch 31, 2015 \n \n \nJune 30, 2015 \n \n \n \nRMB \n \n \nRMB \n \n \nRMB \n \n \nUS$ \n \nLoss before income taxes and \nnon-controlling interest \n \n \n(292,289) \n \n \n(392,281) \n \n \n(393,124) \n \n \n(63,408) \n \nInterest expense \n \n \n232,404 \n \n \n236,820 \n \n \n242,145 \n \n \n39,055 \n \nInterest income \n \n \n(9,178) \n \n \n(5,427) \n \n \n(7,396) \n \n \n(1,193) \n \nDepreciation \n \n \n342,784 \n \n \n355,570 \n \n \n353,141 \n \n \n56,958 \n \nAmortization for land use rights and \nintangible assets \n \n \n5,581 \n \n \n5,139 \n \n \n4,062 \n \n \n655 \n \nEBITDA \n \n \n \n279,302 \n \n \n199,821 \n \n \n198,828 \n \n \n32,067 \n  \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/yingli-green-energy-reports-second-quarter-2015-results-300138912.html", "source": "PR Newswire Asia"}