{"published": "2015-09-18T11:13:43Z", "media-type": "Blog", "title": "The Ever-Widening Road", "id": "1674731b-bc60-4eca-a862-bdda273ca465", "content": "682- Today's Prime Time Devo comes from 2Sa 22:37 You enlarged my path under me; So my feet did not slip. I don't know about you, but when I drive in the mountains on roads without guardrails, I freak out. I get queasy just looking at video of some of the crazy trails that people have carved out of mountains. If there is height involved, I want a very wide trail with very high railings. David points out here that we don't need to live our lives precariously. God is more than willing and able to widen the road beneath our feet and give us sure footing. He does this with His Word. John the Baptist came preaching the Word of repentance. He established the grade and Jesus came and paved the way to heaven with the Gospel. Mr 1:2 As it is written in the Prophets: \"Behold, I send My messenger before Your face, Who will prepare Your way before You.\" 3 \"The voice of one crying in the wilderness: 'Prepare the way of the LORD; Make His paths straight.'\" 4 John came baptizing in the wilderness and preaching a baptism of repentance for the remission of sins. This preaching of the Word opened the way of salvation through faith in the Lamb of God who takes away the sins of the world! Here's the thing about God's Word. It not only leads to salvation but it is an ever-widening road of wisdom and understanding as we prayerfully read and study it with the help of the Holy Spirit. This Word will give us sure footing as we travel the road of life. As it says in Pr 4:10-15, “ Hear, my son, and receive my sayings, And the years of your life will be many. 11 I have taught you in the way of wisdom; I have led you in right paths. 12 When you walk, your steps will not be hindered, And when you run, you will not stumble. 13 Take firm hold of instruction, do not let go; Keep her, for she is your life. 14 Do not enter the path of the wicked, And do not walk in the way of evil. 15 Avoid it, do not travel on it; Turn away from it and pass on. Pilgrim, take the road God has laid out for you in His Word.", "source": "Prime Time Devo"}