{"published": "2015-09-23T18:46:40Z", "media-type": "News", "title": "Taking another look at Machado and Jimenez milestones (updated) - School of Roch", "id": "d51c2ca1-7b3c-4012-8f5a-4b789b2243ee", "content": "WASHINGTON - The traffic getting into D.C. today was the same as the previous two days despite the arrival of Pope Francis. No reason to leave the house any earlier, but I'm already seated in the Nationals Park press box while the grounds crew waters the infield and Paul Janish chats with Reed Johnson in shallow center field. \n \nThe Orioles will take early batting practice beneath a blue sky, with hardly a trace of clouds overhead. The nicest day so far since the Orioles arrived here. \n \nHow's that for color? \n \nUpdate: Miguel Gonzalez is throwing his simulated game today under that same blue sky. So far so good. \n \nManny Machado registered his 500th career hit last night, impressive when considering that he reached the milestone at 23 years, 78 days, making him the youngest player in Orioles history. \n \nAlso consider that he's playing on two surgically repaired knees and he's the only major leaguer this season to appear in every game. \n \nAccording to STATS, Machado is the seventh-youngest active player with 500 hits. He set the Orioles record by unseating Hall of Famer Eddie Murray, who was 23 years, 197 days old. Cal Ripken, Jr. was third, according to STATS, at 23 years, 339 days. \n \nUbaldo Jimenez reached his own milestone last night by becoming the 11th Dominican-born pitcher with 100 career victories, but he had other reasons to feel special. \n \nAccording to the Elias Sports Bureau, Jimenez became the second American League pitcher this season to be credited with a victory and a game-winning RBI in the same game, joining the Rays' Nathan Karns on July 21 versus the Phillies. \n \nJimenez also became the 25th American League pitcher in 19 years of interleague play to record a victory and game-winning RBI. \n \nJimenez has two RBIs this season. He also drove in a run on June 17 in Philadelphia. \n \nSince the designated hitter rule was enacted in 1973, only eight other AL pitchers have driven in a run in two different games in the same season, and the list includes four Orioles - Jimenez, Mike Mussina in 1999, Kris Benson in 2006 and Zach Britton in 2", "source": "Mid Atlantic Sports Network"}