{"published": "2015-09-04T18:31:25Z", "media-type": "News", "title": "The Buzz: Studio 247 Fine Jewelry opens", "id": "4bc377b3-e57c-4a54-9d0a-328f955c49cb", "content": "Studio 247 Fine Jewelry opened Sept. 1, 2015 in Grand Chute. (Photo: File) \n\nStudio 247 Fine Jewelry opened Tuesday at 247 S. Nicolet Road in Grand Chute. \n\nIts large, luxurious jewelry boutique space, between Willows Bend and Gather Americana, is familiar to high-end shoppers as it once was Earth Resources founded by the late John Barlow and owned by his daughter Alice. \n\nStudio 247 is making good use of Earth Resources’ wood-trimmed glass jewelry cases and counters for its red carpet-worthy classic necklaces and earrings. \n\nCraig Slavens, Studio 247 co-owner, knows the space well as he was a jewelry designer at Earth Resources for three years, several years before its 2012 closure. \n\nStudio 247 is a different kind of jewelry store, he said, because it doesn’t just carry high-end and custom jewelry. \n\nBracelet designed by Craig Slavens of Studio 247 Fine Jewelry in Grand Chute.   (Photo: Courtesy of Craig Slavens) \n\n“We have unusual, one-of-a-kind pieces in every price range,” he said. \n\n“It has upscale decor, and we love the space, but we want everyone to feel comfortable. Sure, we want the $40,000 sale, but we don’t want someone with a few hundred to spend to feel out of place. One woman just purchased a pair of amber earrings for $245.” \n\nHe and shop co-owner Milada Rice added wedding rings and displays of wear-everyday jewelry that can be as little as $50 for a handmade pair of sterling silver earrings. An estate jewelery counter includes cameos that had been photographed for Vogue. \n\nRice is also assembling a side room of vintage accessories, starting with her grandmother’s own high-end collection of handbags, shoes and hats. Their family operates Rice Family Industries and Waupaca Elevator Co. \n\nSlavens, a Californian, is a gemologist, designer and expert on both rare pink diamonds and diamond grading. One of his designs in the shop is a pink pear-shaped diamond ring for $42,500. \n\nA rare pink pear-shaped diamond is paired with white diamonds in Craig Slavens' \"bypass\" ring design.   (Photo: Courtesy of Craig Slavens) \n\nWhen he learned this space was available, he began working on a plan for it with the Rice family.  After Earth Resources, he moved to Arkansas, near family, and continued to design and manufacture his own high end jewelry line. He earned an American Gem Trade Association Spectrum Design Award for a bridal necklace in 2012. \n\nThe new jewelry shop could easily fit into a larger city. \n\n“I like Wisconsin, I like the people, the seasons, the cost of living,” he said. “You may sell more elsewhere, but you have a higher overhead. I enjoy the customers here. They’re real.” \n\nMeanwhile, Rice said anyone who knew Slavens would be happy he has returned. “Everyone loves Craig,” she said. “He’s down to earth and very kind.” \n\nFor more information: see Facebook or call 920-903-8716. A website  is under construction. \n\n— Maureen Wallenfang: 920-993-7116, or mwallenfang@postcrescent.com; on Twitter @wallenfang \n\nRead or Share this story: http://post.cr/1UxmbXV", "source": "Post Crescent"}