{"published": "2015-09-15T15:09:15Z", "media-type": "News", "title": "Alliance Data Selected By Toyota To Launch New Private Label Credit Cards For Toyota And Lexus Brands, Manage And Grow Existing Co-Brand Credit Card Program", "id": "a465b3e1-fb6b-45c9-a9b4-8dcd92c70b7a", "content": "SOURCE Alliance Data Systems Corporation\n\nAlliance Data also signs agreement to acquire Toyota's co-brand card portfolio\n\n-- Alliance Data's card services business expands its tools, data-driven loyalty and marketing expertise to benefit the automotive industry\n\n-- Card programs to leverage custom in-dealership redemption platform developed by Alliance Data and supported by its robust mobile capabilities\n\n-- Alliance Data's Epsilon business to provide additional analytics and consulting support for Toyota geared toward optimizing cardmember insights and engagement\n\nDALLAS \n\nAdditionally, Alliance Data has entered into an agreement to purchase Toyota's existing portfolio of co-brand credit card accounts, subject to regulatory approval and customary closing conditions. Details of the purchase price were not disclosed, other than to note it is well within norms of the industry.\n\n\"The goal of this new partnership with Alliance Data is to further evolve our credit tools into loyalty tools, which will drive incremental revenue to our dealerships,\" said Mike Owens \n\nAlliance Data will provide credit card marketing services for the Toyota and Lexus co-brand credit cards, and will launch new private label credit cards for both brands, utilizing customer-centric insights and analytics to increase cardmember engagement and incremental sales. Both card programs will be designed to drive brand loyalty by rewarding cardmembers for every purchase, with additional points earned for Toyota or Lexus brand purchases, such as vehicle service and parts. Earned points are redeemable toward additional Toyota and Lexus service, parts or accessories, or a customer's next Toyota or Lexus vehicle. The new private label credit cards will also offer flexible financing options.\n\nToyota also will use Alliance Data's advanced suite of digital and mobile solutions to create a compelling cardmember experience and engage dealerships. Alliance Data will build mobile credit apps for the Toyota and Lexus brands to offer customers a brand-centric, integrated account management and rewards experience. Alliance Data will also launch a customized dealer portal that will feature access to key dealer performance data, marketing materials, training tools and other program support materials. In addition, a direct rewards redemption capability will be leveraged to provide a level of dealership support unmatched in the industry.\n\nAlliance Data's Epsilon business will provide in-dealership support of the card programs by identifying and communicating to current Toyota vehicle owners with personalized permission-based marketing messages, including email and direct mail. Epsilon has worked with Toyota and its dealer network since 2009, providing client relationship management (CRM) services, combining online and offline data to engage vehicle owners with highly targeted and analytically driven communications that generate ongoing sales and service transactions to build long-term owner loyalty.\n\nAlliance Data believes that the performance of the Toyota co-brand card portfolio once acquired will be consistent with its overall co-brand credit card portfolio, and all new co-brand and private label credit card accounts will be consistent with Alliance Data's credit quality standards. Closing of the portfolio purchase is expected in Q4 2015.\n\n\"As the automotive industry leader, Toyota's objectives are clearly aligned with Alliance Data's rich history of driving loyalty and sales through an omnichannel strategy, strong value proposition, exemplary customer service and robust analytics,\" said Melisa Miller \n\nAbout Toyota\n\nToyota (NYSE:TM), the world's top automaker and creator of the Prius and the Mirai fuel cell vehicle, is committed to building vehicles for the way people live through our Toyota, Lexus and Scion brands. Over the past 50 years, Toyota has built more than 25 million cars and trucks in North America \n\nAbout Alliance Data's card services businessAlliance Data's card services business is a leading provider of tailored marketing and loyalty solutions, delivered through branded credit programs that drive more profitable relationships between our brand partners and their cardmembers. We offer private label, co-brand, and commercial products to many of the world's most recognizable brands across a multitude of channels.\n\nWe uphold our Know more. Sell more.® promise by leveraging unmatched customer insights, advanced analytics, and broad-reaching innovative capabilities. It's how we deliver increased sales to our partners, build enduring loyalty to their brands, and provide more value to our cardmembers. Alliance Data's card services business is a proud part of the Alliance Data enterprise. To learn more, visit www.alliancedataretail.com or follow us on Twitter @ADRetail.\n\nAbout Alliance Data\n\nAlliance Data® (NYSE: ADS) is a leading global provider of data-driven marketing and loyalty solutions serving large, consumer-based industries. The Company creates and deploys customized solutions, enhancing the critical customer marketing experience; the result is measurably changing consumer behavior while driving business growth and profitability for some of today's most recognizable brands. Alliance Data helps its clients create and increase customer loyalty through solutions that engage millions of customers each day across multiple touch points using traditional, digital, mobile and emerging technologies. An S&P 500 and Fortune 500 company headquartered in Plano, Texas \n\nAlliance Data's card services business is a leading provider of marketing-driven branded credit card programs. Epsilon® is a leading provider of multichannel, data-driven technologies and marketing services, and also includes Conversant®, the leader in personalized digital marketing. LoyaltyOne® owns and operates the AIR MILES® Reward Program, Canada's \n\nFollow Alliance Data on Twitter, Facebook, LinkedIn and YouTube.\n\nAlliance Data's Safe Harbor Statement/Forward Looking Statements\n\nThis release may contain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Such statements may use words such as \"anticipate,\" \"believe,\" \"continue, \" \"could,\" \"estimate,\" \"expect,\" \"intend, \" \"may, \" \"predict,\" \"project,\" \"would,\" and similar expressions as they relate to us or our management. When we make forward-looking statements, we are basing them on our management's beliefs and assumptions, using information currently available to us. Although we believe that the expectations reflected in the forward-looking statements are reasonable, these forward-looking statements are subject to risks, uncertainties and assumptions, including those discussed in our filings with the Securities and Exchange Commission.\n\nIf one or more of these or other risks or uncertainties materialize, or if our underlying assumptions prove to be incorrect, actual results may vary materially from what we projected. Any forward-looking statements contained in this presentation reflect our current views with respect to future events and are subject to these and other risks, uncertainties and assumptions relating to our operations, results of operations, growth strategy and liquidity. We have no intention, and disclaim any obligation, to update or revise any forward-looking statements, whether as a result of new information, future results or otherwise, except as required by law.\n\n\"Safe Harbor\" Statement under the Private Securities Litigation Reform Act of 1995: Statements in this presentation regarding Alliance Data Systems Corporation's business which are not historical facts are \"forward-looking statements\" that involve risks and uncertainties. For a discussion of such risks and uncertainties, which could cause actual results to differ from those contained in the forward-looking statements, see \"Risk Factors\" in the Company's Annual Report on Form 10-K for the most recently ended fiscal year. Risk factors may be updated in Item 1A in each of the Company's Quarterly Reports on Form 10-Q for each quarterly period subsequent to the Company's most recent Form 10-K.\n\nLogo - http://photos.prnewswire.com/prnh/20051024/ADSLOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/alliance-data-selected-by-toyota-to-launch-new-private-label-credit-cards-for-toyota-and-lexus-brands-manage-and-grow-existing-co-brand-credit-card-program-300142358.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KWES NewsWest 9"}