{"published": "2015-09-23T23:10:58Z", "media-type": "News", "title": "Edinburgh and Glasgow poles apart when it comes to inspiring bosses, study", "id": "4e9a576c-6f05-4d21-910e-ae742393b7a7", "content": "EDINBURGH is home to the most motivating bosses in Britain, while Glasgow is host to some of the most uninspiring, a new study has found. \n \nAcross Britain one in four say they do not feel motivated by their managers and an equal number say they are not appreciated for their hard work, according to new research by Investors in People. \n \nBut the study of 3500 employees conducted to examine links between staff management and business performance, found that 82% of staff in Edinburgh said they had inspiring bosses, while 77 percent of workers in London and Belfast felt the same. \n  \nLoading article content \n   \n \n \nBut it was Bristol, Sheffield and Glasgow that had the most uninspiring managers with 36 percent, 33 percent and 31 percent saying they were not motivated by their bosses. \n \nInvestors in People said the data provided painted a \"shocking picture\" of Britain's bosses. \n \nPaul Devoy, head of Investors in People, commented: “Our research shows that many employees are feeling frustrated in their roles due to poor management. Strong and inspiring leaders are critical in business in order to get the best from your staff. \n \n \n \n\"These findings should be a wake up call to leaders and one of the reasons Investors in People has worked with top businesses across the country to launch a leading practice framework, helping organisations manage their people more effectively.” \n   \n Share article  \n   \nInvestors in People who worked with economic analysis consultancy TBR to evaluate the value of this bad leadership, identified a £39 billion cost to UK businesses every year. \n \nThe study also found that one third (30 per cent) of British employees don’t trust their boss, which is not surprising when one in five (20 per cent) don’t believe in the importance of training their staff.", "source": "Herald Scotland"}