{"published": "2015-09-25T09:32:14Z", "media-type": "News", "title": "Japan must do more to curb coal-fired power plants -experts", "id": "8640a940-2ac4-499e-b1e0-50b10419d3eb", "content": "TOKYO, Sept 25 Japan's government is considering\nnew steps to tighten regulations on coal-fired power stations,\nbut some experts said these would not be enough to help meet its\ngoals on curbing carbon emissions over the next couple of\ndecades. \n\nTokyo is trying to manage the competing demands of cutting\ngreenhouse gas emissions while burning coal at record levels\nafter the Fukushima disaster decimated public trust in nuclear\npower. \n\nClimate change is centre stage internationally ahead of U.N.\nenvironmental talks in Paris later this year, with Japan's\ngovernment coming under fierce criticism from environmentalists\nover its support for coal. \n\nThe nation's industry ministry is discussing rules forcing\nall new stations to have a thermal efficiency equivalent to at\nleast around 40-42 percent of levels seen in so-called\nultra-super-critical plants, which typically get the most energy\nfrom coal through the most advanced technology available for\ncommercial use. That would hit the construction of small plants\nwith a capacity below 112,500 kilowatts, whose maximum\nefficiency usually stands around 36 percent. \n\nAt the same time, the environment ministry is considering\nmaking all plants go through a costly assessment that takes\naround four years before being built. Currently only larger\nplants are subject to the process, with smaller facilities often\nonly requiring local government approval. \n \n\"These measures may help reduce the number of small plants,\nbut they won't be enough for Japan to keep its emission goal,\"\nsaid Takeo Kikkawa, professor at Tokyo University of Science. \n\nThe world's No.5 emitter of CO2 has watered down emissions\ntargets, but still has a goal to cut greenhouse emissions by 26\npercent from 2013 levels by 2030. \n \nThat is despite plans to construct 40 more coal stations in\nthe next decade, including over 10 small plants that are cheaper\nto build, as the country opens up its retail electricity market\nfrom next April, exposing 10 regional power monopolies to new\ncompetition. \n\nAny new steps would come on top of a voluntary plan\nannounced in July by electricity providers to cut greenhouse\nemissions by more than a third by 2030 compared with 2013. But\nthe environment minister has questioned the plan, demanding\nmore-detailed measures. \n\nHiroshi Takahashi, professor at Tsuru University, said\nbroader steps were required to meet Japan's goals. \n \n\"Japan will need to bring in some compulsory measures such\nas a (higher) environment tax or emissions trading.\" \n\nAn industry ministry official said the sector's voluntary\nplan would be \"effective\" in achieving emissions goals, while an\nofficial from the environment ministry said it was considering\nall possible measures to help Japan reach its targets. \n\nMeanwhile, industry ministry officials denied a report by\nthe Nikkei business daily this week saying that it was\nconsidering limiting each utility to using coal-fired plants for\na maximum of half their thermal power generation. \n\n(Reporting by Yuka Obayashi; Editing by Joseph Radford )", "source": "Reuters UK"}