{"published": "2015-09-16T23:30:45Z", "media-type": "News", "title": "Time to move on from independence...", "id": "d3f87d44-d58a-4ac1-b260-56f50af00b6c", "content": "Leading entrepreneur Sir Tom Hunter has said it is time for Scotland to \"move on\" from last year's independence referendum.\n\nThe Sports Division founder said politicians must respect the result of the vote - in which Scots voted by 55% to 45% to stay in the UK - as he called on party rivals to unite and \"focus upon building a more prosperous, productive and fairer Scotland where opportunity prevails for all\".\n\nSir Tom made the comments as The Hunter Foundation published a new report by Professor David Bell of Stirling University looking at changes to devolution in the wake of the September 18 ballot.\n\nThe Smith Commission, which was set up after the referendum, recommended Holyrood get new tax and welfare powers, with legislation currently going through Westminster.\n\nBut Prof Bell's report warned that \"o verall the transfer of the new powers will be at best a zero sum game\". \n\nHe said there was \"every likelihood\" the Scottish Government would \"have more control over Scottish affairs but less money than under previous fiscal settlements to invest\" unless it uses its new tax-raising powers. \n\nThe Scottish Government will be able to raise £17.7 billion of its annual budget of about £30 billion, the report said. \n\nWhile new powers over income tax in the Scotland Bill have the \"greatest potential\" for increasing revenues, the report argued hikes in this are \"highly unpopular in the UK\", pointing out that recent chancellors have used \"stealth taxes\" to boost their spending power. \n\n\"Because Smith's proposals cover a narrow range of highly visible taxes, the Scottish Government will not have access to the more subtle ways that recent chancellors of the exchequer have used to raise cash,\" the report said. \n\n\"Though there maybe no reason in principle why Scotland should not increase income tax rates, Scottish governments may not wish to put their popularity at risk by doing so.\" \n\nAdditional welfare powers will add about £2.7 billion a year to the amount the Scottish Government needs to spend, the report stated. \n\nBut it added the Scotland Bill differs from the Smith Commission recommendations in \"two important ways\", saying: \" The power to create new benefits only applies to those areas where responsibility is to be devolved. This implies the Scottish Government could create a new benefit for carers but not for the unemployed. \n\n\"The transfer of individuals from disability living allowance to personal independence payments is to continue even though these benefits are to be devolved. This is highly unpopular because the tests for PIP eligibility are widely though to be unfair.\"\n\nSir Tom said the report had been published because \"a year on we felt it important to review what was promised, what was delivered - or is in the process of being - what was missing and where we would be had we voted Yes\". \n\nWith no agreement in place over the amount Scotland receives in its block grant from Westminster, Sir Tom added: \"W e sit in a bit of a beggars muddle where the Scottish Government is negotiating with HM Treasury over settlements; a negotiation that will undoubtedly fuel consistent sniping that Scotland is not getting enough of its share. \n\n\"For me, personally, it's time to move on, move forward and use the powers we have. The population decided, politicians are democratically elected and should and must respect the decision of the voters.\n\n\"We are all ambitious for Scotland and its time for us to come together, put our differences aside and focus upon building a more prosperous, productive and fairer Scotland where opportunity prevails for all.\"\n\nLabour's shadow Scottish secretary Ian Murray said: \" Sir Tom Hunter again has said that Scotland needs to move on from the arguments of the past and face the future. He is absolutely right to do so. \n\n\"Scottish Labour wants to cut the gap between the rich and the rest in education to ensure that every child in every classroom gets the best possible start in life.\n\n\"We want to equip our young people with the skills for the jobs of tomorrow and protect our NHS for the challenges it will face in the next few decades. It's time to face the future, not argue about the past.\n\n\"The SNP and the Tories want to continue to bicker about the constitution because they can't defend their record in government, whether it is cutting tax credits for the working poor or an education system which sees a majority of those from poor backgrounds without the skills they need in reading, writing or numeracy. It's time to move on.\"\n\nA spokesman for the SNP said: \" Tom Hunter is right to point out that the Scotland Bill falls well short of even the limited powers of the Smith Commission - leaving too many key powers in the hands of the UK Government which should be transferred to Scotland. \n\n\"Full economic powers need to be in Scotland's hands to allow Scotland's parliament to take action to grow the economy, support business and create jobs - rather than having growth held back by the austerity policies of David Cameron and George Osborne.\n\n\"With only 9% of people in Scotland believing the vow has been delivered and with an out-of-touch Tory government we didn't elect engaged in a relentless assault on the most vulnerable people in Scotland, it's no wonder support for independence is continuing to grow - as more and more people question whether Westminster is capable of representing Scotland's interests at all.\"", "source": "TalkTalk"}