{"published": "2015-09-29T08:57:17Z", "media-type": "News", "title": "An Insider Mallika Srinivasan Purchases $11.31 million of AGCO Corporation (NYSE:AGCO)", "id": "1d318f4f-864b-43bf-8554-a49dcf1467fc", "content": "Mallika Srinivasan Insider Buy Transaction  \nMallika Srinivasan, an insider and also director of the exchange-traded company AGCO Corporation (NYSE:AGCO) 45.60 -0.29 -0.63% made a big purchase, which can’t go unnoticed. She acquired 247,390 shares of the company with the deal having a market value near $11.31 million U.S. Dollars – based on a market stock price of $45.7 for share. She also bought 299,610 shares that are worth $13.31 million USD in the last month. This is a acquisition that is not going to stay disregarded as Mallika already owns 12.16 million shares accounting for 14.06% of the Company’s market cap \n Agco Corp De Stock Rating, Sentiment and Fundamentals  \nThis big investment could mean that Mallika is confident in two things – the future of Agco Corp De and likely increase of its valuation. According to the nineteen leading equity analysts that are covering this firm’s financial position, there is an expectation of earnings-per-share of $3.07 for the 2015 year, which gives Agco Corp De a PE ratio of 14.84. They also anticipate a growth rate year-over-year of more than 1.40%. \n       Rating & Sentiment PsychSignal Social: SELL Analysts Rating: BUY Hedge Funds Sentiment: NEUTRAL      Stock Fundamentals Earnings + FCF Trend: NEUTRAL Sector/Industry Macro: BULLISH Valuation Models: -        Technical Analysis ST Trend: DOWN MT Trend: DOWN LT Trend: UP      OctaFinance Rating*: BUY    \n* Read How Our Stock Ratings System Works \n         \nWe too rate the stock a Buy but not just due to Mallika Srinivasan’s insider stock investment but rather because our own stock trend following model which is displayed below. The price of Agco Corp De’s stock has risen 6.32% over the last 200 days, and is in a reliable up trend. With such a bulltrend experts may be wondering about the changes that Mallika Srinivasan has brought to the -listed company. \n Price Chart of Agco Corporation NYSE:AGCO Stock  \n  \nSource: RightEdgeSystems , Yahoo Split & Dividend Adjusted Data and OctaFinance Interpretations \n \nAs popular stock market traders including George Soros stated, best returns are made through a mix of technical and fundamental analysis. Mallika Srinivasan’s net worth will go up by exactly $43.89 million U.S Dollars if the stock price go to the medium-term target of $49.50. We at Octafinance hope that you aren’t shorting this stock. \n Hedge Funds Ownership  \n13F SEC filings revealed that, 343 hedge funds and other players have shares in Agco Corp De. The institutional ownership of the company in the last quarter is very high, at 95.49% of the shares outstanding. Its up 2.16% from previous quarter. These professional stock holders increased the total shares they own by 1.76 million to 83.21 million this quarter. A total of 40 funds opened new positions in Agco Corp De and 105 increased their holdings. There were 33 funds that closed their positions and 151 that reduced them. \n \n10 [HF3951] are positive about the stock and have it in their Top 10. Some of these are: Southernsun Asset Management Llc, Fairpointe Capital Llc, Invictus Rg Pte. Ltd., Blue Harbour Group L.P., Schwerin Boyle Capital Management Inc, Aston Asset Management Llc, Corecommodity Management Llc, Lucus Advisors Llc, Moon Capital Management Llc, Zuckerman Investment Group Llc. \n \n \n\n \n Southernsun Asset Management Llc is the most positive institutional investor on Agco Corp De, with ownership of 5.96 million shares as of Q2 2015 for 6.13% of the fund’s portfolio. Fairpointe Capital Llc is another positive investment manager owning 4.35 million shares of the company or 3.44% of their stocks portfolio. The stock is also 3.53% of the fund’s AUM. In addition The Singapore-based fund Invictus Rg Pte. Ltd. have 0.92% of their stock portfolio invested in the stock for 17,342 shares. Clifton S. Robbins’s Blue Harbour Group L.P. disclosed it had acquired a stake worth 7.77% of the fund’s stock portfolio in Agco Corp De. The Massachusetts-based fund Schwerin Boyle Capital Management Inc is also confident in the publicly listed company, possessing 561,699 shares or 4.19% of their stock portfolio. \n AGCO Corporation NYSE:AGCO Company Profile  \n \nAGCO Corporation is a manufacturer and distributor of agricultural equipment and related replacement parts around the world. The Company sells a range of agricultural equipment, including tractors, combines, self-propelled sprayers, hay tools, forage equipment, seeding and tillage, implements, and grain storage and protein production systems. Its products are marketed under various brands, including Challenger, Fendt, GSI, Massey Ferguson and Valtra. It also provides retail financing through its finance joint ventures with Cooperatieve Centrale Raiffeisen-Boerenleenbank B.A. The Company’s geographical segments include North America, South America, Europe/Africa/Middle East and Asia/Pacific. The Company’s AGCO Power engines division produces diesel engines, gears and generating sets. It also offers precision farming technologies, which are installed in its products and include satellite-based steering, field data collection, yield mapping and telemetry-based fleet management systems. \n \nCompany Website: AGCO Corporation \n \nAt the moment its market cap is: $3.97 billion and it has 86.51 million outstanding shares. The company has 20800 employees. As of writing there are 102.51% shareholders and the institutional ownership stands at 102.51%. Agco Corp De was founded in Delaware on 1991-04-22. The stock closed at $45.599998 yesterday and it had average 2 days volume of 270181 shares. It is down from the 30 days average shares volume of 284075. Agco Corp De has a one year low of $41.60 and a 52w high of $57.90. The stock price is below the 200 days simple moving average. Agco Corp De last issued its quarterly earnings information on 07/28/2015. The company reported 1.25 EPS for the quarter, above the consensus estimate of 1.02 by 0.23. The company had a revenue of 2.07 billion for 6/30/2015 and 1.70 billion for 3/31/2015. Therefore, the revenue was 366.70 million up. \n \n* Shares were purchased pursuant to a Rule 10b5-1 trading plan entered into by Tractors and Farm Equipment Limited (“TAFE”) on August 25 – 2015. \n \n* These shares are owned directly by TAFE. Mallika Srinivasan is an officer of TAFE and is a beneficial owner of certain equity securities of TAFE. Ms. Srinivasan disclaims beneficial ownership of the shares reported in Column 5 of the row except to the extent of Ms. Srinivasan’s beneficial ownership of equity securities of TAFE – and this report shall not be deemed an admission that Ms. Srinivasan is the beneficial owner of such shares for purposes of Section 16 or for any other purpose. TMTL also disclaims beneficial ownership of the shares reported in Column 5 of the row – and this report shall not be deemed an admission that TMTL is the beneficial owner of such shares forpurposes of Section 16 or for any other purpose. \n \n* These shares are owned directly by TMTL – which is a wholly owned subsidiary of TAFE. TAFE is an indirect beneficial owner of these shares. Mallika Srinivasan is an officer of TMTL and is a beneficial owner of certain equity securities of TMTL. Ms. Srinivasan disclaims beneficial ownership of the shares reported in Column 5 of this row except to the extent of Ms. Srinivasan’s beneficial ownership of equity securities of TMTL – and this report shall not be deemed an admission that Ms. Srinivasan is the beneficial owner of such shares for purposes of Section 16 or for any other purpose. \n \n* These shares reflect awards to Mallika Srinivasan for her services as a director of AGCO Corporation under the AGCO Corporation 2006 Long-Term Stock Incentive Plan. TAFE and TMTL disclaim beneficial ownership of the shares reported in Column 5 of this row – and this report shall not be deemed an admission that either TAFE or TMTL is the beneficial owner of such shares for purposes of Section 16 or for any other purpose. \n \nThe post appeared first on Octafinance .", "source": "Octafinance"}