{"published": "2015-09-08T19:45:57Z", "media-type": "News", "title": "After long buildup, Colbert to begin as new host of 'The Late Show' on CBS", "id": "5a3ba7e9-33be-47ca-9ad7-5798096bf798", "content": ", EDT. \n   \nNEW YORK, N.Y. - Stephen Colbert — the real guy, not the Comedy Central character — officially takes over for the retired David Letterman as host of CBS' \"The Late Show\" on Tuesday night. \n\nAnnounced guests for opening night are George Clooney and Jeb Bush. CBS is even giving Colbert extra time, saying the show will finish 9 minutes over the usual hour. \n\nColbert has retired the political talk-show host character he portrayed on \"The Colbert Report\" for the platform on television's most-watched network. He'll be in direct competition with the two Jimmys, ratings leader Jimmy Fallon on NBC's \"Tonight\" show and ABC's Jimmy Kimmel. \n\nCBS has renovated the Ed Sullivan Theater in New York after Letterman and his team left last May to give Colbert a fresh start. \n\nColbert teased the show with occasional comic routines released online over the summer, and turned up unannounced to host a talk show on Michigan public access television, with Eminem as guest. \n\nHe's expected to give a spotlight on his first show to his new bandleader, Jon Batiste, and his group Stay Human. \n\nPresidential contender Bush can expect to be teased by Colbert for sending out a fundraising letter auctioning off a seat in the audience for Tuesday's first show, which CBS said had been done without the network's knowledge. Typically, these shows provide guests with a handful of free tickets to distribute. \n\nThe guest list for Colbert's first week of shows indicates he plans to get beyond the typical show biz patter of many talk shows. Vice-President Joe Biden will visit Thursday and the CEOs of Tesla Motors and Uber will also make appearances. Comic Amy Schumer, actress Scarlett Johansson and author Stephen King are also on the schedule. \n \nContent Provided By Canadian Press.", "source": "CJAD 800"}