{"published": "2015-09-28T16:30:04Z", "media-type": "Blog", "title": "Robert Spaemann on why education can't be \"objective\"", "id": "07a94c7a-1d0b-4664-b28c-1ee358e559c2", "content": "A brilliant selection posted by Ken Myers on Mars Hill Audio's website:\n“Teaching a language is the model for all other education. To educate means to introduce a person into one’s own world, to interpret the world, to train a person to make distinctions, whether it be the distinction between a blackbird and a robin, between a brook and a canal, and between a Mercedes and a Volkswagen, or on the other hand the distinction between the important and the trivial, between the beautiful and the ugly, and between good and evil.\n“The distinctions just mentioned are not ones we can learn in a merely theoretical way. We learn to distinguish between the important and the trivial only through the practice of acts of preference, deferral, and renunciation. We learn to distinguish between ‘beautiful’ and ‘ugly’ by growing out of the crude judgments that ‘I like that’ and ‘I don’t like that,’ and by fashioning in ourselves an organ for the perception of objective qualities. But this happens in the first place through an encounter with beauty, through involvement with the beautiful, and through learning to do whatever one does in a beautiful manner. The distinction between good and evil, however, is something we acquire only by learning to take one side and to be against the other — and perhaps in certain circumstances even to be against ourselves; we acquire it by learning that the world is a battlefield between good and evil and that this battle goes on even in our own heart. . . .\n“[M]any think that . . . we ought simply to expose young people ‘non-judgmentally’ to various possible worldviews. An exposure of this sort is supposed to be what first teaches a person the attitude of general tolerance, and for the rest, when a person cannot avoid making a choice, it teaches the ability to make a free decision. As if it were possible to choose something that one never got to know from the inside!\n“This way of looking at things is a profound and fateful anthropological and pedagogical error. If a person believes that there are many different paths man could take to reach his goal, he does not infer the resolution to follow one of them in a faithful way. Instead, he draws the inference that there is no need to follow any particular path, and he leaves them all as hypothetical. The pathological inability to make a commitment that afflicts many young adults today is already the product of such an approach to education. We prevent young people from experiencing the power that a demanding view of the world and man has to open up reality, merely because we want to give them the possibility of looking at reality from some other perspective. This is a great injustice to children.”\n—from Robert Spaemann, “Education as an Introduction to Reality,\" Humanum: Issues in Family, Culture & Science (2015, no. 1)", "source": "only the curious have something to find"}