{"published": "2015-09-24T20:38:00Z", "media-type": "Blog", "title": "After Prank Calls, Russian President Putin Actually Chats With Elton John", "id": "bfd42c7f-3d43-4f90-b4e1-0b0985943e9c", "content": "Copyright 2015 NPR. To see more, visit http://www.npr.org/. Transcript ARI SHAPIRO, HOST: Another Putin conversation caught our eye this morning. A news alert said Russian president Putin asked Elton John not to feel offended over earlier prank phone call. We had to learn more, so we reached Bridget Kendall, the BBC's diplomatic correspondent, who is at least partially responsible for today's Putin-Elton summit. BRIDGET KENDALL: (Laughter). SHAPIRO: Welcome to the program. KENDALL: Well, it's not a summit yet. They haven't yet quite met face to face. SHAPIRO: Well, explain how this pop star renowned for \"Candle In The Wind,\" \"Crocodile Rock,\" songs from \"The Lion King\" wound up on the phone with the Russian president? KENDALL: Well, the important thing to understand is that Elton John isn't just a pop star. He's also, these days, a very active gay rights campaigner. And a couple of weeks ago, I caught up with him in Kiev in Ukraine and did an interview with him. We were talking about gay rights in Russia and Ukraine - quite a lot of problems with gay rights in Russia. They have laws which ban what they call homosexual propaganda. So asked him out of the blue, really, would you like to meet President Putin? And he immediately said, oh, yes, I'd love to do that; I'd love to sit down with him and have a cup of tea, he said in a very British way. So we thought that was great, and we put it out. We didn't think that it would go anywhere. But look where we are today. They've been talking on the phone. SHAPIRO: Well, between those two events, I was living in London up until last week and remember seeing headlines that Elton John posted on his Instagram account a photo of Vladimir Putin and said, what a delight it was to talk with Putin about LGBT issues. And then we learned that in fact, he wasn't talking to the real Putin. KENDALL: We called him people, and they said, yeah, no - definitely it was Vladimir Putin. We were absolutely sure it was. The Kremlin, though, was a bit silent for a bit, and then they came out and said, no, that wasn't us. SHAPIRO: So it was pranksters. KENDALL: When you think of it, you know, Elton John's office probably doesn't very often get calls Russian politicians, and how were they to know this President Putin in inverted comas would've been speaking Russian through a translator? It probably was quite hard to tell. But the Kremlin answered in a very interesting way. In the - they said, well, you know, they really ought to apologize to the British singer. And they also said they weren't against the idea of President Putin meeting Elton John. So I thought we got to keep an eye on this. And indeed today, when he was out in Southern Russia talking to people about the harvest, the Russian president apparently took time out of his schedule to call Elton John. Apparently, according to the Kremlin, he did it through the Russian ambassador in London. And apparently, perhaps not surprisingly, Elton John's office were a bit wary about whether this might be another prank, and it took him some time to persuade them. This time, the Russian president really did want to talk to him. But I spoke to his office not that long ago, and they said it had indeed taken place, this conversation, and they were very happy with it. And they were now looking at diaries to try and meet up. SHAPIRO: And do we know if there was any substantive conversation about LGBT issues, which was the original reason that Elton John wanted to speak to the Russian president? KENDALL: The impression I got from both sides was that they called in order to make formal contact to say that the two sides were ready to meet. And if they are going to sit down and talk about gay rights, that will happen face to face, which would be a very interesting meeting to eavesdrop on - don't know if that'll be possible. SHAPIRO: Bridget Kendall, diplomatic correspondent for the BBC, thank you so much for filling us in on this story. KENDALL: My pleasure. Transcript provided by NPR, Copyright NPR.", "source": "KBIA"}