{"published": "2015-09-04T13:29:29Z", "media-type": "News", "title": "NBI raids Bohol ‘investment scam’ firm", "id": "518467fd-c0a6-40bd-afbd-9e9c3f0c3efc", "content": "September 4, 2015 9:29 pm \r\n                \t\t               \r \r [embedded content] \r \r \r \r\n\r \r \r Tweet \r \r \r \nTAGBILARAN CITY, Bohol: A National Bureau of Investigation (NBI) team from the Central Visayas Regional Office swooped down on Klikmart Shopping Mart Corporation in Tagbilaran City on Thursday. \n \nThe team, led by NBI Special Investigator Agapito Gierran, arrived at the office of Klikmart Rewards around 7 p.m. armed with a search warrant issued by Vice Executive Judge Leo Moises Lison for alleged violations of Republic Act 8799 or The Securities Regulation Code. The warrant was received by a certain Ruben Lurot. \n \nThe NBI team confiscated sales invoices, membership registration forms, official receipts, ledgers, journals, and all other books of accounts and documents used in recording investments. \n \nThe team also confiscated money collected for the purported investment activities, flyers and other advertising manuals, as well as projector or visual aid, laptop, desktop computers and security cameras being used by the company. \n \nMembers of Klikmart Rewards said they have no idea that the company is conducting illegal operations because they immediately got returns on their investments, placed at a minimum of P1,500 and have started to receive P15,000 twice a month. \n \nSection 8 of the Securities Regulation Code states that “Securities shall not be sold or offered for sale or distribution within the Philippines, without a registration statement duly filed with and approved by the Commission. Prior to such sale, information on the securities, in such form and with such substance as the Commission may prescribe, shall be made available to each prospective purchaser.” \n \nSection 28 of the same law also states that “No person shall engage in the business of buying or selling securities in the Philippine as a broker or dealer, or act as a salesman, or an associated person of any broker or dealer unless registered as such with the Commission.” \n \nThe said law provides that violators will be fined P50,000 to P5 million or imprisonment of seven years to 21 years, or both in the discretion of the court. \n \nPNA \n \r\n\r \r \r\n\r \r\n\r\n\t\t\t\r\n\r \r\n        \r\n\t\t\r \r\n\r \n\n\r\n\r \r \n\r\n\r \n \n\r\n\r\n\r \r \n [embedded content] \r\n\r \n\r \r \n  \r\n            \r \r\n\r\n\r\n\t\t\r At a Glance  US Embassy to Close on September 7 Miner killed after tunnel collapses in Zambo Sibugay 14 injured in Cavite road ACCIDENT Capiz mulls ban on shellfish gathering Death toll in Marikina road TRAGEDY up EcoWaste joins ‘Justice for Doc Gerry Ortega’ crusade Female drug pusher nabbed in Baguio PNoy to grace Iloilo Convention Center inauguration Task force batang angel to search for missing kids in Batangas DSWD completes shelter aid in Western Visayas", "source": "Manila Times"}