{"published": "2015-09-14T17:14:36Z", "media-type": "Blog", "title": "When New England Gets Scary", "id": "4255022e-47dd-4ea1-8cc4-a4a8d5cba0bc", "content": "As memories of a hot, sweaty summer begin to fade, our attention is drawn to the cool, damp and dark days (and nights) of the autumn season, and New England appears to be a hospitable location for new seasonal nightmares to bloom. After all, it's filled with beautiful, historic habitats that lend themselves to haunting tales of terror.\rYet the northeastern United States can be a scary place to live or visit all year round, as the films we've gathered together here can testify. Watch the clips and trailers below to feel the chill -- but you may want to reach for a blanket (or a friend) first!\r \rWhat Lies Beneath (2000)\rSet in Vermont, the story revolves around Michelle Pfeiffer and the gaps in her memory that have plagued her since an automobile accident. She witnesses strange events next door and decides to investigate, against the wishes of her husband, Harrison Ford. The tale soon turns ghostly.\r \rWar of the Worlds (2005)\rSteven Spielberg's very frightening version of H.G. Wells' novel begin in New Jersey, as dock worker Tom Cruise struggles to protect his children from an invasion by extraterrestrials who are definitely not friendly. A fair amount of the movie is set in New England, as the estranged family journeys through hostile territory, and their ultimate destination is Boston.\r \rShutter Island (2010)\rIn Martin Scorsese's masterful adaptation of Dennis Lehane's novel, Leonardo DiCaprio stars as a U.S. marshal investigating a facility on the titular island. It's located in Boston Harbor, a cold, inhospitable institution for the criminally insane; both the weather and the surroundings may prompt viewers to shiver even before the madness of the story becomes evident.\r \rDreamcatcher (2003)\rAnother type of horrific alien invasion was explored in Lawrence Kasdan's adaptation of a Stephen King novel. As with much of King's work, the story is set in Maine as four friends who share the gift of telepathy embark on an annual hunting trip. Things get much, much weirder from there.\r \rLake Placid (1999)\rWould you believe a man-eating crocodile might surface in a gorgeous, peaceful lake in Maine? Sure you would, especially if you've seen this movie!\r \rGraveyard Shift (1990)\rStephen King's short story served as this basis for this film, which features various locations in Maine, ranging from the very beautiful outdoors to a dank and dangerous-looking textile mill.\r \rPet Semetary (1989)\rOne of the better-made Stephen King screen adaptations, this scary story spends a lot of time outdoors in glorious yet haunting Maine locations, including Acadia National Park.\r \rIn the Mouth of Madness (1994)\rJohn Carpenter's movie is set, geographically, in New Hampshire, yet much of the apocalyptic movie delves into a disturbing land of hallucinations and nightmares. What is real, and what is not? Do you really want to know?\r \rJaws (1975)\rAlthough Steven Spielberg's sophomore effort takes place over a New England summer weekend on the fictional Amity Island, it is as chilling as any movie set in the dead of winter.", "source": "Fandango Movie News"}