{"published": "2015-09-18T05:47:54Z", "media-type": "News", "title": "Peter Woolcott appointed to IWC as Japan set to resume Antarctic whaling", "id": "91655549-d56d-4e8c-a71c-6ed2c5846754", "content": "He's one of Australia's most deeply experienced, best credentialled diplomats – and he has just weeks to try to persuade Japan not go to whaling in the Antarctic again. He's one of Australia's most deeply experienced, best credentialled diplomats – and he has just weeks to try to persuade Japan not go to whaling in the Antarctic again. Ambassador for the Environment, Peter Woolcott​, has been appointed as the new Australian Commissioner to the International Whaling Commission, significantly lifting the post's diplomatic profile.\n\nA professional for 34 years from a legendary Australian diplomatic family, Mr Woolcott​, 61, recently marshalled a quiet, costly, and successful, offensive against the World Heritage in danger listing of the Great Barrier Reef.\n\nHis appointment book is also crowded as Australia's head of delegation to the United Nations Framework Convention on Climate Change, which meets in Paris from November 30.\n\nMr Woolcott's appointment to the IWC by the Turnbull Government is understood to have been agreed under former prime minister Tony Abbott.\n\nHe succeeds a senior Environment Department bureaucrat, Donna Petrachenko​, who won praise for her work reforming the finances of the IWC and anchored the successful Australian case against Japan's whaling program at the International Court of Justice.\n\nSince losing that case, Japan has announced a new \"scientific\" whaling plan, NEWREP-A, harpooning the first 330 whales in the upcoming Antarctic summer, and killing nearly 4000 minke whales over 12 years.\n\nAn IWC expert panel assembled to judge NEWREP-A said earlier this year that Tokyo had failed to demonstrate the need for killing whales to achieve the plan's objectives. In June, Japan also fell short of support from the full IWC scientific committee.\n\nAfter that setback, Japan's IWC Commissioner, Joji Morishita​, told reporters it would strive to finalise NEWREP-A, but indicated a final decision to sail south was yet to be made.\n\n\"There are some recommendations we think we have to complete,\" Mr Morishita​ said. \"I don't think it's appropriate to say whether we will start such research activity from this [northern] winter or not.\"\n\nMr Woolcott​ was not available for comment on Friday, but a spokeswoman for Environment Minister Greg Hunt said he would bring a wealth of international expertise to the role of Commissioner.\n\n\"Mr Woolcott​ will lead Australia's efforts to bring a permanent end to commercial whaling, and to reform the Commission into a modern, multilateral organisation capable of addressing the full suite of conservation needs, based on world's best practice and modern management principles,\" the spokeswoman said.\n\nThe International Fund for Animal Welfare's whales campaigner, Matt Collis, said that despite the weight of Mr Woolcott's​ other duties, Australians wanted urgent action against Japanese whalers.\n\n\"The most important thing is that Mr Woolcott​ urgently use his diplomatic clout to stop Japan from going whaling,\" Mr Collis said.\n\n\"Australians expect him to be an outspoken critic.\" The story first appeared on The Sydney Morning Herald.", "source": "Coly Point Observer"}