{"published": "2015-09-30T06:28:00Z", "media-type": "News", "title": "Antarctica polar plunge: Taking a swim at Deception Island", "id": "ecf64adf-718a-43b1-a871-9001aaa3e54a", "content": "\"Have you done this before?\" I ask one of our guides. \"Have you done this before?\" I ask one of our guides. \"Yes, I've done it,\" he responds.\n\n\"Are you going to do it again today?\"\n\n\"No, I'll never do it again!\"\n\nHmm. It seemed like a fun idea when first suggested. Taking a dip in the near-freezing waters of Deception Island during an expedition cruise of the Antarctic is something of a rite of passage for adventurous travellers. But, after days of brilliant - if not warm - sunshine and still air, this morning on the black sand beach of Whalers Bay, we're faced with overcast skies and a biting wind. It had to be today that the weather turned ugly.\n\nTo top things off, I've forgotten to bring my bathers with me. On a trip to one of the harshest environments on the planet, it didn't really occur to me that I might want to go for a swim. Nevertheless, I've mentally committed myself to doing it and I can't back out now. Even if it means stripping off to my underwear.\n\nOur crew from One Ocean cruises offer some advice - explore the island at a brisk pace while under the full gamut of layers. The exercise in heavy clothes will help raise our body temperatures before we take our dip.\n\nSo I take the advice and wander around this huge, bleak beach. Whalers Bay, as the name suggests, is the home of a former whaling station and later a British scientific base. It is also home to an active volcano that, after erupting in the 1960s, saw the location abandoned. Now it is an eerie location, with run-down, partially collapsed buildings dotted across the landscape, home only to sea lions and the occasional penguin.\n\nOf course, these creatures are much more adapted to the environment than we are. The sea lions play around in the shallow waters of the edge of the bay, paying little attention to the visiting tourists. They look like they're having a great time in that water, I think to myself, so maybe it won't be so bad.\n\nAfter an hour or so exploring the island, the moment arrives - those of us who are going to swim are told it's time to face the music. We're taking our plunge at the end of the visit so that we can immediately board zodiacs to be taken back to our ship, Russian science vessel the Akademik Ioffe, and hit the warm showers (or, alternatively, the on-board hot tub or dry sauna).\n\nThe wind has picked up and, while not exactly howling, has raised the chill factor considerably. But there's nothing to be done. Along with plenty of other fellow lunatics from on board, I start stripping off my many layers.\n\nThis takes rather a long time, since I'm wearing seven. Soon enough, I'm down to my thermal underwear. I reluctantly remove these items and finally my socks, which touch the cold sand with a shudder. Then I run for the water.\n\nThey call it \"polar plunge\" and indeed a plunge is all it is. The water is so cold you can't afford to spend more than a few seconds in it. There's no slowly wading out and letting your body adjust here. Speed is the key.\n\nMy legs hit the water but I press forward without taking the time to register how cold the water is. I'm committed. I press on until the depth is over my knees and then dive in head-first, plunging under the surface.\n\nIt's cold, to be sure, but the adrenalin coursing through my body prevents me from truly experiencing the shock. I push myself back above the surface, get to my feet … and start running back to the shore, where the crew await with towels.\n\nI grab a towel and start drying off. At this point something strange happens with my body - rather than feeling cold and shivering, I instead feel fairly comfortable. In fact, my skin suddenly feels very hot. I slowly but surely put my many layers back on. It turns out my lack of bathers has a benefit - the, ahem, limited surface area of my underpants means I'm not stuck with too much wet clothing on under my warm clothes.\n\nPerhaps from the adrenalin rush, the experience already feels rather like a dream. It was over so fast that it's hard to recall how I felt when I hit the water.\n\nSoon after, I'm back on the ship, under a hot shower and washing piles of black, volcanic sand out of my socks and underwear. I've crossed this particular experience off my bucket list, but unlike some of my guides, I think I'd be up for giving it another go. After all, the world has two polar regions. Trip notes\n\nHow to get there\n\nLAN flies from Sydney to Santiago via Auckland with connections to Ushuaia, Argentina where the cruise departs from. lan.com.\n\nCruising there\n\nExpedition cruises aboard the Akademik Ioffe and other Antarctica trips can be booked through the Antarctica Travel Centre. Prices vary depending on length of trip and dates. The 11-day Antarctica Peninsula Adventure with One Ocean, including meals, guides and expeditions starts from $10,170 a person triple-share cabin. A private twin-share cabin stars from $14,500 a person.\n\nThis year's cruising season begins on October 19 with a 19-day cruise taking in the Falkland Islands, South Georgia and Antarctica\n\nSee antarcticatravelcentre.com.au.\n\nThe writer travelled as a guest of the Antarctica Travel Centre and LAN. The story first appeared on The Sydney Morning Herald.", "source": "Avon Valley Advocate"}