{"published": "2015-09-16T07:33:35Z", "media-type": "News", "title": "US claims it is the best partner for the ‘Make in India’ mission", "id": "be6c3689-83e4-4d1b-b559-c544e48abbb3", "content": "The United States is the best partner for Prime Minister Narendra Modi‘s “Make in India” campaign as the two nations seek to reinforce their strategic interests through commerce, a senior US government official said Tuesday. Under Secretary of Commerce Stefan Selig said that because the US produces “the best manufacturing exports” India will have “no better partner” in its bid to make the country “an elite manufacturing hub on the global… \r \nThe United States is the best partner for Prime Minister Narendra Modi‘s “Make in India” campaign as the two nations seek to reinforce their strategic interests through commerce, a senior US government official said Tuesday. \n\nUnder Secretary of Commerce Stefan Selig said that because the US produces “the best manufacturing exports” India will have “no better partner” in its bid to make the country “an elite manufacturing hub on the global stage.” Briefing reporters on the US-India Strategic and Commercial Dialogue (S&CD) to be held in Washington next week, he said the meeting “will examine how achieving our commercial goals can advance our mutually reinforcing strategic interests, including those under President Obama’s re balanced Asia and Prime Minister Modi’s Act East policy. \n\n” \n\nVice President Joe Biden, Secretary of State John Kerry, External Affairs Minister Sushma Swaraj, will address the US-India Business Council’s (USIBC) 40th anniversary celebrations ahead of the dialogue next Monday in Washington. US Secretary Commerce Secretary Penny Pritzker, Minister of State for Commerce and Industry Nirmala Sitharaman, Minister of State for Power, Coal and New and Renewable Energy Piyush Goyal, along with business leaders from both countries, will be among the participants in the dialogue. \n\nALSO READ: UAE keen to invest in India’s Digital India, Make in India and Smart City initiatives \n\nSelig, whose portfolio is international trade, said the most important goal in India-US long-term collaboration is increasing five fold the annual bilateral trade from the current $100 billion to $500 billion. Stressing the role of the private sector, Selig said, “We are intensely committed to engaging directly with business leaders through our expanded US-India CEO Forum.” The forum which will precede the dialogue “will feed into the government-to-government discussions,” he added. It “will also ensure that business leaders play a central role in crafting policies. \n\n” \n\nThe overall focus in this year’s dialogue, Selig said, will concentrate on four areas: \n\n* Building tomorrow’s smart cities in India and the related infrastructure. \n\n* Participating in strengthening India’s business climate to the benefit of both Indian and American businesses. \n\n* Harmonizing prod…", "source": "MyInforms"}