{"published": "2015-09-01T21:20:45Z", "media-type": "News", "title": "TCEB becomes global partner for ibtm events", "id": "9edefb84-5f5a-4776-b664-99ec1f543e7c", "content": "ibtm events, the world’s leading showcase for the meetings and events industry, has confirmed that Thailand Convention & Exhibition Bureau (TCEB) is to become the official ibtm events Global Partner across its portfolio of events on five continents. \n \nAs a result of the partnership, Thailand Convention & Exhibition Bureau will benefit from global visibility, access to business and a powerful network of connections to support their positioning as a leading destination for meetings, conventions, incentives and events. \n \nThe partnership will be promoted all year round at ibtm events starting with ibtm world 2015, and then AIME 2016, ibtm arabia 2016, ibtm america 2016, ibtm china 2016 and ICOMEX. \n \nNopparat Maythaveekulchai, TCEB’s president, commented, “As the government’s official flagship body for the MICE sector in Thailand, we are proud to be forging this relationship with the world’s leading showcase for the business events industry. The partnership will also support Thailand’s position as a leading MICE destination in Asia, to international MICE professionals across the globe. \n \n“This partnership forms part of TCEB’s strategy to enhance our reach and connect with global MICE players. This exciting collaboration with ibtm events’ five shows across five continents, complemented by an extensive global database of MICE professional, is a partnership that we are very much looking forward to nurturing.” \n \nSallie Coventry, Portfolio Director, ibtm events commented, “There is a great number of brand synergies between ourselves and Thailand Convention & Exhibition Bureau, making them the perfect choice of portfolio partner. We are very much looking forward to working with a destination that shares our values and passion around promoting connections in the meetings, incentive, conference and events industries.” \n \nTogether ibtm events, the newly branded ibtm portfolio connects 5,000 suppliers from over 100 countries, with 19,000 meetings and events planners, facilitating over 110,000 appointments between exhibitors and Hosted Buyers. \n \nFor further information, please visit www.ibtmevents.com \n \nThe post appeared first on Exhibit City News .", "source": "Exhibit City News"}