{"published": "2015-09-01T11:05:03Z", "media-type": "News", "title": "Snipp Interactive Inc. Reports 639% Q2 Revenue Growth Year-Over-Year and Positive EBITDA", "id": "5cb4c073-7d7b-4d6e-86a4-90ebf2e4c869", "content": "BETHESDA, MARYLAND -- (Marketwired) -- 09/01/15 -- Snipp Interactive Inc. (\"Snipp\" or the \"Company\"), an international provider of promotions marketing, rebates and loyalty solutions listed on the TSX Venture Exchange (TSX VENTURE: SPN), is pleased to announce its second quarter fiscal 2015 results for the quarter ending June 30, 2015. All results are reported under International Financial Reporting Standards (\"IFRS\") and in both Canadian dollars and US dollars. Snipp reports Q2 2015 revenue of CAN$3.3 million (US$2.7 million), adjusted EBITDA of CAN$0.6 million (US$0.5 million) and net income of CAN$1.6 million (US$1.3 million). A copy of the complete unaudited financial statements and management's discussion and analysis are available on SEDAR (www.sedar.com). \n\nQ2 2015 Financial Summary \n\n(Refer to Non-GAAP Measures, EBITDA/Adjusted EBITDA and Gross Margin discussion below) \n\n-- Revenue of CAN$3.3 million, a 639% increase over the same quarter last year and the 14th consecutive quarter where revenue has grown when compared to the same period of the previous year. -- Revenue growth was driven by a significant increase in the total number of campaigns executed as well as a growth in the average campaign size and the revenues from new product lines such as loyalty and rewards. -- Gross Margin of 89.1%, a 14.5% increase over the same quarter last year. The Company defines Gross Margin as revenue less campaign infrastructure costs. -- Positive EBITDA of CAN$0.4 million (US$0.3 million). -- EBITDA profitability was driven by high margin promotions and the realization of earlier investments in campaign infrastructure costs. -- Positive adjusted EBITDA of CAN$0.6 million (US$0.5 million) which excludes one-time charges from the acquisition of HIP Digital Media Inc. (\"Hip Digital\"), a CAN$1.8 million (US$1.5 million) increase over the Q1 2015. -- Net income of CAN$1.6 million (US$1.3 million) due to non-cash fair value accounting revaluations. -- CAN$11.7 million (US$9.4 million) of cash and equivalents, with no outstanding bank debt.", "source": "Ulitzer"}