{"published": "2015-09-08T10:07:31Z", "media-type": "News", "title": "Iran Parliament Chief: Nuclear Deal Is 'Acceptable,' U.S. Interpretation Is Not", "id": "e9c9d2d9-a5f0-45fa-89ca-bf8470bf87c6", "content": "The leader of Iran's legislature has definite views on his country's nuclear deal with world powers. \n\nAli Larijani says the agreement is good enough. He adds that United States' reading of that deal, particularly when it comes to sanctions, is not good at all. And he's hoping that the agreement brings change in his country — though not as much as many Iranians would want. \n\nThe lawmaker expressed those views to NPR during a visit to New York. While he is not one of the clerics who hold ultimate power in Iran, he is a consummate insider. He was a top national security official before his election to parliament. His brother leads the judiciary, and the family has important business interests. He is considered a true conservative in his country, and his views open a window into Iran's complex governing elite. \n\nLarijani supported the negotiations that led to the agreement, which places limits on Iran's nuclear program in exchange for the lifting of global economic sanctions. He called the final terms \"acceptable.\" \n\n\"I believe that we can use this deal as a step we can take to move forward. And at the same time, it is not flawless,\" he said. \n\nIndeed, Larijani expects lawmakers in Iran's sometimes contentious assembly to complain. \n\nCritics In The Iranian Legislature  \n\nThe assembly speaker met with NPR at a New York hotel. He was dressed in a suit and no tie, in the style of the Islamic Republic. He's in his 50s, old enough to recall all the years from the 1979 Islamic revolution to this historic moment. \n\nHe has held positions in the revolutionary government since its early years. He now leads a legislature that, like Larijani himself, is considered conservative. He says many lawmakers are skeptical of the deal. \n\nHe pointed to provisions he considered unequal. The U.S., for example, can make sanctions snap back into place if it thinks Iran breaks the deal. \n\n\"But that is not true for us. We cannot return to the situation that we were in the past,\" he said. \n\nLarijani sees many of Iran's concessions — like removing the core of a reactor – as permanent. \n\nHis concerns are the opposite of those voiced by American critics. U.S. skeptics worry Iran is temporarily setting back its nuclear program to get out of sanctions forever; Iranians argue they're setting back their program for sanctions relief that may be temporary. \n\nLarijani's anxiety was evident in our conversation. \"If something ... happens in the U.S. Congress, or if there are new types of sanctions on us, then they should not expect us to go — to implement. Or if the Americans don't stay true to their obligations on their part, they shouldn't expect us to do it.\" \n\nHis remark pointed to one of the sticky points in this agreement. \n\nIt's designed to lift nuclear sanctions against Iran. \n\nThe U.S. says it offers Iran no assurances about sanctions imposed for non-nuclear issues. \n\nU.S. Says Sanctions Remain An Option  \n\nThe United States has insisted it will keep up the pressure against Iran on other issues. \n\nIn an NPR interview in August, President Obama underlined this point:\"We'll still have our sanctions in place with respect to non-nuclear activities like sponsorship of terrorism or violation of human rights.\" \n\nThat matches what Secretary of State John Kerry told NPR shortly after negotiating the deal. He said the U.S. was, \"absolutely\" free to punish Iran for acts like supporting the militant group Hezbollah. \n\nSo how would Iran respond if the U.S. imposes new sanctions, or reimposes old sanctions, for issues other than nuclear issues? \n\nLarijani suggested that could lead to trouble. \n\n\"There are different points mentioned in the text that need to be read carefully,\" he said. \"The text said that no country will go after new sanctions.\" \n\nIf Iran views the other side as violating the deal, \"we will respond accordingly.\" \n\nThe two sides may agree on what the nuclear deal says on paper. But arguments loom over what it really means in practice. \n\n\"I think there are some people who want to wreck the deal, so they are trying to find new ways to make holes or to perforate the deal, but we are not going to do this,\" Larijani said. But, he added, \"if anybody wrecks the deal in any way, then we will know how to respond to it.\" \n\nWill Reforms Follow?  \n\nLarijani's answer to one question was particularly revealing, both in what he said and what he did not say. \n\nThis was the question: Is there a specific economic, political, or social reform that is likely to become reality now? After all, Iran's President Hassan Rouhani has indicated that he would like reforms inside Iran to follow a nuclear deal. \n\n\"I think he meant, mostly he meant, economic reforms,\" Larijani answered. \"So, I see very much eye-to-eye with him in this matter,\" Larijani said. \"I think we can make it possible for the economy to thrive.\" \n\nHe dismissed questions about political or social reforms. He said nothing of easing Iran's constraints on personal freedom, or the media, or the Internet. He argued instead that Iranian society is more free than that of its neighbors. \n\nAsked if Iran might now free political candidates who've been under house arrest since a disputed election in 2009, Larijani said only that it was up to the justice system. \n\nAsked if Iran might free several imprisoned Americans, such as the journalist Jason Rezaian , Larijani suggested that the United States should trade Iranian prisoners for them. \n\nA Way To Move Forward  \n\nLarijani cautioned that the nuclear deal alone might not transform Iran's relations with the West. \"Iran and the U.S. have this past history that is very dark,\" he said. \n\nLarijani recited the Iranian view of that history. He didn't mention moments on Americans' minds, like the 1979 hostage crisis, or Iran's calls to eliminate Israel, or Iran's past secret nuclear activities. He talked instead of 1953, when the U.S. supported a coup in Iran. In the 1980's the U.S. supported Iran's mortal enemy, Saddam Hussein of Iraq. \n\nWorking through this history, the soft-spoken Iranian gradually became more heated. \n\n\"I'm not saying that we should live in the past, but we should not try to find dramatic solutions,\" he said, \"and if we see that there is a change in the U.S. attitude toward us, then we can do something with each other.\" \n\nAs translated by his official interpreter, Larijani went on to say: \n\n\"You know, these days we are supposed to paving the ground for the ratification and the implementation of the deal. We have to prepare the public opinion for this, but everyday it seems that your secretary of defense [Ash Carter] wakes up in the morning, opens the window, he shouts something at Iran and says that the military option is still on the table. \n\nSo what does this mean? If you really want to do — to have war, then just go with it. Why are you just talking about it all the time? Why is it that you just talk about it? I mean, does — does it solve anything? Is it of any use?\" \n\nA Farsi speaker employed by NPR heard Larijani's wording slightly differently—he did not literally say \"go with it\"—but added that the interpreter properly captured Larijani's meaning and tone. \n\nA provocative question had led to Larijani's outburst: would he like to invite U.S. lawmakers, many of whom disapprove of the nuclear deal, to visit Iran? \n\nLarijani concluded his long answer by saying, in effect, that this is not possible yet. \n\nHe described the nuclear agreement as a test for the United States — just as the United States has posed the agreement as a test for Iran.", "source": "WAMC.org"}