{"published": "2015-09-02T08:20:26Z", "media-type": "News", "title": "Why should kids have all the fun? Disco returns for people who remember the 80s hits the first time round", "id": "e49ec863-83d3-4f1b-9930-3deae04becde", "content": "A south east London party night shows that clubbing isn’t just for the youngsters. \n \nHaven’t Stopped Dancing Yet is an unashamedly retro pop-up night of 70s and 80s tunes for people that remember the songs the first time around and still want to party. \n \nIt’s at The Trafalgar Tavern on Saturday, September 26, and there’s a spooktacular version planned for St Swithun’s in Hither Green on October 31. \n \nDJ’s Lord Anthony and the hula hooping Da’Lynne host proceedings which include choreographer-led dance routines and free retro sweets and ice pops. \n \nThe nights were founded by Lewisham-based media tutor and mum-of-two Nikki Spencer, in 2010, who wanted to go out dancing without feeling like she was gate-crashing one of her teenage daughters’ parties. \n \n [embedded content]  \n \nShe said: “I noticed there were now events for parents like Baby Loves Disco and for secondary school kids like Underage but there was nothing for people like me in their 40s so I decided to start my own night where we could dance our socks off. \n \n“I wasn't sure what response I would get but people absolutely loved the idea. \n \n“More than 250 people came to our launch night at The Trafalgar Tavern in Greenwich and since then we have put on dozens of nights at different venues across south east London and we are taking HSDY further afield with nights in Birmingham and Islington.” \n \nThe nights won the Best of Lewisham at this year’s Lewisham Business Awards earlier this year and Nikki was recently invited onto Radio 4’s PM to discuss the venture. \n \nA Big Xmas Disco Ball at Blackheath Halls last year attracted more than 850 people and the event is expected to return there on December 12. \n   \n Share article  \n   \n Tickets for Haven’t Stopped Dancing Yet at The Trafalgar Tavern on September 26 cost £15 in advance only. Go to haventstoppeddancingyet.co.uk or call 07967 163247.", "source": "This is Local London"}