{"published": "2015-09-20T07:34:31Z", "media-type": "News", "title": "Jason Day on verge of BMW victory and world number one ranking", "id": "f5755b52-8eb0-4768-903d-45232b5820ca", "content": "US to Stop Screening Liberian Travelers for Ebola  \nThe Africa News.Net - Friday 18th September, 2015 \n \nTravelers from Liberia will no longer be screened automatically for Ebola at U.S. airports.\nU.S. officials said Friday that the screening would end Monday for passengers from Liberia.  But the  ... \n   Tipping Points on the Road to Europes Refugee Crisis  \nThe Africa News.Net - Friday 18th September, 2015 \n \nEurope is only now being forced to take seriously the refugee crisis that's been roiling the Mideast and North Africa since civil conflict gathered pace with the Arab Spring fall of despots and the  ... \n   Al-Shabab Overruns Somali Military Base  \nThe Africa News.Net - Friday 18th September, 2015 \n \nAl-Shabab militants briefly captured an army base in southern Somalia Friday  -  the latest of several high-profile attacks the group has carried out this month.\nAli Nur, deputy governor of the  ... \n   Ethiopia Successful in Preventing Al-Shababs Attacks  \nThe Africa News.Net - Friday 18th September, 2015 \n \nADDIS ABABA -   Over the past five years, Kenya, Uganda, Djibouti and the self-declared republic of Somaliland have all been attacked by Somalia-based Al-Shabab militants.\nEthiopia, which invaded  ... \n   In Paris Two Faces of the Migrant Crisis  \nThe Africa News.Net - Friday 18th September, 2015 \n \nAs France begins welcoming its first batch of Iraqis and Syrians for resettlement from elsewhere in Europe, questions are mounting over the status and treatment of longer-term migrants.\nFrench  ... \n   Monarchys red lines gag Moroccos independent media  \nThe Africa News.Net - Friday 18th September, 2015 \n \nThis statement was originally published on rsf.org on 17 September 2015. \r\n \r\nReporters Without Borders is very worried about the current state of freedom of information in the Kingdom of Morocco,  ... \n   Coach Meyer apologises to SA nation after greatest ever Rugby WC shock  \nThe Africa News.Net - Sunday 20th September, 2015 \n \nSouth Africa coach Heyneke Meyer has apologised to the nation after his side suffered greatest ever Rugby World Cup defeat against Japan in their opening Pool B match on Saturday.  \n   \nMeyer, whose  ... \n   New way proposed to help map 3D cosmos  \nThe Africa News.Net - Sunday 20th September, 2015 \n \nA team of researchers have proposed a new way to chart the cosmos in 3-D.\n   \nIf only calculating the distance between Earth and far-off galaxies was as easy as pulling out the old measuring tape.  ... \n   South Sudan Death toll rises to 193 in fuel tanker blast  \nZee News - Saturday 19th September, 2015 \n \nMore patients have succumbed to their injuries, said Patrick Raphael Zamoi, the governor of Western Equatoria state where the explosion happened Wednesday. Hundreds of people had gathered  ... \n   When Poland eyed Madagascar as a future homeland for Jews  \nthestar.com - Saturday 19th September, 2015 \n \nThe offices of Nazi newspaper Der Sturmer in Gdansk, Poland, circa 1935. An anti-Semitic poster in the window reads \"Die Juden sind unser Ungluck!\" (\"The Jews are our  ... \n   World African leaders pursue mediation talks in Burkina after coup  \nStandard Digital - Saturday 19th September, 2015 \n \nTwo African leaders resumed mediation talks in the capital of Burkina Faso on Saturday, three days after a coup that reignited violence in the troubled Sahel  ... \n   Some 50000 People Get Sick with Cancer Every Year in South Africa  \nPrensa Latina - Saturday 19th September, 2015 \n \nPretoria, Sep 19 (Prensa Latina) A campaign for cancer awareness is taking place in South Africa where it is estimated today that about 50,000 people contract the disease each year. A report by the  ... \n   OBITUARY Rory O’Connor sat as judge under African trees and Asian skyscrapers  \nNews Letter - Saturday 19th September, 2015 \n \nThe globetrotting judicial figure was accorded a CBE in recognition of his work, and died last month, aged 89.He was born in Holywood, Co Down, on November 26, 1925, to Mary (nee Savage) and James  ... \n   Over 2200 migrants rescued off Libya Italy coastguard  \nMIA - Saturday 19th September, 2015 \n \nEight rescue operations Saturday picked up more than 2,200 people off the Libyan coast, according to the Italian coastguard, which was coordinating the response for 10 other boats in distress in the  ... \n   Weapons on ship headed to Libya manufactured in Turkey  \nmaltatoday - Saturday 19th September, 2015 \n \nTwo Indians and one Egyptian have been arrested and indicted on charges of illegal smuggling and remain in pre-trial detention pending the ongoing investigation. Their names have not been released  ... \n   Airtel MD Okyenhene Tee Off Ghana Open  \nDaily Guide - Saturday 19th September, 2015 \n \nManaging Director of Airtel Ghana, Lucy Quist and the Okyenhene, Osagyefo Amoatia Ofori Panin II will today tee off the 83rd Airtel Ghana Golf Open at the Achimota Golf Course. Airtel  ... \n   Ghana Cooks Reality Show Set To Fly  \nDaily Guide - Saturday 19th September, 2015 \n \nBeginning next month, October, 50 contestants will vie for honours in a special cooking reality show put together by Promasidor Ghana Limited, producers of Onga seasoning.  ... \n   Against the odds Ethiopias space program shoots for the stars  \nChina Daily - Saturday 19th September, 2015 \n \nHigh above the crowded streets of Addis Ababa, among fields where farmers lead oxen dragging wooden ploughs, sits Ethiopia's space program. Perched on the top of the  ... \n   The worlds longest standing intelligence chief was just fired heres four things about the God of Algeria  \nalbawaba - Saturday 19th September, 2015 \n \n3. Toufik's early years as chief were characterized by civil war between the Algerian government and Islamic forces in the country. He led a faction of the military that sought to  ... \n   Danish man arrested in South Africa for storing female genitalia  \nTimes Of India - Saturday 19th September, 2015 \n \nJOHANNESBURG: A Danish man was arrested after pieces of female genitalia were found in his house, South African police said on Saturday. Police arrested the man at his home on Thursday, where they  ...", "source": "TheAfricaNews.Net"}