{"published": "2015-09-14T10:13:37Z", "media-type": "News", "title": "'Babes in the Wood' child killer Ronald Jebson got 'very good' end-of-life care", "id": "cfca62f8-0258-48e4-ab2d-1501f19384d1", "content": "The sadistic Babes in the Wood child murderer received \"compassionate\" care before he died from kidney failure while serving life behind bars, an inquest has heard. \n \nPaedophile Ronald Jebson, also known as Harper, died in April in hospital aged 76 after a gradual decline in his health during which he signed a \"do not rescuscitate\" order. \n \nThe authorities were unable to trace any of Jebson's next of kin and the brief inquest hearing in Crook, County Durham, was only attended by a prison official, two journalists, the coroner's officer and the coroner. \n \nIn March 1970 Jebson snatched Susan Blatchford, 11, and Gary Hanlon, 12, from Enfield, North London, and took them to Epping Forest in Essex. \n \nThey were strangled after he sexually assaulted them, and Jebson hid their bodies in the woods. \n \nHe was arrested days later, not for the double murder, but for abusing an 11-year-old boy and was jailed for five years. \n \nOn his release in 1973 he moved in with a friend Robert Papper and his eight-year-old daughter Rosemary. Jebson strangled her and was jailed for life. \n \nIt was 30 years after the Epping Forest murders that Jebson was sentenced to a futher two life sentences after he confessed while behind bars. \n \nHe was held at the maximum security HMP Frankland in Durham since 2002 and in the following years kidney atrophy, or shrinkage, was diagnosed. \n \nChronic kidney disease followed, for which he received blood transfusions, and in January last year his condition deteriorated, the inquest was told. \n \nJebson signed an order saying he should not be rescucitated if his breathing or heart stopped and his condition was treated with medication and regular tests. \n \nHe was taken to hospital, and was ill enough not to be restrained, on April 4. He was found to have a deep vein thrombosis in his leg, a collapsed lung and kidney failure. He died 13 days later. \n   Promoted stories   \nThe Prisons and Probation Ombudsman (PPO) investigated following his death and a summary of their report was read to the coroner Andrew Tweddle. \n \nPc Jacqueline Sirrell said: \"The PPO are satisfied he received a high standard of care. \n \n\"Nurses were caring and compassionate. \n \n\"His end of life care was very good.\" \n \nShe said the care he was given was equivalent to that provided to patients in the community. \n   \n Share article  \n   \nMr Tweddle found Jebson died from natural causes.", "source": "Dorset Echo"}