{"published": "2015-09-21T12:52:40Z", "media-type": "News", "title": "Text Club Announces International Launch", "id": "8a994d81-9619-4186-8c5b-17d84329db23", "content": "[September 21, 2015] \r \r \r\n    \r\n\r \r \nNORFOLK, Va. , Sept. 21, 2015 /PRNewswire/ -- Text Club is exploding onto the scene as the latest social media network to announce its launch, and it aims to be a fast frontrunning social media platform. Text Club is designed for those who crave a fresh, fun, exciting platform and offers fun daily challenges with no-strings-attached prizes. \n\r\n\r \n\"We are working with some major industry leaders to rapidly rollout Text Club to people around the world. It's going to change the face of social media forever. People will finally have a reason to look forward to picking up their phones. If you're having a bad day or you're stressed out or you're bored at work, you'll feel better by playing along in our awesome global challenge. People everywhere have a lot to look forward to in the coming months. They'll be able to answer questions and reap rewards that won't just make their day - these prizes will make their week, month, and year. In a time when people are feeling down about the economy, we can't think of a better way to lift spirits and just make the day-to-day exciting again,\" said the Text Club creators. \n\r\n\r \nText Club is the world's first platform to reward users in such an exciting, immersive way, and there are no strings attached. Users will never be overrun with popup, banner, video, or audio ads. They won't be tricked or forced into buying or signing up for something that they don't want. They'll enjoy a streamlined, straightfrward, and honest interface and experience. Next, the giveaway prizes are legitimate, top-dollar items. These prizes include ultra HD 4K TVs, leading edge smartphones with the best technology of today, and pre-paid utility and phone bills for up to a year. Anyone who joins and participates in Text Club is eligible to win these prizes and much, much more every single day of the year. \n\r \n\r\n\r\n\r\n\r \nEach day, users around the world receive a push notification known as a Text Club alert. The Text Club alert tells the players within what timeframe a new set of trivia questions will be available. Users have to log-in throughout that timeframe to see if the day's questions have been posted. When the questions appear, users must answer correctly and quickly. The first 3 to 5 people who answer all of the questions correctly receive serious prizes. In addition, Text Club also chooses the 2-5 other winners who also win prizes! Everyone has fun and a fair chance, and Text Club offers random social media surprises to its members. There's no limit - there can be a 500 th , 1000 th , or even 33,000 th winner. \n\r\n\r \nPeople will soon see more of the quirky, fun Text Club platform at famed Union Square in New York , Mall of America, and other globally-renowned theaters. The company has announced a soft launch of the Text Club website, where people can now get an inside perspective of the platform. \n\r\n\r \nWith Text Club, people get to rejoice in a simple, genuine, fun, and global social media network that offers prizes like no other. More information can be found at www.TextClub.com . \n\r\n\r \nAbout Text Club \n\r\n\r \nText Club is fun new social media platform that offers exciting daily challenges and incredible giveaways. The company is proud to offer large monthly donations to nationwide charitable causes. \n\r\n\r \nContact \n\r\n\r \nOwners and Creators: Jay King & Josh Hatfield  \nEmail: Email    \nPhone: (888) 881-6445   \nAddress: 999 Waterside Drive, Suite 2533 \nNorfolk, Virginia 23510  \nWebsite: https://www.TextClub.com  \n\r\n\r \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/text-club-announces-international-launch-300145779.html \n\r\n\r \nSOURCE Text Club \n\r\n\r \n[ Back To Customer's Homepage ]", "source": "Customer Zone 360.com"}