{"published": "2015-09-22T17:27:57Z", "media-type": "News", "title": "$110K: Is This What Justice Looks Like in America?", "id": "1489fb6f-ff0c-4e85-9848-25150d7ec25f", "content": "Robbie Tolan (Courtesy of Houston Forward Times) \n \nby Jeffrey L. Boney \nSpecial to the NNPA from the Houston Forward Times \n \n“…The justice that we seek will not come from these courts, it will come from us.” – Marian Tolan \n \nThe fight for justice has come to a close for police brutality victim and former baseball star Robbie Tolan – at least in the courtroom. \n \nEarly Tuesday morning, attorneys for both Robbie and Bellaire police officer Jeffrey Cotton announced that a settlement had been reached between the two parties in the civil trial that was scheduled to begin that day. \n \nAccording to the settlement, the City of Bellaire will only pay $110,000 to settle the civil rights suit filed by Robbie Tolan. In addition to that, the settlement allows Robbie to discuss the details of his experience with impunity. \n \n“Let me be clear about this, this is a win ONLY in the sense that I will not allow anyone else to write the end of my story,” said Robbie. “I will define my legacy. I will tell my story. No one will tell it for me! God has given me peace! I thank God for my parents, my extended family and friends, my awesome attorneys who were ready for battle, and all of my supporters. We are relieved to put this behind us and move on!” \n \nThe journey towards this settlement has been full of many challenges and roadblocks along the way for Robbie and his family. \n \n“God understands the direction we’re having to go and He understands that this has been a long and lonely journey that’s lasted 7 years. I’m taking the end of my story out of the judge’s hands,” said Robbie. “My foundation, my book, and the lives of young men and women of color who have suffered injustices will be my focus. I’m ready to write the next chapter.” \n \nRobbie was shot on New Year’s Eve in his driveway in 2008 by Cotton, after he and Officer John Edwards mistakenly identified Robbie’s vehicle as having been stolen. Robbie’s vehicle was found to have not been stolen, nor was either man found to have been armed. More importantly, the license plate number that the officers entered into their computer was the wrong one, leading them to identify the wrong suspects. A grand jury indicted and acquitted Cotton, after only charging him with aggravated assault, which is what led the Tolan family to file the civil lawsuit, which eventually ended up in the U.S. Supreme Court because of the decisions by U.S. District Judge Melinda Harmon and the Fifth Circuit Court of Appeals to grant qualified immunity to the officers. The U.S. Supreme Court reinstated the civil lawsuit filed by Robbie, with a unanimous decision back in May 2014. \n \nIn its ruling, the Supreme Court said that the courts must review excessive force claims in “the light most favorable to the party asserting the injury” and determine whether the right in question was “clearly established at the time of the violation.” In addition to that, the Supreme Court justices declared that they reached the “inescapable conclusion” that the Fifth Circuit of Appeals made a gross error by giving more credence to the narrative presented by Cotton and his attorney’s and by not delving deeper to properly investigate contradictory evidence. \n \nOnce the case landed back in the hands of Judge Harmon, things appeared to get even more challenging for Robbie and his high-powered legal team. \n \nOn Sunday, Robbie and his attorneys called for Judge Harmon to recuse herself from the case because of “seeming bias and prejudice” based on comments she made during a pretrial hearing last Friday. Tolan’s legal team filed an emergency motion and affidavit, on his behalf, asking Judge Harmon to recuse herself from the case, citing in documents that the comments at the pretrial hearing “disclose that the judge can no longer be an impartial arbiter of this case.” The affidavit filed by Robbie also alleged that Judge Harmon’s comments would taint the federal jury pool and hamper his ability to receive a fair trial. In response to their request, Judge Harmon denied the recusal reconsideration motion on Monday. \n \nIn her order, Judge Harmon stated that she “has never expressed a personal bias or prejudice against Robert R. Tolan or in favor of Jeffrey Cotton.” She went on to say in her order that, based on case law: “When a judge makes a ruling or says or does something in the course of pretrial or trial proceedings, impartiality cannot reasonably be questioned simply because one side wins and the other loses.” \n \nIn what was a stunning blow to Robbie and his attorneys – that essentially forced them to the settlement table – Judge Harmon denied every single expert witness submitted by the Tolan legal team who were being called to testify on behalf of Tolan, while allowing the City of Bellaire to allow all of the witnesses they submitted to the court to testify. Judge Harmon then released an 18-page order preventing Tolan’s legal team from presenting former Major League Baseball players, sports agents, excessive force specialists and others from testifying as expert witnesses. \n \nSome of the expert witnesses that the Tolan legal team submitted to testify included former MLB professionals such as Ken Griffey Jr. and Ken Griffey Sr. \n \nTolan’s attorneys and the Tolan family began to have settlement discussions, which led to a settlement eventually being reached. \n \nOfficer Cotton was made to testify, under oath in court, that he had no assets to settle the lawsuit, which put the burden on the City of Bellaire to pay the settlement amount to Tolan. According to the Tolan legal team, the attorneys presented their accord to Judge Harmon on Tuesday morning, the day the trial was to begin, where they demanded that the City of Bellaire draw up the settlement documents in court. Furthermore, Tolan’s attorneys demanded the written agreement be fleshed out in court and fully agreed upon before it was signed and this ordeal was laid to rest. For the Tolan family, it is closure concerning this case, but not concerning the continuous injustice in this country – an injustice they will continue to fight. \n \n“We did not get justice here,” said Marian Tolan, Robbie’s mother. “The first time the judge dismissed our case, we had to pay Officer Cotton’s court fees. That was another injustice. I’ve had to watch his dreams and part of his spirit die. We gave up so much as a family for a chance at justice, a chance at peace.” \n \nMarian said that she believes God kept her son on this earth for a reason and insists that they are going to continue to work hard for changes in the justice system. \n \n“We’re not giving up,” said Marian. “There are some things that need to be changed and we’re going to work toward that change. The justice that we seek will not come from these courts, it will come from us.” \n \nAttorney Benjamin Crump said that he and Robbie will begin to aggressively push for police body cameras on a national scale. They are both scheduled to appear on several panels at this week’s Annual Legislative Conference (ALC), hosted by the Congressional Black Caucus in Washington D.C., where they will address police brutality and the need for body cameras. \n \n“As an attorney, the courtroom is our arena. Robbie Tolan is not an attorney, so he is going to take his case to an arena most favorable to him, that arena is the court of public opinion,” said Crump. “God left Robbie Tolan here for a reason. Robbie is here to tell his own story. This family can now focus on the Robbie Tolan foundation and Robbie’s book.” \n \nRobbie still believes that his case is going to help a lot of people because the decision by the U.S. Supreme Court now states that a judge can no longer look at one side’s evidence and not the others – which is what happened in Robbie’s case.", "source": "Black Press USA"}