{"published": "2015-09-30T05:44:20Z", "media-type": "News", "title": "High level of arsenic found in US red wines", "id": "e8eddcab-0562-42ec-8688-b1dd645803e2", "content": "Published Date : Wednesday, September 30th, 2015  Time posted: 11:14 am      By - \n \nWashington, Sep 30 (IANS) If you love to drink red wine, take that sip with a little caution as researchers have found that many red wines in the US contain arsenic levels that exceed what is allowed in drinking water. \n \nArsenic is a naturally occurring element that is toxic to humans in some forms, and can cause skin, lung and bladder cancers, and other diseases. \n \nAs rain, rivers or wind erode rocks that contain arsenic, it leaches into water and soil. From there, the toxic metalloid can work its way into the food chain. \n \nHowever, in a study, the researchers concluded that the likely health risks from arsenic in red wines depend on how many other foods and beverages known to be high in arsenic, such as apple juice, rice, or cereal bars, an individual person eats. \n \n“Unless you are a heavy drinker consuming wine with really high concentrations of arsenic, of which there are only a few, there is little health threat if that is the only source of arsenic in your diet,” said researchers Denise Wilson, professor at University of Washington in Seattle. \n \n“But consumers need to look at their diets as a whole. If you are eating a lot of contaminated rice, organic brown rice syrup, seafood, wine, apple juice — all those heavy contributors to arsenic poisoning — you should be concerned, especially pregnant women, kids and the elderly,” Wilson noted. \n \nThe study that tested 65 wines from America’s top four wine-producing US states — California, Washington, New York and Oregon — found all but one have arsenic levels that exceed what is allowed in drinking water. \n \nThe US Environmental Protection Agency allows drinking water to contain no more than 10 parts per billion of arsenic. \n \nThe wine samples ranged from 10 to 76 parts per billion, with an average of 24 parts per billion. \n \nThe study looked at red wines because they are made with the skin of grapes where arsenic that is absorbed from soil tends to concentrate. \n \nThe findings appeared in the Journal of Environmental Health. \n Related Posts", "source": "Mangalorean"}