{"published": "2015-09-18T04:49:44Z", "media-type": "News", "title": "Trump cites ‘double standard’ in comments about Fiorina’s appearance", "id": "7e657aa6-29c1-44d1-97b3-bbc77149c260", "content": "WASHINGTON (CNN) – Donald Trump said Thursday he is being held to a gender “double standard,” arguing that his comments about Carly Fiorina’s appearance were viewed more harshly than remarks the former Hewlett-Packard CEO has made about her competitors in the past. \n\n“It’s not only a double standard — it’s being politically correct,” Trump told Fox News’ Sean Hannity, saying he was “very nice” to his surging rival. \n\nBut he said Fiorina has criticized her political opponent’s looks in the past, citing her failed 2010 Senate campaign against Barbara Boxer in California. \n\n“She was very nasty. She was running against Barbara Boxer. She lost in a landslide, but during the run she was really horrible about Barbara Boxer’s looks,” Trump said. \n\nHe was apparently referring to a moment during the race when Fiorina was caught on a hot mic, saying Boxer’s hair was “so yesterday.” \n\n“She’s playing the game herself,” Trump added. \n\nTrump raised eyebrows last week when he seemed to ridicule Fiorina’s face in an interview with Rolling Stone. \n\n“Look at that face. Would anyone vote for that?” he was quoted as saying. \n\nTrump later argued he was referring to her “persona.” \n\nAt Wednesday’s CNN Republican debate, the two rivals faced off in one of the night’s most highly-anticipated moments. Fiorina calmly said that she believed “every woman” in America knew what Trump was referring to in his Rolling Stone comments, but Trump maintained he had not criticized her appearance. \n\n“I think she’s got a beautiful face, and I think she’s a beautiful woman,” Trump said. \n\nAppearing on CNN’s “New Day” on Thursday, Fiorina said sexism remains in American politics. \n\n“It’s still different for women,” she said. “It’s only a woman whose appearance would be talked about while running for president — never a man. And that’s what women understand.”", "source": "1490Wosh.com"}