{"published": "2015-09-09T18:58:00Z", "media-type": "News", "title": "Scorpions' Klaus Meine on 50 years of rock, international tour", "id": "dfbd94aa-883d-42f5-843f-fea863697175", "content": "If you go... WHO: The Scorpions with Queensryche \nWHEN: 7 p.m. Sunday \n\nWHERE: Bank of New Hampshire Pavilion, Gilford \n\nTICKETS: $24 to $67 \n\nINFO: banknhpavilion.com; 293-4700 \n\r\n\t\t\t\r\n\t\t\t\r\n\t\t\t\r\n \t\t\t\r\n\t\t\t\r \nKlaus Meine is one of the most instantly recognizable voices in rock music. \nAs lead singer for the German hard-rock band the Scorpions, Meine’s powerful tenor has guided the band through countless power-rock ballads — hit songs like “Rock You Like A Hurricane,” “Wind Of Change,” “Still Loving You” and “Big City Nights.” \n\nThis year, the Scorpions celebrate their 50th anniversary with a new album, “Return To Forever,” and a commemorative world tour, which includes a stop Sunday night at the Bank of New Hampshire Pavilion in Gilford along with Queensryche. \n\nMeine talked with NH Weekend recently about the group’s latest album, its longevity and whether they’ll retire anytime soon. \n\nHappy 50th anniversary to the band. How does it feel to reach such a milestone? \n\nYeah, I mean, to put a five in front of the 0, it feels a little bit scary in the first moment. Is it really that long? (Laughs) You join this very exclusive club of legendary artists, from the Stones to the Beach Boys, The Who — there are very few bands that (are) reaching this magic number, and now we’re one of them. You know, it feels great. \n\nAre you excited about the tour? \n\nAbsolutely. Yeah. Even after all these years — we’ve done it so many times. \n\nHow do you think American audiences compare with the rest of the world? \n\nBack in the ‘80s, we became very Americanized. It’s still very exciting because this is the old rock ‘n’ roll dream, you know — to play in the free world and to go on tour with a tour bus. \n\nHow do you think the band has sustained itself? \n\nFor us, it was always important to have the right chemistry in the band. And I guess we were lucky. We enjoyed life and we were ready to party every night as well, but yeah, that’s always a fine line. There are a lot of artists from the world of rock ‘n’ roll that really get burned up or didn’t survive this crazy ride, you know? \n\nIs there any part of recording and touring that still surprises you? \n\nIt’s always exciting to create new pieces of music. How can you ever get tired of this? These days we play in front of three generations pretty much wherever we go, and it’s wonderful to see. \n\nHow is the new album different from previous Scorpions albums? \n\nIt has Scorpions DNA. It’s about heavy riffs, but it’s definitely also about melody. It’s about power rock ballads, you know. But it’s also about those big riffs, like “The Zoo” or “Big City Nights” and “Rock You Like A Hurricane,” all those songs. \n\nSo, looking back on those older songs, how do they seem different to you now? \n\nIt feels great sometimes to go back in time and realize that there’s still some great material we never really focused on or never touched all those years. \n\nThen of course, the question is: “What the hell? Why didn’t we release those songs back then because they came out so strong?” \n\nHow do you sustain your vocals over such a long period of time? That’s got to be taxing. \n\nI mean, next to rock ‘n’ roll, discipline is an ugly word. I cannot change the strings like our guitar players if there’s a problem, so you take care that your vocal chords stay intact and powerful. \n\nDo you and (guitarist and founder) Rudolf Schenker share a special closeness because you’ve both been there since the beginning? \n\nWe were friends. This is how this all started. It was not about having the superstar singer, a superstar guitarist with a super, super-duper ego, so it was all about going together to make this journey a worldwide success. \n\nDo you think the band will officially retire when this tour is over? \n\nWe don’t make any plans any more. (Laughs.) After 200 concerts between 2010, 2012, we thought this could be, really, the end of the road. And it’s easy to say, ‘We’ll stop at this point,’ but it’s so much harder to do, because it’s so emotional. This is our life, you know. \n\nI guess when our fans listen to this new album “Return to Forever,” then they’ll know why we couldn’t stop at this point. \n\n\nTo improve the chance of seeing your comment posted here or published in the New Hampshire Union Leader: \n\n\nNote: Comments are the opinion of the respective poster and not of the publisher.", "source": "Union Leader"}