{"published": "2015-09-28T18:43:54Z", "media-type": "News", "title": "HAAB: 11 confirmed Bangladeshi fatalities", "id": "fa110025-b0fc-493b-bbc0-896d429e41cd", "content": "Death of at least 11 Bangladeshis in the Mina stampede has now been confirmed by the Mecca hajj mission of HAAB, which also expressed fears that seven more unidentified fatalities were also Bangladeshi nationals. \n \nIbrahim Bahar, president of Hajj Agencies Association of Bangladesh (HAAB), confirmed the numbers to the Dhaka Tribune. \n \nExpressing concerns that the real number of Bangladeshi fatalities might be much higher, Bahar said that according to the HAAB’s list, around 90 Bangladeshi pilgrims are still missing while 25 Bangladeshis are now undergoing treatment at different hospitals in Saudi Arabia. \n \nThe hospitals where Bangladeshis are currently admitted includes Al Noor Hospital, King Abdullah Hospital and Mina Hospital, the HAAB chief said, adding that the Saudi government was not letting anyone enter those hospitals to collect information about the injured. \n \nAsked whether there would be any compensation from the Saudi government to the families of the stampede victims, he said: “We do not have any such information yet.” \n \nBahar added that all of the Bangladeshi victims would be buried in Saudi Arabia. \n \nMeanwhile, Saudi Arabia’s English-language daily Arab News yesterday reported that preparations have been made in six cemeteries of Mecca to bury the stampede victims upon their families’ approval. \n \nThe authorities concerned, however, were also ready to deliver the bodies and all relevant assistance to families wishing to bury their relatives in their homelands, Arab News further reported. \n \nQulkhani for a Jamalpur haji \n \nA family in Jamalpur has held the qulkhani for one of their relatives, who they claim was killed in the Mina stampede. \n \nThe family from Hatchandra village claims that Firoza Khanam, a retired schoolteacher and mother of five, had gone to this year’s hajj with her son Khandaker Mozaharul Islam. \n \nMozaharul was with his mother when the stampede killed her, but Saudi police soon took away her body, said Firoza’s other son Khandaker Faridul Islam. \n \nSince then, Mozaharul had been searching different hospitals for his mother’s body, but to no avail, Faridul told our correspondent. \n \nTwo reported deaths in Sylhet family \n \nA family in Sylhet claims that one of their relatives had died in Thursday’s Mina crush, while another is also feared dead. Three more of their relatives were also injured in the incident, they further said. \n \nThe family from Sylhet city’s Syedanibagh said the body of one of their family members – Shaheda Begum – has been identified, but another relative – Asma Begum – has been missing since Thursday’s stampede. \n \nSyed Fazilat Hossain, brother-in-law of Shaheda, said five members of the family were together when the stampede took place. Asma’s husband Syed Shakhawat Hossain and Shaheda’s husband Sadeque Hossain lost consciousness during the crush and were rushed to local medical facilities. \n \nAfter regaining consciousness, they set out to find their wives and identified Shaheda’s body at a Saudi hospital on Saturday; even though Asma could not be found, the family believes she had died, Fazilat told our correspondent. \n \nBrahmanbaria haji identified by brother \n \nA family in Brahmanbaria’s Kasba upazila says one of their relatives, Jahedul Islam Bhuiyan Shwapan, had died in the Mina stampede. \n \nJahedul’s elder brother Aminul Islam Bhuiyan said the news of the death was confirmed on Sunday by another brother who had been accompanying Jahedul in the pilgrimage. \n \nQuoting Khairul Islam Bhuiyan, the brother currently in Saudi Arabia, Aminul told our Brahmanbaria correspondent that Jahedul had been missing since the symbolic stoning of the devil. His body was later found at a morgue and identified using the identification card on the body. ", "source": "Dhaka Tribune"}