{"published": "2015-09-27T20:43:10Z", "media-type": "News", "title": "Obama to meet with Raul Castro at United Nations - USA TODAY", "id": "2aeafc83-9e89-4a67-a432-8d8c6856e517", "content": "President Obama opened a three-day series of meetings at the United Nations on Sunday by calling on all countries to \"step up\" efforts to eradicate poverty, and by scheduling a meeting on Tuesday with Cuban counterpart Raul Castro. \n\nAddressing a U.N. meeting on sustainable development, Obama said that the world has made progress on reducing hunger, improving the treatment of disease, and lifting people out of poverty, but challenges remain. \n\n\"Our work is nowhere near done,\" Obama told delegates who gathered for the annual opening of the U.N. General Assembly. \n\nDevelopment programs are working, Obama said, but results can improve if the U.S. and other countries can address such issues as bad governance; gender, racial, and income inequality; fulfilling the economic potential of Africa; and the ravages of wars. \n\nObama also cited the global challenge he plans to emphasize throughout his U.N. meetings: climate change. \"All of our countries will be affected by a changing climate,\" Obama said, especially poorer nations. \n\nAs Obama flew to New York City aboard Air Force One early Sunday, the White House announced an addition to his U.N. schedule: the Tuesday meeting with Castro, Obama's second face-to-face with the communist leader since the U.S. and Cuba restored diplomatic relations in late 2014. \n\nThey met in April on the sidelines of a Summit of Americas meeting in Panama. The two also spoke by phone earlier this month, before the visit of Pope Francis to both Cuba and the United States. \n\nThis is Castro's first trip to the annual opening of the U.N. General Assembly. \n\nAfter speaking at a mid-afternoon meeting on the U.N.'s global development agenda, Obama visited the U.S. mission to the United Nations to meet with employees and their families. \n\nObama turns to domestic politics Sunday evening as he delivers remarks at a Democratic National Committee LGBT gala. \n\nIn addition to his annual address to the countries that make up the U.N. General Assembly — something Obama will do Monday morning — United Nations week gives the president a chance to meet one-on-one with a select group of other world leaders. \n\nIn addition to Castro, Obama's meeting list this year includes India Prime Minister Narendra Modi, President Nursultan Nazarbayev of Kazakhstan, and a potentially tense session with Russia President Vladimir Putin. \n\nTopics for the Putin meeting include U.S. objections to what it calls Russian aggression in Ukraine and concern about a Russian military build-up in Syria. \n\n\"Our support for the territorial integrity and sovereignty of Ukraine will be front and center throughout our discussions,\" said Ben Rhodes, Obama's deputy national security adviser for strategic communications. \n\nU.S. officials have also criticized Russian support for embattled Syrian leader Bashar al-Assad. \n\nPutin, who authorized a Russian annexation of the Ukraine area, says he will protect the interests of ethnic Russians in eastern Ukraine, and still objects to what he has called a 2014 \"coup\" of a pro-Russian leader in Ukraine. \n\nAs for Syria, Putin says he wants to help fight the Islamic State, and he criticized the U.S. for backing Syrian rebels seeking to topple Assad. \n\nThe American \"provision of military support to illegal structures runs counter to the principles of modern international law and the United Nations charter,\" Putin said on CBS' 60 Minutes. \n\nThe White House also said Sunday that, during his Air Force One flight, Obama spoke by phone with Chilean President  Michelle Bachelet. \n\nIn addition to discussing the proposed Trans-Pacific Partnership trade deal, Obama also offered Bachelet condolences for a Sept. 16 earthquake in Chile \"and inquired about the status of rebuilding and recovery efforts.\" \n\nFollow @djusatoday on Twitter", "source": "Mount Olive Tribune"}