{"published": "2015-09-15T14:24:20Z", "media-type": "News", "title": "Etsy Embraces Mass-Manufacturing", "id": "2226de9b-379f-4036-b7ee-6eac21bfbb9b", "content": "There was a time when Etsy was a place to find handmade, artisanal item. But the company has in recent years gone from from quietly tolerating mass produced goods to officially condoning them. Now it will start actively helping sellers find manufacturing partners to crank stuff out in volume. \n \nBeginning yesterday, Etsy is accepting applications for its Etsy Manufacturing  program, which bring qualified manufacturers together with designers looking to ramp up production and move some serious product. The company asks that manufacturers comply with its ethical guidelines , which forbid child labor and discrimination and mandate humane working conditions, but according to its site, it will “not vet or certify manufacturers.” \n \nAnd so continues Etsy’s evolution. During the past two years, the company has warmed up to mass manufacturing. First , it updated its terms and service last year to users to sell products manufactured by third parties. Then it launched Etsy Wholesale, a service that helps retailers purchase products from Etsy sellers in bulk. Now this. \n \nIdeally, the move will help its network of entrepreneurs— 86 percent of whom are women —launch and expand their businesses. The catch is that long-time users have long complained that Etsy is betraying its roots  by allowing vendors to sell products they didn’t make by hand. But for some sellers, this could be a win-win situation. Helping established sellers expand their businesses by finding manufacturers and landing wholesale contracts, could give Etsy a bigger piece of the pie as well. And those that are growing will need guidance as they scale up. The new services could help keep Etsy sellers who want to grow from moving to platforms like Crowd Suppy , which helps entrepreneurs crowdfund, market and manufacture their products. \n \nThe trick will be balancing both new, truly handmade vendors with growing, mass produced products. \n Go Back to Top. Skip To: Start of Article.", "source": "Wired News"}