{"published": "2015-09-09T12:47:22Z", "media-type": "News", "title": "God Bless (Domestic) America(N Small Caps)", "id": "40f78418-030e-4703-8aad-0fea48ca41b7", "content": "The world is extremely volatile and speculative, and domestic US non-commodity operations are safest. \n\nThis is a big reason for a rarely seen larger decline in the 'safer' S&P 500 vs. the Russell 2000. \n\nWe expect this trend to continue through the first couple rate hikes. \n\nIn an article from the Wall Street Journal titled Why Small Caps Could Be Poised for Gains author Maureen Farrell said, \"Valuations for small-cap stocks have also come into focus in recent months and are at historically low levels. On an enterprise value-to-EBITDA basis, their valuations are at the lowest level since January and are below where they were both before and after the financial crisis.\" After fact checking on Bloomberg, EV/EBITDA being at historical lows did not check out. However, citing Barclays PLC's Venu Krishna, the article relays a strong argument as to why small-cap stocks will outperform, \"few expect the volatility that has gripped the markets in recent weeks to dissipate. Concerns about the trajectory of China's economy and the timing of the Federal Reserve's first increase in rates continue to weigh on stocks. On top of that, September is historically the worst month of the year for the major indexes going back to 1950, according to Stock Trader's Almanac.\" \n\nWe're very hesitant just to take the word of others. Instead we prefer to see signs of our theses in charts; our motto is that numbers never lie, unless they come out of China. Smart money, which comprises the majority of the trading volume during market hours, is showing that the risk parity for small caps has changed. \n\nThe first chart of importance is comparative volatility following the sharp decline in the markets two weeks ago: \n\nWhile volatility did tick up for both, the typical investment thought process is that the smaller companies which make up the Russell 2000 are more risky than larger and more established companies of the S&P 500. \n\nIn this current market, the correlation does not hold true. Many global US companies are seeing their earnings slashed due to sizable currency headwinds. Moreover, many global companies are seeing declining demand from Asia and cannot compete with European exporters due the divergence in central bank policy. \n\nA major question for the markets in the upcoming weeks and months is how a rate hike is going to effect the emerging markets, and particularly those who are debt-laden in USD backed liabilities. Luckily, the US ranks in last in terms of exposure of the countries surveyed by Bloomberg: \n\nOf the 3.4% of GDP influence has on the US, much of that is focused on commodity-based and exporting-related companies - not small caps. \n\nDuring the coming months, the markets will see even more surprises in economic data and many will claim that a bull market is over. We do not agree with this argument, especially as so many central banks are quick to help their markets at the first sign of weakness. Luckily, the economic picture in America is much brighter. \n\nDespite low wage growth, GDP has rallied and a growing labor force will cause a slow-but-steady rise in inflation. A lot of emphasis will be placed on whether the FED raises rates this month, but a better question to ask is how quickly the FED raises these incremental rates. If it is at a slow pace - as we expect - and the markets overreact, we urge investors to have some of their portfolio protected by starting oversold positions in strong domestic US companies. \n\nDisclosure: I am/we are long WYY, MDLNF. (More...)I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.", "source": "Seeking Alpha"}