{"published": "2015-09-26T21:39:45Z", "media-type": "News", "title": "Danny Dyer admits he makes up cockney rhyming slang to see if anyone notices", "id": "4b7593f9-9c96-4148-bb68-7279d5fdbe41", "content": "EastEnders star, Essex lad and total geezer Danny Dyer has warned of something terrifying. According to Mr Dyer, cockney rhyming slang is “dying out”. \n \nSpeaking at the Radio Times Festival, Dyer recounted that he recently used the term “Brady bunch,” meaning lunch, in an episode. But that’s not all the cockney slang Dyer’s been spitting recently. \n (Ian West/PA) \nHe also sometimes makes up cockney slang, in the hope that people will get confused and Google what he’s said. Danny Dyer knows how to have a good time. \n \nAsked about the east London slang tradition, Dyer said: “It is dying out. It’s a sad thing.” \n \nAn American fan speaking at the event said she often has no idea what Dyer’s words mean and suggested that the soap put a glossary of slang on its website. \n (Yui Mok/PA) \nExecutive producer Dominic Treadwell-Collins said that sometimes when he is in the edit suite he checks certain words because the slang could be “really dodgy”. \n \nTurning to Dyer, he said: “And I know you, you’d try and slip something in.” \n \nDyer gave examples of more slang terms such as “pony and trap” which is slang for “crap”, and “bottle and glass” which is slang for “arse”. \n   Promoted stories   (Yui Mok/PA) \nFestival attendees were also let in on what what’s in store for Dyer’s character, Queen Vic landlord Mick Carter. \n \nThe character has been at the centre of a main storyline for months after his wife Linda, played by Strictly Come Dancing star Kellie Bright, was raped by Dean Wicks, played by Matt Di Angelo. \n \nDyer told the festival audience he hates the character of Dean “with a passion” and said the story is going to come to a conclusion. \n \nMr Treadwell-Collins turned to Dyer and said: “You’ve been fitted for a wetsuit, that’s all I’m saying.” \n (Yui Mok/PA) \nDyer said he has found the storyline difficult, adding: “Your head, as a man and a character, starts to merge a bit.” \n \nTalking about similiarities he has with his character Mick, he said: “This is the closest I’ve ever played to myself.” \n \nDyer said he is “quite a sensitive soul” who loves his family and is in touch with his feminine side. \n   \n Share article  \n   \nHe had the audience laughing when he said that he had become “a bit of a joke” before he started acting in EastEnders, adding that he did shows like Danny Dyer’s Deadliest Men because he “had to get the readies in”.", "source": "Lancashire Telegraph"}