{"published": "2015-09-11T18:28:10Z", "media-type": "Blog", "title": "Food stamps don't buy diapers, so one mom found this solution", "id": "d3571064-f0ca-4723-affc-fa9436c06ac0", "content": "[van id=\"tv/2015/09/10/cnnheroes-corinne-cannon.cnn\"]WASHINGTON  -- Corinne Cannon had a tough time adjusting to motherhood after the birth of her first child, Jack.\n\n\"We were ecstatic to have him, but he was a difficult infant,\" Cannon said. \"He cried pretty much all the time, and it was so emotionally exhausting.\"\n\nThat's an experience many new mothers can relate to. But Cannon knew she had the resources and support to get her through that many families do not have. She felt compelled to help them, so she called local organizations to ask what she could do.\n\nOver and over, the answer she got was \"diapers.\"\n\nNearly 30% of parents in the United States cannot afford diapers, which can cost up to $100 every month per baby. And it is an expense not covered by food stamps.\n\n\"I thought how impossible it would be, on top of having the stress of a newborn, if you are wondering where your baby's next diaper is coming from,\" Cannon said.\n\nIn 2010, the day before Jack's first birthday, Cannon founded the D.C. Diaper Bank. The nonprofit has since provided nearly 2 million diapers to low-income families in the Washington metro area.\n\nBut for Cannon, the work is about more than giving away diapers.\n\n\"We're using diapers as a way to bring families in the door, to have them engage with social services for their other needs,\" said Cannon, whose group partners with other local nonprofits that help families.\n\nLast year, Cannon's organization expanded to provide other necessities, such as formula, baby food and breastfeeding supplies.\n\nCNN spoke to Cannon about her work. Below is an edited version of the conversation.\n\nCNN: How does the lack of diapers affect children and families?\n\nCannon: The ramifications of not having diapers are far-reaching. It floored me to learn how diapers were such a need. There are real implications for the child. Physically, there's diaper rash, which could be extremely painful, and there are infections, which can come from that. There's excessive crying that can come from that pain.\n\nThere are also real implications for the parents. The amount of stress that a mom feels around not being able to provide diapers can be greater than what she feels around food insecurity. And that's because there are not resources to receive diapers in the way that there are resources for food.\n\nCNN: What are some of the obstacles facing the families you help?\n\nCannon: The one thing that all of our families have in common is that they are struggling on a daily basis to provide for their families. Whether they are working poor and they're working two jobs or they're in a homeless shelter---they are struggling. They are trying to pretend everything's OK so their kids have no idea what is going on, but they don't know how they're going to pay the grocery bill next week. A lot of our families are living day to day.\n\nSomebody once said to me, \"Diapers can't solve poverty.\" And I said, \"You are right. They can't. But what they can do is be part of a larger solution.\" So when these diapers help bring a family into a social service system, they're getting a whole bunch of other resources, and they're getting a lot of other help.\n\nCNN: And that's the basis of your model, to connect families to other services. How does it work?\n\nCannon: We don't directly donate diapers to families. We partner with organizations that work with low-income families.\n\nParents who need diapers are also in need of a host of other things. They're in need of food, case management, legal help. I think the reason people reach out for diapers in a way they don't reach out for other things is because diapers are such a necessity. You absolutely have to have them, and there aren't many other outlets to receive them.\n\nIn creating this model, what we wanted to do was have the families go to a one-stop shop.\n\nCNN: Most of your volunteers are families with young children. Why is that important for you?\n\nCannon: I always knew that if I'm going to do this, my kids are going to be a part of it. So we created this space where you can bring your 3-year-old to volunteer.\n\nExposing your kids to the idea of helping, particularly in a place like D.C. that is so polarized, really helps to strip away that separation between different communities. Giving families the opportunity to have those important conversations really helps to bridge that gap.\n\nWant to get involved? Check out the D.C. Diaper Bank website at www.dcdiaperbank.org and see how to help.", "source": "WTKR.com"}