{"published": "2015-09-26T01:25:58Z", "media-type": "News", "title": "Mumbaikars may soon need an NOC to dig under their own plot", "id": "7394f875-7699-4a64-a019-33ab1e3e7043", "content": "in BOLYWOOD / \t\t\t\t\tby / \t\t\t\t\ton September 26, 2015 at 1:25 am /  \nIf the government has its way, a new amendment to construction laws could make it more difficult for landowners to dig water bore wells under private plots, construct basement floors or, worse, build deep foundations for a building. \n \n\nIn February this year, MMRC Managing Director Ashwini Bhide and a few other officials had visited the proposed site for the Metro-III car shed at Aarey Colony to plant a few saplings. File pic \n \nAs of now, a private plot owner has right to claim ownership of anything a few metres below the ground level, but an amendment to the Development Control Rules (DCR), 1991, proposed by the Mumbai Metro Rail Corporation (MMRC) on August 24 simply means any construction activity under a private plot falling in the alignment of a public work such as transport projects, tunnels, allied activities, etc, will need a no-objection certificate (NOC) from the civic authorities. Or such works could even be restricted completely. \n \n\nA file pic of Metro work in progress. Preliminary estimates suggest as many as 2,223 structures will be affected by Metro-III, and thousands more are likely to get hit by other underground infrastructure projects in the pipeline \n \nThe new amendment is proposed by the MMRC and forwarded to the Brihanmumbai Municipal Corporation (BMC) in view of the Metro-III project (Colaba-Bandra-Seepz), which would need tunnelling work of 33.5 km and affect thousands of structures around the alignment and its proposed 27 stations. \n \nPreliminary estimates suggest as many as 2,223 structures will be affected by Metro-III, and thousands more are likely to get hit by other underground infrastructure projects in the pipeline. If the proposed amendment is made to the DCR, all structures/plots coming in the alignment of a public tunnel, underground public project for mass transport, including even the coastal road, could see no further development or structural changes. \n \nPre-emptive strike \n“The structure and land affected by the proposed Metro alignment are having mostly private ownership and land owners may claim ownership right of the underground tunnel passing below their land in future. So, a specific regulation restricting such ownership claims is required to avoid future conflict. \n \nIt is necessary to include words ‘Underground Public Mass Transit System’ in the DCR to facilitate construction of alignment/tunnels, activities and allied uses below existing private land and structures. The concerned landlord will be allowed to avail any benefit as per prevailing laws on such plots, but cannot claim ownership of such structures/construction,” the proposal, signed and drawn up Ashwini Bhide, Managing Director, MMRC, reads. \n \nHowever, civic officials fear that once the amendment is made, it is likely to be applied generally to every plot coming in the way of an alignment for any sundry public work such as tunnelling, digging, etc. It is likely to put restrictions on basement floors, foundations, and water boring below specific depths, and those requiring these facilities would then need an NOC from the civic authorities. \n \n“The depth of tunnels for civic tunnelling works and Metro works for mass transit system goes on up to 20 metres below the land,” said a senior civic official. \n \nRedevelopment hit \nExperts said regulating foundations and other digging activities on private plots could hamper redevelopment of old structures such as the Gaothans that are set to get higher floor space index (FSI) of up to 6 under the new Development Plan (DP). \n \n“The Gaothans are set to get a boost from the existing .75 FSI to up to 6 under the new DP. The higher the height, the deeper we may need to go under the ground in future. With these sort of regulations, what use is it to redevelop our structures or claim FSI benefits from the government? Also, why does the government not direct its energies on restricting digging of illegal bore wells being used in stealing water rather than regulating the genuine ones around infrastructure projects?” asked Sahar village resident and trustee of Watchdog Found-ation, Nicholas Almeida. \n \nAnother resident affected by the Metro-III said the change in DCR will only add to more confusion for their century-old structures set to go in for redevelopment. “Our building is under the Pagdi system and may need to go higher or other structural changes may need to be carried out in the future. \n \nHow will we carry out those changes? The government is going on piling rules without even getting into the discussion of our rehabilitation, if necessary,” said Viraj Vedphatak, a resident of Sriram Bhavan, Charni Road, which is likely to have a Metro-III station soon. \n \nReasoning \nSenior MMRDA officials said the main reason they had requested the BMC to make changes in the DCR, 1991, is because, at present, the construction of underground public mass transit system is not mentioned in the BMC DCR of 1991. \n \nThe changes made in the DCR will help them in doing work of tunnelling below the private properties along the alignment without any delay or problem as once the changes in the DCR are made, the Project Affected Persons (PAPs) won’t be able to claim that they have ownership rights below the ground. \n \nAlso read: Metro and Monorail projects affected people in Mumbai seek speedy rehab \n \n“Once the provisions suggested by us are made, no private land owner would be able to do any kind of construction below the ground along the alignment, which includes basement floors, water borings and foundation work, without an NOC. \n \nWhile demanding this, we want to make it clear that the landowner will be able to get the benefit as per law. All these things have been demanded because we don’t want any kind of danger for the structure of the underground Metro as well as the privately-owned structures above the ground,” said an MMRDA official. \n\n\nTo the centre of the Earth \nThe ownership of the land generally includes all the land below the delineated surface plot, all the way down to the centre of the Earth and to the sky above to infinity. \n \nOwnership of a land is commonly subjected to existing mineral utility use or those related to local zoning and building laws. A recent SC judgment on property dispute from Kerala had underscored these points. \n \n2,223 \nNumber of structures expected to be affected by the Colaba-Bandra-Seepz Metro-III project \n    Tweet  [embedded content]", "source": "Punjab Star News"}