{"published": "2015-09-17T15:00:14Z", "media-type": "News", "title": "Canadian National Railways and Union Bank to Present WhereScape Data Warehouse Automation Use Cases at TDWI", "id": "c98e7c21-116d-4f8d-b903-64c86fcaf648", "content": "WhereScape ,\na provider of automation software for modeling, building and extending\ndata warehouses and analytic systems, announced today that Canadian\nNational Railways and Union Bank will present WhereScape automation use\ncases next week at TDWI\nSan Diego . \n\nOn Tuesday, Sept. 22, Alain Bond, business intelligence manager for\nCanadian National Railways, will present Canadian\nNational Railways Rides Automation to Better Customer Service and Safety at the TDWI Executive Summit. According to Bond, in every organization,\nthere is some degree of shadow IT within business units that are driven\nto deliver point solutions faster than IT typically delivers. Bond is\nleading a group at Canadian Railway that is using WhereScape RED,\nWhereScape’s flagship automation software for iterative rapid\nprototyping within its agile methodology and will discuss how this\n“alternate development path” is expediting “game-changing” development\nat Canadian Railway. \n\nAccording to Bond, this path “should not be a slow and procedural\nprocess requiring tons of upfront documents and analysis before even\nshowing any glimpse of value to our end users.” Canadian Railway’s\nsuccesses using WhereScape RED have been so great that Bond has\nproclaimed that “ETL development as we know it is dead.” Even more\nsignificant is the fact that more timely access to data will enable\nCanadian Railway to further improve customer service and safety. \n\nOn Thursday, Sept. 24, Ryan Fenner, vice president of enterprise\narchitecture for Union Bank, will present how WhereScape RED is enabling\nhis organization to tailor analytics implementations to their individual\nneeds in his case study entitled, Data\nAnalytics Federation vs. Centralization: When and Where It Makes Sense .\nUnion Bank is presently formulating a plan to centralize key analytics\nteams, technologies, and processes. Fenner’s compelling use case will\nwalk attendees through Union Bank’s journey and the guidelines used to\nmake decisions on where and when to centralize these functions, and to\nwhat extent. Union Bank uses WhereScape RED in its Greenplum and\nMicrosoft SQL Server enterprise data warehouse and shadow IT\nenvironments. \n\n Build a Data Warehouse in Two Hours with WhereScape RED  \n\nWhereScape will host a TDWI Hands-On Lab on Wednesday, Sept. 23\nentitled, Data\nWarehouse Automation: Build a Fully Functional, Documented Data\nWarehouse in 2 Hours! Whether a development team is building its\nfirst enterprise data warehouse, business-targeted data marts, a tier of\nreporting services, or the renovation or migration of an existing\nwarehouse or mart, WhereScape RED provides a compelling automation\nalternative to complex and expensive do-it-yourself development\nenvironments. \n\nAccording to TDWI, building a data warehouse is among the most\nlabor-intensive and time-consuming activities of BI development. There\nare so many moving parts—requirements, source data analysis,\nsource-target mapping, data acquisition, data transformation logic, ETL\ndesign, database loading, scheduling, error handling—and getting it\nright the first time isn’t easy. When organizations finally do get it\nright, something changes. \n \n“Attendees of this fast-paced, hands-on lab will learn first-hand how to\ngreatly accelerate data warehouse and analytic platform development and\nchange cycles while simultaneously assuring quality and consistency,”\nsaid WhereScape President Mark Budzinski. “The productivity improvements\nof up to 10x afforded by WhereScape RED enables organizations to deliver\naccurate data to the business faster than ever thought possible.” \n\n About WhereScape  \n\nWhereScape designs, develops, sells and supports WhereScape\n3D , the industry’s first data warehouse discovery tool; and WhereScape\nRED , the industry’s leading integrated development environment for\nbuilding, deploying, managing and renovating data warehouses and\nanalytic systems. WhereScape’s products are used in every kind of\ntoday’s commercial environment: from normal-form enterprise data\nwarehouses and data vaults, through user access layers and tiers of\ndependent data marts, to standalone data marts and reporting systems. \n\nMore than 700 customers are active and satisfied users of our\ntechnologies, and report that with WhereScape’s products they are able\nto build data warehouses with fewer people, few if any diversions,\nmissed deadlines or unmet user expectations, and in record time: in days\nor weeks, instead of months or years. WhereScape has offices in\nPortland, Oregon; Auckland, New Zealand; and Reading, UK. For more\ninformation, please visit us.wherescape.com . \n\nAll products or company names herein may be trademarks of their\nrespective owners. \n\n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/201509170051", "source": "Ulitzer"}