{"published": "2015-09-29T15:09:40Z", "media-type": "News", "title": "Craigan has not applied for ’Well job", "id": "0453791e-3d91-4507-832c-9dc864ed2fe6", "content": "Stephen Craigan has admitted that the stressful nature of full-time football management in the Scottish Premiership may not be for him.\n\nThe Northern Irishman, caretaker manager of Motherwell after Ian Baraclough’s sacking, presided over the 2-1 home victory over Partick Thistle on Saturday.\n\nSpeaking to the media just a few minutes after the final whistle, the 38-year-old Motherwell under-20 coach and BT Sport analyst said: “The first minute seems like yesterday; that’s how long ago it seems.\n\n“I’ve worked at international level with the under-19s and with the Motherwell under-20s and the games have never felt as long as that.\n\n“Maybe that’s what a little bit of pressure does, or probably desperation because we needed the three points.\n\n“If you told me for the next five years you’ll go through that every Saturday I think I’d probably say: ‘Not for me’.\n\n“Tomorrow morning when I wake up, hopefully with a sore head I’ll think: ‘That was quite good’.”\n\nAlthough caretaker boss Craigan is the bookies’ favourite to get the Motherwell job full-time, he told the assembled press men that he wasn’t one of the 57 applicants for the post.\n\n‘Crags’ said that ’Well owner Les Hutchison had asked if he’d be interested in the manager’s job very soon after Baraclough’s sacking last Wednesday.\n\n“I said that the manager had just left his position an hour ago,” Stephen added.\n\n“So I wouldn’t be in any frame of mind to give you a yes or no.\n\n“I spoke to Les and Alan Burrows and I was told: ‘Take the team on Saturday and we’ll take it from there’.\n\n“I have some good jobs at the minute. I love it with the Motherwell under-20s and my work with BT is terrific.\n\n“It would be a lot for me to give up.\n\n“It would be a big decision for the club to make if they think a young, inexperienced manager is the way forward.\n\n“That’s the first time I’ve ever managed in senior football.\n\n“It will certainly be an interesting next week or so.”\n\nIf Craigan is to get the Motherwell job full-time, he and his family will be hoping that he’ll be able to savour matches more enjoyable than the workmanlike 2-1 success over Thistle.\n\nStephen said: “You can’t enjoy that. My salaries over the last three years have been a lot more enjoyable than what that one was.\n\n“I knew it was always going to be the case.\n\n“The game itself was never going to be a classic; two teams who are struggling for a little bit of form and struggling for a result.\n\n“We had the disappointment during the week (losing 3-2 to Morton after extra time in the League Cup third round).\n\n“We had 120 minutes in a lot of the players’ legs. We knew it was just going to be of case of getting through.”\n\n* As we went to press, one betting firm had Craigan as 2/1 favourite to be next ’Well manager, with Steven Pressley 5/2 and Mixu Paatelainen 4/1.", "source": "Motherwell Times"}