{"published": "2015-09-12T05:27:28Z", "media-type": "News", "title": "Benjamin carries Nashoba Regional to victory", "id": "333116c7-1060-4c8f-baac-04418049edda", "content": ". \n\nBOLTON -- Granted, it is a very small sample size, but the Nashoba Regional football team appears to have found that winning formula that has led to a lot of success over the years. \n\nBehind a strong defense and a balanced running attack, the Chieftains opened up the 2015 season on Friday night by posting a hard-fought 12-7 victory over a very game team from Algonquin Regional in front of a packed house. \n\nWith the win, Nashoba ran its record to 1-0, while the Tomahawks fell to 0-1. The Chieftains will visit Shrewsbury next week. \n\n\"You always want to start with a win,\" said Nashoba head coach Jamie Tucker. \"I think Algonquin and Nashoba can be a good rivalry, so of course this is a great win, and I am really proud of this group for the way they performed tonight.\" \n\nNashoba wasted no time taking control in this one as the Chieftains embarked on a 14-play drive that covered 66 yards in nearly eight minutes of action. Junior Nick Rodgers (7 carries, 27 yards, TD) capped off the drive when he sprinted in from 8 yards out to give the hosts a 6-0 lead with 3:21 left in the opening quarter. Jonny Gjeltema's extra-point attempt was blocked. \n\nAfter Nashoba was forced to punt on the second play of the second quarter, the visiting Tomahawks went on the move. Algonquin made it all the way to the Chieftain 1-yard line before senior Harry Ashline sniffed out a fourth-down attempt to force the Tomahawks to turn the ball over on downs. \n\n \nAlgonquin got on the board with 6:49 left in the third quarter when Max Cerasoli (5 carries, 11 yards, TD) busted his way in from 9 yards out. Evangelos Baltas booted through the extra point as the visitors has their first lead of the night at 7-6. \n\nBut right as the Tomahawks appeared to gain some momentum, Ashline stole it back. On the ensuing kickoff, the senior came out of a crowd and scampered 58 yards before finally being brought down at the Algonquin 7-yard line. \n\n\"Harry (Ashline) is a football player,\" Tucker said. \"He is an incredibly smart player and a very athletic player. That was a great read on that goal line play. The same thing on the kickoff play, as I thought he was tackled and next thing you know he is running all over the place. Harry is a gamer and that's the kind of guys you need if you want to be successful\" \n\nThe fourth quarter belonged to senior captain Jake Benjamin as he single-handily wore down the Algonquin defense. Benjamin rushed for 106 yards in the final quarter, including a 35-yard touchdown run with 6:09 left to put the Chieftains up for good at 12-7. Benjamin finished the game with 131 yards on 14 carries. \n\n\"With Jake (Benjamin), I talked to him over the summer and told him that he can be a dominant wide receiver, but you can be a dominant running back, too,\" Tucker said. \"He is an incredibly tough kid.\" \n\nOver the final six minutes, a heavy dose of Benjamin kept the Algonquin offense off the field. The Tomahawks went three-and-out following Benjamin's touchdown and didn't see the ball the rest of the evening.", "source": "Sentinel and Enterprise"}