{"published": "2015-09-29T21:41:48Z", "media-type": "Blog", "title": "Egan: Eagleson park-and-ride bursting, new site costs $47,000 per free spot", "id": "bc8f97ad-2483-4189-b8d2-9788010655ce", "content": "Cars are regularly being ticketed around the park-and-ride on Eagleson Road at the Queensway, an alert reader tells us, evidence of a transit policy that suffers its success.\nThe lot can hold 1,216 cars and, apparently, is not expandable. Cars are leaking onto the closest streets, like Hearst Way, and the lots of nearby businesses, which is hardly a tenable, long-term solution. Complaints come in, bylaw goes out, tickets fly.\n\"We know on any given day,\" says Kanata South Coun. Allan Hubley, \"there were 40 to 100 cars parked illegally in the area.\"\nLongtime user Christopher Busby, a federal public servant, spells out what this pressure means. \"I've seen people nearly come to blows in there.\"\nSo the city's response is to proceed with a new park-and-ride at Terry Fox and Innovation drives, about six kilometres northwest. It's to open in the fall of 2016 and Phase 1 will have room for 300 or so cars. It will cost $8.3 million. This excludes the $5.7 million for the land. Yes, that makes $14 million, or $47,000 per spot, given away free to the user.\nI drove around the site Tuesday and a thought occurred: we've gone nuts. We're taking a partially treed meadow — which may be home to neat, protected turtles or frogs, or what have you — bulldozing it, paving it, so we can park cars there 12 hours a day, five days a week, in order to ease commuter traffic, have greater transit use, in honour of living greener lives, which we can spend in paved suburban paradises.\nIt's just a thought. It's OK. It's gone.\nHubley had another idea, which can't seem to catch on. The Canadian Tire Centre has parking lots for something like 6,500 cars. There is a small park-and-ride there for 100 vehicles. The rest, at least during the daytime hours, is a windblown tarmac where the Space Shuttle could land.\nWould it not make sense, he wondered, to look at expanding the CTC park-and-ride, save at least $8.3 million, and make better use of acres of empty asphalt, instead of paving acres more?\nThe problem, however, is that commuters headed east (downtown) don't want to travel west (to CTC) to get on a special bus, heading east. (The CTC's 100 spaces are usually half empty.)\n“I’m quite disappointed that people didn’t take to it because we thought we had a really good solution there,” said Hubley, calling it a \"five-minute\" drive from Eagleson.\n(An admitted shortcoming of the CTC solution, too, is that park-and-ride clients need to vacate by 6 p.m. on game or event days. Plus, the bus service isn't as good.)\nThe problems at Eagleson are long-standing. Hubley says he's been hearing about over-capacity issues for five years.\n”If 30 cars get ticketed, I probably hear from 20 or 25 of them.”\nHe says he worked with planners to create dozens more spots with design changes, like moving the snow removal pile. And drivers get inventive. When I scouted it out, there were cars parked on the grass, in caution areas, in spots that didn't look quite legal.\nProbably not much comes of it: the spots are free, first-come, first-served, and if no one is blocking a car's exit, does it really matter?\nThe site for the new park-and-ride touches the Monk Environmental Park, which was connected to the South March Highlands before the Terry Fox extension cut through it — a $48-million corridor through provincially significant habitat.\nHubley says they found protected turtles along Innovation Drive. The city disagrees, saying no turtle mitigation was necessary.\n“The amount of money that goes into turtle mitigation is wild,” said the councillor.\nHe was referring to a study by Dillon Consulting, with the city's participation, that followed the Blanding's turtle population in the next-door South March Highlands for about four years. The results, which used radio telemetry, were quite amazing.\nOne, little Franklin, was monitored for 1,104 days. Some subjects travelled thousands of meters. The study estimated there were about 95 turtles in the population and more urban development would only put pressure on long-term survival.\nBusby, meanwhile, is a director of a South March Highlands conservation group. The site for the park-and-ride is criss-crossed with hydro lines and once had a road through it. \"It doesn't have a lot of ecological value left.\"\nIt is a good location for those coming from the north end of Kanata or West Carleton, he added, as long as it's well served by express buses.\nMore paving, more buses, GPS turtles, and $47,000 to let one car sit all day. We turn green.\nTo contact Kelly Egan, please call 613-726-5896 or email kegan@ottawacitizen.com.\nTwitter.com/kellyegancolumn", "source": "Ottawa Citizen"}