{"published": "2015-09-16T00:22:00Z", "media-type": "News", "title": "Volunteering is for everyone", "id": "578c597a-4366-40ac-a3e7-c5bd70b1f1ba", "content": "No matter what age or stage you’re at, volunteering is a limitless opportunity. There are so many ways to participate in activities, learn new skills, explore new areas of interest and meet new people. At Senior Coastsiders, there are myriad places to contribute your time and energy, from one-time events to weekly offerings. And, if one of these doesn’t appeal to you, let us know and we may be able to find another volunteer opportunity. \n\nMeals-on-Wheels offers a wonderful way to get to know some of our seniors. The once-a-week commitment allows volunteers to develop a rapport with seniors in the community while delivering a hot, freshly prepared, daily meal. Volunteers drive one of two routes, either individually or as a team. Our chef creates delectable meals with fresh ingredients to be delivered Monday through Friday to people who are homebound. We are always looking for interested community members to serve as drivers and would appreciate hearing from you if you want to join our team of devoted volunteers. \n\nYou may be surprised to learn that the thrift store is run mostly by volunteers who can choose a three-hour shift, once a week, morning or afternoon, on Thursday through Monday, after a training period. There are two paid staff members — the manager and assistant manager — at the store as well. Volunteers help sort donations, hang items, clean and wash dishware, organize house wares, place books in the sale racks and help out on sale days. This is a great way to do good while having fun at the thrift shop. We encourage both men and women to consider this volunteer opportunity if you like people and you like retail stores. All proceeds benefit programs at Senior Coastsiders. \n \nWe have some volunteer openings at the center as well. We need people to help in the kitchen, packaging meals for delivery and serving in the lunchroom daily, and we need greeters at lunch. We are currently seeking office support to answer phones and direct questions to the right staff member. People of all ages and from all backgrounds are encouraged to come by and find out more about the volunteer activities. We are always expanding our services. \n\nAnother way of pitching in at Senior Coastsiders is by helping with special events, including participating in the upcoming Pumpkin Run, either by registering participants or cheering runners and monitoring the trail as the sun rises over the seashore on that special Sunday, Oct. 18. You will be done by 10 a.m. — just as the Pumpkin Festival is beginning. Other special events include helping with our Minor Home Repair Day, and we can always use handy people, contractors, painters and gardeners all year long. \n\nOn special occasions, we can use help with gift bags, mailings, serving meals, providing entertainment, teaching classes and doing outreach for our upcoming events by placing fliers throughout town. If you have an idea for a class or workshop, we are always open to hearing about it. We have a robust and varied activity schedule as well as several art, craft, movement, yoga, chi gung, language and writing classes. \n \nIf you would like further information or to start volunteering, contact Vicki at 726-9056, weekdays. It would be a pleasure to meet you and discuss the possibilities and your interests in working at the senior center as it develops into a place for people of all ages. \n\nVicki Cormack is Senior Coastsiders program manager, volunteer coordinator and Home Repair organizer.", "source": "Half Moon Bay Review"}