{"published": "2015-09-09T08:09:19Z", "media-type": "News", "title": "Mihaela Petrovan, Initiator Marketing in Direct : “This year, we discuss advantages and disadvantages of digital marketing, compared to traditional offline marketing”", "id": "e53681f8-faa7-4284-8a6e-253df5ac3e9e", "content": "In a permanently changing world, where economy, financial markets, the business and investment climate are always facing permanent challenges, intelligent marketing becomes a crucial instrument. What are the novelties offered by the project initiated by you, respectively the 2015 edition of the Marketing in Direct (MID) conference, which is already the seventh edition so far, to the business community in Romania? \n \nMID does not provide universal solutions; yet, it exposes optimal recommendations and cases studies for the benefit of a homogenous audience of marcomm-sales-management specialists. It is our mission for seven years, including the edition due in two weeks. And almost 40 per cent of the audience is not missing any edition. \n \nHow did the idea of initiating this series of events occur to you? \n \nYou may find it strange, but it was not our idea. In 2009, ARMAD demanded us to “reinvent” Rodirect, the event organized by the association, that wasted some of its audience year after year. Later, they changed their minds and suggested to us – as the new concept of the event was already announced and the invitations were sent – to organize it under a different name. We received a sum of money for our efforts as well as ARMAD’s brand, to launch it. Leaving all modesty aside, I am happy to tell you that MID enjoys a greater notoriety and audience today than the event it directly competes with. \n \nWhich are the most important messages to be issued by the 2015 edition of the Marketing in Direct Conference to the market and consumers? \n \nWe have brought new topics to the attention of the over 250 attendants each you, based on current trends. This year, we discuss the advantages and disadvantages of digital versus traditional offline marketing, trying to help marcomm-sales-management specialists to include their best tactics in annual strategies. \n \nCan you reveal us some of the most important surprises prepared by the Marketing in Direct team for this year’s edition? As much as you may tell us in advance. \n\n \nObviously: 13 speakers, one of them from abroad, who has been a friend of MID for several years, namely Chris Arnold, will provide pro and contra arguments on topics related to this subject for eight hours. We also have a few surprises we have prepared for our guests during the breaks of the conference, not to mention the goodie bag in the end. We are happy to provide guests the possibility do discover (if they have not done so already) Stejarii Country Club, an extraordinary green locations that will host our events from now on. \n \nWhat do you think is the key to the success of this event organized by you, that has already become a brand in the specialized events market, awaited with high interest year after year by marketers and consumers in Romania? \n\n \nConsistence. Each year, we have interesting topics, relevant speakers, useful information and, more than this, we have kept a monthly connection by newsletters with dozens of thousands of specialists. Thank you, Nine O’ Clock, for your beautiful words and appreciations.", "source": "Nine O'Clock"}