{"published": "2015-09-30T16:30:30Z", "media-type": "News", "title": "Mike McCarthy Speaks Highly of Colin Kaepernick, Carlos Hyde and Eric Mangini", "id": "c4f4ef50-456a-4a9a-9472-5cf9d8fc5059", "content": "Wednesday's Niners Daily looks at recent comments from the head coach of the Green Bay Packers, who shared opinions on his Week 4 opponent. \n\nColin Kaepernick is 3-0 as a starter against Green Bay, including two victories in the postseason. \n\nMike McCarthy has not forgotten about those games. \n\n“We have a lot of respect for Colin,\" the Packers coach said in his weekly conference call with the opposing media. \"He’s had a lot of success against us in the past.” \n\nKaepernick has posted a 101.3 quarterback rating with six touchdowns and two interceptions in those starts. He's also added 301 rushing yards and two rushing scores. \n\nComing off Kaepernick's career-high four interception game against the Arizona Cardinals in Week 3, McCarthy said he still sees a talented player leading the 49ers offense. Kaepernick has accounted for seven touchdowns (five passing; two rushing) in his two home victories over the Packers. He once threw for a career-high 412 yards in a Week 1 victory over Green Bay in 2013. Kaepernick also set a single-game postseason rushing record by a quarterback with a 181-yard outing against the Packers in the 2012 postseason. \n\"He’s definitely a challenge to prepare for,\" said the coach of the 3-0 Packers, who will face the 49ers at Levi's® Stadium on Sunday. \n\nWhen asked about how the teams have changed since those three previous losses to the 49ers in 2012 and 2013, McCarthy made it sound like he's focused more on the 2015 version of his team than what's happened in the past. \n\nGreen Bay's high-powered offense will match up against a new-look 49ers defense. McCarthy said Eric Mangini's reputation as a creative defensive coach remains intact. \n\n\"I’m sure he’ll have some wrinkles for us,\" McCarthy said. \n \nAfter noting the changes in defensive personnel for the 49ers, the Packers coach said, \"We’ve changed a lot since then, too.\" \n\nGreeen Bay totaled seven sacks in a Week 3 \"Monday Night Football\" win over the Kansas City Chiefs. Aaron Rodgers added five touchdown passes in a brilliant performance. \n\n\"He just keeps getting better,\" McCarthy said of the NFL's early MVP candidate. \"I don’t know how much better he can play, frankly. You never know with Aaron. … He’s played great the first three weeks, and we’ll just keep working. Hopefully he stays on course. He’s playing at an extremely high level.\" \n\nAnother player who has caught the eye of Green Bay's coach is San Francisco's second-year running back Carlos Hyde . The physical 49ers rusher is one of two running backs in the NFL with 250-plus rushing yards and two rushing scores through three weeks of the 2015 season. \n\n\"Carlos has had very impressive film,\" McCarthy said. \"He’s someone we’re definitely focused on. I think he’s off to a heck of a start.\" \n\nThe same can be said for the Packers. But McCarthy is not letting early success alter how he coaches his team. \n\n\"Let’s be real here,\" he said. \"We’ve got a lot of work to do as a football team.\"", "source": "NFL"}