{"published": "2015-09-22T01:39:43Z", "media-type": "Blog", "title": "Objections can not delay consumer case verdict", "id": "b5acce6e-2291-4068-8f04-ab67de5b882a", "content": "Objections can not delay consumer case verdict\rObjections can not delay consumer case verdict FIRST PHASE In the consumer complaint case the party which files the case is called the Complainant and the party against whom the case is filed is called the Opposite Party / Opposite Parties. To cause a delay in the case of complaint by the Complainant the Opposite Party often raises Preliminary Objections. These objections may be the issues like limitation period under the law of limitation, jurisdiction of the consumer court, maintainability of the case among others, without touching upon the crux of the dispute – and demand that these be heard first and decided by the consumer court. Preliminary Objections may delay the proceedings of the case and thereby increasing the cost of litigation, leaving aside the main dispute. After resolving of the preliminary objections only, the main case is taken up on merits of each individual case. Objections can not delay consumer case verdict SECOND PHASE To delay the verdict, the Opposite Party then files Appeal against the Orders given by the consumer court on preliminary objections which had already been raised by the Opposite Party in the 1st phase. This technique is adopted by the Opposite Party to wear out the Consumer or the Complainant till the higher Courts. Some times, the Consumer becomes hopeless of the judgments and sometimes, the consumer blames his Advocate for not taking up the case before the consumer in proper manner. – CONCLUSIONS The only remedy for the Consumer in such cases is that, they should not allow piecemeal multiple rounds of dates on part issues. If the consumer insists that the Opposite Party must give detailed reply to the complaint filed by the Consumer, such objections cannot delay consumer case verdict. – IN CASE OF ANY QUERY OR ASSISTANCE REQUIRED, LEAVE A REPLY BELOW – Related PostsPeriod within which consumer complaint be lodgedComplaint under Consumer Protection ActDefect or deficiency in a Consumer DisputeConsumers of car parking in co-operative SocietyConsumer Protection Cell Dwarka New Delhiparking problem and parking charges discussion or action Related About the authorAdvocateji is a forum, which publishes problems of public & provides free advice on its web-site.", "source": "Advocateji"}