{"published": "2015-09-05T11:30:46Z", "media-type": "News", "title": "Rome International Film Festival returns Sept. 10-13 with lineup celebrating music and film", "id": "ba35c128-561c-4f8d-9d5f-2e00291b91c9", "content": "The Rome International Film Festival (RIFF) returns next weekend, Sept. 10-13, for its 12 th  year at the DeSoto Theatre in Rome. \n \n“We are very excited about the quality of this year’s films and filmmakers and are looking forward to making it the most memorable festival yet,” said Seth Ingram , RIFF Executive Director. \n \nThis year RIFF received over 500 film submissions from 58 countries across the world. Out of hundreds of notable entries, RIFF will screen 83 films comprised of documentaries, narratives, and short films. \n \n“Seth has done an amazing job as Executive Director and we believe that this year will be the best festival yet,” said Randy Quick , President of the RIFF Board of Directors. \n \n“If you like great films, great music, and being around creative and talented individuals you are not going to want to miss this year’s film festival. I’m really excited that many of the directors will be attending with their films. Rome has such an amazing arts community for a small town,” said Ingram. \n \nThursday, September 10 – A Musical Moment \n \nThe first night, sponsored by Harbin Clinic, the film festival will center on music and film, with a special performance by the Rome Symphony Orchestra. Along with playing an original score behind the Charlie Chaplin film “Work,” the Rome Symphony Orchestra will play popular musical scores from famous films. \n \nFollowing the Rome Symphony Orchestra’s performance, the festival will officially open with the screening of two short films and the award-winning Swedish film “Mousse.”  Director John Hellberg will be in attendance. \n \nFriday, September 11 – Something for Everyone   \n \nThe second day of the festival will feature a wide variety of films to attract every interest. After an early-morning block of family-friendly short films, the festival will continue with a block of several foreign and domestic short films representing films and filmmakers from across the world. \n \nAt 11 a.m. a film industry workshop will be held at the upstairs room above Old Havana Cigar Company. The panel will be led by writer and producer, retired Command Sgt. Maj. Eric Haney. \n \nThe evening screenings will feature the documentary “Blood, Sweat and Beer,” which coincides with the Rome Area Council for the Art’s annual Beer Fest, an event that will feature 20 local and regional Georgia breweries. Directors Chip Hiden and Alexis Irvin will be present for the screening. “Wildlike,” an acclaimed drama, will follow the documentary. Director Frank Green will be on hand for a question and answer session following the film. \n \nThe highlight of Friday evening will be the world premiere of the Georgia independent film produced by Rome High School graduate, Drew Sawyer , and feature film directorial debut of upcoming director Andrew Donoho , “Heavy Water.” The film features the debut of former pro wrestler Jake “The Snake Roberts” as the film’s lead antagonist. Members of the cast and crew members will be in attendance. \n \nFriday’s features will conclude with the festival’s traditional block of of horror movies shorts. Hosted by Blair Richardson as Blair Bathroy, horror hostess of the newly created web horror series “Fear Haus,” the horror block will feature films ranging from horror comedy, to suspense and gore until early Saturday morning. \n \nSaturday, September 12 – Musical Memoirs   \n \nSaturday’s programming features films of all kinds, including blocks of short films, narratives, features and documentaries. \n \nAt 11 a.m. in the upstairs room above Old Havana Cigar Company, acclaimed casting director, Shay Bentley Griffin and independent Emmy award-winning filmmaker, Fran Burst-Terranella will lead a film industry discussion panel focusing on women in film and producing films in Georgia. \n \nSaturday’s finale will be the Georgia premiere of the highly anticipated music documentary “Heartworn Highways Revisited.” The film explores lives of folk and country music singer-songwriters, harkening back to the original “Heartworn Highways,” a film produced forty years ago that has been called one of the most important musical documentaries of the last century. \n \nSpecial guests, producer Graham Leader, director Wayne Price, and musicians Bobby Bare Jr. and Josh Hedley will also be in attendance. \n \nAfter the screenings, there will be a reception held at nearby the Seven Hills Room, followed by the juried awards ceremony and musical performance by Bobby Bare Jr. and Josh Hedley in the Desoto Theatre. \n \nSunday, September 13 –Finishing with Sound \n \nThe last day of the festival will begin with the documentary “Paradise Garden,” a film about the life of Summerville artist Howard Finster . The movie will be accompanied by a small art display of Finster work. \n \nDuring the documentary block on Sunday afternoon, “Dancing in the Crossroads: the life and art of Susan Gilbert Harvey”, a documentary about Rome artist Susan Gilbert Harvey , will be shown at 3:20 p.m. \n \nBrian S. Armstrong directed, produced, and edited the documentary about Susan Harvey’s sculpture and performance art. Archival footage shows Romans celebrating the Spring Equinox Egg Stand ( Standing Ovation) on Clock Tower Hill, and the humorous Dotty Birds performance in 1992.  Harvey has been described as “iconoclastic, off-beat, quirky, and brilliant.” \n \nLastly, the festival’s closing feature will be the music documentary “How Sweet the Sound – The Blind Boys of Alabama,” a film about the journey of the legendary musical group. Direct Leslie McCleave will be in attendance. \n \nComplete RIFF schedule \n \nTickets   \n \nTickets will be $6 per two hour block or $15 for a day pass. Saturday’s schedule of events that include Heartworn Highways Revisited, the Awards Reception, and a concert is a separate $25 ticket.  Some patron tickets will include access to special events like the Opening Night Reception or the Saturday evening Reception and concert. Tickets can be bought in advance at www.riffga.com or at the Desoto Theatre Box Office the day of, if tickets are still available. A full schedule is available on RIFF’s website. \n   Related", "source": "Hometown Headline"}