{"published": "2015-09-21T05:00:41Z", "media-type": "Blog", "title": "Both Sides of an age old argument – never the twain shall meet", "id": "dbf7b001-3a6a-48a2-ba87-d918779f6755", "content": "You are here:\rHome\rNews Both Sides of an age old argument – never the twain shall Both Sides of an age old argument – never the twain shall meet By: Admin category: News 2\t0 Two letters which appeared recently in The Bolton News which nicely illustrate the wide divide, the age old argument between which often exists between landlord and tenant.  Widely exploited by the media, the rift is often capitalised on by politicians and exacerbated by the use of misleading statistics – ‘twas ever thus… “…The simple fact of the matter is that private landlords make an awful lot of money from housing benefits and peoples (sic) salaries… the idea that most private landlords provide a good and affordable service to their tenants is simply not true. “In the UK private landlords make £77.7 billion pounds a year, four billion more than the entire GDP of Morocco. They are also subsidised to the tune of £26.7bn in tax breaks and housing benefit. The cost of landlord subsidies to Britons is £1011 per household (Sources: Guardian) “Whilst there are no doubt some good private landlords who do look after tenants so to speak, the sector is in need of regulation and if rent rises continue the way they are doing when buy to let mortgage repayments are low, then private landlords should be made to improve their properties with any rent rise that they slap on their properties. We only have to look at the state of a great many privately let houses in Bolton to see that there is something wrong.” Steve Jones\nMorris Green\nBolton Reply – I read Steve Jones’ letter regarding “rents rip-off”. “He seems to be under the impression that private tenants receive the full amount of their rent from housing benefits and that “rip-off” landlords are profiting from the benefits system. “He should be aware that the Local Housing Allowance which is paid in Bolton is a set figure based only on the bedrooms required by the tenants and their family circumstances. In many cases, tenants have to make up the shortfall between their Local Housing Allowance and the actual rent payable. “Capping rents will not reduce benefits payments but will almost certainly add to the housing shortage by reducing the numbers of private rental properties available since properties in the social sector are insufficient to meet demand. “The majority of...\nprivate rental landlords are people like myself, who have invested their pension lump sums to provide themselves with an income in retirement. They, quite rightly, expect to have a reasonable return for their investment and if this is prevented by rent capping, they will look elsewhere for investments and will not be purchasing property. Landlords do not make vast fortunes from their rented property. “They have to maintain their property to suitable standards, making sure that the property is safe and habitable. They also run a high risk from tenants who run up large amounts of arrears of rent and damage to property and landlords have to pay expensive legal fees to get their property back from tenants who refuse to pay their rent or to move out. “So you see Steve, it is not ‘all beer and skittles’ for most of us, as you call “rip-off” landlords. “The majority of us charge reasonable rents and are responsible people who care about our tenants. There is no such thing as ‘a free lunch’ or a ‘free roof over your head’. Someone is footing the bill. You would not expect to go to the supermarket and get free groceries. They expect to make a profit on what you buy and so do landlords on their investment. Stop landlord-bashing. The majority of us provide decent homes for people, expecting only a reasonable return on our investment. Sharron Howard\nBuckley Lane\nFarnworth ©LandlordZONE® – legal content applies to England and is not a definitive statement of the law, always seek professional advice. If you have questions on these issues go to the LandlordZONE® Forums\nRelated content: Government Denies PRS Support for Housing Social Tenants Shadow chancellor U-Turns on Labour PRS Policy Landlords suffer from too much unfair bad press Benefit Cap could hit private landlords Tags: Housing Benefit, landlord and tenant, LHA, Statistics Your Comments\rYour email address will not be published. Required fields are marked. *\rName\rHuman Verification *\n× 7 = fourteen\tComment\rCancel Comment", "source": "LandlordZONE"}