{"published": "2015-09-17T09:17:55Z", "media-type": "News", "title": "Lily Allen insists she is 'in control' after split from management team", "id": "24bab2d0-45de-48fa-a4e1-50d9722e143b", "content": "Lily Allen has said she is \"very in control\" of her life after reports that friends were concerned over her lifestyle. Sources close to the singer were said to be worried about Lily's spending habits and partying after it emerged she had parted ways with her management team.\n\n\"I'm not entertaining the absolute rubbish the papers are smearing me with. Rest assured, I am fine, very in control of my life, music on the way,\" Lily tweeted on Wednesday morning, adding: \"The harder you push me the more determined I am to prove you wrong.\"\n\nVIEW GALLERY \n\nLily Allen has split from her management team\n\nIt was revealed on Wednesday that Lily had split from her managers Scott Rodger and Henry Village after less than a year of working together.\n\nA spokesperson for the singer confirmed the news, saying: \"It's true that Lily has parted company with her managers Scott Rodger and Henry Village and the decision to split was both mutual and amicable. There is no comment regarding her personal life.\"\n\nThe split came as friends voiced their concerns for the mum-of-two, with sources close to the star saying that she is spending and partying too much lately.\n\nBubbles @ #FUNLORD #bestival with @iammarkronson\n\nA photo posted by Lily Allen (@lilyallen) on Sep 14, 2015 at 3:55am PDT\n\nFriends are said to be concerned over Lily's lifestyle\n\n\"Everyone is incredibly worried but she just won't listen,\" a source told The Sun, adding that although she earned a substantial amount from her third studio album Sheezus and tour, people are worried about how much money she has been spending.\n\n\"Her fashion budget alone is about £30,000 a month and that's not sustainable now that there's no music release or new tour on the cards for some time.\"\n\nLily has also faced rumours that she has separated from her husband Sam Cooper, with whom she has two daughters – Ethel, three, and Marnie, two – however the family put on a united front by attending Notting Hill Carnival together in August.\n\nThe 30-year-old shared two photos of her girls dressed in matching tracksuits and trainers, enjoying some ice cream with their dad. \"Happy fams,\" Lily told her fans.\n\nDespite claims that she often spends long periods of time away from her family, Lily has insisted that they often join her on tour, telling iD magazine: \"When I wasn't with them it was really hard, and when they were with me, it was amazing.\"", "source": "MSN UK"}