{"published": "2015-09-29T13:02:00Z", "media-type": "News", "title": "Barola's Bra for Life Empowers Breast Cancer Survivors with Body Confidence", "id": "6dfddb45-e1b0-4c64-9c83-ee83875aa25f", "content": "SOURCE Barola Inc.\n\nSports Bra Line Designed for Survivors by Survivors\n\nBATON ROUGE, La. \n\nPhoto - http://photos.prnewswire.com/prnh/20150928/271283 Photo - http://photos.prnewswire.com/prnh/20150928/271284 \n\nDesigned with the help of breast cancer survivors, surgeons, bra fitters, and sport bra designers, Barola bras encompass stylish, comfort, and bra confidence. The Bra for Life provides functional fashion, ideal for women who wear breast forms without the worry of them moving or falling out during activity. \n\n\"Barola's Bra for Life was created to honor my mother's own courageous battle with breast cancer, and to support other women enduring the fight of their lives,\" stated founder Kristen Airhart \n\nNamed for two breast cancer survivors, Barola's Melissa and Tabby bras are pocketed and worn with or without breast forms, and have adjustable straps with a velcro closure. The soft, supportive bras are made in the USA \n\n\"I find the fit to be fabulous, and there isn't one thing that I could think of to improve this bra. It's so comfortable I almost don't want to take it off,\" states Melissa Wyatt \n\nMelissa personally found the double hook and eye design with adjustable band –– named the Melissa –– provided the most comfort due to her fluctuating breast size as a result of weight gain from chemotherapy. Alternatively, the Tabby has a zipper front closure. Both bras give women of all shapes and sizes from 2-2x a sleek, beautiful, and supported fit there is comfortable enough to wear while exercising, on the go, sleeping, or traveling.\n\n\"When you can put on a stylish, sexy sports bra it lifts your spirits and helps you push through the daily activity,\" said Tabitha Vona \n\nPromoting wellness and functional fashion is the ultimate goal of Barola and its two adjustable, front closure bras that provide a custom, comfortable fit. Barola's Bra for Life is suited to the fitness-minded woman looking for the right support to complement her active lifestyle in the effort to maintain optimal health. For more information or to purchase, visit barolainc.com. \n\nAbout Barola \n\nBarola Inc., is more that just a bra company. It was started by a woman on a mission to promote wellness in women. Barola's specialty sports bra line was designed specifically for breast cancer survivors, and women facing challenges at all stages of life looking to feel comfortable and confident, while staying active. Its Bra for Life pocketed, front closure sports and compression bras keep breast forms in place, empowering women who have undergone breast related surgery, experienced asymmetry or fluctuating breast sizes, and who are pregnant or nursing, to seize the day and maintain optimal health. All Barola bras are made in the USA \n\nContact:\n\nAlison Foster \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/barolas-bra-for-life-empowers-breast-cancer-survivors-with-body-confidence-300150486.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WAFB"}