{"published": "2015-09-24T21:31:18Z", "media-type": "News", "title": "Aussie celeb Hugh Sheridan says Gympie 'really beautiful'", "id": "8eb3864c-4aa4-48a7-9518-c3e562eaf665", "content": "RANDOM Hugh Sheridan sightings during the filming of Boar last month set more than a few hearts aflutter in the Gympie region, and now the Aussie star has further endeared himself to our region by talking us up on national television. \n \nHe told Larry Emdur and Kylie Gillies - and all of Australia - on The Morning Show last week that when he first heard he would be filming for the horror film near \"Gympie\" he asked \"where's Gympie?\" \n \n\"But we travelled around that region and it's actually really beautiful,\" he said in the interview. \n \n\"It's amazing.\" \n \nHugh went on to tell Larry and Kylie he spent all of his down time during the filming exploring the region, especially nearby coastal spots and, as a few lucky locals experienced, the local watering hole and shopping centre. \n \nThe multi-talented \"nice bloke\" is also - serendipitously - the face of the Nestlé Choose Wellness Movement, which encourages Aussies to improve their lifestyle through a balanced diet, regular exercise and a positive attitude. \n \nThe Nestle factory in Pine St is a large employer and industry in Gympie. \n \nHugh described Boar in the Morning Show interview as a \"crazy, exciting horror film\" and said John Jarratt actually plays a \"nice guy\" in the film, whereas he (Hugh) plays a character everyone will hope gets killed. \n \nHugh is home from the United States to lead the Nestlé Choose Wellness Roadshow from now until October 10. \n \nHe became a household name playing Ben Rafter on Packed to the Rafters, but is also an accomplished singer, dancer and wildlife warrior, and will this year compete in the New York Marathon for the Australian Wildlife Conservancy. \n \nThe Nestlé Choose Wellness survey asked people from across the nation about their emotional and physical well-being and discovered Baby Boomers were the most physically active of any other generation and were one-third more likely to do physical activity than other generations. The Movement \"is about you, making a choice today for a healthier tomorrow,\" Hugh says.", "source": "Gympie Times"}