{"published": "2015-09-24T16:50:00Z", "media-type": "News", "title": "Clarkson and Hammond prepare for new show — but where is James May?", "id": "5facf037-e8e9-496e-b500-a17958e1a93b", "content": "JEREMY CLARKSON'S new show has something missing at the moment — James May. \n    \n\r WENN \r \n\r NEW GEAR: Richard Hammond, Jeremy Clarkson and James May \r \nThe original Top Gear team will be moving to Amazon Prime, but are currently working on their new show without May – who is busy doing \"other stuff\". \n\nClarkson, 55,  confirmed that May, 52, has not yet joined him, Richard Hammond and producer Andy Wilman at work. \n\nClarkson, who was sacked by the BBC earlier this year, tweeted: \"To be clear, May is busy with other stuff but Hammond, Wilman and I are extremely busy putting our new show together. \n\n\"Much is already sorted. \n\n\"Sorry about the lengthy absence from Twitter. These are very very very busy times. Fun though. \n\n:To be even more clear, filming starts in a couple of weeks. And yes, all of us will be involved.\" \n \nThe iconic trio will front a new show – which is currently without a name – for Internet retail giant Amazon. \n\nOn Wednesday, May discussed the new show, rumoured to be called 'C**** in Cars'. \n\nHe said: \"We haven't got a name. We haven't decided on the content ... any of that stuff. So, honestly, nothing, nothing has happened.\" \n\n\r WENN \r \n\r SPLITTING UP: Clarkson, Hammond and May live in Sydney \r \r \nAmazon Prime is reported to be paying the Top Gear hosts £160million for the show. \n\nClarkson was axed from the BBC after a fracas with one of the show's staff. \n\nThe controversial TV star punched the producer and –  despite a petition calling for him to stay  – the BBC was forced to act. \n\n\r WENN \r \n\r DON'T GO: Over a million Jeremy Clarkson fans signed a petition to make the BBC keep him \r \nThe Stig himself delivered the petition to parliament — complete with a Top Gear style tank. \n\nThe petition failed with Clarkson himself saying it never would have worked. \n    \nJames May and Richard Hammond were reportedly offered £1million a year to stay with Top Gear. \n\nBut the pair stuck by their pal and quit. \n\nThe iconic BBC show will return in the spring and will be hosted by Chris Evans. \n\n\r WENN \r \n\r STICKING AROUND: James May will still appear in the show", "source": "Daily Star"}