{"published": "2015-09-26T05:54:17Z", "media-type": "News", "title": "This Day in Rock History: September 26", "id": "ed5d7aa4-2911-44dc-b82c-2b8716f7b9d8", "content": "On this day in rock history, the Beatles released Abbey Road. It was the last album of new material they recorded together although Let It Be would be released later. \n\nCoincidentally, John Lennon gave us Walls and Bridges five years later. It was recorded in Los Angeles during his “Lost Weekend” and featured Lennon’s only solo No. 1 hit, the Elton John collaboration, “Whatever Gets You Through the Night.” Motley Crue’s Shout at the Devil was their second effort and gave them their first charting singles in “Looks That Kill” and “Too Young to Fall in Love.” David Bowie reunited with Brian Eno for Outside, which was a concept album about a futuristic dystopia. \n\nBallbreaker saw AC/DC work with Rick Rubin and bring drummer Phil Rudd back into the group. The Velvet Underground’s Peel Slowly and See packaged their four studio albums with Lou Reed and previously unreleased material together inside a five-CD boxed set. Roger Waters released Ca Ira, an opera about the French Revolution. \n\nTensions between Roger Daltrey and Keith Moon boiled over, with the Who singer breaking the drummer’s nose. Daltrey was fired from the band, but reinstated when it was determined he was too valuable to the rising group. \n\nWatch an exciting recap of many of the day’s biggest rock anniversaries above, narrated by our radio host Zach Martin. And learn more about these important events by clicking the links below. \n\nNews Anniversaries: \n\nRoger Daltrey gets fired from the Who after punching Keith Moon (1965) \n\nAlbum Anniversaries: \n\nThe Beatles, Abbey Road (1969) \n\nJohn Lennon, Walls and Bridges (1974) \n\nMotley Crue, Shout at the Devil (1983) \n\nDavid Bowie, Outside (1995) \n\nAC/DC, Ballbreaker (1995) \n\nVelvet Underground, Peel Slowly and See (1995) \n\nRoger Waters, Ca Ira (2005) \n\nClick here to read full story »", "source": "95.5 KLOS.com"}