{"published": "2015-09-18T06:58:33Z", "media-type": "Blog", "title": "Quality Management System Representatives (QMR) Skills Development", "id": "998007f9-0ef6-4416-9725-fab1ac3645bf", "content": "Quality Management System Representatives (QMR) Skills Development Quality Management System Representatives (QMR) Skills Development\nHotel Merapi Merbabu, Yogyakarta | 13 – 15 Oktober 2015 | Rp. 8.500.000 per peserta\nHotel Merapi Merbabu, Yogyakarta | 17 – 19 November 2015 | Rp. 8.500.000 per peserta\nHotel Merapi Merbabu, Yogyakarta | 16 – 18 Desember 2015 | Rp. 8.500.000 per peserta ABSTRACK TRAINING QMR (Quality Management System Representatives)\nQuality Management System ISO 9001:2000 require the appointment of a Quality Management Representative (QMR) who is responsible for overseeing the implementation of the company’s system, interfacing with the thirdparty registrars and reporting on the system’s effectiveness to management.\nThis Training enables you to gain fresh idea and enhance your effectiveness as a QMR. OUTLINE  TRAINING QMR (Quality Management System Representatives) QMR roles and responsibilities Review of QMS ISO 9001:2000 Managing the development and implementation of QMS Managing the maintenance of QMS Process Mapping Concept Creating an effective documentation Internal auditing concepts and case study Capturing nonconformities that will drive business improvement versus compliance Effective corrective and preventive action systems Conducting effective management reviews Managing the relationship with the Third Party registrar before and during the audit(s) Managing the process for Continual Improvement PARTICIPANT Quality Manager / QA Manager Quality Management Representatives (QMR) Someone that is newly promoted as QMR or prepared as QMR ISO 9001 Implementer team INSTRUCTOR\nSri Indrawati, ST, MEng     DATE AND VENUE Hotel Merapi Merbabu Yogyakarta 13-15 Okt, 17-19 Nov, 16-18 Des 08.00 – 16.00 WIB   TUTION FEE Biaya Rp. 8.500.000 per peserta (Non Residential). FACILITIES\nTraining Modules, Training Kit, Certificate, Exclusive Souvenir, Dinner & City Tour, Coffee Break & Lunch Formulir Permintaaan Informasi Lanjutan / Pra-Pendaftaran Public Training INFORMATION OPTIONS Judul Training(required) Tanggal Training Select a message type (required) PERSONAL DATA Your Name(required) Job Title(required) Company(required) Company Address Email(valid email required) Mobile Phone(required) Office Phone(required) Extention No. Facsimile (Fax) Website PRE REGISTRATION DATA (Tidak Mengikat) Penanggung Jawab Training di Perusahaan Email Office Phone+Ext atau No. Handphone Jumlah Peserta(required) Nama-nama peserta Payment Method MESSAGE FOR TRAINING PROVIDER Pesan untuk penyelenggara Training CC this registration / message to me   cforms contact form by delicious:days", "source": "CENDEKIA CENTRE"}