{"published": "2015-09-02T03:30:52Z", "media-type": "Blog", "title": "Re: [Everything doTERRA] Re: Need convention ticket and room for male team mate", "id": "4b4f15e2-e4e1-4970-8e69-b0840a5eeb3c", "content": "How much is the room? \nSent from my iPhone\nOn Sep 1, 2015, at 8:17 PM, Chriss <lewisch2@gmail.com> wrote:\nWe just go notice that a team member will not be able to go to convention due to illness.  We have one ticket and a room with 2 queen size beds at the Howard Johnson for Wed, Thurs, Fri, Saturday of convention.  We are going to cancel the Saturday night for our rooms and now going to cancel that room all together.  That will happen tomorrow unless someone wants to grab this by then.  Text or call me at 208-241-5626.\nOn Sunday, August 30, 2015 at 5:20:31 PM UTC-6, Carolyn Mosher wrote:I have a\nTeam member that wants to go to convention. He is finding that this is going rather well for him. Is there a way to still\nGet convention ticket and does anyone have a place for him to stay. He is single and a great guy smart and computer guy. Please let me know. Thank you. -- You received this message because you are subscribed to the Google\nGroups \"Everything doTERRA\" group.\nTo post to this group, send email to everythingdoterra@googlegroups.com\nTo unsubscribe from this group, send email to\neverythingdoterra+unsubscribe@googlegroups.com\nFor more options, visit this group at\nhttp://www.everythingdoterra.com\n \nDO NOT REPOST EMAILS FROM THIS GROUP. ESPECIALLY WITH E-MAIL ADDRESSES INCLUDED . RE-POSTING TO A PUBLIC BLOG OR FORUM, MAKES THE CONTENT NON-COMPLIANT.\n--- You received this message because you are subscribed to the Google Groups \"Everything essential\" group.\nTo unsubscribe from this group and stop receiving emails from it, send an email to Everythingessential+unsubscribe@googlegroups.com.\nTo post to this group, send email to Everythingessential@googlegroups.com.\nVisit this group at http://groups.google.com/group/Everythingessential.\nFor more options, visit https://groups.google.com/d/optout.", "source": "mom power"}