{"published": "2015-09-13T06:36:34Z", "media-type": "News", "title": "Sheldon wins tourney title", "id": "0e6443b1-6d24-4990-b4a9-3152b2f40e37", "content": "PORTLAND — Sheldon won three matches in the championship round on Saturday to win the title at the Central Catholic volleyball tournament. \n \nThe Irish defeated the host Rams 25-20, 26-24, then defeated Southwest Conference rival Roseburg 25-16, 25-20 and West Albany 25-19, 25-17. \n  \nAvery Housley had 54 kills and 25 digs in the tournament’s five matches. \n \nJenna Kuehn had 102 assists. Emma Peters added 26 kills and 25 digs, and Mackenzy Borek had 18 kills and 14 blocks. \n \nAlso Saturday \n \nLaura Sullerton had 10 kills and Zoe Chamness had 25 assists for South Eugene in a 25-19, 13-25, 15-7 win against Crater in the championship match of the South Eugene Tournament. The Axemen also defeated Churchill (25-13, 25-23), and South Medford (25-17, 25-16) on Saturday. \n \nHannah Wheeler and Cassie Cunningham had five kills apiece to lead Creswell to a 25-10, 25-14 victory over Dayton in the championship game of the Dayton Tournament. In the semifinals, Josie Bohman had seven kills and five aces and Cassie Cunningham had six kills to lead Creswell to a 25-16, 25-9 victory over Monroe. McKenna Cunningham added 17 assists in that game for the Bulldogs. \n \nWest Salem defeated Marist, 16-25, 20-25, 25-19, 19-25. Claire Hoffman had 24 kills, 17 digs, one block and one ace for the Spartans, and Anna Houser had 23 digs. \n \nMarist defeated St. Mary’s Academy in straight sets, 25-12, 25-12, 25-20, led by Claire Hoffman’s 18 kills, eight digs and two blocks. Joie Pascoe-Long had 13 kills and seven blocks. Taylor Gibson had 37 assists. \n \nDani Baker has 12 kills and 32 digs, Kalli Frieze had 13 kills and 19 digs and Taylor Huckins had 20 digs for North Douglas in a combined three matches at the Reedsport Les Schwab Invite. The Warriors los all three matchs, falling to Kennedy (25-21, 25-15), Oakridge (25-21, 25-18) and Days Creek (26-24, 25-21). \n \nFootball \n  \nNonleague \n \nYoncalla 64, Days Creek 16: Zack Van Loon scored four touchdowns, including one on an interception return, and Noah Loeliger also scored four touchdowns, three rushing, to lead the Eagles over the Wolves. Will Shaw threw three touchdowns passes for Yoncalla (2-0). \n \nLowell 40, Camas Valley 24: The Red Devils held the Hornets to eight points in the second half to cruise to their first win of the season. The game was played as part of a triple-header at North Bend High School. \n \nBoys Soccer \n \nJunction City 8, Douglas 2: Josh Hutchinson scored three goals and Colton Ditlesson also had a pair for the Tigers, who trailed 2-1 in the first half before scoring seven unanswered. Isaac Potter, Seth Bolton and Brandon Land also scored for Junction City.", "source": "Register-Guard"}