{"published": "2015-09-25T03:04:33Z", "media-type": "News", "title": "'Pan' director defends Tiger Lily casting decision", "id": "135f2268-1e6d-4ce8-9fbb-da4335171dc8", "content": "Joe Wright's controversial decision last year to cast white actress Rooney Mara as Tiger Lily in his live action Pan prompted a petition to movie studio Warner Bros . that has collected some 94,000 signatures. \n \nThe petition, titled 'Warner Bros: Stop casting white actors to play people of colour!', was launched when the casting decision was announced. \n \nWright said the defining image of Tiger Lily as a Native American came largely through the 1953 animated Walt Disney version of Peter Pan . \n \n\"Tiger Lily is the bad-ass warrior who is far more pro-active physically in defeating (evil pirate) Blackbeard than any of the boys.\" \n  \nScottish writer J.M. Barrie's century-old play and novel refers to Tiger Lily and her tribe as \"pickaninny\" warriors - a non-specific but racist term usually used to describe people with dark skin. \n \nWright's movie Pan , a prequel to the Peter Pan, depicts Tiger Lily as a warrior princess and gives her more authority and fight scenes than any of the men in the film. \n \n\"I was particularly keen to make sure Tiger Lily wasn't a damsel in distress,\" Wright told Reuters. \"Tiger Lily is the bad-ass warrior who is far more pro-active physically in defeating (evil pirate) Blackbeard than any of the boys. She has all the action sequences.\" \n \n\"When little girls come out of seeing the movie, their favourite character always is Tiger Lily. When asked why, they say 'because she can do anything.' I think she is quite an empowering character for little girls and that to me is really gratifying,\" Wright said. \n \n\"I liked the idea they were indigenous people who were fighting against the colonialist rule of Blackbeard... I can understand how it appears from the outside perspective.\" \n  \nWright said Mara was chosen because she has \"a regal quality and also she's a little bit frightening - you really wouldn't mess with Rooney\". \n  \nWright cast dozens of black, Indian, Korean and other nationalities to make up Tiger Lily's tribe in Neverland. \"I liked the idea they were indigenous people who were fighting against the colonialist rule of Blackbeard,\" he said. \n \n\"I can understand how it appears from an outside perspective,\" Wright said of the upset over Mara's casting. \"But when people see the film, they get it.\" \n \nPan is in cinemas now. \n Watch the trailer for Pan:  \n[embedded content] \n See more SBS Movies trailers  See more SBS Movies news  \nRecommended", "source": "Special Broadcasting Service"}