{"published": "2015-09-05T13:13:34Z", "media-type": "News", "title": "Sweet taste of success for care home", "id": "285b65c3-a8ec-4778-91ff-69c15f18b794", "content": "A TULLIBODY care home is “delighted” to have received an Eat Safe Award from Clackmannanshire Council. \n \nThe Orchard Care Home, run by HC-One, was handed the accolade during a special presentation last Wednesday morning. \n \nThe award is given to food businesses that have achieved standards of food hygiene which surpass legal requirements. \n \nIt is managed by Food Standards Scotland and administered in the Wee County by the local authority’s Environmental Health Team which is responsible for regulating food businesses. \n \nThe Orchard’s award was presented by the Provost and local councillor Tina Murphy, in the main dining room in front of residents. \n \nManager Jane Aitken, said: “The Orchard is delighted to have received this award from Councillor Tina Murphy. \n \n“I am extremely proud of the level of food hygiene within The Orchard, and the level of hard work and commitment that the cook, Susanne Stirling, and all the kitchen staff display.” \n \nProvost Murphy, added: “I was delighted to present the award as it pays tribute to the high standard of food preparation at The Orchard. \n \n“Good food is essential as we get older and it is clear that Susanne and staff take this seriously. The award was achieved by the hard work and dedication from The Orchard’s cook and kitchen staff.” \n \nAlongside the Eat Safe Award, the team at The Orchard were also pleased to have received an excellent report from the Care Inspectorate. \n \nThe report shows that the home received the top mark in five of the eight categories. \n \nHC-One is also celebrating achieving a 9.3 average rating on the sector’s leading care home comparison website carehome.co.uk. The high rating puts HC-One homes into the very best company in the care home sector.", "source": "Alloa & Hillfoots Advertiser"}