{"published": "2015-09-17T22:15:00Z", "media-type": "News", "title": "In the presence of my enemies", "id": "3c3717dc-d409-477a-8afc-017785fee3a5", "content": "The Gantt Report By Lucius Gantt \n \nFrederick Douglass once said, “You can’t get crops without plowing the land”. Samora Machel said, “You can’t get tea without boiling the water”. And, The Gantt Report has written on numerous occasions that “You can’t get wine without stomping the grapes”! \n \nWell, some say Lucius Gantt is all of that, a plower, a boiler and someone that will figuratively and, in a literal sense, stomp the life out of a devilish beast! \n \nIn my mind, all I am is someone that cares. I am not afraid to stand up and speak about issues that are important to me, my people and my community. \n \nI would imagine that I have a whole lot of enemies. I say imagine because my enemies never step up and tell me that but I’m smart enough to know I have enemies and so does everyone that took the time to read this column. \n \nAn enemy is someone that wishes to injure you in some way, a foe or someone that may be hostile to your idea, your cause or to your people. \n \nYour enemy doesn’t want you to improve, doesn’t want you to progress and doesn’t want you to thrive! Your enemy wants to put you in check, keep you weak, hold you down, exploit you, oppress you and subjugate you. \n \nThe worst kind of enemy is a hater. They hate the truth, hate how you act, hate how you talk, hate your family, hate your friends and hate what is important to you and what you believe in. \n \nSome haters are “frienemies” or people that pretend to be your friend but are really your enemy. A frienemy claims to know everything about you. They pose as your redeemer, act like they are your supporter, suggest that they are your benefactor and pretend to be your ally. The haters claim to know your flaws, your faults, your errors, your mistakes, your shortcomings, your weaknesses and your fears but if they would just look into a mirror they would see those things in themselves! \n \nDon’t be scared of your enemies. If you live clean and let your works be seen your enemies won’t be able to kill you, hurt you or stop you! \n \nWhen your enemies look to harm you personally, professionally, spiritually or in other ways, if you’re a good man or a good woman you will be protected! \n \nWhen your enemies try to cut you off, shut you down, destroy your marriages and relationships, get you fired, try to put you out of business, success is always the best revenge! \n \nThe best way to quiet a hater is to do what you do and be very good at it. \n \nWhen you survive hate, when you defeat your enemies and become successful in spite of those persons with devilish intent and wicked ways, the table is being prepared! \n \nWhen the Bible says God will prepare a table for you in the presence of your enemies it encourages you to be strong, be brave and to tell your haters and enemies to their face to kiss your booty! \n \nThey can try to knock you down but they can never knock you out!  ( Buy Gantt’s latest book, Beast Too: Dead Man Writing on Amazon.com and from bookstores everywhere. Contact Lucius at www.allworldconsultants.net. And if you want to, “Like” The Gantt Report page on Facebook.)  \n \nBe Sociable, Share!", "source": "Westside Gazette"}