{"published": "2015-09-08T11:11:27Z", "media-type": "News", "title": "Blind Veterans UK aid 86-year-old blind Ellesmere Port veteran to rediscover love of fishing", "id": "922ec331-a538-4a05-822b-4d709e0dfba9", "content": "John Endres stopped fishing after his sight deteriorated due to age-related macular degeneration \nAn 86-year-old blind veteran from Ellesmere Port has rediscovered his love of fishing years after he was forced to stop his favourite past-time due to his severe sight loss. \n\nLifelong fisherman John Endres stopped fishing over eight years ago after his sight deteriorated due to age-related macular degeneration. \n\nAfter accessing support from the national Blind Veterans UK charity, John has now been able to cast his rod once more after attending a fishing week at the charity’s Llandudno centre. \n\nJohn said: “Once my sight went, I’d given up fishing because I couldn’t see to tie the flies anymore. \n\n“Being able to fish again with the help of Blind Veterans UK was brilliant, it felt really good to be doing something that I thought I couldn’t do anymore. \n\n“It was a really good week, I thoroughly enjoyed it, it was a marvellous chance to be able to fish again. \n\n“There was a good group of us on the week so it was great to get to know them all, we even had a small bet on who would catch the biggest and heaviest fish!” \n\nJohn joined the Army in 1947 and spent 23 years serving with the 4/7 Royal Dragoon Guards. \n\nAfter leaving the Army, he worked at the National Grid for 22 years. \n\nYears on, John noticed a problem with the sight in his left eye and was diagnosed with age-related macular degeneration in 2006. \n\nBecause of his time in service, John was eligible for support from Blind Veterans UK, but didn’t realise this until last year when a friend encouraged him to get in touch. \n\nAt the start of this year, John started to receive vital support to help him adjust to life with sight loss. \n\nJohn said: “Blind Veterans UK has renewed my life in a lot of ways. As well as helping me to fish again, they’ve helped me at home. \n\n“I couldn’t read my newspaper before so when I visited the centre for the first time I was given a CCTV magnifier which now means that I can put my newspaper underneath and read it again. \n\n“I also attended the annual lunch event that Blind Veterans UK held in Liverpool at Anfield which was really good. While I was there, I spoke to one of the staff about a keyboard with large keys for my laptop at home. \n\n“They provided me with one and I can now sit and type away all day! It’s really helped me to regain my independence.” \n\nBlind Veterans UK is the national charity for blind and vision impaired ex-Service men and women, providing vital practical and emotional support to help veterans, like John, discover life beyond sight loss. \n\nIf you, or someone you know, served in the Armed Forces or did National Service and are now battling severe sight loss call the charity on 0800 389 7979 or go to www.noonealone.org.uk . \n\nFormerly St Dunstan’s, Blind Veterans UK believes that no one who has served our country should have to battle blindness alone. \nAtlantic Drifters bring ocean rowing boat to Grosvenor Rowing Club Contact the Chester Chronicle Send a story The Editor Journalists", "source": "Chester Chronicle"}