{"published": "2015-09-08T04:28:48Z", "media-type": "News", "title": "Raizcorp, Nedbank to host SimplyBiz workshop for Cape Town entrepreneurs", "id": "78c095ff-890a-4f81-8b68-dd4b2a6b5b2a", "content": "South African business incubator Raizcorp in partnership with major local bank Nedbank will be hosting the SimplyBiz Shift Questions workshop in Cape Town 12 September. The workshop is part of a national effort to equip entrepreneurs with the tools needed to think differently about their businesses and accelerate success. \n     \nCEO of Raizcorp, who will also be facilitating the one-day session, explains that the SimplyBiz Shift Questions workshop will teach entrepreneurs to shift the paradigms of their thinking. \n \n“Many people have this notion that if they follow the exact steps that a successful entrepreneur took in their own journey, they too will become successful,” says Raiz. “As a young man, I asked my mentor what the secret was to becoming wealthy. Surely if it were as simple as reading a book on 10 steps to success everyone would be rich?” \n \nRead more:  Google SA invites women entrepreneurs for free workshop \n \nVanessa Singh from Nedbank Retail and Business Banking adds that the bank is proud to be associated with this initiative which seeks to unlock growth for businesses and introduce a new way of thinking in solving business challenges. \n \n[embedded content] \n \n“This encourages participants to ask themselves the critical questions, and hopefully come up with the right answers in order to shift the dial — and take their businesses to the next level,” says Singh. \n \nHaving completed the Shift Questions workshop in 2014, Vanessa Cox of Ntirho Business Consulting said that; “It made me re-look my current business model and make the relevant changes.” \n \nTickets are R1 750 a pop though we have five free ones to give away! If you can tell us why you deserve to attend the SimplyBiz Shift Questions workshop in Cape Town, you can stand a chance of attending the event for free. \n \nTweet us your answer by tagging @Ventureburn and using the hashtag #ShiftQuestions. If you’re not a big fan of using Twitter, you can always leave us a comment below this article. \n \nFor more information on the workshop, visit the Shift Questions website. \n \nImage via MyPR", "source": "Ventureburn"}