{"published": "2015-09-23T13:00:55Z", "media-type": "Blog", "title": "Capitalize on Video: Facebook’s New Emphasis", "id": "5771c056-68a8-41e1-a37d-aeee87811a2a", "content": "Are you getting your video fix on Facebook? More people are now turning to the social media channel to watch videos. According to the social media giant , there are one billion video views a day, with 65 percent of viewers watching on mobile devices.  \n \nFacebook is responding by putting a greater emphasis on videos. It isn’t just about likes and comments anymore. Facebook just announced that it will “monitor more video interactions.” In other words, Facebook plans to track whether or not viewers turn up the volume, make the video full screen or choose to watch a video in high definition. It also measures how long someone watches a video. \n \nAll of these improvements coincide with a slow progression of changes that Facebook has implemented over the past two years. In 2013, Facebook introduced an auto-play feature that triggers videos to play as soon as they’re scrolled up to the main screen. Back in September , Facebook started showing the number of video views next to its signature likes and comments. Now, Facebook even shares recommended videos that are similar to ones you choose to watch. \n \nWhat does this new emphasis on video mean for your small business? Here’s what you should be doing to capitalize on the all-important video audience : \n \n1. Produce simple videos \n \nIf your small business has stayed away from video creation, now might be the time to look into it. You don’t have to storyboard a full movie or hire a production crew to create shareable videos. \n \nHere are a few hassle-free ways to create original videos : \n  Use animation apps to create fun videos . Try GoAnimate or Wideo . Both have premade templates and user-friendly editors so you can create an animation from scratch.  Use tools to create a stop-motion video . Try Stop Motion Recorder to create a cool video like this .  Create a flashy text-based video. Use Nawmaul to create animated text. You can design sets and add your own voiceover too.  Explain what your business does through pictures. Use WeVideo to turn pictures of your product into a slideshow with text and music. Here’s an example .    \n2. Upload your videos directly to Facebook \n \nAfter you create a video, upload it directly to Facebook. Sharing a link to it won’t work; you have to upload the video right to your page. Doing so will allow Facebook to measure your audience and its interests. \n \n3. Measure and interpret your video metrics \n \nAs Facebook adds video to its list of priorities, it has also created a metrics sections so you can track your success. With this new dashboard component, you’ll see the number of views, how long people watched your video and track audience retention. Here’s a snapshot of what it looks like: \n \n\n \nHere are a few ways to use the metrics to create must-watch videos: \n  Video Duration . For your first video, create a video that’s under a minute and see how it does. Evaluate how long people watch the video and use that information to shorten or lengthen your next video.  Audience Retention . You’ll see a chart in your video metrics section that shows the level of interest viewers had at certain points of your video. If you see a spike in a certain topic, consider creating more videos that focus specifically on that subject.  Page Insights View . On the Page Insights View, you can see how many people clicked on a call to action. Make sure the call to action is easy to see and available to click for at least 10 seconds.  Consider moving the call to action closer to the beginning of the video to improve your stats.   \n4. Learn from the pros \n \nNot sure what kind of video to create? Take a cue from the pros. According to recent data , a UK company, LAD Bible , which posts funny, guy-oriented videos, leads the pack in video views with 1.6 billion views each month. A sports-based page, Sport Bible , lands 921 million monthly views. Both of these top-ranking sites use humor to attract viewers. Notice the video quality isn’t top-notch either. It’s more about the content than the production value. Take a look at some of their videos to find inspiration for your business. \n \nUsing these four tips, you’ll be able to attract more fans, improve engagement and increase brand awareness with Facebook videos. Remember, you don’t need a degree in video production to make a must-watch video. \n \nFor more great tips delivered to your inbox every Monday, subscribe to the VR Buzz newsletter. \n \n© 2015, VerticalResponse Blog . All rights reserved. Unauthorized use and/or duplication of this material without express and written permission from this blog’s author and/or owner is strictly prohibited. \n \nThe post Capitalize on Video: Facebook’s New Emphasis appeared first on VerticalResponse Blog .", "source": "VerticalResponse Blog"}