{"published": "2015-09-28T20:53:49Z", "media-type": "News", "title": "Cancun: A sunny paradise with something for everyone", "id": "e93184e9-0a71-4de9-b398-305c4fd0efa7", "content": "CANCUN - Like many places in the world, a trip to Cancun and the Riviera Maya is what you make it. Wanna drink your face off and slurp a sweet martini at Cocobongo? Knock yourself out. Prefer exploring Mayan ruins or a spot on the beach to bone up on Margaret Atwood’s latest book? There’s a cabana with your name on it. Rather scuba dive and race personal watercraft over the foaming blue waves? Pry your Visa card out of your wallet and pay up. \n \nHere’s a look at how various types of travellers can enjoy this popular sun destination. \n \nFOR FAMILIES \n \nThis is a very family friendly part of Mexico, with a huge variety of child-oriented activities and parks. XCaret is a kind of Mayan theme park near Playa del Carmen with a snorkeling river, cultural shows, a butterfly pavilion, turtle and dolphin pools and more. Wet ‘n Wild is a fun water park at the south end of the hotel zone with slides galore, as well as a dolphin show and a free meal combo with your ticket. I stayed a few years at the Barcelo Maya Beach Resort south of Playa del Carmen. It had more than enough action for my 20-something kids, with scuba diving, snorkeling and swim-up bars, but it wasn’t overly rowdy. They also had lots for smaller children to enjoy, with small water slides and splash pools. The Beach Palace Hotel offers all-inclusive programs with good food and an artsy feel, but they also have music nights and a very nice kids’ program. The town of Puerto Morelos has a small, central square with a playground and tons of restaurants that won’t kill a family budget. \n \nFOR BEACH LOVERS \n \nThere’s no shortage of great stretches of sand, so it pretty much depends on what you want. You’ll find a lot of young folks in the party zone of central Cancun. Things become a bit more G-rated near the family resorts. The beach at Tulum is one of the prettiest along the Riviera Maya, with icy blue water and silky sand backed by small cliffs. The beach at Playa Del Carmen attracts a variety of folks and has a nice offshore reef for snorkeling. Nearby Isla Mujeres has quiet beaches (try Playa Norte) and has tours where you can spot whale sharks frolicking in the water. \n \nFOR ANTSY, ACTIVE TYPES \n \nIf you’re like me, an hour of reading on the beach needs to be followed up with a long walk or an exploration of some kind. One great activity is a snorkel trip to see the MUSA underwater sculpture “museum,” an oceanic attraction where various works of art, including a guy on a couch eating a hamburger, have been placed on the sea bottom. Scuba gear would be good, but you can see a lot with just a mask and snorkel. Aqua World in Cancun offers guided tours of the museum with snorkel gear. There also are tons of places to rent a jet ski or fast-moving boat, or you can try parasailing in the large lagoon that sits between the Cancun strip and the Mexican mainland. The Mayan ruins also offer opportunities for long walks. You can rent bicycles for just a few bucks and ride around the ruins at Coba. You also can try a snorkel trip to one of the beautiful, freshwater “cenotes” that dot the Riviera Maya’s limestone landscape. They’re like underground grottos, with lush plants and clear, cool water; often with a good variety of aquatic life. El Camaleon , next to the Fairmont Mayakoba resort, is built around lovely waterways and is one of Mexico’s top golf courses. \n \nFOR PhD CANDIDATES \n \nSure, Cancun is known to attract the odd drink-til-you-drop tourist, but there’s plenty for folks who love both sun and culture. The Riviera Maya is home to several outstanding Mayan ruins. Tulum is small but with a beautiful, ocean-side setting. Coba is wonderful and features one of the few pyramids tourists are allowed to climb (at least for now). The climb is not as hard as it looks, even for scaredy-cats like me, and the views are well worth it. The granddaddy of them all, if you like, is Chichen Itza, about three hours from Cancun; a large complex with stunning architecture. Just south of the main hotel/tourist zone is the Museo Maya, a fine, small museum that explains the local history in excellent style and has ceramic artifacts more than 1,000 years old. There’s also a pretty garden area and a short walk among small ruins. If you’re short of something to read, Alma Libre is a casual store that sells new and used English language books in low-key Puerto Morelos, which feels the way touristy Playa Del Carmen might have felt 30 years ago. \n \nFOR SPA SEEKERS \n \nThe Fairmont Mayakoba is part of the Fairmont Willow Stream group, which has some of the world’s best facilities and treatments. The hotel grounds, food and pools are all superb, as well. When I was last here, I took in the Temazcal treatment at the Westin Resort and Hotel at the south end of the hotel zone. It’s an intense, fairly emotional experience with a local shaman where you clamber into a small stone enclosure (think of it as a rocky igloo if you like) and undergo a purifying ceremony and perform ritual chants as locals toss volcanic rocks into a fiery blaze, ratcheting up the temperatures and speeding up the purification process. Participants are encouraged to do so some soul-searching or even reach out to lost relatives. It sounds a bit hokey, but it’s pretty powerful. And quite different from the usual spa with locally-inspired treatments that most properties offer. \n \nFOR FOODIES \n \nI was surprised by the quality of the tacos at Taco Grill, a casual restaurant on the lagoon behind the pretty La Isla Shopping Centre in the hotel zone. La Habichuela Sunset features stunningly presented and intricate menus, with such treats as tender, sweet soft shell crab tacos. It’s also super romantic, with Mayan relics and other historical bits mixed into the décor and a beautiful setting next to a marina. Las Brisas at the Fairmont Mayakoba has smashingly good food and a beautiful setting with views out to the Gulf of Mexico. \n \nJim Byers is a freelance writer based in Toronto. You can email him at jim@jimbyerstravel.com and follow him on Twitter @jimbyerstravel .", "source": "Elliot Lake Standard"}