{"published": "2015-09-13T18:34:09Z", "media-type": "News", "title": "Lehmann encouraged by Starc fitness (AAP)", "id": "dd4288c4-44c1-4669-b6d2-828190d38ab2", "content": "Australia coach Darren Lehmann is encouraged by Mitchell Starc's strong finish to the one-day series win over England. \n\nStarc was recalled for Australia's winner-takes-all clash in Manchester on Sunday and responded with a fearsome first over which set the tone for Australia's emphatic victory. \n\nHe finished with figures of 1-44, but having rattled England's cages in the opening overs, his job in many ways was already done. \n\nIt was a far cry from the weary paceman who laboured through game three at the same Old Trafford venue to a career-worst return of 1-79 just a week before. \n\nThat led to him being rested from game four in Leeds - the first match Starc has missed for Australia this calendar year, having featured in the previous 26 games across all formats. \n\nStarc will have just a ten-day rest in Australia if, as expected, he is picked in the 15-man squad to tour Bangladesh next month. \n\nLehmann confirmed the 25-year-old left-armer will have scans upon his return to Australia but said he was pleased with the world's No.1 bowler's ability to push through after a busy schedule this year - considering his injury troubles in the past. \n\n\"He's tired, as we all are,\" Lehmann said. \n\n\"But I'm pleased he's got through - that's the great thing for him. \n\n\"Especially after what he's gone through in the last few years where he hasn't played enough cricket.\" \n\nAustralia captain Steve Smith admitted to feeling fatigued at the end of the three-month UK tour, and felt for Starc, but hoped the ten-day break would be sufficient for the pair of them. \n\nMeanwhile, fellow quick Pat Cummins enjoyed a breakout month - which doubled as the first time the injury-plagued quick has survived a five-match series. \n\nHis six consecutive ODIs played is also a record for the fit-again paceman, who terrorised England's batsman by reaching speeds of 150km/h. \n\nSmith said he was confident that Cummins, who hasn't played Test cricket since his one and only clash against South Africa in 2011, would be hardy enough to be relied upon should he return to the Test arena. \n\n\"I thought he was extremely impressive throughout this one-day series,\" Smith said. \n\n\"He's worked extremely hard over the past couple of years to get back - he's had a tough time of it - and it's great to see him back on the field and consistently bowling with that 150km/h (pace). \n\n\"It's never nice to face. \n\n\"I'm confident if he gets picked for a Test match that he'll be able to stand up to it and do a good job.\"", "source": "Yahoo! News Australia"}