{"published": "2015-09-25T17:20:30Z", "media-type": "Blog", "title": "More riders accepted for Liberty Cape Winelands", "id": "94f5ad81-13ce-49fb-83eb-295b4520b75e", "content": "Mountain bikers who thought they had missed their chance to ride South Africa’s most beautiful race, the Liberty Cape Winelands MTB Encounter, have another chance to enter thanks to an added investment from the title sponsor. \n \nCo-organiser Wynand de Villiers of ASG Events confirmed that Liberty had increased its commitment for the second edition of the three-stage race, which takes place from April 15 to 17 next year. \n \nThe 180km event showcases the finest Western Cape mountain biking terrain as it traverses the beautiful Boland mountains, valleys and vineyards between the historic towns of Stellenbosch, Franschhoek, Paarl and Wellington. \n \nAccording to De Villiers, the enlarged sponsorship had enabled organisers to expand the hosting capacity of each of the registration and race venues, which include the Lanzerac Hotel, Le Franschhoek Hotel and Kleinevalleij Estate. \n \n“We can now comfortably accommodate 300 teams at the event, which means we are re-opening our entry portal and making a further hundred team entries available.” \n \nHe said entries would close once the additional slots had been filled. \n \nHis fellow organiser, Johan Kriegler of MTB Adventures, added that his route building teams were already hard at work perfecting the trails ahead of the event. \n \n“In the Boland, we’ve got the mountains, awesome fynbos and fauna, great trails and stunning venues that all complement one another. \n \n“It’s a perfect fit and not something you’re going to find anywhere else in South Africa.” \n \nKriegler, who is also the founder of some of the most popular multistage mountain biking events in the country, said the secret of a great race was to strive for an unequalled mix of trails, view and venues. \n \n“Life is all about doing everything in balance. Most riders want a great time on the bike, exploring nature, having a good workout and still getting back to the race village by lunchtime to swap war stories.” \n \nHe said the daily stages would be a manageable 55km to 70km, with climbs not exceeding 1 500m. \n \n“We’re cutting out all the unnecessary climbs and building contour trails to create spectacular vistas with maximum impact. \n \n“You want to build a trail where the scenery surprises you. Where a tunnel through dense vegetation suddenly opens up, or a winding trail turns another corner, and delivers a breath-taking view.” \n \nWhile some of the trails would be open to the public, Kriegler said the key linking sections would be exclusively used by the race. \n \nEnter at www.capewinelands.capetown .", "source": "MarathonMTB.com"}