{"published": "2015-09-08T22:29:11Z", "media-type": "Blog", "title": "Reese Witherspoon Embraces Southern Roots in Gingham Top and A.P.C. Wedges, Teases Fans with Secret Disney Project", "id": "fdac415d-7145-40af-9b87-0f35e4d26f63", "content": "Reese Witherspoon was spotted enjoying a day out with her daughter, Ava, at the Westside Pavilion in West Los Angeles on Thursday last week. \n \nThe 39-year-old actress stayed true to her Southern roots in a blue-and-white gingham-patterned gypsy top paired with dark skinny jeans. She styled the preppy outfit with a gray trilby hat, a pair of gray-framed sunglasses, brown platform wedges, hoop earrings, and a Draper James “Hello, Sugar” canvas tote. Her blonde locks worn down around her shoulders and her barely there makeup completed her daytime-chic look this summer. \n \n\n \n\n \n\n \nReese Witherspoon with daughter Ava at Westside Pavilion in West Los Angeles, Los Angeles, on September 3, 2015 \n \nEarlier in the day, the mom-of-three shared a selfie photo on Instagram showing off her Walt Disney gate pass with the caption, “Working on a #SecretProject….. Can’t wait to share it with ya’ll.” Reports say she could be referring to Tink  — the live-action spinoff of Peter Pan, which she will be producing and headlining. Whatever that is, we’re sure it will be a hit! \n \nReese Witherspoon teasing Secret Disney Project – posted on Instagram on September 3, 2015 \n \nReese’s summery A.P.C. wedge sandals feature a two-strap design made of canvas, buckled ankle straps, 1.5 inch platforms, and 3.25 inch covered wedge heels with crepe soles. \n \nUnfortunately, they’re already sold out. You may want to purchase some interesting alternatives at Farfetch , Revolve Clothing , and Macy’s . \n \nSteve Madden “Stryke” Sandals , $90 \n \nSteve Madden “Twizter” Wedge Sandals , $46.72 (before: $89) \n \nSergio Rossi “Eleanor” Wedge Sandals , $332.88 (before: $416) \n Credit: WENN/Reese Witherspoon's Instagram", "source": "Your Next Shoes"}