{"published": "2015-09-23T17:30:04Z", "media-type": "Blog", "title": "Richmond Nonsense Open Thread", "id": "c1a41b70-9e28-47cb-ace9-ee3de355ade0", "content": "The PdC has landed! UPDATE!!! PdC Meetup Details!\nPdCinRVA!! Meet up Saturday Night at 7pm\nLocation: New York Deli\n2920 West Carey St, Richmond\n\n \nIt's about two miles west of the race course.\n\n...\n\nHey y'all! [That's southern for Welcome!]\n\nI am sitting in the salle de presse at the moment, receiving confirmation that I am now closer to Eddy Merckx (in terms of physical proximity) than ever before. So I have that going for me. This is a Paris-Roubaix-sized press center.\n\n\n    \n\n\n\n\n\nNot too shabby. I'm told it's bizarrely convenient by press room standards. That's all very interesting to you I'm sure. Richmond is still pretty sleepy, and might remain that way for a while. Tomorrow will be more like a normal day for the locals with minimal race activity, and my suspicion is that downtown won't get really crazy until the weekend, but we'll see about this afternoon, the men's elite ITT being one of the marquee events.\n\nFirst amusing scene: a sausage vendor with \"welcome UCI\" plastered over a board. It's probably too much to explain that the UCI is the governing body and nobody, outside the press, is here to interact with them or even acknowledge their existence. The name \"UCI\" definitely does not imply the riders too. Yeah, probably too much to explain. I'm sure there will be other bits of evidence of just how unusual it is to have this event here. But strange does not preclude awesome. So when I chide, I chide with love.\n\nThe PdC House opened yesterday, I being the last to arrive. Current occupants include Drew, Jens, Jimbo, Crashdan and of course Megabeth, with Sui Juris, Elvisgoat and Ant1 expected before long. JFS_PGH stopped by for breafast. SWells is lurking at a crossing somewhere close by (he got a prime spot, as course marshaling goes).\n\nOh, and the best news of all. I will experience something wonderful, something long anticipated, for the first time in my life. Thanks to Jens and his bulky suitcase.\n\n\n    \n\n\n\n\n\nIt's on now.\n\nI'll leave this thread open for various nowhere-else-to-put-it stuff.", "source": "Podium Cafe -  All Posts"}