{"published": "2015-09-21T21:27:14Z", "media-type": "Blog", "title": "Schedule of Public Works projects set for Los Alamos", "id": "52dcd969-0831-4458-8722-ebffdd118207", "content": "Schedule of Public Works projects set for Los Alamos -A A +A\nMonday, September 21, 2015 at 8:50 am Note: For more information about the projects listed below, please email lacpw@lacnm.us, call 662-8150, or visit the “Projects” link at www.losalamosnm.us. Please slow down and use caution within the construction work zones. Please note the below information is based on a schedule provided by the contractors and may change due to weather or other delays.\nWestern Area\nImprovements Phase 3:\nPaving operations will begin on Monday, Sept. 21 on 43rd Street (north). Residents are asked to park vehicles in their driveways during paving hours.\nWork hours will begin 8 a.m. Residents can expect flagging operations. Crew members will be available to escort residents through the work zone if emergencies arise.\n20th Street/Fuller Lodge Improvements:\nThe north bound lane will remain closed through Wednesday. On Thursday, the contractor will change the traffic control to allow for paving on the south bound lane. Motorists will use the north bound lane. Signs will be in place to help guide motorists through the detour. To access local businesses please follow detour signs.\nIf you subscribe to the newspaper, you receive FREE access to all the exclusive content of the web site! Simply register to receive uninterrupted access to our award-winning and in-depth local online content! Renew Current or Past Subscription / Register for Online Subscription If you currently subscribe or have subscribed in the past to the Los Alamos Monitor, then simply find your account number on your mailing label and enter it below. Click the question mark below to see where your account ID appears on your mailing label. Newspaper Acct. ID: Street Address: (exactly as it appears on the label) If you are a subscriber and you do not know your account ID or don't have a copy of your newspaper available that shows the information on the address label you can click continue below to search for your account. New Subscription/30 Day Free Trial Account If you are new to the award winning Los Alamos Monitor and wish to get a subscription or simply gain access to our online content then please enter your ZIP code below and continue to setup your account. ZIP Code: Create a limited access account.\nRegister to participate in community forums, post on the community calendar, blog etc. This registration does not give you full access to read our award winning content, etc.\tThe Los Alamos Monitor | lacirculation@lamonitor.com | 505-662-4185\n256 DP Road, Los Alamos, NM 87544\nOffice Hours are 8:00 a.m. to 5:00 p.m., Monday through Friday", "source": "lamonitor.com/todaysnews/rss.xml"}