{"published": "2015-09-15T12:00:00Z", "media-type": "News", "title": "VigLink Announces International Growth Through Partnerships With Effinity and vCommission", "id": "18a94447-f142-42f9-8a96-4e5c7c592de6", "content": "SAN FRANCISCO, CA -- (Marketwired) -- 09/15/15 -- VigLink , the leading platform for content-driven commerce, today announced global partnerships with France-based affiliate network Effinity and India-based affiliate network vCommission. These partnerships will expand VigLink's global footprint to over 700 advertisers and offer publishers a powerful way to monetize their content in international marketplaces, as well as offer advertisers effective transcontinental marketing channels. \n\nEffinity is the first affiliation consultancy agency in France and will help VigLink build a larger network in Europe. vCommission is India's largest affiliate network that will provide VigLink creative advertising solutions and partnerships across the Asian subcontinent. Merchants and advertisers within Effinity and vCommission's combined international network include Amazon India, Flipkart, MakeMyTrip, Snapdeal, Paytm, PriceMinister (Rakuten), Nespresso, Deezer and The Kooples. \n     \n\"We recognized opportunities for new growth in Europe and Southeast Asia and selected network leaders Effinity and vCommission to partner with,\" said Oliver Roup, Founder and CEO of VigLink. \"These partnerships represent a strategic move to offer unparalleled competitive opportunities for our publishers and pave the way for global content monetization. We are excited to have Effinity and vCommission at the helms of our international growth.\" \n\n\"We have an active community of over 600 advertisers always looking to tap into international revenue streams,\" said Christophe Bosquet, CEO of Effinity. \"VigLink's strong relationships with publishers and market leading technology make them the ideal international partner.\" \n\n\"VigLink's technology is very interesting and innovative. I'm sure their worldwide reach will give our clients wide exposure across all genres,\" said Parul Bhargava, CEO of vCommission. \"We are excited to partner with VigLink and expand offerings to publications across the world. We are confident the partnership will lead to significant growth for both companies.\" \n\nAbout VigLink \nThe largest network of its kind, VigLink monetizes content that drives commerce for over 300,000 sites and works with more than 40,000 merchants to drive sales. Each month, VigLink processes more than 10 billion page views and over 500 million clicks. Founded in 2009 and based in San Francisco, VigLink is backed by top investors including Google Ventures, First Round Capital, Emergence Capital, RRE, Foundry Group and Costanoa Venture Capital. www.viglink.com \n\nAbout Effinity \nEffinity creates, develops and implements digital acquisition campaigns. Effinity aims to meet the needs of the leading e-commerce players (advertisers, agencies, publishers) through influencer marketing. Effinity offers expertise by sector (effinity STYLE, effinity HOME, effinity B2B), technology solutions for partner management (effinity Marketing Technologies) and product flows (effinity PEAKSELL) and creative approaches (studio setting in relation to bloggers). Effinity's network encompasses 45,000 publishers and 600 advertisers across France, Europe and Latam. For additional information, visit Effinity Partners at www.effinity.partners . \n\nAbout vCommission \nvCommission is India's Leading Affiliate Network delivering performance on web & mobile to top Indian brands through a growing network of 17,500 affiliates. \n\nvCommission is a 100% subsidiary of Adways VC India Pvt. Ltd. which is a JV with Tokyo Stock Exchange listed company Adways Inc. (Japan), the No.1 Affiliate Marketing company in Asia on PC & Mobile. \n\nFor additional information, visit www.vcommission.com \n\nMedia Contacts: \nCameron Smead \nKarbo Communications for VigLink \n925.785.7872 \nEmail Contact \n\nSweety Ghuman \n415.255.6512 \nEmail Contact", "source": "CEOWorld Magazine"}