{"published": "2015-09-17T05:12:34Z", "media-type": "News", "title": "Quake strikes off Chile's coast; 5 killed", "id": "303b096c-eb7d-47c9-8a21-6633cc866bed", "content": "A powerful earthquake struck Chile on Wednesday night, killing at least five people, authorities said, and triggering tsunami advisories as far away as California and Hawaii. \n \nAbout 1 million people were evacuated from affected areas, said Ricardo Toro, director of the National Office of Emergency. \n\nFatalities included a woman killed by a falling roof and a second one fatally hit by flying rocks, President Michelle Bachelet said. \n\nThe quake's epicenter was 46 kilometers (29 miles) west of Illapel, according to a preliminary assessment from the U.S. Geological Survey. \n\nIllapel residents reported damage to their homes, Interior Minister Jorge Burgos told reporters. \n\nMassive waves \n\nThe quake had a depth of 25 kilometers (15.5 miles), USGS said. \n\nChile's national emergency agency issued a tsunami alert, ordering evacuations in coastal areas from Arica to Puerto Aysen. \n\nLarge tsunami waves washed along the Chilean coast near the quake's epicenter. In Coquimbo, Chile, a wave was measured at more than 15 feet, according to the U.S. National Tsunami Warning center. \n\nTsunami watch \n\nTsunami advisories were issued thousands of miles away, including in Hawaii and California. \n\nA tsunami advisory was issued for the coastal areas of Southern California, which means strong currents are likely and residents should stay away from the shore. \n\nLos Angeles, Orange and San Diego counties warned residents to stay away from beaches and harbors due to the chances of strong currents. But authorities in the three counties said land inundation is not expected. \n\n\"Widespread hazardous tsunami waves are possible\" along the coast of Chile and Peru, the Pacific Tsunami Warning Center said, and a tsunami watch is in effect for Hawaii. \n\nA tsunami watch is issued \"to alert emergency management officials and the public of an event which may later impact the watch area,\" the center says. A warning is issued when a \"potential tsunami with significant widespread inundation is imminent or expected.\" \n\nEven New Zealand, which is 6,000 miles away from the quake's epicenter, issued a tsunami warning. \n\nStrong tidal currents and large waves are expected in some areas, said Shane Bayley of New Zealand's Ministry of Civil Defence. \n\nPower loss \n\nIn La Serena, a coastal city just north of Coquimbo, pictures taken at a shopping mall showed walls and signs toppled to the floor, ceiling tiles caved in as well as chairs, benches and tables covered in rubble. \n\nCoquimbo Mayor Cristian Galleguillos told CNN Chile that 95% of the city had lost electrical power. Residents evacuated before waves started hitting the coastline, he said. \n\n'Earthquake felt really intense' \n\nMore than a dozen aftershocks of magnitude 4.9 or higher rattled residents. Some could be felt in the country's capital, about 230 kilometers (145 miles) away from the quake's epicenter. \n\n\"Everybody ran outside. The windows rattled. Things fell. ... The impact was strong,\" said Emily Hersh, who lives in Santiago. \"Even after I stepped outside, I felt the ground moving.\" \n\nThe earthquake hit during rush hour, causing traffic snarls that left many people stuck in the streets as they tried to get home, said Fabrizio Guzman, emergency communications manager for World Vision in Chile. \n\n\"There were many people afraid, running in the streets, when the shaking started,\" he said in a statement. \"The earthquake felt really intense and seemed to last for several minutes.\" \n\n'Ring of Fire' \n\nChile is in one of the most earthquake-prone regions in the world. \n\nThe country sits on an arc of volcanoes and fault lines circling the Pacific Ocean known as the \"Ring of Fire.\" The area experiences frequent earthquakes and volcanic eruptions. \n\nSince 1973, Chile has had more than a dozen quakes of magnitude-7.0 and above.", "source": "KSBW Channel.com"}