{"published": "2015-09-10T19:11:00Z", "media-type": "News", "title": "Teletubbies Say Eh-Oh To USA", "id": "eec29dfb-613c-4805-a3bd-575177730204", "content": "MILAN , Sept. 10, 2015 /PRNewswire-USNewswire/ -- Tinky Winky , Dipsy, Laa-Laa and Po said \"Eh-oh\" to the USA today when the Teletubbies made a very special visit to the American Pavilion at the World Expo in Milan, Italy . \n   \n2015 marks the return of the preschool global phenomenon, nearly twenty years after they first appeared on television screens in 120 countries.  The multiple award-winning children's TV show has been reinvigorated for a modern audience and is set to delight a whole new generation of children around the world. \n\nTeletubbies will return to US screens on Nickelodeon in 2016 and today's appearance gave the new generation of young fans a taste of what is to come. \n\nExpo Milano 2015 is the six-month global exhibition that is showcasing the creativity and innovation of over 140 participating countries and Teletubbies is being heralded by the British government's GREAT Britain campaign as a shining example of the very best in creativity and an entertainment export to be proud of. \n\nNicola Bolton , Managing Director of UK Trade and Investment, said: \"The UK currently has the world's second largest independent television production sector creating a host of global UK children's exports including Teletubbies and In the Night Garden. \n\nIt's great to see the return of this popular household name. Teletubbies is a huge British success and one of many UK iconic children's programmes shared around the world.  \n\nIt comes from a rich seam of UK creative talent which contributes to the strong reputation of the UK as a creative nation and trading partner. The creative sector makes up around 8% of all UK exports, and also shapes the cultural identity of our country.\" \n\nProduced by award-winning UK production company Darrall Macqueen on behalf of DHX Media, a key player internationally in the creation of content for families and children, the return of Teletubbies is a leading example of British innovation and creativity at its very best that is welcomed by audiences around the world. \n\nSteven DeNure , President, DHX Media, said: \"We are incredibly proud to be bringing back this global phenomenon and are delighted that this British creative collaboration is being embraced by so many nationalities and cultures around the world. \n\nFilmed at Twickenham Studios in the UK, Teletubbies brings together some of the finest creative talents in the country, from Propshop who have created many of the unique props to Lola who have handled post production. The original series was translated into 45 languages and watched by over 1 billion children in 120 countries and we are delighted that the USA is among those welcoming the Teletubbies into their culture once again.\" \n\nGlobal phenomenon Teletubbies first launched in March 1997 and became one of the most successful international children's brands of all time. It has reached more than 1 billion children to date and the original episodes have aired in more than 120 territories in 45 different languages. It was the very first western pre-school property to air on China's CCTV reaching an audience of 300 million children. Its enduring resonance with children is further underscored by the brand's postings on YouTube which garner more than 75 million views per month. \n\nUK creativity inspires the world, producing a stream of individuals and creative teams that are hugely influential in global media, entertainment and the arts. The UK television production sector is one of the world's largest providers of original content and is highly successful overseas. The Gross Value Added (GVA) of the creative industries was £76.9 billion in 2012/13, accounting for 5 percent of the UK economy and generating over £8.8 million an hour. \n\nPhotos available from http://www.rexusa.com/  \n\nNotes to Editors: \n\n1.     About Teletubbies  \n\nOriginally created in 1997, Teletubbies is a children's television series targeted at preschool viewers. In September 2013 , DHX Media acquired all rights to Teletubbies through its purchase of Ragdoll Worldwide, a joint venture between Ragdoll Productions and BBC Worldwide that owned, managed and exploited Ragdoll programming. Multi award-winning, Teletubbies is designed to encourage young children to watch television creatively. Full of fun and exploration, it inspires confidence and curiosity and nurtures childhood development. \n\n2.     About Darrall Macqueen \n\nDarrall Macqueen is a triple BAFTA award winning UK indie producing high-quality and innovative children's and preschool entertainment for major broadcasters around the world. Formed in 2000 by former Disney execs Maddy Darrall and Billy Macqueen , the company has a proven track record of devising and producing long-running children's properties. \n\nRecent successes include 'Baby Jake' (CBeebies) Pre-school Programme of the Year at the Broadcast Awards 2013 and Best Mixed Media Programme at the British Animation Awards 2014. The 'Fly High and Huggy' flash and mobile games for CBBC and CBeebies (launched April 2014 ) and CBeebies first Pre-School drama series with a narrative arc 'Topsy and Tim' (60 x 11 minutes), the huge TV and online ratings hit of winter 2013. \n\n3.     About DHX Media \n\nDHX Media ( www.dhxmedia.com ) is a leader in the creation, production and marketing of family entertainment.  DHX Media owns, markets and distributes over 10,000 episodes of entertainment programming worldwide and licenses its owned properties through its dedicated brand management and consumer products business.  DHX Media is recognized for brands such as Teletubbies, Twirlywoos, In the Night Garden, Inspector Gadget, Yo Gabba Gabba! and Caillou. DHX Media has offices in Toronto , Los Angeles , Vancouver , Halifax , London , Paris , Barcelona , Milan , Munich and Amsterdam and is listed on the Toronto Stock Exchange. \n\n4.     About UKTI \n\nUK Trade & Investment (UKTI) is the Government department that helps UK-based companies succeed globally and assists overseas companies to bring investment to the UK. It leads the whole of Government effort to help UK firms win business overseas and rebalance the economy towards export-led sustainable economic growth. \n\n5.     About the GREAT Britain campaign \n\nThe GREAT Britain campaign is the Government's most ambitious international marketing campaign ever and showcases the very best of what Britain has to offer in order to encourage the world to visit, study and do business with the UK. Bringing together the international growth promotion efforts of UK Trade & Investment, VisitBritain, British Council, Foreign and Commonwealth Office and a number of other departments, GREAT aims to deliver significant increases in trade, tourism, education and inward investment to support the Government's prosperity and growth agenda. The campaign is active in 144 countries and has already delivered a direct return to the economy of over £1 billion. \n\nFor more information on the GREAT Britain Campaign, contact the Foreign and Commonwealth Office Media office on 0207 008 3100, email Newsdesk@FCO.gov.uk , or visit www.greatbritaincampaign.com , Twitter: @GREATBritain \n\nLogo - http://photos.prnewswire.com/prnh/20140501/83008  \nPhoto - http://photos.prnewswire.com/prnh/20150910/265466   \n\n\n  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/teletubbies-say-eh-oh-to-usa-300141105.html \n\nSOURCE  The GREAT Britain campaign", "source": "A.M. Best"}