{"published": "2015-09-13T10:24:35Z", "media-type": "Blog", "title": "New Rob Interview with The Guardian - The Observer", "id": "a909cff7-f1ff-4f6d-8b62-693b97f5489e", "content": "It is one of this summer’s four perfect days, a Friday afternoon to boot, and London’s most smug are bunking off work and descending like fashionable, tanned zombies on Shoreditch House members’ club. Meanwhile in a joyless, north-facing, little-used room called the Library you’ll find Robert Pattinson, the 29-year-old British actor. He’s not tanned; famously, he has the pallor of an eternally youthful bloodsucker. He’s not smug either; in fact it would be hard to find someone less pleased with themselves. And he’s come to Shoreditch House today to work – to do interviews anyway, one of the least enjoyable elements of a job that he’s not convinced he’s especially good at.\nDoes Pattinson come here often? “Um, yeah, kind of, er. Ish,” he eventually decides on. “I used to go to the gym here until I realised that I didn’t want people to see me going to gym.” He laughs, a posh, unexpected, winning guffaw. “I was so embarrassed,” he continues. “When you’re trying to lift up your 10lb dumbbells… Word spreads.”\nPattinson is monochromatic today: white T-shirt and thin jacket; black jeans, boots and unmarked baseball cap. He has a bushy beard (our pictures were taken before he grew it). It’s the kind the Victorians favoured, with a twiddly moustache, for a part he’s currently shooting. “Oh, this is driving me insane,” he says. “Let me know if I’ve got something hanging off the side. Avocados are especially bad.” Pattinson strokes his chin: “Hmmm, yeah, avocados are not beard-friendly.”\nIt’s around this point, maybe a couple of minutes in, that I realise I’m going to quite like Pattinson. It is not particularly something he’s said, but his, for want of a better word, vibe. If anyone could be forgiven for being an oddball, it’s him. Any chance Pattinson had of a normal career – a normal life – vanished when he appeared, aged 22, as the vampire Edward Cullen in 2008’s Twilight. Over five films he became very rich, unpleasantly famous and kinkily lusted over. One example: last year in Las Vegas, a woman married a life-size cardboard cutout of Pattinson; on their honeymoon, she carried “him” up to the Hollywood sign.\nSuch attention, such unsolicited devotion, would be a brain scramble for anyone. But what’s endearing about Pattinson is that it is easy to see the kind of person he was before he became one of the most famous actors in the world. He’s a bit of a goof. He’s prone to gabbling about, say, having a gloop of avocado on his face.\nIn short, Pattinson doesn’t carry himself like he’s God’s gift. He remains recognisably a 20-something from suburban London whose dad sold vintage cars and whose mum was a model booker.\nThe most interesting thing about Pattinson these days is the career he’s curating. To oversimplify it, pretty much any director would want Pattinson in their film: he has a name that gets a project green-lit and a fanbase that means people are sure to see it. Yet he has chosen to use this power in an unconventional way. Sometimes he actively seeks out filmmakers who he admires: “There’s not a lot of them, and I like quite specific stuff.” He doesn’t demand the biggest role or for his name to be in the largest type on the film poster – though that’s usually what happens anyway. He’s worked with cult auteur David Cronenberg twice (Cosmopolis and Maps to the Stars) and with Werner Herzog, as TE Lawrence in the forthcoming Gertrude Bell biopic, Queen of the Desert, alongside Nicole Kidman and James Franco. He’s just signed up to play an astronaut in Zadie Smith’s first screenplay.\nAnd this month Pattinson stars in Anton Corbijn’s Life, a warm, perceptive film about James Dean. But Pattinson isn’t playing Dean; he is Dennis Stock, a Magnum photographer who befriended the actor in 1955 and took the iconic shot of him walking in Times Square, smoking, huddled against the rain. Pattinson insists he didn’t, even for one second, consider lobbying for the role of Dean, a role taken by Dane Dehaan.\n“I wouldn’t even know where to begin,” says Pattinson. “I guess the only reason anyone would think that is from Twilight, because people always said about ‘brooding’. I’m not entirely sure what brooding is, other than a chicken sitting on her eggs. So I’m not entirely sure why that’s considered an attractive trait.”\nThere are, however, intriguing parallels to be drawn between Dean and Pattinson, two of the defining stars of their eras, or at least an examination of how the nature of celebrity has changed in the 60 years between their respective peaks. In Life, Dean is caught on the cusp of fame, shortly before the release of his debut film, East of Eden (in the ensuing eight months he would shoot two more films, including Rebel Without a Cause, before dying in a car crash aged 24). The studio, Warner Bros, puts him forward for interviews and Dean mucks them up, partly through inexperience, partly through sabotage.\nPattinson certainly knows how that feels. “When the first Twilight came out, I’d definitely say dumb stuff just so I wouldn’t sound cookie-cutter or part of the machine,” he recalls. For the most part this was pretty tame, such as admitting he took a Xanax before his final audition to calm his nerves or saying that he had been drunk for a year before he landed the part, living in a “cool little ex-crack den” with his best friend, the actor Tom Sturridge. “It’s not very difficult to shock people when you can literally just swear,” Pattinson says, laughing again. “You talk about being hungover and you just see the publicity department waving their arms going: ‘Shut up! Shut up!’”\nIn other ways, though, Life makes it clear how much the interaction between celebrities and the media has changed. Stock, at Dean’s encouragement, follows the actor home to Indiana, to the farm where he grew up with his uncle and aunt in a Quaker household. The intimacy of their exchanges – and the photographs that relationship produced – would be unimaginable in the present day.\nPattinson concedes as much. “The idea of taking a photographer back to my family’s house… it’s just insane!” he says. “It’s not really even to do with the photographs – it might be nice to have a really good photographer do it, but it’s bringing your family into the public domain and then having to have them deal with this horrible cacophony of demons who live on the internet. That’s really ruined a lot of things, internet trolls, because no one wants to put themselves out there. Even if you can ignore it, and I don’t think anyone can really ignore it.”\nThere’s not anger in Pattinson’s voice, just acceptance of the uncomfortable Faustian pact he’s made for success in his chosen field. “With my sisters” – Victoria and Lizzy, both older; Lizzy, a singer, appeared on last year’s X Factor, reaching the stage where hopefuls audition at the judges’ houses – “you just bring people into something they have not asked to be part of,” he continues. “It’s impossible for you to stop it afterwards. All you can say is: ‘I’m sorry. I’m sorry for bringing this darkness into your life. And also you don’t get anything out of it either.’ It’s just nothing but bad, yeah.”\nPlenty of people in entertainment and outside it really want to be famous. Pattinson, meanwhile, more than any public figure I’ve encountered, appears to be desperate to be less well-known than he is. The point where celebrity was useful to him is long distant. He already has more money than he knows how to spend. In Los Angeles he bought a house – “like Versailles,” he’s described it – but moved out after the paparazzi set up camp outside. He owns 17 guitars, but that’s as far as extravagances go.\n“Fame is just in the way for Rob,” says Anton Corbijn, who has considerable experience of working with superstars, first as a portrait photographer and more recently as a film director. “We were shooting in a really cold winter in Toronto and there were days where it was definitely -22C and still there would be some paparazzo photographer hanging in a tree somewhere for a whole day. Even in extreme circumstances, in the middle of nowhere, he gets followed. That must be tiresome.”\nWould Pattinson want to be less recognisable, then? “I don’t even think I am that famous anymore,” he says unconvincingly. “I just moved back to London and the thing that always drove me crazy in LA was photographers. You don’t even really care about having your photograph taken, but it’s the following, the trailing, knowing that you can’t escape it. But I moved back to London and it just doesn’t happen ever.”\nReally? “Uh huh. Unless you’re at the Chiltern Firehouse or somewhere. That’s it. The infrastructure doesn’t exist here. And celebrity press – they are interested in different things in England. Which is wonderful!”\nHe might be giving us too much credit there. Pattinson’s relationships are a staple of gossip columns, especially since he split with Kristen Stewart, his Twilight co-star, in 2012. He is currently stepping out with, and almost certainly engaged to, the singer FKA Twigs – hence the return to London – but he’s learned enough to keep it on the down-low. When I raise the subject today, he replies, good-naturedly: “Oh yeah, that. I’ve just found if you never talk about stuff it’s better. But thank you.”\nPattinson’s personal experience, of enduring Twilight and coming out the other side, does seem to have left a residual interest in the smaller cogs in the machinery of Hollywood. In last year’s Maps to the Stars he played an aspiring actor and writer who is really a chauffeur and has an unlikely hook-up with a neurotic big-time actress played by Julianne Moore. In Life his character Dennis Stock witnesses up close what the movie industry is starting to do to James Dean. The lesson, in both cases, appears to be that it’s not easy to remain sane in this business.\nPattinson, though, sees it differently: it’s not that movie stars are weird; everyone is weird. “I think people are pretty extreme,” he says. “If you look at anyone’s behaviour, you meet a lot of nutcases. I can hang out with my family and it’s like a mental asylum.” He’s laughing hard now. “They’ll be like: ‘Oh, why are you saying this about us?’”\nActing, Pattinson insists, remains a learning process; he never studied it and he became Edward Cullen when he still thought he wanted to be a musician rather than an actor. This leads to a bizarrely self-deprecating estimation of his talents. Pattinson rarely watches his own performances – he has still never seen the final Twilight movie – but he does assiduously seek out negative comments on the internet. “I do read reviews to a fault, and it’s an awful thing to do,” he admits. “It’s an addiction. And you only read the bad ones, too, just to foster hatred, self-hatred, self-loathing. Yeah, weird habit.”\n“I don’t know if it’s insecurity, but he’s far more gifted than he gives himself credit for,” says Corbijn. “Obviously success came relatively easy to Rob with the Twilight series, and ever since then he’s taken on left-of-centre roles to prove – I guess to himself – that he is an actor and not just a famous actor. That’s really courageous of him, but he underestimates his own quality. He’s nervous. I think he beats himself up a lot – unnecessarily so, in my eyes.”\nCorbijn describes “an inner turmoil” he sees in Pattinson. Does Pattinson recognise that in himself? “Err, ha ha, yeah, sort of,” he replies. “Sometimes. I think everyone does, really, but I definitely feel like I need to prove something, and I’m not entirely sure what it is. So that’s probably what my turmoil is.”\nPattinson goes silent for a few seconds. “Confusion!” he eventually exclaims. “I’m definitely very confused. I spent basically my whole 20s having no idea what was going on. And I do feel now that I’m gaining a little bit of perspective.”\nThe analysis session is almost over. Pattinson walks over to an upright piano by the window and idly plays a few notes. He started taking lessons again recently for the first time since he was a teenager; he thought he would be more enthusiastic this time, but practice is still a drudge. He closes the lid and finishes a thought from a couple of minutes before.\n“In a lot of ways, I’m quite proud that I’m still getting jobs,” Pattinson says. “To go from starting a job by accident when you’re 16 and maintaining it somehow and learning how to do it on the job as well. Because of falling into a job, you always feel like you’re a fraud, that you’re going to be thrown out at any second. So yeah, the main thing I do hope is to gradually get rid of that and really be doing what you want to be doing without feeling like you’re faking it. Does that make sense?”\nWith his intriguing, ambitious post-Twilight career, it is making less and less sense, but it says a lot about Pattinson that he still thinks it.\nLife is out on 25 September\nSource", "source": "Robert Pattinson Life"}