{"published": "2015-09-24T20:23:03Z", "media-type": "News", "title": "AAR Reports First Quarter Fiscal Year 2016 Results", "id": "f11cc089-94fe-4c37-ad27-435258943ac5", "content": "SOURCE AAR CORP.\n\n- First quarter sales of $377.8 million\n\n- Diluted earnings per share from continuing operations of $0.23\n\n- Total diluted earnings per share of $0.65, inclusive of additional gain from the sale of Telair Cargo Group\n\nWOOD DALE, Ill. \n\nDuring the quarter, the Company recorded a pre-tax gain of $27.7 million \n\n\"Performance in the first quarter was in line with our expectations as we continue executing on our industry-leading aviation and government services strategy,\" said David P. Storch \n\nStorch continued, \"For the balance of the year, in our Aviation Services segment, we expect continued demand for our MRO services and a return to more robust growth in supply chain. In our Expeditionary Services segment, we expect similar results in the second quarter with sequential improvement through the second half of the year as airlift increases its contracted fleet in different geographies.\"\n\nGross profit margin from continuing operations was 14.4% for the first quarter compared to 15.8% last year. In the Aviation Services segment, gross profit margin improved year-over-year due to higher margins in MRO. In the Expeditionary Services segment, gross profit margin declined year-over-year due to the mix of flying positions at airlift.\n\nFirst quarter sales to commercial customers represented 61% of consolidated sales, compared to 60% of consolidated sales in the first quarter of last year. The balance of the sales was to government customers including defense. \n\nSelling, general and administrative expenses as a percentage of sales were 10.4% for the first quarter, compared to 9.7% last year. This quarter was adversely impacted by increased legal expenses. Net interest expense from continuing operations for the quarter decreased to $1.9 million \n\nIn the first quarter, the Company paid out dividends to shareholders of $2.6 million \n\nConference Call Information \n\nAAR will hold its quarterly conference call at 3:45 p.m. CST \n\nAbout AAR\n\nAAR is a global aftermarket solutions company that employs more than 4,500 people in over 20 countries. Based in Wood Dale, Illinois \n\nNote: Pursuant to SEC Regulation G, the Company has included the following reconciliation of financial measure reported on a non-GAAP basis to compare financial measures reported on the basis of Generally Accepted Accounting Principles (\"GAAP\"). \n\nLogo - http://photos.prnewswire.com/prnh/20150319/183226LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/aar-reports-first-quarter-fiscal-year-2016-results-300148840.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KHQ Right Now"}