{"published": "2015-09-09T18:23:11Z", "media-type": "Blog", "title": "5 Things You Need to Know Before You Finance a New Home", "id": "6fea5d72-dcfd-4020-8c33-b8ebf363b889", "content": "If you plan to buy a home with financing, you may feel overwhelmed by everything you need to learn about the process . Here are five key points to get you started. \n Understand the full cost of owning a home  \nThere are four main categories of a homeowner’s monthly housing payment - principal, interest, taxes and insurance (P.I.T.I.) . \n \nPrincipal and interest comprise your monthly mortgage payment. The principal pays down your loan balance monthly, and the interest pays your fee for borrowing the money. Use an amortization calculator  to see the principal-versus-interest breakdown over time. \n \nTaxes refer to property taxes assessed by the county you live in, and average 1.2 percent of your home’s value each year. \n \nHomeowners insurance is required when you have a mortgage, and you pay it to an insurance company of your choosing. Insurance typically costs $700 to $1,200 per year for a single family home. \n \nIn addition to P.I.T.I., if you live in a planned unit development (PUD) or condo, you'll have homeowners association dues, which cover common area amenities, ongoing upkeep, and reserves for future maintenance. These monthly dues range from $100 to over $1,000. \n \nIf you don’t live in a PUD or condo, you should construct your own savings plan for future maintenance. \n Examine your credit history now  \nA strong credit report is critical for getting the best mortgages with the lowest rates. Lenders want reliable on-time payment history, as well as credit depth. \n \nYour report will be more appealing to lenders if you have a significant amount of credit. If you need to obtain more credit, note that your credit score can drop 5-15 points when you first open a new account, then will rise again when you’ve established good payment history, so it’s best to open new accounts a few months before applying for a mortgage. \n \nFederal law entitles you to a free credit report every year , but these reports only show account history, and don’t include scores. \n \nGet your credit score , and take steps to improve it , if necessary. \n Match mortgage products to your budget and timeline  \nYou can calculate how much you can afford to spend on a home  with inputs you already know: income, monthly non-housing debt, and savings for down payment. \n \nNext, you need to think about how long you’re going to be in a particular home so you can target the right loan product . \n \nIf your income isn’t going to grow over time, you will probably be in the home longer term, so you’ll want a loan with a payment that won’t change, like a 30-year fixed . \n \nOr maybe you expect your income to increase sharply within five years and you’re going to upgrade homes within that time, so you’ll want a five-year ARM , which has a much lower rate. \n \nIf you don’t have a 20-percent down payment , you can buy with as little as 3 percent down using FHA , VA , Fannie Mae, or Freddie Mac low-down programs , but you’ll have mortgage insurance on top of your monthly P.I.T.I. \n \nEstimate your mortgage insurance with a mortgage calculator . \n Get pre-approved in advance  \nIf you do all your home financing research without getting pre-approved , you could be disappointed when it comes time to find a home. \n \nHome shopping is competitive, and most sellers require your offer to be submitted with a lender pre-approval letter to prove you’re all ready with your financing. \n Know what lenders will require  \nWhen you’re ready to get pre-approved, remember that lenders will closely examine all aspects of your life. \n \nThey’ll ask for full name, address, date of birth, social security number, and ages of children. They’ll also review your credit report, employment history, pay stubs, tax returns, bank statements, divorce and any other legal settlements, and full financials for any businesses you own. \n \nA lender will give you a checklist outlining exactly what documents they need. Follow this checklist exactly. If they only ask for your last two pay stubs, don’t send three. If they only ask for federal tax returns, don’t send state. \n \nAlso, be prepared to write short letters to explain past inquiries on your credit report, past addresses, and name changes. \n \nNow that you've got an overview, you can dive deeper into home financing topics , then find a lender in your area  to partner with you through the process. \n \nRelated : \n  The Home Buyers’ Guide to Getting a Mortgage  4 Local Factors That Impact Your Mortgage Process  5 Mistakes That Delay Mortgage Approvals (and How to Avoid Them)", "source": "Zillow Blog - Real Estate Market Stats, Celebrity Real Estate, and Zillow News"}