{"published": "2015-09-02T18:03:00Z", "media-type": "News", "title": "Renaissance ClubSport Aliso Viejo Laguna Beach Hotel Entices Travelers With Exciting New Package", "id": "bfbb0b60-0878-4ebe-a10a-5b1fbe5a86f6", "content": "SOURCE Hotel in Aliso Viejo offers new weekend deal featuring 1,500 Marriott Reward Points\n\nALISO VIEJO, Calif. \n\nSummer might be coming to an end, but fun in the sun is in full swing at one of the premier hotels in Aliso Viejo \n\nWith tons of exciting on-site amenities, the Laguna Beach \n\nFor a more active getaway, guests can take a refreshing dip in the sparkling outdoor pool, perfect for doing laps, making a splash or simply opting to soak up the sunshine in one of the plush lounge chairs surrounding the watering hole. Little ones will find endless fun of their own at the Splash Pad or Play Park, featuring a playground complete with exciting water sprayers and slides. \n\nFuel up for adventures with a mouthwatering meal, healthy snack or smoothie at Citrus Fresh Grill. Conveniently located inside the hotel, the stylish eatery allows travelers to satisfy their cravings with fresh California Cuisine for breakfast, lunch and dinner. \n\nFollowing a hearty meal, travelers can keep up with their fitness routines at Renaissance ClubSport. Kick off a brisk workout in the complimentary fitness center, featuring a variety of free weights, medicine balls and cardiovascular equipment complete with personal TV screens to keep users active and entertained. Guests can also schedule some time with a professional trainer, or feel the burn in one of the group fitness classes. \n\nNo matter how guests choose to spend their days, nights will be spent in style when they retreat to the hotel's luxurious guest rooms and suites. With floor-to-ceiling windows boasting sweeping city views, the accommodations are ideal for relaxing while still enjoying the energy of the city. Kick back on chic furnishings while enjoying a show on flat-panel TVs, or settle into sweet dreams with plush bedding and piles of fluffy pillows. Marriott Reward members will also enjoy free Wi-Fi throughout their stay. \n\nTo take advantage of this Laguna Beach About at 50 Enterprise in Aliso Viejo, CA \n\nJoin Marriott Rewards now and earn points that can be redeemed for free hotel stays and room upgrades at 3,800 hotels in over 70 countries.\n\nLearn more about Renaissance Hotels and Marriott International Inc.\n\nPRESS CONTACT\n\nPhoto - http://photos.prnewswire.com/prnh/20150902/263165 \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/renaissance-clubsport-aliso-viejo-laguna-beach-hotel-entices-travelers-with-exciting-new-package-300136882.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WFMJ 21 - TV"}