{"published": "2015-09-24T15:36:00Z", "media-type": "News", "title": "Benjamin Hsiang & Don Favia, RE/MAX Commercial & Investment Realty, Educate Owners on Opportunities, Given Santa Monica’s Recent Record Low Rent Increase", "id": "2f19dbac-1f36-4828-8a95-0a2ca1aec4b4", "content": "According to investment Realtors, Benjamin Hsiang and Don Favia, the slow rise in legally allowed rent increases is actually making apartment purchases an attractive investor option. The City of Santa Monica recently announced a modest increase to its rent controlled apartments of only 0.4%, or $7 per month maximum. \n \nSanta Monica, CA (PRWEB) September 24, 2015 \n\nIn comparison, the City of  Los Angeles rent controlled building landlords are allowed to increase their rents 3% with no maximum dollar amount.  Counter to some theories and observations, RE/MAX Commercial and Investment Realtors Don Favia and Benjamin Hsiang have detailed the mechanism by which this modest increase actually drives investor demand. \n \nThe impact of rent prices and rent control is a hotly debated topic, with a range of opinions on the effect on supply and demand higher prices have.  One thing agreed upon is that the increasing price of rent, along with record low interest rates, are driving continued growth in home sales, as a monthly mortgage becomes increasingly more attractive than the high cost of rent.  “We are hearing from  some Santa Monica landlords who are becoming very frustrated,” said RE/MAX Realtor Benjamin Hsiang. “ In some cases, many rents are actually decreasing this year due to the changes in the way registration fees are passed through to tenants. Due to this built up frustration, many long term apartment owners are deciding now is the right time to sell their properties due to the record high real estate prices.” \n \n“With the slow growth in city-controlled rents comes the opportunity for investors to take advantage of the unique opportunity  that these low-rent buildings offer,” said RE/MAX Realtor Don Favia .  “As tenants occupy their rent controlled apartments the effect on the supply for vacant units is stifling. The demand for vacant units continues to rise which has a direct impact on the quickly increasing market rents. Our savviest investors are seeing the opportunity in purchasing buildings occupied with low rent tenants and coming up with increasingly clever buyout options which can instantly build a lot of equity.” \n \nFavia and Hsiang certainly speak from experience.  In January this year, they closed on a seven building portfolio sale of nearly $30 million; last month sold a 20-unit building for $8 million; and in August closed on a $2.7 million multi-family building.  In fact, since he joined RE/MAX Commercial & Investment Realty in 2007, Hsiang has been nationally recognized as the nation’s #1 commercial real estate sales agent for 2008, 2010, 2011 and 2012.  He is a Los Angeles native, a graduate of UC San Diego and speaks fluent Mandarin Chinese. \n \nDon Favia began his real estate career in 2007, and specializes in multi-family units throughout the Westside and beach communities.  He’s a graduate of California State University, Northridge and launched his commercial real estate career in 2007 following a 10-year stint in the Information Technology sector. \n \nAbout Don Favia and Benjamin Hsiang, RE/MAX Commercial & Investment Realty \nThe Los Angeles and South Bay offices of RE/MAX Commercial & Investment Realty provide commercial brokerage services to clients with properties in the South Bay, Long Beach and the Greater Los Angeles metro area.  Favia & Hsiang’s office is located at 550 South Hope Street #500, Los Angeles, CA 90071.  For more information, please call (213) 233-4384. \n \nAbout NALA™ \nThe NALA offers local business owners new online advertising & small business marketing tools, great business benefits, education and money-saving programs, as well as a charity program.  For media inquiries, please call 805.650.6121, ext. 361. \n \nFor the original version on PRWeb visit: http://www.prweb.com/releases/BenjaminHsiangDonFavia/REMAX/prweb12978833.htm", "source": "Times Union"}