{"published": "2015-09-03T11:00:26Z", "media-type": "News", "title": "Recruiting class looks bright for GVSU", "id": "c3ca0272-07b5-4993-b0a6-a3244db649ef", "content": "By Adam Knorr  Published 7 hours ago\n\n\t\t\t\t\n   \t\t\t\tUpdated 7 hours ago  Lakers pull three top 1,500 recruits for 2016       Photo: Kevin Sielaff / Grand Valley Lanthorn  \nGVL / Kevin Sielaff\rFreshman Alex Scott takes a swing at the ball Friday, August 28th, 2015. \n    \nThe Grand Valley State men’s golf team could have a new look in the 2016 season thanks to one of the best recruiting classes in recent GVSU history. \n\nThe Lakers landed three recruits in the top 1,500 high school players in the nation – all three of which had Division I looks or offers. \n\nAll three signings will have a shot to crack the lineup in 2016, and will add the inner competition, one of the things head coach Gary Bissell preaches the most. \n  \n“The biggest thing with this last recruiting class this incoming years is that the stars aligned a little bit,” Bissell said. “I don’t know if we get that good of a class every year. I don’t try to find guys that can just play, but it’s finding guys that match my goals and my style… They’ve got to be ultra competitive kids who aren’t satisfied with where they’re at.” \n\nThe three true freshmen – Mitchell White, Alex Scott and Bryce Messner – were all top 1,500 recruits who spurned the likes of Oakland, Iowa and Eastern Michigan in favor of GVSU. \n\nAlthough it was no easy task for Bissell to sign such talent, his email inbox suggests that it was no easy task for the new recruits to make the squad. \n\n“I get flooded with emails on a weekly basis of kids wanting to play here,” Bissell said. “That’s an important thing… (My players) know not to take this for granted because I got an email list of 300 kids who are dying to play here. You can’t take this for granted because as soon as you start to slip up, there’s someone waiting to take your spot.” \n\nThe same philosophy applies for Bissell and his active roster. \n\nThe third-year Laker coach starts with a clean slate at the beginning of each season. Seniors have to prove themselves as much as freshmen do. What players did last year matters as much as what players claim they can do. \n\nFor White, Scott and Messner, this philosophy couldn’t be better. Under Bissell’s watch, the best players will be the ones who play, regardless of class standing. \n\nWhite is riding a wave of confidence as he adjusts to the college life. The Muskegon, Michigan native recently won the 94 th GAM Championship in a two-hole playoff to top some of the best amateur golfers in the area. \n\nWhite brushed off Oakland and EMU to play for Bissell in Allendale. The chance to create a base for future success played a big role in his decision. \n\n“Me and Bryce (Messner) kind of committed at the same time and we tried pushing Alex (Scott) and when he came we realized we could have something special with us all here,” Mitchell said. “They guys on the team were all really nice once I was on campus for my official visit.” \n\nScott was in the running for the last spot at Michigan State, but ultimately chose to be a Laker over a Spartan largely because of Bissell’s knowledge as a swing coach and ability to impact a player’s game. \n\nThe Traverse City West High School alum earned All-State honors as a junior and is the most highly rated recruit of the three. \n\n“My original goal when I got here was that I want to become the best player I can possibly be,” Scott said. But my first goal is to actually get into that top 5. I know it’s not going to be anything easy. I’m going to really look forward to the challenge because there are players here that are going to push me.” \n\nThe final member of the trio is Messner, a Hartland High School graduate and All-State First Team member as a junior in 2014. Messner ranked in the 800s out of high school and fired a 146 at the GAM Championship. \n\nThe three freshmen will room together this year – yet another instance of internal competition. \n\n“It’s definitely going to help rooming with Alex and Bryce,” Mitchell said. “I’m watching TV or something and someone says,  ‘Hey I’m going to the course’, then I’m like, ‘Oh wait, I’ve got to practice with this guys, me and him are competing for the same spot.’ Everyone is going to be pushing each other.” \n\nThe Laker golf team could have a new look in 2016, but it just may be for the better. \n  Tweet", "source": "Grand Valley Lanthorn"}