{"published": "2015-09-17T04:10:17Z", "media-type": "News", "title": "Tablets and Phones Are More Popular Than Ever for TV Viewing -- But Not for Live TV", "id": "e01fae95-d87d-4562-8a6d-e32780559b14", "content": "PRWeb \nNew data from Hub's annual \"Finding Input One\" study shows dramatic growth in the use of tablets and smartphones for TV viewing. Among consumers 16-64 who watch some TV shows online: \n\nHalf use a tablet to view TV shows (51%), a 15-point jump from just last year (36%). More than a third use a smartphone for TV viewing (37%), up 7 points from 2014 (30%). More online content is being watched on TV sets.  71% say they watch shows from online sources on a TV connected to the internet, 9 points higher than last year. Smart TVs in particular have made major strides. In 2015, 39% of those who watch online shows on a TV set use a Smart TV,   vs. 42% who connect through a game console, the most popular connection device. That gap has closed rapidly since 2013, when consumers were twice as likely to use game consoles than Smart TVs (52% to 25%). However, the popularity of mobile devices for TV viewing has NOT created a demand for streaming live TV to tablets and smartphones. For example, only 8% of consumers say it's essential to be able to watch episodes of scripted shows on a phone or tablet live, at the same time they air, and just an additional 20% consider it very important. Even live sports is not considered a must-have on mobile devices. A mere 10% of consumers consider it essential to be able to watch live sports events on tablets and phones, and only 16% say it's very important. But tech-loving Millennials must attach more importance to live TV on mobile? Not really: only 11% of 18-34 year olds call live sports on mobile essential, with 20% calling it very important. Other key findings from the study: 53% of 16-34 year olds use a device other than a traditional Pay TV set-top box as their default for TV viewing--the first device they turn on to watch TV programming. Consumers are increasingly taking TV capabilities into account when purchasing multifunctional devices. For example, over 6 in 10 who use a game console to watch online say that TV viewing was a reason for buying the console they chose--and 33% say it was a major reason. \nThe Implications:  \"More TV is watched live than any other way, and at the same time we've seen a major jump in the use of mobile devices for TV viewing,\" said Peter Fondulas, one of the study authors.  \"One might think that would create a strong market for live TV on tablets and phones, but that hasn't been the case. Mobile viewing is still highly situational, and the scenarios that make mobile viewing convenient don't necessarily align with linear TV schedules.\" \n   \n\"One of the most important trends we're seeing is the growth of TV sets connected to the internet,\" said Jon Giegengack, co-author of the study.  \"For most TV consumers, the big screen is still the main, if not the only, way to watch. Inexpensive and easy-to to use peripherals, and especially Smart TVs with a built in connection, remove one of the last logistical barriers between mainstream consumers and online TV sources.\" \n\nAbout this Research \n\"2015:  Finding Input One\" is an online survey conducted among 1,230 US consumers with broadband, who watch at least 5 hours of TV per week. An excerpt and infographic of the report are available as a free download from Hub Entertainment Research. The study was conducted in August 2015. \n\nAbout Hub Entertainment Research \nHub Entertainment Research is a market-research firm with deep expertise in television, movie, videogames, music, publishing, and sports--anywhere that entertainment and new technology overlap. In the television industry, Hub analysts work with networks, content producers, MSOs, and digital distributors. Our job is to help our clients understand the greatest risks and most-promising opportunities facing their companies and to reveal the clearest paths to success in a changing marketplace. For more information, please visit us at http://www.hubresearchllc.com . \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12963557.htm \nPRWeb.com", "source": "Town Hall"}