{"published": "2015-09-17T14:44:14Z", "media-type": "News", "title": "Drew Barrymore continues to reign supreme as boho queen in floral emerald dress and orange heels on Miss You Already promo", "id": "f5369d96-602c-4953-89a0-338f6525f5e1", "content": "It wouldn't be wrong to say that Drew Barrymore is set in her ways when it comes to her wardrobe.  \n\nCementing her supreme reign as boho queen, Barrymore looked great in a pretty printed shirt dress as she stepped out in the capital on Thursday.  \n\nOn her day around town, the 40-year-old actress was joined by her co-star Toni Collette as they did some more promo for their new film Miss You Already ahead of the London premiere. \n\nScroll Down For Video \n   \nBoho queen: Drew Barrymore looked chic on Thursday as she stepped out in London \n  \nEmbracing the sunshine: The 40-year-old actress wore a pretty printed floral shirt dress  \n\nTaking in the last rays of sunshine the city had to offer, Drew teamed her emerald floral number with a pair of orange suede heeled sandals.   \n \nWearing her ombré hair down in loose waves styled in a centre part, the mother-of-two lined her pout with a shade of pink lipstick. \n\nMaking her final round before the red carpet screening, Barrymore made appearances at both Global Radio and the ITV Studios.  \n   \nEasy does it! The mother-of-two carefully navigated her steps as she got out of her car \n   \nHappy days: Drew was joined by her co-star Toni Collette as they made another appearance at the ITV studio \n   \nPromo activity: Barrymore and Collette made an appearance on panel show Loose Women \n   \nUnbreakable bond: The pair, who are real life friends, have had nothing but nice words about one another \n   \n'We really are just having the best time': Toni recently revealed that she is loving being on the road with Drew \n\nMiss You Already sees Drew and Toni  portray childhood friends, who remain attached at the hip even in their adult years. \n\nHowever, Toni's free-spirited character Milly is abruptly faced with a cancer diagnosis, while Drew's character Jess finally finds herself pregnant after various attempts. \n\nDirected by Catherine Hardwicke and written by Morwenna Banks, the comedy drama hits UK cinemas on September 25. \n   \nComing soon... Barrymore and Collette have been to various cities to promote Miss You Already \n  \nWalk that walk: Drew wore her ombré hair down in loose waves styled in a centre parting \n   \nIn good hands: Barrymore was escorted around by a member of her security team \n   \nCentre of attention: The American actress was surrounded by fans as she said a few hellos \n\nSpeaking about why she was keen to take on the role of Jess, Drew admitted during an interview on Lorraine it was purely down to the fact she would be working alongside Toni. \n\nShe said: 'I came here to London to be with you. I love you and believe in you and I wanted you to know that I literally have your back with this.' \n\nDespite the emotional plot, Toni maintained the film's underlying message is a positive one. \n\n'It's not a Debbie Downer, it's a celebration of life,' she said. \n\nOn working with Toni, Drew added: 'We really are just having the best time.'  \n   \nMaking time for the fans: Outside the studio, Barrymore stopped to sign her autograph some her admirers", "source": "Mail Online UK"}