{"published": "2015-09-28T19:34:07Z", "media-type": "News", "title": "The Latest Murkowski calls for clear path to drilling", "id": "17f04bf0-320f-4c6d-8f7c-01dc07db12d0", "content": "The latest on Royal Dutch Shell ending exploratory oil drilling in the Arctic Ocean (all times local):\n\n11:20 a.m.\n\nAlaska's senior senator is calling on the Obama administration to work with Alaskans to develop a clear path for drilling in the Arctic.\n\nAlaska Republican Sen. Lisa Murkowski urges the administration to developing a legitimate, predictable and sensible regulatory system that will encourage oil companies to invest in Alaska, both onshore and off.\n\nShe made the statement Monday on the heels of Shell saying it will cease Arctic operations, in part due to unpredictable federal regulations.\n\nAlaska's junior senator, Republican Dan Sullivan, said environmental groups are cheering the news, but he says it's a sad day for Alaska and working Americans.\n\nOregon Sen. Jeff Merkley countered it's tremendous news, and a credit to the people who made clear that Arctic drilling in unacceptable.\n\nThe Democrat says the U.S. should \"seize the moment\" and use its chairmanship of the Arctic Council to develop and agreement to end offshore drill among all Arctic nations.\n\n---\n\n10:25 a.m.\n\nThe president of the Alaska Native regional corporation for Iñupiat living on the Arctic Slope said the news that Royal Dutch Shell is ceasing exploratory drilling in the Arctic is a major blow for Alaska.\n\nRex A. Rock Sr. with the Arctic Slope Regional Corp. says the timing is bad as Alaska is facing a \"financial crisis\" because of low oil prices and dwindling production from Prudhoe Bay.\n\nRock says it also hits close to home to for communities dependent upon oil production.\n\nWithout resource development both on- and off-shore, he says they are facing \"a fiscal crisis beyond measure.\"\n\nShell also cited \"the challenging and unpredictable federal regulatory environment\" in deciding to end drilling in the Alaska Arctic for the foreseeable future.\n\nRock says that regulatory environment has proven to be a burden to development. He adds it will lead to more good opportunities slipping away because \"no one wants to do business in Alaska.\"\n\n---\n\n9:58 a.m.\n\nAlaska Gov. Bill Walker says Royal Dutch Shell's decision to stop exploratory drilling in the Arctic shows the state needs to drive its own destiny through oil and gas development.\n\nShell said Monday that it was ending operations in the Chukchi Sea off Alaska after a test well gave disappointing results. The company has spent $7 billion on its Alaska drilling program.\n\nWalker says he's contacted the White House to set up meetings about the impact of Shell's decision on the state. The governor also says he will stress the importance of the federal government allowing oil and gas drilling along the coastal plain of the Arctic National Wildlife Refuge.\n\nAlaska's budget relies heavily on oil revenue, but production from the once-prodigious North Slope now barely fills a quarter of the trans-Alaska pipeline.", "source": "Modesto Bee"}