{"published": "2015-09-04T16:10:22Z", "media-type": "News", "title": "Shoreham crash jet showed 'no abnormal indications' during flight", "id": "44e576e9-a37d-48aa-833c-53e93357cd2a", "content": "Footage from cockpit cameras in the  vintage jet involved in the Shoreham disaster has revealed the  aircraft showed \"no abnormal indications\" during the flight, according to  air crash investigators. \n \nThe interim report  by the Air Accidents Investigation Branch (AAIB) also noted that the video showed the 1950s Hawker Hunter jet \"appeared to be responding to the pilot's control inputs\". \n \nEleven people died when the plane  plummeted on to the A27 in West  Sussex during the Shoreham Airshow on August 22. \n \nThe jet failed to pull out of a loop-the-loop stunt before crashing on to the road, exploding into a fireball. \n \nThe pilot, Andrew Hill,  was left fighting for his life and has been moved to a specialist hospital for treatment. \n \nThe AAIB said the plane went into the manoeuvre at 200 feet. \n \nDavid Learmount, a former pilot and RAF flying instructor, claimed the crash would not have happened if the plane had started at a higher altitude. \n \nHe told the Press Association:  \"When you go into a vertical manoeuvre you tend to go out of it in the same height you go in, but it's easy to come out of it slightly lower - you don't have to take much of a misjudgement to do that. \n \n\"If you go into it low you have reduced the room for error.\" \n \nMr Learmount, who is consulting editor of Flightglobal online magazine, added: \" If he had been 500 feet when he entered the manoeuvre and done exactly the same thing 11 people would be alive today.\" \n \nThe AAIB found that the pilot and his seat were thrown from the cockpit as the plane hit the ground.  The investigation has not yet determined whether this was caused by an attempted ejection or the impact of the crash. \n \nAccording to the interim report the Hawker Hunter was not fitted with a flight recorder but there were  two \"image recording cameras\" mounted within the cockpit. \n   Promoted stories   \nOne was located between the two seats, giving a partial view of the pilot and instrument panel, as well as a view through the cockpit canopy and windscreen. \n \nThe report stated: \"To date no abnormal indications have been identified. \n \n\"Throughout the flight, the aircraft appeared to be responding to the pilot's control inputs.\" \n \nThe other camera was mounted at the base of the windscreen looking over the nose. \n \nThe preliminary report noted that investigators have  received a \"large amount\" of video and photographs of the aircraft from various locations around Shoreham Airport, where the airshow was taking place. \n \nMany of these are in  high definition and will be analysed in a bid to determine the parameters of the jet's manoeuvres, including flight path and speed. \n \nThe AAIB said  the pilot carried out a pre-flight inspection before taking off from North Weald Airfield, Essex, to fly to Shoreham and there were \"no reported defects\". \n \nThe document added: \"The pilot was described as being in good spirits and looking forward to the flight.\" \n \nMost of the aircraft w reckage has been recovered and sent to the AAIB's headquarters in Farnborough, Hampshire. Work continues to locate some small pieces of the plane. \n   \n Share article  \n   \nThe victims have been named as retired engineer  James Graham Mallinson, 72, from Newick,  near Lewes;  window cleaner and  general builder Mark Trussler, 54, from Worthing; cycling friends Dylan Archer,  42, from Brighton, and Richard Smith, 26, from Hove; NHS manager Tony  Brightwell, 53, from Hove; grandfather Mark Reeves, 53, from Seaford; Worthing  United footballers Matthew Grimstone and Jacob Schilt, both 23; personal trainer  Matt Jones, 24; wedding chauffeur Maurice Abrahams, 76; and Daniele Polito, 23,  from Worthing. \n \nThe inquest into their deaths was opened and adjourned at a hearing in Horsham on Wednesday.", "source": "Hampshire Chronicle"}