{"published": "2015-09-11T09:45:04Z", "media-type": "Blog", "title": "4 Incredible Ways to Heal Yourself With Turmeric", "id": "4cfbbbda-0fd6-4ace-9723-059f41263634", "content": "Turmeric is one of those spices you know at first taste. Complete with a golden hue, this peppery and earthy flavour makes its mark in many traditional South Asian and Middle Eastern meals. And while many people love to spice it up with turmeric, they may also want to incorporate it for its incredible health benefits as well. Curcumin is the compound in the spice that not only gives it its vivid colour, but also provides it with anti-inflammatory, antioxidant, antitumor, antibacterial and antiviral properties, as noted from research in the Journal of the American College of Nutrition.\nHere are four conditions you can improve by incorporating turmeric into your diet. 1. Acne Since turmeric has anti-inflammatory properties, it only makes sense that it would help alleviate zits, which are simply inflamed pores. Tasneem Bhatia, MD, author of What Doctors Eat, says that one way to treat bad skin with this spice is by blending turmeric with water or yogurt into a paste. 2. Pain Before you pop another pill, try using turmeric, which is a much safer option for alleviating your pain. According to Isaac Eliaz, MD, founder of the Amitabha Clinic & Healing Center, this spice supports circulation, immunity and tissue repair. 3. Diabetes While you may assume it’s simply steering clear of too much sugar that will help you to avoid diabetes, a study from Diabetes Care found that for people who were diagnosed with prediabetes, taking daily curcumin capsules for nine months protected them from developing full-blown type 2 diabetes. 4 . Bloating Eliaz says that gut inflammation can be a cause of bloating, which makes turmeric come at the top of the list for natural ways to relieve this condition. And in addition, this spice can keep your digestion on track and avoid gut issues by promoting circulation and detoxification. Do you incorporate turmeric into your diet regularly? Source: Prevention Do you follow us on Instagram? @BodyRockTV", "source": "BodyRock"}