{"published": "2015-09-27T12:46:06Z", "media-type": "News", "title": "USL Match Recap: New York Red Bulls II 4, Pittsburgh Riverhounds 2", "id": "e6af0954-62a7-40e4-aee3-9964f30b6dc6", "content": "The win sends New York Red Bulls II to the Eastern Conference Semifinal where they will face the top-seeded Rochester Rhinos next Saturday in Rochester, NY. \nPittsburgh wasted no time in the first half and took advantage of their first scoring chance of the match. Set up with a free kick from distance, Danny Earls sent a curling cross into the box. Willie Hunt rose above the fray in the box to head home the opening goal. \n\nA series of close calls ensued for each side. Shawn McLaws centered a ball to Manolo Sanchez, who gathered the ball at the penalty spot, turned and fired, but Calle Brown was there to make the diving save. The Riverhounds countered and nearly doubled their lead in the 20th minute, when Hunt slammed a shot from an angle off the far post and out. \n\nMcLaws attempted to link up with Sanchez again in the 29th minute when the right back swung in a cross, but Sanchez's header, although struck well, flew straight into the arms of Brown. Red Bulls II outshot the Riverhounds 9-3 in the opening 45 minutes. \n\nNew York eventually took advantage in the 62nd minute on the counter-attack. Stefano Bonomo spotted Sanchez as Red Bulls II charged forward and delivered a leading ball to the forward. Sanchez collected the pass in the box, cut back to shake a defender and fired to the back post to level the match at one. \n\nRed Bulls II nearly took the lead in the 86th minute on a short corner kick. Leo Stolz laid it off to McLaws who struck a curling ball towards the back post. Colin Heffron laid out for the cross and headed it low towards the corner, but Brown was there to make the desperation save. Both teams pressed for the go-ahead goal in the final minutes of regulation, but no winner was found and the match was sent into extra time. \n\nPittsburgh opened the scoring in extra time on a corner kick in the 96th minute. Taken by Matt Dallman, the in-swinger connected with Hunt who headed home his second goal of the match. But New York would answer once again. In the 101st minute, second half substitute Daniel Bedoya took a corner kick for Red Bulls II. The cross connected with the head of Ouimette, and the Canadian international's header found the back of the net for the late equalizer. \n\nIn the second period of extra time, Ouimette grabbed his second goal of the extra time period and the game-winning goal of the match. On another corner kick taken by Bedoya, Ouimette got on the end of the curling cross and finished it to put Red Bulls II ahead in the 115th minute. The Riverhounds nearly tied the match again when Kevin Kerr chipped Santiago Castano, but the shot went wide left. Daniel Bedoya iced the match with a goal in the 119th minute and Red Bulls II clinched its first postseason victory in club history. \n\nNew York Red Bulls II advances to the Eastern Conference Semifinal which will be played next Saturday, Oct. 3 at Sahlen's Stadium in Rochester, NY, against the top-seeded Rochester Rhinos at 7:05 p.m. ET (WATCH: Live stream available on NewYorkRedBulls.com/Live). \n\nScoring Summary: \n\r\nPGH: Willie Hunt (Danny Earls) 15' \n\r\nNY: Manolo Sanchez (Stefano Bonomo) 62' \n\r\nPGH: Willie Hunt (Matt Dallman) 96' \n\r\nNY: Karl Ouimette (Daniel Bedoya) 101' \n\r\nNY: Karl Ouimette 115' \n\r\nNY: Daniel Bedoya 119' \n\nDiscipline Summary: \n\r\nPGH: Lebo Moloto, Caution 60' \n\r\nPGH: Anthony Arena, Caution 65' \n\r\nPGH: Ben Newnam, Caution 120'+ \n\r\nPGH: Ben Newnam, Ejection 120'+ \n\nLineups: \n\r\nNY: Santiago Castano, Shawn McLaws, Karl Ouimette, Konrad Plewa, Colin Heffron (James Thomas, 107'), Leo Stolz (Franklin Castellanos, 99'), Speedy Williams, Sean Davis (Bolu Akinyode, 97'), Manolo Sanchez (Mike Da Fonte, 120'), Stefano Bonomo, Marius Obekop (Daniel Bedoya, 83') \n\nSubs not used: Rafael Diaz, Chris Tsonis \n\nPGH: Calle Brown, Willie Hunt, Anthony Arena, Sterling Flunder (Miro Cabrilo, 112'), Matt Dallman (Drew Russell, 118'), Danny Earls, Rob Vincent, Lebo Moloto, Boris Zivanovic (Michael Green, 71'), Vini Dantas (Ben Newnam, 83'), Kevin Kerr \n\nPaddockTalk Perspective", "source": "PaddockTalk"}