{"published": "2015-09-23T14:14:42Z", "media-type": "News", "title": "SMA Solutions Signs Oracle Gold Partnership", "id": "41cf0478-f751-4634-a74a-a7d5e1d6bbaf", "content": "KINGWOOD, Texas , Sept. 23, 2015 /PRNewswire/ --SMA Solutions today announced that it has achieved Gold Partner status in Oracle PartnerNetwork (OPN). By attaining Gold Level membership, Oracle has recognized SMA Solutions for its commitment to establish Oracle related knowledge in Oracle's product line and demonstrates the company's commitment to further develop and expand in the area of Oracle automation solutions. \n  \nWith newly developed connectors for Oracle's critical business application, SMA's flagship workload automation product, OpCon, will ensure ongoing high availability and reliability in all advanced automation centers. \n \nOpCon's Oracle solutions can be integrated into one enterprise-wide point of control. Whether companies are running applications, legacy and open systems or cloud-based platforms, OpCon provides reliable automation. By automating jobs, tasks, and processes, OpCon reduces errors and enables businesses to streamline their IT operations. By ensuring high availability and reliability, OpCon provides IT infrastructures with a solid foundation to leverage Oracle's critical business application. \n\n\n\nThe partnership of OpCon and Oracle solutions will improve service, streamline operations and reduce IT requirements.IT staff is no longer dependent on single points of knowledge to run their operations. OpCon is an easy-to-use, graphical solution. \n \n\"We're excited about the continued expansion of our relationship with Oracle,\" said, Todd Dauchy CTO at SMA Solutions. \"We believe that this partnership will bring great value to our joint customers. With this partnership, our customers can take better advantage of our combined knowledge and services.\" \n \nAbout SMA Solutions : \n \nFounded in 1980, SMA Solutions is a privately-owned corporation that has delivered transformative software tools to more than 600 organizations around the world; significantly increasing their productivity, efficiency and accuracy.Its flagship product, OpCon, is the most robust IT automation solution available in the marketplace. To find out more visit www.smasolutions.it \n \nAbout Oracle PartnerNetwork: \n \nOracle PartnerNetwork (OPN) Specialized is the latest version of Oracle's partner program that provides partners with tools to better develop, sell and implement Oracle solutions. OPN Specialized offers resources to train and support specialized knowledge of Oracle products and solutions and has evolved to recognize Oracle's growing product portfolio, partner base and business opportunity. Key to the latest enhancements to OPN is the ability for partners to differentiate through Specializations. Specializations are achieved through competency development, business results, expertise and proven success. To find out more visit http://www.oracle.com/partners . \n \nContact: Kelly Larson \nSMA Solutions \nPhone: 281-446-5000 \nEmail \n  \nLogo - http://photos.prnewswire.com/prnh/20150922/269264LOGO  \nLogo - http://photos.prnewswire.com/prnh/20150922/269265LOGO  \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/sma-solutions-signs-oracle-gold-partnership-300147564.html \n \nSOURCE  SMA Solutions \n \nCopyright 2014 PR Newswire.  All Rights Reserved \n\nSource:PR Newswire.\n All Rights Reserved", "source": "Digital Media Net"}