{"published": "2015-09-02T19:00:00Z", "media-type": "News", "title": "SAE International to Host Augmented-Virtual Reality (AR/VR) Technologies Symposium", "id": "f65e237d-7771-4b85-b6a3-76dc264be5a3", "content": "SAE International will host the 2015 Augmented and Virtual Reality (AR/VR) Technologies Symposium on Nov. 5-6 in Birmingham, United Kingdom. The symposium is being organized SAE Global LLC. \n   \nWARRENDALE, Pa. (PRWEB) September 02, 2015 \n \nSAE International will host the 2015 Augmented and Virtual Reality (AR/VR) Technologies Symposium on Nov. 5-6 in Birmingham, United Kingdom. The symposium is being organized SAE Global LLC. The SAE 2015 Augmented and Virtual (AR/VR) Technologies Symposium will be co-located with Advanced Engineering UK 2015. \n \nLeaders in AR/VR technology will converge in Birmingham to explore the possibilities of linking design, manufacturing and final assembly into their organization’s digital thread, justifying the long-term value of augmented and virtual technology. \n \nThe opening keynote address - The Future of the PC; Leaving the Era of the Personal Computer and Entering the Era of More Personal Computing - will be delivered by Roger Walkden of Microsoft Studios/HoloLens. Walkden’s address will focus on how improvements in hardware design are giving rise to new experiences across devices and how software is running to keep up. \n \nTechnical sessions will include: \n\n Matching Technology Readiness to Industrial Use-Cases;  Classifying, Assessing and Managing Risk with Enterprise AR Introduction;  Virtual Reality in Industry: Cradles Embarkation Simulation in Manufacturing Submarines;  Virtual Reality - Don’t Forget We Are Human;  Integrated Process for Optimal Factory Layouts in VR;  Introducing New Technologies in a Complex Organization; and  Experiencing Virtual Manufacturing - A Collaborative Product Development.  \nA technical expert panel discussion will explore the topic of head mounted displays. Elizabeth S. Baron of the Ford Motor Company will moderate a panel consisting of Paul Davies of Boeing Research & Technology; Robert Forrest of BAE Systems; Chris Freeman of AMRC with Boeing; Walkden; and Richard M. Wiles of National Grid. \n \nIn addition, attendees will have the opportunity to tour Jaguar Land Rover’s Virtual Engineering Centre to see how they are utilizing VR to design prototypes to the last detail without making them in solid form, and to see how they look and work from all angles within their Virtual Reality facility. For details, visit http://www.sae.org/events/arvr/attend/special-events/techtour.htm . \n \nTo learn more about the symposium or to register, visit http://www.sae.org/events/arvr/ . To request media credentials, email pr(at)sae(dot)org or call 1-724-772-8522. \n \nSAE International is a global association committed to being the ultimate knowledge source for the engineering profession. By uniting over 137,000 engineers and technical experts, we drive knowledge and expertise across a broad spectrum of industries. We act on two priorities: encouraging a lifetime of learning for mobility engineering professionals and setting the standards for industry engineering. We strive for a better world through the work of our charitable arm, the SAE Foundation, which helps fund programs like A World in Motion® and the Collegiate Design Series™. \n Read Full Article        \n          - http://www.sae.org - \n \nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/08/prweb1292924", "source": "Stamford Advocate"}