{"published": "2015-09-30T03:39:22Z", "media-type": "News", "title": "Long weekend 'perfect storm' of traffic sparks plea from NSW Police", "id": "89662c35-9191-4c76-8029-98c89ed9f946", "content": "The beers will be flowing, fans revelling and sun blaring, laying the foundations for what police fear could be the perfect storm. The beers will be flowing, fans revelling and sun beaming, laying the foundations for what police fear could be the \"perfect storm\".\n\nAhead of the upcoming long weekend - packed with sporting finals, school holidays and good weather - police have urged people to take it easy on NSW roads.\n\n\"Please, please listen, please take these messages on board,\" NSW Police Deputy Commissioner Catherine Burn said on Wednesday.\n\n\"We just have to stop killing ourselves and killing other people on the roads.\"\n\nThe NRL grand final will kick off at ANZ Stadium in Sydney on Sunday, a day after the AFL grand final in Melbourne on Saturday afternoon.\n\nEmergency services are aware this will be coupled with a temperature expected to reach 29 degrees in Sydney on Saturday and 30 degrees on Sunday.\n\nOperation Slow Down will be rolled out this Labour Day long weekend with a large number of motorists expected on the roads.\n\nWith the road toll for this year already at 259 - compared with 233 at the same time last year - police have pleaded with drivers to take extra care.\n\nCentre for Road Safety acting executive director Bernard Carlon said there had been a 50 per cent increase in pedestrian and passenger deaths compared with the same time last year.\n\n\"We know on our roads there are three factors causing the deaths: speeding, driving when you are tired and drink driving,\" he said.\n\nAnd for many this weekend, a drink or two will no doubt be part of the equation.\n\n\"We are going to have a lot of people out, we have got football finals and we have a lot of excitement - it is going to be great,\" Ms Burn said.\n\n\"People generally consume alcohol moderately and that's wonderful.\n\n\"But if you are going to consume alcohol, there are limits about getting into a car.\"\n\nMs Burn said over time the road toll had been decreasing - with the 2014 toll the lowest since the 1920s.\n\nBut at the moment, there was a spike in road fatalities in NSW.\n\nSports fans attending the NRL grand final are urged to avoid traffic delays and take public transport on Sunday. The story first appeared on The Sydney Morning Herald.", "source": "Yass Tribune"}