{"published": "2015-09-29T14:31:22Z", "media-type": "News", "title": "Dieters: Don’t Replace Saturated Fats With Processed Carbs", "id": "ec64fa64-de9a-41c2-a063-6e20129617d4", "content": "Study found those who turned to whole grains and healthy fats saw a drop in heart risks. \nBy Emily Willingham \nHealthDay Reporter \n \nTUESDAY, Sept. 29, 2015 (HealthDay News) -- When trimming saturated fat from your diet, subbing in whole-grain foods helps your heart, but turning to white bread doesn't, a new study shows. \n \n\"This is very important stuff,\" said Dr. Robert Vogel, a cardiologist at the University of Colorado, Denver, who wrote a commentary accompanying the published study. \"If you substitute high-quality carbohydrates like fruits, vegetables and whole grains, then lives are saved. It's that simple.\" \n \n\"Folks don't just spontaneously drop a few hundred calories of saturated fat out of their diets without replacing them with something else,\" explained study first co-author Adela Hruby, a research fellow at Harvard T.H. Chan School of Public Health in Boston. \"The 'something else' makes a difference to their health.\" \n \nThe study and the commentary were both published online Sept. 28 in the Journal of the American College of Cardiology . \n \nHruby and her colleagues based their conclusions on information from close to 85,000 women and almost 43,000 men, all participants in two long-running investigations, the Nurses' Health Study and the Health Professionals Follow-up Study. \n \nAll of the men and women were free of diabetes, heart disease and cancer when they signed on. Researchers tracked details on many aspects of the participants' lives, including their diets. \n \nHruby and her colleagues assessed results of food questionnaires completed by the study volunteers every four years. During a follow-up period of up to three decades, coronary heart disease was diagnosed in more than 7,600 participants. \n \nThe study authors compared self-reported food frequencies between those who did and did not develop heart disease. \n \nThe researchers found that when the men and women replaced 5 percent of their saturated fat calories with healthier polyunsaturated fats, such as those found in nuts, the risk for coronary heart disease dropped by 25 percent. \n \nReplacement with monounsaturated fats such as olive oil dropped risk by 15 percent, and replacement with whole-grain carbs was linked with a 9 percent decrease in heart disease risk. \n \nBut subbing in processed carbs such as white bread or white rice for saturated fat had no effect on risk for heart disease. \n \nThis lack of effect means that saturated fat, found in animal products like butter and red meat, looks neutral for heart disease only when it's compared to eating refined carbs and sugar instead. Compared to other options, though, it's the non-heart-healthy choice. \n \nHowever, the study only found an association between dietary fats and heart risk, not a cause-and-effect relationship. \n \n\"When you compare it to other types of fat or whole grains, saturated fat is not benign, as some recent studies appear to have suggested,\" said Hruby. \n \nVogel emphatically agreed. \"People need to know that saturated fat is bad, and numerous studies have shown this,\" he said. \n \nThe findings also mean that consumers should get rid of saturated fat, said Michelle Cardel, a spokesperson for the Obesity Society and an assistant professor in the department of health outcomes and policy at the University of Florida, in Gainesville. \n \n\"Rather than trying to add more healthy fat into your diet, the focus should be on replacing saturated fats with healthy fats,\" Cardel said. \"You can replace them with foods high in healthy fats, including fatty fish like salmon, avocados, nuts and seeds.\" \n \nVogel has some very specific advice for the health-conscious consumer. \"If you insist on meat, eat lean meat,\" he said. \"Poultry would be better than [red] meat, white meat poultry would be better than dark meat, and fish would be better than poultry.\" \n \nWhen it comes to carbs, said Vogel, check the nutrition labels for two key features of whole grains. \"A whole grain is something where the first ingredient says 'whole grain,' not the third or the fifth, but the first,\" he said. The second feature is that the whole-grain food contains at least 3 grams of fiber per serving. He added, \"5 grams would be better, 7 would be better still.\" \n \nReplacing saturated fat with healthier fats and healthy carbs doesn't mean sacrificing taste, said Hruby. Pointing to foods with healthier polyunsaturated and monounsaturated fats, such as walnuts, salmon and olive oil, she noted that \"many of these foods have been a part of other delicious dietary patterns, like the Mediterranean diet, for decades, maybe even centuries.\" \n \nCardel agreed. \"People tend to love foods with higher quality fats, like avocados, nuts and seeds,\" she said, but acknowledged that \"sometimes people are a little bit wearier of high-quality carbohydrates. Starting with more familiar healthy carbohydrates, such as fruit, oatmeal, beans and whole-wheat bread can make the transition easier.\" \n \nVogel said that people don't need to retrain their taste buds to eat healthier -- \"they have to retrain their brains.\" \n \nMore information \n \nVisit the Mayo Clinic for more on dietary fats. \n \nSOURCES: Robert Vogel, M.D., cardiologist, division of cardiology, University of Colorado, Denver; Adela Hruba, Ph.D., M.P.H., research fellow, department of nutrition, Harvard T.H. Chan School of Public Health, Boston; Michelle Cardel, Ph.D., R.D., spokesperson, Obesity Society, and assistant professor, department of health outcomes and policy, University of Florida, Gainesville; Sept. 28, 3015, Journal of American College of Cardiology , online \n \nCopyright © 2015 HealthDay . All rights reserved. \n Submit your opinion", "source": "Doctors Lounge"}