{"published": "2015-09-02T17:41:06Z", "media-type": "Blog", "title": "If You Are Contacting Someone Dealing with cancer...", "id": "f15be77b-398b-484f-969c-db7e1b44d932", "content": "I have found myself having to educate people on what to expect from me - or not expect. I have taken time to explain things in the hope that people will not feel slighted, offended, ignored.\nThat means that those closest to me hopefully \"get it.\" \nBut there is a class of people who are strangers who don't get that benefit. I have had people who are wanting to help me in some way who contact me, needing something. They often expect an almost immediate response.\nMany days my phone is turned off. Many times messages are missed. There are times things slip my mind. Sometimes I am sleeping. Other times I feel just too crappy to deal with anyone or anything.\nYes. They want to help me. I understand that, and will do my best to get them what they need. At the same time, my best is sorely lacking, as compared to what one might expect from someone healthy. (Even then, healthy people might not be as responsive as one might hope for.)\nBut the point is that if you know you are dealing with someone dealing with cancer, it would be really great if you could be more patient, compassionate, understanding, and less demanding. The last thing that person needs is pressure or grief from someone pissed off because  they think they are somehow ungrateful, when in fact they may just be really miserable and overwhelmed.\nTimetables and deadlines might not mean much to a person dealing with cancer. Their focus might just be on surviving, and it might be extraordinarily difficult to deal with the way the world works when in some ways they no longer are a part of it. And it is not a willful ignorance. It is not mean-spirited. It is not a lot of things people might label it. \nFor many it may be about survival. And it really may just as simple as that.\nWe seem to have issues with things that are exceptions. But the thing is, if anyone was ever deserving of exceptions and rules being broken, or special rules or considerations, it is going to be someone dealing with cancer. \nIf you've never been in cancer-land, odds are there is a lot you couldn't/wouldn't know. It is my hope that by me speaking up, the word will get out somehow. If you find my words helpful in some way, please share this message.\nI will also add that this can apply to others, as well. There are some I know dealing with major health concerns who could likely also appreciate and benefit from a kinder approach. So please keep that in mind if you are contacting someone who you know has issues - whether you understand them, or not.\nIn general, I think we could all benefit if there was a shift in the way things were handled - but that's another topic.\nThanks for sharing.\nPs If you'd like to subscribe to my posts, just enter your email address at this link http://feeds.feedburner.com/blogspot/VVPeD or here https://feedburner.google.com/fb/a/mailverify?uri=blogspot/VVPeD\nWant to know more about me?\nhttp://anewme515.blogspot.com/2013/01/about-this-blog.html", "source": "A New Me - Relating to Cancer"}