{"published": "2015-09-28T19:09:10Z", "media-type": "News", "title": "Kylie Jenner & Tyga Fight Over His Small-Time Career: Why Can’t You Be More Like Drake", "id": "88019730-0c70-4bfd-8da4-6b7797aa504a", "content": "Kylie Jenner and Tyga are constantly all loved up and can’t keep their hands off each other but our source tells us that they do fight! Keep reading to find out how Drake is involved!  \nKylie Jenner  is totally in love with Tyga but she’s not very happy with his career! The 18-year-old, who is currently outselling her sisters with her app, is pushing Tyga to make more money and she thinks he should be more like her good friend, Drake ! Yikes! It turns out Tyga isn’t taking this too well and is deeply hurt that the love of his life would slam him like this. \n \n“Kylie loves Tyga dearly and she wants to support him and his every move,” our source tells us. “But she’s got a problem on her hands: and that’s the fact she’s light years ahead of him when it comes to money, career and fame. She wants him to have exactly what she has, if not more, and she’s been busting his chops, encouraging him to get in the studio and pump out some hits. She’s not berating him to do so, she’s simply encouraging him. She asked him once ‘don’t you want to be in the club and hearing the fans rap one of your songs like they do Drake?’ He got extremely offended And heated!” \n \nSo how did Tyga handle all of this? “He said ‘bae how dare you compare me to that meathead Drake. That’s fu**ked up. you don’t know anything about rap. There’s much more skill involved than sitting around Snapchatting all day.’ Kylie didn’t take offense to it, all she said was ‘you’re right’ and ‘I was just trying to motivate you.'” But they still can’t keep their hands off each other and this is just a small blip in the road. “The guy even made her an appointment at the DMV so Kylie can have personalized plates on the Ferrari that reads ‘wifey,’ He wants her to get the name ‘Tyga’s Wife’ on her license plate. He’s into Kylie that much!” It doesn’t look like anything can stop these two! \n Take Our Poll \nHollywoodLifers , do you think it’s fair for Kylie to put pressure on Tyga? \n— Reporting Eric Mitchell, Written by Chloe Melas", "source": "Hollywood Life"}