{"published": "2015-09-02T19:13:58Z", "media-type": "News", "title": "Wage abuse claims spread to petrol chain United Petroleum", "id": "5c4ec932-66cb-4623-858c-9f8551987075", "content": "Franchisees at United Petroleum service stations have told the ABC that staff at some sites are being underpaid and allege the company has been warned. \n\nThe petrol station giant has rejected the claims, saying it \"would never be involved in a business ripping off workers\". \n\nOne franchisee operating a service station that is open 24 hours a day has admitted to paying his workers just $15 per hour. \n\nHe said he has put employees on the books for doing 20 hours of work rather than the actual 40-50 per employee. \n\nThe man said he believes some United employees were only being paid about $10-12 per hour, and claimed he has told a senior manager about underpaying workers with no response. \n\nThis week Four Corners exposed wide-spread underpayment of employees at 7-Eleven petrol and convenience stores , with former head of the Australian Competition and Consumer Commission (ACCC) Alan Fels saying: \"the only way of making profit in many cases is to underpay workers.\" \n\nUnited Petroleum franchisees have told the ABC similar problems exist at United, with some underpaid employees on temporary visas and therefore reluctant to complain. \n\nUnited's chief operating officer (COO) David Szymczak said: \"United Petroleum was shocked by 7-Eleven's conduct, and certainly do not operate in that way.\" \n  7-Eleven investigation  \nThe ABC has obtained an email sent from one franchisee to two senior United Petroleum managers in 2013. \n\nThe email says, \"I really want to be able to afford & start paying award rates but the financial compulsions are something I do not have control over. I believe everyone else in the network must be in same position.\" \n\nThe franchisee told the ABC the company ignored his repeated pleas to discuss the issue. \n\nMr Szymczak said on behalf of the company: \"We are unsure who you are referring to in your email. \n\n\"It is thus not possible at this time to investigate the existence of such an email, its context, or our response.\" \n\nHe said United would give financial advice and assistance to franchisees if they required it. \n\nAnother franchisee told the ABC he believed some sites underpaid workers and \"the business model did not allow us to pay the required full award and penalty rates for staff\". \n\nLast week the ABC revealed three former franchisees are involved in legal action against United Petroleum claiming they were unfairly kicked out of their businesses following disputes with the company, each losing up to half a million dollars. \n\nOne franchisee has alleged in court documents that United forces its franchisees to buy stock above market prices, which damages profitability. \n\nOne of those franchisees has said he paid the award wage to employees but that was part of the reason his business was unprofitable. \n\n\"It's a business model that makes money for them [United]\", the man who did not wish to be identified said. \"It's not workable.\" \nUnited says Franchise Agreement compels fair wages \nUnited strenuously rejected the allegations. \n\nMr Szymczak said in a statement, \"in our Franchise network, the payment ... of wages and entitlements is a matter for our Franchisees and we have no involvement. \n\n\"Our Franchise Agreement clearly compels our Franchisees to pay award wages and all entitlements under law. \n\n\"It is the role of Fair Work to ensure that independent businesses comply with the award provisions. We do not recall ever being contacted by that agency about any franchisee's conduct.\" \n\nMr Szymczak said on behalf of the company he had no knowledge of employees being underpaid. \n\n\"If any Franchisee is not paying award wages then the Franchisee would be clearly in breach of their Franchise Agreement with United ... we have never had a franchisee's business go broke.\" \n\nIndependent service station owners say it is getting harder to compete against the big chains. \n\nBarney Hogan has run a petrol station at Emerald, in Victoria's Dandenong Ranges, for six years and became emotional when talking about rising costs. \n\n\"We will become an unmanned station at certain periods of time because we can't afford to pay people's Sunday afternoons, it's just not going to happen,\" Mr Hogan said. \n\n\"It's getting to the point where we won't be able to stay open as long because the cost of staying open is just killing us.\"", "source": "ABC Online"}