{"published": "2015-09-27T19:27:43Z", "media-type": "News", "title": "NOTRE DAME NEXT DAY: Irish show their best and worst in win over UMass", "id": "152c93d9-0666-4cb2-a717-3b99622f954f", "content": "SOUTH BEND — The best and worst of what No. 6-ranked Notre Dame has shown so far this season was on display through the first 28 minutes of play Saturday at Notre Dame Stadium. \n  \nThe fact that the next 32 minutes were close to flawless, culminating in a lopsided 62-27 victory over winless Massachusetts, will render the duality a moot point to many fans. The positives were mostly concentrated in the latter stages of the game, so unlike last week when Georgia Tech scored twice in the final 48 seconds, they're the easiest to remember. \n \nBut it would be foolish to dismiss the negatives — even in a game the Fighting Irish were expected to win by a margin closer to 100 than 10. In fact, mistakes are magnified against lesser opponents, especially as a de facto warmup for next week's game at No. 11 Clemson, Notre Dame's most difficult test to date. \n \n“I think the thing that stands out is we challenged our football team at halftime to play to a higher standard,” Notre Dame coach Brian Kelly said. “I think they played to a higher standard in the second half offensively and defensively.” \n \nA nervous energy enveloped South Bend when the Minutemen scored twice in a five-minute stretch to make it a one-point game, 14-13, early in the second quarter. The ways UMass reached the end zone were particularly troubling for the Irish. \n \nMarquis Young dashed 83 yards to the house through the teeth of the Notre Dame front on UMass' next play from scrimmage after Notre Dame went up 14-0. The Minutemen, behind the arm of quarterback Blake Frohnapfel, were known for their passing acumen, but they went into halftime with 121 rushing yards after a few chunk gains. \n \nUMass' second touchdown came after intercepting Irish quarterback DeShone Kizer. Running back Jamal Wilson broke off a 16-yard run to Notre Dame's 2-yard line on third down to setup Sekai Lindsay's 1-yard touchdown run. \n \nBoasting a deep and talented line, Notre Dame's perceived defensive weakness is defending the pass, not the run, so UMass' effectiveness on the ground was surprising. \n \n“We had a couple mental errors by our defense,” senior linebacker Jaylon Smith said. “We definitely were disappointed because we think of ourselves as a dominant run defense and things like that. But it's just something you have to learn (from).” \n \nSecondary concern \n \nThen the shaky secondary play reared its head as the Minutemen again fought back to make it a one-point game. \n \nAfter allowing passing plays of 25 and 16 yards, the Irish were duped again when UMass broke out a flea-flicker that resulted in a 56-yard reception. \n \nIrish cornerback Cole Luke was flagged for interfering with a UMass receiver in the end zone on the following play. Two plays later, defensive lineman Romeo Okwara drew a penalty flag for the same infraction, setting the Minutemen up on Notre Dame's 1-yard line. Once Wilson ran it in from short distance, the Minutemen were down 21-20. \n \nSenior cornerback KeiVarae Russell said the Irish can't replicate the same miscues and expect to win at Clemson. Smith's evaluation of the pass defense was, “some good and some bad.” \n \n“No team is supposed to run on us like that,” Russell said. “No team has — even Georgia Tech didn't even run on us like that. So we were disappointed in certain things, but we tightened it in the second half, and we're excited for that. \n \n“Their offense, how explosive they are, they kind of exposed a few things that we had. And for us it's kind of exciting, just to go right before Clemson and go clean it up and have a great game against them.” \n \nSecond-half positives \n \nAll that being said, the encouraging takeaway for the Irish is the positives considerably outweighed the negatives. If the primary objective is winning the game, they were able to check off a bunch of secondary ones in the process. \n \nTheir 62 points and 457 rushing yards were the most since 1996. C.J. Sanders' second-quarter punt return touchdown was the program's first since 2009. Running back C.J. Prosise became the first Irish player to run for more than 100 yards in three straight games since 2005. \n \nProsise was his usual steady, reliable self, finishing with 149 rushing yards. He added two touchdowns, including the game's first score on a 57-yard jaunt. These kinds of outings have become expected of Prosise, but Saturday's big backfield development was reserve runners Josh Adams and Dexter Williams getting some significant game action. Each of the young backs finished with touchdowns and gave the workhorse Prosise a welcomed opportunity for rest. \n \n“I think they came in and did a good job seeing the holes,” Prosise said. “They both scored, so of course it's great seeing the young guys getting in there getting some game experience and also getting some touches.” \n \nKizer continued to make strides in his second career start under center, and he retired to the bench early in the third quarter after completing 15 of 22 passes for 207 yards and two touchdowns. He operated an efficient two-minute offense, driving the Irish 74 yards in 1:21 exclusively on his throws, capped by a Chris Brown end zone grab. \n \nThe sophomore also was more active in the running game than he has been to this point in his career, toting the ball nine times for 42 yards and a touchdown. \n \nKizer's play — and a 28-point lead — allowed Kelly to hand the offensive reins to backup quarterback Brandon Wimbush on the third possession of the second half. Exposing Wimbush to live game experience has been a priority for Kelly since former starter Malik Zaire suffered his season-ending injury. \n \nIt wouldn't take long for Wimbush to give the Irish fans a reason to hang around despite the mounting blowout. On Wimbush's second drive, he eluded a defender and raced 58 yards to the house to put the Irish ahead by five touchdowns. \n \n“Their varsity was better than our varsity,” UMass coach Mark Whipple said, “and their JV was a little better than our JV.” \n \nNotre Dame's offensive line employed its decisive advantage to pile up a historic rushing total. Its special teams became a weapon with Sanders' touchdown, snuffing out a UMass fake punt and Irish punter Tyler Newsome setting a new school record with a 52.4-yard average. The defense shored up its early errors to yield just 174 total yards in the second half. \n \n“Probably a little bit of a slow start (but we) finished strong,” Kelly said. “All in all, a lot of things to work on, but I like the way we finished.” \n \nFollow Stephen on Twitter @StephenM_Brooks.", "source": "Goshen News"}