{"published": "2015-09-27T08:12:44Z", "media-type": "News", "title": "Bachelor in e-Commerce at CUD is among most sought-after programs", "id": "e2b2b7a4-fa72-492a-9af0-fb86ad65d1be", "content": "Rising importance of e-commerce is reflected in students’ academic choices at university \n \ne-commerce subjects in high demand \n\nThe value of e-commerce is expected to top $13 billion by 2020, making it one of the fastest-growing sectors in the region, and for students looking to future-proof their career prospects, it seems that focused education in this field is becoming increasingly popular. \n \nThe new academic year at Canadian University Dubai (CUD) has witnessed more demand than ever for its unique ‘Bachelor of Commerce in e-Business’ program, which provides students with the opportunity to develop a multi-disciplinary skillset, while gaining hands-on experience of the processes and tools associated with technology-related business solutions. \n \nA strategic shift towards integrated, smart government systems, combined with improvements in commercial services operating online have helped to build consumer confidence in electronic retail, and the region now stands at the gateway of an e-commerce revolution for which a whole new blend of skills are required. \n \nDr. Anas Najdawi, Assistant Professor at CUD said, “Degree programs have traditionally focused upon either the technical competencies, or the business skills, but rarely combine the two. Technology is now embedded in all business functions and professionals in any industry need to know how to apply it effectively.” \n \nHe continued, “The growing proliferation of free tools and platforms means that technology is also the foundation of much of today’s entrepreneurial activity, as it offers a low-cost solution to test and grow innovations and new business concepts.” \n \nAs the only undergraduate course of its kind in the UAE, the e-Business program at CUD offers students the unique opportunity to gain real-world insights into the application of technology in a business environment through its dedicated e-Business Lab, established in partnership with enterprise software corporation, SAP. \n \nDispelling the notion that e-Business requires a technical mindset, Dr. Najdawi revealed that the program is as popular among students who are interested in pursuing a career in marketing, as those who want to be at the forefront of business technology solutions. \n \n“The e-Business program is about providing students with the theoretical knowledge and, most importantly, the practical skills to use existing technology to achieve business goals, whether that is as a digital marketer, enterprise resource planner, business intelligence analyst, or as an innovator and entrepreneur. The applications for technology, and therefore the career opportunities, are limitless.” \n \nAs businesses continue to target technology as a strategic area of investment, and e-commerce accelerates to take on current boom industries such as aviation in the growth stakes, it’s clear that e-Business is emerging as one of the foremost programs for students who want to be a part of the next generation of wealth-creating enterprises. \n      About the Author  AME Info Staff \n  \n  \nshare with your network: \n \n \n  \nArticles that may be of interest to you", "source": "AME Info"}