{"published": "2015-09-29T19:55:55Z", "media-type": "News", "title": "Copper Fox Announces Third Quarter Results", "id": "d3957179-e6ed-48aa-a501-cef8209d528b", "content": "VANCOUVER, BRITISH COLUMBIA -- (Marketwired) -- 09/29/15 --   Copper Fox Metals Inc. (\"Copper Fox\" or the \"Company\") (TSX VENTURE: CUU) (OTC PINK: CPFXF) is pleased to provide its consolidated third quarter operating and financial results. All of the Company's material subsidiaries are wholly owned except for Carmax Mining Corp. (\"Carmax\") (TSX VENTURE: CXM), of which the Company owns 50.97% of the outstanding common shares. These unaudited consolidated financial statements include 100% of the assets and liabilities related to Carmax and include a non-controlling interest representing 49.03% of Carmax's assets and liabilities not owned by the Company. \n\nCopper Fox had a net loss for the quarter of $484,385 ($0.00 loss per share). For the quarter, the Company incurred $513,291 in expenditures toward furthering the development of its Van Dyke and Sombrero Butte copper projects in Arizona. Copies of the financial statements, notes and related management discussion and analysis may be obtained on SEDAR at www.sedar.com , the Company web site at www.copperfoxmetals.com or by contacting the Company directly. All references to planned activities and technical information contained in this news release have been previously announced by way of news releases by the Company. All amounts are expressed in Canadian dollars unless otherwise stated. \n\nQuarterly Highlights \n\nElmer B. Stewart, President and CEO of Copper Fox stated, \"The work during the Quarter consisted of completing the previously announced work programs for each project. The majority of the results for these programs are pending and will be made public on receipt thereof. We are pleased with the results of the work at Sombrero Butte and expect to complete the Preliminary Economic Assessment for Van Dyke on schedule.\" \n\nElmer B. Stewart, MSc. P. Geol., President of Copper Fox, is the Company's non-independent, nominated Qualified Person pursuant to National Instrument 43-101, Standards for Disclosure for Mineral Projects, and has reviewed the scientific and technical information disclosed in this news release. \n\nOutlook \n\nThe Company's focus in the next quarter would be receipt and assessment of the results of the 2015 exploration programs. These results would be used to assess the next phase of work and expenditures required to advance the projects. Major activities going forward include working with Teck to advance the optimization studies at Schaft Creek, completion of the PEA at the Van Dyke ISL copper project and continuing the work necessary to incorporate the legacy and current data into the project database at the Eaglehead project with Carmax. The working capital position of the company is such that, the Company should not require additional working capital to continue as a going concern, for the next year. \n\nSelected Financial Information \n\nLiquidity and Capital Resources \n\nAt July 31, 2015, the Company had working capital of $2,768,469 and an accumulated deficit of $18,428,677 and had comprehensive gain of $48,948 for the nine months ended July 31, 2015. \n\nFixed costs to maintain operations, pay taxes and upkeep on the Arizona properties are approximately $220,000 per annum, this includes an annual payment to Silver Nickel for Sombrero Butte of approximately $157,000 CDN. Corporate and general costs have been approximately $1,200,000 in 2013 and 2014. \n\nAs at July 31, 2015, the Company's cash and cash equivalents were $2.4 million. The Company has access to sufficient funds to meet its current overhead and planned capital expenditures. \n\nAbout Copper Fox \n\nCopper Fox is a Tier 1 Canadian resource company listed on the TSX Venture Exchange (TSX-V: CUU) focused on copper exploration and development in Canada and the United States. Copper Fox and its wholly owned Canadian and United States subsidiaries, being Desert Fox Copper Inc. and Northern Fox Copper Inc., hold the assets listed below: \n\nCopper Fox has four primary assets with associated resources and reserves as noted below: \n\n(i)Proven & Probable \n\n(ii)Measured & Indicated \n\nCopper in billions of pounds, molybdenum in millions of pounds, gold and silver in millions of ounces. \n\nNumbers rounded to reflect best practise principles. \n\n(1) & (2) Technical Report \"Feasibility Study on the Schaft Creek Project, BC, Canada\", dated January 23, 2013, prepared by Tetra Tech, A. Farah, P. Eng.; et al as Qualified Persons; at 0.15% CuEq cut-off. Reserves reported at $6.60/tonne net smelter return (NSR) cut-off. \n\n(3) \"Technical Report and Resource Estimation for the Van Dyke Copper Project\", dated January 30, 2015 prepared by Moose Mountain Technical Services, S. Bird, P.Eng and R. Lane, P. Geo as Qualified Persons; at 0.05% TCu cut-off. \n\n(4) \"Technical Report on the Eaglehead Cu-Mo-Au Project, British Columbia, Canada\", dated June 29, 2012, prepared by Roscoe Postle Associates Inc., B. Donough, P.Geo and D. Rennie, P.Eng as Qualified Persons; at 0.16% CuEq cut-off. \n\nNote: Above stated Proven and Probable reserves are included in the Measured and Indicated resources reported for the Schaft Creek Project. Mineral resources that are not mineral reserves do not have demonstrated economic viability. \n\nOn behalf of the Board of Directors \n\nElmer B. Stewart, President and Chief Executive Officer \n\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. \n\nCautionary Note Regarding Forward-Looking Information \n\nThis news release contains forward-looking statements within the meaning of the Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, and forward-looking information within the meaning of the Canadian securities laws (collectively, \"forward-looking information\"). Forward-looking information in this news release include statements about: participating in the Schaft Creek joint venture and the Company's equity ownership in Carmax; working with Teck Resources Limited to advance the optimization studies and completing the field program at the SCJV; completion of the PEA at the Van Dyke ISL copper project; completing the work necessary to incorporate the legacy data into the project database at the Eaglehead project; and the Company not requiring additional working capital to continue as a going concern, for the year. \n\nIn connection with the forward-looking information contained in this news release, Copper Fox and its subsidiaries have made numerous assumptions regarding, among other things: the geological, metallurgical, engineering, financial and economic advice that Copper Fox has received is reliable and is based upon practices and methodologies which are consistent with industry standards; the continued availability of partners and contractors; and the stability of economic and market conditions. While Copper Fox considers these assumptions to be reasonable, these assumptions are inherently subject to significant uncertainties and contingencies. \n\nAdditionally, there are known and unknown risk factors which could cause Copper Fox's actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking information contained herein. Known risk factors include, among others: anticipated project costs may be exceeded; Teck Resources Limited may no longer be able to participate in the SCJV as planned, or at all; a Preliminary Economic Assessment may never be obtained by the Company for the Van Dyke property as currently planned, or at all; the ongoing work necessary to incorporate the legacy data into the project database may not be completed as planned, or at all; the Company may require additional working capital sooner than predicted; the overall economy may deteriorate; uncertainty as to the availability and terms of future financing; copper prices and demand may fluctuate; currency exchange rates may fluctuate; conditions in the financial markets may deteriorate; and uncertainty as to timely availability of permits and other governmental approvals. \n\nA more complete discussion of the risks and uncertainties facing Copper Fox is disclosed in Copper Fox's continuous disclosure filings with Canadian securities regulatory authorities at www.sedar.com . All forward-looking information herein is qualified in its entirety by this cautionary statement, and Copper Fox disclaims any obligation to revise or update any such forward-looking information or to publicly announce the result of any revisions to any of the forward-looking information contained herein to reflect future results, events or developments, except as required by law. \n\nContacts: \nCopper Fox Metals Inc. \nLynn Ball \n1-844-484-2820 or 1-403-264-2820", "source": "Sys-Con Italia"}