{"published": "2015-09-18T15:39:41Z", "media-type": "News", "title": "Long time ACLU leader Harvey Grossman moves to Senior Counsel role", "id": "87399acf-665a-450c-959d-6f26a63b48ff", "content": "CHICAGO — After more than three decades appearing in courts and legislative bodies on behalf of the American Civil Liberties Union of Illinois, Legal Director Harvey Grossman announced today that he will step down from the position while continuing to serve as a Senior Counsel to the organization.  Grossman, a celebrated civil rights lawyer, has tried cases at all levels of state and federal courts, including the Supreme Court of the United States. \n\r\nDuring his tenure, Grossman served as lead counsel in numerous cases involving a broad range of constitutional rights. He successfully argued two cases before the Supreme Court of the United States and more than fifteen cases in the United States Courts of Appeal for the Seventh and Ninth Circuits, the Illinois Supreme Court and the Illinois Appellate Court. He has litigated more than fifty civil rights cases, primarily class actions, to judgment in the trial courts. \n\n\r\n\"For three decades, I have had the privilege of directing the docket of the ACLU of Illinois, working alongside dedicated lawyers and courageous clients on a range of issues from free speech and freedom from unwarranted intrusions, to privacy and freedom from discrimination,\" said Mr. Grossman in announcing his decision. \n\n\r\n\"I am proud of the accomplishments of the ACLU, and the people who are here — they will do great things in the future.\" \n\n\r\nGrossman's legal career is marked by its profound impact on both the people of Illinois and the development of civil liberties jurisprudence.  His cases have resulted in statewide healthcare standards for Illinois prisons, the election of the first African American City Council member in Cairo, Illinois in more than a century, establishing that persons with HIV are protected by federal anti-discrimination laws, banning the use of punch card voting systems in Illinois, and the U.S. Supreme Court striking down Chicago's loitering ordinance under which tens of thousands of innocent young men were wrongly arrested and jailed. \n\n\r\nAdditional cases have culminated in enjoining the Chicago Housing Authority's infamous program of  warrantless searches of apartments, the U.S. Supreme Court prohibiting political patronage in government contracting,  the Illinois Supreme Court holding unconstitutional the state's prohibition on anonymous election speech and establishing the right of civilians to audio record on-duty police officers. \n\n\r\nIn the legislative arena, Grossman has testified before committees of the United States Congress and the Illinois General Assembly. He played a significant role in the development of the Illinois AIDS Confidentiality Act ( regulating testing and disclosure of HIV status ), the Illinois Traffic Stop Statistical Study Act ( requiring the collection of racial data in traffic stops ) and the Illinois Civil Rights Act of 2003 ( prohibiting disparate impact based on race or gender in all government conduct ). \n\n\r\nGrossman came to the ACLU of Illinois after serving as Litigation Coordinator for Land of Lincoln Legal Assistance Foundation.  At that time, the legal staff of the ACLU consisted of only three lawyers.  Over 30 years, Grossman grew the legal staff to more than 10 full-time lawyers overseeing a docket on issues from free speech to LGBT rights. \n\n\r\n\"It is impossible to overstate the role that Harvey Grossman has played not just in building the legal program in this office, but in protecting the fundamental rights of thousands of people across Illinois,\" said Colleen K. Connell, executive director of the ACLU of Illinois. \"Harvey's love of the law, and his strategic vision about how to use litigation has served our organization well.\" \n\n\r\nAssociate Legal Director Ben Wolf has been named as the acting legal director.", "source": "Windy City Times"}