{"published": "2015-09-17T14:19:41Z", "media-type": "News", "title": "An Exploration into Fern Genome Space", "id": "3d9476a7-2ab1-4835-8bf5-c39e0aa8747d", "content": "Soltis Lab Home  People  Principal Investigators  Lab Managers  Post-Doctoral Associates  Graduate Students  Visiting Scientists  Lab Alumni   Publications  News  Protocols  Code  Grants  Fun stuff  Contact  Lab stuff (Requires login)  \r      Search for:     Recent Posts Kicking off the new year with a party    New species named in honor of Doug: Heuchera soltisii    The fate of polyploid lineages: A response to Mayrose et al. (2014)    Lab Fun Run    Recent Comments   Archives  September 2015  August 2015  July 2015  June 2015  April 2015  March 2015  January 2015  December 2014  October 2014  August 2014  July 2014  June 2014  May 2014  April 2014  March 2014  February 2014  December 2013   Categories  Awards   Fun stuff   Grants   Lab information   News   Outreach   Publications   Recipes   Uncategorized            An Exploration into Fern Genome Space  \nSeptember 17th, 2015 \nBy Gitzendanner, Matt \n \nWolf, P. G., E. B. Sessa, D. B. Marchant, F.-W. Li, C. J. Rothfels, E. M. Sigel, M. A. Gitzendanner, C. J. Visger, J. A. Banks, D. E. Soltis, P. S. Soltis, K. M. Pryer, and J. P. Der. 2015. An Exploration into Fern Genome Space. Genome Biol Evol 7:2533–2544. [ View abstract on publisher’s site ] \n \n\n  Abstract  \nFerns are one of the few remaining major clades of land plants for which a complete genome sequence is lacking. Knowledge of genome space in ferns will enable broad-scale comparative analyses of land plant genes and genomes, provide insights into genome evolution across green plants, and shed light on genetic and genomic features that characterize ferns, such as their high chromosome numbers and large genome sizes. As part of an initial exploration into fern genome space, we used a whole genome shotgun sequencing approach to obtain low-density coverage (∼0.4X to 2X) for six fern species from the Polypodiales ( Ceratopteris , Pteridium , Polypodium , Cystopteris ), Cyatheales ( Plagiogyria ), and Gleicheniales ( Dipteris ). We explore these data to characterize the proportion of the nuclear genome represented by repetitive sequences (including DNA transposons, retrotransposons, ribosomal DNA, and simple repeats) and protein-coding genes, and to extract chloroplast and mitochondrial genome sequences. Such initial sweeps of fern genomes can provide information useful for selecting a promising candidate fern species for whole genome sequencing. We also describe variation of genomic traits across our sample and highlight some differences and similarities in repeat structure between ferns and seed plants. \n  \nCategories: News , Publications \n\n    \nNo comments yet. \n \nRSS feed for comments on this post. \n \nSorry, the comment form is closed at this time.", "source": "University of Florida"}