{"published": "2015-09-02T15:30:00Z", "media-type": "News", "title": "Mechel Intends to Hold Bonds Restructuring", "id": "cbce8a1e-a832-40f4-88ea-3552c6e4ea9a", "content": "MOSCOW, Sept. 2, 2015 (GLOBE NEWSWIRE) -- Mechel OAO ( MTLR.ME ), ( MTL ), one of the leading Russian mining and metals companies, reports its intention to restructure Mechel OAO's 13 and 14 series bonds. \n \nThe company intends to offer holders of 13-series bonds (state number 4-13-55005-E issued on August 10, 2010) and 14-series bonds (state number 4-14-55005-E issued on August 10, 2010) to introduce changes in the current payment schedule and reconsider the order of determining the coupon rate for future periods. \n \nWe invite those holders of the company's bonds who wish to be informed of the restructuring process to mail the following details to bonds@vtbcapital.com to ensure the possibility of further coordination: \n Name of bond holder (for persons -- last name, name and patronymic)  The number and series of bonds held  In case the bond owner is not a Moscow Exchange tenderer (trades through a broker) -- name of the broker (tenderer) who acts as mediator for the owner's deals with bonds  The owner's contacts -- telephone number and email address.  \nInformation on the restructuring process and contact telephone number are posted at the company's website at http://www.mechel.ru/shareholders/bonds . \n \nThe date for the bond owners' meeting will be further announced. \n \nMechel is an international mining and steel company which employs 67,000 people. Its products are marketed in Europe, Asia, North and South America, Africa. Mechel unites producers of coal, iron ore concentrate, steel, rolled products, ferroalloys, heat and electric power. All of its enterprises work in a single production chain, from raw materials to high value-added products. \n \nSome of the information in this press release may contain projections or other forward-looking statements regarding future events or the future financial performance of Mechel, as defined in the safe harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995. We wish to caution you that these statements are only predictions and that actual events or results may differ materially. We do not intend to update these statements. We refer you to the documents Mechel files from time to time with the U.S. Securities and Exchange Commission, including our Form 20-F. These documents contain and identify important factors, including those contained in the section captioned \"Risk Factors\" and \"Cautionary Note Regarding Forward-Looking Statements\" in our Form 20-F, that could cause the actual results to differ materially from those contained in our projections or forward-looking statements, including, among others, the achievement of anticipated levels of profitability, growth, cost and synergy of our recent acquisitions, the impact of competitive pricing, the ability to obtain necessary regulatory approvals and licenses, the impact of developments in the Russian economic, political and legal environment, volatility in stock markets or in the price of our shares or ADRs, financial risk management and the impact of general business and global economic conditions. \nContact: Mechel OAO \nEkaterina Videman \nTel: + 7 495 221 88 88 \nekaterina.videman@mechel.com", "source": "Yahoo! 7 Finance"}