{"published": "2015-09-02T23:54:31Z", "media-type": "News", "title": "Pembina Pipeline Corporation Places $650 Million of New Assets into Service and Provides Project Updates", "id": "d76d0484-ca39-4182-abef-dcab5ef0b1c6", "content": "(September 02, 2015) CALGARY, Alberta, Sept. 2, 2015 /PRNewswire/ --Pembina Pipeline Corporation (\"Pembina\" or \"the Company\") (TSX: PPL; NYSE: PBA) is pleased to announce that it has commissioned several key growth projects within its Gas Services and Conventional Pipeline businesses, placing approximately $650 million assets into service. Additionally, Pembina is providing an update on other key growth projects on-going across its business.\n\n\"I am proud of the work Pembina employees have done to commission such large scale energy infrastructure projects,\" said Mick Dilger, Pembina's President and Chief Executive Officer. \"I am also very pleased to advise that a large portion of these projects were placed into service on-time and under budget. Further, and most importantly, was the exemplary safety record that was maintained across all of these projects from construction through to commissioning.\"\n\nGas Services Pembina's Gas Services business successfully commissioned 260 million cubic feet per day (\"MMcf/d\") of new processing capacity and pipeline infrastructure in Alberta and Saskatchewan for a combined capital investment of approximately $320 million, which represents a seven percent savings versus the original project budget. \n\nIn late August, Pembina safely commissioned its Saturn II facility, a 200 MMcf/d 'twin' of the Company's existing Saturn I Facility (\"Saturn II\"),ahead of schedule and under budget. Saturn II is an example of recognizing value achieved through leveraging an existing 'Pembina template' design, which supported the successful and safe execution of this project. Further demonstrating the benefits of the Company's integrated service offering, the natural gas liquids (\"NGL\") volumes produced at Saturn II will also be transported on Pembina's Peace Pipeline system and will be fractionated at Pembina's Redwater facility. \n\nPembina's Saskatchewan Ethane Extraction plant (\"SEEP\") was commissioned in late August. SEEP was acquired as part of the Vantage Pipeline acquisition which closed in October of 2014. This facility has a deep cut processing capacity of 60 MMcf/d and ethane plus fractionation capabilities which supports up to approximately 4,500 barrels per day (\"bpd\") of ethane extraction. The ethane volumes produced at SEEP will be transported under a long-term, fee-for-service agreement on Pembina's Vantage Pipeline. This project was successfully and safely completed on-time and under budget. \n\nAdditionally, Pembina placed into service the gathering pipeline associated with the 100 MMcf/d Resthaven Expansion project (the \"Resthaven Expansion\"). This project consists of a 12 inch diameter 28 kilometer pipeline with capacity to deliver 100 MMcf/d that will connect a customer's condensate recovery plant into Pembina's Resthaven facility. In advance of the expected in-service of the Resthaven Expansion, this newly commissioned pipeline will be able to provide additional gas volumes for Pembina's existing Resthaven facility. Construction of the Resthaven Expansion is underway and is expected be in-service by mid-2016. Once the Resthaven Expansion is complete, the facility's gross gas processing capacity will increase to 300 MMcf/d.\n\nWith the Saturn II and SEEP facilities in-service, Pembina's Gas Services capacity has increased 26 percent from 1,003 MMcf/d to 1,263 MMcf/d. \"This additional capacity supports Pembina in becoming one of Canada's largest third party gas processors,\" said Jaret Sprott, Pembina's Vice President, Gas Services. \"These plants provide increased exposure to attractive Western Canadian Sedimentary Basin multi-zone geology and represents Pembina's entry into Saskatchewan's prolific Bakken resource play.\" \n\nConventional Pipelines \n\nAt the beginning of September, Pembina commissioned the high vapour pressure (\"HVP\"), or NGL, portion of the Peace and Northern Phase II pipeline expansion (\"Phase II HVP\"), and expects to have the pipeline fully commissioned by the end of 2015. In conjunction with the low vapour pressure (\"LVP\"), or crude oil and condensate portion of the expansion that was placed into service in April of this year (\"Phase II LVP\"), the Peace and Northern Phase II pipeline expansion (the \"Phase II Expansion\") is now in-service. In aggregate, the Phase II Expansion and all associated laterals represents an approximately $670 million of capital investment, of which approximately $330 million is attributable to the Phase II HVP project and approximately $340 million is attributable to the Phase II LVP project. The Phase II Expansion is underpinned by 5 to 10 year contracts with substantial take-or-pay commitments from approximately 40 customers. The Phase II Expansion is expected to increase Peace and Northern systems' capacity by 108,000 bpd in aggregate. As a result of commissioning the Phase II Expansion, total capacity in Pembina's Conventional Pipeline business will increase by 15 percent to approximately 830,000 bpd. \"These expansions provide much needed hydrocarbon liquids transportation capacity for the Western Canadian Sedimentary Basin,\" said Jason Wiun, Pembina's Vice President, Conventional Pipelines. \"Pembina is well positioned to support future production growth through our existing asset base and through our committed growth projects that have significant embedded expansion potential.\"\n\n\"With the commissioning of Phase II Expansion, including the LVP portion placed into service in April, and the approximately $320 million of new Gas Service's assets, this represents approximately $1 billion of new fee-for-service supported infrastructure,\" said Scott Burrows, Pembina's Vice President, Finance & Chief Financial Officer.\"This large scale investment helps to continue to grow Pembina's low risk fee-for-service asset base and demonstrates the value associated with Pembina's sector leading secured growth portfolio.\"\n\nProject Updates\n\nIn the coming months, Pembina will be commissioning a number of projects in its NGL Midstream business. Early in 2016, Pembina plans to commission the twin of its existing 73,000 bpd ethane plus fractionator (\"RFS II\"). The completion of RFS II will further strengthen Pembina's position as Western Canada's largest owner of fractionation capacity. Additionally, in early 2016, a small scale debottlenecking initiative to modestly increase propane plus throughput capacity at Pembina's existing Redwater Fractionator is expected to be commissioned. Finally, at Pembina's Corunna site, construction and commissioning of new brine pond, storage, rail, and truck infrastructure is well under-way, the new assets are expected to be phased into service through the remainder of 2015 and early 2016.\n\nPembina would also like to provide an update for the regulatory process associated with the $220 million expansion to pipeline infrastructure in northeast British Columbia (\"B.C.\") (the \"NEBC Expansion Project\"). On August 26th 2015, Pembina withdrew its application for an expedited environmental review by the B.C. Environmental Assessment Office (\"B.C. E.A.O\"). Pembina's application was withdrawn to ensure that all First Nations and public concerns are identified and fulsomely addressed. Pembina intends to file a project application with the B.C. E.A.O in late 2015 and will be proceeding with preparing an environmental assessment certificate through the B.C. environmental assessment process, both of which will help support the project moving forward successfully. The anticipated schedule for the NEBC Expansion Project remains unchanged with an expected in-service date of Q4 2017, subject to regulatory and environmental approvals.\n\nAbout Pembina\n\nCalgary-based Pembina Pipeline Corporation is a leading transportation and midstream service provider that has been serving North America's energy industry for over 60 years. Pembina owns and operates an integrated system of pipelines that transport various hydrocarbon liquids including conventional and synthetic crude oil, heavy oil and oil sands products, condensate (diluent) and NGL produced in western Canada and ethane produced in North Dakota. The Company also owns and operates gas gathering and processing facilities and an oil and NGL infrastructure and logistics business. With facilities strategically located in western Canada and in NGL markets in eastern Canada and the U.S., Pembina also offers a full spectrum of midstream and marketing services that spans across its operations. Pembina's integrated assets and commercial operations enable it to offer services needed by the energy sector along the hydrocarbon value chain.\n\nForward-Looking Statements & Information \n\nThis document contains certain forward-looking statements and information (collectively, \"forward-looking statements\") that are based on Pembina's current expectations, estimates, projections and assumptions in light of its experience and its perception of historical trends. In some cases, forward-looking statements can be identified by terminology such as \"schedule\", \"will\", \"expects\", \"plans\", \"intends\", \"should\", \"anticipates\", \"estimates\", \"could\" and similar expressions suggesting future events or future performance.\n\nIn particular, this document contains forward-looking statements, pertaining to, without limitation, the following: Pembina's corporate strategy; planning, capital expenditure estimates, schedules, expected capacity, incremental volumes, in-service dates, processing, transportation, fractionation, and services commitments and contracts and operations with respect to Company projects, the development and expected timing of new business initiatives and growth opportunities and the impact thereof, and anticipated corporate efficiencies and synergies. \n\nThe forward-looking statements are based on certain assumptions that Pembina has made in respect thereof as at the date of this news release regarding, among other things: that counterparties will comply with contracts in a timely manner; that there are no unforeseen events preventing the performance of contracts or the completion of Company projects; that all required regulatory and environmental approvals can be obtained on the necessary terms in a timely manner; that there are no unforeseen material costs relating to the facilities which are not recoverable from customers; ongoing utilization and future expansion, development, growth and performance of Pembina's business and asset base; future levels of oil and natural gas development in proximity to Pembina's pipelines and other assets (which could be affected by, among other things, possible changes to applicable royalty and tax regimes); interest and tax rates; prevailing regulatory, tax and environmental laws and regulations; maintenance of operating margins; and future financing capability and sources.\n\nAlthough Pembina believes the expectations and material factors and assumptions reflected in these forward-looking statements are reasonable as of the date hereof, there can be no assurance that these expectations, factors and assumptions will prove to be correct. These forward-looking statements are not guarantees of future performance and are subject to a number of known and unknown risks and uncertainties including, but not limited to: the regulatory environment and decisions; the impact of competitive entities and pricing; labour and material shortages; reliance on key relationships and agreements; the strength and operations of the oil and natural gas production industry and related commodity prices; non-performance or default by counterparties to agreements which Pembina or one or more of its affiliates has entered into in respect of its business; actions by governmental or regulatory authorities including changes in tax laws and treatment, changes in royalty rates or increased environmental regulation; unexpected increases in capital costs; adverse general economic and market conditions in Canada, North America and elsewhere, including changes in interest rates, foreign currency exchange rates and commodity prices; lower than anticipated results of operations from Pembina's business initiatives; the ability of Pembina to raise sufficient capital (or to raise capital on favourable terms) to complete future projects and satisfy future commitments; and certain other risks detailed from time to time in Pembina's public disclosure documents available at www.sedar.com. This list of risk factors should not be construed as exhaustive.\n\nReaders are cautioned that events or circumstances could cause results to differ materially from those predicted, forecasted or projected. The forward-looking statements contained in this document speak only as of the date of this document. Pembina does not undertake any obligation to publicly update or revise any forward-looking statements or information contained herein, except as required by applicable laws. The forward-looking statements contained in this document are expressly qualified by this cautionary statement. \n\nPembina Pipeline is a registered trademark of Pembina Pipeline Corporation.\n\nFor further information: Investor Relations: Ian McAvity / Chelsy Hoy, (403) 231-3156, 1-855-880-7404, e-mail: investor-relations@pembina.com, www.pembina.com; Media Inquiries: Tanis Fiss, Supervisor, External Communications, (403) 817-7131, e-mail: media@pembina.com\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/pembina-pipeline-corporation-places-650-million-of-new-assets-into-service-and-provides-project-updates-300137282.html\n\nSOURCE Pembina Pipeline Corporation", "source": "Review Seeker"}