{"published": "2015-09-20T23:28:14Z", "media-type": "News", "title": "Lakeshore Records Presents 'The Runner' Original Motion Picture Soundtrack", "id": "e6748ab8-adf8-45ad-9886-a0c899e21cac", "content": "LOS ANGELES (Top40 Charts) Lakeshore Records will release THE RUNNER - Original Motion Picture Soundtrack digitally on September 25, 2015. The album features original music by The Newton Brothers (OCULUS, LIFE OF CRIME). \nIn the aftermath of the 2010 BP oil spill, an idealistic but flawed politician (Nicolas Cage) is forced to confront his dysfunctional life after his career is destroyed in a sex scandal. Also stars Sarah Paulson, Connie Nielsen, Wendell Pierce, Bryan Batt and Peter Fonda. \n\nComposers Andy Grush and Taylor Newton Stewart, better known as The Newton Brothers, drew inspiration for their score from both the humanity of the film's characters and the tense political climate that serves as a backdrop. Collaborating with director Austin Stark, The Newton Brothers sought to find a musical balance befitting of the movie's vision. \"We had the political aspect of the film which we scored one way, and then Colin Price and his inner-struggles as another tone. We needed something minimal and intimate for Colin's internal struggle to capture the humanity of his situation. It provides commentary on how we deal with vulnerability, life, and change - which is something everyone can connect with,\" explained Stewart. \n\nThe Newton Brothers achieved the musical balance by creating a hybrid score combining electronic and symphonic elements with unique instrumentation. Stewart described, \"For the connection between Colin and Kate Haber (Paulson), we relied on a solo electric guitar for a very fragile and emotional theme which expresses their connection and character development. To keep the political world separate, we spent a lot of time coming up with subtle percussive elements and synth arpeggio's to chug along in the background of various scenes to keep the 'real world' always moving around the story of Colin.\" The composers also bowed a Bazantar and developed percussion patterns from recorded sounds of banging on guitars and dobros. \n\nAs The Newton Brothers, Andy Grush and Taylor Stewart have developed a reputation as innovative composers pushing the boundaries of film and television music. Between the two, they play piano, guitar, bass, clarinet, flute, accordion, sax, harmonica, percussion, organ, kazoo, and cello. They fuse their classical education with skill and savvy in electronics and manipulated sounds to contribute distinct music to a diverse spectrum of film projects and capitalize on having two musical heads. The Newton Brothers added chills to Mike Flanagan's OCULUS, emotion to Tony Kaye's acclaimed classroom drama DETACHMENT tension to Mike Gunther's crime thriller SETUP starring Bruce Willis, and black humor to PAWN SHOP CHRONICLES starring Paul Walker. They recently lent their \"Newtonian\" approach to the dark comedy LIFE OF CRIME starring Jennifer Aniston, and the action/thriller THE PRINCE starring Bruce Willis and John Cusack. \n\nThe Newton Brothers' upcoming projects include comedy CHLOE & THEO starring Dakota Johnson and Mira Sorvino, the Mike Flanagan thriller BEFORE I WAKE which they co-scored with Danny Elfman, the comedy DRIVE, SHE SAID with Jason Biggs and Ashley Tisdale, and season 2 of ABC Family drama CHASING LIFE. \n\nPaper Street Films and Back Lot Pictures present THE RUNNER currently in select theaters, on iTunes and On Demand.  THE RUNNER - Original Motion Picture Soundtrack will be available digitally September 25, 2", "source": "Top40-Charts"}