{"published": "2015-09-08T04:00:23Z", "media-type": "Blog", "title": "Obama pushes sick leave; Putn may send troops to Syria (10 things to know for Tuesday)", "id": "c924e951-33a7-4d26-a1af-7174d967f08a", "content": "Your daily look at late-breaking news, upcoming events and the stories that will be talked about Tuesday: 1. EUROPEAN LEADERS DEBATE HOW TO HANDLE 340,000 MIGRANTS Germany, Britain and France commit to take in tens of thousands of refugees fleeing war and poverty in the Middle East, Africa and Asia. 2. 'WHAT I DID WAS ALLOWED' That's what Hillary Clinton tells the Associated Press about using her private email account and server while secretary of state. 3. WHO MAY BE WEIGHING IDEA OF SENDING TROOPS TO SYRIA Russian President Vladimir Putin says he is \"looking at various options\" to assist Syrian President Bashar Assad beyond the weapons and advisers Moscow has sent during the 4 ½-year civil war. 4. ON LABOR DAY, OBAMA PUSHES PAID SICK LEAVE The president says he's using his executive power to force federal contractors to offer workers paid sick days. 5. HOW LAWYERS FOR JAILED KENTUCKY CLERK SEEK TO FREE HER Attorneys for Kim Davis are asking the governor to let her remove her name and title from marriage licenses, since her \"religious conviction\" doesn't allow her to sanction same-sex unions. 6. 'YES MEANS YES' TRAINING PART OF COLLEGE CURRICULUM UNDER NEW YORK LAW New York is the second state, after California, to put the affirmative consent standard into law for campuses: That only \"yes\" is the cue for sex. 7. STUDY ASKS IF ATLANTIC WILL ENTER CYCLE OF FEWER HURRICANES The Atlantic Ocean looks like it is moving into a quieter cycle of storm activity, two prominent hurricane researchers write in the journal Nature Geoscience. 8. WHERE ENTANGLED WHALE MAY HAVE BEEN SIGHTED A boat off the coast of Mexico apparently spotted the blue whale that rescuers first saw trailing hundreds of feet of fishing line near Los Angeles a few days ago. 9. MUSLIM FLIGHT ATTENDANT WHO REFUSED TO SERVE ALCOHOL FIGHTS SUSPENSION Charee Stanley, who works for ExpressJet, files a discrimination complaint, saying her religious beliefs forbid contact with alcohol. 10. ANDY MURRAY IS DEFEATED IN US OPEN FOURTH ROUND The third-seeded Briton loses to South Africa's Kevin Anderson in four sets.", "source": "Money"}