{"published": "2015-09-13T16:41:46Z", "media-type": "News", "title": "Heavy rain hits İstanbul, paralyzes daily life", "id": "97fd4e9b-20f3-4837-8cea-45a590dfab7c", "content": "İstanbul, along with other cities in northern Turkey, has been hit by heavy rain over the weekend, significantly affecting daily life while signaling the beginning of colder weather. \n \nOn Saturday morning rain clouds gathered over İstanbul and a rain shower started around noon, causing floods in certain parts of the city. Avcılar, Beykoz , Beylikdüzü, Kadıköy and Sarıyer were some of the districts where the rain hit hardest. The flooding caused heavy damage to some houses and shops in these districts, with people having a difficult time trying to evacuate the water. \n \n(Photo: DHA) \n \nIn Beykoz, a coastal district along the Asian side of the Bosporus, the Beykoz-Riva highway was flooded by the heavy rain. The road was closed to traffic, and rescue teams made great efforts in pulling out cars that were half-submerged. \n \nKadıköy's notorious Kurbağalıdere creek was one of İstanbul's most affected areas. When the stream overflowed, the surrounding neighborhoods had a hard time managing the floodwaters. Cars, the ground floors of many buildings and workplaces were damaged, and some cars were totally destroyed. \n \nKurbağalıdere also passes through Ataşehir, one of the most luxurious districts of İstanbul as it is the newest part of the city. Ataşehir's Ercüment Batanay Avenue was submerged after the stream overflowed. \n \nKurbağalıdere has long been a much-debated issue for the locals of Kadıköy and Ataşehir. As the two districts' mayors were from the main opposition Republican People's Party (CHP), the İstanbul Metropolitan Municipality, which has long been ruled by the Justice and Development Party ( AK Party ), neglected rehabilitation works for the stream. \n \nDespite heavy criticism of the municipality and strong concerns over Kurbağalıdere's negative effects on human health and the environment, the AK Party refused to take efficient steps to rehabilitate the stream. The overflowing of Kurbağalıdere over the weekend is only a recent example of how the AK Party's controversial policies trouble locals in parts of the country. \n \nPublic transportation in İstanbul was also affected by the downpour, which continued throughout Saturday. In addition to İstanbul Ferry Lines (İDO) canceling some trips on certain routes, tram journeys were also canceled between two central İstanbul neighborhoods -- Beyazıt and Aksaray -- with a cable damaged because of the rain. Moreover, some flights departing from İstanbul Atatürk Airport and İstanbul Sabiha Gökçen International Airport were also canceled during the hours when the rain hit hardest. Pedestrians in Turkey's most crowded city were also affected negatively by the unusually long and heavy summer rain, with some of them taking shelter under any little space they could find. \n \nThe rain in İstanbul continued on Sunday with occasional cloudbursts in Bayrampaşa, Gaziosmanpaşa, Kadıköy and other surrounding districts. \n \nThe heavy rain also hit other cities in the Marmara region, where İstanbul is located, and the Black Sea region. Daylight almost completely faded in Bursa, with dark clouds and heavy rain storming the city. \n \nThe northern Black Sea region was also affected by the rain that began on Saturday and continued into Sunday, when it also became heavier. Bartın, Bolu, Kastamonu and Zonguldak were just some of the provinces that witnessed a heavy downpour, which affected daily life greatly. The rainfall is estimated to have reached up to 50 kilograms of water per square meter. Meteorologists expect the rain in the Black Sea region to continue throughout the week. \n \nAccording to the website of the State Meteorological Service (DMİ), there will be no more rain in İstanbul this week, but its five-day prediction states that the city will be partly cloudy.", "source": "Zaman"}