{"published": "2015-09-01T19:19:41Z", "media-type": "Blog", "title": "Taking stock of minimum wage around the world", "id": "ac1daa7a-b6ca-4e8e-86c9-408177a2c51a", "content": "   Menu LISTEN    World World No Title «DONATE Search Shows Marketplace Morning Report Weekend Marketplace Tech Mid-Day Update Marketplace Money (Archive) QuickLinks Latest Stories\nMarketplace Music\nPodcasts\nYork & Fig Topics Home Shows Business Economy Elections Education Life Sustainability Tech Wealth & Poverty World Money Special Sections The Whiteboard LearningCurve I've Always Wondered BBC on Marketplace American Futures Corner Office Diagnosis: Camden The Big Book Freakonomics Radio Must Reads Budget Hero Secret Life of a Food Stamp Income Upshot The Datebook Work in America Innovators The new Cold War? Oyler Yearbook A lot to give Tools Newsletters Mobile Apps Facebook Twitter Podcasts RSS Access Home Sign In My Account Contact About ShowsMarketplace Marketplace Morning Report Marketplace Weekend Marketplace Tech Marketplace Mid-Day Update Business World Economy Tech Sustainability Education Money Wealth & Poverty Video About Contact Donate Listen Button - Responsive Listen\n Latest Stories\nMarketplace Music\nPodcasts\nYork & Fig Search Share It!\nTaking stock of minimum wage around the world Taking stock of minimum wage around the world NICOLAS ASFOURI/AFP/Getty Images\nWorkers on scaffolding at a building construction site in Yangon, Myanmar.  by Tony Wagner and Janet Nguyen Tuesday, September 1, 2015 - 14:17 Story Myanmar has introduced  a minimum wage for the first time, which takes effect Tuesday, according to Reuters.  The new policy would require employers to pay workers 3,600 kyat, or  $2.80, for an eight-hour work day, which equals about 35 cents an hour.  Minimum wage standards vary greatly even among the Southeast Asian country's neighbors, with Thailand's minimum about three times Myanmar's amount at 300 baht, or nearly $8.40 per day. Bangladesh's daily minimum wage is about 74 cents outside of the cotton and jute textile industries and the engineering industry.   Amid Myanmar's wage announcement, let's take a look at the different minimum-wage standards set by countries around the world, in particular, members of the Organisation for Economic Cooperation and Development: Must be nice to live in Luxembourg, right? But here's another perspective: compare each country's minimum wage to what its citizens typically earn: Share It!\nYou Might Also Like... Explore Stories that share this feature's tags minimum wage, salary Finding the fairest minimum wage The minimum wage debate Do federal contractors save the government money? Irvine gets rid of its living wage Weekly Wrap: Inflation, the Federal Reserve and minimum wage View Complete List     You Might Also Like... Explore Stories that share this feature's tags minimum wage, salary Finding the fairest minimum wage The minimum wage debate Do federal contractors save the government money? Irvine gets rid of its living wage Weekly Wrap: Inflation, the Federal Reserve and minimum wage View Complete List   With Generous Support From... Marketplace thanks our sponsors for their continued support in the following categories. Sustainability Coverage The Kendeda Fund Education Coverage The Kresge Foundation The Gates Foundation Asia Coverage The Starr Foundation The Henry Luce Foundation Wealth & Poverty Coverage The Ford Foundation General Support The John D. and Catherine T MacArthur Foundation Newman's Own Foundation Annie E. Casey Foundation", "source": "Latest Stories on Marketplace.org"}