{"published": "2015-09-23T12:02:01Z", "media-type": "News", "title": "DYMO Introduces The DYMO® XTL™ Series - A Radical Advance In Complex Industrial Labeling", "id": "8f207ead-c605-4177-9c10-09214ba29c7c", "content": "The DYMO XTL 300 and 500 label makers are fully outfitted with an array of time saving features all designed to make complex labeling jobs simple. Both the XTL 300 and 500 label makers are equipped with a life-like on-screen print preview, the first of its kind on a DYMO labeler, that showcases exactly how labels will look when applied to cables, pipes, patch panels and more. Additionally, hundreds of pre-loaded label templates further simplify the often-complex industrial labeling process by saving time and helping to eliminate mistakes. \n \nAs part of the product research and development, DYMO, a Newell Rubbermaid Inc., brand, provided professionals in the datacom, electrical, and maintenance, repair and operations (MRO) fields with the DYMO XTL 300 and 500 label makers (respectively) and asked them to replace their current labeler with a DYMO XTL label maker for a period of eight weeks.Â  At the end of the two-month trial period, DYMO asked the users to rate their experience. The results were astounding with 86 percent of datacom and 79 percent of MRO users stating the XTL label maker performed better than their current labeler. \n \n\"The launch of the DYMO XTL label makers is one of the most important Newell Rubbermaid product launches of the year,\" said Marta Aebischer , director of brand marketing. \"We've done the research; we know there's a huge demand for this product. We have spoken to datacom, electrical and MRO professionals and are very confident the DYMO XTL series will become the labeler of choice for these industry professionals.\" \n \nThe DYMO XTL 300 label maker is an industrial labeler outfitted with multiple time-saving features all designed to help simplify labeling. Built specifically for professionals in the datacom and electrical fields, it comes standard with a life-like on-screen print preview and color display to show exactly how labels will look after printing. The built-in label applications and pre-loaded label templates ensure perfect formatting to help industry professionals save time by expediting the label-making process. \n \nThe rechargeable DYMO XTL 300 label maker is built tough with impact-resistant bumpers and a wipe-clean keypad that prints labels from Â¼\" (6 mm) up to 1\" (24 mm) in a full range of UL-rated materials and colors. It features PC connectivity* and DYMO ID software for importing MicrosoftÂ® ExcelÂ® and other database files for entire label batches. \n \nThe DYMO XTL 500 label maker is engineered to simplify the labeling process and end common frustrations often associated with creating complex labels to meet industry codes and standards. Like the XTL 300 label maker, the DYMO XTL 500 label maker features a life-like on-screen print preview, built-in label applications and a variety of pre-loaded templates, but adds a color touch screen to make positioning text, barcodes and images on labels faster. The DYMO XTL 500 label maker prints pre-sized and continuous labels from Â¼\" (6 mm) up to 2\" (54 mm), including safety signage and heat-shrink tubes in a full range of UL-rated materials and colors. \n \nThe launch of the DYMO XTL lineup of labelers will be fully supported by an integrated marketing and communications program. The DYMO XTL 300 label maker was unveiled at the BICSI Fall Conference and Exhibition on Tuesday, September 22 . \n \n*Works with Windows Â® 7, Windows Â® 8/8.1, Windows Â® 10 \n \nMicrosoft, Windows and Excel are either registered trademarks or trademarks of Microsoft Corporation in the United States and/or other countries. \n \nArticle source and copyright ©  PR Newswire Europe Limited, all rights reserved. \nTrademarks, logos, pictures and other items may be copyright of firms mentioned in this article.", "source": "ITbriefing"}