{"published": "2015-09-24T10:36:06Z", "media-type": "News", "title": "Nearly half of US seafood supply goes waste", "id": "6383b4c3-750c-44f6-809a-1009fa749b77", "content": "By | IANS India Private Limited/Yahoo India News  –  \nNew York, Sep 24 (IANS) As much as 47 percent of the edible US seafood supply is lost each year, mainly from consumer waste, new research suggests. \n \n\"If we are told to eat significantly more seafood but the supply is severely threatened, it is critical and urgent to reduce waste of seafood,\" said study leader David Love, assistant scientist at the Johns Hopkins Bloomberg School of Public Health in Baltimore, US. \n \nAfter compiling data from many sources, the researchers estimated the US edible seafood supply at approximately 2.1 billion kg (4.7 billion pounds) per year. \n \nSome of the edible seafood supply is wasted as it moves through the supply chain from hook or net to plate. \n \nThe researchers found the greatest portion of seafood loss occurred at the level of consumers (51 to 63 percent of waste). \n \nSixteen to 32 percent of waste is due to bycatch, while 13 to 16 percent is lost in distribution and retail operations. \n \nTo illustrate the magnitude of the loss, the authors estimated this lost seafood could contain enough protein to fulfill the annual requirements for as many as 10 million men or 12 million women. \n \nWaste reduction has the potential to support increased seafood consumption without further stressing aquatic resources, said Roni Neff, assistant professor with the Bloomberg School of Public Health. \n \nThe researchers offer several approaches to reduce seafood waste along the food chain from catch to consumer. \n \nSuggestions range from limiting the percent of bycatch that can be caught at the production level to packaging seafood into smaller portion sizes at the processing level to encouraging consumer purchases of frozen seafood. \n \nThe findings were published in the journal Global Environmental Change.", "source": "Yahoo! India"}