{"published": "2015-09-25T13:15:59Z", "media-type": "Blog", "title": "Ways to Cut Down Your Mobile Data Usage", "id": "1cd5ea73-572c-4f74-8ffd-f3f45aee2865", "content": "Having the ability to call or text friends and family members wherever you may be is a marvellous thing. But as we all know, mobile phones have become much more than just portable communication devices. \n \nFrom browsing the Internet and sending emails to watching movies and playing games, today’s smartphones are capable of multiple tasks. However, several of these use up an untold amount of data, which most networks will put a limit on or charge a premium for. \n \nSo, in order to avoid going over your allowance or running up an expensive bill, here are some helpful and handy ways to cut down your mobile data usage. \n \nLimit data-heavy applications to Wi-Fi only \n \nCertain smartphone tasks, such as streaming video, will use up more data than others. Therefore, try to avoid opening up these applications when you have only got a data connection. \n \nWhenever a free Wi-Fi network is available, such as in a coffee shop or airport lounge, your data allowance won’t get touched and you can get back to your favourite film or TV show. \n \nAlways close apps properly \n \nIn addition to draining your battery, apps that run in the background can also use up a lot of data. Even when you close these apps, you should still be able to receive important notifications and your phone will probably run much faster too. \n \nTo close, Android users can usually hold down the Home button and then swipe apps to the right, while  iPhone users must double-tap the Home button and then swipe apps up. \n \nAvoid using apps with pushed content \n \n“Pushed” content is when an app delivers notifications without you asking for them. For example, you might have a sports app that instantly tells you when your favorite football team has scored. \n \nEither stop using these apps or choose not to receive pushed content. This is possible with most apps, and can usually be done in your smartphone’s settings. \n \nTurn off data roaming when abroad \n \nWe all like to stay in touch with loved ones and update our social media accounts when travelling to another country, but networks tend to charge much more for data abroad. \n \nSo, unless you have signed up to a specific travel plan that offers cheaper rates or a fixed daily rate, make sure you turn off data roaming. \n \nConsider changing your plan \n \n\n \nIf you rely on data-heavy apps but constantly exceed your allowance, you are probably on the wrong plan. So, consider switching to another deal or even changing your network altogether. \n \nThankfully, you are spoiled for choice when it comes to the best mobile phone plans,  so shop around for packages with plenty of data . \n \nEven though various smartphone applications have the potential to use up a great deal of data, follow these simple, yet smart steps to ration your allowance and boost your bank balance. \n \nImages by  Johan Larsson and  Jason Howle used under the Creative Commons license. \n \nThe post Ways to Cut Down Your Mobile Data Usage appeared first on Modest Money .", "source": "Modest Money"}