{"published": "2015-09-21T22:47:00Z", "media-type": "Blog", "title": "Rick Ross Being SUED After His Associate ALLEGEDLY Drugged & Raped A Woman + Lira Galore’s Mother Addresses Rozay Cheating On Daughter", "id": "0ec52605-0a9b-483c-8bac-e1762ceb71b5", "content": "Rick Ross Being SUED After His Associate ALLEGEDLY Drugged & Raped A Woman + Lira Galore’s Mother Addresses Rozay Cheating On Daughter by DatzHott on September 21, 2015 in Hott Culture Leave a comment Well…it looks like one of Rick Ross‘ associates has gotten him involved in some ish. And now a woman is SUING him for allegedly being drugged and raped. Meanwhile, Rozay’s possible mother-in-law is speaking out on her future son-in-law’s bedroom antics. And she has an interesting take on the matter. More inside…. When you make a track about drugging a female and having sex with her unbeknownst to her, you better get lawyered up because clearly someone will take your word for it…whether it’s true or not. Case in point: An anonymous woman has a filed a lawsuit against MMG honcho Rick Ross alleging that one of his associates drugged her, rapped her….and she “ain’t even know it” during GRAMMY weekend back in February. Here’s what TMZ is reporting: The woman — who is ID’d as Jane Doe in the lawsuit — claims she was at the W Hotel in L.A. where she met up with Rick and his entourage, who had invited her to go to Cannabis Cup … a weed convention.\nShe says she got in the van with Rick, a guy named Thaddeus “Black” James, a DJ, 3 security guards and the driver. She says she was offered a glass of booze and shortly thereafter became dizzy and eventually passed out. She says the next thing she knew, 2 hours had passed and she was in the van with Black. The woman says she went back to Black’s hotel room and passed out again. She woke up at 8 AM, examined herself and realized her clothes had been removed and she had been sexually assaulted. The woman believes Black is the one who raped her. Yikes! So why is she suing Rozay? Well she feels since the guy who allegedly violated her is Rozay’s agent and it supposedly happened on his van, she wants him to pay up too. Sighs…this all could be so easily avoided. In other Rozay news…. We told you Rick Ross might have popped the question to his girlfriend Lira Galore a few days ago. Chick didn’t waste any time to spread the word to the masses on her social media accounts. Yet, Ross still hasn’t confirmed or denied the news yet. But, Lira’s mother (above) seems super excited about the news letting one “fan” know that even IF the Bawse is cheating on her daughter, her baby is still winning. Oh? On Instagram, Lira’s mom happily posted: In the comments, a follower responded to her post saying, “But he still f*ckin’ my gf from Philly smh #fact guard your heart girl.” Yikes! Well, Momma Galore quickly clapped back, “lmfao he a celebrity of course that’s to be expected! Tf! U think we don’t know that? As long as ya home girl getting wet a** while my baby getting diamonds, his heart & treated like a queen in his palace then who winning tho boo? Where ur friends diamonds at?” Umm…thoughts? Photo: Rick’s IG/Momma Galore’s Twitter Source:: The YBF Related ← AFTER THE EMMYS: Viola Davis, Laverne Cox, Kerry Washington, Taraji P. Henson, Naomi Campbell & More At The After Parties Related News", "source": "Datzhott"}