{"published": "2015-09-12T19:53:00Z", "media-type": "News", "title": "Gambling or not, daily fantasy sports faces scrutiny", "id": "9f92e468-5161-477c-b5a4-675b8bb1621d", "content": "Devlin D'Zmura, a tending news manager at DraftKings, a daily fantasy sports company, works on his laptop at the company's offices in Boston. The daily fantasy sports industry is eyeing a breakout season as NFL games begin. And its two dominant companies, DraftKings and FanDuel, are touting lucrative opening week prizes to try to draw more customers as more competitors pop up. September 12, 2015 \nSo do fast-growing daily fantasy sports companies like DraftKings and FanDuel that offer the games and advertise with the long gambling-adverse pro football organization. But as the lucrative NFL betting season ramps up and advertisements from DraftKings and FanDuel are as hard to miss as an extra point, Las Vegas casinos and sports books are feeling like they're on the wrong end of a double-standard. Traditional sports betting is barred outside a handful of states, including Nevada, but daily fantasy sports is allowed in most of the United States. \n \nSeizing on the disparity, traditional casino operators and sports books are calling for traditional sports betting to be given the same respect. \"Let's just call it what it is. Americans love to bet on sports,\" said Joe Asher, chief executive of sports book William Hill's U.S. operations. \"They both drive interest in the games and they both should be legal, and taxed and regulated.\" \n \nThe fantasy industry says it's already legal and has no interest in being regulated if it comes with a \"gambling\" label. Even the traditional casino companies and regulators have eschewed the word \"gambling\" until recently, opting for the more antiseptic \"gaming\" instead to describe what they do. \n \nDaily fantasy sports and its defenders point to a 2006 law, the Unlawful Internet Gambling Enforcement Act, that carved out a specific exemption for \"fantasy sports\" well before the concept of daily games versus week-long or season-long were contemplated. Before the rise of daily fantasy sports, the exception was mostly used by top season-long fantasy operators like Yahoo and CBS Sports. \n \n\"Thanks to fantasy sports being specifically excluded from laws affecting online sports betting, FanDuel is not illegal in any way. Trust us, our lawyers drive very nice cars so that we can keep it that way,\" FanDuel says on its website as its short answer for the frequently asked question, \"Is FanDuel Legal?\" \n \nFanduel's long answer is more complicated, noting it doesn't operate in several states where its legality is not as clear. Some regulators and legal analysts have been skeptical of that reasoning because of state laws governing gambling. That's left casinos on the sidelines, wanting to get involved or support fantasy sports but unwilling to invest or risk billions in revenues that come with highly-regulated casino-resorts. New Jersey regulators even gave the go-ahead to licensed casinos to operate their own daily fantasy sports games two years ago, but no one has done it. \n \n\"The exception doesn't necessarily get (fantasy sports companies) to where they say it does,\" said A.G. Burnett, Nevada's top gambling regulator, who is working with the state's attorney general to weigh the industry's legality. \n \nThe federal law applies to processing payments for online gambling to curb online sports betting and, to that end, allows fantasy sports companies to process transactions. But Burnett said it doesn't pre-empt other laws. \n \n\"If a state says fantasy sports is illegal ... the fantasy companies cannot use (the act) as a get out of jail card because it quite simply doesn't apply,\" he said. So far, there have been no prosecutions challenging the sites' abilities to legally operate. \n \nFanDuel and DraftKings responded in a joint statement Saturday affirming their belief that they don't offer \"gambling.\" \"We are speaking with gaming industry representatives to educate them on the fantasy sports industry as our products are games of skill; fundamentally separate from, and not competitive with casinos and gaming businesses,\" the statement said. \n \nJohn McManus, general counsel for MGM Resorts International, said the company that owns several casinos on the Las Vegas Strip has a similar position on fantasy sports as it does with all forms of gambling. \n \n\"It is not in the interests of consumers that established gaming companies, which are fully licensed and regulated, are the only market participants that cannot engage in the business,\" he said. No one wants daily fantasy to be shut down akin to prohibition or the likes of Internet poker several years ago, said Daniel Wallach, a gambling and sports attorney based in Florida. \n \n\"This is something that everybody partakes in,\" said Wallach, a sports betting panelist at the upcoming Global Gaming Expo convention in Las Vegas, the top yearly casino industry conference. \"It would not be a popular thing to prosecute.\" \n \nTraditional gambling companies, though, don't want to risk lucrative gambling licenses by dipping their toes in the fantasy pool, Wallach said. The debate about \"gambling\" versus \"gaming\" often centers on chance versus skill. \n \n\"It's more skill than luck,\" said Peter Schoenke, chairman of the Fantasy Sports Trade Association and founder of Rotowire.com, a fantasy sports news website.  \"You win by making good decisions about players. You have to do a whole bunch of work to play the game, let alone win.\" \n \nThe NFL has agreed. \"Daily fantasy is considered a game of skill and not gambling,\" said Brian McCarthy, a spokesman for the NFL when asked why it's different than traditional sports betting. That reasoning doesn't necessarily fly with Las Vegas sports books. \n \n\"What we're doing is a game of skill, too,\" said Johnny Avello, the longtime sports book director at the Wynn Las Vegas. Avello is trying out his own twist on fantasy sports betting on Sunday — bettors can choose between the better of two fantasy teams he's hand-picked. \n \n\"So why not just legalize it all,\" he said. \n \nAP NFL website: http://pro32.ap.org and http://twitter.com/AP_NFL \n   Subjects    Locations    Companies    Organisations", "source": "Mail.com"}