{"published": "2015-09-02T07:47:49Z", "media-type": "News", "title": "Government to table amendments to EU Referendum Bill", "id": "31527178-67e5-4921-81da-009db5d1dd79", "content": "The Government is set to put forward changes to the arrangements for the referendum on Britain's EU membership, in a bid to allay MPs' concerns about ensuring the vote is fair. \n \nAmendments being tabled to the EU Referendum Bill are expected to address concern over plans to ease the \"purdah\" rule, which bars ministers from using public money to promote one side in the run-up to a poll. \n \nMinisters had argued that the change was needed to allow the Government to continue to conduct normal business with EU partners, but a parliamentary committee warned in July that it risked casting \"a shadow of doubt\" over the propriety of the in/out vote. \n \nIt is understood the new proposals are designed to reassure MPs that ministers are not seeking to wield the full weight of the Government machine or spend large amounts of public money in support of the campaign to stay in the EU, if that is what the Prime Minister recommends. \n \nThe development comes a day after David Cameron accepted a watchdog's recommendation that voters should be asked whether they want the UK to \"remain in\" or \"leave\" the EU, rather than ticking a \"Yes\" or \"No\" box in the referendum, which he has promised by the end of 2017. \n \nMr Cameron survived a Commons revolt of 27 Tory MPs - including five former cabinet members - in June over the plan to drop the 28-day purdah rule. Eurosceptics were furious because they feared it would allow Whitehall to back the Yes camp. \n   \n Share article  \n   \nIn July, the House of Commons Public Administration and Constitutional Affairs Committee wrote to Europe minister David Lidington to warn that plans to ditch the purdah period were \"completely unacceptable\" and the Government had to be seen to conduct itself \" properly, fairly and impartially\" in the run-up to the poll. \n \nMr Lidington promised to talk to critics over the summer and bring forward amendments to \" put beyond any doubt that the campaign will be conducted throughout in a manner that all sides will see as fair\".", "source": "Pontypool Free Press"}