{"published": "2015-09-16T12:23:48Z", "media-type": "News", "title": "India Boosts Cooking Oil Imports as El Nino Hurts Oilseed Crops", "id": "74bfd240-e9d5-477d-9b0d-5a52263a06c8", "content": "Cooking oil purchases by India rose in August after palm oil prices slumped to a six-year low and a dry spell hurt domestic oilseed crops. \n\nImports, including those for industrial use, jumped three per cent to 1.37 million metric tonnes last month from a year earlier, the Solvent Extractors’ Association of India said in a statement. That compares with the median estimate of 1.36 million tonnes in a Bloomberg survey. Overseas purchases of crude and refined palm oils totaled 810,594 tonnes, less than the 845,000 tonnes predicted in the survey. Palm imports since November are 19 per cent higher than a year earlier. \n\nIndian demand has been a bright spot for palm oil producers in Indonesia and Malaysia as they struggle with record supplies and weakening demand for the commodity as a biodiesel feedstock. Palm oil, used in everything from chocolates to cosmetics, slumped into a bear market last month as China’s economic slowdown and a rout in crude prices hurt demand and exacerbated a global glut. \n\n\"India is being used as a dumping ground for excessive supply of edible oils in the world market,” the association said. “Excessive import has put tremendous pressure on the local prices, which are at a level where Indian oilseeds-growing farmers are in distress and losing interest in oilseed crop. \n\nIndia’s dependence on imported oil has increased to almost 70 per cent, an “alarming situation” for the country’s food security, it said. \n\nMonsoon rain in India is headed for the first back-to-back shortfall in three decades as the strongest El Nino in almost two-decades strengthens. Rainfall has been 16 per cent below normal since June 1, according to the India Meteorological Department. \n\nReserves at ports and in pipelines were at 2.33 million tonnes at the start of September, the association said. \n\nThe benchmark futures contract on Bursa Malaysia Derivatives slumped to a six-year low of 1,863 ringgit ($433) a tonnes on 25 August and traded 1.2 per cent lower at 2,166 ringgit in Kuala Lumpur on Tuesday. Futures fell 6.1 per cent in August. \n\nIndia meets more than half its cooking oil requirements through imports with palm oil shipped from Indonesia and Malaysia and soybean oil from the US, Brazil and Argentina. \n\nSoybean oil oil imports jumped to a record 406,116 tonnes in August, while sunflower oil shipments totalled 102,568 tonnes, the association said. India also imported 45,294 tonnes of canola oil, it said. \n\nesmmagazine", "source": "BlackSeaGrain.net"}