{"published": "2015-09-28T17:32:42Z", "media-type": "Blog", "title": "Tom Strand: Medeama gaffer desirous of coaching Black Stars in future", "id": "d458430b-de48-4346-8cb1-8456f1d7f8e8", "content": "LATEST NEWS Latest News Watch Live Matches Hearts of Oak Ghana Players Abroad Live Scores Asante Kotoko Ghana Premier League Black Stars Latest Europe News Watch Ghana TV Latest Videos Tom Strand: Medeama gaffer desirous of coaching Black Stars in future Posted: Monday, 28th September 2015\t0 comments - you should start the discussion!\tTom Strand Medeama trainer Tom Strand has set an audacious target of coaching the Black Stars in future. Strand, 32, guided the Mauve and Yellows to their second FA Cup crown after his side managed a 2-1 win over dethroned Ghanaian champions Asante Kotoko in August.\nThe stock of the Swedish has risen following his feat with widespread reports linking him with a move to giants Hearts of Oak. However, the European tactician has revealed his desire to coach the Ghanaian national team in future. “It’s one of my highest goals, coaching the Black Stars. Hopefully, it’s a positive dream. I’ll be very much glad if the Ghana FA employs me,” he told Kumasi-based Nhyira FM “We have to wait till the time comes. For now, let’s leave things as they stand now.” Strand coached Bechem United where he guided the side to 6th two seasons ago. 0 comments - you should start the discussion!\tCategories Archives Latest News News READERS COMMENTS Live Radio Live TV GhanaWeb News Feed Update: Police secures injunction to stop LMVC demo Most Popular Latest News Most Commented Breaking News: Adam Kwarasey set to return for Ghana, named for Canada friendly 4,102 views Cantankerous Luis Suarez jibes Wakaso’s face with his boots during La Liga on Saturday afternoon 2,113 views Performance of Ghanaian Players Abroad: Agyemang-Badu, Sam, Berko, Obodai, Owusu score for clubs in Europe 1,904 views REVEALED: Why Andre Ayew failed to score in recent Swansea City matches 1,817 views Ex Chelsea striker Samuel Eto’o sends signed shirt to US President Barack Obama 1,251 views Tom Strand: Medeama gaffer desirous of coaching Black Stars in future Video: Ghana striker Asamoah Gyan talks about his move to China and Chinese football Medeama set to sign Windy Professionals sensation Enoch Atta Agyei Sepp Blatter will NOT stand down as FIFA president amid pressure claiming he’s ”done nothing illegal or improper” GFA Ex.Co ELECTION: Habiba Atta pledges support for women football despite defeat to Leanier Addy Ghana's 2014 World Cup campaign in danger after Zambia win protest (308) Black Satellites miss out on CAF U20 trophy after penalties defeat to Egypt (265) Nigeria annihilate Ghana 6-1 at African U17 Championship (250) Ghana U17 exit African Junior Championship after 0-0 draw with Ivory Coast (217) Kevin Prince Boateng suffers injury in Germany, doubtful for Ghana-Egypt clash (213) Social Media Feed [dc_social_tabs]\tLoading... Close", "source": "GHANAsoccernet.com - Latest Football News, Football Headlines, Live Scores, Results, Fixtures"}