{"published": "2015-09-18T07:01:00Z", "media-type": "News", "title": "Mourinho denies locker room drama ahead of Chelsea-Arsenal clash", "id": "55039afd-a094-4df2-b3b0-873c438f4eab", "content": "LONDON — Chelsea manager Jose Mourinho conjured up American cowboy movies, fictitious fights in the dressing room and a statement of faith in struggling forward Eden Hazard as he prepared for Saturday’s clash with Arsenal. \n\nThe two sides meet at Stamford Bridge for the Premier League’s showcase match of the weekend, with neither having made an ideal start to the season. \n\nChelsea has taken only four points from five league games, amid speculation of problems in the dressing room and a disagreement between Mourinho and captain John Terry - a claim the manager has strongly denied. \n  \n“I don’t have any problem with any one of my players,” Mourinho told reporters at the club’s training ground near Cobham, southwest of London. \n\n“Normally when bad results happen, the first thing that comes into your laptops, iPads and pens is to find a dramatic story: ‘Somebody punch somebody in the dressing room,’ ‘The manager doesn’t want to speak with this guy’. \n\n“‘Diego Costa fought with John Terry and before they start the fight they brought a translator for them to understand each other in the fight, because Diego cannot speak English and John cannot speak Spanish’... They organize like Far West duels - at this time we are going to fight, bring a translator to help us.” \n  \nThe reality, according to Mourinho, is much less dramatic. And has much more to do with the effects of poor results. \n\n“The other direction you (the media) don’t go is the direction which is real: you lose matches, you are affected, you lose confidence, you don’t want the ball.” \n\nHowever, despite its recent troubles, Chelsea will have been lifted by its 4-0 victory on Wednesday against Maccabi Tel-Aviv in the Champions League, despite Hazard missing an early penalty. \n\nHazard, who helped Chelsea win the Premier League last season, certainly has the public backing of his coach as the gifted Belgium playmaker tries to rediscover his form. \n  \n“He’s the best player in England,” Mourinho said. “He is the best and he will be the best again. I don’t know if it is tomorrow or if it is next week.” \n\nWhile Chelsea has failed to click, Arsenal clearly has a few problems of its own. \n\nDespite having a solid 10 points on the board, Arsene Wenger’s side has rarely looked really convincing this season and a re-shuffled team slumped to a 2-1 defeat away to Dinamo Zagreb in the Champions League in midweek. \n\nFormer Chelsea goalkeeper Petr Cech was on the bench, while Aaron Ramsey and Hector Bellerin and didn’t even make the trip to Croatia. \n \n\r\r \n  \n“In football you have to forget cheap excuses and focus on what matters on the day, which is the performance on the day. If you want to make a career at a club without any disappointment, or individual disappointment, it is not possible,” Wenger said. “I believe you can repair what happened. We are on a good run in the Premier League and it is important now to look at that.” \n\nAs if it were needed, adding further spice to Saturday’s game is the fact that the two managers clearly don’t get along. \n\nThey squared up on the sidelines during Chelsea’s 2-0 win last season and there was no handshake between the pair following Arsenal’s 1-0 victory last month in the Community Shield at Wembley Stadium. \n  \nWenger brushed off the media scrutiny of his relationship with Mourinho, saying: “No special relationship is my worry. All I worry about is our performance tomorrow. \n\n“I respect everybody in the job and focus on what I love and that is football. All the rest honestly does not concern me much.” \n\nWenger wasn’t concerned either by Chelsea’s poor start to the season. \n\n“It can happen,” he said. “Let’s not forget it is the start of the season and only five games have been played. \n\n“For us it is a big game and we know our position at the end of the season will depend on how well we do in the big games.”", "source": "Los Angeles Daily News"}