{"published": "2015-09-09T01:51:58Z", "media-type": "News", "title": "Insider Selling: Margaret Sheetz Sells 6,864 Shares of Medifast Stock (MED)", "id": "13e782bd-ecfb-4079-9c6b-86258605d0a6", "content": "Medifast (NYSE:MED) COO Margaret Sheetz sold 6,864 shares of the stock in a transaction that occurred on Thursday, September 3rd. The stock was sold at an average price of $28.00, for a total value of $192,192.00. Following the sale, the chief operating officer now directly owns 378,427 shares of the company’s stock, valued at $10,595,956. The transaction was disclosed in a document filed with the SEC, which is available at the SEC website. \n\nMargaret Sheetz also recently made the following trade(s): \n\nOn Wednesday, September 2nd, Margaret Sheetz sold 1,469 shares of Medifast stock. The shares were sold at an average price of $28.00, for a total value of $41,132.00. \n\nShares of Medifast (NYSE:MED) traded up 0.39% during midday trading on Tuesday, hitting $28.04. The stock had a trading volume of 109,598 shares. The company’s 50-day moving average price is $28.94 and its 200-day moving average price is $30.82. Medifast has a 12-month low of $26.43 and a 12-month high of $34.25. The firm has a market cap of $337.04 million and a price-to-earnings ratio of 28.27. \n\nMedifast (NYSE:MED) last issued its quarterly earnings data on Wednesday, August 5th. The company reported $0.48 earnings per share (EPS) for the quarter, hitting the analysts’ consensus estimate of $0.48. The business earned $72.20 million during the quarter, compared to the consensus estimate of $72.79 million. During the same period last year, the company earned $0.44 earnings per share. The business’s quarterly revenue was down 3.3% compared to the same quarter last year. Equities research analysts forecast that Medifast will post $1.71 EPS for the current year. \n\nSeveral equities analysts recently issued reports on the company. TheStreet raised Medifast from a “hold” rating to a “buy” rating in a research report on Friday, May 15th. Zacks downgraded Medifast from a “hold” rating to a “sell” rating in a research report on Monday, August 10th. \n\nMedifast, Inc. is engaged in the production, distribution, and sale of weight management and disease management products and other consumable health and diet products. The Company’s product lines include weight loss and management, meal replacement, and vitamins. The Company’s operations are primarily conducted through its wholly owned subsidiaries: Jason Pharmaceuticals, Inc, Take Shape for Life, Inc., Jason Enterprises, Inc., Jason Properties, LLC, Medifast Franchise Systems, Medifast Nutrition, Inc. and Seven Crondall, LLC. The Company offers a variety of weight and disease management products under the Medifast and Essential brands. The Company operates in two segments including Medifast segment, which consists of the sames from Medifast Direct Marketing and Take Shape For Life and the MWCC and Wholesale segment, which consists of the sales of Medifast Corporate and Franchise Weight Control Centers as well as Medifast Wholesale Physicians and international sales. \n\nReceive News & Ratings for Medifast Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Medifast and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News - Forex"}