{"published": "2015-09-16T13:02:00Z", "media-type": "News", "title": "RegeneRx Announces First Patients Enrolled in Phase 2b/3 U.S. Dry Eye Clinical Trial with RGN-259", "id": "78e5e55f-3ead-4edc-b267-0a4f7d14f75d", "content": "ROCKVILLE, Md. , Sept. 16, 2015 /PRNewswire/ -- RegeneRx Biopharmaceuticals, Inc. ( OTCQB: RGRX ) (\"the Company\" or \"RegeneRx\"), a clinical-stage drug development company focused on tissue protection, repair and regeneration, announced today that the first patients have been enrolled in a Phase 2b/3 clinical trial with RGN-259 (Thymosin beta 4), its sterile, preservative-free eye drop formulation developed for patients with dry eye syndrome, neurotrophic keratopathy (NK), and other corneal disorders.  The clinical trial is being sponsored by ReGenTree LLC, a joint venture between RegeneRx and GtreeBNT Co. Ltd. a Korean biopharmaceutical company and is being conducted by Ora Inc., an established contract research organization specializing in the field of ophthalmology.  \n\nThe double-masked, placebo-controlled trial is being conducted at four sites, will enroll approximately 350 dry eye patients, and is expected to be completed by the end of the first quarter of 2016.  The co-primary endpoints are assessments of total corneal staining and reduction of ocular discomfort in patients using RGN-259 compared to those using placebo.  Patients will use the eye drops 4 times daily for 28 days and be assessed periodically throughout the trial and at completion of treatment.  There will be numerous secondary endpoints that will also be evaluated pursuant to the trial protocol. \n   \n\"Enrollment of the first patient in our dry eye study marks an important milestone in the advancement of RGN-259, which was developed for this largely underserved market in the U.S. and abroad.  The relatively short duration of the trial, with results expected early in 2016, makes this an exciting opportunity for our company and stockholders and, most importantly, patients suffering from dry eye syndrome,\" stated J.J. Finkelstein , RegeneRx's president and chief executive officer. \n\nThymosin beta 4 (Tβ4), the  active ingredient in RGN-259, is a first-in-class, naturally occurring molecule that has been the subject of numerous published animal studies in the fields of ophthalmology, dermatology, cardiology, and central nervous system disorders, among others.  In addition to the animal studies, the molecule has been tested in three unique formulations in approximately 350 patients and has an excellent safety profile.  \n\nAbout RGN-259 (GBT-201) for the Treatment of Dry Eye Syndrome \nRGN-259 (designated GBT-201 in Korea) is a sterile, preservative-free topical eye drop for ophthalmic indications whose active ingredient is Thymosin beta 4 (Tβ4). Based on U.S. Phase 2 clinical trials in moderate and severe dry eye syndrome, RGN-259 was found to show statistically significant improvements in several signs and symptoms of dry eye, as well as positive trends in other outcome measures.  The data from these trials, as well as a recently completed clinical trial of RGN-259 in patients with NK, reflect RGN-259's mechanisms of action, support the \"protective\" effects of RGN-259, and provide RegeneRx with FDA-approvable clinical endpoints to be targeted in future clinical trials.  Dry eye syndrome is a multifactorial disease and it is well known that Tβ4 promotes cell migration and proliferation, modulates cytokines and/or chemokines related to inflammation, matures stem cells, and stimulates cell survival, all of which are believed to be important for effective treatment of DES. \n\nAbout RegeneRx Biopharmaceuticals, Inc. ( www.regenerx.com ) \nRegeneRx is focused on the development of a novel therapeutic peptide, Thymosin beta 4, for tissue and organ protection, repair and regeneration. RegeneRx currently has three drug candidates in clinical development for ophthalmic, cardiac and dermal indications, three active strategic licensing agreements in China , Pan Asia (Korea, Japan , and Australia , among others) and the U.S., and has an extensive worldwide patent portfolio covering its products.  RGN-259, the Company's Tβ4-based ophthalmic drug candidate, has been designated an orphan drug for the treatment of neurotrophic keratopathy.  RegeneRx was recently allowed by the FDA to move into Phase 3 clinical trials with RGN-259 for the treatment of patients with NK.  The drug candidate is also being studied in patients with dry eye syndrome in the U.S. and Asia.  RegeneRx, through its U.S. joint venture, ReGenTree LLC, is developing RGN-259 in the United States and expects to initiate a Phase 2b/3 trial in the third quarter of 2015.  RGN-352, the Company's Tβ4-based injectable formulation, is a Phase 2-ready drug candidate designed to be administered systemically to prevent and restore tissue damage associated with acute events such as heart attacks, strokes, and other similar traumatic injuries.  For additional information about RegeneRx please visit www.regenerx.com . \n\nAbout ReGenTree LLC \nReGenTree is a newly created U.S. joint venture company owned by G-treeBNT Co., Ltd, and RegeneRx Biopharmaceuticals, Inc. specifically to develop RGN-259/GBT-201 in the U.S. for ophthalmic indications.  ReGenTree licensed the rights to RGN-259 from RegeneRx in January of 2015 and is initiating Phase 2b/3 and Phase 3 clinical trials in patients with dry eye syndrome and neurotrophic keratopathy (an orphan indication) in September 2015.  Results from the trials are expected in March/April 2016.  RegeneRx retains a significant minority interest in the joint venture, along with a royalty on commercial sales, and is represented on the board of ReGenTree.  Certain commercial and financial transactions require RegeneRx approval.  G-treeBNT is responsible for operations of the venture and all funding required for clinical development of RGN-259/GBT-201 in the U.S. \n\nForward-Looking Statements \nAny statements in this press release that are not historical facts are forward-looking statements made under the provisions of the Private Securities Litigation Reform Act of 1995. Any forward-looking statements involve risks and uncertainties that could cause actual results to be materially different from historical results or from any future results expressed or implied by such forward-looking statements.  Forward-looking statements used in this press release relate to, among other things, the expected timing of initiation and completion clinical trials in the United States and the potential benefits to RegeneRx of such trials. There can be no assurance that any proposed clinical trial will start within the estimated initiation timeframe or be completed within the estimated timeframe or that positive results from any clinical trials or research by the Company, its collaborators, or independent parties in the U.S. or any other country will result in subsequent clinical confirmation or future value.  There can also be no assurance that any of the Company's drug candidates will result in any approved products in the U.S. or any other country.  Please view these and other risks described in the Company's filings with the Securities and Exchange Commission (\"SEC\"), including those identified in the \"Risk Factors\" section of the annual report on Form 10-K for the year ended December 31, 2014 , and subsequent quarterly reports filed on Form 10-Q, as well as other filings it makes with the SEC. Any forward-looking statements in this press release represent the Company's views only as of the date of this release and should not be relied upon as representing its views as of any subsequent date. The Company specifically disclaims any obligation to update this information, as a result of future events or otherwise, except as required by applicable law. \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/regenerx-announces-first-patients-enrolled-in-phase-2b3-us-dry-eye-clinical-trial-with-rgn-259-300144065.html \n\nSOURCE  RegeneRx Biopharmaceuticals, Inc.", "source": "Marketplace"}