{"published": "2015-09-10T16:14:57Z", "media-type": "News", "title": "Mihajlovic not scared to talk tough at Milan", "id": "c5e19167-c4a1-4051-b591-3fda3b22852c", "content": "MILAN, Sept 10 ( ) - Sinisa Mihajlovic, never one to mince his words, has already raised eyebrows at AC Milan with his tough management style, including public criticism of his players. \n\nThe tactics worked well for the fiery Serb during an impressive 18-month spell with Sampdoria and he has remained faithful to his combative personality at the seven-times European champions, where many expected him to tread more carefully. \n\nAfter one win and one loss in his opening two Serie A games, Mihajlovic faces his first severe test when his side face arch-rivals and neighbours Inter Milan at San Siro on Sunday (1845). \n\nMihajlovic was particularly critical after he gave some of the reserves a run out in the 3-2 friendly win against third tier Mantova last week. \n\n\"We aren't going anywhere if we think that we can win just because we are called Milan,\" he barked. \"None of these players should feel unhappy when they get left out of the team. I expected a lot more.\" \n\n\"We have no excuses,\" he continued. \"Today, those who haven't played much were given a chance and they showed why they are reserves.\" \n\nNot even Mario Balotelli, who scored the winning goal, was exempt. \"He is not yet in good shape and he has to improve,\" said Mihajlovic. \n\nBalotelli retorted: \"I have always been in good shape and put in the maximum effort like everyone.\" \n\nThe first-team players have not escaped, either. Following the 2-1 win over Empoli two weeks ago, Mihajlovic complained: \"The win is the only good news. We lacked personality.\" \n\nMihajlovic is one of the few coaches still willing to wash his dirty laundry in public. \n\nMost modern coaches tend to shy away from such behaviour, fearing they could \"lose the dressing-room\", and the fortunes of Germany's Felix Magath, notorious for his tough training methods, are a clear warning of the perils of embarrassing your own players. \n\nDespite winning three Bundesliga titles, Magath has not worked in Germany since he was sacked by Wolfsburg in October 2012 amid reports he had denied his players water after a cross country run. \n\nInter have won their first two games after overhauling their team during the summer break with Stevan Jovetic scoring all of their goals following his move from Manchester City. \n\nChampions Juventus, who have lost their opening two games and find themselves alongside Empoli, Carpi, Bologna and Frosinone on no points, will attempt to get off the mark at home to Chievo, one of five teams with six points, on Saturday.   (Writing by Brian Homewood in Berne; editing by Martyn Herman)", "source": "Mail Online UK"}