{"published": "2015-09-28T02:20:24Z", "media-type": "Blog", "title": "Chien Chung Wei Workshop!", "id": "3a183a39-ac38-4f22-8d6d-e5753c245e72", "content": "In August I was fortunate to have the opportunity to take a workshop given by Chien Chung Wei, the amazing watercolorist from Taiwan.  Chien came to the United States after giving a workshop in Italy, then Canada.  Next he was in Portland, Oregon, working his way down to Pasadena.  From following Chien on Facebook I was getting hint of what an exciting workshop it would be.  Chien has a school for watercolor study in Taiwan so he wanted to condense the three year course into three days for us!  It's all about the \"DNA of Beauty\".  He has ten foundation points of his DNA that we should learn and become a habit while we paint.  Six points were \"Yes\" things to keep in mind (like \"more detail in the focal point\") and four were \"No\"s (like no sameness or overdoing\").  Chien's emphasis is on good composition, having the elements of size, shape, value, color, detail, balance, all working together.  He also showed us how to fix bad brushstrokes.  He would rewet part of a stroke and put lines through it using the ferrule of a small inexpensive brush.  Chien also used the edges of a palette knife to add texture and abstract interest.  I hadn't seen that kind of work done before on a watercolor piece.  Opaque watercolors are also something Chien uses often.      After watching Chien paint a snow scene we all tried the same scene.  This was the only piece I painted in the workshop.  At the end of the first day he handed out a postcard of one of his paintings to each of us and we were to paint it as an abstract as homework.  My postcard was an older piece of his, a floral still life.  I tried the abstract but didn't take it far enough since it still looks like a vase of flowers.  I should try it again.  Chien emphasized the abstract quite often.  He likes detail in a painting to be \"loose detail\", abstract.  Also what isn't important in the piece should be abstract.     Originally the workshop was to have some plein air painting outside but the weather was too hot.  A very hot weekend.  Chien asked us if we would like to see him paint more demos or if we would like to paint more.  It was unanimous to watch Chien!  He is a very animated, while thoughtful, person.  What a treat, and I'm looking forward to taking another workshop from him sometime.  8\" x 10\" Watercolor  Chien first day Completed Venice nocturne, second day Third day demo started 5\" x 7\" Watercolor", "source": "Sherry Schmidt Watercolors"}