{"published": "2015-09-11T02:27:32Z", "media-type": "News", "title": "Phoenix I-10 shootings: Copycat possible", "id": "e446f8a4-fd5d-44f4-b15c-148023dae2a2", "content": "As if the rash of shootings along a busy stretch of Interstate-10 in downtown Phoenix wasn't bad enough, authorities now may have a copycat on their hands. \n \nThat's a real possibility after two additional shootings -- not on I-10 but along roadways elsewhere in the Arizona capital -- late Thursday morning. A source with direct knowledge of the investigation said this may be someone trying to emulate the earlier shootings. \n\nFor now, though, police are investigating the latest incidents as separate shootings, having not definitively linked them to the earlier cases. Arizona State Troopers spokesman Tim Case said Thursday afternoon there have been 11 confirmed shootings in and around I-10 in less than two weeks, not including what he called \"numerous reports this morning of other vehicles with damage.\" \n\n\"This has not been confirmed to be part of this investigation,\" Case said of the new cases. \n\nArizona's Department of Public Safety chief hasn't yet called this the case of a serial sniper, which could imply someone staking out a perch to selectively target people. Nor have authorities given any indication that they have a suspect in mind. \n\nBut Col. Frank Milstead, the DPS director, has called tracking down the person responsible \"job one,\" a sentiment echoed Thursday by Arizona's governor. \n\n\"This is our top priority in our administration,\" Gov. Doug Ducey said. \"I'd ask Arizonans to remain alert and aware. And we're going to find who's doing this and bring them to justice.\" \n\nNew round of shootings after break \n\nThe first shootings were reported on August 29, when bullets hit three vehicles -- an SUV, an empty commercial tour bus and a passenger car -- as they traveled along I-10. \n\nThere were two more shootings over the subsequent two days, then a break until the shootings apparently resumed on Sunday. Since then, there have been two box trucks, two pickups, a passenger car and a tractor trailer -- the latest incident Thursday morning -- struck. \n\nMilstead said then that some of the motorists didn't immediately realize their cars had been shot, thinking the loud noise they heard was an object on the highway that hit their vehicle. \n\nBullets struck seven of the vehicles, according to the Case. The others were hit by projectiles that authorities are still trying to specify. \n\nThe good news is that none of these shootings have been fatal. In fact, there's been only one related injury: A 13-year-old girl whose right ear was cut late last month when a bullet pierced the windshield of the SUV in which she was riding. \n\nBut Milstead told CNN that luck may not hold out if this continues, which is why Gov. Doug Ducey referenced the shootings while tweeting that \"the safety of Arizonans is our number one priority.\" \n\n\"All of these acts are potentially lethal encounters,\" Milstead told CNN on Wednesday. \"When you're shooting into a moving vehicle with unwitting occupants, (it could be) lethal.\" \n\nOfficial: Find shooter 'before someone is ... killed' \n\nArthur Roderick, a former assistant director for the U.S. Marshals, noted the Phoenix shootings appear different from the October 2002 Washington-area sniper attacks that he helped investigate. \n\nFor one, multiple weapons would be different from the single gun in the Beltway sniper case. And the latest shootings are more localized and not across several states. \n\nThe more confined area could be a plus, with Roderick telling CNN, \"They're able to concentrate all their efforts in that one particular area.\" \n\nThat's what authorities are doing in Phoenix by utilizing state police, local departments' SWAT teams, FBI resources and highway surveillance cameras to keep an eye on the area. \n\nAs to the motivation and who is responsible, Milstead said, \"We don't have a suspect in mind yet. \n\n\"But we will find who this is,\" he added. \"And hopefully, we get to them before someone is seriously injured or killed.\"", "source": "KOCO 5"}