{"published": "2015-09-07T09:50:14Z", "media-type": "News", "title": "Teen novel prompts first New Zealand book ban in decades", "id": "c441128a-7f52-4a54-88e6-ae0c3d116921", "content": "WELLINGTON : New Zealand censors sparked outrage Monday after banning an award-winning teen novel that includes sex and bullying, making it the first book removed from shelves in more than two decades. \n \nAuckland author Ted Dawe said he was \"blindsided\" by the ban on his coming-of-age story \" Into the River \", which won the New Zealand Post children's book of the year in 2013. \n \n\"It's extraordinary,\" Dawe told the New Zealand Herald . \"I've had quite a few emails from people who share that sense of outrage. \n \n\"Do we live in a country where books get banned? I'll get burnt next.\" \n \nThe book tells the story of a Maori boy who wins a scholarship to an exclusive Auckland boarding school but struggles with racism and drugs. \n \nAfter numerous battles with censors, selling it can now attract fines of up to NZ$3,000 (RM8,135.88) for individuals and NZ$10,000 for companies. \n \nThe Film and Literature Board of Review said the ban was temporary and would be in place until the organisation reviews the decision next month. \n \nA spokesman confirmed that no book had been subject to such a ban since current legislation was introduced in 1993. \n \nThe board took action after submissions from conservative lobby group Family First New Zealand, which said it objected to detailed descriptions of sex acts, coarse language and scenes of drug-taking\". \n \n\"The censor has received over 400 emails of complaint ... from concerned Kiwi parents, their desire to protect their children must also be respected,\" the group's national director said. \n \nBooksellers New Zealand chief executive Lincoln Gould described the ban as bewildering. \n \n\"It's not offensive, it's a quality book that has been acclaimed by the experts,\" he told AFP . \n \n\"It's most concerning that it's happening in this country.\" — AFP", "source": "The Sun Daily"}