{"published": "2015-09-17T21:55:29Z", "media-type": "Blog", "title": "'Modern Screen,' November 1931: Curses -- foiled again!", "id": "2f098f6d-f436-48ff-91c4-66aa1d8d7080", "content": "Posted by vp19 on 2015.09.17 at 14:48\nCurrent mood: aggravated\n\n\nI apologize for not being able to do more with that attractive photo of Carole Lombard, but for the second time in a week I've run afoul of some gaps in the otherwise impeccable run of fan magazine holdings in the Media History Digital Library. The other day, I discovered to my dismay that the December 1933 issue of Hollywood magazine wasn't part of its online listings; today, it's the November 1931 issue of Modern Screen.\n\nThe copy is hard to make out (the original was very small), but we can see a reference to \"The Greeks Had a Word For It,\" the Samuel Goldwyn film Carole had to drop out of due to illness. And I believe this was taken at the Iris Circle home in Whitley Heights she shared with William Powell, her husband of a few months.\n\nSome online scouring enabled me to find pages from this issue, such as the cover with Elissa Landi:\n\n\n\nInside is a feature on Jean Harlow, not yet an MGM contract player...\n\n\n\n...and Ann Harding, a big star at the time, showing off her style through some drawings:\n\n\n\nAccording to the seller, other articles include features on Greta Garbo, Dick Barthelmess, Joan Bennett, Tallulah Bankhead, Lewis Stone and Wallace Beery. Movie ads include \"Susan Lenox: Her Fall and Rise\" (Garbo's lone teaming with Clark Gable), \"Sob Sister,\" \"Are These Our Children?\" and \"The Cisco Kid.\"\n\nThe magazine is said to be in very good condition. Bidding begins at $16.99, with the auction scheduled to close at 3:40 p.m. (Eastern) Thursday. You can bid or simply find out more by visiting http://www.ebay.com/itm/MODERN-SCREEN-1931-ELISSA-LANDI-JEAN-HARLOW-Story-CAROLE-LOMBARD-GRETA-GARBO-/361390536293?hash=item54248df665.\n\nLink  Leave a comment\nEdit   Tags   Add to memories   Share   Track", "source": "Carole & Co."}