{"published": "2015-09-14T11:42:22Z", "media-type": "News", "title": "Plexxi Raises $35 Million to Transform Networks for a New IT Era", "id": "668e3441-41b8-42b0-a7cf-05b3925ad69d", "content": "]]> \n\n\nNASHUA, N.H. , Sept. 14, 2015 /PRNewswire/ --  Plexxi , a pioneering next-generation converged networking company and SDN market leader, today announced that it has raised a $35 million round of financing to continue the company's rapid growth in the software-defined agile datacenter market. The round was led by a new investor with participation from existing investors Lightspeed Venture Partners, Matrix Partners and North Bridge Venture Partners. \n\nThe investment in Plexxi is recognition of the company's groundbreaking approach and market adoption in building a new generation of software-defined data centers that deliver a flexible, agile architecture for new scale-out application and cloud services offerings. \n\n\"We are experiencing a generational shift to a new era of IT in which applications and data are rapidly increasing demand for a new agile and scale-out networking architecture,\" said Rich Napolitano , CEO of Plexxi. \"Plexxi represents a transformative converged networking and application-centric approach to traditional legacy networking. 2015 has been a record-breaking year for Plexxi as we gain a foothold in federal, financial services, education and service providers markets here in the United States and around the world.\" \n\nAccording to a recently published report by Dell'Oro Group, the layer 2-3 Ethernet switch market is expected to exceed $25 billion in 2019. \"Datacenter switching will evolve rapidly through the rest of the decade and will drive most of the growth in the Ethernet switch market,\" said Alan Weckel , Vice President of Ethernet Switch market research at Dell'Oro Group. \"The cloud will help spur the adoption of software defined networking (SDN) that is another key driver in the evolution from an enterprise-driven to a cloud-dominated Ethernet switching market. The cloud's need to scale, be flexible, and differentiate are ultimately all governed by what can be achieved in software.\"   \n\nThe latest financing round brings Plexxi's total funding to $83 million . The infusion of capital will help fuel the rapid expansion of Plexxi's sales, marketing, customer support, and research and development efforts as it accelerates the company's vision of a software-defined architecture in datacenters and service provider networks. \n\n\"We continue to be very excited about Plexxi and the significant market opportunity in front of them,\" said Tim Barrows , General Partner at Matrix Partners. \"Their single-tier network architecture is uniquely well suited for next-generation datacenters and provides unprecedented control, intelligence and scale.\" \n\nPlexxi announced Napolitano as CEO in November 2014 as it readied the company for commercialization. Since his introduction, Plexxi has been focused on gaining customers across three rapidly growing markets: agile datacenters, scale-out application infrastructure and distributed cloud co-location service providers. \n\nAbout Plexxi Inc. \nPlexxi is a pioneer of next-generation networking products and solutions for agile data centers, scale-out applications and distributed cloud environments. Plexxi's products – Plexxi Control and the Plexxi Switch – and market solutions create an optimized network that dynamically helps applications perform better and operate at the speed of business. Headquartered in Nashua, N.H. , Plexxi has raised $83 million in financing from investors including Lightspeed Venture Partners , Matrix Partners and North Bridge Venture Partners . For more information, visit www.plexxi.com or follow us on Twitter @ PlexxiInc .  \n\n\nMedia contact: \nAlex Ingram \n781-966-4156 \nplexxi@inkhouse.com  \n\nLogo - http://photos.prnewswire.com/prnh/20150804/254487LOGO  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/plexxi-raises-35-million-to-transform-networks-for-a-new-it-era-300141897.html \n\nSOURCE  Plexxi, Inc.", "source": "Sys-Con Canada"}