{"published": "2015-09-23T20:10:29Z", "media-type": "News", "title": "The new Day hungers for more after reaching world No. 1", "id": "eb0d748f-060d-4d4f-aac5-983b75b0d43b", "content": "ATLANTA: Jason Day said he did not feel anything special after achieving a career goal by ascending to the world number one ranking with his emphatic victory at last week's BMW Championship. \n\n\"It doesn't feel like much. It doesn't feel like much at all,\" the 27-year-old Australian said on the eve of Thursday's opening round of the Tour Championship at East Lake Golf Club. \n\nDay gave evidence of the maturity that helped him shake off the disappointment of so many near misses at majors and break through at last month's PGA Championship as part of an amazing run of four wins from his last six tournaments. \n\n\"It's not like that one big shining moment or one big sense of relief that, 'oh, I've done it now,'\" he said. \n\n\"It makes me a lot more hungry to try and keep my position at No. 1 because I want to try and extend it.\" \n\nIn the last month, the world number one ranking has bounced between Rory McIlroy, Jordan Spieth and now Day, who kept referencing the hard work he has put in to get to the top. \n\nDay was reminded about the attitude he held back when he first tasted PGA Tour success with his victory at the 2010 Byron Nelson Championship, when he said it all came very easily for him and that he did not need to work that hard. \n\n\"Yeah, it's easy to get a big head, isn't it? Sometimes I can't fit it through the bloody door,\" he joked. \n\n\"I do remember that and I do remember slacking off, because I did think it was easy. I came over (from Australia) and everyone's going, 'this is the next great young guy that's going to take on Tiger Woods' and I had a good year on the Web.com (Tour).\" \n\nThe long-hitting Day owned up to some of his bad habits at that time. \n\n\"I was playing like eight hours of video games every day. I did everything I possibly could not to play well, and I did it and I didn't play well.\" \n\nIt is a new Day that now aims at winning the 30-player Tour Championship and US$10 million bonus prize that would come with a victory. \n\n\"I know how hard I've had to work,\" said Day. \"I've got to either do the same work or a little bit harder to try and improve myself.\" \n\n(Editing by Frank Pingue)", "source": "Channel NewsAsia"}