{"published": "2015-09-08T14:33:13Z", "media-type": "News", "title": "Mount Gretna shop owner sought protection from ex-boyfriend after December attack", "id": "e7d0831f-780e-4806-9838-835752688971", "content": "Stacey Pennington, the 46-year-old woman shot and killed outside her Mount Gretna gift shop Monday morning, had obtained a Protection From Abuse order against her alleged assailant last December after he attacked her in her home. \n \nPatrick Lynn Derr, 47, who was accused of fatally shooting Pennington , was to be sentenced Wednesday on charges of assault and harassment stemming from a Dec. 26 incident in her South Lebanon Township home. \n \nThis wasn't Derr's first violent episode involving a woman. \n \nIn 2008, a former girlfriend had also obtained a PFA against him after an attack in Millcreek Township in which she said he tried to rape her. He was found innocent in a jury trial of attempted rape, but was found guilty of assault and harassment. \n \nIn the PFA order obtained by Pennington, she said Derr was drunk when he came into her bedroom, took a TV remote from her hand, grabbed her by the throat, threw her against the headboard and a corner cabinet, and began strangling her. \n \nPennington said he trapped her in the bedroom, threw her into the closet, told her she wasn't going to leave for 48 hours, and blocked the doorway. \n \nAs she tried to leave, he threw her down and stepped on her throat, Pennington told authorities. She was able to get away, and asked him for ice for her injured knee, and fled to a neighbor's home for help. \n \nSouth Lebanon Township police said Pennington told them her live-in boyfriend, Derr, had pushed, slapped and struck her multiple times and choked her. They charged Derr with two counts of simple assault and one of harassment. \n \nDerr pleaded guilty to the charges and was to be sentenced Wednesday in Lebanon County court. \n \nIn the restraining order, Pennington said she wasn't aware that Derr owned any firearms. The order prohibited him from acquiring any firearms for the duration of the order, which was to be Jan. 29, 2018. \n \nIn the 2008 charges from Millcreek Township, Derr was found innocent of attempted rape, aggravated assault, terroristic threats and false imprisonment in an October 2008 trial. But he was found guilty of simple assault and harassment, and sentenced to one to 12 months in prison. \n \nThat victim told police Derr became violent after she declined to have sex with him, and ripped her underwear off, hit her in the head and tried to choke her. \nDerr also pleaded guilty to a DUI in 2", "source": "PennLive.com"}