{"published": "2015-09-18T02:19:53Z", "media-type": "News", "title": "Apple watch awarded 'Gadget of the Year'", "id": "07ae333e-671c-4dfd-a1d0-6d1f7ada6058", "content": "The Apple Watch has held off rivals Samsung and Microsoft to pick up the coveted T3 magazine Gadget of the Year award.\n\nApple's smartwatch was also named wearable technology of the year, as the iPhone-maker walked away with four awards in total from the ceremony in London; also winning best brand and best laptop or tablet for the iPad Air 2.\n\nSamsung's Galaxy S6 edge was named phone of the year, beating the iPhone, while Microsoft's HoloLens augmented reality headset won the design innovation award.\n\n\"Once again Apple have produced a product that has galvanised a market,\" T3's editor Rob Carney said of the Apple Watch.\n\n\"In a year of outstanding new products, this stood out to all of the judges and voting public as the outstanding tech of 2015.\n\n\"The tech and fashion media have nothing in common, yet both enthused about Apple Watch. That says it all about this high-style, high-tech, highly personal device.\n\n\"It's a worthy winner of the 2015 gadget of the year.\"\n\nThis year's outstanding achievement award went to Palmer Luckey, the inventor of the Oculus Rift virtual reality headset.\n\nSince creating the first prototype six years ago, Luckey's company has been bought by Facebook for a reported $US2 billion ($A2.79 billion).\n\n\"I really love getting awards, but it's way cooler to see how people respond to what we make,\" Luckey said.\n\n\"When we go to a show and people go 'wow this is incredible', that's really cool. I feel like this reward is a reflection of that.\"\n\nOther winners on the night included BMW, whose i8 won car of the year, while LG beat Samsung to the TV of the year prize.\n\nAmazon's Instant Video also beat streaming rival Netflix to the entertainment award.\n\nTo mark the launch of Windows 10 this year, Microsoft Windows was named as the T3 hall of fame entrant.", "source": "Brisbane Courier-Mail"}