{"published": "2015-09-21T21:37:59Z", "media-type": "News", "title": "Precinct 4 Abates Nuisance Property", "id": "57972988-4fff-44f9-8760-2b670650788d", "content": "Harris County Precinct 4 works to provide relief for residents dealing with neighborhood nuisances. \n  \nThe Texas Neighborhood Nuisance Abatement Act gives the county authority to control nuisance properties that pose health and safety risks through legal action or by demolishing structures in unincorporated areas that are considered unsanitary, unsafe or abandoned. \n \nIn September, Precinct 4 partnered with Harris County Public Health & Environmental Services (HCPHES) to abate a property in the Northwood Park subdivision, located at 21318 Tophill, at a cost of $8,769. Since 2011, the county has received more than 15 written complaints, daily calls and a petition signed by 72 Northwood Park residents about the property. \n \nIn the last five years, an average of five properties in Precinct 4 have been demolished using funding from Precinct 4 and Harris County’s Community Services Department. While intended to improve public health, nuisance abatements can also help increase property values and improve quality of life. \n \nAfter receiving a complaint, Harris County Public Health investigates the property. If the property is in violation of any nuisance abatement laws, the agency gives the owner 30 days to address the violation or face civil or criminal prosecution. If the property is abandoned or the owner does not respond to warning notices or a notice to abate in a local newspaper, the county can demolish it and place a lien on the property. \n \nOther examples of neighborhood nuisances include accumulated rubbish, standing water, abandoned swimming pools, high weeds, dilapidated structures and any other conditions that breed disease-causing pests within a recorded subdivision or 300 feet from a recorded subdivision. \n \nTo report a suspected nuisance property in unincorporated areas of Harris County, residents should contact the Environmental Health Division of Harris County’s Public Health & Environmental Services at 713-274-6300 Monday through Friday from 8 a.m. to 5 p.m.", "source": "Waller County News Citizen"}