{"published": "2015-09-11T13:00:27Z", "media-type": "News", "title": "Weleda Announces Partnership Benefiting Whole Kids Foundation", "id": "92731f9a-dff6-4f0d-a4cc-28ccf861b4a3", "content": "NEW YORK, Sept. 11, 2015 /PRNewswire/ -- Weleda – pioneers of 100% certified-natural skincare, proudly announces its nationwide partnership with the Whole Kids Foundation.  For the third year, Weleda is teaming up with Whole Foods Market to give back, marking $30K in donations in the past three years to Whole Planet and Whole Kids Foundations. \n\nWeleda will donate $1 to Whole Kids Foundation (up to $10K) for every Weleda baby care product purchased at Whole Foods Market throughout the month of September, in an effort to support healthier kids and inspire families to teach children how to love fresh, nutritious whole foods. \n\nTo further support the initiative, Whole Foods Market and Weleda will be offering a 30% discount off the entire Weleda Baby & Child Calendula line and the new Baby Derma White Mallow Collection. \n\n\"We're thrilled to enter our third year of partnership with Whole Foods Market,\" said Jasper Van Brakel, CEO of Weleda North America. \"We support Whole Kids Foundation's mission to promote school gardens and provide healthy choices for our children, because for Weleda, healthy choices include skincare products for babies and kids that are not only natural but also made with nourishing ingredients we grow in our own gardens.\" \n\nWELEDA – In harmony with nature and the human being \n\nWeleda has been developing anthroposophic medicines and natural cosmetic products since 1921.  Our products are really beyond \"natural\" and \"organic.\" They are rooted in a 90 year-old philosophy from which they derive a unique effectiveness based on a profound understanding of nature and the human being. They are the result of a sincere, uncompromising dedication to quality represented by the NATRUE seal, and of a pioneering tradition of economic responsibility and of fairness and respect towards both nature and our various stakeholders, including our employees and our suppliers. Fair trade, active protection of natural resources and biodiversity, and a high level of transparency: these are all a matter of course for us. Every Weleda product on the shelf embodies our unique knowledge, quality and values. They have earned Weleda the trust of consumers around the world. \n\nAbout Whole Kids Foundation® \n\nWhole Kids Foundation is a nonprofit organization established by Whole Foods Market in order to support schools and inspire families to improve children's nutrition and wellness. Whole Kids Foundation is guided by the same values, principles, expertise and standards for quality ingredients, food production methods and nutrition as Whole Foods Market.  Learn more at wholekidsfoundation.org. \n\nLogo - http://photos.prnewswire.com/prnh/20150910/265593LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/weleda-announces-partnership-benefiting-whole-kids-foundation-300141413.html \n\nSOURCE Weleda \n\nPublished Sep. 11, 2015 \n\nCopyright © 2015 SYS-CON Media, Inc. — All Rights Reserved. \n\nSyndicated stories and blog feeds, all rights reserved by the author.", "source": "Virtualization Conference & Expo"}