{"published": "2015-09-14T22:46:28Z", "media-type": "News", "title": "Sears Canada Announces Updates to Loyalty Program and Credit Card Transition Process", "id": "a2b15c2d-53d3-4489-96b4-a84447152127", "content": "New, modernized Sears Club loyalty program improves customer experience  \n \nTORONTO , Sept. 14, 2015 /CNW/ - Sears Canada Inc. (TSX: SCC; NASDAQ: SRSC) is today announcing an update and modernization to its customer loyalty program, Sears Club, which will bring it more firmly into the digital age. The enhanced Sears Club loyalty program, set to launch before the Holiday shopping season, will offer improvements to the customer experience. Members will now earn valuable Sears Club points on purchases made in cash as well as with any debit or credit card accepted by Sears Canada. Customers can earn points on purchases made in store, through the Catalogue, online at www.sears.ca , or on mobile devices. \n \nUnder the new loyalty program, Sears Canada will: \n\n Provide existing Sears Club customers with a new Sears Club membership card, independent of any credit card  Deliver to customers the new Sears Club membership card and program kit in time for the Holiday shopping season  Transfer all existing Sears Club points to a new Sears Club membership card in the customer's name  Maintain the value of all existing points  Feature enhanced bonus points programs, and even more brands for which to redeem points  Offer customers the option of redeeming any Sears Club points earned, including those transferred from the previous Sears Club loyalty program card, towards any purchases made at Sears Canada, whether in cash, or with any debit or credit card accepted by Sears Canada. \nAll of this will happen without the Sears Canada customer having to do anything at all other than continuing to shop at Sears Canada using their new Sears Club membership card. \n \nAs part of the modernization and ongoing improvement to Sears Canada products and services, the company is also in the process of updating the look and feel of its Sears Club brand identity elements. Sears Canada is excited to share more information on these initiatives in the near future. \n \nSears Canada is committed to providing payment and financing options to its customers across Canada . To that end, the company continues to work on the development of a Sears Canada credit card program. As originally announced on November 17, 2014 , the agreement with JPMorgan Chase Bank N.A. (\"JPMorgan Chase\") to manage the Sears Card and Sears MasterCard will terminate on November 15, 2015 . JPMorgan Chase will soon communicate with customers about how this will affect their exisiting Sears-branded credit cards. \n \nFor Sears Canada's retail business, the enhanced Sears Club loyalty program allows the Company to better control its own promotional strategies, and provides more flexibility for future program innovations. The conclusion of the existing relationship between Sears Canada and JPMorgan Chase will also result in Sears Canada receiving up to CAD $174 million if a sale of the Sears Card and Sears MasterCard credit card portfolio occurs. Such payment would further strengthen our balance sheet, thereby enhancing our ability to compete and win the business of Canadian shoppers. There is no assurance that such a transaction will be achieved or that the necessary conditions for the payment will occur. \n \n\"We are excited to launch the enhanced Sears Club loyalty program which allows customers to earn and redeem points on purchases using their preferred method of payment,\" said Brandon G. Stranzl , Executive Chairman, Sears Canada Inc. \"Existing Sears Club members can be assured their points will be transferred to the enhanced program at the conclusion of the agreement between Sears Canada and JPMorgan Chase. Our customers already have a meaningful direct one-on-one relationship with us, and this relationship will be further enriched through the launch of the improved Sears Club loyalty program, in combination with future credit card or similar financial products. These program enhancements provide us an opportunity to reach out and speak directly with millions of our customers, and to increase the number of recurring touchpoints between us and our customers so we can provide them with an outstanding retail experience that helps them outfit their lives with brands they love.\" \n \nMore information on the enhanced Sears Club program and next steps for Sears Card and Sears MasterCard card holders will be sent to them in the next few weeks from Sears Canada. For now, Sears Canada customers can continue to use their existing Sears Cards and Sears MasterCards as they always have, without disruption. \n \nForward-Looking Statements \n \nThis release contains information which is forward-looking and is subject to important risks and uncertainties. Forward-looking information concerns, among other things, the Company's expectations regarding the launch of the new loyalty program as contemplated and the anticipated impact of the non-renewal of and amendments to the credit card program agreementon the Company. Often, but not always, forward-looking information can be identified by the use of words such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"scheduled\", \"estimates\", \"intends\", \"anticipates\" or \"does not anticipate\" or \"believes\", or variations of such words and phrases, or statements that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will\" be taken, occur or be achieved. Although the Company believes that the forward-looking information presented is reasonable, such forward-looking information involves known and unknown risks, uncertainties and other factors which may cause actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking information and undue reliance should not be placed on such information. Factors which could cause actual results to differ materially from current expectations include, but are not limited to: the ability of the Company to launch the new loyalty program as contemplated and to secure an agreement with a financial institution for the management of the credit and financial services operations on terms and conditions as favourable to the Company as those it currently has under its credit card marketing and servicing alliance with JPMorgan Chase, which, if not attainable, would materially affect the Company's results of operations and financial condition. The forward-looking information in this release is, unless otherwise indicated, stated as of the date hereof and is presented for the purpose of assisting investors and others in understanding the developments described in this press release and may not be appropriate for other purposes. The Company does not undertake any obligation to update publicly or to revise any forward-looking information, whether as a result of new information, future events or otherwise, except as required by law. \n \nAbout Sears Canada \n \nSears Canada is a multi-channel retailer with a network that includes 166 corporate stores, 177 Hometown stores, over 1,200 catalogue and online merchandise pick-up locations, 84 Sears Travel offices and a nationwide repair and service network. The Company also publishes Canada's most extensive general merchandise catalogue and offers shopping online at www.sears.ca \n \nSOURCE  Sears Canada Inc. \n \nCopyright 2014 PR Newswire.  All Rights Reserved \n\nSource:PR Newswire.\r\n All Rights Reserved", "source": "AEC News Room"}