{"published": "2015-09-21T06:28:01Z", "media-type": "News", "title": "Wheat’s Worst Plunge Since 1986 Isn’t Steep Enough for Bears", "id": "ef9ae4d9-b984-4024-8e36-2a81017c0f75", "content": "Hedge funds are so down on wheat that even the worst price plunge in 29 years isn’t leaving them satisfied. \n \nInstead, a global glut has money managers ready for more losses and sticking with a net-bearish outlook for seven straight weeks. World inventories before the start of next year’s harvest are expected to climb to an all-time high as farmers reap bigger crops in the U.S., Russia and Ukraine. \n \nWheat futures have tumbled 22 per cent since the end of June, heading for the worst quarterly loss since 1986. American farmers are particularly struggling because they’re saddled not just with bigger stockpiles, but also a rising dollar. The stronger currency is making exports from the U.S., the world’s top shipper, more expensive for overseas buyers. \n \n“You have a lot of producers around the world coming in with pretty solid crops,” said Sameer Samana, a St. Louis-based global quantitative strategist at Wells Fargo Investment Institute, which oversees $1.6 trillion. “You have France, the U.S., Russia, Ukraine and others all jockeying to sell their wheat. That will probably continue to put pressure on prices.” \n \nThe wheat net-short position, or bets on declines, totalled 39,382 futures and options in the week ended 15 September, according to U.S. Commodity Futures Trading Commission data released three days later. The seven weeks of bearish outlook is the longest streak since late June. \n \nFutures dropped 18 per cent this year to $4.8325 a bushel in Chicago. The Bloomberg Commodity Index of 22 components fell 16 per cent. The MSCI All-Country World Index of equities dropped 5.9 percent, and the Bloomberg Dollar Spot Index gained 6.1 per cent. \n \nThere’s not a lot of demand for all that grain. In the U.S., commitments for exports this season are trailing last year’s pace by about 13 percent, government data show. French shippers are also having a hard time attracting buyers, and there’s so much excess supply in the country that some silo operators are maxed out. \n \n“Investors are perpetually short because it’s a market where you’ve got a crop coming out of just about every country in the world,” said John Stephenson, the chief executive officer of Stephenson & Co. Capital Management in Toronto, which oversees C$55 million ($41.6 million). “It’s so well-supplied globally that it’s never usually a problem getting your hands on wheat.” \n \nBloomberg News, edited by ESM", "source": "European Supermarket Magazine"}