{"published": "2015-09-11T02:27:12Z", "media-type": "News", "title": "Verizon says TV streaming could be added to new mobile video service", "id": "b109f440-8c0c-4727-980f-27c6a0a125d7", "content": "10:27 p.m. EDT \n \nBy Malathi Nayak \n \nLAS VEGAS (Reuters) - If Verizon's new mobile video service go90 succeeds in grabbing the attention of millenials who increasingly watch content on mobile devices, a streaming option for TVs could be next. \n \nVerizon Communications Inc, the No. 1 U.S. wireless carrier, launched a trial of its free, ad-supported mobile video product, an app that offers live events, on-demand shows and Web videos, on Tuesday. \n \nCompanies such as Netflix Inc and Hulu that offer Web-based video services have put pressure on traditional pay-TV companies that are struggling to add viewers. \n \nWith go90, Verizon, which also offers a separate pay-TV service through its FiOS unit, has taken a different approach by introducing an ad-supported, short-form mobile video service. \n \n\"We said, Let's start with a mobile-first product,\" Marni Walden, Verizon's president of product innovation and new businesses, told Reuters on Thursday. \"The thought is that there could be a companion product that would come at some point in the future that could be in-home\" for TVs.   \n \nVerizon wanted to leverage its mobile network to stand out in a crowded streaming video market, Walden said. \n \nDish Network Corp and Sony Corp also offer online video services. On Wednesday, Apple Inc announced an improved version of its set-top box, Apple TV, without details on new content agreements. \n \n\"Our focus is all on our mobile product today,\" Walden said. \"We have to be successful with this product first and then we would have the right to say, 'Yes, let's go do the companion.'\"   \n \nGo90 was developed from OnCue video streaming technology, which Verizon purchased from Intel Corp in 2014.   \n \n\"We don't believe trying to replace linear TV is the right thing,\" Walden said. \"We don't think the initial model we saw in Intel Media with $80 broadband and $80 content was one we could win at, particularly with all of the clutter and noise in that same space.\" \n \nGo90's content partners include the National Football League, VH1, the Food Network and ESPN. From the Web, it will offer videos from Maker Studios, Machinima and AwesomenessTV, among others. \n \nVerizon is also considering letting users create content in the future, Walden said. \n \nGo90 will use Verizon's multicast video technology that streams live events to multiple mobile devices through a single lane of airwaves. \n \nMoving forward, Verizon aspires to relay events to a global audience, although that would require negotiating streaming rights, Walden said. \n \n(Reporting by Malathi Nayak; Editing by Leslie Adler)", "source": "92.9 WLMI"}