{"published": "2015-09-14T14:55:33Z", "media-type": "Blog", "title": "Kerry Simon, Las Vegas 'Iron Chef' Winner, Dies At 60", "id": "965ba3f5-48ef-4f5d-be23-ec7fb4589774", "content": "LAS VEGAS (AP) — Kerry Simon, a former \"Iron Chef\" champ who served up dishes to rock bands such as Led Zeppelin and Mötley Crüe, has died.\n\nSimon died Friday morning at a hospice facility in Las Vegas, according to his business partner, Cory Harwell.\n\nHe was 60.\n\nSimon was diagnosed with Multiple System Atrophy, a degenerative neurological disorder, and died from complications related to the disease.\n\nHarwell, who met Simon in 2009, said he did not let his disorder keep him from doing what he wanted to, which was open restaurants. Simon operated restaurants at several Las Vegas hotels including Palms Place and Harrah's. He and Harwell formed their own restaurant-hospitality management group in 2013 and opened four restaurants together with a fifth one still on the horizon.\n\nEven with the loss of his motor skills, Simon continued carrying out his vision for a planned fifth restaurant.\n\n\"He ate everything and made suggestions and comments and fixes,\" Harwell said. \"I learned more from him in the past two and a half years than a lifetime of working in and out of kitchens. I'll cherish that forever.\"\n\nKnown as the \"rock 'n' roll chef,\" Simon appeared on \"Iron Chef America\" in 2005 and beat Cat Cora in a hamburger challenge.\n\nHe first made a name for himself at age 34 as an executive chef at The Plaza Hotel in New York City, according to his company's website.\n\nHe gained a reputation for feeding some of the most famous names in the music world including Alice Cooper and the band Cheap Trick. But he loved to cook for anyone, Harwell said.\n\n\"An average Joe, he would treat the exact same way,\" Harwell said. \"There was no pretention.\"\n\nSimon is survived by three brothers.\n\nFuneral services have not been set.\n\n(© Copyright 2015 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten or redistributed.)", "source": "CBS Los Angeles"}