{"published": "2015-09-02T02:52:15Z", "media-type": "News", "title": "Call to add family home to age pension calculations", "id": "5ed8f1d7-0233-4615-9ff6-75361f4d3035", "content": "Financial heavyweight says family home could be included in means testing for the age pension. Financial heavyweight David Murray says the family home could be included in means testing for the age pension. Subscribe to Money’s weekly newsletter, delivered to your inbox every Wednesday\n\nIncluding the value of the family home above a \"reasonable threshold\" in the assets test for the age pension should be \"considered\" to produce more equitable outcomes in the retirement system, a report by the Actuaries Institute says.\n\nIn launching the report: \"For Richer, For Poorer\" in Sydney on Wednesday, David Murray, the former boss of the Commonwealth Bank and head of the inquiry into financial system, reaffirmed his view that it is an idea worth looking at.\n\n\"I do not see any way of solving this without looking at the way all assets are taxed including the family home combined with super, combined with the age pension and the welfare system,\" he said.\n\nMr Murray said he has \"no idea\" what the value of the family home should be above which it is included in the assets test for the age pension.\n\nWhen a value of $1.4 million dollars was suggested, he said that would be too low given the way the Sydney property market has gone \"berserk.\"\n\nHe said the main problem with the retirement system is not so much the extent to which the tax benefits of super go the better off, but the system is \"distorted\" against lower-income earners.\n\nMichael Rice of Rice Warner, which prepared the report on behalf of the Institute, said at the launch that the family home should be included.\n\nHe said there is no incentive for retirees to downsize their houses.\n\nThey know if they downsize, the money that is freed-up will be included in the assets test, he said.\n\nWhat do you think? Would this make the system fairer, or just rob people of something they've worked hard for? Have your say here.\n\n@jcollett_money The story first appeared on The Sydney Morning Herald.", "source": "Macleay Argus"}