{"published": "2015-09-21T17:00:10Z", "media-type": "News", "title": "Silver Fern Farms hits road to sell farmers on Chinese buy-in", "id": "dbd4be2b-dd54-4509-9436-e6b4e6a0f31a", "content": "Silver Fern Farms has embarked on a national roadshow to sell farmers on the idea of bringing in China's Shanghai Maling Aquarius as a 50 per cent shareholder in its newly formed joint venture and the feedback so far has been \"overwhelmingly positive\", says chief executive Dean Hamilton. \n\nIt had been \"standing room only\" at the first of the meetings held in the company's heartland provinces of Otago and Southland. \n\nHe said he was confident that farmers would be in favour of the proposal, which will be decided by way of a simple majority, on October 16. Hamilton said he was also confident that the bulk of the company's supply base would stay with the co-op. \n\nWhile the response so far had been positive, questions asked at the meetings reflected a measure of concern about how the partnership would work and the protections that would exist, should Shanghai Maling want to go beyond 50 per cent. \n\n\"I think we were able to allay those fears in terms of what exists in the shareholding agreement in terms of the inability to buy those shares in each other,\" he told the Herald. \n\n\"We can't buy shares in Shanghai Maling and they can't buy shares in the co-op.\" \n\nThe meetings spent time going over the beef and lamb model, which has struggled to provide processors and farmers with an adequate return for several years. \n\n\"Over the last 10 years we have lost money as many times as we have made money,\" Hamilton said. \"If you look at the profit 'pie' between the processor and the farmer, the pie is simply not big enough, so we can scrap around with it - they get a bit more of the pie one year and we can get more the next - but really it is the same small pie and one that is not creating a return for either of us.\" \n\nHamilton said farmers had come to the conclusion that the industry could not carry on the way it had been. \n\nSilver Fern has embarked on a \"plate to pasture\" value-added model in an attempt to move away from a purely commodities-driven business - the result which can be seen on New Zealand supermarket shelves. \n\nNow it wants to roll out its value-added model on the international stage, which is going to require additional capital. \n\nChina is Silver Fern Farm's biggest customer by volume but ranks second, with 15 per cent, after the United States in terms of value. \n\nOn intellectual property, Hamilton said the IP of the business would be contained within the partnership. \n\nHamilton said quality food imported into China generally commanded a premium and Shanghai Maling wanted access to that end of the market. \n\nDebt has been a big issue for Silver Fern over the past 10 years. It swelled to around $350 to $400 million after the 2006 takeover of Hawkes Bay's Richmond Meats. It then shrank back to around $115 million before ballooning out to $380 million in 2013 when the bottom fell out of the sheepmeat market. \n\n\"We have been in a cycle of lurching from crisis to crisis because ultimately, when you carry lot of debt, it only needs a change in the weather for it to get worse.\" \n\nHamilton said the infusion of $261 million from the deal would put the company in the best financial position since its inception in 1948. \n\nSilver Fern Farms made inroads into its debt mountain last year, knocking off $100 million, and made further progress in the current financial year, which ends this month, but its bankers had clearly lost patience with the company. \n\n\"We were under clear riding instructions from the banks to continue to get that [debt] down. We have achieved that but we are still not where we wanted to be,\" Hamilton said. \n\nThis financial year, which ends this month, Silver Fern expects its earnings before interest, tax, depreciation and amortisation to come in at around $75 to $85 million and to report a net profit before tax of about $20 million to $25 million, up from $2 million last year. \n\nHamilton said he understood some farmers would opt to supply other meat companies, such as neighbouring Alliance Group. \n\n\"At the end of the day, the ultimate casting vote sits with the farmers,\" Hamilton said. \n\n\"They get to vote at the meeting and they get another vote in terms of what they do with their livestock,\" he said. \n\n\"There will be some who do not support the transaction ... equally, there will be those who have not supplied Silver Fern Farms because of its lack of financial stability - that will disappear as we become financially the strongest red meat company in New Zealand.\" \n\nHamilton was not anticipating a large change in the supply base. \n\nThe transaction values Silver Fern Farms' equity at $311 million. \n\n- NZ Herald", "source": "New Zealand Herald"}