{"published": "2015-09-10T03:51:06Z", "media-type": "News", "title": "GMA: First Amendment is Unsurmountable Hurdle to GMO Labeling Law", "id": "efc82e26-c217-4070-9b89-0eb19d13ac44", "content": "Food trade groups this week including the Grocery Manufacturers Association reiterated their position that Vermont’s law requiring labels on genetically engineered (GE) foods is forced speech that violates the First Amendment to the U.S. Constitution. \nVermont cannot show that it had a “substantial interest\" in passing Act 120, and the legislature’s opinion that GE foods pose “potential risks\" to agriculture, the environment, health and safety is “not remotely enough to satisfy the First Amendment, under any applicant standard,\" according to papers filed on Sept. 8 with the U.S. Court of Appeals for the Second Circuit. \n\nIn an earlier legal filing, the office of Vermont Attorney William Sorrell—the agency responsible for defending Act 120—depicted the plaintiffs’ view as demeaning “Vermont’s well-supported concerns as a sop to idle curiosity, worthy of no greater intellectual respect than alchemy or the Flat Earth Society.\" \n\nVermont’s law requires labels on GE foods by July 2016 and bans use of the word “natural\" and similar words that promote GE foods. Although Connecticut and Maine have passed GE labeling laws, they don’t take effect unless neighboring states adopt comparable measures. \n\nIn a lawsuit filed last year, the Grocery Manufacturers Association (GMA), Snack Food Association, International Dairy Foods Association and National Association of Manufacturers moved to overturn Act 120. \n\nA federal judge, Christina Reiss, has denied the trade groups’ petition for a preliminary injunction, provoking an appeal with the Second Circuit. The appeal briefs have been filed, and the court will next set a hearing for oral arguments, said Roger Lowe, a spokesman with GMA. \n\nReiss leaned in favor of a ruling that the GE labeling disclosure holds up under the First Amendment, but she indicated in her April 2015 ruling that the “natural\" ban was unconstitutional. Federal regulators have not defined the term, and GE foods that are marketed as “natural\" have been subject to a number of putative class-action lawsuits in recent years. \n\n“The state’s speech ban,\" the food groups’ 31-page reply brief declared, “impermissibly attempts to make uniform its arbitrary view of what should be considered ‘natural.’\" \n\nWhether Act 120’s GE disclosure survives may boil down to the judiciary’s interpretation of whether Vermont’s requirement is “purely factual and uncontroversial.\" The language comes from a 1985 decision in which the U.S. Supreme Court found that a disclosure requirement governing lawyer advertisements in Ohio did not violate the First Amendment’s commercial speech protections. \n\nAccording to the food groups’ brief, Act 120 fails to meet the “purely factual and uncontroversial\" prongs that the Supreme Court pronounced in Zauderer v. Office of Disciplinary Counsel. “The question of what it means (or does not mean) for a food to contain GE ingredients remains a subject of volatile public debate,\" the brief declared. \n\nThe state attorney general’s office previously countered in an Aug. 24 brief that “the compelled speech must itself be controversial.\" \n\n“There is nothing remotely controversial,\" Sorrell’s legal team wrote in the brief, “about the purely factual statement ‘produced with genetic engineering.’\" \n\nThe food groups have argued Act 120 resembles a 1996 decision known as Int’l Dairy Foods Ass’n v. Amestoy. In that case, the Second Circuit examined a Vermont law that required labels for milk that was produced from cows treated with a growth hormone known as recombinant Bovine Growth Hormone or rGBH. The Second Circuit found Vermont’s stated interests—“strong consumer interest and the public’s right to know\"—were inadequate to justify the labeling requirement. \n\nSorrell has referenced other cases in which the courts have refused to subject commercial disclosures to so-called intermediate scrutiny under a Supreme Court test that the food groups claimed applies, rendering Act 120 unconstitutional. \n\nFor instance, in National Electrical Manufacturers (NEMA) v. Sorrell, the Second Circuit vacated a preliminary injunction against a law that required labels on certain products containing mercury. Like the labels in NEMA and two other cases, “the labels required by Act 120 disclose only factual and accurate information,\" Sorrell’s office wrote in court papers. \n\nPlaintiffs, however, told the Second Circuit that the mercury law hardly resembles Act 120. \n\n“Vermont took the (uncontroversial) position that mercury pollution was harmful, and that the required labels advanced its ‘goal of reducing mercury contamination,’\" the food groups wrote in their recent brief. “The well-considered, scientifically supported, properly tailored mercury labeling law in NEMA is a far cry from Act 12", "source": "Global FoodMate"}