{"published": "2015-09-28T13:00:48Z", "media-type": "News", "title": "Greystone Closes $86 Million in CMBS Loans for Retail, Mixed-Use Properties in Georgia and Colorado", "id": "192f6c63-7baa-4aed-bd89-905569fc0a3a", "content": "NEW YORK, Sept. 28, 2015 (GLOBE NEWSWIRE) -- Greystone , a real estate lending, investment and advisory firm, today announced it has provided $86,000,000 for two CMBS loans on properties in Atlanta, GA and Avon, CO. \n\nThe first loan, in the amount of $50,000,000 and originated by Robert Russell of Greystone, is for the acquisition of a two-property multifamily portfolio on behalf of a Midwest-based borrower. Comprising 588 total units, the multifamily properties, Rosemont City View and Dawson Forest, are located in suburban Atlanta. The 10-year CMBS loan includes a 30-year amortization. \n   \n\"The fundamentals in Atlanta and its suburbs continue to improve,\" said Russell, who serves as Head of Production for Greystone's CMBS team. \"Despite the recent volatility in the CMBS market, Greystone provided certainty of close and attractive terms to the client.\" \n\nThe second loan was in the amount of $36,000,000 and originated by Ted Nasca of Greystone for an upscale mixed-use project in the resort community of Avon, CO, located at the base of Beaver Creek ski resort. The loan features a 10-year term and is interest-only for the first three years with a 30-year amortization. The property includes nearly 200,000 square feet of office / retail space, and proceeds refinanced two adjoining properties, Chapel Square and Benchmark Shopping Center, that were cross-collateralized as part of the fixed-rate structure. The property is currently 99.7% leased with 44 tenants. \n\nGreystone provides real estate finance solutions across multiple asset classes and lending platforms, including FHA, Fannie Mae, Freddie Mac, USDA, CMBS, bridge, mezzanine and other proprietary loan programs. \n\nAbout Greystone \n\nGreystone is a financial services and private investment group whose original core business is multifamily real estate lending. Over the years, Greystone has added business lines that are related to, and natural extensions of, its core business including acquisition, development, and management of multifamily housing properties across the country. Headquartered in New York with offices across the U.S., Greystone is active in three major business segments: Mortgage Finance, Healthcare and Real Estate. Greystone's mission is to apply unparalleled creativity while modeling corporate compassion. Loans are offered through Greystone Servicing Corporation, Inc., Greystone Funding Corporation and/or other Greystone affiliates. For more information about Greystone's financing solutions please visit http://www.greyco.com . \nCONTACT: PRESS CONTACT:\n         Karen Marotta\n         Director of Communications, Greystone\n         212-896-9149\n         KMarotta@Greyco.com", "source": "Financial Content"}