{"published": "2015-09-16T17:15:09Z", "media-type": "News", "title": "TimeTravel is Real ?!? The Unexplained Disappearance of Ettore Majorana, (and his mysterious reappearance 20 years later) (Video)", "id": "b38d6a3c-d94f-4827-9200-1d0f3e906d14", "content": "4 \n  \nTime Travel? \n  \nScientist, Ettore Majorana was born in Italy in 1906. He famously went missing, presumed dead on 27 March 1938, aged 32. \n \nIt was claimed he disappeared, or vanished, suddenly under very mysterious circumstances while going by ship from Palermo to Naples. \n \nAlmost 20 years later he was photographed in Aregentina, still looking the same age as he was in 1938. \n  \nDid he travel 18 years into the future? \n  \nWhilst rumours of his death circulated, nothing was ever proved, until 2011. \n \nOn March, 2011, The Rome Attorney’s office announced an inquiry into a strange statement made by a witness about a meeting with Majorana in Buenos Aires in the years after World War II, in which he claims Majorana disclosed a number of a major scientific discoveries. The witness also claimed that when he went back to meet Majorana a second time, he had disappeared, and could therefore not provide more details on the scientific discoveries. \n \nOn June 7, 2011, Italian media reported that the Carabinieri’s RIS had analyzed a photograph of a man taken in Argentina in 1955, finding ten points of similarity with Majorana’s face. They stated the picture was almost certainly Majorana, – whom has vanished almost 20 years before the picture was taken. \n \nThe odd thing was, Majorana looked almost the same age in the pictures from 1938 as he did in 1955. The Carabinieri made no comments about his lack of ageing. \n  \nThe Time Traveller and The Witness \n  \nEttore Majorana was a brilliant scientist, engineer and mathematician, as well as a theoretical physicist (who worked on neutrino masses). The Majorana equation and Majorana fermions are named after him. \n \nIn 1937, Majorana predicted that a stable particle could exist in nature that was both matter and antimatter. In our everyday experience, there is matter (which is abundant in our known universe) and antimatter (which is very rare). Should matter and antimatter meet, they both annihilate, disappearing in a flash of energy. \n \nDid he try some strange experiment that had him disappearing in a flash of energy, only to reappear, instantly in a flash, 20 years later? \n  \nThe ship he vanished from \n  \nRumors have been swirling around about his disappearance since the very moment he failed to step off the boat that he was spotted boarding in March 1938. \n \nHowever, even this single concrete detail in the case, (that Majorana stepped onto a boat) is in dispute. Some believe he deliberately placed a decoy on the boat. Others think the boat trip was simply a fabrication of those he left behind, who knew of his true fate, but wanted some evidence of his disappearance. \n Nobel Prize Winner, Fermi, when discussing Majorana’s disappearance, famously said, “Ettore was too intelligent. If he has decided to disappear, no-one will be able to find him. Not in this time, or another”  \nIt looks like he may have been right. Was Majorana the first time traveller? \n \nVideo clip:  \n \n[embedded content] \n \nSource: http://coolinterestingstuff.com/", "source": "Before Its News"}