{"published": "2015-09-16T20:13:58Z", "media-type": "News", "title": "Herman Miller (MLHR) Announces Quarterly Earnings Results, Beats Expectations By $0.09 EPS", "id": "8969602d-ea6d-4531-87ca-0295440cef65", "content": "Herman Miller (MLHR) announced its quarterly earnings results on Wednesday, Sep-16-2015. The company reported $0.56 Earnings Per Share for the quarter, beating the analyst consensus estimate by $0.09. Analyst had a consensus of $0.47 EPS. The company had revenue of $565.40 million for the quarter, compared to analysts expectations of $554.35 million.The company’s revenue was up 10.9% compared to the same quarter last year. During the same quarter in the previous year,  Herman Miller posted $0.47 EPS. \n \nThe company shares have dropped 10.93% in the past 52 Weeks. On November 11, 2014 The shares registered one year high of $32.35 and one year low was seen on September 1, 2015 at $26.27. The 50-day moving average is $27.81 and the 200 day moving average is recorded at $28.4. S&P 500 has rallied 1.23% during the last 52-weeks.  Herman Miller, Inc. (NASDAQ:MLHR) shares are expected to touch $33.5 in the short term. This short term price target has been shared by 2 analysts. However, the standard deviation of short term price estimate has been valued at 0.71. The target price could hit $34 on the higher end and $33 on the lower end. \n \nHerman Miller, Inc. (NASDAQ:MLHR) witnessed a decline in the market cap on Monday as its shares dropped 0.44% or 0.12 points. After the session commenced at $27.22, the stock reached the higher end at $27.25 while it hit a low of $26.79. With the volume soaring to 251,545 shares, the last trade was called at $26.94. The company has a 52-week high of $32.35. The company has a market cap of $1,612 million and there are 59,841,000 shares in outstanding. The 52-week low of the share price is $26.27. \n   \r  \nOn a different note, The Company has disclosed insider buying and selling activities to the Securities Exchange,The officer (CEO) of Miller Herman Inc, Walker Brian C sold 9,557 shares at $28.08 on January 16, 2015. The Insider selling transaction had a total value worth of $268,361. The Insider information was disclosed with the Securities and Exchange Commission in a Form 4 filing.  Currently the company Insiders own 0.7% of Herman Miller Inc. Company shares.  In the past six months, there is a change of -6.98% in the total insider ownership.  Institutional Investors own 83.2% of Company shares.  During last 3 month period, 0.55% of total institutional ownership has changed in the company shares. \n \nHerman Miller, Inc. researches, designs, manufactures, and distributes interior furnishings, for use in various environments including office, healthcare, educational, and residential settings, and provides related services. It operates in three segments: North American Furniture Solutions, which includes the operations associated with the design, manufacture, and sale of furniture products for work-related settings, including office, education, and healthcare environments, throughout the United States and Canada; ELA Furniture Solutions includes the operations associated with the design, manufacture, and sale of furniture products, primarily for work-related settings, in these aforementioned geographic regions, and Specialty and Consumer, which includes the operations associated with the design, manufacture, and sale of high-end furniture products including Geiger wood products, Herman Miller Collection products and its North American consumer retail business. \n \r\n\t\t\r\n\r \nMLHR", "source": "MoneyFlowIndex.org"}