{"published": "2015-09-30T11:18:13Z", "media-type": "News", "title": "Bellerophon Announces Functional Respiratory Imaging Data From Company Sponsored Clinical Trial Of INOpulse(R) In COPD Patients With Pulmonary Hypertension Presented Today At The European Respiratory Society (ERS) International Congress", "id": "38584467-1227-4ad7-8349-57763cbdacf8", "content": "HAMPTON, N.J., Sept. 30, 2015 (GLOBE NEWSWIRE) -- Bellerophon Therapeutics, Inc. (Nasdaq:BLPH), a clinical-stage biotherapeutics company, announced that an oral presentation of late-breaking data from a clinical trial sponsored by the Company was presented today at the European Respiratory Society (ERS) International Congress 2015 in Amsterdam. The data showed that INOpulse  ® , an inhaled treatment of nitric oxide entering phase 3 testing for the treatment of pulmonary arterial hypertension, improved vasodilation in patients with pulmonary hypertension associated with chronic obstructive pulmonary disease (COPD). The abstract titled \"Pulmonary vascular effects after pulsed inhaled NO evaluated by functional respiratory imaging (FRI)\" was presented by W. De Backer, M.D., Director Department of Pulmonary Medicine, University Hospital and University of Antwerp. The presentation was in the session: \"Pulmonary hypertension: new treatment insights\" chaired by Professor Marc Humbert and Professor H. Areschir Ghofrani. The abstract presentation may be viewed at www.bellerophon.com , under the Investors Tab. \nIn the trial, 6 subjects (3 male and 3 female between the ages of 65-79) with pulmonary hypertension associated with COPD on long-term oxygen therapy were given an acute dose of INOpulse inhaled nitric oxide. Following treatment, the subjects underwent functional respiratory imaging to determine the geometry of their lungs, airway and pulmonary vascular structures. \n   In all of the subjects, administration of inhaled nitric oxide resulted in increased blood volume in the blood vessels in the lungs while also preserving oxygen saturation following treatment. Anecdotally, all patients in the trial reported having felt better following the treatment. \nJonathan Peacock, Chairman and Chief Executive Officer of Bellerophon Therapeutics, stated, \"We continue to be encouraged by the progress we are making in the development of INOpulse as a potential treatment for pulmonary hypertension. This late-breaker session at the ERS Congress builds on earlier studies indicating that INOpulse has the potential to reduce pulmonary hypertension in COPD patients. In the next several months, we plan to test the effect of reducing pulmonary hypertension on exercise capacity for these patients.\"", "source": "TheStreet.com"}