{"published": "2015-09-15T11:15:58Z", "media-type": "Blog", "title": "Ipswich Town line up v Leeds – Back to winning ways for the Tractor Boys?", "id": "a9e30940-d105-4faa-8b6b-e784137daab4", "content": "By marshie | 15th Sep 2015 Ipswich Town will be looking to get back to winning ways in the Championship as they travel to Leeds United on Tuesday evening. Ipswich LINE-UP\nv LEEDS - ELLAND ROAD, 15 Sep 2015, 19:45 PLAYER% MINS PLDGLSAST.Gerken\n63%000 / 0Smith\n88%100 / 0Chambers\n89%011 / 0Berra\n63%000 / 0Knudsen\n75%002 / 0Skuse\n72%001 / 0Fraser\n71%313 / 0Douglas\n76%001 / 0Murphy\n35%000 / 0Pitman\n65%221 / 0McGoldrick\n64%340 / 0Totals989 / 0LINE-UP AVERAGES\n28Y 3M\n6FT 0IN\n11ST 13LBLINE-UP COMBINED RECORDLAST MATCH - 11 Sep 2015\nReading\n5 - 1\nIpswich\nSa 7 '1 - 01 - 1\nSears '11\nSa 14 '2 - 1\nBlackman 49 '3 - 1\nSa 63 '4 - 1\nNorwood 87 '5 - 1ALL MATCHES\n5\nGF\n6\nGA\nTOTAL CHAMPIONSHIP EXPERIENCE\n2248GAMES\n229GOALS\n114ASSISTS\nAfter an unbeaten start to the season, the Tractor Boys have now lost their last two games but lead the wins in this league fixture, doing so on 10 occasions and beat the Whites 4-1 last season. To see the Leeds v Ipswich fixture history for every season since 1992/93, just click the image above to see the full in-depth results. Mick McCarthy could be without Freddie Sears after he tweaked his hamstring but will be assessed before the game, while Darryl Murphy could be back in the XI. There could well be more changes as Ipswich look to get their season back on track with a number of players able to come into the line up. Our chosen XI have a fair amount of Championship experience, collectively appearing in nearly 2,250 games as well as scoring 229 goals with 114 assists. Indeed, Sears has been in great scoring form so far this season, netting four times including goals in the last two against Brighton and Reading. While Murphy is still waiting for his first goal this term, he was fantastic for Ipswich last season as they made the play off semi finals, scoring 27 league goals and starting in 43 of the 46 games. David McGoldrick and Brett Pittman have also got on the scoresheet already this season along with Ryan Fraser with any of these players able to do so again on Tuesday. WHAT'S NEXT? Our unique predictive algorithm has this as a tightly run game with a home win just edging it at 45% while an away win is a 30% possibility. Leeds have drawn five of their six Championship games this season and there's a 25% possibility of this happening again this weekend. The team form, top predictions and odds for every Championship game this week are all available in our Acca Smacker below. By clicking on any of the percentages in the box, you can see how much you will win from a £10 bet with your favourite bookmaker available by clicking on their logo. For recent 20 game form and fixture history, click on the blue arrow on the left to to see all the indepth stats right away. Championship WIN/DRAW/WIN TOP PREDICTION\tWIN/DRAW/WIN\tBOTH TEAMS TO SCOREBTTS OVER/UNDER 2.5 GOALSOVER/UNDER 2.5 BOTH TEAMS TO SCORE & RESULTBTTS & RESULT TEAM TO SCORE FIRSTTEAM TO SCORE FIRST", "source": "KickOff"}