{"published": "2015-09-01T21:03:00Z", "media-type": "News", "title": "Transfer window: Club rifts, failed moves, record spend", "id": "315e341d-4319-47e4-ac01-32172200c281", "content": "LONDON -- A record $1.3 billion was spent by English Premier League clubs in the summer transfer window. \n \nBut the most intriguing moments at the end of the frenzied trading period centered on the deals that never went through and the public quarrels between clubs. \n \nThis season - or until the January transfer window at least - some potentially unhappy players will be in teams they hoped to be leaving behind. \n \nNone more so perhaps than Spain goalkeeper David de Gea. \n \n____ \n \nSTOPPER STAYS \n \nManchester United knew for months that Real Madrid wanted to sign De Gea, but the Spanish giants ran out of time to get the deal done. \n \nThe collapse of the transfer late Monday, when Spain's transfer window closed, sparked a day of public quarreling between two of football's wealthiest clubs over who was at fault. \n \nUnited, a reluctant seller while trying to re-establish itself at the pinnacle of football, said it submitted the correct paperwork in time - two minutes before the 2200 GMT cutoff - to grant De Gea his dream move back home. \n \nThe 20-time English champions, who were landing Madrid goalkeeper Keylor Navas as part of the deal, blamed Madrid for stalling the move by making \"major changes to the documentation.\" \n \nIn its statement, Madrid complained that United \"did not open any channel of negotiation\" until Monday morning. The reason, according to United, was that Madrid did not actually submit a bid until then, despite the goalkeeper being a clear transfer target for months. \n \nUnited had no reason to sell the player, despite his contract expiring at the end of the season. A sale would have given the impression of United appearing weak under the weight of mighty Madrid's pressure. \n \nNow Old Trafford can unexpectedly welcome back its star player, who did not play in the opening six games of the season as the transfer saga trudged along without a conclusion. \n \nDe Gea is now one of the few surviving members of the squad left by Alex Ferguson when he retired as United manager in 2013. \n \nAs the summer overhaul continued, United failed to land a marquee attacking signing, instead making raw 19-year-old forward Anthony Martial the world's most expensive teenager on Tuesday in a deal worth than $55 million. \n \n\"He has all the attributes to become a top football player. However we need to give him time to adjust to his new environment and the rhythm of the Premier League,\" United manager Louis van Gaal said of his new signing. \n \n___ \n \nSTANDING FIRM \n \nMadrid and United ended their summer standoff by trying to conclude a deal. But in England, Everton would not even get round the table with Chelsea to consider selling defender John Stones and Tottenham was similarly rebuffed in its pursuit of West Bromwich Albion striker Saido Berahino. \n \nGiven England's television riches, topflight teams can no longer be pushed around by more illustrious rivals into selling their prized assets. The bottom place club earned around $100 million from the Premier League last season and that figure could soar by a third when the new television rights deal starts next year. \n \nWest Brom rejected a third and fourth bid from Tottenham on Tuesday's deadline-day, with West Brom chairman Jeremy Peace saying that Spurs had undervalued Berahino and bemoaning how the club now faces a task \"repairing the damage created by this unfortunate episode.\" \n \nThat statement came just after a furious Berahino wrote on Twitter: \"Sad how i cant say exactly how the club has treated me but i can officially say i will never play Jeremy Peace.\" \n \nStones submitted a transfer request at Everton, but unlike Berahino has not complained in public about a move to champion Chelsea that never materialized. \n \nChelsea's failure to persuade Everton to sell Stones - even for $60 million - led to the London club reinforcing its leaky defense with Papy Djilobodji from Nantes. \n \n___ \n \nBIG SPENDERS \n \nThe most fraught transfer of the summer initially looked like being Manchester City's pursuit of Raheem Sterling, but a $76 million-deal was sealed with Liverpool in July. City still found time to break its transfer record by recruiting Kevin de Bruyne from Wolfsburg for $83 million. \n \nIn its bid to regain the title from Chelsea, the Abu-Dhabi-owned club lavished 160 million pounds ($245 million) in the summer, a record for a Premier League club, according to accountancy firm Deloitte. \n \nEngland's four Champions League participants - Manchester rivals United and City, Chelsea and Arsenal - spent around $520 million in the summer. But Arsenal only accounted for 3 percent of that with goalkeeper Petr Cech being the London club's solitary signing. \n \n__ \n \nMOST ACTIVE \n \nWest Ham completed the most deals in the Premier League on deadline day. There were two loan deals: midfielder Alex Song returning for a second season from Barcelona and winger Victor Moses crossing London from Chelsea. Striker Nikica Jelavic and winger Michail Antonio joined from second-tier clubs. \n \n___ \n \nCOUNTRY CONTRASTS \n \nDeloitte reported that Premier League clubs were Europe's biggest topflight spenders by doing 870 million pounds ($1.3 billion) of business - up 4 percent on the previous record - followed by Italy ($620 million), Spain ($612 million), Germany ($444 million) and France ($337 million). \n \n___ \n \nRob Harris can be followed at www.twitter.com/RobHarris and www.facebook.com/RobHarrisReports", "source": "Chicago Daily Herald"}