{"published": "2015-09-23T22:00:03Z", "media-type": "Blog", "title": "Shrimp and Grits", "id": "c8d301fe-badb-4292-a4fb-1fa64c3a7587", "content": "With a wife and two kids, all with different tastes, it can be a challenge for me to find a dish that will please the whole family. Sometimes, I luck out and stumble across a crowd-pleaser. I had read about the popularity of the southern favorite shrimp and grits, but had never tried it myself. Though I’m generally a big fan of shrimp, I had never even tried grits before (though we had an unopened box of Quaker 5-minute grits sitting in the pantry, purchased after my wife had some at work). After scouring the internet, it became apparent that there’s a huge range of recipes out there. Most of the grits recipes are quite rich, with butter, cheese, and/or heavy cream, usually in large quantities.  The shrimp is universally cooked with bacon. I turned to my old standby, Cook’s Illustrated, and found that the companion site Cook’s Country had an interesting recipe. While it made heavy use of butter and included a shirmp-stock based gravy, it was the only recipe I came across that lacked cheese. I’m not a huge fan of overly-rich dishes, but clearly some amount of cheese was de rigueur. Starting with the Cook’s Country version, I blended in elements from various other recipes online to hit the following goals: use the greater shrimp:grits ratio from the Cook’s Country version create a shrimp stock and gravy using the shrimp shells use bacon use milk in the grits for extra creaminess use cheese in the grits use enough butter and cheese to add richness without making the dish overly heavy Ingredients Grits 1 cup grits (I used Quaker 5-minute grits) 3 cups water 1 cup milk 2-4 ounces of grated cheddar cheese, to taste (I used 2.5 ounces – 70 g) Shrimp 1.5 pounds large shrimp with shells 1 tablespoon tomato paste 3 strips of bacon (or 2 if using thick-cut bacon), cut into 1/2 inch pieces 3 tablespoons butter 2 tablespoons flour 2 medium cloves of garlic, pressed or minced 1 tablespoon lemon juice Instructions Grits Cook the grits as instructed on the package, using milk/water combination instead of milk alone (I boiled the liquid, added grits, and simmered for 5-7 minutes until thickened. It helps to whisk grits after adding to prevent clumping. Add in cheese and keep warm Salt and pepper to taste Shrimp Peel and devein shrimp, reserving shells In an nonstick pan, melt one tablespoon butter of medium heat and add shells, cooking for about 7 minutes until shells are toasty and spotted Add tomato paste and cook for 30 seconds, stirring Add about 2.5 cups of water, bring to a boil, and simmer covered for another 5 minutes Strain shrimp shells and liquid, saving resulting stock and discarding shells Wipe down pan and add bacon pieces Cook until crispy, then add in garlic and shrimp Cook for a couple minutes until edges of shrimp have are no longer translucent, but shrimp are not cooked through Empty shrimp and bacon into a bowl and wipe out pan Melt another tablespoon of butter Add in flour, whisking into butter and cook for about a minute until fragrant Whisk in shrimp stock and continue whisking until clumps dissolve Cook for 5-10 minutes until thickened, then add in shirmp/bacon mixture and cook for a few more minutes until shrimp are cooked through Add lemon juice and salt/pepper to taste Serve the grits and ladle some shrimp and gravy on top and enjoy. I added some red pepper flakes and Tobasco for added flavor to my plate. These went great with some simply braised brussel sprouts, which cut the heaviness of the overall dish. Note the picture above is just the shrimp and gravy. It was so good, I forgot to take a picture of the combo until I was packing up the (few) leftovers. Related", "source": "infobhan"}