{"published": "2015-09-03T12:41:51Z", "media-type": "News", "title": "The CHANEL-CE.R.I.E.S. Research Award Honours Two Leading Scientists and Supports Pioneering Studies on Healthy Skin", "id": "e698c6bd-65e5-4032-803d-8f8a7867a86d", "content": "SOURCE CHANEL\n\nPARIS \n\nCHANEL Research and Technology announces the latest two winners of the CHANEL-CE.R.I.E.S. Research Award: Julia Segre Ph.D (USA \n\n(Photo: http://photos.prnewswire.com/prnh/20150721/238742 ) (Photo: http://photos.prnewswire.com/prnh/20150721/263306 )\n\nThis annual Award is intended to honour the accomplishments of a scientific researcher with a proven track record in fundamental or clinical research work and to encourage his or her continued research activity. The field of research concerns the physiology or biology of healthy skin and/or its reactions to environmental factors. \n\n\"Ever since we created the CHANEL-CE.R.I.E.S. Research Award in 1996, our aim has been to support ground-breaking skin research projects, aiming to enrich our understanding of the skin with new findings made available to all,\" comments Christian Mahe´, Senior Vice President, CHANEL Research & Technology. \"Our most recent laureates are proof of this aim and we are proud to support their trail-blazing work.\"\n\nResearch into healthy skin microbial communities to throw light on skin individuality \n\nJulia Segre Ph.D. holds the position of Senior Investigator at the National Human Genome Research Institute in Bethesda, MD \n\n\"Professor Segre's project will apply powerful DNA sequencing techniques to skin swabs obtained from healthy volunteers to characterize resident bacteria and other microbes at multiple dry, moist and sebum-rich body sites,\" explains Professor Barbara Gilchrest \n\n\"Indeed, my work has demonstrated that individuality refines and selects the strains of bacteria that reside on our bodies,\" comments Professor Segre. \"The research grant supported by the CHANEL-CE.R.I.E.S. Award will enable us to further explore this microbial individuality over time. I am honoured to be selected as the recipient of the Award which recognises excellence in skin research.\"\n\nProfessor Segre's project will pave the way for innovative cosmetic research targeting individual beauty and skin needs.\n\nInnovative stem cell research may lead to new ways of delaying signs of skin aging \n\nEmi Nishimura M.D \n\n\"Professor Nishimura's project will employ sophisticated genetic and imaging techniques to monitor the fate of so-called stem cells in skin and hair follicles and to determine their response to environmental stress and aging,\" explains Professor Gilchrest.\n\n\"The Award is not only a great honour for me, but also extremely encouraging,\" states Professor Nishimura. \"The path leading to new scientific discoveries is not always an easy one. The Award encourages me to continue, striving towards new ways of further deepening our universal understanding of the skin.\"\n\nApplied to the field of cosmetic science, Professor Nishimura's project may lead to new preventative measures to delay the classic signs of aging. CHANEL-CE.R.I.E.S. Research Award The CHANEL-CE.R.I.E.S. Research Award of 40,000€ is supported by CHANEL Research and Technology. Applications open in February each year on: http://research-technology.chanel.com/research-awards\n\nPrevious CHANEL-CE.R.I.E.S. Award Winners \n\n2013: Robert L. Modlin \n\n©2015 PR Newswire. All Rights Reserved.", "source": "WXTX Fox 54"}