{"published": "2015-09-01T00:09:52Z", "media-type": "Blog", "title": "Lord of Magna: Maiden Heaven Review", "id": "6d331559-3793-4031-bea5-d0a95a1093f7", "content": "Lord of Magna: Maiden Heaven (Available exclusively on 3DS)\nESRB Rating: T\nNumber of Players: 1\nGenre: Role Playing\nPublisher: XSeed\nDeveloper: Marvelous\nRelease Date: June 2nd, 2015 Hey everyone! My name is Cranberry; here with a guest review! Well, let’s get right to it! Parent Talk: The Entertainment Software Rating Board has rated this game T for Teen, citing the following: Fantasy Violence, Mild Language, Partial Nudity, & Suggestive Themes. While it’s not excessive, there is some blatant “fan-service” in this game that involves some up-skirt pictures and some unnecessarily skimpy outfits. They aren’t kidding about the suggestive dialogue either; it definitely gets pretty suggestive at times. Of particular note, there is an animated bathing scene that you probably would not want to get caught watching at work. The battles are not bloody or gory and are pretty tame, although some cut scenes imply some pretty harsh violence at times. The teen rating seems to be appropriate for this one; I wouldn’t recommend this one for young children. Plays Like:  This game plays like a cross between a turn based RPG, a strategy game, and a visual novel. The main emphasis of the game is definitely the plot and the interactions between the characters. It features a lot of cut scenes and dialogue reading, much of it voice acted. Combat plays a part as well, and is played out in a strategic turn-based system. You field a party of up to four characters, each with different attributes and attack ranges. Combat takes place on a large field where you can see all of the enemy units. Both you and the enemies take turns moving and attacking, however the field is not a grid. Each character has a circle that appears around them, showing their move range for that turn. You can move freely anywhere within this circle provided there isn’t anything to block your path. When you’re ready to attack, you’ll see a red space that designates the area you can hit. Lord of Magna also features an experience point leveling system as well as a crafting system, which adds some RPG elements into its strategy styled combat system. The Good:\nThe presentation  is quite beautiful. The graphics have a cartoonish feel to them, which is pretty normal for a 3DS game, but they get the job done wonderfully. The 3D effects are not mind blowing, but they supplement the setting well without feeling too “busy” or disorienting. The characters are likable and full of personality. The story is also pretty well written and engaging. You take the role of an inn keeper, whom you can choose a name for. He runs an inn on the outskirts of town, and is patiently awaiting the day when his inn at long last receives a guest. The guests soon arrive in the form of characters that will join your party; seven in all over the course of the game. There is a reason this game is called “Maiden Heaven”, every playable character except for the main character is female. But each girl has a distinct personality and it is quite enjoyable to watch their stories unfold and see their character development over the course of the tale. These cut scenes are sometimes supplemented by some lovely artwork too. + There are also “heart events” you can access, which are essentially quests that dwell deeper into an individual girl and reveal more about her. There are 21 such heart events, and it will take several play-throughs to see them all; which fleshes out the story further and gives the game some replay value too. The music is top-notch. The songs fit the context well and are pleasant to listen to. I received the original soundtrack with my purchase, and I frequently pop the CD in and listen to it. I really enjoy the music. I also enjoy the combat system in this game. Each character has different roles they can contribute in a battle, and you need to think about how they can complement one another on the battle field. Some characters hit for a wide area in front of them, others hit an area at a distance, some hit an enemy multiple times, and others specialize in support skills. There are a lot of possibilities even before the battle begins. Once in combat, the strategy-game like field system allows for a lot of tactics that just wouldn’t work in a traditional turn-based RPG. You gain an action point each turn, and you spend this action point to perform your chosen action. There’s also an interesting “bowling” mechanic in battle, where enemies you hit can knock down and take out other enemies. If you manage to take down ten or more enemies with one attack, you get a free turn. It’s quite an interesting and creative mechanic. If you choose not to take an action, you’ll keep your action point and when your next turn comes, you’ll have two action points. This allows you to save up points for special skills. This makes combat more complex and engaging than simple “hurt and heal”. You need to carefully consider how best to place your characters, and what action is best for the situation at hand. Do you send one character ahead as a decoy to try and form an opening for the rest of your party to slip through? Do you try and surround the enemy to limit their attack options? Do you fall back and regroup? All of these and more are decisions you’ll be making in battle, which makes for a very engaging battle system. There’s also an elemental “Rock, Paper, Scissors” style vulnerabilities system that is similar to the typing system used in Pokémon. This further adds to the strategic combat decisions you make in battle. An enjoyable story and an engaging well-designed battle system make for quite a good presentation. The So-So:\n+/- The story is both it’s strength and it’s weakness. While the story is engaging, it’s also very drawn out and you’re frequently watching long scenes in which you do nothing but hit the A button to advance through pages upon pages of text. This can be pretty frustrating if you are itching to get to the action, or if you don’t particularly care about the conversation the characters are having at the time. This is especially noticeable at the very start of the game where you read a huge amount of dialogue before you even gain access to your character. While there is a fast-forward feature, it doesn’t actually skip the cut scenes, but rather speeds through them much more quickly. Doing this does help speed things up, but there’s no “rewind” feature so if you accidentally skip ahead too far, you can’t go back to read what you missed. The massive amounts of dialogue and the frequent lengthy cut-scenes often make this feel more like reading a book than playing a game; which can be a big put-off for a lot of people. Simply put, playing this game is going to involve reading a LOT of text. +/- There is a crafting system, and while it adds some interesting customization options by allowing you to create skills for the characters, there’s little else you can make other than skills. There is also very little in-game clues as to what you can craft. You can at least see what the item your chosen ingredients will create before you make it, but there are no recipe books or listings of what can be made. No clues or hints from other characters as to what you should make. Unless you look up a guide online, it’s entirely trial and error based. The game really needs a recipe list. +/- Sadly there’s equipment to put on your characters. No new weapons, no new armor, no special accessories. Just skills, although some of the skills are passive skills that give you stat bonuses or special attributes, which is similar to what accessory-like items do in many other RPGs. But it still feels like a real missed opportunity to not include equip-able items in the game. +/- There are a number of free missions, which allow you to field a team into battle in a variety of settings that you’ll unlock as you go through the story. These missions have some interesting flavor text, but that’s all it ends up being. It’s nothing but a battle against enemies that serves as a grinding or item farming opportunity. The good thing is that these free battles allow you to immediately enter a battle without having to wade through a mountain of text, but it’s disappointing for the missions to be given such interesting descriptions only to have nothing special happen in any of them. The Bad: – As was already mentioned, the lengthy cut scenes can be pretty jarring, which depending on your tastes can be a real negative. But perhaps the biggest negative is the complete lack of exploration this game allows. Except for a camp-site that you get to very briefly walk around in, the Inn is the only area you get to explore. Every other area, the only interaction you get with the environment is through battle. No exploring the territory, no searching for treasure, no searching for hidden secrets, no chatting with NPCs in town. There is a town in this game, and your visits to it are entirely scripted. For an RPG title, this is a glaring flaw. Nothing is more frustrating than setting foot on these beautiful maps, and not being able to explore them. 99% of the battles mandate that you have the main character in them, even in free battles. This unnecessarily restricts your party selection, and can be frustrating when you start getting more characters available and want to experiment with a variety of character combinations. In a game that is already quite linear with no exploration, the last thing you want is even more limitations. The Lowdown:\nThis is almost a love it or hate it game. The story is an engaging tale full of mystery, drama, and suspense. There’s a fair amount of customization you can do with the character’s skills, and the combat system is magnificent but, the frequent extremely lengthy cut scenes, the lack of exploration, and the lack of equip-able items are pretty significant flaws that are quite noticeable and glaring during play. If you’re looking for an engaging tale full of lovable characters, I recommend this game wholeheartedly. But if you’re looking for action and adventure, or your traditional RPG experience, this game won’t satisfy you. That’s why my final rating for this game is a 7/10. Related", "source": "Project COE"}