{"published": "2015-09-07T07:40:53Z", "media-type": "News", "title": "Slimbridge held to home draw by Didcot Town", "id": "31c50fc5-ceed-426b-98de-9c3583c42c99", "content": "Slimbridge 0 Didcot Town 0​ \n        \nSlimbridge 0 Didcot Town 0 \n\nAfter a week of FA Cup heroics, the Swans played out a largely uneventful draw with a Didcot side who seemed to have settled for a point long before the final whistle. \n\nThe best chances of the game went to the home side, and possibly on another day they would have nicked the three points, but it was not to be. \n\n\nAs the game settled down, it became clear that chances would be at a premium, as both sides largely cancelled each other out - it took 12 minutes for the first shot on goal, Adam Thomas pushing away a strike from the visitors' Matthew Woodley. \n \nAfter another half hour of goalmouth inactivity, Slimbridge had the better opportunities as the game neared the interval - after a Rich Thwaite header from Adam Mace's cross was wide, Mace went close with a long range effort on 41 minutes, and then Jamie Hammond brought a great save from Diddy Keeper Leigh Bedwell after a nice break, but the sides went into the interval level. \n\nTen minutes into the second half, Paul Fahy chased a through ball and forced another good stop from Bedwell, while Diddy were restricted to rare opportunities - Mark Janes going closest with a shot that went wide on 70 minutes. \n\nThe hosts had chances to claim the points in the final tem minutes, but Jack Twyman's high shot, followed by two Jamie Martin headers which were too high meant that this was a game that would not live long in the memory, but another was another point gained for the Swans as they continue their adjustment to life in the Southern League. \n\nSlimbridge make the long trip to Dartford to play Greenwich Borough next Sunday (3pm) in an FA Cup 1st Qualifying Round tie - the first time they have got this far in the competition for 9 years. The Coach leaves Wisloe Road at 9.30am. \n\nRing Colin Gay on 07702 070229 to book one of the few remaining places. Cost is £10. \n\nSlimbridge: Thomas, Turl, Mace, Hoyle, Rich Thwaite, Ry Thwaite, Turner, Twyman, Hammond (Lawson 53), Blackie (Ward 74), Fahy (Martin 60) \n\nSupporters Man of the Match: Alex Hoyle.", "source": "Gloucester Citizen"}