{"published": "2015-09-23T14:41:43Z", "media-type": "Blog", "title": "Dr. Who to Host Hot & Classic Showbiz Review on Hot fm", "id": "37f26c66-8934-465c-843b-303eeacfa3f1", "content": "Accra based popular radio station, Hot 93.9Fm, upon it's desire to serve it's loyal listeners with a bonafide entertainment show, is coming up with 'Hot & Classic Showbiz Review'. The show is due to commence on Saturday 3rd October and shall be hosted by astute radio presenter, Anderson Ebenezer, well- known as Dr Who ,who has been in the media close to 20yrs.\nLamenting about the show to Reagan Mends of seancitygh.com ,Dr Who explained the amiability nature of the show and why listeners must endeavor to listen to it.\n\" The name of the show is 'HOT & CLASSIC SHOWBIZ REVIEW', which is going to start on the 3rd of October this year .It's not just going to be entertaining but honestly going to be the most challenging show in my 20yrs deferential career\", Dr Who lamented to Reagan Mends\n\"My team of able producers & I, chose the name Hot & Classic because, discussions & our creative segments wouldn't be just hot but with a class .We also chose Showbiz as compared to other stations because we shall be dwelling on all aspects of the entertainment cycle .Another important thing is to scrutinize my explicit panelists to abide with radio ethics since we shall not only be entertaining but educating as well\", Dr Who further lamented.\nDr, finally stated that other companies and individuals who may aspire to advertise their respective products on the show shall be duly welcomed.\nLong before radio got full swing in kumasi,Dr Who was playing with his fingers as local Dj in night clubs.\nHe began his radio career at K'poly campus radio;radio link .He has worked with popular radio stations within Accra and in Kumasi.\nCurrently,he is the programs manager of the station (Hot fm)and host of African express show between 11am-2pm and as the host to yet to begin Hot and classic showbiz review each saturday between 5-7pm.\rComments:\nThis article has 0 comment, leave your comment.", "source": "ModernGhana News"}