{"published": "2015-09-28T12:25:35Z", "media-type": "News", "title": "Josh McCown 'understands' Johnny Manziel chants, but does Mike Pettine? (Yahoo Sports)", "id": "0f2f4379-8d05-4665-8f5e-6f08d387ec0b", "content": "Mike Pettine started Josh McCown at quarterback because the Cleveland Browns coach thought the 36-year-old veteran gave his team the best chance to win. The Browns did not win. They lost. Bad. To the Oakland Raiders. At home. So, one could understand the \"Johnny\" chants echoing through Cleveland.   Johnny, in this instance, is not Jack Nicholson's character in \"The Shining,\" although Sunday's 27-20 loss was somewhat of a horror show. He's a second-year quarterback by the name of Johnny Manziel. Maybe you've heard of him. He led the Browns to their only win of the season in his Week 2 start.   McCown has apparently heard of this Manziel fella, too,  explaining as much to USA Today's Nancy Armour.     “There were Johnny chants?” McCown asked facetiously after the 27-20 loss to the Oakland Raiders. “Like I said Wednesday, I understand the situation I’m in and it’s part of it. He’s an exciting young player that I know people want to see play. I understand that.       “For me, I have to focus on where we are. We had our own problems and own issues just trying to move the ball.”     In all seriousness, though, if the Browns are going to be the same old Browns — the franchise that hasn't sniffed a championship since the 1960s — why not start the kid they spent a first-round pick on in 2014?   Granted, McCown threw for 349 yards and a pair of touchdowns in defeat, but 237 of those yards and both scores came when the Browns were already facing deficits of 20-3 and 27-10 late in the second half. And while Cleveland's defense forced a second straight three-and-out to get the Browns the ball back with a chance to tie the game in the final 2:26, McCown threw a pick that sealed their fate in the final minute.   For the record, Pettine never considered turning to Manziel on Sunday, telling Armour, \"You can't put a player in a situation where he feels like he's playing with a short leash. Then it just becomes self-fulfilling.\"   There's some truth to that, so the decision should come Monday instead — ride with Manziel, for better or worse. At least one NFL player with knowledge of the two quarterbacks has made up his mind. Tampa Bay Buccaneers wide receiver Mike Evans, who played with McCown on the Bucs last season and Manziel in college, explained his reasoning to a Tampa radio station late last week, via JoeBucsFan.com.     “I think the world of Josh, but as far as a starting job goes now, Manziel just came off a win,” Evans said on the Buccaneers Radio Network this week. “You know, the city’s buzzing about him. Everybody’s buzzing about him, won at home. I don’t know, man. I think they probably should have gave him one more chance [to start]. I mean, he won.”     Sometimes the simplest explanation is the correct one. In this case, Johnny Football is Occam's razor.     - - - - - - -   Ben Rohrbach is a contributor for Ball Don't Lie and Shutdown Corner on Yahoo Sports. Have a tip? Email him at rohrbach_ben@yahoo.com or follow him on Twitter! Follow @brohrbach", "source": "Yahoo!Xtra"}