{"published": "2015-09-08T15:05:20Z", "media-type": "Blog", "title": "The Global Credit Supercycle: Full Frontal", "id": "98ce0542-817b-4cb0-b38c-d96426b4a6fb", "content": "Over the past several years, one of the prevailing, if completely incorrect, conventional wisdom memes was that the US, and especially the private sector, had undergone a deleveraging and was ready to load up on debt again. This was wrong because as we showed over the years, the only deleveraging which US households underwent was due to defaults and nothing to do with voluntary debt reduction. \n \n\n \nFurthermore, the compounding effect of soaring student loans – which at $1.1 trillion eclipse the total credit card debt of the US – is one of the reasons why the US labor participation rate is at 38 year lows: millennials are unwilling and unable to enter the labor force opting to rollover student loans instead (until said loans are forgiven), while aged workers, those 55 and over, thanks to ZIRP crushing the income-creating capacity of their savings, don’t have the resources to exit the labor force. \n \nAs for US banks whose “fortress” balance sheets have supposedly never been more solid due to the collapse in net leverage, here is a chart showing total US commercial bank cash balances when adding the $2.5 trillion in “transitory” Fed excess reserves, and what happens if one were to “pro-forma” the Fed’s monetary spigot out of bank balance sheets. \n \n\n \n  \n \nBottom line: aside from a brief blip just after the financial crisis, the US never actually deleverd. In fact, aside from Europe where since 2010 the peripheral nations have been stuck in a state of constant depression with nearly 50% youth unemployment and ~20% total unemployment, nobody has delevered anywhere! \n \nAll of this is quite clearly shown on the chart below, courtesy of RBS, which shows not only the global credit supercycle and the various catalysts (and “crises” which were certainly did not go to waste) that allowed total global debt to hit $200 trillion recently according to McKinsey (excluding the hundreds of trillions in gross derivative notionals of course), but the catalytic events that allowed this unprecedented supercycle to take place. \n \n\n \nThe chart above warrants the question: if an even modest slowdown in Europe’s pace of credit creation resulted in unprecedented economic and social upheavals for the “southern” part of the continent, what happens when deleveraging finally hits one of the other places around the globe, be it the BRICs in particular, the EMs in general, or – heaven forbid – the US itself.", "source": "silveristhenew » silveristhenew"}