{"published": "2015-09-27T22:55:13Z", "media-type": "Blog", "title": "Using ELF Eyebrow Lifter and Filler", "id": "7db94503-5bc3-4e34-abd8-b8dcdb495fd8", "content": "Is anyone else here sick of seeing blogs with the same cheesy overselling marketing content every single time? Because hey, they give free stuff in exchange of a post! Just like this one. I'm no hypocrite. But I'm sick of seeing my posts that way too. If you've noticed, I've been trying to change my blogging style. More genuine, less cheese(to no cheese, even in real life I don't eat cheese) I'm in no position to criticize other bloggers so the only person I can push is myself. So last month, ELF Philippines sent me over their Eyebrow Doctor box filled with different products from brow pencils, brow powders, primers, and brow stencils to try. Ang dami no? Thank you ELF Philippines. I like multi-purpose makeup so I decided to use and feature their Eyebrow Lifter and Filler.  It's a dual-tip eyepencil with built-in sharpener One side is for highlighting. It is in light beige color The other side is for shading and filling in. It is in taupe brown color. My bare brows. I had these shaped at Benefit Brow Bar. The pencil is hard, and just gives off the right amount of pigment to fill in the brows without looking fake. I prefer brow pencils that is hard. The Elf Eyebrow Lifter and Filler reminds me of Shu Uemura's hard pencils. These are my brows are filling them in, and highlighting the under brows. Looks natural no? And it's pretty cheap! They didn't indicate the price but ELF products like this costs less than 200 pesos and can be bought at any SM Beauty located in SM Department Stores. I have LOADS of eyebrow products in my stash so I doubt I'll be repurchasing this really soon but this pencil isn't too shabby at all. It's quite nice. I like it. :) ELF Philippines Website: http://www.eyeslipsface.ph/ I hope you enjoyed this post as much as I did writing it! Please leave some love by doing the following: Ask me anything on twitter using the hashtag: #askkikaysikat Follow me on Facebook: facebook.com/kikaysikat Follow me on Instagram: heyitsmekaycee Subscribe to my Youtube Channel: OtherTheKat Leave a comment below (anything! comments, questions, chika, opinion)", "source": "Reviews on Make-up, Skin-care,Fashion, Food,Skin Whitening,Fitness | KikaysiKat"}