{"published": "2015-09-08T14:19:31Z", "media-type": "News", "title": "AeroVironment Earnings Crash, Stock Burns", "id": "a0157fc9-381b-4183-8007-a6a80d7bbf71", "content": "AeroVironment's stock price chart over the past year looks like a series of steps -- all leading down. AVAV data by YCharts .\n\nShares of AeroVironment , the tiny company that makes even tinier unmanned aerial vehicles, shrank even more last week. The drone-maker reported a big loss in its fiscal first quarter of 2016, sending the shares down more than 10%.\n\nHow big was AeroVironment's loss? About twice as big as what Wall Street had been prepared to see. According to MarketWatch , analyst estimates for AV's Q1 2016 results predicted a $0.14-per-share loss. In fact, AV ended up losing $0.30 for the quarter. Here's a quick rundown of the quarter that was :\n\nAnd yet, the news may not be as horrible as it seems. If you read the above closely, you probably noticed that it was greater investment in R&D that really hurt profits in the quarter. And investing for the future, at the cost of short-term profits, isn't necessarily a bad thing. Also, while revenue declined in Q1, AeroVironment management noted that funded backlog has increased 37% over the last three months, and now stands at $89 million. That's nearly six months' worth of revenues that are now \"in the bag,\" and waiting to be fulfilled.\n\nWith this improved visibility into future revenue flows, management felt confident enough to reiterate its previous guidance for full-year revenues coming in between $260 million and $280 million, and for earning gross profit margins of 36%-37.5% on those revenues.\n\nSticking with that projection, despite what the Q1 shortfall suggests, AV's leaders expect things to bounce back later this year. On the other hand, management also reiterated its warning that \"increases in strategic R&D and SG&A investments for Commercial UAS in fiscal 2016 may largely offset operating profit in the current fiscal year.\"\n\nDanger ahead\n\nTranslation: AeroVironment earned no money in Q1 -- and will probably earn nothing the rest of this year, either. \"Breakeven\" profits may be the most optimistic scenario we can hope for. Considering that analysts surveyed on Yahoo! Finance are currently projecting a $0.11-per-share profit for the year, there's a real chance that AV will disappoint them again and again as the year progresses.\n\nThis would not be good news for the share price.\n\nSpeaking of which -- final point: According to S&P Capital IQ data, over the past year, AeroVironment has failed to earn even breakeven profits, losing $500,000 over the past 12 months instead. This gives the stock a mathematical P/E ratio of infinity. The company is free cash flow positive, of course. But the $6.2 million in cash profits AV has generated over the past year yield a price-to-free cash flow ratio of 78, which is obviously high for a company experiencing shrinking revenues.\n\nWith AV shares down 30% over the past 52 weeks already, the stock still looks like it has further to fall.\n\nThe next billion-dollar iSecret\n\nThe world's biggest tech company forgot to show you something at its recent event, but a few Wall Street analysts and the Fool didn't miss a beat: There's a small company that's powering their brand-new gadgets and the coming revolution in technology. And we think its stock price has nearly unlimited room to run for early in-the-know investors! To be one of them, just click here .\n\nThe article originally appeared on Fool.com.\n\nCopyright © 1995 - 2015 The Motley Fool, LLC. All rights reserved. The Motley Fool has a disclosure policy .", "source": "Nasdaq"}