{"published": "2015-09-12T04:56:41Z", "media-type": "News", "title": "Ancient squirrel's nest leads to discovery of giant virus", "id": "e7cdd273-490f-41d2-9c1c-9ee59c7c08e0", "content": "(CNN) -- Thank an ancient squirrel, climate change and French scientists for the new discovery of an ancient virus, Mollivirus sibericum, that sounds like it could launch a creepy movie. \n\"Actually there's already a science-fiction novel inspired by one of our last (discoveries). Look on Amazon,\" said Jean-Michel Claverie, a professor of medical genomics and bioinformatics at the University Of Mediterranean School Of Medicine in Marseille, France. \"But with the ancient squirrel, I can see where you might think movie.\" \n\nThe virus has been at rest for 30,000 about 30 meters deep in the Siberian permafrost. Astrobiologists using it as kind of stand-in for Mars have taken core samples looking for life. Claverie said he stumbled on research that described how reviving a plant from a seed that had been buried for 30,000 years. What intrigued Claverie was that the particular core sample came into contact with an ancient squirrel's nest. \n\n\"And what do all squirrels do all their life? They store seeds for eating,\" Claverie said. Wondering what else they might find, he sent the scientists an email that launched collaboration between Russian and French research teams and led to several discoveries. \n\nWaking an ancient virus \n\nWhen Claverie's team got the sample, they knew they'd have to be careful to protect animals and humans from whatever was in it; they weren't sure if they'd wake up Captain America or the Winter Soldier. \n\n\"We're not stupid enough to revive a virus that may pose a threat to human health,\" Claverie said. \n\nSo, they went fishing. \"We use amoeba as bait to fish out whatever viruses may be in that specific sample,\" Claverie said. \n\nThe amoeba was the type typically found in contact lens infections. The team grew them, then mixed in parts of the permafrost samples in a petri dish. Most of the time, nothing happened. \n\n\"But every once in a while, we see them die and that's when we know somebody must be killing them,\" Claverie said. \"This way, we know which to isolate from the others.\" Scientists say they are safeguarding the virus sample. \n\nUsing this technique has led to several discoveries -- Mollivirus sibericum is the latest of four giant viruses found so far in this one sample. It's called a \"giant\" virus because you can see it under a light microscope, like a bacteria, and it has a large number of genes. \n\nThe name comes from Molli, a hard-to-translate French word that essentially means something that is soft or flexible, Claverie said, and Sibericum for the location where it was found. \n\n\"The name is a little mundane compared to the last giant virus we found 'the Pandoraviruses,'\" he said. \"Mollivirus sibericum, though could be as equally dangerous as what is in Pandora's Box, based on its behavior. \n\n\"It was a very low concentration of these viruses that infected the amoeba. If you think about it, it's really scary that only a handful of particles might be sufficient enough to start an epidemic.\" \n\nWhich is why, in the paper Claverie and his team published in a recent edition of PNAS, they express concern about other ventures into the permafrost. \n\nWhat's hiding in the permafrost? \n\nAs climate change has opened up new maritime routes through the arctic sea ice, Claverie and his team worry about the increasing number of companies already mining for gold and tungsten along the northern coast of Siberia. \n\nThe companies will excavate millions of tons of permafrost that have lain undisturbed for thousands and thousands of years. \n\nIf this one core sample yielded at least four giant viruses, there is no telling what frozen surprises could be suddenly exposed in open mining. \n\n\"What may be in those layers is very worrying,\" Claverie said. \n\nBut they may also hold great promise. Secrets there could unlock a new understanding of metabolic pathways and biochemical processes that could lead to the creation of new drugs and biotechnology. \n\nOr that ancient squirrel could lead us to something even bigger, Claverie wrote: \"Part of what we don't know might turn out to contain the explanation to fundamental questions such as the origin of life on our planet.\" \n\nBy Jen Christensen \n\nThe-CNN-Wire \n™ & © 2015 Cable News Network, Inc., a Time Warner Company. All rights reserved. \n\nPhoto: MGN Online", "source": "KRXI-TV Reno"}