{"published": "2015-09-30T04:13:39Z", "media-type": "News", "title": "Clinton: End Obamacare tax on top health plans", "id": "bd0a0113-608c-4b84-9963-a7627fa9bea2", "content": "Hillary Clinton said Tuesday that Congress should repeal the unpopular \"Cadillac tax,\" an Obamacare tariff on premium health care plans. \n \nThe tax is set to go into effect in 2018. \n\nClinton said that while the Affordable Care Act -- one of President Barack Obama's top legislative achievements -- was \"working, plain and simple,\" there were some changes that needed to be made. \n\n\"I have proposed new reforms to build on the progress we've made and lower out-of-pocket costs for families,\" said Clinton in a statement. \"That's why, among other steps, I encourage Congress to repeal the so-called Cadillac tax, which applies to some employer-based health plans, and to fully pay for the cost of repeal.\" \n\nClinton said some of her proposed reforms to Obamacare, which she has rolled out in the past month, would more than cover the cost of repealing the Cadillac tax, a measure that helped to pay for the health care reform law. \n\nClinton's campaign first said the candidate disapproved of the Cadillac tax during a call earlier this month with the American Federation of Teachers, a powerful union that has endorsed Clinton. \n\nThe call was first reported Tuesday by The New York Times. Shortly after the story was published, Clinton's campaign released a statement calling on Congress to repeal the tax. \n\nUnion members, many of whom enjoy the generous employer-based coverage plans, would be hit by the 40% tax, which applies to plans with yearly premiums exceeding $10,200 for individuals and $27,500 for families. \n\nRandi Weingarten, president of the American Federation of Teachers and a longtime Clinton supporter, praised the former secretary of state's decision. \n\n\"We are proud that Hillary Clinton has come out in favor of a repeal of the so-called Cadillac tax -- a harmful tax on health benefits that is hurting America's working families,\" she said. \"This tax already is being used by employers to shift an increasing share of health care costs to employees.\" \n\nBut many health care experts who view the tax as a crucial part of the Obamacare law are critical of Clinton's position. \n\n\"The smarter move is to leave well enough alone and allow this tax to take effect,\" said Jared Bernstein, a former White House economist and senior fellow at the Center on Budget and Policy Priorities, in a Washington Post op-ed earlier this year. \"After decades of fighting for it, we're finally moving towards a more rational, efficient health care system. Let's not screw that up.\"", "source": "16 WAPT"}