{"published": "2015-09-08T19:11:27Z", "media-type": "News", "title": "Teenagers are getting lie ins to see if more sleep yields better exam results", "id": "af0deac5-096d-41a2-bae6-133655483fb5", "content": "Remember the struggle of forcing yourself out of bed at 7am every Monday-Friday to make it to the school gates before the bell rang? The daily morning horror might be a thing of the past for today’s teenagers, who could to allowed lie ins to better their grades. \n \nA hundred schools across the UK are being invited to take part in the research to see if more sleep can help teens get better GCSE grades. The experiment aims to test the theory that restoring natural sleep patterns to 14 to 16-year-olds will improve their academic performance. \n \nDr Paul Kelley, one of the study leaders from Oxford University’s Sleep and Circadian Institute, expects that it will. He passionately believes that ignoring the body’s internal clock mechanism has led to physical and mental illness and poor quality of life in modern societies around the world. \n \n (timothykrause via Flickr)   \nThe 24-hour sleep-wake cycle of circadian rhythms is driven by exposure to light entering the eyes and, via a non-visual pathway to the brain, regulates a host of biological mechanisms and genes. \n \nTo what extent this affects health is not fully understood but according to Dr Kelley the impact of disrupting natural sleep patterns is enormous. \n \nWhat is more, the patterns change at different ages – meaning that teenagers should start and end the day later than either young children or middle aged adults. \n \nSpeaking at the British Science Festival, taking place at the University of Bradford, Dr Kelley said: “We can’t change our 24 hour rhythms. You can’t learn to get up at a particular time. \n \n“By the time you are 20, 19 or 18 you’re getting up and going to sleep up to three hours later. It’s natural and uncontrollable in the sense that you cannot change it.” \n \nIgnoring this change in sleep pattern was associated with “hugely damaging impacts on all the body’s systems” that could affect performance, long-term memory, weight gain, mood, blood pressure, and might even increase the risk of diabetes and schizophrenia. \n \n (Royal Philips Electronics/PA)   \nDr Kelley believes it is no accident that 70% of mental illnesses start between the ages of around 11 and 24. \n \nHe added: “Sleep deprivation is a torture. Thirty days without sleep and you die. It has about the same effect as not eating.” \n \nOne research group had shown that getting less than six hours sleep a night altered the activity of more than 700 genes. \n \nThe teenage sleep study, funded by the Wellcome Trust, will compare a group of children starting school at the normal time – on average around 8.30 to 9am – with another beginning lessons at 10am. \n \n (Chris Radburn/PA)   \n“The science of it says they will perform better,” said Dr Kelley. “They will sleep more, they’ll have less stress and anxiety, and a lower rate of drug up-take both legal and illegal. I can’t predict how much it will improve their GCSE results but I would put money on it being a statistically significant positive change.” \n \nLater class times were also expected to lead to improvements in family life and would help parents making the school run, allowing them to drive on less congested roads. \n \nSo there you have it, more sleep = happier teenagers. We told people that for years and nobody listened, sigh.", "source": "Evening Echo"}