{"published": "2015-09-04T15:28:25Z", "media-type": "Blog", "title": "Breathing tips and key principles of breath", "id": "a88a371b-3d3d-42ec-b8ef-cc8374c22fc8", "content": "It has recently been brought to my attention that I may have an ‘obsession’, with ‘breathing’ and ‘movement’. I originally thought that ‘obsession’ was a bit strong of a descriptor but after thinking about it in a bit more depth, I may be guilty of being a bit obsessed. \n \n\n \nBreathing is one of the key principles of Pilates (and many other disciplines as well I must add) and I am sure you would have heard some reference to it at some point in your Pilates experience. \n \nEver wonder why most relaxation techniques involve focus on the breath? From a physiological perspective, a simplified explanation is through the relationship between our breath and arousal level. When we are stressed, scared, anxious or angry the ‘fight or flight’ system is triggered in our bodies. This is controlled by our sympathetic nervous system and some key responses are shallow rapid breathing, increased heart rate and blood being diverted to our big power muscles. On the contrary our ‘relaxed’ or basal state is controlled by our parasympathetic nervous system, which has the opposite response; longer slower breaths, decreased heart rate and blood/ energy directed to more basal functions such as digestion or immunity. \n \nYou may be thinking, “Well since I am exercising doing Pilates don’t I want to have more of my energy to my big power muscles?” My answer to that would be it depends what your goal is. If you are trying to generate power, sure, a strong powerful exhalation can be more beneficial (there are many opinions on breathing techniques for maximizing power but I am not going to go into that debate). However, Pilates training and exercise requires a focus more on ‘control’ than power. Through my experience, I have found that in this day and age most of us are normally in a slight state of over arousal and find it difficult to ‘relax’ and therefore breathe long relaxed breaths. Our movement reflects this. We are good at fast and powerful but find hard to slow down and control. \n \nCheck out for an experienced and Reliable women’s health physiotherapy in Brisbane \n \nIn reality not one form of breath or movement is better than the other; it is just more efficient and effective when we use them appropriately. \n \nSome breathing tips: \n \n* The breath should match the movement. I.e. Long fluid movements require long fluid breaths \n* Exhaling during the most challenging aspect of the movement is often easiest \n* To increase range or stretch allow for a FULL exhalation \n* Although breath can be a very powerful tool to improve your practice/ performance, it can be confusing and therefore hinder performance when you are first learning a new exercise or technique. If this is the case don’t worry about the specifics and just BREATHE. \n \nAt the Body Refinery you can find physiotherapist Brisbane or pilates trainer help breath match the movement and start getting active in a safe way, helping you to start decreasing the threat of movement with progressive Clinical pilates exercises, safe environment and reassurance to recovering progressively the normal motion of your body.", "source": "JOY Free Press"}