{"published": "2015-09-16T17:10:00Z", "media-type": "Blog", "title": "Lloyd Blankfein on Donald Trump", "id": "1e510a66-ab1b-4f03-b86b-97f8a5ded11f", "content": "The head bankster thinks the country is looking for a \"dealmaker.\" WSJ has the details:\nOne of Wall Street’s top executives sought to explain Donald Trump’s surprising appeal as a presidential candidate, noting the real-estate developer and reality-television star may have tapped into voters’ longing for more dealmakers in Washington.\n“We’ve put together a country that lets everyone into Washington with an absolute pledge not to compromise on anything,” Lloyd Blankfein, Goldman Sachs Group Inc.’s chairman and chief executive, said Wednesday during a talk at The Wall Street Journal’s “Viewpoints” executive-leadership series in Midtown Manhattan. “And then Trump comes along and talks the language of dealing.”\nMr. Blankfein, a Democrat, stopped well short of endorsing Mr. Trump’s run. Some of Mr. Trump’s statements, the Wall Street executive said, are “wacky.” And the image of Mr. Trump “with his finger on the button blows my mind,” he added, drawing laughter from the audience.\nYet his candidacy may signal voters are ready to support politicians who are willing to compromise and “get the best deal for my set of positions.”\n“Nobody who listens to him thinks he’s ideologically stuck on the most extreme position,” Mr. Blankfein said of Mr. Trump.\nAn avid reader of history, Mr. Blankfein went back to the early 1800s when an unconventional candidate named Andrew Jackson won the presidency.\n“What must people have been thinking when he got elected?” he said of Jackson, an “unkempt and noisy” populist from the woods who ended the line of establishment candidates in the nation’s highest office. “Could that be happening now?\n“We’re being kind of dismissive of things. But people must’ve dismissed that.”\nWhen asked if he could live with Mr. Trump in the White House, Mr. Blankfein demurred: “I didn’t say that.”", "source": "EconomicPolicyJournal.com"}