{"published": "2015-09-23T07:05:20Z", "media-type": "News", "title": "Hike in price of life-saving Daraprim may be trimmed", "id": "51204204-2a2c-43f7-b481-21b94f6f437e", "content": "NEW YORK - A former hedge fund manager turned pharmacist, Martin Shkreli, who jacked up the price of the drug Daraprim a staggering 5,000 percent overnight, has said he will consider lowering the cost of the life-saving medicine after a huge public outrage. \n\nShkreli, 32, who heads the pharmaceutical company Turing, did not say what the new price would be. But he said it will be decided over the next few weeks.\n\n\"We've agreed to lower the price of Daraprim to a price that is more affordable,\" Shkreli said on ABC World News Tonight.\n\nHe told NBC News Tuesday that the decision to lower the price was a reaction to outrage over the increase in the price of the drug from $13.50 to $750 per pill.\n\n\"Yes it is absolutely a reaction there were mistakes made with respect to helping people understand why we took this action, I think that it makes sense to lower the price in response to the anger that was felt by people,\" said Shkreli, who had became the focus of public anger.\n\nThe 5,000 percent increase in the drug price also caught the eye of Hillary Clinton who tweeted about it Monday, saying she wanted to put an end to drug \"price gouging\".\n\nDaraprim fights toxoplasmosis, which infects people whose immune systems have been weakened by AIDS, chemotherapy and pregnancy, according to the Center of Disease Control.\n\nIt's been around for decades but Shkreli's company bought the rights to it in August for $55 million. The main use of the drug is to treat life-threatening parasitic infections.\n\nShkreli, who has been called a boy genius, had become the face of the outcry and outrage spread across the virtual world.\n\nThe Daily Beast declared him the \"most-hated man in America,\" surpassing the dentist who killed Cecil the Lion.\n\nShkreli has said that the drug is so rarely used that the impact on the health system would be minuscule.\n\nHe said he wanted the money from the price increase to be used to develop better treatment for toxoplasmosis that have fewer side effects.\n\n\"It's very easy to see a large drug price increase and say 'Gosh those people must be gouging,' but when you find out the company is not making any money, what does that mean?\" Shkreli said in a phone interview with NBC News Tuesday. \"It's very hard stuff to understand.\"", "source": "Philippines News.net"}