{"published": "2015-09-17T11:11:40Z", "media-type": "News", "title": "Global Opioids Overview 2015-2021 - An Assessment of Pain Management and Dependence in the $15 Billion Industry", "id": "fd62fc38-129a-4565-a9c4-845bb4430bc6", "content": "SOURCE Research and Markets\n\nDUBLIN \n\nThis report discusses the use of opioids as potent analgesics for the treatment of cancer and non-cancer pain and examines the management of opioid dependence in the US, the UK, Germany \n\nAnalysis pertaining to the prescribed opioid users, treatment patterns, and market revenues confirms that the use of weak opioids has fallen dramatically in most markets, while the use of strong opioids has increased. The total market size in the countries covered in this report was $15.7 billion \n\nThe global prevalence of chronic pain was 20-30% in the same year, although most of the prevalence population received inadequate treatment due to the high potential for opioid abuse or misuse. \n\nThe report also discusses each country's regulatory restrictions, as well as the treatments available for opioid dependence such as withdrawal management, maintenance, and psychosocial support. In addition, it examines dependence treatment settings, trends, and patient referral pathways. Patient access and cost of treatment remain the key barriers to effectively managing opioid dependence in most countries. \n\nScope \n\nDosage and treatment regimes for major opioids used in pain management: \n\n- Which opioids are used for opioid-naïve patients and for patients that experience continuous pain but respond well to opioids? - Which opioids are considered for first-line and second-line treatment? \n\nManagement of opioid dependence according to WHO treatment guidelines: \n\n- What are the recommended medications for opioid maintenance, withdrawal, and overdose? \n\n- What are the treatment regimes followed when using various pharmacotherapy drugs? \n\n- What role does psychosocial treatment play? \n\nIn-depth country analysis of opioids for pain management, covering pain prevalence, level of opioid use, commonly used opioids, trends, barriers, and rationalization initiatives: \n\n- What is the overall pain prevalence in each country and is it treated adequately? \n\n- To what extent are opioids used to treat pain? \n\n- What are the major opioids used and the key associated trends? \n\n- Why are patients/prescribers often reluctant to use opioids for pain? \n\n- What initiatives have been taken or recommended to facilitate appropriate use of opioids? \n\nRegulatory landscape and guidelines for opioid prescription: \n\n- Which regulatory laws and bodies oversee import, exports, schedules, and controls on opioids in each country? \n\n- Which narcotic guidelines discuss the prescribing authorities and licenses required to possess or prescribe controlled drugs? \n\nIn-depth country analysis of treatment for opioid dependence in all countries, covering dependence, substance abuse trends, treatment usage patterns, and patient referral pathways: \n\n- How many drug users receive treatment for opioid dependence? \n\n- What are the medication usage trends in dependence treatment? \n\n- What are the referral pathways for dependent patients? \n\nUse of novel formulations to prevent abuse and address unmet need in pain management: \n\n- How do agonist-antagonist, abuse-resistant, and overdose-reversal formulations aid abuse prevention? \n\nChallenges addressing the unmet need in opioid dependence treatment: \n\n- Which areas need to be improved to address the unmet need in opioid dependence treatment? \n\nKey Topics Covered: \n\n1. Executive Summary \n\n2. Opioids Overview \n\n3. Classification of Opioids by Potency, Origin and Function \n\n4. Classification and Management of Pain \n\n5. Opioids for Pain Management \n\n6. Effect on Different Organ Systems \n\n7. International Rules for Use of Opioid-Based Analgesics \n\n8. Management of Opioid Dependence \n\n9. WHO Treatment Guidelines for Opioid Dependence - Pharmacological Treatment \n\n10. WHO Treatment Guidelines for Opioid Dependence - Psychosocial Treatment \n\n11. Pharmacotherapy for Opioid Dependence \n\n12. Country Analysis (US, UK, Germany \n\n13. Opioids Overview \n\n14. Regulatory Landscape \n\n15. Opioids Market Size \n\n16. Dependence Overview \n\n17. Dependence Treatment and Trends \n\n18. Patient Referral Pathway \n\n19. Unmet Need in Opioid Pain Management \n\n20. Unmet Need in Opioid Dependence Treatment \n\n21. Bibliography \n\nFor more information visit \n\nhttp://www.researchandmarkets.com/research/6xlthh/opioids_overview \n\nMedia Contact: \n\nLaura Wood \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/global-opioids-overview-2015-2021---an-assessment-of-pain-management-and-dependence-in-the-15-billion-industry-300144798.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KYTX CBS 19"}