{"published": "2015-09-01T22:30:15Z", "media-type": "News", "title": "Biden is top choice of Democrats if Clinton falters: Reuters/Ipsos poll", "id": "083eca39-e122-4caf-9c54-445f019ed10d", "content": "U.S. Vice President Joe Biden delivers remarks at the U.S.-Ukraine Business Forum in Washington July 13, 2015.  Reuters/Yuri Gripas    \nU.S. Democratic voters would choose Vice President Joe Biden as their preferred candidate for president in 2016 if current frontrunner Hillary Clinton shows signs of faltering, according to a Reuters/Ipsos poll released on Tuesday. \n\nMore than 38 percent of Democrats polled said they would vote for Biden in the Democratic Party nominating contest, if polling indicated that Clinton would lose to a Republican candidate. \n\nThirty percent of Democratic voters said they would back liberal Vermont Senator Bernie Sanders should Clinton, a former secretary of state, run into trouble, according to the tracking poll conducted from Aug. 28 through Sept. 1. \n\nFewer than a quarter of voters said they would stick by Clinton. The survey suggested that while Clinton's support is broad, voters are far from committed, which could indicate risks for her if Biden were to jump into the race. \n\nBiden has been consulting with advisers over whether he should launch a 2016 presidential bid. With the first Democratic presidential primary debate planned for Oct. 13, Biden is under pressure to make a decision within the next few weeks. \n \nA total of 499 people who identified themselves as Democrats took part in the poll, which had a credibility interval of plus or minus 5.1 percentage points. \n\nClinton remains the top choice for Democratic voters, with more than 44 percent favoring the former first lady, according to Tuesday's Reuters/Ipsos polling data. Sanders had the support of a quarter of those surveyed, and Biden almost 17 percent. \n \nBut Clinton's lead narrowed in recent days as her polling numbers fell below 50 percent in August and as Sanders, a self-described socialist, drew a bit closer. \n\nSanders' campaign has focused on wealth inequality and the economic struggles of the middle class. He has drawn large crowds and has appeared to gain traction especially among students, according to Reuters/Ipsos polling. \n\nVoters in various polls have said they lack trust in Clinton as she struggles with a controversy over her use of a private email server for official business during her tenure as the top U.S. diplomat. \n \nThe FBI is investigating the security of the private server and any classified information on it. Clinton says she did nothing wrong and only used the private account out of convenience. \n\nAn August interview survey of 22 voters who had participated in Reuters/Ipsos polling and supported Biden found many of them describing the vice president as \"honest,\" \"genuine\" and \"trustworthy.\" \n\n\n(Reporting by Alina Selyukh; Editing by Leslie Adler)", "source": "Reuters"}