{"published": "2015-09-05T23:00:21Z", "media-type": "News", "title": "Implementation of OROP", "id": "edc1d45e-0439-48a0-99d2-371ea4ad9b48", "content": "Brig P K Langar (Retd) \nThe Armed Forces is a profession of Arms which is nobler than any contemporary profession, for its ethos revolves around the fact that one is to lay down one’s life in line of duty to maintain the territorial sanctity of the nation. The Defense personnel are divorced from the niceties of the civil environments and are motivated and trained to get the better of the enemy in combat, both in peace and war, should the contingency arise. Military personnel are ‘Karam Yogi’ , whose Dharm is their duty to carry out assigned task in an extraordinary self less attitude. The ‘Izzat’ of their Unit and the Country is uppermost in their minds and they live and die to maintain its sanctity. \nAge old traditions and un-written laws which keeps morale of the soldiers high all through their active service and after retirement, assures them that the state would look after their interest when the times comes. This bond between the soldier and the State, and their faith in their superiors and vis-a-versa remain unfettered forever. This is the main reason that they reconcile with that fact that their Fundamental Rights ( So dear to their fellow countrymen) are curtailed by their respective Service Acts. The soldiers don’t voice their grievances in public even when they are not satisfied in their promotion prospects and the like.  This reinforces the fact that the State has to look after their well being religiously in a most effective manner. The day it does not happen and a Soldier has to demand for his legitimate dues, the incumbent Government would lose its credibility which could have serious ramifications in future. \nThe case of One Rank One Pension (OROP) is very legitimate since the sustainability of the present and tomorrows ex-servicemen depends on implementation of OROP. To comprehend that the citizen and the Government must appreciate that the Armed Forces have a steep pyramid for promotion with no lateral expansion hence most of the officers and the Other Rank of the Defence forces retire between ages from late 30s to early 40s and are on pension to lead a decent life and cater to growing children’s requirements. The jobs offered by commercial organization are not in consonance with the status  of ex-servicemen and are often demeaning. \nThe political leadership over the last 40 years has shown a lackadaisical attitude towards the soldiers demand by not implementing OROP in its totality. It’s fair to assume that the political leadership is influenced by the bias of bureaucracy, the latter caught in its own web of ulterior motives.  The ex-servicemen out of frustration for not getting their legitimate dues are on a peaceful protest and hunger strike for about 90 days. The Government while implementing OROP should not get involved in bargaining with the ex-servicemen, for it is not akin to a strike of by Labour Union of a PSU. If the implementation of OROP is further delayed it can lead to a fissure between political and military leadership which will be unfortunate and could impact working equation between the two in future. \nThe political leadership is supreme in a democratic set up but it has to take military leadership on board to ensure turmoil free domestic constituency and maintaining sanctity of national borders and safety from external aggression. A powerful military force with high morale is inevitable in guarding national interest and asset, both inside and outside the country. Also a motivated strong military force is an extension of economically developed nation’s aggressive policy helping it to become a dominating nation in the world affairs. \nIt’s on record that whenever the incumbent Government demanded, the Armed Forces Commanders had advised the former on the best military course of action and carried out the assigned task relentlessly to safeguard the sovereignty and integrity of the country. The Kashmir operation 1947-48, to throw back the Pakistani intruders, a strong repost to cripple Pakistani military machine in 1965 war, the liberation of Bangladesh to stop the oppressed refugees influx into our country and the Kargil Operation of 1999 are all examples in point and are testimony to the fine synergy between the civil and military leadership of the day. In all the above scenarios the bureaucracy was only in a support role and will remain the same in future also. \nWe must appreciate objectively that today’s serviceman is tomorrow’s ex-serviceman and whatever be the final decision of the Government on implementation of OROP, it will impact the psyche of the future generations of the Armed Forces. \nFinally, the implementation of OROP is a political decision which rests duly on elected leaders of the day, who have the mandate to look after the welfare of its people and the Armed Forces. We hope that the undulated implementation of the OROP will satisfy and upkeep the honour of  the protesting ex-serviceman, who were front line soldiers yesterday and had fought the Righteous war to safe guard the honour, safety and welfare of the people of this country at the peril of their own lives. \n(The author is a retired war veteran of 1965 and 1971 war with Pakistan) \n Share this:  Share With       Tweet", "source": "Daily Excelsior.com"}