{"published": "2015-09-08T12:30:00Z", "media-type": "News", "title": "Fannie Mae Introduces the Home Purchase Sentiment Index, an Innovative, Predictive Single Measure of Consumer Housing Attitudes", "id": "8d95e0f0-2ee2-4b5e-bc29-7a1105b47074", "content": "WASHINGTON , Sept. 8, 2015 /PRNewswire/ -- Fannie Mae's Economic & Strategic Research Group today launched the Fannie Mae Home Purchase Sentiment Index ™ (HPSI), which distills results from its consumer-focused National Housing Survey ™ (NHS) into a single, monthly, predictive indicator. Reflecting more than four years of data, the HPSI is designed to provide distinct signals about the direction of the housing market, helping industry participants to make better informed business decisions. \n\nUnlike existing general indices of consumer economic sentiment, the HPSI is devoted entirely to housing. The index is constructed from answers to six key NHS questions that solicit Americans' evaluations of housing market conditions and address topics related to their home purchase decisions. These questions ask consumers whether they think it is a good or bad time to buy or to sell a house, the direction they expect home prices and mortgage interest rates to move, how concerned they are about losing their jobs, and whether their incomes are higher than they were a year earlier. The Economic & Strategic Research Group expects to release the HPSI at 8:30 a.m., ET on the seventh day of each month or the first business day afterward. \n   \n\"The Fannie Mae Home Purchase Sentiment Index provides the market a single number to track consumer attitudes focused on the housing market,\" said Doug Duncan , senior vice president and chief economist at Fannie Mae. \"Utilizing our National Housing Survey, the only consumer sentiment survey of its kind focused on housing, the HPSI will offer insights regarding current and future-looking housing market outcomes and will complement existing data sources to inform housing-related analysis.\" \n\n\"Consumer attitudes toward the current home selling climate have slid back to their April 2015 level, contributing to a slight decline in the August HPSI reading relative to its four-year high, reached two months ago,\" said Duncan. \"Expectations of rising mortgage rates and increasing concerns in the last six months about the direction of the economy seem to be weighing on consumers' assessment of the housing market. Those who think it's a good time to buy or sell a home have consistently pointed to favorable mortgage rates as the primary reason for their optimism. Those who think it's a bad time to buy or sell a home have consistently pointed to unfavorable economic conditions as the primary reason for their pessimism. Still, the four-year upward trend in the HPSI indicates that consumers remain fairly optimistic about the housing market.\" \n\nHOME PURCHASE SENTIMENT INDEX – COMPONENT HIGHLIGHTS \nThe August 2015 HPSI fell 0.5 points to 80.8 , continuing the decline from the all-time high reached in June 2015 . The HPSI is up 5.3 points since this time last year. On net, two components of the HPSI improved in August, with Confidence About Not Losing Job increasing 3 points and Good Time to Sell increasing 1 point. Home Price and Mortgage Rate net expectations both fell 3 points since last month. \nThe percent of respondents who said that it is a good time to buy a house rose to 63%, rising 2 percentage points from last month's all-time survey low. Those who say it is a good time to sell rose 2 percentage points to 47%. The percent of respondents who say it is a bad time to sell also increased to 44%. The percent of respondents who said that home prices will go up over the next 12 months fell to 47%. The percent who said that home prices will go down rose to 9%. The share who expect mortgage interest rates to go up in the next 12 months rose 3 percentage points to 54%. The share who say mortgage rates will go down remained the same at 5%. The share of respondents who say they are not concerned with losing their job rose to 83%, while the share of respondents who say they are concerned with losing their job fell to 16%. The share of respondents who say their household income is significantly higher than it was 12 months ago fell to 24%, while those who say it is significantly lower fell to 12%. \nABOUT THE FANNIE MAE HOME PURCHASE SENTIMENT INDEX \n\nThe Fannie Mae Home Purchase Sentiment Index ™ (HPSI) distills information about consumers' home purchase sentiment from the Fannie Mae National Housing Survey ™ (NHS) into a single number. The HPSI reflects current and forward-looking housing market outcomes and complements existing data sources to inform housing related analysis and decision making. The HPSI is constructed from answers to six NHS questions that solicit consumers' evaluations of housing market conditions and address topics that are related to their home purchase decisions. The questions ask consumers whether they think that it is a good or bad time to buy or to sell a house, what direction they expect home prices and mortgage interest rates to move, how concerned they are about losing their jobs, and whether their incomes are higher than they were a year earlier. \n\nThe six questions of the Home Purchase Sentiment Index include: \nIn general, do you think this is a very good time to buy a house , a somewhat good time, a somewhat bad time, or a very bad time to buy a house? In general, do you think this is a very good time to sell a house , a somewhat good time, a somewhat bad time, or a very bad time to buy a house? During the next 12 months, do you think home prices in general will go up, go down, or stay the same as where they are now? During the next 12 months, do you think home mortgage interest rates will go up, go down, or stay the same as where they are now? How concerned are you that you will lose your job in the next twelve months? Are you very concerned, somewhat concerned, not very concerned, or not at all concerned that you will lose your job in the next twelve months? How does your current monthly household income compare to what it was twelve months ago? \nABOUT THE FANNIE MAE NATIONAL HOUSING SURVEY \n\n\nThe most detailed consumer attitudinal survey of its kind, Fannie Mae's National Housing Survey ™ polled 1,000 Americans via live telephone interview to assess their attitudes toward owning and renting a home, home and rental price changes, homeownership distress, the economy, household finances, and overall consumer confidence. Homeowners and renters are asked more than 100 questions used to track attitudinal shifts, six of which are used to construct the HPSI (findings are compared to the same survey conducted monthly beginning June 2010 ). To reflect the growing share of households with a cell phone but no landline, the National Housing Survey has increased its cell phone dialing rate to 60 percent as of October 2014 . For more information, please see the Technical Notes . Fannie Mae conducts this survey and shares monthly and quarterly results so that we may help industry partners and market participants target our collective efforts to stabilize the housing market in the near-term, and provide support in the future. The August 2015 National Housing Survey was conducted between August 1, 2015 and August 24, 2015 . Most of the data collection occurred during the first two weeks of this period. Interviews were conducted by Penn Schoen Berland, in coordination with Fannie Mae. \n\nDETAILED HPSI & NHS FINDINGS \n\nFor detailed findings from the August 2015 Home Purchase Sentiment Index and National Housing Survey, as well as a brief HPSI overview and detailed white paper, technical notes on the NHS methodology, and questions asked of respondents associated with each monthly indicator, please visit the Fannie Mae Consumer Attitude Measures page on fanniemae.com. Also available on the site are in-depth topic analyses , which provide a detailed assessment of combined data results from three monthly studies of NHS results. \n\nTo receive e-mail updates with other housing market research from Fannie Mae's Economic & Strategic Research Group, please click here . \n\nOpinions, analyses, estimates, forecasts, and other views of Fannie Mae's Economic & Strategic Research (ESR) Group included in these materials should not be construed as indicating Fannie Mae's business prospects or expected results, are based on a number of assumptions, and are subject to change without notice. How this information affects Fannie Mae will depend on many factors. Although the ESR Group bases its opinions, analyses, estimates, forecasts, and other views on information it considers reliable, it does not guarantee that the information provided in these materials is accurate, current, or suitable for any particular purpose. Changes in the assumptions or the information underlying these views could produce materially different results. The analyses, opinions, estimates, forecasts, and other views published by the ESR Group represent the views of that group as of the date indicated and do not necessarily represent the views of Fannie Mae or its management. \n\nFannie Mae enables people to buy, refinance, or rent homes. \n\nVisit us at http://www.fanniemae.com/progress . \n\nFollow us on Twitter: http://twitter.com/FannieMae . \n\nPhoto - http://photos.prnewswire.com/prnh/20150904/263967  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/fannie-mae-introduces-the-home-purchase-sentiment-index-an-innovative-predictive-single-measure-of-consumer-housing-attitudes-300138498.html \n\nSOURCE  Fannie Mae", "source": "Wall Street Business Network"}