{"published": "2015-09-30T08:25:36Z", "media-type": "News", "title": "Mark Carney speech in full: \"Climate change is the Tragedy of the Horizon\"", "id": "762f8ddf-8f14-4d83-89d8-5d57a09a0f85", "content": "I'm grateful to Lloyd's for the invitation to speak tonight on the occasion of the first City Dinner held in this magnificent, eponymous \"Room\". \nLloyd's is the bedrock of the UK insurance industry. \n\nAn industry whose direct contribution to the UK economy is impressive: 300,000 high-paying jobs and £25bn in annual GDP. \n\nIts economic contribution goes much deeper. \n\nInsurance supports households, companies and investors, safeguarding them from perils they could not otherwise shoulder. \n\nIt matches long-term savings and investment, financing the infrastructure essential to productivity. \n\nWith its unique perspective and skill set, insurance diversifies the financial system and reinforces its resilience. \n\nSince 1688 Lloyd's has, in the great tradition of the City, served both the UK and the world, providing protection against the perils of the age; helping enterprise and trade to thrive. \n\nFrom its origins in marine insurance, the Lloyd's market has evolved constantly to meet the needs of a rapidly changing world. \n\nThe first excess of loss reinsurance was created here. \n\nModern catastrophe cover was born with your decision to stand by policyholders after the San Francisco earthquake. \n\nAnd Lloyd's pioneered aviation insurance.  \n\nWith eyes constantly on the horizon, Lloyd's has remained at the forefront of global insurance. \n\nToday, you are insuring new classes of risk in new parts of the world - from cyber to climate, from space to specie, from Curitiba to Chengdu. \n\nAnd you are doing so in market conditions as challenging as any in the last 20 years. \n\nThe need to manage emerging, mega risks is as important as ever. \n\nAlongside major technological, demographic and political shifts, our very world is changing. Shifts in our climate bring potentially profound implications for insurers, financial stability and the economy. \n\nI will focus on those risks from climate change this evening. \n \nThe tragedy of the horizon\r \n    \nFURTHER READING \n    \nThere is a growing international consensus that climate change is unequivocal.  \n \nMany of the changes in our world since the 1950s are without precedent: not merely over decades but over millennia. \n\nResearch tells us with a high degree of confidence that: \n In the Northern Hemisphere the last 30 years have been the warmest since Anglo-Saxon times; indeed, eight of the ten warmest years on record in the UK have occurred since 2002;  \r Atmospheric concentrations of greenhouse gases are at levels not seen in 800,000 years; and  \r The rate of sea level rise is quicker now than at any time over the last two millennia.   \r \n\nEvidence is mounting of man's role in climate change. Human drivers are judged extremely likely to have been the dominant cause of global warming since the mid-20th century. While natural fluctuations may mask it temporarily, the underlying human-induced warming trend of two-tenths of a degree per decade has continued unabated since the 1970s.  \n\nWhile there is always room for scientific disagreement about climate change (as there is with any scientific issue) I have found that insurers are amongst the most determined advocates for tackling it sooner rather than later. And little wonder. While others have been debating the theory, you have been dealing with the reality: \n\nSince the 1980s the number of registered weather-related loss events has tripled; and \n\nInflation-adjusted insurance losses from these events have increased from an annual average of around $10bn in the 1980s to around $50bn over the past decade.  \n\nThe challenges currently posed by climate change pale in significance compared with what might come. The far-sighted amongst you are anticipating broader global impacts on property, migration and political stability, as well as food and water security.  \n\nSo why isn't more being done to address it? \n\nA classic problem in environmental economics is the tragedy of the commons. The solution to it lies in property rights and supply management. \n\nClimate change is the Tragedy of the Horizon. \n\nWe don't need an army of actuaries to tell us that the catastrophic impacts of climate change will be felt beyond the traditional horizons of most actors - imposing a cost on future generations that the current generation has no direct incentive to fix. \n\nThat means beyond: \n the business cycle;  \r the political cycle; and \r the horizon of technocratic authorities, like central banks, who are bound by their mandates.  \r \n\nThe horizon for monetary policy extends out to 2-3 years. For financial stability it is a bit longer, but typically only to the outer boundaries of the credit cycle - about a decade. \n\nIn other words, once climate change becomes a defining issue for financial stability, it may already be too late. \n\nThis paradox is deeper, as Lord Stern and others have amply demonstrated. As risks are a function of cumulative emissions, earlier action will mean less costly adjustment. \n\nThe desirability of restricting climate change to 2 degrees above pre-industrial levels 12 leads to the notion of a carbon ‘budget', an assessment of the amount of emissions the world can ‘afford'. \n\nSuch a budget - like the one produced by the IPCC - highlights the consequences of inaction today for the scale of reaction required tomorrow. \n\nThese actions will be influenced by policy choices that are rightly the responsibility of elected governments, advised by scientific experts. In ten weeks representatives of 196 countries will gather in Paris at the COP21 summit to consider the world's response to climate change. It is governments who must choose whether, and how, to pursue that 2 degree world. \n\nAnd the role of finance? Earlier this year, G20 Finance Ministers asked the Financial Stability Board to consider how the financial sector could take account of the risks climate change poses to our financial system. \n\nAs Chair of the FSB I hosted a meeting last week where the private and public sectors discussed the current and prospective financial stability risks from climate change and what might be done to mitigate them. \n\nI want to share some thoughts on the way forward after providing some context beginning with lessons from the insurance sector. \n \nClimate change and financial stability\r \n \nThere are three broad channels through which climate change can affect financial stability: \n  First, physical risks: the impacts today on insurance liabilities and the value of financial assets that arise from climate- and weather-related events, such as floods and storms that damage property or disrupt trade; \r Second, liability risks: the impacts that could arise tomorrow if parties who have suffered loss or damage from the effects of climate change seek compensation from those they hold responsible. Such claims could come decades in the future, but have the potential to hit carbon extractors and emitters - and, if they have liability cover, their insurers - the hardest; \r Finally, transition risks: the financial risks which could result from the process of adjustment towards a lower-carbon economy. Changes in policy, technology and physical risks could prompt a reassessment of the value of a large range of assets as costs and opportunities become apparent.  \r \n\nThe speed at which such re-pricing occurs is uncertain and could be decisive for financial stability. There have already been a few high profile examples of jump-to-distress pricing because of shifts in environmental policy or performance. \n\nRisks to financial stability will be minimised if the transition begins early and follows a predictable path, thereby helping the market anticipate the transition to a 2 degree world. \n\nTo draw out these crucial points consider the Bank of England's current approach to the insurance sector. \n\nAs regulator of the world's third largest insurance industry, the PRA is responsible for protecting policyholders and ensuring the safety and soundness of insurers. \n\nOur supervision is forward-looking and judgement-based. It is risk-based and proportionate - tailored to different business models around the sector - and considers both business-as-usual and whether a firm can fail safely - recognising that \"zero failure\" is neither desirable nor realistic. \n\nOur supervisors take a view of your business plans, risk management, governance, and capital models. Where the PRA judges that it is necessary to intervene it does so sooner rather than later. \n\nWhile our mandate is to protect policyholders - many of whom are local - we are conscious that international competition needs robust and internationally-consistent regulatory standards. \n\nSolvency II is a good example. It is a prudent but proportionate Directive, that embodies the core principles of our domestic standards and embeds them more consistently across Europe while replacing a patchwork of local regimes. \n\nAnother example of how best practice is converging globally is the FSB agreement last week on HLA for global systemic insurers, as well as its support for the IASB completing its new insurance contracts standard. The UK insurance industry is well-prepared for such developments. \n\nForward-looking regulators consider not just the here and now, but emerging vulnerabilities and their impact on business models. \n\nThat is why the PRA has worked with regulated firms, many of them represented here tonight, to produce for the Department for Environment, Food and Rural Affairs a review - published today - into the impact of climate change on British insurers. \n\nThe report concludes that insurers stand exposed to each of the three types of risk climate change poses to finance; and while the sector is well-placed to respond in the near-term you should not assume your ability to manage risks today means the future is secure. Longer term risks could have severe impacts on you and your policyholders. \n \nThe insurance response to climate change\r \n \nIt stands to reason that general insurers are the most directly exposed to such losses. \n \nPotential increases in the frequency or severity of extreme weather events driven by climate change could mean longer and stronger heat waves; the intensification of droughts; and a greater number of severe storms. \n\nDespite winter 2014 being England's wettest since the time of King George III; forecasts suggest we can expect at least a further 10 per cent increase in rainfall during future winters.  \n\nA prospect guaranteed to dampen the spirits and shoes of those who equate climate change with global warming. \n\nWhile the attribution of increases in claims to specific factors is complex, the direct costs of climate change are already affecting insurers' underwriting strategies and accounts. \n\nFor example, work done here at Lloyd's of London estimated that the 20 centimetre rise in sea-level at the tip of Manhattan since the 1950s, when all other factors are held constant, increased insured losses from Superstorm Sandy by 30 per cent in New York alone.  \n\nBeyond these direct costs, there is an upward trend in losses that arise indirectly through second-order events like the disruption of global supply chains. \n\nInsurers are therefore amongst those with the greatest incentives to understand and tackle climate change in the short term. Your motives are sharpened by commercial concern as capitalists and by moral considerations as global citizens. And your response is at the cutting edge of the understanding and management of risks arising from climate change. \n\nLloyd's underwriters were the first to use storm records to mesh natural science with finance in order to analyse changing weather patterns. Events like Hurricanes Andrew, Katrina and Ike have helped advance catastrophe risk modelling and provisioning. Today Lloyd's underwriters are required to consider climate change explicitly in their business plans and underwriting models. \n\nYour genius has been to recognise that past is not prologue and that the catastrophic norms of the future can be seen in the tail risks of today. \n\nFor example, by holding capital at a one in 200 year risk appetite, UK insurers withstood the events of 2011, one of the worst years on record for insurance losses. Your models were validated, claims were paid, and solvency was maintained. \n\nThe combination of your forecasting models, a forward-looking capital regime and business models built around short-term policies means general insurers are well-placed to manage physical risks in the near term. \n\nBut further ahead, increasing levels of physical risk due to climate change could present significant challenges to general insurance business models. \n\nImprovements in risk modelling must be unrelenting as loss frequency and severity shifts with: \n Insurance extending into new markets not covered by existing models; \r Previously unanticipated risks coming to the fore; and \r Increasingly volatile weather trends and hydrological cycles making the future ever-harder to predict.  \r \n\nFor example, the extent to which European windstorms occur in clusters could increase the frequency of catastrophes and reduce diversification benefits. \n\nIndeed, there are some estimates that currently modelled losses could be undervalued by as much as 50 per cent if recent weather trends were to prove representative of the new normal. In addition, climate change could prompt increased morbidity and mortality from disease or pandemics. \n\nSuch developments have the potential to shift the balance between premiums and claims significantly, and render currently lucrative business non-viable. \n\nAbsent actions to mitigate climate change, policyholders will also feel the impact as pricing adjusts and cover is withdrawn.  \n\nInsurers' rational responses to physical risks can have very real consequences and pose acute public policy problems. \n\nIn some extreme cases, householders in the Caribbean have found storm patterns render them unable to get private cover, prompting mortgage lending to dry up, values to collapse and neighbourhoods to become abandoned. \n\nThankfully these cases are rare. But the recognition of the potential impact of such risks has prompted a publicly-backed scheme in the UK - Flood Re - to ensure access to affordable flood insurance for half a million homes now considered to be at the highest risk of devastating flooding. \n\nThis example underlines a wider point. While the insurance industry is well placed to adapt to a changing climate in the short-term, their response could pose wider issues for society, including whether to nationalise risk. \n\nThe passage of time may also reveal risks that even the most advanced models are not able to predict, such as third party liability risks. \n\nParticipants in the Lloyd's market know all too well that what appear to be low probability risks can evolve into large and unforeseen costs over a longer timescale. \n\nClaims on third-party liability insurance - in classes like public liability, directors' and officers' and professional indemnity - could be brought if those who have suffered losses show that insured parties have failed to mitigate risks to the climate; failed to account for the damage they cause to the environment; or failed to comply with regulations. \n\nAsbestos alone is expected to cost insurers $85bn on a net ultimate claims basis in the United States - equivalent to almost three Superstorm Sandy-sized loss events.  \n\nIt would be premature to draw too close an analogy with climate risks, and it is true that court cases have, so far, largely been unsuccessful. \n\nCases like Arch Coal and Peabody Energy - where it is alleged that the directors of corporate pension schemes failed in their fiduciary duties by not considering financial risks driven at least in part by climate change - illustrate the potential for long-tail risks to be significant, uncertain and non-linear. \n\nAnd 'Loss and Damage' from climate change - and what to do about it - is now formally on the agenda of the United Nations Framework Convention on Climate Change, with some talking openly about the case for compensation.  \n\nThese risks will only increase as the science and evidence of climate change hardens. \n\nPhysical risks from climate change will also become increasingly relevant to the asset side of insurer's balance sheets.  \n\nWhile the ability to re-price or withdraw cover mitigates some risk to an insurer, as climate change progresses, insurers need to be wary of cognitive dissonance within their organisations whereby prudent decisions by underwriters lead to falls in the value of properties held by the firm's asset managers. This highlights the transition risk from climate change. \n \nTransition risks  \nThe UK insurance sector manages almost £2tn in assets to match liabilities that often span decades. While a given physical manifestation of climate change - a flood or storm - may not directly affect a corporate bond's value, policy action to promote the transition towards a low-carbon economy could spark a fundamental reassessment. \n\nTake, for example, the IPCC's estimate of a carbon budget that would likely limit global temperature rises to 2 degrees above pre-industrial levels. \n\nThat budget amounts to between one fifth and one third of world's proven reserves of oil, gas and coal.  \n\nIf that estimate is even approximately correct it would render the vast majority of reserves \"stranded\" - oil, gas and coal that will be literally unburnable without expensive carbon capture technology, which itself alters fossil fuel economics.   \n\nThe exposure of UK investors, including insurance companies, to these shifts is potentially huge. \n\nNineteen per cent of FTSE 100 companies are in natural resource and extraction sectors; and a further 11 per cent by value are in power utilities, chemicals, construction and industrial goods sectors. Globally, these two tiers of companies between them account for around one third of equity and fixed income assets. \n\nOn the other hand, financing the de-carbonisation of our economy is a major opportunity for insurers as long-term investors. It implies a sweeping reallocation of resources and a technological revolution, with investment in long-term infrastructure assets at roughly quadruple the present rate.  \n\nFor this to happen, \"green\" finance cannot conceivably remain a niche interest over the medium term. \n\nThere are a number of factors which could influence the speed of transition to a low carbon economy including public policy, technology, investor preferences and physical events. \n\nFrom a regulator's perspective the point is not that a reassessment of values is inherently unwelcome. It is not. Capital should be allocated to reflect fundamentals, including externalities. \n\nBut a wholesale reassessment of prospects, especially if it were to occur suddenly, could potentially destabilise markets, spark a pro-cyclical crystallisation of losses and a persistent tightening of financial conditions. \n\nIn other words, an abrupt resolution of the tragedy of horizons is in itself a financial stability risk. \n\nThe more we invest with foresight; the less we will regret in hindsight. \n\nAnd there are ways to make that more likely. \n \nFinancial policy implications\r \n   \nFinancial policymakers will not drive the transition to a low-carbon economy. It is not for a central banker to advocate for one policy response over another. That is for governments to decide. \n\nBut the risks that I have outlined mean financial policymakers do, however, have a clear interest in ensuring the financial system is resilient to any transition hastened by those decisions, and that it can finance the transition efficiently. \n\nSome have suggested we ought to accelerate the financing of a low carbon economy by adjusting the capital regime for banks and insurers. That is flawed. History shows the danger of attempting to use such changes in prudential rules - designed to protect financial stability - for other ends. \n\nMore properly our role can be in developing the frameworks that help the market itself to adjust efficiently. \n\nAny efficient market reaction to climate change risks as well as the technologies and policies to address them must be founded on transparency of information. \n\nA ‘market' in the transition to a 2 degree world can be built. It has the potential to pull forward adjustment - but only if information is available and crucially if the policy responses of governments and the technological breakthroughs of the private sector are credible. \n\nThat is why, following our discussions at the FSB last week, we are considering recommending to the G20 summit that more be done to develop consistent, comparable, reliable and clear disclosure around the carbon intensity of different assets. \n\nBetter information to allow investors to take a view \n\nAn old adage is that which is measured can be managed. \n\nInformation about the carbon intensity of investments allows investors to assess risks to companies' business models and to express their views in the market. \n\nA well-known dictum of macroeconomics is Say's Law: that supply creates demand. \n\nThis means that the act of producing new products creates income and profits that ultimately finance the demand for them. \n\nBy analogy, a framework for firms to publish information about their climate change footprint, and how they manage their risks and prepare (or not) for a 2 degree world, could encourage a virtuous circle of analyst demand and greater use by investors in their decision making. It would also improve policymaker understanding of the sources of CO2 and corporate preparedness. \n\nA carbon budget - like the one produced by the IPCC - is hugely valuable, but can only really be brought to life by disclosure, giving policymakers the context they need to make choices, and firms and investors the ability to anticipate and respond to those choices. \n\nGiven the uncertainties around climate, not everyone will agree. Some might dispute the IPCC's calculations. Others might despair that there will never be financial consequences of burning fossil fuels. Still others could take a view that the stakes make political action inevitable. \n\nThe right information allows sceptics and evangelists alike to back their convictions with their capital. \n\nIt will reveal how the valuations of companies that produce and use fossil fuels might change over time. \n\nIt will expose the likely future cost of doing business, paying for emissions, changing processes to avoid those charges, and tighter regulation. \n\nIt will help smooth price adjustments as opinions change, rather than concentrating them at a single climate \"Minsky moment\". \n\nCrucially, it would also allow feedback between the market and policymaking, making climate policy a bit more like monetary policy. \n\nPolicymakers could learn from markets' reactions and refine their stance, with better information allowing more informed reactions, and supporting better policy decisions including on targets and instruments. \n A climate disclosure task force  \nThat better information - about the costs, opportunities and risks created by climate change - can promote timely responses is not a new idea. \n\nMuch the opposite: there are already nearly 400 initiatives to provide such information. \n\nExisting schemes vary in their status (from laws to voluntary guidance); scope (from greenhouse gas emissions to broader environmental risks); and ambition (from simple disclosure to full explanations of mitigation and divestment strategies).  \n\nIn aggregate over 90 per cent of FTSE 100 firms and 80 per cent of Fortune Global 500 firms participate in these various initiatives. For instance, the Carbon Disclosure Project makes available disclosure from 5,000 companies to investment managers responsible for over $90 trillion of assets. \n\nThe existing surfeit of existing schemes and fragmented disclosures means a risk of getting \"lost in the right direction\". \n\nIn any field, financial, scientific or other, the most effective disclosures are: \n Consistent - in scope and objective across the relevant industries and sectors; \r Comparable - to allow investors to assess peers and aggregate risks; \r Reliable - to ensure users can trust data;  \r Clear - presented in a way that makes complex information understandable; and \r Efficient - minimising costs and burdens while maximising benefits. \r \n\nMeeting these standards requires coordination, something the G20 and FSB are uniquely placed to provide. \n\nThe logical starting point is a co-ordinated assessment of what constitutes effective disclosure, by those who understand what is valuable and feasible. \n\nOne idea is to establish an industry-led group, a Climate Disclosure Task Force, to design and deliver a voluntary standard for disclosure by those companies that produce or emit carbon. \n\nCompanies would disclose not only what they are emitting today, but how they plan their transition to the net-zero world of the future. The G20 - whose member states account for around 85 per cent of global emissions - has a unique ability to make this possible. \n\nThis kind of proposal takes its lead from the FSB's successful catalysing of improved disclosure by the world's largest banks following the financial crisis, via the Enhanced Disclosure Task Force. \n\nThe EDTF's recommendations, published in October 2012, were the product of collaboration between banks, analysts and investors. This has given the providers of capital the disclosures they need - specifically how banks manage risks and make profits - in a format that the banks can readily supply. \n\nThat shows that private industry can improve disclosure and build market discipline without the need for detailed or costly regulatory interventions. \n\nLike the EDTF, a CDTF could be comprised of private providers of capital, major issuers, accounting firms and rating agencies. \n \nComplementing static disclosures  \n\nStatic disclosure is a necessary first step. There are two ways its impact could be amplified. \n\nFirst, governments, potentially sparked by COP21, could complement disclosure by giving guidance on possible carbon price paths. \n\nSuch a carbon price corridor involves an indicative minimum and maximum price for carbon, calibrated to reflect both price and non-price policy actions, and increasing over time until the price converges towards the level required to offset fully the externality.  \n \nEven if the initial indicative price is set far below the \"true\" cost of carbon, the price signal itself holds great power. It would link climate exposures to a monetary value and provide a perspective on the potential impacts of future policy changes on asset values and business models. \n\nSecond, stress testing could be used to profile the size of the skews from climate change to the returns of various businesses.  \n\nThis is another area where insurers are at the cutting edge. \n\nYour capital requirements are based on evaluating the impact of severe but plausible scenarios. You peer into the future, building your defences against a world where extreme events become the norm. \n\nThis stress-testing technology is well-suited to analysing tail risks likely to grow fatter with time, casting light on the future implications of environmental exposures embedded in a wide range of firms and investments. \n\nStress testing, built off better disclosure and a price corridor, could act as a time machine, shining a light not just on today's risks, but on those that may otherwise lurk in the darkness for years to come. \n \nConclusion\r \n\n\nOur societies face a series of profound environmental and social challenges. \n\nThe combination of the weight of scientific evidence and the dynamics of the financial system suggest that, in the fullness of time, climate change will threaten financial resilience and longer-term prosperity. \n\nWhile there is still time to act, the window of opportunity is finite and shrinking.  \n\nOthers will need to learn from Lloyd's example in combining data, technology and expert judgment to measure and manage risks. \n\nThe December meetings in Paris will work towards plans to curb carbon emissions and encourage the funding of new technologies. \n\nWe will need the market to work alongside in order to maximise their impact. \n\nWith better information as a foundation, we can build a virtuous circle of better understanding of tomorrow's risks, better pricing for investors, better decisions by policymakers, and a smoother transition to a lower-carbon economy. \n\nBy managing what gets measured, we can break the Tragedy of the Horizon.", "source": "BusinessGreen"}