{"published": "2015-09-26T22:47:18Z", "media-type": "News", "title": "Family alleges foul play in Shastri's death", "id": "1400b3e5-ec6b-4837-91ff-9bb5479f1639", "content": "Under pressure to declassify files relating to the mysterious disappearance and death of Netaji Subhash Chandra Bose, the Centre faced a new demand on Saturday to do a similar act relating to former Prime Minister Lal Bahadur Shastri as his family alleged foul play behind his death. \n \nSenior Congress leader Anil Shastri, the former PM’s son, asked Prime Minister Narendra Modi to set up an inquiry commission to probe his father’s untimely death and declassify all files related to the event. The demand follows the West Bengal Government’s recent move to make public several files relating to Netaji unlocking several secrets behind his mysterious disappearance. \n \nShastri died on January 11, 1966 at Tashkent after he inked a historic agreement with Pakistan President Ayub Khan that formally ended the war between the two nations. His sudden death was attributed to a heart attack. \n \nAfter almost 50 years, his son has claimed the death was not accidental. Speaking to news channel CNN-IBN, Shastri said, “The issue I am raising today has been discussed for long that the death of Shastrji was not natural.” According to him, the truth can only be unearthed if an inquiry committee goes deep into the mystery. \n \nThere are two reasons that have made Shastri’s kin to suspect foul play in the former PM’s death. “His body had turned blue with white spots at places. Even the diary in which he used to write everything did not return along with a thermos that he used to keep all the time. It could possibly unlock the mystery of the last moments leading to his death,” said Anil Shastri, adding “I think the Modi Government should declassify files related to Shastriji and set up an inquiry committee to get to the truth as he was reportedly hale and hearty on the day he died.” \n \nThe senior Congressman alleged negligence on part of the Indian authorities at Tashkent as the room in which he stayed did not have a bell or a telephone. “I cannot say conclusively but there could be foul play. Nobody was punished and what is more shocking is the fact that both his personal physician RN Chugh and personal assistant met with accidents,” Shastri said. Intriguingly, there is another detail Anil shared that when Lal Bahadur Shastri’s wife reached Tashkent, she was not allowed to meet her husband and was told instead that he could not be traced.  \n  POST YOUR COMMENTS", "source": "New Delhi Pioneer"}