{"published": "2015-09-14T21:34:27Z", "media-type": "News", "title": "Hinton: Lydia Ko or Lisa Carrington? Kiwi successes to celebrate, not evaluate", "id": "418227e7-7e3c-4c5a-b207-dd1e2470c08a", "content": "BALINT VEKASSY/Canoe Photography    \nLisa Carrington achieved a golden double in Italy that will take some topping in the Halbergs. \n             \n OPINION The Halberg award goes to … close your eyes, grit your teeth and spit out an answer. Go on, I dare you. Lydia or Lisa? Carrington or Ko? It's the impossible question with two right answers and no wrong one. \n \nMy goodness what a time it is for Kiwi women's sport. When Lisa Carrington, the micro marvel with the sparkling smile and gorgeous guns, won two gold medals in Olympic events at the world canoe racing championships in late-August she laid down a heck of a marker. \n \nI can remember vividly a conversation with champion rower Eric Murray earlier this year in which he assured me what Carrington was achieving in her sport was every bit as impressive as what they were doing in theirs. Two golds in Olympic events, he felt, would put her on a lofty pedestal. \n \nWell, she achieved that in Italy and immediately shot to favouritism for New Zealand's female athlete of the year at the Halbergs. It would be an overdue honour, too, given the Olympic gold medallist and multiple world champion has never walked off with a gong from New Zealand's annual sporting awards. \n \nOf course she has had a certain Valerie Adams and Lydia Ko to contend with in recent years, and in the game of comparing apples with oranges with grapefruit she has been, well, narrowly pipped by two quality operators. \n \nBut after her golden double in Italy it seemed like her time had arrived. Among a group of sporting smarties not too far from the desk I call home, the consensus was only a golf major could deny her now. \n \nWell, wouldn't you know it, the magnificent Ko has gone and delivered that very outcome, achieved in sensational fashion at the Evian Championship in France. At 18 she became the youngest winner of a women's major, and her final-round bogey-free 63 was the lowest closing score in women's championship history.  It has been matched only in the men's game by Johnny Miller's epic last 18 holes to claim the 1973 US Open at Oakmont. \n \nSo now we have ourselves a water cooler sporting conversation for the summer. Ko or Carrington? You might as well argue Monet or Picasso? Jordan or James? The sublime or the majestic? \n \nThere will come a time when the merits of both achievements will have to be poked and prodded, weighed and assessed. I'm on the panel that chooses the Halberg winners and believe me, despite the opinions of some, we take these decisions very seriously indeed. \n \nBut for now let's not evaluate, let's just celebrate. Let's bathe in the glory of two fabulous New Zealand women who are not only great champions, but great people. \n \nBoth Carrington and Ko not only win, but do so with a dignity and delight that makes you proud to be a Kiwi. \n \nThere is plenty wrong in sport these days, but none of it involves either of these two brilliant competitors. \n \nWhen you consider what Lauren Boyle achieves in the truly global sport of swimming and that Adams will assuredly be back adding to her remarkable achievements as soon as she can sort her injury issues out, New Zealand really has been blessed by the accomplishments of its sportswomen. \n    \nEventually my colleagues and I will have to decide which outranks which. A golf major at the age of 18, or a double world triumph in a canoe? \n \nThat won't be an easy deliberation. Ko's achievements this year even without the major triumph have been special. Now she has the icing on her cake. \n \nBut gee, Carrington is a wonderful package of grace and grunt. \n \nNow, all we need is the All Blacks to win a certain golden trophy in England and we will really have ourselves a conversation. \n              \r     Comments", "source": "Nelson Mail"}