{"published": "2015-09-18T03:37:19Z", "media-type": "Blog", "title": "Coleen Garcia has advice for Pastillas Girl about bashers", "id": "dec597d7-7bf2-4e0c-acfa-3cb49ecee802", "content": "Coleen Garcia has advice for Pastillas Girl about bashers Push.com.ph: Coleen Garcia is now officially known as The Sexy Drama Box Office Star after the success of her first-ever titular film Ex With Benefits. As of this writing, Coleen’s movie opposite Derek Ramsay has earned more than P100 million which puts her among the ranks of other box office actresses like Toni Gonzaga, Kathryn Bernardo, Angelica Panganiban and Bea Alonzo, among others. Coleen is currently busy with the second book of her afternoon top-rating soap Pasion de Amor. On top of this, Star Cinema executives also revealed that she will part of a new film come 2016 which will have her acting opposite two leading men, who are yet to be named. Due to all these things, Coleen related during the recently-concluded thanksgiving blogger’s conference of her movie, that she rarely gets to go to It’s Showtime. Of late, the noontime variety show has been spearheading the search for a partner for Angelica Jane Yap aka “Pastillas Girl.” On the show’s Thursday episode, Pastillas Girl turned emotional over the bashing that she has been getting ever since she appeared on the noontime show. “Although I went kanina, that’s the first time to experience the whole Pastillas Girl thing. And you know she seems like a genuine person. She spoke from the heart earlier. Pero she talked about how she feels about everything. Umiyak pa siya and everything,” said Coleen. To the naysayers of the segment, Coleen stressed that, “You know none of it is scripted. What I think is if you start to disregard the entire competition between the networks, you start to see that this girl is really special. She has something to offer naman to people. She deserves where she is now.” Seeing that like her, Pastillas Girl, also received a lot of judgment without really hearing her side yet, Coleen offered some advice. “Mas mahirap sa kanya kasi hindi siya artista. So parang wala pa siyang nararamdaman na good feelings about being here sa showbiz eh bina-bash na siya,” she pointed out. “Ang advice ko sa kanya eh kapit lang, kapit lang sa Diyos kasi God is really the only one who can get you through everything.” Coleen Garcia has advice for Pastillas Girl about bashers Continue to source: Push.com.ph (article and image source) or browse other latest showbiz news articles! Showbiz topics in this article:\npastillas girl\nCategory: Latest Showbiz News /", "source": "boyabunda.net"}