{"published": "2015-09-16T15:25:13Z", "media-type": "News", "title": "Media Advisory - Great Canadian Shoreline Cleanup Celebrates Coast-to-Coast Efforts in 2015", "id": "5161797f-e3b5-408c-805e-de33a219e785", "content": "VANCOUVER, Sept. 16, 2015 /CNW/ - In 2015 so far, nearly 50,000 Canadians have registered to clean more than 1,600 shorelines through the Great Canadian Shoreline Cleanup, presented by Loblaw Companies Limited. A conservation initiative of the Vancouver Aquarium Marine Science Centre and WWF-Canada, the Shoreline Cleanup is the largest direct-action environmental program in Canada.  \n\nTo celebrate, the Great Canadian Shoreline Cleanup is hosting a series of concurrent cleanup and celebration events on Saturday, Sept. 19 at shorelines across Canada, in Halifax, Montreal, Ottawa, Toronto and Vancouver. \n\nThis year's Shoreline Cleanup runs until Nov. 30, 2015; there are still many sites across Canada in need of site coordinators and participants. To find a site to clean up or more information, visit www.ShorelineCleanup.ca. \n\nMedia are welcome to attend the celebration events. \n\nBlack Rock Beach at Point Pleasant Park \n\nSaturday, Sept. 19; 10 a.m. to 1 p.m. \n\nMedia contact: Heather Crochetiere \n\nLachine Canal/Écluses Saint-Gabriel \n\nSaturday, Sept. 19; 9:30 a.m. to 2 p.m. \n\nMedia contact: Sophie Paradis \n\n  \n\nParliament Hill Shoreline along Rideau Canal \n\nSaturday, Sept. 19; 10 a.m. to 1 p.m. \n\nMedia contact: Gayle McClelland \n\n  \n\nWoodbine Beach Park \n\nSaturday, Sept. 19; 10 a.m. to 1 p.m. \n\nMedia contact: Rowena Calpito \n\n  \n\nIona Beach Park (Richmond, B.C.) \n\nSaturday, Sept. 19; 10 a.m. to 1 p.m. \n\nMedia contact: Deana Lancaster \n\nThe Great Canadian Shoreline Cleanup is grateful for the support of its sponsors, including Loblaw Companies Limited as the presenting sponsor, Ricoh Canada as a national sponsor and OLG and YVR Vancouver International Airport as provincial sponsors. \n\nAbout the Great Canadian Shoreline Cleanup \n\nThe Great Canadian Shoreline Cleanup, presented by Loblaw Companies Limited, is one of the largest direct action conservation programs in Canada. A conservation initiative of Vancouver Aquarium Marine Science Centre and WWF-Canada, the Shoreline Cleanup aims to promote understanding of shoreline litter issues by engaging Canadians to rehabilitate shoreline areas through cleanups. www.ShorelineCleanup.ca \n\nAbout the Vancouver Aquarium Marine Science Centre \n\nThe Vancouver Aquarium Marine Science Centre is a non-profit society dedicated to the conservation of aquatic life. www.vanaqua.org \n\nAbout WWF-Canada \n\nWWF-Canada is creating solutions to the most serious conservation challenges facing our planet, helping people and nature thrive. www.wwf.ca \n\nAbout Loblaw Companies Limited \n\nLoblaw Companies Limited is Canada's food and pharmacy leader, the nation's largest retailer, and the majority unit holder of Choice Properties Real Estate Investment Trust. www.loblaw.ca \n\nSOURCE WWF-Canada \n\nPublished Sep. 16, 2015 \n\nCopyright © 2015 SYS-CON Media, Inc. — All Rights Reserved. \n\nSyndicated stories and blog feeds, all rights reserved by the author.", "source": "Virtualization Conference & Expo"}