{"published": "2015-09-11T21:19:00Z", "media-type": "News", "title": "Watch 2015 US Open Live: Roger Federer vs Stanislas Wawrinka TV and Live Streaming Information", "id": "3dafc2ee-6bb5-4965-bf6e-5b2bf9b08ec7", "content": "Roger Federer celebrates his win over Richard Gasquet in the quarterfinals of the US Open 2015 Reuters \n \nStanislas Wawrinka swept Roger Federer aside the last time the two Swiss players met in a Grand Slam, and the No.2 seed will want to get one back on his good friend when they meet in the semifinals of the 2015 US Open on Friday. \n \nFederer has played the best tennis in the men's singles so far at this US Open, swatting aside every single opponent that has come his way. Only John Isner has made Federer work for his win en route to the semifinals, but even then, the Swiss master was able to see off the American's challenge in straight sets. \n \nThe form that Federer is in was highlighted in the 17-time Grand Slam champion's demolition of Richard Gasquet, who simply had no answer to the Swiss ace's game, despite coming into the match in prime form. \n \n\"Two steps [to go for the title], but they are not [small steps]. They are like... you know what I mean. Hours of work and sleeps and waits and nerves and all that. It's still a long way. \n \n\"I feel like I'm close, of course. You enter now a territory which is very interesting, and definitely Stan is going to present the big test for me. Don't look further than that, to be quite honest.\" \n\nThe way Federer is playing, you know Wawrinka will need to produce some extraordinary tennis to stop his compatriot, but the great man feels the No.5 seed is capable of producing that kind of \"wow this is just incredible\" tennis in this semifinal of the US Open 2015. \n \n\"I believe Stan can bring it, you know,\" Federer added. \"That's my No. 1 focus, that I make it as hard as possible for him to beat me. Personally I'm very happy with the where my game is at. It's just a matter of keeping it up and adjusting to Stan now.\" \n \nIf Federer was impressive in his quarterfinal win over Gasquet, Wawrinka was just that little bit better, considering he was playing the man who knocked the stuffing out of Andy Murray – Kevin Anderson. \n \nWawrinka has not had as smooth a progress as Federer – going into the quarterfinal, Wawrinka had covered nearly twice as much distance as Federer – but that performance against Anderson will give him the confidence needed to make this semifinal a contest. \n \n\"For sure the best match of the tournament for me,\" Wawrinka said after beating Anderson6-4, 6-4, 6-0. \"I was really happy the way I play. I was focused on doing what I wanted on the match. \n \n\"I was trying to be really aggressive on the return and make him play a mix or some slice, some aggressive play from the baseline.\" \n \nWhere to Watch Live \n \nThe semifinal between Federer and Wawrinka is scheduled as the second match of the evening/night session at the Arthur Ashe Stadium. The first match -- Novak Djokovic vs Marin Cilic -- will begin at 5 pm local time (2.30 am IST, 10 pm BST).  Ten Sports will provide live coverage of the semifinal on TV, with the online live streaming option on Ten Sports Live . \n \nViewers in the US can watch Stan Wawrinka vs Roger Federer live on ESPN , while the live stream option online is on  Watch ESPN . \n \nAudience in Australia can watch the match on Fox Sports , while the US Open 2015 can also be live streamed on Foxtel Play . UK viewers can catch all the semifinal action live on Sky Sports , with the live stream option on Sky Go .  \n\nArticle Published: September 12, 2015 02:49 IST", "source": "International Business Times India"}