{"published": "2015-09-24T12:00:00Z", "media-type": "News", "title": "McPherson County football teams prepare for Week 4", "id": "3da26b5d-06be-4a0f-a6fe-610a6b1d67f8", "content": "As Matt Cole took the head coaching job looking to change the culture in Moundridge, the early schedule didn’t do him any favors. But in the first two weeks, although the Wildcats lost, playing some of the top teams in the state competitively gave reason to believe Moundridge has greatness in it. But against Bennington last week, the Wildcats couldn’t stay in the game in a 46-6 loss. “I wouldn’t call it a wake up call as much as a good old fashioned butt whippin’,” Cole said. “We knew Bennington was good and they didn’t do anything we didn’t expect them to. They just got us on our heels early and kept us there.” Moundridge will regroup and face Hutchinson Trinity in Week 4. The Celtics are coming off a 19-14 win over Inman last week. While the win for Trinity was the first of the season after fielding an almost entirely different team from an 8-2 playoff season a year ago, the Celtics present some challenges for Moundridge. And although the Wildcats have played some tough competition close, the win for Trinity is one more than Moundridge has this season. “Hutch Trinity is a good football team, and we have to play our best football to beat them,” Cole said. “When you’re 0-3 and looking for that first win of the season, there is no such thing as letting up. Hutch Trinity stands between us and that first (win), and I think our guys are eager to prove that last week was not reflective of Moundridge football. No one believes more in this group of young men than I do, and I am looking forward to seeing how they respond on the field Friday night.” The Wildcats will look for the first win of the season at 7 p.m. at Trinity. Smoky Valley gets tough homecoming test It took the young Vikings a couple of weeks to find the end zone. But when Smoky Valley finally scored the first points of the season last week, it made it a habit in a 40-20 win on the road at Haven. But there was no time to celebrate afterwards, as the Vikings prepare to host Halstead, a team that returns nearly everything from a state semifinal season last year. It is homecoming in Lindsborg, but the Dragons are no tomato can brought in to sacrifice for the good of the party. “We do not have a cupcake this week,” Smoky Valley head coach Tim Lambert said. “Halstead is very good. However, we cannot get caught up in how good they are, because ultimately we must continue to progress and get better. They are a great challenge for us and we are excited about playing such a good football team.” Page 2 of 3 - After grinding to get the offense going in the first two weeks, the Vikings erupted against Haven. Smoky Valley had 259 rushing yards in a 4-touchdown night for Kyle Anderson. The performance gave the Vikings a boost they will need when Halstead comes to town. “I think we are starting to gain some confidence and get better,” Lambert said. Smoky Valley hosts Halstead at 7 p.m. at Bethany College. Canton-Galva looks for a win streak against Life Academy Last week, the deck may have been stacked against Canton-Galva a little bit, down to 11 healthy players, and some problems making tackles in open space. But the Eagles showed up to play in a big way, beating Burrton 56-35. “The boys didn’t really step up, they are just starting to play within the system,” Canton-Galva head coach Dustin Patee said. “They are starting to believe in the system, each other, and themselves to a point that it doesn’t matter who is where, they will give their best effort.” As the Eagles look to make it two wins in a row, a speedy Life Academy stands in the way. “Word of Life’s athleticism scares me,” Patee said. “Not because it is so much better than ours, but because it will test our stamina.” With more injuries driving the numbers down to eight or nine players this week, chasing Life Academy players over all over the field will be something Canton-Galva needs to limit. But the after the way the team responded last week, the formula for the Eagles is pretty simple. “Play as a family, trust in each other, and fight until we are forced off the field,” said Patee. Inman travels to Remington, seeking first win of the year It was a gut-wrenching homecoming for the Teutons last week. Looking for the first win of the season, Inman came up just short in a 19-14 loss to Hutchinson Trinity. The loss came on the heels of a 19-8 near miss against a Bennington team that is off to a 3-0 start to the season. For the Teutons, the next attempt to get a win will be a road trip to Whitewater to take on Remington. One of these two teams will pick up the first win of the season. The Broncos are 0-3 as well, but like the Inman, have faced some steep competition, losing to Bennington, Sedgwick, and Marion. Both teams will attempt to get a win at 7 p.m. in Whitewater. Little River goes after third-straight win, hosting Udall Little River had a tough start to the year, falling to Rural Vista 46-0 in the opener. The Redskins shook it off in a big way, getting wins in each of the next two games. Page 3 of 3 - Against Centre in Week 2, Little River out dueled the Cougars in a 38-26 win. Last week the Redskins unloaded on Peabody-Burns for a 32-6 win. In Week 4, Little River will have a chance to make it three wins in a row, and start its homecoming party, hosting Udall. But the Eagles will not be ready to roll over for the Redskins. Udall enters the game at 2-1 as well. The Eagles started the season with a dominant 46-0 win over Norwich, before falling to Caldwell 52-24. Last week Udall got back on track with a 56-26 win over Oxford. The teams will tangle at 7 p.m. in Little River for the Redskins’ homecoming. Contact Mike Mendez at mmendez@mcphersonsentinel.com and follow him on Twitter @MendezSentinel.", "source": "McPherson Sentinel"}