{"published": "2015-09-03T22:14:03Z", "media-type": "News", "title": "85° F Scattered Clouds Feels Like: 85° F Wind: 5 Humidity: 24% Dewpoint: 44° F Sunrise: 6:40 AM Sunset: 7:30 PM", "id": "449bb8d6-8620-40e9-8301-fb628410ee9a", "content": "Amber Alert issued for missing 4-year-old boy      [embedded content]  Today's Regional Weather Forecasts         ABQ - Rio Rancho East Mtns Santa Fe Northwest NM Southern CO Northeast NM Southwest NM Southeast NM Extended Forecasts \r   [embedded content]        \n  Tropical moisture from tropical storm Kevin is going to be drawn into New Mexico over the next few days.   This will bring the chance for … \n   \n   \nTHURSDAY: With a little help from Tropical Storm Kevin, moisture streaming north into southern New Mexico will help give way to scattered to… \n    \nShowers and storms will ramp up to end the week, especially across western and central New Mexico. A weak disturbance will move through the … \n    Regional Radar \r   [embedded content]     \n  \n     \nWEDNESDAY: Another round of afternoon storms and showers is likely for western and northern New Mexico. Heavy rain, gusty winds and frequent… \n    \nShowers and storms will continue Wednesday afternoon, but not to the extent we’ve seen the past two afternoons. The Gila and Northern Mounta… \n    \nTUESDAY: Today will look and feel very similar to what unfolded on Monday – expect high temperatures to climb well into the 70s, 80s and 90s… \n    \nShowers and storms will continue over the north and west through at least the evening hours. Expect the showers to diminish and clearing ski… \n    \nMONDAY: Afternoon temps will warm well into the 70s, 80s and 90s — areas further to the south & east will be the warmest in the mid-90s. Spo… \n    \nAnother hot day in Albuquerque with highs topping out in the lowers 90s.  So the disappointing, hot and dry August continues in its final da… \n    \nGusty showers rolled across parts of Albuquerque Saturday afternoon but most of this activity is coming to an end.   Skies will be clearing … \n    \nShowers and storms will continue across eastern New Mexico Friday evening as a cold front pushes across the state. Eventually, the showers a… \n    \n  Rain chances return this afternoon thanks to a cold front that has moved into eastern New Mexico.   This front won’t drop temperatures too… \n    \nFRIDAY: Afternoon temperatures will be similar to Thursday with most of the state warming well into the 70s, 80s and 90s. A cold front will … \n    \nExpect the active weather to continue over the next several days with various forms of moisture reaching New Mexico. Tonight some showers an… \n    \nExpect the active weather to continue over the next several days with various forms of moisture reaching New Mexico. \n    \n  Storms will redevelop this afternoon as we continue to draw in moisture around an area of high pressure and a weather system to our north.… \n    \nTHURSDAY: Pockets of light rain are pushing northeast across central and northern NM this morning, with mostly to partly cloudy conditions f… \n    \nMoisture will continue to sit over the state for the next few days fueling daily rounds of thunderstorms. \n    \nWEDNESDAY: Weak morning showers will give us a taste of what’s to come this afternoon and storm chances rev up after noontime. Widespread sh… \n    \nHigh pressure shifting to eastern New Mexico will allow more moisture into the state in the next few days. \n    Page 1 of 76 1  2  3  4  5  6  7  8  9  10  ...  76  >       \n   \nFull Weather Forecast    \n  Tropical moisture from tropical storm Kevin is going to be drawn into New Mexico over the next few days.   This will bring the chance for … \n     [embedded content]   Weather Watches & Warnings       Flood Storm Convective Wind Drought  \n   \nAdvertisement", "source": "KRQE"}