{"published": "2015-09-30T14:20:38Z", "media-type": "Blog", "title": "Pick Your Own Pumpkin This Fall In Arkansas.", "id": "33a4c16a-62d6-4725-8805-51406b6a8d2e", "content": "Looking for a place to pick out your pumpkin and celebrate fall? Here are some of the many Arkansas pumpkin patches you may want to check out.\nAugusta. Peebles Farm and Pumpkin Patch. This is the big one… where the 20 acre corn maze is cut into a decorative design every year. There are 60 acres of pumpkins, so no running out here. Enjoy a stroll through three acres of sunflowers, Explore a cotton patch or get on the hayride. September 26th- November 2nd, Monday – Thursday 9 a.m. – 6 p.m., Friday – Saturday 9 a.m. to 10 p.m., Sunday noon to dusk. Highway 64 between Augusta and McCrory * (870) 919-6162 * PeeblesFarm.com.\nClarksville: Cox Berry Farm. Pick-your own pumpkins and apples while they’re available, plus a pumpkin fun trail for the kids. Hours vary (call first). 1081 Highway 818 * Clarksville * (479) 754-3707 * CoxBerryFarm.com.\nLittle Rock: Asbury’s Pumpkin Patch at Asbury United Methodist Church. Pumpkins and photo ops abound at this church on Napa Valley Road in West Little Rock. Pumpkins are $10-15 each. A special festival on October 11th is free to the public and includes a children’s festival and chili and dessert cook-off. October 4th-31st, Monday-Friday 11a.m.-6 p.m., Saturday 10 a.m.-5 p.m., Sunday noon – 5 p.m. 1700 Napa Valley Road * Little Rock * (501) 225-9231 * Asbury-LR.org.\nLittle Rock: Big Rock Fun Park. Pumpkin patch and corn maze, hay rides and a new tepee and barn to explore are part of the added attraction at this southwest Little Rock adventure park and mini-golf course. September 26th-November 2nd, Tuesday and Thursday 10:30 a.m. – 3 p.m., Friday and Saturday 10:30 a.m. – 6 p.m., Sunday 1-6 p.m. 11411 Baseline Road * Little Rock * (501) 455-3750 * BigRockFunPark.com.\nLittle Rock: Motley’s Pumpkin Patch. Since 1982, families have been heading out to this old favorite for the petting zoo, wagon rides and pig races. Peruse the goods in the country store and dig into an authentic caramel or cinnamon apple. And here’s where to get your autumn fudge. September 26th – November 1st, Saturday and Sunday 9 a.m. – 6 p.m. and by appointment. 13724 Sandy Ann Drive, * Little Rock * (501) 888-1129 * MotleysPumpkinPatch.com.\nLittle Rock: Hay Days at Wildwood Park for the Performing Arts. Enjoy arts and crafts and all sorts of games for the kids, plus hayrides and a pumpkin patch. October 17th-31st, Saturdays noon – 4 p.m. and by appointment. 20919 Denny Road * Little Rock * (501) 821-7275 * WildwoodPark.org.\nLonsdale: Garner Homestead Family Farm. Pan for fool’s gold, hunt for arrowheads, enjoy a playground of tire swings and tunnels and roam through cornfield trails. This autumn celebration includes a show where the animals are the stars. Get your pumpkin here, too. September 29th – November 7th, Tuesday – Saturday 10 a.m. – 4 p.m. 1376 Highway. 128 (Hot Springs Village Cutoff) * Lonsdale * (501) 463-0510 * GarnerHomesteadFamilyFarm.com.\nMalvern: Family Farm Fall Harvest and Pumpkin Patch. Hay tunnels, hay rides, farm animals, fishing and more at this local favorite. Take a zipline over the campgrounds, ride the train or go sliding down a mountain. And yes, there are pumpkins, too. October 3rd-31st, 9 a.m. – 5 p.m. 18448 Highway 67 * Malvern * (501) 337-4171 * FamilyFarm.org.\nQuitman: U-Pick Pumpkin Patch. Arkansas Frontier runs this site each year, which covers a lot more than pumpkins. Learn about the lives of early Arkansas settlers and natives. There’s a schoolhouse, covered wagon, barn and homestead. The kids will enjoy meeting the animals, sifting for gemstones and digging for dinosaur eggs. October 1st-31st, Monday-Friday 9 a.m.-2 p.m. by appointment, Saturdays 9 a.m.-5 p.m. open to the public. 1625 Wesley Chapel Road * Quitman * (501) 589-3122 * arkansasfrontier.com.\nPiggott: Pumpkin Hollow. You’ve seen those Arkansas commercials with all the kids in the pumpkin patches? This is where it’s filmed. Acre after acre of pumpkin patches and corn mazes, hayrides, haunted attractions and much more. September 19th – October 31st, Monday – Saturday 9 a.m. – 6 p.m., Sunday 1-6 p.m. 671 County Road 336 * Piggott * (870) 598-3568 * PumpkinHollow.com.\nRoland: BoBrook Farms. Out by Pinnacle Mountain, your kids can enjoy not only a hay maze but a sunflower maze as well. There’s a hay mountain to climb and a corn pit to dive into, and plenty of farm animals to play with. Pumpkins are grown on-site. October 1st – November 1st, Monday – Friday 9 a.m. – 5 p.m., Saturday and Sunday 9 a.m. – 6 p.m. 3810 Combee Lane * Roland * (501) 519-5666 * BoBrookFarms.com.", "source": "Tie Dye Travels with Kat Robinson"}