{"published": "2015-09-21T20:33:29Z", "media-type": "News", "title": "Leading Democrat admits abortion isn’t ‘women’s health’", "id": "e5eee6e8-bb26-451c-b902-de744f56e284", "content": "( LifeSiteNews ) -- The Vatican is reportedly taking offense to Barack Obama’s decision to invite a bevy of controversial guests -- such as a pro-abortion nun, an openly homosexual Episcopal bishop, and gay activist Catholics -- for next week’s papal visit to the White House. \n \nThe Wall Street Journal reports that an unnamed senior Vatican official said the Holy See fears that any photos of Pope Francis at next Wednesday’s White House welcoming ceremony with Obama’s guests that openly flout Church teaching could be taken as support for their actions. \n \nAmong the Obama administration invites are dissenting, activist Catholic nun Sister Simone Campbell, openly homosexual retired Episcopal bishop Gene Robinson, a transgender woman and a homosexual Catholic blogger. \n \nSister Campbell is executive director of the social justice group NETWORK and pro-abortion leader of the \"Nuns on the Bus\" campaign. She is seen as having undermined the U.S. Bishops’ concern over Obamacare’s abortion component when the controversial health care takeover was being debated five-and-a-half years ago. \n \nHer Network organization, widely regarded as having radical feminist leanings, was investigated by the Vatican over the group’s refusal to observe Catholic teaching on abortion, human sexuality and women’s ordination. The investigation concluded earlier this year, resulting in minimal repercussions for the group. \n \nRobinson, who “divorced” his homosexual partner last year, and is a senior fellow for the liberal think tank Center for American Progress , has been invited to religious events in the past by Obama, leading a prayer at the president’s 2009 inauguration and taking part in the 2014 National Prayer Breakfast. \n \nAlso invited are Mateo Williamson, a biological woman who identifies as a man and a former co-chair of the Transgender Caucus for the pro-homosexual activist  group Dignity USA; and Aaron Ledesma, author of the blog “The Gay Catholic.” \n \nClick \"like\" to support Catholics Restoring the Culture!  \n \nThe i nvitation organizer for the White House papal event is Vivian Taylor, executive director of the national LGBT advocacy arm of the Episcopal Church, and a biological male. \n \nThe unease caused by the guest list demonstrates Catholic concerns, including that of many bishops, the WSJ report said, that the Obama administration is using Pope Francis’s visit to underplay its differences with the Church on controversial issues such as homosexual “marriage,” abortion and the Obamacare contraception Mandate. \n \nU.S. Vatican Ambassador Ken Hackett , named  by Obama  to his post in June 2014, said last month that Pope Francis and Obama are not going to waste time discussing any differences they may have. Rather, they will choose to focus on issues where they see eye-to-eye. \n \nAccording to Hackett these areas are poverty, religious freedom, concern for persecuted Christians and minorities, and peace. \n \n“Then climate, of course,” Hackett said. \n \n“We agree to differ on things like gay marriage,” he said, “but really there are not a lot of other such issues.” \n \nPope Francis will visit the U.S for the first time September 22-27. In addition to visiting the White House, he will address a joint session of the U.S. Congress and the U.N. General Assembly, before appearing at the World Meeting of Families in Philadelphia.", "source": "LifeSite"}