{"published": "2015-09-10T06:05:24Z", "media-type": "News", "title": "Will Speak Fondly bloom for Gai Waterhouse in the Golden Rose?", "id": "732ab564-c884-4d85-b66a-33b8370a5737", "content": "One of racing's great anomalies is how Gai Waterhouse hasn't managed to win a Golden Rose? One of racing's great anomalies is how Gai Waterhouse hasn't managed to win a Golden Rose? Granted, in racing terms the ink is barely dry on the group 1 sign-off - and the event itself is only a little over a decade old - but Tulloch Lodge have annexed five Golden Slippers in the same period.\n\nHowever transitioning those autumn two-year-olds into an early spring three-year-old for Sydney's first major of the carnival seems to have flummoxed the trainer who gets it right more often than not.\n\nHaving lost Slipper hero Vancouver for the $1 million Golden Rose - and indeed the balance of the spring carnival - Waterhouse has hauled Speak Fondly, the only filly in the field and an also-ran in the Slipper, from her deep reserves to try to break the duck at Rosehill and hand Gooree Stud back-to-back wins in the race.\n\nCynics suggest her failure in the Slipper directly contributed to Vancouver's success, providing a three-wide trail for the colt to surge to victory under Tommy Berry.\n\nBut behind Speak Fondly in the Slipper was Golden Rose favourite Exosphere, whose excuse was a more than worthy one via cardiac arrhythmia.\n\nJudging by his walloping of his Run To The Rose rivals when resuming as a three-year-old last start, $3 favouritism is worthy. The nagging doubt? Both his career failures have come on firm tracks - and a good (3) is tipped at Rosehill.\n\nStill, there are cases for others. Speak Fondly ($4.60), brandishing the Waterhouse bone-and-muscle and third-up, should be able to dictate and needs only to see out the Rose's 1400-metre route to be in the finish.\n\nWith the services of fly-in Hong Kong-based Brett Prebble, who has won a Golden Slipper, a Melbourne Cup and an Australian Guineas doing so in the past few years, she has already been well backed.\n\nYet the only group 1 winner in the field, Press Statement ($3.60), looks the top play here. His return in the Run To The Rose was super, an extra 200m looks right up his alley and Tye Angland can stalk who he pleases from the good gate.\n\nIt might be worth saving on Gold Symphony ($21) at each-way odds, aided by a rails draw in a race where tactics will be all important.\n\nThe tempo might be far more genuine in the group 1 Makybe Diva Stakes at Flemington, where Australia's weight-for-age dearth has left a familiar cast.\n\nBoban ($4.40) is back, Fawkner ($6) returns and Happy Trails ($12) - a Flemington specialist - keeps humming along, but what price for a couple of emerging stars to finally arrive on the scene?\n\nHi World and Volkstok'n'barrell (both $11) appeared likely after encouraging Memsie Stakes runs, but car park draws render their hopes better on a later day.\n\nOwing to a badly-needed shake-up at the top level, the supremely talented Alpine Eagle ($7) goes on top. Without winning, you don't make much more impressive returns than his Adelaide effort and clockers have been enamoured with his recent work.\n\nThe Cox Plate beckons.\n\n*Odds courtesy of Ladbrokes The story first appeared on Brisbane Times.", "source": "The Stawell Times-News"}