{"published": "2015-09-15T20:27:00Z", "media-type": "News", "title": "Visual Lease - The tsunami of coming FASB/IASB lease accounting changes", "id": "e6610096-0c70-40c9-9d52-f9edccca8d61", "content": "WOODBRIDGE, N.J. , Sept. 15, 2015 /PRNewswire/ -- The Financial Accounting Standards Board (FASB) and its international counterpart, the International Accounting Standards Board (IASB) , are expected to release their final respective versions of the Lease Accounting Standards by the end of 2015, with implementation required by 2017-2018.  The IASB is expected to release soon, and the US Board is expected to follow suit by the end of this year.  The Standard requires lessees to record all real estate and equipment leases of more than one year on the balance sheet as liabilities, with corresponding assets called \"Right of Use\" (ROU) assets.  The impact of this accounting standard change will have a profound impact on a company's capital structure, leasing practices and operational processes. In fact, it has been estimated that the accounting change will add $1.35+ trillion of assets and liabilities to company balance sheets. \n\nThe new standard will require significant work for US corporations and any entity reporting on a GAAP basis.  All leases will have to be analyzed to determine their current ROU and liability values, and such calculations will have to go back three years to stay compliant with Security and Exchange Commission (SEC) regulations.  Interestingly, in a recently published survey by IBM, 92% of companies surveyed indicated that they were not prepared to implement the Standard, either in terms of lease information systems, employee training or leasing practices and policies. \n   \n\"This is a fundamental shift in how we account for real estate assets.  Although the exact details of the lease accounting standard changes are yet to be seen in their final form, most of the elements have now been defined, and companies already should be collecting the data needed to generate the required entries.  With everything that needs to be done, companies that wait until the last minute will certainly regret not acting sooner,\" says Michael Bell , Senior Advisor at Visual Lease.  See Visual Lease's whitepaper, \" The Lease Accounting Tsunami; Are You Prepared to Weather the Storm? \" \n\nAccording to Michael, some of questions you should be asking now to get prepared for the transition include: \nHow does the new standard affect the current lease portfolio?  Specifically, what is the total asset value (ROU) and liability value after recalculating the company's lease portfolio? How will these new values affect the company's key financial indicators such as ROA (return on assets), debt to equity ratio, and related taxes? How should future lease/buy decisions change in light of the new standard? What portion of the lease portfolio will be impacted by the international standards, which differ slightly from the US FASB standard?   What data elements and system enhancements are needed to the company's lease management system, lease accounting processes and personnel training to comply with the new standard?   \n\"In order to ensure that our clients have the most up-to-date analytical capabilities, Visual Lease's FASB functionality will capture all of the needed data elements and perform all the required analyses.  In fact, we built this two years ago when FASB issued its first Exposure Draft, but put further development on hold because FASB was not clear on its final direction,\" says Derek Anderson , Managing Director of Visual Lease.  \"Now that FASB is close to issuing the Standard, we are completing our development work.  But for us, not only must it work properly, it has to be as easy to use as the rest of the system.  We know that simplicity and clarity are two of Visual Lease's most important differentiators.  The FASB changes can be no different.  Visual Lease's FASB functionality will be clean, easy and effective.\"  \n\nThe new FASB lease accounting changes in Visual Lease will include: \nIdentification of the financial impact of the changes on the portfolio Automated identification of Type A and Type B leases Portfolio reporting under both FASB and IASB rules Automation of the generation of ROU and liability entries for the general ledger \nAdditionally, Visual Lease will work with its clients to help them identify the impact of the changes as well as strategies for mitigation and accommodation.  Marc Betesh , Founder and CEO of Visual Lease, added \"Our 30 years of lease accounting expertise will provide a critical advantage for our clients.  We understand how the new Standard should optimally fold into existing processes, as not only were we direct FASB roundtable participants, but we've been working with lease accounting since well before any of the lease management systems were developed.\"  \n\nAbout Visual Lease \n\nVisual Lease's mission is to facilitate efficient administration and exact compliance of real estate obligations through world-class software and customer service. We are committed to being real estate experts by staying in front of industry and technology trends while continually refining our products and services. The values driving us are excellence, diversity, dedication and passion.  \n\nVisual Lease was founded by the principals of  KBA Lease Services  in 1995.  Since its inception, Visual Lease has served businesses with portfolios of leases ranging from 15 to over 6,000.  Our tagline, \"Lease Software by Lease Professionals\" is a source of pride based on our industry-leading expertise in commercial real estate and lease administration.  No other company offers Visual Lease's breadth of experience.  \n\nFor more information or to schedule a demo, please visit www.visuallease.com or call us at 888-876-6500. \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/visual-lease---the-tsunami-of-coming-fasbiasb-lease-accounting-changes-300143517.html \n\nSOURCE  Visual Lease", "source": "Wall Street Business Network"}