{"published": "2015-09-29T02:39:02Z", "media-type": "News", "title": "United banking on Martial arts for European goals", "id": "f1a26c33-9225-44e1-9bf5-c6900dc7e8fb", "content": "Reuters  –  \nLONDON (Reuters) - Manchester United will bank on the dazzling form of Anthony Martial in Wednesday's Champions League game against VfL Wolfsburg as Louis van Gaal's men look to bounce back from their opening defeat in Group B. \n \nThe 19-year-old Frenchman, initially seen as a panic buy on the last day of the transfer window this month, has been a revelation, netting four times since leaving Monaco to help United top the Premier League for the first time in two years. \n \nThe Old Trafford club lost their first Champions League match 2-1 to PSV Eindhoven in a game overshadowed by the broken leg suffered by Luke Shaw but have since won 3-2 at Southampton and beaten Sunderland 3-0. \n \nWayne Rooney scored his first league goal of the campaign against Sunderland and with Martial providing pace and composure up front, Van Gaal’s attacking worries are receding. \n \n\"He (Martial) is very direct, he is willing to take on players and he is willing to take on that risk,\" said United defender Chris Smalling. \n \n\"I think, in the final third, it is an area where you can take that risk because you can't take it at the back. He looks a very sharp player.\" \n \nGoalkeeper David de Gea has also been in fine form after signing a new contract while Smalling and Daley Blind have formed a solid central defensive pairing and Morgan Schneiderlin and Bastian Schweinsteiger have added experience and craft to the midfield. \n \nAIM HIGHER \n \n\"We have improved,\" Smalling said. \"Last season’s start was disastrous and it didn't give us a foothold to be able to challenge for anything. \n \n\"We know we have improved in this section of the season and we now have to improve in each other section compared to last season and aim a lot higher.\" \n \nWounded Wolfsburg, who drew 1-1 with Hanover 96 on Saturday after being crushed 5-1 by Bayern Munich last week, are likely to be without midfielders Luiz Gustavo and Vieirinha. \n \nBrazil international Luiz Gustavo was taken off midway through their demolition at Bayern with a knee injury and coach Dieter Hecking says his chances of playing in Manchester \"don't look good\". \n \nPortuguese Vieirinha has returned to training after a three-week break caused by a thigh injury but the game at Old Trafford could come too soon for him. \n \nThe Wolves, who won their opener against CSKA Moscow, are looking to take control of the group. \n \n\"We have worked very hard to get here and experience games like the one at Manchester United,\" said captain Diego Benaglio. \"So we want to look really good there and we are certainly not going to England just to look at the stadium.\" \n \n(Writing by Karolos Grohmann, additional reporting by Ed Osmond, editing by Tony Jimenez)", "source": "Yahoo! India"}