{"published": "2015-09-13T19:33:12Z", "media-type": "News", "title": "Statewide: Western region, September 2015", "id": "af56d0db-ea5d-4843-b356-f70326dc41a2", "content": "Back to September 2015 home page \n\n \n\r \nSTATEWIDE Western Region \r Think global, buy local \n\r \n  \n\n    Downtown Asheville is filled with funky shops such as LOFT, short for \"lost objects, found treasures.\" \n\n \n\nAsheville has a unique character, with its dozens of locally owned shops and restaurants drawing more than nine million tourists annually. Now, fears that national retailers are ready to pounce on the central business district are prompting talk of a possible ban on chain stores. The controversy stems from plans by Anthropologie, which sells women’s clothing and home decor items at more than 200 stores, to add a shop on North Lexington Avenue. It would join a store owned by its Philadelphia-based parent company, Urban Outfitters, which is among a handful of chains in the downtown area. Almost 90% of downtown Asheville’s businesses employ fewer than 20 people. To preserve that local flavor, Asheville Downtown Commission member Rebecca Hecht started an online petition urging officials to either regulate or place a moratorium on chain stores downtown. “Allowing large chain and formula stores downtown will eliminate the unique appeal at the core of Asheville’s identity,” the petition says. “These types of businesses will erode what we value as a community and patina our image of a city that supports small business.” Supporters worry that downtown Asheville could resemble King Street in Charleston, S.C., a haven for national retailers. “As Asheville grows, we ought to put measures in place to protect and grow our local businesses, retain and strengthen our neighborhoods and put our locals first,” Franzi Charen, director of Asheville Grown Business Alliance, wrote in an email to supporters. Her group promotes local companies. The love-the-locals effort faces a stumbling block in state laws that limit the ability of municipalities to add zoning restrictions on chains. Another issue is how to define a chain. Downtown Asheville doesn’t have a Starbucks — the Seattle-based giant has chosen not to open a store there — but some businesses have other locations, including Tupelo Honey Cafe, Kilwins chocolate shop and Mast General Store, says Meghan Rogers, director of the Asheville Downtown Association. The city council hasn’t taken up the issue. Rogers cites better parking, a grocery store and more retail choices as top needs for downtown. While the association has not taken a side on the issue of restricting chains, she agrees that the local focus is popular. “I think a big reason people enjoy downtown Asheville is that it is different.” \n \nBriefs \n \nASHEVILLE  — HomeTrust Bancshares will close three branches in North Carolina and three in Tennessee by October in order to cut expenses. The bank, which had assets of $2.6 billion as of June 30, will operate 39 branches in the Carolinas, Tennessee and Virginia after the closures. \n \nASHEVILLE   — Moogfest , the electronic music and technology festival held here since 2008, will become a biennial event and move to Durham in May 2016. The event generated nearly $14 million in Buncombe County in 2014, but organizers lost $1.5 million. \n \nFRANKLIN — Macon Bank, a subsidiary of Entegra Financial , will acquire two branches in upstate South Carolina from Union, S.C.-based Arthur State Bank. Entegra, which operates 11 branches in western N.C., will have assets of about $1 billion when the deal closes, probably in the fourth quarter. The bank also plans to convert a loan-production office in Greenville, S.C., to a full-service branch this fall.", "source": "Business North Carolina"}