{"published": "2015-09-21T18:28:53Z", "media-type": "News", "title": "William urges Wales to beat England - to keep Harry quiet", "id": "08cc042e-1da0-47d5-8677-25d1e3ecee09", "content": "The Duke of Cambridge has urged the Welsh rugby team to beat England on Saturday - to keep his brother quiet. \n \r\n\t\t\r \nWilliam, vice patron of the Welsh Rugby Union, told the Welsh players at their Rugby World Cup welcome ceremony at Guildhall in London: \"Unfortunately, I will be watching you with my brother, so I will need a Wales win more than ever!\" \n\r  The Duke of Cambridge has a laugh with Welsh star Jake Ball during the welcome ceremony \r \r \nPrince Harry holds a similar role with the Rugby Football Union. The teams clash in a Pool A game at Twickenham on Saturday evening. \n\r\n\t\t\t\r \nWilliam courted controversy after the Welsh team sang traditional folk song Lawr ar lan y mor, when he joked: \"Thank God the Welsh team play rugby better than they sing.\" \n\r\n\r\n\r\n\r \nHe presented the team with their caps for taking part in the tournament and said: \"It is a great achievement for all of you to be here, whether as players, management or support staff. \n\n\"It will have been a long, arduous road for many of you to get the opportunity to represent your country at a World Cup. I know you will all be fearsomely proud of being a part of this team. \n\n\"All of your sacrifices, pain and Herculean efforts are about to be rewarded with the chance to make history in Cardiff and London over the next six weeks. \n\n\"Whilst we have been dealt a very tough group stage, I firmly believe that, with a simple, determined, match-winning mind-set, this team can progress into the knockout stages and beyond.  I look forward to having plenty to cheer about throughout the tournament.\" \n\r\n\t\t\t\r \nHe referred to the 54-9 victory in their opening match against Uruguay and said: \"We now need to look to the rest of the group and particularly this Saturday's match. This will be one of the biggest clashes of the tournament and certainly of the group stages.\" \n\nHe added: \"I wish you all the best of luck and I look forward to supporting you every step of the way. Cymru am byth! (Forever Wales!)\" \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Thame Gazette"}