{"published": "2015-09-17T01:43:03Z", "media-type": "News", "title": "Scenes from the early debate", "id": "80c71a03-f615-4807-b815-f4947865b96f", "content": "Republican debates: The undercard \n\nFour Republicans running for President stand on stage before the first of two debates Wednesday, September 16, at the Reagan Presidential Library in Simi Valley, California. From left to right are former New York Gov. George Pataki, former U.S. Sen. Rick Santorum, Louisiana Gov. Bobby Jindal and U.S. Sen. Lindsey Graham. \n\nHide Caption \n\n1 of 7 \n\n Republican debates: The undercard \n\nGraham speaks during the first debate, which was held for the lowest-polling candidates at this point in the campaign. \"Thanks CNN for having people at this debate,\" Graham joked -- a reference to Fox News not having an audience for the second-tier debate last month. \n\nHide Caption \n\n2 of 7 \n\n Republican debates: The undercard \n\nPataki makes a point during the debate. \n\nHide Caption \n\n3 of 7 \n\n Republican debates: The undercard \n\nSantorum clashed with Graham on immigration early, and he also had a spirited debate with Pataki over Kim Davis, the woman who refused to issue marriage licenses to same-sex couples in Kentucky. \n\nHide Caption \n\n4 of 7 \n\n Republican debates: The undercard \n\nJindal answers a question during the debate. At the beginning, he told moderator Jake Tapper that he didn't violate the so-called \"11th Commandment\" of not going after your own party in his attacks on Donald Trump. \"Let's stop treating Donald Trump like a Republican,\" Jindal said of the Republican front-runner. \"He's not a conservative, he's not a liberal ... he believes in Donald Trump.\" \n\nHide Caption \n\n5 of 7 \n\n Republican debates: The undercard \n\nPataki stands on stage during preparations for the debate. \n\nHide Caption \n\n6 of 7 \n\n Republican debates: The undercard \n\nSantorum enjoys a light-hearted moment before the debate. \n\nHide Caption \n\n7 of 7", "source": "CNN Money"}