{"published": "2015-09-04T21:35:05Z", "media-type": "Blog", "title": "Group Accuses Obiano Of Favoritism In Appointment And Allocation", "id": "4ec124b4-4a7d-4005-8d9f-d672ac6574a0", "content": "Sponsored. A group, Anambra State G177, has accused the governor of Anambra State of favoritism and trying to allocated all Nigeria police recruitment slot for the state to his native town.\nThe governor, who is from Aguleri town in Anambra State have been accused of favoring his town in appointments and allocation of the state's resources.\n\nIn a release sent to newsmen, signed by its Coordinator, Ikechukwu Emeka Onyia and Secretary, Chidi Arinze,the group called on members of the state house of assembly to ensure that the  injustice is address or they will face massive recall from the electorates.\n\nThe press release reads;\nWe uncovered plot by the governor of Anambra State, Willie Obiano to allocate 270 slots given to the state by Nigeria Police to natives of his home town, Aguleri as he did in Nigeria Army recruitment and other appointments in the State.\n\nAfter consultation across Anambra towns on this issue, we resolve as follows :\n\nThat we are taking it to our representatives in the State House of Assembly .\n\nThat members of State House of Assembly are the people's elected representatives and they are mandated to represent our people in the affairs of our state .\n\nThat Anambra State is made up of 177 towns with 30 members of Assembly representing them and since we are allotted 270 police recruitment slots , every town in Anambra must get one slot at least !\n\nWe also set up machineries across towns to follow this process in order to drive fairness and result .\n\nWe also agreed that an Honourable member that is representing any of the towns denied a slot in this upcoming recruitment will face well coordinated recall from the House of Assembly by the people .\n\nAny town denied a slot, will be termed mark of poor representative on the part of whoever that is representing such town in the House of Assembly .\n\nAnd we shall push for the first ever successful recall in Nigeria.\n\nAlso resolved to see to a fair Anambra State where all the town will feel the impact of the government.\n\nWe agreed that people are the engine room of democracy and that they have role especially as it concerns raising issues on public policies and suggesting alternative policies for the better Anambra State.\n\nWe therefore call on 30 members of Anambra House of Assembly not to take Anambra People's silent as a sign of weakness. Correct this ongoing imbalance through parliamentary intervention or face mass recall, the press statement concluded.", "source": "Ouchfrandib Post........!  The Info You Crave!"}