{"published": "2015-09-01T19:47:17Z", "media-type": "News", "title": "Paul Burrell heading for Celebrity Big Brother house", "id": "097c5049-f0bf-4040-9c0e-e7e4224f00ec", "content": "Diana, Princess of Wales's former butler Paul Burrell will be teaching Celebrity Big Brother housemates how to provide service worthy of the royal family when he enters the house tonight. \n\nBurrell will be spending a few days in the house, teaching the American contestants how to be good servants to the British housemates who have become Big Brother's royal family.\n\n\"That's something they may not understand, but to be a servant is not to be servile ... it's to be proud, to want to serve, to have a passion,\" he told the Press Association. \n\n\"I was proud to serve the Queen and Princess Diana. I hope they'll get something of that from me.\"\n\nAsked whether he finds it difficult to talk about Diana, who died following a car crash 18 years ago, he said: \"I think it's part of my life and I think when you lose someone dear to you, no matter who it is, you carry them with you for the rest of your life... a piece of them stays with you. \n\n\"I was lucky to be with the Queen and Princess Diana, and because of Princess Diana's tragic passing, I still carry some of her with me, and I carry what she taught me with me.\n\n\"They are inspirational human beings. I was lucky to stand by an icon of our times, so for me it's an honour and a privilege to be able to speak first-hand about someone I knew so well.\n\n\"I don't have a problem with that, other people might, I don't. You know, I think it's time someone did stand in Princess Di's corner, she's been gone 18 years.\"\n\nHe said he was \"passing on knowledge\" of her to a younger generation, adding \"so that's a privilege\".\n\nTalking about the Celebrity Big Brother contestants, he said he was \"transfixed by the American women\". \n\n\"There's a trio of 'bootiness' - Jenna (Jameson), Janice (Dickinson) and Farrah (Abraham) - I mean they are incredible characters. I love people and I'm going to make a beeline for Janice, because she's had such an incredible career and survived it,\" he said.\n\nOf the UK contestants he said he thought Gail Porter was a \"fascinating, dark horse\".\n\n\"I think she's shied away into the background and I think she's a kind, generous, sweet person.\"\n\nBurrell admited he was \"apprehensive\" about going into the house \"because it's a totally alien experience\" but would not be afraid to voice his opinion: \" I can't manage a royal household without having an opinion and you can't be in the Big Brother House without having a strong character.\" \n\nHe added: \"I have met some of the world's most important people - kings and queens, presidents and first ladies, movie stars and the Pope. I wasn't intimidated by them, so I won't be intimidated by the people in the Big Brother house.\n\n\"I know I'm not going to be liked by everyone because no-one is, but I'm not a quitter. I like a challenge. I love people. There are some great characters in this house and there are people who I wouldn't normally meet in my life.\"\n\nCopyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Grantham Journal"}