{"published": "2015-09-03T16:42:01Z", "media-type": "News", "title": "AirBridgeCargo Airlines debuts at Singapore Changi Airport with direct freighter flights from Moscow", "id": "b1bb5428-aef4-41e6-aad9-d0a3750b01aa", "content": "Sep 03, 2015 01:36 pm  \n Air Freight   \n   \n \nChangi Airport Group (CAG) welcomes AirBridgeCargo Airlines (ABC) to Singapore Changi Airport, with its inaugural flight from Moscow, Russia, scheduled to arrive tonight. The international freighter carrier, which is part of Russia-based Volga-Dnepr Group, is launching twice-weekly Moscow-Singapore-Hong Kong-Moscow services with a Boeing 747-8F aircraft. ABC’s new services to Singapore establish Moscow as a new freighter city link for Changi Airport, and strengthen Changi Airport’s connectivity to Russia and beyond. \n\r \nThe new dedicated cargo services to Singapore will facilitate the movement of cross-border shipments and enhance the country’s product offerings for its customers in Asia. With the addition of Singapore, which is ABC’s ninth online station in Asia, the airline will now provide over 500 weekly delivery solutions from the region, all with a delivery time of below 48 hours including handling procedures. The airline already has a diverse business portfolio in the region, connecting clients in China, Japan, South Korea and Vietnam with its cargo gateways in Europe, the USA and Russia. \n\r \nRobert van de Weg, ABC’s Senior Vice President, Sales & Marketing, said: “The ABC team is pleased to start connecting customers in Europe, the USA and Singapore with dedicated freighter services to Changi Airport. With the addition of this route, ABC is continuing its strategy to provide customers with better access to point-to-point deliveries within its global route network, while providing them with on-time, reliable and high quality service levels. Singapore, via ABC’s Moscow hub, will be directly connected to gateways like Amsterdam, Frankfurt and Milan without trucking. Asia is a vitally important market for ABC and we look forward to further growth in this dynamic region.” \n\r \nCAG’s Assistant Vice President for Cargo & Logistics Development, James Fong, added: “This new service by ABC marks a significant milestone for Changi Airport as it opens up new cargo opportunities between Singapore and Russia. Logistics players, who were previously limited by capacity constraints between Singapore and Russia, now have a direct option to transport large freight shipments as well as general cargo between the two countries. The enhanced air connectivity will foster further trade between both countries which is already growing steadily.” \n\r \nChangi Airport is one of the world’s busiest cargo hubs. In the first half of 2015, cargo throughput at Changi Airport reached 912,300 tonnes. During this period, 1,034 tonnes of cargo was handled between Singapore and Russia. Between 2010 and 2014, air cargo volumes between Singapore and Russia grew by an average growth rate of 16% annually. \n \n Previous article in category  Next article in category", "source": "Evaint.com"}