{"published": "2015-09-26T23:24:24Z", "media-type": "News", "title": "Mom finds 'Help me' note hidden in daughter's Disney underwear from Philippines", "id": "7cc6b24b-127f-480a-af5b-e1c418d48b34", "content": "Nicole Perez bought clothes for her little girl and found a desperate note A name and phone number were included along with the message Nobody picked up when calling the numbers The company has been informed and is trying to  ascertain which factory it may have come from      \nA mother from Detroit is trying to work out how a note that read 'help me' came to be hidden inside her daughter's underwear. \n\nNicole Perez came across the note after she bought some Disney-themed children's clothes for her little girl. \n\nThe note is now being investigated by a New York company that distributes the clothing, whose products area made in the Philippines. \n   \nA note was find inside a package of underwear that a Detroit mother had bought for her young daughter \n   \nNicole Perez bought clothes for her little girl and found a desperate note \n\nThe Tinkerbell underwear was purchased a mom-to-mom sale last weekend. She thought she was just getting a good deal and wasn't prepared for the note she found when she opened the package. \n\nHandwritten onto a piece of cardboard were the words, 'Help me! Plz.' The back of the note had a woman's name, 'MayAnn,' and even listed a phone number, together with the words: 'Location: Philippines.' \n\nThe underwear is made in the Philippines and manufactured by Handcraft Manufacturing Corporation in New York. \n\n'I was terrified. I just felt like everything just dropped to my stomach,' Ms Perez told WXYZ . \n    \nMs. Perez was shocked at the nature of the note and decided to send the underwear back to the manufacturer \n   \nA name and phone number were included along with the message, however when the number was called, there was no answer \n\nShe emailed the manufacturer, who promptly replied with an apology and an offer for a new pack of underwear. \n\nAfter emailing the makers of the clothing, they offered to send her back a new set of Tinkerbell underwear. \n\nMs Perez was left feeling unsettled, worried and particularly concerned about the woman who wrote the note.  \n\n'You're wondering if this is forced labor, if they're just working long hours, they're putting these underwear together and clearly someone is reaching out for help and so you think about your own kids and you hope that this isn't the case,' Ms Perez said. \n   \nThe underwear is made by a New York company which has assured Ms. Perez is has strict labor laws in its Philippine factories \n   \nThe company has been informed and is trying to ascertain which factory it may have come from \n\nShe decided to call the phone number, but nobody answered. \n\nThe Philippine American Cultural Center of Michigan say the number could be for a pre-paid cellphone which are usually untraceable. \n\nThey have also said that labor laws are in place in the Philippines so protect textile workers in the factories.  \n\nIrwin Mizrahi, president of Handcraft Manufacturing which makes the children's clothing says the note appears to have been written by a factory worker.  \n\nHe has said the company will investigate where the note came from and whether the allegations of abuse are legitimate.", "source": "Mail Online UK"}