{"published": "2015-09-24T10:13:58Z", "media-type": "News", "title": "Court records reveal past of accused killer", "id": "f963b9b3-a61b-4b1b-9fe2-31f1853cfa73", "content": "TORONTO - Basil Borutski, the man charged with first-degree murder in the slayings of three women in eastern Ontario, has a criminal history that includes allegations and convictions of violent behaviour toward his ex-wife and former girlfriends.\r \n \n\r\n                            Borutski's daughters even described him as a \"violent, easily agitated and tyrannical,\" according to an Ontario Superior Court judgment that granted a divorce to Basil and Mary Ann Borutski in 2011 and ordered Borutski to pay his ex-wife almost $93,000.\r \n \n\r\n                            Mary Ann Borutski alleged a \"steady regimen of domestic violence,\" including domestic assault in 1985. Borutski stood trial on assault charges and \"successfully defended those charges,\" the divorce judgment said.\r \n \n\r\n                            \"The pattern that repeated itself over the years is that after reporting an assault (true or not) they would patch things up and Mary Ann recanted, either before trial or at trial,\" the judgment said.\r \n \n\r\n                            Daughters Candace and Amanda, however, \"verified their mother's version of the dysfunction in the marriage and confirmed that Basil was violent, easily agitated and tyrannical toward his family members.\"\r \n \n\r\n                            \"Candace testified to having vivid memory of Basil's violence toward Mary Ann dating back to the early years in the vehicle that included hair pulling, slapping and an attempt to push Mary Ann from the moving vehicle,\" the judgment stated.\r \n \n\r\n                            Borutski, however, \"vehemently denies having ever assaulted Mary Ann. He asserts that she is vindictive and manipulates the justice system by making false charges,\" the court document stated.\r \n \n\r\n                            On Wednesday in a courtroom in Pembroke, Ont., Borutski was charged with three counts of first-degree murder in the slayings of 36-year-old Anastasia Kuzyk, 48-year-old Nathalie Warmerdam and Carol Culleton, 66. He was remanded in custody until Oct. 5.\r \n \n\r\n                            In the years following his divorce from Mary Ann Borutski, the onetime millwright faced more allegations of violence from Kuzyk and Warmerdam, two women he dated.\r \n \n\r\n                            In 2012, he is alleged to have assaulted Warmerdam, to have threatened to hurt one of her family members and to kill a family pet.\r \n \n\r\n                            He was convicted of making threats and breaking a door while he lived with Warmerdam, court documents show. The assault charge was stayed by the Crown.\r \n \n\r\n                            In a separate incident in 2012, Borutski was also convicted of assaulting a provincial police officer during an arrest. He was also found guilty of assaulting his cousin, Stanley Borutski, a jail guard, during the same incident.\r \n \n\r\n                            In 2014, he was charged with assault causing bodily harm after Kuzyk accused him of choking her.\r \n \n\r\n                            He was also accused of burning some of Kuzyk's possessions, including some antiques, and of stealing a car from a member of her family as well as violating a probation order that required him to keep the peace.\r \n \n\r\n                            Those alleged incidents took place in December 2013 and January 2014.\r \n \n\r\n                            Borutski was convicted a year ago of stealing a vehicle, assault, choking, mischief of property, operating a motor vehicle while being prohibited from driving, two counts of breach of a probation order and possessing a firearm while also banned from owning one.\r \n \n\r\n                            He served more than 18 months in jail following the convictions and had paid hundreds of dollars in fines to his victims over the years. His brother, Will Borutski, says he was freed from jail in recent months.\r \n \n\r\n                            By The Canadian Press", "source": "YorkRegion.com"}