{"published": "2015-09-15T08:00:32Z", "media-type": "News", "title": "America's Most Expensive Rental Markets", "id": "7990d850-4055-48de-acbf-2db8d7d5a131", "content": "The Federal Savings Bank encourages all prospective home buyers and mortgage applicants to do the math and see just how much less expensive owning is versus renting.    Past News Releases RSS    \n\r Chicago, IL (PRWEB) \r September 15, 2015 \r \n\nLenders like The Federal Savings Bank are always keeping tabs on rental markets across the USA.  Strong rental markets usually also contain strong real estate markets. \n \nThe Federal Savings Bank was intrigued by data released in a CNN Money article from August 19th titled “ America's most expensive rental markets ”. \n \nPerhaps surprisingly, 10 out of the 15 markets presented resided in California.  Due to the abundance of tech companies and high salaries, Cali is the most abundantly expensive state to live in terms of rents. \n \nThe average percentage of income spent on rent in all 10 California cities was above 40% for: Salinas, San Luis Obispo, San Diego, Santa Rosa, Santa Barbara, Los Angeles, Napa, Santa Cruz, San Francisco, and San Jose.  Above 40% is a very high level.  For Los Angeles, where the median income is $61,482, the average percentage of income spent on rent is 48.9%. Just think of how much money could be saved by owning instead of renting! \n \nWashington D.C. while expensive at a $2,104 per month level of rent, showed the lowest percentage of income spent on rent at just 26.8% thanks to high median incomes of the area at $94,204. \n \nThe Federal Savings Bank believes high costing rental markets are places that give an incentive to first-time home buyers the most to purchase a property.  With home prices on the rise and 30-year fixed mortgage rates continuing to trend sub 4%, now is an affordable time to purchase a property. \n \nThe Federal Savings Bank encourages all prospective home buyers and mortgage applicants to do the math and see just how much less expensive owning is versus renting.  Frequently, the cost of a mortgage + property taxes + association fees are less than the monthly cost of rent! \n \nContact the Federal Savings Bank, a veteran owned bank, to learn more about mortgages. \n  \nShare article on social media or email", "source": "PRWeb"}