{"published": "2015-09-08T04:05:55Z", "media-type": "News", "title": "Sydney lawyer Sonny Wilson struck off for swindling thousands from Legal Aid NSW", "id": "1ffcefad-a39e-4d65-9e66-677cb76d087f", "content": "A western Sydney lawyer has been banned from practising after he falsely invoiced Legal Aid for more than $18,000. A western Sydney lawyer has been banned from practising after he falsely invoiced Legal Aid NSW for more than $30,000.\n\nSonny Wilson, a Liverpool solicitor, charged Legal Aid for barristers' and translators' fees on behalf of his clients when no such work was provided. \n\n﻿ \n\nBetween 2012 and 2013, he misappropriated trust funds and made five false certifications to the service, which has struggled with federal funding cuts. Several times Mr Wilson told Legal Aid that barristers had appeared in court when Wilson himself represented his clients.\n\nOn Monday, the Civil and Administrative Tribunal found Wilson guilty of \"egregious\" dishonesty. The solicitor, pictured below with rugby league great Darren Lockyer, had his name struck off the roll of NSW lawyers. (function(d, s, id) (document, 'script', 'facebook-jssdk'));Me and the Captain of the Kangaroos Rugby League Team - Darren Lockyear - at the Four Nations Fundraising Dinner.Posted by Sonny Wilson on Tuesday, October 19, 2010\n\nMr Wilson, representing himself, did not formally oppose the removal of his name but asked for a suspension instead.\n\n\"I am willing to learn from my past mistakes and errors,\" he said in an affidavit. \"Hopefully I can obtain another opportunity in the near future to practice as a solicitor and to be of some use and benefit to others.\"\n\nThe tribunal found his dishonesty was so extensive they had no option but to remove his name from the roll.\n\n\"Despite his good intentions, we are far from satisfied he has achieved this redemption in the relatively short time that has elapsed since his practising certificate was suspended,\" the tribunal panel wrote.\n\nBut the panel said Mr Wilson's chance to return to law \"may not be lost forever\". He is now studying full-time for a three-year degree in theology at Alphacrucis College in Parramatta.\n\nThe tribunal's decision came one year after to legal aid services around Australia. The government is yet to respond to the recommendation. The story first appeared on The Sydney Morning Herald.", "source": "Great Lakes Advocate"}