{"published": "2015-09-29T14:41:02Z", "media-type": "Blog", "title": "Can Influencer Relationships Prevent Content Shock?", "id": "6842f6e8-f8d9-407f-b647-55b9236fe927", "content": "Every minute 2,460,000 pieces of content are shared on Facebook. If this isn’t content shock , it’s something close to it. \n \nFresh and engaging content won’t necessarily rise to the top – and paying to boost your ads runs the risk of making consumers turn off. \n \nPierre-Loic Assayag, founder of Traackr, opens the event. \n \nAt Traackr’s Beyond the Buzzword: Influencer Marketing in Action  event, a panel of experts discussed influencer marketing and how important it is for brands to engage in it. \n \nAuthoritative content is the most trusted by users (51% trusted) – yet only 20% of marketing budgets are dedicated to creating it. \n \nAn influencer can boost your signal to their engaged audience, and lend your brand authority, insulating you against content shock. \n \nGreat insights from Pierre-Loic Assayag of Traackr – people trust people over brands. \n 5 steps to begin engaging with influencer relations  1. Find your brand’s influencers  \n\n \n“A sign of true influencer is somone who doesn’t know their Klout score” says @AndrewGrill , to a room of laughter #traackruk — Traackr (@traackr) September 22, 2015 \n \nStanislas Magniant, Online Communications Director for Coca-Cola describes the Magic Middle. \n \nReaching out to an influencer doesn’t have to mean securing Beyonce. Bloggers are the new celebrities, and because of the weight and depth of the authentic connection they’ve built with fans, they may be even more authoritative than the big names.   Your key influencers can be found in the “Magic Middle” – not YouTube superstars, but not Twitter eggheads either. Those people who will engage with you – and not tell you to call their agent.   Tools like Traackr make it easy to find and engage your influencers – and there’s also the good old fashioned spreadsheet.     \n 2. Engage your Superfans  \nSuperfans will be easy to find – they’re the ones talking to you about how great you are.  \n  \nSuper fans are not only those with huge communities, but those who are literally super fans of the brand #traackruk  pic.twitter.com/8ptxxAacXj \n \n— Luke Freeman (@lukie3man) September 22, 2015 \n \n  \n \nDon’t just bask in your superfans’ praise – engage them and turn them into genuine advocates for your business. This could mean wooing them with gifts, sneak peeks at new products, or asking them to create content for you. \n 3. Remember you’re writing a love story  \nBuilding an influencer relationship takes time and investment. From that point of view alone, a one-off campaign doesn’t make sense. Instead, capitalise on your relationship by involving your influencer in content creation, and working with them on an on-going basis   \n  \n“Influencer marketing is a long-term relationship, not a one night stand” #TraackrUK  pic.twitter.com/uPDIIUe4nM \n \n— Mike Tinmouth (@michaeltinmouth) September 22, 2015 \n \n\n 4. Never underestimate the value of meeting IRL  \nA coffee is worth a thousand emails. Getting together with your influencers – in your office (so exciting for a super-fan!), or by organising an event for them to connect to other fans – can go a long way.  \n \nThe dirty secret of online communities is meeting in real life. IRL is king! #TraackrUK pic.twitter.com/mz1TyeJ4l1 — RayRay (@RachelRayner) September 22, 2015 \n \n  \n 5. Consider paying your influencers  \nThe Traackr panel: Johanna Whitaker, Andrew Grill and Garth Farrar discuss influencer relations. \n \nOne of the most contentious points of the Traackr event was whether or not influencers should be paid.   Does paying your influencers undermine their authenticity? Does paying an influencer turn them into just another advertiser – but one you have less control over?  \n \n. @farrargarth Don’t confuse the term “influencer” with “celebrity” where you’re basically paying for reach #traackruk — Alistair Wheate (@alistairtweet) September 22, 2015 \n \nIn an ideal world, influencers would be super-fans, genuinely engaged with the brand and overjoyed to work for free. However, like all relationships, the relationships you have with your influencers have to be reciprocal, a true partnership which benefits both parties. Whether that’s rewarding your influencers with money-can’t-buy experiences, producing high-quality content for them to share, or cold, hard cash, ensuring the relationship is reciprocal will help it last into the long term. \n \nTier influencers & reward the relationship appropriately. Time is the best reward & give it appropriately #InfluencerMarketing  #TraackUuk — Sarah Price (@_sgprice) September 22, 2015 \n \nNeed help nurturing your influencer relations? Download our free eBook, the New Rules of Influencer Relations.", "source": "LEWIS 360° - The blog of global communications agency, LEWIS PR"}