{"published": "2015-09-16T14:55:00Z", "media-type": "News", "title": "Bruel & Kjaer Joins Altair Partner Alliance with Noise, Vibration and Harshness Testing Software", "id": "ae5be3b8-1b3f-4e85-b233-cef76f8265ff", "content": "SOURCE Altair\n\nInsight+ is now available for download by enabled HyperWorks users\n\nTROY, Mich. \n\n\"We are very excited about our partnership with Altair,\" said Alun Crewe \n\nInsight+ allows users to test and evaluate source strengths and transfer functions and contributions on a system level, taking into account an entire vehicle's interactions with its environment. The software makes it possible to listen to and analyze proposed engineering changes in the appropriate context in order to evaluate and rank design alternatives to assist NVH test and CAE engineers in sharing and developing ideas.\n\n\"Altair is thrilled to be adding Brüel & Kjær's software to its NVH portfolio,\" said David Mason \n\nWhile mostly applicable in the automotive industry, Insight+ can help anticipate inadequate NVH conditions during the design process of any vehicle, resulting in quiet and comfortable experiences for all passengers and drivers.\n\nAltair will also be presenting at the today and will discuss the partnership and how the software complements the HyperWorks suite.\n\nTo learn more about Brüel & Kjær and Insight+, register for the introductory webinar taking place October 6, 2015 \n\nAbout the Altair Partner Alliance\n\nAltair's HyperWorks platform applies a revolutionary subscription-based licensing model in which customers use floating licenses to access a broad suite of Altair-developed, as well as third-party, software applications on demand. The Altair Partner Alliance effectively extends the HyperWorks Platform from more than 20 internally developed solutions to upwards of 60 applications with the addition of new partner applications. Customers can invoke these third-party applications at no incremental cost using their existing HyperWorks licenses. Customers benefit from unmatched flexibility and access, resulting in maximum software utilization, productivity and ROI. For more information about the Altair Partner Alliance, visit www.altairalliance.com. About Brüel & Kjær helps solve sound and vibration challenges, and develops advanced technology for measuring and managing sound and vibration. As a specialist in this domain, the company helps customers ensure component quality, enhance product performance and monitor operational compliance. \n\nOver more than 70 years, many of Brüel & Kjær's research and development people have become recognized global experts, who aid the scientific community and teach at renowned centres. \n\nThe application of experience and technology promotes quality and efficiency at every stage of a product's life cycle: design, development, manufacture, deployment and operation. Through mastering sound and vibration, Brüel & Kjær helps to accelerate business growth and improves environmental quality.\n\nBrüel & Kjær is a subsidiary of UK-based Spectris plc (www.spectris.com) which has annual sales of £1.1bn and employs around 7,500 people worldwide across its four business segments.\n\nAbout Altair\n\nAltair is focused on the development and broad application of simulation technology to synthesize and optimize designs, processes and decisions for improved business performance. Privately held with more than 2,500 employees, Altair is headquartered in Troy, Michigan \n\nMedia Contacts\n\nAltair Corporate/North America \n\nAltair Europe Mette Temple \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/bruel--kjaer-joins-altair-partner-alliance-with-noise-vibration-and-harshness-testing-software-300144006.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "12 News Now"}