{"published": "2015-09-12T13:56:09Z", "media-type": "News", "title": "Hiddleston plays down Oscars talk over Hank Williams role", "id": "2fea24de-6909-4337-b807-c5f967ffd9ac", "content": "Avengers star Tom Hiddleston revealed that the Oscar buzz surrounding his highly anticipated portrayal of country music legend Hank Williams all seems \"imaginary\" as the movie received its world premiere at the Toronto International Film Festival. \n \nThe British actor, best known for his role as the villainous Loki in the Marvel superhero franchise, sings some of Williams' most famous country standards in the film I Saw The Light. \n \nHe said he received a comprehensive education in the singer's impact on music. \n \nSpeaking on the red carpet at the premiere at the Ryerson Theatre in Toronto, Hiddleston said: \"His music has left this extraordinary legacy and the songs he wrote like Hey, Good Lookin' and Cold, Cold Heart and I'm So Lonesome I Could Cry and Your Cheatin' Heart were country standards that singer like Ray Charles and Tony Bennett and Johnny Cash went on to cover, so I knew the songs but I didn't realise he was so young when he died. \n \n\"He was 29 years old and left this legacy, Bob Dylan talks about his legacy, Bruce Springsteen talks about him and in some of his early songs you can hear rock and roll. \n \n\"There is a song called Move It On Over and you can hear Rock Around The Clock coming round the corner in ten years' time so that was really exciting to me to realise where Hank sits in the stepping stones of twentieth century music.\" \n \nWilliams died from heart failure in 1953 after battling alcohol and pills while dealing with intense fame and scrutiny. \n \nAsked about the comparisons between Williams' fame and the attention Hiddleston has received, he said: \"His version of fame was very extreme and there is something more naked about being a singer-songwriter than being an actor perhaps, but certainly I think he struggled with the commercialism of what came from his heart and soul. \n   Promoted stories   \n\"He used to say 'they are slicing me up and selling me like baloney', so I think he really struggled with the idea that he was part of a machine that was about making money, whereas for him it was about communicating something to people and sharing that feeling and any creative person can relate to it in some way.\" \n \nHiddleston has already been mentioned as a possible contender in the best actor race when the Academy Awards roll around in 2016, but he said it is too far away to contemplate. \n \n\"I can't really comment on that because it all seems so imaginary, it's really nothing to do with me in a way, so we will see what people say when they see the film.\" \n \nThe Toronto International Film Festival runs until September 20. \n \nThe Bourne Identity star Matt Damon braved the Toronto rain for the world premiere of his new film, The Martian. \n \nRidley Scott's big budget epic tells the story of an astronaut battling to survive on Mars alone after his Nasa crewmates leave him behind, mistakenly believing he is dead. \n \nThe film, which also stars Jessica Chastain, Jeff Daniels, Chiwetel Ejiofor, Kate Mara and Kristen Wiig, maintains a sense of humour throughout, which Damon says is the key to its charm. \n \n\"There would have been another way to tell this story that wouldn't have been as entertaining, that would have been an exercise in existential reality. \n \n\"But the way we chose to go was fun and uplifting and optimistic ultimately, and that was the tone we were happy with because that is a good thing to put out into the world given what the headlines are.\" \n \nScott has long been on Damon's wishlist as a collaborator. \n   \n Share article  \n   \n\"He's a master filmmaker and has been for a really long time. He's shooting four cameras at a time, he's a cutting in camera, he's just genius, so for me it's really easy to turn up at work and hash out the problems and work through stuff and see what he's going to do. It makes my job so easy.\" \n \nThe Martian will be released in UK cinemas on September 3", "source": "Brighton & Hove Argus"}