{"published": "2015-08-13T15:00:40Z", "media-type": "Blog", "title": "Will Work For Adventure", "id": "1fa0ac91-55a0-48f0-92ea-c81cc065dd64", "content": "Most of us can only dream about living in a world where we get paid to do what we love, but having an awesome job doesn’t have to be a stretch of the imagination. The following six individuals have made their passions their life, and with a little creativity and a lot of hard work, you can too. \n \nGet inspired and then tell us—if you could make a living in the outdoors, what would you choose to do? \n \nEmily Shanblatt \n \n>> Outdoor Director, French Broad River Academy for Girls \n \nAsheville, N.C. \n \nChemistry and outdoor leadership. Those were 27-year-old Emily Shanblatt’s two majors when she graduated from Warren Wilson College in western North Carolina. Though Shanblatt did teach chemistry for a year, it was eventually her love of whitewater kayaking that took priority, leading her to the steep creeks of California all the way around the world to the big water of Nepal. \n \n“In college, I discovered a kayak can take you to places you never even imagined,” says Shanblatt, now a sponsored paddler for Confluence. “Your whole world opens up.” \n \nShanblatt taught women’s kayaking clinics for friend and fellow paddler Anna Levesque’s program Girls At Play, and helped with the French Broad River Academy (FBRA), an Asheville-based middle school for boys specializing in adventure education. Shanblatt’s vision of what she wanted to do with her life was starting to take shape. Conveniently for her, so too was an all-girls version of the French Broad River Academy, which will begin its first year of operation this fall with Shanblatt at the helm as Outdoor Director and math teacher. \n \n“Every Thursday, we don’t step foot in the classroom. We go paddling as much as we can when weather and water levels cooperate,” which, when you’re in the Southeast, is practically year-round. \n \nAn all-girls middle school that focuses on whitewater canoeing, of all things, sounds pretty progressive, pretty niche, but Shanblatt’s in charge of 18 girls already, which makes her hopeful for the future of not just the program, but the girls themselves. \n \n“More and more women are running class V and kayaking. The more women these girls can see reaching those higher levels, that’s really powerful,” Shanblatt says. “To give our students an option to explore those things is really valuable. Every girl needs to know that she’s capable of what she wants to do.” \n \n\n \nPat Goodman \n \n>> Professional climber \n \nFayetteville, W.Va. \n \nThe view from Pat Goodman’s office is rarely the same, but it’s usually about four inches from his face, hard, and kinda gray. That is, until he turns around and takes in the expanse of remote Canadian (or Chinese or Venezuelan or Indian) backcountry from his perch some 2,000 feet up on a rock face. \n \n“The big appeal [of rock climbing] is getting into a remote location and experiencing an area that few, if any, people have ever visited,” Goodman says. “It’s a pretty surreal experience to go to a place like that.” \n \nGoodman, 37, works hard for those moments. Back in 2012 during his fifth trip to the Vampire Spires in northwestern Canada, Goodman and his team of three navigated 100 miles of the notoriously rowdy Nahanni River by raft just to reach the base of an 800-meter wall, The Phoenix, which was then-unclimbed. And the adventure was only beginning. They then successfully made the first free ascent, tackling an 18-pitch route they later dubbed The Phreenix rated VI 5.11. \n \nAs romantic as it sounds, bushwhacking through exotic landscapes and living in a bivy doesn’t necessarily pay the bills. When Goodman’s not racking up first descents, he stays busy with hardwood flooring jobs back at his home in the New River Gorge. \n \n“Maintaining a positive income is definitely a challenge,” Goodman admits, but with a little help from his sponsors Outdoor Research, LaSportiva, Big Agnes, Metolius, Julbo, Probar, and Mountainsmith, Goodman’s able to travel the world on a never-ending quest for the next big ascent. \n \nAside from The Phreenix, Goodman has been on first ascent teams defying the unlikely close to home and far away, from a V.11 boulder problem in Linville, N.C., called Roadside Distraction, to Daugou Peak in China’s Shuangquiao Valley. \n \nThough he’s experienced cultures and foods, traditions and settings of nearly every variety, his favorite part about his job is simple. \n \n“The climbing. That’s why I do it.” \n \n\n \nEva Surls \n \n>> Mountain bike guide and co-owner, The Bike Farm \n \nBrevard, N.C. \n \nCradled by the lush green expanse of Pisgah National Forest, The Bike Farm sits on 440 acres just outside of Brevard, N.C., a small town with a big reputation as the Cycling Capital of the South. With hundreds of miles of technical singletrack right out her backdoor, and a husband for a coworker, co-owner and guide Eva Surls sometimes has to pinch herself—is this really where she lives, works, and plays? \n \n“I grew up in east Texas in piney woods, kinda like the eastern part of North Carolina actually,” Surls says, “but I fell in love with this area, the water, the green, and I definitely fell in love with the mountain biking here.” \n \nTogether, Surls and her husband Cashion Smith started The Bike Farm in the fall of 2012 as “a community-style hub that people could come gather at, ride bikes, and experience nature and healthy living.” In the early stages, however, there was no “farm,” per say. There was just a Mercedes-Benz Sprinter that Surls and Smith lived and guided out of full-time. \n \n“Owning or starting a business is definitely challenging,” Surls says. “You’re married to it. You don’t leave it at the office because your home is the office.” \n \nStill, for Surls, whose family encouraged her to pursue adventure sports at an early age, helping others experience biking is a dream come true. When she isn’t in the saddle guiding women or beginners around Pisgah’s elaborate trail system, she’s donning another hat as marketing director or perhaps event coordinator, maybe business manager—when your business has no full-time staff, you make do. But Surls doesn’t seem to mind, for at the end of the day, her mission with The Bike Farm is simple: get people outside. \n \n“I really believe that part of health is experiencing nature and the future of the planet depends on humans interacting with it and realizing the value in it as its own entity,” she adds. “Guiding was an avenue that I saw to get people out into nature…and also experiencing their own body.” \n \n\n \nBryan Mangum \n \n>> Road warrior, Eagles Nest Outfitters \n \nAsheville, N.C. \n \nIf you ever meet Bryan Mangum, you’ll likely find him at any of the region’s major music festivals relaxing in a hammock, feet propped up, swaying in time with the music. Add some palm trees and a margarita and that sounds damn near like a vacation, but don’t be fooled—Mangum’s on the clock for Eagles Nest Outfitters, or ENO. His job? Road warrior, a fierce title for someone whose main job responsibilities include setting up hammocks, selling hammocks, and of course, relaxing in hammocks, too. \n \n“The festivals can be anywhere from the Florida Keys all the way up to New York,” Mangum says of his territory. “Some people may only see bands once in their lifetime, where I get to see them sometimes four times throughout a summer.” \n \nLike representing a cool outdoorsy brand and chilling in hammocks all day wasn’t sweet enough, Mangum also gets to see some of his favorite artists perform like Phil Lesh and Friends, Warren Haynes, Widespread Panic, and Slightly Stoopid, just to name a few. \n \n“The music is definitely a perk of the job,” Mangum, 28, says. “An even bigger perk of the job is when your booth is set up in front of the stage.” \n \nRough life, right? But setting up an armada of hammocks and manning a booth for four days straight requires a lot of patience, people skills, and, believe it or not, physical strength. The ENO booth takes Mangum two hours, sometimes more, to set up by himself, but if there’s one thing he’s learned during his yearlong stint of working the festival circuit, it’s this: be kind to your neighbors. \n \n“You’re always gonna need help no matter what,” Mangum says. \n \nThough he’s had some great festival neighbors over the past year like Sierra Nevada and Kitchen Craft, who fed him throughout the weekend, Mangum’s favorite neighbor would have to be a friendly girl by the name of Ashley, who worked the non-profit Rock the Earth’s booth at Mountain Jams in 2014. \n \n“She sat in a hammock and we talked for three days straight,” Mangum says. \n \n     Because really, what other ingredients do you need for falling in love beyond hammocks, tunes, and conversation? \n \n\n \nZach Adams \n \n>> Trail builder, Heart of the Highlands Trail System \n \nCanaan Valley, W.Va. \n \nZach Adams, 25, doesn’t have to worry about donning a suit and tie for his job. In fact, he could get away with wearing the same pair of Carhartts for a week straight if not for the torrential downpours that frequent his home in Canaan Valley, W.Va. But as a contract trail builder for the Heart of the Highlands Trail System, Adams is not in it for the casual dress code. He’s in it for the art. \n \n“It’s super rewarding,” says Adams. “Creating a new build is my favorite part.” \n \nYou need only ride a minute from the town of Davis, W.Va., to get a taste of his trails firsthand. Rock gardens, log piles, and other technical trail features are standard fare on Splashdam Connector, Adams’ most prized trail. So what goes into all of that glorious, techy riding? \n \n“We move a lot of muck and we move a lot of rocks,” Adams says, which, when you’re at it 40 hours a week in less-than-ideal weather, can be downright exhausting. \n \nFortunately, Adams regularly employs the help of local AmeriCorps workers, volunteers, and, of course, a mini excavator and rogue hoe, his favorite tools. As a former cyclocross competitor and race organizer for his brainchild, Fast Forward Racing Productions, Adams knows the recipe for the perfect trail—“rocks, techy slow moves, fun flow sections…diversity, you know,” all of which he strives to include in his own builds or reconstructs. \n \nIt’s unglamorous work at best. Often muddy, saturated, or overgrown, the trails and elements of Canaan Valley are a force to be reckoned with. But for Adams, no matter how many tons of rock he hauls, no matter how many thickets of mountain laurel he wrestles, any day in the woods is better than a day at the desk. Plus, who wouldn’t enjoy cruising the fruits of your labor after a hard day on the clock? \n \n\n \nMacKenzie Hatcher \n \n>> Photo boater, Laurel Highlands River Tours \n \nOhiopyle, Penn. \n \nImagine a kayak for a desk, a stomping class IV-V river for a daily commute, an afternoon rush hour packed with commercial rafts. For photo boater MacKenzie Hatcher, 21, that’s been her work reality since she was just 15 years old. And though she has to wear a skirt to work everyday, she wouldn’t have it any other way. \n \n“I love kayaking and really enjoy taking photos, so getting to combine those two things makes it the best job,” Hatcher says. \n \nHaving grown up on the banks of the Youghigheny River in southwestern Pennsylvania, Hatcher, the daughter of river rat parents, has been kayaking for most of her life and shooting photos since high school. After attending the New River Academy, a traveling high school for kayakers that concentrates on videography and photography, Hatcher thought it only natural that she should continue her passions on her hometown river. \n \n“There’s a lot to it,” Hatcher says. “People think it’s an easy job,” but you try safely navigating your way solo through pods of rafts, or “floating undercuts,” amid technical whitewater, adjusting your camera settings to constantly changing light, and still creating consistently quality images without mishap. \n \nHatcher’s pretty dialed in at this point, and most problems are usually just dead camera batteries or full memory cards, but there have been a few out-of-boat experiences that have left her more than shaken. \n \n“I also shoot photos on the Cheat River, and I once swam out of Big Nasty,” Hatcher says, recalling the class IV river was at high spring flows close to five feet. “I was by myself, but I somehow managed to get all of my gear to shore and still get photos of the trip coming down.” \n \nShort of kayaking and camera skills, photo boating requires a good deal of grit and a wild hair. Fortunately for Hatcher, she’s well endowed with both. \n \nWATCH VIDEO See Brian Mangum, the ENO road warrior, in action at FloydFest at BlueRidgeOutdoors.com \n \nREAL TALK \n \nWhat would you be willing to do to have the job of your dreams? What does it take to be a professional climber or brand road warrior? Here is advice from our featured adventurers. \n \n1. BE WILLING : As in, be willing to forgo sleep, to be poor, to have people look at you like you’re crazy, to sometimes think you are crazy. Be willing to ride the peaks and valleys of chasing your passions. \n \n“That’s one of the biggest things,” Pat Goodman says. “Be willing to have everything go differently than you had planned it to and still be excited about the adventure.” \n \n2. LOVE YOUR PARENTS : Because hey, you got that knack for adventure somewhere, right? It also helps to have a good relationship with your folks in case, you know, your Kickstarter campaign falls flat on its face. Or when you need a staging area in between moves, like Eva Surls and her now-husband Cashion Smith did before moving to Brevard. \n \n“We moved in with my parents for eight months which I would never recommend to any adult couple,” Surls says. “I’m still recovering from that.” \n \n3. TRAVEL : You’re not gonna get inspired sitting on Google or scrolling through Instagram feeds. Get out there and see the world and find out where you want to fit into all of that. \n \n“My appreciation and drive for new things grows every time I travel,” says Emily Shanblatt. “It’s a lifelong mission.” \n \n4. BE YOUR OWN BOSS : If you’re going to create your future, you’re going to have to create your own boss, too. Make plans, and stick with them. More importantly, act the part. \n \n“Time management is so important,” Bryan Mangum says. “You can’t get bored. Find something to do and don’t take it for granted.” \n \n5. BE PERSONABLE : No matter how skilled you are, no matter if you’re the best photographer on the entire planet, if nobody likes you, nobody is going to hire you. \n \n“That’s why people come back [rafting],” MacKenzie Hatcher says. “It’s based on how personable you are and how much you make them feel welcome and give them a good time.” \n \n6. KEEP LEARNING : And don’t stop learning. Ever. Whether it’s through workshops or shadowing or interning or heck, even volunteering, build your skills and listen to those who came before you. \n \n“Get involved,” says Zach Adams. “Do it right from the start.” \n \nThe post Will Work For Adventure appeared first on Blue Ridge Outdoors Magazine .", "source": "Blue Ridge Outdoors Magazine"}