{"published": "2015-09-21T16:42:34Z", "media-type": "News", "title": "MANCHESTER UNITED : What’s going wrong at Liverpool? Five key questions", "id": "d99ab8d5-7a54-4ebe-a3d1-cbbd479c2143", "content": "Is Brendan Rodgers in genuine trouble?  \nCertainly in the eyes of Liverpool supporters, if not the owners, who resisted calls to sack the manager at the end of last season, overlooked the claims of an out-of-work Bundesliga winner and backed Rodgers with another overhaul of the playing staff plus his backroom team in the summer. Since 22 March, when Liverpool hosted Manchester United at Anfield with designs on qualifying for the Champions League at the expense of Louis van Gaal’s team, only to lose 2-1 and collectively nosedive, their record reads: played 18, won five, drawn five and lost eight. Those five victories have come against Newcastle , QPR, Stoke City and Bournemouth in the Premier League , and Blackburn Rovers in the FA Cup. By any stretch it is a record that invites pressure on a manager. At a club with Liverpool’s ambitions it is nowhere near good enough. \n Are Liverpool’s ambitions unrealistic given the financial might of other Premier League clubs?  \nNo, and how can 18-times league champions and five-times European champions lose ambition? Much was made last season of Liverpool having the fifth-highest wage bill in the Premier League and how that provided an accurate gauge of “where we are at” – to quote Rodgers himself. Given how few teams have broken the wage bill/league position balance in the Premier League , it must be taken into consideration. Other investment figures, however, scream underachievement to Fenway Sports Group . Analysis by the Football Observatory in Switzerland published after the close of the last transfer windowlisted the most expensively assembled squads in Europe’s so-called‘Big Five’ leagues: Germany , Spain , Italy , England and France . Liverpool were seventh with their squad costing £251m. Barcelona were sixth with £287m (due in part to the £75m given to Liverpool for Luis Suárez) and Bayern Munich eighth on £246m. FSG has backed its transfer committee and manager but the return has been underwhelming; the cost of losing key players high. \n Has Rodgers run out of ideas at Liverpool ?  \nThe Liverpool manager is not short of ideas. In fact he has tried various formations this season in an attempt to rediscover the “identity” he concedes has been lost. It was lost at the start of last season too. Ideas are not an issue for Rodgers. It is how far he and his team have departed from the principles that underpinned 2014’s title challenge that is a greater problem for the manager, although he would dispute that he has veered away from aggressive pressing, penetrating football ideals. Other, weightier concerns than a lack of ideas would be the high turnover of players that has fixed Liverpool into a transitional phase and left their manager appealing for time for a second consecutive season. There is also no escaping the brutal truth that, four seasons into his Anfield reign, Rodgers is not presiding over an outstanding squad, one that has lost its captain ( Steven Gerrard ), best player (Suárez) and brightest young talent ( Raheem Sterling ) in just over a year. Given he is not solely responsible for the construction of that squad, he is not solely to blame. \n Can the manager turn it around?  \nLast season’s mid-term recovery – when Liverpool embarked on a 13-game unbeaten run in the Premier League after losing 3-0 at Manchester United – demonstrates Rodgers can steer a recovery but it appears an onerous task at present. The most damning verdict of Liverpool’s 1-1 draw at home to Norwich City on Sunday arrived from the manager himself, when he admitted the anxiety that afflicted the team at Anfield upon his arrival from Swansea City in 2012 had returned. All that work, money and upheaval and Rodgers is back at square one. It may not sit comfortably after Sunday’s Premier League poor result but there was encouragement for Liverpool in their performance against Norwich compared with previous outings. Striker Danny Ings suited Rodgers’ system far better than the often isolated figure of Christian Benteke ; Daniel Sturridge’s menace will only increase with fitness; and the recalled defenders Mamadou Sakho and Alberto Moreno made assured returns to the starting lineup. \n \nThere was also greater creativity, if not penetration, from a team who have failed to score more than one goal in 18 of the past 20 games. Small acorns and all that, but we are only six league games in. \n How have the new signings bedded in?  \nNot well enough to alleviate the pressure on their manager. Nathaniel Clyne has made a smooth transition from Southampton at right-back and young Joe Gomez was an unexpected bonus as a makeshift left-back in the opening games. Christian Benteke has shown flashes of talent but Liverpool’s approach at the start of the season has merely supported Tim Sherwood’s argument that the Belgium forward was not leaving Aston Villa for a team that played to his strengths. Ings has had little opportunity to impress but, as mentioned, seized it against Norwich ; £29m Roberto Firmino is yet to make an impact but requires time – as all do in fairness;and James Milner’s rapid elevation to the captaincy in the absence of the injured Jordan Henderson reflects Rodgers’ trust in the midfielder but also the lack of leaders available to the Liverpool manager before Milner’s arrival from Manchester City. \n\nCopyright Â© 2015 theguardian.com. All rights reserved., source Guardian Newspaper", "source": "4 Traders"}