{"published": "2015-09-17T21:05:00Z", "media-type": "News", "title": "Gold Price Begins Bullish 5-3 Elliott Wave Sequence", "id": "166fba87-f0b3-4a3b-80a3-5715fcdaf74d", "content": "DailyFX.com - \n\n Market Condition: Trend  \n\n\n Bias: Long Gold  \n\n\n En try: $1110-$1132  \n\n\n Stop Loss: Just below the September 11 low near $1090  \n\n\n Target: $1245 where wave iii is 1.618 times the length of wave i  \n\n\n Risk Management: If a move above $1200 transpires, one could add to the position no greater than 50% of the original size, then move the stop loss to $1170.  \n\n\n (Click on the chart to zoom in; after zooming in, press the play button towards the right to set the market in motion)  \n\n\n Now that the FOMC meeting and event risk is out of the way, we can consider dipping our toe in the long Gold water.  \n\n\n The Gold price bounce from the 1100 on September 11 forms a partial retracement of the previous July-August up trend. The uptrend unfolded in 5 waves and the subsequent set back occurred in 3 waves.  \n\n\n Therefore, we have an Elliott Wave picture that suggests the higher probability move is for at least one more 5 wave move higher towards 1190.  \n\n\n Given the location in the larger wave picture and Gold forecast, it appears we are embarking upon a larger ‘C’ wave higher that could even test levels above 1300 (see HERE ).  \n\n\n As a result, we have a good opportunity at a good risk to reward ratio trade. Use the September 2015 low just below 1100 as the stop loss and initially targeting $1245 where this suggested wave ‘iii’ would be 1.618 * wave ‘i’.  \n\n\n If we make it up to 1170, we will look to move our stop loss to break even. Further appreciation above $1200 will allow us to add to the position as it will build the case for a wave iii higher.  \n\n\n Suggested Reading:  \n\n\n Gold Signaling Fed Disappointment?  \n\n\n Gold Price: Vigorous Bounce Off Trend Line Support  \n\n\n To receive additional picks or articles on using Elliott Wave Theory, join Jeremy’s distribution list.  \n\n\n \noriginal source \nDailyFX provides forex news and technical analysis on the trends that influence the global currency markets. \nLearn forex trading with a free practice account and trading charts from FXCM .", "source": "Yahoo! Finance"}