{"published": "2015-09-29T15:14:06Z", "media-type": "News", "title": "Amazing deals at the upcoming Miami Attractions Month", "id": "f4ad3f98-242f-4e46-bd6c-ae1dc8de5b2f", "content": "The Greater Miami Convention & Visitors Bureau (GMCVB) launches its seventh annual Miami Attractions Month (October 1 – October 31) bringing locals and visitors amazing deals at the destination’s leading attractions. This year, CitiBank has joined as a program sponsor, allowing consumers using their Citi® card to save an additional 10 percent on food and beverage purchases, as well as gift shop souvenirs at participating locations. \n\nA dedicated website – www.MiamiAttractionsMonth.com – provides information about Buy One, Get One admissions and special offers. \n\nTo kick-off Miami Attractions Month, GameTime is hosting a Miami Attractions Month event on Saturday, October 3 from 1-4 p.m. Located in the Shops at Sunset Place, guests can RSVP at This email address is being protected from spambots. You need JavaScript enabled to view it. to receive special giveaways, free appetizers, a complimentary beverage and an hour of free, timed games. \n\nOn October 6, the GMCVB will host a #MiamiAttractions Twitter Chat on @MiamiandBeaches from 2 p.m. – 3 p.m. EST, offering tips on planning visits to local attractions, things to do, special deals and more. Using the hashtag #MiamiAttractions, those looking to experience all that the destination has to offer are encouraged to join the conversation by following @MiamiandBeaches. All participants will also have the chance to win exclusive prizes. Additionally, during the month of October, connect with us on Visit Miami’s Facebook page (@VisitMiami) and stay tuned for the #MiamiAttractions Month post for a chance to enter our ticket giveaway by simply sharing our post! Winner be selected on October 16 at 1 pm EST and will receive four tickets to one of Miami’s top attractions. \n\nParticipating attractions include: \n\nThe Barnacle Historic State Park \n\nBig Bus Tours Miami \n\nBlack Police Precinct and Courthouse Museum \n\nCoral Castle Museum \n\nCoral Gables Museum \n\nDeering Estate \n\nGameTime \n\nThe Great Escape Room \n\nHistoryMiami Museum \n\nIsland Queen Cruises \n\nJungle Island \n\nMiami Children’s Museum \n\nMiami Seaquarium \n\nMonkey Jungle \n\nPerez Art Museum Miami (PAMM) \n\nPinecrest Gardens \n\nSchnebly Redland’s Winery & Brewery \n\nSea Trek Reef Encounter at Miami Seaquarium \n\nVizcaya Museum & Gardens \n\nWings Over Miami Air Museum \n\nZoo Miami \n\n“Miami Attractions Month enables visitors and residents to get out and do more for less in Greater Miami and the Beaches’ popular attractions,” said GMCVB President & CEO William D. Talbert, III, CDME. “As the destination continues to evolve and grow, we have welcomed many new cultural and heritage offerings that provide authentic Miami experiences for visitors and residents to enjoy.”", "source": "Focus on Travel News"}