{"published": "2015-09-29T13:53:25Z", "media-type": "News", "title": "Arsenal hero reveals why Chelsea boss Jose Mourinho has an ‘obsession’ with Arsene Wenger", "id": "9fa198b9-4556-42a3-9062-6d4b8be3cefa", "content": "SPATS: Arsene Wenger and Jose Mourinho don’t really get on… \n \nJOSE MOURINHO is annoyed that he cops more flak than Arsene Wenger, according to former Arsenal striker Ian Wright. \n \nThe Chelsea boss has had numerous spats with the Frenchman over the years and infamously labelled the Gunners chief a “voyeur”. \n \nWenger refused to shake Mourinho’s hand following Arsenal’s win in last month’s Community Shield and the pair seem unable to go a week without incident. \n \nWright thinks Mourinho has the edge on Wenger when it comes to career success but the Arsenal legend blasted the Portuguese for his “obsession”. \n \n“I think his issue is that Arsene has not won as much or achieved as much as he has — yet still gets as many plaudits,” he wrote in The Sun . \n \n“It seems that, every opportunity he gets, he can’t help but have a dig at Arsene. \n \nCRITICS: Mourinho is annoyed he cops more flak than Wenger \n \n“Mourinho got so much stick when Chelsea were having their recent blip and I think he feels he should get more respect for what he has done — even if his team are going through a bad period. \n \n“He looks at Arsene and sees he has gone through years of being an also ran in the Champions League and the Premier League, and believes he gets away with far less criticism. \n \n“It just irks him that Arsene doesn’t get more criticism. \n \n“What I can’t understand is WHY it irks him so much when he’s got the medals and success to show everybody what he’s about. \n \n“Last week Chelsea beat Arsenal 2-0. Jose could have just left it, let it go. But he couldn’t. \n \n“He’s a bit like a boxer who has done everything but feels he just has to get back in the ring again. He just can’t be happy with himself, for some reason, even though what he does is brilliant.”", "source": "Star Plus Ireland"}