{"published": "2015-09-15T02:53:00Z", "media-type": "News", "title": "Protesters hope to make a difference at Donald Trump speech", "id": "3f5c19d8-2ef9-4506-a6a6-9006e1793fdc", "content": "UTA students joined thousands of protesters at Donald Trump’s campaign rally in Dallas on Monday. \n\nProtesters walked about a mile and a half from the Cathedral Shrine of the Virgin of Guadalupe on Ross Avenue to Trump’s rally in the American Airlines Center. They held up signs opposing Trump, American flags and Donald Trump piñatas while some yelled \"Stop the hate,\" and \"Si se puede.\" \n\nDomingo Garcia, attorney and president of League of United Latin American Citizens in Dallas, helped organize the protest to send a message to Donald Trump and the Republican Party. \n \n“Messages of hate, intolerance and bigotry are not welcome in Dallas, Texas,” Garcia said. “We believe in the values that are enshrined on the Statue of Liberty and our bill of rights: Inclusion, tolerance and being a country of immigrants.” \n\nPublic Relations senior Christopher Enriquez said the U.S. immigration system is broken, and Trump’s plan to deport 11 million immigrants is impractical. \n\n“We’re saying we are not going to be silenced,” he said. \"They ask the people to go back to Mexico, or their country of origin. People can't just leave what they've built for years just to go back and apply and maybe come back 10 years later.\" \n\nDianne Bellard, Trump rally attendee, said Trump is just saying what everyone’s thinking. \n\n“He’s for immigration, but just not illegal. I love the fact of immigration but I don’t love the fact of just walking across and taking our money,” she said.  \n\nShe said she supports Trump building a wall between the U.S. and Mexico, and thinks welfare should be cut to help fund it. \n\n“We’re gonna have to do some welfare cuts, but I’m tired of seeing all the people go out with their bling-bling nails and their tattoos and trading their EBT cards for money so they can buy drugs, and TVs and cowboy gear, you name it,” she said. \n\nNursing sophomore Tobias Gaucin found out about the protest on Facebook. \n\n“It’s personal. He’s talking about my family. My parents came here to have a better life,” he said. “For him to call them murderers and rapists and drug dealers, that’s just not right.” \n \nVictor Ibarra, a Mexican immigrant, has been in the U.S. for more than 20 years, and is currently going through the process to become a resident, he said. \n\n“It makes me feel like an animal,” he said. “I feel like garbage. The testimony that Trump says is that we are bad people. I have never been to jail. I'm not a criminal. I've never been in drugs. He’s making a racial profile with the Mexican community.” \n\nAndrew Rokovich, is the owner and operator of Double Dave’s Pizza Works in Victoria, TX and the president of Texas Young Republican’s Federation in Victoria. He said he’s never supported a candidate as much as he supports Trump. \n\n“I’m a believer in borders, language and culture, and obviously that’s kind of his pillars,” he said. “I really think he’s going to strengthen our culture.” \n\n@kathryncargo \n\n@dbradley122", "source": "Shorthorn"}