{"published": "2015-09-08T10:27:51Z", "media-type": "News", "title": "Davis Cup semi-final test awaits Andy Murray after US Open exit", "id": "3dd047cf-16a1-4b2f-8ef8-8de9f8500e9d", "content": "Andy Murray admits Britain's Davis Cup semi-final against Australia will help lift his spirits after the Scot's shock exit at the US Open. \n \nMurray endured his earliest defeat at a grand slam in five years as he was beaten 7-6 (7/5) 6-3 6-7 (2/7) 7-6 (7/0) by South Africa's Kevin Anderson in the fourth round at Flushing Meadows. \n \nIt is only the second time Murray has lost to Anderson in seven meetings and brings an end to his impressive run of 18 consecutive quarter-finals at major tournaments. \n \nThe world number three will now turn his attention to next week's Davis Cup, where Britain are bidding to beat Australia and reach their first final since 1978. \n \nMurray will spearhead Britain's challenge in front of his home fans at the Emirates Arena in Glasgow, where the team enjoyed such vociferous support in the first-round win over America in March. \n \n\"Can it be the perfect pick-up? Yes, I'm looking forward to the tie,\" Murray said. \n \n\"I don't know if (getting knocked out) will be a blessing or not. And I also don't know what their team's going to be. \n \n\"The doubles will be important. I think all of the points are. It's the first team to get to three and I think everyone has an opportunity to beat everyone.\" \n   Promoted stories   \nMurray is likely to be involved in three rubbers in as many days in Glasgow, partnering either his brother Jamie or Dominic Inglot in the doubles, as well as his two singles rubbers. \n \nIt means another gruelling tie awaits the 28-year-old, who has endured a hectic schedule in recent months, having made the semi-finals at the French Open and Wimbledon before winning three matches to beat France in July. \n \nFatigue may have been a factor in Murray's defeat to Anderson, particularly after his tough opening rounds with Nick Kyrgios and Adrian Mannarino, but the Briton disagreed. \n \n\"I don't think so. I felt like I was able to fight as I wanted to through to the end of the match,\" Murray said. \n \n\"So I don't think the amount of tennis I've played played a part. \n \n\"It was more playing against Kevin on the court of that speed, and with him serving as well as he does, it's a tricky match. \n \n\"It comes down to a few points in each set. He managed to get them today.\" \n \nMurray's exit came just 11 minutes after Britain's other representative in the last 16, Johanna Konta, saw her fairytale run in New York ended by Petra Kvitova. \n \nKonta, ranked 97th in the world, had defied all expectations to reach the fourth round, beating seeds Garbine Muguruza and Andrea Petkovic along the way, but Kvitova proved a step too far as the Czech won 7-5 6-3. \n \n\"I'm really happy that I got some rewards for my hard work but the hard work's not over,\" Konta said. \n   \n Share article  \n   \n\"I'm not blown away by my performance here. I'm just satisfied that I get a little bit of candy for doing well.\" \n \nKonta added: \"I don't want to stop. It's not something where I sit back now and say, 'Oh, that's nice'. I'm an ambitious person.\"", "source": "Your Local Guardian"}