{"published": "2015-09-20T01:05:12Z", "media-type": "News", "title": "North Dakota State dominates old rival North Dakota 34-9", "id": "ef9862e4-c7f8-4c38-bcb2-e5f50341ce01", "content": "The first football game in 12 years between old rivals North Dakota State and North Dakota was long on atmosphere and short on drama. \n\nCarson Wentz threw four touchdown passes and the Bison defense held UND without a first down for more than 40 minutes in a 34-9 victory on Saturday before a sellout crowd of more than 19,000 fans at the Fargodome. \n\nAfterward, Wentz acknowledged that fan interest in the game was \"really cool\" and tailgating \"must have been nuts,\" but added that he didn't feel he came away with much more than in-state bragging rights after the 111th game between the schools. \n\n\"Honestly, on the field it didn't feel any different,\" he said. \n\nThe rivalry was the longest series in Division II football when it ended in 2003 after NDSU decided to move up to Division I and UND stayed put. UND went D-I in 2008. The two teams have wound up in separate conferences and won't play the next game until 2019. \n\nUND head coach Bubba Schweigert, even in a lopsided loss, said he wants to play the game every year. \n\n\"I think this is the right thing to do, to play this game,\" Schweigert said. \"It's just my opinion. It's really special. Our high school football coaches think it helps them because it helps promote the state.\" \n\nThe Bison (2-1) finished with a 377-61 advantage in total yardage and 21-3 edge in first downs. It's the fewest yards that NDSU has given up since moving up to Division I in 2003. North Dakota (2-1) did not get a first down until 4:45 remained in the third quarter. \n\nBison defensive lineman Nate Tanguay said the Bison have made great strides since giving up 38 points in a seasoning-opening loss at Montana. \n\n\"Three and outs are helping us a lot,\" he said. \"We aren't on the field for 12 plays in a row.\" \n\nUND had a couple of minutes of success after the opening kickoff. It forced North Dakota State to punt on its first possession and return man Josh Seibel, the lone North Dakota native on the roster, returned it 54 yards to the NDSU 22. After three plays netted three yards, Reid Taubenheim kicked a 36-yard field goal to give UND a 3-0 lead. \n\nThat's when NDSU turned the rivalry into revelry. \n\nThe Bison piled up a total yardage advantage of 241-5 and scored 24 unanswered points, including three touchdown passes by Wentz. With 6:30 left in the half, NDSU had 204 yards of total offense to minus-7 for UND. The half mercifully ended when UND was whistled for illegal procedure, by rule forcing officials to run the final 7 seconds off the clock. \n\nNDSU head coach Chris Klieman said the noise was a key factor in the first half. \n\n\"I thought the crowd was dynamite. I thought early on they were a huge factor,\" he said. \"For us defensively we were able to get off on that snap count.\" \n\nWentz, who finished with 262 yards through the air, completed 12 of 19 passes in the first half. He had TD passes of 18 yards to Darrius Shepherd, 14 yards to RJ Urzendowski, and 22 yards to Chase Morlock. Wentz added a second TD pass to Urzendowski in the second half. \n\n\"We did pretty well against the run, but we knew Carson was a great quarterback,\" said UND safety Cole Reyes, who had 10 tackles. \"You're going to see him on Sundays one day.\" \n\nQuarterback Keaton Studsrud scored on a 1-yard sneak with 3:17 left in the third quarter for UND's only touchdown. That followed a turnover by NDSU on UND's seventh punt of the game. \n\n\"It was a fun atmosphere in my opinion. It was a fun game to play in,\" Studsrud said. \"It was a case where we needed to find a way to get in the end zone.\"", "source": "Sacramento Bee"}