{"published": "2015-09-16T22:03:18Z", "media-type": "News", "title": "Civicom Announces Gamification Tool on ChatterBox(R) Online Research Platform", "id": "55c648ff-9d76-40c4-babd-c9107ffff046", "content": "Civicom Marketing Research Services, a global leader in facilitating marketing research using telephone and web-based research tools, now includes gamification tools for its online research platform, Civicom ChatterBox(R). \n\nCivicom ChatterBox(R), Civicom's enhanced online bulletin board solution , provides clients an easily manageable medium for asynchronous group discussions and online focus groups. It allows respondents to log in and interact with other users virtually as they input their insights over extended timeframes through various in-platform activities. It enables researchers to collect different forms of data with built-in analytic tools that will enable them to extract insights efficiently. \n   \nHowever, a huge challenge remains for both quantitative and qualitative studies - total engagement of participants. As we navigate through the digital age, information is easily and readily accessible for consumption. Social media engagement is at an all-time high with microblogs and quick scroll-throughs as leading platforms, and people now have shorter attention spans, as various times a day they engage in this fast-paced level of consumption of information. As such, it is not unlikely that a study may suffer from disengaged completion and unreliable answers. \n\nCivicom has taken on this challenge and found gamification as an effective tool in inspiring respondents to proactively participate in a lengthy study. With the use of game components and external motivation in gathering data from respondents, the successful application of gamification is a powerful engagement strategy that influences respondents to commit in a dynamic manner to an activity that otherwise requires strong effort or will. It eliminates the need to keep re-recruiting respondents due to lack of reliable and useful insights, thus saving researchers money in the process. \n\nThe built-in gamification tool in Civicom's ChatterBox(R) platform allows project moderators to set up reward systems. Incentive points can be implemented for accomplishing activities such as ranking items, answering polls, or uploading media. Moderators can also tweak incentive options and allow participants to view their progress through points, as well as a leaderboard accessible by all project participants that inspires competitiveness and thus drives engagement. \n\nSince the platform's launch, various features and capabilities have been added to Civicom ChatterBox(R), giving researchers leverage and optimizing the platform's usability for effectively conducting studies. Aside from its user-friendly interface and mobile accessibility, the gamification capability is only the latest addition to the platform's wide array of tools that researchers can utilize to ensure successful insight tracking and maximum respondent engagement throughout a study. \n\nAbout Civicom Marketing Research Services \nCivicom Marketing Research Services is a global innovator in qualitative research tools using the latest technology solutions for marketing research. The company works hand in hand with market research firms, facilitating marketing research projects both locally, as well as those with extensive global reach. \n\nCivicom Marketing Research Services offers many options to enhance the research process for marketing research professionals. Civicom is the global leader in facilitating telephone and web-enabled IDIs and Focus Groups using Civicom CyberFacility(R). Civicom also offers Civicom InSitu(R) Mobile Research, a qualitative tool to conduct audio diaries and patient journeys.  Civicom operates in over 96 countries and offers extensive translation services for marketing researchers, as well as transcription services through TranscriptionWing™, and respondent recruiting through CiviSelect™. All of these services are available in Spanish, as well as English, as well as other languages. \n\nCivicom Marketing Research Services chooses to be as dynamic as it is innovative; always listening to and acting on clients' ideas and requests as makes sense. This kind of relationship has paved the way for the development and rollout of new services. \n\nTo learn more, email Civicom(R) at inquire(at)civi(dot)com or call +1-203-413-2423. \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12965941.htm \nPRWeb.com", "source": "Marketplace"}