{"published": "2015-09-06T16:58:44Z", "media-type": "News", "title": "'War Room' edges 'Straight Outta Compton' over slow weekend", "id": "34da662c-3c48-4eaf-89c1-06581976d01f", "content": "Sony's faith-based drama \"War Room\" has the edge on N.W.A biopic \"Straight Outta Compton\" with $9.3 million to lead the modest U.S. box office over the Friday-Sunday weekend. \n \n\"Straight Outta Compton\" took in $8.9 million at 3,094 locations in its fourth weekend, ending its impressive three-week winning streak at domestic multiplexes. The title should add another $2.3 million on Monday to cross the $150 million milestone, representing another triumph for Universal in a stellar 2015. \n \nSony/Affirm's \"War Room\" has continued to exceed projections following its surprisingly robust opening weekend, when it took in $11.4 million. The film, playing at 1,526 sites, is on track for a four-day Labour Day weekend haul of $12.3 million, bringing its 11-day total to $27.6 million. \n \n[embedded content] \n \n\"War Room\" stars Priscilla Shirer, T.C. Stallings and Karen Abercrombie and was directed by Alex Kendrick. It carries a low-budget price tag of $3.5 million and is the best performer in the genre since Sony's \"Heaven Is for Real\" took in $91 million in the U.S. last year. \n \n\"It's clearly a movie that's resonating with under-served audiences that are usually left out of the conversation,\" said Paul Dergarabedian, senior media analyst with Rentrak. \n \nThe holiday weekend appears to be the quietest of the year, which will be first of 2015 without a title topping the $10 million mark over the three-day period. \n \nRobert Redford's comedy \"A Walk in the Woods\" led the rest of the pack with $8.1 million at 1,960 sites and was projected to tack on $2.2 million on Monday. That's a decent performance for the first wide release from year-old Broad Green Pictures, the ambitious studio launched by brothers Gabriel and Daniel Hammond. \n \n[embedded content] \n \nParamount's sixth weekend of \"Mission: Impossible - Rogue Nation\" and EuropaCorp's launch of \"The Transporter Refueled\" were battling for fourth place. The fifth \"Mission: Impossible\" took in $7.2 million at 2,849 locations for the three days and was projected to add $2.1 million on Labor Day to boost its domestic total to $182.5 million. \n \nThe fourth \"Transporter\" brought in $7.1 million in 3,494 locations for Friday-Sunday and was projected to wind up the four days with $8.7 million. \n \nThe Weinstein Co.'s second weekend of Owen Wilson thriller \"No Escape\" came in sixth with $5.3 million at 3,425 sites. \n \nPantelion's opening of Mexican animated comedy \"Un Gallo con Muchos Huevos\" (A Rooster with Many Eggs) turned in a solid $3.4 million at 395 theaters.", "source": "Edson Leader"}