{"published": "2015-09-13T21:00:00Z", "media-type": "News", "title": "Parenting not as simple as 1, 2, 3", "id": "3b574be3-a63b-4774-b61f-14265147a849", "content": "Daughter's poor maths scores have prompted me to personally supervise her schoolwork I looked at my daughter's maths paper and I was stumped - not because the Primary 4 paper was challenging, but because she had scored a measly 19 marks out of 50.\n\nSurprise turned to horror, as I started imagining she would end up failing her Primary School Leaving Examination (PSLE) and be left sweeping floors and picking up bowls at the nearby hawker centre.\n\nI know this is an over-reaction, but scoring 38 per cent in maths is unacceptable for a girl who is in the second-best class in her school and who has not failed any maths exam before. She may not be as strong academically as her elder sister, but she is no slouch either. The dizzying results woke me up from my slumber. No, I am not hibernating, but I have been so busy with work that I have not been focusing on my children's academic needs.\n\nIt's easy to blame my second daughter for not studying hard enough or spending too much time playing video games. But I know I have to take partial responsibility for barely putting any effort to guide her along, especially since I am quite good at maths. In the past, my \"Tiger Mum\" wife - who is also a teacher - stayed home to discipline the children and ensure they completed the endless worksheets and assessment books that she prepared for them.\n\nThanks to the Ministry of Education's flexible work policy that allows teachers who are mothers with young children to take no-pay childcare leave until they turn four, my wife spent almost 10 years at home nursing and nurturing our three girls.\n\nWhen our youngest child turned four this year, that privilege ended and my wife is now back at work. Our hectic workload means that we have had little time left to teach the children.\n\nI decided to run through the test paper with my second daughter to identify her weaknesses. That was when I realised the problem was much worse than I had imagined.\n\nI knew she used to have difficulty rounding off numbers and decimals, and had helped her with that. I discovered she now has trouble with multiplication, adding fractions with different denominators and converting fractions to decimals.\n\nAt this rate, I thought to myself, it will only get worse. How can she stand a chance to complete problem sums when her basics are in the deep end?\n\nI used to be relaxed about her grades, since the PSLE is still some time away. But the discovery of her weak arithmetic fundamentals has sprung me into action.\n\nThe first thing I had to think about: Should I take away her smartphone?\n\nShe can spend hours lying on the sofa with it, reading fan fiction and playing games which require her to groom Pokemon-looking pets into majestic beings, while her grades are plumbing new lows.\n\nI have this part figured out - I will swop her smartphone with a dumb phone, so that she can remain contactable without spending all her time on mobile cyberspace.\n\nThe second thing I'm doing is to go through her schoolwork and figure out the fundamentals she needs to pick up for her level.\n\nI'm still trying to make sense of what she said: Teachers do not go through the textbook, but come up with their own teaching materials instead. Perhaps life was easier when I was in primary school, because understanding everything in the textbook was good enough for me to score As then. From what I remember, maths requires plenty of practice and perhaps that is what is missing.\n\nI hate to say this, but it looks like I will have to search for suitable assessment books to \"drill\" her into solving the various permutations of maths problems that may crop up in the exams.\n\nAnd last but certainly not least, I will have to set aside an hour every day to assign her work and check on her answers. To help me do so better, I'm thinking of investing in a Web camera that lets me monitor my home on my smartphone and comes with two-way audio communications, so that I can bark into the microphone if I see her lounging around instead of completing her assignments.\n\nI can do all this, or I can simply just hire a tuition teacher for her. The latter sounds enticing since I do not have to do anything else except write a cheque every month and monitor my spending.\n\nBut that would be a cop-out, wouldn't it? And one day when I am old, my child will also hire a foreign domestic worker to take care of me, instead of doing it herself.\n\nLike many things in my life, I will choose the harder path. Not because I am a masochist, but simply because it is the right thing to do.\n\nThe tuition teacher might\n\ndo his best for the child, but only the parent will be relentless until the child is able to pass her next maths exam.", "source": "Straits Times"}