{"published": "2015-09-11T20:04:52Z", "media-type": "News", "title": "Captain Eoin Morgan in awe of England's approach to game", "id": "440cc631-059c-45c7-8a73-462ad15e6b81", "content": "Captain Eoin Morgan is in awe of the fearless way England's fresh-faced one-day side approach the game. \n \r\n\t\t\r \nMorgan is a veteran of several different incarnations of England's limited-overs squad, started his international career with his native Ireland and has plied his trade in high-profile domestic tournaments like the Indian Premier League and Big Bash. \n\r  Eoin Morgan praised his side after they levelled the series \r \r \nBut he has never felt as calm in the eye of the storm as he did when Australia set his side 300 to win the fourth Royal London ODI at Headingley. \n\r\n\t\t\t\r \nIt was a Rubicon England had never before crossed against the old enemy but, inspired by Morgan's own measured 92, they sealed a three-wicket win with 10 balls to spare to force a decider on Sunday. \n\r\n\r\n\r\n\r \n\"I certainly feel chasing 300 is in our grasp with the group of players we have,\" he said. \n\n\"The attitude they show, I think, is outstanding. I've never had that sort of feeling in a side before during a chase. \n\n\"I was very optimistic about things. It's certainly not about experience because we're a young side it's just a 'let's take it on attitude' which is brilliant. \n\n\"We've had a little bit of success this summer and hope that continues because i think it will accelerate our learning.\" \n\r\n\t\t\t\r \nMorgan has been a solid performer regardless of results this series, hitting 38, 85, 62 and now 92 in his four knocks to date, as well as 74 in the one-off Twenty20. \n\nIt is quite a return for a player whose preparation for Australia consisted of taking a month away from the game following a run of low scores for Middlesex. \n\n\"I'm a firm believer that things work in cycles,\" he explained. \n\n\"When the cycle is in your favour you have to cash in and at the moment I'm taking advantage of a little bit of form which is good. \n\r\n\t\t\t\r \n\"There's only so many words you can say or so many words to inspire but the best way, definitely, is to lead from the front. \n\n\"I've managed to do that but the significant thing from this chase is that everyone managed to contribute, right down to Moeen Ali and David Willey finishing it off. \n\n\"It was brilliant.\" \n\nEngland now head back to Emirates Old Trafford for a grand finale to the international summer, where victory would ensure they end the season unbeaten in all formats against New Zealand and Australia. \n\n\"If momentum does exist I think it is with us,\" Morgan said. \n\r\n\t\t\t\r \n\"I think we managed to steal a little bit of it in Manchester last time and confidence is a certainly a contributor to that. \n\n\"We are going into Sunday with guys full of confidence, so we're really looking forward to it.\" \n\nBeaten skipper Steve Smith must now raise his troops one last time to close out a tour that has taken its toll physically and mentally. \n\n\"It's a final now, both teams have to turn up and play and we'll be up for the challenge,\" he said. \n\n\"The boys have to pick themselves up and make sure they are ready to go. \n\n\"We'll have to play their spinners better. We've just got to be a little more watchful and make sure we have wickets in the shed for the late onslaught.\" \n\n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Yorkshire Evening Post"}