{"published": "2015-09-01T17:49:02Z", "media-type": "News", "title": "Omlis Releases Secure Enterprise Security Technology with IBM", "id": "5a9f05a9-bd41-491d-b771-85a3699c7dbe", "content": "IBM ( NYSE:IBM ) \n      and Omlis, the emerging market leader for mobile security technology \n      today announced the release of their Secure \n      Enterprise Messenger (SEM) encryption technology on the IBM \n      SoftLayer platform. The downloadable Omlis Secure Enterprise Messenger \n      technology is now available on the IBM Cloud Marketplace to app \n      developers who employ IBM SoftLayer technologies for their backend \n      infrastructure, providing them with a highly secure synchronous request \n      response model of sensitive data exchange between client and server \n      applications over untrusted networks. \n \nIBM’s acquisition of SoftLayer in 2013 for approximately $2 billion \n      confirmed their ambition to lead the enterprise cloud market space, \n      taking advantage of the growing trend as large organisations began \n      outsourcing the management of their IT systems while providing smaller \n      organisations with cost effective, reliable and scalable computing \n      power. With Omlis Secure Enterprise Messenger technology, IBM have a \n      solution to suit a wide variety of applications and customers across \n      their Cloud Marketplace, SoftLayer and BlueMix platforms. \n \nMobile malware remains a significant cybersecurity threat, with 1.12 \n      percent of mobile devices monitored by IBM Trusteer in the first half of \n      2015 exhibiting an active malware infection, on par with PC infection \n      rates. \n \nThe increase of Man-in-the-middle attacks, Trojans, Viruses, Worms, \n      Spyware and many others signifies the growing shift in cybercriminal \n      resource and attention to the mobile channel. \n \nWith protocols like SSL and TLS created before the ubiquitous mobile \n      channel, most mobile applications are vulnerable to at least one of \n      these known attacks especially as these applications do not employ the \n      appropriate level of security. The Omlis Secure Enterprise Messenger \n      encryption downloadable on the IBM Softlayer ensures that every \n      application has its own uniquely encrypted data exchange channel, \n      eliminating any opportunities for data leakage. \n \nThe Omlis Secure Enterprise Messenger is built on the IBM SoftLayer and \n      marks a new era for secure communication technologies, providing mobile \n      application developers with significantly higher data exchange security \n      compared to multi-tenanted SaaS. \n \n“Omlis brings to market a high integrity encryption that is totally \n      secure, massively scalable, delivering the greatest operational \n      efficiency and offering the most compelling Return on Investment (ROI) \n      and engaging mobile commerce experience,” said John Stuart, Chief \n      Commercial Officer at Omlis. \n \nMr Stuart also added, “The highly differentiated Omlis Architecture and \n      portfolio of solutions are designed to completely eliminate the \n      opportunity for fraudulent transactions and are unrivalled in the \n      marketplace.” \n \nThe availability of the Omlis Secure Enterprise Messenger encryption \n      technology on IBM’s SoftLayer supports IBM’s offensive strategy and \n      priorities around the Internet of Things (IoT). Through SoftlLyer, IBM \n      have created a common platform where developers are empowered to create \n      useful applications for the growing network of connected devices and the \n      availability of the Omlis Secure Enterprise Messenger is aimed to \n      increase developer confidence in the absolute security of any data \n      exchanged to and from their mobile applications. \n   Copyright (2015) Business Wire. \nAll Rights Reserved.", "source": "Virtual Strategy Magazine"}