{"published": "2015-09-06T17:08:48Z", "media-type": "News", "title": "Blackmoney: Upto Rs 15 lakh award for info against defaulters", "id": "a40bcb9e-da28-4ee1-adab-876ac13d15c7", "content": "NEW DELHI: The Income Tax department has brought out new guidelines to award secret informers providing actionable clue about \"untraceable\" assesses who owe huge taxes and money to government including in TDS and self assessment tax category. \n \n\r\n\t  \n \n\r\n\tThe department last week issued a set of new instructions to all its offices in the country stating any person who provides credible inputs against a declared defaulter would be rewarded a 10 per cent booty of tax realised from such an entity, but upto a maximum limit of Rs 15 lakh. \n \n\r\n\t  \n \n\r\n\tThe new guidelines, effective from the last and current financial year, have been issued by the CBDT keeping in mind the huge challenge of tackling black funds in the country and at the same time boosting the revenue kitty. \n \n\r\n\t  \n \n\r\n\tThe informant, whose identity would be kept secret except in cases where law requires, will just have to give inputs \"supported by facts and documents\". \n \n\r\n\t  \n \n\r\n\tThe +department has, at the same time, made it clear that no \"speculation, vague or inputs of general nature and educated guess\" will be entertained in this regard. \n \n\r\n\t  \n \n\r\n\tThe guidelines state that any information about such assesses who are either not traceable or have stated inadequate assets to pay due taxes will be covered under the scheme brought out after high-level deliberations in the government including with the Special Investigation Team on black money. \n \n\r\n\t  \n \n\r\n\tFor the first time, the guidelines accessed by PTI state, any default of Tax Deducted at Source (TDS) or self assessment tax by an entity for over 6 months and about which the I-T department has publicly declared the default, will be covered under the scheme for 'informers' or people in the know to inform the taxman about. \n \n\r\n\t  \n \n\r\n\t\"Any specific or credible information of the whereabouts or assets of the person, on or after March 31, 2015 which results in the collection of taxes, penalities, interest or other amounts not exceeding 10 per cent of the tax realised which is directly attributable to the information or documents supplied by the informant, subject to a ceiling of Rs 15 lakh\" will be covered under the new guidelines. \n \n\r\n\t  \n \n\r\n\tA provision has also been kept to enhance this reward in exceptional cases after the approval of the Central Board of Direct Taxes (CBDT), the apex policy making body of the tax department. \n \n\r\n\t  \n \n\r\n\tThe I-T department, beginning this year, had also begun the practise of 'naming and shaming' big tax defaulters in the country by publishing their names, addresses and income tax dues in newspapers. \n \n\r\n\t  \n \n\r\n\tTill now, a senior officer in the department said, names of about 50 such large defaulters have been publicised who have a pending tax liability of close to Rs 2,000 crore. \n \n\r\n\t  \n \n\r\n\t\"More such names, including those under the TDS and self assessnent tax category, are in the offing,\" the officer said. \n \n\r\n\t  \n \n\r\n\tThe department has been told to ensure the secrecy of the indentity of the informer by allotting a unique number to them for communication. \n \n\r\n\t  \n \n\r\n\tThe department, the officer said, is leaving no stone unturned to mount additional measures in combating stash funds of Indians both within and outside the country and hence these newer strategies and methods are being undertaken.", "source": "Kaumudi"}