{"published": "2015-09-27T10:14:14Z", "media-type": "News", "title": "Politics ‘behind crippling taxi strike’", "id": "48d8eeef-732b-4f22-9d65-6f00fb22cd80", "content": "Durban - Durban taxi bosses believe they were being used as “political pawns” in this week’s four-day strike which brought the city to its knees. \n\r \nBafana Mhlongo, secretary of KwaZulu-Natal Taxi Association, made a damning claim that the strike had been ignited “behind the scenes” by politicians aligned to Zandile Gumede’s faction in the battle to lead the ANC’s eThekweni region. \n\r \nShe is challenging mayor James Nxumalo for the position of regional chair in the postponed elective conference of the ANC’s biggest region. \n\r \nMhlongo alleged allies of Gumede, who hold senior positions in the municipality, motivated Metro cops to launch their heavy-handed operation on Monday with the intention of provoking the taxi operators into strike action, which in turn would make the city appear ungovernable. \n\r \nThis, he said, was a deliberate ploy to portray Nxumalo as a failure prior to the elective conference scheduled for next month. \n\r \nGumede is also the committee chairwoman of Health, Safety and Social Services, which Metro cops fall under. \n\r \nThe date of the conference has not been announced. \n\r \nMhlongo said: “This is a deliberate move by people who want to use us to create instability so that the mayor is seen as failing to run the city.” \n\r \nHe also pointed fingers at City Manager Sbu Sithole for being behind this operation. \n\r \nSithole did not respond at the time of going to press. \n\r \nMhlongo said their view was reinforced by the fact that earlier this year taxis were impounded just before the eThekwini elective conference was to have taken place. Unruly delegates brought the conference to an halt. \n\r \n“Every time we approach the conference they impound our taxis, which would lead to chaos and people would blame Nxumalo. It’s clear that we are being used, that was one reason why we aborted the strike,’’ he said. \n\r \nThe strike was called off on Thursday after the taxi industry, provincial government and city reached an agreement to release impounded taxis to owners who paid a R1 500  fine \n\r \n“We don’t have tangible evidence, but we are confident we are being used to cause chaos in the city. The people behind this operation know we will strike. Their aim is to make the city ungovernable under the current leadership building up to the conference,” said Mhlongo. \n\r \nThe conference to elect the region’s chairperson has been marred by nullifications, postponements and cancellations. At stake is the city’s close to R40 billion budget. \n\r \nBheki Mbambo, deputy chair of the SA Taxi Council in KwaZulu-Natal, said they would fight against being used by politicians for political gain. “We want to remain as independent business people. We don’t want to be involved in politics because we are not politicians,” said Mbambo. \n\r \nHe said the long-standing unresolved issues between the taxi industry, Metro police and the Department of Transport must be resolved: “The department must get its house in order. They must process applications for permits in time, and there will be peace in the province.” \n\r \nSecretary of the ANC in KZN, Sihle Zikalala, who is believed to be backing Gumede, brushed off the claims, saying he would not like to comment on this matter because these were “baseless” allegations. \n\r \n“We will not like to give credence to things that are baseless,” said Zikalala. \n\r \nGumede expressed shock at the allegations. “All I know is that the strike was caused by the issue of permits. But I’m used to people who go around tarnishing my image and it doesn’t worry me any more,” she said. \n\r \nNxumalo, who is said to enjoy the support of premier Senzo Mchunu, could not be reached for comment. \n\r \n[email protected] \n\r \nSunday Independent", "source": "IOL"}