{"published": "2015-09-29T12:47:44Z", "media-type": "News", "title": "Oxford exhibition to mark new period in Cuba’s history", "id": "ab736417-9150-4373-a99f-cc0d9662d6c6", "content": "Castro’s Cuba \n \nArchant \n   \nTwo Oxford photographers will be joined by the Cuban photographer Juan Manuel Cruz del Cueto in an exhibition to be staged at St John’s College in St Giles, Oxford, 10 October \n  Castro’s Cuba \nOne of the last vestiges of the Cold War - the stand-off between Cuba and the United States- came to an end this autumn with Cuba and the Unites States resuming diplomatic relations. \n\nThis October also sees the 50th anniversary of the founding of the Cuban communist party. \n\nTo mark these events, two Oxford photographers will be joined by the Cuban photographer Juan Manuel Cruz del Cueto in an exhibition to be staged at St John’s College in St Giles, Oxford. \n\nThe Oxford exhibition – Castro’s Cuba – Hardship and Opportunity - opens on October 10th  Cuba’s Independence Day. It will be open to the public until October 24th. \n\nThe Oxford photographers Uwe Ackermann and Robin Laurance have both travelled widely in Cuba, facing challenges that only Cuba can present.  Their work shows a side of Cuba rarely seen by tourists.  Laurance is an established photojournalist and the Founding Director of the Oxford Photography Festival. He lives in Summertown. \n\nAckermann is a Professor Emeritus of Physiology who followed Castro’s example of arriving for his first visit to Cuba by boat. (The two Castro brothers famously arrived by motor yacht with their fellow revolutionaries in 1956.)  Ackermann, an experienced sailor and photographer, lives in Botley. \n\nJuan Manuel Cruz del Cueto has documented areas of Cuban life only accessible to insiders. He has worked with the UN and UNICEF and has gained special permission from the Cuban authorities and the British Home Office to visit Oxford during the exhibition. \n\nCastro’s Cuba  -  Hardship and Opportunity  will be at the Barn Galleries, St John’s College from October 10th – October 24th.    Opening times :  10.00am – 4.00pm.  Entry is free. \n\nPhotographs from the exhibition will be available to the media prior to the opening. \n\nJuan Manuel Cruz del Cueto will be available for interviews during the first week of the exhibition. \n\nA press and private view will be held at the galleries from 6 till 8 PM on October 1", "source": "Cotswold Life"}