{"published": "2015-09-27T17:00:00Z", "media-type": "Blog", "title": "12 fall clothing and style hacks every guy should know", "id": "0b8aaadf-ee31-44e1-bb8c-c4c7226b1f37", "content": "Fall is a time of uncertain weather and therefore uncertain clothing needs. Conquering the season in style means knowing what to wear, how to wear it, and of course, how to keep those much worn sweaters clean and pill-free. 1. Learn how to roll your shirtsleeves the right way. Art of Manliness\nInstead of rolling your cuff over on itself and up your arm, flip the cuff back and pull it to just below your elbow. Then take the bottom (inside-out portion) and fold it up so it traps and covers the bottom cuff. Your shirt sleeves won’t unroll again and it will hit the perfect place on your elbow. 2. The \"sometimes, always, never\" rule of jacket buttons. The top button should sometimes be buttoned (stylistic decision), the middle button should always be buttoned (it pulls the jacket together and is flattering), and the last button should never be buttoned (it messes up the tailoring and flare of the jacket on the bottom). If the jacket is only a modern two-button, the rule changes to \"always, never.\" Also remember to unbutton your jacket whenever you sit down.   3. Learn how to layer the right way. Layering is one of the most important ways to conquer fall and maintain an equitable body temperature. Learn how to do it properly. The most important rule is to layer from chunkiest to thinnest fabric, keeping the lighter items closest to your skin. Get four more layering tips here.  4. Fold your sweaters instead of hanging them. Mr. Porter\nNo matter the weight, the weave, or material, hanging sweaters stretches them out. It's much better to fold sweaters and store them in your dresser or wardrobe. 5. Use a sweater stone to get rid of pilling. Sweater stones are made of a porous volcanic rock that is especially effective at getting rid of those furry little balls (aka \"pills\") that gather under the arms and along the seams of your sweaters. Order one from Amazon.  Whatever you do, don't take a shaving razor to your nice sweater — it will destroy the fibers and possibly cause holes.  6. Eliminate musty odors with a dryer sheet. Even if you put them away clean, sweaters can get musty while sitting in storage during summer. A short, gentle, low heat cycle and a dryer sheet will fix this. But be warned: Sweaters do not like to be dried. Dry them for too long or on too high heat and you run the risk of shrinkage and pillage.  7. Try not to wear the same pair of shoes twice in two days. Flickr / Titof\nDon't just slip on the same pair of dress shoes day after day. Let your shoes rest in between wears so that any perspiration has time to dry. Even slight internal or external dampness can cause shoes to lose their shape.  8. Know when a shirt fits you — and when it doesn't. If you sit down and your shirt buttons pull, the shirt doesn't fit you. Time to get a size up. If your shirt does not fit square on your shoulders, it also does not fit you. Time to get a size down.  9. Use a lingerie bag. Though lingerie bags are designed for women's underwear, they're great to wash loafer socks, watch straps, and other small items in.  10. Avoid the dryer at all costs. Shutterstock\nFor most articles of clothing, dryers do nothing but destroy. Your clothes will last longer, look nicer, and not shrink if you hang-dry them instead. 11. Learn how to iron your shirt the simple, correct way.    12. Put your jeans in the freezer. Shutterstock\nJust because you're washing your jeans less doesn't mean you can ignore the stink. If your jeans start to smell a bit rank, throw them in the freezer. However, you should still wash your denim every 6 to 12 months. SEE ALSO: 22 men's fashion terms and what they actually mean DON'T FORGET: Follow Business Insider's lifestyle page on Facebook! NOW WATCH: This is what separates the Excel masters from the wannabes", "source": "Finance"}