{"published": "2015-09-17T01:19:21Z", "media-type": "News", "title": "Bears look to create pressure vs. Cardinals", "id": "956e9e80-23a2-4d2c-b8f3-ccd604725497", "content": "LAKE FOREST, Ill. -- The Chicago Bears never touched Green Bay Packers quarterback Aaron Rodgers in the season opener -- at least the statistics say this. \n \nSo preparing to face the Arizona Cardinals and the play-action deep passing threat posed by quarterback Carson Palmer becomes a matter of finishing the pass rush and finding big-play makers. \n\n\"I think we're capable and this is a different matchup, different style of offense,\" Bears coach John Fox said. \n\nWhether the Bears actually laid a hand on Rodgers is not as important as whether they achieved steady pressure. They did apply heat early, then faded away. They're one of only seven NFL teams that failed to record a sack in Week 1. \n\nIn facing Palmer, they'll see a less mobile passer and one who will stay in the pocket longer to deliver downfield. He'll also give them more of a chance to complete the rush because Rodgers has an uncanny knack for dancing out of the pocket to deliver a big throw. \n\n\"Obviously the most improvement we can make is just improving our pass rush and winning our one on one battles a little bit more than we did,\" defensive coordinator Vic Fangio said. \"I thought we competed well, we executed the defense, you didn't see people running free and were obvious errors to the naked eye, to anybody. We were there.\" \n\nFangio avoided laying blame on cornerback Alan Ball for getting beat by James Jones for a touchdown, or for the other two Rodgers touchdown passes. \n\n\"They were just a little bit better than us at the 50-50 balls in the air and they blocked us better in pass rush,\" Fangio said. \"They have to cover a little bit better and we have to help them with a little bit better pass rush. It wasn't good enough, but I was disappointed in the play but by no means discouraged.\" \n\nThe pass rush did force Rodgers into scrambling eight times and he got out of the pocket a few more times. Still, the Packers had to accept shorter completions most of the day and had no completions of 40 yards and four longer than 20. \n\n\"A big part of pass defense is the pass rush, and we've got to do a better job of getting some heat on the quarterback,\" Fangio said. \n\nPernell McPhee signed for $40 million over five years and had no sacks. And now McPhee is an injury concern after practicing on a limited basis due to a wrist injury Wednesday. \n\nIn his debut as a stand-up rusher, Jared Allen was left talking Wednesday about how much he liked when he played out of a three-point stance. He does have the option in some cases of rushing out of a three-point stance. \n\n\"I like the flexibility, I really do,\" Allen said. \"There's nothing better than having your hand in the ground and getting after it.\" \n\nDefensive play makers have to develop out of the scheme on their own, and Allen said the goal is to become strong enough they can be relied on at game's end. \n\n\"We want it to be on our shoulders,\" he said. \"I want this defense to be established and to put us on the field at the end of games. That's what I hope it is and I hope it doesn't take a long time. \n\n\"Really it shouldn't.\" \n\nSERIES HISTORY: 92nd regular-season meeting. Bears lead series 58-27-6. The Bears own a 37-11-5 advantage in home games. That doesn't include games played at Wrigley Field from 1930-37 when the Chicago Cardinals were the home team. \n\nINJURY NOTES \n\n--LB Pernell McPhee practiced Wednesday only on a limited basis due to wrist soreness. \n\n--DE Ego Ferguson did not practice Wednesday due to knee soreness. \n\n--LB Jon Bostic practiced Wednesday on a limited basis due to an ankle injury. \n\n--DB Sherrick McManis practiced on a limited basis Wednesday due to a thigh injury. \n\n--DB Tracy Porter did not practice Wednesday due to a hamstring injury. \n\n--LB Sam Acho practiced on a limited basis Wednesday after recovering from an undisclosed illness.", "source": "News Channel 21"}