{"published": "2015-09-08T20:40:00Z", "media-type": "News", "title": "NMSI Partner IDEA Public Schools to Be Featured on National Education Telecast", "id": "26016ed2-3d41-478e-9146-f4d4438216b3", "content": "RIO GRANDE VALLEY, Texas--(BUSINESS WIRE)-- \n\nIDEA College Prep San Benito, part of the IDEA Public Schools network, and a partner of the National Math and Science Initiative’s (NMSI) College Readiness Program, has been selected to be featured on Think It Up, an hour-long telecast special that will be simultaneously broadcasted live on all four major networks on September 11 at 8 p.m. ET & PT / 7 p.m. CT. Seeking to initiate a new movement in support of the nation’s students, teachers and schools, helping generate excitement about learning across the nation, Think It Up is a new education initiative spearheaded by the Entertainment Industry Foundation (EIF), a leading charitable organization of the entertainment industry, and supported by ExxonMobil among others. IDEA Public Schools is the only school network in Texas that will be featured on the program. \n\n\"We’re honored that the work being done in our classrooms, in partnership with the National Math and Science Initiative (NMSI) and our AP for All initiatives, is being recognized at the national level,\" said Tom Torkelson, founder and CEO of IDEA Public Schools. \"Without the shared commitment of our teachers and students to achieve excellence every single day, none of the remarkable accomplishments that are happening on our campuses would be possible.\" \n\nIDEA began a partnership with NMSI in 2014 to bring its proven College Readiness Program to six IDEA campuses including San Benito. The nationally recognized program is improving college and career readiness in high schools across the country by increasing the number of students participating and succeeding in rigorous college-level coursework in math, science and English, while expanding access to traditionally underrepresented students. \n\n\"IDEA Public Schools has been a fantastic partner, exemplifying the power of entire school communities working together to meet higher expectations,\" said Matthew Randazzo, CEO of NMSI. \"Their story reveals how collaboration, innovation and dedication can lead to profound outcomes, within and beyond the classroom.\" \n\nThe inaugural Think It Up telecast will aim to renew a sense of promise for all of America’s public school students through a first-of-its-kind platform to fund student-powered, teacher-led learning projects in partnership with DonorsChoose.org. Powerful stories will be featured throughout the program that will highlight teachers and students working together on innovative learning projects. The telecast will also feature live musical performances and appearances by celebrity guests, including Kristin Bell, Stephen Colbert, Scarlett Johansson, Matthew McConaughey, and Gwyneth Paltrow. \n\nFor more information, contact Tara Marathe at 972-983-3302 or tmarathe@nms.org. \n\nAbout NMSI \n\nNMSI is a nonprofit organization that provides scalable, rigorous and cost-effective program solutions that empower school communities to prepare all students to succeed in college and the workforce. Launched in 2007 by top leaders in business, education, and science, NMSI has received national recognition for improving student achievement and teacher effectiveness with proven programs including NMSI's College Readiness Program, NMSI's Laying the Foundation Teacher Training Program and NMSI's UTeach Expansion Program. Inaugural funding for NMSI was provided by ExxonMobil, the Bill and Melinda Gates Foundation, and the Michael and Susan Dell Foundation. For more information, visit www.nms.org. \n\nAbout IDEA Public Schools IDEA Public Schools is a growing network of tuition-free K-12 public schools serving over 23,000 students in 44 schools across Texas (San Antonio, Austin, and the Rio Grande Valley). IDEA has a track record of success that includes: all high schools ranked in the top 1% among the most challenging high schools in America (The Washington Post), and among the best in the nation (U.S. News & World Report); 100% college acceptance for nine years in a row, and a college graduation rate five times the national average for low-income students. IDEA families, students, and staff are proving that college is possible for all children. \n\nAbout Think It Up \n\nThink It Up is an initiative of the Entertainment Industry Foundation (EIF), a 501(c)(3) charitable organization, created to bring broad cultural attention to the urgency of improving the learning experience in America. Think It Up will invite public middle and high school students to work with their teachers to develop projects that draw on their passions and help pursue their educational goals. Posted on thinkitup.org, in collaboration with DonorsChoose.org, the student-powered, teacher-led projects will be crowdfunded by citizen donors beginning September 2015. \n\nAbout The Entertainment Industry Foundation The Entertainment Industry Foundation (EIF), established in 1942, harnesses the collective power of the entire industry to generate awareness and funds for critical health, educational and social issues. Stand Up To Cancer (SU2C), EIF’s largest initiative, was established in 2008. \n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150908006700/en/ Contact:NMSITara Marathe, 972-983-3302tmarathe@nms.org", "source": "Yahoo! Finance UK and Ireland"}