{"published": "2015-09-27T04:24:50Z", "media-type": "Blog", "title": "Patrick Towles bounces back with a huge win over Missouri", "id": "1911297c-3fb3-459b-9d5b-13faff0f4752", "content": "Photo by UK Athletics \n \nWhat a difference a week makes, right? After suffering another crushing loss to Florida last Saturday, the Cats rebounded tonight, beating #25 ranked Missouri 21-13. \n \nThere was a LOT riding on this game for Kentucky, and they delivered on almost every front, Patrick Towles silencing the haters, the defense holding up their part of the bargain, and the program getting a crucial win, its first over a ranked opponent in five years. \n \nLet’s break it down, because that was a lot of fun. \n Patrick Towles redeemed himself  \nTowles’ play was the story of the game. After a bad showing against Florida, many in the fan base were calling for Patrick’s curly-locked head. Towles swore off social media to escape the haters this week, and his focus today showed. Towles was 22-27 for 249 yards, two touchdowns and zero interceptions, and added another 21 yards on the ground for a touchdown. “Patty Feet” was back in a big way, with Towles scrambling like the QB of old. Jared Lorenzen called for Patrick to take back the reins and scramble when needed, and thankfully, he did tonight. \n \nAfter the week he’s had and the game he turned in tonight, can you blame him for celebrating like this? \n \n\n \nStoops told reporters afterwards that he’s pretty stingy with game balls, but he had to give one to Patrick tonight. \n \n“I gave him a gameball. I thought he played a really good game and made some really good plays with his feet and was aggressive down the stretch,” Stoops said. He added he was careful not to pile on the criticism before the game. “I don’t like to get involved with that. I really didn’t say much. Just go do what he does every day. Give him support and give him a pat on the back.” \n Five guys who were also crucial   Garrett Johnson : “Towles to Juice” is becoming a familiar refrain in Commonwealth Stadium, and Johnson led the team in receiving tonight with 6 catches for 119 yards. He and Patrick are developing some major chemistry, and I feel most confident when the ball goes in his direction.  Ryan Flannigan : The senior linebacker finally returned to the field tonight after recovering from a nagging shoulder injury, and his presence made a difference. Flannigan had 8 tackles tonight, and kept the pressure on Maty Mauk and his receiving corps. It’s really nice to have him back.  CJ Conrad: Conrad got his first touchdown as a Wildcat tonight, finally making the highlight reel for something other than blocking. He finished with three catches for 55 yards and the aforementioned touchdown. Stoops knew it was only a matter of time until the true freshman made his mark.   \n“I told Shannon to finally throw him the ball,” Stoops joked. “It was nice to see him get some catches. We knew it would happen.” \n  Dorian Baker:  After two huge drops in first quarters this season, admit it, you were a little worried when the ball headed in Baker’s direction. He didn’t help himself early on with an unfortunate unsportsmanlike penalty, but rebounded quickly to finish with 5 receptions for 51 yards and a touchdown. This catch should be in the SportsCenter Top 10:   \n\n  JoJo Kemp:  Kemp has become the forgotten running back in UK’s rotation, but he looked like the JoJo from the South Carolina series tonight, leading Kentucky’s rushing attack with 13 carries for 66 yards. In typical JoJo fashion, he came through in clutch moments, giving Kentucky renewed life when drives were becoming stale.   \n“I think he really had some critical runs,” Stoops told Tom Leach. “You never know who will have the big game, and our backs understand that.” \n  Honorable mention: I could go on and on, but for brevity’s sake, game balls also go out to Cory Johnson, Chris Westry, Jason Hatcher, and AJ Stamps. As Stoops emphasized in his postgame remarks, this was a team win in every form and fashion.   UK finally got a third quarter touchdown  \nThe third quarter has not been Kentucky’s friend this season, and I was pretty worried when the Cats seemed to implode after halftime. Patrick Towles, who looked so confident to start the game, was reverting to bad habits, and the rest of the team wasn’t doing much to help him out. Thankfully, CJ Conrad came along and broke the dry spell, hauling in his first touchdown reception as a Wildcat. That was enough to earn him a shoutout from legendary UK tight end Jacob Tamme: \n \nI see you @cjconrad1  #BBN \n \n— Jacob Tamme (@JacobTamme) September 27, 2015 \n \n\n The pass interference call on Blake McClain was terrible  \nAgain, it’s a win, so I don’t want to harp on negative things, but the pass interference call on Blake McClain at the start of the fourth quarter was really frustrating. The officials claimed McClain grabbed the other guy’s jersey, which wiped out a 70-yard interception return for a touchdown by AJ Stamps. Thankfully, the defense stood tall and recovered, but that could have been a call that would come to haunt the Cats. \n Stoops apparently danced in the locker room  \nGarrett Johnson told reporters that Stoops joined in the postgame locker room revelry, breaking out some dance moves that hopefully were recorded by a player with a quick iPhone trigger. Stoops laughed it off in his interview with Tom Leach, claiming that he was only trying to get the guys rounded up to talk about the win and got lost in the moment, but can you imagine? I’ve seen a LOT of awkward dancing to “Grove Street Party” in the past two weeks, but Stoops dancing would probably take the cake. Stoops paused several times during his remarks, telling reporters and Tom Leach the win felt like a blur. Apparently defensive coordinator DJ Eliot was so happy he walked around the Wildcat Den randomly hugging media members. As he kept repeating, this was a “huge win.” \n The path to a bowl looks MUCH more manageable now  \nA week ago, the world looked pretty bleak, didn’t it? The loss to Florida bruised the hopes of a fragile fan base that was finally believing, but, thankfully, the team’s resolve remained strong. Patrick Towles silenced the haters and showed he’s still the guy to lead this team. Most importantly, the path to the postseason looks promising, with the Cats halfway to bowl eligibility. All they need to do is beat EKU, Charlotte, and Vanderbilt. Four games in, would you have imagined a more manageable path? If the Cats can’t handle that, they don’t deserve to go to a bowl. \n \n“Much like a week ago, we were put in a situation where you needed to make some plays,” Stoops said. “It was nice to do it tonight. We were on the wrong end a week ago, but we have been in a bunch of close football games this year and came out with three victories – so, proud of that.” \n \nAfter falling on their face against Florida, the Cats took care of business and took a major step forward tonight, beating a ranked opponent and moving one step closer to a bowl. Not only that, they overcame some mistakes and won. How often have we been able to say that? For that reason alone, we should all feel like this right now:", "source": "Kentucky Sports Radio"}