{"published": "2015-09-10T20:25:29Z", "media-type": "News", "title": "Mater Dei music teacher slated to perform in Papal Choir at World Meeting of Families", "id": "465bbe6b-61bd-4e1e-b26e-b0caefbcf71d", "content": "Jason Strefeler, a music teacher at Mater Dei Catholic School, will sing in the Papal Choir during the pope's visit to Phildelphia. Geoff Patton — Montgomery Media \n LANSDALE >> It just might be the biggest stage Mater Dei Catholic School music teacher Jason Strefeler, of Bensalem, sets foot on. \nBefore millions of people, and accompanied by the Philadelphia Orchestra, he and 249 other singers will lift their voices in what is sure to be a performance they’ll never forget. \n\nStrefeler has been selected to be a member of the Papal Choir set to perform during Pope Francis’ visit to Philadelphia at the conclusion of the World Meeting of Families conference in Philadelphia Sept. 22 to 27. \n\nThe choir will perform during the Papal Mass on the Benjamin Franklin Parkway Sept. 27 at 4 p.m. where conference officials have estimated 1.5 million people to be in attendance. \n\n“I have heard so many stories from people attending the Mass the last time a Pope was here in the 1970s and how you could hear a pen drop during his address — it was so quiet,” Strefeler said Thursday, referring to Pope John Paul II’s visit to Philadelphia in 1979. “To see such a big crowd assembled, in the name of Catholicism, will be a holy experience — a unique experience.” \n\nThe 27-year-old music teacher, auditioned for the choir the last day try-outs were held at the Cathedral Basilica of Saints Peter and Paul in Philadelphia in the middle of the summer. He described the audition as challenging and one that really made him think about the notes he was singing with his baritone voice. \n\nAfter learning via email that he was selected to sing at the Papal Mass in mid-July, he said he was excited. Not only would he have a good chance to see the pope, but he was going to use a skill he said he is proud of — his voice — to honor him. \n\n“Pope Francis relates to the people,” he said. “He’s the way a Catholic should be, in my eyes. He’s out there, he’s meeting with people and he’s carrying on a lot of service to those around him.  He exemplifies and shows what it means to live the faith — he doesn’t expect anything in return.” \n\nThe choir has met twice thus far and will be practicing every other Monday until the week of the performance, he said. The week of the WMOF, Strefeler said that they’ll have three practices before the Papal Mass. During the practices, the choir has worked on pieces by Beethoven, Mendelssohn and songs specially composed for the event, he said. \n\nA children’s choir, as well as high school, Spanish, Vietnamese and African-American choirs are also slated to take the stage, he said. Continued... \n LANSDALE >> It just might be the biggest stage Mater Dei Catholic School music teacher Jason Strefeler, of Bensalem, sets foot on. \nBefore millions of people, and accompanied by the Philadelphia Orchestra, he and 249 other singers will lift their voices in what is sure to be a performance they’ll never forget. \n\nStrefeler has been selected to be a member of the Papal Choir set to perform during Pope Francis’ visit to Philadelphia at the conclusion of the World Meeting of Families conference in Philadelphia Sept. 22 to 27. \n\nThe choir will perform during the Papal Mass on the Benjamin Franklin Parkway Sept. 27 at 4 p.m. where conference officials have estimated 1.5 million people to be in attendance. \n\n“I have heard so many stories from people attending the Mass the last time a Pope was here in the 1970s and how you could hear a pen drop during his address — it was so quiet,” Strefeler said Thursday, referring to Pope John Paul II’s visit to Philadelphia in 1979. “To see such a big crowd assembled, in the name of Catholicism, will be a holy experience — a unique experience.” \n\nThe 27-year-old music teacher, auditioned for the choir the last day try-outs were held at the Cathedral Basilica of Saints Peter and Paul in Philadelphia in the middle of the summer. He described the audition as challenging and one that really made him think about the notes he was singing with his baritone voice. \n\nAfter learning via email that he was selected to sing at the Papal Mass in mid-July, he said he was excited. Not only would he have a good chance to see the pope, but he was going to use a skill he said he is proud of — his voice — to honor him. \n\n“Pope Francis relates to the people,” he said. “He’s the way a Catholic should be, in my eyes. He’s out there, he’s meeting with people and he’s carrying on a lot of service to those around him.  He exemplifies and shows what it means to live the faith — he doesn’t expect anything in return.” \n\nThe choir has met twice thus far and will be practicing every other Monday until the week of the performance, he said. The week of the WMOF, Strefeler said that they’ll have three practices before the Papal Mass. During the practices, the choir has worked on pieces by Beethoven, Mendelssohn and songs specially composed for the event, he said. \n\nA children’s choir, as well as high school, Spanish, Vietnamese and African-American choirs are also slated to take the stage, he said. \n\n“I’m really excited,” Strefeler said. “My parents said they’ll be watching on TV.”", "source": "Montgomery Media"}