{"published": "2015-09-15T20:43:55Z", "media-type": "News", "title": "Stanway cause an FA Cup upset after thumping Needham", "id": "a96ec8e6-ce3e-4fef-933b-d3b622db5a2b", "content": "STANWAY ROVERS marched into the second qualifying round of the FA Cup thanks to a stunning 3-0 victory at home to Needham Market tonight. \n \nAngelo Harrop’s side were three-up at half-time, following an amazingly one-sided first half against their shell-shocked Ryman Premier opponents. \n \nJake Clowsley slotted them into a ninth-minute lead, after Dan Heath’s goal-kick caused indecision between the Needham centre-halves. \n \nCraig Hughes then fired home from the penalty spot after a clear foul by Needham keeper Shaun Phillips. \n \nAnd Jordan Palmer steered home a right-wing delivery on the stroke of half-time to cap a dream first half for Stanway . \n \nNeedham fielded a strong side that included former Colchester United heroes Kem Izzet and Karl Duguid. \n \nHowever, Rovers could have been four-up at the break as they also missed a golden chance earlier in the half. \n \nBen Newson crossed from deep on the right but Jemal Fox headed back across goal and wide of the far post. \n \nNeedham’s night went from bad to worse three minutes into the second half. \n \nPhillips was shown a straight red card for an off-the-ball incident and under-18s keeper Tyler Hursey had to replace the crestfallen former U’s youngster. \n \nThe writing was on the wall for Needham and although they had spells of possession in the second half, they were unable to penetrate a well-organised Stanway defence. \n \nThe Suffolk side were reduced to nine men in the closing stages when substitute Adam Mills was sent off for a foul on Clowsley. \n   \n Share article  \n   \nTonight’s tie was a first qualifying round replay, after the sides drew 1-1 at Bloomfields on Saturday. \n \nStanway now entertain the winners of tonight’s match between Staines Town and Faversham Town.", "source": "Brentwood Weekly News"}