{"published": "2015-09-15T19:33:39Z", "media-type": "News", "title": "Kenny Chesney and Miranda Lambert Have Already Plotted a Summer 2016 Tour", "id": "f043dec6-a174-4551-95f4-a51fb2b881cf", "content": "According to our 2015 calendar, summer isn’t quite over yet. But that’s not stopping Kenny Chesney and Miranda Lambert from gearing up for the hottest ticket of next summer. \n\nFresh off his record-breaking Big Revival Tour, Chesney announced on Tuesday a brand new summer 2016 tour with Lambert on tap to join the stadium shows. \n\nThis isn’t the first time the country superstars have joined forces on stage. Lambert opened for Chesney back in 2009 and in June of this year, she made a guest appearance singing “You and Tequila” during Chesney’s tour stop in Chicago. \n\n“She’s got so much soul and grit, heart and the ability to get to the core of a song,” Chesney exclusively told ETonline. “Thinking about what song would make sense, well, she’s the kinda woman who understands that complicated feeling of waiting for something that’s not good for you, but feels so good.” \n\nAt the time, Chesney kept mum about a potential in-studio collaboration with Lambert — but clearly those creative juices were flowing! \n\n“Miranda is the real deal,” Chesney said in a press release on Tuesday. “She’s a songwriter, first, and a real vocalist. She’s puts it all out there when she’s on stage, and I loved touring with her so much in 2009, I can’t believe it’s taken us this long to get her back out here – because I love every single thing about who she is as an artist and a person.” \n\nSpecific tour dates have not yet been announced, but we do know that Chesney has tapped Sam Hunt and Old Dominion to serve as the opening acts. Both artists had previously penned hits for Chesney, including “Come Over” and “Save It For A Rainy Day,” respectively. \n\n“The second I heard Sam’s demo for ‘Come Over,’ I knew he was onto something very unique,” Chesney, who gave Hunt his first cut, said. “Watching him develop as an artist, seeing his songwriting evolve – and knowing how he brings it when he gets onstage makes him a perfect act to come out with us. He’s fun, alive and all about the music.” \n\nFans who saw Chesney’s Big Revival Tour this summer should already be familiar with Old Dominion (“Break Up With Him”), who will kick off this next tour with a longer set. Their debut LP, Meat and Candy, is out Nov. 6. \n\nNo word on when we can expect new tunes from Chesney, but Lambert has been pouring herself into the creative process ever since news broke that she and Blake Shelton had divorced in July. Get the scoop on her latest writing sessions in the video below. \n\nClick here to read full story »", "source": "997WTN.com"}