{"published": "2015-09-15T11:24:00Z", "media-type": "News", "title": "Big Growth in Austin for Big Data Company Quantcast", "id": "8a6db003-dcba-4718-ae06-aa7182aebac6", "content": "SOURCE Quantcast\n\nRapidly growing data and advertising leader opens new Texas office, looks to expand local team\n\nSAN FRANCISCO \n\n\"As we began to think about the rapid growth of our team, it became clear that a second US location would allow us to both grow quickly and cost effectively, thus driving top-line revenue and margin,\" said Rick Boyce \n\nThe new office will be located within the Capital Factory, a well-known entrepreneurial hub in Austin's \n\n\"Austin \n\nThe rapid growth trajectory of US real-time bidding (RTB) display advertising – increasing from an estimated $14 billion \n\n\"This is just the beginning of a very exciting time for Quantcast corporate sales and services,\" said Megan Edwards \n\nRSVP to the recruiting event here.\n\nSee current job openings here.\n\nAbout Quantcast\n\nQuantcast processes real-time data at the intersection of commerce and culture, providing useful, actionable insights for brands and publishers. Through Quantcast Measure, we have unlocked the data generated by more than 100 million digital destinations, helping publishers and creators understand and grow their businesses in ways never before possible. With Quantcast Advertise, adaptive modeling and intelligent machines are utilized to help thousands of marketers around the world find and interact with customers anywhere they connect to the digital world. Our more than 600 employees are driven by the potential for big data to radically improve everyone's connected experiences and transform the way we all make sense of the world.\n\nFor more information, visit www.quantcast.com.\n\nConnect with Quantcast\n\nRead the blog | Follow on Twitter | Visit on Facebook\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/big-growth-in-austin-for-big-data-company-quantcast-300142812.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WAFB"}