{"published": "2015-09-10T06:39:01Z", "media-type": "News", "title": "Morrison W.Sprmkts : Half Yearly Report", "id": "11e5c27e-2c12-43c0-a32d-b9874d35f67a", "content": "INTERIM RESULTS FOR THE HALF YEAR TO 2 AUGUST 2015\n\nMaking the core supermarkets strong again\n\nFinancial summary H1 like-for-like (LFL) sales (ex-fuel/ex-VAT) down 2.7%, Q2 LFL down 2.4% Total turnover down 5.1% to £8.1bn (2014/15: £8.5bn) Underlying profit before tax(1) (UPBT) down 35% to £117m (2014/15: £181m) UPBT £141m pre-restructuring costs (2014/15: £216m) Free cash flow pre-dividend of £479m (2014/15: £423m) Generated £64m of cash, post-dividend and pre-property disposals Underlying earnings per share(1) (EPS) down 35% to 3.73p (2014/15: 5.74p) Profit before tax £126m (2014/15: £239m) Operating working capital improvement of £125m Property disposal proceeds of £181m, profit of £96m achieved Impairment and provision for onerous contracts of £87m Interim dividend of 1.50p (2014/15: 4.03p). Full year dividend confirmed at not less than 5.00p Net debt reduced by £254m since year end, to £2,086m\n\nStrategic and operating highlights Listening programme shaping new strategy Six priorities to build on our strengths and improve the customer shopping trip:\n\n1. To be more competitive \n\n2. To serve customers better \n\n3. Find local solutions \n\n4. Develop popular and useful services \n\n5. To simplify and speed up the organisation \n\n6. To make the core supermarkets strong again Andrew Higginson, Chairman, said:\n\n\"David has very quickly formed a new team that combines the best of Morrisons home grown and external talent. I am also delighted that two new non-executive directors - Belinda Richards and Irwin Lee - have recently joined and strengthened the Board. They bring a wealth of experience, which will prove invaluable to Morrisons.\n\n\"During the first half, the team has made good progress in starting the turnaround journey. Whilst the management team need time to settle in, make the changes they see as important, and build trading momentum, I believe the team will deliver much improved profits and returns for shareholders.\"\n\nDavid Potts, Chief Executive, said:\n\n\"Since joining Morrisons, I have been struck by the passion and commitment of all our colleagues, and I want to thank them for their continued good work. Our colleagues have the key role in delivering an improved shopping trip for customers both in stores and online.\n\n\"Morrisons will be an organisation that listens. During the first half, the new Executive and leadership teams have been listening hard to colleagues, customers, suppliers and shareholders. They tell us there is a lot for us to do.\n\n\"The immediate priority is to deliver a better shopping trip to stabilise trading performance. Our six strategic priorities will then deliver improvement in the core supermarkets, where we have the greatest opportunity.\n\n\"It will be a long journey. We approach the challenge with energy, confidence and many strengths, particularly our strong balance sheet and cash flow, which enables investment in improving the customer shopping trip.\" Customers and colleagues are beginning to notice improvements, but the turnaround will take time and require sustained investment in the proposition.\n\nAs previously guided, we expect underlying profit before tax will be higher in the second half of 2015/16 than the first.\n\nSales performance (ex-VAT) Group LFL:\n\nSales ex-fuel* Sales inc-fuel* * For supermarkets, online and convenience stores, reported ex-VAT and in accordance with IFRIC 13 \n\nSummary of operational key performance indicators (KPIs) LFL Items per Basket \n\ny-on-y change* LFL Number of Transactions y-on-y change* * Excludes online and convenience Underlying profit before tax and underlying earnings per share include new business development and restructuring costs, but exclude profit/loss relating to property disposals and sale of businesses, IAS 19 pension interest, impairment and provision for onerous contracts. Wm Morrison Supermarkets PLC\n\nTrevor Strain - Chief Financial Officer\n\n0845 611 5000\n\nAndrew Kasoulis - Investor Relations Director\n\n07785 343 515\n\nMedia Relations\n\nWm Morrison Supermarkets PLC:\n\nJulian Bailey\n\n07969 061092\n\nCitigate Dewe Rogerson:\n\nSimon Rigby\n\n020 7282 2847 020 7282 1054\n\nManagement will host an analyst presentation this morning at 09:30. A webcast of this meeting is available at http://www.morrisons-corporate.com/Investor-centre/\n\nDial-in details: \n\nDial-in number: +44 (0) 20 3427 1915 \n\nPassword: Morrisons \n\nReplay facility available for 7 days:\n\nReplay access number:\n\n+44 (0) 20 3427 0598 \n\nReplay access code: - ENDS -\n\nThis announcement may include forward-looking statements, which are statements made about potential future events or occurrences. These statements are made by the Directors in good faith, based on the information available to them at the time of the announcement. Consequently such statements should be treated with caution due to the inherent uncertainties, including both economic and business risk factors, underlying such forward-looking statements and information.\n\nMorrisons has a commitment to reducing its impact on the environment. Accordingly we no longer send half-yearly communications to shareholders in paper format. Copies of this release are available to download.\n\nFinancial overview\n\nTotal turnover during the period was £8.1bn, down 5.1% year-on-year. Store turnover of £6.4bn, excluding fuel, was down by 1.1%, which comprised a LFL decrease of 2.7% (including a contribution of 1.0% from online) and 1.6% from new stores.\n\nFuel sales fell by 16.8% to £1.6bn, \n\nQ2 ex-fuel LFL was down 2.4%, a slight improvement on Q1 (-2.9%), with online contributing 1.0%. For Q2, Items per Basket was down 1.1% year-on-year, and LFL Number of Transactions down 2.6%.\n\nUnderlying operating profit, which excludes impairment and provision for onerous contracts and property disposal profits, was £163m, with operating margin down 67bps year-on-year to 2.0%.\n\nImpairment and provision for onerous contracts was £87m, driven by changes in estimates to provisions made relating to stores in the new space pipeline. Property disposal profits were £96m. Operating profit, including impairment and provision for onerous contracts and property disposal profits, was £172m.\n\nOur definition of underlying profit includes restructuring costs and new business development costs. Restructuring costs were £24m, primarily comprising head office restructuring (2014/15: £35m). This was part of the £30m-£40m 2015/16 restructuring costs we announced at the time of the first quarter trading update in May. New business development (NBD) losses for online and convenience were £30m (2014/15: £38m).\n\nIn addition, we are today announcing further restructuring and one-off costs, which will be incurred in the second half as we continue to reshape the business.\n\nThe proposed closure of 11 further stores will incur a restructuring cost of £20m, which will be included in underlying profit.\n\nAs announced yesterday, the sale of M local will result in a loss on disposal of around £30m. The intent to establish a new defined contribution pension scheme, which it is proposed will become the auto-enrolment scheme for colleagues in the future, will result in a charge of £35m. Both of these one-off costs will be excluded from our definition of underlying profit.\n\nNet finance costs were £47m (2014/15: £49m). \n\nUPBT(1) was £117m (2014/15: £181m). Adding back the £24m one-off restructuring costs, UPBT was £141m (2014/15: £216m). Reported profit before tax, after £9m net profit on property, was £126m (2014/15: £239m).\n\nUnderlying basic EPS(1) reduced by 35% to 3.73p (2014/15: 5.74p), reflecting the decrease in UPBT.\n\nCapital expenditure fell to £139m, from £257m for 2014/15, with cuts in all areas, in particular new store openings.\n\nFree cash flow pre-dividend was £479m, which included a further £125m improvement in operating working capital and £181m of property disposal proceeds. Half way into our three year plan to generate £2bn of operating free cash flow by the end of 2016/17, we have achieved £1,264m.\n\nOverall, post-dividend and pre-property disposal proceeds, Morrisons was again cash flow positive, generating £64m during the first half.\n\nGroup net debt fell - to £2,086m - from £2,340m at the end of 2014/15, and is down over £500m from the same time last year.\n\nThe proposed interim dividend is 1.50p.\n\nWe opened one new supermarket (26,000 square feet) and five M locals (14,000 square feet). As previously announced, we closed ten smaller supermarkets and 23 M locals. The impact was a reduction of 94,000 square feet in net new space.\n\nReturn on Capital Employed (ROCE) was 5.3%. \n\nMarket update\n\nThe economic recovery has been sustained in recent months. A rise in consumer confidence, real wage growth, and higher disposable income are all potentially positive for food retailers. Fuel prices have fallen and are expected to remain low.\n\nHowever, we have seen no change in shopping habits, with customers continuing to shop around for value and shopping more frequently. In addition, as we continue to lower prices, deflation has been a consistent recent feature of our LFL. Although some commentators predict the return of food price inflation, driven perhaps by higher global commodity prices, we expect deflation to continue as we keep investing in our proposition.\n\nStrategy update\n\nMorrisons has many strengths. It is a strong British business, with a reputation for fresh food, value-for-money, customer service, and the provenance provided by our unique vertical integration. Our colleagues are committed, passionate and highly skilled. The business is cash generative, with a strong balance sheet, a freehold property portfolio, a well-funded pension, falling debt and a well-invested manufacturing business.\n\nHowever, sales, profitability and returns all need to improve. Our immediate priority is to deliver a better customer shopping trip to stabilise trading performance. We then need to rebuild.\n\nWe are defining our improvement programme by listening to key stakeholders - customers, colleagues, suppliers and shareholders - and this is shaping the development of our strategy. Today we are announcing six strategic priorities: These priorities will deliver an improvement in the shopping trip and a turnaround of the core supermarkets. It will take time, and some components are still being developed or carefully reviewed by the new leadership team. However, we are confident the strategy is right for all industry trading conditions.\n\nThe six priorities also provide the business with many opportunities. The cost base can be reshaped and we can improve all elements of the Morrisons shopping trip. Improving the operational levers - sales, margin and asset intensity - will drive profit and ROCE. Improving the capital levers - addressing underperforming assets and capital returns - will grow the dividend and further enhance EPS. Throughout the process, debt will continue to fall.\n\nThe financial foundations of our strategy are unchanged. As previously guided, our proposition investment will increase this year. We also still expect to generate £1bn of cost savings and £2bn of free cash flow in the three years to 2016/17.\n\nInitial success will be measured through execution and outcome. Improving the shopping trip will mean more customers and more volume growth. Then, once the business is stabilised, we expect to improve LFL sales, rebuild profits and improve Return on Capital, while continuing to generate cash.\n\nThe six priorities\n\n1. To be more competitive\n\nMorrisons is a value-for-money brand and must always be competitive. We invested over £300m into the proposition last year and will invest more this year, with a further £181m already invested in the first half.\n\nIn March we cut the prices of key commodities and in June we did the same for everyday items. There will be more to come. We are working towards a simple, great value-for-money Morrisons price list that is right for our customers.\n\nBeing competitive is not just about price. We need to set out an offer that has real resonance with customers and organise the business to deliver this consistently. This means striking the right balance of price, coupons and promotions. As part of this process, we are currently reviewing our Match & More proposition.\n\nIn addition, we are providing much simpler and clearer in-store messaging for customers. In June, we re-set all in-store point-of-sale material. We further clarified and simplified our promotions, especially at front-of-store and on the key promotion ends. We now have fewer and more impactful promotions, with the typical display now carrying two or three of our very best deals at a simple price point.\n\n2. To serve customers better\n\nMorrisons has a reputation for good customer service. Our butchers, bakers, fishmongers and other skilled colleagues combine to make Morrisons different from other supermarkets. We are doing more to enhance that reputation. During the first half, we recruited 5,000 new in-store colleagues and re-scheduled the mix of hours to serve customers better at the busiest times of the week.\n\nWe have launched initiatives to remove wasted effort, improve on-shelf availability and ease pressure on the tills. For example, we have introduced express checkouts into all our stores. We are also currently replacing and upgrading the self-scan checkouts in all stores in time for Christmas, a programme of 40 stores per week.\n\nWe have listened to the preferences of our customers and will be re-laying Wine to a new look, by colour and country of origin throughout the next few weeks. In addition, all our Produce departments are currently being given a new look and feel. These are the first of many improvements to come. Customers are beginning to notice and our customer satisfaction scores have improved.\n\n3. Find local solutions\n\nMorrisons stores are generally well located, serving neighbourhoods and communities. We have an opportunity to improve our local customer offer store-by-store and make every square foot work harder to increase sales and profit.\n\nWe will tailor each store's offer to local tastes and demographics. A core offer will apply for each store, with managers given autonomy to flex outside the core to best suit local customers. The organisation will be largely central, but the execution local.\n\nIn addition, we are introducing programmes to be more active with local marketing and to better utilise our stores as centres of the local community.\n\n4. Develop popular and useful services\n\nWe plan to further enhance Morrisons reputation for great customer service. We already have some very strong service areas - for example dry cleaning, where we are the second biggest in the UK, petrol stations, pharmacies, and popular cafés.\n\nPlans are at an early stage, but we see several opportunities to provide third-party in-store or on-site services that will drive footfall to our stores. These will not require us to commit significant capital, but will generate income and enhance returns.\n\n5. To simplify and speed up the organisation\n\nMorrisons is at its best when it keeps things simple. We are delayering the business and building a culture based on speed and teamwork, so we can become more agile and responsive.\n\nDuring the first half, we completed the in-store restructure and now have fewer management layers, allowing colleagues to focus more on serving customers better.\n\nIn addition, we have just completed a major consultation and restructuring at head office, which will result in the removal of 720 roles. The leadership team has reduced from 110 to 65 people. This smaller team will have greater responsibility and accountability for bigger areas of the business.\n\n6. To make core supermarkets strong again\n\nWe aim to deliver our strengths in every store. We have nearly completed a programme to get all of the estate to a consistent standard, Back-to-Best, both inside and out. This will be done by the end of October.\n\nWe will accelerate the refit programme. We have over 200 stores that have not been brightened-up for over five years. Our new Fresh Look refit programme will upgrade the estate by the end of 2018/19.\n\nAll these improvements will be achieved within our existing capital expenditure expectations.\n\nNew leadership team\n\nKey to delivering the strategy and six priorities will be a strong management team. We have made good progress during the first half and now have a leadership team comprising home grown talent and experienced industry professionals recruited from outside Morrisons.\n\nWe have almost completed the formation of a new Executive team, which oversees the day-to-day operations of the business. It will comprise seven people. Alongside David Potts (CEO) and Trevor Strain (CFO), are Darren Blackhurst (Commercial Director), Gary Mills (Retail Director), Clare Grainger (People Director) and Mark Amsden (Company Secretary and General Counsel). We are seeking to fill the one remaining vacancy, Customer Director. After 25 years' service, Martyn Jones (Corporate Services Director) will retire at the end of October.\n\nDarren has extensive commercial experience. He joined Morrisons from B&Q, where he was Commercial Director. Previously he was Chief Executive of Matalan, and Chief Merchandising Officer of Asda \n\nGary has more than 30 years' retail experience, with Stewarts Supermarkets in Northern Ireland and with Tesco in both Ireland and the UK. Gary's experience covers all areas of retail and all formats, including supermarkets and convenience.\n\nClare has nearly 25 years of experience in Human Resources and management, mostly in the retail sector with Morrisons and, before that, Asda. Most recently she has been Morrisons interim Group Retail Director and has been leading the business through a number of measures to improve the customer shopping trip. \n\nOutside the Executive team, we have also made some key internal and external appointments in Commercial, Operations, Property, and Human Resources. We continue to identify the talent required to improve capability and are confident we are developing a strong leadership team to deliver the turnaround. We remain pleased with the key customer metrics of our online business and are on track with our original plan. We are also considering the broader digital opportunity, and how we can grow our online proposition while achieving an attractive return on capital. Yesterday we announced the sale of 140 M local convenience stores for a consideration of c.£25m in cash. We expect to incur a loss on disposal of around £30m during the second half of 2015/16. Morrisons retains a guarantee on individual lease obligations, which could revert to Morrisons if the new business does not succeed. The residual contingent liability in this event is estimated at up to £20m.\n\nConvenience remains an important growth channel, and we will continue to consider capital-light, returns-enhancing opportunities in the future.\n\nFinancial strategy and update\n\nCapital allocation framework\n\nOur capital allocation framework is unchanged. Our first priority is to invest to support the store estate and infrastructure, and reduce costs. Second, we will seek to maintain debt ratios that support our target of an investment grade credit rating. Third, we will invest in profitable growth opportunities. Fourth, we will pay dividends and; finally, any surplus capital will be returned to shareholders.\n\nOptimise assets\n\nWe are continually reviewing the performance of our supermarket store portfolio. In addition to the ten stores closed earlier this year, we are today announcing the proposed closure of 11 further stores which do not cover their cost of capital. For 2014/15, sales of the 11 stores were £86m and they were slightly EBIT loss making. \n\nThere will be a related one-off closure cost of £20m for the 11 stores during the second half of 2015/16.\n\nWe have opened one new store this year and do not plan to open any more during the remainder of 2015/16. In 2016/17, we expect the sales contribution from net new stores to be negative.\n\nShareholder returns\n\nThe 2015/16 total dividend will be not less than 5p per share, which the Board believes reflects the commitment to the capital allocation framework, while enabling cash flow flexibility to invest in delivering the turnaround. Beyond 2015/16, the dividend will be determined and communicated as appropriate by the Board.\n\n£1bn cost savings\n\nWe achieved first half cost savings of £189m, bringing the total to £419m in 18 months. We continue to expect £1bn of cost savings in the three years to the end of 2016/17, but are reviewing the different opportunities and re-prioritising components.\n\nThe recently announced head office restructure and harmonisation of the pension schemes will have immediate benefits. We have also been developing some new in-store cost saving initiatives, many of which have been successful and are already being introduced. For example, improved planning and control initiatives in our in-store warehouses have enabled better visibility of stock flow.\n\nWe are not rolling-out sales based ordering (SBO) immediately. One of our key priorities is better on-shelf availability, through improved and streamlined in-store process and updated stock ordering technology. These changes will deliver many of the cost saving benefits of SBO without the time, capital, and disruption risks SBO roll-out could have brought.\n\nCash flow and working capital\n\nOur free cash flow plans are progressing well, and we remain on-track to generate £2bn operating free cash flow in the three years to end-2016/17. This includes a target of £600m of operating working capital improvement. With £125m in the first half, we have now generated £331m of operating working capital 18 months into that plan.\n\nProperty disposals\n\nOur £1bn three year property disposal plan is on-track with £629m achieved so far, including £181m during the first half. We remain committed to a freehold store portfolio of over 80%, and are currently at 85%. The focus is now on property development opportunities and non-core asset disposals. We expect a net annual rent impact towards the lower end of the previously guided £20m-£25m range.\n\nCapital expenditure\n\nWe have reviewed our capital expenditure plans in detail. All components fell during the first half - new stores, non-core channels and IT. We still expect full year capital expenditure to be around £400m, as the Fresh Look refits start in the second half.\n\nIn future, we expect core supermarkets' capital expenditure to be sustainable at around £400m-£450m per annum. In addition, we now expect the previously announced 2015/16 £100m onerous contracts to be spread over the next two years, meaning £50m is now expected in 2015/16 and a total of £100m in 2016/17. Net debt has fallen by £254m since year-end, and we expect further progress in future. The half-year position of £2,086m is already within our 2015/16 year-end target range of £1.9bn-£2.1bn. We intend to launch a defined contribution scheme to sit alongside our Retirement Saver scheme. This will provide a lower cost option for our colleagues to save for retirement. Subject to consultation, we anticipate this will become the auto-enrolment scheme for colleagues in the future, and we expect to incur a related charge of £35m in the second half.\n\nCommercial income\n\nDuring the first half, commercial income was £179m (2014/15: £194m). Our definition comprises suppliers' marketing contributions and volume-based rebates, but excludes promotional funding as these are automatic deductions from costs and are triggered as units are sold with no subjectivity or judgement applied. We remain focussed on ROCE as an important KPI, and are committed to improving future returns.\n\n2015 Long Term Incentive Plan awards\n\nOnce the performance targets for the 2015 Long Term Incentive Plan awards have been determined, they will be communicated to shareholders via a disclosure in the Investor Relations section of the Morrisons website.\n\nCorporate responsibility and community\n\nHow we operate is very important to us. Our corporate responsibility programme ensures we work in a way that is right for our customers, colleagues, suppliers and communities, creating longer term sustainable growth. In June, we published our 2014/15 CR Review, which was independently verified by our assurance providers, DNV GL. It is available to download at www.morrisons-corporate.com/cr \n\nShortlisted for Most Sustainable Retailer of the Year\n\nWe've been recognised for our responsible business programme at this year's Retail Industry Awards and have been shortlisted for Most Sustainable Retailer of the Year. This award is for retailers who can demonstrate their full commitment to driving change by improving the sustainability of their operations. \n\nSustainable Fisheries - Ocean Disclosure Project\n\nIt is important that our customers know where our fish comes from and how it has been caught. We continue to work hard with our suppliers to ensure that all fish we stock is responsibly sourced, and to improve and certify all areas of our supply chain. \n\nWe have taken part in the Ocean Disclosure Project and demonstrated our commitment to corporate transparency by publishing the full lists of fisheries we use for sourcing alongside data on sustainability. The initiative, conducted with the Sustainable Fisheries Partnership, represents a step forward in corporate reporting. \n\nSupporting National charity partner, Sue Ryder\n\nOur customers and colleagues have so far raised a fantastic £3.2m for our partnership with Sue Ryder. We are working with the charity to help and support families throughout the UK. At the heart of the partnership is a shared belief that everyone should be able to get the care they want when they need it most, and that their families should be supported through the most difficult times. \n\nMorrisons partnership will enable the charity to establish community clinics, end-of-life-care online support communities, and family support teams. \n\nReducing our carbon emissions\n\nOur commitment to reduce operational carbon emissions by 30% by 2020, from a 2005 baseline remains a significant focus within our business. With five years of investment still to go, we have so far achieved a reduction of 23%. Earlier this year we introduced flexible benefits for colleagues - with the opportunity to sacrifice salary for childcare vouchers, cycle-to-work, laptops, tablets and mobile phones, plus a range of health and wellbeing options such as health assessments, dental and optical cover. \n\nWe are committed to supporting our colleagues in playing an active part in their communities. Underlying profit before tax and underlying earnings per share include new business development and restructuring costs, but exclude profit/loss relating to property disposals and sale of businesses, IAS 19 pension interest, impairment and provision for onerous contracts. \n\nWm Morrison Supermarkets PLC\n\nCondensed consolidated financial statements\n\nConsolidated statement of comprehensive income \n\n26 weeks ended \n\n2 August 2015 26 weeks ended 2 August 2015 26 weeks ended 3 August 2014 52 weeks ended \n\n1 \n\n1 February 2015 (audited) Cost of sales Gross profit Other operating income Profit/loss on disposal and exit of properties and sale of businesses Administrative expenses Operating profit/(loss) Finance costs Finance income Share of profit of joint venture (net of tax) Profit/(loss) before taxation Analysed as: \n\nUnderlying profit before tax Adjustments for: \n\nImpairment and provision for onerous contracts Profit/loss on disposal and exit of properties Profit arising on disposal of Kiddicare.com Limited Net pension interest income Profit/(loss) for the period attributable to the owners of the Company Other comprehensive income/(expense) Items that will not be reclassified to profit or loss: Remeasurement of defined benefit pension schemes Tax on defined benefit pension schemes Items that may be reclassified subsequently to profit or loss: Cash flow hedging movement Tax on cash flow hedging movement Other comprehensive income/(expense) for the period, net of tax Total comprehensive income/(expense) for the period attributable to the owners of the Company Earnings per share (pence) - basic - diluted Consolidated balance sheet 2 August 2015 2 August 2015 3 August 2014 \n\n4 1 February 2015 Non-current assets Goodwill and intangible assets Property, plant and equipment Investment property Net pension asset Investment in joint venture Derivative financial assets Current assets Derivative financial assets Cash and cash equivalents Non-current assets classified as held-for-sale Current liabilities Short term borrowings Derivative financial liabilities Current tax liabilities Non-current liabilities Derivative financial liabilities Deferred tax liabilities Net pension liabilities Net assets Shareholders' equity Share capital Share premium Capital redemption reserve Merger reserve Retained earnings and hedging reserve Total equity attributable to the owners of the Company Consolidated cash flow statement 26 weeks ended 2 August 2015 26 weeks ended 2 August 2015 26 weeks ended 3 August 2014 52 weeks ended 1 February 2015 Cash flows from operating activities Cash generated from operations Interest paid Taxation (paid)/received Net cash inflow from operating activities Cash flows from investing activities Interest received Proceeds from the sale of property, plant and equipment and businesses Purchase of property, plant and equipment and investment property Purchase of intangible assets Net cash inflow/(outflow) from investing activities Cash flows from financing activities Purchase of own shares for trust New borrowings Net repayment of revolving credit facility Repayment of other borrowings Dividends paid to equity shareholders Net cash outflow from financing activities Net decrease in cash and cash equivalents Cash and cash equivalents at start of period Cash and cash equivalents at end of period Reconciliation of net cash flow to movement in net debt in the period 26 weeks ended 26 weeks ended 52 weeks ended 2 August 2015 3 August 2014 1 February 2015 Net decrease in cash and cash equivalents Cash outflow from decrease in debt Cash inflow from increase in borrowings Other non-cash movements Opening net debt Closing net debt Consolidated statement of changes in equity Attributable to the owners of the Company Share capital Share premium Capital redemption reserve Merger reserve Hedging reserve Retained earnings Total equity 26 weeks ended 2 August 2015 (unaudited) At 2 February 2015 Profit for the period Other comprehensive income/(expense): Cash flow hedging movement Pension remeasurement Tax in relation to components of other comprehensive income Total comprehensive income for the period Employee share option schemes: Share-based payments Total transactions with owners At 2 August 2015 Attributable to the owners of the Company Share capital Share premium Capital redemption reserve Merger reserve Hedging reserve Retained earnings Total equity 26 weeks ended 3 August 2014 (unaudited) At 3 February 2014 Profit for the period Other comprehensive income/(expense): Cash flow hedging movement Pension remeasurement Tax in relation to components of other comprehensive income Total comprehensive income for the period Purchase of trust shares Employee share option schemes: Share-based payments Total transactions with owners At 3 August 2014 Consolidated statement of changes in equity Attributable to the owners of the Company Share capital Share premium Capital redemption reserve Merger reserve Hedging reserve Retained earnings Total equity 52 weeks ended 1 February 2015 (audited) At 3 February 2014 Loss for the period Other comprehensive (expense)/income: Cash flow hedging movement Pension remeasurement Tax in relation to components of other comprehensive income Total comprehensive expense for the period Purchase of trust shares Employee share option schemes: Share-based payments Total transactions with owners At 1 February 2015 (22) Notes to the condensed consolidated financial statements 26 weeks ended 2 August 2015 1 SEGMENTAL REPORTING Following the change in management structure, the Executive Committee is considered to be the Group's chief operating decision maker. The information received by the Executive Committee is consistent with that received by the previous Management Board. There are no differences from the 2014/15 Annual report and financial statements in the basis of segmentation. The Directors consider there to be one operating segment, that of retailing. The Executive Committee uses the underlying profit figure to measure performance. A reconciliation of underlying profit to the statutory position can be found in note 2. The Executive Committee also reviews a balance sheet containing assets and liabilities which is as shown within the Consolidated balance sheet. UNDERLYING EARNINGS The Directors consider that the underlying earnings and underlying adjusted earnings per share measures referred to in the results provide useful information for shareholders on underlying trends and performance. The adjustments are made to reported profit/loss to (a) remove impairment, provision for onerous contracts, or other similar items that do not relate to the Group's principal activities on an ongoing basis; (b) remove profit/loss arising on disposal and exit of properties and sale of businesses; (c) apply a normalised tax rate of 25.3% (3 August 2014: 26.0%, 1 February 2015: 26.1%); and (d) remove the impact of pension interest volatility. 26 weeks ended 26 weeks ended 52 weeks ended 2 August 2015 3 August 2014 1 February 2015 Note Profit/(loss) after tax Add back: tax charge/(credit) for the period 1 Profit/(loss) before tax Adjustments for: Impairment and provision for onerous contracts 1 Profit/loss arising on disposal and exit of properties 1 Profit on disposal of Kiddicare.com Limited 1 16 Net pension interest income1 Underlying profit before tax Normalised tax charge at 25.3%/26.0%/26.1% 1 Underlying profit after tax Adjustments marked 1 decrease post-tax underlying earnings by £20m (3 August 2014: decrease £49m, 1 February 2015: increase £1,016m), as shown in the reconciliation of earnings disclosed in note 6. Net profit on property is £9m. This includes profits arising on disposal of properties amounting to £96m. Following our continued review of the Group's store opening programme, this profit has been offset by an additional charge of £87m for changes in estimates related to the provisions for stores in the new space pipeline. In the period ended 1 February 2015, included within profit/loss arising on disposal and exit of properties is a charge of £19m relating to the closure of ten stores and six convenience stores. Impairment and provisions for onerous contracts in the period ended 1 February 2015 consists of £1,273m in relation to trading stores, of which £1,116m is impairment, £118m is onerous lease provisions, £30m relates to onerous commitments and £9m relating to lease premiums. Notes to the condensed consolidated financial statements 26 weeks ended 2 August 2015 26 weeks ended 26 weeks ended 52 weeks ended 2 August 2015 3 August 2014 1 February 2015 Sale of goods in stores and online Total store-based and online sales Other sales Total revenue FINANCE COSTS AND INCOME 26 weeks ended 2 August 2015 26 weeks ended 3 August 2014 52 weeks ended 1 February 2015 Interest payable on short term loans and bank overdrafts Interest payable on bonds and loan notes Interest capitalised Total interest payable Provisions: unwinding of discount Other finance costs Finance costs Bank interest received Amortisation of bonds Net pension interest income Other finance income Finance income Net finance cost Notes to the condensed consolidated financial statements 26 weeks ended 2 August 2015 The standard rate of corporation tax changed from 21% to 20% with effect from 1 April 2015. The normalised rate of tax of 25.3% (3 August 2014: 26.0%, 1 February 2015: 26.1%) has been calculated using full year projections and has been applied to the half year underlying profit. The standard rate of corporation tax of 20.2% (3 August 2014: 21.3%, 1 February 2015: 21.3%) for the year has been applied to the half year impairment and provision for onerous contracts charge, and the profit/loss on property related transactions, on an item by item basis. Legislation to reduce the standard rate of corporation tax from 20% to 19% from 1 April 2017 and to 18% from 1 April 2020 was included in Summer Finance Bill 2015. The legislation was not substantially enacted by the balance sheet date. Accordingly, deferred tax has been provided at 20%, being the rate substantively enacted by 2 August 2015, as required by IAS 34 Interim Financial Reporting. EARNINGS PER SHARE Basic earnings/(loss) per share (EPS) is calculated by dividing the earnings attributable to ordinary shareholders by the weighted average number of ordinary shares in issue during the period. For diluted EPS, the weighted average number of ordinary shares in issue is adjusted to assume conversion of all potentially dilutive ordinary shares. Underlying EPS It is the Directors' view that underlying EPS is the fairest reflection of the underlying results of the business. 26 weeks ended 26 weeks ended 52 weeks ended 2 August 2015 3 August 2014 1 February 2015 Basic EPS Underlying EPS Basic earnings/(loss) Earnings/(loss) attributable to ordinary shareholders Underlying earnings Earnings/(loss) attributable to ordinary shareholders Adjustments to determine underlying profit (note 2) Underlying earnings attributable to ordinary shareholders Weighted average number of shares Ordinary shares in issue/diluted ordinary shares Notes to the condensed consolidated financial statements 26 weeks ended 2 August 2015 GOODWILL AND INTANGIBLE ASSETS 2 August 2015 3 August 2014 1 February 2015 Net book value At beginning of the period Interest capitalised At end of the period The carrying value of goodwill and intangible assets principally consists of software development costs of £514m (3 August 2014: £477m, 1 February 2015: £495m). During the period assets costing £23m became fully depreciated (3 August 2014: £3m, 1 February 2015: £5m). Included within software development costs are assets under construction of £122m (3 August 2014: £212m, 1 February 2015: £153m). PROPERTY, PLANT AND EQUIPMENT 2 August 2015 3 August 2014 1 February 2015 Net book value At beginning of the period Interest capitalised Transfers to investment property Transfers to assets held-for-sale Depreciation charge for the period At end of the period During the period assets costing £66m became fully depreciated (3 August 2014: £361m, 1 February 2015: £439m). Included above are assets under construction of £12m (3 August 2014: £84m, 1 February 2015: £27m) and the net book value of land is £3,328m (3 August 2014: £3,764m, 1 February 2015: £3,329m). Notes to the condensed consolidated financial statements 26 weeks ended 2 August 2015 INVESTMENT PROPERTIES 2 August 2015 3 August 2014 (unaudited) 1 February 2015 Net book value At beginning of period Transfers from property, plant and equipment Transfers to assets held-for-sale Depreciation charge for the period At end of the period NON-CURRENT ASSETS CLASSIFIED AS HELD-FOR-SALE 2 August 2015 3 August 2014 (unaudited) 1 February 2015 Net book value At beginning of period Transfers from property, plant and equipment at net book value Transfers from investment property at net book value At end of the period The Group operates a number of defined benefit retirement schemes (together 'the Schemes') providing benefits based on a formula that depends on factors including the employee's age and number of years of service. The Morrison and Safeway Schemes provide pension benefits based on either the employee's compensation package or career average revalued earnings (CARE) (the 'CARE Schemes'). The Retirement Saver Plan ('RSP') is a cash balance scheme, which provides a lump sum benefit based upon a defined proportion of an employee's annual earnings, which is revalued each year in line with inflation. The movement in the net pension asset/(liability) during the period was as follows: 2 August 2015 3 August 2014 (unaudited) 1 February 2015 Net pension liability at start of the period Net interest income Curtailment gain Remeasurement in other comprehensive income Employer contributions Current service cost Administrative expenses Net pension asset/(liability) at the end of the period This is disclosed in the balance sheet as follows: 2 August 2015 Safeway CARE scheme Retirement Saver Plan Morrison CARE scheme Net pension asset at the end of the period Closure of CARE Schemes to future accrual In January 2015 the Group announced that it had reached an agreement in principle with the Trustees of the CARE Schemes to close them to future accrual, subject to the outcome of consultation with current scheme members. This consultation has concluded and an agreement has been reached, with changes effective from 5 July 2015. The financial effect of closing these schemes to future accrual is to reduce the Group's exposure to future volatility, increases in pension liabilities and cost. Subsequently, the Group has entered into an agreement in principle with the Trustees of the Scottish Limited Partnership. In addition to the £90m of properties contributed to the existing pension funding structure in 2012/13, the Group has provided an additional asset contribution of £150m. Under this agreement, the Group retains control of these additional properties unless the Group becomes insolvent. In the event of insolvency, these assets would form part of the Scheme assets. CASH GENERATED FROM OPERATIONS 26 weeks ended 26 weeks ended 52 weeks ended 2 August 2015 3 August 2014 1 February 2015 Profit/(loss) for the period Net finance costs Taxation charge/(credit) Share of profit of joint venture Operating profit/(loss) Adjustments for: Depreciation and amortisation Impairment of property, plant and equipment and intangible assets Profit arising on disposal and exit of properties and sale of businesses Adjustment for non-cash element of pensions charges Other non-cash charges Decrease in stock Decrease/(increase) in debtors Increase/(decrease) in creditors Increase/(decrease) in provisions Cash generated from operations Total working capital movement (the sum of items marked 1 above) is £191m in the period (3 August 2014: £120m, 1 February 2015: £289m). This includes £83m (3 August 2014: £nil, 1 February 2015: £157m) as a result of the impairment and provision for onerous contracts charge in the period (see note 2) and is net of £17m (3 August 2014: £24m, 1 February 2015: £74m) of onerous capital payments. Included within debtors in the Consolidated balance sheet is £1m in respect of property disposals recognised in the period (3 August 2014: £80m, 1 February 2015: £nil). Notes to the condensed consolidated financial statements 26 weeks ended 2 August 2015 13 ANALYSIS OF NET DEBT 2 August 2015 3 August 2014 1 February 2015 Cash and cash equivalents per balance sheet Bank overdrafts Cash and cash equivalents per cash flow Interest rate swaps Non-current financial assets Foreign exchange forward contracts Current financial assets Short term borrowings and current bonds Fuel and energy price contracts Foreign exchange forward contracts Current financial liabilities Private placement loan notes Revolving credit facility Cross-currency contracts and interest rate swaps Fuel and energy price contracts Non-current financial liabilities Net debt FINANCIAL INSTRUMENTS 2 August 2015 (unaudited) 3 August 2014 1 February 2015 Carrying amount Carrying amount Carrying amount Non-current financial assets Derivative financial instruments Total non-current financial assets Current financial assets Derivative financial instruments 6 Total current financial assets Current financial liabilities Short-term borrowings Derivative financial instruments Total current financial liabilities Non-current financial liabilities Derivative financial instruments Total non-current financial liabilities 14 All financial instruments carried at fair value within the Group at 2 August 2015 are financial derivatives and all are categorised as Level 2 instruments (3 August 2014 and 1 February 2015: Level 2). Level 2 fair values for simple over-the-counter derivatives are calculated by using benchmark observable market interest rates to discount future cash flows. Notes to the condensed consolidated financial statements 26 weeks ended 2 August 2015 26 weeks ended 26 weeks ended 52 weeks ended 2 August 2015 3 August 2014 1 February 2015 Equity dividends paid in the period The dividend paid in the period represents the cash payment of the final dividend of 9.62p from the 52 weeks ended 1 February 2015 (26 weeks ended 3 August 2014: represents the cash payment of the final dividend of 9.16p for the 52 weeks ended 2 February 2014. 52 weeks ended 1 February 2015: represents the cash payment of the final dividend of 9.16p for the 52 weeks ended 2 February 2014 and the interim dividend of 4.03p for the 26 weeks ended 3 August 2014). The Directors are proposing an interim dividend of 1.50p per share which will be paid on 9 November 2015 to shareholders who are on the register of members on 2 October 2015. The interim dividend will absorb an estimated £35m of shareholders' funds. This amount will be charged to retained earnings when paid. DISPOSAL OF KIDDICARE.COM LIMITED In the prior year, the Group disposed of Kiddicare.com Limited to Endless LLP, receiving consideration of £2m for the sale of the shares. This resulted in a profit on disposal of £4m in the comparative period. This profit was one-off in nature and so was excluded from reported underlying profit. As at 2 August 2015, one out of the ten leases relating to Kiddicare remained unassigned. SHARE CAPITAL Trust shares Included in retained earnings is a deduction of £46,485 (3 August 2014: £5m, 1 February 2015: £6m) in respect of own shares held at the balance sheet date. This represents the cost of 21,722 (3 August 2014: 2,915,374, 1 February 2015: 2,907,374) of the Group's ordinary shares (nominal value of £2,172 (3 August 2014: £0.3m, 1 February 2015: £0.3m)). These shares are held in a trust and were acquired by the business to meet obligations under the Group's employee share plans using funds provided by the Group. The market value of the shares at 2 August 2015 was £39,643 (3 August 2014: £5m, 1 February 2015: £5m). The trust has waived its right to dividends. These shares are not treasury shares as defined by the London Stock Exchange. During the period the Group acquired 116,663 (3 August 2014: 4,000,000, 1 February 2015: 4,000,000) of its own shares to hold in trust for consideration of £0.2m (3 August 2014: £8m, 1 February 2015: £8m), and utilised 3,002,315 (3 August 2014: 3,023,234, 1 February 2015: 3,031,234) trust shares to satisfy awards under the Group's employee share plans. Issue of new shares The Group issued 35,119 (3 August 2014: 37,970, 1 February 2015: 41,962) new shares to satisfy options exercised by employees during the period. Proceeds received on exercise of these shares amounted to £0.1m (3 August 2014: £0.1m, 1 February 2015: £0.1m). Notes to the condensed consolidated financial statements 26 weeks ended 2 August 2015 COMMERCIAL INCOME Commercial income remains an area of focus for the Group. This is an area which is currently not directly covered by accounting standards and there is no prescriptive disclosure best practice. The Financial Reporting Council ('FRC') has urged the Boards of retailers and suppliers to provide greater clarity in this area. Commercial income controls were disclosed within the Corporate Governance section of the 2014/15 Annual report and financial statements. The disclosure below is the first time the Group has made commercial income disclosures at the half year. The disclosure summarises the quantum earned in the income statement and the balance sheet position as at 2 August 2015. Commercial income is recognised as a deduction from cost of sales, based on expected entitlement that has been earned up to the balance sheet date for each relevant supplier contract. The Group only recognises commercial income where there is documented evidence of an agreement with an individual supplier. The types of commercial income recognised by the Group and the recognition policies are: Type of deduction Marketing and advertising funding Examples include income in respect of in-store marketing and point of sale, as well as funding for advertising. Income is recognised over the period as set out in the specific supplier agreement. Income is invoiced once the performance conditions in the supplier agreement have been achieved. Income earned by achieving volume or spend targets set by the supplier for specific products over specific periods. Income is recognised through the year based on forecasts for expected sales or purchase volumes, informed by current performance, trends, and the terms of the supplier agreement. Income is invoiced throughout the year in accordance with the specific supplier terms. In order to minimise any risk arising from estimation, supplier confirmations are also obtained to agree the final value to be recognised at year end, prior to it being invoiced. Commercial income earned in the period, by type of income, is summarised below: 26 weeks ended 2 August 2015 26 weeks ended 3 August 2014 52 weeks ended 1 February 2015 Commercial income: Marketing and advertising funding Volume-based rebates Total commercial income The following table summarises the uncollected commercial income at the balance sheet date at the end of each period: 2 August 2015 3 August 2014 1 February 2015 Commercial income trade debtor Accrued commercial income Commercial income due, offset against amounts owed As of 6 September 2015, £8m of the £12m commercial income trade debtor balance had been settled and £2m of the £30m accrued commercial income balance had been invoiced and settled. In addition, £31m of the £42m commercial income due had been offset against payments made. Notes to the condensed consolidated financial statements 26 weeks ended 2 August 2015 POST BALANCE SHEET EVENTS Disposal of Wm Morrison Convenience Stores Limited and associated M local assets Since the end of the period, on 9 September 2015, the Group has agreed the sale of its subsidiary Wm Morrison Convenience Stores Limited and associated M local assets to MLCG Limited for a cash consideration of c.£25m. The sale will result in an estimated loss on disposal of around £30m, which will be recognised in the second half. Following the sale, Wm Morrison Supermarkets PLC continues to guarantee leases in respect of its former convenience stores. If a lessee were to default, their lease obligations could revert back to the Group under the terms of the guarantees and become a liability of the Group. Responsibility statement We confirm that to the best of our knowledge: By order of the Board 9 September 2015 The Board The Board of Directors that served during the 26 weeks to 2 August 2015 and their respective responsibilities were: Andrew Higginson - \n\n- \n\n- \n\n- \n\n- Chairman* David Potts - Chief Executive Officer (appointed 16 March 2015) Trevor Strain - Chief Financial Officer Philip Cox CBE * Belinda Richard * (appointed 1 \n\n1 September 2015) Penny Hughes CBE* Johanna Waterous CBE* Irwin Lee * (appointed 1 September 2015) Richard Gillingwater CBE* (resigned 4 June 2015) Dalton Philips - Chief Executive Officer (resigned 16 February 2015) * Non-Executive Director Principal risks and uncertainties The principal risks and uncertainties set out in Wm Morrison Supermarkets PLC's Annual report and financial statements for the 52 weeks ended 1 February 2015 remain the same for this Half-yearly financial report. Those risks and uncertainties can be summarised as follows: High Impact Low Likelihood risks that may affect the Group: Strategic risks which would impact the successful execution of the Group's strategy: More information on the principal risks and how the Group mitigates those risks can be found on pages 30 to 33 of the 2014/15 Annual report and financial statements. You can view the 2014/15 Annual report and financial statements online on our corporate website, Notes to the condensed consolidated financial statements 26 weeks ended \n\n2 August 2015 General information Wm Morrison Supermarkets PLC (the 'Company') is a public limited company incorporated in the United Kingdom (Registration number 358949). The Company is domiciled in the United Kingdom and its registered address is Hilmore House, Gain Lane, Bradford, BD3 7DL, United Kingdom. The 2015/16 Half-yearly financial report does not constitute financial statements within the meaning of Section 434 of the Companies Act 2006 and does not include all of the information and disclosures required for full annual financial statements. The condensed consolidated financial statements for the 26 weeks to 2 August 2015 are unaudited. However, the auditor, PricewaterhouseCoopers LLP has carried out a review of the condensed consolidated financial statements and their report is included in this Half-yearly financial report. The comparative financial information contained in the condensed consolidated financial statements in respect of the 52 weeks ended \n\n1 February 2015 \n\n5 has been extracted from the 2014/15 Annual report and financial statements. Those financial statements have been reported on by PricewaterhouseCoopers LLP, and delivered to the Registrar of Companies. The report was unqualified, did not include a reference to any matters to which the auditor drew attention by way of emphasis without qualifying their report, and did not contain a statement under Section 498 of the Companies Act 2006. The 2015/16 Half-yearly financial report was approved by the Board of Directors on 9 September 2015. The Directors' assessment of the Group's ability to continue as a going concern is based on cash flow forecasts for the Group and the committed borrowing and debt facilities of the Group. These forecasts include consideration of future trading performance, working capital requirements, retail market conditions and the wider economy. The Group remains able to borrow cash at competitive rates and the Group has negotiated, and has available to it, committed competitive facilities that will meet the Group's needs in the short and medium term. Having reassessed the principal risks, the directors considered it appropriate to adopt the going concern basis of accounting in preparing the interim financial information. Basis of preparation The condensed consolidated financial statements of the Group for the 26 weeks ended 2 August 2015 have been prepared in accordance with the Disclosure and Transparency Rules Significant accounting policies The accounting policies applied by the Group in these condensed consolidated financial statements are consistent with those set out in the 2014/15 Annual report and financial statements. Taxes on income in the interim periods are accrued using the tax rate that would be applicable to expected total annual profit or loss. Whilst there have been a number of minor changes to standards which will become applicable for the financial period ended 31 January 2016, none have been assessed as having a significant impact on the Group. Judgements and estimates In preparing the condensed consolidated financial statements, management are required to make accounting judgements, assumptions and estimates. The judgements, assumptions and estimation methods are consistent with those applied to the 2014/15 Annual report and financial statements. Forward looking statements Certain statements in this H Independent review report to Wm Morrison Supermarkets PLC Report on the condensed consolidated financial statements Our conclusion We have reviewed the condensed consolidated financial statements, defined below, in the Half-yearly financial report of Wm Morrison Supermarkets PLC for the 26 weeks ended 2 August 2015. Based on our review, nothing has come to our attention that causes us to believe that the condensed consolidated financial statements are not prepared, in all material respects, in accordance with International Accounting Standard 34 \n\n4\n\n4 as adopted by the European Union and the Disclosure and Transparency Rules of the United Kingdom's Financial Conduct Authority. This conclusion is to be read in the context of what we say in the remainder of this report. What we have reviewed The condensed consolidated financial statements, which are prepared by Wm Morrison Supermarkets PLC, comprise: As disclosed in the basis of preparation note, the financial reporting framework that has been applied in the preparation of the full 2014/15 \n\n5 annual financial statements of the Group is applicable law and International Financial Reporting Standards (IFRSs) as adopted by the European Union. \n\nThe condensed consolidated financial statements included in the Half-yearly financial report have been prepared in accordance with International Accounting Standard 34, 'Interim Financial Reporting' \n\nWhat a review of condensed consolidated financial statements involves \n\nWe conducted our review in accordance with International Standard on Review Engagements (UK and Ireland) 2410, 'Review of Interim Financial Information Performed by the Independent Auditor of the Entity' \n\nA review is substantially less in scope than an audit conducted in accordance with International Standards on Auditing (UK and Ireland) and, consequently, does not enable us to obtain assurance that we would become aware of all significant matters that might be identified in an audit. Accordingly, we do not express an audit opinion. \n\nWe have read the other information contained in the Half-yearly financial report and considered whether it contains any apparent misstatements or material inconsistencies with the information in the condensed consolidated financial statements. \n\nIndependent review report to Wm Morrison Supermarkets PLC (continued)\n\nReport on the condensed consolidated financial statements (continued)\n\nResponsibilities for the condensed consolidated financial statements and the review \n\nOur responsibilities and those of the Directors \n\nThe Half-yearly financial report, including the condensed consolidated financial statements, is the responsibility of, and has been approved by, the Directors. The Directors are responsible for preparing the Half-yearly financial report in accordance with the Disclosure and Transparency Rules of the United Kingdom's Financial Conduct Authority. \n\nOur responsibility is to express to the Company a conclusion on the condensed consolidated financial statements in the Half-yearly financial report based on our review. This report, including the conclusion, has been prepared for and only for the Company for the purpose of complying with the Disclosure and Transparency Rules of the Financial Conduct Authority and for no other purpose. We do not, in giving this conclusion, accept or assume responsibility for any other purpose or to any other person to whom this report is shown or into whose hands it may come save where expressly agreed by our prior consent in writing. \n\nPricewaterhouseCoopers LLP \n\nChartered Accountants 9 September 2015 The maintenance and integrity of the Wm Morrison Supermarkets PLC website is the responsibility of the Directors; the work carried out by the auditors does not involve consideration of these matters and, accordingly, the auditors accept no responsibility for any changes that may have occurred to the financial statements since they were initially presented on the website. \n\nLegislation in the United Kingdom governing the preparation and dissemination of financial statements may differ from legislation in other jurisdictions.", "source": "Investegate"}