{"published": "2015-09-22T11:45:17Z", "media-type": "Blog", "title": "Michael Cook: Conner Eldridge’s Announcement Message Miscalculation", "id": "4047da68-83cf-4cec-8817-827aa895ba84", "content": "U.S. Senate candidate Conner Eldridge fits the profile of the type of candidate Arkansas Democrats need to rebuild their party. Impressive resume for someone his age, articulate and photogenic – usually a winning combination for a political candidate. \n \nUnfortunately, Eldridge’s message during his recent candidacy announcement left many Democrats dissatisfied and disinclined at this point to get behind his campaign. Without his political party fired up and behind him, it will be impossible for Eldridge to win. \n \nEldridge, a former U.S. Attorney appointed by President Barack Obama, announced his candidacy earlier this month to oppose incumbent Republican John Boozman. \n \nThe first part of his announcement press release was right on the money: \n \n“The work of a prosecutor in fighting crime isn’t a Democratic issue or a Republican issue. We need to take the same approach to creating a strong Arkansas economy, cutting government spending, waste and needless regulation, and making sure that everyone in Arkansas has an opportunity to succeed.” \n \nWhere Eldridge miscalculated was when he proceeded to poke Democrats in the eye by sounding almost exactly like John Boozman and forgetting the group of voters he needed to first persuade to support him was Arkansas Democrats. \n \nEldridge is a complete unknown to Arkansas Democrats, so there is no built-up goodwill or understanding for him when he stakes out positions that are beneficial to winning a general election, but might leave some Democrats disappointed. \n \nOn the topic of Obamacare, Eldridge gave a bit of a weak tea answer when asked about it by saying he would not vote to repeal the Affordable Care Act, but believed several parts of it were not good for Arkansas. \n \nActually, according to hard data , Obamacare has been a success in Arkansas, with our state having the greatest reduction of adults without health insurance in the entire nation. \n \nNationally and locally, Democrats paid in campaign blood over the past five years for the passage of Obamacare and now the program is proven to be working. Democrats are tired of their candidates playing defense over the ACA and they want their leaders to fight back on this issue. \n \nEldridge showed Arkansas Democrats that he would do nothing but offer up the same stale, non-effective responses from the worn-out playbook past Democrats used when it came to this issue. \n \nHe stated he’s opposed to the Iran nuclear deal. Eldridge will not win or lose because of this one issue, but by opposing it, he sent a signal to Arkansas Democrats that he stands with John Boozman and against the President. \n \nEldridge stated he was opposed to abortion, except for cases of rape, incest or when the life of the mother is in danger. Basically, he sounded just like John Boozman. Eldridge later sent out a statement to clarify this stance saying he didn’t believe Roe v. Wade should be overturned. \n \nSumming up Eldridge’s announcement, the way it sounded to the ears of Arkansas Democrats, was that he agreed with John Boozman on just about all the hot topics of the day. It’s hard to get fired up about a candidate who sounds just like his opponent. \n \nThe strategy of Arkansas Democrats distancing themselves from Obama didn’t work in 2010, 2012 or 2014, but that’s not to say that embracing Obama would have made candidates more successful. In fact, it probably would have made it worse. But now it’s time for a new strategy. \n \nTo win and rebuild their party, Arkansas Democrats must still stick to the political center, which is where most voters are, but the strategy of parroting Republican talking points no longer works. \n \nThe strategy should be retooled whereby Democratic candidates stake out issues that appeal to their base, even if they might be a bit unpopular with some independents, in order to better define themselves and their opponent. Fighting back over the Obamacare issue is an example of standing up for principles that work to make Arkansans’ lives better. \n \nHowever, moving wholesale to the left is not a winning strategy for Democrats in this Southern state. \n \nRepublicans will attempt to define Eldridge as “Obama’s lawyer,” and to win he will need to distance himself from the President on certain issues which many Arkansas Democrats will understand. But all still want a nominee who seems proud to be a Democrat, willing to push back against Republican attacks. \n \nEldridge miscalculated during his announcement by neglecting to offer compelling reasons why Arkansas Democrats should be fired up about his candidacy. \n \nThe good news is Eldridge fits the bill of what Democrats need in a candidate in terms of resume and political profile. Now he just needs a message that gets Democrats excited about his candidacy.", "source": "Talk Business"}