{"published": "2015-09-29T11:33:25Z", "media-type": "News", "title": "Baricitinib Superior to Methotrexate in Reducing Signs and Symptoms in Pivotal Phase 3 Study in Patients with Rheumatoid Arthritis", "id": "a39664cd-66ab-49c1-82d9-0fd1638c8c30", "content": "SOURCE Eli Lilly and Company; Incyte Corporation\n\nINDIANAPOLIS \n\n\"Too many people with rheumatoid arthritis who are treated with methotrexate – commonly used across the disease continuum for 25 years – do not achieve adequate disease control, which can cause disability and impede productivity,\" said David Ricks \n\nThe RA-BEGIN study included patients who had limited or no prior treatment with methotrexate, and were naïve to other conventional or biologic disease-modifying antirheumatic drugs (DMARDs). Part of a larger Phase 3 program of more than 3,000 RA patients at various points in the RA treatment continuum, RA-BEGIN enrolled nearly 600 patients who were randomized to one of the following treatment groups:\n\n\"The superiority of baricitinib over methotrexate in the treatment of patients with early RA adds to the positive data already seen for baricitinib in RA patients with inadequate responses to traditional DMARDs (RA-BUILD) and biological therapies (RA-BEACON),\" said Rich Levy \n\nIn RA-BEGIN, the incidence of treatment-emergent adverse events and serious adverse events, including serious infections, was similar across treatment groups. No cases of tuberculosis or gastrointestinal perforation were reported during the study. The most common adverse events observed were consistent with previous studies of baricitinib in RA. Discontinuations due to adverse events were more common in patients receiving the combination of baricitinib plus methotrexate. A large majority of patients completing RA-BEGIN opted to participate in a long-term extension study. \n\nLilly and Incyte announced top-line results in December 2014 \n\nAbout Baricitinib\n\nBaricitinib is a once-daily, oral, selective JAK1 and JAK2 inhibitor. There are four known JAK enzymes: JAK1, JAK2, JAK3 and TYK2. JAK-dependent cytokines have been implicated in the pathogenesis of a number of inflammatory and autoimmune diseases, suggesting that JAK inhibitors may be useful for the treatment of a broad range of inflammatory conditions. Baricitinib demonstrates approximately 100-fold greater potency of inhibition against JAK1 and JAK2 than JAK 3 in kinase assays. \n\nIn December 2009 \n\nAbout Rheumatoid Arthritis\n\nRheumatoid arthritis is an autoimmune disease[i] \n\nAbout Baricitinib Phase 3 Trials\n\nLilly and Incyte are conducting four pivotal Phase 3 clinical trials of baricitinib in patients with moderately-to-severely active rheumatoid arthritis to support regulatory submission in most countries. An additional Phase 3 study was initiated to support clinical development in China \n\nAbout Incyte\n\nIncyte Corporation is a Wilmington, Delaware \n\nAbout Eli Lilly and Company\n\nLilly is a global healthcare leader that unites caring with discovery to make life better for people around the world. We were founded more than a century ago by a man committed to creating high-quality medicines that meet real needs, and today we remain true to that mission in all our work. Across the globe, Lilly employees work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to communities through philanthropy and volunteerism. To learn more about Lilly, please visit us at www.lilly.com and newsroom.lilly.com/social-channels. (P-LLY)\n\nThis press release contains forward-looking statements (as that term is defined in the Private Securities Litigation Reform Act of 1995) about baricitinib as a potential treatment for patients with rheumatoid arthritis and reflects Lilly and Incyte's current beliefs. However, as with any pharmaceutical product, there are substantial risks and uncertainties in the process of development and commercialization. There is no guarantee that future study results will be consistent with study findings to-date, or that baricitinib will receive regulatory approvals or prove to be commercially successful. For further discussion of these and other risks and uncertainties, see Lilly's and Incyte's filings with the United States Securities and Exchange Commission. Except as required by law, Lilly and Incyte undertake no duty to update forward-looking statements to reflect events after the date of this release.\n\n[i] American College of Rheumatology, Rheumatoid Arthritis, http://www.rheumatology.org/practice/clinical/patients/diseases_and_conditions/ra.asp (Accessed: October 27, 2014 \n\n[ii] Hand Clinics, Advances in the Medical Treatment of Rheumatoid Arthritis, http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3135413/pdf/nihms305780.pdf (Accessed: October 27, 2014 \n\n[iii] WHO Global Burden of Disease Report, (table 7, page 32) 2004, http://www.who.int/healthinfo/global_burden_disease/GBD_report_2004update_full.pdf (Accessed Nov. 11, 2014 \n\n[iv] Arthritis Foundation, Medications for Rheumatoid Arthritis, http://www.arthritistoday.org/about-arthritis/types-of-arthritis/rheumatoid-arthritis/treatment-plan/medication-overview/ra-medications.php (Accessed: May 15, 2013 \n\nLogo - http://photos.prnewswire.com/prnh/20031219/LLYLOGO Logo - http://photos.prnewswire.com/prnh/20120608/DE21226LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/baricitinib-superior-to-methotrexate-in-reducing-signs-and-symptoms-in-pivotal-phase-3-study-in-patients-with-rheumatoid-arthritis-300150455.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "CW Richmond WUPV"}