{"published": "2015-09-26T13:05:29Z", "media-type": "News", "title": "Observer’s Mason receives key to city 20 hours ago", "id": "93d94350-a934-4221-8876-e5d634f67f1c", "content": "Retiring Wayne-Westland Observer Editor Sue Mason had a few words for the crowd after Mayor William Wild presented her with a key to the city. (Photo: Bill Bresler | staff photographer) \n\nJournalists usually try to stay out of the spotlight but Wayne-Westland Observer Editor Sue Mason was center stage at the State of the City Address. \n\nBefore beginning his speech, Westland Mayor William Wild recognized Mason, who is retiring next month, presenting her with the key to the city. \n\n“If you are an avid reader of the local Observer & Eccentric or live in the area, then you have to know Sue Mason,” said Wild. “After 35 years of community journalism, Sue is retiring. She has done an incredible job advancing news to our community through her work.” \n\nAlso editor of the Garden City Observer, Mason has been with the papers since 1985 and had worked previously for other suburban newspapers in Dearborn and Wayne. \n\n“Sue is someone who always exudes the highest level of professional excellence and brings true meaning to the term professional journalism,” said Wild. \n\nDuring her career, Mason has won numerous awards for her writing and for her sections from the National Newspaper Association, Suburban Newspapers of America and the Michigan Press Association. She has twice been recognized by the Michigan PTA for coverage of education and schools and she was honored by the Wayne-Westland Community Schools for her exemplary coverage of educational issues \n\nMason was also the 2007 Westland Civitans Citizen of the Year and served 15 years on the Schoolcraft College Women’s Resource Advisory Board. Mason is also a past recipient of the prestigious ATHENA Award that recognizes individuals on the merits of attaining and personifying the highest level of professional excellence and for opening the door to professional opportunities for women. \n\nA John Glenn High School graduate and Westland resident, Mason and her husband Bob have two children, Bobby and Carolee. \n\n“Sue, it is apparent in your writing that you know and care deeply about your hometown,” said Wild. “I have always enjoyed your columns and appreciate you keeping us abreast of important issues happening in our communities, and the fairness you have always showed me personally and my administration over the years.” \n\nWhen she attended a Westland City Council meeting in August, Mason said the mayor mentioned he would like to recognize her but she didn’t expect to be honored at the State of the City. \n\n“I’m kind of overwhelmed. I thank the mayor. The officials I worked with over the years were wonderful people,” she said. “I thank the people of the community for opening their doors to me. Journalists are kind of professional snoops and they trust us to do a good job with their story.” \n\nWhen she started her career 43 years ago, Mason said her goal was to be the best journalist she could be and that continues to be her goal. \n\nMason also thanked Observer & Eccentric publisher Susan Rosiek for being a wonderful mentor over the years. \n\nIn retirement, Mason said she is looking forward to spending evenings at home with her husband who was often left home while she was covering meetings or other night assignments. \n\n“I will truly treasure this,” said Mason, receiving the key to the city. \n\nlrogers@hometownlife.com \n\n734-883-9039 \n\nTwitter: @LRogersObserver \n\nRead or Share this story: http://www.hometownlife.com/story/news/local/westland/2015/09/25/wayne-westland-observer-sue-mason-key/728", "source": "Westland MI Observer"}