{"published": "2015-09-08T10:21:26Z", "media-type": "News", "title": "How to make online comments work", "id": "848f03a2-1536-454f-9533-e6fd4b33b0c8", "content": "Earning the right to an opinion on the Internet makes it that much more valuable. By David Glance.\n\nOf all of the things that people do online, the act of offering an opinion is not only one of the most popular activities, but it also underpins almost everything else that happens. Sharing opinions is also the foundation for creating communities, whether that is around blogs, news, social networks or e-commerce sites.\n\nVery early on, some sites recognised that opinions would carry much more weight if there was some way of increasing the level of trust between those offering the opinion and those seeking it. In the “real” world, this is normally done through a person having earned a reputation. Review sites like Yelp, for example, signal the reputation of reviewers by listing the number of connections they have on the site, how many reviews they have done and most importantly, whether they have earned an “elite” status.\n\nTechnological question and answer site Stack Overflow explicitly awards reputation points to those asking or answering questions that get “upvoted”. Only people with a certain reputation are allowed to upvote and so the system allows people to very quickly filter relevant questions but also the answer that the most trustworthy people, thought was best.\n\nWhat Stack Overflow has done is establish an extremely effective “reputation system” that allows everyone to be able to quickly assess the quality of an opinion or review expressed by users of that site.\n\nSites like eBay used the mutual rating of buyers and sellers to establish enough trust to enable transactions to happen between unknown people online. This in turn allowed companies like Airbnb and Uber to also be able to establish trust in the physical world through reputation managed online.\n\nWithout trust between a host and guest, Airbnb would not be able to function. Somewhat differently from eBay, however, reputation on Airbnb comes from the company allowing host and guest to review each other and for this information to be publicly available.\n\nFor a host wanting to succeed in renting out a property, having positive reviews is important but perhaps less obviously, it is also important for a guest who is interested in using the service on an ongoing basis to maintain their own high rating. Having the guests being reviewed not only improves their chances of being trusted by hosts, but it enhances the reputation of their reviews, making them of more value to other hosts and guests alike.\n\nAirbnb could have implemented a simple one-way review system, and even allowed anonymous reviews. What Airbnb would have lost, however, is the mutual interest that is created by the public review of both hosts and guests and as a result of that, also lost the social network, or community it has built around its company.\n\nThe principle works in the same way for ride-sharing company Uber, where drivers and passengers give each other mutual ratings. As with Airbnb, the mutual ratings have forged a community and also helped to maintain high levels of good behaviour on the part of the riders and “drivers”.\n\nIt turns out that the ability to create a community of users in this way is an essential characteristic of companies that have been dubbed “network orchestrators”. When researchers compared this type of company to traditional technology and other service or manufacturing companies, they found that they made much larger revenues and were valued significantly more highly. Uber, for example, is valued at a massive US$50bn.\n\nA common problem encountered in establishing reputation is how to avoid manipulation and gaming of the system. Concerns have been expressed for example that the pressure to rate an Uber driver with a 5-star rating has lead to the rating being meaningless. This doesn’t seem to have been borne out in practice however, and Uber will (and does) intercede with drivers whose ratings drop below a certain level suggesting that riders are prepared to give less than perfect ratings.\n\nIf mutual rating enables an effective system of establishing reputation and increases the value of opinion, the reverse is also true. Not establishing the reputation of those people giving opinions render those views far less valuable.\n\nAsking people to rate medical services, universities and academics without qualifying those giving those opinions makes the overall ratings provided much less meaningful. For students rating a university for example, there is a big difference between the opinion of a student who scraped through and didn’t attend regularly, and that of a high performing student who had perfect attendance.\n\nThe ratings in these types of surveys also suffer even more when they are done anonymously which can encourage the transition from constructive opinion to trolling.\n\nIn the physical world, there are a range of cues that help establish trust in both people and organisations. This trust, in turn, forms social capital which has an implicit value. As the basis of online reputation systems, mutual rating takes the idea of social capital one step further by surfacing its explicit value through the communities it enables. For those companies that manage to create these online communities, it really has proved to be the digital “philosopher’s stone”, turning social capital into huge financial gains.", "source": "TechCentral.co.za"}