{"published": "2015-09-26T04:59:15Z", "media-type": "Blog", "title": "Jagdeo performs gymnastics on Berbice Bridge", "id": "8bda6274-7aaf-4d4d-8c5e-eb9e8a94be6b", "content": "…advocates Govt. buyout \n \nFormer President Bharrat Jagdeo \n \nFormer President, Bharrat Jagdeo, has said that he would not oppose the Berbice Bridge toll being lowered.  He is also promoting a buyout of the private equity in the Bridge by Government. \nJagdeo, as he hosted a press conference at Freedom House, yesterday, said that his position stems from the promise and advocacy of the coalition A Partnership for National Unity/ Alliance for Change (APNU+AFC) Government. He wants to see if they can deliver on their promise, he said. \nThe People’s Progressive Party Civic (PPP/C), according to Jagdeo, “never promised a reduction of the toll in the (elections) campaign…The PPP could have easily committed a reduction in the toll.” \nJagdeo said that the then government had looked at what the persons paid to cross the Berbice River using the ferry service. “They were paying $1,500 for a vehicle already and they had to also pay for every passenger in the vehicle.” \nAccording to Jagdeo, what is being charged by the Berbice Bridge Company is similar to what was being paid to use the ferry service, “but the benefit of it is that people can move at their convenience.” \nHe was adamant that it is the APNU+AFC Government “that advocated a $1,000 reduction in the toll.” This, he said, the coalition subsequently revised to $300. \n“I will never stop supporting anything that can bring benefit to people,” said Jagdeo. \nHe said that he is in fact supportive of all the promises made by the coalition to bring benefit to the people, including a promised 20 per cent increase in pay for public servants. \nThe former president said that Guyana does not have a “co-government”. “If the government wants to buy out the bridge, that is its solution; if it doesn’t want to, fine….if it wants to buy out the bridge and drop the toll as it promised, fine.” \nHe suggested, too, that should Government want to explore some other measures “to implement its promise, fine.” \nJagdeo was adamant that if the APNU+AFC Government does not deliver on its promise, “its fine with us too, but they need to be man enough to say that they were wrong again on this, that their campaign was wrong. They said the bridge was a cash cow for friends and family of the PPP.” \nJagdeo said the nation is now being told that the Berbice Bridge Company is now claiming that “people didn’t get any dividends on their investment.” \nHe said the impression created, using the description of a ‘cash cow,’ is that people are drawing down large returns on their investments. \n“We shouldn’t be offering solutions to the government they should fix the problem now…They made the promise, they should fix it.” \nThe former president told members of the local media corps that during a recent party outreach to sections of Berbice, he met with that branch of the Chambers of Commerce and the issues surrounding the bridge was raised. \n“The issue of the bridge came up and many of them were urging that we get involved,” said Jagdeo. \nHe reported to media operatives, “I said to them, we don’t have co-government now, we have a government, we have an opposition.” \nJagdeo reiterated that it was the current government during its campaign that promised a reduction in the tolls being charged to cross the Berbice River utilizing the bridge. \nHe drew reference to the fact that government had set aside $36M to subsidize the bridge company in face of lowered tolls but more than $60M was allocated to the Prime Minister “to fix up his house, buy furniture and a vehicle.” \nAs such, Jagdeo argues that if in fact the priority of the APNU+AFC administration was the lowering of the tolls across the Berbice River, then it could have allocated a larger amount to be used as a subsidy. \nGuyana, he said, “is not a bankrupt country, they had lots of room…They had more room to do much more in relation to the bridge.” \nIn fact, in his newfound calls in support of a buyout of the equity in the Berbice Bridge, Jagdeo argues that Government has at its disposal some $30B to utilize from the numerous semi-autonomous agencies, “the so called private accounts that the government can transfer anytime.” \nHe was making reference to monies held in private accounts by agencies such as the Guyana Forestry Commission (GFC) and the Guyana Geology and Mines Commission (GGMC), the Lotto Funds, among others. \n“Remember they said that this money was held outside the budget and the only reason it was held there was for us to steal it…So there is still about $30B being held out there that they can use, I think, if they want they can negotiate a settlement and take back the bridge.” \nShould the APNU+AFC Government be able to realize this option, Jagdeo said, it can then significantly lower the tolls and this would not require the entire $30B amount available. \n“They can spend about 15-20 per cent (of the $30B) and get back the bridge…We will support anything that brings down the toll for the Berbice Bridge,” said Jagdeo.", "source": "Kaieteur News"}