{"published": "2015-08-27T12:25:12Z", "media-type": "Blog", "title": "The Shunyata Research HYDRA TRITON v2, HYDRA TYPHON, HYDRA DPC-6 v2, and ΞTRON Σ SIGMA AC Power Cables", "id": "9501d14c-9949-43d8-bbf0-57a9767159f4", "content": "HYDRA TRITON V2\nDevice Type: Power Distributor\nInlet: IEC-C20\nOutlets: 8 outlets\nDimensions (H x W x D): 6 inches X 17.25 inches X 17.125 inches\nWeight: 40 pounds\nPrice: $6995.00\nHYDRA TYPHON\nDevice Type: Power Conditioner designed to be used with the TRITON\nInlet: IEC-C20\nOutlets: AC Cable provided for connection to TRITON\nDimensions (H x W x D): 5.75 inches X 17.25 inches X 16.50 inches\nWeight: 42.5 pounds\nPrice: $5995.00\nHYDRA DPC-6 v2\nDevice Type: Power Distributor\nInlet: IEC-C20\nOutlets: 6 outlets\nDimensions (H x W x D): 4 inches X 17 inches X 16.25 inches\nWeight: 25.4 pounds\nPrice: $4750.00\nΞTRON Σ Sigma AC Cable\nDevice Type: AC Cable\nVersions Evaluated: Σ SIGMA DIGITAL, Σ SIGMA ANALOG, Σ SIGMA HIGH-CURRENT\nPrice: Σ SIGMA DIGITAL IEC15 $2495.00, Σ SIGMA ANALOG IEC15 $2495.00, Σ SIGMA HIGH-CURRENT IEC 20 $3495.00\nCGS-10 Cable\nDevice Type: Ground Cable\nLength: 1 meter\nPrice: $192.00 for 1 meter; Base price $120 with length charge of $18.00 per ¼ meter\nAvailability: Authorized Dealers\nWebsite: www.shunyata.com The Shunyata Research TRITON v2, HYDRA TYPHON, HYDRA DPC-6 v2, and ΞTRON Sigma AC Power Cables represent the state-of-the art offerings from this well-known company that specializes in signal and power transfer products. These no-compromise products are created by Shunyata’s owner and chief designer, Caelin Gabriel; a man who has been steadily improving his company’s products since his first power conditioner offering in 2001. Shunyata Research’s products have not only been embraced by audiophiles, but by commercial recording studios, orchestras, and other commercial audio designers. The word Shunyata is a Sanskrit word that means the stillness or emptiness from which all creation emanates. all image credits: Shunyata Research The HYDRA TRITON V2 Design Elements and Philosophy\nAll power conditioners try to deal with the nose inherent on the AC supply line. But Caelin has identified two other issues that power conditioners should be dealing with to be successful in reducing noise and not degrade sound quality: Component to Component Interference (CCI) and Dynamic Transient Current Delivery (DTCD). The following are taken from Caelin’s discussion of these important topics: Component to Component Interference\nOur audio components can generate noise that can be reflected back from the power conditioner to contaminate other components. Shunyata controls CCI without the use of transformers, coils or large capacitors that are inductive and can impede instantaneous current delivery. Grant Samuelsen, Director of Marketing and Sales at Shunyata Research, has stated that the TRITON is designed to provide localized “sinks” for system generated and radiated noise. Shunyata’s new CCI (Component-to-Component Interference) noise filters are a capacitive array applied to each outlet that prevents the spread of high-frequency noise between terminals. Dynamic Transient Current Delivery (DTCD)\nOur audio components do not draw current in a constant or linear fashion. They draw current in instantaneous pulses as rectifiers switch on to fill the storage capacitors. This is not only found in high current devices, but in preamps and other low current components. These current pulses have high frequency harmonics up to 50 times the frequency of the AC power line. This places a great demand upon the AC power circuit and associated connections to deliver current without significant impedance to the flow. Impedence to these instantaneous current flow demands can cause a loss of phase and time coherence and degradation in voice and instrument weight with an overall compression of dynamics. DTCD Analysis\nDTCD analysis is an important concept if one wishes to understand what is contributing to Shunyata Research’s design of their AC distribution products and AC cables. “DTCD is a method of current analysis that measures instantaneous current delivery in the context of a pulsed current draw. In layman's terms, it is a way of measuring current performance into typical electronic component power supplies.” “The DTCD Analyzer allows the measurement of pulsed transient current through a variety of AC power products, including power cords.” Shunyata Research optimizes their AC distribution centers and AC cables by using the DTCD Analyzer to improve and optimize performance. The TRITON v2 Features\nNIC Noise Reduction\nThe Noise Isolation Chamber is a proprietary Shunyata Research technology that uses chambers filled with a ferroelectric substance that actually absorbs high frequency power line noise in the Megahertz to Gigahertz range. The substance used is patented ZrCa ferroelectric compound. ZPP-DS Distribution Buss\nZero-Point Power Distribution System (ZPP-DS) is a custom manufactured all-copper buss system linking all outlets to a single point of electrical contact. The power buss is made entirely from solid OFE (oxygen free electrolytic) Alloy 101 copper. Alloy 101 OFE Copper is the highest purity grade of copper at 99.99%. The ZPP-DS unifies the internal wiring, outlet contacts and power distribution buss into a single-point of electrical contact. This improves contact integrity and DTCD performance by eliminating many of the terminal connections and the daisy-chained wiring found in other products. CopperCONN Outlets\nThese new outlets introduced by Shunyata are made from solid, high purity, oxygen free copper contacts unlike most audiophile outlet contacts that are made from brass or bronze. These newly introduced CopperCONN outlets have excellent grip strength and contact integrity that contributes to a measurable improvement in Dynamic Transient Current Delivery. VTX Conductors\nThe VTX conductors are made in the shape of virtual tubes with a hollow core that minimizes skin effects and random eddy currents. Alloy 101 OFE Copper is used for these conductors. CCC - Computer Controlled Cryogenics\nShunyata Research operates their own Cryogenics International computer-controlled cryogenic plant to treat the wires, conductors and terminals used in the TRITON v2. Hydraulic Electromagnetic Breaker\nHydraulic electromagnetic breakers are used in the TRITON v2 as opposed to fuses or thermal breakers to deal with over current protection. Hydraulic electromagnetic breakers operate up to their current rating without voltage drops, increase contact impedance, thermal noise, excessive heat generation, and current limiting typically found in fuses and thermal breakers. \"Trivial\" Terminals\nThe small parts such as ring terminals, spades, bolts and washers used in the TRITON v2 are made by Shunyata using superior metals and plantings for each specific application in the TRITON. Chassis Dampening\nShunyata builds the TRITON v2 with heavy 16 gauge powder coated steel and a beautiful anodized aluminum faceplate that is now available in black. They include vibration absorbing materials such as energy absorbing footers, AC outlet gaskets and chassis dampeners that measurably reduce resonant vibration within the power distributor. This is one heavy, well-constructed component. In addition, optional stainless steel feet (SSF) that are milled from solid blocks of high-grade stainless steel are available for additional isolation when not placed on a dedicated shelf or amp stand. Chassis Ground System (CGS)\nThe TRITON v2 now come equipped with external grounding terminals capable of grounding any remote system component through the central Noise Isolation Chambers contained within each TRITON v2. Components used in Evaluation\nThe computer used was an Asus G501 JW running Windows 8.1 and Windows 10 Home 64 Bit. This laptop possesses an Intel Core i7 4720HQ 2.6 GHz Processor with 16GB RAM and a very fast PCI Express x4 SSD. The G501 JW computer also has a Thunderbolt port. Software included the latest version of Roon that supports Native DSD playback and Foobar2000. Fidelizer Pro 6.8 was also used in my listening evaluations. The computer was placed on a Synergistic Research Tranquility Base grounded with the Synergistic Research High Definition Ground Cable / Grounding Block as was the computer. Two 8 TB GRAID Thunderbolt Drives were connected; one for PCM and the other for DSD files. The GRAID Thunderbolt drives were powered by HDPlex linear power supplies. An UpTone Regen was also driven with an HDPlex linear power supply. A Synergistic Research Galileo LE USB cable and Audioquest Diamond USB cables connected the computer to the MSB DAC. The Asus G501 JW and the hard drives were plugged into a Shunyata Research HYDRA DPC-6 v2. The MSB Technology Analog DAC / Analog Power Base were plugged into the Shunyata Research TRITON v2 with an Σ SIGMA Digital IEC15 AC cable. My Ayre KX-R preamp was connected to the TRITON v2 with an Σ SIGMA ANALOG IEC15 AC cable. The power amps were Ayre MX-R monoblock amps with their AC connected directly to the wall using ΞTRON Σ SIGMA ANALOG IEC15 AC cables. Interconnect and speaker cables were Synergistic Research Atmosphere Level 4 cables. Speakers were Wilson Sasha and a Watchdog II subwoofer. The TRITON v2 was connected to the wall with an Σ SIGMA HIGH-CURRENT IEC 20 AC Cable. Sonic Impressions\nI have listened to many power conditioners, including the Shunyata Research HYDRA V-Ray II and the HYDRA TRITON v1, but the HYDRA TRITON V2 provided a new acoustic experience for my music that was truly exemplary. The background silence was deep allowing fine detail and high end transients to emerge with outstanding clarity and definition. In fact, the reproduction of high end detail and transients were the best I have yet heard from any power conditioner. Many of the power conditioners I have listened to tend to smooth the end robbing it of its ultimate resolution. This effect might be pleasant to some listeners, but I consider it subtractive in nature. The HYDRA TRITON v2 reproduces voices and music in the most natural and relaxed manner I have yet experienced. This power conditioner strips away noise that adds a false and unnatural brightness to the music. Some might conclude that this brightness is better definition, but it does not sound like real music or voices. Once one experiences music with the TRITON v2, it is difficult to go back to the sound of noise superimposed on the music. I also experienced a more lifelike sense of instrumental body and weight with the TRITON v2. I was delighted with the soundstage qualities that were improved using the TRITON v2. Soundstage width extended well beyond the lateral margins of the speakers. The more difficult to reproduce depth is also enhanced with this power conditioner. Probably it would be more accurate to say that there is not enhancement, but reproduction of what is actually in the recording. The spatial resolution of well recorded music is truly world-class with the TRITON v2. The soundstage appears to be richly layered with immediacy and palpability. Bass reproduction though the TRITON v2 was not only well defined, but had wonderful weight and slam. The dynamic qualities of the music were reproduced with a terrific visceral grip on the bass. The deep-black ultra-quiet background of the TRITON v2 allowed superior resolution of low level information. Instrumental textures were clearly evident with a harmonic richness that I have not heard with other power conditioners. The TRITON v2 Chassis Ground System (CGS) and the CGS-10 Cable\nThe TRITON v2 has an internal ground-buss noise reduction system that uses the NIC technology. The new Chassis Ground System extends this noise-reduction system to components external to the TRITON. Potential ground loops can be eliminated with the use of a common grounding point for all components. The Shunyata Research CGS-10 ground cables are made of 10 gauge cryogenically treated CDA 101 copper. These are available from Shunyata at custom lengths. Unfortunately, I was unable to use the CGS with my Ayre MX-R amps that are plugged directly into the wall as Ayre lifts the ground in their design. But I was able to successfully test the CGS system on several other components using Shunyata’s new CGS-10 Ground Cables. I have an Uptone Audio USB Regen that is not powered from the TRITON v2. I decided to use the HDPlex linear power supply to power the USB Regen; a device that generates a new USB data signal for your DAC. I grounded the HDPlex chassis with the CGS-10 ground cable. The soundstage significantly increased in width after grounding the HDPlex to the TRITON v2. The imaging heard within the soundstage was better defined. The music seemed to be a little more dynamic in quality. A very nice and noticeable improvement in the ultimate performance of the MSB Analog DAC resulted from the use of the TRITON v2 Chassis Ground System with the Regen / HDPlex. Shunyata has told me that the grounding results will vary with different components. The TRITON v1 Compared to the TRITON v2\nCaelin feels that the TRITON v2 is an evolutionary improvement to the previous TRITON model. The new TRITON v2 uses the new pure copper CopperCONN outlets, a new copper buss system, and new CCI noise filters. Shunyata felt that these three items were significant enough in sonic terms to justify a new version of the TRITON. While the NICs (noise isolation chambers) remain the same in v2 as in the original TRITON, the 4 external grounding posts connected to the noise isolation chambers adds a new versatility and potential for external (components not connected to the TRITON) component enhancement not found in the original TRITON. I was fortunate to have an original TRITON on hand to compare to the v2 model. After comparing the sound of both line conditioners to each other, I felt that the TRITON v2 was much better than the original version; so much so that I felt that Shunyata could have given it a new model name. Virtually every aspect of sonic performance was improved in the new model. The sonic improvements were so obvious, that I was quite amazed given the excellent sound of the original version. The TRITON v2 just takes the original TRITON’s performance to a significantly higher plane of performance with greater musical transparency. Shunyata Research offers an upgrade path for those that own the original TRITON. The upgrade includes 4 CopperCONN duplex outlets, the new OFE Copper ZPP-DS Buss Bars, 4 new CCI Modules, 4 outlet isolation gaskets, and a chassis damping retrofit. The only feature lacking in the upgraded TRITON v2 is the CGS Grounding System. The cost of the upgrade is $1900. Owners of the original TRITON should consider this upgrade as the sonic improvements will most assuredly impress them. The HYDRA TYPHON\nWhen Caelin Gabriel set out to originally design the TRITON power distribution center, he came up with a no-compromise design that was much larger than the present TRITON v2 with significantly greater cost. A design decision was made to split the original TRITON into two units. The “ultimate TRITON” would now consist of a stand-alone 8 outlet Reference power distributor. The second chassis would plug into the base unit and function in parallel enhancing the power conditioning qualities of the Reference unit. The HYDRA TYPHON was the result of this design decision to split the ultimate TRITON into 2 manageable products. Shunyata Research’s description of the TYPHON: “Within the TYPHON’s TRITON-size case are two massive Noise Isolation Chambers (NIC’s). These cylindrical chambers take up the entire space within the TYPHON’s chassis and account for the majority of the TYPHON’s 43 pound weight. Each NIC contains an enormous volume of Shunyata’s patented ZrCa-2000 compound, which absorbs and dissipates high-frequency noise. Shunyata’s hollow-core VTX wiring, culled from ultra-pure OFC copper, runs through the chambers and connects to the IEC at the back of the TYPHON. In essence, the TYPHON is a purpose-built slave unit for the HYDRA TRITON.” The HYDRA TYPHON shares the cosmetics and external design of the TRITON and comes with a special AC cable that plugs into one of the TRITON’s unused outlets. This AC cable is optimized for maximum performance of the TYPHON with the TRITON. The TYPHON AHC AC cable has the following specifications: Length: 30 inches (76 cm)\nGauge: 7 AWG aggregate\nFilter: Dual Hybrid ΞTRON\nIEC-C19: Shunyata CopperCONN (UL Listed, CE Mark)\nUS NEMA P15: Shunyata CopperCONN (UL Listed) Materials include the similar 16 gauge power coated steel chassis, aluminum faceplate, and vibration isolation treatment / Shunyata Isolation Footers that are found in the TRITON v2. 9 AWG Shunyata VTX OFC Copper conductors are used in the TYPHON as well as Shunyata’s Cryogenic Treatment. The TYPHON works in parallel with the TRITON v2 and does not carry the current load of the TRITON. There is a recommended 5 day settling period to reach the optimum performance of the TYPHON’s NICs. If one wishes to have comparative listening sessions with the TYPHON, plugging and then unplugging the TYPHON in rapid succession will not allow one to accurately assess the contribution made by the TYPHON. The Sonic Contribution of the TYPHON\nAdding a TYPHON to a TRITON v2 results in an improvement to the sound that is remarkable and easily heard. With the additional drop in the noise floor, small instrumental details are revealed that were previously obscrued. The soundstage is dramatically opened up with air and bloom around the instruments not previously observed. I am now hearing every inflection and nuance of a performance within this expanded soundstage. Soundstage width and depth increase with enhanced resolution of low level information on the recording. Quite frankly, the effect when first heard is uncanny. Little things like the sounds of fingers on a guitar fret board emerge where they were previously obscured by the noise floor. The addition of the TYPHON results in enhanced harmonic richness to instruments with richer timbre and texture. Quite simply put, you have no idea of what you aren’t hearing unless a TYPHON is connected to the TRITON v2. Listening to well-known recordings in my collection made me feel that I was listening to new hi-resolution copies of these recordings. After listening to the TYPHON for several weeks, I removed the TYPHON from the TRITON. All I can say is that the over-all performance dropped several bars and had a significant negative impact on the sound I was hearing. The TYPHON is really that good. ΞTRON Σ SIGMA AC Cables\nThe Sigma AC cables are Shunyata Research’s most advanced cables incorporating the highest performing ΞTRON circuits that reduce noise to the incoming component’s AC and isolate that noise from other components. Shunyata Research claims that the noise reduction circuits in the Sigma cable virtually eliminate CCI (Component-to-Component Interference) that serves to protect other components from commonly shared noise. These AC cables act as high current power conditioners. There are 3 versions of the cable that differ in the specific frequencies of noise that are canceled; Digital, Analog, and High-Current. The Sigma cables use Shunyata’s new CopperCONN connectors that have as their base metal pure Tellurium copper as opposed to brass that is commonly used in other audiophile AC cables. A very thin layer of nickel plating protects the copper from corrosion. But it is the copper base metal that carries the current. Shunyata is truly obsessive in the over-all design of these cables. They have also found that there is a negative impact on the sound if magnetic screws are used in the connector assembly. Pure stainless steel screws are used for the best sonic performance. All of the ΞTRON Σ SIGMA AC Cables share the following design: Certified CDA-101 Copper\nVTX (virtual tube) Conductors\nSHUNYATA CopperCONN CONNECTORS Pure OFC Copper Base Metal With Superior Conductivity Compared to Brass or Bronze\nNickel plated for corrosion protection\nSuperior Contact Grip\nShunyata Alpha Cryogenic Processed These are large diameter cables that employ 8 AWG VTX Conductors in the Analog and Digital Models with 6 AWG VTX Conductors for the High Current version. These graphs indicate the noise filtering of the ΞTRON Σ SIGMA AC Cables: The noise-filter elements used in the Σ SIGMA AC Cables are entirely passive and non-reactive, meaning they will never get in the way of current flow, nor will they interfere with the power supplies of the components. All versions are designed for maximum DTCD (Dynamic Transient Current Delivery). Shunyata pulls out the stops for packaging of these cables by placing them in a velvet bag inside a rigid flight case. The physical detail of the connectors and overall feel of the cable are first-class. A Very Revealing AC Cable\nThe Sigma Series of AC cables are the finest sounding cables I have had the opportunity to experience in my system. I used the Analog Version on each of my Ayre MX-R amps and KX-R preamp. The Digital Version was used on my MSB Technology Analog DAC / Analog Power Base. These are the most revealing AC cables I have heard that present music and voices in a relaxed, natural manner without accentuation of the lows, mids, or highs. I was impressed with the way that these cables handled female and male vocalists without bright or unnatural coloration. Substituting other audiophile AC cables for the Sigma Analog with the Ayre MX-Rs plugged directly into the wall, resulted in an increase in grain and hardness that was absent on the Sigma cables. These are state-of-the art cables in terms of transient detail, bass definition and impact, low level detail retrieval, and soundstage reproduction. The Sigma Series compliments the sound characteristics of the TRITON v2 and TYPHON and is highly recommended for use with these power distribution products. The HYDRA DPC-6 v2\nAfter reviewing the HYDRA DPC-6 Digital Power Distribution Center last October, this product became an indispensable component in my system, The DPC-6 acts as a firewall to digital noise from computers, hard drives, routers, satellite receivers, products with SMPS, etc. The effectiveness of the DPC-6 was impressive in removing the noise that would otherwise contaminate one’s system and analog components. The new version of the DPC-6 builds on the previous version by now using the excellent CopperCONN outlets found on the TRITON V2. I heard an improvement in over-all detail retrieval and reduction of grain with the new CopperCONN outlets. Also, the physical grip of the CopperConn contacts is superior to that of the previously used SR-Z1 outlets that were built to Shunyata’s specifications by Hubbell. A New Musical Experience\nListening to my system with the full Shunyata stack of the TRITON v2, TYPHON, HYDRA DPC-6 v2, and the Sigma AC cables gave me a totally new perspective of well-known musical titles in my collection. Revisiting Cat Steven’s Tea for the Tillerman (DSD128) was a real treat listening to this Analogue Productions remastered version authored direct to native DSD from the analog tape. The Shunyata stack stripped away hardness and a subtle veil that moved Cat Steven’s voice forward in the soundstage with a wonderful relaxed presentation. For lack of a better description, I felt that there was now a more tube-like bloom and dimensionality to the recording. Masterpieces in Miniature, a recording performed by Tilson Thomas and the San Francisco Symphony (24/192) allowed me to experience just how good the full Shunyata stack was capable of resolving low-level information. Recorded and mixed to 192 kHz, 24 bit except for track 6 that was recorded to 96 kHz, 24 bit, this wonderful collection displayed an ultra-quiet background with rich tonal colors and life-like timbres. The Shunyata stack allowed me to hear a richly layered soundstage that had air and bloom around the instruments. I couldn’t believe how good Doug MacLeod’s new Reference Recording Exactly Like This sounded to me with the Shunyata stack. This excellent 24/176.4 Keith Johnson recording presented a new musical experience for me listening with the full complement of Shunyata power distribution equipment. It seemed that transient detail was now rendered with greater immediacy and clarity. I definitely heard more weight and body to MacLeod’s voice and better weight and slam to the bass. I never realized that I was previously hearing an electronic quality to the music prior to experiencing this title with the full Shunyata stack. I now felt that I was hearing resolution and transparency that was previously masked by overriding noise in my system. Audio Excellence That Must Be Experienced\nMy experience with the Shunyata Research HYDRA TRITON v2, HYDRA TYPHON, HYDRA DPC-6 v2, and the ΞTRON Σ SIGMA AC Cables forced me to reevaluate my previous conceptions of power conditioning and the contribution that AC cables bring to this task. In this review, I not only tried to relate the excellence of sonic performance exhibited by these power distribution products, but Shunyata Research’s dedication to design detail. Every component used to build these devices was scrutinized for their contribution to the overall design’s sonic result. I have no doubts that those of you with the financial means to purchase these products will be thrilled with the improvement they bring to your system. The full Shunyata Research high-end complement of power distribution products and AC Cables result in audio excellence that must be experienced for those seriously interested in applying power conditioning to their systems. Associated Equipment", "source": "AudioStream"}