{"published": "2015-09-06T15:32:16Z", "media-type": "News", "title": "Tens of thousands rally in Moldova against $1 billion bank fraud", "id": "1ce7f751-6d2a-4ad1-9abf-4d9a26e9e459", "content": "By Alexander Tanas \n \r \r \r \nCHISINAU (Reuters) - Tens of thousands of Moldovans rallied on Sunday in the heart of the capital Chisinau in the biggest street protests in memory, demanding the resignation of the president and early elections over a $1 billion (659.20 million pounds) bank fraud that has hit living standards. \n \r \r \r \nThe protesters streamed into the capital from all regions of the small, largely rural, ex-Soviet state in answer to an appeal by a new mass organisation called \"Da!\" to demonstrate in a central square outside the main government building. \n \r \r \r \nPolice put their numbers at between 35,000 and 40,000 - bigger even than mass anti-communist protests of April 2009 - though the organisers put their estimates at three times as many. \n \r \r \r \nThe protesters, calling for the resignation of President Nicolae Timofti who has presided over a pro-European Union leadership since early 2012, chanted: \"Victory! Bring the one billion back home!\" \n \r \r \r \nIn an egregious scam that has exposed endemic corruption and highlighted the power of oligarch groups in the country of 3.5 million, $1 billion has disappeared from the banking system - roughly one eighth of Moldova's gross domestic output. \n \r \r \r \nThe fraud has caused a rapid depreciation in the national currency, the leu, stoking inflation and hurting living standards. \n \r \r \r \nIt has also tarnished the image of the pro-Europe ruling class for ordinary Moldovans, many of whom struggle by on a family income of about $300 a month, though many protesters carried pro-EU flags indicating they were not against the country's policy of European integration. \n \r \r \r \nProtesters, who directed much of their verbal fire at the country's super-wealthy oligarchs who control key sectors of the economy, threatened to stage a non-stop demonstration in central Chisinau until their demands were met.\n  Continued...", "source": "Reuters Africa"}