{"published": "2015-09-04T07:46:30Z", "media-type": "News", "title": "Christopher Eccleston: My grandfather inspired Legend performance", "id": "faf97214-6d88-45a9-8013-68a4fd342848", "content": "Former Doctor Who star Christopher Eccleston has revealed how his grandfather inspired his performance in the Kray twins biopic, Legend. \n \nThe 51-year-old actor portrays Detective Superintendent Leonard “Nipper” Read in Brian Helgeland’s drama, the policeman who brought down London gangsters Ronnie and Reggie Kray in 1968. \n \nAs soon as he put on the detective’s outfit, Christopher was taken aback as to how alike he looked like his father’s father. \n [embedded content] \nHe said: “I looked exactly like my paternal grandfather and he was a frightening man. \n \n“I was struck by that when they put me in the gear and I looked at myself, and I based it on his effect on me as a child, and his basic outlook as I imagined it. So it was helpful.” \n \nTom Hardy plays both Ronnie and Reggie Kray, while Emily Browning portrays Reggie’s wife Frances in Legend, which is based on John Pearson’s book The Profession Of Violence: The Rise And Fall Of The Kray Twins. \n \nChristopher – who played the ninth incarnation of the Doctor in the BBC sci-fi series and has also appeared in films such as Thor: The Dark World, 28 Days Later and GI Joe: The Rise Of Cobra – said he felt “jealous” of Tom’s dual role. \n   Promoted stories   Christopher Eccleston, far right, with Tom Hardy and the cast of Legend at the London premiere (Jonathan Short/Invision) \n“It was a deeply humbling experience in stereo. 99% of my scenes were with Reggie, I had one scene with Ron and that was a revelation watching,” he recalled. \n \n“That was really interesting because I’d only met Tom as Reg, and then suddenly there was Ron and they were completely different. As I have twin brothers, that was interesting to see what an actor would do for one role and the other. I was jealous.” \n \nThe Lancashire-born star admitted he did not do any research for his part. \n \n“To quote David Bowie, I threw my homework on the fire… I think there’s a load of b*****ks spoken about research and things,” he said. \n \n“It’s make believe. I felt that Brian had written, and sent a very clear message to me about what he wanted, so I relied on what was in the script and what happened on the set.” \n Christopher didn’t do research for the role (Jonathan Brady/PA) \nChristopher, who also based Nipper on Shakespearean villain Malvolio from Twelth Night, continued: “Me and Brian did have a conversation about what sort of dog Nipper Reed might be – I decided on a bloodhound, because according to Brian, a bloodhound will run until it dies. It will chase its prey until its heart bursts. \n \n“And then, I threw in Malvolio from Twelfth Night because Nipper was absolutely puritanical, a man of the 50s, a man who did not want the 60s to happen, who did not want the Krays to have sex and fun. He was a man from the previous 10 or 20 years. \n \n“(I did) no homework, just drugs with Brian Helgeland,” he joked. \n   \n Share article  \n   \nLegend opens in UK cinemas on September 9.", "source": "Wirral Globe"}