{"published": "2015-09-25T18:25:41Z", "media-type": "News", "title": "The University of Maryland Receives $50,000 Grant from Dominion Foundation", "id": "8529f01a-5deb-48ec-be08-a09b693078bc", "content": "SOURCE University of Maryland A. James Clark School \n\nAward supports new research on high efficiency solar-powered cooling systems.\n\nCOLLEGE PARK, Md. \n\nMaryland's project, \"Design of Efficient Solar Cooling System with High Coefficient of Performance,\" is led by Department of Mechanical Engineering Research Professor Yunho Hwang and aims to model, design, fabricate and test a new solar cooling system that exceeds current efficiency standards. \n\n\"In the U.S., cooling and heating systems are responsible for 63% of building energy use,\" explained Hwang. \"Therefore, utilizing solar energy to provide cooling and heating for buildings will contribute to saving energy and conserving our environment.\"\n\n\"We are proud to support the University of Maryland \n\nIn addition to Hwang, the UMD research team includes three Mechanical Engineering students, juniors Jonathan Kagan \n\nThis project is yet another demonstration of Maryland's commitment to expanding energy research and creating technologies that improve energy efficiency and reduce environmental impact. \n\nHwang is the Associate Director for the Center for Environmental Energy Engineering (CEEE) and is part of CEEE's Consortium for Energy Efficiency and Heat Pumps (EEHP). EEHP's faculty and staff are responsible for building the first carbon dioxide (CO2) hot water heat pump in the United States \n\nProjects like Hwang's further innovative research in the area of solar cooling and prepare the next generation of engineers to enter the workforce. \"Dominion Power's generous financial support will enable us to assist in developing future energy efficiency technology,\" added Hwang. \"As well as educate this talented new generation of innovators and researchers.\n\nThis grant was given by the Dominion Foundation, the philanthropic arm of Dominion Resources, Inc., which is the parent company of Dominion Cove Point LNG, LLC, Lusby, MD \n\nAbout the A. James Clark School of Engineering\n\nThe University of Maryland's \n\nOur broad spectrum of academic programs, including the world's only accredited undergraduate fire protection engineering program, is complemented by a vibrant entrepreneurial ecosystem, early hands-on educational experiences, and participation in national and international competitions.\n\nThe Clark School is leading research advancements in aerospace, bioengineering, robotics, nanotechnology, disaster resilience, energy and sustainability, and cybersecurity. From the Universal Product Code to satellite radio, SMS text messaging to the implantable insulin pump, our students, faculty, and alumni are engineering life-changing innovations for millions. Learn more at www.eng.umd.edu. \n\nAbout Dominion\n\nDominion (NYSE: D), headquartered in Richmond, is one of the nation's largest producers and transporters of energy. The Dominion Foundation is dedicated to improving the physical, social and economic well-being of the communities served by Dominion companies. Dominion and the Dominion Foundation support nonprofit causes that meet basic human needs, protect the environment, promote education and encourage community vitality. Dominion Foundation grants are funded by shareholder dollars and not borne by customers. For more information about Dominion and the Dominion Foundation, visit www.dom.com.\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/the-university-of-maryland-receives-50000-grant-from-dominion-foundation-300148909.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "Kait 8"}