{"published": "2015-09-28T16:31:14Z", "media-type": "News", "title": "Microsoft HoloLens On A Budget Google Cardboard Virtual Reality Competitor Spotted", "id": "f42c5ec9-75f8-47be-8e74-aa2087865af8", "content": "The ultimate LEGO experience  \nFox News - Monday 28th September, 2015 \n \nSep. 25, 2015 - 5:34 - Fox Gamer: Warner Bros. Interactive's Doug Heder with a hands-on look at the new toy-game hybrid from the minds at LEGO  ... \n   Swedish Customs Hires Greek Company for System Upgrade  \nGreek Reporter - Monday 28th September, 2015 \n \nSwedish Customs as a key part of its wider technology upgrade programme, marking this project as the latest success for the ESKORT solution.?  The ESKORT Compliance Solution is an  ... \n   Novo shares jump ahead of its largest ever drug launch  \nReuters - Monday 28th September, 2015 \n \nCOPENHAGEN Shares in Novo Nordisk (NOVOb.CO) rose as much as 5 percent on Monday after the U.S. Food and Drug Administration (FDA) approved the diabetes drug Tresiba, allowing the Danish drugmaker  ... \n   US Core PCE price index to surge by 0.1 in August - Danske Bank  \nFXstreet - Monday 28th September, 2015 \n \nFITITOL--> FXStreet (Delhi) - Research Team at Danske Bank expect the US core PCE price index for August to increase 0.1% m/m taking annual core inflation to 1.3% as the strong USD and  ... \n   US Focus on Dudley and Evans – Danske Bank  \nFXstreet - Monday 28th September, 2015 \n \nFXStreet (Delhi) - Research Team at Danske Bank, suggest that the market participants will focus today on the speeches of NY Fed president Dudley and Chicago Fed president Evans  ... \n   Incredible blood supermoon eclipse time lapse  \nThe Telegraph - Monday 28th September, 2015 \n \nThomas H. shot the video overnight Sunday into Monday morning. It shows the supermoon rising behind the iconic structure made famous by Hans Rosenfeldt's Scnadanavian crime drama The  ... \n   How Swedens negative interest rates experiment has turned economics on its head  \nThe Telegraph - Monday 28th September, 2015 \n \nIt has long been believed that when it comes to interest rates, zero is as low as you can go. Who would choose to keep their money in the bank if they had to pay for the  ... \n   Swedens multiplying moose pit farmers against powerful hunting lobby  \nThe Guardian - Monday 28th September, 2015 \n \nSweden abounds in moose, cheering the country's passionate hunters but not its agriculture and forestry sectors which say profits are being munched away  ... \n   Norwegian ship recently detained in Kenya has been set free  \nThe Daily Star - Monday 28th September, 2015 \n \nIn this photo taken on Friday, Sept. 25, 2015, the Norwegian flagged Hoegh Autoliners cargo ship is photographed at the port of Mombasa, in Kenya. The Norwegian owner of a ship intercepted in Kenya  ... \n   Danish Muhammad cartoonist still has no regrets  \nChina Post - Monday 28th September, 2015 \n \nCOPENHAGEN, Denmark -- Ten years after a Danish newspaper triggered deadly protests by publishing 12 cartoons of the Prophet Muhammad, the man behind the most infamous drawing says he feels anger  ... \n   Headwinds face Norway after surprise rate-cut  \nSwedish Wire - Sunday 27th September, 2015 \n \n\"Unemployment in Norway is relatively low at 4.3%, but it is expected to increase due to layoffs in the oil and gas sector. In August there was a measured decline in industry capacity  ... \n   Danish championship results and standings  \nDaily Mail - Sunday 27th September, 2015 \n \nSept 27 (Infostrada Sports) - Results and standings from the Danish championship matches on Sunday Sunday, September 27 Brondby 1 FC Copenhagen 0 Randers 0 Midtjylland  ... \n   Tottenham Hotspur in pursuit of Brondby wonderkid Armend Aslani as they look to open talks with Danish side for forward  \nDaily Mail - Sunday 27th September, 2015 \n \nThe White Hart Lane club have made their interest in Aslani, who is of Danish and Macedonian descent, known to Brondby chiefs and are hopeful of striking a  ... \n   Norway Building from 1893 Worlds Fair heads home  \nPioneer Press - Sunday 27th September, 2015 \n \nOlav Sigurd Kvaale walked up the old wooden stairs of the medieval-style church. He paused under the gabled portico and reached out to touch the intricate, 122-year-old carvings that  ...", "source": "Denmark News.net"}