{"published": "2015-09-07T19:12:02Z", "media-type": "News", "title": "Govt should allow international aid for flood victims, says Omar", "id": "0c8dd7ae-2b1c-4e11-84dd-db7422343d50", "content": "PTI \nSRINAGAR \n \nA year after the devastating floods struck Jammu and Kashmir, former Chief Minister Omar Abdullah today asked the Centre to allow international aid to the state if it did not have money or was unwilling to announce any package for rehabilitation of victims. \n \n“We want that aid should come from wherever it can. If the Centre is not ready to give financial aid, or it does not have the money, then we should be allowed to get it from where we are getting it (internationally),” Omar told reporters after donating blood as part of his party’s blood donation camp to mark the first anniversary of the floods here. \n \nOmar, who is working president of opposition National Conference (NC), said people of the state had suffered from both sides, as neither had the Centre given any package nor did it allow any international aid. \n \n“We (the previous NC-Congress government) had started the process of getting international aid by talking to the World Bank. The first meeting, I had with the officials of World Bank and Asian Development Bank before the election code (came into force).” \n \n“We had prepared a project but there has been no forward movement on that as well. So, we suffered from both the sides. Neither did we get anything from here, nor from where we would have got some money,” the former chief minister said. \n \nTerming as “unfortunate” the ruling Peoples’ Democratic Party’s (PDP) decision to celebrate the anniversary of the floods, Omar said, “…The reality is that the people, who were affected by the floods, have got nothing to celebrate.” He said, now, the high court had to take a suo motu notice as a result of “non-efficiency” of this government. \n \n“The court has compelled the state as well as the central government to answer. Now, we hope that due to high court’s pressure, people would get something which these people (governments) were unwilling to give till now. They were not ready to give the people anything on their own. Whatever,I had given to people during my regime, they had got nothing more than that,” the former chief minister said. \n \nOmar claimed whatever assistance the flood-affected people got was before March 1. \n \n“Since the PDP-BJP government was sworn-in (March 1), they (victims) have been continuously neglected. Rs 2000-Rs 2500 crore fund that they got with much difficulty was the money from State Disaster Relief Fund and first instalment from Government of India which was announced on the spot during my regime. Not a penny extra,” he alleged. \n \nThe NC leader alleged the Centre took back money which it had given to the state on the account of various expenditures. \n \n“They took money for many things in the name of flood relief. But those, who suffered losses, did not get anything. Helicopters were used, (but) the money was taken from us. Their boats were used here, but the money was taken from us. The funds meant for liabilities under Prime Minister’s Reconstruction Programme were taken in the name of floods. \n \n“Additional special plan assistance, which is given to us by the Planning Commission every year to balance our plan, that money was also added to the flood account and taken. That is why, Mufti sahab felt a compulsion to arrest the leaders of trade bodies who were to protest against the government,” Omar said. \n \nCondemning the arrest of leaders of various trade bodies, he said, the chief minister is the same Sayeed who used to say that this is the battle of ideas, but the reality is, if your ideas do not match his, he will not allow you to talk. \n \n“You (governments) are pushing the people unnecessarily. These traders were not protesting against any country. They were not coming out with anti-national slogans. They were coming out for their rights. \n \n“The rights which they have been promised of by none other than the Prime Minister of the country who, here in Srinagar, said that we will not only give whatever to this part of Kashmir, but are even ready to help the other side of Kashmir as well. \n \n“Thank God, they (Pakistan-occupied Kashmir) did not took the help, otherwise their situation would have been same like ours. It is unfortunate that they (leaders of trade bodies) have been arrested for bringing these things to the public domain,” he said. \n \nOmar, in a series of tweets, termed the chief minister as “dictator” for carrying out midnight raids and arrest of trader body leaders. \n \n“In a series of midnight raids (chief Minister) Mufti (Mohammad) Syed has ensured the arrest of all the Trade Body leaders. Their crime? Unhappiness over flood relief. All these people wanted to do was register their dissatisfaction at the absence of any meaningful flood relief. Shame on Mufti the Dictator,” he tweeted. \n \n“If Mufti Sb (sahab) was so sure people were going to celebrate as his Govt (government) has planned today he wouldn’t have ordered these arrests. #Dictator,” he said. \n \n ", "source": "Navhind Times"}