{"published": "2015-09-30T05:55:31Z", "media-type": "News", "title": "Slow and steady to do the trick in Canberra Capital Abby Bishop's injury rehab", "id": "df437d5e-c136-444e-8720-787fe7b46f71", "content": "Abby Bishop is confident she and Lauren Jackson will overcome injury and rediscover the devastating front court partnership which helped Canberra Capitals dominate the WNBL. Abby Bishop is confident she and Lauren Jackson will overcome injury and rediscover the devastating front court partnership which helped Canberra Capitals dominate the WNBL. The sight of Bishop fronting media on Wednesday while Jackson did shooting drills would be a huge relief for Canberra, who were reeling after the late withdrawals of Belgian centre Ann Wauters and Dandenong recruit Kathleen MacLeod.\n\nAfter picking up a hamstring injury with Seattle Storm, Bishop agreed to Hungary club Sopron's request to release her from her contract.\n\nShe will be on limited minutes early in the season as she rehabilitates the injury, but is confident of stepping it up in the lead-up to finals.\n\nJackson is on the comeback trail from knee surgery, and the Capitals won five of the six games she played last season.\n\nBoth winners of the league's Most Valuable Player award, the Australian Opals pair were pivotal during the Capitals glory days when they won a record seven titles.\n\n\"I had every intention of going to Europe, I wanted to play Euro League and test myself but unfortunately with this injury it just wasn't going to be the best thing for me or the team [Sopron].\n\n\"By sending them the medical plan they came to the conclusion they would find another player and I totally understand and respect that.\n\n\"I would have hated to have gone there and let the team down.\n\n\"I know Canberra will look after my injury and Graffy [coach Carrie Graf] is understanding with everything.\n\n\"Obviously the medical plan's there for a reason.We'll just wait and see how it goes day by day, but definitely for the first couple of games I'll be on limited minutes.\"\n\nBishop is fully confident she can work her way back to her best and be somewhere near her peak in the back end of the season.\n\n\"That the question for a lot of people, can she get back to her best. Yeah, absolutely,\" Bishop said.\n\n\"It'll take time for sure but I'm in no rush either, it's a slow process and I have to get my hamstring right.\n\n\"We do have other great players around and when Loz and I are back fully fit, it's going to make a make us a better team and hard to guard.\n\n\"It was nice having another big body to help me [last season], being in the paint by myself did get tough at times.\"\n\nBishop also backed Canberra's point guard signing, former Seattle teammate Renee Montgomery, to excel.\n\nMontgomery moved to Minnesota Lynx midway through the season, and is currently involved in the WNBA Finals.\n\n\"She can defend, she can get the ball to the posts off the 'pick and pop' and also create for herself,\" Bishop said.\n\nGraf is adamant Jackson and Bishop have the class and professionalism to still perform at less than full fitness.\n\nThey give Canberra the arsenal to match up against heavyweights Townsville and Bendigo, whose size has been crucial.\n\n\"We've got two WNBL MVP post players both injured, but if you're talking about injured [post] players on modified minutes in Australia, we've probably got two of the top three right here,\" she said.\n\n\"What would be better is a fully fit Abby Bishop, but Abby Bishop not fit and managed well is a great pick up.\n\n\"It's a big difference maker when you've got quality international posts.\n\n\"Getting Bishop back after we lose Wauters is a monumental signing for us, there's not the player of Abby talent out there this time of year.\"\n\nCanberra begins its season against Dandenong at AIS Arena on Saturday, October 10. The story first appeared on The Sydney Morning Herald.", "source": "The Bellingen Shire Courier-Sun"}