{"published": "2015-09-17T01:06:32Z", "media-type": "News", "title": "Campbell's portals project could wrap up by end of the fall", "id": "dee79dfb-727b-41c9-999d-467a801e0f0c", "content": "Reconstruction of the tunnel that connects the Pruneyard shopping center to Campbell's historic downtown could come to an end by late fall with a little luck. \n\nThe colorfully lit East Campbell Avenue Portals that runs below Highway 17 has been under construction since November and seen sidewalk closures and traffic delays.\n\n\"There's still roadwork to be done,\" said city engineer Michelle Quinney. \"My personal goal is to have it done by the end of this year.\" \n\nThe tunnel is expected to be safer for pedestrians and bicyclists when fully renovated.\n\nRemoval of its interior walls--the largest portion of the project--has been finished, but an issue with utility lines cropped up during construction, according to Quinney. \n\nShe said crews \"ran into a lot of things that were underground,\" particularly utility lines that will need to be relocated.\n\n\"We're taking the extra time to make sure the utilities are placed correctly underground,\" Quinney said, adding that the city will work with Caltrans and utility companies to relocate the lines. \n\nQuinney said she does not expect the lines' relocation to affect the project's budget because money already was allocated for unforeseen issues.\n\nThe project's estimated cost is $4.85 million. More than 90 percent of that amount is covered by the Metropolitan Transportation Commission's One Bay Area Grant, Valley Transportation Authority's Bicycle Expenditure Plan and the Transportation Development Act.Other remaining work includes building retaining walls and installing electrical equipment. Occasional pedestrian detours and lane closures for the north and south sides of the area are expected to continue while sidewalks are widened.\n\n\"Now that people see the walkway, they're anxious,\" Quinney said. \"It's very tempting to walk through it.\" \n\nEventually, road markers, pedestrian lighting and public art installations will be installed, Quinney said.\n\n\"It will be a nice place to ride your bike and walk through once it's done,\" she said. Any questions or comments on the project should be emailed to publicworks@cityofcampbell.com.\n\nFor project updates, visit bit.ly/1VRZsrQ.", "source": "San Jose Mercury News"}