{"published": "2015-09-24T22:40:10Z", "media-type": "News", "title": "Oculus proclaims dawn of ‘virtual reality era’", "id": "7d2fedad-6e63-4cbf-8af1-d4d884980e4d", "content": "by Glenn Chapman\n\nSan Francisco (AFP) | 24 September 2015 20:45 \n\nSome 1,500 people already intrigued by the potential of virtual reality packed the Dolby Theater in Los Angeles for keynote presentations at a second annual Oculus Connect developers conference.\n\n“We believe the more power people have to share and experience all kinds of different things in the world, the better the world will be,” Facebook co-founder and chief Mark Zuckerberg told the audience during a brief appearance on stage.\n\n“After video, the next logical step is fully immersive virtual reality.”\n\nFacebook bought Oculus VR last year in a deal valued at $2 billion, heralding virtual reality as the next generation computing platform and one that will let people instantly “travel” to new places.\n\n“It was like teleporting to some other place just by putting on a headset,” Zuckerberg said while recounting the first time he tried a Rift prototype at Oculus offices.\n\n“It was so good, I didn’t want to really leave. I was seeing the next great technology platform.”\n\nThe first Rift virtual reality headset is on track for release in the first quarter of next year, followed shortly thereafter by the debut of Touch controllers designed to let people reach in and interact with faux worlds.\n\nAsus, Dell and Alienware will release personal computers with processing and graphics power configured for Rift virtual reality, and bearing a logo to show they are “Oculus Ready,” according to vice president of product Nate Mitchell.\n\nOculus has yet to disclose what it will charge for Rift headsets, but said that Oculus Ready computers coming to market will have prices less than $1,000.\n\n– VR priced for mainstream –\n\nSamsung Gear VR headgear powered by Oculus software is already on the market.\n\nAn improved version will debut in the United States in November at a price of $99, according to Peter Koo, a senior vice president in the mobile communications division o the South Korean consumer electronics titan.\n\n“It is really virtual reality on the go,” Oculus chief executive Brian Iribe said of Gear VR.\n\nKoo said the price was intended to be affordable enough to make virtual reality “mainstream.”\n\nPeople are already sharing 360-degree video and playing immersive games using Gear VR headsets, which let the company’s smartphones serve as display screens.\n\nThe new Gear VR model s 22 percent lighter than its predecessor, more comfortable to wear and has improve controls, according to Koo. The hardware works with the current year’s line-up of Galaxy smartphones.\n\n– Targeting gamers –\n\nOculus has taken direct aim at video game lovers, working with major studios and gaming engine makers to immerse players in virtual worlds.\n\nAn Oculus Arcade unveiled on Thursday boasted partners including Sega and Warner Brothers and games including Pac-Man and Sonic the Hedgehog.\n\nPopular online building game Minecraft made by Swedish studio Mojang is diving into virtual reality with the launch next year of Rift, according to Oculus founder Palmer Luckey.\n\nOculus Cinema capabilities and offerings were broadened and virtual reality gear users will be able to immerse themselves in game play streamed by Amazon-owned Twitch.\n\nOculus also announced an alliance with Netflix to stream 360-degree video that will let viewers change perspective as if they were in the middle of on-screen action, with new Netflix content set to be released.\n\n“This is a once-in-a-generation moment where we can create something that inspires millions of people…something that will change their lives forever,” Oculus chief executive Brendan Iribe told the audience.\n\n“This is the dawn of the virtual reality era.”\n\n© 2015 AFP", "source": "South Coast Sun"}