{"published": "2015-09-26T00:26:41Z", "media-type": "News", "title": "Berkeley pot club operator sues city, other clubs, alleging racketeering", "id": "a750b511-3f87-48cf-95f7-f402bb1eb286", "content": "_ BERKELEY -- A medical marijuana dispensary operator has sued the city and three other dispensaries in federal and state court, alleging the defendants created an illegal monopoly that shut out competitors and drove up costs for patients.\n\nIn the federal suit filed earlier this month in U.S. District Court, Chris Smith, principal in Forty Acres Medical Marijuana Growers Collective, also accuses the defendants of racketeering, in asking the court to put an end to the city's \"flagrantly unlawful actions to establish and enable the unlawful monopolization of the sale of medical marijuana in Berkeley by a few individuals operating in blatant violation of California law.\" \n\nSmith also alleges that the other three dispensaries violated what was California's prohibition on for-profit medical marijuana organizations.\n\nThe three dispensaries cited in the suits are Berkeley Patients Group; Berkeley Patients Care Collective; and Cannabis Buyers Club of Berkeley. Also cited as co-defendants are the Berkeley City Council and the city's Medical Cannabis Commission.\n\nCity Attorney Zach Cowan, without elaborating, said in an email, \"All (the suits) are without merits, and we will be moving to dismiss them all.\"\n\nA call to Cannabis Buyers Club was referred to another person, who said \"no comment.\" A call to Berkeley Patients Group was referred to the marketing director, who did not return a voice-mail message. A person posted outside Berkeley Patients Care's premises suggested contacting the management by phone, but a voice-mail message was not returned.Advertisement Forty Acres had operated for several years at 1820-1828 San Pablo Ave. until the city ordered it shut earlier this year after declaring it a public nuisance. Several years earlier, the city had ordered Forty Acres to cease operations because the city already had the maximum number of dispensaries, three, allowed under city rules at the time.\n\nThe citywide cap on dispensaries has since been raised to four, and on Tuesday the City Council will receive a report on the selection process and conduct a review.\n\nForty Acres was one of the applicants earlier in the current selection process but was rejected, according to a city staff report.\n\nMeanwhile, Forty Acres had reopened on Ashby Avenue, but as of Friday it was not open for business, the result, Smith said, of a preliminary injunction obtained by the city.\n\n\"I don't know why they put so much effort into closing a club if they call themselves a sanctuary city for medical cannabis,\" Smith said.\n\nHe said Forty Acres is \"being targeted for cultural differences,\" a theme also raised by defenders of Forty Acres in January, when the City Council ordered the San Pablo Avenue venue shut down, voting 7-2, with Councilmen Max Anderson and Kriss Worthington dissenting.\n\nSeveral detractors had told the council they found Forty Acres' clientele intimidating, while supporters noted that Forty Acres' clients are mostly black, and the neighborhood is undergoing gentrification.\n\nContact Tom Lochner at 510-262-2760. Follow him at Twitter.com/tomlochner.", "source": "Contra Costa Times"}