{"published": "2015-09-25T19:24:09Z", "media-type": "News", "title": "US stocks pare gains as health care sector slumps", "id": "ab7aa708-8c36-41af-9f59-6833cf6d41ea", "content": "U.S. stocks were mixed in late afternoon trading as a slump in health care stocks offset gains for financial stocks. The market started the day higher as investors were encouraged by a report that showed the U.S. economy grew faster in the spring than previously estimated. \n\nFinancial companies got a boost after Federal Reserve Chair Janet Yellen said that the central bank was still likely to raise interest rates this year. Nike jumped after posting strong earnings. \n\nKEEPING SCORE: The Standard & Poor's 500 index fell two points, or less than 0.01 percent, to 1,929 as of 3:13 p.m. Eastern time. The Dow Jones industrial average gained 83 points, or 0.5 percent, to 16,278. The Nasdaq composite dropped 50 points, or 1 percent, to 4,684. \n\nSPORTSWEAR SPURT: Nike soared after the company's earnings surpassed analyst expectations. Nike climbed $10.27, or 9 percent, to $125.15. \n\nGROWTH REVISION: The U.S. economy expanded at an annual rate of 3.9 percent in the April-June quarter, up from a previous estimate of 3.7 percent, the Commerce Department reported Friday. The strength came from gains in consumer spending, business investment and residential construction. \n\nRATE RISE COMING: Yellen said in a speech late Thursday that she expects the Fed to begin raising interest rates by the end of the year. She suggested global economic weakness won't be significant enough to alter the central bank's plan to raise its key short-term rate from zero by December. Record low interest rates since the 2008 global financial crisis have been a boon for stocks, underpinning a bull market that has run for six and a half years. \n\nTHE QUOTE: \"A gradually increasing rate environment is a positive, because it sends a signal ... that the U.S. is on a good, if not great, recovery to growth,\" said Scott Keifer, global investment specialist at JPMorgan private bank. He expects economic growth to average about 2.5 percent next year, allowing the Fed to raise interest rates gradually. \n\nFINANCIAL BOOST: Banks and other financial companies rose as bond rates climbed. The combination of higher rates and a growing economy is good for those companies. Banks can earn more from making loans when they can charge customers more to borrow money. Citigroup rose 2.8 percent and Bank of America climbed 2.6 percent. \n\nEUROPE'S DAY: France's CAC 40 jumped 3.1 percent, while Germany's DAX climbed 2.8 percent. Britain's FTSE 100 gained 2.5 percent. \n\nVW SLUMP: Volkswagen shares fell again on Friday. The company named Matthias Mueller, the head of the group's Porsche unit, to be the new CEO on Friday. His predecessor Martin Winterkorn quit the job this week over the scandal, which has tarnished the company's reputation. VW shares ended down 2.8 percent on Friday and dropped almost 30 percent for the week. \n\nBONDS, CURRENCIES: U.S. government bond prices fell. The yield on the benchmark 10-year Treasury note rose to 2.16 percent from 2.13 percent late Thursday. The euro rose to $1.1197 while the dollar edged up to 120.73 yen. \n\nASIA'S DAY: Japan's Nikkei 225 finished up 1.8 percent. South Korea's Kospi fell 0.2 percent and Hong Kong's Hang Seng inched up 0.4 percent. China's Shanghai Composite dropped 1.6 percent. \n\nMETALS: Gold closed $8.20 lower at $1,145.60 an ounce. Silver edged lower, dropping 1.9 cents to $15.11 and copper fell 1.9 cents to $2.28 per pound. \n\nENERGY: Benchmark U.S. crude rose 79 cents to close at $45.70 a barrel on the New York Mercantile Exchange. Brent Crude, a benchmark for many international oils, rose 43 cents to $48.60 a barrel in London.", "source": "Belleville News Democrat"}