{"published": "2015-09-15T22:00:26Z", "media-type": "News", "title": "Bright Akwetey to contest CPP for presidential slot", "id": "91c2a379-d857-4354-ab15-1fe91c8f8917", "content": "Accra, Sept. 15, GNA - Mr Bright Oblitei Akwetey, an Accra-based legal practitioner and a leading member of the Convention Peoples Party (CPP) on Tuesday declared his intentions to contest for the flag bearership slot of the party for Elections 2016.\n\nMr Akwetey told the Ghana News Agency in an interview that he is ready to lead the CPP to wrest power from the National Democratic Congress (NDC).\n\nHe said: 'Am capable of marshalling a formidable force in the country with the ability to shoulder effectively with the flag bearers of the National Democratic Congress, President John Dramani Mahama and New Patriotic Party's Nana Addo Dankwa Akufo-Addo.'\n\nMr Akwetey, who once investigated and prosecuted economic crimes in Ghana and The Gambia, says he had over the period critically examined the CPP and deduced that the party's inability to identify its core objectives, values and ideologies serve as its bane for unappealing performance since the 1992 election.\n\nHe said CPP would dwell on Kwame Nkrumah's ideologies as well as grassroots membership mobilisation and craft a message that would appeal to the electorate.\n\nMr Akwetey explained that CPP's continuous stay in the political backwoods was due to a loss of focus, direction and divisive ideas in the leadership front, adding: 'I have what it takes to re-package the CPP into a viable national political institution to fight for Elections 2016 and take over the reigns of government in the country.'\n\nHe said Ghana needs a president who has demonstrably shown the courage and audacity to fight corruption, because the time for lip service to fight the canker is over, and 'Mr Akwetey, a former State Attorney has what it takes to do that for Ghanaians'.\n\nMr Akwetey explained that his motivation to contest for the CPP flag bearership slot is to see Ghanaians as proud, confident, disciplined and law-abiding citizens, whose standards of living are measured not only in GDP terms, but also by the extent to which the average Ghanaian can afford good quality health, education, shelter, clothing, food and employment and has the opportunity to travel in decent transport and also secure and safe roads.\n\nMr Akwetey contested for the flagbearership of the party for Election 2012 but lost Dr Michael Abu Sakara Foster.\n\nDr Sakara polled 1,130 votes, representing 55.2 per cent of the total votes cast, to beat Mr Akwetey who garnered 917 votes - representing 44.8 per cent of the vote - making the contest quite a close one.\n\nGNA\n\nMore CPP News » Comments:\n\nThis article has 0 comment, leave your comment.", "source": "Modern Ghana"}