{"published": "2015-09-30T07:00:00Z", "media-type": "News", "title": "Figuring out the Common Core", "id": "294b1fee-d16e-4b81-90f3-c2d88154cbe8", "content": "  \n\nCalifornia’s new Common Core-aligned test scores were released this month. They weren’t good. \n\nOverall, 44 percent of California students met the test’s English language arts standard and 33 percent met the math standard. San Bernardino County was below average, with 37 percent meeting the English standard and 25 percent for math. Bear Valley Unified School District was low for the county, with 35 percent and 23 percent meeting English and math standards, respectively. \n\nThird through eighth-graders and 11th-graders took the tests, called the California Assessment of Student Performance and Progress. Eleventh-graders scored lower than the district average on English and math. The test was designed for students who took Common Core curriculum all through school, even though the new standards have only been implemented in the last few years. \n\nLow scores were “not unexpected,” said Lisa Waner, executive director of educational services for the Bear Valley school district. Although the State Board of Education voted to adopt the Common Core State Standards in 2010, individual districts were given flexibility, and Bear Valley started later than some others. Waner said this could be one factor in explaining the low scores. \n\nWaner also pointed to the district’s high percentages of English learners and students from low-income families as potential causes. She said the district is working to improve scores this year. \n\nBear Valley Unified is looking into buying new Common Core-aligned math textbooks. Since Common Core was introduced, according to Waner, older textbooks have often been simply re-branded as compliant with the new standards when they really fell short of that goal, but that trend is shifting. \n\nThe district hasn’t ordered new books yet. Waner said publishers will provide sample problems that teachers can review to see how it might work for their classes. “Teachers will make the ultimate decision because they’re the ones on the ground using the material,” Waner said. Most textbooks have an online component, Waner said. Whether to use physical books, e-books or both hasn’t been decided. \n\nThe district will also implement quarterly benchmarks, Waner said, which it used to do but which have been less prevalent in recent years. Last year students could take a practice test to learn to navigate the computer-based test, and teachers were encouraged to administer it. This year, practice tests will be mandatory and more closely reflect actual test questions. \n\n“We’re still sending teachers to different trainings,” Waner said. “We’re looking at bringing up a math coach to help with different strategies, different ways of teaching that match the Common Core philosophy a little bit better.” \n  \nThe performance metric that impacts districts most directly is the federal Adequate Yearly Progress measure. If districts don’t meet AYP requirements they may come under closer oversight. While funding may increase, it’s more strictly controlled. AYP usually measures four categories: attendance, graduation rate, test participation rate and test scores. \n\nLast spring’s scores on California’s new tests won’t be taken into account for this year’s evaluation. “They’re not taking that as an accountability measure because they’re just setting the first baseline for it,” Waner said. All the numbers aren’t in yet, but Waner believes Bear Valley Unified will meet all the other AYP requirements. The AYP will likely take scores on the new tests into account in the future, but it’s unclear how soon. \n\n“Every meeting I go to at the county, the state is still figuring this out and changing things all the time,” Waner said. \n\nContact reporter Jonathan Riley via email at \n\njriley.grizzly@gmail.com.", "source": "Big Bear Grizzly"}