{"published": "2015-09-28T11:05:55Z", "media-type": "News", "title": "Vineland's Bishop McCarthy residences hold viewing party for papal Mass", "id": "4a28371c-05e5-4d28-97e8-00fb6c59582b", "content": "VINELAND  —While thousands of people headed to the streets of Philadelphia to see Pope Francis' final public appearance of his North American tour, residents of Bishop McCarthy Residence in Vineland found the perfect way to avoid the crowds. \n \nOn Sunday afternoon residents and staff at the long-term care facility gathered together to watch the live television coverage of Pope Francis' final public Mass in conjunction with the World Meeting of the Families. \n Melissa Melendez assists residents with their crafting projects at Bishop McCarthy Residence. The long-term care facility held a viewing party on Sunday during Pope Francis' Mass. (Lauren Rodia | For NJ Advance Media.) \n   \n\"It's very special for them,\" said Activity Aide Melissa Melendez. \"They are very excited to see the Pope on television. Even though they couldn't be there to see him in person it's still very special for them.\" \n \nAmong the attendees of the live viewing party was Bishop McCarthy resident Jane Cinghina, who has been watching coverage of the Pope since his arrival in America earlier this week. \n \n\"I enjoy seeing the Pope,\" said Cinghina. \"I've watched a lot of his visit so far on TV. What I like best is seeing the people getting along and being so nice to the Pope. It's beautiful to watch.\" \n \nLeading up to the Mass at 4 p.m., residents enjoyed a variety of activities including coloring pages, Pope related trivia sheets, and the decoration of paper crosses to memorialize the event. \n \n\"We are going to be working on crosses for the residents to keep to remember the Pope coming to Philadelphia,\" said Melendez. \"Having the residents make crafts is a little more hands-on so they're not just sitting down and watching TV. With the activities and live viewing, we try to make this special day fun for everyone.\" \n MORE :  N.J. pilgrims travel by bus and train to Pope Francis' visit \nShowing off one of the brightly colored crosses she had made was Grace Mills, who said she enjoyed the challenge of crafting her very own Pope-themed memorabilia. \n \n\"The crafts are a little challenging for me, because I'm not much for putting little things together but I'm trying it,\" said Mills. \"The crafts go along well with our visit from the Pope today so it's very nice.\" \n \n\"I enjoy the crafts,\" said Cinghina. \"I come from a small town with a small church so it's nice to see and do stuff with other people.\" \n \nAccording to Nayaska Ramirez, a local college student and volunteer, the party's participants all seemed to be in good spirits leading up to the afternoon Mass. \n \n\"I think everyone is really happy,\" said Ramirez. \"They seem to be in a really positive mood and they seem to be enjoying the crafts and activities that are here for them.\" \n \nAlthough the crafts were enjoyable, the real happiness came from knowing that the Pope was nearby, according to Allesandra Batchelor. \n \n\"It's very nice to have him here and he's such a good man,\" said Batchelor. \"The Pope is the greatest. We all love to see him come visit and we will hate to see him go.\" \n South Jersey Times may be reached at sjnews@njadvancemedia.com . Follow us on Twitter @theSJTimes . Find the South Jersey Times on", "source": "Warren Reporter"}