{"published": "2015-09-07T17:58:19Z", "media-type": "Blog", "title": "LOT and Frankfurt airport celebrate the 50th anniversary of Warsaw- Frankfurt flights", "id": "05cae976-6205-484f-94cb-5280fd03a5b2", "content": "Home Transportation Aviation News LOT and Frankfurt airport celebrate the 50th anniversary of Warsaw- Frankfurt flights\rTransportationAviation News\rLOT and Frankfurt airport celebrate the 50th anniversary of Warsaw- Frankfurt flights\rBy Iuliia Tore - Sep 7, 2015 Exactly 50 years ago, on 7 September 1965, LOT operated its  maiden scheduled flight between Warsaw and Frankfurt.  The German financial centre quickly became one of the key cities in LOT’s route network. Currently, the Polish carrier performs three flights a day between Warsaw and Frankfurt, offering three travel classes – LOT Business, LOT Premium Economy and LOT Economy Class as well as the most convenient schedule on this city pair. The first flight from Warsaw to Frankfurt was operated by an Ilyushin 18 aircraft. After the fall of the Berlin Wall, LOT was one of the first airlines using Western-type aircraft – mainly Boeing 737. Presently flights on this route are operated by comfortable Embraer 170, 175 and 195 aircraft, appreciated by passengers for their cabin comfort. Today, on the 50th anniversary of the inaugural flight, LOT, together with Frankfurt Airport, prepared a surprise for the passengers of the anniversary LO382 flight. Prior to the departure from Frankfurt all passengers participated in the cake cutting ceremony at the gate.  They were served snacks and refreshments and, naturally, a piece of the cake. Meanwhile, passengers travelling onboard the aircraft from Warsaw to Frankfurt and back to Warsaw heard a special announcement and were served an additional refreshment. “We are happy to celebrate this anniversary together with Frankfurt Airport and to recall how our offer developed over that time. We are currently the only airline that apart from Business and Economy class also offers LOT Premium Economy class on this route. It means that our passengers have even more freedom in choosing an offer which best suits their individual needs. We are also the carrier of choice for the business traveler. The 7:30 a.m. flight from Frankfurt to Warsaw is the first connection of the day between these two cities, catering to the business traveller community and ideal for a  one-day business trip” says Jiri Marek, LOT Sales and Distribution Executive Director.“German passengers choose Warsaw  more frequently to connect to LOT’s long-haul flights. Thanks to attractive prices and our Dreamliner fleet, as well as  continuously improved service, LOT flights with a transfer are becoming an ever more attractive alternative” adds Jiri Marek. Dr. Pierre-Dominique Prümm, head of Fraport AG’s Airside and Terminal Management unit, says: “Fraport AG is proud of the long-standing and excellent business relationship between Frankfurt Airport and LOT Polish Airlines. We look forward to the continuation of this very fruitful connection between Frankfurt and Warsaw. LOT is one of the most long-standing airlines serving into Frankfurt Airport. Today, LOT operates a modern fleet of environmentally-friendly aircraft, thus greatly contributing to our common success – now and in the future. This is all the more reason to celebrate this very special anniversary. We wish LOT many more years of ‘happy landings’.” LOT offers three flights a day between Warsaw and Frankfurt. Flights depart Warsaw at 7:45 a.m., 5:05 p.m. and 8:15 p.m., and depart Frankfurt at 7:30 a.m., 10:35 a.m. and 7:50 p.m. The Polish carrier is a member of Star Alliance as well as the Miles&More frequent flyer program. These are additional benefits for passengers travelling on this route. LOT is one of the most punctual airlines at  Frankfurt Airport. Share the post \"LOT and Frankfurt airport celebrate the 50th anniversary of Warsaw- Frankfurt flights\" FacebookTwitterGoogle+PinterestLinkedInWeiboVKontakteE-mail Previous articleAir France increases capacity between Europe and St. Martin\nNext articleДелегация Рас-Аль-Хаймы едет на выставку «Отдых» 2015 Iuliia Tore\nRELATED ARTICLESMORE FROM AUTHOR\nAviation News Air France increases capacity between Europe and St. Martin Aviation News Tourism New Zealand partners with Qantas Aviation News airBaltic to launch Riga – Verona", "source": "Rus Tourism News"}