{"published": "2015-09-18T23:21:13Z", "media-type": "News", "title": "Stuart Lancaster hails England try hero Mike Brown after Fiji victory", "id": "5b9a61db-35d0-4eef-846c-f307cd335786", "content": "Stuart Lancaster praised England's try hero Mike Brown for lifting the team \"by the scruff of the neck\" to secure victory against Fiji - and a potentially crucial bonus point. \n \nThe England head coach admitted however that the hosts will have to improve on their display in the opening match of the Rugby World Cup in their Pool A games against Wales and Australia. \n \nAfter an opening penalty try for England, Brown scored twice before Billy Vunipola crashed over for the fourth - and the bonus point - in the last play of the match. \n \nLancaster, who described the atmosphere of the opening match as \"phenomenal\", said: \"I thought Browny was excellent. His ability to beat the first defender is a great trait and he inspires the team - he plays with such courage, pace and power. \n \n\"He lifted the team by the scruff of the neck in the second half.\" \n \nLancaster admitted the introduction of replacements including Vunipola and his brother Mako, Owen Farrell and Sam Burgess had given England the final momentum - and put the substitutes in contention to start next weekend's meeting with Wales. \n \nHe added: \"Yes I think they have. We always select one game at a time and the the bench really put their hands up and that's what you want them to do. With the quality of the team coming up against next week we need to be at our best and it's a big challenge against Wales. \n \n\"The key messages are to play in the right areas of the field, trust the game will come to us and be more direct. We were too lateral in the first half and the players realised that. Billy, Mako and Sam came on and did well for us, provided quicker ball and that proved the difference in the end. \n \n\"We need to improve, that's no doubt, but had we been offered four tries and the bonus point I would absolutely have taken that at the start of the game. \n   Promoted stories   \nI think Fiji will cause every team problems. They play Australia next and then have an eight-day break before Wales.\" \n \nLancaster confirmed lock Geoff Parling had come off with an injury that was a \"mild stinger\" but that he would be fit for Wales. \n \nFiji's head coach John McKee claimed England would have been disappointed with their display and would need to sharpen up for their big games with Wales and Australia. \n \nMcKee said: \"We are a bit disappointed in the dressing room - we came here with high ambitions and felt we had England under pressure at times but critical turnovers and penalties allowed England to come back into the game and stopped us building any momentum. \n   \n Share article  \n   \n\"I think England could possibly be a bit disappointed in their performance at times. They started off quite dangerous in the maul but didn't go on with that and maybe didn't take their opportunities in attack. \n \n\"This pool was not decided tonight that's for sure. England are probably looking at their games and thinking they are going to have to sharpen up for games against Wales and Australia.\"", "source": "Bournemouth Daily Echo"}