{"published": "2015-09-21T23:04:48Z", "media-type": "News", "title": "Leeds United: Wilks nets four as United youngsters thrash Rangers", "id": "96100f58-24cc-47b0-8621-36a6a84693fb", "content": "Leeds United’s Under-18s turned on the style by hitting an incredible nine goals in a spectacular rout of Queens Park Rangers on Saturday. \n\r\n\t\t\r \nA four-goal haul from Chapeltown youngster Mallik Wilks maintained the Under-18s’ impressive start to the season under new coach John Anderson. \n\nWilks, who joined Leeds on scholarship terms this summer and has already scored eight times, dominated a one-sided clash between Leeds and QPR at Thorp Arch. \n\r\n\t\t\t\r \nWing-back Tom Pearce claimed two goals and Mike Taylor, Clarke Oduor and Lewis Knight weighed in with finishes to round off an eye-catching 9-2 victory. \n\r\n\r\n\r\n\r \nUnited’s Under-18s are in new hands this season following Anderson’s appointment to the academy coaching staff. \n\nThe former Hull City and Bristol Rovers defender came to Leeds from Hull’s academy and has been given sole control of Leeds’ Under-18s. \n\nJason Blunt, who was originally expected to manage that squad alongside Anderson, is currently assisting new academy director Paul Hart in coaching United’s development squad. Leeds’ Under-18s have won six of their open seven matches, suffering a solitary blip in a 2-0 defeat to Crystal Palace two weeks ago and sit at the top of their professional development league. \n\nPeterborough’s new manager Graham Westley has told the club’s fans to judge him on how his team plays following some negative reaction to his appointment. \n\r\n\t\t\t\r \nThe 47-year-old’s spell at Preston was overshadowed by reports of player unrest and criticism of both his management and playing style before he was sacked just over a year in charge and Posh fans have also raised concerns. \n\nHe said: “It’s actions, not words that are going to inspire people. Whatever cynicism or scepticism there is, they’re going to watch the team and they’re going to see the confidence and energy and organisation, the verve and the drive that the team is going to play with. And it’s that they’ll ultimately judge me on.” \n\r \r\n\t\t\r\n\t\t\t\t\t\r\n        \r  Have you got something to share on the story? \r Were you there? What do you think? - Send your pictures, videos or story and we'll publish the best \r\n\t\r  \nLoading ... \n Add up to 3 photos or 1 videos to the story   \nThere's been a problem uploading your files. Please try again. \n By uploading your file you agree to our \r  Terms and Conditions \r \r\n\t                         \t                    \r Upload your files \r \r\n\t\t\t\t\t\t\r   \r × \r  Continue the story  \nSign in to contribute \n sign in   \nshape the news in your area...", "source": "Yorkshire Evening Post"}