{"published": "2015-09-25T21:58:42Z", "media-type": "Blog", "title": "Fall Maintenance Checklist", "id": "58a65e06-8fe4-47b9-8bb5-57f8d62b881b", "content": "By: John Riha You’ll be ready for winter’s worst and head off expensive repairs when you complete this checklist of 10 essential fall maintenance tasks. 1. Stow the mower.\nIf you’re not familiar with fuel stabilizer, you should be. If your mower sits for months with gas in its tank, the gas will slowly deteriorate, which can damage internal engine parts. Fuel stabilizer ($10 for a 10-ounce bottle) prevents gas from degrading. Add stabilizer to your gasoline can to keep spare gas in good condition over the winter, and top off your mower tank with stabilized gas before you put it away for the winter. Run the mower for five minutes to make sure the stabilizer reaches the carburetor. Another lawn mower care method is to run your mower dry before stowing it. 1. When the mower is cool, remove the spark plug and pour a capful of engine oil into the spark plug hole. 2. Pull the starter cord a couple of times to distribute the oil, which keeps pistons lubricated and ensures an easy start come spring. 3. Turn the mower on its side and clean out accumulated grass and gunk from the mower deck. 2. Don’t be a drip. Remove garden hoses from outdoor faucets. Leaving hoses attached can cause water to back up in the faucets and in the plumbing pipes just inside your exterior walls. If freezing temps hit, that water could freeze, expand, and crack the faucet or pipes. Make this an early fall priority so a sudden cold snap doesn’t sneak up and cause damage. Turn off any shutoff valves on water supply lines that lead to exterior faucets. That way, you’ll guard against minor leaks that may let water enter the faucet. While you’re at it, drain garden hoses and store them in a shed or garage. 3. Put your sprinkler system to sleep. Time to drain your irrigation system. Even buried irrigation lines can freeze, leading to busted pipes and broken sprinkler heads. 1. Turn off the water to the system at the main valve. 2. Shut off the automatic controller. 3. Open drain valves to remove water from the system. 4. Remove any above-ground sprinkler heads and shake the water out of them, then replace. If you don’t have drain valves, then hire an irrigation pro to blow out the systems pipes with compressed air. A pro is worth the $75 to $150 charge to make sure the job is done right, and to ensure you don’t have busted pipes and sprinkler head repairs to make in the spring. 4. Seal the deal. Grab a couple of tubes of color-matched exterior caulk ($5 for a 12-ounce tube) and make a journey around  your home’s exterior, sealing up cracks between trim and siding, around window and door frames, and where pipes and wires enter your house. Preventing moisture from getting inside your walls is one of the least expensive — and most important — of your fall maintenance jobs. You’ll also seal air leaks that waste energy. Pick a nice day when temps are above 50 degrees so caulk flows easily. 5. De-gunk your gutters. Clogged rain gutters can cause ice dams, which can lead to expensive repairs. After the leaves have fallen, clean your gutters to remove leaves, twigs, and gunk. Make sure gutters aren’t sagging and trapping water; tighten gutter hangers and downspout brackets. Replace any worn or damaged gutters and downspouts. If you find colored grit from asphalt roof shingles in your gutters, beware. That sand-like grit helps protect shingles from the damaging ultraviolet rays of the sun. Look closely for other signs of roof damage (#5, below); it may be time for a roofing replacement. Your downspouts should extend at least 5 feet away from your house to prevent foundation problems. If they don’t, add downspout extensions; $10 to $20 each.\n6. Eyeball your roof. If you have a steep roof or a multistory house, stay safe and use binoculars to inspect your roof from the ground. Look for warning signs: Shingles that are buckled, cracked, or missing; rust spots on flashing. Any loose, damaged, or missing shingles should be replaced immediately. Black algae stains are just cosmetic, but masses of moss and lichen could signal roofing that’s decayed underneath. Call in a pro roofer for a $50 to $100 eval. A plumbing vent stack usually is flashed with a rubber collar — called a boot — that may crack or loosen over time. They’ll wear out before your roof does, so make sure they’re in good shape. A pro roofer will charge $75 to $150 to replace a boot, depending on how steep your roof is. 7. Direct your drainage. Take a close look at the soil around your foundation and make sure it slopes away from your house at least 6 vertical inches over 10 feet. That way, you’ll keep water from soaking the soils around your foundation, which could lead to cracks and leaks. Be sure soil doesn’t touch your siding. 8. Get your furnace in tune. Schedule an appointment with a heating and cooling pro to get your heating system checked and tuned up for the coming heating season. You’ll pay $50 to $100 for a checkup. An annual maintenance contract ensures you’re at the top of the list for checks and shaves 20% off the cost of a single visit. Change your furnace filters, too. This is a job you should do every two months anyway, but if you haven’t, now’s the time. If your HVAC includes a built-in humidifier, make sure the contractor replaces that filter. 9. Prune plants. Late fall is the best time to prune plants and trees — when the summer growth cycle is over. Your goal is to keep limbs and branches at least 3 feet from your house so moisture won’t drip onto roofing and siding, and to prevent damage to your house exterior during high winds. For advice on pruning specific plants in your region, check with your state extension service.\n10. Give your fireplace a once-over. To make sure your fireplace is safe, grab a flashlight and look up inside your fireplace flue to make sure the damper opens and closes properly. Open the damper and look up into the flue to make sure it’s free of birds’ nests, branches and leaves, or other obstructions. You should see daylight at the top of the chimney. Check the firebox for cracked or missing bricks and mortar. If you spot any damage, order a professional fireplace and chimney inspection. An inspection costs $79 to $500. You fireplace flue should be cleaned of creosote buildup every other year. A professional chimney sweep will charge $150 to $250 for the service. Read more: http://www.houselogic.com/home-advice/seasonal-maintenance/fall-checklist/#ixzz3mn1M93kJ “Copyright NATIONAL ASSOCIATION OF REALTORS®. Reprinted with permission”", "source": "Tri-City Area and Real Estate Blog"}