{"published": "2015-09-18T14:25:46Z", "media-type": "News", "title": "NEWTEK Business Services Corp Receives New Coverage from Analysts at Compass Point (NEWT)", "id": "7852c7a5-222e-4db8-8c30-e5661e58561b", "content": "Compass Point started coverage on shares of NEWTEK Business Services Corp (NASDAQ:NEWT) in a research report sent to investors on Thursday morning, The Fly reports. The firm issued a neutral rating and a $17.50 target price on the stock. \n \nNEWT has been the topic of several other research reports. Zacks upgraded shares of NEWTEK Business Services Corp from a hold rating to a strong-buy rating and set a $20.00 price target for the company in a report on Thursday, August 20th. Singular Research boosted their price target on shares of NEWTEK Business Services Corp from $20.00 to $22.00 and gave the company a buy rating in a research report on Monday, August 3rd. Three analysts have rated the stock with a hold rating, two have given a buy rating and one  has given a strong buy rating to the stock. NEWTEK Business Services Corp  has a consensus rating of Buy and a consensus target price of $19.83. \n \nShares of NEWTEK Business Services Corp ( NASDAQ:NEWT ) traded up 0.2492% during mid-day trading on Thursday, reaching $16.6514. 4,261 shares of the company’s stock were exchanged. The company has a 50 day moving average price of $17.56 and a 200 day moving average price of $17.78. The firm has a market cap of $172.39 million and a P/E ratio of 9.2354. NEWTEK Business Services Corp has a 52-week low of $12.61 and a 52-week high of $19.95. \n \nNEWTEK Business Services Corp (NASDAQ:NEWT) last released its earnings results on Wednesday, July 29th. The company reported $0.49 earnings per share for the quarter, beating analysts’ consensus estimates of $0.48 by $0.01. Analysts forecast that  NEWTEK Business Services Corp will post $1.92 earnings per share for the current fiscal year. \n \nNewtek Business Services Corp. is an internally managed, closed-end, non-diversified management investment company. The Company is focused on developing and marketing business and financial products and services aimed at the small- and medium-sized business ( NASDAQ:NEWT ) market and on developing a recognized brand for independent business owners. The Company’s brand, The Small Business Authority, is a national lender and owns and controls certain controlled portfolio companies that provide business and financial products to the SMB market.", "source": "SleekMoney"}