{"published": "2015-09-09T01:38:49Z", "media-type": "News", "title": "Miles contradicts himself while explaining cancellation", "id": "2fee72ea-5da3-4aa2-80c9-be865f15fc7f", "content": "File/USA TODAY Sports Will Les Miles and LSU improve on last season?s 8-5 record? Glenn Guilbeau believes so. Nov 27, 2014; College Station, TX, USA; LSU Tigers head coach Les Miles on the sideline during the second quarter against the Texas A&M Aggies at Kyle Field. Mandatory Credit: Troy Taormina-USA TODAY Sports (Photo: Troy Taormina-USA TODAY Sports) \n\nBATON ROUGE — LSU football coach Les Miles tried to further explain why the McNeese State game was not re-started Saturday night and eventually canceled altogether after a rash of lightning strikes stopped the game at 6:50 p.m. early in the first quarter. \n\nAfter nearly four hours of waiting to play, the game was called at 10:30 p.m. \n\n“Our guys were getting pent up,” Miles said at his weekly press luncheon Monday. “They were in the locker room for hours, and we basically told them to stretch and relax and nap, if you will. We said, ‘We’re going to get you some food.’ We fed them. And we spent the time, to be very honest with you, in view of what our players needed should they take the field.” \n\nMiles said the decision was made at 10:30 p.m. not to re-start the game even with better weather on the way because LSU officials did not want the players still playing at around 3 a.m. \n\n“We were in a position where, let’s see, if we could have got on the field at 11:45, we would have played it,” Miles said. But Miles said LSU’s doctors were asked about the players’ bodies’ reactions to playing until likely 3 a.m. \n\n“We asked them very specifically, ‘What is this like for our athletes?’ Well, they won’t be as reactionary. They will not be as prepared. They will not have food. They will not have nutrition,” Miles said after just saying the players were fed during the delay. \n\n“They will not have rest,” Miles said. “It’s likely, I should say a greater percentage chance, that they could have injury, let alone mindset.” \n\nTEUHEMA, CLARK DISCIPLINED?: LSU sophomore backup defensive ends Sione Teuhema and Deondre Clark did not dress out for the LSU-McNeese State game Saturday even though neither is injured and there is no limit to the number of Tigers who can be dressed out for a non-conference home game. \n\nAsked if Teuhema and Clark will dress out for Saturday’s game at Mississippi State (8:15 p.m. on ESPN), Miles said, “I’m not certain. It depends on if they earn their way there. We play the best players. Certainly, if they’re the best players, they’ll step in there and go.” \n\nAsked if Teuhema and Clark did not dress out for disciplinary or performance reasons, Miles said, “It’s all performance based.” \n\nIn the past, though, many LSU players have dressed out for games despite performance issues because they never played and kept on dressing out for non-conference home games and never played. \n\nStarting defensive end Tashawn Bower was asked about Teuhema and Clark Tuesday. \n\n“If you get injured or suspended or anything, I really try to tell them that nobody’s job is ever set in stone,” Bower said. “You’re only going to get on the field by practicing well. I’ve seen players move up the depth chart just from practicing better, and that’s what they have to do.” \n\nQUOTE OF THE DAY : “I think we need to petition to get some cow bells in our stadium. I think it would be an enjoyable piece as well.” \n\n— LSU coach Les Miles when asked Monday about dealing with the cow bells Mississippi State fans ring at their home games. \n\nRead or Share this story: http://www.theadvertiser.com/story/sports/college/football/2015/09/08/miles-contradicts-explaining-cancellation/71911542/", "source": "Lafayette Daily Advertiser"}