{"published": "2015-09-16T16:45:00Z", "media-type": "News", "title": "Glenn R. Hoffman", "id": "e97144a3-e3ee-4850-92a8-bb544ae12b3f", "content": "Dec. 11, 1932 - Sept. 14, 2015 \n\nPayette \n \nGlenn R. Hoffman of Payette passed peacefully in his home on Sept. 14, 2015 after fighting a courageous battle with cancer. He was surrounded by his family and dear friends. \n\nHe will be greatly missed by all who knew and loved him but there is great comfort knowing that he is no longer suffering, is at peace in the arms of Jesus and that one day we will see him again! \n\nGlenn was born on Dec. 11, 1932 in Sharon Springs, KS. \n\nHe was the youngest of three children born to Harold and Irene Hoffman. Because his father was a pastor, he moved often and lived in different towns throughout his childhood. \n\nIn 1950 Glenn graduated from Fruitland High School and then moved to Payette. \n\nHe joined the Navy in 1953 and proudly served his country in the active Navy, Naval Reserve and the National Guard for 28 years. \n\nIn 1953 Glenn married Dorothy Harper. Glenn was stationed in Hawaii when his first son, Michael was born. \n\nAfter completing active duty, Glenn returned to Payette where his two daughters, Margaret “Marty” and Kathleen were born. \n\nGlenn worked as an electrician for McKnight and Syme Electric. As with everything in Glenn’s life, he cared deeply about quality and gained the reputation of the electrician you wanted working on your home. \n\nIn 1980 Glenn was divorced. He later met his best life friend, teammate and partner. \n\nIn 1996 Glenn married his best friend, Diana Caillavet. Not only did Glenn gain a wonderful wife but also another family who would bless his life greatly. In this union, Glenn became a father to Diana’s daughters Denise and Renee. \n\nGlenn was a remarkable, talented man with a servant’s heart. There wasn’t much he could not do and was always happy to help. \n\nHe was the one to call if something wasn’t working or you needed a little help with a project. We often joked that all he had to do was look at something and it would start working again. \n\nDad’s talent also showed in his wood working; the beautiful furniture, frames, children’s toys and decorations that grace our homes. Nothing Glenn did was done without much thought and care and it showed in the things he created and in the lives he touched. \n\nGlenn was a man of God. His faith in Christ was foundational to all he did and how he lived his life. \n\nHe was a wonderful husband, father, grandfather and great grandfather. His family was of the utmost importance to him. His faith, stability, consistency and thoughtfulness blessed us all beyond measure. \n\nGlenn had many friends, hobbies and interests. He loved the time spent golfing or working on projects with his great friends and meeting these same friends and more for coffee at Burger King and Friday morning breakfasts. \n\nHe loved “making sawdust” to coin his term, which actually meant creating wooden works of art. \n\nHis love for animals was evident in the menagerie of creatures at his home from horses to donkeys to chickens to cats and beloved dogs. \n\nHe took pride in his lawn and garden. \n\nGlenn enjoyed watching sports and you could often find him sitting in his recliner catching a baseball game or golf tournament. \n \nGlenn had a love for music and a beautiful voice. From the time he was very young Glenn played the harmonica. His playing the harmonica was always a favorite part of family gatherings. \n\nGlenn also loved spending time in Donnelly at “The Shack” which became a favorite family gathering place. \n\nGlenn will be so greatly missed, but his life will forever inspire all who had the blessing of knowing him. \n\nHe is survived by his loving wife, Diana; sister Naomi Phillips of Tacoma, WA; son Michael Hoffman of Boise; daughter, Marty (Jim) Anderson of Kauai, HI; daughter, Kathleen (Ron) Hezeltine of Meridian; daughter, Denise (Jim) Black of Hauser, ID; and daughter, Renee (Nick) Sandmeyer of Boise. \n\nHe is also survived by his grandchildren, Laura (Nick) Robinson, Annie (Kyle) Schwab, Molly Hezeltine, Kacey Goodman, Erin Sandmeyer, Atticus Hoffman, Phoebe Hoffman and Olivia Hoffman; and his great grandchildren, Talor Robinson, Chloe Robinson, Knova Goodman and Mya Schwab. \n\nHe is also survived by his sister and brother in-law, Linda and Gary Nordquist; many beloved nieces and nephews; and his special friends. \n\nGlenn was preceded in death by his father and mother, Harold and Irene Hoffman; his brother, Duane Hoffman; his brother-in-law, John Phillips; and his nephew, Doug Hoffman. \n\nA visitation will be held from 6-8 p.m., Thursday, Sept. 17th at Shaffer-Jensen Memory Chapel, 112 N. 9th St., Payette. \n\nA celebration of Glenn’s life will be held at 2 p.m., Friday, Sept. 18th at West Valley Free Methodist Church, 100 E. 1st St., Fruitland, with graveside following at Riverside Cemetery, Payette. \n\nCondolences may be made to Glenn’s family at www.shaffer-jensenchapel.com . \n\nThe family would like to thank the doctors and nurses at St. Luke’s MSTI in Fruitland and St. Luke’s Hospice for the amazing love, care and support given during this time. \n\nMemorials can be made in Glenn’s name to the Payette First Baptist Church, Fruitland West Valley Free Methodist Church, or the charity of your choice, c/o Shaffer-Jensen Memory Chapel, P.O. Box 730, Payette, ID 83661.", "source": "Argus Observer"}