{"published": "2015-09-30T23:26:53Z", "media-type": "News", "title": "Stone layoffs apace of oil downturn", "id": "7e58e248-bd7c-4f6b-87a7-65f1554a35ee", "content": "Stone Energy confirmed layoffs occurred this week. (Photo: File photo) \n\nLayoffs this week at Stone Energy follow the company’s yearlong effort to manage resources carefully while oil and gas prices remain low globally. \n\n“We’ve seen this coming for a while,” Stone Energy President and CEO Dave Welch said Wednesday. “We started reducing last year.” \n\nWelch said employee rolls have dipped from about 400 to about 300 employees since late 2014, a number that includes retirements and natural attrition. He declined to say how many jobs were lost this week but said losses were felt around the company, which has sites in Lafayette, Houston, West Virginia, New Orleans and deepwater. \n\nIn January, Stone Energy announced it was cutting its operating budget from $875 million in 2014 to $450 million this year. About three-quarters of its budget was allocated to Gulf of Mexico deepwater activity; 8 percent to Appalachia, primarily around West Virgina; 4 percent to business development and 13 percent to abandonment expenditures. The company's emphasis in deepwater and in Appalachia was because of lower operating expenses. \n\nLease operating expenses were cut by some 40 percent, he said, administration by about 20. \n\n“When the price for your product drops in half, people are telling you they don’t need more of your profit,” he said. Some financial forecasters are predicting that prices will remain low through 2016, although Welch said that’s not certain. The careful choice for leadership, he said, is to keep expenses “lower for longer” within the company. \n\nStone Energy strengths include two Gulf of Mexico sites that provide additional development opportunities. The company’s risks in the Gulf are lower and Stone Energy can “carry its product forward over the next few years,” he said. \n\n“We are hoping for a rebound, but we cannot plan on it,” he said. The intention going forward, he said, is to spend within the company’s profits. \n\nStone Energy did not file Worker Adjustment and Retraining Notification Act notices of the layoffs with the state because layoffs were diffused and did not meet minimum benchmarks for WARN notices in Louisiana. \n\nWelch declined to name specific positions where layoffs occurred, but said since the workforce reductions have started, there have been one executive and six managers laid off. Other individual contributors who have lost their jobs include “highly trained and educated” people whose jobs were important to the company. \n\nLayoffs represent “the worst part of the job by far,” Welch said — for managers who make the announcements but especially for those who lose their jobs. \n\n“Sometimes these cycles come and we do what we have to do,” he said. Welch, who has served as president and CEO for 12 years, said recent downturns include those of 1999-2000; 2008, which he said was short term; and the current downturn. \n\nHe said the company would continue community volunteering efforts, which include a high-profile cookout for United Way and work in the public schools. \n\n“Our people will continue to step up. It’s part of who we are,” he said. \n\nRead or Share this story: http://www.theadvertiser.com/story/money/business/2015/09/30/stone-layoffs-apace-oil-downturn/731", "source": "Lafayette Daily Advertiser"}