{"published": "2015-09-15T10:32:55Z", "media-type": "News", "title": "Helping Families Celebrate Halloween in a Healthier Way: Introducing the Original Switch Witch Doll and Storybook", "id": "5595bd9d-64de-4414-99d5-387d566724e0", "content": "PRWeb \nThis year, there's a way for kids to enjoy Halloween without as much sugar!  With the Switch Witch toy and story, kids are excited to trade some of their trick-or-treating candy for a gift from their very own \"magical\" Switch Witch. \n\nIntroducing Switch Witch: an original plush Switch Witch doll and cauldron, brought to life by the children's book written by Lara Spear Riley and illustrated by Nashbox, all in a keepsake box. \n   \nWith many families struggling with children's food allergies, childhood obesity, Type 1 diabetes, and dental health, this new Halloween tradition allows families to take the focus away from the candy in an easy way that is positive, enjoyable, and exciting for kids.  Much like Elf on the Shelf, Switch Witch brings a new holiday tradition for all families to bring in to their homes. \n\nBrother-and sister-in-law Rob Bouley and Lara Spear Riley created and co-own The Switch Witch LLC. As parents of young children, Bouley and Riley are passionate about giving families a holiday tradition to enjoy together, while supporting better health for children.  Both Bouley and Riley understand the parenting challenges of sweets-focused holidays: Bouley's son had nut and dairy allergies, and Riley's daughter was diagnosed with Type 1 diabetes this past Spring.  This family duo is striving to make Halloween safer, healthier, and more magical for kids. \n\nIn the days leading up to Halloween, children play with their Switch Witch doll. As all good hosts do, kids make their Switch Witch friend feel happy and welcome. In exchange, each Switch Witch has an amazing surprise on Halloween night. At bedtime, kids leave a heap of trick-or-treat sweets with their Switch Witch pal, and in the morning they will see that their candy has been magically switched (wink! wink!) for a special switch gift. \n\nContributing to this family tradition, the Switch Witch Log at the end of the book is a great way to record children's Halloween memories - with plenty of space to log dates, Halloween costumes, and Switch Witch gifts. \n\nThe Switch Witch LLC is also an official sponsor of Operation Gratitude - donating a portion of every Switch Witch sale to this national non-profit which annually sends 150,000+ care packages filled with snacks, hygiene products, hand-made items, and personal letters of appreciation to U.S. troops deployed overseas.  So this Halloween, when parents find themselves with spare candy from their Switch Witch, they can ship it directly to Operation Gratitude so a sweet taste of home can be included in the troops' winter care packages. \n\nThe complete Switch Witch package is available on Amazon, and select retail shops nationwide. \n\nInteract at http://www.switch-witch.com . The site includes a countdown clock to the magic Halloween swap, downloadable coloring pages, and a Switch Witch blog. Families can also share their own Switch Witch photos, ideas, and traditions on Switch Witch's Facebook page, @switch_witch on Instagram, and Pinterest/switchwitch. \n\nRob Bouley: rob@switch-witch.com \nLara Spear Riley: lara@switch-witch.com \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12960939.htm \nPRWeb.com", "source": "Wall Street Business Network"}