{"published": "2015-09-14T10:06:00Z", "media-type": "News", "title": "Macerich Earns Top Ranking In U.S. Retail Sector In 2015 From Global Real Estate Sustainability Benchmark (GRESB)", "id": "0e050fd3-1962-4969-a9a0-f348b7af7f66", "content": "SANTA MONICA, Calif., Sept. 14, 2015 /PRNewswire/ -- Macerich (NYSE: MAC) today announced that it has achieved the #1 ranking in the U.S. Retail Sector in 2015 according to scores published by Global Real Estate Sustainability Benchmark (GRESB). GRESB is a leading measure of sustainability performance for real estate portfolios around the world. \"Macerich is fully committed to environmental stewardship, and this GRESB ranking is the culmination of years of focused effort and investment in sustainability,\" said Ed Coppola, President, Macerich. \"From our thoughtful and effective response to the drought in California to our powerful initiatives in renewable energy, Macerich has integrated sustainable strategies into every area of our business, which benefits the environment as well as our investors. Our program is socially responsible, operationally sound and financially disciplined.\" \n\nA top performer in GRESB's Green Star rankings for two years running (formerly ranked 4th), Macerich is well recognized for its industry leadership in sustainability. Major awards include the 2014 NAREIT Retail \"Leader in the Light,\" as well as numerous LEED® Gold certifications from the U.S. Green Building Council, and awards of excellence from various chapters of NAIOP, the Commercial Real Estate Development Association. \n\nKey results of Macerich's successful and comprehensive focus on sustainability include a 29% decrease in energy use since 2009; $26.6 million in operational cost savings from 2008 through 2014; recycling of more than 12,252 tons of waste per year; and the completion of 13 renewable energy projects with a total capacity of 10.5MW (by end of 2015) will rank Macerich in top 15 U.S. companies in terms of solar capacity. \n\nFor more information on Macerich's sustainability efforts and impacts, please view the 2014 Sustainability Report.\n\nAbout Macerich\n\nMacerich, an S&P 500 company, is a fully integrated self-managed and self-administered real estate investment trust, which focuses on the acquisition, leasing, management, development and redevelopment of regional malls throughout the United States. \n\nMacerich currently owns 55 million square feet of real estate consisting primarily of interests in 51 regional shopping centers. Macerich specializes in successful retail properties in many of the country's most attractive, densely populated markets with significant presence in the Pacific Rim, Arizona, Chicago and the Metro New York to Washington, D.C. corridor. Additional information about Macerich can be obtained from the Company's website: www.macerich.com \n\nLogo - photos.prnewswire.com/prnh/20150619/224278LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/macerich-earns-top-ranking-in-us-retail-sector-in-2015-from-global-real-estate-sustainability-benchmark-gresb-300141859.html\n\nSOURCE Macerich", "source": "TickerTech.com"}