{"published": "2015-09-23T11:42:09Z", "media-type": "News", "title": "Sky’s the limit for Rasta Rocket", "id": "cffacd78-cab7-4c8a-8805-11fe086cc897", "content": "LIVING in faraway Dubai for the last 11 years has not stopped dub poet Rasta Rocket from keeping up-to-date with things in Jamaica. \n\n\r\nThe 42-year-old airline pilot says he tunes in regularly to fiery poet Mutabaruka's Cutting Edge radio show for most of his news from 'yaad'. \n\n\r\nRasta Rocket lets his own views on the current situation in Jamaica known through Policies, his first released song. \n\n\r\nIt is among 14 songs on \n\n\r\nRasta Rocket Records Collection Volume 1. He is executive producer for the compilation album which is produced by Rory Baker. \n\n\r\nThrough sporadic visits to his homeland, Rasta Rocket (real name Ryan Gourzong) believes he is in a good position to gauge its progress. \n\n\r\n\"I come back once in a blue moon and things like the roads look better and it seems things are going on. But it's like a facelift... things are getting worse,\" he said. \n\n\r\nRasta Rocket has three songs on the collection. The others are Snakes and Night & Day. \n\n\r\nSongs by his son, rapper Kwasi Wray and daughter Karima Wray, a singer, are also featured. \n\n\r\nAfter six years as a pilot with Air Jamaica, Rasta Rocket moved to Dubai where he still works in the airline industry. Strongly influenced by early Black Uhuru, R.E.M and Nirvana, he had dabbled briefly with music before settling in the Middle East, but only recently decided to take another crack at being an artiste. \n\n\r\nThat resurgence was inspired by an impromptu performance at One Love Thursdays, a popular event for reggae lovers in Dubai. He said there is a passion for Jamaican music there. \n\n\r\n\"It has a predominantly African following... people from Sudan, Kenya really love the music. On radio it's the mainstream stuff, Shaggy, Sean Paul, but it's changing,\" he explained. \n\n\r\n-- Howard Campbell", "source": "Jamaica Observer"}