{"published": "2015-09-11T03:50:29Z", "media-type": "Blog", "title": "The New Apple TV 4 Specs: 2GB RAM, WiFi 802.11ac, No Optical Audio", "id": "73b8c5ba-ab34-470c-86f0-23b99a48e16c", "content": "RPon\nThe New Apple TV 4 Specs: 2GB RAM, WiFi 802.11ac, No Optical Audio\rBy Oliver Haslam | September 11th, 2015 Advertisements\rApple’s new fourth-generation Apple TV is so much more than the media streaming device that it replaces, and that’s mainly down to the inclusion of a full-blown App Store, allowing developers to bring apps and gaming to the big screen. Apple demoed things like shopping apps during the device’s big unveiling, but it’s clear that the main target here is gaming. Lots and lots of gaming. If there’s one thing that game developers like to know, it’s what hardware they are dealing with. Unfortunately, Apple isn’t known for sharing just what internals its devices carry, and the new Apple TV’s specifications page on apple.com is suitably sparse, but all is not lost! In a break from the norm, Apple has detailed additional information about what is inside the fourth-generation Apple TV or, at least, it has to developers. As is always the case, though, it didn’t take long for those developers to tell the world. Thank you, devs! While we already had some inklings as to what was beating at the heart of the Apple TV 4, the complete list of specifications makes for an interesting reading. On top of the Apple A8 64-bit CPU that we already knew about, it appears that Apple’s new set-top box also ships with 2GB of RAM. That’s more than the iPhone 6, for example, and should see the Apple TV perform particularly well when it comes to handling cache from video streams. Did we mention gaming? Games like RAM! Another interesting tidbit is the fact that the Apple TV still does not ship with a gigabit Ethernet port, but it has 802.11ac WiFi, meaning the new 802.11a/b/g/n/ac WiFi will be quicker than plugging a cable into the back of the thing. Apple has also removed the optical audio output from the back of the new Apple TV, meaning the only way to get sound out of the device is via HDMI – a real shame to those with more interesting home audio setups. There are HDMI doohickeys that can get around this particular problem, but when an upgrade removes a port you’re already using, that never leaves a good taste in the mouth! That said, people complained when the floppy disk and then SuperDrive was removed from Macs, too. Following is a shot of the specifications on the official Apple TV page: And here are the specifications from developer documents, revealing RAM which isn’t mentioned publicly on the main Apple TV page on Apple’s website: 64-bit A8 processor 32GB or 64GB of storage 2GB of RAM 10/100Mbps Ethernet WiFi 802.11a/b/g/n/ac 1080p resolution HDMI New Siri Remote / Apple TV Remote Thoughts? You may also like to check out: Apple TV 4 SteelSeries Gamepad Nimbus, Remote Loop; iPad Pro Logitech Keyboard Accessories Revealed You can follow us on Twitter, add us to your circle on Google+ or like our Facebook page to keep yourself updated on all the latest from Microsoft, Google, Apple and the web. Advertisements\rTweet\tSubscribe to our RSS Feed !\rRelated PostsWhich Apple 9/9 Announcement Are You Most Excited For? [Poll]Twitter Is Developing A Periscope App For Apple TV 4 [Report]New Report Reaffirms Apple’s Attempt To Focus On Gaming With Apple TV 4This Is What The Apple TV 4 UI Could Look Like With iOS 9 [Concept]Apple TV 4 Specs Revealed Ahead Of September 9 Announcement\rLike this post on Facebook\nRedmond Pie Channels\rFollow Us On Facebook\rSubscribe To RSS Feed\rFollow Us On Twitter\rSubscribe On YouTube", "source": "Redmond Pie"}