{"published": "2015-09-07T09:29:00Z", "media-type": "News", "title": "Cambridge News commented Food business owner fined for fly tipping in Barton field", "id": "d7924f87-729f-4b4d-9c43-bdd3add2288a", "content": "A man who dumped food waste in a farmer's field in Barton has been fined. \n\nAkam Hamad Abdullah, 23, of Highfields Road, Ipswich, pleaded guilty at Cambridge Magistrate's Court for failing in his duty of care to ensure that his waste was disposed of correctly under Section 34 of the Environmental Protection Act 1990. \n\nA large amount of cardboard packaging and bin liners containing food waste was traced back to Abdullah who owns a food outlet specialising in English and European food and drinks in Foxhall Road, Ipswich. \n\nSouth Cambridgeshire District Council investigators interviewed Abdullah where he admitted that the waste discovered had originated from his business in Ipswich. However, he could not give a reasonable excuse as to how it was discovered in Barton. \n  \nHe was fined £450, £440 in costs, a victim surcharge and court fees totalling £1,085. \n\nSouth Cambridgeshire District Council is reiterating the need for residents to make sure that they use authorised waste carriers, registered with the Environment Agency, to dispose of rubbish. \n\nIf you see someone in the act of fly tipping please contact the Police on 999. To report waste that has been fly tipped in South Cambridgeshire visit www.scambs.gov.uk and click on the 'Report It' button. \n\nCllr Mick Martin, South Cambridgeshire District Council's cabinet member for environmental services, said: \"Whether you have dumped rubbish yourself, or waste has been taken from your home or business, there is simply no excuse for junk being fly-tipped in the countryside. \n\n\"Clearing up fly-tipped rubbish costs us thousands of pounds each year and this is money we would rather be putting to a far better use providing positive services for local people. I hope this prosecution shows everyone that it doesn't matter if waste is dumped miles from your home, we will still make every effort to find the culprit.\"", "source": "Cambridge News"}