{"published": "2015-09-04T09:00:00Z", "media-type": "News", "title": "Epic journey to battle cruel disease", "id": "db60062c-cd21-40a5-ab3b-648d5a320bf2", "content": "A Beverley businessman is about to set off on a 720km bike ride across France to raise funds to fight the disease which claimed the life of his sister. \n\r\n\t\t\r \nRob Davies, director of Yourlink Ltd, on Annie Reed Industrial Estate, will cycle across the Pyrenees from Biaritz to Argeles-sur-mer in order to raise cash for research into leukaemia and  lymphoma. \n\nDescribing himself as “a complete novice” when it comes to cycling, he has set himself a time limit of just six days for the journey in which he will ride uphill to a height of 13,000 metres. \n\r\n\t\t\t\r \nHis late sister Alison Elliott was a top make-up artist in the film industry who died aged 47 just one week after being diagnosed with a rare form of leukaemia, and two weeks before her twins’ first birthday. \n\r\n\r\n\r\n\r \nRob said: “Alison was a loving friend, sister, daughter, mother and wife, and I wanted to try and do something epic to raise money. \n\n“She was a very well-known and respected make-up designer having worked with many film stars from the likes of Emma Thompson to Michael Douglas. The film Nanny McPhee II was dedicated to her name.” \n\nRob’s trip will take him from the Atlantic coast to the Mediterranean coast. \n\nBut he won’t be alone because he’ll be accompanied on by  the trip by work colleague Patrick Konrath, also a novice cyclist. \n\r\n\t\t\t\r \nRob added: “We’ve been training for the past six months at Beverley Leisure centre and on local roads.  Our aim is to raise as much money as possible to help fund research towards this great cause, that affects around 30,000 people per year in the UK. \n\n“Our company is funding the cost of all equipment and travel expenses running in to well over £5,000, and all donations  will go directly to the charity. \n\n“The challenge represents a huge one in more ways than one, and has required at least  nine months of training up to 70 miles per day. \n\n“It will culminate in us climbing some of the largest peaks in the world, including many of the infamous climbs seen on television in the Tour de France.” Rob’s target is to  raise £5000.  If you can donate, please visit www.justgiving.com/Dirteeze", "source": "Beverley Today"}