{"published": "2015-09-18T03:01:42Z", "media-type": "News", "title": "Pelosi, Reid scramble to avoid gov't shutdown", "id": "e9eac59e-dcdf-458b-8f45-3edc3ed0386c", "content": "Congress has until Sept. 30 to pass a spending bill \n\nBy \n\nUpdated 09/17 2015 09:24PM \n\nCopyright 2015 Cable News Network/Turner Broadcasting System, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. \n\nPresident Barack Obama met with top Democratic leaders behind closed doors at the White House Thursday as Congress scrambles to avoid a government shutdown. \n\nSpeaking to reporters outside the West Wing following the hour-and-a-half-long huddle that focused on budget negotiations, Senate Minority Leader Harry Reid announced that he, Obama and House Minority Leader Nancy Pelosi were in agreement on a short-term continuing resolution to keep the government running and allow time for negotiations on a \"meaningful\" budget. \n\nDemocrats want to keep pressure on Republicans to negotiate a broader budget deal that would remove the across-the-board forced spending cuts, known as \"sequestration,\" that are in place now. The sooner they reach a deal, the sooner domestic programs would potentially be less impacted by these budget cuts. \n\nPelosi said she felt prepared heading into budget talks focused on a deal that lifted sequestration caps in a way that domestic spending was increased at the same rate as defense spending -- \"dollar for dollar,\" as she put it. \n\nReid praised Senate Majority Leader Mitch McConnell for acknowledging that something needed to be done on caps as well as discussing a clean continuing resolution, one that addresses funding the government without adding on other provisions, such as defunding Planned Parenthood. \n\nCongress has until September 30 to pass a spending bill and avert a government shutdown. Many House Republicans say they will not vote for a bill that provides any funding for the controversial women's health organization. \n\nHouse Republican leaders are expected to soon move forward with a short-term funding bill. Separately, they would aim to pass a measure to defund Planned Parenthood through a process known as \"budget reconciliation\" that would bypass a Democratic filibuster in the Senate. \n\nBut Pelosi said she was optimistic about the chances of avoiding a shutdown. \n\n\"I'm hopeful that we're all in agreement ... that we should not have a government shutdown,\" she said. \"It's costly to the government and to the American people. So we are optimistic, we want to be cooperative, we want to negotiate in good faith.\" \n\nThe White House later released a statement, saying Hill Democrats \"would support a clean, short-term continuing resolution to provide more time to negotiate an agreement that invests in middle-class economic priorities and helps our entire economy grow.\" \n\nLater Thursday, Pelosi met with House Speaker John Boehner for roughly 20 minutes in the speaker's office to discuss next steps on funding the government. \n\n\"We're having a conversation about getting close to how we negotiate,\" Pelosi told reporters. \n\nShe didn't know when they would sit down again to get into specific details, and said they had not arrived on an overall budget level yet. \n\nPelosi said she didn't like a GOP proposal to pass a stopgap bill to fund the government through mid-December \n\n\"I'd rather have it be a shorter term (continuing resolution),\" she said. \"Why should we put it off?\"", "source": "Everything Lubbock"}