{"published": "2015-09-16T13:51:32Z", "media-type": "Blog", "title": "\"Immanuel\" -2", "id": "b3c17d1d-7e1e-4467-9238-8e36adfa2072", "content": "\"Thou hast ascended on high, Thou hast led captivity captive: Thou hast received gifts for men; yea, for the rebellious also, that the LORD God might dwell among them.\" (Psalms 68:18) Now I know that we can not prove that it is so; besides the testimony of the Bible, all that we have is the testimony of the Holy Spirit that lives inside of each and everyone of us. But don't you think that the simple fact that there is so much opposition to the name of Jesus is proof enough? Any time that I get a chance to share about this, it gives me so much pleasure, because there is so much opposition against the name of Jesus Christ; there is just something about that name! Why do you think that is? We know who is behind it, and we know why; it is called jealousy, but of whom? Many think that he rebelled when he first learned of God's plan to make man; I think that there is something to that, because he really seems to have it out for us. I watched \"Cinderella\" last night, for the third time, and the evil stepmother reminded me of just how jealous the devil is of us, and just how hard he will try to stop us from becoming the Bride of Christ. We don't realize this enough in our daily walk, but we should always be on guard against his endless ways of causing us to take our eyes off Jesus. It's not enough to cause us to stumble; no, he wants us to not get up; he wants us to \"lay naked in a field, kicking about in our own blood.\" I am reminded of a song by DA, it's called \"Safety Net\", and my favorite part in the song, is where it says, \"Shoot like a bullet till kingdom come.\" I have always picture God having one of those black powder muskets, with His powder being the Holy Spirit, as He places us in His musket and fires us off; after we propel out across the land, by the power of His Spirit, we come to rest somewhere in a field, and He finds us, picks us up, and loads us in again. Don't you ever forget that your His child! He is not going to leave you laying there, because you matter to Him; no matter what the enemy might say, your a son of the KING...  \"Therefore I, a prisoner for serving the Lord, beg you to lead a life worthy of your calling, for you have been called by God. Always be humble and gentle. Be patient with each other, making allowance for each other's faults because of your love. Make every effort to keep yourselves united in the Spirit, binding yourselves together with peace. For there is one body and one Spirit, just as you have been called to one glorious hope for the future. There is one Lord, one faith, one baptism, and one God and Father; who is over all and in all, and living through all. However; he has given each one of us a special gift through the generosity of Christ. That is why the Scriptures say, \"When he ascended to the heights, he led a crowd of captives and gave gifts to his people.\" Notice that it says \"he ascended.\" This clearly means that Christ descended to our lowly world. And the same one who descended is the one who ascended higher than the heavens, so that he might fill the entire universe with himself.\" (Ephesians 4:1-10) NLT  ", "source": "Rich and Marianne"}