{"published": "2015-09-17T07:16:20Z", "media-type": "News", "title": "Gerhard Narholz, Co-Founder of The Sonoton Music Library, Receives the Prestigious Hall Of Fame Award from the First Annual PMA Mark Awards", "id": "8a520de3-7243-4a89-9f50-f49445e47500", "content": "PRWeb \nGerhard Narholz, Co-founder and Co-owner of The Sonoton Music Library along with his wife Rotheide, was awarded the inaugural Hall of Fame Award from the Production Music Association (PMA) at their annual conference held on September 9, 2015 at the Director's Guild of America in Hollywood, CA. \n\n\"It is truly an honor to be recognized by the production music community and to win the Production Music Association Hall of Fame Award. I am happy that my son Gregor, a composer himself, could be there to accept the award on my behalf while I am in Istanbul participating in meetings of the European equivalent of the PMA,\" said Gerhard Narholz. \n   \nIn attendance to accept this prestigious Lifetime Achievement award was Mr. Narholz' son, Gregor Narholz, an accomplished and acclaimed composer in his own right, and his wife Anja, along with Elisabeth Oei, the North American Sonoton Director based in Los Angeles. Sonoton is represented in North America by Hollywood-based APM Music. \n\n\"Gerhard Narholz has been a leading trendsetter and innovator since Sonoton's founding and with his wife Heidi they have made an indelible and unique contribution to the production music industry throughout the world.  He and Sonoton truly deserve this distinction as the first winner of the Hall of Fame Award,\" expressed Adam Taylor, President of APM Music and Board Member of the PMA. \n\nGerhard Narholz was born in Austria and founded Sonoton Music in 1965 with his wife Heidi Narholz. 2015 marks the company's 50th anniversary.  Having invented the well-known and now standard \"underscore,\" along with introducing the first search program on floppy disc in 1992 among many other groundbreaking creations, Narholz continues to pioneer and push the boundaries of production music. \n\nGerhard Narholz is also a classically trained composer, arranger, and conductor in a wide array of music styles and genres. From 1970-1980 he also had a successful career as a Decca Records/Telefunken recording artist under the name Norman Candler. He has published thousands of works and may very well be one of the most published composers in the world, writing under several pseudonyms as well as his own name. \n\nHe and his wife continue to be active in the daily running of Sonoton, managing a highly efficient and motivated team of professionals in the company's technology, sales, creative and logistics departments.  They travel extensively throughout the year, seeking new musical productions and liaising with their agents and representatives around the world. \n\nAbout Sonoton \n\nLocated in Munich, Germany, Sonoton has more than 35 agents worldwide and is the largest independent production music library in the world with over 2,000 albums and well over 100,000 tracks. Hundreds of composers and producers from around the world contribute their talents to the library, adding more than 80 new albums to the catalogue every year in a huge variety of musical styles. In Germany, Sonoton represents 60 international labels, and in North America, under the umbrella of APM Music, Sonoton is the largest of the APM libraries. \n\nAbout APM Music \n\nAPM Music (a joint venture of EMI Music Publishing and Universal Music Publishing), is the most comprehensive collection of original music available to entertainment and media producers, providing production clients with exclusive access to hundreds of thousands of top quality tracks of music produced specifically for use in film, television, radio, video games and new media productions. \n\nA short list of some of APM's key clients include NBC, ABC, CBC, Corus, Fox, HBO, Showtime, ESPN, MLB, PGA, Universal, Discovery, MTV, BBDO, Electronic Arts, Activision, SCEA, Ubisoft, Microsoft and thousands of others. Some of APM Music credits include: Trainwreck, Inside Out, Ant-Man, Entourage, Agent 47, Spy, Gotham, Blackish, House of Cards, Empire, Modern Family, Big Bang Theory, The Good Wife, Call of Duty: Ghosts, Saints Row: Gat out of Hell, WWE2K15, Just Dance 5, Far Cry 4, MLB: The Show 15. For more information, please visit http://www.apmmusic.com , and connect with APM at http://www.facebook.com/apmmusic and http://www.twitter.com/apmmusic . \n\nAbout the Production Music Association \n\nFounded in 1997, the Production Music Association (PMA) is the leading advocate and voice of the production music community.  A non-profit organization with over 675 members, including music publishers, composers, and industry professionals, the mission of the PMA is to elevate the unique value of production music and to ensure the viability of the production music industry. \n\nHeadquartered in both Los Angeles and Nashville, the PMA strives to fulfill its mission by: Working with performing rights organizations, legislators, legal counsel and broadcasters in the aim of improving the reporting, monitoring, collection and distribution of performance fees and royalties for PMA members; providing its members with a forum in which issues of common concern and interest can be discussed and decisions made; educating its members and the marketplace about music rights and other issues affecting the production music community; and enhancing the value of PMA members' music through research, education and public relations. \n\nFor more information about The Mark Awards, please visit: http://www.pmamusic.com/themarkawards . And, for more information about the PMA, please visit: http://pmamusic.com/ . \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12964174.htm \nPRWeb.com", "source": "Bradenton Herald"}