{"published": "2015-09-10T01:28:21Z", "media-type": "News", "title": "Rolling Stone: Donald Trump Mocked Carly Fiorina's Looks", "id": "0978cf4a-c9f5-40e0-9796-41dd24fb6e2d", "content": "For Donald Trump, the hits just keep on coming.  \n\nA Rolling Stone profile piece on the billionaire front-runner recounts an episode in which Trump mocks rival Republican candidate Carly Fiorina's looks. The alleged slight took place aboard Trump's plane following a rally in Hampton, New Hampshire. The candidate was watching Fox News as staff members looked on. Reporter Paul Solotaroff described Trump's reaction when Fiorina appeared on screen:  \n\n\" Look  at that face!\" he cries. \"Would anyone  vote  for that? Can you imagine that, the face of our next  president ?!\" The laughter grows halting and faint behind him. \"I mean, she's a woman, and I'm not s'posedta say bad things, but really, folks, come on. Are we  serious ?\"   \n\n“Would anyone vote for that? Can you imagine that, the face of our next president?!” \n \nDonald Trump \n \n\"I think those comments speak for themselves,\" Fiorina said Wednesday on Megyn Kelly's show, adding, \"Maybe, just maybe I'm getting under his skin a little bit because I am climbing in the polls.\"  \n\nIn fact, Trump had also singled out Fiorina at the Hampton rally, warning her in terms similar to those he used with moderator Kelly during the first Republican debate. \n\n\"Carly was a little nasty to me—be  careful,  Carly! Be  careful ! But I can't say anything to her because she's a woman. . . . I  promised  that I wouldn't say that she ran Hewlett-Packard into the ground. I said I wouldn't say it! That her stock value tanked. That she laid off tens of thousands of people, and she got viciously fired. I said I will not  say  that. And that she then went out and ran against Barbara  Boxer,  and . . . lost in a landslide. And I said, 'I. Will. Not. Say. That!' \" \n\nFiorina, who had strong performance in the GOP's undercard debate, lashed out at Trump over his attack on Kelly, tweeting, \"Mr. Trump: There. Is. No. Excuse.\" \n\nThe two candidates will share the stage during the second Republican debate on Sept. 17 on CNN.  ", "source": "Bloomberg"}