{"published": "2015-09-22T03:23:29Z", "media-type": "News", "title": "Quirky World ... Man elected to school board despite winning zero votes", "id": "ce02d195-c858-4a00-b1dd-0286ba652c7e", "content": "It’s not all doom and gloom as we take a look at some of the lighter news bites from around the world. \n\nUSA:  An Iowa farmer who was running unopposed for his local school board failed to earn any votes — not even his own — but he’ll probably still get the job. \n \nRandy Richardson, 42, didn’t find time to vote for himself between his full-time maintenance job at a bean processing plant in Riceville and his chores on his farm near McIntire, the Des Moines Register reported. \n \nRichardson was recruited to run by school staff, and though he said he’s “run paper thin the way it is,” he agreed because he has two kids in the district. \n \nNeighbour Jessie Miller said there wasn’t any key issue to drive her to vote in the school board race. “I would’ve voted for him!” she said. “He’s an awesome guy.” \n \nAcross the entire school district, only 36 people voted in the election. \n \nThief in Elvis wig  \n\nUSA:  Grover Beach police are searching for a man accused of robbing the Monarch Grover Winery tasting room while wearing a mask and an Elvis wig. \n \nThe Tribune in San Luis Obispo reports that the man took about $400 in cash. He showed a black pistol to an employee before binding the employee’s wrists with duct tape and confining the victim to the restroom. \n \nPolice say the robber wore an old man mask and a wig. He was last seen walking south on Highway 1. \n \nLoose snake \n\nEngland:  A 2m snake has escaped from its home, police said. The boa constrictor — known for holding its prey in a lethal grip — went missing from a home in Kells, Whitehaven, Cumbria. The snake, a household pet, escaped after being left momentarily unattended while being cleaned. \n \nGroundsman’s gaffe \n\nEngland:  A groundsman who applied the wrong type of weedkiller to the square at Henley Cricket Club has been let go, the Henley Standard reported. \n \nTony King, whose mistake in July turned a large area of the Brakspear ground brown, has not had his contract renewed. \n \nClub chairman Brian Kenworthy said: “I think sacked is too stronger term. We have agreed to go our separate ways.” \n \nA to ZE \n\nUSA:  Harvard University is starting to ask its students which gender pronouns they want to be referred by — and is adding more options to the usual ‘he’ and ‘she’. \n \nThe registration form includes gender-neutral options such as ‘ze’, and gives new options to transgender students and those who do not identify as male or female. In the past, forms required them to choose between “male” and “female”. \n \nExperts say colleges are changing as they recognise the growing population of transgender students, and many have created special campus housing for the group, but changes have sparked backlash at some schools. The University of Tennessee removed a guide to gender-neutral pronouns on its website after it drew outrage from state senators. \n\n© Irish Examiner Ltd. All rights reserved", "source": "Irish Examiner"}