{"published": "2015-09-29T21:27:15Z", "media-type": "Blog", "title": "Senate Committee Chairmen Urge Administration to Immediately Adopt Stage Two Modifications for Electronic Health Records Program, Make Rules for Stage Three Final No Sooner Than 2017", "id": "825f8a14-a066-4b25-bacd-4bb58c77cd3a", "content": "Senate Committee Chairmen Urge Administration to Immediately Adopt Stage Two Modifications for Electronic Health Records Program, Make Rules for Stage Three Final No Sooner Than 2017 \n \nChairmen Thune, Alexander make their request as a bipartisan group of 116 House members urge a “pause” in stage three rulemaking \n \nWASHINGTON, D.C. — Two Senate committee chairmen, U.S. Sens. John Thune (R-S.D.) and Lamar Alexander (R-Tenn.), urged the administration to immediately adopt stage two modifications for the federal government’s program to require doctors and hospitals to create electronic health records systems and make the rules for stage three final no sooner than January 1, 2017. \n \nThe chairmen’s call comes as a bipartisan group of 96 Republicans and 20 Democrats in the House of Representatives in a separate letter to the administration urged it to “pause” the process of making stage three rules final. \n \n“The government, doctors, and hospitals need time to do [stage three] right,” said the chairmen, and warned against moving too fast. \n \nIn a letter sent yesterday to the U.S. Department of Health and Human Services Secretary Sylvia Burwell, Thune, chairman of the Senate Committee on Commerce, Science, and Transportation and member of the Senate Finance Committee, and Alexander, chairman of the Senate Committee on Health, Education, Labor, and Pensions, wrote, “Patients need an interoperable system that enables doctors and hospitals to share their electronic health records, but the government, doctors, and hospitals need time to do it right. \n \n“To date, taxpayers have invested $30 billion to encourage electronic health records adoption. While all hospitals and most physicians met the requirements of the first stage of the meaningful use program, stage two requirements are so complex that only about 12 percent of eligible physicians and 40 percent of eligible hospitals have been able to comply. … The modified stage two rule will enable more providers to comply with the government’s requirements. It should be adopted immediately to give physicians and hospitals time to adapt to these huge changes.” \n \nThey continued, “If the department does not delay making final the stage three rules and instead proceeds before it can measure the impact of the modified stage two rule, it will be a missed opportunity to build support among providers.” \n \nThe Senate Commerce Committee has jurisdiction over the National Institute of Standards and Technology, the federal agency tasked with providing the tools needed to test health information technology to help ensure it is functioning properly before being released to the public, and the Senate Finance Committee has jurisdiction over the Centers for Medicare and Medicaid Services, which oversees the meaningful use program. The Senate Health Committee has jurisdiction over the administration’s program that certifies that health information technology has met the necessary requirements to participate in the meaningful use program. \n \nFull text of the letter can be found below: \n \nThe Honorable Sylvia Burwell \nSecretary \nU.S. Department of Health and Human Services \n200 Independence Ave, SW \nWashington, DC 20201 \n \nDear Secretary Burwell, \n \nWe write to request that the department delay until no sooner than January 1, 2017, making final rules for stage three of the meaningful use program, and then phase in stage three requirements at a rate that reflects how successfully the program is being implemented. In addition, we ask that the modified rule proposed for stage two of the program be adopted immediately. These actions will help most doctors and hospitals to comply with the government’s requirements. \n \nPatients need an interoperable system that enables doctors and hospitals to share their electronic health records, but the government, doctors, and hospitals need time to do it right.  To date, taxpayers have invested $30 billion to encourage electronic health records adoption. While all hospitals and most physicians met the requirements of the first stage of the meaningful use program, stage two requirements are so complex that only about 12 percent of eligible physicians and 40 percent of eligible hospitals have been able to comply. This year alone, 257,000 physicians have seen a 1 percent reduction in their Medicare reimbursements and 200 hospitals stand to see an even greater reduction.  The modified stage two rule will enable more providers to comply with the government’s requirements.  It should be adopted immediately to give physicians and hospitals time to adapt to these huge changes. \n \nIf the department does not delay making final the stage three rules and instead proceeds before it can measure the impact of the modified stage two rule, it will be a missed opportunity to build support among providers.  Pausing the stage three rules will also enable the department to ensure its final rules align with the new payment models created by the Medicare Access and CHIP Reauthorization Act, which created the Merit-Based Incentive Payment System. \n \nFor many years, our constituents have contacted us about their frustrations with the implementation of the meaningful use program.  We respectfully request that you delay making final the stage three rules and immediately adopt the modifications to the stage two rule.  We look forward to your response \n \nSincerely, \n \n  \n \n### \n Twitter", "source": "South Dakota War College"}