{"published": "2015-09-06T00:36:27Z", "media-type": "News", "title": "How elearning can help publishers drive engagement and revenues 31 Aug 2015", "id": "82822c9d-164e-466b-a833-988bbc465b61", "content": "In a world where online engagement with content is often fleeting, elearning platform Thought Industries are seeing engagement of 10-90 minutes for learning programmes and 5-45 minutes per single session.    \nThought Industries provide publishers with an elearning platform to leverage content and turn it into elearning experiences. Companies already using the platform include Rodale, Penton and FW Media. \n\nBarry Kelly , CEO and co-founder of Thought Industries, sees massive potential for publishers to extend their brands in the elearning – and particularly consumer learning – space. \n\nHe points to research by IBIS Capital Partners UK, which found that the global online learning market currently stands at $91 billion. “There has also been a dramatic rise in consumer learning, a new segment of online learning and commerce where individuals are turning to trusted brands and media organizations to improve their lives and careers…  [And] we’re seeing the importance of merging online learning with e-commerce. Publishers have a huge opportunity to embrace cross-selling product as part of their larger learning business strategy.”  \n\nBarry will be one of near 80 international speakers at the FIPP World Congress in Toronto , Canada from 13-15 October 2015 (if you haven’t registered to attend yet, you can do it here ). Ahead of the Congress he told FIPP’s Cobus Heyl more about Thought Industries and the elearning opportunity via email. \nTell the FIPP audience a little about yourself? \nI am the CEO and one of the co-founders of Thought Industries. I have spent the majority of my career in product development in online learning, marketing and digital strategy environments.  \n\nI joined the founding team of Thought Industries about two years ago and have found it extremely rewarding to help brands and organizations leverage the power of online learning to promote and grow their businesses. \n\nI have spent the last 15 years building online learning products and businesses for many different types of organizations and am excited about the continued growth and adoption we are seeing globally. Most of all, it’s gratifying to see millions of end users learning on our platform and know it’s making at difference in their lives and careers. \nBriefly tell us about Thought Industries? \nAt Thought Industries we have created a platform that enables organizations to create and monetize a whole host of online learning experiences from online courses and webinars to on-demand video sites.   \n\nOur technology provides a comprehensive suite of enterprise-level learning delivery and monetization tools for B2C and B2B media and event organizations. Our white-label platform enables these businesses and organizations to deliver engaging, fully branded learning experiences to their audiences. From creating online courses, videos and webinars to managing an online learning business, the platform hosts a library of powerful, easy-to-use features that enable organizations to get to market quickly and cost-effectively. \n\nIn the first half of 2015, we’ve seen great momentum and helped a number of publishers and brands launch online learning sites to meet the needs of their businesses. In fact, we’ve produced digital learning sites with over 50 different brands (in both B2B and B2C markets) including thousands of online courses, classes and videos across hundreds of consumer and professional topics including Home, Parenting, Health, Fitness, Nutrition, Hobbies, Crafts, Technology, and many more.  \n\nWe are also continually releasing more and more features designed to help our clients maximize learning revenues. A couple examples (which I’ll provide more details on below) include Penton Agriculture’s new interactive platform where farmers can find all Penton Agriculture’s online continuing education. Additionally, earlier this year we worked with Rodale to launch Rodale U a platform offering paid online courses. The Transformation Challenge they launched saw quick success.  \nThought Industries' value proposition to publishers is that it allows you to leverage brand/audience relationships and content to create a learning marketplace. Tell us more about: \n1. The overall opportunity available to publishers in the realms of elearning? \n\nIn increasing numbers, people worldwide are engaging in online learning experiences to pursue their passions, improve their lives and advance their careers. According to the Ambient Insight Report , the global market for self-paced online learning will reach $53 billion by 2018.  \n\nThis new wave of curiosity has individuals turning to their favourite brands and thought leaders to gain insights and information—media organizations are very well positioned to address this market demand.  \n\nFor B2B and B2C magazine publishers and event organizations, this is an especially good time.  Not only are publishers appropriately staffed and organized to build profitable learning businesses, but the stars have aligned to make it easier than ever to take on a new learning venture.  \n\nPublishers have a great deal of rich content from magazines, events, books, and other digital products that can be easily transformed into learning products of all kinds: guides, webinars, courses, programs and more. Furthermore, there are editorial teams, authors, and contributors, or “subject-matter experts” to serve as the credible sources.  Publishers also have established marketing and distribution channels that are available to promote and offer online learning to both existing and new audiences. Above all else, they often have pre-existing loyal audiences that trust them and look to them for advice.   \n\n2. How they can leverage their existing content to create new revenue opportunities within this marketplace environment? \n\nIt’s probably far easier than you think. The following assets are examples of existing content that can be effectively transformed and repurposed into learning materials:  \nWritten materials.  These are essential. When it comes to creating a quality learning experience and having it resonate with your audience, a lot depends on what you say and the way you say it. Luckily many publishing organizations already have this at hand.   Photography.  Strong images not only establish a visual tone, but also work as powerful teaching tools.  Video. If a company doesn’t have a video budget or a studio, don’t worry. Shooting, editing and capturing video has become amazingly affordable. There are lots of ways to shoot high-quality video on a small budget.   Presentations. These can serve as powerful online learning material. Adding audio commentary in many cases can bring them to life.   Quizzes, tests and surveys. These come hand-in-hand with online learning. Some courses offer accreditation; others are simply for fun. Either way, quizzes offer a great way to recap information and make sure that learners fully grasp the concepts. \n3. What are the particular ways content can be used to deepen those relationships and, ultimately, the revenue opportunities throughout the marketing funnel?  \n\nA key ingredient in forging a deep relationship with a customer or reader is through engagement and community. Learning content can foster both. \n\nEvery piece of content published creates an interaction with your audience, an opportunity to inform and educate. It’s up to you how deep and meaningful that interaction should be. Online learning platforms such as ours allow you to build interactive learning experiences and bolster engagement using quizzes, video, discussions and more. Organizations are leveraging this strategy in both pre and post-sale scenarios with their audience and it’s having positive effect on conversion rates and increased lifetime value.  \n\nPlatforms like ours also open the door for community involvement—uniting customers and inviting them to collaborate, motivate or exchange ideas. A great example of this is RodaleU’s Prevention Course  - customers join together to get healthier. In addition to video tips and advice from the brand, the customers exchange images and lessons learned making the experience that much richer.   \nGive us some examples of publishers already working with Thought Industries, and how they work with you? \nWe work differently with each client. We have modular plans that provide options from basic training and onboarding to full-service support, migrations and online course and content creation.  \n\nEach learning business and program is customized (just like each site!) for every client depending on its business needs. \n\nWe’re currently working with many publishers worldwide who are seeing the value of online learning.   \n\nAs mentioned before, we worked with Penton Agriculture to bolster its eLearning with a new interactive platform www.pentonag.com . The Penton Agriculture team, using information provided by recognized agriculture research and extension professionals, developed their courses.  \n\nAdditionally, earlier this year we worked with Rodale to launch Rodale U . In this case, the Rodale editorial teams from Men’s Health , Prevention , Running and Bicycling provided the content for a number of Rodale U courses.  \nMetrics and data are crucial components in the development of audience relationships and business products and/or services today.  \n1. Does your platform give publishers access to the full set of data and metrics, and, if yes, what are the types of data/metrics available to them? \n\nData and analytics are critical to any business, and we provide a number of ways for our clients to access them.  We have a suite of native reports that provide detailed info on revenue, conversion funnels, site traffic, email captures, and every other critical data point you would expect.   \n\nWe also provide detailed information on engagement—how long people are spending learning or watching videos, what content is popular and what is not. We assemble a very detailed data picture on the macro elements of the business as well as the user behaviours.   \n\nIn addition to our native reports, clients can add tracking scripts to the platform to feed all types of data to third party tracking systems such as ComScore, Google Analytics, Omniture etc. We also have an events engine that will broadcast data in real-time (or nightly) to marketing databases, CRM systems or any other enterprise systems our clients need to get data to.  \n\n2. Can you give us some insight into trends so far identified through these projects? \n\nWe’re seeing a lot of really promising data showcasing the benefits of online learning.  \n\nFirst, there’s evidence that learning drives engagement. We are seeing incredible time on site metrics for those engaged in a curated learning experiences—10 to 90 minutes is the average time per learning experience with time per session ranging from 5 to 45 minutes. \n\nAdditionally, we continuously observe buying trends of learners and the connection between learning and product purchase. All evidence points to an educated and engaged user being a buying user.  \n\nWe see in our data that there is a range of 10-50% of individuals in learning experiences who are buying related products (range depends on context and product offerings). This is an enormous opportunity for publishers who want to cross-sell additional product and related goods.  \n\n3. And are there particular trends you can identify which you think will be the big drivers of business in the next 12-18 months? \n\nThere are couple of key business drivers that we’re seeing in terms of trends. First and foremost it is the overall growth in learning both from a professional and consumer standpoint.  \nAccording to IBIS Capital Partners UK, the global online learning market currently stands at $91 billion.  In 2013, 7.1 million Americans took online courses according to Online Learning Consortium.  \nThere has also been a dramatic rise in consumer learning, a new segment of online learning and commerce where individuals are turning to trusted brands and media organizations to improve their lives and careers.  \n\nNew online learning destinations have helped millions of people dive deeper into the world of home, health, fitness, crafts, the arts and much more. And it’s not just for personal pursuits, people are turning online to improve their skills and understanding of their industry, profession and careers. \n\nSecondly, we’re seeing the importance of merging online learning with e-commerce. Publishers have a huge opportunity to embrace cross-selling product as part of their larger learning business strategy. \nYou will be at the FIPP World Congress in Toronto from 13-15 October. Aside from participating in the panel and exhibiting, what are you looking forward to most at the event? \nThere are a number of things I’m looking forward at this years’ FIPP World Congress. \n\nTo start, this will be my first experience attending this particular event. I’ve participated in a number of other FIPP events (e.g. the 2015 DIS Summit), but I’m excited to attend an event of this scale with such a diverse group of magazine media executives all looking to advance and drive the industry’s innovation.   \n\nIt’s a great opportunity to hear from industry thought leaders and innovators as they discuss what’s in their future, the business strategies that are working and the problems they are facing. Of course, I’m also looking forward to the opportunity to network—both with existing clients and with potential clients who want to explore the opportunities of online learning.   \nAway from business, what are three things professional colleagues do not know about you? \nThere is not a lot of free time in my life these days, but when I’m not working I like to spend time with my wife and two young kids. I am avid musician and still love to write and record music. I live just outside Boston but grew up in Ireland and try to visit my family there as often as I can.  The good news is that we have started to do more international business, and I have been able to squeeze in a stops at home in Ireland before I travel to the other European destinations! \n\nBarry will be one of near 80 speakers at the FIPP World Congress , taking place from 13-15 October 2015 in Toronto, Canada. Some 700-800 executives from around the world are expected to attend the Congress ( register here to join them, if you haven’t yet). \n\n• See the provisional programme here \n\n• See more speakers here \n\nFor your regular fix of news, Q&As, features, in-depth reports and more, visit FIPP.com and subscribe to our newsletters for regular updates on the Congress and more from the media world. You can also follow us on Twitter | Facebook | LinkedIn | Google+ | Instagram | Pinterest | YouTube for updates.  \n \nMore like this \n \nCannes Lions Festivals CEO on key lessons from the 2015 event, and more \n \nFrom media to retailer: The Graziashop story \n \nSee how you might benefit from Business Insider’s plans for growth \n \nHearst’s Duncan Edwards: Why it’s one of the most exciting times ever to be a content publisher \n \nAxel Springer’s Hans Hamer: This is how Auto Bild stays front of the grid \n    \r\n                                               \r \r Take note: Lessons everyone in media can learn from B2B giant IDG \r Contextualized experiences, programmatic advertising, intent data and first-to-market… Michael Friedenberg, CEO of IDG Communications worldwide, the largest global tech media, data, and services company, outlines the phrases set to dominate B2B in coming years… \r \r\n                                                        1st Sep 2015\r \r MagWorld \r \r \r \r \r \r\n                                               \r \r When hackers turn media brands into tools at their disposal \r With media companies shifting their focus from print to digital, the importance of digital as a main driver of the overall financial performance grows. Unfortunately over the last couple of years we also saw an increase in attacks on the digital presences of news and media brands that shows the vulnerability of the business as a whole. No question, security should be more than ever on the agenda of media CEOs, writes Steffen Konrath , CEO of Liquid Newsroom and FIPP contributor. \r \r\n                                                        1st Sep 2015\r \r Opinion \r \r \r \r \r \r\n                                               \r \r How elearning can help publishers drive engagement and revenues \r In a world where online engagement with content is often fleeting, elearning platform Thought Industries are seeing engagement of 10-90 minutes for learning programmes and 5-45 minutes per single session.  \r \r\n                                                        31st Aug 2015\r \r MagWorld \r \r \r \r \r \r\n                                               \r \r Monetisation: How Pinterest is changing the rules \r Pinterest started in 2010 and has grown to 70 million visitors each month. From the beginning it has served as a digital catalog, inviting users (dubbed “Pinners”) to group images into endless categories. With the blessing of the platform, Pinners capitalised on sales and marketing opportunities by directing traffic to their own sites, or being paid by a brand or advertiser to promote a product or service.   \r \r\n                                                        1st Sep 2015\r \r MagWorld \r \r \r \r \r \r\n                                               \r \r Five media brands using Periscope \r Live streaming app Periscope has been one of the year’s most celebrated technology platform launches having been downloaded over 10 million times since its launch in March. \r \r\n                                                        31st Aug 2015\r \r MagWorld", "source": "FIPP"}