{"published": "2015-09-25T15:30:44Z", "media-type": "Blog", "title": "50 years later, is it time to retract a retraction by a Nobel prize-winning author?", "id": "20c5ca06-6a81-4892-a42a-070bb1be7d9d", "content": "50 years later, is it time to retract a retraction by a Nobel prize-winning author?\rwith one comment\rGeorg Wittig It’s not often that an article is retracted only to be later proven correct. But that may have happened this past summer in the chemistry literature. In July, a group of researchers recapitulated an experiment largely similar to one that Nobelist Georg Wittig had performed – and subsequently retracted — decades earlier. Their findings suggest Wittig may actually have gotten it right the first time. On July 27, Peter Chen of ETH Zurich and colleagues published an article online in the journal Angewandte Chemie International Edition that describes a new method for appending a carbon atom to an unsaturated hydrocarbon to create a three-membered ring – a useful chemical transformation known as cyclopropanation. Yet, it was not the first time researchers had reported such a process. As Chen and his colleagues note in the Israel Journal of Chemistry, Georg Wittig of the Ruprecht-Karls-Universität Heidelberg (who would go on to win the chemistry Nobel Prize in 1979) and Volker Franzen reported a similar reaction in 1960 in Angewandte Chemie, a German-language publication. But when Wittig asked student Dietlinde Krauss to replicate the findings, she “could not reproduce the 1960 results under any set of conditions,” Chen and his team wrote in the Israel Journal of Chemistry, and, in 1964: Wittig explicitly retracted the claim. That “retraction” is not a retraction per se. Authored by Krauss and Wittig, but not Franzen, it was published in a separate German-language journal called Justus Liebigs Annalen der Chemie, which subsequently was folded into the European Journal of Organic Chemistry. In that article, Krauss and Wittig write in a footnote (as translated by Google), “The findings of V. Franzen and G. Wittig … could therefore not be confirmed.” Chen characterized the 1964 article to Retraction Watch as a “repudiation.” And in a subsequent email, he wrote: If you read what Wittig writes in 1964, it is a retraction because he disavows the work explicitly. Whatever you call it, the fact remains that after 1964, the paper effectively disappeared. Chen and his team stumbled upon it as they were developing their own method for cyclopropanation. Although they were disappointed to find out they’d been scooped, Chen told Retraction Watch he was surprised to see that the 1960 paper had essentially fallen off the chemistry world’s radar. As he and his colleagues write in IJC: There have been no further publications following up the 1960 Franzen and Wittig Angewandte Chemie Communication after 1964, so definitive was the final judgment by Wittig. According to Chen, this assertion reflects the reference tool, SciFinder. According to Web of Science, the 1960 article has been cited 47 times, most recently — other than by Chen — in 1996, and only 13 times since 1970. Importantly, however, said Chen, none of these papers actually “follow up the work.” Presumably, Wittig had this tremendous reputation, that his experimentals always worked. And when he said it doesn’t work, then everybody took it at face value that it doesn’t work. How then to explain the original report? There were but two possibilities, Chen told us: Either Wittig’s co-author was “lying outright,” or the experiment had, in fact, worked the first time. Assuming the latter, the team then set about determining why it might have worked once and then not again. The reaction detailed by Chen exhibits what he calls  “sort of a weird set of conditions.” Among other things, the reaction requires a nickel catalyst at a specific concentration, and a sealed container. It isn’t possible, of course, to know what did or didn’t happen decades ago, but it seems “eminently plausible that Franzen’s experiment worked because of adventitious nickel,” Chen said. It’s not actually that hard for nickel to infiltrate a reaction, Chen noted. Catalysts often are active at very low concentrations. Nickel  is a known impurity of lithium, which is used in the reaction. It also is found in steel, and could have leached out during incubations with acid in the procedure. Even today, trace metal impurities can be remarkably hard to detect and eliminate. “Wittig was obviously a bright guy,” Chen said: He got the Nobel Prize for heaven’s sake. But he was not looking for a metal-catalyzed reaction. Chen’s team, though, was looking. So we were more primed to find this solution, which they never thought of. But it still took his team five years to hit upon the right combination of catalyst and conditions to make everything work. Since Wittig and Krauss didn’t realize the reaction needed nickel to proceed, however, they couldn’t replicate the reaction and assumed it was incorrect. John Montgomery, the Margaret and Herman Sokol Professor in Medicinal or Synthetic Chemistry at the University of Michigan, an expert in nickel chemistry, told us that this missing catalyst could certainly have foiled reproducibility efforts: The unusual nickel concentration requirements described by Chen would certainly add to irreproducibilities from batch to batch of the reagents employed at the time. I credit Franzen and Wittig for issuing the retraction since all they knew at the time was that the process could not be reproduced. And he said that such things have happened before: … you could draw parallel to the Nozaki Hiyama Kishi (NHK) coupling reaction, which is a significant named reaction originally found to be irreproducible when CrCl2 was used. But later it was found that nickel contaminants were required to promote the reaction. It is now a widely used synthetic method that routinely uses very low levels of nickel to promote catalysis. It is unfortunate that Franzen and Wittig were not able conduct trace metal analysis of their reagents to look for this type of source of the irreproducibility. So does that mean it’s time to retract the 1964 retraction? Chen doesn’t think so. The work done in the 1964 paper is not wrong; Krauss just never got the right combination. Her reports are accurate and well documented, but they never considered that the reaction could have been catalyzed. In their IJC essay, Chen and his team lay out several lessons they took from the experience: For one, don’t neglect the “old” literature in favor of more recent synopses: There are jewels buried in the literature, and it takes reading of the original, primary publications to dig them out. Also: Consider what it means to get negative results. Evidence that something does not work is no proof that it cannot work. Finally, they write: Critically question what your professors say. The education of a scientist is successful when he or she exercises reason and creativity to form an opinion despite what authority says must be true. Science is ultimately self-correcting. Hat tip: Ken Moloy Like Retraction Watch? Consider making a tax-deductible contribution to support our growth. You can also follow us on Twitter, like us on Facebook, add us to your RSS reader, and sign up on our homepage for an email every time there’s a new post. Click here to review our Comments Policy. Related Written by Jeffrey Perkel September 25th, 2015 at 11:30 am", "source": "Retraction Watch"}