{"published": "2015-09-01T06:23:32Z", "media-type": "News", "title": "WD Makes Cloud Storage More Personal (And Private)", "id": "c0048ae7-75a6-4850-9ee9-2e3b582c5ede", "content": "SOURCE WD\n\nNew My Cloud OS 3 Puts Control of Content into the Hands of Consumers with Greater Photo Sharing, Backup and Synchronization\n\nBERLIN \n\nWD's My Cloud OS 3 features an intuitive user interface delivering a rich content-sharing experience, and back-up and sync capabilities that elevate the personal cloud NAS offering while retaining the privacy and control unique to personal cloud devices physically located in the home or office.\n\n\"We know our personal cloud customers place the highest value on their personal content and enjoy the peace of mind from backing up PCs, smart phones and tablets to and centralizing content on their My Cloud systems,\" said Jim Welsh, executive vice president and general manager of Content Solutions business at WD. \"They tell us they are confident in the privacy, control and anywhere access we provide them with the My Cloud OS. Now, with My Cloud OS 3, we've made users' management of their digital lives easier than ever before.\"\n\nMy Cloud OS 3 features powerful new photo and video capabilities via two new user experiences: MyCloud.com and My Cloud Albums app. MyCloud.com provides users global access to their My Cloud via an intuitive web browser-based user interface and enables file collaboration, comprehensive access management and a photos and videos gallery view. My Cloud Albums, available for download late September on iTunes and Google Play stores, allows a My Cloud OS 3 user to send a link to a common location, or \"album\", on the My Cloud to all their friends and family.\n\nMy Cloud OS 3's new WD Sync™ feature syncs data across multiple PCs and notebooks, ensuring that important files are up to date and available to users from almost any device. The new OS also allows users to set up automatic camera-roll backup of photos from smartphones and tablets and offers a new transfer tool that enables users to easily and quickly move their files to My Cloud devices. The OS also includes Chromebook and Chromecast support.\n\nAs part of the My Cloud OS 3 launch, WD has introduced My Cloud Device SDK and My Cloud API enabling developers to build new extensions, features and capabilities within the My Cloud ecosystem of personal cloud storage devices. The My Cloud Device SDK, based on the Docker™ open platform technology, ensures developers can easily access and collaborate to create customized experiences. Partners already developing extensions and new features based on the new SDK include Plex and Milestone.\n\nIn addition to new software upgrades, WD has also introduced a new version of My Cloud Mirror personal cloud storage devices, featuring two hard drives set to Mirror Mode (RAID 1), ensuring content is stored on one drive and automatically duplicated to a second drive. My Cloud Mirror personal cloud storage includes the new features announced for My Cloud OS 3 and an improved processor and 512 MB RAM for faster file transfers and application support.\n\nAttendees of the annual IFA Consumer Electronics Unlimited show in Berlin \n\nPricing and Availability\n\nWD My Cloud OS 3 will be available at the end of the month as a free download on current My Cloud personal cloud storage devices. My Cloud devices supporting the new OS 3 include: My Cloud, My Cloud Mirror, My Cloud Expert Series EX2/EX4, My Cloud Expert Series EX2100/EX4100 and My Cloud Business Series DL2100/DL4100. Customers can also download the new WD My Cloud mobile apps, which are now available on the iTunes and Google Play stores. All WD My Cloud devices are available today in the WD store at wdstore.com and at select retailers and distributors. Access to My Cloud Device SDK and My Cloud API will be available to interested developers late September.\n\nMy Cloud Mirror will have a Manufactured Suggested Retail Price (MSRP) of 4 TB $309.99 \n\nThis news release contains forward-looking statements, including statements relating to the estimated availability later this fall of the new version of the My Cloud Mirror personal cloud storage device and the My Cloud Device SDK and My Cloud API. These forward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially from those expressed in the forward-looking statements, including but not limited to, the risks detailed from time-to-time in our Securities and Exchange Commission filings and reports, including, but not limited to, our most recent annual report on Form 10-K to which your attention is directed. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak as of the date hereof, and WD undertakes no obligation to update these forward-looking statements to reflect subsequent events or circumstances.\n\nAbout WD\n\nWD, a Western Digital company, is a long-time innovator and storage industry leader. As a storage technology pacesetter, the company produces reliable, high-performance hard disk drives and solid state drives. These drives are deployed by OEMs and integrators in desktop and mobile computers, enterprise computing systems, embedded systems and consumer electronics applications, as well as by the company in providing its own storage products. WD's leading storage devices and systems, networking products, media players and software solutions empower people around the world to easily save, store, protect, share and experience their content on multiple devices. WD was established in 1970 and is headquartered in Irvine, California \n\nWestern Digital Corp. (NASDAQ: WDC), Irvine, Calif. \n\nApps, services, and other features are subject to change based on your location, software version, device model, and third party service providers. \n\nWestern Digital, WD, My Cloud and the WD logo are registered trademarks and WD Sync is a trademark of Western Digital Technologies, Inc. in the U.S. and other countries. Other marks may be mentioned herein that belong to other companies. Pictures shown may vary from actual products. Not all products may be available in all regions of the world. As used for storage capacity, one gigabyte = one billion bytes; one terabyte = one trillion bytes. Total accessible capacity varies depending on operating environment. Photo - http://photos.prnewswire.com/prnh/20150828/262045 \n\nLogo - http://photos.prnewswire.com/prnh/20000711/WDCLOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/wd-makes-cloud-storage-more-personal-and-private-300135417.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WAFF"}