{"published": "2015-09-15T22:14:14Z", "media-type": "News", "title": "Linden cop who drove in fatal wrong-way crash will plead not guilty, lawyer says", "id": "c49ffca6-e22b-48d9-8f50-5cc4fa9731c9", "content": "Pedro Abad's lawyer added that his client's mental capacity has affected his speech and he cannot walk on his… \r \nLINDEN — The Linden police officer accused of drunk-driving in the double-fatal wrong-way crash in Staten Island will appear in court on Monday and plead not guilty to manslaughter charges, his lawyer told NJ Advance Media Tuesday. \n\nStaten Island Attorney Mario Gallucci said Pedro Abad, 27, will appear in Richmond County Supreme Court on Monday, where Gallucci expects he will be charged with two counts each of aggravated vehicular homicide and vehicular manslaughter, as well as charges of assault. \n\nGallucci said Abad will file not guilty pleas to all the charges. \n\nGallucci also discussed Abad's condition with NJ Advance Media, dispelling rumors that Abad lost limbs in the crash. He said Abad uses a wheelchair and has injuries to both legs, one arm that is disabled and a speech impediment from \"diminished mental capacity.\" \n\n\"He's going for additional surgery on his legs,\" he added. \n\nGallucci said Abad understands what is happening in his case and that he is likely depressed about all that occurred. \n\n\"He lost two good friends and a third was badly injured,\" Gallucci said. \n\nAbad has been staying with relatives in New Jersey, according to Gallucci, who has not spoken with Abad but has talked with his family. \n\nAuthorities said Abad had a blood-alcohol level of .24 percent, three times the legal limit, when he drove the wrong way on the West Shore Expressway in Staten Island and crashed head-on into a tractor-trailer, a collision that killed two passengers – fellow officer Frank Viggiano and Linden resident Joseph Rodriguez, both 28. Another city officer, Patric Kudlac, 23, was also a passenger in the car and was critically injured in the crash. \n\nLinden officials received a telephone Thursday from Staten Island prosecutors saying that Abad had been indicted, Mayor Derek Armstead confirmed Friday. \n\n\"We were expecting it,\" he said. \"It's sad. The whole series of events is sad.\" \n\nPolice Chief James Schulhafer said he was told that a warrant would be issued for Abad's arrest. \n\nThe Staten Island District Attorney's Office has declined to comment on reports of the indictment. \n\nAbad also has an unusual status with the Linden Police Department. He was removed from the city payroll in May when his sick time was exhausted. However, he remains listed as an officer with the department, carried with an unpaid status. \n\n\"Every officer is ent…", "source": "MyInforms"}