{"published": "2015-09-11T02:45:43Z", "media-type": "News", "title": "Deflategate or not, Tom Brady celebrates", "id": "cece9095-c5b4-48ea-bef8-2875a549aeb5", "content": "(CNN) -  \nIf it were up to the NFL, Tom Brady would never have stepped onto the Gillette Stadium field before Thursday night's game to roars from the crowd -- himself yelling, pumping his fist and punching the air. He wouldn't have seen his New England Patriots' latest Super Bowl banner get unfurled. And he wouldn't have taken a snap, much less hurl pass after pass downfield. \n \nBut that's exactly what happened. \n\nSome NFL fans consider Brady a cheater for the \"Deflategate\" saga, believing he had a role in the underinflation of footballs during last January's AFC Championship game. The NFL apparently did, too, citing the Wells Report's claim that it was \"more probable than not that he was at least generally aware\" of the alleged ploy when it suspended the star quarterback for four games and then fight tooth-and-nail in court to maintain that punishment. \n\nThe league lost that battle -- or at least the first round, as the NFL has appealed -- when U.S. District Judge Richard Berman issued a 40-page ruled last Thursday that the process by which Brady was punished was flawed. Berman cited what he called \"several significant legal deficiencies\" in how NFL Commissioner Roger Goodell and his office investigated the issue. \n\nThat set the stage for what happened one week later in the Patriots' home in Foxborough, Massachusetts. \n\nOver the past decade, the NFL has opened the regular season with a weeknight game hosted by the Superbowl champions. New England earned that honor beating the Seattle Seahawks 28-24 in Super Bowl XLIX, a victory sealed by upstart cornerback Malcolm Butler's last-second interception. \n\nStill, while Butler was feted, it was Brady who earned game MVP honors -- for the third time, an illustration of his excellence over the years. That's why the idea of Brady missing the first quarter of the season hurt so much. \n\nThursday night felt like a real celebration. \n\nThere were fireworks and a video presentation punctuated by music. Then the Patriots -- who'd retreated to the locker room after warmups -- rushed onto the field ahead of their contest with the Pittsburgh Steelers. \n\nAnd of course Brady -- as he has since 2001, his second season, when he led New England to its first title -- led the way.", "source": "KTXS-TV"}