{"published": "2015-09-23T15:31:29Z", "media-type": "News", "title": "Davis Cup - Andy Murray has no choice: he must withdraw from the World Tour finals", "id": "1e4f5eea-6410-4e82-ae76-6b06739fd929", "content": "He is damned if he does, and damned if he doesn’t. Andy Murray ’s thought process will be occupied by this damned problem over the next few weeks. \n\nThe announcement that Belgium will host the Davis Cup final with Great Britain on clay at the 13,000-capacity Flanders Expo in Ghent in the death throes of November was not surprising when it was announced on Wednesday morning, but the implications for Murray and what it means to British tennis are far-reaching. Both in terms of his own peace of mind, and how he is viewed by the public at large in these parts. \n\nMurray’s participation in the World Tour finals (November 15-22), is both mandatory and expected by the Association of Tennis Professionals, but then his devotion to helping his country end a 79-year wait to win the sport’s biggest team event is also essential both to him and those millions of Brits who prefer their tennis adorned by a union flag. Without Murray, the Brits are certain to founder in Flanders. \nTo play or not to play, that is the question? \nIf Murray participates at the O2 Arena, he will satisfy the needs and demands of the ATP, and he also stands to make a fortune for himself. He collects £10,000 merely for snagging a point in the group with £100,000 on offer for every win of the opening stage of the event which would include three matches against three other players from the top eight in the sport. \n\nIf he carries off the whole tournament, he would collect around £1.3m. Which sounds a lot, but is probably a level of largesse a millionaire several times over could do without. Especially when the issue of his own legacy and pressing national pride is on the line less than a week later. \n\nMurray is rightly concerned about the condition he will be in to adapt to clay if he finds himself playing a gruelling tournament on a hard court against the world’s finest in London before the sojourn to Ghent. \nFor me to play - if I was to reach the final - five (matches) in a row and then take a couple of days off, it would mean only playing for two days on the clay before the Davis Cup final starts and that wouldn't be enough for me. I need more time on the clay to let my back get used to. \nBritain’s opponents are not the toughest array of characters one could dream up in professional sport. David Goffin is the highest ranked Belgian player in the world at 15, Steve Darcis comes next at 59 and Ruben Bemelmans is number 85. \n\nBut the Belgium team could be practicing on clay for a fortnight before the final. They won't be going easy. It is their first appearance in the final for 111 years. If Murray washes up at the O2, he may only have three days to acclimatise. \nHow did Roger handle it? \nRoger Federer withdrew from last year's Tour final with Novak Djokovic complaining of a bad back before helping Switzerland overcome France in the Davis Cup final a week later, but only after he lost to Gael Monfils in straight sets on the clay of Lille. Federer also had the insurance policy of Stan Wawrinka to cover him. He won his doubles match with Wawrinka before downing Richard Gasquet in the reverse singles. \n\nThere are not too many apart from the world number three Murray who will be fancied to snare points if he isn’t ready. Kyle Edmund (101), James Ward (142), Brydan Klein (172) and Liam Broady (196) are likely to be cheerleaders. \n\nDan Evans lost both his singles matches in the semi-finals and is ranked at 258 in the world. Murray will also be expected to go again in the doubles on the Saturday with his brother Jamie. In theory, he could face 15 sets of tennis in three days in Ghent. \nThe meaning of legacy \nThe official definition of the word legacy is “something that someone has achieved that continues to exist after they stop working or die.\" All the greats in sport have one. At 28, Murray is continuing to build his, but does not have endless years. \n\nRafael Nadal and Andre Agassi are the only men to have snagged the so-called 'Golden Slam' of four Grand Slam titles, the Davis Cup and Olympic singles gold. Novak Djokovic needs a French Open, Roger Federer requires an Olympic gold and Murray is chasing Davis Cup, the Australian Open and French Open to join a very exclusive club. \n\nIs participating at the World Tour finals more important than trying to lead GB to success at the Davis Cup? Is personal joy more important than the team glory? The curious position that Murray finds himself in is that by sacrificing himself at the O2 for the greater good, he also stands to wins for himself in Ghent. \nTweet \nIn terms of legacy, lifting the Davis Cup would sit tidily alongside his Olympic gold, his US Open win of 2012 and his Wimbledon success a year later. \n\nWhether Great Britain will come as close to winning the Davis Cup in future years is a moot point. Murray’s loss to Kevin Anderson in the fourth round of the US Open was not viewed with such desolation because it gave him time to prepare for three matches in three days against Australia in the semi-finals. \nWhat will he do? \nPerhaps he will turn up to avoid a fine, and withdraw. He could cite a back injury. His decision to withdraw will not go down well with the ATP. \"We are aware of the comments made after the Davis Cup tie in Glasgow, however our expectations are that, if fully fit, Andy would compete in this year's tournament,\" said Chris Kermode, executive president of the ATP. \"Unless we hear otherwise via an official withdrawal, he is still entered to compete at the O2.\" \n\nThe bottom line is not how much Andy Murray money stands to loses by missing the World Tour - an event where his best performance is the last four - but how much he is likely to gain by winning the Davis Cup. \n\nWhat happens if Murray suffers an injury at the O2? Such a scenario is unlikely to play out well for his public persona so soon to before the Davis Cup final. \n\nView gallery \n. \nAndy Murray (R) and Jamie Murray celebrate after winning their match \n\nIt is ironic that after a year after Murray was accused of being non-patriotic by supporting a yes vote for Scottish independence, he is the standard bearer for Great British tennis. There seems no decision to be made really. He must miss the World Tour finals. It is really the obvious and only decision to be made. \nEurosport commentators - The case for and against Andy Murray playing at the O2 \n“Andy Murray seems determined to make winning the Davis Cup his main priority this year. There is a chance he may not commit to the Davis Cup again like he has this year. He will do whatever it takes to win it this year.\" Chris Bradnam , former junior and senior national tennis singles and doubles champion of Great Britain. \n\n\"I think he has to play both. He owes it the ATP Tour to play the finals, and he owes it to the public who would like to see him more than anyone else at the event on home soil,\" says Frew McMillan , former South African Davis Cup player and five-times Grand Slam doubles champion. \"I think the Davis Cup is important, but the point is he could have made it his priority three, four or five years ago and chose not to. He could have been involved a few years ago, and winning the doubles with his brother back then. \n\n\"I realise it has become very important for him this year, but he has overlooked it in the past. I sympathise because the scheduling is the basic problem. The Tour finals and the Davis Cup final are too close together.\" \n\nRead the original article on Eurosport: Andy Murray has no choice: he must withdraw from the World Tour finals \n\nView gallery \n. Sports & Recreation Tennis Andy Murray World Tour finals Davis Cup", "source": "Yahoo! Sports"}