{"published": "2015-09-10T18:04:44Z", "media-type": "News", "title": "Apple Aiming To Make iOS Central To Digital Lives", "id": "b44a71b4-0429-4733-afb9-63d13dbf08b6", "content": "Apple has claimed the pocket and the wrist, now it’s pursuing the TV screen and the work desk in an attempt to establish itself as the operating system that ties a person's digital activities together. \n\nIf there was ever any doubt about the scope of Apple’s mobile plans beyond incremental hardware innovation then tonight’s latest announcements have laid them to rest. Make no mistake, Apple is looking to be the digital companion to people; whether its on their sofas as they watch TV or displacing laptops with iPads for people at work, the event served up enough nuggets to show that its iOS-everywhere strategy is whirring into gear. \n \nThe revamped Apple TV and the iPad Pro both quicken Apple's path towards connecting with users in all facets of their lives through iOS. For example, the iPad Pro is faster than 80 per cent of the PCs that shipped in the past six months, while the graphics are faster than 90 per cent of those PCs – proof the technology giant is looking forward to a world where laptops become obsolete, giving its operating system more real estate to try and dominate. \n \nWhat was interesting about tonight was how much time Apple used on talking about Siri and apps. While its products will continue to dazzle consumers with sleek designs and decent performance, Siri will habitually learn their needs to tap even the most unconscious demands. From the iPhone to Apple TV, the personal assistant is being planted at the root of these experiences with the latest iOS 9 update handing it the ability to learn even more about the way people are using apps in order to suggest proactive recommendations. The robust changes turns the screw on the rival Google Now and Microsoft Cortana personal assistants all jockeying to convince people to trust them the most with their most personal data. \n \nAnd while Apple’s advertising offering has shied away from the limelight, the clearer view it’s products are gaining on their users represents an attractive alternative for companies looking to monetise the ubiquity of mobile. \n \n\"The iOS-everywhere strategy has one overwhelming advantage: data. With a connection to users throughout their day, Apple can gather incredible amounts of data on users and use it to improve the user experience with all their devices,” said Craig Palli, chief strategy officer at Fiksu, which works with Apple and tracks IOS usage. \n \n“That data could also let advertisers build ever more precise audiences for their messaging, allowing ads to be more relevant and timely than previously possible\". \n \nOne major area Apple hopes to become relevant is in the word of TV. Chief executive Tim Cook acknowledged the “golden age of television” that has seen channels like HBO and Netflix thrive had prompted the business to have a second stab at the content game with the introduction of Apple TV. However, he noted the lack of progress in a medium the business wants to properly pull into the mobile fold with a service built around personalised apps. \n \n“The television experience has been virtually standing still, while innovation has been thriving in the mobile space led by iPhone and iPad,” said Cook. He claimed the “future of television is apps - a marked shift on the “channels” label it has previously used – as part of a transition that sees “over 60 per cent of pay TV streaming video consumed on an Apple device through an app”. \n \nComplete with its own tvOS operating system and app store, Apple TV was pitched by the company’s executives as doing for TV what its iPhone did for a more personalised mobile experience. And combined with good connectivity along with the promise of full HD at 60 frames per second, HFR content, and adequate performance for games, that user experience could put traditional broadcasting networks in a tight spot. Its all delivered via a retooled version of the Apple TV set-top box, complete with the app store that can be loaded with bespoke TV, games and other content from third party developers. \n \n“The new Apple TV definitely puts more pressure on currently leading service providers and broadcasters,” said Konsta Hansson vice president of global operations at creative technology agency Reaktor, which redesigned HBO’s on-demand video service. \n \n“It really looks like a well designed entertainment centre.An entertainment centre is nothing new, but I’d expect Apple to bring in good UI design. How much of it is still dependent on 3rd party application developers still remains to be seen though.” \n \nChris Hassell, founder of creative agency Ralph added: \" Apple TV was what has been expected for years and I don’t understand why it’s taken them so long. Saying that I’m insanely excited about it as I use my current Apple TV every day. I imagine a BBC iPlayer app and all other broadcasters will be coming soon (seeing as all they need to do is rejig the interface of their existing iOS apps) so there will then be no reason for my TV to display anything other than the Apple TV.\" \n \nSiri was also shown as key pillar of what Apple hopes will become the TV experience of the future. Demonstrators were able to control how and what they watched with simple voice commands, including universal search functionality across iTunes, Netflix, HBO Now, Hulu and Showtime as well as the ability to bring up the weather and sports scores by simply asking score. \n \nHowever, not all industry analysts are convinced its Siri’s time to shine. “Siri hasn't taken over the phone and it won't take over the TV, either,” said Forrester analyst James McQuivey. \n \n\"For Apple TV to succeed it will have to give people what they already want on a TV: TV shows. But for that to happen, the companies that own the best shows have to give Apple those rights and from my conversations with them, Apple along with Google are the two companies that nobody wants to give that content to. The other option is to make your own content, a strategy Netflix denied it would ever do until the day that it did so. And it may be Apple's only hope to really make a dent in the world of TV content given how little content it can acquire rights to on its own.\" \n \nThen on to the iPhone, Apple’s money making machine. And it didn’t disappoint. A 12 megapixel camera, 4k video recording, the ability to take “live photos” that capture a second and half on either side of a photo being snapped to give the impression they’re moving, were just some of the flurry of updates packed into the iPhone 6S. \n \nThe standout feature, however, was 3D Touch, which for the first time allows the iPhone to recognise force, enabling shortcuts based on light or hard presses. Nokia and Samsung both kitted out their phones with haptic features a long time ago, so there’s not much new in the feature but since the user experience of the iPhone s overall better, its likely to quickly become a staple practice. \n \nDan Beasley, founder of digital agency Puzzle, said: “3D Touch was first introduced to us on the Apple Watch and it takes a bit of getting used to but it quickly becomes second nature and I expect brands to be taking full advantage over the coming weeks and months to surprise and delight users with interesting interactions that make navigating your way around their apps that much easier.” \n \nFor Apple, the changes are reflective of how mobile is no longer about a screen size, or even actually moving around: it's the operating system that ties a person's digital activities together. ", "source": "The Drum"}