{"published": "2015-09-14T17:13:43Z", "media-type": "News", "title": "Free speech event in Canada, Turks double down on oppression, Turks and Kurds fight everywhere and more: Links 1 on Sept. 14 – 2015", "id": "2e5cbbcf-f277-4e27-8f4e-0b475a7fb7db", "content": "(Before It's News)  \n\n1. Yesterday, after about 6 months of planning and work, Alexandra managed to get her Free Speech event at Parliament hill. Thanks to Victor Laszlo, we have a record of the event. \n \n[embedded content] \n \n2.  Turkish magazine raided, copies seized for mock Erdogan selfie \n \nANKARA (Reuters) – Turkish police raided a magazine early on Monday over a mocked-up “selfie” of a smiling President Tayyip Erdogan with the coffin of a soldier – an allusion to comments that families of soldiers killed by Kurdish rebels could be happy about their martyrdom. \n \nAn Istanbul prosecutor’s office banned distribution of the latest edition of Nokta magazine and ordered raids on its offices over charges of “insulting the Turkish president” and “making terrorist propaganda”, after the cover was published online, the magazine said in a statement. \n \n“Our cover that prompted the police raid may be harsh, disturbing or even cruel. (But) these are not crimes for a media institution, this is our form of speech,” the statement said. \n  \n3.  Russian Flights Over Iraq and Iran Escalate Tension With U.S. \n \n(Obama really is the best or worst ever president the US ever had. It all just depends on who’s interests he is serving and what his real ambitions are) \n \nWASHINGTON — Russia is using an air corridor over Iraq and Iran to fly military equipment and personnel to a new air hub in Syria , openly defying American efforts to block the shipments and significantly increasing tensions with Washington. \n \nAmerican officials disclosed Sunday that at least seven giant Russian Condor transport planes had taken off from a base in southern Russia during the past week to ferry equipment to Syria, all passing through Iranian and Iraqi airspace. \n \nTheir destination was an airfield south of Latakia, Syria, which could become the most significant new Russian military foothold in the Middle East in decades, American officials said. \n  \n4.  The Latest: Hungarian Police Block Key Crossing for Migrants \n \nThe latest developments as European governments rush to cope with the huge number of people moving across Europe. All times local (CET): \n \nDozens of Hungarian police have moved onto the rail line near Roszke that has been migrants’ major border crossing point, getting ready to close the remaining gap in the country’s 110-mile (177-kilometer) border fence. \n \nHundreds of migrants seeking to enter Hungary along the rail line have been halted in their tracks as engineers on a truck string barbed wire along steel fence posts. A police helicopter is hovering overhead. \n \nPolice are telling migrants to head through farm fields to Hungary’s nearest approved border crossing, a road 2 kilometers (1 mile) to the west. \n \nPolice say they plan to block the rail line itself later with a train cargo container covered with seven coils of razor wire. \n  \n5. Israeli authorities try and reopen the Temple Mount, Al Aqsa mosque area while muslims demonstrate the one contribution they ever made to international and inter-tribe diplomacy, throwing rocks. \n \n[embedded content] \n \n6. Pakistan liberates Taliban ‘no-go zones’ in Karachi \n \n(And turns it into a Pakistani no-go zone no doubt) \n \n[embedded content] \n \n7. A muslim side video of the conflicts at islam’s ‘3rd holiest site’ (for jingoistic purposes only of course) mosque. If the religion of peace ramps up conflict this harshly and this often imagine what they will do at Islam’s most sacred mosque when cranes aren’t falling on it. \n \n[embedded content] \n \nMore video of Jerusalem fights. Lots of muslim war cries in a kind of dissonant unison. \n \n[embedded content] \n \n8. Hundreds reportedly escape as Taliban storms Afghan prison \n \n[embedded content] \n \n9.  POLLING: British Public REJECTS Idea Of Letting More Migrants In, Contrasts With Media Narrative \n \n(When we speak of media narrative, have a look at the BBC radio program we posted a link to yesterday. It was so infuriating that people I spoke with had to be pushed to try and make it to the end) \n  \n\n \nMICHAL CIZEK/AFP/ \n  \nby  Raheem Kassam 14 Sep 2015 518 \n   \nOver the course of this weekend we have heard no end of left-wing politicians and media commentators taking to the airwaves to claim that the British public overwhelmingly support Britain accepting more migrants into the United Kingdom. But frankly, the polling just doesn’t reflect this. BBC anchors, Channel 4 hosts, Labour politicians and even foreign political commentators are claiming that Britons are amenable to the idea of more refugees. \n  \nThank you Richard, Victor Laszlo, Nash Montana, Liberty Dk., M., Buck and all. \n \nLastly it looks like his holiness the 14th Dalai Lama has perfectly expressed what most British people are feeling about accepting hundreds of thousands of hostile muslims into their country at their expense. \n \n\n \n( Naw not really . Just more of the usual Captain Hindsight stuff we have come to expect from religious leaders who want everyone else to pay for their moral superiority)", "source": "Before Its News"}