{"published": "2015-09-21T19:29:18Z", "media-type": "Blog", "title": "Insane Clown Posse Wins Appeal", "id": "4767b4ad-8a7b-4062-8c88-2493a1a32503", "content": "Last Thursday, the Sixth Circuit reinstated the lawsuit by ICP and certain Juggalos (the group's fans) challenging the FBI's classification of Juggalos—collectively—as a \"hybrid gang\" in its 2011 National Gang Threat Assessment. (NBC News, link to decision). More specifically, it referred to the Juggalos as a \"loosely organized non-traditional hybrid gang subset,\" which is enough of a hoot all by itself that I won't again repost my joke about it although I continue to think it was pretty good.\rWhile I pretty much agree that for the FBI to describe a group of music fans this way is, as Violent J described it at a press conference, \"flat-out ridiculous and un-American bullshit\" (FORAB), the specific legal issue on appeal was whether the plaintiffs had standing. That is, whether the district court was right to dismiss the lawsuit on the grounds that the plaintiffs had not sufficiently alleged an \"injury\" caused by the misclassification. The Sixth Circuit held that they had alleged enough to go forward.\rIt first held that they had alleged a \"reputational injury,\" citing as an example a 1987 Supreme Court case where a film distributor was held to have standing to challenge the DOJ's labeling of certain films as \"political propaganda.\" The Juggalos alleged not just that the classification made them look bad, but that the stigmatization had led to things like illegal stops (triggered by \"Juggalo symbols\"), searches, and denial of employment. This was enough to allege First Amendment and due process claims, the court held.\rThe tougher issue was probably whether the FBI action actually caused these injuries, given that they were allegedly inflicted by third parties rather than the FBI itself. That is, the Tennessee state trooper who detained and searched the lead plaintiff because he had a Juggalo symbol on his truck wasn't actually working for the FBI. But the court held the plaintiffs had done enough here, too, because they alleged that (for example) the trooper, an Army recruiter, and police who asked that a show be cancelled all cited the \"federal Juggalo designation\" as a motivating factor. They will still have to prove that really happened, of course, but the allegations were enough to get the case reinstated.\rIn other words, the Sixth Circuit did not hold that the classification was FORAB, just that ICP and the Juggalos can try to prove it was (and that it injured them).\rViolent J and Shaggy 2 Dope released a statement thanking their legal team and the ACLU of Michigan for their work on behalf of Juggalo rights. \"To all Juggalos,\" they continued, \"thank you for standing strong with us in this battle and MUCH CLOWN LOVE! WHOOP WHOOP!\"\rWhoop whoop indeed.", "source": "Lowering the Bar"}