{"published": "2015-09-13T16:25:54Z", "media-type": "Blog", "title": "Benny Jay: Don’t Feed The Dog!", "id": "849f5e93-655e-4be7-88f9-1ddabbe37c35", "content": "In the course of a year, there are special moments I anticipate for days in advance–mostly cause they involve eating. \n \nOn Christmas, for instance, my family and I eat at Chinese and Indian restaurants within one glorious 24-hour cycle. \n \nFor my dog, that special day is any day–like last Sunday–when my mom comes over for dinner. \n \nThat’s cause my mom not so discretely feeds the dog scraps of chicken while the dog burrows into her lap from under the table. \n \nMy mom’s been doing this for so many years that my dog starts salivating almost from the moment she sees my mom walking up the front steps. \n \nIn fact, I believe that when my dog sees my mom, it’s not really my mom she actually sees, but a giant scrap of chicken. \n \nA thing you should know about my mom… \n \nShe loves dogs. \n \nFor most of her adult life she and my dad had a dog. But when the last one died about ten years ago, they concluded that–pushing 80–they were too old to take in another dog. \n \nAnd they’ve been without a dog ever since. \n \n\n \nHey, ma–we all know what’s going on… \n \n  \n \nFor the longest time, I was adamant against my mom feeding scraps to the dog. \n \nI’d say things like… \n \n“Stop it, ma–you’re spoiling that dog!” \n \nOr… \n \n“C’mon, ma–we’re trying to teach that dog not to beg. You’re ruining our training!” \n \nOr… \n \n“Ma, that food’s too rich for the dog. She’s gonna get the runs!” \n \nAnd my mom would be a little like the Gilly character created by Kristen Wiig. She’d say, “sorry.” \n \nThen she’d go right back to feeding the dog scraps a few moments later. \n \nWell, time’s worn away my opposition to this not-so-discreet, under-the-table chicken-scrap feeding thing. \n \nSo when my folks came for dinner on Sunday, I pretended not to see what was happening right in front of my eyes. \n \nI mean, really–who the hell am I to complain? \n \nThe dog’s pushing 11, and my mom’s pushing 90. I say let `em enjoy this chicken-scrap feeding moment for as long as they can share it. \n \nLife is short, chicken is good. \n \nOr as someone else said about something in a similar context … \n \nI was so much older then, I’m younger than that now.", "source": "The Third City"}