{"published": "2015-09-29T14:46:39Z", "media-type": "News", "title": "Technology to crowdsource complex triggers of pediatric asthma", "id": "54002348-f444-434a-acd5-62f4e7c5e0c3", "content": "For many doctors, figuring out what caused a kid's asthma attack means opening up regional air quality databases and applying a lot of guesswork. \n \nWhile pollution from cars and other sources is known to trigger asthma in some children, there are a number of lesser-understood factors that also increase their risk - everything from viral infections, to stress, to playing soccer all day. \n\r \nA team of University of Utah researchers has received a $5.5 million grant from the National Institutes of Health's National Institute of Biomedical Imaging and Bioengineering to develop an informatics platform that will make it possible to crowdsource scientific data and, eventually, pinpoint the cause of a child's wheezing. \n\r \n\"Retail is doing this already,\" explains Julio Facelli, Ph.D., professor of biomedical informatics and an associate director at the Utah Center for Clinical and Translational Science (CCTS). \"We'll be using some of the same big data techniques but applying them to biomedical research, which is much more complex.\" \n\r \nFacelli, along with co-principal investigator Kathy Sward, Ph.D., R.N., associate professor of biomedical informatics research at the College of Nursing, is leading teams to create an Internet-based \"infrastructure\" that will enable kids with asthma, parents, doctors and researchers to feed real-time information into a comprehensive database. \n\r \n\"Pediatric asthma is complicated and we don't fully understand how to control it,\" Facelli says. \"Our system will allow researchers worldwide unprecedented access to environmental exposure and other clinically relevant data, enabling them to answer questions they didn't even know they could ask.\" \n\r \nThe grant, a component of the Pediatric Research using Integrated Sensor Monitoring Systems (or PRISMS) program from the NIH NIBIB, will run for four years. Over that time, the team of researchers - and a group of between 10 and 20 Utah families - will test personal air quality monitors and create Web-based interfaces that could form the foundation of future pediatric asthma research. \n\r \n\"All of the sudden, you'll have this massive amount of data that wasn't available to researchers before,\" she says. \"We will be able to see in near-real time what's happening to people.\" \n\r \nThe first year, researchers will focus on finding families willing to try out a series of air quality sensors and begin developing computer systems to process in real-time and integrate the new streams of information with clinical data. The second and third years will be spent refining the computer infrastructure - sensor connections and a website design—and developing other modes for inputting the data, including age-appropriate mobile apps. In the final year, the researchers plan to run a pilot study with Utah families. \n\r \n\"Technology advances have become a powerful driver in studying and understanding the start and spread of disease,\" said NIH Director Francis S. Collins, M.D., Ph.D. \"These projects will expand the toolbox available to researchers to improve our ability to characterize environmental exposures.\" \n\r \nWhen the virtual pipeline is complete, a seventh-grader carrying an air quality sensor in his backpack and his doctor could tell whether the aerosol cleaner the school janitor was spraying at class break might have sent the student to the emergency room a few hours later. \n\r \n\"Whatever happens indoors is going to contribute quite a bit to your exposure,\" says Neal Patwari, Ph.D., associate professor of electrical and computer engineering who is designing wireless sensor networks for the project. \"The devices will monitor what's going on right around you and send the data to information systems so researchers can eventually analyze it. They also may give you immediate feedback so you can take action to limit your exposure.\" \n\r \nEventually, the system will incorporate information from doctors' records, hospital emergency room visits, wearable Fitbit-like sensors, and regional air quality monitors. \n\r \nUniversity researchers say it's no accident the Utah team was selected, due to the state's uniquely variable air quality and the work already being done locally by pediatricians, researchers, engineers and even parents of kids with asthma. \n\r \nThe Utah team is part of a larger national initiative funded by the NIH to develop sensor-based health monitoring systems. The new networks may become the basis for a national data coordinating center for pediatric asthma which could eventually be made available online to the public. \n\r \nThis project will empower families to know when and how their asthma is affected. \"We want doctors to be able to say to patients: 'Based on your data, when you are exposed at this level to this pollutant, this is how you will react,'\" says Flory Nkoy, M.D., M.S., M.P.H, an associate research professor of pediatrics and investigator on the project. \n\r \nDoctors, he says, may be able to tailor recommendations - increasing medication or avoiding exposure, for example—based on the pollutants they might encounter. \n\r \n\"You can't control it if you don't know what it is.\" \n\n  Explore further:  How Twitter can help predict emergency room visits  \n  \n Provided by:  University of Utah Health Sciences", "source": "Medical Xpress"}