{"published": "2015-09-16T15:46:27Z", "media-type": "News", "title": "Noel Edmonds to face the banker for £500,000 in a special Deal or No Deal", "id": "9c0ab7fe-3601-43df-9720-7d40a33a1f5d", "content": "There was a spectacular twist in store for Noel Edmonds as he was tricked into taking his own turn in the Deal or No Deal chair to celebrate the show’s 10 th anniversary. \n \nIn nearly 3,000 shows, Noel’s only ever posed the question “Deal or no deal?”, but comedian Sarah Millican snuck up on Noel to reveal he had his own chance to beat the banker  - for an unprecedented jackpot of £500,000. \n Sarah Millican hijacks Noel’s show for the 10th anniversary (Channel 4) \n“‘To be given the chance to play the game I am so very proud to host was a great honour and one of the biggest shocks of my professional life. I hate the Banker even more now! Playing for Children’s Hospice South West – a charity very close to my heart – was the icing on our 10th birthday cake,’’ Noel said. \n \nNoel believed he was hosting a show with 22 of the most memorable past contestants, including the first person to win 1p. He said he never suspected for a moment the ball containing the name of the player would have his inside. \n \n“Just for a second, I had to think ‘Do we have someone playing called Noel?’ Then it went ‘clang’. I cracked open another ball to be sure, and that one said Noel as well. And then Sarah Millican walked out. But it was a very slow penny-drop,” he said. \n   Promoted stories    \nI'm hosting a very special @dealornodeal on Friday at 8pm on Channel 4. #Deal10 Watch @noeledmonds get pranked! \n \n— Sarah Millican (@SarahMillican75) September 15, 2015 \n \nHe said that watching 2,750 contestants still didn’t make his own turn any easier, nor did risking money that could go to charity. “I really did feel the pressure. At one point I got very, very choked up,” he admitted. \n \nNoel has had plenty of experience watching celebrities flounder under the pressure, with Joan Collins, James Corden and Louis Walsh among the famous names to appear. Olly Murs is the only person to appearance twice on the show, with combined winnings of £10.50. \n \nAs the show celebrated its tenth anniversary, Noel let us in on some secrets behind the show – like how he turned down an offer to host the TV schedule stalwart three times. \n  \nAfter 10 fab years @NoelEdmonds takes to the Crazy Chair. Don't miss it! Fri 18th Sept, 8pm, @Channel4  #dealornodeal  pic.twitter.com/wLXFsEMfKt \n \n— Deal or No Deal (@dealornodeal) September 10, 2015 \n \n“That’s how bright I am. I have to be honest, I had no idea that it would be the phenomenon that it’s turned out to be. I was originally contracted to do 66 shows, and I’ve hosted nearly 3,000,” he said. \n \nThe Swapshop favourite also revealed that the notoriously miserly banker had given away more than £40 million in the show’s 10 year history – more than any UK gameshow, including Who Wants To Be A Millionaire? \n \nNoel gushed about how lucky he was to have the show – “ten of the happiest years of my life” – as it is where he met his wife Liz, the show’s make-up artist. \n Noel Edmonds met his wife Liz Davies on the show when she was his make-up artist (Stefan Rousseau/PA) \nAnd Deal or No Deal has played matchmaker more than once. “We’ve had four or five proposals, and I believe we’ve had the same number of marriages as a result,” Noel said. \n   \n Share article  \n   \nYou’ll have to watch Sarah Millican Hijacks Deal or No Deal on 18 September at 8pm on Channel 4 to see how much Noel wins.", "source": "Cotswold Journal"}