{"published": "2015-09-08T09:00:00Z", "media-type": "News", "title": "Cambium Learning Group Announces September Conference Participation Schedule", "id": "552eb21d-873c-46e6-8b70-31a87f5816df", "content": "DALLAS, Sept.  08, 2015  (GLOBE NEWSWIRE) -- Cambium Learning® Group, a leading educational solutions and services company, today announced its participation in three investor conferences taking place in New York in September.  John Campbell, CEO, and Barbara Benson, CFO, will appear at: \n\n BMO Capital Markets 15 th Annual Back to School Education Conference \nDate:   September 10, 2015 \nFireside Chat:  1:30 p.m. and one-on-ones with investors                   Imperial Capital 2015 Global Opportunities Co­­nference \nDate:   September 17, 2015 \nPresentation Time:  8:00 a.m. 6 th Annual Craig-Hallum Alpha Select Conference \nDate:   September 17, 2015 \nPresentation Time:  2:10 p.m. and one-on-ones with investors            \nA webcast link for these sessions and the company’s latest investor presentation will be available in the Investor Relations section of the Cambium Learning Group website: www.cambiumlearning.com . \n \nAbout Cambium Learning \n \nCambium Learning ®   Group is a leading educational solutions and services company committed to helping all students reach their full potential.  Cambium Learning accomplishes this goal by providing evidence-based solutions and expert professional services to empower educators and raise the achievement levels of all students. The company is composed of four business units: Learning A–Z ( www.learninga-z.com ), ExploreLearning ®   ( www.explorelearning.com ), Kurzweil Education ™   ( www.kurzweiledu.com ), and Voyager Sopris Learning ™   ( www.voyagersopris.com ). Together, these business units provide breakthrough technology solutions for online learning and professional support; best-in-class intervention and supplemental instructional materials; gold-standard professional development and school-improvement services; valid and reliable assessments; and proven materials to support a positive and safe school environment. Cambium Learning Group, Inc.   ( ABCD ) , is based in   Dallas, Texas. For more information, visit www.cambiumlearning.com . \n Contact:  \nMedia and Investor Contact: \nBarbara Benson \nCambium Learning Group, Inc. \ninvestorrelations@cambiumlearning.com \nLHA \nJody Burfening/Carolyn Capaccio \n212.838.3777 \nccapaccio@lhai.com", "source": "Yahoo! Finance"}