{"published": "2015-09-03T14:47:47Z", "media-type": "News", "title": "FIFA reform committee strong on platitudes, short on detail", "id": "9fca672a-1136-4d4c-ac6f-9a054691b580", "content": "9:47 a.m. CDT \n \nBy Brian Homewood \n \nBERNE (Reuters) - FIFA's latest reform committee produced plenty of platitudes and precious little concrete detail after completing its first meeting in the Swiss capital on Thursday. \n \nChairman Francois Carrard said the committee had enjoyed two days of \"intense and fruitful\" discussions but failed to provide any insight as to what proposals had been discussed. \n \nThe meeting added to the sense that the whole process to clean up soccer's governing body has become bogged down in a plethora of committees and task forces and that reform fatigue is starting to creep in. \n \n\"We are not at the stage of the proposals, we have covered, studied, reviewed and exchanged opinions on all areas,\" Carrard, a former director general of the International Olympic Committee (IOC), told reporters. \n \n\"The specific proposals will be on the table at the next meeting which will be in October.\" \n \nFIFA is facing unprecedented pressure to reform following the May indictment by U.S. authorities of nine current and former soccer officials on bribery-related charges. Many had served on FIFA's executive committee or other FIFA committees. \n \nSwiss public prosecutors are also investigating the decision to award the 2018 World Cup to Russia and the 2022 tournament to Qatar, both taken at a vote in Zurich in December 2010. \n \nThe pressure prompted president Sepp Blatter to lay down his mandate on June 2, only four days after being elected for a fifth mandate. \n \nHis replacement will be elected on Feb. 26. by an extraordinary Congress which is also expected to implement meaningful reforms. \n \nFIFA already has an audit and compliance committee headed by Domenico Scala, who had drawn up his own nine-point reform program which he presented to the executive committee in July 20. \n \nThis included term limits for leading officials, publication of their salaries and a reduction of in the power of the continental confederations, which are not FIFA members. \n \nInstead of discussing Scala's reforms themselves, however, the executive committee decided to set up the new reform committee. \n \nIn a further twist, this consists of 12 members elected by the continental confederations which Scala had targeted. \n \nCarrard, who will also appoint his own five-man advisory board, denied suggestions that his committee would have vested in interests when it discussed Scala's proposals. \n \n\"I have no feeling of any fight at all; the members of the committee have, without exception, discussed every area in the most open and constructive way,\" he said. \n \n\"We had some fabulous input, very independent; there was no particular comment as to Mr Scala's presentation, which was excellent.\" \n \nCarrard said he was still deliberating on who to choose for his own committee, which could include representatives from FIFA sponsors. \n \n\"I have ongoing consultations with representatives of main official partners and sponsors. I'll have further meetings this month, this is a process which is going on for another couple of weeks.\" \n \n(Writing by Brian Homewood in Berne; editing by Justin Palmer)", "source": "1440 WNFL"}