{"published": "2015-09-18T17:42:14Z", "media-type": "News", "title": "Ricciardo states Mercedes “will fool everybody” – Motorsport.com", "id": "0f4d7e49-2749-4041-8684-e2621407c2f0", "content": "Red-colored Bull Racing’s Daniel Ricciardo has stated Mercedes could finish up “kidding everybody” within the Singapore Grand Prix following the team’s quiet showing in Friday practice.  \nNevertheless, Ricciardo was very pleased with the day’s work and stated there is “more pace” within the vehicle. \n \nThe German manufacturer had locked the top two spots in FP1, but were built with a harder amount of time in the 2nd practice, with greatest-placed Mercedes driver Lewis Hamilton only 4th fastest among talk from the team possibly battling with tyre degradation. \n \n“Hopefully we are able to carry this speed directly into tomorrow, however it won’t be simple,Inch the Russian stated. “We’ll attempt to do good to stay in exactly the same position. \n \n“We’ve got a great deal traffic in FP2, therefore we are faster than we demonstrated.” \n \n“We’ll goal for [pole], whether we’ll have it or otherwise is yet another factor. But I am certain Mercedes will fool everybody – we is going to do what we should can to obtain as far in the power grid as possible possibly get.” \n \nRicciardo’s teammate Kvyat, that had set the benchmark from the weekend so far, declined to invest in any forecasts for Saturday. \n      \nInterview by Jon Noble \n \n“I really hope this really is [Mercedes’] real pace,” he stated. “But, to tell the truth, I’m still not searching for them tomorrow. I am certain they’ll transform it up and discover a way. \n Kvyat plays lower anticipation  \n“Normally Ferrari and Williams come a little closer on Saturday, so we will have the things they bring, but we’re searching okay. \n \n“If today is really a telltale sign, we’re searching very good,Inch he stated. “I wished the vehicle could be good around here and it appears as though which will be. \n \nRicciardo themself ended the session in third, with teammate Daniil Kvyat topping the timesheets, however the Australian declined to obtain caught up. \n \n“We are able to find some good points, we must push hard for this, but I haven’t got any particular anticipation for tomorrow, it’s too soon.Inch \n \nThe post appeared first on News List Online .", "source": "NewsListOnline"}