{"published": "2015-08-27T10:14:25Z", "media-type": "Blog", "title": "Creating an Ergonomic Space (with Style)", "id": "83ac0828-50e8-4c25-9355-95e874c81540", "content": "I spend a lot of time using must-have apps, editing videos and catching up on other work, which means I spend hours in front of a computer. It also means my wrist, back and eyes can start feeling strained if I’m not sitting properly or optimizing my desk space. It’s so important to treat your body right while in front of a screen. Thanks to the sexy world of ergonomics, we now have the techniques (I’ve talked about proper desk posture here ) and the products that can make your workspace very body-friendly. But because we don’t want to sacrifice style as well, I thought I’d take today to highlight some ways to ergo up your desk top so you can prevent premature tech aches and pains. \n \n\n \nLaptop Stand – The days of desktop computers as our main squeeze are more scarce than ever. We use our laptops as our everyday computer, which tends to have us staring down at the monitor. That’s no good! A laptop stand like this Elago L3 (or even their L4) is perfect for bringing your monitor up to eye level so your neck gets a break (no pun intended). The L3 is so sleek and minimalistic so it’s barely noticeable underneath your laptop–a feature I love so the desktop can maintain an uncluttered appearance. When you use the stand, just make sure your laptop is set a distance from your eyes that keeps you from leaning into your computer, but also not strain your eyes from being too close. \n \nExternal Keyboard and Mouse - Again, because the laptop is always by our side, it’s REALLY important to use external devices if you’re in front of your computer for extended hours. Using the built-in trackpad regularly can cause severe cramping. A portable keyboard is necessary when you have your laptop raised to eye level–on a stand your arms won’t be able to maintain a 90 degree angle. A great mouse will hold your hand in a more natural position for long-term use. I’m a big fan of even using a tablet because it can act as a mouse and is excellent for my creative projects. Have a little fun with your keyboard and mouse and add a pop of color like the turquoise Topcase USB mouse or Azio HUE pink keyboard (or this rainbow light one ! WHAT!). You can also go ultra sleek with all white like the Apple Magic mouse . \n \nDesk Lamp - The position of your body and how your hands lay aren’t the only concern with your desk, lighting is important too. Screen brightness and the type of light in your office can really cause eye strain. Add a minimalistic LED light to your desk to brighten up your space and give your eyes a softer, but still brilliant light, to highlight your work. Poppin makes such fun and clean desktop items and their Limber LED Task Lamp is no different. Two tips to keep in mind when adding a lamp: set the height around 15 inches above your desktop to help the light spread evenly across your workspace, and place the lamp on the opposite side of your desk than your dominate hand so you don’t cast shadows every time you place your hand in front of the light. \n \nChair - Remember how, in my posture article , I talked about the importance of a chair that supports your back and adjusts so your feet can touch the ground? So yeah, that’s vital. It will keep you from overcorrecting your posture, leading to more strain, and eliminate any knee issues. A great chair will actually lift up so you’re close enough to the desk that your arms are at a 90 degree angle for typing, but low enough that alone or with the help of a foot stool your feet are resting flat. I tend to switch from on my bed to a comfy desk chair once I realize I’m going to be on my laptop for a prolonged period. This Malta Office Chair is white and bright and a comfy but professional option for dressing up your desk and pampering your body. \n \nBonus: If you don’t want to invest in an external mouse or keyboard and/or you do and want added support then think about getting a wrist rest to support your wrist better. It doesn’t hurt that Socksmakeover might possibly sell the CUTEST wrist rests ever. Look at this little kitty rest ! This can most definitely be a personality piece–something to think about when decorating your desk . \n \n<3 Mish \n \nThe post Creating an Ergonomic Space (with Style) appeared first on MichellePhan.com .", "source": "MichellePhan.com"}