{"published": "2015-09-30T11:00:00Z", "media-type": "News", "title": "Moody's Corporation Reaffirms Full-Year 2015 Guidance", "id": "6bbf9623-2962-45ec-aa2a-c0dbe1473061", "content": "Moody's Corporation ( NYSE:MCO ) today reaffirmed its full-year 2015 \n      guidance. Full-year 2015 EPS guidance is still in the range of $4.55 to \n      $4.65. \n\n“We are reaffirming our 2015 earnings per share guidance of $4.55 to \n      $4.65,” said Raymond McDaniel, President and Chief Executive Officer of \n      Moody’s. “We continue to see generally accessible financial market \n      conditions, as well as strong demand for many of our Moody’s Analytics \n      products. However, market volatility and subdued economic growth in some \n      regions continue to moderate fixed income activity.” \n   \nCertain components of Moody’s 2015 revenue guidance have been modified \n      to reflect the Company’s current view of business conditions. While \n      global Moody’s Investors Service (“MIS”) revenue for full-year 2015 is \n      still expected to increase in the mid-single-digit percent range, \n      non-U.S. MIS revenue is now expected to decrease in the low-single-digit \n      percent range. Additionally, while global Moody’s Analytics revenue for \n      full-year 2015 is still expected to increase in the mid-single-digit \n      percent range, professional services revenue is now expected to decrease \n      in the low-double-digit percent range. \n\nA full summary of Moody’s guidance as of September 30, 2015 is included \n      in the table at the end of this press release. Moody's outlook for 2015 \n      is based on assumptions about many macroeconomic and capital market \n      factors, including interest rates, corporate profitability and business \n      investment spending, merger and acquisition activity, consumer borrowing \n      and securitization, and the amount of debt issued. There is an important \n      degree of uncertainty surrounding these assumptions, and, if actual \n      conditions differ, Moody's results for the year may differ materially \n      from the current outlook. \n\nMoody's is holding its 2015 Investor Day conference today in New York \n      City. \n\nThe event will also be accessible through a live conference call. \n      Individuals within the U.S. and Canada can access the call by dialing \n      1-855-309-1713 toll-free. Other callers should dial 804-419-7747. Please \n      dial into the call by 8:20 a.m. Eastern Time. The participant access \n      code for the call is 43812405. \n\nA replay of the event will be available approximately one week following \n      the event on Moody’s Investor Relations website, http://ir.moodys.com , \n      until 11:59 p.m. Eastern Time, December 31, 2015. \n\nABOUT MOODY'S CORPORATION \n\nMoody's is an essential component of the global capital markets, \n      providing credit ratings, research, tools and analysis that contribute \n      to transparent and integrated financial markets. Moody’s Corporation \n      ( NYSE: MCO ) is the parent company of Moody's Investors Service, which \n      provides credit ratings and research covering debt instruments and \n      securities, and Moody's Analytics, which offers leading-edge software, \n      advisory services and research for credit and economic analysis and \n      financial risk management. The corporation, which reported revenue of \n      $3.3 billion in 2014, employs approximately 10,200 people worldwide and \n      maintains a presence in 35 countries. Further information is available \n      at www.moodys.com . \n\n“Safe Harbor” Statement under the Private Securities Litigation Reform \n      Act of 1995 \n\nCertain statements contained in this release are forward-looking \n      statements and are based on future expectations, plans and prospects for \n      Moody’s business and operations that involve a number of risks and \n      uncertainties. Moody’s outlook for 2015 and other forward-looking \n      statements in this release are made as of September 30, 2015, and the \n      Company disclaims any duty to supplement, update or revise such \n      statements on a going-forward basis, whether as a result of subsequent \n      developments, changed expectations or otherwise. In connection with the \n      “safe harbor” provisions of the Private Securities Litigation Reform Act \n      of 1995, the Company is identifying certain factors that could cause \n      actual results to differ, perhaps materially, from those indicated by \n      these forward-looking statements. Those factors, risks and uncertainties \n      include, but are not limited to, the current world-wide credit market \n      disruptions and economic slowdown, which is affecting and could continue \n      to affect the volume of debt and other securities issued in domestic \n      and/or global capital markets; other matters that could affect the \n      volume of debt and other securities issued in domestic and/or global \n      capital markets, including credit quality concerns, changes in interest \n      rates and other volatility in the financial markets; the level of merger \n      and acquisition activity in the US and abroad; the uncertain \n      effectiveness and possible collateral consequences of U.S. and foreign \n      government initiatives to respond to the current world-wide credit \n      disruptions and economic slowdown; concerns in the marketplace affecting \n      our credibility or otherwise affecting market perceptions of the \n      integrity or utility of independent agency ratings; the introduction of \n      competing products or technologies by other companies; pricing pressure \n      from competitors and/or customers; the level of success of new product \n      development and global expansion; the impact of regulation as an NRSRO, \n      the potential for new U.S., state and local legislation and regulations, \n      including provisions in the Dodd-Frank Wall Street Reform and Consumer \n      Protection Act and anticipated regulations resulting from that Act; the \n      potential for increased competition and regulation in the EU and other \n      foreign jurisdictions; exposure to litigation related to our rating \n      opinions, as well as any other litigation to which the Company may be \n      subject from time to time; provisions in the Dodd-Frank Act legislation \n      modifying the pleading standards, and EU regulations modifying the \n      liability standards, applicable to credit rating agencies in a manner \n      adverse to credit rating agencies; provisions of EU regulations imposing \n      additional procedural and substantive requirements on the pricing of \n      services; the possible loss of key employees; failures or malfunctions \n      of our operations and infrastructure; any vulnerabilities to cyber \n      threats or other cybersecurity concerns; the outcome of any review by \n      controlling tax authorities of the Company’s global tax planning \n      initiatives; the outcome of those legacy tax matters and legal \n      contingencies that relate to the Company, its predecessors and their \n      affiliated companies for which Moody’s has assumed portions of the \n      financial responsibility; the impact of mergers, acquisitions or other \n      business combinations and the ability of the Company to successfully \n      integrate acquired businesses; currency and foreign exchange volatility; \n      the levels of capital investments; a decline in the demand for credit \n      risk management tools by financial institutions; and other risk factors \n      as discussed in the Company’s annual report on Form 10-K for the year \n      ended December 31, 2014 and in other filings made by the Company from \n      time to time with the Securities and Exchange Commission. \n\n2015 Outlook \n\nMoody’s outlook for 2015 is based on assumptions about many \n      macroeconomic and capital market factors, including interest rates, \n      corporate profitability and business investment spending, merger and \n      acquisition activity, consumer borrowing and securitization, and the \n      amount of debt issued. There is an important degree of uncertainty \n      surrounding these assumptions, and, if actual conditions differ, Moody’s \n      results for the year may differ materially from the current outlook. \nFull-year 2015 Moody’s Corporation guidance MOODY'S CORPORATION Current guidance as of September 30, 2015 \nLast publicly disclosed guidance as of July 30, 2015 \nRevenue growth in the mid-single-digit percent range NC Operating expenses growth in the mid-single-digit percent range NC Depreciation & amortization Approximately $120 million NC Operating margin Approximately 43% NC Adjusted operating margin Approximately 46% NC Effective tax rate Approximately 31% - 32% NC EPS $4.55 to $4.65 NC Capital expenditures Approximately $100 - $110 million NC Free cash flow Approximately $1 billion NC Share repurchases Approximately $1 billion (subject to available cash, market \n          conditions and other ongoing capital allocation decisions) NC Full-year 2015 revenue guidance MOODY'S INVESTORS SERVICE Current guidance as of September 30, 2015 \nLast publicly disclosed guidance as of July 30, 2015 \nMIS global growth in the mid-single-digit percent range NC MIS U.S. growth in the low-double-digit percent range NC MIS Non-U.S. decrease in the low-single-digit percent range Approximately flat Corporate finance growth in the mid-single-digit percent range NC Structured finance growth in the mid-single-digit percent range NC Financial institutions growth in the low-single-digit percent range NC \nPublic, project and infrastructure finance \n\ngrowth in the low-double-digit percent range \nNC MOODY'S ANALYTICS MA global growth in the mid-single-digit percent range NC MA U.S. growth in the low-double-digit percent range NC MA Non-U.S. growth in the low-single-digit percent range NC Research, data, and analytics growth in the high-single-digit percent range NC Enterprise risk solutions growth in the mid-single-digit percent range NC Professional services decrease in the low-double-digit percent range decrease in the high-single-digit percent range NC- There is no difference between the Company's current \n          guidance and the last publicly disclosed guidance for this item. \n\n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150930005468/en/", "source": "A.M. Best"}