{"published": "2015-09-29T12:02:11Z", "media-type": "Blog", "title": "Westland Milk lifts 2016 forecast payout to $4.90-$5.30/kgMS", "id": "f52c76e4-09e9-4f6f-a557-b9d53d2c5bbc", "content": "Article – BusinessDesk Sept. 30 (BusinessDesk) – Westland Milk, which is considering job cuts to contain costs in the face of weaker dairy prices, raised its forecast milk payout to farmers for the current season, saying there are “some signs of increasing demand and …\nWestland Milk lifts 2016 forecast payout to $4.90-$5.30/kgMS By Jonathan Underhill Sept. 30 (BusinessDesk) – Westland Milk, which is considering job cuts to contain costs in the face of weaker dairy prices, raised its forecast milk payout to farmers for the current season, saying there are “some signs of increasing demand and price recovery.” The Hokitika-based company expects to pay between $4.90 and $5.30 per kilogram of milk solids for the 2015/16 year, up from an earlier forecast of between $4.60 and $5/kgMS. The operating surplus for the previous season was $4.95/kgMS before retentions of 10 cents/kgMS. Group revenue for the 2015 financial year fell 23 percent to $639 million, according to a statement on the company’s website. “The current market has shown some signs of increasing demand and price recovery,” said chief executive Rod Quin says. “I am confident that the global oversupply is being consumed. However, farmers in Europe and the US are yet to find a new level of milk production and farm profitability. There are risks that need to be considered, but also cautious optimism to balance our views of the market going forward.” Dairy product prices rose in the latest GlobalDairyTrade auction two weeks ago, climbing for a third straight auction after nearly six months of declines. The next GDT is scheduled for Oct. 6. Earlier this month, the country’s second-biggest dairy cooperative said it was reviewing staff roles throughout its operations, which was likely to result in redundancies. It declined to give an indication of the size of any cuts. Westland employs more than 350 staff, according to the Dairy Companies Association of New Zealand, and the company’s wage bill was $43.6 million in the 2014 financial year. Of that, 79 staff were on salaries of $100,000 or more. Quin said at the time that the company stripped out $15 million of costs in its latest financial year, but more was needed in response to the fall in international dairy prices. Last week Fonterra Cooperative Group raised its forecast farmgate milk price to $4.60/kgMS, from an earlier forecast of $3.85/kgMS, bringing the total projected payment to between $5 and $5.10/kgMS, including forecast earnings per share of 40 cents to 50 cents. It said a pickup in profitability in the second half of its 2015 year ended July 31 had carried into the current year. Its 2015 payout was $4.65/kgMS for fully shared-up farmers. Tatua Cooperative Dairy Co, which set its 2015 payout for its farmer suppliers at $7.10/kgMS, or $7.73/kgMS before retentions and tax, affirmed its 2015/16 guidance of $6/kgMS before retentions. (BusinessDesk) Content Sourced from scoop.co.nz\nOriginal url", "source": "Scoop Business"}