{"published": "2015-09-17T05:11:23Z", "media-type": "News", "title": "Trump leads GOP candidates in personal attacks during televised", "id": "db273f17-8728-438a-86b7-86c5a888b2f5", "content": "Photo: ROBYN BECK, Staff / AFP /    \n    \nImage 1 of / 19 \n  \nCaption \n\nClose \n      \n Image 1 of 19  \n  \nRepublican presidential hopefuls, (L-R) South Carolina Sen. Lindsay Graham, former New York Gov. George Pataki, Sen. Rick Santorum, Kentucky Sen. Rand Paul,  former Arkansas Gov. Mike Huckabee, Florida Sen. Marco Rubio, Texas Sen. Ted Cruz,  retired neurosurgeon Ben Carson, real estate magnate Donald Trump, former Florida Gov. Jeb Bush, Wisconsin Gov. Scott Walker, former CEO Carly Fiorina, Ohio Gov. John Kasich, and New Jersey Gov. Chris Christie, arrive on stage for the Republican presidential debate at the Ronald Reagan Presidential Library in Simi Valley, California on September 16, 2015. Republican presidential candidates collectively turned their sights on frontrunner Donald Trump at the party's second debate, taking aim at his lack of political experience and his sometimes abrasive style. AFP PHOTO/ ROBYN BECKROBYN BECK/AFP/ \n Photo: ROBYN BECK, Staff / AFP /        \n Image 2 of 19  \n  \nTechnicians work behind the candidate podiums before the start of the CNN Republican presidential debates at the Ronald Reagan Presidential Library and Museum Wednesday, Sept. 16, 2015 in Simi Valley, Calif. (AP Photo/Tom Stathis) \n Photo: Tom Stathis, STF / Associated Press       \n Image 3 of 19  \n  \nA technician adjusts a television camera before the start of the CNN Republican presidential debates at the Ronald Reagan Presidential Library and Museum Wednesday, Sept. 16, 2015 in Simi Valley, Calif. (AP Photo/Tom Stathis) \n Photo: Tom Stathis, STF / Associated Press       \n Image 4 of 19  \n  \nPortraits of candidates are placed on the podium in front Air Force One that flew President Reagan, ahead of today's Republican Presidential Debate at the Ronald Reagan Presidential Library in Simi Valley, California on September 16, 2015. AFP PHOTO /FREDERIC J.BROWNFREDERIC J. BROWN/AFP/ \n Photo: FREDERIC J. BROWN, Staff / AFP /        \n Image 5 of 19  \n  \nPortraits of candidates are placed on the podium in front Air Force One that flew President Reagan, ahead of today's Republican Presidential Debate at the Ronald Reagan Presidential Library in Simi Valley, California on September 16, 2015. AFP PHOTO /FREDERIC J.BROWNFREDERIC J. BROWN/AFP/ \n Photo: FREDERIC J. BROWN, Staff / AFP /        \n Image 6 of 19  \n  \nTechnicians work behind the candidate podiums before the start of the CNN Republican presidential debates at the Ronald Reagan Presidential Library and Museum Wednesday, Sept. 16, 2015 in Simi Valley, Calif. (AP Photo/Tom Stathis) \n Photo: Tom Stathis, STF / Associated Press       \n Image 7 of 19  \n  \nSIMI VALLEY, CA - SEPTEMBER 16:  Members of the media walk through the stage set up before the start of the CNN Republican Presidential Debate at the Ronald Reagan Presidential Foundation and Library on September 16, 2015 in Simi Valley, California.  Republican presidential candidates are set to square off in the CNN Republican Presidential Debate.  (Photo by Justin Sullivan/) \n Photo: Justin Sullivan, Staff /        \n Image 8 of 19  \n  \nMedia members participate in a walk-through in front Air Force One that flew President Reagan, ahead of today's Republican Presidential Debate at the Ronald Reagan Presidential Library in Simi Valley, California on September 16, 2015. AFP PHOTO /FREDERIC J.BROWNFREDERIC J. BROWN/AFP/ \n Photo: FREDERIC J. BROWN, Staff / AFP /        \n Image 9 of 19  \n  \nRepublican presidential candidates, former Florida Gov. Jeb Bush, right, and Donald Trump both speak during the CNN Republican presidential debate at the Ronald Reagan Presidential Library and Museum on Wednesday, Sept. 16, 2015, in Simi Valley, Calif. (AP Photo/Mark J. Terrill) \n Photo: Mark J. Terrill, STF / Associated Press       \n Image 10 of 19  \n  \nFrom left: George Pataki, Rick Santorum, Sen. Rand Paul and Mike Huckabee on stage at the Republican presidential debate at the Ronald Reagan Presidential Library in Simi Valley, Calif., Sept. 16, 2015. Pataki and Santorum took part in the earlier debate. (Max Whittaker/The New York Times) \n Photo: MAX WHITTAKER, STR / New York Times       \n Image 11 of 19  \n  \nRepublican presidential candidate, retired neurosurgeon Ben Carson, left, speaks as Donald Trump looks on during the CNN Republican presidential debate at the Ronald Reagan Presidential Library and Museum on Wednesday, Sept. 16, 2015, in Simi Valley, Calif. (AP Photo/Mark J. Terrill) \n Photo: Mark J. Terrill, STF / Associated Press       \n Image 12 of 19  \n  \nRepublican presidential candidate, businesswoman Carly Fiorina speaks during the CNN Republican presidential debate at the Ronald Reagan Presidential Library and Museum on Wednesday, Sept. 16, 2015, in Simi Valley, Calif. (AP Photo/Mark J. Terrill) \n Photo: Mark J. Terrill, STF / Associated Press       \n Image 13 of 19  \n  \nSIMI VALLEY, CA - SEPTEMBER 16:  Republican presidential candidates (L-R) George Pataki, U.S. Sen. Rand Paul (R-KY), Mike Huckabee, U.S. Sen. Marco Rubio (R-FL) , U.S. Sen. Ted Cruz (R-TX) and Ben Carson stand onstage during the presidential debates at the Reagan Library on September 16, 2015 in Simi Valley, California. Fifteen Republican presidential candidates are participating in the second set of Republican presidential debates.  (Photo by Sandy Huffaker/) \n Photo: Sandy Huffaker, Stringer /        \n Image 14 of 19  \n  \nRepublican presidential candidate, Sen. Ted Cruz, R-Texas, speaks during the CNN Republican presidential debate at the Ronald Reagan Presidential Library and Museum on Wednesday, Sept. 16, 2015, in Simi Valley, Calif. (AP Photo/Mark J. Terrill) \n Photo: Mark J. Terrill, STF / Associated Press       \n Image 15 of 19  \n  \nSIMI VALLEY, CA - SEPTEMBER 16:  Republican presidential candidates U.S. Sen. Marco Rubio (R-FL), U.S. Sen. Ted Cruz (R-TX) and Ben Carson take part in the presidential debates at the Reagan Library on September 16, 2015 in Simi Valley, California. Fifteen Republican presidential candidates are participating in the second set of Republican presidential debates.  (Photo by Justin Sullivan/) \n Photo: Justin Sullivan, Staff /        \n Image 16 of 19  \n  \nGov. Scott Walker of Wisconsin, right, interacts with Donald Trump, during the Republican candidates' debate at the Ronald Reagan Presidential Library in Simi Valley, Calif., Sept. 16, 2015. From left: Ben Carson, Trump, Jeb Bush and Walker. (Max Whittaker/The New York Times) \n Photo: MAX WHITTAKER, STR / New York Times       \n Image 17 of 19  \n  \nRepublican presidential hopeful Kentucky Sen. Rand Paul (L) speaks as former Arkansas Gov. Mike Huckabee looks on during the Republican Presidential Debate at the Ronald Reagan Presidential Library in Simi Valley, California, September 16, 2015. Republican presidential candidates collectively turned their sights on frontrunner Donald Trump at the party's second debate, taking aim at his lack of political experience and his sometimes abrasive style. AFP PHOTO / FREDERIC J BROWNFREDERIC J BROWN/AFP/ \n Photo: FREDERIC J BROWN, Staff / AFP /        \n Image 18 of 19  \n  \nRepublican presidential candidate Chris Christie on the debate stage at the Reagan Library in Simi Valley, Calif., on Wednesday, Sept. 16, 2015. (Robert Gauthier/Los Angeles Times/TNS) \n Photo: Robert Gauthier, MBR / McClatchy-Tribune News Service       \n Image 19 of 19  \n  \nSIMI VALLEY, CA - SEPTEMBER 16:  Republican presidential candidates, U.S. Sen. Ted Cruz (R-TX), Ben Carson, Donald Trump and Jeb Bush take part in the presidential debates at the Reagan Library on September 16, 2015 in Simi Valley, California.  Fifteen Republican presidential candidates are participating in the second set of Republican presidential debates.  (Photo by Justin Sullivan/) \n Photo: Justin Sullivan, Staff / debate \n  \nBack to Gallery \n      \nThe Republican presidential debate on Wednesday promised to be more personal, with candidates free to go directly after each other. \n \nThey did not disappoint. \n \nFrom Donald Trump’s comments about Carly Fiorina’s looks, Fiorina’s attacks on Trump’s casino failures, and Chris Christie’s frustration about their back-and-forth, the second GOP debate of the 2016 presidential election lived up to its billing, though it did not lack for substantive debate on immigration, Iran, Planned Parenthood, and host of other issues. \n   \nAs expected, Fiorina, who has been surging in the polls, did not let viewers forget about Trump’s insults about her face in a recent Rolling Stone article, though Trump has tried to walk his comments back. \n \n“I think women all over this country heard very clearly what Mr. Trump said,” Fiorina said in one of several sharp exchanges involving the billionaire real estate and reality TV entrepreneur. \n \nTrump demurred: “I think she’s got a beautiful face, and that she’s a beautiful woman.” \n \nIn a primary race where entertainment has supplanted politics, there were bound to be sparks. \n \nOnce again, all eyes were on Trump, the celebrity real estate mogul who has upended the normal kabuki dance of presidential politics and whose every pronouncement seems to make headlines. \n \nWith Trump dominating the 16-candidate field, much of the  expectations for the second Republican debate focused on how the other candidates can create a “moment” on the air. \n \nSeveral tried. After Trump questioned whether Rand Paul, sagging in the polls, should even be on the stage, the Kentucky Senator shot back, “There is a sophomoric quality that is entertaining about Mr. Trump.” \n \nThat exchange came after Fiorina, emerging as one of Trump’s most assertive critics of Trump’s temperament, described the tycoon as “a wonderful entertainer.” \n \n“What I am,” Trump responded, “far and away, greater than an entertainer, is a businessman, and that’s the kind of mindset this country needs to bring it back.” \n \nSen. Ted Cruz, R-Texas, largely stayed out of the personal exchanges. He credited Trump with forcing media attention on illegal immigration, and highlighted his staunch opposition to the Obama administration’s nuclear deal with Iran. \n \n“If I am elected president,” Cruz said, “on the very first day in office I would rip to shreds this catastrophic Iranian nuclear deal.” \n \nFormer Texas Gov. Rick Perry exited the race last week because of sagging standing in the polls. \n \nThe GOP candidates have begun to turn attention to the Lone Star State, which holds its primary on March 1. \n \nGoing into Wednesday night’s debate, a new poll of Texas Republican voters showed Cruz in third place in his home state, behind Trump and retired neurosurgeon Ben Carson. \n \nThe Crosswind Media poll showed Trump leading the field in the Lone Star State with 26 percent, followed by Ben Carson at 19 percent, and Cruz at 15 percent. Former Florida Gov. Jeb Bush, the scion of a famed Texas political family, was fourth in Texas at 9 percent. \n \nTrump has solidified his frontrunner status overall, but his competitors were battling to steal some attention. Retired neurosurgeon Ben Carson hoped to maintain his momentum, while Bush desperately triedto land some punches with only five months until the Iowa caucuses. \n \nBush questioned Trump’s temperament as a leader, on ongoing theme during the encounter. “You can’t just, you know, talk about stuff and insult leaders around the world and expect a good result,” Bush told Trump. \n \nOn a nationally televised stage before Ronald Reagan’s presidential jet, the candidate with the most at stake might have been Bush, the early leader who has raised more than $100 million in outside political money and campaign cash. \n \nBush, the establishment favorite has been ratcheting up his criticism of Trump in recent weeks, questioning the political newcomer’s conservative bona fides. \n \nBush  recounted his “conservative record” in Florida, where he said Trump’s efforts to open a casino were rebuffed. \n \n“Totally false,” Trump replied. “I can promise that if I wanted it, I would have gotten it.” \n \nIf Trump had a central debate objective, it was to show that there’s some serious presidential mettle behind his TV star showmanship. A seemingly relaxed Trump told an interviewer during a golf outing Tuesday that he was going to try to “tone it down a little bit.” \n \nBut that was apparently a piece of strategic misdirection. Trump knew going in that as the poll leader in the race, most of the attacks would be directed at him. \n \n“Mr. Trump, we don’t need an ‘Apprentice’ in the White House,” said Wisconsin Gov. Scott Walker in a reference to Trump’s reality television series. “We have one right now.” \n \nBut one of the testiest exchanges was another confrontation between Bush and Trump, who has suggested Bush’s views on immigration are softened by his Mexican-born wife. \n \nBush demanded an apology. He didn’t get it. \n \nCNN, which broadcast the debate from the Ronald Reagan Presidential Library in Simi Valley, Calif., had been promoting the debate as a Trump-Bush showdown. \n \nBut it was Fiorina - newly promoted to the main event from last month’s undercard - who most forcefully went after Trump’s top calling card: his business acumen. \n \nShe attacked him on his failed gambling casinos in Atlantic City, to which Trump responded he had still made plenty of money there. \n \nAnother sharp attack on Trump came from Louisiana Gov. Bobby Jindal, one of four candidates in an earlier debate featuring Republicans who have finished outside the top 10 in an aggregate of polls. “Let’s stop treating Donald Trump like a Republican,” Jindal said. “He believes in Donald Trump.” \n \nThe debate also featured a robust debate on Kentucky county clerk Kim Davis, who jailed for refusing a court order to issue marriage licenses to gay couples. Her cause was championed in visits by Cruz and former Arkansas governor Mike Huckabee, both vying for the support of social conservatives. \n \nOn that score, Cruz took some flak from Bush, who argued that public officials have to follow the law. “You can’t just say gays can’t get married,” Bush said. \n \nCruz also took criticism for his willingness to risk a government shutdown over federal funding for Planned Parenthood, which provides women’s health care, including abortions. Some Republican candidates, including Ohio Gov. John Kasich, described a potential government shutdown as a losing cause. \n \nSaid Cruz: “We need to stop surrendering, and start standing up for our values.” \n \nBut unlike many in the GOP field, Cruz has been loath to criticize Trump, sparing himself the sting of Trump’s return barbs. Some see it as an alliance of convenience for two candidates courting the same ultra-conservative segment of the GOP base. \n \nLeaving nothing to chance, Cruz ran television ads during and after the debate in the early primary states of Iowa, New Hampshire, South Carolina and Nevada. \n \nThe earlier debate also included Rick Santorum, Lindsey Graham, and George Pataki. Graham, recalling the days when Reagan drank with Democratic leaders to negotiate deals in Congress, promised that if he’s elected president, “We’re going to drink more.” \n  \nkevin.diaz@chron.com", "source": "San Antonio Express-News.com"}