{"published": "2015-09-29T11:42:45Z", "media-type": "News", "title": "Matt Damon Sorry for Saying Gay Actors Should Stay in Closet", "id": "0c37b53c-b9d9-4edb-91af-02b47831b76b", "content": "Matt Damon offended many when he suggested in a recent interview that gay actors should stay in the closet for the sake of their career. \n\"I think it must be really hard for actors to be out publicly,\" Damon said in a Sunday interview with The Guardian (UK) . \n\n\"But in terms of actors, I think you're a better actor the less people know about you period. And sexuality is a huge part of that. Whether you're straight or gay, people shouldn't know anything about your sexuality because that's one of the mysteries that you should be able to play.\" \n\nDamon's comments — interpreted as homophobic by many — came after he was asked about his role as Liberace's boyfriend on HBO's \"Behind the Candelabra.\" \n\n\"When Ben and I first came on the scene there were rumors that we were gay because it was two guys who wrote a script together,\" he said. \n\n\"I know. It’s just like any piece of gossip… and it put us in a weird position of having to answer, you know what I mean? Which was then really deeply offensive. I don’t want to, like [imply] it’s some sort of disease – then it’s like I’m throwing my friends under the bus. But at the time, I remember thinking and saying, Rupert Everett was openly gay and this guy – more handsome than anybody, a classically trained actor – it’s tough to make the argument that he didn’t take a hit for being out.\" \n\nIn response to Damon's comments, a wave of outrage and criticism surged forth on social media under the hashtag #Damonsplaining. The anti-Damon hashtag first came to prominence earlier this month when the actor made controversial comments about on- and off-screen diversity to African-American filmmaker Effie Brown. \n\n\"The example that Damon uses about what happened to Rupert Everett after he came out is a great one, but one he is completely misusing,\" The Daily Beast wrote in response to Damon's comments. \"What Damon should be doing, however, is using Everett as a case study for why the way gay actors are treated in Hollywood needs to change.\" \n\nDamon soon sought to clarify his comments and make amends, appearing Tuesday on \"The Ellen DeGeneres Show.\" \n\n\"I was just trying to say actors are more effective when they’re a mystery. Right?\" he told DeGeneres, Entertainment Weekly reported . \"And somebody picked it up and said I said gay actors should get back in the closet. Which is like I mean it’s stupid, but it is painful when things get said that you don’t believe.\" \n\n\r\n                © 2015 Newsmax. All rights reserved.", "source": "NewsMax.com"}