{"published": "2015-09-06T07:09:14Z", "media-type": "News", "title": "Advisory group says BofA shareholders should vote down proposal to let CEO stay chairman", "id": "0e086dd3-6734-4a88-a4f9-b1371c055a43", "content": "Two Days of Clashes Leave 35 Dead in Tajikistan  \nKazakhstan News.Net - Saturday 5th September, 2015 \n \nTajikistan security forces killed 13 militants Saturday, the government said, a day after nine police officers and 13 militants died in fighting blamed on a renegade former deputy defense  ... \n   Soyuz Arrives at Space Station with Astronauts from 3 Countries  \nKazakhstan News.Net - Friday 4th September, 2015 \n \nA Russian Soyuz spacecraft arrived Friday at the International Space Station with a three-man international crew.\nIt carried Denmark's first astronaut, Andreas Mogensen of the European Space Agency;  ... \n   At Least 10 Killed in Armed Attacks in Tajikistan US Embassy Shut  \nKazakhstan News.Net - Friday 4th September, 2015 \n \nMOSCOW -   At least eight policemen and two gunmen were killed in Tajikistan on Friday in attacks the authorities in the Central Asian nation blamed on forces loyal to the country's own deputy  ... \n   Pakistan for trade talks with Kabul minus India  \nKazakhstan News.Net - Sunday 6th September, 2015 \n \nPakistan wants to resume trade and transit talks with Afghanistan but minus India. Kabul is not ready for that. Pakistan has asked Afghanistan to resume bilateral trade talks after Kabul called off  ... \n   Boxer Vikas Krishan takes silver at Asian meet  \nKazakhstan News.Net - Saturday 5th September, 2015 \n \nIndian pugilist Vikas Krishan Yadav went down fighting to Bektemir Melikuziev of Uzbekistan in the final of the middleweight (75kg) category at the Asian Boxing Championships here on  ... \n   Iran eyes membership of Shanghai Cooperation Organisation  \nKazakhstan News.Net - Saturday 5th September, 2015 \n \nIran is eyeing full membership of the Shanghai Cooperation Organisation (SCO) since it entails mutual benefits, Iran's President Hassan Rouhani said on Saturday. The SCO is a Eurasian political,  ... \n   Nadal crashes out of US Open Djokovic Cilic advance  \nKazakhstan News.Net - Saturday 5th September, 2015 \n \nRafael Nadal was knocked out in the third round after losing a five-set thriller to Italian Fabio Fognini, while top seed Novak Djokovic and defending champion Marin Cilic advanced to the  ... \n   FIP Arena Polo European Championship kicks off in Baku  \nKazakhstan News.Net - Friday 4th September, 2015 \n \nThe first FIP Arena Polo European Championship kicked off in Baku at Elite Horse and Polo Club on Friday, the media reported. The championship running from September 4 to 12 involves 72  ... \n   Injured Winger Robben withdraws from Dutch squad  \nKazakhstan News.Net - Friday 4th September, 2015 \n \nWinger Arjen Robben and defender Bruno Martins Indi have withdrawn from the Netherlands football squad for the crucial Euro 2016 qualifier against Turkey, with Southampton defender Virgil van Dijk  ... \n   Uzbekistan wins eight medals of Asian Confederation Boxing Championships  \nUzDaily - Sunday 6th September, 2015 \n \nTashkent, Uzbekistan (UzDaily.com) -- Uzbekistan national team won eight medals of ASBC Asian Confederation Boxing Championships in Bangkok, Thailand.   ... \n   Football round-up Australia uncertain over World Cup qualifier following violence in Tajikistan  \nThe National - Sunday 6th September, 2015 \n \nFootball Federation Australia (FFA), the national football body, is monitoring the security situation in Tajikistan ahead of their Fifa World Cup qualifier in Dushanbe after 10 people were killed in  ... \n   Police in Tajikistan ex-official behind clashes surrounded  \nMiami Herald - Sunday 6th September, 2015 \n \nPolice in the Central Asian nation of Tajikistan said on Saturday that they have surrounded the area where a former official accused of plotting an attack on a police station is believed  ... \n   Uzbek president bans teaching of political science  \nThe Guardian - Sunday 6th September, 2015 \n \nUzbekistan is almost certainly an authoritarian government: the regime of President Islam Karimov, who has ruled the country since before the breakup of the Soviet Union, has imprisoned critics,  ... \n   Scenery of Yakeshi in Chinas Inner Mongolia  \nChina.org.cn - Sunday 6th September, 2015 \n \nPhoto shows the beautiful scenery in Yakeshi, north China's Inner Mongolia Autonomous Region. Yakeshi locates in the Greater Khingan Range, east of Hulun Buir Prefectural League of Inner  ... \n   13 militants killed in Tajikistan crackdown  \nThe News - Sunday 6th September, 2015 \n \nDUSHANBE, Tajikistan: Thirteen militants were killed by Tajikistan security forces on Saturday, but the rebels refused to surrender, government officials said. The crackdown followed a day of  ... \n   Tajik police ‘closing in’ on renegade general after clashes  \nGlobal Times - Sunday 6th September, 2015 \n \nPolice in Tajikistan said on Saturday they were closing in on a sacked deputy defense minister accused of ordering gun attacks around the capital Dushanbe.Nine police officers and 13  ... \n   Opinion of MPs on visit of Uzbek President to China  \nUzDaily - Saturday 5th September, 2015 \n \nTashkent, Uzbekistan (UzDaily.com) -- President of Uzbekistan Islam Karimov will pay a visit to China on 2-3 September 2015 on invitation of the President of China Xi Jinping.  ... \n   Uzbekistan U-16 cruses Qatar in friendly match  \nUzDaily - Saturday 5th September, 2015 \n \nTashkent, Uzbekistan (UzDaily.com) -- Uzbekistan U-16 claimed a 4-1 victory over Qatar in a friendly match in Doha.  Uzbekistan U-16 currently is holding a  ... \n   Shanghai University to open Uzbek language Department  \nUzDaily - Saturday 5th September, 2015 \n \nTashkent, Uzbekistan (UzDaily.com) -- The Shanghai International Studies University (SHISU) will open Department of the Uzbek language in autumn 2015, Jahon news agency reported  ... \n   Uzbekistan appoints new envoy to Pakistan  \nUzDaily - Saturday 5th September, 2015 \n \nTashkent, Uzbekistan (UzDaily.com) -- Uzbekistan appointed new Ambassador Extraordinary and Plenipotentiary of the Republic of Uzbekistan to the Islamic Republic of Pakistan, the  ...", "source": "Kazakhstan News"}