{"published": "2015-09-26T13:50:27Z", "media-type": "News", "title": "Hear Nebraska blog to curate Holland stage", "id": "62cf641a-2e13-41d2-a2e7-bebed0649b6d", "content": "Stefan Snijders \nContributor \n \nLocal web-based entertainment blog site HearNebraska.org plans to further its involvement with Omaha’s performing arts with a sponsorship in the Holland Stages concert series this October. \n \nThe Holland Stages concert event is scheduled for October 17 and is planned as an engagement for the community as celebration of the 10th anniversary for the Holland  Center in downtown Omaha. Multiple stages will feature a variety of musicians and performers on a total of 5 stages throughout the day. \n \nAaron Markley, the Hear Nebraska program manager and a UNO alumnus, said that the sponsorship combines his organization’s mission to provide a wider array of talent from the state of Nebraska to a larger scale audience coincides with the concert event. \n \nHe said the goal to promote Nebraska’s entertainment, arts and culture through journalistic channels allows the organization to publish and distribute video publication, podcasts, blogs, reviews, and other entertainment-related news articles from their web site, and showcasing artists in live performances. \n \n“We do quite a bit with events around Omaha, Lincoln and recently beyond in greater Nebraska,” Markley said. “We oftentimes partner with organizations to put on indoor and outdoor concerts, and anything from just booking bands to partnering or taking care of anything necessary to put on the event.” \n \nHear Nebraska’s involvement in these projects naturally gave incentive to the organization to curate, a performance set for the Holland Stages event. Markley said the decision to select artists Simon Joyner and the Ghosts and James Maakestad came from a desire to complement the highlighted artists. They also wanted to consider the volume levels. \n \n“Simon Joyner is quite the prominent figure in Omaha music, and a fantastic musician and songwriter. We felt that James was a good complement, he has a lot of the same sort of attributes and songwriting skills. Logistically, as far as the festival goes, I think because the stages aren’t going to be isolated, we didn’t want to book a really loud rock band,” Markley said. “we didn’t want to blow away or drown out any of the other stages.” \n \nHear Nebraska was started in 2010 as a project by UNL graduate Andrew Norman while working on his master’s degree at Michigan State University. Norman continued to form the organization with his wife Angie, as a means to bring something back to the state where he was raised. \n \nHear Nebraska now employs several full-time staff. Markley said the toughest part of their purpose is not having enough coverage or contributors. He said all too often, many journalistic organizations think a music and entertainment division can function with minimal budgets. Hear Nebraska puts more into the costs of covering live music and entertainment, he said, because that’s an important cost. \n \n“We always want to make sure whenever possible the people who work for us are compensated, because what they are doing for us is incredibly important,” he said. \n COURTESY OF HEAR NEBRASKA.COM COURTESY OF HEAR NEBRASKA", "source": "University of Nebraska at Omaha Gateway"}