{"published": "2015-09-22T16:47:59Z", "media-type": "News", "title": "Knights pull off stunning upset victory over Bruins", "id": "3ed508ab-eb09-4924-9df0-47e580b1154f", "content": "BRAMPTON—The Niagara Knights soccer team pulled off a stellar upset to beat the Sheridan Bruins, the defending national college soccer champions, by a score of 2-0 on Saturday.\r \n \n\r\n                            Niagara College were 0-10 all-time versus Sheridan heading into the contest.\r \n \n\r\n                            Making his first college start, goalkeeper Sam Robson secured the shutout.\r \n \n\r\n                            Keith Makubuya of St. Catharines converted on a setup from forwards Andy Hein and Connor Diacur of St. Catharines to open the scoring in the 18th minute.\r \n \n\r\n                            \"Keith, Andy, and Connor are all fantastic runners and their scoring sequence covered a lot of field, opening holes in the Bruins defence\" said Knights head coach Frank DeChellis. \"Their scoring play was a goal that players love to be a part of.\"\r \n \n\r\n                            The Knights sealed the victory in the 85th minute when Ife Lotanna Maduka scored his first college career goal by burying a hard earned ball generated after challenging the Sheridan keeper during a scramble.\r \n \n\r\n                            Coach DeChellis pointed to the defensive efforts of rookies Quinton Leone of Niagara Falls, Draven Stokes, Charlie Does, and veteran Andrew Currie, for the victory.\r \n \n\r\n                            The victory was so significant that it bumped the previously unranked Knights into No. 4 of the provincial college rankings.\r \n \n\r\n                            \"We have things to work on, but against Sheridan we moved the ball forward a lot more than usual,” said DeChellis. “We have been addressing getting the ball up the field during training and our players know if you are not looking to attack, you are not going to be playing.\"\r \n \n\r\n                            Up next, the Knights (1-1) host the George Brown Huskies on Thursday, Sept. 24 at 4 p.m.", "source": "Niagara This Week"}