{"published": "2015-09-29T07:06:07Z", "media-type": "News", "title": "QualiTest and DataVision Partner to Provide NFV/SDN Assurance for Customers Worldwide", "id": "31705664-856e-4dd0-9d3d-13d43ceaf8d5", "content": "FAIRFIELD, Conn., Sept. 29, 2015 (GLOBE NEWSWIRE) -- QualiTest , the world's second largest independent software testing and QA company, is joining forces with DataVision , a leading provider of SDN/NFV Consulting, Solutions And Staffing, to offer a joint solution for implementing and optimizing your SDN/NFV network elements and infrastructure testing. \n\nCombining QualiTest's testing services and DataVision's migration and implementation expertise, the partnership will provide key technology support services, including design and planning, network integration and migration, operational support and network optimization. Customers will be able to benefit from the partnership's expertise in Network Functionals Virtualization (NFV) and Software-Defined Networking (SDN), along with the utilization of DataVision's SDN Realization Roadmap, SDN Now Lifecycle Management System and QuickStart Lab. \n   \nQualiTest uses Datavision's SDN QuickStart Lab to test SDN use cases and vendor selections in real-life simulations, verifying the functionality of the hardware and software components. Utilizing comprehensive NFV automated testing methodology, QualiTest's thorough and scalable testing practice reduces the overhead associated with QA and testing of large-scale software efforts. The solutions consist of NFV Test Accelerators, including pre-defined test assets constructed from over 580 test requirements and over 6,000 test cases, and a test automation repository that includes over 1,000 test scripts to fully test MANO, NFVI and VNF. \n\nBryon Lowen, QualiTest UK's VP of Telco, said about the alliance, \"DataVision has been providing partnerships to their clients for over 20 years, and we are pleased to be joining their community. Our partnership with DataVision will ensure that we are guiding our clients towards scalable and agile networks, while reducing operational expenditures. DataVision's tools and expertise provides our clients with an established strategy and implementation of an SDN, which we utilize to ensure a successful transition to NFV and SDN.\" \n\nQualiTest and DataVision will be hosting a webinar on October 7, discussing setting up and testing your NFV ecosystem. Join them for this exciting event here ! \n\nAbout QualiTest \n\nQualiTest is the world's second largest pure play software testing and QA company. Testing and QA is all that we do! We design and deliver contextualized solutions that leverage deep industry-specific understanding with technology-specific competencies and unique testing-focused assets. QualiTest delivers results by combining customer-centric business models, critical thinking and the ability to gain a profound comprehension of customers' goals and challenges. \n\nAbout DataVision \n\nDatavision Inc. is an IT Solutions Provider for some of the biggest companies in the world and takes pride in staying in the forefront of this ever changing informational universe. Technology is always changing and our team is always changing with it to bring our clients the most up to date solutions. \n\nThe emergence of practical ways to migrate toward the \"open source\" and OpenStack- based infrastructure of SDN has been of particular interest to the IT community. Datavision has developed expertise to help our clients investigate, set up proofs of concept, and helped to migrate and transition to the new direction in networking and computing technology. \nIn addition, we provide solutions in the areas of investigating, planning, architecting, designing, developing, and technically assuring integration of a Tier 1 Telecom Provider's Managed Solutions Offer into operational deployment in both the Public and Private Sector for the past 8 years. We have deep experience in service provider and enterprise network strategy, design and realization. \nCONTACT: Amanda Johnson amandaj@qualitestgroup.com (410) 271-1724", "source": "BioSpace"}