{"published": "2015-09-21T14:06:50Z", "media-type": "News", "title": "Labo America Launches a New Life Sciences Microscope", "id": "1668576d-53a0-4355-a078-1e6b46e2f696", "content": "Labo America, a provider of innovative microscopy solutions, today announced the official launch of its new LABOMED(R) Lx 300 microscope. The Lx 300, intended for the educational and laboratory markets, will be available for distribution worldwide. \n\n\"We're very excited about the Lx 300,\" said Gautam Aggarwal, vice president of sales. \"It's an excellent addition to our high value, cutting edge microscopy line for life sciences. The Lx 300 microscope is helping us bridge the gap between performance and economics for our customers that value quality but don't care to pay high markups.\" \n\nThe Lx 300 originally emerged from a request by users for a high value classroom and pre-clinical microscope that is ideal for continued education programs. Users demanded a product with crisp optics, ergonomic features to handle a mature curriculum, and a price point that supports institutional purchases. \n\nWhen asked what makes the Lx 300 different from everything else on the market, Aggarwal pointed to the butterfly-style head that accommodates different user viewing heights, making it ideal for colleges and multi-user workstations. The Lx 300 also offers one of the best price-performance ratios, given its excellent Plan Infinity optical system, large stage, comfortable viewing angle and a highly robust stand, all at a highly affordable price. It comes with a built-in LED system that provides up to 60,000 hours of bulb life. \n\nAbout Labo America \n\nResponding to evolving needs in modern microscopy, Labo America's products emerge from its unique ability to design and manufacture high precision optical instruments. Labo America provides LABOMED(R) brand life sciences microscopes, industrial microscopes, and surgical microscopes for ENT, Dentistry, Gynecology and Ophthalmology. LABOMED(R) products strive for optical and mechanical perfection, which has made LABOMED(R) a well-recognized brand in microscopy worldwide. \n\nContact: \n\nRuchi Goel \n\nVP Corporate Communications \n\nRuchi(at)LaboAmerica(dot)com \n\nT: +1 (510) 445-1257", "source": "Stock Nod"}