{"published": "2015-09-07T18:45:07Z", "media-type": "News", "title": "Fathers Day mine fatality: technician dies in underground accident", "id": "81f7f5bc-917c-48fc-bbbd-ef2d143bb630", "content": "By Sept. 8, 2015, 4:30 a.m. \n\nFATAL ACCIDENT: Investigations are underway into the death of a 28-year-old mine technician at Newcrest’s Cadia Valley Operations on Sunday night. Photo: JUDE KEOGH \n\nPOLICE have called the death of a 28-year-old mine technician at Newcrest’s Cadia Valley Operations “a tragic thing to happen on Father’s Day.” \n\n\nInitial investigations suggest the father of two young children was working at the Ridgeway gold mine about one kilometre underground on Sunday night when he was struck by machinery and died at the scene. \n\nCanobolas Local Area Command Acting Inspector Mick White said the man, whose name has not been released, was found by a workmate. \n\nActing Inspector White said police informed the man’s family of the incident on Sunday night, shortly after it occurred about 10pm. \n\nCONDOLENCES: Acting Inspector Mick White says police are investigating the death of a 28-year-old mine technician at Newcrest’s Cadia Valley Operations on Sunday night. Photo: JUDE KEOGH  0907cadia1 \n\n“Police spoke to the family last night and I imagine they are coping as well as can be expected,” he said. \n\n“I would expect his colleagues and those who worked with him would be shaken by the incident. \n\n“Police would like to give their condolences to his family, friends and work colleagues.” \n\nA crime scene was established at Cadia and police were working with Mine Safety NSW to prepare a report for the coroner. \n\nCadia is conducting its own investigation into the incident. \n\nWork at the mine has been suspended while the investigations are underway. \n\nA spokesperson for Cadia said Newcrest was liaising with the NSW Police and NSW Mine Safety inspectorate and assisting both agencies with their inquiries.  \n\n“We extend our deepest sympathy and condolences to the family, friends and work colleagues of the deceased,” the spokesperson said. \n\n\n“Support is being provided to the family and work colleagues at this very difficult time.” \n\nThe last accident involving Cadia occurred in 2003 when a 34-year-old Blayney man was electrocuted at a Tunbridge Wells property on the Four Mile Creek Road. \n\nThe fatal accident occurred while a group of workers from various rural engineering and contracting firms were using a crane to move steel trusses away from a farm building. \n\nOne of the trusses came in contact with overhead powerlines and a 34-year-old man, who was standing on the ground guiding the trusses, was critically injured. \n\nHe was treated at the scene by paramedics but died on the way to Orange Base Hospital. \n\n A contractor also died  in 2012 after collapsing while working underground. \n\ntracey.prisk@ fairfaxmedia.com.au", "source": "Central Western Daily"}