{"published": "2015-09-10T15:11:47Z", "media-type": "News", "title": "Financial Technology Firm Changes How Personal Finances Are Handled in the Workplace", "id": "b75a3517-b61d-4023-b1fe-4f031d2ba73d", "content": "PR.com \n2015-09-10 \nCharleston, SC,  September 10, 2015 --( PR.com )-- Questis has announced the release of their service, Financial HR™: The intersection of human resources and personal finance for employees. Questis is a financial technology company “removing the burden of employee’s personal finances from HR and the workplace.” Too often, HR is encumbered with managing distractions related to personal finance, yet they do not have the time, expertise, or tools to do so. Financial HR™ gives a company the ability to help their employees while reducing the overhead cost of each employee. \n\nFinancial HR™ is a SaaS product that provides employees with actionable items for their personal finances. Once the basic steps towards financial improvement have been undertaken, credentialed advisors (holding the Certified Financial Planner™ designation) are available to provide answers to complex financial questions. Employees have a one-stop-shop for all personal financial issues, something that is normally only accessible to wealthy individuals. \n\nFinancial HR™ accomplishes three objectives. First, the HR team is no longer distracted with the personal finance issues of the employees. This frees HR to handle more pressing issues within the company for which they have been trained. Second, since personal financial issues can be very distracting at work, Financial HR reduces employee financial stress, increasing engagement, thereby increasing employee output. Finally, since HR can be held liable for financial advice, using Financial HR pulls the company out of the hot-seat because they know that Questis will handle any questions on the complex topic of personal finances. \n\nIn the American workforce, 76% of employees are living paycheck to paycheck; 31% have zero retirement savings. There is an epidemic of bad finances in the workplace. Of HR professionals, 83% said that personal finance had a negative impact on workplace performance. By offering employees guidance from CFP® professionals, Financial HR™ is improving the workplace and ultimately changing lives. \n\nAbout Questis \nQuestis - a financial technology firm - creates positive financial habits and outcomes for American workers. We provide Financial HR™, easing the burden of Human Resource professionals while strengthening the finances of their workers. Blending personalized advice, education, and leading-edge technology - backed by a science-based, academic approach to portfolio management and financial planning - Questis focuses on personal coaching to help employees handle their money so they can be engaged at the workplace. \n\nLearn more at www.myquestis.com. \n \nContact Information: \nQuestis \nAnthony Del Porto \n843-860-3069 \nContact via Email \nwww.myquestis.com \n \nRead the full story here: http://www.pr.com/press-release/636573 \n\nPress Release Distributed by PR.com", "source": "BizWire Express"}