{"published": "2015-09-10T01:05:02Z", "media-type": "News", "title": "3 easy steps to upgrade your computer to the latest operating system", "id": "6f327d6b-d0d0-421e-9c0a-da4c681bd5ee", "content": "(BPT) - When it comes to your computer it’s a PC or Apple. And, if you have a PC, your machine runs on a Microsoft operating system. \n\nSound familiar? \n\nIf it does, you’re in luck because the new Windows 10 is finally here and there are plenty of reasons to love this new operating system. “Microsoft combined the best features of Windows 7 and Windows 8,” says tech guru, Mario Armstrong. Windows 10 has been designed to offer you optimal performance on every device it runs so you can enjoy a Windows 7-like experience when using your computer or a Windows 8 experience on your mobile device. \n\nWindows 10 also offers a free personal assistant, built-in apps, increased photo and map capabilities and all the tools you need to manage your obligations with improved mail and calendar options, along with more opportunities to have some fun with movies, shows and music. \n\nSo how do you transition to Windows 10? It’s easier than you think and to help you through the process, Armstrong offers these tips: \n\n* Back it up. Whether you decide to upgrade your current computer to Windows 10 or to buy a new Windows 10 powered device, it’s always a good idea to take some time and make sure all of your important files have been backed up. Get an external hard drive and use Microsoft’s free Backup and Restore software to copy all of your files over. This way, if something goes wrong, you’ll know everything is safe and sound. \n\n* Trust it to the professionals. Upgrading can be a scary process, since it’s possible to lose files or forget to uninstall certain drivers. Create your own safety net by taking advantage of the Staples EasyTech program and a knowledgeable Staples associate will upgrade your computer to Windows 10 for free. Just call or head into a local store to make an appointment and you’ll be running Windows 10 in no time. Any device running Windows 7 or later is eligible. \n\n* Find the right device for your new operating system. Before you enact a Windows 10 upgrade, you need to figure out if you’ll be upgrading your current computer or transitioning to a new device. The good news is if your current laptop, tablet or hybrid device runs Windows 7 or Windows 8 already, it can probably handle Windows 10’s system requirements, but you should double check to make sure. If your computer barely meets the minimum requirements but runs fine, you should hold off on upgrading until you can afford a new device. Even though Windows 10 is free for most people, adding it to an older device may slow the device down. You can learn more about upgrading for free from Microsoft’s site. \n\nFor PC users, Windows 10 offers them the chance to use and enjoy their devices like never before and upgrading is easy. Simply follow Armstrong’s tips before you upgrade and visit your local Staples store for help. Then, your old companion will have a new and exciting look and feel in no time.", "source": "Tate County Democrat"}