{"published": "2015-09-27T22:14:50Z", "media-type": "News", "title": "Hundreds of thousands flood Philly for Pope Francis' final Mass", "id": "77a46cec-f09b-43fc-b4d2-c3c143d2351e", "content": "2625 \n593 44 Share This Story! \nLet friends in your social network know what you are reading about \nHundreds of thousands flood Philly for Pope Francis' final Mass \nPope Francis wrapped up his visit to Philadelphia by celebrating Mass with hundreds of thousands of participants on the Benjamin Franklin Parkway. \nPost to Facebook \nTry Another \n\nAudio CAPTCHA \n\nImage CAPTCHA \n\nHelp \n{#\n                    \n                    #} \nCancel Send \nSent! \nA link has been sent to your friend's email address. \nPosted! \nA link has been posted to your Facebook feed. \n\nJohn Bacon,\n        \n            Donna Leinwand Leger and\n        \n            Aamer Madhani, USA TODAY 4:08 p.m. MDT September 27, 2015 \nUP NEXT 03 \nDuring his final mass while in the U.S., Pope Francis stressed the importance of love, not only within your own family, but with all the families of the world. VPC \n\nPope Francis celebrates Mass to conclude the World Meeting of Families along the Benjamin Franklin Parkway in Philadelphia on Sept. 27, 2015. (Photo: Jack Gruber, USA TODAY) \n\nPHILADELPHIA — Pope Francis celebrated Mass with hundreds of thousands in the streets of the City of Brotherly Love on Sunday, closing his historic six-day visit to the U.S. where he drew big and enthusiastic crowds wherever he went. \n\nHis visit to Philadelphia, the third leg of his U.S. trip that also took him to New York and Washington, coincided with the World Meeting of Families, and Francis used his final scheduled public appearance of the trip to connect faith with family. \n\nIn his homily, Francis told the faithful that much like happiness, \"holiness is always tied to little gestures.\" \n\n\"These little gestures are those we learn at home, in the family; they get lost amid all the other things we do, yet they do make each day different,\" Francis said. \"They are the quiet things done by mothers and grandmothers, by fathers and grandfathers, by children. They are little signs of tenderness, affection and compassion.\" \n\nAt the conclusion of his Mass, Francis made one small personal request. “I ask you to pray for me,\" Francis said. \"Don’t forget!” \n\nOrganizers said the Mass, which Francis celebrated a stone's throw away from the steps of the Philadelphia Museum of Art made famous in the movie Rocky , was expected to draw as many as 1 million participants. It capped a busy day for the pontiff, who spoke to victims of clergy sex abuse and vowed to provide \"careful oversight\" to protect young believers in the future. \n\nHe also visited a correctional facility where he blessed inmates and made an unscheduled stop at a local Jesuit university. Later Sunday evening, Francis will depart for the Vatican. Vice President Biden is scheduled to travel to Philadelphia to bid him farewell. \n\nCatholics, as well as non-Catholics who are simply fans of \"the people's pope,\" began flooding the Benjamin Franklin Parkway early on an overcast Sunday in hopes of landing a prime spot to bid Francis farewell. The parkway, an iconic thoroughfare, was dotted with big screens to watch the 78-year-old pontiff deliver his final message to the American people before his return trip to Rome. \n\nBoisterous church groups banging drums and singing songs went suddenly silent as the first strains of the musical preludes of the service wafted over the city streets. Crowds blocks away joined in the chanting and prayers as Mass began. \n\nAutoplay \n\nShow Thumbnails \n\nShow Captions \nLast Slide Next Slide \nThe crowds were packed as far away as Philadelphia's city hall, more than a mile from the pope's altar. The Mass could be heard across much of the city's downtown, where crowds stood rapt watching the celebration on the big screens. \n\n\"We are having a blessed time,\" said Maureen Cobb, 65, a retired teacher from Canal Winchester, Ohio. \"The weather is beautiful, the people are beautiful. All these Christians who want to celebrate the good news of Jesus Christ.\" \n\nLong lines stretched for hours ahead of the Mass, as National Guard soldiers worked to keep the surging crowds orderly. \n\nSteve Mitchell, 61, a deacon from the archdiocese in Detroit, finally gave up as the crowds around him grew unbearably dense and stopped moving. His wife had extricated herself earlier after being jostled one too many times. \n\nMitchell said he wasn't surprised by the huge numbers of people going to great effort to see the pope celebrate his last Mass in the United States. \"It's a historic moment,\" he said. \"This is a guy who has caught the attention of everyone. He's everyone's pope. Non-Catholics, even atheists.\" \n\nTom Delesandro, 33, a teacher from Rockledge, Pa., was on the parkway with his mother, wife and 16-month-old daughter, Ava. \n\n\"We just wanted to take all this in,\" he said with Ava in his arms. \"This is an amazing day, a once or twice in a lifetime opportunity. I'm just hoping my daughter can catch a glimpse of the pope.\" \n\nDenese Sadowski's journey to see Francis began early Sunday morning in Brandywine, Pa., but ended in disappointment in Center City where crowds overwhelmed one of 15 security checkpoints into the papal Mass. \n\nSadowski, a business analyst, had a ticket that was supposed to give her access to the pontiff's parade route and possibly a view of the altar where the pope would sit. But by 2 p.m., she had resigned herself to watching the service on one of 40 giant screens scattered through downtown. \n\n\"It's an experience. And even if I don't get in, I'm happy to be here,\" she said. \"I love him. I think he's very modernized, and I hope he'll bring more people to the Catholic Church.\" \n\nAhead of the Mass, Francis made an unscheduled stop at Saint Joseph’s University to view a newly dedicated statue commemorating the 50th anniversary of Nostra Aetate, a Vatican II document that helped bolster the relationship between the Catholic and Jewish faiths. \n\nThe document highlighted the historic bond between the two faiths and dismissed past efforts by the Church to convert Jews. Saint Joseph’s, a Jesuit university, established the Institute for Jewish-Catholic Relations in 1967 in response to the Vatican call for strengthening the interfaith relationship. \n\nEarlier Sunday, Francis met privately with a group of clergy sex abuse victims. In remarks to bishops from around the globe, Francis said \"grievous harm\" has been caused by the clergy sex abuse scandal that has marred the church for more than a decade. The pontiff promised to hold those responsible for such offenses accountable. \n\n\"I remain overwhelmed with shame that men entrusted with the tender care of children violated these little ones and caused grievous harm,\" he added. \"I am profoundly sorry. God weeps.\" \n\nThe Vatican said Francis met with five adult victims — three women and two men — who were abused by clergy, family members or teachers when they were minors. \n\nIn his address to bishops, Francis focused on the difficulties of supporting the family structure in a rapidly changing world. \n\n\"Needless to say, our understanding, shaped by the interplay of ecclesial faith and the conjugal experience of sacramental grace, must not lead us to disregard the unprecedented changes taking place in contemporary society, with their social, cultural – and now juridical – effects on family bonds,\" Francis said. \"These changes affect all of us, believers and non-believers alike. Christians are not 'immune' to the changes of their times.\" \n\nFrancis also visited the Curran-Fromhold Correctional Facility, where he met with dozens of inmates. The pontiff offered the prisoners — who included suspected murders, rapists and mobsters — words of hope and spoke to them about forgiveness and redemption. \n\nFrancis told the inmates that scripture says Jesus washed his apostles’ feet at the Last Supper. In the past, the pope has repeated that ritual — washing the feet of elderly people with disabilities as well as young people at a juvenile detention center. \n\nThe pontiff also told the the inmates that they were not alone, intoning that \"all of us have something we need to be cleansed of, or purified from.\" \n\n\"The lord goes in search of us, to all of us he stretches out a helping hand,\" said Francis, who shook hands with each inmate and offered several blessings. \"It is painful when we see prison systems which are not concerned to care for wounds, to soothe pain, to offer new possibilities. It is painful when we see people who think that only others need to be cleansed, purified, and do not recognize that their weariness, pain and wounds are also the weariness, pain and wounds of society.\" \n\nRead or Share this story: http://usat.ly/1KDp3jo \n0) { %> \n0) { %> \n\n0) { %>", "source": "Las Cruces Sun-News"}