{"published": "2015-09-11T16:57:05Z", "media-type": "Blog", "title": "​New Apple TV shuns thousands of Web-powered apps", "id": "c53d6b97-93e5-4350-9599-8ab642dbbcdf", "content": "​New Apple TV shuns thousands of Web-powered apps Apple excised some browser technology from its tvOS, meaning a great many developers will have to retool games and other apps if they want a place in the new Apple TV app store. by Stephen Shankland @stshank September 11, 2015 9:57 AM PDT The new Apple TV and its remote control Apple Apple wants customers of its new Apple TV to be able to run a wealth of apps on the device, but it has apparently closed the door to one large class of software.\nApple TV, which Chief Executive Tim Cook announced Wednesday, is a $149 or $199 device that streams Internet video to TVs and lets people play games. Its underlying software and hardware are closely related to what Apple uses in its iPhones and iPads, and as with those mobile devices, Apple will distribute Apple TV games and other apps through its own App Store.\nBut even though iPhones and Apple TV are technological cousins, lots of iPhone apps won't be easily adapted for Apple TV -- and not just because the Apple TV's remote control is different from the iPhone's touch screen. It's because Apple removed a crucial software component called WebKit that lets developers build their apps using the same technology used to construct websites. You probably don't care about how your apps are written as long as they work. But you may care if it means apps you want aren't available. Apple TV customers who want to search for video with the JustWatch app, exercise with the Sworkit app or read news from the Financial Times will have to wait for app developers to move away from Web technology and adjust to Apple's new approach.\nAnd developers -- the unofficial business partners whose software is crucial to making a modern computing device successful -- certainly do care. Moving an app from one programming foundation to another takes time, especially if a developer must learn new programming languages and tools. Some developers like to use Web technologies to build apps because the Web is nearly universal on computing devices, which means they can reuse code when building an app for lots of different devices. Core parts of a Web-based app will run on an iPhone or iPad powered by Apple's iOS or on other devices powered by the likes of Google's Android, Microsoft's Windows Phone and Samsung's Tizen.\nBut the operating system powering Apple TV, called tvOS, is missing WebKit, according to Apple's documentation. The rationale for the decision isn't yet clear, and it's possible Apple could restore Web technologies later. Apple didn't respond to requests for comment on the tvOS move.Better performance?\nOne possible reason Apple removed WebKit support was because of concerns about app performance. Facebook famously ditched its Web-based approach for its apps in 2012, saying the speed of apps built natively for iOS and Android were better. Apple cares deeply about app performance. Apple's WebKit software powers its Safari browser and lets other programs employ Web technology for displaying graphics, text, video and more. Apple High-performance apps can be built with Web technologies, but it's not always easy, said Boroi Wang, co-founder and CEO of a company called Polarr whose photo-editing app uses those Web technologies. \"WebKit leaves too much responsibility to the developers,\" he said, raising the possibility of inexpert programmers writing apps that suffer from jerky animation or stability problems. And Web apps can consume a lot of memory, a precious resource. \"My gut feeling is Apple wants a consistent experience among TV apps and wants to have more control over how stuff looks and works.\"\nAnother tricky matter: An app interface geared toward Apple's remote control, with a touch-sensitive surface, orientation sensitivity and a handful of buttons, is very different from an app interface geared for touchscreens or for keyboards and mice.\nMost computing devices -- smartphones, PCs, tablets, gaming consoles -- have a built-in browser. Apple didn't demonstrate its own browser, Safari, on Apple TV, and it's possible the company doesn't think the Web is really a core part of the TV experience. It wouldn't be the first: Streaming-video devices including Amazon's Fire TV and those from Roku don't include browsers. The Nvidia Shield doesn't come with a browser, but that software can be installed if you jump through a couple hoops. But Apple is in a different position from those rivals in an important way: It's already got thousands of Web-tech apps and developers who've invested time building them. They'll have to start over if they want to make the jump to Apple TV.Ripple effects\nThe removal of WebKit doesn't just affect apps for things like games, news, shopping, social networking and photo sharing. It also means, in all likelihood, that third-party browsers also will be impossible.\nBrowsers can fill gaps in app stores. If there's no app for Gmail, Vimeo video, Bing Maps or Amazon shopping for a particular device, a Web browser can provide that access. It looks like Apple is keeping that door shut, too.\nMany programming interfaces using WebKit technology are available for use by iPhone apps but aren't for Apple TV apps. Stephen Shankland / CNET On iOS, by contrast, Google, Mozilla, Opera and others have released browsers that rely on Apple's WebKit engine to turn website code into a page shown on a screen. If Apple TV proves as popular for streaming video as the iPhone is for smartphones, then developers could well feel compelled to support it. But if Apple TV apps need major retooling before they'll run on other devices like those running Google's Android TV, it'll be more expensive and time-consuming for developers to support those other devices.\nThe older Apple TV device hasn't achieved that kind of market clout. As a result, it's not yet clear if bringing games and other apps to the new Apple TV will be the business necessity for software makers that iPhone support is.\nBut Apple has shown a knack for developing popular, profitable products, and Apple TV could become more compelling with the expected arrival of a video-streaming subscription service. Shunning Web-based apps might not be a big deal today, but in the long run, it could be a blow to the broad power of Web technology. Tags: Apple Media Streamers Internet Safari Previous Story Uber CEO Kalanick reportedly heckled during Colbert taping About the author Stephen Shankland Stephen Shankland has been a reporter at CNET since 1998 and covers browsers, Web development, digital photography and new... See full bio Comments More From CNET", "source": "CNET News"}