{"published": "2015-09-21T12:00:58Z", "media-type": "News", "title": "New ACI Worldwide Survey: 6 out 10 U.S. Consumers with Credit Cards are Not Ready for EMV", "id": "18a93b55-c6da-4bd0-b35a-2a8aae892cce", "content": "As retailers and banks prepare for the October 1 EMV liability shift—which moves fraud liability from issuing banks to merchants —many consumers have not yet received their new chip-enabled cards, or are simply in the dark about what EMV means, according to a new survey from ACI Worldwide (NASDAQ: ACIW). The new EMV Readiness Survey of 1,000 adults in the U.S. provides insight into consumers’ views on EMV, and spotlights issues and implications for banks and retailers, ahead of the busy holiday shopping season. \n\nThis Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20150921005091/en/ \n\nPrinciple findings of this study include: \n\nOf those consumers surveyed who have one or more credit or debit cards: \n\nNearly three in five (59%) reported that they have not yet received a new chip-enabled card. \n\n67 percent indicated they have not received information from their credit card issuer or bank explaining what EMV means and how it will impact them. \n\nOf those who have already received chip-enabled cards: \n\nOnly one third (32%) are aware that the U.S. is moving to EMV—and the majority do not know the real reason that they received a new card. \n\nDemographics play a role for those who have received chip-enabled cards, but awareness does not connote understanding: \n\nAmong respondents aged 55-64, 86 percent have heard or seen information about EMV, compared to 66 percent of 45-54 year olds and 66 percent of those who are 65+. \n\nMillennials (18-34 year olds) and Gen Xers (35-44 year olds) reported a high level of EMV awareness (78%). \n\nGeography also plays a role for those who have received chip-enabled cards: \n\nNearly a quarter (23%) of respondents from the Western U.S. thought they received new chip-enabled cards because of data breaches—higher than other U.S. regions—Northeast (17%) Midwest (10%) and South (7%). \n\n“The survey data validates the trends we have seen over the past year; with less than a month to go until the EMV liability shift, a staggering number of consumers are neither educated on nor aware of EMV; they don’t know why they have new chip-enabled cards,” said Mike Braatz, senior vice president, Payments Risk Management, ACI Worldwide. “And if consumers are unaware, the implications for retailers come October and throughout the holiday shopping season could be major, especially as retailers prepare for this new payment experience. Although October is the date for the liability shift, we know issuers, acquirers and retailers are still working on issuing cards and upgrading payment acceptance systems to address EMV.” \n\nEMV is a global standard for credit and debit payment cards based on chip card technology, taking its name from the card schemes Europay, MasterCard, and Visa—the original card associations that developed it. The standard is now managed by EMVCo, a consortium with control split equally among Visa, MasterCard, JCB, American Express, China UnionPay, and Discover. Beginning in October, any purchase made at a terminal where EMV could be used but is not, the liability for any card-present counterfeit fraud losses will be put on the party that is responsible for a non-chip transaction. \n\nACI's Universal Payments (UP) portfolio has EMV solutions addressing card and smart chip management issuing, transaction processing and acquiring and payments risk management. For more than 15 years, ACI has played a lead role in the enablement of EMV around the world. \n\nSurvey Methodology \n\nThe ORC International CARAVAN® survey was conducted from August 27-30, 2015, using two probability samples: randomly selected landline telephone numbers and randomly selected mobile (cell) telephone numbers. The combined sample consisted of 1,008 adults (18 years old and older) living in the continental United States. The margin of error for the total sample of 1,008 was +/- 3.09% at the 95 percent confidence level. Note that base sizes for age and geography results among those who have received chip enabled cards may be low. \n\nAbout ACI Worldwide \n\nACI Worldwide, the Universal Payments company, powers electronic payments and banking for more than 5,600 financial institutions, retailers, billers and processors around the world. ACI software processes $13 trillion each day in payments and securities transactions for more than 300 of the leading global retailers, and 18 of the world’s 20 largest banks. Through our comprehensive suite of software products and hosted services, we deliver a broad range of solutions for payment processing; card and merchant management; online banking; mobile, branch and voice banking; fraud detection; trade finance; and electronic bill presentment and payment. To learn more about ACI, please visit www.aciworldwide.com. You can also find us on Twitter @ACI_Worldwide. \n\n© Copyright ACI Worldwide, Inc. 2015. \n\nACI, ACI Payment Systems, the ACI logo and all ACI product names are trademarks or registered trademarks of ACI Worldwide, Inc., or one of its subsidiaries, in the United States, other countries or both. Other parties’ trademarks referenced are the property of their respective owners. \n\nProduct roadmaps are for informational purposes only and may not be incorporated into a contract or agreement. The development release and timing of future product releases remains at ACI’s sole discretion. ACI is providing the following information in accordance with ACI's standard product communication policies. Any resulting features, functionality, and enhancements or timing of release of such features, functionality, and enhancements are at the sole discretion of ACI and may be modified without notice. All product roadmap or other similar information does not represent a commitment to deliver any material, code, or functionality, and should not be relied upon in making a purchasing decision. \n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150921005091/en/ \n\nPublished Sep. 21, 2015 \n\nCopyright © 2015 SYS-CON Media, Inc. — All Rights Reserved. \n\nSyndicated stories and blog feeds, all rights reserved by the author.", "source": "Virtualization Conference & Expo"}