{"published": "2015-09-28T14:22:48Z", "media-type": "News", "title": "Western Potash Elects New Chairman of the Board and Receives Environmental Assessment Approval for Milestone Project Pilot Plant", "id": "359f4807-ac3a-47a0-924f-39d61dd893d8", "content": "ID: 1388332 \n   \n   \n(businesspress24) - VANCOUVER, BRITISH COLUMBIA -- (Marketwired) -- 09/28/15 --   Western Potash Corp. (TSX: WPX)(FRANKFURT: AHE) (the \"Western\", \"the Company\") is pleased to announce that subsequent to the closing of the strategic investment from Beijing Tairui Innovation Capital Management Ltd. (\"Tairui\"), announced September 16th of this year, Mr. Chang Xiaogang (Geoffrey) has been elected to the position of Executive Chairman of the Board of Western Potash Corp. \n\nMr. Chang is a graduate of Tsinghua University School of Economics and Management with a Master''s Degree in Business Administration. Previously he served as President and Chairman of Shanxi Top Energy Company Ltd., Deputy Chairman of Shanxi Securities Ltd., Deputy Chairman of Shanxi Zhangze Power Company Ltd., Chairman and President of Shanxi International Power Group Ltd. Mr. Chang also served as a full-time independent director of SASAC, China''s State-owned Assets Supervision and Administration Commission. \n\nPatricio Varas, CEO commented,\" The Western Potash board is pleased to welcome Geoffrey Chang as newly elected Chairman. Mr. Chang and Tairui bring a wealth of relevant experience that will help guide Western as the Company begins the transition to project construction.\" \n\nEnvironmental Assessment Approval: \n\nWestern is also pleased to announce that it has received Environmental Assessment Approval from the Saskatchewan Ministry of Environment (\"SMoE\") for the Milestone Project Pilot Plant, (\"the Pilot Plant\"). Western submitted an Environmental Impact Statement (\"EIS\") for the Milestone Project initially in early 2013 as the project was considered a \"Development\" as defined in the province of Saskatchewan''s Environmental Assessment Act (\"EAA\"). As such it was subject to an Environmental Impact Assessment. Following a regulatory review, the EIS received Ministerial Approval from SMoE in April 2013. \n\nSubsequently, Western re-scoped the project as detailed in the Scoping Study for a Scalable Pilot Plant delivered earlier this year and announced in the July 2nd, 2015 news release. The Milestone Project Pilot Plant by contrast provides an alternative methodology that employs lower capital using innovative selective potash solution mining techniques. The change in mining methodology and design proposed for the Pilot Plant required review under the EAA as it represented a change from the original 2013 approval. A Project Description outlining the Pilot Plant was submitted to SMoE in July, 2015. Following review of the Project Description, Saskatchewan Ministry of Environment concluded that the proposed change will not result in significant environmental impacts different from those identified in the original EIS and is satisfied that the requirements of the EAA have been met. \n   \nON BEHALF OF THE BOARD OF DIRECTORS \n\nPatricio Varas, President and CEO \n\nCautions Regarding Forward-Looking Statements \n\nExcept for statements of historical fact relating to the Company, certain information contained herein constitutes \"forward-looking information\" under Canadian securities legislation. Forward-looking information includes, but is not limited to, statements with respect to the intended use of proceeds from, and the anticipated benefits of, the Transaction. Forward-looking statements are based on the opinions and estimates of management as of the date such statements are made and they are subject to known and unknown risks, uncertainties and other factors that may cause the actual results of the Company to be materially different from those expressed or implied by such forward-looking statements or forward-looking information. Although management of the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking information. The Company does not undertake to update any forward-looking information that is set out herein, except in accordance with applicable securities laws. \n\nContacts: \nWestern Potash Corp. \nDavid Thornley-Hall \nExecutive Vice-President, Corporate \n604-689-9378 \n\nKeywords (optional): \n\n\nUnternehmensinformation / Kurzprofil: \n\nLeseranfragen: \nPresseKontakt / Agentur: \n\nbereitgestellt von: Marketwired \n \nDatum: 28.09.2015 - 13:48 \nSprache: Deutsch \nNews-ID 1388332 \nAnzahl Zeichen:  \ncontact information: \nCompany: Western Potash Corp. \nContact person:  \nTown: VANCOUVER, BRITISH COLUMBIA \nPhone: \n\nAnmerkungen: \n\nDiese Pressemitteilung wurde bisher 0 mal aufgerufen. \n\n \nVerlinkung-Tipps: \n\nDirekter Link zu dieser Pressemeldung: \n\n\nÜber einen Link auf Ihrer News-, Presse- oder Partner-Seite würden wir uns sehr freuen.", "source": "BusinessPress24"}