{"published": "2015-09-01T13:20:05Z", "media-type": "News", "title": "'Linden Legends' encapsulates elemenary's history and memories", "id": "017026a1-385f-449b-84de-88940c4285b8", "content": "Dr. Bill Svoboda is no stranger to taking on writing challenges. \n\nAs a pediatric neurologist, Svoboda published a number of books, include the 650-page book titled \"Language, Learning and Behavioral Complications of Childhood Epilepsy.\" \n\nAs an avid reader, and former student at Linden Elementary more than 60 years ago, when Svoboda learned that the school was releasing a book about the history of the elementary, he jumped at the opportunity to purchase a copy. \n\nAs it turned out, though, the school was simply adding a small section to its yearbook. \n\nThere was no book. \n\nSvoboda, and more than 20 others who misunderstood the school's intentions, were disappointed a more thorough version was not being made. So, Svoboda made the decision to take on the challenge himself. \n\n“People thought that it was going to be a separate book, and more than 20 people contacted the president of the PTA wanting a copy of the book,” he said. “She replied, ‘no, no, no, it’s nothing like that.' So, I contacted her and told her that I wanted to put one together.” \n\nCollaborating with the PTA, former principal Bob Robinson and David Pinkall, executive director of the Fremont Public School foundation, Svoboda started tackling his latest challenge. \n\nThree years later, the 55-page booklet \"Linden Legends\" is complete — and it’s causing a buzz. Svoboda has sold 37 copies so far, and not only to people in Nebraska. Linden alumnus from New Jersey, Florida, Mississippi, Oregon, Arizona and Illinois have purchased copies.  \n\nThe booklet is broken down into numerous sections highlighting different decades, and students’ memories from the time period. Also highlighted are staff members who played crucial roles in students’ lives during the particular decade. \n\nUsing the Internet, primarily a Linden Alumni Facebook page, Svoboda networked with dozens of people who attended the school throughout the years. It seemed that everybody had a story to tell about their experience at the school, he said. \n\nAs it turns, out, he has a few of his own as well. \n\nSvoboda recalls his time in Mrs. Whitcomb’s fifth-grade classroom. She encouraged him to take up puppetry, and even to start a school newspaper. One of his clearest memories is participating in airway drills while the United States was involved with World War ll. At the time, the drills made no sense to young Svoboda.  \n\n“We would have to go down these stair cases during the drills,” Svoboda said. “I could never figure out why they were doing this, it’s not like the Japanese were going to be bombing the middle of Nebraska.\" \n \nYears later, though, Svoboda said he learned that the Japanese would tie bombs to balloons and send them overseas — one actually reached an area around North Omaha dropping into an empty field. \n\n“It took me more than 60 years to appreciate the drills, it finally answered the question for me,” he said with a laugh. \n\nThe reception toward \"Linden Legends\" has been astounding, but Svoboda isn’t surprised because he said he knows how vested of an interest people have in the schools’ history and success. \n\nUltimately, people enjoy looking back on their days at Linden and remembering all of the good times they had, the bonds they formed and the cherished memories they made. \n\n“It certainly triggers a lot of great memories for people,” Svoboda said. “I just had one woman order one and she was so excited to get it. She kept saying that she couldn’t wait to get home so that she could turn all those pages full of memories.” \n\n\"Linden Legends\" can be purchased locally for $5, and shipped anywhere in the country for $9. Anyone interested in receiving a copy should contact Svoboda at wsvoboda@aol.com.", "source": "Fremont Tribune"}