{"published": "2015-09-08T18:54:02Z", "media-type": "News", "title": "Local Happenings: Danville's Village Theatre presenting \"Streetcar Named Desire\" stage performance, film screening", "id": "f6e047d0-e409-42a6-ab0e-13ab926719a6", "content": "Valley Journal/Times-Herald \n\nPosted:\n\t\t\t\t\t\t \n\t\t\t\t\t\t09/08/2015 11:45:28 AM PDT \n\n\nThrough -- Sept. 12 \nInside and Out: Plein Air and Studio Works -- Noon to 5 p.m. Wednesday through Friday, 11 a.m. to 3 p.m. Saturday. This exhibit features recent works by seven Bay Area artists who paint together for inspiration and challenge. The pieces are begun outdoors and completed in studio. Open to the public. Donations welcome. Harrington Gallery at the Firehouse Arts Center, 4444 Railroad Ave., Pleasanton. Free. \nThrough Sept. 26 \n\"Journey Stories\" -- 9 a.m. to 4 p.m. Monday through Friday, 9 a.m. to 3 p.m. Saturday, closed on Sunday. This is a traveling exhibition from the Smithsonian Institution and from the national Museum on Main Street program featuring tales of how our ancestors came to America, from Native Americans to new citizens. Museum of the San Ramon Valley, 205 Railroad Ave. Danville. Free to members, modest fee for nonmembers. Donations welcome. 925-837-3750 \nThrough 19 \n\n\"Streetcar Named Desire\" stage performance -- 8 p.m. Friday and Saturday, 2 p.m. Sunday. Tennessee Williams' renowned drama follows troubled former schoolteacher Blanche DuBois as she leaves small-town Mississippi and moves in with her sister, Stella Kowalski and her husband, Stanley, in New Orleans. Blanche's flirtatious Southern-belle presence causes problems for Stella and Stanley, who already have a volatile relationship, leading to even greater conflict in the Kowalski household. Produced by Role Players Ensemble. Village Theatre, 233 Front St., Danville. Tickets are $28. 925-314-3400. \nSept. 10 \n\"Streetcar Named Desire\" film screening -- \"A Streetcar Named Desire\" at 7:30 p.m. Classic 1951 film adaptation of Tennessee Williams play starring Marlon Brando, Vivien Leigh and Kim Hunter. Village Theatre, 233 Front St. in Danville. Tickets are $10. 925-314-3400. \nSept. 11 \nSept. 11 Memorial -- 10 a.m. The Livermore-Pleasanton Fire Department will host a Sept. 11 memorial event featuring firefighters, police officers, city officials, veterans and members of the public for a 20-minute ceremony to honor and remember those who fell on Sept. 11, 2001, as well as those who fought and died in the war on terrorism. The public is welcomed and encouraged to attend the memorial followed by a reception and fire station open house at 3560 Nevada St. in Pleasanton. \nSept. 12 \nEugene O'Neill — Evolution of an Artist -- 2 p.m. From Provincetown to Tao House. Eric Fraisher Hayes, the O'Neill Foundation director of artistic programming who has directed or produced nearly 20 O'Neill plays, will provide insights into the life and plays of Eugene O'Neill. Museum of the San Ramon Valley, 233 Front St., Danville. Tickets are $10. 925-314-3400. The Secrets of O'Neill in Danville -- 3:30 p.m. An hourlong tour providing stories about O'Neill and his days in Danville and Tao House. Begins at the Museum of the San Ramon Valley, 233 Front St., Danville and ends up at the O'Neill Commemorative, Front Street near the Danville Library. Free. 925-314-3400. Autos of Alamo -- 4 to 8 p.m. Enjoy a night of live music and great cars, including classics, antiques, hot rods and customs from 1980 and before. Alamo Plaza Shopping Center, Danville Boulevard and Stone Valley Road in Alamo. SAT Practice Test -- 11 a.m. to 3 p.m. Teens are welcome to come and prepare for the redesigned 2016 SAT with C2 Education at the Dougherty Station Library, 17017 Bollinger Canyon Road. Registration required. Free. 925-973-2850. What To Do With That Brown Lawn -- 10 a.m. to noon. The City of Pleasanton Water Conservation Division presents local landscape designer Kat Weiss who will discuss sustainable and beautiful alternatives to \"Lawnscapes,\" efficient and easy irrigation system changes and how to sheet mulch. City of Pleasanton Operation Services Center, 3333 Busch Road. Free. To register call 925-931-5504. \nSept. 12-13 \nFamily Campout -- 3 p.m. to 10 a.m. Introduce camping to your little ones and still be minutes away from home. Dublin Parks and Community Services Department provides a variety of games and activities to keep everyone active and entertained throughout the evening, including campfires, group games and s'mores! Dinner, breakfast, fun family arts and crafts and activities are all included. Please bring the following: tent, sleeping bags, chairs, flashlights, snacks, clothes and personal items. Please, no pets. Search for Activity Number 38982. Emerald Glen Park, 4201 Central Parkway in Dublin. Cost is $22 per person for residents and $24 per person for nonresidents. Register online at www.dublinrecguide.com or call 925-556-4500. \nSept. 13 \n\"Madama Butterfly\" Highlights -- 2 p.m. The Livermore Valley Opera's professional singers will perform highlights from their upcoming production of \"Madama Butterfly.\" Livermore Civic Center Library, 1188 S. Livermore Ave. Free. 925-373-5500. National Circus and Acrobats of China -- 2 p.m. The troupe executes stunning feats of physical precision and balance using hoops, poles, balls, ladders and cycles in a magnificent display of visual wonder and excitement. The Bankhead Theater, 2400 First St. in Livermore. Tickets are $69 for general admission, $52 for students and $16 for those 21 and younger. For more information visit www.livermoreperformingarts.org or call 925-373-6800. Rosh Hashana -- 5 to 7:30 p.m. Celebrate Rosh Hashana in a secular humanistic way that is authentic to Jewish culture and your own beliefs. Meet at 5 p. m. for our tashlikh walk to the arroyo; 6 p.m. for a one-hour program of music and readings followed by an apples-and-honey reception. Kids are welcome. We will have our annual food drive, so please bring nonperishable food items to be donated to a local food bank. Bothwell Center, 2466 Eighth St. in Livermore. A suggested donation is $20 per nonmember adult. \nSept. 14, 21, 28 \nAuditions -- The Valley Concert Chorale is scheduling auditions for singers who would like to be a part of the Chorale's 2015-2016 season. The Chorale is seeking experienced singers with sight-reading skills who enjoy singing exciting and challenging music. First Presbyterian Church of Livermore, 2020 Fifth St. in Livermore. To schedule an appointment, call 925-462-4205 or visit www.valleyconcertchorale.org . \nSept. 17 \nMeet the Author -- 7 p.m. Meet Dr. Daniel Siegel, best-selling author of \"Brainstorm -- The Power and Purpose of the Teenage Brain.\" Topics include: popular myths about teenage behavior, why teens are driven to seek out novelty and take more risks, how the brain undergoes rapid changes through the early 20s and why adolescence is a \"Golden Age\" of innovation and creativity. Dr. Siegel will take questions from the audience. Amador Theater, 1155 Santa Rita Road in Pleasanton. Tickets are $10, and parking is free. For tickets visit www.firehousearts.org or call 925-847-931-4848. \nSept. 18 \nThe Blue Sky Riders -- 8 p.m. Three veteran singer-songwriters will come together with a marriage of lyrics, melody and rich vocal harmonies. The Bankhead Theater, 2400 First St., Livermore. Tickets are $62 or $7. For more information visit www.livermoreperformingarts.org or call 925-373-6800. \nSept. 18, 20 & 24-27 \n\"Desire Under the Elms\" -- By Eugene O'Neill. 8 p.m. nightly, 2 p.m. Sunday matinees. The son of an 1840s New England patriarch lusts after his father's bride. What follows includes incest, adultery and infanticide. Old Barn, Tao House at Eugene O'Neill National Historic Site, accessible only by a shuttle from the Museum of the San Ramon Valley, 205 Railroad Ave., Danville. 925-837-3750. Tickets are $35. \nSept. 19 \n\"100 Years of Desire\" -- 2 p.m. A lively panel discussion of desire as depicted in literature, cinema and theater over the last century. Old Barn, Tao House, Eugene O'Neill National Historic Site, accessible only by a shuttle from the Museum of the San Ramon Valley, 205 Railroad Ave., Danville. Tickets are $18. 925-837-3750. AAUW Annual Membership Brunch -- 9:30 a.m. to 12:30 p.m. The Alamo-Walnut Creek Branch of the American Association of University Women invites the public to learn about human trafficking in the Bay Area from guest Speaker Venus Rodriguez, a staff member at Not For Sale, an area nonprofit leading a program called Reinvent. Roundhill Country Club, 3169 Roundhill Road, Alamo. RSVP by Sept. 10 by mailing a check for $28 to D-A-W AAUW, P.O. Box 996, Alamo, CA 94507 or going online at http://daw-ca.aauw.net/2015brunch/ and paying with a credit card. Email Soni Leighton at sonileighton@me.com for more details. Paws & Outlaws Barbecue -- 3 to 6 p.m. Paws In Need will host Paws & Outlaws Barbecue. The festivities include a barbecue with all the fixin's, music, raffles and a no-host bar with beer, wine and nonalcoholic beverages. Proceeds will benefit Paws In Need, which provides the Tri-Valley financial assistance for a spay/neuter program and the Just Like New Fund to care for sick or injured pets. The Olivina, 4555 Arroyo Road in Livermore. Tickets are $35 each, $15 each for kids. For more information contact Lisa Williams at lisawilliams.ca@gmail.com . Splatter -- Noon to 8 p.m. Not your ordinary food, wine and art festival. At the heart of the event is the 15,000-square-foot Tasting Pavilion featuring more than 30 of the finest wineries, microbreweries and restaurants. Also featured are two stages of live entertainment, an Arts and Culinary Marketplace, mobile food trucks, unique and interactive art and a grand finale concert featuring \"The Peelers\" followed by a spectacular laser light show at 8 p.m. General admission and parking are free. Emerald Glen Park, Tassajara Road and Gleason Drive. Passports can be purchased in advance at the pre-event rate of $30 or on the day of the event for $35. Call 925-833-6645 or visit www.dublinsplatter.com for more information. \nSept. 20 \nMeet the Author -- 2 p.m. Author Daniel J. Levitin will talk about his book \"The Organized Mind: Thinking Straight in the Age of Information Overload.\" Levitin will answer questions and sign copies. This event is free, and copies will be available for sale. Civic Center Library, 1188 S. Livermore Ave. 925-373-5500. \nSept. 24 \nThursday @ the VT -- 7:30 p.m. South City Blues Band is dedicated to the groove, providing you with a unique blend of swinging jump blues, jazz/funk blues and \"old-school\" R&B. Village Theatre, 233 Front St. in Danville. Tickets are $15. Call 925-314-346. \nSept. 26-27 \nGreat American Artifact & Art Show -- 10 a.m. to 4 p.m. Saturday, 10 a.m. to 5 p.m. Sunday. Contemporary Native American artists will be featured along with collectors selling and displaying various items; Hopi Kachinas, North West Coast totem poles, period Pueblo pottery and pawn jewelry. Alameda County Fairgrounds, 4501 Pleasanton Ave. in Pleasanton. Admission is $8 for adults, $6 for seniors, children get in free. For more information, contact Don Phelps at phelpststp@gmail.com . \nSept. 27 \nPaws in the Park -- 10 a.m. activities begin, 11 a.m. walk starts. The Valley Humane Society presents a charity walk fundraiser and pet friendly festival with vendors, canine demonstrations and contests. Proceeds support the rescue, care and adoption of local dogs and cats who have been abandoned or otherwise made homeless. Registration fees are $25 for individuals, $40 per couple and $10 for youth age 12 and under. Includes a T-shirt and goody bag. Amador Valley Community Park, Black Avenue, Pleasanton. \nSept. 29 \nOpen Your Heart Fundraiser -- 6:30 p.m. This fundraiser for Open Heart Kitchen kicks off with a tasting of 15 local Livermore Valley cabernet sauvignons and sauvignon blancs followed by a tri-tip buffet dinner and dessert. Finish the evening off with prize drawings and dancing to the music of Larry and Friends. Open Heart Kitchen feeds the hungry every weekday as an interfaith effort and serves more than 313,000 meals annually. Tickets are $85 per person, and advance tickets are required by visiting mcgrailvineyards.com . For more information call 925-580-6793. \nOct. 3 \nTinsel and Treasures Folk Art -- 11 a.m. to 4 p.m. The event showcases 35 renowned mixed-media artisans offering a diverse array of one-of-a-kind, original handmade works of art, jewelry, antique artifacts, hard to find vintage supplies, handbags, home décor, folk art, ceramics, children's furnishings and Halloween and Christmas decorations. Downtown Danville, Veterans Memorial Building, 400 Hartz Ave. in Danville. Free. \nOct. 10 \nFarallon Quintet -- 8 p.m. Del Valle Fine Arts presents a dynamic Bay Area ensemble chamber music group focused exclusively on the clarinet quintet -- string quartet plus clarinet -- repertoire. In addition to playing the classics, the quintet seeks to perform rarely heard works, innovative arrangements, and new music by living composers. Bankhead Theater, 2400 First Street, Livermore. Tickets range from $28 to $42. Call 925-373-6800 or visit www.bankheadtheater.org . \nOct. 11 \nAntiques & Collectibles Faire -- 8 a.m. to 4 p.m. More than 400 dealers will sell items 20 years old or older. Shop for clothing, furniture, jewelry, toys, ephemera, home decor and more. Booths will line Main Street in downtown Pleasanton. Free. \nOct. 17 \nWheels for Meals Ride -- 7 a.m. Registration closes at 11:59 a.m. Oct. 15 or after 1,000 riders register. No on-site day-of-event registration permitted. This charitable ride benefits meal delivery and safety/wellness checks for homebound seniors. Tour the scenic Livermore Valley and then return to a celebration complete with entertainment, a delicious BBQ lunch (with vegetarian options) and family-friendly fun! There are four fully-supported routes: 15 miles, 35 miles, 50 miles and 70 miles. Shadow Cliffs East Bay Regional Park, 2500 Stanley Blvd. in Pleasanton. Adult riders are asked to raise a minimum of $200. For more information visit www.wheelsformealsride.com . \nOct. 29 \nThursdays @ the VT: Steve Lucky and the Rumba Bums were among the first neo-swing bands to modernize and reinvent the jump swing genre while staying true to their musical roots. They are an amazing band with a swinging horn and rhythm section who can't be beat. Village Theatre, 233 Front St. in Danville. Tickets are $15. Call 925-314-346. \nNov. 14 \nHoliday Craft Boutique -- 10 a.m. to 4 p.m. The Dublin Senior Center boutique will feature new and unique handmade items. Find your \"one-of-a-kind\" holiday gift. Dublin Senior Center, 7600 Amador Valley Boulevard. Free admission and parking. 925-556-4511. Richard Cionco Piano Concert -- 8 p.m. Pianist Richard Cionco performs a virtuosic and beautiful program and has performed in recital and as a concerto soloist in Europe, Canada and Asia. Bankhead Theater, 2400 First St. in Livermore. Tickets range from $28 to $42. Call 925-373-6800 or visit www.bankheadtheater.org . \nNov. 14-15 \nGoodguys Autumn Get-Together -- 8 a.m. to 4 p.m. both days. Weekend happenings include more than 2,500 American-made and/or powered rods, customs, classics, muscle cars and trucks of all years; Veterans Day celebrations; a swap meet; a model and pedal car show; and free kids' entertainment. Alameda County Fairgrounds, 4501 Pleasanton Ave. in Pleasanton. Tickets are $20/$17 online, general admission; $6 for kids 7 to 12, and children 6 and younger get in free. Parking is $10. Discount tickets online are at www.good-guys.com/2015-events . \nNov. 15 \nHoliday Fantasy Benefit Luncheon & Fashion Show -- 11:30 a.m. social time, 1 p.m. lunch, 2 p.m. fashion show. The GFWC Dublin/San Ramon Women's Club will present a benefit luncheon and fashion show for the Sentinels of Freedom to support our wounded and injured members of the U.S. Armed Forces and the Bay Area Crisis Nursery established to help prevent child abuse and child neglect. San Ramon Marriott Hotel at Bishop Ranch 2600 Bishop Drive, San Ramon. Reservations are $65 per person (parking included) and must be made before Oct. 15. For additional information please call Claire Salsman at 925-361-0692 or Sheryn McKenna at 925-829-", "source": "The Daily Review"}