{"published": "2015-09-16T17:51:52Z", "media-type": "News", "title": "Department of Human Services Secretary Announces Innovative Changes to Medicaid in Pennsylvania", "id": "d56a02ca-0769-4ea0-bd46-39d5480e1506", "content": "From the Wires Changes Emphasize Outcome-based Payments and Community-based Care \n \nSep. 16, 2015 01:42 PM \n   \n\r \n\nHARRISBURG, Pa. , Sept 16, 2015 /PRNewswire-USNewswire/ -- Department of Human Services (DHS) Secretary Ted Dallas today announced two major steps in the Department's effort to spur innovation and better care in Medicaid. Governor Tom Wolf launched Pennsylvania's Medicaid expansion plan in April 2015 . Since the launch, more than 200,000 new Pennsylvanians have enrolled in HealthChoices, which now provides health care coverage to more Pennsylvanians than ever before. \n\n\"When fully implemented, these new changes will mark the most significant changes to Medicaid in Pennsylvania since the Department first moved to mandatory managed care 18 years ago,\" said Secretary Dallas. \"We must continue to innovate and move forward if we are going to provide the high-quality health care that all Pennsylvanians deserve. As the biggest insurance payor in the commonwealth, our hope is that these changes will encourage innovation in the private sector as well.\" \n\nFirst, DHS issued a request for proposals (RFP) for physical health services provided through HealthChoices, Pennsylvania's mandatory Medicaid managed care program since 1997. \n\n\"If you pay for services, you will get services.  If you pay for outcomes, you will get outcomes,\" said Dallas. \"When awarded, the contracts will require the managed care organizations (MCOs) to increase the amount of money they spend on contracts that reward value, care coordination, and better health outcomes rather than simply paying for services as they are provided. The result will be a system that focuses more on the patient as a whole and provides higher quality care to those in the Medicaid system.\" \n\nTo drive Pennsylvania's Medicaid system towards these better outcomes, the new contracts will set targets for all contracted MCOs to increase the percentage of value-based or outcome-based contracts they have with hospitals, doctors, and other providers to 30 percent of medical funds they receive from DHS within three years. The result will be that billions of dollars will be invested in options such as: \naccountable care organizations (voluntary networks of hospitals, doctors, and other providers that work together to provide coordinated care to patients);    bundled payments (increases value-based purchasing);  patient-centered medical homes; and  other performance-based payments.  \nThe contracts will also include better integration of the physical and behavioral health systems and approaches like telemedicine to help serve areas of the state that do not have easy access to doctors. \n  \nSecond, DHS, in partnership with the Pennsylvania Department of Aging, released a more detailed concept paper outlining its vision for Community HealthChoices (CHC), Governor Tom Wolf's managed long-term services and supports program to support older individuals and adults with physical disabilities ( click here for the release regarding the concept paper). The plan is an integrated system of physical health and long-term services and supports (LTSS) which focuses on improving health outcomes and allowing individuals to live safe and healthy lives with as much independence as possible. \n\nCHC is a significant shift from the commonwealth's current, fractured approach to providing these services and will enhance care for seniors and persons with disabilities through better coordination of care. The result will be that more Pennsylvanians will be served in the community instead of in nursing homes or other facilities.  \n\nCHC will support individuals dually eligible for Medicare and Medicaid, older adults and adults with physical disabilities in the most integrated settings possible. CHC will serve an estimated 450,000 individuals, including 130,000 older persons and adults with physical disabilities who are currently receiving LTSS in the community and in nursing facilities. \n\nHealthChoices delivers quality medical care and timely access to all appropriate services to 2.5 million children, individuals with disabilities, pregnant women, and low-income Pennsylvanians. \n\nFor more information on Community HealthChoices, visit www.dhs.state.pa.us . The RFP can be found here . \n\nMEDIA CONTACT : Kait Gillis , 717-425-7606 \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/department-of-human-services-secretary-announces-innovative-changes-to-medicaid-in-pennsylvania-300144295.html \n\nSOURCE  Pennsylvania Department of Human Services \n About PR Newswire \nCopyright © 2007 PR Newswire. All rights reserved. Republication or redistribution of PRNewswire content is expressly prohibited without the prior written consent of PRNewswire. PRNewswire shall not be liable for any errors or delays in the content, or for any actions taken in reliance thereon.", "source": "Sys-Con India"}