{"published": "2015-09-22T13:49:58Z", "media-type": "Blog", "title": "Aren’t we blowing Kevin Harvick vs. Jimmie Johnson out of proportion?", "id": "eb74fc74-df9c-4636-b05b-980b379bb118", "content": "In case you missed it, Denny Hamlin came back from a lap down to win the MyAFibRisk.com 400 NASCAR Sprint Cup Series race at Chicagoland Speedway in Joliet, Ill., on Sunday. As a matter-of-fact, the top-three finishers were all a lap down at one point. Again, in case you missed it, Carl Edwards and Kurt Busch were the two drivers who finished second and third. And by the way, Joe Gibbs Racing are first through fourth in the points standings after one race in the Chase. \n \nWhy am I concered you may have missed the aforementioned news? Because it seems the big news of the weekend was the altercation between reigning champion Kevin Harvick and six-time champ Jimmie Johnson in the driver motorcoach lot. \n \nNASCAR took a stance Monday by announcing that there would be no penalty for either driver for the incident. From that, I take that the incident was no big deal for the sanctioning body. But what about everybody else? Frankly, I think it’s all being blown out of proportion. Heck, tracks hosting Chase races are using it as a promotional took, and quite frankly, exaggerating the incident, in my opinion. Also, headlines on post-race stories Sunday evening seemed to over-sensationalize the whole thing, again, in my opinion. \n \nMatt “Spider Monkey” Kenseth jumping Brad Keselowski between haulers this incident was not. Okay, I admit, I was entertained by that one. \n \nMaybe the coverage and promotions featuring the aforementioned Johnson-Harvick incident is what’s feeding the fan frenzy, the fan frenzy that reached the point that Harvick’s wife, DeLana Harvick, felt the need to take to social media to defend her family. \n \nI’m neither Team Harvick nor Team Johnson in this matter. I’m Team Let’s Just Move On. To entities using this incident as a promo tool — is this how we really want to promote the sport? Shouldn’t good racing be enough? Sure, I’m all for drivers not being vanilla, instead showing emotion and telling us how they really feel, but when it comes to promoting the sport, maybe the on-track product should be the focus. \n  \nThe marketing focus on altercations — and by altercations, I’m NOT talking on-track rivalries — maybe contributes to the image of NASCAR being some kind of “good ‘ol boy redneck” sport. Did you ever think of that? Maybe that’s why some mainstream sports folks don’t take NASCAR seriously. Ever think of that? Do we want NASCAR in the same conversation as the WWE? \n \nThere are on-the-court, field, etc. altercations in other professional sports, but that’s not the focus of marketing efforts by the sanctioning bodies of said sports. I don’t recall seeing shoving-match-filled commercials promoting the NBA Finals a few months ago. \n \nAnd while I’m the subject of this Johnson vs. Harvick thing, I’m thinking headlines that include “punches thrown” is a little inaccurate. Wasn’t Harvick’s action more like a closed-fist shove? But I digress. \n \nLet’s just focus on the racing and actually pay attention to that annoying line from that even more annouing song, “Let it go.” \n \nFollow Auto Racing Daily on Twitter @AutoRacingDaily or like Auto Racing Daily on Facebook (facebook.com/autorcngdaily). Amanda’s also on Twitter @NASCARexaminer and has a fan/like page on Facebook: NASCAR Examiner.", "source": "Auto Racing Daily"}