{"published": "2015-08-31T19:15:38Z", "media-type": "Blog", "title": "SAN DIEGO -- After missing all of last week, including Saturday's game against the Seattle Seahawks with a shoulder issue, San Diego Chargers inside linebacker Manti Te'o returned to practice on Monday. \"It's a long camp, so coach just gave me the", "id": "1152a018-fe37-4ecd-b0cf-728912083b13", "content": "Eric D. Williams0 Shares\nEmailPrint\nComment\nSAN DIEGO -- After missing all of last week, including Saturday's game against the Seattle Seahawks with a shoulder issue, San Diego Chargers inside linebacker Manti Te'o returned to practice on Monday.\n\"It's a long camp, so coach just gave me the time to recover and get ready, so I feel good,\" Te'o said.\nTe'o has missed at least one preseason game due to injury his first three years in the league, and missed a combined nine games over the last two years due to foot issues.\nBut Te'o said he could have played against the Seattle Seahawks last week if it were a regular-season game, and that he's healthy enough to play when the Chargers take on the Detroit Lions in the season opener on Sept. 13.\n\"I'm ready to go,\" Te'o said. \"More importantly, I'm more mentally ready to go. Physically, I feel great. But mentally I'm way more prepared.\"\nTe'o does not know if he'll play in San Diego's final exhibition game on the road against the San Francisco 49ers.\nReceiver Dontrelle Inman also returned to practice after missing all of last week with a concussion.\nQuarterback Philip Rivers, who suffered an injury to his throwing hand against Seattle, suited up for practice, but just handed off a few times and did not throw during the early portion of practice available to reporters.\nRivers said after the game that his hand is fine and he could have played in the second half against the Seahawks if it were a regular-season game.\nOutside linebacker Jeremiah Attaochu did not practice on Monday, and appeared to suffer a right leg injury in the first half against the Seahawks.\nCornerback Chris Davis has not practiced since sustaining a concussion in the preseason opener against the Dallas Cowboys in Aug. 13.\nGuard Orlando Franklin returned to practice, but was limited. Others who did not practice include receiver Torrence Allen, guard Johnnie Troutman, center Chris Watt, outside linebacker Tourek Williams, cornerback Greg Ducre, safety Gordon Hill and inside linebacker Kavell Conner.", "source": "ESPN Feed: - blog"}