{"published": "2015-09-02T15:14:41Z", "media-type": "News", "title": "Freddie Gray case: Baltimore cops in court", "id": "27ae5d1a-2c4c-4199-a8d2-43e3f955c176", "content": "(CNN) -  \nSix Baltimore police officers charged in Freddie Gray's death are in court for a pretrial hearing Wednesday as the city braces for what could happen afterward. \n \nThe hearing comes almost five months after Gray suffered a fatal spinal injury in custody while being transported in a police van. \n\n\"Mr. Gray suffered a severe and critical neck injury as a result of being handcuffed, shackled by his feet and unrestrained inside of the (Baltimore police) wagon,\" Marilyn Mosby, the state's attorney for the city of Baltimore, said in announcing the charges in May. \n\nThe six officers face charges ranging from assault to vehicular manslaughter. All six have pleaded not guilty. \n\nAnd the case could get more complicated as attorneys for the officers have called for Mosby to drop the charges -- or at least recuse herself. They say Mosby's office had issued orders for police to crack down on the area where Gray was arrested. \n\nThe trial of the \"Freddie Gray Six\" is scheduled to begin in October. On Wednesday, the officers' attorneys will seek a ruling on the pretrial motions they have filed. \n\nSeveral things could happen during the pretrial hearing, including: \n\n• Mosby's office could be recused. \n\n• The case could be dismissed for prosecutorial misconduct. \n\n• The court could discuss how and whether the officers will be tried, together or separately. \n\nCity on alert \n\nActivists were planning protests at the Baltimore City Circuit Court's east courthouse, situated behind City Hall, and elsewhere Wednesday. About an hour before the hearing, some people had gathered outside the courthouse, holding yellow signs calling for justice in Gray's case. \n\n\"Freddie Gray didn't have to die!\" demonstrators shouted. \n\nBaltimore police hope demonstrations will stay peaceful but are taking precautions in case they don't. \n\nThe police department has canceled leave for officers Wednesday in case violence breaks out. \n\n\"We would rather err on the side of caution and have an abundance of people readily available as needed,\" Lt. Sarah Connolly said. \"We are hoping we don't need them.\" \n\nAfter Gray's funeral in April, Baltimore descended into chaos as buildings went up in flames and vandalism and looting devastated local businesses. \n\nIt was the exact opposite of what Gray's family had sought. \n\n\"I want y'all to get justice for my son,\" Gray's mother said at the time. \"But don't do it like this here.\" \n\nOfficers and charges \n\nThese are the six officers and their charges: \n\n• Officer Caesar R. Goodson Jr. is charged with one count of second-degree depraved-heart murder, involuntary manslaughter, second-degree assault, manslaughter by vehicle (gross negligence), manslaughter by vehicle (criminal negligence), misconduct in office and reckless endangerment. \n\n• Officer Garrett E. Miller is charged with one count of second-degree assault, two counts of misconduct in office and one count of reckless endangerment. \n\n• Officer Edward M. Nero is charged with one count of second-degree assault, two counts of misconduct in office and one count of reckless endangerment. \n\n• Officer William G. Porter is charged with one count of involuntary manslaughter, second-degree assault, misconduct in office and reckless endangerment.", "source": "KION 46"}