{"published": "2015-09-30T02:00:00Z", "media-type": "News", "title": "Apple sells record 13 mn iPhones in weekend launch", "id": "93ff308f-ba2b-419a-be5f-ecc580db222e", "content": "WASHINGTON, United States (AFP) -- Apple said Monday it sold 13 million of its new iPhones over the weekend, in a record-breaking launch for the latest model of its iconic smartphone. \n\n\r\nThe California tech giant began selling the iPhone 6S and 6S Plus in nine markets, including China, on Friday. \n\n\r\nOn Monday, the company said the devices will be available in 40 additional markets October 9 including Italy, Mexico, Russia, Spain and Taiwan. \n\n\r\n\"Sales for iPhone 6S and iPhone 6S Plus have been phenomenal, blowing past any previous first weekend sales results in Apple's history,\" said chief executive Tim Cook. \n\n\r\nApple has also unveiled new lease and finance terms for US customers, which analysts said could boost sales and shorten the upgrade cycle, at a time when carriers are moving away from smartphone subsidies. \n\n\r\nThe iPhone 6S and 6S Plus have the same overall dimensions as the last version, with new technologies under the hood. \n\n\r\nOne of the key new features is called \"3D touch,\" which responds to the level of pressure exerted on the screen, allowing users to apply light pressure to peek at messages and applications, and to press a little deeper to open them. \n\n\r\nThe 6S has the 4.7-inch (about 12-centimeter) display of its predecessor and the 6S Plus -- which updates one of the more popular handsets in the \"phablet category\" -- has the same 5.5-inch screen. \n\n\r\nBut the devices have more powerful processors that allow for improved graphics, harder glass and a new aluminum body. Pricing will be kept at the same levels as the earlier versions. \n\n\r\nThe record launch outpaced last year's release of the iPhone 6 and 6 Plus which sold more than 10 million, but did not include China, which was among the markets for the newest iPhone launch. \n\n\r\nAnalysts at IHS Technology project that Apple will ship 236 million iPhones this year, up 22 per cent from a year ago. \n\n\r\nIHS analyst Ian Fogg said Apple is likely to have another blockbuster quarter or two but could have trouble sustaining momentum next year. \n\n\r\n\"By the middle of next year, this look and feel will be almost two years old,\" Fogg told AFP. \n\n\r\nFor its next model, he said, \"Apple is going to have to find a way to reinvent the iPhone, and it is hard to find something that is radically new.\" \n\n\r\nApple's new phone also features upgraded operating system iOS 9, which the company says offers \"more intelligence\" while taking up less space. \n\n\r\nApple said that it will roll out the new devices to more markets in the coming weeks and that they would be available in 130 countries by the end of the year.", "source": "Jamaica Observer"}