{"published": "2015-09-29T03:30:15Z", "media-type": "News", "title": "Unlicensed title lenders defy state laws", "id": "6304b734-9fd5-4b39-85c9-cb92869d4e72", "content": "Ronald Bolos, of Warren, says he paid nearly $700 on the $300 loan he took out against his 2001 vehicle with Title Loans of Michigan. “I could’ve gone to a loan shark and gotten a better deal,” Bolos said. (Photo: Todd McInturf / The Detroit News) \n\nTwo lenders offering loans that charge consumers exorbitant, triple-digit interest rates to borrow against their cars are operating in defiance of state law in Michigan, often seizing the vehicles of desperate borrowers who can’t pay. \n\nThese unlicensed lenders are issuing auto-title loans, which charge interest rates of more than 250 percent. They require borrowers to sign over the titles to their paid-off cars and don’t issue loan documents. The borrowers typically get 25 percent or less of the vehicle’s value, and can pay thousands of dollars in interest in a year or less. In many cases, the title lender won’t advance the cash until the borrower installs a GPS unit sent by the lender, to make it easier to repossess the car. \n\nState regulators consider the loans, which are made without regard to the borrower’s ability to repay, abusive and predatory. Borrowers roll old loans into new ones an average of eight times, and 1 in 6 borrowers loses the vehicle and thus that resource to take kids to school or drive to a job, according to a study from the Center for Responsible Lending, based in Durham, N.C. \n\nWhile legal in 16 states, title loans are barred in Michigan by laws against excessive interest charges and rules that don’t allow lenders to physically take the title as a condition of the loan. Last December, some legal out-of-state auto title lenders attempted to insert a provision into the state pawnshop law to allow title loans in Michigan, but the measure died in the Legislature. \n\nBut that hasn’t stopped the unlicensed lenders — one operating in Oakland County and the other in the far-off Cook Islands — from preying on desperate people. \n\nA few weeks after that title loan legislation stalled, Ronald Bolos of Warren borrowed $300 against his 2001 Jeep Grand Cherokee from Title Loans of Michigan. \n\n“My son needed the money, and I didn’t have it,” said Bolos, who is 62 and lives on a monthly disability payment of $845. \n\nJust before Christmas, someone from Title Loans delivered the check to Bolos at his house and took his title without leaving him any documents on the loan. Bolos made his first payment of $100 to someone in a parking lot at 11 Mile and Gratiot. After that, he sent $72 a month, using the PayNearMe bill-paying service at a 7-Eleven. \n\nBolos thought the loan would be paid off by August, but was told he still owed $410.   That demand was dropped after his regular September payment, and he doesn’t know why. Bolos got his title back two weeks ago. \n\nIn all, he paid nearly $700 to borrow $300, or an annual percentage rate of 243 percent. Michigan law caps short-term loans, such as payday loans,  at 25 percent annual interest. \n\n“I could’ve gone to a loan shark and gotten a better deal,” Bolos says. \n\nAccording to a July lawsuit filed in Oakland County Circuit Court by Southfield attorney Adam Taub, Title Loans of Michigan is run by Philip Andrew Locke, incorporated as PALS Financial Group LLC. The company registered with the state as a limited liability corporation in 2013, but state records show PALS isn’t licensed as a lender of any kind. \n\n“It appears to be somebody who just figured out it was a good way to soak people with exorbitant interest,” says Taub, who sued Title Loans after another borrower’s car was repossessed. \n\nRecords from Michigan Attorney General Bill Schuette’s office show one complaint against Title Loans of Michigan, which was dismissed with a note saying “cannot assist.” \n\nRecent phone numbers for both Locke and Title Loans of Michigan are disconnected. Email and phone messages sent to the registered agent for PALS Financial weren’t returned Friday afternoon. A representative for Schuette issued an email statement that read, “In a situation where a consumer believes they have been wronged by a company or other entity, we encourage them to contact our consumer protection division.” \n\nThe attorney general’s office has received nine other complaints about title loans made by a lender incorporated on a South Pacific island that’s already run afoul of investigators in Oregon, Pennsylvania and New York. \n\nDoing business as Sovereign Lending Solutions, Title Loan America, Autoloans LLC and Car Loan LLC, the company first operated as Sovereign Lending, incorporating in 2011 under Michigan’s Lac Vieu Desert Band of Lake Superior Chippewa Indians. The tribe holds 1,269 acres in the Upper Peninsula and runs a casino in Watersmeet. Robert Salvin, an attorney with the Philadelphia Debt Clinic and Consumer Law Center, has sued Car Loans and its related companies. According to Salvin, the tribe authorized Sovereign to issue loans secured by vehicles at annual interest rates up to 390 percent. Email and phone messages to the Lac View  offices weren’t returned. \n\nIncorporating under tribal law allowed Sovereign Lending to dodge state lending laws and the tribe’s sovereign immunity under federal law foiled a lawsuit over an auto title loan brought against Craig Mansfield of Land O’ Lakes, Wisconsin, a tribe member working as Sovereign Lending’s day-to-day manager. \n\nThat tribal immunity ended Sept. 15, 2014, when the Lac Vieu Indians announced the tribe had dissolved Sovereign Lending. A “consumer alert” posted on the tribe’s website notified consumers that all liens, loans and assets had been transferred to Management Solutions LLC, which then transferred those assets to Car Loans LLC, headquartered in Rarotonga, a volcanic island that is part of the Cook Islands in the South Pacific where the principals behind a business can remain anonymous. \n\nWith its new-found anonymity, Car Loans didn’t need tribal law anymore, and simply began operating completely outside of any U.S. laws. Even where auto title loans are allowed, the rates and terms set by Car Loans and its associates far exceed the legal limit, and none of the businesses is  licensed or registered, says Althea Cullen, an assistant attorney general at the Oregon Department of Justice. \n\n“The average interest rate is around 250 percent, which vastly exceeds any interest rate that would be allowed in any state in the United States,” Cullen says. “To consumers, they call themselves Autoloans or Car Loans, and those names are in no way incorporated or even registered as doing business in any state.” \n\nAdds Cullen: “They sell illegal title loans to consumers who are in a desperate situation and are unaware of the terms of these loans. Their business is that they’re a bunch of loan sharks.” \n\nIn June, Pennsylvania’s Department of Banking and Securities traced the men behind Car Loans to South Florida, and issued a cease-and-desist order over the unlicensed title loan schemes, naming William McKibbin III, Kevin Cronin, Mark Edward Weiner and Kelly S. Bonner. The men have never answered any suits or letters, and only one lawsuit has been served on the companies, which was accepted at a virtual office center in Boca Raton, Florida. \n\nCar Loans is able to evade prosecution because the lender operates strictly over the Internet and through call centers, setting up and then shutting down websites, and working through a shifting roster of multiple mail-forwarding services, virtual offices and call centers. When borrowers can’t pay, the lender hires independent repossession services to seize the cars and sell them through wholesale auctions. \n\nThe Michigan attorney general’s records show nine complaints against Car Loan and its variations, all filed since January 2014. Six cases were marked closed because the attorney general’s office said it lacked jurisdiction, one was noted “cannot assist” and two complaints opened in January still are active. A representative for Schuette said the complaints closed for lack of jurisdiction may have been referred to other state agencies, such as the Department of Insurance and Financial Services. \n\nOf the 10 title loan complaints filed with Schuette’s office, at least three of the victims said their vehicles were repossessed. \n\nThe state financial services department is still gathering records at the request of The Detroit News, but did refer one complaint to the attorney general. That was the case of Heather Sheldon, who complained to the financial services agency on June 8. That complaint was received by the attorney general’s office on June 25. \n\nSheldon borrowed $1,500 from Autoloans in May 2014 against her paid-off 2012 Ford Escape to make rent payments. After installing a GPS unit sent by the lender to make it easier for the car to be repossessed, the money was wired to Bollar’s bank account. She paid $320 a month for 11 months, only to be told she also had a balloon payment of $2,500. \n\n“My husband and I are both on disability,” says Sheldon, 40 who lives in Ann Arbor. “The payments were outrageous but we were in that desperation mode and agreed to it.” \n\nWhile paying the loan, Sheldon said she had difficulty making one payment, and the phone rep quickly turned abusive and profane. \n\n“The man told me, ‘I don’t care. Get ...  down there and make your ...payment before I come for your truck.’ These guys would scare me.” \n\nSheldon says she paid close to $5,000, and thought she was done with the loan and could get the lien from Autoloans LLC removed from her title. \n\n“It’s not like I didn’t want to pay back what I agreed to, but once they found I didn’t have the original paperwork they started talking about this $2,500 balloon payment,” Sheldon says. “It felt like it was never going to end.” \n\nSheldon says Schuette’s office told her to stop paying on the loan and that anyone who tries to repossess her car would be stealing it. \n\nA pawn ticket sent to her later from Autoloans LLC in the Cook Islands bears an interest rate of 247.65 percent. A disclosure statement warns: “Before entering into this transaction, you should evaluate the costs and benefits of alternatives.” \n\nBut few people borrowing against their cars have any real alternative. \n\n“The reason they get away with this,” Sheldon says, “is that you’re not going to take out this type of loan unless you’re desperate.” \n\nRead or Share this story: http://detne.ws/1FyLuaP", "source": "Detroit News"}