{"published": "2015-09-04T15:05:22Z", "media-type": "Blog", "title": "New York Plastic Surgeon Creates Educational Resource to Better Serve Patients", "id": "f87dc974-4527-422c-ac4f-8c20e900fae2", "content": "New York Plastic Surgeon Creates Educational Resource to Better Serve Patients\rPosted on\r4 septiembre, 2015\rby\radmin\tin\rNotas de Prensa en Ingles\tComentarios desactivados en New York Plastic Surgeon Creates Educational Resource to Better Serve Patients\tDr. Nina S. Naidu has designed a PowerPoint on breast augmentation which serves as a user-friendly guide for  her New York City patients. New York, NY – September 4, 2015\nDr. Nina S. Naidu, board-certified plastic surgeon in New York City, has created a “Best Friends Guide to Breast Augmentation” to provide current and future patients with a digestible yet educational resource on the procedure. Aware that many people are visual learners, Dr. Naidu is in the process of building a library of visual resources to support the educational information on her website, including easily shareable resources such as PowerPoints and infographics. With this resource, Dr. Naidu focused specifically on her specialty of breast augmentation, a procedure in which the size of the breasts are enhanced. Themed towards Dr. Naidu’s brand, the guide has aesthetically pleasing colors, graphics, and design. The guide includes questions which can be asked of any plastic surgeon performing breast augmentation. It includes a step-by-step overview of the procedure including anesthesia, how to choose a breast implant shape and size, placement and incision locations, and specific details about breast augmentation recovery and common risks. Dr. Naidu hopes to demonstrate her commitment to her patients and to provide information and knowledge on breast augmentation for anyone interested in the procedure. The “Best Friends Guide to Breast Augmentation” will be readily available on Dr. Naidu’s blog and can is search engine optimized to allow all users interested in Breast Augmentation to easily find this guide online. Dr. Naidu takes great pride in providing her patients with the safest and most effective techniques to enhance their natural beauty. Dr. Naidu is an active member of the American Society of Plastic Surgeons, the International Society of Aesthetic Plastic Surgeons, and is a Fellow of the American College of Surgeons. About Dr. Nina S. Naidu\nNina S. Naidu, MD FACS is a female, board-certified plastic surgeon with her own practice in New York, NY. She is committed to providing highly personalized and compassionate care at all stages of treatment, starting from the initial consultation and continuing through to surgery and during recovery.  Dr. Naidu’s practice specializes in breast augmentation, but also offers expert care for breast reduction, breast lifts, liposuction, tummy tuck, CoolSculpting, Botox and dermal fillers. To learn more about breast augmentation or to schedule a consultation with Dr. Naidu, call 212-452-1230 or visit www.naiduplasticsurgery.com. Media Contact:\nAesthetic Brand Marketing – Jennifer Cho\nEmail: jcho@aestheticbrandmarketing.com\nWebsite: www.aestheticbrandmarketing.com Nina S. Naidu, MD, FACS Plastic & Reconstructive Surgery\nLocation: 1021 Park Avenue, New York, NY 10028\nWebsite:  www.naiduplasticsurgery.com About admin\rView all posts by admin →\t← Orange County Plastic Surgeon Designs Educational Resource to Benefit Patients\rNew York Plastic Surgeon Creates Educational Resource to Better Serve Patients →", "source": "Comunicados de Prensa"}