{"published": "2015-09-09T01:45:20Z", "media-type": "News", "title": "Anti-doping chiefs may contact French prosecutors over Toulon allegations ahead...", "id": "b3dd6474-c0e9-4044-800b-9209567bb4d7", "content": "British anti-doping chiefs could contact French prosecutors to see if their doping investigation involves players who might be competing in the Rugby World Cup. British anti-doping chiefs could contact French prosecutors to see if their doping investigation involves players who might be competing in the Rugby World Cup. Nicole Sapstead, the chief executive of the national anti-doping agency UKAD, told UK MPs: \"We have sufficient and excellent links with Interpol, Europol and our police where we can start to ask them for that kind of information and expect some reciprocal exchange of information.\n\n\"If there was any player that we felt was pulled into that issue then we would certainly be looking into it.\"\n\nUKAD is running the anti-doping programme for the Rugby World Cup, which starts in the UK on September 18.\n\nMs Sapstead's comments to the Culture, Media and Sport select committee came after Marseille prosecutors launched an investigation into several pharmacies in Toulon. It follows a notification from France's anti-doping authority Agence Francaise de Lutte contre le Dopage (AFDL).\n\nReports in France alleged Toulon players had been supplied with anabolic steroids but Toulon owner Mourad Boudjellal has angrily denied allegations of doping made against the triple European champions.\n\nMs Sapstead said World Cup players can expect \"one of the most comprehensive testing programmes the tournament has seen so far\", adding: \"The last thing a huge tournament like this wants is a doping scandal.\"\n\nMs Sapstead told the MPs that players could be tested in the UK.\n\nShe said: \"We certainly would be engaging with world rugby to decide about a testing programme for sure, absolutely.\n\n\"They are doing a comprehensive programme not just of in-competition or post-competition testing, they are doing some very extensive pre-competition testing.\n\n\"When you live in the world that we do, that is where your risk window is. It is prior to a competition.\"\n\nMr Boudjellal, a billionaire comic book magnate insists the investigation is solely centred around social security fraud and one pharmacist, not Toulon.\n\nHe has told reporters in France: \"No player is concerned in this affair, it's totally unfounded information.\n\n\"This is related to a social security fraud; that concerns the pharmacist not RCT.\"\n\nCote d'Azur powerhouse club Toulon have swept to an unprecedented three straight European titles, with England World Cup winner Jonny Wilkinson integral in the first two before retiring.\n\nWales full-back Leigh Halfpenny is among their superstar ranks, with Ireland captain Paul O'Connell set to join from Munster after the World Cup.", "source": "Irish Independent"}