{"published": "2015-09-16T22:47:00Z", "media-type": "News", "title": "Seabee Base competition promises to be muddy, messy event", "id": "bdc0db92-b7fc-4225-bd29-7cb83f9759ca", "content": "GULFPORT, MS (WLOX) - \n\nThe Seabee Base in Gulfport is getting ready to host one of its biggest fundraisers of the year, and it promises to be a sticky, grimy, messy event. This Saturday, your family can race through thick mud while helping out the military. \n\nOn Wednesday, Danny Calhan tried out a giant mud pit on Dozer Field. \n\n\"It's thick, like concrete,\" Calhan said. \n\nCalhan is the coordinator of Saturday's Seabee Mud Run, which is celebrating its 20th year. \n\n\"It's a lot harder than it looks. The mud gets thick, and with each step, your shoes are collecting a little bit more mud. By the time you cross the finish line, you've either lost a shoe or maybe two, and you're carrying a little bit more weight,\" said Calhan. \n\nMore than 1,000 people will take on this challenge, five-mile course that winds through the Seabee Base. It involves cross country, road running, an obstacle course and crawling and sloshing through two mud pits. \n\nOver at the Crane Yard, heavy equipment was used to scoop up piles of dirt, creating a pit that's four-feet deep in some areas. \n\n\"My job is pretty much fill the pits with water, flood them out, make them real muddy,\" said John Pigsley, one of the course builders. \n\nThe mud run draws active duty military, JROTC members from Louisiana to Florida and people from the community. \n\n\"That's the best part of the job is all of the months and months of hard work and seeing everyone having a good time and smiling and really enjoying themselves,\" said Calhan. \n\nThe event is also the biggest fundraiser for the annual Seabee Ball, which is coming up in March. \n\nThe pits should be ready for children and grownups who can't wait to jump in the mucky mess. The gates open at 5:30 a.m. Saturday. \n\nAll non-military people must use the Broad Avenue gate to enter the base. The competition starts at 7 a.m. \n\nThere's also a Family Fun Run that begins at 9 a.m.", "source": "WSFA"}