{"published": "2015-08-30T18:00:52Z", "media-type": "Blog", "title": "Metro Man: Top 3 September Bath Products", "id": "e2db0cf9-5940-462b-9133-25e993269139", "content": "I took inventory after emptying out my beach bag full of sand and surf and decided to clean out my medicine cabinet in preparation for the new season. I got rid of all of the old and half-used products and replaced them with several new and tested items that every man should give a try. The Art of Shaving, Orogold and Baxter of California made the list this month. #3: Your Beard Growing a full beard may think you look uber-masculine but it also sends a sign of mysterious insecurity. Shave it off. If you’ve kept the same style for over several years, it’s a protective gimmick and not showing your true self. Strangers will even pick up on this with their innate radar. The Art of Shaving has a Morris Park Collection. This line of razors will give you a close shave to reveal the true you. I suggest the royal blue razor and cartridge. http://www.theartofshaving.com #2: The Face Orogold has a product on the market called 24K Men’s Hydrating Moisturizer. Most men neglect this attention to their skin and after a summer of sun, wind and happy hour, the worst thing they can do is avoid maintenance of the largest organ on the body including the visage. The product contains 24K gold imported from Italy. After a close shave, this product protects and hydrates the skin for a fresh, healthy and youthful appearance. http://www.orogoldcosmetics.com #1: Neck Down The exfoliating body bar from Baxter of California is hands down the best soap bar that I’ve tried to date. It’s made for all skin types and contains cedar wood with dakmoss essence. What you really need to know is that granules will thoroughly remove skin problems that block pores and make it less healthy. I find this product to be helpful in maintaining a clean, masculine body. I recommend that you use it at least twice each week. The company recently teamed up with renaissance surfer Tyler Warren. Check out the collection box. http://www.baxterofcalifornia.com Originally published August 2015", "source": "Beauty News NYC - The First Online Beauty Magazine"}