{"published": "2015-09-29T13:04:10Z", "media-type": "News", "title": "Rupee Ends Higher at 65.96 on Dollar Selling", "id": "750db7ca-ff81-4024-b07e-4dc206c057c8", "content": "Mumbai : In line with equity market, the rupee on Tuesday ended nine paise higher at 65.96 against dollar on persistent selling of the US currency by banks and exporters amid sustained capital inflows. \nWeakness of dollar in the overseas market also affected market sentiment. \n\nThe rupee resumed sharply lower at 66.33 per dollar against Monday's close of 66.05 at the interbank foreign exchange market and dropped further to 66.41 on initial month-end dollar demand from importers. \n\nHowever, it recovered afterwards to 65.92 due to rise in equity market before finishing at 65.96 per dollar, showing a gain of 0.09 paise or 0.14 per cent. \n\nThe rupee has gained by 20 paise or 0.30 per cent in two days. \n\nThe US dollar weakened against the yen on Tuesday as investors moved into haven assets amid a sell-off in stocks and industrial commodities like oil and copper. The dollar also lost ground to the euro after official data showed pending US home sales fell to a five-month low in August. \n\nThe dollar index was trading lower by 0.03 per cent against a basket of six currencies. \n\nMeanwhile, the Sensex failed to maintain mid-session gains on the back of lower global cues despite a steeper-than-expected rate cut by the RBI by 0.50 per cent after its fourth bi-monthly monetary policy review for 2015-16. \n\nThe Sensex ended 161.82 points or 0.63 per cent higher. \n\nThe benchmark six-month premium payable in February fell further to 175-177 paise from the last weekend's level of 179-181 paise and for forward August 2016 also moved down further to 386.5-388.5 paise from 394-396 paise. \n\nThe Reserve Bank of India fixed the reference rate for the dollar at 66.1843 and for the euro at 74.6096. \n\nThe rupee gained further against the pound sterling to end at 100.00 from yesterday's level of 100.32, but went down to 74.03 against the euro from 73.80. \n\nThe rupee also softened against the Japanese currency to 55.03 per 100 yen from 55.00. \n\nIn forward market on Tuesday, premium for dollar eased further on sustained receiving from exporters.", "source": "NDTV"}