{"published": "2015-09-02T20:25:00Z", "media-type": "News", "title": "Seal Software Launches Version 4 of Its Leading Contract Discovery and Analytics Platform to Improve Time to Value, User Experience and System Performance", "id": "559f80b9-f57f-4657-b60a-a0668d7dbbeb", "content": "Significant Enhancements Offer New Deployment Options, Increased Platform Extensibility and Single Sign-On Capabilities \n\nSAN FRANCISCO, Sept. 2, 2015 /PRNewswire/ -- Seal Software announced today the release of its latest version of its leading Contract Discovery and Analytics solution, V4.0. This version introduces a new security framework that creates a more efficient and flexible way to deploy the solution across separate groups or users, creates stronger connections to directory services and adds single sign on to enhance user productivity. The new release will help customers enhance their ability to find their contracts, and extract all the relevant provisions, obligations, and data found within them. \n\n\"This latest round of advancements in features and functions of Seal Software's V4.0 platform were designed and developed to help our customers improve internal efficiencies so they can focus on what's most important to their businesses – maximizing revenue opportunities, mitigating risk and reducing expenses,\" said Ulf Zetterberg, CEO of Seal Software. \"We'll continue to listen carefully to our customers and enhance our platform to ensure we're meeting their current and future requirements on contract discovery, extraction and analytics.\"  \n\nEfficient and Flexible Deployment \n\nSeal Software's V4.0 platform includes new \"security trimming\" capabilities, which control user access to information based on metadata from within the contract, custom policy extraction or information from other systems. This is based on Seal's multi-tenant architecture, and allows a single instance of the software to be used across separate individuals or groups within an organization, resulting in reduced costs, less systems management and increased productivity. \n\nUser Efficiency \n\nSeal V4.0 introduces pluggable and secure connectivity to directory and data sources such as LDAP, Active Directory, JDBC, and other custom-data sources to make it easier to extend the system across enterprise infrastructures, speed implementation and enhance user authentication.  Seal has also introduced Single Sign-On (SSO) capability enabled with the use of SAML (Security Assertion Markup Language). This streamlines the user experience with just one sign-on process when using Seal Software with the company's existing ERP, Contract Lifecycle Management (CLM), and other software packages. \n\nRobust Data Extraction \n\nThere are several new features that further enhance Seal's ability to extract data from contracts. Seal Software's V4.0 benefits from improved machine learning (ML) models, libraries and methods to increase accuracy and overall system performance. It also includes the ability for users to package custom extraction policies and securely share them with other Seal users, increasing efficiency.  \n\nAlso, Seal is now providing rich extraction capabilities for French, German and Dutch language contracts with improved analytics for numeric data, including dates, durations, percentages, numbers and currency. Finally, Seal Software has made enhancements to its tabular data extraction with regard to tabbed and space separated tables, increasing the speed and accuracy to extract tabular data by 30 percent. \n\n\"Seal's V4.0 is another example of our strong commitment to research and development,\" said Kevin Gidney, Chief Technology Officer of Seal Software. \"We are continually enhancing the platform's capabilities to provide a unique and innovative solution to the growing contract discovery and intelligence market, and stay well ahead of the competition.\" \n\nV4.0 is available now from Seal Software. Additional information can be found here, or you can contact Seal at info@seal-software.com. \n\nAbout Seal Software \n\nSeal Software, the leading provider of contract discovery, extraction and analytics solutions, enables companies around the world to effectively manage their contract portfolio by understanding exactly where their contracts are when needed and, more importantly, what is buried within them, in order to maximize revenue opportunities, mitigate risk and reduce expenses. \n\nSeal Contract Discovery locates contractual documents within minutes wherever they reside within an organization and is rapidly deployable; extracting key contractual terms and clauses, rendering them for easy review, and populating corporate repositories, including Customer Relationship Management (CRM), Contract Lifecycle Management (CLM), and Enterprise Resource Planning (ERP). \n\nSeal Contract Analytics empowers clients to analyze contracts by discovering specific language and clause combinations that are most relevant to your business. The Seal platform is used within 8 out of 10 of the top Legal Process Outsourcing (LPO) providers, legal review and advisory firms, delivering increased visibility into time-critical opportunities and risks while alleviating contract review processes and technical challenges. For more information, visit Seal Software at: www.seal-software.com. Connect with Seal Software on Facebook, LinkedIn and Twitter. \n\nLogo - http://photos.prnewswire.com/prnh/20140130/SF55291LOGO \n\n  \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/seal-software-launches-version-4-of-its-leading-contract-discovery-and-analytics-platform-to-improve-time-to-value-user-experience-and-system-performance-300137176.html \n\nSOURCE Seal Software", "source": "Fat Pitch Financials"}