{"published": "2015-09-24T18:35:36Z", "media-type": "News", "title": "Assassin’s Creed Syndicate Releases New Story Trailer", "id": "70a5983f-80bf-479f-80ce-cc614088b2c9", "content": "In anticipation of Assassin's Creed Syndicate's October release, Ubisoft shares a new story trailer for the game, featuring the list of Jacob and Evie Frye's… \r \nBy Kyle Sledge | 1 min ago \n\nThe Assassin’s Creed series continues to be a boon for Ubisoft, for not only does a new entry in the franchise get released each year, but the game also has become an inspiration for creators in other mediums as well, as the series now has a movie release in the works. Even so, after last year’s launch for Assassin’s Creed Unity was infamously riddled with bugs and glitches, fans are hoping for more concerted efforts by the studio to ensure Assassin’s Creed Syndicate is up to snuff before it goes live. \n\nUbisoft has addressed the issues surrounding previous entries in the series, saying that they learned from Unity. Bearing that in mind, it’s important for the developers to provide a rock solid release with the forthcoming sequel should they wish to retain the franchise’s fan base, while also expanding their audience at the same time. To put it succinctly, Assassin’s Creed Syndicate‘s technical aspects and narrative threads need to be airtight if the franchise is to survive and thrive. \n\nSpeaking of plot, Ubisoft has given fans a taste of Syndicate‘s tale with previous footage, such as the game’s cinematic trailer revealed at E3 2015 a few months back, which mostly focused on the general tone of the environment, revealing a gloomy 1868 industrial London setting. Now, the studio is offering up a brand new video that emphasizes the league of enemies of which the title’s dual protagonists and two playable characters – Jacob and Evie Frye – must bring down on behalf of the working class in order to save the city from falling into rampant corruption. \n\nAs seen in the above clip, the twin assassins certainly have their work cut out for them, as the head of London’s Templar order, Crawford Starrick, has seven separate henchmen in his employ, all of whom have their hands in the city’s most prominent honeypots and industries holding up society. Making up the cast of villains, there’s the ruthless industrialist Rupert Ferris, the money-grubbing transportation tycoon Pearl Attaway, the mad doctor duo of John Elliotso…", "source": "MyInforms"}