{"published": "2015-09-09T12:30:00Z", "media-type": "News", "title": "Adaptimmune Announces Expansion of Senior Team to Augment Clinical Expertise and Support Growth", "id": "fa6ffc54-d50e-4441-a435-15f9c1255cf7", "content": "PHILADELPHIA and OXFORD, UK, Sept. 9, 2015 (GLOBE NEWSWIRE) -- Adaptimmune Therapeutics plc ( NASDAQ:ADAP ) (\"Adaptimmune\" or the \"Company\"), a clinical stage biopharmaceutical company focused on the use of T-cell therapy to treat cancer, today announced that it has added three new members of management to support the Company's growth and augment its clinical development expertise. \nTrupti Trivedi has joined as Vice President, Head of Biometrics, with responsibility for quantitative and computational sciences including biostatistics, bioinformatics, epidemiology, data management and computational programming across all clinical development programs; Michael Blackton has joined as Vice President, Quality Assurance and CMC, with responsibility for the quality assurance function supporting chemistry, manufacturing and controls (CMC) for Adaptimmune's clinical pipeline; and Joseph Apostolico has joined as Vice President and Global Director, Human Resources, with accountability for all human resources and recruiting initiatives across the global Adaptimmune business. The Company now has over 150 employees. \n\"Trupti, Michael and Joe bring many years of essential experience to support our growth, and I would like to welcome them to Adaptimmune,\" said James Noble, Chief Executive Officer. \"They are already contributing to the Company, and complementing well the expertise of our existing team as we continue our progress as a leader in the immuno-oncology space.\" \n   \nTrupti Trivedi brings 20 years of US and UK experience including pharmaceutical and biotechnology Phase I though IV development, academia and management consulting. She has supported over 20 global regulatory filings and 10 product launches across a range of therapy areas. Ms. Trivedi spent 18 years with GlaxoSmithKline (GSK) in roles including Vice President, Business Strategy Leader, where she led R&D-wide initiatives to support investments and patient-centric development programs, as well as VP, Biometrics and VP, Medicines Development Leader. She also previously worked for the Mitchell Madison Group, Insite Vision Biotechnology and Syntex (Roche). Ms. Trivedi earned her Master of Science degree in biostatistics from Harvard University and currently serves as Adjunct Faculty for Drexel University and an academic advisor for Harvard Innovation Lab. \n\nMichael Blackton's career spans over 25 years in biotechnology, medical device and pharmaceuticals where he has held leadership positions in manufacturing, quality, operations, and engineering. Prior to joining Adaptimmune, he spent 11 years with Eli Lilly and Company (Lilly) and ImClone (acquired by Lilly in 2008) in roles of increasing responsibility, including Associate Vice President, Validation Technical Services, where he was responsible for qualification, cleaning validation, multi-product strategies, regulatory documentation, and technology transfer initiatives supporting a portfolio of products and approvals, including CYRAMZA® (ramucirumab). Prior to joining Lilly, Mr. Blackton served in various quality management roles at Millennium Pharmaceuticals and Inhale Therapeutics. He earned his Master of Business Administration degree from New York University. \n\nJoe Apostolico brings substantial global healthcare and pharmaceutical human resources experience. He spent 28 years with GSK in roles of increasing responsibility, culminating in his tenure as Vice President, Human Resources, Pharmaceutical research and development where he led HR decision-making across GSK's global R&D organization. Among other initiatives, he established a global early talent program that included a future leadership program for biologists, chemists and physicians, and a fellowship program for clinicians. Immediately prior, he served GSK as Vice President, Human Resources, Medicines Discovery and Development. Mr. Apostolico has a Master of Management degree from Pennsylvania State University. \n\nAbout Adaptimmune \n\nAdaptimmune is a clinical stage biopharmaceutical company focused on novel cancer immunotherapy products based on its T-cell receptor platform. Established in 2008, the Company aims to utilize the body's own machinery – the T-cell – to target and destroy cancer cells by using engineered, increased affinity T-cell receptors (TCRs) as a means of strengthening natural patient T-cell responses. Adaptimmune's lead program is an affinity enhanced TCR therapeutic targeting the NY-ESO cancer antigen. Its NY-ESO TCR therapeutic candidate has demonstrated signs of efficacy and tolerability in Phase 1/2 trials in solid tumors and in hematologic cancer types. In June 2014, Adaptimmune announced that it had entered into a strategic collaboration and licensing agreement with GlaxoSmithKline (GSK) for the development and commercialization of the NY-ESO TCR program in partnership with GSK. In addition, Adaptimmune has a number of proprietary programs and its next TCR therapeutic candidate, directed at MAGE A-10, is scheduled to enter the clinic in 2015. The Company has identified over 30 intracellular target peptides preferentially expressed in cancer cells and is currently progressing eight of these through unpartnered research programs. Adaptimmune has over 150 employees and is located in Oxfordshire, UK and Philadelphia, USA. For more information: http://www.adaptimmune.com \n\nForward-Looking Statements \n\nThis press release contains \"forward-looking statements,\" as that term is defined under the Private Securities Litigation Reform Act of 1995 (PSLRA), which statements may be identified by words such as \"believe,\" \"may\", \"will,\" \"estimate,\" \"continue,\" \"anticipate,\" \"intend,\" \"expect\" and other words of similar meaning. These forward-looking statements involve certain risks and uncertainties. Such risks and uncertainties could cause our actual results to differ materially from those indicated by such forward-looking statements, and include, without limitation: the success, cost and timing of our product development activities and clinical trials; our ability to submit an IND and successfully advance our technology platform to improve the safety and effectiveness of our existing TCR therapeutic candidates; the rate and degree of market acceptance of T-cell therapy generally and of our TCR therapeutic candidates; government regulation and approval, including, but not limited to, the expected regulatory approval timelines for TCR therapeutic candidates; and our ability to protect our proprietary technology and enforce our intellectual property rights; amongst others. For a further description of the risks and uncertainties that could cause our actual results to differ materially from those expressed in these forward-looking statements, as well as risks relating to our business in general, we refer you to our Prospectus filed with the Securities and Exchange Commission on May 7, 2015. We urge you to consider these factors carefully in evaluating the forward-looking statements herein and are cautioned not to place undue reliance on such forward-looking statements, which are qualified in their entirety by this cautionary statement. The forward-looking statements contained in this press release speak only as of the date the statements were made and we do not undertake any obligation to update such forward-looking statements to reflect subsequent events or circumstances. We intend that all forward-looking statements be subject to the safe-harbor provisions of the PSLRA. \nCONTACT: Adaptimmune Contacts\n         \n         Will Roberts\n         Vice President, Investor Relations\n         (215) 825-9306\n         E: will.roberts@adaptimmune.com Margaret Henry\n         Head of PR\n         T: +44 (0)1235 430036\n         Mob: +44 (0)7710 304249\n         E: margaret.henry@adaptimmune.com", "source": "Town Hall"}