{"published": "2015-09-16T14:15:00Z", "media-type": "News", "title": "FOOTBALL: Gordon Central maintains positive outlook early", "id": "b982bad6-6eb9-4676-a185-83a4a32dfa72", "content": "Little has gone right for the Gordon Central Warriors through the first three weeks of the season as they points have piled up on the wrong side of the scoreboard en route to an 0-3 start. \n  \nBut Gordon Central coach David Humphreys said his team has maintained a positive outlook and continued to work hard despite the lack of early success. The Warriors will be tested again this Friday as they host Ringgold at 7:30 p.m. at Ratner Stadium. \n \nGordon Central (0-3, 0-1) is still looking for their first points of 2015 as they’ve been shut out by their first three opponents (LaFayette, Southeast Whitfield, Calhoun). The task doesn’t get any easier against perennial playoff contender Ringgold (1-2, 0-1), who are thought to be among the 6-AAA teams contending for a playoff spot despite their rocky start to the season. \n \nHumphreys said the Tigers pose some tough challenges and are better than their 41-17 loss to Adairsville showed last Friday. \n \n“They obviously ran into a bit of a buzz saw against Adairsville, who jumped on them quick and never let up,” said Humphreys. “They’re still a talented team. They had a couple kids out against Adairsville due to injury or other reasons. \n \n“Defensively, they’ve got some new faces so they’re going through a little youth movement like us. And they’re scheme is a little different this year as well. Offensively, they’re still going to try to throw the ball down the field and make explosive plays.” \n \nThe Warriors are coming off a 54-0 loss to Calhoun last Friday in a game that was called at the half due to weather. From the opening kickoff, Gordon Central had a tough time getting anything positive going on either side of the ball or special teams. They were held to just 77 yards, and they’re best chance at points came just before the end of the first half as they moved the ball into Calhoun territory but came up empty on an incomplete pass on the final play before the buzzer. \n \n“(Calhoun) is a darn good team,” said Humphreys. “We knew that going in, and we knew it was going to be an uphill battle. They started from the opening kickoff, and it was tough sledding from then on. We still saw some good things from our guys, though. I told them to take it one play at a time and try to learn something from those reps against a really good team.” \n \nOne of the big issues the Warriors have faced early in the season has been slow starts as they’ve gotten behind early in the first quarter and haven’t been able to get the momentum on their side. Humphreys said getting better starts is a point of emphasis for his team if they want to turn things around. \n \n“It’s extremely important,” said Humphreys. “What we have to do is be more productive with the ball and be more consistent on first down. Our offensive line has played pretty well so we need to lean on them a little more and not shoot ourselves in the foot.” \n \nRinggold has won eight of their last nine meetings with Gordon Central, with the Warriors last win in the series coming in 2012 by a 27-26 score. Humphreys said there are a few keys for Friday’s showdown that are imperative if they want to have success against the Tigers. \n \n“The first thing that stands out to me is we’ve got to control the line of scrimmage,” said Humphreys. “We also want to get our quarterback (Martavius Harris) more involved in the running game. Defensively, we’ve got to do a better job on first down not giving up several yards and getting pushed all over the field.”", "source": "Calhoun Times"}