{"published": "2015-08-11T10:52:44Z", "media-type": "Blog", "title": "Episode 21 (PART II Tom Reynolds) “Care isn’t so much “doing for” but “being with”", "id": "6a0e35ce-d914-41e8-ad3d-1feeed7e7b9f", "content": "Episode 21 (PART II Tom Reynolds) “Care isn’t so much “doing for” but “being with” Will you help support the show?\nYou can help me pay the bills by purchasing this useful and encouraging book!   Tom Reynolds, PhD   [powerpress] Shownotes: PART II\nA conversation with Vulnerable Communion: A Theology of Disability and Hospitality, author Tom Reynolds   Bio:\nTom joined the Emmanuel College (part of the University of Toronto) faculty in 2007. He is committed to an interdisciplinary, practical, and relational vision of theology, and his teaching and research address a range of topics related to constructive theology (particularly the doctrine of God and theological anthropology), theological method, intercultural and interfaith engagements, contextual theologies and globalization, philosophical theology, disability studies, and the thought and influence of Friedrich Schleiermacher. His recent Articles Email: tom.reynolds@utoronto.ca MIN 00:30 Tom on Theodicy – The question of why does God allow suffering and how should we think about suffering. 1:00 How would Tom, as a theologian answer the question, “Why would a sovereign God allow a person to be born disabled and encounter such suffering?” 2:20 The Why questions and the answers are messy, ongoing, and evolving. These answers are limited and open to ongoing revision. 3:00 Reframing needed. Question the question and its suppositions about seeing suffering first and foremost as the issue. 3:40 If we are pitying a disabled person and seeing them how we would interpret suffering, we might be off base. 4:10 Exclusion as suffering. Social suffering is something we can alleviate as the church or community. 4:40 Tom on the central questions of Theodicy. 5:30 What would a good world be? Interdependent and that holds up the preciousness and fragility of life and human experience as valuable. Good things can be fragile things. 6:30 Does God cause suffering and determine it? Maybe it’s (all) unfolding for us in mysterious ways. 7:40 Book of John, chapter 9: The man born blind. Who sinned? (disciples of Jesus thinking of blindness as a curse) So the glory of God can be revealed. (What might that mean that we haven’t understood yet. [Lisa]) The story is less about curing the disabled and more about reveal Jesus’ power and legitimacy as the Messiah. 9:20 NT Wright author of Evil and the Justice of God (on the Problem of Evil) • God as the Incarnation steps into human suffering as a means to assuage it and also, in that, provides us a model for how to encounter it in the world ourselves, practically speaking. The answers to suffering can become “incarnational”, not cerebral and (held) at a distance. 12:00 The why questions signal a (good) unsettledness which can be productive… 12:20 1. God is bigger than our questions and we should feel free to engage in dialogue with God and each other about God. 2. And because it calls us to live into the world and the lives of people will engage who ask, “Where are you?” and we can be there in presence and not (just) with answers. 13:00 “being-with” (The heart of Incarnational living.) 13:30 In many cases God’s own presence is us to each other. 14:00 “Care isn’t so much “doing for” but “being with”.” 15:00 1 in 5 families regularly encounters a serious disability of some kind. 15:30 We (as a family) chose to continue to come to church even though it was sometimes messy so he (and everyone) could figure out how to make it work. (Lisa) 16:00 How can people in Christian Communities or leaders in Christian communities do better when it comes to being truly hospitable  and caring well for people with disabilities. 17:00 Training ministers to come along side is important. 17:30 In his mission and intro to Theology class, what is framed is practical wisdom lived out in relationships of caring regard with other people. (not in the academic halls or in isolation). 18:00 On developing the perception to see/understand differently and to see places where people have been harmed by certain ways of seeing these…like the healing narratives…illness as curses from God, or metaphors of seeing and hearing language and attitudes (able-ism) for example. 18:50 How to show consideration: Asking before you assist someone. Or asking how you can best help and not presuming that you know (or know better). Listen first, then do. 19:30 Ministry doesn’t have to be deficit-focused to the “needy”…but rather possibility focused. As all people of resources and gifts [are] welcome among the community…this turns things upside-down. 20:30 Think of people as sites of wisdom that help a community of belonging. 21:00 1 Cor 12:25 Members having the same care for one another. All can care and contribute. Living out the image of God with shared affinity. 22:00 Transformative and vulnerable communion within our communities…being together. 23:20 [There is] dignity in participation. (Lisa) Allowing people to serve along side means that we are equal. 25:40 Equality isn’t sameness. Difference doesn’t mean a hierarchy. 27:40 (Tom) Music is my therapeutic other life.   A Call for Help!\nWill you help me meet my goal of raising $1,000.00 in August to keep Spark My Muse going? Use the Donate button on the left sidebar. Thank you for listening! About Spark My Muse\rLisa Colon DeLay is writer, designer, speaker, and Spark My Muse podcaster with a damp sense of humor. This website houses shownotes with links, giveaways, articles, and more.\rView all posts by Spark My Muse → Post navigation\r← God is only our name for it\rSpecial “Ask Sparky” Episode: Responses to 5 Burning Question →", "source": "Spark my Muse"}