{"published": "2015-09-17T01:39:20Z", "media-type": "News", "title": "European shares rise for second day ahead of Fed", "id": "e2ca8491-e0c6-47db-8a2a-c3c5c1009bd2", "content": "European shares rose for a second day yesterday, while investors count down to the Federal Reserve's interest rate decision due today. European shares rose for a second day yesterday, while investors count down to the Federal Reserve's interest rate decision due today. By mid afternoon in Dublin, the ISEQ Overall Index was up 0.46pc or 29.95 points to 6,500.32.\n\nThe mid afternoon leaders on the Dublin index included drinks group C&C , which was up 1.4pc to €3.44, while food ingredients company Kerry Group jumped 1.1pc to €64.72.\n\nOn the other side of the board, the laggards included insurance group FBD, up 1.3pc to €6.12, while Glanbia slipped 0.2pc to €17.29.\n\nElsewhere, the Stoxx Europe 600 Index climbed 1.3pc to 361.12 by mid afternoon in London. The measure, which has risen 5.6pc since a low in August after China devalued its currency, is still 13pc below its April peak.\n\nMultinational brewing and beverage company SABMiller soared 21pc after saying that brewer InBev intends to make a takeover proposal. The Belgian brewer jumped 9.1pc. Richemont gained 6.5pc after the world's\n\nbiggest jewellery maker said five-month sales accelerated amid higher demand in Japan and Europe. Hermes International added 3.5pc. Inditex rose 5.3pc after the owner of Zara reported a 26pc surge in profit.\n\n\"The AB InBev news shows companies are still confident to engage in M&A despite the uncertainties of what's happening with the central banks' outlook,\" said Jasper Lawler, London-based market analyst at CMC Markets. \"There's a slow-burning economic recovery but with a slight gearing towards the lower- budget end of the market, which is where Zara fits in. Inditex is capturing the kind of general trend.\"\n\nInvestors are split on what action Fed policy makers will take. Traders give a 30pc chance of a rate increase, up from as low as 26pc on Monday but still well below the 50pc odds before China roiled markets by devaluing the yuan.\n\n\"I don't think there's going to be a rate hike this time, but the markets are ready for it and even if they don't hike, the language will be quite hawkish,\" said Lawler.\n\n\"This meeting is so highly anticipated that probably even a hike would result in the following week a little lift for the markets just out of relief the meeting is out of the way.\"\n\nInvestors are also weighing a report showing US consumer prices declined in August, which may feed into the Fed's deliberations on when to increase borrowing costs.\n\nMeanwhile, on the currency front, the dollar and euro weakened against most of their major peers on sluggish data from both the US and Eurozone.\n\nPrices paid by American households declined 0.1pc in August, the first decrease since January, while in the European currency bloc they slowed almost to a standstill.\n\nEuropean Central Bank President Mario Draghi has said that officials are ready to expand the QE programme if needed.", "source": "Irish Independent"}