{"published": "2015-09-29T19:08:49Z", "media-type": "News", "title": "SiriusXM's Joe Madison to Lead New Series, \"An American Conversation -- We Are All Americans,\" on Race and Society", "id": "953f04df-08ae-4042-adc6-b9d1d923d9a6", "content": "First roundtable on the school to prison pipeline, airing October 9th  Panelists include U.S. Secretary of Education Arne Duncan, U.S. Congressman Bobby Scott, and Chancellor of D.C. Public Schools Kaya Henderson  \nPR Newswire \n \nNEW YORK, Sept. 29, 2015 \n   \nNEW YORK , Sept. 29, 2015 /PRNewswire/ -- SiriusXM today announced An American Conversation – We Are All Americans, an ongoing series focused on the need for a national dialogue about race in America. Urban View host Joe Madison (\"The Black Eagle\") will moderate the series, which will feature additional Sirius XM hosts in subsequent editions, and journey to locations around the country to facilitate this national conversation.  \n \nThe first installment, hosted from SiriusXM's Washington, D.C. headquarters, will be a roundtable discussion on a hotly debated topic in the news: the school to prison pipeline. The panel will feature leading experts from the worlds of education and politics, including U.S. Secretary of Education Arne Duncan ; Rep. Bobby Scott (D-Va.); Chancellor of D.C. Public Schools, Kaya Henderson ; Chief Judge, U.S. District Court, Richard Roberts ; and many more. \n\nMadison will lead the panelists in an in-depth conversation that focuses on improving the conditions that have contributed to pushing predominantly minority youth into the prison system. The special will debut exclusively on SiriusXM's Urban View channel 126 on Friday, October 9 th at 7:00am ET and replay multiple times throughout the weekend. ( Friday October 9 th at 8pm-Midnight ET ; Saturday October 10 th at 4-6pm ET ; Sunday October 11 th at 3-7pm , and 10pm-Midnight ET ). \n\nThe American Conversation series will continue to air throughout the year and into 2016, tackling numerous issues related to race which are critical to Americans of all backgrounds. Inspired by conversations happening within households across the country, An American Conversation aims to raise awareness about underreported issues and find actionable solutions to the problems the country faces. \n\n\" Joe Madison is kicking off a series of candid conversations with the leaders of our nation and our communities,\" said Scott Greenstein , President and Chief Content Officer, SiriusXM. \"Radio can do more than entertain and Joe is more than just a host behind a mic. He regularly travels across America to hear directly from his listeners, encouraging them to have their voices heard. This is just the start of a series where all Americans, regardless of race, religion, or political affiliation, can learn from one another and lead our nation forward.\" \n \nThe notion of not just debating serious topics, but also working with others to find solutions, aligns with Madison's lifelong passion. An activist who at just 24 was named Executive Director of the 10,000 member Detroit NAACP chapter, Madison is now a broadcaster who readily dives into the thick of the debate, making him the perfect voice for An American Conversation . On his daily SiriusXM program Joe Madison The Black Eagle (M-F, 6am-10am ET ), Joe's signature question to his audience is \"What are you going to do about it?\"  He'll now continue that mission with An American Conversation. \n\nAbout SiriusXM \n\nSirius XM Holdings Inc. (NASDAQ: SIRI) is the world's largest radio broadcaster measured by revenue and has 28.4 million subscribers.  SiriusXM creates and broadcasts commercial-free music; premier sports talk and live events; comedy; news; exclusive talk and entertainment; and the most comprehensive Latin music, sports and talk programming in radio. SiriusXM is available in vehicles from every major car company in the U.S. and on smartphones and other connected devices as well as online at siriusxm.com . SiriusXM radios and accessories are available from retailers nationwide and at shop.siriusxm.com .  SiriusXM also provides premium traffic, weather, data and information services for subscribers in cars, trucks, RVs, boats and aircraft through SiriusXM Traffic™, SiriusXM Travel Link, NavTraffic®, NavWeather™, SiriusXM Aviation, SiriusXM Marine™, Sirius Marine Weather , XMWX Aviation™, and XMWX Marine™.  SiriusXM holds a minority interest in SiriusXM Canada which has more than 2 million subscribers. SiriusXM is also a leading provider of connected vehicles services to major automakers, giving customers access to a suite of safety, security, and convenience services including automatic crash notification, stolen vehicle recovery assistance, enhanced roadside assistance and turn-by-turn navigation. \n \nOn social media, join the SiriusXM community on Facebook , Twitter , Instagram , and YouTube . To view and download SiriusXM logos and artwork, please visit SiriusXM.com/LogosAndPhotos . \n\nThis communication contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995.  Such statements include, but are not limited to, statements about future financial and operating results, our plans, objectives, expectations and intentions with respect to future operations, products and services; and other statements identified by words such as \"will likely result,\" \"are expected to,\" \"will continue,\" \"is anticipated,\" \"estimated,\" \"believe,\" \"intend,\" \"plan,\" \"projection,\" \"outlook\" or words of similar meaning.  Such forward-looking statements are based upon the current beliefs and expectations of our management and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are difficult to predict and generally beyond our control.  Actual results may differ materially from the results anticipated in these forward-looking statements.  \n \nThe following factors, among others, could cause actual results to differ materially from the anticipated results or other expectations expressed in the forward-looking statements:  our competitive position versus other radio and audio service providers; our ability to attract and retain subscribers, which is uncertain; our dependence upon the auto industry; general economic conditions; changes in consumer protection laws and their enforcement; the security of the personal information about our customers; other existing or future government laws and regulations could harm our business; failure of our satellites would significantly damage our business; the interruption or failure of our information technology and communications systems; royalties we pay for music rights, which increase over time; the unfavorable outcome of pending or future litigation; our failure to realize benefits of acquisitions or other strategic initiatives; rapid technological and industry changes; failure of third parties to perform; failure to comply with FCC requirements; modifications to our business plans; our indebtedness; and our principal stockholder has significant influence over our management and over actions requiring stockholder approval and its interests may differ from interests of other holders of our common stock.  Additional factors that could cause our results to differ materially from those described in the forward-looking statements can be found in our Annual Report on Form 10-K for the year ended December 31, 2014 , which is filed with the Securities and Exchange Commission (the \"SEC\") and available at the SEC's Internet site ( http://www.sec.gov ).  The information set forth herein speaks only as of the date hereof, and we disclaim any intention or obligation to update any forward looking statements as a result of developments occurring after the date of this communication. \n\nP - SIRI \n\nContact for SiriusXM: \nDanielle Lynn \n(212) 584.5329 \nDanielle.lynn@siriusxm.com  \n\nLogo - http://photos.prnewswire.com/prnh/20101014/NY82093LOGO  \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/siriusxms-joe-madison-to-lead-new-series-an-american-conversation----we-are-all-americans-on-race-and-society-300150964.html \n\nSOURCE  Sirius XM Holdings Inc.", "source": "Reuters"}