{"published": "2015-09-08T21:17:37Z", "media-type": "News", "title": "Ramping up technology a key for fans at NFL stadiums", "id": "34e41fcd-02ed-4a27-8a4c-33a168c16155", "content": "The Dallas Cowboys set the standard for technologically advanced NFL stadiums. The challenge to keep that unofficial title could be as tough as getting to the Super Bowl. \n \nWith new ballparks to debut in Minneapolis next year and Atlanta in 2017, keeping up with what fans want from technology is an endless process for NFL teams. \n \n''We try to do that every year, have a new offering, whether through our app or experiential,'' says Charlotte Jones Anderson, the Cowboys' executive vice president and chief brand officer. ''This year, we have a DraftKings fantasy sports lounge for our fans interested in playing and engaging in fantasy football.'' \n \nBecause AT&T is a partner and has naming rights to the Cowboys' building, Anderson believes the team has an edge in the tech world. Another corporate giant, IBM is helping design and implement the technology for the Falcons' new home. \n \nIBM is trying to make sure the infrastructure for Mercedes-Benz Stadium doesn't need to be replaced as technology advances. \n \n''It's critical to have future flexibility over time,'' says John Armstrong, North American leader for IBM interactive experience. \n \nBut it takes more than strong Wi-Fi to make football fans leave their living rooms and big screen TVs to pay for expensive tickets, parking and concessions at the stadium. . \n \nThe Cowboys think their fan app is a difference maker. It provides traffic updates, best routes into the parking lots, directions to your seat and ticket management. Fans can provide instant feedback when there is an issue such as long lines at the gates or rest room/concession problems. \n \nThe team has added touchscreens in the stadium on which fans can look up player bios, the history of the Cowboys cheerleaders, or descriptions of the stadium's art collection. \n \nIt's easier than ever to gauge what the fans want technologically, because they let teams know through social media. Many new of the Atlanta stadium's new accoutrements are based on fan feedback. \n \n''To really have the lens of the fan as the guide is challenging,'' IBM's Armstrong says. ''Certainly there are lots of things we can do technology-wise, but if you don't have the lens of the fan in mind you could almost get carried away, doing things for the sake of technological things. But the question you always must be able to answer is: Does this add to the enjoyment of the event and the experience of the fan, or is it a whiz-bang trick that is distracting?'' \n \nFalcons owner Arthur Blank has said that what the fan will experience on the first day for his stadium in 2017 will not be the same experience the next year. New stats might provide instant analysis to fans' seats. New technologies might allow new ways for fans to see or share content. \n \nHow teams deliver that info at the games could be crucial to getting fans into the seats. \n \n''They are there to see a live event and that is, foremost, the football game,'' Armstrong says. ''The Falcons and many other sports organizations are supremely focused on what it takes to create the depth for engaging their fans - to have that mindshare of the fan and the consumer.'' \n \n--- \n \nAP NFL website: www.pro32.ap.org and www.twitter.com/AP-NFL", "source": "FoxBangor.com"}