{"published": "2015-09-03T11:15:47Z", "media-type": "Blog", "title": "Presenting at the Windows Management User Group in the Netherlands", "id": "6e89bfc4-3197-477a-9816-73ceb5edbf03", "content": "Next week I have the pleasure of taking a short trip over to the Netherlands to present a couple of sessions on OpsMgr/SCOM with my friends over there from the Windows User Management Group (WMUG NL).\nThis community-driven event kicks off on Tuesday 8th September at 16:00 and runs until 21:30 that evening. The event is being hosted at the Naarden premises of well known IT services and consulting company - Pink Elephant.\nI'm really excited about this event for a number of reasons - I get to co-present for the first time with my good friend and MVP colleague Bob Cornelissen whom I know well since we worked on our first book together. Also, the rest of the team running WMUG NL - are collectively, some of the best in the business when it comes to System Center and Cloud technologies.\nThrow in the fact that the event is hosted in the Netherlands and we're onto a winner already!\nAgenda\nHere's the full agenda:\n16:00 - 16:30 -  Reception and Kick-off\n16:30 - 17:30  - Top Tips to Make Your OpsMgr Deployments Rock\n(Kevin Greene, Bob Cornelissen)\n17:30 – 18:30 - Food break\n18:30 – 19:15 - Extending OpsMgr through Microsoft Management Services and Partner Solutions (Christian Heitkamp, NiCE IT Management Solutions)\n19:15 – 19:30 - Quick Break\n19:30 – 20:30 - Essential OpsMgr Management Packs, Dashboards and Tools\n(Kevin Greene, Bob Cornelissen)\n20:30 -21:30 - Drinks and networking\nSession Info\nThe first presentation we will deliver (Top Tips to Make Your OpsMgr Deployments Rock) is targeted at the IT pro/admin/consultant whose role is to deploy different OpsMgr builds on a regular basis or who is preparing for a deployment of the upcoming OpsMgr 2016 release. In the session we will share our top tips and tricks that we've learnt along the way to help ensure your deployments and initial administration run smoothly and without any problems.\nIn our second presentation (Essential OpsMgr Management Packs, Dashboards and Tools) we will discuss and demonstrate some of the 'must-have' OpsMgr management packs, dashboards and tools that are available for free and which we think everyone should know about to help them with their day-to-day monitoring tasks.\nRegistration\nIf you're in the Netherlands and are using (or thinking about deploying) OpsMgr, then this free community event is definitely for you. More information about the event can be viewed from the WMUG NL site here.\nThere are still some places left but the audience size is limited so make sure to register soon if you're interested and the direct link for registration can be found here.\nHopefully I'll see some of you over there next week!\nChatten binnenkort!", "source": "Kevin Greene IT Blog"}