{"published": "2015-09-11T01:02:58Z", "media-type": "News", "title": "Veterans Swim with (Whale) Sharks", "id": "0f001b34-0d3b-4610-abfe-617684a655fd", "content": "Wounded service members enjoyed an afternoon in the water with whale sharks, manta rays, and a variety of fish. Wounded Warrior Project® (WWP) took the injured veterans to Georgia Aquarium as part of the nonprofit organization's Alumni program. The event allowed the service members a chance to enjoy the unique swim while learning more about WWP. \n\nhttps://photos.prnewswire.com/prnvar/20150911/265621 \n\nWWP's mission is to honor and empower Wounded Warriors. The WWP Alumni program creates support through shared experiences. Injured veterans can see other veterans dealing with the same challenges they may face. This interaction can give them someone to relate to while they heal from injuries from their time spent on the battlefield. \n\n\"Swimming in the aquarium let me forget about all of my problems,\" WWP Alumnus Ian Coyne said. \"I have back issues and while I was in the tank it all went away.\" \n\nWWP Alumnus Jaclyn Baker says the opportunity helped her achieve something on her bucket list, becoming scuba qualified. \"The swimming event encouraged me to seek my open water certification to do the dive portion of the event,\" Baker said. \n\nFor Coyne, spending time with other wounded veterans served as one bright spot. \"I had not met any of them yet or seen them at other events before. It is always great meeting up with fellow soldiers,\" Coyne said. \n\nHe also experienced another highlight. \"The whale shark getting up super close and touching you at times,\" Coyne said. \"I don't want to say it was scary, but exhilarating may be the best word.\" \n\n\"The highlight for me was while swimming the whale sharks would get close and bump you,\" Baker said. \"I was also impressed with the size of the manta rays.\" \n\nAbout Wounded Warrior Project The mission of Wounded Warrior Project® (WWP) is to honor and empower Wounded Warriors. WWP's purpose is to raise awareness and to enlist the public's aid for the needs of injured service members, to help injured servicemen and women aid and assist each other, and to provide unique, direct programs and services to meet their needs. WWP is a national, nonpartisan organization headquartered in Jacksonville, Florida. To get involved and learn more, visit woundedwarriorproject.org. \n\nABOUT GEORGIA AQUARIUM Georgia Aquarium in Atlanta is a 501(c)(3) non-profit organization that contains more than 10 million gallons of water and has the largest collection of aquatic animals. Georgia Aquarium's mission is to be a scientific institution that entertains and educates, features exhibits and programs of the highest standards, and offers engaging and exciting guest experiences that promote the conservation of aquatic biodiversity throughout the world. Georgia Aquarium is an accredited member of the Association of Zoos and Aquariums and the Alliance of Marine Mammal Parks and Aquariums. For additional information, visit www.georgiaaquarium.org. \n\nPhoto - http://photos.prnewswire.com/prnh/20150911/265621 \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/veterans-swim-with-whale-sharks-300141412.html \n\nSOURCE Wounded Warrior Project \n\nhttp://rt.prnewswire.com/rt.gif?NewsItemId=DC99354&Transmission_Id=201509102050PR_NEWS_USPR_____DC99354&DateId=2015", "source": "Individual.com"}