{"published": "2015-09-24T03:58:33Z", "media-type": "News", "title": "‘Super blood moon’ to give stargazers a rare show", "id": "35841799-1020-468a-9056-c5f4ee09ae73", "content": "by Joshua Melvin\n\nParis (AFP) | 24 September 2015 2:40 \n\nThe celestial show, visible from the Americas, Europe, Africa, west Asia and the east Pacific, will be the result of the Sun, Earth and a larger-than-life, extra-bright Moon lining up for just over an hour from 0211 GMT. \n\n“It will be quite exciting and especially dramatic,” predicted astronomer Sam Lindsay of the Royal Astronomical Society in London. \n\n“It’ll be brighter than usual, bigger than usual.”\n\nThe Moon will be at its closest orbital point to Earth, called perigee, while also in its brightest phase.\n\nThe resulting “supermoon” will look 30 percent brighter and 14 times larger than when at apogee, the farthest point — which is about 49,800 kilometres (31,000 miles) from perigee.\n\nUnusually, our planet will take position in a straight line between the Moon and the Sun, blotting out the direct sunlight that usually makes our satellite glow whitish-yellow.\n\nBut some light will still creep around Earth’s edges and be filtered through its atmosphere, casting an eerie red light that creates the “blood moon”. \n\nThe Moon travels to a similar position every month, but the tilt of its orbit means it normally passes above or below the Earth’s shadow — so most months have a full moon minus eclipse.\n\nFor people younger than 33, this will be their first-ever chance to see a “super blood moon”.\n\nThe last, only the fifth recorded since 1900, was in 1982, according to the NASA space agency, and the next will not be until 2033.\n\nIf the weather holds, that is — the spectacle would not be visible behind cloud cover. \n\n– ‘Gloom and doom’ Moon –\n\nOn top of the wow factor, the event is also of great interest for researchers.\n\nOver a 24-day cycle, the temperature on the surface of our satellite normally ambles between highs of about 121 degrees Celsius (250 degrees Fahrenheit) in direct sunlight, and lows around minus 115 C in the shade. \n\nThese changes help researchers study the composition of the crust, as rocks warm and cool slower than sand-like dust.\n\nBut on Monday, the eclipse will see that temperature shift happen over the eclipse’s duration — confining the observable change to the very outer surface, said Noah Petro, deputy project scientist for NASA’s lunar orbiter. \n\n“That almost instant change tells us about the upper few centimetres of the surface. We’re getting a very fine, unique measurement of the uppermost surface,” Petro told AFP.\n\nMonday’s “blood moon” will be the last in a string of four total lunar eclipses since April 15, 2014, in a series astronomers call a tetrad. \n\nThese phenomena may be a normal part of the celestial calendar today, but for many ancient peoples it was an omen of bad things to come.\n\n“Throughout history many cultures have seen (eclipses) as being a sign of gloom and doom,” Petro said.\n\nThey weren’t always wrong.\n\nIn February 1504, explorer Christopher Columbus used a blood moon to trick Jamaican natives who had been feeding him and his men, but cut them off when relations turned sour.\n\nColumbus knew a blood moon had been forecast, and warned the natives that his god would send an angry “sign” at their treatment of the newcomers.\n\nLegend has it the natives came running with food as soon as the Moon turned red.\n\nUnlike a solar eclipse, which creates the impression of a bright “ring” of light as the Moon passes before our star, there is no danger in watching Monday’s lunar spectacle with the naked eye, the experts say.\n\n© 2015 AFP", "source": "South Coast Herald"}