{"published": "2015-09-01T05:00:00Z", "media-type": "News", "title": "Protect Your Eyes and Health from Harmful “Blue Light”", "id": "8260ffbf-1f03-4142-a3dd-b164dd399e56", "content": "(StatePoint) You already know to protect your eyes from harmful UV-light when you are outdoors. But did you know that another dangerous light emission is all around us -- in our homes, our workplaces and in the palms of our hands? \n  \nNew research is illuminating the dangers of blue light , a high-energy wavelength of light emitted by smartphones, tablets, laptops, LCD flat panel monitors and energy efficient light sources. The majority of the public spends more than half their waking hours exposed to this light, which can contribute to eye strain and fatigue, macular degeneration and sleep disruption. \n \n“Ten years is a blink of an eye in terms of human history, but will the last 10 years come to be known as the period that changed our vision and health?” wonders Dr. Gary Morgan a VSP Vision Care optometrist.  \n \nA whopping 83 percent of VSP eye care professionals reported seeing an increase in symptoms attributable to blue light exposure in their patients, according to a recent survey by VSP. \n \nOne of those symptoms is eye strain: blue light is myopically defocused in front of the retina, which results in light scatter that we perceive as glare. Working in a high-glare environment causes the eyes to work overtime, leading to visual fatigue and strain. \n \n   But the impact of blue light doesn’t stop there: major university studies have shown that the light can disrupt sleep, interfering with circadian rhythms by suppressing the production of melatonin, a hormone that regulates waking and sleeping. Chronically shifted circadian rhythms have been linked to breast cancer, prostate cancer, diabetes, heart disease and obesity. \n \nChildren are especially vulnerable to macular damage. Just as most ultraviolet exposure occurs before 18 years of age, the effects of blue light exposure are also more intense in children, since they hold devices in very close proximity to their eyes and are amongst the most active users of blue light sources. \n \n“In today’s world, children are looking at screens at home and increasingly also in the classroom,” says Morgan. “There is a growing concern among eye doctors that we're going to start seeing long-term damage much earlier in life than ever before.” \n \nWhile it would be virtually impossible to escape blue light, as most people rely on it to live, work and play (and it is even emitted from the sun), there are steps you can take to protect yourself. Try to decrease blue light exposure throughout the day, and especially in the evenings. Before bedtime, curl up with a good book instead of your smartphone. Wear protective eyewear at the office or at home when using your digital devices. \n \nNew lens enhancements for eyeglasses, such as Sharper Image TechShield, can provide a unique defense by absorbing and deflecting incoming blue light to help safeguard the wearer against exposure. \n \nMore information about the effects of blue light and protection options can be found at vsp.com/sharper-image-techshield-lenses.html . \n \nBlue light illuminates our world today. But along with the advantages of blue light come serious concerns. Protect your family’s health now. \n \nPhoto Credit: (c) iStock.com/pixdeluxe", "source": "Miami County Republic"}