{"published": "2015-09-28T18:15:00Z", "media-type": "News", "title": "Textron Systems Awarded Contract to Provide an Additional 55 COMMANDO(TM) Select Armored Vehicles to Afghan National Army", "id": "b506de30-5121-49e6-b649-70471ea46282", "content": ") - Textron Systems Marine & Land Systems, a Textron Inc. (TXT) business, announced today a $56.2 million firm-fixed-price contract from the U.S. Army Contracting Command, Warren, Mich., to supply 55 additional COMMANDO™ Select four-wheeled armored vehicles to the Afghan National Army (ANA). \n\nThe vehicles are being contracted through the U.S. Army Foreign Military Sales (FMS) process. Work will be performed in Slidell, La., with vehicle deliveries beginning in October 2015 and completing by February 2016.\n\nThis latest FMS order of COMMANDO Select vehicles for the ANA will be configured in three variants: 36 equipped with Objective Gunner Protection Kits; 15 with enclosed 40mm/.50 caliber turrets; and four ambulance vehicles. \n\nCalled Mobile Strike Force Vehicles (MSFV) by the ANA, these vehicles will be deployed in support of security operations throughout the country. More than 630 of these vehicles have been delivered to the ANA since 2012.\n\n\"Since being put into service by Afghan National Army Kandaks (battalions) several years ago, ANA soldiers have experienced the exceptional mobility, survivability and overall performance these vehicles are known for,\" said Tom Walmsley, Marine & Land Systems senior vice president and general manager. \"This additional supply of vehicles will support Kandaks currently operating MSFVs, so that existing ANA vehicle inventory can be rotated in for regular service and maintenance work.\" \n\nRigorously tested and proven in the toughest environments, the COMMANDO family of vehicles -- including Elite, Select and Advanced lines -- offers a range of protection options, unmatched on-road/off-road mobility and ample firepower. As an end-to-end solutions provider, Textron Systems also offers customers vehicle fielding, training, maintenance and logistics support services throughout each vehicle's life cycle.\n\nAbout Textron Systems\n\nTextron Systems' businesses develop and integrate products, services and support for aerospace and defense customers, as well as civil and commercial customers including those in law enforcement, security, border patrol and critical infrastructure protection around the globe. Harnessing agility and a broad base of expertise, Textron Systems' innovative businesses design, manufacture, field and support comprehensive solutions that expand customer capabilities and deliver value. Textron Systems consists of its Advanced Information Solutions, Electronic Systems, Geospatial Solutions, Lycoming Engines, Marine & Land Systems, Support Solutions, TRU Simulation + Training, Unmanned Systems and Weapon & Sensor Systems businesses. More information is available at www.textronsystems.com.\n\nAbout Textron Inc\n\nTextron Inc. is a multi-industry company that leverages its global network of aircraft, defense, industrial and finance businesses to provide customers with innovative solutions and services. Textron is known around the world for its powerful brands such as Bell Helicopter, Cessna, Beechcraft, Hawker, Jacobsen, Kautex, Lycoming, E-Z-GO, Greenlee, Textron Systems, and TRU Simulation + Training. For more information visit: www.textron.com.\n\nCertain statements in this press release may project revenues or describe strategies, goals, outlook or other non-historical matters; these forward-looking statements speak only as of the date on which they are made, and we undertake no obligation to update them. These statements are subject to known and unknown risks, uncertainties, and other factors that may cause our actual results to differ materially from those expressed or implied by such forward-looking statements, including, but not limited to, our ability to perform as anticipated and to control costs under contracts with the U.S. Government; changes in foreign military funding priorities or budget constraints and determinations, or changes in government regulations or policies on the export and import of military products; volatility in the global economy or changes in worldwide political conditions that adversely impact demand for our products; and performance issues with key suppliers or subcontractors.\n\nCOMMANDO is either a registered trademark or trademark of Textron Inc. in the United States and/or other countries.\n\nThe following files are available for download:\n\nVehicle Image 1Contact:Media \n\nPublic Relations Team \n\nTextron Systems \n\n(978) 657-2020 \n\nPublicRelations@textronsystems.com", "source": "Yahoo! Finance UK and Ireland"}