{"published": "2015-09-28T11:40:41Z", "media-type": "News", "title": "Vtesse, Inc. Initiates Phase 2b/3 Clinical Trial of VTS-270 for Treatment of Niemann-Pick Type C1 (NPC) Disease", "id": "819d4a68-7a08-4129-af95-7a7d6124aac2", "content": "SOURCE Vtesse, Inc.\n\n- During its first year of operations, Vtesse advances lead program into late-stage, pivotal trial and launches www.theNPCstudy.com\n\n- Goal is to establish a clear foundational data set on the safety and efficacy of VTS-270 for treatment of NPC\n\nGAITHERSBURG, Md. \n\nNPC is a progressive, irreversible, chronically debilitating – and ultimately lethal – genetic disease. It is caused by a defect in lipid transportation within the cell, which leads to excessive accumulation of lipids in the brain, liver and spleen. Vtesse has worked extensively with regulators in the United States \n\nBen Machielse, Drs., President and Chief Executive Officer of Vtesse, Inc., said, \"Starting the pivotal clinical trial for VTS-270 within nine months of the company's launch underscores our dedication to serve the NPC community. A key ingredient that enabled us to start the trial so quickly is the complete package of high-quality pre-clinical data that clearly outlines the potential benefits of VTS-270, such as prolonged survival and preservation of neurons, as well as encouraging clinical data from the Phase 1 trial. The pivotal trial will allow us to further evaluate safety and efficacy of VTS-270 to build a foundational dataset for the NPC community.\"\n\nHe added, \"While initiation of the first site at Rush University \n\nVtesse's Phase 2b/3 prospective, randomized, double-blind, sham-controlled trial of VTS-270 will be conducted in patients affected by NPC disease. The trial will take place in up to 20 centers in the United States \n\nPreliminary analyses of the Phase 1 trial, conducted post-hoc, suggest that the rate of disease progression had slowed down (based on a standardized measure) in children treated with VTS-270 as compared to the rate in an age- and disease severity-matched cohort obtained from a separate natural history study of NPC patients.\n\nThe VTS-270 pivotal study addresses a pressing need to discover new treatments for the disease, according to Forbes D. Porter \n\n\"The recent analysis of the preliminary Phase 1 clinical data for VTS-270 has provided encouraging support suggesting this treatment for NPC may be able to alter the course of this fatal disease,\" said Elizabeth Berry-Kravis, M.D., Ph.D., Co-Principal Investigator of the Phase 2b/3 study, and Professor of Pediatrics, Neurological Sciences, Biochemistry, Rush University Medical Center. \"The beginning of patient screening for the pivotal Phase 2b/3 study for VTS-270 marks another important step in the journey toward targeted treatment of NPC, as clinical trials are the only means to determine the effectiveness of VTS-270. This pivotal trial will allow us to gather the data required to advance the regulatory process and move toward U.S. Food and Drug Administration (FDA) and European Medicines Agency (EMA) approval for VTS-270.\"\n\nMore information on this Phase 2b/3 study can be found at Vtesse's clinical trial website: www.theNPCstudy.com. Vtesse launched the website this summer as a resource to patients, parents, caregivers and physicians. For more information on enrollment criteria, please see: www.theNPCstudy.com/trialenrollment. \n\nAbout VTS-270\n\nVtesse's lead compound, VTS-270, has shown promise in pre-clinical and clinical studies as a potential treatment for NPC. It is a well-characterized mixture of (2-hydroxypropyl)-beta-cyclodextrin that has been extensively evaluated in pre-clinical and clinical studies at the National Institutes of Health, as well as under individual compassionate-use Investigational New Drug applications (iINDs) and in other academic labs. Most recently, Vtesse announced positive clinical results from the on-going Phase 1 study that demonstrated VTS-270 stabilizes the overall measures of NPC while improving certain disease measures. NPC is a genetic disease affecting an estimated one in 100,000 to 150,000 children and is often misdiagnosed and/or under-diagnosed. Affected patients are usually identified in early childhood with ataxia, exhibit progressive impairment of motor and intellectual function, and often die before adulthood. \n\nAbout Vtesse\n\nVtesse, Inc. is a rare disease company dedicated to developing drugs for patients suffering from diseases that are underserved. Vtesse is working collaboratively with the NIH and other leading academic centers to advance clinical study of VTS-270 for NPC, and to conduct pre-clinical discovery and development of other novel drugs for NPC and other lysosomal storage diseases (LSDs). Vtesse is led by a highly experienced management team that has been involved in the development of more than 20 approved drugs and vaccines. Its experienced consortium of investors, led by New Enterprise Associates, has committed initial funding that is expected to bring this compound through pivotal clinical trial. Vtesse is based in Gaithersburg, Maryland \n\nLogo - http://photos.prnewswire.com/prnh/20150106/167294LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/vtesse-inc-initiates-phase-2b3-clinical-trial-of-vts-270-for-treatment-of-niemann-pick-type-c1-npc-disease-300149479.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "12 News Now"}