{"published": "2015-09-22T12:48:22Z", "media-type": "News", "title": "Macrocure  Shares Down 5.3%  (MCUR)", "id": "b0d7e85e-7206-4e57-8dd6-138e96b7e4d0", "content": "Macrocure (NASDAQ:MCUR)’s share price traded down 5.3% during trading on Monday , MarketBeat.Com reports. The stock traded as low as $3.92 and last traded at $3.96, with a volume of 126,650 shares trading hands. The stock had previously closed at $4.18. \n \nSeveral equities analysts have commented on the stock. Nomura lowered shares of Macrocure from a “buy” rating to a “neutral” rating and lowered their target price for the stock from $20.00 to $6.00 in a report on Thursday, August 20th. Zacks raised shares of Macrocure from a “sell” rating to a “hold” rating in a research note on Monday, September 14th. Credit Suisse  reissued a “buy” rating on shares of Macrocure in a research report on Monday, August 10th. Jefferies Group downgraded shares of Macrocure from a “buy” rating to a “hold” rating and cut their price objective for the stock from $14.00 to $6.00 in a research report on Thursday, August 20th. Finally, Oppenheimer cut shares of Macrocure from an “outperform” rating to a “market perform” rating and set a $20.00 target price for the company. in a research note on Thursday, August 20th. Five analysts have rated the stock with a hold rating,  The company presently has an average rating of “Hold” and a consensus target price of $9.25. \n \nThe company has a 50 day moving average price of $7.04 and a 200-day moving average price of $10.28. The company’s market capitalization is $66.16 million. \n \nMacrocure (NASDAQ:MCUR) last posted its earnings results on Tuesday, August 4th. The company reported ($0.37) EPS for the quarter, meeting the Zacks’ consensus estimate of ($0.37). During the same quarter last year, the firm posted ($0.59) earnings per share.  On average, equities analysts anticipate that  Macrocure will post ($1.38) earnings per share for the current fiscal year. \n \nMacroCure Ltd. is a biotechnology company. The Company is focused on developing, manufacturing and commercializing cell therapy products to address unmet needs in the treatment of chronic and other hard-to-heal wounds, such as diabetic foot ulcers ( NASDAQ:MCUR ) and venous leg ulcers (VLUs). Its product candidate, CureXcell, is an advanced wound care (AWC) therapy to treat such wounds by injecting living human white blood cells that have been activated to facilitate the healing process. CureXcell is in two pivotal, Phase 3, double-blind clinical trials targeting an indication for the treatment of DFUs and VLUs. The Company holds product approval for CureXcell as a medical device in Israel for the treatment of chronic and other hard-to-heal wounds.", "source": "SleekMoney"}