{"published": "2015-09-02T14:00:00Z", "media-type": "News", "title": "Ramornie mourns for teen crash victim Kiara Joe", "id": "3cae8b97-64b7-45ae-b3ec-5874036ebda0", "content": "TRIBUTES have flowed for much-loved Ramornie teenager Kiara Joe, who died in a car crash this week. \n \nThe 17-year-old Grafton High School student was driving north on Ramornie Station Rd sometime before 6.40pm on Tuesday, when the vehicle she was driving left the roadway and crashed into a tree. \n \nThe passenger of the Toyota Rav 4, an 18-year-old girl, was treated at the scene by paramedics before being taken to Grafton Base Hospital with non-life-threatening injuries. \n \nPolice said findings from a forensic assessment would be passed down to the coroner, but no suspicious circumstances had been identified. \n \nOn social media, Clarence Valley residents their dismay at another young life lost on our roads. \n \nLauren Young, Cheryl Bryant and Lucie Campbell were among those that sent their condolences to the family. \n \n\"Fly high beautiful angel, God has a new shining star,\" Ms Young wrote. \n \nFriend JoJo Newby said she was devastated to wake up to the news yesterday morning. \n \n\"Kiara was one of those people who added a little warmth to everyone's life,\" she said. \n \n\"I went to Pony Club with her as a kid and she would rock up on these rough looking bush horses and then out-ride everyone there... always with a grin on her face. \n \n\"She was a modest, warm, kind-hearted kid and as she grew up nothing much changed. The Joe family are the nicest, most generous kind of people you could ever hope to meet. \n \n\"It's just heartbreaking to think that something like this has happened to such an incredibly wonderful family.\" \n \nA statement from Grafton High School revealed counselling has been arranged for students and staff, and will continue as necessary. \n \n\"The school extends its deepest sympathy to the family and friends of Kiara Joe, who died in a tragic road accident overnight,\" it read. \n \n\"Kiara was very well loved and respected by staff and students.\"", "source": "Queensland Times"}