{"published": "2015-09-18T19:25:55Z", "media-type": "News", "title": "Your Heartache Does Not Make You Interesting (It's a Drag)", "id": "4c65bf6b-ff10-4af8-88a3-35c55a02e071", "content": "Seems like a no-brainer, but it's a bad idea to point out your flaws on a first date. Or a second date. Or on your dating profile. Or, when you're on The Bachelor . Despite what you may think, your pain does not make you interesting, or attractive. And recounting your past hurts makes you a self-involved bore. \n\nWhen you lead with your own tale of woe and personal injury, you're basically saying to the world, and your date, I'm a yawning black hole of need and pain. Abandon hope, all ye who enter here. \n\nHoward Stern, a big fan of The Bachelor who talks about it on his show, once recapped the story of the chick who was sent home after her first date with Bachelor Juan Pablo because of this fatal error: She killed the romantic mood by putting her insecurities front and center. \n\nUh-oh. And? (You can hear the dude trying to stop her from going there.) \n\nWell (sniff), she had had her heart broken by a former fiance, and she was so sad, and is over it now (not), but really wants to make sure there's a connection. \n\nTranslation: I want to be absolutely sure you won't hurt me like he did. \n\nThis is what I call the World Owes Me approach. The World Owes Me: love, security, a perfect mate. You dump your heartache like a busted old alarm clock onto the table and ask the guy to fix it, and to promise it will never break again. \n\nIt makes as much sense as asking a new friend for $100 because your last friend never paid you back. \n\nIt's no mystery why she did it; she was trying to bring the man closer, to find in him a trustworthy soul to love, care for, and protect her. But: She doesn't know this man. And he doesn't know her. Stern said, These girls have daddy issues, and he's probably right. He wants to desire her, but she's more concerned with being \"safe\" from emotional harm, and in so doing skewers the desire. \n\nMy ex-boyfriend wronged me. If there's a bigger boner shrinker, I don't know it. \n\nI know it's hard to hear this, but I'll say it anyway: The world does not owe you love, affection, intimacy, or a perfect partner. This is Earth, not a fine dining establishment, and you cannot just order up a dish and then be all bent out of shape when it doesn't just show up as you sit there, starving. We're all brown bagging it. \n\nThe world is full, however, of the potential for love. And you have the potential to love and be loved—if you're willing to take the risk of getting hurt in the process. However, when you define yourself as damaged and drag around your heart like an open wound, you attract pity and sorrow, not love. No one wants damaged goods. \n\nAs Esther Perel says in her fab TED Talk , \"There is no neediness in desire.\" \n\nThis doesn't mean someone can't or won't care for you, period. It doesn't mean that you should pretend you were never hurt by anyone. No one's buying that act. But the urge to spill your guts out and earn someone's pity does not work in your favor. \n\nI have seen this in too many online profiles: Daters using the essay portion of the online dating process as a back history of past disappointments and rage, even a warning to others (\"If you think football's that important, don't bother!\" or \"Two timers need not apply!\"). \n\nIf your online profile is a chronology of your personal injuries and presents you as a victim, you need to rewrite it. Previously married and want to own up? Fine. But you should not be working out any unresolved emotional issues ON YOUR DATING PROFILE or ON DATES. [Read also: Don't Put that Picture in Your Dating Profile .] \n\nSave it for your therapist. Your mother. Me, even. But please, spare your dates—and give desire a chance to thrive. \n\nVisit territrespicio.com for more content like this + to sign up for my newsletter and receive a free copy of my e-book \"Take the WORK Out of Networking,\" about how to make better connections in business and in life (it totally works for dating, too). \n\nPhoto courtesy of fotographic1980 / freedigitalphotos.net", "source": "Huffington Post"}