{"published": "2015-09-20T07:25:24Z", "media-type": "News", "title": "Voting starts in Greek election with Alexis Tsipras narrowly ahead in polls", "id": "dd96bc7e-be33-4014-9ef9-bb8c2100ffc0", "content": "Aurora man killed in morning shooting  \nDaily Herald - Sunday 20th September, 2015 \n \nReyna, who lived elsewhere, was at the home with another person at the time of the shooting and the weapon may have been accidentally discharged, police said.  ... \n   An Olympic-sized effort at OHare  \nDaily Herald - Sunday 20th September, 2015 \n \nDeputy Ari Briskman of the Lake County sheriff's office and the rest of his team pull a UPS Airbus A300 12 feet Saturday at O'Hare International Airport for an event benefiting Special  ... \n   Images An Hour in Mount Prospect  \nDaily Herald - Sunday 20th September, 2015 \n \nRandhurst Village, an open air shopping center that also includes restaurants, a movie theater and night life, is at Elmhurst Road and Euclid Avenue in Mount Prospect.  ... \n   Suburban leaders blast possible Chicago congestion tax  \nDaily Herald - Sunday 20th September, 2015 \n \nMichael Sneed in the Chicago Sun-Times , Chicago Alderman Ed Burke recently persuaded Mayor Rahm Emanuel \"to study the feasibility and logistics of collecting a congestion fee from suburbanites  ... \n   Chicago Ridge says goodbye to officer killed in off-duty crash  \nChicago Tribune - Sunday 20th September, 2015 \n \n?Dozens of police officers from area departments led a funeral procession Saturday for Chicago Ridge officer Steven Smith who died in an off-duty car  ... \n   Police-fire basketball game at Berto Center raises cash for Gliniewicz family  \nChicago Tribune - Sunday 20th September, 2015 \n \nOfficer Anthony Kropp, left, and firefighter Joe Miller compete for the ball during a game to benefit the family of Charles Joseph \"G.I.Joe\"  ... \n   Fire does $175000 damage to unoccupied Lockport house  \nChicago Tribune - Sunday 20th September, 2015 \n \nDoors and windows are boarded up at a Lockport home after an early Saturday morning fire left it uninhabitable. (Frank Vaisvilas, The Daily  ... \n   Former Elmwood Park employee gets prison time for health care fraud  \nChicago Tribune - Sunday 20th September, 2015 \n \nA suburban Chicago woman has been sentenced to nearly four years in prison for her role in a $4 million health care fraud scheme. The Justice Department announced Saturday that U.S.  ... \n   Police say fatal shooting in Aurora might be accident  \nChicago Tribune - Sunday 20th September, 2015 \n \nA 25-year old man was shot and killed in Aurora Saturday morning in what police says may be an accident.Aurora police were called at 7:12 a.m. for a gunshot victim inside a residence in  ... \n   Extra rest suits Rodon well in gem against Tribe  \nChicago White Sox - Sunday 20th September, 2015 \n \n's turn in the rotation in an effort to limit the lefty's workload in his rookie season. Upon his return, Rodon made up for lost time with the second-longest start of his short career.  ... \n   Thompson part of promising group of White Sox rookies  \nChicago White Sox - Sunday 20th September, 2015 \n \nTrayce Thompson was boarding a plane to Cleveland dressed as Will Ferrell's \"Jackie Moon\" character from the movie Semi-Pro, participating in the team's annual tradition of  ... \n   White Sox pick off Indians late rally  \nChicago White Sox - Sunday 20th September, 2015 \n \nclosely monitoring his work load , held the Tribe to one run over 7 2/3 innings, ending with four strikeouts and one walk. The 22-year-old left-hander's lone blemish came courtesy of a  ... \n   Maddon Rondon ejected after Cubs 3rd HBP  \nChicago Cubs - Sunday 20th September, 2015 \n \nGreg Garcia with a pitch, and that ended his outing after four pitches plus revived bad feelings between the NL Central rivals. The Cubs went on to  ... \n   Russells amazing stop shows off Cubs potential  \nChicago Cubs - Sunday 20th September, 2015 \n \nAnthony Rizzo said after the victory. Sure, this was just one play in one game. But it was so much more. Even if you already view Russell's game-ending force play as the  ... \n   Russells dive drops Cards as Cubs close  \nChicago Cubs - Sunday 20th September, 2015 \n \nAddison Russell making a spectacular diving play to end the game as Chicago posted a 5-4 win Saturday over the Cardinals. The Cubs are now five games behind the Cards in the NL Central and are  ... \n   Bryant ties Cubs rookie record with 25th HR  \nChicago Cubs - Sunday 20th September, 2015 \n \nKris Bryant had tied Billy Williams for the most home runs by a Cubs rookie in a single season. He found out from reporters on Saturday after the  ... \n   Ramirez pumped to return to mound  \nChicago Cubs - Sunday 20th September, 2015 \n \nIt's been a frustrating season for Ramirez, who was surprised by the shoulder issues. \"At this point, I'm just competing with what I've got,\" Ramirez said.  ... \n   Rizzo Maddon ready to move on from HBP  \nChicago Cubs - Sunday 20th September, 2015 \n \nMatt Belisle hit him with a pitch in the seventh inning on Friday. But on Saturday, both the Cubs' first baseman and manager Joe Maddon felt the incident was over, and it was time to move on.  ... \n   Watch Chicago Cubs Star Kris Bryant Drive a Lyft Undercover to Surprise Fans  \nTime - Sunday 20th September, 2015 \n \nThe excitement of ride-hailing apps is that you never know who’s right around the corner coming to pick you up. It might even be your city’s favorite new sports star.  ... \n   Late goal sends Orlando City to win in Chicago  \nOrlando Sentinel - Sunday 20th September, 2015 \n \nOrlando City's Cyle Larin advances the ball past Chicago Fire's Razvan Cocis during a game on September 19, in Bridgeview, IL. (Patrick Gorski / Chicago  ...", "source": "Chicago News.Net"}