{"published": "2015-09-29T12:55:24Z", "media-type": "News", "title": "86% of US Households Own at Least One HDTV; 60% of Consumers Now Prefer LED HDTV Technology", "id": "4da78b67-da7e-4044-9030-bda477b1909c", "content": "PR Newswire \n \nODESSA, Texas, Sept. 29, 2015 \n   \nODESSA, Texas , Sept. 29, 2015 /PRNewswire/ -- A recent study by ShoppingNexus.com found that 86% of US households own at least one HDTV (high definition television). 64% of respondents claim to own two or more HDTVs. \n\nPhoto - http://photos.prnewswire.com/prnh/20150928/271631 \n\nPhoto - http://photos.prnewswire.com/prnh/20150928/271632  \n\nWhen asked about technology preferences, respondents showed favor to LED (light-emitting diode) displays. 60% stated that LED HDTV technology is more favorable than other options, including LCD or \"liquid-crystal display\" (26%) and plasma technology (14%). \n \nWith regard to making purchase decisions, price (30%), brand (28%), and TV size (16%) are the most important factors for consumers. Also, HDTV reviews (12%) were cited by many shoppers as relevant factors to consider during the purchasing process. \n\n\"We continue to see more consumers turning to the Internet to find the best HDTV deals,\" said Brian Meyer , President of Shopping Nexus.  \"The majority of those we polled start their searches online (as opposed to shopping in a brick and mortar store). While many (34%) turn to Amazon.com or other online retailers first, a sizeable percentage (17%) utilizes an online comparison website, such as ShoppingNexus.com.\" \n\nWhile brand was cited by 28% of consumers as the most important determining factor when purchasing an HDTV, few (7%) describe themselves as \"very brand loyal.\" It seems that the majority (58%) of respondents prefer to shop for the best price among a select group of household brand names. \n \nIn addition to sharing opinions about HD flat panel technology, participants were also asked about \"curved\" HD televisions. Only 3% of consumers are \"actively considering\" the purchase of a curved HDTV. The vast majority (70%) of those surveyed would not seriously consider a curved HDTV. \n\nTo download the executive summary report for this study of 461 consumers, visit: http://www.shoppingnexus.com/cart/hdtv-study/ .  \n \nAbout Shopping Nexus \n\nShopping Nexus is a leading online price comparison website. The site serves as a free resource to help consumers make each dollar go further. Shoppers around the globe trust Shopping Nexus as their alternative to traditional shopping malls. Since 2010, over 3 million people have used Shopping Nexus to find the best deals on electronics, apparel, toys, jewelry, and more. Shopping Nexus allows consumers to instantly compare products and find the best price. The company's proprietary system automatically identifies the best price on the web, even taking into consideration item cost and freight. \n\nMedia Contact: \nBrian Meyer \n9405945865 \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/86-of-us-households-own-at-least-one-hdtv-60-of-consumers-now-prefer-led-hdtv-technology-300150524.html \n\nSOURCE  Shopping Nexus", "source": "Reuters"}