{"published": "2015-09-21T13:29:00Z", "media-type": "News", "title": "Sky Makes Additional Investment in Jaunt", "id": "35e580ba-92b6-45df-a204-c8dca5be0fc2", "content": "SAN FRANCISCO, CA -- (Marketwired) -- 09/21/15 -- Sky (LSE: SKY) has invested a further $0.9 million in Jaunt, the company pioneering cinematic virtual reality (VR), as part of its latest round of funding. This brings the total investment made by Sky in Jaunt since 2013 to $1.65 million. \n\nBased in California's Silicon Valley, Jaunt leads the industry through its unrivalled end-to-end solution for creating and distributing premium live action VR. The content can be played on a wide variety of devices, including common smartphones, as well as VR goggles like Facebook's Oculus Rift. The technology delivers a highly immersive experience, enabling viewers to enjoy a truly 360 degree stereoscopic view, where audiences are placed -- literally -- at the centre of the action. It's the world's most immersive omnidirectional VR experience. \n     \nSince Sky's initial investment, the two companies have tested the technology on a number of Sky original productions, including Critical, Penny Dreadful, Trollied, Fortitude and Got to Dance, as well as sports including boxing and motor racing. Sky has also worked with Jaunt and Warner Bros to create cinematic VR clips from The Hobbit set and red carpet London premiere in 2014. \n\nOver the next 12 months, Sky will work with Jaunt to film even more original virtual reality content. \n\nThe additional funding for Jaunt is part of Sky's ongoing programme of investing in innovative startups that help Sky bring new ideas, insight and services into its business. This follows recent investments in leading online sports network Whistle Sports, Pluto.TV, the online video aggregator and the US ad tech firm Sharethrough. Sky has previously invested in a number of other pioneering US technology companies, including the IP streaming service provider Roku and the OTT video delivery firm, 1 Mainstream. \n\nFurther details of our investments and Sky's US office can be found here. \n\nStuart Murphy, Director of Entertainment, Sky commented: \n\"Jaunt are the pioneers of Cinematic VR. The market is developing lightning fast so it is brilliant for us to be hand in glove with the team right at the cutting edge. It's been amazing working with them over the last two years as we begin to see the technology take off. We are developing some exciting plans for how we can create some amazing viewing experiences for Sky customers.\" \n\nJens Christensen, CEO and co-founder, Jaunt commented: \n\"With the support of world class partners like Sky, this latest round of funding will allow us to advance the scope of cinematic VR for filmmakers, storytellers and audiences alike. We will build on our leadership position to deliver amazing VR experiences using best-in-class tools, technology and creative teams.\" \n\nFor further information, please contact: \n\nAbout Sky \nSky is Europe's leading entertainment company. The group serves 21 million customers across five countries: UK, Ireland, Germany, Austria and Italy. We offer the best and broadest range of content, deliver market-leading customer service and use innovative new technology to give customers a better TV experience, whenever and wherever they choose. \n\nSky has annual revenues of over £ 11 billion and is Europe's leading investor in television content with a combined programming budget of over £ 4.9 billion. The company employs 30,000 people and is listed on the London Stock Exchange (SKY). \n\nFor more information visit www.sky.com/corporate \n\nAbout Jaunt \nJaunt is pioneering the future of creative storytelling through cinematic virtual reality. Founded in 2013, Jaunt is the leading developer of the hardware, software, tools, and applications to enable cinematic VR and put the power of virtual reality in the hands of today's best content creators. In addition, Jaunt works with leading creatives - from brands to artists to filmmakers - to create cutting-edge content through its studio arm, Jaunt Studios. Headquartered in Palo Alto, California, the company also maintains a presence in Los Angeles and produces branded and original VR content for audiences worldwide. Jaunt's investors include The Walt Disney Company, Evolution Media Partners, CMC Capital Partners, Highland Capital Partners, Google Ventures, Redpoint Ventures, Axel Springer, ProSieben, The Madison Square Garden Company, Peter Gotcher, Blake Krikorian, and Sky. Experience more at www.jauntvr.com .", "source": "Marketplace"}