{"published": "2015-09-16T13:26:00Z", "media-type": "News", "title": "State agencies join efforts to encourage student voter registration", "id": "63519127-b2fc-4d25-8de0-fda02886977b", "content": "HARRISBURG, Pa., Sept. 16, 2015 /PRNewswire-USNewswire/ -- The Pennsylvania Department of Education and Department of State have undertaken a joint initiative to encourage voter registration among eligible students throughout the Commonwealth.\n\nThe agencies, along with the Pennsylvania State System of Higher Education (PASSHE), are working together to provide a range of voter registration information and guidance to students and staff at high schools, colleges and universities statewide.\n\n\"Our message to young people is that voting is central to their participation in our democracy,\" Secretary of State Pedro A. Cortés said. \"We want to instill in our youth the importance of exercising this most basic right of citizenship from the day they become eligible.\"\n\nWith the recent addition of online voter registration, applicants of every age have more options than ever before. Online voter registration, available at register.votesPA.com, makes the process more convenient, accessible and secure.\n\n\"Our schools are now educating the 'technology generation' who have grown up using Internet-based tools and devices,\" Education Secretary Pedro A. Rivera said. \"The online voter registration championed by Governor Wolf and implemented by Secretary Cortés is the latest example of how Pennsylvania is integrating 21st century technology in state government, and will help spark civic engagement in our students.\"\n\nWhile a voter must be 18 in order to cast a ballot, applicants can register in advance if they will turn 18 by Election Day. With that in mind, high school teachers are being encouraged to integrate lessons and discussions about voter registration in civics and social studies classes.\n\nThe State Library of Pennsylvania, a bureau of the Department of Education, is also participating in the effort by disseminating information to libraries statewide.\n\nPASSHE is encouraging colleges and universities to incorporate on their websites a direct link to the online voter registration site and is helping spread the word about the availability of the new registration option.\n\n\"There are more than 100,000 students enrolled at our State System universities across the Commonwealth, the vast majority of whom live in Pennsylvania and will remain here after graduation. They represent Pennsylvania's future, and it is important that they be engaged in their communities,\" PASSHE Chancellor Frank Brogan said. \"Voting is an important part of that engagement, and is a way each of us can truly influence our own futures. Registering to vote – something you can now do easily online – is the first step in that process.\"\n\nThe Department of State is also planning a Twitter Town Hall to mark National Voter Registration Day on Tuesday, Sept. 22. From noon to 1 p.m., Deputy Secretary for Elections and Administration Marian K. Schneider will answer questions about online voter registration. To participate, use the hashtags #RegisterOnlinePA and #CelebrateNVRD.\n\nTo learn more about online voter registration, check the frequently asked questions at votesPA.com. MEDIACONTACT: Wanda Murren, (717) 783-1621\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/state-agencies-join-efforts-to-encourage-student-voter-registration-300144076.html\n\nSOURCE Pennsylvania Department of State", "source": "Yahoo! News"}