{"published": "2015-09-19T03:18:47Z", "media-type": "News", "title": "10 ways you're helping your child fail in school and don't even realize it", "id": "29d9ebb9-8196-4701-a431-0edd1645723f", "content": "School can be difficult. But are you encouraging or hindering your child's success? Here are 10 habits you may not realize are damaging to his or her success in school. 1. Forget about tomorrow morning. Let her stay up late! It’s not like she needs a full nights’ rest to do well in school; she can sleep in her desk! Besides, she hates bedtime and it’s so much easier to let her stay up with you and watch some of those funny late night television shows. 2. Don’t ask her about her homework every day or how school is going. You don’t want to be a nag. She’s probably got it all figured out and will get great grades without your getting involved. 3. Don’t worry about grades until a week or two before they come out. You have plenty of time! Your schedule is too busy anyway to be bogged down with your child’s education. If she misses class or a few assignments here and there, the teacher will gladly accept them until the last day of the term and if he doesn’t, you can just call the principal and she’ll sort it all out. 4. Yell at your child until she gets her homework done. Ground her and take away her cell phone. That’s how you really get someone motivated to work hard. If she complains, tell her you walked to school uphill both ways in the snow with no shoes; she’ll quickly realize that she’s being ungrateful and get right to work. 5. Don’t worry about attending Parent-Teacher Conference. That teacher couldn’t have anything helpful to say about how she is doing in his class. After all, what did he do with his life? He’s just a teacher. He better just shape up and do what you say, after all; you’re the parent and you pay taxes. 6. Whenever she has a doctor or dentist appointment, be sure to make that appointment during her hardest class. It will give her a much needed break and it’s not like you’re worried about her making up the work. That’s the teacher’s problem, not yours. 7. Don’t worry about whether your child has breakfast before she heads to school. School is early enough; it’s not worth getting up earlier to make breakfast. Besides, it’s not like learning is a bodily function; it’s more of a brain function. Page 2 of 2 - 8. Don’t praise your child if she does something well in school; it will just go to her head. Your job is to motivate her by pointing out only the things she does wrong. After all, if you don’t say it, who will? 9. If you have a complaint, always go straight to the top! Principals love to get involved in every little situation; that’s why they’re called princi-“pals.” 10. Don’t worry about setting a good example of continued learning. You already went to school! Been there, done that. You have too much work to do now to fit in reading a good book or showing your child that you still love art. Never talk about what inspired you to get where you are today; that will just bore her.", "source": "Canton Repository"}