{"published": "2015-09-15T13:05:18Z", "media-type": "News", "title": "Carbon Black is the Number-One Endpoint Detection and Response Solution According to SANS Survey", "id": "2212e63b-6969-447e-95c9-61721c355c5a", "content": "WALTHAM, MASS., Sept. 15, 2015 (GLOBE NEWSWIRE) -- Bit9® + Carbon Black,® the market leader in endpoint threat prevention , detection and response , today announced that Carbon Black is the number-one endpoint detection and response (EDR) solution according to a SANS survey of IR professionals. The survey asked: \"What vendor products are you currently using and evaluating for your incident response efforts, including forensics?\" Carbon Black was the choice of 68 percent of respondents. \n\n\"Carbon Black is the first and only EDR platform that delivers continuous endpoint recording, customized detection, live response, remediation, and threat banning,\" said Eric Schurr, chief marketing officer for Bit9 + Carbon Black. \"It also is the first EDR solution to offer both on-premises and SaaS deployment options, for maximum customer flexibility.\" \n\nThe SANS' report, The Race to Detection: A Look at Rapidly Changing IR Practices, identifies the top capabilities on survey respondents' wish lists to combat today's threats: \n\n• Endpoint visibility \n• Ability to integrate with other best-of-breed products \n• Lightweight footprint for their software solutions \n\n\"After seeing what IR pros consider their 'must-have' capabilities for detecting and responding to advanced threats and targeted attacks, it's no surprise Carbon Black is their top choice,\" said Schurr. \"Carbon Black delivers everything IR professionals are asking for and more. The survey results reflect exactly what our customers, prospects and partners tell us—Carbon Black is the clear leader in the endpoint detection and response market.\" \n\nAbout Bit9 + Carbon Black \n\nBit9 + Carbon Black is the market leader in next-generation endpoint security. The company expects that by the end of 2015 it will achieve $70M+ in annual revenue, 70 percent growth, 7 million+ software licenses sold, almost 2,000 customers worldwide, partnerships with 60+ leading managed security service providers and incident response companies, and integrations with 30+ leading security technology providers. Bit9 + Carbon Black was voted Best Endpoint Protection by security professionals in the SANS Institute's Best of 2014 Awards, and a 2015 SANS survey found that Carbon Black is being used or evaluated by 68 percent of IR professionals. Companies of all sizes and industries, including more than 25 of the Fortune 100, use Bit9 + Carbon Black to increase security and compliance. \n\nBit9 and Carbon Black are registered trademarks of Bit9, Inc. All other company or product names may be the trademarks of their respective owners. \n\nA photo accompanying this release is available at: http://www.globenewswire.com/newsroom/prs/?pkgid=36054 \n   CONTACT: Kevin Flanagan \n         Bit9 + Carbon Black \n         +1 781-856-2589 kflanagan@bit9.com Paul Doyle\n         Lois Paul and Partners\n         +1 512-638-5313 bit9@lpp.com", "source": "RCL Advisors"}