{"published": "2015-09-22T15:10:16Z", "media-type": "Blog", "title": "What Is 'Public' Education? - Bridging Differences - Education Week", "id": "518c2cb5-bdb4-4021-b873-3cad6965c022", "content": "What Is 'Public' Education? - Bridging Differences - Education Week: What Is 'Public' Education? \nDear Harry and friends,\nIt's good to get back to a schedule with deadlines.  After a lifetime of deadlines this retirement life is sometimes harder to enjoy than it ought to be. \nHarry Boyte is a very old friend, although not as old as I am.  We've always been sort of on the same page but coming to it from different dispositions, life experiences and ways of seeing the world.   As a result I often turn to him when I'm perplexed and worried for the possibility that he can come up with a way of looking at the issues that gives me a new thread to pull at.\nOur basic commitment to democracy has posed problems for us both, as you will discover.  We've \"played\" with it in different venues and settings, with occasional shared ones.  That helps.   Harry has managed to make life even more difficult for himself (and helpful to me) by having a longstanding and personal commitment to the saga of South Africa.\nBut we're going to tackle the complexity of the idea itself--as a way of living as well as a way of governing, and in the process we hope to help our friends and allies reexamine their positions around public schooling so that, at the very least, we are all on something closer to the same side than we often are now.  How can we define public in a democracy in such a way that it helps us separate the efforts to privatize education and the efforts to figure out how to more successfully provide an education for democracy for all of us? \nLucky are those who can go to a free public school, close to home, where they can feel confident that their child is in good hands, with people you can trust, and with people who will take your concerns seriously and respectfully.   How to give professionals the respect and autonomy they want while you, their family, doesn't have any reason to fear that their autonomy will be used against their children's and their own best interests?  While also...still another hitch--expecting the larger public to pay the bill.  \nEven families who have the means and desire to pay for  private school make compromises--but they have choices when and if the compromises become intolerable.  What about the rest of us?  Is choice an answer?  Or does it simply lead to pretending that an unequal market place is equally good for rich ad poor, white and black, atheists and the devoutly religious?   Of course, Harry, we may not end up covering all this, since as we go along we may discover many interesting bypaths--like when is representative democracy best vs direct?  Who should be \"included\"--the custodian, the cook?  Which tax payers?    And on and on.....\nDear Deb and colleagues,\nI have always greatly appreciated your passion for democracy as the most important end of education, as well as your  deep respect for teachers' roles, and your view of education as a living, relational, consequential activity that should \"liberate the powers\" of each student, in Dewey's phrase.\nWe also have differences on what is \"public\" education and what erodes it. My story helps to explain.\nI was shaped as a young white southerner in the 1960s by my family's involvement in the \"civil rights\" movement. I also agree with Martin Luther King's friend Vincent Harding, who said in Hope and History, \"civil rights movement is too narrow a description...in fact [the movement] was a What Is 'Public' Education? - Bridging Differences - Education Week:", "source": "Big Education Ape"}