{"published": "2015-09-29T20:37:46Z", "media-type": "News", "title": "Vpark V-Box 30w in Limited Stock at Ave40! Only $59.9!!!", "id": "e5d08897-e65e-4f87-ae7c-2ecc50a09a7c", "content": "- A compact vape kitVpark V-Box 30whas been newly released by Vpark! As an authorized supplier of Vpark,Ave40has just get this Kit in limited stock and you are able to do your purchase with us now! Retailing at a price of $59.9 and wholesaling at a much lower price, its definitely worth your try. \n\nThis V-Box 30 Kit is composed by a V-Box 30w Mini box mod and a Maxtank Mini sub ohm tank. The V-Box 30w box mod supports wattages ranging from 5 to 30w and resistances ranging from 0.3 to 2 ohm. It features a bright LCD display on which you are able to monitor the wattage, time you vape on and battery status as well. Unlike other mechanical mods, this 30w mod sports a built-in lithium battery and the micro USB pass-through charging port on it is designed with the feature of dust proof.\n\nThe Maxtank on the top is a sub ohm tank of 2.0ml capacity to hold the e-juice. It sports a top filling design, making the refilling much easier with no leakage. Its built-in atomizer sports a resistance of 0.5 and can produce huge vapor working together with the V-Box 30w. Innovatively, this tiny tank sports an airflow control function on both the top and the bottom, and its bottom vertical dual coil can be replaced without detaching the atomizer. Made of pyrex glass, the tank also features a seen-through oil chamber. \n\nYou will never want to miss out on this new guy. Go towww.ave40.comdirectly for immediate purchase, your order will be shipped within 3 working days. Wholesalers please email toinfo@ave40.comfor detailed information, and your order will be preferred with good prices provided to you according to the quantity you order. Lets get this V-Box 30w and keep vaping on!\n\nProduct Features:\n\nMaxtank mini:\n\nSize:60*18mm\n\nTop filling\n\nPolished stainless steel\n\nCloud vapor production\n\nBVDC(Bottom vertical dual coil),Resistance:0.5ohm\n\nStandard 510 thread with spring-loaded center pin\n\nAirflow control on both top and bottom\n\nV-box 30w mini :\n\nSize:55*41*22mm\n\nAluminium alloy\n\nWattage range:5-30W\n\nOhm range:0.3-2.0ohm\n\nBright LCD display: Wattage/Time log/Battery Status\n\nDust-proof micro USB pass-through charging port\n\nBuilt in lithium battery\n\nStandard 510 thread with spring-loaded center pin", "source": "Digital Producer"}