{"published": "2015-09-22T22:36:14Z", "media-type": "News", "title": "Syrian refugees arrive in UK", "id": "dbf6e47c-2352-4c6d-bc0b-a9397a08e4a1", "content": "Britain has welcomed the first of the 20,000 Syrian refugees that it has pledged to relocate from camps in countries neighbouring the war-torn nation, according to the government.\nThe post appeared first on… \r \nSyrian refugees arrive in UK \n\nUK, London: Natalie Bennett MP of the Green party talks to a reporter. Thousands of people turned out for the Solidarity with Refugees march on September 12, 2015, at which the new Labour leader Jeremy Corbyn MP also spoke. The march went from Marble Arch to Westminster, calling on the government to do more to help refugees fleeing from war in Syria to Europe. Corbyn made his inaugural speech as leader of the Labour party, having won the role earlier in the day. (AAP Image/NewZulu/Hugh unningham). \n\nLondon [AFP \n\n] \n\nBritain has welcomed the first of the 20,000 Syrian refugees that it has pledged to relocate from camps in countries neighbouring the war-torn nation, according to the government. \n\n‘Today a number of people have arrived in the UK as part of the Vulnerable Persons Resettlement scheme,’ said a Home Office statement on Tuesday. \n\nThe government would not give details of how many refugees had arrived, or where in Britain they would be resettled. \n\nUnder the expanded scheme, the new arrivals will receive housing, access to medical care and education and will be granted five years’ humanitarian protection. \n\nAfter that period they will be able to apply to stay in Britain. \n\nPrime Minister David Cameron announced earlier this month that Britain would take 20,000 refugees from camps in Jordan, Lebanon and Turkey over the next five years after coming under fire for an apparent reluctance to take measures to ease the crisis sweeping Europe. \n\nBritain had accepted 216 Syrian refugees under the scheme before this month’s announcement and has granted asylum to almost 5,000 Syrians since the Syrian conflict broke out in 2011 – far fewer than countries like France, Germany and Sweden. \n\nEuropean Union ministers on Tuesday pushed through a deal to relocate 120,000 refugees, but faced fierce opposition from central and eastern states. \n\nBritain is exempt from EU asylum and migration policy and Cameron had already made it clear that the country would not be involved in any quota system. \n\nCameron visited Syrian refugee camps in Lebanon and Jordan last week, pledging increased aid which he said would help stem the migration crisis in Europe. \n\nThe surprise visits, which included talks with Lebanon’s prime minister and the king of Jordan, came as Cameron appointed a minister to oversee the resettlement of the 20,000 refugees. \n\nCroatia urges Serbia to redirect migrants \n\nMeanwhile, Croatian Prime Minister Zoran Milanovic has urged Serbia to resume directing migrants to Hungary and Romania to help ease the burden on his own country. \n\nMilanovic told reporters it was still possible for refugees to be sent to Croatia, but ‘my message to them (Serbia) is … also to send them to Hungary, Romania. \n\n’ \n\n‘We are not…", "source": "MyInforms"}