{"published": "2015-09-23T13:30:10Z", "media-type": "News", "title": "The American Law Journal Television Program Wins Emmy Award for LGBT...", "id": "6ab2a532-ceaa-4d82-86e4-1c8f6c09f5b9", "content": "Christopher Naughton, Esq. & Valerie Jones, Recipients of MidAtlantic Region Emmy Award for television programming \n  We’re honored to be recognized by our broadcast peers for programming excellence  \n\r Philadelphia, PA (PRWEB) \r September 23, 2015 \r \n\n The American Law Journal television program brought home Emmy® statuettes for the category Interview/Discussion Program/Special. The awards ceremony of the National Academy of Television Arts and Sciences MidAtlantic Region was Saturday, September 19 in Philadelphia. \n \nExecutive Producer and Host Christopher Naughton, Producer Valerie Jones and Director of Production Andrew Schaeffer won for the program “Sexual Orientation, LGBT & The Workplace: ‘ENDA’ of Discrimination?” \n \n“We’re honored to be recognized by our broadcast peers for programming excellence,” says Naughton. “Our programming focus for more than two decades is to inform, entertain, and help viewers understand how the legal system impacts their daily lives.” \n \nThe television program was also nominated in three addtional categories: \n \nOn-Camera Talent - Program Host/Moderator for Naughton, attorney, former New Jersey prosecutor and corporate in-house counsel. \n \nFor Naughton, Jones, Schaeffer and feature reporter Gina Passarella Cipriani, also senior staff reporter American Lawyer Media’s newspaper The Legal Intelligencer, the additional nominations were for the programming categories Politics/Government - News Single Story or Series on the Pennsylvania Supreme Court scandal and Interview/Discussion Series on child custody issues relating to children’s use of social media and “high tech” devices. \n \nThe American Law Journal, a legal talk and feature program, celebrates 25 years on the air with the fall season beginning Monday evening October 19 on the Philadelphia CNN affiliate WFMZ-TV.  The program is produced live with viewer calls or taped in studio at WFMZ or on location including The National Constitution Center, law schools, and historically significant venues. Covering consumer, business and Constitutional issues, the program can also be viewed on http://www.youtube.com/LawJournalTV . \n \nAbout the MidAtlantic Emmy® awards \n \nThe 33rd Annual Mid-Atlantic Emmy® Awards were presented Saturday, September 19, 2015, in front of a soldout crowd at the Philadelphia Hilton on City Avenue in Philadelphia. Also honored was The Fred Rogers Company who received the Board of Governors Award for outstanding contributions to the television community.  The award ceremony, the largest attended in the MidAtlantic Chapter’s history, took place at the Philadelphia City Line Hilton. \n  \nShare article on social media or email", "source": "PRWeb"}