{"published": "2015-09-28T21:58:52Z", "media-type": "News", "title": "Marine predators take bite out of climate change", "id": "da410283-08d9-4a19-9670-4dcf4c118fe8", "content": "SOURCE Florida International University \n\nMIAMI \n\nCoastal habitats full of vegetation, including seagrass beds, salt marshes and mangroves, are some of the best absorbers of atmospheric carbon dioxide, according to FIU marine scientists Mike Heithaus \n\nMany of the world's oceans are experiencing significant declines in predator populations due, in large part, to overfishing. Without adequate numbers of predators, grazers, such as turtles, are left to roam and devour vegetation freely, also disturbing sediments and soils. This is of particular concern considering that sediments are excellent at storing carbon.\n\n\"People typically think of predators and people as being in conflict,\" said Heithaus, who also serves as the dean of FIU's College of Arts & Sciences. \"But the presence of marine predators is good for us in many ways. They help to preserve ecosystems that support human uses like fisheries. And the evidence continues to stack up that their contributions to the long-term stability of these ecosystems can help mitigate climate change through preserving carbon stores.\"\n\nIn the past 50 years, land-use changes, climate change and other factors have resulted in the loss of as much as 50 percent of the world's vegetated coastal habitats. The effects can be seen throughout the world. In Cape Cod, Mass. \n\n\"Scientists and policy makers around the world are just beginning to understand the importance of carbon stored in coastal vegetated habitats to climate policy,\" said Fourqurean, an international advocate for the Blue Carbon initiative - storage of carbon in seagrasses and other coastal habitats. \"This new study highlights how fisheries practices have a surprising and strong impact of the stability of the coastal carbon stores. In effect, fishing activities can influence the rate of global climate change.\"\n\nFor a picture, please click here. Media Contact: JoAnn C. Adkins\n\n305-348-0398\n\nnews.fiu.edu \n\n@FIUNews\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/marine-predators-take-bite-out-of-climate-change-300150094.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KRHD TV"}