{"published": "2015-09-15T15:04:00Z", "media-type": "News", "title": "Amazon's Bezos Announces Plan To Build, Launch Rockets From Florida", "id": "c603c0dc-c0fb-4b8a-8963-eafa31069a36", "content": "In a new expansion of commercial efforts to launch earthlings into space, Amazon.com founder and CEO Jeff Bezos plans to build rockets on Florida's Space Coast — in an area he calls \"a gateway to humankind's greatest adventures.\" \n\nSpeaking at the Cape Canaveral Air Force Station, Bezos outlined a new chapter for Blue Origin , the private aerospace company he founded more than a decade ago. He also described how he caught \"the space bug\" by watching Saturn V rockets launch from the cape's famed launch site. \n\nThose launch pads have been dormant for 10 years, Bezos said, adding that it's \"too long — we can't wait to fix that,\" in a comment that drew applause from the crowd. \n\nBlue Origin will work toward putting people into orbit around the Earth from Cape Canaveral, relying on reusable orbital launchers that will be built in Florida. The American-made BE-4 rocket engines that Blue Origin plans to use will also be tested at the facility. \n\nAt today's event, the billionaire Bezos was accompanied by Gov. Rick Scott and Sen. Bill Nelson — who flew into space aboard the space shuttle in the 1980s — along with other officials and guest speakers. \n\nBy committing to base its operations in Florida, Blue Origin will create 330 jobs and add more than $200 million into the local economy, Scott said. More than 10 other states had been competing to become the site of the Blue Origin expansion, officials said Tuesday. \n\nBezos did not discuss when the first launches might take place. Blue Origin recently said that it hopes to qualify the engine for flight in 2017, with the first flight of the Vulcan rocket system planned for two years later. \n\nThe company says that testing of the BE-4 engine has been underway \"for more than three years and testing of the BE-4 components is ongoing at Blue Origin's test facilities in West Texas.\" \n\nIn April, Blue Origin carried out the first test flight of its reusable New Shepard space vehicle at its Texas facility.", "source": "Wyoming Public Media"}