{"published": "2015-09-28T12:39:10Z", "media-type": "News", "title": "Alan Johnson: British exit from EU would be a disaster", "id": "99eb828b-55c1-4f56-840d-6ea3a0ff19e7", "content": "Everyone would be damaged and diminished if Britain were to leave the European Union, Alan Johnson has claimed as he declared \"the fight to stay in Europe starts today\". \n \nThe leader of Labour's EU referendum campaign told the party conference in Brighton that David Cameron could not dictate the timetable for the crunch poll. \n \nMr Johnson said: \"Who will gain from our departure? Certainly not British workers or businesses or consumers. Certainly not universities or our scientists. All will be damaged and diminished along with our security and our environment. \n \n\"This campaign won't be won by politicians lecturing from on high, it will be won by local people campaigning in every community in the land.\" \n \nHe told activists: \"That campaign has to start now, not at any unspecified time in the future determined by David Cameron. And not because we believe the EU is a perfect institution - such a thing doesn't exist - and it is not because we want to preserve the status quo. \n \n\"But reform is a process, it's not an event. The way to achieve reform is through patient argument, building alliances, playing our part, not sulking near the exit door muttering threats and insults - the Boris Johnson school of negotiation.\" \n   Promoted stories   \nMr Johnson said leaving the EU would be a disaster. \n \nHe said: \" To leave a European Union of 28 member states after 40 years of increasing interdependence across the globe would in my view be a much bigger disaster for our country, particularly as it is highly likely that if Britain leaves the EU, Scotland will leave Britain. \n \n\"It's worth remember what Europe looked like 40 years ago - military rule had only just ended in Greece and Portugal. Spain was still under Franco's authoritarian nationalism. And in the east, an entire bloc of countries were under the totalitarian heel of the Soviet Union. \n \n\"Is it any wonder that for most of our European partners the union is more than the sum of its parts - a continent at war transformed to a continent at peace. Oligarchies becoming democracies without a shot being fired, prosperity in countries that had known nothing but poverty. \n \n\"These noble ideals won't win this referendum where the focus will be on prose rather than poetry but we must never forget the role the European Union has played in the recent history of our continent.\" \n \nShadow foreign secretary Hilary Benn stressed that Labour \"together\" is committed to keeping Britain in the EU and insisted it would restore any workers' rights that Mr Cameron might negotiate away ahead of the referendum. \n   \n Share article  \n   \nHe said: \"Together we believe that Britain's future lies in Europe because, whatever the disagreements of today or the changes that we want to see tomorrow, it has given us jobs, investment, growth, security, influence in the world and, yes, workers' rights. \n \n\"Don't mess with them, Prime Minister, but be assured that if you do a future Labour government in Europe will restore them because we will not be part of a race to the bottom.\"", "source": "Romsey Advertiser"}