{"published": "2015-09-15T00:36:32Z", "media-type": "News", "title": "Liberal leadership spill: Malcolm Turnbull loyalists tipped for communications", "id": "45ab47b6-044f-4241-b4c9-99e426d263bb", "content": "Marise Payne MP and Senator Simon Birmingham are among those tipped to succeed Prime Minister-in-waiting Malcolm Turnbull as communications minister. \n\nHuman Services Minister Marise Payne and Assistant Minister for Education and Training Simon Birmingham are among those tipped to succeed Prime Minister-in-waiting Malcolm Turnbull as communications minister.\n\nMr Turnbull vacated the portfolio – which includes media, telecommunications and the national broadband network – on Monday, hours before his overthrow of Tony Abbott as leader of the LIberal Party.\n\nHopes are high in many parts of the media industry that, as leader, Mr Turnbull will reignite his push to rip up cross-media ownership restrictions, which was scuppered by Mr Abbott.\n\nHowever, while Mr Turnbull was a vocal advocate for media reform in cabinet, Canberra insiders caution that it may not prove a top priority once he is Prime Minister and question whether he would risk upsetting powerful moguls prior to the next election.\n\nSeven West Media chairman Kerry Stokes is opposed to the scrapping of the so-called two-out-of-three and reach rules, which prevent further industry consolidation, as is News Corp chairman Rupert Murdoch, unless News's pay TV platform Foxtel can get more access to sports rights.\n\nPaul Fletcher, the parliamentary secretary to the Communications Minister, is acting minister for now. The former Optus executive is well-regarded for his industry knowledge but Canberra sources say a Ministerial role would probably be too much of a leap at this early stage.\n\nMs Payne is well regarded by Mr Turnbull and a moderate liberal and has also proved she can collaborate with the right of the party by working closely with Minister for Social Services, Scott Morrison, on the government's IT overhaul at Centrelink.\n\nSenator Simon Birmingham is also reportedly in line for an elevation to the Cabinet and has experience of the communications portfolio from his position on relevant Senate committees.\n\nOther names touted for the role include Health Minister Sussan Ley and Parliamentary Secretary to the Minister for Foreign Affairs Steve Ciobo, as well as Senator Arthur Sinodinos, according to Comms Day, which raised the possibility that Mr Turnbull may split the portfolio into NBN and \"general media/comms\" ministries. The story first appeared on The Sydney Morning Herald.", "source": "Albury Border Mail"}