{"published": "2015-09-08T10:34:30Z", "media-type": "News", "title": "Andy Murray loses his cool and smashes racquet in US Open defeat", "id": "6a9510a1-cc94-46f3-a1f4-05f1f0656bdf", "content": "Andy Murray tumbled out of the US Open and was one racquet down after losing his temper during the fourth-round defeat to Kevin Anderson. \n \nThe Scot let out a string of expletives during the break between the second and third sets, seemingly frustrated by the time Anderson was taking in a break off the court. \n \nThen after dropping serve in the third set, he smashed a racquet on the court, breaking it beyond repair and handing it to a spectator as an unexpected souvenir. \n \nSpeaking about the tension in the match, Murray later said:  \"In the second set I felt like I was starting to put pressure on him there. When I had the break point at 5-3, I had a backhand pass that I really should have made. When you're playing against players that are at that level, like him, you need to obviously make them think and then give them a chance to get nervous. \n \n\"The beginning of the fourth set, as well, I think it was his first service game, I had 15-all, hit a drop shot, mid-court forehand, then ended up winning the next couple of points. \n \n\"I felt like I had my opportunities there but didn't manage to capitalise on them. When you're playing against someone as good as him, you know, it's tough.\" \n \nBig-serving South African Anderson played the match of his  life to win 7-6 (7/5) 6-3 6-7 (2/7) 7-6 (7/0). \n \nAnderson has been helped by a sports psychologist and believes he has been able to keep his composure and focus in high-pressure matches because of that off-court guidance. \n   \n Share article  \n   \nHe said: \"I think especially at this level, there's such fine details. I think a lot of the physical side, obviously I'm working on that. But I felt just from the mental side, being as neutral as possible in these big match-ups, somebody just to talk through, you know, sort of understands how I think and stuff has definitely been a huge benefit for me. \n \n\"I definitely feel even though it's a gradual process, I feel like I'm on the right path and making good decisions.\"", "source": "Epsom Guardian"}