{"published": "2015-09-25T12:20:49Z", "media-type": "News", "title": "Lee Charnley apologises to Newcastle fans for bad start to season", "id": "3f38772c-cbf2-4b17-8176-26943627ab69", "content": "Newcastle managing director Lee Charnley has apologised for the club's dreadful start to the new season. \n \nOwner Mike Ashley's right-hand man, who oversaw the appointment of head coach Steve McClaren and the club's £52million summer recruitment drive, has insisted the club's hierarchy will take \"collective responsibility\" for the failures which have resulted in only one victory from eight games to date this season - none of them in the Barclays Premier League - and an embarrassing Capital One Cup exit at the hands of Sky Bet Championship Sheffield Wednesday. \n \nIn an e-mail to the club's supporters, Charnley said: \"There is no hiding from the fact that this has been a very disappointing start to our Premier League campaign, and a painful early exit from a cup competition that we were determined to give everything in this year. We apologise to you for this. \n \n\"After six league games, the truth is we have not achieved the points that any of us had hoped and expected we would do. \n \n\"None of us can, or will, shirk the responsibility for this situation. Now is the time for collective action, and for us to find solutions to the problems rather than allow ourselves to be consumed by them. \n \n\"It is important to state that we bear collective responsibility for our position in the table. Identifying the problems in order to find the solutions is crucial, but we are not in the business of apportioning blame. We are a team, from the boardroom to the boot room, and we will respond like one. \n \n\"So we have sat down as a collective - myself with Steve and his coaching team, and Steve with his players - to discuss the concerns and to look for the solutions together.\" \n \nThe start has piled the pressure on McClaren, whose side have lost their last four games in all competitions and face champions Chelsea and current leaders Manchester City in the next two. \n   \n Share article  \n     Promoted stories   \nBut Charnley said: \"Whilst we are all unhappy, we must not panic or make rash decisions. We should not forget we are still relatively early into the season with lots of games to go and points to play for. \n \n\"Whilst you may be tired of hearing this, I believe, as we have said from the start, all of this rebuilding and reshaping isn't something that can happen overnight; it will take time to see the benefit of the changes we made during the summer.\"", "source": "Somerset County Gazette"}