{"published": "2015-09-18T20:03:52Z", "media-type": "News", "title": "David Ruggieri Hits Amazon Best-Seller Lists with “The Soul of Success”", "id": "66c47678-7310-4e73-80ea-d05e5b79caf1", "content": "David Ruggieri recently hit ten Amazon Best-Seller lists in the United States and Canada with “The Soul of Success.” \n\nSanta Barbara, CA – September 18, 2015 – David Ruggieri recently joined a select group of business experts and entrepreneurs from around the world, along with Best-Selling Author® Jack Canfield , originator of the Chicken Soup for the Soul® series, to co-write the book , “The Soul of Success, Vol.1: The World’s Leading Entrepreneurs and Professionals Reveal Their Core Strategies for Getting to the Heart of Health, Wealth and Success”. The book was released on September 10th 2015 by CelebrityPress™ - a leading business book publisher. \n   \nOn the day of release, The Soul of Success reached best-seller status in six US Amazon categories - reaching as high as #1 in: “Direct Marketing” and “Marketing in Small Businesses” categories.  The book also reached  #9 in “Marketing,” #15 in “Marketing and Sales,”#20 in “ Entrepreneurship,” and #22 “Small Business and Entrepreneurship” categories. The Soul of Success became an international best-seller, reaching as high as #1 in “Direct Marketing” on Amazon in Canada. Additionally, The Soul of Success reached #8 in “Marketing,” #10 in “Marketing and Sales,” #12 in “Small Business and Entrepreneurship,” and #55 in “Business Management” in the international categories. David Ruggieri contributed a chapter titled “Find Your Strength- Sowing The Seeds of Your Success.” \n\nDavid Ruggieri creates power in people – that’s what moves them on to reach their goals and personal aspirations. He is all about continuing education and has been quoted as saying “Education is the great equalizer in society, without it you need luck, with it you get opportunity – you do the math!” He serves as Chief Executive Officer of a major college group in Florida, and is a Senior Executive on the subjects of marketing and Sales. In other words, he is a guy who builds both businesses and people. \n\nCelebrityPress™ describes the book: \n\nSuccess is a concept universally embraced but individually defined. Our definition of success truly depends on our individual goals. For example, your goal might be monetary, a physical accomplishment or a moral achievement. To flesh out this topic, we are adding a few comments made by famous and successful people in diverse fields - similar and familiar concepts to those put forward by the Premier Experts® in this book. \n\nSuccess is to be measured not so much by the position that one has reached in life as by the obstacles which he has overcome while trying to succeed. ~ Booker T. Washington \n\nYou can succeed best and quickest by helping others to succeed. ~ Napoleon Hill \n\nThe difference between a successful person and others is not a lack of strength, not a lack of knowledge, but rather a lack in will. ~ Vince Lombardi \n\nNothing can stop the man with the right mental attitude from achieving his goal; nothing on earth can help the man with the wrong mental attitude. ~ Thomas Jefferson \n\nIn our New Economy, the acquisition of success has been reformatted somewhat by business and industry even though its principles remain the same. The Electronic Revolution has changed the economic landscape as much as the Industrial Revolution. We now live more and more in \"real time\" and expect others to do the same. This era of instant communication has changed the ways in which we communicate and expect responses. \n\nTo succeed today, it is useful, perhaps essential, to have a mentor. Errors will be made, but to minimize them will speed up your journey. The Premier Experts® in this book will help you along the way. They have been there and know the road. Who would be better to guide you? They will illuminate your path to The Soul Of Success... \n\nAfter such a successful release, David Ruggieri will be recognized by The National Academy of Best-Selling Authors™ , an organization that honors authors from many of the leading independent best-seller lists. \n\nClick HERE to order a copy of The Soul of Success \n\nA portion of the royalties earned from The Soul of Success will be given to Entrepreneur’s International Foundation, a not for profit organization dedicated to creating unique launch campaigns to raise money and awareness for charitable causes. \n\nMore About David Ruggieri: \n\nOver the years David has been in front of thousands of people “spreading the word” on personal power and personal responsibility. He has personally seen the fruits of those moments with witnessed the success many of his graduates have achieved. He has helped develop people into successful roles by giving them the words, attitude, and inspiration they needed to, as he says, to “Fall Forward”.  He is a believer that all attempts to do something are many times met with rejection or failure, but falling is a part of standing, and falling forward is the best way to keep gaining ground. \n\nDavid has been selected as one of America’s Premier Experts and has been quoted in numerous publications on the subjects of education, marketing, and sales. \n\nConnect with David directly at druggieri@ftccollege.edu. \n\nAbout Celebrity Press™: \n\nCelebrity Press™ is a leading business, health and wellness book publisher that publishes books from thought leaders around the world. Celebrity Press™ has published books alongside Jack Canfield, Brian Tracy, Dan Kennedy, Dr. Ivan Misner, Robert Allen and many of the biggest experts across diverse fields. CelebrityPress™ has helped launch over 1700 best-selling authors to date.  \n\nLearn more at http://www.celebritypresspublishing.com \n\n### \n\nContact: \n\nKasey Kalchert \n\nDicks and Nanton Celebrity Branding Agency® \n\n800-980-1626 \n\nKasey@DNAgency.com", "source": "Fat Pitch Financials"}