{"published": "2015-09-18T00:34:58Z", "media-type": "News", "title": "GOP at odds as shutdown fight looms in House", "id": "fba10e8d-ae6e-4082-8c8f-6232b7df78de", "content": "On Thursday, with 13 days left in the fiscal year, the president met at the White House with Democratic congressional leaders – Senate Minority Leader Harry Reid, D-Nev., and House Minority Leader Nancy Pelosi, D-Calif. – signaling that the Democrats were taking the shutdown possibility seriously, even as they revel in the GOP dysfunction.\n\nReid and Pelosi met with Obama to prepare for negotiations. They say they are willing to back a stopgap measure to keep open the government, but insisted it be short term and not include any language about ideological issues, such as funding Planned Parenthood.\n\nPelosi said the emphasis now is reaching a deal quickly.\n\n“We’re optimistic, we want to be cooperative,” Pelosi said. “We want to negotiate in good faith to see that effectively done in a timely fashion.”\n\nBut with only seven working days on the legislative calendar, GOP feuding has prevented any real negotiation on a funding package.\n\nOn Thursday, White House press secretary Josh Earnest said congressional Republicans had “shown no interest” in talks with congressional Democrats and accused them of “irresponsible gamesmanship.”\n\nAhead of the White House meeting, Pelosi told reporters that she and House Speaker John Boehner, R-Ohio, had not begun talks: “I spoke with Speaker Boehner about when we would speak about this,” she said.\n\nThe lack of communication sets up a replay of the 2013 showdown, which led to a 16-day shutdown.\n\nThis year’s shutdown dynamics are driven by an internal GOP feud in the House in which a group of hard-line conservatives are promising mutiny against Boehner if they the perceive any capitulation in his dealing with the Democrats.\n\nOn Thursday, Bohner’s top deputy. Majority Leader Kevin McCarthy, was forced to address the acrimony inside the GOP caucus. He told reporters that the conservatives who wanted to oust Boehner were distracting and dividing Republicans during negotiations with Democrats.\n\nThe danger to Boehner lies in the insistence of some in his party that he not allow any funding package for the federal government if it includes funding for Planned Parenthood, the provider of health services to women recently embroiled in controversy over fetal tissue harvesting.", "source": "Journal-Gazette"}