{"published": "2015-09-28T20:23:46Z", "media-type": "News", "title": "Inskip sinkhole: \"Thanks to my husband, I'm alive\"", "id": "c86cc1d2-5bb2-4210-bc42-1c98cf74d4b5", "content": "THE moon brought the tides that swallowed their car and caravan at Inskip Pt, but its light also helped Dieter Gass save his wife's life. \n \n\"Thanks to my husband, I'm alive,\" Jenny said. \n \nWhile Jenny slept in the van on Saturday night, Dieter slipped outside with the dog for a quick bedtime stroll. \n \nIn the moonlight he saw something was wrong - the sea foam glinted in the moonlight, but it was in the wrong place. The waves lapped at the shoreline further back, but the foam bobbed in a circle eerily close to the caravan in which his wife slept. \n \n\"Get up!\" Jenny heard him scream. \"Jenny get up! Get out - it's an emergency. There's a sinkhole!\" \n \n\"He took the dog out to go to the toilet and there was a sinkhole 20 metres away from us,\" she said. \"It was 20ft deep. It was like a cliff.\" \n \nShe leapt out of the van in her pyjamas, and about 25 minutes later their caravan and car were gone. They had been swallowed by a watery crater 50m wide, along with trees and fellow campers' tents. \n \nThe couple fought with gravity for more than 20 minutes before Dieter realised his life was in serious danger. \n \n\"He was hell-bent on getting that van out,\" Jenny said. \n  Jenny and Dieter Gass from Latrobe Valley, Victoria had been holidaying for 3 weeks in their caravan before the sinkhole ruined everything. Photo Greg Miller / Sunshine Coast Daily  Greg Miller   \nThe van was their home. They had bought it a couple of years ago - a homey set-up with an ensuite, a slide-out bedroom and lounge. \n \n\"It wasn't long enough to be able to save it,\" Jenny said. \n \n\"It was a beautiful van - it was only two or three years old…we had it set up as a home. It was a real home.\" \n \nDieter hooked the car up to the caravan and tried desperately to pull their home to safety while the campsite erupted as other campers fled to higher ground. \n \n\"When he realised it wasn't going to come out, that he wasn't going to get it out, he tried to get the car off so we'd at least have a car,\" Jenny said. \n \n\"But the angle of the car...the ground started to come away from him,\" Jenny said. She paused, remembering the terrifying image of her husband attached to a vehicle that was sinking into the ocean. \n \n\"But he got away.\" \n \nLike dozens of campers, Jenny, Dieter and their dog Georgie had set up camp more than 100m from the tide mark, a site with waterfront views. \n \n\"We were on safe ground, so we thought, and we were in a designated camping area,\" Jenny said. \"It's not like we were parked where we weren't allowed.\" \n  A large sink hole has swallowed a large chunk of the camping area on Inskip Point, taking with it a caravan, camper trailer and one vehicle. Photo: Che Chapman / Sunshine Coast Daily  Che Chapman   \nYesterday Jenny and Dieter were still in shock, but a little brighter in mood after the first day of a sleepless 36 hours. A park ranger had given them an emergency house, and his wife brought them clothes and towels. \n \nThe Victorian holidaymakers began the daunting task of establishing who they were after losing everything from wedding rings to clothes and medication. They spent the day buying clothes and sorting proof of identity. \n \nThey are trying to forget the loss of their \"priceless\" possessions, which include a video camera with their son's only recording of his wedding. Their insurance will likely cover the vehicles, but the contents were valued at only $1", "source": "NewsMail"}