{"published": "2015-09-03T08:09:14Z", "media-type": "News", "title": "Focus on Bangladesh migrant influx: RSS to tell BJP", "id": "0398315c-ab9e-472f-8efb-7aa5f77df55e", "content": "New Delhi, Sept 3: The RSS is particulary concerned about the high rate of infiltration from Bangladesh . In its three day coordination meeting with the BJP , the RSS is likely to tell the government to take seriously the problem of infiltrations especially from Bangladesh as this could change the demographics in some states. \n\nThe RSS and the BJP are holding a three day coordination meeting at the National capital and Prime Minister Narendra Modi is expected to participate on Friday. \n\n\nFile photo. West Bengal Bangladesh border \n  \n\nGive priority to infiltrations: \n\nThe RSS is concerned about the influx of Muslims from Bangladesh. It will tell the BJP to handle the issue with top priority as the census shows that there are a large number of people coming in from Bangladesh and settling down in the states of West Bengal and Assam. \n\nAlso read:  RSS favours immediate implementation of OROP \n\nThe RSS feels that if this issue is not addressed with seriousness then the demographics will change and could prove dangerous in the long run. The Intelligence Bureau too had raised a red flag on the number of people coming in from Bangladesh and settling down in the states of West Bengal and Assam. \n\nFocus on Nepal as well: \n\nIn addition to the issue of Bangladesh, the RSS will also rake up the Nepal issue with the BJP. The RSS feels that the Nepal border has become an easy entry and exit point and this should be a focus for the government. \n\nIn the recent past we have seen several anti nationals using the Nepal-India border to enter and exit. The RSS is of the view that the activities along the Indo-Nepal border must be curbed. There is a need to fix this issue immediately or else it could snow ball into a major problem, the RSS would also inform the BJP which is running the government at the centre. \n\nOROP row: \n\nThe One Rank One Pension row will also be an issue to be raked up when the Prime Minister attends the coordination meet tomorrow. The RSS will tell the BJP to find an immediate solution to the problem as dragging would only lower the image of the government. \n\nThe RSS feels that the OROP is an extremely emotive issue and needs to be resolved immediately. Dragging it is not in the interest of the government and with the veterans protesting on the streets, it could hurt the government's image if there is a delay, the RSS feels. \n\nOneIndia News", "source": "Oneindia"}