{"published": "2015-09-20T02:55:11Z", "media-type": "News", "title": "Rowe has 4 TD passes as Terrapins beat Bulls", "id": "6b7f0971-2ef1-46ee-90a7-a946b9bfbdc3", "content": "COLLEGE PARK, Md. — Caleb Rowe's first start of the season as featured four touchdown passes, 21 completions and 297 yards in the air. \n\nStack that against his three interceptions and three fumbles, and the deciding factor in assessing his performance came down to this: Maryland won. \n\nWith Rowe leading the way, the Terrapins overcame a variety of mistakes Saturday in a 35-17 victory over South Florida. \n\nRowe was named the starting quarterback in the wake of a 21-point loss to Bowling Green last week. Despite mishandling the ball at times, the junior provided enough big plays on his 33 passes to help the Terrapins (2-1) finish with 411 yards in offense. \n\n“He did some very good things out there,” Maryland coach Randy Edsall said. “But as a quarterback, you can't throw three picks. Those picks led to their points. And some of the things in the huddle weren't as crisp as they needed to be. So there's still a whole lot of things he needs to do to get better.” \n\nRowe knows this. But after tearing his ACL last year and starting this season on the bench, he was delighted just to be part of a winning effort. \n\n“It's not about individual numbers if we get a win,” Rowe said. “I'm expected to throw touchdowns. I'm expected to not throw interceptions. I've just got to play better, be smarter with the football and make better decisions.” \n\nWhen he gets over lamenting the interceptions and the fumbles — all of which Maryland recovered — Rowe will savor throwing touchdown passes of 12 and 22 yards to Avery Edwards, connecting with Taivon Jacobs for a 70-yard score and hitting Kenneth Goins for a 1-yard TD. \n\nHis teammates were appreciative of his work, especially in light of last week's debacle against Bowling Green. \n\n“I think Caleb played great,” Edwards said. “He was poised, he was making decisions, everyone was confident in him. And he led us to a victory.” \n\nThe Terrapins won in spite of Rowe's difficulty holding the ball and while being penalized 12 times for 120 yards. \n\nSouth Florida (1-2) also had its share of miscues — including two turnovers, a dropped potential touchdown pass, a holding call that wiped out a touchdown run and a personal foul penalty that erased a fourth-quarter first down when the score was 28-17. \n\n“I thought our guys would play better than we did,” coach Willie Taggart said. “We left a lot of opportunities out there. We left a lot of plays out there, and we had a lot of costly penalties that killed some drives and cost our football team. In all, we just didn't play winning football.” \n\nQuinton Flowers went 10 for 19 for 60 yards with a touchdown pass and an interception. He was replaced for a series in the fourth quarter by Steve Bench, who was 0 for 3 with a pick. \n\nThe game turned late in the first half after South Florida used a 12-play drive to get a field goal and close to 14-10. \n\nStarting at his own 34 with 52 seconds left, Rowe completed passed of 10 and 49 yards to Levern Jacobs. On first-and-goal at the USF 2, Rowe botched a pitch to Brandon Ross, who picked up the ball and took it into the end zone with 10 seconds remaining. \n\nMaryland opened the second half with 45-yard kickoff return by Ty Johnson. Five plays later, Edwards made an excellent over-the-shoulder catch of a Rowe pass in the end zone for a 28-10 lead. \n\nThat was enough to assure the Terrapins a much-needed victory in the wake of last week's defeat. Rowe finished that game by throwing two interceptions in relief of an ineffective Perry Hills. \n\nStarting from the outset in this one, Rowe picked up where he left off. Maryland's opening drive ended when Devin Abraham returned an interception 42 yards, setting up a 4-yard touchdown pass from Flowers to Rodney Adams. \n\nRowe bounced back to direct a 59-yard drive, capped by a TD pass to Goins. Then, on the last play of the quarter, Rowe connected with Jacobs deep on the right sideline for a 70-yard score. \n\nSouth Florida botched a chance to pull even when Adams dropped a long pass after slipping behind the secondary. It was the first of many miscues by the Bulls, who were coming off a 34-14 defeat at Florida State. \n\nMARYLAND 35, SOUTH FLORIDA 17 \n\nSouth Florida   7  3  7  0—17 \n\nMaryland 14  7  7  7—35 \n\nFirst Quarter \n\nUSF—Adams 4 pass from Flowers (Nadelman kick), 12:40. \n\nMd—Goins Jr. 1 pass from Rowe (Craddock kick), 8:44. \n\nMd—T.Jacobs 70 pass from Rowe (Craddock kick), :00. \n\nSecond Quarter \n\nUSF—FG Nadelman 34, :59. \n\nMd—B.Ross 4 run (Craddock kick), :10. \n\nThird Quarter \n\nMd—Edwards 12 pass from Rowe (Craddock kick), 13:15. \n\nUSF—Flowers 7 run (Nadelman kick), :48. \n\nFourth Quarter \n\nMd—Edwards 22 pass from Rowe (Craddock kick), 10:06. \n\nA—36,827. \n\n \n\n    USF    Md \n\nFirst downs »»      18  »»      18 \n\nRushes-yards »50-240  »34-114 \n\nPassing »        60  »      297 \n\nComp-Att-Int 10-22-2  21-34-3 \n\nReturn Yards »»      67  »»      55 \n\nPunts-Avg. »5-47.4  »4-34.5 \n\nFumbles-Lost »      3-0  »      3-0 \n\nPenalties-Yards »10-105  »12-120 \n\nTime of Possession »  30:28  »  29:32 \n\nINDIVIDUAL STATISTICS \n\nRUSHING—South Florida, Flowers 24-85, Mack 12-71, Tice 6-42, Johnson 7-25, Bench 1-17. Maryland, B.Ross 18-68, Johnson 10-30, Rowe 5-13, Brown 1-3. \n\nPASSING—South Florida, Flowers 10-19-1-60, Bench 0-3-1-0. Maryland, Rowe 21-33-3-297, Team 0-1-0-0. \n\nRECEIVING—South Florida, Adams 4-8, Johnson 2-27, R.Bronson 1-17, Mack 1-7, Price 1-5, Barr 1-(minus 4). Maryland, L.Jacobs 8-107, D.Moore 3-47, Edwards 3-36, T.Jacobs 2-82, Etta-Tawo 1-9, Cockerille 1-7, Johnson 1-7, Goins Jr. 1-1, B.Ross 1-1.", "source": "Lakeland Ledger"}