{"published": "2015-09-03T06:30:22Z", "media-type": "News", "title": "justice California Curbs Solitary What ending long-term isolation means for America’s prison system. Benjamin Wallace-Wells", "id": "9fc258f3-3abc-43a6-b9a7-56f61fdead4e", "content": "FOLLOW:\n\nLong-term isolation will no longer be used as a method of social control. \n\nYesterday, state officials in Sacramento announced that they had settled an inmate lawsuit by agreeing to dramatically curb the use of solitary confinement in California's prisons. Inmates who commit violent crimes while in prison will still be transferred to solitary units, but prisoners will no longer be held there indefinitely or simply because correctional officers believe they belong to gangs. The agreement is likely to end what in California had been the de facto practice, in which solitary confinement had been used as a method of social control.\n\nThe plaintiffs in the lawsuit, many of them convicted murderers and many of them also the leaders of violent prison gangs, were themselves the subjects of a novel human experiment, in which they were almost entirely isolated for years on end. Many of them were also protagonists in the arresting episode that turned into a movement, in which from within the extremely circumscribed environment of solitary confinement the leaders of rival gangs managed to arrange a 30,000-person hunger strike, the largest in U.S. history. The leaders starved themselves for 60 days, and the protest did not end until a U.S. district court issued an order permitting prison officials to force-feed the holdouts.\n\nI wrote about that hunger strike and its leaders at great length two years ago, in a report from Pelican Bay for this magazine. I did not expect then that California's system of solitary confinement would last for very much longer, but I also did not expect a reversal to come so quickly. One way to take yesterday's news is as confirmation that a new stage in the history of mass incarceration — in which the human damage of imprisonment is more heavily weighed, and policies drawn up in the crime crisis of the '80s more directly reconsidered — is now fully under way. Just after news broke of the California settlement, the association representing prison directors for each of the 50 states and many of its largest cities issued a statement calling for limiting solitary confinement or ending it altogether. Another way, possibly more meaningful, is that several hundred prisoners will no longer suffer such extreme and often arbitrary deprivations simply because their guards have been given a population too large for them to confidently control. \n\nCopyright © 2015, New York Media LLC. All Rights Reserved. Vulture®, Grub Street® and The Cut® are registered trademarks of New York Media LLC.", "source": "New York Magazine"}