{"published": "2015-09-29T16:35:43Z", "media-type": "Blog", "title": "The UK interest in Saudi prisons – and why Corbyn opposes it", "id": "4ac72dee-8595-42bd-8895-3653be9eac65", "content": "Jeremy Corbyn’s call for the Ministry of Justice to drop its bid for a Saudi prisons contract centres on the case of pro-democracy protester, Ali Mohammed al-Nimr, who has been sentenced to crucifixion. Nimr is facing a death sentence handed down when he was 17 and is largely based on a “confession” he was forced to sign following what he says were days of torture while in custody. The sentence will be carried out in jail by the Saudi prison service. Corbyn called on the British government to protest against this sentence by dropping its bid for a £5.9m contract to provide prison expertise to the Saudis.\nThe bid was put in by Justice Solutions International, the commercial arm of the MoJ that was set up by the last justice secretary, Chris Grayling, to sell its expertise in prisons and probation – including in offender management, payment by results, tagging and privatisation – around the world. Last month the new justice secretary, Michael Gove announced that he was closing down JSI, telling MPs it was because “of the need to focus departmental resources on domestic priorities”. But Gove said the bid for the Saudi contract to provide “training-needs analysis” would go ahead because it is so far advanced that the financial penalties for cancellation would be detrimental to the British government’s interests. “All work relating to this contract will be completed within six months of starting,” he said. The official explanation was later amended to exclude the issue of financial penalties, and a correction made to the parliamentary record. But the justice ministry still says that it would not be in the “wider interests of the British government” to withdraw the bid at this late stage. This is taken by campaigners, such as Reprieve, to mean that the Foreign Office is insisting it goes ahead. In a statement last Friday, the FCO said: “We understand that Ali Mohammed al-Nimr’s legal process has finished and his final appeal has been denied. We will raise this case urgently with the Saudi authorities.” The spokesperson added: “The abolition of the death penalty is a human rights priority for the UK. The UK opposes the death penalty in all circumstances.”\nDowning Street said the UK had already raised Nimr’s case with the Saudi authorities and Philip Hammond, the foreign secretary, would raise it again with his Saudi counterpart. The initial JSI bid to the Saudi authorities for the contract was made in August 2014 with a final bid being submitted this April. It is subject to final approval by the Saudi ministry of finance. Maya Foa, of the anti-death penalty group Reprive, wrote to Gove asking him to drop the bid. She said: “Britain’s justice system has a strong reputation for fairness and decency and we believe that to continue with this contract would sully that reputation, while sending the signal that Britain condones the abuses taking place in the Saudi system, and others like it around the world.”", "source": "UK news | The Guardian"}