{"published": "2015-09-29T17:36:00Z", "media-type": "News", "title": "Defy Media And 360fly Partner To Introduce Interactive 360-Degree Video And Virtual Reality Content Platform On Break.com", "id": "6b2242b0-c08f-46ee-87b6-549e66d11a2c", "content": "SOURCE 360fly\n\nPartnership Will Allow Viewers to Experience Original 360-Degree Content as well as Upload User Generated 360-Degree, Virtual Reality Content\n\nPITTSBURGH \n\nDEFY plans to debut the platform on Break.com in early October in conjunction with 360fly's retail launch at Best Buy. The company will also look to launch the 360fly platform across other DEFY brand channels in the coming year, as well as leveraging 360fly digital products for its original studio production and programming. \n\n360fly's interactive 360-degree video player technology provides viewers a 360 x 240-degree field of view. Viewers can literally immerse themselves within the video through touch-screen technology, clicking, dragging or swiping on any mobile device, as well as through motion-sensor technology by which the movement of the device itself controls the interactive experience of the video. With desktops and laptops, this interactivity is achieved through the use of the mouse, clicking and dragging the video to see and experience different vantage points within the larger 360 x 240-degree field of view. \"The introduction of interactive 360-degree video is truly a game-changer, opening the door to an entirely new universe of innovative interactive and virtual reality content experiences for our viewers and internal content creators,\" said Keith Richman \n\nThe collaboration is a valuable one for 360fly as it pushes forward in its mission to drive widespread mainstream acceptance, production and consumption of interactive 360-degree video, while also democratizing virtual reality through a platform that's dramatically more accessible and feasible for mainstream consumers. To date, consumption of virtual reality has been a very costly proposition, requiring the use of much higher-priced equipment and limited to a small array of virtual reality content. In combination with affordable cardboard virtual reality goggles, 360fly is opening the door for consumers to produce, consume and share virtual reality experiences at a moment's notice. \n\n\"Affordable cameras and viewing devices are only part of the equation. The final piece is consumers having access to a robust ecosystem of destinations where they can readily consume a wide range of 360-degree virtual reality content,\" said Peter Adderton \n\nTo learn more about 360fly, visit www.360fly.com or follow 360fly on Twitter and Instagram @360fly, and \"like\" it on Facebook at facebook.com/360fly. MSRP is $399 To learn more about DEFY Media, visit DEFYMedia.com. Follow Break on Twitter @Break and \"like\" it on Facebook at facebook.com/Break.\n\nAbout 360fly\n\n360fly creates unique, 360-degree digital products that inspire users to capture, share and experience life's greatest moments in 360 degrees. Our passion has led us to redefine video capture, because we believe life is too rich to capture just part of it. \n\nAbout DEFY Media\n\nDEFY Media is the top digital producer and programmer for 13-34 year olds, and the largest owner of YouTube channels and leading media brands across the comedy, lifestyle and gaming verticals. Each month, DEFY-produced content generates 500 million video views and reaches 125 million viewers across our 60 million YouTube subscribers, 80 million unique web visitors and consumers of our apps, which have been downloaded over 22 million times. DEFY Media brands include Smosh, recently named by Variety as the top brand for 13-17 year olds, Break, known for its top program \"Prank It Forward\", and Screen Junkies, home to the highly influential digital series \"Honest Trailers\". The world's top brands partner with DEFY to build immersive advertising solutions that deliver unparalleled access to this influential audience. With uniquely integrated capabilities in content development, studio production, distribution and promotion, DEFY Media is built for content delivery in the digital age. Please visit us at www.DEFYMedia.com.\n\nPhoto - http://photos.prnewswire.com/prnh/20150929/271954 \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/defy-media-and-360fly-partner-to-introduce-interactive-360-degree-video-and-virtual-reality-content-platform-on-breakcom-300150888.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "FOX 61 WDSI"}