{"published": "2015-09-23T06:30:37Z", "media-type": "News", "title": "Drug support centre could be affected by Burton court closure", "id": "60688702-8887-499f-b95e-693e2f21daf5", "content": "Comments (0)   \nA LIFESAVING service committed to helping addicts get clean  would be severely impacted if Burton Magistrates' Court is axed, its founder has said. \n\nNoreen Oliver, founder of Burton Addiction Centre (BAC), has said the closure of the 105-year-old court would cost the service too much in manpower to provide support for its users elsewhere. \n\nHer Majesty's Courts and Tribunals Service is currently consulting on whether to close the court, in Horninglow Street, and transfer all its cases to either Cannock or Southern Derbyshire magistrates' courts. \n\nCurrently the BAC works with the criminal justice system to provide treatment which defendants are required to complete via conditions set out in a court order. Mrs Oliver said: \"If magistrates give out an order for rehabilitation and treatment, going to the court makes it a lot easier for us to work alongside them. \n \n\"If the work went to Cannock or Derby then we would have a long trek to (be able to) work with the magistrates and determine what treatment they need. \n\n\"I think if the court was moved there is the danger that people won't turn up for court. \n\n\"It is a long trek for us and we don't have the resources to have someone out all day at court because of the cuts. So it will have an impact.\" \n\nMrs Oliver is the latest in a long line of people voicing their opposition to the plans. \n\nBurton's court is one of  91 courts and tribunals buildings across the country that are under threat of closure under the new proposals. \n\nThe courts service claims that these courts are underused and Burton costs £200,000 a year to maintain, with a 52 per cent usage. \n\nHowever, protesters, including Burton MP Andrew Griffiths, believe the closure could be the end of local justice,   leading to victims, witnesses and defendants and their families travelling for more than an hour to attend another court. \n\n *Read more of today's top news stories here. \n\nFollow the Burton Mail on Facebook and Twitter \n\n\nLooking for a new job? Visit our Jobs Channel  to see all the latest vacancies . \n\nLooking for a new home? Visit our property channel to see all of the homes on offer.", "source": "Burton Mail"}