{"published": "2015-09-15T08:15:01Z", "media-type": "News", "title": "Digital Overload Mega-Rant Catharsis By @TheEbizWizard | @DevOpsSummit #DevOps", "id": "bd8c2cbd-7a1b-42c6-88d8-571a0b735567", "content": "By Jason Bloomberg  \nArticle Rating: \n   September 14, 2015 08:45 PM EDT        \nI love all this digital hullaballoo, really I  do. I love all these different trends and disruptions and turmoil. I  especially love the confusion - it gives me something to write about. \n \nBut sometimes, I've just had enough. Especially when the digital disruption story starts repeating itself. \n \nTake, for example, the unicorn meme. Unicorn, as in  a VC-funded startup with a billion-dollar-plus valuation. You know, the  Ubers and AirBnBs and Facebooks of the world. \n \nIt seems that every presentation, every talk, every  press release compares whatever some DigiCloudDataTech startup is doing  with Uber. Or AirBnB. Or Facebook. Like you'd ever come up with Uber.  Or AirBnB. Or Facebook. Hearing about Uber or AirBnB or Facebook just one more time is going to make me pull what's left of my hair out - and I still have most of my hair. \n \nUnicorns aren't rare, folks. They're mythical . As in nonexistent. So stop talking about them already! \n \nAnd then there's digital marketing. Marketing, of  course, is an important part of the digital story, since digital is  customer-driven and marketing is supposed to be expert on everything  customer-driven. \n \nBut if you look at what the digital marketers are  doing, it seems that they've all reached a plateau where they're all  doing the same stuff. And a lot of it simply sucks. \n \nTake retargeting ,  for example. Retargeting is where you look at some widget on some site  somewhere, and then for the next three weeks ads for that stupid widget  follow you everywhere online. Look up one of those super-realistic digital Japanese robotic sex toys ? You'll get nothing but ads for sex toys on every damn web site you visit. Better hope your mom doesn't come over. \n \nThe problem with retargeting, of course, is that  the marketers really have no clue whatsoever if you're really in the  market for that sex toy. Perhaps you already bought one. Or maybe you  just thought that toy was hot and had to click through to see if there  were more sexy photos of it. The marketers simply have no freaking idea. \n \nIt gets worse. What about digitalwashing ? You know, like cloudwashing ,  where people pretended to do cloud because it was cool. Now digital is  cool so people are digitizing this and that, in hopes of a cushy seat on  the bandwagon. \n \nHow do you tell digitalwashing from the real thing? Try replacing the word digital with either of the words web or ebusiness and see if it's something someone might have said back when we were partying like it was 1999 . \n \nAnd what's up with cybersecurity, anyway? Welcome to the 2010s, hackers, it's your decade! We have no freaking clue how to keep you out ,  so go ahead and hack us. We probably won't even notice. Here are our  credit card numbers. Have fun with all those iPads and Rolexes and  Japanese sex toys you're going to order. \n \nThe hacking problem has gotten so bad that the Chinese are complaining that we're complaining too much about how much the Chinese are hacking  us. Go ahead, read that sentence again. You can't make this stuff up. \n \nDigital transformation, of course, is more about the transformation than the digital . As in business transformation. As in, you need to reorganize everybody and run your  entire business differently in order to be digitally transformed.  Simple. \n \nWell, good luck with that. About as far as anyone is really getting with their digital transformation initiatives is putting a marketing person on the dev team, or maybe putting a  developer on the marketing team. Paste your favorite Dilbert cartoon  here, seriously. \n \nOh, and what about the management consultants ?  You know, those highly paid MBAs who love to string together buzzwords  into preformatted tomes of advice, only to sell them for a few mil to  unsuspecting executives who will skim them, nod their heads, and go back  to whatever they were doing? \n \nWell, the consultants are all digital now. Every  last one of them. Giving management advice to managers for how to be  digital visionaries and drive their visions down the throat of their  rank and file. After all, look at Uber! And AirBnB! And Facebook! You  can be a unicorn too, Mr. Insurance Executive or Ms. Banker. Self-organization is the key to innovation , so tell all your people to self-organize or get the hell out. \n \nMaybe the industry analysts will help? Not a chance. Gartner is recommending that you should go fast and slow at the same time . Fast as in all digital and DevOps, slow as in all that creaky old IT. Both. At the same time. \n \nCIOs can breathe a sigh of relief - according to  Gartner, this digital stuff is easier than they thought. No monkeying  with all those arcane IT governance policies and mind-numbing procedures  and legacy spaghetti. Just hire some Goths and Lumbersexuals and put them in charge of the new gear and you're off and running. \n \nThe Intellyx Take \nHear that noise? That's the music for this big  digital game of musical chairs we're all playing. There's so much  activity, so much vendor hype, so much enterprise spending, so much VC  investment today that it seems this whole digital extravaganza is never  going to stop. So round and round we go. \n \nWell, I hate to break it to all you digital-native  millennials reading this, but what comes up must come down. For all you  old fogies like me who played our first game of dot.com musical chairs  back in the 1990s, we've heard this music before. Take my advice: make  sure you have a chair when the music stops. \n \nIntellyx advises companies on their digital transformation initiatives and helps  vendors communicate their agility stories. As of the time of writing,  none of the organizations mentioned in this article are Intellyx  customers. Image credit: Adam Rifkin . \n    \nJason Bloomberg is the leading expert on architecting agility for the enterprise. As president of Intellyx, Mr. Bloomberg brings his years of thought leadership in the areas of Cloud Computing, Enterprise Architecture, and Service-Oriented Architecture to a global clientele of business executives, architects, software vendors, and Cloud service providers looking to achieve technology-enabled business agility across their organizations and for their customers. His latest book, The Agile Architecture Revolution (John Wiley & Sons, 2013), sets the stage for Mr. Bloomberg’s groundbreaking Agile Architecture vision. \n\nMr. Bloomberg is perhaps best known for his twelve years at ZapThink, where he created and delivered the Licensed ZapThink Architect (LZA) SOA course and associated credential, certifying over 1,700 professionals worldwide. He is one of the original Managing Partners of ZapThink LLC, the leading SOA advisory and analysis firm, which was acquired by Dovel Technologies in 2011. He now runs the successor to the LZA program, the Bloomberg Agile Architecture Course , around the world. \n\nMr. Bloomberg is a frequent conference speaker and prolific writer. He has published over 500 articles, spoken at over 300 conferences, Webinars, and other events, and has been quoted in the press over 1,400 times as the leading expert on agile approaches to architecture in the enterprise. \n\nMr. Bloomberg’s previous book, Service Orient or Be Doomed! How Service Orientation Will Change Your Business (John Wiley & Sons, 2006, coauthored with Ron Schmelzer), is recognized as the leading business book on Service Orientation. He also co-authored the books XML and Web Services Unleashed (SAMS Publishing, 2002), and Web Page Scripting Techniques (Hayden Books, 1996). \n\nPrior to ZapThink, Mr. Bloomberg built a diverse background in eBusiness technology management and industry analysis, including serving as a senior analyst in IDC’s eBusiness Advisory group, as well as holding eBusiness management positions at USWeb/CKS (later marchFIRST) and WaveBend Solutions (now Hitachi Consulting). \n    \n@MicroservicesExpo Stories \n\nBy Felix Xavier \nAt the outset, Hyper convergence looks to be an attractive option seemingly providing lot of flexibility. In reality, it comes with so many limitation and curtail the flexibility to grow the hardware resources such as server, storage, etc independent of each other. In addition, performance nightmare bound to hit once the system gets loaded.\nIn late 1990s, storage and networking came out of compute for a reason. Both networking and storage need  some specialized processing and it doesn't make se... \nSep. 15, 2015 03:30 AM EDT  Reads: 305 \n\nBy Liz McMillan \nDatapipe has acquired AWS assessment, automation, and migration company DualSpark. DualSpark’s AWS consulting services simplify the experience of moving apps and critical infrastructure to the AWS cloud. \n“DualSpark has extensive cloud-native experience helping enterprises modernize and refactor applications around site and system reliability, distributed configuration management and automation at all levels,” said Robb Allen, CEO, Datapipe. “Datapipe has been consistently enhancing our AWS man... \nSep. 15, 2015 03:00 AM EDT  Reads: 352 \n\nBy Liz McMillan \nTestPlant has released the results of its annual user survey, now in its fifth year. \nIts 2014 survey revealed user experience as a top theme for test teams, but this year the focus is firmly on a shift happening among many companies who are actively integrating their quality assurance teams into the Agile development cycle. Agile has been mainstream in development teams for a few years now, but until recently, most test teams sat outside the Agile cycle. This lack of integration has for some t... \nSep. 15, 2015 03:00 AM EDT  Reads: 209 \n\nBy Pat Romanski \nJFrog has announced a powerful technology for managing software packages from development into production. JFrog Artifactory 4 represents disruptive innovation in its groundbreaking ability to help development and DevOps teams deliver increasingly complex solutions on ever-shorter deadlines across multiple platforms\nJFrog Artifactory 4 establishes a new category – the Universal Artifact Repository – that reflects JFrog's unique commitment to enable faster software releases through the first pla... \nSep. 15, 2015 03:00 AM EDT  Reads: 264 \n\nBy Pat Romanski \nBMC Software Inc. has introduced TrueSight Pulse into its family of solutions. Integrated from the recent Boundary Software technology acquisition, the TrueSight Pulse solution is an adaptable SaaS-based infrastructure monitoring service that provides IT with ultra-granular insight into application metrics and an immediate view of data, enabling IT to detect and diagnose problems fast.\nBMC's TrueSight Pulse solution is the newest addition to BMC's Digital Enterprise Management set of solutions ... \nSep. 15, 2015 12:00 AM EDT  Reads: 344 \n\nBy Tim Hinds \nEven though you are running an agile development process, that doesn’t necessarily mean that your performance testing is being conducted in a truly agile way. Saving performance testing for a “final sprint” before release still treats it like a waterfall development step, with all the cost and risk that comes with that. In this post, we will show you how to make load testing happen early and often by putting SLAs on the agile task board. \nSep. 15, 2015 12:00 AM EDT  Reads: 354 \n\nBy Carmen Gonzalez \nThe 17th International Cloud Expo has announced that its Call for Papers is open. 17th International Cloud Expo, to be held November 3-5, 2015, at the Santa Clara Convention Center in Santa Clara, CA, brings together Cloud Computing, APM, APIs, Microservices, Security, Big Data, Internet of Things, DevOps and WebRTC to one location.\nWith cloud computing driving a higher percentage of enterprise IT budgets every year, it becomes increasingly important to plant your flag in this fast-expanding bu... \nSep. 14, 2015 09:00 PM EDT  Reads: 1,921 \n\nBy Jason Bloomberg \nI love all this digital hullaballoo, really I do. I love all these different trends and disruptions and turmoil. I especially love the confusion – it gives me something to write about.\n\nBut sometimes, I’ve just had enough. Especially when the digital disruption story starts repeating itself. \nSep. 14, 2015 08:45 PM EDT \n\nBy Elizabeth White \nAkana has announced the availability of the new Akana Healthcare Solution. The API-driven solution helps healthcare organizations accelerate their transition to being secure, digitally interoperable businesses. It leverages the Health Level Seven International Fast Healthcare Interoperability Resources (HL7 FHIR) standard to enable broader business use of medical data. Akana developed the Healthcare Solution in response to healthcare businesses that want to increase electronic, multi-device acce... \nSep. 14, 2015 08:30 PM EDT  Reads: 559 \n\nBy Liz McMillan \nIn his session at DevOps Summit, Kristopher Francisco, Founder and CTO of Evolute, will evaluate containerization, service discovery, and cluster scheduling in order to obviate the path all microservice architectures across our industry are trying to achieve. \nBy first analyzing the \"maturity\" of your application landscape, what all organizations moving to production need and the technical capability within your teams, he will present a methodology and toolchain that moves developers and operat... \nSep. 14, 2015 07:30 PM EDT  Reads: 267 \n\nBy Carmen Gonzalez \nDevOps Summit, taking place Nov 3-5, 2015, at the Santa Clara Convention Center in Santa Clara, CA, is co-located with 17th Cloud Expo and will feature technical sessions from a rock star conference faculty and the leading industry players in the world. The widespread success of cloud computing is driving the DevOps revolution in enterprise IT. Now as never before, development teams must communicate and collaborate in a dynamic, 24/7/365 environment. There is no time to wait for long development... \nSep. 14, 2015 05:30 PM EDT  Reads: 1,825 \n\nBy Pat Romanski \nSYS-CON Events announced today that Pythian, a global IT services company specializing in helping companies leverage disruptive technologies to optimize revenue-generating systems, has been named “Bronze Sponsor” of SYS-CON's 17th Cloud Expo, which will take place on November 3–5, 2015, at the Santa Clara Convention Center in Santa Clara, CA.\nFounded in 1997, Pythian is a global IT services company that helps companies compete by adopting disruptive technologies such as cloud, Big Data, advance... \nSep. 14, 2015 04:45 PM EDT  Reads: 603 \n\nBy Elizabeth White \nSYS-CON Events announced today the Containers & Microservices Bootcamp, being held November 3-4, 2015, in conjunction with 17th Cloud Expo, @ThingsExpo, and @DevOpsSummit at the Santa Clara Convention Center in Santa Clara, CA.\r\nThis is your chance to get started with the latest technology in the industry. Combined with real-world scenarios and use cases, the Containers and Microservices Bootcamp, led by Janakiram MSV, a Microsoft Regional Director, will include presentations as well as hands-on... \nSep. 14, 2015 04:00 PM EDT  Reads: 696 \n\nBy Pat Romanski \nSYS-CON Events announced today that the \"Second Containers & Microservices Expo\" will take place November 3-5, 2015, at the Santa Clara Convention Center in Santa Clara, CA.\r\nContainers and microservices have become topics of intense interest throughout the cloud developer and enterprise IT communities. \nSep. 14, 2015 02:15 PM EDT  Reads: 866 \n\nBy Carmen Gonzalez \n17th Cloud Expo, taking place Nov 3-5, 2015, at the Santa Clara Convention Center in Santa Clara, CA, will feature technical sessions from a rock star conference faculty and the leading industry players in the world. Cloud computing is now being embraced by a majority of enterprises of all sizes. Yesterday's debate about public vs. private has transformed into the reality of hybrid cloud: a recent survey shows that 74% of enterprises have a hybrid cloud strategy. Meanwhile, 94% of enterprises ar... \nSep. 14, 2015 01:45 PM EDT  Reads: 1,807 \n\nBy Elizabeth White \nSYS-CON Events has announced today that Roger Strukhoff has been named conference chair of Cloud Expo and @ThingsExpo 2015 Silicon Valley.\nThe 17th Cloud Expo and 4th @ThingsExpo will take place on November 3-5, 2015, at the Santa Clara Convention Center in Santa Clara, CA.\n\"The Internet of Things brings trillions of dollars of opportunity to developers and enterprise IT, no matter how you measure it,\" stated Roger Strukhoff. \"More importantly, it leverages the power of devices and the Interne... \nSep. 14, 2015 01:30 PM EDT  Reads: 230 \n\nBy Pat Romanski \nPuppet Labs has announced the next major update to its flagship product: Puppet Enterprise 2015.2. This release includes new features providing DevOps teams with clarity, simplicity and additional management capabilities, including an all-new user interface, an interactive graph for visualizing infrastructure code, a new unified agent and broader infrastructure support. \nSep. 14, 2015 11:30 AM EDT  Reads: 790 \n\nBy Elizabeth White \nSYS-CON Events announced today that xMatters, inc., a leader in communication-enabled business processes, will exhibit at SYS-CON's @DevOpsSummit Silicon Valley, which will take place on November 3–5, 2015, at the Santa Clara Convention Center in Santa Clara, CA.\nxMatters’ cloud-based communications solutions enable any business process or application to trigger two-way communications (push, voice, email, SMS, etc.) throughout the extended enterprise during time-sensitive events. With over a de... \nSep. 14, 2015 11:30 AM EDT  Reads: 305 \n\nBy Liz McMillan \nThe web app is agile. The REST API is agile. The testing and planning are agile. But alas, data infrastructures certainly are not. Once an application matures, changing the shape or indexing scheme of data often forces at best a top down planning exercise and at worst includes schema changes that force downtime. The time has come for a new approach that fundamentally advances the agility of distributed data infrastructures.\nCome learn about a new solution to the problems faced by software organ... \nSep. 14, 2015 11:00 AM EDT  Reads: 502 \n\nBy Tad Anderson \nThis is the first DevOps book that shows a realistic and achievable view of the full implementation of DevOps. Most of the books and other literature I have read on DevOps are all about the culture, the attitudes, how it relates to Agile and Lean practices, and a high level view of microservices. This book includes all that, but they are not its main focus, and it goes several steps further with respect to the architecture and infrastructure needed for the implementation. \nSep. 14, 2015 10:45 AM EDT  Reads: 287 \n        ", "source": "SOA World Magazine"}