{"published": "2015-09-17T16:46:03Z", "media-type": "Blog", "title": "New York Times article on carried interest", "id": "e940b110-f947-486b-83ce-9238b0da66a5", "content": "James Stewart's article in today's NYT, \"Criticized by Trump, Carried Interest Loophole is Vulnerable,\" notes how Donald Trump's decision to denounce the rule that permits mega-rich hedge fund managers to pay tax on labor income (economically speaking) at capital gains rates, has helped contribute to a rising pro-repeal quasi-consensus.\nJust the other day, of course, Jeb Bush put repeal of the carried interest rule into his giant tax cut - evidently to drape a populist fig leaf over a predominantly pro-plutocratic proposal.  The Stewart article also notes evidence that Congressional Republicans are quite willing to accept repeal of the rule, in the context of a larger bipartisan deal, \"as long as they get something from Democrats in return.\"\nI'm quoted in the article as saying the following:\"The group that benefits [from the provision] may be small, but they're rich and they give a lot of money [to politicians] .... To everyone else it can seem a vague talking point.  It's classic interest group politics.\" I had in mind here, of course, the classic Mancur Olson point about concentrated interests having more political clout than diffuse interests, even when the latter have far more voters behind them.\nDespite the formidable political forces that continue to back the carried interest rule, I agree with others quoted in the article to the effect that its days may soon be over.  To some extent, it is a hostage to broader events.  I still view standalone repeal as highly unlikely, so the question is what packages that might include it will have decent legislative prospects, presumably in 2017 or thereafter.  And no one really knows that yet.\nIn any event, however, there is now a kind of structural asymmetry pushing against the carried interest rule, potentially with enough force to outweigh the structural imbalance in its favor that arises from interest group politics.  This is the fact that the issue's symbolic heft has come to outweigh, perhaps greatly, its actual practical significance.\nThe rule's survival, despite predominant criticism since Vic Fleischer first brought it to public attention in 2004, aptly symbolizes, even more particularly than interest group politics, the plutocratic turn that many (including me) believe U.S. politics has taken in the twenty-first century.  But repeal of the rule wouldn't rebut plutocracy's continued prevalence.  Symbolic hot-button issues only matter so much on the ground. So, while I would welcome its repeal - unless the \"price\" exacted was too high, as in the Jeb Bush fig leaf scenario - the broader political and economic significance that repeal would have can easily be overstated.", "source": "Start Making Sense"}