{"published": "2015-09-23T11:24:23Z", "media-type": "News", "title": "Mark S. Frey DDS Celebrates Over 20 Years Of Care In Sonoma County", "id": "28d67ceb-e3ea-45bb-ab06-a48b076ada45", "content": "  View as PDF    Print View      \nEmerging dental methods allow everyone from scaredy cats to those with challenging dental issues to achieve perfect smiles reports SantaRosaCosmeticDentist.com \n\nSanta Rosa, CA, United States of America - September 23, 2015 /MarketersMedia/ -- \n\nToday's society treats a person's appearance much like a career asset, in that a great deal of importance is placed on something as simple as a smile. In many cases, the first impression a person makes on another, be it for a job, a first date or meeting the in-laws, has much to do with the appearance of their teeth and the quality of smile which goes with it. For this reason, the US -- and California in particular -- have seen a dramatic increase in the number of cosmetic dental procedures in recent years. And while research shows most employers consider a person's smile to be an extremely important part of the appearance, from a psychological standpoint, whiter teeth and a bright smile convey trust. \n \nAccording to Santa Rosa Dentist Mark S. Frey, DDS , major changes are not always needed to improve a person's appearance or feelings about themselves. Says Frey, \"Even a subtle change in a smile helps to project an image of self-confidence and high personal esteem. When a person feels good about themselves, it shows in their appearance. While the first procedure most people think of is teeth whitening, there are a number of other procedures someone can use to improve their smile.\" \n \nMark S. Frey, DDS , a local general, family, and cosmetic dentist in Santa Rosa for 20 years, says technology has improved significantly in recent years allowing a great deal more than good oral health. Dr. Frey explains, saying, \"Although our primary mission is always better oral health, cosmetic dentistry goes well beyond this. We recognize that restored confidence in one's smile and appearance can be beneficial to patients as well. We are here to help individuals not only achieve proper oral health and hygiene, but also to provide a long-lasting positive impression on the people in their lives. This goal is aligned with our ongoing mission to remain Santa Rosa's Best Family and Cosmetic Dentist .\" \n \nFor many patients he's seen in his two decades of practice, comments Dr. Frey, the goal of achieving a beautiful smile comes at a price of overcoming their fear of dentists. \"We understand that sometimes the fear of going to the dentist may prevent patients from seeking out proper oral care and maintenance. To help with this, we offer an oral conscious sedation option to patients.\" This type of treatment is especially helpful for those who require a great deal of work done in a short period of time, says Frey. \"Oral conscious sedation can be a life-changing opportunity to receive the dental care needed, or the smile that you've always been hoped for.\" \n \nAbout Mark S. Frey, DDS: \n \nEstablished in 1996, Mark S. Frey, DDS is a family dental practice offering comprehensive general and cosmetic dental care. Their focus is providing exceptional state-of-the-art dentistry in an atmosphere of comfort and compassion. The practice employs the latest in dental technology such as digital x-rays, fluorescent light cavity detection, Invisalign, and in-office tooth whitening and the Waterlase, which allows them to perform many types of fillings and gum treatments without the need for using a local anesthetic. For entertainment and distraction, overhead monitors allow patients to watch their favorite tv shows or movies during treatment. \n \nDr. Frey hails from Pasadena, CA. He is a graduate of the University of Southern California School of Dentistry and completed a general practice residency in hospital dentistry at Rancho Los Amigos Medical Center in Downey, CA. Prior to coming to Santa Rosa, he served as the Director of Dental Services at Maua Methodist Hospital in Kenya. He is the chairperson of the Advisory Board to the dental hygiene and dental assisting programs at Santa Rosa Junior College. \n \nFor more information about us, please visit http://santarosacosmeticdentist.com \n\nContact Info: \nName: Mark Frey \nOrganization: Mark S. Frey, DDS \nPhone: (707) 800-3556 \n\nSource: http://marketersmedia.com/mark-s-frey-dds-celebrates-over-20-years-of-care-in-sonoma-county/91835 \n\nRelease ID: 91835 \n Recent Press Releases By The Same User \nCloud 2 Me Expands Cloud Hosting Services To Include Cloud Based Disaster Recovery (Wed 23rd Sep 15) \n\nSnakes And Slides Soft Play Awarded Mamas and Papas Best Soft Play Award Manchester (Wed 23rd Sep 15) \n\nVancouver Airport Limo Transfer & Pickup Service Celebrates 10 Years at YVR (Wed 23rd Sep 15) \n\nResidential Gateway Market to See a Growth of 7.82% CAGR to 2019 (Wed 23rd Sep 15) \n\nGlobal Glaucoma Treatment Market 2015 Trends & Opportunities Discussed in New Research Report (Wed 23rd Sep 15)", "source": "Free Press Release Center"}