{"published": "2015-09-24T15:15:34Z", "media-type": "News", "title": "Innodisk Announces New Cable-Less SATA Power Technology for Disk-On-Module SSDs", "id": "413b3e15-a7d3-44af-a76a-c6def83f5e94", "content": "GlobeNewswire \n2015-09-24 \nPatented New \"Pin 8 Vcc\" Powers Next Generation of SATADOM(r)\n                 Directly Through the SATA Connect \nTaipei, Taiwan, Sept. 24, 2015 (GLOBE NEWSWIRE) \n-- Innodisk, the\nservice-driven flash provider, announces its latest series of\nSATADOM(R) disk-on-module SSDs featuring a new cable-less power\ntechnology. This latest series of SATADOM(R) and ServerDOM(TM) come in\nthe same compact form factor but feature a new way of delivering power\nto the flash drive directly through the SATA connector itself for less\nclutter and superior reliability. The new patented Pin 8 technology\npowers a series of SATADOM(R) drives which will come in a variety of\ncompact form factors and flash flavors including SLC, MLC and iSLC, as\nwell as DRAM-less versions for 100% data integrity in the face of power\nloss. Besides SATADOM(R) with Pin 8 Technology, Innodisk is updating\nits full line of SATADOM(R) SSDs including SATADOM(R) powered by Pin 7\npower and external power cables. The new SATADOM(R) SSDs will feature\nhigher capacities and DRAM-Less SSD technology. \nSATA Pin 8 Vcc Power TechnologyPatented by Innodisk, SATA Pin 8 Vcc\nuses the SATA connector itself as a power supply to drive the device\nwithout external cables. Extra pins on each side of the drive's\nconnector mate with pins in the motherboard's SATA interface to provide\na power source that eliminates the need for cables. Already available\non motherboards from top manufacturers, Innodisk's Pin 8 Vcc technology\njoins Innodisk's SATA Pin 7 Vcc technology to enable compact, cableless\nSATA storage solutions. \n\nReliable Cable-Less StorageSATA Pin 8 Vcc Technology makes SATADOM the\nultimate plug and play storage with no extra connectors needed. It not\nonly provides power but the SATA connector's power pins create a robust\nphysical connection between the SSD and motherboard, increasing system\nreliability. The robust cableless design means less clutter and\nimproves air flow, especially in rackmount server chassis and low\nprofile system. \n\nThe Perfect Server OS StorageWith its small form factor, industrial\ngrade technologies and reliable power sourcing, SATADOM(R) provides the\nperfect compact flash storage for servers, and also comes in an even\nmore compact ServerDOM(TM) version especially designed for server\napplications. For high storage reliability, ServerDOM(TM) is compatible\nwith Intel RSTe technology and can be configured as a pair of SSD Boot\ndrives for OS redundancy. With its cable-less design, SATADOM is easily\nhot swappable with no extra connections to deal with. Using\nultra-compact Innodisk nanoSSD flash, ServerDOM(TM) has a slim form\nfactor that fits into some of the most low-profile rackmount and blade\nchassis for compact, reliable storage that eliminates messy cabling. \n\nAbout InnodiskInnodisk (Taiwan:5289) is a service driven provider of\nflash memory and DRAM products for the industrial and enterprise\napplications. With satisfied customers across the embedded, aerospace\nand defense, cloud storage markets and more, we have set ourselves\napart with a commitment to dependable products and unparalleled\nservice. This has resulted in products including embedded peripherals\ndesigned to supplement existing industrial solutions and high IOPS\nflash arrays for industrial and enterprise applications. The expanded\nbusiness lines are leading our next step in being a comprehensive\nsolution and service provider in industrial storage industry. \n\nFounded in 2005 and headquartered in Taipei, Taiwan with engineering\nsupport and sales teams in China, Europe, Japan, and the United States,\nInnodisk is able to support clients globally. With abundant experience\nand an unrivaled knowledge of the memory industry, Innodisk develops\nproducts with excellent quality, remarkable performance, great\ncost-efficiency, and the highest reliability. For more information\nabout Innodisk, please visit http://www.innodisk.com", "source": "BizWire Express"}