{"published": "2015-09-17T19:58:29Z", "media-type": "Blog", "title": "Air Waves - Parting Glances (2015)", "id": "cd34ab82-39f9-45e5-bac9-85ebb0cb45d2", "content": "High Speed Downloads Air Waves - Parting Glances (2015) [Full Version] 8946 downloads at 7 mb/s Air Waves - Parting Glances (2015) [All MP3] 9672 downloads at 11 mb/s Air Waves - Parting Glances (2015) Today, 21:58 Music | Indie | FLAC / APE Artist: Air Waves\nTitle Of Album: Parting Glances\nYear Of Release: 2015\nLabel: Western Vinyl\nGenre: Indie, Female Vocal\nQuality: 320 / FLAC\nTotal Time: 37:21 min\nTotal Size: 101 / 254 MB\nWebSite: Album Preview\nTracklist:\n1. Horse Race (3:02)\n2. Calm (2:30)\n3. Lines (3:38)\n4. Fantasy (3:44)\n5. Frank (2:51)\n6. Milky Way (3:46)\n7. Touch of Light (2:09)\n8. Thunder (4:52)\n9. Sweet Talk (2:09)\n10. Older (3:15)\n11. 1000 Degrees (2:46)\n12. Tik Tok (2:39)\nIn 2010 Nicole Schneit aka Air Waves released Dungeon Dots, an album Aquarius Records called \"…pretty much perfect pop music.\" For her new album Parting Glances, Schneit enlisted friends from Brooklyn's music community to contribute to the record, including members of Woods, Crystal Stilts, Ava Luna, and Hospitality. Additionally, Jana Hunter of Lower Dens contributes vocals to two songs. The album's title comes from the 1986 film Parting Glances in which Steve Buscemi portrays a gay man navigating the difficulties of being in a relationship in Reagan-era New York. More than just identifying with the story, Schneit is interested in the in the lasting effect of the parting glances we share with strangers in our everyday encounters. She explains \"You see all sorts of physical and emotional traits on the train. From people puking, making out, screaming, crying, laughing, dancing, grooming, etc. We encounter each other in the thick of our complex lives by simply looking at each other all the time. These glances are mundane and fleeting but also powerfully intimate.\" The lingering impact of those brief moments seeps into the details and imagery she delivers with energizing hooks and a disarming lack of pretense on Parting Glances.\nTURBOBIT\nor\nHITFILE\nor\nNITROFLARE\nAir Waves - Parting Glances (2015) - High Speed Download\r0\r0 voted Torrents search, please wait\rYou may also like: Steve Kuhn : Life’s Backward Glances–Solo and Quartet (2008)  FlacNightnoise - The Parting Tide (1990)Bad Habits - Parting Words [EP] (2013)Steve Khan - Parting Shot (2011) 320kbpsAt Daybreak - A Boxed Diorama Of The Parting Seas [EP](2010)Steve Kuhn - Life's Backward Glances (2008) Information\rWould you like to leave your comment? Please Login to your account to leave comments. Don't have an account? You can create a free account now.\rIsraBox » Music » Air Waves - Parting Glances (2015) Loading...", "source": "IsraBox.info"}