{"published": "2015-09-15T03:11:07Z", "media-type": "Blog", "title": "For Immigrants – And All of Us – A Time to Fight (Guest Voice)", "id": "f22f94b8-2c87-44d8-b277-25e147d09d99", "content": "For Immigrants – And All of Us – A Time to Fight \nby  Bernard Weisberger \n \n\n \nIt has so far annoyed but not really surprised me that Donald Trump, despite being an obnoxious bully, has defied expectations with a steady rise in the public opinion polls. It may be that his buffoonery and megalomania are simply more attractive to some early voters than rival candidates, with their solemn professions that what pushes them into the grind of campaigning is their dedication to promoting the public welfare. \n \nBut I am considerably more than annoyed when Trump puts himself at the head of the armies of the new nativism by using his bullhorn to echo the warnings of the movement’s Cassandras against the supposed “hordes” of undocumented immigrants pouring through our “open southern border.” His point of attack is the so-called “anchor babies” — children of pregnant mothers who supposedly sneak into the United States so that their children will be born here and automatically become citizens. \n \nThe hidden, malodorous and unproven subtext is that these children, entitled to the privileges of citizenship, will open the gates to legalizing the entry of family members, swarms of whom will qualify for welfare state entitlement programs, so that they may live in happy idleness at the expense of ¨real” American taxpayers. None of these suppositions has yet been proven by any serious evidence. \n \nSo thus far, disgusting enough. But when Trump dipped into the gutter to add to this repertory of lies and half truths one of the oldest and rankest — namely that Mexico was emptying its prisons and asylums to let rapists and thieves run free on our streets (a charge eagerly snapped up by the likes of O’Reilly and Limbaugh , and left unchallenged by many of Trump’s rivals for the nomination) – I boiled over. That’s crossing the line that separates debate from shameless indecency. \n \nI am a historian of the United States and have heard it all before, sometimes almost verbatim and no less gross. Our works of history rightly celebrate our role as a land of asylum and opportunity for people from almost everywhere on the globe. It’s a pillar of our cherished self-image as exceptional among nations. But they often overlook or minimize the contrasting truth that there was always stiff resistance to that hospitality. \n \nListen to this: “America has become the sewer into which the pollutions of European jails are emptied.” Substitute “Mexican” or “Latin American” for “European” and it could be straight out of Trump’s latest eruption. But it’s from a newspaper published in the 1850s by supporters of an anti-Catholic and foreigner-hating movement that began as a secret society whose members were ordered, when asked nosy questions, to say: “I know nothing.” Eventually, the “Know-Nothings” emerged into the open and organized themselves into a political organization that campaigned in 1854 as “the American Party.” \n \nIn that first off-year foray, the new entry won a number of state and local offices and some seats in both House and Senate. The basic glue that held Know-Nothing-ism together was hatred of the alien (especially the Irish). The slither of the Know Nothings into the American Party was a way of “protecting” America from the Pope’s minions and other evil foreign influences. Happily, 1854 was only a flash in the pan. When the party ran a national ticket headed by so respectable a figure as ex-US President Millard Fillmore, they won only a single state, Maryland. \n \n\n \nA Know-Nothing cartoon depicting stereotypes about whiskey drinking Irish and beer drinking Germans as they steal the ballot box while Americans fight at the polls. \n\n \nBy the time Abraham Lincoln ran for the Senate in 1858, two years before his presidential campaign, as many as half of the American people were the offspring of Europeans and could not trace their ancestry back to the stirring days of 1776. But if they looked at the Declaration of Independence, Lincoln said in a campaign speech in Chicago, they found the words “all men are created equal” became “the father of all moral principle in them, and they have a right to claim it as though they were blood of the blood, and flesh of the flesh of the men who wrote that Declaration, and so they are.” This self-evident truth of equal creation became the “electric cord that link[ed] the hearts of patriotic and liberty-loving men everywhere.” To be American was not about ancestry but to commit oneself heart and soul to the ideal of equality. \n \nA few years later, Lincoln was dead along with some 600,000 casualties of the Civil War, and a radical Republican Congress oversaw writing the Union’s victory into the Constitution via the Fourteenth Amendment. Its opening clause proclaimed, “All persons born or naturalized in the United States and subject to the jurisdiction thereof are citizens of the United States and of the State wherein they reside.” That flipped the prewar position, in which state citizenship was necessary to become a United States citizen, leaving room for states to refuse citizenship to “undesirables” like Negroes and foreigners. Now, no state could deny its born or naturalized resident citizens “the equal protection of its laws” or the guarantees of the Bill of Rights. \n \nThe Fourteenth Amendment clearly intended to make sure that the newly freed ex-slaves would have their full civil rights, though it would take a Fifteenth to specify that voting was included. The inclusion of children born in the United States to recent immigrants was almost incidental. That is the “error” that the enemies of birthright citizenship aim to correct. They argue that almost no other nations outside the Western hemisphere show such foolish generosity. Somehow, this is one issue on which they are willing to forget or forgo our proud exceptionalism. \n \nMeanwhile, American ports began receiving the first waves of an enormous and transformative mass migration — some 31 million between 1860 and 1930. They represented a “new” immigration: Chinese, Italians, Greeks, Poles, Russians, Syrians, Slovaks, Serbs, Armenians. To many so-called “old stock” Americans, millions of these newcomers were dangerous and unworthy, and to the members of an Immigration Restriction League – which included in its number many of “the best people” of New England – the immigrants were of the “wrong” religions and nationalities. Poet Thomas Bailey Aldrich explained that through our “unguarded gates” pressed, \n \n… a wild motley throng \nMen from the Volga and the Tartar Steppes… \nFlying the Old World’s poverty and scorn; \nThese bringing with them unknown gods and rites \nThose, tiger passions, here to stretch their claws. \n \nThe same old charges were recycled — newcomers threatened the jobs of Americans; they swelled the statistics of crime, violence and dependency; they clung stubbornly to their religions, customs and languages and could neither absorb nor understand the values of genuine Americans. \n \nA poster from the 1890s on the topic of barring Chinese immigrants from America. \n \nA poster from the 1890s on the topic of barring Chinese immigrants from America.[/caption]Eventually, the gates began to swing shut on unrestricted immigration. There was denial of entry to those convicted of crimes in their home countries — which might include rebellion against tyrannical regimes. Then, rejection for those harboring contagious diseases. A third barrier, literacy tests, never quite made it into law but in 1921 and 1924, laws were enacted that set overall limits on immigration, divided by “national origins” quotas that favored the descendants of pre-1860 immigrants, while sharply narrowing openings for the children and grandchildren of those who had come later. Asians were barred completely. \n \nBut those who squeezed through narrowed gates did what immigrants have always done when given a chance — assimilated the American values of the time, grabbed educational opportunities provided by the public school system, and by the millions took out the naturalization papers that gave them the ultimate step in acceptance — participating in democracy on an equal footing with the snootiest Mayflower descendant. So armed, they entered American politics and, over time, changed it for the better. \n \nA three-decade period of liberalism following the Depression, World War II and the assumption of an American global presence resulted in a 1965 change to the laws that replaced national origins quotas with others based on family reunification, specially needed skills, and refugee status. They erased the barrier to Asians altogether, setting off a new and continuing wave of immigration, still in progress. \n \nBut none of this will continue if the likes of Trump and his allies can help it. The children of that slandered “new” immigration helped to build our cities and dedicated their working lives in mines, mills and factories to make us a mighty industrial power. They fought and died in our wars. But for some “real Americans” that hasn’t been enough. So here we are again, in a period of reaction, staring into the ugly face of nativism. \n \nThe Know Nothing / American Party flag \n \nTrump’s announced intention to deport 11 million “illegals” while building a wall from the Pacific to the Gulf of Mexico at no cost — details conveniently not provided — is simultaneously savage and ludicrous. Yet what troubles me deeply is the possibility of this kind of cesspool politics finding wider acceptance, or being ignored apathetically by large numbers of Americans. Even more disturbing is the sluggishness of the response from Republican and Democratic opinion makers. Where is the outrage? Why is the counterattack left largely to Hispanic organizations? Why isn’t every decent media outlet shouting a few, simple home truths over the bullhorns of those insisting on their xenophobic lies? Such truths as these: \n The “illegals” are not indolent. For years now they have been picking our crops, nursing our elderly, cleaning our homes and babysitting our children. They are not freeloaders. That honor should be reserved for people like rancher Cliven Bundy who grazes his cattle on federally owned land but refuses to pay federal fees and taxes.  They do not take jobs from Americans. Their bottom-of-the-ladder, low-wage service jobs don’t pay enough to attract American workers, white or black. Probably as many or more job losses are caused by employers moving operations abroad — or automation, which is a generic problem for all of today’s workers.  They are not “takers.” They contribute positively to the economy through sales and excise taxes, and cannot claim Social Security, Medicare or other benefits because it would reveal their undocumented status — which makes them vulnerable to threats and exploitation by their bosses.  Their crime rates are comparable to those of the general population, allowing for differences in income and living conditions.  \nIt’s true that completely unregulated immigration may no longer be feasible. But the movement of people from poor and turbulent nations to wealthy, stable and reasonably free ones is happening all over the world. Our governments must come together in trade and economic treaties that level the playing field by helping to enrich and empower poorer peoples. Trade pacts need to elevate the status of working men and women rather than maximize the profits of corporations promising that some of the swag will mysteriously trickle down to “the lower orders.” \n \nUntil that miracle happens, no walls will keep desperate and courageous, motivated people from taking big risks to evade or scale them. Far better to provide our undocumented with reasonable and non-punitive paths to citizenship. \n \nAn illustration of immigrants on the steerage deck of an ocean steamer passing the Statue of Liberty from Frank Leslie’s Illustrated Newspaper, July 2, 1887. (Courtesy of National Park Service, Statue of Liberty NM) \n\n \nThat can’t take place when truth is befogged by racist and hateful lies, which is the reason that every school should teach and every network newscast should repeat this essential reality: the story of our nation’s long practice of welcoming immigrants and opening a wide door to full rights is an American triumph, all the more so because it has been achieved over constant resistance and with many relapses and setbacks. \n \nShould Trump and associates ever get their way, the symbol of America would change from the Statue of Liberty with her uplifted torch lighting the path through the golden door to one of the Wall, complete with searchlights, guard towers, barbed wire and watchdogs. May it never be so. \n \nBernard A. Weisberger is a historian who has been by turns a university professor, an editor of American Heritage and a collaborator on several of Bill’s documentaries. He is the author of Many People, One Nation, a history of immigration to the United States. This article was run on www.billmoyers.com and has been reposted here with their permission. \n \nThe post For Immigrants – And All of Us – A Time to Fight (Guest Voice) appeared first on The Moderate Voice .", "source": "The Moderate Voice"}