{"published": "2015-09-19T04:17:25Z", "media-type": "News", "title": "Know what compels you to watch horror shows!", "id": "1efb073c-8acb-4723-92aa-c82615fac9cb", "content": "New York: Ever wondered what makes horror so popular or why does something strange or even repulsive still make us want to look? This could well be because there is an attraction to \"oddities\" outside of our everyday experience, says a study. \n \n \nFor the research, Gary Vaughn, Associate Professor of English at the University of Cincinnati, looked into the underlying themes of the popular TV show, \"American Horror Story: Freak Show\". He examined the show in terms of its danger and allure of \"monsters\" as well as what he calls the show's \"bait-and-switch appeal to its audience that starts out in voyeurism but ends in reflection.\" \n\n\"While the plot landscape of 'Freak Show' may have more dead ends than a new sub-division and the blunt sexuality may make us squirm in horror more intellectual than psychological, these writing choices are, I believe, deliberate attempts to make us, the audience, confront our own stereotypes about difference and 'disability,'\" Vaughn said. \n\nVaughn explained that the beginning of this television viewing experience is similar to that of audiences that used to pay to take a seat at the carnival side shows of the 19th century - shows that featured the bearded lady or two-headed animals. \n\n\"As the series unfolds, we are forced to confront what we consider issues of freakishness,\" Vaughn noted. \"The 'freaks' in the series have their own sense of justice, their own sense of trust - sometimes misplaced - and their own ethics. In many instances, they demonstrate more admirable human qualities than the town's so-called ordinary characters,\" Vaughn explained. \n\nThe study will be presented at the conference of the Midwest Popular Culture Association/Midwest American Culture Association which will take place in Cincinnati, US between Oct 1-4. \n \nLatest News from Lifestyle News Desk", "source": "Jagran Post"}