{"published": "2015-09-03T06:34:49Z", "media-type": "Blog", "title": "InvestIdeas", "id": "f141b5ed-ef5d-46ee-8f03-0ef53a562325", "content": "InvestIdeas ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Singapore - Housing 16 (Mar 14 ... ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: HK - Housing 03 (Sep 13 - Dec ... ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Boredom Strikes! 05 (Jul 11 - Dec ... ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Indonesia :: Reply by behappyalways ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: China - Market Direction 02 ... ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Philippines :: Reply by ... ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Singapore - Economic Data ... ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: India 02 (Sep 11 - Dec 15) :: ... ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Singapore - Comm Properties ... ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Singapore - Politics 14 (Aug ... ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Singapore - Politics 14 (Aug ... ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Malaysia 03 (Aug 15 - Dec 16) ... ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Malaysia 03 (Aug 15 - Dec 16) ... ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Malaysia 03 (Aug 15 - Dec 16) ... ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Syria :: Reply by behappyalways ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: China - Economic Data & ... ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: China - Economic Data & ... ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: China - Economic Data & ... ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: China - Economic Data & ... ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: China - Economic Data & ... ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Korea ( South & North ) 03 ... ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: HK - Economic Data & News ... AMERICAS & EUROPE: Data, News & Commentaries :: Photos 07 (Apr 14 - Dec 15) :: Reply by ... AMERICAS & EUROPE: Data, News & Commentaries :: Re: US - Market Direction 36 (Oct 14 - ... Other Investment Instruments & Ideas :: Re: Global Economic Data & News :: Reply by winston Other Investment Instruments & Ideas :: Re: Market Timing 04 (Mar 14 - Dec 15) :: Reply by ... Other Investment Instruments & Ideas :: Re: Trader's Thread 04 (Feb 12 - Dec 15) :: Reply ... Other Investment Instruments & Ideas :: Re: Fund Flows :: Reply by winston Other Investment Instruments & Ideas :: Re: School of Hard Knocks 03 (Feb 13 - Dec 15) :: ... Other Investment Instruments & Ideas :: Re: School of Hard Knocks 03 (Feb 13 - Dec 15) :: ... Other Investment Instruments & Ideas :: Re: Risks Out There 03 (Aug 14 - Dec 15) :: Reply ... Other Investment Instruments & Ideas :: Re: Risks Out There 03 (Aug 14 - Dec 15) :: Reply ... Miscellaneous :: Re: Success University 21 (Apr 15 - Dec 15) :: Reply by winston Miscellaneous :: Re: Life 24 (Feb 15 - Sep 15) :: Reply by winston Miscellaneous :: Re: Utopia :: Reply by winston Miscellaneous :: Re: Utopia :: Reply by winston Miscellaneous :: Re: Music & Songs 04 (Aug 12 - Dec 15) :: Reply by winston Miscellaneous :: Re: Health 09 (Jun 15 - Dec 15) :: Reply by winston Miscellaneous :: Re: Animals & Pets 02 (Jul 14 - Dec 15) :: Reply by behappyalways Miscellaneous :: Re: Beware & Protect Yourself 04 (Dec 14 - Dec 15) :: Reply by behappyalways Miscellaneous :: Re: Games, Toys, Puzzles etc :: Reply by behappyalways Miscellaneous :: Re: Games, Toys, Puzzles etc :: Reply by behappyalways Miscellaneous :: Re: Videoclips (General) 04 (Apr 15 - Dec 15) :: Reply by behappyalways Miscellaneous :: Re: Videoclips (General) 04 (Apr 15 - Dec 15) :: Reply by behappyalways Miscellaneous :: Re: Can U believe this ? 06 (Apr 15 - Dec 15) :: Reply by behappyalways Miscellaneous :: Re: Food & Drinks 02 (Jan 11 - Dec 15) :: Reply by behappyalways ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Singapore - Housing 16 (Mar 14 ... Posted: 02 Sep 2015 01:31 AM PDT Prime suburban condo Shunfu Ville put up for en bloc sale for over $688m http://sbr.com.sg/residential-property/ ... -over-688m ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: HK - Housing 03 (Sep 13 - Dec ... Posted: 02 Sep 2015 02:58 PM PDT Shutdowns, rent cuts as retail blues bite Several luxury goods and jewelry retailers along with sellers of less upmarket items are scaling back in Hong Kong as fewer tourist arrivals eat into profits. Those who remain are winning steep rental cuts from landlords.\nShoe-seller Belle International (1880) closed the last of the seven Belle outlets in Hong Kong on Monday, Ming Pao reported, citing slim business.\nMeanwhile, Emperor Watch & Jewellery (0887) has decided to give up in October its store on the ground floor of the Emperor Watch & Jewellery Centre on Russell Street, Causeway Bay, which boasts some of the world's highest retail rents. The site will be leased to local cosmetic chain Bonjour (0653) at a steep 42 percent discount.\nThe rent for the 3,068-square-foot space will plunge to HK$1.6 million a month from the current HK$2.76 million.\nThe government revealed on Monday that mainland visitor numbers slumped 9.8 percent in July from a year back.\nSun Hung Kai Properties (0016) leasing manager Henry Lam Ka-keung said sales value of jewels and watches at the developer's malls have this year dived 7-8 percent from a year back.\nThe developer opened the first phase of its Yuen Long retail complex Yoho Mall yesterday, and Lam said as the shopping arcades target local consumers, there is only mild impact on business.\nSource: The Standard ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Boredom Strikes! 05 (Jul 11 - Dec ... Posted: 02 Sep 2015 06:46 PM PDT Who are Japan's Yakuza? In 60 seconds\nhttp://www.bbc.com/news/world-asia-34134880 ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Indonesia :: Reply by behappyalways Posted: 02 Sep 2015 06:48 PM PDT Indonesians protest against job cuts\nhttp://www.bbc.com/news/business-34122232\nIndonesian leader vows 'massive deregulation' to win investment\nhttp://sgx.i3investor.com/servlets/fdnews/53670.jsp ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: China - Market Direction 02 ... Posted: 02 Sep 2015 06:54 PM PDT China's Searching for Stock Market Scapegoats http://www.bloomberg.com/news/articles/ ... scapegoats ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Philippines :: Reply by ... Posted: 02 Sep 2015 07:24 PM PDT Record Philippine Equity Outflows to Continue, Coconut Bank Says http://www.bloomberg.com/news/articles/ ... -bank-says ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Singapore - Economic Data ... Posted: 02 Sep 2015 07:40 PM PDT Singapore's August PMI contracts further to 49.3\nhttp://sgx.i3investor.com/servlets/fdnews/53681.jsp ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: India 02 (Sep 11 - Dec 15) :: ... Posted: 02 Sep 2015 07:44 PM PDT Jim Rogers exits India, says one can't invest just on hope\nhttp://www.livemint.com/Money/Hii5Nshpl ... -hope.html ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Singapore - Comm Properties ... Posted: 02 Sep 2015 08:18 PM PDT Office REITs brace for trouble as Grade A rents head south\nhttp://sbr.com.sg/commercial-property/n ... head-south ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Singapore - Politics 14 (Aug ... Posted: 02 Sep 2015 02:20 AM PDT GE2015\nhttp://www.straitstimes.com/container/k ... age-ge2015 ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Singapore - Politics 14 (Aug ... Posted: 02 Sep 2015 08:48 PM PDT WP comes out swinging, sets record straight on AHPETC\nhttp://www.theonlinecitizen.com/2015/09 ... on-ahpetc/\nBalakrishnan should look at his party's own track record: SDP's Dr Chee\nhttp://www.theonlinecitizen.com/2015/09 ... s-dr-chee/\n#GE2015 Day 2 Diary: Of gender equality fails and rallies\nhttp://www.theonlinecitizen.com/2015/09 ... d-rallies/\nExclusive: TOC interviews Samir Neji, Bukit Batok SMC's unexpected contender\nhttp://www.theonlinecitizen.com/2015/09 ... contender/\nLTK: Do you want more PAP MPs in Parliament?\nhttp://www.tremeritus.com/2015/09/03/lt ... arliament/ ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Malaysia 03 (Aug 15 - Dec 16) ... Posted: 02 Sep 2015 02:53 PM PDT The rich poorer by RM16bil\nhttp://www.thestar.com.my/Business/Busi ... ?style=biz ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Malaysia 03 (Aug 15 - Dec 16) ... Posted: 02 Sep 2015 07:58 PM PDT 1MDB not the only problem facing M'sia: Investment guru\nhttp://www.dailyexpress.com.my/news.cfm?NewsID=102840 ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Malaysia 03 (Aug 15 - Dec 16) ... Posted: 02 Sep 2015 08:51 PM PDT Swiss freeze millions amid investigations of Malaysian fund\nhttp://www.cnbc.com/2015/09/02/1mdb-sca ... -fund.html ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Syria :: Reply by behappyalways Posted: 02 Sep 2015 08:56 PM PDT Russian troops 'fighting alongside Assad's army against Syrian rebels'\nhttp://www.telegraph.co.uk/news/worldne ... ebels.html ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: China - Economic Data & ... Posted: 02 Sep 2015 05:22 AM PDT This Indirect Indicator Tells You How Dire China's Economic Situation Really Is By Valentin Schmid\nForget about the purchasing managers surveys, which tell you industrial activity in China is grinding to a complete halt. Not 7 percent growth, not 6 percent growth—zero growth.\nLombard Street Chief Economist Says Chinese Economy Actually Contracted in First Quarter\nOk, let's not completely forget about them. The official survey of purchasing managers in manufacturing for August declined to 49.7 from 50, which signals recession. Another representative survey done by Caixin declined to 47.3, the lowest level since 2009 or the depth of the great recession.\nHowever, the real interesting data about China came out of Korea on Tuesday, Sept. 1. The South East Asian powerhouse reported a complete collapse in trading activity. Exports in August crashed 14.7 percent compared to a year earlier and imports declined 18.3 percent.\nThe country still logged a positive trade balance of $4.3 billion, but this figure is shrinking fast—not very surprising given the collapsing volume of trade.\nSince a quarter of Korean exports go to China, the figure is representative of the slowdown within the Chinese economy. Exports to China are down 8.8 percent over the year, despite a rise of 12 percent in the Chinese yuan over the same period. The stronger currency made imports cheaper and should have spurred demand for Korean products, but it didn't. So even as China's balance of trade shrinks, the aggregate drop in activity (both imports and exports decline) is causing havoc among its trading partners who are used to shipping vast quantities of raw materials (Brazil, Australia, Canada) or equipment (Korea, Germany, Japan) into China, which then uses the inputs to export a vast amount of consumer goods to the rest of the world. Source: Epoch Times ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: China - Economic Data & ... Posted: 02 Sep 2015 04:56 PM PDT On America as the enemy\n\"Who seized most territory from China? The Russians. Who never did that? The Americans. Who opposed China becoming a permanent member of the UN Security Council? The Russians. Who supported us on that issue? The Americans. Who recalled all their experts when China needed them most? The Russians. Who opened their market to us when we needed help? The Americans. And now, who is our friend? The Russians. Who is our enemy? The Americans. Source: Weibo ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: China - Economic Data & ... Posted: 02 Sep 2015 04:59 PM PDT On China claiming credit for defeating Japan in World War II\n\"Teacher: who can tell a time-travel story in one sentence? Student: A regime founded in 1949 won a war in 1945.\"\nSource: Weibo ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: China - Economic Data & ... Posted: 02 Sep 2015 06:22 PM PDT Lavish China parade to commemorate WW2 victory\nhttp://www.bbc.com/news/world-asia-china-34125418 ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: China - Economic Data & ... Posted: 02 Sep 2015 09:55 PM PDT 【大閱兵】習近平：裁軍30萬 中國永不稱霸 http://hk.apple.nextmedia.com/realtime/ ... 3/54161919 ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: Korea ( South & North ) 03 ... Posted: 02 Sep 2015 10:08 PM PDT 我哋又再見喇！\n高麗航空索空姐熟口熟面 http://hk.apple.nextmedia.com/internati ... 1440904781 ASIA, OCEANIA & AFRICA: Data, News & Commentaries :: Re: HK - Economic Data & News ... Posted: 02 Sep 2015 10:22 PM PDT 觸動警鐘試探\n狡賊掠150萬元蟲草 http://hk.apple.nextmedia.com/news/art/ ... 1440904781 AMERICAS & EUROPE: Data, News & Commentaries :: Photos 07 (Apr 14 - Dec 15) :: Reply by ... Posted: 02 Sep 2015 06:44 PM PDT 'If these images don't change Europe, what will?'\nhttp://www.aljazeera.com/news/2015/09/i ... 04564.html AMERICAS & EUROPE: Data, News & Commentaries :: Re: US - Market Direction 36 (Oct 14 - ... Posted: 02 Sep 2015 08:06 PM PDT Is Another Global Financial Crisis on the Horizon?\nhttp://www.bloomberg.com/news/videos/20 ... e-horizon- Other Investment Instruments & Ideas :: Re: Global Economic Data & News :: Reply by winston Posted: 02 Sep 2015 03:02 PM PDT Weak factory data grips globe\nChina's giant manufacturing sector contracted the most in six years in August, while a private survey found that growth in US manufacturing slowed last month to the lowest pace in more than two years, reinforcing expectations that policymakers will need to ease policy further.\nManufacturers across Asia struggled last month, a series of surveys showed, denting hopes of a pick-up in the second half of the year as the region tries to fire its traditional growth engine of exports.\nEuro zone manufacturing growth also eased last month, despite factories barely raising prices, adding to the European Central Bank's woes as it battles to spur expansion and inflation.\nThe Chinese government's measure of manufacturing showed activity contracted at the fastest pace in three years, while a survey by Markit, which focuses more on smaller, private firms, showed the factory sector's weakest performance in 6 years.\nEven China's services sector, which has been one of the few bright spots in the sputtering economy, showed alarming signs of cooling, expanding at its slowest rate in more than a year, Markit said. \"Today's reading suggests that manufacturing activities in China remain weak. We now expect GDP to grow by an annual 6.4 percent in the third quarter,\" ANZ said, saying further policy support would help growth rebound to 6.8 percent in the fourth quarter.\nIn the United States, the Institute for Supply Management, a trade group for purchasing managers, reported that its manufacturing index slid to 51.1 last month from 52.7 in July.\nIt was the second straight drop and marked the weakest reading since May 2013. Anything above 50 signals growth. Source: AGENCIES Other Investment Instruments & Ideas :: Re: Market Timing 04 (Mar 14 - Dec 15) :: Reply by ... Posted: 02 Sep 2015 03:21 PM PDT When Will It End? History Shows U.S. Stocks Rebound Needs Months\nhttp://www.bloomberg.com/news/articles/ ... 090215_BIZ Other Investment Instruments & Ideas :: Re: Trader's Thread 04 (Feb 12 - Dec 15) :: Reply ... Posted: 02 Sep 2015 03:35 PM PDT If you're sitting on large losses right now, here's what to do by Justin Brill\nIf you're holding large losses today, it's likely due to a few reasons…\nYou may have too much money in stocks (poor asset allocation), too much money in individual positions (poor position sizing), and/or you didn't have a defined exit strategy (you didn't use – or didn't follow – trailing stops).\nIf you find yourself in this position, the first thing you must do is decide on an exit strategy immediately…\nWhat you decide will depend on your circumstances. But you need to know when or why you'll sell each position you own.\nIf you have too much money in stocks or too much money in individual positions, this will likely include \"lightening up\" or selling some immediately.\nIf you didn't use trailing stops – or if you ignored the ones you set – you need to set them now. If you can't stand any more losses, that may mean selling today.\nThe key point is you must define exactly how much more you're willing to lose and stick to that strategy no matter what. Hoping your investments \"come back\" is not a viable strategy.\nTaking losses is always tough, but it's often the best thing you can do. As our colleague Jeff Clark shared in a private e-mail today…\nThe simplest solution is to just take the hit and move on. This is also the most therapeutic solution. Losing money is stressful. And that stress can interfere with one's ability to think clearly. Once you take the loss, you eliminate that stress and can now evaluate the situation with a clear head.\nUnfortunately, there's no painless solution to large losses. But many new investors have made similar mistakes. The important thing is that you don't allow a big loss to turn into a catastrophic loss that wipes out your portfolio. And then make sure you learn from the experience.\nAs Doc Eifrig's senior analyst Matt Weinschenk reminded us in a note this morning, the only way to prevent these kinds of losses again is to prepare in advance…\nYou have no control over the market. You cannot will your stocks back up or \"trade your way\" to even. This is the last piece of evidence you need to see that investing is about preparation, not reaction.\nAs of this morning, the market appears to be powering higher. That's in your favor. It's our opinion that the market will rally and we'll be back in the black in no time. But you can take an honest appraisal of your holdings and decide what's truly a quality investment, and what's junk. Get rid of the junk, hold the quality, and wait for them to come back. Take a look at stellar stocks you may have missed out on. If you can get a good deal on them today, those cheap stocks may help offset some losses.\nYour real move here, though, is to prepare for next time. The market will have corrections like this again. It will have much worse ones. You need to understand position sizing, asset allocation, and trailing stops, and you need to prepare yourself mentally to trust in a proper plan and ride out market turmoils like these.\nSource: Stansberry Digest Other Investment Instruments & Ideas :: Re: Fund Flows :: Reply by winston Posted: 02 Sep 2015 04:58 PM PDT Advisors Grab Cash, Bonds and Gold\nhttp://thereformedbroker.com/2015/08/31 ... -and-gold/ Other Investment Instruments & Ideas :: Re: School of Hard Knocks 03 (Feb 13 - Dec 15) :: ... Posted: 02 Sep 2015 03:11 PM PDT From Tulips to Dragons By Harry S. Dent Jr.\nThere's a reason why I warn you to get out of a bubble a little early rather than a little late. It's because the first wave down tends to happen in a matter of a few weeks or months, sometimes days. It's fast and furious.\nI know this because I've studied every major bubble in modern history – all the way back to the infamous tulip bubble in 1637, when a single tulip cost more than most people made in a single year! And what I've seen in each case, without exception, is that bubbles do not correct in nice stair steps when they're coming off their highs. They burst, crash, collapse, clatter, clang – however you want to say it!\nIt's Only Going to Get Worse!\nOn August 24th, the Dow dropped a record-breaking 1,089 points in the first few hours of trading. Since then, it has bounced 919 points and today it's been down as much as 400 points. China is even worse, losing 25.1% in just five trading days. As we head deeper into crash season, this kind of volatility is par for the course. Things are only going to get worse.\nBelow I have four charts that make the argument for me. They show the 1929 bubble burst… the 1987 crash… the 2000 \"Tech Wreck\"… and the latest of 2015 from the Red Dragon itself – China's Tsunami.\nIn each case, the fact that these bubbles were destined to burst were only obvious to the few that weren't in denial. Most give into the bubble logic that new highs are the new norms. They think: \"This time is different.\" It's not! It never is. It's always hard to predict exactly when bubbles will peak and crash. It's like dropping grains of sand on the floor. A mound will build up – becoming like a Hershey's kiss that grows more narrow at the top. At some point, one grain of sand will cause the avalanche. Who knows which grain of sand that one will be!\nHere are those charts. Like I said, they speak for themselves!\nBubbles\nSee larger image\nWhat does that tell you!? EVERY bubble bursts. Bam, pow – no exceptions! So hopefully you understand why I keep harping on about this.\nI'm just as amazed as anyone that this global bubble has gone on as long as it has. But it's finally started to crash.\nYou can tell by following a series of recent tops in major markets:\nTransports in November…\nUtilities in January…\nGermany's DAX index and Britain's FTSE in April…\nWhat looks to be the Dow and S&P 500 in May…\nChina's Shanghai index in June…\nAnd the Nasdaq looks to have peaked in July.\nNow that we're in the classic \"crash season,\" the situation only looks worse. This season technically started in mid-August, and won't end until mid-October. This is not to say the chaos won't continue later on into the end of this year. It just means the worst decline, this first wave down, is likely to come in the next several weeks.\nSo consider this current bounce a gift. The signs are all there that this global bubble is done. Use this time to get out of any passive investments in stocks.\nSource: Economy & Markets Other Investment Instruments & Ideas :: Re: School of Hard Knocks 03 (Feb 13 - Dec 15) :: ... Posted: 02 Sep 2015 05:01 PM PDT 5 Investing Quotes for Recessions By Ben Reynolds\nSource: GuruFocus\nhttp://www.thetradingreport.com/2015/09 ... ecessions/ Other Investment Instruments & Ideas :: Re: Risks Out There 03 (Aug 14 - Dec 15) :: Reply ... Posted: 02 Sep 2015 07:32 PM PDT Will Oil Cause the Next Recession?\nhttp://www.bloombergview.com/articles/2 ... uld-follow Other Investment Instruments & Ideas :: Re: Risks Out There 03 (Aug 14 - Dec 15) :: Reply ... Posted: 02 Sep 2015 08:07 PM PDT Is Another Global Financial Crisis on the Horizon?\nhttp://www.bloomberg.com/news/videos/20 ... e-horizon- Miscellaneous :: Re: Success University 21 (Apr 15 - Dec 15) :: Reply by winston Posted: 02 Sep 2015 02:26 AM PDT The Law of ACTION Attraction\nBy Craig Ballantyne\nThe Law of ACTION Attraction: When you do the work, when you do great things, when you add value, people will notice & will want to help you out. Develop clarity of purpose. Know what counts. Focus your energy & effort here. This is your one and only chance…so live a life that matters. Play up a level. Expect more of yourself. Get out of your comfort zone. Add Value. Encourage others. M\nake an impact. Surround yourself with positive people. Get rid of the toxic ones in your life. You become whom you associate with.\nSource: ETR Miscellaneous :: Re: Life 24 (Feb 15 - Sep 15) :: Reply by winston Posted: 02 Sep 2015 03:24 PM PDT What are the qualities of a true friend? True friends are those who help in uplifting your life by cleansing your ideals and emotions. Those who drag you into pomp, pedantry, paltry entertainment and petty pranks are enemies, not friends. True friends cannot be won by social status, external scintillation or verbal assertions. A friendship knit by monetary bonds is disrupted as soon as you ask the loan to be repaid. So, when you oblige your friend with a loan, the friendship too is broken at that very moment. How can friendship be cemented by words or by coins? The feeling of friendship must activate every nerve, permeate every blood-cell, and purify every emotional wave; it has no place for the slightest trace of egotism. The companionship which seeks to exploit or fleece for personal benefit cannot be elevated into the noble quality of friendship. Perhaps, the only friend who can pass this rigorous test, is the Divine.\n- Divine Discourse, May 24, 1973.\nAmong the nine forms of devotion, the foremost is the cultivation of the sakhya (friendship) of the Divine. Source: radiosai.org Miscellaneous :: Re: Utopia :: Reply by winston Posted: 02 Sep 2015 05:39 AM PDT \"We want a society where people are free to make choices, to make mistakes, to be generous and compassionate. This is what we mean by a moral society; not a society where the state is responsible for everything, and no one is responsible for the state.\"\n- Margaret Thatcher Miscellaneous :: Re: Utopia :: Reply by winston Posted: 02 Sep 2015 03:45 PM PDT TOL:-\nInstead of having parades to display our weapons etc. and be proud of it, wouldn't it be better to be proud of our character, virtue, human rights etc ?\nNot to mention that the amount of money spent on such parades, which could be better use to take care of the poor, aged and sick.\nIsn't it a coincident that the democratic countries do not really have military parades while the non-democratic countries are always so proud of displaying their weapons ? Miscellaneous :: Re: Music & Songs 04 (Aug 12 - Dec 15) :: Reply by winston Posted: 02 Sep 2015 04:48 PM PDT 3 Good Reasons You Should Be Listening To More Music\nBy Michael Tyrrell\nSource: www.wholetones.com\nhttp://www.theepochtimes.com/n3/1737610 ... campaign=1 Miscellaneous :: Re: Health 09 (Jun 15 - Dec 15) :: Reply by winston Posted: 02 Sep 2015 04:49 PM PDT 9 Toxic Toothpaste Ingredients That You Need to Avoid for Good Oral Health\nBy Michael Edwards\nSource: www.organiclifestylemagazine.com\nhttp://www.theepochtimes.com/n3/1736254 ... campaign=4 Miscellaneous :: Re: Animals & Pets 02 (Jul 14 - Dec 15) :: Reply by behappyalways Posted: 02 Sep 2015 06:27 PM PDT cute-animals\nhttp://www.bbc.com/earth/story/20150902-cute-animals Miscellaneous :: Re: Beware & Protect Yourself 04 (Dec 14 - Dec 15) :: Reply by behappyalways Posted: 02 Sep 2015 09:19 PM PDT Three arrested in Paris over 'devil's breath' drug that turns victims into willing 'zombies'\nhttp://www.telegraph.co.uk/news/worldne ... mbies.html Miscellaneous :: Re: Games, Toys, Puzzles etc :: Reply by behappyalways Posted: 02 Sep 2015 06:52 PM PDT New ranges send Lego sales soaring in first half\nhttp://www.bbc.com/news/business-34125413 Miscellaneous :: Re: Games, Toys, Puzzles etc :: Reply by behappyalways Posted: 02 Sep 2015 09:26 PM PDT Everything is awesome for Lego\nhttp://www.telegraph.co.uk/finance/news ... -Lego.html\nbehappyalways wrote:New ranges send Lego sales soaring in first half\nhttp://www.bbc.com/news/business-34125413 Miscellaneous :: Re: Videoclips (General) 04 (Apr 15 - Dec 15) :: Reply by behappyalways Posted: 02 Sep 2015 08:59 PM PDT Watch Tens of Thousands of Hindus Gather for Kumbh Mela Festival\nhttp://time.com/4019835/kumbh-mela-video/ Miscellaneous :: Re: Videoclips (General) 04 (Apr 15 - Dec 15) :: Reply by behappyalways Posted: 02 Sep 2015 10:06 PM PDT 白雲區四日兩血案\n悍匪為搶手袋斬夜歸女 http://hk.apple.nextmedia.com/internati ... 1440904781 Miscellaneous :: Re: Can U believe this ? 06 (Apr 15 - Dec 15) :: Reply by behappyalways Posted: 02 Sep 2015 10:20 PM PDT 娛圈360：抗日神劇鬥奇技 http://hk.apple.nextmedia.com/entertain ... 1440904781 Miscellaneous :: Re: Food & Drinks 02 (Jan 11 - Dec 15) :: Reply by behappyalways Posted: 02 Sep 2015 10:28 PM PDT 【今日少鹽】三文治都高鈉？\n芝腿勁過鹹牛肉 http://hk.apple.nextmedia.com/news/art/ ... 1440904781 You are subscribed to email updates from InvestIdeas To stop receiving these emails, you may unsubscribe now. Email delivery powered by Google Google Inc., 1600 Amphitheatre Parkway, Mountain View, CA 94043, United States", "source": "fool"}