{"published": "2015-09-18T11:30:01Z", "media-type": "News", "title": "1965 Indo-Pak War Indian Armys performance surprised the world", "id": "f1d18d57-8a13-499f-b745-9c2bf416c009", "content": "Afghanistan News.Net  Friday 18th September, 2015  \n During the last fortnight, we have been a witness to the recollection of various battles fought during the India -Pakistan War of 1965. The display at India Gate gives us a vivid account of those operations. \nThe war had followed the conflict in Kutch earlier that year, as well as the massive infiltration into Jammu and Kashmir in the summer and the invasion of Chaamb -Jaurian on September 1. \n \nThe Indian Army tried its best to halt the advance of the Pakistan Army in Chhamb. The Indian Air Force also tried to stop the invading Pakistanis, but suffered heavy losses. \n \nIndia responded by invading Pakistan on September 6. The thrust was towards Lahore from three directions, from Wagah to Dograi on the Grand Trunk Road, from Harike-Khalra to Burki and Khem Karan-Kasur Axis. \n \nThough posted in Shillong and on leave, I joined duty. Posted as public relations officer for the Lahore Sector with my office in Amritsar, I had the opportunity of covering the war in that sector. \n \nThe war was not expected to conclude the way it did by many experts in the West. To start with, many analysts thought that by attacking India in the Chhamb sector, Pakistan had played an ace. Western press correspondents, who went with the forward echelons of the Pakistan Army, wrote glowing reports of its performance. \n \nThe impression was that Pakistan Army and Air Force was better equipped. The impression was that the Patton tanks were invincible as compared to World War II vintage Shermans and Centurions that India had. The Sabres and supersonic Starfighter of the PAF were considered far superior to the Indian Vampires and Myster \n \nes. So also the B-57 Bombers to the Canberras and Hunters that the Indian Air Force had. No one thought of the dimunitive Gnat, which proved to be more than its weight during the war \n \nTo start with, there was a great deal of criticism of India for not giving access to the theatre of war to the press, particularly the foreign press, during the war. Much of the criticism was based on the precedent when India kept the media at arms length during the 1962 operations against China. \n \nIt took almost a week for the Government of India to give access to the media to the theatre of operations. I had the privilege of covering the attack by the Pakistan Air Force on Kalaikunda I was passing through Kharagpur, when the attack was in progress. I got down at the station and rushed to the base at Kalaikunda, and could take a picture of the Pakistan Air Force aircraft shot down by us. My Director, G.G. Mirchandani, appreciated my effort and posted me to Amritsar. \n \nI boarded an Indian Air Force aircraft going from Barrackpore to Delhi, got myself briefed and proceeded to Amritsar. During the rest of the war, I was on the move, along the road to Khem Karan, Burki, and on the Wagh -Lahore Axis. The formation in charge of the operations was the II Corps, commanded by Lt.Gen. Jogi Dhillon. \n \nI had the opportunity of taking press parties to Burki, and showing them Burki village, which was captured by us. I also took media persons and got briefed by Brigadier Theograj of the 2nd Armoured Brigade, as to how we were able to water the fields and make easy targets of the Patton tanks, which got bogged down. Lt. Col A.S. Vaidya and Lt Col Salim Caleb, who commanded armoured regiments briefed us on how they were able to attack the Pattons. Both of them won the Maha Vir Chakra. \n \nThe Pakistan Army, which had made advances into Khem Karan, saw fierce battles at Asal Uttar. The Armoured Division of the Pakistan Army withdrew and moved to Sialkot where we had opened a new front. \n \nI had met Lt.Col. Desmond Hayde, the Commanding Officer of the 3 Battalion of the Jat Regiment, who had reached Dograi on the 6th of September. But, as the supporting troops did not reach, he had to fall back. He told me that he planned to recapture Dograi on 22nd September evening. \n \nWe had heard that the war was going to conclude soon after midnight on September 22 as per the resolution of the Security Council of September 20 \n \nI decided to go to the Wagah on the previous day. As I drove, I heard shells whizzing past. As the evening approached, heavy shelling stated and I was invited by a unit commander to come to his dug-out , which I did. I was advised that returning to Amritsar was out of question because of the heavy shelling. \n \nAt dawn, I drove to Dograi unsure about the outcome of the battle. As I reached Dograi, I was told that we had succeeded in pushing the Pakistanis beyond the Icchogil Canal after a fierce battle. One witnessed devastation all round. At Dograi, I witnessed some Pakistani trucks being loaded with the dead bodies of Pakistan soldiers. The stench was overpowering. \n \nAround noon, some well-clad civilians from Amritsar drove down from Amritsar. They were joined soon by some pyjama-kurta clad persons from Lahore. They seemed to know each other and the usual warm greetings and hugs followed. A Pakistan Junior Commissioned Officer, who was supervising the collection of Pakistani dead solders, could not hide his anguish When he saw the civilians hug one another, and he remarked to me: \"Major Saheb, these people make us fight and kill each other, but see what they are doing.\" \n \nThrough wireless, I had contacted my office in Amritsar and sent a message to Delhi. Media representatives were flown to cover the events. \n \nWar over, one felt that public interest would also fade. But the number of press correspondents visiting the area was on the upswing. Dogri, Burki, Asal Uttar continued to be generate news stores. The Western Press was keen to find out why the Patton tanks suffered the fate they did. A visit to Patton Nagar near Bhikhiwind was a must for the foreign press. \n \nMr. I. Ramamohan Rao retired as Principal Information Officer of the Government of India. \n \nBy I. Ramamohan Rao (ANI)", "source": "AfghanistanNews.Net"}