{"published": "2015-09-28T11:12:11Z", "media-type": "News", "title": "Oracle Platinum Partner GSI Achieves Inc. 5000 List for 2nd Year Running", "id": "edbba71b-4337-4c4e-8578-3795f18637b3", "content": "GSI, Inc. has once again been named in the Inc. 5000 list of fastest-growing companies. Each year, Inc. ranks the fastest-growing private companies in America, and GSI, Inc. has been named on the list for the second consecutive year. \n\nGSI, Inc. President and CEO, Kevin R. Herrig, said about this achievement, \"The entire GSI Family is honored to appear on this prestigious list for the second year running. GSI prides itself on providing A+ service to both its employees and clients. This fundamental philosophy of delivering unmatched customer service combined with our industry exclusive 100% Guarantee is the key to our company's growth. Our business has great momentum and we will continue to drive growth by exceeding our employees' expectations and our customers' expectations... day after day, year after year.\" \n\nMore information about the award can be found here: http://www.inc.com/profile/gsi. \n\nAbout GSI, Inc. \n\nAs a certified Oracle Platinum Partner and a recognized industry leader, GSI, Inc. (http://www.getgsi.com) specializes in providing a broad spectrum of business, functional, and technical consulting services for Oracle JD Edwards and Oracle Cloud. \n\nThe client-centric consultancy offers a comprehensive suite of solutions for JD Edwards including JDE Cloud9, a complete cloud-based hosted service, AppCare, a 24/7 managed service, GENIUS Advanced Monitoring, a toolset for addressing the most challenging system performance issues, GENISYS, a solution for modelling, measuring and maximizing system performance, as well as RapidReconciler(R), its inventory reconciliation software. \n\nGSI, Inc. also provides a broad spectrum of implementation, integration and support services for all Oracle Cloud applications to help companies accelerate the adoption of new capabilities in their enterprise. \n\nGSI consulting services are backed by its signature 100 percent satisfaction guarantee. Founded in 2004, the rapidly growing company is headquartered in Atlanta with locations nationwide. GSI, Inc. was recently named in Inc. Magazine's list of fastest growing companies for the second year running (http://www.inc.com/profile/gsi).", "source": "Stock Nod"}