{"published": "2015-09-02T01:11:17Z", "media-type": "News", "title": "Chris Brown is being sued by a fan who claims to have been shot at one of his performances", "id": "c72f0d49-5471-4cd4-87be-2066e3fe7e70", "content": "(Stephen Lovekin/) \nAfter allegedly getting shot at a concert earlier this year, a man is suing pop star Chris Brown, TMZ reports.  \n\nPaul Briley, a fan who attended Brown's Jan 11 show at a San Jose nightclub claims the singer failed to provide enough security, which ultimately led to the violence. \n \nAccording to TMZ, Brown was on stage when shots were fired and five people were injured. \n \nBrown was unharmed. \n \nBriley alleges that because of multiple incidents at Brown concerts, the singer should have had more security that night.  Brown's people, however, aren't having it.  \n \nNicole Perna, who represents Brown, issued this statement to Billboard : \"It is a poor reflection of our society that violence is so prevalent and it is always a tragedy when someone is physically harmed,\" she said. \n \n\"However, this is a completely frivolous lawsuit. We expect that the case will be dismissed and in future, to avoid these reoccurring meritless lawsuits directed at Chris Brown.\" \n \nPerna said they plan to seek damages from \"all parties and their lawyers.\" \n \nIn August last year, former hip-hop mogul Suge Knight and two others  were shot at a pre-VMA party hosted by Brown. Brown later tweeted his frustration:  \"It's disappointing that we as a society can't have fun or enjoy ourselves without any altercations sometimes.\" \n \nA month later,  a fan was stabbed while Brown was performing at a Drake and Lil Wayne after-party in Hollywood. \n \nBriley's claim comes just over a month after Brown made headlines for being stranded in the Philippines  after he was accused of skipping out on a concert he was paid to perform. \n \nNOW WATCH: New aerial footage shows aftermath of explosion in China \n\nMore From Business Insider \n\nA brunette Taylor Swift debuts her 'Wildest Dreams' music video during MTV VMAs \nHere's the brilliant way Justin Bieber used tons of celebrities to market his newest song \nCarly Rae Jepsen made a brilliant career move after ‘Call Me Maybe’ — and now she has the best pop album of the year", "source": "Yahoo! UK and Ireland"}