{"published": "2015-09-17T08:47:27Z", "media-type": "News", "title": "Thousands of migrants pour into Croatia after Hungary closes border", "id": "22e8856b-a849-4a35-8be8-64749e79ec97", "content": "Over 5,650 migrants have entered Croatia after Hungary used tear gas and water cannons to stop migrants entering their country   \nMigrants are pouring into Croatia, setting up a new path towards western Europe after Hungary used tear gas and water cannons to keep them out of its territory. \n \nCroatian police said at least 5,650 migrants had come into the country since the first groups started arriving early on Wednesday. \n \nAuthorities have been using trains and buses to transfer them to refugee centres in the capital Zagreb and elsewhere. \n \nThe government is forming a special body to deal with the influx. Interior minister Ranko Ostojic said the country has the situation under control, but warned that \"if huge waves start coming through Serbia we must consider different moves\". \n \nCroatia represents a longer and more arduous route into Europe for the asylum-seekers from Syria and elsewhere who have been fleeing into Europe in the past months. But they have little choice after Hungary sealed off its southern border with Serbia on Tuesday and began arresting anyone caught trying to enter the country illegally. \n \nClashes between migrants and Hungarian riot police broke out on Wednesday afternoon after people frustrated at being blocked from the country pushed open a gate at the Serbian border. Baton-wielding police responded with tear gas and water cannons, and migrants threw rocks and other objects at the police. Dozens of people were injured. \n \n Afghan refugees sleep next to razor-wire barrier at the Serbian side of Hungary's border fence with Serbia, in Asotthalom, southern Hungary, Thursday, Sept. 17, 2015. Thousands of migrants have begun pouring into Croatia, setting up a new path toward Western Europe after Hungary used tear gas and water cannons to keep them out of its territory. (AP Photo/Muhammed Muheisen) \n \nHungarian authorities have positioned barbed wire and a new gate at the border where the clashes occurred at one of two crossings near the Serbian village of Horgos. \n \nHundreds of migrants remained at the two border crossings, but their numbers dwindled as many headed towards the Croatian border. Serbian state TV reported that 70 buses transported people overnight to the border with Croatia. \n \nMeanwhile, in Paris, French authorities evacuated more than 500 Syrian and other migrants from tent camps and moved them to special housing as the country steps up efforts to deal with Europe's migrant wave. \n \nCity social workers and charity staff woke the migrants before dawn, and they gathered their belongings calmly, watched over by police. The operation took place at a large camp near the Gare d'Austerlitz train station in south-eastern Paris, and another in the north of the city.", "source": "Liverpool Echo"}