{"published": "2015-09-27T06:15:08Z", "media-type": "News", "title": "Catalan mock referendum for independence", "id": "fd4d9449-8988-46f6-ae2a-11172a98dad3", "content": "Separatist parties are expected to win control of Catalonia’s parliament in an election on Sunday, setting the region on course for a unilateral declaration of independence from Spain, which the central government says is impossible. \n \nOpinion polls indicate the main secessionist platform “Junts Pel Si” (Together for Yes) and leftist party CUP are likely to fall short of 50 percent of the vote, but they would still secure a majority of seats in the 135-strong regional assembly. \n \nBoth have said that such a result would allow them to unilaterally declare independence within 18 months. \n \nThe Spanish centre-right government of Prime Minister Mariano Rajoy, which has opposed any attempt to hold a referendum on secession, has called the breakaway plan “a nonsense” and vowed to block it in court. \n \nWhile a breakaway by the wealthy northeastern autonomous region is still very much seen as a theoretical question, even in Catalonia, analysts say the election result will bear long-lasting consequences at local and countrywide level. \n \nThe secessionist campaign is facing a defining moment as support for the cause has steadily waned since a peak in 2013. Any failure to achieve a majority of seats would deal a serious blow to the movement. \n \nThe vote may also act as a catalyst for the Spanish general election due in December. \n \nThe main national parties, all seeking to capture more votes in Spain’s second most populous region, have said they were ready to discuss with Catalonia a more favourable tax regime and increased infrastructure spending if they win. \n \nDepending on who forms a government in Madrid, constitutional reform to recognise Catalonia as a nation within the Spanish state may even be on the cards. \n \nWith separatists saying independence is the only solution and the next Spanish government unlikely to enjoy the strong and stable majority it would need in a new era of fragmented politics, however, any talks with Catalonia may be a hard sell. \n \nBut most analysts and politicians say they would go a long way towards soothing Catalan discontent. \n \n“Only when a final package is adopted and put to a vote will the problem find some form of resolution,” Teneo Intelligence analyst Antonio Barroso said in a note this week. \n \n“Even if secessionist parties are able to remain united – a big if – and continue pushing for independence, any concessions from Madrid would probably help to stymie the movement’s momentum,” he also said. \n \nFinancial markets will also be watching the vote outcome. While few investors believe independence is likely anytime soon, the gap between Spanish and Catalan five-year bond yields has been hovering near its widest point in two years. \n \nSpain’s banks, including some based in Barcelona, have warned that secession could cause financial turmoil, while the Bank of Spain has said Catalonia could risk exiting the euro. \n \n(Reuters) \n\nThe post appeared first on InCyprus .", "source": "The Cyprus Weekly"}