{"published": "2015-09-23T19:33:16Z", "media-type": "News", "title": "Newark reaches deal to clean up roach, rat-infested housing project", "id": "bd98467c-5235-4e32-901e-f63de78eaa3e", "content": "NEWARK –  A roach and rodent-infested public housing project in the city's Central Ward is finally on track for a long-awaited cleanup. \n \nLast week, the Municipal Council unanimously approved a measure to reclassify the Garden Spires complex as a part of a redevelopment plan. The move opens the door for a tax abatement and other incentives for developers that could rehabilitate its 550 units. \n \nCity officials said they had a tentative agreement in place with Clifton-based Omni Development Co. that would provide $142 million to correct a myriad of code violations at Garden Spires, including mold, vermin and crumbling walls. \n \n\"This is a total rehabilitation of the two buildings,\" said At-Large Councilman Carlos Gonzalez. \n MORE:  New hotel planned for vacant building in Newark's downtown \n\nNo specific timeline for the work was offered because officials were still working on the details of the deal with Omni. \n \nCompany representatives present at last week's council meeting said that no residents would be displaced by the work. Instead, work would be performed unit-by-unit, with tenants leaving only for a day and returning to a freshly refurbished home. \n \nThe complex, which has  long been a hotbed for violence and narcotics trafficking in the city, has been identified as a high priority for officials after they found grim conditions there during a publicized visit in July. \n \nAt the time, tenants told reporters with NJ Advance Media they considered their home a \"slum\", and that owner First King Properties regularly failed to respond to complaints about leaking faucets, mildew and other problems. \n \nCommunity activist Donna Jackson was one of a handful of city residents who expressed relief that issues at Garden Spires would finally be addressed following the council's vote. \n \nHowever, she said she still had reservations that the improvements might lead to longtime tenants being ousted – something she said had occurred after rehabilitation work at Maple Garden in Irvington, another First King-owned complex. \n \n\"I just hope that this is not a plan to take people from where they live and where they've been, and take them out,\" she said. \"We all understand the handwriting on the wall in this community, and people are being pushed out.\" \n \nDan Ivers may be reached at divers@njadvancemedia.com . Follow him on Twitter at @DanIversNJ . Find NJ.com on", "source": "Star Ledger"}