{"published": "2015-09-30T15:49:57Z", "media-type": "News", "title": "Week 6′s top five games to watch", "id": "894b9142-c70b-4d59-8591-592156689a92", "content": "No. 9 Hinsdale Central (5-0) at No. 2 Glenbard West (5-0) \nThe facts: 1:30 p.m. on Saturday \nThe storyline: The best game this week is between two undefeated West Suburban Silver teams. Both have been dominant this season and the winner will be the favorite for the conference title. For the Hilltoppers, running back Sam Brodner has been a touchdown machine this season and against previously undefeated Lyons he scored three touchdowns and ran for 130 yards to lead his team to a 35-0 win. Hinsdale Central has a high powered offense to match, boasting an impressive offensive line headed by Michigan State commit Matt Allen. \n \nNo. 11 Naperville Central (4-1) at No. 13 Batavia (5-0) \nThe facts: 7:30 p.m. Friday \nThe storyline: Naperville Central continues on through its rugged schedule, this week travelling to non-conference foe Batavia for a matchup that should feature plenty offensive fireworks. Naperville Central’s biggest athlete is Iowa recruit Emmanuel Rugamba who made his name on the offensive side of the ball at wide receiver. He has also provided several game changing plays on defense as defensive back. A 75-yard Rugamba touchdown helped seal a win against Wheaton-Warrenville South 20-8 last week. Batavia quarterback Kyle Niemiec has accumulated over 1,100 yards passing this season. Running back Zach Garrett and wide receiver Canaan Coffey are two other Bulldogs to keep an eye on. \n \nNo. 22 Conant (5-0) at No. 12 Barrington (5-0) \nThe facts: 1 p.m. Saturday \nThe storyline: Week 6 is all about ranked teams matching up, as another pair of undefeated teams face off in Barrington. Both teams won conference games last week: Conant beat Fremd 26-17 and Barrington is defeated Schaumburg 35-28. The Broncos’ defense has been solid this season behind quarterback Johnny Davidson who has brought the offense consistency and power. Conant quarterback Kyle Bradley has also been impressive and teamed up with running back Jake Jakubosky to run for nearly 300 yards against Fremd. \n \nNo. 21 Marian Central (4-1) at No. 25 Notre Dame (4-1) \nThe facts: 7:30 p.m. Friday \nThe storyline: Marian Central is looking to rebound from a disappointing 41-3 loss to No. 8 Joliet Catholic last week. The Dons will provide another stiff test. Hurricanes running back Emitt Peisert led the way with 13 carries for 48 yards against the Hilltoppers. Despite the loss, Marian Central has had a big start to the season though, and look to continue their roll in the East Suburban Catholic against a tough Notre Dame team whose only loss was to Marist in Week 4. Western Illinois quarterback commit Tyler Tsagalis and the Dons have shown the ability to string together long drives and put up big numbers this season. \n \nJacobs (5-0) at No. 18 Huntley (5-0) \nThe facts: 7:15 p.m. Friday \nThe storyline: No. 18 Huntley surged into the rankings this week and will be tested immediately against undefeated Jacobs. Huntley took down Cary-Grove 29-8 in its first Fox Valley Conference game of the season last week behind a big performance from sophomore wide receiver Eric Mooney. In fact, Huntley held the perennially powerful Cary-Grove offense scoreless until the fourth quarter. Jacobs junior quarterback Chris Katrenick is drawing plenty of recruiting attention from colleges and has Jacobs riding the momentum of a 49-17 win over Dundee-Crown last week. \nTags: Barrington , Batavia , Conant , Glenbard West , Hinsdale Central , Huntley , Jacobs , Marian Central , Naperville Central , Notre Dame", "source": "High School Cube News"}