{"published": "2015-09-21T15:55:08Z", "media-type": "Blog", "title": "Race Report: British Downhill Series, Round 6, Antur Stiniog.", "id": "123b285e-8358-49eb-b1e9-bedd79e657f2", "content": "Race Report: British Downhill Series, Round 6, Antur Stiniog. On: 21 Sep 2015 @ 4:55 pm 0 Comments A fairly quiet weekend for the GT Factory Racing Team at Antur Stiniog for the close of the British Downhill Series this week. With Gee and Rachel Atherton spending time with the family this weekend after the death of their Grandpa it was left to the young guns – Taylor Vernon and Kade Edwards to rep the team at one of our favourite venues. Antur is steep and challenging. Situated in an old slate quarry it’s a dramatic venue for spectators who have a good view of riders all the way don the track but weather conditions can make it extremely difficult to ride. Saturday’s practise was sunny, dusty and still. Kade said “ I was having so much fun, just shredding with my mates and having a laugh, it was mint!” But come Sunday and the infamous Snowdonia weather rolled in bring wind up top with rain and mist below. Despite heavy rain for his run in Youth Men’s seeding runs Kade had a solid run and enjoyed the experience, seeding 2nd to Matt Walker. Taylor crashed in his seeding run finishing in 23rd. Come race runs and the Youth Men rain was pretty heavy, Kade decided to take it steady and play it safe. He said “ I wanted to play it safe but I ended up riding like a grandma! Still I ended up 5th with a decent time and I had a great weekend riding so I’m Ok with that.” By the Elite Mens race the wind had rally strengthened up top. Taylor said “ The rain had made the track as slick as ice, it was hard to push on and the wind was actually blowing me backwards. Not happy at all with my result this weekend, wish I could have ended 2015 on a stronger note but I’ll be working hard towards 2016.”   In the Junior Women’s category sponsored by Rachel Atherton, Rosy Monaghan took the win with Gemma Taylor in second and Rona Strivens in third. Results Elite Men 1 Matt Simmonds 2.31.477 2 Mike Jones 2.33.281 + 1.8 3 Marc Beaumont 2.33.445 + 1.96 4 Joe Smith 2.34.667 + 3.19 5 Emyr Davies 2.35.26 + 3.78 12 Taylor Vernon 2.37.711 + 6.23 Youth Men 1 Matt Walker 2.43.124 2 Conor Bate 2.43.229 + 0.1 3 Joe Breeden 2.43.797 + 0.67 4 Jack Tennyson 2.45.743 +2.61 5 Kade Edwards 2.45.743 + 2.63   Photos: Taylor portrait Sven Martin, Kade pics by Brian and Tom Edwards", "source": "Atherton Racing"}