{"published": "2015-09-01T06:15:52Z", "media-type": "News", "title": "Journalist Alan Morison and colleague acquitted of defaming Thai navy", "id": "13cc0abe-727d-4e5e-acef-5075225e8183", "content": "Australian journalist Alan Morison and his Thai colleague Chutima Sidasathian are acquitted on charges of defaming the Royal Thai Navy. \n\nPhuket: Veteran Australian journalist Alan Morison and his Thai colleague Chutima Sidasathian have been acquitted on charges of defaming the Royal Thai Navy in a case that will have far-reaching consequences for the media in military-run Thailand.\n\nMorison, 67, said the ruling delivered to a packed court on the Thai resort island of Phuket \"sends a clear message from Thailand's judicial system that Thailand's media should be free\".\n\n\"We hope it is sign of Thailand's growing maturity and that the media and military can live side by side,\" he said.\n\nMorison and Chutima, 34, had faced up to seven years' jail on unprecedented charges brought by the Thai navy.\n\nChutima collapsed into the arms of her mother when a judge announced the verdict.\n\nTwo judges ruled that Morison and Chutima had no intention to damage Thailand's reputation in the story they published in 2013 on Phuketwan, a small online news website.\n\nThey said the information they published came from Reuters, a reliable news organisation, and was not their own.\n\nMorison, a former senior editor of The Age, has been spending his life's savings publishing Phuketwan, which has led coverage of the plight of Rohingyas from Myanmar who have been described by the United Nations as among the world's most persecuted people.\n\nMark Plunkett, a Brisbane barrister who observed the trial for Australia's MEAA union, said the court is to be congratulated for arriving at a just result on the merits of the case.\n\n\"However, Thailand's defamation and Computer Crime Act laws must be repealed as they constitute a hideous threat to freedom of speech and democracy in Thailand,\" he said.\n\nThe controversial trial came amid dramatic revelations of a grim people smuggling trade across South-east Asia where people were abandoned at sea and in jungle death camps by traffickers.\n\nImages of starving and distressed Rohingyas on boats in the region's waters shocked the world, prompting a Thai crackdown and eventually forcing South-east Asian governments to act together to end the trade.\n\nMore than 100 people were arrested, including senior Thai officials.\n\nThe charges related to a single paragraph re-published in Phuketwan from a Reuters report that subsequently won a Pulitzer prize, the world's top journalism award.\n\nBut the Royal Thai Navy only laid charges over the Phuketwan re-publication, prompting criticism that it had singled out a small independent news outlet. Chutima had worked as a paid fixer for Reuters on its Rohingya coverage and introduced Reuters reporters to news sources.\n\nReuters, one of the world's largest media and information companies, distanced itself from the case.\n\nProsecution witnesses gave no explanation in court as to why only Phuketwan was charged.\n\nDefence lawyers argued in court that the Reuters paragraph quoting a people smuggler saying \"Thai naval forces\" sometimes earned money or turned a blind eye to Rohingya boats did not name the Royal Thai Navy and that there were multiple naval forces in Thailand, including the coastguard and police. That argument went uncontested in court.\n\nIn the indictment the words \"Thai naval forces\" was erroneously translated into \"Royal Thai Navy\", the court was told.\n\nDefence lawyers also questioned whether a branch of the armed forces could sue for defamation when no individuals were identified as being aggrieved by the story.\n\nThey also argued the Computer Crimes Act should not be applied in defamation cases.\n\nMorison and Chutima earlier this year sent a letter to Thai authorities expressing \"deep regret\" at what had transpired but insisted an apology was not warranted.\n\n\"We had no intention of apologising for something that we haven't done,\" Morison said. \"This was a matter of important principle. This case was wrong from the beginning, with one or two officers acting on bad advice.\"\n\nMorison could have left Thailand to avoid the trial but said he had stayed to fight the case with Chutima in the interests of media freedom.\n\nAfter the verdict, Morison said he would consider the future of Phuketwan in the coming days. \"Fighting the case has been a huge financial and personal burden,\" he said.\n\nPhil Robertson, the deputy director of Human Rights Watch's Asia division, said: \"This whole episode shows a fundamental lack of understanding among Thai government and military officials about what a free press is really about and the role it plays in democratic society.\n\n\"Thailand needs to revoke both its criminal defamation statute and the Computer Crimes Act to end this assault on media freedom.\"\n\nKingsley Abbott, from the International Commission of Jurists, said while the acquittals are very welcome, \"Thailand must now move to abolish criminal defamation, which is an abuse of freedom of expression and is out of line with its international legal obligations\". The story first appeared on The Sydney Morning Herald.", "source": "Merimbula News"}