{"published": "2015-09-01T22:36:28Z", "media-type": "News", "title": "Why those silly grins in Texas over mediocre Alabama ice cream?", "id": "1248b4a4-8760-4f96-91e7-9fa8448bd2c8", "content": "Opinion Blog \r \nFans of Blue Bell Ice Cream were happy to show off the containers as they were the first in the area to purchase Blue Bell products Monday, Aug. 31, 2015, in Brenham, Texas. Blue Bell Creameries resumed selling its products at select locations Monday, four months after the Texas-based retailer halted sales due to listeria contamination.  (Steve Gonzales/Houston Chronicle via AP) You know, the containers of Blue Bell that went on sale yesterday in Central Texas. \n \nIt’s not from the Blue Bell factory in Brenham. Oh, I’m sorry. I meant the Blue Bell creamery. That nomenclature is part of the mystique. It’s part of how Blue Bell trained the public to think of its product as sustenance from the bosom of Texas. \n \nBut the Texas product is not on sale now, because it’s not being made. The Brenham factory remains closed from the company’s nationwide shutdown related to the deadly listeria outbreak. You remember: Blue Bell, in 2013, had evidence of the listeria bacteria on non-food plant surfaces but didn’t test the products themselves for the deadly organism . \n \nAfter three died and more fell ill, the fallout about ruined the company. It had to get billionaire Sid Bass to put up $125 million to see through the fumigation, or whatever they do to kill bacteria. \n \nWith all this bubbling in the background, it astounds me that people get all silly at the thought of that ice cream going back on the market. And the media plays along. We pretend that a truly important product is at stake. \n \n\n \nNews media likes the happy quotes. It’s like a pet story or zoo story. Everyone is all smiles, and we get pictures. What could be better? \n \nThe only honest media story is whether Blue Bell will be able to “rehabilitate its brand.”  Will the public forgive? Did Blue Bell learn its lesson? The Wall Street Journal  took at stab at that, with a rundown of corporate meltdowns of consumer and food companies due to unsafe products they let out their doors. Wrote the Journal: \n \nOutside the food industry, drug maker Johnson & Johnson is among the most cited examples of a company staging a successful comeback from a high-profile recall. In 1982, it quickly alerted the public and immediately recalled millions of bottles of Tylenol after seven people died from taking cyanide-laced capsules of Tylenol. Though J&J’s stock price plunged initially, it rebounded as the company touted its dedication to transparency, and sales recovered. \n \nIn contrast, Blue Bell didn’t quickly tell anybody, initially. There was no immediate recall. Instead, there was a stealth withdrawal of product that had already gone to institutional and retail customers. That was weeks before the first recall in the company’s history. \n \nNow Blue Bell wants back in the public’s good graces. \n \nIs Blue Bell that special a product to begin with? I always thought it was passable, if the price was right. \n \nJust before sitting down to write this screed, I used my Consumer Reports membership to dial up the publication’s product rating of 18 different vanilla products from 2014. \n \nBlue Bell came in at No. 12. That’s kind of where I always saw it — average. \n \nWhen BB returns to my friendly neighborhood Tom Thumb, you can have mine. The mediocre ice cream may come back, but the trust is gone forever. \n \n \n\r \r \r Editor Picks", "source": "Dallas Morning News"}