{"published": "2015-09-17T23:56:08Z", "media-type": "News", "title": "Dortmund snatch win over Krasnodar in UEFA Europa League", "id": "664a8375-8c3f-4506-a98c-e45804346f81", "content": "Berlin:  Park Joo Ho's late 2-1 winner against resilient Krasnodar ensured Dortmund started with a win in the Group C encounter of the UEFA Europa League on Thursday. \n\nBorussia Dortmund stretch their winning streak to ten straight victories into the season, as Thomas Tuchel's men came from behind to snatch a late 2-1 victory over Russian outfit Krasnodra thanks to the header by Park Joo Ho in the dying seconds of the clash, Xinhua reported. \n\nThe encounter started other than expected for the hosts, who controlled the proceedings from the kick-off, as Krasnodar caught Dortmund flatfooted on the first counter attack. \n\nFedor Smolov shrugged off Dortmund defender Matthias Ginter, assisting Pavel Mamaev, who tapped the opener at the near post with 12 minutes played. \n\nKrasnodar's lead came out of the blue and Dortmund needed some time to recover from the early setback. \n\nHenrikh Mkhitaryan had the chance to restore parity but Krasnodar's goalkeeper Andriy Dykan denied the Armenian one-on-one inside the box at the 35th minute. \n\nHowever, the hosts were able to bounce back just before the break as Park Joo Ho's cross into the box found Matthias Ginter, who nodded home the equaliser in the last seconds of the first half. \n\nDortmund picked up the pace and pushed for the lead after the restart. Nevertheless, the hosts had to wait until the dying minutes of the game before Dortmund's summer signing Park Joo Ho headed home Ginter's cross at the far post to seal his side a late 2-1 victory in front of 55,200 spectators on home soil. \n\nWith the result, Krasnodar returns empty handed despite a resilient performance meanwhile Dortmund wrapped up three points to grab the lead in Group C. \n\nThe \"BVB\" sits atop the standings with three points followed by PAOK and Qabala both with one point, and Krasnodar with zero points. \n\n\"We didn't play well but still won. We are happy, but we can do better than that,\" Borussia Dortmund sporting director Michael Zorc said. (IANS)", "source": "India Online.in"}