{"published": "2015-09-28T21:26:00Z", "media-type": "News", "title": "Cold Brew Kitchen: New Cold Brew Coffee Company Launches - Ground Coffee with a Story", "id": "a97523df-a8df-446e-b59f-9ab6980486fb", "content": "SOURCE Cold Brew Kitchen\n\nMEDFORD, Ore. \n\nPhoto - http://photos.prnewswire.com/prnh/20150928/271484 \n\nThey decided to turn their passion into a business that became Cold Brew Kitchen. \"We created this brand because when we started home cold brewing, we didn't know what coffees to buy,\" said Ardrey. \"Coffee taste is personal, but over the years we found we kept coming back to similar roast profiles and origins that made great tasting cold brew every time.\"\n\nThis week, Oregon Home Gourmet Corp announced the official launch of Cold Brew Kitchen, the first line of coarse ground coffees dedicated to home cold brewing. \n\n\"We are passionate about home cold brewing and excited to bring these products to market,\" said Jacqueline Ardrey \n\nThe core line consists of 4 coffees: http://www.coldbrewkitchen.com/collections/artisan-roasted-course-ground-coffees-for-cold-brewing all South American medium to dark roasted South American blends with rich body. Offerings include a Reserve, Elite Espresso, Decaf Elite Espresso, and a Limited Edition Specialty Grade offering sourced by Thrive Farmers. Retails range from $14-$28 \n\n\"We tried hundreds of coffees before we started creating blends that we loved,\" she said. \"Cold Brew Kitchen is the result of that research. These are affordable everyday coffees that will make great tasting cold brew, every time.\"\n\nFor more information visit: http://www.coldbrewkitchen.com/. Free US standard shipping for National Coffee Day September 28 \n\nContact: Jackie Ardrey \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/cold-brew-kitchen-new-cold-brew-coffee-company-launches---ground-coffee-with-a-story-300150200.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KRHD TV"}