{"published": "2015-09-14T10:24:07Z", "media-type": "News", "title": "Fraudsters jailed for £2.6m Channel Island airport scam", "id": "a74ac0a8-5bc3-49ae-a585-9d614f0d5555", "content": "Two fraudsters who laundered £2.6 million meant for a new Channel Island airport runway have been sent to prison. \n \nJohn Woodhatch, aged 58, of Boleyn Court in Buckhurst Hill, was sent to prison for five years for his part in a “payment diversion” fraud on the States of Guernsey. \n \nAdrian Taylor, 44, from Swanley in Kent, was also jailed for six years when the pair appeared at the Old Bailey last Wednesday (September 9) having both pleaded guilty to money laundering. \n \nThe duo contacted the Guernsey Treasury in June 2012 claiming to be from Lagan Construction, which is carrying out a £50 million project at the island’s airport. \n \nThe pair told the treasury that they wanted to change the bank account details into which monthly payments were being made. \n \nOnce this was agreed and the latest monthly payment of £2.6 million had been transferred into the new RBS account, Woodhatch, who was working as a City broker, immediately instructed the bank to move the funds to accounts in Dubai and Turkey. \n \nWoodhatch told RBS the transfers were mainly to pay for a horse in Dubai, but the bank’s money laundering team was not convinced and referred the matter to the City of London Police in July 2012. \n \nAfter several days, Woodhatch was arrested and his home and commercial address in the city were searched. \n \nA review of the accounts found that £52,000 of the stolen funds had been transferred to Taylor, who was arrested in October 2012 after he handed himself in to police. \n \nDetective Inspector Rob Stirling, who led the investigation for the City of London Police, said: \n \n“Woodhatch and Taylor thought they were too smart to be caught and would be left free to spend the £2.6 million stolen from the States of Guernsey. \n   \n Share article  \n   \n“Unfortunately for them the City of London Police specialises in investigating cases of financial fraud and bringing those responsible to justice. \n \n“Woodhatch and Taylor’s scam should also serve as a warning to other public and private sector bodies that could easily be targeted by fraudsters in the same way.”", "source": "Surrey Comet"}