{"published": "2015-09-03T14:19:34Z", "media-type": "News", "title": "New ad from utility-backed group opposing solar power amendment", "id": "1619fcde-37ef-4923-9092-396fc38ee5d6", "content": "Consumers for Smart Solar, a utility-backed group opposing a constitutional amendment to stop regulations of some solar energy providers, on Thursday released an online ad attacking the amendment's supporters. \n       \nCalled \"Fine Print,\" it echoes many of the arguments utility companies made in the Supreme Court on Tuesday when they urged the justices to deny the group Floridians for Solar Choice access to the ballot in November. The ad walks through the language on the ballot initiative, which would prevent state and local governments from regulating a \"local solar provider\" -- a company that puts solar panels on someone's roof and then sells that power to them and their neighbors -- as a traditional utility company. \n \n\"This is ridiculous. Shady solar contractors would become constitutionally immune to state or local consumer protection laws?\" the ad says. \"They could price gauge, make false promises, overcharge or outright scam consumers?\" \n \nSupporters of the amendment, of course, disagree. They say the utility companies have an unfair monopoly over all energy production and that more competition in the market will encourage solar energy and lead to lower prices for consumers. \n \nHere's the Consumers for Smart Solar ad, in full. The group has been funded largely by utility companies, including Duke Energy, Tampa Electric Company, Gulf Power Company and Florida Power and Light, as well as Chamber of Commerce groups. \n \n[embedded content] \n \nFloridians for Solar Choice released a new online campaign earlier this week, as well, funded largely by the Southern Alliance for Clean Energy, a group that doesn't make its donors public because it fears they will face retribution or harassment from utility companies. We mentioned this ad in an earlier post, but it wasn't yet on YouTube for us to link to. \n \n[embedded content]", "source": "Tampa Bay Times"}