{"published": "2015-09-16T16:10:13Z", "media-type": "Blog", "title": "MythBuster Adam Savage Reveals Screaming ‘Duck Bomb,’ His Take On The ‘Duck Army’", "id": "b47297ac-ad8a-4046-a2dc-1990bb7ae47a", "content": "MythBusters co-host Adam Savage has revealed his own take on the viral “Duck Army,” naming it a “Duck Bomb.” \n \nFor those who have yet to experience the Duck Army, the concept stems from a video created and unleashed online by Norwegian mechanic Kevin Synnes. As the Huffington Post reports, Synnes demonstrated that when you gather a bunch of rubber duck toys , squeeze the air out of them, and unleash the flock, you can create a powerfully unsettling cacophony. The Duck Army video was later made into a Vine by Charlie Murphy of Ireland, which went viral in a powerful way, having racked up over 644,000 likes since it was first shared. \n  \nEnter MythBuster Adam Savage, who decided to engage in a little freelance myth-busting outside of the confines of his show. In a blog post published at Tested on Sunday, Savage acknowledged that he had his own reservations regarding the reality of the Duck Army video. \n \nI felt a great disturbance in #TheForce , as if millions of voices cried out in terror and were suddenly silenced. https://t.co/IBUkDRS16G \n \n— Adam Savage (@donttrythis) September 9, 2015  \n \n“It’s possible by now you’ve seen my rubber-duck screaming video, but I want to give credit where credit is due. Like many, I had my doubts as to the Duck Army video’s veracity: I couldn’t imagine that all the duck noisemakers could be set to such varying tones, making it sound like a visit to Dante’s Hell. Or something out of a Bruegel painting.” \n  \nAnd now I present to you… the DUCK BOMB. #duckarmy  https://t.co/4oOMXgvfVN \n \n— Adam Savage (@donttrythis) September 14, 2015 \n \nBuilt a little something for my #duckarmy . Ready for the video? pic.twitter.com/7j2gRDt6ng \n \n— Adam Savage (@donttrythis) September 14, 2015  \n \nSavage proceeded to order 12 duck dog toys and construct his Duck Bomb, which consists of a plywood box that holds 10 of the toys compacted together. Removing the safety sets off Savage’s Duck Bomb, allowing the toys to inflate and begin wailing with a collective moan reminiscent of the damned, which confirms the validity of the original Duck Army video. According to the MythBusters host, the actual sound of the screaming duck toys is “even more amazing in person than you can imagine.” \n \nThough Savage refers to his Duck Bomb as “the ultimate secret weapon,” he managed to share the video with his 1.25 million Twitter followers on Monday. According to Laughing Squid , the rubber ducks responsible for the viral phenomenon are actually Kyjen Squawkie Talkie rubber pelicans. While Synnes admits that the original video was meant to simply embarrass his girlfriend, the Duck Army has taken on a life of its own, now going one step further with Adam Savage’s Duck Bomb. \n \n[Photo via Twitter/ Adam Savage via Laughing Squid ] \n \nMythBuster Adam Savage Reveals Screaming ‘Duck Bomb,’ His Take On The ‘Duck Army’ is an article from: The Inquisitr News", "source": "The Inquisitr News"}