{"published": "2015-09-19T22:22:40Z", "media-type": "News", "title": "Transitions Optical introduces Transitions Innovation Awards program", "id": "7f870368-32e6-4e76-8ee1-43161be62050", "content": "Transitions Optical, Inc. has announced the opening of a new Transitions Innovation Awards Program for 2015 – with five categories celebrating both individuals and companies from the U.S. and Canada for their innovative efforts to support the Transitions brand over the past year. \n \nOpen to independent eyecare professionals and practices; optical industry professionals and educators; national and regional retailers; and optical laboratories, the Transitions Innovation Awards categories include: \n \n- 2015 Transitions Brand Ambassador (Individual-only award) \n- Best in Growth Achievement \n- Best in Training \n- Best in Marketing \n- Best in Patient Experience \n \n“Amidst the ever-changing technology advances and changes made within our industry, one thing has always remained important within our business model and that’s partnership,” said Jose Alves, general manager, Americas, Transitions Optical. “We’ve evolved our Awards program to better credit our partners for the innovative approaches and strategies they are taking. Our hope is to showcase efforts all of our partners take to unite, educate and serve our customers and each other.” \n \nNominations for all Transitions Innovation Awards will be accepted online (at TransitionsCanadaPRO.ca/Awards) from October 1 – 31, 2015. To enter, candidates must complete a nomination form and detail their 2015 efforts in the following evaluation areas: commitment and inspiration, goals, plan and creativity, and impact and results. Nominees are welcome to enter more than one category and can self-enter, or can be nominated by a lab, lens manufacturer, industry colleague or other industry organization representative. \n \nUp to three finalists in each category will be honored during the 2016 Transitions Academy, held February 3-6 in Orlando, Fla., where the winner will be announced. All finalists will be invited to attend the Transitions Academy event, and winners will receive funds for an employee celebration and marketing and public relations support. \n \nFor additional information, industry professionals should visit TransitionsCanadaPRO.ca/Awards or contact Transitions Optical Customer Service at CustomerServiceCanada@transitions.com. \n Pin It", "source": "Optical Prism Magazine"}