{"published": "2015-09-01T03:34:38Z", "media-type": "News", "title": "N.J. football players get probation for sexual hazing", "id": "c3f61a56-94ef-4bbe-91f6-19c42c4bec1f", "content": "Incidents took place at Sayreville War Memorial High School in Parlin, N.J. \nSix then-football players from a New Jersey high school known for its gridiron victories have been placed on probation -- but have been spared from being labeled sex offenders -- for sexually hazing freshmen in a locker room during the 2014 season, a prosecutor's office announced Monday. \n\nFour football players will be on probation for two years and must do 50 hours of community service after they pleaded guilty to charges of \"committing a disorderly persons offense of hazing\" and \"third degree endangering the welfare of their younger fellow teammates,\" the Middlesex County, New Jersey, Prosecutor's Office said in a news release. \n\nTwo others were placed on one-year probation in addition to community service after the county's family court ruled them adjudicated delinquent -- which equates to a finding that they broke the law -- according to the release. A seventh defendant is still awaiting trial. \n\nAfter obtaining input from the victims and their families on a plea deal, the Middlesex County Prosecutor's Office decided not to insist that the juveniles become registered sex offenders. The identities of those involved were withheld because of their ages. \n\nThe Sayreville War Memorial High School principal -- who, according to the news release, had \"no personal knowledge of the assaults and abuses that occurred\" -- testified in family court as a \"character witness\" for the two juvenile defendants who were ruled adjudicated delinquent. \n\nThe charges stem from four separate incidents in September 2014 in the locker room of Sayreville High in Parlin just south of Staten Island, New York, a school that has long prided itself on a tradition of state championship victories. \n\nOn several occasions, older teammates sexually assaulted their younger teammates, including body-slamming them, grabbing their private parts and attempting to \"digitally penetrate\" the freshman, according to the prosecutor's office. \n\nSayreville School District Superintendent Richard Labbe said in a statement after the stories came out last year, \"There were incidents of harassment, intimidation that took place on a pervasive level, in which the players knew, tolerated and in general accepted.\" \n\nThe district's board of education \"takes this matter extremely seriously and thus will continue to make the safety and welfare of our students, particularly the victims of these horrendous alleged acts, our highest priority,\" Labbe added. \n\nLabbe halted Sayreville's 2014 football season after the initial reports. \n\nThe coaching staff was also disciplined following the incidents. The head coach and four of his assistants were suspended with pay, according to an announcement by the school in October. \n\nOfficials at Sayreville War Memorial High School did not immediately respond to CNN's calls for comment Monday.", "source": "News4Jax.com"}