{"published": "2015-09-18T10:30:03Z", "media-type": "News", "title": "No shortcuts to independence, Nicola Sturgeon warns", "id": "1f8452a6-88c4-471b-9c64-9bb6ab082788", "content": "There are no shortcuts to Scottish independence and it will not happen just because supporters become \"more impatient for change\", Scotland's First Minister has said. \n\nNicola Sturgeon said ruling out another referendum indefinitely would be wrong but she indicated that winning a second vote would not happen imminently because the concerns of those who voted No must be addressed \"patiently, carefully and comprehensively\". \n\nShe said she respected the result of last year's historic ballot, which saw Scotland vote to remain part of the UK.\n\nExactly a year after that poll, she told David Cameron he is \"living on borrowed time\" as she spoke about the prospect of a second referendum.\n\nWhile the Prime Minister said it was \"time to move on\" from last year's ballot, promising action to ensure the Scottish Parliament is a permanent part of the UK's political landscape, Ms Sturgeon told an audience in Edinburgh: \"We respect last year's result. \n\n\"It would be wrong to propose another referendum without a fundamental change of circumstances or a strong indication that a significant number of those who voted No last year had changed their minds.\n\n\"If we are to win independence, we must convince a majority of Scots that it represents the best future for Scotland. \n\n\"That was true last year, it is true now and it will be true at all times in the future. There are no shortcuts. \n\n\"Independence won't happen just because its supporters become more impatient for change. An even more committed, enthusiastic and impatient 45% is still just 45%. \n\n\"If Scotland is to become independent, we must build the support for independence. \n\n\"Just as in the referendum campaign, it grew from 30% to 45%, we must in the years ahead take it from 45% to a clear majority. \n\n\"That means we must persuade the people we failed to persuade last year.\n\n\"That means understanding why they voted No. And it means addressing those concerns, patiently, carefully and comprehensively.\" \n\nCopyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Yorkshire Post"}