{"published": "2015-09-01T15:03:36Z", "media-type": "News", "title": "One daily habit could have a huge impact on your child's success", "id": "71e008a2-2934-4d38-b0fa-f1026bf2d673", "content": "(Flickr/Herald Post) \nSnuggling up next to your kids to read them a bedtime story isn't just helping you bond with your little one.  \n\nWe've known for a while that reading to children is a great way to help kids learn how to read for themselves.   \n \nBut recent research also suggests that storytime has other benefits as well. Here are four of the main reasons why reading to children — especially when you do it regularly — could be crucial: \n 1. It stimulates parts of the brain associated with visual processing.   \nA recent  study  highlighted by the  New York Times  found increased activity in the areas of children's brain associated with processing images, suggesting that even when kids aren't reading themselves, they are picturing the places they're hearing about. \n \n“When kids are hearing stories, they’re imagining in their mind’s eye,”  John S. Hutton, a clinical research fellow at  the Cincinnati Children’s Hospital Medical Center and the lead author of the paper, told the Times . \n 2. It's different than just talking to them.   \nAnother  study  suggests that reading aloud to children starting when they're infants exposes them to more words than they might pick up from conversation alone. The study also suggested that reading aloud provides them with a better picture of a variety of sentence structures and vocabulary. \n  3. It may boost their ability to process information.    \nA recent study  based on data from 4-and-5-year-old Australian children found that — even when they controlled for factors like their parents’ income and education levels — kids whose parents said they read to them at least 6 days a week scored higher on national tests designed to measure understanding and comprehension than those whose parents said they read to them just once or twice a week or less. The differing results appeared to hold steady roughly until the kids reached age 10. \n 4. It may help them problem solve.   \nIn a survey  of 9-month-olds in Ireland, researchers found that children whose mothers said they read and talked to them \"often\" or \"always\" up until that age performed better on a private questionnaire used by the University of California San Francisco and the University of Oregon   than those whose moms said they read to them \"rarely,\" \"never,\" or \"not at all,\" even when controlling for mother's income and education levels. \n \nNOW WATCH: New aerial footage shows aftermath of explosion in China \n\nMore From Business Insider \n\nA geneticist says any new parent should 'roll their child on floor of the New York subway' — here's why \nParents are more worried about their teens having time for homework than being bullied on social media, study says \nTongue-rolling myth busted! It's not a single gene you inherit from your parents", "source": "Yahoo! UK and Ireland"}