{"published": "2015-09-17T06:48:10Z", "media-type": "News", "title": "POSTSCRIPT: Welcome Pilgrims!", "id": "f1d09bb8-543b-48df-9b93-2412d0d773a5", "content": "I am also a pilgrim. Each one of us who come to visit the Cathedral, the Basilica or the Old Peñafrancia Shrine and pay homage to Our Lady of Peñafrancia and Divino Rostro is a pilgrim. \n \nAnd this is where our journey starts – slowly but surely -  on the way to our heavenly home. \n \nWe may falter, fall or lose our track but our “Ina” knows we were a “pilgrim” once in a faraway place called “Naga.” \n \nAnd how great is that? So great because She never forgets! \n \nThings to do this week while in the City of Naga. \n \nAt the Cathedral: Friday, September 18 and Saturday, September 19 \n \n3:30 am Dawn Penitential Procession; Holy Masses every hour from 3am to 6pm or 7pm; 4:00pm  Start of the Fluvial Procession \n \nOn the Cathedral Grounds: Kusina ni Ina offers free “Goto” to all the pilgrims. \n \nBishop Gainza Trade Fair (Elias Angeles St.): a variety of vendors selling dried fish, pili nuts, handicrafts, religious items, etc. \n \nEntrance fee: 5p \n \nPeople \n \nRegie Tan Bustria (a long time Naga City resident) visiting from Las Vegas, Nevada, U.S.A.  celebrated her birthday at the Avenue Plaza Hotel with close friends Cecile Sibulo, Mars Blancaflor, Ophie Magsalin, Olive Badong, and yours truly in attendance. \n \nWe always have a lively conversation whenever Regie visits. Have a safe trip back to Vegas, Regie! \n \nOn Sept. 12, 2015 – Feast of the Holy Name of Mary – Archbishop Ramon Arguelles of the Archdiocese of Lipa has issued a Decree that declares ‘Our Lady’s Apparition in Lipa Carmel as worthy of belief and do exhibit ‘ supernatural origin.’ It acknowledges Mary as “Mediatrix of all Grace.” \n \nIt also states that the nun “Teresita Castillo” and other nuns among them our very own the late “Mother Therese” (Foundress of The Daughters of Mary Mother of the Church) have suffered endless humiliation and now comes their much-awaited vindication. \n \nMy father, the late Dr. Floro V. Dabu and my mother Josefa Dabu were close friends and benefactors of Mother Therese and  the Nuns. \n \nMother Therese has revealed to my parents – of Our Lady’s appearance to her too and  that Our Lady spoke to her as well. She was also a witness to the shower of roses in and around the convent and inside the church. \n \nAfter the setback at Lipa Carmel - Our Lady has found a home - the Archdiocese of Caceres - where the Daughters of Mary Mother of the Church came to be. \n \nMother Therese - you were a humble saint in our midst. We love you and you were truly a heavenly gift to us! \n \nThe full text of the Decree can be found at www.spiritdaily.com \n \nHave a wonderful fiesta everyone!", "source": "Bicol Mail"}