{"published": "2015-09-24T05:00:00Z", "media-type": "News", "title": "Matters of the heart: Understanding atrial fibrillation", "id": "302c9d7d-9934-48b0-bffb-06d3a64c072f", "content": "(BPT) - An estimated 2.7 million Americans suffer from atrial fibrillation (AFib), an irregular heartbeat and the most common form of cardiac arrhythmia, according to the Journal of the American College of Cardiology. Surprisingly, many people do not feel any symptoms until they are suffering from complications of AFib such as heart failure or stroke. \n  \nSeptember is Atrial Fibrillation Awareness Month. Take the time to understand your risk for AFib, and the importance of early diagnosis and treatment. One out of every four strokes in the United States is a result of AFib, according to the American Heart Association. Patients who experience a stroke caused by AFib are twice as likely to be severely disabled, a 1996 Framingham Study found. Stroke prevention and heart failure prevention are primary treatment goals in AFib. \n \nWho is at risk for AFib? \n \nThere are a number of risk factors associated with AFib, including existing heart conditions, prior heart attack or recent heart surgery. People who are overweight, have high blood pressure, lung or thyroid issues or are under a lot of stress may also have an increased risk for AFib. \n \nAdditionally, the risk for AFib increases with age, especially after 60. There is also a genetic component to AFib, so if someone in the family has it, the more likely the next generation will have it too. Without treatment, AFib can lead to serious health consequences, including: \n \n* Heart failure \n \n* Stroke \n \n* Fatigue \n \n* Shortness of breath \n \nWhat are the symptoms of AFib? \n \nEach year, millions of patients see physicians because they feel heart palpitations or report their heart is racing, quivering or fluttering, which are the most common symptoms of AFib. Other signs may include general fatigue, dizziness, shortness of breath, anxiety or weakness. However, some people with “silent” AFib have no symptoms at all and their condition is only detected when they go in for a physical exam or have a medical event. In fact, a third of Americans who have AFib are still undiagnosed, noted a 2015 report from the American Heart Association. \n \nEarly diagnosis and treatment is key \n \nEarly detection of AFib is critical to reduce unnecessary medical visits and prevent serious complications. However, AFib can occur intermittently or without symptoms, making it difficult to detect and diagnose. \n \nIf a physician suspects AFib, they will typically conduct a physical examination and heart-monitoring tests. Traditional heart monitoring methods include an electrocardiogram (ECG) to measure the timing and duration of each electrical signal of the heart. \n \nNew advancements in technology such as wireless, long-term, continuous cardiac monitors have significantly improved how AFib is diagnosed and managed. For example, iRhythm’s ZIO Service with a biosensor patch has the ability to monitor and store patients' heartbeats for up to 14 days, catching any hard to detect events that may be missed with older technology. The long-term continuous monitoring allows physicians to rule in, or even rule out, the diagnosis and characterization of AFib and potentially eliminating the need for further testing and resulting in faster treatment. \n \nTalk to your doctor \n \nWhile AFib may not sound serious, it can actually be life threatening. Understand your risk and treatment options, and take the necessary next steps to live a healthier lifestyle, including eating heart healthy foods, exercising regularly and minimizing stress. \n \nTo learn more about AFib and continuous long-term cardiac monitoring, talk to your doctor or visit www.irhythmtech.com .", "source": "Stephenville Empire-Tribune"}