{"published": "2015-09-29T12:30:42Z", "media-type": "News", "title": "Natera Bolsters Broadband Service to More Efficiently Deliver its Non-invasive Genetic Screening Technology Services", "id": "0557c096-680f-413a-88e2-1633c6a01c3f", "content": "Increased capacity and speed through Comcast Business Services enhances Natera's ability to access cloud-based analytical software \n\nSAN CARLOS, Calif., Sept. 29, 2015 /PRNewswire/ -- Comcast Business today announced that Natera, Inc., a leader in non-invasive genetic testing, has upgraded its Comcast Business Ethernet services to more efficiently run its portfolio of genetic tests. \n\nNatera, which helps families identify and manage genetic diseases, is pioneering next-generation accuracy and reliability with tests ranging from preimplantation genetic diagnosis for in vitro fertilization to revolutionary advances in the field of non-invasive prenatal testing (NIPT). The company has experienced dramatic growth over the past 18 months. With this growth came an increased demand for fast and scalable broadband Internet. Natera turned to Comcast Business and now has the bandwidth capacity to operate faster and more efficiently. \n\n\"Natera's business of processing genome-scale data requires fast and reliable Internet access. And when our business grew exponentially and we needed more bandwidth, Comcast responded quickly,\" said Jonathan Sheena, co-founder and Chief Technology Officer of Natera.  \n\nNatera upgraded its fiber based connection from 50Mbps to 200Mbps with Comcast Business, so the company has a fast, secure and scalable Ethernet connection. In addition, Natera recently expanded to 200Mbps circuits, an increase of nearly 200 percent. \n\n\"Scalable, reliable, and efficient solutions are critical for growing companies in today's digital environment,\" said Ted Girdner, Vice President of Comcast Business for Comcast's California Region. \"Natera is providing critical genetic testing services, and we're pleased to provide a solution that enhances their ability to offer these important, next-generation tests to patients.\" \n\nAbout Natera \n\nNatera (Nasdaq: NTRA) is a leading genetic testing company that develops and commercializes non-invasive methods for analyzing DNA. The mission of the company is to transform the diagnosis and management of genetic disease. In pursuit of that mission, Natera operates a CAP-accredited laboratory certified under the Clinical Laboratory Improvement Amendments (CLIA) in San Carlos, CA, and it currently offers a host of proprietary genetic testing services primarily to OB/GYN physicians and fertility centers, as well as to genetic laboratories through its cloud-based Constellation™ software system. Tests include the Spectrum™ pre-implantation genetic test for embryo selection during IVF; the Anora™ miscarriage test to understand the genetic causes of a pregnancy loss; the Horizon™ carrier screen to detect inherited mutations; and the Panorama™ non-invasive prenatal test (NIPT) to screen for common chromosomal anomalies in a fetus as early as nine weeks of gestation. Natera is also applying its unique technologies to develop non-invasive screening and diagnostic tools for earlier detection and improved treatment of cancer. These tests have not been cleared or approved by the U.S. Food and Drug Administration. \n\nFor more information, call 650-249-9090. Follow us on Twitter @NateraPrenatal and on other social media networks at http://natera.mediaroom.com/social-media. \n\nAbout Comcast Business \n\nComcast Business, a unit of Comcast Cable, provides advanced communication solutions to help organizations of all sizes meet their business objectives. Through a next-generation network that is backed by 24/7 technical support, Comcast delivers Business Internet, Ethernet, TV and a full portfolio of Voice services for cost-effective, simplified communications management. \n\nFor more information, call 866-429-3085. \n\nFollow us on Twitter @ComcastBusiness and on other social media networks at http://business.comcast.com/social. \n\nAbout Comcast Cable: \n\nComcast Cable is the nation's largest video, high-speed Internet and phone provider to residential customers under the XFINITY brand and also provides these services to businesses.  Comcast has invested in technology to build an advanced network that delivers among the fastest broadband speeds, and brings customers personalized video, communications and home management offerings.  Comcast Corporation (Nasdaq: CMCSA, CMCSK) is a global media and technology company.  Visit www.comcastcorporation.com for more information. \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/natera-bolsters-broadband-service-to-more-efficiently-deliver-its-non-invasive-genetic-screening-technology-services-300150014.html \n\nSOURCE Comcast Business \n\nPublished Sep. 29, 2015 \n\nCopyright © 2015 SYS-CON Media, Inc. — All Rights Reserved. \n\nSyndicated stories and blog feeds, all rights reserved by the author.", "source": "Virtualization Conference & Expo"}