{"published": "2015-09-17T01:31:00Z", "media-type": "News", "title": "Honda hopes revamped Civic will boost already strong sales", "id": "5f665272-bfb8-49b9-bf86-96be281acc77", "content": "DETROIT — Even though the Honda Civic compact car now on dealer lots was panned for being cheap and boring, the company still sold almost 326,000 of them last year.\n\nNow, with a completely revamped Civic heading for showrooms soon, Honda expects the car to appeal to more people and rack up even bigger sales numbers.\n\nHonda unveiled the 2016 version in Detroit on Wednesday and with a YouTube video of the car. The 10th generation Civic will come in sedan, coupe, hatchback and two high-performance versions, all of which are built on completely new underpinnings that will be used worldwide.\n\nThe new cars are almost 2 inches wider than the old ones, an inch lower and 1.2 inches longer between the wheels, yet are 68 pounds lighter. That makes them bigger on the inside and gives them a more athletic stance for better handling, according to Honda. They have new engines, transmissions and suspensions, which the company says will make them more efficient and more fun to drive than the outgoing model. One is Honda's first use of a turbocharger in the U.S.\n\nAlthough Honda won't admit it, the current Civic strayed far from the car's roots. Its bland sheet metal, Spartan interior and ho-hum styling were good enough to keep the many Civic loyalists, but didn't do much to pull in new buyers. Sales last year were down 3 percent, and they're off more than 4 percent so far this year.\n\nThe new version was designed and engineered mostly in the U.S., and the company benchmarked German luxury automakers for interior quality, ride and handling, specifically targeting the Audi A3 compact luxury car.\n\nJohn Mendel, executive vice president and head of U.S. marketing and sales for Honda, said he doesn't expect the Civic to take many buyers from the A3, who are seeking the Audi name. But increased sales will come, he said, because the Civic is aiming higher than its competitors in the compact class.\n\n\"I think it ups the game for everybody, certainly in the competitive class,\" Mendel said.\n\nHere are the highlights of the new car, which first goes on sale with the sedan sometime in November. It's followed by a sleek coupe early next year, then the hatchback and Si and Type-R high-performance versions:\n\n---\n\nINSIDE\n\nMore use of \"soft touch\" materials to give car a luxurious feel. Interior has 3.7 cubic feet more space than outgoing model, with 2 inches of additional rear-seat legroom. Seven-inch touch-screen that's compatible with Apple CarPlay and Google's Android Auto. Collision mitigation braking and other advanced safety features available.\n\n---\n\nOUTSIDE\n\nSculpted design with wheels pushed to near the corners. Longer hood but thin roof pillars for better visibility. LED lighting in front and back.\n\n---\n\nUNDER THE HOOD\n\nTwo new four-cylinder engines, including Honda's first use of a turbocharger in the U.S. They're the base 2-liter mated to either a six-speed manual transmission or a new continuously variable automatic transmission. More expensive models will get a new 1.5-liter turbocharged four with a variable transmission built specifically for it. Horsepower and performance will be announced later.\n\n---\n\nGAS MILEAGE\n\nMendel says some versions will get around 45 miles per gallon on the highway, but exact mileage wasn't announced.\n\n---\n\nPRICE\n\nNot announced. Old one starts at $18,490 excluding shipping, but the price almost certainly will rise.\n\n---\n\nCHEERS\n\nNew looks make the car very sporty. Better gas mileage, more interior room and more power. High performance versions should be fun to drive.\n\n---\n\nJEERS\n\nComes out when small-car sales are falling in the U.S. and more people are shifting into small SUVs.", "source": "Beaufort Gazette"}