{"published": "2015-09-07T00:03:50Z", "media-type": "News", "title": "TV Choice Awards: Final Top Gear series nominated for best entertainment show", "id": "df976992-7d73-4a8d-88a3-da73e4159089", "content": "Jeremy Clarkson and his Top Gear co-stars Richard Hammond and James May are hoping to go out on a high, after their final series of Top Gear was nominated for best entertainment show at the 2015 TV Choice Awards. \n \r\n\t\t\r \nThe series finale, which also featured Richard Hammond and James May, bowed out with 5.8 million viewers when it aired in June. \n\r  The final series of Top Gear, featuring Jeremy Clarkson, Richard Hammond and James May, ended with 5.8 million viewers when it aired in June \r \r \nFilming on the BBC Two motoring show was suspended after Clarkson was sacked for punching producer Oisin Tymon in a row over food in March. \n\r\n\t\t\t\r \nChris Evans has signed a three-year deal to lead an all-new line-up of presenters for the programme. \n\r\n\r\n\r\n\r \nTop Gear faces TV favourites Ant and Dec, whose show Ant And Dec's Saturday Night Takeaway is also up for the prize, along with ITV2′s Celebrity Juice and The Graham Norton Show. \n\nLenny Henry will host the ceremony, with s tars such as Mary Berry, Susanna Reid, Sheridan Smith and David Tennant expected on the red carpet  at the London Hilton Park Lane hotel tonight. \n\nPoldark star Aidan Turner, who kept viewers hooked with his impressive figure as Captain Ross Poldark in BBC1′s Cornish saga, is up for the best actor award against Doctor Who star Peter Capaldi, Broadchurch lead David Tennant and James Nesbitt in The Missing. \n\nThe 32-year-old actor's co-star Eleanor Tomlinson, who played his screen wife Demelza Poldark, made the shortlist for best actress, facing Sheridan Smith, Olivia Colman and Jenna Coleman for the prize. \n\r\n\t\t\t\r \nThe eight-episode series has also been nominated for best new drama, alongside Cilla, ITV's biopic about the late singer and presenter Cilla Black, and BBC1 series Ordinary Lies and The Missing. \n\nPoldark, which premiered in March and ended in April, has been a ratings winner, with almost seven million people tuning in for the first episode, while over six million viewers watched the finale. \n\nJulian Fellowes' period drama Downton Abbey is among the shows vying for best drama series, alongside Broadchurch, Last Tango In Halifax and The Musketeers, while TV favourites such as Gogglebox, I'm A Celebrity... Get Me Out Of Here! and One Born Every Minute have also received nominations. \n\nThe Great British Bake Off, with Mary Berry and Paul Hollywood as judges, faces Britain's Got Talent, Strictly Come Dancing and The X Factor for best talent show. \n\r\n\t\t\t\r \nEastEnders stars Danny Dyer and Adam Woodyatt are up against Coronation Street's Simon Gregson and Emmerdale actor Aaron Livesy for best soap actor, while EastEnders actress Kellie Bright faces Emmerdale's Natalie Anderson, Coronation Street's Alison King and Hollyoaks actress Nikki Sanderson for best soap actress. \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Belper Today"}