{"published": "2015-09-27T19:31:12Z", "media-type": "News", "title": "Company Shares of CST Brands, Inc. (NYSE:CST) Drops by -1.32%", "id": "2793fc54-5c2d-4c69-9696-173ee71205da", "content": "CST Brands, Inc. (NYSE:CST) has lost 1.32% during the past week and dropped 0.29% in the last 4 weeks. In the past week, the shares have outperformed the S&P 500 by 0.05% and the outperformance increases to 2.68% for the last 4 weeks. \n \nThe company shares have dropped 4.61% in the past 52 Weeks. On January 13, 2015 The shares registered one year high of $45.25 and one year low was seen on August 24, 2015 at $32.61. The 50-day moving average is $34.82 and the 200 day moving average is recorded at $39.48. S&P 500 has rallied 2.35% during the last 52-weeks. \n \nCST Brands, Inc. (NYSE:CST) witnessed a decline in the market cap on Sunday as its shares dropped 1.46% or 0.51 points. After the session commenced at $35.27, the stock reached the higher end at $35.27 while it hit a low of $34.4. With the volume soaring to 375,145 shares, the last trade was called at $34.52. The company has a 52-week high of $45.25. The company has a market cap of $2,610 million and there are 75,613,000 shares in outstanding. The 52-week low of the share price is $32.61. \n   \r  \nOn a different note, The Company has disclosed insider buying and selling activities to the Securities Exchange,  Moll William G, director of Cst Brands, Inc. had purchased 1,000 shares on August 25, 2015 in a transaction. The price per share was $34.14 and the total amount of the disclosed transaction was $34,140.The Insider information was disclosed with the Securities and Exchange Commission in a Form 4 filing. This information is based on open market transaction at the market prices.  Currently the company Insiders own 0.27% of CST Brands, Inc. Company shares.  In the past six months, there is a change of 1.24% in the total insider ownership.  Institutional Investors own 95.2% of Company shares.  During last 3 month period, 3.31% of total institutional ownership has changed in the company shares. \n \nCST Brands, Inc. (NYSE:CST), A drop of 355,388 shares or 9.1% was seen in the short interest of CST Brands, Inc.. Even as the interest dropped from 3,907,696 shares on August 31,2015 to 3,552,308 shares on September 15,2015, the days to cover came in at 7. The updated interest stood at 4.8% of the stocks floats. The shares have an average daily volume of 546,481 shares. The information was released by Financial Industry Regulatory Authority, Inc (FINRA) on September 24th. \n \nCST Brands, Inc. is a retailer of transportation fuels and convenience goods in North America. As of April 30, 2013, the Company operated 1,032 Corner Stores throughout the United States, including Texas, Louisiana, Arkansas, Oklahoma, New Mexico, Colorado, Wyoming, Arizona and California. Its stores also provide prepared foods. The Company offers a range of products, such as snack foods, tobacco products, beverages and fresh foods, including its own brands: Fresh Choices sandwiches, salads and packaged goods; U Force energy drinks; Cibolo Mountain coffees (the United States); Transit Cafe coffee and bakery (Canada); FC bottled sodas, and Flavors 2 Go fountain sodas. Its Corner Store locations also provide in-store Subway sandwich shops. In May 2013, the Company announced that the Company which includes Corner Store and Depanneur du Coin, spun off from Valero Energy Corporation.", "source": "OTC Outlook"}