{"published": "2015-09-29T19:55:18Z", "media-type": "Blog", "title": "5 Tips to Help You Stick to Your Grocery Budget", "id": "9d1402ad-6944-47ae-9350-7394352d8669", "content": "Are you having trouble keeping up with your grocery budget?  Here are some tips and tricks to help you stick to your grocery budget . \n \n\n \nI participated in an Influencer Activation on behalf of Influence Central for  American Express Serve® . I applied for the Serve Cash Back card to facilitate my review and received a promotional item to thank me for my participation. \n \nBudgets help keep us on track and control spending – whether it’s an operating budget for a Fortune 500 company or the grocery budget of a family of four. \n \nWithout a budget your monthly grocery expenses can easily get out of hand. But let’s face it, sticking to budget can be hard sometimes – there are always items you want to splurge on. \n \nI’ve put together a list of  tips to help you stay on track and make the most of your hard earned money. \n 5 Tips to Help you Stick to Your Grocery Budget  \n\n  Start meal planning – Creating a weekly meal plan is one of the best budgeting tools.  Taking the time to map out your meals ahead of time allows you to create meals that utilize what you already have on hand and what the stores have on sale.  And, because you know what you’ll be eating for the week, you can easily create a shopping list that is within your family’s budget.  For tips on meal planning, check out this post .  Don’t shop hungry – This tip is so basic but so true!  When we’re hungry, our will power is much lower and we’re more tempted to pick up unnecessary items.   If you can’t shop after a meal, try having a protein-rich snack before you head out.  Keep the kids at home – When possible, shop alone.  Not only will you save time (and your sanity) but kids can kill a budget in the blink of an eye.  They load up your cart with impulse purchases and things you don’t really need (but say yes to because you just want to get out of the store before you go crazy).  Re-evaluate your grocery budget regularly  – Things change…even our eating habits.  Every few months, take time to evaluate your grocery budget.  Have things changed in your family? Do you need to increase or decrease the amount you allotted yourself?  Use a prepaid card  – Use a card like the American Express Serve®  prepaid debit card and preload the exact amount you want to spend on groceries each month.  This will keep you from overspending and help you stay on track.   \n\n \nAmerican Express Serve® prepaid debit card   is a full service reloadable prepaid account that offers convenient and easy access to money management tools at no or low cost plus you can earn cash back on everyday purchases. \n \nAmerican Express Serve® prepaid debit card is the only debit account with 1% cash back on purchases. You can get your own American Express Serve® prepaid debit card at at a retailer for up to $3.95 depending on the retailer, or you can get one online. There are no credit checks, minimum balances or hidden fees. \n \nSome other features of the American Express Serve® prepaid debit card: \n  Use your American Express Serve® prepaid debit card to withdraw cash from over 24,000MoneyPass® ATMs.  Use your American Express Serve® prepaid debit card to virtually anywhere American Express Cards are accepted.  Use the American Express Serve Mobile app to check your balance and recent transactions, pay bills on the go, deposit checks and send money to family or friends who have a Serve account.  Get world Class 24/7 American Express Customer Service: 1-800-954-0559.  Protect eligible purchases made with the Card against accidental damage and theft for up to 90 days from the date of purchase.  Get Roadside Assistance Hotline you can call in case of emergency for reliable service.   \n  \n \n  \n \nThe post 5 Tips to Help You Stick to Your Grocery Budget appeared first on It Is a Keeper .", "source": "It Is a Keeper"}