{"published": "2015-09-08T12:00:00Z", "media-type": "News", "title": "Allianz Global Automotive and Maiden to Cooperate in European PPI/GAP Insurance Offer", "id": "bf9419a1-73e8-495c-9439-5ecfebcb488d", "content": "HAMILTON, Bermuda, Sept. 8, 2015 (GLOBE NEWSWIRE) -- Maiden Holdings, Ltd. (\"Maiden\") (NASDAQ:MHLD) and Allianz Global Automotive (\"Allianz\") today announced a significant expansion of their long standing partnership focused on developing branded insurance solutions to automotive original equipment manufacturers (\"OEMs\") and their customers. The partnership will bring together the unique skills and capabilities of both companies to assist automotive OEMs to strengthen their consumer value proposition. Forces will be joined across multiple consumer products including personal auto, payment protection insurance (\"PPI\") and guaranteed asset protection (\"GAP\") insurance.\n\nOn September 1, 2015, Allianz and Maiden entered into a long-term basis collaboration in the field of PPI/GAP to offer market leading products at attractive conditions and low cost in this specialty insurance field across Europe to OEMs. This collaboration will expand revenue opportunities for both Maiden and Allianz. Also, as previously communicated, Maiden and Allianz have entered into a quota share re-insurance agreement. Allianz will participate in a portion of Maiden's reinsurance portfolio.\n\nCommenting on the Strategic Partnership, Art Raschbaum, President and Chief Executive Officer of Maiden said: \"We are extremely pleased with our expanded relationship with Allianz. The partnership will enable us to deliver high quality products and services to the OEM market, to better leverage our payment protection platform in Europe and strengthen our partnership with an ongoing reinsurance collaboration. We are proud to be working with Allianz, a market leader with unparalleled resources and capabilities.\"\n\nKarsten Crede, CEO Allianz Global Automotive said: \"It is a great opportunity for Allianz Global Automotive to complement its special insurance offers throughout Europe with the skills of an experienced partner. With the complementary strength of both companies we will see new high-quality products at fast time-to-market and lower cost that help us serve our OEM clients.\"\n\nAbout Allianz Worldwide Partners / Allianz Global Automotive Allianz Worldwide Partners is Allianz' integrated B2B2C global business line. It will deliver integrated solutions to our business partners by combining insurance, assistance and technology and providing worldwide protection and care. Three entities of Allianz, specialized in Assistance, Automotive and International Health joined forces for their client service, for a wider range of products and for investments in innovation and technology. Allianz Global Automotive is the leading strategic partner for insurance and mobility services to car manufacturers, currently managing partnerships in more than 30 countries. Partners can choose from a broad portfolio of customized products and solutions in motor insurance, warranty, assistance.\n\nAbout Maiden Holdings, Ltd. Maiden Holdings, Ltd. is a Bermuda-based holding company formed in 2007. Through its subsidiaries, which are each A- rated (excellent) by A.M. Best, the Company is focused on providing non-catastrophic, customized reinsurance products and services to small and mid-size insurance companies in the United States and Europe. Internationally, Maiden, along with its insurance partners, offers innovative products and services to vehicle manufacturers and their customers, mainly in the area of motor insurance and payment protection. As of June 30, 2015, Maiden had $5.7 billion in assets and shareholders' equity of $1.2 billion.\n\nThese assessments are, as always, subject to the disclaimer provided below.\n\nCautionary Note Regarding Forward-Looking Statements\n\nThe statements contained herein may include prospects, statements of future expectations and other forward-looking statements that are based on management's current views and assumptions and involve known and unknown risks and uncertainties. Actual results, performance or events may differ materially from those expressed or implied in such forward-looking statements.\n\nSuch deviations may arise due to, without limitation, (i) changes of the general economic conditions and competitive situation, particularly in the Allianz Group's core business and core markets, (ii) performance of financial markets (particularly market volatility, liquidity and credit events), (iii) frequency and severity of insured loss events, including from natural catastrophes, and the development of loss expenses, (iv) mortality and morbidity levels and trends, (v) persistency levels, (vi) particularly in the banking business, the extent of credit defaults, (vii) interest rate levels, (viii) currency exchange rates including the euro/US-dollar exchange rate, (ix) changes in laws and regulations, including tax regulations, (x) the impact of acquisitions, including related integration issues, and reorganization measures, and (xi) general competitive factors, in each case on a local, regional, national and/or global basis. Many of these factors may be more likely to occur, or more pronounced, as a result of terrorist activities and their consequences.\n\nNo duty to update\n\nThe company assumes no obligation to update any information or forward-looking statement contained herein, save for any information required to be disclosed by law.", "source": "Nasdaq"}