{"published": "2015-09-01T14:31:37Z", "media-type": "Blog", "title": "Anxiety Phobia Disorders", "id": "13021094-fbf3-4cce-afa0-beac44c2083c", "content": "A phobia is a fear of a particular thing or situation.  It is a fear that is so intense that one suffers anxiety because of it.  Anxiety is that sense of dread and/or panic that is felt that causes them to suffer from a variety of physical discomforts  including trembling, nausea, difficulty breathing, and a variety of other sensations.  In general, people suffering from anxiety phobia disorders tend to feel an impending sense of doom that prevents them from further facing their fear. \n \nFear isn’t uncommon.  When the body feels fear it triggers a fight or flight response by releasing hormones which cause the heart and blood pressure to rise, blood to be rerouted from the stomach and internal organs to the limbs, respirations increase and senses are heightened. \n \nWhen this fear is consistent and prevents or restricts a person from doing something it becomes a phobia.  There are two specific types of anxiety phobia disorders.  There are specific phobias and social phobias. \n \nSpecific phobias are the result of a life experience and other biological factors.  It is the fear of a certain type of activity or thing.  For instance a person can develop a phobia of germs, blood, bugs, flying, driving, heights or any other situation or thing. \n \nThere are over 19 million people who suffer from specific phobias.  Interestingly this condition happens twice as often in women as in men.  Many of the specific phobias begin in childhood and can be a result of a traumatic event, or what is perceived as a traumatic event. \n \nThe other type of anxiety phobia disorder is a social phobia.  These are the result of being in situations that deal with performance and social activities.  This is also sometimes known as social anxiety disorder.  These social phobias affect of 15 million people.  In this instance both men and women are affected equally and again start in childhood. \n \nA person with a social phobia is fearful of being judged by others.  Things like public speaking can cause the person suffering from a social phobia to feel nauseated, tremors, rapid heartbeat and begin to sweat profusely.  Some other common fears are eating in front of people for fear they will choke or cause a type of embarrassment. \n \nThere are those unfortunate few who suffer from both anxiety phobia disorders  specific and social phobias.  They will go to great extremes to avoid being put into a social situation that will cause them anxiety.  As with other mental disorders people suffering from anxiety phobia disorders will avoid seeking help. \n \nIf the person seeks help from their primary care physician they will probably find that they are referred to a psychologist, psychotherapist or psychiatrist who can offer counseling and medication to help treat the disorder.  Treatment can also consist of behavioral modification, family counseling, individual counseling, group support and stress management. \n \nWith the proper support medically, psychologically and emotionally people with anxiety phobia disorders are often able to learn to control their fears so they are well equipped to handle situations and events.  This leads them to a more normal and productive life. \n \nMindSoothe is a specially formulated herbal remedy that has been successfully used in the treatment of Depression, Insomnia, OCD, SAD, Panic Disorder, and Anxiety. Being natural, with no artificial preservatives, MindSoothe is safe for adults and children (also see MindSootheJr . for children), is non-addictive and has NO SIDE EFFECTS. \n \nIt has become the formula of choice by thousands of satisfied customers around the world for treating depression, insomnia, anxiety, ODD and more. MindSoothe is pharmaceutically manufactured to the highest standards and was formulated by a Clinical Psychologist. \n Free PDF Health Ebook... \n\nTurbulence Training Body Weight Workout     Simply right click the ebook title above, and choose Save As to save to your desktop!  You can find more FREE Natural Health, Wellness and Pet Ebooks at Remedies4.com !", "source": "Natural Holistic Health Blog"}