{"published": "2015-09-27T10:49:58Z", "media-type": "News", "title": "Museum of Islamic Art and Mathaf, Qatar, shortlisted for LCD ‘Oscar’ awards", "id": "b9858c4d-37ce-443a-87ce-a55b69107875", "content": "The Museum of Islamic Art and the Arab Museum of Modern Art (Mathaf) have been selected to represent Qatar at the prestigious LCD Awards next month. \n\nThe MIA was shortlisted for “best architecture and spatial design,” while the Mathaf is up under the “best emerging culture destination” in the Middle East. \n\nLeading Cultural Destinations (LCD), a 15-year old company and quarterly magazine dedicated to travel and destination experiences, runs the awards, which are considered the “Oscars” for museums around the world. \n\nLCD annually nominates museums by region and across five distinct categories – Exhibitions and Programming; Architecture & Spatial Design; Eat & Drink; Shop; and Digital Experience. \n\nAccording to this year’s list, the other contenders include historic monumental institutions like the Louvre in Paris, the Museum of Modern Art in New York, the Galleria degli Uffizi in Florence and the Reina Sofia in Madrid. \n\nQatar ’s MIA is the only museum in the Middle East that was recognized for its architecture, and is competing against the Guggenheim in New York and Bilbao, among others. \n\nMeanwhile, the Mathaf is competing against Dubai’s Moving Image Museum and the Salsali Private Museum, as well as Oman’s National Museum in Muscat for the region’s best emerging cultural destination. \n\n\n\n( Image Courtesy: Richard Bryant ) \n\nThe finalists will be judged by a 12-member panel. \n\nAccording to the LCD website , the jury will be “looking for innovative ways in which both established and emerging museums enhance the visitor experience through exhibitions and programming, architecture and design, shopping, dining and digital engagement.” \n\nWinners will be officially announced at an awards ceremony scheduled for Friday, October 9, in London. \n\n( Cover Image Courtesy )", "source": "Qatar Living"}