{"published": "2015-09-15T18:32:16Z", "media-type": "News", "title": "Child Passenger Safety Week Emphasizes Proper Car-seat, Seatbelt Use", "id": "31468f76-4bd9-4eb6-8b1b-c9be958ea04b", "content": "SPRINGFIELD — Motor-vehicle crashes are the number-one cause of death among children ages 1 to 19. As part of National Child Passenger Safety Week, Sept. 13-19, Safe Kids and the National Highway Traffic Safety Administration (NHTSA) have joined forces to urge parents not only to use car seats and seatbelts for their children and others, but to register their car seats and take action during a recall. \n \nIn 2014, more than 6 million car seats were recalled for a safety defect — the largest car-seat recall in U.S. history. Yet, according to NHTSA figures, fewer than half of those car seats received the necessary repair. The reason? Only 42% of parents in a recent study said they filled out and returned the registration card — meaning, on average, six out of 10 parents risk not hearing about a car-seat recall in a timely manner directly from the manufacturer. \n \n“Registering your car seat after purchase is as important as buckling up to keep your kids safe in the car, since a defect has the potential of resulting in serious injury to your child should an accident occur,” said Mandi Summers, co-coordinator of Safe Kids of Western Mass., headquartered at Baystate Children’s Hospital. \n \nSafe Kids and NHTSA urge all parents and caregivers to follow these steps to ensure their child is protected in a vehicle: \n \n• Register online with your car-seat manufacturer or www.safercar.gov/parents . You’ll need the model number and date of manufacture found on the label of your car seat. Or, fill out and mail in the registration card that came with your car seat. It already contains your car seat’s information. \n \n• Visit the National Highway Traffic Safety Administration’s website at bit.ly/recalledseats to check if your car seat has been recalled. You will need the name of the manufacturer, model number, and date of manufacture. A label on your car seat should have all this information in one place. \n \nAs for older children, “it’s a proven fact that kids look to their parents when it comes to setting a good example. So, adults need to wear their seatbelts at all times and make sure that everyone from other adults to kids are buckled up in their car,” said Summers. \n \nSafe Kids offers the following car-seat checklist for parents and caregivers, so as not to put a child at risk by making sure they buckle up the right way on every ride: \n \n• My child always rides in a back seat and never in front of an airbag. \n \n• Everyone in my car buckles up on every ride using the right car seat, booster seat, or seatbelts for each person’s age and size. \n \n• My child’s car seat has all of its parts, labels, and instructions, and has never been in a crash. \n \n• I follow the instructions for my car and my car seat so that my child is buckled in correctly. \n \n• I never leave my child alone in a car. \n \nSeventy-three percent of car seats are not used or installed correctly, and when used correctly, child safety seats can reduce the risk of death by as much as 71%. \n \nSafe Kids hosts car inspection events across the country, where certified technicians can help you learn to install your car seat properly, as well as double-check your work on an already-installed car seat and inform you if your car seat has been recalled. To schedule an appointment with Safe Kids of Western Mass. for a free car-seat inspection, call (413) 794-2255.", "source": "Cambridge College Healthcare News"}