{"published": "2015-09-12T14:00:00Z", "media-type": "Blog", "title": "Hardly a 'Patch' Job: This Franchisee Is Deep into at Least 4 Franchise-Industry Roles", "id": "20a52b71-3d7b-4ece-a107-116e5dbd9af4", "content": "September 12, 2015 Franchise Players is Entrepreneur's Q&A interview column that puts the spotlight on franchisees. If you're a franchisee with advice and tips to share, email ktaylor@entrepreneur.com.\nThe guy is only 30 years old, but franchisee Bill Bunting already has found success with one restaurant concept and is developing a second, besides doing franchise-related corporate work with two consulting firms. Now, he's on to yet another franchise adventure: an expanding concept called The Patch Boys, which, yes, performs patch jobs on the wall and ceiling holes other contractors leave behind. \"I love the simplicity in the model,\" Bunting says. \"We literally just patch holes in walls,\" He describes his plan to have 10 Patch Boys vehicles operating in the Delaware Valley in the next five years. And after that, who knows? \"I enjoy networking and connecting integrity-filled companies together,\" Bunting says. Sounds like there's a lot of that in his future. \nImage credit: Bill Bunting\nName: Bill Bunting\nFranchise owned: The Patch Boys of South Jersey.\nHow long have you owned a franchise? Four months.\nRelated: How I Grew My Wheelchair Ramp Company Into a Franchise\nWhy franchising? Franchising provides a great opportunity to become your own boss through following a proven system. I enjoy franchising because it gives entrepreneurs the ability to obtain financial independence and secondary residual income. Franchising creates new entrepreneurs every day!\nWhat were you doing before you became a franchise owner? I have been in the franchise industry approaching 15 years [including a high school business career]. I owned and operated a Philly Pretzel Factory franchise for four years, prior to joining the Philly Pretzel Factory Corporate Team. There, I mentored under Marty Ferrill and Dan DiZio and held positions in development, operations, training, strategic planning, onboarding and franchisee relations.\nI am currently a development partner and integral part of an upcoming franchise brand in the city of Philadelphia called Sweet Pea Ice Cream. I am supporting the launch of a new brand called The Milkhouse “Grilled Cheese & Ice Cream,” which is expanding to its second location in Philadelphia. I am a business broker with Murphy Business Financial Corporation, which is also a franchise system. My primary position and role is with Franchise Marketing Systems, where I lead a department that supports franchisors on operations, training and onboarding franchisees. \nWhy did you choose this particular franchise? The Patch Boys business model provides a low-cost-entry, home-based business model, with a strong ROI. I love the simplicity in the model. We literally just patch holes in walls. The need is huge, between residential, sub-contractor support and property-management partnerships.\nHow much would you estimate you spent before you were officially open for business?\nRoughly $35,000 in all: $25,000 for the franchise fee, $1,500 for a smart car lease; $2,100 for wrap; $1,000 for tools and equipment; and $1,000 for a CPA and the LLC formation. The remainder went toward marketing.\nWhere did you get most of your advice/do most of your research? The major portion of my advice for The Patch Boys franchise came from my experience in the industry, backed by advice and support from my industry mentors and the expertise Franchise Marketing Systems provides. Chris Conner and Tom DuFore are both great sources of information regarding the franchise industry and I am lucky to have access to them daily for advice. I have strong relationships and partnerships with several legal experts, who provide me with regular advice on important franchise business decisions.\nRelated: How This Mother-Daughter Duo Decided to Open a Home Building Franchise\nWhat were the most unexpected challenges of opening your franchise? We really didn’t have many unexpected challenges. We were able to secure jobs relatively quickly after following the franchisor’s direct marketing system. I know that, going into a home-based franchise model, it falls on the franchisee to grow the business in the local territory assigned.\nWhat advice do you have for individuals who want to own their own franchise? Pick a business model that you want to own. Do your research and know whom you are buying a business from. Once you understand what you are buying and whom you are buying from, make an educated decision on what you foresee yourself doing for a minimum of the term of the franchise agreement. Look beyond the surface of the business and envision yourself in the business.\nWhat’s next for you and your business? I enjoy networking and connecting integrity-filled companies together. My plan is to continue to develop strong partnerships and relationships in the franchise community to continue to support industry growth. I will continue to grow [his corporate work and restaurant concept] and my new partnership in The Patch Boys franchise, to create a strong source of long-term income for myself and my team.\nWe will continue to focus on the growth of The Patch Boys business model in South Jersey and the Philadelphia market. My goal is to have 10 Patch Boys vehicles servicing the Delaware Valley in the next five years.\nRelated: Franchise Players: A Former Drill Sergeant Who Hopes to Help Other Vets Through Franchising", "source": "Entrepreneur"}