{"published": "2015-09-16T15:10:27Z", "media-type": "Blog", "title": "‘The Bastard Executioner’ Is Blunt Force Sutter", "id": "68d20a19-c903-4d17-875a-3db4a415b77a", "content": "FX \n\n \nEarly reviews of Kurt Sutter’s news FX series, The Bastard Executioner have been decidedly mixed, with several outlets ( including our own ) drawing unfavorable comparisons to Game of Thrones , while others have drawn parallels with Sutter’s previous show, Sons of Anarchy (the premise itself even has a little of Mad Men in there, too, with the lead character taking the identity of another man). \n \nBut here’s the thing with The Bastard Executioner : You can make comparisons to other shows and movies all day long. I’m sure there’s hints of influences all up and down the series ( Beastmaster , for one), but what indelibly sets it apart from everything else on television is one thing: Its showrunner. The Bastard Executioner is Sutter as f*ck. Everything viewers have grown used to after seven seasons of Sons of Anarchy is there, and that includes all the excesses. Sutter doesn’t know the word restraint. Why use five buckets of blood when you can use 100? Why have one scene featuring a backdoor-bang in the pilot when you can have three! Sutter is the kind of guy who doesn’t stop at gutting a man with a sword, not when he can also stab him in the throat, in the back of the head, and through the taint (no, really!). What’s better than a battle scene? A battle scene with a naked woman walking through it, of course! It’s gloriously Sutter, and that also includes his inability to edit himself. Sutter is not an efficient storyteller, but he is an effective one. \n \nWhatever your feelings on Sutter, that voice and style is distinctive. He is blunt. And profane. He is bloody, and he is cruel . Sutter is not for everyone. He is Shakespeare and Motörhead by way of Jersey, a bottle of whiskey, and a couple of snuff films. In a room with his contemporaries — Matthew Weiner, Vince Gilligan, David Simon, David Chase, etc. — he may not be anyone’s first choice to write a complex long-running series, but he would be a great first choice in a knife fight. While Weiner is huddled in a corner praying for the attackers to leave, and while Vince Gilligan was trying to nice-guy talk them out of attacking with a reasoned plea, Kurt Sutter would be the guy out in front kicking the attackers’ asses. After he’d left them bloody and unconscious, he’d go back and stab them in the eye for good measure. \n \nHe’s not a subtle man. All of his characters are bad people, it’s just that the villains do bad things for the selfish reasons, while his protagonists do bad things out of loyalty, for family, and most of all, out of vengeance. Sutter loves a good revenge tale, and he has never met a war of attrition he couldn’t drag out for seven seasons. It may get exhausting in seasons two, four and six, but the high points will ultimately be worth the low ones. \n \n\nThat’s Kurt Sutter, and everything you love and maybe hate about him is on full display in The Bastard Executioner ‘s unnecessarily long two-hour pilot. There’s gratuitous sex, gratuitous violence and gratuitous profanity, so if you’re a fan of gratuity, you’re going to love this series. \n \nThere are a lot of characters in the pilot of The Bastard Executioner , but you don’t really need to worry yourself keeping up with who is who. By the end of the episode, most of them are dead anyway. There are really only six or seven characters you have to concern yourself with going forward. \n \nHere’s who you need to know. \n \nFX \n\n \nWilkin Brattle (Lee Jones) is a Welsh warrior in the 14th century. He’s like Charlie Hunnam plus a beastly John Krasinski. Brattle has seen enough of the ravages of the war to lay down his sword and return to his small village and live out a peaceful life with his wife, who is pregnant. How do you know his wife is going to die in the pilot? Because she is pregnant, and this is a Kurt Sutter series, people. Keep up! Of course she’s going to die in the pilot, and of course they’ll rip out her guts and leave them lying across her body. \n \n\n \nFX \n\n \nConflict arises when the cruel and greedy English baron Erik Ventris ( Brian F. O’Byrne ) starts taxing their village too harshly. In order to send a message to the baron, Brattle and his merry men of masked bandits take out a few of the king’s men. The baron finds out the identities of the bandits, and in order to send his own message, he burns down and kills everyone in Wilkin’s village, leaving behind a stack of dead bodies. \n \nFX \n\n \nBrattle’s wife manages to escape briefly, but is killed while fleeing. However, she’s not killed by any of the baron’s men. She’s murdered by a healer, Annora of the Alders (Katey Sagal, sporting long grey hair and a Welsh- ish accent). Brattle doesn’t know this, however. He thinks the baron is fully responsible, so he gathers a group of rebels (including a nearly unrecognizable Matthew Rhys, from The Americans ) and he gets his revenge, killing the baron and all his men. It is bloody. Gloriously, violently bloody. \n \n\n \nFX \n\n \nThe baron, however, stabs Brattle before he gets a knife through the back of his own head and through his mouth. Annora — the healer — brings Brattle back to life, but in doing so, she carves a cross on his cheek, allowing Brattle to pass for another man, an executioner. Under the guise of that dead man’s identity, Wilkin returns to the baron’s castle and offers up his services. \n \nThere are a few catches, of course. The man who died — the series’ Dick Whitman — had a wife and kids, but they’re happy to accept Brattle as their new husband and father because Brattle doesn’t beat them, as the dead man did. \n \nFX \n\n \nHowever, the baroness Lady Love Ventris (Flora Spencer-Longhurst), who takes over after the death of her cruel husband, is actually a lovely person, and seems like she’ll be a good ruler. She also takes a fancy to Brattle, which is an interesting wrinkle. How is the executioner supposed to feel about the wife of the man whom he thinks killed his own wife? \n \n\n \nFX \n\n \nThere’s also the chamberlain Milus Corbett (Stephen Moyer), who was the baron’s right-hand man and now the baroness’ advisor. He’s sketchy as hell, and Moyer is terrific in the role. He’s instrumental in bringing on the executioner, and then assigning him the task of killing the chamberlain’s brother, one of the only other people who knew the truth about Brattle’s identity. The chamberlain clearly has political aspirations, and he has his doubts about the executioner, but we’re not entirely sure of his motivations beyond that. \n \nFX \n\n \nOther characters include Father Ruskin ( Sons alum Timothy V. Murphy), who seems like he may play the series’ Varys; Toran Prichard (Sam Spruell), the executioner’s best friend and confidante, and Petra (Elen Rhys), who plays the executioner’s late wife. (She’ll will recur in visions.) Meanwhile, we don’t really know what the deal with Sagal’s character, Annora, is yet, but we do know she’s in cahoots with The Dark Mute (Kurt Sutter himself), a hideous creature who lives in a cave. It’s very, very Sutter. \n \n\n \nFX \n\n \nAnd yes, Sarah White — who plays the baroness’ assistant — is Katey Sagal’s daughter, as if you couldn’t divine that from their likeness. \n \nFX \n\n \nThere’s plenty about The Bastard Executioner that doesn’t work. It’s a show that practically lends itself to being ripped apart. But it’s easier, and far more enjoyable, simply to let the Sutter wash over you — if you can stomach the bloody violence and the brutal sex scenes.", "source": "UPROXX » Web Culture"}