{"published": "2015-09-23T02:07:14Z", "media-type": "News", "title": "Malcolm Turnbull junks tax white paper in major 'reset'", "id": "63638b79-a091-4ccf-a674-cbac13a7f524", "content": "Overhaul put on ice to allow major 'reset' on reform. In one of his first acts after becoming Prime Minister, Malcolm Turnbull last week secretly suspended all work on the Abbott government's white paper on taxation, just weeks before it was due to deliver its first preliminary report.\n\nStunned bureaucrats at the Federal Treasury, the Tax White Paper Taskforce and the Board of Taxation, were last week told work on the white paper - instigated by former treasurer Joe Hockey in 2014 - would come to a complete halt.\n\n\"We were told to put everything on ice, and that a 'reset' on tax reform was taking place,\" said one senior executive.\n\n\"It came as a shock. We have invested tens of thousands of man hours. Over a thousand submissions have been received for the discussion paper. It looks like all that work, the biggest review of taxation ever undertaken in this country, is now dead in the water.\"\n\nThe first green paper from the process was due to be released in just seven weeks' time.\n\n\"We will not be releasing that paper until next year,\" Fairfax Media was told.\n\nMr Turnbull's move to halt the white paper process was made before he appointed Scott Morrison as Treasurer.\n\nIt is believed that Treasury Secretary John Fraser was instructed to communicate that news last week. Rethink from the ground up\n\n\"From what I have been told, the entire process has been brought to a halt because we 'have to rethink taxation from the ground up' and it's a \"reset on tax policy'. They are the words used by the Prime Minister's office,\" Fairfax Media was told.\n\nMajor corporations, industry bodies and interest groups have already spent hundreds of millions of dollars on taxation advice and legal advice to make submissions to Canberra for the white paper. The Business Council of Australia's submission alone runs to 75 pages.\n\nThe CEO of one of Australia's key alcohol industry groups confirmed they had spent $500,000 on tax advice. \"And we are one of the smaller spenders,\" the CEO said.\n\n\"I have no doubt this whole process has cost Australian industry hundreds of millions of dollars. I can't even imagine what the big mining companies and banks have spent preparing their submissions.\"\n\nThe Tax White Paper Taskforce has had more than 700 public submissions uploaded to its website, from companies including ANZ Bank and BHP Billiton to British American Tobacco. It is believed that a similar number of confidential submissions have been also received. Abbot pledged election target\n\nFormer prime minister Tony Abbott signed off on the white paper's terms of ­reference in early December, and promised to take to the next election any ­recommendations his government adopted from the process, which had a year to report. After some extensions and revision to the terms of reference, that final report was due in the first quarter of next year, with a tax policy to be formulated before the federal election due sometime next year.\n\nFormer Treasury secretary Ken Henry, who was also involved in introducing the GST, this week advised Mr Turnbull to defer the tax reform package until after the next election.\n\n\"I fear we have kicked the can down the road on tax reform and won't do anything until after the next election,\" said one backbench MP.\n\nBut other Liberals believe Mr Turnbull will now push ahead with an ambitious program of tax reform.\n\nIn 2005, as a new member of federal parliament, Mr Turnbull infuriated then treasurer Peter Costello by commissioning his own tax reform package, which he paid for out of his own pocket.\n\nCalled the The Taxation Reform in Australia: Some Alternatives and Indicative Costings paper, Mr Turnbull argued for a flatter personal tax rate system, with a top marginal rate of either 35 or 40 cents in the dollar. That paper was publicly pilloried by Mr Costello at the time.\n\n\"I think you will find that Costello plays a fairly significant role in what happens next,\" said a leading Victorian Liberal.\n\nHe pointed out that Mr Morrison had enlisted Mr Costello's former chief of staff, Phil Gaetjens, as his new chief of staff, while another Costello loyalist, Kelly O'Dwyer, has been appointed assistant Treasurer and promoted to federal cabinet.\n\nThe Australian Financial Review has reported that Mr Morrison is close to Mr Costello and \"confides in him frequently\", and sought his advice on what to do on the night of the leadership spill.\n\nMr Morrison has also picked up other Costello staffers, including Sascha Grebe.\n\n\"I have no doubt that Malcolm needs Costello's support on tax reform, which is why you have seen those moves.\" The story first appeared on The Sydney Morning Herald.", "source": "Riverina Leader"}