{"published": "2015-09-14T00:48:12Z", "media-type": "Blog", "title": "BOMBSHELL: Obama’s Pentagon Refuses To Target ISIS Training Camps… NO Airstrikes Allowed", "id": "01a2b32d-c0e9-43e5-8920-dea05e682e47", "content": "BOMBSHELL: Obama’s Pentagon Refuses To Target ISIS Training Camps… NO Airstrikes Allowed\nBOMBSHELL: Obama’s Pentagon Refuses To Target ISIS Training Camps… NO Airstrikes Allowed No airstrikes against 60 camps producing 1,000 fighters monthly…\nDean James III% AMERICA’S FREEDOM FIGHTERS – We all know Obama has no desire to defeat ISIS. They are all related to him in one way or another. And they have the same ideals. He has absolutely no interest in fighting terrorism. He is more interested in racial divide here in America. It’s easy. It takes far less effort. And he doesn’t care about the collateral damage here in America. Obama is a scumbag. That being said, the Washington Free Beacon is reporting that the Pentagon doesn’t even care about targeting ISIS training camps. Does this seem like a strategy to you? BOMB THE HELL OUT OF EVERY ISIS TRAINING CAMP IN EXISTENCE YOU FRICKING MORONS! Come on now, for God’s sake who in the hell is in charge of this crap? A bunch of spineless disgusting liberal idiots.\nThe Pentagon has not conducted airstrikes against an estimated 60 Islamic State (IS) training camps that are supplying thousands of fighters each month to the terror group, according to defense and intelligence officials.\nThe camps are spread throughout Islamic State-controlled areas of Iraq and Syria and are off limits in the U.S.-led international bombing campaign because of concerns about collateral damage, said officials familiar with planning and execution of the yearlong bombing campaign.\nAdditionally, the IS (also known as ISIS or ISIL) camps have been so successful that Islamic State leaders are considering expanding the camps to Libya and Yemen. Both states have become largely ungoverned areas in recent years.\nThe failure to target the training camps with U.S. and allied airstrikes is raising questions among some defense and intelligence officials about the commitment of President Obama and his senior aides to the current anti-IS strategy of degrading and ultimately destroying the terror group.\n“If we know the location of these camps, and the president wants to destroy ISIS, why are the camps still functioning?” one official critical of the policy asked.\nGREAT QUESTION! We want to know the answer. Actually we know the answer. OBAMA LOVES ISIS. Obama IS ISIS. He funds ISIS.\nIt is totally incomprehensible how and why we aren’t blowing the hell out of these camps.\nThank GOD that Obama wasn’t around back in WWI or WWII or we wouldn’t even exist. The dude is the most worthless president ever in the history of America. Totally pathetic…", "source": "Confessions of a Colorado Conservative"}