{"published": "2015-09-23T22:26:34Z", "media-type": "News", "title": "Gates Vascular Institute Uses Toshiba Systems to Provide Lifesaving Treatment to Stroke Patient", "id": "5741c50e-0cb0-448e-beb2-0e47592e29fd", "content": "September 23, 2015 \n   \nInfinix Cardiovascular X-ray and Aquilion ONE CT Help Facilitate Successful Angioplasty of Intracranial Stenosis \n \nTUSTIN, Calif., Sept. 23, 2015 – Ronald Cooper of Sydney, Australia, suffered two small strokes and found his basilar artery 90 to 95 percent blocked. His local doctors placed him on medication that offered him little hope for improvement. After his daughter exhaustively searched alternatives, she came across the Gates Vascular Institute (GVI) in Buffalo, New York, and its leadership in conducting successful submaximal angioplasty, a vascular procedure that provides an alternative to stenting and medical therapy. \n \nMr. Cooper traveled to Buffalo and underwent a successful procedure that saw him return to Australia with his blockage cleared. In the planning and execution of the angioplasty, GVI used Toshiba’s Aquilion TM ONE CT’s perfusion capabilities to confirm a severe narrowing of Mr. Cooper’s intracranial basilar artery. The team then utilized the Infinix™ Elite cardiovascular X-ray system’s superior visualization to carry out the angioplasty to expand the artery and immediately improve blood flow. The decision to use this over the commonly used medical therapy saved his life and prevented a potentially devastating stroke. \n \n“While many physicians don’t consider interventional solutions for this condition, our facility has a strong track record of effectively using submaximal angioplasty to treat intracranial stenosis,” said Adnan Siddiqui, M.D., Ph.D., director of neurosurgical stroke service, Buffalo General Medical Center and Gates Vascular Institute, and professor of neurosurgery and radiology at the University of Buffalo. “The Toshiba systems allowed us to properly assess the situation and effectively use this technique in a manner that allowed the patient to be discharged the next day and be on his way home to Sydney in ten days’ time.” \n \n“The safety and experience of patients treated with our systems is the major influence in our system designs,” said Satrajit Misra, vice president, Marketing, Toshiba. “The use of multiple Toshiba systems across the CT and X-ray/vascular modalities for this procedure highlights that as these therapies evolve, physicians trust our systems to give them the tools they need for success.” \n \nAbout Toshiba  America Medical Systems, Inc. \n \nWith headquarters in Tustin, Calif., Toshiba America Medical Systems markets, sells, distributes and services radiology and cardiovascular systems, including CT, MR, ultrasound, X-ray and cardiovascular equipment, and coordinates clinical diagnostic imaging research for all modalities in the United States. For more information, visit Toshiba’s website at www.medical.toshiba.com . \n \nAbout Toshiba Medical Systems Corporation \n \nToshiba Medical Systems Corporation is a leading worldwide provider of medical diagnostic imaging systems and comprehensive medical solutions, such as CT, X-ray and vascular, ultrasound, nuclear medicine and MRI systems, as well as information systems for medical institutions. Toshiba Medical Systems Corporation has been providing medical products for over 80 years. Toshiba Medical Systems Corporation is a wholly owned subsidiary of Toshiba. Visit Toshiba Medical Systems Corporation’s website at www.toshibamedicalsystems.com. \n \nAbout Toshiba \n \nToshiba Corporation, a Fortune 500 company, channels world-class capabilities in advanced electronic and electrical products and systems into five strategic business domains: Energy & Infrastructure, Community Solutions, Healthcare Systems & Services, Electronic Devices & Components, and Lifestyles Products & Services. Guided by the principles of The Basic Commitment of the Toshiba Group, “Committed to People, Committed to the Future,” Toshiba promotes global operations towards securing “Growth Through Creativity and Innovation” and is contributing to the achievement of a world in which people everywhere live in a safe, secure and comfortable society. \n \nFounded in Tokyo in 1875, today’s Toshiba is at the heart of a global network of over 590 consolidated companies employing over 200,000 people worldwide, with annual sales surpassing 6.5 trillion yen (US$63 billion). To find out more about Toshiba, visit www.toshiba.co.jp/index.htm .", "source": "Toshiba Medical Systems"}