{"published": "2015-09-17T17:00:27Z", "media-type": "Blog", "title": "Masta Ace Discusses Writing For Will Smith’s “Willennium” Album", "id": "6a3cd516-7e2c-4a95-b29e-0742cb35f881", "content": "Masta Ace has collaborated with such Rap icons as Big Daddy Kane and Kool G. Rap and has been cited as Eminem as an inspiration. The Brooklyn, New York rapper also wrote for Will Smith on the rapper-actor’s Willennium album, which was released in 1999. “The way it worked was the beat's playing, everybody's in their corner writing lines, trying to come up with cool metaphors, cool lines,” Masta Ace says during an interview with NPR. Masta Ace is credited as a writer by his given name, Duval Clear, on the Willennium cut “Uuhhh.” Kel Spencer is also featured on the song. \"And then it's like, 'OK. Let me hear what you got,’” Masta Ace continues. \"'Alright. I got such, such, such. Such, such, such.' 'Oh, I like that one line. Let me get that. That's dope. And then I got this. What you got? I like that line. Give me that line.' And literally the verses were pieced together taking bits and pieces of what not just — what Will wrote, what I wrote, what Kel wrote, what the other writer wrote, and we formulated verses with bits and pieces of what everybody was doing.” The Will Smith discussion from the NPR interview was preceded by a discussion about Drake using other writers to compose his songs, a topic that became a focal point in the Rap world when, in July, Meek Mill accused Drake of not writing his rhymes.  \"The fact that he brought somebody in to help him throw a couple of metaphors in — I mean, I think that the game is changing a little bit where it's going to become acceptable,” Masta Ace says. \"Every other genre in music you have writers — artists go out and find writers, good writers, to come in. Hip-hop doesn't have that because we've been from that school of thought that if you're on the mic talking about how great you are and how dope you are and how nobody's as good as you, you have to be the one penning those lyrics. \"To me Drake is a song-maker,” Masta Ace continues. \"He makes good songs. He makes popular songs. He makes catchy songs. And it actually didn't shock me as much when I found out that there were people helping him formulate some of the lines, because his output of popular music has been unprecedented. You can — there's no artist that you can name in hip-hop all the way up till now that has had that many records on the radio at the same time, that were good records, that were hit records, that were popular records. And I was starting to think he was a computer or a machine the way he was cranking out these records.\" Masta Ace's NPR interview is as follows, as is Will Smith's \"Uuhhh\":", "source": "HipHopDX News"}