{"published": "2015-09-12T18:10:00Z", "media-type": "News", "title": "Princeview Dental Weighs in on Study on Sugar's Role in Causing Cavities", "id": "b9577c4b-0b50-4ff0-8a40-597e4d042e4e", "content": "Princeview Dental weighs in on a study regarding sugar’s impact on the formation of cavities.\n\nToronto, Canada – September 11, 2015 /MarketersMedia/ \n\nPrinceview Dental, (www.PrinceviewDental.com), one of Etobicoke’s premier dental clinics, is weighing in on a recent study regarding how important sugar is to the formation and development of cavities.\n\nAccording to a report by the International and American Associations for Dental Research, the process of cariogenesis, the development of cavities, is very sensitive to even low amounts of sugar entering the mouth. From the results found, the researchers determined that free sugars are the primary factor in the creation of cavities. (Source: “IADR/AADR reports include critical review of diet, dental caries and health policy interventions,” News-Medical.net, August 11, 2015; http://www.news-medical.net/news/20150811/IADRAADR-reports-include-critical-review-of-diet-dental-caries-and-health-policy-interventions.aspx.)\n\n“Tooth decay has long been recognized as one of the most prevalent non-communicable diseases in the world,” says Dr. Janice Mummery, founder of Princeview Dental. “In addition, dental treatments can place a strain on lower-income and/or uninsured families and individuals.”\n\nThe findings of this study are especially timely, as the World Health Organization (WHO) recently published guidelines on reducing the sugar intake in adults and children to reduce cavities. The guidelines recommend that everyone reduce their sugar consumption to below 10% of their total energy intake, as well as brush twice a day, floss, and use an antiseptic mouthwash. It is also important to visit a dentist at least twice a year. (Source: “WHO calls on countries to reduce sugars intake among adults and children,” World Health Organization web site, March 4, 2015; http://www.who.int/mediacentre/news/releases/2015/sugar-guideline/en/.)\n\n“Cutting down on sugar can only do so much. Practicing good oral hygiene and scheduling an appointment for a cleaning and X-rays every six months will detect any issues before they become a cause for concern,” Dr. Mummery concludes. “If caught early, many oral health concerns can be treated easily.”\n\nFor more information on Princeview Dental or to book an appointment for dental services at its Etobicoke office, visit www.PrinceviewDental.com. For more information about us, please visit http://www.princeviewdental.com/\n\nContact Info:\n\nName: Dr. Janice Mummery\n\nOrganization: Princeview Dental\n\nAddress: Princeview Dental Group , 2943 Bloor Street West Etobicoke, Ontario M8X 1B3\n\nPhone: (416) 231 4562\n\nSource: http://marketersmedia.com/princeview-dental-weighs-in-on-study-on-sugars-role-in-causing-cavities/91114\n\nRelease ID: 91114", "source": "KTUL"}