{"published": "2015-09-03T02:45:49Z", "media-type": "Blog", "title": "Turning 21 in Hong Kong", "id": "f3b300c9-a877-4707-bb3a-b922a200dad0", "content": "After celebrating my birthday in the Philippines by throwing a party for almost 20 years, I knew that it was time to retire from and start spending the day exploring a country, old or new. For my 21st, I decided to go to Hong Kong with Vern and Ben and I was so happy that she surprised me by inviting my best friend along! :) It was a definitely a different experience and I wouldn’t mind doing it again and again :) Hopefully I’ll always have the time and means to! :) \n \nROOMORAMA made it all the more special by making our nth trip to Hong Kong a different one by making us #LiveLikeALocal. For those of you who are not familiar with the brand, with over 300,000 properties, Roomorama is the largest platform for professionally-managed vacation rentals worldwide. Not only that, they also make sure that each apartment is screened and well curated for quality :) Using the website was even easy as 1.. 2.. 3! All you have to do is type in your destination, your check in and out dates, your budget and viola! You get a choices to pick from :) You can even be more detailed by putting in the neighbourhood you want to be situated in or the tourist spots you want to be near to :) \n \n Vern knows she’s in Hong Kong if this is available everywhere! :P \n \n \nOur first ROOMORAMA apartment was at Causeway Bay, a mere 2 minute walking distance from the famous Times Square Hong Kong. To tell you honestly, the building didn’t look promising at all.. it was the usual dirty ones from the outside but wow when we arrived? This beauty welcomed us! :) \n \n \nThe room had a very interesting personality! :) It had a total of 3 rooms and it was so spacious! It’s very different because Hong Kong is known to have one of the most expensive real estates in the world for little sqm and this was such a treat! :) Goodbye small expensive hotel rooms! \n \n \nThis is Times Square Hong Kong. It’s a shopping district in the middle of the business side of the city :) \n \n \nOur first meal was at Agnes B. Cafe! Look at that cute bear dessert! :)   \n \nOfcourse, we visited Hong Kong’s Victoria Harbour! :) \n \n \nEzra and Vern surprised me by making reservations at the highest bar in the world, Ozone,  that’s located in Ritz Carlton to welcome my birthday. They prepared champagne and a cake for me to blow! :) It felt so surreal! \n \n \n \n \n \n \n \n \n \n#singegirlproblems \n \n \nThe next day, Vern and I had my birthday afternoon tea at Ritz Carlton once again :) \n \n \n \n \nWe transfered to our next ROOMORAMA apartment to move closer to the city centre and when I requested closer, they moved us right smack in the centre of the city! It was so convenient and I love that this place was more family oriented as Ben and Ezra flew out and my mom flew in :) I could see my family renting this out once again in the near future! It was had FOUR rooms, a balcony, a complete kitchen, a formal dining and living room! :) Perfect! Plus, its just a 5 minute train ride from Mong Kok and Canton Road :) \n \n \n \nSo spacious and isn’t so elegantly decorated? :) \n \n \n \nWe had a killer view to boot it too! \n \n \n \nPerfect for Vernon and Baby Verns! :) \n \n \nThe entrance of our apartment was in Nathan Road! It was easy to get a bus, a cab or take the subway which is a minute walk from the entrance :) There was KFC in front too for my midnight cravings :P \n \n \n \n \nA big thank you to ROOMORAMA for making my birthday extra special this year! :) Also, we have a treat for you! Register through this link and 50USD credits is waiting for you :) \n \n  \n    \nThe post Turning 21 in Hong Kong appeared first on V ♥ V .", "source": "V ♥ V"}