{"published": "2015-09-14T12:05:00Z", "media-type": "News", "title": "Big Bad Boo Studios Launches Lili & Lola Language-Learning Mobile Games", "id": "17debbff-bc0a-4b97-90e0-fa59b58fbf25", "content": "VANCOUVER , Sept. 14, 2015 /PRNewswire-iReach/ -- Big Bad Boo Studios announced today the launch of a series of educational iOS games for its new preschool mini-series Lili & Lola . Backed by the Canadian Media Fund and several Canadian broadcasters, the project features language-learning iPad and iPhone games in the Persian language. There are four apps in the series, with each focusing on a different educational component for the language. The project targets preschoolers who are bilingual or are learning the Persian language. In addition to the games, the company has also released a show website at www.liliandlolashow.com where additional web only games are available free of charge as well as downloadable educational materials such as coloring sheets, screen savers and Persian Alphabet tracing sheets. \n\nPhoto - http://photos.prnewswire.com/prnh/20150912/265905  \n   \nShabnam Rezaei , the creator of the show said, \"I am really hopeful that parents and educators will find these games and materials useful to teach basic Persian language skills. Our test audiences love them and we are very excited to be active in mobile gaming with value-added, educational content.\" \n\nThe games include \"Learn the Persian Alphabet\" game, which teaches children how to trace each letter and the sound of each letter. The \"Quiz Show\" game teaches every day vocabulary. The \"Hide and Seek\" game teaches prepositions in a fun setting, where the player looks for the lost monkey \"Maymoon\" in various rooms in the house. Last but not least, the \"Memory Match\" game focuses on strengthening memory through a traditional visual memory game. The games are free and available on the Apple iTunes Store. Two of the games have additional packs, which can be purchased for 99 cents . \n\n  Lili & Lola , Big Bad Boo Studios' latest miniseries, launched earlier this year on several TV stations include Shaw Multicultural, ICI Television, TenTV and Oznoz.com. The show follows the adventures of two sisters who live in a small apartment in a big city. Lili & Lola celebrates cultural diversity by showcasing an Iranian family celebrating holidays like Norooz, the Persian New Year and introducing language to a young audience in a normalized fashion. Episodes of Lili & Lola are available for streaming and downloading exclusively on the new SVOD channel, Oznoz.com. \n\nAbout Big Bad Boo Studios \n\nBig Bad Boo Studios is dedicated to producing quality family programming that is entertaining and educational such as their latest mini-series Lili and Lola. Their hit TV series 1001 Nights has won 4 LEO awards with 11 nominations and is airing in over 80 countries and 15 languages, including Teletoon Canada, Disney and Discovery Kids. The company has offices in New York , Los Angeles and Vancouver. Their first product Babak & Friends – A First Norooz was a direct-to-DVD cartoon about the Persian New Year. Their first animated TV series, Mixed Nutz, about a group of misfits from around the world, airs on Shaw TV, PBS, GEM TV and major stations around the world. The company also distributes popular children's content like Sesame Street, Bob the Builder, Babar and others in multiple languages to North America on the new Oznoz Platform. Visit www.bigbadboo.ca and www.oznoz.com . \n\nFor more information, please contact: \n\nNina Gabriadze / Big Bad Boo \n\n212.960.8980 / nina@bigbadboo.ca \n\nMedia Contact: Nina Gabriadze, Oznoz Entertainment, 2129608980, nina@oznoz.com \n\nNews distributed by PR Newswire iReach: https://ireach.prnewswire.com \n\nSOURCE  Oznoz Entertainment", "source": "Wall Street Business Network"}