{"published": "2015-09-14T21:49:12Z", "media-type": "News", "title": "Liberal leadership: Australian dollar gets a Malcolm Turnbull bounce", "id": "6f9b1984-c588-49cc-b2ca-76154c2218bc", "content": "Currency markets have reacted positively to news that Malcolm Turnbull has ousted Tony Abbott to become Australia's 29th prime minister. Currency markets have reacted positively to news that Malcolm Turnbull has ousted Tony Abbott to become Australia's 29th prime minister. The Australian dollar rose to an overnight peak of US71.52c, its highest in more than two weeks, in the wake of the Liberal Party spill late on Monday.\n\nShortly after Mr Turnbull announced his challenge late on Monday afternoon the currency dipped to a low of US70.63c before slowly ascending after it became increasingly clear that a change in the leadership was imminent.\n\nThe Aussie had already been on the rise late last week after better than expected local employment data, and amid a sense that the currency had been oversold during the recent markets rout sparked by turmoil in Chinese equities.\n\nBut analysts said the change in leadership could provide a much-needed boost to consumer and business confidence, which in turn is likely to support economy and ultimately the Australian dollar.\n\nCiti analyst Josh Williamson said both the change in PM but also an expected change of Treasurer should be positive for financial markets.\n\n\"The market had lost faith in Joe Hockey following poorly received budgets and a perceived inability to 'read' the economy, in our view,\" Mr Williamson said in a note overnight.\n\nMr Williamson said he expected the change in prime minister to lift both business and consumer sentiment.\n\n\"We think both business and consumer sentiment readings have been adversely affected for a number of months by the lack of economic and fiscal policy direction under Tony Abbott and Joe Hockey,\" Mr Williamson said.\n\n\"Malcolm Turnbull's narrative of engaging in informed economic debate rather than catch phrases provides some hope that previously forgotten inquiries into areas that could increase economic growth, productivity and supply side reform could now receive more attention.\" The story first appeared on The Sydney Morning Herald.", "source": "Lithgow Mercury"}