{"published": "2015-09-01T15:42:54Z", "media-type": "News", "title": "Iran to target more petrochemical exports: report", "id": "947d7fbd-b068-4960-90ba-3d63d287d5af", "content": "By ANTHONY DiPAOLA Bloomberg The Americas will take the brunt of any cuts in oil production as Iran increases output once international sanctions are lifted, according to a report by A.T. Kearneys oil and gas consulting practice in Dubai. North, South and Central American oil production could fall 1.1 million bpd by 2020 because of higher costs as Irans output climbs, starting with an increase of 800,000 bpd next year, Chicago-based A.T. Kearney said in a report to be issued this week. Brent crude prices are seen trading at $45 to $65/bbl next year, according to the report. The international benchmark was trading at $52.85/bb on Tuesday. With Iran coming back on, theres the prospect this is going to be a longer-term lower price than weve seen before, Richard Forrest, A.T. Kearneys lead partner for energy, said in an interview in Dubai on Sunday. If you look at where the production comes out, its North American shale and its offshore. Iran is preparing to double output after international sanctions end, bringing as much as 1 million bpd of new supply into the market. In the US, crude production fell as New York oil prices dropped almost 50% in the past year on a glut. The US government on Monday said June production fell to 9.3 million bpd, the lowest since January. Foreign Investment Iran could boost production by as much as 800,000 bpd in 2016, said Eduard Gracia, a principal at A.T. Kearney and co-author of the report. A.T. Kearney assumes Iran can boost output by an average of 6%/year from now until 2020 as long at it attracts foreign investment to help develop its fields. That pace would put Irans output of crude and condensate at 4.955 million bpd in 2020, or an increase of about 1.5 million bbl from today, according to A.T. Kearney. Iran and six global powers reached an agreement in July that would limit the Persian Gulf countrys nuclear program in return for removing sanctions on its energy and financial industries. The restrictions cut its oil output from 3.1 million bpd in July 2012 to as low as 2.5 million bbl in May 2013, according to data compiled by Bloomberg. Profitable Fields The projected drop in production in the Americas is equivalent to a 4% decline from 27.5 million bpd now, according to A.T. Kearney, which estimates Middle East production at 26.3 million bpd. Prices by the end of the decade will allow fields with production costs of $60/bbl to $80/bbl to produce at profitable levels, according to the study. While any oversupply has some impact on price, its not going to be as dramatic as what we saw in the previous shifts, Forrest said, referring to the period when Brent fell from over $100/bbl in July 2014 to less than half that six months later. That drop was due to concern about slowing global demand, he said. Irans state-run Islamic Republic News Agency has reported production could increase by 500,000 bpd within a week after sanctions end and by 1 million bpd within a month after that. Sanctions against Irans oil industry should be lifted by late November, Oil Minister Bijan Namdar Zanganeh told state TV last month. Iran may also increase petrochemical output, creating a potential for increased exports and lower prices, Gracia said. Iran has the worlds biggest natural gas reserves, according to BP data. Petrochemicals is a way to get their gas exported in the form of another product, Gracia said.", "source": "Hydrocarbon Processing"}