{"published": "2015-09-26T13:08:18Z", "media-type": "News", "title": "Bribery scheme leader sentenced 17 hours ago", "id": "51fe99bf-7c90-4d51-b0bc-92f481ca9cbb", "content": "Robert Williamson (Photo: Advertiser file photo) \n\nRobert T. Williamson, of Lafayette, the former private investigator at the center of a bribery scheme involving the Lafayette-area district attorney’s office, was sentenced Friday to six-and-a-half years in a federal prison. \n\nHe must surrender to authorities by 2 p.m. Nov. 12. \n\nWilliamson, 67, a former Rapides Parish resident, pleaded guilty June 8 to one count each of conspiracy to commit bribery, bribery involving a program that receives federal funds and Social Security fraud. \n\nU.S. District Judge Elizabeth Foote, prior to sentencing, said Williamson was the mastermind behind the bribery scheme, convincing and bribing five others with no prior criminal activity into participating. \n\nBetween 2008 and 2012, Williamson paid three employees of the district attorney’s office to bypass the normal judicial process to quickly resolve cases for his clients. The cases involved mostly drunk driving offenses, but also drug cases and felony cases. \n\nHe also bribed workers at a nonprofit and a driver’s education business to forge documents saying his clients completed community service and driver’s ed classes when they did not. \n\nWilliamson was the subject of a 2001 Town Talk series about his disputes with law enforcement officials and insurance companies related to electrical shock injuries his wife, Sonya, suffered in 1989 at an Alexandria hotel. His wife, a Glenmora native, was left with debilitating injuries. \n\nAuthorities were suspicious about Sonya’s injuries because of numerous previous insurance claims filed by members of the Williamson family, but doctors said Sonya’s injuries were real. \n\nIn the Lafayette case, Williamson, who is not an attorney, was paid as much as $5,000 by his clients. \n\nOn Friday, when Williamson’s attorney asked for a reduced sentence, claiming there was no victim, Foote disagreed. \n\n“The victim in this matter is the public trust,” she said. “And that’s far worse than if Mr. Williamson had simply stolen money from an individual.” \n\nWilliamson addressed the court, saying, “I apologize to the community and the court ... I am greatly sorry for what I caused.” \n\nThomas Damico, Williamson’s attorney, argued unsuccessfully for a lesser sentence, saying the scheme would not have happened without the cooperation of Barna Haynes, the long-time secretary to former district attorney Mike Harson. Haynes, 61, is serving 18 months in a federal prison after pleading guilty for her role in the conspiracy. \n\nThe plot worked this way. Williamson paid Haynes to transfer cases from city court to district court, to fill out documents and to schedule his clients to appear before a judge outside of the normal court process. \n\nGreg Williams, the assistant district attorney who handled all of those cases, also accepted gifts and cash from Williamson. His secretary, Denease Curry, knew of the payments and failed to report the bribery. \n\nWilliamson also paid Sandra Degeyter, an Acadiana Outreach Center employee, in cash and in-kind contributions to falsify certificates stating his clients completed court-ordered community service work when they had not. After Degeyter left the nonprofit, she allegedly split the bribes with Elaine Crump, who still worked at the outreach center. \n\nWilliamson also paid Lawrence Bergeron of Safety Premiere Training to create false and fraudulent driver safety certificates.The federal government did not pursue charges against Bergeron. \n\nWith the bribery system in place, Williamson’s clients were able to appear before a judge faster than through the normal court process and present “proof” that they completed the usual court-ordered community service work. As a result, they would never lose their driver’s license and their charge would be wiped off their record faster thanks to Haynes. \n\nThe Social Security fraud charge against Williamson is because he received $77,677 in Social Security payments while claiming he had no income even though he was receiving income from the bribery scheme, federal officials claim. \n\nHaynes pleaded guilty in July to one count of conspiracy to commit bribery. She is serving 18 months in the Carswell Federal Medical Facility, a medium-security prison/medical facility in Fort Worth, Texas. \n\nWilliams, 47, and Degeyter, 64, both pleaded guilty to one count of conspiracy to commit bribery and were sentenced to two years probation and six months of home confinement. \n\nCurry, 49, and Crump, 62, both pleaded guilty to one count of misprision of a felony for failing to report the bribes. They were sentenced to two years probation and 200 hours of community service. \n\nThe case was investigated by the FBI and Social Security Office of Inspector General. Assistant U.S. Attorneys John Luke Waller and Robert Abendroth prosecuted the case. \n\nRead or Share this story: http://www.thetowntalk.com/story/news/2015/09/25/man-center-bribery-scheme-das-office-sentenced/728179", "source": "Daily Town Talk"}