{"published": "2015-09-01T18:37:00Z", "media-type": "News", "title": "National Preparedness Month Kicks Off on September 1", "id": "14723c4b-6c32-460d-a5e3-55218567691d", "content": "WASHINGTON , Sept. 1, 2015 /PRNewswire/ -- Disasters like floods, hurricanes, wildfires, tornadoes, and earthquakes are a harsh and frequent reality for much of the country. According to a recent survey conducted by the Federal Emergency Management Agency (FEMA), progress has been made; however, fewer than half of Americans have discussed and developed an emergency plan with their household. \n\nExperience the interactive Multimedia News Release here: http://www.multivu.com/players/English/7608151-fema-ad-council-emergency-preparedness/ \n   \nToday, FEMA and the Ad Council launched a new series of public service announcements (PSAs) to encourage families to develop an emergency communication plan before a disaster occurs. An extension of the national Ready campaign, the new PSAs launch in conjunction with the 12 th annual National Preparedness Month, serving as a reminder to take action to prepare for the types of hazards that could impact where you live, work, and vacation. \n\n\"The last thing you want to be worried about during a disaster is how to communicate with your family members,\" said Administrator Craig Fugate . \"Have that conversation today. It doesn't cost a thing.\" \n\nThe new campaign includes English and Spanish-language TV, radio, outdoor, print and digital PSAs. Created pro bono by Chicago -based advertising agency Schafer Condon Carter , the PSAs illustrate the importance of having a family plan in the event of an emergency by showing real emergency moments and asking the question, \"when is the right time to prepare?\" The viewer is encouraged to develop a family emergency communication plan through the clear message, \"Don't wait. Communicate.\" The PSAs direct audiences to Ready.gov/communicate for tools and resources to help develop and practice a family emergency communication plan. \n\n\"Through the Ready campaign, we've made a lot of progress educating and empowering Americans to prepare for all types of emergencies but there are still so many families that don't have a plan, \" said Lisa Sherman , President and CEO of the Ad Council. \"Having these conversations is really important and can have a big impact on our families' safety in the event of a disaster.\" \n\n\"SCC is honored to work with the Ad Council and FEMA on the Ready campaign,\" said David Selby , President and Managing Partner of SCC. \"This new campaign provides powerful imagery and a critically important call-to-action that we hope will cause individuals and families to pay attention, lean in and, ultimately, take action.\" \n\nLocalized television and radio PSAs were created and will be available for 27 states, Guam , the U.S. Virgin Islands , Washington D.C. , and New York City as part of an ongoing collaboration with state and local emergency management partners. These PSAs drive audiences to their local organization's website for resources and information pertinent to their area. \n\nAs an extension of the national Ready campaign, versions of the PSAs were created for Ready New York , a local initiative that was launched in partnership with the New York City Office of Emergency Management in 2009. Tailoring the message to the unique challenges faced by people living in New York City , audiences are directed to call 311 or visit NYC.gov/readyny, where they can find preparedness resources, including 11 Ready New York guides in 13 languages and audio format. \n\nManaged and sponsored by the Ready campaign, National Preparedness Month is designed to raise awareness and encourage Americans to take steps to prepare for emergencies in their homes, schools, organizations, businesses, and places of worship. National Preparedness Month is an opportunity to share emergency preparedness information and host activities across the country to help Americans understand what it truly means to be ready. \n\nNational Preparedness Month Weekly Themes \nWeek 1 (September 1–5) Flood  Week 2 (September 6–12) Wildfire  Week 3 (September 13–19) Hurricane  Week 4 (September 20–26) Power Outage  Week 5 (September 27–30) Lead up to  National PrepareAthon! Day , September 30 \nNational Preparedness Month culminates with National PrepareAthon! Day on September 30 when cities and counties across the country are planning community-wide events bringing together schools, their business community, government, faith leaders, hospitals, individuals and families, and others to participate in community-wide preparedness drills and activities for hazards that are relevant to their area. \n\nSince the launch in 2003, the Ready Campaign has received nearly $1.2 billion in donated media. The Campaign helps to generate more than 92 million unique visitors to Ready.gov. The Ad Council is distributing the new PSAs to media outlets nationwide this week, and the PSAs will run in donated time and space. \n\nFor more information visit Ready.gov/September or follow the campaign on Facebook and Twitter . For more information about National PrepareAthon! Day, visit www.ready.gov/prepare . \n\nFederal Emergency Management Agency \nFEMA's mission is to support our citizens and first responders to ensure that as a nation we work together to build, sustain, and improve our capability to prepare for, protect against, respond to, recover from, and mitigate all hazards. \n\nThe Ad Council \nThe Ad Council is a private, non-profit organization with a rich history of marshaling volunteer talent from the advertising and media industries to deliver critical messages to the American public. Having produced literally thousands of PSA campaigns addressing the most pressing social issues of the day, the Ad Council has affected, and continues to affect, tremendous positive change by raising awareness, inspiring action and saving lives. To learn more about the Ad Council and its campaigns, visit www.adcouncil.org , like us on Facebook , follow us on Twitter or view our PSAs on YouTube . \n\nSchafer Condon Carter (SCC) \nSchafer Condon Carter (SCC) is a fiercely independent creative agency that leverages its proprietary BrandIgnition® process to deliver seamless, integrated brand messaging across an infinite set of consumer touch points to its clients. A simple mission drives the agency's entrepreneurial spirit and results-driven culture: \"Think Again.\" The agency, headquartered in Chicago's historic West Loop neighborhood, currently has a full-time staff of over 100. The agency serves \"blue chip\" clients in food and packaged goods, financial services, apparel, wellness, professional sports, professional service, construction and manufacturing industries. The agency's wholly-owned infrastructure of assets include SCC|Digital, SCC|Public Relations, SCC|HD Production, SCC|Studio and SCC|Ventures. To learn more about SCC, visit  http://www.schafercondoncarter.com/ . \n\nDownload Assets: \nDon't Wait. TV PSA :60 \nDon't Wait. Print PSA \nDon't Wait. Radio PSA :60    \n\nCreative Credits \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/national-preparedness-month-kicks-off-on-september-1-300136256.html \n\nSOURCE  Ad Council", "source": "U-T San Diego"}