{"published": "2015-09-24T17:23:39Z", "media-type": "Blog", "title": "Detroit's Atwater Brewery bringing beer garden to The Rowe in Grand Rapids", "id": "0d11c264-1345-48c6-b73f-3715f44aae1a", "content": "GRAND RAPIDS, MI – Detroit's Atwater Brewery has announced plans to open a beer garden and taphouse downtown at The Rowe. The 6,000 square-foot space will feature 40 taps, indoor and outdoor seating, a full kitchen and a 500-barrel production facility brewing beers specific to the location. It will occupy ground-floor retail space at CWD Real Estate's hotel-turned-housing project at the corner of Michigan Street and Monroe Avenue NW. Although the complete budget has yet to be finalized, Atwater president Mark Rieth called it \"a significant project, north of a million\" dollars. The brewery will employ more than 40 workers, and is slated to open in spring, 2016, coinciding with the completion of the $24 million Rowe building rehab. A road rally from Detroit to Grand Rapids is being planned to celebrate the opening and to raise money for charity, according to Rieth. Talks on the project began six months ago, and the architectural design is already underway, Rieth said. CWD managing partner Sam Cummings courted Atwater to fill the location. The Rowe's 92-year history and the opportunity for an open-air \"biergarten\" were key components in drawing the brewery to the prime downtown spot. Rieth said he prefers to repurpose locations that have a few ghosts – a building constructed in 1919 houses Atwater's Detroit headquarters, and the brewery rehabbed a 1936 Grosse Pointe church for the Atwater at the Park, a satellite taphouse and kitchen. The concept for the Grand Rapids brewery is modeled after the Grosse Pointe biergarten, which is being used as a template for similar spots across the country in coming years. \"We took that successful project, and said 'Let's do a few more of these,'\" Rieth said. \"So where do you go? We wanted to keep it in Michigan, to start. Why not Grand Rapids, the second largest city in Michigan? \"(Grosse Pointe) had such a positive impact for us, acting as a test kitchen to brew one-off styles, some of which we bring into production,\" he said. \"It also affects the local side, which is great.\" In addition to the exclusive brews, the Grand Rapids location will feature Atwater staples such as Detroit Pale Ale, Dirty Blonde and Vanilla Java Porter, as well as its Atwater-brewed ciders, wines and spirits. Although Grand Rapids continues to see an onslaught of brewery openings, Rieth isn't concerned about the biergarten's potential success, pointing at the central downtown location and the familiarity of Atwater's established brand. \"It'll support 70-plus (tenants in The Rowe) and the surrounding community. If it was a new brewery, a new brand,\" it might be a different story, he said. Atwater is one of the five biggest breweries, production-wise, in Michigan. It produced 40,000 barrels of beer in 2014, and is on pace to make 55,000 in 2015. Atwater is currently building a brewing facility in Austin, Texas to aid in West Coast distribution, and is planning another production project in the southeast U.S. The Rowe was originally a hotel upon opening in 1923. The building has been empty since 2001, when its previous occupant, the Olds Manor retirement home, shut down. Currently undergoing a \"total gut rehab,\" The Rowe will feature 77 apartments, eight condominiums and a top-floor penthouse, in addition to the street-level retail space. John Serba is film critic and entertainment reporter for MLive and The Grand Rapids Press. Email him at jserba@mlive.com or follow him on Twitter or Facebook.", "source": "Michigan News"}