{"published": "2015-09-29T19:40:25Z", "media-type": "Blog", "title": "Comcast challenges YouTube with Watchable video service", "id": "45685855-cfa4-4c15-a0a9-6ee7011c7edf", "content": "Comcast challenges YouTube with Watchable video service The cable provider's new service puts digital stars side-by-side with regular TV. by Joan E. Solsman @joan_e September 29, 2015 12:40 PM PDT Updated: September 29, 2015 12:55 PM PDT Comcast launched its first streaming service that anybody can access. Reuters Cable company Comcast on Tuesday launched Watchable, a service that delivers short videos to living-room TVs, mobile devices and a Web player.\nThe country's biggest traditional pay-TV provider will put digital shows often associated with online video sites like Google's YouTube, including Vice, The Young Turks, Smosh, Day of Gluttony, and Clevver, on the same video platform as regular live news and sports. But you don't have to pay to watch it -- Watchable runs ads to earn revenue, rather than charging outright.\nAs consumers increasingly turn online for entertainment, Comcast is hoping Watchable will help keep its services relevant. Adding short videos from digital-savvy partners like AwesomenessTV, the Onion and BuzzFeed means customers will be able to flip from a traditional TV show to these short-form clips as part of a regular pay-TV package. Comcast hopes that Watchable will help it retain would-be cord-cutters -- people who drop pay-TV for online alternatives -- and that it will appeal to young, potential customers who have found their favorite performers online.\nPhiladelphia-based Comcast said the launch was a beta version of Watchable, which means the company is still experimenting with it. The company said it would eventually add the ability to create more personalized content and share videos with others. Watchale is available on Apple mobile devices, on the web at watchable.com and for people with a Comcast pay-TV X1 subscription.\nComcast listed partners such as digital content players such as AwesomenessTV, Buzzfeed, and Tastemade, as well as about 30 others.\nThe roll out comes on the heels of another video service launched by a traditional pay-TV provider: Go90 by Verizon. Unlike Watchable, Go90 will only be available on mobile devices when it launches later this week. Tags: Digital Media Comcast Previous Story Radiation-poisoned Spock: Most depressing Christmas ornament ever Next Story Comcast challenges YouTube with Watchable video service About the author Joan E. Solsman Joan E. Solsman is a senior writer for CNET focused on digital media. She previously wrote for Dow Jones Newswires and the... See full bio Comments More From CNET", "source": "CNET News"}