{"published": "2015-09-26T08:15:15Z", "media-type": "News", "title": "Speech by SLW at Christian Action 30th Anniversary Celebration Ceremony (English only)", "id": "5be29f85-2d53-4dc7-9573-f301796c4149", "content": "MIL OSI – \n \nSource: Hong Kong Government special administrative region – Press Release/Statement: \n \nHeadline: Speech by SLW at Christian Action 30th Anniversary Celebration Ceremony (English only) \n*************************************************** \n \n\r \n     Following is the speech by the Secretary for Labour and Welfare, Mr Matthew Cheung Kin-chung, at the Christian Action 30th Anniversary Celebration Ceremony today (September 26): \n \nMr Tony Turner (Board Member of Christian Action), Mr Tim Smith (Board Member of Christian Action), Mrs Cheung-Ang Siew Mei, (Executive Director of Christian Action), Dr Bunny Chan (Chairman of Kwun Tong District Council), Mr Yu Pang-chun (Vice-Chairman of Employee Retraining Board), Ms Carol Yip (Director of Social Welfare), distinguished guests, ladies and gentlemen, \n \n     It gives me great pleasure to join this ceremony to celebrate the 30th Anniversary of Christian Action. \n \n     There is no better way to mark such an important occasion than with a photographic exhibition which showcases portraits and stories of your service users over the years. As the saying goes, a picture tells a story. The story of Christian Action is a touching and impressive one. It tells of how a welfare non-governmental organisation has successfully moved with the times and developed an array of quality services in keeping with Hong Kong’s fast changing socio-economic landscape. \n \n     Let me begin by paying warm tribute to Christian Action, which I have known since its inception. Established in 1985, Christian Action, previously known as Hong Kong Christian Aid to Refugees, has been providing a wide range of quality services for needy groups. These include new arrivals from the Mainland, ethnic minorities, low-income families, disadvantaged youths, refugees and foreign domestic helpers residing in Hong Kong, as well as orphans living in Qinghai on the Mainland. In short, Christian Action serves the unserved, marginalised, disadvantaged, displaced, abandoned and underprivileged. \n \n     Over the past 30 years, Christian Action has worked closely with the Hong Kong Special Administrative Region (SAR) Government on the welfare and labour fronts and has made a sterling contribution. I greatly value our partnership and am most appreciative of Christian Action’s unfailing support, unstinting co-operation and strong sense of commitment and professionalism. Christian Action is a key player under the Partnership Fund for the Disadvantaged and the Child Development Fund. It is also a major training body for the Employees Retraining Board (ERB). In fact, Christian Action was among the pioneering training bodies when the ERB came into existence. \n \n     To promote a tripartite partnership among the business sector, non-governmental organisations (NGOs) and the Government in helping the needy, the Government set up the $200 million Partnership Fund for the Disadvantaged in 2005 under the Social Welfare Department. We have injected an additional $400 million into the Fund this year. Of this, $200 million is set aside for encouraging collaboration amongst the business sector, NGOs and schools to launch after-school learning and support projects and facilitate the whole-person development of students from grassroots families. We expect 20 000 primary and secondary students to benefit from the scheme in the current school year. The scheme will also free up several thousand mothers to join the labour force. \n \n     Christian Action has successfully completed seven projects under the Partnership Fund for the Disadvantaged so far, with the eighth still in full swing. These projects target new arrival families, low-income families, single-parent families and ethnic minorities with the aim of preventing social exclusion. \n \n     To enhance the longer-term development of disadvantaged children and reduce inter-generational poverty, the $300-million Child Development Fund (CDF) was set up by the Labour and Welfare Bureau in 2008. Over the years, CDF projects have benefitted some 7 000 children, including ethnic minorities, children with disabilities and those living in tiny cubicle apartments or sub-divided units. To boost the Fund’s capacity and ensure its sustainability, the Government has injected an additional $300 million into the Fund and this will benefit another 9 700 new participants. \n \n     I am most grateful for the strong support that Christian Action has rendered the Child Development Fund since its launch. Christian Action has so far operated 11 projects in Kwun Tong, Sai Kung and Yuen Long, benefitting altogether 1 235 children. Through the three major project components, namely personal development plans, the mentorship programme and targeted savings, the Fund encourages children to plan for their future and to develop an asset-building habit. \n \n     Since 2001, Christian Action has also been actively assisting the Social Welfare Department in implementing employment assistance programmes to help able-bodied Comprehensive Social Security Assistance Scheme recipients overcome work barriers, enhance their employability, secure employment and become self-reliant. \n \n     On the manpower training side, Christian Action is a major partner of ERB in providing quality training courses and services, particularly for social groups with special needs, such as mature persons, new arrivals and ethnic minorities. Since August 1994 when it was made an ERB training body, Christian Action has served about 220 000 trainees. This accounts for about 12 per cent of the total number of ERB trainees. Over the years, Christian Action has received various awards from ERB in recognition of its good work and dedication. \n \n     What Christian Action is doing fits in perfectly well with the objectives and commitment of the Hong Kong SAR Government in building a caring, compassionate and cohesive society. Indeed, poverty alleviation and enhancement of elderly care rank highly on the current-term Governments policy agenda. Total recurrent spending on social welfare alone in this financial year (2015-16) is estimated to reach $59.7 billion, representing a significant 18.4 per cent of overall Government recurrent expenditure, just after education (22 per cent) and ahead of medical and health services (16.4 per cent). This speaks volumes about the importance that the Government attaches to helping the vulnerable and disadvantaged, as well as to addressing the needs of a fast ageing community. \n \n     On its 30th anniversary celebration, I offer my warmest congratulations to Christian Action and wish it continued success in the many years ahead. Thank you. \n \n\r \nEnds/Saturday, September 26, 2015 \nIssued at HKT 15:12 \n \nNNNN \n \n— \n \n© Multimedia Investments Ltd Terms of Use/Disclaimer.", "source": "Foreign Affairs.co.nz"}