{"published": "2015-09-10T23:41:45Z", "media-type": "News", "title": "14 years after 9/11, secrecy shrouds many records", "id": "c72331b3-76a0-4eb1-b9cc-5b9571ef03af", "content": "Seven weeks after the end of the massive cleanup at Ground Zero in lower Manhattan in 2002, a legal investigator for the families of 9/11 victims requested a copy of an arrest warrant issued by Interpol for fugitive al Qaeda leader Osama bin Laden. \n\nHere’s the reply she got from the Justice Department’s Interpol-U.S. National Central Bureau: \n\n“Release of information about a living person without that person’s consent generally constitutes an unwarranted invasion of personal privacy in violation of the Freedom of Information Act. You must submit an authorization [privacy waiver] signed by Usama bin Laden, consenting to the USNCB’s release to you of any record that it may have pertaining to him.” \n\nThe Justice Department’s assertion of privacy rights for bin Laden is a small rock in the wall of official secrecy that continues to hide 9/11 documents held by the FBI, CIA and other government entities on the 14th anniversary of the terrorist attacks. \n\nLately, the public focus has been on the 28 blanked-out pages in Congress’s 2002 Joint Inquiry into the attacks regarding “foreign support for the hijackers” –- read Saudi Arabia. The pages, withheld by President George W. Bush and kept hidden by President Obama, have been the subject of recent stories in The New Yorker, The New York Times and other publications. On Capitol Hill, pending bills in the House and Senate seek to open those pages to the public. \n\nYet hundreds, likely thousands, of significant records about what the 9/11 Commission called “a day of unprecedented shock and suffering in the history of the United States” remain off limits in whole or significant part. The result: an incomplete public understanding of events behind the attacks, and a denial of evidence to 9/11 victims still seeking a measure of justice in the courts. \n‘Let our people know’ \n“Thousands of pages, photographs and tangible evidence have been withheld, much of which from my personal knowledge has nothing to do with keeping America safer but rather protects incompetence or relations with perfidious foreign governments,” said former Sen. Bob Graham, the Florida Democrat who co-chaired Congress’s Joint Inquiry into the attacks and helped write the 28 pages. \n\n“The United States has paid a high price in justice to injured Americans, national security and confidence in government by this secrecy. It is time to let our people know,” Graham said. \n\nMany hidden 9/11 records are years, even decades old. But some like the classified files and memoranda of the FBI’s secretive 9/11 Review Commission were produced in 2014 and 2015. \n\nThe Review Commission, charged with investigating the FBI’s performance and evaluating new information about the attacks, went out of business in March after issuing a 127-page report. The FBI has yet to release any other commission material –- transcripts, memos and the like –- sought in a Freedom of Information request filed by FloridaBulldog.org in April. \n\nPerhaps the largest untapped source of information about events leading up to 9/11 is the raw intelligence files about al Qaeda and terrorist threats gathered by the eavesdropping National Security Agency. \n\nIn his 2008 book The Commission: The Uncensored History of the 9/11 Investigation , former New York Times reporter Philip Shenon said commission investigators neglected to examine that “gold mine” of NSA 9/11 data until days before the commission’s final report was due. \n\nFound in that limited time, and noted in the commission’s report, was “strong evidence that Iran facilitated the transit of al-Qaeda members into and out of Afghanistan before 9/11, and that some of these were future 9/11 hijackers…We believe this topic requires future investigation by the U.S. government.” \n\n“There’s a massive amount of information,” Shenon said in an interview last week. “That’s always been on the top of my list of documents I’d like to see.” \n\nSuppressed records are plentiful and easy to locate in the reports of the Joint Inquiry and the footnotes of the follow-up 9/11 Commission . Aside from the notorious 28 pages, the Joint Inquiry’s report contains numerous other blanked-out parts, including six heavily censored pages regarding covert action ordered against bin Laden by President Clinton. \n\nThe National Archives manages the 9/11 Commission’s files and maintains an online list of about 1,200 fact-finding interviews, nearly 200 of which the public cannot access because they are classified. Hundreds more released documents have redactions ranging from minimal to heavy. \n\n911datasets.org , a group that makes available raw information obtained by 9/11 researchers, says the National Archives has released about a third of the commission’s files. Many records within those files are nevertheless withheld citing national security. \n\nThe Saudi role \n\nThe 9/11 Commission reported finding “no evidence that the Saudi government as an institution or senior Saudi officials individually” had funded al Qaeda. The official veil of secrecy over its records, however, continues to obscure how it reached that controversial conclusion. \n\nHidden from public view are commission interviews with White House staff, FBI agents, CIA employees and officials with other agencies including the Defense Intelligence Agency, State Department, Treasury Department and Federal Aviation Administration. Also secret: interviews with government officials from Great Britain, Canada, Afghanistan and Saudi Arabia. \n\nOne intriguing 2003 interview was with Prince Bandar bin Sultan, the Saudi ambassador to the U.S. who met with President George W. Bush and Vice President Dick Cheney at the White House two days after 15 of his countrymen helped carry out passenger jet attacks on New York and Washington. \n\nBandar’s wife, Princess Haifa, made payments to a man the Joint Inquiry identified as a “Saudi extremist and a bin Laden supporter.” The man, Osama Bassnan, also apparently had contact with 9/11 hijackers Nawaf al Hazmi and Khalid al Midhar, who were aboard American Airlines Flight 77 when it slammed into the Pentagon. \n\nTime Magazine reported that from January 1999 to May 2002 the princess made monthly payments of $2,000 to Bassnan’s wife, who was said to suffer from a severe thyroid condition. The payments totaled as much as $73,000, The New Yorker reported last year. \n\nKey documents by the CIA and the Treasury Department’s Office of Foreign Assets Control relating to terrorist financing are also under wraps. \nFinanciers \n“The wholesale redaction of any relevant detail is a problem we’ve seen across the board when we’ve asked for documents that address specific details of Saudi-based support for al Qaeda in the pre-9/11 era,” said Sean P. Carter, a victim’s attorney with Philadelphia’s Cozen O’Connor law firm. “At the end of the day this is immunizing those people from the consequences of their actions.” \n\nThe CIA took a different tack in its July 2013 response to a FOIA request by another plaintiff’s lawyer seeking intelligence reports about Saudi Arabia’s al Rajhi Bank that were cited in a Wall Street Journal  story, “U.S. Tracks Saudi Bank Favored by Extremists.” \n\nThe front-page article said CIA documents described al Rajhi Bank, which describes itself as one of the world’s largest Islamic banks, as a “conduit for extremist finance” that once obtained a visa for a money courier working for Osama bin Laden’s second-in-command, Ayman al Zawahiri. The CIA replied that it “can neither confirm nor deny the existence or nonexistence” of the requested records. \n\nCIA documents cited prominently in the 9/11 Commission Report and requested by plaintiff’s lawyers have been released in recent years, often with heavy redactions and assertions that the information was exempt by presidential directive or U.S. law. \n\nIn June, the CIA released a 10-year-old report by the agency’s Inspector General regarding criticism leveled by the Joint Inquiry. The 490-page report is riddled with redactions, including nearly all of a 29-page section titled “Issues Relating to Saudi Arabia.” A sentence that remains states that the CIA found no “reliable reporting confirming Saudi government involvement with and financial support for terrorism prior to 9/11.” \nFBI records \nThe FBI posts 72 documents about the 9/11 Commission on its website. Many contain extensive redactions and none involve allegations of Saudi financing for terrorists, the most controversial aspect of the 9/11 case. \n\nThe FBI’s sprawling 9/11 investigation, code-named PENTTBOMB, was the largest in its history. More than half of its agents worked the case, following more than half-a-million investigative leads, the FBI has said. \n\nHow many documents is that? \n\nThe FBI’s Tampa field office alone holds 80,000 classified pages in its 9/11 file, according to papers filed by the Justice Department in ongoing Freedom of Information litigation brought by FloridaBulldog.org. \n\nThe records include details of a once-secret FBI investigation of a Saudi family with apparent ties to the 9/11 hijackers who gained attention after they abruptly moved out of their Sarasota area home two weeks before the attacks, leaving behind their cars, clothes, furniture and other belongings. FloridaBulldog.org  working with Anthony Summers, co-author of the 9/11 history “ The Eleventh Day ,” first reported the story in 2011. \n\nFort Lauderdale U.S. District Court Judge William J. Zloch is currently reviewing those 80,000 pages for possible public release. \n\nFlorida Bulldog is a not-for-profit news organization created to provide investigative reporting in the public interest. Contributions are tax-deductible. www.floridabulldog.org", "source": "Miami Herald"}