{"published": "2015-09-10T01:19:40Z", "media-type": "Blog", "title": "Ramblings:  Reader Reaction", "id": "22c7c113-9bfd-4181-8a1e-6dd5373370a3", "content": "The cyber mailman has been busy delivering your questions and comments so let’s get right to it.  Last week, I wrote about the death of long-time Philly Show promoter Bob Schmierer and my memories of when this incredible show was held at the George Washington Motor Lodge in Willow Grove, PA.  Rock Hoffman of Glenside, PA shared his memories—and an update on the site where the hotel once stood: The site of the old George Washington Motor Lodge is now mostly a Home Depot although that field you wrote has never been developed. I’m sure you remember that the field usually served as overflow parking for the show. Your story brought back many memories of attending shows there. The first show I ever went to was in 1977 as a seven-year-old. My first purchase was a 1977 Jim Kaat to complete my Phillies team set. I bought it off of a husband and wife (I think his name was Frank). Their table was right there as soon as you made the right after paying. They were always in that same spot. I remember not really understanding why they had a pile of Jim Kaats and I could never get one from packs.  Red Merchant, Boston Braves fan and from San  Antonio reminded us of his favorite early 1950s Braves and the Lew Burdette error card, which shows him not only pitching with the wrong hand but spells his name “Lou” instead of “Lew”.   I wrote about it last year. So, as I’m going through memories of my past life, I open up this trunk that has been sitting for ages.  Inside, my baseball card collection of basically Boston/Milwaukee Braves from before I enter the Air Force in ‘62.  Warren Spahn, Bob Buhl, Johnny Antonelli, George Crowe – they’re  all in there.  Then you look at the (1959 Topps) Burdette card, and then you go looking on the internet, and it leads me to you!  A question:  Do we know just how many of these were printed?  Was the entire collection run, with no one noticing that the spelling, as well as the picture were wrong?  Thanks for your time.  Red, unless we find the Topps archives and the paperwork is complete we’ll never how many of each card was produced but we can say the “Lefty” Burdette card was never corrected but is still popular with collectors and a great conversation piece. Burdette was sent to the Braves late in the 1951 season by the Yankees for Johnny Sain. While Sain was not a front line starter for the Yankees he did help them the next three World Series while Burdette went on to win over 200 games in the rest of his career, most of them for the Braves. Collector George O’Neal wrote us about this year’s Topps Chrome and something a lot of collectors are experiencing, which I noted in my box break/review last week: I’m having a heck of a time telling which card is a refractor.  Is there a trick?  I’ve been collecting Chrome for about five years now, and it wasn’t really ever this hard to tell (and it helped with the ‘refractor’ tag on the back of an actual card too).  George, the way I found out was I had two Paul Konerko cards and was able to hold them to the light to determine the refractor. We mentioned in our review how we wished Topps would have labeled the refractors. We noticed in the Bowman Chrome preview information  thatall refractor cards appear to be serial numbered. To me, even if there is no refractor labeling, cards with serial numbers are sufficient to contrast those to base cards. Rick Friedman wrote us in response to my column about the 20th anniversary of Cal Ripken breaking Lou Gehrig’s record and his commitment to sign autographs for fans after each game. I have been reading your articles for some time, and thank you for doing them. They bring a little joy to my stressful business day, while I take a 10 minute ” vacation” and look at the various links.  Many of the links have been costly….turning me on to new auction site, only to find an item I just cannot live without.  Anyway, your recent article about Cal Ripken signing  autographs reminds me of Pete Rose.  When I was 14-16 years old I was a “lobby rat” and “stadium rat”, getting all the players’ autographs from that era (late 1960s and early 1970s) but one who impressed me was Rose, who would stand in the street and sign autographs for anyone there and talk to them with respect.  I would be amazed that as the Reds team would check into a hotel at midnight, all the players ran into their rooms but the star of the team, who would stand in the street or lobby, and sign autographs for what seemed forever ( maybe 15 -30 minutes).  He loved being Pete Rose. I got hooked on collecting HOF memorabilia after a few trips to Cooperstown and created in the last six years my own mini Hall of Fame and now have about 600 museum artifacts.  Bats, gloves, signed ball, uniforms, caps, photos and now have a very serious collection.  I thought I had a great collection until I  visited Gary Cypres’ LA Sports Museum last year which put me in my place.  He owns EVERTHING  from the Yankees and Dodgers  in a building about two blocks long. It’s interesting to hear collectors’ experiences with various players, especially those memories from before autographs were a commodity.  Despite his issues over the years, Pete still has an enormous fan base and probably won a lot of them over during those signing sessions so many years ago.  And yes, Gary Cypres’ collection is a national treasure.   We also received a great email from an old dealer comrade of mine, Glenn Peddicord, from New Jersey who enjoyed a column I wrote awhile back about the 1967 Topps Brooks Robinson.   I now live in Indiana, but I still plan to move back to my hometown of Baltimore in the next couple of years.  I am still in the hobby, but only as a collector. I have been putting together 1950s & 1960s Topps and Bowman sets, which is something I should have done back in the 1980s.  Oh well. It was great to hear from Glenn. When I was working in Mike Gordon’s shop back in the late 1980s, the store ordered 350 cases of 1989 Fleer factory sets since that was the only item they offered directly to the hobby. When the truck delivered them, it was Glenn who helped carry all of  those sets from the truck into the store– and some into the basement. Now, in those days, one could have just made a couple of dollars on each set by offering them to the other dealers in the area but not every dealer was comfortable wholesaling to others  As it developed, Ken Griffey Jr. really took off the next year and Mike did fine selling the sets himself. But it always is a good discussion which persists to this day. Some dealers are fine working with their fellow dealers while others are retail to the public only. Even today, those decisions are up to the individual dealer.", "source": "Sports Collectors Daily"}