{"published": "2015-09-28T17:39:06Z", "media-type": "Blog", "title": "Preparing for a Career You’ll Love (while you’re in high school)", "id": "67a26d1f-fde6-4433-8c0e-f8a2d1a032b8", "content": "By Kristin Barker, CSU Continuing Education Most people need to put some time into research and preparation before they’re ready to select a career track, and this planning should begin long before it’s time to start a career. High school is a great time to begin thinking about careers as students prepare for college and beyond. Deciding on a career path that makes sense for you may include investing in a focused certification or other training. Taking technical courses during high school or learning something new at Columbus State University, Continuing Education can be good options for students. Selecting the right senior project can help too. Knowing what type of career preparation you need begins with thinking about what type of career you want. If you’re a student, you’ve likely been asked many times what you want to do when you “grow up”. High school is the optimal time to begin making some career decisions and working towards making that desired career achievable. Planning for a senior project can give you the perfect opportunity to begin or continue this research. Whether you’re thinking formally or informally about the best career path for you, it can help to keep the following ideas in mind. Learn about  yourself: Understanding what you enjoy—and what you’re good at—is the first step in exploring careers. If you don’t know what you want to do, ask yourself, “What would I like to learn about?” Once you answer this question, it’s easier to identify potential careers that you will enjoy. It is also helpful to identify subjects and tasks that you do not enjoy. Consider creating a running list of “what I love” vs. “what I dislike,” and fill in the columns as you are exposed to new subjects. Identify possible careers: Now that you’re thinking about the subjects and activities you most enjoy, begin looking for careers that will put those interests to use.  Look for adults who can give you clear guidance. Mentors, counselors, teachers and parents can help point you in the direction of occupations that match your interests and skills. Do your research and get experience: After identifying possible occupations, you’ll want to learn more about them. You can use resources like the courses in this catalog, career-day programs, internships, summer jobs, mentoring, and volunteer opportunities to learn more about your career interest. Activities like these can help you narrow your interests to include those that inspire you most. Finally, keep your plans flexible. Everyone’s career path is different, and there is no “right” way to start a career. Whatever path you choose, remember that you can change your mind at any time, and a change in direction can be good as long as you are learning and growing along the way. You are never locked in to one career for life! For more information on courses available through Columbus State University, Continuing Education, call 706-507-8070 or visit csucontinuinged.com.", "source": "Muscogee Moms"}