{"published": "2015-09-15T22:26:01Z", "media-type": "News", "title": "Syrian refugee tells of heartache and fear", "id": "bd02836c-ed1d-457a-a982-a0e1d032c3af", "content": "NSW: A Syrian refugee has opened up about the fear that forced him to leave his home country. A Syrian refugee has opened up about the fear that forced him to leave his home country. Muhammad Hussain, who now lives in Griffith with fellow refugee Zahid Hussain, recounted the many horrors he saw in his home country.\n\n“(It’s) very dangerous (in Syria), every morning, every afternoon, every night, killing,” Muhammad said. “You sleep and when you wake up you look at the road at all the killing.”\n\nAfter leaving Syria, Muhammad’s house was torched by insurgents.\n\nMuhammad said there were mass murders in towns where in excess of 300 people were put into a single grave.\n\nHe has not heard from his father in four years but holds onto hope that he is alive.\n\n“The first time I go to Pakistan because my father tell me ‘you go because I’m scared (for your safety). You go to Pakistan, look around Pakistan and see if you can live (there)’ but after this I come (to Australia),” Muhammad said.\n\n“I was born in Syria, my father lived there for 35, 40 years. For four years, I don't know where he is.”\n\nMuhammad fled Syria to Pakistan in 2012 before he came to Australia in October the same year.\n\nHis wife, daughter, brother and sisters still reside in Pakistan. Muhammad’s daughter was just seven months old when he left his family.\n\nHe is able to contact his family on the phone but hasn't seen anyone since he has been in Australia.\n\nHe hopes one day he will be able to visit neighbouring countries of Pakistan and Syria to visit his family.\n\nOne of his biggest fears is his daughter rejecting him as her father after living apart for so long.\n\n“I only stay home, go outside, go back, it’s no life,” Muhammad said. “Mentally, every night it’s tough. When I stay here, I think about my family.\n\n“My daughter when I left (Syria) was seven months old, now she’s four. When I talk with her she does not talk with me. We talk very little, hi, how are you, that’s all.”\n\nAlong with his family, Muhammad left behind a house and a business. He said he is stuck in limbo – not being able to work or study – and struggles to support his family.\n\nHe wants to see the government provide more support for refugees.\n\nThe Area News, Griffith", "source": "Moree Champion"}