{"published": "2015-09-25T18:12:43Z", "media-type": "News", "title": "Lions roar, hyenas laugh and giraffes HUM: Graceful giant of the African grasslands spend evenings humming to each other", "id": "b7015040-4a10-4ee7-9047-2f7e6fe53a4c", "content": "Biologists believe the hums may be a way of staying in touch with the herd Giraffes had previously been thought to simply produce snorting noises But analysis of 1,000 hours of recordings at three zoos discovered a weird low frequency humming noise was produced by the animals at night They seemed to produce the noise at specific times during the night   \nWith their unusually long necks and stilt-like legs making them the tallest living animal on the planet, they are one of the most easily recognisable creatures on the African savannah. \n\nHowever, unlike the other iconic animals of Africa, most people would struggle to pinpoint the sound produced by a giraffe. \n\nBut now scientists have discovered the graceful creatures actually hum to each other during the night. \n   \nGiraffes (pictured) have been found to produce a low-frequency hum during the night that is the first scientific evidence of complex sounds the social animals produce to communicate with each other. Previously the animals were thought to use a collection of basic snorts and blowing noises \n\nPreviously the animals were thought to only use a collection of basic snorts or blowing noises to express themselves. \n \nHowever, after collecting more than 1,000 hours of sound recordings from three zoos, researchers found giraffes create a weird low-frequency humming noise. \n  THE SECRET OF GIRAFFE'S SHINS     \nScientists have long puzzled over how the spindly long legs of giraffe's , How do the spindly legs of a giraffe support its huge weight? \n\nIt's something that has puzzled scientists, but they may now have uncovered the answer. \n\nResearchers at the Royal Veterinary College in London have identified a highly specialised ligament structure that is thought to prevent giraffes' legs from collapsing under the immense weight of the animal. \n\nIn giraffes, the equivalents to our metatarsal bone (in the foot) and metacarpal bone (in the hand) are extremely elongated, accounting for roughly half the leg length.  \n\nA distinct groove runs along the length of these bones, housing a structure called the suspensory ligament. \n\nThis structure is found in other large animals, such as horses - which are well known for their ability to sleep whilst standing - but this is the first time that it has been studied in giraffes. \n\nThe researchers found this arrangement solves the mystery of how the giraffes' spindly legs can support its weight. \n\nAs the suspensory ligament is elastic tissue, and not muscle, it cannot generate force itself so can only offer passive support. \n\nThis means that giraffes can support their weight without actively engaging as much muscle, thereby reducing fatigue.  \n  \nDr Angela Stöger-Horwath, a biologist at the University of Vienna in Austria, said the hums were often a rich combination of notes and varied in length. \n\nHowever, Dr Stöger-Horwath and her team have been left baffled by why the animals produce this noise. \n\nWriting in the journal BMC Research Notes , they said: 'These results show that giraffes do produce vocalizations, which, based on their acoustic structure, might have the potential to function as communicative signals to convey information about the physical and motivational attributes of the caller. \n\n'Up to now the only scientifically documented giraffe vocalizations are atonal snorts or bursts through the nostrils. \n\n'One reason for this is that, compared to other social-living mammals, giraffes seem very taciturn. \n\n'Since it was not possible to determine the calling individual, we are currently unable to prove that this sound is indeed used for communication or to give information about the behavioural context and prospective information content.' \n\nHowever, the team said the hums tended to occur at around the same time each night. \n\nAmong giraffes kept at Copenhagen Zoo, where a pregnant cow was separated from her herd, she began humming around two hours before sunrise. \n\nAt Vienna Zoo, where the giraffe bull was separate from the rest and Berlin Tierpark, where each giraffe was kept in separate stalls, the hums occurred in the middle of the night. \n\nDr Stöger-Horwath and her colleagues said: 'These patterns might provide suggestive hints that in giraffe communication the 'hum' might function as a contact call, for example, to re-establish contact with herd mates.' \n   \nUnlike other social animals like elephant and lions, scientists have struggled to unpick how giraffes (pictured) communicate with each other. Recent research is revealing they have a surprisingly complex social life \n\nRecent research has revealed that giraffes have a far more complex lifestyle than had previously been believed. \n\nGenetic studies have shown that six of the nine different subspecies of giraffe may actually be entirely separate species having being isolated from each other for so long. \n\nMany viewers were also shocked to see a surprisingly violent side to the animals in a BBC natural history documentary Africa, which showed two male giraffes locked in combat using their necks as giant clubs to batter their opponent to the ground. \n\nSpeaking to New Scientist , Meredith Bashaw, an expert on giraffes at the Franklin & Marshall College in Lancaster, Pennsylvania, said the animals could be using the hums as a way of letting others know where they are. \n\nHowever, she added: 'It could be passively produced – like snoring – or produced during a dream-like state – like humans talking or dogs barking in their sleep.' \n   \nThe researchers believe the sounds humming noises may be a way for the animals to stay in touch during the night. The animals used a rich combination of tones and the duration of each hum also varied. The images above show the spectrograms and waveforms of five of the hums recorded by the researchers", "source": "Mail Online UK"}