{"published": "2015-09-08T18:33:37Z", "media-type": "News", "title": "Apple fuel cell could provide weeks of power", "id": "a6df2a9b-af7e-4e47-8903-55b304db378d", "content": "The tech giant’s patent envisions mobile phones, and even laptops, that could power up for weeks on one charge \n\nIf there were a few things you could tweak about your mobile\nphone, chances are a better battery life would top the list. Sure, the things\nwe can do with these pocket-sized computers is nothing short of astounding, but\nas the quality of new devices seems to improve each year, the battery life of\neven the most advanced phones stays nearly the same. \n\nOf course Apple dove into this well-known issue and has been\nlooking into a battery that could power up a phone, or even a laptop, for weeks.\nThe tech giant’s new patent, filed in March and published on September 3,\ndescribes a “fuel cell system for a portable computing device.” \n\nApple's patent for a fuel cell system for a portable computing device. \n\nThe patent envisions a system consisting of a fuel cell,\nwhich converts fuel to electrical power, an interface to the portable computing\ndevice (which would be a smartphone or laptop), and a controller that monitors the state\nof the fuel cell while, obviously, controlling it. \n\nThough Apple has submitted plenty of patent applications in\nthe past that we have yet to see, this one seems especially broad. One example\nwould be that it mentions a variety of possible fuel sources, from lithium\nhydride and water mix to liquid hydrogen. The patent also says that it’s “extremely\nchallenging” to design portable, cost-effective hydrogen fuel cell systems. Of\ncourse, a patent filing doesn’t mean we’ll soon see a product using the\ntechnology. \n\nBut for the time being, this idea is fun, and\ninteresting, to dream about. Maybe, just maybe, we’ll see a fuel cell iPhone sooner rather than later. \n\nDo you think this type of technology will exist anytime\nsoon? Let us know your thoughts — leave a comment below.  \n\nSource: Mashable", "source": "Electronic Products"}