{"published": "2015-09-08T07:12:31Z", "media-type": "News", "title": "Denver Wins Pioneer Classic with...", "id": "397035c6-a4e7-4a50-99ae-e2e27440714f", "content": "Sept. 5, 2015  \n  VOLL v Villanova (5 SEP 15) - Highlights \n\n\nBox Score | Season Stats \n\n  DENVER - The University of Denver volleyball defeated Villanova 3-1 (20-25, 25-18, 25-18, 25-19) Saturday to win the 2015 Pioneer Classic. The Pioneers went 3-0 in the tournament held in Hamilton Gymnasium and are 5-1 on the season. \n\n\"Well, we're happy as always to get a win,\" head coach Jesse Mahoney said. \"We're struggling to come out of the gate playing well, and we didn't do that in that first set, although I thought Villanova played really well. But we righted the ship and definitely were firing on all cylinders by the final set.\" \n\nPioneer Classic MVP Cassie Baird (Indianapolis, Ind.) capped off a stellar tournament, serving a career-high four aces in the match. \n\n\"I thought I had a pretty good weekend,\" Baird said. \"I didn't expect this award at all to be honest, but I think overall the team was very good, tonight especially. We were on fire, and that is what was important.\" \n\nAll-Tournament team member Kayla Principato (Rockville Centre, N.Y.) led the Pioneers with a career-high 15 kills in their final match of the Pioneer Classic. Nola Basey (Lyons, Colo.) notched a season-high 11 kills and Ruth Okoye (Aurora, Colo.) added 10 kills to the Denver total. Blocker Sarah Schmid (Highlands Ranch, Colo.) led the team with five blocks and hit .500 in the match. \n\nSplitting the setting duties once again, Piyusha Boteju (Euless, Texas) dished out 26 assists, while Monique Domme (Colorado Springs, Colo.) recorded 19 in the match and was named to the All-Tournament team. Denver stepped up defensively, with four players earning 10 or more digs in the match. \n\nVillanova came out sharp against Denver, holding the Pioneers to a .077 hitting percentage. Principato and Schmid each recorded three kills and three blocks in the first set as the leaders for the Pioneers. The Wildcats' Claire Crutchfield hit .625 with six kills, making up the difference between the offenses; Villanova had 17 kills to Denver's 11. \n\nDenver battled back in the second set to win 25-18. The Wildcats earned the first three points, but a kill by Baird put the Pioneers up 15-14 in the set and sparked a 5-1 run by Denver. DU hit .577 in the second set, with four players earning at least three kills in the set and six fewer attacking errors than the first set. \n\nFor the second straight set, Denver won 25-18. Principato and Baird led the Pioneers with four kills apiece in the set. Baird also tallied two service aces to help the Pioneers out to their lead. Piyusha Boteju earned nine assists in the set as the offense found its stride once again. \n\nIn the final set, the Pioneers outlasted the Wildcats, capitalizing on seven attacking errors by Villanova. Basey and Principato each recorded four kills, while Baird notched two aces for the second straight set. DU closed out the set on a 6-0 run to win the fourth set 25-19. \n\nOverall, the Mahoney and Baird agree the tournament was a learning experience for the Pioneers, as the young squad is still getting used to playing together. In every match, Denver faced challenging opponents and had to fight for the victory. \n\n\"I saw that we can be really good, and we can be really average,\" Mahoney said. \"The goods outweigh the average enough for us to get wins, but to do what we want to do this season, we're going to have to get better. I was proud of my team. We fought back, in every match we had to fight back. But we've got to get better to achieve the goals we want to achieve.\" \n\n\"I'm expecting great things from the team,\" Baird said. \"Once we all get used to everything, we're going to be a very good team.\" \n\nThe Pioneers will have one more challenge tomorrow as they take on Western Michigan at 2 p.m. MT in a match televised on Altitude 2. \n\n- JOIN THE DENVER PI ONE ER  NATION  - \n\nVisit  DenverPioneers.com  for complete coverage of all 17 of Denver's NCAA Division I sports. \n\nLike  Denver Pioneers  and  DU Volleyball  on Facebook \n\nFollow  @DU_Pioneers  and  @DU_Volleyball  on Twitter \n\nPioneer Women's Volleyball Home", "source": "Denver Pioneers"}