{"published": "2015-09-12T12:38:12Z", "media-type": "News", "title": "Hajj to go ahead after Mecca crane collapse kills 107", "id": "f56bb479-841d-4edb-b6d0-608df920c150", "content": "Saudi authorities said on Saturday the annual hajj pilgrimage would go ahead despite a crane collapse that killed 107 people at Mecca's Grand Mosque, where crowds returned to pray a day after the disaster. \n\nHundreds of thousands of pilgrims have already arrived in Mecca for the hajj, one of the world's largest religious gatherings which last year drew two million worshippers. \n\nParts of the Grand Mosque, one of Islam's holiest sites, remained sealed off Saturday around the remains of the red and white crane, accentuating the crush of humanity inside. \n\r \nParts of the Grand Mosque, one of Islam's holiest sites, remained sealed off Saturday around the remains of the red and white crane, accentuating the crush of humanity inside. \n\nWorshippers thronged the mosque as the midday call to prayer sounded, according to an eyewitness. \n\nIndonesians and Indians were among those killed when the crane collapsed during a storm on what is the main weekly prayer day for Muslims. Around 200 others were injured. \n\nA Saudi official said this year's hajj, expected to start on September 21, would proceed despite the tragedy. \n\n\"It definitely will not affect the hajj this season and the affected part will probably be fixed in a few days,\" said the official, who declined to be named. \n\nAs world leaders offered condolences, the governor of Mecca region, Prince Khaled al-Faisal, ordered an investigation into the incident. \n\nAbdel Aziz Naqoor, who said he works at the mosque, said he saw the massive construction crane fall after being hit by the storm. \n\n\"If it weren't for Al-Tawaf bridge the injuries and deaths would have been worse,\" he said, referring to a covered walkway that surrounds the holy Kaaba, which broke the crane's fall. \n\nThe Kaaba is a massive cube-shaped structure at the centre of the mosque towards which Muslims worldwide pray. \n\nSaudis and foreigners lined up on Friday night to give blood in response to the tragedy. \n\nOutside one hospital, more than 100 people waited in the street for their turn to donate. \n\nPictures of the incident on Twitter showed bloodied bodies strewn across a courtyard where the top part of the crane, which appeared to have bent or snapped, had crashed into the building which is several storeys high. \n\nA video on YouTube showed people screaming and rushing around right after a massive crash was heard. \n\nMany faithful would have been gathered there ahead of evening maghrib prayers, which occurred about an hour after the tragedy. \n\nAhmed bin Mohammad al-Mansoori, spokesman for the two holy mosques, was quoted by the official Saudi Press Agency as saying part of a crane collapsed at 5:10 pm (1410 GMT) \"as a result of strong winds and heavy rains\". \n\nMore rain and strong winds were forecast for Saturday, the agency said. \n\r\n           \t\r\n\r\n\r\n\r \r \r \r\n\r  More from this Section", "source": "IBN Khabar"}