{"published": "2015-09-10T20:49:21Z", "media-type": "News", "title": "Knights soccer tallies first win of season", "id": "5fff0a83-fd27-488f-a5ac-3255050f293a", "content": "KANELAND—A busy week that saw some positives and negatives culminated with the first victory of the season for the Kaneland boys soccer team. \nThe Knights (1-3-1) blanked Hinckley-Big Rock, 3-0, on Friday afternoon in Maple Park. \n \n“It felt really good to get that one, and the boys needed that, especially after playing against so many tough teams,” Knights coach Scott Parillo said. “They had a little more time and were able to create some scoring chances.” \n \nJavier Correa scored twice on headers to pace the Knights to the win. \n \nRain forced a postponement of two games on Aug. 29 so the Knights made up their game against Jacobs on Thursday. Once again, weather played a factor, shortening the game, but it didn’t affect the outcome as Jacobs won handily, 4-1. \n \nTrevor Jahns accounted for Kaneland’s lone goal in a game that was called in the 62nd minute due to weather. \n \n“It was not one of our better games,” Parillo said. “We certainly didn’t play well in the second half, so I was a little nervous to how we were going to respond on Friday. We played a brutal second half (against Jacobs).” \n \nThe Knights started the week with a hard-earned 1-1 tie against Class 3A Dundee-Crown. \nJahns gave the Knights an early lead with 13:48 left in the first half, but Dundee-Crown responded with a goal from Jelani Washington just a little more than three minutes later to knot things at 1-1. \n \nNeither team could break the tie. \n \n“We didn’t have as many chances as they did, although we had some nice chances at the end,” Parillo said. “We’re not playing any powder puff teams though, and this was a good team. I keep telling our guys that it’s going to be a long season if we don’t realize that.” \n \nThe schedule doesn’t get any easier for the Knights this week. They were scheduled to travel to DeKalb on Tuesday, and they’ll be at Sycamore this afternoon. \n \n“We’ve played well against West Aurora, Dundee-Crown and now Hinckley,” Parillo said. “It could’ve been higher against Hinckley, but we didn’t convert. We don’t have any gimme games, so these have all been a good test for us, good for our resolve and mental toughness.” \n \nThe Knights also haven’t been at full strength for much of the season. Angel Escontrias left Tuesday’s game against Dundee-Crown with an injury and hasn’t played since, although he’s expected back soon. Drew Franklin also has missed some games due to his dual duty as the football team’s placekicker. He booted a pair of PATs last Friday, but also missed a field goal. \n \n“Like I’ve told the kids many times, we’ve got to keep improving,” Parillo said. “It’s not how you start but how you finish. We haven’t hit our stride yet, and have an ugly record once again at the beginning, but we had that last year too and won a regional.”", "source": "Elburn Herald"}