{"published": "2015-09-08T01:00:52Z", "media-type": "Blog", "title": "Denmark advert in Lebanon newspapers warns off refugees", "id": "cb626cd8-7f1c-4f45-bc55-5dab1f28999b", "content": "Denmark has placed advertisements in four Lebanese newspapers announcing tighter regulations and cuts in provisions for asylum-seekers. \n \nThe advertisement published on Monday said that social assistance for newly arrived refugees was being reduced by up to 50 percent. \n \nThose granted temporary protection would not have the right to family reunification for the first year of their residence, the ad warned. \n \nNew refugees will have to be able to speak and understand Danish in order to obtain a permanent residency. \n  \nDenmark trying to scare off would-be migrants with these ads in #Lebanon media: pic.twitter.com/8uQasJJBF6 \n \n— Sara Hussein (@sarahussein) September 7, 2015 \n \n“There will be a special return centre for rejected asylum-seekers to ensure (they)… leave Denmark as quickly as possible,” the advertisement added. \n \nThe new measures went into effect on Tuesday. \n \nLebanon hosts 1.1 million Syrians who have fled the four-year-long conflict that has devastated their homeland. \n \nSyrians are also the largest nationality among those trying to reach northern Europe via sea crossings to Greece followed by an arduous overland route through the Balkans and Hungary. \n \nDenmark’s Integration Minister Inger Stojberg shared the Arabic version of the advert on her Facebook page  \n \nMost of the refugees and migrants are seeking to reach Germany and Sweden, which are known for their openness to asylum claims from Syrians. \n \nAlmost half of the claims for asylum lodged by Syrians in European countries have been made in those two countries, with another third lodged in countries along the Balkan route or in the Netherlands, according to UN refugee agency UNHCR. \n \nA total of 348,540 Syrians had lodged asylum claims in Europe by July 2015, according to UNHCR, while more than 4 million are hosted in Turkey, Lebanon, Jordan and Egypt. \n \nAnother 7.6 million Syrians are displaced internally, meaning that more than half the country’s pre-war population of 22.4 million has been driven from their homes by the conflict. \n \nSource:   Al Jazeera And DPA \n \nArticle source: Article Source \n\nThe post Denmark advert in Lebanon newspapers warns off refugees appeared first on .", "source": "rocketnews.com"}