{"published": "2015-09-13T23:00:19Z", "media-type": "Blog", "title": "The Splat: Nickelodeon Launches New TV Network Dedicated To 90s Cartoons And Series", "id": "e3b03a25-7245-4cf5-a203-7b5366ce97f0", "content": "Rumors that Nickelodeon will break out all the old favorite Nicktoons and series from the 1990s for a new TV network to be called The Splat appear to be true. \n \nAs previously reported by the Inquisitr , Viacom, the parent company of Nickelodeon, quietly debuted a website and social media campaign teasing “The Splat is Coming” on Friday. However, few other about the new network or when it will launch were provided. \n \nThe new website features links to its social media sites along with the hashtag #thesplateiscoming and “follow us to be the first to find out.” \n  \nCan you feel it? #TheSplatIsComing  pic.twitter.com/RnVlrBgR4U \n \n— The Splat (@thesplat) September 12, 2015 \n \nThe announcement came in conjunction with the 90s Fest in Brooklyn, New York, on Saturday. \n \nPosts on the new network’s social media sites as well as on the verified Nickelodeon Twitter account do not indicate which retro cartoons and series will be featured, but they could very well include favorites like Aaah!!! Real Monsters , Are you Afraid of the Dark? , Rocko’s Modern Life , Doug , Rugrats , Ren and Stimpy , Hey Arnold! , Clarissa Explains it All , and All That , among others. \n \nA verified Twitter account for The Splat started promoting the network as well. \n  \nOnly The Splat breaks the mold. #TheSplatIsComing  #90sFest  @smashmouth  pic.twitter.com/2BJapEUZir \n \n— The Splat (@thesplat) September 13, 2015 \n \nA The Splat Facebook page that is described as a “TV Network” was launched on Friday with lots of teasers, and a YouTube channel was also started. \n  \nAs news spreads about the new television network, excited cartoon aficionados are taking to social media to express their joy. \n  \n#TodaysKidsWillNeverKnow how long we've waited for this #thesplatiscoming  pic.twitter.com/b0hdN6nH20 \n \n— Ðe (@WaltonDeonte) September 12, 2015 \n  \n@thesplat U have no idea how much this means personally! I the splat logo! You're making dreams come true! – Admin Dan #TheSplatIsComing \n \n— Bring The Splat Back (@BTSplatBack) September 12, 2015 \n  \nThank you @NickelodeonTV and @TheSplat for making my week with this announcement. #TheSplatIsComing \n \n— Zach Donegan (@zachdonegan) September 12, 2015 \n \nIn a related article by the Inquisitr , it was reported that Nickelodeon also has big screen plans for your ’90s Nick cartoons. \n \nParamount, which happens to be a subsidiary of Nickelodeon’s production company Viacom, is currently looking to bring five ’90s Nick TV shows into a “Justice League/Avengers” style crossover film. However, despite it being all ’90s Nick cartoons, it is said to have a blend of animation and live-action. Nickelodeon’s crossover film event is said to be similar to another live-action/cartoon blend from the ’90s, Space Jam. \n  \nThat was then. This is now. (Sorry, Elliot Tebele). #TheSplatIsComing  #90sFest  pic.twitter.com/cryMqebHot \n \n— The Splat (@thesplat) September 12, 2015 \n \nThough the details are just as scant as the details for The Splat, reports indicate that Nickelodeon currently has SpongeBob: Sponge out of Water producer Mary Parent working to bring together all the copyrights for the individual shows. Parent will also produce the ’90s Nick inspired film, if it should come to fruition. \n \nWho’s pumped for Nickelodeon’s new network The Splat? \n \n[Image via Facebook/The Splat ] \n \nThe Splat: Nickelodeon Launches New TV Network Dedicated To 90s Cartoons And Series is an article from: The Inquisitr News", "source": "The Inquisitr News"}