{"published": "2015-09-02T06:00:41Z", "media-type": "Blog", "title": "Facts ignored – The invention of the village of Susiya", "id": "928d4ddd-9396-477f-85eb-f23745c71b79", "content": "  Facts ignored – The invention of the village of Susiya editor Wednesday 2 September 2015\tBy Ari Briggs.. The fact is that the area occupied by the squatters has only served as grazing land. On July 16 (2015) the daily press briefing of the US State Department astonished legal circles in Israel. In response to the second question, preceded only by an inquiry on the Iran agreement from which Israel is still reeling, State Department spokesperson John Kirby with a prepared statement pressured Israel not to enforce demolition orders against an illegal Arab encampment adjacent to the Jewish community of Susiya. The State Department took this stand despite the fact that these demolition orders had been confirmed by Israel’s High Court in May 2015 after decades of appeals. The Israelis were astonished for two reasons. One, the State Department was apparently misinformed about basic facts of the case. Two, the statement appears to be an arrogant attempt to undermine the Israeli legal system, including its universally respected High Court. The High Court found that these assertions were demonstrably false, based on comprehensive objective historical and geographical accounts. Historical aerial photography, detailed mandatory maps, travelogues from the 18th and 19th centuries, and the population registry all established that their assertions were a fabrication. Fact: no such village ever existed. The High Court has ruled repeatedly against these false assertions (HC 7530/01, 430/12, 1556/12, 1420/14). See the latest opinion pieces on our Opinion & Blogs Facebook page However, the Nawajah family’s “struggle” has become a cause célèbre of the cadre of foreigners and foreign-funded NGOs intent on harming Israel and its standing worldwide through untruths, misrepresentations and outright lies. Second, apparently the State Department failed to realize that the High Court established that the Nawajah family members have permanent homes in Yata, a city in Area A, under full Palestinian Authority rule (HCJ 430/12 and HCJ 1556/12). Moreover, Regavim’s research has established that like other PA residents from Areas A & B, the Nawajah family are being encouraged by the PA in accordance with the Fayyad Plan (2009) and assisted by the EU (EU report “Area C and Palestinian State Building”– 2011) to illegally establish facts on the ground in Area C (under full Israeli authority, as per Oslo Accords). Regavim has documented at least 20 illegal structures in the encampment, funded directly by the EU and proudly bearing the EU flag. The encampment is strategically placed between the Jewish community of Susiya and the Susiya archaeological site. Their agenda is clearly intended to obliterate the fact that an ancient Jewish community, including a magnificent ancient synagogue, thrived in this area before Islam even existed. The fact is that the area occupied by the squatters has only served as grazing land. In 1982 Plia Albeck, the state’s land expert, documented some private land in the area and confirmed it as agricultural land only. Anthropologist Yaacov Havakook researched the area the 1980s when he lived there for several years. As an expert witness he stated: “The Arabs never lived permanently in these caves… the caves have been used only as temporary dwellings by shepherds for two weeks to a month a year during the grazing season.” Two days prior to the State Department statement, B’tselem, an NGO well-funded by the EU and foreign governments including France, the UK and Germany as well as by the New Israel Fund, published a press release saying that pressure from Regavim is forcing the government’s hand and quoting the illegal encampment’s counsel, saying “that this kind of thinly veiled threat to demolish homes in Susiya before the planned court hearing is an unacceptable form of coercion”. Reading this quote one would conclude that the hearing on August 3rd is intended to adjudicate the legality of the demolition orders. This is a deliberate attempt to mislead, and unfortunately, the US State Department was again apparently misled. In fact, the legality of the demolition orders has been confirmed by the High Court many times over the protracted litigation, and the High Court denied a request for an injunction against the orders despite the pending hearing: “Taking the law into one’s own hands even after filing this petition precludes granting an interim order.” (HCJ 1420/14) The State department also stated, “We urge Israeli authorities to work with the residents of the village to finalize a plan for the village that addresses the residents’ humanitarian needs.” The State department purposefully ignored the true state of affairs or was woefully ill informed in this regard as well. In fact, even though they have homes in Yatta, the Civil Administration had agreed to establish a new village in Area C, a mere 2 miles from their current illegal encampment, more than providing for their “humanitarian needs”. It is crucial that the facts be told and the law upheld despite the extreme pressure being applied by the EU and US State Department.The Israeli government dare not cede the rule of law in this blatant and misguided attempt to usurp the authority and power of our courts and legal system.  If the government appears powerless in the face of pressure from such outside forces and continues to sacrifice the country’s interests, Israel will, indeed, invite additional pressure, while weakening its own resolve to pursue justice. Our legal system is internationally recognized as robust, strong and just. Ignoring the history and facts of this particular case would be particularly egregious, as it would blatantly violate a basic legal principle: Ex injuria jus non oritur, legal rights cannot derive from an illegal act, or in this case, decades of demonstrably illegal acts. Regavim is proud to be considered the counter pressure pushing the government to uphold the rule of law and the equal application of that law. The author is a director of Regavim, a research based legal advocacy organization, dedicated to ensuring responsible, legal and accountable use of Israel’s national land. For more information, visit www.regavim.org. From:\nhttp://www.jpost.com/Opinion/Comment-The-invention-of-the-village-of-Susiya-409861 Related Posts:Palestinians are building illegally and systematically in…Israel to European governments: Stop funding illegal…Exciting times at Regavim – Serious achievementsAmerica: No Jews in Judea and SamariaWho says the settlements are illegal? The confusion of law…\nTags: Area A, Area C, Briggs, Home, Israel, Jews, Regavim, US\t1 views", "source": "Why Israel? » Home"}