{"published": "2015-09-17T18:30:00Z", "media-type": "News", "title": "Governor to visit in November", "id": "f9b4bebd-630d-4096-bcbb-a88f8eea285e", "content": "His Excellency General The Honourable David Hurley AC DSC (Ret'd), Governor of New South Wales, late yesterday announced his intention to visit Parkes and Forbes from 17 to 19 November. His Excellency General The Honourable David Hurley AC DSC (Ret'd), Governor of New South Wales, late yesterday announced his intention to visit Parkes and Forbes from 17 to 19 November. “Linda and I (pictured) are very much looking forward to meeting the people of Parkes and Forbes over the three days,” Governor Hurley said.\n\nSince becoming Governor on October 2, 2014, His Excellency and Mrs Hurley have routinely demonstrated their keen interest in engaging with communities right across the State. \n\nTo date they have visited Eden, Boggabilla, Balranald, Broken Hill and Bourke, and countless places in between. \n\nThe November visit will be His Excellency’s and Mrs Hurley’s first trip to Parkes and Forbes since taking up residence at Government House Sydney.\n\n“There is nothing more heartening than meeting the people of this great State and seeing first-hand, and in their own backyard, not only their achievements and successes, but also the challenges that they face on a daily basis,” the Governor said.\n\n“Heading into the geographical heart of New South Wales is certain to be a real highlight for us both.”\n\nThough program details are still under development, since being sworn in as Governor, His Excellency has continued to pursue a number of priority areas such as youth engagement; regional and rural growth; innovation, industry, trade and investment; inclusiveness and diversity; and service to state and community. \n\nHe maintains a particular interest in mental health and homelessness.\n\nThe Governor and Mrs Hurley both share a deep passion for schools, music and singing, while Mrs Hurley also enjoys interacting with aged care and women’s associations.\n\nThe final Vice Regal program will be released closer to the time.", "source": "Parkes Champion-Post"}