{"published": "2015-09-06T09:51:09Z", "media-type": "News", "title": "Steve Smith will regret pressing for Ben Stokes' dismissal, says Alec Stewart", "id": "ac82630f-1f2d-4fb5-a59e-bf62b7c09db0", "content": "Australia skipper Steve Smith may already regret pressing for Ben Stokes to be dismissed for obstructing the field, according to former England captain Alec Stewart. \n \nStokes became  just the seventh batsman in international cricket to be given out via the sport's rarest mode of dismissal, and England went on to lose by 64 runs in Saturday's one-day international at Lord's. \n \nAustralia's insistence on calling for Stokes to go threatened to sour relations with England for the remainder of the Royal London Series, which the tourists lead 2-0 with three matches remaining - the next at Old Trafford on Tuesday. \n \nStokes thrust out his left hand when trying to regain his ground, as bowler Mitchell Starc fielded a straight drive and from short range threw the ball back in a run-out attempt . \n \nHe palmed the ball away,  Starc appealed, and following the instinctive referral from Kumar Dharmasena on field, slow-motion  perusal by third umpire Joel Wilson was enough to convince the officials Stokes  was out. \n \n\"In the heat of the battle I understand why Steve Smith made that decision,\" Stewart said on Sunday. \n \n\"I think in hindsight, probably, maybe this morning, he will reflect on it that it was the wrong decision (and) he should have actually retracted that appeal.\" \n \nSmith took exception to his opposite number Eoin Morgan's suggestion that, in the Australia captain's place, he would have withdrawn the appeal against Stokes. \n \nAccording to Stewart, Stokes acted out of \"self-preservation\" - looking to avoid injury above thinking about his wicket. \n \nStewart told BBC Radio 5 Live:  \"We've had other instances in the past, perhaps Paul Collingwood against New Zealand when he played the run out to run out Grant Elliott at The Oval.\" \n   Promoted stories   \nIn that incident, in 2008, Elliott collided with England bowler Ryan Sidebottom, and Collingwood, captaining the side, turned down an opportunity to withdraw England's appeal. \n \nThe Stokes incident was a different circumstance. \n \nThe Laws of Cricket stipulate that a batsman must be judged to \"wilfully attempt to obstruct or distract the fielding side\" to be given out in the manner that Stokes saw his innings end. \n \nStewart said: \"A t the time I'm just thinking, 'Ben Stokes is taking evasive action - no way is that out'. \n \n\"I'd have to question the third umpire: what on Earth was he thinking? Why didn't he watch the replays in full speed as against just in slow motion? I think when you slow everything down it gives almost a false picture. \n \n\"It was just bad. When the ball is thrown at you at 80 miles per hour from eight or so metres away you're going to take evasive action, you're going to put your hand up whether you've got a helmet on or not to protect yourself. \n   \n Share article  \n   \n\"And even though the pictures are showing his hand was outside the line of his head, to me that is still taking evasive action and therefore it should not have been out. \n \n\"You can see from Ben Stokes' reaction he wasn't even looking at the ball.\"", "source": "Witney Gazette"}