{"published": "2015-09-09T10:04:40Z", "media-type": "News", "title": "Ahead of Sept 16 rally, red T-shirts promoting ‘Malay dignity uprising’ on sale outside PWTC", "id": "e2537034-5719-42ba-a6b6-f5d8bb3a7526", "content": "Organisers of the September 16 rally selling red T-shirts for RM10 each outside PWTC. — Pix by Kamles Kumar KUALA LUMPUR, Sept 9 — As Umno’s powerful supreme council members are locked in a meeting in the headquarters at Menara Dato Onn here this afternoon, organisers of the controversial September 16 rally have opened up a stall outside the adjoining Putra World Trade Centre selling red T-shirts promoting a “Malay dignity uprising”. \n \nSales of the tees costing RM10 each appear to be brisk. According to one of the sales team, over 5,000 have been sold, and orders are coming in for another 2,000 red shirts to be picked up later. \n \nBut who is the September 16 rally organiser? Datuk Jamal Md Yunus (in black suit with specs) holds up a red T-shirt that reads in Bahasa Malaysia: Malay dignity uprising, Padang Merbok, Bukit Bintang, Petaling Street, My Homeland. \n \nAccording to Datuk Jamal Md Yunos who heads a self-styled coalition of Malay non-government organisations that is facilitating sales of the red T-shirts and will help to mobilise participation on that day, the organiser is a little-known Malay rights group called Pesaka. \n \n“The rally organiser is Pesaka. We’re just helping with mobilising the rally,” Jamal who is also Sungai Besar Umno division chief told Malay Mail Online when met at the booth sale. \n \nJamal added that the group has received over 600,000 orders for the T-shirts nationwide and is expected to sell 30,000 over this weekend. \n \n“We have over 5,000 shirts printed and ready to be sold. We have got overwhelming response with pre-orders reaching thousands coming in. We think we need to print more,” he told reporters who had turned up to cover the Umno supreme council meeting. \n \nJamail said the earlier batch was sold out because of the outpouring of support from Malaysians to join the rally. \n \n“The orders keep coming in. Hope we can sell all by the time the rally happens. Now we have got itself over 600,000 nationwide from various groups who are helping to sell the T-shirt,” he explained. \n \nMajor Razali Zakaria from another Malay movement called GMPN said his NGO had already ordered over 1,000 pieces of T-shirts ahead of the upcoming rally on September 16. \n \n“A lot of my members have expressed interest to purchase this T-shirt. That’s why I am here to buy them before they run out of stock,” he told the Malay Mail Online when approached. Major Razali Zakaria (left) of GMPN says his group is buying 1,000 pieces of the T-shirts for the rally. \n \nThe September 16 rally had raised a storm after word of it spread on social media networks in recent days, but no one had owned up as its organiser till now. \n \nThe rally, which has also been called the “Dignity Association of Indonesia”, has received unofficial support from some government officials, including Deputy Prime Minister Datuk Seri Ahmad Zahid Hamidi and Domestic Trade, Cooperatives and Consumerism Minister Datuk Seri Ismail Sabri Yaakob. \n \nIt is ostensibly in reaction to the Bersih 4 protest on August 29 and 30, and is touted to see a turnout of 300,000 supporters. \n \nBut not all of Umno is supportive of the September 16 rally. \n \nIt was criticised yesterday by former international trade and industry minister Tan Sri Rafidah Aziz, who dubbed it an instigation to racialisation with its call for Malays, especially those from the country’s ruling party, to unite against the DAP and organisers of Bersih 4. \n \nPolice have prohibited the rally but Umno-linked newspaper Utusan Malaysia in its weekend edition last Sunday pressed the authorities to allow the rally to take place, saying it was necessary to counter what it dubbed as the Chinese-dominated Bersih 4 rally. \n \nElection watchdog Bersih 2.0 organised the street overnight on August 29 and 30 to demand for electoral reforms as well as the resignation of Datuk Seri Najib Razak as prime minister owing to a controversy surrounding his receipt of a RM2.6 billion donation from the Middle East. \n \nSeptember 16, which falls on a Wednesday, is Malaysia Day and a national holiday.", "source": "Malay Mail"}