{"published": "2015-09-22T15:01:41Z", "media-type": "News", "title": "Town mourns ‘a tower of strength’", "id": "b18440e8-6a5c-424a-aaa0-848103c83448", "content": "Mark Trickey, second from the left, with sons Shane, Boe and Simon.  Source: Supplied  \n        \n GEOFF Balderas choked back tears when he reflected on the life of the late, great Mark Trickey.  \n   \n“He was an absolute champion,” Balderas said of the Lorne sporting identity who died of cancer this week. \n\n“He was a great man. He’d go out of his way to help anyone. You couldn’t say a bad thing about him. We used to knock around together at the club, on footy trips and so on. \n\n“You couldn’t fault him in any way. He was the best speaker I’ve ever heard. He didn’t need any notes — it was straight off the cuff and just inspirational­. \n\n“I was going to ask him to speak at my funeral.” \n\nTrickey died on Monday “after a long and courageous struggle”. He was 58. \n\nHe is survived by wife Julianne­, sons Simon, Shane and Boe and grandchildren Jax and Indiana. \n \nThe Lorne community is in mourning for the much-loved family man, who devoted his life to many of the town’s sporting clubs and community groups. \n\nTrickey was the president of the Lorne Country Club and has been lauded for his role in helping the golf entity escape difficult times. \n\nHe was a life member and premiership coach of Lorne Football Club, where he played more than 180 games. \n\nTrickey was named at full back in the Dolphins’ Team of the CDFL Era from 1971 to 2006 and he was the 1978 senior best and fairest. He played in Lorne’s 1980 premiership before moving to coach Birregurra in 1981 and 1982. \n\nThe champion defender returned to Stribling Reserve to coach the Dolphins to the 1983 flag. He also coached Lorne in 1985. \n\n“He was a good, strong player,” Balderas said. “Being a backman, he knew when to spoil. He wasn’t overly fast but he was a good, solid player.” \n\nTrickey was a standout cricketer for Lorne, winning the 1979-80 and 1984-85 bowling averages and belted a century in a distinguished career. \n\nHe was also an impressive golfer, winning a club championship, and played on single figures for most of his life. His handicap was as low as four. \n\nIn recent years Trickey was football operations manager. \n\n“He took care of all of the players,” Lorne president Ken Hosking said. “He was a highly esteemed member of the football club; he was respected, his views were respected. \n\n“I was speaking to (former senior coach) Jason Langdon and he was a mentor to him and he was a mentor to me when I started as president. \n\n“He was always around the club but his focus in recent years was at the golf club, where he was president. He had a lot of work to do there and he managed to get the club back on track. \n\n“He’s always been involved in successful operations in community work around town.” \n\nTrickey was also on the Lorne Foreshore committee and a member of the Lions Village committee. \n\n“He was just a tower of strength in whatever he was involved in,” Hosking said. “He put his heart and soul into everything. I was part of the Lorne Lions committee and that was another group he devoted a lot of time to. He did a lot of community stuff behind the scenes. He was a likable guy and he lived and loved life. He was taken too soon.” \n\nThe funeral service will be held at 2.30pm on Friday at the Lorne Country Club.", "source": "Geelong Advertiser"}