{"published": "2015-09-03T22:47:59Z", "media-type": "News", "title": "Hoteliers hope to halve tax", "id": "ffed5c1a-1f89-4b03-9e56-ac4233bcad79", "content": "ATLANTA – Hotel executives are stepping up their lobbying efforts to reduce the $5 nightly tax added to every room in this year’s transportation-funding law. \n \nIt was one of two main topics during a four-day conference earlier this week in Savannah. The other issue was opposition to a pending bill designed to safeguard the religious preferences of small-business owners who object to gay weddings. \n \nThe tax took effect in July, and industry leaders say it’s too soon to tell what impact it’s having. However, they have heard squawking about it from groups interested in booking multiple rooms for events. \n \n“It is certainly a discussion point for meeting planners,” said Jim Sprouse, executive director of the Georgia Hotel & Lodging Association. “They say, ‘I can book my meeting in another state and save all of that money.’ It’s particularly important for border areas.” \n \nThat’s also a consideration for leisure travelers, truckers and highway drivers who are stopping for the night, said Michael Owens, president of the Savannah-based Tourism Leadership Council. \n \n“We’re so close to the border that we’re hearing from many of our members that visitors are opting to just keep driving down south to Florida or north to South Carolina,” he said. \n \nThe industry is backing legislation proposed by House Economic Development and Tourism Chairman Ron Stephens, R-Savannah. It would reduce the tax but try to collect the same revenue by extending it to vacation rentals and short-term rooms booked through online sites. \n \n“Quite honestly, it’s going to be an uphill battle because a lot of us legislators have vacation rentals,” Stephens said. \n \nAnother consideration is that the vacation rental market may not be big enough to make up for half of the estimated $200 million the new nightly tax is expected to bring the state for road improvements. \n \nOwens said the 800 vacation rentals in Savannah are dwarfed by the 15,000 hotel rooms. \n \nBut Sprouse said the online rooms account for as much as 10 percent of the available rooms in Atlanta. \n \nLegislators have generally remained noncommittal, saying they don’t want to do anything until they have seen at least one year’s worth of tax collections. \n \nHowever, the reaction was mixed to the industry’s opposition to the so-called religious-freedom bill. During a question-and-answer session at the conference, some lawmakers flatly stated their support for it. \n \nThe lodging executives are worried that passage will lead to boycotts from companies, trade shows and conventions. \n \n“If it’s even discussed, we will hear about it from some groups,” Sprouse said.", "source": "Augusta Chronicle"}