{"published": "2015-09-03T14:27:38Z", "media-type": "News", "title": "Socceroos cruise past outclassed Bangladesh", "id": "bd0ae4a1-4270-43d6-802a-2a15bdcef040", "content": "Ange Postecoglou delighted with performance as job done with minimum of fuss   Socceroos vs Bangladesh, by numbers \n\nSocceroos coach Ange Postecoglou's fears that his team might have been disrupted by the row between the players union and the FFA that had provided much of the mood music in Perth this week proved unfounded after Australia put an outclassed Bangladesh to the sword on a balmy evening in Western Australia. \n\nThe Socceroos ran out 5-0  winners of their second World Cup qualifying match on the road to Russia 2018, Postecoglou springing a surprise by leaving captain and talisman Tim Cahill on the bench. \n\nFor once they didn't need the former Everton man's golden touch as Mat Leckie, Tom Rogic (two), Nathan Burns and Aaron Mooy filled their boots against opponents who might have provided more resistance had both teams changed into cricketing whites and opted to play a Twenty20 match instead. \n\nStill, home crowds love winners, and at the very least the Socceroos gave a capacity Perth crowd plenty of fond memories to hold on to should there be another ten year gap between international appearances in the city. This was, after all, the first time Australia had played there since defeating Indonesia 3-0 a decade ago. \n\nAs a contest this was all over inside ten minutes. \n\nBy then Australia was already 2-0 up against an opponent whose inadequacies were manifest. \n\nIt was clear that whatever else he was going to get out of this match, Postecoglou wouldn't learn an awful lot he didn't already know about his players ??? aside, perhaps, from their ability to lairise and put on a show with the game won so easily and so early. \n\nNot that there was a lot of lairising. Postecoglou demands a high-tempo workrate, an energetic pressing game and a ruthless approach to whoever his side his playing, so for him its business as usual no matter the state of the game. \n\nAny idea that Australia might go soft on their South-East Asian neighbours once the game was effectively settled was quickly dispelled as the men in yellow sought to add to their tally with every forward foray. \n\nAustralia would not have played many more one sided games than this one. Goalkeeper Adam Federici spent most of the first period as the only player in his half of the field, and so keen was he to get a touch of the ball that he was pushing up almost to the half way line. \n\nHis hopes were in vain however, as the Socceroos looked to score every time they got possession. \n\nThis was a perfect opportunity for Tom Rogic to ease himself back into the national team. Making his first appearance since being dumped on the eve of the World Cup through injury, the languid Celtic playmaker needed little encouragement to shake off the disappointment of Brazil and show why such high hopes had been entertained for him. \n\nHe didn't disappoint, netting twice in the first half ??? once from a shot from inside the penalty area, the second from an effort which was deflected in, after which he looked slightly embarrassed. \n\nBut he impressed more with his zest for the contest and his desire to take on opponents and play combination passes with the likes of Massimo Luongo and Aaroon Mooy, the Melbourne City midfielder this time given a chance to start a match. \n\nIn almost every other game he will play Rogic will face sterner opposition, but he showed in the first half how important a creative outlet he can become for the national team if he can remain fit and in form. \n\nCahill is a massive presence around this squad, but for once he wasn't needed. In fact Leckie gave a more than passing impersonation of the Socceroo legend, hanging in the air and providing an aerial threat every tme the ball came in high from the flanks. \n\nLeckie had only ever scored once for Australia going into this game, but he doubled his tally with the Socceroos opening strike in the sixth minute, when he tucked home a shot from a cut back by Luongo. \n\nHe went close on a number of occasions in the opening period with headers and shots, and it was a header from him which led to Australia's fourth goal in the 28th minute as Nathan Burns pounced on the rebound from Leckie's effort after it was fumbled by Bangladesh goalkeeper Sahidul Alam. \n\nBangladesh clung on until the interval and Australia failed to add to their tally until just after the hour mark when Mooy unleashed a 20 metre drive which powered past Sahidul to make it five for the night. \n\nRogic and Leckie made way for Cahill and exciting youngster Chris Ikonomidis almost immediately, Cahill refusing to take the captain's armband from Mark Milligan, who had worn it in his stead. \n\nIkonomdiis nearly got off the mark straight away with a header from a Jason Davidson cross that thumped off the bar. \n\nBut for all of their possession and all of their dominance the Australians could not add to their tally in what was for them a disappointing half compared to the fireworks of the first period. Jackson Irvine, another new face, went close with a header off the woodwork and then blasted just wide, but the 19,495 strong crowd, the biggest ever for a soccer match at nib Stadium, had to be content with their five goal lot. \n\nAustralia will in all probability face a much sterner test in Tajikistan next Tuesday night.", "source": "The Land Australia"}