{"published": "2015-09-12T22:36:39Z", "media-type": "News", "title": "Jacksonville St falters late in OT loss to No. 6 Auburn", "id": "9d9d0542-9cf6-461d-8eaa-0f16cb4f6e42", "content": "Just when Jacksonville State was minutes away from an upset quarterback Eli Jenkins said \"would've shocked the world,\" a shanked punt sidetracked the Gamecocks' plans. \n\nAfter leading No. 6 Auburn late in regulation, Jacksonville State lost to the Tigers 27-20 in overtime on Saturday. \n\nTroymaine Pope's 5-yard touchdown run with less than 6 minutes remaining gave the Gamecocks a 20-13 lead. The 17-yard punt by Hamish MacInnes gave Auburn the ball in great field position at the Gamecocks 31 with 2 minutes remaining. \n\nMelvin Ray's leaping 10-yard catch in the right corner of the end zone with less than 1 minute remaining in regulation saved Auburn (2-0) from a stunning loss. \n\nLed by Jenkins, the Gamecocks had more total yards (438-401) and first downs (28-23). But the poor punt was the start of their undoing. \n\nDid the Gamecocks keep their composure down the stretch? \n\n\"For the most part I believe we did,\" said receiver Ruben Gonzalez. \"But at times, I feel like we were maybe getting too piped up.\" \n\nIt was the first meeting of the Alabama schools located 108 miles apart. Jacksonville State played even with Auburn, the highest-ranked opponent in the program's history. \n\nJenkins' 11-yard touchdown pass to Josh Barge gave Jacksonville State a 10-6 halftime lead, and the visiting fans chanted \"JSU! JSU!\" as the teams left the field. \n\nJenkins completed 26 of 43 passes for 277 yards with one touchdown and one interception. He ran for 37 yards and said \"Jacksonville State asserted itself today.\" \n\nAuburn struggled to keep up with Gonzalez, who caught eight passes for 101 yards, and Barge, who had 14 catches for 132 yards and a touchdown. \n\nPeyton Barber's 4-yard touchdown run in overtime gave Auburn the win. Jenkins couldn't complete his last fourth-down pass for Barge in the extra period. \n\nJacksonville State (1-1) is the first Football Championship Subdivision team to take a ranked FBS team to overtime, but coach John Grass said that's no reason to celebrate. \n\n\"I don't want to hear no moral victory stuff, for sure,\" Grass said. \n\nJacksonville State is No. 5 in the STATS FCS national poll and No. 6 in the coaches poll. Grass said he never doubted his players could compete with Auburn. \n\n\"We left a few plays out there, but I don't think we played over our head,\" Grass said. \"We're down. This bunch expects to win every time we line up and play. We really didn't think Auburn had to play bad to give us a chance to win.\" \n\nNo FCS team has defeated a ranked FBS team since Aug. 31, 2013, when Eastern Washington beat No. 25 Oregon State 49-46. An Auburn loss would have compared with No. 5 Michigan's loss to Appalachian State on Sept. 3, 2007. \n\nJenkins compared the Gamecocks' underdog bid to a tennis match in the U.S. Open. \n\n\"The odds were probably just like the tennis match with Serena Williams,\" he said. \"They were probably 3,000 to one. Nobody figured we would expand the game.\"", "source": "Sacramento Bee"}