{"published": "2015-09-28T02:20:55Z", "media-type": "Blog", "title": "Saturday the 26th - Vignette #1", "id": "32ed8956-bd9c-4ab5-8bb2-9c1889229940", "content": "2 - 4 - 6 - 8  !! Who Do We Appreciate  ? ! Ha ! - Sure sounds like some Teeny-Bopper Cheerdance Pep Shout-Out from some local West Coast High - Whatever !!  Just some random ramblings to break the ice here as I share these  \"smart snaps\" i crafted, of [only] eight members    of the UP Pep Squad Alumni - who, at the Halftime Break of the UP-NU match [MoA Arena] -- again showed the UAAP faithful why the UP Pep Squad, as I Personally Feel  has always been - and will continue to be ---   A. A. C. A. !! --- > Always A Class Act !! But this post does not deal with such merit or status - but rather - simply - and hopefully -  ..... shares a more \"UP-Close\" and Personal Angle  - If Only for the few the fleeting moments one will view these images  .... .....  and some \"silly\" thoughts on Art, in general .... So far, I am NOT that familiar [let alone, acquianted] with these 8 UP Pep Squad Alumni.\nAm \"aware\" of the names of 7 of them, in the JPEG directly below  --   [forgive me] But I still am at a loss, as to who Is who .....\nNames Randomly Rattled off ---They are\n---> Trixie Segundo / Ivy tabares / Monalyn Luna / Marrielle Barraza /\nCarlou Guevarra / Kiko Cortez   Dance IS a Non-Verbal form of Art - Right ?  - and so is Photography - Right ? . And at their Highest Levels - wether it be Dance, Music, Painting, Photography or whatever Art Form - It is How Strong it comes across to the Viewer or Listener - that Truly Matters - How the Audience is Compelled, or \"Moved\" - - - How it HITS Home ! - in a manner of speaking - It's about Heart, It's about Soul -  It's about Passion - and then Some !!\nNo, no, no - I'm not tryin' to \"sound profound\" here, or anything even remotely close to that - It IS Simply the Truth.\nIf you want to be a True Artist - Isagad Mo Na ! - Commit, Sacrifice and let your Passion Carry you through !\nOne thing I've noticed though, in the broader context of Art   [history and all]  ....... For any artist there is no Greater Reward than Being Acknowledged and Appreciated - Right ?\nBut the Great Ones - \nNot only are they Acknowledged and Appreciated  ......\nThey are Remembered. \nbrosi gonzales", "source": "brosigonzalesphotos"}