{"published": "2015-09-29T21:27:00Z", "media-type": "News", "title": "F.N.B. Corporation Announces Pricing of $100 Million of Subordinated Notes", "id": "560fe581-f0a5-472c-9b98-840629acbd30", "content": "PITTSBURGH , Sept. 29, 2015 /PRNewswire/ -- F.N.B. Corporation ( NYSE: FNB ) today announced the pricing of $100 million of subordinated notes due October 2 , 2025.  The notes have a fixed interest rate of 4.875% per annum, payable semi-annually, and a ten-year term.  The offering is expected to close on October 2, 2015 , subject to customary closing conditions. \n\nThe Company intends to use the net proceeds from the offering for general corporate purposes. \n   \nF.N.B. has filed a shelf registration statement (including a base prospectus) and a preliminary prospectus supplement relating to this offering with the SEC.  Prospective investors should read the registration statement (including the base prospectus), the preliminary prospectus supplement and other documents F.N.B. has filed and will file with the SEC that are incorporated by reference into the registration statement and each prospectus supplement for more complete information about F.N.B. and the offering, including the risks associated with the securities and the offering. \n\nRBC Capital Markets, LLC and Sandler O'Neill & Partners, L.P., are serving as joint book-running managers. \n\nThis announcement shall not constitute an offer to sell or the solicitation of an offer to buy these securities, nor shall there be any offer or sale of these securities, in any jurisdiction in which such offer, solicitation or sale would be unlawful. The offering will be made only by means of a prospectus supplement and accompanying prospectus, copies of which may be obtained from the investor relations section of F.N.B.'s web site at: www.fnbcorporation.com or from the SEC's Web site at: www.sec.gov .  Alternatively, you may obtain a copy of the prospectus supplement and accompanying prospectus for the offering by contacting: \nRBC Capital Markets, LLC, Attention: Fixed Income Syndicate, 3 World Financial Center, 200 Vesey Street, 8th Floor, New York, NY 10281-8098, telephone (866) 375-6829. Sandler O'Neill & Partners, L.P., Attn: Syndicate, 1251 Avenue of the Americas, 6th Floor, New York, NY 10020, Tel: (866) 805-4128 or Email: syndicate@sandleroneill.com \nInformation on F.N.B.'s web site does not constitute part of, and is not incorporated by reference in, the prospectus or prospectus supplement. \n\nAbout F.N.B. Corporation \n\nF.N.B. Corporation ( NYSE: FNB ), headquartered in Pittsburgh, Pennsylvania , is a diversified financial services company operating in six states, including three major metropolitan areas. It holds a top retail deposit market share in Pittsburgh, PA , Baltimore, MD , and Cleveland, OH . F.N.B. has total pro-forma assets (with the proposed merger of Metro Bancorp, Inc.) of $19.6 billion and more than 300 banking offices throughout Pennsylvania , Maryland , Ohio and West Virginia . F.N.B. provides a full range of commercial banking, consumer banking and wealth management solutions through its subsidiary network, which is led by its largest affiliate, First National Bank of Pennsylvania , founded in 1864. Commercial banking solutions include corporate banking, small business banking, investment real estate financing, international banking, business credit, capital markets and lease financing. The consumer banking segment provides a full line of consumer banking products and services including deposit products, mortgage lending, consumer lending and a complete suite of mobile and online banking services. F.N.B.'s wealth management services include asset management, private banking and insurance. F.N.B. also operates Regency Finance Company, which has more than 70 consumer finance offices in Pennsylvania , Ohio , Kentucky and Tennessee . The common stock of F.N.B. Corporation trades on the New York Stock Exchange under the symbol \"FNB\" and is included in Standard & Poor's SmallCap 600 Index with the Global Industry Classification Standard (GICS) Regional Banks Sub-Industry Index. Customers, shareholders and investors can learn more about this regional financial institution by visiting the F.N.B. Corporation web site at www.fnbcorporation.com . \n\nCautionary Statement Regarding Forward-looking Information \n\nThe information in this press release may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements are typically identified by words such as \"believe,\" \"plan,\" \"expect,\" \"anticipate,\" \"see,\" \"look,\" \"intend,\" \"outlook,\" \"project,\" \"forecast,\" \"estimate,\" \"goal,\" \"will,\" \"should\" and other similar words and expressions and related to, among other things, the Company's expectations with respect to the proposed offering. These statements are based upon current beliefs and expectations and are subject to numerous assumptions, risks and uncertainties, many of which are outside of the Company's control and which change over time. Actual results or future events could differ, possibly materially, from those anticipated in forward-looking statements, as well as from historical performance. Factors that could cause the Company's results to differ materially from those expressed can be found in the risk factors set forth in the Company's Annual Report on Form 10-K for the year ended December 31, 2014 , and the Company's other filings with the SEC. Forward-looking statements speak only as of the date made. The Company does not assume any duty and do not undertake to update forward-looking statements. \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/fnb-corporation-announces-pricing-of-100-million-of-subordinated-notes-300151159.html \n\nSOURCE  F.N.B. Corporation", "source": "CEOWorld Magazine"}