{"published": "2015-09-02T21:17:32Z", "media-type": "Blog", "title": "FITX Postmortem: Desperate Times Call For Stupid Measures", "id": "f2b1e493-0a3e-4b0c-a736-88ce1dce0e9d", "content": "CEN Biotech's \"never say die\" stance is clearly designed to appease Chaaban's cult followers and maybe try to get them to buy more shares\nSeptember 2, 2015: It certainly seems like a bad joke. One that should insult the intelligence of even the staunchest member of Bill Chaaban's cult. I'm referring of course to Creative Edge Nutrition's (FITX) September 1st press release, the first in four months.  Desperate for something to say--likely at the urging of cult members-- FITX came up with one of its more preposterous announcements. And for this company, that's saying something.\nAccording to CEN Biotech, FITX's Canadian subsidiary which earlier this year was shot down by the Canadian government in its attempt to grow pot in Ontario for public consumption, has \"issued and served upon the Office of the Deputy Attorney General of Canada, its Notice of Intent to seek arbitration under Chapter 11 of the NAFTA (North American Free Trade Agreement).\"\nIn other words, a Canadian company is threatening to appeal a ruling by the Canadian government under NAFTA, the North American Free Trade Agreement between Mexico, the United States and Canada.  This is an international agreement. Canada did not enter into a free trade agreement with itself.\nUnder NAFTA's Overview of Settlement of Disputes between a Party and an Investor of Another Party:\nChapter 11 establishes a mechanism for the settlement of investment disputes that assures both equal treatment among investors of the Parties to the Agreement in accordance with the principle of international reciprocity and due process before an impartial tribunal. A NAFTA investor who alleges that a host government has breached its investment obligations under Chapter 11 may, at its option, have recourse to one of the following arbitral mechanisms:\nthe World Bank's International Centre for the Settlement of Investment Disputes (ICSID); ICSID's Additional Facility Rules; and  the rules of the United Nations Commission for International Trade Law (UNCITRAL Rules). Only the most gullible will buy into FITX's latest BS. Even if the United Nations had domain over Canada in its own internal affairs, and it doesn't, why would they give a damn about Chaaban's deserved retribution for deceiving the public? I mean seriously. Who the hell cares? Well besides the fools that were taken in by Bill Chaaban and company.\n   » Related: FITX Postmortem: Bill Chaaban Just Doesn't Get It\nThe fact that CEN Biotech is a subsidiary of FITX that has international investors will have no bearing on the viability of a NAFTA complaint. According to the press release, it is CEN Biotech, not FITX, that is seeking arbitration. Furthermore, FITX does not claim any involvement in the medical marijuana business in neither its OTCmarkets profile nor in its press releases. According to the company itself, FITX is in the nutrition industry. A NAFTA complaint may have been somewhat more relevant if CEN Biotech had not removed itself from the Michigan corporate registry in March of this year.\nOne could surmise from the desperate actions outlined in this latest press release that FITX/CEN Biotech does not feel that the Judicial Review of the Minster of Health's rejection of the MMPR application is going well, although no ruling has been made public. With a large contingency of myopic bag holders hanging on to FITX shares needing to be appeased and many more shares left to dump onto the market--at last report the number of shares issued and outstanding had grown to 4,177,874,418--it seems the effort to keep the optimism flowing is approaching desperate levels.", "source": "theOTC.today"}