{"published": "2015-09-28T12:25:50Z", "media-type": "News", "title": "Luke Batty: 'missed opportunities' to intervene in boy's death, coroner finds", "id": "5cd361bc-3a64-4535-82ea-737f0401cbbd", "content": "Perpetrators of family violence should face greater risk assessment and monitoring, according to Victoria's state coroner. \n\n﻿ \n\nPerpetrators of family violence should face greater risk assessment and monitoring, according to Victoria's state coroner, who found that police, the judiciary and several government agencies failed to protect Luke Batty from the increasingly erratic behaviour of his father Greg Anderson.\n\nJudge Ian Gray said no individual or agency should bear responsibility for Luke's tragic death, but identified several \"missed opportunities\" to intervene, despite a series of warnings.\n\nLuke, 11, died when attacked with a cricket bat and knife, before police shot Anderson, who died in hospital. The 54-year-old had four arrest warrants and two intervention orders against his name at the time and a history of family violence against Luke's mother, Rosie Batty.\n\nAnderson's charges of threatening to kill Ms Batty in January 2013 were never heard, police missed several chances to arrest him because warrants didn't show on their database, and hospital staff previously did not thoroughly assess Anderson's mental health – but the state coroner put the blame solely on one man.\n\n\"The evidence is that Mr Anderson, and Mr Anderson alone, was responsible for causing Luke's death, whether he was suffering a mental illness or not,\" he said.\n\nPresenting his findings to a packed Coroners Court, where a framed photograph of Ms Batty and Luke sat on the witness stand, Judge Gray called for reductions in delays in police serving family-violence charges, executing warrants and serving intervention orders.\n\nHe said that wherever possible perpetrators should be assessed for mental health. Perpetrators were ultimately the ones who controlled family violence.\n\n\"Therefore it is critical that perpetrators become engaged, or are forced to engage, with the family violence system and the criminal violence system,\" he said.\n\nThe state coroner also recommended regulating risk-assessments of family-violence perpetrators, having police and agencies share information more efficiently, reviews of the bail and family violence acts, and expanding the work some magistrates courts have done on the links between the criminal cases and family violence.\n\nMs Batty said her former partner was never held accountable, despite intervention order breaches, failures to attend court and missed arrests by police who were not armed with essential information.\n\n\"The fact that Greg was able to play the system as a further act of power control speaks to me that the most important thing, moving forward, is how we stop perpetrators committing violence,\" she said.\n\nDescribing the delivery of the findings as a \"monumental day\", Ms Batty said the state coroner had highlighted the systemic failings in family violence, and that he understood the powerlessness she felt dealing with Anderson.\n\nMs Batty said her son had not died in vain – a point Judge Gray also made – and that she felt inspired more than ever to continue the work which earned her the Australian of the Year title, as governments began to grasp the magnitude of family violence.\n\n\"You want the violence to stop and right now we have not worked hard enough to get the violence to stop,\" she said.\n\nPolice and Corrections Minister Wade Noonan said it was incumbent on the government to accept the findings, and that perpetrators must be held to account.\n\n\"For too long there has been a victim focus rather than a perpetrator focus,\" Mr Noonan said.\n\nIn his findings, Judge Gray praised Senior Constable Paul Topham and police prosecutor Darren Cathie for their proactive policing in keeping colleagues updated of the case.\n\nBut he was also critical of a \"disturbingly relaxed attitude\" a detective showed towards arresting Anderson over child pornography charges in the weeks before Luke's death, despite having been given the man's address by Ms Batty.\n\nBut the detective, the court heard, had not been informed of an allegation Anderson produced a knife while in the car with his son in November 2012.\n\nJudge Gray found police and a Department of Human Services social worker were also too reliant on Luke's statement he did not fear his father in closing their files on Anderson.\n\nThe inquest was told the problems with Victoria Police's database which did not highlight outstanding arrest warrants to police who came in contact with Anderson have since been addressed.\n\nVictoria Police Assistant Commissioner Luke Cornelius told the inquest officers had responded appropriately to Anderson's increasingly erratic behaviour in the lead-up to the attack.\n\n\"No matter how effective our system might be, no matter how accurate we might be, if a man has murder in his heart ... we are not going to be able to prevent those deaths,\" Mr Cornelius said.\n\nWith Benjamin Preiss The story first appeared on The Sydney Morning Herald.", "source": "The Hepburn Advocate"}