{"published": "2015-09-03T11:00:53Z", "media-type": "News", "title": "Tikkurila to start co-operation negotiations to adjust its operations in Finland", "id": "7f7aaa34-2066-4fca-b352-45a0660cac4f", "content": "Tikkurila Oyj \nStock Exchange Release \nSeptember 3, 2015 at 2:00 p.m. (CET+1) \n \nTikkurila will start statutory co-operation negotiations with all of Tikkurila Oyj's personnel, currently totaling about 600 persons. \n    \nTikkurila Oyj's Vantaa site produces and sells decorative paints and industrial coatings for both the Finnish market as well as for export to Russia and other countries. About half of Tikkurila Oyj's revenue relates to exports. \n \nIn the negotiations to be started the estimated maximum headcount reduction is 100 persons. The target is to adjust the Finnish personnel to fit current volume level, and to find new, more flexible ways to introduce products and services that fit customers' needs. Moreover, the aim is to change operational and organizational structures and to ensure company's cost competitiveness. \n \n\"Our sales volumes have already for a long time decreased in both Finland and Russia, and we have tried to adapt to this trend without any significant changes in our headcount. However, as the situation in Russia has become more difficult and as both countries' economic situation is very weak, we have to adjust our operations and to carry out structural changes also in Finland,\" states Erkki Järvinen , President and CEO of Tikkurila Oyj. \n \nTikkurila Oyj \nErkki Järvinen, President and CEO \n \n\nFor further information, please contact: \nErkki Järvinen, President and CEO, mobile +358 400 455 913, erkki.jarvinen@tikkurila.com  \n \n\nTikkurila is the leading paints and coatings professional in the Nordic region and Russia. With our roots in Finland, we now operate in 16 countries. Our high-quality products and extensive services ensure the best possible user experience in the market. Sustainable beauty since 1862. \n \nwww.tikkurilagroup.com", "source": "SGV Tribune"}