{"published": "2015-09-10T15:13:50Z", "media-type": "Blog", "title": "This Egyptian Billionaire Offers To Buy An Island off Italy Or Greece To Rehouse Syrian Refugees", "id": "7108045b-c111-4d52-b6e2-389bebe4965f", "content": "This Egyptian Billionaire Offers To Buy An Island off Italy Or Greece To Rehouse Syrian Refugees Subscribe and get Galactic News Daily Updates:\rBy this point I’m sure most people have heard of the very alarming Syrian Refugee crisis. With an estimated 4 million refugees having fled the country since 2011, the United Nations is calling this the worst humanitarian crisis since World War II. What may have seemed like nothing more than a thinking out loud style tweet has quickly developed into something incredible, sounding more like something out of a movie than a real life response to crisis. Egyptian billionaire Naguib Sawiris tweeted the following on September first: Greece or Italy sell me an island,ill call its independence and host the migrants and provide jobs for them building their new country — Naguib Sawiris (@NaguibSawiris) September 1, 2015 He does recognize that his idea may seem a little crazy and farfetched, but he’s definitely seriously considering it, if his subsequent tweet is any indication. Crazy idea .. Maybe but at least temporary until they can return to their countries ??!! — Naguib Sawiris (@NaguibSawiris) September 1, 2015 Who Is Naguib Sawaris? Sawaris is the third richest man in Egypt – with a net worth of 2.9 billion dollars – and chairman of Orascom Telecom Media and Technology, an international telecommunications company from Cairo. In an interview with CNN, Sawaris said: It’s a very simple solution, they [Italy or Greece] sell the island to me. I’ll make a temporary shelter for these people, I’ll make a small port and a marina for boats to land there. I’ll employ the people to build their own places, their own houses … I’ll give them jobs and shelter [until their country is more stable], then once this is done, they can have the choice whether either to go back to their country or stay on this island, the problem is in the politicians. … all I need is the permission to put these people on this island.”\nRelated:  The Oracle Report Friday, June 19, 2015\nWhat’s The Catch? So far, there doesn’t seem to be one. Sawiris appears to be a genuine man with good intentions who wants to help (and just happens to have a few billion dollars to make it happen). In an interview with Forbes magazine, Sawaris said: “I am serious with my intentions, I want to feel good about having done something good, provide me with the island and I will do the rest. “ From reading several other twitter posts made by Sawaris, it becomes clear that this kind-hearted man was inspired by the death of Aylan Kurdi, the three-year-old boy who drowned off the coast of Turkey with his mother and brother. A picture of the boy’s body washed up on shore made media headlines and revealed the severity of this refugee crisis to the world. He intends to name the island after the boy. I found a name for the Island “ILAN “the young Syrian child thrown on turkish shore by the sea to remind us ! Now i need to find the Island! — Naguib Sawiris (@NaguibSawiris) September 5, 2015 Shortly after this tweet was made, another followed with a hashtag Sawiris had created for his endeavour, #aylanISLAND, and a call for volunteers to help with this extrememely ambitious project. #aylanISLAND Everyone who proposed to volunteer or help in creating #aylanISLAND pls email your proposed contribution to proposals@otmt.com — Naguib Sawiris (@NaguibSawiris) September 7, 2015 Sawaris has many people behind him who fully support his idea and want to help. Could it be the solution to this devastating crisis?\nRelated:  GERMANY FILES WAR CRIMES AGAINST BUSH, CHENEY, RUMSFELD ET AL\nMuch Love\nAll sources are imbedded within this article. -Alanna Ketler \"According to the “Fair Use” clause of International Copyright Law, the authors declare that the use of the photos, videos and information in this academic research are analyzed for purposes of “criticism, comment, news reporting, teaching, scholarship, or research” according to Section 107 of Title 17 of the US Code.\"\rRelated", "source": "Galactic Connection"}