{"published": "2015-09-07T12:31:53Z", "media-type": "News", "title": "World No. 1 Saina Nehwal eyes Japan Open title", "id": "39182bb7-03c9-4da1-aa46-c52c91d4a92d", "content": "Tokyo: After clinching a silver at the World Championship, world No. 1 Saina Nehwal will look to continue her rampaging form when she opens her campaign at the USD 275,000 Japan Super Series, which gets underway with the qualifiers here tomorrow. The 25-year-old Indian became the first Indian to win a silver medal at World Championship last month to regain her numero uno status and Saina will have her eyes trained on the coveted title.\n\nSecond seed Saina will open her campaign against Thailand's Busanan Ongbumrungpan on Wednesday and a win is likely to pit her against compatriot and two-time bronze medallist at the World Championship P V Sindhu, who will face Japan's Minatsu Mitani, ranked 18th, in the first round.\n\nIt could be the second clash of their career at the International stage after they met at the 2014 India Grand Prix Gold final, in which Saina had the last laugh.\n\nThe duo had come close to facing each other during the Indonesia Open Super Series Premier which was held in June this year. They were also on course for a collision at the semifinal stage during the 2014 India Open Super Series.\n\nSaina and Sindhu had played for the first time in a competitive match during the 2013 Indian Badminton League (IBL) representing Hyderabad Hot Shots and Awadhe Warriors respectively.\n\nIn men's singles, Commonwealth Games champion Parupalli Kashyap will square up against Japan's Takuma Ueda at the Tokyo Metropolitan Gymnasium. The world No. 8 Indian has beaten Takuma twice but the last time they met at the Singapore Open in 2013, the Japanese had the last laugh.\n\nWorld No. 4 Kidambi Srikanth will face off with Scott Evans of Ireland, while Dutch Open champion Ajay Jayaram will take on seventh seed Viktor Axelsen of Denmark and Indonesia master H S Prannoy will meet Wong Wing Ki Vincent of Hong Kong.\n\nWith World No. 2 Jan O Jorgensen withdrawing due to a stomach infection, India's B Sai Praneeth has been upgraded to the main draw and he will take on a qualifier in the opening round.\n\nIn women's doubles, Jwala Gutta and Ashwini Ponnappa, who recently won the Canada Open, will meet eighth seeded Chinese combo of Zhao Yunlei and Zhong Qianxin, while Pradnya Gadre and N Sikki Reddy will fight it out with Japanese top seeds Misaki Matsutomo and Ayaka Takahashi in the opening round. PTI", "source": "ZeeNews.com"}