{"published": "2015-09-24T15:04:05Z", "media-type": "News", "title": "10 things nurses want you to know", "id": "3fb97155-5f4d-473d-a641-ac817121daa0", "content": "We're tired, our feet hurt, but we love it.… \r \nNurses are a bunch of pretty complex people. \n\nI’ve often heard it said that there’s at least two sides to every nurse: the one you see on the ward, and the one going home to their family at the end of their shift. \n\nSome people might argue there’s also the nurse in the break room, the nurse in the ward round meeting the doctor, and of course, the nurse behind the mask not saying what they’re thinking \n\n… \n\nSo here are : \n\n1. You might think we don’t care, but we ALWAYS do \n\nNurses do a lot of things, and we may be rushing about the ward or flustered. Because we care about you, the first thing to slip is awareness of how we appear to others \n\n, \n\nWe’ve other, more important, things to think about – like keeping people alive \n\n! \n\n2. That said… we don’t want you here \n\nIn the nicest possible way, we wish you were at home, where you belong. Hospitals are rubbish places to be, but sometimes we need them and they’re the best place for us. \n\nHowever, home is usually more pleasant, so we’re going to do everything we can to make you feel better, so that you don’t need to be in hospital anymore. \n\nNot to mention, of course, the fact that we want you to feel better. \n\n3. You do matter… but so do our other patients \n\nWe prioritise our jobs according to need. Yes, you want a glass of water… but there might be a patient down the hall who’s bleeding, or who’s showing symptoms of a heart attack. \n\nThe most important thing we do is save lives – so if we’re a bit late bringing you what you’ve asked for, please forgive us… we can’t always guess when people are going to need us and how much, so we have to think on our feet. \n\n4. We won’t judge you \n\nIt’s in human nature to judge those around us, but nurses have to train themselves out of it. In the UK, it’s even part of the code of conduct set by the Nursing & Midwifery Council, which we have to adhere to in order to register and work as a nurse – no matter what you tell us, we can’t let it affect how we treat you. \n\nSo, please, be honest with us when we ask you how you are, or for information about your life. It may not seem relevant, but we don’t ask questions to be nosy, and not telling us things could impact our ability to help you get better. \n\n5. Yes, bodies are gross. No, we don’t mind (much). \n\nWhatever your body does (and whether it’s meant to do it or not) – we’re prepared to handle it. We knew what we were getting into when we chose this career, and yet we do it anyway. You don’t need to feel embarrassed – you’re far from alone. \n\n6. We don’t want to hurt you or make you uncomfortable \n\nWe know taking blood for a test is painful, that blood pressure cuffs are uncomfortably tight and that you don’t want to wake up every four hours so we can test your vital signs. We know. \n\nPlease understand that if we didn’t have to, we wouldn’t \n\n! \n\n7. We believe you \n\nIf we ask you how much it hurts, and you tell us it’s an 8 when you really mean a 10… we might not give you the painkillers you need. We know that pain is subjective, so if this really is the worst pain you’ve ever felt? Tell us, and we’ll fix you up with what you need to make it better. We trust you to know. \n\n8. Ask us questions \n\nYour nurse isn’t just the doctor’s lackey – they should know why…", "source": "MyInforms"}