{"published": "2015-09-16T15:00:35Z", "media-type": "Blog", "title": "5 Task Marketplace Themes for WordPress", "id": "126d3027-057d-4d26-a76d-0763e0b3562c", "content": "September 16th in WordPress Themes by Wordpress Jedi . For more, please follow us on: Facebook, Google+, or Twitter\nMicro job sites have been around for quite a while. They give businesses access to talent for simple tasks. If you are not satisfied with Fiverr and other jobs sites on the Internet, you could always build your own job site. These 5 task marketplace themes can help: TaskerDev: this WordPress theme lets you create a site to allow your visitors to buy or sell services. It is responsive and offers an escrow feature, private messaging, a feedback system, and support for multiple payment gateways. Taskerr: lets you connect people who need jobs done with those looking to do them. It has a modern design and provides you with plenty of opportunities to monetize your site. It is powered by the Foundation framework. HireBee: a clean WordPress theme for job sites. It supports flexible pricing plans. It provides your users with a workspace to communicate with their clients or freelancers. The theme is escrow ready and has credit plans. FreelanceEngine: a freelance marketplace theme with a responsive design. You can charge for regular and featured projects. The theme is escrow ready. Pricerr: lets your visitors buy and sell tasks on your website. It offers Twitter & Facebook integration. Bitcoin is also supported. Which one of these themes are you impressed with the most? Tagged as: best themes You may also be interested in: 7 WordPress Themes for Micro Job Sites 7 Awesome Freelance Marketplace WordPress Themes HireBee Theme for Freelance Directories 18 WordPress Themes for Job Search Sites FreelanceEngine: Freelance Marketplace Theme You may want to check out: Follow @wpblackbelt\r*some of our articles might include aff links to fund our operations. Please read our disclaimer on how we fund Exxponent.", "source": "WP Solver"}