{"published": "2015-09-04T04:29:58Z", "media-type": "News", "title": "Attorney: Texas man hit deputy with blunt end of knife", "id": "773e1277-03eb-4e2b-8a6c-b3388bf4a174", "content": "The man shot dead by police last week outside his Texas home had hit one of the officers with the butt end of a knife, the lawyer for the family of Gilbert Flores said Thursday. \n\nBut Thomas Henry said experts the family has working on the case have \"serious concerns\" about whether Flores was an imminent threat to two Bexar County deputies who had their handguns pointed at him and shot him. \n\nIf the threat was gone, he said, \"you can no longer use deadly force.\" \n\nHenry said Flores had a knife in his hand as police officers investigated a domestic disturbance call at the family's San Antonio home. Flores' wife had been injured earlier and the 911 call was warranted, Henry said. But Flores hadn't used a knife against her, the attorney added. \n\nHenry also said a report that a baby had been injured was inaccurate. \n\nThe lawyer said he has yet to see a second video that also shows Flores' interaction with police and the moment he was shot. Authorities have not released the video to the media or public. \n\nA video that was posted online Monday by CNN affiliate KSAT shows Flores raising his arms as he stands in front of the officers. In that video, shot by a passing motorist, Flores' left arm is obscured by a pole. \n\nThe first video provides a stark, long-distance view of Flores. The second video is longer and is recorded from a different angle than the cell phone video that has been shown by the news media, Bexar County Sheriff Susan Pamerleau said Wednesday. \n\nThe sheriff said the video shows Flores with \"something in his hand.\" \n\n\"We believe it was a knife,\" Pamerleau told reporters. \n\nThe video, recorded by a neighbor, shows suspect Gilbert Flores acting \"wildly aggressive,\" a source with knowledge of the investigation told CNN. The footage also shows the suspect charging one officer with a knife at one point and also shoving chairs at an officer, the source said. \n\nAuthorities have declined to comment on whether they found a knife at the scene. \n\nThe deputies, who are on administrative leave, are Greg Vasquez and Robert Sanchez, the sheriff's office has said. \n\nCNN's efforts to contact them have so far been unsuccessful. \n\nEach has been with the sheriff's office for more than a decade, Pamerleau said. Neither deputy involved in the shooting was wearing a body camera. \n\nFlores had previous run-ins with the law. He was cited for possession of marijuana in 1995, criminal trespassing and aggravated assault in 1999, and aggravated robbery in 2003. \n\nThe incident comes at a time when law enforcement officers are under scrutiny for how and when they resort to lethal force. The killings of several people by police over the past year have heightened tensions with the communities they serve, especially among minorities.", "source": "ElPasoProud"}