{"published": "2015-09-01T22:53:13Z", "media-type": "Blog", "title": "America, Iran and The End Times", "id": "979d629a-8e6d-4132-909a-e472defa10cb", "content": "The growing trouble that Iran is causing in the world today isn't an aberration. It was foretold nearly 2,600 years ago by the Hebrew prophet Daniel while he was in exile with the Israelites in ancient Babylon.\nThe Israelites were taken into exile in about 586 B.C. by Babylonian King Nebuchadnezzar who was used by God to administer judgment against the Jewish nation for her chronic rebellion against Him and her antipathy to His laws. The Persians later succeeded the Babylonians and continued to hold the Jews captive until about 445 B.C. when Darius II issued a decree to allow them to return home.\nWhile the Jews were still being held in Babylon under Nebuchadnezzar's son, King Belshazzar, Daniel received an allegorical vision from God concerning a distant future time when Persia would become a powerful nation that would threaten the entire world. In the vision, Daniel saw a powerful two-horned ram take on and defeat all of its challengers until a shaggy, one-horned goat arrived from a distant land to destroy it.\nHere's what Daniel saw and described: \"In my vision I saw myself in the citadel of Susa in the province of Elam; in the vision I was beside the Ulai Canal. I looked up, and there before me was a ram with two horns, standing beside the canal, and the horns were long. One of the horns was longer than the other but grew up later. I watched the ram as it charged toward the west and the north and the south. No animal could stand against it, and none could rescue from its power. It did as it pleased and became great.\" (Daniel 8:2-5)\nThe Ulai Canal was located in the ancient Persian city of Susa. Daniel recognized the geography, but he was puzzled by the symbolism of the two-horned ram.\nThen, the vision continued: \"As I was thinking about this, suddenly a goat with a prominent horn between its eyes came from the west, crossing the whole earth without touching the ground. It came toward the two-horned ram I had seen standing beside the canal and charged at it in great rage. I saw it attack the ram furiously, striking the ram and shattering its two horns. The ram was powerless to stand against it; the goat knocked it to the ground and trampled on it, and none could rescue the ram from its power. The goat became very great, but at the height of its power the large horn was broken off, and in its place four prominent horns grew up toward the four winds of heaven.\" (Daniel 8:5-8)\nAfter the goat's horn was broken off, Daniel saw a small horn sprout up among the four horns that replaced the prominent horn on the goat. Here's how Daniel described it: \"Out of one of them came another horn, which started small but grew in power to the south and to the east and toward the Beautiful Land. It grew until it reached the host of the heavens, and it threw some of the starry host down to the earth and trampled on them. It set itself up to be as great as the commander of the army of the Lord; it took away the daily sacrifice from the Lord, and his sanctuary was thrown down. Because of rebellion, the Lord's people and the daily sacrifice were given over to it. It prospered in everything it did, and truth was thrown to the ground.\" (Daniel 8:9-12)\nDaniel was puzzled by the vision until the archangel Gabriel appeared and explained it to him: \"I am going to tell you what will happen later in the time of wrath, because the vision concerns the appointed time of the end. The two-horned ram that you saw represents the kings of Media and Persia. The shaggy goat is the king of Greece, and the large horn between its eyes is the first king. The four horns that replaced the one that was broken off represent four kingdoms that will emerge from his nation but will not have the same power.\" (Daniel 8:19-22)\nThe fact that Gabriel appeared and interpreted the vision to Daniel means the prophecy had special significance. Gabriel is one of the Lord's most powerful angels who stands in His presence. And he brings extremely important messages from the Lord concerning major events that will take place on the earth. It was Gabriel who appeared to Mary to announce that she would give birth to the Messiah Jesus Christ. (Luke 1:26) Thus, Gabriel's visit to Daniel tells us that the vision the prophet received was vital and necessary to be recorded for future generations to study and understand.\nGabriel then finished interpreting the vision with these words: \"In the latter part of their reign, when rebels have become completely wicked, a fierce-looking king, a master of intrigue, will arise. He will become very strong, but not by his own power. He will cause astounding devastation and will succeed in whatever he does. He will destroy those who are mighty, the holy people. He will cause deceit to prosper, and he will consider himself superior. When they feel secure, he will destroy many and take his stand against the Prince of princes. Yet he will be destroyed, but not by human power.\" (Daniel 8:23-25)\nWhat relevance does Daniel's vision have for today? It has extreme relevance because the vision is being fulfilled in our time. Gabriel revealed that the two-horned ram represented the kings of Media and Persia. Those two ancient kingdoms were located in what is now Iraq and Iran. The ram also represents Islam while its two horns represent Shia and Sunni Islam. But who does the one-horned goat represent?\nHere's where the prophecy gets interesting. The goat represents a coalition of gentile nations, with the prominent horn, according to Gabriel, representing \"the king of Greece.\" We know the modern identities of Media and Persia. But Greece? Isn't modern Greece militarily weak and financially insolvent? How could that nation possibly fulfill the prophecy? It can't. The prophecy is so baffling that many biblical scholars believe that it was fulfilled in 331 B.C. when Alexander the Great invaded and conquered Persia.\nBut that event couldn't have fulfilled the prophecy because it wasn't the time of the end. When Alexander invaded Persia, Christ's appearance on earth was still over three centuries away. How then can we explain the prophecy? Was it flawed, or was it false? It was neither.\nIn order to interpret the prophecy, we have to understand that Greece was the most prominent gentile nation on earth in the ancient times. The gentiles were often referred to as Greeks and vice versa. In fact, the apostle Paul occasionally interchanged the two in his epistles. Here's an example: \"There is neither Jew nor Greek (gentile), slave nor free, male nor female, for you are all one in Christ Jesus.\" (Galatians 3:28)\nAnother relevant factor is the proximity of literal Greece to Iran. Literal Greece exists to the northwest of Iran while the nation identified as Greece by Gabriel in Daniel's vision comes from the far west to confront Media and Persia. Furthermore, Daniel witnessed the metaphorical goat come from a distant land without touching the earth. (Daniel 8:5) This indicates that Iran will be attacked either by fighter jets and or long range missiles.\nBut who is this nation? That nation is the United States that still possesses the most potent military and nuclear arsenal on earth. And some U.S. military officials have admitted in recent years that the only way to stop Iran from threatening the world is via a military invasion. And Iran recently became a much bigger threat to the world with the terrible deal the U.S. negotiated with the Islamic regime.\nThe deal lifted economic sanctions and arms embargoes against Iran, and allowed the regime to dictate the terms of inspections of its nuclear facilities.\nIt was a horrible deal that strengthened Iran and brought us closer to the fulfillment of Daniel's vision. Certainly, under the Obama administration, the U.S. will never launch an attack against Iran because the Obama administration loathes war. But another president in the future--perhaps the next one--will be forced to confront and destroy Iran before the Islamic regime begins launching missiles against Israel, Europe and the United States.\nIt's important to understand that Daniel's vision also reveals that the \"king of Greece\" will be \"broken off\" after its successful invasion of Iran. That means the U.S. is going to fall as a world superpower and be replaced by four nations. (Daniel 8:22) What nations could those be? They will likely be Russia, China, India and either France, Germany or Italy.\nIt's also important to understand that the Antichrist will eventually come from one of these four nations. (Daniel 8:9-12) The nation that this wicked ruler is likely to come from is Russia that's identified by both Daniel (Daniel 11) and Ezekiel (Ezekiel 38-39) as the major source of trouble for Israel and the world in the last days.\nIt's no secret that under President Vladimir Putin, Russia is upgrading its military and nuclear arsenal. Putin has predicted that Russia is going to become the most potent military force on earth. Despite Russia's sagging economy, Putin's administration has committed to spending $700 billion to renovate and upgrade Russia's military, nuclear arsenal, fleet of nuclear subs and ICBM technology by 2020.\nBut don't the Russians and the Iranians have close economic and political ties? They do. Then why would Russia sit back and allow the U.S. to invade Iran? Because Russia's relationship with Iran is mainly an economic one. The Russians need money and they sell military hardware and nuclear technology to Iran for economic purposes. The Russians will only allow the U.S. to take out the current Iranian regime if Russia is allowed to rebuild Iran and select its new government that would be controlled by Moscow.\nWhat role will Israel play in these events? The Jewish nation is going to survive because the Islamic regime in Iran is going away. That's God's purpose in raising up the U.S. to destroy Iran. And after the U.S. falls from power, Israel will likely seek a new powerful political partner in Russia. Remember that the Antichrist will eventually defile the rebuilt Jewish Temple in Jerusalem. (Daniel 9:27, Matthew 24:15, 2 Thessalonians 2:4)\nSo Israel is going to play a significant role in end time world affairs leading up to the return of Jesus Christ.\nBut before that happens, the United States and Iran have a date with destiny, as foretold by the prophet Daniel nearly 2,600 years ago.", "source": "Prophecy Review Today"}