{"published": "2015-09-28T05:04:40Z", "media-type": "News", "title": "FSU defense ready to get back to business", "id": "f8e25f18-a8e9-47a5-b8bb-fbb2bd2e9b75", "content": "TALLAHASSEE | Through three games, Florida State’s defense has shown signs of improvement. That will need to continue going into the toughest part of its schedule.\n\nFollowing last weekend’s bye, the 10th-ranked Seminoles will play nine consecutive games including hosting Miami on Oct. 9 and trips to Georgia Tech (Oct. 24) and Clemson (Nov. 7). Should Florida State win the Atlantic Division for the fourth year in a row, it would be 10 straight.\n\n“We’ve been preparing for it the whole offseason. That’s why we practice the way we do,” linebacker Terrance Smith said. “It’s nothing that we can’t handle. We’ll be ready for it.”\n\nThe Seminoles had to hear all offseason about their defensive lapses last year. After having a dominant unit during the national championship season of 2013, the Seminoles had five games last year where they allowed 30 or more points and allowed opponents to average nearly 400 yards per game. The pass rush was non-existent; it had just 17 sacks, the lowest since 2001.\n\nAfter a 14-0 win at Boston College Sept. 18, Florida State is sixth in the nation in scoring defense with 30 points allowed. They have allowed only seven the past six quarters and posted the program’s first road shutout since 2003.\n\nMany have wondered if defensive coordinator Charles Kelly has changed certain schemes, but safety Nate Andrews said it is more about players taking more responsibility.\n\n“We decided that we want to run to the ball and not give up on plays,” Andrews added. “If we give up a 10-yard run we’re mad about it. We just want to stop teams and we’re going into the game like we need to stop this guy. We need to stop this team. We still run the same plays. We just run to the ball now.”\n\nThe biggest noticeable improvement has been a consistent pass rush. The Seminoles have six sacks in their first three games, which in turn led to a big decrease in big plays. In wins over Texas State, South Florida and Boston College, Florida State allowed only four pass plays of 20 yards or more, tied for 10th in the nation.", "source": "Florida Times-Union"}