{"published": "2015-08-13T17:56:59Z", "media-type": "News", "title": "[REVIEW] Amy", "id": "8df67776-be0a-4599-a36c-f7eda46a1b14", "content": "•  • Arts , Music , Pop Culture , Reviews \n \nIf you haven’t seen the trailer for Amy yet, go watch it now. The recent documentary from director Asif Kapadia is a haunting sketch of the life of Amy Winehouse that revives her music for new fans, and gives former fans the second dose of Winehouse they had all been waiting for. \n \nThe film traces the artist’s rise and fall from her teenage beginnings as a jazz club frequenter, to her international fame with the Grammy Award-winning Back to Black , and finally to her tragic overdose at the age of 27. \n \nWith footage from home videos, television and radio interviews, and heartbreaking post-mortem interviews with her closest friends and relatives, the film gives an explicit glance into the tragic and not so uncommon life of a high-profile celebrity. \n \nAs a longtime Amy Winehouse fan, I was unsure of what to expect from the film. My interest in her was mostly confined to her music, and I knew little about her life aside from her public battle with addiction and her death five years ago. \n \nWhile her music has clear reference to her struggles with mental illness, broken relationships and drug use, a clear portrait of her experiences has never before been available to the public. This glimpse into her life gives a new meaning to her lyrics that makes her music even more powerful than it was to begin with. \n \nAmy Winehouse grew up in London, England, where she started her career as a jazz singer. She lived in a middle-class home with a set of friends that would stick around until her last days. Her story does not sound uncommon or tragic when first told, but as she aged, fell into depression, became reliant on drugs and alcohol, and lived a life exploited by the public, a great talent grew smaller. \n \nA powerful aspect of the movie is its ability to couple Winehouse’s experiences with the corresponding music she wrote in those moments. The film will go into detail about a part of her life, such as the on-again off-again relationship with her eventual husband Blake, and follow the scene with a live recording of the song reflecting this time in her life. The documentary does a beautiful job at highlighting lyrics with elegant script up against record studio footage and scribbled poetry in notebooks. \n \nOne of the most tragic parts of the film comes when hearing from her parents. They both noticed her depressive behavior, but shrugged it off as a passing phase as opposed to addressing it. Her mother was made aware of her daughter’s lifelong struggle with Bulimia when she was a teenager, but didn’t see anything wrong with the behavior until much later in her life. Her father acknowledges that his absence from home and the affair that kept him away from his family led to her early substance abuse, yet he never made an effort to get her help until it was too late. \n \nSeeing how the people closest to her reacted to her struggles was devastating. It all made her death seem inevetable rather than preventable. \n \nIt would have been nice to see more about her early musical influences rather than just elements of her personal life, but the film does touch upon her young love of jazz and its influence on her first recordings. \n \nPrevious fans as well as those unfamiliar with her music and story can enjoy the film. It is a well-made documentary that does a lot with found footage and conveys a tragic yet compelling story that any music fan would appreciate. \n Comments", "source": "McMaster University Sil"}