{"published": "2015-09-29T20:41:00Z", "media-type": "News", "title": "Fred Anderson Toyota launches long term sale", "id": "8e503ab4-1f20-46f7-aa91-8e68b8118725", "content": "RALEIGH, N.C. , Sept. 29, 2015 /PRNewswire-iReach/ -- The sales staff at Fred Anderson Toyota is committed to helping customers find the best Toyota vehicle to meet their needs at a price as friendly to the customer's budget as possible. Many other dealerships take a short view and offer deals and discounts that expire in only 30 days or so. Fred Anderson Toyota is taking a longer view and has  selected five popular Toyota vehicles  and have set the sales incentives to last until November. Shoppers thinking about making a new vehicle purchase will have nearly eight weeks to do their due diligence and research for their next purchase.  \n\nPhoto - http://photos.prnewswire.com/prnh/20150929/271827  \n   \nUntil Nov. 11 , shoppers at Fred Anderson Toyota can choose among the 2015 Toyota Corolla, Tacoma PreRunner, Prius Family, RAV4 XLE and 2016 Toyota Camry at some of the lowest prices and lease terms to be found in the area. Each one of these vehicles is a leader in its class and has the kind of performance, efficiency or capability to be able to draw buyers new to Toyota products.  \n\nSharp styling, a wealth of options and excellent fuel-economy are clearly on display with the 2015 Toyota Corolla. Featuring an automatic transmission, Fred Anderson Toyota customers will have an up tempo driving experience as well a Environmental fuel economy scores that come very close to 40 miles per gallon. The 2015 Corolla also has an impressive list of standard feature including cruise control, power accessories and air conditioning. Fred Anderson Toyota is offering the 2015 Corolla starting at $14,990 .  \n\nThe 2015 Toyota Tacoma PreRunner is a special version of the popular midsize pickup truck. Not only does it offer the flexibility and capability people demand but it also comes with the kind of components to make it a formidable off-road vehicle as well. Qualified buyers can lease the 2015 Tacoma PreRunner for $217 per month with a 36-month lease. Also available is the 2015 Toyota RAV4 XLE. As the middle-of-the-road trim, the RAV4 XLE offers more premium features than base versions like fog lights, heated side mirrors and a sunroof. The popular compact crossover SUV can be leased for $209 per month for 36 months.  \n\nWithout question, the Toyota leader in fuel-economy will come with one of the several options available with in the 2015 Toyota Prius Family. As a group these vehicles can offer better than 50 miles per gallon in the city and can offer enough cargo space to rival that of small SUVs. Prices for the available Prius inventory at Fred Anderson Toyota starts at $15,990 .  \n\nWhenever the  new model-year of the Toyota Camry  arrives to Fred Anderson Toyota, an increase in foot traffic almost always follows. In its second year of a new radically changed body-style, the 2016 Toyota Camry at the Raleigh, NC dealership has a base price of $18,990 . Even at this level, shoppers considering this outstanding midsize sedan will have an excellent list of standard features.  \n\nThe entire Fred Anderson Toyota inventory can be viewed at the dealership's website,  www.fredandersontoyota.com . The showroom is located at 9101 Glenwood Avenue Raleigh, NC 27617. Anyone with questions about the discounts available at Fred Anderson Toyota may  contact a sales professional today  by calling 919-890-3634.  \n\nMedia Contact:  Andy Little , Fred Anderson Toyota, 919-890-3634, fatoyotaraleigh@anderson-auto.com  \n\nNews distributed by PR Newswire iReach: https://ireach.prnewswire.com  \n\nSOURCE  Fred Anderson Toyota", "source": "SearchBug"}