{"published": "2015-09-02T03:18:24Z", "media-type": "News", "title": "Yahoo CEO plans on returning to work only 2 Weeks after Birth of Twin Girls", "id": "3630d645-0635-4a99-81c0-b938ddb95d48", "content": "She sparked controversy in 2012 when she returned to work just 2 weeks after giving birth to her son. Now, Yahoo CEO Marissa Mayer plans on taking a short 2 week maternity leave again despite expecting twin girls. \n\nThough the official maternity leave for Yahoo is 16 weeks, Marissa had this to say via her Tumblr page ; \n\nWith great happiness, Zack and I have some exciting news to share – I’m pregnant! In fact, I’m expecting identical twin girls, likely arriving in December. The twins part was quite a surprise, because I have no family history of twins or any other predisposing factors. However, as I’ve now learned, identical twins occur by random chance in roughly 1 out of approximately every 300 pregnancies. Zack and I have embraced the surprise and are very excited about these new additions to our family. \n\nSince my pregnancy has been healthy and uncomplicated and since this is a unique time in Yahoo’s transformation, I plan to approach the pregnancy and delivery as I did with my son three years ago, taking limited time away and working throughout. I’ve shared the news and my plans with Yahoo’s Board of Directors and my executive team, and they are incredibly supportive and happy for me. I want to thank them for all of their encouragement as well as their offers of help and continued support. \n\n40 year old Mayer is one of the leading female CEOs in the world and her decision is once again sparking a major discussion. Some are commending her on not allowing her personal life interrupt her work while others are criticising her decision for setting unrealistic expectations for new mothers. \n\nThoughts? \n \nLiving & Celebrating the African Dream! \nCatch all the Scoop on www.bellanaija.com \n\nFollow us \nTwitter : @bellanaija \nFacebook : @bellanaija \nInstagram : @bellanaijaonline", "source": "BellaNaija"}