{"published": "2015-09-30T14:00:00Z", "media-type": "News", "title": "Pizza Patron Opens Fourth Store in Austin, Texas", "id": "6be40f83-2e82-4c34-aecd-d1c1bd0b263c", "content": "AUSTIN, TX -- (Marketwired) -- 09/30/15 --  Pizza Patrón, widely known for its PIZZA POR PESOS® program, announced the opening of its brand new Austin restaurant located at 3909 N. Interstate 35. The store was opened by Pizza Patrón veteran franchisees Cibreo Centro, LLC. \n\nIn the Delwood Shopping Center, the store is open from 11 a.m. to 10 p.m. Sunday through Thursday, and 11 a.m. to midnight Fridays and Saturdays. Call-in orders can be placed by dialing 512-467-9191. \n     \n\"We are so excited to keep growing in Austin,\" said Joe Skenderian, Pizza Patrón franchisee. \"This is a fantastic location in a shopping center anchored by Fiesta, right off of I-35. This center is heavily shopped by our target Hispanic demographic as well as the students living nearby.\" \n\nThis is the 12th store for Skenderian, the fourth in Austin; his other stores are located in Laredo, Dallas and Denton county. \n\n\"We have spent a lot of time and energy over the past couple years focusing on improving the health of our system,\" said Andrew Gamm, executive vice president of Pizza Patrón. \"Exceptional franchise partners like Joe Skenderian have been very instrumental in helping us develop strategies to improve the unit economics for everyone in our system.\" \n\nPizza Patrón makes its signature dough from scratch in every store daily. The pizza sauce starts with fresh-packed, crushed Roma tomatoes and marinates for at least 24 hours with the company's secret blend of spices and herbs. Some of the menu items the new store will feature include large pepperoni pizzas for only $5.99 every day, QuesoStix, Fiesta Wings, Patrón Dips and large specialty pizzas like 'La Patrona' (supreme pizza) at $8.99 every day. \n\nAbout Pizza Patrón \nSince 1986, Pizza Patrón has been committed to making its promise of \"Más Pizza. Menos Dinero.®\" a reality for every customer. From the beginning, the brand has been recognized for its 'fresh-dough' pizza, its low prices and its trademark \"friendly, bicultural service.\" In 2007, the company drew international media attention with its PIZZA POR PESOS® program when it began accepting Mexican Pesos at all of its restaurants. In 2012, the company's PIZZA POR FAVOR promotion that gave free pizzas to anyone who ordered in Spanish sparked international news coverage and lively debate throughout the U.S. Today, Pizza Patrón is the leading Mexican pizza brand in the U.S. and remains dedicated to bringing its unique experience to life with every pizza made, and in every community it serves. \n\nWebsite - www.pizzapatron.com \nFacebook - http://www.facebook.com/pizzapatron \nTwitter - http://www.twitter.com/pizzapatron \n\nImage Available: http://www2.marketwire.com/mw/frame_mw?attachid=2895722 \n\n\nContact: \nSandy Bell \nPhone 972-800-1745 \nEmail Contact", "source": "Town Hall"}