{"published": "2015-09-22T08:06:27Z", "media-type": "News", "title": "Transport boss wins ITS award", "id": "c5b6e7d4-ee6f-4496-b923-831abe5080ea", "content": "The chief executive of the Ministry of Transport, Martin Matthews, has won an recognition for his championing of intelligent transport. \n \nMatthews has been recognised with the World Congress on ITS Hall of Fame Lifetime Achievement Award for his leadership in the transport technology sector. \n \nThe ministry and other government agencies developed the New Zealand Intelligent Transport Systems Technology Action Plan, which also won a Hall of Fame Award last year. The action plan identifies 42 key areas where the Government has an essential role to play in advancing the adoption of ITS technology in New Zealand. \n  \n“ITS technology will create dramatic improvements in the safety, environmental performance and efficiency of the transport system,” Matthews says. “The Ministry of Transport is working to ensure New Zealand’s regulatory system and transport infrastructure are ready for new transport technologies to be tested and deployed in New Zealand.” \n \nMatthews is challenging the transport sector to think about how people and freight might travel in future, and how transport technology will create changes. He believes transport technologies will provide new ways to solve transport problems, like traffic congestion, over the next 30 years. \n \n“New Zealand could be at the forefront of these technological changes, if we play our cards right,” he explains. “To be at the forefront, we need to be open to new ideas and approaches that intelligent transport systems offer us, and create an environment that enables ITS technology solutions.” \n \nIntelligent transport systems apply information, data processing, communication, and sensor technologies to vehicles (including cars, trucks, trains, aircraft and ships), transport infrastructure and transport users to increase the effectiveness, environmental performance, safety, resilience and efficiency of the transport system.", "source": "Car and SUV"}