{"published": "2015-09-27T06:52:38Z", "media-type": "News", "title": "An Eternal Hero Ram by Mamta Bhatt, book gets launched by Actor Nana Patekar", "id": "1d435016-6f32-45b1-893f-e342ac977ac2", "content": "Previous story:  \nCity Youth Rohit Kandakatla elected VP of IFEES at World Engineering Education Forum held in Italy \n   Next story:  \nPublic WiFi hotspots to be expanded: PM Mumbai: Author Mamta Bhatt of the  “Warriors of Kurukshestra” book fame is back, with her second book “The Eternal Hero – Ram”. On the lines of WOK, the second offering from the author too, is keeping in mind young readers of the age group of 9- 14 yrs. \n \nThe unveiling of the book took place at Shanmukhanand Audi, Sion, Mumbai and over 1200 people applauded and cheered as the young author announced her second offering. It was a musical and fun filled event with Actor Nana Patekar, Hockey Star Mir Ranjan Negi, followed by power packed and soothing performances by Singing Maestros Anup Jalota & Suresh Wadkar amongst others, the evening was hosted by the ever resonating voice,  Harish Bhimani. \n \nThe Author was overwhelmed to receive a wonderful response from the audience and exclaimed her thoughts by saying, “I received an overwhelming response from thousands of readers and fans from all over the country. Some after reading the book and some, who were witness to my reading sessions on the great epic. I always looked up to our great Indian epics and feel, the energy, the wisdom, the learnings that we can obtain from these, can be matched by no other medium.” \n \nAbout the Author: \n \nMamta works as the Director – Legal with the BJN Group for the last 10 yrs and has been closely involved in the expansion of the group hotel chains all over the country. Having a total corporate experience of over 20 yrs and having worked with several law firms prior to this and being a practicing advocate, Mamta completed her graduation from the University of Mumbai with dual degrees in B.A, LLB. Mamta hails from Uttarakhand and Rishikesh is her hometown. \n \nBeing a lawyer, writing comes naturally to me. All the while drafting legal documents and writing legal articles, I didn’t think that one day I would be writing stories of the Mahabharat and Ramayan for children. Rishikesh, Uttarakhand, my hometown where the magical moments spent in my childhood by the river Ganga, deeply immersed in reading the great epics to my siblings remained with me through the years. The childhood passion of storytelling resurfaced as I wanted to share the values taught by the great epics. My bookworm son, Shaan was 12 when he first discovered stories from the Mahabharat, and stumbled upon stories of Dronacharya, Arjun and Bhim. After devouring these stories, he decided to read the entire Mahabharata. Our search for a version of the epic that was apt for young readers were either a 100-page book or that was a little lengthy and complex for children of this age group. The thought that our children want to read the stories of our tradition led me to this pursuit… In that same quest, I present my second book “An Eternal Hero – Ram”. It’s the story of Ramayan, and attempts to bridge the ever-growing gap between today’s generation and ancient Indian stories and values. The story teaches us important life lessons without us realizing it. You begin to identify with the characters. The plot, subplots and events have interesting scenes where the truth about human nature in the game of karma, choices, and destinies are showcased. Throughout the plot, you will see that Gods, demons, humans and the other species being driven by their egos. Only to realize that the only power that can bring justice and wellbeing for all is the Supreme One! \n \nSource : Lokesh Shastri", "source": "APN News"}