{"published": "2015-09-14T14:48:44Z", "media-type": "News", "title": "Dry Weather Likely Shaved Soybean Bushels", "id": "6233eb0f-2a35-43de-8bd2-fdb4f4abc377", "content": "By Chad Lee, Extension Professor and Agronomist \n\nThe wet weather early combined with cooler temperatures set us up for what should be an excellent corn crop. The drier weather recently likely hurt soybean yields. July 2015 was the wettest July on record for Kentucky with almost 9 inches of rain: link. July temperatures were essentially average. \n\nSeed fill may have been hurt by the hot, dry weather. \n\nThe last week of August and first week of September had warmer weather (14 days with average temperatures of 78 to 80 F) and inadequate rainfall to keep up with the temperatures and crop demand link. \n\nThe statewide corn crop is matured enough before the dry spell that the dry weather probably had minimal impact on final yields. Nitrogen loss in some areas and higher disease pressure this season cost us some bushels in some fields as well. Corn yields should be excellent across Kentucky with perhaps the eastern part of the state being hurt the most from this dry weather. \n\nSoybeans could be a different story. The majority of the soybean crop was in seed fill during this dry weather. The latest USDA Crop Progress report says that more soybeans are turning color and dropping leaves compared with last season. My guess is that 10% or so of those soybeans have started to turn yellow prematurely. Other soybean fields have turned a blue-green or gray-green color implying that they are out of water.  Most of the state received between 0.5 to 1.0 inch of rain last night (September 9 and 10, 2015). That rain will help soybeans that are still green, but probably will do very little for soybeans that already turned yellow. Those soybeans that turned to the blue-green or gray-color also lost yield. But the rains will help them.  \n\nIf you see soybean fields with green stems this year, the cause could be poorly timed weather. Green stem occurs when the crop has more photosynthate in the stems than the seeds can use. This season started out very well and allowed soybeans to build some really large plants. Those plants produced a lot of photosynthate expecting to produce very high yields. Then the dry weather hit and reduced seed number and seed fill. The plants were left with a build-up of photosynthate and not enough seeds to use all of it. That poor timing of dry weather could cause green stem syndrome.  \n\nA lot of our double-crop acres were planted late this year. Those soybeans were already racing the clock against fall freeze events. This dry weather spell did not help. The rain we received yesterday and the rains in the forecast will help some.", "source": "Farms.com"}