{"published": "2015-09-17T07:15:53Z", "media-type": "News", "title": "Blood pressure research by scientist Anna Ahimastos retracted over faked data", "id": "1031a6fc-afd2-4e55-9785-1a23ba0ed49b", "content": "Blood pressure drug Ramipril was found to be safe. But then an investigation found trial data was fabricated. \n\nThe research of a promising Australian scientist has been retracted after an investigation found she faked results in the trial of a blood pressure drug.\n\nDr Anna Ahimastos was a researcher at the Baker IDI Heart and Diabetes Institute in Melbourne when she fabricated data that was published in two international journals.\n\nOn Tuesday, the Journal of the American Medical Association (JAMA)retracted Dr Ahimastos' paper on a three-year clinical trial of a blood pressure drug, Ramipril. The study found the drug, a safe and effective treatment for lowering blood pressure, also helped patients with artery disease walk for longer and with less pain.\n\nWhile the study has been retracted, Baker IDI said participants involved in the trial were not exposed to any danger. Subsequent studies also suggest the original finding may still be correct.\n\nIn June, another Baker IDI researcher noticed inconsistencies in the original study data, which promoted an internal investigation.\n\nBronwyn Kingwell, the head of the laboratory where Dr Ahimastos worked, said during the investigation Dr Ahimastos admitted to making up data about several patients that did not exist. She resigned in July.\n\nA note from the paper's other authors to the JAMA journal editors said Dr Ahimastos was the person \"responsible for data collection and integrity for the article\".\n\n\"No other coauthors were involved in this misrepresentation,\" the note read.\n\n\"All authors recognise the seriousness of this issue and apologise unreservedly to the editors, reviewers and readers of JAMA.\"\n\nProfessor Kingwell said while data collected from study participants in Melbourne had been compromised, the information gathered from patients in Townsville and Brisbane was credible.\n\n\"What we hope to do in the fullness of time is reanalyse that data independently and get a research finding from that,\" she said.\n\nA smaller subsequent trial also found that ramipril improves patient with walking time.\n\nProfessor Kingwell said while this was an isolated event, the institute was reviewing its practices around how investigators report study data and results to prevent this type of incident recurring.\n\nShe said Dr Ahimastos had a PhD, 10 years of experience and was trained in good clinical practice, making her well qualified for the job.\n\n\"We work in a high-trust environment as a team and each individual has serious responsibilities,\" Professor Kingwell said. \"Unfortunately [in this instance] the individual who breached [this trust] was the one who had responsibility for the data collection.\"\n\nIn 2010 Dr Ahimastos was honoured with a Young Tall Poppy Science Award by the Australian Institute of Policy and Science.\n\nAnother of Dr Ahimastos' papers, published in the journal Circulation Research, has also been retracted.\n\n\"We are currently investigating other studies for which Dr Ahimastos had oversight of data collection,\" Professor Kingwell said.\n\nFairfax Media tried to contact Dr Ahimastos, but was unsuccessful.\n\nListen to our new science podcast, Science is Golden. \n\nSubscribe to the podcasts via iTunes, RSS or Pocket Casts. The story first appeared on The Sydney Morning Herald.", "source": "Bunbury Mail"}