{"published": "2015-09-15T05:26:16Z", "media-type": "News", "title": "NITDA supports DEMO Africa to develop, technology startup, entrepreneurs in Nigeria By Tony Nwakaegho", "id": "de127a6b-118f-42be-a88c-1798feda0966", "content": "The Director General of the National Information Technology Development Agency (NITDA), Mr. Peter Jack has explained that the agency is supporting this year’s DEMO Africa forum in accordance to its mandate of developing entrepreneurs in the country. \n \nThe NITDA DG said the agency believes that DEMO Africa, the annual event starting from September 21-25 in Lagos is a launch-pad for technology start-up companies, adding that the event is capable of retooling technology leaders and entrepreneurs in Nigeria. \n \n“Africa is growing in strength and its youths are pointing to the direction of things to come. NITDA is committed to Demo Africa as part of its mandate to youth development from the perspective of IT as well as its belief that a large population of highly exposed and trained youths will be the driver of Nigeria’s new economy,” he said. \n \nHe added that it is actions by different players that will see technology entrepreneurship effectively bringing sustainability to entrepreneurship across Africa. \n \nDEMO Africa is one of the flagship initiatives of LIONS@frica and aims to connect African startups to the global ecosystem. DEMO Africa is the place where the most innovative companies from African countries get a platform to launch their products and announce to Africa and the world what they have developed. \n \nOut of the thirty start-ups that will showcase their products and services this year, Nigeria leads the table with eight startups including PoshRite, Oga Venue, TalkingBookz, iKon Tracker, Mavis Computel, CarpartsNigeria, Zuvaa, and SmartEdu. \n \nSimilarly, Kenya, which is increasingly gaining global spot as tech-startup haven, has six namely: Bitsoko, BambaPOS, Shield Finance, InsureAfrika, LipaPlus, ENT-Mobile, Abacus, and SimbaPay. South Africa has three startup-representatives: Edge Books, Bozza and Eco-mc2, while Ghana has two including Ghana’s Zeepay and Flippy Campus. \n \nEgypt also has two: LockName and Raye7. Cameroon features two: Koomza and Feem Wi-Fi; and Zimbabwe also has two startups: IPC eProductivity and RoadRules. \n \nUganda, Tanzania and Ivory Coast each have one startup in this order respectively: Roundbob, Tango TV, and Airshop. \n \nFrancophone Ivory Coast with its Airshop startup company will be featuring in the event for the first time and underscores the expanding ecosystem for Africa’s technology startups. \n \n\n \n Related", "source": "Daily Times Nigeria"}