{"published": "2015-09-28T23:41:00Z", "media-type": "News", "title": "Monarch,  brother  abducted in  Akwa Ibom", "id": "c89e606b-1635-4230-a659-1e05ec522d2c", "content": "By Emman Ovuakporie \n \nA BUJA —The  monarch  of Ibiaku Issiet in Uruan Local Government Area of Akwa Ibom State, Chief Williams Etim, has been kidnapped along with his elder brother, Mr. Placid Etim. The kidnappers have demanded N200 million ransom. \n \nThe victims were abducted at about 2:30am yesterday at their country home in Ibioku Essiet, according to a member of the family and former member of the House of Representatives, Bassey Effiong Etim. \n \nEtim, who briefed journalists in Abuja on the development yesterday, said the criminals called him to demand N200 million ransom. \n \n“They called me about  12:00noon today (yesterday) to demand N200 million, and I’m just wondering how I can raise that kind of money,” he lamented. \n \nThe ex-lawmaker, who was the Chairman of the House Committee on Economic and Financial Crimes, Drugs and Narcotics from 2007-2011, regretted the incessant kidnapping in the country, especially in its southern part. \n \nEtim confessed that the abductees were his “blood brothers” and pleaded with the government of President Muhammadu Buhari to come to their rescue. \n \nHe, however, commended the President for the swift rescue of former Secretary to the Government of the Federation, SGF, Chief Olu Falae. He urged the Inspector General of Police, the Director of Department for State Service, DSS, and other security agencies to move swiftly to rescue the abductees. \n \n“I am using this medium to commend the Federal government and the Inspector General of Police for the efforts in the rescue of the former Secretary to the Government of the Federation, Chief Olu Falae. \n \n‘’I’m in  the same vein calling on the Inspector General of Police, the DSS and other security operatives to move and rescue these innocent and law abiding citizens presently suffering untold hardship in the den of kidnappers,” he said. \n \nAccording to him, several attempts to reach one of the supposed kidnappers who called earlier to demand the ransom, were unsuccessful. \n  \n Vote for this Article  Spread the word", "source": "AfricanSeer"}