{"published": "2015-09-23T13:55:06Z", "media-type": "News", "title": "These Photos Capture How a Matriarchy Breeds Self-Confidence", "id": "274dbddd-ed83-4cc7-ba5f-d451aaa7a072", "content": "Prepare to be transported to a village known as the “Kingdom of Girls”  \nSep 23, 2015 \n  \r  \n\"Ibapyntngen with lipstick\" portrays the air of adultness many of the Khasi girls exude \n \nThere’s something different about the girls of Mawlynnong. In this tiny village of 500 inhabitants tucked away in the jungles of northeast India, women rule. Mawlynnong is home to the indigenous Khasi tribe - one of the few matriarchal and matrilineal societies on earth. Here, women inherit land, children take their mother’s surname, and men marry into their wives’ family homes. In her series,  Mädchenland , which translates to “Kingdom of Girls,” German photographer  Karolin Klüppel seeks to capture “ the outstanding role of the females ” in Mawlynnong. \n\n \n Khasi girls embody an air of self-confidence that's visible in their portraits  \n \n Klüppel sought to capture the Khasi girls in their everyday environment  \n \nKlüppel’s arresting portraits are not intended to be a statement on the girls’ social, familial or societal context. Rather, by capturing the Khasi girls in their everyday physical environments,  Kluppel portrays their “ strong self-awareness and pronounced air of self-sufficiency .” \n \nIn an interview for Fotografia , Klüppel notes how women’s special standing and exceptional role in this society produces a great self-confidence in the girls. She adds “I was so impressed by their self-assured appearance, and thought that this must be how matrilineality becomes visible.” \n \n Wanda stands at the stairs of a treehouse in the village where girls rule \n \nThere’s no doubt, Khasi girls are different. In a society where women are revered and respected, self-confidence flourishes, self-sufficiency blooms, and maturity thrives. And here’s the photographic evidence to prove it. \n\n \nYOU MIGHT ALSO LIKE: \n5 Videos Celebrating Girl Power \nInspiring Girls to Be All That They Can Be \n6 Photography Projects that Will Make You Go 'Wow'  \n   ADD A COMMENT  comments via", "source": "Goodnet"}