{"published": "2015-09-13T20:38:30Z", "media-type": "News", "title": "Czechs stun Croatia as other favorites go through", "id": "ee843873-d6c3-4030-82c8-0e20df2a4487", "content": "LILLE, France (Reuters) – The Czech Republic pulled off the biggest upset of the European basketball championship after mauling Croatia 80-59 to reach the quarter-finals of the 24-nation tournament on Sunday. \n \nTheir reward will be a last-eight meeting with rampant Serbia, who secured their own berth with a sixth straight win after beating Finland 94-81. \n \nItaly, 82-52 winners over Israel, take on Lithuania who ground out a dramatic 85-81 victory against fellow former Soviets Georgia. \n \nThe other two quarter-final ties feature a heavyweight clash between Spain and Greece while holders and hosts France take on unheralded Latvia. \n \nThe Croatians, who won their only international medal as an independent nation in the 1995 tournament when they finished third, failed to end a 20-year wait after they were picked apart by an aggressive Czech side. \n \nThe defeat also means the Croatians will miss the 2016 Olympics, with the top two advancing automatically while the next five enter three intercontinental qualifying tournaments for an extra three berths. \n \nThe Czechs blew away their rivals with former NBA forward Jan Vesely collecting 20 points and 13 rebounds, as Croatia committed a staggering 24 turnovers. \n \nThe fiasco prompted coach Velimir Perasovic to step down straight after the buzzer. \n \n“I am to blame for this defeat and as far as I am concerned my mandate in the national team is over,” Perasovic told Croatian media. \n \nFinland held their own against Serbia for three quarters but last year’s world championship runners-up broke down their stubborn resistance in the final 10 minutes. \n \nCenter Miroslav Raduljica poured a game-high 27 points for the Serbians, who pulled away in the final period with a flurry of three-pointers after spells of poor long-range shooting. \n \n“We were too anxious early on and you can’t win the game in the opening three minutes,” Serbia coach Aleksandar Djordjevic told reporters. \n \n“We can’t afford to repeat the mistakes we made against the Finns because the upcoming opponents will be stronger.” \n \nThe Italians, aiming for their first title since 1999, dominated as a talent-packed outfit boasting several NBA names produced their best performance of the tournament. \n \nPlaymaker Alessandro Gentile buried 27 points and shooting guard Marco Belinelli, who joined the Sacramento Kings from the San Antonio Spurs during the ongoing NBA break, added 14. \n \nRoared on by several thousand fans who made the trip from the Baltic, Lithuania overpowered Georgia on the back of 34 points and six rebounds by forward Jonas Maciulis. \n \n(Writing by Zoran Milosavljevic in Belgrade; Editing by Frank Pingue)", "source": "SRN News"}