{"published": "2015-09-02T15:44:37Z", "media-type": "News", "title": "GLOBAL MARKETS-Stocks recover as China worries ease; oil falls further", "id": "c7f26a15-cce3-4173-96dd-50fdcee0a8fb", "content": "* U.S (Other OTC: UBGXF - news) . stocks higher in early trading\n\n* Dollar rises\n\n* Oil extends losses (Updates with U.S. market openings, changes dateline, previous LONDON)\n\nBy Caroline Valetkevitch\n\nNEW YORK, Sept 2 (Reuters) - Global stock indexes recovered some of their recent losses on Wednesday, drawing support from reports of brokerage measures in China to invigorate the country's battered markets, while U.S. oil extended losses from the day before.\n\nThe S&P 500 was up 0.7 percent in early trading, also boosted also by upbeat data on U.S. productivity.\n\nEuropean equities also were higher, building on early relief after Chinese stocks managed to bounce from steep losses before closing slightly lower.\n\nNine Chinese brokerages pledged to buy more than 30 billion yuan of shares, according to the China Securities Journal. That eased investor fears that Beijing may be intensifying a trading crackdown. The news stabilized global markets and soothed concerns that slowing growth in China will hurt the global economy.\n\nThe Dow Jones industrial average rose 99.41 points, or 0.62 percent, to 16,157.76, the S&P 500 gained 8.22 points, or 0.43 percent, to 1,922.07 and the Nasdaq Composite added 30.16 points, or 0.65 percent, to 4,666.26.\n\nEuropean stocks were up 0.2 percent.\n\nU.S. data showed nonfarm productivity increased at its strongest pace in 1-1/2 years in the second quarter, keeping wage inflation subdued for now.\n\nOil prices retreated. Data from the American Petroleum Institute on Tuesday showed U.S. crude stocks surged last week.\n\nThe move followed a big drop in Brent and U.S. crude prices on Tuesday, which ended a 25 percent three-session surge, the largest such gain since 1990.\n\n\"A rise of around 25 percent in three consecutive days was not going to be sustained,\" BNP Paribas (Xetra: 887771 - news) oil analyst Harry Tchilinguirian said. \"The underlying fundamentals are bearish.\"\n\nBrent crude for October was down 78 cents at $48.80 a barrel. U.S. crude for October was down $1.34 at $44.07.\n\nThe dollar rose as global stock markets steadied, and as U.S. hiring data encouraged speculation that Federal Reserve policymakers will raise interest rates later this month.\n\nThe dollar index, a measure of six major currencies valued against the greenback, was last up 0.40 percent and had added to gains when payrolls processor ADP reported that U.S. private payrolls increased by 190,000 last month.\n\nU.S. Treasuries prices slipped after the fresh efforts in China to steady financial markets mitigated concerns about the world's second-biggest economy and reduced demand for safe-haven U.S. government debt.\n\nBenchmark 10-year Treasuries were last down 3/32 in price to yield 2.18 percent, from a yield of 2.17 percent late on Tuesday. U.S. 30-year Treasuries were last down 11/32 to yield 2.95 percent, from a yield of 2.93 percent late on Tuesday. (Additional reporting by Lionel Laurent; Editing by Meredith Mazzilli)", "source": "Yahoo! Finance UK and Ireland"}