{"published": "2015-09-12T00:28:00Z", "media-type": "News", "title": "9/11: When John Paul II grieved with America", "id": "012e0c00-12fd-4931-b6d4-6172240442bb", "content": "As three airliners smashed into the World Trade Center towers and the Pentagon, and Flight 93 crashed into a Pennsylvania field on September 11, 2001, Joaquín Navarro-Valls, at the time the director of the Vatican press office, delivered the news to Pope John Paul II. \n \n\"I remember that terrible afternoon as if it were yesterday. I called the Pope, who was at Castel Gandolfo, I gave him the news. He was shocked not only by the tragedy itself, but also because he could not explain how man could achieve this abyss of evil...\" he recalled in a 2011 interview with Vatican Insider . \n \nJohn Paul II, who had grown up to watch his native Poland overtaken first by Nazis and then by the Soviets, and who as Pope navigated the dangerous international waters of the Cold War, was no stranger to tragedy and war. \n \nStill, the terror attacks on the United States shook him deeply. \n \n“He was deeply shaken, saddened. But I remember that he asked himself how so heinous an attack could happen. His dismay, in front of those images went beyond pain,” Navarro-Valls recalled. \n \n“He stayed for short time in front of the TV. Then he retired to the chapel, which is only a few steps away from the TV room. And he remained there a long time in prayer. He also wanted to get in touch with George Bush, to communicate his support, his pain, his prayer. But it was not possible to contact the president, who for security reasons was flying on Air Force One.” \n \nInstead, Pope John Paul II decided to send his message of condolences and assurance of prayers via telegram, and was among the first of the world leaders to do so that day. \n \n\"I hurry to express to you and your fellow citizens my profound sorrow and my closeness in prayer for the nation at this dark and tragic moment,\" the Pope wrote. \n \nIn a 2011 article in the National Catholic Register , James Nicholson, who was the new United States ambassador to the Holy See in 2001, recalled his first meeting with John Paul II, just two days after the terror attacks. \n \n“The first thing the Pope said to me was how sorry he felt for my country, which had just been attacked, and how sad it made him feel. We next said a prayer together for the victims and their families.” \n \n“Then the Pope said something very profound and very revealing of his acute grasp of international terrorism. He said, ‘Ambassador Nicholson, this was an attack, not just on the United States, but on all of humanity.’ And, then he added, ‘We must stop these people who kill in the name of God.’”   \n \nSeptember 11, 2001 was a Tuesday.   \n \nThe next day, Wednesday, is when the Pope is scheduled each week to address the pilgrims gathered in St. Peter’s Square. \n \nWhile John Paul II normally used this as a time for catechesis on the family or other issues, he set everything aside on September 12 to address the tragedy from which the world was still reeling. \n \nBelow is the full text of his words to the United States : \n \n I cannot begin this audience without expressing my profound sorrow at the terrorist attacks which yesterday brought death and destruction to America, causing thousands of victims and injuring countless people. To the President of the United States and to all American citizens I express my heartfelt sorrow. In the face of such unspeakable horror we cannot but be deeply disturbed. I add my voice to all the voices raised in these hours to express indignant condemnation, and I strongly reiterate that the ways of violence will never lead to genuine solutions to humanity’s problems. \n \nYesterday was a dark day in the history of humanity, a terrible affront to human dignity. After receiving the news, I followed with intense concern the developing situation, with heartfelt prayers to the Lord. How is it possible to commit acts of such savage cruelty? The human heart has depths from which schemes of unheard-of ferocity sometimes emerge, capable of destroying in a moment the normal daily life of a people. But faith comes to our aid at these times when words seem to fail. Christ’s word is the only one that can give a response to the questions which trouble our spirit. Even if the forces of darkness appear to prevail, those who believe in God know that evil and death do not have the final say. Christian hope is based on this truth; at this time our prayerful trust draws strength from it. \n \nWith deeply felt sympathy I address myself to the beloved people of the United States in this moment of distress and consternation, when the courage of so many men and women of good will is being sorely tested. In a special way I reach out to the families of the dead and the injured, and assure them of my spiritual closeness. I entrust to the mercy of the Most High the helpless victims of this tragedy, for whom I offered Mass this morning, invoking upon them eternal rest. May God give courage to the survivors; may he sustain the rescue-workers and the many volunteers who are presently making an enormous effort to cope with such an immense emergency. I ask you, dear brothers and sisters, to join me in prayer for them. Let us beg the Lord that the spiral of hatred and violence will not prevail. May the Blessed Virgin, Mother of Mercy, fill the hearts of all with wise thoughts and peaceful intentions. \n \n Today, my heartfelt sympathy is with the American people, subjected yesterday to inhuman terrorist attacks which have taken the lives of thousands of innocent human beings and caused unspeakable sorrow in the hearts of all men and women of good will. Yesterday was indeed a dark day in our history, an appalling offence against peace, a terrible assault against human dignity. \n \nI invite you all to join me in commending the victims of this shocking tragedy to Almighty God' s eternal love. Let us implore his comfort upon the injured, the families involved, all who are doing their utmost to rescue survivors and help those affected. \n \nI ask God to grant the American people the strength and courage they need at this time of sorrow and trial. \n \nBelow is the full text of Pope John Paul II’s prayers for the faithful and intentions on September 12, 2001: \n \n Brothers and Sisters, in great dismay, before the horror of destructive violence, but strong in the faith that has always guided our fathers, we turn to the God of Abraham, Isaac and Jacob, salvation of his people, and with the confidence of children, pray that He will come to our aid in these days of mourning and innocent suffering. \n \nCantor: \n \nDominum deprecemur:  Te rogamus, audi nos. \n \n1. For the Churches of the East and the West, and in particular for the Church in the United States of America so that, though humbled by loss and mourning, yet inspired by the Mother of the Lord, strong woman beside the cross of her Son, they may foster the will for reconciliation, peace, and the building of the civilization of love. \n \n2. For all those who bear the name of Christian, so that, in the midst of many persons who are tempted to hatred and doubt, they will be witnesses to the presence of God in history and the victory of Christ over death. \n \n3. For the leaders of nations, so that they will not allow themselves to be guided by hatred and the spirit of retaliation, but may do everything possible to prevent new hatred and death, by bringing forth works of peace. \n \n4. For those who are weeping in sorrow over the loss of relatives and friends, that in this hour of suffering they will not be overcome by sadness, despair and vengeance, but continue to have faith in the victory of good over evil, of life over death. \n \n5. For those suffering and wounded by the terrorist acts, that they may return to stability and health and, appreciating the gift of life, may generously foster the will to contribute to the well being of every human being. \n \n6. For our brothers and sisters who met death in the folly of violence, that they find sure joy and life everlasting in the peace of the Lord, that their death may not be in vain but become a leaven bringing forth a season of brotherhood and collaboration among peoples. \n \nThe Holy Father: \n \nO Lord Jesus, remember our deceased and suffering brothers before your Father. \nRemember us also, as we begin to pray with your words:  Pater noster... \n \nO Almighty and merciful God, \nyou cannot be understood by one who sows discord, you cannot be accepted by one who loves violence:  look upon our painful human condition tried by cruel acts of terror and death, comfort your children and open our hearts to hope, so that our time may again know days of serenity and peace. \nThrough Christ our Lord. \nAmen. \n \n ", "source": "Angelus The Tidings Online"}