{"published": "2015-09-28T02:54:45Z", "media-type": "News", "title": "College Football: Raiders rush past Fond du Lac", "id": "86a22da3-8284-4423-aee9-ef114f4a2252", "content": "Carlton Djam, who finished with 128 yards on 27 carries, capped off  the two late drives for the Raiders. The first was a 12-play, 67-yard march that ate up 4:15 of clock. \n\nDjam scored from 2 yards out on the second drive as CLC rumbled 73 yards on 16 plays and used 8:43 of the fourth quarter clock. \n\nCLC's Trey Blanchard accumulated 111 yards on 18 carries for a 6.2 yards-per-carry average. \n\n\"It has been crucial to have that running game to complement our passing attack,\" said Raiders head coach Greg Medeck. \"We have two really, really good running backs in Blanchard and Djam and to be able to rely on them and our offensive line to control the line of scrimmage and the tempo late in games has been one of our best features this year. Obviously we have some explosive weapons in the passing game, and one of the best quarterbacks, but for us to be able to win in different ways, particularly running the ball, will help us so much in the postseason.\" \n\nMedeck said fog was a key factor of Saturday's second half. He said the ball was hard to see and even calling plays from the sideline to the field made things difficult. That made the running game and winning time of possession all the more important. \n\nCLC controlled the ball for 46:42, while Fond du Lac had it for just 15:59. \n\nThe Raiders out rushed Fond du lac 231-77 leading to 454 yards of total offense compared to 217. \n\nJake Faber finished 20-of-31 passing for 223 yards and CLC's first two scores. He hit Jackson Winter on a 1-yard pass for a 7-0 halftime lead. Faber connected with Kieran Johnson on a 36-yard strike to answer Fond du Lac's only score in the third. Johnson caught seven passes for 79 yards. \n\n\"This was a very good game for us as we only led 7-0 at the half and 7-6 early in the third quarter,\" Medeck said. \"Offensively we were able to finish off the game by running the ball and sustaining long drives. It might have been our best defensive effort of the year, too. \n\n\"I was really happy with our play in the second half and hopefully a win like this will go a long way to helping us get a home playoff game.\" \n\nTykeise Johnson intercepted a pass and Sean Walker finished with 9 tackles and 2.5 sacks, two forced fumbles and one recovery. CLC's defensive finished with six total sacks and three forced turnovers. \n\nCentral Lakes 7 0 7 13 - 27 \n\nFond du Lac    0 0 6   0 - 6 \n\nFirst quarter \n\nCLC-Jackson Winter 1 pass from Jake Faber (Seth Zins kick) 11:59 \n\nThird quarter \n\nFDL-Te'Vaughn Hurse 48 run (kick failed) 13:47 \n\nCLC-Kieran Johnson 36 pass from Faber (Sins kick) 5:37 \n\nFourth quarter \n\nCLC-Carlton Djam 5 run (kick failed) 14:35 \n\nCLC-Djam 2 run (Zins kick) 5:52 \n\nTeam statistics \n\nRushes-yards: CLC 53-231, FdL 43-77 \n\nPass comp-att-int-yds: CLC 20-31-0-223, FdL 10-21-1-140 \n\nTotal offense: CLC 454, FdL 217 \n\nFirst downs: CLC 28, FdL 18 \n\nPenalties: CLC 10-83, FdL 8-73 \n\nFumbles-lost: CLC 0-0; FdL 3-2 \n\nTime of possession: CLC 46:42, FdL 15:59 \n\nIndividual leaders \n\nRushing: CLC-Carlton Djam 27-128, Trey Blanchard 18-111, Kieran Johnson 1-8, Riley Atkinson 1-2, Jake Faber 6-(-18) \n\nPassing: CLC-Jake Faber 20-31-223 \n\nReceiving: CLC-Kieran Johnson 7-79, Cody Rau 4-51, Jackson Winter 3-34, Jaelyn Price 3-27, Blake Gerads 1-13, Beau Wilhelm 1-10, Blanchard 1-9 \n\nDiv: CLC 2-1. Overall: CLC 4-1. Next: CLC hosts Mesabi 1 p.m. Saturday.", "source": "Brainerd Daily Dispatch"}