{"published": "2015-09-21T12:51:41Z", "media-type": "News", "title": "Monterey Jazz Festival: 5 fond memories from Monterey", "id": "267373a2-6e32-418e-989f-6a90a39c88e6", "content": "Here are five of the many highlights of the 58th annual Monterey Jazz Festival, which ran Friday through Sunday in Monterey: \n  \n1. Lizz Wright \n  \nThe Georgia native was absolutely mesmerizing on the microphone, showcasing her big, blues-soaked voice during a winning set on Saturday night. If you're not familiar with Wright, we recommend that you correct that situation immediately. \n  \n2. Ambrose Akinmusire \n \n\r\r \n  \nIt's always good to see a Bay Area artist shine at this world-class festival. And that was certainly the case in 2015 for Oakland's Akinmusire (pronounced ah-kin-MOO-sir-ee), who is an alumnus of the Berkeley High School Jazz Ensemble and the Monterey Jazz Festival's Next Generation Jazz Orchestra. The 33-year-old trumpeter premiered the commissioned piece \"The Forgotten Places\" early in the evening on Saturday then returned a couple of hours later to perform a second full set for another packed house. \n  \n3. \"Jaco\" \n  \nThere's typically a lull in the action at the festival around 5 p.m. or so on weekend days, as the Day Session winds up and the Night Session has yet to swing into action. Fortunately, the festival regularly screens jazz-related documentaries during that time period. This year, I was pleased to catch \"Jaco,\" a great new documentary about Jaco Pastorius, the legendary bassist who died at the age of 35 in 1987. \n  \n4. The Monterey Jazz Festival on Tour \n  \nDidn't make it to down to Monterey this year? Don't fret - Monterey might be coming to you. The Monterey Jazz Festival is set to launch its fourth national tour in 2016, with an all-star band of vocalist-guitarist Raul Midon, saxophonist Ravi Coltrane, trumpeter Nicholas Payton, pianist Gerald Clayton, bassist Joe Sanders and drummer Justin Brown. The Monterey Jazz Festival on Tour band sounded quite strong during its set on Saturday. \n  \n5. Jazz at Lincoln Center Orchestra with Wynton Marsalis \n  \nIt's always great to see Wynton Marsalis lead this amazing orchestra. This time through town, the mighty trumpeter/bandleader and his crew were performing music by Dizzy Gillespie, Dave Brubeck, John Lewis and Chick Corea. You might not be familiar with many of the current players in the orchestra - at least not yet, anyway. But don't be surprised if some of them end up following in the successful footsteps of Eric Reed, Russell Gunn and other notable alumni. \n  \nFollow Jim Harrington at witter.com/jimthecritic .", "source": "Monterey Herald"}