{"published": "2015-09-17T21:09:00Z", "media-type": "News", "title": "Cormant Showcases its Array of DCIM Expertise at AFCOMs Fall Data Center World Event in Maryland", "id": "81d0e632-32d8-45f6-90e5-b7e9dabe6b5c", "content": "Participation at the event includes moderating a thought leadership panel on DCIM implementations and ROI, speaking on the role of data center analytics in DCIM tools, and demoing the latest Cormant-CS 8 features in booth #423.\n\nSan Luis Obispo, CA, USA (PRWEB) September 17, 2015 \n\nCormant, Inc., a data center infrastructure management (DCIM) pure-play expert, today announced its deep involvement in the Fall Data Center World, September 20 – 23. Cormant was selected to lead two vendor-neutral topics on DCIM and will also provide in-booth demonstrations of their newly released version, Cormant-CS 8. \n\n“I’m honored to have been selected to lead a DCIM leadership panel at Data Center World for the third time in a row,” said Paul Goodison, Cormant CEO. “Attendees can expect to hear in-depth questions offering first-hand experience with DCIM.”\n\nThe DCIM panel, moderated by Cormant CEO, Paul Goodison, includes hand-selected panelists to provide expertise from differing DCIM approaches. Panelists include two consultants with a diverse history implementing varying DCIM solutions, an end user with DCIM experience from an IT service management (ITSM) perspective, and a DCIM vendor with significant experience educating end users. Attendees are invited to attend the panel on Sunday, September 20th from 3:30 PM to 5:40 PM EDT.\n\nTo educate users on the dynamic topic of data center analytics in DCIM tools, Cormant Senior Technical Consultant, Brad Beamish, speaks on Monday from 9:10 AM to 10:10 AM EDT. Numerous real-world examples will be shared with users to amplify learning during this educational session.\n\n“Analytics are a driver of improvements,” explained Brad Beamish, Cormant Senior Technical Consultant. “Anyone looking to reduce data center downtime and costs should have a solid understanding of their current situation, where they strive to be, and how analytics can help them get there.”\n\nCormant is also demonstrating their latest product enhancements as seen in the recently released Cormant-CS 8. A preview of Alerts was shown at Data Center World Las Vegas in April, but users at this event will see the completely remodeled console view with enhanced navigability, new integrations, and the HTML 5 responsive interface in addition to Alerts and advanced analytics. \n\nFor a Cormant-CS 8 demo, visit Data Center World Booth #423 or contact Sales at +1 805 747 4178 or sales(at)cormant(dot)biz.\n\nAbout Cormant, Inc. \n\nCormant has been an expert at IT infrastructure management software for the data center (DCIM) and beyond since 2001. Boasting a 94% customer retention rate, Cormant’s solutions are sold globally with customers and partners on six continents encompassing all industries. Cormant is focused on working with customers to improve their management, control and reporting processes by delivering Cormant-CS, a DCIM solution that provides a single-pane-of-glass view to where the physical and logical layers of IT infrastructure meet. Learn more on how Cormant keeps business personal at http://www.cormant.com and connect with us on LinkedIn.\n\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb12966043.htm", "source": "KHQ Right Now"}