{"published": "2015-09-23T07:03:26Z", "media-type": "News", "title": "Sitting less a better goal than exercising more: study", "id": "ec6e35e1-126d-4568-9f9b-10920d6b9650", "content": "Prolonged sitting has been associated with adverse health effects that are only minimally neutralized by exercise, and a new study says aiming for less time spent sitting is the best way to stay healthy. In the study, thought to be the first to explore strategies to conquer what has become a serious public health concern, the research team worked with data from 38 previous intervention trials.\n\nSixty percent, or 23, of the trials appeared promising in relation to the remaining 39 percent, or 15.\n\nMore promising ideas included providing workers with sit-stand desks, encouraging people to keep track of how much time they spend sitting, setting personal goals for reducing sitting time and setting reminders to remind us to take a break.\n\nAll of these methods had proven themselves to be successful on their own and, what's more, none of them involve reminding people to exercise.\n\nOther effective methods included informing people of the health benefits that could arise from spending less time sitting.\n\n\"The importance of this study is not in showing that interventions can work, but in pointing out how they might work,\" says co-author Professor Stuart Biddle of Victoria University in Australia. \"This is crucial if behavior is to be achieved more efficiently and effectively.\"\n\nAfter wrapping up their research, the team recommends looking at sitting time as something independent of the need to exercise more.\n\nWhile they hope public health workers and policy makers will pick up on their findings, they advise individuals to start thinking this way now.\n\n\"...the findings should also be of interest to anyone looking to improve their health by reducing their own sitting time in their day-to-day lives, as many of these interventions can be adopted on an individual level,\" says co-author Dr. Benjamin Gardner of King's College London.\n\nPublished in the journal Health Psychology Review, the study supports another from earlier this year suggesting that regardless of regular exercise, prolonged sedentary periods still pose major health threats.\n\n\"Avoiding sedentary time and getting regular exercise are both important for improving your health and survival,\" said Dr. Alter, Senior Scientist, Toronto Rehab, University Health Network (UHN), and Institute for Clinical Evaluative Sciences. \"It is not good enough to exercise for 30 minutes a day and be sedentary for 23 and half hours.\"\n\nWhile the meta-analysis concluded that those with high exercise quotients experience fewer of the consequences of sitting, exercise should not be viewed as a way to cancel out these negative effects.", "source": "Times Live South Africa"}