{"published": "2015-09-10T12:00:00Z", "media-type": "Blog", "title": "exploring west-central puerto rico", "id": "7d87ae55-f44f-4c18-aae8-0218acbcfa6c", "content": "Evan and I celebrated 4 months of marriage on August 18. Starting then, we decided we would take that day off each month until our one year anniversary and use that time to explore a part of Puerto Rico that we had yet to visit. \n \nSo mid week, we brushed off our hiking shoes, packed a daypack and began our journey to the western-central part of the island. We were headed to the mountains! Well, to a lake in the mountains. Lago Dos Bocas was the destination, and the drive there was quite a sight as well. Twists and turns through the mountains, down into the valleys, along the edges of hills overlooking the lush farms and jungles of Lares and Utuado. Through a bamboo covered road, and out over a dam holding back this man-made lake surrounded by steep sided mountains. \n \nWe arrived in early afternoon, just as everyone at the Department of Transportation-run office of this park was leaving for lunch. Naturally. So we explored a bit on the roads nearby, returning at 1:00 to hop on a free (yes, free!) ferry ride around the lake. It only lasted about 20 minutes, but during season and on the weekend, the boat can take you to restaurants situated at the edge of the shoreline, ready to serve you some comida criolla with a gorgeous central island view. This would be a great place to spend a day, certainly family oriented! \n \nBy early afternoon we were hungry and ready to continue on to our next stop. We headed north to catch the highway back down the west coast, stopping at the well known El Buen Cafe for some sandwiches. Once passing through Quebradillas, Evan pulled off into a small cliffside neighborhood to show me a secret staircase leading down to the beach and a favorite, uncrowded surf spot. After years of traveling to Puerto Rico, this was the first time he encountered a locked gate, indicating the land had probably been sold, yet no signs warned of trespassing and a cement archway next to the gate beckoned with open arms for us to continue this little adventure. One thing I love about Puerto Rico is this unspoken rule and charm of adventure seekers to legacy sites once completely open to the public — the new owners, if typically local, will try to keep it somewhat available to those who know of the location and its once-easy access. So we made our way down this incredibly unsafe looking cement staircase, plastered to the edge of the cliff, with a gorgeous view of Isabela and Aguadilla down below. We climbed further to find an open point at the edge of the cliff, where the wind caught my hair and a rush of adrenaline made me keep my distance from the edge. \n \nOur adventure didn’t really end with that day though. Later in the week we paddled out at Tres Palmas, our local beach access for a quick SUP and swim, then that Friday we also took a dive in the same location, spotting turtles and tons of fish. \n \nExploring with Evan has been one of the cornerstones to our solid relationship. My adventure seeking soul found my match in him, and we have never ceased creating fun filled days together. \n \n[All photos are mine, except the typography print from Goldfish Kiss ].", "source": "sea, field & tribe"}