{"published": "2015-09-30T01:01:36Z", "media-type": "Blog", "title": "Parex Announces Agreement to Develop the Aguas Blancas Light Oil Field in Colombia", "id": "5480c40c-5e24-408b-b352-8a4000054734", "content": "This post was originally published on this site \n\nCALGARY, AB –(Marketwired – September 29, 2015) – \n \nNOT FOR DISTRIBUTION OR FOR DISSEMINATION IN THE UNITED STATES \n \nParex Resources Inc. (“Parex” or the “Company”) (TSX: PXT ), a company focused on oil exploration and production in Colombia is pleased to announce the execution of a formal binding agreement with Empresa Colombia na de Petroleos S.A. (“Ecopetrol”) whereby Parex will farm-in to operate and earn a 50% working interest in the Aguas Blancas light oil field located in the Middle Magdalena Basin of Colombia . \n \nAll amounts herein are in United States dollars (“USD”) unless otherwise stated. \n \nAguas Blancas Oil Field \n \nThe Aguas Blancas oil field is located in the Middle Magdalena Basin immediately south of the La Cira-Infantas oil field which has produced approximately 850 million barrels of oil to date. Aguas Blancas was discovered in 1962 and was initially appraised with five wells in the period between 1962 and 1964. No wells have since been drilled. Cumulative oil production from the field is approximately 1 million barrels of light oil (28-33 API). The main producing horizon is the Mugrosa ‘C’ Formation at depths of 4,000-7,000 feet. Gross reservoir interval thicknesses in the Mugrosa ‘C’ range from 300-500 feet with up to 150 feet of net oil pay. \n \nIn 2011 a 3D seismic survey was acquired in anticipation of the field’s development, however, no wells were drilled on it. The 3D survey indicates that the existing Aguas Blancas field is approximately 4,300 acres in aerial extent. Further, Parex believes that a Satellite structure to the south of the main oil accumulation that has been tested by one well could be up to an additional 1,500 acres in aerial extent. \n \nFarm-in Agreement \n \nEcopetrol had previously stated that it intended to offer undeveloped oil fields to industry operators. Pursuant to this strategy, Ecopetrol offered companies the opportunity to acquire up to a 50% working interest in the Aguas Blancas field in a competitive bidding process. Parex’ winning bid requires investment during the initial earning phase of approximately $61 million by undertaking delineation drilling and waterflood pilot programs at its sole cost to earn a 50% working interest in the field. Subsequently, all future capital investment will provide Ecopetrol a 10% carry whereby Parex will spend 60% and Ecopetrol 40%. Revenues and operating costs will be based on the parties’ 50% working interest. \n \nThe initial earning phase has a term of 3 years commencing after the transfers of the existing applicable operating and environmental permits have occurred, which is expected to be in place within 1 year. Parex has agreed to provide a performance bond to Ecopetrol for the full amount of its initial phase earning commitment of $61 million. Including the initial earning phase, the farm-in agreement has a term of 25 years and the agreement has a royalty regime that is consistent with the applicable Agencia Nacional de Hidrocarburos (“ANH”) contracts. \n \nParex first entered Colombia in 2009 and now produces approximately 28,000 bopd in Colombia ‘s Llanos Basin. Parex had identified the Middle Magdalena Basin as a key component of its strategy to grow oil production in Colombia to in excess of 50,000 bopd. Complementing the Aguas Blancas acquisition, Parex has an additional three 100% working interest exploration blocks in the Middle Magdalena Basin . Parex has ample financial liquidity to fund its development of Aguas Blancas. Along with a growing volume of profitable production, Parex has no bank debt and an undrawn credit facility of USD$200 million, and working capital of approximately USD$90 million as at June 30, 2015. In addition, Parex has demonstrated the operating capabilities to implement waterflood and other enhanced recovery techniques as a result of its management’s experience in the development of the large oil fields it discovered in the Neuquen Basin of Argentina . \n \nThis news release does not constitute an offer to sell securities, nor is it a solicitation of an offer to buy securities, in any jurisdiction. \n \nNon-GAAP Terms \n \nThis report contains financial terms that are not considered measures under GAAP such as working capital, but do not have any standardized meaning under IFRS and may not be comparable to similar measures presented by other companies. Management uses these non-GAAP measures for its own performance measurement and to provide shareholders and investors with additional measurements of the Company’s efficiency and its ability to fund a portion of its future capital expenditures. \n \nWorking capital is a non-GAAP term which is defined as the Company’s current assets less current liabilities. Management uses working capital to assess liquidity and the Company’s financial strength. \n \nAdvisory on Forward Looking Statements and Other Oil and Gas Information \n \nCertain information regarding Parex set forth in this document contains forward-looking statements that involve substantial known and unknown risks and uncertainties. The use of any of the words “plan”, “expect”, “prospective”, “project”, “intend”, “believe”, “should”, “anticipate”, “estimate” or other similar words, or statements that certain events or conditions “may” or “will” occur are intended to identify forward-looking statements. Such statements represent Parex’ internal projections, estimates or beliefs concerning, among other things, future growth, results of operations, production, future capital and other expenditures (including the amount, nature and sources of funding thereof), competitive advantages, plans for and results of drilling activity, business prospects and opportunities. These statements are only predictions and actual events or results may differ materially. Although the Company’s management believes that the expectations reflected in the forward-looking statements are reasonable, it cannot guarantee future results, levels of activity, performance or achievement since such expectations are inherently subject to significant business, economic, competitive, political and social uncertainties and contingencies. Many factors could cause Parex’ actual results to differ materially from those expressed or implied in any forward-looking statements made by, or on behalf of, Parex. \n \nIn particular, forward-looking statements contained in this document include, but are not limited to, statements with respect to the performance characteristics of the Aguas Blancas oil field; the terms of the farm-in agreement with Ecopetrol; the expected timing to complete the transfers of the existing applicable operating and environmental permits on the property; the anticipated areal extent of the Aguas Blancas oil field, including potential additional acres of areal extent identified by Parex; Parex’s strategy to grow oil production in Colombia and the estimated amount of such growth; Parex’s financial liquidity to fund its development of the Aguas Blancas oil field; financial and business prospects and financial outlook; and activities to be undertaken in various areas. In addition, statements relating to “reserves” or “resources” are by their nature forward-looking statements, as they involve the implied assessment, based on certain estimates and assumptions that the resources and reserves described can be profitably produced in the future . The recovery and reserve estimates provided herein are estimates only and there is no guarantee that the estimated results will be achieved. \n \nThese forward-looking statements are subject to numerous risks and uncertainties, including but not limited to, the impact of general economic conditions in Canada and Colombia ; industry conditions including changes in laws and regulations including adoption of new environmental laws and regulations, and changes in how they are interpreted and enforced, in Canada and Colombia ; prolonged volatility in commodity prices; risk of delay in completing or non-competition of the required transfers of the applicable operating and environmental permits; failure of counterparties to perform under the farm-in agreement; risk that the anticipated results from the Aguas Blancas oil field will be less that expected; competition; lack of availability of qualified personnel; the results of exploration and development drilling and related activities; obtaining required approvals of regulatory authorities, in Canada and Colombia ; risks associated with negotiating with foreign governments as well as country risk associated with conducting international activities; volatility in market prices for oil; fluctuations in foreign exchange or interest rates; environmental risks; changes in income tax laws or changes in tax laws and incentive programs relating to the oil industry; ability to access sufficient capital from internal and external sources; the risks that any estimate of potential net oil pay is not based upon an estimate prepared or audited by an independent reserves evaluator; that there is no certainty that any portion of the hydrocarbon resources will be discovered, or if discovered that it will be commercially viable to produce any portion thereof; risks related to the lawsuit brought in Texas against Parex and certain foreign subsidiaries; failure of counterparties to perform under the terms of their contracts; and other factors, many of which are beyond the control of the Company . Readers are cautioned that the foregoing list of factors is not exhaustive. Additional information on these and other factors that could affect Parex’ operations and financial results are included in reports on file with Canadian securities regulatory authorities and may be accessed through the SEDAR website ( www.sedar.com ). \n \nFurther, this press release includes estimates of pay thickness and areal extent in the Aguas Blancas oil field, which are considered to be anticipated results or information that indicate the potential value or quantities of resources under National Instrument 51-101 – Standards of Disclosure for Oil and Gas Activities (“NI 51-101”). Such estimates have been prepared by management of Parex and have not been prepared or reviewed by an independent qualified reserves evaluator or auditor. The risks associated with these estimates include, but are not limited to, the risk that Parex’ exploration and development drilling and related activities may provide different results; the risk that Parex may encounter unexpected drilling results; the occurrence of unexpected events involved in the exploration for, and the operation and development of, oil and gas; delays in anticipated timing of drilling and completion of wells; geological, technical, drilling and processing problems and other difficulties in producing petroleum reserves; and the risk that if any resources are discovered that it will not be commercially viable to produce any portion thereof. There is no certainty that Parex will achieve the estimated results from the Aguas Blancas oil field or that any portion of the resources will be discovered. If discovered, there is also no certainty that it will be commercially viable to produce any portion of the resources. \n \nAlthough the forward-looking statements contained in this document are based upon assumptions which Management believes to be reasonable, the Company cannot assure investors that actual results will be consistent with these forward-looking statements. With respect to forward-looking statements contained in this document, Parex has made assumptions regarding: current commodity prices and royalty regimes; availability of skilled labour; timing and amount of capital expenditures; future exchange rates; the price of oil; the impact of increasing competition; conditions in general economic and financial markets; availability of drilling and related equipment; effects of regulation by governmental agencies; royalty rates, future operating costs, uninterrupted access to areas of Parex’ operations and infrastructure, recoverability of reserves and future production rates, timing of drilling and completion of wells, that Parex will have sufficient cash flow, debt or equity sources or other financial resources required to fund its capital and operating expenditures and requirements as needed, that Parex’ conduct and results of operations will be consistent with its expectations, that Parex will have the ability to develop its properties in the manner currently contemplated, current or, where applicable, proposed industry conditions, laws and regulations will continue in effect or as anticipated, that the estimates of Parex’ reserves volumes and the assumptions related thereto (including commodity prices and development costs) are accurate in all material respects, and other matters. Management has included the above summary of assumptions and risks related to forward-looking information provided in this document in order to provide shareholders with a more complete perspective on Parex’ current and future operations and such information may not be appropriate for other purposes. Parex’ actual results, performance or achievement could differ materially from those expressed in, or implied by, these forward-looking statements and, accordingly, no assurance can be given that any of the events anticipated by the forward-looking statements will transpire or occur, or if any of them do, what benefits Parex will derive. These forward-looking statements are made as of the date of this document and Parex disclaims any intent or obligation to update publicly any forward-looking statements, whether as a result of new information, future events or results or otherwise, other than as required by applicable securities laws. \n \nThis press release includes information that may constitute “analogous information” as defined in NI 51-101. Such information includes production information in respect of the La Cira-Infantas oil field retrieved from the Colombia n Ministry of Mines and Management of Parex believes the information is relevant as it indicates the existence of hydrocarbons in proximity to Aguas Blancas. Parex is unable to confirm that the analogous information was prepared by a qualified reserves evaluator or auditor and is unable to confirm that the analogous information was prepared in accordance with NI 51-101. Such information is not an estimate of the production attributable to the Aguas Blancas oil field and there is no certainty that the production data for the Aguas Blancas oil field will be similar to or analogous to the information presented herein. \n \nNeither the TSX nor its Regulation Services Provider (as that term is defined in the policies of the TSX) accepts responsibility for the adequacy or accuracy of this release.", "source": "Military Technologies News"}