{"published": "2015-09-17T17:15:06Z", "media-type": "News", "title": "Flushed with success, Toto pledges to take toilet innovation and design to next level", "id": "8e27eb26-e917-4ad8-a71c-d82f6d221367", "content": "Watchiranont Thongtep \n\nThe Nation \n\nFukuoka and Tokyo \n\nTo celebrate its 100th anniversary, Toto opened \"Toto Museum\" last month in Kitakyushu of Fukuoka prefecture to provide visitors an opportunity to learn about the philosophy behind its manufacturing and how product have developed. \n\nIn the run-up to celebrating its centenary in 2017, the key promise that Japanese sanitary-ware giant Toto Group is constantly delivering is its determination to never stop creating and developing innovation with great design for all kinds of customers. \n\nTo ensure its research and development in the field of plumbing equipment and products is right on track to improve people's lifestyle and culture, the Fukuoka-based manufacturer reserves around 18.5 billion yen (Bt5.5 billion) a year - accounting for 3 to 4 per cent of its annual turnover - for investment in innovative technology and design. \n\nAnd to explain its philosophy, one needs look no further than the 35-year history of the group's Washlet toilet-seat technology. \n\nHiroshi Hashimoto, researcher for the product research and development department at Toto's Research Institute in Tokyo, said the latest cutting-edge toilet seat had been created with a variety of functions to make people's lives comfortable, convenient and clean. \n\nDuring last week's visit to the institute, Hashimoto, who has been deeply involved in the company's technological development with Washlet and helps produce many of Toto's different types of watering technologies, said that in the development process, it was crucial for the customer's voice to be heard in order to ensure that Washlet could respond satisfactorily to what the public wanted. \n\n\"Our company began with basic experiments by cooperating with 300 company members to find the best angle of water spraying and cleaning. We found out that 43 degrees was the best angle to adjust water flow to the human body, and for cleanliness of the nozzle from dropping water,\" he explained. \n\nApart from this, the temperature of the water, air-dryer and seat in a lavatory are also important for users, and Toto found that 38 degrees Celsius, 50 degrees and 36 degrees, respectively, were the most suitable, he added. \n\nHowever, toilets of today and tomorrow require more advanced technology, including self-cleansing, flushing and water-saving technology for maintaining people's hygiene, said the researcher. \n\nClean and green \n\nIn response to this demand, his firm has placed emphasis on clean and green technology, which covers design for dirt prevention such as Sana Gloss, rimless and tornado flushing and advanced cleansing with ewater+ (electrolised water) and Actilight (light-activated technology). \n\nTo conserve water, Toto has spent more than 30 years developing and designing new Washlet models that consume less water. \n\nThe NEOREST-tankless Washlet range, Toto's latest models, are able to use about 3.3 litres to 3.8 litres per flush, which is dramatically less than for the original model launched in 1976, which consumed 13 litres per flush. \n\nIt's no wonder then, says Hashimoto, that Washlet and other water-and-energy-saving-oriented accessories are the preferred choice of luxury hotels and up-scale properties: Banyan Tree Shanghai On The Bund in China, Hotel Schloss Elmau in Germany, The South Beach in Singapore and three properties in Thailand - the Central Embassy, Okura Prestige Bangkok and Le Meridien Bangkok hotels. \n\nNot only does the firm concentrate more on creating environmentally friendly products, but it also has put a high priority on the development of barrier-free lavatories, particularly for wheelchair users, the elderly, hospital patients and children. \n\nTo showcase its latest technology, products as well as history, the company recently opened the Toto Museum in the same grounds as its factory in Fukuoka prefecture, as part of the commemoration of the hundredth anniversary of the company's establishment, in two years' time. \n\nThe museum aims to provide visitors with an opportunity to learn about the philosophy behind its manufacturing, and how the group's products have developed over time. \n\nFurthermore, the company has launched a state-of-art toilet, \"Gallery Toto\", at Narita Airport's Terminal 2 to provide an advanced toilet experience for international travellers, in the hope of extending its product experience and brand awareness globally.", "source": "The Nation - Thailand"}