{"published": "2015-09-30T21:00:00Z", "media-type": "News", "title": "Five sentenced to death over train bombings in Mumbai", "id": "3f900a3a-694a-4e0e-8e25-cf44ea826a22", "content": "7 others involved in the 2006 attacks that killed 189 people get life imprisonment An Indian court has sentenced five men to death for bombing commuter trains in the financial capital of Mumbai nine years ago, in one of the deadliest terror attacks in the country, killing 189 people and injuring nearly 900 others.\n\nOn July 11, 2006, seven blasts ripped through commuter trains, which form the lifeline of Mumbai's transport system, within 11 minutes.\n\nPolice investigations found that the bombs, which were packed into pressure cookers and then placed in bags and hidden under newspapers and umbrellas in the trains, were timed to go off during rush hour to cause maximum casualties. Yesterday's verdict came after Parag Sawant, one of the blast victims, died in July after being in a semi-comatose state for nine years.\n\nMr K.P. Raghuvanshi, former head of the anti-terrorism squad that investigated the bombings, told reporters: \"Justice has been done to the victims, at least partly.\"\n\nThe court also sentenced seven to life imprisonment, while 15 others, whom police believe were part of the plot, are still at large. They include the Pakistan-based leader of militant group Lashkar-e-Taiba, Azeem Cheema, named the prime conspirator by investigators.\n\nIndia has often blamed Pakistan for harbouring and refusing to take action against terror groups like the Lashkar-e-Taiba, accused of carrying out a number of devastating attacks in India.\n\nPakistan has denied the charges.\n\nThe Lashkar-e-Taiba is also accused of carrying out the 2008 Mumbai attack, in which more than 160 people were killed.\n\nThe death penalties meted out yesterday will now have to be confirmed by higher courts, including the Supreme Court. The president also has clemency powers.\n\nMr Jayprakash Sawant, father of blast victim Parag, told the Press Trust of India news agency that \"justice will be done only after the convicts are hanged to death\".\n\nHe added: \"What happened to us should not happen to anyone else in future. A strong message has to be sent by our judicial system that such acts will not be dealt with lightly.\"\n\nThe Jamiat Ulama-e-Maharashtra (Arshad Madni), an Islamic organisation which is providing legal aid to the 12 accused, said it would appeal to the Bombay High Court.\n\n\"We respect the court order, but we would move the appropriate court. We would get the best counsels in the Bombay High Court,\" said Mr Gulzar Azmi of the Jamiat Ulama-e-Maharashtra.\n\nThe last hanging in India was carried out on Yakub Memon in July this year for his role in the 1993 Mumbai serial blasts, in which 257 people were killed.\n\nIndia's judicial system is known to be overburdened, leading to multiple delays. Yesterday's conviction came after an eight-year-long trial, in which about 200 witnesses were questioned.\n\n\"This is one of the issues, the trial took eight years, which is a long time. This is a case of 'justice delayed is justice denied',\" said Mr Suhas Chakma, director of the Asian Centre for Human Rights.", "source": "Straits Times"}