{"published": "2015-09-23T20:50:20Z", "media-type": "News", "title": "On-Page SEO Health Audit – The Crucial Checklist", "id": "d6293c98-6452-432c-a847-c8bee45d3480", "content": "Our work for clients involves a lot of website building and optimization, and we’re constantly finding that we repeat many of the same tasks whenever we get our hands on a new website. \n\nMany of the optimizations we perform come down to the fact that Google (and search engines in general) has a tendency to change the algorithms it uses to rank search results up to several times per year. What this means is that some factors become more important, while others lose their value. \n\nBased on the most recent changes in Google’s algorithm, we have come up with this extensive checklist that you can (and should) apply to every site you work on. Even if you’re working with an existing website, we strongly recommend you audit the content against our checklist. You may be surprised to find serious SEO mistakes in older articles and blog posts, so performing this kind of check can be hugely beneficial for your website. \nThe On-Page SEO Checklist Short SEO and User-Friendly URLs \nIf there’s one thing all SEO experts agree on, it’s that the URL is one of the biggest on-page factors that you can influence. Ultimately, your aim for every URL on your site should be to have a short, yet keyword-rich and readable web address. \n\nKeep in mind that usually it’s the first 3-5 key terms in the URL that are given the highest importance by search engines, so make sure you use your target keywords in them. \n Recommended for You Webcast: Fishing with Spears: All About Account-Based Marketing  Title \nThe title of your content is also significant for your on-page SEO. You should always aim to use the desired keywords in the very beginning of your page’s title and also to keep it between 30 and 65 characters. You can’t go wrong by keeping it focused and short. \nMultimedia \nIf content is king, then multimedia is definitely its queen. (And sometimes with infographics, videos, and other similar formats, multimedia does become content.) \n\nThere is practical evidence that shows that the use of multimedia such as images and diagrams reduces the bounce rate of sites and also increases the average time people spend on them. Therefore, it would be hard to go wrong if you focus on selecting and using high-quality multimedia that accentuates your message. \nOutbound Links \nDon’t be afraid to use outbound links to relevant and high-authority websites in your niche (a couple is enough). The logic is that by making your content more helpful to readers (by providing links to other high-quality and highly relevant content on the same subject), you will increase the overall satisfaction of visitors with your content and this will be picked up by search engines. \nH1 Tag \nNever forget to wrap your title in a headline tag! Also, make sure you use the targeted term in a H1 tag. And again, keep it short—no more than 65-70 characters. \nFirst Paragraph \nBe sure to include your keyword once in the first 100-150 words, but don’t overuse it—including it once in the beginning is enough. \n\nMany people who use so-called “black hat SEO” tend to abuse this by mentioning the same keyword over and over again. So Google and other search engines have started to punish websites that appear to be practicing “keyword stuffing.” \nSpeed Tests \nGoogle has always claimed that fast-loading pages perform better in search results than slow ones. Many tests exist that prove the same. We can’t stress enough the importance of checking the page speed of your site once you’re done optimizing it. \nContent \nThis factor hasn’t changed since Day 1 of SEO. Content is king and it always will be. What has changed is search engines’ ability to analyze and discern quality content. Many experts forecast that search engines will soon reach a stage where they will be better able to predict the quality of a piece of content than a human. \n\nWhat this means for your site is that you should always invest in producing original and quality content. There’s also plenty of empirical evidence showing that users (and search engines) prefer longer content, so you should aim for producing at least 800-1000 words per page. \nContent Weight \nEach page could have more than a single focus. In fact you should always look to target so-called long-tail keywords, because they are much easier to rank for. \n\nHowever, for your main focus, the keyword density should be between 4-8% of the total content (i.e. the keyword should be mentioned 4-8 times for each 100 words). For the supporting keywords the target density is 2-3%. \nAttribute Tags \nAlways make sure to add alt tags to the images on each page. Not only it will help with the SEO for the page (because Google pays attention to image alt tags), but it also has the potential to bring some extra traffic to your site. \nSchema Tagging \nSchema.org is an initiative by the leading search engines (Google, Bing, Yahoo!, and Yandex) to “create and support a common set of schemas for structured data markup on web pages.” This common vocabulary can be used to provide structured data to search engines on various types of content such as product reviews, and addresses. \n\nSchema is a great SEO tool that unfortunately still isn’t widely used by agencies for their clients. Make sure to tag all relevant assets on your website to gain an advantage over your competitors. \nMeta Description \nEven though it has been devalued by one of Google’s algorithm updates, meta descriptions are still an important part of SEO. This is the piece of content that is best tailored to be read by humans, so it has the potential to increase your click through rate in search results dramatically. \nBroken Links \nAlways make sure to run tests for broken links on your website as they have the potential to hurt you badly by decreasing your ranking, causing high bounce rate, and providing bad user experience to your visitors. \n\nThere are many ways to check for broken links, but our preferred one is by using Google’s Search Console (formally known as Google Webmaster Tools). \n\nAnother good idea is to think about optimizing the template for your 404 page (i.e. the page visitors see when they reach a dead end on your site) in an attempt to keep some of the visitors who follow a broken link. \nSitemap File \nSitemaps are a crucial element of SEO, but especially for indexing pages that are not well linked and likely not to get indexed by search engines as a result of that (which also means they won’t be included in search engines’ rankings). \n\nWe suggest that you use a dynamic sitemap instead of static one. This way, every time you publish new content, your sitemap will be updated and submitted to search engines, so that your new content gets indexed faster. \nConclusion \nWe hope that you will find this checklist helpful and informative, as we have aimed to give you the best and most actionable advice that you can apply to your site immediately. \n\nWe would be curious to learn what effect using the tips above had on your sites, so let us know by sharing your experience in the comments. \n  Author: Alexander Kesler \nAlexander is the President of inSegment, a Boston-based digital marketing and advertising agency. He is a graduate of Babson College, where he earned a B.S. in Entrepreneurship.... View full profile ›", "source": "Business 2 Community"}