{"published": "2015-09-25T09:40:56Z", "media-type": "Blog", "title": "Film review - Tangerines", "id": "f80b38cc-ed24-4a21-924f-189b58417d54", "content": "Fully deserving of its Oscar and Golden Globe award nominations, Zaza Urushadze’s affecting drama Tangerines (2013) is a bittersweet portrait of cruelty and compassion in the midst of war. During the bloody conflict between Georgia and Abkhazia that erupted in the wake of the Soviet Union’s dissolution, many Estonians living in the region were forced to flee. Tangerines focuses on two immigrant farmers who have remained on their land in order to harvest a tangerine crop. A skilled carpenter, Ivo (Lembit Ulfsak) makes the crates, while Margus (Elmo Nüganen) picks the fruit from his orchard.\n\nWhen a gun battle take place on the dirt track outside their homes, they rescue two wounded soldiers from opposing sides. Ahmed (Giorgi Nakhashidze) is a tough Chechen mercenary fighter, while Niko (Mikheil Meskhi) is a Georgian actor who left a promising theatre career because he felt duty bound to take up arms. As the pair recuperate from their wounds, under the care of Ivo, Margus and their doctor friend Juhan (Raivo Trass), Ahmed and Niko are forced to confront their mutual hatred and desire for vengeance. Gradually, though, influenced by Ivo’s placidity and kindness, they come to recognise the futility of war, the ethnic divisions that fuel the conflict and their shared humanity. Both are put to the test when random battalions of soldiers pass by Ivo’s home.\n\nIt’s a relentlessly male world. No women appear in the film, which underscores the men’s isolation. A photograph of Ivo’s granddaughter serves as a symbolic reminder of his family’s absence. The music adds an extra layer, in particular the conflicting tastes of Ahmed and Niko which causes further heated exchanges, while Niaz Diasamidze's evocative score contributes to the elegiac mood. Rein Kotov’s stunning cinematography captures the bleakness and beauty of the terrain. Ulfsak is superb as the even-handed carpenter harbouring his own secrets and pain. Nakhashiez gives an utterly convincing portrait of a mercenary brutalised by war who, despite his macho posturing, finally earns our sympathy. Except for the gun battles, nothing very much happens until the film’s closing moments but the pitch-perfect performances and Urushadze’s careful unwinding of the story ensure Tangerines is never less than riveting.\n\nOriginally published by Cine-vue.com\n\n[youtube https://www.youtube.com/watch?v=fm-SBi5e7O8&w=560&h=315]", "source": "Lucy Popescu"}