{"published": "2015-09-15T00:30:00Z", "media-type": "News", "title": "Federal researchers urge older adults to aim for much lower blood pressure", "id": "0a391d7a-5226-403f-84f4-117e7aaa4d59", "content": "WASHINGTON — Federal researchers recommended Friday that people 50 and older should work to push their blood pressure significantly below the commonly recommended target, saying a large new study offers critical guidance on a subject that has long been unclear. \n  \nThe new research advises those people to keep their systolic blood pressure — the top number in the reading that health-care providers routinely tell patients — to 120. When the study began in 2009, clinical guidelines called for a systolic blood pressure of 140 for healthy adults and 130 for adults with kidney disease or diabetes. \n\nIn the study, blood pressure medication to keep systolic blood pressure at 120 cut the rate of heart attacks, strokes and heart failure by a third and the risk of death by almost 25 percent. Reaching the conclusions prompted researchers to cut the study short by about a year to report the news. \n\nSystolic blood pressure is a measure of the pressure in the arteries when the heart muscle contracts. Diastolic blood pressure, the bottom number, is a measure of the pressure in the arteries between heartbeats, when the heart muscle is resting and refilling with blood. \n\n\"This study provides potentially lifesaving information that will be useful to health care providers as they consider the best treatment options for some of their patients, particularly those over the age of 50,\" Gary H. Gibbons, director of the National Heart, Lung, and Blood Institute (NHLBI), said in a statement on the agency's Web site. The NHBLI was the primary sponsor of the study, which included 9,300 people age 50 and older. \n\nBetween 2010 and 2013, researchers in the Systolic Blood Pressure Intervention Trial (SPRINT) divided people into two groups. One received medication to keep systolic blood pressure at 140, and another was given \"intensive treatment\" to bring blood pressure down to 120, through an average of three medications, according to the statement. \n\nThe result shows that the lower pressure could save lives among adults age 50 and older with high blood pressure and at least one additional risk factor for heart disease. \n\nHoward S. Weintraub, clinical director of the NYU Center for the Prevention of Cardiovascular Disease, said in a statement, \"Physicians will need to make individualized decisions with each patient regarding how low their blood pressure should be.\" He noted that for people over 75, there are risks involved in lowering blood pressure too far. \n\nAbout 70 million U.S. adults — nearly 1 in 3 — have high blood pressure, according to the Centers for Disease Control and Prevention. High blood pressure greatly increases the risk of heart disease and stroke, the first and third leading causes of death for Americans, according to the CDC.", "source": "Register News"}