{"published": "2015-09-07T16:24:22Z", "media-type": "News", "title": "Rate of global forest loss halved UN report", "id": "4d8917ac-3a06-4794-ae2e-3236031183c0", "content": "Is Modi euphoria over Markets decline to level last seen when BJP leader won  \nCalcutta News.Net - Monday 7th September, 2015 \n \nMonday's stock market decline marks a landmark of sorts for Narendra Modi government. The markets have come back to levels they had last seen when Modi went on to take over the reins of State. Is  ... \n   Pele to come to India after 38 years for Subroto Cup final  \nCalcutta News.Net - Monday 7th September, 2015 \n \nBrazilian legend and football's elder statesman Pele will come to India after a gap of 38 years after accepting an invitation to attend the final of the 56th edition of the Subroto Cup as its chief  ... \n   Minister denies saying India planning operation against Dawood  \nCalcutta News.Net - Monday 7th September, 2015 \n \nUnion minister Rajyavardhan Rathore on Monday denied saying that India may plan 'covert operations' against underworld don Dawood Ibrahim. The denial came after the minister of state for  ... \n   Indrani driver sent to judicial custody for 14 days  \nCalcutta News.Net - Monday 7th September, 2015 \n \nA court here on Monday sent Indrani Mukherjea and her former driver Shyamvar Rai, both prime accused in the murder of Sheena Bora, to judicial custody for 14 days. The third co-accused, Sanjeev  ... \n   PM Modi meets congratulates Ricky Kej for Grammy win  \nCalcutta News.Net - Monday 7th September, 2015 \n \nPrime Minister Narendra Modi on Monday invited internationally acclaimed musician Ricky Kej to personally congratulate him on his win at the 57th Grammy Awards earlier this year. Kej had won the  ... \n   Yechury turns to Ramayana to target Modi  \nCalcutta News.Net - Monday 7th September, 2015 \n \nCPI-M leader Sitaram Yechury on Monday quoted from the Ramayana to ask voters in Bihar to reject Prime Minister Narendra Modi in assembly elections -- and the JD-U and RJD too. Addressing thousands  ... \n   Nippon Paints mulls decorative paint plant in north India  \nCalcutta News.Net - Monday 7th September, 2015 \n \nJapanese paint manufacturer Nippon Paint is mulling setting up a decorative paint plant in north India, a senior company official said on Monday. \"We plan to expand to the north Indian market with  ... \n   Court martial sentence in Machil fake encounter confirmed  \nCalcutta News.Net - Monday 7th September, 2015 \n \nThe army's northern command GOC on Monday confirmed the life sentence awarded to six army personnel, including a colonel-rank officer, by a general court martial in the 2012 Machil fake encounter  ... \n   RSS remote-controlling Modi government Mayawati  \nCalcutta News.Net - Monday 7th September, 2015 \n \nThe Rashtriya Swayamsewak Sangh (RSS) was remote-controlling the Narendra Modi government, Bahujan Samaj Party (BSP) supremo Mayawati has said. The fact that Prime Minister Narendra Modi went to an  ... \n   Shutdown hits life in Srinagar  \nCalcutta News.Net - Monday 7th September, 2015 \n \nA protest shutdown against the failure of the Jammu and Kashmir government to provide relief to the 2014 flood victims on Monday impacted life here, with markets and schools being shut and public  ... \n   Remove Jharkhand CM aide over medicine scam Modi urged  \nCalcutta News.Net - Sunday 6th September, 2015 \n \nFormer Jharkhand chief minister Babulal Marandi has written to Prime Minister Narendra Modi seeking removal of the principal secretary of Chief Minister Raghubar Das till the conclusion of a probe  ... \n   OROP applicable to soldiers who retired prematurely Modi  \nCalcutta News.Net - Sunday 6th September, 2015 \n \nPrime Minister Narendra Modi on Sunday said soldiers who retired prematurely will benefit from the implementation of the 'One Rank One Pension' scheme. Modi addressed a rally - Gati Pragati - on  ... \n   Delhi Metro connectivity to be extended Modi  \nCalcutta News.Net - Sunday 6th September, 2015 \n \nPrime Minister Narendra Modi on Sunday inaugurated a metro line connecting Badarpur in Delhi and Faridabad in Haryana and said the metro connectivity would be extended up to Ballabhgarh to link an  ... \n   Gujarat tops states with fake currency seizures  \nCalcutta News.Net - Sunday 6th September, 2015 \n \nGujarat tops the list of five Indian states that are considered the \"safest\" for circulating counterfeit currency notes - allegedly pushed in by Pakistan's Inter-Services Intelligence (ISI) agency -  ... \n   26 girls to compete for Palaash Miss India-2015 crown  \nCalcutta News.Net - Sunday 6th September, 2015 \n \nA total of 26 girls, shortlisted from almost 1,500 candidates from a 15-city audition across India, will compete at the finale of beauty pageant Palaash Miss India-2015, to be held here on  ... \n   India to issue guidelines on usage of antibiotic medicines  \nCalcutta News.Net - Sunday 6th September, 2015 \n \nIndia will soon issue guidelines on the usage of antibiotics to reduce its misuse and its inappropriate prescription. \"A standard treatment guideline needs to be developed. I understand that India  ... \n   Who will ostracise ghosts of the Sept. 6 2014 Kashmir floods  \nCalcutta News.Net - Saturday 5th September, 2015 \n \nFew Kashmiris can forget the night of September 6, 2014 and the horror that continued for nearly a month after unprecedented floods hit Jammu and Kashmir this day last year. Summer capital Srinagar  ... \n   Kashmir issue can no longer be put on back burner says Pak army chief  \nCalcutta News.Net - Monday 7th September, 2015 \n \nPakistan's Army Chief, General Raheel Sharif on Sunday said Pakistan Army is fully able to respond to attacks on a small or large scale, adding that the enemy will face 'heavy consequences' in any  ... \n   India continues to view Russia as privileged strategic partner says Rajnath  \nCalcutta News.Net - Monday 7th September, 2015 \n \nUnion Home Minister Rajnath Singh held a meeting with the visiting Russian delegation headed by Vladimir Kolokoltsev, Minister of Interior of Russian Federation here on Monday and discussed various  ... \n   Relief for Bdesh Pak minorities seeking regularization in India  \nCalcutta News.Net - Monday 7th September, 2015 \n \nThe Central Government on Monday decided on humanitarian considerations, to exempt Bangladeshi and Pakistani nationals belonging to minority communities who have entered into India on or before 31st  ...", "source": "Calcutta News.Net"}