{"published": "2015-09-28T20:31:50Z", "media-type": "News", "title": "Observation - MANN4 - Mill Creek at Manahawkin (New Jersey)", "id": "35827f77-f1fa-41e1-91b6-4399dddd1ba7", "content": "Search by city or zip code. Press enter or select the go button to submit request \n             Notice: New features, functions, and enhancements to AHPS pages as of 8/11/2015. Click here for details      Forecast services to continue at Langhorne stream gage during Route 213 \r\nbridge construction.   Click \r\nhere for forecast hydrograph, click here to \naccess temporary USGS observations from a gage 0.55 miles downstream located at \nBrownsville Rd. \n     \n\r Auto Refresh: OFF \r \r \n  \r         \n NOTE: Forecasts are not available for the Mill Creek at Manahawkin. Only observed stages are available for this point. \n            Flood Categories (in feet) \n Not Available \nHistoric Crests \n(P) : Preliminary values subject to further review. \n\nRecent Crests \n\n(P) : Preliminary values subject to further review. \n\nLow Water Records \nCurrently none available. \n    \n Show FEMA's National Flood Hazard Layers  \n   \nFEMA's National Flood Hazard Layers not showing? \n  \nNote: Your zoom level may have changed. ESRI's zoom levels must be between 14 and 16 to show National Flood Hazard layers. \n       \nZoom Level:16 \n    \n  Legend   \n   \n  FEMA Layer   \n      Gauge Location    Disclaimer   Latitude/Longitude Disclaimer: The gauge location shown in the above map\n                is the approximate location based on the latitude/longitude coordinates\n                provided to the NWS by the gauge owner.        \nLatitude: 39.695278° N,\n          Longitude: 74.259722° W,\n          Horizontal Datum:\n          NAD83/WGS84 \n  River Stage \nReference Frame  Gauge Height  Flood Stage  Uses  NWS stage  0 ft  Not Available  Interpreting hydrographs and NWS watch, warnings, and forecasts, and inundation maps  Vertical Datum  Elevation \n(gauge height = 0)  Elevation \n(gauge height = flood stage)  Elevation information source  NAVD88  12.87  Not Available  Survey grade GPS equipment, FEMA flood plain maps, newer USGS topographic maps  NGVD 29  Not Available  Not Available  Older USGS topographic maps, NGVD29 benchmarks  MSL  Not Available  Not Available  Older USGS topographic maps, MSL benchmarks  Other  Not Available  Not Available     \nCurrent/Historical Observations: \n  During winter months, cold and ice may result in inaccurate real-time stream stage and streamflow data. Adjustments or deletions of this data can only be done after detailed analysis.     The National Weather Service prepares its forecasts and other services in collaboration with agencies like the US Geological Survey, US Bureau of Reclamation, US Army Corps of Engineers, Natural Resource Conservation Service, National Park Service, ALERT Users Group, Bureau of Indian Affairs, and many state and local emergency managers across the country. For details, please click here .", "source": "National Oceanic and Atmospheric Administration"}