{"published": "2015-09-03T17:32:26Z", "media-type": "News", "title": "Will Apple Watch's success depend on China?", "id": "ccb730be-6e67-4dd1-890c-e05c1dcecca2", "content": "Could the Apple Watch’s success depend on China?\r\n\r\nOver 1 million watches have been sold in China since its May debut, according Quartz, citing research firm RedTech Advisors/TalkingData. Sales for the three-month period ending in June were over 626,000, equal to 22 percent of estimated 2.8 million devices sold globally, according to CNET.\r\n\r\nDemand\r\n\r\nApple Watch adoption in China has been slower than other Apple products, but RedTech said that issue is a lack of supply, according to Q… \r \nApple Watch adoption in China has been slower than other Apple products, but RedTech said that issue is a lack of supply, according to Quartz. Almost 30 percent of activated Apple watches in China came from “grey market” third-party vendors following the product’s debut. \n\nOnce Apple increased the supply, grey-market sales fell to 13 percent, per the report. Currently, 40 percent of Apple Watch sales in China originate from official Apple Stores, 28 percent come from the Chinese online store, and the rest from third-party vendors, gifts and overseas vendors. \n\nApple plans to double its number of retail outlets in China by 2016 to 40. \n\nApple & China \n\nRevenue from China more than doubled year-over-year, and overall revenue was up 33 percent year-on-year, according to Piper Jaffray following Apple’s latest earnings report. China represented 27 percent of total revenue, while iPhone units in China were up 87 percent year-on-year. That compares to 70 percent year-on-year growth in March 2015 and 100 percent growth in December 2014. \n\nStill, Apple Watch sales are slowing in China and aren’t expected to increase until November, when China’s e-commerce companies launch Single’s Day deals. \n\nWatch performance \n\nOptimistic analysts project global sales of between 10 million to 50 million Watches in 2015, according to VentureBeat. However, only 4 percent of Apple’s current value can be ascribed to the Watch, according to MarketWatch, citing stock-research firm Trefis. \n\n“Apple is still in the midst of a transformational, super cycle with the first new product category in five years with Apple Watch, a multi-year iPhone cycle given the larger form factor, momentum in China, potential new areas of innovation (e.g., streaming TV, growing interest in the car) and a rapidly expanding digital matrix (e.g., Apple Music, Apple Pay, CarPlay, etc.),” wrote Brian White, an analyst at Cantor Fitzgerald. \n\nIn its latest earnings call, Apple did report about $2.64 billion in sales of items lumped together that include the Apple Watch, Apple TV, Beats Electronics, iPod and Apple-branded third-party accessories. \n\nGet Silicon Valley Newsletters and Alerts \n\nMorning Edition >> Afternoon Edition >> Breaking News \n\nThank you for signing up \n\nTo serve you bet…", "source": "MyInforms"}