{"published": "2015-09-15T06:01:12Z", "media-type": "News", "title": "SE Asia Stocks -Mixed ahead of Fed; Indonesia falls on weak trade data", "id": "371bbf60-6fc4-487d-b4de-cbfb616871d3", "content": "BANGKOK, Sept 15 Southeast Asian stock markets\nwere mixed on Tuesday as investors awaited the U.S. Federal\nReserve's interest rate decision, with the Indonesian index\nretreating after weak August trade data, but Malaysian shares\nrose on stimulus and ahead of a holiday.\n    Jakarta's composite index fell 1.2 percent,\nreversing Monday's gain, when the market saw net foreign buying\nfor the first time in 10 trading days. \n    Selling in large-caps was broad-based, with 28 out of 30\nstocks measured by the MSCI index of Indonesia \nfalling. Real-estate developer Bumi Serpong Damai was\ndown 4 percent, among the top losers on the index, on\nforeign-led selling.\n    Data showed Indonesia posted a $433 million trade surplus in\nAugust, smaller than the $630 million surplus forecast in a\nReuters poll. The surplus was only one-third of the revised\n$1.38 billion that the country had in July. \n    Malaysia's index rose 0.5 percent. It had rallied on\nMonday after Prime Minister Najib Razak said the government\nwould inject 20 billion ringgit ($4.6 billion) into a state\ninvestment firm to shore up the stock market. \n    Malaysia will be closed on Wednesday for a market holiday.\n    The Thai SET index inched up 0.2 percent after three\ndays of losses. Optimism about the government's infrastructure\ninvestment sent shares of Italian Thai Development up\n0.6 percent.\n    The SET is poised to be range-bound or ease slightly on\nTuesday, ahead of the Fed rate decision, to be known on Thursday\nnight in Bangkok, said broker KGI Securities.\n    \"While most economists take a 'no hike' view, the\nuncertainty may remain until the FOMC announcement,\" KGI's\nstrategists wrote in a report.\n    Singapore declined 0.8 percent, in line with Asia.\n \n    The Philippines rose for a third day and Vietnam\n rebounded after three days of losses.\n    Morgan Stanley upgraded Singapore to most preferred market\nin ASEAN while Credit Suisse raised its 2015 range for\nPhilippines' key stock index to 7,500-6,750, up from 7,095 now\nciting new assumptions on price-to-earnings.\n  \n       \nFor Asian Companies click;  \n\nSOUTHEAST ASIAN STOCK MARKETS\n Change at 0529 GMT\n Market             Current     Prev Close    Pct Move\n Singapore          2847.66       2871.47       -0.83\n Kuala Lumpur       1647.54       1639.63       +0.48\n Bangkok            1379.15       1377.15       +0.15\n Jakarta            4338.07       4390.37       -1.19\n Manila             7095.60       7069.18       +0.37\n Ho Chi Minh         563.49        562.17       +0.23\n \n (Reporting by Viparat Jantraprap; Editing by Sunil Nair)", "source": "Reuters UK"}