{"published": "2015-09-02T19:34:18Z", "media-type": "News", "title": "Cross arm failure caused power outage", "id": "9bb161d9-7d4e-4256-8f49-53d01483de86", "content": "A failed cross arm on a single pole Monday created a power outage for 3,874 customers of Socorro Electric Cooperative. The outage encompassed the areas west and south of Socorro, including San Antonio, Luis Lopez, Bosque del Apache National Wildlife Refuge, Bingham and White Sands’ Stallion Site. The blackout also extended west of Socorro, affecting Magdalena and Alamo, Datil, Pie Town, Quemado and everything in between. \n \nThe pole in question was just west of the substation west of the New Mexico Fire Fighting Academy, according to SEC’s Socorro Line Foreman Tony Lopez. \nThe calls started coming in at about 3 p.m., Lopez said. \n \n“We had guys scheduled out at other projects and calls,” he said. “Once the (outage) calls came in, they were brought in and we started to patrol the \nline, pole by pole, to find the break.” \n \nNo matter what causes an outage, line crews have to physically check the lines, sometimes a matter of miles from a road or highway, but this time they got a call that helped pinpoint the location. \n \n“Fortunately, we had a member who called in and said he heard glass breaking,” Lopez said. \n \nThe sound was not the breaking of glass, but that of a porcelain insulator. A cross arm had broken. \n \n“It was the horizontal timber brace, the cross arm” he said. “Each pole has a horizontal timber cross arm that supports two lines.” \n \nEach transmission line carries 69,000 volts. \n \n“The failure of that cross arm was the main source of the outage,” Lopez said. \n \nAfter the break was located Lopez contacted Tri-State (Generation and Transmission])to “let them know what we found.” \n \nA switching order then has to take place before a crew can begin to make repairs. \n \n“We locate where our safety points are so our guys are in a safe environment,” he said. “We isolate the two points and put our personal protection ground up (tying every line to ground). Once we’ve created that we made contact with the supplier and had the material shipped to us at the site” \n \nThen the crew goes up and takes the old cross arm down and attaches the new one. \n \n“We just reverse the process of switching with Tri-State after replacing the cross arms,” Lopez said. “Once we report back that all men and equip are clear, (and personal grounds removed) I can give the order to go ahead a re-energize the line.” \n \nLopez said discussions were held with Tri-State as to the cause of the cross arm breaking, and it basically came down to wear and tear. \n \n“Possibly windstorms over time weakened the cross arm,” he said. “We put it down as an arm that just went bad.” \n \nThe total affected in District IV was 1,129 customers. In District II and V the outage affected 2,745. \n \n ", "source": "El Defensor Chieftain"}