{"published": "2015-09-12T13:33:15Z", "media-type": "Blog", "title": "TriORE - Victory Rising lyrics", "id": "95ba886d-8f00-4986-a22d-72dd76550b67", "content": "Post my meaningWrite my explanationnew\nTo explain lyrics, select line or word and click \"Explain\".\nCreate lyrics explanation Select some words and click \"Explain\" button. Then type your knowledge, add image or YouTube video till \"Good-o-meter\" shows \"Cool\" or \"Awesome!\". Publish your explanation with \"Explain\" button. Get karma points! OK, got it!\nNew! Read & write lyrics explanationsHighlight lyrics and explain them to earn Karma points. TriORE – Victory Rising lyrics\nVictory is rising and the world has turned insane\nSleeping dogs are waking and the little children pray\nDying suns are setting in a sky of raging war\nWe think about the good times while we perish with before\n\"I bring you lies, I bring with me\nA dream that only, we can see\nI bring eyes; I bring you teeth\nI have a dream, reserved for me\"\nVictory is rising with the advent of the tide\nBroken men are crying while they stagger in the night\nStorm clouds are ascending where the falling stars collide\nWalking through the fires to the sound of life that dies\nLyrics taken from http://www.lyricsmode.com/lyrics/t/triore/victory_rising.html\nExplanations\nnew\nTo explain lyrics, select line or word and click \"Explain\".\nMeanings\nShare\nlink: Embed: Email\nPrint\nCorrect\nAdd song structure elements Click \"Correct\" to open the \"Correction form\". There you can add structure tags, correct typos or add missing words. Send your correction and get karma points! Result of your work will appear after moderating. OK, got it!\nTweet\nLike\nTweet\n+1\nSubmitted byburunduk666\nhotlyrics\nDrag Me Down\nOne Direction\nShe's Kinda Hot\n5 Seconds Of Summer\nGood For You\nSelena Gomez\nCan't Feel My Face\nThe Weeknd\nTrap Queen\nFetty Wap\nWorth It\nFifth Harmony\nsongmeanings BestRecent0 meaning Write about your feelings and thoughts\nKnow what this song is about? Does it mean anything special hidden between the lines to you? Share your meaning with community, make it interesting and valuable. Make sure you've read our simple tips\nHey! It's useful.\nIf this song really means something special to you, describe your feelings and thoughts. Don't hesitate to explain what songwriters and singer wanted to say. Also we collected some tips and tricks for you: Don't write just \"I love this song.\" Hidden between the lines, words and thoughts sometimes hold many different not yet explained meanings Remember: your meaning might be valuable for someone Don't post links to images and links to facts Write correctly Don't spam and write clearly off-topic meanings Don't write abusive, vulgar, offensive, racist, threatening or harassing meanings Do not post anything that you do not have the right to post Please note: We moderate every meaning\nFollow these rules and your meaning will be published. Write song meaning Type your knowledge till \"Good-o-meter\" shows \"Awesome!\". Then send your meaning with \"Post meaning\" button. Get karma points! OK, got it!\nU\nSign up or log in with Post meaning\nMin 50 words Not bad Good Awesome! Lyrics→TriORE→Victory Rising lyrics This page is missing some information about the song. Please expand it to include this information. You can help by uploading artist's image, adding song structure elements, writing song meaning or creating lyrics explanation. more artist lyrics\nAfter Summer We Fall\nFires Burn, Like Fires Do\nNo Tears Are Shed For You And Me\nLet Us Meet In The Trenches\nEuropa's Dream\nThe Missing Hour\nPleasures And Tortures\nThere's A Smell To Life That Dies\nAnother Love, Another Hate\nAll TriORE Lyrics →\nFeaturedlyrics·All About That Bass LyricsMeghan Trainor·Sledgehammer LyricsFifth Harmony·One Last Time LyricsAriana Grande·Thinking Out Loud LyricsEd Sheeran·Only LyricsNicki Minaj·Hey Mama LyricsDavid Guetta·Infinity LyricsMariah Carey·Heartbeat Song LyricsKelly Clarkson·I Lived LyricsOneRepublic·Want To Want Me LyricsJason DeRulo\nExplain\nView 10 more explanations\nAdd your explanation\nWrite an explanation\nUsername\nYour explanation\nBoldItalicLinkAdd an image new!\nExplain\n20 words Good Cool Awesome! Explanation guidelines:\nDescribe what artist is trying to say in a certain line, whether it's personal feelings, strong statement or something else. Provide song facts, names, places and other worthy info that may give readers a perfect insight on the song's meaning. Add links, pictures and videos to make your explanation more appealing. Provide quotes to support the facts you mention. Before you get started, be sure to check out these explanations created by our users: good, very good, great. ×\n×\nCongratulations!\nKeep posting annotations and earn\nrespect from LyricsMode community. Yep, I'm cool!", "source": "New lyrics for Sep-12-2015 at LyricsMode.com"}