{"published": "2015-09-19T04:01:00Z", "media-type": "News", "title": "Who says the NFL isn't a good place for rookies?", "id": "337a32f7-bcfe-4744-8f44-a38cb6381b7e", "content": "Hey rook, get out there and show us something. \n\nA bunch of NFL newcomers, led by Tennessee quarterback Marcus Mariota, looked like seasoned veterans on opening weekend. In some cases, that will last. In others, don't count on it. \n\nMariota was magnificent in outdueling fellow Heisman Trophy owner Jameis Winston in the Titans' rout of the Buccaneers last Sunday. It wasn't just the numbers as the No. 2 overall pick vastly outperformed the top choice last May. It was the poise and confidence Mariota displayed in throwing for four touchdowns in the first half and making what is expected to be a pedestrian offense look like the 2007 Patriots. \n\nAll in a day's work for Mariota, his coach says. \n\n\"I can't imagine that he didn't get more attention, than winning one game, in his career in college,\" Ken Whisenhunt said. \"I don't think this even compares to that, winning the Heisman. He's fine. I don't think it's a big deal to him.\" \n\nAlmost as impressive were the debuts of three other first-year Titans: right tackle Jeremiah Poutsai, a third-round pick; sixth-round linebacker Deiontrez Mount, who had an interception; and fourth-rounder DL Angelo Blackson, who had a sack of Winston. \n\nWhisenhunt seemed most enthused about Mount — aside from Mariota, of course: \n\n\"It's exciting to see a young player like him develop,\" he said. \"One of things that's been pretty consistent with our young guys is that they like football and they work hard at it. (Mount) is a kid that's worked really hard at it.\" \n\nWorking hard and working out are two entirely different scenarios. Any rookie who doesn't put in the effort is doomed; no coaches will put up with laziness. If a kid out of college makes a roster, his diligence can be assumed. \n\nIf a kid makes an immediate contribution on the field, it can become a building block. \n\nThe Patriots went with three rookie offensive linemen in their opening victory against Pittsburgh. Granted, the Steel Curtain was anything but at Gillette Stadium, but the youngsters' play was at the very least solid. \n\nDavid Andrews made every snap at center, while right guard Tre' Jackson was in on five possessions. Left guard Shaq Mason also played five series. The only times Tom Brady was touched were on a blitz and a busted screen pass. \n\n\"I think all three of those rookies that played on the inside did phenomenal,\" Brady said. \"It's a tall task to get them up to speed with all different variations and protections and adjustments that we tend to make, and I thought they really hung in there. They played with a lot of toughness, so it was great.\" \n\nOther rookies making notable debuts were Seattle WR-KR Tyler Lockett; Buffalo CB Ron Darby, RB Karlos Williams and RG John Miller; Atlanta RB Tevin Coleman and LB Vic Beasley; Kansas City CB Marcus Peters; and San Diego LB Kyle Emanuel. \n\nIndianapolis started two rookie defensive linemen for the first time, Henry Anderson at end and David Parry at tackle. Anderson had a team-best nine tackles (eight solo) and played better than most of his teammates in the loss at Buffalo. \n\nOf Buffalo's newcomers, Darby might have had the biggest challenge facing Andrew Luck in his first NFL action. \n\n\"We don't go into any week intimidated by a quarterback,\" said the kid from Florida State, who certainly played in lots of big spots for the Seminoles. \"We make the plays and we have trust in our guys up front and we know they're going to get there, so we just go out there and compete.\" \n\nThat rookies even get the chance to compete has become a given in today's NFL. The salary cap demands it; rookies are cheap labor compared to vets. \n\nWhat's most encouraging is that not just high draft picks tend to contribute right away. Emanuel was a fifth-rounder. Two of New England's linemen were fourth-rounders and Andrews wasn't drafted. \n\nWe probably haven't come close to seeing the best from the rookies. Remember that the 2014 rookie award winners did virtually nothing early in that season. Giants wideout Odell Beckham Jr. didn't play for the first month. Rams DT Aaron Donald was nearly invisible, tough for a 285-pounder to manage, for the same stretch. \n\nThen they made a huge impact — exactly what coaches are looking for. \n\n\"The respect from their teammates, that's No. 1,\" said new Falcons coach Dan Quinn. \"It's like, 'You can count on me to get the job done.' That's what a young player needs to do early in his career. ... For those guys to come through and do that, it goes a long way, it really does.\" \n\n--- \n\nAP Pro Football Writer Teresa M. Walker and Sports Writers Dave Skretta, Charles Odum, John Wawrow, Tim Booth, Bernie Wilson, Fred Goodall and Michael Marot contributed to this story.", "source": "Tacoma News Tribune"}