{"published": "2015-09-07T04:00:00Z", "media-type": "News", "title": "Kingston's primary school pupils achieving above national average with girls doing better than boys", "id": "a097c96c-b080-425f-94f0-a50929fe0f49", "content": "Girls in the borough are achieving more in maths, grammar and reading than boys of the same age. \n \nStatistics recently released by the Department for Education found Kingston students at key stage two – ages seven to 11 – were above the national average. \n \nSince 2009, the percentage of pupils making “expected progress” in maths has also increased from 85 to 91. \n \nIn maths tests, both sexes were found to be fairly equal in their results, but girls extended the gap by outperforming boys in grammar, punctuation and spelling by 7 per cent. \n \nNationally, more than 14,000 more girls than boys achieved level five or above in reading, writing and maths, with 80 per cent achieving the expected level four. \n \nAlthough the borough did not make it into the top 10 performing education authorities, all the statistics for 2015 testing were above 80 per cent for pupils gaining level four, the average standard. \n \nCouncillor Andrea Craig, Cabinet Member for Growth and Identity, said: \"Our schools continue to achieve high standards across the board. \n \n\"Once again our key stage exam results are above the average. This is down to the dedication and hard work of our teachers, the senior management in our schools and the support they get from Achieving for Children.\" \n \nThis is the last time levels will be used to assess performance at the end of primary school. \n \nFrom 2016, pupils will be given a scaled score, with 100 as the expected standard. \n \nSchools Minister Nick Gibb said: “Our reform programme is driven by social justice and we will continue to raise the bar so young people are prepared to succeed in modern Britain.” \n \n Results for 2015 assessments:  \n \n Maths: 91 per cent of girls achieved level 4 or higher, boys achieved 90 per cent.  \n \n Grammar, punctuation and spelling: 88 per cent of girls achieved level 4 or higher, boys achieved 81 per cent.  \n   \n Share article  \n   \n Reading: 93 per cent of girls achieved level 4 or higher, boys achieved 90 per cent.  \n  Got a story? Email ellie.cambridge@london.newsquest.co.uk or call the newsdesk on 020 8722 6318.", "source": "Kingston Borough Guardian"}