{"published": "2015-09-02T12:05:17Z", "media-type": "News", "title": "Unable to make a decision on a woman he's never met before, Bachelor gives everyone a rose", "id": "29c266dc-e879-41dc-985e-81fbe05a4484", "content": "In a choice between two women he knew very well, and one he never met before, Bachelor Sam Wood delivered the ultimate middle finger to traditional notions of building a lasting and meaningful relationship by giving everybody a rose. In a choice between two women he knew very well, and one he never met before, Bachelor Sam Wood delivered the ultimate middle finger to traditional notions of building a lasting and meaningful relationship by giving everybody a rose. Everyone gets a prize! And the worth of a red rose is reduced to on par with a participation award at under-12 cricket.\n\nOn Wednesday night, Bachelor Sam \"Woody\": Wood, man of steel, flounders in attempting to pick which beautiful lady he will continue to allow to entertain him.\n\nFaced with a choice between Nina, Rachel and Rachel's lookalike, and a firm rider to choose only two, the Bachelor cracks under the pressure and dozens of TV spotlights trained on his face.\n\n\"I look over at Sam and his face, like, he's sweating,\" Heather says.\n\n\"Something's really up. He's not in a good place. He is taking a really long time to say their names and you can just tell it's a hard decision for him to make.\n\n\"I just need a little minute... to think, sorry,\" apologises the Bachelor, his nerves shot.\n\n\"What the F is going on,\" says Heather, in another reminder of why she's the best.\n\nAfter a short and commercially lucrative ad break, the Bachelor returns to consult his wise oracle, Osher Gunsberg.\n\n\"One of them I've hardly spent any time with. Even the girls that I've spent a lot of time with I feel like I haven't spent enough time with.\"\n\n\"This is your life,\" replies Osher, greatly overestimating the stakes.\n\nAnd... the Bache cannot do it. Everyone gets a rose, and everyone is equally disappointed.\n\nThat serves to put a dulling sheen of varnish on an episode in which we critiqued Rachel's lack of a maternal instinct, and maybe saw the sights of Sydney.\n\nFirst, we have a group date, in which the ladies play with children as Sam watches and appraises. Remember, as a woman you're worthless unless you're a mother.\n\n\"I don't care... how you are with a bunch of kids that you've never met before, compared to your maternal instincts kicking in when you become a mum,\" Sam reassures a worried Sarah.\n\n\"Yeah. Well, that's what I'm just hoping that that's just going to come into place when I do.\"\n\nYou better hope they do Sarah, otherwise you're not getting a rose.\n\nThe other big plot point tonight is the emergence of a real contender for Woody's heart and strangely-oversized mouth. Lana, an intruder (who Nina, being Nina, hates with the fire of a thousand burning suns) makes the Bache feel lots of feelings.\n\nMostly he feels that she's more cultured than him - because she speaks Spanish. Mate, there is a lot of people in the world who speak Spanish.\n\nAnyway, Lana got tonight's single date. Everyone is thrilled for her luck, particularly Nina who does not threaten to kill her.\n\nTonight's date is parasailing, which is like skydiving but much more boring, actually. Really, you just sit there in the sky. It's very dull. To kill the time, Woody and Lana guess at tourism attractions.\n\n\"If you look over to your right, I thinkkkk that's the quarantine station,\" Lana tells Woody, who nods. Uh huh.\n\nThey dance to an apparently famous bloke with an acoustic guitar, and Woody takes his opportunity to do this\n\n\" /\n\n\"I like Sam. (LAUGHS EMBARRASSEDLY) Dammit.\"\n\nAdorable. Unless you're Nina. The story first appeared on The Sydney Morning Herald.", "source": "Maitland Mercury"}