{"published": "2015-09-16T18:20:06Z", "media-type": "News", "title": "Muslim schoolboy arrested in US for homemade clock", "id": "9fb6291e-6861-4bba-a7b2-9a00b0fc8bb8", "content": "Related A Muslim teen was led out of a Texas school in handcuffs after a teacher mistook his homemade digital clock for a bomb, prompting accusations of Islamophobia and an online backlash Wednesday.\n\nA photo of Ahmed Mohamed, 14, standing in handcuffs while wearing a t-shirt with the US space agency NASA's logo was retweeted thousands of times in a matter of hours and \"#IStandWithAhmed\" was the top trending hashtag on Twitter.\n\nAmong those voicing support for the boy was Hillary Clinton, who tweeted: \"Assumptions and fear don't keep us safe-they hold us back. Ahmed, stay curious and keep building.\"\n\nMohamed told The Dallas Morning News that he was just trying to impress his teachers when he brought the clock to MacArthur High school on Monday.\n\n\"My hobby is to invent stuff,\" he said in a video posted on the paper's website that was filmed in his electronics-filled bedroom.\n\n\"I made a clock. It was really easy. I wanted to show something small at first... they took it wrong so I was arrested for a hoax bomb.\"\n\nMohamed, who had loved robotics club in middle school and was hoping to find something similar in high school, said he didn't get the reaction he was looking for when he showed the clock to his engineering teacher.\n\n\"He was like, 'That's really nice,'\" Mohamed said. \"'I would advise you not to show any other teachers.'\"\n\nBut the alarm went off during his English class, and that teacher told him it looked like a bomb and confiscated the clock.\n\nThe school called police and Mohamed was taken away in handcuffs amid suspicion that he intended to frighten people with the device.\n\nThe aspiring inventor, who lives in Irving just outside Dallas, said police would not let him call his parents during a lengthy interrogation. Once released, he was suspended from school for three days.\n\nPolice said Wednesday that they have determined that Mohamed had no malicious intent and it was \"just a naive set of circumstances.\"\n\n\"We're not going to pursue this any further,\" Irving police chief Larry Bond told reporters.\n\nBond insisted that Mohamed's ethnicity had nothing to do with the police response.\n\n\"Our reaction would have been the same either way. That's a very suspicious device,\" Bond said.\n\nHe also insisted that officers did the right thing when they handcuffed Mohamed and brought him to a juvenile detention center for questioning.\n\nAll prisoners are handcuffed for their own safety, Bond said, adding \"unfortunately we've had people jump out of cars.\"\n\nA school district spokeswoman also stood by the school's response, telling reporters that once people see images of the homemade clock they will understand that \"we were doing everything with an abundance of caution.\"\n\nA photo provide by police to local media showed a flat, rectangular red digital clock face screwed into the dark plush interior of a silver case along with a circuit board and some wires.\n\nThe Council on American-Islamic Relations said the heavy-handed response is particularly suspicious given the current political climate in Irving.\n\nMayor Beth Van Duyne has claimed that Muslims are plotting to impose Sharia law in America.\n\n\"This all raises a red flag for us: how Irving's government entities are operating in the current climate,\" Alia Salem, who directs the council's North Texas chapter, told the Morning News.\n\n\"We're still investigating,\" she said, \"but it seems pretty egregious.\"\n\nWired magazine was among those who responded to the incident with a mixture of humor and horror, posting an article entitled \"How to Make Your Own Homemade Clock That Isn't a Bomb\" and encouraging kids to bring them to school.\n\nMohamed's family launched a Twitter account Wednesday to thank his supporters using @IStandWithAhmed as his handle.", "source": "Al Ahram"}