{"published": "2015-09-03T05:15:52Z", "media-type": "News", "title": "Espinosa’s SP majority  formula questioned", "id": "c5ee235c-b826-4758-ad9e-deb5923fcc7c", "content": "BY MERIANNE GRACE EREÑETA \n \nILOILO City – Vice Mayor Jose Espinosa III does not know how to count? \n \nHe should not have included himself among the councilors eligible to vote for the proposed ordinance granting a franchise to an applicant seeking to operate a cockpit, said Councilor Lyndon Acap. \n \nOf the 12 councilors present during the Sangguniang Panlungsod’s (SP) session on Tuesday, seven voted in favor of Rockwell and Lumber that plans to operate a cockpit in Barangay Esteban, Lapuz district. \n \nAccording to Acap, seven was the majority vote or more than half of 12. \n \nThe chairman of the committee on games, amusements and professional sports said he will seek a “reconsideration.” \n \n“I went to Ma’am Ruth (Arroyo) – the SP secretary – kon may insakto nga pamaagi (on what is the proper procedure to do so),” said Acap whose committee endorsed Rockwell and Lumber’s franchise application. \n \nOn Tuesday, Espinosa said the majority count was eight. He raised the number of those eligible to vote to 13 (12 councilors plus himself as presiding officer). \n \nHe arrived at eight as majority number using the formula of “half plus one” then rounding it off. \n \nNobody voted against granting Rockwell and Lumber a franchise. The five other councilors present merely opted to abstain. They were councilors Armand Parcon, Jason Gonzales, Ed Peñaredondo, R Leone Gerochi, and Lex Tupas. \n \nThe seven councilors who voted in favor of Rockwell and Lumber were Acap, Rodel Fullon Agado, Joshua Alim, Jay Treñas, Reyland Hervias, Lady Julie Grace Baronda, and Liezel Zulueta-Salazar. \n \n“Nakakuha kami seven votes, which is more than half of 12,” said Acap. \n \nEspinosa could not be reached for comment as of this writing. \n \nCouncilor Alim also had the same position as Acap’s. He said right after the voting on Tuesday that the SP presiding officer can only vote if there’s a tie in the voting. There was none on Tuesday. \n \nLast week, the SP granted Iloilo Sportsmen, Inc. a franchise to operate the Iloilo Coliseum as a cockpit arena. \n \nThe coliseum is located in Barangay San Isidro, Jaro district and is the frequent venue of big-time cock derbies in Iloilo City, notably the Candelaria derby every district fiesta of Jaro. \n \nAcap believes that more cockpits can deliver huge financial revenues to Iloilo City. Two months ago he introduced a measure allowing the operation of cockpits in the city’s six districts – excluding the City Proper – but it failed to gather support from fellow councilors./ PN", "source": "Panay News"}