{"published": "2015-09-28T00:00:00Z", "media-type": "News", "title": "SAP Joins Global Partnership for Sustainable Development Data as Founding Member", "id": "a124c1f4-db4d-4a76-b55e-f6a690ba62c2", "content": "September 28, 2015 \r\n            | SAP - Corporate \r \n \nSAP NEWSBYTE - SAP SE (NYSE: SAP) today announced that it is joining the Global Partnership for Sustainable Development Data as a founding member to help governments and citizens achieve the UN’s 2030 Sustainable Development Goals (SDGs) .The Global Partnership for Sustainable Development Data is a collaboration of governments, nongovernmental organizations (NGOs), companies and citizens who have committed to harnessing data to achieve measurable advancement toward the SDGs. \r \n\nAs the world undergoes rapid digital transformation against a backdrop of major challenges such as climate change and persistent disease, customers are already making use of SAP® solutions in projects relevant to the SDGs. For example, mobile, Big Data and Internet of Things (IoT) technologies from SAP are being successfully used in Buenos Aires to help mitigate flooding during seasonal rains, which are expected to intensify in the future. \r \n\nTo help people everywhere understand the crucial role of data in monitoring and achieving the SDGs, SAP and the Global Partnership for Sustainable Development Data will host 100 screenings of the award-winning documentary film The Human Face of Big Data , in 10 languages in locations worldwide. \r \n\n“The 2030 Sustainable Development Goals are everyone’s responsibility and an urgent to-do list for the world; they are reflected in our vision to help the world run better and improve people’s lives,” said Daniel Schmid, chief sustainability officer, SAP.\r \n\n“We will help in every way possible, with our Big Data and other solutions, our corporate social responsibility activities , and through advocacy with our sizable global community of customers, employees and partners,” said Isabella Groegor-Cechowicz , global general manager, SAP Public Services. \r\n\r \n\nFor more information, visit the SAP News Center . Follow SAP on Twitter at @sapnews . \r \n\nMedia Contacts: \n\r\nMat Small, +1 (510) 684-3552, m.small@sap.com , PDT \n\r\nErin Albright, FleishmanHillard, +1 (212) 453-2344, erin.albright@fleishman.com , EDT \nSAP News Center press room ; press@sap.com \r \n\nAny statements contained in this document that are not historical facts are forward-looking statements as defined in the U.S. Private Securities Litigation Reform Act of 1995. Words such as “anticipate,” “believe,” “estimate,” “expect,” “forecast,” “intend,” “may,” “plan,” “project,” “predict,” “should” and “will” and similar expressions as they relate to SAP are intended to identify such forward-looking statements. SAP undertakes no obligation to publicly update or revise any forward-looking statements. All forward-looking statements are subject to various risks and uncertainties that could cause actual results to differ materially from expectations. The factors that could affect SAP's future financial results are discussed more fully in SAP's filings with the U.S. Securities and Exchange Commission (\"SEC\"), including SAP's most recent Annual Report on Form 20-F filed with the SEC. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of their dates.", "source": "Sapinfo Magazine"}