{"published": "2015-09-21T03:13:39Z", "media-type": "News", "title": "Visit California and Union Pay partner for 'China Ready' road shows", "id": "ea4376b5-74fc-436f-8726-7cbb7ff52122", "content": "State tourism agency Visit California is collaborating with Chinese payment provider Union Pay to enhance the 'China Ready' policies of tourism providers in the state.\n\nCalifornia is already the top US state for China visitors with more than one million arrivals in 2014.\n\nVisit California and Unon Pay International will hold 'Global Ready China' seminars for hotels, restaurants, and tour companies aimed at cultural awareness, and sales and service levels for the Chinese market.\n\nHeld at several destinations throughout the state, the first two hour seminar kicks off on September 23 in San Francisco.\n\n\"The Chinese spent $2.5 billion in California last year, and by working together we can help California businesses better connect with customers from this rapidly growing market,\" said Caroline Beteta, CEO of Visit California.\n\n\"UnionPay is the fastest-growing payments provider anchored firmly in China, and this strategic partnership will assure that California businesses are rolling out the red carpet for our Chinese visitors.\"\n\nDespite the economic slowdown, the China market is expected to grow further and last year surpassed 100 million international trips for the first time.\n\n\"UnionPay acceptance has become an important criterion for assessing the level of satisfaction of Chinese visitors with their overseas travel experience. UnionPay International is excited to work in cooperation with Visit California to help prepare the tourism industry for more Chinese visitors,\" said Miriam Park, general manager of UnionPay International America.\n\n\"It is our goal to grow our presence with California merchants so that we can provide high quality, cost effective and secure cross-border payment services to our cardholders and ensure convenient local services to cardholders and merchants.\"\n\nMore seminars are planned state-wide including in Santa Barbara, Napa Valley, Anaheim and San Diego and entry is free for all local tourism businesses.\n\n.\n\nMonday, September 21, 2", "source": "Travel Mole"}