{"published": "2015-09-08T15:26:59Z", "media-type": "News", "title": "Huawei to Present at CTIA Super Mobility 2015 and Rural Wireless Summit", "id": "23a53f13-e5e8-4e24-a4ee-4ccf5ea04991", "content": "SOURCE Huawei\n\nLAS VEGAS \n\n\"In partnership with tier three carriers and wireless internet service providers, Huawei is committed to bringing faster and reliable broadband connectivity to underserved rural communities in America,\" said Ming He \n\nHuawei's executives will speak at two sessions:\n\nThroughout the show, Huawei's experts will be on hand to demonstrate an array of products including its industry-leading GOSP cabinet system, 98 percent efficient power rectifier system, wireless backhaul, distributed CCAP, optical solutions, power solutions, and its ATN multiservice access products. Huawei's booth at the Rural Wireless Summit is located at 6021-A.\n\nAbout Huawei\n\nHuawei is a leading global information and communications technology (ICT) solutions provider. Our aim is to enrich life and improve efficiency through a better connected world, acting as a responsible corporate citizen, innovative enabler for the information society, and collaborative contributor to the industry. Driven by customer-centric innovation and open partnerships, Huawei has established an end-to-end ICT solutions portfolio that gives customers competitive advantages in telecom and enterprise networks, devices and cloud computing. Huawei's 170,000 employees worldwide are committed to creating maximum value for telecom operators, enterprises and consumers. Our innovative ICT solutions, products and services are used in more than 170 countries and regions, serving over one-third of the world's population. Founded in 1987, Huawei is a private company fully owned by its employees.\n\nFor more information, please visit Huawei online at www.huawei.com or follow us on:\n\nhttp://www.linkedin.com/company/Huawei\n\nhttp://www.twitter.com/Huawei\n\nhttp://www.facebook.com/Huawei\n\nhttp://www.google.com/+Huawei\n\nhttp://www.youtube.com/Huawei\n\nMedia contacts:\n\nJannie Tong \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/huawei-to-present-at-ctia-super-mobility-2015-and-rural-wireless-summit-300139021.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KRHD TV"}