{"published": "2015-09-08T23:19:04Z", "media-type": "Blog", "title": "Merging back...", "id": "1303de89-d467-4348-b65c-19c14e247b11", "content": "That blog break went fast!  Only a few items on my Blog Break To Do list were accomplished.  A couple days into the break, an intense rare September heat wave settled in and as I type, a (hopefully) heat wave breaking cold front is bringing heavy rain outside.  It has lasted that long.\nIt has been miserable, even with the air conditioner on one could feel the humidity.  Before the heat moved in, I was able to get one set of shelves all cleaned in the garage.  I put on my husband's allergy mask, set the iPad Podcast App to play a couple favorites, and put plastic bags over both hands to get started.\nI know... a whole lot of protection for simply cleaning the garage but these were the worst of the shelves, those which were quarter inch deep with mouse droppings.  We had mice everywhere this summer, including finding one swimming in my washing machine (I had my husband put it in a Mason jar and let it loose in the forest... smelling of Charlie's Soap).\nApparently the mice, much like the cold blooded creatures in my front lawn, didn't like the weather.  I told you about them.  I never saw an alligator but it wouldn't have surprised me.  It was a crazy summer of weather extremes.\nAnyway, I had to throw away a lot of stuff because of those mice.  So now everything (even on the higher shelves where we hadn't had mice reach until this summer), is carefully placed in protective custody.   At least that worse set of shelves was finished before the heat wave hit.\nI did get the Study completely organized as we moved most of my son's stuff from the big bookshelf to his closet in the Study.  We'd agreed we would keep his stuff in it until they move to a bigger house.  But to make room for the other books and stuff, his clothes had to go.  Everything he can still wear went to his current place.  All three trash bags of his \"teenage clothes\" went to charity. \nWhile clearing it all out, I found two of my daughter-in-law's \"dressy dresses\".  Left behind from when we stored some of their things before they moved into their house last summer.  We all got quite the chuckle because my son is built like a football player, imagining him in these tiny glittery dresses.  It still makes me laugh.  She obviously had her dresses returned, too.\nAll that to report on \"What I Did on My Summer Blog Vacation\".  Wednesday and Thursday I'll be back with book reviews.  Because they are due now!\nFriday, I will pull the number out of the hat (so to speak) and see who wins the beautiful Pantry book.  There is still a chance to win! \nThe Give Away post can be found... here.", "source": "Coffee Tea Books and Me"}