{"published": "2015-09-25T17:26:14Z", "media-type": "News", "title": "Obama Praises John Boehner For His Service Despite 'Disagreements'", "id": "f8a65c25-08bb-4b1a-b0a3-9f7994eb33a3", "content": "President Barack Obama weighed in on House Speaker John Boehner's (R-Ohio) resignation Friday, praising him as a \"good man\" and urging his successor to avoid a government shutdown. Obama, noting that the resignation took him by surprise, said he spoke to Boehner on the phone after hearing the news. \"John Boehner is a good man,\" Obama said. \"He is a patriot, he cares deeply about the House, an institution in which he has served for a long time, he cares about his constituents and he… \r \nPresident Barack Obama weighed in on House Speaker John Boehner's (R-Ohio) resignation Friday, praising him as a \"good man\" and urging his successor to avoid a government shutdown. \n\nObama, noting that the resignation took him by surprise, said he spoke to Boehner on the phone after hearing the news. \n\n\"John Boehner is a good man,\" Obama said. \"He is a patriot, he cares deeply about the House, an institution in which he has served for a long time, he cares about his constituents and he cares about America.\" \n\nObama continued: \"We obviously have had a lot of disagreements, and politically we're at different ends of the spectrum, but I will tell you he has always conducted himself with courtesy and civility with me. He has kept his word when he has made a commmitment. He is somebody who has been gracious, and I think maybe most importantly is somebody who understands that in governance, you don't get 100 percent of what you want, but you have to work with people who you disagree with, sometime strongly, in order to do the people's business.\" \n\nObama said he would not \"prejudge\" the next House speaker and what his relationship might be like with him or her, but warned Boehner's future replacement against shutting down the government. \n\n\"My hope is there's a recognition on the part of the next speaker, something I think John understood though at times it was challenging to bring his caucus along, that we can have significant differences on issues but that doesn't mean you shut down the government, that doesn't mean you risk the full faith and…", "source": "MyInforms"}