{"published": "2015-09-13T22:15:43Z", "media-type": "News", "title": "Lessons from Elemental Technologies' sale to Amazon: Editorial", "id": "26db335b-3cba-4b64-a26b-1e20b542f12d", "content": "Of all the recent transactions involving Oregon-based companies, the sale of Elemental Technologies to Amazon Web Services might be the most important to watch.\n\nStanCorp Financial Group and Precision Castparts have deeper roots in Oregon and employ more people. But Elemental in many ways is the poster child for emerging home-grown Oregon technology companies that are an important part of any algorithm for future economic growth in the state. Though Elemental's decision does not necessarily predict the future of other emerging local companies, it does raise some important questions. Can Elemental, a video software company, still be Oregon's next technology leader under outside ownership? And does its sale signal that other home-grown companies also are likely to be sold when they reach a certain size? The answers to those questions aren't clear, in part because economic and business conditions can change quickly. But Elemental's path over the next few years, at the least, should help define the possibilities.\n\nTechnology companies loom large in Oregon's future for a host of reasons. High-tech already is the most important cylinder in the state's economy. The top three technology job classifications – computer and semiconductor manufacturing and software publishing – account for a combined 75,000 jobs, with thousands more technology-related jobs represented in other industries. Software companies are a particularly good fit for Portland, which lacks available land for large-scale manufacturing. And technology-related industries pay more than the median wage and help attract talented workers to the state.\n\nOregonian editorials Editorials reflect the collective opinion of The Oregonian/OregonLive editorial board, which operates independently of the newsroom. Members of the editorial board are Steve Moss, Mark Hester, Helen Jung, Erik Lukens, and Len Reed. To respond to this editorial: \n\nPost your comment below, submit a commentary piece, \n\nor write a letter to the editor. If you have questions about \n\nthe opinion section, \n\ncontact Erik Lukens, \n\neditorial and commentary editor, at elukens@oregonian.com or 503-221-8142. But those impressive statistics have been skewed by two companies. Tektronix was Oregon's original technology giant but has been in decline for three decades and was sold in 2007 to Danaher Corp., which is based in Washington, D.C. As Tektronix was declining, Intel was rapidly expanding. Though it is based in Santa Clara, California, the semiconductor manufacturer has more employees in Washington County than in any other location. But as any city or state married to the technology industry knows, companies rarely stay on top forever. What company will be Oregon's next technology giant? Given the state's justifiable reluctance to enter bidding wars to convince companies to move here from elsewhere, the next huge employer probably will need to be home grown.\n\nElemental still could be that company. In broad terms, this deal could turn out three ways. Elemental, with resources at its disposal that would not have been possible otherwise, could thrive under Amazon Web Services, a unit of Amazon.com, and become a large employer in Oregon. The company could thrive, but move a significant portion of the jobs created elsewhere. The company could plateau or regress for reasons that have nothing to do with ownership or location.\n\nElemental Chief Executive Officer said that the acquisition by Amazon puts his company in the best position for growth. \"Every way I looked at it, the impact we're going to be able to have is more significant than we could have had alone,\" he told Mike Rogoway of The Oregonian/OregonLive. In an email, he also said he fully expects some of Oregon's other emerging technology companies to go public in the near future. Just because joining with a company that has significant resources and connections was the right decision for Elemental doesn't mean it will be for a company that has another product and competes in a different galaxy of the technology universe.\n\nWhile watching Elemental's progress under Amazon, Oregonians also should pay attention to Blackman, who grew up in the Portland area and is a leader in the technology and business communities. Blackman, who has been an enthusiastic champion of Portland as a place to do business, said he and the company expect to remain involved in the community. That's important.\n\nBlackman and other young, home-grown technology entrepreneurs are the assets that Oregon really needs to hold onto. Look at companies that have kept their headquarters in one location for a long time – especially places outside of the Northeast and California – and you often see that the companies are in or near the hometowns of their founders. That's why Nike is in the Portland area and Microsoft is in the Seattle area. It's certainly the only reason Berkshire Hathaway is in Omaha, Nebraska, or Walmart in Bentonville, Arkansas.\n\nBlackman is young enough to start another company one day if he so chooses, though he said he's \"not investing any cycles thinking about what's next at the moment.\" But even if he doesn't, he very well could be a mentor to someone who does create another great Oregon company. And for all the attention that has been placed on the sales of Oregon companies lately, it's more important to make sure that the state becomes a fertile place to grow new companies.\n\n--The Oregonian/OregonLive editorial board", "source": "Oregonian"}