{"published": "2015-09-08T21:46:11Z", "media-type": "News", "title": "Celebrating our musical heritage", "id": "b9c4105a-3b36-4472-8cd0-bbc131d7c047", "content": "The beautifully moody portrait of Stratford musician Dayna Manning offered an artful contrast to the real-life singer-songwriter who was a guest at Tuesday's unveiling of the restored murals in Allen's Alley.\n\nManning's engaging smile--while not evident in the portrait--was ever present at the event, as she accommodated numerous requests for photos beside the Kato-created work.\n\n\"My reaction is the same as when it was made originally,\" said Manning of the Alley gallery, before organizers hustled her off to ribbon-cutting duties with musician and actor Cedric Smith.\n\n\"It's really an honour to be a part of this.\"\n\nThe portrait of Manning is among about a dozen visual tributes to local musicians, including the Perth County Conspiracy, Loreena McKennitt and The Revols' John Till, Richard Manuel and Ken Kalmusky.\n\n\"This is really amazing. It does definitely feel like playing in the big leagues for me,\" said Manning, a critically-acclaimed musician in her own right, both as a solo artist and as part of the Stratford-based Trent Severn with Emm Gryner and Laura C. Bates.\n\nAnother person with a constant smile at the ceremony was Shannon Stewart. She's the chair of the beautification subcommittee of Stratford City Centre's Business Improvement Area, and helped spearhead the restoration project.\n\n\"This is really a community effort. Everybody came together on it,\" she said.\n\n\"It's awesome.\"\n\nPreparations began in July, when local artisans started scraping, sanding and patching the graffiti-covered portraits.\n\nTheir efforts allowed artists Carla Coles and her husband Scott to begin their painstakingly detailed restoration of the murals.\n\nStaying true to the mural artists' work was made easier thanks to photos e-mailed to the Coles of the originals, courtesy of former Stratford city councillor Chris Rickett. He first suggested the outdoor portrait gallery around 2007.\n\nGetting them back to their original look took about three solid days' work from dawn to dusk, Coles said.\n\nAnd now that it's done?\n\n\"I love it,\" she said, echoing the view of others in attendance.\n\n\"And I was glad I could be a part of it.\"\n\nThe restored portraits are now covered by a graffiti-resistant coating, Stewart noted, which should help deter vandalism.\n\nAt the opening, guests were also able to view a variety of laminated pictures--attached to the alley's wooden beams--showing dozens of other notable musicians from the local scene.\n\nStewart credited feedback from a local Stratford Facebook page and the efforts of staff at the Stratford-Perth Archives for the addition of the pictures of bands and individuals that further illuminate the local music scene.\n\n\"Unfortunately we can't put everyone on the walls,\" Stewart said.\n\nStratford City Centre BIA marketing assistant Kim Griffiths said the restored alleyway artwork improves the look of a busy thoroughfare that links the Erie St. parking lot and the downtown.\n\n\"To date, it's not been a very pleasant place to go through,\" she said. \"But now that it's been turned around, I think it looks fantastic.\"\n\nOffering a direct connection with the historic past of the alley at the ceremony were Irene Ruscetta and her brother Michael Bomasuit, descendants of James Allen and his wife Josephine (Bomasuit), who established Allen's Fruit Market on Wellington St. in 1912.\n\nRuscetta recalled working as a youngster in the store, helping her dad, eventual storeowner Michael Bomasuit, unload truckloads of fresh produce from a five-ton truck that he eased backwards down the alley in the 1940s.\n\nTo see the respectful restoration of a piece of the Stratford landscape so closely connected to her family impressed her.\n\n\"It's beautiful,\" she said.\n\n\"I think it's marvellous that a proper tribute has been given to the artists here.\"", "source": "London Free Press"}