{"published": "2015-09-28T09:00:00Z", "media-type": "News", "title": "Own a piece of Ancaster for just $78 million", "id": "9556a6c1-2adf-4bed-a642-c16f3b0648aa", "content": "Memo to the Brampton person who won Friday's $60 million Lotto Max draw: scrounge up another $18 million — which would now seem like pocket change to you, I'm sure — and you could be the proud owner of the most expensive piece of property up for sale in Hamilton.\r \n \n\r\n                            The 69-hectare (171-acre) parcel, on Garner Road East between Highway 6 and Fiddlers Green Road in Ancaster, is on the market for $78 million.\r \n \n\r\n                            And while the value of the land is connected to its potential for commercial and industrial development, you won't have to pitch a tent because there is a house on the property.\r \n \n\r\n                            Not too shabby of a house either.\r \n \n\r\n                            Built in 1995 by developer Frank Silvestri as his family home, the mansion was reported to be 31,000 square feet at the time of its construction, with 11 bathrooms, a 14-car garage and a master bedroom that measured 1,500 square feet on its own.\r \n \n\r\n                            Silvestri told The Spectator back then that it might have been the largest single family home in the country.\r \n \n\r\n                            The land is situated about four kilometres northwest of the John C. Munro Hamilton International Airport and is owned by a company associated with the Silvestri family.\r \n \n\r\n                            A large chunk of the parcel is zoned under the city's Airport Prestige Business category, which permits a variety of uses, including hotels, conference centres, office space and research and development facilities.\r \n \n\r\n                            But take note, if you're considering making an offer — no explosives manufacturing, no pulp and paper mills, no rendering, slaughtering or eviscerating of animals and no vulcanizing of rubber will be permitted.\r \n \n\r\n                            Listing agent Conrad Zurini, of Re/Max Escarpment Realty, said the property went up for sale at the beginning of summer and there have been some expressions of interest.\r \n \n\r\n                            \"There is a lot of desire to own land in this city from out-of-town,\" he said. \"It's a choice piece of land.\r \n \n\r\n                            \"Properties like this could take years to sell,\" Zurini added. \"You need that right person and the right maturity. It takes time.\"\r \n \n\r\n                            At its current asking price, the land is valued at $1.13 million per hectare, or about $456,000 an acre.\r \n \n\r\n                            \"If it was residential land, it would be even higher,\" said Zurini, noting that he's seen some vacant residential land in Hamilton sell for more than $800,000 an acre.\r \n \n\r\n                            The second-most expensive property for sale in Hamilton appears to be 555 Glancaster Rd. in Glanbrook, site of the former Glancaster Golf and Country Club, which ceased operations at the end of May.\r \n \n\r\n                            The 51-hectare (127-acre) property is listed for sale at $29,845,000, which works out to $581,000 per hectare or about $235,000 per acre.\r \n \n\r\n                            The south portion of the property is within the city's Airport Employment Growth District and it's not expected that a new owner would maintain it as a golf course.", "source": "Flamborough Review"}