{"published": "2015-08-27T19:28:17Z", "media-type": "News", "title": "ALL AMERICAN POST: Yardley-Makefield VFW earns national and statewide recognition for honoring the dead by serving the living", "id": "689a92be-7be6-423b-9646-fb1e4f139835", "content": "By Petra Chesner Schlatter \npschlatter@buckslocalnews.com \n@petraschlatter on Twitter \n   \nLOWER MAKEFIELD >> VFW Post 6393 is celebrating two major achievements this summer – being named an All American Post for 2014-15 by the National VFW organization in Kansas City, Mo., and attaining VFW Pennsylvania All State status for 2014-15 for the second consecutive year and for the sixth time in the post’s history dating back ti 1946. \n\nThe post’s commander Russell Davidson said he’s proud of the post and its accomplishment. \n\n“Our membership has achieved a rare and coveted status,” he said. “The All American post Award is the highest VFW award a post and a post commander can achieve.” \n\nIn addition, Davidson has been awarded the title of All American Post Commander by the national VFW, an honor which he attributes “to everyone’s contributions, teamwork and commitment to our missions. \n \n“The nomination was put forth by VFW state headquarters and awarded by VFW National headquarters based upon our post meeting - and exceeding - all our mission requirements,” Davidson said. “We have demonstrated leadership in membership, Veteran Service Officer Duty, our Poppy campaign, participation in VFW programs and our unmatched community service.” \n\nSo far in 2015, the Post’s accomplishments are impressive: \n\nFebruary - Named Best Non-Profit Partnership member by the Pennsbury School District and recognized by Pennsylvania State Representative Steve Santarsiero. \n\nApril - Awarded Certificate of Appreciation and Congratulations for an Outstanding Service Year from Department of Pennsylvania VFW Commander Gary R. Smith \n\nMay - Received Membership Excellence Award from Department of Pennsylvania VFW Commander Gary R. Smith \n\nJune - Awarded All State Status 2014-15; VFW PA State Commander’s Award for the highest numerical increase of members – 40 new members; Robert Musser Memorial Award for achieving the greatest percentage of increased members – 116.70 percent; VFW PA State Van Zandt Award for Post recruiting most new and reinstated members – 14.9 percent; VFW PA State Joe Salvo Award for Post member recruiting the most new and reinstated members – awarded to Post 6393 Chaplain Reverend Peter Hook; and VFW Post 6393 Commander honored as Citizen of the Year by Fairless Hills Elks 2023 and recognized by Congressman Mike Fitzpatrick and District Judge Michael Burns Continued... \n  July -\tAwarded All American Post status by VFW National Headquarters in Kansas City. \n“I thank everyone in the VFW, our ladies auxiliary, our home members and our community supporters for their on-going hard work and for a great many jobs well done,” Davidson said. \n\n“While our year-to-date record is indeed formidable,” Davidson added, “it barely reflects the entirety of human effort and cooperation employed.” \n\nHe added, “Our entire community of supporters and government share in this accomplishment. If there was not a street to march down, a field to muster in, a monument to stand before or a raised flag to salute who would any of us be?” \n\nCurrently, there are 6,890 chartered VFW Posts in Europe, across America and in the Pacific regions. For the 2014 -15 VFW service year, 129 Posts and 129 commanders achieved the All American ranking. \n\n“Because of our community’s combined efforts, our execution of duty, and our ability to work together, we as a community have been ranked with the top two percent of service providers,” Davidson stressed. \n\nIn a letter to his post comrades and ladies auxiliary commending the post on the honors, he wrote: “America is the greatest of all nations. We are the strongest of all people. We are the most skilled at adapting, improvising and overcoming our challenges while realizing our opportunities. We are the most honorable, because we continue to serve one another. \n\n“The accomplishments of VFW Post 6393 reflect the success, the willingness and the competency of our community, our school systems and our local governments to work together to develop and further our common goals and good. \n\n“I am proud of every person that made these accomplishments possible,” he continued. “I am proud and honored to serve all. And I am confident that our past commitment will be carried forward to maintain our sacred mission: To honor the dead by serving living.” \r \n LOWER MAKEFIELD >> VFW Post 6393 is celebrating two major achievements this summer – being named an All American Post for 2014-15 by the National VFW organization in Kansas City, Mo., and attaining VFW Pennsylvania All State status for 2014-15 for the second consecutive year and for the sixth time in the post’s history dating back ti 1946. \nThe post’s commander Russell Davidson said he’s proud of the post and its accomplishment. \n\n“Our membership has achieved a rare and coveted status,” he said. “The All American post Award is the highest VFW award a post and a post commander can achieve.” \n\nIn addition, Davidson has been awarded the title of All American Post Commander by the national VFW, an honor which he attributes “to everyone’s contributions, teamwork and commitment to our missions. \n\n“The nomination was put forth by VFW state headquarters and awarded by VFW National headquarters based upon our post meeting - and exceeding - all our mission requirements,” Davidson said. “We have demonstrated leadership in membership, Veteran Service Officer Duty, our Poppy campaign, participation in VFW programs and our unmatched community service.” \n\nSo far in 2015, the Post’s accomplishments are impressive: \n\nFebruary - Named Best Non-Profit Partnership member by the Pennsbury School District and recognized by Pennsylvania State Representative Steve Santarsiero. \n\nApril - Awarded Certificate of Appreciation and Congratulations for an Outstanding Service Year from Department of Pennsylvania VFW Commander Gary R. Smith \n\nMay - Received Membership Excellence Award from Department of Pennsylvania VFW Commander Gary R. Smith \n\nJune - Awarded All State Status 2014-15; VFW PA State Commander’s Award for the highest numerical increase of members – 40 new members; Robert Musser Memorial Award for achieving the greatest percentage of increased members – 116.70 percent; VFW PA State Van Zandt Award for Post recruiting most new and reinstated members – 14.9 percent; VFW PA State Joe Salvo Award for Post member recruiting the most new and reinstated members – awarded to Post 6393 Chaplain Reverend Peter Hook; and VFW Post 6393 Commander honored as Citizen of the Year by Fairless Hills Elks 2023 and recognized by Congressman Mike Fitzpatrick and District Judge Michael Burns \n\nJuly -\tAwarded All American Post status by VFW National Headquarters in Kansas City. \n\n“I thank everyone in the VFW, our ladies auxiliary, our home members and our community supporters for their on-going hard work and for a great many jobs well done,” Davidson said. \n\n“While our year-to-date record is indeed formidable,” Davidson added, “it barely reflects the entirety of human effort and cooperation employed.” \n\nHe added, “Our entire community of supporters and government share in this accomplishment. If there was not a street to march down, a field to muster in, a monument to stand before or a raised flag to salute who would any of us be?” \n\nCurrently, there are 6,890 chartered VFW Posts in Europe, across America and in the Pacific regions. For the 2014 -15 VFW service year, 129 Posts and 129 commanders achieved the All American ranking. \n\n“Because of our community’s combined efforts, our execution of duty, and our ability to work together, we as a community have been ranked with the top two percent of service providers,” Davidson stressed. \n\nIn a letter to his post comrades and ladies auxiliary commending the post on the honors, he wrote: “America is the greatest of all nations. We are the strongest of all people. We are the most skilled at adapting, improvising and overcoming our challenges while realizing our opportunities. We are the most honorable, because we continue to serve one another. \n\n“The accomplishments of VFW Post 6393 reflect the success, the willingness and the competency of our community, our school systems and our local governments to work together to develop and further our common goals and good. \n\n“I am proud of every person that made these accomplishments possible,” he continued. “I am proud and honored to serve all. And I am confident that our past commitment will be carried forward to maintain our sacred mission: To honor the dead by serving living.”", "source": "New Hope Gazette"}