{"published": "2015-09-24T07:00:00Z", "media-type": "News", "title": "University of Bristol Selects Anite's Propsim F8 Channel Emulator for 5G Research", "id": "8f0eb81c-8647-4b2c-bc97-eaf7273c7a34", "content": "Anite's leading channel emulation expertise enables universities and research institutes to accelerate R&D into future mobile communications technologies\n\nAnite, a global leader in wireless equipment testing technology, today announced that the UK's University of Bristol \n\nAnite's Propsim F8 is currently the only radio channel emulator with an RF channel bandwidth of 160 MHz. This wide capability enables research organisations and wireless equipment manufacturers to verify very high data rates as well as implement advanced 5G and 802.11ac features, such as multi-user MIMO and beamforming.\n\nPropsim's user-friendly interface, with its pre-built library of channel models, enables researchers and developers to quickly design new propagation models by rigorously modelling the components that make up a communications link. Propsim F8 enables the University of Bristol \n\nAnite has a long-standing relationship with the University's Communication Systems and Networks (CSN) Group that runs a state-of-the-art hardware and measurement facility. The CSN Group will be using the Propsim F8 (procured through an UK EPSRC equipment award) for projects such as mmMagic (EU 5G PPP - http://www.5g-ppp.eu/mmmagic).\n\nEarly channel model research and development is necessary to understand the way radio waves propagate at various frequencies, which is why many research initiatives across the globe use Anite's Propsim Channel Emulators to progress 5G research. For example, the Anite-led task group within the METIS project finalised earlier this year. Professor Andrew Nix Anite is a leading supplier of test and measurement solutions to the international wireless market. It provides testing, measurement, optimisation and analytics systems based on its specialist sector knowledge and its proprietary software and hardware products. Customers include major manufacturers of mobile devices, chipsets and network equipment, mobile network operators, regulatory authorities, and independent test houses.\n\nIts 500+ staff work from offices in 15 countries across Europe \n\nAnite is now part of Keysight Technologies.\n\nFor more information, please visit the company's website: http://www.anite.com\n\nThe University of Bristol The University of Bristol The University was founded in 1876 and was granted its Royal Charter For further information, please contact", "source": "Pettinga Financial Advisors"}