{"published": "2015-09-08T22:25:50Z", "media-type": "Blog", "title": "David Ripley: Let Us Continue to Do Evil That Some Good May Result", "id": "7f18a840-7579-467e-ad04-6974193007b0", "content": "Idaho Chooses Life \n \nWe have had some interesting conversations over the past several weeks, as the Great Planned Parenthood Scandal has continued to unfold. \n \nSome have wondered, even asserted: “Well, it is terrible – but isn’t it better that some lives can be saved as a result of these organ donations? After all, the baby has already been killed”. Or variations on that line of reasoning. \n \nIndeed, there is an allure to thinking that medical research will find a way to turn the tragic destruction of innocent lives into some social good. \n \nBut such a superficial view of the horror is a seduction into a deep darkness. \n \nWe have faced such arguments before, when the national debate was focused on harvesting stem cells from aborted human babies. Now we are talking about the harvesting of whole brains, hearts, livers, neural tissue from babies unable to defend or even speak for themselves. \n \nLet’s start by pointing out that there is a profound difference between an adult deciding to become an organ donor and the organ trafficking-for-profit scheme Planned Parenthood and others are involved with. That profound difference, of course, is that the babies involved cannot give their consent. Planned Parenthood and their co-conspirators will hide behind the argument that the mother has given her consent to the “donation” of organs and tissue. \n \nFirst, we honestly have no idea whether Planned Parenthood is systematically obtaining consent from women undergoing abortion. And we certainly have no way of knowing whether that consent is truly informed. Their entire operation is shrouded in darkness and shame. \n \nBut we would argue that the woman’s consent is irrelevant to this moral crisis. \n \nVarious statements of ethics (e.g., The Belmont Report) allow for parents to provide consent in situations where medical research and/or treatment is contemplated for children unable to understand the risks and potential benefits of the medical research. But those protocols assume that the parent is acting in the best interest of the child – naturally inclined to shield him from harm. \n \nObviously, a woman who has paid people to kill her own baby has forfeited any claim to concern over the baby’s welfare. \n \nNo, this whole macabre business of chopping up babies for profit is a societal challenge and is clearly unacceptable, regardless of any possible future social benefit. \n \nFundamentally, the whole sordid scheme of organ trafficking hinges upon treating these human babies as a commodity, as a means to some other end. At the heart of western civilization is the belief that all human beings are never to be treated as means – but as ends in themselves. The sanctity of the human person cannot be compromised for the benefit of another, no matter how lofty the supposed goal. \n \nThis is the core principle which has given rise to democratic government, to the whole notion of human rights. It is what separates us from the barbaric past and from those modern movements of despotism which justify any abuse of the individual to enhance the power of the state. \n \nThe revelations regarding Planned Parenthood’s treatment of babies poses a direct and potent challenge to a core value of our civilization. It is a threat not to those babies, but to us, the living. We cannot yield to the temptation of profiting from the barbaric mistreatment of these vulnerable human beings without sorely damaging our own souls. \n \nIt is imperative that we take a stand, and demand that our national leaders find the courage to confront this evil. \n \nv", "source": "TrishAndHalli.com"}