{"published": "2015-09-23T09:32:21Z", "media-type": "News", "title": "Red Bull reiterate threat to quit Formula One at end of season", "id": "3159ac1a-4cc2-44b4-bbdc-935b2f78ca82", "content": "Red Bull has reiterated its threat to quit Formula One at the end of the season if it is not provided with a competitive engine. \n \nThe team, based out of Milton Keynes, are in discussions with Ferrari over a deal to use their power units in 2016. \n \nBut Red Bull, who won four consecutive driver and team championships between 2010 and 2013, will only remain on the grid if the Italian team supply an engine on par with those used by Sebastian Vettel and Kimi Raikkonen. Toro Rosso, Red Bull's junior team, also face extinction from the sport. \n \nTeam principal Christian Horner told Press Association Sport in Singapore that the threat of Red Bull withdrawing from Formula One should not be \"underestimated\". \n \nRenault, Red Bull's current engine supplier, are set to end their  fractious   relationship  with the team at the end of the season. \n \nAn article, published in Red Bull's media title Speedweek, reads: \"For those among us who have listened closely to what Red Bull chief Dietrich Mateschitz and his motor sports consultant Dr. Helmut Marko said recently and who interpret it correctly and put together one and one, a clear scenario emerges: Red Bull Racing and Scuderia Toro Rosso will pull out of Formula One after the 2015 season. \n   Promoted stories   \n\"Red Bull doesn't want to have customer engines that have 30 to 40 bhp less and can be manipulated by the constructor in case of the customer team endangering the works team. \n \n\"Red Bull would like to continue in F1 only if Ferrari is willing to provide true works engines that are on the same level as the engines of Vettel and Raikkonen.\" \n \nMateschitz, the team's outspoken Austrian owner, who is quoted in the same article, added: \"As a customer team you will only get an engine that is good enough to take away points from their immediate rivals. \n \n\"But this engine will never be good enough to beat the works team. With such a customer engine we will never be world champion again. And if that's the case we lose interest.\" \n \nRed Bull had been in talks with Mercedes over using their power units next season. But the Silver Arrows, who boast the most competitive engine in the sport, withdrew from negotiations a fortnight ago. On Thursday,  Toto Wolff, Mercedes motorsport boss, explained their decision. \n \n\"We decided with our board that we as an engine supplier - and as a team - have worked hard and long to achieve the success we have today, after taking the decision to enter the sport again as a works team in 2010,\" he told Formula1.com. \n   \n Share article  \n   \n\"Therefore we decided two weeks ago against exploring an engine supply to Red Bull. \n \n\"We wish to continue with our model to support independent, privateer racing teams - and to respect the relationships we already have in place with our customers - alongside our primary focus on the Mercedes works team.\"", "source": "Gloucestershire Gazette"}