{"published": "2015-09-09T00:12:46Z", "media-type": "Blog", "title": "This study demonstrates the potential for the essential oil of Ca. odorata essential oil to be used as a botanical insecticide against three mosquito species.", "id": "c35bfa39-db40-476e-b9d3-6ad8d04e0f89", "content": "This study demonstrates the potential for the essential oil of Ca. odorata essential oil to be used as a botanical insecticide against three mosquito species.\t- GreenMedInfo Summary Abstract Title: Efficacy of essential oil from Cananga odorata (Lamk.) Hook.f.&Thomson (Annonaceae) against three mosquito species Aedes aegypti (L.), Anopheles dirus (Peyton and Harrison), and Culex quinquefasciatus (Say).\nAbstract Source: Parasitol Res. 2015 Sep 4. Epub 2015 Sep 4. PMID: 26337270\nAbstract Author(s): Mayura Soonwera\nArticle Affiliation: Mayura Soonwera\nAbstract: The essential oil of Cananga odorata flowers was evaluated for oviposition-deterrent, ovicidal, insecticidal, and repellent activities toward three mosquito species: Aedes aegypti, Anopheles dirus, and Culex quinquefasciatus. Oviposition deterrence of the oil was evaluated on gravid females using oviposition deterrence bioassay. The results showed that 10 % Ca. odorata exhibited high percent effective repellency against oviposition at 99.4 % to Ae. aegypti, 97.1 % to An. dirus, and 100 % to Cx. quinquefasciatus. Ca. odorata oil was tested for ovicidal activity. Regression equations revealed that the ovicidal rates were positively correlated withthe concentrations of the essential oil. As the concentration of essential oil increased from 1, 5, and up to 10 % concentration, the ovicidal rate increased accordingly. Larvicidal activity of the oils was used on immature stages (third and fourth instar lavae and pupae). The maximum larval mortality was found with 10 % Ca. odorata against immature stages, and there were LC50 values ranged from 10.4 to 10.5 % (for Ae. aegypti),1 % (for An. dirus), and1 % (for Cx. quinquefasciatus). Adulticidal properties were evaluated with unfed females. Ten percent Ca. odorata oil had high knockdown rates against the three mosquito species at 96 % (for Ae. aegypti), 98.4 % (for An. dirus), and 100 % (for Cx. quinquefasciatus), with EC50 values of 6.2, 4.7,and 5.4 %, respectively. It gave moderate mortality rates after 24 and 48 h of exposure. Ca. odorata oil was assessed for repellency to females by using the modified K&D module. Ten percent Ca. odorata oil gave the strongest value against Ae. aegypti, An. dirus, and Cx. quinquefasciatus, with percentage repellency of 66, 92, and 90 %, respectively. This study demonstrates the potential for the essential oil of Ca. odorata essential oil to be used as a botanical insecticide against three mosquito species.\tArticle Published Date : Sep 04, 2015\nStudy Type : Insect Study\nAdditional Links Substances : Ylang-ylang : CK(30) : AC(3)\nDiseases : Insect Bites: Repellent : CK(18) : AC(3)\nPharmacological Actions : Insect Repellents : CK(1) : AC(1), Insecticidal\nAdditional Keywords : Essential Oils : CK(11) : AC(2), mosquito repellent\tPrint Options Disqus\tLogin to Comment Commenting is limited to Members only. If you are already a member, please login to post a comment. If you do not have a member account and would like to become a member, please click here to begin the process to become a member.", "source": "GreenMedInfo"}