{"published": "2015-09-03T04:04:38Z", "media-type": "News", "title": "RING OF HONOR ON DESTINATION AMERICA REPORT: LETHAL VERSUS HANSON, DALTON CASTLE ANSWERS SILAS YOUNG'S CHALLENGE . . . OH BOYS, FORMER TAG TEAM PARTNERS MEET IN THE RING . . . TWO TIMES", "id": "3d755ac1-8256-46a6-91b3-97b6ac7d11de", "content": "RING OF HONOR ON DESTINATION AMERICA REPORT:  LETHAL VERSUS HANSON, DALTON CASTLE ANSWERS SILAS YOUNG'S CHALLENGE . . . OH BOYS, FORMER TAG TEAM PARTNERS MEET IN THE RING . . . TWO TIMES  By Richard Trionfo on 2015-09-02 23:55:28  We are in Baltimore, Maryland and your announcers are Kevin Kelly and Steve Corino. \n Match Number One: Adam Page ( with BJ Whitmer and Colby Corino ) versus Jay Briscoe \n\nInstead of the Code of Honor, Page slaps Briscoe and the referee starts the match. \n\nJay thinks about what Page just did and he walks around for a few seconds before he tells Page to shake his hand.  Page slaps Briscoe again.  Jay misses a boot and Briscoe avoids a clothesline.  Jay with jabs and a head butt.  Jay with kicks to Page in the corner and then he chokes Page with his boot. \n\nBriscoe with a European uppercut followed by an Irish whip but Page moves.  Page is sent to the apron and then Briscoe elbows Page off the apron.  Briscoe with a suicide dive and then Colby hits Briscoe in the back with BJ’s crutch.  Page throws a chair at Briscoe and the referee calls for the bell. \n\n Winner:  Jay Briscoe ( by disqualification )  \n\nAfter the match, Page sends Briscoe back into the ring and hits Jay with a chair and then hits Rite of Passage onto the chairs. \n\nMark Briscoe comes to the ring and he throws chairs into the ring and then Mark tries to hit Page with chairs by throwing them at Page.   Mark throws one up the ramp and he hits Corino. \n\nWe go to commercial. \n\nWe are back with a look at what happened a few weeks ago between Silas Young, Dalton Castle, and The Boys. \n\nDalton Castle says he has stayed quiet and held back his anger long enough.  He will stay silent NO MORE.  He tells Silas Young that he will crash down upon him like a thousand foot wave from the mighty Poseidon.  These are his boys.  They’re MINE.  You want him to put them on the line? \n\nYou come to me with a proposition like that and you are off your rocker.  From one sane man to a crazy boy, if you keep coming at me, I will teach you a lesson.  I will put these boys on the line, but if I win . . . when I win, you become one of my boys.  Silas, you’re going to make a wonderful Ottoman. \n\nBefore the next match, Cedric Alexander gets on the mic and he mentions that he is the only man in Ring of Honor to defeat Moose twice.  Beating Caprice Coleman means nothing so he is going to leave the ring with Veda. \n\nCaprice takes the mic and he says he want to talk to the one with the most hair on their chest.  Caprice tells Veda she is doing a great job with Cedric. \n\n Match Number Two: Cedric Alexander ( with Veda Scott ) versus Caprice Coleman \n\nCedric misses a punch and Caprice with punches and chops.  Caprice sends Cedric into the turnbuckles and he goes NHL by pulling the shirt over Cedric’s head and punching him.  Cedric with a punch and chops to Caprice.  Cedric with another chop.  Caprice with a leg lariat to Cedric and then he slams Cedric.  Caprice misses a leg drop but Cedric misses a kick and Caprice with a near fall on a rollup. \n\nCaprice with a back heel kick but he misses a spin kick.  Cedric with a waist lock but Caprice with an elbow.  Veda grabs Caprice’s foot when the referee was distracted by Cedric.  Cedric with a back body drop to Caprice that sends him to the apron.  Cedric with a kick to the chest followed by a running kick while Caprice is on the apron. \n\nWe go to commercial. \n\nWe are back and Cedric with a bear hug on Caprice.  Caprice with elbows but Cedric with a forearm to the back of the head.  Cedric with chops.  Caprice with punches as he avoids Cedric’s punches.  Cedric with a back heel kick to stop Caprice.  Cedric with chops.  Caprice sends Cedric to the floor with a back drop.  Cedric pulls Caprice down but Caprice with a head scissors to send Cedric to the floor. \n\nCaprice goes up top but Cedric moves out of the way.  Caprice with a kick and springboard rana for a near fall.  Caprice runs into boots from Cedric and then Cedric with a springboard clothesline to the back of the head for a near fall.  Cedric signals that it is over and he sets for a Saito suplex but Caprice with elbows. \n\nCedric with a 540 kick followed by a Michinoku Driver for a near fall.  Cedric signals to Veda and she goes for the wrench.  Cedric waits for the right opportunity but Stokely Hathaway comes out and he pulls Veda off the apron and drops her to the floor.  Moose comes out and takes the wrench from Cedric. \n\nCaprice with an elbow and he goes up top and he hits Sidesplitter for the three count. \n\n Winner:  Caprice Coleman  \n\nAfter the match, Cedric goes after Moose but Moose with a punch using the wrench and Cedric is out. \n\nPrince Nana makes his way to ringside and he has something to do before talking to Stokely.  Nana hands an envelope to Caprice and then Nana leaves with Stokely and Moose. \n\nWe go to commercial. \n\n Match Number Three: Bob Evans versus Cheeseburger \n\nBefore the match starts, Bob says something to Cheeseburger and Cheeseburger charges after him.  Evans with a kick and then he picks up a chair and tries to hit Cheeseburger but misses.  Cheeseburger with a kick and then he goes to the corner of the guardrails and hits a senton off the guardrails onto the chair on top of Evans. \n\nThey return to the ring and the match officially starts.  Evans sends Cheeseburger into the turnbuckles but Cheeseburger floats over and hits an elbow in the corner.  Cheeseburger kicks Evans.  Evans goes to the floor.  Evans pulls Cheeseburger off the ropes when Cheeseburger tries to bring Evans back into the ring. \n\nEvans kicks Cheeseburger.  Cheeseburger with punches but Evans with a neck breaker and he pulls up Cheeseburger from the cover.  Evans with punches and the referee warns Evans.  Evans with a rear chin lock.  Evans gets Cheeseburger up but Cheeseburger gets to his feet and Cheeseburger goes for an O’Connor Roll but Evans holds on to the ropes.  Evans with a shoulder tackle for a near fall. \n\nEvans goes for the leg but Cheeseburger with kicks.  Evans pulls Cheeseburger up and he lands on his feet.  Cheeseburger with a rollup for a near fall.  Evans with a punch and Cheeseburger is down.  Evans goes to the floor while Cheeseburger tries to recover.  Evans pulls out a table and sets it up at ringside. \n\nEvans goes back into the ring and sends Cheeseburger to the apron.  Evans goes to the apron as well and Evans tells Cheeseburger he hates him.  Evans sets for a side slam through the table but Cheeseburger counters and gets back into the ring.  Cheeseburger with a palm thrust and it knocks Evans off the apron through the table. \n\nThe referee starts his count and Evans is down for the twenty count. \n\n Winner:  Cheeseburger  \n\nJay Lethal says that it is time to stop talking about the past Hanson.  You aren’t going to do anything tonight.  He talks about the past because in his world, he is doomed to repeat history.  In a year or two, he will be a fat kid sitting on the couch.  In a few months, his dog will run away.  You will be homeless too.  It was because you came this close to greatness and this close to the most coveted prize.  Jay says he will not take a back step. \n\nWe go to commercial. \n\nWe are back with Inside ROH with Mandy Leon. \n\nShe mentions that next week will be the Championship Edition of Ring of Honor Television. \n\nThere are two title matches next week.  The Young Bucks will face The Addiction for the ROH Tag Titles.  Jay Lethal will face Roderick Strong in a rematch from Death Before Dishonor when they had a sixty minute draw. \n\nJay Lethal says that next week is their rematch and he expects two thank yous.  The first will be for putting Roderick on the map after their first match.  The second thank you should be for Jay giving him the second chance of a lifetime next week.  If you want to give me a challenge, take a look at what he does to Hanson because the same thing will happen next week. \n\nWe see what happened between the Young Bucks and The Addiction a few weeks ago on television. \n\nWe are back and Bobby Fish is at the announce table to watch the main event since he will be facing the winner at All Star Extravaganza. \n\n Match Number Four: Hanson versus Jay Lethal ( with Truth Martini ) for the Ring of Honor World Television Title  \n\nLethal talks to Fish at the announce table and he tells him to take some notes for their match. \n\nThey lock up and Lethal sends Hanson into the corner but Hanson reverses things.  Lethal with a kick and Hanson with punches.  Lethal with a punch but Hanson with a forearm.  Lethal with a knee and Hanson sends Lethal into the turnbuckles and he punches Lethal while the referee starts his count in the corner.  Hanson with a biel.  Hanson runs into a boot in the corner but Lethal runs out of the corner and is met with a boot. \n\nHanson gets a near fall.  Hanson with punches to the head.  Hanson with knees to the midsection and Lethal is down on his hands and knees.  Lethal with kicks but Hanson with kicks and punches in the corner.  Hanson with an Irish whip and Lethal tries to float over but Hanson catches him.  Lethal gets to the apron and Hanson with a punch. \n\nHanson goes to the apron and Lethal chops Hanson but Hanson shrugs it off.  Lethal with another chop and the same result.  The third one fails as well.  Hanson clotheslines Lethal back into the ring. \n\nMartini grabs Hanson’s leg and that allows for a distraction that gives Lethal the opportunity to hit a springboard drop kick that sends Hanson to the floor.  Lethal with a suicide dive onto Hanson.  Lethal goes back into the ring for a second one.  Lethal goes back into the ring and Martini gets between Hanson and the ring and Lethal splits the uprights on a third suicide dive and Hanson is sent into the front row. \n\nWe go to commercial. \n\nWe are back and Lethal with a sleeper on Hanson.  Hanson with punches but Lethal with a knee and he grabs Hanson by the beard and he leaps over the top rope to the floor and drops Hanson on the top rope.  Lethal gets a near fall.  Lethal returns to the sleeper.  Hanson with punches but Lethal with chops.  Hanson with a side slam and both men are down. \n\nHanson with a back body drop to Lethal followed by a clothesline in the corner followed by an Irish whip and clothesline.  Hanson with an Irish whip but Lethal with an elbow.  Lethal tries for a sunset flip but Hanson does not go over and he picks up Lethal for a suplex but Lethal lands on his feet.  Hanson with a cartwheel followed by a clothesline for a near fall. \n\nHanson puts Lethal on the top turnbuckles and connects with forearms.  Lethal falls to the mat and Hanson goes for the bronco buster but Lethal gets his feet up and Hanson is hit in the ding ding.  The referee warns Lethal and then Lethal goes up top and hits the elbow drop but Hanson kicks out at one. \n\nLethal punches Hanson but Hanson punches back.  They go back and forth.  Lethal with a kick and he calls for the Lethal Injection but he takes too long and Hanson with a handspring back elbow.  Hanson goes up top for a moonsault and he hits it but he lands on Lethal’s knees.  Lethal calls for the Lethal Injection and Hanson with a back drop.  Hanson misses the spin kick and Lethal with a super kick and Lethal Injection but Hanson gets up and Lethal with a second one for the three count. \n\n Winner:  Jay Lethal  \n\nAfter the match, Fish has some words for Lethal but Lethal says that Kyle is the man of the team. \n\nLethal challenges both Fish and O’Reilly.  Kyle and Bobby get on the apron.  Bobby tells them that his day is coming to deal with both of them and he will have to wait. \n\nKyle and Bobby get into the ring, but Roderick Strong comes to ringside and he is surrounded by officials.  Strong gets in the ring and Lethal goes to the floor. \n\nWe go to credits.", "source": "Pro Wrestling Insider"}