{"published": "2015-09-08T19:01:45Z", "media-type": "News", "title": "Queen breaks British royalty record", "id": "8379c06c-fd10-4402-a1f9-d0167c90d2db", "content": "Share this story   \nToday the Queen notches up a significant milestone in her reign, breaking the record for the British monarch who's spent the longest time on the throne. \n \nBut she's still got some way to go, to be the world's longest-reigning monarch. \n \n63 years and 217 days ago Queen Elizabeth II ascended to the throne after the death of her father, King George XI. \n \nShe was just 27 years old. \n \nToday, aged 89, she will surpass her great-great-grandmother Queen Victoria as Britain's longest-reigning monarch. \n \nAs far as New Zealand goes Elizabeth has already hit that record because Victoria didn't start reigning over us until the Treaty of Waitangi was signed, three years into her rule. \n \nBut she still trails behind 47 other international kings and queens when it comes to retaining a crown. \n \nThe longest-reigning monarch Sobhuza II of Swaziland ruled for 82 years. \n \nNext in line is Bernhard VII, who ruled the historic German state of Lippe for 81 years in the 15th and 16th centuries. \n \nIn Europe, the French are also streaks ahead, with 18th-century Sun King Louis XIV at a lengthy 72 years and three months. \n \nOur Governor General is praising Queen Elizabeth's commitment to her people, as she becomes the longest-reigning British monarch. \n \nThe 89 year old will today take the title from her great-great-grandmother Queen Victoria. \n \nSir Jerry Mateparae said it is a remarkable feat, which reflects the promise she made at her coronation - to serve her country to the best of her ability. \n \nPost World War II, it was a time of huge social change around the globe. \n \n\"From empire to commonwealth, she has observed, participated [in] and guided that. \n \n\"So I think in many ways she has been right at the centre of democracy.\" \n \nSir Jerry has marvelled at Queen Elizabeth's ability to promote independence, while maintaining unity in her realm. \n \n\"She has been the person who has helped to guide nations into full independence on the one hand, but also to hold together such an eclectic group of countries.\" \n \nSir Jerry says those countries range from as far afield as the Caribbean and Africa, to Australia and New Zealand. \n \nAn investiture ceremony will be held at Government House today, for those New Zealanders who received Queen's Birthday Honours. \n \nThere will also be a dinner tonight where, among other things, Sir Jerry says they will mark 40 years of the Queen's Service Order medal in New Zealand. \n \nSir Jerry said her majesty wanted to keep celebrations of the milestone reasonably low key. \n \nBut he anticipates there will be more of a celebration next year, for her 90th birthday.", "source": "Newstalk ZB"}