{"published": "2015-09-22T21:40:13Z", "media-type": "Blog", "title": "U.S. Senate to sidestep abortion fight in funding bill", "id": "a97e4098-6b0c-4aa8-b5c9-992d2d138951", "content": "By Susan Cornwell \n \nWASHINGTON, Sept 22 (Reuters) – A legislative holding action \nto avert a U.S. government shutdown began taking shape in the \nSenate on Tuesday, but it was still far from certain whether a \ndispute over funding for women’s healthcare group Planned \nParenthood could be overcome. \n \nWith only days remaining before an Oct. 1 deadline for \naction, Senate leaders said they were pursuing a stop-gap \nfunding bill to extend the present federal budget for about 10 \nweeks beyond the Sept. 30 end of the fiscal year. \n \nKnown as a continuing resolution, or CR, this approach was \ngaining traction, said senior senators from both parties. \n \nBut it may not work if conservative Republicans follow \nthrough on their threat to oppose any spending plan that \npreserves federal funding for Planned Parenthood, under attack \nover allegations it improperly sells aborted fetal tissue. \n \nPresident Barack Obama and congressional Democrats oppose \ndefunding the group, which has said it has done nothing wrong \nand blasted the allegations as deceptive and unfair. \n \n“Given the president’s opposition and Democrats’ opposition, \nat some point I anticipate there will be a clean CR,” said \nSenator John Cornyn, the second-ranking Senate Republican. \n \nSenate Democratic leader Harry Reid largely concurred \nsaying, “We’re going to move to a clean CR on Thursday.” \n \nThere were no signs, however, that conservative Republicans \nin the House of Representatives would go along with this plan. \n. Abortions are a small part of Planned \nParenthood’s services, making it a perennial target for \nanti-abortion forces among conservative Republicans. \n \nSenate Majority Leader Mitch McConnell said the Senate would \nvote on Thursday on a continuing resolution keeping federal \nagencies funded through Dec. 11 and giving Congress time to work \nout a longer-term budget deal. \n \nMcConnell’s measure would try strip the portion of Planned \nParenthood funding from discretionary programs. Democrats were \nexpected to block that version of the bill. \n \nPlanned Parenthood, a non-profit group, has been under fire \nfor weeks after secretly taped videos produced by an \nanti-abortion group recorded Planned Parenthood officials \ndiscussing the use of fetal tissue harvested from abortions. \n \nConservative Republicans have called for an end to the \ngroup’s current funding of about $500 million a year. Most of \nthat comes from Medicaid healthcare reimbursements that do not \ndepend on annual spending bills. McConnell’s bill would attack a \nmuch smaller portion, about $50 million. \n \n(Additional reporting by David Lawder ; Editing by Eric Walsh \nand Cynthia Osterman)", "source": "Susan Cornwell"}