{"published": "2015-09-26T16:05:05Z", "media-type": "News", "title": "Daniel Sturridge scores two and eases pressure on Liverpool boss Brendan Rodgers", "id": "ea359a59-7358-42ab-85cb-2f3935050afd", "content": "Timing is everything and Daniel Sturridge's first goals for six months did his manager Brendan Rodgers a huge favour in the 3-2 win over Aston Villa. \n \nWith the Reds boss under increasing pressure he needed a performance from his senior players and he got that from England internationals Sturridge and James Milner. \n \nStand-in captain Milner could not have picked a more opportune moment to score his first Liverpool goal after just 67 seconds before Sturridge came to the fore with two typical strikes to see his side sneak home despite Rudy Gestede twice dragging Villa back into the game. \n \nThere has been much turning of corners in Rodgers' three-year reign at Anfield and while he is by no means out of the woods yet this result helped repair confidence fragmented by five matches without a win. \n \nIt was the first time since February Liverpool had scored three and it was largely down to Sturridge who, in his second appearance after hip surgery, scored his first goals since March. \n \nLiverpool began with a pace and hunger which had been absent since before the end of last season and while it was not quite the sort of rapid start regularly witnessed when a certain Luis Suarez was terrorising defences on the way to their title near-miss it had a similar effect. \n   Promoted stories   \nWith barely a minute on the clock Villa gave Milner, who benefited playing much further up the field than previously, far too much room on the edge of the penalty area and when Philippe Coutinho fed the ball into him the England international quickly switched feet to drill home with his weaker left. \n \nEmre Can and Danny Ings both had half-chances early as the visitors were threatened with being overrun. \n \nBut Villa, probably with the knowledge their opponents had not scored two in a match since early May, were almost content to sit on their deficit and they soon quelled Liverpool's early fire. \n \nAnd the home side's propensity to shoot themselves in the foot almost cost them on two occasions before half-time as Can's mis-directed clearance was sliced wide by Gestede while Ashley Westwood's shot was deflected behind after Simon Mignolet tamely tipped away Alan Hutton's cross. \n \nCoutinho, Milner and Nathaniel Clyne all had chances after the break before  Sturridge's brilliant left-foot volley from Milner's lobbed pass offered Liverpool a degree of comfort. \n \nOr so they thought. Gestede bundled home at the far post to restore Anfield's anxiety levels to what they had been this season and although Sturridge's neat interchange with Coutinho teed up his second Gestede's powerful header set nerves jangling. \n \nSturridge missed two chances to complete his hat-trick but his performance suggested his fortunes and those of his manager may be entwined. \n \nAlthough it was hardly the most convincing of victories Rodgers will take any crumb of comfort as he seeks to prove he remains the man to take the club forward. \n \nFor all the talk of a crisis Liverpool are just two points off the top four but with the Merseyside derby next at Goodison Park further pitfalls await. \n \nTWEET OF THE MATCH \n \n\"@RayClem1: Good win @LFC v Aston villa and good to see @D_Sturridge back with a couple of goals\" - Former Liverpool and England goalkeeper Ray Clemence echoes the sentiments of many fans around the country after a second-half double. \n \nPLAYER RATINGS \n \nLiverpool \n \nSimon Mignolet: 5 (out of 10) \n \nEmre Can: 5 \n \nMartin Skrtel: 5 \n \nMamadou Sakho: 5 \n \nNathaniel Clyne: 7 \n \nLucas: 6 \n \nJames Milner: 8 \n \nAlberto Moreno: 7 \n \nPhilippe Coutinho: 8 \n \nDaniel Sturridge: 8 \n \nDanny Ings: 8 \n \nSubs: \n \nJoe Allen: 3 \n \nAston Villa \n \nBrad Guzan: 6 \n \nAlan Hutton: 7 \n \nMicah Richards: 6 \n \nJoleon Lescott: 6 \n \nJordan Amavi: 7 \n \nCarlos Sanchez: 5 \n \nAshley Westwood: 6 \n \nIdrissa Gueye: 5 \n \nJack Grealish: 6 \n \nRudy Gestede: 8 \n \nScott Sinclair: 6 \n \nSubs: \n \nJordan Veretout: 4 \n \nAdama Traore: 4 \n \nSTAR MAN \n \nDaniel Sturridge. The England striker looked well off the pace in the first half as Danny Ings looked the much livelier Liverpool striker. But after a long lay-off, Sturridge needs game time to get back up to speed and manager Brendan Rodgers' decision to keep him on the pitch was vindicated after the break. His first goal was a superb volley and, with confidence flowing, he then finished off a fine move for a well-taken second. He was a whisker away from claiming a hat-trick five minutes from time. \n \nMOMENT OF THE MATCH \n \nSturridge's first goal was wonderfully executed. James Milner, with his back to goal, flicked the ball in his direction and he took aim to unleash a dipping, curling volley with the outside of his left boot. It was a strike that underlined both his class and how much Liverpool missed him for most of last season. \n \nVIEW FROM THE BENCH \n \nThis was a game of critical importance for Liverpool boss Brendan Rodgers but he showed no outward signs of pressure. He knew the cameras would be on him but did not hide and spent most of the game on his feet. His tactics suited his team selection, although they were undermined by some indifferent defending. Villa manager Tim Sherwood, also under a degree of pressure, was less conspicuous. He seemed happy for his team to sit back when 1-0 down, perhaps wary of the greater damage Liverpool could inflict. At 2-0 they started to show greater urgency but ultimately it was not enough to save the game. \n \nMOAN OF THE MATCH \n \nLiverpool's constant tinkering of formations this season has not done their defence any favours. Their system showed signs of promise in terms of attack but the back line still looks vulnerable and Rodgers' continued faith in Simon Mignolet is surprising. \n \nWHO'S UP NEXT? \n   \n Share article  \n   \nLiverpool v FC Sion (Europa League, Thursday October 1) \n \nAston Villa v Stoke (Premier League, Saturday October 3)", "source": "Falmouth Packet"}