{"published": "2015-09-25T03:42:06Z", "media-type": "Blog", "title": "Youth party denounces brutal dispersal of anti-budget cut protest in Iloilo", "id": "4b78df1d-5cc9-431b-bd1f-1bd83d592d5a", "content": "Kabataan Partylist today decried the brutal dispersal of an anti-budget cut rally in the University of the Philippines Visayas in Iloilo City yesterday. \n \nAbout 500 UP students, faculty, staff, and concerned citizens marched from the UP Iloilo City campus yesterday afternoon, as part of the National Day of Action against Budget Cuts in Education. They were protesting against the impending budget cuts for state universities and colleges in 2016, including the P2.2 billion budget cut for UP. \n \nWhen the group reached General Luna Street, about 200 riot police stopped them from marching onwards to the Iloilo Provincial Capitol and proceeded to violently disperse the rally. \n \nThe police then arrested 11 protest leaders, including Bryan Bosque and Gabyel Guillen of Anakbayan-Panay, UP Visayas faculty Erick Dasig Aguilar and Gretchen Velarde, Iglesia Filipina Independiente Diocese of Iloilo Vicar General Fr. Marco Sulayao, Bagong Alyansang Makabayan-Panay Chair Hope Hervilla, and Karapatan-Panay Secretary General Reylan Vergara. \n \n“We condemn in the strongest possible terms the violent dispersal of the anti-budget cut protest in UP Visayas. We note in particular how the government is increasing using an iron fist against legitimate peaceful assemblies in Iloilo, mostly after to the city’s hosting of one of the Asia-Pacific Economic Cooperation (APEC) ministerial meetings,” Kabataan Partylist Spokesperson Sarah Elago said. \n \n“The state violence exercised by the Aquino administration against the protesters is reminiscent of the dark days of Martial Law, when even legitimate issues and concerns were met with state violence. It is deeply alarming and ironic that the Aquino administration confidently inflicts violence against peaceful protesters just a few days after the nation commemorated the 43rd anniversary of the declaration of Martial Law,” Elago added. \n \nThe arrested protesters were only released from detention a little past 1:00 a.m. today.", "source": "Kabataan Partylist"}