{"published": "2015-09-17T09:57:11Z", "media-type": "News", "title": "British universities hosting extremist speakers to be named and shamed by David Cameron", "id": "f7b16545-9ce0-4261-a56d-243f78721479", "content": "Universities which regularly provide platforms to extremist hate preachers will be named and shamed today by Prime Minister David Cameron. \n \nA list of universities, which includes King’s College London, Queen Mary University, SOAS and Kingston University, all in London, will be released. \n \nMr Cameron plans to reveal the universities as places where Islamist fanatics are allowed to flourish. \n \nHe will tell universities that they must stop giving extremists “the oxygen they need to flourish”, and will announce a legal duty for universities to stop extremists from targeting students. \n      \nThe plans have been criticised by some student bodies and university heads, who say freedom of speech could be damaged if they are forced to block speakers. \n \nMr Cameron will say: “All public institutions have a role to play in rooting out and challenging extremism. It is not about oppressing free speech or stifling academic freedom, it is about making sure that radical views and ideas are not given the oxygen they need to flourish. \n \n“Schools, universities and colleges, more than anywhere else, have a duty to protect impressionable young minds and ensure that our young people are given every opportunity to reach their potential. That is what our one nation government is focused on delivering.” \n \nThis follows on from some 70 events in the past year, which involved hate preachers. \n \nSome universities have blocked speakers in the past year, such as anti-gay imam Haitham al-Haddad, who had been set to speak at the University of Westminster and Kent University. \n \nUniversities will, from 21 September, have a legal duty to put in place policies to block extremists from radicalising students.", "source": "Pink News"}