{"published": "2015-09-07T02:42:05Z", "media-type": "News", "title": "Sous Chef – Dubai Jobs", "id": "7fc159a3-ec48-4a20-aa07-479e185102e1", "content": "• Comply with Standards of Service, assists in assuring the same from all kitchen employees. \n• Assists in manage a day-to-day operation of the kitchen,  coordinate food production schedules and ensure highest level of food quality,  taste and presentation. \n• Make sure that the guidelines from the Executive Chef are followed. \n• Participate in actual food preparation,  produce food consistently high quality,  taste and presentation and expedite during peak meal periods as needed. \n• Control food cost by assisting in training kitchen staff on the proper methods of food preparation and handling,  by training kitchen,  restaurant and steward employees on how to handle leftover food items. \n• Ensures that all kitchen employees consistently adhere to uniform,  grooming and appearance standards. \n• In conjunction with the Executive Chef,  establish goals for the kitchen,  anticipate and resolve problems concerning all facets of the kitchen,  anticipate trends,  enact approved profit-oriented and cost saving ideas/activities. \n• Establish and require strict adherence to health department and Restaurant sanitation and food handling guidelines \n• In conjunction with the Executive Chef,  develop menus & create and ensure adherence to recipes and product specifications. \n• Train kitchen staff on all new menus. \n• The Sous Chef must maintain effective communication within the kitchen,  be responsive to staff suggestions and concerns and work to resolve problems \n• Maintain effective working relationship with food and beverage management and staff. \n• Complete daily food orders based upon scheduled events and projected levels of business. \n• Conduct regular inspections of the entire kitchen/dishwashing areas and coolers and promptly act to correct deficiencies found during inspection \n  \nJob Details Date Posted: 2015-09-06 Job Location: United Arab Emirates Job Role: Other Company Industry: Catering/Food Services/Restaurants Preferred Candidate Career Level: Mid Career Degree: Bachelor’s degree \nApply Now – Jobs in UAE – Other Jobs in UAE – Search All Jobs \n\nRead full news here – Bayt.com Jobs \n\n\n\n\nSearch jobs on Bayt.com, the Middle East’s #1 job site", "source": "Dubai Informer"}