{"published": "2015-09-22T10:50:22Z", "media-type": "News", "title": "Non Hodgkin Lymphoma Market Has 28% of Pipeline Products Categorized As First-In-Class Showing a Low Degree of Innovation", "id": "20006fa5-0f14-4412-8cd0-dc8ffdbb1aec", "content": "SOURCE ReportsnReports\n\nPUNE, India \n\nMarket research titled Frontier Pharma: Innovative Licensing Opportunities in Non-Hodgkin Lymphoma says NHL market product pipeline has innovation in varying degrees across the majority of molecular target families and development stages for NHL therapeutics.\n\nComplete report on non hodgkin lymphoma market spread across 115 pages, covering 10 major NHL industry analysis headings and supported with 12 tables and 49 figures is now available at http://www.reportsnreports.com/reports/425096-frontier-pharma-innovative-licensing-opportunities-in-non-hodgkin-lymphoma.html .\n\nThe current developmental non hodgkin lymphoma market pipeline addresses present gaps in the market, dominated by cancer immunotherapies and inhibitors of cancer-associated signal transduction. Pathways of significant interest include B-cell receptor signaling, the PI3K/Akt/mTOR pathway, and Wnt/ß-catenin signaling, as well as oncogenes such as BCL-6 and BCL-2. Characteristic cell surface molecules that represent targets for cancer immunotherapies include CD19, LMP-1/2 and CD20, with several pipeline drugs already approved for CD20. First-in-class drug development in non hodgkin lymphoma market (NHL) corresponds strongly to these known somatic mutations and affected pathways. Clinical results of drugs against profiled targets in this non hodgkin lymphoma market report show many are being investigated in relapsed disease.\n\nThe product pipeline for non-hodgkin lymphoma market (NHL) exhibits a lower degree of innovation than both the industry and oncology average, with just 28% of all pipeline products, or 33% of the pipeline for which there is a disclosed molecular target, categorized as first-in-class. This is in comparison to industry, breast cancer and lung cancer innovation rates of 43%, 57% and 59%, respectively. While NHL, collectively, is the sixth to tenth most common cancer dependent on territory, each individual subtype is classified as an orphan disease. With significant differences in each subtype's genetic profile and current treatment, there is reduced scope for the development of a targeted non hodgkin lymphoma market therapy with cross-subtype activity.\n\nThis does not present non hodgkin lymphoma market drug development as an attractive investment in comparison to other indications in oncology, particularly as survival durations across many NHL subtypes are relatively strong, and likely the reason for low first-in-class innovation levels. Order a copy of Frontier Pharma: Innovative Licensing Opportunities in Non-Hodgkin Lymphoma 2015 market research report at http://www.reportsnreports.com/Purchase.aspx?name=425096 .\n\nThe scope of this non hodgkin lymphoma market report aims to answer multiple questions based on current industry status covering: There are 666 marketed products for non hodgkin lymphoma market, 95% of which are small molecules - what are the dominant mechanisms of action across marketed products? The treatment of lymphoma is dominated by the use of combination cyclophosphamide based chemotherapy in combination with rituximab - What are these chemotherapy regimens? How did they perform in key clinical trials? The variation in molecule type has shifted away from small molecules, whose dominance has decreased to 46% across the pipeline - What are the dynamics of the remaining 54% of the pipeline? How does this reflect the need for novel targeted therapies? There is a significant shift away from cytotoxic agents, with the current pipeline dominated by cancer immunotherapies and signal transduction inhibitors - What is the scientific rationale behind these mechanisms of action? How successful have approved targeted therapies been? Profiled first-in-class therapies include: PIK3CA, EZH2, CD40 and MDM2 - What is the scientific rationale behind these targets? What preclinical and clinical results are available for drugs against these targets? What is the overall opinion on these targets for drug development across non hodgkin lymphoma market?\n\nThis latest non hodgkin lymphoma market report also notes that despite the difficulty of several targeted NHL therapies in achieving improved efficacy rates, the development of such treatments remains of key interest across NHL. It is hoped that one of these many targeted therapy pipeline products will replicate the success observed with rituximab, which significantly altered the NHL treatment landscape following its approval. Clear gaps in the treatment algorithm include maintenance therapies to prolong initial or subsequent durations of remission, and improved therapies for relapsed patients, particularly those with a second or subsequent relapse.\n\nOn a related note, market research titled Non-Hodgkin Lymphoma - Pipeline Review, H1 2015 report is spread across 868 pages and provides comprehensive information on the therapeutic development for Non-Hodgkin Lymphoma, complete with comparative analysis at various stages, therapeutics assessment by drug target, mechanism of action (MoA), route of administration (RoA) and molecule type, along with latest updates, and featured news and press releases. It also reviews key players involved in the therapeutic development for Non-Hodgkin Lymphoma and special features on late-stage and discontinued projects. Comprehensive table of contents and more is available at http://www.reportsnreports.com/reports/411637-non-hodgkin-lymphoma-pipeline-review-h1-2015.html .\n\nExplore more reports on pharmaceuticals market at http://www.reportsnreports.com/market-research/pharmaceuticals/ .\n\nAbout Us: \n\nReportsnReports.com is an online market research reports library of 500,000+ in-depth studies of over 5000 micro markets. Not limited to any one industry, ReportsnReports.com offers research studies on agriculture, energy and power, chemicals, environment, medical devices, healthcare, food and beverages, water, advanced materials and much more.\n\nConnect With Us on:\n\nFacebook: https://www.facebook.com/pages/ReportsnReports/191441427571689\n\nLinkedIn: http://www.linkedin.com/company/reportsnreports\n\nTwitter: https://twitter.com/marketsreports\n\nG+ / Google Plus: https://plus.google.com/111656568937629536321/posts\n\nPinterest: http://www.pinterest.com/comeonseo/reportsnreports/\n\nRSS/Feeds: http://www.reportsnreports.com/feed/l-latestreports.xml\n\nContact:\n\nRitesh Tiwari \n\n©2015 PR Newswire. All Rights Reserved.", "source": "KYTX CBS 19"}