{"published": "2015-09-18T22:51:00Z", "media-type": "News", "title": "Despite agreement, questions remain about Stoney Field renovation plans", "id": "abbac11f-2a07-4f29-8b4d-a38d09c10a0c", "content": "CHARLESTON, SC (WCSC) - \n\nThe Burke High School football team prepared for kickoff Friday night under the lights at Johnson Hagood Stadium, which stands directly across the street from Stoney Field, their home stadium.\n\nWednesday, community members rallied to keep the Bulldogs' game downtown, despite poor field conditions at Stoney Field, which school officials deemed unsafe to play on.\n\nBurke was initially scheduled to play Friday's game at Ravenel Stadium, on the old St. Andrew's High School campus in West Ashley.\n\n\"We want action. Action speaks louder than words and we've been waiting too long,\" Rep. Wendell Gilliard said.\n\nIn a 2011 land agreement between the City of Charleston, and Charleston County School District, the deal called for CCSD to renovate the field, using more than $2 million dollars owed the City, instead putting it towards that project. That money would come from the district's capital cycle between 2016-2021.\n\nTo date, renovations have not begun.\n\n\"The big issue here is not to save Stoney Field, but to build what we need,\" retired Burke football coach Earl Brown said. Brown led the football team on Stoney Field for nearly 30 years.\n\nBuilt in the early 1960's, the field suffered major damage after Hurricane Hugo, and has been renovated 14 times. For the second time this season, conditions on the field have been ruled unsafe to play because of soggy ground, that's also sinking.\n\n\"Well, it was built on a garbage dump,\" retired Army Sgt. Herman Allen said. Allen served on a committee to maintain Stoney Field, which included getting it ready for game day. \"It was revealed that it was a mutual agreement between the city and the school district.\"\n\nEight years later, Allen still holds a copy of plans from 2007 to renovate the stadium.\n\n\"Well that never transpired,\" he said. \"I would love to see that individual that took that two million dollars and stuck in their pocket and went home, because it didn't go to Stoney Field.\"\n\nAttempts to get a response from the school district have been unsuccessful. \n\nGilliard has called a meeting with city leaders on Sept. 25 on the issue.", "source": "WSFA"}