{"published": "2015-09-01T12:01:06Z", "media-type": "News", "title": "Varian Puts Research Tools in the Cloud to Speed Development of Next Generation Cancer Treatment Technologies", "id": "3c8dac6e-6c13-46c7-ba26-f9f08c6bf3a8", "content": "_ PALO ALTO, Calif. \n\nVarian's new Developer Cloud houses digital tools like information about TrueBeam® Developer Mode, and cloud-based applications for managing Developer Mode and simulating treatments. It is part of the company's overall objective to empower research-oriented clinical teams to accelerate the development of new treatment techniques and processes designed to improve outcomes for cancer patients. \n\n\"When Varian introduced the TrueBeam platform in 2010, we included Developer Mode, an optional non-clinical development tool for researchers to use in pioneering and prototyping new treatment techniques,\" said Corey Zankowski \n\nIn a separate development, the OncoPeer online forum, first launched last March in select geographic areas, is now accessible to Varian customers worldwide. Since March, users have established discussion groups on topics like oncology analytics, knowledge-based treatment planning, treatment planning using Eclipse™ software, and the physics of radiotherapy. One discussion group focuses on how to use Varian's ARIA® information system to manage a medical oncology department. Other groups share information about Varian treatment delivery platforms. \n\n\"OncoPeer is a place for customers to find others who use Varian technology and learn from one another,\" said Sukhveer Singh \n\nVarian held an online seminar about Navigating OncoPeer last May. Interested clinicians can view a replay of the webcast at this registration website. Customers can access OncoPeer at www.oncopeer.com (registration required).\n\nAbout Varian Medical SystemsVarian Medical Systems, Inc., of Palo Alto, California \n\nForward-Looking Statements\n\nExcept for historical information, this news release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Statements concerning industry outlook, including growth drivers; the ability of the company's technology and products to treat cancer or improve outcomes; and any statements using the terms \"intended to,\" \"potential,\" \"can,\" \"would,\" or similar statements are forward-looking statements that involve risks and uncertainties that could cause the company's actual results to differ materially from those anticipated. Such risks and uncertainties include the effect of global economic conditions; demand for the company's products; the company's ability to develop, commercialize, and deploy new products; the company's ability to meet legal and regulatory requirements; changes in the legal or regulatory environment; and the other risks listed from time to time in the company's filings with the Securities and Exchange Commission, which by this reference are incorporated herein. The company assumes no obligation to update or revise the forward-looking statements in this release because of new information, future events, or otherwise. To view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/varian-puts-research-tools-in-the-cloud-to-speed-development-of-next-generation-cancer-treatment-technologies-300135723.html\n\nSOURCE Varian Medical Systems", "source": "Sys-Con Media"}