{"published": "2015-09-08T18:16:00Z", "media-type": "Blog", "title": "Owen raves: 'Sensational' £25m Liverpool star is 'world-class' and LFC's 'best' player. Agree?", "id": "93605d88-7c0b-4d59-a5c6-ca319b9d7f0c", "content": "As most fans will surely agree, attacking maestro Philippe Coutinho is one Liverpool's most important players, and - along with Daniel Sturridge - he's one of Liverpool's few transfer successes under Brendan Rodgers. Coutinho's inconsistency is frustrating at times, and his goals/assists ratio leaves a lot to be desired, but according to ex-Red Michael Owen, Coutinho has already reached the apex of his ability. Over the weekend, Owen selected a combined Manchester-Liverpool XI, and Coutinho made the cut. Outlining his reasons for selecting the Brazilian, Owen explained:\n“I would put Coutinho on the right of the three behind the striker. He’s developed into one of the best players in that type of position, behind the centre-forwards, liking to come in off the flanks or stay in that position. He’s a world-class player, Liverpool’s best\".\n'Sensational' Coutinho is undoubtedly one of Liverpool best attacking players, but 'world-class'? No chance. In my view, before a player can be deemed 'world-class', he/she must:\n* Have a Specific, Measurable Impact (SMI) - at all three levels of football, which are: Domestic (national leagues); European (Champions League/Europa League, or worldwide equivalent); World (International - qualifying and/or tournaments).\n* Push his/her team to relative success at all three levels.\n* When assessing 'relative success', the team's Optimum Achievement Level (OAL) should be considered: considering the overall quality of players available, and relative strength of other teams, what is the absolute best the team can realistically expect to achieve?\n* Causation: The player's causal contribution to his team's OAL. To what extend did the player in question help the team to meet its OAL? But for the player under consideration, would the team still have achieved its OAL?\n* SMI at all three levels is required. Two out of three is not good enough.\n* A variety of objective, position-specific criteria should be used when assessing the SMI of players. For example, for attacking players: Goals; assists; conversion rate; key passes; shot-assists; passing accuracy etc. For defenders: goals conceded; blocks; aerial duels won; tackle success rate etc.\n* A player's individual SMI is all important. How far did the player contribute to the team achieving its OAL? If you remove the player's SMI from the equation, would the team still achieve its OAL? If so, then that player is probably not world class. Truly world class players are absolutely integral to their team's success, to the extent that, without that player, the team would not achieve its OAL. Philippe Coutinho: World-Class?\nFor the most part, £25m-rated Coutinho is having the requisite impact for LFC at domestic level, but he hasn't yet excelled at either European or International level for Liverpool or Brazil. For example: Coutinho failed to score/create a single goal in six Champions League/Europa League appearances last season, and I don't see how a player can be 'world-class' with zero impact in European competition.\nI'm sure Coutinho can - in time - achieve world-class status, but right now, he's a long way off, and there's no credible evidence to support Owen's contention that the Brazilian is world-class. Of course, if someone can mount a credible argument for Coutinho's world-class status (that goes beyond 'I think, therefore, he is), then I'm listening.\nAuthor: Jaimie K Categories: coutinho, JaimieK Articles", "source": "Liverpool-Kop.com"}