{"published": "2015-09-23T23:43:12Z", "media-type": "News", "title": "Pope lauds Obama on climate change, canonizes controversial missionary", "id": "e0cf72ee-2aa2-410e-be52-cc6e4e5e19e0", "content": "By By | Reuters  –  \nBy Philip Pullella and Jeff Mason \n \nWASHINGTON (Reuters) - Pope Francis on Wednesday urged the United States to help tackle climate change and touched on other divisive U.S. political issues such as immigration and economic inequality on his first visit to the world's richest nation. \n \nIn a speech on the White House South Lawn on the first full day of his U.S. trip, the Argentine pontiff lauded President Barack Obama's efforts to reduce air pollution as \"encouraging,\" months after Francis made the environment one of his top concerns by issuing a landmark encyclical letter to the church. \n \n\"It seems clear to me also that climate change is a problem which can no longer be left to a future generation. When it comes to the care of our common home, we are living at a critical moment of history,\" the pope said at a welcoming ceremony. \n \nIn an era of renewed U.S. racial tensions, the 78-year-old pope invoked America's best-known civil rights leader, the late Reverend Martin Luther King Jr., to make points about the environment and equality. \n \nThe pope later said Mass in Spanish to about 25,000 gathered inside and outside the Basilica of the National Shrine of the Immaculate Conception and canonized 18th-century Spanish missionary Friar Junipero Serra. The canonization was controversial because critics say that Serra beat and imprisoned Native Americans, suppressed their cultures and facilitated the spread of diseases that heavily reduced the population. \n \nDuring the first canonization on U.S. soil, Francis in a homily hailed Serra as a man who \"sought to defend the dignity of the native community, to protect it from those who had mistreated and abused it.\" Some Native American activists condemned making Serra a saint, with one, Corrina Gould, saying Serra intended to wipe out the native people. \n \nSpeaking to American bishops at the Cathedral of St. Matthew, Francis said the sex abuse of minors by clergy should never be repeated, acknowledging the damage caused by years of scandal in the U.S. Catholic Church. \n \nThe pope referred to the bishops' \"generous commitment to bring healing to victims.\" But David Clohessy, head of the Survivors Network of those Abused by Priests, who himself was sexually assaulted by a priest as a child, said, \"Bishops have been cowardly, not courageous, and still are.\" \n \nAs Washington streets were closed and federal workers stayed home, about 15,000 people gathered in bright sunshine and warm temperatures on the South Lawn. They heard the pope depart from his usual practice and give a speech in English. \n \nHe again made a gesture of simplicity, pulling up in the small black Fiat car he used for his arrival in the U.S. capital on Tuesday. \n \nFrancis is a critic of the damage caused to the world's poor and the environment by capitalism's excesses. The pope also commented on immigration and religious freedom, issues on the U.S. political agenda ahead of the November 2016 presidential election. \n \n'SACRED OBLIGATION' \n \nObama, whose plans for climate change legislation were thwarted in Congress early in his presidency, said he shared the pope's concerns about the environment. \n \n\"Holy Father, you remind us that we have a sacred obligation to protect our planet: God's magnificent gift to us. We support your call to all world leaders to support the communities most vulnerable to a changing climate and to come together to preserve our precious world for future generations,\" Obama said. \n \nFrancis and Obama held about 40 minutes of talks in the White House. An interpreter was the only other person present and the White House declined to detail the talks. Both men see eye-to-eye on climate change and defense of the poor but hold different views on abortion rights and gay marriage. \n \nFrancis gave his support to traditional marriage, pointing out that he will travel to Philadelphia later in his six-day visit to the United States for a meeting of Catholics \"to celebrate and support the institutions of marriage and the family.\" The U.S. Supreme Court in June legalized same-sex marriage across the United States. \n \nIn an apparent nod to the fierce debate in the United States about illegal immigration, Francis described himself as the son of an immigrant Italian family in Argentina. \"I am happy to be a guest in this country, which was largely built by such families,\" he said at the White House. \n \nThe pope also said U.S. Catholics are committed to building a \"truly tolerant and inclusive\" society that rejects discrimination. Francis also mentioned the \"millions of people living under our system, which has overlooked them.\" \n \n\"I would like all men and women of goodwill in this great nation to support the efforts of the international community to protect the vulnerable in our world,\" the pope said. \n \nAdoring crowds waving white-and-yellow Vatican flags cheered the pontiff on a parade through Washington streets as the leader of the world's 1.2 billion Roman Catholics sprinkled some stardust in a city not unduly impressed with important foreign visitors. \n \nAt one point, he had his converted Jeep stop when he saw a baby in the crowd. Francis was handed the 5-month-old son of Salvadoran immigrants who live in Virginia, and kissed the boy, Loukas Chavez, on the head. \n \n\"I just thought it was an unbelievable moment,\" said the baby's mother, Iris Chavez, 25, her daughter, Emely, almost 2, in her arms. \n \nThe first Latin American pope, Francis has electrified liberal-leaning U.S. Catholics, Democrats and many non-Catholics with a shift in emphasis toward concern for the poor and immigrants and his appeals to combat climate change. But his criticism of unbridled capitalism has unsettled U.S. conservatives. \n \nFrancis will give the first speech by any pope to the U.S. Congress on Thursday, an address to the U.N. General Assembly in New York on Friday and an open-air Mass in Philadelphia where 1.5 million people are expected to attend on Sunday. \n \n(Additional reporting by Scott Malone, Julia Edwards, Susan Cornwell, Ian Simpson and Roberta Rampton; Writing by Alistair Bell and Will Dunham; Editing by Mary Milliken, Grant McCool and Lisa Shumaker)", "source": "Yahoo! India"}