{"published": "2015-09-18T11:09:09Z", "media-type": "News", "title": "Emirates Airline ready for busy season", "id": "9ad4371f-c5d4-4d08-98de-301298ec5096", "content": "posted today | Friday, 18 Sep 2015 \r \n  \r  In light of the upcoming Eid Al Adha holiday period, Emirates Airline is anticipating more than 300,000 passengers to travel out of the UAE throughout the month of September.  \nAccording to the carriers’ figures, bookings increased almost 65 per cent over last year. This year, the top destinations that travellers are heading to are Dhaka, Mumbai, London, Karachi and Cairo. Meanwhile, short haul travel will constitute around 52 per cent of bookings while long haul travel is expected at 48 per cent. \n\nEmirates Airline will also be accommodating over 20,000 Hajj travellers during the pilgrimage period as well. \n\nOn the inbound front, throughout September and the Eid Al Adha period, the airline is expecting over 190,000 passengers to arrive into Dubai from destinations in the UK, India, Germany, Australia, US and South Africa. \n\nDivisional senior vice president commercial operations centre, Emirates Airline, Sheikh Majid Al Mualla remarked: “We continue to see travellers coming back in greater numbers during holiday periods, which is a testament to the outstanding customer experience Emirates Airline provides so we are well-positioned to continue building on that success. \n\n“We believe that all parts of the customer journey are important to passengers. Whether it’s their airport experience from checking in, our generous baggage allowance, warm and friendly crew, internationally inspired cuisine, on board connectivity and our ice entertainment system, passengers enjoy the greatest value possible from their experience with us.” \n\nOn all Emirates Airline’s services, all passengers are granted a baggage allowance of 30kg in economy class, 40kg in business class and 50kg in first class. \n\nSpecifically for family travellers, the airline has dedicated areas for families consisting of 10 economy check-in counters in Terminal 3, Area 2. Special stroller services upon departure and arrival grant parents access to prams heading to their gate and immediately upon leaving the aircraft. Families also enjoy priority boarding. Adding to this, in the Emirates Dubai lounges, children may be kept entertained at the special children’s play and entertainment areas with arcade games.", "source": "TTG Middle East & North Africa"}