{"published": "2015-09-12T07:01:00Z", "media-type": "News", "title": "Corey Seager's days as the Dodgers' starting shortstop are numbered", "id": "084cd2ab-a75e-433e-8057-53e5af85bbba", "content": "With his home run in the third inning Saturday, Joc Pederson climbed the franchise leaderboard for most home runs by a rookie: \n\nMike Piazza\t1993\t35 Joc Pederson\t2015\t25 Del Bissonette\t1928\t25 \n    \nPHOENIX >> Corey Seager’s torrid start isn’t enough to guarantee the rookie shortstop a spot in the Dodgers’ starting lineup once Jimmy Rollins returns. Rollins has been unable to hit or play the field in five games this week because of a tender right index finger. \n\nMeanwhile Seager is batting .448 with an on-base percentage of.568 through his first nine major league games. He went 4 for 4 with a home run and stole a base in the Dodgers’ win Saturday. He’s reached base in all nine of his plate appearances the last two days. \n  \nOnce Rollins returns, however, Dodgers manager Don Mattingly said the plan for Seager “always has been to play him some at short and give Jimmy days, give (Justin Turner) days at third. He’s played more than we thought from the standpoint of injuries and he’s done a good job. \n\nWhile he’s been praised for his defense and leadership, Rollins also ranks last among qualified National League shortstops in batting average (.220) and on-base percentage (.279). \n\nThe 36-year-old is available to pinch run, but hasn’t been cleared to bat or play the field. Mattingly said there’s no timetable for Rollins to return. \n  \nSeager, meanwhile, continues to impress. His home run was the second-hardest hit by a Dodger this season at 110 mph. \n\n“He just doesn’t make me nervous,” Mattingly said. “He’s got that (Adrian Gonzalez) heartbeat. It’s slow. He’ll live to be 108, I bet.” \n\nMattingly has shunned any questions about potential playoff roster scenarios so far. But with the Dodgers’ magic number to clinch the division nearing single digits (14), the battle for the final NLDS roster spots will soon be a main focal point of the season. \n  \nEven if he doesn’t supplant Rollins as the starting shortstop this season, Seager could still make an impact as a reserve. \n\n“He’s going to be really good,” Mattingly said, “and he is really good.” \nPuig not in the house \nWhy isn’t Yasiel Puig at Chase Field? \n\nGood question. \n\n“I expected him to be here, honestly,” Mattingly said. \n\nPuig is rehabbing a strained right hamstring at Camelback Ranch in nearby Glendale. He hasn’t played since Aug. 27. While the team hasn’t reported any setbacks in Puig’s rehab, “he’s not working out on the field; he’s working out in water and the Alter-G.” \n \n\r\r \n  \nAs baseball activities go, Puig isn’t doing any less than pitcher Brandon McCarthy, for one, who’s out for the season following Tommy John surgery on his right elbow. But McCarthy is with his teammates in the clubhouse and the dugout during games. \n\nPuig, who’s rehabbing a half-hour away, is not. \n\n“Everybody’s invited,” Mattingly said. “All I’m saying is he’s welcome.” \n\nMattingly said that Puig will return to Los Angeles with the team when it flies home tomorrow night. \nAlso \nKiké Hernandez (strained left hamstring) ran on the field prior to the game. … Howie Kendrick (strained left hamstring) will get 10 at-bats Monday and Tuesday at Dodger Stadium in live batting practice. He is still unable to run at full speed, though “his time was pretty good, faster than the day before,” according to Mattingly. … Condolences to the family of Dodger Stadium chef Dave Pearson, who died at age 75. He had been battling lung cancer.", "source": "SGV Tribune"}