{"published": "2015-09-24T11:28:00Z", "media-type": "Blog", "title": "India plans to hand over “degraded” forests to plantation companies", "id": "6ae97f25-9a70-46b1-93aa-43e0941d286b", "content": "The Government of India is proposing to lease 40% of the country’s forests, classified as “degraded”, to private companies to improve and restore forest landscapes. Earlier this week, the All India Forum of Forest Movements (AIFFM) put out a statement opposing this proposed privatisation of India’s forests. Last month, India’s Ministry of Environment, Forests and Climate Change issued guidelines on “Participation of Private Sector in Afforestation of Degraded Forests”. The AIFFM statement notes that the proposal is in breach of several statutes including the Forest Rights Act, the Panchayat Extension to Scheduled Area Act, the Indian Forest Act, and the Forest Conservation Act. While the Ministry of Environment’s guidelines mention safeguards for forest rights and protecting tribal interests, the guidelines allow no space for community involvement. The Hindustan Times reports that the guidelines state that: It has been felt that ongoing national afforestry programmes have not been able to make the desired impact in improving productivity and quality of forest cover due to a lack of sufficient investment, capacity, technological upgradation and adequate skilled manpower.\n \nThus there is need to look at options including how private sector can contribute in improving and restoring forest landscapes apart from meeting the vital requirement of various forest products. But as the AIFFM points out “improving and restoring forest landscapes” in reality will involve establishing industrial tree plantations. India’s pulp and paper industry has been lobbying for decades to get its hands on the country’s degraded forests. A former director of the Indian Institute of Forest Managment in Bhopal commented to the Hindustan Times, “Even the most degraded natural forests have 50-100 species of trees per hectare. For their end products, industries would hardly plant one or two species.” These “degraded” forests are also crucially important for rural communities. Dr N. C. Saxena was a member of India’s Planning Commission. In a paper titled “Tenurial Issues in Forestry in India”, Saxena argued against handing over degraded forests to private companies: Such lands may have a low tree density, but satisfy the fuelwood, fodder and livelihood needs of about 100 million people. In fact, these lands are degraded because they suffer from extreme biotic pressure, and require neither capital investment, nor higher technology, but protection and recuperation, which can be done only by working with the people, where industry has neither expertise nor patience. The West Bengal experience shows that about 2000 peoples’ forest protection committees have regenerated more than 300,000 hectares of sal forests at little extra investment, simply by protection on the promise of sharing wood and non-wood products with them. If lands on which peoples’ livelihoods are dependent are given to industry, they may have to employ muscle power to keep people at bay, thus escalating social tensions, which are already quite acute in several forest and park areas. In April 2014, the Ministry of Environment published a draft National REDD+ Policy and Strategy. One of the objectives of the REDD+ Policy is, to lay emphasis on achieving various thematic elements of SMF by addressing the drivers of deforestation and forest degradation, afforestation of degraded areas, protection measures, etc. while implementing the REDD+ programmes Because of the failure to differentiate between industrial tree plantations and forests, the pulp and paper industry’s monoculture tree plantations would slot neatly into India’s proposed REDD plans, as “afforestation of degraded areas”. Our Forests are not for Sale! Stop Privatizing India’s Forests!  \nA Press Release by All India Forum of Forest Movements(AIFFM)\n \n21 September 2015\n \nRecent guidelines sent by the Ministry of Environment, Forests and Climate Change (MoEFCC) to state governments and UTs [Union Territories], confirm that Government of India has finally made up its mind about allowing ‘forest concessions’ to private sector companies in what it perceives as state-owned forests. We learn from various media reports and the leaked guidelines that 40 percent of ‘identified’ degraded forests could be given away on lease to private companies for raising plantations, and as the Minister Prakash Javadekar has said, to bring back forests where there were no forests. The same minister has earlier this year remarked that ‘diversion of forests’ is a negative phrase, it should be replaced with ‘reforestation’, because aren’t the agencies who use forest lands for activities such as mining, dam-building and tourism paying for compensatory afforestation, in other words, raising new forests?\n \nThe Minister represents his government in what he has been saying, and whatever decisions his Ministry has been taking for last 16 odd months, follow a conscious pattern.\n \nThe pattern is simple. The present Government of India, which means the Indian state, is intent on neo-liberalizing the environment. Going by experiences from across the world, that means destroying it altogether, or changing and maiming it solely in the interest of capital. Environment and business, environment and investment, environment and development must go together, we are told daily. Environment must not impede growth, we are reminded.\n \nBecause state always knows best, what the law says does not matter. The idea of handing over so-called degraded forests to corporations violates not one but several statutes such as Forest Rights Act and PESA, and also Indian Forest Act and Forest Conservation Act. The first two stipulate that communities and community institutions such as gram Sabha will determine the future use of forests and forest land. The next two, taken together, have no provision for privately owned or leased ‘state’ forests. The MoEF guidelines mention safeguards for forest rights, and protecting tribal interests. In the same breath, they allow no space for community intervention in the entire process, and limit community use of future leased out forests to only 10-15 percent of the total leased area. Finally, and most importantly, plantations are not forests: irrespective of species being planted, a plantation can not replace or in any way replicate the biodiversity even a so-called degraded natural forest support, and the sustenance they provide to local communities.\n \nThe Government can not change laws at will. Its executive powers do not extend to amending them, or changing them in such a way that the constitutional and legal essence of such laws are altered. Yet the present government keeps on doing precisely this; realising that they lack the requisite majority in parliament for amending the statutes, a governance through decrees, ordinances and executive fiat is replacing the rule of law altogether.\n \nThe Government has also recently announced an unbelievable 15 billion US$ package for new plantations, which, it was said, the government already had. On top of that, the government needs yet more money for plantations? What is the game that is being played, really?\n \nWe apprehend that the ambitious and now corporatized plantation programme of the present government will be used to greenwash its emphasis on coal mining, and continuing with coal as the primary source of electricity generation, in international climate negotiations. The proposed private plantations can also be used in the dubious game of domestic carbon trading. It also follows logically that that the present scheme of allowing private plantations inside reserved forests will also be shown in future as a REDD plus activity because it will help restock the depleting carbon stores in degraded forests.\n \nIn reality, the plantations will disempower and dispossess people, not only through land grab, but also by promoting more new mining throughout our forests.\n \nWe protest against these undemocratic and underhand exercises of commoditising nature, the conspiracy of deliberately undermining the power of grassroots communities over the nature they use and live with. Forests are not meant for corporate profit, they are life support systems. Degraded forests must be identified and regenerated and restored, democratically and ecologically, through the agency of communities and their gram sabhas. They can not be, under any circumstances, given away to corporations.\n \nWe call for an unified resistance against the machinations of the government, in defense of our forest commons.\n \nIssued by:\n \nPravin Mote and Debjit Nandi\n \nOn Behalf of AIFFM Secretariat   Related", "source": "REDD-Monitor"}