{"published": "2015-09-21T14:00:00Z", "media-type": "News", "title": "IKOULA, the Cloud Hosting Specialist, Begins Its International Expansion and Extends Its Cloud Service to the United States", "id": "f74bc3fe-8bd6-4c88-a7b9-67394a4f65ba", "content": "PARIS \n\nIkoula, the French cloud hosting expert and winner of the EuroCloud award for \"Best Cloud Infrastructure Service\", recently extended its private cloud offer to the United States \n\nTo view the Multimedia News Release, please click:\n\nhttp://www.multivu.com/players/uk/7627951-Ikoula-cloud-hosting-extends-united-states/\n\nAlready well established in France \n\nIn the coming weeks, Ikoula will also be launching a wiki: a community knowledge-sharing website. This site will serve as a directory for all manner of information connected with cloud solutions, complete with technical advice, best practices and also tutorials. It will be available in several languages, including English.\n\n\"Data management and e com \n\nExcellence is central to Ikoula's philosophy when it comes to client service and support. In addition to the support available in several languages, each new client will be assigned a specific Project Account Manager in order to facilitate their project's development.\n\n\"Trust is key to the success of any hosters,\" explains Jules-Henri Gavetti \n\nThe public cloud allows Ikoula clients to very rapidly deploy VM (in 1 click and in under 30 seconds) on an infrastructure equipped with SSDs. From the client interface, it is possible to easily manage these and also to monitor their consumption in real time (hourly invoicing). Lastly, the Ikoula cloud is open technology, compatible with EC2 and incorporating Docker containers. \n\nIn addition to the public cloud, Ikoula's private cloud is available to businesses operating in critical environments. The infrastructure is dedicated within a data center (DCaaS) and invoicing takes place according to a fixed-rate model for greater cost control. In the event of a need for additional capacity, users can at any time overflow (hybrid cloud) onto the public cloud for limited operations.\n\nWhat's more, Ikoula is committed to providing its clients with the high-quality 24/7 support and accompaniment that has been central to the firm's success.\n\nWith the opening of its second data center in France \n\nTo celebrate its international expansion, Ikoula's public cloud is free for a period of 6 months, only available for the 100 first registrants, with a limitation of 100€/month (exclusive of VAT).\n\nLearn more: https://express.ikoula.com/en/public-cloud\n\nAbout Ikoula:\n\nIkoula has been specializing in ICT hosting, dedicated servers and the French cloud since 1998. The company has its own data centers in France \n\nIkoula is divided into three divisions: \n\nExpress Hosting: packaged and flexible hosting solutions ranging from a domain name to a dedicated physical or virtual server, available fast from the online store.\n\nEnterprise Services: a specialist in managed hosting, cloud computing and collaborative platforms, Ikoula's 24/7 onsite presence ensures the high level of availability of your applications and guarantees your peace of mind.\n\nEx10: the marketplace for collaborative white-label cloud solutions, specially developed for resellers and IT integrators.\n\n(Photo: http://photos.prnewswire.com/prnh/20150918/267942 )\n\nVideo: \n\nhttp://www.multivu.com/players/uk/7627951-Ikoula-cloud-hosting-extends-united-states/\n\nSOURCE Ikoula", "source": "Stock Nod"}