{"published": "2015-09-30T14:14:14Z", "media-type": "News", "title": "iSmart Alarm, Inc. Announces Website-Exclusive Custom DIY Smart Home Security Packages", "id": "e3172ac7-45f5-4049-9498-4bb1ab4c7c73", "content": "iSmart Alarm, Inc., a US-based company focusing on Smart Home and DIY Home Security products, announced a new series of security solution bundles exclusively for purchase on iSmartAlarm.com. Available immediately to the US and Canada, the Exclusive Packages line has a primary focus - To provide the most user-friendly DIY smart home security and home automation solutions. \n\niSmartAlarm offers their users advanced smart home controls, security and automation using their iPhone or Android devices at a fraction of the cost of traditional security companies. The system puts a 21st century spin on traditional security systems by offering a self-monitored, self-controlled home security system that is designed to be expandable, mobile and DIY, with no costly monthly fees, long-term contracts, or difficult wiring. \n\niSmartAlarm Exclusive Packages - \n\nThe Guard Package is perfect for an apartment or small house below 1,200 square foot. It offers 1 CubeOne™, 3 Motion Sensors, 4 Contact Sensors, and 3 Remote Tags. Available for $299.00, a savings of $55.00. The Protect Package is ideal for a 2-bedroom home or apartment, and offers 1 CubeOne™, 5 Motion Sensors, 6 Contact Sensors, and 3 Remote Tags. Available for $399.00, customers save $85.00. The Shield Package offers 1 CubeOne™, 7 Motion Sensors, 8 Contact Sensors, and 3 Remote Tags. For only $499.00 (a discount of $115.00), a 3-bedroom home can be completely protected.\n\nThe iSmartAlarm home control ecosystem provides users new levels of control, security, and connectivity, allowing anyone to monitor, manage, and secure their home, property and family using their iPhone and Android devices. There are no contracts and no monthly fees for customers - Families can use and expand the system easily without worry. Up to 80 devices and sensors can be added to the CubeOne hub. \n\n\"Customer feedback is extremely important in the growth of the iSmartAlarm Home Security System,\" said Raymond Meng, CEO and Co-Founder, iSmart Alarm, Inc. \"We are proud to be able to bring more custom packages and services to market, and we strongly feel that it is vital to provide as many choices as possible.\" \n\nAbout iSmart Alarm, Inc.\n\niSmart Alarm, Inc. was founded in Silicon Valley in 2012 on the principles of safety, beauty, and intelligence. They designed and developed the best smartphone-enabled home security and home control systems with rave reviews from CNET, SecurityGem, Digital Trends, and others. iSmartAlarm products have won national and international awards including the CEA Mark of Excellence, Red Dot Product Design Award, and PC Mag's Editor's Choice Awards. The sleek, easy-to-use system utilizes a smartphone and tablet app to put home security and home control in the palm of its users' hands. iSmartAlarm packages start at $199.99, and have no monthly fees or contracts. iSmartAlarm protects your home intelligently. iSmart Alarm Social Media: \n\nTwitter: http://www.twitter.com/iSmartAlarm", "source": "Pettinga Financial Advisors"}