{"published": "2015-09-13T12:59:58Z", "media-type": "News", "title": "Flavia Pennetta proud to sign off with US Open title", "id": "797de533-e29f-4d02-942a-1fa1f99e127e", "content": "US Open champion Flavia Pennetta believes lifting a first grand slam title next to her childhood friend was the perfect way to end her career.\n\nPennetta beat fellow Italian and long-time companion Roberta Vinci 7-6 (7/4) 6-2 and then used her victory speech to announce her retirement in front of a shocked crowd in Arthur Ashe Stadium.\n\nThe world number 26 will still play on until the end of the season but this was her last outing at Flushing Meadows and her final match at a grand slam.\n\nPennetta had been rated 150/1 to win before the fortnight began and at 33, she becomes the oldest female in the Open era to win a major tournament for the first time.\n\nThe surprise victory is worth 3,300,000 US dollars and Pennetta is projected to rise to eighth in the world rankings, but the veteran Italian was in no doubt about her decision to call it a day.\n\n\"Sometimes we are more scared to take the decision because we don't know what we're going to do after but I think it's going to be a pretty good life,\" Pennetta said.\n\n\"I'm really proud of myself. I think I did everything that I expect. More. Much more.\n\n\"You start when you are really young and you make a lot of decisions, hard decisions, you lose so many things when you're young.\n\n\"With this, winning today, my life is perfect. I cannot say anything different. Perfect.\"\n\nIt was the Open era's first all-Italian grand slam final and there was a distinctly Mediterranean feel to the contest as t he players walked out to Francesco Sartori's 'Time to Say Goodbye' blaring out around the arena. \n\nPennetta's Italian boyfriend, world number 32 Fabio Fognini, was in attendance, as was Italy's prime minister Matteo Renzi, who spoke to the champion after the match. \n\n\"He said, 'You don't going to understand what happens now in Italy',\" Pennetta said.\n\n\"He was talking with me and Roberta because we were together. In Italy now is going to be crazy.\"\n\nVinci and Pennetta first played together when they were nine years old in Brindisi, Pennetta's home town, and as teenagers the pair moved to Rome where they enrolled with the Italian tennis federation's talent programme and lived together as room-mates for four years.\n\nAfter her historic victory, Pennetta whispered to Vinci her decision to retire as they sat next to each other on court, waiting for the presentation to begin.\n\n\"I told her, 'Roberta, this is my last New York',\" Pennetta said.\n\n\"And she say, 'che? Che? Huh?' I say, 'Yes.' She said 'No way. It's perfect. Go. Go'.\"\n\nPennnetta added: \"It's amazing to have the chance to play with one of your friends. Before the match we said. 'It doesn't matter. We're going to win'.\n\n\"It's going to be a big win for both of us. It's something amazing, I didn't think to be here. She didn't think neither to be here so it's amazing for our country. It's amazing for everyone.\"\n\nPennetta's run to the final was certainly a surprise but the greatest upset belonged to Vinci, after the unseeded world number 43 beat Serena Williams in the semi-finals to end the American's hopes of winning a calendar grand slam.\n\n\"It's an incredible moment for all Italian people,\" Vinci said.\n\n\"When I come back at home, I can realise what we made, because now for me it is not normal, no.\n\n\"But I'm in New York, okay, I'm in the hotel, just having fun, but I would like to come back and try to understand what I did.\"\n\nCopyright PA Sport 2015, All Rights Reserved", "source": "Dewsbury Reporter"}