{"published": "2015-09-22T09:35:03Z", "media-type": "News", "title": "New land allotment rules soon", "id": "783b854b-5c2f-402e-b5c1-a36a0107ff37", "content": "RANCHI: Less than a month after launching policies to boost the state's food, feed processing and export sectors, the Raghubar Das government is putting in place a regulatory framework to ensure transparent land allotments in its three industrial areas.\n\nThe new set of regulations has been named the Industrial Area Land Allotment Regulations 2015. The centralized rule book will extend to the state's all three industrial area development authorities (in Ranchi, Bokaro and Adityapur in Jamshedpur) and will have defined spaces for specific sector-based units and one uniform rate for allotting lands. \"In the past, entrepreneurs have faced problems in acquiring plots within the industrial area. For them, the point of concern had been the lease rates,\" D P Vidyarthi, deputy director of the state industries department said. \"The re-leasing of plots (which are transferred to new units from sick or closed ones) have been the most problematic, with each industrial area authority mandating earnest money deposit (based on the floor price of a specific plot) at its will,\" he added. In addition to specific earnest money deposit (EMD), the new regulation will also mandate uniform processing fee for specific size of plots.\n\nApart from the EMD, the rate of hike in re-allotment of plots has remained the biggest concern for entrepreneurs. \"There is no definitive hike rate and it changes from time to time. This has caused lot of discrepancies in allotments,\" a Ranchi-based entrepreneur and member of Jharkhand Small Industries Association (JSIA), said.\n\nOfficials of the industry department said the final draft of the regulation has been pushed to the law department for approval and is scheduled to be tabled before the state cabinet in the first week of October. The cabinet had last week sent back the draft citing some technical shortcomings. The new regulation comes right after the department rolled out the industrial park policy to strengthen the state's industry .", "source": "Times of India"}