{"published": "2015-09-01T15:03:17Z", "media-type": "News", "title": "Nicola Sturgeon announces national testing for primary schools", "id": "e41baac2-c92f-4388-9b67-cfc7bae345cc", "content": "National testing is to be introduced in Scotland's primary schools in a bid to improve educational achievement, First Minister Nicola Sturgeon has announced.\n\nThe SNP leader said that ensuring youngsters do better in classes is \"arguably the single most important objective\" in her legislative programme for the coming year.\n\nShe announced to MSPs at Holyrood that new national, standardised assessments would be brought in for pupils in primaries one, four and seven, as well as for youngsters in the third year of secondary school.\n\nMs Sturgeon said: \"I have no desire to see crude league tables that distort rather than enhance our understanding of children's attainment and school performance.\n\n\"However, I am determined that we make available much more information about performance in primary and lower secondary school.\"\n\nAs well as announcing eight Bills are to be brought forward in the coming year, the SNP leader set out how she plans to use new tax and welfare powers that are being handed to Scotland in the wake of the independence referendum. \n\nBut she said the \" limited welfare powers\" in Westminster's Scotland Bill \"fall far short of what we would need to fully mitigate the harm caused by UK Government policies\". \n\nIf the SNP are still in power after next May's Holyrood elections, Ms Sturgeon said a Social Security Bill would be introduced in the first year of the new parliament to pave the way for a new Scottish social security system. \n\nThis will \"make provision for the earliest possible abolition of the bedroom tax\", the First Minister said. \n\nMeanwhile, the Scottish Government will invest £100 million this year in a bid to lessen the impact of the UK Government's welfare reforms, with the SNP leader pledging: \"We will continue to stand against a UK Government that imposes austerity on the vulnerable while preparing to spend billions renewing Trident.\" \n\nIt is hoped that the Scotland Bill, which also gives MSPs new tax powers, will be backed by the Scottish Parliament by March next year, Ms Sturgeon said. \n\nWhile the First Minister argued the package of devolution reforms was \" not as ambitious as we would like\", she added it would provide \"some additional powers to benefit individuals, businesses and local communities\". \n\nShe warned Westminster that MSPs would only back the Scotland Bill if the accompanying deal on Scotland's funding is \"fair\". \n\nMs Sturgeon said: \" We hope that Parliament will be able to consent to the Bill by March 2016. But let me make clear that we will only recommend consent if the accompanying fiscal framework is also fair to Scotland.\" \n\nThe SNP leader set out her programme for government just less than a year after Scots rejected independence in the referendum, opting instead to remain part of the UK. \n\nShe spoke about how she wanted to \" harness the passion and energy shown in the referendum, and use it to tackle the social and economic issues of our times\". \n\nMs Sturgeon said: \"The referendum debate also revealed a deep yearning for a fairer society, as well as a more prosperous economy. \n\n\"This ambitious and reforming programme for government speaks to those aspirations. It sets out how this government will work - now and in the long term - to achieve our vision for Scotland's future.\n\n\"It demonstrates how enduring values - a belief in enterprise, a faith in the value of education, a commitment to fairness and solidarity, and a passion for democratic engagement - can be applied to make Scotland a fairer and more prosperous country.\"\n\nWith Holyrood also due to get new powers over taxation, Ms Sturgeon confirmed Air Passenger Duty will be cut by 50% by the end of the next parliament, if the SNP wins next year's Holyrood elections.\n\nMinisters are consulting with business leaders and others on further tax powers, with the First Minister saying her Government would set out its intentions in the forthcoming Budget Bill.\n\nShe also said changes would be made to make Police Scotland more accountable.\n\nThe national police force has been hit by a number of controversies, with independent investigations under way in to the death in custody of Fife man Sheku Bayoh along with officers' failure to respond to reports of a fatal crash on the M9 in Stirlingshire. \n\nMs Sturgeon said there would be a review of police governance at national level, along with measures to improve the accountability and scrutiny of policing at a local level. \n\n\"For example, there will be a new requirement on the Chief Constable to attend local public scrutiny sessions,\" she said. \n\n\"A local scrutiny Summit to be held this month will identify further ways to enhance local accountability. And local scrutiny committees, together with members of the public and the parliament, will also have an important role to play in updating our national policing priorities.\" \n\nAny recommendations result from the review of police call handling will be implemented, Ms Sturgeon said, adding that a statutory code of practice on stop and search will also be introduced. \n\nOn housing Ms Sturgeon announced there would be an additional £195 million for the Help To Buy scheme, which assists those buying new build properties, over the next three years.\n\nTo help the rental sector, the Scottish Government will bring in a Private Tenancies Bill, which will include provisions for rent controls to be brought in in certain areas.\n\nNew systems of GP care will be trialled in at least 10 sites across Scotland over the next year, with the First Minister stating: \" We will support GPs to work in clusters and develop new ways of working with district nurses, health visitors, community rehabilitation teams and health improvement services, and using different services such as intermediate care beds.\" \n\nShe pledged £100 million of spending to improve mental health services, particularly for children and young people, and said work to integrate health and social care services should be complete by next April. \n\nThe First Minister said new legislation would be brought in to strengthen the law on domestic abuse, with the proposed Abusive Behaviour and Sexual Harm Bill also creating a new offence to tackle the problem of people sharing private pictures of former partners in so-called \"revenge porn\" cases.", "source": "Falkirk Herald"}