{"published": "2015-09-30T21:00:00Z", "media-type": "News", "title": "$16.3m house sold, price is highest at auction this year", "id": "a594f760-15c5-416e-ab3d-1ca37fa89b18", "content": "A house in Tanjong Katong was sold at auction yesterday for $16.3 million - the highest price fetched at auction this year. It was an estate sale. The single-storey bungalow at 25 Branksome Road went to a Singaporean buyer.\n\nIt sits on freehold land of about 13,844 sq ft, which works out to a pricing of about $1,177 per sq ft - below the median price of detached houses in District 15, which was about $1,246 per sq ft of land area in the second quarter.\n\nThe plot is zoned for residential use within a two-storey semi-detached landed housing area. Indicative pricing for the property was $15 million to $17 million. Prior to yesterday's sale, the most expensive property sold at auction this year was thought to be an owner's sale of a row of five shophouses at Teck Chye Terrace in Upper Serangoon for $14.63 million.\n\nAnother property sold at auction yesterday by Colliers International was a 2,454 sq ft single level penthouse with roof terrace at Rio Vista in Upper Serangoon View. The mortgagee sale property went for $1.72 million.\n\nLanded properties featured prominently at the auctions. \"We saw quite a bit of interest for these, mainly from end users... as there has been some adjustment to landed property prices since the cooling measures and people see value,\" said Colliers International deputy managing director Grace Ng.\n\nAlso up for auction in an estate sale was a two-storey semi-detached house at 7 Lengkok Merak, near Grange Road. A top bid of $8.3 million was made for the property, which sits on a 4,630 sq ft freehold site. Negotiations are underway.\n\nA mortgagee sale property at 21 Toh Avenue was on offer as well. Negotiations are taking place for the three-storey semi-detached house on a 3,050 sq ft freehold site, which drew a $2.5 million top bid.\n\nColliers is handling another estate sale of a good class bungalow at 2 Queen Astrid Park by tender. The owner is asking $49 million to $51 million for the 35,011 sq ft freehold site, occupied by a single-storey detached house. The tender closes on Nov 12.", "source": "Straits Times"}