{"published": "2015-09-25T15:44:09Z", "media-type": "News", "title": "Sprint could be 'formidable' after merger", "id": "5ece05bf-b6a4-475d-973d-55c590d2e353", "content": "The logo of U.S. mobile network operator Sprint Corp is seen at a Sprint store in San Marcos, California August 3, 2015.  Reuters/Mike Blake    \nSprint Corp ( S.N ) could be stronger if merged with a cable company, the U.S wireless company's chief executive said on Thursday, adding that he was not engaged in any such merger talks. \n\nSprint CEO Marcelo Claure made the comments to Reuters when asked about brisk acquisition activity in the cable and telecommunications sector and the recent entry of Europe's Altice NV ( ATCA.AS ), founded by French-Israeli billionaire Patrick Drahi, that has agreed to buy U.S. cable companies Cablevision Systems Corp ( CVC.N )  and Suddenlink Communications. \n\nCombining Sprint with a cable company would make “us a stronger and more formidable competitor,\" Claure said in an interview. \"But there’s absolutely no discussion.” \n\nDrahi, speaking last week at a conference in New York, said that he could buy a U.S. wireless carrier \"someday.\" Altice executives have said they hope to offer U.S. subscribers a \"quadruple play\" of Internet, television, and fixed and mobile telecoms. \n \nClaure said he had read about the comments. \n\n\"It seems like everybody now wants to get into wireless which puts Sprint in a very good position. So I think the next few months or years are going to be very active in this industry.\" Claure said. \"I think it’s going to be exciting times ahead in terms of consolidation but we don’t have any conversations with anybody.” \n \nSprint burned $2.2 billion in cash in the second quarter ended June 30. It is locked in an aggressive price war with its rivals Verizon Communications Inc( VZ.N ) , AT&T Inc ( T.N ) and T-Mobile US Inc ( TMUS.N )  which are going after each others' subscribers with promotions that have weighed on growth. \n\nIn August, Japan's SoftBank Group Corp( 9984.T ), the majority owner of Sprint, raised its stake in the wireless company to 82 percent from about 80 percent through a share purchase, boosting the market value of the struggling U.S. wireless carrier. It is also setting up two financing vehicles to help Sprint reverse its fortunes. \n \nThe company has been under pressure to cut costs because of investor concerns it was spending too much to acquire and retain customers and build out its wireless network. \n\nShares in Sprint were little changed at $4.39 on the New York Stock Exchange on Thursday afternoon. \n\n\n(Reporting by Malathi Nayak; Editing by Andrew Hay)", "source": "Reuters"}