{"published": "2015-09-18T11:22:26Z", "media-type": "News", "title": "N.J. police chief should clarify 'vigilante' remark | Editorial", "id": "d62ae5bc-0ac2-465d-a7b0-2cf62fc76f7f", "content": "Chief Robert Zimmerman Pitman has never been a town known for passive policing. With a police station right on Broadway in the center of a compact downtown, the borough has a reputation for being someplace you don't want to be if you can't give a good account of why you're on the street. \n \nThis reputation makes it all the more mysterious as to why Police Chief Robert Zimmerman would issue a self-described Facebook \"rant\" stating that he has \"no tolerance for those that attempt to take matters into their own hands , and cross the line into vigilantism.\" The chief also rails against \"those who use a platform that disrupts or ruins our on-going investigations, and inhibits our ability to police the community effectively.\" \n \nIn a telephone interview with the Times about the post, Zimmerman wouldn't elaborate beyond stating there \"are just some concerns\" recently that led him to spout off. He owes borough residents a more thorough explanation. \n \nWithout one, Zimmerman's remarks are likely to be misunderstood by  community groups that wish to play a greater role in keeping the borough safe. If he's addressing a specific blown case, or an activist or political candidate who has criticized the force, he should say so. If there's an ongoing problem with vigilantes who beat up others because they can't wait for the cops to handle suspicious incidents – that's even more reason for transparency. When would-be \"do-gooders\" commit crimes themselves, they need to be denounced unequivocally – and arrested. \n \nZimmerman's frustration does seem to have something to do with drug use and dealing in the borough, a widespread problem in the midst of the current heroin epidemic. The chief felt compelled to highlight statistics citing 231 drug arrests among 905 total arrests his department made in 2012 through 2014, but such out-of-context numbers don't indicate how effectively police are dealing with related offenses. \n \nIs Pitman's force too small to get the job done in the current climate? Does the borough need help in getting addicts connected to treatment or alternative court programs? Zimmerman should not be too proud or defensive to ask for outside assistance, if required. \n \nA first step ought to be for the chief to set up a general meeting where he and any potential vigilantes, as well as more level-headed concerned residents, can discuss any issues in a no-holds-barred way. As a Mantua Township councilman and head of the Gloucester County Police Chiefs Association, he's capable of handling such a forum. By telling the Times that he just felt he had to issue a general warning about vigilanteism, and that no cases \"per se\" prompted his concerns, Zimmerman has fostered possibly unnecessary fear and uncertainty that must be addressed. \n \nSend a letter to the editor of South Jersey Times at sjletters@njadvancemedia.com", "source": "Somerset Reporter"}