{"published": "2015-09-28T19:03:00Z", "media-type": "News", "title": "MxHeros Mail2Cloud Leverages Box Cloud Storage For Greater Email Security & Compliance", "id": "6271f4ad-69a8-408a-b242-6c9e99acdb71", "content": "mxHero transparently embeds the security & compliance capabilities of the best enterprise cloud storage technologies into email\n\nSan Francisco, CA (PRWEB) September 28, 2015 \n\nLeading email to cloud storage integration technology company, mxHero, integrates cloud storage security features into its flagship Mail2Cloud product suite. The new features allow organizations to centralize email data while automatically and seamlessly setting the appropriate security on files sent or received through email. The security is applied regardless of user device or email program, requiring no end user training or changes to workflow. By offering organizations an always-on yet near transparent solution, mxHero’s Mail2Cloud ensures greater security and compliance without inconvenience to end users. \n\nThe new Mail2Cloud cloud security integration works by automatically replacing emails with Box cloud storage links. The security level of the inserted links is centrally determined in accordance to the origin and destination of the message. For example, all email attachments sent within the organization will be uploaded to Box and replaced with file share links restricted to internal access only. mxHero works in tandem with the company’s existing email server avoiding the logistical and cultural barriers associated with deploying end user software and behavioral change. \n\nMail2Cloud’s new features help organizations better meet their regulatory compliance. By automatically applying Box security to attachments, organizations that are required to observe specific rules around delivery of certain types of information through email, such as healthcare providers, financial services and educational institutions, are more assured that compliance is being fulfilled. Mail2Cloud ensures that all attachments sent by doctors, for example, to patients are automatically delivered with HIPAA compliance. Significantly, end users need not remember to send attachments securely or resort to secure delivery portals. Mail2Cloud works in the background assuring the appropriate security is applied to all attachments before delivery. \n\n“mxHero’s unique approach to email security is to get content that is otherwise unprotected in email, out of email but without breaking email as the communication medium. The only other way to send content safely through email is to use email encryption - which after decades has failed to take hold because it requires too much engineering on both sides of the line,” explains Alex Panagides, CEO, mxHero Inc.\n\nmxHero’s Mail2Cloud suite is available through the company’s service portal, http://dashboard.mail2cloud.io. \n\nAbout mxHero \n\nmxHero is a company dedicated to enhancing email for businesses and end users. mxHero’s products and services gives companies, service providers and end users powerful new ways to control, use and analyze email. Apps developed for mxHero’s platform work with any email management program, including Gmail and Microsoft Exchange. Information on all of their Mail2Cloud product line can be found at http://www.mail2cloud.io. More than 3,500 companies with 800,000 users have added mxHero to their email. To learn more about mxHero visit http://www.mxhero.com. Find mxHero on Twitter: @mxheronet and Facebook: mxHero.net\n\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb12981918.htm", "source": "KYTX CBS 19"}