{"published": "2015-09-24T23:37:00Z", "media-type": "News", "title": "NHS chief aims to protect small regional hospitals with specialist care", "id": "7611ab9f-64fe-4369-9af9-87becee40c99", "content": "Patients will benefit from \"world-class care\" closer to home under new plans from the head of the NHS. \n \nNHS England chief executive Simon Stevens wants to protect the future of small regional hospitals and bring expertise in areas such as eye care and cancer to patients' doorsteps. \n \nIn a speech to the  Confederation of British Industry (CBI) in London, Mr Stevens will set out how partnerships between leading NHS hospitals and smaller ones will drive up the quality of services. \n \nThe new links involve some of the best hospitals in the country, including the Royal Marsden cancer hospital in London, the Christie cancer hospital in Manchester and Moorfields Eye Hospital in London. \n \nHospitals that are excellent performers will form groups to raise standards, and will set up clinics and other services in local district general hospitals. \n \nFor example, Moorfields Eye Hospital NHS Foundation Trust already runs 22 \"mini-centres\" in and around London alongside its main site. \n \nIt will now produce a toolkit so other specialties - such as cancer - can replicate its model. \n \nMr Stevens said: \"Rather than patients routinely having to travel to specialist centres, we want to test the idea of bringing that expertise to their local hospital. \n \n\"So key departments in smaller local hospitals are in some cases now going to be run by some of the best hospitals in Britain, such as Moorfields, the Royal Marsden or the Christie. \n   \n Share article  \n   \n\"This could help support a viable future for many smaller hospitals that are often so important to local communities, and improve the quality and range of services available, reducing the need to travel long distances. \n \n\"Specialist centres will continue to play a critical role, but we can also bring more world-class care to the patient's doorstep.\"", "source": "York Press"}