{"published": "2015-09-08T18:33:00Z", "media-type": "News", "title": "Artist Elisa Browsh brings her line of Elyria Jewels to Karats of Vail", "id": "beaaca9b-5503-4762-9264-e9c293e6906b", "content": "VAIL — By the time Elisa Browsh was a teenager, her beaded necklaces and earrings were so professional looking that her friend’s mother sold them in her clothing boutique. As Browsh began traveling the world seeking unusual gemstones, her talent only gained greater proportions — her designs taking on eclectic styles reminiscent of the cultures from whence the stones originated — and Elyria Jewels was born. \n\nBrowsh now has an extensive portfolio and is a fixture at elite galleries and jewelry emporiums throughout California, New Mexico, Hawaii and Colorado, including the Denver Art Museum and Karats of Vail. The latter will host Browsh and her jewels Saturday through Monday. \n\nColorado ties \n\nWhen the Cincinnati, Ohio, native moved to Colorado to attend the University of Colorado Boulder, she would pop into boutiques around town to pitch her line. Studying anthropology, she did a semester abroad and fell in love with Tibetan turquoise. After college, she began importing it. \n\nA few years later, she landed an opportunity to attend a pearl auction in French Polynesia. Like the turquoise, the Tahitian pearls put Browsh under their spell, and she gained traction as an importer of rare specimens. After more travels and a 10-year-plus stint in San Francisco, Browsh found her way back to Boulder. \n\n“My tastes grew up a lot,” she said. “I’ve always loved primitive art. I like raw stones. At this point, I’ve merged it with a more contemporary, urban approach to my designs.” \n\n“Industrial chic” is one way to describe Browsh’s elegant, blackened chains containing open circles, solid squares and various geometric configurations holding a collection of gems or a token jewel. The earrings have a similar delicate but straightforward appeal, many pieces composed of a single small gem or pair of pearls configured in a short, linear display. \n\nElyria rings range from chunky stacks of tightly packed bands with a solitary small pearl (Night Market Pearl Ring) to stacks of blackened bands with a stylishly mismatched assortment of diamonds (Rumi Stacking Rings) or wispy, feminine-looking single bands containing a beautiful jewel (her Wyndham Street or Queen’s rings, for example). \n\nElyria Jewels are separated into three collections: the Djuna line, the lower-priced pieces crafted primarily from sterling silver; the Rumi collection, which contains the larger gemstones (raw crystals, diamonds, etc.) and set primarily in white gold; and the Cat Street collection, which Browsh described as “the crazy, eccentric, one-off, nonproduction pieces.” \n\n“I love it when someone loves the unusual stuff,” Browsh said. “It makes me feel I can go do it again … tap into that sheer creativity. It’s fun because no one has the same stones.” \n\nMade with imagination \n\nLike many painters and abstract artists, Browsh designs each piece under the guidance of her unharnessed imagination. It’s only later that she names them or analyzes their style or possible symbolic meaning. \n\nTake her Blackfoot Necklace, for example. It’s a heavy silver chain containing a silvery, baroque South Sea pearl that clearly looks like a cow skull, a short string of rough black diamonds and a beautifully misshapen abalone pearl that resembles a feather. \n\n“It reminds me of a Plains Indian. They hang feathers from the bottom of a cow skull, but I made no conscious attempt to do that,” she said of the piece. “Familiarity with a lot of that stuff comes from my anthropology background and knowledge of Native American adornment.” \n\nMost of Browsh’s pieces are thematic, but the theme is driven purely by the style that happens to strike her aesthetic fancy at the moment. \n\n“I find when I try to do something with an agenda, it might not work aesthetically,” she said. “I have my own sense of proportions and shapes. It’s all super intuitive. The conscious part is synthesizing the shapes.” \n\nOne particular piece that Browsh said is “pushing the limits” of her aesthetic muse is the Moonstone Bib Necklace, a modified version of which she will debut at this weekend’s gallery show at Karats of Vail. \n\nThe piece is almost Cleopatra-esque, containing a carefully arranged collection of colorful moonstones and diamonds. The sets fade from blackened silver to yellow gold, giving the piece the look of watery transformation. Browsh said the result is a synthesis of her many styles, blending the industrial look with the regal, bejeweled approach. \n\nFinding a harmonious arrangement of stones is a process she described as truly cathartic. \n\n“I’ll sit for hours in front of this arrangement of stones, put on music, work with proportions. I love it,” she said. “Every stone I have is highly unusual. I cherry pick them all. Normal pearls and stones just don’t interest me.” \n\nShauna Farnell was hired to write this article on behalf of Karats of Vail. Send comments to kdriscoll@vaildaily.com.", "source": "Vail Daily"}