{"published": "2015-09-04T12:26:00Z", "media-type": "News", "title": "Sarama Provides Update on Final Results from Q2, 2015 Karankasso JV Drilling Campaign in Burkina Faso", "id": "8cc39abf-518e-467d-8bd8-508519ed51cc", "content": "VANCOUVER , Sept. 4, 2015 /PRNewswire/ - Sarama Resources Ltd. (\" Sarama \" or the \" Company \") is pleased to advise that Savary Gold Corp. (\" Savary \"), the operator of the Karankasso Project Joint Venture (\" JV \") between Sarama and Savary, provided an update on September 3, 2015 of the final drill results from the Q2, 2015 drilling campaign. The drilling was undertaken across five target zones within the 47km-long mineralised corridor situated in the Karankasso Project area. Highlights from Savary's release are presented below. \n\nHighlights \n   42 reverse-circulation (\" RC \") holes totaling 3,240m were drilled across five zones within 35km of trend. Four zones returned significant results including*: RC hole 15-29   10m @ 1.33g/t gold    from 104m   Kueredougou North Zone RC hole 15-33     4m @ 2.72g/t gold    from 70m     Koure East Sulphide Zone RC hole 15-55     7m @ 2.00g/t gold    from 44m     Sérakoro 1 West Zone RC hole 15-88   13m @ 2.09g/t gold    from 100m   Kueredougou West Zone RC hole 15-89     5m @ 1.88g/t gold    from 37m     Kueredougou West/Untested Zone RC hole 15-90     8m @ 1.23g/t gold    from 61m     Kueredougou West/Untested Zone \n*         True widths are estimated at 70% to 100% of drilled length Savary stated encouraging results were returned along a 2,000m trend at the Kueredougou West and Kueredougou Untested area. Further details of the interpretation of these drill results is contained in Savary's news release dated September 3, 2015 . \n\nDuring the period April 21, 2015 to June 30, 2015 , Savary completed 14,515 metres of drilling in 115 RC holes across the Karankasso Project (Figure 1). Savary have now released all drill results from this program. \n\nSarama's President and CEO, Andrew Dinning commented: \n\n\" We are pleased with the results of the second quarter drill campaign which has identified and extended a number of areas of mineralisation and continues to   support our belief that the s outh ern Houndé Gold Belt is a great place to be and we look forward to continuing to work collaboratively with Savary. \" \n\nSavary's September 3, 2015 news release contains a complete list of results and further information on Savary's drill campaign on the Karankasso Project. \n\nFor further information on the Company's activities, please contact: \n\nAndrew Dinning or Paul Schmiede  \ne: info@saramaresources.com | t: +61 (0) 8 9363 7600 \n\nNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. \n\nFigure 1 – Karankasso Project  - 2015 Drill Locations \n\nAbout Sarama Resources Ltd \n\nSarama Resources Ltd ( TSX-V: SWA ) is a West African focused gold explorer with substantial landholdings in Burkina Faso , Liberia and Mali . \n\nSarama's flagship properties are situated within the Company's South Houndé Project area in south-west Burkina Faso . Located within the prolific Houndé greenstone belt, Sarama's exploration programs have built on significant early success to deliver a maiden Inferred Mineral Resource estimate of 1.5 Moz gold 1,2 .  Outside of Burkina Faso , Sarama is focused on consolidating a number of under-explored landholdings in other emerging and established mining jurisdictions. \n\nIncorporated in 2010, the Company's Board and management team have a proven track record in Africa and a strong history in the discovery and development of large-scale gold deposits.  Sarama is well positioned to build on its current success with a strong financial position and a sound exploration strategy across its property portfolio. \n29.13 Mt @ 1.6 g/t Au (at a 0.8 g/t Au cut-off)  The effective date of the Company's Mineral Resource estimate is September 16, 2013 . For further information regarding the Mineral Resource estimate please refer to the technical report titled \"NI 43-101 Independent Technical Report, South Houndé Project, Bougouriba and Ioba Provinces, Burkina Faso \", dated October 28, 2013 . The technical report is available under the Company's profile on SEDAR at www.sedar.com . \n\nCaution Regarding Forward Looking Statements \n\nInformation in this news release that is not a statement of historical fact constitutes forward-looking information.  Such forward-looking information includes statements regarding the entering into of the joint venture agreement with Savary, the operation of the joint venture by Savary on property which includes Sérakoro 1 and Houndé South and future follow-up exploration on number of gold bearing intercepts on the land to be covered by the joint venture.  Actual results, performance or achievements of the Company may vary from the results suggested by such forward-looking statements due to known and unknown risks, uncertainties and other factors. Such factors include, among others, that completion of the joint venture agreement depends on, among other things, the satisfaction of conditions precedent that are usual in a transaction of this nature, including the receipt of regulatory approvals, that the business of exploration for gold and other precious minerals involves a high degree of risk and is highly speculative in nature; Mineral Resources are not Mineral Reserves, they do not have demonstrated economic viability, and there is no certainty that they can be upgraded to Mineral Reserves through continued exploration; few properties that are explored are ultimately developed into producing mines; geological factors; the actual results of current and future exploration; changes in project parameters as plans continue to be evaluated, as well as those factors disclosed in the Company's publicly filed documents. \n\nThere can be no assurance that any mineralisation that is discovered will be proven to be economic, or that future required regulatory licensing or approvals will be obtained. However, the Company believes that the assumptions and expectations reflected in the forward-looking information are reasonable. Assumptions have been made regarding, among other things, the Company's ability to carry on its exploration activities, the sufficiency of funding, the timely receipt of required approvals, the price of gold and other precious metals, that the Company will not be affected by adverse political events, the ability of the Company to operate in a safe, efficient and effective manner and the ability of the Company to obtain further financing as and when required and on reasonable terms. Readers should not place undue reliance on forward-looking information. \n\nSarama does not undertake to update any forward-looking information, except as required by applicable laws. \n\nQualified Person's Statement \n\nScientific or technical information in this news release that relates to the preparation of the Company's mineral resource estimate is based on information compiled or approved by Adrian Shepherd .  Adrian Shepherd is an employee of Cube Consulting Pty Ltd and is considered to be independent of Sarama Resources Ltd.  Adrian Shepherd is a chartered professional member in good standing of the Australasian Institute of Mining and Metallurgy and has sufficient experience which is relevant to the commodity, style of mineralisation under consideration and activity which he is undertaking to qualify as a Qualified Person under National Instrument 43-101.  Adrian Shepherd consents to the inclusion in this news release of the information, in the form and context in which it appears. \n\nSOURCE  Sarama Resources Limited", "source": "Market Pulse Navigator"}