{"published": "2015-09-20T07:18:27Z", "media-type": "News", "title": "Advantage Argentina in Davis Cup", "id": "60e70ba3-2e62-4fee-872d-91eb657586c7", "content": "Pope arrives in Havana to start historic trip after aiding Cuba-U.S. reconciliation  \nthestar.com - Sunday 20th September, 2015 \n \nHAVANA—Pope Francis urged the Cuban and U.S. governments to push ahead on their newly forged path toward normal relations, saying they should “develop all its possibilities” as he  ... \n   Man killed at Palm Cay  \nNassau Guardian - Sunday 20th September, 2015 \n \nMortuary services personnel remove the body of a man shot to death in the Palm Cay gated community off Yamacraw Hill Road yesterday. Ahvia J. Campbell  ... \n   Gomez predicts Baha Mar will have tough time filling rooms  \nNassau Guardian - Sunday 20th September, 2015 \n \nEven if Baha Mar overcomes its current difficulties, retired Archbishop Drexel Gomez said the developer of the Cable Beach property would have a difficult time filling its rooms. \"We  ... \n   Roberts Christie knows how to win  \nNassau Guardian - Sunday 20th September, 2015 \n \nProgressive Liberal Party (PLP) Chairman Bradley Roberts said yesterday that Prime Minister Perry Christie is a strong leader who knows how to win. Roberts was responding to  ... \n   Forensic analyst in U.S. to testify in Vasyli trial  \nNassau Guardian - Sunday 20th September, 2015 \n \nThe Donna Vasyli murder trial was cut short yesterday due to the unavailability of a key witness. A forensics analyst in the United States was scheduled to testify via video link. However,  ... \n   ‘Country needs change in way it is governed’  \nNassau Guardian - Sunday 20th September, 2015 \n \nRetired Anglican Archbishop Drexel Gomez said the country \"desperately needs a change\" in the way it is governed. Gomez, who was a panelist at the National Art Gallery's  ... \n   Andrew Knowles to open first solo show at Doongalik Gallery  \nNassau Guardian - Sunday 20th September, 2015 \n \nDoongalik Studios will open the first solo show of artist, Andrew Knowles, entitled \"Bahasquiat\" on Tuesday, September 22 from 6-9 pm. Born in Nassau on September 12, 1996, the teenaged  ... \n   Becoming a part of Sacred Spaces - Sacred Places  \nNassau Guardian - Sunday 20th September, 2015 \n \nBahamian-American, Alexis Caputo was awarded an international grant for a residency, from the National Performance Network and the arts and cultural institution, Miami-Dade County Department of  ... \n   Pope calls on Cuba and US to set global example of reconciliation  \nThe Guardian - Sunday 20th September, 2015 \n \nPope Francis is welcomed by Cuban president Ra?l Castro and Cuban children upon landing at Havana's international airport. Photograph: Yamil Lage/AFP/  ... \n   Pope Francis arrives for Cuba visit before US tour – as it happened  \nThe Guardian - Sunday 20th September, 2015 \n \nPope Francis is welcomed by Cuban president Ra?l Castro upon landing at Havana's international airport. Photograph: Filippo Monteforte/AFP/  ... \n   Pope urges U.S. and Cuba to push detente further  \nGlobe and Mail - Sunday 20th September, 2015 \n \nPope Francis walks with Cuba's President Raul Castro (R) as he arrives at Jose Marti International Airport on September 19, 2015 in Havana, Cuba. Pope Francis is at the beginning of a three day  ... \n   President Raul Castro Meets with Argentinean Peer Cristina Fernandez  \nPrensa Latina - Sunday 20th September, 2015 \n \nHavana, Sep 19 (Prensa Latina) Raul Castro, president of Cuba, received today his peer from Argentina, Cristina Fernandez, who is in official visit to this Caribbean island. During the friendly  ... \n   Venezuelan President Praises PopeÂ´s Visit to Cuba  \nPrensa Latina - Sunday 20th September, 2015 \n \nCaracas, Sep 19 (Prensa Latina) President of Venezuela, Nicolás Maduro, welcomed today the arrival of Pope Francis to Cuba as part of a visit that will last until September 22. From his  ... \n   Celac Ministers of Culture Approve in Cuba Cultural Plan of Action  \nPrensa Latina - Sunday 20th September, 2015 \n \nHavana, Sep 19 (Prensa Latina) Ministers of Culture of the Community of Latin American and Caribbean States (Celac) approved today in Cuba a cultural action plan focused on social development and in  ... \n   Argentinas President Honored for Invitation to Popes Mass in Cuba  \nPrensa Latina - Sunday 20th September, 2015 \n \nCristina Fernandez calls attend Mass honor of the Pope in Cuba Havana, Sep 19 (Prensa Latina) The president of Argentina, Cristina Fernandez, today described as an honor the invitation to attend an  ... \n   Pope Arrives In Havana For Start Of Cuba Visit  \nNPR - Sunday 20th September, 2015 \n \nPope Francis is escorted to a chair by Cuba's President Raul Castro during his arrival ceremony at the airport in Havana, Cuba, on Saturday.  ... \n   Hectic clinic day for many patients in the north  \nDaily Nation - Sunday 20th September, 2015 \n \nHealth is an issue that affects us all. For the past several years, Barbadians have been complaining about the length of time spent seeking medical attention at the island’s public health care  ... \n   Jump in UWI numbers  \nDaily Nation - Sunday 20th September, 2015 \n \n'Not all gloom'   And a jump in enrolment by about 1 000 students at the UWI’s Cave Hill campus is evidence to prove it. The turnaround in  ... \n   Call for child abuse squad  \nDaily Nation - Sunday 20th September, 2015 \n \nBE PREPARED: Know your shelters  In Barbados, there is no designated squad to investigate these vicious crimes. Former magistrate Faith Marshall-Harris  ... \n   Uninsured cars a ‘danger’  \nDaily Nation - Sunday 20th September, 2015 \n \nNo excuse   Though an accurate figure of accidents involving vehicles without insurance was not available, the General Insurance Association of Barbados (GIAB) suggests  ...", "source": "Caribbean News.Net"}