{"published": "2015-09-13T14:00:00Z", "media-type": "News", "title": "Media sector awaits ACCC's Ten-Foxtel decision", "id": "a7f2aee6-a396-492d-9147-5149329ab7a8", "content": "Sports rights will be one of many key issues for the competition watchdog when it hands down a ruling on whether it will approve Foxtel's proposal to take a 15 per cent stake in Network Ten Holdings for $77 million, or ask for further information on the deal on Monday. Sports rights will be one of the key issues for the competition watchdog when it hands down a ruling on whether it will approve Foxtel's proposal to take a 15 per cent stake in Network Ten Holdings for $77 million, or ask for further information on the deal on Monday. The outcome is highly anticipated in the sector, which is waiting to see whether the Murdoch family will be able to increase its hold over Australia's media industry through Foxtel, which is 50 per cent owned by News Corporation.\n\n\"We've given it quite a lot of thought and we'll be making that known on Monday,\" said Rod Sims, chairman of the Australian Competition and Consumer Commission.\n\n\"It will be a decision either to issue a statement of issues, or approve the transaction. I'm not going to give any hints at all.\"\n\nIf the ACCC releases a statement of issues it will provide the corporate watchdog's preliminary views, highlight issues which cause varying degrees of competition concern and identify what inquiries it would like to make.\n\nThe proposed transaction, if approved, will change the media landscape. Along with an additional $77 million capital raising and the takeover of Ten's advertising business by the Foxtel-Fox Sports joint venture Multi Channel Network, of which Ten would take a 24.99 per cent stake, it would allow the free-to-air network to fix its finances and invest further in programming.\n\nIt is understood that Ten and Foxtel have made a case to the Australian Competition and Consumer Commission that last month's massive sports broadcast rights deals for the National Rugby League and Australia Football League prove that any tie-up between the pay TV provider and the metropolitan network would not result in Ten gaining an advantage over its rivals.\n\nIn the AFL's $2.5 billion blockbuster deal Seven West Media took an average of 3.5 games per round over the year for six years, while Foxtel will broadcast all nine games as well as being able to sub-license a Saturday afternoon game.\n\nThe parties are also believed to have highlighted that they were both locked out of the NRL negotiations, which saw Nine Entertainment Co hold onto the free-to-air rights for $925 million.\n\nOpponents of the deal, including Fairfax Media, publisher of The Australian Financial Review and BusinessDay, have warned the ACCC that Foxtel and News Corp would have a strong incentive to only partner with Ten on joint bids for premium sports.\n\nA preliminary date for the decision had been set for last Thursday, but the watchdog delayed the decision \"to allow for additional time to consider the proposed acquisitions\".\n\nThe story first appeared on The Sydney Morning Herald.", "source": "Oberon Review"}