{"published": "2015-09-18T07:05:00Z", "media-type": "Blog", "title": "Classic Hollywood: Hitchcock's 'Psycho' on the big screen", "id": "b7874a62-5b0f-4c42-ac99-555746c061bf", "content": "Subscribe to the newsletter\nT\nhis is Susan King, a 25-year veteran entertainment reporter at the Los Angeles Times, and guardian of the Golden Age of Hollywood galaxy. Every Friday, I have the opportunity to share my passion and love for everything vintage in the Classic Hollywood newsletter. Sit back and enjoy what’s new in classic films and TV, on DVD and Blu-ray, fun events around town, movie and TV milestones, notable births and deaths.\nThis week, Fathom and Turner Classic Movies have teamed up for special theatrical engagements Sept. 20 and 23 of Alfred Hitchcock’s influential 1960 thriller “Psycho,” starring Anthony Perkins in his iconic turn as the ultimate mother’s boy, Norman Bates, and the Oscar-nominated Janet Leigh as the ill-fated Marion Crane. If you never have seen this shocker on the big screen, this is a wonderful opportunity to see a great print complete with an introduction by TCM host Ben Mankiewicz.\nComedy duo Bud Abbott, left, and Lou Costello. (MCA TVA)\nFive years ago, I chatted with the late Hilton A. Green, who was the film’s assistant director. According to Green, it wasn’t really the brutal shower stabbing that caused problems with censors; it was the sight of a toilet.\n“They wanted to cut the shot of the toilet where Janet Leigh tears up the note and flushes it down the toilet,” he said.  “You couldn’t show a toilet on screen. Can you imagine that?”\nHitch opted to shoot the film in black-and-white with a lower budget than that of his usual productions.\n“He was still shooting ‘North by Northwest’ when he started to prepare ‘Psycho,’” recalled Green, who became a producer. “North by Northwest\" was his “biggest-budget movie at that time, and he wanted to prove to Hollywood that he could make a quality low-budget movie, which was  the script of ‘Psycho.'”\nGreen noted that the Master of Suspense was actually an introvert.\n“Mr. Hitchcock had a TV crew and a feature crew,” Green said.  “He didn’t feel comfortable around new faces. That’s  why he always kept his same crew intact. When he went do to ‘Psycho,’ he felt with the budget and the schedule ‘Psycho’ had, his TV crew was the better choice to do it.”A welcome return\nI’m always wistful when I drive by the Fine Arts Theatre on Wilshire Boulevard in Beverly Hills. Though the Art Deco gem from 1937 is occasionally used for screenings, it has been basically closed for several years. I have such fond memories of going to films there when I first moved to California -- especially attending a lively matinee of the 1930s Errol Flynn classics “Captain Blood” and  “The Adventures of Robin Hood.” But good news!\nThe Laemmle chain, which operated the theater from 1985 to 1993, has welcomed the Fine Arts back into the fold. Laemmle has renamed it the Ahrya Fine Arts and is reopening it Friday with the documentary “Jeremy Scott: The People’s Designer.”Don’t touch that dial\nWho’s on TCM Friday night? None other than Bud Abbott and Lou Costello. TCM is screening several of the legendary team’s Universal comedy hits, including its 1941 blockbuster “Buck Privates,” which features the Andrew Sisters singing the Oscar-nominated “Boogie Woogie Bugle Boy”; 1941’s “Hold That Ghost” and “In the Navy”; 1942’s “Rio Rita”; and 1944’s “Lost in a Harem.”’\nActress Janet Leigh in the famous shower scene in Alfred Hitchcock's classic thriller \"Psycho.\" (AP)\nThough most of the comedy teams of that time, including the Marx Brothers, the Three Stooges and the Ritz Brothers, appealed to the male of the species, Abbott and Costello have always had a strong female following.\n“We have a lot of women in the fan club,” Lou’s daughter, Chris Costello, once told me.  “Of course, it’s because Dad’s so cute and naive, you just want to mother him. People were a little bit more prone to build empathy for Dad because he was always getting slapped around. He was sweet. He was like a little boy who didn’t grow up.”\nThough her father got most of the laughs in their films, Chris Costello praised Abbott as “the ultimate straight man. Unfortunately, he never received the accolades he should have. Bud Abbott was one of the most gentle human beings  on the face of the planet.”\nThe duo loved to pull pranks on their sets. “They would cellophane the toilets,” she said. “They had people around them from burlesque to keep the energy level up. Dad and Bud were two of the people who were initiators of the wrap party.”Around town\nThe American Cinematheque’s Aero Theatre is celebrating the 40th anniversary of Robert Altman’s masterpiece “Nashville” on Friday evening. Ronee Blakley, who earned a supporting actress Oscar nomination, and music supervisor Richard Baskin will be on hand to discuss the film. The evening will also pay tribute to the late Jerry Weintraub, who was an executive producer of the influential ensemble film that earned five Oscar nominations, winning best song for Keith Carradine’s “I’m Easy.”\nRonee Blakley and Henry Gibson star in Robert Altman's \"Nashville,\" which follows the lives of two dozen characters over a five-day period. (Paramount Pictures / LACMA)Sneak peek\nIn this Sunday’s Classic Hollywood, I look at the accomplishments of the renowned UCLA Film & Television Archive, which is celebrating its 50th anniversary this year, as well as some of the special fall programming commemorating the milestone. From the Hollywood Star Walk\nNotable birthdays this week include June Foray (Sept. 18); Greta Garbo (Sept. 18); Eddie Anderson (Sept. 18); Adam West (Sept. 19); Paul Williams (Sept. 19); Sophia Loren (Sept. 20); Larry Hagman (Sept. 21); Paul Muni (Sept. 22); Martha Scott (Sept. 22); Erich von Stroheim (Sept. 22); Ray Charles (Sept. 23); Walter Pidgeon (Sept. 23); and Mickey Rooney (Sept. 23).Pardon my sarong\nTuesday marks the 19th anniversary of the death of Dorothy Lamour, the former band singer who came to fame in Hollywood wearing sarongs in such films as 1937’s “The Hurricane” and is best known as the leading lady in the popular Bob Hope-Bing Crosby “Road” comedies. Here is the Los Angeles Times obituary as it ran in the paper on Sept. 23, 1996.\nSubscribe to the newsletter\nFor more vintage Hollywood, go to the Classic Hollywood Los Angeles Times Facebook page and follow me on Twitter at @mymackie. Copyright © 2015, Los Angeles Times cComments Got something to say? Start the conversation and be the first to comment. Add a comment 0", "source": "L.A. Times - Lakers Blog"}