{"published": "2015-09-12T06:08:33Z", "media-type": "Blog", "title": "Random Japan", "id": "7d4928a5-34fd-4d1c-894f-8e165fcf61aa", "content": "Japanese expat turns frustration with ordering from Amazon UK into a comicJamie Koide\n\nMoving to a different country can be fun and exciting, but it can also be tough. Most expats go through a period of culture shock where they realize that some of the stereotypes they were led to believe about a certain country may not be true, and that the way things work in their new home may not always be an improvement on the way things were done back in their old one.We’ve presented some things Japan doesn’t get right from a Westerner’s point of view in the past, but this time we’d like to show you a comic drawn by a Japanese illustrator living overseas, detailing some of the not-so-pleasant points of living in the UK and how some in particular made her quit shopping at Amazon.Mariko Umeda, a designer and illustrator, quit her job at a Japanese video game company to move to England and attend the National Film and Television School. When she’s not busy with classwork, she draws and uploads her own comics about living abroad as a Japanese expat.\nSTATS0: Number of people who have enrolled in a National Police Agency program that offers counseling and treatment to stalkers6: Number of Japanese citizens who visited a graveyard in suburban Pyongyang last month to pay respects to relatives who died in the area shortly after World War II390: Height, in meters, of a skyscraper planned by Mitsubishi Estate Co. near Tokyo Station. Upon completion, it will be the tallest building in Japan.YIKES!In a story that will terrify claustrophobes everywhere, a maintenance worker in Tokyo was fired for “intentionally stopping elevators and trapping people inside.”Authorities ordered several beaches near Tokyo closed after spotting a group of 30 sharks swimming in coastal waters, including 10 hammerheads.Japanese researchers have found that men exposed to secondhand smoke may be three times more likely to suffer from gum disease than men who breathe in smoke-free environments.For the first time in 11 years, officials at Ueno Zoo will try to impregnate a giant panda by artificial insemination.\nShould You Eat It\nOr Admire It\n\n\nIce Cream \nFor A Week And Only A Week\n\n\n\nOnly The Rich \nAre Welcome There\n\nOre no Yome - the cafe where maids pretend to be your spouse\nBy Fran Wrigley\n\nYou arrive home after a long day at the office to your beautiful wife, smiling as she greets you at the door. Inside, a delicious home-cooked meal is ready on the table…oh, and she’s wearing a bikini.There’s a new cafe in Tokyo where you can have all this and more, because the staff there are ready and waiting to be your bikini-and-apron-clad new wife (or husband).At Ore no Yome (literally “My Wife”) in Tokyo’s Higashi Ikebukuro neighborhood, they’ll always know your name. As long as you call and tell them beforehand, that is. It’s a concept cafe staffed by “wives” and “darling husbands” in swimsuits and aprons, whose mission is simple: to make you want to come “home” to them every night.“As soon as you know what time you’ll be home, let me know dear!” runs the ad. “I’ll get your dinner ready.”", "source": "Ignoring Asia"}