{"published": "2015-09-23T23:02:03Z", "media-type": "News", "title": "MTR staff follows, interrogates and threaten Baptist University student with hefty fine for carrying his cello on a train", "id": "114fce1e-f6fb-47b0-a798-1f044cb84b5f", "content": "A university student was threatened with a HK$2000 fine after being followed by plain-clothes MTR staff and interrogated for carrying a cello on the East Rail Line. \n \nHo Ka-yeung, a year four music student at Hong Kong Baptist University, said he was tailed yesterday evening by MTR staff who were not uniform when he boarded a train at Tai Wai station. When he arrived at the next station in Kowloon Tong, uniformed staff were waiting on the platform to catch him for carrying luggage they considered to be oversized. \n \n“They measured the cello case which they said exceeded the official length limit of 130cm by 4cm,” he said. “But then a woman came to my rescue and challenged them for double standards as there were other passengers with large carry-ons in the train.” \n \n“So they took me to a small room and brought in a senior officer who issued me a warning letter which stipulated that further violation would result in prosecution and a fine of up to HK$2,000.” \n \nThe student offered to pay extra fare for the cello, but the staff refused, informing him that MTR tickets were for passengers only, not luggage. \n \nAfter half an hour in the room, Ho was escorted to a station exit. When he asked them how he could get to Kowloon Bay for his rehearsal, the staff said it was his business as they were not obliged to offer him advice on alternative transportation. \n \nHo ended up taking the MTR again, risking a second warning, but he chose another entrance to the station and boarded the Kwun Tong Line without a problem. \n \nThis is the third such incident in a week on the MTR. Last week, a schoolgirl carrying a guzheng, or Chinese zither, was stopped at Tai Wai Station. A few days later, another student carrying his a cello in a case was refused entry at Hung Hom station. \n \nREAD MORE: MTR staff ‘turning a selective blind eye’ to bulky goods on trains, says Hong Kong anti-parallel trading group \n \nAll three incidents involved only students, not music professionals. There are 19 cellists among the city’s major orchestras, but so far they haven’t made similar complaints. \n \n“Hong Kong is not a cultural desert as some people say but when things like this happen one cannot but wonder where is culture in Hong Kong,” said Tung Hiu-lo, Ho’s cello teacher and the principal gehu, or Chinese cello, of the Hong Kong Chinese Orchestra. \n \n“All I can do to comfort my student is to wait and see if the principal cellist of the Hong Kong Philharmonic Orchestra will be stopped in the MTR for his cello case.” \n \nLaurent Perrin, assistant principal cellist of the Hong Kong Sinfonietta, said he had never had any problem with his cello on board the MTR since he came to Hong Kong 17 years ago. \n \n“This is something unheard of in any part of the world and I find it hard to believe,” the Frenchman said. “What would happen if all the cellists can’t make it to rehearsals and concerts because we are not allowed to carry our instruments on the MTR?” \n \nThe cellist suggested Ho report yesterday’s incident to his school so that professors could raise the issue with the authorities. \n \nAccording to Ho, there are about 30 cello students in Baptist University’s music department who travel every day to school with their instruments. \n \n“I have no idea how we are going to school and performances with our instruments in any way other than by the MTR,” he said. “I am not mad at the staff. I am mad at the regulations.”", "source": "South China Morning Post"}