{"published": "2015-09-13T04:00:00Z", "media-type": "News", "title": "Toledo Magazine: Toddler takeover", "id": "fe46a83c-837d-4c46-aded-189b3200a518", "content": "Thomas Gould, 4, plays with a provided toy at the Children’s Library, located in the Main Library in downtown Toledo. The library boasts a special room for toddlers and younger children to engage with toys, books, and interactive digital programs. The room, with kid-sized doors, is lined with tiled murals depicting the subjects of classic children’s stories. \nTHE BLADE/KATIE RAUSCH  \r Enlarge \r\n\t\t\t | \r \r\n\t\t\t\t\tBuy This Photo\r \r\n\t\t\t\r   Published: Sunday, 9/13/2015  - Updated: 5 minutes ago \r\n\r\n\r\n\r\n\r TOLEDO MAGAZINE \r\n\t\r\n\t\r\n\r\n\r \nBY KIRK BAIRD \nBLADE STAFF WRITER \n\r\n\r\n\r \nOn a recent Friday morning the bustle is like any daycare scene, as a pair of toddlers scamper across the room and through doorways, while others reach for books and play  with puzzles and computers on knee-high desks. \n \nBut this isn’t a daycare or preschool. It’s the Toddler Room at the Children’s Library at the Main Library, 325 Michigan St., perhaps the only place in the building where running and being loud is encouraged. \n \n“Play is one of the essential five early literacy skills,” along with talking, singing, reading, and writing, said Nancy Eames, coordinator of Youth Services for the Toledo-Lucas County Public Library. “And we’ve designed a space in our children’s area to encourage play.” \n \nPHOTO GALLERY: Click here to view \n \nThe children’s department, originally called the Boys and Girls Room, opened along with the rest of the library building in 1940. Children were not allowed into the rest of the library, so a separate staircase to the second floor was built by the front door.  \n  \r \r Reagan Gillard, 2, reads with the help of her great-great grandmother Rita Dodds. \nTHE BLADE/KATIE RAUSCH  \r Enlarge \r\n\t\t\t\t | \r \r\n\t\t\t\t\t\tBuy This Photo\r \r\n\t\t\t\t\r   \n“Our attitudes and space for children have changed radically in the last 75 years,” Ms. Eames said. And in August, 2001, the 14,000 square-foot Children’s Library and its Toddler Room (originally the story-hour room) were opened as part of a nearly 2½-year major renovation and expansion to the old part of the building. \n \nThe Children’s Library  has attracted 1.4 million visitors since.  \n \nFor families with little ones, such as Crystal Howald, the 31-year-old mother to 4-year-old Thomas Gould, the Toddler Room in particular is a frequent stop. \n \n“This is his favorite area of the library because of the computers he can use, the books, and the puppets,” Ms. Howald said. “It gives him something new to do versus playing with the same old toys and books at home.” \n \nAnne Beck, 43, brings her 4-year-old daughter  Audrey at least twice a month for the preschool programs the Children’s Library offers. \n \n“It’s an awesome program,” she said as she watched Audrey drift to various attractions in the room before settling on puzzle-type rings and later a red toy cash register. \n \n“[We] usually come into the Toddler Room, which gets changed out every two weeks, and explore. At this age, playing is learning.” \n  \r \r Zen Betz, 2, reaches up to touch the top of a child-sized walkway. \nTHE BLADE/KATIE RAUSCH  \r Enlarge \r\n\t\t\t\t | \r \r\n\t\t\t\t\t\tBuy This Photo\r \r\n\t\t\t\t\r   \nOf course, as part of the library, the Toddler Room features a large collection of age-appropriate books with  large, colorful pictures and early vocabulary words. \n \nRita Dodds, the 63-year-old great-grandmother to 2-year-old Reagan Gillard, said her great-granddaughter enjoys their book time best. On this Friday, Reagan picks out Quacky Ducky’s Easter Fun, the story of how a duck helps the Easter Bunny paint eggs. \n \n“She likes books,” Ms. Dodds said. “Her mother and her grandmother read to her every night.” \n \nThe pair have been coming to the Children’s Library for six months, and already Ms. Dodd said she can see a difference in Reagan. \n \n“She’s more playful with the kids and paying more attention to the teachers,” she said. “She’s just doing much better than she was doing and as time goes by and we keep coming here I think she’ll blossom.” \n \nContact Kirk Baird at kbaird@theblade.com or 419-724-6734.", "source": "Toledoblade.com"}