{"published": "2015-09-28T12:24:23Z", "media-type": "News", "title": "As insults fly, Iran-Saudi haj row aggravates regional rifts", "id": "7119df14-7d60-412d-ac19-62fde0d2c06c", "content": "For regional adversaries at loggerheads over the crises in Iraq, Syria and Yemen, the disaster at the haj is unlikely to be a game changer in the contest between Iran and Saudi Arabia, merely adding venom to their mutual acrimony. \n\nBut a deepening of already profound mistrust between the conservative Sunni kingdom and the revolutionary Shi'ite theocracy will make the task of stabilizing the Middle East's many trouble spots even harder to achieve than it already is. \n\nWhile the Gulf rivals have managed to put aside bad blood after past flare-ups, such moments of detente happened in a much more stable Middle East, years before turmoil in Iraq and Arab Spring uprisings unleashed sectarian hatreds across the region. \n\nToday, Iranian and Saudi participation would be crucial in stabilizing Iraq, Syria, Yemen or Lebanon, where the two sides back sectarian proxy forces that are either at daggers drawn or openly at war in conflicts killing thousands each month. \n\nRiyadh also accuses Tehran of fomenting trouble in Bahrain and even Saudi Arabia itself. Tehran accuses Riyadh of plotting its destruction with Washington. \n\nThe animosity worsened in the wake of the deadliest disaster to befall the annual haj pilgrimage in 25 years. \n\nIran says it lost at least 169 pilgrims when two large groups of pilgrims converged on Thursday at a crossroads in Mina, a few kilometres east of Mecca, on their way to perform the \"stoning of the devil\" ritual at Jamarat. \n\nIran demanded an apology. Demonstrators protested in Tehran, chanting \"Death to the Saudi dynasty\". Saudis commentators insinuated that Iranian pilgrims themselves were at fault. \n\nInvective poured onto social media. \n\n\"It's a lie that Satan's representative, Khamenei, mourns the Mina incident victims,\" Saudi prince Khaled Al Saud tweeted, referring to Iran's Supreme Leader Ayatollah Ali Khamenei. \n\n\"His dirty hands are stained with the blood of the children of Syria and the Sunnis of Iraq,\" the prince told his nearly quarter of a million followers. \n\nA cartoon published by Iran's Tasnim news agency showed King Salman of Saudi Arabia as a camel trampling pilgrims. \n\nEven before the haj tragedy, prominent figures in both countries exchanged critical tirades. In May, Khamenei denounced Saudi Arabia for its military campaign in Yemen by comparing the kingdom to the pagans who ruled the Arabian Peninsula before the advent of Islam in the seventh century. \n\nAt the United Nations, Iranian President Hassan Rouhani on Sunday lamented that Riyadh had rebuffed his repeated attempts at reconciliation since his election in 2013. \n\n\"We are disappointed about the cold relations between Iran and Saudi Arabia,\" he said. \"The rift between Tehran and Riyadh is not in the interest of either country.\" \n\n\"Also when Saudis started killing people in Yemen, Riyadh drifted even further away from Iran and many other Islamic countries,\" Rouhani told an audience of US think-tanks and journalists on the sidelines of the UN General Assembly. \n\nSaudi Foreign Minister Adel al-Jubeir, a longtime adviser to the kingdom's rulers, wearily accused Tehran of playing politics. \"We will reveal the facts when they emerge, and we will not hold anything back,\" he said. \n\nIranians are sceptical about that. But analysts across the region agree the depth of the crisis may be determined largely by the results of the Saudi probe and how much is published. \n\nFormer Iranian lawmaker Elias Hazrati told Reuters by phone from Tehran that Iran was not playing politics over the haj. \n\n\"Tehran is simply asking Riyadh to take responsibility,\" he said. \"If this incident happened only once we could call it an accident, but this is happening every few years. The Saudis' mismanagement is the problem of all the Islamic world, not Tehran.\" \n\nSaudi commentators point the finger at Tehran. \n\nJamal Khashoggi, head of a Saudi news channel owned by a prince, said investigators were looking at the actions of a large number of Iranian pilgrims who \"happened to be in the wrong place in the wrong time\". \n\n\"I think Saudi Arabia will speak very loudly on the issue when the result of the investigations come out. No statement has been made officially, but now it seems that the Iranians will be blamed because they took their hajjis in the wrong direction at the wrong time. That was very irresponsible,\" he said. \n\nThe rivals have overcome previous crises in their relations. \n\nA late 1990s rapprochement followed a 1996 truck-bombing in the kingdom that killed 19 US service personnel and clashes at the 1987 haj between Iranian protesters and Saudi police that led to the death of 400 people, mainly Iranians. \n\nSaudi Arabia and the United States accused Iran of orchestrating the 1996 attack. Iran denied any role. \n\nBut the rapprochement happened at a time of relative Gulf stability, above all when Iraq was ruled by a Sunni, Saddam Hussein, seen by Gulf Arab states as a buffer against Iran. Now a worsening of Iran-Saudi rivalry could have broad consequences. \n\nNot only are the two competitors openly tussling for influence in Arab countries, but Saudi Arabia is worried that Washington has realigned with Tehran at Arab expense by backing a deal settling Iran's long-standing nuclear dispute. \n\nAlive to what he sees as a US-Iran detente, Saudi Arabia's new monarch, King Salman, is pushing for Sunni Muslim Middle East countries to set aside differences over political Islam and focus on what it sees as the more urgent threat from Tehran. \n\nThe diplomatic heft that Riyadh employs in such efforts is rooted in its prestigious role as custodian of Islam's holiest places. \n\nIranian commentator Hazrati said Riyadh appeared to believe that if it accepted blame for the disaster it would be seen as weakness and lead to calls for the kingdom to give up its custodianship to an international body. \n\nSaudi Arabia's critics in the past urged Riyadh to transfer management of the haj and holy places to the Organization of Islamic Cooperation, the world's largest Muslim body. \n\nOIC Secretary-General Iyad Ameen Madani, a Saudi cleric and former haj minister, issued a statement after the disaster expressing confidence in Saudi Arabia's hosting of the event. \n\nIn a statement, he expressed the hope that \"no party would seek to take advantage of the pilgrimage and pilgrims ... in a controversial context that would divide rather than unite.\"", "source": "Jerusalem Post"}