{"published": "2015-09-09T15:10:03Z", "media-type": "News", "title": "Warren J. Gehrt, social services pioneer", "id": "e507a073-3dcc-4342-8d70-2f7c7a1fa481", "content": "Warren Joseph Gehrt, 94, known to be a pioneer in social services, died peacefully in his sleep Friday, Sept. 4, 2015. \n\nWarren Gehrt led an interesting life beginning with his graduation from Bushwick High School at the age of 16. He drove trucks for Dutch Schultz at the age of 16 until his father, Rudy, read him the Mann Act. Warren played third base on a Yankees farm team during the Depression and played ball with Phil “Scooter” Rizzuto and was pals with Dallas Green. During World War II, Warren served his country in the Navy and was stationed in Brazil. He was stationed in Washington, D.C. where he worked in Navy Intelligence decoding radio transmissions. He operated a Bombe - the allied counterpart to the Enigma machine. The Bombe was something like a mechanical computer. It's rotors were used to crack the Nazi's Ultra code. \n\nWarren was a graduate of Georgetown University in 1947 and subsequently from Catholic University with a master’s degree in Social Work in 1949. \n\nHe served under governors Elbert N. Carvel, Charles L. Terry Jr., Russell W. Peterson, Sherman W. Tribbitt and Pierre S. DuPont IV. He first arrived in Delaware from Dobbs Ferry, N.Y. in 1961, and was appointed superintendent for the Woods Haven Kruse School for Girls. In 1963, he was appointed superintendent of Ferris School for Boys; in 1968 he was appointed Commissioner of Corrections, and in 1971 was appointed superintendent for the Hospital of the Mentally Retarded. He subsequently became the director of the Division of Mental Retardation, retiring from state service in August 1983. \n\nThere were many “firsts” in Warren’s career. In 1963, he appointed Ms. Dorothy Banton as superintendent of Woods Haven Kruse School for Girls, the first African-American to head a state agency that served all races. He oversaw the construction of the new correctional facility in Smyrna beginning in 1969. He was instrumental in making institutional changes that included the elimination of the whipping post, creating halfway houses and enabling prisoners to have conjugal visits. Most importantly, he worked successfully to repeal laws on the sterilization of the mentally challenged. \n\nIn 1972, he was bestowed the honor of Social Worker of the Year by the Delaware Chapter of the National Association of Social Workers. In 1974, he was the first state director of mental retardation in the U.S. to graduate with distinction from the federally sponsored Management Training Program conducted by the Center for the Development of Learning Disorders at the University of Alabama. \n\nWarren served on many commissions and committee over the years, such as the executive director for the Youth Services Commission, the State Game and Fish Commission, the Delaware Commission on Interstate Cooperation and the Governor’s Commission on Law Enforcement and Administration of Clinical Justice, just to name a few. \n\nIn addition to his parents, Warren was predeceased by his son, Kenneth R. Gehrt. Survivors include his wife of 70 years, S. Ray Ferguson Gehrt; daughter Bonnie G. Davis (Gary) of Kennett Square, Pa.; son Thomas Gehrt (Victoria) of Kennett Square; son Russell L. Gehrt (Kathleen) of Frankford; three grandsons, Michael J. Brennan (Francelle Lim) of Brooklyn, N.Y., Matthew Gehrt (Elizabeth) of Kennett Square and Aaron Gehrt of Frankford; and five great-grandchildren, Oona, Jacob, Benjamin, Flint and William. \n\nA memorial service will be held at Chandler Funeral Home, 2506 Concord Pike, Wilmington, Monday, Sept. 21, at 11:30 a.m., where friends may call beginning at 10 a.m. A committal service with military honors will follow in Delaware Veterans Memorial Cemetery at 1 p.m. \n\nIn lieu of flowers, the family suggests contributions to Compassionate Care Hospice, 405 E. Marsh Lane, #4, Newport, DE 198", "source": "Cape Gazette"}