{"published": "2015-09-17T12:00:06Z", "media-type": "Blog", "title": "Back to School: Homemade Instant Oatmeal Packets", "id": "d204d96c-afff-4b1b-9566-260dcc97a919", "content": "This past winter I discovered the joy of having an instant oatmeal stash at school. Whether for a last minute breakfast or a mid-afternoon snack, instant oatmeal packets offer a filling, warming morsel that keeps me away from the vending machines and overpriced snacks at the student bookstore. \n \nThat’s why I think a bundle of homemade instant oatmeal, sweetly packaged with a personalized touch, would make a great back-to-school gift for students of any age, especially this time of year, when the mornings are beginning to feel quite brisk. I imagine new college students will particularly appreciate a bit of love from home in the form of an easy, hot breakfast. \n \n\nMaking instant oatmeal packets at home offers the ability to make them just how you want them. I’ve been able to add interesting spices and delicious dried berries and use less sugar than a commercial packet. The fruits and spices I paired together are cinnamon & raisin (classic), maca & goji berry (so hot right now) and blueberry & nutmeg. Yum! \n \nA project like this is a great opportunity to showcase a clever way to use personalized labels from Evermine.com. Because I created a single product with different flavors, I used the same large label on each packet–a branding label of sorts, with my name front and center. To signify the flavor of each packet, I used a smaller label in the same style, with each flavor getting its own color. The result is a very clear and very sweet package. To boot, if I have extra of the large branding label, I can use them with a different project, since the wording remains very general. \n \n Homemade Instant Oatmeal        Print       Ingredients   ⅓ cup instant oats  2 tablespoons dried berries  pinch of salt  ¼ teaspoon of spice  1 teaspoons coconut sugar (optional)      Instructions    Combine all ingredients in a 4” x 4” sealable plastic bag.   Label sweetly and lovingly. Include the following instructions. “For a quick, hearty breakfast, combine this oat mix with ¾ cup hot water or milk in your favorite mug or bowl. Cover it and allow it to set for 2-3 minutes. Enjoy!”      3.3.3077  \n  Used In This Project:   Circle Labels • I chose the “Joy of Scrolls” style in warm grey.  Small Rectangle Labels • I chose the “Joy of Scrolls” style in deep red, purple and coral.  Square Text Labels •   \nSHOP OUR ENTIRE BACK TO SCHOOL COLLECTION >", "source": "Evermine Occasions"}