{"published": "2015-09-16T23:45:29Z", "media-type": "News", "title": "Corcoran wants to lead House to era of reform", "id": "0e679a7d-0576-4370-801b-90855d7aadf2", "content": "As Rep. Richard　Corcoran　was unanimously designated the next speaker of the Florida House Wednesday, he lived up to his promise to call for controversial reforms aimed at “cleaning up our own house” and policies such as universal school vouchers. \n\n“The enemy is not the special interests. The enemy is not the press. The enemy is not any of that stuff,” Corcoran, R-Land O’Lakes, told the Republican-controlled chamber. “The enemy has always been and will always be us.” \n\nHe laid out what he said is the truth about elected office in Tallahassee: politicians who campaign on one thing and “do another thing once elected;” elected officials who start seeking higher office as soon as they are sworn in; others who use their office to seek well-paying jobs “which we would never have gotten but for our service;” and others who “pander” to the press, avoid tough decisions and cave “to the special interests.” \n\n“When the political process is more accountable to the people, then, and only then, can we really begin to positively transform the lives of the people in our state,” he said. \n\nHe then ticked off a list of reforms that he said would ideally be changed in law but which he will first pursue by rule: \n\n▪  Create more transparency in government by requiring every lobbyist “to disclose which bills, which amendments and which appropriations they are trying to influence.” \n\n▪  Ban elected officials from taking jobs in government for six years after they leave office to “end the practice of legislators padding their pensions.” \n\n▪  Prohibit legislators from being able to take a job with any company or group that receives any funding from the state to “build an absolute firewall between our private lives and the influence of special interests.” \n\n▪  And close the “revolving door between the Legislature and the lobbying corps” by passing a constitutional amendment that bans legislators from lobbying for six years after they leave office. Corcoran has planned his slate of proposed reforms for years, working with the 28 fellow Republicans who were elected in 2010 with him and drafting them in a document he calls “The Manifesto.” \n\nAs he spoke, he was greeted with both polite applause and standing ovations from his GOP brethren, even though many of his reforms seemed targeted at them. \n\nIn the front row was a lineup of former House speakers — Democrat Lee Moffitt, Republicans Tom Feeney, Larry Cretul and Will Weatherford. All but Weatherford have registered to lobby the Legislature before the six-year window Corcoran seeks. \n\nWhile Corcoran made no mention of his “manifesto,” he explained that the changes must go beyond process and focus on broad reforms — in the education system, the justice system, and the judiciary. \n\nCorcoran stopped short of calling for universal education vouchers but called for lawmakers to “fully fund the right of all parents to choose what school best meets their child’s needs — regardless of whether it’s public or private, religious or secular, or home school or virtual school.” \n\nTaking aim at the Florida Supreme Court, which has ruled that offering every parent education vouchers violates the constitution, Corcoran called for 12-year term limits for all judges. \n\n He called for criminal justice “metrics” that show which criminals are getting the harshest and longest sentences, and he called for safeguards “to guarantee that justice in this state is never governed by the color of a person’s skin or the size of their wallet.” \n\nAnd Corcoran, who has spent his four years in office opposing Medicaid expansion and Obamacare, derided the “two-tiered health care system” and the state system that protects hospital profits at the expense of the poor. \n\n“It’s time people realized that conservatives aren’t against health care for poor people, we’re against giving them poorly run government health care,” he said, as his House members applauded but many Senate Republicans — notably Senate President Andy Gardiner, R-Orlando — remained seated. \n\nFinally, he called on his colleagues to “serve a purpose greater than ourselves” and “sacrifice our own interests” telling the story of Jack Mashburn, a distant relative of his wife’s, who in 1952 as a 22-year-old legislator changed the law that banned blacks from the beach only to be told by the racist leaders of his Panama City town that he’d be voted out of office. \n\n“Either you hear that story as a cautionary tale, or you hear it how I hear it — as a story of a person who put principle over politics,” he said. “…We can stand and fight, regardless of the cost, regardless of the consequences, regardless of the opposition.” \n\n Both friends and rivals commended Corcoran for his call to action, but many also doubted he would succeed. \n\nRep. Janet Cruz, D-Tampa, who will be the House Democratic Leader in 2016. called Corcoran’s ideas “a very aggressive agenda.” But she opposes putting term limits on judges and, having worked in a public defender’s office, she has questions about whether it’s a good idea to ban lawmakers from accepting jobs in government. \n\nAnd on the same week Corcoran was urging independence from the special interests, the political committee he runs to re-elect Republicans was hosting nearly a dozen fundraisers in Tallahassee to collect checks from special interests and lobbyists. \n\n“I commend him for wanting to step outside the boundaries of Tallahassee and tackle the problem,” said Pasco County Tax Collector Mike Fasano, Corcoran’s friend of 30 years who spent 19 years in the Legislature and attended the speech. “But you can’t go up there and say we’re going to overhaul the influence of special interests and then five minutes later take a check from those same special interests. If he wants to lead, he has not start with himself and he has to start now.” \n\nCorcoran responded that he knows there will be cynics and doubters but he believes there are legislators who want to give it a try. “It’s confront the brutal facts, and the brutal fact is ... man is flawed and if left to their own devices, they’re going to try to seek their self-interest,’’ he said. \n\nMiami Herald staff writer Kristen M. Clark contributed to this report.", "source": "Miami Herald"}