{"published": "2015-09-24T11:00:00Z", "media-type": "News", "title": "Tonix Pharmaceuticals to Present at the 15th Annual Biotech in Europe Forum for Global Partnering and Investment", "id": "e91577f6-8c4b-4863-9711-580770c13500", "content": "World News: 12:00 GMT Thursday 24th September 2015 . [ Tonix Pharmaceuticals Holding Corp. via Globe Newswire via SPi World News ] \n    This story  \nNEW YORK, Sept. 24, 2015 (GLOBE NEWSWIRE) \n(NASDAQ:TNXP), which is developing next-generation medicines for fibromyalgia, post-traumatic stress disorder, and episodic tension-type headache, will present at the  in Basel, Switzerland. Leland Gershell, M.D., Ph.D., Tonix's chief financial officer, will deliver a corporate overview on Tuesday, September 29, 2015, at 12:15 p.m. CEST. \n\nDr. Gershell will also participate in a bio-pharma industry leader roundtable titled \"Neuroscience & Pain II - PAIN\" on September 29 at 4:40 p.m. CEST. The panel discussion will focus on the latest neuroscience research and development, therapeutic innovations, and advancements in promising product candidates for the treatment and management of pain. \n\nThe Annual Biotech in Europe Forum for Global Partnering and Investment brings together a cross-section of early-stage/pre-IPO, late-stage and public companies with leading investors, analysts, money managers and pharma licensing executives. For more information, visit . \n\nTonix is dedicated to the invention and development of novel pharmaceutical products for medical conditions that it believes have broad societal impact, that are not well served by currently available therapies and that represent large potential commercial opportunities. Tonix's Tonmya™ is currently being evaluated in the Phase 3 AFFIRM study in fibromyalgia. TNX-102 SL, the same proprietary product candidate as Tonmya, is currently being evaluated in the Phase 2 AtEase study in post-traumatic stress disorder. A Phase 2 proof-of-concept study of TNX-201 in episodic tension-type headache is ongoing. This press release and further information about Tonix can be found at . \n\nCONTACT: Leland Gershell \nChief Financial Officer \n(212) 980-9155 x104 \nleland.gershell@tonixpharma.com \n\nJenene Thomas Communications (investors) \nJenene Thomas \n(908) 938-1475 \njenene@jenenethomascommunications.com \n\nDian Griesel Int'l. (media) \nSusan Forman / Laura Radocaj \n(212) 825-3210 \nsforman@dgicomm.com \nlradocaj@dgicomm.com \nPublished By: \nGlobe Newswire: 12:00 GMT Thursday 24th September 2015 \n\nPublished: 2015-09-24T12:0", "source": "SPi World News"}