{"published": "2015-09-02T07:52:10Z", "media-type": "News", "title": "Volatile ASX does loop-the-loop: down, up, and sideways, ending even", "id": "6ffd69f3-2ae6-4ea4-a1de-19e62be2df08", "content": "Australian shares recovered from sharp falls to finish in positive territory on the back of a dramatic improvement in China's sharemarket and a strong lead from US futures. \n\nThe benchmark S&P/ASX200 finished 0.1 per cent higher at 5105.5 while the broader All Ordinaries index was 0.05 per cent higher at 5119.4.\n\nThe market was down as much as 1.3 per cent in early afternoon trade after poor leads from Wall Street, where the Standard and Poor's 500 fell 2.9 per cent, the third-worst drop this year, as China's economic performance continued to worry investors. \n\nHowever, a drop in the Australian dollar to just below 70 US cents coupled with a rise in US equity futures, cushioned the worst of the fall.\n\n\"Whatever the US market does, our market follows but in US dollar terms,\" said Credit Suisse analyst Damien Boey. \"The Australian dollar has fallen quite a lot overnight so it's absorbed some of the weakness in the US market.\"\n\nThe reason for the rise in US futures was unclear. \"It could be that people are anticipating some sort policy response to what's been happening globally.\"\n\nBuoying local stocks, China's sharemarket, which was down 4.6 per cent in morning trade, reversed direction on talk state-backed funds were supporting equities ahead of the country's World War II victory celebrations on Thursday. The Shanghai Composite gained as much as 0.9 per cent before trading slightly lower late in the afternoon.\n\nChina's financial markets will be closed for the rest of the week.\n\nThe bounce in the Shanghai Composite \"certainly gave the market a bit of confidence to go up,\" said Alistair McCorquodale, private client adviser at Morgans.\n\n\"The other thing is that the Wall Street futures are up so that's given the market some confidence to close that gap on the early losses this morning.\"\n\nThe local bourse also withstood sluggish Australian GDP figures that were well below expectations. The Australian economy expanded at its slowest rate in four years in the second quarter, growing 0.2 per cent in the the three months to the end of June, compared with 0.9 per cent in the first quarter.\n\nMajor banks were tipping 0.5 per cent growth, the investment banks below that, and the actual figures \"came in below the lowest\", said Mr Boey. \n\nInvestors were slightly confused because the Reserve Bank saw the data on Tuesday but chose not to cut interest rates, he said. Nevertheless, \"weak data is actually what the market would like to see because it might prompt more (Reserve Bank) easing,\" he said.\n\nAmong the banks, ANZ gained 1.3 per cent to $27.42, Commonwealth Bank increased 0.45 per cent to $73.63, National Australia Bank lifted 1 per cent to $30.70 and Westpac rose 0.7 per cent to $30.42.\n\nAmong the big miners, BHP shed 0.1 per cent to $24.63 while Rio Tinto lifted 0.3 per cent to $49.54.\n\nFellow blue-chip Telstra shaved off 0.2 per cent to close at $5.65. \n\nFurniture and appliances retailer Harvey Norman announced it was diversifying into dairy farming and cattle breeding, outlaying $34 million for a stake in Coomboona Holdings, one of Australia's largest dairy farms. But investors didn't like the news and the stock lost 3.2 per cent to close at $4.17.\n\nThe volatile oil price - which fell 8 per cent overnight after its biggest rally in 25 years - weighed on energy stocks, with Oil Search losing 1.3 per cent to $6.65, Woodside sliding 1.6 per cent to $31.10, and Santos dropping 0.8 per cent to $4.75.", "source": "Melbourne Age"}