{"published": "2015-09-11T01:38:30Z", "media-type": "News", "title": "Vanessa Hudgens flaunts her killer legs in barely there shorts in LA", "id": "1fc9c579-41e8-44cc-a290-2802e1710b4a", "content": "With temperatures hitting almost triple digits in Los Angeles this week it's no wonder Vanessa Hudgens opted to wear some of her tiniest shorts. \n\nThe 26-year-old actress flaunted her incredibly toned legs in a stylish white ensemble as she picked up a couple of iced coffees in Beverly Hills on Thursday. \n\nVanessa kept her bright white shorts held up with braces which rested over the top of a slogan T-shirt. \n\n   \n   \nLegging it: Vanessa Hudgens turned heads in tiny white shorts as she grabbed a couple of iced coffees on the go on Thursday \n\nAccentuating her toned stems were a pair of black suede ankle boots and a matching wide-brimmed fedora. \n\nCompleting her look was a chic Celine handbag in earthy tones and she shaded her eyes with reflective sunglasses. \n\nThe Gimme Shelter star - who appeared make-up free - reportedly popped into Kate Somerville Skin Care before she picked up the caffeinated treats to go. \n   \nStriding out: The Spring Breakers actress accentuated her long legs with some heeled ankle boots  \n  \nRunning errands: The 26-year-old actress popped into Kate Somervile skin care before buying some caffeinated refreshments  \n\nMeanwhile, Vanessa attended the MTV Video Music Awards on August 30 - joined by her boyfriend Austin Butler, 24, and her sister, Stella.  \n\nThe siblings opted for coordinated in low-cut floral gowns, stunning on the red carpet at the Microsoft Theatre in Los Angeles.   \n\nShe will next be one of the stars of the live TV broadcast of Grease, playing Rizzo in the famed musical.   \n\nLast month Vanessa revealed the sad news that her father is battling stage four cancer.  \n   \nHeat wave: With temperatures soaring in Los Angeles this week it was a perfect opportunity for Vanessa to showcase her pins \n   \nBalancing act: The star strutted off carrying a chic Celine handbag in earthy tones \n\nThe High School Musical star told the audience while accepting an award at the 2015 Industry Dance Awards 'Last year, my boyfriend, Austin, lost his mom, Lori, to cancer, and my dad has just been recently diagnosed with stage four cancer.  \n\n'Let me tell you, I hate cancer. I hate cancer with every cell of my being.'  \n\nVanessa scooped the Breakthrough Performer award at the ceremony and dedicated her prize to both her father and Austin's mother. \n\nAccording to Entertainment Tonight , she added: 'This award, it means a lot to me but I dedicate it to my boyfriend's mom, Lori, my dad, and to all the families out there who are struggling with this, because it really takes a strong person and a strong family to be able to help those out who are going through this.'  \n\n ", "source": "Mail Online UK"}