{"published": "2015-09-23T06:22:00Z", "media-type": "News", "title": "Pro-Family Group One Million Moms Is Waging War on Those \"Perverted\" Muppets", "id": "3911ed50-3ac1-4418-a3e0-6f4cdba665d3", "content": "Not everyone is excited about The Muppets ' return to prime time. Pro-family group One Million Moms has launched a campaign against the \"perverted\" new show. \"1MM suspects there are going to be a lot of shocked moms and dads when they discover that the family-friendly Muppets of the 1970s are no more,\" their petition reads. Unlike the original series, in which the Muppets put on a variety sketch show, the updated series is filmed mockumentary-style, which allows the characters to directly address real world subjects rather than just deliver slapstick comedy. This switch has apparently prompted the group to launch a petition warning parents to take action against the show. This is the same group behind the 2012 boycott of J.C. Penney for ads that featured same-sex couples. 5 reasons why The Muppets is our new TV obsession Among some of the objections: the Kermit the Frog billboard that touts \"full frontal nudity,\" Miss Piggy declaring she's a pro-choice feminist during an MSNBC interview; a claim that the puppets will be will be discussing sex, drugs, abortion and promiscuity. None of these examples appear to have come from actually having viewed an episode. Instead it seems as if ABC's over-the-top promotional blitz has been taken a bit too seriously. Also, The Muppets , as with many other family shows, has always included somewhat adult humor that has been written to fly over kids' heads. \"ABC has ruined The Muppets ,\" claims the petition, urging readers to send it to everyone they know as well as reach out to ABC to \"drop all plans\" to air The Muppets . The Muppets airs Tuesdays at 8/7c on ABC. What do you think about the One Million Moms' campaign? Video: Kermit explains what the new Muppets is all about Other Links From TVGuide.com", "source": "The Suburbanite"}