{"published": "2015-09-28T03:52:27Z", "media-type": "News", "title": "Selfies have become more dangerous than ... sharks", "id": "64544c55-9593-458b-a092-6198dd9b453d", "content": "In other words, selfies are killing more people than sharks. While it’s been documented that eight people lost their lives this year due to sharks, ScienceAlert is reporting that more people worldwide — at least 12 — have passed away this year due to a selfie-related incident. In other words, selfies are killing more people than sharks. The latest death by selfie victim was a 66-year-old Japanese tourist who slipped down the steps at Taj Mahal’s Royal Gate in India. Other selfie fatalities include the picture taker falling off a cliff, crashing their car, being run over by a train, or accidentally shooting themselves.\n\nSo what exactly is going on here? “Part of what happens when a person gets focused and self-absorbed in something — whether it’s their personal problems, a crisis at work or even taking a selfie — they become so immersed to the point where they get distracted and ignore almost everything else that’s around them,” says Stacy Kaiser, licensed psychotherapist. “And in the case of selfies, people are dying because they’re not seeing that cliff or noticing the car that is about to hit them.”\n\nIn some situations, Kaiser believes that taking selfies, in its simplest form, can be viewed as fun and trendy. “But on a deeper level, there’s a narcissistic element,” she states. “It’s a way of saying, ‘Look at me! Look how great I look! Look where I am! Everyone needs to see it and know about it!’ It’s attention seeking behavior. There has actually been re about the more narcissistic you are, the more selfies you take.”\n\nAs for the selfie craze, Kaiser doesn’t see it fading any time in the near future. “It’s spreading and becoming even more part of what is considered socially acceptable.” Just be careful out there.\n\n(SD-Agencies) Editor: Sylvia Xu", "source": "News Guangdong"}