{"published": "2015-09-08T02:28:51Z", "media-type": "News", "title": "Campaigning begins for historic Myanmar elections", "id": "2e775af5-204e-4c95-94e1-c176b5eaa19d", "content": "Myanmar opposition leader Aung San Suu Kyi called on the international community on Tuesday to help ensure November polls bring \"genuine political and governmental change\" as campaigning officially kicked-off in the former junta-run country.\n\nSome 30 million people will have the chance to vote -- many for the first time in their lives -- in the elections, the only nationwide polls contested by Suu Kyi's party in a quarter of a century as the nation emerges from decades of stifling military rule.\n\nThe veteran democracy activist hailed the November 8 vote as a \"turning point\" for Myanmar, which has been ruled by a quasi-civilian government since the junta loosened its grip on outright power in 2011.\n\n\"For the first time in decades, our people will have a real chance of bringing about real change. This is a chance that we cannot afford to let slip,\" she said in an English-language video message released by her National League for Democracy (NLD) party.\n\nSuu Kyi, who was locked up for some 15 years by the junta, urged the international community to monitor the elections and ensure \"our people feel that their will has been respected, and that their will has been respected in the way of genuine political and governmental change\".\n\nIn a separate Myanmar-language message, she urged voters to think of future generations as they prepare to cast their ballots, adding that the party believes it can succeed with \"the driving force of people's desire\".\n\nSome 90 political parties are contesting the polls in Myanmar, which is in the throes of a dramatic metamorphosis as reforms sweep investment and opportunity into the long isolated Southeast Asian nation. \n\nThe NLD is fielding over 1,000 candidates for the elections, slightly more than its main rival, the army-backed ruling Union Solidarity and Development Party (USDP).\n\nThe elections are for seats in the country's legislature, with a president selected by the combined houses of parliament in the months after the vote.\n\nBut Suu Kyi herself is ineligible for the top political job because of a rule in the country's junta-drafted constitution that bars those with a foreign spouse or children -- her sons are British.\n\nShe has said the party will choose a candidate from within its ranks after the election.\n\nThe lack of an obvious heir within the NLD has led to months of fevered speculation that she could throw her support behind the parliament speaker Shwe Mann, who was until recently the head of the USDP. \n\nHe was ousted from his party leadership role in a dramatic late night internal putsch using security forces by President Thein Sein last month, in a move seen as a way for the army and its allies to tighten their grip on the party ahead of the polls.\n\nThe USDP won a majority in flawed 2010 elections, which were boycotted by the NLD and held while Suu Kyi was still under house arrest.", "source": "Yahoo! UK and Ireland"}