{"published": "2015-09-21T12:55:00Z", "media-type": "News", "title": "BG Staffing Ranked In Staffing Industry Analysts List Of Fastest-Growing Firms", "id": "b14f37eb-b4fd-4825-ae39-c8395803ac67", "content": "BG Staffing, Inc. (NYSE MKT: BGSF), a rapidly growing national provider of temporary staffing services across a diverse set of industries, has been named to the Staffing Industry Analysts Fastest-growing U.S. Staffing and Talent Engagement Firms list. The list, which measures organic growth only, shows BG Staffing to have a 15.2% compound annual growth rate between 2010 – 2014. \n  \nPLANO, Texas , Sept. 21, 2015 /PRNewswire/ -- BG Staffing, Inc. (NYSE MKT: BGSF), a rapidly growing national provider of temporary staffing services across a diverse set of industries, has been named to the Staffing Industry Analysts Fastest-growing U.S. Staffing and Talent Engagement Firms list. The list, which measures organic growth only, shows BG Staffing to have a 15.2% compound annual growth rate between 2010 – 2014. \n\n\"It is an honor to be recognized as one of the fastest-growing staffing firms in the US,\" said L. Allen Baker, Jr. , CEO of BG Staffing. \"It should be noted that if our total growth was taken into consideration, including our successfully integrated acquisitions, our compound annual rate of growth for the comparable period would be 44.4%. This strong growth has moved us from the 90 th largest staffing company in 2014 to the 71 st largest in 2015. We believe that treating our clients, as well as our own staff, with focus and respect has enabled us to grow as we have and I have no doubt that we can continue to expand and prosper.\" \n   \nTo qualify for the list, staffing firms had to post at least $1 million in revenue in 2010 and have compound annual growth of at least 15 percent between 2010 and 2014. The full list of the 102 fastest-growing firms can be found on the web at http://fastestgrowing.staffingindustry.com/  \n\nAbout BG Staffing, Inc.  \nHeadquartered in Plano, Texas , BG Staffing provides staffing services to a variety of industries through its various divisions. BG Staffing is primarily a temporary staffing platform that has integrated several regional and national brands and is set to achieve scalable growth. The Company's acquisition philosophy is one that not only brings financial growth, but unique and dedicated talent within the companies. This has led to a strong management team, with tenure and a desire to offer exceptional service to candidates, customers and investors. Please visit www.bgstaffing.com for more information. \n\nForward-Looking Statements \nThe forward looking statements in this press release are made under the \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995. The Company's actual results could differ materially from those indicated by the forward-looking statements because of various risks and uncertainties including those listed in Item 1A of the Company's Annual Report on Form 10-K and in the Company's other filings and reports with the Securities and Exchange Commission. All of the risks and uncertainties are beyond the ability of the Company to control, and in many cases, the Company cannot predict the risks and uncertainties that could cause its actual results to differ materially from those indicated by the forward-looking statements. When used in this press release, the words \"believes,\" \"plans,\" \"expects,\" \"will,\" \"intends,\" and \"anticipates\" and similar expressions as they relate to the Company or its management are intended to identify forward-looking statements. Except as required by law, the Company is not obligated to publicly release any revisions to these forward-looking statements to reflect the events or circumstances after the date of this press release or to reflect the occurrence of unanticipated events. \n\nCONTACT: \nTerri MacInnis , VP of Investor Relations \nBibicoff + MacInnis, Inc.    \n818.379.8500   terri@bibimac.com   \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/bg-staffing-ranked-in-staffing-industry-analysts-list-of-fastest-growing-firms-300146048.html \n\nSOURCE  BG Staffing, Inc.", "source": "BioSpace"}