{"published": "2015-09-19T11:26:08Z", "media-type": "News", "title": "Indian football colts eye victory against Lebanon", "id": "5cde2bf3-1840-4f90-9d06-112f526220d9", "content": "The India U-16 team will aim to go for a win against their Lebanese counterparts in their final Group E match of the Asian Football Confederation (AFC) U-16 qualifiers here on Sunday. \n\nIndia are currently on three points from two matches. They started off in splendid fashion with a 5-0 thrashing of Bahrain, but lost their second game 0-3 against Iran on Friday despite creating a host of chances. \n\nIran, who have also beaten Bahrain, are at the top of the table with six points from their two games. India are at the second spot, level on points with third placed Bahrian but with a better goal difference. \n\nIn the other match of the group on Friday, Bahrain U-16 beat Lebanon U-16 2-1. \n\nIndia U-16 coach Nicolai Adam is disappointed with the loss to Iran, but asserted that his wards are determined to win against Lebanon and end their group engagements on a high. \n\n\"Our goal is to leave Tabriz City with six points. I fully stay with my opinion that if we played to our full potential we could have definitely won against Iran. But on the field, we could not play to our fullest and Iran deserved to win,\" Adam was quoted as saying by the All India Football Federation (AIFF) on Saturday. \n\n\"Against Lebanon, our aim is to reproduce the performance which we put up against Bahrain. We have to play to our full potential. \n\n\"I strongly believe that in terms of fitness among all the teams in Tabriz City we are the strongest in the championship,\" he added. \n\n\"We worked hard for that in Germany and in Goa and I hope that on basis of our fitness, we would be able to showcase our full potential in terms of technical and tactical skills in the next match.\" \n\nThe German however, is happy with the team's progress and is confident that the Indians will be able to beat Iran should the two nations meet at the AFC U-16 championship next year. \n\n\"With due respect to Iran, we played much stronger teams during the exposure trip in Germany and even won. But to win a game like this you need to play without making mistakes, which we were not able to,\" Adam said. \"It was in the last 20 minutes that we played football. The second goal at the stroke of interval killed us.\" \n\n\"Our goal against Iran was to play aggressive and play honest. My players tried to do that and were honest on the pitch. But they could not bring on the aggression,\" he added. \"It was a fantastic learning process. We are disappointed that we lost and that's natural. In my opinion we have already the potential to compete with a team like Iran.\" \n\n\"We look forward to having a rematch against Iran in the AFC U16 finals next year in India,\" the coach asserted. \n\nThe AFC U-16 Championship takes place next year in India between September and October. The four semi-finalists from the tournament seal qualification to the 2017 FIFA U-17 World Cup in India. \n\nIndia, being the hosts, automatically qualify for the mega tournament.", "source": "NetIndia123.com"}