{"published": "2015-09-23T11:11:17Z", "media-type": "News", "title": "People who see themselves as overweight are more likely to gain weight", "id": "0ab7834d-6213-40a2-adfa-5aca547f0859", "content": "People who perceived themselves to be overweight were at greater risk of gaining weight in recent studies from the U.S. and the UK. \n\nThis was true whether or not their perceptions were correct. \n\nThey also were more likely to overeat in response to stress, which explained a large part of the weight gain, researchers say. \n\nIn the past, it was assumed that if people considered themselves to be overweight, they would have greater motivation to change their diet or level of exercise, the researchers write in the International Journal of Obesity. \n\nHowever, they point out, feeling overweight can also be risky, as past studies have shown that people who feel discriminated against because of their weight are more likely to gain weight. \n\nLead author Eric Robinson at the University of Liverpool in England told Reuters Health by email that his team \"wanted to test the common assumption that being ignorant to one's weight status is always a bad thing.\" \n\nThe researchers used data from three different studies to determine how people's perceptions of their own weight affected their weight gain in adulthood \n\nFirst, they used data on close to 4000 18- to 28-year-olds from the U.S. National Longitudinal Study of Adolescent Health. The study collected information on participants' body mass index (BMI), which is a ratio of weight to height, and their self-rating of their weight. \n\nThe researchers also used demographic information to control for factors such as sex, age, race/ethnicity, education level, income, and health conditions. \n\nAround 40 percent of the participants considered themselves overweight - and these young adults were more likely to gain weight over a seven year period, averaging a 0.9 point increase in BMI. \n\nThis was true regardless of whether those participants really were overweight. \n\nThe researchers also looked at data from the UK's National Child Development Study, which followed 6,740 23-year-olds through to middle age. Thirty-eight percent believed themselves to be overweight at the start of the study. \n\nAgain, both overweight and normal weight people who thought they were overweight were more likely to gain weight than people who didn't - about 0.8 points more in BMI on average over a 22-year period. However, this effect was stronger for people who actually were overweight initially. \n\nThe study team sought to control for factors known to increase the risk of weight gain and found that the results were not due to outside psychological, health, or environmental factors. \n\nFinally, using data from 3,372 middle-aged people in the Midlife in the U.S. Study, the researchers assessed whether people perceiving themselves to be overweight would overeat in response to stress, and whether this would explain the weight gain. \n\nAt the start, 67 percent of participants believed they were overweight- and these people gained an average of 0.3 more BMI points over a 9-10 year period, compared to those who didn't consider themselves overweight. Stress-induced overeating was found to explain a significant portion of the weight gain. \n\nJane Wardle, a clinical psychologist at University College London, said by email that these findings are important because one public health strategy has been to make sure that people who are overweight are aware of it. \n\nWardle, who studies weight perception, noted that people who believe they are overweight may delay their weight loss efforts. She said that, \"a person might decide they should definitely start a diet tomorrow and meanwhile finish the cookies.\" \n\nWardle advised that healthcare professionals can help people identify practical steps to lose weight that are not too difficult. \n\nRobinson is concerned about the findings. They \"may tell us something important about the experience of being an 'overweight' person in the 21st century,\" he said. \"It's rare for identification of a health issue to be associated with that issue becoming worse.\"", "source": "FOXNews.com"}