{"published": "2015-09-16T06:50:55Z", "media-type": "News", "title": "Saudi BinLadin Group barred from construction contracts after killer crane collapse", "id": "7f149c7e-9bc6-4337-8f72-e824d3450b18", "content": "Saudi Arabia’s King has barred the Saudi Bin Ladin Construction Group from any further construction contracts after the Makkah crane collapse, which killed 107 pilgrims. \n \nAll the company’s board members and senior executives have been barred from travelling abroad following an initial investigation. \n \nThe crane has been standing for at least three years - one of several - and is part of the $27bn expansion of the Grand Mosque. But investigators have discovered that it was not assembled correctly and that led to last night's royal statement, which said there was no criminal intent. \n \nAs well as killing 107 people, another 238 pilgrims to the holy site were injured in the collapse that happened during high winds. The dead and injured came from all over the world and confirmed nationalities include Iran, UK, Thailand and India. \n \nKing Salman, who visited the injured in hospital within hours of the tragedy, has ordered SBG pay compensation for the crash's victims and referred the case to prosecutors to complete an investigation. \n \nThe Royal statement said victims’ families must receive $267,000 (one million riyals). Those who were disabled will get the same and the others who were injured will get half that amount. \n \nThe suspension of the Arab region's biggest constrctor was announced in a statement from the royal court and will remain in force until the full investigation is complete and all legal cases are settled \n \nSBG had been the preferred contractor of the Saudi regime for large-scale infrastructure and prestige projects for decades, and had been in charge of the $27bn expansion of the Grand Mosque for four years. \n \nCompletion will extend the Grand Mosque by 400,000 sqm enabling 2.2 million people to worship within its walls. \n \nMakkah is home to the Kaaba, which Muslims consider the house of God, and Muslims were converging on the city before the start of the annual religious Hajj pilgrimage, which begins on Tuesday.   \n \nSBG was founded more than 80 years ago by the father of al Qaeda leader Osama bin Laden, and is run by Osama's brother Bakr. \n \nA statement by a spokesman for the administration of the mosques in Makkah and Medina said the crane smashed into the part of the Grand Mosque where worshippers circle the Kaaba - the black-clad cube towards which the world's 1.5 billion Muslims face to pray. \n \n\"The state ‎wants to show to both the corporate and the Islamic world that they will address any wrongdoing and that they are on top of things,\" said John Sfakianakis, regional director at Ashmore Group. \n \nFollowing its inception in 1931, SBG’s reputation was first secured when ties between King Abdulaziz Al Saud – the founder of Saudi Arabia – and SBG’s chairman Mohammed Binladin saw the firm extend the holy mosques in Mecca and Medina. In 1964 it also reclad the Dome of the Rock in Jerusalem. \n \nThe group has major subsidiaries across the region and the firm has come to work on some of the Saudi Arabia’s largest projects, including the 1,800km North-South railway project, the $36bn King Abdullah Economic City (KAEC), and both the Abraj Al Bait and Jabal Omar schemes in Makkah. \n \nRelated links \n \nMakkah projects expected to spur an economic boom \n \nMakkah's Grand Mosque Expansion underway - The Big5 Hub \n \nMakkah's Grand Mosque expansion project in final stages \n \nSpanish-Turkish consortium set to secure $2.5bn Makkah ... \n \nHaramain Railway ready for trial run - The Big5 Hub \n \nWeather caused Saudi crane crash, killed 107 \n \nIN PICTURES: 10 SAUDI ARABIAN MEGAPROJECTS \n \nNew report highlights Saudi Arabia's three year hotel ...", "source": "Construct Arabia"}