{"published": "2015-09-16T13:38:00Z", "media-type": "News", "title": "Metallurgical Testing at Erdene's Altan Nar Project Returns 88% Gold Recovery, Commissions Independent Strategic Options Analysis with RungePincockMinarco", "id": "63e4cb06-a266-490f-9a50-22882a9d7ba7", "content": "HALIFAX, NOVA SCOTIA -- (Marketwired) -- 09/16/15 -- Erdene Resource Development Corp. (TSX: ERD) (\"Erdene\" or \"Company\") is pleased to announce positive metallurgical results for its 100%-owned Altan Nar gold-silver-lead-zinc project (\"Altan Nar\" or \"Project\") in southwest Mongolia. The metallurgical testwork was conducted by Blue Coast Research Ltd. to evaluate processing options for the production of gold-silver dore on site through gravity and leaching, and/or production of gold and silver in lead-zinc concentrates through flotation. The testwork was completed on representative drill core composites from the Discovery Zone North deposit at the Altan Nar project. These metallurgical test results are now being utilized in northern China marketing studies for the sale of high-grade concentrates and in a \"Strategic Options Analysis\" study currently being carried out by RungePincockMinarco Limited (\"RPM\"). \n\n\"These results are very encouraging, supporting the production of either gold-silver dore or marketable-grade metal concentrates being produced using conventional processing methods. The high affinity of gold to the lead concentrate is promising as these concentrates generally fetch excellent payment terms,\" stated Peter Akerley, President and CEO of Erdene. \"As with our maiden resource estimate in the first quarter, these results continue to validate Altan Nar's potential and allow us to expand our evaluation studies aimed at advancing the project further towards production.\" \n\nHighlights from Metallurgical Report \n\n-- Gold responded very well to direct leaching with recoveries of 88%, indicating the gold is free milling and does not contain a significant refractory component -- High-grade gold-lead-silver concentrates (229 g/t gold, 62% lead, 1,029 g/t silver) can be produced with reasonable overall recoveries (75% gold, 74% lead, 64% silver) using conventional lead-zinc differential flotation -- Good zinc concentrates can be produced grading 50% zinc at 61% recovery -- A moderate amount (45%) of gravity recoverable gold is present, albeit at lower concentrate grades (37 g/t gold) -- Metallurgical results provided to RPM for inclusion in Strategic Options Analysis study \n\nAltan Nar Preliminary Metallurgical Testwork Program \n\nThe testwork program (\"Program\") was completed by Blue Coast Research Ltd. (\"BCR\") of Parksville, British Columbia. The Program was based on a single master composite of drill core representative of the Discovery Zone North (\"DZN\") deposit area with average grades of 2.5 g/t gold (\"Au\"), 16.1 g/t silver (\"Ag\"), 0.81% lead (\"Pb\"), and 0.67% zinc (\"Zn\"). The Program was designed to provide a preliminary metallurgical evaluation of Altan Nar and included cyanidation, flotation, gravity separation, and heavy liquid separation. \n\nCyanidation (Leaching) Test Results \n\nThe results of cyanide leach bottle roll tests indicate rapid leach time and very good gold recoveries. Direct cyanidation of the DZN feed, ground to 80% passing 75 microns, resulted in recoveries of 88% for gold and 64% for silver, indicating that the gold in this composite is free milling and does not contain a significant refractory component. The test was conducted as a standard 48-hour bottle roll at 40% solids, with a cyanide concentration maintained at 1.0 g/L NaCN, while the pH was maintained between 10.5 and 11.0. Dissolved oxygen levels were maintained above 5 mg/L. Both cyanide (0.96 kg/t) and lime (1.51 kg/t) consumptions were moderate, indicating relatively low reagent consumable costs. \n\nFlotation Test Results \n\nA series of cleaner flotation tests were conducted on the DZN composite to evaluate the response of the material to sequential stages of dilution cleaning with and without regrinding. Very early in the test program it was apparent that clean lead concentrates in excess of 50% lead could be generated. The initial cleaner test, conducted without a concentrate regrind, produced a lead concentrate grading 56.5% lead at an overall lead recovery of 71.4%. Importantly, gold and silver recovery followed the lead resulting in high recoveries to the lead concentrate. Gold, in particular, exhibited a strong affinity for recovery to the lead concentrate. Gold recovery to lead cleaner concentrates ranged from 65% to 75%, while silver recoveries ranged from 59% to 64%. It should be noted that no specific attempt was made to optimize flotation conditions to improve the flotation performance of the precious metals. The best flotation result observed during the zinc cleaning program was a zinc cleaner grade of 50.3% zinc at a zinc recovery of 61.3%. \n\nOverall open circuit cleaner flotation testwork indicated that clean lead and zinc concentrates could be produced with good overall recoveries. The majority of the gold and silver reported to the lead concentrate. A primary grind of 80% passing 55 microns was identified as yielding superior results for both lead and zinc concentrates. Table 1 below summarises the Program results found for the DZN composite sample. \n\nTable 1. Overall Metal Grades and Recoveries for Flotation and Leaching ---------------------------------------------------------------------------- Processing Mass Flowsheet (%) Assay Recovery (%) ------------------------------------------------ Au Ag Pb Zn (g/t) (g/t) (%) (%) Au Ag Pb Zn ---------------------------------------------------------------------------- Head Grade 100 2.5 16.1 0.81 0.67 - - - - ---------------------------------------------------------------------------- Flotation (F8 Test) Lead Concentrate 0.97 229.1 1,028.5 61.87 5.53 74.7 64.0 74.4 7.8 Zinc Concentrate 0.84 20.2 242.5 5.78 50.28 5.7 13.1 6.0 61.3 Sulphide Concentrate 4.01 6.2 13.5 0.82 0.52 8.4 3.5 4.1 3.1 Combined 5.82 - - - - 88.8 80.6 84.5 72.2 ---------------------------------------------------------------------------- Cyanidation (48 hr) 100 - - - - 87.8 64.3 - - ---------------------------------------------------------------------------- \n\nGravity Separation \n\nA single gravity amenability test was able to recover 45% of the gold into a Knelson concentrate grading 36.5 g/t gold. The presence of other heavy minerals, such as galena, likely contributed to the lower overall grade of the Knelson concentrate. This concentrate was upgraded using a laboratory shaking table to 398 g/t gold however, the gold recovery to table concentrate was only 6%. \n\nHeavy Liquid Separation \n\nPre-concentration of the DZN composite was evaluated with a Heavy Liquid Separation test. The test was conducted at a feed size of minus 0.5 inch and was executed with a heavy liquid density of 2.85. High losses of base and precious metals to the light (float) fraction (25% lead, 46% zinc, 69% gold and 48% silver) were observed. It was concluded that the material was not amenable to Heavy Liquid Separation. \n\nFuture Metallurgical Testwork \n\nAdditional testwork programs have commenced at BCR including a flotation and leaching study on the Union North (\"UN\") material, grindability study on composite material and QEMSCAN mineralogy of both the DZN and UN composites. Future metallurgical testwork at Altan Nar will seek to refine and potentially further improve upon the above results. Locked Cycle testing of the optimized process flowsheet evaluating the impact that recirculating streams and process water has on overall metallurgical performance is also recommended, along with additional cyanidation testwork to optimize the process and allow for more accurate trade-off studies to be completed. \n\nRungePincockMinarco (RPM) Evaluation Project \n\nErdene's short term goal is to explore opportunities to rapidly advance Altan Nar to production as a small to mid-size open pit operation selling gold-silver dore or flotation concentrate, with the long term goal being to progressively define and develop a much larger operation. As an initial phase of the evaluation required to assess these opportunities, RPM has been contracted to carry out a Strategic Options Analysis. The results of the metallurgical test work have been provided to RPM as a key component of this analysis. This work includes: \n\n-- Metallurgical testwork process oversight; -- Marketing Study to understand specifications, acceptance and likely price of concentrates into northern China; -- Identify initial high-grade zone(s) and material mix to confirm metallurgical samples will be representative of mining; -- Develop mining cost assumptions for the project; -- Open pit optimisation based on required input parameters; -- Quantify mineable quantities, rock types and grades; -- Order of Magnitude Study: Determine size and grade range required for initial development with a current range of 50 tpd to 1,500 tpd; and -- Assess likely infill drilling requirements to increase resource confidence within the Whittle shells. \n\nThese studies will establish a framework for the next phases of evaluation for the Altan Nar Project that are expected to include preliminary assessment and/or pre-feasibility level work necessary for the development of an economic model and also to support a Mongolian mining licence application. It is anticipated that work associated with these programs will be conducted through mid-2016. \n\nQualified Persons \n\nResults for the metallurgical test program were provided and approved by Andrew Kelly, P.Eng., of Blue Coast Research Ltd., a Qualified Person for the purpose of National Instrument 43-101. All other technical information in this news release has been reviewed and approved by Michael MacDonald, P.Geo. (Nova Scotia), Director of Exploration for Erdene, a Qualified Person as that term is defined in National Instrument 43-101. \n\nAbout Blue Coast Research Ltd. \n\nBlue Coast specializes in metallurgical flowsheet development, from conceptual through prefeasibility to full feasibility level studies as well as in-plant consulting services supporting the start-up and optimisation of mining production plants. Their metallurgists have significant experience with polymetallic base and precious metal concentrates globally. \n\nAbout Erdene \n\nErdene Resource Development Corp. is a Canada-based resource company focused on the acquisition, exploration, and development of base and precious metals in underexplored and highly prospective Mongolia. The Company holds four exploration licences and two mining licences located in Southwestern Mongolia. These include: Altan Nar - an extensive, high grade, near surface, gold-polymetallic project that the Company is aggressively advancing toward a production decision; Khuvyn Khar - an early-stage, copper-silver porphyry project with multiple drill targets and significant copper intersections; Zuun Mod - a world-class molybdenum-copper porphyry deposit; and Altan Arrow - an early-stage, high grade, gold-silver project. In addition to the above properties, the Company has an Alliance with Teck Resources Limited on regional, copper-gold exploration in the prospective Trans Altay region of southwest Mongolia. For further information on the Company, please visit www.erdene.com. Erdene has 97,277,377 issued and outstanding common shares and a fully diluted position of 113,899,988 common shares. \n\nForward-Looking Statements \n\nCertain information regarding Erdene contained herein may constitute forward-looking statements within the meaning of applicable securities laws. Forward-looking statements may include estimates, plans, expectations, opinions, forecasts, projections, guidance or other statements that are not statements of fact. Although Erdene believes that the expectations reflected in such forward-looking statements are reasonable, it can give no assurance that such expectations will prove to have been correct. Erdene cautions that actual performance will be affected by a number of factors, most of which are beyond its control, and that future events and results may vary substantially from what Erdene currently foresees. Factors that could cause actual results to differ materially from those in forward-looking statements include market prices, exploitation and exploration results, continued availability of capital and financing and general economic, market or business conditions. The forward-looking statements are expressly qualified in their entirety by this cautionary statement. The information contained herein is stated as of the current date and is subject to change after that date. The Company does not assume the obligation to revise or update these forward-looking statements, except as may be required under applicable securities laws. \n\nNO REGULATORY AUTHORITY HAS APPROVED OR DISAPPROVED THE CONTENTS OF THIS RELEASE \n\nContacts: \n\nErdene Resource Development Corp. \n\nPeter C. Akerley \n\nPresident and CEO \n\n(902) 423-6419 \n\nErdene Resource Development Corp. \n\nKen W. MacDonald \n\nVice President Business Strategy and CFO \n\n(902) 423-6419 \n\nErdene Resource Development Corp.", "source": "BioSpace"}