{"published": "2015-09-08T13:04:58Z", "media-type": "News", "title": "Registration Open for Omnitracs Outlook 2016, Jan. 31-Feb. 3 in Dallas, Texas", "id": "71ff7bd3-8479-4fb0-8584-3364cafb3e59", "content": "SOURCE Omnitracs, LLC\n\nFMCSA's Joseph DeLorenzo among High Profile Speakers Slated for Annual User Conference for Clients of All Omnitracs Businesses\n\nDALLAS \n\nOmnitracs Outlook 2016 is the second annual joint user conference uniting fleet customers from across all Omnitracs product portfolio: Roadnet Technologies, XRS, Sylectus, Omnitracs Analytics and Omnitracs Latin America. With the theme of \"Innovation for the Road Ahead,\" Omnitracs Outlook 2016 is a forum for fleet executives, managers and power users to engage with product experts, specialized third-party technology providers and industry thought leaders to learn about industry trends, new product innovations, and network with other industry principals. Conference general sessions and breakouts will deliver actionable insights and case studies designed to help fleets improve operational efficiency, safety and regulatory compliance. \n\n\"Omnitracs Outlook 2016 promises to be the 'don't miss' industry gathering of the year, offering previews of several exciting new Omnitracs products and invaluable peer-to-peer networking opportunities,\" noted John Graham \n\nDeLorenzo is Director of the FMCSA's Office of Enforcement and Compliance and a recognized expert in commercial vehicle safety; transportation regulations; and passenger, household goods and hazardous materials transport. He will speak at the general session on Day 2 of Omnitracs Outlook 2016 and his remarks will focus on the electronic logging device mandate, new developments in the regulatory arena, and a look at the future of commercial trucking. \n\nUsers of Omnitracs, Roadnet, XRS, Sylectus, Omnitracs Analytics, and Omnitracs Latin America products and others interested in learning more about these solutions should register for Omnitracs Outlook 2016 to secure their place at one of the industry's leading educational and networking events. Conference sessions will include keynote presentations by industry leaders, engaging conversations with opinion leaders, product-specific breakouts, and user case studies. With virtually unlimited opportunities to socialize, dedicated times to meet with partners and take advantage of hands-on technology demos in the solutions expo, and valuable educational sessions, attendees will experience significant ROI. \n\nFor more information about Omnitracs Outlook 2016 and to register, visit http://www.omnitracs.com/outlook. To learn about opportunities to sponsor or exhibit at the conference, contact events@omnitracs.com. \n\nAbout Omnitracs, LLC\n\nOmnitracs, LLC is a global pioneer of fleet management, routing and predictive analytics solutions for private and for-hire fleets. Omnitracs' nearly 1000 employees deliver software-as-a-service-based solutions to help more than 40,000 private and for-hire fleet customers manage nearly 1,500,000 mobile assets in more than 70 countries. The company pioneered the use of commercial vehicle telematics over 25 years ago and today its intuitive technologies, including solutions for safety and compliance, fuel efficiency, driver retention, fleet productivity, GPS fleet tracking, route planning, scheduling, and fleet maintenance, enable customers to solve common fleet problems and achieve their business objectives. Omnitracs, LLC includes Roadnet Technologies, XRS, Sylectus, Omnitracs Analytics, and Omnitracs Mexico. Omnitracs is part of the Vista Equity Partners portfolio of companies.\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/registration-open-for-omnitracs-outlook-2016-jan-31-feb-3-in-dallas-texas-300138803.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WDAM-TV"}