{"published": "2015-09-12T15:37:02Z", "media-type": "News", "title": "Drama in Leger, Simple Verse disqualified from first in favour of Bondi Beach", "id": "2a718b8f-e267-4d5b-b454-769fb669b4af", "content": "Simple Verse was disqualified from first place in the Ladbrokes St Leger at Doncaster after a stewards' inquiry into interference with runner-up Bondi Beach. \n \nThe Ralph Beckett-trained Simple Verse looked like she had justified the decision to supplement her for the final Classic of the season, but her rider  Andrea Atzeni, successful 12 months ago on Kingston Hill, had to manoeuvre his mount off the rail in the closing stages. \n \nSimple Verse (8-1) and the Colm O'Donoghue-ridden Bondi Beach (2-1 joint-favourite) had a bit of a bumping match before the former passed the post a head to the good. \n \nAn inquiry was swiftly called into possible interference, and after both riders had argued their case, the announcement was made that the placings would be reversed, meaning another Classic for Aidan O'Brien. \n \nPaul Smith, owner of Kingston Hill and representing the Coolmore operation which includes his father, Derrick, said: \"I didn't have an opinion if he would get the race. \n \n\"When Colm got off the horse he said he'd got a couple of bumps and we had an awfully good case to argue in the stewards' room.\" \n \nO'Brien was at Leopardstown, where he told At The Races: \"I'm delighted, you're always sorry to get a race like that, but I think it was a little bit messy up the straight and Colm gave him a great ride. He's a brave horse. \n \n\"He was a little bit unlucky the last time in York this horse (narrowly beaten following interference in the Great Voltigeur) and there was no doubt he was running back at the line. \n \n\"I'm sorry for connections of the second, but we're delighted that he won. \n \n\"It's only his fifth run, he loves fast ground and he stays well. He'll be a lovely horse next year.\" \n   Promoted stories   \nBeckett, whose Secret Gesture was recently demoted to third after being first home in the Beverly D, Stakes at Arlington in the same colours, said: \"I'm astonished, apart from anything else. There's no consistency in the rules. \n \n\"We saw Stuart Williams' horse Suzi's Connoisseur pinned against the rail on the straight track at Ascot and Joe Fanning had to stand up in the irons and was beaten half a length but didn't get the race. \n   \n Share article  \n   \n\"We lose the race when clearly both horses leaned on each other. Can you say it was entirely her fault? \n \n\"It's absolutely certain we will appeal.\"", "source": "Chelmsford Weekly News"}