{"published": "2015-09-16T10:00:00Z", "media-type": "News", "title": "Gal pal: Why Cronulla Sharks skipper Paul Gallen turned to Olympian Anna Meares", "id": "7fde1b48-3247-4921-9d4e-a14398243695", "content": "Anna Meares, a proud Maroons and Cowboys fan, is too diplomatic to reveal what she really thought of Paul Gallen before the call. \n\nThe world's greatest NRL quiz #5Vote for the MVPs of 2015NRL Finals previews: Week 2\n\nAnna Meares, a proud Maroons and Cowboys fan, is too diplomatic to reveal what she really thought of Paul Gallen before the call. \"I'd rather not say,\" said Australia's champion cycling star, perhaps only half-jokingly.\n\n\"Although I must admit that opinion was only driven by media and a biased Queensland background.\"\n\nThat all changed after Gallen phoned her. Not to the point where she will barrack for Cronulla instead of North Queensland when the Sharks travel to Townsville for Saturday night's elimination final. But the respect Gallen showed Meares by dialling her number is now being reciprocated.\n\nAs part of his penance for that infamous tweet aimed at the NRL - on top of $35,000 financial penalty - Gallen had to interview three sportspeople he admired as part of a leadership course. There would have been few surprises when he turned to Sydney Swans star Adam Goodes and former Australian cricketer Steve Waugh. But there initially seemed few career parallels in his decision to choose Meares, a female Maroons fan whose sport of choice couldn't be any further removed from his own. But if he was looking for a role model, someone capable of bouncing back from adversities such as a broken neck during an Olympic year, then the exercise proved more reward than punishment.\n\n\"I spoke to Paul about the twitter stuff and the social side of life,\" Meares said. \"You have to take care when you have a profile and level of responsibility. Being a role model as well, you can't choose what you like and dislike in being a sportsperson for Australia, you've got to accept all the aspects of it. For me, I've never done it for profile or money, because it's very hard to get any. But I'm proud of my history of my consistency, of the relationship I have with the Australian public. Of the following I have, of the public nature of my career and the manner in which I've done it.\n\n\"At the same time I find it very daunting. I have to be really careful with who I surround myself. I need to be careful not to put myself into a situation where I'm uncomfortable or I'm in a situation where it can come back to bite me. I only drink casually or socially around people who I very much trust, close friends and family. It's that sort of thing. Some people call that a sacrifice, but that's not a sacrifice in my book. It's just a hard decision. A sporting person's lifetime is built up of difficult decisions.\"\n\nMeares, who herself was mentored by Waugh in the lead up to the London Olympics, officially became the greatest female track cyclist in history when she won an 11th gold medal earlier this year. She explained to Gallen that her consistency, which will result in a fourth Olympic games campaign in Rio, was the result of overcoming adversity.\n\n\"Setbacks, challenges and hurdles - whatever you want to call them - come in all different forms,\" she said.\n\n\"They can come in a physical, psychological or behavioural sense. It can be emotional, it can come in many different ways. Resilience is the main key, that vulnerability to put yourselves into positions in which you can fail, but also succeed, while having a grounded, humble nature as well.\n\n\"That combination [culminates in having] one chance every four years at an Olympic Games, which is very different from Paul's background where it's a hard grind season in and season out.\n\n\"I think he was quite an admirer of the planning structure and dedication required to focus on that one chance.\"\n\nGallen will perhaps never have a better chance of creating history by leading Cronulla to its maiden premiership. While Meares has taken a special interest in the veteran forward since their unexpected chat, she'll be happy for him to play well in a well-beaten side this weekend.\n\n\"I give him credit for picking up the phone and asking a complete stranger in a totally different sport and respecting the fact I'm a female athlete,\" she said. \"It's wonderful and quite flattering.\" The story first appeared on The Sydney Morning Herald.", "source": "Ballarat Courier"}