{"published": "2015-09-10T11:47:39Z", "media-type": "Blog", "title": "Tornado of 5 million degree plasma on the sun is bigger than the Earth", "id": "49c39350-a14a-4867-8851-c2bf1f6b145f", "content": "NASA’s Solar Dynamics Observatory (SDO) watched the Sun’s magnetic forces twist and turn enormous plumes of superheated plasma in a tornado that is larger than the Earth. The particles observed by SDO – mostly iron – were measured at a blazing 5 million degrees. (2.8 million degrees C.) A small, but complex mass of plasma gyrated and spun about over the course of 40 hours above the surface of the Sun (Sept. 1-3, 2015). It was stretched and pulled back and forth by powerful magnetic forces but not ripped apart in this sequence. The temperature of the ionized iron particles observed in this extreme ultraviolet wavelength of light was about 2.8 million degrees C. (or 5 million degrees F.) Credit: Solar Dynamics Observatory, NASA. If we ever needed a reminder that we are little more than a flyspeck on an elephant’s butt, and nature can muster foreces beyond our comprehension and squish us like a bug at a moments notice, this video is it. This is not a new finding, these were first noted from SDO imagery back in 2012: Here is a 3D computer visualization This supercomputer visualization sheds light on data gathered through new telescopes from hard-to-observe areas of the Sun. Scientists using NASA’s Solar Dynamics Observatory (SDO) have recently observed two sizes of solar “tornado”—rapidly rotating, funnel-shaped structures. Both the small and the large type are driven by magnetic energy, as opposed to the temperature and moisture contrasts that fuel actual tornadoes on Earth. The smaller, more-frequent type shown here is the result of a 2012 discovery by a team of researchers in Norway, Germany, Sweden, and the United Kingdom. In this animation of the data, a virtual camera travels around, above, and into the funnel of a solar magnetic tornado. As lines swirl around the funnel, the colors denote how quickly the plasma is rotating (from slower yellow to faster green and turquoise). Outside the funnel, the red lines represent the magnetic field. The colored patch below the funnel is the magnetic footprint at the Sun’s surface. At any moment, about 11,000 of these tornadoes, some of them as wide as the United States, may be spinning across the Sun’s surface. Each one can pack winds of more than 10,000 miles per hour. The tornadoes were discovered using the Swedish one-meter solar telescope, together with SDO data. Researchers think that heated plasma (electrically charged gas) rises through the tornadoes into the Sun’s corona, or upper atmosphere. This could help explain a longtime mystery: how the corona reaches temperatures of up to 5 million degrees Fahrenheit. The larger type of solar tornado (not shown here), which can sometimes be wider than a hundred Earths, is related to bursts of magnetic flux called coronal mass ejections. —–Magnetic Tornadoes as Energy Channels into the Solar Corona—– Science: Sven Wedemeyer-Böhm (University of Oslo, Norway), Eamon Scullion (University of Oslo), Oskar Steiner (Kiepenheuer Institute for Solar Physics, Germany), Luc Rouppe van der Voort (University of Oslo), Jaime de la Cruz Rodriguez (Uppsala University, Sweden), Viktor Fedun (University of Sheffield, U.K.), Robert Erdélyi (University of Sheffield, U.K.) Visualization: Sven Wedemeyer-Böhm, University of Oslo, Norway, using CO5BOLD http://folk.uio.no/svenwe/research.ht… and VAPOR (Visualization and Analysis Platform for Ocean, Atmosphere, and Solar Researchers) http://www.vapor.ucar.edu More information: http://www.solartornado.info", "source": "Watts Up With That?"}