{"published": "2015-09-07T10:03:42Z", "media-type": "News", "title": "Get Schooled: Creative Lunchbox Ideas", "id": "6c92780c-b23e-4026-a48f-fa61163b763a", "content": "( Family Features ) It’s time for sandwiches to move aside, because this school year bento-box style lunches reign king on campus. Bento boxes provide not only the space for healthy and nutritious food choices, but also creativity. Isn’t it time for lunch to be more fun? \nNutrition blogger and mom of two, Sally Kuzemchak, uses Lil Snappers kid-sized fruit when she creates bento box lunches because they are easy for little students to hold, serving size proportionate and each 3-pound pouch provides enough fruit for lunches and snacks for an entire week. On top of that, the fruit can be sliced up for dipping in almond butter or yogurt sprinkled with cinnamon or cut up into a fruit salad, perfect for the three or four compartments in a bento box. \n\nStudies indicate healthy eating can influence the cognitive ability and intelligence levels of students, and balanced midday meals of fruits, proteins, carbohydrates and healthy fats are best. For a well-rounded lunch, parents can fill bento boxes with fresh pasta alongside sliced carrots and grapes, taco fixings with a Lil Snappers apple or a fun and creative meal-on-a-stick to keep school-aged children satisfied throughout the day. \n\nPreparing healthy, filling lunches shouldn’t be difficult, and with bento-box style meals your kids will never be bored. With a little preparation and recipe inspiration, crafting back to school lunches will be a breeze. For additional recipes and information, visit LilSnappers.com and look for them at your local grocery store. \n \nRecipe: Apple Turkey Cheese Kabobs \n\nIngredients: \n1 Stemilt Lil Snappers Kid Size Apple, cored not sliced  1 block (3 ounces) low-fat cheese  1 slice oven-roasted turkey, cut 1/4-1/2-inch thick  2 bamboo skewers \nPreparation: \nCore apple and slice in half vertically.  Place two halves on cutting board, flesh side down, and slice each into 3-4 slices, from stem end to bottom to resemble half-moon. Set aside.  Cut 2-3 1/2-inch slices from block of cheese and, depending on dimensions of cheese block, cut each slice again to create square or triangle shape, as preferred.  Cut cubes of turkey from slice, or, using 1 1/2-2-inch round cutter cut rounds of turkey from slice. Then cut each round in half.  Thread pieces onto skewers, alternating between apple slices, cheese and turkey. \n2 \n\nRecipe: Apple-Tuna Treasure Chest \n\nIngredients: \n2 Stemilt Lil Snappers Kid Size Apples  1 can (6-ounces) white albacore tuna, packed in water, drained  2 tablespoons mayonnaise  1/2 teaspoon honey mustard  1/2 carrot, finely diced  salt and pepper, to taste \nPreparation: \nSlice off top one-third of each apple; set aside. Using small teaspoon or grape¬fruit spoon, core-out center of each apple base (working outward from centermost part of fruit), leaving 1/4-inch outer edge; set aside.  In small bowl, mix tuna, mayonnaise, mustard and carrot. Season to taste. Spoon 1/4 cup of tuna salad into each apple, top with top one-third of apples, tilted slightly to resemble a chest being opened.  Use playful, pirate-themed cupcake holders and flagged toothpicks to make for fun presentation and easy clean-up. \n2", "source": "Foxboro Reporter"}