{"published": "2015-09-25T22:07:09Z", "media-type": "News", "title": "De Villiers expected the chop after Japan loss", "id": "4761427f-763a-485a-9075-3a7dbbe71bca", "content": "BIRMINGHAM (UNITED KINGDOM) - South Africa skipper Jean de Villiers expected to be dropped after the Springboks sensational defeat by Japan in last weekend's World Cup pool game, he admitted Friday. \n \nSouth Africa's center and captain Jean de Villiers delivers a press conference at Villa Park stadium in Birmingham, on September 25, 2015, during the Rugby Union World Cup \n\nBut the veteran centre, who will lead South Africa into their crunch Pool B match against Samoa on Saturday, said he had a duty to repair the divisions in South Africa caused by the greatest upset in Rugby World Cup history. \n\nAsked whether he had expected coach Heyneke Meyer to drop him after last Saturday's defeat, de Villiers said: \"Yes I did. \n\n\"After the backing that the coach has given me, I have to perform and show that I deserve that opportunity. \n\n\"I'm very aware of the criticism he has undergone for selecting me.\" \n\nThere have been widespread calls in South Africa for Meyer and 34-year-old de Villiers to pay for the Japan defeat with their jobs. \n\nEven if South Africa win the Pool B match on Saturday, the coach and captain know they are not safe. \n\n\"We all know how important this game is for our country,\" de Villiers said. \n\n\"We are a very proud nation. What saddens me is to see how a loss like this can break the country apart. That's a responsibility that we (have) to rectify.\" \n\nDe Villiers said \"rugby is a game, but in South Africa it has become so much more than just a game and we carry that responsibility with us every single time we enter the field. We disappointed a lot of people last week. \n\n\"We need to stand up. We put ourselves in this position and we need to get ourselves out of this position.\" \n\nDe Villiers, who has a World Cup curse having missed the 2003 edition through injury and then missed out on the 2007 final triumph having been injured in the opening pool game, endured  said it has been a difficult week. \n\n\"No one died. But from a rugby point of view it has been tough. It took some time to really take in what happened at the weekend, it was a big shock.", "source": "Bangkok Post"}