{"published": "2015-09-17T20:39:24Z", "media-type": "News", "title": "Clock-making teen transferring to another school", "id": "76d49aa9-1ffd-47a3-8c40-d81c9321eb82", "content": "14-year-old's clock mistaken for bomb \n\nUpdated 09/17 2015 04:51AM \n\nCopyright 2015 Cable News Network/Turner Broadcasting System, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. \n\n(CNN) \n\nThe week started pretty terribly for Texas high school student Ahmed Mohamed. On Monday, the teen, who is Muslim, brought to school a clock that he was proud to have made on his own and was arrested for what police initially -- and falsely -- said was a hoax bomb. \n\nBut by mid-week, his face and name were splashed across traditional and social media, and he'd received thousands of tweets and Facebook posts of encouragement. President Barack Obama invited him to the White House and praised his love of science. Leaders at Reddit and Twitter offered him internships. Google executives said they were reserving Ahmed a spot at their weekend science fair and MIT asked him to visit the campus. \n\nFacebook creator Mark Zuckerberg invited him to visit the company's headquarters, posting, \"Having the skill and ambition to build something cool should lead to applause, not arrest. The future belongs to people like Ahmed.\" \n\nThe hashtags #IStandWithAhmed and #EngineersForAhmed garnered hundreds of thousands of posts and tweets. \n\nBy Thursday, more details of the 14-year-old's arrest in Irving, Texas, came to light. \n\nIn an interview late Wednesday with MSNBC's Chris Hayes, Ahmed said he was pulled out of class at MacArthur High School by his principal and five police officers and taken to a room where he was questioned for about an hour and a half. \n\nHe said he asked the adults if he could call his parents. \n\n\"They told me 'No, you can't call your parents,'\" Ahmed said. \"'You're in the middle of an interrogation at the moment.' They asked me a couple of times, 'Is it a bomb?' and I answered a couple of times, 'It's a clock.'\" \n\n\"I felt like I was a criminal,\" the teenager said. \"I felt like I was a terrorist. I felt like all the names I was called.\" \n\nHayes asked what he meant. \n\nIn middle school, Ahmed said, he had been called \"bombmaker\" and a \"terrorist.\" \n\n\"Just because of my race and my religion,\" he said, adding that when he walked into the room where he was questioned, an officer reclined in a chair and remarked, \"That's who I thought it was.\" \n\n\"I took it to mean he was pointing at me for what I am, my race,\" the freshman explained. \n\nAhmed is not going back to MacArthur -- he's transferring to another school, said family spokesperson Omair Siddiqi of the Dallas-Forth Worth chapter of the Council on American-Islamic Relations, a non-profit advocacy organization that has been helping the family handle media calls. \n\n'Scared but happy now' \n\nAhmed's father, Mohamed Elhassan Mohamed, who immigrated to the United States from Sudan, believes that his son was targeted because of his brown skin color and his religion. \n\nThe teen has never been in trouble, Mohamed told CNN. \"My son's name is Mohamed -- people just think Muslims are terrorists but we are peaceful, we are not that way,\" he said. \n\nHe was furious that the school didn't contact him right away to tell him his son had been arrested. Instead, he first learned of what happened when police called him. \n\nMohamed said he rushed to the station and saw his son \"surrounded by five police and he was handcuffed.\" \n\nThe school later suspended Ahmed for three days, his father said. \n\nMohamed said his son was at first embarrassed by what happened, but then was lifted and emboldened by the widespread support he has received. \n\nAhmed also appeared on ABC's \"Good Morning America\" on Thursday. \n\n\"I was scared at the moment, but now I feel really happy,\" he said. \"I'm getting all this support from all over the world. And the support isn't just for me but for everyone who has been through this. I will fight for you if you can't stand up for yourself.\" \n\nHe said he was most excited to hear from MIT. \"I dream of going there,\" he said. \n\nAnd he's thrilled to go to the White House. \n\n\"I hope to see him soon,\" Ahmed said of Obama. \n\nWhether the clock goes with him depends on Irving police. Late Wednesday, they were still holding the device as evidence. \n\nAsked what his plans for the future are, he told GMA, \"That clock was part of my future.\" \n\nMayor defend police, school \n\nIrving Mayor Beth Van Duyne defended the school district and police. \n\n\"I do not fault the school or the police for looking into what they saw as a potential threat,\" she said in a statement. They all followed procedures, she said. \n\nVan Duyne has had controversial interactions with Irving's Muslim community, most notably when she supported a resolution that would prohibit \"foreign law,\" including Islamic or sharia law, CNN affiliate KTVT reported. \n\nA spokeswoman for the Irving Independent School District said that the way the teen's experience has been described in media reports is \"unbalanced.\" \n\nShe declined to explain why, citing the need to protect a student's privacy, but said more details would be revealed if the family gives written permission to discuss the incident.", "source": "WTVW FOX 7"}