{"published": "2015-09-23T12:40:23Z", "media-type": "News", "title": "Leviton Network Solutions and eBay Honored by Cabling Installation & Maintenance 2015 Innovators Awards Program", "id": "2d25aafb-7f30-44e6-b018-b346caf46ce6", "content": "BOTHELL, Wash., Sept. 23, 2015 /PRNewswire/ -- Leviton Network Solutions announced today that its OM4+ Violet Fiber Cabling System, installed in eBay data centers, was recognized among the best in the industry by the judges of the Cabling Installation & Maintenance 2015 Innovators Awards program. The judging panel consisted of cabling and communications system specifiers, designers, integrators and managers with vast professional experience. Leviton Network Solutions and eBay was recognized as a Gold honoree. \n\n\"On behalf of the Cabling Installation & Maintenance Innovator Awards, I would like to congratulate Leviton Network Solutions and eBay on their Gold–level honoree status,\" said Cabling Installation & Maintenance Group Publisher Alan Bergstein. \"This competitive, unbiased program celebrates the most innovative projects in the structured cabling industry. We are pleased to celebrate Leviton Network Solutions and eBay's Gold status and recognize their contribution to the structured cabling industry.\"\n\nSponsored by: As part of its data center technology roadmap, eBay planned to upgrade to 40GbE to its servers. In order to meet the requirements of the new design, it needed a cabling solution that would support extremely long multimode fiber runs — up to 500 meters in length — and allow migration to future bandwidth speeds of 100GbE and 400GbE. \n\nThe company tested the Leviton OM4+ Premium Violet Data Center fiber system with extended reach 40GBASE-XSR4 transceivers. While these transceivers have a manufacturer's stated maximum distance of 400 meters, the channel tested successfully beyond that length, with zero errors or dropped packets when transmitting over 500 meters. The testing subsequently led eBay to install the OM4+ system in four of its data centers. The system uses all OM4+ cabling and connectivity, including Leviton Opt-X Unity trunks, harnesses, array cords, and cassettes. \n\nTo learn more about Leviton OM4+ violet fiber cabling, visit leviton.com/om4plus.\n\nAbout Cabling Installation & Maintenance \n\nPublished since 1993, Cabling Installation & Maintenance has provided practical information to professionals responsible for the specification, design, installation and management of structured cabling systems in enterprises, data centers and campuses. Cabling Installation & Maintenance's magazine, website (www.CablingInstall.com), email newsletters and webcasts help cabling professionals improve day-to-day operations and enable strategic planning for their networks' optimum long-term performance\n\nAbout the Cabling Installation & Maintenance 2015 Innovators Awards program\n\nThe Cabling Installation & Maintenance 2015 Innovators Awards program reviews and recognizes the most-innovative applications of cabling and communications technology products and systems within the structured cabling industry. Platinum, Gold and Silver Honorees were announced at BICSI's 2015 Fall Conference in Las Vegas on Monday, September 21, 2015. Criteria used in the Innovators Awards ranking included: innovation, value, sustainability, collaboration, and impact.\n\nAbout Leviton Network SolutionsLeviton Network Solutions delivers complete network infrastructure systems for enterprise, data center, government, education, health care and residential markets around the globe. Solutions include copper and fiber optic connectivity, power distribution units, and much more. All Leviton products are engineered to exacting standards, offer industry-leading performance and are backed by the industry's best service and support. Builders, contractors and other industry professionals consistently rank Leviton products as the most preferred brand in the industry. Make the smart choice for a better network. Learn more at leviton.com/ns or twitter.com/LevitonNS. About LevitonLeviton is the smart choice, providing the most comprehensive range of solutions to meet the needs of today's residential, commercial and industrial buildings. Leveraging more than a century of experience, Leviton helps customers create sustainable, intelligent environments through its electrical wiring devices, network and data center connectivity solutions, and lighting energy management systems. From switches and receptacles, to daylight harvesting controls, networking systems, and equipment for charging electric vehicles, Leviton solutions help customers achieve savings in energy, time and cost, all while enhancing safety. For more information, visit www.leviton.com, http://www.facebook.com/leviton, twitter.com/leviton or http://www.youtube.com/Levitonmfg.\n\nLogo- photos.prnewswire.com/prnh/20150922/269539LOGO\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/leviton-network-solutions-and-ebay-honored-by-cabling-installation--maintenance-2015-innovators-awards-program-300147591.html\n\nSOURCE Leviton", "source": "TickerTech.com"}