{"published": "2015-09-21T12:12:21Z", "media-type": "News", "title": "West should help, protect and resettle ISIS defectors – think tank", "id": "fcc82f22-20ef-4382-b943-33fe70dd678b", "content": "Islamic State (IS, formerly ISIS/ISIL) defectors should be encouraged to desert the terror group using promises of resettlement, protection and help, the International Centre for the Study of Radicalisation and Political Violence (ICSR) has said. \n\nA new ICSR report, titled ‘ Entitled Victims, Perpetrators, Assets: the Narrative of Islamic State Defectors, ’ was released on Monday. It argues for the removal of legal “ disincentives ” to IS fighters speaking. \n\nGovernments should provide defectors with “ opportunities to speak out; assist them in resettlement and ensure their safety; and remove legal disincentives that prevent them from going public, ” the report argues. \n\n[embedded content] \n\n“ It seems to me to be wrong that if someone is helping to deter people to join ISIS by casting a negative light on the group, that he is then being punished for it, ” Peter Neumann, ICSR director and author of the report told the Guardian newspaper. \n\n“ Right now, if you speak out, the prosecutor will say, ‘oh that’s very interesting, so he’s admitting membership of ISIS, so we can prosecute him for that.’ So that needs to stop, ” Neumann added. \n\nHe said that proper legislation was key to resolving the issue. \n“ We’re not asking for the creation of legal incentives, saying ‘if you tell a nice story you get an amnesty, ’ but people right now are being actively punished for speaking out and I think that needs to change. \n\n[embedded content] \n\n“ Lawyers need to figure out a solution for that so people are no longer disincentivised for that. ” \n\nWhile defections have been very small in number, the report approaches them as a key component of any effort to counter the jihadist group. It says cases of individuals fleeing “ have been sufficiently frequent to shatter ISIS’s image as a united, cohesive and ideologically committed organization. ”", "source": "Russia Today"}