{"published": "2015-09-09T21:41:06Z", "media-type": "News", "title": "Donald Trump and Ted Cruz lead U.S. Capitol rally against Iran nuclear deal (video and photos)", "id": "f9e532cf-891c-4e8d-bd19-52b047d9f81f", "content": "WASHINGTON, D.C. - Republican presidential candidates Donald Trump and Ted Cruz headlined a Tea Party rally outside the U.S. Capitol in an effort to to pressure Congress to scuttle a controversial deal with Iran that would lift sanctions against the country in exchange for a pledge to hold off on developing nuclear weapons. \n \nThe rally comes as Congress begins debate on a Republican-sponsored measure to disapprove of the deal negotiated by the Democratic administration of President Barack Obama. \n \nTrump, the current Republican presidential frontrunner, told several thousand Tea Partiers gathered on the Capitol's west lawn that he's never seen \"any transaction  so incompetently negotiated as our deal with Iran.\" The billionaire businessman said the deal would enable Iran to halt its dealings with the United States and attempt to bring about Israel's end. \n \n\"This Iranian nuclear deal is catastrophic,\" agreed Cruz, a U.S. Senator from Texas. \"It is the single greatest national security threat facing America.\" \n \nHe argued the influx of cash Iran would get under the agreement would make the Obama administration \"the world's leading financier of radical Islamic terrorism.:\" \n \nUnder the proposed deal, Iran would agree not to develop a nuclear bomb for at least a decade in exchange for the removal of economic sanctions against Iran that are designed to prevent nuclear proliferation. Backers of the deal say it will keep Iran from going to war in the region, while critics believe it won't stop Iran from violating the treaty by secretly developing nuclear weapons. \n \nEnough Democrats in the U.S. Senate support the deal to prevent the matter from coming up for a vote in that legislative body. If Democrats agree to let the measure come up for a Senate vote and both Houses of Congress adopt it, it has enough support from Senate Democrats to sustain Obama's inevitable veto. \n \nDespite the measure's dim prospects, Republicans want to go forward with the vote to show their opposition to the deal and hold Democrats responsible if the pact destabilizes the Middle East. \n \nOhio Democratic Sen. Sherrod Brown backs the agreement, calling it \"the only viable option\" to achieve the goal of preventing Iran from developing or acquiring a nuclear weapon.\" \n \n\"This deal is not about trusting the Iranian regime, but instead working with our allies on comprehensive, verifiable restrictions to block Iran's pathways to a nuclear bomb without precipitating another war in the Middle East,\" said a statement Brown released in August. \n \nSen. Rob Portman, an Ohio Republican, said he opposes the deal because it abandons longstanding U.S. and international non-proliferation goals, fails to block a long term path for Iran to pursue a nuclear weapons program, contains inadequate enforcement and verification measures to ensure compliance and provides Iran with greater resources to pursue its violent and destabilizing regional agenda. \n \nThe House of Representatives has begun debate on the resolution to disapprove the deal and scheduled a Friday vote on it to coincide with the anniversary of the Sept. 11 terrorist attacks. \n \nRepublican House members Bob Gibbs of Holmes County, Jim Jordan of Champaign County, Dave Joyce of Russell Township and Jim Renacci of Wadsworth have announced they oppose the treaty. Renacci said the main deal won't dismantle Iran's nuclear program, but would instead dismantle sanctions that brought Iran to the negotiating table in the first place. \n \n\"It would also allow for billions of dollars in sanctions relief to a regime that is a state sponsor of terrorism, and has pledged to wipe Israel off the map,\" Renacci said \n \nGibbs complained it \"effectively gives Iran 24 days to protest and delay any inspections.\" \n \n\"This is unacceptable,\" Gibbs continued. \"Iran must agree to and comply with unannounced, unimpeded inspections at any location and any time.\" \n \nNiles Democratic Rep. Tim Ryan on Wednesday announced that he'll back the deal. He said the international community understands the importance of bringing Iran to the table to help create a deal that will not only limit Iran's nuclear program but provide the transparency and verification necessary. \n \n\"I am convinced that this deal is the best way forward to prevent Iran from obtaining nuclear weapons, ensuring the safety of Israel, and clearing the way for future interactions between the United States and Iran,\" said Ryan. \"Let's put America in the smartest and best position to deal with a regime we don't trust and to bravely lead an uncertain and fearful world.\" \n \nThe rest of Northeast Ohio's Democratic Congress members haven't announced whether they support the measure. \n \nAudience members at the rally compared the deal with agreements other nations made with Nazi Germany before that country launched World War II. \n \n\"A majority of people in America don't want this,\" said Bill Campenni, a retired Air Force fighter pilot who lives in Herndon, Virginia. \"It's a strategic disaster.\" \n \nDayton native Debbie Witow said she feared Iran would secure nuclear weapons and use them against the United States. \n \n\"Better no deal than this deal,\" she said.", "source": "Cleveland.com"}