{"published": "2015-09-09T05:03:42Z", "media-type": "Blog", "title": "Doritos announces the FINAL installment of the Crash the Super Bowl contest!", "id": "72301c91-2e40-42c4-892d-572248f5b60f", "content": "After nine years, 8 installments, 32,000 entries and $7,000,000 in prizes, Frito-Lay and PepsiCo have finally decided to retire the Crash the Super Bowl contest….after they run it just one more time!  Here’s what Frito-Lay’s VP of marketing Jeff Klein said about the company’s plans for 2016: \n \n“We’re giving consumers one last shot to make their mark and see their homemade ads air during the Super Bowl broadcast,” J, said in a statement. “This is truly last call for all of those who not only want a shot at $1 million — but want a chance to jump-start their career in Hollywood.” \n \nFrito-Lay claims that this will be the “most audacious” installment yet but it seems like they’ve actually scaled back the promotion this year.  Doritos usually picks 5 finalists and gives them each $25,000 and sends them to the Super Bowl.  Then Doritos airs at least two fan-made ads and the directors win either $1,000,000 (if they won the online voting) or $500,000 (if their ad was picked by the judges).  But this year there will only be 3 finalists and only one of their ads will make it to air. \n \nBut there is some good news here; this year there will be 50 semi-finalists which means a lot of people will win at least a little bit of cash.  The other good news is that the grand prize winner will a get million bucks PLUS an “epic gig” working with Zach Snyder, DC comics and Warner Brothers. \n \nBecause this is sorta the 10th anniversary of the CTSB contest (it was first launched in the fall of 2006) I had a feeling Doritos would be retiring the promotion this year.  Consumer-Generated content just isn’t as raw and exciting as it used to be.  Nine years ago it was big news that an “average Joe” would get to see his commercial air during the Super Bowl.  But we live in a viral culture now and we’re all used to the idea that some regular guy or gal from Nowheresville, Oklahoma can be a “star.”  Plus technology has advanced a lot in 10 years and some homemade ads look just as good as “real” TV commercials.  So the cutesy, low-budget gimmick became irrelevant a long time ago. \n \nBut ultimately it was probably money that killed the Crash the Super Bowl contest.  This year CBS is raising the price of 30-second Superbowl ads from $4.5 Million to $5 to $6 Million a piece.  It’s just too risky for FritoLay to buy $12,000,000 of ad time and then HOPE that they get at least two great, Super Bowl-worthy ads every year. \n \nSo it’s kinda too bad that the contest is ending but I do think that Frito-Lay made the right call.  I also think it was a genius move to announce the end of the contest before running the final installment.  The last CTSB contest ever is going to garner a huge amount of attention and I think the competition this year will be fierce. \n \nThe Crash the Super Bowl site is now live but only a few details have been posted so far.  The official rules aren’t even up yet but hopefully they’ll appear soon.  It looks like the site is actually excepting entries but I’d hold off on shooting anything for now.  You’ve got a long, long time to get your ideas ready; the deadline for entries is November 15th, which, according to the little counter at the top of the contest site, is 66 days, 2 hours and 20 minutes from now:  https://crashthesuperbowl.doritos.com \n \n–", "source": "Video Contest News - Featuring News about Video Contests!"}