{"published": "2015-09-30T09:45:52Z", "media-type": "News", "title": "Healthcare Services Group, Inc. (NASDAQ:HCSG) Analyst Rating Update", "id": "a43a2662-ff25-4222-a4f9-71c3a25d2bee", "content": "Analysts at Zacks have given a short term rating of buy on Healthcare Services Group, Inc. (NASDAQ:HCSG) with a rank of 2. The company has received an average rating of 1.5 from 4 brokerage firms. 3 analysts have rated the company as a strong buy. The company has been rated as hold from 1 Wall Street Analysts. \n \nHealthcare Services Group, Inc. (NASDAQ:HCSG): The mean estimate for the short term price target for Healthcare Services Group, Inc. (NASDAQ:HCSG) stands at $35.25 according to 4 Analysts. The higher price target estimate for the stock has been calculated at $38 while the lower price target estimate is at $33. \n \nMany analysts have commented on the company rating. In a research note released to the investors, Stifel Nicolaus  maintains  its rating on Healthcare Services Group, Inc. (NASDAQ:HCSG).The analysts at the brokerage house have a current rating of Buy  on the shares. In a recent information released to the investors, Stifel Nicolaus  lowers  the new price target from $38 per share to $37 per share. The rating by the firm was issued on July 28, 2015. \n \nOn a different note, The Company has disclosed insider buying and selling activities to the Securities Exchange, According to the information disclosed by the Securities and Exchange Commission in a Form 4 filing, the director officer (Executive Vice President) of Healthcare Services Group Inc, Mcbryan Michael E had sold 7,500 shares worth of $263,700 in a transaction dated August 5, 2015. In this transaction, 7,500 shares were sold at $35.16 per share.  Currently the company Insiders own 3.7% of Healthcare Services Group Inc. Company shares.  In the past six months, there is a change of -6.58% in the total insider ownership.  Institutional Investors own 97.2% of Company shares.  During last 3 month period, 1.93% of total institutional ownership has changed in the company shares. \n \nThe company shares have rallied 15.9% in the past 52 Weeks. On August 5, 2015 The shares registered one year high of $35.49 and one year low was seen on October 15, 2014 at $26.54. The 50-day moving average is $33.7 and the 200 day moving average is recorded at $32.7. S&P 500 has rallied 4.59% during the last 52-weeks. \n \nHealthcare Services Group, Inc. provides housekeeping services. The Company offers services to the housekeeping, laundry, linen, facility maintenance and dietary service departments of the health care industry, including nursing homes, retirement complexes, rehabilitation centers and hospitals located throughout the United States. The Company operates two wholly-owned subsidiaries, Huntingdon Holdings, Inc. (Huntingdon) and Healthcare Staff Leasing Solutions, LLC (Staff Leasing). The Companys Housekeeping, Laundry, Linen and Other Services (Housekeeping) segment offers cleaning, disinfecting and sanitizing of patient rooms and common areas of a clients facility. The Companys Dietary Department Services (Dietary) segment offers food purchasing, meal preparation and providing professional dietitian consulting services.", "source": "OTC Outlook"}