{"published": "2015-09-24T20:21:28Z", "media-type": "News", "title": "Past, present coming together at the Inn on the Square", "id": "4784361f-2e6b-4031-a20b-bdd38471ba7d", "content": "As the Inn on the Square's two-month renovation nears completion, part of the building's history wants to stay present. \n \nClaire Griffith, Inn on the Square events manager, said the Inn has four ghosts: one named Bill who lives in the bar and a grandmother, mother and small child who live on the third floor. They have made their presence known. \n \n\"I swear he (Bill) has stolen files from me,\" Griffith said. \"I know he has.\" \n \nThe staff also blames Bill for a water leak from the second floor ice machine that caused damage to the ceiling on the first floor. \n \n\"We never turned any ice machines on,\" Griffith said. \"I don't think they were ever plugged in. We just give Bill the credit for it.\" \n \nBecause Bill does not like to be closed in the bar at night, Griffith said the staff has to tell him when it is time to leave each night. \n \n\"Apparently, stories have it that if you do shut him in and don't tell him that it's time to go, he'll rattle the doors, so the front desk people are freaking out at night,\" she said. \n \nWith the Inn's grand opening scheduled for 5 p.m. Oct. 1 with soft openings at Greenwood Area Chamber's Super Networking Night Thursday and test runs with invited community members Friday and Saturday, the Inn is keeping its historical flair with modern conveniences. \n \nFor example, the Inn's bar will be called \"The Fox and Hound\" to retain the nostalgia of the Inn and old Greenwood. \n \n\"Even though it is very, very different, we wanted to keep a little bit of the past and represent that history,\" Griffith said. \n \nThe dining room will also open Oct. 1, and the kitchen renovations are finished. With the carpet laid, Griffith said the finishing touches and staff training are the final parts of the renovation -- even though the project may currently look incomplete. \n \n\"We are moving ahead right along with schedule,\" she said. \"Even though it looks like this today, I know by next Thursday it will be perfect.\" \n \nGriffith said the third floor will open about two weeks after the rest of the hotel. \n \nWith an emphasis on local, Griffith, who lives in Greenwood, said all staff members who are Griffith's \"dream team\" are connected to Greenwood in one way or another. \n \n\"I think we have the best of what Greenwood has to offer,\" Griffith said. \"Whatever it takes, they're doing it.\" \n \nGriffith said the Inn is already booked for next year's Festival of Discovery, Masters Golf Tournament in Augusta and the LPGA Symetra Tour golf tournament. She said wedding parties have also booked the hotel for events and rooms, and their catering division is almost booked for Christmas parties. \n \n\"It's been exciting,\" Griffith said. \"It's been slightly overwhelming somedays, but I definitely think we are looking forward to pulling through. There's always a way to make it happen.\"", "source": "Index Journal"}