{"published": "2015-09-23T18:19:15Z", "media-type": "News", "title": "Ultra Petroleum Corp. Receives Consensus Rating of “Hold” from Brokerages (NYSE:UPL)", "id": "521e6b36-cea8-45bf-aec9-c904f78a4c1c", "content": "Ultra Petroleum Corp. (NYSE:UPL) has been given an average recommendation of “Hold” by the sixteen ratings firms that are presently  covering the firm, Market Beat Ratings reports . Four analysts have rated the stock with a sell rating, eight have given a hold rating and two have given a buy rating to  the company. The average 1 year price objective among analysts that have updated their coverage on the stock in the last year is $13.27. \n\nUltra Petroleum Corp. ( NYSE:UPL ) traded down 3.606% during mid-day trading on Friday, hitting $6.015. 1,692,554 shares of the company traded hands. The company has a market capitalization of $921.78 million and a price-to-earnings ratio of 2.768. Ultra Petroleum Corp. has a one year low of $5.86 and a one year high of $24.98. The company’s 50-day moving average price is $7.13 and its 200 day moving average price is $12.20. \n\nUltra Petroleum Corp. (NYSE:UPL) last announced its quarterly earnings data on Thursday, July 30th. The oil and gas exploration company reported $0.21 earnings per share for the quarter, topping the Thomson Reuters’ consensus estimate of $0.19 by $0.02. The firm had revenue of $427.30 million for the quarter, compared to the consensus estimate of $245.36 million. During the same period in the prior year, the firm posted $0.52 earnings per share. The business’s revenue for the quarter was down 29.7% compared to the same quarter last year.  On average, analysts anticipate that  Ultra Petroleum Corp. will post $0.50 earnings per share for the current fiscal year. \n\nA number of brokerages have recently commented on UPL. Barclays  reiterated a “sell” rating on shares of Ultra Petroleum Corp. in a research report on Tuesday, July 14th. KLR Group raised Ultra Petroleum Corp. from an “accumulate” rating to a “buy” rating and set a $17.00 price target for the company in a research report on Monday, July 20th. Global Hunter Securities cut their price objective on Ultra Petroleum Corp. from $16.00 to $10.00 and set a “neutral” rating for the company in a report on Tuesday, July 21st. Jefferies Group dropped their price target on Ultra Petroleum Corp. from $10.50 to $8.00 and set a “hold” rating on the stock in a research note on Friday, August 14th. Finally, RBC Capital lowered their price objective on Ultra Petroleum Corp. from $18.00 to $16.00 and set a “sector perform” rating on the stock in a research report on Friday, July 31st. \n\nUltra Petroleum Corp. ( NYSE:UPL ) is an independent oil and gas company. The Firm is engaged in creation the development, operation, exploration and acquisition of oil and natural gas properties. The Company operates in developing its natural gas reserves in the Jonah and Pinedale fields, its oil reserves in the Uinta Basin in northeast Utah, the Green River Basin of southwest Wyoming and its particular natural gas reserves in the north central Pennsylvania region of the Appalachian Basin. The Company holds interest in the producing and non-producing properties in the Pinedale field in Sublette County, Wyoming (the SWEPI Properties). The SWEPI Properties consists of approximately 19,600 net mineral acres in Wyoming and related oil and gas production.", "source": "WKRB News"}