{"published": "2015-09-09T13:43:19Z", "media-type": "News", "title": "Virgin America Offers Free Uber Rides With Every Dallas Love Field Flight* And Brings 'Friday Night Flights' To The Big D", "id": "95935610-2b6f-4059-ab96-1da6b35a7519", "content": "Virgin America, the low-fare, upscale airline today teams up with Uber to launch some Texas-sized deals for Dallas flyers - including a free Uber ride (up to $20)* with the purchase of any flight departing from Dallas Love Field (DAL) and a 'Friday Night Flights' series that allows local travelers to score the ultimate, on-demand weekend getaway through the Uber app** in partnership with Rocketmiles and ScoreBig(TM). Virgin America is also launching a Dallas Love Field fare sale this week, with tickets to Austin starting from $67 and tickets to Los Angeles starting from $99 (must be purchased by 11.59pm PT, September 10, 2015, restrictions apply)***. Travelers can grab these fares and a ride at virginamerica.com or by calling 1.877.FLY.VIRGIN (1.877.359.8474) ****. \n\n\"With our stylish, low-fare flights departing daily from downtown Dallas to New York, Washington D.C., Los Angeles, San Francisco, and Austin, we're excited to offer even more perks and great deals to Dallas flyers,\" said Luanne Calvert, Chief Marketing Officer at Virgin America. \"We're looking forward to kicking off 'Friday Night Flights' with a series of on-demand music-packed weekend getaways. And because we know time is of the essence, particularly for our business travelers looking to skip the parking lot, we're partnering with Uber to make getting to the airport located closest to downtown even more convenient and rewarding for our Elevate members.\" \n\nMore about the promotions: \n\nFree Rides to Dallas Love Field: \n\nWith its modern, convenient location, Dallas Love Field has become an increasingly popular airport for local travelers - and Virgin America has teamed up with Uber to encourage flyers to grab a ride, rather than park at DAL this fall. Through the partnership, Uber is offering free rides (up to $20) to and from the airport to the airline's new or existing Elevate frequent flyer members with the purchase of any flight originating from DAL booked through October 12, 2015, while supplies last. Further, travelers who are new Uber users will also score an additional $20 ride* for a future ride. To find out more and view Virgin America's lowest Dallas Love Field fares, visit: https://www.virginamerica.com/cms/promos/9-9-15-dal-uber-ride \n\nFriday Night Flights: \n\nStarting this week, every Thursday afternoon through October 8, 2015, Uber users can request the 'Friday Night Flights' option through the Uber app for a chance to a win a mood-lit flight from DAL to Washington D.C., New York, Los Angeles, San Francisco or Austin. The 'Friday Night Flights' package for two includes a roundtrip Main Cabin flight on Virgin America, a round trip Uber ride, a two night stay at a four-star property provided by Rocketmiles, and concert tickets provided by ScoreBig to the hottest shows in each DAL destination city - from the Foo Fighters in Los Angeles, to Jason Aldean in Washington D.C. to an exclusive pass to Austin City Limits. \n\nHow to score a 'Friday Night Flights' getaway: \n\n-- Enter the promo code VXDALFNF into the Uber app. \n\n-- Each Thursday at 3 p.m., open the Uber app and request the 'Friday Night Lights' option. \n\n-- The first users who request will be on their way to the weekend getaway that departs the next day. The winners will be provided with a full itinerary in partnership with Virgin America, Uber, Rocketmiles and ScoreBig. \n\nThe 'Friday Night Lights' entertainment line-up includes: \n\n-- Weekend 1 - Washington DC (Sept 11-13) - Jason Aldean (9/12) \n\n-- Weekend 2 - Los Angeles (Sept 18-20) - Foo Fighters (9/19) \n\n-- Weekend 3 - San Francisco (Sept 25-27) - AC/DC (9/25) \n\n-- Weekend 4 - New York City (Oct 2-4) - Zedd (10/2) \n\n-- Weekend 5 - Austin (Oct 9-11) - Austin City Limits (provided by Uber) \n\nVirgin America offers its guests sleek, tech-forward aircraft cabins with custom-designed seating, fleetwide WiFi, signature moodlighting, power outlets near every seat and the unparalleled Red® in-flight entertainment system. In addition to a Main Cabin that offers custom-designed leather seating with a deeper, more comfortable pitch, Virgin America's First Class cabin offers plush white leather 'cradle sleeper' seating with 55 inches of pitch, 165 degrees of recline and lumbar massagers. The carrier's Main Cabin Select service offers 38 inches of pitch, free food and cocktails, an all-access pass to media content, dedicated overhead bins and priority check-in and boarding. The Red in-flight entertainment platform offers guests their own seatback touch-screen TV, with more 25 films, live TV, interactive Google Maps, videogames, a 3,000 song library and an on-demand menu, which allows flyers to order a cocktail or snack from their seatback any time during a flight. \n\nVirgin America also offers DAL travelers a check-in lounge that mirrors the sleek look and feel of the carrier's aircraft cabins and is the only dedicated VIP check-in area of its kind at Love Field. The check-in lounge offers First Class guests and Elevate Gold members an upgraded experience from the moment they arrive at the airport's convenient downtown location - complete with a dedicated Virgin America VIP concierge to assist with their travel needs. \n\nVirgin America launched its service at the new Dallas Love Field airport in October last year with a \"Downtown Express\" flight - marking the last service from DFW and the first to touch down at DAL. The airline teamed up with Uber at launch to offer guests free Uber rides with ticket purchase and a surprise, on-demand flight pick-up via the Uber app to beat the cross-town traffic between DFW and DAL. In true Virgin fashion, the \"Downtown Express\" flight was a party with a performance in-flight by Grammy-award winning country star, Kacey Musgraves. \n\nSince its 2007 launch, Virgin America has created more than 2,800 new jobs and expanded its network to include Austin, Boston, Cancun, Chicago, Dallas Love Field, Fort Lauderdale, Las Vegas, Los Angeles, Los Cabos, Newark, New York (JFK), LaGuardia Airport (LGA), Orlando, Palm Springs (seasonal), Portland, Puerto Vallarta, San Diego, San Francisco, Seattle, Washington D.C. (IAD and DCA), Honolulu (as of November 2, 2015) and Kahului, Maui (as of December 3, 2015). \n\nPhotos of Virgin America's unique aircraft and broadcast quality b-roll can be found at: https://www.virginamerica.com/cms/about-our-airline/photos.html. \n\nAbout Virgin America: Known for its mood-lit cabins, three beautifully designed classes of service and innovative fleetwide amenities -- like touch-screen personal entertainment, WiFi and power outlets at every seat, Virgin America has built a loyal following of flyers and earned a host of awards since launching in 2007 -- including being named both the \"Best U.S. Airline\" in Conde Nast Traveler's Readers' Choice Awards for the past seven consecutive years and \"Best Domestic Airline\" in Travel + Leisure's World's Best Awards for the past eight consecutive years. For more: www.virginamerica.com \n\nAbout Uber: Uber is a technology platform that is revolutionizing the way people connect with their cities around the world - and creating tremendous economic opportunity for transportation providers. By connecting users with a safe, reliable and seamless ride, and with unprecedented accountability and transparency built into the system, Uber has transformed the way users think about their transportation options. \n\nAbout Rocketmiles: Rocketmiles is a hotel-booking website and app that awards travelers with thousands of miles or points per night, every stay. Giving people the opportunity to book at properties around the globe, Rocketmiles makes saving up for incredible vacations faster and easier. For more information, visit www.rocketmiles.com and follow on Twitter @rocketmiles. \n\nAbout ScoreBig: ScoreBig, www.scorebig.com, is a live event ticket marketplace that allows consumers to save on millions of tickets to over 6,000 premium live events. At ScoreBig.com, consumers can choose to Name a Ticket Price and save up to 60% off box office prices. ScoreBig also provides, in partnership with its loyalty program partners, a platform that allows consumers to earn thousands of loyalty rewards points when purchasing live entertainment tickets and in many cases, the ability to redeem points for those same tickets. See more at: http://blog.scorebig.com \n\n*Uber Offer: The first 10,000 Elevate members to book an originating DAL flight by September 10, will be emailed a unique promo code good for up to $20 off (1) ride that either begins or ends in the Dallas Love Field Airport, between 9/29/15 - 3/2/16. Discount will automatically apply to the first airport trip after the code has been applied to user's account. Redeemable (1) code per person. Please allow 7-14 business days to receive your unique promo code. Uber users are invited to signup for their account today at https://get.uber.com/go/vxdal15 \n\nVXDAL15 code provides new users who have not yet signed up, taken a first ride or have an existing promotional code on their account, up to an additional $20 off their first trip with Uber. \n\nThe promotional code is good for 1 ride per user and can be used in any available vehicle type and is valid throughout the US. Both promo codes can be redeemed for a single ride as long as the new user code is used first. \n\n**Flight Night Flights Official Rules: Click here. \n\n***DAL Fare Sale Terms and Conditions: Tickets must be purchased by 11:59pm CT on Thursday, September 10, 2015. Main Cabin fares are one-way and require a 21-day advance purchase. Travel must occur between September 29, 2015 and March 2, 2016. Lowest sale fares are available only on certain itineraries. Lowest sale fares are only valid for travel on Tuesday, Wednesday and Saturday. Blackout dates include: 9/7/15, 10/9/15, 10/12/15, 11/6/15, 11/9/15, 11/20/15 - 11/30/15, 12/18/15 - 12/31/15, 1/1/16 - 1/4/16, 1/15/16, 1/18/16, 2/12/16, and 2/15/16. Seats are limited, subject to availability, and may not be available on all flights. Flights may not operate daily. Tickets are non-refundable and non-transferable. For travel solely between points in the Continental Western Region (LAS/LAX/PDX/PSP/PVR/SAN/SEA/SFO/SJD only) and AUS-DAL, changes or cancellations can be made for a $100 fee per guest through all channels, plus any increase in fare, if applicable. For all other itineraries, changes or cancellations can be made for a $150 fee per guest through all channels, plus any increase in fare, if applicable. Any remaining balance will be placed in a guest's travel bank, good for travel on Virgin America for one year from date of issue. Changes or cancellations of a booking made with Elevate Points will be subject to a $100 redeposit fee per guest. Guests who no-show without a change or cancellation prior to the scheduled departure time will forfeit the amount of this fare. In addition, any future flights booked in the same reservation will also be canceled and the fare will be forfeited. Tickets purchased from Virgin America through our reservation call center will cost an additional $20 per guest per itinerary. Any added cost associated with purchasing tickets from Virgin America through our reservation call center will be non-refundable. Fares will not be honored retroactively or in exchange for any wholly or partially used ticket. Fares, routes, fees and schedules are subject to change without notice. Virgin America will accept up to ten pieces of checked baggage, up to 50 pounds each, per ticketed guest traveling within the U.S. The fee for each piece of checked baggage up to 50 pounds is $25. Additional fees apply to baggage exceeding these weight limitations, and other baggage restrictions may apply. \n\n****Any guest calling within the United States has access to a complimentary telecommunication relay service by dialing 711. For more information, go to: http://www.nidcd.nih.gov/health/hearing/telecomm.asp \n\nhttp://photos.prnewswire.com/prnvar/20090123/VIRGINAMERICALOGO \n\nLogo - http://photos.prnewswire.com/prnh/20090123/VIRGINAMERICALOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/virgin-america-offers-free-uber-rides-with-every-dallas-love-field-flight-and-brings-friday-night-flights-to-the-big-d-300139689.html \n\nSOURCE Virgin America \n\nhttp://rt.prnewswire.com/rt.gif?NewsItemId=AQ96870&Transmission_Id=201509090930PR_NEWS_USPR_____AQ96870&DateId=2015", "source": "Individual.com"}