{"published": "2015-09-04T16:34:08Z", "media-type": "Blog", "title": "Dr. King Supported Workers' Rights", "id": "1b778bb6-e9c9-441c-bc8e-fe9138fadd73", "content": "Labor Day celebrates the dignity of work across America. The first Labor Day celebration took place within New York City on September 5th, 1882. On June 28th, 1894, the United States government designated the first Monday in September as a holiday to commemorate the achievements and contributions of American workers. Lesser known is that the late Dr. Martin Luther King Jr. championed not only civil rights, but also workers' rights. Consider the following quote from his 1961 speech to the United Automobile Workers Union in Detroit, Michigan: \"The Labor movement was the principal force that transformed misery and despair into hope and progress\". Here's another example, taken from his 1961 AFL-CIO Convention speech in Miami Beach, Florida: \"the duality of interests of Labor and Negroes makes any crisis which lacerates you, a crisis from which we bleed\".\n \n Working families across America, especially households of color, have a complicated relationship with employment. Some of us enjoy our jobs tremendously, others not so much. Others are seeking a new opportunity, are transitioning between careers, or are starting a new enterprise. Many are unemployed or underemployed--indeed, as Princeton University professor Eddie Glaude noted via Twitter, \"the current black unemployment rate is about the same as white unemployment during the height of the Great Recession\". Whatever one's job status may be, the reality is that most of our financial situations are shaped by our salaries, hourly wages, contracted compensation, or the take-home pay of someone within our households.\n \n That compensation, in turn, is subject to fluctuations in business cycles, furlough decisions, and market shocks of one sort or another. Given ever-changing shifts within our capitalist economy, it's easy to think that economic justice is a utopian mist which will never become a workplace reality. The truth, however, is that low-wage workers are winning significant gains throughout the nation. $15 an hour living wage laws are being implemented in cities like Los Angeles and Seattle, and a statewide victory seems imminent for fast-food workers in New York State. A recent court decision declared that multinational corporations have \"joint employer\" status with franchisees, potentially opening the door to a resurgent union organizing in the private sector. Additionally, the Obama administration is belatedly, but assertively, reforming overtime laws, increasing the minimum wage for employees of federal contractors, and pursuing other noteworthy administrative reforms. We have not entered King's promised land of guaranteed minimum incomes, legal protections for collective bargaining, and expansive alliances between labor unions and political institutions representing people of color, but we have made noteworthy progress towards that ideal.\n \n I have the pleasure of serving as Executive Director of Drum Major Institute, an organization which Dr. King established as Drum Major Foundation and which his eldest son Martin Luther King III co-founded in its current form. In that capacity, I'm often reminded of Dr. King remarks: \"all labor that uplifts humanity has dignity and importance and should be undertaken with painstaking excellence\". Too often, the bread of workers' excellence is concentrated at the top, with crumbs barely trickling down to nonsupervisory employees in service sector jobs like home health care, building services, and retail services. For that reason, this Labor Day, let us celebrate the unions and worker centers, the nonprofits and social businesses, the faith-rooted organizers and grassroots activists, the politicians and civil servants, whose efforts anticipate a day when God's daily bread which is meant for all, is enjoyed equally by all. \n-- This feed and its contents are the property of The Huffington Post, and use is subject to our terms. It may be used for personal consumption, but may not be distributed on a website.", "source": "Religion Blog on The Huffington Post"}