{"published": "2015-09-13T20:45:37Z", "media-type": "Blog", "title": "With or without helmet, J.J. Watt can't play defense for Texans by himself", "id": "6c119b5c-71a7-46f3-95ee-46b73cf9d069", "content": "J.J. Watt blew past Chiefs tackle Jah Reid, got his helmet flipped off, never slowed down, and sacked Alex Smith on a play that’s going to get replayed the night he’s inducted into the Hall of Fame, and long after. It was so incredible, it's easy to forget it happened in a Texans loss that was more lopsided than the 27-20 final score. It was also easy to forget that a big chunk of the blame lands right on that vaunted defense Watt leads. MORE: Must-see Week 1 images | Chiefs vs. Texans puts fans to sleep | Watt doesn't need a helmet  But to be fair, he was only supposed to lead it — not be it, all of it, one-against-11, working solo with a group of super-hyped, high-drafted, well-paid onlookers. Ideally, the MVP runner-up was supposed to be just the biggest part of a dominating whole. He wasn’t. He was just J.J. Watt, one-man wrecking crew, getting almost no help from a supporting cast that included Jadeveon Clowney, Brian Cushing, Vince Wilfork, Jonathan Joseph and their first two draft picks, Kevin Johnson and Bernardrick McKinney, among others. That can’t last. Not for a Texans team that needs its defense to shoulder the load until, at the very least, Arian Foster gets back from his groin injury. Foster is pushing to return next week. Not only will the Texans embrace that, they may slip him into the secondary, or even the linebacker core. Heck, why not the defensive line, to give Watt some help? He wasn’t getting it from his higher-profile teammates, old and new, young and experienced. The Texans offense didn’t help. But few expected it to help. It doesn’t have the players or the depth the defense does, not after the Texans got the gift of a healthy Clowney, and loaded up in the draft and in free agency. Brian Hoyer's turnovers gave the Chiefs a short field for two of their touchdowns. The Texans defense didn’t have that excuse the rest of the first half, when they fell behind 27-6 and made Smith look like Joe Montana, from his Chiefs and 49ers days. The Houston crowd booed in the first half, for good reason. The offense was the primary target. That would be unfair, though. They needed the defense’s help, and they didn’t get it. Watt was as good as he always has been. He was in the middle of every play, but he couldn’t rush Smith and plug the line against the run and cover Travis Kelce down the seams and Jeremy Maclin on the perimeter, all at the same time. He should never have been supposed to. The J.J. Watt Show, starring J.J. Watt, gets great ratings on YouTube and Twitter and during HBO’s “Hard Knocks” and in commercials and among a nationwide fan base that wants heroes and loves his persona. It doesn’t play well in a game, though. It’s not what Bill O’Brien and the staff and front office and the rest of the roster envisions. On Sunday, it was a certified flop.", "source": "Sporting News  Feed RSS"}