{"published": "2015-09-08T19:03:11Z", "media-type": "News", "title": "The White house has no information about the planned meetings between Obama and Putin", "id": "5d1955a9-9c66-403a-b379-cd65261c7901", "content": "The White house has no information about the possible meeting of U.S. President Barack Hussein Obama and Russian President Vladimir Putin, said White house press Secretary Josh Ernest. \n\n\"I don't have any at the present time, information on any planned meetings,\" he said at a press conference. \n\non the Last working day of the week the Head of the Kremlin administration Sergei Ivanov said Last news that as long as the meeting between Obama and Putin is not expected. \n\nfirst assistant to the President Yuri Ushakov said that the Russian Federation had not sent a request to the White house initiated the meeting between Putin and Obama. As long as requests from America on this score have been reported, Ushakov said about the possibility of holding a meeting between the heads of Russia and the United States in September on the sidelines of the UN General Assembly in new York. \n\nAssistant to the President of the Russian Federation said that the Russian Federation of any of the contacts does not step back, but on the contrary, favours dialogue. The head of the Ministry of foreign Affairs of the Russian Federation S. V. Lavrov had previously noted that the meeting between Putin and Obama on the sidelines of the UNGA will take place, if from the capital of the USA will receive the appropriate signal. \n\nSession of the high level with the participation of heads of States and governments and foreign Ministers will be held from 28 September to 3 October, it will open Brazil. The second one will serve the United States, then Poland, China, Jordan and Russia - it will make the sixth after day 1 of the debate. Putin first spoke at the UN General Assembly in 2000, 2003 and 2005. \n\nPrevious conversation 2 leaders took place at the initiative of the Russian side at the end of June, after a four-month break. Explaining the June conversation in conversation new York times, Obama said he had been inspired by a call to Putin, during which they discussed and the Syrian Arab Republic, and Ukraine. The last time the personal contact of 2 leaders took place at the G20 conference in Australia in the spring of last year. \n\nsections: Politics", "source": "RIN.ru"}