{"published": "2015-09-01T10:16:46Z", "media-type": "News", "title": "Celebrate organic!", "id": "e5871d71-b640-4a99-9c70-ad4b286b649c", "content": "As the Soil Association prepares to launch its annual Organic September campaign, we look at some of the reasons why going organic can help the planet  \nAs increasing numbers of consumers turn more towards healthy, ethical and local food choices, the Soil Association's annual event, Organic September, is becoming bigger than ever. This year's celebration of all things organic promises to include inspiring events, handy tips, delicious recipes and much more. \n \nThe aim behind the campaign is to encourage people to make a small change to their everyday shopping in order to help the planet. From reducing your exposure to potentially harmful pesticides to helping combat climate change and promoting animal welfare, the reasons to go organic are many. \n \nFor example, did you know that over 320 pesticides can be routinely used in non-organic farming and that these are often present in non-organic food? By switching to organic food you can be safe in the knowledge that all organic farms and food companies are inspected at least once a year and the standards for organic food are laid down in European law. \n \nOrganic farms help to protect wildlife and promote animal welfare too. Organic animals are reared without the routine use of antibiotics which is common in intensive livestock farming, whilst plant, insect and birdlife is 50 per cent more abundant on organic farms. Furthermore, if organic farming was common practice in the UK we could offset at least 23 per cent of UK agriculture's greenhouse gas emissions through soil carbon sequestration alone. \n \nHelen Browning, the Soil Association's chief executive said: \"With wildlife in decline over the last half century, Organic September is a fantastic opportunity to let people know why organic farming is more important than ever. With each small change we make - like choosing organic milk or butter, or switching to organic eggs, we are helping secure a better future for animal welfare, our bees and other pollinators, and of course, our neglected soils.\" \n \nThe Soil Association is partnering with independent, online and national retailers in the UK to make it easier for people to achieve their small changes. Many businesses have already listed their support, from multiple retailers like Ocado and M&S to well-established independent stores and wholesalers like Wholefoods and Planet Organic, to famers, box schemes, processors and brand new organic businesses. \n \nHow you can get involved \n \nDuring this year's campaign the Soil Association will be running an interactive and social media campaign featuring the Organic 30 list and calendar. This will comprise plenty of tips for easy items to swap throughout the month from swapping to organic milk to brewing an organic cuppa for colleagues. There will also be prizes up for grabs throughout the month as well as offers and promotions to help you buy your favourite organic products for less. Make sure you share your organic tips, recipes and photos on social media using the hashtag #OrganicSeptember \n \n5 ways to go organic this September \n \n1. Switch to organic milk. Organic milk is naturally different - no system of farming produces milk with higher levels of omega-3 fatty acids or a healthier balance of omega-6. \n \n2. Eat less, but better, organic meat. Organic animals enjoy the very highest welfare standards of any farmed animals. They are fed a GM-free diet and graze on organic pasture where pesticides are severely restricted. \n \n3. Switch to organic beauty. There are currently no legal standards for organic beauty so some products may be labelled 'organic' even if it doesn't always stand true. Look for the Soil Association symbol to make sure that what you put on your body is as important as what goes in it. \n \n4. Sign up for an organic veg box. Organic farms support 50 per cent more wildlife than non-organic farms, so you're not just treating yourself to the best of British produce, you're also helping to protect bees, birds and butterflies. \n \n5. Brew an organic tea or coffee. Organic tea and coffee is grown without the use of artificial pesticides and fertilisers. This not only reduces the farmers' exposure in the developing world, it also means healthier soils and more habitats for birds and wildlife. \n \nThe themes for each week are as follows: \n \nWeek 1 - all things organic (gaining momentum, driving interest) \n \nWeek 2 - fresh produce (with a harvest theme, drawing in farming and seasonality) \n \nWeek 3 - organic beauty week \n \nWeek 4 - dairy and meat \n \nWeek 5 - essentials (including store-cupboard supplies) \n \nFor more information about Organic September visit www.soilassociation.org/organicseptember \n  \nDid you know? \nBy switching to organic eggs, more hens would have access to grassland and not be at risk of painful beak trimming. \nDid you know? \n\r\n    By switching to organic bacon or pork, more pigs will keep their curly tail and stay with their mother for much longer. \n  \nRead previous Your Living articles here... \n   Top", "source": "Your Healthy Living"}