{"published": "2015-09-28T13:08:13Z", "media-type": "News", "title": "Hilary Benn urges PM to 'strain every sinew' to secure UN action on IS and Syria", "id": "f82fce00-c9d0-44cf-ba54-d32aeca4ff25", "content": "David Cameron should push for \"effective action\" against Islamic State and the creation of civilian safe zones in Syria under a United Nations resolution that would leave the door open to military intervention, Hilary Benn has said. \n \r\n\t\t\r \nThe shadow foreign secretary did not set out how the safe zones would be policed but insisted he did not want to see British \"boots on the ground\". \n\r  Hilary Benn said David Cameron should push for \"effective action\" against Islamic State \r \r \nHe called on the Prime Minister to \"strain every sinew\" at a UN summit in New York to seek an agreement from world leaders that would also refer suspected war criminals to the International Criminal Court and create a post-war plan for Syria together with Gulf and neighbouring states. \n\r\n\t\t\t\r \nMr Benn failed to set out whether Labour would back air strikes against IS, also known as Isil or Daesh, in Syria with Mr Cameron expected to call a Commons vote on intervention next month - action to which leader Jeremy Corbyn remains opposed. \n\r\n\r\n\r\n\r \nAnd the shadow foreign secretary put himself at odds with Mr Corbyn by praising former prime minister Tony Blair's decision to join Nato military action in Kosovo in 1999 - an intervention which the Labour leader has criticised in the past. \n\nMr Benn told the party conference in Brighton: \"Given the scale of the crisis in Syria he (Mr Cameron) should be staying on in New York and straining every sinew to secure a comprehensive United Nations Security Council resolution under chapter seven of the UN charter calling for effective action to end threat from Isil/Daesh, the creation of safe zones in Syria to shelter those who have had to flee their homes, the referral of suspected war crimes to the International Criminal Court that a Labour government played such a big part in establishing. \n\n\"Increased humanitarian aid to those who have fled to neighbouring states, an international agreement for countries to welcome their share of Syrian refugees and a major international effort bringing together Russia, Iran, the neighbouring countries, the Gulf states, the United States of America and Europe to agree a post-civil war plan for Syria. \n\n\"It is no longer good enough for the world to say this is too difficult, it is now time for the world to say this has got to stop.\" \n\r\n\t\t\t\r \nMr Benn highlighted Labour's internationalist history and praised former PM Mr Blair's decisions to intervene in Kosovo and Sierra Leone in the Nineties. \n\nHe said: \"In our party, in our movement, we understand that our responsibilities extend beyond Britain's shores. \n\n\"From the struggle against Franco's fascism in the 1930s to the defeat of Nazi Germany. \n\n\"From the fight against apartheid in South Africa to the protection of the people of Kosovo and Sierra Leone, we have always been proud internationalists, proud to stand in solidarity with those in trouble and determined not to walk by on the other side of the road.\" \n\r\n\t\t\t\r \n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Leigh Today"}