{"published": "2015-09-04T22:14:15Z", "media-type": "News", "title": "Home Help: Pops of pattern instantly upgrade interiors", "id": "6a3db2f2-8c33-445e-924f-12bb75a7aae8", "content": "TIP OF THE WEEK No matter where you turn, pattern inspiration is all around you - from modern architecture and traditional flooring to animal furs, floral arrangements and fashion runways. As homeowners and designers look to personalize spaces and create impactful interiors, patterns are being replicated with paint on walls, floors, furniture and more. “Pattern always catches my eye and is my go-to element for adding something special to a space,” said Grace Bonney, design expert, founder of Design*Sponge and author of the best-selling book “Design*Sponge at Home.” ScotchBlue Brand partnered with Patternbank, experts in modern style and design, to analyze the world of pattern and forecast up-and-coming trends that can help take your home from boring to beautiful by adding depth, color and personality. * Striking Linework: The once simple stripe has found new life with a bold, modern twist. Sharp angles and a fractured, abstract look bring dimension to the standard stripe, and add strong visual impact to even the most awkward spaces around the home. Consider using neutral paint colors for more traditional and elegant looks or brighter colors to infuse energy into the space. * Mod Optic: Bold geometric designs are making their way into home decor with subtle shifts in scale and color. These strong three-dimensional patterns create a clean, modern style that communicates sophistication and audacity. Infuse contrast and depth to create a clean, modern backdrop for existing decor. The pattern allows you to play with a combination of light and dark colors as a way to add different levels of drama based on the space. * Geo Elemental: From north and south to east and west, global influences can be seen in architecture, interior design and on the fashion runways. Merging traditional shapes such as zigzags and diamonds with various color treatments adds a modern feel to deep-rooted tradition, creating a meeting point for contemporary and universal. The lively repetition of eye-catching, sharp lines is ideal for spaces that draw attention in one direction and evoke a strong sense of place. Using earth tones and natural colors add to the global feel of the pattern, while cool neutral colors provide a calming aura. For more inspiration and project ideas, or to download the forecast, visit ScotchBlue.com . — Family Features HOME-SELLING TIP Looking to start work on a home-improvement project that will get you the best return on investment? According to a recent Trulia survey, about 59 percent of Millennials love backyard decks. If you have the space for one in your backyard, adding one can be a big selling point for buyers. The survey also revealed that buyers prefer decks made from composite materials, as they’re easier to take care of and can handle tough weather conditions. Page 2 of 2 - — More Content Now DECORATING TIP With retro trends making a comeback in both fashion and design, modernizing retro-themed patterns energizes the home and carries a whimsical accent throughout the space. Give a nod to the stylish looks of the ’70s by building on lavish shapes with modern styling and fresh forms. The combination of high-contrast colors and the big impact of the pattern help make the space feel dynamic and lively. — Family Features GARDEN GUIDE Looking for a way to control those unsightly yellow spots caused by your dog urinating on your lawn? Keep your yard looking verdant by using a hose to spray down the areas where your dog relieves himself, or train your dog to use a non-grass-covered area in your yard. Also, it’s important to make sure your dog is drinking enough water; the more water your dog drinks, the more diluted his urine will be, and the less it will damage your yard. — More Content Now", "source": "Pratt Tribune"}