{"published": "2015-09-15T02:20:35Z", "media-type": "News", "title": "Request for Proposals: Kidney Cancer Association Young Investigator Award", "id": "eafe3e26-ae31-40b5-87cc-09ec3e53de20", "content": "Applicants are encouraged to submit an abstract for immediate consideration \n \nChicago, Ill. (PRWEB) September 14, 2015 \n\nThe Kidney Cancer Association (KCA) Young Investigator Award (YIA) provides funding to promising investigators to encourage and promote quality research in urology and clinical oncology. The purpose of this grant is to fund physicians and scientists during the transition from a fellowship program to a faculty appointment. Awards given are based on individual merit and availability of funds. \n \nThe YIA is a one-year research grant totaling $50,000, paid in two equal installments to the awardee’s institution. Applicants must have attained a post-graduate medical degree (MD, DO, or equivalent) and currently be within the last two years of his/her final subspecialty training at a US academic medical institution at the time of grant submission. Applicants should be planning an investigative career in kidney cancer. \n \nApplication information is available online and applicants are encouraged to immediately submit an abstract for consideration. \n \nAward Highlights: \n \nProvides $50,000 over a 12 month period (spanning 2 years) to young investigators for projects that are related to kidney cancer. \n \nKey Dates: \n \nRFP Date: September 15, 2015 \nAbstract deadline: October 30, 2015 \nApplication deadline: November 30, 2015 \nAward(s) announced: February, 2016 \nAward Start Date: June 1, 2016 \n \nKCA is a charitable organization made up of patients, family members, physicians, researchers, and other health professionals globally. It is the world’s first international charity dedicated specifically to the eradication of death and suffering from renal cancers. It is also by far the largest organization of its kind, with members in more than 100 countries. KCA has been awarded the Best in America Seal of Approval by Independent Charities of America. \n \nFor the original version on PRWeb visit: http://www.prweb.com/releases/KCA/young-investigator-award/prweb12957899.htm", "source": "Times Union"}