{"published": "2015-09-22T15:01:53Z", "media-type": "News", "title": "Susanna Reid's 'hot' interview with David Beckham", "id": "5353e956-8cce-43b2-8695-168106f0d4c1", "content": "Susanna Reid was left fanning herself after quizzing David Beckham about his leap into acting and his daughter's desire to become a footballer. \n \r\n\t\t\r \nGrinning throughout the interview for Good Morning Britain, Reid sat back in her seat and joked that it was \"hot\" under the lights, prompting the star to compliment her dress. \n\r  Good Morning Britain presenter Susanna Reid interviewing David Beckham. (Picture: ITV) \r \r \nGiggling after the segment, she told co-presenter Kate Garraway she now considers the father of four a \"friend\". \n\r\n\t\t\t\r \nThe footballer turned model was being interviewed by Reid about his new role in a short film for motorcycle clothing brand Belstaff when she commented on the heat from the studio lights. \n\r\n\r\n\r\n\r \n\"It's blinking hot under these lights, isn't it?\" said Reid as she fanned herself. \n\nBeckham replied: \"It's very hot. I'm surprised, you've got an amazing dress on and I'm in a t-shirt.\" \n\r  Susanna Reid was interviewing David Beckham on Good Morning Britain \r \r \n\"I should have worn the t-shirt,\" Reid said back. \n\nAs they returned to the studio, Garraway seemed envious of the exchange. \n\r\n\t\t\t\r \n\"What? The room was hot? You've got an amazing dress? Hang on a minute,\" she said. \n\nReid said that she had met Beckham before and \"I consider him a friend now\", before explaining her fashion choice. \n\n\"His wife is obviously doing these amazing dresses all the time, I thought I better wear something befitting the occasion when you're interviewing a fashion icon,\" Reid said. \n\nGarraway incredulously replied: \"You were nothing but professional but I'm weirdly still bitter.\" \n\r\n\t\t\t\r \nDuring the interview, the world's most famous number seven ruled himself out of being the next 007. \n\nWhen Reid mentioned that his name had been floating around as a possibility for the next James Bond, he responded: \"No, I have definitely not been contacted, I am definitely not - obviously - up for doing something like that, but it is nice to be linked, I suppose.\" \n\nWearing a figure-hugging orange dress, Reid then asked the former England captain if he could do a \"Sean Connery\" voice, to which he replied: \"No.\" \n\nWhen the footballer then tried to imitate Roger Moore's distinctive eyebrow action, she gushed: \"It is like being in the room with him.\" \n\nBeckham was also asked about wife Victoria, describing daughter Harper's desire to be a footballer as a \"dagger through the heart\", but the doting father said he loved the news. \n\r\n\t\t\t\r \nHe proudly stated: \"It was the best thing I had ever heard.\" \n\nSocial media users took to Twitter to express their jealously of Reid's interview. Michelle Loughran posted: \"David Beckham just told Susanna Reid she had a nice dress on.... One hell of a perk to the daybreak job!\" \n\nBut one user accused her of flirting with the former footballer. \"You're a terrible flirt #itshotinhere #Ishouldhavewornatshirt,\" he tweeted. \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Newmarket Journal"}