{"published": "2015-09-23T20:33:17Z", "media-type": "News", "title": "NYPD ready for potential attacks ahead of papal visit", "id": "14d9cb14-588a-44be-b137-4159d3008e14", "content": "WASHINGTON (CNN) – A police threat assessment produced for the U.S. visit of Pope Francis discusses the risk of possible attacks against large crowds and churches vulnerable to attack even if terrorists can’t get near the Pope. \n\nThe New York City Police Department’s threat assessment, obtained by CNN, is based on “open source” information and is part of a larger document produced by the police departments in the three cities the Pope will visit in his U.S. tour: Washington, New York City and Philadelphia. \n\n“While most of the events will have limited access due to the need for people to obtain a ticket or invitation in order to attend, large crowds congregating outside event locations and using public transportation can be attractive targets for individuals and groups looking to carry out attacks,” the NYPD assessment says. “And even if the Pope is well protected, these crowds may be vulnerable to a group or individual seeking to capitalize on the high level of attention that the city will be receiving.” \n\nThe NYPD said there are currently no reports indicating a “known threat” to Pope Francis during his visit to New York City. \n\nHowever, the document says, “In addition to directly targeting the Pope, terrorists may choose to attack houses of worship in other parts of the city or to target other religious figures while the Pope is in New York. Such an attack would allow terrorists to capitalize on the increased media presence in the city and game a significant amount of attention while avoiding areas of high security.” \n\nThe police document mirrors similar assessments by the FBI and U.S. intelligence that note the possible risk to papal security, but found no known threat against his visit. \n\n“It went back through every attempt on every pope’s life, going back to the late ’70s, not because we have specific information on the threat, but because we wanted to remind everybody on these details in all three cities about the way these things have happened in the past, the different ways they have been put together,” the NYPD’s head of counterterrorism, John Miller, told CBS on Tuesday. \n\nThe 15-page document lists groups that have expressed support for an attack on the pope. \n\nThese include ISIS, which has encouraged lone wolf attacks, al Qaeda and other groups, and the Italian mafia. The report also mentions right-wing groups upset at the pope’s statements on economic inequality, environmentalism and homosexuality. \n\n“Such stances could draw the ire of right-wing groups within the United States that are displeased with the direction that Pope Francis is taking the Church,” the NYPD report said. \n\nThe report also mentions threats from white supremacists who have used websites and other media to attack the pope as the antichrist. \n\n“Though no threats were ascertained from these websites, a member of this community may seek to attack an individual that he or she believes to be evil,” the NYPD report says.", "source": "KCMO Talk Radio"}