{"published": "2015-09-28T05:00:00Z", "media-type": "News", "title": "Tips to Keep Your Child with Diabetes Safe at School", "id": "46fb6a96-2e33-4a52-bcf8-44d5a0fe7c70", "content": "( Family Features ) Diabetes is one of the most common chronic diseases in children, according to Griffin P. Rodgers, MD, MACP, director of the National Institute of Diabetes and Digestive and Kidney Diseases of the National Institutes of Health (NIH). Keeping children with diabetes safe during the school day and during school-sponsored activities requires communication and cooperation between the student, their parents or caregivers, the student’s health care team and school staff. \n  \n“Nobody knows your child’s day-to-day needs and how to respond to a diabetes emergency better than you,” Rodgers says. “That’s why it is so important to maintain open communication with school staff throughout the school year.” \n  \nParents and school personnel can learn about effective ways to help keep children with diabetes safe by reviewing the National Diabetes Education Program’s (NDEP) Helping the Student with Diabetes Succeed: A Guide for School Personnel. The NDEP is a program of the National Institutes of Health and the Centers for Disease Control and Prevention. \n \nThe NDEP encourages parents of children with diabetes to follow these tips from the School Guide throughout the year. \n Take action. Notify the school immediately when your child is diagnosed with diabetes. Share your child’s medical information with school staff and provide up-to-date emergency contact numbers. Work with your child’s health care team to develop a Diabetes Medical Management Plan. This plan contains the medical orders for your child. It should be signed by your child’s health care team and submitted to the school nurse at the start of each school year. An updated plan is needed if there are changes in your child’s diabetes care plan during the year. A sample plan is included in NDEP’s School Guide . Meet with the school nurse to review your child’s school health care plans. The school nurse will use the medical orders to prepare your child’s routine and emergency diabetes care plans at school. You can find samples of these plans in the School Guide . You should also meet with the school nurse and staff to familiarize them with any specialized diabetes equipment that your child uses, such as an insulin (IN-suh-lin) pump and/or continuous glucose monitor (CGM). Remember to provide written instructions about the use of the equipment and troubleshooting guidelines. Provide the school with all supplies, medicines, and items needed to carry out your child’s health care and emergency plans. These supplies may include blood sugar (glucose) testing items, supplies for taking insulin, urine and blood ketone testing, snacks, quick-acting glucose products, and a glucagon (GLOO-kuh-gon) kit. \nFor more information about keeping children with diabetes safe at school and to download or order a free copy of NDEP’s Helping the Student with Diabetes Succeed: A Guide for School Personnel , call 1-888-693-NDEP (1-888-693-6337), TTY: 1-866-569-1162 or visit ndep.nih.gov . \n \nArticle courtesy of: Griffin P. Rodgers, MD, MACP, Director, National Institute of Diabetes and Digestive and Kidney Diseases.", "source": "YourValleyVoice.com"}