{"published": "2015-09-09T22:28:16Z", "media-type": "News", "title": "Editor's Note: Times exciting for Alameda; we need to remember road rules", "id": "51dde24d-5bd4-490e-8b9f-58f5b57166a9", "content": "First off, this editor's note is long-overdue. Between deadlines, talking, emailing and texting writers, photographers and other contributors, as well as discussing and planning potential stories and meeting the public, I never seem to have the time. \n  \nBut there have been some recent news developments in Alameda that have encouraged me to write. It was a real treat to see Angela's restaurant finally reopen this past week on north Park Street to a packed crowd -- and seeing passers-by and the curious stopping by the new place to look inside to see what all the activity was about. \n  \nThe reopening of Angela's restaurant represents not only a rebirth but a redemption for owner Saboor Zafari and his family. Angela's had been set to open a year ago -- but three days before the scheduled opening it was gutted in a suspected arson fire across the street on Park. \n  \n\"The community has been amazingly wonderful,\" Zafari told the Alameda Journal's Peter Hegarty in an Aug. 21 article. \"I go for walks, and people stop me and ask how I am doing. They ask if they can help and want to know when the restaurant will open. It means a lot to me.\" \n \n\r\r \n  \nNow, Angela's joins a growing list of new eateries lining the north Park Street area, including Smashburger, KauKau Corner, Thai Noodle House and Crispian Bakery, along with what's already at the Marketplace. It's nice to see this part of Park Street full of activity, especially during the weekends and nights. \n  \nThis bustle of activity is being played out increasingly throughout Alameda -- on lower Park Street, in the new places in Alameda Landing (Cream, The Habit Grill, Spin!Neapolitan Pizza) as well as the popular Rock Wall Winery and Faction Brewing on the former Naval base. And, this Sunday, Webster Street is hoping to join the mix with the new Blues, Brews & BBQ Festival at the US Bank parking lot. \n  \nHiroko Cooper, a co-founder of the West End Arts & Entertainment District which is partnering with the West Alameda Business Association to host the event, tells Janet Levaux in an Alameda Journal article this week: \"Everyone is looking forward to this, and it should be really new and different. All the volunteers have been so supportive. The community is really helping and pitching in, which is very heartwarming.\" \n  \nAll of this activity brings an air of excitement and fun to Alameda -- and all these events are positives for the Island. \n  \nBut this activity, especially on weekends and holidays, brings increased traffic, congestion and gridlock -- and increases the risk of accidents and, tragically, fatalities. As much as we'd like to go back in time, when we didn't have as much traffic, crowds or congestion, we can't. \n  \nBut we can do something about speeding on streets. And pedestrians can help by not crossing the street against the light or in oncoming traffic. \n  \nOn Labor Day, Alameda blues musician Augusta Lee Collins, 69, was struck and killed by a truck on southbound Constitution Way at about noon. Collins was walking in a crosswalk and had almost reached the sidewalk when he was hit by the truck in the far right-hand lane on the opposite side of the street of the Marina Village Shopping Center, said Alameda police Lt. Ron Simmons. \n  \nPolice were interviewing witnesses to try to determine whether the pedestrian or the truck driver had the green light when the accident occurred. And police said it didn't appear that either drugs or alcohol played a part in this tragic accident. \n  \nI don't know the details about what exactly happened, but I'm saddened by the fact that someone was killed on our streets. Collins was scheduled to perform at Sunday's Blues, Brews & BBQ Festival. \n  \nWe as drivers and pedestrians need to remember that we share the roads -- and we need to remember the tragic consequences when we ignore the rules of the road. \n  \nJon Kawamoto is the editor of the Alameda Journal. He can be reached at jkawamoto @bayareanewsgroup.com .", "source": "Monterey Herald"}