{"published": "2015-09-17T21:53:00Z", "media-type": "News", "title": "Bentley says he'll 'help his friends' who supported budget", "id": "93b0075c-6d9a-46b6-a964-a5eec2be7415", "content": "HUNSTVILLE, AL (WAFF) - \n\nMinutes before Bentley signing the budget he told reporters he's going to go out of his way to support those who voted yes.\n\nBut where does that leave four North Alabama districts whose state senators openly opposed raising your taxes?\n\n“They may need something in their district,” said Bentley. “I'm just saying we help our friends.\"\n\nStrong words from Governor Robert Bentley minutes before he signed off on the 2016 budget. The Governor didn’t hold back his feelings for those who supported it.\n\n\"I'm just saying that we are going to go out of our way to help our friends who are helping the people of Alabama,\" said Bentley. \n\nPresumably not on that friend's list, ‘The group of 9’ Alabama State Senators, four of which from North Alabama. They include Paul Bussman of Cullman, Bill Holtzclaw of Madison, Paul Sanford of Huntsville, and Clay Scofield of Arab. All nine voted against raising taxes. \"I think it would be very unwise to punish the people of the ninth district because their state senator made a principled stand for long term budget reforms,\" said Senator Scofield. \n\nScofield told us he voiced his concerns about the budget to Bentley's staff throughout the process so his vote shouldn't have surprised anyone.\n\nSenator Holtzclaw is no stranger to controversy with Governor Bentley. Earlier this year, Holtzclaw took out a billboard criticizing Bentley's tax plan. The Alabama Department of Transportation then pulled millions of dollars in road funds away from Holtzclaw's district. Here's how the governor defended his actions on February 27.\n\n\"We have serious problems in this state. And for a state Senator to be critical of solutions to a problem that truly exists before he has even seen any of the solutions is irresponsible. And the people of Alabama deserve better than that,\" said Bentley.\n\nHoltzclaw fired back at the Governor days later.\n\n\"It is unimaginable that these projects would be suspended in retaliation for me informing constituents of my position,\" said Holtzclaw in March. Bentley did tell reporters on Thursday he's not saying he's going to hurt anyone. What that means for the people in those nine districts remains to be seen.\n\nCopyright 2015 WAFF. All rights reserved. \n\nReport an Error", "source": "WFXG FOX 54"}