{"published": "2015-09-16T18:10:01Z", "media-type": "News", "title": "‘Bohemia’: Antonín Dvorak like you’ve never seen him, at Cafe Nordo’s Culinarium Updated 4:40 pm", "id": "b7bb9e6f-c6b3-4bb8-9ac6-c215842243bd", "content": "From midriff-baring fairy cocktail waitresses, to succulent goulash, to flirty burlesque acts, classical music interludes, cameos by various 19th-century artistes and a ritualized serving of absinthe (the potent green liquor dubbed “the green fairy”), the new cabaret show “Bohemia” is in a realm of its own. \n \nAs veterans of Cafe Nordo shows, “Bohemia” co-creators and performers Mark Siano and Opal Peachey certainly know their way around whimsical foodie theater. (“Bohemia” is performed at Nordo’s Culinarium, in Pioneer Square .) And given their previous piece, “Seattle Vice,” they have experience evoking bygone eras with music, humor and booze. \n \nBut “Seattle Vice” was set in the familiar era of the mid-1960s, amid Emerald City gangsters and crooked coppers. “Bohemia” shuttles between different periods of the 19th century, between Paris and Prague, and between such notables as Polish composer Chopin, and Czech turn-of-the-century art nouveau artist Mucha. \n  Cabaret Review  ‘Bohemia’  \nBy Opal Peachey and Mark Siano. Through Sept. 27, at Nordo’s Culinarium, 109 S. Main St., Seattle. Tickets are $25-$80, depending on whether cocktails and/or dinner are included; (800-838-3006 or brownpapertickets.com) \n    \nThe central persona in this diverting, atmospheric whimsy bubble is another famous Czech, Antonín Dvorak (Siano). \n Most Read Stories Marshawn Lynch's mom to Seahawks: Fire offensive coordinator Darrell Bevell Union suspends strike; school to start Thursday in Seattle Seattle police chief fires cop who arrested man carrying golf club So what happens now with Seahawks' Kam Chancellor? Boeing starts final assembly of its first 737 MAX Unlimited Digital Access.  $1 for 4 weeks. \nSmarting over a nasty review in a Prague newspaper for one of his compositions, and lacking inspiration for his ninth symphony, Dvorak goes on an absinthe binge. \n \nIn a hallucinatory haze he communes with the ghosts of artists past and present. The lusty sprites who’ve been fetching your drinks are transformed into Dvorak’s fairy posse. They dance, do supple acrobatics with emerald silk drapes, pose suggestively. \n \nSticklers for historical accuracy beware: the real Dvorak was a religiously pious family man, whose big indulgence was raising pigeons. And he wrote his best known work, Symphony No. 9 in E Minor (aka the New World Symphony) while living in the U.S. and (presumably) without any poetic mentoring from Frédéric Chopin (Peachey). \n \nAnd maybe the world-renowned actress Sarah Bernhardt (Cherry Manhattan) did perform a deliciously histrionic striptease for Mucha, as he painted her portrait. Somehow, I doubt it. \n \nSo take “Bohemia” as both a freewheeling spoof of and ode to artistic romanticism. And on those grounds, it’s a beguiling, mildly naughty and well-provisioned evening. \n \nThe cast is impressive, with all doing double (or triple) duty. Beside scripting, Siano and Peachey ably composed the music that isn’t by Chopin, Dvorak and Debussy, including a robust drinking song (“Nazdravi”). \n  \nFavorite number: the clever “My Girl George.” In man’s suit and top hat, Peachey’s saucy Chopin duets with his cross-dressing (real-life) lover, novelist George Sand (Annastasia Workman). Then the fairies turn up in male garb to waltz along. \n \nPeachey and Siano are both proficient pianists and singers, and other instrumentalists pitch in. You marvel at the quick-change efficiency of the fluttering fairies. (Don’t forget to tip them.) And some of the costumes, by Montana Tippett with others, are resplendent. \n \nIt’s a lengthy show, with space for appetizers, drinks and goulash. And it could do with better jokes about Bohemia the place vs. bohemians, and rather less blather about art with a capitol “A” and inspiration with a capitol “I.” \n \nAs for the absinthe, do partake in the ritual if you can handle the ultra-intense taste of anise and the 136 proof kick. (You can also sip it in a less ferocious cocktail.) \n   \nAny production that has an absinthe consultant gets a badge for uniqueness. As the Czech toast goes, “Na zdravi!”", "source": "Seattle Times"}