{"published": "2015-09-16T20:30:51Z", "media-type": "News", "title": "Congressional Conservatives Fiscally Responsible In Name Only", "id": "0882d737-c104-4828-aa50-7a40595d8a24", "content": "When did giving states a blank check for federal dollars become a principle of conservative Democrats and Republicans?  It's a question with no clear answers as the bills reauthorizing the Elementary and Secondary Education Act (ESEA) passed the House and Senate before the summer recess with weak to no accountability for improved student outcomes.  Conservatives have long worn the badge of fiscal responsibility, but their rhetoric falls short when it comes to education. \n\nCongress is back in session and one of the first orders of business is the reauthorization of ESEA.  Up for debate will be how to bring two conflicting visions for education into one bill that can pass congressional muster and be signed into law.  All eyes will be on the Congress and the White House to ensure that the necessary changes are made to the existing proposals.  The most important change needed is to hold states accountable to measurably improve education outcomes and require them to take action when students are not achieving. \n\nThe House narrowly passed H.R. 5 without Democratic support. This bill known as the \"Student Success Act\" goes too far to the extreme.  States have the discretion to use taxpayer dollars however they like in whatever schools they identify for intervention based on their own accountability systems. Sounds great for the state, but not for the tax payer.  It strips away any oversight for how federal funds are used when schools and their students are not succeeding.  Accountability is a fundamentally conservative value - since when are fiscal conservatives comfortable with giving money away with no expectation of anything in return? \n\nThe Senate bill, S. 1177, known as the \"Every Child Achieves Act,\" (ECAA) is marginally better.  It requires the same level of transparency as current law that allows educators, parents and stakeholders to know how students are doing.  The bill also requires states to place a greater emphasis on academic indicators of success to identify schools in need of improvement.  But like the House bill, ECAA lacks explicit language requiring states to act once the state has identified that a school and its students are failing to achieve.  This is unacceptable - transparency without action is simply not enough. \n\nESEA was enacted 50 years ago to ensure that students from low income and underrepresented communities had an equal shot at a quality education.  And tax payer dollars would be the means to level the playing field.  In today's parlance, that means not just providing students with access to opportunity, but assuming the responsibility to intervene and act when students are failing to meet academic benchmarks of success.  Fifty years ago a lack of accountability saw taxpayer dollars building swimming pools, installing toilets and providing a homemaking program for girls in an all-black school.  This was not the \"equality\" envisioned by the framers of the law; but the blank check being pushed by conservatives in the name of \"local flexibility\" may very well lead us back there. \n\nLast year, approximately $14 billion dollars of Title I funds were provided to schools to improve achievement and promote success among our most vulnerable students. In exchange for receiving billions of dollars in federal funds, states should agree to put in place protections to make sure these funds are being used to support students and improve achievement.  When states aren't required to institute critical safeguards - such as the requirement to act when students are not succeeding - are they being held accountable to the taxpayer who expects certain outcomes?  I don't believe they are and we deserve far better from our elected officials. \n\nConservative Republicans and Democrats will need to take a hard look in the mirror.  If they accept ESEA legislation without meaningful accountability, it will hurt our most vulnerable populations.  Groups like Latinos, African-Americans and students with disabilities will be disproportionately affected.  Civil rights and educational organizations, members of both parties, and independents, all agreed that we must include language that holds our states accountable for the achievement of all of our students.  To do anything less is a gross misuse of our tax dollars in education. \n\nAlbert Jacquez \nNCLR Action Fund \nDeputy Executive Director", "source": "Huffington Post"}