{"published": "2015-09-16T13:07:29Z", "media-type": "Blog", "title": "Soda industry deserves its bad rap", "id": "ce216f46-ea3f-4d9b-a8ff-097949258bb6", "content": "Froma Harrop, in her Aug. 25 column, “Sticking Up for Coke, Sort Of,” asks the question, “why is sugar taking so much of the rap?” The “rap” refers to a New York Times editorial critical of Coke’s claim that sensible soda consumption is OK if people exercise. \n \nShe argues that Coke is maligned due to “suspicion of the profit motive, “hysteria” over sodas drummed up by celebrities and Dr. Mark Hyman (whoever he is). Furthermore, Coke precedes the obesity epidemic. Harrop also argues that the proposed soda taxes penalize the poor. \n \nHer arguments are specious. If Harrop thinks Coke is maligned, the intelligent response is to establish that sodas are not associated with obesity or diabetes and, therefore, Coke is undeserving of criticism. \nThis point, however, really cannot be made. \n \n“Sugary Drinks and Obesity Fact Sheet” (Harvard T.H. Chan School of Public Health) cites the cumulative evidence published in highly regarded academic journals linking the consumption of one can of soda per day to obesity, diabetes and heart disease. It notes the aggressive advertising of sodas to children, the biased findings of industry funded research and the bloating of soda bottles from 6.5 ounces in 1950 to 42 ounces in 2011. \n \nMore recently, the association of sugary drinks to diabetes was found even in normal weight persons (British Medical Journal, July 21, 2015). So much for exercising off a can of Coke. \n \nThe profit motive is a straw man. No one holds Bill Gates or George Lucas in contempt. But then, they enrich our lives. It is profits made at the expense of public good that is despicable. \n \nAnalogous to cigarette taxes suppressing sales, so, too, we can limit soda consumption with a few pennies added to a drink. Recognize that sodas, themselves, tax us. They are a drain on the health of the population at large and on low-income groups in particular. And we paid an estimated $190 billion in medical costs for obesity-related diseases in 2005 (Harvard Obesity Prevention Source). \n \nFor marketing something as innocent as sugar until it becomes a health hazard, the soda industry indeed deserves all our criticism and disdain. \n \nMary M. Zhu, M.D., M.P.H. \n \nDavis", "source": "Davis Enterprise"}