{"published": "2015-09-04T15:00:54Z", "media-type": "Blog", "title": "Kitchen Garden Photos & A Christmas Chutney Recipe", "id": "768599f1-f76e-4e13-aad6-290312bfd0aa", "content": "I thought I would start my blog post by showing you a wonderful sand sculpture I came across this week outside the 'Richard III' visitors centre in Leicester.  Apparently it took a lady called Susanne Ruseler just seven days to create it.....what a talented lady!  I think it is wonderful and I found it purely by accident as I walked past:\n\n.\nThis week in my kitchen garden:\n.\nThis week I turned my attention to sowing some winter seeds.\n \nI sowed mizuna, winter lettuce, winter purslane, winter spring onions and corn salad.  I am a tiny bit late sowing these seeds, but hopefully they will be fine.\nAt the moment they are in my mini greenhouse, as I am trying desperately to keep the squirrels from them.  The squirrels are becoming a nuisence in my garden at the moment, as they keep digging holes to bury the monkey nuts that one of my neighbours insists on feeding them....it also sends Judy (my rescue dog) into a mad barking session each time they come in the garden, so I really need to think about this problem and come up with a solution.\nBut for now I have used some chicken wire to try and keep them away from my seeds:\n\n.\nAlso this week I noticed the ’60 day’ raab that I sowed three weeks ago was ready to 'thin out'.  I used scissors as normal to cut away the seedlings that I didn't want (this stops any root disturbance for the remaining seedlings).  I will need to thin them again at a later date, but for now I left plenty of them in case the slugs and snails decide to have a feast on some of them:\n \nI have continued to harvest runner beans, tomatoes, beetroot, salads, spring onions and curly kale this week too:\n  \n....And I noticed that my sweetcorn has really had a growth spurt and will soon be ready too:\n\n\"Sweetcorn is ready to pick when the tassels at the end of the cobs turn brown and when you press your nail into a kernel the liquid comes out is milky\"\n.\nThe phacelia that a sowed a few weeks ago is growing nicely now.  I won't thin the seedlings out as it is a green manure that I want to grow thickly to keep the weeds from germinating:\n\nI will chop down the phacelia before it sets seed and then dig it into the soil to add nutrients ready for next year's crops.\n.\nThe rest of the kitchen garden is doing well too and I thought I would be nice to show you some photos that I took this week:\n\n       \n \n.\n.\nThis week in the home...\n.\nThis week has been a very busy week here in my kitchen:\nI started by making some more dishwasher liquid as I had ran out.  I make it using soapnuts and it works really well in our dishwasher and it is really easy to make:\n \n.\nI also made a big portion of spaghetti bolognaise.  We had some for tea and then I managed to freeze four portions.  I always 'pad out' my spaghetti bolognaises with whatever vegetables I have to hand, so this one had carrot, runner beans and curly kale included in it.  I find the portions go further if I mix the spaghetti (or pasta) in with the sauce rather than layering the sauce on top:\n\n.\nI then had a freezer disaster to sort out:\nI don't know if you remember, but a couple of weeks ago our small chest freezer broke and myself and my daughter had a mamouth cooking session to save the large quantity of vegetables that were in this freezer.\nUnfortunately this week I had another 'freezer disaster'.... the door of one of my other freezers was left open by accident.  Luckily again, there was no meat in this freezer as it was mainly full of allotment fruit, homemade cakes, scones and my bread rolls for the week ahead.\n\nI had been waiting for a spare few hours to make jams with the fruit that was left in my freezer, ready for my Christmas hampers, however this forced me to make them now instead of later.  So I spent a couple of days cooking yellow plum jam, gooseberry jam, strawberry jam and finally some plum and worcesterberry jelly....\n   \nOn the positive side, nothing was wasted again and this has created a lot more room in my second freezer, though I am sad to say I now have no fruit or vegetables left from my old allotments......so I must work out how to grow even more fruit and vegetables in my new kitchen garden next year!\n.\nBeetroot from my new kittchen garden:\n \nThis week I also wanted to use up the beetroot and apples that I was given last week (together with my own beetroot), so I made some beetroot chutney:\n \n.\n......And I also wanted to use the remaining plums that I was given last week, so I made some 'Christmas Chutney' which uses cranberries and plums and a few lovely 'christmas' spices.  I have written the recipe below if anyone is interested.\n  We will use some of the preserves that I have made, but a lot of them will be given at Christmas in the hampers that I make.\n.\nChristmas Chutney With Cranberries & Plums\n.\n500 grams courgettes chopped\n500 grams plums halved with stones removed\n400 grams granulated sugar\n300 grams dried cranberries\n600ml white wine vinegar\n2 onions chopped small\n1 tsp ground ginger\n1 tsp ground cinnamon\n1 tsp ground mixed spice\n1 tsp salt\n.\nAdd all the ingredients except the sugar to a large pan and bring it to the boil stirring all the time. Reduce the heat and simmer for 15 minutes stirring occasionally.\n\nAdd the sugar and stir until it has dissolved and then simmer for a couple of hours or so, until the chutney is thick and chutney like.\n\nPour the chutney into sterilised jars and store in a cool dark place for a minimum of three months to mature.\n\nThen enjoy it with cold meats and sandwiches at Christmas!\n\n\n.\nThank you for reading my blog today.  I will be back next Friday as usual.\nHave a good week!", "source": "not just greenfingers"}