{"published": "2015-09-05T07:42:11Z", "media-type": "News", "title": "Needy Minnesotans scramble after state cancels health benefits", "id": "4a8a26ce-4d84-4e12-98d0-6d78cf65072a", "content": "Ongoing cleanup forces Second City to cancel move more shows  \nDaily Herald - Friday 4th September, 2015 \n \nCOURTESY OF ABC 7An Aug. 26 grease fire that started inside the kitchen of Adobo Grill restaurant in the 1600 block of N. Wells St., Chicago, forced the cancellation and relocation of Second City  ... \n   Dist. 211s new Higgins center will house most special ed classes  \nDaily Herald - Friday 4th September, 2015 \n \nMark Kovack, left, associate superintendent for student services, gives a tour to Neal Takiff of Witted, Takiff and Hansen during the open house Thursday for District 211's Higgins Educational  ... \n   Riopell Dold says 2016 will be different better year for him than 2012  \nDaily Herald - Friday 4th September, 2015 \n \nU.S. Rep. Bob Dold is up for re-election in a presidential year -- just like in 2012 when the Kenilworth Republican lost after his freshman term in Congress. But he argues 2016 will be different.  ... \n   Images APs best Baby gorilla gay marriage in KY  \nDaily Herald - Friday 4th September, 2015 \n \nAnju, a Western Lowland Gorilla, holds her week-old newborn in the Gorilla World habitat at the Cincinnati Zoo & Botanical Garden, Thursday, Sept. 3, 2015, in Cincinnati. The baby, who has yet  ... \n   Lombard dermatologist faces jail time for defrauding Medicare others  \nChicago Tribune - Friday 4th September, 2015 \n \nRobert V. Kobulsz, who operates a dermatology clinic in Lombard, has been sentenced to seven years in federal prison. (Annemarie Mannion / Chicago  ... \n   Zangari adjusting to switch from mound to first  \nChicago White Sox - Friday 4th September, 2015 \n \nGLENDALE, Ariz. -- Doug Weese doesn't believe in labeling young kids as \"can't-miss\" or \"sure-fire\" prospects, but when Corey Zangari joined the Oklahoma Outlaws, Weese  ... \n   Chicago Marked Deadliest Day in More Than a Decade  \nNBC News - Friday 4th September, 2015 \n \n• Dan Rance, 23, was outside about 11:35 p.m. in the 700 block of North Long when someone walked up and opened fire, Chicago Police and the Cook County medical examiner’s office said.  ... \n   Chicago to offer ticket tax amnesty program  \nChicago Tribune - Friday 4th September, 2015 \n \nMayor Rahm Emanuel listens to members of the audience during a public hearing on the city budget at Wright College on Sept. 3, 2015. (Armando L. Sanchez / Chicago  ... \n   49ers cut veteran lineman Darnell Dockett  \nABC7 - Friday 4th September, 2015 \n \nDarnell Dockett on Friday, according to ESPN sources and multiple media reports.Dockett, who signed with the 49ers as a free agent after missing all of last season with a torn ACL, did not play in  ... \n   Roger Goodell wants focus on opener in Foxborough league says  \nABC7 - Friday 4th September, 2015 \n \nPublic enemy No. 1 in New England won't be in Foxborough for the NFL's season opener next week.Commissioner Roger Goodell, whose handling of the Deflategate case has drawn scorn  ... \n   Drone video shows hiker get swept off Hawaiian waterfall in flash flood  \nABC7 - Friday 4th September, 2015 \n \nEAST MAUI, Hawaii -- Video taken by a drone in Hawaii shows the incredible dangers of flash flooding.Six friends were hiking in East Maui last week when rapidly rising waters of the  ... \n   Tortoise and OHare Animal rescued while walking along road near airport  \nABC7 - Friday 4th September, 2015 \n \nCHICAGO (WLS) -- Harvey the tortoise is once again safe thanks to Chicago police after he was discovered walking along a road near O'Hare International Airport.Police were called and Harvey,  ... \n   Judge tosses lawsuit against Downers Grove sperm bank over biracial child  \nABC7 - Friday 4th September, 2015 \n \nChicago Tribune reports Judge Ronald Sutter tossed the lawsuit Thursday. But ruled Jennifer Cramblett could refile her lawsuit against Midwest Sperm Bank under a negligence  ... \n   Dad turns leftover restaurant crayons into smiles at childrens hospitals  \nABC7 - Friday 4th September, 2015 \n \nThe Crayon Initiative collects unused crayons donated and molds them into special crayons for patients in children's hospitals. (The Crayon Initiative/Facebook)   ... \n   Boeing releases plans for worlds largest twin-engine jetliner  \nABC7 - Friday 4th September, 2015 \n \nCHICAGO (WLS) -- Chicago-based Boeing has released artist's renderings for their planned Boeing 777-9X, which is expected to be the world's largest twin-engine jetliner.The plane will have  ... \n   Nats Bryce Harper records 4 walks scores 4 runs without swinging  \nABC7 - Friday 4th September, 2015 \n \nAtlanta Braves .Harper, batting third and playing center field, saw 20 pitches and didn't swing once, drawing four walks. He became the second player in the majors this season to have multiple  ... \n   Man donated blood in Gary knew he was HIV positive police say  \nABC7 - Friday 4th September, 2015 \n \nGARY, Ind. (WLS) -- A man was charged after police said he sold his blood plasma to a company in Gary, Indiana, knowing he was HIV positive.Gary police said Wilfred Campbell Jr. had documented  ... \n   With clerk jailed gay Kentucky couple gets marriage license  \nABC7 - Friday 4th September, 2015 \n \nMOREHEAD, Ky. -- A gay couple emerged from a Kentucky county clerk's office with a marriage license in hand Friday morning, embracing and crying as the defiant clerk who runs the office  ... \n   Arne Duncan returns to Chicago for peace march  \nABC7 - Friday 4th September, 2015 \n \nEducation Secretary Arne Duncan speaks at the National Forum on Youth Violence Prevention in May 2015 in Virginia. (Jacquelyn Martin, File)   ... \n   2 charged in Uptown fatal shooting  \nABC7 - Friday 4th September, 2015 \n \nCHICAGO (WLS) -- Two men have been charged in a fatal Uptown shooting on Wednesday, Chicago police said.Michael Laster, 28, and Jonathan Thompson, 33, both of Chicago, both face two counts of  ...", "source": "Chicago News.Net"}