{"published": "2015-09-11T03:15:02Z", "media-type": "News", "title": "HONORING BUSINESS LEADERS IN THE ASIAN COMMUNITY", "id": "53472138-9739-4973-9d52-0d4919e44a13", "content": "Announcing Asian Business Association's 39th Annual Awards Banquet presented by TOYOTA.    Asian Business Association Gala Banquet   FOR IMMEDIATE RELEASE. \n\r \nSeptember 10, 2015 \n\r \n\nFor more information, please contact: Asian Business Association\n\r \n\nEmail: info@abala.org \r \n\nTel: (213) 628-1222 LOS ANGELES, CA - Each year, the Asian Business Association (ABA) honors leaders in the Asian American business community. The ABA also recognizes corporations who consistently support the Asian business community and provide opportunities for Asian American entrepreneurs to flourish.\n\r \n\nThis year, the Asian Business Association 39th Annual Awards Banquet will be held at the Globe Theatre in Universal Studios Hollywood on Tuesday, October 6, 2015 at 6:00 pm. Ms. Mei Melancon, actor, writer and producer and Mr. James Kyson, actor, outdoorsman, and philanthropist will be the emcees for the evening. Hundreds will gather to pay tribute to the significant and often unheralded contributions that Asian Americans are making in business and the Southern California economy.\n\r \n  \r \nHonoring: \n\r \nBUSINESS ENTERPRISE OF THE YEAR\n\r \n\nCJ America, Inc.\n\r \n\nMEDIA COMPANY OF THE YEAR\n\r \n\nWong Fu Productions\n\r \n\nABA CHAIRPERSON AWARD\n\r \n\nHonorable David E. Ryu, L.A. Councilmember 4th District\n\r \n\nCORPORATION OF THE YEAR\n\r \n\nU.S. Bank\n\r \n\nADVOCATE OF THE YEAR\n\r \n\nRichard Chacon, Union Bank\n\r \n\n“The Asian Business Association has a strong commitment to helping diverse Asian-Americans. Not only are they making a difference in business locally but also impacting the community and our great economy,\" said awards banquet co-chairs Karen Park of TEN Advertising and Harry Kim of SagePoint Financial.\n\r \n\n\"We selected these individuals and organizations because of their business success and their contributions to our economy.\" said Dennis J. Huang, ABA Executive Director and CEO. \"We're grateful also to our sponsors this year for supporting the important work we're doing in the community.\"\n\r \n\nSponsors include: Toyota, Union Bank, Southern California Edison, AEG, U.S. Bank, Northrop Grumman, Southern California Gas Co., Herman Miller, Butter Ventures LLC, The Walt Disney Company, to name a few.\n\r \n\nAbout the Asian Business Association:\n\r \n\nThe Asian Business Association (ABA) was founded in 1976 to proactively help Asian Americans gain access to economic opportunities and advancement. With more than 700 members, ABA promotes economic development through its educational conferences, seminars, and workshops. These interactive programs are designed to present entrepreneurs with the information, resources, skill-sets, and networking opportunities that they will need to help grow their businesses and successfully compete in the global marketplace. \n\r \n\n# # #", "source": "PR inside"}