{"published": "2015-09-09T13:05:49Z", "media-type": "News", "title": "How today's Sports Direct AGM vote breaks down", "id": "f2de265e-bdbc-416a-a422-b8c159b1b7be", "content": "Dickension protesters at the back, you can stop demonstrating now.  \nThe votes have been cast and every resolution put forward at Sports Direct's AGM today has been passed. You could go as far as to say with flying colours. Which will come as a surprise to very few people given that founder Mike Ashley owns 55 per cent of the company.  \nIn total 23 resolutions were passed, which includes some votes taken twice to get a sense of what “independent shareholders” think when excluding Ashley and others.  \n\nWhat may come as a surprise – at least to those protesting against him - is that Ashley appears to have become more popular with investors than this time last year.  \n\nThe resolution regarding his re-election resulted in 11.8 per cent of shareholders either voting against or withholding their vote. In 2014, that number was 13.5 per cent. The below pie chart shows how this year's vote broke down for the controversial founder.  \nHowever chairman and former drugs tsar Keith Hellawell has come in for greater shareholder dissatisfaction. Last year 7.2 per cent of investors either went against him or abstained; this year that has risen to 10.8 per cent. The chart below breaks the vote down for the man whose grilling at the Scottish Affairs select committee earlier this year led to Sports Direct being dubbed a \"backstreet outfit\".  \nAnd when you drill down to just the independent shareholders, that figure jumps to 30.5 per cent. This chart shows what investors outside the company think of him.  \n\nBut it wasn't just Sports Direct's bosses who were facing a test with investors. The controversially updated remuneration policy was also under the spotlight, and while it was also approved, a sizeable 18.9 per cent of the vote went against it.  \n\nStill, Ashley et al will be losing no sleep over the final tally. Let's face it, if Sports Direct's AGM were a General Election , they'd be laughing. ", "source": "City A.M."}