{"published": "2015-09-24T12:49:43Z", "media-type": "News", "title": "Pakistani diplomat captures Radha-Krishna", "id": "a5cc5a6a-7ea5-4d2d-bfa0-b93a7893e57c", "content": "By Kallol Bhattacherjee \n \n\r\n\t  \n \n\r\n\tIn a colourful twist to India-Pakistan ties, senior Pakistani diplomat Syed Zirgham Raza has unveiled an interesting work of art that bears his interpretation of the divine figures of Radha and Lord Krishna in the contemporary Indian context. The painting which was unveiled strictly for a private viewing for a few of Zirgham’s friends in Delhi has already become a talking point due to the unconventional blend of paint and print. Apart from the composition, the buzz around the art work obviously comes from the fact that it was created in India by a serving Pakistani diplomat who liberally used Indic/Hindu cultural iconography in his work. \n \n\r\n\t  \n \n\r\n\tThe painting is inspired by a Mughal miniature painting that was used on the cover of Nobel laureate Amartya Sen’s The Argumentative Indian , which depicted the Mughal emperor as a blue-skinned Lord Krishna in conversation with his consort. Zirgham says his latest painting is a tribute to the spirit of arguments and discussion in South Asia as much as a statement against the regressive social practices in fashion on both sides of the Border. \n \n\r\n\t  \n \n\r\n\tZirgham’s Radha-Krishna is seen in the backdrop of the eternal Taj Mahal and the ephemeral pleasures of modern life and youth. The juxtaposing of the classical and the contemporary also highlights the tension that underlies the culture-scape of modern India. \n \n\r\n\t  \n \n\r\n\tZirgham, who was educated in the Lahore College of Arts in the 1980s, was posted to the High Commission of Pakistan in Delhi three years ago as the First Secretary in charge of the Commerce section and has painted a series of India-centric paintings during from the beginning of his tenure. So far none of his paintings have been shown to the world outside barring his close circle of friends which consists of artistes Sangeeta Gupta and Gopi Gajwani who meet for exclusive sessions of discussions. “Diplomats live in a world far removed from the universal world of the artistes. I have found many Indian friends in the art world and enjoy a great rapport with them,” Zirgham said. \n \n\r\n\t  \n \n\r\n\tHis other unfinished work in this series shows Radha and Krishna in a KFC joint. “I am deeply moved by the cultural and social changes taking place in the Indian society. Young people are embracing new trends and cultures without much discussion and this is something that is explored in my works,” said Zirgham who considers himself an orthodox Lahori. \n \n\r\n\t  \n \n\r\n\tThe Hindu, September 24, 2", "source": "South Asia Monitor"}