{"published": "2015-09-02T10:00:00Z", "media-type": "News", "title": "Crossbows: Instrument of Evil or just another way to enjoy hunting?", "id": "d90581f3-37cb-4ff9-8d02-988205b58c96", "content": "I have to level with you. I have never really understood all the drama about crossbows. Nothing short of when to open spring turkey season or the ever popular myth of fish and game departments stocking coyotes seems to draw more controversy than hunting with a crossbow. Why that is I am not sure, but I think it might be because it is not a traditional hunting weapon for many of us. \n  \nDad and Grandad did not hunt with a crossbow, so most of us look at it with more than a little suspicion. Maybe if we talk about it a little you might begin to see that the crossbow is neither a super weapon made to wipe out the deer herd nor an instrument of evil. It’s just another way for many people to get out there and hunt and enjoy the outdoors. \n \nIn case you didn’t know, the crossbow has been around a long time and seems to have appeared at about the same time, around 400 BC, in both China and Europe. As soon as the crossbow was invented some of the regular bowmen, the guys with long bows, started complaining about how the crossbow was bad, it wasn’t safe and it gave those troops too much of an advantage. (OK, I made that part up.) \n \nWhat is true, however, is that there has been a dispute among archers for years about taking the crossbow afield. Some of the same concerns that I joked about always come up when this discussion starts. The critics maintain the crossbow is unsafe, it gives a hunter unfair advantage, there will be more deer killed during the archery season and this will cause the season to be shortened, and having crossbows around will make it easier for more deer to be taken illegally. \n \nOhio and Arkansas were two of the first states to legalize crossbow hunting (they started in the 1970s), and none of the above concerns have come to light. There was no great increase in accidents, no shorter bow seasons and no noticeable uptick in poaching. The sky did not fall because they and now other states allowed crossbow hunting. Like many things in life I think a lot of us say we don’t like crossbows because we really don’t know anything about them. We have never shot one and never had one in our hands. \n \nOne of common misconceptions about crossbows is that they have the capacity to shoot accurately at incredible distances, somewhere between a .22/250 varmint rifle and a ballistic missile. Once you explore the facts, however, you see that this is not the case. \n \n“We have done side by side comparisons between our crossbows and some of the industry leaders in vertical archery gear,” said Barbara Terry, the education and trade show coordinator for Ten Point Crossbow Technologies. “In these tests, we have shown that crossbow arrows will drop faster than other arrows because they are generally shorter and heavier than those used with vertical archery.” \n \nAs with many other crossbow manufacturers, Barbara Terry advises to keep your shots with a crossbow at reasonable ranges, 40 yards and less. Since most of us are poor at judging distance, I suggest you invest in a range finder. \n \n“The close proximity required to kill a deer with a crossbow surprises a lot of gun hunters,” she said. “Being able to control your scent and watching the wind, estimating distances and shot placement. Some new crossbow hunters may get discouraged when they discover that the crossbow is not the super weapon they thought it was. Crossbow hunting is not as easy as it’s made out to be. It’s just one more way to get out in the woods and enjoy what we all like to do.” \n \nI agree with Barb Terry. The key here is if allowing the use of crossbows for the general public will get more people out there hunting, young and old, it is a good thing. Studies show that this has been the case in other states that have allowed crossbow hunting. Many report that after some hunters try crossbow hunting they move on to try more conventional archery. All of this is good as we try to increase hunter numbers. \n \nCan you get hurt with a crossbow? Absolutely. Just like a rifle, a shotgun, a conventional bow or any weapon, there is a danger here if we are not always careful. Good Hunter Education training followed by close attention to detail and following the rules we learned in our training is very important. \n \nYou can try the crossbow for yourself, or not. I am only saying that if more us try the crossbow our hunter numbers will increase. I will predict that if you decide to try one and shoot it a few times, most of you are going like it! \n \nLarry Case is a former employee of the West Virginia Department of Natural Resources and a longtime outdoorsman. You may email him at larryocase3@gmail.com . \n \nCrossbow safety tips \n \n• Your crossbow is required to have a safety, use it. \n \n• Just like a firearm, keep the loaded crossbow pointed in a safe direction — at all times. \n \n• Read up on your crossbow and thoroughly familiarize yourself with the weapon before going afield. \n \n• When hunting from a tree stand, cock your crossbow on the ground. Climb into the stand and carefully pull up the crossbow with your haul rope. Reload the crossbow once you are securely in the stand with safety straps attached. \n \n• When stalking, moving on the ground, carry your crossbow unloaded, load when you spot your game. \n \n• A loaded crossbow in or on a vehicle is illegal and very dangerous. \n \n• Crossbows are not meant to be dry fired.   Crossbow rails should be lubed often and the string waxed as well. If you have a frayed string on your crossbow, replace it at once. \n \n• Keep your fingers and thumbs below the rail of the crossbow before you release the arrow. Any of your digits left above the rail at the shot may not be with you after the shot.", "source": "Meadville Tribune"}