{"published": "2015-08-31T23:23:44Z", "media-type": "Blog", "title": "Mercedes Benz debuts sleek new C-Class Coupe - w/videos", "id": "1746cde7-2075-4809-8982-fa3b4c26d551", "content": "The German automakers really know how to make Coupes such as the A5/S5 from Audi (updating soon), the 4- and 6-Series models from BMW, and from Mercedes Benz, the S-class Coupe and this latest C-Class Coupe. Mercedes is on a style roll with these coupes that look sleek, aerodynamic, and muscular/aggressive all at the same time. While the press release is a global one, you can guess the engines and equipment that will come to the US. Expect the turbo fours and the eight-speed auto at the very least. It would be nice to get the more-powerful diesel in the C-Class Coupe as well, but... The new C Coupe gets all of Mercedes' latest like the AMG equipment, Agility Control. Airmatic suspension, DISTRONIC PLUS (with Steering Assist and Stop&Go Pilot), AS PLUS Brake Assist System, Active Lane Keeping Assist, PRE‑SAFE® occupant protection, and much more as standard equipment or available in packages. The new body is stiffer and lighter which should aid performance and fuel economy. In other words, like most Mercedes models here in the US, you can spend lots of money or go crazy with the options and spend even more money. But look what you get...a new Coupe that is certainly worth lusting after. Mercedes will begin the roll out of the new C-Class Coupes in December. For more info, check out the global press release and three videos after the jump. More to come...\nSource: Mercedes Benz - Press release, pics, and videos after the \"read more\" jump.\nPress Release:\nThe new C-Class Coupé: Seduction of the heart and mind\nMercedes-Benz is adding a Coupé to its C-Class family. Athletic and sporty, the vivid, sensual design of the new Coupé cuts a fine figure on the road and embodies modern luxury. At the same time, its interior raises elegance and style to a sporty level. A dynamically configured chassis, with optional air suspension, forms the basis for a high level of suspension comfort, low road roar and tyre vibration, agile handling, and driving pleasure. Lightweight construction to reduce weight, excellent aerodynamics and high-performance yet efficient engines likewise contribute to this. New assistance systems provide safety of the very highest calibre. With its high-class appeal and generous interior, the new C-Class Coupé sets new standards in its segment. It arrives in December 2015.\n\"Our new C-Class Coupé continues the philosophy of our exciting coupés. It combines thrilling design with agile sportiness and modern luxury. The C-Class Coupé therefore clearly pledges itself to stylish driving enjoyment,\" states Prof. Dr. Thomas Weber, member of the Board of Management of Daimler AG and responsible for Group Research and Mercedes-Benz Cars Development. As the sportiest variant of the C-Class, the Coupé displays its driving enjoyment-oriented character in an emotive and at the same time formally distinct design. A sportily striking front section featuring diamond radiator grille and long bonnet – the new Coupé is 60 millimetres longer than its predecessor between the firewall and front axle alone – gives way to a low greenhouse whose lines flow into a bold and powerful-looking rear end incorporating the Mercedes coupé genes. A high beltline and frameless doors with free-standing exterior mirrors underscore the sporty character. Clean lines and sensually arranged surfaces structure the side sections into vivid light and shadow effects. One particular highlight is the long drawn-out dropping line typical of a coupé. In contrast to the C-Class Saloon, the dropping line extends further past the rear wheel arch. To underscore the Coupé's sporty disposition, the suspension is 15 millimetres lower than that of the Saloon, making it a very sporty proposition when combined with the standard 17-inch tyres. Interior: generous, dynamic, exquisite\nThe interior is likewise a statement of the Mercedes-Benz design philosophy and combines emotion with intelligence. Although it exudes athletic and youthful charm, it has grown in maturity. Driver and passengers enjoy an ambience that leans toward the interior of the C-Class Saloon yet raises it to a new, sporty level. Flowing forms characterise the centre console as well as the door and rear side panelling, which smoothly merge into one another to emphasise the coupé character. The individually designed trim elements underscore the sporty character of the interior. A seating system including integral sports seats designed specifically for the Coupé offers sporty comfort. Plus there is an automatic belt feeder for added convenience. The choice of materials and the finish have a hand-crafted feel with high-class appeal and deliver a new take on modern luxury: sportiness without compromising on comfort and exquisite style. With an 80 millimetre longer wheelbase, the C-Class Coupé is 95 millimetres longer and 40 millimetres wider. The increased vehicle volume above all creates more spaciousness for the driver and front passenger. There is more shoulder room, elbow room and headroom in all seats. The unique position of the new C-Class Coupé is emphasised by the special upholstery colour combinations: saddle brown, porcelain and – in the Edition 1 – nut brown/black with turquoise topstitching. Individual highlights\nThe Coupé features a wealth of equipment as standard. The AMG Line is available as an alternative to further underline the dynamism of the Coupé. It differs by virtue of exterior features such as special bumpers and sills featuring AMG bodystyling, a diamond radiator grille with pins in chrome and 18-inch AMG light-alloy wheels. Interior highlights of the AMG Line include sportily exclusive touches such as upholstery in ARTICO man-made leather/DINAMICA microfibre in black with contrasting topstitching, a multifunction sports steering wheel with flattened bottom section and AMG sports pedals. The trim in open-pore black ash, combined with aluminium in the dashboard and the doors, emphasises the look. Another eye-catching feature is the optional Interior Chrome package featuring numerous highlights shrouded in silver chrome, including the instrument cluster, the air vents and the door openers. Suspension – sportily agile and comfortable\nThe suspension offers a high level of comfort with low road roar and tyre vibration whilst ensuring agile driving dynamics – the basis for driving enjoyment. A new 4-link front axle with wheel suspension decoupled from the spring strut plays a part in the agile handling characteristics. This enables sporty axle kinematics for plenty of grip and high lateral stability. As a result, the suspension responds more sensitively to steering movements and allows a sporty, agile driving style. Multi-link independent rear suspension with 5 links ensures excellent wheel location qualities and supreme straight-line stability. The Coupé comes with steel suspension as standard. There are two variants with selective damping system available in conjunction with this suspension, each of which is 15 millimetres lower than on the Saloon:\nComfortable AGILITY CONTROL suspension with a sporty character Sports suspension with tauter springing and damping including Sports Direct-Steer system for even more agile handling Air suspension\nThe Coupé comes with the option of AIRMATIC air suspension on the front and rear axle. Its electronically controlled, continuously adjustable damping on the front and rear axle ensures outstanding road roar and tyre vibration characteristics in every situation and gives the driver the option of selecting the desired driving style: sporty, comfortable or consumption-optimised. To this end, the driver can select one of five driving modes using the DYNAMIC SELECT Switch: \"ECO\", \"Comfort\", \"Sport\", \"Sport +\" and \"Individual\". Selecting \"Individual\" allows the driver to customise the vehicle settings. AIRMATIC also features all-round self-levelling for excellent ride comfort even with the vehicle loaded. Efficient and lively engines\nPowerful and efficient four-cylinder petrol and diesel engines with ECO start/stop function provide for sporty performance and driving pleasure. All are compliant with the Euro 6 emissions standard. Compared with the predecessor they consume up to 20 percent less fuel. There are initially four petrol engines available for the Coupé. The power spectrum ranges from the 1.6-litre four-cylinder engine in the C 180 with 115 kW/156 hp to the two-litre C 200 (135 kW/184 hp) and C 250 (155 kW/211 hp) models and the C 300, likewise with a displacement of two litres but with an output of 180 kW/245 hp. The two diesel models are equipped with an enhanced four-cylinder unit developing 125 kW (170 hp) or 150 kW (204 hp) and feature ecofriendly SCR technology (Selective Catalytic Reduction) for exhaust gas aftertreatment. Lighter, stiffer and stronger\nIntelligent lightweight construction with a higher proportion of aluminium helps make the Coupé lighter than its predecessor. Light-alloy components include the wings, bonnet and boot lid. At the same time, the body is now much stiffer and stronger thanks to the use of high-strength materials, which has a positive effect on not only driving dynamics and noise levels but also crash safety. The Coupé therefore follows a Mercedes-Benz tradition in not only meeting all current national and international laws, but also all rating requirements as well as the more stringent internal Mercedes-Benz safety requirements, which are based on what actually happens in real-life accidents. Through the wind\nMercedes-Benz is setting the pace in the field of aerodynamics and delivers cars with the best drag coefficients (Cd values) in almost all vehicle classes. The new C‑Class Coupé boasts a Cd value of 0.26. This leading figure pays off above all when driving on country roads and motorways as wind resistance is greater than other forms of driving resistance at speeds above 70 km/h. Safe semi-autonomous driving to reduce stress\nThere are several safety and assistance systems based on the Mercedes-Benz Intelligent Drive concept to choose from. ATTENTION ASSIST with adjustable sensitivity, which can warn the driver of inattentiveness and drowsiness, is included as standard. Further standard equipment includes COLLISION PREVENTION ASSIST PLUS, which features an acoustic warning for the driver at speeds above 7 km/h and Adaptive Brake Assist to help avoid collisions by boosting the braking effect in line with the current situation. When a danger of collision persists and the driver fails to respond, the system is able to carry out autonomous braking at speeds of up to 200 km/h, thereby reducing the severity of collisions with slower or stopping vehicles or, in the best-case scenario, even avoiding the collision altogether. At speeds of up to 50 km/h the system also brakes in response to stationary vehicles, and is thus able to help prevent rear-end collisions at up to 40 km/h. New assistance systems with substantially enhanced functions are optionally available, combining data from various sensor technologies such as radar sensors and a stereo camera as part of the Intelligent Drive concept to enhance comfort and safety:\nDISTRONIC PLUS with Steering Assist and Stop&Go Pilot is an adaptive cruise control system that can adjust the speed of the vehicle in line with a slower-moving vehicle ahead in a speed range from 0 to 200 km/h if required. Likewise available from 0 to 200 km/h, steering intervention helps the driver stay in lane. And at speeds below 130 km/h, for example in traffic jams or when driving bumper to bumper, the system can follow the vehicle ahead even where there are no or unclear lane markings, thus enabling the driver to safety and comfortably follow the flow of traffic. As well as vehicles ahead and stationary vehicles, the BAS PLUS Brake Assist System can also detect crossing traffic and boost the braking force if the driver fails to apply the brakes sufficiently; in addition to slower-moving, stopping and stationary vehicles, the PRE-SAFE® Brake can even detect pedestrians and brake autonomously if the driver fails to react, thus preventing accidents up to 50 km/h and mitigating the severity of collisions at speeds of up to 72 km/h. In flowing traffic the PRE-SAFE® Brake provides assistance according to the same mode of operation throughout the speed range from 7 to 200 km/h. Enhanced Active Lane Keeping Assist can now also prevent the vehicle from unintentionally drifting out of lane by applying the brakes on one side when the lane markings are solid or broken and there is a risk of collision, e.g. as a result of vehicles overtaking at high speed, parallel traffic or even oncoming traffic. PRE-SAFE® PLUS extends the Intelligent Drive functions to take account of imminent rear impacts. It warns the following traffic by activating the rear hazard warning lights at increased frequency and initiating preventive PRE‑SAFE® occupant protection measures such as the reversible belt tensioner immediately prior to the impact. If the vehicle is stationary, the brakes are locked to reduce the forward jolt, which reduces the forces acting on the occupants and the risk of secondary collisions. The numerous assistance systems also include\nActive Parking Assist, which enables semi-automated parking with active steering and brake intervention in both parallel and end-on parking spaces A 360° camera which is able to show the vehicle and its surroundings from various perspectives, including a virtual bird's-eye view, thus assisting with parking and manoeuvring Camera and navigation-based Traffic Sign Assist with wrong-way warning function, which warns of speed limits and also alerts the driver to the start and end of no-overtaking zones and gives the driver a visual and audible warning if no-entry signs are detected Adaptive Highbeam Assist Plus, which allows the high-beam headlamps to be kept on permanently without dazzling traffic by masking out other vehicles in the cone of light from the high-beam headlamps Airbags for safety\nIn addition to 3-point seat belts with pyrotechnical belt tensioning and belt-force limitation for driver, front passenger and rear passengers, numerous airbags serve to protect the vehicle's occupants in an accident. These include:\nFrontal protection systems: Adaptive front airbags for driver and front passenger, additionally with a kneebag on the driver's side Side protection systems: Thorax/pelvisbags for driver and front passenger plus front and rear windowbags, with rear sidebags available as an option Climate control with satellite navigation\nThe air conditioning system in the new C-Class Coupé operates efficiently and ensures high air quality. As in the Saloon, it uses satellite navigation to detect tunnels. It therefore closes the air recirculation flap automatically when entering a tunnel and opens it again after exiting a tunnel. Vibrant infotainment experience\nThe new multimedia generation offers intuitive controls with visual animations and effects. Frontbass ensures a listening experience almost on a par with a concert hall – especially if the optionally available Burmester® sound system is specified. The Frontbass system uses the space within the cross-member and side member in the body structure as a resonance chamber for the bass speakers. The navigation system, which supplies the driver with precise traffic information in real time (Live Traffic Information), processes its contents interactively. Its features include an animated compass, a \"Drive Show\" with information for passengers similar to the on-screen presentations on board airliners and Google Maps displayed on the head unit. Extensive networking even in the basic version\nA Bluetooth®-compatible mobile phone with data option is all it takes to make even the Audio 20 system internet-capable. This enables surfing the internet without restrictions when the vehicle is stationary. Mercedes-Benz Apps can be used while driving. Audio and video playback is possible from various sources. COMAND Online provides not only a larger display with a resolution of 960 x 540 pixels, it also allows digital TV/radio reception and, in addition to many other features, offers fast hard-disc navigation, integral WLAN hotspot functionality and the LINGUATRONIC voice control system. The basic Audio 20 system as well as Audio 20 CD and COMAND Online all offer basic telephony as standard, which links up a mobile phone to the vehicle via a standardised Bluetooth® interface. Mercedes connect me: connected with the car\nLike other models, the new C-Class Coupé has an extensive range of free Standard Services and Remote Online Services available as part of the \"Mercedes connect me\" package. Standard Services include automatic emergency call (eCall), Accident Recovery, breakdown assistance and after-sales service. The Remote Online services (standard with COMAND online and usable free of charge for the first three years) allow access to vehicle information at all times, including the status of windows and doors, mileage, tyre pressures and other diagnostic data. There is also a Vehicle Tracker function, remote door locking and unlocking, and remote auxiliary heating activation and deactivation.", "source": "uautoknow.net"}