{"published": "2015-09-26T22:59:42Z", "media-type": "Blog", "title": "GVB: Laguna tops Cate in one-game final for Mesa Mixer title", "id": "cbec79e8-3b0e-45fc-8acc-02a72f4b9843", "content": "Based on their brief encounters Saturday at Cate’s four-team girls volleyball Mesa Mixer, when the Rams and Laguna Blanca meet for a full match, the action is going to be fierce from the opening serve to the last point. The local small-school rivals and CIF top-five teams squared off during round-robin play and in a one-game final and split the results. Cate, the top-ranked team and defending champion in Division 4A, captured the best-of-three meeting, 22-25, 27-25, 15-12. Laguna rebounded with a vengeance in the single game, winning 25-15 to earn the championship trophy. “We were led by our setters, Phoebe Madsen and Kelly Bickett,” Laguna coach Jason Donnelly said. “Kelly had her best day of the season today. Her decision making was spot on and her set location allowed our hitters to attack at a high percentage.” Laguna, the No. 3 team in Division 4AA, used tough serving from several players and the hot hitting of Phoebe Madsen to pull away in the final. “Our serving was strong today, particularly from Laurel Kujan and Kelly Bickett. The had 11 and 5 aces, respectively,” said Donnelly. Madsen led the Owls attack on the day with 29 kills and Dani Abrams had 22 kills. Delaney Mayfield and Peyton Shelburne were Cate’s key hitters, combining for 67 kills on the day. Mayfield hit .318 and Shelburne .299. “Though we came up short in the championship game, we felt good on the overall performance,” Cate coach Greg Novak said. “We went to three in two of the matches and outlasted Laguna and Crossroads in those matches. Pulling off wins against tough opponents challenges the our team mentally. “When you play Laguna, you have to be fine tuned and in the final we were out of tune. Laguna has too many experienced veteran players so our game has to be flawless,” he added. In the first meeting, Cate’s powerful outside hitters of Shelburne and Mayfield carried the offensive load, while high-flying freshman middle Katie Browne made some big blocks to help rally the Rams after a first-set defeat. Cate and Laguna both defeated Pacifica Christian and Crossroads in their other round-robin matches. The local teams went the distance with Crossroads, each winning the third set, 15-13. “The tournament was designed to get a lot of play in a shot period of time,” Novak said. “Four of the six matches went to three which proved to be a good, even battle between the four teams. Cate and Laguna meet for a full non-league match on Saturday, Oct. 24 at Cate. Delaney Mayfield and Peyton Shelburne were our key detonators throughout the day. Delaney hit .318 and Peyton .299, combined they contributed 67 kills. Related", "source": "Presidio Sports"}