{"published": "2015-09-18T08:00:00Z", "media-type": "News", "title": "Homeland Security secretary confident that pope will be safe during Philadelphia stop", "id": "a3ac8179-d508-46fd-bb2f-b0c426357374", "content": "PHILADELPHIA — PHILADELPHIA_Homeland Security Secretary Jeh Johnson said Friday he was confident Philadelphia will be safe and secure during Pope Francis' visit next week, two days of open-air appearances in the heart of the nation's founding city.\n\n\"We know of no specific, credible threat directed at the pope's visit here,\" Johnson said. The Philadelphia visit is the largest event security operation ever undertaken by the U.S. Secret Service.\n\nSpeaking with other top officials at a secret communications center established expressly for the global event, Johnson predicted all will be well.\n\n\"We've worked hard to achieve what we believe will be a safe and successful event and visit by the holy father, a safe and successful event for all of those who wish to be here to see him, and one that basically keeps the City of Philadelphia going,\" Johnson said.\n\n\"We believe we have struck that right balance for the public, and we look forward to a safe and successful visit by the holy father here,\" Johnson said.\n\nSecret Service Director Joe Clancy said that he, too, had faith in the success of nine months of planning involving more than 70 different federal, state and local agencies. \n\nThrough closed highways and designated security zones in central Philadelphia and some of its immediate suburbs, the agency believes it has a firm grip on managing crowds and contingencies for the sensitive, high-stakes event starring one of the most prominent figures on Earth.\n\n\"We're confident that we have a very good, secure plan for the holy father's visit,\" Clancy said. \n\nClancy's agency took the lead in securing the site after Johnson ordered it be treated as a National Special Security Event. That designation grants the Secret Service full control for planning how to protect the pope from acts of violence or terrorism, as well as protecting the estimated 1 million people expected to travel to hear him speak.\n\nOf 50 NSSEs handled to date - including the 2009 inauguration of President Barack Obama before a crowd of 1.8 million - Clancy said the two-day papal visit presented different challenges, primarily because the pope has a varied schedule and also will not be confined to an indoor space, as is the case with a national political convention or even the State of the Union address.\n\n\"This one is more unique because of the amount of travel the pope will do within the city of Philadelphia and the volume of people as well,\" Clancy said.\n\nAll the more reason for closing some roads, lining core papal viewing areas with fencing and magnetometers, and working with the city on restricting vehicular flow into a nearly 5-square-mile zone that weekend.\n\n\"You've got to have structure,\" Clancy said. \"If you don't have structure, you'll have mayhem.\"\n\nOn Friday, Johnson and Clancy stood alongside Mayor Michael Nutter and at least a dozen others charged with some element of security and logistics. \n\nThe setting: Multi-Agency Communications Center, or MACC, a room filled with tables and rows of telephones designated for staffers from 50 of the coordinating agencies involved. All phones will be staffed round-the-clock from 9 a.m. Thursday until at least 4 p.m. Monday.\n\nVideo feeds from downtown sidewalks streamed onto one of several large screens draped on walls. The MACC's location, officials insisted, would not be disclosed publicly.\n\nMost everything except classified intelligence tips will flow in and out of MACC by phone, radio or video transmission, explained David Beach, special agent in charge of the Secret Service's Philadelphia office.\n\n\"It's a location where all of the information comes in,\" Beach explained. \"Then, that information is fed to the various operations centers.\"\n\nIntelligence analysts, FBI agents, police and others will staff those operations centers elsewhere in the city. It is in operations centers where decisions will be made about how to respond if word comes in of a credible threat to security.\n\nIn his remarks, Clancy took pains to single out the mayor for recognition. For months now, Nutter has stood before a mayoral lectern, week after week, taking much public criticism while sharing with the world security restrictions designed largely by Clancy's agents, none of whom were authorized to field questions.\n\n\"Since we've gone through this nine-month-or-so process,\" Clancy said, \"I've seen him with a very calm, steady hand as we've gone through the security planning.\"\n\nIn remarks after the news conference, Nutter expressed confidence about forthcoming security while also confessing he is anxious that the curtain finally rise after so many months on the drawing board.\n\n\"We're just waiting for it to happen,\" Nutter said. \"You rehearse and rehearse and rehearse; at some point you just want the concert to happen.\"\n\nThe pontiff will deliver a speech on immigration and religious liberty Saturday afternoon on Independence Mall, will parade around the Benjamin Franklin Parkway and be entertained by the Festival of Families. He will meet with bishops at St. Charles Borromeo Seminary in Wynnewood Sunday morning, then visit prisoners at Curran-Fromhold Correctional Center in Northeast Philadelphia before celebrating Mass on the Parkway. His departure for Rome is about 8 p.m., culminating a whirlwind visit to Cuba, Washington, D.C., and New York before his arrival in Philadelphia.\n\nFences will surround some of these venues, with pedestrians required to pass through magnetometers. Thousands of other pilgrims will be permitted to cluster in open areas a bit farther back.", "source": "Kentucky.com"}