{"published": "2015-09-29T06:29:50Z", "media-type": "News", "title": "Jose Mourinho: No Chelsea players are untouchable", "id": "a304fcb1-6f1d-4e04-9b64-d490afaaff0d", "content": "Jose Mourinho has questioned the attitude of his Chelsea players, none of whom he would describe as untouchable, ahead of Tuesday night's Champions League clash at his former club Porto. \n \nThe Blues boss memorably described the nucleus of his first Chelsea side as permanent names on the team-sheet, but believes his underperforming players are short of that status this term. \n \n\"Untouchables in football, only consistency can give you that status,\" said Mourinho, whose champions are 15th in the Premier League after two wins in the opening seven games. \n \n\"Football is about today, it's not about yesterday. In football you have to be consistent in your performance, in your emotion. \n \n\"There are two sorts of champions. There are champions who win something - and there are lots of them - but there are the other champions who during their career they win one, two, three, four, five, 10 or 20 titles. \n \n\"In this club we have 25 champions from last year, but serial champions in this squad, how many do we have? John Terry, John (Obi) Mikel, (Branislav) Ivanovic are serial champions. \n \n\"Clearly it's an attitude perspective of some individuals. And when you have individuals with that unstable attitude in terms of motivation, desire and commitment you will pay.\" \n \nMourinho recognises winning the competitive Premier League season after season is a challenge which is difficult to achieve, but he demands the attitude of serial winners, nonetheless. \n \nHe added: \"I can be five or 10 years without winning a title, but I will still be a serial champion in my approach and my attitude. \n \n\"This is the problem we have at this moment.\" \n \nMourinho returns on Tuesday night to Estadio do Dragao where he rose to prominence, winning the 2003 Europa League and 2004 Champions League. \n   Promoted stories   \nHe will put sentiment to one side as he continues his bid for a third European Cup with a third club. \n \nBut if Chelsea are to do that, Mourinho believes his players need to show more consistency. \n \nHe added: \"Generally I'm happy and positive. They fight and want to improve, but we have some players who you want more from. \n \n\"I cannot say I'm happy with one, two, three, four or five players. I look for consistency. \n \n\"When you want to be a big team and you want to win you have to be consistent in your attitude.\" \n \nDiego Costa is two matches into a three-match domestic suspension for violent conduct against Arsenal, but is available at Porto. \n \nAsked if he would like 11 players to show the same desire of Costa after Chelsea's stuttering start, Mourinho could not resist a dig at the Football Association for the retrospective ban. \n   \n Share article  \n   \n\"I think we would lose every game, because the desire to suspend him is so big that we wouldn't have players to start the game,\" Mourinho said. \n \n\"I'm happy to have only one and let him play until they decide to suspend him again.\"", "source": "Dorset Echo"}