{"published": "2015-09-21T15:06:05Z", "media-type": "News", "title": "Financial Advisor Pat Vitucci To Conduct Financial Events in San Ramon and Concord Special Guest Will Be Brian Carlson", "id": "bf5ba1ea-5685-48f0-baa8-031e8d960d46", "content": "Pat Vitucci, a Bay Area Independent Financial Advisor, will be conducting a special financial event about \"Tax Tactics\" on Wednesday, September 23 in San Ramon at the San Ramon Marriott and Tuesday, October 6 in Concord at the Concord Hilton. \nBoth events will begin at 7pm and appetizers will be served. \nThe event is at no cost and open to the public. \nAn invitation is available by calling 1 800 472 8303 or by visiting http://www.dontinvestandforget.com . \n\nSpecial guest speaker will be Brian Carlson, CFS, Jackson National Life Distributors LLC, Regional Vice President. \n   \nThe presentation, \"Tax Tactics To Help Reach Your Retirement Goals\" will cover how effectively navigating taxes could make the  difference in living your desired lifestyle--or not.\" \n\n\"Brian Carlson is well versed in the area of tax strategies to help determine if your investments are positioned to give you a favorable tax advantage\", said Vitucci. \"Tax strategies is one of the many areas we consider when we work with clients to build a financial plan.\" \n\nQuestions from the audience are encouraged during the presentation. \n\nPat Vitucci  hosts \"YOUR FINANCIAL LIFE\" , an hour long radio program heard throughout Northern California on KGO Sundays 10-11am. It is also heard Saturdays, 8-9am on KKSF Talk 910 in San Francisco, KSRO 1350AM in Santa Rosa and KDOW 1220AM in Fremont. The program is also heard on every Monday at 6PM on KDOW. \n\nHelpful articles found on the company website - http://www.dontinvestandforget.com - under \"investor education\", include: \n\nWhat Is A Financial Advisor? \nTen Considerations In Financial Planning For Retirement \nInvestment Vehicles \nRetirement Planning \nEstate Planning \nCollege Savings \nTax Strategies \nInsurance Planning \nThree Dangers For Boomers \nInvestment Risk Level \nPay Off Mortgage? \nSocial Security Considerations \n\nAbout Pat Vitucci \nIndependent financial advisor Pat Vitucci has provided  financial advice on several radio and television stations in Sacramento and the San Francisco Bay Area for over 15 years. He has also conducts seminars with well known media personalities. Additionally, Pat utilizes his relationship with other highly respected figures in the financial / investment / retirement planning industries to bring added value education to his seminars. Pat has also lectured at many organizations, both civic and fraternal, and at numerous corporate-sponsored events. \n\nPat's mantra--\"Don't Invest And Forget\"™--is not only the title of his book, but it is also the foundation of Vitucci & Associates Insurance Services. It's a reflection of how the company manages investments - with an active asset allocation method of continually evaluating and redeploying clients' portfolios based upon changing market conditions. \n\nPat Vitucci has been an active leader in the financial services industry for more than 30 years. He has served in various capacities in his corporate life, including being President of Broker Relations and President of a subsidiary of a major financial corporation. He lives in Alamo and studied at Monmouth University in New Jersey, where he earned a Bachelor of Science degree in Economics. \n\nSecurities and advisory services offered through National Planning Corporation (NPC), member FINRA, SIPC, and a Registered Investment Advisor.  Pasquale Vitucci, CA Insurance Lic. # 0758212, is an Endorsed Agent of Vitucci & Associates Insurance Services CA Insurance Lic. # 0I06319. Vitucci & Associates Insurance Services and NPC are separate and unrelated companies. Asset allocation cannot ensure a profit or protect against a loss. NPC does not provide tax or  legal advice. Brian Carlson is not an NPC representative. \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12938354.htm \nPRWeb.com", "source": "MoneyShow.com"}