{"published": "2015-09-26T11:38:49Z", "media-type": "News", "title": "Netflix Shows And Movies You Must Watch Before They're Gone", "id": "ed5c1d10-913e-4c1c-8b47-34944e178952", "content": "These must-watch titles will be expiring on Netflix next week. \n(Photo : Matthew Keys | Flickr) \n\nSome of these great shows and movies will be leaving Netflix next week so if you have been procrastinating to watch them on the streaming service, now is your last chance! \n \nCheck out our top must-sees on Netflix before they go bye-bye! \n \n\n \n(Photo : Matt Perreault | Flickr) \n \nLeaving Sept. 28 \n \nUndeclared: The Complete Series \n \nJudd Apatow created this sitcom which aired on Fox in 2001-2002.  The half-hour show followed a group of students at the University of Northeastern California.  The show was canceled after just one season but has developed a cult following ever since. \n \nLeaving Sept. 29 \n \nComic Book Men, Season Two \n \n[embedded content] \n \nSet in the comic book shop of film maker, Kevin Smith, season two of Comic Book Men , continued to follow the real-life hijinx inside Jay and Silent Bob's Secret Stash. \n \nCoriolanus \n \n[embedded content] \n \nRalph Fiennes directed and starred in this contemporary adaptation of one of Shakespeare's last tragedies about a Roman general being blamed for the city's problems. \n \nLeaving Sept. 30 \n \nApocalypse Now \n \n[embedded content] \n \nThe masterpiece by Francis Ford Coppola, starring Marlon Brando and Martin Sheen, continues to be a cinematic marvel. \n \nIf I Stay \n \n[embedded content] \n \nChloe Grace Moretz is a teenager torn between life and death as she lingers in a coma, wondering if she should return to the life she was living or move on. \n \nJack Ryan: Shadow Recruit \n \n[embedded content] \n \nChris Pine stars as Jack Ryan in this action packed movie directed by Kenneth Branagh.  Shadow Recruit is an original story based on Tom Clancy's Jack Ryan  novels. \n \nJackass Presents: Bad Grandpa \n[embedded content] \n \nThe fourth film in the Jackass  film series has Johnny Knoxville and his crew conducting their trademark series of pranks and stunts within a central storyline that was absent from their previous movies. \n \nStar Trek: The Motion Picture \n \n[embedded content] \n \nThe original Star Trek movie brought the crew of the Star Ship Enterprise to the big screen for the first time in 1979. \n \nStar Trek Into Darkness \n \n[embedded content] \n \nThe second installment of the Star Trek franchise reboot has the Enterprise crew thrust into an altered timeline where Khan is back and Kirk and Spock must work together to defeat their ultimate nemesis. \n \nThe Expendables 3 \n \n[embedded content] \n \nHollywood's greatest action stars banded together once again for the third installment of The Expendables .  The mercenary \"Expendables\" must take down an arms dealer who will stop at nothing to destroy them. \n \nThe Hunger Games: Catching Fire \n \n[embedded content] \n \nThe second installment in the Hunger Games movie series has Katniss Everdeen fighting for her life once more against the Capitol when she and Peeta were thrown back into the Games where all rules are broken and all bets are off. \n \nThe Wolf of Wall Street \n \n[embedded content] \n \nLeonardo DiCaprio is a cut-throat New York Stock Broker in this black comedy based on the memoirs of Jordan Belfort. \n \nTransformers: Age of Extinction \n \n[embedded content] \n \nMichael Bay returned to the Transformers franchise with Age of Extinction , set five years after the previous film.  The Autobots team up with a new cast of humans and Dinobots for the first time on the big screen. \n \nGo to Netflix for a complete  list  of all the titles expiring in September 2015. \n \nPHOTOS: \nMatthew Keys | Flickr \n \nBe sure to follow T-Lounge on  Twitter  and visit our  Facebook  page. \n \n© 2015 Tech Times, All rights reserved. Do not reproduce without permission.", "source": "Tech Times"}