{"published": "2015-09-16T16:02:14Z", "media-type": "News", "title": "5 Questions: Peacebuilding in Congo with Political Scientist Séverine Autesserre", "id": "4394d354-4b39-4335-aece-077337a328ae", "content": "The 20-year conflict in the Democratic Republic of Congo has killed an estimated 5.4   million people since the 1990s — making it the deadliest since World War II — and armed attacks by different groups occur every week. Séverine Autesserre (SIPA‘00), a member of  Columbia's Arnold A. Saltzman Institute of War and Peace Studies and a political science professor at Barnard College , is an authority on international intervention, conflict   resolution, and Central Africa who has researched Congo and visited the nation often   since 2001. \n  \nQ What is the scope of the conflict? \n   \nThe international and national wars started in 1996, but there was already extensive local   violence in the eastern part of the country from 1993 on. Millions of Congolese have died   and the country has remained one of the poorest in the world. Since its outbreak, the   conflict has destabilized most of Central Africa, including Congo’s immediate neighbors   Rwanda, Burundi, and Uganda. \n   \nQ Have there been any peacebuilding efforts? \n   \nCongo hosts the largest United Nations peacekeeping mission in the world, which  attempts to protect the Congolese population from various armed groups and maintain, or   enforce, a ceasefire. There are numerous donors, international organizations (such as the   African Union), and non-governmental agencies working in Congo, as well as plenty of   diplomats. All of these people organize international and national peace conferences, and   they try to help the Congolese state reform and train its army, modernize its bureaucracy,   and organize free and fair elections. \n   \nQ Why haven’t those efforts worked? \n   \nViolence in Congo is in large part driven by local conflicts that international peace efforts   have not properly helped address. And by local, I really mean at the level of the   individual, the family, the clan, the municipality, the community, the district, and   sometimes the ethnic group. For instance, there is a lot of competition over who can be   chief of a village or a territory under traditional law, who can control the distribution of   land and the exploitation of local mining sites. This often results in localized fighting, and   can escalate across a whole province and even at times into neighboring countries. \n \nInternational peacebuilders view local conflicts as “simply” the result of national and   international tensions, insufficient state authority, and what they view as the Congolese   people's “inherent penchant” for violence. So they consider intervention at the national   and international levels as their only option. As a result, there is very little international   support for local conflict resolution efforts in Congo. \n   \nQ Is there an effective way to resolve conflict and build lasting peace? \n   \nBecause many conflicts have such local stakes, national and international peace   initiatives need to be supplemented with micro-level efforts. You cannot enact national   legislation or impose international law adjudicating who can be the appropriate chief of   each local village, or who among five parties in a conflict has legitimate ownership of a   piece of land. You need to look at these disputes on a case-by-base basis and find the   specific solution for each one. \n   \nQ Are there signs that give you hope for peace there? \n   \nCongolese elites and ordinary citizens have been engaged in bottom-up peace efforts   since the violence started more than 20 years ago, but they often lack the resources   required to be effective. Support from international donors can be crucial, and can lead to   the implementation of successful local peacebuilding initiatives. For instance, in the   provinces of the Kivus in eastern Congo, the Life and Peace Institute and its Congolese   partners have set up inter-community forums to discuss the specifics of local land   conflicts, and these forums have found solutions to help manage the violence. \n \nIn the past few years, an increasing number of donors, international agencies, and non-  governmental organizations have starting paying more attention to resolving land   conflicts and promoting inter-community reconciliation – two issues that are absolutely   key for bottom-up peace. So there is hope that this will lead to concrete action in support   of Congolese local peacebuilders. \n \nThis is the focus of my new research project, which examines how international   organizations can do a better job at supporting local actors and initiatives in   peacebuilding processes, particularly in Congo.", "source": "Columbia University"}