{"published": "2015-09-14T21:16:00Z", "media-type": "News", "title": "Niall Horan Sings Taylor Swift’s ’22’ To Celebrate Birthday — WATCH", "id": "217282e1-7382-46e5-a6b9-1ee4d9069740", "content": "5:16pm EDT by 1 Comment \n\nGetty \n\nLook who’s feeling 22! During One Direction’s stop in Massachusetts, Niall Horan celebrated his 22nd birthday in the most appropriate way possible — belting out Taylor Swift’s ’22’! Watch the hilarious video below! \n\nOne Direction wrapped up the American leg of their On The Road Again tour on Sept. 12, just in time to celebrate Niall Horan‘s 22nd birthday! Although the 1D blondie’s birthday wasn’t technically until Sept. 13, he took the opportunity to have 60,000 screaming Directioners join him in a rendition of Taylor Swift‘s “22” and it was completely adorable! \n\nNiall has never been the bragging type, but on the eve of his 22nd birthday, he couldn’t resist sharing his excitement with fans in attendance at Gillette Stadium in Foxborough, Mass. While he had the mic in between songs, he said, “It’s my birthday in a couple of hours,” as he happily bounced down the stage’s catwalk. Guitar in hand, Niall busted into a quick cover of T-Swift’s “22”! \n\nCAN I GET AN ACTUAL COVER OF NIALL SINGING 22 PLEASE pic.twitter.com/jvvcw21DwO \n\nEveryone in attendance sang along with Niall, which made for quite the perfect way for him to celebrate with all of his fans. But ironically, even though Niall started the massive sing-along, he quickly admitted he didn’t know the rest of the words about halfway through the chorus! Oh well, at least he got the most important message of the song across — he’s feeling 22! \n\nLater in the show, the rest of the boys joined Niall to continue the bday fun and serenade him with a very One Direction version of “Happy Birthday.” Although 1D will be taking a year-long hiatus starting in March 2016, they definitely proved that they are tighter than ever in their adorable birthday song huddle! \n\nAs sad as Directioners are for the boys’ break, at the same show, Louis Tomlinson made a promise that they will be returning after taking a year off! This live announcement comes after Louis and Niall made the same guarantee on Twitter following the initial report of the break. Phew…no wonder Niall and the boys were so happily singing birthday tunes! \n\nDid you love Niall’s version of “22,” HollywoodLifers? Send him some belated birthday love below! \n\n— Taylor Weatherby \n\nMore Niall Horan News: \n\nJavaScript is required to load the comments. \n\nNiall Horan: One Direction Bandmates Sweetly Sing Him 'Happy Birthday' At… Sep13   Read Article►→ 16      Niall Horan: One Direction Hottie Turns 22 -- Happy Birthday Sep13   Read Article►→ 12 \n\nSponsored Content by Taboola \n\nNiall Horan Fractures His Foot & Doesn't Know How He Did It -- Watch Sep06   Read Article►→ 5      Niall Horan & Camila Cabello's Flirty Video & Tweets: Fans Freak Out Sep04   Read Article►→ 12      Niall Horan Mocks Kanye West, Claims He's Running For President In 2020 -- Watch Sep03   Read Article►→ 8      One Direction Can't Wait For Break: Band Members 'Fed Up With Each Other' Sep01   Read Article►→ 29      One Direction Split For Good? Simon Cowell Admits 'Exhausted Band' May Not… Aug28   Read Article►→ 6", "source": "Mail.com"}