{"published": "2015-09-08T15:37:54Z", "media-type": "News", "title": "PM Skerrit issues warning as Tropical Storm Grace approaches the island", "id": "b76db276-2624-462d-8046-b3b980887948", "content": "Prime Minister Roosevelt Skerrit has urged Dominicans to take precautionary measures even though Tropical Storm Grace is expected to weaken on Tuesday as it moves closer towards the Lesser Antilles.  \n \nThe Miami-based National Hurricane Centre (NHC) said that the storm is expected to become a tropical depression with winds of 40 miles per hour. It is now located 1,360 miles east of the Lesser Antilles. \n \nSkerrit’s plea comes as the island continues to recover from the battering it received from Tropical Storm Erika that has been blamed for more than 30 deaths and a number of people reported missing and now presumed dead. \n \nThe country has also estimated damage to its infrastructure in excess of US$600 million and is appealing to the international community to help in the rebuilding exercise. \n \nPrime Minister Skerrit in his address to the nation on Monday night said “regardless of this weakening — and this is what I want you to listen to very carefully, my dear people ,  the current projection is for an increase in shower and thunderstorm activity, which could be heavy at times across Dominica on Friday, with the possibility of flash flooding”. \n \nSkerrit said he is advised that a tropical wave is expected to produce some unstable conditions on Wednesday with model projections estimating rainfall amounts of 15 to 20 millimeters across Dominica. \n \n“Under normal circumstances, an inch of rain on Wednesday would be a windfall for farmers and sea-craft users. But on this occasion, it spells trouble for residents of several communities across Dominica. The earth is saturated and will not easily absorb an inch of rain,” Skerrit said. \n \nHe told citizens that he has also been listening to structural engineers who are warning of “the grave and present danger” posed by the threat of additional torrential rainfall in Dominica at this time. \n \n“I wish to take this opportunity to issue a word of warning to residents of this country. Now is not the time for dare-devil maneuvers. We have been given adequate warning of the likelihood of torrential showers and flash flooding and we all must pay heed.” \n \nSkerrit acknowledged that this will be difficult and uncomfortable for many, but said, “we are all one people and we have got to batten down and see this period of trial and adversity through. \n \n“If you know you are living in areas that are susceptible to flooding or you are in the path of busted riverbanks and water courses, I am urging you, from now, to consider a shelter or bunking with a relative or friend elsewhere, during the upcoming days of anticipated bad weather. It is better to be safe than sorry. \n \n“Landslides have heavily impacted the road system and those affected areas have by no means stopped shifting. They therefore currently present a very real danger,” Skerrit said in his radio and television broadcast. \n \n “I therefore again, appeal to those who were victims of landslides and slippage during the passage of Tropical Storm Erika, to be especially vigilant and mindful of the fact that conditions around you could deteriorate in the event of the forecasted rainfall materializing,”  Prime Minister said.", "source": "Caribbean Broadcasting Corporation"}