{"published": "2015-09-25T04:13:35Z", "media-type": "News", "title": "Records Detail Dramatic Response to California Wildfire – ABC News", "id": "03fd321f-c026-4c86-b6a3-ed015e08c50b", "content": "“In some cases these phone lines were burned down before the message was delivered,” he said. \n \nA couple needing help evacuating waited for deputies in a creek near their home. A woman fretted that her mother with Alzheimer’s disease wouldn’t know to leave. \n \nThe dispatch logs show deputies racing around winding, single-lane roads in the community and maneuvering past downed power lines to rescue whoever they could. \n \nMartin said his department used social media, door-to-door notifications and reverse 911 calls to tell residents of mandatory evacuation orders but conceded that not everyone received alerts. \n \nDeputies were asked to help enforce mandatory evacuation orders just 30 minutes after the fire started. \n \nThose were just a few of the overwhelming number of calls the tiny Lake County Sheriff’s Department received during the fast-moving blaze that began Sept. 12 about 100 miles north of San Francisco. \n \nThe 40 pages of logs involving dispatchers and deputies told the story of the unfolding disaster, detailing the frantic scramble to evacuate people and animals as the fire ripped through miles of dry vegetation. \n \nFrom a previous fire in late July, he knew to expect a recorded call on his cellphone or look for someone coming through the neighborhood with a bullhorn yelling for people to evacuate. \n \nThe records show that some people ignored those orders. In at least two instances, residents threatened or argued with would-be rescuers. \n \nAuthorities have since found four bodies in the charred ruins and one person remained missing and feared dead. \n      \n \nA daughter was worried about her elderly parents trying to flee a massive California wildfire on horseback. \n \nHigh school math teacher Bill Davis said last week that he watched from his home as smoke mounted from the fire. \n \n“Try to get them out,” a dispatcher told one deputy who encountered resistance at a house that was on fire. \n \nThe fire burned 1,320 homes and is one of the most destructive blazes in California history. \n \n“None of that happened,” he said. His house burned after he finally rounded up his cats and left. \n \nThe logs show worried relatives calling often to request checks on elderly and sick residents feared trapped in their homes. Screams for help were reported from residents unable to get out of the fire zone, while other callers pleaded for deputies to rescue livestock and pets left behind. \n \n“The response was as quick as we could do it,” Sheriff Brian Martin said. “In some cases, it didn’t reach everybody.” \n \nDispatch logs released Thursday showed the small department was strained to its limits by the flames that swept across the mountainous county. \n \nOne of the victims was Barbara McWilliams, an elderly woman with multiple sclerosis. The dispatch logs show deputies being asked to check on her at 7:12 p.m. Sept. 12 and reporting back 17 minutes later that the fire blocked their access to her home. \n \nThe post appeared first on News List Online .", "source": "NewsListOnline"}