{"published": "2015-09-17T13:44:01Z", "media-type": "News", "title": "Traditional Scottish songs collection to be unveiled in Aberdeen", "id": "6f94b43f-738b-4c4a-b9a7-c9704f68459e", "content": "Aberdeen's two universities have joined forces with a north-east culture group to launch a new collection of Scottish songs chosen by some of the area's most renowned traditional singers. Staff from The University of Aberdeen and Robert Gordon University (RGU) have worked with the Organisation Scottish Culture & Traditions (SC&T) on the book 'A Puckle O Sangs' which will be launched on Thursday, September 24. \n\nA Puckle O Sangs has been compiled by Grace Banks, and illustrated with her original photographs. The songs in the collection will form the basis of a larger online resource hosted on the SC&T website from September: www.scottishculture.org \n\nScottish Culture and Traditions is a charity whose aim is to advance the education of the public in Scottish culture and traditions by the promotion of Scottish traditional music, song and dance through learning and participation in a way that fosters enjoyment, enthusiasm and a sense of community. \n\nHosted by Aberdeen University, the organisation offers evening classes in Scottish song, dance and music, offering instrumental tuition from complete beginner to advanced level. \n\nGrace Banks worked on the project with Dr Helen Lynch from the University of Aberdeen's School of Language and Literature and Dr Jonathan Cameron of Aberdeen University Press. \n\nThe launch of the project is being hosted by the School of Applied Social Studies, Robert Gordon University, whose Head of Social Work and Associate Head of School, Janine Bolger, has been involved with SC&T for a number of years. \n\nThe book, accompanied by two audio CDs, has been published by Aberdeen University Press, and contains words and notation, making it an ideal resource for performers, teachers and all those who love to sing. \n\nThe book arose out of a wider Scottish Culture & Traditions project, Sing Aberdeen, made possible by a generous gift from a grateful Scottish Culture & Traditions Association Scots Song class participant and a Vibrant Aberdeen ACC Cultural Award. \n\nAs well as generating A Puckle O Sangs, the project included song-writing classes and traditional song workshops with groups as diverse as the Polish-Scottish Song and Story Group, Clan Cancer Care, and Riverbank Primary School in Tillydrone, and also resulted in performances from Glenbuchat to Edinburgh. \n\nA Puckle O Sangs will form the basis for a web resource of songs for sangsters and song-writers as well as all those interested in the oral tradition, culture and social history of Scotland, providing a \n\nfascinating insight into the vibrant and continuing life of Scots song in the twenty-first century. \n\nJanine Bolger added: \"SC&T brings enjoyment to individuals within the local community through offering high quality music, dance and singing tuition. The song book is just another example of the ways in which culture and traditions can be kept alive.\" \n\nThe collection will be launched at a free event which is open to the public on Thursday, September 24 from 7-9pm at RGU's The Sir Ian Wood Building, Garthdee. \n\nRefreshments will be provided and the evening will consist of Scottish Culture & Traditions Association singers leading everyone in a few songs from the book, intermingled with music and a few solo spots from those who have contributed to the online resource, including Frieda Morrison and Phyllis Lyon. \n\nFor more information about Scottish Culture & Traditions, please visit: www.scottishculture.org Notes for Editors \n\nIssued by the Communications Team \n\nOffice of External Affairs, University of Aberdeen, King's College, Aberdeen \n\nTel: +44 (0)1224 272014 \n\nContact: Joanne Milne \n\n((M2 Communications disclaims all liability for information provided within M2 PressWIRE. Data supplied by named party/parties. Further information on M2 PressWIRE can be obtained at http://www.m2.com on the world wide web. Inquiries to info@m2.com.", "source": "Individual.com"}