{"published": "2015-09-18T00:04:12Z", "media-type": "News", "title": "Report highlights 'wide variations' in cancer and stroke care", "id": "5bdef297-6f91-4911-a75c-ca16aaabf4a8", "content": "Patients are suffering due to wide variations in how many cancer cases are diagnosed at an early stage and who gets the best stroke care, a report has found. The study also found regional differences across other major health issues, including diabetes, hospital admissions and emergency care. It found an almost two-fold difference between the best and worst areas when it came to diagnosing cancer in its earlies stages, before the disease has spread to other organs. \n\nThere was also a five-fold variation between areas in the use of colonoscopy and other procedures which help detect bowel cancer. \n\nAcross England, the percentage of all cancer diagnoses that were made at early stage 1 or 2 ranged from 29.6% to 56% - a 1.9-fold variation. \n\nSimilarly, the percentage of new cases of bowel cancer diagnosed at stage 1 or stage 2 ranged from 17.1% to 48.2% - a 2.8-fold variation. \n\nThe report was compiled by Public Health England (PHE), NHS England and NHS RightCare. \n\nStrokes affect more than 100,000 people a year in England and care on a dedicated stroke unit has been shown to improve survival and reduce the risk of disability.\n\nThose suffering a stroke should be admitted to a stroke unit rather than an assessment unit or general ward.\n\nThe study found the proportion of patients admitted to a stroke unit within four hours of arriving at hospital varied across the country, from 35.1% to 80% - a 2.3-fold variation.\n\nSome variation in NHS care is expected due to issues such as deprivation but some is regarded as \"unwarranted\". \n\nThe report found a 2.5-fold variation in the percentage of key antibiotics prescribed by GPs, from 6.8% to 16.8%. \n\nAnd for patients with diabetes who need annual checks to keep them healthy, there was a 1.7-fold variation in those who got all eight checks, such as on their eyes. \n\nThere was also a 2.7-fold variation in claims by GPs for direct enhanced services for dementia, according to the study, which is called the NHS Atlas of Variation in Healthcare 2015 \n\nBruce Keogh, national medical director of NHS England, said: \" This Atlas exposes some inconvenient truths about the extent of clinical practice variation in care for some common conditions. \n\n\"The good news is that - at a time of financial pressure across the health service - hospitals, GPs and mental health providers have substantial opportunities to unleash greater value from their existing NHS budgets.\" \n\nAlexis Wieroniey, deputy director for policy and influencing at the Stroke Association, said: \"The wide-ranging variation in the time it takes people to be admitted to a stroke unit across England is extremely concerning, and it is unacceptable that too many people are still not admitted to a stroke unit within four hours of their arrival at a hospital. \n\n\"Wherever they live, people must have an equal chance in getting the immediate treatment they need to make their best possible recovery from stroke. \n\n\"The evidence is clear that stroke patients treated on a stroke unit do better than those treated on medical or general wards.\" \n\nNick Ormiston-Smith, Cancer Research UK head of statistics, said: \"Cancer survival is improving, but these statistics show that cancer services are not meeting the needs of all patients.\n\n\"We know that catching cancer early saves lives.\n\n\"Diagnosing the disease at an early stage means patients have the best chance of their treatment being successful.\n\n\"Improving early diagnosis and ensuring patients get the best possible treatments must be a priority for the NHS across the UK.\"", "source": "Belfast Telegraph"}