{"published": "2015-09-27T21:17:17Z", "media-type": "News", "title": "Marijuana bundle drops from sky, slams into family's carport", "id": "bd104c74-afa6-4d79-bf24-3249c7643130", "content": "Maya Donnelly awoke to what sounded like thunder in the early morning hours, but dismissed it as a typical monsoon storm and went back to sleep. \n\nLater that morning, she looked in the carport at her home in Nogales, near the U.S.-Mexico border, and saw pieces of wood on the ground. She found a bulky bundle wrapped in black plastic. \n\nInside was roughly 26 pounds of marijuana — a package that authorities say was worth $10,000 and likely was dropped there accidentally by a drug smuggler's aircraft. \n\n\"It's all right on top of our dog's house,\" Donnelly said of the Sept. 8 incident, which was first reported by the Nogales International newspaper. \"It just made a perfectly round hole through our carport.\" \n\nLiving near the border, Donnelly said she assumed the object was drugs. She immediately called her husband, Bill, who told her to call 911. \n\nThe couple said officers who responded told them an ultralight aircraft smuggling marijuana from Mexico had probably let part of its load go early by accident before dropping the rest farther north, the newspaper reported. \n\nNogales Police Chief Derek Arnson said it's the first time in his three-year tenure that he's ever seen a load of drugs hit a building. \n\n\"Someone definitely made a mistake, and who knows what the outcome of that mistake might be for them,\" Arnson said. \n\nPolice are trying to determine whether the bundle was transported by an aircraft or a pilotless drone. Such runs usually occur at night. \n\nMaya Donnelly said she thinks it's unlikely someone will come looking for the drugs, which are now in police custody. Arnson agreed but said police have boosted patrols in the Donnellys neighborhood for now. \n \nThe family will have to pay the estimated $500 in repairs, as well as pay for a new home for their German Shepherd, Hulk. But the scenario could have been much worse for the couple and their three teenage daughters. \n\n\"Where it landed was clear on the other side of the house from the bedrooms,\" Maya Donnelly said. \"We were lucky in that sense.\" \n\nFriends and family also have gotten a laugh. Several joked that the couple could have profited from the surprise package. \n\n\"That's what everybody says: 'Why did you call 911?'\" Maya Donnelly said. \"But how can you have a clear conscience, right? We could have made lots of home repairs with that.\" \n\n___ \n\nFollow Terry Tang on Twitter at https://twitter.com/ttangAP", "source": "Online La Crosse Tribune"}