{"published": "2015-09-15T07:13:41Z", "media-type": "News", "title": "Overseas entries soaring as Snow Sky, Protectionist Melbourne Cup topweights", "id": "8a217138-15d4-4281-950b-2269adfeb7a6", "content": "Racing Victoria is confident of assembling the most potent international travelling squad for this year's Melbourne Cup after the best credentialled of the contingent, English stayer Snow Sky, was made joint topweight with defending champion Protectionist on Tuesday. \n\nSnow Sky is one of seven internationally trained gallopers confirmed  for the spring carnival as he and Protectionist, both slugged with 58kg for the $6.2 million race, seek to shake the Cup's handicap hoodoo that  has lasted more than half a century. \n\nThe last original topweight to win the Melbourne Cup was in 1950 when Comic Court, the horse Bart Cummings strapped for his father Jim, sailed to victory. \n\nSnow Sky will arrive in the first shipment of overseas horses, which will  include Ed Dunlop's three-time Melbourne Cup runner-up Red Cadeaux and stablemate Trip To Paris, Max Dynamite, Quest For More and Japanese pair Hokko Brave and early favourite Fame Game. \n\nAll are guaranteed starts in the Melbourne Cup with the addition of any of the four nominated Aidan O'Brien-trained runners, Godolphin's European candidates or Big Orange for Michael Bell, are likely to nudge the record of 11 overseas entries set in Dunaden's 2011 triumph. \n\n\"We're a fair way down the path to at least getting 10 runners in the Cup that are internationally trained,\" Racing Victoria's executive general manager of racing Greg Carpenter said after releasing the weights. \n\n\"We don't strive to break numbers or records - it's just wherever horses are trained we are interested in getting the best possible field. \n\n\"When you consider there are only two staying races that are group 1s beyond 2400 metres in England we have the trifecta and first and third. And we've also got the winner of the only Irish race beyond 2400 metres that's a group 1. \n\n\"We've got the best we can assemble and as far as the depth of that quality, it is [the strongest overseas contingent we've had],\" Carpenter said. \n\nThe weight given Protectionist, a stunning four-length winner of the Melbourne Cup last year, did little to surprise new trainer Kris Lees as he nurses the entire towards becoming just the sixth horse to win the race multiple times. \n\n\"It's what we expected and he had to be topweight,\" Lees said. \"I haven't really looked into the others [too closely], but I thought a couple might have been a bit closer to him.\" \n\nHis closest challenger from last year, Red Cadeaux, will meet Protectionist three-and-a-half kilograms better,  having dropped to 55kg in 2015. \n\nThe English cult hero is seeking to become the third horse to run in five straight Melbourne Cups. \n\nThe other 10-year-old gunning for a fifth start in the race, albeit not in consecutive years, James Cummings' Precedence, has also been granted a concession from the handicapper and will shoulder just 52kg if he can force his way into the field. \n\n\"For a horse of his age Red Cadeaux really has the job ahead of him,\" Carpenter said. \"I think it's a race where he could run top five or six, but whether or not the opportunity to win the race has passed him by ... we'll wait and see. \n\n\"And Precedence's immediate challenge is to get past the ballot.\" \n\nLadbrokes have listed Red Cadeaux ($34) and Precedence ($101) as outsiders in their Melbourne Cup market, dominated by Fame Game ($8). Protectionist is a $21 chance to go back-to-back. \n\nLees will use the group 1 George Main Stakes at Randwick on Saturday as a springboard to Protectionist's Melbourne campaign with Lucia Valentina the top pick from his Newcastle yard for the $500,000 group 1. \n\n\"I just want to see him finish the race off and that probably sets a platform to go to Melbourne for some more suitable races,\" Lees said. \"We're desperate for a bit of rain to enhance [Lucia Valentina's] chances, but they reckon it might come.\"", "source": "The Land Australia"}