{"published": "2015-09-22T00:30:30Z", "media-type": "News", "title": "Thailand: Member states must use UN review to demand key human rights commitments", "id": "170d8ad1-524e-483f-9481-ca7bbe946f40", "content": ": UN member states must use the next Universal Periodic Review (UPR) of Thailand to demand key human rights commitments from the government, FIDH, its member organization Union for Civil Liberty (UCL), and its partner organization Internet Law Reform Dialogue (iLaw) said today. \n \nFIDH, UCL, and iLaw made the call with the release of two joint submissions for Thailand’s second UPR, which is scheduled to be held in April 2016 in Geneva, Switzerland. \n \n “UN member states must continue to demand that Thailand bring its repressive laws into compliance with its international obligations with regard to the rights to freedom of opinion, expression, and peaceful assembly,”  said FIDH President Karim Lahidji.  “States must also urge Thailand to take concrete steps towards the abolition of the death penalty,”  he added. \n \nOne submission , prepared by FIDH and iLaw, details how the situation concerning the right to freedom of opinion and expression and the right to peaceful assembly has markedly worsened since Thailand’s first UPR in 2011. \n \nThailand has continued to restrict those rights through the use of legislation and proclamations that are inconsistent with the country’s obligations under international law, notably the International Covenant on Civil and Political Rights (ICCPR) and the International Covenant on Economic, Social, and Cultural Rights (ICESCR). \n \nFollowing the 22 May 2014 coup, the situation has further deteriorated. Numerous orders and announcements issued by the ruling military junta, the National Council for Peace and Order (NCPO), imposed additional restrictions on the right to freedom of opinion and expression and the right to peaceful assembly. This has a resulted in a strict enforcement of a ban on public gatherings, events, and discussions that authorities claimed might affect national security. In addition, authorities have stepped up the intimidation of media workers, censorship, and the overzealous application of lèse-majesté laws. \n \nOf particular concern is the growing number of lèse-majesté arrests and prosecutions under Article 112 of the Thai Criminal Code. The deprivation of liberty and the imposition of disproportionately harsh prison sentences under the pretext of protecting the monarchy intensified significantly after the 22 May 2014 coup. On 22 May 2014, there were six people serving prison terms for offences under Article 112. As of 21 September 2015, that number had gone up to 35 and at least 14 more remained detained awaiting trial. \n \n “Only through a return to genuine democracy can the reform of present laws relating to lèse-majesté, computer crimes, and public protest be achieved, so as to establish full rights to freedom of opinion, expression, and peaceful assembly. At this time, however, the most immediate demands on the NCPO should be to repeal Article 44 of the interim Constitution, rescind all orders restricting freedom of expression and assembly, end the use of military courts to try civilians, and cease all arbitrary detentions,”  said iLaw Executive Director Jon Ungpakorn. \n \nIn a separate joint submission , FIDH and UCL document Thailand’s failure to make real progress towards the abolition of the death penalty. \n \nSince Thailand’s first UPR, there has been no effort to reduce the number of crimes subject to the death penalty. Instead of reducing the number of offenses that are defined as capital crimes, lawmakers introduced new legislation and proposed laws that expand the offenses that can be punished by death. \n \nDrug-related offenses continue to represent a disproportionate share of the crimes for which a death sentence is imposed. Thirty-seven percent of the men and 80% of the women who were under death sentences as of 31 May 2015 had been found guilty of drug-related offenses. \n \nThailand has repeatedly declared its intention to consider abolishing capital punishment. However, many of the official statements have made the abolition of the death penalty contingent on the support of public opinion. Regrettably, successive governments have failed to provide the general public with relevant information to have an informed opinion on the issues related to the death penalty. \n \n “Thailand has considered abolishing the death penalty and issued a plethora of statements to that effect. However, the lack of political will has stifled any meaningful action. Also missing is a government initiative to adequately inform and educate the general public on the issue,”  said UCL Senior Advisor Danthong Breen.  “Despite a steady decline in the number of prisoners under death sentence and no executions for more than six years, abolition remains an elusive goal,”  he added. \n \nThe FIDH-UCL joint submission makes important recommendations to Thailand’s government to take steps towards the abolition of the death penalty. \n \nPress contacts : \n \nMr. Arthur Manet (French, English, Spanish) - Tel: +33672284294 (Paris)", "source": "Fidh"}