{"published": "2015-09-21T03:11:34Z", "media-type": "Blog", "title": "Yes! On the Right Track!", "id": "8427ee7d-7de0-42c2-bf83-0a3eabe5a601", "content": "Events of the weekend brought to mind this passage from Acts 5*:\n\n33 When they [the members of the Sanhedrin] heard this, they were furious and wanted to put them to death. 34 But a Pharisee named Gamaliel, a teacher of the law, who was honored by all the people, stood up in the Sanhedrin and ordered that the men be put outside for a little while. 35 Then he addressed the Sanhedrin: “Men of Israel, consider carefully what you intend to do to these men. 36 Some time ago Theudas appeared, claiming to be somebody, and about four hundred men rallied to him. He was killed, all his followers were dispersed, and it all came to nothing. 37 After him, Judas the Galilean appeared in the days of the census and led a band of people in revolt. He too was killed, and all his followers were scattered. 38 Therefore, in the present case I advise you: Leave these men alone! Let them go! For if their purpose or activity is of human origin, it will fail. 39 But if it is from God, you will not be able to stop these men; you will only find yourselves fighting against God.”\n\n40 His speech persuaded them. They called the apostles in and had them flogged. Then they ordered them not to speak in the name of Jesus, and let them go.\n\n41 The apostles left the Sanhedrin, rejoicing because they had been counted worthy of suffering disgrace for the Name. 42 Day after day, in the temple courts and from house to house, they never stopped teaching and proclaiming the good news that Jesus is the Messiah.\n\nWhen someone who is \"religious\" tells you that speaking the truth is wrong and that preaching the Word of God is wrong, then that tells me I am totally on the right track.  Satan used someone this weekend to try to undermine the message of love that fills the entire Bible; that came to completeness in the life, teachings, death, and resurrection of Jesus Christ; and that, paired with \"don't judge others, 'cause your life is just as messy,\" exemplifies how we Christians should live.  It's small in the realm of persecutions, but it lets me know I'm on the right track, that Satan doesn't like that message.  So I'm gonna just rock on with preaching this word of God's love and acceptance for all people; it's beautifully inclusive.\n\n\"I bring you good tidings of great joy which shall be for all people...\" (Luke 2:10)\n\n\"For God so loved the world that He gave his one and only Son, that whosoever believes in him shall not perish, but have everlasting life\" (John 3:16).\n\n \n\n \n\n*Scripture references are from the New International Version of the Holy Bible.\n\n \nRelated articles\n\n\tThe Spirit Speaks - of Love\n\tSimply Trust\n\tGod Has Changed the Goalposts?", "source": "A Mom's Life"}