{"published": "2015-09-22T21:13:27Z", "media-type": "Blog", "title": "BOOK OF DEATH: THE FALL OF X-O MANOWAR #1 preview", "id": "ac116355-1353-40b8-b20b-4ddfd543ad52", "content": "As BOOK OF DEATH reaches its final chapter this October, Robert Venditti and Clayton Henry are flashing forward to reveal the stunning last stand of Valiant’s most formidable hero…the unstoppable X-O Manowar! Valiant is proud to present an advance preview of BOOK OF DEATH: THE FALL OF X-O MANOWAR #1 – the next essential one-shot at the heart of Valiant’s cataclysmic summer event from New York Times best-selling writer Robert Venditti (WRATH OF THE ETERNAL WARRIOR) and Harvey Award-nominated artist Clayton Henry (ARCHER & ARMSTRONG)! On October 21th, before BOOK OF DEATH reveals its widespread ramifications for the heroes of today, discover the world that awaits Valiant’s alien-armored Visigoth in the century yet to come as Aric of Dacia’s journey from past to future comes full circle! After hundreds of years in exile on an alien planet, Aric of Dacia – better known to the world as the unstoppable hero called X-O Manowar – has returned to an unfamiliar Earth, only to find a planet that doesn’t remember…or want him. Can X-O Manowar finally find happiness in the aftermath of the apocalypse? Plus: the ultimate fate of the X-O Manowar armor, Shanhara, stands revealed…and a new generation of Valiant heroes get ready to take flight in defense of a radically transformed planet Earth! This October, as BOOK OF DEATH closes, Valiant superstars Robert Venditti and Clayton Henry begin a new chapter in BOOK OF DEATH: THE FALL OF X-O MANOWAR #1 – a special standalone tale ripped from the pages of the summer’s most acclaimed event! Featuring covers by Cary Nord (X-O MANOWAR), Stephen Segovia (Convergence), Ryan Lee (Uncanny Inhumans), and Diego Bernard (UNITY), don’t miss the final fall of the hero that kicked the Valiant Universe into action, only in BOOK OF DEATH: THE FALL OF X-O MANOWAR #1 – on sale October 21st! Then, one week later on October 28th, the final reckoning between Master Darque, the Eternal Warrior, and the heroes of the Valiant Universe begins in BOOK OF DEATH #4 (of 4) – the apocalyptic 40-page finale from all-star creators Robert Venditti, Robert Gill, and Doug Braithwaite! As an evil Geomancer tears our world asunder, all will be revealed as the future promised in the Book of the Geomancer comes to bear! So let it be written, so let it be done… Also featuring an exclusive WRATH OF THE ETERNAL WARRIOR PREVIEW EDITION on its reverse side, witness the stunning final pages of Valiant’s earth-shaking event…and then begin the journey towards the next landmark ongoing series that begins in its wake, only in BOOK OF DEATH #4 (of 4) – on sale October 28th! BOOK OF DEATH: THE FALL OF X-O MANOWAR #1\nWritten by ROBERT VENDITTI\nArt by CLAYTON HENRY\nCover A by CARY NORD (AUG151762)\nCover B by STEPHEN SEGOVIA (AUG151763)\nVariant Cover by RYAN LEE (AUG151764)\nVariant Cover by DIEGO BERNARD (AUG151764)\n$3.99 | 32 pgs. | T+ | ONE-SHOT | On Sale OCTOBER 21 (FOC – 9/28/15) BOOK OF DEATH #4 (of 4)\nWritten by ROBERT VENDITTI\nArt by ROBERT GILL & DOUG BRAITHWAITE\nCover A by CARY NORD (AUG151757)\nCover B by MICO SUAYAN (AUG151758)\nCover C by MARGUERITE SAUVAGE (AUG151759)\nValiant Icons Variant Cover by PERE PEREZ (AUG151760)\nArtist Variant by PAOLO RIVERA (AUG151761)\n$3.99 | 32 pgs. | T+ |On Sale OCTOBER 28 (FOC – 10/5/15) For more information, visit Valiant on Facebook, Twitter, Tumblr, and at ValiantUniverse.com. For Valiant merchandise and more, visit ValiantStore.com. BOOK OF DEATH: THE FALL OF X-O MANOWAR #1 – Cover A by Cary Nord\nBOOK OF DEATH: THE FALL OF X-O MANOWAR #1 – Cover B by Stephen Segovia\nBOOK OF DEATH: THE FALL OF X-O MANOWAR #1 – Variant Cover by Ryan Lee BOOK OF DEATH: THE FALL OF X-O MANOWAR #1 – Variant Cover by Diego Bernard BOOK OF DEATH #4 (of 4) – Cover A by Cary Nord WRATH OF THE ETERNAL WARRIOR PREVIEW EDITION – Available as Flipbook with BOOK OF DEATH #4 (of 4)", "source": "firstcomicsnews.com"}