{"published": "2015-09-04T05:42:54Z", "media-type": "News", "title": "Carclo plc Given Hold Rating at N+1 Singer (CAR)", "id": "ecc20144-2d65-43cb-adab-9a9f6559f4f6", "content": "N+1 Singer reiterated their hold rating on shares of Carclo plc (LON:CAR) in a report issued on Thursday morning, Analyst Ratings Net reports. They currently have a GBX 148 ($2.28) price objective on the stock. Separately, Peel Hunt reiterated a buy rating and issued a GBX 180 ($2.77) price target on shares of Carclo plc… \r \nN+1 Singer reiterated their hold rating on shares of Carclo plc (LON:CAR) in a report issued on Thursday morning, Analyst Ratings Net reports. They currently have a GBX 148 ($2.28) price objective on the stock. \n\nSeparately, Peel Hunt reiterated a buy rating and issued a GBX 180 ($2.77) price target on shares of Carclo plc in a research note on Wednesday, June 17th. \n\nShares of Carclo plc (LON:CAR) opened at 148.94 on Thursday. Carclo plc has a 1-year low of GBX 80.00 and a 1-year high of GBX 169.75. The firm’s 50 day moving average price is GBX 144.51 and its 200-day moving average price is GBX 143.07. The company’s market capitalization is GBX 98.59 million. \n\nThe firm also recently declared a dividend, which will be paid on Friday, October 2nd. Shareholders of record on Thursday, August 27th will be paid a GBX 1.90 ($0.03) dividend. This represents a yield of 1.29%. The ex-dividend date of this dividend is Thursday, August 27th. \n\nIn related news, insider Michael Derbyshire bought 10,000 shares of the company’s stock in a transaction that occurred on Wednesday, June 10th. The shares were purchased at an average cost of GBX 146.94 ($2.26) per share, with a total value of £14,694 ($22,647.97). \n\nCarclo plc is a United Kingdom-based technology led plastics company. The Company is engaged in manufacturing of fine tolerance parts for the Medical,Industrial, Aerospace and Luxury and Supercar Lighting markets. The Company’s operating segments include Carclo Technical Plastics (LON:CAR) manufacture of fine-tolerance moulded plastic components which are used in medical, optical and electronics products; The companies within the LED Technologies and Precisio…", "source": "MyInforms"}