{"published": "2015-09-24T12:00:00Z", "media-type": "News", "title": "A 48-Hour Guide To Seattle", "id": "23d468a7-ced5-496c-bad3-91b9bbc0908c", "content": "Make plans to escape from your day-to-day life and spend a weekend in Seattle. There are so many things to see and do in the area; many find this the perfect place to plan a quick 48-hour getaway. Visitors will be able to see popular attractions and city icons all while being kept busy from sunup to long past sunset. It is no wonder why so many enjoy visiting Seattle — even if it is just for 48 hours. Here are some of the must-see attractions in Seattle during your upcoming 48-hour getaway:   \nPhoto Credit: Thinkstock \n \nSpace Needle \n 400 Broad St. \nSeattle, WA 98109 \n(206) 905-2100 \n SpaceNeedle.com \n \nWhen asking others what the most iconic symbol of Seattle is, it’s undoubtedly the Space Needle. This vertical icon was built back in 1962 for the World’s Fair and stands 605 feet tall. Visitors will have an amazing 360-degree view of the city below and all of the surrounding areas, including an outline of the Cascades off on the horizon. The SkyCity Restaurant is open for brunch, lunch and dinner daily, offering amazing views and a mouthwatering menu. \n \nThe unique design of the Space Needle looks like a spaceship set up on stilts and hovers over the Seattle Center,  home to the Pacific Science Center, a food court, theaters and a giant outdoor fountain. The Space Needle is easily accessible by using the Seattle Center Monorai l, which travels from the Westlake Center in downtown Seattle. \n \nAt the time of publication, the Space Needle is open daily from 8 a.m. until midnight. The SkyCity Restaurant is open daily from 9:30 a.m. until 9:45 p.m. Parking is available at the Space Needle in three-hour blocks, with prices starting at $12 and valet service is available for $25 for three hours. Less expensive parking lots are nearby, however, they are not conveniently located, which could make it a long walk. \n \nPopular hotels among visitors wanting to enjoy the Space Needle include the Hyatt House Seattle/Downtown , The Maxwell Hotel,  Mediterranean Inn and Hotel Five Seattle. \n   \nPike Place Market \n 1 st Avenue & Pike St. \nSeattle, WA 98101 \n(206) 683-7453 \n PikePlaceMarket.org \n \nNo visit to Seattle is complete without a stop at Pike Place Market. This premier shopping area focuses on supplying the finest specialty foods, freshest produce and is home to some unique and independent businesses. Since 1907, this market has been the epicenter for residents and farmers to gather for shopping, dining and entertainment fun. The Pike Place Market is set on nine acres in the historic district of Seattle, featuring more than 200 unique shops, more than 80 restaurants and a bustling crafts market. \n \nThose visiting Pike Place Market will discover there is no need to go anywhere else when looking for a place to grab a bite to eat. This market is home to several quick-service restaurants for those wanting to eat on the go and formal, fine dining establishments for those wanting a more luxurious meal. Guests will find everything from bakeries to cafes and bistros to take-out counters within nine acres of the market. \n \nPike Place Market is located just to the east of the waterfront in Downtown Seattle. Parking is available in the Public Market Garage (1531 Western Ave.) for $3 per hour for up to four hours. Valet parking is also available from 6 p.m. until midnight on Thursdays through Saturdays. The market is accessible through  public transportation  from the Sea-Trac Airport and surrounding neighborhoods, as well. \n \nAt the time of publication, general market hours for merchants is from 10 a.m. until 6 p.m., the crafts market is open from 10 a.m. until 4 p.m. and most restaurants are open from 6 a.m. until 1:30 a.m. the fresh produce and seafood market opens daily at 7 a.m. Pike Place Market is closed on Thanksgiving and Christmas days. \n \nThose wishing to spend two days exploring Pike Place Market will find nearby accommodations at the Seattle Marriott Waterfront , the Inn at the Market , Alexis Hotel and Four Seasons Hotel Seattle . \n \nRelated:  Top Paninis in Seattle \n   \nPhoto Credit: Thinkstock \n \nWashington State Ferries \n 2901 Third Ave., Suite 500 \nSeattle, WA 98121 \n(206) 515-3400 \n WSDOT.Wa.gov \n \nAnother icon of Seattle is the high number of ferry boats that speckle the waterways surrounding the area. The Washington State Ferries offer a unique way to see the city by offering some of the prettiest views available. Depending upon the ferry boat, sites seen along the way can include Mount Rainier and the downtown Seattle Waterfront. Ferry boats can be boarded with a car or as a walking passenger. By enjoying the boats as a walk-on passenger, visitors will find a fun, unique and inexpensive sightseeing boat ride. \n \nThose wanting to make a day out of riding the ferry boat, followed by a night of shopping and dining, will want to board the ferry at Pier 52. This pier is located in the downtown Seattle waterfront area and is close to many restaurants, cafes and shops. This location is within walking distance to many of the must-see attractions the area has to offer. \n \nVisitors wanting a little bit more than just a short ferry boat ride can find longer rides to Victoria, British Columbia and links to the Alaska Marine Highways. No matter which ferry boat route is selected, passengers are sure to see some of the area’s most historic sites and breathtakingly picturesque destinations. \n \nFare prices vary depending upon destination and if there is a car or not. Click here to see the complete list of fares for the different Washington State Ferries. \n   \nMuseum Of History And Industry \n 860 Terry Ave. N \nSeattle, WA 98109 \n(206) 324-1126 \n MOHAI.org \n \nThe Museum of History and Industry has become a popular place for both residents and visitors to explore while in Seattle. This museum offers a place to discover more about Seattle’s past, present and future while connecting with the rich history of the region. The story of Seattle is told through a variety of rare objects, historic images and interactive, hands-on experiences designed for all ages. Visitors will also hear about the stories of those who built Seattle up from wilderness into the exciting city it is today. \n \nExhibits at the Museum of History and Industry include Maritime Seattle, Bezos Center for Innovation and True Northwest: The Seattle Journey. The museum also hosts temporary exhibits, including American Spirits, which is currently on exhibit, and The Legacy of Seattle Hip-Hop, which is expected to open mid-September 2015. \n \nCurrently, the museum is open daily from 10 a.m. until 5 p.m. and is open until 8 p.m. on Thursdays. At the time of publication, admission to the museum is $17 for adults, $15 for seniors (62+), $14 for students and members of the military and children 14 and under are free. Free admission is offered to all visitors on the first Thursday of the month. \n \nThose wanting to grab a quick bite to eat can enjoy a selection of sandwiches, soups, salads and other quick-grab bites at the Compass Café, located within the museum. There are also plenty of restaurants located in neighboring areas of the museum. Popular restaurants near the Museum of History and Industry include Daniel’s Broiler , Art Marble 21 , Novilhos,  Chandler’s Crabhouse and Duke’s Chowder House. \n \nThere are also a variety of hotels available in the area surrounding the Museum of History and Industry, including Pan Pacific Hotel Seattle , The Maxwell Hotel , Courtyard Downtown Seattle , Hotel Max and Warwick Seattle Hotel . All of these hotels will put visitors close to the museum and other downtown Seattle attractions. \n   \nPhoto Credit: Thinkstock \n \nDowntown Waterfront \nWaterfront Park \n1301 Alaskan Way \nSeattle, WA 98101 \n(206) 623-0340 \n DowntownSeattle.com \n \nThe Downtown Waterfront area is home some of the state’s best shopping, lodging, restaurants and activities. There is so much to see and do in the area that even the longtime residents are always finding something new to enjoy in this area of Seattle. The Downtown Waterfront area is home to dozens of gourmet restaurants that are sure to please every palate and budget. Make sure to check out the variety of food trucks that make their way through the downtown area, offering a variety of grab-and-go menu options. With more than 1,000 different retailers, this area offers top-notch shopping experiences for those looking for high-end clothing, affordable décor and everything in between. \n \nIn addition to shopping and dining in the Downtown Waterfront area of Seattle, visitors will find plenty of things to do during their 48-hour visit. Activities in this area include experiencing the lively nightlife, exploring local tourist attractions, seeing the vibrant culture and spending time getting an up-close look into the performing arts community. Area attractions include the Seattle Aquarium and the Seattle Great Wheel . This area of Seattle is also home to many annual events, including Summer in Seattle and Holidays in Seattle. \n \nBeing located in the heart of Seattle, those wanting to explore the Downtown Waterfront area will have no problem finding a place to stay. This area is home to boutique hotels, large convention hotels and restored historic hotels. Popular hotels for those wanting to be close to all of the Seattle action include MOTIFF Seattle , Hotel Monaco , Hotel Vintage Park , Mayflower Park Hotel and the Sheraton Seattle Hotel and Towers . \n \nBy planning a quick 48-hour getaway to Seattle, visitors will be able to see historic icons, dine at unique restaurants and experience life traveling via ferry boat. It’s just proof that visiting Seattle offers a unique vacation getaway experience. \n \nRelated: Best Boutique Décor Shops In Seattle Malls \n  \nHeather Landon (Heather Leigh Carroll) is a freelance writer with more than 20 years of experience. She has combined two of her passions – writing and travel – to share her experiences with others. You can read more of her articles at Examiner.com .", "source": "CBS Seattle"}