{"published": "2015-09-22T09:38:51Z", "media-type": "Blog", "title": "MIT Technology... on y revient... About things, human beings & planet... & books...", "id": "1f08993d-c892-468e-80ab-ef265c2a0f4e", "content": "MIT Technology Review events consistently attract senior-level business and technology decision makers who drive the global innovation economy. http://www.technologyreview.com/emtech/14. La technologie dans un monde GLOBAL.\nhttp://www.technologyreview.com/news/531206/emtech-qualcomm-working-to-build-artificial-intelligence-into-smartphones.\nhttp://www.technologyreview.com/news/540851/microsoft-says-programmable-chips-will-make-software-smarter.\nhttp://www.technologyreview.com/news/532666/googles-brain-inspired-software-describes-what-it-sees-in-compleX-images.\nhttp://mscoco.cloudapp.net... Microsoft et coco. C'est quoi?\nhttps://research.facebook.com/... International Conference in Computer Vision and Pattern Recognition (CVPR)- 1 juni. C'est quoi?\nEmTech MIT Monday, November 02, 2015 - Wednesday, November 04, 2015 Massachusetts Institute of Technology\nCambridge, Massachusetts 02139\nUnited States\nMIT Technology Review leads the global conversation about the technologies that matter. We identify the technologies and innovators who have the greatest potential to change business, society, and the world for the better.\nEmTech MIT brings this editorial content to life. It’s an opportunity to discover future trends and begin to understand the technologies that will drive the new global economy. It’s where technology, business, and culture converge, and where you gain access to the most innovative people and companies in the world.\nThe 15th annual EmTech MIT takes a look back at some of the innovation hits and misses you’ve seen on our stage over the years and celebrates the 2015 Innovators Under 35.\n[...]\nAttendee Code of Conduct\nThe mission of MIT Technology Review is to inform our audience about important new technologies. We have curated a series of discussions that includes a wide range of views on the most significant technologies and trends of the year. We value diversity of ideas and perspectives from our speakers and our audience. We are proud to bring varying points of view to our stage, and are committed to providing a respectful environment for our speakers and audience. By joining us at EmTech MIT, you agree to maintain a respectful environment during all conference events. [...]\nhttp://www.XboX.com/nl-nl pour les salons européens.\nThe Internet of Things Is Here\nHow will our lives change now that there are twice as many things connected to the Internet as human beings on the planet?\nP.s: A quoi servent les téléphones très intelligents eXactement? Une question que l'on pose en direct auX lecteurs américains. Sur la Business Ethics toujours. L'éthique dans les affaires autrement dit. Et si on réfléchissait un peu tous ensemble?", "source": "Le blog de l'âne of  Ezelblog"}