{"published": "2015-09-08T05:00:00Z", "media-type": "News", "title": "The ABCs of skincare: How to head back-to-school with confidence and clear skin", "id": "12d67dd1-8025-4470-ab1a-8f1a2b5c68d8", "content": "(BPT) - The summer sun might still be hot, but it’s time to hit the books and go back-to-school. Teenagers do many things to make sure they go to the classroom with confidence: buy school supplies, get a haircut and plan their perfect first day of school outfit. But they may be forgetting one important thing: a proper skincare routine. \n  \nTeenagers already have so much to worry about, they shouldn’t have to worry about getting a zit, too. According to the American Academy of Dermatology Association, approximately 40 to 50 million Americans are affected by acne annually. But a proper skincare regimen can help prevent acne before it starts. \n \nA regular skincare routine will help to not only keep their skin clear, but boost their mood and embrace their natural beauty. The PanOxyl brand, a portfolio of dermatologist recommended acne management products, makes it easier for teens to be hands-on with their skincare regimen so they are prepared and self-assured to start classes. \n \nIt’s important for teenagers to have an accessible skincare routine that is easy for them to manage and to maintain, without their parents having to remind them. This routine is the best way to avoid breakouts to help teens feel comfortable in their own skin now and well into their adult years. \n \nKey tips that can help contribute to clearer skin, include: \n \n* Keep hands off face to reduce the spread of bacteria \n \n* For girls, wearing non-comedogenic makeup to prevent clogging pores \n \n* Change your pillowcase more often \n \n* Daily use of over-the-counter benzoyl peroxide products (BPO), like a cleanser \n \n* As a supplement to a cleanser, use of a spot treatment in trouble areas \n \n* Don’t scrub too hard; exfoliating too forcefully can irritate skin and clog pores \n \n* Eat nutritious foods that will keep you and your skin healthy \n \n* Wash face right after any physical activity or using athletic equipment, such as helmets or chin straps \n \n* Don’t cram for exams and keep your stress low by giving yourself time to relax \n \nWhen looking to clear your face of blemishes, daily use of benzoyl peroxide products, like PanOxyl, are an excellent solution for acne treatment and to help prevent acne. BPO is recommended by most dermatologists for the treatment of acne. \n \nFor additional information on PanOxyl, visit www.panoxyl.com .", "source": "High Plains Journal"}