{"published": "2015-09-01T21:05:51Z", "media-type": "News", "title": "'Star Wars: Battlefront' getting beta prior to release", "id": "d5fe014f-eb6e-48a9-8e4d-b8e87e41a2ae", "content": "Star Wars fans will get an early look at their next most anticipated game, Star Wars: Battlefront . Fans have asked if there would be a beta, and it will come about a month prior to release. Electronic Arts , today, announced that the beta will be available in Early October, with no official date announced. Announced last April and playable at E3 2015, Star Wars: Battlefront showcases phenomenal visuals and stays true to the original games. It is not just Battlefield 4 repackaged with Star Wars skins. The beta will be available on PlayStation 4, Xbox One , and on PC via Origin. \n \nElectronic Arts states that the beta will be a “technical test” that will feature Walker Assault on Hoth. This is a 40-player multiplayer battle featuring Rebels and the Empire. This also gives fans the chance to play as the two most iconic characters from the Star Wars Universe, Darth Vader and Luke Skywalker. On top of the multiplayer battle, it will also feature the Survival Mission on Tatooine. This is where you and a Rebel friend must fight off waves of Imperial forces. If you have ever been a fan of this mode in any other games, it is exactly what you expect and extremely fun and gorgeous. \n \nAlso announced in the beta will be the brand-new mode known as Drop Zone. Electronic Arts will release more details on Drop Zone in the coming weeks leading up to the beta. Outside of the beta, EA also announced the Star Wars Battlefront Companion experience. You can get it here during the beta. The experience features a strategic card game called Base Command. It lets you earn in-game credits that unlock Star Cards, weapons, and more in Battlefront . Game stats can also be checked here along with customizing load outs and appearances so players do not have to do this in-game. Stay tuned for more in the coming weeks about the Star Wars: Battlefront beta.", "source": "Examiner.com"}