{"published": "2015-09-14T20:16:31Z", "media-type": "News", "title": "Patterson: Obama, Reid ‘bonkers’ in targeting Koch Brothers", "id": "c60ea5fd-e163-4baa-84ea-020e9746ada4", "content": "“Pick the target, freeze it, personalize it and polarize it.” Thus reads the famous Rule 13 of Saul Alinsky’s Rules for Radicals, the manual written by the original radical community organizer from Chicago. It was intended to instruct followers on using disruption, deception and conflict to bring about a “transformation” of American society. \n  \nHis most famous acolyte, Barack Obama, would have made the master proud with his outstanding effort to freeze, personalize and polarize the Koch brothers during his recent remarks to the National Clean Energy Summit. Obama didn’t bother to make the case for more solar energy subsidies and loans. Instead, he criticized the Koch brothers personally for “pushing for new laws to…prevent new clean energy businesses from succeeding.” \n \n“That’s not the American way. That’s not progress. That’s not innovation. That’s rent seeking.” \n \nAlthough it didn’t matter to him, our truth-challenged president was wrong on all counts. It appears that Obama is confused about the definition of rent seeking, which means obtaining government favors to benefit your own personal interests. In fact, it was the president in his speech who was advocating more rent seeking behavior, more subsidies like the Solyndra loan that went to his campaign supporters in spite of agency concerns and ended up costing taxpayers $500 million.Obama also claimed the Kochs were hypocritical for being pro free-market except for their opposition to more solar subsidies. Again, that’s just bonkers because solar is one of the least “free-market” of all industrial sectors (it is subsidized and mandated) while the Kochs have consistently opposed all subsidies, including to their own industry, oil and gas. \n \nPresident Obama isn’t alone in demonizing the Kochs. Their most fervent critic has to be Sen. Harry Reid of Nevada who has reportedly used his Senate staff and resources to rant against the “shadowy billionaires.” He has spoken over 50 times on the floor of the Senate and appeared 132 times on YouTube, accusing them of everything from wanting to “abolish” Social Security to attempting to “buy America.” \n \nBut Alinsky’s tactics work. The left has done such a great job of vilifying the Kochs that simply being linked with them is considered, in some circles, prima fascia evidence of guilt by association. Thus pundits like E.J. Montini condemned ASU for accepting a donation from the Kochs to help establish an academic chair to explore conservative issues, just because it was the Kochs. Other donors, of course, are fine. \n \nBut why are the Kochs the object of such virulent criticism? They are an American success story, having built the second-largest private company in the United States. Koch Industries is the source of jobs for 100,000 families worldwide and supplies energy, fertilizer and household goods in 60 countries. \n \nThe Kochs are incredibly generous philanthropists. They have donated billions to programs that foster entrepreneurship, education, human services, help for at-risk youth, arts and culture, medical research and environmental stewardship, as well as political and ideological causes. \n \nTheir website states that their philanthropy is grounded in the “belief that free societies are the greatest generators of social progress, sustainable prosperity and well-being.” That’s the problem, in the mind of the progressives. \n \nOther successful American families have rejected the free-market economics that provided the opportunity and freedom for themselves and millions of others. If the Kochs had joined the Fords, Rockefellers and others in denigrating capitalism, once their fortunes were made, they never would have been exposed to the relentless criticism they have endured. \n \nIn the end, attitudes about the Kochs say more about their accusers than it does about them. The Kochs are doggedly determined to bring the blessings of limited government and economic freedom to as many people as possible, whether or not that benefits them or their company. \n \nTo Obama, Reid and their ilk, soaked in a culture of total politicization, where self-seeking behavior is near universal, the notion that the Kochs are simply doing what they believe is the right thing to do is incomprehensible. According to Alinsky, they’re in the way and must be brought down. \n \n• East Valley resident Tom Patterson is a retired physician and former state senator. He can be reached at pattersontomc@cox.net . \n   \n• Check us out and like The East Valley Tribune on", "source": "East Valley Tribune"}