{"published": "2015-09-08T19:37:03Z", "media-type": "News", "title": "Miners’ clean sweep", "id": "a3475df7-08d4-4932-955a-fb95b166c7ad", "content": "The Roxby Miners made a clean sweep of the Roxby Downs Netball Association senior grand finals on Friday night. \nLocals flocked to the courts in their team colours to witness the A, B and C grade games. \nThe tension was high and emotions were close to boiling point as players and spectators prepared for the first whistle. \nOpening the night was East Roxby B grade against Roxby Miners in a highly anticipated rematch of this year’s semi-final game.  \nAfter the Miners’ disappointing loss in the semi-finals, they took the court with renewed vigour and determination.  \nIn a surprising move Miners coach Tony Weir elected to retain B grade Best and Fairest Renee Wurfel on the bench for the first quarter.  \nThis sent trembled whispers throughout the stands as many wondered at Weir’s game plan.  \nThe Miners took the first centre pass, resulting in the first goal to steady their nerves, with Emma Neilson leading the charge.  \nEast Roxby’s Jess Hassett and Karen Wegner did not let this rattle their calm and worked hard in the goal ring to gain momentum and keep within three goals of the Miners’ lead at the first quarter break, 13-10.  \nThe second quarter saw Wurfel take the court in a flurry of action, creating an immediate impact on the game.  \nSpectators held their breaths when Miners goal defence Mikayla Davis went down with an injury and had to be assisted from the court in the second quarter and was unable to return.  \nCentres Holly Mortimer (Miners) and Demmy Orr (East Roxby) fought hard for the ball and created turnovers. Their battle continued throughout the game, with both players providing an engaging display.  \nAt half time the Miners had found their stride and took a 10-goal lead, 28-18.  \nThe third quarter saw the Roos gain ground, scoring 12 goals to the Miners’ 10, however this failed to curb their opponents’ 38-30 lead.  \nThe supporters in their red and white, along with the sea of blue and white, voiced their encouragement in the fourth nail-biting quarter, with the Miners maintaining their lead into the final whistle, 49-39. \nWurfel received the Best on Court award as part of her team’s first B grade premiership since 2011.  \nThe crowd of red and white moved over to support the C grade interclub clash between Roxby Miners Red and the young guns, Roxby Miners White.  \n\nBoth teams came out strong in a tense and nerve-wracking first quarter, with Miners Red taking the first three goals as defenders Amy Turley and Laura Johnson worked hard to keep Miners White’s shooters at bay.  \nMiners White took a one-goal lead heading into the first break, 10-9.  \nMid-court pocket rockets Millie Young and Matilda Cordy were hard and fast when working the ball down the court and feeding into the goal ring.  \nMiners White increased its lead to eight goals at half time, 26-18.  \nThe side came out renewed and revitalised after the break, while Miners Red appeared to be pushing to keep up. \nDynamic duo Hayley Wurfel and Miranda Syvertsen (Miners White) worked the Miners Red defenders hard with their fast pace and scoring accuracy.  \nThe third quarter saw Miners White start to pull away on the score board as players worked to increase their lead to 17 goals, 43-26.  \nIt was a disappointing and bitter-sweet ending for Miners Red as Miners White took out the game by 19 goals, 55-36.  \nContinuing the trend, another Wurfel won Best on Court. \nThe final match of the night saw the highly anticipated A grade clash between reigning champions Roxby Miners and the underdogs, the Hornridge Magpies, who until the last games of the season were without a set team.  \nThe first quarter was goal for goal, with both sides unable to get the upper hand. \nCentre passes tended to generate a goal for the corresponding team, and Hornridge was able to keep the Miners’ mid-court from dominating. \nThe first quarter break saw the Miners gain a one-goal lead, 16-15, and the crowd’s excitement built at the possibility of an upset.  \nHowever, the Magpies were unable to maintain the intense pressure of the first quarter and the Miners began to forge ahead, with defenders Hannah Wurfel and Georgia Mandemaker blocking opportunities for Hornridge goalies Jemma Howe and Amanda Giles.  \nThe score line going into half time saw the Miners up by six goals, 32-26, with Hornridge still in the game.  \nIn the third quarter Kelsey Hampel (Miners) dominated the mid-court as centre, pushing her counterpart Georgia Sleep hard, creating turnovers and disrupting the Magpies’ line of play.  \nThe tension and emotive atmosphere of the third quarter saw the umpires further resorting to the whistle as players fought hard for control of the ball.  \nHornridge goal keeper Fiona Hooper had an uphill battle against Miners powerhouse Joice Takaidza, though she did create some outstanding turnovers.  \nThe Miners had a 13-goal lead by the end of the final break, 47-34.  \nIn the final quarter, the Miners changed player positions with Elly Anderson moving into goal defence, Hannah Wurfel into centre and Kelsey Hampel on wing defence.  \nThe Miners’ fitness and agility allowed them to increase the pace of the game to move the ball quickly down the court and push Hornridge hard.  \nIn the final throes of the game, Takaidza left the court to allow Erika Syvertsen a run in the goals for the last few minutes.  \nThe final whistle saw the Miners take the 2015 premiership by 21 goals, 65-44.  \nCompleting a clean sweep for her family, Best on Court went to Hannah Wurfel.  ", "source": "Roxby Downs Monitor"}