{"published": "2015-09-07T16:10:23Z", "media-type": "News", "title": "The Elite Have Prepared For The Coming Collapse – Have You?", "id": "8bee571d-7414-4cf0-9828-84de660986a6", "content": "Submitted by Michael Snyder via The Economic Collapse blog, \n \nWhy are the global elite buying extremely remote compounds that come with their own private airstrips in the middle of nowhere on the other side of the planet?  And why did they start dumping stocks like crazy earlier this year?  Do they know something that the rest of us don’t?   The things that I am about to share with you are quite alarming.  It appears that the global elite have a really good idea of what is coming, and they have already taken substantial steps to prepare for it.  Sadly, most of the general population is absolutely clueless about the financial collapse that is about to take place, and thus most of them will be completely blindsided by it . \n \nAs I discussed the other day , the only way that you make money in the stock market is if you get out in time.  The elite understand this very well, and that is why they have been dumping stocks for months.  This is something that has even been reported in the mainstream news.  For example, this comes from a CNBC article that was published on June 16th … \n \nThe so-called smart money is pulling back from market risk, with fund managers taking down exposure to stocks , increasing cash holdings and buying protection against a sharp selloff . \n  \nAbout two weeks before that, I discussed the same phenomenon on my website.  The article that I published on May 30th was entitled “ Why Is The Smart Money Suddenly Getting Out Of Stocks And Real Estate? ” \n \nDid the “smart money” know what was about to happen?  Since the peak of the market, the Dow has already lost more than 2200 points .  All of the gains since the end of the 2013 calendar year have already been completely wiped out. \n \nAnd of course the truth is that you didn’t really need any inside information to see that it was time to get out.  I have been warning my readers for months about what was coming.  The signs have been clear as a bell if you were willing to look at them.  Just consider the following excerpt from a recent piece  by Michael Pento … \n \nEarlier in the year margin debt had risen over $30 billion or 6.5% to $507 billion and was equal to a record 2.87% of U.S. GDP . This surpasses the previous all-time high of 2.78% set in March 2000 – the top of the last largest stock market bubble in history . \n \nAnd despite the assurance of every mutual fund manager on TV that they have boatloads of cash ready to deploy at these “discounted” levels, in early August cash levels at mutual funds sank to their lowest level in history , 3.2% (see chart below). As a percentage of stock market capitalization, fund cash levels are also nearing the record low set in 2000 when the NASDAQ peaked and subsequently crashed by around 80% . \n  \nThe financial markets are absolutely primed for a major crash, and when that happens many among the elite will be hightailing it to the middle of nowhere. \n \nEarlier this year, the Mirror published an article all about this entitled “ Panicked super rich buying boltholes with private airstrips to escape if poor rise up “.   Here is a brief excerpt… \n \nRobert Johnson, president of the Institute of New Economic Thinking, told people at the World Economic Forum in Davos that many hedge fund managers were already planning their escapes. \n \nHe said: “I know hedge fund managers all over the world who are buying airstrips and farms in places like New Zealand because they think they need a getaway.” \n  \nKeep in mind that these are not just some rumors that Robert Johnson has heard.  These are people that he knows personally and that he interacts with regularly. \n \nAnd Robert Johnson was not alone in this assessment.  Here is more  from the Mirror … \n \nHis comments were backed up by Stewart Wallis, executive director of the New Economics Foundation, who when asked about the comments told CNBC Africa: “Getaway cars, the airstrips in New Zealand and all that sort of thing, so basically a way to get off. \n \n“If they can get off, onto another planet, some of them would.” \n  \nFor some reason, the global elite seem to have a particular affinity for New Zealand.   Perhaps it is because of the great natural beauty of the nation combined with the fact that it is in the middle of nowhere.  The following comes from  the Daily Mail … \n \nNew Zealand , which is about the size of the UK, but has a population of just 4.4 million, offers them all the modern luxuries they have come to expect – but miles from any country which may implode into chaos . \n \nThe country is 11,658 miles away from the UK, while its closest neighbour is Fiji – 1,612 miles away, more than double the distance between Lands End and John O’Groats. \n \nHomes at the top end of the market come with tennis courts, swimming pools and media rooms – and some even boast their own personal jetties where a family can moor their boat. \n \nBut the icing on the cake for those looking to make a quick escape comes in the form of private helipads or, better, your own airstrip . \n  \nFor most of us, buying a luxury bolthole with a private airstrip in New Zealand is not a possibility. \n \nBut we should all be getting prepared. \n \nI have a contact in the food industry that has told me that her company’s sales have “been through the roof” over the past 10 days as people stock up for what is coming.  In fact, she even used the word “panic” to describe what was happening. \n \nAnd Americans have been buying a record number of guns  as well … \n \nNewly released August records show that the FBI posted 1.7 million background checks required of gun purchasers at federally licensed dealers, the highest number recorded in any August since gun checks began in 1998 . The numbers follow new monthly highs for June (1.5 million) and July (1.6 million), a period which spans a series of deadly gun attacks — from Charleston to Roanoke — and proposals for additional firearm legislation. \n  \nFor a very long time, I have been warning people to get prepared. \n \nWell, now we are getting so close that panic is starting to set in. \n \nHopefully you are already well prepared for what is about to happen.  If not, you need to kick your prepping into overdrive . \n \nThese next few months are going to change everything.  Get ready while you still can.", "source": "Zero Hedge"}