{"published": "2015-09-19T19:22:18Z", "media-type": "Blog", "title": "Solheim Cup: Europe lead USA 8-5 but three day two matches unfinished", "id": "24b6f95f-8b92-4869-b704-8bd16da2404d", "content": "Whatever the ultimate outcome, Melissa Reid’s smile will provide the most endearing image of this Solheim Cup. Reid’s continuing success aside, the tournament on the outskirts of Heidelberg also bore witness to its capacity to stir up acrimony. It is routinely thus. Reid was afforded her 28th birthday afternoon in the company of family members having recovered from a 5am alarm call to secure a point and a half for Europe. Given the location, the Englishwoman’s form is all the more laudable. Reid holed for birdie at the 18th as she and Carlota Ciganda halved with Cristie Kerr and Lexi Thompson in completion of a delayed Friday fourball. Later, the same European duo saw off Alison Lee and Michelle Wie by 4&3. The hosts were strengthening their grip on a piece of Waterford Crystal, a matter offset by an American afternoon comeback. By close of play, Europe’s lead stood at 8-5 with three fourball matches still to be completed. That much rather sums up a messy event, which has not been aided by the kind of chronically slow play which hinders golf’s development at all levels. Players at this one should know better but appear beyond reproach as the spectacle suffers. Reid travelled here looking to create fresh German reference points. The horrible extent of her existing ones are well known; three years ago Reid’s mother, Joy, was killed in a motorway crash when heading to watch her daughter compete in Munich. After initially and understandably struggling so badly with the tragedy, the golfer has moved on both professionally and personally. Or, in her own words, “closed the circle”. This Solheim Cup marks the first return of Reid’s father, Brian, to Germany since he was involved in the 2012 accident. Related: Solheim Cup: Europe bank on the chemistry of Charley Hull and Melissa Reid “I’ve just been pulled away from my family,” a beaming Reid explained. “I can just tell that it’s completely different. Like everyone now is really, really excited, and everyone is enjoying themselves. “My dad is, my brother is, my sister, everybody is. It’s very important for me that I got as many memories for my family as possible. These are new memories. This is so far a much more successful, personally to me, Solheim Cup than it was in Killeen Castle [in 2011], obviously winning two and a half points out of three. So far it’s been an incredible week and we want to finish it off tomorrow. I’ve definitely got good memories now.” In displaying impressive diplomatic skills, Reid was less forthcoming about day-two’s needle. The American captain, Juli Inkster, reacted angrily to what she regarded as several on-course instances of advice towards players by a member of the European backroom staff, Annika Sorenstam. As per Solheim Cup rules, only captains can impart such words when play is underway. Sorenstam was accused of similar behaviour in Colorado two years ago. “I was aware of it, but I actually don’t know what went on,” said Reid. “I literally went in the team room, had some food. I don’t know what was going on. I’m trying to find out as much as you guys.” Inkster’s tenacity has been a notable part of this competition. If her team falls short, it will not be because the captain wasn’t in the mood for a scrap. There was further US annoyance at delays to the fourball session although this time the event organisers were in the line of fire. Catriona Matthew had finished her morning match only 15 minutes before her next round was scheduled to start. Under the rules, a 40-minute break is permitted. Still, this scene didn’t reflect well on officials. Thompson and Kerr recovered from their morning woes by seeing off Ciganda and Azahara Muñoz. Those matches, which will only be completed on Sundaymorning, and all of which are separated by just one hole, will be crucial to the singles dynamic. For now, Karine Icher and Matthew hold the advantage over Lizette Salas and Brittany Lang through 15 holes. America has the edge in the other two games; Alison Lee and Brittany Lincicome narrowly in front against Suzann Pettersen and Charley Hull, whilst Stacy Lewis and Gerina Piller have the same lead over Caroline Masson and Caroline Hedwall.", "source": "Sport | The Guardian"}