{"published": "2015-09-24T14:58:27Z", "media-type": "Blog", "title": "At Austrian Refugee Camp, Volunteers Rush In", "id": "e4045517-36f2-4dc5-821a-8576a7a9949f", "content": "Europe At Austrian Refugee Camp, Volunteers Rush In September 24, 2015 FILE - Child carries a tray of food during birthday party at refugee camp in Traiskirchen, Austria, Sept. 9, 2015. Share Share on Facebook Share on Twitter Share on Google+ Email to a Friend See comments On a recent afternoon in the small town of Traiskirchen, 20 kilometers south of Vienna, locals parked outside the gates of the former school and unloaded jackets and sneakers in all sizes, as well as thick coats, hats and gloves for the approaching winter to clothe those staying at the refugee camp. Magd Zaour, a 23-year-old former student from Damascus, Syria, said he was thankful for the outpouring of help. “You know, we throw our clothes in the sea, so we don't have clothes. We came here without clothes, without food, so people here are trying to help us,” Zaour said. Locals, he added, were friendly and welcoming. But Magd has little hope in the Austrian government. For several weeks, he's been held in Traiskirchen, Austria's largest refugee camp, where he sleeps in a temporary tent. Instead of a mattress or a bed, he sleeps on one of two donated blankets. “The people here in Austria are so supportive ... but the government does nothing, I think,” he said. That there are tents at all is, in a way, an achievement of Austrian governance. Built to house 1,800, the federally outsourced Traiskirchen facility is now a temporary home to 4,500. 'No longer tolerable'\nUntil several weeks ago, more than 1,000 people were sleeping on the open lawn, bracing through rain storms and heat-waves alike without any shelter, a situation criticized even by Interior Minister Johanna Mikl-Leitner, who was largely seen as responsible for the inadequate response. \"The situation in Traiskirchen is no longer tolerable for the asylum-seekers,\" Mikl-Leitner said. The United Nations and Amnesty International went a step further and describe conditions as “inhumane” and “degrading.” Images of people sleeping in the open shocked Austrians, said Dunja Gharwal, one of many volunteers independently helping refugees in Traiskirchen. “Austria is a very rich country. We really sit here in abundance, and this is not necessary,” she said, calling it her country's duty to welcome refugees. A professional social worker, Gharwal has organized a group of colleagues and translators to support refugees at the camp. Authorities, she said, were little prepared, and resources weren't scaled up in time to meet demand. Many refugees said they are receiving little to no information on their individual processing statuses and options. “We help them answer questions that come up, and those are actually quite simple questions, like 'what do my papers and documents mean?' 'Where can I get food? ... 'Where can I get clothes?'\" she said. \"Those are all questions that are recurring.” Gharwal also noted that she and her colleagues are helping unattended children who are not supposed to be held at the camp due to their special needs and legal rights. 'Overwhelming'\nRight in front of the entrance to the Traiskirchen camp, Caritas, a relief organization that currently assists 17,000 refugees, has set up a staging area to hand out donations. Clothes, bags and shoes, as well as blankets for the cold autumn nights, are what's needed most. Close to 7,000 volunteers have signed up with Caritas to help in recent months, a number spokesperson Margit Draxl called “overwhelming.” “Those aren't just people who've filled in on a weekend,” she said. “It's been going on for months, and without them, this help wouldn't be possible.” From companies to celebrities, the private sector is helping fill the gap in aid. Some bosses, Draxl said, allowed volunteers to take paid leave if they wanted to help at camps. Big conglomerates, like retail group REWE International, are initiating vocational training programs for young refugees. Austrian singers and bands are organizing a free concert called “Voices of Refugees” in Vienna to collect donations for asylum seekers. As the number of new refugee arrivals increases, their location and personal needs change, so Caritas and other organizations are using social media to optimize the volunteer aid. “Currently needed: Cereal bars, nuts (please without shells), dried fruits, fruit puree snacks, and mineral water,” read a Thursday's status updates on Caritas' Facebook page after it was announced that hundreds of refugees had arrived at the main train station of the province of Upper Austria. Dozens of volunteers answered, and food and drink responsibilities and distribution were organized quickly. But the need for proper accommodations for asylum seekers is pressing. Unexpected snowstorms have begun to hit more mountainous regions, and temperatures are expected to drop close to freezing in both cities and valleys. Austrian state broadcaster ORF recently set up a website aimed at linking Austrians with vacant apartments or houses with refugees and the organizations that assist them. “There's an almost unbelievable readiness to help,” Draxl said. Related Europe Pledges $1.1 Billion Aid to Refugees Merkel: EU Quotas Only ‘First Step’ in Solving Migrant Crisis Vietnamese Refugees Reach Out to Syrians Fleeing by Boat Analysts: Variety of Factors Underlie Migrant Crisis Migrant Surge Tests Sweden's Open-Door Policy You might like also USA Will Francis Alter Roles, Rules Affecting Catholic Women? Middle East Reports: US-Trained Syrian Rebels Defected Here's Where Syrian Refugees Could End Up in US Africa Burkina Faso Coup Reversed But Issues Remain", "source": "Voice of America"}