{"published": "2015-09-24T23:54:01Z", "media-type": "News", "title": "Call for big exotic animals to go from Hamilton Zoo", "id": "2ec24515-b839-48e4-87fe-cd7559765cd6", "content": "FAIRFAX NZ    \nA zoo visitor gets a close-up look at Oz the Sumatran tiger. \n             \nA city politician says Hamilton Zoo should stop exhibiting large exotic animals.  \n \nHamilton City Councillor Andrew King said tigers and other large animals have no place in a New Zealand zoo. He doesn't oppose the council's owning a zoo, but said keeping large animals caged in cold environments is inhumane. \n \n\"When I was a child, people would go to the circus and you'd see lions and elephants. That was accepted back then, and now it's frowned on. I think in the future, places like Hamilton Zoo will be frowned on. \n \n\"Hamilton Zoo is an unnatural environment for a lot of these animals and it's just sad and wrong.\" \n \nKing's comments follow the fatal attack on curator Samantha Kudeweh by one of the zoo's Sumatran tigers on Sunday. \n \nHamilton City Council bought the zoo in 1976 and today it boasts the largest collection of endangered species in New Zealand. \n \nThe main driver of Hamilton Zoo's success is its collection of large endangered animals, King said. A record 128,519 people visited the zoo during the past financial year, a 6 per cent increase on the previous year. Contributing to the strong numbers was the Sumatran tiger cubs Kembali and Kirana who were born in November 2014. \n \n\"If you take away the African animals and tigers, people will stop visiting, and then the zoo isn't viable,\" said King, a first-term councillor whom political observers say is positioning himself for a mayoral tilt.  \n \nBig cat commentator Dr Bhagavan Antle, from South Carolina-based institution The Institute of Greatly Endangered and Rare Species (Tigers), said it was important zoos displayed animals such as tigers in order to educate people about their plight. \n \nHowever, Antle said the investigations into the fatal attack on Kudeweh could affect whether Hamilton Zoo continues to exhibit big cats. \n \n\"If the findings are the zoo lacks the experience or know-how to safely manage these animals, then you have to ask whether they should have had tigers in the first place,\" he said. \n \nIn March 2013, a Hamilton Zoo keeper had a close encounter with a female tiger. The experienced keeper entered an enclosure she thought was empty and found  herself alone with Sumatran tiger Sali. \n \nLance Vervoort, council's community general manager, said following the 2013 incident, the zoo's tiger-handling procedures were reviewed and a key retention padlock system for the tiger enclosures was introduced.  \n \nThe changes were signed off by the Ministry for Primary Industries, which investigated the incident. \n \nThe ministry, WorkSafe NZ and the Coroner's office are all investigating Sunday's fatal tiger attack. \n \nMinistry spokesman Jim Flack declined to provide a copy of the ministry's 2013 investigation, saying it would be \"inappropriate\" to release the information while it investigated Kudeweh's death.  \n \nHamilton City Council has refused to confirm whether a health and safety investigation was carried out after the 2013 incident. \n    \nVervoort said Sunday's death had prompted further changes to the zoo's tiger management processes. \n \nStaff carrying out tiger duties now must be accompanied by a second staff member, who would act as an observer. \n \n\"There may well be further changes to our processes as thorough investigations into Sam's death are completed over the coming weeks,\" Vervoort said. \n \n\"We are confident that we have robust processes and competent professional staff managing these animals.\" \n \nAsked if the changes introduced in 2013 went far enough in light of Kudeweh's death, Vervoort said that would need to be looked at. \n \n\"Obviously the investigations that are happening will look through that and come to some conclusions.\" \n \nAn internal investigation into Kudeweh's death was also being carried out by council safety and well-being advisor Tracey Stevenson. \n \nA leaked internal report into the 2013 tiger close encounter reveals the tiger went through three open doors to get to the keeper. \n \nLeigh-Anne Peake, a health and safety auditor, said investigators examining Sunday's fatal attack should also include the circumstances surrounding the 2013 incident. \n \n\"They should also study international best practices and examine their protocols. Basically, the council needs to look at what everyone else has learnt before and introduce those learnings into their own systems,\" Peake said. \n  \n- Stuff \n             \r     Comments", "source": "Waikato Times"}