{"published": "2015-09-11T21:22:00Z", "media-type": "News", "title": "Peak Pharmaceuticals, Inc. Reports on Regulatory Events", "id": "6468909c-9890-4875-8d4b-8a484a3c9501", "content": "BOULDER, CO -- (Marketwired) -- 09/11/15 -- . \n\nAs part of the Company's public disclosure responsibilities, Peak Pharma wishes to advise it has recently been informed that products containing CBD or cannabinoids have been prohibited from promotion and sale on Amazon. This has stopped the sale of Peak Pharma's animal products through this channel. Furthermore, the Company has received state level advisories requiring a halt of product sales to residents of Colorado and New Mexico subject to the attainment of a category-specific certification requirement for certain products made with hemp. \n\nDr. Soren Mogelsvang, President and CEO of Peak Pharmaceuticals, states, \"Our products remain available for sale via our online, retail and veterinary outlets, except in Colorado and New Mexico. We are in discussion with industry consultants and legal advisors in order to determine what options are available to us regarding these recent regulatory events. We have no idea if these actions are being applied equally to other companies in our growing industry, but this new position of the governing agencies represents a new and potentially significant obstacle for all of us. Although these sorts of actions and challenges are expected in an emerging industry such as ours, these recent developments have prompted us to re-evaluate our product plans and long-term corporate strategy. We intend to continue building on our successful pet products and will conscientiously report on events as we move ahead.\" \n\nAdditional details and notes relating to the Company's finances and agreements can be found as part of the Company's continuous public disclosure as a reporting issuer with the Securities and Exchange Commission (\"SEC\") available at www.sec.gov. For more information please visit www.peakpharma.com. \n\nAbout Peak Pharmaceuticals, Inc. (OTCQB: PKPH)", "source": "Wall Street Select"}