{"published": "2015-09-25T15:40:00Z", "media-type": "News", "title": "Bedfordshire Police issue crime prevention advice during...", "id": "ebdb3cd6-41d7-4f85-9957-a7a8403e0c9f", "content": "BEDFORDSHIRE Police is welcoming new students starting their university experience in the county by ensuring they have a safe and enjoyable Freshers' Fortnight. \n\nOfficers will have a visible presence in the student hotspots of Bedford and Luton during the University of Bedfordshire's Freshers' Fayres and the multitude of night-time activities planned for new and returning academics. \n\nThe University's Freshers' Fortnight kicks off this Saturday (26 September) and runs until Friday 9 October. \n\nAdditional patrols will be held to police the night-time economy in key nightspot areas for students and licensing officers will be working closely with pub and club venues and taxi companies to help protect people and ensure they get home safely. \n\nStudents are encouraged to approach officers for help and advice, and to follow @bedspolice, @uniofbeds and the hashtag #FreshBeds15 for daily tips and helpful messages. \n\nChief Inspector for Community Safety Neill Waring said: \"We recognise that moving to a new area and starting a new chapter of life can be daunting, so as police it is our role to protect the influx of students to Bedfordshire and ensure they are equipped with the relevant safety and crime prevention advice to stay safe and well. \n\n\"For many, this may be their first experience of living away from home and parental control. Nights out and drinking can often play a major part in student life and this coupled with the vibrant and busy social scene of Bedfordshire can lead to potentially dangerous situations. \n\n\"While we will be sharing advice around key crime areas such as burglary, rape and sexual assault and domestic abuse in young relationships at this prevalent time of year for young people – we would also be keen to remind them to take care, drink sensibly and look out for new friends as they celebrate their start to university life.\" \n\nThe University of Bedfordshire's Director for Student Experience Rumnique Gill said: \"Freshers is a great way to start university life, with plenty of opportunities to get involved and try out new things. But at all times we would urge our students to make safety a priority and to follow the advice issued by Bedfordshire Police. \n\n\"In addition, support and guidance is available on campus from the University's Student Support Team while the Students' Union run a Freshers' Angels scheme where returning students volunteer to help to settle in new students and provide a point of contact. To recognise a Freshers' Angel simply look out for students wearing blue t-shirts and feathered wings.\" \n\nBedfordshire Police and the University of Bedfordshire are proud to work in partnership and will be sharing messages throughout the Freshers' period. \n\nFor further advice visit http://www.bedfordshire.police.uk or to report a crime, call the police non-emergency number 101. \n\nAlternatively, Crimestoppers anonymously on 0800 555 111.  \n\nTo help ensure you remain safe as you begin a new term at university, take note of the following advice: \n\n- Try to avoid walking home alone at night. Wherever possible, use public transport and travel with friends. Never accept a lift from someone you don't know. \n\n- Don't walk along talking on your mobile phone. You may not be fully aware of what is going on around you. \n\n- When going out, only take with you the money you need for the night, and keep your wallet or purse somewhere safe. \n\n- Don't accept drinks from strangers and never leave your drink unattended. \n\n- Never share access codes with anyone who is not a resident of your house, flat or halls of residence. \n\n- Always lock doors and windows before you leave your halls or student house, and leave valuables well out of sight. \n\n- Remember that if someone is incapacitated due to drink or drugs, they are not capable of consenting to sexual activity. If you pursue it, you are committing a crime. Find out more here: http://www.bedfordshire.police.uk/tackling_crime/rape_and_sexual_offences/what_is_rape.aspx  \n\n- Seek advice and report incidents of domestic abuse to police if you feel you are being degraded, humiliated, belittled or mentally, physically or verbally abused by a partner while at university. Find out more here: http://www.bedfordshire.police.uk/tackling_crime/domestic_abuse.aspx  \n\n- If you feel at risk from radicalisation or know of someone who may be vulnerable to becoming involved in extremism or terrorism, seek advice from the Let's Talk About website – http://www.ltai.info/ .", "source": "Bedfordshire on Sunday"}