{"published": "2015-09-30T15:35:37Z", "media-type": "Blog", "title": "Leader Of Canada’s Largest Oil-Producing Province Sees No Long-Term Future In Fossil Fuels", "id": "1ec9f69e-1895-42da-b9f4-6ab651028d7c", "content": "In May, Rachel Notley sent shock waves through Canadian politics — and the entire world — when she and her left-leaning New Democratic Party ousted Alberta’s long-reigning conservative government in the province’s elections. Environmentalists quietly cheered the results, hopeful — though not certain — that the new premier would help steer Canada’s most oil-rich province away from fossil fuels. \n \nNow, it looks like environmentalists can cheer a little louder. \n \nIn an interview with the Guardian , Notely previewed her forthcoming energy policy, which seeks to shut down Alberta’s coal plants, clean up its oil industry, and make a robust switch over to wind and solar power. \n \n“I don’t think we are defined by energy. Certainly in the short to medium term that is an asset that we have, so we have to look at how we develop it carefully and responsibly because of the obligation we have to the people employed in the industry,” Notley told the Guardian, adding, “Do I see that as our reason for being 100 years from now? Well, I hope we will have learned a lesson of diversification by then.” \n \nAlberta is Canada’s largest oil-producing province, home to 78 percent of the country’s oil production. And it has the natural resources necessary to produce even greater sums of oil — the northern part of Alberta sits atop a vast reservoir of heavy crude oil, potentially as much as 2 trillion recoverable barrels , the third-largest source of crude in the world behind Saudi Arabia and Venezuela. \n \nBut the mining of those tar sands has led to local environmental consequences, including deforestation and forest degradation. And the rampant increase in tar sands production — 107 percent between 2005 and 2012 — has made Canada’s energy sector its primary source of greenhouse gas emissions, surpassing the transportation sector for the first time in the country’s history. Because of the greenhouse-gas intensive nature of tar sands production, many scientists and environmental activists argue that expanding the mining of tar sands crude is incompatible with halting global climate change. \n \nNotley told the Guardian that fighting climate change while preserving the jobs created by tar sands production would be a delicate balancing act. \n \n“I want to change the direction, bend the curve and do it as effectively as we can while maintaining jobs that are important to Alberta. People deserve to see government both at the federal and provincial levels that are committed to very significantly changing the rate of greenhouse gas emissions coming out of both Alberta and Canada,” she said. \n \nAs the Guardian points out , that comment places Notley directly at odds with Canada’s prime minister Stephen Harper, who has been a strong supporter of the tar sands industry since taking office in 2006. Under Harper’s leadership, Canada has become one of the world’s most notorious opponents to climate action, pulling the country out of the Kyoto Protocol in 2011 when it failed to meet its promised emissions cuts. Since then, Canada’s emissions have only grown, and the country is expected to fail to meet its promised 2020 target — instead, it’s projected that the country’s emissions will increase 2 percent each year until 2020. This October marks Canada’s 42nd federal election, however, so the country’s environmental tide could turn if Harper isn’t re-elected. \n \nSome scientists have argued that in order to avoid catastrophic climate change, the majority of Alberta’s tar sands will need to stay in the ground , though Notley seemed more interested in regulating the oil industry’s emissions rather than stopping them altogether. \n \n“We need to do much better with greenhouse gas emissions,” she told the Guardian . “We need to take our environmental responsibilities seriously if we are going to have support for our products in other markets that have greater environmental concerns.” \n \nEarlier this week, national New Democratic Party leader and Prime Minister candidate Tom Mulcair proposed a national cap-and-trade system to fight climate change. Notley expressed resistance to Mulcair’s proposal, however, arguing that a cap-and-trade system would take funds away from Alberta. \n \n“Generally speaking cap and trade as one strategy is a bit problematic for us,” Notely told the Guardian. “It would turn into a fairly major cash transfer from Alberta to other places … We are going to be more focused on a strategy that allows us to take investment that goes into reducing emissions and keeping it in Alberta.” \n  Tags   Alberta Climate Change Tar Sands    \nThe post Leader Of Canada’s Largest Oil-Producing Province Sees No Long-Term Future In Fossil Fuels appeared first on ThinkProgress .", "source": "ThinkProgress"}