{"published": "2015-09-18T09:35:55Z", "media-type": "News", "title": "Package delivered 40 years late", "id": "53cd6c19-4e6c-4e5f-9fe1-05f990405b3e", "content": "Irene Garrett with the parcel that took about 40 years to reach her. Picture: Adam Elwood Source: News Limited A WITHERED parcel has finally lobbed in a Melbourne tennis club’s letterbox — about 40 years after it was ordered. Viewbank Tennis Club secretary Sonja Terpstra said members were astonished to find a box of sew-on patches, believed to have been ordered in the mid-1970s.\n\nMs Terpstra said the box apparently fell behind some machinery at an Australia Post sorting centre, only to be discovered decades later as staff prepared to move.\n\nFormer committee member Irene Garrett’s name and address — where she still lives — remained legible on the oil-stained envelope. When the delivery was finally made Mrs Garrett returned the parcel to the club last week.\n\nMrs Garrett said she “had a good laugh” when she received the parcel.\n\n“I couldn’t believe it, I’d forgotten all about. We’re guessing it must have been around 1975, and I must have ordered it,” Mrs Garrett said.\n\n“I’m guessing I ordered it because it was addressed to me.”\n\nShe said she believed the items must have been reordered because people remembered patches being sewn on to players’ uniforms.\n\n“When it didn’t come I must have told them and they must have sent another lot,” she said.\n\n“I’ve been in touch with a few friends from the club (since the parcel was delivered) and they remember having patches so obviously we did get another lot.”\n\nMrs Garrett said she was on the social and junior committees at the club, which was formed in 1969.\n\nShe said the parcel would likely never have come to light if she didn’t live in the same house as all those years ago. The package that Viewbank Tennis Club has finally received — about 40 years after it was sent. Source: Supplied “I haven’t had anything to do with the tennis club for 20 or 30 years, I took up golf and am now playing bowls at Doncaster,” she said.\n\nMrs Garrett said her husband — who accepted the parcel — asked the postie about its history.\n\n“(The postie) doesn’t really know (where the parcel came from); he thinks it must have fallen behind a machine because the envelope was oily, although the contents were perfect,” she said.\n\nMs Terpstra said the club was rapt to receive the parcel.\n\n“We thought it was great to receive the parcel all these years later,” she said.\n\n“It’s allowed us to get back in touch with past members of our club and we’ve heard some fantastic stories about what used to happen in the early days.\n\n“(The parcel) could have just been thrown in the bin but it’s great that people are so honest to say we found something and to deliver it.”\n\nMs Terpstra said the patches were a great example of a bygone area.\n\n“They were worn with pride and they were really cute, but when you look at modern embroidery techniques they’re pretty basic,” Ms Terpstra said.\n\n“When people went away you could recognise them as members of a particular club; we’re really fortunate that they’ve come back to us.”\n\nShe said the club’s committee was keen to find a use for the patches for its 50th anniversary celebrations in a few years.\n\n“There are at least 60 patches so we could raffle them off or we could have some special commemorative T-shirts made up,” she said.\n\n“We could have some retro style shirts made up or we might be able to work on an historical project to pay homage to days gone by.”\n\nAustralia Post has been contacted for comment.\n\nOriginally published as Package delivered 40 years late", "source": "Perth Now"}