{"published": "2015-09-29T11:00:06Z", "media-type": "Blog", "title": "Looking Out the Window:  Kim McMahill Talks about Her New Suspense, A Dose of Danger", "id": "2a9e2268-a7d5-44ee-bab3-c7e952870282", "content": "                                                                                   A Warm Welcome to Kim McMahill Hi Kim, first, tell us a little about yourself.\nI grew up in Wyoming, which is probably where I developed my sense of adventure and love of the outdoors. I started out writing non-fiction, and had over eighty travel and geographic articles appear in magazine and other publications. As exciting as that was to see my work in print, my passion for exotic world travel, outrageous adventures, stories of survival, and happily-ever-after endings soon drew me into a world of romantic suspense. When not writing, I enjoy gardening, traveling, putting together jigsaw puzzles, listening to live music, college sports, and spending time with family.\nTell us about your latest book.\nA Dose of Danger is a romantic suspense novel and the first in a developing series. When researcher Grace Talbot and her team discover a possible solution for weight loss they become targets of a group dedicated to controlling the multi-billion dollar a year diet-product industry. From the lab in Salt Lake City, Utah to the family ranch in Wyoming, danger closes in on Grace as she struggles to deal with tragedy in the wake of a fire, and the task of keeping all the animals alive throughout a harsher than normal winter. As the investigation progresses and the stakes get higher, she becomes more dependent on the local sheriff’s deputy. With her colleagues either dead, missing, or on the run she soon realizes that she must trust him with her life, but can she trust him with her heart?\nWow! That sounds suspenseful. What inspired you to write this particular book?\nAs I’ve gotten older, I’ve begun paying more attention to what I eat and my overall health. The more I read about nutrition and fitness the more confused I become, especially when it comes to supplements. There are a myriad of products out there that make all sorts of claims, but what’s true? I’m sure the answer is very complex because there are a lot of variables that influence a products effectiveness, which makes the subject an excellent topic for fiction. With so many options, it’s difficult to know which companies and claims to trust.\nWhat do you love about this book? And what do you hope readers will tell others about it?\nI love stories of survival against the odds, and this book has plenty of that. Most of my stories have heroes or heroines who push their physical and emotional capabilities to the breaking point in order to prevail. I always hope I have that much fortitude if I find myself in a bad situation.  I hope readers will tell others that it is a well written book full of action, suspense, drama, and realistic romance. I hope they find it exciting and entertaining, and worthy of recommending to friends and family.\nWhere do you get ideas for your books?\nI get my ideas from a host of different places. A lot of inspiration comes from my travels. I used to spend a lot of time in Mexico, which is where Marked In Mexico and Deadly Ruins came from. Big Horn Storm has a number of ties to my upbringing around horses, Deadly Exodus was inspired by a remnant of a dream I remembered one morning, and Shrouded In Secrets was spawned from watching a show on various mysteries, and one delved into the legends surrounding a group of crystal skulls. My latest novel, A Dose of Danger, may be a manifestation of my mild conspiracy theory paranoia and suspicions of market manipulation on nearly every front, especially when it comes to the health and diet product industry.  What themes do you write about? Survival—as mentioned earlier, I’ve always loved stories about testing one’s physical and emotional strength, and surviving against formidable odds. I also enjoy exploring true and lasting love developed through shared tragedy or adventure. I’m not a huge fan of the lust first, love later model.\nWhat are you working on right now?\nI just finished with a second novel in the series which begins with A Dose of Danger. The deadly market manipulation continues as the corrupt coalition wields its lethal influence in the manufacturing of those healthy frozen meals that fill the freezer section of every grocery store.\nWhat is the coolest, wackiest, most risk-taking thing you’ve ever done?\nOne of my riskiest adventures came from following a small group of cows over a steep embankment during a cattle drive I was on with my dad as a teenager. We were taking the cattle to a high grazing lease for the summer. By the time we reached the steepest, last big push, the cows were getting tired and a few decided it would be easier to slide back down the mountain than to keep climbing. My dad was on a green-broke colt which wasn’t as surefooted as my palomino gelding, and getting a little tired herself with her heavier load. To make a long story short, my dad told me to go after them. I looked at him like he was mad, but nudged my horse, assuming he wouldn’t go if he thought it was too steep. He was a good cow horse, so he didn’t hesitate to plunge over the edge after the cattle. The slope was too steep and the dirt too loose to stop and I ended up beating the cows to the bottom. As calmly as possible with one’s life flashing before her eyes, I gathered the cows up and herded them back to the dirt road where my dad was waiting to help me guide the cows up the hill to the rest of the herd. I still occasionally have those, “Man From Snowy River,” flashbacks, but the experience did help me write a couple scenes in Big Horn Storm. My dad clearly had a lot more faith in the horse and my ability than I did, and thankfully he was right.\nThat sounds exciting! What is the most embarrassing thing that’s happened to you?\nThe list is lengthy, but probably one of the funniest was the time I went shopping with my husband to a fairly large town about 45 miles away. While he was washing the truck I looked down and noticed I had my slippers on. We had gone too far to turn around, so I proudly wore them while running errands, shopping, and eating out for the rest of the day.\nIntroduce us to the main character in your new book. \nGrace Talbot is a researcher for a company that develops nutritional supplements for humans and animals. She primarily works on supplements for animals, but stumbles on a product that if it can be modified for human consumption, has the ability to make a few people very rich and end the need for dieting. Grace was raised by her uncle at his ranch in Wyoming after being abandoned by her parents as a child, so she’s had to work through her share of issues to get where she is today. She has a successful career and is a loving niece to her lone family member.  Learn More about Kim and A Dose of Danger at Kim's Web site\nKim's blog\nTwitter\nAbout A Dose of Danger When researcher Grace Talbot and her team discover a possible solution for weight loss they are targeted by a group dedicated to controlling the multi-billion dollar a year diet-product industry. Her unsanctioned testing methods bring tragedy to the family ranch and the attention of the local sheriff’s deputy. With her colleagues either dead, missing, or on the run she soon realizes she must trust the deputy with her life, but can she trust him with her heart?    Buy A Dose of Danger on Amazon\nAn Excerpt from A Dose of Danger\nShe hadn’t heard Logan enter, but she didn’t object when he pried the handset from her fingers and put his arm around her shoulders.  “Hey, Moss. How are you feeling today?” Grace could only hear one side of the conversation, but it was enough to know Moss wasn’t the only one who cared about her fate.\n“Don’t worry. I’ll keep her safe, I promise. Yes, I’ve noticed she can be a bit stubborn, but she knows when to cooperate and hasn’t given me too much trouble. No, I can’t give you any details. The less you know the better. We’ll leave as soon as the sheriff calls back with a location.  You have what? Where? If we need it, thanks. If we don’t I never heard those words. Yes, I noticed the trailer lights aren’t working, and the clutch on your truck sticks a bit. I may be from Arizona, but I do know how to pull a horse trailer and operate a truck in four-wheel-drive. We better not tie up the line too long, but we’ll call as soon as we get to wherever we’re going. What? Yes, I’d be happy to do that for you. Take care.”\nBy the time Logan hung up, the tears were gone. Hearing Moss treating the big, strong deputy like a child made her smile. She missed her uncle so much it hurt. Even in a hospital bed hundreds of miles away, he was still trying to take care of her. “What would you be happy to do for Uncle Moss?”  “This,” he replied as he pulled her into his arms and kissed her. His lips moved slowly over hers until he felt her arms slide up around his neck. He deepened the kiss, and her response sent fire through his body. Even without his heavy coat on, he knew he would be burning just as hot. She fit against him like they were made for each other. When he finally let her go, she looked up at him with a wicked smile that made him itch to grab for her again. As if sensing his intention, Grace took several steps back. “I’m fairly certain that wasn’t what Moss asked you to do for him.”  “Maybe he said something about giving you a hug for him, but I started tuning him out when he decided I needed driving instructions. Anyway, I didn’t want to disappoint an injured old man, so I winged it.”  Grace studied him for a moment. Maybe he won’t walk out on me, but even if he does, I might as well make the most of every moment we have together. She smiled and moved within reach. Logan needed no further encouragement. He pulled her toward him. With one arm firmly around her waist, he ran his fingers through her hair. “Yes, those curls are just as soft as they look,” he moaned as his lips descended to hers, cutting off any response.", "source": "Peering Through Life's Window"}