{"published": "2015-09-06T20:04:46Z", "media-type": "News", "title": "Muslim 'refugee' invasion of Europe", "id": "7a30ba38-967e-4db5-9874-40343eff087a", "content": "The photo of a child washed up on a beach has become iconic of the massive Muslim migration to Europe. The child’s death is tragic, but the media’s cynical exploitation of the image is grotesque. \n \nWhile the media hand-wring and wail about the poor migrants overwhelming Europe, it is a crisis, but not the crisis that the media would have you believe it is. The international media obscure the reality of this flood of “refugees” into Europe, in an attempt to blunt legitimate concern over it. \n \nHere’s a typical headline: “ Hungary police force migrants from train tracks; dead boy’s image shocks Europe .” \n \nCNN says of the photo of the toddler: “It took a tragic photo of a drowned toddler on a Turkish beach to make the refugee torrent pouring into Europe a problem for America too.” \n \nThe mother and two boys died – the father lived. The boy died because his father wanted new teeth. That speaks volumes . \n \nAlso, the father’s story is riddled with inconsistencies that show him to be thoroughly dishonest. In a deeply damning report on his numerous self-contradictory stories, the Muslim Issue surveys his various statements and then adds this devastating conclusion: \n \nAlthough Abdullah claims to have seen the dead bodies of his two children and his wife after their boat was hit by two large waves, his story then changes and he claims that he made it safely to the beach. He now assumed that the wife, who had laid bloated and drowned, and the two small boys who he had seen drowned right in front of him and he knew were dead, had managed somehow to make it alive to the beach. He could not find them on the beach so he assumed they had “become scared and ran away.” He now sees these dead people nowhere. But he only finds the “truth” about their death after going to the hospital where their bodies were kept. Can someone explain to us how dead bodies run away? In other words, he only knew they were dead after the pictures of his son started showing up in the media reports. \n \nThe victims of the Christian, Yazidi and religious minority genocide in Islamic wars are no less valuable or important as the Muslim child on the beach. They are all victims of the global jihad. \n \nWhere are the photos of the little girls gang-raped and bought and sold in ISIS slave markets to fighters and wealthy Muslims? Why don’t their deaths spur the West to decisive action against the jihadic doctrine and its adherents? And how many jihadis are among the refugees? \n \nThe father whose wife and children drowned is a tragedy – a casualty of war, a war being brought to the continent of Europe by this massive invasion. \n \nPamela Geller’s commitment to freedom from jihad and Shariah shines forth in her books – featured at the WND Superstore \n \nThat image is not iconic of the invasion, but the media say it is. Take, for example, this caption on another photo: “BUDAPEST: Hundreds of migrants stormed Budapest’s main international rail station after police reopened it on Thursday (Sep 3), in an escalating refugee crisis seared into European hearts by horrifying pictures of a drowned Syrian toddler.” \n \nThis is just emotional manipulation of the vilest kind, as we’ve already seen so many times with the Gaza conflict, the Bosnian civil war, the supposed “genocide” of Muslims in Burma, etc. \n \nIn 732, the Battle of Tours ended the “last of the great Islamic invasions of Europe.” How this new invasion will end is anyone’s guess – but it won’t be pretty. Today’s refugee is tomorrow’s jihadist: Already jihadis have been discovered among the refugees , and there will be more of that. \n \nIn February, the Islamic State threatened to send half-a-million Muslim migrants to Europe in a “psychological” attack against the West. And lest we forget, back in May, I reported that the Islamic State was making a fortune smuggling Muslim “migrants” into Europe. \n \nImmigration jihad, or hijrah, is the migration or journey of Muhammad and his followers from Mecca to Yathrib, later renamed by him to Medina, in the year 622 CE. It was after the hijrah that Muhammad for the first time became not just a preacher of religious ideas, but a political and military leader. That was what occasioned his new “revelations” exhorting his followers to commit violence against unbelievers. Significantly, the Islamic calendar counts the hijrah, not Muhammad’s birth or the occasion of his first “revelation,” as the beginning of Islam, implying that Islam is not fully itself without a political and military component. \n \nThe EU is telling its members that they must take in these migrants or lose important grants. Yet meanwhile, the oil-rich Muslim countries, chiefly Saudi Arabia, are doing nothing for the refugees . Muslim countries are not taking a single refugee . No, non-Muslim Europe must absorb them all, so as to be all the more easily conquered and Islamized. \n \nThe fact is, the mass Muslim migration is symptomatic – it’s not the problem. ISIS is the problem. Iran fueling and fighting Assad’s civil war is the problem. All of this chaos has resulted from Obama’s disastrous and incoherent foreign policy. \n \nYet the media’s callous and cynical spin is that those who voice legitimate concerns and oppose the refugee influx into Europe are just like the Nazis . That hyperventilation was in the Washington Post. The U.K.’s Daily Mail was even worse, likening the trains carrying refugees to settlement camps to the Nazi trains that carried Jews to their deaths: “You did not need to be a historian to sense the chilling echo of Europe’s not-too-distant past. The last time people were duped on to trains around here, they ended up in Auschwitz.” \n \nThe crisis is crushing – the scale of which is one not seen in Europe since the end of World War II. Obama’s “junior varsity” team has overturned the order of the world. And it’s only just begun. \n \nMedia wishing to interview Pamela Geller, please contact media@wnd.com . \n \n           Receive Pamela Geller commentaries in your email  BONUS: By signing up for Pamela Geller alerts, you will also be signed up for news and special offers from WND via email.    Name * First Last Email * Where we will email your daily updates Postal code * A valid zip code or postal code is required \n\nClick the button below to sign up for Pamela Geller's commentaries by email, and keep up to date with special offers from WND. You may change your email preferences at any time.", "source": "WorldNetDaily"}