{"published": "2015-09-01T18:36:38Z", "media-type": "News", "title": "Knights and Ladies of Marshall support girls’ education", "id": "297c9a88-06a2-4683-95ec-e5a4082df221", "content": "Sekondi\n(W/R), Sept. 1, GNA - Members of the Knights and Ladies of Marshall in the\nCatholic Church have launched a programme to support girls’ in   Mathematics and Science education in deprived\ncommunities across the country. \n\n \nThe\nprogramme has targeted 4,500 girls this year, with support package worth GHȼ33,\n000.00, therefore beneficiary students would get mathematical sets and other\nlearning and teaching materials. \n \nAddressing\nthe media in Sekondi to launch the programme, Sir Knight Edward Aloysius Prah,\nBoard Chairman of Marshallan Relief and Development Services (MAREDES), a\nnon-governmental organization, spearheading the programme, said the package\naimed at reversing the poor performance of girls in Mathematics and Science\nsubjects. \n \nHe\nindicated that this was the third successive year MAREDES, in collaboration\nwith ECOBANK Ghana, had implemented the programme, to motivate girls in rural\nareas to be interested in Mathematics and Science, adding that 5,000 girls had\nbenefited so far. \n \nSir\nKnight Prah, who observed that the recent report revealed that 75 per cent of\nSenior High School graduates performed poorly in Mathematics and Science in the\n2015 West African Senior Secondary Certificate Examinations, pointed to the\nurgency of the situation, saying it required concerted efforts by all and\nsundry to deal with it. \n \nHe\nstated MAREDES was exploring other innovative ways of not only assisting the\ngirls, but also, improving their access to better methodologies of teaching the\nsubject. \n \nIn\nthis direction, the Board Chairman, averred that, it is planning to introduce\nsponsored Mathematics tutorials on television, particularly, targeting girls\nacross the country. \n \n\"We\nare also looking at collaborating with the Ghana Education Service to sponsor\nin-service training for Mathematics teachers in targeted deprived communities\nto improve their pedagogy and general conduct in ways that will facilitate\ngirls disposition to learn Mathematics,” he stressed. \n \nHe\ncalled on government to initiate a national discourse on how to improve\nteaching and learning of Mathematics and Science in schools as the core of the\ntransformational agenda of the education system. \n \nMr.\nEmmanuel Akron, Zonal Manager of ECOBANK Ghana, said the bank supported the\ncause of girls’ education because it was in line with its vision of\ncontributing to the socio-economic development of the country and the continent\nat large. \n \nHe\nrecognized the many benefits of educating girls including, their employability,\nincome, health and the general upbringing of their children. \n \nHe\nentreated the beneficiary students to make proper use of the teaching and\nlearning materials, in order to become responsible future leaders. \n \nGNA", "source": "Ghana News Agency"}