{"published": "2015-09-09T11:12:38Z", "media-type": "News", "title": "Message for Ganpati mandals: Stick to noise deadline, donate for drought affected", "id": "79cc540a-c725-483a-bbdd-9c2415ef2f91", "content": "The convener of the Brihanmumbai Sarvajanik Ganeshotsav Samanvaya Samiti, on Tuesday, cautioned Ganpati mandals against playing music aloud past prescribed deadlines as \"NGOs would be ready on the streets with their decibel meters.\" Naresh Dahibavkar was speaking to a packed auditorium of suburban Ganpati pandal organisers at an event held by the north Mumbai police on Tuesday. \"These NGOs will not even spare the police if the latter do not lodge complaints of noise pollution. The concerned police officer would then have to lose an increment or a promotion,\" Dahibavkar said, adding that he had requested the chief minister to relax noise rules till midnight for at least six days of the festival. \n\nThe event was organised by the Mumbai Police to reward those Ganpati mandals that had adhered to all security precautions and followed all rules during the festival in 2014. Additional commissioner Fatehsinh Patil said that instructions given out to sarvajanik pandals shouldn't be looked at as an obstacle. \"40000 Mumbai Police will be out on the streets but we cannot protect the city unless Ganpati mandal organisers and karyakartas act as our eyes and ears,\" said Patil. The police have asked mandal organisers to ensure separate queues for male and female visitors at the pandals, install high-resolution cameras and form a team of karyakartas who would ensure there is no sexual harassment of women. \n\n\"Low tide is the perfect period for Ganpati immersion. But we have observed over the years that Ganpati mandals with large idols often set out for immersion during high tide. As a result, the idols are not immersed properly. There has to be a deadline set for immersion for large idols,\" said BJP MLA Manisha Chaudhary. Congress MLA Aslam Shaikh said there needs to be a size specification for idols depending on the strength of the mandals. \"There have been instances when smaller mandals get large idols and are unable to ferry them in time to the sea. They then desert the idol midway and leave,\" said Shaikh, adding that eco-friendly idols are the need of the hour. \n\nShaikh, Chaudhary and Dahibavkar appealed to sarvajanik Ganpati organisers to loosen their pursestrings for the drought affected and donate generously to the government.", "source": "Times of India"}