{"published": "2015-09-23T17:17:33Z", "media-type": "News", "title": "New undergraduate certificate delivers entrepreneurship for everyone at SFU", "id": "1b1eac9e-14cc-4070-9d7a-2bdfa1844934", "content": "A new certificate from Simon Fraser University will allow any undergraduate student from faculties across the university to add innovation and entrepreneurship training to their education. The Certificate in Innovation and Entrepreneurship (CIE) will teach students numerous skills, including creativity, adaptability, teamwork, collaboration, communication, and implementation - all skills that are increasingly sought after by potential employers. \n\nIt will also help students to develop the innovation and entrepreneurship skills necessary for those interested in establishing their own startups. \n\nUsing a unique, interdisciplinary approach to entrepreneurship, the CIE has been designed to build the multi-faceted teams required for realistic entrepreneurship experience, while teaching students that entrepreneurship belongs in every discipline. \n\nLaunched this fall and with an official kickoff event at the SFU Surrey campus later this week (Sept. 24 at 4:30 p.m.), the CIE is designed to be customizable and work with the student's primary degree. \n\n\"By partnering with faculties across SFU we are able to offer students the interdisciplinary teams and skills that realistic, practical innovation requires,\" says Sarah Lubik, SFU's Director of Entrepreneurship and lecturer in the Beedie School of Business. \n\n\"To be successful in business, the ability to innovate and make new things happen is no longer optional. SFU's certificate is a uniquely collaborative answer to that need, and we're seeing great enthusiasm from both students and faculty members.\" \n\nThe CIE is offered by SFU's Beedie School of Business in partnership with the faculties of Applied Sciences; Communication, Art and Technology; Environment; Science; and Health Sciences. \n\nAfter completing a new introductory interdisciplinary entrepreneurship course, participating students take foundational courses delivered by the Beedie School of Business. \n\nFollowing this, they take courses delivered by partner faculties to provide sector specific knowledge and experience, such as The Science of Brewing, Mechatronics Design, Interaction Design Methods, or The Canadian Health System. \n\nThe program concludes with one of several entrepreneurial capstone courses where students execute their own projects. \n\nLubik says the CIE's interdisciplinary model utilizes new experiential teaching methods. Students work to solve sustainability problems in their communities, develop and launch real products, and work with real life entrepreneurs, including clients of SFU's student incubator Venture Connection. \n\nStudents are also able to work alongside existing SFU entrepreneurship programs including Tech Entrepreneurship@SFU and Change Lab. \n\nLubik adds: \"Through this experiential approach, students will learn to find market-driven solutions to social and environmental challenges.\" \n\nABOUT SIMON FRASER UNIVERSITY: \n\nAs Canada's engaged university, SFU is defined by its dynamic integration of innovative education, cutting-edge research and far-reaching community engagement. SFU was founded 50 years ago with a mission to be a different kind of university--to bring an interdisciplinary approach to learning, embrace bold initiatives, and engage with communities near and far. Today, SFU is Canada's leading comprehensive research university and is ranked one of the top universities in the world. With campuses in British Columbia's three largest cities - Vancouver, Burnaby and Surrey - SFU has eight faculties, delivers almost 150 programs to over 35,000 students, and boasts more than 130,000 alumni in 130 countries around the world. \n\nSimon Fraser University: Engaging Students. Engaging Research. Engaging Communities. Simon Fraser University \n\nUniversity Communications \n\n778.782.3210 www.sfu.ca/university-communications \n\nContact: \n\nSarah Lubik, SFU Beedie, 778.782.9664, sarah_lubik@sfu.ca \n\nRoss MacDonald-Allan, SFU Beedie, 778.782.9492, rossm@sfu.ca \n\nPhoto: http://at.sfu.ca/bxVHnu \n\nWebsite: beedie.sfu.ca/bba/CIE/ \n\n((M2 Communications disclaims all liability for information provided within M2 PressWIRE. Data supplied by named party/parties. Further information on M2 PressWIRE can be obtained at http://www.m2.com on the world wide web. Inquiries to info@m2.com.", "source": "Individual.com"}