{"published": "2015-09-18T00:17:12Z", "media-type": "News", "title": "Who set the fire? Fire marshal rules blaze arson", "id": "926849c5-7f40-41df-9447-b98ab8122736", "content": "Sept. 11 --A house fire at 149 Park Street in Grove City has been ruled an arson by state police. \n \nTrooper Luke Nelson , a fire marshal from the Lawrence County barracks, said that he made the determination on Aug. 28 -- 15 days after the fire had occurred. \n \nThe house was a rental owned by Bevan Properties in Grove City , and occupied by a mother and her children. The house was insured by both the renter and landlord, Nelson said. \n \n\"Both the insurance companies and I were all in agreement to the cause of this fire,\" Nelson said yesterday. Grove City police are investigating the fire; however, the department called in Nelson to determine if it was a crime. \n \n\"Before they jumped all in it, they had to know it was a crime,\" he said. \n \nThe fire's \"point of origin was a recliner chair in the middle of the living room,\" Nelson said. \"It appeared to (begin) on top of the chair on the seat cushion and back cushion.\" \n \nWhat could not be determined is that the fire was set \"by visible or identifiable ignition sources,\" Nelson said. \"There were no electrical devices capable of producing heat around that chair.\" \n \nHowever, he wanted to make sure the room was thoroughly sifted to find a possible non-criminal reason for the fire, since heavy water pressure produced from fire hoses may have misplaced it, he added. \n \n\"I had to make sure it was not fire suppression. I was able to rule out pretty much any type of accidental source,\" Nelson said. \n \n\"It was likely deliberately set on fire with an open flame, which is what I expected immediately.\" \n \nNow Grove City police will continue its investigation with the help of the fire marshal to determine who set the fire, he added. \n \n\"Arson investigations are difficult, especially if a circumstantial case,\" said Nelson, who would not give any details about suspects. \n \n\"Circumstantially it may seem obvious (who set the fire) but there needs to be a stronger case at this time as far as the responsible party,\" he said. \n \n\"Very rarely do we have an eyewitness sitting and watching a person do it. You have to make sure it's investigated as thoroughly as possible.\" \n \nPublished Sept. 2, 2015 , in Allied News . Pick up a copy at 201 A Erie St. , Grove City . \n \n___ \n \n(c)2015 the Allied News (Grove City, Pa.) \n \nVisit the Allied News (Grove City, Pa.) at www.alliednews.com \n \nDistributed by Tribune Content Agency, LLC.", "source": "Insurance News Net"}