{"published": "2015-09-16T04:00:00Z", "media-type": "News", "title": "No way? Charity's logo may influence perception of food in package", "id": "918b6a0c-783e-4cac-a99e-0e26a472757f", "content": "EurekAlert! provides embargoed and breaking science news you can't afford to miss.\n\nEurekAlert! offers a one-stop science news distribution service you can trust.\n\nEurekAlert! is a service of the American Association for the Advancement of Science.\n\nUniversity of Oregon study suggests that both consumers and marketers need to be thoughtful about combinations and messaging University of Oregon VIDEO: T. Bettina Cornwell, a marketing professor at the University of Oregon, says people form quick perceptions about a food product's value when they see a logo of a cause-based organization... view more \n\nCredit: Charlie Litchfield/University of Oregon\n\nEUGENE, Ore. -- (Sept. 16, 2015) -- New research at the University of Oregon finds that an organization's logo on a food product can trigger quick perceptions by consumers about an item's healthiness and influence their decision-making.\n\nThat perception also may be seen as an endorsement that may not exist, say study co-authors Elizabeth Minton of the University of Wyoming and T. Bettina Cornwell, the Edwin E. & June Woldt Cone Professor of Marketing in the Lundquist College of Business at the UO.\n\nThe research, led by Minton as part of her doctoral dissertation at the UO, probed alliances of organizations through the placement of logos on mock food products. The findings are timely.\n\nEarlier this year Kraft Foods Inc. and the Academy of Nutrition and Dietetics agreed on a deal in which the company would support research and public awareness campaigns on the importance of calcium and vitamin D in exchange for using the academy's \"Kids Eat Right\" logo on its packages of Kraft Singles. The deal quickly was canceled amid a backlash about potential misperceptions about the healthfulness of highly processed foods.\n\n\"There has been fear about false perceptions of endorsement by charities and other partners when aligned with unhealthy food. That probably, while real, is less worrisome than the simple misperception that a food is more healthy,\" Cornwell said. \"If consumers are pondering an endorsement claim, at least they are thinking about their choice, but if a quick look at a package directly influences food perception it has passed that cognitive filter.\" \n\nThe findings, published online ahead of print in the Journal of Consumer Affairs, involved a pre-test followed by three experiments that added different levels of complexity.\n\nThe pre-test, with 291 undergraduate business students, laid the experimental foundation. It explored quickly formed associations made by the participants of the healthiness of two food products, cookies and crackers, along with underlying values of three causes, the American Heart Association, World Wildlife Fund and Goodwill. \n\nThe American Heart Association (health cause) was associated with health and heart. The World Wildlife Fund (environmental cause) was most-often linked to animals and nature, and Goodwill (social cause) was associated with cheap and donations. The health cause related to food and generated health associations. Environmental and social causes, when paired with food products, generated no health associations. In experiment one, 109 undergraduate business students saw simple packages of cookies that displayed a cause logo and a name, either Goodwill or the American Heart Association, along with information that a purchase would lead to a donation. Participants believed the cookies partnered with the AHA to be a healthier choice than cookies with no cause or those partnered with Goodwill.\n\nThese findings, the researchers say, are alarming since consumer perceptions of the healthiness of a food changed with the cause logo on the package. \n\nThe second experiment, with 140 undergraduate business students, tested the idea that cause-related marketing increases consumer attitudes or intentions to purchase, in this case, crackers. The AHA logo moved the participants' thinking toward choosing the product for health reasons. The World Health Fund and Goodwill logos also worked because the causes were deemed worthy, but they did not increase health perceptions.\n\nThe third study -- done with 120 adults recruited by way of Amazon's online crowd-sourcing Mechanical Turk -- used a food-related but non-health charity cause, Meals on Wheels, as its focal point to probe if health perceptions, intentions or attitudes influence a decision to purchase, again, crackers.\n\nThis scenario leveled the playing field related to amounts of information about a cause included on the packaging and, working with adults, allowed the researchers to adjust for higher levels of product and cause knowledge that older participants brought to the testing.\n\nIn the end, Minton and Cornwell found that the pairing of Meals on Wheels on the crackers' packaging, with wording about the cause, slightly enhanced perceptions that crackers are a healthy choice. That connection, the research found, is based on quick judgments that may or may not touch the assumption of an endorsement.\n\n\"Cause marketing can influence consumer food product evaluations when cause cues are integrated within food packaging,\" Minton said. \"Our findings build upon prior research that has shown that corporate social responsibility efforts generally influence food product evaluations.\"\n\nThere are take-home messages for both consumers and marketers, Cornwell said.\n\n\"From a consumer perspective, it is worthwhile to pause a moment to take the time to consider just what additional communications on packaging might mean,\" she said. \"Marketers should be concerned about the potential for any unintended meanings from their products, packaging and marketing communications. They should want to avoid misleading consumers by taking the time to look ahead about what such a relationship might communicate.\" Sources: T. Bettina Cornwell, Edwin E. & June Woldt Cone Professor of Marketing, 541-346-8241, tbc@uoregon.edu; and Elizabeth Minton, Assistant Professor of Marketing, University of Wyoming, 307-766-3616, eminton@uwyo.edu\n\nNote: The UO is equipped with an on-campus television studio with a point-of-origin Vyvx connection, which provides broadcast-quality video to networks worldwide via fiber optic network. There also is video access to satellite uplink and audio access to an ISDN codec for broadcast-quality radio interviews. Paper (abstract): http://onlinelibrary.wiley.com/doi/10.1111/joca.12091/abstract \n\nCornwell faculty page: https://business.uoregon.edu/faculty/t-bettina-cornwell \n\nMinton faculty page: http://www.uwyo.edu/mgtmkt/faculty-staff/faculty-pages/minton.html \n\nDisclaimer: AAAS and EurekAlert! are not responsible for the accuracy of news releases posted to EurekAlert! by contributing institutions or for the use of any information through the EurekAlert system.\n\nMedia Contact\n\nJim Barlow\n\njebarlow@uoregon.edu\n\n541-346-3481\n\n@UOregonNews University of Oregon", "source": "EurekAlert!"}