{"published": "2015-09-30T23:43:13Z", "media-type": "News", "title": "Kane’s joy at win against City", "id": "f8ba6515-eb48-4005-9ae0-a03776c6b449", "content": "Harry Kane\r \nHARRY KANE was quick to praise the efforts of his Tottenham Hotspur team-mates after the striker finally ended his goal drought by scoring in Saturday’s stunning 4-1 Premier League triumph at home to Manchester City. \n\r \nDespite scoring twice for England, Kane had failed to find the net in seven previous appearances for Spurs this season – but the reigning Professional Footballers’ Association young player of the year put that right by grabbing the third goal in a remarkable victory which resulted in City being knocked off the top of the table. \n\nThe visitors actually took the lead through Kevin de Bruyne, but Eric Dier got Tottenham back on level terms prior to the interval – with the goal being allowed to stand despite a clear offside in the build-up – and second-half strikes from Toby Alderweireld, Kane and Erik Lamela wrapped up the points. \n\nThe win means that Spurs have not lost in the league since defeat at new leaders Manchester United on the opening day of the season, and Kane is delighted with the way that the team is progressing. \n\n“It was an incredible performance as a team,” he said. “Everyone was focused on what they had to do, and we put in a real statement of a performance. \n\n“Eric scored a very important goal on the stroke of half-time, and what a goal it was. We said at half-time to go out and bring a lot of energy and bring the momentum of that goal with us. \n\n“We got the early goal in the second half and took it from there. We never looked like conceding after that. The defence was great and everyone put in a shift. \n\n“City were top of the league at the start of play and we showed what we’re capable of. We’ve got a young team, a very energetic team and we’re excited. We’re enjoying every moment and days like this will give us even more confidence.” \n\nAnd Kane also hopes that his goal will help to silence some of the critics who had began to question whether the striker would be able to live up to his exploits of last season – when he scored 31 goals in all competitions. \n\n“Maybe I shut up a few people who have been talking over the past few weeks,” he added. “Only seven games have gone and a few people called me a one-season wonder. People can judge me at the end of the season and we will go from there. \n\n“I have to stay focused but it was great to score. When you score like I did last season it becomes a drug and when someone takes it away from you then you want to get it back. You want to score again and it was a good feeling to score again. \n\n“It is frustrating to be criticised. I kind of use it to get my juices flowing and to prove these people wrong. I have had to prove people wrong throughout my career to get where I am.”", "source": "Hendon Today"}