{"published": "2015-09-27T15:30:06Z", "media-type": "News", "title": "INVESTOR: The markets might look 'messy,' but now is a great time to buy", "id": "af228015-38bb-4d46-8126-28ae92164fb0", "content": "By \n\nBy Portia Crowe \n\nPosted Sep. 27, 2015 at 9:55 AM \n\n» Social News \n\nWikimedia \n\nMarkets around the world are whipsawing back and forth, throwing asset prices all over the place. \n\nThat doesn't have to be a bad thing, according to Luke Hickmore, a senior investment in fixed income at the $483.3 billion Aberdeen Asset Management. \n\nHe told Business Insider that investors should \"look to the opportunity rather than just watching the screens.\" \n\nThose, he said, could look \"messy\" for a while. \n\nHickmore said we're going to have to get used to the market volatility, as investors try to gauge when the Federal Reserve will finally raise interest rates. That volatility throws up opportunities, however \n\n\"For us this is great,\" he said. \"If you're investing medium- to long-term, you want the chance to buy the things you like at the price where you want to pay for them.\" \n\nHe explained that the extended period of low volatility meant assets moved in lockstep. One bond would trade much like another, regardless of the fundamental quality of the company that issued it. In a new environment, that could all change — and it means more choice for investors. \n\n\"Things blow up on you and things get wider and choices come along that you didn't have before,\" Hickmore said. \n\nHis advice for investors? \n\n\"Use these times, plan what you want to do, think about where the quality is — where the value is — and wait for the time to get in, because volatile markets just give you the chance to do that.\" \n\nNOW WATCH: This is what separates the Excel masters from the wannabes \n\nSee Also: \n\nSEE ALSO: BIG INVESTOR: The one thing markets have been fearing isn't actually going to happen \n\nBy Portia Crowe \n\npoconorecord.com \n\nBy Portia Crowe \n\nPosted Sep. 27, 2015 at 9:55 AM \n\nReader Reaction \n\n» STAY INFORMED \n\nSign up for our newsletter and have the top headlines from your community delivered right to your inbox. \n\nFeatured Businesses \n\nLoading... \n\naddress \n\nLocation, ST | website.com \n\nFind Poconos Attractions \n\n▼ \n\nEvents Calendar \n\nConnect with poconorecord.com \n\nReader Services \n\nSubmissions \n\nAlerts \n\nAdvertise \n\nPropel MarketingPoconoRecord.com thepoconos.com thepoconos.com/jobs thepoconos.com/homes Blogs", "source": "Pocono Record"}