{"published": "2015-09-05T23:33:31Z", "media-type": "News", "title": "Concern as 'overstretched services causing cancer test delays'", "id": "4ad36dc7-fc4c-4de9-b9a0-2c7326827e51", "content": "Patients are experiencing unacceptable delays for cancer tests due to underfunded and overstretched services, according to two reports. \n \nKey waiting times targets are being missed, leading to anxiety for people waiting to hear if they have the disease, Cancer Research UK said. \n \nIt points to growing pressure on services for imaging and endoscopy - a long, flexible tube that relays images of inside the body on to a TV screen. \n \nA report produced for the charity by the University of Birmingham predicts that more than 750,000 extra endoscopies will be needed every year in the UK by 2020. \n \nThis is a 44% increase on current levels, and is fuelled by the growing number of people who will suffer a range of diseases, including cancer, as they age. \n \nA second study for the charity points to major concerns regarding NHS imaging, including an under-resourced workforce and outdated equipment. \n \nIt said it will cost £215 million to replace old imaging equipment. \n \nImaging services include CT scans, MRI and ultrasound and are key for diagnosing cancer and monitoring progression of the disease. \n \nCancer Research UK argues there are too few staff working in testing, including a lack of nurse endoscopists and radiologists. \n \nSara Hiom, director of early diagnosis at the charity, said: \"Waiting for tests and test results can be a worrying and uncertain time, and delays will only increase that anxiety. \n \n\"Patients need to feel reassured that suspected cancer is being taken seriously and is prioritised by the NHS because we know early diagnosis and swift treatment are crucial in giving them the best possible chance of beating the disease.\" \n \nShe said the state of NHS diagnostic services was \"deeply concerning\" and new guidelines for GPs aimed at increasing diagnosis means more people will be waiting for tests. \n   Promoted stories   \n\"There aren't enough trained staff, they're often reliant on outdated equipment and in many cases they're already operating services seven days a week,\" she said. \n \n\"GPs do not have the access they need and that means patients are waiting too long for tests. This has to change if doctors are to diagnose more people with cancer earlier, when treatment is more effective.\" \n \nLatest NHS figures show that half of NHS trusts in England fail to meet the target for 85% of cancer patients to start treatment within 62 days of being urgently referred by a GP. \n \nAround 6,100 patients in the first quarter of 2015/16 were not seen within 62 days. \n \nThe NHS is also only just meeting its target for 93% of patients with suspected cancer to be seen by a specialist within two weeks of referral by their GP (93.6% are seen). \n \nThe Government's cancer strategy, published this summer, said that by 2020, 95% of patients referred for testing by a GP should be definitively diagnosed with cancer, or have cancer ruled out, within four weeks of referral. \n   \n Share article  \n   \nDr Giles Maskell, president of the Royal College of Radiologists, said: \"Well-resourced testing services are crucial to the early diagnosis of cancer, which in turn is vital to increase survival from the disease. \n \n\"The earlier cancer is diagnosed, the better the chances that it can be cured.\"", "source": "Wiltshire Times"}