{"published": "2015-09-16T18:42:04Z", "media-type": "Blog", "title": "No biochemical research", "id": "945e533d-68d2-4410-a616-0fc64d6e7193", "content": "2002 the Moffitt cancer centre in Florida, a world cancer centre, published the use of High Intensity Ultrasound to totally clear cancer at one session. Their High Intensity Ultrasound did not just cause cancer celsl to give off X-rays, but experience cel lcontent boiling and fragment. Inducing an immune action to clear the cancer cell type thorugh out the body. 1 H2O+US ->He+O+E2+X-ray that is Molecular Nuclear Fusion This works for all cancer – which have to be pressurised in order to divide and grow. The more flaccid body cells bud off the stem cells, and so not not divide. One example of HIUS is 5 W 1 MHz. This will clear all 200 cancers out there. Cancer Research maintain HIUS only works for a limited selection of cancers – no! It clears all 200 cancers out there. There is no rational reason for Cancer Research to still exist. It induces registered dococtors t oresearhc biopchemistry: but the hippocratic oath demanded all research work into defective biochemical treatmetns stop in 2002. Biochemical treaments provide cancer patients with an agonising 2 year decline to death – defective medicine. So no registered Dr could research biochemistry. THE GMC/AMA have the legal duty to enforce the Hippocratic oath. Both bodies evaluated HIUS in 2002 – and foound it works. I have found it to be 100% effective. So Cancer Research could no longer research biochemical treatments – as it uses registyered Drs as researchers, and they can not work on cell biology. That is the main fund raising stream for cancer research: now defective, prohibited medicine. Medics have continued to prescribe biochemistry. Such individuals instantly ceased to be Drs. Hippocrates did not consider a body like the gMC was needed. As an ethical group of proffessionals should self regulate. All prescribing doctor should instantly cease to work in medicine. And receive 25 years in jail ofr each individual they have killed. And pay a legal fine of 10 million. Molecular Nuclear Fusion – as above, was published by physics in the 1980s. Cancer Is Cured By Jonathan M Thomason\nView this Author's Spotlight eBook (ePub)       This item has not been rated yet Price: £2.00 Download immediately. We live in remarkable times. Xi years ago American medics cure to cancer. Using no drugs or surgery. Just a single application of high intensity ultrasound. This book explains how it works! It also cures heart disease and diabetes,", "source": "Jon's Text"}