{"published": "2015-09-10T03:51:29Z", "media-type": "News", "title": "The man killed in Warners Bay shooting", "id": "14ac9e9d-e2f7-437d-90ea-6c3e481c1e08", "content": "exit \nAs it happened: Man dies after Police shooting \n\nAUSTRALIA Post worker Steve Hodge had a long history of mental health issues before he was shot dead by police after lunging at officers with a large knife in front of horrified shoppers. \n\n\nAn  investigation was under way on Wednesday night after officers shot Mr Hodge at least three times when the confrontation outside the Warners Bay post office where he had worked for years turned deadly. \nCONTENT WARNING: GRAPHIC FOOTAGE \nAustralia Post released a statement on Thursday morning regarding the shooting of long-term employee Steve Hodge by police outside its Warners Bay post office. \n\n‘‘We are saddened by the loss of a valued, long-term team member and our thoughts are with his family and colleagues,’’ the statement said. \n\n‘‘We will do everything we can to provide them with support at this difficult time, and we are providing counselling services to our staff and customers. \n\n ‘‘Nothing is more important to Australia Post than the safety of our people and we will work with relevant authorities to thoroughly investigate all aspects of this tragic event.’’ \n\nA harrowing video showing Mr Hodge’s final moments will become the centre of the homicide squad-run investigation. \n\n\nIn the video,   police are clearly heard  warning the troubled man several times before he runs  towards one of the officers who is  standing with his gun drawn. \n\n\nThe shooting occurred in front of dozens of stunned shoppers beside a car park known as Postmans Lane about 3.15pm after police were called after  reports of  a man  wielding a knife. \n\nMr Hodge had been working at the post office on Wednesday before something made him begin threatening people with the knife and gesturing that he was going to cut his wrists. \n\nA woman, who did not want to be named, said she was standing in the car park across from the post office when she saw a man ‘‘holding a butcher’s knife to what looked like a staff member’’. \n\n‘‘The guy who looked like a staff member kept his distance and at one point he had to run away, he didn’t turn his back but he had to run to stop him coming towards him,’’ she said. \n\nShe said her and a friend came across the scene and immediately called police. \n\n‘‘There was no one else around and my friend, who I was with, said you have to call the police,’’ she told the Newcastle Herald. \n\n‘‘Two guys came up and tried to stop it, they were telling the guy to put the knife down but he wouldn’t. \n\n‘‘He looked really distressed. One hand was holding the knife and the other was kind of covering his face. Like he had his head in his hands. But he was wearing sunglasses the whole time.’’ \n\nDespite some reports, shot Australia Post worker Steve Hodge had not been sacked before he lunged at police with knife @newcastleherald \n— Dan Proudman (@Proudman74) September 9, 2015 \nThe witness said  police arrived within four minutes, and fired three shots at the man when he refused to put down the knife. \n\n‘‘Two police officers rocked up and got out, they were holding their guns up and yelling at him to put the knife down but he still wouldn’t,’’ she said. \n\n‘‘Then he came at the police with the knife. He didn’t run, but he came at them, and they just shot him three times. \n\nA video shows two plain-clothes police officers telling the man to ‘‘put the knife on the ground’’. \n\nAt one point an officer yells, ‘‘Put it down or we will shoot’’. \n\n‘‘C’mon mate, we’re not mucking around, you don’t want to do this mate,’’ one of the officers can be heard saying. \n\nAfter a short interval one of the officers then says, ‘‘Put it down mate, we’re here to help you’’. \n\nMr Hodge then appears to approach one of the officers holding the knife aloft in a threatening position. \n\nThe officer yells for him to ‘‘put it down’’ twice more before at least three gunshots are fired and the man collapses.   \n\nWarners Bay resident Cheryl Taylor said she heard the commotion and immediately assumed it was drugs. \n\n‘‘[It] was a really big knife, and he appeared to be cutting his wrists or making out he was,’’ Mrs Taylor said. \n\n‘‘There was another man there saying, ‘Don’t do it, mate, I wouldn’t do that, mate, don’t do it’, so I got scared then and came around this side of the post office, and when I got around to here, then plain-clothes police arrived with their guns drawn. \n\n‘‘I heard two shots fired and that was it, that’s all I saw.’’ \n\nNorthern Region police commander Assistant Commissioner Jeff Loy said the homicide squad would run the critical incident investigation. \n\n[embedded content] \n\n‘‘At this time, we acknowledge the grief and suffering of the man’s family and also we are looking after welfare of our police and their families, but I can assure you that every aspect of this investigation will be investigated by a critical investigation team and overseen by the professional standards command,’’ Mr Loy said. \n\nCommunications Electrical and Plumbing Union branch secretary Jim Metcher confirmed that the dead man was a member of the union. \n\n‘‘Despite his long history of mental health disorders that has resulted in this horrific and tragic sad circumstance, he was always held in high regard and supported by his colleagues,’’ Mr Metcher said. \n\n‘‘Our thoughts and prayers are with his family and friends along with our local retail members who have been subjected to this horrific ordeal late this afternoon.’’ \n\nMr Hodge’s mother arrived at the shooting scene and was comforted by police. \n\nCustomers told the Herald that Mr Hodge could appear odd but was always friendly. \n\nEbony Holly, of Bay Arcade Dental, had worked at the practice for about two years and has visited Mr Hodge behind the counter about once a month. \n\n‘‘Every time I went in to see him he was lovely,’’ she said. \n\n‘‘He was bubbly, chirpy, always friendly and very helpful. \n\n‘‘I didn’t realise it was him at first. \n\n‘‘It’s the last thing you expect to see in Warners Bay. \n\n‘‘It’s quite scary and shocking this has happened here.’’ \n\nOne man whose office backs onto the post office said Mr Hodge was a  lovely bloke who ‘‘had some issues’’. \n\n‘‘I’ve known him for a lot of years and he’s a lovely guy with a great sense of humour,’’ he said. \n\nThe man, who didn’t want to give his surname but whose first name was also Steve, said he understood that Mr Hodge had been dealing with mental health issues. \n\n‘‘It got to the point where you wanted to have a joke lined up for when you went in to see him just to get him to smile, because he loved to have a joke,’’ the man said. \n\nAustralia Post confirmed that a ‘‘tragic incident’’ occurred at the post office, and said it was assisting police with their investigation  as well as  providing counselling services to its employees and customers. \n\nLifeline 13 11 14 \n\n\nThe story The man killed in Warners Bay shooting first appeared on Newcastle Herald .", "source": "Cessnock Advertiser"}