{"published": "2015-09-01T14:07:21Z", "media-type": "Blog", "title": "Tango Fire Continues - the Third Installment", "id": "08467a64-3829-46fb-b50f-a70a9f55b984", "content": "Updated\nWends. Sept. 02 - 2015\n                        \n               Tango Fire Continues\n                              The memoirs  \n                        \n                       The Third Installment\n                                             \n                          Copyright@L.Hadley - 2015   \n         \n     Work of fiction. Any  similarity to real people dead or alive as well as any circumstances resembling the real ones are - purely coincidental.    \n     \n            For a super fantastic, different version of this story - click immediately  on the secure Create Space (Amazon.com) website:                                             \n                            https://createspace.com/4004740/\n                                 \n                                Chapter 1       \n         My Dearest Tina, my most favorite oldest sister,\n     It's presently another glorious fall - our favorite season which is always beautiful in Chicago and - of course - it always goes entirely too fast. As I mentioned to you earlier - my reputation as an excellent lecturer has been - finally - firmly established for some time - in Chicago - so I lecture - regularly and my journalistic career - is finally - where it needs to be. It takes a long time and many efforts.\n    Remember how I always told you that in spite of - sometimes - hostile forces of various kinds pressing against me - I always maintained a positive attitude and a great faith in doing \"things right\". However - at times - there is a right occasion to \"exaggerate\" the truth a bit or to stretch the \"right way\".\n     As you know - I have been lecturing at various press clubs and other leisure/educational organizations with my audience being \"mature\" people of good education and excellent careers to their names. I interact with those Chicagoans - briefly since after each lecture - we have a short - questions/answers sessions which are a lot of fun for me and the people who come to my lectures - since at times - I learn a lot from the people in the audience.\n    At times - when I need to do it - I can give some people -  \"a quick on my feet\" answer - in terms of getting them \"off my back\" - for the moment - answer - which is - usually - flexible and non-controversial while vague to a large extent - a typical political doubletalk which might be necessary sometimes. I have tons of fun observing various types I encounter. Some people whom I meet briefly - impress me right away as being well informed, well educated with a lot of strong and solid qualities about them. However - still - it's a good thing that I don't need to get to know them on any deeper level which was - at times - unfortunately - necessary when I worked my \"regular\" jobs when I could not afford the luxury of not having to get to know my ex-associate on any deeper levels since a lot of times - it's better not to get to know people - too deeply.\n   On the other hand - some accomplished and prominent Chicagoans who seem successful and are well known in this city - come off - right away - as phony and slimy which is noticeable to anybody who is observant.  When thinking about successful but shallow people - I immediately conjure up an image of a well known Chicago columnist whose \"live\" lectures take way - too long time - since he loves to talk about himself while his presentations' slides are tedious to watch being totally \"self-congratulatory\" and phony bunch of useless drivel which nobody needs - except him. His long lectures are hard to \"suffer\" through. It's a good thing that I can always find a good excuse to leave when he stops briefly - in a discreet fashion. It's good to go to his lectures to take a lot of effective notes on how to avoid delivering boring and totally self-congratulatory presentations.  I have recently seen the same columnist making some pseudo-intellectual remarks on one of the local TV channels - with his commentaries long and wordy - his trademark while manages not to state anything decisive while the TV seems to pick up all the negative sides of his personality - of course - the keen observer needs to have some knowledge regarding various human types. \n      Hey Tina - we are both observant about various kinds of human types which walk this earth - some of them - God only knows - for what purpose since they choose to do very little useful stuff. It's feels good for me - at this stage of my life - to be openly opinionated - at least everybody knows where I stand.\n     You know how some days -  a lot of small, bothersome, negative remembrance of our past failed efforts of various kinds - can creep into our minds like small but persistent demons. They are a lot of ways to get rid of them. Those are very common and everybody gets them - at times. You know - Tina - that for strong women of our family - we have ways to straighten out the negativity by \"talking it out\" with some close friends - while at times - we cry later that night. The following morning is always much better.\n     The new morning is always a new beginning. We know exactly what it means to pursue the excellence - namely - a lot of people will resent that. Fine. They are - usually - \"crawling back\" to apologize. We know about all the various ways to accept an apology. The best manner - in my opinion - is to accept it quickly - in \"I don't give a hoot about you - but will accept your lousy apology then forget about you while I move on with my super projects which you are too stupid to - even - dream about\" - style - and forget about the party apologizing - while we go ahead and move on with our useful but fun projects.\n                              *       *       *\n    October and November are always my most favorite months of the year. The big holiday season starts in full swing everywhere in the United States especially in the big cities like Chicago and New York. The gorgeus fall season shines the beautiful, colorful leaves on the various trees - creating a fall landscapes of great beauty.\n    You know Tina that some of my old friends started to get on my nerves for a lot of reasons - so as always - I meet some new friends which form my new circle of friends. I keep in touch with my old friends but they need to be put on the so called \"back burner\" for a while.\n   Lately I have been doing some exciting interpreting work around the main courts of Chicago. It's decent money and I have a good command of several languages - mainly Polish and Russian. Those people going to court for various reasons create a big economical, social and informational world of legal dimensions. I found that relatively easy to do since my communications skills are considerable.\n   Since the agency made me sign a confidentiality agreement - I try not to discuss my interpreting/translating cases too much - even though they are fascinating. Imagine me getting involved in some strangers' lives for a short time as I do the interpreting of their emotional statements for a judge or a referee. Its fascinating since each time when I go on my assignments I encounter different types of every kind.\n    I go on my interpreter's assignments - at least - three times per week and for now - it's quite enough since I am quickly becoming really good at interpreting. It's a lot of fun to be businesslike but slightly involved with the parties I work with - to do my job very well during only several sessions. The agency for which I do my jobs - appreciates  my professional attitude. They know about my personal motto - not only to do the job well - but always try to do it much better.\n   Interpreting accurately - takes a lot of intensity so four hours per shift per day are quite sufficient - especially in view of the fact that the hourly pay is very excellent. The most challenging part of this job is getting through the various security devices of Cook County Courthouse which is a huge building connected to a Cook County Jail and a big Cook County Medical facility. My translating/interpreting skills are frequently required in big legal or medical facilities downtown - Loop - which are easier to get to - even if they are harder to accomplish. I always look at the bright side of things. Not that it's easy - but at times - the positive \"spin\" always helps - no matter how hard it seems. What's nice about my present job - is the arrangement. My bosses are not in the position to require anything \"unrealistic\" from me and they know it. Moreover - I am the only one responsible to do my job right which I always do - since my enumeration depends on it. So I go to work most days of the week than in the evenings I like to listen to soft music. \n    I told you many times that some songs have always made me feel good inside even though the lyrics might be sad. I have always loved to listen Consuelito Velasques' \"Besame Mucho\". She was very young when she composed her world famous masterpiece which immediately brought her international fame and which made her a national, beloved figure in her native Mexico. We talked about fame and notoriety many times how it needs to be controlled and harnessed - it's like riding \"bareback\" a dangerous tiger - but once you master that art - you can enjoy the wild ride. It's - of course - a lot easier said than done - even if a lot of people - can do it. I believe in the strength of the human spirit with all my heart - I especially believe in the strength of my spirit to lead me in the right - for my life - direction - no matter how foggy the road ahead - appear.\n   I know that everything always works out for the best - at the end and the biggest enemy of our best plans - is fear which needs to be conquered every day since it's a very clever enemy - not to be underestimated - even if the road appears clear - ahead. I like to get rid of some fear almost every day since getting free of fear - is a skill which always grows progressively better - like playing a piano or something like that.\n   I told you before how some of my old friends get on my nerves - at times so I put them on the so called \"back burner\".  I have some new friends which are more fun than the old ones. Still - I try not to be rude to some of my old friends who started to irritate me.  Things always work out for the best even if there are some hard passages to negotiate on the way to good times.  \n                            *        *        *\n     \n     My dearest Tina - my most favorite oldest sister in the world,\n     The summer of 2013 went fast - it was really great - then the fall came which is actually my most favorite season of the year. I was looking forward to spending a year in Chicago and go back to Pittsburgh - in the spring of 2014 since most of people from our family have lived there in gorgeous Squirrel Hill part of Pittsburgh - for many years. Evidently - my destiny had other plans since my decision to leave Chicago much earlier than planned turned out to be a very excellent one.\n    Chicago winters are fierce and bothersome with the wind from Lake Michigan blowing mercilessly almost all winter. The winters in Pittsburgh are much milder and of course - our oldest brother Max and his \"dancing\" friends with whom I can dance almost every weekend - are a big factor making me like hilly Pittsburgh - a lot even if I constantly miss Chicago. Presently - I am almost all packed to go - only this time - just like the first time when I left Chicago - fifteen years ago - I am letting the movers take my stuff to Pittsburgh while I - personally - travel light on the sleeper/train which has become my favorite way to travel since I love to go on a \"sleeper\" and don't worry about driving a long way. I told you before that I don't quite understand that inner voice which prompts me to decide to go in certain direction - however - I always trust it and it always turns out for the best. I am on my way to Pittsburgh since the coming Chicago winter with the first snow in a forecast - gives me the creeps. I mentioned to you before that Pittsburgh has a lot milder winter notwithstanding this city's higher elevation and mountainous structures with tons of picturesque bridges all over the place.\n    I already mentioned to you before that Chicago Union Station - the main train station - has a nice lounge for the people who have the sleeping cars tickets - I always adore to go in a sleeper car ever since we were kids and we travelled extensively on the train.\n    Last night I slept great in a all night train from Chicago to Pittsburgh. When our big brother Max met me at the train station very early in the morning - I felt that my life has just began. Our oldest brother is a great guy - notwithstanding his many numerous - flaws.     Pittsburgh looks good to me - especially its international looking part  Squirrel Hill - where I live in a top unit of Max'es mini mansion - which attracts a lot of people like us - the cosmopolitan and savvy world travelers.  The local, prestigious university called C.M.U - which means Carnegie Mellon University - draws a lot of international students and faculty which stay in Pittsburgh several years while they mill around leisurely around various, \"she-she-poo-poo\" Squirrel Hill venues so the atmosphere is quite interesting and international. After the \"older\" visitors leave - the fresh batches come in - that way there are always new, interesting faces to look at so that turnover creates a vibrant atmosphere.\n    You remember when I mentioned to you that I lived in Skokie, Illinois for a while -  Skokie being the well-known, European and International style - suburb of Chicago - on the order of Pittsburgh's Squirrel Hill.  To my great surprise after living several months in Skokie which I presumed - to have an international and interesting spirit like Pittsburgh's Squrrel Hill - I was most happy to get the hell out of Skokie which turned out to be boring and stifling like a stagnant small village with all the prominent village idiots - on my way - every single day.\n                             *       *      *\n   \n     Lately - I decided that my daily goals should be stated clearly every morning after I pray briefly for my family, my friends and the objectives for my life. What's even better than stating my goals out loud is jotting them down on a small calendar then reading them at various times - later.\n     Since you are very far physically - and we connect once every few days - lately I have been a lot more open and trusting with Milochka who always has a big shell on the outside - even with me - notwithstanding the fact that we have known each other almost all our lives. She does get on my nerves more as we get older so we became less close since I have moved back to Pittsburgh.\n     I have been back to Pittsburgh for a few weeks - \"our family's\" turf - Squirrel Hill looks -more than ever - picturesque and familiar.  All those well known to me - semi-looser and idiot looking types - forever milling around here - undoubtedly attracted to the successful and attractive elements who live here - thinned out a lot so the remaining ones - get on my nerves a lot less than they did in the near past. After all there is a constant supply of new, interesting factors of all sorts which balance the idiot phenomena in Squirrel Hill. My old Squirrel Hill friends are very glad that I am back from Chicago.\n                                                                            \n                            Chapter 2\n                                                                           My Dearest Tina - my most attractive and glamorous oldest sister in the world, my only oldest sister,\n       I mentioned to you that I had to leave Chicago for the third time to come back to Pittsburgh's - Squirrel Hill - the famous, hilly, beautiful, \"she-she-poo-poo\" part of Pittsburgh - a permanent home of our closest family -where a lot of \"beautiful\" people - mingle in the truly U.S. democratic manner with some poor losers who come and go in a steady, rhythmical fashion.\n       Before I left Chicago - I noticed that no matter how much I always liked it - the city starts to irritate me with its always numerous typical big city problems of every kind - after I am there a while - mainly the high crime elements - which grow - while the new mayor with the new police chief - \"dance around\" their respective political agendas - at times - afraid to state the facts. All the criminal activities in Chicago - dissected, magnified and exaggerated to the max in all the sensation-hungry media outlets - really get on my nerves. I was so glad to get the hell out of there this time - as every time when I leave Chicago - after being fed up with its urban problems - but knowing my fondness for Chicago's big city grandeur - I know that I will miss it and will be happy to visit it in the summer when the city looks and feels truly glorious.\n    I mentioned to you before that things change in my life since it constantly follows some hidden script - which is great but scary - at times - since I don't know what will happen to me next - until after it already happened. It's very exciting most of the time - even if - at times - bad things happen for a brief time. When the hard times arrive - I immediately invoke our family's special angels which always help since they are a positive influence. It's always good to get the hard times  over with first - so the good times can follow towards the end of the cycle - as always. \n     After all - when the team plays an important game - what really matters is what happens at the very end of the game. Nobody remembers what happens at the beginning or in the middle. To draw an analogy - if all the bad things happen to a person at the start or in the middle of their life - but after the strings of awful stuff - the good events follow all the way to the very end of their life - that's considered a great life for the person and everybody around them. If - on the other hand - a human life starts out full of glory and fanfares of all kinds - but it ends miserably in some way - that's an example of a tragic, sad life. I know for a fact that our family and all of our real friends - have already paid their share of a debt of awful stuff which happens in everybody's life; the so called \"debt of suffering\" the humans pay to their respectives fates - so now - we can all coast down surrounded by good stuff of every imaginable kind.\n    Tina, I mentioned to you that when I left Chicago - this last time - most of my Chicago friends started to work my nerves - big time.\nFor example - one of my oldest friends - Judy whom I have known for - at least - twenty five years - just disclosed to me right before I left - that she is ninety three years old. I never knew how old she was since she always looked much younger than her age - however - during this last year - her youthful looks, energy and general health - suddenly deteriorated - tons.\n    The irony of her situation is that they have a lot of money but are extremely stingy with it - as if they intended to take all their financial resources - with them to the other world - instead of spending it - now - when they have their last chance to enjoy their monetary assets.\n    Needless to say - my financial resources were always much smaller than Judy's - so I vividly remember that whenever I asked her for a small loan - in the past - which she knew that I always repay on time - she invariably - lectured me in an uppity manner before she finally loaned me some money. Now she is sitting on a big pile of money - which can do nothing for her. Not that I am happy about her sad situation or anything like that but she should have enjoyed her wealth a lot more - when she had a chance.\n    It's feels very good - not to need anybody's financial help anymore. At this present time - I manage efficiently with what I have. It was a long time that I waited for my financial and emotional independence. You know that I had to \"walk\" a hard, grueling \"distance\" before I achieved it so it feels great to - finally - enjoy it permanently. It's only the beginning of the super good times - coming very, very soon - for me, for my close family and all our true friends.\n                            *        *        *\n    Last night - I went to a tea dance with a group of my Pittsburgh's \"dance friends\". It was a fantastic, fun loaded event. I got to dance with a lot of excellent dancers and you know that your little sister can hold her own even with enormously talented and accomplished performers.\n   I told you before that the way people dance reveals a lot of how they act in real life - it points to a lot of their personality traits and tendencies. It's infuriating when - on occasions - some guys - usually - the beginners at everything - attempt to bring their hidden hostilities - to the dance floor. They - normally - get rid of that nasty habit after they quickly learn how ridiculously they project their image to others. Sometimes - I like to give them an effective \"hint\" which - usually - goes where it should.\n    I mentioned to you  - that our oldest brother Max - can \"behave\" and act decent - for a long time - even more so - when as he gets older. Still - knowing his personality all my life - I know how to effectively avoid or diffuse his \"pockets\" of hostility which - invariably - come to the surface - once in a while. As I said before - as he gets older - those \"episodes\" happen a lot less frequently - thank God.\n    I told you before that some days are better than others for me and everybody else - I know. Right now - happens a very crucial and exciting phase of my life which I am expecting to happen right away. My life's script is written in a very clear way - so I need to follow it and have fun with it - even if - at times - I don't know exactly where it is going - but I know that it's going to a lot of great places.\n    I found out long time ago - that there is a lot of good magic working powerfully in a lot of people's lives. Sometimes it's hard to harness it in a right way but it's always there - at least - in my life. I told you before that my small prayer in the morning - right when I leave the house - is intended to protect me from all the ugly, annoying, vicious, mean and other negative elements on my way that day. I always add that I also pray for my family and close friends.\n   You know me - in addition to my skimpy prayers - I also - dig like crazy in every possible direction - in totally positive ways of every conceivable kind - in order to make - my short term and long term - goals - a reality. Of course - my goals change as well as my vital energies - directing me. However - during the last twenty five years - I found a super effective energy connected with my big interest in Israel and various important events connected with it.\n    I try to appreciate every \"normal\" day of my life. My friends and my family are important to me even though the daily events change like the toss of the kaleidoscope. I told you before that some days are better than others while - on occasion - rarely - do I have a bad day full of unpleasant memories which \"dance\" triumphantly in my mind like happy little \"demons\" which are always chased away quickly by my positive thoughts, memories and happy projections of my future.\n    Last summer 2013 - started out great in Chicago where I rented a small, gorgeous unit very close to the glorious Lake Michigan which glows with beauty every summer. However - in the fall - my next door, middle aged neighbor who just rented a unit next to mine - started to act like a psycho after I politely rejected his offers of being his \"friendly neighbor\" since I knew exactly which directions his \"friendly overtures\" would be going.\n    He started carrying on his \"friendship\" with another neighbor lady from the next floor - but quickly got tired of her \"friendly, neighborly\" visits and so he started to bother me.  Long story - short living next door to a psycho in a Chicago high rise - can be awful. I decided to go back to Pittsburgh - for the third time in the last ten years and rent the upper unit in Max'es Squirrel Hill -  mansion which he doesn't upkeep well - instead he gives his rental castle just a minimal maintenance since Max is stingy with his money. His neighbors are resentful - at times - because their impressing dwellings - in Squirrel Hill - the choice area of Pittsburgh - look top notch.\n     I decided to leave Chicago and move back to Pittsburgh for a while - as I did in the past. Max'es mini mansion's small unit on the third floor - became available after his long term tenant decided to move to Florida. At first - I was very happy to rent the tiny unit in Max'es small castle. He upgraded and rehabbed that small apartment a little bit it to make it cozy and functional. It felt good to be away from the hostile Chicago - back to my familiar - hilly and picturesque - Pittsburgh resembling a mountain resort. However I always start being drawn back to Chicago - as if my life's script - urged me to go back. I'm sure this feeling will change and shift like everything always does but for now - it's good to be away from Chicago until it starts calling me back. When I go back to Chicago this time - I will not go running back to \"my Pittsburg\" like a lover who has to go away for a while because they can't handle a powerful partner. When I go back to Chicago this time - it will be for keeps. \n     For now - I like hilly Pittsburgh which resembles a mountain resort. It's also pleasant to have only one nice lady neighbor for a while who has rented Max'es - main money making, big unit - for a long time. Max told me to be nice to her but keep the distance - it's business - as if I didn't know that well. Our oldest brother Max has always been a smart, choosy and efficient landlord while the relaxed atmosphere in - the hilly and gorgeus - Squirrel Hill suits me well - for the moment. I move around this familiar to all of our family - turf - in the fashion of a big city slicker easily swimming in a small pound.\n                           *         *        *\n     \n      This winter's holiday season is approaching fast so it will be good to be busy during the holidays. I have to tell you honestly that last year - during the holiday season in Chicago - all of our - supposedly - close friends - were too busy with \"their families\" to think about me. Of course - I managed to have a good time during the holidays - the way I always do - but those slightly ugly behaviors - did not go unnoticed and get ready for some \"payback\" actions.    You know that we are not talking about any lenghty \"vendetta\" or anything like that - but an effective even if small payback - is always a good thing. Sometimes it makes people think about their actions - not that it's such a tremendous \"behavior modification\" or anything like that.\n     The fact that I have always been surrounded by clever and accomplished individuals - gave me a big chance to observe smart people in action. I have seen a lot of intelligent people acting in an astute manner but - at times - loosing one's patience appears - entirely justified and the best course of action for certain situations. \n    It's almost Thanksgiving 2013 and this year's holiday season will be much different than last year in Chicago where our closest friends shot their doors in our faces. Not to worry - your little sister can manage. Ironical - as it may seem - the strangers turned out to be very pleasant and a lot of fun during the last year's holidays. \n    We will see how our close family members - will behave during this year's holiday season. I don't need to remind you how some big, close family gatherings can turn \"unpleasant\" - and that's being generous in describing some disgusting and revolting family incidences - happening during the big holidays gatherings when the members of the various families start resenting one another after not seeing each other for a long time; they start to dig up some incidences which should be dealt with and forgotten - long time before the family gathers to celebrate the holidays. Grown people - at times - behave like capricious and spoiled little children - especially during the so called - Big Holidays like Thanksgiving and Christmas.\n    You know what we always say during the big, fall/winter holidays - as if looking into the inside picture from the outside - we enjoy all the joyous celebrations around town - especially when they are free events - but we avoid all the pressure connecting with buying gifts which may not fit; so it's a lot of fun during the Holidays for non-Christians as well - but it's always much nicer - when all the holidays' hoopla ends in January after the New Year's celebration which has always been big in our family. At the beginning of each January - it feels good to go back to \"normal\" times.\n      I told you before that I find  Pittsburgh - especially Squirrel Hill - more \"normal\" than gigantic Chicago with its famous crime elements plus a lot of phony politicians - both of which factors - at times - make all our collective - \"skins crawl\" - big time.\n                          Chapter 3\n      \n        My Dear Tina, my most elegant and glamorous oldest sister in the world,\n       I have been back to Pittsburgh for over a month and my major goals connected with visiting Israel and learning to speak Hebrew - keep my energies focused and in a good mode which carries me forward in the right direction.\n       I told you before that Chicago started to get on my nerves - big time - right when I was leaving it - this last time - at the beginning of November 2013. The city which once welcomed me with open arms - when I came back to Chicago - from Pittsburgh - fifteen years earlier - almost penniless. Pittsburgh - where I needlessly spent seven years - at that time - totally \"rinsed me off\" my divorce settlement money.\n       This time around - Pittsburgh is fun since I finally have Jack's and mine pensions - paying my bills and the visions of me broken financially with my family not doing a damn thing to help me - don't haunt anymore me like a persistent big demon.  Thank God - finally - I presently have enough resources of every kind - to chase away some other, stubborn petty \"devils\" - negative images trying to \"nip at my heels\". \n       I told you before that learning Hebrew and visualizing visiting Israel - again - those are excellent energies for me which keep me focused - on the right track.  I mentioned to you before about how all the strong women in our family - always quickly find the right direction.\n       You know well that I have attempted to learn to speak modern Hebrew - on several occasions - before - however - this time - I know that I am making the right, long term commitment toward that goal. The only challenge for me - will be finding the right teacher at the right price and I know that it's not going to be cheap but investing in some future skills of the brain - is always a great idea. I will give you all the positive feedbacks from that important area of my life.\n      I mentioned to you before - that if I don't have - at least - several goals to be accomplished in the near future - I feel as if my days go - way to slowly - as I get older - a lot faster than than other people around me who appear active, vibrant and attractive - because of the imminent objectives they achieve - notwithstanding their - at times - very advanced age.\n     You know that Thanksgiving has always been a cherished holiday ever since our family permanently moved to the U.S. many years ago. I can remember some noteworthy Thanksgivings as well as everybody in our family remembers  - selected New Year's Eves - celebrations. Both of those holidays feature prominently in our family's vast European and American - collective memories.\n    I told you that one of the worst Thanksgivings which I can remember was a huge gathering of San Francisco State University students whom I barely knew. I was married to Jack only a few years and both of us pursued university degrees at the San Francisco State and towards the end of our studies - we couldn't wait to get the hell out of the Bay Area - the city of San Francisco - especially got on our nerves a lot with the constant influx of poor, homeless individuals but also the disturbed elements of every conceivable \"persuasion\" and social status - were attracted to this beautiful city - as well. The poor homeless descended on San Francisco - en masse - during winters - especially - when the particularly harsh winter in other parts of the U.S. - unleashes her frozen fury on the rest of the country.\n    All the rich, \"bleeding hearts\" liberals - especially the \"progressive\" politicians - in public - advocate the high taxation - which always squeezes of the rest of the population. California - almost went broke financially. In private - however - the same \"bleeding hearts\" phonies - massively \"snicker down their rich noses\" on poor people of every color and religion - who accidently \"cross\" their exquisite, upper class - ways. \n    Jack and I were happy to get the hell out of California - back to freezing Chicago in the middle of January - following the phony, unusually warm, typical California November Thanksgiving during which all the constant California newcomers - dreamt of \"normal\" winter, Thanksgiving weather in the states where they came from and dreamt of returning soon.\n     Of course - as much as I try not to be overly negative about the U.S. or any other place - I need to tell the truth - and that can hurt - at times. However - according to what I have mentioned to you before on many different occasions - I try to be considerate in expressing mine - at times - provocative - opinions. I just make sure that the criticism is fair, constructive and I usually offer the valid, better solution to the problem - I am criticizing.\n     I - usually - remember the Thanksgivings and the New Year's celebrations going quite a few years back but they have to be - outstanding - in some way. They need to influence some important events happening right afterwards in both of our lives.\n     The Thanksgiving of 1982 stands out in my memories since you and Yoni - visited the U.S. that year - from Israel which struggled with Lebanon in the awful, bloody - military confrontation. You worried about your oldest son - Yael who served in an Israeli army at that time. When I asked you at that time - why don't you come to live in the United States with your accomplished family - you replied that you love Israel and feel very much at home - there - after suffering a lot of open and underlying - hostility from various countries where our family has lived over the years.\n      I answered that the successful people of every ethnic group - have to deal with the unfriendly elements of various kinds.\n      \"The United States maybe friendly and hospitable to the Jews - for now - but that may change a lot and it wouldn't take that long once the economy slows down,\" you said then and I frequently think about your statement even though I have a lot of faith in the United States tradition of eliminating temporary - demagogues who usually have a short \"reign\" due to the permanent diversity of the American system and the Americans who come from many different cultural and ethnical backgrounds.\n                            *       *       *\n       The beginning of the winter  - normally - looks and feels beautiful around the U.S. Midwest and Eastern parts - with the hilly areas looking glorious with some snow covering the pretty hills. Even though Chicago and its vicinities decorate themselves in good looking winter \"sceneries\" - the flat area reminds me of a huge \"pancake\" - while Pittsburgh's hilly neighborhoods - make a lot of truly magnificent winter views with some snow covering the mountains.\n      I know that your boys - when they were real boys before they became men - at first young men then mature heads of their respective families - used to ski a lot in Israel's great skiing resort - on Mount Hernon. My dreams of skiing down the snowy slopes are becoming reality - in fast steps - typical for me and other energetic women of our family. Do you remember how we frequently drove to a mountain ski lodge/resort to a gorgeous place outside Pittsburgh - during the winters - quite a few years back - when I was still married to Jack who was an excellent skier just like our brother Max?\n     During the weekends the evenings - the lodge/resort - usually had some good entertainment in terms of a small jazz group with an excellent vocalist. Sometimes - they engaged a group of musicians - doing some good dance music so Max and I could show off our advanced, fast dance routines which we practiced since my childhood - usually we dance in a professional manner - the popular Swing tunes of the day which were usually newly arranged Swing classics like \"Sing, Sing, Sing\" by Benny Goodman. Jack always hated to dance but he enjoyed watching me and Max - executing fancy moves - as if we \"owned\" not only the dance floor but the whole world.\n    Max always said that this earth is a gigantic dance floor where people \"do\" their \"dance\" routines as well as they can - with some dancers always improving on their techniques while others never learning to do it in an outstanding manner. I always add that the major personality traits of the dancers - are visible in the manner they move on the dance floor. \n     Our oldest brother Max always \"monopolizes\" the dance floor - but even though - his leading and dancing techniques have always been good - I noticed a positive change in him - namely - as he gets older - his aggressive edge coming \"out\" coming out during dancing and in other circumstances - tapers off. Actually - every other abrasive/aggressive dancer - whom I know - usually - male - but no gender has a monopoly on flashes of occasional distasteful behavior - on a dance floor as well as - in real life - curb their needlessly abrasive tendencies - as they get older and wiser.\n      I told you before that a lot of women and men get to be much better looking as they get older - that includes most women in our family - while some gorgeous looking, glamorous individual who appear God-like while young - get to look awful when they advance in age. It could be that they opt for almost all, easy, totally pleasure oriented choices - most of their lives - for which they pay the price of looking ugly and decrepit when they advance in age.\n    \n                            Chapter 4\n             My Dearest oldest sister, Tina,\n      The last few years have been extremely defining for me - from the last time we saw each other - having tons of fun - as always - while time went fast for me. Lots of interesting stuff happened to me - most of it - I didn't expect but they turned out well.\n          Last summer 2013 - the whole summer went great - I had a glorious day - almost every single day that summer since it was a fabulous season for me in Chicago while I lived in a super nice high rise overlooking the beautiful beach front of Lake Michigan.  When the colorful fall came around - things started to happen which I didn't expect even if they did turn out well at the end.  \n     It all started in the early fall of 2013 - when a middle aged, fat male moved into the unit next to mine. Right after I looked at him from the behind of my new, kitchen blinds of light cream color - while he smoked compulsively outside the building since nobody is allowed to smoke inside the new, beautiful structure - he appeared disturbed and troubling to me - the type to - definitely - stay away from.  It's not very easy to do while living in the apartment next door.  \n    That fall afternoon - while I watched him smoking his \"cancer stick\" which I detest - and he looked up to my kitchen window as if he could see me behind my kitchen blinds - I knew that he will try to cause problems. I had to be clever and outsmart him. Fortunately - after I invoke my special Guardian Angels plus make some clever moves - the vicious elements of every kind - always quickly get out of our way - so we always get away from various annoying \"factors\" bothering our family while we try to do good things for our people and for us.\n      After I told our big brother Max about that ugly psychotic next door to me who nevertheless knew how to cleverly bother me - Max advised me to make a good move into his \"mini\" mansion which he rents out to good and established people - so no disturbed psychotics - where I reside - now. I don't miss them at all - and Chicago - typically - crawls with those types. My neighbor now - is a lovely, normal professional woman - Lia whose beautiful voice I can hear from my unit as she talks to her cute little dog while she walks her around Max'es big, clean, spacious - cemented back yard. Lia always makes sure that her little doggie doesn't leave any unwanted \"gifts\" on Max'es clean premises plus I am glad that I never hear Lia's doggies' bark - the \"apoplectic\" kind or any other kind since that kind of a noise could be a potential big nuisance. Speaking of gifts - I \"re-gifted\" a very cute - eye glasses' chain - to Lia after she gave me an adorable Christmas card. She will probably like that nicely designed - eye glasses holder which I didn't care for at all since I have this unexplainable strong distaste for any devices helping to hold the eyeglasses around the neck.\n     I mentioned to you before that when I used to live in the so called \"garden\" unit of Max'es mini mansion a few years ago - located under the prime, the nicest first floor unit - presently occupied by Lia - when Lia's unit was rented out to a young, disturbed guy teaching at the prestigious Carnegie Mellon University - located near by. He frequently left his noisy alarm clock - running forever. That's another kind of \"neighbor\" caused noise that's extremely annoing and loud during the summer months when the windows are - usually - opened wide.\n    Every year the day before the Christmas Day or Christmas Eve - has the same, lovely atmosphere in the United States - people smile at strangers while all the radio plus the TV stations play a lot of adorable Christmas Season music and equally beautiful - Christmas themed - shows. Most of the Jewish and other religions - also love the American style Christmas Season - especially in view of the fact that they don't have to worry so much about gifts and the various kinds of crazy relatives - descending on them \"off of the walls\"\n    You know how our family always likes the New Year's Eve celebrations when the old year goes away with all its \"low points\" while the New Year promises a lot of good, new possibilities. I can remember tons of many past New Year's Eves. One of the most memorable and dramatic ones had to be when Jack and I - left for California from our parents', old Ohio State Campus apartment which they were happy to \"unload\" after they bought a nice ranch in a fashionable part of Columbus, Ohio.\nThey both worked for many years at the Ohio State University's huge library - as researchers/translators so that on-campus apartment's location allowed them to quickly walk to work - however - they always stated the same thing - that the cute, ranch style house they bought in the Eastern, Jewish part of Columbus, Ohio made them happy since the college students with their \"night life\" activities and sloppy life styles - can really \"work\" the middle aged - like my parents' at that time - people's nerves - a lot.\n    That New Year's Eve - twenty years ago - Jack and I left early - in our white van - on January 1st - right after the fun party at our friends' - the Ohio State University students who lived in the old, one family house, next door to my parents. Those old fashioned houses were a part of the Ohio State campus and even though they were constantly rented out to changing college students - nevertheless the students always expanded tons of energy into neglecting and ruining those properties which were subsequently purchased by Ohio State which constructed paid parking lots; thus the lovely, gigantic sized Ohio State University Campus - intimidating to death som freshmen from surrounding small towns - acquired more parking space. After the first, terrifying first quarter at the huge university - most freshmen including me - quickly learned the \"streetwise\" techniques of survival at the humongous college campus.\n     At any rate - during that memorable morning of January 1 - Jack and I - began to drive confidently to towards San Francisco where he needed to start the graduate school in their TV Broadcasting Department which was very adequate and much easier to get to than the famous, much overrated - U.C.L.A - in Los Angeles. \n    We started to drive straight across the U.S. taking the shortest route - so called \"summer route\". However - due to a suddenly developing a huge winter storm piling tons of blowing snow in our car's way - Jack and I decided to change the route and take so called \"winter route\" to California - through the southern states which always had a lot milder weather conditions than the the northers states.\n    It was the first time I entered the South of the U.S. - the land of Dixie. I felt like a foreigner in a strange territory where the \"locals\" seemed to distrust the outsiders passing through - especially if they speak with a pronounced foreign accent like me. My ex Jack - who was born in the United States - and normally speaks a correct, well educated American English which sounds like the TV anchors read the daily news in Chicago - spoke with the Southern drawl - which always gets on my nerves; he only did it when we were passing through the South. It was a safety precaution so the local \"sheriff deputies'\" wielding guns would not cause problems for the \"outsiders\" just \"passing through\".\n    Things changed a lot since then - now the U.S. is full of newcomers/foreigners from around the world which settle in every state of the U.S. The people who were born here in the U.S. - the ones who act as if they grabbed God almighty by the proverbial \"balls\" -  should thank all the foreigners every day of their lives - for helping to make the U.S. - still the global power - instead of snckering down their ignorant noses on the contributing naturalized Americans such as me.\n   When we crossed the border from Arizona to California - it felt fantastic to allow the warm sun kiss our faces in the summer scenery with the orange plants - bearing the fruit while the East and the Midwest were pelted by the big snow storm.\n   Jack and I liked San Francisco for a while - during our studies at the San Francisco State University - however after several years there -when the constant cool spring weather with no \"normal\" change of seasons started to get on our nerves in addition to a few other annoying Northern California factors working our nerves - we decided to come back to cold, snowy, wintery Chicago - the heart of the United States - notwithstanding Chicago's - big, annoying problems which shift around but will not go away in the near future.\n      However - Tina - you always insist that - at times - a lot of good and beautiful stuff of every kind happens unexpectedly while - on other occasions - after we carefully plan a lot of good outcomes -  some of our important expectations - turn to garbage - big time. I hope that this happens frequently to all our enemies - the various individuals who like to be nasty for no apparent reasons. Remember how our mother used to say - \"God will give them - what they wish to happen to us and other good people\".\n     Sometimes it's hard to attach a positive spin on some screwy stuff which happens for no apparent reason to good, solid people. It's a good thing that those \"freaky\" mishaps rarely happen to our family. Some people can really work my nerves - though even if I try to be fair to them.\n     I decided that my new, most important, major 2014 New Year resolution - will be to dumpt all the negative, annoying elements and people and to associate only with the strong, positive, goal oriented people, groups, causes and ideas. It's not easy - since - at times - it's good to be angry for a brief time - it feels like a short term - fuel injection so an engine can go steadily and evenly. It's always better to find a positive spin - though - no question about it. \n    You mentioned many times that it's much better to deal with smart, well-adjusted, good looking people who are successful rather than to encounter ugly, limited, prejudiced and hostile human elements. I totally agree with you. Some days it's hard not to get angry with certain people who act \"goofy\" - while they \"discharge\" their ignorant anger at everybody and everything - however - we always believe that the good people of all kinds - outnumber the idiots - by far. In addition - most good and honest people can smartly outwit the narrow minded, prejudiced elements of various kinds.\n                                Chapter 5\n       \n         My Dearest Tina - my most favorite oldest sister in the world,\n        I was telling you before that a fair payback is one of the best experiences the human being can experience - providing - of course - that it's not crossing into a \"vendetta\" territory. It needs to be short and forgotten after a good lesson is learned and given.        You remember that I worked for an import company a few years ago and as every job goes - after two years - some narrow minded, new supervisors started their clever but not clever enough for me - campaign - to mess up my excellent work record. Long story short - the main \"shark\" lady located at their posh, filthy opulent corporate headquarters while the \"regular\" employees work in almost filthy - conditions - got fired due to your little sister's - me - continuous efforts.\n     As I mentioned to you before - she didn't need to die or anything like that - all she needed to do was to get fired - which she did - so now - I can think positive thoughts about her if I ever bother to think about a miserable little nothing like that individual. They are the types which produce very little - just like some \"shyster\" lawyers - even though they are - usually talented in playing \"politics\" so their positions are lucrative and secure - for a while. Things always change - however. That's the reasons that most doctors I know simply hate the lawyers who - generally -live off other people's mistakes.\n    I always try to put some kind of a positive spin on various negative events which happen to all of us - occasionally - usually - at the time when we least expect them. You frequently say that our family is always protected by a lot of good angels or other positive forces - so when something negative occurs - it's not as bad as it could happen.\n    Our oldest brother Max'es abrasive/aggressive side gets mellowed as he gets older while his \"sage like\" wisdom concerning the keys to living the greatest life - possible - increases. Judaism and its numerous sages - emphasize the crucial keys to living this life - in the best possible manner while the Catholics are big on the so called \"Afterlife\". \n    Remember how Max used to act like a total jerk on many occassions even a few years ago? I guess he thought a lot about this side of his - otherwise super terrific - personality and decided to \"modify\" his behavior - so now he is a lot easier to deal with. Not that anybody is holding any grudges or anything like that but Max could \"blister\" his family - at times - for no apparent reason at all - so it's a good thing that he made this important positive change - even if it happens - later in his life.\n      As I mentioned to you many times before - I like to deal with people who are smart, focused and have some goals for their lives. I try to be patient with all kinds of stupid, short sighted elements - which get on my nerves a lot - who need to be \"enlightened\" about their narrow minded, false prejudices which invariably come to surface during the economic downturn in the U.S. Since I am not running for any political office - it's a good feeling not to be too patient - occasionally - with some - annoying types who \"discharge\" some ignorant propaganda and need to be \"straightened out\" about their obvious ignorant spouting of a lot of non-sense. \n                             *       *       *  \n        January 2014 blows brutal arctic currents on all the Midwestern and Eastern Coastal States of the U.S. When we were students at the Ohio State University - the saying went something like \"it's cold like witches' tits at midnight while she's wearing a brass bra.\" I like winter when it decorates the trees and the mountainous hills and trees with a small layer of snow - when the air feels fresh and crisp while the sun makes each snow flake sparkle. However when the winter blizzards blow the awful winds full of icy snow into people's faces - then the winter feels awful and it's nice to take a break from the winter - by escaping into the warm vacation spot which feels like a paradise. Even a few days in the warm resort feels like a long break notwithstanding the \"brutal\" return to the single digit temps.\n      Remember Tina how you always told me - I don't know how many times you repeated it - as if I didn't register the first time - that you hate winter and that's one of the numerous reasons why you love to live in Israel - all your life since the heat doesn't bother you - especially if you are constantly in the air conditioned, luxurious surroundings. For the longest and the best part of your life - you lived your \"dolce vita\" - big time - in tiny Israel - while - I - fully naturalized American citizen - contributing a lot to the powerful U.S. of A for a long time - was struggling for quite a while -notwithstanding my higher education plus my many saleable skills. powerful United States.\n     Lately - however - we had a small, so called \"reversal of fortunes\" - when I - finally - became fully financially independent - thus got rid for good of my powerful, major demon - a vision of me being destitute in my older years - while my family doesn't give a \"hoot\". Now I can effectively \"fend off\" some other minor \"petty demons\" which life throws to everybody - from time to time.\n     You - on the other hand - lately - had to deal with a serious illness - which - I am sure - you will conquer since you have always been a \"brick ass\" and a first class - trooper. Don't get me wrong - I am always happy when things go good for you but when I used to go through some hard times - you frequently \"rubbed it in\" that it was my fault - which was frequently - was not the case at all! Don't forget that the hind sight vision is always very correct but it does nothing to fix the mistakes - at this stage.\nSort of goes something like - \"No use in closing the barn - when all the horses are already - out!\"\n     Our oldest brother, Max - always looks out for his sisters - which is on the bright side of the equation - however - ever since he was little our mother always treated him like a little Prince - a major successor to some imaginary \"throne\"; that attitude always got on our collective nerves a lot - since you and I have always been an outgoing \"go-getters\". However since our mother was stubborn - you and I could do little to change her attitude - even though we repeatedly pointed it out - to her. I am certain that even though she \"officially\" did not change her views - nevertheless - she heard our arguments and thought about them.\n     One really gets to know all kinds of deeper layers and hidden personality traits of our loved ones, close relatives or ex-husbands plus ex-wives. I try not to think of the past experiences of discovering the hidden sides of people which don't show until you either work with them, do some business or get closer involved with those individuals. While I look ahead with an optimistic, positive attitude about people - nevertheless my past experiences and a gift of keen observation give me a good tool for evaluating new people whom I encounter.\n    Sometimes people mistake an outgoing, a positive fearless winner's attitude for aggressive traits and they will be resentful. I have learned how to stand my ground and effectively defend my positions of every kind. When I criticize some actions - I try to be fair and keep it on their actions and not on the individuals. People change their minds and their respective positions - all the time so when the criticism is given - it's good to have fun with it -since the humorous spin - can frequently soften the criticism and achieve the same positive and desired results.\n     It's always good to ask yourself an important question - namely - what's in it for me - before giving a critique which should be sharp and interesting. It's not that hard since the \"talking heads\" do a good job of it on the radio talk shows and during the televisions news programs.\n     You know - Tina - I started to jot down some clever, short comments issued by some talented analysts - as I listen to them on the radio talk shows or watch them on TV new shows. It's always good to change the wording around so there is not even the slightest \"shade of plagiarism\". After all every week certain international and national events happen certain way - so they offer many different ways to interpret them. It's best to paraphrase the \"talking heads\".\n     No matter what you do with the updates of the important local and international news - it's always a great idea to keep up with what's going on around you. I always try to keep a positive spin on tons of negativity bombarding me. Each day - before I leave my house - I say a short - extremely brief  - prayer - to keep all the possible bad elements away from me, my family and true friends and it feels as if some good angels (I have no clue who they are) - are watching over me. I found out that it works much better if one has several important goals - to do good things for other people - notwithstanding the somewhat true - even if cynical - saying that \"no good deed - ever goes unpunished\".\n                             *        *       *\n                  My Dearest Tina, my most favorite oldest sister in the world,\n      I wanted to talk to you about how brave and adventursome you are in many ways and of course - your little sister - me - also has those features. It's not easy to be honest about who you really are since a lot of people are looking for the ways to criticize anybody who is outstanding in some way - or \"voice their concerns\" - an euphemistic phrase which I detest.\n    People like to criticize other people who are different than they. Some individuals  exercise the so called \"constructive criticism\" mode - which is a slightly more considerate way to express their widespread - hostilities.\n    When I first married Jack he was timid and overly careful not to say anything which might offend anybody present - while - I - on the other hand - at times - ran my mouth off - too much - without thinking. As I got more experienced - I learned how to convey my views in a rational manner so that even if some people disagree with them - they have to respect my points of view if they are capable of thinking logically. As the years went by - Jack learned a lot how to be more courageous when he needed to defend his positions.\n                            *         *        *\n     \n       The Winter Olympics in Sochi 2014 - are a lot of fun to watch - the figure skating looks gorgeous - but the downhill skiing events and ski jumps - are also exciting.\n       It's a big Olympic opportunity for Russia to show off while they massively brag about their country - which has a lot of beauty and talent - no question about it. However - their history is full of disgraceful, expansionistic and ugly episodes of all kinds - so this young, female \"pinhead\" brain figure skater - made my skin crawl when after she stated - \"Russia Forever\" when the TV camera was stuck in her stupid - even if pretty - face.\n       Why don't you read some history you \"pinhead\" brain - so you will enlighten yourself about your bloody dictator Soviet leader - Joseph Stalin - who for over thirty years - was killing your countrymen - left and and right - in addition to attempting to enslave the neighboring countries as the Soviet Union was exercising its abhorrent, dominating, aggresive, expansionistic policies!\n      Now - your president of the Russian Federation - Mr. Putin - also rides a \"roughshot\" over other countries - as much as he can - by supporting the repressive, Russian oriented, corrupt puppets - heads of state - like the Ukrainian - \"bandit from Donbass\" - Mr. Victor Yanukovich while the ex-premier of Ukraine - Ms. Yulia Timoshenko - still suffers in the Ukrainian prison - notwithstanding the widespread, massive international appeals\nfor her release.\n      At the moment - the winter Olympics dominate the news outlets and most conversations. I have always liked the figure skating competitions. This year - the couple with the guy - extremely tall - gets considerable press coverage. He was born in Moscow but his family emigrated to the U.S. when he was a little baby.  The U.S. gets tons of international talent every day - not that a lot of ignorant Americans - born in the U.S. - appreciate us.\n     The Russian Federation couple - currently the gold medal finalists - looks extremely goofy. For one - her hair appears totally \"botched\" in terms of color which reminds me of some poor Porto Rican ladies in Chicago - who insisted on \"bleaching\" their dark hair - blond so they ended up with pukey looking shade of \"dirty, copper blond\". Her partner looks as if he just got out of jail. Actually - both of them appear like a throw back to the Soviet figure skaters in the eighties and seventies when they looked like scared \"ghosts\". The Chinese athletes sport a similar look - of a nation in chains.\n     The American and the Canadian skaters not only look better than the Russians in terms of their appearance but they also have a certain aura of free people around them. The small detail needs to be pointed out about a super enthusiastic, sweet and friendly - young American male skater from Highland Park, IL (a fancy suburb of Chicago) - the first time Olympian - deservedly - adored by the press and the public - Mr. Brown. His eyes are \"crossed\" which could be fixed by a minor eye procedure to vastly improved his appearance since his smile is radiant.\n    It's amazing how some ladies figure skaters neglect to fix their hair so it looks smooth - and not like long hair - sloppily - fixed into an amateurish, quickly done - bun in the back of their head.  I saw only one costume poorly designed on an oriental looking skater - but it was an exception since most garments look fabulous - especially the ones worn by the Western countries' skaters.\n     You know that the few years ago - most of the figure skaters took up the \"dying\" on ice with all the drama owed to the beautiful dancers/skaters bodies (most of them - anyway) - looked dramatic. However - the \"dying on ice\" got old so they stopped doing them proclaiming that \"the dying on ice\" is \"dead\".\n     This year in Sochi - the skaters started a lot smaller trend of kissing the female partner's hand. Someone began doing that and it was quickly took up by other skaters. Towards the end of ice skating of which ice dancing is my absolute favorite - all the ice skaters/dancers appeared tired and glad that it's all over. I don't blame them - all the enormous pressure - most definitely - wears them down.\n     In the interim - President Putin get a huge egg in his face - in terms of Ukraine's people's - bloody confrontations with Putin's -  puppet, repressive and corrupt government of President Victor Yanukovich - popularly called a \"Donbass bandit\". The free countries of European Union", "source": "The Blockbuster of the Century"}