{"published": "2015-09-16T22:11:51Z", "media-type": "News", "title": "California elementary school truancy rates up slightly", "id": "65e05e33-cd0c-4d96-91df-f11d94477ee7", "content": "LOS ANGELES >> California elementary school truancy rates are up slightly despite efforts by nearly all the state’s school districts to implement improved practices to reduce absenteeism, according to new research. \n\nAttorney General Kamala Harris on Wednesday released an annual report on absenteeism, which finds a small increase from 21.3 percent in 2012-13 to 23.2 percent in 2013-14. Data suggest another slight rise to 23.8 percent for the 2014-15 school year. However, the report said, the three-year increase may be an indication of improved monitoring and tracking statewide. \n  \nSome 95 percent of surveyed districts reported they have made changes to truancy policies, including improved communication with local administrators and parents. More than 20 percent of districts began to collect and analyze data on the number of students who are chronically absent in the 2014-15 school year. \n\nIt may be too soon to see the effects of the new efforts, Harris said. \n\nHarris framed the report in economic terms during a speech to the Los Angeles Area Chamber of Commerce. \n\n“California is facing a shortage of skilled, educated workers,” she said, adding that keeping kids in school is critical to the state’s future competitiveness,” she said. \n  \nHarris suggested looking ahead 10 years. \n\n“We need to ask what is going on with the 8 year old today, who will be 18 in 2025, and ask whether they will participate in our economy or be a threat to our public safety?” the attorney general said. \n\nSome 230,000 California elementary school students are chronically absent — missing more than 10 percent of the school year — and more than 1 in 5 are truant, having three or more unexcused absences. \n\nResearch has found students who are truant starting at a young age are more likely to drop out. \n  \nThe study confirmed previous data that showed racial and income divides when it comes to truancy. \n\nThe rate of chronic truancy among black elementary students was more than 10 percent higher than that of white students during the last school year, the report showed. \n\nNearly 20 percent of African-American and Native American students are chronically absent, and over 75 percent of the students who are chronically absent are low-income. \n\nSchool discipline policies also disproportionately affect students of color, the report found. Black elementary school students are four times more likely to be suspended than white students. \n \n\r\r \n  \nBlack students missed more than twice as many days of school per student due to suspensions than white students and were suspended up to three times more than white students in first and second grades, according to the report. \n\nNone of the data explains disparities or why the students were suspended. \n\nThe attorney general’s office partnered with a private company, Aeries Student Information System, to compile the data from 32 school districts.", "source": "Inland Valley Daily Bulletin"}