{"published": "2015-09-02T15:10:00Z", "media-type": "News", "title": "Survey: Colorado Gains Manufacturing Jobs For Fifth Straight Year, Recovering Recession’s Losses", "id": "be268fe6-c544-4970-9919-c03ad612a9c4", "content": "Manufacturing employment increased in Colorado for a fifth straight year, reports the 2016 Colorado Manufacturers Directory ® , an industrial database and directory published by Manufacturers’ News, Inc. (MNI) Evanston, IL. According to MNI’s database of manufacturers, Colorado added 3,839 industrial jobs from June 2014 to June 2015, an increase of 1.8%. \n \nManufacturers’ News reports Colorado is now home to 6,228 manufacturers employing 213,863 workers. MNI data shows over a five-year period beginning June of 2010, the state gained 14,370 industrial jobs or 7.2%, recovering the nearly 11,000 jobs shed during the recession. \n \n“Colorado’s industrial base has reinvented itself following the recession’s steep losses,” says Tom Dubin, President of the Evanston, IL-based publishing company, which has been surveying industry since 1912. “The state gets high marks for its focus on innovation, while its educated labor pool and abundant natural resources continue to draw investment in a variety of sectors.” \n \nJob growth was led by the food processing sector, which climbed 4.3% over the year, and now accounts for the largest share of Colorado’s manufacturing employment, with 25,674 jobs. Employment in the state’s second-largest sector, industrial machinery, also posted a gain, up 6.7% to its current level of 23,049 jobs. \n \nFor the full report, including a regional analysis, click here or visit http://www.manufacturersnews.com/news \n \nOther industries in Colorado gaining jobs included oil/gas extraction, up 3.9%; fabricated metals, up 3.8%; medical instruments/related products, up 2.1%; lumber/wood, up 1.4%; and primary metals, up 1.1%. Offsetting gains were paper products, down 4.8%; and petroleum products, down 4.2%. \n \nManufacturing jobs in Denver rose 3% over the year, with the city currently home to the most industrial employment, at 42,451. Other Colorado cities gaining manufacturing jobs included Boulder, up 1.7% and Littleton, up 1%. \n \nEstablished in 1912, Manufacturers’ News, Inc. is the nation’s oldest and largest publisher of industrial information. MNI offers a variety of tailored solutions to help customers connect with 430,000 manufacturers and suppliers. MNI’s industrial database subscription service EZ Select ( www.ezselect.com ) allows users to tap into a live interactive database of manufacturers, while its industrial search engine IndustryNet ( www.industrynet.com ) connects buyers and suppliers and allows users to view profiles and obtain competitive quotes. For more information, contact Manufacturers’ News, Inc. 847-864-7000. http://www.manufacturersnews.com \n \nView source version on businesswire.com: http://www.businesswire.com/news/home/20150902005996/en/   \n \nFactory photo courtesy of Shutterstock . ", "source": "Breaking Government"}