{"published": "2015-07-21T23:35:34Z", "media-type": "Blog", "title": "Yes, Virginia, there is list churn", "id": "5af9fc4f-4661-4e11-9fc6-8c673a6cf645", "content": "Yesterday I talked about how data collection, management, and maintenance play a crucial role in deliverability .  I mentioned, briefly, the idea that bad data can accumulate on a list that isn’t well managed. Today I’d like to dig into that a little more and talk about the non-permanence of email addresses. \n \nA common statistic used to describe list churn is that 30% of addresses become invalid in a year.  This was research done by Return Path back in the early 2000’s. The actual research report is hard to find, but I found a couple articles and press releases discussing the info. \n \nA new study, to be unveiled next week at The 85th Annual Direct Marketing Association conference, indicates that email addresses are changing at the rate of 31% annually, driven by ISP switching, job changes and consumer efforts to avoid SPAM. \n \nThe email survey, conducted by independent, third-party research firm NFO WorldGroup, concluded that, consequently, the majority of consumers lose touch with personal and professional contacts and with preferred websites. […] \nThe survey, conducted in August 2002, updates a similar study by Return Path and NFO WorldGroup from September 2000, which identified a 32% annual rate of email address churn. The results are based on responses from 1,015 consumers from NFO WorldGroup’s online panel of U.S. email users over the age of 18. The panel is representative of U.S. online households.   ISP Switching and SPAM Continue to Drive Email Address Changes \n \nWhile I think the address change rates are probably lower now, list churn still exists. \n \nIn 2002, NFO reported users changed personal email addresses for a number of reasons. \n  50% changed due to an ISP switch  16% changed due to spam  12% changed due to a move  8% changed due to a “more attractive” email address.   \nWork users also changed addresses, and for many of the same reasons. \n  41% changed due to new jobs  18% changed due to an ISP change  8% changed due to a residential move  6% change due to a name change (divorce or marriage)   \nGiven the changes in free webmail providers since 2002, I expect address changes due to ISP switching or moving is less common than it was. But other reasons that users cited still exist, including spam levels, new jobs and name changes. \n \nOf course, my gut feeling that these numbers are old and out of date and probably no longer accurate was crushed last week. The LA Times published an article about Hillary Rodham Clinton’s email campaigns. After her run for president in 2007, her email address database had approximately 2.5 million records. According to the article, less than 100,000 of the addresses are still valid. That’s more than 30% attrition every year. \n \nList churn is real. While we may not know what the exact percentage of churn is, we know it happens. I expect that list churn, like most things in deliverability, is related to the actual recipient group. Some lists, like Secretary Clinton’s list, may have a very high churn rate. Other lists focused on different demographics might have a much lower churn rate. \n \nWhile the LA Times article mentioned these addresses bounced (“an inbox clogged with bounce-back messages”) not all churn is so visible. There’s also “stealth” churn, where addresses are abandoned by their users but still accept mail. \n \nWhat can you do? Mostly I recommend first wrapping your head around the idea that churn exists. Once you really believe churn is real then you can address how to fix it in your specific environment. \n \nKey things to remember when planning a data management plan: \n  Email addresses are not permanent.  Subscriber data degrades if you don’t actively manage it.  Deliverability depends on data quality.  Maintaining data is easier than trying to clean data.  Using list cleaning services will remove hard bounces, but won’t address “stealth” churn, which can still affect deliverability.   \nIf there’s anything my work with clients has taught me is that the more creative and flexible you can be in regards to list management, the more effective your overall email marketing program can be. \n \nThe post Yes, Virginia, there is list churn appeared first on Word to the Wise .", "source": "Word to the Wise"}