{"published": "2015-09-18T09:49:25Z", "media-type": "News", "title": "BBC extends Wimbledon coverage deal with the All England Club until 2020 ", "id": "7fae4292-bcd5-4600-8970-de6de9340698", "content": "Wimbledon will continue to be shown on the BBC until 2020 following deal The extended deal keeps the Championships on free-to-air platforms There was speculation a broadcaster such as Sky or BT Sport would bid   \nWimbledon will continue to be shown on the BBC after the broadcaster announced a three-year extension to its contract with the All England Club. \n\nThe BBC has secured the rights to the Championships until 2020, keeping the annual event on free-to-air platforms amid speculation that a subscription broadcaster such as Sky or BT Sport would make a bid. \n\nThis year's men's title was won by Novak Djokovic while Serena Williams was victorious in the women's event. \n   \nWimbledon 2015 men's title was won by Novak Djokovic as he saw off Roger Federer to land the prize \n   \nSerena Williams was victorious in the women's event, beating Garbine Muguruza at Wimbledon back in July \n\nThe BBC first broadcast from Wimbledon in 1937 and the extension of the deal, the longest of its sort in the world, has been met with praise by the chief executive of the All England Club, Richard Lewis. \n\n'Our long partnership with the BBC has brought the excitement and drama of the Championships to viewers and listeners for over 80 years,' he said. \n \n'We are delighted to be extending our successful association for a further three years until 2020. The BBC consistently delivers large national audiences for Wimbledon and they deliver those audiences with high-quality production values, live across multiple platforms and always with a strong narrative. \n\n'Importantly, as host broadcaster for the Championships, the BBC also ensures that we can provide a comprehensive and premium service to our global media partners.'  \n   \nWimbledon will continue to be shown on the BBC after the broadcaster announced a three-year extension", "source": "Mail Online UK"}