{"published": "2015-09-03T17:58:40Z", "media-type": "News", "title": "PetroShare Corp. Announces a 2-Year Extension of Strategic Land and Leasing Services Agreement With Kingdom Resources, LLC", "id": "bed058fa-7e70-4547-a07c-ab33999549c3", "content": "CENTENNIAL, CO--(Marketwired - September 03, 2015) - PetroShare Corp. announced today a 2-Year extension of its strategic land and leasing services agreement with Kingdom Resources, LLC. The agreement was set to expire on December 31, 2015 and has been extended through December 31, 2017. \n\nFred Witsell, President of PetroShare, commented, \"The extension mutually benefits the parties and allows the opportunity for the partnership to expand its ongoing leasing activities.\" \n   \nABOUT PETROSHARE CORP. \n\nPetroShare Corp. is a domestic oil and natural gas exploration and development company based in Centennial, Colorado. PetroShare targets capital deployment opportunities in established unconventional resource plays. Its current focus is in the Niobrara / Codell formations and adjacent oil and gas producing zones in the Rocky Mountain region with specific targets in the Wattenberg field within the DJ Basin of northeast Colorado. \n\nCaution Concerning Forward-Looking Statements \n\nThis news release contains certain forward looking-statements and information, including \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. The forward-looking statements and information expressed, as of the date of this news release, PetroShare's estimates, forecasts, projections, expectations or beliefs as to certain future events and results. These forward-looking statements include, among others, statements regarding the benefits that PetroShare expects from proposed transactions, the anticipated closing of the transaction, and plans and objectives of management for future operations. Forward-looking statements and information are necessarily based on a number of estimates and assumptions that, while considered reasonable by management, are inherently subject to significant business, technical, economic and competitive uncertainties, risks and contingencies, and there can be no assurance that such statements and information will prove to be accurate. Therefore, actual results and future events could differ materially from those anticipated in such statements and information. \n\nRisks and uncertainties that could cause results or future events to differ materially from current expectations expressed or implied by the forward-looking statements and information include, but are not limited to, the risks of obtaining sufficient capital, the level of success in exploration, development and production activities, possible defects in title to properties, fluctuations in the market price of crude oil and natural gas, industry risks, possible federal and/or state initiatives related to regulation of hydraulic fracturing, risks related to permitting and the projected time frames to receive the necessary permits, the construction of crude oil production operations and commencement of production and the projected costs thereof, possible failure of exploration and development activities to yield oil or gas in commercially viable quantities, risks related to litigation, the state of the capital markets, environmental risks and hazards, uncertainty as to calculation of crude oil and natural gas resources and reserves and other risks. Readers should not place undue reliance on forward-looking statements or information included herein, which speak only as of the date hereof. PetroShare undertakes no obligation to reissue or update forward-looking statements or information as a result of new information or events after the date hereof except as may be required by law. See PetroShare's Prospectus and other filings with the Securities and Exchange Commission, under the caption \"Risk Factors\" for additional information on risks, uncertainties and other factors relating to the forward-looking statements and information regarding the Company. All forward-looking statements and information made in this news release are qualified by this cautionary statement.", "source": "Marketplace"}