{"published": "2015-09-18T04:54:19Z", "media-type": "News", "title": "Schools fear funding change could cause closures: disability inquiry", "id": "3c7b7ee6-da0a-4800-ad5e-920b426526da", "content": "A senate inquiry into the treatment of school children with disability hears many specialist support classes will close under a change to federal government education funding. \n\nSchools supporting some of the country's most vulnerable students might be forced to close their doors under a federal government shake-up which links funding increases to the Consumer Price Index, a Senate inquiry has heard.\n\nRepresentatives of both mainstream and special schools expressed grave fears that services for students with a disability would be rolled back under the new funding arrangement to start in 2017.\n\nGiving evidence to an inquiry into the treatment of school students with a disability , Australian Education Union president Correna Haythorpe said funding was already inadequate and indexing increases to CPI would be a backwards step.\n\n\"Chronic underfunding of students with disability is a major problem for public schools which is stopping children with disability receiving a quality education,\" she said.\n\n\"It is the biggest barrier to children with disability participating on an equal basis at schools and making the most of their potential.\"\n\nAbout three-quarters of children with a disability attend public schools with the AEU providing evidence that 13.1 per cent of children have additional needs but only five per cent receive funded support.\n\nThere is a lack of national consistency in support with the AEU pointing out that funding ranges from $5000 per student each year in South Australia to $40,000 in Tasmania.\n\nNational director of Autism Spectrum Australia (Aspect), Dr Trevor Clark, also criticised the curtailing of the Gonski funding reforms and the proposal to link increases to CPI.\n\nAlmost 1000 children on the autism spectrum attend Aspect schools and there are 800 on its waiting list.\n\nDr Clark said the funding changes would be devastating. \"It would be pretty severe. \"We would have to cease our growth and maybe even close some classes.\"\n\nChairwoman of the National Independent Special Schools Association Elizabeth Gadek agreed many long-running services would be unable to operate under the plan.\n\n\"I can see that many of them would face closure,\" she said. \"They would no longer be able to offer that support.\"\n\nShe told the public hearing in Sydney it was common for children with disability to be refused enrolment at their local school or given the option of limited classes.\n\nAlbion Park mother Melissa Smith, whose daughter, Lili Morgan, has a range of disabilities, was forced to battle for her 11-year-old's right to attend a mainstream school like her siblings.\n\n\"I was shocked at how much I had to convince, beg and persuade that mainstream would be the best for her,\" she said.\n\n\"It's really hard to watch your child on life support and then turn up to school on Monday and smile and fight more.\"\n\nCo-chief executive of People with Disability Australia, Therese Sands said parents were compelled to become advocates for their children due to lack of awareness about the Disability Standards for Education, which give equal rights to all students.\n\n\"The education standards are not well understood in the school system,\" she said. \"They exist in law but they are not being implemented in practice.\" The story first appeared on The Sydney Morning Herald.", "source": "Bega District News"}