{"published": "2015-09-02T12:49:53Z", "media-type": "News", "title": "Aytu BioScience Completes $5.175 Million Private Placement", "id": "ffdd6c21-49a2-49c3-aaba-40efcbacfcd3", "content": "SOURCE Aytu BioScience, Inc.\n\nENGLEWOOD, Colo. \n\nJosh Disbrow \n\nNewbridge Securities Corporation, through LifeTech Capital, acted as sole placement agent for the institutional portion of the offering. \n\nThe notes offered and sold in the private placement have not been registered under the Securities Act of 1933, as amended, and may not be offered or sold in the United States \n\nAbout Aytu BioScience, Inc. Aytu BioScience, Inc. is a specialty healthcare company focused on developing treatments for urological and related conditions. The Company is currently completing Phase 3 clinical development for its lead therapeutic candidate Zertane™, an orally disintegrating tablet (ODT) formulated specifically for the on-demand treatment of premature ejaculation (PE). The Company's therapeutic pipeline is supported in part by its first-in-class RedoxSYS® System, which provides the only complete assessment of patients' redox status and enables identification of a broad variety of disorders where redox is implicated. Clinical studies are underway utilizing the RedoxSYS system in male fertility. The Company also recently acquired and is commercializing FDA-approved ProstaScint® (capromab pendetide), a radio-labeled monoclonal antibody, that targets Prostate Specific Membrane Antigen (PSMA), a protein uniquely expressed by prostate tissue. The Company's strategy is to develop its core therapeutic and diagnostic assets while building an innovative pipeline of established marketed products and late-stage development assets.\n\nFor Investors & Media: \n\nTiberend Strategic Advisors, Inc. \n\nJoshua Drumm \n\nForward Looking Statement \n\nThis press release includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, or the Exchange Act. All statements other than statements of historical facts contained in this presentation, including statements regarding our anticipated future clinical and regulatory events, future financial position, business strategy and plans and objectives of management for future operations, are forward-looking statements. Forward looking statements are generally written in the future tense and/or are preceded by words such as \"may,\" \"will,\" \"should,\" \"forecast,\" \"could,\" \"expect,\" \"suggest,\" \"believe,\" \"estimate,\" \"continue,\" \"anticipate,\" \"intend,\" \"plan,\" or similar words, or the negatives of such terms or other variations on such terms or comparable terminology. Such forward-looking statements include, without limitation, statements regarding the intended use of the proceeds of the offering, the potential future commercialization of our product candidates, the anticipated start dates, durations and completion dates, as well as the potential future results, of our ongoing and future clinical trials, the anticipated designs of our future clinical trials, anticipated future regulatory submissions and events, our anticipated future cash position and future events under our current and potential future collaborations. These forward-looking statements are subject to a number of risks, uncertainties and assumptions, including without limitation to the risks described in \"Risk Factors\" in Item 2.01 of the Company's Current Report on Form 8-K filed on April 22, 2015 \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/aytu-bioscience-completes-5175-million-private-placement-300136499.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WSFX-TV"}