{"published": "2015-09-26T02:37:19Z", "media-type": "Blog", "title": "New Longevity Record for North American Herring Gull", "id": "0196e31f-a975-4820-b06a-8d7ce72e9124", "content": "While searching for banded gulls on southern Lake Michigan on Sunday, 20 September 2015, I spotted this adult Herring Gull with a silver band on its right leg:\nBanded Herring pictured next to a 2nd cycle Lesser Black-backed Gull.\nBerrien County, Michigan. 20 September 2015. As I started moving about and recording the numbers on the band, the bird sensed my presence and walked off to the shoreline:\nWhen gulls move to the water's edge like this, it usually means they're nervous and are ready to fly off. So I backed off, giving it a few minutes to relax and take to me, all the while without making any eye contact. As it started to loosen up I went back to photographing:\nI reported the following sequence to the Bird Banding Lab that night: 0846-10957.\nData Submission All the Herrings that I've submitted to the Bird Banding Lab (BBL) in the past have been between 1-12 years old. So you can imagine my surprise when the following banding date came back: 28 June 1986. 29 YEARS AND 3 MONTHS OLD!!\nCoincidentally, I had two other banded birds on this day and reported them too. The next morning I received Certificates of Appreciation for these two gulls, but not the 29-year old. It was flagged due to its old age. The BBL asked for more details as to how I retrieved the band number and requested photos from me. This is standard protocol for older birds. But not just \"any old\" bird. Little did I know that my report was going to set a new Herring Gull longevity record in North America.\nI submitted the entire set of photos showing the numbers and this is the reply I received:\n\"Hi Amar, Excellent photos, thank you for sending them.  This confirms 0846-10957, 29 years 3 months old, and the new longevity record for the species.  It's a good thing the bander used a hard metal band!  You'll have to keep an eye out for this bird in the future.  This record will get posted to our longevity website, which I'm coincidentally working on updating this week so it should show up soon. This is actually the first time this bird has been reported to us.  Banded as a \"local\" or still dependent bird on 6/28/1986 in the 10 minute block designated as Egg Harbor, WI.  The permit is still active that banded it, St. Mary's University of MN, Dr. Raymond Faber.\"\nJo Anna Lutmerding Supervisory Biologist / Encounter Data Manager Bird Banding Laboratory Patuxent Wildlife Research Center 12100 Beech Forest Rd Laurel, MD 20708 301-497-5940 jlutmerding@usgs.gov The bander, Dr. Raymond Faber, who I've spoken with on several occasions regarding his banding work, sent me this reply as well:\n\"Amar, this is fantastic news!  A new record for longevity in North America!  I banded the bird on Hat Island (which is nearest to Egg Harbor) on June 28, 1986 as you reported.  Wow!  Keep looking for it. Thanks so much for your tireless devotion to the gulls.\"\nRay Faber\nAnd so there you have it. A simple field observation has added a tiny bit of enrichment to our knowledge of Herring Gulls in North America. I'm confident that there are older Herrings on this continent - and surely in Europe - we just have to get out there and spot them! I'm looking forward to relocating this bird...maybe on its 30th birthday?\nBelow is a list of the 4 oldest American Herrings in the BBL database, with my bird now being the oldest. What makes this individual even more special is that it was alive and well (whereas the others were found dead).\nFor photos and histories of banded American Herring Gulls, visit the Gull Research page:\nhttp://gull-research.org/smithsonianus/ahgrings.html", "source": "Anything Larus"}