{"published": "2015-09-24T09:33:45Z", "media-type": "Blog", "title": "International Postgraduate Coursework Scholarship at University of Sydney in Australia, 2016", "id": "549fe87a-f664-4ed8-9941-abe1d68f7cdd", "content": "International Postgraduate Coursework Scholarship at University of Sydney in Australia, 2016\nSeptember 24, 2015\nby Scholarship Positions\n2016, arts, Australia, International, Postgraduate, Scholarship, Social Sciences, University of Sydney\nComments are off\nTweet\nSponsored Links\nUniversity of Sydney is inviting applications for international postgraduate coursework scholarship. These scholarships exempt students from international student tuition fees for the duration of their chosen course. This award does not cover the Student Amenities Fee (SAF), or other expenses associated with study including living allowance, textbooks, visa fees, health cover, laptops or other goods. The application deadline is 31 October 2015.\nStudy Subject(s): Scholarships are provided to learn any of the courses offered by the Faculty of Arts and Social Sciences at University of Sydney in Australia.\nCourse Level: Scholarships are available for pursuing postgraduate degree level at University of Sydney in Australia.\nScholarship Provider: University of Sydney, Australia\nScholarship can be taken at: Australia\nEligibility:  Applicants must:\n-have received an unconditional offer of admission to a Master degree in the Faculty of Arts and Social Sciences\n-have a minimimum of 7.0 IELTS (overall) or equivalent if they are from a non-English speaking background\n-be commencing postgraduate study at the University for the first time\n-be a citizen of a country other than Australia or New Zealand, and not hold permanent residency in Australia\n-Not be in receipt of any other scholarship that covers tuition fees\nScholarship Open for International Students: International Students other than Australia or New Zealand can apply for these scholarships.\nScholarship Description: The Faculty of Arts and Social Sciences offers a limited number of scholarships to outstanding international students undertaking a postgraduate coursework Master degree in the Faculty of Arts and Social Sciences. These scholarships cover the tuition fees for the duration of the course.\nNumber of award(s): A limited number of scholarships are offered.\nDuration of award(s): The scholarship is limited to the standard duration of the course.\nWhat does it cover? These scholarships exempt students from the international student tuition fees for the duration of their chosen course. This award does not cover the Student Amenities Fee (SAF), or other expenses associated with study including living allowance, textbooks, visa fees, health cover, laptops or other goods.\nSelection criteria: There is strong competition for these scholarships. Selection is primarily based on academic merit including excellent results in the applicant’s English language test, if applicable. Applicants must also provide a statement regarding why they want to undertake their chosen program and what they hope to achieve following graduation\nNotification: Not Known\nHow to Apply: There is no separate application form for these scholarships. If you wish to apply, please complete the personal statement form and email it to arts.scholarships-at-sydney.edu.au. This personal statement should set out your academic and extra-curricular or professional achievements, and outline why you want to undertake your chosen course and what you hope to achieve following graduation.\nScholarship Application Deadline: The application deadline is 31 October 2015.\nFurther Official Scholarship Information and Application\nTweet\nSponsored Links\nScholarship Comments and Discussion\nRelated Scholarships and Financial Aid Positions2011 Swansea University Alumni: Postgraduate Bursary Scheme, UKPostgraduate Scholarship – Evaluation of Buckle-Up Safely at University of Sydney in Australia, 20152013 The University of Sydney International Postgraduate Coursework Scholarships in AustraliaPostgraduate Scholarship in Contaminant Hydrology at University of Sydney in Australia, 2016School of Information Technologies Postgraduate Coursework Entry Scholarships in Australia, 2016\nLooking for Scholarships?\nGet international funding options for Undergraduate, Masters, PhD and Post-Doc Courses.\nFeatured Scholarships\nCBS Innovation International Scholarship for Undergraduates in Australia, 2016 Sep 26, 2015\nCyprus Government Graduate Scholarships in Hydrocarbons, 2015-2016 Sep 09, 2015\nKAUST Fellowship for PhD and MS/PhD Program in Saudi Arabia, 2016 Aug 01, 2015\nVictoria University Graduate Research Scholarship in Australia, 2016 Aug 01, 2015\nUNESCO/Czech Republic Co-Sponsored Fellowships Programme, 2016-2017 Jul 30, 2015\nRecent Scholarships Bio-Techne R&D Systems Scholarship For International Students In USA, 2016 Croucher Research Studentships For Citizens of Hong Kong, 2016-2017 Teach For India Fellowship Program For Graduates In India, 2016 Hertz Graduate Fellowship Award In USA, 2016-2017 CBS Innovation International Scholarship for Undergraduates in Australia, 2016\nCareer BlogTrinity College Online Course On Mobile Computing With App InventorHarvard University Online Course On Global Health Case StudiesHarvard University Online Course On Data WiseGoogle With Udacity Launches Online IT Courses In IndiaQueen’s University Belfast Online Course On Global Food Crisis\nApplying for Scholarships in 2015?\nApply for top 2015 scholarships and financial aid positions before application deadlines.2015 ScholarshipsFeatured Scholarships\nSearch Free Scholarships\nScholarships CategoriesScholarships Categories", "source": "Scholarship Positions 2015 2016"}