{"published": "2015-09-14T10:27:09Z", "media-type": "News", "title": "Obasanjo’s nepotism influenced Abeokuta as state capital in 1976, says Ogun monarch", "id": "df5d5b3a-2362-46a0-b520-34981ee0a7b7", "content": "Oba Sikiru Adetona, the Awujale and paramount ruler of Ijebuland, has accused former President Olusegun Obasanjo of being nepotistic by influencing the upgrade and making of Abeokuta, then a rustic town, as Ogun State capital in 1976. \n \nThe first class, Ogun State monarch, said at the weekend, during the turbanning ceremony of Princess Khadijat Adebisi Edionsere as the first Iya Suna of Ogun State by the Muslims Council, that Obasanjo used his influence and power as the second in command then, to ensure that capital of Ogun State was given to his home town, Abeokuta. \n \nHe revealed that Abeokuta was never recommended among cities under consideration as the state capital by the then military administration of late General Murtala Muhammed in 1976, adding that the then Chief of Staff, Supreme Headquarters, Lieutenant General, now former President Olusegun Obasanjo changed the system and favoured Abeokuta overnight. \n \nThe monarch, however, explained that the action of the former president proved him “to be a true son of Abeokuta”, saying: “It is good to use your position to positively affect your people. \n \n“When Ogun State was to be created, Abeokuta was not the city recommended as state capital. But, because Obasanjo was the second in command, he took the capital to Abeokuta. I don’t condemn his action, I am only saying our people should learn from that.” \n \nWhile lauding Governor Amosun for ongoing construction projects in the state, the leader of Muslims Ummah in Ogun state, dismissed allegations in some quarters that the governor is concentrating more on Abeokuta in terms of development, adding that state capitals around the world enjoy certain rights and privileges that befit their status. \n \n“We have bridges in Ijebu-Ode, Sagamu, Abeokuta and Ilaro. The governor is touching everywhere. Abeokuta is the state capital just like Abuja or Lagos and therefore should be treated as a state capital.” \n \nHe then charged the newly installed Muslims’ Women leader, Princess Adebisi Edionsere to continue her support for propagation of Islam through dedication and philanthropic activities. \n \nSource: Business Day", "source": "NewsNG.com"}