{"published": "2015-09-07T05:32:06Z", "media-type": "News", "title": "Man jailed for Perth strangling murder", "id": "4d9ce464-99b2-45e3-9b1c-47f958c53aa9", "content": "A MAN who strangled a drunk and despondent woman for annoying him, then dumped her body in a Perth river, will spend at least 19 years behind bars.  \n   \nPETER Michael Bradshaw was to stand trial in July over the death of Janelle Kathleen Knox, but pleaded guilty at the last minute. \nThe West Australian Supreme Court heard that Ms Knox and Bradshaw, both 34 at the time of the April 2013 attack, were with other Kelmscott hostel residents on the banks of the Canning River and all of them were \"very drunk\". The pair had been friends and Bradshaw had listened to Ms Knox's loud complaints about her life. She was homeless after being assaulted by her then-boyfriend and had been asked to leave the hostel for not paying her rent. Ms Knox was crying and being loud, saying she wanted to \"end it all\". \"That was getting to him,\" defence lawyer David McKenzie said during sentencing on Monday. Bradshaw started signalling his intent to the others, saying \"I can get rid of this problem\" and that he had \"fresh meat\" to use as bait while they fished for marron. Ms Knox was then strangled from behind with a rope and her body was dragged into the river. \"Initially you were there as her friend ... tragically, your attitude changed,\" Justice Lindy Jenkins said. \"Your motive was to rid yourself of a troublesome person who you say wanted to die anyway.\" Bradshaw claimed he wasn't the only killer, and while Justice Jenkins said she could not be completely certain he was the sole attacker, she did not accept his version of events. Justice Jenkins said the crime was aggravated by the fact he tried to clean up the scene and stole his victim's personal belongings. Speaking with reporters outside court, Ms Knox's cousin Emma Knox said the family was satisfied with the sentence but had found it difficult listening to the evidence. \"I think it's a very appropriate sentence,\" she said. \"Nothing will ever bring her back though. Janelle ... was a diamond in the rough. She'll never be forgotten.\" Ms Knox is survived by her eight-year-old son, who is living with family. \"We see a little bit of her in him.\"", "source": "Gold Coast Bulletin"}