{"published": "2015-09-16T12:16:18Z", "media-type": "News", "title": "Why you shouldn't care that SAT scores are stagnating, and what they don't mean about American education", "id": "4dd4f772-69e2-4089-8bb6-d39c87ea865c", "content": "SAT scores for 2014 hit their lowest mark in the past 10 years, the College Board reports, leading some observers to fear that a decade of school reforms have amounted to little. But education experts of all political stripes downplay the significance of the SAT scores because they aren't a representative sample of American high school graduates. SAT test takers skew toward college-bound high schoolers, and that population also shifts over time and varies by geography, says William Mathis, managing director of the National Education Policy Center at the University of Colorado. Students on the coasts take the SAT, while those in the heartland are more likely to take the competing ACT exam. Even in SAT country, some states push most of their students to take the test, and some even pay the fees, while others let students do it all themselves. In general, the trend has been for more students to take the SAT, Mathis said, so it's not surprising that average scores come down. \"We are digging deeper into the pool,\" Mathis said, \"with huge numbers of traditionally non-test taking populations now taking the test, and not scoring as well, and bringing the average down.\" \"You can't use the SAT to say anything,\" agrees Michael Petrilli, president of the Washington, D.C.-based Fordham Institute. \"We do know that the population taking the test has changed over time, and that more low-income kids are taking it.\" The net result, Mathis, Petrilli and other experts agree, is that SAT scores tell us very little about the state of American education. Expert opinion begins to differ, however, when it comes to what we do know about the academic readiness of American high schoolers. Most of these experts agree we can learn more from the National Assessment of Educational Progress. The NAEP test is given every four years throughout the country to a random sample of fourth-, eighth- and 12th-graders. But they disagree on what even these numbers tell us. So have American high school students improved over the last decade, or are they stuck in a rut? And if the latter, what does their stagnation tell us about our vaunted education reform efforts that began in the late 1990s? The answers, as is so often the case in education, depend on who you ask. Lost momentum? Fordham's Petrilli, a vocal advocate of tougher standards and school accountability, agrees that stagnating SAT scores tell us little on their own, but he sees that same stagnation reflected in the NAEP scores over the past 10 years, and in recent ACT exam scores. NAEP scores matter most, though, because they are statistically valid, a random sampling of students in all states. Petrilli is particularly worried that what he sees as strong fourth- and eighth-grade growth in NAEP scores over the past decade seems to disappear in the 12th-grade NAEP tests. He sees two possible explanations for that decline: either what we are teaching kids in grade school does not translate well to high school so their improvement is illusory, or our high schools are dropping the ball. Page 2 of 3 - Petrilli acknowledges that the first argument may have merit, but puts his analytical bets on the second. High schools, he says, have not been a focus of the school reform movement, and have largely been allowed to plod along without disruption. Not everyone agrees that high schools are losing ground. Bob Schaeffer, public education director for the National Center on Fair and Open Testing, a Wasington-based education advocacy group, looks at the same NAEP data as Petrilli and sees a different story. In Schaeffer's interpretation, NAEP scores have been largely stagnant throughout the education reform period, both at the grade school and high school levels. If Schaeffer is right, then doubling down on education reform at the high school level would be just asking for more of a failed approach. \"The problem with education reformers is they are always looking for simple solutions to very complicated problems,\" Schaeffer said. \"The notion that there could be a quick fix in high school for poor test scores is another example of their simple-minded intervention strategy.\" Achievement gaps The real challenge, Schaeffer argues, is that schools at all levels are being asked to bear the brunt of economic, social and familial stresses that interfere with learning that simply cannot be properly addressed by schools. The economic gaps in SAT scores remain enormous. Inside Higher Ed points to gaps in reading scores to illustrate the point, but the same pattern appears from every angle. On a scale of 800, the average SAT reading score for students with a family income below $20,000 was 433, or the 28th percentile, while the average for those above $200,000 was 570, or the 72nd percentile. One of the most startling data points is the growth or decline of SAT scores by ethnic groups from 2006 to 2013. The National Center for Fair and Open Testing found that all ethnic groups except Asians suffered some decline. Asian scores climbed 54 percent over that period, while white scores declined slightly and all other ethnic groups declined in double digits. \"The single best predictors of academic success are the family's socio-economic status, the job status of the parents, and the education level of the mother,\" Schaeffer said, adding that most research shows that only 20 and 30 percent of academic outcomes can be influenced by the school. The test score gaps are influenced partly by economic and social stress, and partly by the enrichment wealthier families offer their children, says David Berliner, an emeritus education professor at Arizona State University. Over the past decade, Berliner said, enrichment opportunities offered by wealtheir parents — ranging from after-school art programs to test prep and tutoring — have increased fivefold among wealthier families while remaining flat in the middle and lower class. Unpacking NAEP Page 3 of 3 - Berliner argues that the NAEP scores can teach us a lot, but people generally don't use them correctly. The beauty of the NAEP scores, he argues, is not just that they are statistically valid, but also that we get 51 comparison points: each state plus the District of Columbia. The U.S. as a whole may trail South Korea on the national test score comparisons, he argues, but Massachusetts does not. \"We have 51 systems,\" Berliner said, \"and some are doing better, and some are doing worse, and this is true even of states that are right next to each other and similar in most other ways.\" He notes that Utah's schools are outperforming Arizona's, despite spending far less per pupil, and that Massachusetts has outstripped its neighbors in school performance in recent years, including neighboring Connecticut and Vermont. \"We need to learn from these differences,\" Berliner says. \"What are these states doing differently?\"", "source": "Ag Journal"}