{"published": "2015-09-01T14:07:12Z", "media-type": "News", "title": "J.D. Power Recognizes GES National Servicenter ® for Providing an Outstanding Customer Service Experience", "id": "e9ecad37-d7d0-4c30-8014-ede9dfe29668", "content": "It's the seventh year in a row GES has earned this prestigious certification \n\nLAS VEGAS, Sept. 1, 2015 /PRNewswire/ -- Global Experience Specialists (GES), a global, full-service provider for live events, announced that the GES National Servicenter® has been recognized by J.D. Power for contact center operation customer satisfaction excellence with its live phone channel for a seventh consecutive year under the J.D. Power Certified Contact Center Program.SM The Certified Contact Center Program distinction acknowledges a strong commitment by GES' National Servicenter operations to provide \"An Outstanding Customer Service Experience.\" GES achieved certification for the live phone channel, including interactive voice response (IVR) routing and customer service representative (CSR). \n\n\"GES is honored to achieve J.D. Power certification for a seventh year in a row,\" said GES senior vice president of customer service, Chris Elam. \"As a global, full-service provider for live events, we are committed to making it easy for our clients to do business with us. This achievement demonstrates our dedication to superior customer service. It's deeply ingrained in our culture, and our employees are the focal point of achieving these outstanding results. I extend my sincere appreciation to the National Servicenter team on this well-deserved certification.\" \n\nTo become certified, the GES National Servicenter successfully passed a detailed audit of more than 100 practices that encompass its recruiting; training; employee incentives; management roles and responsibilities; and quality assurance capabilities. As part of its evaluation, J.D. Power conducted a random survey of GES customers who recently contacted its National Servicenter in Las Vegas. \n\nAccording to J.D. Power, \"GES has demonstrated their commitment to their customers' satisfaction once again by earning their seventh consecutive live phone channel certification. Congratulations to the entire customer care team at the GES National Servicenter for this outstanding accomplishment.\"  \n\nFor certification status, a contact center must also perform within the top 20 percent of customer service scores, which are based on benchmarks established in J.D. Power's cross-industry customer satisfaction research. The evaluation criteria include the customer service representative's courtesy, knowledge and concern for the customer; promptness in speaking to a person; and timely resolution of the problem or request. Additionally, the experience with the automated phone system is evaluated based on the clarity of the information provided, the ease of navigating the phone menu prompts and the ease of understanding the phone menu instructions. \n\nLaunched by J.D. Power in 2004 to evaluate overall customer satisfaction with live phone interactions and to help organizations in various industries increase their efficiency and effectiveness by establishing and continually updating leading practices for handling service calls, the Certified Call Center Program is now called the Certified Contact Center Program, which certifies the live phone channel, the IVR self-service channel and the Web self-service channel. For more information on the Certified Contact Center Program, please visit JDPower.com. \n\nThe GES National Servicenter is open weekdays from 6 a.m. to 5 p.m. PT. Customers may speak to a knowledgeable representative by telephone at 1-800-475-2098  1.800.475.2098 1-800-475-2098 1-800-475-2098 or through live chat. For more information, visit us at ges.com.  \n\nAbout GES \n\nGlobal Experience Specialists, Inc. (GES), a Viad Corp (NYSE: VVI) company, is a global, full-service provider for live events, producing exhibitions, conferences, congresses, corporate events, exhibits and entertainment experiences. GES provides a wide range of services, including official show services, audio visual, cutting-edge creative and design, marketing and measurement services, and event accommodations – all with an unrivaled global reach. GES partners with leading shows and brands, including MAGIC, CONEXPO-CON/AGG and IFPE, Bell Helicopter and L'Oreal. GES' National Servicenter® has been recognized with certification under the J.D. Power Certified Contact Center ProgramSM for the past seven years, and for the sixth year in a row Ad Age has named GES as one of the \"World's 50 Largest Agency Companies.\"  For more information visit www.ges.com. \n\nNo advertising or other promotional use can be made of the information in this release without the express prior written consent of J.D. Power. www.jdpower.com \n\nContacts: \n\nGES \n\nDetra Page \n\n702.515.5627 \n\nJohn Tew; Troy, Mich. \n\n248-680-6218 \n\n  \n\nLogo - http://photos.prnewswire.com/prnh/20150616/223492LOGO \n\n  \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/jd-power-recognizes-ges-national-servicenter-for-providing-an-outstanding-customer-service-experience-300135795.html \n\nSOURCE Global Experience Specialists, Inc.", "source": "Stockwatch"}