{"published": "2015-08-31T05:00:00Z", "media-type": "News", "title": "Teachers: the resource students need most remains in short supply", "id": "3b32a1a6-00b0-4b2d-8ec2-80ee26683a94", "content": "(BPT) - The role of teachers in today’s society cannot be understated. Outside of a child’s parents, teachers are often the primary adult influencers in a young person’s life. Yet this essential role is getting harder and harder to fill as school districts across the nation face significant teacher shortages according to the U.S. Department of Education. To counteract this critical problem, recruiting new talent to the profession has become a national priority. What shouldn’t be lost in the quest for teachers, however is the intrinsic rewards of influencing and educating young people. The educators of tomorrow must view teaching as a path toward improving lives, not simply as a means to meet the demand. \n  \nMorale remains high \n \nThe modern teacher shortage can be tied to many things - including a wave of retiring educators and national education funding challenges - but teacher morale does not appear to be an issue. Research shows that 88 percent of teachers are satisfied with their choice to become a teacher, according to a recent University of Phoenix College of Education survey of more than 1,000 K-12 teachers. Additionally, 68 percent of teachers, who entered the field in the past 10 years, say they would recommend the profession to others. Recent federal data supports these findings as well. Eighty-three percent of teachers who entered the field in 2008-2009 were still working in education five years later, according to the National Center for Education Statistics. \n \nHigher education’s role in preparing the next generation of teachers \n \nEfforts to grow the teaching ranks must focus on teacher recruitment, particularly in STEM subjects. Research also shows that expanding access to teacher preparation programs and providing prospective teachers with experience that will help them navigate the critical first few years in the classroom is essential. \n \nHigher education institutions play a vital role in ensuring potential candidates understand the opportunities that exist in education. Today’s teacher preparation programs must be able to accommodate modern student schedules and meet unique education needs. \n \nTeacher preparation programs that offer flexibility and relevance to the dynamics of today’s classrooms are a must for student success. In addition, the curriculum offered by higher education institutions should also provide today’s teacher candidates with real-world scenarios that encourage critical thinking and decision-making skills. These lessons will be vital when managing their own classrooms in the years ahead. \n \nInspiring tomorrow’s teachers \n \nAs most teachers will attest, they did not join the profession to get rich, but rather to inspire children and young adults to learn, set ambitious goals and achieve them. The University of Phoenix survey found that past generations of teachers were quite successful at this. Nearly half of respondents were inspired to join the profession by a teacher they had when they were young, according to the University of Phoenix survey. \n \nRecruiting, retaining and supporting the individuals who are so critical to the future of today’s children, takes a team effort. But the efforts are worth it as the successes of today’s teachers will ultimately translate into the victories of tomorrow’s leaders.", "source": "Press and Dakotan"}