{"published": "2015-09-14T02:25:42Z", "media-type": "News", "title": "Liberal leadership: Bronwyn Bishop twice refuses to say whether she still backs Tony Abbott", "id": "8dfeaa92-9a57-4d6a-8bc0-4c92d92e3acd", "content": "By Sept. 14, 2015, 12:03 p.m. exit \nOne of Tony Abbott's biggest supporters has refused to say whether she still backs him as Prime Minister. \n\nBronwyn Bishop, who resigned as speaker last month after an expenses scandal, was twice asked on Monday if Mr Abbott retained her support. \n\n\"I think I've already answered that question and I've said I think there's enough commentary around without me adding to anything,\" Ms Bishop told reporters in Canberra. \n\nAsked if she was refusing to support Mr Abbott, Ms Bishop said: \"As I said, I don't think I need to add to the commentary.\" \n\nMr Abbott, who once described himself as the \"ideological love child of John Howard and Bronwyn Bishop\" indicated his mentor would have to step aside as speaker last month after controversy over her use of taxpayer-funded entitlements engulfed the Parliament. \n\nThe member for Mackellar moved to the backbench. \n\nOn Monday, Ms Bishop said she was not buying into leadership speculation but did not publicly declare her support for Mr Abbott. \n\n\"I simply say to you, the commentary is what it is. I don't think I need to add to it,\" she said. \n\nMrs Bishop's refusal to state support for Mr Abbott is a different approach to her actions during the February attempt to oust him from the leadership. At that time, Mrs Bishop strongly endorsed Mr Abbott to retain the top job. \n\nMr Abbott moved on Monday to reassure internal dissidents that he was not planning to call a snap election as early as this month. \n\nPressure is mounting on the Prime Minister ahead of a byelection on Saturday in the West Australian seat of Canning, which a Fairfax-Ipsos suggests the government is likely to win but with a swing against it of as much as 10 per cent. \n\nSuch a swing would not see the Coalition lose the seat but could trigger a fresh attempt to install Communications Minister Malcolm Turnbull as leader. \n\nAs the sitting week began in Canberra on Monday, MPs were hosing down rumblings about the leadership. \n\n\"I support the leader,\" Assistant Minister for Women Michaelia Cash said. \n\n\"I'm all about policy and the policy I'm looking at at the moment is in relation to domestic violence. \n\n\"Again, I am not going to indulge in leadership speculation.\" \n\nEnvironment Minister Greg Hunt described as \"ridiculous\" a suggestion Mr Abbott should call a snap spill on Tuesday to resolve the issue. \n\nFollow us on Twitter \n\nThe story Liberal leadership: Bronwyn Bishop twice refuses to say whether she still backs Tony Abbott first appeared on The Sydney Morning Herald .", "source": "Forbes Advocate"}