{"published": "2015-09-11T21:39:21Z", "media-type": "News", "title": "Tess Holliday posts NUDE image on Instagram and slams those who are 'offended'", "id": "66fe944c-326f-4f94-b0da-4e3b53c9df4e", "content": "By Charlie Lankston For Dailymail.com Published: View comments She has long-been an outspoken advocate for the plus-size modeling industry, and now Tess Holliday has shared yet another inspirational message about body image - along with a risque nude picture of herself. \n\nThe 30-year-old size 26 model took to Instagram on Thursday afternoon to post the saucy black and white image, which sees her standing in front of a bathroom mirror with her back to the camera, while glancing seductively over her shoulder. She even added a cheeky 'oops' sticker to cover her nipple.\n\n'My relationship with my body is a journey, not a destination,' she captioned the image.\n\nShe went on to pay tribute to her son, Rilee, whom she gave birth to when she was just 20-years-old, saying: 'I appreciate [and] honor what's it's done for me, [and] the life it brought into the world. \n\n'I couldn't give a if you find me attractive or if my body offends you.'\n\nThe mother-of-one also admitted that she has been working with a personal trainer, an LA-based fitness guru who goes by the name of Mack Fit, tagging him in the caption, and praising him for helping her on her body image 'journey'. \n\nShe finished off the post with the hashtag #effyourbeautystandards.\n\nAnd it seems her message, and her bravery when it comes to baring her body, quickly struck a chord with her 972,000 followers. Within four hours of being posted, the image had racked up more than 28,700 likes, with thousands of people also taking the time to share their thoughts on the picture - and Tess' message - in the comments section. \n\n'I love your confidence and your zest for life,' one person wrote, while another added: 'Lovely picture, love your confidence.' \n\nThis is not the first time that Tess, who reportedly weighs close to 280lbs, has dared to bare all for the camera, however. In fact the model has stripped down several times for photoshoots during her career, explaining to Daily Mail Online earlier this year that doing her first naked photoshoot helped her to feel truly comfortable in her own skin. \n\n'Obviously seeing myself in professional photos doesn’t hurt, but it has been the last six years that I have started to feel really good about myself,' she explained.\n\n'When I did my first photo-shoot naked - about three years ago I saw myself nude without Photoshop and thought, “I don’t look that bad.”' \n\nSince the start of her career, Tess has been incredibly outspoken about the need for more diversity within the fashion industry, and has appeared in a number of body-positivity campaigns during the past few months, including a bikini shoot for UK-based brand Simply Be, which encouraged women of all shapes and sizes to embrace their bodies for what they are, not what they 'should' be.\n\nEarlier this week, Tess spoke with MTV about the need for a plus-size Victoria's Secret Angel, telling the website that she believes more big-name brands need to start celebrating a more diverse body type. \n\nShe added that she hopes she has paved the way for more diverse women to enter the modeling profession, explaining: 'I have the biggest arms of anyone modeling - I know I do. My arms are the size of some people’s thighs, practically. \n\n'There are a lot of people that identify with that. I can hold it down for the big-armed girls. We’d also definitely need a lot of women of color—there are virtually no plus size Asian models and not a lot of plus size black models either.'", "source": "Mail Online UK"}