{"published": "2015-09-18T21:19:09Z", "media-type": "News", "title": "Firmware Friday: Update news aplenty from Canon, Nikon, Olympus, Ricoh and Sony", "id": "a4835f45-65ef-4df3-97cb-9e346b6a7130", "content": "at 4:24 PM EDT \n       \n      \nWhen it comes to firmware, good things come in pairs this week, it seems! \n \nWe've already told you about a pair of upcoming updates from Olympus and Sony earlier in the week. Firstly, Olympus will be updating both the E-M1 and E-M5 II mirrorless cameras in a couple of months, adding a raft of new features to both. And then we have Sony's plans for uncompressed raw support in the Alpha A7S II and A7R II mirrorless cameras , a plan that may possibly spread over time to bring other A7-series firmware updates. \n \nIn a typical week, that would be plenty enough for our Firmware Friday roundup, but even having already told you about all of that this week, we're still left with a whole lot to discuss. We have news of updates for two Canon DSLRs, two Nikon DSLRs, two business-oriented Ricoh rugged cameras and an action camera from Chinese brand XiaoYi. \n \nWe'll start with Canon, whose updates for the EOS-1D X and EOS-1D C DSLRs landed a couple of days ago. In both cases, the updates fix the exact same issue: The autofocus drive continuing to operate intermittently with a shutter button half-press, even when the custom functions had been set to activate metering only on a half-press. \n \nCanon EOS-1D X owners can download the firmware version 2.0.8 update from Canon's website and install it themselves. Canon EOS-1D C, owners, however, will have to return their camera to Canon to have the firmware version 1.4.0 update installed , and may have to pay for shipping and handling. \n \nNext up, we have Nikon's updates for the D5200 and D7100 DSLRs. Both updates aim to resolve a problem with camera lockup when the \"Clean image sensor\" function has been activated, as well as horizontal banding in HD (1,280 x 720 pixel) movies shot at 50p or 60p frame rates. \n \nFor the D7100 only, there are also fixes for a problem with camera lockups during menu scrolling in some languages, as well as an issue that caused the screen to darken during image review if the playback button was pressed. An unspecified problem with the viewfinder virtual horizon has also been corrected. \n \nYou can download Nikon's new firmware at the links below: \n \nNext up this week, we have new firmware for the Ricoh G800 and G800SE. These rugged cameras are aimed at business and industrial use, and differ in the latter's Bluetooth, Wi-Fi, GPS and bar code scanning capabilities. (Bluetooth and Wi-Fi are built-in, while the other functions require optional accessories.) \n \nNew firmware for the Ricoh G800SE and G800 resolves an issue with connection to PictBridge-compliant printers. For the G800, that's the only change, but the G800SE also gets some other tweaks. A problem that prevented image transfer when using the date folder option has been fixed, and support added for more 802.1x certificates. These include certificates that expire after the year 2038, chained certificates, and PEAP with EAP-MSCHAP v2 certificates (but only with an EAP-TLS certificate key of 2,048 bit or less.) \n \nYou can download Ricoh's new firmware at the links below: \n \nAnd finally, we come to the XiaoYi action camera, for which firmware version 1.2.12 landed earlier this week. Here, there have been tweaks to power-saving mode for greater battery life, and to sounds and status lights for better status indication. Behavior in time-lapse, burst mode and loop video recording has also been changed. Problems with app connectivity and live view have also been fixed, as well as issues with image reversal and clip length in time-lapse shooting. You can download the XiaoYi action camera firmware version 1.2.12 here . \n \nAnd that brings us to the end of a rather action-packed week on the firmware front. Enjoy your weekend, and be sure to check back next time for more Firmware Friday news! \n \n ( Camera parts image courtesy of Kelly Hofer / Flickr; used under a Creative Commons CC-BY-2.0 license . Image has been modified from the original.)", "source": "Imaging Resource"}