{"published": "2015-09-08T03:07:28Z", "media-type": "Blog", "title": "It all starts with a seed - Ann Arbor easy meals", "id": "32228a3e-b42f-4703-997e-8fbf7ba81f07", "content": "Oh this pesky Michigan weather. One day it's 80 degrees, two days later it's snowing. Living in Michigan we're all used to this kind of treatment from Mother Nature, but what do we do when we get those really nice days and our fingers are just itching to get into our gardens? Why, start an indoor garden, of course!\nOne of the nicest parts about Ann Arbor is the eclectic mix of people and their tastes. If you look around at the houses along your street, you're sure to notice at least one indoor window box in your neighbors window, growing something green. While some of our neighbors have already been outdoors planting away, there are some of us who are waiting, albeit impatiently, to get out there and get our vegetables and herbs planted. So while we're itching to get out there, the next best thing to do is to start our garden indoors.\nWhether you're startingyour seeds to be later transplanted to an outdoor garden, or like many of us have limited space to have the desired vegetable and herb garden out of doors and grow indoors instead, starting indoors when the weather is starting to look promising gives your seedlings the time to get a strong root system. With many indoor gardening systems on the market it can be as simple or involved as you'd like it to be. The AeroGarden is one popular device on the market today to have an indoor garden with everything from herbs and vegetables to flowers. They even have a special tray made especially to start seeds to be transplanted at a later date. It's cost ranges from $99 to $200 depending on what type and size system you'd like. They also sell the seed packs to just pop right into your system to make starting a garden easy. Maintaining it with the AeroGarden is even easier as it tells you when to add water, when it needs nutrients added and simple instruction booklets on how to take care of your plants.\nThere are also potting systems sold in your local stores that offer a variety of options such as how many herbs can go into one system from the stackable potting system to a 3 pot window sill planter. They are virtually everywhere in local stores or online for easier shopping. The selection is vast and sometimes half the fun of starting your own indoor garden is picking out the pots or systems. If you don't want to bother with a planting system and have some clay pots with a 6\" top diameter that will fit in your window sill, that works just as well. Which ever option you choose, you're on your way to starting your indoor garden with just a few easy steps.\nWhen creatingyour indoor garden it's important to start with the proper materials. You want to be sure to use a nice garden soil that's made specifically with indoor planting in mind. If you know you're going to transplant your garden outdoors when the chance of frost is gone, you may even want to try growing your seeds directly in peat pots which allow you to plant them directly into the ground when the time is ready. And if you're keeping an herb garden indoors to pick at as needed in the kitchen, be sure to use clay pots as they allow the air to circulate and water to drain properly.\nTo learn revealing hints about https://about.me/bloomingpods - About.Me/Bloomingpods - and even on https://about.me/bloomingpods - Blooming Pods - , visit these excellent web pages.\nYou also want to have a misting bottle on hand. This will come in especially handy when starting your garden indoors when your furnace is still running and houses tend to be drier. Keeping your plantsat the right point ofmoisture is important if you want strong, healthy plants. Too little water will not grow anything, and too much water will result in root rot. By misting your plants with water you can keep your plants nourished with the proper amount of water. And in a pinch you can always place your pots atop some pea gravel or small stones in a dish that you can add water too to supply your plants with the humidity they need. Keep in mind you will be watering that much more often than the plants itself as it's open to the dry air of your home.\nOnce your seedlings have come up, keep your plants dirt damp, but never wet. You should be able to touch the dirt and feel the water in it, but not get your finger wet with water. If you are, you're over watering. Watering daily is a necessity to healthy plants. If you're not transplanting outdoors, be sure to choose seeds when potting that do well in compact conditions. Good indoor herbs that do not require large amounts of space are: chives, basil, parsley, rosemary, sage, tarragon, andthyme.\nOnce you're plants start to come up, it's important to trim them back so they don't grow in a singular long stalk. Pruning your plants will create strong, hearty plants.To find out how to properly cut back your plants https://about.me/bloomingpods - About Me Blooming Pods - for heartier supply just go to the library and check out an indoor gardening book or Google what herb you're specifically wanting information. Many seed packets will also tell you how to properly maintain your plants once grown.\nOnce your indoor garden has successfully grown, start enjoying the benefits of having your own herbs at your fingertips:Healthy, fresh eating.\nhref='http://www.examiner.com/article/it-all-starts-with-a-seed' - http://www.examiner.com/article/it-all-starts-with-a-seed - http://www.aerogrow.com/myaerogarden.php - http://www.aerogrow.com/myaerogarden.php -", "source": "blogigo.com"}