{"published": "2015-09-28T11:53:44Z", "media-type": "News", "title": "No ticket office and just one ticket machine working as Redditch rail users slam weekend train service", "id": "9a3d256e-9f2c-4c26-abdf-469361025b0c", "content": "REDDITCH rail users travelling into Birmingham for the Rugby World Cup last weekend were left reeling after an \"appalling service\" at Redditch railway station. \n \nPeople travelling into the second city faced huge queues at Redditch station on both Saturday and Sunday mornings - with some people missing trains. \n \nTo make matters worse the ticket office was not open, and just one of the ticket machines was working. \n \nTens of thousands of fans descended on Birmingham over the weekend for two rugby world cup games being held at Villa Park, as well as other attractions. \n \nOn the Saturday the venue hosted south Africa v Samoa, while on Sunday it was Australia v Uruguay. \n \nOne disgruntled rail user, Colin Bates, said that despite extensive coverage in the media about how busy Birmingham was going to be London Midland seem unable to plan for extra passengers. \n \nMr Bates, who was travelling to Villa Park on Sunday, said: \"I managed to be the last paying person to get on from Redditch. I would say 90 per cent of the queue behind just left when the train came in and got on, taking the risk of being fined by London Midland. \n \n\"The train was very overcrowded, there was no ticket inspector or anyone trying to sell tickets, so the majority of people didn't pay. We stopped for ages at every station as there were so many people on the train and got to Aston station 20 minutes late, also with no tickets being checked.\" \n   Promoted stories   \nAs well as the rugby it was the first weekend following the opening of Birmingham's Grand Central, which said 150,000 eager shoppers passed through its doors, and an arts festival. \n \nMr Bates added: \"Surely London Midland can put on staff or advise if tickets can be bought on the train. \n \n\"It is an appalling service that they should be ashamed of. Redditch passengers deserve a train service that can cope with people trying to actually use the service.\" \n   \n Share article  \n   \nA spokesman from London Midland apologised for any inconvenience caused and said that there will be times when ticket offices would not be able to open for various reasons. \n \nThey stressed that it was an \"exceptionally busy weekend\" and that they had warned people in advance that it would be busy and to expect journeys to take slightly longer than usual.", "source": "Hereford Times"}