{"published": "2015-09-06T00:34:56Z", "media-type": "Blog", "title": "Day 5 Florence", "id": "019650a1-ddea-4318-bfcb-76274061828a", "content": "Advertisement\nEurope » Italy » Molise\nSeptember 2nd 2015 Published: September 5th 2015EDIT THIS ENTRY\nTotal Distance: 0 miles / 0 kmMouse: 0,0\nDay 5 Florence\nDonel\nOK this is it! The big day! We have been very excited about this one since the day it was booked! Docked at Ravenna then off to Florence! The heart of the renaissance period. First a bus ride to Bologna then a winding walk through the train station to our track (19) and our coach #7 for reserved seats. At the exact scheduled time the train pulled away from the platform and such a nice smooth ride. Out of the train and into the melting heat. We are on foot from here through some winding streets to find the main cathedral Santa Maria del Fiore. Stunning red white and green marble. Sadly the Baptistry in front of the church is being renovated so the view was a little distracting. This was designated as our meeting place so we could find the bell tower fairly easily later after our free time. Away we go to find the bridge. Which bridge you say? Why the Ponte de Vechio (used to house butchers but the smell got the best of them). The centre of commerce in Florence and the connection between the Medici’s Palace and the church. The passage on the top of the Bullet Trainbridge was used so the Medici’s didn’t have to walk out in the streets amongst the riff raff. Sadly the tour goes on so we don’t have time to go shopping…(mostly jewellery stores). Statues everywhere you turn and not just everyday statues, these are the ones that we have all seen and now we are in front of the real deal. Except for David. This is a replica the real one is now in the museum so it doesn’t deteriorate any more. Tour done, time for free time so as we are exploring the side streets we come across a café and just HAD to explore the menu. I had a Spinach Gnudi with Béchamel & Pomodoro sauce, Elke had fresh Porchini mushroom tagliatelli. Ok back to the train, the bus and onto the ship. 10 ½ hours. This is some form of endurance test… long walks over cobblestones in withering heat (worth every second). Tomorrow is Split, Croatia.\nAdditional photos below\nPhotos: 22, Displayed: 22 Advertisement", "source": "Travel Blog"}