{"published": "2015-09-10T11:36:06Z", "media-type": "News", "title": "Does the US Dollar Matter to the Fed?", "id": "5da92cc3-ff1a-4d5a-9c0a-b046218da7d1", "content": "As the long awaited FOMC decision approaches one week from today opinions seem split as to whether the Fed will raise rates or wait until October or December. If the focus was solely on domestic factors the decision would be an easy one. However, there are external influences that go beyond just the domestic economy that cloud the outlook.\n\nOne of these factors is the value of the US dollar and the question is does it matter? Perhaps I should ask, how much does it matter? While not an overriding factor it is one that appears to be part of the decision making process as indicated in the minutes from the July 28-29 FOMC meeting:\n\nSome participants also discussed the risk that a possible divergence in interest rates in the United States and abroad might lead to further appreciation of the dollar, extending the downward pressure on commodity prices and the weakness in net exports.\n\nIt is not clear what currencies the Fed is looking at in the forex market. Is it the trade weighted dollar, commodity currencies, major currencies such as the EUR and JPY, the Chinese currency after the recent devaluation, battered emerging market currencies or a combination of these currencies? \n\nThis is important in the run up to the FOMC meeting as the current picture in the forex market is mixed, with currencies such as the EUR and JPY benefiting from safe haven flows and carry trade unwinding while the dollar is generally bid elsewhere. Add in recent equity market volatility that is driving forex rates and the Fed will have more on its plate as it debates whether it is time to raise rates. \n\nThe point is that it is not enough to talk about the dollar in general terms. It is also not clear how much the dollar matters as Fed Vice Chairman Fischer made no mention of it in his latest speech at Jackson Hole. On the other hand, the latest minutes indicated it is in the decision making mix so while not likely to be an overriding factor, the value of the dollar should be watched ahead of the September 17 decision although it is not clear which dollar(s) the Fed is focusing on.\n\nJay Meisler, founder\n\nGlobal Traders Association", "source": "Nasdaq"}