{"published": "2015-09-01T14:16:58Z", "media-type": "Blog", "title": "'CBS Evening News With Scott Pelley' Up 6 Percent Year-to-Year in Viewers for the Week Ending August 28", "id": "cd2a488c-eb27-4cd5-875e-a712423e47f5", "content": "'CBS Evening News With Scott Pelley' Up 6 Percent Year-to-Year in Viewers for the Week Ending August 28 Categories: Network TV Press Releases\tWritten By Sara Bibel September 1st, 2015 via press release: THE “CBS EVENING NEWS WITH SCOTT PELLEY” IS UP +6% YEAR-TO-YEAR IN VIEWERS FOR THE WEEK ENDING AUGUST 28      The CBS EVENING NEWS WITH SCOTT PELLEY is up +6% year-to-year in viewers (6.50m from 6.14m), adding +360,000 viewers, according to Nielsen live plus same day ratings for the week ending August 28.               The CBS broadcast also maintained its rating in adults 25-54 (1.2/05) – the demographic most important to those who advertise in news – compared to the same week last year.               Television year-to-date, the CBS EVENING NEWS WITH SCOTT PELLEY is up +3% in viewers (7.01m from 6.79m) and even in adults 25-54 (1.4/06) compared to last year.               On last week’s broadcasts, Norah O’Donnell, Jane Pauley and Maurice DuBois substituted for Scott Pelley. Steve Hartman, Michelle Miller, Mark Strassmann, Tracy Smith and Omar Villafranca covered the 10th anniversary of Hurricane Katrina; Jeff Pegues and Kris Van Cleave reported on the live on-air killing of two Virginia journalists; Anna Werner covered the New Hampshire prep school rape trial; David Begnaud reported on Tropical Storm Erika; and Charlie D’Agata spoke with migrants from North Africa and the Middle East who risked their lives to reach Europe.               Steve Capus is the Executive Producer of the CBS EVENING NEWS WITH SCOTT PELLEY and Executive Editor of CBS News.               Follow the CBS EVENING NEWS WITH SCOTT PELLEY on Twitter,  Facebook, Google+, Instagram and on cbsnews.com.     Follow TV by the Numbers on Twitter, Facebook, Google+, Tumblr or RSS for all the latest.&nbsp Tags: CBS Evening News With Scott Pelley Ratings", "source": "TVbytheNumbers"}