{"published": "2015-09-27T05:49:23Z", "media-type": "News", "title": "A Dunne deal – Lemont football rolls over Tinley Park", "id": "d6f33f17-59c0-4ffd-8e6e-eaee1d088074", "content": "LEMONT – With the Lemont football team banged up in the backfield, Matt Dunne received his first varsity start Friday on his birthday. The Indians’ senior running back made the most of his opportunity. \n   \nRushing for 168 yards and two touchdowns, Dunne helped Lemont (4-1, 2-0) to a 41-12 victory over previously undefeated South Suburban Blue foe Tinley Park. \n\n“That was a good way to celebrate my 18th birthday,” said Dunne, who played defense a year ago. “All the credit goes to the offensive line. They really stepped up this week. \n\n“We had a lot of setbacks this week, but we had to keep our heads up. We just kept going, kept going.” \n\nDunne scored on a 70-yard run with 2:39 left in the first half, which upped Lemont’s lead to 20-6. He added a 21-yard score late in the fourth quarter on a cutback to the right. He also kicked three extra points. \n\n“On the first run, I just saw the hole and thought, ‘don’t slow down, just keep running’,” Dunne said. “On the second one, after the bounce-out, I saw the home and ran as fast as I could.” \n\nDunne was far from the only offensive star. Quarterback Spencer Nagle threw three touchdown passes in the first 24 minutes, all to Jeremy Fejedelem. Two were screens that the senior wideout turned into 46- and 19-yard touchdowns. \n\nNagle added a sneak for a touchdown and another passing TD in the second half. \n\n“The line did an awesome job and he [Nagle] threw the ball well,” Lemont coach Bret Kooi said. “I’ve kind of held the reins back because he is young. We needed to cut him loose a little bit this week and without a doubt, he stepped up.” \n\nNot to be outdone, the Indians’ defense had another strong showing against a Titans’ offense that had scored 125 points over the past two weeks. Brendan Cunningham had two interceptions and Fejedelem a pick and a sack. \n\n“Their offense is good,” Kooi said. “Between their quarterback, running backs and wide receivers, they are really explosive.” \n\nThe win capped a tough opening five-week stretch for Lemont. \n\n“Through this five-game stretch, we thought to have success we had to stay healthy,” Kooi said. “And we didn’t stay healthy. It’s a compliment to them. The kids that stepped in, stepped up. And it’s a compliment to our staff.” \nComments", "source": "The Herald News"}