{"published": "2015-09-19T13:16:24Z", "media-type": "News", "title": "Qatari Sheikh flees US after car caught on video in drag race through Beverly Hills", "id": "48258a3d-f4b3-4e48-9c83-5fd3a367732e", "content": "A Qatari sheikh has fled the US after his Ferrari was caught on video drag racing through the streets of Beverley Hills, California. A Qatari sheikh has fled the US after his Ferrari was caught on video drag racing through the streets of Beverley Hills, California. The canary yellow Ferrari LaFerrari was spotted careening through the manicured avenues of the affluent neighbourhood, neck-and-neck with a white Porsche 911 GT3 on a video posted online earlier this week.\n\nThe cars tore through stop signs and zoomed past pedestrians before pulling into a driveway of a Beverley Hills home with engines smoking.\n\nOn Thursday detectives revealed the yellow ferrari belonged to Sheikh Khalid bin Hamad al-Thani, but have not confirmed whether he was driving either the Ferrari or the Porsche.\n\nThe driver's faces are not clearly visible in the video.\n\nPolice officers who attended the residence were unable to make an arrest or issue a citation because they had not witnessed the incident, theLos Angeles Times \n\nAuthorities said they were considering charging the Sheikh al-Thani with reckless driving and other offences, but after the video of the joy ride went viral the Sheikh abruptly left the country.\n\nHis cars have also vanished, the LA Times reported.\n\nDubbed the 'patron sheikh of drag racing', al-Thani is a generous backer of Al-Anabi Racing, giving a reported $US10 million ($14 million) annually to the sport.\n\nA drag-racing team formed by al-Thani won championships in 'top fuel' — the most elite class of dragsters — in 2010, 2011 and 2013.\n\nHis official Facebook page is replete with racing videos, trackside photographs, and images of Al-Thani behind the wheel of some of the world's fastest race cars.\n\nThe al-Thani family is the ruling house of Qatar, but it is unclear whether the sheikh is a member of the royal family, according to BBC news.\n\nThe LA Times reports that authorities said al-Thani had denied he was driving the car and had attempted to invoke diplomatic immunity before he fled.\n\nBut a spokesperson for the Beverley Hills police said it was unlikely that person was protected by diplomatic immunity.\n\n\"It's against a federal law for someone to claim diplomatic immunity when they don't have it, so we're looking at that and then we're also looking at the reckless driving,\" Beverly Hills Police Chief Dominick Rivetti said during a press conference on Thursday.\n\nLocal authorities said that they may look into prosecuting those involved.\n\nChief Rivetti said al-Thani's status would not play a role in the investigation.\n\nThe law would be applied equally regardless of \"who you are, who you know or where you are from,\" he said.\n\nThe Qatari consulate has been contacted.\n\nThe Youtube video had been seen by over 1.3 million people by 4pm AEST.\n\nThe man who posted the video, Adam Bornstein, told the LA TImes that the rich Qatari visitors typically had kept a low profile.\n\n\"They've been known to come and stay in the summer with their nice cars. For the most part, they're very laid-back and mellow,\" said Mr Bornstein, a car enthusiast. The story first appeared on The Sydney Morning Herald.", "source": "Penrith Star"}