{"published": "2015-09-10T03:28:58Z", "media-type": "News", "title": "USAF needs more than 80 to 100 new bombers", "id": "045051e6-13c6-45ef-9bc5-3a403320fc8b", "content": "A former commander of the USAF’s bomber force says 80 to 100 new Long-Range Strike Bombers are not enough to meet American national security objectives, and the service should consider buying more to rejuvenate its “withering” combat fleet of Boeing B-1s and B-52s. \n\nIn his testimony to Congress 9 September, Lt Gen Robert Elder, who directed the 8th Air Force before his retirement, said the production target released by the air force is too few, even though the new aircraft will be more capable. \n\n“Our capabilities are withering and we have less than 100 combat-ready bombers with an average age of 38 years,” he told members of the House Armed Services Committee. \n\n“The newer B-52s remain potent but are few in numbers, and my belief quite frankly is the 80 to 100 aircraft is not going to be enough to replace the B-1 and B-52 fleet, even though it's capability against the target set will be greater.” \n\nHe says there needs to be more aircraft to satisfy the number of rotational commitments currently being experienced. \n\nThis view was seconded by the two other witnesses, Washington defence analysts Mark Gunzinger of the Center for Strategic and Budgetary Assessments and Rebecca Grant, president of IRIS Independent Research. The witnesses, and some members of congress, also stated the air force should speed up the procurement and beat the current 2030 full operational capability date. \n\nThe quantity and schedule concerns come as the air force prepares to award a bomber development contract to either Northrop Grumman or a Boeing-Lockheed Martin team. It also comes one week after the air force stated that the competing bomber designs are more technologically mature and deliverable than previously disclosed. \n\n\n\nNorthrop Grumman \n\nAs of this month, the air force has 158 bombers (63 B-1s, 20 B-2s and 76 B-52) which average 39 years of age, and only 96 are currently funded for combat service. Gunzinger says today’s 20-aircraft B-2 fleet can muster just 12 combat sorties on any given day, and without a sizable order of new bombers, American won’t be able to overcome the air defences of sophisticated adversaries. \n\n“If we don't buy the LRS-B, well, then the B-2 eventually will not be able to penetrate into China, into Iran, and some other areas. The B-1s and the B-52s already can't penetrate into those higher threat areas,” he explained. \n\nDuring the briefing, several lawmakers including Paul Cook and Steve Knight, who both represent aerospace hubs in California, expressed tentative support for the next-generation bomber programme, so long as it doesn’t overrun initial cost estimates was the case with the Lockheed Martin F-22, F-35 and Northrop B-2 projects. \n\n“I will support this, as long as we keep the price down and it accomplishes the mission,” says Knight, who also questioned whether it would be wiser to pursue three overlapping bomber procurement programmes than just one example designed with a 50-year operating life. He says \"flying the wings off\" a single type makes the US force less flexible to emerging threats.", "source": "Flight International"}