{"published": "2015-09-09T13:36:45Z", "media-type": "News", "title": "Larson Electronics Releases a 15 KVA Temporary Power Distribution System on Wheeled Cart", "id": "5c3e51bc-c8ea-4dfe-a2e0-2ab1e0890ebb", "content": "Longtime leader in commercial and industrial grade lighting equipment Larson Electronics has announced the release of a new portable power distribution system that converts 480 volts AC three phase electrical current to 120 volts AC and 208Y volts AC. \n \nKemp, Texas (PRWEB) September 09, 2015 \n\nThe MGL-480-15K-120-208Y-12X20-2X30 portable power distribution system from Larson Electronics provides a safe and reliable way for operators in industrial settings to tap into and utilize power sources independently of the work area. This system provides operators the ability to safely tap into and distribute 480 volts AC power from a variety of sources including generators and direct grid power. The transformer is designed to operate with 480 volts, three phase which is then stepped down to single phase 120 volts AC and three phase 208Y volts AC. Twenty feet of Type W line-in power cord is included to connect the substation to a primary 480 volt three phase power supply. The secondary current is wired to a 120/208Y, three phase 100 amp load center with main breaker for circuit protection. The 120 volt line-out protection is provided by twelve 20 amp, 125 volt, 1 pole breakers and two 30 amp, 240 volt breakers. Connection to 120/240 volt is provided by twelve 5-20 120 volt, GFCI waterproof duplex receptacles and two L6-30 240 volt twist lock receptacles with waterproof covers. The transformer and distribution assembly is mounted to a standard steel dolly cart style frame resulting in an extremely stable, durable, and mobile power distribution platform. Two rubber tires and a cart style mounting platform provide easier substation mobility, and a center point lift eye allows easy lifting with cable or chain hooks. This power distribution system is NEMA 3R rated and ideal for many indoor and outdoor applications. \n \n“This unit provides an effective power distribution system for operators performing plant turnarounds, maintenance and cleaning in hazardous areas, equipment installations and repairs, and other activities requiring an alternative to native power sources,” said Rob Bresnahan with Larsonelectronics.com. “As a manufacturer, Larson can modify these distribution systems to meet the demands of customer specifications. If this one doesn’t meet your needs, call and discuss your requirements today.” \n \nLarson Electronics carries an extensive line of LED light towers, portable power distribution systems, explosion proof lights for hazardous locations, portable work lights and industrial grade LED area lights. You can view Larson Electronics’ entire line of lighting by visiting them on the web at Larsonelectronics.com. You can also call 1-800-369-6671 to learn more or call 1-214-616-6180 for international inquiries. \n \nFor the original version on PRWeb visit: http://www.prweb.com/releases/larsonelectronics/powerdistributionpanels/prweb12948763.htm", "source": "Virtual Strategy Magazine"}