{"published": "2015-09-24T05:15:11Z", "media-type": "News", "title": "The glacial rate of change in healthcare management", "id": "ca648535-9276-4109-b122-2f17631e6d44", "content": "On some dimensions healthcare (broadly defined) is rampantly creative – a lantana of invention. On others, however, it is a petrified desert of fossilised forms.\n\nImagine this: We summon Alexander Graham Bell from the grave, transport him into an average Australian household occupied by millennials, and ask him to identify the telephone. He is stumped and then, when shown, amazed at both the technical progress and the diffusion of the technology aided by its extraordinary cost/quality efficiency.\n\nImagine this, on the other hand: We summon Florence Nightingale and take her to an Australian hospital. After an hour's in-service Florence is almost ready to clock on for a shift. She has identified the nurses' station, oriented herself to a familiar set of patient beds and nurses' duties – and has identified that familiar (still rankling), socially conveyed, demarcation between the doctors and nursing staff. Florence isn't just almost ready for work, she feels at home.\n\nHealthcare providers have innovated procedural clinical interventions, curative molecules, diagnostic capacities, treatment possibilities, and so on, but their managerial and business systems have been glacial in their rate of change and innovation, or at best sporadic and non-persistent. The mainstream of activity in the sector has not been transformed.\n\nThe fossilised business systems of healthcare are now among the most consequential barriers to valuable innovation and that industry structure militates against the achievement of the Triple Aim framework developed by the Institute for Healthcare Improvement in the US:\n\nTo unleash innovation that tackles the Triple Aim, we need to think broadly and clearly about healthcare as an economic system – a system of incentives that needs to be reoriented around consumer needs, which it currently isn't.\n\nArguably, in economic terms, today's healthcare system can be characterised as an arrangement of producer interests. In the arrangement, any number of voices are raised – all claiming the consumer or patient's interest – but the voice of the consumer or patient themselves is notably weak.\n\nThis arrangement of producer interests runs deep. We are talking about a 200-year-old (or more) process of institutionalisation – a process that has produced an imposing edifice of healthcare, buttressed by powerful elements:\n\nIn parallel, technology and managerial systems have leapt ahead, leaving the healthcare sector flailing expensively; trying to deal with chronic disease, and explosions in scientific knowledge and ageing populations using increasingly outmoded industrial, technological and managerial models.\n\nAgainst this condition, one might suggest a number of prescriptions as to how you might foster business systems innovation. Clearly, micro-economic reform approaches have much potential value to offer.\n\nIn part, the sector eluded such an approach during the major reform era due to its inherent complexity, the splayed nature of healthcare across all levels of government and across market sectors, its structural rigidities (including its connection with the rigidities of our federal system and the powerful persistence of its historical clinical configuration) and its relatively unsurveyed nature. Governments at all levels fail to generate effective, system-wide regulatory and accountability frameworks because of their incomplete and fragmented coverage together with their essential complicity in the operations of parts of the sector.\n\nIn this vein, there is much to pick up from the recent Harper review of competition policy; including the material opportunities to challenge business models in the service economy, particularly where governments are themselves participants and complicit in industry shape – including the resistant and self-forgiving configurations of the healthcare sector.\n\nThe Productivity Commissioner has this week been reiterating the ready availability of savings in the healthcare of some 20 per cent, by driving it towards levels of efficiency that it manages to achieve in some of its parts, but which it seems unable to generalise across the sector.\n\nA 20 per cent reduction in the some $150 billion that is expended annually on healthcare (by all payers) is more, at $30 billion, than any likely increase and nett reallocation of GST to healthcare is ever likely to achieve.\n\nFurther, real and extensive business model innovation (rather than just improved accountability and efficiency in the current system) could lead to even more considerable improvements in the value achieved for our health dollar.\n\nAt the very least we need to invest in public, transparent and improving systems of measurement for healthcare and its participants. Even this limited call can raise howls of protest about the complex exceptionalism of healthcare by many a complicit stakeholder. To them, I offer Galileo's insight: \"Measure what is measurable, and make measurable what is not so.\"\n\nRohan Mead, group managing director of Australian Unity Limited, is chairman of the Business Council of Australia's Healthy Australia Taskforce. This is an edited extract of a speech he gave at the Centre for Independent Studies conference on health innovation in Sydney on Tuesday night.", "source": "WA Today"}