{"published": "2015-09-18T22:00:33Z", "media-type": "News", "title": "Fall TV 2015: 'Heroes Reborn' reboots old hit", "id": "fe331ebd-0013-4543-aada-aa2e28e48a53", "content": "When: Two-hour premiere 8 p.m. Thursday. \n\nWhere: NBC. \n    \nJudi Shekoni is happy not to have to wear heels on the 13-episode miniseries “Heroes Reborn,” which is something of a sequel to the NBC sci-fi series that first aired in 2006. \n\nAt 5-foot-11, the British actress didn’t have to worry about her male co-star being too short, which is sometimes a problem for tall women in Hollywood. In “Heroes Reborn,” Shekoni plays Joanne Collins. Her husband, Luke, is played by former “Chuck” star Zachary Levi, who is 6-foot-3. \n\n“I needed a whole lot of man and I got it,” she jokes. \n  \nBut don’t think that the Collinses are “Heroes,” the ordinary people of the show’s title who have developed superpowers of one sort or another. As shown in the finale of the original series, the existence of “Evos” — as they are referred to on the new show — has been revealed to the public and since coming out in the open the Evos have been blamed for a massive terrorist attack. Already paranoid about the Evos’ existence, the world turns against them. \n\nBut the Collinses have even more of a reason to hate Evos than most people. The couple lost a son in the attack and are out for revenge. Taking up arms, they are on a mission to track down those they believe are responsible. \n  \n“They say there are seven stages of grief and Joanne got stuck on anger,” says Shekoni about her character. “She’s wonderful to play, willing to go toe-to-toe with anybody.” \n\nThe actress, who began her career as a model and split time between London and Los Angeles, says she thinks of Joanne and Luke as a mixture of “Natural Born Killers” and “Mr. and Mrs. Smith,” two movies she likes very much. \n\n“We’re very imposing looking,” she notes, referring to her and Levi, “especially with all our weapons.” \n\nThe fact that Joanne is “not really a heels kind of girl” is a nice change of pace, Shekoni observes. \n  \n“As a woman, you often have to worry about your hair, makeup and outfits,” she says. “With this it was, ‘Can I act with a gun, and can I move fast?’” \nWhere to watch... \nWhat: A 13-episode event series that reboots the original hit, 2006’s “Heroes.” \n\nWhen: Two-hour premiere 8 p.m. Thursday. \n\nWhere: NBC.", "source": "Whittier Daily News"}