{"published": "2015-09-28T20:24:00Z", "media-type": "News", "title": "Activision aims to slay rivals with 'Black Ops 3'", "id": "76707f46-64a2-48c9-8795-9dd58e56f746", "content": "P rospects for video game publisher Activision Blizzard (NASDAQ: ATVI ) are looking up for this holiday season and beyond, analysts with Cowen and Piper Jaffray said in separate notes Monday. \n\n\"Activision's pipeline refresh is going extremely well,\" Cowen analyst Doug Creutz said. \"Activision's recent and upcoming games, plus likely renewed strength from 'Call of Duty,' set the stage for meaningful top-line upside over the next few years.\" \n\nCreutz reiterated his outperform rating on Activision stock and raised his price target to 35 from 28. \n\nActivision stock fell more than 2% as part of a broad sell-off on the stock market today . \n\nPiper Jaffray analyst Michael Olson maintained his overweight rating on Activision stock and upped his price target to 36 from 33. \n\nActivision's \"Call of Duty: Black Ops 3,\" due out Nov. 6, is \"uniquely positioned\" as the only action/shooter game that will be on both Microsoft (NASDAQ: MSFT ) Xbox and Sony (NYSE: SNE ) PlayStation platforms, including current-generation and legacy consoles, Olson said. \n\n\"This could be a material positive for the 'attach rate' of the game to legacy consoles (PS3 and Xbox 360), given there will be no other action/shooter titles shipping this holiday for older consoles, except 'Rise of the Tomb Raider' (Xbox 360 only),\" Olson said. \"We estimate there will still be between 50 million to 80 million 'active' Xbox 360 and PS3 consoles in Q4, leaving a significant installed base in which to sell action/shooter titles.\" \n\nIn addition to serving the legacy consoles, Activision should benefit from the growing installed base of new consoles (Xbox One and PlayStation 4), he said. \n\nOlson estimates that 61% of \"Call of Duty: Black Ops 3\" units sold in 2015 will be for current-generation consoles. He raised his estimate for 2015 \"Black Ops 3\" sales to 20.5 million units, up from 19.5 million. \n\nThe recent launches of \"Hearthstone's Grand Tournament\" and \"Destiny: The Taken King\" will be key drivers to upside in the third quarter, Creutz said. \n\nRELATED: \n\nTime Warner, Activision betting on e-sports growth \n\nActivision Blizzard resets after hitting record high .", "source": "Investor's Business Daily"}