{"published": "2015-09-16T14:15:04Z", "media-type": "News", "title": "Global Stocks Rise Ahead of Fed Rate Decision", "id": "b762540e-a08d-4fb2-b603-242fa54aaaa6", "content": "The Dow Jones Industrial Average gained 46 points, or 0.3%, to 16648 in early trade. The S&P 500 added 0.3% and the Nasdaq Composite rose 0.2%. \n \n\r\n     The Stoxx Europe 600 was 1.5% higher, buoyed by Tuesday's rebound on Wall Street. Analysts said solid U.S. retail sales data on Tuesday helped spur the positive mood in markets, which continued into Wednesday's session. \n \n\r\n     Asian markets also rebounded from their recent declines, led by a 4.9% surge in China's Shanghai Composite Index. Hong Kong's Hang Seng climbed 2.4% and Japan's Nikkei rose 0.8%. \n \n\r\n     At a two-day policy meeting starting Wednesday, Fed officials will decide whether to raise interest rates for the first time since the financial crisis. Rock-bottom interest rates have underpinned years of rising stock markets. \n \n\r\n     Expectations that a move is imminent have faded in recent weeks. \n \n\r\n     About 46% of business and academic economists surveyed by The Wall Street Journal in the week to last Friday predicted the Fed's first rate increase would come in September. In early August, 82% of economists thought the Fed would raise rates in September. \n \n\r\n     While the U.S. economy has improved enough for the Fed to raise short-term interest rates, the central bank may hold off on such a move Thursday to make sure the slowdown in China doesn't spread further, said Diane Jaffee, a senior portfolio manager at TCW Group. \n \n\r\n     \"We're still 50-50 on whether they will raise rates\" on Thursday, she said. \n \n\r\n     The Fed considers employment and inflation as it makes monetary-policy decisions. Employment has improved since the financial crisis, but inflation has remained low, in part due to a slump in energy prices over the last year. \n \n\r\n     On Wednesday, the Labor Department said U.S. consumer prices fell in August due largely to depressed oil markets, marking the first decline since January. The consumer-price index slipped 0.1% from July, missing expectations for no change in overall prices. \n \n\r\n     Analysts and investors said trading volume remained light as the uncertainty over Thursday's announcement discourages investors from making big bets. \n \n\r\n     The rise in European equity markets is a rebound after a poor start to the week rather than a sign investors are speculating over the Fed outcome, according to Christian Stocker, equity strategist at UniCredit. \"Nobody wants to make a big decision over whether to invest or not before the Fed,\" he said. \n \n\r\n     A decision to raise interest rates on Thursday could help stock markets by sending a positive message about the economy, Mr. Stocker added. \n \n\r\n     European stocks were further boosted by deal news. Shares in SABMiller PLC rocketed almost 23% after it said it had received a takeover approach from Anheuser-Busch InBev NV, which saw its shares climb more than 7%. \n \n\r\n     For many investors, the Fed's decision can't come soon enough. \n \n\r\n     \"Markets don't like uncertainty. We end up with this short-term volatility, because people are nervous about\" the Fed decision, said Eric Verleyen, global chief investment officer at Société Générale Private Banking, in an interview late Tuesday. \n \n\r\n     U.S. and European stocks are up this week, but have been choppy over the past month. Fears over a China slowdown and uncertainty over the timing of the Fed's interest rate rise have pushed the Dow down 5.0% and the Stoxx 600 6.4% lower over the past month. Asian markets have sustained even heavier losses over that period. \n \n\r\n     In bond markets, Treasurys were roughly flat after a selloff on Tuesday. The 10-year Treasury yield was 2.279%. Yields fall as prices rise. \n \n\r\n     The euro was steady against the dollar at $1.1271. \n \n\r\n     The dollar was around 0.1% higher against Japan's yen, at Yen120.55. The yen weakened briefly after ratings company Standard & Poor's earlier cut Japan's credit ratings. \n \n\r\n     S&P said it was lowering the rating to A-plus from AA-minus because weak economic growth makes it less likely that the government can quickly improve the nation's fiscal health. \"Despite showing initial promise, we believe that the government's economic revival strategy--dubbed 'Abenomics'--will not be able to reverse this deterioration in the next two to three years,\" S&P said. \n \n\r\n     In commodities, Brent crude oil rose 1% to $49.05 a barrel. Gold was 0.5% higher at $1,108.40 a troy ounce. \n \n\r\n     Christopher Whittall and Josie Cox contributed to this article. \n \n\r\n  Write to Tommy Stubbington at tommy.stubbington@wsj.com and Saumya Vaishampayan at saumya.vaishampayan@wsj.com \n \r  \n\r\n  (END) Dow Jones Newswires \n \n\r\n  September 16, 2015 09:58 ET (13:58 GMT) \n\r\n\r\nCopyright (c) 2015 Dow Jones & Company, Inc.", "source": "Morningstar.com"}