{"published": "2015-09-23T23:11:50Z", "media-type": "News", "title": "John Lydon: I was banned from BBC for speaking out about Jimmy Savile", "id": "28471e35-d396-40e5-8a8c-33ed70af6424", "content": "Former Sex Pistols frontman John Lydon has said he is still bitter about “being banned” from BBC radio after speaking out against Jimmy Savile. \n \nLydon, better known as Johnny Rotten, has referred to an interview he did back in 1978, in which he commented that Savile was “into all sorts of seediness. We all know about it but we’re not allowed to talk about it”. \n \nHe told Piers Morgan on Life Stories: “I did my bit, I said what I had to (but they didn’t air that). I found myself banned from BBC radio for quite a while, for my contentious behaviour. They wouldn’t state this directly, there’d be other excuses.” \n (ITV) \nFormed in 1975, the Sex Pistols went on to become one of the most well-known and notorious British bands of all time. \n \nPundits credit them with inspiring the punk rock movement, and charismatic frontman Lydon became known for his raucous behaviour. \n \n“We became so big so quick that it was too earth shattering to really deal with sensibly. We had no prospects of fame and all of that and I think that shows. That’s why the quality of the Sex Pistols is still there,” he said. \n (Mathew McCarthy/AP) \nHis former band mate, Steve Jones, gave him his “Johnny Rotten” moniker, after commenting on the state of his teeth. \n   Promoted stories   \nLydon said: “Bad teeth. In my childhood, the only time I saw a toothbrush used was my dad cleaning boots. There was bits missing (in my teeth), all cracked up, I’d avoid the dentist.” \n \nThe band broke up in 1978, and Lydon went on to launch a solo career. \n \nThese days life is infinitely quieter for the former wild child, and he is married to Nora Foster, who he says is the “best person in the world I’ve ever known”. \n (ITV) \nApart from their anarchic public image and behaviour, the band also had to deal with the death of former member Sid Vicious, who died after being released on bail for the murder of his girlfriend Nancy Spungen. \n \nVicious’s death from a heroin overdose in 1979 was a fate that Lydon said was “inevitable”. \n \n“Sid was my mate and all that, but I watched him slowly destroy himself. I’ve got to be honest – it came as no surprise,” he told Morgan. “It wasn’t overwhelmingly catastrophic, he killed himself – as most people who mess about with heroin, they lose their souls way earlier, it’s just waiting for the body to keel over.” \n   \n Share article  \n   \nPiers Morgan’s Life Stories: John Lydon airs on ITV at 9pm Friday September 25.", "source": "Borehamwood Times"}