{"published": "2015-09-16T06:59:31Z", "media-type": "News", "title": "Manuel Pellegrini rues wasteful Manchester City after Juventus defeat", "id": "a16947a3-7020-46d2-93fb-5e333560307c", "content": "Manchester City were left to count the cost of wasted chances after surrendering a lead to lose their Champions League opener against Juventus. \n \r\n\t\t\r \nCity looked in control of the Group D encounter at the Etihad Stadium after taking the lead courtesy of a Giorgio Chiellini own goal just before the hour. \n\r  It was a night of missed chances for Manchester City \r \r \nBut Raheem Sterling, David Silva and Wilfried Bony were then all denied by the brilliant Gianluigi Buffon and Juve claimed a 2-1 win with fine goals from strikers Mario Mandzukic and Alvaro Morata. \n\r\n\t\t\t\r \nSterling also spurned an opportunity in the second minute while Fernandinho twice went close and Bony sliced another effort horribly wide before the break. \n\r\n\r\n\r\n\r \nManager Manuel Pellegrini admitted his side needed to be more clinical but refused to apportion blame, particularly with £49million man Sterling facing criticism for his misses. \n\nThe Chilean said: \"I expect that when we have chances we must score. The differences are very slight, especially against a strong team like Juventus. Maybe Juventus didn't create so many chances but they had a strong finish. \n\n\"I don't think this result is just because of Raheem. We controlled the game and didn't have many problems but football is like that. \n\n\"I don't think we deserved to lose. We played better than Juventus and we had three clear opportunities to score. \n\r\n\t\t\t\r \n\"Buffon made some very good saves but I think we were very unlucky. We never want to lose here at home, we never want to lose important points, but we have 15 points more to play for.\" \n\nJuve boss Massimiliano Allegri was more gushing in his praise for Buffon after a superb display from his veteran captain. \n\nThe 37-year-old's double save from Sterling and Silva soon after City had taken a controversial lead - with Chiellini claiming he had been impeded by Vincent Kompany - was particularly impressive and a key moment. \n\nAllegri said: \"Buffon pulled off many miraculous saves, particularly just after we went 1-0 down. Buffon is an extraordinary goalkeeper, perhaps the best ever in the history of football. He never fails.\" \n\r\n\t\t\t\r \nAnother critical moment came after 75 minutes, with the score at 1-1, as City skipper Kompany was forced off with a calf injury. \n\nHis replacement Nicolas Otamendi, making his City debut, was caught out and Morata curled in a brilliant winner. \n\nCity will now wait on updates on Kompany's condition ahead of Saturday's Barclays Premier League clash with West Ham. \n\nCity missed Sergio Aguero up front with their star striker limited to just six minutes off the bench due to a knee injury. \n\nPellegrini said: \"It was a risk to use him. I tried not to because if he got a kick in the same part it could take him more days to recover. Fortunately he did not have any problems and I hope he will be fit for Saturday.\" \n\r\n\t\t\t\r \n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Rye and Battle Observer"}