{"published": "2015-09-02T06:00:00Z", "media-type": "News", "title": "Pet dog spotted my cancerous tumour - now watch her surprise...", "id": "ec976fbb-a473-4783-9420-a0550e413e19", "content": "A COURAGEOUS cancer sufferer - whose tumour was discovered by her pet dog - was cheered as she accepted a marriage proposal at a surprise fundraising event in Cleethorpes. \n\nIt was a moment that Mikala Ireland and partner Matt Jones thought she would never experience after battling with cancer for nearly three years. \n\nTragically she has now been told the spread of the cancer is inoperable, but the 26-year-old has vowed to fight the illness and live every day to the full. \n\nAnd it was only discovered by chance in the first place thanks to her pet Mastif, Daisy. \n \nAlthough she had trouble with her vision in November 2012, Mikala was shocked when Daisy, just an eight-month-old puppy then, jumped on her bed as she lay resting and gently pawed at her right eye and whined. \n\nThe dog had alerted Mikala and Matt to what later turned out to be a large tumour behind her eye. \n\nAfter being rushed to Sheffield Hallamshire Hospital at 1.45am, doctors were astonished to discover such a large ocular melanoma and immediately removed the eye and tumour. \n\nMikala was told that had it not been for the surgery, she would have died. \n\nShe said: \"You hear about dogs having a sixth sense, but Daisy had saved my life. When I first got her I mothered her. She is like my shadow. She favours me more than anyone else.\" \n\nShe told how her retina had become detached. \n\nThe former Matthew Humberstone pupil continued with treatment and scans and regained her confidence to return to the karaoke stage at Cleethorpes Working Men's Club where she had so much fun in previous years, watched over by her mum, Dawn, the stewardess of the club on St Peter's Avenue. \n\nMikala, a former ticket lady at The Pier, told how, once in remission, she and Matt had wanted to start a family and she had check-ups at the gynaecology department as she was troubled with ovarian cysts too. \n\nAt the Diana, Princess Of Wales Hospital, in Grimsby, she went for an MRI scan which showed the ovarian cysts were benign. \n\nBut the scan also showed multiple lesions in her liver and bones caused by a secondary melanoma. \n\nShe had an emergency referral to Sheffield hospital and after various tests it was confirmed that she has secondary melonoma in the liver and bones and that it is inoperable. \n\n'WE DON'T KNOW HOW LONG WE HAVE GOT - BUT WE'LL MAKE THE MOST OF OUR TIME' \n\nMikala is the only child of single mum Dawn Ireland, whose customers watched Mikala grow from a child into a beautiful young woman. \n\nClub members organised a surprise fundraising event to help her with travel expenses and the costs of daily life. Scores of raffle prizes were donated by local firms. \n\nMikala was unaware of the event as she thought she was going out for a meal with Matt and her mum to The Dovedale restaurant. \n\nDawn suggested they go to the club for a quick drink before the meal. \n\nAs she walked into the working men's club, Rachel Platten's \"Fight song\" was played and cheers rang out and Mikala gave her mum a big hug, followed by lots of hugs from relatives and friends. \n\nShe said later her legs were shaking and she could not speak. \n\nMikala said: \"I thought I was going for a meal. I was gobsmacked when I walked in. I don't like being in large groups of people. There has been a lot happened in the past couple of weeks and it has been difficult to take in. I just want to get on and do normal things. I don't want to be bubble wrapped but want to go and do the things I did before.\" \n\nShe added: \"I am overwhelmed with everyone's generosity. It has not sunk in.\" \n\nBut the biggest surprise was Matt's marriage proposal. \n\nAs glasses full of champagne were shared by relatives to toast Mikala's courage, Matt silently slipped the engagement ring into her glass. \n\nMikala, unaware sipped the champagne until it was brought to her attention there was a ring in the glass. \n\nThe couple hugged and cheers again rang out. The magical moments of the evening were captured on video - watch it here . \n\nDawn said she was thrilled and emotional and pleased her own mum, Norma Jennings, 83, was able to attend the surprise engagement party. \n\n\"Mikala touches everyone's heart,\" said Dawn. \n\nShe added: \"She is a true fighter. She saw me go through my treatment with cancer when she was just five years old. She grew up strong and was a bit of a Tom Boy initially and still enjoys going to stock car racing at Skegness.\"", "source": "Grimsby Telegraph"}