{"published": "2015-09-18T00:00:00Z", "media-type": "Blog", "title": "Healthcare, Vol. 3, Pages 846-859: Assessing the Functional Status of Older Cancer Patients in an Ambulatory Care Visit", "id": "116ad0ad-c246-43b1-af19-2e6599ba3ce5", "content": "Healthcare Volume 3, Issue 3 Article Versions Abstract Full-Text HTML Full-Text PDF [107 KB] Full-Text XML Article Versions Notes Related Info Google Scholar Order Reprints More by Authors [+] on DOAJ Overcash, J [+] on Google Scholar Overcash, J [+] on PubMed Overcash, J Open AccessThis article isfreely availablere-usable Healthcare 2015, 3(3), 846-859; doi:10.3390/healthcare3030846 (registering DOI) Review Assessing the Functional Status of Older Cancer Patients in an Ambulatory Care Visit Janine Overcash\nCollege of Nursing, the Ohio State University, 1585 Neil Avenue, Columbus, OH 43220, USA Received: 29 June 2015 / Revised: 26 August 2015 / Accepted: 10 September 2015 / Published: 18 September 2015 (This article belongs to the Special Issue Nursing Care of the Older Adult) View Full-Text   |  \tDownload PDF [107 KB, uploaded 18 September 2015] No Abstract Functional status assessment is a useful and essential component of the complete history and physical exam of the older patient diagnosed with cancer. Functional status is the ability to conduct activities that are necessary for independence and more executive activities, such as money management, cooking, and transportation. Assessment of functional status creates a portal into interpreting the health of in older persons. Understanding limitations and physical abilities can help in developing cancer treatment strategies, patient/family teaching needs, and in-home services that enhance patient/family care. This article will review the benefits of functional assessment, instruments that can be used during an ambulatory care visit, and interventions that can address potential limitations. Keywords: comprehensive geriatric assessment; functional status; geriatrics\tcomprehensive geriatric assessment;\tfunctional status;\tgeriatrics This is an open access article distributed under the Creative Commons Attribution License which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited. Share & Cite This Article Further Mendeley | CiteULike Export to BibTeX | EndNote MDPI and ACS Style\tOvercash, J.\tAssessing the Functional Status of Older Cancer Patients in an Ambulatory Care Visit. Healthcare 2015, 3, 846-859. View more citation formats\tAMA Style\nOvercash J. Assessing the Functional Status of Older Cancer Patients in an Ambulatory Care Visit. Healthcare. 2015; 3(3):846-859. Chicago/Turabian Style\nOvercash, Janine.\t2015. \"Assessing the Functional Status of Older Cancer Patients in an Ambulatory Care Visit.\" Healthcare 3, no. 3: 846-859. Find Other Styles\nArticle Metrics Article metric data becomes available approximately 24 hours after publication online. Comments Cited By No\n[Return to top] Healthcare EISSN 2227-9032 Published by MDPI AG, Basel, Switzerland RSS E-Mail Table of Contents Alert", "source": "MDPI Publishing"}