{"published": "2015-09-15T19:03:48Z", "media-type": "News", "title": "Kenya Power renews bills payment pact with Uchumi stores", "id": "5783d541-1c17-44bb-b506-c6dfa451f255", "content": "Kenya Power has renewed its bill payments service with Uchumi Supermarkets, four months after suspending the partnership over what it claimed were delays in remitting cash paid in by electricity users. \n\nThe electricity distributor Tuesday said that renewal of the deal came after both parties entered into a payment pact for outstanding and future amounts.\n\nThe Nairobi Securities Exchange-listed retailer on Monday announced that it had in an ongoing bid to woo back suppliers and its business partners as part of its overall recovery plan.\n\n“We had an issue with the former management of Uchumi Supermarkets over failure to submit payments made at its outlets by our customers.\n\nWe have resumed operations at Uchumi after the new management made an application to us and we are happy to be business partners again,” said the Kenya Power chief executive Ben Chumo in an interview.\n\n“We trust the new management and I have no doubt that going forward we will keep supporting Uchumi for the benefit of the country and shareholders,” added Mr Chumo.\n\nHe declined, however, to disclose how much money Uchumi owes Kenya Power. \n\nUnder the partnership, the retailer earns a commission for electricity payments made at its outlets. Uchumi currently has 26 branches in Kenya.\n\nKenya Power has been signing on main retailers including mobile service provider firms, among them Safaricom and Airtel to tap into the huge traffic of shoppers who frequent supermarkets, mostly in urban areas.\n\nIn May Kenya Power said it would be spending Sh500 million to set up a premium customer care lounge at its Nairobi headquarters targeting corporate clients who contribute to the bulk of its revenue. \n\nThe move is aimed at attracting new members to the new premium club where beneficiaries have access to specialised lines to call in case of a power blackout or emergency.\n\nEmpty shelves\n\nUchumi Supermarkets’ management is striving to rebrand the retailer and regain credibility from shoppers who were frustrated by empty shelves and poor customer service. \n\nThe retailer says its shelves are now about 80 per cent stocked and is seeking to win back more suppliers who had severed links due to non-payment for deliveries.\n\nThe retailer has already hired a new team among them Julius Kipng’etich as its new chief executive and Willy Kimani as the chief operations officer.\n\nUchumi has also started renovating its hypermarkets in Nairobi, with the exercise expected to end in November. It also plans to close down non-performing branches once the evaluation of all its branches across the region is complete.", "source": "Business Daily Africa"}