{"published": "2015-09-08T05:58:03Z", "media-type": "News", "title": "China marks Tibet anniversary with rallying cry against Dalai Lama", "id": "fb4ea495-b7e1-4a02-ab58-3f16e3c8260f", "content": "12:58 a.m. CDT \n \nBEIJING (Reuters) - China celebrated the 50th anniversary of the founding of the Tibet Autonomous Region on the roof of the world on Tuesday with a rallying cry against its exiled spiritual leader, the Dalai Lama. \n \nYu Zhengsheng, in charge of religious groups and ethnic minorities and number four in the ruling Communist Party, stressed the official line that the Dalai Lama, who fled China in 1959 after an abortive uprising against Chinese rule, is a violent separatist. \n \nThe Dalai Lama, who is based in India, says he is merely seeking greater autonomy for his Himalayan homeland. \n \n\"People of all ethnicities are steadfastly engaged in a struggle against separatism, continuously thwarting the Dalai clique and foreign hostile forces' splittist and sabotage activities,\" Yu said in front of Lhasa's grand Potala Palace, once the home of the Dalai Lama and, flanked by mountains under a bright blue sky, the highest palace in the world. \n \nYu, who led the central government's delegation to the region, spoke to officials, Tibetans dressed in ethnic costumes and students waving Chinese flags. \n \nA procession of gaudy floats celebrating the achievements of the Communist Party and others that showed famous Tibet landmarks such as the Potala Palace paraded down the street after the speeches. \n \nOn Monday, Yu urged army, police and judicial staff in Tibet to be ready to \"fight a protracted battle against the clique of the 14th Dalai Lama\", state news agency Xinhua reported. \n \nState media used the anniversary to launch attacks on the Dalai Lama. \n \nThe Global Times, a nationalist tabloid owned by the ruling Communist Party's official newspaper the People's Daily, called the Nobel Peace Prize Laureate a \"cheater\" and a \"cruel ruler in exile\". \n \nThis year marks several sensitive anniversaries for the remote region that China has ruled with an iron fist since 1950, when Communist troops marched in and took control in what Beijing calls a \"peaceful liberation\". \n \nIt also marked the 80th birthday of the Dalai Lama and the 20th anniversary of the disappearance of a young Tibetan who was chosen by the Dalai Lama as the second-highest figure in Tibetan Buddhism. \n \nOn Sunday, a senior Chinese official said the young man, six years old when he disappeared, was \"living a normal life\". \n \nOn Monday, rights group Free Tibet denounced the celebrations, saying they \"may be dressed up in 21st century PR but they belong in the era of Mao\", referring to the founder of modern China, Mao Zedong. \n \nTibet remains under heavy security, with visits by foreign media tightly restricted, making an independent assessment of the situation difficult. \n \n(Reporting by Sui-Lee Wee; Editing by Nick Macfie)", "source": "1440 WNFL"}