{"published": "2015-09-16T12:56:49Z", "media-type": "News", "title": "Marvell and Leading European Telecom Provider Swisscom Expand Collaboration to Launch Ultra HD Android Set-Top Boxes", "id": "45fcc92a-af4a-49ab-a410-fd7d10fead44", "content": "Company News: Page (1) of 1 - 09/16/15     print\n\t    \tpage      Swisscom deploys Ultra HD services in Europe powered by Marvell's innovative ARMADA 1500 Ultra and Avastar 88W8897 Platform solution   (September 16, 2015)  \nSANTA CLARA, Calif. , Sept. 16, 2015 /PRNewswire/ -- Marvell (NASDAQ:MRVL) a worldwide leader in providing complete silicon solutions from mobile communications to storage, Internet of Things (IoT), cloud infrastructure, digital entertainment, in-home content delivery and Kinoma software enabling the \"Smart Life and Smart Lifestyle\" today expanded its partnership with Swisscom, a leading European telecom provider, to launch a new line of Ultra HD (UHD) Android IPTV set-top boxes (STBs) powered by Marvell's ARMADA 1500 Ultra (88DE3218) system-on-chip (SoC) platform. The platform includes Marvell's proven Avastar 88W8897 2x2 Wi-Fi processor delivering carrier grade video services. Marvell's ARMADA 1500 Ultra cost-effectively delivers feature-rich UHD entertainment and gaming services to Swisscom's subscribers. This UHD partnership builds upon the successful launch and market acceptance of Swisscom TV 2.0 in 2014 . \n  \n\"Marvell provides innovative technologies that enable service providers to introduce new business models and revenue generating services with uncompromised image quality at an affordable cost,\" said Weili Dai , President and Co-Founder at Marvell. \"I am proud of our continued collaboration with Swisscom and other leading telecom providers to bring high quality, immersive entertainment experiences to consumers.\" \n \n\"Marvell's ARMADA 1500 Ultra enables Swisscom's UHD STB to deliver high-performance UHD entertainment and gaming services to our subscribers in a low power, cost-effective, small form factor,\" said Peter Fregelius, Head of TV Development and Technology. \"We are excited to continue our strong collaboration with Marvell to now deliver compelling UHD entertainment experiences to our customers with features like unlimited CatchUp TV, blazing channel change speeds and seamless connectivity.\" \n\n \nThe ARMADA 1500 Ultra offers a complete platform solution, providing support for video SoCs, Wi-Fi and IoT services. Marvell's leading video processing IP includes an enhanced Qdeo Video Processor that addresses the Ultra HD content services being launched by PayTV operators for an immersive TV experience. With its quad-core Cortex A53 ARMv8 64-bit CPU and 51 GFLOP GPU, the ARMADA 1500 Ultra's innovative architecture combines impressive processing power in an incredibly small package, which is four times smaller than other SoCs on the market, enabling powerful and aesthetically appealing compact STB designs. Marvell's platform also features a sophisticated security processor supporting leading revenue security solutions from Verimatrix to meet the strict standards of service operators and content partners, building on Marvell's legacy of supporting the first Android STB with conditional access systems (CAS). \n \n\"Our collaboration with Marvell is enabling operators like Swisscom to launch some of the first next-generation UHD services that ensure compliance with UHD premium service delivery requirements,\" said Petr Peterka , CTO at Verimatrix. \"The ARMADA 1500 Ultra platform integrated with VCAS Ultra offers an enhanced content security profile using fully integrated VideoMark watermarking technology, as well as Trusted Execution Environment (TEE) support on the Android TV platform.\" \n \nKey features of the ARMADA 1500 Ultra HD SoC include: \n 2160p60 10 bit HEVC & VP9 Video Decode, 1080p PiP and transcoding with patented scaling techniques for best-in-class video experience  Up to 14K DMIPs (1.5 GHz) Quad Core Cortex-A53 ARMv8 64-bit CPU allows operators to deploy rich media/web-based TV applications and Android TV services for an enhanced viewing experience. The Cortex-A53 is future proofed for the 64-bit software roadmap  8 core GPU, 8 shader Vivante GC7000XS with hardware tessellation and geometry shaders optimized for the Android gaming ecosystem  Robust security engine, trusted rendering path with TrustZone, and hardware support for video watermarking technologies such as Verimatrix VideoMark and Civolution NexGuard  Strong portfolio of SDKs including Android TV and RDK enables service providers to quickly deploy a wider library of content and applications across all screens. Marvell SDKs have been proven in multiple generations of Android set-top boxes deployed since 2012  Marvell's advanced Wi-Fi and Bluetooth solutions, the Avastar 88W8897 (2x2 11ac) and 88W8864 (4x4 11ac) \nKey features of the Swisscom TV 2.0 UHD Android Set-top box: \n Support for the latest video resolutions with UltraHD content for Live and VoD  Powerful user interface for an intuitive user experience  Seven day replay Guide for all channels  Streamed Gaming  Voice enabled Search  App Store   Ultra small STB Size of 105 x 105 x 30 mm  Fully supporting CoC v9 Tier 2 requirements  Blazing channel change times \nAbout Marvell \nMarvell (NASDAQ: MRVL) is a global leader in providing complete silicon solutions and Kinoma software enabling the \"Smart Life and Smart Lifestyle.\" From mobile communications to storage, Internet of Things (IoT), cloud infrastructure, digital entertainment and in-home content delivery, Marvell's diverse product portfolio aligns complete platform designs with industry-leading performance, security, reliability and efficiency. At the core of the world's most powerful consumer, network and enterprise systems, Marvell empowers partners and their customers to always stand at the forefront of innovation, performance and mass appeal. By providing people around the world with mobility and ease of access to services adding value to their social, private and work lives, Marvell is committed to enhancing the human experience. \n \nAs used in this release, the term \"Marvell\" refers to Marvell Technology Group Ltd. and its subsidiaries. For more information, please visit www.Marvell.com . \n \nMarvell, the M logo, Avastar, Qdeo, ARMADA and Kinoma are registered trademarks of Marvell and/or its affiliates. Other names and brands may be claimed as the property of others. \n \nFor Further Information Contact: \nMarvell Media Relations \n \nSue Kim  \nDirector, Corporate Communications & PR \n408.222.1942 \nsuekim@marvell.com  \n \n \n \n \n \nPhoto - http://photos.prnewswire.com/prnh/20150916/267047 \n \nPhoto - http://photos.prnewswire.com/prnh/20150916/267048  \n \nLogo - http://photos.prnewswire.com/prnh/20100719/SF36559LOGO-b \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/marvell-and-leading-european-telecom-provider-swisscom-expand-collaboration-to-launch-ultra-hd-android-set-top-boxes-300143897.html \n \nSOURCE  Marvell \n  \nCopyright 2014 PR Newswire.  All Rights Reserved \n\nPage: 1  \n \nRelated Keywords: Internet/Web, Prosumer/Consumer, Business, Internet, Search, Phone OS, Gaming, Settop Box, VOD, Standards/Initiatives, Broadcast Technology, DTV, HDTV, Hardware, Software, IPTV, Workstation/CPU, Video, Android, Television, Lifestyle, Communications Technology, Internet Technology, Business, Entertainment, \n\nSource:PR Newswire.\n All Rights Reserved", "source": "Media Workstation"}