{"published": "2015-09-27T04:00:00Z", "media-type": "News", "title": "Bowhunters often overlook final details", "id": "51c6a6b9-ef5a-4b30-90ac-f10dc6989ecc", "content": "Indoor leagues, 3-D courses and backyard targets have consumed months of spare time for bowhunters, who today begin the final six-day countdown to the Oct. 3 opening of Pennsylvania’s statewide archery deer season. \n \n\r\n\tBy now, treestands are in place, decisions on broadheads and shafts have been finalized and optics are sighted in and fine-tuned. \n \n\r\n\tOh, yes, there has also — in most cases — been hours of scouting either in person or reviewing photos and videos from trail cameras. \n \n\r\n\tWith all of that, there is nothing that should go wrong when bowhunters climb their stands or get into their blinds in the predawn darkness Saturday. Well, not exactly. \n \n\r\n\tOne of the most overlooked details by bowhunters when going afield is that although they have spent hours of practice time they may have done so in cutoffs and their favorite Ted Nugent T-shirt. \n \n\r\n\tTake time this final week of the preseason to shoot a few practice rounds wearing the hunting clothing that will be worn opening day. \n \n\r\n\tEven lightweight clothing can produce a different point of aim, and factors such as a baggy sleeve, an open pocket flap and draw strings on a hoodie can interfere with the flight of an arrow. \n \n\r\n\tHunters should also resist the temptation of wearing or hanging binoculars around their neck — as well as rangefinders and grunt tubes — unless they have done so during practice sessions. \n \n\r\n\tFar and away the most important detail is to make a “dry run” with a climbing treestand if for no other reason than one of safety. \n \n\r\n\tFumbling, bumbling and stumbling in the dark is frustrating when attempting to ascend a tree — quietly — in the darkness, but an overlooked unbuckled strap or lose bolt that causes a screw to be lost are dangerous situations that can result in serious injury. \n \n\r\n\tAnother detail so far as treestands and blinds are concerned is that this year, for the first time, the Pennsylvania Game Commission requires those that remain in place on State Game Lands and State Forest Lands and they also be tagged to identify the owner. \n \n\r\n\tStands and blinds must be removed no later than two weeks after the close of the late deer seasons in January. \n \n\r\n\tTwo final details are to make sure cellular telephone batteries are fully charged and a full-body harness or restraint system is packed if hunting from a treestand. \n \n\r\n\tCell phones can literally make the difference of life or death in the case of an emergency, and the use of a restraint system can prevent injury or death. \n \n\r\n\t  \n \n\r Doyle Dietz  covers the outdoors for the Pottsville Republican-Herald.", "source": "Citizens Voice"}