{"published": "2015-09-16T11:20:44Z", "media-type": "Blog", "title": "'Another World' Actress Jennifer Lien Arrested for Indecent Exposure", "id": "98895f66-c865-4db3-996b-392ad7558750", "content": "Left: Jennifer Lien on Another World. Roger: Lien's mugshot from the\nRoane County Police Department. Former Another World actress Jennifer Lien was arrested and has been in custody for two weeks after allegedly exposing herself in front of several children, Roane County police confirm.\nLien has been charged with two misdemeanor counts of indecent exposure in an incident that happened on August 31 in Harriman, Tennessee.\nA neighbor of Lien’s made a complaint to police after Lien began a tirade due to a crying child, and during her tirade, exposed her breasts and buttocks. The neighbor stated that she had three children in the yard while this was happening.\nAccording to a Roane County Sheriff’s Office report, when police appeared on September 3 with a warrant, Lien was not wearing clothes and resisted arrest.\n“The offender stated she wasn’t going any f–king where and we needed to leave her alone,” reads the police report by responding officer Billy Walker.\nLien also threatened to have the officers shot and killed, says the police report. She was transported to the patrol car and taken to the Roane County Jail, and is scheduled to appear in court on December 7.\nLien played Hannah Moore on Another World in 1991 to 1992. She later starred on Star Trek: Voyager from 1995 to 2000 as Kes. Her other credits include American History X, Accidents Don’t Happen, Men in Black: The Series, Battle Force: Andromeda and voice work in Lion King 2: Simba’s Pride.\nLien had another run-in with the law earlier this year. In April, she was arrested and charged with evading arrest, resisting arrest, reckless endangerment and aggravated assault.\nBelow, watch one of Lien's early Another World episodes, which aired July 15, 1991. Paulina Cory (Cali Timmons) finally comes face to face with the young woman who has been using her name, Hannah Moore (Lien).", "source": "We Love Soaps"}