{"published": "2015-09-10T06:00:00Z", "media-type": "News", "title": "Catherine Fox", "id": "458eacf9-0fea-479e-9b00-fdc7de88b5d5", "content": "Miss Catherine Ann “Cathy” Fox, 56, of Arbutus, Maryland, died suddenly Sunday, September 6, 2015, at Mercy Medical Hospital in Baltimore. \n  \nShe was the daughter of Suzanne K. (Gilbert) Fox of Frederick and the late Thomas M. Fox Sr. \n \nBorn December 25, 1958, she had the distinction of being the first Christmas baby born at Providence Hospital in Washington, D.C., in 1958. \n \nShe was a 1976 graduate of Frederick High School, and graduated from The Medical College of Virginia University in Richmond, VA, in 1983 with a B.S. in Occupational Therapy. \n \nShe received her Masters of Science Degree in 1989 from Johns Hopkins Medical University in Baltimore. \n \nShe was a nationally recognized Occupational Therapist /Pediatric Feeding Specialist for the last eleven years as the Clinical Coordinator of Occupational Therapy at Children’s National Medical Center in Washington, D.C. She was highly sought as a speaker on dysphagia and with her help, programs were established in pediatric hospitals and rehabilitation centers in Baltimore, MD, Iowa City, IA, Philadelphia, PA and Omaha, NE. At the time of her death, she was involved in developing and operating several major neonatal feeding programs for infants and children across the United States. \n \nShe had written extensively on a variety of topics in her specialty areas. \n \nCathy is survived by her mother, Suzanne; an older brother, Thomas M. Fox Jr. and his wife, Claudine Lanoix, of Montreal, Quebec; and sister, Margaret R. Fox-Zeigler and her husband, Mark C. Zeigler, of Kearneysville, WV. She is also survived by ten nephews and nieces: Tiffany Nadeau of Montreal, Quebec, Steven Fox of Nashville, TN, Justin Nadeau of Montreal, Quebec, Austin Fox of Dothan, AL, Kayla (Fox) Dauphin of Dothan, AL, Eric Nadeau of Montreal, Quebec, Mathieu Nadeau of Montreal, Quebec, Michel Nadeau of Montreal, Quebec, Gracie Zeigler of Kearneysville, WV, and Jacob Zeigler of Kearneysville, WV; plus one great- nephew, Bennett Trottier of Montreal, Quebec. \n \nShe also leaves her three best four-legged friends, her cocker spaniels, Winston and Oliver, and her four legged “brother” golden retriever, Cody. \n \nThe family will receive friends from 6 to 9 p.m. on Friday, September 11, 2015, at the Keeney and Basford Funeral Home, 106 E. Church St., Frederick. \n \nMemorial service will be held at 1 p.m. on Saturday, September 12, 2015, at the funeral home. \n \nThe Rev. John Unger will officiate. \n \nInterment will be private. \n \nIn lieu of flowers, memorial contributions may be made to the Catherine A. Fox Memorial Therapeutic Fund for children with Special Needs in care of M&T Bank. \n \nOnline guestbook available at keeneybasford.com .", "source": "Frederick News-Post"}