{"published": "2015-09-16T18:50:08Z", "media-type": "News", "title": "Michelin Offers Tires, Management Solutions", "id": "74d7da7e-9f15-4f1e-82a9-a3130a21179a", "content": "Details \n\nMichelin Earthmover has introduced a loader tire designed with improved casing protection, a reinforced casing ply and Michelin’s patented reinforced bead zone. \n\nThe new Michelin XTXL E4/L4 tire offers operators several key performance benefits: \n\n10 percent improved tire life. \n\n15 percent increase in load-carrying capacity. \n\nUp to 20 percent more torque from the wheel to the ground through the rim interface compared to its predecessor, the Michelin XLD D1 tire. \n\nUp to 20 percent decrease in out-of-service tires is possible due to an enhanced puncture-resistant crown and 10 percent stronger sidewalls. \n\nThe Michelin XLD D1 tire is being replaced with the 26.5R25 XTXL E4/L4, 29.5R25 XTXL E4/L4 and 35/65R33 XTXL E4/L4. \n\n“New generations of more powerful loader models are the new normal on many construction and quarry sites,” said Jamey Fish, director of earthmover marketing for Michelin North America. “This tire enables operators to maximize their operating time and face their productivity challenges head-on. And longer tire life is better for the environment with fewer raw materials being used and fewer tires to be recycled.” \n\nThe XTXL E4/L4 is equipped with Michelin’s patented B2 technology, which reduces rim slip thanks to a new flat bead wire, which strengthens the clamping force on the wheel and increases its contact surface with the rim, compared to the previous-generation Michelin XLD D1 tire. \n\nThe tire also benefits from more solid steel cables, increased metal mass, thicker sidewalls and a new steel belt offering increased protection against punctures in the tread area. It has a greater load capacity of nearly 36 tons for the 35/65R33 tire size, than the previous generation Michelin XLD D1, thanks to its cable-reinforced carcass. \n\nThe shoulder design helps the tire to cool more quickly, while the central zone and its large, beefy lugs are cut resistant to improve both damage resistance and traction capability. Wide grooves and channels provide traction and grip on graded and loose ground conditions. \n\nMEMS Evolution 3 \n\nMichelin Earthmover has also introduced MEMS Evolution3, the popular Michelin Earthmover Management System that provides mining operations managers with advanced, real-time data about tire temperature and pressure conditions. Originally launched in 2006, MEMS is the most widely used tire-monitoring system in the world. It can be found today in more than 1,400 rigid dump trucks in nine countries and in 35 mines around the world, increasing the effective running time of surface-mine trucks. \n\nUsing the latest-generation tire pressure monitoring system (TPMS) sensor and new, improved system software, MEMS Evolution3 enables mine operators to increase safety, extend tire life, increase utilization time, reduce costs and increase mine productivity while working under the most difficult and demanding industrial conditions. MEMS Evolution3 sends critical tire-related data and alerts to operators via various communication channel options. With MEMS Evoloution3, downtime can be anticipated and avoided through detection of slow pressure losses. An inflation monitor compensates tire-pressure limits for ambient temperature; so when tire temperatures change, operators can know immediately if there is an alert and change routes. Maintenance operations can be anticipated. \n\n“Equipment worth millions of dollars that carries hundreds of tons of material on steep slopes and rugged terrain needs to ride on safe and reliable tires,” said Jamey Fish, director of earthmover marketing for Michelin North America. “MEMS Evolution3 provides immediate operational gains and anticipates tire issues for surface mine operators.” \n\nThe MEMS Evolution3 provides the following benefits: \n\nImproved, liquid-proof sensors report data throughout entire tire life to improve mine performance. \n\nTwo patented sensor models available: conventional sensors and sensors for liquid-filled tires, isolated in a capsule filled with inert liquid. \n\nReal-time data recording, allowing reactive monitoring of alarms. \n\nConnection and data transfer via Ethernet or 3G with information stored in the cloud. \n\nSending of multichannel real-time alerts online, via email or SMS. \n\nEasy-to-use, advanced reporting capabilities monitor tire metrics. \n\nMEMS Evolution3 is available for rigid dump trucks using tires with diameters 49 in. and greater, up to 12 tires per vehicle. Michelin XDR2 and Michelin XDR250 tires are pre-equipped for MEMS Evolution3 with a factory integrated patch allowing the rapid installation of MEMS sensors in tires without liquid. \n\nMichelin, www.michelinman.com \n\nTags:  Michelin  Michelin Earthmover  loader tire  Michelin XTXL E4/L4", "source": "Rock Products"}