{"published": "2015-09-10T15:14:12Z", "media-type": "News", "title": "VIDEO: Man steals puppy through fence", "id": "02a5c783-093d-4aa0-b014-6b80c9486d07", "content": "In the video, the man is seen approaching the fence with a bag in his hand. He kneels down and lures the three dogs on the premises to the fence,  Brakpan Herald  reported. \n \nClick here to watch the video. \n \nShortly afterwards, he grabs the puppy named Angel, pulls him through the fence and places the puppy in the bag before casually walking away. \n \nWhen the the dog owner, Teresa Ajudia, checked the footage, she was horrified to see how the suspect stole their puppy. She then took to social media in an effort to trace the man. \n \nShe reportedly received a call from a person who gave her a tip-off on who to phone. After she had tried many times, someone apparently answered on the other end and told her where to go. \n \nOn Sunday morning, Teresa arrived at the address with a security company and saw the man who had taken Angel from her yard. \n \nShe confronted him and managed to grab Angel. \n \nA woman at the house brought a collar to Ajudia and asked her if it was her dog’s collar. \n \n“I looked at the collar and immediately recognised it,” Ajudia said. \n \n“She then showed me to a room and opened the door just a little bit. I couldn’t see clearly what was going on inside that room, but Angel wasn’t the only dog there. After I called his name and hoped he would respond, I felt his soft fur against my hand and immediately took him from that dark room. I don’t know what’s going on there or what they’re doing to these dogs, but they all seemed like family pets that didn’t belong there,” she added. \n \nTeresa took Angel to a veterinarian, who said Angel had picked up cat flu and is going through a lot of stress at the moment. \n \nThis incident was reported at the Brakpan Police Station. \n \n– Caxton News Service \n \nRead original story on brakpanherald.co.za", "source": "Roodepoort Record"}