{"published": "2015-09-16T13:15:14Z", "media-type": "News", "title": "Financial Report Card At a Glance- Report on Cumulus Media", "id": "1c6b5b36-5bfa-4ffa-bd40-5928f36c77c9", "content": "/PRNewswire/ -- \n \nACI Association has initiated research coverage on Cumulus Media Inc . (NASDAQ: CMLS). Select highlights from the internally released reports are being made available to the general public (included below), with access to the entirety of the research available to new members. \n \nToday, membership is open to readers on a complementary basis at the following URL: http://www.aciassociation.com/reports?keyword=CMLS \n \nHighlights from our CMLS Report include: \n Second Quarter Results - On July 30, 2015, Cumulus Media Inc., announced its financial results for the second quarter and first half of 2015. The Company reported net revenues of $299.3 million in Q2 2015, reflecting a decrease of 8.8% from $328.2 million reported in the Q2 2014. Operating income was recorded at $48.0 million, down by 17.8% YoY. Moreover, net income for the period amounted to $12.3 million as against $15.1 million in previous year quarter. In addition, diluted earnings was recorded at $0.05, compared to $0.06 in the prior year quarter. Further, adjusted EBITDA declined 19.6%, from $100.5 million in Q2 2014 to $80.8 million in Q2 2015. \r \nSegmental Performance at Glance - The Company's broadcast advertising segment generated net revenue of $275.8 million in Q2 2015, versus $301.0 million in previous year quarter. The Company added that the decrease resulted from decline of 3.9%, 10.8% and 16.0% YoY in revenue, from local, national and network sources, respectively. In addition, digital advertising segment reported revenue of $10.4 million, down by 19.5% YoY. Further, net revenue from political advertising segment amounted to $1.4 million, lower than $3.8 million reported in same period last year. On the other hand, revenue from license fees & other segment came at $11.7 million, up by 11.5% from $10.5 million in prior year quarter. \r \nYear-to-D ate Financial Highlights - In first six months of 2015, the Company reported net revenues of $570.4 million, reflecting a decrease of 8.0% from $620.3 million reported in the first half of 2014. Cumulus Media noted that the decrease in net revenue resulted from decline of $44.1 million, $4.1 million, and $3.9 million in revenue from broadcasting advertising, digital advertising, and political advertising, respectively. In addition, net income for H1 2015 amounted to $0.3 million as against net income of $5.9 million in previous year period. Further, adjusted EBITDA declined 21.2%, from $159.3 million in prior year period to $125.5 million in first half of 2015. \r \nBalance Sheet Position - The Company's total assets as of June 30, 2015, amounted to $3.70 billion compared to $3.74 billion as of December 31, 2014. Cash and cash equivalent increased from $7.3 million as on December 31, 2014, to $32.7 million as on June 30, 2015. Further, total liabilities as at June 30, 2015, were at $3.16 billion, against $3.20 billion as at December 31, 2014. \r \nTo find out how this influences our rating on Cumulus Media Inc., Limited read the full report in its entirety here: http://www.aciassociation.com/reports?keyword=CMLS \n \n-- \n \nAbout ACI Association:   \n \nActive Charter Investors Association (\"ACI Association\") produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. ACI Association has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below. \n \nACI Association has not been compensated; directly or indirectly; for producing or publishing this document. \n \nPRESS RELEASE PROCEDURES:   \n \nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third party research service company (the \"Reviewer\"). Rohit Tuli, a CFA™ charter holder (the \"Sponsor\"), provides necessary guidance in preparing the document templates. The Reviewer has reviewed and revised the content, as necessary, based on sound investment judgment and publicly available information which is believed to be reliable. The Reviewer and the Sponsor have not performed any independent investigations or forensic audits to validate the information herein. Unless otherwise noted, any content outside of this document has no association with the Author, the Reviewer, or the Sponsor (collectively referred to as the \"Production Team\") in any way. The Production Team is compensated on a fixed monthly basis and do not hold any positions of interest in any of the securities mentioned herein.    \n \nNO WARRANTY   \n \nACI Association, the Author, the Reviewer and the Sponsor (collectively referred to as the \"Publishers\") are not responsible for any error which may be occasioned at the time of printing of this document or any error, mistake or shortcoming. No liability is accepted by the Publishers whatsoever for any direct, indirect or consequential loss arising from the use of this document. The Publishers expressly disclaim any fiduciary responsibility or liability for any consequences, financial or otherwise arising from any reliance placed on the information in this document. Additionally, the Publishers do not (1) guarantee the accuracy, timeliness, completeness or correct sequencing of the information, or (2) warrant any results from use of the information. The included information is subject to change without notice. \n \nNOT AN OFFERING   \n \nThis document is not intended as an offering, recommendation, or a solicitation of an offer to buy or sell the securities mentioned or discussed, and is to be used for informational purposes only. Please read all associated disclosures and disclaimers in full before investing. Neither ACI Association nor any party affiliated with us is a registered investment adviser or broker-dealer with any agency or in any jurisdiction whatsoever. To download our report(s), read our disclosures, or for more information, visit http://www.aciassociation.com/ . \n \nRESTRICTIONS   \n \nACI Association is not available to residents of Belarus, Cuba, Canada, Iran, North Korea, Sudan, Syria or Somalia. Do not send email to robottrap (at) aciassociation.com. \n \nCFA™ and Chartered Financial Analyst™ are registered trademarks owned by CFA Institute. \n \nSOURCE www.aciassociation.com", "source": "Bloomberg"}