{"published": "2015-09-13T11:53:48Z", "media-type": "News", "title": "Double woe for Jamie Murray after US Open final defeat", "id": "0f2f837c-bf29-4312-98c2-7fdb593228cf", "content": "Britain's Jamie Murray endured doubles heartbreak again as he and Australian partner John Peers lost their second consecutive grand slam final at the US Open. \n\nMurray and Peers were runners-up at Wimbledon in July and the duo fell at the final hurdle in New York too, as French pair Nicolas Mahut and Pierre-Hugues Herbert won 6-4 6-4 to lift the title. Placed 15th in the doubles rankings, Murray won the mixed crown at Wimbledon in 2007 but Andy's older sibling is yet to add a men's doubles trophy to the family cabinet. \n\n\"I'm starting to know what Andy felt like for a long time,\" Jamie Murray said. \n \n\"We've had a great year to play at the Wimbledon final and to come here again. We're very fortunate to have done that. \n \n\"We'll keep trying to get over the line and get that grand slam title.\" \n \nMahut and Herbert were slick around the net and more clinical when the opportunities arose, as one break at the end of each set was enough to seal victory in one hour and nine minutes. \n \n\"I am speechless now,\" Mahut said. \"We have been working so hard for so many years to win this kind of tournament. \n \n\"We lost in the final and I had another loss two years ago. We said today, 'let's go for it' and we played great. \n \n\"Pierre played great in the last game. I have never seen anyone play like that in a doubles match - unbelievable shots.\" \n \nMurray and Peers have played together for almost three years now and they raced out of the blocks, opening up three break points in the first game on Mahut's serve, but failed to capitalise. \n \nTwo more chances arrived for the British-Australian duo at 4-4 in the first set but again the French held on, as Peers missed a simple backhand volley. \n \nThe mistake perhaps preyed on Peers' mind as he then served a double fault at 5-4 before being broken to hand away the opening set. \n \nThe second was even tighter, as neither side offered up a single break point until the final game, when Herbert finished off a thrilling match point to secure victory and the title. \n \n\"It was pretty close,\" Murray said. \n \n\"Once you get there, you want to win, don't you? It's not like we are the best players ever that will be making finals every time we step on the court. \n \n\"Just you never know when you might not get back to one. So when you get back to one, obviously you want to win. It didn't happen.\" \n \nTheir success this year means Murray and Peers are already close to securing a place at the ATP World Tour Finals in London in November. \n \nMurray will now turn his attention to Friday's Davis Cup semi-final against Australia, where he is likely to partner Andy in the doubles as Britain bid to reach the final for the first time since 1978. \n \n\"It's good, I don't have time to sit around and dwell on the past,\" Murray said. \n \n\"I have to fly back tomorrow (Monday) night, get to Scotland and join up with the team and get back into the swing of things at Davis Cup. \n \n\"There's a lot to look forward to next week. We have got a great chance to try to get to the final. We're playing at home as well so lots to look forward to.\"", "source": "Bailiwick Express"}