{"published": "2015-09-15T01:16:11Z", "media-type": "News", "title": "Hugh Frater the director of Vereit Inc (NYSE:VER), Purchased 31,000 Shares", "id": "8e049700-eb48-4fa9-b051-50bb0f100eba", "content": "Hugh Frater Insider Buy Transaction  \nVereit Inc (NYSE:VER) 7.91 -0.09 -1.13% director and an insider Hugh Frater a few days ago bought 31,000 company shares with a total value of $245,178 at the average share price which was $7.9. It seems he is very active lately as in the last month, he silently obtained additional 31,000 shares of the company, worth $249,234 USD. Hugh Frater now has ownership of 74,049 shares of Vereit Inc. \n Vereit Inc Stock Rating, Sentiment and Fundamentals  \nIn addition, the two equity specialist analysts that are in charge of Vereit Inc, see $-0.20 EPS in 2015. This will give it P/E ratio of roughly NaN & growth rate YoY of 0.00%-plus. \n       Rating & Sentiment PsychSignal Social: SELL Analysts Rating: BUY Hedge Funds Sentiment: NEUTRAL      Stock Fundamentals Earnings + FCF Trend: SELL Sector/Industry Macro: BULLISH Valuation Models: -        Technical Analysis ST Trend: DOWN MT Trend: DOWN LT Trend: DOWN      OctaFinance Rating*: NEUTRAL    \n* Read How Our Stock Ratings System Works \n         \nOctaFinance’s momentum model, coupled with Hugh’s new transaction, gives us no choice but to rate the stock “NEUTRAL”. Over the last 200 days alone the Vereit Inc’s share price has crashed 11.92% and continues to steadily trend down. \n Price Chart of Vereit NYSE:VER Stock  \n  \nSource: RightEdgeSystems , Yahoo Split & Dividend Adjusted Data and OctaFinance Interpretations \n \n Hedge Funds Ownership  \n13F SEC filings revealed that, 301 hedge funds and other players hold shares in Vereit Inc. In Q2 2015, the company in focus had 72.19% institutional ownership. That is a very high interest. They decreased by 45.92 million the total shares they hold. As of that quarter these hedge funds owned 653.29 million shares. There were 57 funds that closed their positions and 120 that reduced them. A total of 44 funds opened new positions in Vereit Inc and 89 increased their holdings. \n \nAs revealed by SEC’s 13F filings, 17 [HF3951] are confident in this stock as its in their Top 10 stock portfolios. \n \n \n\n \n Davidson & Garrard Inc had the greatest investment with ownership of 14,943 shares as of Q2 2015 for 0.03% of the fund’s portfolio. First Foundation Advisors is another bullish asset manager owning 7.48 million shares of the company or 4.83% of their stocks portfolio. The stock is also 1.9% of the fund’s AUM. Moreover The New York-based fund Kingstown Capital Management L.P. have 5.23% of their stock portfolio invested in the stock for 5.00 million shares. Menlo Advisors Llc revealed it had purchased a stake worth 0.07% of the fund’s stock portfolio in Vereit Inc. The Georgia-based fund Montag A & Associates Inc is also an optimist about the publicly listed company, possessing 10,582 shares or 0.01% of their stock portfolio. \n Vereit NYSE:VER Company Profile  \n \nVEREIT, Inc., formerly American Realty Capital Properties, Inc., is a real estate operating company. The Company owns and manages a diversified portfolio of retail, restaurant, office and industrial real estate assets, including approximately 4,645 properties totaling 101.8 million square feet. In addition, the Company manages real estate investments on behalf of the Cole Capital non-traded real estate investment trust (REITs). The Company operates in two segments: Real Estate Investment (REI) and its investment management business, Cole Capital (Cole Capital). \n \nCompany Website: Vereit \n \nThe company has 400 employees. Now its market worth is: $7.14 billion and it has 892.50 million outstanding shares. Now it has 79.29% shareholders and the institutional ownership stands at 79.29%. Vereit Inc was formed in Maryland on 2010-12-02. The stock closed at $7.9 yesterday and it had average 2 days volume of 5759961 shares. It is down from the 30 days average shares volume of 5903710. Vereit Inc has a one year low of $7.38 and a 52 weeks high of $12.82. The current price is below the 200 days simple moving average. \n \nHugh Frater is also director of Anthracite Capital Inc. \n \n* Represents deferred stock units previously awarded to the Reporting Person as described in his Form 4 filed on May 19 – 2015. \n \nThe post appeared first on Octafinance .", "source": "Octafinance"}