{"published": "2015-09-21T07:29:04Z", "media-type": "News", "title": "Greek Election Five Key Takeaways", "id": "1d055b7e-b96e-4be7-aefd-c4f7c430d813", "content": "2002 hit and run case Salman Khans hearing adjourned for two weeks  \nMumbai News.Net - Monday 21st September, 2015 \n \nThe Bombay High Court on Monday adjourned the hearing of Bollywood actor Salman Khan for two weeks in connection with the 2002 hit-and-run case.\n   \nThe court had earlier fixed the hearing of Salman  ... \n   Flag meeting at LoC will raise confidence between India Pakistan says RijijuUpdate  \nMumbai News.Net - Monday 21st September, 2015 \n \nMinister of State for Home Affairs Kiren Rijiju on Wednesday said the brigadier-level flag meeting at the Line of Control(LoC) will give a further boost to confidence measures between India and  ... \n   Australia appoint Sriram as consultant coach for Bangladesh Test series  \nMumbai News.Net - Monday 21st September, 2015 \n \nFormer India all-rounder Sridharan Sriram has been appointed as Australia's coaching consultant and will help the side iron out its spin bowling troubles for their upcoming two-Test series against  ... \n   Congress says Indo-Pak flag meeting at LoC has no meaning  \nMumbai News.Net - Monday 21st September, 2015 \n \nThe Congress Party on Monday said that the brigade commander-level flag meeting between India and Pakistan that will be held at the Chakan da Bagh crossing on the Line of Control (LoC) in Poonch  ... \n   CSA extends tribute to late Dalmiya  \nMumbai News.Net - Monday 21st September, 2015 \n \nCricket South Africa (CSA) on Sunday expressed condolences over the demise of the Board of Control for Cricket in India (BCCI) president Jagmohan Dalmiya, who passed away at the age of 75 after  ... \n   India wants better relations with Pakistan and China says Rajnath  \nMumbai News.Net - Monday 21st September, 2015 \n \nUnion Home Minister Rajnath Singh on Monday said that India wants better relations with Pakistan and China.\n   \nAddressing jawans of the Indo Tibetan Border Police (ITBP) at Samba in Jammu and  ... \n   Duty of EC to prove its impartiality says JD U  \nMumbai News.Net - Monday 21st September, 2015 \n \nThe Janata Dal (United) on Monday said that it is the duty of the Election Commission of India (ECI) to prove its impartiality after the Bharatiya Janata Party (BJP) claimed that it has its control  ... \n   PM Modi wishes Japanese counterpart on his bday  \nMumbai News.Net - Monday 21st September, 2015 \n \nPrime Minister Narendra Modi on Monday wished his Japanese counterpart Shinzo Abe on his birthday, saying he has always cherished his interactions with him. \n   \n\"Wishing my friend, Mr. Shinzo Abe,  ... \n   Woman murdered in West Delhis Raghubir NagarUpdate  \nMumbai News.Net - Monday 21st September, 2015 \n \nThe Delhi Police on Monday informed that a lady and her two kids were murdered in West Delhi's Raghubir Nagar area and said that the investigation into the case is presently underway.\n   \n\"It's a  ... \n   NCP bats for Indo-Pak talks  \nMumbai News.Net - Monday 21st September, 2015 \n \nThe Nationalist Congress Party (NCP) on Monday said that the talks between India and Pakistan must go on as any matter can be solved only through dialogue and discussion.\n   \n\"Talks must go on  ... \n   Another suspected dengue death in Delhi toll reaches over 20  \nMumbai News.Net - Monday 21st September, 2015 \n \nA 36-year-old woman died of suspected dengue on Sunday evening, taking the toll from the disease in the national capital to over 20.\n   \nAccording to the family members of the deceased Anita, she  ... \n   Freshers from Northeast get warm welcome in Delhi  \nMumbai News.Net - Monday 21st September, 2015 \n \nIt's time to get together, celebrate and share wonderful thoughts!\n   \n \n   \nThe Tangkhul Katamnao Long, Delhi (TKLD) recently organised the 12th edition of the \"Yarthot Kazip\" or fresher's meet at  ... \n   Delhi Govt. dismisses charge of irregularity in onion procurement  \nMumbai News.Net - Monday 21st September, 2015 \n \nThe Delhi government has dismissed media reports about irregularities in procurement of onion as false. \n   \nIn a statement, the City government sought to clarify that it is providing onions to the  ... \n   President Mukherjee condoles passing away of Jagmohan Dalmiya  \nMumbai News.Net - Sunday 20th September, 2015 \n \nPresident Pranab Mukherjee has condoled the passing away of Board of Control for Cricket in India (BCCI) president Jagmohan Dalmiya.\n   \n \n   \nIn his message, Mukherjee said, \"I am sad to learn  ... \n   EC to issue notification for second phase of Bihar polls today  \nMumbai News.Net - Sunday 20th September, 2015 \n \nThe Election Commission of India (ECI) will issue a notification for the second phase of assembly elections in Bihar today.\n   \nVoting of this phase will be held on October 16 in 32 constituencies  ... \n   India-U.S. CEOs Forum to discuss smart cities  \nMumbai News.Net - Sunday 20th September, 2015 \n \nThe India-United States CEO's Forum set up by President Obama and Prime Minister Modi will be discussing how smart cities can be developed in India as part of a wide ranging agenda, according to Mr.  ... \n   India-Pak to hold flag meeting today to discuss peace issues  \nMumbai News.Net - Sunday 20th September, 2015 \n \nIndia and Pakistan will hold a flag meeting on Monday at Line of Control (LoC) in Poonch in Jammu and Kashmir to discuss peace issues on the volatile border.\n   \nPRO Defence Northern Command Col. S  ... \n   India - Pakistan talks are important says U.S. Envoy Richard Verma  \nMumbai News.Net - Sunday 20th September, 2015 \n \nThe U.S. has said that talks between India and Pakistan are important and that it is upto both the nations to determine the scope, character and timing of the dialogue. These comments were made by  ... \n   Lobbying by U.S. pharmaceutical companies not in Indias interest Kiran Mazumdar Shaw  \nMumbai News.Net - Sunday 20th September, 2015 \n \nThe CEO of India's leading pharmaceutical company - BioCon - Ms. Kiran Mazumdar Shaw who, is in Washington to participate in the CEO's Forum of the India - US Strategic and Commercial Dialogue, has  ... \n   Cricket world in shock following Dalmiyas demise  \nMumbai News.Net - Sunday 20th September, 2015 \n \nBoard of Control for Cricket in India (BCCI) chief Jagmohan Dalmiya's demise in BM Birla Heart Research Centre here today left the entire cricketing world shocked.\n   \nDalmiya had suffered a heart  ...", "source": "Mumbai News.Net"}