{"published": "2015-09-03T18:38:41Z", "media-type": "Blog", "title": "Hawaiian Telcom to Present at Imperial Capital 9th Annual Global Opportunities Conference on September 17, 2015", "id": "f7e0ff15-3603-42f9-a2eb-6b0d35149235", "content": "HONOLULU, Sept. 3, 2015 (GLOBE NEWSWIRE) — Hawaiian Telcom Holdco, Inc. (NASDAQ: HCOM ), Hawai’i’s leading provider of integrated communications, data center and entertainment solutions announced today that the Company will present at the Imperial Capital 9 th Annual Global Opportunities Conference on Thursday, September 17, 2015 at 8:30 a.m. Eastern Time . The conference will be held at the Waldorf Astoria New York Hotel in New York City. A live webcast of the presentation, including a slide presentation, will be available from the Investor Relations section of Hawaiian Telcom’s website at www.hawaiiantel.com . The webcast will be archived for 90 days at the same location. For more information about the conference or to schedule a one-on-one meeting with Hawaiian Telcom management, please contact your Imperial Capital representative. About Hawaiian Telcom Hawaiian Telcom (Nasdaq: HCOM ), headquartered in Honolulu, is Hawai’i’s technology leader, providing integrated communications, broadband, data center and entertainment solutions for business and residential customers. With roots in Hawai’i beginning in 1883, the Company offers a full range of services including Internet, video, voice, wireless, data network solutions and security, colocation, and managed and cloud services supported by the reach and reliability of its next generation fiber network and a 24/7 state-of-the-art network operations center. With employees statewide sharing a commitment to innovation and a passion for delivering superior service, Hawaiian Telcom provides an Always On SM customer experience. For more information, visit www.hawaiiantel.com . The Hawaiian Telcom Holdco, Inc. logo is available at http://www.globenewswire.com/newsroom/prs/?pkgid=10087 Investor Relations Contact: \nNgoc Nguyen \n(808) 546-3475 \n \nMedia Contact: \nSu Shin \n(808) 546-2344 \nSource: Globenewswire Public \n Hawaiian Telcom to Present at Imperial Capital 9th Annual Global Opportunities Conference on September 17, 2015", "source": "Satellite News"}