{"published": "2015-09-30T21:04:37Z", "media-type": "News", "title": "Sunset Spas Of Arizona Expands To Serve Scottsdale Hot Tub Market With It???s 3rd Phoenix Area Spa Showroom Offering New And Used Spas", "id": "00370b96-7f54-4c27-9117-146c1d2b0b81", "content": "Company News: Page (1) of 1 - 09/30/15     print\n\t    \tpage         (September 30, 2015) \nHot Tub Dealer of the Year Award Winning Sunset Spas of Arizona is opening its new, expanded showroom mid October 2015. \n\nThe expanded dealership, located in Scottsdale, is something owner David Rempfer has been looking forward to for a long time. \n\nWith the success of our Chandler and Glendale stores, were really excited about newest hot tub showroom in Scottsdale. Weve been planning this expansion for quite some time and its thrilling to see it finally happening, Rempfer said. \n\nWith the addition of the Scottsdale location, Sunset Spas of Arizona will have three showrooms in the valley. Other showrooms include Chandler and Glendale and all offer clients custom designed hot tubs to suit their needs while providing real savings from a factory direct relationship. Their services include Phoenix area hot tub delivery, initial spa setup, used hot tub removal, spa chemicals and spa care education and more. \n\nAll of the necessary chemicals for your hot tub can be found at one of the three large showrooms in Chandler, Glendale or Scottsdale. \n\n \nSunset Spas of Arizona offers everything from hot tubs to swim spas of different sizes and to make the home entertainment experience complete, they also carry an array of barbecues and every type of accessory needed to make enjoying the backyard a resort style experience. \n\nSunset Spas offers a variety of financing options. With in-house financing customers work directly with the staff who have helped them in the sales experience. We understand that not one finance package works for every customer, so we create custom packages that fit our customers needs, Rempfer explained. \n\nAfter purchase, Sunset Spas of Arizona delivers and sets up the spa at no extra charge. In the event a problem arises, a service representative from the company will return to repair whatever is necessary. \n\nAbout Sunset Spas of Arizona \n\nHot Tub Dealer of the Year Award Winning Sunset Spas of Arizona allows clients to custom design a hot tub to suit their needs and provides real savings with a factory direct relationship. Their services include; Phoenix area hot tub delivery, initial spa setup, used hot tub removal, spa chemicals and spa care education and more. \n\nTo learn more, visit their website at http://SunsetSpasAz.com \nMedia Contact \nCompany Name: Sunset Spas of Arizona \nContact Person: David Rempfer \nEmail: sunsetspas@yahoo.com \nPhone: 480-656-7267 \nAddress: 2225 W. Pecos Rd. \nCity: Chandler \nState: Arizona \nCountry: United States \nWebsite:  http://SunsetSpasAZ.com \n\n\n\nPage: 1  \n \nRelated Keywords: Arts & Entertainment, Business, Lifestyle, \n\nSource:Copyright (c) AB Digital, Inc.\n All Rights Reserved", "source": "Digital Media Net"}