{"published": "2015-09-20T12:29:27Z", "media-type": "News", "title": "Hiring event scheduled at Sill on Friday", "id": "e0060b30-b2f9-43a6-a546-e1bab906c9ff", "content": "Job seekers can register online at www.okmilitaryconnection.com to attend an Oklahoma Military Connection hiring event at the Fort Sill Armed Forces Reserve Center from 10:30 a.m. to 2:30 p.m. Friday.  \n \nThe deadline for registering online is the close of business Monday. \n \nThe Armed Forces Reserve Center is Building 3955, behind the Shoppette at the southwest corner of Sheridan and Mow-Way roads. The hiring event is offered by a consortium made up of four agencies: CareerTech for Vets (a program of the Oklahoma Department of Career and Technology Education), the Oklahoma Employment Security Commission, the Oklahoma National Guard's Employment Coordination Program and the Oklahoma Department of Workforce Development. \n \nThose who are military members, Guard or Reserve, separating from active duty or veterans seeking employment, are encouraged to register for the event. Pre-registration with a resume will ensure exposure to employers to which they will be matched based on experience and skill set. Matched resumes have a greater success rate and are key to employer interviews. \n \nFifty employers from all over Oklahoma will be at the hiring event. Schools are not included, as the aim is to get vets and spouses into jobs with a livable wage. Walk-ins are welcome, but be sure to take your resume. \n \nSome employers will be conducting interviews on site, and computers are available for applicants who need to do some last-minute tweaking of their resumes or apply online. \n \nCol. Warren Griffis, director of the Oklahoma National Guard's Employment Coordination Program, said that in order to participate in the hiring event, employers must have current open vacancies and be willing to conduct interviews or a screening of some sort similar to an interview. \n \nThis is the third Oklahoma Military Connection hiring event that has been held in the Fort Sill Armed Forces Reserve Center. \n \n\"We've had outstanding success on the past two and expect even greater success this time,\" Griffis said. \n \nLast year's event drew upwards of 350 attendees. The employers who did report back said at least 13 people were hired from that event. \n \n\"It could be higher; we just haven't received information back from all employers. We believe the number is much higher,\" Griffis said.", "source": "Lawton Constitution"}