{"published": "2015-09-04T04:15:00Z", "media-type": "News", "title": "Spare me the YA; I'll take the classics", "id": "a9219513-cf58-4110-a15a-5920b368a410", "content": "This summer, I realized something strange and slightly nerdy about myself that I’m finally willing to admit in public: I hate YA fiction. \n   \nSince middle school, I’ve wanted to fall in love with a book like the Potterheads and Twihards did. But when my sister and all our friends were casting spells so they could enroll in Hogwarts, I was wondering what was so interesting about a bunch of kids with wands. \n        \nI couldn’t broadcast my disinterest in this series without being ridiculed so I went with my friends to watch the “Harry Potter” movies, but even then they bored me to tears. My love for Percy Jackson gave me a small taste of being a book fangirl, but it was false hope because then the \"Twilight\" fandom came along and all I cared about was Taylor Lautner playing a cute werewolf in the movie. \n \nWhen I couldn’t even get through the first five chapters of “Divergent,” I began to wonder: What was wrong with me? \n \nThis summer, I was determined to find a YA beach read that was such a page turner it would keep me up late at night. At the top of my list was “Me and Earl and the Dying Girl.” The book got off to a good start: It was original, funny and clever. \n \nBut as I read on, the narrator’s indifferent disposition and shallowness irritated me so much that I had to pinch myself to get through the rest of the book. \n \nNext on my list was the master of YA novels, John Green. I started “An Abundance of Katherines” with an open mind, but after the first few chapters, the main character seemed so full of himself that I couldn’t bring myself to read another page. \n \nSince this isn’t considered one of Green’s best books, I decided to pick up one of the most beloved books of our generation: “The Fault in Our Stars.” I watched the movie again, so I’d be motivated enough to read the whole thing through — since I’d given up on this novel three times before. But yet again, I had to drag myself to the end of it. I’m probably the only girl in America who didn’t totally love this book! \n \nIt was then I realized I’ve never liked young adult fiction, and I most likely never will. While other kids’ heroes were Hazel Grace or Harry Potter, mine were characters like Atticus Finch from “To Kill a Mockingbird.” \n \nIt’s strange, but I even find classics like Dickens’ “A Tale of Two Cities” to be more engrossing than John Green. \n \nThis summer, I ended up reading “The Great Gatsby,” even though I’ll be studying it in English class this school year. The beautifully crafted sentences make it obvious why many call it “the great American novel.” I enjoyed other books like “The House on Mango Street,” “The Heart is a Lonely Hunter” and Salinger’s “Nine Stories.” \n \nFellow reality panelists and PHS classmates, don’t hate me, but I’m actually excited to go back to reading adult fiction for school.", "source": "The Intelligencer"}