{"published": "2015-09-25T22:17:19Z", "media-type": "Blog", "title": "I was deeply moved, challenged, and confirmed by a humble man with a passion for Christ!", "id": "9fbd69ad-8a3d-44f6-a890-5edb70eff32c", "content": "This week, I was deeply moved, challenged, and confirmed by a man with a passion for Christ! His name is Major Dean Hinson and he is the president of The Salvation Army Evangeline Booth Bible College in Atlanta.\n\nAs a Salvation Army sergeant in the Kentucky/Tennessee Division, I was required to attend officers councils this week where Major Hinson was the speaker. As you may know from reading my blogs, I find much preaching to be dry, shallow, and mental rather than spiritual. However, not so with Major Hinson.\n\n\n\nAs he spoke, his passionate love for God was evident as he was frequently on the verge of tears. His words penetrated my heart and the hearts of my fellow officers.\n\nAs Major Hinson opened up his heart and shared about Abraham's willingness and courage to hear and obey God rather than being bound by tradition, my courage grew stronger. Abraham didn't follow a program, he followed the direct leading of the living God.\n\nMajor Hinson shared about how Elijah didn't try to persuaded the prophets of Baal with his oratory, but rather set up a contest where the living God could actually demonstrate His power. His message confirmed my inner yearning to see church meetings move beyond lecture by asking God to show up with His fire and then allowing people the time to listen to God so that His flames can break out in their hearts. Major Hinson put it this way: \"If the Spirit is not blowing through our lives, the fire is going to go out. If we are just going on the way we've been going on, the fire is going to go out. Is the fire still burning?\"\n\nMajor Hinson also talked about how we can substitute programs for God, instead of allowing God do things His way. He said:\n--\"I can substitute my plans and programs instead of what God wants to do.\"\n--\"Look for what God is doing. God's plan is not what we expect. It's out of the box. We're not used to it.\"\n--\"You can't declare Jesus as Lord and then say 'Jesus, You need to do it this way.'\"\n\nThe Spirit moved powerfully in those meetings with Major Hinson. Several times I began to weep as I saw God working as people responded to His promptings. I am so encouraged!\n\nI went to McKay Used Books in Nashville today and as I was browsing I found the book, Models of the Church, published in 1974, by Avery Dulles, a Catholic priest. I got home and found these words from Dulles that further confirm the vision in my heart to see church meetings allow ordinary men and women to share from the heart as they are prompted by the Spirit. Dulles said:\n\n\"Because the church carries with it so large a heritage from the past, there is a constant temptation for its members to cling to the ways of their ancestors . . . If life is to be breathed into those dead bones of doctrinal, ritual, and hierarchical organization that, in the eyes of many viewers now constitute the church, the Spirit of the Lord must send prophets to His people . . . new models of thinking about the church.\"\n\nI thank God for Major Dean Hinson's willingness to sacrifice his comfort zone and to allow God to deeply move his heart. As he opened himself up I (and others) could see, hear, and be moved by the living God's work in his life.", "source": "Free Gas For Your Think Tank (A blog to jog your mind and unclog your heart . . .)"}