{"published": "2015-09-17T16:50:41Z", "media-type": "News", "title": "Duck and Pineapple Fried Rice", "id": "fc33055a-4b24-47c1-a965-182f0418863a", "content": "Geier’s Sausage Kitchen has wonderful plump Maple Leaf Duck breasts in the freezer. I keep some on hand to make a luscious duck fried rice for family and friends.  Of course I stopped at Yoder’s Produce market for farm fresh fruits and veggies to add to a family favorite. \n  \nRemember to only use cold rice and you may substitute brown rice. \n \nIngredients \n \n2 Tbs. neutral oil, such as canola or peanut \n \n1 Tbsp. duck fat rendered –optional (see below) \n \n1/2 cup diced yellow onion \n \n2 Tbsp. gluten free soy sauce \n \n¼ cup fresh squeezed orange juice \n \n1/4 cup thinly sliced scallions (3 medium) \n \n2 Tbsp. minced fresh ginger \n \n2 Tbsp. minced fresh garlic \n \n2 Tbsp. minced fresh cilantro (for garnish) \n \n1 cup thinly sliced shiitake mushrooms (stem before slicing) \n \n1 Tbsp. chili sauce \n \n4 cups cold cooked jasmine rice -chilled \n \n1-1/2 cups diced sweet bell peppers (1/4-inch dice) \n \n2 boneless duck breasts (or leftover duck precooked and chopped) \n \n½ cup chopped mango \n \n1/2 cup diced pineapple \n \n1 cup diced savoy cabbage \n \nScrambled egg whites \n \nDirections \n \nHeat a 14-inch wok or 12-inch skillet over medium-high heat . Add the oil, swirl the wok to coat, and then add the onion, scallions, ginger and garlic. Stir-fry with a metal or wooden wok spatula until fragrant and light golden, 30 to 60 seconds. \n \nAdd the mushrooms and stir-fry until slightly softened, 2 to 3 minutes. Stir in the chili sauce and stir-fry until all of the ingredients are coated, about 30 seconds. \n \nUsing your hands or a fork, gently break up any clumps in the rice until the grains are separate. Add the rice to the wok and gently stir-fry, stopping occasionally so the rice has a chance to brown a bit, until it has some crispy edges and is heated through, about 3 minutes. You should hear sizzling during the last minute or so. \n \nDrizzle the fish sauce over the fried rice. Add the bell peppers and stir-fry until softened, 30 to 60 seconds. Add cooked egg whites and toss. \n \nAdd the duck, pineapple, mango, and gently stir-fry until heated through, 30 to 60 seconds. Transfer the fried rice to plates or bowls, top with cilantro and serve right away. \n \nDuck breasts: \n \nUnthaw and score duck skin with knife. Pre heat pan to medium high. Sear duck breasts about 10 -12 minutes per side or until medium rare let rest 15 minutes. \n \nDrain fat, reserving some for rice and save remaining for fried potatoes another day.", "source": "My Sun Coast"}