{"published": "2015-09-03T09:33:39Z", "media-type": "News", "title": "EasyJet hails record August as 7.1m passengers fly with airline", "id": "d9d58c89-1407-438a-846e-4e9c24c5d8ae", "content": "Holidaymakers jetting off to take advantage of the strong pound and escape last month's rain helped easyJet notch up a record August, and is set to see the airline deliver better-than-expected profits. \n \nThe no-frills carrier said it flew  7.1 million passengers last month after a surge of late bookings as Britons headed for beach and city destinations across Europe, boosted by the strength of the pound against the euro. \n \nEasyJet upped its annual profit outlook to between £675 million and £700 million for the year to September 30 after the bumper August performance, which is set to see the group post its fifth year in a row of record annual pre-tax profits. \n \nThe group was previously expected to report profits of between £620 million and £660 million. \n \nPaul Moore, spokesman for easyJet, said: \"People have realised that the strong pound against the euro is really making their money go further on holiday.\" \n \nThe most popular destinations for sun-seekers were Malaga, Alicante, Faro and Palma, while Barcelona was also a top pick for those looking for a city and beach experience, according to easyJet. \n \nThe pound has surged against the euro over the past year due to economic woes across Europe and expectations of an interest rate hike in the UK. \n \nIn currency markets, sterling is worth 1.36 euros at today's prices, having reached as high as 1.44 euros in the past year. \n \nAugust's passenger numbers marked a 6.8% rise on the year earlier and the second consecutive month the group has carried more than 7 million fliers. \n \nThe carrier also said its load factor - a measure of how well it fills its planes - hit a record last month at 94.4%. \n \nMr Moore said bookings were made later this year after the beach terrorist attack in Tunisia in June and the uncertainty surrounding Greece affected travel earlier in the summer. \n   Promoted stories   \nLast month's rain and colder than average temperatures for the time of year added to the exodus abroad, he added. \n   \n Share article  \n   \nLuton-based easyJet said surging revenue growth in the key month of August - and a robust performance expected for this month - would more than offset higher costs faced by the business this year, including  disruption across the network particularly in April, the impact of the two fires at Rome Fiumicino airport and its £8 million settlement with Eurocontrol. \n \nCarolyn McCall, easyJet chief executive, said:  \"E asyJet was best placed to maximise the strong late summer demand from UK passengers to get away to beach and city destinations across Europe and will enable the airline to set new records for full-year revenue and profit.\"", "source": "St Albans and Harpenden Review"}