{"published": "2015-09-30T23:10:39Z", "media-type": "Blog", "title": "Kinder Morgan extols pipeline benefits as Sen. Rosenberg meets with FERC to express constituents' concerns", "id": "bf720ec6-7de9-48f2-897c-81af6cf2c08e", "content": "Kinder Morgan issued a statement late today (Sept. 30) describing the benefits of the company's proposed Northeast Energy Direct natural gas pipeline. Kimberly S. Watson, president of Kinder Morgan's east region gas pipelines division, said there is a critical need for additional natural gas capacity in New England to stabilize energy prices. Watson made reference to today's trip to Washington by state Senate President Stanley Rosenberg. Rosenberg met with members of the Federal Energy Regulatory Commission to discuss his constituents' concerns about the proposed pipeline, and also met with Dept. of Energy officials and members of Congress on matters of energy policy. Watson said she appreciated Rosenberg's efforts to involve his constituents in the federal permitting process for the proposed pipeline. The statement was issued through Crawford Strategies, a Boston-based public relations firm.  The 212-mile 30-inch line, which would cut through sections of New York, Massachusetts, and New Hampshire, has met with strong opposition in the senator's district. Rosenberg has not taken a stand on the pipeline's merits, but has said he wishes to ensure a \"deliberative process\" as Kinder Morgan pursues federal approval for the project. Watson issued the following statement late Wednesday afternoon: \"We appreciate Senate President Rosenberg's efforts as the state reviews its energy strategy.\n\"As numerous studies have shown, there is a critical need for additional natural gas capacity in New England to stabilize sky-high electricity prices that burden residents and businesses and to support the state's objective of increasing the percentage of renewable energy. \"The NED project will help the Massachusetts economy grow both statewide and across New England. It will also help the state's impressive climate change objectives by reducing reliance on coal and fuel oil. \"Unlike other regions in the country, which are benefiting from cleaner and less costly natural gas, Massachusetts and the region will continue to pay billions more per year for its energy needs without additional natural gas capacity. \"In the development of renewable energy resources, natural gas is widely identified as the ideal bridge fuel for the intermittent nature of renewables and would, in fact, hasten a faster deployment of solar and wind energy in the state. \"We appreciate the Senate President's initiative in creating opportunities for his constituents' voices to be heard in the FERC process. We look forward to working with all interested parties who wish to participate in the process so that the best decisions can be made.\" Kinder Morgan announced this week that its subsidiary Tennessee Gas Pipeline Co. had executed additional agreements with anchor shippers for capacity on the proposed line. National Grid, Liberty Utilities, Columbia Gas, Connecticut Natural Gas, Southern Connecticut Gas, Berkshire Gas, and Westfield Gas & Electric were announced in March. Recently, more unnamed entities have signed up for a combined 675,000 dekatherms of capacity, according to Kinder Morgan. In March, the number hovered around 500,000 dekatherms. FERC, in its upcoming evaluation of the pipeline, will consider whether the project is economically sound, and balance benefits against adverse impacts. Kinder Morgan will seek a certificate from the federal regulators this fall. Rosenberg told reporters on Tuesday that he sees a \"disconnect\" between policy makers pushing green energy and regulatory agencies such as FERC and the state Dept. of Public Utilities, saying they are bound by outdated statutes. Mary Serreze can be reached at mserreze@gmail.com", "source": "Breaking News - MassLive.com"}