{"published": "2015-09-28T05:47:36Z", "media-type": "News", "title": "Shell pulls the plug on Arctic exploration for now", "id": "92798af8-f3e0-4efc-af2c-03903874f11b", "content": "12:47 a.m. CDT \n \nLONDON (Reuters) - Oil company Royal Dutch Shell is pulling out of exploration in Arctic waters off Alaska for the foreseeable future and could take a hit of up to $4.1 billion after failing to find enough oil. \n \nThe unsuccessful drilling campaign is Shell's second major setback in the area after it interrupted exploration there for three years in 2012 when an enormous drilling rig broke free and grounded. \n \nThe company, which has spent about $7 billion on exploration in the Arctic, said its decision to withdraw reflects the project's high costs and the unpredictable federal regulatory environment in the area. \n \n\"Shell has found indications of oil and gas in the Burger J well but these are not sufficient to warrant further exploration in the Burger prospect,\" it said in a statement on Monday. \n \nEnvironmental campaigners, who tried to interrupt Shell's drilling plans by blocking an icebreaker vessel as they dangled from a bridge, welcomed the news. \n \n\"They had a budget of billions, we had a movement of millions. For three years we faced them down, and the people won,\" said Greenpeace UK executive director John Sauven. \n \nEnvironmentalists have criticized Shell's drilling plans in the Arctic, which is home to sensitive populations of whales, walrus and polar bears. \n \nShell said its Alaskan position is valued at about $3 billion with a further $1.1 billion in future contractual commitments and it would give the value of writedowns with its third-quarter results. \n \nMost large oil companies have cut back on spending and put some exploration projects on hold since crude prices more than halved from last year's peak. \n \nShell said it still thought the Arctic region, which is estimated by the U.S. Geological Survey to hold about 30 percent of the world's undiscovered natural gas and 13 percent of its oil, would be significant. \n \n\"Shell continues to see important exploration potential in the basin, and the area is likely to ultimately be of strategic importance to Alaska and the U.S.,\" the company said. \n \n(Reporting by Karolin Schaps in London and Abhiram Nandakumar in Bengaluru; editing by David Clarke)", "source": "WHBL"}