{"published": "2015-09-12T02:22:04Z", "media-type": "Blog", "title": "Hungary PM wants 3-bn euro migrant aid plan", "id": "3067006a-b7f1-461b-aafd-8e150a686e6d", "content": "Hungary PM wants 3-bn euro migrant aid plan 12 September 2015, 04:22 CET — filed under: Europe, migrants, Hungary, aid, migration (BERLIN) - Hungary's prime minister, whose country is under fire for its perceived harsh treatment of migrants, wants Europe to give three billion euros aid to Syria's neighbours to help stem the flow of refugees, it was reported Saturday.\nIn an interview with German newspaper Bild, Viktor Orban said he wants the European Union to give the money to Turkey, Lebanon and Jordan, the first ports of call for Syrians trying to escape conflict.\n\"We have a plan, which I will present to the heads of the European Union at our next meeting (to provide) massive financial support to countries neighbouring Syria,\" he said, according to excerpts of the interview released by the newspaper.\nMillions of people have been displaced by Syria's four-year war, with many given refuge in camps in neighbouring countries.\nBut an increasing number are now flowing into Europe, where authorities are struggling to cope with the biggest movement of people since World War II.\nOrban has taken a hard line against the thousands of migrants passing through Hungary.\nRiot police have been deployed to control crowds and footage from inside refugee camps has revealed harsh conditions.\nHungary this week increased the number of soldiers building its controversial anti-migrant border fence, as the numbers of people crossing from Serbia hit a new record.\nOrban has stood firm on the implementation of harsh new laws which could see migrants jailed for entering Hungary starting Tuesday.\n\"If it takes more money, we will increase aid until the refugee flows are drying up,\" Orban told the paper.\n\"These migrants do not come from war zones but from camps (in these border countries), where they were safe.\n\"They are not fleeing danger -- they have already fled and should not fear for their lives.\nThey come to Europe not \"because they seek safety but because they want a better life than in a camp. They want a German life, perhaps a Swedish life\". \"But it's a fact: there is no fundamental right to a better life, only a right to security and human dignity,\" he said. Text and Picture Copyright 2015 AFP. All other Copyright 2015 EUbusiness Ltd. All rights reserved. This material is intended solely for personal use. Any other reproduction, publication or redistribution of this material without the written agreement of the copyright owner is strictly forbidden and any breach of copyright will be considered actionable. Document Actions Print this Share this", "source": "EU News"}