{"published": "2015-09-06T07:33:42Z", "media-type": "News", "title": "Punch Pizza has the last laugh over its higher wages", "id": "e6aba141-3fc2-496b-8ff0-13af8eb33646", "content": "We are making progress on Libya political agreement UN envoy reports  \nThe Africa News.Net - Friday 4th September, 2015 \n \n4 September 2015  --  The United Nations envoy facilitating efforts to restore peace in Libya said today that real progress was being made as the participants wrapped-up the latest round of the  ... \n   Citing marginal gains UN human rights chief warns Central African Republic still gripped by fear  \nThe Africa News.Net - Friday 4th September, 2015 \n \n4 September 2015  --  The human rights situation in the Central African Republic (CAR) is far better than it was at the height of the conflict in late 2013 and early 2014, but is still a cause of  ... \n   UN humanitarian air service in dire need of funds to continue life-saving work in Sudan  UN agency  \nThe Africa News.Net - Friday 4th September, 2015 \n \n4 September 2015  --  A lack of funding in Sudan could have serious repercussions on the ground, the World Food Programme (WFP) said today, warning that the United Nations Humanitarian Air Service,  ... \n   Ban appoints Pakistan national as Force Commander of UN Western Sahara mission  \nThe Africa News.Net - Friday 4th September, 2015 \n \n4 September 2015  --  Secretary-General Ban Ki-moon announced today the appointment of Major General Muhammad Tayyab Azam of Pakistan as the Force Commander of the United Nations Mission for the  ... \n   Liberia again declared free of Ebola transmission as number of cases remains stable in wider West Africa  \nThe Africa News.Net - Thursday 3rd September, 2015 \n \n3 September 2015  --  The World Health Organization (WHO) today declared Liberia free of Ebola virus transmission after the disease had resurfaced in June, and as the country enters a 90-day period  ... \n   Rwanda Names Baby Mountain Gorillas in Annual Tradition  \nThe Africa News.Net - Saturday 5th September, 2015 \n \nKINIGI, RWANDA -   Rwanda named two-dozen baby mountain gorillas in an annual ceremony Saturday that highlights the African country's efforts to protect the endangered animals, which attract large  ... \n   Al-Shabab Militants Seize Towns in Somalia after AU Retreat  \nThe Africa News.Net - Saturday 5th September, 2015 \n \nAl-Shabab militants seized two southern Somalian towns from retreating African Union forces Saturday, days after a deadly militant attack on an AU base in the same area killed dozens of Ugandan  ... \n   Libyan Talks Seen Entering Final Chapter  \nThe Africa News.Net - Saturday 5th September, 2015 \n \nGENEVA -   Talks aimed at uniting Libya's two warring governments are entering the final stretch, and there is hope of signing a deal on September 20, U.N. Special Representative for Libya  ... \n   Tanzania Opposition Counts on Enthusiastic Supporters Ahead of Vote  \nThe Africa News.Net - Friday 4th September, 2015 \n \nA prominent member of Tanzania's main opposition Chadema party says the intense enthusiasm exhibited by supporters is a significant boost to the opposition's effort to defeat the ruling Chama Cha  ... \n   Swaziland Rejects Propaganda Tied to Fatal Wreck  \nThe Africa News.Net - Friday 4th September, 2015 \n \nThe spokesman for Swaziland's government says opponents of the administration are using a traffic accident last week that killed several young women to tarnish the reputation of the southern African  ... \n   CAR Warlords Must Face Justice UN Rights Chief Says  \nThe Africa News.Net - Friday 4th September, 2015 \n \nBANGUI, C.A.R. -   Rebel and militia leaders responsible for the worst crimes committed in Central African Republic have yet to be arrested, let alone prosecuted, the United Nations' top human  ... \n   South Sudan Rebels Commit to New Peace Deal  \nThe Africa News.Net - Friday 4th September, 2015 \n \nSouth Sudan rebels loyal to former Vice President Riek Machar say they are committed to the implementation of the peace deal signed last month in Addis Ababa, Ethiopia.\n This came as a three-day  ... \n   Twin Suicide Bombings Kill 20 in Cameroon  \nThe Africa News.Net - Friday 4th September, 2015 \n \nYAOUNDE -   Cameroon says it has evacuated at least 200 wounded people after twin suicide bomb attacks in Kerawa on its northern border with Nigeria's Borno state left at least 20 people dead. The  ... \n   Diabetes a Growing Health Menace in Africa  \nThe Africa News.Net - Thursday 3rd September, 2015 \n \nIn sub-Saharan Africa, problems with communicable diseases, like HIV, malaria and ebola are common.  But adult-onset diabetes is being seen more often in the region, in many of the world's poorest  ... \n   War Photographer Focuses on Plight of 1B Disabled People  \nThe Africa News.Net - Thursday 3rd September, 2015 \n \nLONDON -   When war photographer Graeme Robertson met a boy in Uganda whose skin looked as if it was falling off his face, he was shocked to discover the boy had been attacked for being  ... \n   Govt. warns Indians against travelling to Libya  \nThe Africa News.Net - Friday 4th September, 2015 \n \nThe Government issued an advisory warning Indians against travelling to Libya on Friday\n   \n\"In view of the deteriorating security situation in Libya, the government has issued several advisories  ... \n   Chinese-built school brings education to 600 children in Namibia  \nXinhua - Saturday 5th September, 2015 \n \nWINDHOEK, Sept. 5 (Xinhua) -- About 600 children from the San community of Namibia have a chance of getting an education after the inauguration of a primary school built by the China Youth  ... \n   China-Botswana military exchanges contribute to bilateral relationship  \nXinhua - Saturday 5th September, 2015 \n \nGABORONE, Sept. 5 (Xinhua) -- The Chinese embassy in Botswana on Friday bid farewell to 18 Botswana Defence Force (BDF) officials who are going to attend annual training courses in China.  ... \n   W. SCOTT LAMB What would Jesus do at Angola penitentiary  \nWashington Times - Saturday 5th September, 2015 \n \nA Matter of Black Lives ,'; profiling the prison and the prisoners of the infamous institution of incarceration located outside Angola, Louisiana. Here is the  ... \n   Rwanda gives names to 24 baby mountain gorillas to promote conservation draw tourists  \nTimes Colonist - Saturday 5th September, 2015 \n \nYouths dressed in gorilla costumes to represent the newly-named gorillas, entertain the crowd by mimicking the animals' behaviour, at a baby gorilla naming ceremony in Kinigi,  ...", "source": "TheAfricaNews.Net"}