{"published": "2015-09-22T15:00:59Z", "media-type": "Blog", "title": "Do You Suffer From Techno-Stress?", "id": "48d748e8-85fb-44f8-bbeb-e824a377ea3b", "content": "Rapid advancements in technology and the spread of its use are double-edged phenomena in our modern world. In fact, some studies suggest that there is an increase of stress and health problems relating to information overload in the use of communication and information technologies (ICT). \n \nWhile many argue that digital technologies have impacted communication and productivity positively, for others this is debatable. More communication is not necessarily better communication or better productivity. \n \nNegative psychological response \n \nSome call this “techno-stress”, defined as a negative psychological response related to the use of digital technologies. According to researchers referencing this phenomenon, numerous and rapid changes in digital technologies may be making us feel forced to keep up to date with these changes, to multitask more effectively and carry out increasing amounts of work remotely. \n \nIn many cases people do not just do their work from their workplace. In fact, the concept of the workplace is itself a rapidly changing concept. It is no longer necessarily a reference to an office, a factory or a specific place. Many roles, especially ICT roles are carried out without any need to be in a specific geolocation. \n \nThe workplace can now be anywhere as long as we have a suitable device that allows us to carry out our specific tasks. Airports, trains, holiday resorts, even our beds could now be called workplaces. \n \nTechno-strain and techno-addiction \n \nSalanova et al ., argue that we can actually experience techno-stress in two main ways: “techno-strain” and “techno-addiction”. \n \nTechno-strain is related to high levels of fatigue and anxiety, and low self-belief related to the use of ICT. Techno-addiction is related to the excessive and compulsive use of ICT. \n \nHow to cope \n \nThe research suggests that many find it increasingly difficult to draw boundaries between work and leisure, with states of techno-stress being commonplance and related to a compulsion to be connected and constantly updated via multiple channels of communication. \n \nIn order to cope with this problem and get back in balance, experts suggest that employers become increasingly aware of this problem, provide additional support and training to employees on the subject and promote responsible ICT use. \n \nWe’re pretty good at getting connected online, now perhaps we need to learn how to unplug ourselves, which I, as a techno-expert, would like to “techno-suggest”. \n \nReferences \n \nTarafdar, M., Gupta, A., & Turel, O. (2013). The dark side of information technology use Information Systems Journal, 23 (3), 269-275 DOI: 10.1111/isj.12015 \n \nSalanova, M. (et.al.) (2014). Technostress: The Dark Side of Technologies, in The Impact of ICT on Quality of Working Life . Springer, pp. 87-103. \n \nImage via Catalin Petolea / Shutterstock .", "source": "Brain Blogger"}