{"published": "2015-09-04T07:00:42Z", "media-type": "Blog", "title": "Foreign players aren’t killing English talent – they’re doing that by themselves", "id": "b36cbdbb-b0e2-43ac-9f3e-734234dc9e5d", "content": "Benjamin Franklin once said that nothing in life is certain besides death and taxes. As an American, we can perhaps forgive his omission of the most interminable certainty of all. \n \nFor at least whilst death is a one-off and taxes are proportionate, the shortcomings of English home-grown talent are eternal. \n   View image | gettyimages.com   \n  \n \nWith a door so gaping, who can blame the beautiful game’s administrators for safeguarding their jobs with jingoistic appeals? This is no dystopian prophesy: this is modern English football. \n \nThe FA Chairman Greg Dyke in particular has found the perfect scapegoat in those suspiciously bohemian, elaborately coiffured, diminutive foreign imports crushing English youth prospects beneath their brightly coloured personalised boots. \n \nNevertheless, foreign players aren’t killing English talent – as this summer’s transfer window shows, English players are doing a sterling job by themselves. \n \nTake Raheem Sterling. There is no doubt that he is one of the brightest young talents in European football, let alone in the Premier League: so agreed Prime Time Sport in their recent study , rating him ahead of Marquinhos and Memphis Depay as Europe’s most valuable young player. If Greg Dyke wants a poster boy for English talent, he need look no further. \n \nUnder the tutelage of Brendan Rodgers, Sterling’s rise on Merseyside was meteoric. That Sterling feels his career can progress better away from the stagnant turf of Anfield is understandable. \n \nIt is no less surprising that the pint-sized forward was hardly lacking in Premier League suitors. Sterling is Britain’s answer to David Silva, a gifted dribbler of the ball who has increasingly moved into a more central role from his initial berth on the left side of the pitch. \n \nSo why, then, would such a talent move to the one team who already have a David Silva of their own? \n \nThen again, perhaps we should feel more pity for young Raheem. After all, he’s hardly the biggest offender this transfer window. \n \nFabian Delph is not your typical pantomime villain but has managed to rise to the occasion with aplomb, promising never to leave his darling Aston Villa just a week before moving to Manchester City like a wanton teenager recklessly breaking the heart of his first love. \n \nIn fairness to Delph, few surprises await him after taking advice from Micah Richards. Richards is said to have told Delph that he had the “time of his life” at the Etihad Stadium, which surely stands next to Nigel Pearson’s peacock rant as one of the most beguiling football statements of all time given the rapidity with which the defender’s potential has swiftly evaporated from the long years of warming City’s substitute bench. \n \nMuch like Scott Sinclair and Jack Rodwell, Delph has moved to a side with a plethora of more skilled talent at exactly the moment his career was beginning to take off. Also like Sinclair and Rodwell, few would be surprised to see Delph sold in a few years’ time a shadow of his former self. \n \nDyke is wrong: overseas players like Yaya Touré and Fernandinho aren’t preventing Delph from realising his true potential simply by being more technically able. \n \nAfter all, Delph has a place in the Premier League where he can get the game time needed to develop in Aston Villa. For Sinclair this was Swansea, for Rodwell Everton: the only people who seem confused when they fail to succeed at the top are these players’ themselves. \n   View image | gettyimages.com   \n  \n \nOf the fourteen players to feature for Germany in the 2014 World Cup final, only Jérôme Boateng, André Schürrle, Mesut Özil and Mario Götze had moved to a big team from a smaller one before the age of twenty three. \n \nOf the fourteen to appear for Spain in the final of 2010, only one, Sergio Ramos, had done the same. Simply put, twenty-four players who would go on to win the World Cup had more sense than to take what is at best an unnecessary career risk, like Sterling. \n \nThe Premier League provides ample opportunity for English development. Ross Barkley, Harry Kane and (just about) John Stones have continued to prosper whilst ignoring the mountains of gold on offer elsewhere. \n \nAll three gained vital experience in the Championship when they were not at the level required to play top-flight football. All three were then promoted to the first team in the face of a supposedly nefarious plot to limit English talent. All three have little need for restrictions on the number of foreign players. \n \nConversely, in leagues where there has been a foreigner cap, as in Turkey, substandard players are allowed to flourish and demand higher wages simply on the basis of nationality. \n \nResultantly, the Turkish national team has increasingly worsened since the glory days of 2002. Like Dyke, they failed to grasp a simple truth: the greater the competition, the greater the standard of football and the greater the ability of emerging players. \n \nGenerally, the best players succeed regardless of origin. If there are any systemic imbalances, they are those allowing substandard English players like Tom Cleverley a role at a team the size of Manchester United. \n \nReinforcing these biases only lowers the overall standard and creates more such players, given more opportunity than their performances have ever warranted. \n   View image | gettyimages.com   \n  \n \nIn all likelihood, Dyke may not believe his own rhetoric. He knows full well that limiting the amount of foreign players would serve only to decrease the status of the Premier League as the best worldwide by limiting the pool of talent clubs can draw upon. Ahead of the biggest television deal ever in 2016 – 2017, he similarly knows that this is highly unlikely to happen. \n \nAnd so, he has the perfect scapegoat, the perfect drum to bang so that he can be seen to be concerned and active, energetic and innovative, all while being thwarted by big money transfers, FIFA and any other readily available culprit. \n \nHere is Dyke’s great success, that no one is asking the most pertinent question of all: why are young English players generally less technically able than their continental counterparts? Why is an academy along the lines of Barcelona’s La Masia impossible in Manchester? Why are English players still schooled in long-ball tactics better suited to the Stone Age, which they revert back to all too often? \n \nTo be clear, a large part of the onus for developing young talent rests with the FA. While Dyke succeeds in shifting the blame, the FA will never face deserved criticism for failing to improve football development at a youth level. \n \nIf we want to improve English players, we need to change attitudes, training and development. We need less players moving clubs before they are ready. We need more focus on grassroots development. But above all, we need to stop blaming foreign players.", "source": "Back Page Football"}