{"published": "2015-09-14T20:34:55Z", "media-type": "News", "title": "Could Kevin Durant Realistically Be World's Best Player This Season?", "id": "8d6c13af-6350-499d-a2f6-19eead3104c2", "content": "Kevin Durant intimately knows the sound of opportunity's knock, but the urgency attached to these particular raps is more intense than ever. \n \nThe 2015-16 NBA season is his last, best chance to reign supreme over the basketball world. \n \nLeBron James has yet to abdicate his throne as the planet's premier player. Even when Durant captured the 2013-14 MVP award, few viewed the honor as an actual changing of the guard. \"LeBron is still the best player in the world, better than Durant on defense and more versatile on offense,\" NBA.com's Scott Howard-Cooper wrote in 2014. \n \nWhenever Father Time seizes the 30-year-old James' crown, it's no longer a formality that Durant will be the next to don it. The  New Orleans Pelicans ' 22-year-old phenom Anthony Davis has forced his way into that discussion, and last season saw Stephen Curry , James Harden and Russell Westbrook push themselves to previously unseen heights. \n \nThe league isn't waiting for Durant to ease back into action after missing all but 27 games last season to a trio of foot surgeries. He has to simultaneously dethrone James and prevent his fellow competitors from sliding into the empty seat. \n \nTo hear Durant tell it, he's up for the challenge. \n \nHe staked his claim with an uber -confident assessment of his abilities at Team USA's training camp in August, via CSN  Chicago 's Vincent Goodwill : \n \nKD: \"No disrespect to anyone else but I feel like I'm the best player in the world.\" \n— Vincent Goodwill (@vgoodwill) August 12, 2015  \nIn early September, Durant doubled down on that take. \n \n\"I'm still the best player in the world,\" he said during a Nike event in Spain (via Ruptly TV). \n  [embedded content]   \nThe quotes aren't quite as bold as they may initially sound. \n \nConfidence is key for any professional athlete, and a number of NBA players may feel the same way about themselves. Plus, Durant can ill-afford to doubt his talents now that he's working his way back from the first major injury of his career. \n \n\"Saying he's the best isn't some declaration to Durant. It's a statement of status  quo ,\" wrote Bleacher Report's  Kevin Ding . \"And in Durant's world, his former status is something to which he must aspire. The fact that he is unflinching about his confidence is the only way he avoids lowering his expectations.\" \n \nBut these words can be more than fuel for Durant's recovery. He has the skill set needed to make these pronouncements become self-fulfilling prophecies —provided he acts quickly enough. \n \nStill shy of his 27th birthday, he's already a four-time scoring champ. Only Michael Jordan (10) and Wilt Chamberlain (seven) have more scoring crowns. \n \nIt'll take more than point production to push Durant to the top, but his game has more layers than that. \n \n\"Here's a quick refresher on what Durant offers —the most varied and best scoring abilities of his generation...a disarming casualness that could morph into a vicious streak at any moment, the still-jarring sight of a 7-footer playing like a guard,\" wrote  Yahoo Sports'  Eric Freeman . \"He is a transformational figure.\" \n    Ethan Miller/    \nDurant's statistics have already separated him from his contemporaries. \n \nIn 2013-14, he joined Jordan and Chamberlain as the only players to ever average at least 32 points on 50 percent shooting, seven rebounds and five assists. Even last season, when Durant logged the fewest minutes of his career, he was the only player to post 25 points on 50 percent shooting, six boards and four assists per game. \n \nTake his absences out of the equation, and he maintained nearly the same dominance he displayed during his MVP campaign. View both seasons under a per-36-minute lens, and the differences in his numbers were negligible. \n \nObviously, those numbers carry a different kind of weight when they're tallied over a full, healthy season. But considering Durant missed just 16 games over his first seven seasons combined, there's reason to believe he can put this foot problem behind him. \n \nA healthy KD is one of the league's best players. There's no debating that stance. \n \nAs for where he ranks on that list, it's still being determined. \n \nESPN.com's MVP forecast  put Durant fourth, behind James, Davis and Harden. Durant checked in at No. 2 on the top-100 list compiled by  Sports Illustrated 's  Ben  Golliver  and Rob  Mahoney . \n \nDurant is right on the doorstep of hoops supremacy, but he needs another nudge to clear the threshold. \n \nIf that doesn't come this year, his time could run out. Davis' NBA takeover is coming quickly. He's all of three seasons into his pro career and already owns a single-season player efficiency rating higher than any posted by a player not named Jordan, James or Chamberlain ( 30.8 ). \n \nDurant himself already identified Davis as the league's \"next in line,\" via Pelicans.com's Jim Eichenhofer , and that praise came  before  last season. So Durant knows as well as anyone that his next challenger isn't coming —he's already here. \n    Stacy Revere/    \nBut there should be a small window between James' descent and Davis' rise for Durant to snag the title he's long coveted . And that window is open now. \n \nJames finally looked a tad human last season. He averaged fewer minutes (36.1) and missed more games (13) than ever before. His scoring average dipped lower than it had been since his debut season, and his 25.9 PER was the fourth lowest of his 12-year career. \n \nDurant looked ready to challenge James the last time both were healthy, and the Oklahoma City Thunder superstar should have even more exposure this time around. \n \nDurant will play the entire 2015-16 season under the spotlight. There are numerous compelling storylines around him: his comeback from an injury-riddled year, his upcoming free agency, his continually scrutinized relationship with Russell Westbrook, OKC's performance under first-year head coach Billy Donovan. \n \nDrawing an audience won't be an issue. Impressing said audience shouldn't be one either. \n   Who is the biggest threat to LeBron James' NBA throne?    \n\"With Durant's handle and skills, at his size, with his leadership and coachability —there's no other package like it in basketball,\" wrote CBS Sports' Ken Berger . \"As James gets older, we should be talking about when Durant overtakes him as the best player in the league.\" \n \nTruth be told, people have been talking about Durant's ascension for a while . While the stars haven't aligned just yet, this could be the year everything falls into place. \n \nJames' stranglehold on the league isn't quite as strong as it once was. Davis, as overloaded with potential as he is, could need another year or two before the public exalts him. Curry and Harden may always lack the two-way balance needed to wear the label of the NBA's best. \n \nThis is Durant's shot to leave the ranks of silver medalist and sport the gold he's been chasing for years. But his quest no longer has any margin for error. \n \nOpportunity won't knock forever. Either he answers it now and assumes his position atop the basketball world, or he risks witnessing James pass the baton to one of the budding ballers behind him. \n \nUnless otherwise noted, statistics used courtesy of NBA.com and Basketball-Reference.com . \n \nFollow @ ZachBuckleyNBA", "source": "Bleacher Report US"}