{"published": "2015-09-08T19:56:36Z", "media-type": "News", "title": "Action (20.61 ft) - Observation - PATM7 - Grand River near Pattonsburg (Missouri)", "id": "a9c11ba7-f9c4-411d-83cd-370cea5e6496", "content": "Search by city or zip code. Press enter or select the go button to submit request \n             Notice: New features, functions, and enhancements to AHPS pages as of 8/11/2015. Click here for details        \n\r Auto Refresh: OFF \r \r \n  \r          \nNOTE: River forecasts for this location take into account past precipitation and the precipitation amounts expected approximately 48 hours into the future from the forecast issuance time. \nNOTE: Forecasts for the Grand River near Pattonsburg are issued as needed during times of high water, but are not routinely available.             Flood Categories (in feet) \n Major Flood Stage:  32  Moderate Flood Stage:  30  Flood Stage:  25  Action Stage:  20  \nHistoric Crests \n(1) 40.00 ft on 08/09/1909 \n(2) 37.60 ft on 07/24/1993 \n(3) 34.27 ft on 05/08/2007 \n(4) 34.25 ft on 06/01/1947 \n(5) 33.80 ft on 09/14/1973 \nShow More Historic Crests  \n(P) : Preliminary values subject to further review. \n\nRecent Crests \n(1) 26.90 ft on 06/05/2014 \n(2) 28.60 ft on 05/28/2013 \n(3) 29.20 ft on 04/18/2013 \n(4) 27.93 ft on 06/16/2010 \n(5) 28.10 ft on 06/07/2010 \nShow More Recent Crests  \n\n(P) : Preliminary values subject to further review. \n\nLow Water Records \n(1) 1.76 ft on 07/17/1970 \n\n    \n Show FEMA's National Flood Hazard Layers  \n   \nFEMA's National Flood Hazard Layers not showing? \n  \nNote: Your zoom level may have changed. ESRI's zoom levels must be between 14 and 16 to show National Flood Hazard layers. \n       \nZoom Level:14 \n    \n  Legend   \n   \n  FEMA Layer   \n      Gauge Location    Disclaimer   Latitude/Longitude Disclaimer: The gauge location shown in the above map\n                is the approximate location based on the latitude/longitude coordinates\n                provided to the NWS by the gauge owner.      If you notice any errors in the below information, please contact our Webmaster 34.5  U.S. Highway 69 south of Pattonsburg floods. The railroad tracks near Pattonsburg are also under water.  32  The business section of old town of Pattonsburg begins to flood.  30  Nearly all agricultural land and secondary roads in the Grand River floodplain flood.  25  Low-lying farmland begins to flood.   \nLatitude: 40.025556° N,\n          Longitude: 94.126944° W,\n          Horizontal Datum:\n          NAD83/WGS84 \n  River Stage \nReference Frame  Gauge Height  Flood Stage  Uses  NWS stage  0 ft  25 ft  Interpreting hydrographs and NWS watch, warnings, and forecasts, and inundation maps  Vertical Datum  Elevation \n(gauge height = 0)  Elevation \n(gauge height = flood stage)  Elevation information source  NAVD88  Not Available  Not Available  Survey grade GPS equipment, FEMA flood plain maps, newer USGS topographic maps  NGVD 29  742.12 ft  767.12 ft  Older USGS topographic maps, NGVD29 benchmarks  MSL  Not Available  Not Available  Older USGS topographic maps, MSL benchmarks  Other  Not Available  Not Available         The National Weather Service prepares its forecasts and other services in collaboration with agencies like the US Geological Survey, US Bureau of Reclamation, US Army Corps of Engineers, Natural Resource Conservation Service, National Park Service, ALERT Users Group, Bureau of Indian Affairs, and many state and local emergency managers across the country. For details, please click here .", "source": "National Oceanic and Atmospheric Administration"}