{"published": "2015-09-25T17:34:42Z", "media-type": "Blog", "title": "Federal Court of Appeal Decision Canada (Citizenship and Immigration) v. Date 2015-09-15 Neutral citation 2015 FCA 194 File numbers A-124-15 Date: 20150915  Ishaq copy", "id": "fb44fc21-85f6-4c8e-a108-5041be4342dc", "content": "http://decisions.fca-caf.gc.ca/fca-caf/decisions/en/item/119858/index.do?r=AAAAAQAMWlVORVJBIElTSEFRAQ\nFederal Court of Appeal Decision Canada\nCase name Canada (Citizenship and Immigration) v. Ishaq\nCourt (s) Database Federal Court of Appeal Decisions\nDate 2015-09-15\nNeutral citation 2015 FCA 194\nFile numbers A-124-15\nDate: 20150915\nDocket: A-124-15\nCitation: 2015 FCA 194\nCORAM:\nTRUDEL J.A.\nWEBB J.A.\nGLEASON J.A.\nBETWEEN:\nTHE MINISTER OF CITIZENSHIP\nAND IMMIGRATION\nAppellant\nand\nZUNERA ISHAQ\nRespondent\nand\nATTORNEY GENERAL OF ONTARIO\nIntervener\nHeard at Ottawa, Ontario, on September 15, 2015.\nJudgment delivered from the Bench at Ottawa, Ontario, on September 15, 2015.\nREASONS FOR JUDGMENT OF THE COURT BY:\nGLEASON J.A.\nDate: 20150915\nDocket: A-124-15\nCitation: 2015 FCA 194\nCORAM:\nTRUDEL J.A.\nWEBB J.A.\nGLEASON J.A.\nBETWEEN:\nTHE MINISTER OF CITIZENSHIP AND IMMIGRATION\nAppellant\nand\nZUNERA ISHAQ\nRespondent\nand\nATTORNEY GENERAL OF ONTARIO\nIntervener\nREASONS FOR JUDGMENT OF THE COURT\nDelivered from the Bench at Ottawa, Ontario, on September 15, 2015.\n[1]               In the judgment under appeal, the Federal Court declared that the change in policy applicable to women who wear the niqab, that requires them to unveil to take the oath of citizenship, was unlawful. This policy change first came into effect on December 12, 2011 and was initially enshrined in Citizenship and Immigration Canada’s [CIC’s] Operational Bulletin 359. The policy change was shortly thereafter incorporated into section 6.5 of CIC’s policy manual, CP 15:Guide to Citizenship Ceremonies.\n[2]               One of the reasons given by the Federal Court for its judgment was the determination that this policy change was mandatory. The Federal Court also found that the policy change conflicted with the requirements of the Citizenship Act, R.S.C. 1985, c. C-29 and with the regulations made under that Act.\n[3]               The appellant has conceded that if we do not interfere with the Federal Court’s finding as to the mandatory nature of the policy change, this appeal must be dismissed in part because paragraph 27(1)(h) of the Citizenship Act delegates authority to make regulations regarding the taking of the oath of citizenship to the Governor in Council and this policy change was not adopted by the Governor in Council.\n[4]               While we do not necessarily agree with all the reasons given by the Federal Court, we see no basis to interfere with the Federal Court’s finding as to the mandatory nature of the impugned change in policy as this finding is overwhelmingly supported by the evidence. It follows that this appeal must be dismissed.\n[5]               We decline to address the issues concerning the legality of the impugned policy change under the Canadian Charter of Rights and Freedoms as a determination on this point is unnecessary for the disposition of this case and the record before us is fairly scant as concerns the Charter challenge. Moreover, we believe that it is in the interests of justice that we not delay in issuing our decision through the examination of an unnecessary issue so as to hopefully leave open the possibility for the respondent to obtain citizenship in time to vote in the upcoming federal election.\n[6]               As a result, the appeal will be dismissed with costs.\n“Mary J.L. Gleason”\nJ.A.\nFEDERAL COURT OF APPEAL\nNAMES OF COUNSEL AND SOLICITORS OF RECORD\nDOCKET:\nA-124-15\nSTYLE OF CAUSE:\nTHE MINISTER OF CITIZENSHIP AND IMMIGRATION v. ZUNERA ISHAQ\nPLACE OF HEARING:\nOttawa, Ontario\nDATE OF HEARING:\nSEPTEMBER 15, 2015\nREASONS FOR JUDGMENT OF THE COURT BY:\nTRUDEL J.A.\nWEBB J.A.\nGLEASON J.A.\nDELIVERED FROM THE BENCH BY:\nGLEASON J.A.\nAPPEARANCES:\nPeter Southey\nNegar Ashemi\nJulie Waldman\nFOR THE APPELLANT\nLorne Waldman\nNaseem Mithoowani\nCO-COUNSEL FOR THE RESPONDENT\nMarlys Edwardh\nDaniel Sheppard\nCO-COUNSEL FOR THE RESPONDENT\nCourtney Harris\nHaley Pitcher\nFOR THE INTERVENER\nSOLICITORS OF RECORD:\nWilliam F. Pentney\nDeputy Attorney General of Canada\nFOR THE APPELLANT\nWaldman & Associates\nToronto, Ontario\nCO-COUNSEL FOR THE RESPONDENT\nSack Goldblatt Mitchell LLP\nToronto, Ontario\nCO-COUNSEL FOR THE RESPONDENT\nMinistry of the Attorney General\nToronto, Ontario\nFOR THE INTERVENER", "source": "The  geek with a cynical view"}