{"published": "2015-09-14T11:00:00Z", "media-type": "News", "title": "ProQR Announces a Proof-of-Concept Nasal Potential Difference Study of QR-010 is Open for Enrollment", "id": "66a1c246-8adb-4b40-b3e1-3cfdb74b8cfb", "content": "LEIDEN, the Netherlands, Sept. 14, 2015 (GLOBE NEWSWIRE) -- ProQR Therapeutics N.V. ( NASDAQ:PRQR ) today announced that PQ-010-002 is open for enrollment. The primary objective of PQ-010-002 is to estimate the effect of topical administration of QR-010 on the nasal mucosa in the restoration of CFTR function, as measured by Nasal Potential Difference (NPD). PQ-010-002 is an open-label, exploratory study evaluating the effect of QR-010 in ∆F508 homozygous (carry two allelic copies) and compound heterozygous (carry one copy of the ∆F508 mutation and one other disease causing mutation) cystic fibrosis (CF) patients. QR-010 is a novel investigational RNA therapeutic designed to repair the genetic mutation in the mRNA of CF patients due to the ∆F508 mutation. \n\n\"We are excited to announce that the second clinical study of QR-010 is now open and enrolling,\" said Noreen R. Henig, MD, Chief Development Officer of ProQR. \"This study is an important proof-of-concept study that will test the activity of QR-010 in the treatment of CF. In animal models of CF, QR-010 showed the ability to restore CFTR mediated NPD to normal or wild-type levels. Repeating the same test in individuals with CF will provide an important first signal of the therapeutic potential of QR-010.\" \n   \nPQ-010-002 is a 28-day study conducted in up to 5 sites located in the US and Europe that are experienced in conducting NPD measurements. NPD is a well-accepted diagnostic test for CF and recently has been used to assess therapeutic benefit in clinical trials of investigational agents. The study will enroll at least 16 people with CF that are either homozygous or compound heterozygous for the ∆F508 mutation. NPD and sweat chloride measurements will be done before and after local treatment in the nose with QR-010 three times a week for four weeks. \n\n\"RNA-based therapeutics are a novel approach to the treatment of the gene mutations that cause CF. The preclinical nasal potential difference studies of QR-010 in the mouse models of CF are quite compelling. The proof-of-concept study of QR-010 will support the understanding of QR-010's impact on CFTR function in patients with CF with the common ∆F508 CFTR mutation,\" said John P. Clancy, Professor of Pediatrics and Research Director, Division of Pulmonary Medicine, Cincinnati Children's Hospital and a member of the Cystic Fibrosis Foundation Therapeutic Development Network's leadership team. \n\nPQ-010-002 will be conducted in parallel with PQ-010-001, the ongoing Phase 1b safety and tolerability study of QR-010 in CF patients homozygous for the ∆F508 mutation. In addition to safety and tolerability, PQ-010-001 will assess pharmacokinetics and exploratory clinical efficacy endpoints. In the Phase 1b study, QR-010 is delivered to the lungs via inhalation. \n\n\"We are very proud of our teams that have moved QR-010 from an interesting idea to two enrolling clinical studies in just three years,\" said Daniel A. de Boer, Chief Executive Officer of ProQR. \"We are committed to bringing important new therapies to patients with CF and these studies are important steps in understanding the potential of QR-010.\" \n\nAbout CF \n\nCF is a genetic disease that affects an estimated 70,000 to 100,000 patients worldwide and causes early morbidity and mortality. CF currently has no cure. The median age of death for CF patients is 27, and more than 90% of CF patients die from respiratory failure. CF is caused by mutations in the gene that encodes for a protein called cystic fibrosis transmembrane conductance regulator, or CFTR. For some patients with specific CF mutations, there are therapies available that aim to treat the basic defect of the disease. For many patients however, more efficacious medicines are needed because a substantial unmet medical need remains. The ∆F508 mutation that we are targeting is the most prevalent and is present in approximately 70% of all CF patients. In people with CF, this mutated gene and the resulting defective protein lead to the dysfunction of multiple organ systems, including the lungs, pancreas and gastrointestinal tract. In the lung airways, absence of functional CFTR protein leads to unusually thick, sticky mucus that clogs the lungs and increases vulnerability to chronic, life-threatening lung infections. \n\nAbout QR-010 \n\nQR-010 is a first-in-class RNA-based oligonucleotide designed to address the underlying cause of the disease by repairing the mRNA defect encoded by the ∆F508 mutation in the CFTR gene of CF patients. The ∆F508 mutation is a deletion of three of the coding base pairs, or nucleotides, in the CFTR gene, which results in the production of a misfolded CFTR protein that does not function normally. QR-010 is designed to bind to the defective CFTR mRNA and guide the insertion of the three missing nucleotides, thus repairing the mRNA and subsequently producing wild-type, or normal CFTR protein. QR-010 is designed to be self-administered through a small, handheld aerosol delivery device, or nebulizer, in the form of a mist inhaled into the lungs. We believe this method could allow maximum exposure of QR-010 to the primary target organ, the lung, as well as significant exposure to other affected organs through systemic absorption into the blood. QR-010 has been granted orphan drug designation in the United States and the European Union. \n\nAbout ProQR \n\nProQR Therapeutics is dedicated to changing lives through the creation of transformative RNA medicines for the treatment of severe diseases such as cystic fibrosis and Leber's congenital amaurosis. Based on our unique proprietary RNA repair platform technologies we are growing our pipeline with patients and loved ones in mind. Since 2012. \n\nForward-Looking Statements \n\nThis press release contains forward-looking statements that are made pursuant to the safe harbor provisions of the federal securities laws, including statements regarding the therapeutic potential of, and clinical development plan for, QR-010. Any express or implied statements contained in this press release that are not statements of historical fact may be deemed to be forward-looking statements. Forward-looking statements involve risks and uncertainties that could cause our actual results to differ significantly from those projected, including those risks detailed in our filings with the Securities and Exchange Commission, including our Annual Report on Form 20-F. You are cautioned not to place undue reliance on the forward-looking statements, which speak only as of the date of this release. We disclaim any obligation or undertaking to update or revise any forward-looking statements contained in this press release, other than to the extent required by law. \nProQR Therapeutics N.V.: Smital Shah Chief Financial Officer T: +1 415 231 6431 ir@proqr.com Media inquiries: Gretchen Schweitzer MacDougall Biomedical Communications Direct: +49 172 861 8540 Main: +49 89 2424 3494 gschweitzer@macbiocom.com", "source": "Good Day Sacramento"}