{"published": "2015-09-15T08:38:25Z", "media-type": "News", "title": "Clever Trevor", "id": "e606d28a-e554-4fa8-9987-0352b9e4cfb6", "content": "Bringing a few crates of common sense and experience to the tricky job of running the England cricket team, Trevor Bayliss has quietly overseen a transformative summer. The Australian talks to John Stern about adjusting to life in the other corner.  \n\n\n \nJos Buttler is sitting on a bench behind the Lord’s pavilion. While England’s wicketkeeper conducts an interview, Trevor Bayliss, who has been in the job only a matter of weeks, ambles past, a bag slung over his right shoulder, signature sunhat on head. As the England coach looks over, Buttler nonchalantly raises a hand and nods: “Trev.” \n \nTrev? Having recently been engrossed in the high-school American football drama series Friday Night Lights , your correspondent had to resist the temptation to say: “That’s Coach Bayliss to you, son.” But meeting Bayliss at the Oval two days before the final Ashes Test, it’s easy to see how Buttler and his teammates would have so quickly developed a rapport of such comfortable familiarity with their new boss. \nYou might also like  \nHe seems like the guy you’d sit next to at a wedding, chat to all evening and then on the way home forget what he said he did for a living. Understated doesn’t even cover it. He repeatedly declined his players’ exhortations to join them on the field for the on-field celebrations after the end of the Ashes. \n \nEven within the peculiar, and still evolving, parameters of the international cricket coach, he is unusual. He’s the anti-ego and the jargon-buster – the conductor of the orchestra rather than the composer of the music. \n \nHe came with a reputation for media aversion and it remains to be seen how the inevitable setbacks and the pressures of the job – remember, he left his family in Australia – change his public persona, as it did some of his predecessors. But for now, Trev’s happy to chat. \n \n*** \n \nWhat were your initial impressions of what you were taking on when you first arrived?  \n \nTo be quite honest, it was a little bit of an unknown. It was only just before the New Zealand series when I agreed to do the job. I probably wouldn’t normally even have watched the New Zealand series but I thought I’d better actually start watching these blokes play! So I watched on the TV at home in Australia. Eoin Morgan was really the only guy in either the Test or one-day side that I knew from being together at Kolkata in the IPL. That made it exciting – it was a new start, if you like, with a lot of new, younger players coming into the team. \n \nRight from the way England played against New Zealand through to the Ashes success, everything has seemed so unexpected. What was your own expectation a few months back?  \n \nWell, yeah, a couple of months ago I would have had the same view as every Australian – that if the Australians play well they’d be very difficult to beat in England. They obviously haven’t played as well and we’ve played very well but we’ve been a part of the reason why they haven’t played well. \n \nSo, you arrive at Heathrow, Andrew Strauss picks you up and then you met Alastair Cook for the first time the next day?  \n \nActually I happened to run into him at Lord’s that first day I was here. I was due to meet him the next day before we got on the plane to Spain. But he happened to be in there so I had a quick half an hour or so with him. He’s a very easy guy to get on with, lovely bloke. \n  Bayliss and his assistant Paul Farbrace have struck up a good rapport with Alastair Cook  \nIs Cook a different man to the one you bumped into at Lord’s the day you arrived in England back in June?  \n \nNo, not really. He’s a lovely guy and very easy to talk to. With Alastair what you see is what you get. The only difference between then and now is confidence. He’s got a team that’s playing well and that makes it easier to captain in a positive way. He’s taken on board his role as captain. He had a role to play in [making] the team play a more attacking or positive brand of cricket, so I think he made some changes there. \n \nSome of the players have spoken about the importance of that trip to Spain – how did it come about?  \n \nAndrew Strauss asked me what I thought about a camp before the Ashes for the players to get to know me. I obviously thought it was a good idea. He had a couple of options, somewhere here in England or Spain, to just get completely away from any distractions I suppose. It’s funny – we copped a bit of criticism at the start but now everyone thinks it was a great thing to do! \n \nAnd the slip fielding you worked on – was it about sheer volume or was there something specific?  \n \nNo, I think the volume was probably the main thing. We did chat about a couple of things, like the spacing between the slips and also trying to watch the ball a bit longer. I think it’s impossible to watch the ball all the way in because it’s moving too quickly but if you can watch it for as long as possible and maybe a bit longer than what they were, that helps. \n \nYour reputation as a player was as a very good fielder. Did that come naturally?  \n \nI played in a New South Wales team with a lot of international stars and it was difficult to stand out as a batter in that group. The one area I could compete on an even keel was in the field, so I tried to field as well as I possibly could and be the best fielder out there. I fielded mostly in the covers so there was a fair bit of running around but thankfully I don’t have to do quite as much these days! Fielding is the one area of the game where everyone is in it together and I think the way the team fields is a sign of the team’s attitude. If you’re fielding well that carries over into your batting and bowling. \n \nGiven that England’s new-found attacking attitude was clearly evident during the New Zealand series before you arrived, how did that change in mindset originate?  \n \nI think the players and the hierarchy here in England probably realised that the best teams in the world were playing a more attacking style and we were getting left behind to a certain degree. Farby [Paul Farbrace] and I spent a fair bit of time together before but you can’t play in a particular way unless the players actually want to do it. That was my only bit of advice to the guys here before I came was that it’s got a lot to do with selection: if you put the players in who will play that way naturally, then it’s going to happen naturally. It’s not a case of setting out to hit fours and sixes. It’s about having a positive mindset in defence as well. If you have that positive mindset, your feet move well, and if your feet move well, that gives you the opportunity to hit those bad balls for four or six. \n \nHas it been at all weird coaching an Ashes-winning team against your own country?  \n \nFrom a professional point of view, it’s been fantastic. I’ve got to say, the work done before I got here has gone a long way towards these players winning the Ashes. From a personal point of view, I know a lot of the Aussie boys and I know they’d be hurting. But some of the toughest battles I had at home growing up were against your mates, and you walk away after that with respect for your opposition. I’ve had some good support from some of those guys when I first got the job. \n \nHow much did your inside knowledge of some of Australia’s players contribute to winning the Ashes?  \n \nSome of our experienced players have played a lot against this Australian team so I don’t think there was anything that was terribly unknown about those players. Maybe it was more in their [Australia’s] mind or the Australian public’s mind that that was going to happen. But I think it’s more about the English boys being very confident of their roles in the team. \n  Bayliss compares notes with England football coach Roy Hodgson  \nHow are you settling into life in England?  \n \nAustralia and England are very similar so that has made it easy to fit in. The players themselves are a good bunch of guys and good fun to be around. The management and hierarchy have been fantastic. I don’t think I’ve ever been involved with a successful team that hasn’t had good, strong organisation behind it. Tom Harrison, Andrew Strauss and Colin Graves have to take a lot of credit. \n \nHad you spent much time in England before?  \n \nNo, not a lot. Only at the 2009 T20 World Cup with Sri Lanka. But I did play some league cricket up at the West of Scotland Cricket Club in Glasgow in ’89 and ’90 – only missed three games in two seasons! They were two hot summers. \n \nWhy did you get into coaching?  \n \nCricket was the only thing I’ve ever been trained to do. I was interested even when I was 16 and 17 when I coached the under 10 team in the country town where I grew up. Then towards the end of my playing career, there was an opportunity to join New South Wales cricket, first as a development officer going round schools. Then after a couple of seasons the coaching team expanded and I became the New South Wales under 19 coach and that’s where it took off. I had four or five years there, four or five years as assistant coach to Steve Rixon for New South Wales and then took over from him. \n \nWhere do your coaching inspirations come from?  \n \nI think anyone’s coaching style comes from the players you’ve played with and the coaches you’ve played underneath. I’ve been really lucky to have played with a number of good players like Mark Taylor, the Waughs, Greg Matthews, Geoff Lawson, Michael Slater, Michael Bevan… all those guys. From a coaching point of view, Bob Simpson was the coach of the state team when I first got in in the mid-80s, then Steve Rixon. All those people have played a part in the way I go about things. \n \nAre you into reading books or philosophies of other coaches?  \n \nNo, I’m not really a big book reader. I’ve said to the guys that I think the best coaches are the other 10 players in the team. If you watch how other players go about things, how they’re playing particular shots, how they’re bowling, how they prepare for the match… if you’re watching those things and asking the right questions, talking to those people, you’ll learn more about the game and more about your own game from that than you will from any coaching. \n \nWhat are you looking to improve on over the coming months?  \n \nWhile the success has been fantastic, we don’t want it to paper over the cracks. There are a few areas we have to work on and I’d like to see us find a bit more depth in spin bowling and batting as well. [Pace] bowling seems to have the biggest depth at the moment. \n \nHow important is it to have different personnel for different formats of the game?  \n \nIt’s probably only the best players who can play all formats but there’s no reason why guys can’t develop their game and step from one to the other. But as I’ve said to our guys a few times, the best players are good at all three forms and I think the absolute basics of batting don’t change from one format to the other. The best players have got a good solid base, good balance, a still head and fairly level eyes – that gives everyone the best chance to hit the ball in the middle of the bat whatever format you play. \n \nBut the schedule surely mitigates against players appearing in every game in every format?  \n \nYeah, I think there’s a certain amount of burnout. I think you’ll find in most countries now that a lot of players will have a break somewhere along the line. I think it’s just as important to be mentally fresh – probably more important – as to be physically fresh. \n \nFollow @JStern_Cricket", "source": "All Out Cricket"}