{"published": "2015-09-06T16:02:41Z", "media-type": "Blog", "title": "Imogen Heap: saviour of the music industry?", "id": "13c9fd4f-2e64-4967-be8a-149ce4b11323", "content": "When was the last time you bought a CD or a record? Chances are, you’re listening to more music than ever, but buying less of it. In 2012, for the first time, digital sales of songs – such as iTunes – surpassed physical sales. More likely still is that you were on YouTube or Spotify, which host hundreds of thousands of songs, played billions of times. It’s a golden age for music. Except plenty of musicians don’t agree. Over the last year or so, there’s been a growing public chorus of complaints from artists themselves, who have reached a tipping point of dissatisfaction about their industry. One of them, Imogen Heap, who’s “fed up of hearing herself complain”, is trying to change it instead. Heap is renowned for being inventive. She’s an award-winning songwriter and performer, having released four solo albums that have enjoyed commercial success in the UK and the US. She self-released her 2005 album Speak for Yourself long before it became popular to do so. She’s also the only female artist to have won a Grammy for engineering, and over the last six years has been designing and producing some musical gloves, along with the rest of her MiMu team, that allow the wearer to sculpt and manipulate sound on and off stage with gestures. Related: Imogen Heap: ‘I’ve just done a poll with YouGov to find out about my fans’ But these endeavours are likely to pale in comparison to her current project: to bring to life an entirely new landscape for distributing and monetising music and all its related data and content. Spurred on by the technology originally designed by libertarians to create the crypto-currency bitcoin, she’s releasing her next song, Tiny Human, as an event and an experiment. What she hopes to emerge is the core of a revolutionary system she refers to as Mycelia. It could completely transform the music industry. Music is in many ways a bellwether for the digital revolution. The products of many creative industries – art, music, books, papers, films – which were once solely physical objects, shipped, bought and carried home, are now digital files available on demand at next to no cost. Because digital files can be reproduced and shared infinitely and easily, the result in almost every industry has been more consumption and lower average returns, fuelling fears about how the people who make this stuff – the writers, artists and musicians – will get paid for it. The modern music industry was created at a time when it made economic sense to produce a million copies of one vinyl record, and copyright could be successfully enforced. But as the industry went digital, the whole way music was made and sold changed. In the early 00s, many feared the music industry would soon wither away as free streaming services and pirated content made music, de facto, free. http://www.theguardian.com/music/2015/sep/06/imogen-heap-saviour-of-music-industry\nRelated", "source": "EntertainmentNutz"}