{"published": "2015-09-18T17:37:30Z", "media-type": "News", "title": "Hyperloop Technologies Gets New CEO", "id": "c9445f07-4099-4e9b-b9b5-e8c5ec7b1c10", "content": "(Before It's News)  \n\n\n \nTransportation is a $154 trillion dollar business. Who wouldn’t want a piece of that? Moving people and things around the world is at the very core of the globalization economic model. But the way we do it harks back to the last century, if not the one before. \n \nElon Musk first proposed a new way of doing things 2 years ago when he suggested that moving people through a partial vacuum tunnel could be done at high speed and for minimal cost. That idea has spawned two new companies committed to bringing Musk’s idea to fruition — Hyperloop Technologies (HT) and Hyperloop Transportation Technologies (HHT). \n \n\n \nElon is not involved in Hyperloop Technologies . The Los Angeles based company was co-founded by former SpaceX engineer Brogan BamBrogan and early Uber investor Shervin Pishevar.  They now serve as chief technology officer and board chairman, respectively. This week, the company  announced it has hired a new CEO to drive the company forward. He is former Cisco president Robert Lloyd, who left the company in June after being passed over for promotion to CEO. He was with Cisco for 20 years, where he helped develop the technology that became the backbone of the internet. \n \nLloyd told CNBC’s The Squawk On The Street  he is excited about the opportunity to  transform transportation. “The engineering is a certainty,” he said. “This is going to be about execution and turning Hyperloop into a reality.” Hyperloop Technologies is currently raising money to build a two-mile test track, which Lloyd said should be completed in late 2016 or early 2017. The company is working on the tube design and manufacturing process, as well as the levitation technology for the system. It plans to use the Hyperloop not only to move people but also for high speed cargo delivery. \n \nAnyone who has flown commercial recently is well aware of the drawbacks associated with air travel. While the airlines are making record profits, the travel experience is more like a cattle call than something to be enjoyed. Aside from the hassle of getting through security, uncooperative weather systems often play havoc with travel plans. By contrast, the thought of zipping along at 800 miles an hour inside a depressurized tube, isolated from nature’s extremes, sounds quite appealing. \n \n\n \n“There seems to be global movement getting behind this construct,” Lloyd says. “We think the public wants it. We think the public is tired of having an antiquated transportation system that’s based on technologies that were invented a century ago.” He went on to say, “We’re living in an on-demand economy, but the backbone of this economy has to keep up, and Hyperloop is in the process of building that new transportation backbone.” \n \nThe technological challenges presented by the Hyperloop concept are staggering. It might be a little early to reserve your seat just yet, but people scoffed at Wilbur and Orville, too. We probably won’t know for a few decades how this will all turn out. \n \n[embedded content] \n \nThe post appeared first on TESLARATI.com .", "source": "Before It's News"}