{"published": "2015-09-22T21:21:07Z", "media-type": "News", "title": "Volunteers Go Above and Beyond for JA", "id": "74756e32-b15f-4b5f-a5c0-34b088f40117", "content": "On Thursday, September 17, Junior Achievement of Chicago (JA) awarded Dr. Fran Brady, Director of Careers at the Leyden High Schools, District 212, and Bob Curtis, a retiree formally of Associated Bank, the Above and Beyond Award. This award is given to JA supporters that have added extraordinary value to the organization. \n\nDr. Brady has been a partner for Junior Achievement of Chicago for 29 years. In her time with JA, she has envisioned, implemented and delivered numerous JA programs to her students at East Leyden High School in Franklin Park and West Leyden High School in Northlake. Since 2001, she has organized JA programming to 56,346 students in 2,249 classrooms between both East and West Leyden High Schools. \n \nPeter Truschke, VP of Operations for JA, says, \"Fran has been a vocal advocate and loyal friend to Junior Achievement.  Fran is a wonderful and caring teacher who wants the best for her students.  Her experience in education and event management is evident through the innovative events and initiatives she sets forth at the schools.\" \n\nCurtis has been involved with Junior Achievement for nearly 30 years. He joined the JA Suburban Cook County Board in 1996 and served both as a board member and volunteer in that area until 2003.  In 2004 Bob transitioned to the Northern Division Board in Lake & McHenry Counties where he has been an active volunteer and board member through the years. \n \nTruschke states, \"When most people retire, they often take a step back and relax. Bob has not been one to sit back and relax, since his retirement, his participation and support of JA has increased substantially.  Bob has become more involved with JA and our students and staff, and last year was a great example of Bob's dedication to our organization.\" \n\nAbout Junior Achievement of Chicago \nJunior Achievement is the world's largest organization dedicated to giving young people the knowledge and skills they need to own their economic success, plan for their future, and make smart academic and economic choices. JA programs are delivered by corporate and community volunteers, and provide relevant, hands-on experiences that give students from kindergarten through high school knowledge and skills in financial literacy, work readiness, and entrepreneurship. This year, JA of Chicago celebrated its 75th Anniversary by reaching over 538,000 students in 12 counties through Take Your Work to Kids Day ™. Visit www.jachicago.org for more information. \n\nThis item was posted by a community contributor. To read more about community contributors, click here .", "source": "Chicago Tribune"}