{"published": "2015-09-23T15:06:26Z", "media-type": "Blog", "title": "Arsenal: Arsene Wenger ends relationship speculation by splitting from wife", "id": "60b24099-b3df-461c-af4b-ccde8acb396e", "content": "Arsenal coach  Arsene Wenger and his partner Annie are understood to have completed their separation. \n\nAccording to the Mirror , the pair have divided their assets, agreed on a financial package and intend on going their separate ways. \n\nThe tabloid report that court papers have been filed in Strasbourg, the manager’s birthplace and the closest city to Duttlenheim, the village where the coach was raised. The documents apparently indicate that the 65-year-old manager and his partner, 59, have not been together since the beginning of the summer. \n\nWhile not a full divorce, the papers—a ‘separe du corps—represent a legal separation. \n\nThe report adds that the couple have not been pictured together since 2013, and note that the coach has previously confessed that the pressure of running the London giants has placed strain on his relationship. \n\nBack in 2008, as quoted by the Mirror, Wenger revealed a promise he had made to his wife to one day quit football in order to dedicate more time to their relationship. \n\n“Ten years ago I said to my wife [Annie], ‘Five more years and that’s all’, and I am still here. \n\n“It is difficult to find time to see them but there are jobs [which are worse]. You have guys who leave for work on Monday and come back on Friday. \n\n“In my job I travel, but the problem is not so much the quantity of time you spend with your family, it is the quality. \n\nSEE MORE: \n Boost for Everton as Liverpool striker is injury doubt for Merseyside derby \n Tottenham set to win race to sign Arsenal & Chelsea striker target this January \n Chelsea target responds to talk of Blues interest: Serie A defender on Jose Mourinho’s shopping list \n\n“That is where this job is more damaging. You do not always give them the quality they deserve when you are at home because you are thinking of the next game. \n\n“My wife likes watching football, she watches all the games of Arsenal at home. She is not a fanatic but she likes watching sports. No, she does not have much choice.” \n\nThe couple have an 18-year-old daughter together, and were married in December 2010. \n\nWenger is not the first manager to acknowledge the fact that a full-time role as a manager is hard to combine alongside a committed and dedicated family life. \n\nWhen Sir Alex Ferguson left Manchester United and retired from football, he admitted that his duty of supporting his wife, particularly following the death of her sister, was not something he could easily do alongside his responsibilities at Old Trafford [ Express ]. \n\nThe post Arsenal: Arsene Wenger ends relationship speculation by splitting from wife appeared first on CaughtOffside .", "source": "CaughtOffside"}