{"published": "2015-09-01T15:03:18Z", "media-type": "Blog", "title": "Borgnine Group Comrade Emmy Nominated Actor Michael Paul Chan Loved Xocai Vegan Chocolate Peanut Butter Cup and Praises for Newberg Oregon", "id": "adbb4ef8-f331-4dd1-816e-5ee7fee0b555", "content": "Michael Paul Chan (born June 26, 1950) is an American television and film actor. He is known for his celebrated role as Lieutenant Michael Tao on the TNT series The Closer and Major Crimes. Chan was born in San Francisco, California. His television work has included roles like Judge Lionel Ping on Arrested Development, Detective Ron Lu on Robbery Homicide Division, the voice of Jimmy Ho on The PJ’s, Mr. Chong on The Wonder Years, a Japanese investor in the 1990 Northern Exposure episode “Dreams, Schemes and Putting Greens”, an agent of the C.I.A. (Chinese Intelligence Agency) on a 2011 episode of The Simpsons, and roles on shows like Bones, Babylon 5, and Young and the Restless. \n \nOne of his well-liked film roles was as the convenience store owner in the 1993 film Falling Down, where he refused to give a discount to Michael Douglas’ character when he attempted to purchase a can of soda to get change for the pay telephone outside the store. Another was as Data’s father in The Goonies. He appeared in both of Joel Schumacher’s noteworthy Batman movies, in two different roles: a Wayne Enterprises executive in Batman Forever, and Dr. Lee in Batman & Robin. Other popular films in his filmography include Americanese, Megiddo: The Omega Code 2, U.S. Marshals, Spy Game, Quicksilver, The Joy Luck Club and The Insider.  Chan, a third-generation Chinese American, is a founding member of the Asian American Theater Company. He is married with one child. (Bio courtesy of Wikipedia.) \n \nNancee Borgnine : The daughter of Oscar-winning actor, Ernest Borgnine, Nancee Borgnine has grown up in the most popular world of motion pictures and television. \n \nStarting out as a intriguing actor’s agent managing the careers of over 150 prominent performers, Nancee soon spread her wings to work as a film producer, casting director and production manager. During her years in production, she branched out and created a beverage – “Borgnine’s Coffee Soda” – which quickly found its way to the shelves of retail outlets around the globe. It was in the manufacture and production of her product that Nancee entered the world of public relations and marketing – singlehandedly managing all vital aspects of bringing her successful product to the public. For the past decade, she has utilized her extensive background as a highly regarded entrepreneur and distinctive Hollywood insider to produce special events and celebrity-gifting suites that enable companies of all sizes to put their products into the hands of today’s most popular stars. \n \n The Borgnine Emmy Celebrity Gala : The Borgnine Primetime Emmy Event hosts current nominees to attend their annual EMMY event in addition to past nominees and winners. Some of the extraordinary celebrities who come to our events include Emmy nominee: Joe Mantagena (Criminal Minds), Hector Elizondo (Last Man Standing, Pretty Woman), Gage Golightly (Teen Wolf), Julie Bowen, Ashley Argota (Nickelodeon), Emmy nominated Tony Dennison, Emmy Winner Ed Asner, Monica Potter, in addition to members of the cast of Big Bang Theory, Agents of S.H.I.E.L.D., Modern Family, Criminal Minds, Parenthood, The Middle, Burn Notice, The Goldbergs, etc. The Borgnine Group only accepts the best-of-the-best sponsors. We have noteworthy celebrities from all facets of the entertainment industry who come to our events knowing that they will be seeing and receiving all kinds of exciting products. Some of the companies who have been a part of our events are: MXI Corp, Xocai Healthy Chocolate & XO-Lifestyle-Worldwide . \n \n Naomi Howison is a high-ranking leader and executive with XO Lifestyle Worldwide (formerly MXI Corp and Xocai Healthy Chocolate). She spends most of her time in Southern California, near the beach, when she is not home in Texas. Naomi has raised 3 marvelous children as a single parent and they have blessed her with 5 precious grandchildren that fill her life with joy. XO Lifestyle Worldwide (Xocai) has made it possible for me to help motivate others to reach their goals. “I’m enjoying life and having fun living my dream of owning my own outstanding business … Having my own direct sales business gives me financial and time-freedom,” says Naomi. Naomi’s goal is to help you get healthy through (1) Xocai raw chocolate, (2) Xophoria anti-aging skin care and (3) SkinHealix cosmeceutical treatments. Let’s Connect Today! \n \nCall Naomi Right Now for Product Discounts: 805-823-4811 \nEmail Naomi Today for More Information: purechocolate@me.com \n \nWatch an Emmy nominee try our XO Xocai Healthy Chocolate: \n \n \n \nJoin TEAMX88 today! \n \nI am Lynn Hackworth, and I am a Newberg-based Xocai artisan chocolate distributor. I joined Xocai in February 2011. I sell the industry-leading nugget/omega squares and omega squares online and in Newberg, Portland, Lake Oswego, and Mcminnville. Our valued Portland customers recommend omega squares because omega squares allows me to share a wonderful product for a healthy lifestyle.. \n \nTEAMX88 is also a fantastic nugget/omega squares home-based business in the Portland area. Oregon entrepreneurs can supplement their income by cashing in on a high-demand Oregon healthy artisan chocolate market. To learn more about TEAMX88, visit http://mxi.myvoffice.com/nutritiouschocolateforlife/index.html. \n \nCall me at 503-537-4426 to own your own nugget/omega squares business in Newberg, Portland, Lake Oswego, or Mcminnville.", "source": "Nutritious Chocolate For Life"}