{"published": "2015-09-09T18:30:07Z", "media-type": "Blog", "title": "Blue Wahoos named Southern League Organization of the Year", "id": "c5fd8096-685d-4bc7-9e8b-1f37e4c69f03", "content": "Also Tommy Thrall, Ray Sayre and Dan Shugart honored. \n \nPress release: The Southern League of Professional Baseball Clubs has announced the Pensacola Blue Wahoos as the Don Mincher Organization of the Year. Votes for both awards were received from league general managers. \n \nSince joining the Southern League in 2012, the Pensacola Blue Wahoos have produced an unmatched experience in baseball. Recently chosen as the “Best View in MiLB,” the Blue Wahoos organization prides itself on outstanding service to its loyal fanbase. In less than four years from its inception, Pensacola Bayfront Stadium saw its millionth fan walk through the turnstiles on Friday, May 8 of this year. \n \nBefore the season started, the Blue Wahoos welcomed a new member to its ownership group when two-time Masters Champion Bubba Watson joined Quint and Rishy Studer at the helm of the franchise. Watson made multiple appearances in Pensacola this season, only adding to the fan experience when he jumped on a dunk tank to support local charity. The Blue Wahoos have fully ingrained itself with the local community and have provided the springboard to grow the downtown Pensacola area into a popular destination. \n \nNamed in honor of the late Don Mincher, who served as Southern League President from 2000-11, the Organization of the Year is awarded to the Southern League club exemplifying the complete baseball franchise. By claiming this honor, Pensacola will be the Southern League’s nominee for the John H. Johnson President’s Trophy, which will be presented at the Baseball Winter Meetings in December. Pensacola previously won this award in 2012. \n \nTommy Thrall has been named the Radio Broadcaster of the Year , as selected by his peers and the League’s general managers. Thrall, who has eased listeners with his conversational tone, vivid descriptions and keeps our listeners up-to-date of former Blue Wahoos in the Major Leagues, has been with the team since its inaugural 2012 season. Besides calling games on a daily basis, the Northwest Missouri State University grad, serves as the play-by-play announcer for Blue Wahoos television games on Cox Sports Television. \n \nRay Sayre, Director of Sports Turf Management for the Blue Wahoos, is this year’s Groundskeeper of the Year , as selected by the league’s field managers and umpires. He won this honor in 2014 and 2013. Sayre has been with the Wahoos since the team’s inaugural season. Growing up in Lexington, Kentucky, he began his turf career working on the athletic fields for the University of Kentucky. Before making the move to Pensacola, Sayre worked for several minor league teams including the Louisville Bats, the Greenville Drive and the Bowling Green Hotrods. \n \nDan Shugart, Sports Director at WEAR-TV, is honored with the Southern League’s Sports Media Award. Covering the team since the inaugural season, Shugart and WEAR constantly covers games, events and offseason activities to produce year round coverage in Pensacola. He continues to go over and beyond in his coverage of the team and league by producing stories to show the positive impact of the Blue Wahoos in the community. Shugart is such a staple in the community that the Wahoos organization help a Dan Shugart bobblehead night in 2014 with his signature mustache wiggling on the figurine. \n \nWinning these awards represents the latest in a growing list of accolades for the Blue Wahoos. The 2012 the team was named the Southern League Organization of the Year, Ballpark Digest’s Organization of the Year, Ballpark of the Year by Baseballparks.com and Bruce Baldwin being named Jimmy Bragan Executive of the Year. In 2013 the team was named Stadium Journey’s Best Minor League Ballpark Experience and the Southern League Southern League Community Service Award and Groundskeeper of the Year. In 2014 the team was again awarded Southern League Groundskeeper of the Year and Stadium Journey’s Best Overall Ballpark Experience Runner-Up. \n \n2015 Southern League Awards \nDon Mincher Organization of the Year: Pensacola Blue Wahoos \nRadio Broadcaster of the Year: Tommy Thrall \nGroundskeeper of the Year: Ray Sayre \nSports Media Award: Dan Shugart, WEAR \nJimmy Brogan Executive of the Year: Brian Cox, Tennessee Smokies \nWoman of Excellence Award: Lauren Chesney, Tennessee Smokies \nOutstanding Employee of the Year: Jim Bishop, Mississippi Braves \nSouthern League Promotion Trophy: Mississippi Braves \nSouthern League Community Service Award: Jackson Generals \nBest Visiting Clubhouse Attendant: Nathan Edwards & Terry Fellows, Montgomery Biscuits \nTrainer of the Year: Shane Nelson, Tennessee Smokies \n \nThe Blue Wahoos are heading into the playoffs for the first time in team history! Don’t miss your chance to experience family-fun entertainment with the Pensacola Blue Wahoos! You can follow the team at BlueWahoos.com , facebook.com/PensacolaBlueWahoos and twitter.com/BlueWahoosBBall .", "source": "Rick's Blog"}