{"published": "2015-09-18T17:22:00Z", "media-type": "News", "title": "Tullamore D.E.W. Irish Whiskey and William Grant & Sons to Offer Rugby Fans Across the U.S. Ways to Celebrate Rugby World Cup 2015", "id": "b201b242-719b-4536-8a08-11adf0968a52", "content": "NEW YORK , Sept. 18, 2015 /PRNewswire/ -- Tullamore D.E.W. Irish Whiskey, one of the world's fastest growing Irish whiskeys, today announces its plans to engage Rugby fans nationwide with an integrated communications and events campaign to run during Rugby World Cup 2015 ( September 18 th to October 31 st ). The U.S. activations mark the first time that Tullamore D.E.W. has been part of an internationally televised sporting event and are connected to a larger global undertaking by William Grant & Sons as the Official Spirits & Champagne Tournament Provider of Rugby World Cup 2015. \n\nAs part of the U.S. campaign, fans over 21 can participate in The Tullamore D.E.W. Game Face Yourself Sweepstakes through a custom face paint website, where fans can customize a photo of themselves to display team pride and enter for the chance to win a once in a lifetime opportunity to attend Rugby World Cup 2015 Final ( www.GameFaceYourself.com ). Tullamore D.E.W. will also help fans root for their team of choice through several events in true Irish spirit: among friends, sharing a drink. Overall, the partnership with Rugby World Cup 2015 will explore the strong camaraderie and social traditions at the heart of the sport, which offer a natural moment to enjoy the triple blend, triple-distilled smooth character of Tullamore D.E.W. \n   \nOn key Tournament match days, Tullamore D.E.W. will host large-scale pop-up fan zones in Denver ( Sept. 27 th ) and New York ( Oct. 7 th ). Hundreds of rugby fans will have the opportunity to watch the matches and sample whiskey in Tullamore D.E.W.'s custom Daniel E. Williams Snug, an immersive brand experience that mimics the classic cozy Irish snug commonly found in pubs, where loyal patrons enjoy their whiskey in semi-privacy. Through these fan zones and several watch parties at bars across the nation, Tullamore D.E.W. has selected the Challenged Athletes Foundation (CAF) ( www.challengedathletes.org ) as their beneficiary to raise money in support of their grant program, which assists athletes with physical challenges by providing adaptive sports equipment that gives them the same freedom to enjoy sports as everyone else. \n\nCindy Wang , Senior Brand Manager, Tullamore D.E.W., comments: \"Tullamore D.E.W. is excited to align with Rugby World Cup 2015 to celebrate a highly social sport that strengthens bonds and draws people in – values that are at the heart of our brand. We're looking forward to engaging thousands of rugby fans with Tullamore D.E.W. through one of the world's greatest sporting events.\" \n\nOn target to be the biggest and most viewed Rugby World Cup to date, engaging new and existing audiences, this showcase event is set to deliver an unparalleled platform to project the sport and its unifying values – integrity, solidarity, and passion – which are a perfect complement to Tullamore D.E.W.'s dedication to the celebration of true character. \n\nWorld Rugby Chief Executive Brett Gosper said: \"We are delighted that Tullamore D.E.W. will represent Rugby World Cup 2015 on behalf of William Grant & Sons in the U.S., a country that has seen rapid growth in the popularity of rugby. We are pleased to partner with a brand with likeminded values and dedication to showcasing the spirit of the sport during its most important competition.\" \n\nAbout Tullamore D.E.W. \nTullamore D.E.W. is the second largest Irish whiskey in the world in the fastest growing category. It has been widely acclaimed by whiskey connoisseurs, most recently winning a Gold Medal at the 2014 International Spirits Challenge for Tullamore D.E.W. Original. Additionally Tullamore D.E.W. 10 Year Single Malt won the Chairman's Trophy (highest award) for best Single Malt Irish Whiskey at the 2013 Ultimate Spirits Competition and Tullamore D.E.W. 12 Year Old Special Reserve won the Double Gold Medal at the 2013 San Francisco World Spirits Competition. \n\nWith an intriguing smooth yet complex character, Tullamore D.E.W. is triple distilled, but is also a unique blend of all three types of Irish whiskeys; the pot still, malt and grain whiskeys. As a result, Tullamore D.E.W. is three times smoother with an added gentle complexity. Tullamore D.E.W. was the first and remains one of the few international Irish whiskey to pioneer this blend of three. \n\nCreated in 1829, the brand's strong heritage started in Tullamore, a town in the heart of Ireland , and was fostered by the vision of an early founder Daniel E. Williams , whose initials live on the bottle to this day. True to its heritage, a new distillery is now being built in the town of Tullamore to bringing Tullamore D.E.W. back to its roots. \n\nTullamore D.E.W. is best enjoyed to taste, but we recommend neat, on the rocks or served long with ginger beer, fresh lime juice and a dash of bitters in a Tullamore Irish Mule. \n\nAbout Rugby World Cup 2015 \nRugby World Cup is the financial engine behind unprecedented investment and growth in rugby worldwide. The net Rugby World Cup surplus from the commercial success of France 2007 and New Zealand 2011 has enabled World Rugby to invest more than £150 million in the game between 2009 and 2012 and commit an anticipated injection of more than £180 million between 2013 and 2016 to underwrite a large range of major funding initiatives including annual national union grants and strategic investments focusing on growing participation and increasing competition across all 120 national member unions affiliated to World Rugby. \n\nAbout William Grant & Sons \nWilliam Grant & Sons, Ltd. is an independent family-owned distiller headquartered in the United Kingdom and founded by William Grant in 1887. Today, the luxury spirits company is run by the fifth generation of his family and distills some of the world's leading brands of Scotch whisky, including the world's most awarded single malt Glenfiddich®, The Balvenie® range of handcrafted single malts and the world's third largest blended Scotch Grant's® along with iconic premium spirits brands Hendrick's® Gin, Sailor Jerry® Rum, Tullamore D.E.W. Irish Whiskey and Milagro® Tequila. \n\nWilliam Grant & Sons has been honored as \"Distiller of the Year\" by the prestigious International Wine & Spirit Competition and International Spirits Challenge eleven times over the past 15 years, and most recently named \"International Spirits Producer of the Year\" by the IWSC in 2014. \n\nFounded in 1964, William Grant & Sons USA is a wholly-owned subsidiary of William Grant & Sons, Ltd. and features one of the fastest growing spirits portfolios in the USA with brands including Glenfiddich, The Balvenie, Hendrick's Gin, Sailor Jerry Rum, Tullamore D.E.W. Irish Whiskey, Milagro Tequila, Flor de Cana , Drambuie, Grant's, Hudson Whiskey, Gibson's Finest, Monkey Shoulder, Clan MacGregor, Reyka Vodka, Solerno Blood Orange Liqueur, Montelobos Mezcal, Ancho Reyes Chile Liqueur, Lillet, Art In The Age, The Knot, and Raynal French Brandy . For more information on the company and its brands, please visit www.grantusa.com . \n\nAbout Challenged Athletes Foundation \nThe Challenged Athletes Foundation® (CAF) is a world leader in helping people with physical challenges lead active, healthy lifestyles. CAF believes that participation in physical activity at any level increases self-esteem, encourages independence and enhances quality of life.  Since 1994, more than $67 million has been raised and over 11,000 funding requests from people with physical challenges in all 50 states and dozens of countries have been satisfied. Additionally, CAF's outreach efforts reach another 60,000 individuals each year. Whether it's a $2,500 grant for a handcycle, helping underwrite a carbon fiber running foot not covered by insurance, or arranging enthusiastic encouragement from a mentor who has triumphed over a similar challenge, CAF's mission is clear: give opportunities and support to those with the desire to live active, athletic lifestyles. To learn more, visit challengedathletes.org or call 858-866-0959. \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/tullamore-dew-irish-whiskey-and-william-grant--sons-to-offer-rugby-fans-across-the-us-ways-to-celebrate-rugby-world-cup-2015-300145674.html \n\nSOURCE  Tullamore D.E.W.", "source": "MoneyShow.com"}