{"published": "2015-09-12T04:58:10Z", "media-type": "News", "title": "Attendance up at Lawrence Welk homestead after state takes over", "id": "d4ace2b1-a85e-44bb-8e5a-981ae90f2113", "content": "Diane Rogness, historic sites manager for the State Historical Society, said about 730 people visited the 6-acre homestead near Strasburg during the past two calendar months. \n\nThe birthplace of the “King of Champagne Music” is open Thursday-Sunday from Memorial Day weekend to Labor Day. About 650 people signed the guestbook last year at the site, which is on the National Register of Historic Places. \n\nRogness said she didn’t have 2015 attendance figures for the weeks before the state took over or for the first week of September, but she was pleased with the jump in visitors, which she attributed to extensive media coverage. \n\n“It was in the news a lot,” she said. \n\nState lawmakers appropriated $100,000 in 2013 to buy the site, requiring that certain repairs be made first. The State Historical Board decided in a contentious 6-5 vote in January 2014 to buy the property, which had been on the market for about 2½ years. \n\nThe site made news again last spring when lawmakers debated whether to provide operating funds, ultimately voting in April to provide $100,000 for the 2015-17 biennium. Still, purchase negotiations between the state and Welk’s family dragged on into June. \n\nEdna Schwab, one of Welk’s two nieces who gave tours of the site for 25 years before the state took over, said she didn’t want to criticize the state but has heard complaints and witnessed firsthand during a visit last month that the site’s focus has shifted away from the history of her uncle, who died in 1992 at age 89. \n\n“Now, when they come, it’s not what it was,” she said. “So I think to some people it’s disappointing.” \n\nRogness said the state has expanded the site’s storyline for visitors, highlighting not only Welk but also the history of Germans from Russia who settled the area and pioneer farming and homesteading. \n\nThe state took input this summer during the Tri-County Tourism Alliance’s monthly meetings in Ashley, Napoleon and Strasberg, and during a Germans from Russia international conference in Bismarck in July, on what locals want to see in the site, Rogness said. \n\n“I have enough ideas to keep me busy for the next 10 years,” she said. \n\nIn addition to the house built in 1899, the site features asummer kitchen, outhouse, blacksmith shop, granary and a barn moved onto the property in about 1949. Welk left the farm at age 21 to pursue a music career, rising to host “The Lawrence Welk Show” on ABC from 1955 until 1971. \n\nAdmission is $5 for adults; $3 for children 6-15; those 5 and under get in free. \n\nVisitors are “mostly adults 60-ish or older” but include some young families, as well, said Rogness, who ran the site with the help of a couple volunteer and paid staffers. \n\nOne tourist last week was a woman from Florida who was working close to the North Dakota-South Dakota state line, and earlier this summer a man from Boston attending a legislative conference in Bismarck made the 75-mile trek to the site, Rogness said. \n\n“And he was pretty taken, because he said this is so different from Boston,” she said. \n\nRogness said she would like to see annual attendance top 1,000 people, but she thinks it will take five to seven years for that to happen, with the help of additional programming and cross-promotion. She hopes to have two to three state employees working there next year. \n\nSchwab suggested employees be required to read Welk’s autobiography, “Wunnerful, Wunnerful!” and said he’s hoping for the best. \n\n“I hope that it’s kept up to the point where people get something out of it when they do come,” she said.", "source": "Grand Forks Herald"}