{"published": "2015-09-28T07:00:45Z", "media-type": "News", "title": "Breen has funding cut from Athletics Australia", "id": "a85bb8ab-f1d2-46e0-ba18-570c36c588a3", "content": "Canberra sprinter Melissa Breen has paid the price for a poor world championships by having her funding cut from Athletics Australia. \n\nAustralia's fastest woman in history over 100 metres, the 25-year-old was left off the National Athlete Support Structure membership program on Monday. \n\nBreen was a late addition to the program last year after she broke Melinda Gainsford-Taylor's 20-year-old national record in the women's 100m with a time of 11.11 seconds. \n\nBut Breen has struggled to carry that form to the world stage and has missed out on the semi-finals four times in a row. \n\nThe final straw was when she finished second-last in her heat at this year's world championships with a disappointing time of 11.61 seconds. \n\nAthletics Australia high performance director Simon Nathan said it was the selection committee's decision that Breen was unlikely to achieve the program's goals of reaching the top eight at a world championships or Olympic Games. \n\n\"She's done everything she can do and been professional and done all the right things, but the outcomes and the actual results at the championships are such that we can't see her making that top eight in the future,\" Nathan said. \n\n\"That's why we took her off the program and it lets us support someone else. \n\n\"There isn't anybody who tries harder on the team or is more dedicated to training, but what she is unable to do is get that out at the big championships. \n\n\"It's a competitive group and she's struggling to get out of the first round.\" \n\nBreen will still receive partial funding after being included in the Gold Coast GOLD Relay Program designed to support relay squads ahead of the 2018 Commonwealth Games on the Gold Coast. She also has a scholarship with ACTAS. \n\nBreen's training partner Lauren Wells, middle-distance runner Zoe Buckman and javelin thrower Kelsey-Lee Roberts have been included in the Podium Potential category. \n\nIt is the second-tier of funding that includes 42 of the 72 athletes who are in the NASS program. \n\nBreen has admitted she made a mistake in training in Canberra ahead of the world championships instead of competing overseas. \n\nNathan said her preparation didn't factor into the funding decision. \n\n\"She tried something different and whether she would do it again, I don't know,\" Nathan said. \"Unless you try, you don't know. \n\n\"It's the championship results and the outcomes in that environment that we are making our assessments on.\"", "source": "Good Fruit & Vegetables Magazine"}