{"published": "2015-09-16T02:30:00Z", "media-type": "News", "title": "FOOTBALL: Edwardsville drops to No. 6 in poll", "id": "a520d745-b876-4bb9-b79d-ad579309c7fb", "content": "Despite remaining undefeated with a 33-7 victory over Collinsville to open Southwestern Conference action, the Edwardsville football team dropped from a fifth-place tie with Barrington to No. 6 in the latest Class 8A state poll. \n  \nThe Tigers (3-0) received 54 voting points, two points behind fifth-ranked Barrington, which is also 3-0 after defeating Elk Grove Village 42-18. The Broncos also own wins over Glenbrook South, 50-23, and Hersey Arlington Heights, 46-17. \n \nHomewood-Flossmoor remains the state’s top-ranked team in Class 8A. The Vikings (3-0) received nine of the 10 first-place votes after defeating Palos Hills Stagg 67-6. \n \nWilmette Loyola Academy, now 3-0 after beating Chicago Brother Rice 28-0, is ranked No. 2 and received the other first-place vote. \n \nNaperville Central (3-0) and defending state champion Stevenson (3-0) remain No. 3 and No. 4, respectively. \n \nAfter Barrington and Edwardsville, Hinsdale Central at No. 7, Oak Park-River Forest at No. 8, Winnetka New Trier at No. 9 and Lyons at No. 10 round out the pool. Lyons is the newcomer to the pool, taking the spot of Chicago Brother Rice, which lost to Wilmette Loyola Academy. \n \nThe Tigers return to action at O’Fallon at 7 p.m. Friday. \n \nIn Class 7A, the East St. Louis Flyers, at 2-1, remain at No. 4 after defeating Alton 56-0 to go to 3-0. \n \nGlenbard West, again, is No. 1 with eight of the 11 first-place votes and a 3-0 record. Chicago Mount Carmel and Libertyville are Nos. 2 and 3, respectively, for a second straight week. \n \nEdwardsville and East St. Louis are the only two SWC schools in the pools this week. The two teams face each other in Week 6 on Friday, Oct. 2, at 7 p.m. at East St. Louis. \n \nTriad remains at No. 9 in the Class 5A poll. The 3-0 Knights are coming off a 14-12 victory over Mount Vernon. \n \nHighland makes it debut at No. 10, only three points behind Triad. The Bulldogs, who are 3-0, \n \nBelleville Althoff, meanwhile, remains at No. 4 in the Class 4A poll. The Crusaders, who defeated Breese Mater Dei 61-41, earned one of the 15 first-place votes. \n \nRochester, at 3-0, has 13 of those first-place votes and sits atop the Class 4A poll. \n \nColumbia is still No. 8 in the latest poll. The Eagles are coming off a 48-8 victory over Dupo. \n \nClass 8A Poll \n \n1. Homewood-Flossmoor 3-0 \n \n2. Wilmette Loyola 3-0 \n \n3. Naperville Central 3-0 \n \n4. Stevenson 2-1 \n \n5. Barrington 3-0 \n \n6. Edwardsville 3-0 \n \n7. Hinsdale Central 3-0 \n \n8. Oak Park-River Forest 3-0 \n \n9. Winnetka New Trier 2-0 \n \n10. Lyons3-0 \n \nRanked teams from the area \n \n• East St. Louis at No. 4 in 7A \n \n• Triad at No. 9 in 5A \n \n• Highland at No. 10 in 5A \n \n• Althoff at No. 4 in 4A \n \n• Columbia at No. 8 in 4A \n   \n© 2015 The Edwardsville Intelligencer . All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "source": "Edwardsville Intelligencer"}