{"published": "2015-09-30T22:11:00Z", "media-type": "News", "title": "Lighting Science Expands Revolutionary Sleep Solutions via Mediaplanet’s “Sleep Sensitivity” Campaign", "id": "18b0a17d-0102-4966-baf7-d79e84838508", "content": "Mediaplanet today announced the distribution of its second \n      cross-platform edition of “Sleep Sensitivity” in partnership with \n      Lighting Science. This campaign will clarify the preventative measures \n      one can take to improve sleep quality. Studies show that 62%  of \n      American adults experience trouble sleeping at least a few nights per \n      week, which can have serious effects on a person’s health, but this \n      potential health issue can go completely untreated for years. \n\nThis Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20150930006887/en/ \n   \nGood Night LED Light by Lighting Science Group (Photo: Business Wire) \n\nThe print component of “Sleep Sensitivity” is distributed within today’s \n      edition of USA Today in New York, Los Angeles, Washington \n      DC/Baltimore, with a circulation of approximately 250,000 copies and an \n      estimated readership of 750,000. The digital component is distributed \n      nationally through a vast social media strategy and across a network of \n      top news sites and partner outlets. To explore the digital version of \n      the campaign,  click \n      here . This is the first time Lighting Science has initiated a \n      consumer-targeted ad campaign for its biological series of products, and \n      has included a code (“SleepToday”) that grants 20% off their “Good Night \n      Bulb” when the code is entered on the Lighting \n      Science website . \n\nThis edition of “Sleep Sensitivity” was made possible with the support \n      of Lighting Science, a company inventing breakthrough health-focused LED \n      lighting solutions. The company's biologically-corrected lighting \n      technology was first designed for NASA to help astronauts sleep better, \n      but it can also dramatically improve sleep for infants, new parents, and \n      almost everyone in between here on earth. Recently featured on the cover \n      of The New York Times ’ Business \n      Day and on Tanya Rivero of the Wall Street Journal ’s “Lunch \n      Break,” Lighting Science is best known for their groundbreaking \n      “Sleepy Baby” and “Awake & Alert” LED bulbs. Like “Sleepy Baby,” \n      Lighting Science’s Good Night™ bulb removes 98 percent of \n      sleep-disrupting blue light waves. This patented technology supports \n      your body’s natural melatonin production, which helps you fall asleep \n      faster and stay asleep longer. To learn more about how light affects \n      your health, click \n      here . \n\n“At Lighting Science, we are passionate about creating innovative LED \n      solutions that improve your health,” said Ed Bednarcik, CEO of Lighting \n      Science. “Light represents a cost-efficient and effective way to improve \n      your sleep.” \n\nThis campaign was made possible with the support of the American Academy \n      of Sleep Medicine, the International Sleep Products Association, the \n      Centers for Disease Control and Prevention and many more. \n\nAbout Lighting Science \n\nLighting Science Group Corporation ( OTCQB:LSCG ) is a global leader in \n      innovative LED lighting solutions that designs, manufactures and brings \n      to market the most advanced, intelligent products for consumer, \n      professional and retail applications. By inventing breakthrough, \n      award-winning, LED lamps and lighting fixtures that truly work in sync \n      with nature, we follow one of our core values by being committed to \n      unleash the science of light to make people, and our planet, look, feel \n      and heal better. Lighting Science Group is headquartered in Melbourne, \n      Florida with international offices in Hong Kong. Find out more about us \n      at www.lsgc.com and join us on Twitter, Facebook, LinkedIn, Instagram, Pinterest and the \n      Lighting Science Blog. \n\nAbout Mediaplanet \n\nMediaplanet is the leading independent publisher of content-marketing \n      campaigns covering a variety of topics and industries. We turn consumer \n      interest into action by providing readers with motivational editorial, \n      pairing it with relevant advertisers and distributing it within top \n      newspapers and online platforms around the world. \n\n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150930006887/en/", "source": "CEOWorld Magazine"}