{"published": "2015-09-18T10:07:37Z", "media-type": "Blog", "title": "Apple Wins Ruling to Force Samsung to Change Phones, Tablets", "id": "f949e480-4792-41f7-8e74-516150d90055", "content": "( www.bloomberg.com ) \n \nApple Inc. won a court ruling that may force Samsung Electronics Co. to stop using some features in its older-model Galaxy smartphones and tablets and gives the iPhone maker a leg up in the four-year-old dispute. \n \nA U.S. appeals court said Apple was entitled to a narrow order that prevents the Korean device maker from using Apple’s slide-to-unlock, autocorrect and quicklinks features. Ruling otherwise would eliminate patent rights of inventors of certain features in multicomponent devices, the U.S. Court of Appeals for the Federal Circuit in Washington said in an opinion posted on its electronic docket. \n \nThe decision could have far-reaching consequences in how disputes are resolved when it comes to complex devices, and help patent owners limit copying by rivals. The ability to block use of an invention is a powerful tool that increases the price tag when negotiating settlements. \n \n“It’s an important precedent for Apple and any company that seeks to protect product differentiation,” said Nick Rodelli, who heads CFRA Legal Edge, a New York-based forensic accounting and legal research firm. “This broadens their moat here in the U.S. and makes it more difficult for new entrants to come into the U.S. market and rip off Apple’s features.” \n \nSamsung said it would ask that the issue be considered by all active judges of the Federal Circuit, since it was a split decision. The court handles all patent appeals. \n \nOlder Models \n \nThe iPhone maker gains additional firepower with its biggest rival when it comes to resolving a fight that began in April 2011. A past Apple settlement with HTC Corp. included a “no cloning” provision that ensured HTC’s phones didn’t look too similar to the iPhone, and the ruling Thursday helps do the same to other makers, like China’s Xiaomi Corp., that want to enter the U.S. market. \n \nFor Samsung, the ruling applies to older models including the Galaxy S2 and Note 2 that have been superseded by current devices such as the S6. It is thus unlikely to have a significant impact on the company’s business, said Lee Jae Yun, an analyst at Yuanta Securities Korea Co. \n \nSamsung’s shares climbed 2.9 percent to 1,190,000 million won in Seoul on Friday, while the benchmark Kospi index rose 1 percent. \n \n“The remaining litigation looks rather symbolic and I don’t expect the court rulings on older models would have a significant impact on Samsung’s business,” said Jeong Woo Sung, a patent lawyer at Lim & Jeong Patent Law Firm in Seoul. \n \nTrial Verdict \n \nApple won a $119.6 million jury verdict in May 2014 against Samsung, which was found to have infringed its patents for the slide-to-unlock, autocorrect and quicklinks features. Even so, the trial judge declined to force Samsung to remove them from its mobile phones, saying monetary damages would be adequate. \n \nApple argued that, if it weren’t able to control use of its inventions, it may lose market share and its reputation as an innovator. \n \n“The right to exclude competitors from using one’s property rights is important,” the Federal Circuit ruled in a 2-1 decision. “And the right to maintain exclusivity — a hallmark and crucial guarantee of patent rights deriving from the Constitution itself -— is likewise important.” \n \nSamsung Backers \n \nGoogle Inc., HTC, LG Electronics Inc. and Rackspace Hosting Inc. were among companies backing Samsung in its arguments. They argued that a victory for Apple could allow a patent owner “to unfairly leverage its patent for competitive gain.” \n \nThe specific features had some impact on customer decisions to buy products, and that should be considered when determining whether to block use of an invention, the court said. In her dissent, Chief Judge Sharon Prost said Apple must show that the features drove sales from Apple to Samsung before it could block a product. \n \nSamsung told the appeals court in March that none of its current models use two of the patents, and only a single product still has the autolink feature, so it will undergo no hardship, the court ruled. \n \n“We want to reassure our millions of loyal customers that all of our flagship smartphones, which are wanted and loved by American consumers, will remain for sale and available for customer service support in the U.S.,” said Danielle Meister Cohen, a Samsung spokeswoman. \n \nShe said Samsung has its own history of innovation. \n \nNewer Versions \n \nApple can go back and argue to the trial judge that Samsung’s newer versions still infringe the patents, setting up yet more legal debates between the two. \n \n“The public generally does not benefit when that competition comes at the expense of a patentee’s investment-backed property right,” Circuit Judge Kimberly Moore wrote for the majority. “This is not a case where the public would be deprived of Samsung’s products. Apple does not seek to enjoin the sale of lifesaving drugs, but to prevent Samsung from profiting from the unauthorized use of infringing features in its cellphones and tablets.” \n \nSamsung is appealing the underlying infringement verdict as well; that case is pending before the Federal Circuit. \n \nApple won an earlier case against Samsung over the design of the iPhone which it said was copied. The Federal Circuit in May upheld $548 million worth of damages in that case. A partial trial must be held to determine the exact amount. In a Sept. 11 filing with the court in San Francisco, both sides said they were willing to work with a mediator to resolve the case, with Apple going so far as to suggest binding arbitration. \n \nThe case ruled on today is Apple Inc. v. Samsung Electronics Inc., 14-1802, U.S. Court of Appeals for the Federal Circuit (Washington). The lower court case is Apple v. Samsung, 12cv630, U.S. District Court for the Northern District of California (San Jose).", "source": "Bubba the Love Sponge® Show"}