{"published": "2015-09-30T09:44:15Z", "media-type": "News", "title": "Inphi announces interoperability demonstration of world’s first 400g PAM4 IC solutions with NeoPhotonics", "id": "e4aed6be-1266-4722-b9c0-4cabc8a12f66", "content": "Spain - Inphi ( www.inphi.com ) mixed signal semiconductor solutions for the communications, computing and data center markets, announced that it has successfully demonstrated interoperability of the industry’s first 4-level Pulse Amplitude Modulation (PAM4) PHY IC chipset solution for service provider interconnects. \n\r \nThe demonstration will showcase 100G dual lambda optical link performance with 2-10km SMF fiber loopback featuring Inphi’s PAM4 IC solutions and NeoPhotonics (NYSE:NPTN) Q-TOSA 100G EML-based modules in Inphi’s booth #400 at ECOC 2015 from Sept. 26-30, 2015 in Valencia, Spain. \n\r \nAs the massive megatrends of cloud computing, Big Data, IoT, Social and Web2.0 continue to accelerate and drive the insatiable need for unlimited bandwidth, there is clear need to increase the speed of interconnect pipes while maintaining cloud economics and lowering carbon footprints. PAM4 modulation has now been recognized as the modulation scheme that will take the industry over the next wave of Ethernet deployments for optical and copper interconnects by doubling the bits per symbol at the same baud rate. \n\r \nThis demonstration shows that transferring the complexity from optics into CMOS electronics with PAM encoding, DSP and FEC technologies, one can attain four times as much bandwidth improvement compared to existing solutions, at a lower cost. Coupled with the availability of high-speed linear driver and amplifier solutions from Inphi, the demonstration showcases a complete electronics platform for an eight lambda IEEE P802.3bs 400G LR8 implementation. \n\r \n“Our interoperability demo with ecosystem partners, such as NeoPhotonics, achieves excellent bit-error-rate and optical link budget, and proves that the PAM4 technology is ready and available to help designers build IEEE P802.3bs 400G LR8 line cards and modules for next generation service provider platforms,” said Siddharth Sheth, vice president, Networking Interconnect, Inphi. \n\r \nNeoPhotonics is a leading designer and manufacturer of photonic integrated circuit, or PIC, based modules and subsystems for bandwidth-intensive, high-speed communications networks. As part of this demo NeoPhotonics will showcase its new 4x28G Q-TOSA module, that incorporates four channels of PIC integrated transmitters utilizing proven high performance electro-absorptive modulated lasers (EML), which meets the stringent ITU-T standard required by Telecom service providers and also satisfies the datacom requirement. \n\n“This joint demo with Inphi PAM4 chip demonstrates the ability of our very high bandwidth EML to generate superior performance in High Order of Modulation (HOM) based platforms. It has been proven at both 28GBaud and 56GBaud, which will enable future systems with higher link capacity to serve the continuous market demand for increased bandwidth,” said Tim Jenks, CEO of NeoPhotonics. \nCopyright © Display Plus. All rights reserved.", "source": "Display Plus"}