{"published": "2015-09-24T07:11:01Z", "media-type": "News", "title": "David Cameron faces legal action over drone strike on Britons in Syria", "id": "6027ea51-51a6-4458-b3b9-fc291adb5e36", "content": "David Cameron faces a legal challenge over the decision to target Islamic State (IS) terrorists in Syria despite Parliament refusing approval for air strikes. \n \nThe Prime Minister revealed earlier this month that an RAF drone had killed two Britons in an attack near the city of Raqqa, describing the action as an \"act of self defence\". \n \nThe Green Party's Caroline Lucas MP and Baroness Jones have joined forces with human rights charity Reprieve to take the first step towards a judicial review. \n \nIn a pre-action letter to the Defence Secretary and Attorney General, lawyers for the politicians argue that the Government has either failed to formulate a \"targeted killing policy\" or failed to publish it. Both positions are illegal under domestic and international law, the letter says. \n \n\"The Raqqa strike, and the intention of the Government to pre-authorise targeted killings in the future in countries where the UK is not at war, is of concern to the claimants and many others,\" they write. \n \n\"The concern is heightened by the lack of clarity about the circumstances in which the Government reserves the right to kill British citizens outside of an armed conflict.\" \n \nThe letter says the Government has variously stated the drone strike was justified due to \"potential\", \"direct\", \"likely\" or \"imminent\" threats to the UK. \n   Promoted stories   \n\"Such a lack of clarity as to the test which is being applied by the Government in deciding whether to pre-authorise the targeted killing of British nationals or individuals overseas raises real and serious concerns over the lawfulness of the Government's past and expected resort to the use of lethal force,\" it insists. \n \n\"It is unclear what, if any, policies, procedures and/or safeguards are in place to ensure that this 'new departure' is only exercised in accordance with domestic and international law.\" \n \nBritain is carrying out air strikes against IS in Iraq, but not in Syria after the Commons refused to approve the action. \n   \n Share article  \n   \nHowever, Reyaad Khan, from Cardiff, the primary target of the RAF drone strike, and Ruhul Amin, from Aberdeen, were killed on August 21 in Raqqa. \n \nMr Cameron told MPs that Khan had been plotting \"barbaric\" attacks on UK soil and there was no other way of stopping him.", "source": "Hereford Times"}