{"published": "2015-09-30T17:48:49Z", "media-type": "Blog", "title": "Free El Capitan upgrade is ready to streamline your Mac experience", "id": "032920bf-89b8-4b68-aebf-4f7be8af6459", "content": "Free El Capitan upgrade is ready to streamline your Mac experience\nBy Buster Hein • 10:48 am, September 30, 2015\nShare on FacebookShare on TwitterNewsTop stories\tPhoto: Apple\nApple’s latest and greatest operating system for Macs — OS X El Capitan — is now available for free to users around the globe.\nOS X El Capitan brings with it a number of new features like Split View and Spotlight search, along with tons of under-the-hood performance improvements that aim to make the Mac more rock-solid than ever. Best of all, it’s absolutely free for all Mac owners.\nApple revealed the operating system this summer at its Worldwide Developers Conference in San Francisco, showing off the faster and more-repsonsive design to developers. Beta testing has been incredibly postive, according to Apple’s VP of software engineering, Craig Federighi.\n“People love using their Macs, and one of the biggest reasons is the power and ease-of-use of OS X,” said Federighi in a statement yesterday. “El Capitan refines the Mac experience and improves performance in a lot of little ways that make a very big difference. Feedback from our OS X beta program has been incredibly positive and we think customers are going to love their Macs even more with El Capitan.”\nEl Capitan’s new features include an improved Mission Control, better Notes app, Safari tweaks, Maps with public transit directions, natural search for Spotlight, and the addition of Metal for Mac, bringing a big boost in performance for games.\nMac users can pick up the update from the Mac App Store, or via the Software Update section of the Apple menu.\nPosted in: News, Top storiesTagged: Apple software upgrades, Mac software upgrades, Metal for Mac, Mission Control, OS X 10.11, OS X El CapitanAbout the author:\tBuster Hein is Cult of Mac's News Editor who lives in Phoenix, Arizona. Twitter: @bst3r.", "source": "Cult of Mac"}