{"published": "2015-09-09T10:58:14Z", "media-type": "News", "title": "Emma Freedman to replace all Drive time newsreaders on Southern Cross Austereo's Hit Network", "id": "4e837e53-ded9-495e-b9ff-f391b39981bb", "content": "The Dancing with the Stars winner will replace all of the Drive time newsreaders on the youth orientated Hit Network. will soon replace all of the Drive time newsreaders on Southern Cross Austereo's youth orientated Hit Network. The former Weekend Today show weather presenter, who was fired from the Nine network in December, will take over from long serving Sydney newsreader Geoff Field on 2DayFM and other newsreaders around the country in the coming weeks.\n\n\"A new streamlined news service on The Hit Network will broadcast news weekdays from 4pm-6pm across all metro markets in the coming weeks,\" Hit Network's chief Craig Bruce said on Wednesday night.\n\nFreedman, the daughter of decorated racehorse trainer Lee, began her radio career in January. As well as news reading she will continue to co-host the nightly and nationally syndicated The Scoopla Show with former 2DayFM breakfast host Jules Lund.\n\n\"Emma's profile and popularity is at an all-time high,\" Bruce said. \"She's one of the brightest new stars in the radio industry, and we are excited to increase her on air role across the Hit Network starting in a few weeks.\"\n\nAccording to SCA sources who spoke to Fairfax, news of Freedman's extended role came as a shock with many affected staff deciding to quit immediately. Fairfax understands that, at the time of publishing, at least two presenters have announced their resignation.\n\nGeoff Field, who has been with 2DayFM for close to 20 years, announced he had left the network on Twitter earlier on Wednesday.\n\n\"Thanks to the listeners and staff that have supported me at 2DayFM since 1997. For the most part, it's been a blast. Sorry for the confusion, but I have left the radio station...I'm overwhelmed by the messages and texts, as you may understand I can't make any further comment other than to say I have left 2DayFM,\" he said. Thanks to the listeners and staff that have supported me at 2DayFM since 1997. For the most part, it's been a blast. pic.twitter.com/5pggRHWeFg— Geoff Field (@GeoffField) September 9, 2015\n\nFreedman will begin presenting the news during Hamish Blake and Andy Lee's drive show which airs around Australia soon.\n\n\"The Hit Network has been an incredible home for me over the past nine months and to be extending my role on air is very exciting. Hamish and Andy have been great buddies of mine for a long time, and I'm so excited to be reading the news in their show,\" she said.\n\nBlake and Lee's return to the airwaves has paid off for SCA with the duo achieving big ratings wins since turning on their mics again in July.\n\nThey have reclaimed the number one spot in their hometown of Melbourne, where they sent the Drive numbers above 10 per cent, and have also made massive gains across the board nationally including a three per cent audience increase in Sydney. The story first appeared on The Sydney Morning Herald.", "source": "Muswellbrook Chronicle"}