{"published": "2015-09-01T04:14:20Z", "media-type": "News", "title": "Are journalists safe?", "id": "53006ceb-922a-4465-919d-0077ffcc8347", "content": "Reporters working near the Navy Yard in Washington, D.C., on Sept. 16, 2013, when a naval reservist shot and killed 13 people. (Photo: AFP/) \n\nIt started over a year ago, but last week, things reached a very pivotal point. \n\nIt was one of those moments that will, unfortunately, stand the test of time. \n\nReporters understand that things can get a little crazy sometimes when they are out on assignment. But being there in the thick of it – when the drama takes place, and then reporting on it – is a big part of the job. \n\nReport the news, but do not become it. \n\nIn the last 12 months, that has sadly changed. When Ferguson happened, reporters Wesley Lowery from The Washington Post and Ryan Reilly from The Huffington Post became the news when they were arrested – for reporting the news. \n\nLast Tuesday, Jorge Ramos became the latest member of the media to deal with injustice. Donald Trump had the Hispanic journalist removed from a press conference by security for simply asking a question, because of his race and ethnicity. Trump has lived in the headlines because of his views on Hispanics and Latinos. So, when Ramos tried to ask a question, Trump had him put out for doing his job. \n\nBut what happened on Aug. 26 was unimaginable. A true tragedy, and a sad day in the history of journalism. \n\nThe deaths of Alison Parker and Adam Ward will be remembered. Sadly, they will also be discussed in every journalism class from here on out. But so will the name Vester Lee Flanagan/Bryce Williams. \n\nHistory has shown us that a murderer’s name is forever attached to a victim’s name. \n\nAccording to the Committee to Protect Journalists, eight journalists have been killed in America since 1992, bringing the total to 39 this year across the world. \n\nChauncey Bailey, the editor in chief of the Oakland Post, was shot and killed in 2007. \n\nRobert Stevens, an editor at The Sun, died in 2001 after inhaling anthrax. \n\nPhotographer William Biggart’s body was found in the rubble caused by the destruction that took place on Sept. 11. \n\nJames Edwin Richards, editor of Neighborhood News, was shot in 2000 while walking in his neighborhood. \n\nDona St. Plite, a TV reporter in Miami, was killed in 1993 at a benefit for a colleague who had also been killed. \n\nAnd earlier this year, Charnice Milton, a community reporter in Washington, D.C., at Capital Community News, was not the intended victim, but was used as a human shield while heading home after a community meeting she was reporting on. \n\nThere is a storm brewing in this country; let’s hope we figure out a way to prevent it before it takes place. \n\nLet’s hope that this is the last time a journalist is killed for doing their jobs. Because if we kill the media, then who will be there to report it? \n\nRead or Share this story: http://delonline.us/1Eus7iC", "source": "Delaware Online"}