{"published": "2015-09-30T10:34:41Z", "media-type": "News", "title": "Irani calls for simplifying Sanskrit", "id": "5d15b9a0-bfcb-42f9-a979-5ddfc160103d", "content": "New Delhi, Sept 30 (PTI) HRD Minister Smriti Irani today made a strong pitch for promotion of Sanskrit and making it a language of the masses by simplifying it in schools and holding more research in the discipline.\n\nThe Union minister also said that as the Sanskrit is language of yoga, students from the discipline should exploit the growing interest for yoga world-wide.\n\n\"All the Sanskrit universities should also generate yoga teachers,\" she said.\n\n\"If we want to make Sanskrit a language of the masses, it should be promoted in simple standard Sanskrit,\" Irani said at the fifth convocation of the Rashtriya Sanskrit Sansthan here.\n\nThe teaching of Sanskrit should be evolved with the contemporary requirements and modern technology be used in its promotion, she underlined, adding the course curriculum should also be \"refined\".\n\nUtilising the Massive Open Online Course (MOOC) platform and with the adoption of modern technology, the language can be promoted in the country and Sanskrit prose and dramas can be made available to students at minimal rates, she said.\n\nTalking about her vision for Sanskrit for the next ten years, Irani said each state should create at least two to three scholars in the discipline. \"Teachers, who can impart the language in a simple way from the secondary to the higher education level, should be trained,\" she said.\n\nThe language should be re-established in Sanskrit schools, Sanskrit universities and Sanskrit departments, she said.\n\nIrani called on the Sanskrit scholars and students enrolled in Sanskrit institutes to think beyond teaching and explore career opportunities in other sectors as well.\n\nThe minister also appealed to the Sanskrit scholars to engage and develop literature that reflects today's society.\n\nMore and more research should be conducted in the discipline so that it benefits the common man and is useful for the future of the country, she said.", "source": "Press Trust of India"}