{"published": "2015-09-02T12:56:39Z", "media-type": "News", "title": "West Belfast woman accused of trying to murder a mother and daughter refused bail", "id": "a9936470-52c3-4b98-8f58-6ac9ab868454", "content": "A west Belfast woman wept in court today as she was refused bail accused of trying to murder a mother and daughter. Standing in the dock of Craigavon Magistrates Court in a grey track suit, Kathleen Catriona McCann (28) spoke only to confirm that she understood the three charges against her. McCann, a mother-of-three from Cloona Manor in Dunmurry, is accused of attempting to murder Jacqueline May and her daughter Saoirse May and aggravated burglary at a house on Cloona Manor, inflicting grievous bodily harm and being armed with a knife at the time. \n\nYesterday (Tuesday September 1) her 35-year-old brother William Philzer McCann, also from Cloona Manor, was granted bail on similar charges. \n\nToday, Wednesday September 2, Detective Constable McQuade told the court he believed he could connect Ms McCann to the charges and that police were objecting to her being released on bail amid fears that witnesses would be subject to intimidation. \n\nHe described how, according to the police case, the daughter was subjected to verbal abuse by Ms McCann at the King's Head bar before she then allegedly attacked her. \n\nThe door staff broke the fight up and ejected Ms McCann so Saoirse May called her mother who is a taxi driver to take her home but when the mother and daughter arrived, Mr McCann was already there and allegedly called his sister over, telling her to \"come and kill her.\"\n\nThe officer claimed that outside the house, the brother and sister kicked Jacqueline May to the ground as she tried to stop the pair getting into her daughter's home without success. \n\nInside the home, the detective told the court, Ms McCann allegedly attacked Saoirse May again and she had described feeling \"hot tingles on her head and body, wet on her face and realised she was bleeding.\"\n\n\"She would say she saw the point of a blade in Kathleen McCann's hand,\" said the officer adding that Saoirse May sustained a \"number of puncture wounds\" to her head, neck and shoulders but were largely superficial. \n\nHer mother however sustained more serious injuries including five stab wounds, one of which caused a lung to collapse and she remains in hospital where doctors now suspect she has also suffered a broken shoulder. \n\nDC McQuade said it was only when a third party intervened that Saoirse May was able to wrestle the knife from Ms McCann \"and throw it away.\"\n\nArrested and interviewed, Ms McCann counter claimed she she had been subjected to an unprovoked assault in the bar and that she only went to her neighbour's house when she saw her brother there and became involved in a fight. \n\nShe further claimed that Saoirse May had been armed with a knife and that having managed to get it from her, she was \"flailing\" it around in self defence and \"in fear for her life,\" maintaining that if she stabbed anyone it was an \"accident.\"\n\nUnder cross examination from defence solicitor Clive Neville, the officer agreed that she had no record for violence and that there had been no neighbourly disputes prior to the incident. \n\nHe also agreed that with a proposed bail address in Glenavy, that would lessen his fears over potential witness intimidation. \n\nRefusing the bail application however and remanding Ms McCann into custody to appear again via videolink on Monday, District Judge Mervyn Bates said while it was clearly a case of joint enterprise between the brother and sister, \"it is certainly alleged that this defendant was the knife wielder.\"\n\n\"I accept that you have an explanation for that but that is for another occasion,\" the judge told her. \n\nHe added that although he granted bail to her brother, there were other factors relating to his case which influenced his decision including Mr McCann's mental capacity. \n\nAs a weeping McCann was lead to the cells by prison staff, she told two female relatives to \"look after my babies.\"", "source": "Belfast Telegraph"}