{"published": "2015-09-22T22:32:38Z", "media-type": "News", "title": "(EDITORIAL from Korea Herald on Sept. 23)", "id": "449f0db1-39be-465c-a7f1-9875476240cb", "content": "Constituency system \n\nNew scheme should not cut proportional representation　 \n\nAn independent panel formed by the National Election Commission is scheduled to hold a meeting this week to decide on the number of electoral districts for the forthcoming parliamentary elections. It suggested Saturday the number would be set at between 244 and 249 -- little changed from the current system, under which 246 lawmakers are elected from constituencies. \n\nThe suggestion has prompted a negative response particularly from the ruling Saenuri Party, with its leader Rep. Kim Moo-sung describing it as “unrealistic.” Some lawmakers of the main opposition New Politics Alliance for Democracy have also joined the criticism of the proposed rezoning scheme. \n\nThe panel has worked on redrawing electoral districts to reflect a ruling by the Constitutional Court last year that the population deviation between the most and least populous constituencies should be narrowed from the current 3-1 to 2-1. This adjustment is overdue, given that other advanced democracies have stricter limits on the population deviation among electoral precincts to ensure each voter exercises more equal voting rights. \n\nLeaving the number of constituencies unchanged as suggested by the panel means some of the current 246 parliamentary districts -- mostly in rural areas -- are to be merged or abolished. \n\nThe ruling party has called for increasing the number of lawmakers elected from constituencies and accordingly cutting the portion of proportional representation seats in the 300-member parliament. In contrast, the NPAD has insisted on electing more lawmakers through the proportional representation system. \n\nThe different positions taken by the parties mirror their calculation on what scheme would help them get more seats in the parliamentary elections set for April. What makes the situation more complicated is that some opposition lawmakers elected from rural districts have vehemently opposed a possible merger or abolition of their constituencies. \n\nThese conflicting interests have barred the parliamentary special committee on political reform from establishing guidelines for redrawing constituencies. \n\nThe NEC panel says it is ready to reflect specific guidelines to be set by the committee in drawing up the final rezoning scheme, which should be submitted to the parliament by the legal deadline of Oct. 13. \n\nSome commentators argue that reducing the number of proportional representation seats is necessary to remove the confusion. But more caution is needed in taking this approach. True, the system has fallen short of serving its purpose of drafting in fresh and competent figures from various walks of life. But this cannot be a reason to understate its need and the problem can be overcome by improving the selection process. \n\n(END)", "source": "Yonhap News Agency"}