{"published": "2015-09-04T06:44:36Z", "media-type": "News", "title": "Where Should You Eat This Weekend?", "id": "fe5d7773-f5b2-4768-99bf-d33d73f28e93", "content": "Simran Oberoi Multani \n \nWhen I moved to Bangalore three ish years ago I still had the preconceived image of what used to be a city of pubs from my earlier visits. Staying here and having eaten at some of the most delicious places has made me realise that it is actually multi faceted in what it offers and goes completely beyond the regular pub brewery notion. \n \nWhile I have explored several places, some have made a deeper impact than the others – so here is what I would recommend; it is an eclectic mix of fine dining, community eating and cafes. \n \nChianti (Koramangala) – If there is any place that defines high quality fine dining and authentic Italian cuisine in Bangalore, it would be Chianti for me. Right from the décor, to the descriptive menu interspersed with some food history snippets, to the excellent service and the impeccable food flavours, Chianti is truly a foodie’s paradise. It replicates the authentic Tuscan flavours just as I remember them from a trip years ago. \n \nWhat I ordered – Ricotta and Spinach Crostini Di Verdure, Spaghetti Alla Carbonara, Pizza Pollo Alla Griglia, Gnocchi Di Patate. \n \nKoshy’s (St.Mark’s Road) – Koshy’s is as much a landmark as it is a legendary eatery in the heart of Bangalore. One of the oldest restaurants in Bangalore, it has retained its old world charm, a primarily Anglo Indian menu and a committed clientele. A visit to that part of the city almost always results in a meal at Koshy’s. There is a certain timelessness to the place with the milling crowds that keep it vibrant with energy irrespective of the age groups they belong to and the sense of being transported back to a time when life (and food) was simple and relied on flavours, rather than presentation. \n \nWhat I ordered- French Fries, Fish fingers, Cheese Baked Chicken,Veg Au Gratin \n \nArusuvai Arasu Madhuram ( HSR Layout) – If you are looking for a traditional vegetarian Tamil fare served with a smile and on fresh banana leaves, head straight to Madhuram. It is similar to a community eating set-up and the wholesome and delicious flavours come together in the form of their piping hot Thaali. The portions are large and filling, and the variety is tremendous. They have a small counter for homemade pickles and podis as well, where one can pick up these spicy accompaniments from, for one’s home. \n \nWhat I ordered – Thalai Vazhai Virunthu (Tamil Nadu’s meal/thaali), Kesari, Poori Aloo \n \nArt Blend Café (HSR Layout) A recent addition to the café scene, the Art Blend Café is a culmination of the combined passion towards art and related activities, of two individuals. From hosting artists, reading groups, mom entrepreneurs and even foodie club get-togethers, this cosy café nestling in one of the tree-lined lanes of HSR is a true delight. You can catch up with friends or find your own spot to sit and read in a tranquil environment. They will win you over with a Masala / Kulhad Chai and then as you explore the menu further you have delicious food offerings to choose from. \nWhat I ordered – Masala / Kulhad Chai, Crumb Fried Chicken Burger, Mini Samosa, Dilli Aloo Chat \n \nSimran Oberoi Multani is the Founder and Chief Baker at Ovenderful \nYou can follow her at https://www.facebook.com/ovenderful and http://her.yourstory.com/simran-multani-raises-funds-", "source": "Explocity"}