{"published": "2015-09-16T23:12:11Z", "media-type": "Blog", "title": "This New Dating App Will Ruin Your Internet Game", "id": "719699f9-47be-4bc7-969b-b53a881c95ae", "content": "NYMag.com Daily Intelligencer Vulture The Cut Science of Us Grub Street Bedford & Bowery FOLLOW: Facebook Twitter UserName LOG IN REGISTER Fashions Runway Street Style Designers Fame Beauty Goods Love & War search Sections Fashions Fame Beauty Goods Love & War Plus Runway Street Style Designers Sites NYMag.com Daily Intelligencer Vulture Science of Us Grub Street Bedford & Bowery Like UsFollow Us Popular on The Cut Ask Polly: Should I Just Give Up on My Writing? » Top Shows Oscar de la Renta See it » Michael Kors See it » Suno See it » Coach See it » Narciso Rodriguez See it » Tory Burch See it » Carolina Herrera See it » Rodarte See it » Diesel Black Gold See it » Jeremy Scott See it » Thom Browne See it » rag & bone See it » Tommy Hilfiger See it » Prabal Gurung See it » Diane Von Furstenberg See it » keeping us honest September 16, 2015 7:12 p.m. This New Dating App Will Ruin Your Internet Game By Allison P. Davis Follow @allisonpdavis No photos over six hours old allowed. 37 Shares Share 29 Tweet 8 Share 0 Pin It 0 Share Email Print Share Photo: Uwe Umstaetter/Westend61/Corbis The best photo of me was taken about a few years ago: I will never again look so young, so free, or so skinny as I was in that shot. Do I still use that fairly blatant misrepresentation of my current self on my OKCupid profile? You bet I do.  Unfortunately, a Swedish dating site called 7Heaven wants to ruin my internet game by only hosting photos of members that were taken in the last six hours. It can check timestamps. Don't even try to trick it; it's smarter than us.   Users can upload new ones as they want to, but only if they were recently snapped. It doesn’t matter who you are now — bald, chubby, with bad bangs, a bad haircut, or a new tattoo — 7Heaven only wants that authentic, current self presented to potential suitors. That seems like so much work! Trying to get yourself dating-site-selfie-ready every six hours?\nAt first I thought, Chill out! How much does a person actually change in six hours? But then I remembered the disparity between how I look at work and how I look when I come home at night, take off my pants, remove my makeup, and fall asleep on the couch for a few hours before I start Tindering. Maybe six hours is too long a time period. Springwise Tags:dating appsimproved dating appskeeping us honestdatinglove and warMore Share on Facebook Tweet this Story Top Stories Sophie Theallet’s Elevated Triumph; Narciso Rodriguez’s Decisiveness Vote for the Top Street-Style Star, Day 6 A Hyperreal Peek Into the Fashion Week Funhouse Most Viewed Stories Ask Polly: Should I Just Give Up on My Writing? 2k Shares Share Tweet Khaleesi Is the Queen of Going-Out Tops 3.3k Shares Share Tweet Kanye Relegates Kendall to Second Row at Yeezy Show [Updated] 14 Shares Share Tweet Beware the Manic Pixie Dream Boyfriend 4.1k Shares Share Tweet The Bisexual Grad Student Laughing at Fifty Shades of Grey 272 Shares Share Tweet 5 Things You Should Buy at Sephora This Month 140 Shares Share Tweet The Best Street Style From New York Fashion Week 1.2k Shares Share Tweet Frolicking on the Edges of Fashion’s Absurd Pool 191 Shares Share Tweet Fashion Taps Into the Spiritual Side of Things 170 Shares Share Tweet Airline Grounds 130 Crew Members Over Their BMIs 181 Shares Share Tweet From Our Partners POPSUGAR Fashion The 8 Style Habits of Insanely Gorgeous Supermodels HuffPost Parents Sean Penn Is Adopting Charlize Theron's Son HuffPost Women 15 Signs You're With A Good Man POPSUGAR Beauty The Eye Makeup Tip That Will Put Plastic Surgeons Out of Business powered by PubExchange The Cut’s Latest Love and War Features 7:12 p.m.This New Dating App Will Ruin Your Internet Game\nNo photos over six hours old allowed. 3:50 p.m.Please, Stop With the Muppet Sex.\nIs Animal an animal in the sack? I don’t want to know. 2:59 p.m.New York Magazine’s ‘Sex Lives’ Podcast: A Cultural History of the Bionic Dong\nListen to this week's \"Sex Lives\" podcast. 2:25 p.m.Kate McKinnon Is Repping for Crazy Cat Ladies\nThere's nothing to be ashamed of. 1:40 p.m.Men Want Their Parental Leave, Too, Damn It\nMore and more of them are suing to get it — and winning. 1:30 p.m.Kanye Relegates Kendall to Second Row at Yeezy Show [Updated]\nWhat blasphemy is this? 10:02 a.m.Does This Standing Desk Make My Butt Look Big?\nAnd other things to worry about now that sitting is the new smoking. 7:59 a.m.Ask Polly: Should I Just Give Up on My Writing?\nWriting can't be a popularity contest, and popularity doesn't add up to much anyway. Yesterday at 4:50 p.m.Airline Grounds 130 Crew Members Over Their BMIs\nBut the BMI policy doesn't actually make sense. Yesterday at 3:45 p.m.Kate Spade Wins Gloria Steinem in Female-Icon Arms Race\nJoan Didion was booked.\nYesterday at 1:20 p.m.Is There a Phallus in This Taylor Swift Corn Maze? Do you see what I see? Yesterday at 10:33 a.m.A Salute to the Women of American Ninja Warrior\nAnd the show that's become an unlikely athletic equalizer. Yesterday at 9:36 a.m.Johnny Depp Meets His Future Past\nA tiny little Depp. Yesterday at 9:24 a.m.Ellen Page and Girlfriend Are in Tuxes, in Love\nA stylish debut for a new couple. Yesterday at 8:12 a.m.The Bisexual Grad Student Laughing at Fifty Shades of Grey\nThis week’s sex diary. 9/14/2015 at 5:40 p.m.Watching Kim Kardashian Watch Herself in Her Phone Camera\nMe, a dog wearing a baseball hat, and all the Kardashians walk into an Apple Store. 9/14/2015 at 4:30 p.m.Why Women Love to Read About Crime Reading about it, that is. 9/14/2015 at 1:20 p.m.Serena Williams Was Born to Be Historic and Badass\n\"And if anyone doesn’t like it, then they don’t have to.\" 9/14/2015 at 11:21 a.m.Kim Cattrall Is Redefining Motherhood\nDon't call her childless, child. 9/14/2015 at 10:16 a.m.Helen Mirren Wants Your Shoulders to Be Free\nThe Dame makes a point about PDA of the patriarchy. Load More MORE FROM The Cut Normcore: Fashion for Those Who Realize They’re One in 7 Billion MORE FROM The Cut Portrait: Catherine Deneuve, an Icon at 70 MORE FROM The Cut I Was a Hollywood Personal Assistant MORE FROM The Cut Meet the 4 Most Desired People in New York (According to OKCupid) MORE FROM The Cut Seriously, Stop Pretending You Ate That MORE FROM The Cut Why Red-Carpet Makeup Looks Bad in Real Life MORE FROM The Cut These Eerie Fetish Photos Were Kept Under Wraps for Years MORE FROM The Cut RIP, Juicy Tracksuits, Famewhore Uniform of the 2000s MORE FROM The Cut Beware the Manic Pixie Dream Boyfriend MORE FROM The Cut Kim Cattrall Is Redefining Motherhood MORE FROM The Cut Vanessa Williams Finally Got Her Miss America Apology MORE FROM The Cut The Bisexual Grad Student Laughing at Fifty Shades of Grey MORE FROM The Cut The Best Street Style From New York Fashion Week MORE FROM The Cut Watching Kim Kardashian Watch Herself in Her Phone Camera MORE FROM The Cut Ask Polly: Should I Just Give Up on My Writing? MORE FROM The Cut When Kylie Jenner Offers to Take a Selfie, the Answer Is Yes MORE FROM The Cut At This Show, the Models’ Falls Were Tightly Choreographed MORE FROM The Cut The Best Party Photos of New York Fashion Week MORE FROM The Cut Hood by Air’s World Is a Shock From the Future MORE FROM The Cut Why Women Love to Read About Crime MORE FROM The Cut Astrology GIFs for the Week of September 14 MORE FROM The Cut Everything You Need to Know About Fashion Week So Far MORE FROM The Cut Frolicking on the Edges of Fashion’s Absurd Pool MORE FROM The Cut Airline Grounds 130 Crew Members Over Their BMIs MORE FROM The Cut Take the Cut’s Fashion Week Style-Personality Quiz MORE FROM The Cut Kanye Relegates Kendall to Second Row at Yeezy Show [Updated] MORE FROM The Cut Surprise: It’s Yeezy Season Again MORE FROM The Cut Helen Mirren Wants Your Shoulders to Be Free MORE FROM The Cut Was Hood by Air Making Fun of Contouring? MORE FROM The Cut Brandon Maxwell’s Debut Show Made Lady Gaga Cry MORE FROM The Cut Drake Continues to Be Serena’s Biggest Fanboy MORE FROM The Cut Ellen Page and Girlfriend Are in Tuxes, in Love MORE FROM The Cut Is There a Phallus in This Taylor Swift Corn Maze? MORE FROM The Cut A Salute to the Women of American Ninja Warrior MORE FROM The Cut 5 Things You Should Buy at Sephora This Month MORE FROM The Cut Is This Weird, No-Foam Cleanser Secretly the Best Face Wash? MORE FROM The Cut Serena Williams Was Born to Be Historic and Badass MORE FROM The Cut Harvard Women Finally Receive Invitation to Boring Rich-Dude Club MORE FROM The Cut Vote for the Top Street-Style Star From Day 4 MORE FROM The Cut Fashion Taps Into the Spiritual Side of Things MORE FROM The Cut Does This Standing Desk Make My Butt Look Big? MORE FROM The Cut Outfit of the Week: A Cool, Office-Friendly Look MORE FROM The Cut The Start-up Helping You Cash In on Designer Bags MORE FROM The Cut The Cult of Mansur Gavriel Now Has Shoes MORE FROM The Cut Samantha Bee Tramples Late Night’s Man-Party MORE FROM The Cut Jeremy Scott Just Wants You to Like Him MORE FROM The Cut A New M.A.C Lipstick From Fashion’s Crazy Uncle MORE FROM The Cut 6 New, Easy Backstage Beauty Lessons From Fashion Week Home Fashions Fashion Shows Street Style Designers Beauty Fame & Look Books Goods Love & War Newsletters Facebook Pinterest Twitter iPad App Instagram RSS Feedly Privacy Terms Site Map Media Kit Ad Choices About Us Contacts Feedback We're Hiring! © 2015, New York Media LLC. View all trademarks Designers Finally Okay With Letting You Do You Theallet’s Triumph; Rodriguez’s Decisiveness Ad will collapse in seconds… CLOSE", "source": "The Cut"}