{"published": "2015-09-15T12:20:00Z", "media-type": "News", "title": "Map Illustrates the No. 1 Financial Challenge of Americans in Every State", "id": "1f63ccd3-447e-4adf-adc7-f77a946a8a2e", "content": "SOURCE GOBankingRates\n\nNew survey data collected from over 10,000 Americans shows the biggest financial concerns of residents in every U.S. state\n\nLOS ANGELES \n\nThe leading personal finance website asked residents in all 50 U.S. states and the District of Columbia \n\nOverall, 1 in 5 Americans said sticking to a budget is their biggest challenge and another 1 in 5 report planning for retirement is their focus.\n\nTo see the full analysis on financial challenges in each state, visit: http://www.gobankingrates.com/retirement/heres-1-financial-challenge-americans-state/\n\n\"We saw a relationship between the biggest financial challenge in a given state and the local economic conditions in many cases. Californians, for instance, are most challenged by paying for higher education, where the UC system happens to be under scrutiny for massive tuition hikes,\" said Casey Bond \n\nKey findings of the study include:\n\nNo. 1 Financial Challenge of Americans in Every State: . Methodology: The 2015 Life + Money Survey is comprised of findings from five Google Consumer Surveys conducted in July and August 2015. Sample sizes range from 1,000 to 10,003 respondents of U.S. adults ages 18 and older. All surveys are representative of the U.S. internet population with a margin of error of 2.2 percent or lower. For the complete methodology, visit gobankingrates.com/lifemoney2015/.\n\nAbout GOBankingRates\n\nGOBankingRates.com is a leading portal for personal finance and consumer banking information, offering visitors the latest on everything from finding a good interest rate to strategies for saving money, investing for retirement and getting a loan. Its editors are regularly featured on top-tier media outlets, including U.S. News & World Report, Forbes, Business Insider, DailyFinance, Huffington Post and more. It specializes in connecting consumers with the best financial institutions and banking products nationwide.\n\nContact:\n\nRoxy Barghahn \n\nLogo - http://photos.prnewswire.com/prnh/20130926/LA86996LOGO \n\nPhoto - http://photos.prnewswire.com/prnh/20150914/266300 Photo - http://photos.prnewswire.com/prnh/20150914/266299-INFO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/map-illustrates-the-no-1-financial-challenge-of-americans-in-every-state-300142929.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "Kait 8"}