{"published": "2015-09-23T23:25:10Z", "media-type": "Blog", "title": "WHAT HAPPENED", "id": "dd67ecb6-4fc3-44c8-9fb9-c53db5ada47d", "content": "SOMETHING’S HAPPENING!\nWednesday, September 23, 2015\n12-12:05 Janee Taylor, “Dognoir”\n‘Jumpsracing’ http://www.dognoir.com 12:05-1 “Guns and Butter: Dissolving Illusions: Vaccination Past and Present” with Dr. Suzanne Humphries and Roman Bystrianyk Co-authors of “Dissolving Illusions: Disease, Vaccines, and the Forgotten History”,\nhttp://www.gunsandbutter.org Bonnie Faulker EM Faulkner@gunsandbutter.org Dr. Humphries: http://www.dissolvingillusions.com http://www.drsuzanne.net 1-2 Bonnie Faulker, “Guns and Butter - Vaccines: What You’re Not Being Told” Part 1 with Gary Null\nOriginally recorded May 20\nhttp://www.gunsandbutter.org Bonnie Faulker EM Faulkner@gunsandbutter.org Gary’s Progressive Radio Network http://prn.fm Gary’s Film “Silent Epidemic: The Untold Story of Vaccines” https://www.youtube.com/watch?v=lJGyN3gCsBg Gary’s Film “Vaccine Nation” https://www.youtube.com/watch?v=494NacYFmko\nGary’s Film “Autism – Made in the U.S.A.” https://www.youtube.com/watch?v=fwuyxyBUmwY 2-3 Bonnie Faulkner, “Guns and Butter - Vaccines: What You’re Not Being Told” Part 2 with Gary Null Originally recorded June 2. http://www.gunsandbutter.org Bonnie Faulker EM Faulkner@gunsandbutter.org Gary’s Progressive Radio Network http://prn.fm Gary’s Film: “Silent Epidemic: The Untold Story of Vaccines” https://www.youtube.com/watch?v=lJGyN3gCsBg Gary’s Film “Vaccine Nation” https://www.youtube.com/watch?v=494NacYFmko Gary’s Film “Autism – Made in the U.S.A.” https://www.youtube.com/watch?v=fwuyxyBUmwY 3-3:30 X Minus One ‘The Iron Chancellor’ by Robert Silverberg (nd) 3:40-5:55 The Thom Hartmann Program How Many More CEOs Should Go To Jail?\nArticle: \"Ben Carson: Muslim president a 'theoretical' idea\" by Nick Gass.\nArticle: \"S.E. Cupp Unwittingly Labels Herself A Bigot\" by John Amato.\nArticle: \"Biden insiders feel Clinton stalking\" by Edward-Isaac Dovere.\nConservatives... All About the Money\n- Neil McCabe, One America News Network Article: \"Conservatives Buoyed by Historic Flood of Money Into Politics\" by Sarah Lazare.\nCase: \"Buckley v. Valeo\", 1976.\nArticle: \"America is an oligarchy, not a democracy or republic, university study finds\" by Cheryl K. Chumley.\nTalk Radio News Segment:\n- Bob Ney Site: \"Goats for the old Goat\".\nSite: Governor Free Don Siegelman.\nBook: \"Sideswiped: Lessons Learned Courtesy of the Hit Men of Capitol Hill\" by Robert Ney.\nArticle: \"TRNS News Notes- 9/22\" by Victoria Jones.\nYour calls on the topics of the day!\nArticle: \"10 Times Bernie Sanders and Pope Francis Sounded Alike\" by Maryalice Parks.\nArticle: \"Official Donald Trump Make America Great Again Cap - Gold/White\".\nArticle: \"Protester says Cincinnati Police used Taser on him because he 'flipped off' another officer\" by Greg Noble, Julie O'Neill.\nArticle: \"Hillary Clinton campaign only wanted four debates\" by hencexox.\nArticle: \"Eric Cantor, Paul Ryan & Kevin McCarthy: Plot To Sabotage US Economy with Frank Luntz\" by keepemhonest.\nSite: Unionwear.\nThom's Website: http://www.thomhartmann.com\n5:55-6 KPFK Community Calendar KPFK Switchboard has a printed copy at hand - 9am-5pm (818) 985-2711 ext. 0 (for operator)", "source": "Somethingʻs Happening"}