{"published": "2015-09-04T18:30:21Z", "media-type": "Blog", "title": "Summer of the gypsies", "id": "a0567f38-1d48-4410-b6ad-7be67f78c931", "content": "The summer I would turn 14 my father made me change my tank top before I went to the county fair. I thought Dad was being overprotective and nerdy. He mumbled something about those carnies, on the carnival side of the fairgrounds. Cigarettes dangled freely from their lips, glowing hot embers complimenting the neon lights of their rides and games. Our farmer's side of the fair had old men with cheeks full of chewing tobacco, but no cigarettes around all the hay and sawdust bedding. An errant ash could set everything aflame. I see myself then, a skinny tomboy, with tiny rosebud breasts that didn't even need a bra. I talked with the kids about chickens that didn't lay. Some of the older brothers would laugh, elbowing each other knowingly. It made no sense to me.\nGrowing up on a farm, the pinnacle of our summer was the county fair. It was always the first week of August and we’d spend the prior two months preparing our livestock for show, our baking for judging, and our sewing for modeling. The Future Farmers of America brought in samples of their hay and crops, and the really cool guys were allowed to bring their tractor to the fair. It was wholesome and idyllic.\nOurs' was a different universe, the farmer’s side of the fair, where we ate at church sponsored cafeterias or out of picnic baskets we brought ourselves. We rarely ate the carnival food. Someone would occasionally bring back a cup of fair fries, manna soaked in vinegar and ketchup. We’d circle like buzzards. The fortune tellers and games of chance tantalized us. The invisible fence wasn't electrified, but that didn't mean it was easy to cross. I rebelliously yearned to wear my tank top and walk down the midway, just to see what would happen. The carnies’ trucker chain wallets jangled with a hypnotic cacophony. Their greasy hands and sinewy muscles were a stark contrast to overalls and manure-caked boots. We camped on cots in the barn playing cards next to livestock pens while they huddled around their trailers comparing tattoos.\nEvery summer, my friends and I would take one day and explore the carnival side of the fairgrounds. We rode the creaky rides, ate the greasy food, and slipped inside the gypsy tent with a few dollars to hear our fortune. We wanted to hear that we would win a blue ribbon for our project. The gypsies were never that specific, but winning the blue ribbon meant the gypsies were right. The last night of the fair was the livestock auction where we would parade our blue ribbon animals before the crowd hoping for a high bid that would help grow our savings accounts. Our animals were carted away after the fair closed, destined to be a future dinner for the lucky bidder.\nLivestock animals are raised for the sole purpose of one day gracing a dinner table. Fictionalized accounts of Charlotte the spider telling us that Wilbur was “Some Pig”, or that and Mary had a “little lamb”, were cute stories, but far removed from the reality of farming. We weren't encouraged to name the animals. Named or unnamed, they eventually disappeared in the still of the night, or more accurately, as the sun rose. We knew that it was best not to ask or be told where they went.\nVery few farmers do their own butchering. We seized a bit of the frontier spirit on occasion, mainly with chickens. I witnessed firsthand how precise the expression “running around like a chicken with its head cut off” was. Those chickens for certain never lay again. When the spastic chicken’s muscles wearied, we would pluck the feathers, and then burn the remaining down off with a small blowtorch. The novelty wore thin, and we would crate the chickens and take them to the Amish farm down the road. They would kill and dress the poultry for 50 cents a bird, much more efficient and feather free.\nOne year, we hired some gypsies to butcher our pig. A huge family arrived, at least four adults and several children, probably ten people, total. The exotic dark haired children played hide and seek and flashlight tag with my brothers and me. It was patently clear that my parents didn't trust the gypsies. Our folks had told us ahead of time not to let anyone into the house, that if anyone needed to use the bathroom, to show them the outhouse. I was much more interested in watching everything than playing with the children, so I lingered near the barn. My father had a hunting rifle and shot the pig between the eyes. I only heard and felt the reverberation, but I didn't see it. The men tied and hung the pig in the air, from the front end loader tractor, and slit its throat so the blood would drain out. I watched with detached fascination.\nThe gypsy men carved the carcass with efficient expertise. They salvaged every part of the pig we didn't want, to dine on later. The gypsy women sang songs in an unfamiliar language while they caught the draining blood in buckets. They tucked the ears into plastic bags, and saved the intestines to stuff with their ethnic sausages. They claimed the hooves. They had ways to use what we discarded. Dusk came and the carcass was sliced into manageable pieces, wrapped in paper, and labeled. The mercury light cast a glow on our offering to the gods of the full larder. The gypsy men leaned on the side of their truck, casually smoking their cigarettes, while the women rounded the children into the back of the truck.\nWe carried baskets of wrapped meat to the freezer in the basement, stacking it neatly on a shelf. I don’t know why the gypsy butchers never returned. It makes me wonder how we found them in the first place. Were they mingling at the livestock auctions, offering their services? After that one time, we simply did what we did with all the other animals. We loaded them in the trailer and took them to the slaughter house. A few days later, we picked up our orderly packages of wrapped sustenance.\nWhen I got older, I decided that I wanted to be a vegetarian. Maybe I had named one too many animals. Maybe I knew them too intimately to eat them. That was the same summer Sam died. For years, I had ignored the advice of my elders and I named my animals. Sam was one of my 4H lambs. He got an infection from an open wound. I tied him outside under a cherry tree and laid clean sheets on the grass for him to sleep on, so his infection wouldn't get worse from the less than sterile barn. I slept in a sleeping bag under the tree with Sam. In the morning, I woke up and Sam didn't. I remember being disappointed that I would only have two lambs to sell at the auction and closed the ledger book on Sam. I focused my attention on my remaining two lambs and that year I won the showmanship trophy.\nToday, I buy frozen meat from the supermarket, in Styrofoam trays with sticky UPC labels, heeding the warning to cook to the right temperature to prevent disease and never ever thaw at room temperature. I wear tank tops when I wish and do not avoid the gaze of anyone. I hum to myself as I choose my meat. The song is an old one and a sense of déjà vu washes over me. The gypsies still intrigue me; I wonder what they dine on and their music echoes in my soul.\nLife is sterile and tidy, but somewhere, away from my inquisitive eyes, the animals are still slaughtered and I wonder who catches their blood.", "source": "Fresh Daily Bread"}