{"published": "2015-09-08T11:14:20Z", "media-type": "News", "title": "International bikers all set to tackle Himachal's off-road tracks", "id": "4fddc3a1-5425-486f-b62a-2f59af03fd53", "content": "Top-ranking foreign and domestic mountain bikers will test their endurance and skill in one of the world's toughest terrains when the MTB Himalaya gets rolling from here on the off-road tracks of Himachal Pradesh on September 27.This year's edition - the 11th - will see the highest number of foreign participants so far. The highest number of riders are from Portugal, Spain and Germany, apart from India.The event will conclude at the starting point on October 4 after traversing 550 km.\"We have got confirmation from more than 40 bikers. They are from 10 countries. This will be the maximum participation of foreign cyclists,\" Mohit Sood, president of the Himalayan Adventure Sports and Tourism Promotion Association (HASTPA), the Shimla-based organiser, told IANS. \n\nWorld No.9 Luis Leao Pinto from Portugal, ABSA Cape Epic winner Catherine Williamson from Britain, nine-time German champion Reimund Dietzen, Andreas Hartman and Manuel Wesseinbacher (both from Austria), and Sonia Lopes, the first woman cyclist to conquer the non-stop 500 km Portugal Bike Race, are among the internationally-acclaimed riders, besides over 50 Indian cyclists.Titan desert MTB Marathon champion Pinto was the MTB Himalaya champion in 2013 in the men's category, while Lopes, the mother of a four-year-old boy, won the MTB Himalaya women's category last year.After winning the title, Pinto had told IANS that he had conquered ranges from 2,000 metres to 2,300 metres in Europe, but the mighty hills of Himachal Pradesh will be challenging for him.For Lopes, coming to India was well within the budget. \"It's quite expensive while cycling in Europe,\" she said. \n\nPau Zamora, Antonio Ortiz, Ibon Zugasti and Sarah Pasco, all from Spain, Nepal national champion Ajay Pandit Chettri, Magnolia Bike Challenge champion Balboni Vanni, Andi Shewald from Germany and British National Road Champion Sharon Laws will also vie for the title in the open men solo, open women solo categories.Canadian national biking champion Cory Wallace, who won the MTB Himalaya last year, said the rally was more professionally managed.\"I have travelled more than 40 countries for MTB. Here the organisers are more professional. Moreover, the terrain is perfect for high-altitude training,\" the three-time champion of the Mongolia Bike Challenge said.\"I am participating in the MTB Himalaya as I want to learn about the country and its people,\" German champion Dietzen told the event organisers.\"My favourite race was always the Vuelta a Espana. But now I am looking forward to Himalaya,\" the 56-year-old biker added. \n\nBritish rider Catherine Williamson said: \"The reason I am racing Hero MTB Himalaya is because it's a part of the world I have never visited and know very little about and I'm hoping to inspire other girls to ride and travel as much as possible.\"\"I am looking forward to meeting equally crazy and adventurous riders and expect the challenge to be against the environment and terrain which is what appeals the most,\" she added.Forty-seven-year-old Italian and winner of Iron Bike 2008 Vanni is participating in the MTB Himalaya because he likes difficult challenges.\"Dominating the Himalayas will be my ultimate achievement,\" he added.Event organiser Sood said the participants would pass through forest trails, off-road, broken tarmac, gravel, rocks, mud, sand, loose rock and unmetalled rural roads.On an average, each cyclist will pedal 80-90 km every day with one day of rest in between and will have to ascend 2,000-2,500 metres each day. The highest point of the rally is 3,150 metres or 10,500 feet.Sood said the most exciting route is the 18-km long mule track from the picturesque village of Kullu Sarahan, about 170 km from the state capital, at the base of the 3,277-metre Bashleo Pass, to Tarala.The entire route passes through a mountain ridge.", "source": "5 Dariya News - English"}