{"published": "2015-09-22T16:29:33Z", "media-type": "News", "title": "Tory Burch Introduces Tory Sport, a Performance Activewear Line", "id": "0e6322f3-70fc-4996-9073-81c7d2d2f58e", "content": "NEW YORK , Sept. 22, 2015 /PRNewswire/ --Tory Burch LLC announces the launch of Tory Sport . \n \nThe activewear collection includes clothing, bags, shoes and accessories for Running, Studio, Tennisand Swim, as well as Coming & Going, a category of pieces that can be worn before and after a workout. \n \nTory Sport will be available exclusively at torysport.com and at a pop-up shop in New York City beginning in September with a Flatiron-district store to follow in 2016. The pop-up shop will be located on Elizabeth Street in the space where Tory launched the brand's first boutique 11 years ago. \n\n \nCEO and Designer Tory Burch said: \"We focused on the elegance of sportthe performance aspect is a given, not a design detail. I have always been passionate about sports, and activewear is something I have wanted to do for years. Classic silhouettes from the Seventies have always resonated with me. Our goal was to design a collection that balances fashion and function.\" \n \nTory Sport is designed to reflect the beauty of the game and the empowering role that sports play for women. To help women fearlessly follow their dreams, the brand supports the Tory Burch Foundation, which empowers women entrepreneurs by providing access to capital, education programs and networking events. \n \nThe Collection \nInspired by the grace and strength of athletes, Tory Sport speaks to the active lifestyle of women who take a wear-anywhere approach to sports-influenced clothing. The silhouettes range from pleated tennis skirts, anoraks and fitted leggings to rashguards and swimwear. Stylish separatesneoprene coats and skirts, oversized sweaters and classic track suitscomplement the performance pieces. \n \nOld-school stripes and florals are modernized by precise detailing and high-tech materials that ensure the ultimate in fit and performance, including COOLMAX Fabric by INVISTA, which maximizes performance with moisture-wicking and quick-drying technologies that help you go the extra mile; Schoeller Fabric with NanoSphere , a durable performance fabric that repels water, oil and dirt to keep you clean and dry; and Sensitive Fabrics by EUROJERSEY, which resist chlorine 10 times more than most fabrics  and provide the benefit of four-way stretch, UV protection and a long-lasting fit. \n \nTory Sport is a distinct brand with its own logo, digital commerce site, packaging and social channels. Prices range from $55 for performance tops to $550 for outerwear. \n \nThe Pop-Up \nThe Manhattan pop-up shop is a modern take on old country club glamour. A white stucco facade  with blue awnings piped with white scalloped edges, white latticework and sun-bleached pink doors  sets the tone for a retro interior with bold design details. \n \nCrisp white board and batten walls, wainscoting and wide-plank floors create a relaxed and easy setting. Courtside seats and canvas-covered armchairs with blue and green varsity stripes, a graphic surfboard and a vinyl letter press where customers can personalize select designs add fresh pops of color. \n \nAbout Tory Sport \nTory Sport is a performance activewear collection that celebrates the elegance of sport. Inspired by the grace and strength of athletes, Tory Sport balances high-tech fabrics with classic design. Each style is crafted to reflect the beauty of the game and the empowering role that sports play in all aspects of a woman's life. Tory Sport supports the Tory Burch Foundation, which empowers women entrepreneurs by providing access to capital, education programs and networking events. \n \nAbout Tory Burch \nTory Burch is an American lifestyle brand that embodies the personal style and sensibility of its Chairman, CEO and Designer, Tory Burch . Launched in February 2004 , the collection includes ready-to-wear, shoes, handbags, accessories, watches, home and beauty. There are more than 160 Tory Burch boutiques across North America , Europe , the Middle East , Latin America and Asia , and the brand is available at over 3,000 department and specialty stores worldwide and toryburch.com. \n \nStore Details \nTory Sport Pop-Up Shop \n257 Elizabeth Street  \nNew York, New York 10012 \n\n \nPhone: 212.334.3000 \n \nHours: \nMondayFriday: 11 AM  7 PM \nSaturday: 10 AM  7 PM \nSunday: 11 AM  6 PM \n \ntorysport.com \n@torysport \n#torysport \n \nCOOLMAX is a trademark of INVISTA. \n    \nPhoto - http://photos.prnewswire.com/prnh/20150921/269090 \n \nPhoto - http://photos.prnewswire.com/prnh/20150921/269092  \n \nLogo - http://photos.prnewswire.com/prnh/20150921/269091LOGO  \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/tory-burch-introduces-tory-sport-a-performance-activewear-line-300146657.html \n \nSOURCE Tory Sport \n \nCopyright 2014 PR Newswire.  All Rights Reserved \n\nSource:PR Newswire.\r\n All Rights Reserved", "source": "VideoBasedTutorials"}