{"published": "2015-09-10T21:25:35Z", "media-type": "News", "title": "Spy Shot: 2016 Nissan LEAF", "id": "508d9ab3-b836-48ad-8a72-65f36fe54f0d", "content": "Via EV Obsession : \n \nWith the release of the 2016 Nissan LEAF still quite a ways off, one might not expect people to be so impatient that they’re taking pictures of suspicious-looking Nissan LEAFs at the company’s headquarters in Franklin, Tennessee… But that person would be wrong. \n \nThanks to one particularly enthusiastic blogger, we now have a picture of what may very well be the (an early version of the?) 2016 Nissan LEAF. The giveaway in this case is the fact that the LEAF in question features a paint color that is unavailable for extant models but expected to become available for the 2016 model. Hmmm. \n \n\n \nElectrek provides more information and commentary: \n \nNissan has been careful not to release too much information about the 2016 update of its flagship electric vehicle, the LEAF, most probably not to hurt the sales of its current model. Though we learned through information leaked from dealerships that Nissan should offer a bigger battery pack option for more range in the 2016 version. The new model is expected to arrive at the end of month like most 2016 cars, but we have yet to get an official launch date or see one in the flesh, until now… \n \nBlogger JP White spotted a Nissan LEAF with a new ‘Forged Bronze’ paint job at Nissan HQ in Franklin TN (see picture above). Forged Bronze is not available for the 2015 model, but is expected to be for the 2016 version. The car also had “manufacturer tags”. Since the 2016 version is not expected to see any significant exterior design changes, this could very well be a 2016 LEAF and the first sighting of one in the US. Hopefully this means we are close to the launch because Nissan’s LEAF sales have been suffering lately ahead of the 2016 launch. \n \n… Or it could simply be a 2015 Nissan LEAF with a paint color that’s currently unavailable to the great unwashed masses. It is the company’s headquarters, after all — perhaps it’s just a matter of someone getting a slight insider favor? It is a nice color, I admit. \n \nWe’re hoping it’s a 2016 LEAF. And hopefully we’ll have a lot more info on the 2016 LEAF soon — sales have indeed been suffering . In the meantime, we covered the rumors here:  2016 Nissan LEAF With 110-Mile Option? I’m Stoked!  \n  \r\n    \r\n    \r \nTags:  2016 Nissan Leaf , Nissan , Nissan LEAF \n\n\r\n\r\n    \r \n About the Author    \nJames Ayre 's background is predominantly in geopolitics and history, but he has an obsessive interest in pretty much everything. After an early life spent in the Imperial Free City of Dortmund, James followed the river Ruhr to Cofbuokheim, where he attended the University of Astnide. And where he also briefly considered entering the coal mining business. He currently writes for a living, on a broad variety of subjects, ranging from science, to politics, to military history, to renewable energy. You can follow his work on Google+ .", "source": "Gas 2"}