{"published": "2015-09-23T16:28:29Z", "media-type": "Blog", "title": "Film Review: A Walk in the Woods ***", "id": "477d4ffa-80ef-4746-b4e8-3bebe3553eca", "content": "FILM REVIEW A Walk in the Woods Robert Redford, Nick Nolte; Dir: Ken Kwapis It’s nice to see two older actors starring in a film, but a little hard to reconcile it with the fact that the book, written by Bill Bryson, depicts two travellers in their Forties. The plot is simple. Following a funeral, Bryson (Redford) has something of a very late mid-life crisis, and decides to walk the Appalachian trail, all 2000-odd miles of it. His wife (Emma Thompson, as usual portraying someone far older than her years) is completely against the idea, but grudgingly lets him go provided he takes along a companion. Enter, staggering, Nick Nolte as his old friend who gets invited by accident and decides he is in great shape and can do the walk. There is little more to it than that. The film starts with Bryson being interviewed on television by someone who clearly has no idea about him, and there are several more funny scenes dotted like way markers throughout the film. Otherwise there’s only so much you can do with two grumpy/jolly/chatty old men coming into shot, passing, then walking away again. The scenery looks wonderful and there are some nice small parts for Thompson and Mary Steenbergen. The chemistry between Redford and Nolte (a part he originally wanted to play with Paul Newman) is nicely portrayed, and there’s a familiar moment when they look at a lake from an impossibly high cliff top. You almost expect him to say “you do the thinking, Butch – that’s what you’re good at!” It’s a small film, good fun while it lasts, and has some poignant moments, but you really do need to suspend your disbelief that two inexperienced unfit old-timers could actually even attempt something this gruelling, a problem that didn't arise with Reese Witherspoon in Wild. Still, it’s pleasant to see the stars flexing their acting muscles again. Glyn James, Tudno FM", "source": "Glyn James - film reviews"}