{"published": "2015-09-16T10:11:20Z", "media-type": "News", "title": "Photograph 51 – Noel Coward Theatre, London", "id": "9a339025-42d5-4243-a049-9ffd4453962f", "content": "Writer: Anna Ziegler \n \nDirector: Michael Grandage \n \nReviewer:  Andy Moseley \n \nThis is a frustrating play. It marks the West End return of one of Hollywood’s finest actors, and it tells the story of the greatest scientific discovery of the 20 th century. There are deception, rivalries, stolen ideas, missed opportunities and personal and professional sacrifices made in the name of science and careers. And yet, for all this, it is still a frustrating play, never quite seeming to do justice either to the story, the central characters, or the acting talent at its disposal. \n \nTo get it out of the way at the start, Nicole Kidman is excellent as Rosalind Franklin, capturing the mixture of professional detachment and seeming incomprehension that there was any other way to be, that appears to have been a defining feature of Franklin. Franklin took the photograph that lead to the discovery of the double helix that unlocked the mysteries of DNA and what life is made of. However, she didn’t realise just what it was that she had discovered, or at least did not trust her initial findings sufficiently enough to go public with them in the absence of corroborating evidence. As a result, and in less time than it took her to gather such evidence, photograph 51 was seen by James Watson who, along with Francis Crick, used it, together with data from throughout the scientific community, to unlock the secret and take credit for its discovery. \n \nThe focus in Photograph 51 is largely on Franklin and the stubbornness that led to her losing her rightful place in scientific history, as well as alienating many of those around her and possibly ruining her chances of personal happiness. That Franklin was ‘unspeakably difficult’ is stated many times, but the script seldom illustrates this with anything other than pedantry, put downs and an insistence on being correctly referred to. Given her achievements and the dismissive and sexist nature of the male dominated environment she entered in London, these were not unreasonable responses from her. There are hints of more depths to her male contemporaries, but these are not really developed and what we see of them are too often little more than stereotypes serving the story rather than real people. \n \nThe brief moments where Franklin drops her guard, allowing PHD student Don Caspar (Patrick Kennedy) to call her an abbreviated version of her first name, or admit to herself about what she lost as a result of her focus on science, add to the strength of Kidman’s portrayal, rounding it out without ever drifting into mawkish sentiment. The problem is that whilst we are seeing this, little is said about any further research she was doing and the race, such as it is, is being won by Watson and Crick without the audience ever really knowing how far she was lagging behind, or how close she may have been. \n \nThe scenes combining the loss of that race with the outcome of the relationship with Caspar bring out the sacrifices she made in a very effective way, and the scenes showing how small changes could have lead to very different outcomes give a poignant and powerful ‘what-if’ scenario, but the play as a whole makes too little of the dramatic tension in the scientific story, and does not offer the deeper exploration of the individual at the heart of it that the ending at least alludes to. \n \nIt is a good play with an excellent central performance by Kidman, but without the star vehicle behind it, it is unlikely that the play itself would draw anywhere near as much attention as it is receiving. \n \nRuns until 21 November 2015| Photo: Johan Persson \n   \n\r The Public Reviews \r \r \n   \n\r \r Frustrating \r \n  User Rating:   No Ratings Yet !", "source": "PublicReviews.com"}