{"published": "2015-09-03T04:15:23Z", "media-type": "News", "title": "Terrelle Pryor down to last chance", "id": "0196c697-db18-4a30-9394-a32241a39791", "content": "Former QB will test hamstring vs. Bears \n\nCLEVELAND — Terrelle Pryor doesn’t want a handout. No, thank you. \n\nIf he’s going to make the Browns’ roster as a wide receiver, Pryor, the former NFL quarterback with extraordinary physical gifts, intends to earn it. He’s had to go it alone most of his life, and isn’t seeking favors as he faces perhaps his last chance to prolong his pro career. \n\n“I don’t like being given anything,” he said. \n\nSlowed by a nagging hamstring injury for the past month, Pryor may finally get to showcase his progress in switching to wide receiver today as the Browns visit the Chicago Bears in the final exhibition for both teams. Final roster cuts come Saturday. \n\nThe Browns have been impressed with Pryor’s work ethic, diligence and skills in practice. They haven’t seen him perform in a game, and until they do, there’s no way to know if he can help them.  \n\nCoach Mike Pettine wouldn’t define this as “make or break” for Pryor, but the Browns can’t afford to fill a spot on their 53-man roster with potential.  \n\nThey need playmakers. \n\nPryor had been expected to play last week at Tampa Bay, but the Browns decided to hold him out to give the hamstring extra time to heal. The 6-foot-4, 225-pounder said the frustrating injury has impeded him from bursting off the line of scrimmage, but he’s determined to give it a try against the Bears. \n\nHe’s not 100 percent healthy, but he’s almost out of time. \n\n“I’m sure it will come back eventually, but right now I’m dealing with the circumstances I have,” he said following Tuesday’s practice in steamy conditions. “That’s to make a play on a leg and a half, I guess.” \n\nPryor’s intriguing potential has the Browns in a bit of a bind. Do they keep him on their roster based on his upside? Or risk releasing him and Pryor catching on with another team? \n\nWith Pettine expected to keep at least six wide receivers, the decision on Pryor could come down to either him or Vince Mayle, the club’s fourth-round pick from Washington State. Mayle, who has struggled with dropped passes in training camp, could wind up on the practice squad. \n\nFrom the start of training camp, Pryor has drawn rave reviews from teammates. Pro Bowl cornerback Joe Haden and fellow wideout Dwayne Bowe believe that Pryor cannot only play wide receiver, but star. \n\nThe compliments have fueled Pryor. \n\n“I can’t fathom the feeling for me to have a guy like Joe Haden, Dwayne Bowe and guys like that to speak up for me on my behalf,” he said. “It doesn’t get any better than that.” \n\nPryor’s hamstring issue could be a result of him doing more running than ever before, and he’s been comforted to learn that good friend, Steelers star receiver Antonio Brown, has had the same problem this summer. \n\nPryor knows his time with Cleveland could be down to a few precious days. If he can’t play, or doesn’t perform well against the Bears, he may be released, which has happened to him three times before. \n\nStaying would mean a new start for Pryor, but he would rather prove he belongs. \n\n“Growing up I’ve been by myself, moving out of different places by myself since I was 12 years old,” he said. “I really didn’t have a figure, people to show me the way. Anything I have I’ve worked for it by myself. I want to earn everything I have or get.”", "source": "Toledoblade.com"}