{"published": "2015-09-29T13:03:55Z", "media-type": "Blog", "title": "Sustainable Family Crib in Mexico Embedding Privacy Protection", "id": "b8c90189-4a6f-49f3-8952-0774aa227f16", "content": "Designed by Grupo Arquitectura , this modern family crib known as Dalias House is located in Mexico City. Concrete and steel make up the basic structure of the Dalias House. Glass comes in to offer an openness that helps integrate the outdoors in the interior spaces and create an unbreakable bond between the two. Imported furniture and automated electrical systems compose both visual and technological appeal. A comfortable ambiance reigns inside. Outdoor spaces are what give this house the feeling of freedom. \n\nThe first impression fails to showcase the connection between interiors and outdoors, as the closed volumetric architecture focuses on the importance of home privacy, as well as space orientation. \n\n\n\nPhotos by Agustín Garza show two separate limestone volumes that shape the 11,840 square foot home. These two separate geometric volumes have been imagined to be almost closed to the street. The transparency of this house was aimed at the garden, making the family feel safe and allowing them to have both privacy and openness. \n\nThe main lobby keeps all spaces connected. From this central spine, the flow between the rooms all guide your steps to the garden. Terraces facing south and west capture and draw natural light deep inside the home. Imagined to be both suited for sunshine-filled days when you want to spend time by the pool but also have some shade inside, when you decide to call it a day, aluminum sunshades were mounted on top of floor-to-ceiling windows . \n\n\n\nBeige limestone, black granite, leather, all these are textured colors that can be found inside this modern family crib. Pops of color were embedded through furniture and furnishings, but the largest color splash is the green garden. Neutral colors shape a versatile environment that can become a joyful opportunity to decorate as they please. \n\nSustainability features ensure owners have a constant pleasurable environment. Optimal space orientation, solar cells heating the pool water and domestic use and radiant heating, alongside recycling wastewater for irrigation and water purification filters maintain a balance in the house’s environmental responsibility. Check out the 10 of the hottest green technologies for an in-depth look at what modern homes flaunt these days. \n\n                              \n\nThe post Sustainable Family Crib in Mexico Embedding Privacy Protection appeared first on Freshome.com .", "source": "Freshome.com - Interior Design & Architecture Magazine"}