{"published": "2015-09-28T13:00:15Z", "media-type": "News", "title": "A Season in Review: Tennessee Smokies", "id": "ae1bfa66-3a8f-4677-9600-85ab1fea5cf7", "content": "Game Time Photo Credit: Ted Eley \n\nA team that features both of the Cubs Minor League Players of the Year in Ryan Williams and Willson Contreras, the Smokies finished 3rd in a prospect-laden Southern League North and just missed out on the playoffs. From my visit there, the Smokies had a free-flowing club house even through a lot of transition. The veterans such as Corey Black and Anthony Giansanti allowed the youngsters, Billy McKinney, Albert Almora Jr. and others, to flawlessly fit in. Smokies Park is also a great place to catch a game, and the view from home plate to center is truly a unique perspective for a ballpark. Now, onto the loaded roster:\n\nWillson Contreras: The Cubs Player of the Year for a position player, Contreras improved his stock more than any other Cubs prospect this year. Signed out of Venezuela for $850,000, Contreras had always been solid defensively before bursting out at the plate this year after a successful Winter League stint. The catcher ended the year with a .333/.413/.478 line and took home the Southern League batting crown. He also had an impressive 10.9% BB% compared to an 11.9% K%, truly a fantastic season at the plate. If he’s able to replicate his line-drive swing and solid defense into AAA next year, a mid-season promotion could be in the cards. Expect him to be a top 5 prospect on many evaluators lists this offseason.\n\nJeimer Candelario: We all know of his struggles at the High-A level and subsequently Low-A last year, but Candelario put in a lot of work this last off-season to prove he could handle the bump up to High-A. And he passed the test with flying colors. After being promoted from Myrtle Beach 2/3 of the way through the season, Candelario took off when he reached the Smokies. In his 46 game stint with the team, he hit .291/.379/.462, showing an impressive approach at the plate to go along with more power than he showed at Myrtle Beach. Defensively at third he was able to handle himself well, and has soft hands for the position, although he is a little groggy at third. Candelario will certainly move up lists this offseason, and is probably a top 10 prospect after his terrific season. During the season I was able to interview Jeimer which you can find here (http://www.chicagonow.com/cubs-prospect-watch/2015/05/an-interview-with-jeimer-candelario/)\n\nDan Vogelbach: Injured running to first early in the season, Vogelbach missed a good portion of the year, but still ended up with 81 games to his ledger. With the Smokies he showed a very solid plan at the plate, and continued to hit for impressive power. His OBP ended the year at over .400 (.403) at the AA level which is telling. Although he likely doesn’t have a future with the Cubs, he put together another solid year statistically and is an appealing trade piece for many AL clubs.\n\nAlbert Almora Jr.: Very young for the league at just 21, Almora struggled the whole entire first half of the season before coming on strong in the second. He ended the year with a .272/.327/.400 line, which was quite solid considering his poor start. He also hit six bombs, and walked more than twice as much last season. I caught eyes on him in the midst of his slump, and he looked very confused at the plate, flailing at a lot of low off-speed pitches. However, as the season wore on, he began to feel more comfortable in the box and it showed. As always, Almora showed off his impressive defense at center throughout the year, leading many to believe he could be plus out there at the current moment.\n\nBilly McKinney: The Texan continued to do what he has done his whole professional career, hit for average and show an impressive feel at the plate. In 106 games, McKinney ended the year with seven homers and a .300/.371/.454 line across the High-A and AA level. Some evaluators grade out his hit tool as plus, and he has the potential for average power as he gains a little more strength. In the field he doesn’t have the speed for center so is limited to a corner spot, where he should be average defensively. Another productive season for McKinney, who is also likely a top 7 prospect heading into the offseason. I also was able to interview him at Tennessee (http://www.chicagonow.com/cubs-prospect-watch/2015/06/interview-with-billy-mckinney/)\n\nCorey Black: The 24 year-old Californian struggled after his move to the Smokies bullpen, where he showed little command of his plus pitches. Standing at 5’10”, Black is relatively small for a pitcher but understands this and is willing to work low in the zone with his plus fastball and above-average slider. He’s a very level-headed ballplayer, and I think his struggles this year will force him to work even harder this offseason. Hopefully learning to better repeat his release point, which would lead to better command. If he doesn’t take a step forward next season with his control, this could be the end of the line in terms of a prospect for the San Diego native. I was able to conduct my favorite interview of the season with him, which you can find here (http://www.chicagonow.com/cubs-prospect-watch/2015/06/get-to-know-chicago-cubs-top-prospect-corey-black/). He’s a great person and I wish him the best of luck in his journey to the majors.\n\nPierce Johnson: The Missouri State product once again suffered from a few injuries this year, but he was still able to accumulate 95 innings at the AA level and is going to the AFL for more. Johnson’s ERA was 2.08, though his FIP was 3.47 due to a low 6.82 K/9, among other things. After coming back from injury, he regained his velocity, now sitting in the 91-93mph region and can reach back for more. His fastball and curve still grade out as above-average to plus pitches when he has a consistent release point, and if he irons out his release his control should improve. At the moment, the control is pretty much the only thing keeping him out of the Cubs rotation and he should be in contention of joining it by mid-season next year.\n\nRyan Williams: An East Carolina graduate, Williams was drafted in the 10th round in 2014 and has proceeded to carve up the minors. The Pitcher of the Year in the minors for the Cubs, Williams posted a 2.16 ERA across two levels while finishing the year with 141.2 innings. The former Pirate has a large and thick base, and has the perfect body for a back-end starter. Williams fastball sits in the low 90’s, and he really attacks hitters with it, trying to get ahead in the count early. His command of the fastball allowed him to easily maneuver through Low-A lineups, and he met a tough test at AA but passed on the back of the pitch. Williams complements the fastball with a slider and 12-6 power curveball in the 82-84mph range. He was able to go deep into starts, and if he continues to get batters out in the upper minors, he should be in contention of joining the Cubs at some point next year.\n\nType your email address in the box and click the \"create subscription\" button. My list is completely spam free, and you can opt out at any time.", "source": "Chicago Now"}