{"published": "2015-09-29T09:55:40Z", "media-type": "Blog", "title": "Influential Emirati Business Leader And Commentator: \"Iran Deal Goes From Risky To Farcical\"", "id": "41cec01d-82f7-4f37-8bc6-ceff3f13c899", "content": "Influential Emirati Business Leader And Commentator: \"Iran Deal Goes From Risky To Farcical\" HT: Memri.\nAt First, \"I Shrugged Off The News\" Of The Secret Agreement \"As A Figment Of Someone's Heated Imagination\"\nIn his August 25 article, Al-Habtoor wrote:\n\"When I first learned from the news that the International Atomic Energy Agency (IAEA) had signed a secret agreement permitting Iran to self-monitor at least one of its major nuclear sites, I shrugged off the news as a figment of someone's heated imagination.\n\"It is inconceivable that the world's nuclear watchdog, known for its professionalism and stringent monitoring, would sign off on something so bizarre – or so I initially believed.\n\"Iraq, whose nuclear activities, both civilian and military, were dismantled following the Gulf War, certainly did not get off that lightly. Even after years of intrusive inspections, the IAEA under the directorship of Mohammed ElBaradei declined to present Iraq's deserved clean bill of health to the UN Security Council prior to the US-led invasion.\n\"Yet the Islamic Republic of Iran, that has been spinning thousands of centrifuges to enrich uranium beyond accepted civilian levels and has refused to come clean on its past activities in this sphere, is trusted to inspect itself.\n\"The IAEA cannot be accused of lacking innovation. Perhaps we will soon see drivers suspected of being under the influence allowed to test their own substance levels. Moreover, given that the ayatollahs, whose mantra is 'Death to America,' are suddenly considered trustworthy, years of negotiations could have been avoided. A simple affidavit signed by the Supreme Leader would have sufficed just as well. Something does not smell right here.\"\n\"The Obama Administration's Claim That The U.S. Was Not A Party To This Agreement\" Is \"Just As Fishy\".\n\"Just as fishy is the Obama administration's claim that the U.S. was not a party to this agreement specific to the Parchin Military Complex – known as Separate Arrangement II – when it was approved by all P5+1 countries.\n\"A White House spokesman has confirmed the administration is 'comfortable' with the terms of the confidential side agreement between Iran and the IAEA. Are we to suppose that the IAEA took this dangerous, lackadaisical approach off its own bat?\n\"According to a leaked draft of this 'Separate Arrangement' divulged by the Associated Press, Iran is bound to provide the IAEA with photographs and videos of the various locations within Parchin, together with environmental samples. The question remains, how can those photos, videos and samples be verified as relating to the Parchin complex – and even if they are legit, who is to know whether or not they have been cherry-picked?\n\"President Obama's assurances that Iran's activities would be subject to 'unprecedented verification' sound ever more hollow. The IAEA has been barred from this site, suspected of carrying out explosives tests related to nuclear weapons, since 2005 and now it has assented to being locked-out for the duration, which is out of character.\"\nLike Other UN Bodies, The IAEA Too Is Now Politicized.\n\"This surrender on the part of the IAEA leads me to believe that like so many other UN bodies, the IAEA is politicized; in this case, it has shaped its usual rock-solid strategies to suit political goals. However it is spun, this does not amount to 'the most robust inspection regime' ever, as touted by the Obama administration.\n\"The AP news report has been slammed by the IAEA as 'misleading.' However, the agency's Director General Yukiya Amano has not disclaimed the draft's published content. He insisted that the arrangements are in conformity with long-established IAEA practices, while emphasizing that he has 'a legal obligation not to make them public.' One is left wondering why the public, not to mention U.S. lawmakers, are being left in the dark.\"\n\"My Suspicions That Iran Is Being Deliberately Empowered To Fit A Geopolitical End-Game Are Heightened\".\n\"I have been against this unsatisfactory arrangement with Iran since day one, primarily because of its narrow remit. An acceptable deal would have been conditional upon Tehran ceasing its troublemaking and its attempts to topple governments throughout the region.\n\"My view broadly reflects the opinions of many of Iran's neighbors, who are rightly fearful that the lifting of sanctions will see Iran's coffers overflowing into the hands of its armed proxies.\n\"President Obama has repeatedly countered our concerns on the grounds that curbing Iran's nuclear ambitions for 10 years is better than no deal. I did not find his arguments credible then, but now that the existence of secret side agreements have come to the fore, my suspicions that Iran is being deliberately empowered to fit a geopolitical end-game are heightened.\n\"I would love to know why a country that has been hostile to Western powers and their allies since its inception in 1979 is being so rewarded. Or is this animosity with the West just a farce to fool us?\"\n\"Obama Has Been... Bribing America's Middle East Allies, Appealing To The American People, And Playing The Heavy With Congress To Seal His Deal, To The Point Of Being Unseemly – At Stake Is His Legacy\"\n\"European capitals are eyeing up lucrative trade deals and planning to reopen their embassies in Tehran. Iranian-Russian trade is set to expand exponentially... Iran's oil industry is gearing up to expand production of crude to pre-sanctions levels, which could see already depressed oil prices spiraling to new lows.\n\"Obama's hard-sell campaign is not working, despite his frequent appearances on U.S. news networks to plug the deal for all he is worth, and his furious lobbying of Congress. He has even resorted to pleading with the American people to press their Congressional representatives to vote 'yes,' but is making little headway. A recently released CNN/ORC poll indicates that 56 per cent of Americans want Congress to reject the deal.\n\"Just about every Republican presidential hopeful – with the exception of Jeb Bush who is on the fence – vows to undo the deal and re-impose sanctions; most of their Democratic rivals are trying to distance themselves from the topic.\n\"Congress has 60 days to put the issue under a spotlight and is set to vote early next month on a 'Resolution of Disapproval.' If the vote fails to go in the President's favor, in theory Congress could prevent him from lifting sanctions against Iran. Obama has threatened to use his veto, risking putting the White House and Congress on a war footing. It will take a two-thirds majority in Congress to override that veto.\n\"President Obama has been browbeating and bribing America's Middle East allies, appealing to the American people and playing the heavy with Congress to seal his deal, to the point of being unseemly. At stake is his legacy. It is my hope that America's lawmakers will vote in sufficient numbers to ensure that we in this part of the world are not doomed to pay the price.\"[2]\n\"Europe's Unseemly Haste To Embrace Tehran\"\n\"The Mullahs Have Gone From Zero To Hero In The Blink Of An Eye\"\nIn his August 31 article, Al-Habtoor wrote: \"The ink hardly dried on the Iran nuclear deal before European countries were racing to seal trade deals and reopen embassies. The mullahs have gone from zero to hero in the blink of an eye. Forgotten are Tehran's links to terrorists, attempts to overthrow Middle Eastern governments and mass gatherings organized to hurl insults and threats at the West.\n\"Cast aside are concerns about Iran's suppression of minorities, its dismal human rights record or its practice of stoning women. I believe Iran has made no substantial statements to the effect it is willing to change. On the contrary, its message throughout has been one of defiance. It has not been required to denounce terrorism let alone its participation in terrorist acts.\n\"Iran's crimes are suddenly of no consequence to Europe's democracies; I believe they have purposefully put their blinkers on and are literally queuing with their hands out to beat down Tehran's golden doors. All they see now are flashing neon dollar signs. The Islamic Republic, soon to be flush with an $80 billion plus bonanza, is destined to become Europe's latest cash cow.\n\"I was extremely disappointed and saddened at Britain's rush to reopen its Tehran embassy that has been closed for four years subsequent to coming under mob attack in November, 2011. I have always had great respect and admiration for the UK that I consider my second home, based on my homeland's historic ties and the principled stances taken by great leaders like Winston Churchill and Margaret Thatcher, who kept the 'Great' in Britain, politically, militarily, industrially and economically.\n\"I cannot imagine that those prime ministers, whose names remain engraved on world history to this day, groveling before a country that five minutes ago was their enemy, just to get their clutches on a fistful of dollars.\"\n\"Iran's Crimes Are Suddenly Of No Consequence To Europe's Democracies; They Have Purposefully Put Their Blinkers On\" \"The UK's Foreign Secretary, Philip Hammond, was the first to beat a track to Tehran since 2003. Naturally, he arrived with a trade delegation and took the opportunity to stress the 'huge appetite' shown by British business to invest in Iran as well as the readiness of British banks to finance deals.\n\"As the Iranian network Press TV has reported, Iran has recently hosted 'a delegation of government ministers from Italy,' who has signed a Memorandum of Understanding to fund industrial, construction and infrastructure projects worth over 3 billion euros. This comes on the heels of a visit by Germany's Minister for Economic Affairs and Energy, Sigmar Gabriel, with a team of manufacturers, as well as visits from Austrian, Serbian, Swiss and Azerbaijani government officials. Spain is also champing at the bit to board the gravy train.\n\"Moreover, President Hassan Rohani has been invited to visit Rome 'in the coming weeks'. Rohani's red carpet travel schedule is getting fuller by the day. Following a visit to Tehran by France's Minister of Foreign Affairs and International Development, Laurent Fabius, accompanied by business leaders, he has been invited to visit the Elysees Palace in November. Russia and China, which have always been cosy with Tehran, are waiting in the wings with lucrative energy and weapons contracts at the ready.\n\"No doubt President Barack Obama is rubbing his hands together awaiting his turn to get in on the action, delayed by pesky lawmakers who refused to take his word that his deal is the best thing that has happened since the invention of the wheel.\n\"Iran and its Lebanese proxy in Lebanon, Hezbollah, have not changed. Nevertheless, America inexplicably saw it fit to remove those entities from its terror threat list even as it is fighting to preserve Syria's Killer-in-Chief and supporting a Houthi takeover of Yemen.\n\"At least one senior Iranian official has gleefully announced his country's continued support for 'resistance' groups, which translated means their armed minions and spies targeting Arabian Gulf States. Who can blame Iran's Arab neighbors for being rattled when a massive cache of weapons were recently discovered in Kuwait in the hands of a Hezbollah cell poised to create mayhem and bloodshed!...\"\n\"A 'Grand Bargain' Between The West And Iran Is Unfolding Before Our Eyes\".\n\"I am starting to wonder whether there is more to the nuclear deal, which permits Iran to carry out self-inspections of its suspect Parchin Military Complex, than meets the eye - especially when there are other secret agreements between Iran and the International Atomic Energy Agency which the nuclear watchdog is legally bound not to disclose, even to the U.S. and the other P5+1 countries. Believe that if you will!\n\"In this case, one can only speculate about the existence of other secret arrangements between Iran and the Obama administration that has displayed unprecedented determination to ensure the deal passes muster with Congress and has gone to extreme lengths to persuade America's longstanding Middle East allies to come on board, including invitations to the leaders of Gulf States to weekend talks at Camp David. Likewise, President Obama is trying, unsuccessfully, to bribe the Israeli Prime Minister Benjamin Netanyahu into silence with a massive 'military compensation package.'\n\"The Shah of Iran may have sat on the Peacock Throne, but it is my bet that Iran's Supreme Leader Ali Hosseini Khamenei is strutting around like a peacock these days, his feathers plumped up by European sycophants and endless praise from U.S. officials.\nHe is getting everything for nothing. Iran's nuclear infrastructure remains intact, uranium enrichment will be ongoing. Opening up some of the country's nuclear facilities, barring military sites, to intrusive inspections for 10 years is just a mere inconvenience paling by comparison with the glittering rewards.\n\"I warned again and again of the potential of a 'Grand Bargain' being struck between the West and Iran many years ago and now it is unfolding before our eyes. I recall President Obama saying the nuclear deal could possibly lead to normalization of relations with Iran way into the future provided it sticks to its commitments. What is happening now makes a mockery of those cautious words.\n\"Here is another prediction. Those Western leaders prostrating themselves before the Iranian leadership will live to rue the day. Enriched and emboldened, I believe it is only a matter of time before Tehran strikes at their countries interests because its ideology and hatred for all things western are immutable.\n\"The Arab World, in particular Iran's closest neighbors, the Arabian Gulf states, must not only be alert to the coming danger, but should take a leaf out of Donald Trump's book by erecting an impenetrable wall in terms of military, surveillance and intelligence capabilities, to keep Iran, its mercenaries and proxies far from our shores. If we are not careful, the West's lust to bolster their failing economies will leave us hung out to dry.\" [3]\nEndnotes:\n[1] Subheads added by MEMRI. [2] The National (UAE), August 23, 2015. The article was also published on English.alarabiya.net on August 25, 2015. [3] The National (UAE), August 27, 2015. The article was also published on English.alarabiya.net on August 31, 2015. ", "source": "MFS - The Other News"}