{"published": "2015-09-01T19:58:33Z", "media-type": "Blog", "title": "Gloved Season 2 Grand Rapids MMA Johnny Grigware and Magnuson", "id": "b9426d49-1042-4bc0-a7fb-92ed8f0b3819", "content": "Gloved Season 2 Grand Rapids MMA Trainers  Johnny Grigware and Magnuson    On our journey the people we meet sometimes aren’t always the people you’d think we were there to talk to nor is there any method to my madness.      Here on this segment we get to talk to Grand Rapids MMA trainers Johnny Grigware and Magnuson Carlgen. These two guys have a combined 45 years of experience in Kickboxing, Striking, ground work, and various styles that have helped shape the Grand Rapids MMA name into something of a phenomenon in the Michigan MMA world. Johnny talks a little about the intensity at GRMMA and the reasons why a lot of mma fighters fail in the industry. His hardnosed approach to mma is what he believes has weeded out weekend warriors and left behind some of Michigans most exciting talent to fight in the arena. We had the Pleasure of running into some significan Michigan MMA Professional Fighters that train at the GRMMA Facility and we were very pleased to get interviews with all of them ,, you on the other hand will have to wait until we release that footage. So please until then     Take this minute with us to talk with these two gentlemen of the mat and find out what Makes GRMMA one of the Top Gyms to train and advance from in Michigan. You’ll find out that people will travel the world to find the right place to train and or will travel the world and then find their home on the mats at a place they may never of even thought would exist. SomePeople feel lost in the world and this is how they find peace I hope you enjoy this journey into the the hearts and minds of those that get Gloved. Heres a throwback From our First season!! Published on Nov 24, 2013 Facebookhttps://www.facebook.com/Acslivetv Youtube\nhttp://www.youtube.com/user/Keystroke… website www.amateurcombatsportslive.com", "source": "ACSLIVE.TV"}