{"published": "2015-09-18T16:41:05Z", "media-type": "News", "title": "Another Syrian child discovered on Turkish coast", "id": "90215ec0-60a2-443d-9a98-68ceea59b705", "content": "A local enters the sea to help a boat of Syrian refugees arriving on the shores of Lesvos Island in Greece on an inflatable boat from Turkey, August 23, 2015. (Photo by AFP) \n \nTurkish officials say they have recovered the body of another drowned Syrian child in the country’s western province of Izmir, only a couple of weeks after the body of Syrian toddler Aylan Kurdi was washed up on a Turkish beach. \n \nLocal Turkish authorities said the corpse of the four-year-old girl washed up off Altinkoy region in Cesme district, situated 85 kilometers (52 miles) west of the provincial capital city of Izmir, on Friday morning. \n \nInitial investigations suggest that a boat with an unspecified number of refugees was trying to reach a Greek island when it submerged. Turkish coastal forces could eventually rescue 14 Syrians, including eight children. \n \nAn image recorded in history \n \nTurkish gendarmerie forces stand near by the body of Aylan Kurdi, washed up at the shore in the coastal town of Bodrum, Turkey, September 2, 2015. \n \nOn September 2, the body of 3-year-old Syrian child Aylan Kurdi washed up on a beach near the port city of ­­­Bodrum, located some 400 kilometers (250 miles) west of the city of Antalya. \n \nAylan was one of the 12 Syrian refugees, including eight children, who drowned that day after their boat sank en route to the Greek islands in the Aegean Sea. \n \nThe image showing his dead body lying face-down on the Turkish beach riveted millions across the world, and drew attention to the plight of refugees fleeing conflicts. \n \nA large number of refugees, mostly from crisis-hit Syria, Afghanistan, Pakistan and Africa, have in recent years tried to make the perilous sea journey from Turkey to Greece in a bid to continue their trip to reach western European countries. \n \nTaking advantage of the calm summer weather in recent months, the refugees pay large sums of money to human traffickers to make the journey. \n \nSource: Presstv", "source": "Spy Ghana"}