{"published": "2015-09-11T16:55:41Z", "media-type": "News", "title": "Louis van Gaal: Relationship with Manchester United's players is superb", "id": "fbef92b4-c7bc-4011-9a84-8f9efaae1ae8", "content": "Louis van Gaal admits Wayne Rooney and Michael Carrick approached him earlier this season because they had concerns about dressing room morale at Manchester United. \n \nReports this week suggested some United players were unhappy with aspects of Van Gaal's management, principally the style of the team's play and the number of team meetings held by the Dutchman. \n \nVan Gaal conceded United's captain and vice-captain aired their worries with him in a private meeting recently. \n \n''Rooney and Michael Carrick came to me and said: 'The dressing  room is flat.','' the United manager said. \n \nThere was no sense from Van Gaal that he felt the visit from the two senior professionals amounted to a mutiny. \n \nInstead, Van Gaal said he welcomed the dialogue with Carrick and Rooney, and insisted he has a strong bond with his squad. \n \nHe said: ''I think I have a superb relationship with my players. \n \n''In my career as a manager, I didn't have so many who come to say something about the atmosphere in the dressing room or the way we train, or something like that. \n \n''But it is very positive that they are coming to you and that they trust you.'' \n \nThat the story leaked to the media has clearly irked the manager. \n \nTo emphasise his point, he raised his voice in the press conference, mimicking the song the fans sing about him while smashing his fist into his palms. \n \nAn animated Van Gaal added: ''The fans are shouting every week 'Louis van Gaal's army! Louis van Gaal's army!'. They are very satisfied with Louis van Gaal and the players are also satisfied with me.'' \n \nWith the number of incomings and outgoings at the club this summer, Van Gaal always felt there would be a couple of bumps in the road when it came to his players adapting to his management style. \n   \n Share article  \n   \n''I can say only that I have a very good relationship with my players, but it is logical now that only nine are left from the initial group,'' the former Barcelona manager said. \n \n''The others I have bought will not say I am a lousy manager.''", "source": "Crewe & Nantwich Guardian"}