{"published": "2015-09-11T17:22:21Z", "media-type": "News", "title": "Litera Awarded - Innovative Solution Provider of the Year at ILTACON 2015", "id": "10febd5e-cb21-43c9-8afc-41c9c8f35c1e", "content": "LAS VEGAS , Sept. 11, 2015 /PRNewswire/ -- The International Legal Technology Association (ILTA) Peer Awards event concluded its evening with the coveted Innovative Solution Provider Award going to Litera Corp. \n \nAt ILTA's annual conference, ILTACON, three awards are given to participating vendors – leading software and service providers – based on case studies, interviews, videos, and written submissions. \n \nThe 2015 ILTACON judges presented the Innovative Solution Provider of the Year award to Litera Corporation for their Litera Anywhere™ solution, making Litera the winner of all three awards within the last two years. \n \nPaul Domnick , President of Litera Corporation, stated, \"Following on the heels of 2014 where we won two of the three awards, Vendor Thought Leader of the Year and Consultant of the Year , we are humbled and honored to be awarded ILTA's Innovative Solution Provider of the Year. Enabling mobility is one of the benefits of cloud computing but not having critical tools in the cloud created a hurdle for professionals who need to compare, clean, convert, collaborate, secure and share documents in the cloud. Our Clients and ILTA have validated our vision and affirmed the value we provide.\" \n \nLitera Anywhere™ was created to go beyond point solutions and individual products by offering several technologies integrated into a solution that allows professionals to work anywhere, on any device with access to all the critical tools that they only had on their desktop.  This enables mobility and productivity without compromising security. \n \nILTA, the International Legal Technology Association, is the most prestigious outlet for legal professionals to gain knowledge and share experiences allowing members of the legal field to overcome the arduous challenges they face on a daily basis.  Connecting over 1,400 law firms and departments that represent over 20,000 individuals, ILTA is a hub for legal resources, educational content and peer-network opportunities.  \n \nLitera's comprehensive productivity and risk management suite provides organizations with unsurpassed Content Confidence ® . Patented document creation, collaboration, and control technologies streamline workflows and provide a new level of information security with governance at the document level, even outside the organization. These capabilities are now available in any location, on any device, in any environment with Litera Anywhere™. This allows remote users simple access to the tools and content they always need to do their job, and facilitates cyber-secure and effective collaboration between disperse mobile users, teams and organizations. Learn more at  www.litera.com . \n \nContact: \nDawn Hudgins \nLitera Corp. \n336-375-2991/>/>/> \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/litera-awarded--innovative-solution-provider-of-the-year-at-iltacon-2015-300141653.html \n \nSOURCE  Litera Corp. \n \nCopyright (2015) PR Newswire.  All Rights Reserved", "source": "Virtual Strategy Magazine"}