{"published": "2015-09-17T12:33:21Z", "media-type": "News", "title": "Cannes Lions and Ketchum Announce Winners of 2015 Young Lions Marketers Competition", "id": "f3913306-2c33-44b0-a43d-96a4704e7dee", "content": "Comments\n\nCANNES, France and NEW YORK, June 29, 2015 /PRNewswire/ -- Grace Sobey and Charlie Clinton of Unilever in the United Kingdom won the Gold Lion for the sixth-annual Young Lions Marketers Competition at the 62nd annual Cannes Lions International Festival of Creativity. Sponsored by Ketchum, this year's competition challenged 18 teams of young, in-house marketers from around the world to develop a creative brief for a product or service that would benefit Water Aid, an international NGO dedicated to improving access to safe water, hygiene and sanitation in the world's poorest communities. Competitors presented their communication plans to a panel of industry leaders, which was led by Barri Rafferty, senior partner and CEO of North America for Ketchum.\n\nSobey, global media manager, foods, at Unilever, and Clinton, assistant digital brand manager for Unilever's Dove brand, developed the winning brief to win the Gold Lion.\n\nClinton said of the winning campaign brief, \"When we delivered the presentation, we felt we had done the best we possibly could do. We wanted to help WaterAid reach an entirely different audience and worked to ensure we did.\"\n\nSobey agreed and added, \"This is the best thing that has ever happened in my career, and I genuinely mean that.\"\n\nThe team from the Dominican Republic, Banco BHD León's Letizia Cantarella and Paola Ramos, won the Silver Lion, and the Bronze Lion went to the team from Turkey, Unilever's Nilay Gözegir and Gizem Erbas.\n\nParticipants were briefed onsite at Cannes and then given 30 hours to develop their product or service concept before showcasing their communication plans in a two-page written brief and short presentation to the judging panel. In addition to Rafferty, the Young Lions Marketers Competition jury included Joanna Peña-Bickley, global chief creative officer for iX Studios IBM Interactive, and Mailine Swildens, head of The Zoo, Google's creative and creative technology team, in Google's SEEMEA (Southern and Eastern Europe, Middle East and Africa) region. The winning teams received their trophies at the Young Lions Marketers Competition award ceremony on Saturday, June 27.\n\nOf the judging, Rafferty said, \"These 36 competitors represent the best and the brightest young in-house marketers from around the world. It is incredibly inspiring to see how committed they are to using their talent to deliver truly creative, strategic ideas for such an important cause. I believe these future leaders of our industry will play a big role in helping to make our world a better place.\"\n\nAdditional participants in this year's competition hailed from Argentina, Australia, Belarus, Canada, China, Costa Rica, Finland, Hungary, India, Norway, the Philippines, Poland, Portugal, Spain and Sri Lanka.\n\nThis is the fifth year Ketchum has sponsored the Young Lions Marketers Competition. In addition to its sponsorship, the firm hosted two live panels on the main stage – \",\" focused on marketing to the age 50+ audience, and \"\" in which Ketchum Sounds hosted a mock branded integration negotiation live on stage with Pernod Ricard and music artist Natalie Imbruglia. In addition, Ketchum representatives posted their insights and observations during the festival through the agency's #KetchumCannes hub (https://www.ketchum.com/cannes).\n\n62nd Cannes Lions International Festival of Creativity, June 21 to 27, 2015, Cannes, France \n\nThe International Festival of Creativity, also known as Cannes Lions, is the world's leading celebration of creativity in communications. Founded in 1954, the Festival takes place every June in Cannes, France. As the most prestigious international annual advertising and communications awards, over 37,400 entries from all over the world are showcased and judged at the Festival. Winning companies receive the highly coveted Lion trophy, a global benchmark of creative excellence, for Film, Print, Outdoor, Interactive, Radio, Design, Product Design, Promo & Activation, Film Craft, Mobile, Branded Entertainment and Integrated advertising, as well as the best Media, Direct, PR, Titanium, Creative Effectiveness, Creative Data and Innovation ideas. The Festival is also the only truly global meeting place for advertisers, advertising and communication professionals. More than 12,000 delegates from 95 countries attend a week-long program of exhibitions, screenings and talks by worldwide thought leaders. As the networking and learning opportunity of the year, Cannes Lions is the must-attend event for anyone involved in brand communications.\n\nAbout Ketchum\n\nKetchum is a leading global communications firm with operations in more than 70 countries across six continents. The winner of 16 Cannes Lions and an unprecedented four PRWeek Campaign of the Year Awards, Ketchum partners with clients to deliver strategic programming, game-changing creative and measurable results that build brands and reputations. For more information on Ketchum, a part of the DAS Group of Companies, visit www.ketchum.com.\n\nAbout the DAS Group of Companies\n\nThe DAS Group of Companies, a division of Omnicom Group Inc. (NYSE: OMC) (www.omnicomgroup.com), is a global group of marketing services companies. DAS includes over 200 companies in the following marketing disciplines: specialty, PR, healthcare, CRM, events, promotional marketing, branding and research. Operating through a combination of networks and regional organizations, DAS serves international, regional, national and local clients through more than 700 offices in 71 countries.\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/cannes-lions-and-ketchum-announce-winners-of-2015-young-lions-marketers-competition-300106266.html\n\nSOURCE Ketchum", "source": "AndhraNews.net"}