{"published": "2015-09-07T08:01:23Z", "media-type": "News", "title": "Qatar, Jordan set up business council", "id": "dfab40a3-4fba-43b3-bdd1-6c4944537827", "content": "Related Jordan, Tanzanian armies ink cooperation deal Qatar Chamber (QC) signed an agreement with the Jordan Chamber of Commerce (JCC) to establish the Qatar-Jordan Joint Business Council on the sidelines of the Gulf-Jordan Economic Forum held in Amman recently.\n\nThe agreement was inked by QC chairman Sheikh Khalifa bin Jassim bin Mohamed al-Thani and his JCC counterpart Nael al-Kabariti. \n\nThe council aims to enhance co-operation between economic institutions, businesspersons and business entities of the two countries. It also seeks to exchange information and experience in the fields of commercial and marine arbitration, intellectual property and patent. Further, it entails the conduct of periodical meetings between the two parties to discuss topics of mutual interest.\n\nAt its first meeting, the new council recommended the specification of vital economic sectors, beneficial for both sides. It also called for easing the movement of businesspersons from both countries to enhance co-operation. \n\nParticipants at the meeting recommended that a joint-stock company be set up to focus on areas of mutual interest and a monthly bulletin on latest developments at the council. \n\nSheikh Khalifa hailed the agreement and expected it to contribute further to the progress of Qatari-Jordanian economic relations.\n\nHe stressed that the investment climate in Jordan was one of the best in the region and the nature of legislation there made the country an important destination for Qatari businesspersons. He said the two countries enjoyed robust historic ties, indicating that businesspersons from both sides were keen on strengthening co-operation for the benefit of both countries' economies.\n\nSimilarly, al-Kabariti highlighted that Qatari investments in Jordan were more than welcome in both government and private institutions. \n\n© Gulf Times 2015 ©\n\n© Copyright Zawya. All Rights Reserved. Be the first to comment Post Your Comment More in Jordan Jordan, Tanzanian armies ink cooperation deal Oddly Enough PRESS DIGEST-Canada-Sept 4 There's More", "source": "Zawya.com"}