{"published": "2015-09-19T11:00:00Z", "media-type": "News", "title": "Patriots vs. Bills: What's the Game Plan for New England?", "id": "16508004-301f-4796-a6d7-3531a9a800fb", "content": "If Week 1 was a homecoming after an offseason of frustration, the New England Patriots shouldn't expect such a forgiving environment in Week 2. The Pats figure to run into a hornet's nest on Sunday when they visit Ralph Wilson Stadium to play the Buffalo Bills , seeking to make an early AFC East statement with a 2-0 start. \n \nRex Ryan 's defense made the high-powered Indianapolis Colts offense look toothless in Buffalo's 27-14 Week 1  win, and much of that game film should concern Patriots fans. Ryan always gave New England fits in New York, even with inferior personnel, and the Pats will face many of the same problems the Colts were unable to solve last time out. \n \nNew England is a slight favorite by the books, but until we learn more about these teams, this contest feels like more of a toss up. Looking at the tape both teams put on film in Week 1, here's a primer for how the Patriots can end up on the right side of the ledger come Sunday afternoon. \n \nOffensive Game Plan \n \nThere's not much mystery between Ryan and the Patriots, but that hasn't made his defenses any easier to solve for Tom Brady and co. Known for his amoeba fronts and pressure-based schemes, Ryan's blitz-happy game plan worked to perfection against Indianapolis. As CBS Sports' Pete Prisco described after the game, Ryan's blitzes worked, not because of their frequency but because of how the disguise prevented Indy from getting a beat on Buffalo's intentions: \n \r \nI counted 27 different blitzes against Luck for the day. Most of them looked different, which made it so complicated for him—and especially for the line. The Bills used double-A-gap blitzes. They sometimes widened with all rushers outside the shoulders of the guards, and blitzed off of that. They would send nickel corners, sometimes both extra corners when in the dime to go with both linebackers. \n\r  \nThough Week 1 was the first glimpse at how Ryan's scheme would dovetail with the Bills' defensive personnel, the game plan probably looked familiar to Patriots fans. In last December's narrow 17-16 escape at the Meadowlands, the New York Jets sacked Brady four times with similar pressure concepts to those the Bills utilized last time out: \n    Source: NFL Game Pass      Source: NFL Game Pass    \nThe above play is a misdirection staple frequently seen in Ryan's defenses. Though the Jets show an even five-man front before the snap, four of the rushers end up on the offense's left side, with a stunt combination pulling Nate Solder inside and providing two rushers free run at Brady. This third-down play ended with a 13-yard loss and a subsequent punt. \n \nFor Ryan, the difference this year lies in the secondary, as the 2014 Jets had dismal secondary personnel who didn't allow him to unleash the full range of his pressure concepts up front. Led by budding star Stephon Gilmore, the Bills cornerbacks were extremely aggressive jumping routes against the Colts: \n    Source: NFL Game Pass      Source: NFL Game Pass    \nLike the Patriots, the Colts' passing scheme is predicated on yards after the catch. Per Sporting Charts , Indy averaged 5.97 yards after the catch in 2014, seventh in the league, but it was held to just 3.15 YAC against the Bills. The two teams certainly don't run identical passing schemes, but many of the routes Buffalo shut down in Week 1 are staples in New England's playbook. \n \nSo where do the Pats begin to try and move the ball on Sunday? We know it likely won't be on the ground. The Patriots averaged a meager 3.2 yards per carry against Buffalo last year, and the Bills appear to hold a big advantage in the trenches against New England's inexperienced interior offensive-line personnel. Much like the Colts, who ran the ball just 17 times for 3.8 yards per carry, the Pats will likely adopt a pass-heavy approach. \n \nThe Patriots aren't going to stop running their bread-and-butter passing concepts, but it's fair to expect more max protection. In the aforementioned Week 16 game against the Jets last year, the Pats turned to seven- and eight-man blocking schemes to stymie New York's blitzes, even keeping Rob Gronkowski in to block at times: \n    Source: NFL Game Pass    \nGronk is an obvious mismatch for reasons that don't need much explanation, but when Brady doesn't turn to his All-Pro tight end, perhaps Josh McDaniels will dial up some double moves to exploit the aggression of Buffalo's corners. T.Y. Hilton gained 30 yards on this play in Week 1, when he stemmed his seam route to the outside and caused Gilmore to hesitate enough to give Hilton a free release inside: \n    Source: NFL Game Pass    \nJulian Edelman and Danny Amendola are slippery enough to get open on isolation routes underneath, but expect the Patriots to throw a double-move changeup at some point if the Bills start jumping Brady's short-to-intermediate range passes. \n \nDefensive Game Plan \n \nWhile most have focused on the matchup of minds between Brady and Ryan, equally intriguing is how Bill Belichick will handle the Tyrod Taylor enigma. Taylor was uber efficient in his Bills debut, finishing 14-of-19 passing for 195 yards, one touchdown and, most importantly, no turnovers. Appearing completely under control, Taylor actually posted one of the most efficient games by any Buffalo quarterback over the past decade. \n \nThat's partially an implication of Buffalo's woeful quarterback play in the post-Jim Kelly era, but there's no disputing that Taylor executed Greg Roman's simplified game plan very well. Buffalo typically kept Taylor's reads to a minimum and asked him to throw short. Swing passes, screens and slants to LeSean McCoy and Percy Harvin were common as the Bills clearly sought to get their playmakers the ball in space. \n \nThose low-variance plays, which are essentially extensions of the running game, aren't going to hurt the Patriots over the larger 60-minute picture on Sunday. The real issue will be their ability to defend play action, as Taylor was extremely successful at luring Indianapolis' linebackers to sleep before hitting a receiver who had slipped undetected into the second level: \n    Source: NFL Game Pass    \nTaylor found a tight end in that particular example, but he'll also take deep shots to his perimeter receivers off play action, which typically only asks him to make one read. Buffalo isn't going to move the ball down the field with long drives that involve pinpoint precision from Taylor; over a quarter of his passing yards in Week 1 came on his 51-yard touchdown pass to Harvin. \n \nIf New England can contain play action, it's hard to imagine Taylor's stat line looking as shiny as it did after the Colts game. \n \nOf course, the Bills won't need to rely on Taylor's arm so much if they can get McCoy and the running game going. McCoy wasn't particularly effective against the Colts (17 carries, 41 yards), but supplementary carries from Taylor (9 rushes, 41 yards) and rookie Karlos Williams (six carries, 55 yards) helped the Bills average 4.1 yards per attempt on the ground.  \n \nIf you watched the San Francisco 49ers over the past few years, you won't be surprised to learn Roman brought the Niners' power-run game and gap-blocking scheme to Buffalo. Often lining up with a fullback and/or multiple tight ends on the line, the Bills' interior offensive linemen, particularly Richie Incognito, were effective at blocking down to the second level to clear out lanes for their running backs: \n    Source: NFL Game Pass    \nNew England's most recent opponent, the Pittsburgh Steelers , employed a different look on their rushing plays. A pass-first offense, the Steelers often ran out of shotgun formations and multi-receiver sets, taking advantage of the Patriots' light boxes. Nevertheless, the Pats linebackers exhibited similar issues, as the small defensive tackles typically didn't impede Pittsburgh's lineman from sealing off the linebackers downfield: \n    Source: NFL Game Pass    \nAt least on paper, the Pats should be better prepared to stop the run this game. We know New England will be in base personnel the entire game, which will make a few players in the below section particularly important. The spotlight is on Taylor after his impressive debut. But make no mistake: If the Patriots can contain Buffalo's running game in the trenches, Buffalo's callow quarterback is unlikely to outgun Brady and the offense. \n \nKey Players and Matchups \n    Bill Wippert/Associated Press    \nEvery week in this space, we'll list two offensive and two defensive players critical to the game plan who haven't necessarily received much publicizing in the sections above. Not all of these selections will necessarily be the most obvious choices, but each figures to play a key factor in New England's chances of victory. \n \nJamie Collins: Though he'll occasionally get lost in zone coverages, Jamie Collins has generally made steady strides in pass coverage. According to the charting stats from  Football Outsiders Almanac 2015 , Collins ranked fourth in adjusted success rate among linebackers in coverage last season. With Jerod Mayo still recovering from last October's torn patellar tendon injury, Collins is easily New England's most mobile linebacker. \n \nThus, Collins' ability to diagnose play action and hang with Charles Clay in coverage will play an underrated role in determining Buffalo's offensive efficacy. Clay caught all four of his targets from Taylor in Week 1, compiling 43 yards in a solid Bills debut. Most will focus on Harvin and Sammy Watkins on the perimeter, but don't underestimate Clay's value to Buffalo's passing game. \n \nRob Gronkowski: Though Gronk will always belong in this space, he'll be particularly important against the Bills given that Ryan has typically had success shutting off the rhythm-based routes Brady hits on a weekly basis. Buffalo doesn't appear to have the personnel to stop Gronkowski, but we can expect Ryan to limit the tight end with bracket coverages that force Brady to look elsewhere. \n \nIn two games against the Jets last year, Gronkowski compiled just 11 catches for 99 yards and a touchdown. While hardly disappointing numbers for virtually any other tight end, Gronk certainly wasn't a trump card who wrecked New York's defense. While he's unlikely to reach the end zone three times, like he did against Pittsburgh, can New England still get the ball to their most important playmaker when it matters most? \n \nDion Lewis: Maybe Ryan will finally learn  journeyman running back Dion Lewis' name after Sunday. The Bills coach was apparently unimpressed with Lewis' 19-touch, 120-yard performance against the Steelers, and he has professed that he'll game-plan for LeGarrette Blount to receive a heavier dose of the touches upon returning from suspension. \n \nWhile Blount will likely eat into Lewis' total touches, common sense would dictate New England's passing back will receive more snaps against Buffalo's stout front. Apart from a fumble in Week 1, Lewis has done nothing but put positive tape on his highlight reel since stealing the role from James White and Travaris Cadet. If nothing else, he'll almost certainly receive the opportunity to make Ryan eat his words come Sunday night. \n \nAlan Branch and Sealver Siliga:  OK, so including two players is cheating slightly. However, following a week in which the Patriots gave heavy interior snaps to edge defenders Chandler Jones and Geneo Grissom, both of whom weigh 265 pounds, expect much more beef against Buffalo. \n \nAccording to Football Outsiders ' snap counts, Alan Branch and Sealver Siliga combined for just 34 defensive snaps against Pittsburgh, as the Pats employed sub-package personnel virtually the entire game. Expect more 3-4 looks with Bear fronts to cover up the interior run gaps, as New England's two biggest defensive linemen will be crucial to stifling Buffalo on early downs and forcing Taylor into clear passing situations. \n \nPrediction \n \nEven while the Jets combusted amid front-office incompetence, Ryan always found a way to harass the Patriots with inferior personnel. Five of New England's last six meetings against the Ryan-era Jets were decided by three points or less, and though the Pats won four of those one-score contests, it rarely felt like they dictated the game on their terms. \n   Do you see this as a statement game for the Patriots?    \nAt Orchard Park on Sunday, it would be surprising if the Patriots were able to control the game as thoroughly as they did against the Steelers. That obviously doesn't preclude New England from winning, but it will likely force New England's role players (especially those in the trenches) to play beyond expectations. \n \nHowever, what should comfort New England is it's unlikely to see anything from Ryan it hasn't seen since he entered the division in before the 2009 season. Buffalo certainly presents a greater challenge in terms of personnel, but don't underestimate how Brady and Belichick's familiarity with Ryan could help them stave off Buffalo's upset bid. \n \nUltimately, it's difficult to call a game so early in the season, when we're still searching for clues about teams. However, until Buffalo proves it can punch back against the division bullies, we'll lean toward giving the Patriots the benefit of the doubt in what should be an excellent contest. \n \nPrediction: Patriots 23, Bills 20 \n  Follow @SterlingXie", "source": "Bleacher Report US"}