{"published": "2015-09-22T21:02:23Z", "media-type": "News", "title": "Australian resident Keshia Handa falls to death at salsa party in Turkey", "id": "22f0812d-d03d-4699-bf95-c014dde59715", "content": "An Australian resident has fallen to her death while attending a salsa party on the roof of a hotel in Turkey, according to reports. An Australian resident has fallen to her death while attending a rooftop salsa dancing party at a hotel in Turkey, according to reports. Keshia Handa, 31, fell an estimated 10 metres when a makeshift bridge connecting the roofs of two adjoining buildings collapsed on Saturday night in a suburb of Istanbul, according to Turkish media reports.\n\nMs Handa, a New Zealand citizen who had been living and working in Brisbane for at least the past six years, died at the scene, at the Grand Hotel de Londres, in Istanbul's central Beyoglu district.\n\nBGN News, an English-language news organisation in Turkey, reported that Ms Handa was dancing on a section of grating that connected the hotel with the adjacent building when the grate gave way.\n\nHowever, other media reports suggested she may have simply stepped onto the grate when it collapsed.\n\nTurkish newspaper the Hurriyet Daily News reported that Ms Handa and two friends had arrived in Istanbul on Wednesday, three days before Ms Handa's death, and the women were staying at the Grand Hotel de Londres.\n\nAbout 200 people were attending the salsa party at the hotel on Saturday night when the accident occurred.\n\nA spokeswoman for New Zealand's Ministry of Foreign Affairs and Trade said officials were \"aware of the tragic death of a New Zealander in Istanbul\" and would provide consular support to her family.\n\n\"Our thoughts are with the family at this sad time,\" the spokeswoman said.\n\nMs Handa had studied at the University of Auckland and had worked as a psychologist in Brisbane for the past six years.\n\nİbrahim Hüzmeli, the owner of the Grand Hotel de Londres, told BGN News that he was deeply saddened by the tragedy, which he described as an accident.\n\nMs Handa's relatives had arrived in Istanbul and would fly home with her body, BGN News said. The story first appeared on The Sydney Morning Herald.", "source": "Port Stephens Examiner"}