{"published": "2015-09-09T14:00:00Z", "media-type": "News", "title": "Let's Move! Active Schools Announces 2015 National Award Recipients", "id": "98034827-3bf6-4dae-b91f-808162dca00a", "content": "WASHINGTON , Sept. 9, 2015 /PRNewswire-USNewswire/ -- Today, Let's Move! Active Schools , a sub-initiative of First Lady Michelle Obama's  Let's Move! campaign, announced its 2015 National Award honorees. Five hundred and twenty-five U.S. schools , representing 37 states, were recognized for their outstanding efforts in creating an Active School environment and increasing physical activity and physical education opportunities for students. \n\nThe Let's Move! Active Schools National Award is the top physical activity and physical education distinction for K-12 schools. The award celebrates a school's commitment to integrating at least 60 minutes of physical activity before, during and after the school day. \n   \n\"These schools are raising the bar by creating Active School environments where students are happier, healthier, and higher-performing. I am thrilled with their success through Let's Move! Active Schools – they're helping to create a new norm where physical activity is a fundamental aspect of a young person's success both in the classroom and in life,\" said First Lady Michelle Obama . \n\nStudies show that Active Kids Do Better. Physical activity not only helps kids stay healthy and strong, but it can also lead to higher test scores, improved attendance, better behavior in class, and enhanced leadership skills. \n\nThe Let's Move! Active Schools collaborative works together to transform the physical activity and physical education culture in America's schools. By streamlining the selection of programs, resources, professional development and funding opportunities, and delivering each school a customized Action Plan, Let's Move! Active Schools results in children moving for the nationally recommended 60 minutes a day. \n\nTo earn a Let's Move! Active Schools National Award, a school must have met significant benchmarks in five areas: physical education; physical activity before- and after-school; physical activity during school; staff involvement; and family & community engagement. \n\nHonorees are provided with a banner, certificate and congratulatory letter from the First Lady. Recognition packages were generously sponsored by BOKS , Build Our Kids' Success, a free before- and during-school physical activity program aimed at getting kids' bodies moving and their brains ready to learn. \n\nCheck out the honorees: 2015 Let's Move! Active Schools National Award Recipients \n\nLET'S MOVE! ACTIVE SCHOOLS NATIONAL COLLABORATIVE \nAction for Healthy Kids , Alliance for a Healthier Generation, Athletes for Hope, BOKS, ChildObesity180, GENYOUth Foundation, GoNoodle, Good Sports, Kaiser Permanente, KIDS in the GAME, Let's Move!, NBA FIT, NIKE, Inc., Partnership for a Healthier America, President's Council on Fitness, Sports & Nutrition, Safe Routes to School National Partnership, SHAPE America, SPARK, U.S. Department of Health and Human Services, USA Track & Field. Find out more at www.letsmoveschools.org . \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/lets-move-active-schools-announces-2015-national-award-recipients-300139856.html \n\nSOURCE  Let's Move! Active Schools", "source": "WorldNetDaily"}