{"published": "2015-09-08T14:51:40Z", "media-type": "News", "title": "Justin Bieber: I’m single because ‘I got my heart broken’", "id": "ec79f066-67e0-4b3a-9687-4f87b1cb6552", "content": "Justin Bieber is single — but that doesn't mean he's ready for a new romance. \n\r \n\r\n\tThe pop star has revealed that he hasn't dated anyone since ending his on-again, off-again relationship with Selena Gomez. \n\r \n\r\n\t“I haven’t been in a relationship for a while now,” he confessed during an interview with Australian radio hosts Kyle and Jackie O on Monday. \n\r \n\r\n\t\"I'm chilling and just hanging out,\" Bieber added. \n\r \n\r\n\t“I’m a relationship type of guy. I love to be in love, and I love cuddling. I love all that stuff.” \n\r \n\r\n\tThe 21-year-old then gave some insight into why he hasn't pursued a new relationship since splitting with Gomez. \n\r\n                                 \r \n\r\n\t“I got my heart broken,” he confessed. “I’m just trying to let that heal up.” \n\r\n                   \r \n\r\n\tJackie O. then brought up Bieber’s famous ex-girlfriend, asking why her name was graffitied on a wall in the music video for “What Do You Mean?” \n\r \n\r\n\t“I think that might be fake,” he said. “That wasn’t me that did that.” \n\r \n\r\n\tBieber insisted on focusing on his professional comeback over his personal life, and noted that after pulling a lot of controversial stunts in the past few years, he's done atoning for his past. \n\r \n\r\n\t\"I dont want to keep apologizing,\" he said. \" I acknowledge it ... but we all go through that period. \n\r \n\r\n\t\"If we live in that time and don't move on from it, that's where we're going to stay.\" \n\r \n\r\n\tBieber will drop his as-yet-untitled fourth studio album on Nov 13. \n\r\n                       \r\n\r Tags:   justin bieber    \r\n    \r\n   \r\n ", "source": "New York Daily News"}