{"published": "2015-09-27T13:57:50Z", "media-type": "News", "title": "Rouhani: There Are 'Differing Viewpoints' In Iran Over Nuclear Deal", "id": "cce9a8c4-5d3a-48b8-ae09-7c980a992659", "content": "Iran's President Hassan Rouhani tells NPR that much like in the United States, there are in his country \"two differing viewpoints\" on the six-party nuclear deal – one that is cautiously optimistic of success and another which is highly skeptical of Washington's desire to live up to its end of the bargain. \n\nRouhani, speaking to Morning Edition host Steve Inskeep in an interview to be aired on Monday, also says that Iran is prepared to discuss options for Syria after the Islamic State is defeated, but that those allied against ISIS must first come together to \"drive out the terrorists.\" \n\nIn the 40-minute interview, Rouhani touched on the agreement struck in July to limit Tehran's nuclear program, saying that there are those in Iran who \"question whether [there is] a real political will to adhere to the letter of this agreement.\" \n\nIran's supreme leader, Ayatollah Ali Khamenei has said that he takes a \"wait and see\" approach to the deal. Rouhani tells Steve that some in his country \"have a very negative viewpoint, they say that our counterparts, including the United States will not live up to their commitment. \n\n\"You do know that some of the congressmen and women, some of the senators here in the United States have said very clearly — or written letters to that effect — that after the end of the Obama administration, [they] will not keep the government's commitment to this agreement,\" he says. \n\n\"So, all of these are things preoccupy and worry some folks back in Iran as well,\" Rouhani continues. \n\nOn Syria, Rouhani emphasizes that predominately Shiite Tehran — supportive of the regime of President Bashar Assad — is most concerned with eliminating the threat from the Sunni-dominated Islamic State militia, which has captured large swaths of territory in Iraq and Syria and carried out atrocities against civilians in the areas they control. \n\nHe says that Iran is prepared to \"to start holding discussions and dialogues\" on a post-ISIS Syria, but that the powers allied fighting the extremist group, which includes Russia, \"must all act in unison and have a formula that is required to drive out the terrorists, immediately.\" \n\nHis remarks in the interview recorded Saturday come amid an announcement from Iraq that it has agreed to intelligence sharing with Tehran and Moscow as part of the fight against the Islamic State. Last week, Russia deployed warplanes to a forward base at Latakia, Syria , from where they are poised to conduct airstrikes against the extremist group. \n\n\"We can right now, absolutely we should speak about the upcoming options. And the Syrian government can also step in and give its opinion so that we have all of the interested parties expressing their opinions so that in aggregate we can reach a plan of action. But of course we do believe that at the end of the day, the last word and the most important word is spoken by the people\" of Syria, Rouhani tells NPR. \n\nOn Friday, in a meeting with editors, reporters and program hosts from news organizations in a hotel near the United Nations headquarters in New York, Rouhani said Tehran had \"a close relationship with Russia\" and that \"[many] weapons being used in Syria are Russian. \n\n\"[Russian President Vladimir] Putin told me recently that he wants to be more active in fighting ISIS,\" Rouhani said, but added that there was \"no coalition\" between Tehran and Moscow against the Islamic State.", "source": "WRKF.org"}