{"published": "2015-09-05T13:15:00Z", "media-type": "News", "title": "INVESTMENT TECHNOLOGY GROUP, INC. [NYSE: ITG]:  Kaplan Fox and Wites & Kapetan Have Filed a Securities Class Action on Behalf of Purchasers of ITG Common Stock during the Period February 28, 2011 and", "id": "1b84c9f7-501e-472e-9682-995f69be8fd4", "content": "NEW YORK, Sept. 5, 2015 /PRNewswire/ -- Kaplan Fox & Kilsheimer LLP (www.kaplanfox.com) and Wites & Kapetan, P.A. (http://www.wklawyers.com) have filed a class action suit against Investment Technology Group, Inc. (\"ITG\" or the \"Company\") (NYSE: ITG), and certain of its executives, that alleges violations of the Securities Exchange Act of 1934 on behalf of purchasers of ITG common stock during the period February 28, 2011 through August 3, 2015, inclusive (the \"Class\"). \n\nThe case is pending in the United States District Court for the Southern District of New York. A copy of the Complaint may be obtained from Kaplan Fox's website, or from the Court. The Complaint alleges that, throughout the Class Period, Defendants made materially false and misleading statements to investors concerning the Company's POSIT network, an Alternative Trading System or \"dark pool.\" The Complaint alleges that, throughout the Class Period, ITG held itself out as an \"agency-only\" and \"conflict-free\" broker, and represented that POSIT safeguarded client trading data, but omitted to disclose: \"(1) that, as detailed in the SEC Settlement Order, between April 2010 through July 2011, the Company operated a proprietary trading pilot called 'Project Omega' within the Company's AlterNet subsidiary that involved 'crossing against sell-side clients in POSIT' and violations of the Company's policies and procedures by Mittal, a former ITG Managing Director, Head of Algorithmic Trading, and Head of Liquidity Management; (2) that Mittal, while head of Project Omega, along with numerous other employees, accessed private client data within the Company while simultaneously operating a proprietary trading strategy, a clear conflict of interest; (3) that this conduct violated Regulation ATS; and (4) that the Company was under investigation for this conduct by the SEC by Fall 2013, and faced an enforcement action by May 2015, which threatened major fines and legal costs as well as reputational harm to the Company and loss of customers.\"\n\nThe Complaint further alleges that on July 29, 2015, after the market closed, \"ITG issued a press release disclosing, for the first time, the underlying wrongful conduct and the SEC's investigation thereof (the 'July 29 Press Release'),\" and that \"ITG expected to pay an aggregate amount of approximately $20.3 million, including an $18 million civil penalty, disgorgement of $2.1 million in improperly gotten trading revenues, and about $250,000 in prejudgment interest,\" pursuant to the settlement. On July 30, 2015, ITG's stock price declined approximately 23.5%, or $5.64 per share, to close at $18.36 per share.The Complaint further alleges that on August 3, 2015, before the market opened, \"the Company announced that it was replacing Gasser as CEO, as well as its general counsel, Mats Goebels\" and that \"[t]he Wall Street Journal reported that day that the departures were related to Gasser's failure to disclose certain details of the improper conduct relating to POSIT to the Board.\" On August 3, 2015, ITG's share price declined by approximately 4%, or $0.84 per share, to close at $19.51 per share.The Complaint further alleges that on August 4, 2015, before the market opened, the Company's Chief Financial Officer, Defendant Steven R. Vigliotti disclosed that \"[i]n the three trading days since we announced the potential SEC settlement… in the U.S. our volume market share was down about 25%.\" On August 4, 2015, ITG's share price fell approximately 5.28%, or $1.03 per share, to close at $18.48 per share.The Complaint further alleges that on August 12, 2015, the SEC announced its settlement with ITG, and released an Order that included \"detailed admissions of wrongdoing\" by ITG, and imposed \"a civil penalty in the amount of $18,000,000 – the largest civil penalty to date assessed by the SEC against an Alternative Trading System\" – in addition to over $2 million in disgorgement of wrongfully-gotten revenues and pre-judgment interest of over $250,000. \n\nOn August 24, 2015, Reuters reported that volume in ITG's dark pool had dropped by \"nearly half in the week-and-a-half after the brokerage disclosed it was near a record settlement with regulators over violations in its so-called 'dark pool,'….Volume in the dark pool dropped 17.9 percent the week of July 27, and fell another 32.8 percent by the end of the following week, for a total of 44.9 percent, according to data released on Monday by the Financial Industry Regulatory Authority.\"\n\nIf you are a member of the proposed Class, you may move the court no later than October 5, 2015 to serve as a lead plaintiff for the Class. You need not seek to become a lead plaintiff in order to share in any possible recovery. \n\nFor more information about Kaplan Fox & Kilsheimer LLP, or to review a copy of the complaint filed in this action, you may contact Kaplan Fox (www.kaplanfox.com) or Wites & Kapetan (www.wklawyers.com). \n\nIf you have any questions about this Notice, the action, your rights, or your interests, please contact: \n\nJeffrey P. Campisi\n\nKAPLAN FOX & KILSHEIMER LLP\n\n850 Third Avenue, 14th Floor\n\nNew York, New York 10022\n\n(800) 290-1952\n\n(212) 687-1980\n\nFax: (212) 687-7714\n\nE-mail address: jcampisi@kaplanfox.com \n\nLaurence D. King\n\nKAPLAN FOX & KILSHEIMER LLP\n\n350 Sansome Street, Suite 400\n\nSan Francisco, California 94104\n\nTelephone: (415) 772-4700\n\nFax: 415-772-4707\n\nE-mail address: lking@kaplanfox.com\n\nMarc A. Wites\n\nWITES & KAPETAN, P.A.\n\n4400 North Federal Highway\n\nLighthouse Point, FL 33064\n\n(954) 570-8989\n\nFax: (954) 354-0205\n\nEmail: mwites@wklawyers.com \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/investment-technology-group-inc-nyse-itg--kaplan-fox-and-wites--kapetan-have-filed-a-securities-class-action-on-behalf-of-purchasers-of-itg-common-stock-during-the-period-february-28-2011-and-august-3-2015-300138492.html\n\nSOURCE Kaplan Fox & Kilsheimer LLP", "source": "Indianapolis Business Journal"}