{"published": "2015-09-11T00:54:36Z", "media-type": "News", "title": "Zinnia''s Fall and Year-End Move-In Opportunities Now Available in Irvine", "id": "5353764e-02bc-4b19-8389-9f76b27e7484", "content": "ID: 1384752 \n   \n   \n(businesspress24) - IRVINE, CA -- (Marketwired) -- 09/10/15 --  Fall and year-end move-in opportunities are now available at California Pacific Homes''  townhome collection in Irvine''s popular Cypress Village. Those interested should visit the sales office today, tour Zinnia''s  and find the attached design that best suits their lifestyle needs. Buyers can choose from an array of well-appointed floorplans with up to four bedrooms, including master suites with walk-in closets; up to three and one-half baths; entry level bedrooms, courtyards and decks per plan; gourmet kitchens with islands, Pental Quartz countertops and Bosch appliances; and attached two-car garages. The Cypress Village setting offers homeowners resort-style amenities including access to The Jeffrey Open Space trail. To explore Zinnia''s fall and year-end move-in opportunities, visit the sales office, or log on to  for more information. \n\n\"Cypress Village is one of the most sought-after addresses in Irvine and Zinnia''s townhome opportunities make that incredible lifestyle attainable for more homebuyers,\" said Leslie Stillman, Vice President, Sales & Marketing and Design Center for California Pacific Homes. \"Contact Zinnia''s sales team to learn more about our valuable fall and year-end move-ins.\" \n\nZinnia''s two- and three-story attached  suit an array of lifestyles from young first-time buyers to growing families with two to four bedrooms, two and one-half to three and one-half baths and a two-car attached garage. With approximately 1,163 to 1,531 square feet, Residences One and Two feature a  off the dining area for ; Residences Two and Four have a secluded  and Residence Three offers an optional second floor configuration with  and a loft. Homes feature Spanish and Italian-inspired exteriors with refined architectural detailing. Prices start from the high $400,000s to the low $600,000s. \n\n, within the Villages of Irvine®, offers residents everything families want and need to thrive now and in the years to come. Offering the next generation in new home designs, Cypress Village provides residents with resort-style recreation for the young and young at heart, a convenient setting near your favorite places and acres of parks for fun in the sun, and is conveniently located just moments away from the region''s premier shopping, dining and entertainment. Students attend the state-of-the-art Jeffrey Trail Middle School and the newly opened Cypress Village Elementary School, both conveniently located within the Village and part of the heralded . \n   \nCreated by Irvine Company Community Development, Cypress Village is conveniently located in Irvine, California. In 2014, Money Magazine named Irvine California''s No.1 city in its \"Best Places to Live\" list. The highly-acclaimed master-planned community is renowned for allowing residents to enjoy a unique lifestyle unmatched in the region -- some of the best schools in the state; America''s safest city for ten straight years; abundant open space, parks and recreational opportunities; and , entertainment and employment. For more information about the Villages of Irvine, visit . \n\nCalifornia Pacific Homes is a landmark homebuilder comprised of forward thinkers who possess the capacity and intuition to design and deliver inventive new neighborhoods in the most desirable locations. Driven by innovation and a fresh approach, the art and expertise of homebuilding is elevated to the next level by consistently introducing extraordinary new home opportunities to the Southern California marketplace. For more information, please visit . \n\nTo visit Zinnia, exit I-5 at Sand Canyon and turn left. Turn left on Nightmist, then left on Tulip. Located at Tulip and Evening Sun, the Zinnia models and sales office are open daily from 10 a.m. to 6 p.m. For more , call 949.502.5373. \n\nPrices, product type and availability are subject to change without notice. \n\nImage Available: \n\nKeywords (optional): \n\n\nUnternehmensinformation / Kurzprofil: \n\nLeseranfragen: \nPresseKontakt / Agentur: \n\nbereitgestellt von: Marketwired \n \nDatum: 11.09.2015 - 00:25 \nSprache: Deutsch \nNews-ID 1384752 \nAnzahl Zeichen:  \ncontact information: \nCompany: California Pacific Homes \nContact person:  \nTown: IRVINE, CA \nPhone: \n\nAnmerkungen: \n\nDiese Pressemitteilung wurde bisher 0 mal aufgerufen. \n\n \nVerlinkung-Tipps: \n\nDirekter Link zu dieser Pressemeldung: \n\n\nÜber einen Link auf Ihrer News-, Presse- oder Partner-Seite würden wir uns sehr freuen.", "source": "BusinessPress24"}