{"published": "2015-09-29T12:38:35Z", "media-type": "News", "title": "Journey to ‘smart land': No one wants to miss the bus", "id": "a52e8392-e312-4bcb-912a-6685461c4d79", "content": "in e-Thoughts | 11 Views \n\nPosted by: Elets News Network (ENN) \n\nPosted in: e-Thoughts \n\nRead more on: Governance | infrastructure | JNNURM | redevelopment | retrofitting | Smart City | smart solutions \n\nContributed by- Hitesh Vaidya, Practice Head (Urban Reforms), IPE Global \n\nThe urban sector at present is going through a lot of action and upheaval. Every state and city in the country wants to hop on to the ‘Smart City’ bus. Every state is struggling intra-political and administrative battles in order to include their best horses in the “Urban Premier League”. I have never witnessed such a feeling of euphoria and fierce competitiveness amongst states and cities on discussing urban challenges and branding their best horses for undertaking this journey. \n\nHowever, surprisingly, the names which are emerging as potential candidates for this premier list are not big cities but small and medium towns. Further, a surprise factor is that erstwhile Jawaharlal Nehru National Urban Renewal Mission (JNNURM ) cities are struggling to find their way into this league. \n\nOne would have thought them as ‘low hanging fruits’, where huge infrastructure investments and reforms have already happened during the last five years and only a minimum push to introduce smart solutions was required to take them to the next level. Even the conditions laid down for participation in this race provided a clear advantage for JNNURM cities. \n\nThe rules suggested for taking this journey towards smartness calls on cities to address two broad parameters (1) Physical Smartness: Retrofitting, Redevelopment, and Greenfield; and (2) Operational Smartness: Incorporating smart solutions for bringing operational efficiencies in cities, and responsiveness to citizens’ needs and requirements. \n\nOnce each state has earmarked/identified their suitable candidates, the race for smartness will begin. Out of 100, only 20 will be qualified in round one to take this journey forward and the rest will be asked to prepare and again come up for the subsequent rounds. It is the first time that states and cities are competing not only in branding themselves as smart, but also in creating a unique identity for themselves. This not only represents a paradigm shift which is taking place in addressing the challenges of urban transition witnessed by India, but also sending serious policy signals to state and local governments to work in converged and coordinated frameworks for addressing the urban menace. \n\nHowever, to embark and sustain this journey is not going to be easy. Looking at the existing governance and service delivery frameworks, it is surely a daunting task and cities will require huge handholding and implementation support ranging from knowledge products, expert consultant services, hands-on training, peer-to-peer learning and knowledge sharing platforms. But the journey offers an opportunity to discard old ideas and mind-sets in changing the way we plan, implement and develop longer visionary approaches for managing cities rather than short term knee-jerk reactions, which have started haunting our governance systems at local levels.", "source": "EGov Online"}