{"published": "2015-09-21T06:00:00Z", "media-type": "News", "title": "Google Drive for Business boosts data retention features in crowded market", "id": "f042d2b0-ca6c-4849-8cfa-c1378a48a1ac", "content": "One of the key ways of getting businesses to adopt new technology is to ensure that it meets with all of users' discovery and compliance requirements, including data retention and deletion. \n \nIf a company already deletes some or all of its data after a certain period of time, a new service needs to comply with that. \n \nGoogle is better addressing that market with its own cloud storage and collaboration product, as a result of new changes announced Monday morning. Drive for Work now features deeper integration with Google's Vault data management and e-discovery service that allows for better retention and deletion of company data. \n \nOnce administrators set a data retention policy, files will be saved for a defined period of time inside Vault, even if end users delete them from their Drive. In addition, companies can set a policy to automatically delete files after they reach a certain age, and place a hold on some data so it's available if needed for a lawsuit. \n \nEnd users don't have to do anything differently in order to take advantage of the capabilities, and the system is designed to be as invisible as possible when it comes to the end user experience. \n \n\"It's pretty much transparent in the sense that Vault, as its name suggests, is holding or expiring this content in its store,\" Scott Johnston, the director of product management for Drive, said in an interview. \"And so you take something like [the legal hold feature], you're going to delete something, and Vault's going to hold onto it as long as needed, but that's not going to interfere with your workflow. It's like having an extra storage device sitting there, helping you retain things that need to be retained.\" \n \nThe new features match existing Vault features that allow for retention of chats and emails sent through Google's business products. For now, the new data retention capabilities are being rolled out to a limited number of users, with full availability planned for later this year. \n \nIn addition to the new features, Drive for Work has now been certified to comply with the ISO 27018 standard , which governs how companies handle the privacy of personal data stored in their cloud. In particular, the certification is designed to prove that Google isn't using company data for advertising in addition to taking other privacy measures like protecting businesses from third-party data requests. \n\nJohnston said the ISO certification doesn't represent a policy change for Google, just an additional assurance that Drive for Work will keep users' data private. Because Google makes most of its money from tracking users' behavior and mining their emails to better serve ads, the company has to convince businesses that Drive is a private place to store things. \n \nMany of Google's competitors already had that same certification, including Dropbox for Business and Microsoft OneDrive. In a market with competition as tight as the one Drive is playing in, it's important for Google to have every possible advantage. Of course, it remains to be seen whether the company's assurances and this certification will do enough to allay users' fears, particularly about their data being used to power Google's advertising engine. \n \nThe company announced that it now has over 1 million businesses both paying for and actively using its Drive service, including the New York Times and Uber Technologies. It's good news for the Mountain View, California, company, which is trying to gain a stronger foothold among businesses that would traditionally use Microsoft's productivity software. \n \nGoogle won't say what exactly makes a business count as an active user, but it isn't counting those businesses that haven't actively used Drive in the past month or those that are paying for it but haven't rolled it out. \n \nOf course, that figure doesn't count all of the employees who are using personal Google accounts to take advantage of the company's collaboration tools without their company's supervision. The popularity of its collaboration tools among consumers is a good differentiator for Google: the company can encourage IT departments to adopt Drive because some of their employees are likely already using it to handle work. \n \nAll of this comes just a day before Microsoft is slated to release Office 2016, the next version of its venerable productivity suite. Improved collaboration tools that allow people to work together on documents from the Office desktop apps are one of the marquee features of the upgrade -- a direct strike against Google's dominance in the collaboration space. \n \nIt's possible that Microsoft's new features will prove enough to halt or at least blunt Google's advance into the enterprise market, especially as the Seattle-based tech titan continues to push its Office 365 services and improve their compliance and discovery capabilities. Alternately, Google's new features could help it introduce services to new businesses that would have ignored Drive for Work in the past. \n    Brand Post  Optus TV with Fetch offers a world of entertainment \n More from Optus    Join the Good Gear Guide newsletter!   \nError: Please check your email address. \n   \nTags Google Docs Google", "source": "Good Gear Guide"}