{"published": "2015-09-20T04:43:02Z", "media-type": "News", "title": "The Volcano House, Palazzo di Amore, the Flintstone House: What's the real worth of an over-the-top home?", "id": "3c8cc0df-fb5c-433f-b30b-0577e8b29b83", "content": "When Brian Grey had to figure out the value of a landmark home known as the Flintstone House, the appraiser couldn’t look to comparable residences. With its clump of bubble-shaped rooms, the home seemed to spring out of a Hanna-Barbera c… \r \nSome unusual homes are on the market and making headlines. counterclockwise: The Rock House, the Volcano House, the Flintstone House and Palazzo di Amore COMPOSITE BY MARILYN KALFUS; PHOTOS: JEFF GRITCHEN, LEONARD ORTIZ, MICHAEL McNAMARA, OPEN HOMES PHOTOGRAPHY \n\nSome unusual homes are on the market and making headlines. counterclockwise: The Rock House, the Volcano House, the Flintstone House and Palazzo di AmoreCOMPOSITE BY MARILYN KALFUS; PHOTOS: JEFF GRITCHEN, LEONARD ORTIZ, MICHAEL McNAMARA, OPEN HOMES PHOTOGRAPHY \n\nWhen Brian Grey had to figure out the value of a landmark home known as the Flintstone House, the appraiser couldn’t look to comparable residences. With its clump of bubble-shaped rooms, the home seemed to spring out of a Hanna-Barbera cartoon. \n\nGrey quickly realized, “I just don’t have another house that’s like this. \n\n” \n\nThat didn’t make the property a white elephant, though. \n\nWhen Grey asked several real estate agents in the Bay Area whether there was a market for the unusual home, he recalled, “The consensus was there’s constant demand. \n\n” \n\nSure enough, a buyer snapped it up for $800,000. \n\nNearly two decades later, the quirky marvel – remodeled and enhanced – is on the market again, this time for $4.2 million. \n\nIt’s one of several out-of-the-ordinary dwellings that have been making headlines lately. \n\nIn the Mojave Desert, a house shaped like a spaceship and set on the 150-foot cinder cone of an extinct volcano was listed at $650,000 earlier this month and went into escrow Friday. The property, on 60 acres with a lake, got multiple offers. In Beverly Hills, a sprawling compound touted as the priciest home in the U.S. last year just took a $46 million price cut. \n\nDespite their differences, houses like these raise a common question: How does anyone – real estate professionals, sellers or buyers – figure out what off-the-wall, over-the-top homes are worth? \n\nThe Volcano House was owned by TV personality Huell Howser, who gave it to Chapman University in 2012, a year before his death. The university had originally planned to use the house for desert studies, astronomy and geology pursuits. But it’s selling the property because its desert location, in Newberry Springs east of Barstow, was deemed too isolated for students. \n\nBrady Sandahl of Hom Sotheby’s International Realty says he and another agent listing the house considered other “architecturally significant” properties, mostly in the high desert, in coming up with the $650,000 price tag. \n\n“You just develop a business gut as to what you think the market will capture,” he said. “Then you turn to the buyers, and they’ll tell you why they’re giving you what they’re giving you. That’s the beauty of an open market. \n\n” \n\nSandahl said the multiple offers he received show the asking price was appropriate; three offers came in at $650,000 or more. \n\nBut clearly, the price tag would be higher if the property wasn’t so remote. \n\n“This is real estate,” said Grey, who appraised the Flintstone House. “The first three rules of real estate are location, location, location. \n\n” \n\nThe Flintstone House is on the opposite side of that rule. It’s 17 miles from San Francisco and right near I-280, a major freeway. \n\n“When you’re in the yard of the Flintstone House,” Grey said, “you hear that freeway very clearly. \n\n” \n\nWhile the noise outside the home is a minus, on the plus side, Grey said, the house itself is nearly soundproof: “It’s like being in a cave. \n\n” \n\nHe attributes that to the construction. Steel rebar and wire mesh frames were built over large inflated weather balloons then covered with gunite, or “shotcrete.” He said that makes the walls thicker than a typical home’s. \n\nAppraising even unusual homes involves the basics, Grey said. Size, number of rooms, quality of finishes and condition are all factors considered in addition to location. \n\n“Those are relevant to any house, no matter how unusual or historical or plain it is,” he said. \n\nTHE COMPS \n\nWith no truly comparable homes, Grey said, he used a bracketing system to determine where the Flintstone House fit on a spectrum. He placed the area’s high-end Tudor homes and plain ranch homes at opposite ends. \n\n“Appraising something … it’s quite a bit more art than science,” he said. “In terms of appraising that house, I put it right in the middle. \n\n” \n\nHe did not make comparisons with unusual homes elsewhere in the country, he said. \n\nWith land value varying greatly, he explained, “You could be avoiding an adjustment regarding the design of the house and making a huge adjustment for the difference in location. \n\n” \n\nIn Southern California, Realtors Joyce Rey and Stacy Gottula of Coldwell Banker Previews International cast a considerably wider net to come up with Palazzo di Amore’s $195 million price tag, which has since dropped to $149 million. \n\nThe agents said they looked to the most expensive homes worldwide. \n\nThe 25-acre compound with its own vineyard in Beverly Hills was touted as the most expensive in the U.S. when it came on the market last year. \n\nThe gated, 12-bedroom, 23-bathroom property was eight years in the making. It’s reached by a quarter-mile, tree-lined drive and has a guard station. A two-level entertainment center, with a 50-seat screening room and a bowling alley, is entered through a floating glass-floor walkway over pools lined by 70-year-old olive trees. \n\nThe main residence tops 35,000 square feet, while the entire estate has more than 53,000 square feet of living space. There’s garage parking for 27 cars, though the site “can easily accommodate parking for (approximately) 150 cars,” according to the listing. \n\n“There are so few comps, you really have to look at the history of sales in the area as well as the global sales,” Gottula said. \n\n“They’re going to be a global citizen of some kind,” Rey said of the likely buyers. “They’re going to have houses in various places, and they’re going to be looking, in all probability, in all of those markets. \n\n” \n\nThe Realtors considered the highest sales in London, Hong Kong, France and elsewhere. They …", "source": "MyInforms"}