{"published": "2015-09-02T20:29:04Z", "media-type": "News", "title": "Tom Brady and Gisele Bundchen: Is their marriage in trouble?", "id": "88c26b98-d6d4-4219-a615-255e4ac79262", "content": "Compiled by Is Tom Brady's ongoing legal battles with the NFL over \"Deflategate\" taking the -- uh -- air out of his power-marriage to Gisele Bundchen?\n\nUs magazine and other outlets are reporting that the six-year union between the Patriots quarterback, 38, and Bundchen, 35, has been severely strained, to the point that Bundchen consulted a divorce lawyer.\n\n\"Tom's become very nasty and irritable and started acting out on her,\" a source with ties to the couple told the gossip magazine. \"Things are very tense right now. This could be the end of them.\"\n\nRumors began circulating last month that all was not blissful in the glamorous family life of Brady and Bundchen, who together have two small children, 5 and 2, and earned $78 million last year.\n\nBut another source told OK magazine that the troubles started long before Brady got into trouble over some reportedly deflated footballs at the Patriots' AFC showdown against the Indianapolis Colts last January. The sourced hinted at another \"problem\" that's been plaguing the couple for years, according to the New York Daily News.\n\nI'm betting it has something to do with Bundchen's almost pathological need to constantly post pretentious Instagram photos of herself and her family -- getting her hair brushed out by a stylist while breast-feeding one of her kids, frolicking in the garden with her son at the couple's Architectural Digest-ready mansion and the family doing a cute kissing thing while standing together on a tropical beach.\n\nBut whatever the status of their marriage, it appears Bundchen, one of fashion's highest paid models, is standing by her man during his Deflategate woes. Bundchen was spotted with Brady in New York on Monday after his latest hearing in the scandal.\n\nA decision in the matter could be reached as soon as today, the New York Daily News said. \n\nMartha Ross provides celebrity commentary for the Bay Area News Group. Follow her at twitter.com/marthajross.", "source": "EveningSun.com"}