{"published": "2015-09-24T10:00:02Z", "media-type": "Blog", "title": "A Sign of the Apocalypse (at the Office)", "id": "8a263150-88e2-43be-9f4c-6357a84a1a9b", "content": "When I was in college, a fraternity brother who was one of those “Christians” prevailed upon me to read The Late Great Planet Earth by Hal Lindsay. I sat in the living room of the fraternity house and read about the coming end times. I was still a good pagan, but the book was totally absorbing and read like a supermarket novel. (My girlfriend had just broken up with me and I was likely highly receptive to the idea of end-times.) I enjoyed it, and was invited to a book discussion a few days later. The discussion turned out to be a meeting of all the born-again Christians in the fraternity. And me, the sole pagan. I manage to escape intact. Lindsay was off by at least a few years. And he missed one of the most obvious and frightening end-signs. Had he only know what was coming, his timetable could have been exact. It’s the devilish device that has strangled business, academia and government in a death-like vise for almost two decades. It’s done more to destroy common understanding than anything else ever created by man. It’s turned gifted speakers into automatons and audiences into rebellious serfs. Buried within its secret computer code is the number 666. We’re all doomed. The End Is Here I’m speaking, of course, of PowerPoint. The end is not near; the end is here.  Nothing can be communicated today without PowerPoint. Nothing. I can’t speak for government or academia, but nothing happens in business without PowerPoint. It’s a disease we’ve all caught, and we cheerfully spread it to others. “Forward-thinking” high schools teach it, and you can’t get a college degree without it. It’s an industry. You can hire a PowerPoint consultant. You can take courses in PowerPoint. There are seminars devoted to it. There are whole libraries written about it, and the web sites devoted to it are legion. PowerPoint is a cult. Attend a speech at a conference. Every speaker must have his “deck.” Every slide typically has all white space covered in words, and the speaker will read every one of them. He (or she – this is an equal opportunity apocalypse) never understands that his audience can read faster than he can speak, finishing the slide long before he does. People tweet and blog speeches now because they’re bored to death by PowerPoint. And that’s despite all the PowerPoint “apps.” Business executives are nothing if not competitive. Who has the most complex graphics? How many videos can you embed on a single slide? Who can make the best use of Flash, or open up a web site right on the slide? How about live-streaming a Twitter convo? You’re Kaputsky, Baby!  I was one of several people presenting at a meeting recently. PowerPoint slides were mandatory. I gave my few slides to the organizer, who looked them over and smiled knowingly: You’re doomed, Young. No graphics or color. And only four or five words per slide! You’re kaputsky, baby! Guess whom the audience paid attention to? They were rather astonished, yes, but then I was talking about something they deeply cared about. They listened. They asked questions. They forgot all the other presentations. I gave another talk and didn’t use any slides at all. Despite the scandal, we all survived. I’ve made a decision. I will fight this evil, and I will fight it everywhere – the beaches, the streets, the auditoriums, the conference rooms. I will stand alone if I have to, but I will fight. The world does not have to come to an end in an exploding deck of PowerPoint slides. And I will write The Late Great PowerPoint. (This article was originally published by The High Calling, and it reprinted here – slightly revised – under a creative commons license.) Top photograph by Lode Van de Velde, and middle photograph by Ian L, via Public Domain Pictures. Used with permission.", "source": "Faith, Fiction, Friends"}