{"published": "2015-09-22T04:03:20Z", "media-type": "Blog", "title": "Weekly review", "id": "3510bd26-16b7-4a27-9f71-612d033b146e", "content": "All right, y'all.  WHat can't these load the way I want?!  This mama does not have time to rearrange this stuff!  Well, here are our events pics in reverse order!  First a summary, in order!  What a busy week!  Monday, we did work in the AM, then went to our first homeschool group park play date in Urbana.  I think it will be a good fit for us.  The kids had fun and I got to meet some nice parents.  The kids had speech services on Tuesday and Thursday morning.  The boys had piano lessons on Wednesday afternoon.  GAreth had soccer practice Monday and Thursday evening.  Zane had flag football practice on Tuesday and Thursday evening.  I had a Girl Scout leader meeting MOnday night.  I subbed at my old job on Tuesday, Wednesday, and Thursday.  Brian works from home and can assist with schooling, when needed.  We got Nana's help for some of their appts and practices.  Brian has been working 4 evenings a week delivering pizzas.  Friday, we participated in a homeschooling program at Lake of the Woods Forest Preserve, then stayed to play at the preserve, exploring many sites I had when I was a kid.  Saturday, Iris had Cheer Camp, Zane had his last flag football game of the season, and Gareth had his first soccer game.  Saturday night, I took the kids to Champaign to the CU Pride Fest, where they played games and watched the parade.  Whew! \nThe wonderful thing about homeschooling is that if we don't get it all done, we can do some in the evening or on the weekends, or move it to next week.  The poor kids have been wanting to start rock candy for 3 weeks now!  It keeps getting moved back.  Working 3 days at my old job in 1 week is a bit much, but I am saving for our upcoming trip to SOuth Dakota next month.  After that, I would love to be able to help out with the household, making progress in farm plans.  We are managing with all the craziness.  It helps to know it is all temporary.  We are making these choices....we are healthy and capable, so we are working hard while we can. \nWell, on to the pics!  Got to get ready for bed!  bounce houses at Pride Fest the kids LOVED this dunk tank!  waiting for the parade last flag football game of the year 1st soccer game life on the farm with cuties feeding goats loving on kitties Lake of the Woods Forest Preserve Program bison vs human shoulder blade bison vs human rib talking about controlled prairie burn Iris loved these paper dolls, so what is her art project next week?  A bunch of paper dolls of her own!  :) I love this girl's beauty!  See?!  Gareth KNOWS what needs to be done..... drunk patrons I had told the kids about this amazing oak tree at the park that needed stilts to support the reaching limbs.  Sadly, I learned it fell over about 8 years ago!  This stump is till there.  We went and paid our respects. the tower the kids and I climbed and conquered.  the shaky bridge that I one ran across when I was their age.  :)  I love to revisit places and have the kids do the same thing I had done.  There ya go!  Have a great week!  Mine is gearing up to be another busy one! ", "source": "Our Happy Chaos"}