{"published": "2015-09-14T02:40:35Z", "media-type": "News", "title": "Malaysia: Electronic Industry Citizenship Coalition launches migrant worker protection project", "id": "548e53a5-bb16-4e88-8253-91c1ec5b40eb", "content": "| Business & Human Rights Resource Centre      Skip Content   Home ▹ Malaysia: Electronic Industry Citizenship Coalition launches...       \r\n                Author: Electronic Industry Citizenship Coalition (EICC) on CSRwire,                 Published on: 14 September 2015   \n\"Electronics Industry Pilots Factory Worker Protection Program in Malaysia\", 26 Aug 2015 \n \nThe Electronic Industry Citizenship Coalition ( EICC ), a non profit coalition of leading electronics companies dedicated to supply chain responsibility...announced the launch of a foreign migrant worker protection pilot program that aims to improve communications in electronics factories by providing workers with more effective ways to report issues related to social, environmental and ethical responsibility. The name of the program is Suara Kita, which is Malay for \"Our Voice.\"...The program will be piloted in Malaysia, given the sizable industry presence and large number of foreign workers there...The EICC program aims to improve worker-management communication in factories; build off existing company training, grievance and helpline efforts; inform the larger EICC grievance management strategy globally; and complement other efforts to implement new standards governing foreign migrant workers as outlined in the  EICC Code of Conduct  and regulations such as the U.S.  Federal Acquisition Regulation  (FAR) on Ending Trafficking in Persons. \n \nRead the full post here \n  Categories             Search site               \nBy continuing to use the site, you agree to the use of cookies. more information  Accept \n \r   \nThe cookie settings on this website are set to \"allow cookies\" to give you the best browsing experience possible. If you continue to use this website without changing your cookie settings or you click \"Accept\" below then you are consenting to this. \n \nClose", "source": "Business & Human Rights"}