{"published": "2015-09-14T03:17:06Z", "media-type": "News", "title": "Delhi: Suicide shock jolts AAP government into action", "id": "1ed73c81-20aa-473a-a6c9-a7c5ebddefb2", "content": "On Sunday, Delhi Health Minister Satyendra Jain ordered the purchase\r\n of 1,000 new beds to accommodate the surging number of dengue patients \r\nin hospitals. \n\r\n\r\n\r Laxmichandra and Babita Rout had committed suicide after their 7-year-old son Avinash died due to suspected dengue.  \r \nA seven-year-old boy's death followed by his parents' suicide has forced the government to wake up to the threat of dengue in Delhi. \n\nOn Sunday, Delhi Health Minister Satyendra Jain ordered the purchase of 1,000 new beds to accommodate the surging number of dengue patients in hospitals. He also suggested that hospitals may postpone surgeries if possible to free beds for dengue patients, besides promising strict action against MCD staff members who were not executing fumigation work properly. \n\nThe directions come in the wake of public outrage over a seven-year-old's death due to suspected dengue followed by his parents ending their lives by jumping off a building. Laxmichandra and Babita Rout, who hail from Odisha, had taken their only child Avinash to five private hospitals on September 7 but he was allegedly refused admission by the hospitals. After cremating him, the couple jumped off a four-storey building in Lado Sarai area of the Capital on Wednesday morning. \n\nThe Capital is witnessing the worst dengue outbreak this year with 1,259 dengue cases being recorded so far. The number was reportedly higher only in 2010 when 1,512 cases were recorded in Delhi. \n\nHealth Minister Jain on Sunday held a meeting of the health secretary, divisional commissioner and directors of local bodies. \"In view of the rise in dengue cases, I have ordered to buy 1,000 new beds within the next three or four days. If hospitals lack space, the new beds can be kept in lobbies or wherever space is available,\" Jain said after the meeting. \n\nThe minister also suggested that hospitals may postpone surgeries if possible to make beds available for dengue patients. \"Hospitals have been asked to postpone surgeries by one month... our first priority is to treat such (dengue) patients,\" he said. Jain issued directions to all DMs, SDMs and tehsildars to closely monitor dengue cases in their wards. \n\nJain accused the three municipal corporations of shirking away from their duty to control the mosquito menace. \"We have got several complaints from people that the MCD staff do not visit their homes (for fumigation), which is unacceptable. \n\nThe government will take strict action against those who do not work properly,\" Jain said. The minister also acknowledged the infrastructure-related problems faced by the government while tackling the problem. \n\n\"We do not deny that there are two patients on one bed but hospitals are working hard. We are working more on prevention... not much has been done regarding this. People should get admitted to hospital only after consulting a doctor and not out of panic,\" he said. \n\nMeanwhile, the Congress on Sunday attacked the Centre and Delhi Chief Minister Arvind Kejriwal over the issue. \n\nParty spokesperson Abhishek Singhvi said, \"Hospitals are directly under your (Delhi CM) supervision. In the Capital, a healthy child dies one day due to a disease and parents have to commit suicide. You are spending Rs 700 crore on advertisements. You could have given at least Rs 70 crore of this to Delhi hospitals to save lives.\"", "source": "India Today"}