{"published": "2015-09-05T14:21:15Z", "media-type": "News", "title": "Single Window System alone will not deliver", "id": "6ca6c519-d2de-4ffd-9723-b0c6eda823de", "content": "Port of Mombasa. If all systems work as intended to, goods will be cleared faster. PHOTO | FILE  \n \nInternational trade has grown rapidly in recent years, thanks to the progressive reduction of tariffs and quotas through multilateral trade liberalisation. \n \nMore trade means more goods crossing borders and having to comply with Customs formalities. \n \nBusinesses suffer both direct border-related costs, such as expenses related to supplying information and documents to the relevant authority, and indirect costs, such as those arising from procedural delays, lost business opportunities and lack of predictability in the regulations. \n \nSurveys aimed at calculating these costs suggest that they may range from 2 per cent to 15 per cent of the value of traded goods in developed countries and upto between 30 per cent and 42 per cent in production costs in developing countries. \n \nInefficient border procedures cost governments in terms of lost revenue, smuggling and difficulties in implementing trade policy, for instance because of difficulties in determining the origin of products or in collecting accurate statistics. \n \nWith increasing integration of economies around the world, facilitating the smooth flow of trade becomes a pressing requirement for governments and businesses. \n \nEfficient information systems and procedures can significantly reduce the time taken to move goods, reduce costs and improve business. \n \nIn Kenya, trade facilitation is carried out by a number of institutions. The roles of the trade facilitating agencies range from revenue collection, provision of services for cargo movement and ensuring that goods conform to the set standards and health regulations, efficiency and enhance the overall economic performance of a country. \n \nThe overall objective of the Kenya Electronic Single Window System Project also known as Kenya TradeNet System is to facilitate international trade in Kenya by reducing delays and lowering costs associated with clearance of goods at the border, while maintaining the requisite controls and collection of levies, fees, duties and taxes on imports or exports. \n \nDespite recent reforms, trade related procedures remain lengthy and costly; an aspect which has negatively impacted on the competitiveness of Kenyan goods in the region. \n \nThe rationale for implementing the Single Window System results from the following weaknesses inherent in the current system: \nBesides having upto 27 agencies, duplication has become the order of the day, for example between Kenya Bureau of Standards and National Transport Safety Authority on vehicle inspections, Pharmacy & Poisons Board and Nursing Council of Kenya, National Bio safety Authority and Radiation Protection Board. Again the motivation does seem to be elsewhere – revenue generation. \n \nEssentially, everyone stands to gain from making the process of trade easier. Governments gain because efficient border procedures enable them to process more goods and improve control of fraud, thus increasing government revenue. \n \nBusinesses gain because, if they can deliver goods more quickly to their customers, they are more competitive. And consumers gain because they are not paying the costs for lengthy border delays. \n \nThe benefits of single window clearance of cross-border cargo to an economy are numerous. The World Bank says that economies that have adopted single window systems for transparent, efficient and faster cargo clearance are better than those without. \n \nThe Bank’s 2014 Logistics Performance Index ranking places Kenya at number 74 while Egypt and South Africa are at 62 and 34 respectively.", "source": "East African"}