{"published": "2015-09-10T13:41:02Z", "media-type": "News", "title": "Pakistani doctor stuck in prison after helping US find Osama bin Laden", "id": "1d970cf0-798c-46fe-b12e-e55bc75b324b", "content": "An AFP journalist looks at a page displayed on the website of the Office of the Director of National Intelligence May 20, 2015 in Washington (AFP Photo/) \n\nThe lawyer for a Pakistani doctor who was jailed after helping the CIA find Osama bin Laden accused the government Thursday of deliberately delaying his appeal after the case was adjourned for the sixteenth time. \n \nShakeel Afridi, who ran a fake hepatitis vaccination programme as cover for an operation to find the 9/11 mastermind, was in 2012 found guilty by a tribal court of having ties to militants and jailed for 33 years. \n \nThe conviction was widely seen as politically motivated. \n \nLast year a tribunal cut 10 years off his sentence, but he filed an appeal in March seeking bail and a fresh trial. \n \nBut Afridi’s lawyer, Qamar Nadeem Afridi, said that since March, 16 sessions had passed without any proceedings because the administration of Khyber tribal district had failed to submit documents for the case to the tribunal. \n \n“Yesterday (Wednesday) the judge again asked for the record and the Khyber administration did not submit it,” Qamar Afridi, adding that a new hearing had now been set for October 16. \n \nIn his appeal Shakeel Afridi had asked the tribunal to review the entire case and acquit him or grant him bail until it was heard. \n \n“We are of the view that either Khyber administration is using delaying tactics so that Dr Afridi continues to languish in prison or they have lost the record,” his lawyer said. \n \nAn official of the Khyber administration told AFP on condition of anonymity that for some “legal complications” they could not submit the case file, but now it would be done as soon as possible. \n \nThe 2011 killing of Osama Bin Laden caused massive embarrassment for Pakistan and particularly its powerful military, which was accused of deliberately concealing him for possible use as a diplomatic bargaining chip with the US. \n \nSome US lawmakers have said Pakistan’s handling of the Afridi case was revenge for assistance in aiding a foreign power, and the US is withholding $33 million in planned aid pending Afridi’s release. \n \nThe CIA’s fake vaccination campaign meanwhile increased Taliban opposition to immunisation drives, which the militants say are cover for spying, and attacks on health teams have claimed 78 lives since December 2", "source": "Raw Story"}