{"published": "2015-09-27T17:16:25Z", "media-type": "Blog", "title": "NGOCC condemns Lungu for hiring expensive jet to New York amid poverty", "id": "c4268f21-bd61-43cd-affa-1b47be4866cd", "content": "NGOCC chairperson Sara Longwe says she does not understand why President Edgar Lungu chartered a plane to New York if his health is as perfect as he claims amidst many economic challenges the country is going through. And Longwe says the PF government is not trustworthy. President Lungu has chartered a plane for his entourage to attend the United Nations General Assembly in New York. See details here But Longwe has challenged President Lungu to explain to the poverty-stricken Zambians why he had to use a foreign chartered plane using taxpayers’ money if he was fit and did not need any special treatment. She further challenged the President to state why he could not board ordinary planes as past heads of state did, when he was fully aware that the nation was facing unprecedented economic challenges that needed urgent redress. “He [President Lungu] says he is a healthy person, therefore he doesn’t need any special treatment and he can travel to those places. Why did he have to hire a plane from South Africa?” Longwe wondered. She said if President Lungu’s health did not permit him to use ordinary planes, he should have instead asked his Vice-President Inonge Wina or foreign affairs minister Harry Kalaba to represent him instead of wasting huge sums of money on chartering a foreign plane. “He [President Lungu] is so extravagant; he should be using ordinary planes like other people do because we are a poor nation, which can’t be engaging in those things [chartering planes],” she said. Longwe, who expressed disappointment at the large entourage the President travelled with, advised him to be mindful of how he was using and spending national resources. “It looks like he has taken far too many people with him which is again using up our resources, which for us as women could have done great wonders in reducing maternal mortality, malnutrition and also providing salaries for people who are providing these services. And so he is being extravagant; that is why we wanted a new constitution, because a new constitution in the bill of rights, which he has not put forward as a priority, could have helped our MPs to control government expenditure, because that is why they are there, to give checks and balances,” she said. And Longwe said there is no guarantee that the PF will retain power next year with the many Zambians in despair. She said the NGOCC was not happy with the PF government because it had reneged on its earlier promise to enact a people-driven constitution. “President Edgar Lungu has ignored many issues. I know some of my colleagues have said he said good things in his speech [in Parliament] but such are not operable, especially for the time that is left; the time that this PF government is left with,” Longwe said. “We know for a fact that when a new government comes in, unless they continue but if they continue, it will be like the lies which they have made, they said they would do certain things before they assumed power but then they did other things. So are we to believe in them that if they continue, they will do the right thing when they have done the wrong things before? The answer is no! So it has really left us with a sour taste! The PF is not trustworthy; they are just tongue wagging.” She doubted whether Zambians would re-elect the PF in next year’s elections with the many economic challenges they were facing. “The PF, really, have little time left as a government…Right now, the incomes for households are going to be lower but the needs will still remain and even increase because people are not well fed; they don’t have sound income; their morale is down and they are losing patience too. There is hunger and this will lead to more deaths, especially the maternal death rates; they will increase because right now, many women are not able to access the facilities that are scanty within the country,” said Longwe. Post NGOCC condemns Lungu for hiring expensive jet to New York amid poverty added by + on September 27, 2015\nView all posts by + → Amos Chada is not even educated, says Mulongoti", "source": "Zambian Watchdog"}