{"published": "2015-09-17T19:10:33Z", "media-type": "News", "title": "Atoms in Industry: Rays of Hope for Development", "id": "c7c1411a-e08d-4b48-a929-9732758cbc64", "content": "MIL OSI – \n \nSource: International Atomic Energy Agency – IAEA – Press Release/Statement: \n \nHeadline: Radiation technology has the potential to boost industrial development, improving productivity in a cost-effective and environmentally-sound way, was the conclusion of this year’s Scientific Forum. Held over two days during the IAEA’s General Conference, the event Atoms in Industry – Radiation Technology for Development reviewed best practices on the uses of nuclear techniques to improve and control the quality of products and processes. \n \nLeading experts, academics and industrial representatives met in Vienna, Austria, from 15-16 September 2015 to discuss how the atom can help close the gap between developing and developed countries. Cutting-edge technologies help countries to establish modern industries, which are vital for economic growth.   \n \n“Nuclear techniques are used extensively in industry to increase product quality and safety, benefiting both producers and consumers. Radiation tools make industrial production cleaner and more effective,” said IAEA Director General Yukiya Amano at the opening of the Forum. \n \nHis address was followed by keynote addresses by Sergey Kirienko, Rosatom Chief Executive Officer, Ratan Kumar Sinha, Chairman of India’s Atomic Energy Commission, and young scientist Taylor Wilson, a 21-year-old nuclear physicist from the United States. \n \nExperts went on to explore the benefits radiation technology can bring during six sessions:   \n \nBattling the bugs \n \nStarting off with the health sector, the Scientific Forum considered the advantages of gamma rays – a form of electromagnetic radiation – in sterilization over other methods. This technology is very cost-effective, with 95 per cent reliability in operation, low maintenance needs and minimal technical training requirements. It also allows the sterilization of products in their final wrapping and without any chemical additives, making it a green technique. As the global medical device market expands rapidly, the application of radiation techniques in this industry will be even more relevant, the session concluded.   \n \nLinking the chains \n \nRadiation processing of polymers – complex chains of molecules – is by far the largest application of the atom in industry. It makes materials more stable, durable and resistant – from computers to car parts and cosmetics, many everyday items are improved with radiation. This session explored what this technique can offer in a variety of sectors, including agriculture and medicine, and highlighted the fact that it is very environmentally friendly.    \n \nSolutions for pollution \n \nThe benefits of electron beam technology, which uses free energetic electrons to treat materials, was the topic in focus during the third session. The use of e-beam is of great value in protecting our planet. Every year, pollution increasingly affects the atmosphere and water resources. Radiation techniques offer a cost-effective way to treat persistent pollutants in air and water, and help identify contaminating pathways. The session concluded that, although only developed in the last two decades and applied in a few countries, electron beam technology has great potential as a tool to tackle environmental pollution. \n \nTracing the pathways \n \nRadiotracers and nucleonic gauges are used extensively in industry in both developing and developed countries. From the protection of coastlines to the oil and mining industry and civil engineering, this well-established technology optimises processes, monitors signs of wear and corrosion and gives reliable information about phenomena that cannot otherwise be seen. Radiotracers are already being deployed in numerous industries, but there many more where this unique technique can be of great use, the session concluded. \n \nBolstering safety and quality \n \nNon-destructive testing (NDT) has become indispensable in modern industry was the message from this session. This technology helps industries to detect faulty equipment, optimize production and ensure the safety of processes. The training and certification of NDT personnel is a challenge, especially in developing countries, and creating a qualified workforce to carry out NDT effectively needs to be given priority. A suggestion from the session was the creation of a global network to help train and certify professionals worldwide. \n \nRays of hope \n \nThere are many promising applications of radiation technology. The Forum discussed examples of how these techniques can preserve the past by protecting our cultural heritage, help us in the present by creating materials to support agriculture, and lead us into the future through its application in the field of nanoscale engineering.  \n \nThe Forum was concluded by a panel discussion on how radiation technology can be used and transferred, featuring IAEA Director General, Mahama Ayariga, Minster of Environment, Science, Technology and Innovation of Ghana, Jose Fidel Santana Nunez, Vice Minister of Science, Technology and Environment of Cuba, and Lydia Parades Gutierrez, Director General of the Mexican National Institute for Nuclear Research. \n \nRadiation technology is applied in many sectors in Ghana, and from medicine to agriculture, we have seen how greatly these techniques benefit various industries, Mr Ayariga said. He added that in the future, radiation techniques will play an even a more essential role in many sectors in his country. \n \nDuring the last decade Cuba has made a great progress in deploying radiation technology in different industries, continued Mr Santana Nunez. From setting up new irradiation laboratories to developing hydrogel membranes for treating patients to training qualified personnel in non-destructive testing – Cuba’s industry has made good use of radiation technology over the past years, he emphasized.  \n \n— \n \n© Multimedia Investments Ltd Terms of Use/Disclaimer.", "source": "Foreign Affairs.co.nz"}