{"published": "2015-09-04T12:09:47Z", "media-type": "News", "title": "Ventas, Inc. Announces Quarterly Dividend of $0.73 (VTR)", "id": "655a5cc2-bc2e-4369-bd29-0f75aa3dff5c", "content": "Ventas (NYSE:VTR) announced a quarterly dividend on Thursday, September 3rd, ARN reports. Stockholders of record on Tuesday, September 15th will be given a dividend of 0.73 per share by the real estate investment trust on Wednesday, September 30th. This represents a $2.92 annualized dividend and a dividend yield of 5.36%. The ex-dividend date of this dividend is Friday, September 11th. This is a positive change from Ventas’s previous quarterly dividend of $0.69. \n\nVentas ( NYSE:VTR ) opened at 54.45 on Friday. Ventas has a 52-week low of $53.86 and a 52-week high of $81.93. The company has a 50 day moving average of $62.91 and a 200 day moving average of $67.70. The company has a market capitalization of $18.10 billion and a PE ratio of 35.31. \n\nVentas (NYSE:VTR) last released its quarterly earnings data on Friday, July 24th. The real estate investment trust reported $1.18 EPS for the quarter, topping the consensus estimate of $1.16 by $0.02. The business earned $891.30 million during the quarter, compared to the consensus estimate of $871.22 million. During the same quarter in the previous year, the business posted $1.12 earnings per share. Ventas’s quarterly revenue was up 18.6% compared to the same quarter last year.  On average, equities research analysts forecast that  Ventas will post $4.46 earnings per share for the current fiscal year. \n\nSeveral analysts have recently weighed in on the stock. Mizuho decreased their price target on shares of Ventas from $85.00 to $64.00 and set a “buy” rating for the company in a research note on Friday. Deutsche Bank cut their price objective on shares of Ventas from $72.00 to $64.00 and set a “hold” rating on the stock in a report on Thursday. Citigroup Inc. boosted their price target on shares of Ventas from $62.17 to $63.00 and gave the stock a “neutral” rating in a report on Wednesday, August 19th. BMO Capital Markets dropped their price objective on shares of Ventas from $74.00 to $65.00 and set an “outperform” rating on the stock in a report on Wednesday, August 19th. Finally, Evercore ISI decreased their price target on Ventas from $77.00 to $65.00 and set a “buy” rating on the stock in a research report on Monday, August 17th. Five research analysts have rated the stock with a hold rating and five have given a buy rating to the stock. The stock currently has a consensus rating of “Buy” and a consensus target price of $70.60. \n\nVentas, Inc. is a real estate investment trust ( NYSE:VTR ). The Firm has a portfolio of healthcare properties and seniors housing found throughout the United States, Canada along with the United Kingdom. The Business operates through three sections: triple- senior living operations, net leased properties and operations that are MOB. The triple-net leased properties section invests in seniors housing and health care properties throughout the USA as well as the UK and rent those properties under triple- complete or net -net leases that obligate the renters to pay all property-related expenses to healthcare operating companies. The senior living operations section invests in seniors housing communities throughout the United States and Canada and employs independent operators, including Atria and Dawn, to manage those communities. The MOB operations segment, acquires, leases, develops, owns, and manages MOBs throughout the USA. It invests in seniors housing and healthcare properties.", "source": "WKRB News"}