{"published": "2015-09-09T15:29:40Z", "media-type": "News", "title": "SPYR APP LLC's New Managing Director of Games and Apps Provides Vision for 2015", "id": "5a453811-b601-4e55-97f9-1e9218b46fd0", "content": "DENVER , Sept. 9, 2015 /PRNewswire/ --SPYR, INC. (OTCQB: SPYR), a holding company with wholly owned subsidiaries in the digital publishing and advertising industry, mobile game and app development industry, and the food service industry, today followed up its recent announcement of the appointment of Paul Thind as Managing Director of the Company's wholly owned subsidiary, SPYR APPS, LLC, which focuses on the development of digital games and applications, by revealing some of the strategic goals and actions Mr. Thind expects to implement early in his tenure with the Company. \n \nMore specifically, Mr. Thind has already taken steps to: \n Establish a core team of mobile games industry professionals in Marketing, Business Intelligence, Studio and Production;  Establish a team of industry expert advisors to assist with strategic direction of the Games Publishing Division;  Source the first round of third party Mobile Games that will be published under the SPYR APPS label; and  Initiate a \"soft launch\" of SPYR APPS' third original IP mobile title in core test markets. \n\"At SPYR APPS, LLC, we intend to create a world-class mobile game development and publishing company by working with third-party developers as well as developing our own IP,\" stated Mr. Thind. \"We are currently in the process of adding the people to our team who will help get us there. We have also identified several new third party games for acquisition or joint venture that we believe will be incredibly successful.\" \n\n \nMr. Thind added, \"By setting a clear business strategy based on producing and publishing high quality games, I hope to create long-term shareholder value. Empowering the business to capitalize on new and exciting games will make SPYR a company that not only embraces change, but also creates it.\" \n \nMr. Thind concluded, \"Through dramatic expansion, procurement of co-development deals, acquisitions and games publishing, we intend to position SPYR APPS for continued success. Our company culture will be based on the Key Performance Indicators and strong analytics-based thinking that I've found to be incredibly successful in the free to play mobile games business. This, along with the creativity of our game designers, producers and developer partners should position SPYR APPS as a major player in the global games and apps market. Of course it all starts with the user, and we will be committed to creating fun experiences for our users to keep them engaged and satisfied.\" \n \nAccording to NewZoo, a games market researcher ( www.newzoo.com ), the mobile games market will rise to an impressive $35.4 Billion USD by 2017. SPYR APPS, LLC believes that it is poised to be a part of this growth by beefing up its team and its games portfolio under the leadership of Mr. Thind. \n \nAbout SPYR \n \nSPYR, INC. is a holding company that through its wholly owned subsidiary, Franklin Networks, Inc., is engaged in digital publishing and advertising operations, and through its wholly-owned subsidiary SPYR APPS, LLC, is engaged in mobile application and game development. SPYR, INC. also owns and operates an \"American Diner\" theme restaurant located in the Philadelphia International Airport in Philadelphia, Pennsylvania called \"Eat at Joe's\" through its other wholly-owned subsidiary, E.A.J.: PHL Airport Inc. The Company is currently exploring opportunities for additional acquisitions in these and other verticals, including mobile application and game development, in order to expand its holdings, to drive and increase revenue and to generate profits and build value for shareholders. \n \nSafe Harbor Statement: \n \nThis release contains forward-looking statements that are based upon current expectations or beliefs, as well as a number of assumptions about future events. Although we believe that the expectations reflected in the forward-looking statements and the assumptions upon which they are based are reasonable, we can give no assurance or guarantee that such expectations and assumptions will prove to have been correct. Forward-looking statements are generally identifiable by the use of words like \"may,\" \"will,\" \"should,\" \"could,\" \"expect,\" \"anticipate,\" \"estimate,\" \"believe,\" \"intend,\" or \"project\" or the negative of these words or other variations on these words or comparable terminology. The reader is cautioned not to put undue reliance on these forward-looking statements, as these statements are subject to numerous factors and uncertainties, including but not limited to: adverse economic conditions, competition, adverse federal, state and local government regulation, international governmental regulation, inadequate capital, inability to carry out research, development and commercialization plans, loss or retirement of key executives and other specific risks. To the extent that statements in this press release are not strictly historical, including statements as to revenue projections, business strategy, outlook, objectives, future milestones, plans, intentions, goals, future financial conditions, events conditioned on stockholder or other approval, or otherwise as to future events, such statements are forward-looking, and are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. The forward-looking statements contained in this release are subject to certain risks and uncertainties that could cause actual results to differ materially from the statements made. Readers are advised to review our filings with the Securities and Exchange Commission that can be accessed over the Internet at the SEC's website located at http://www.sec.gov . \n \nInvestor Relations Contact: \nMarlin Molinaro  \nMarmel Communications, LLC \n(702) 434-8692 \nmmolinarofc@aol.com \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/spyr-app-llcs-new-managing-director-of-games-and-apps-provides-vision-for-2015-300139327.html \n \nSOURCE  SPYR, INC. \n \nCopyright 2014 PR Newswire.  All Rights Reserved \n\nGame Development, Marketing/Distribution, Internet/Web, Business, Internet, Marketing,  Inc., Internet Technology, Game Technology, Business, Internet, Other, \n\nSource:PR Newswire.\n All Rights Reserved", "source": "Consumer Electronics Net"}