{"published": "2015-09-09T09:42:01Z", "media-type": "News", "title": "ONF Officially Releases First Batch of OpenFlow v1.3 Certificates in the World", "id": "4c8f1288-d2f8-4e1e-8258-2fbed7f108aa", "content": ", Dan Pitt , the Executive DirectorÂ of Open Networking Foundation (ONF) in California announced on ONF Member Workday, that five types of SDN switches produced by Huawei, ZTE, H3C and DCN had passed OpenFlow v1.3 conformance test implemented in BII Group-Global SDN Certified Testing Center (SDNCTC, www.sdnctc.com/en )  becoming the first batch of equipment toÂ pass the industry pioneering Â OpenFlow v1.3 conformance test. \n  \nIn recent years, as a new kind of network innovation framework, the software defined network (SDN) is considered as an important direction for the next-generation network revolution. The market acceptance of OpenFlow, as the southbound interface protocol standard of SDN, also increases rapidly. The ONF Certificate of Conformance, as the unique certificate to determine if testing equipment conforms to the OpenFlow standard in the Â current SDN market, is consistently recognized by professionals within industry. The acquisition of test certification can shorten the Â product development cycle, enhance the confidence of users, accelerate product deployment and promote competitive advantages in the market. At this time, as the first batch of switches obtaining ONF Certificate of Conformance in the world, Huawei CE6851-48S6Q-HI, ZTE ZXR10 M6000-S, H3C S6800, H3C S5130 and DCN DCRS-7604 will undoubtedly promote the maturity of the Â global SDN industry and accelerate the Â application process of SDN. \n \nIt's worth mentioning that all of the OpenFlow v1.3 conformance tests are finished under the support of OFsuite, official test tool of ONF. Guided by the Global SDN Certified Testing Center, OFsuite is the first test tool in the world completely covering ONF OpenFlow v1.3 test specification. It can offer comprehensive support for automated test ing against equipment applying for the Â OpenFlow v1.3 Certificate of Conformance. Besides, with the Â abundant monitoring and diagnostic features of OFsuite, it's convenient to modify and upgrade the equipment during test ing . \n \nAccording to Mr. Li Zhen , director of the SDNCTC, \"The first batch of ONF OpenFlow v1.3 product certification shows that SDN product standardization has made a solid stride forward, and that the SDN products are ready to be deployed. Five devices from four vendors in China are the first in the world to be certified by OpenFlow v1.3,Â  an achievement brought about through the efforts by the coordination and collaboration between China SDN commission which Â has established an example for the global SDN industry. In the future, we will see more OpenFlow v1.3 certified products available on the market, giving an impetus to the development and improvement of the whole ecosystem across the entire industry.\" \n \nGlobal SDN Certified Testing Center (SDNCTC) \n \nThe SDNCTC ( www.sdnctc.com /en) is a third party and neutral SDN/NFV testing and certificating agency, dedicated to the technical R&D of SDN/NFV, testing and certificating, and deployment and promotion. The SDNCTC and ONF SDN/NFV international standardization organizations work together to lead the efforts of formulating standards, construction of certificating, and R&D of testing tools. And at the same time, it provides authoritative and neutral testing and certificating service, promotes the improvement of technologies and products, and safeguards the commercial deployment of SDN/NFV. \n \nOpen Networking Foundation \n \nIt was co-founded by Deutsche Telekom, Facebook, Google, Microsoft, Verizon, and Yahoo!.Â  As a fast-growing non-profit organization, ONF has already 140 plus members, with the shared commission of accelerating the deployment of open SDN. ONF promotes open SDN and the OpenFlow technical standards, and boosts the development of products, service, application, customer and user markets. \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/onf-officially-releases-first-batch-of-openflow-v13-certificates-in-the-world-300139778.html \n \nArticle source and copyright ©  PR Newswire Europe Limited, all rights reserved. \nTrademarks, logos, pictures and other items may be copyright of firms mentioned in this article.", "source": "ITbriefing"}