{"published": "2015-09-10T13:57:55Z", "media-type": "News", "title": "Americans will bet billions illegally, group says", "id": "e0b9e9d2-86aa-4d2b-a87b-9cb5c64aa750", "content": "September 10, 2015 9:57 pm \r\n                \t\t               \r \r [embedded content] \r \r \r \r\n\r \r \r Tweet \r \r \r \nLOS ANGELES: The National Football League season kicking off Thursday will unleash a flood of wagering in which $95 billion will be bet, most of it illegally, the American Gaming Association said on Wednesday (Thursday in Manila). \n \n“Illegal sports betting is reaching new heights of popularity in America,” Geoff Freeman, president and chief executive of the Washington-based trade group said in a press release. “It’s clear that a federal ban on traditional sports betting outside of Nevada is failing.” \n \nThe AGA reckons that nearly $93 billon in illegal bets will be taken on NFL and college gridiron games this season, with slightly less than $2 billion wagered at legal sports books in Nevada. \n \nAccording to the AGA, Americans made $3.8 billion worth of illicit bets on the Super Bowl alone last season. \n \n“It’s clear that it’s a very popular activity that’s only growing in popularity,” Chris Moyer of the AGA told AFP. “It’s become an American pastime in many regards.” \n \nNevada, best known for the glittering gambling haven of Las Vegas, is currently the only state legally offering a full menu of sports betting, with some limited legalized sports wagering also offered in a handful of other states. \n \nNot surprisingly, other states want to get in on the potentially lucrative action, with New Jersey in the midst of a four-year, multi-million-dollar court battle to allow such betting after residents voted for it in 2011. \n \nNew Jersey Governor Chris Christie’s administration this week filed a motion for the full US Third Circuit Court of Appeals to hear the case, two weeks after a three-judge third circuit court panel ruled against the state. \n \nThe NFL, NBA, NHL and MLB have all opposed New Jersey’s efforts, telling the court the proposed legislation threatens the integrity of their games and violates a 1992 federal ban on sports betting in most states. \n \nBut NBA commissioner Adam Silver has said that the growth of legalized sports betting in the United states is “inevitable” and has called on the US Congress to create a federal law that would allow states to offer sports betting. \n \nThe NBA wants to see a “federal legislative solution that would protect the integrity of the game while allowing those who engage in sports betting to do so in a legal manner,” NBA spokesman Mike Bass said in a statement after New Jersey’s latest court setback. \n \nMoyer said the AGA, through its Illegal Gambling Advisory Board, formed in June, is studying how legal sports betting might best be introduced in the United States and whether federal laws or individual state statues would best govern it. \n \nOfficially, the NFL, baseball and the powerful NCAA that governs big-money collegiate sports remain opposed to wider legalization of sports betting. \n \nBut baseball’s commissioner is open to discussing changing that position, and all the major US sports leagues now have sponsorship deals with “daily fantasy sports” companies that allow fans to wager money on made-up teams they create with players from different real-life teams. \n \nAFP \n \r\n\r \r \r\n\r \r\n\r\n\t\t\t\r\n\r \r\n        \r\n\t\t\r \r\n\r \n\n\r\n\r \r \n\r\n\r \n \n\r\n\r\n\r \r \n [embedded content] \r\n\r \n\r \r \n  \r\n            \r \r\n\r\n\r\n\t\t\r Columns  \nBerto never than late \nED C. TOLENTINO \nBOXER SHORTS \n\nThe art of shutting up \nROMY P. MARIÑAS \nFREE KICK \n\nThe 12th man \nROMY P. MARIÑAS \nFREE KICK \n At a Glance  Padres rout Rockies in MLB Dumoulin storms into Vuelta lead with time-trial win Former Giants player Sash dead at 27 Phelps coach Bowman to lead US men in Rio Gatlin into Bolt’s spotlight, Felix lines up Schippers", "source": "Manila Times"}