{"published": "2015-09-15T20:46:58Z", "media-type": "News", "title": "UAW-Ford VP Jimmy Settles Offers Negotiations Update", "id": "2d799003-488d-473b-80e9-50ca1be87741", "content": "MIL OSI – \n \nSource: US UAW Union – Press Release/Statement: \n \nHeadline: Greetings to all UAW-Ford Members: \n \nThis communication is to provide you – and especially our newer members for whom the bargaining process may be unfamiliar – an update on negotiations and where we are in that process. \n \nTypically, negotiations take place over a period of several months. Our members at each local were asked to participate in a strike authorization vote and overwhelmingly gave the International Union permission to call a strike when necessary. A strike is difficult and always the last resort when negotiations break down. We are not at that point. As you are aware, the current contract expired. We have agreed with the Company to extend the terms of the existing 2011 contract. This is not unusual and commonly occurs when either another company has been identified as the lead, as is the case here, or when a viable end is in sight and bargaining continues to progress. \n \nNumerous subcommittees have been negotiating specific aspects of the contract since July; most have reached tentative agreements. While we continue to meet on outstanding subcommittee issues, larger economic issues remain. \n \nEach round of negotiations presents its own unique challenges. We are determined to negotiate the best possible contract for our members while retaining good American jobs. \n \nWhile Fiat Chrysler Automobiles (FCA US) is setting the pattern by negotiating first, we stand ready and able to complete our negotiations. As UAW President Dennis Williams and Vice President Norwood Jewell continue to bargain with FCA US, it is imperative that we, the UAW-Ford members, stand with our brothers and sisters at FCA US in solidarity and support. Our unity is our strength. \n \nMany entities against us are attempting to skew perception. I ask that you be cautious of the sources from which you receive your information and the material you choose to share. It is imperative that we are not misguided by rumors or misinformation. Again, unity is our strength. \n \nIn the midst of negotiating the future of the American autoworker, solidarity is needed now more than ever. We cannot run at the first sign of trouble, nor jump to conclusions at every speculation. We remain in solidarity with you, our retirees and our brothers and sisters at FCA US and General Motors, and encourage you to do the same. \n \nWe look forward to presenting a tentative agreement for ratification that meets the needs of our entire membership. \n \nIn Solidarity, \n \nJimmy Settles \nVice President and Director \nUAW Ford Department \n See the original letter  \n– – \n \n— \n\n\n© Multimedia Investments Ltd Terms of Use/Disclaimer.", "source": "Foreign Affairs.co.nz"}