{"published": "2015-09-08T22:00:00Z", "media-type": "News", "title": "Police Log: Sept. 5, 2015", "id": "87adf2d7-c3f5-433a-87fc-855558a6b2d1", "content": "Sept. 5 \n\nBrandon A. Archuleta, 25, of Elko was arrested at 440 Grant St. for resisting a public official. Bail: $1,140 \n\n------ \n\nKarl G. Armstrong, 52, of Elko was arrested on Eagleview Drive for drawing a deadly weapon in a threatening manner, three counts of discharging a gun in or on a public thoroughfare or interstate, and on a mental health hold. Bail: $5,911 \n\n  ------ \n\nCarlos F. Castro-Benitez, 28, of Deeth was arrested at the intersection of Fifth Street and Wilson Avenue for DUI and headlamps not illuminated when required. Bail: $1,255  \n\n------ \n\nJavier Hernandez, 40, of Elko was arrested at the intersection of Eighth and Juniper streets for driving without a driver's license and stopping, standing or parking vehicle on highway. Bail: $230  \n\n------ \n\nAnthony W. Hunt, 34, of Battle Mountain was arrested at Mary's Wash in Carlin for DUI and failure to give appropriate signal when required. Bail: $1,515 \n\n------ \n\nGary L. Jones Jr., 42, of Owhyee was arrested at the Elko County Jail for failure to appear after a misdemeanor crime. No bail listed.   \n\n------ \n\nAugustus E. Kelley, 26, of Spring Creek was arrested at the intersection of Idaho Street and College Avenue for speeding, failure to wear safety belt or shoulder harness, third-offense DUI, use or possession of drug paraphernalia and possession of less than one ounce of marijuana. Bail: $21,594 \n\n------ \n\nAndrew T. Malone, 25, of Elko was arrested at 548 Commercial St. for giving false statement to or obstructing a public official, resisting a public official, and on a mental health hold. Bail: $2,274  \n\n------ \n\nRae Miller, 25, of Spokane Valley, Washington, was arrested at the intersection of Idaho and Oak streets for DUI and speeding. Bail: $1,335 \n \n------ \n\nJose J. Miramontes, 38, of Emmett, Idaho, was arrested at 1385 U.S. Highway 93 in Jackpot for domestic battery and coercion. Bail: $8,137 \n\n------ \n\nArthur L. Steelman III, 24, of Elko was arrested at 2001 Errecart Blvd. for trespassing. Bail: $192 \n\n------ \n\nThomas F. Stevenson, 55, of Kearns, Utah, was arrested at 2065 Idaho St. for contempt of court. Bail: $517 \n\n------ \n\nAshley D. Stone, 19, of Spring Creek was arrested at 282 Spring Creek Parkway for petit larceny. Bail: $1,137 \n\n------ \n\nJohnny J. White, 57, of Kearns, Utah, was arrested at the intersection of State Route 278 and Chestnut Street for DUI and failure to drive properly on divided road. Bail: $1,445", "source": "Elko Daily Free Press"}