{"published": "2015-09-18T13:55:00Z", "media-type": "News", "title": "Caesars Entertainment Corporation Celebrates the Grand Opening of The Harrah's Resort Atlantic City Waterfront Conference Center", "id": "bf934c4d-0bbc-4531-b911-5e63ec6aa041", "content": "SOURCE Caesars Entertainment Corporation\n\nWith bookings through 2019, the Harrah's Waterfront Conference Center brings the meetings business and Atlantic City a new option for business travel\n\nATLANTIC CITY, N.J. \n\nDue to the addition of the conference center, there has been an increase of 90,000 advance room bookings for the upcoming 12 months at Harrah's Resort Atlantic City, compared to 7,000 advance room bookings for the previous 12 months. The 97 confirmed meetings to date include Bradley Caldwell \n\nThe investment in the Harrah's Waterfront Conference Center comes at a time when there is significant demand for meetings facilities in the Northeast and no clear leader to serve the business traveler's needs. The 100,000 square foot state-of-the-art facility is now the largest conference-hotel complex from Baltimore \n\n\"The Waterfront Conference Center demonstrates our commitment to the revitalization of Atlantic City \n\nDesigned by Friedmutter Group and located in Atlantic City's \n\n\"We are excited to introduce Harrah's Resort Atlantic City Waterfront Conference Center as a major player in not only the Northeast, but the national meetings business,\" said Michael Massari \n\nAbout Meetings and Events at Caesars Entertainment Caesars Entertainment offers meeting and event planners one dedicated team, united nationwide, committed to providing the most successful meeting experiences possible. With one call or email, planners have access to 40 properties in 20 unique destinations, with 1.9 million sq. ft. of meeting space and more than 42,000 guest rooms. Mix and match properties and venues within a destination under a single contract and minimum. Enjoy elite perks, rewards and privileges with our Total Rewards Meeting Diamond Program. For more information, please visit www.CaesarsMeansBusiness.com .\n\nAbout Caesars Entertainment Corporation Caesars Entertainment Corporation (CEC) is the world's most diversified casino-entertainment provider and the most geographically diverse U.S. casino-entertainment company. CEC is mainly comprised of the following three entities: the majority owned operating subsidiary Caesars Entertainment Operating Company, wholly owned Caesars Entertainment Resort Properties and Caesars Growth Properties, in which we hold a variable economic interest. Since its beginning in Reno, Nevada \n\nForward-Looking Statements \n\nThis release includes \"forward-looking statements\" intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on current expectations and projections about future events.\n\nInvestors are cautioned that forward-looking statements are not guarantees of future performance or results and involve risks and uncertainties that cannot be predicted or quantified, and, consequently, the actual performance of Caesars may differ materially from those expressed or implied by such forward-looking statements. Such risks and uncertainties include, but are not limited to, the following factors, as well as other factors described from time to time in the Company's reports filed with the Securities and Exchange Commission (including the sections entitled \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" contained therein):\n\nAny forward-looking statements are made pursuant to the Private Securities Litigation Reform Act of 1995 and, as such, speak only as of the date made. Caesars disclaims any obligation to update the forward-looking statements. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date stated or, if no date is stated, as of the date of this press release.\n\nPhoto - http://photos.prnewswire.com/prnh/20150918/267936Photo - http://photos.prnewswire.com/prnh/20150918/267937Photo - http://photos.prnewswire.com/prnh/20150918/267934Photo - http://photos.prnewswire.com/prnh/20150918/267935\n\nLogo - http://photos.prnewswire.com/prnh/20150918/267941LOGO\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/caesars-entertainment-corporation-celebrates-the-grand-opening-of-the-harrahs-resort-atlantic-city-waterfront-conference-center-300145527.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WAFB"}