{"published": "2015-09-09T14:54:03Z", "media-type": "News", "title": "Police chief: Camera footage pays dividends", "id": "7ad8133e-f788-4eaf-82f9-eaf6894db8b4", "content": "Guam Police Department Chief Joe Cruz said that a planned expansion of surveillance capabilities up and down Tumon would help the Guam Police Department in its fight against criminal activity. \n \nCruz said the use of that surveillance equipment in the information age pays dividends in cracking down on crime. As he broached the subject of video surveillance in Tumon while speaking to members of the Rotary Club of Tumon Bay on Tuesday about his plans for GPD, Cruz was asked about body cameras for officers and vehicle cameras in patrol vehicles.  \n\nHe said body and vehicle cameras could become important tools for police use in Guam and spoke of the help that private surveillance footage provides to criminal investigators.  \n\nThe chief said he has directed division heads to look at body cameras for police officers. “I think it’s definitely the way forward for GPD's future and is something the firearms committee is taking a very close look at right now,” Cruz said. \n\nCommittees \n\nAs part of his management structure, Cruz has created five internal committees, of which the firearms committee is one, to look at various issues and needs of the police department. While the firearms committee researches the pros and cons of the use of body cameras, Cruz said he is aware that at least three GPD police officers utilize the device on their own accord. \n\nTwo of the officers assigned to the Dededo Precinct Command and one officer assigned to the Tamuning/Tumon Precinct Command used personal funds to purchase the devices for use while on-duty. “I will tell you that body cams are worth their weight in gold. They pay dividends – to make sure that what's happening is accurately being accounted for. It helps the community and it helps the police officer,” Cruz said. \n\nCruz said he plans to integrate the body cams systemwide, but cost will ultimately be the deciding factor. \"Upfront, we are looking to have two to three body cams per shift at every precinct throughout until we can outfit everybody with a body cam,\" Cruz said. “If there are any issues of impropriety, we get the recording, we simply play it back and we settle the issue.” \n\nCruz said that technology in police vehicles would also be looked at. Currently, the chief said only a number of patrol vehicles assigned to the GPD Highway Patrol Division are outfitted with video vehicle cameras. \"As soon as a police officer activates the top lights, his camera starts recording – so if there are any issues that came up during the pull-over or the traffic stop, all that's on the camera.” \n\nThe vehicle cameras for the highway patrol fleet are funded with federal funds awarded through a grant administered by the Office of Highway Safety of the Department of Public Works. \n\nSocial media \n\nCruz also spoke of the recent rash of social media footage that has aided GPD in solving crimes quickly. \n\nHe said GPD is building a library of footage and has linked some criminal activity with the same perpetrator as a result, leading to the successful solving of the crime. \n\n“In the past, we were not able to capture any of this – now we are building a repository with our criminal investigations divisions to be able to identify who some of these individuals (are),” Cruz said. “We have solved a few of the incidents – some of the crimes that have been committed out there.”", "source": "Marianas Variety - Guam"}