{"published": "2015-09-25T16:38:47Z", "media-type": "News", "title": "FIFA boss Blatter facing criminal proceedings", "id": "c3a3224d-bae5-40e3-80f6-0ca74083beaf", "content": "Story highlights Swiss prosecutors open criminal proceedings against Sepp Blatter Blatter's lawyer says \"no mismanagement occurred\" FIFA says it is cooperating with investigation UEFA yet to comment on situation \nA statement released by the Office of the Attorney General (OAG) of Switzerland confirmed it was examining a contract signed by Blatter with the Caribbean Football Union and an alleged \"disloyal payment\" of $2 million to UEFA president Michel Platini. \n\nFormer senior FIFA official Warner was indicted in the wide-ranging bribery scandal, while Platini entered the race to succeed Blatter as FIFA president in July. \n\nThe statement was released after Blatter, who has been in charge of soccer's world governing body since 1998, was interrogated by OAG representatives Friday following a meeting of the FIFA Executive committee in Zurich. \n\nBlatter's lawyer Richard Cullen, said that \"no mismanagement occurred.\" \n\nIn a statement sent to CNN, Cullen said: \"We're confident that when the Swiss authorities have a chance to review the documents and the evidence they will see that the contract was properly prepared and negotiated by the appropriate staff members of FIFA.\" \n\nThe OAG confirmed that it had conducted a search at FIFA headquarters with the help of the police -- including Blatter's office -- and \"data seized.\" \n\n\"The OAG suspects that on 12 September 2005 Mr. Joseph Blatter has signed a contract with the Caribbean Football Union (with Jack Warner as the President at this time); this contract was unfavorable for FIFA,\" said the statement. \n\n\"On the other hand, there is as suspicion that, in the implementation of this agreement, Joseph Blatter also violated his fiduciary duties and acted against the interest of FIFA and/or FIFA Marketing & TV AG. \n\n\"Additionally, Mr. Joseph Blatter is suspected of a disloyal payment of two million Swiss Francs to Michel Platini, President of Union of European Football Association (UEFA), at the expense of FIFA, which was allegedly made for work performed between January 1999 and June 2002 ; this payment was executed in February 2011,\" added the statement. \n\nUEFA was not immediately available for comment after the OAG said that Platini had been \"heard as a person asked to provide information,\" while one of Warner's officials told CNN \"he wouldn't be saying anything.\" \n\nPlatini, who became president of Uefa -- the European governing body in 2007 -- is also a vice-president of FIFA. \n\nThe 60-year-old became a member of FIFA's executive committee in 2002 as well as chairman of the technical development committee and worked on the 2006 World Cup organizing committee . \n\nIn a statement, FIFA said it had been \"cooperating\" and has \"complied with all requests for documents, date and other information.\" \n\nIt added: \"We will continue this level of cooperation throughout the investigation. We will have no further comment on the matter as it is an active investigation.\" \n\nThe incident comes eight days after Secretary General Jerome Valcke was suspended by FIFA, while the organization investigates allegations he participated in a scheme to profit off the sale of World Cup tickets on the black market. \n\nValcke has been relieved of his duties until further notice. \n\nFIFA was plunged into crisis in late May when seven officials were charged for racketeering, wire fraud and money laundering by the FBI. \n\nThe charges are part of a U.S. prosecution that indicted a total of 14 people from around the globe. \n\nMeanwhile, a separate probe by Swiss authorities is investigating potential corruption into the bidding process for both the 2018 and 2022 World Cups , which will be hosted by Russia and Qatar. \n\nQatar's controversial bid for the latter was backed by Platini, and the tournament has since been switched from the emirate's summer months to the winter following concerns over unsafe temperatures. \n\nPlatini, South Korea billionaire Chung Mong-Joon, Jordan's Prince Ali bin Al-Hussein, ex-Brazil player Zico and Liberian FA chairman Musa Bility have all announced their intention to run for president. \n\nTo stand in the February 2016 presidential election, candidates will need letters of support from at least five FIFA member nations. \nU.S investigation \nMeanwhile, a U.S. law enforcement official says the U.S. Justice Department is coordinating and sharing information with the OAG on the ongoing FIFA investigation. \n\nBlatter is among the senior FIFA officials who remain under investigation, U.S. law enforcement officials told CNN. \n\nThe importance of the Swiss investigation against Blatter is that while the FBI has been focusing on his possible role in FIFA corruption, there are limits to U.S. jurisdiction. \n\nU.S. prosecutors have claimed jurisdiction based on the fact financial transactions that are part of the alleged bribery schemes used U.S. banks or occurred in the U.S. \n\nThe U.S. investigators have had some trouble directly linking Blatter to those U.S. transactions, according to a U.S. official familiar with the investigation. Swiss investigators may have an easier time making those links, if they exist, since Blatter is based there. \n\nRead: Who will replace Blatter?", "source": "CNN"}