{"published": "2015-09-13T05:34:57Z", "media-type": "News", "title": "Over 19,600 Buyers Join Hong Kong Watch & Clock Fair", "id": "c02fb241-102a-435b-83cc-0c4b18c39580", "content": "HKTDC Survey: Industry Cautiously Optimistic on Market Prospects \n\n HONG KONG, Sept 13, 2015 - (ACN Newswire) - The 34th edition of the Hong Kong Watch & Clock Fair ended its five-day run (8-12 September) at the Hong Kong Convention and Exhibition Centre yesterday. The fair, which is the largest marketplace in the world for the timepiece industry, welcomed more than 19,600 buyers, up two per cent over the previous year. \n\nWatch the fair video here: https://youtu.be/ZkDkZ3v9zoo \n\nOrganised by the Hong Kong Trade Development Council (HKTDC), Hong Kong Watch Manufacturers Association Ltd and The Federation of Hong Kong Watch Trades and Industries Ltd., the fair saw encouraging growth in buyer numbers from several major markets including Italy, France, Australia, Korea, India, Vietnam and Iran. \n\nSwiss exhibitor numbers double \n\nTo cater to the booming Asian demand for quality Swiss watches, the HKTDC introduced two new Swiss pavilions at the fair's Salon de TE; the Swiss Eminence pavilion, which brought seven prestigious Swiss brands and the Swiss Independent Watchmaking Pavilion (SIWP), which grouped seven independent watchmaking brands. The number of participating Swiss brands at this year's Watch & Clock Fair doubled compared to 2014, with more than 40 brands. \n\nSIWP representative and CEO of Pilo & Co. Amarildo Pilo, said the Hong Kong Watch & Clock Fair and Salon de TE are important trading platforms for the industry. He said he had met many Swiss brand owners visiting the fair as buyers, even if their companies were not exhibiting at the event. This demonstrates the high regard that Swiss watch traders have for Hong Kong's increasing importance for sourcing and marketing. Mr Pilo hoped to leverage the SIWP to introduce Swiss watchmaking to more international buyers. He said he had found more than 10 potential Asia-Pacific distributors for the two brands - Pilo & Co. and David Van Heim, including companies from the Chinese mainland, Hong Kong, Indonesia, Japan, Singapore and Thailand. \n\nHong Kong companies pushing ahead \n\n\"Hong Kong Watch & Clock Fair provides an ideal platform for the industry to network and conduct business. Although Hong Kong's watch and clock industry has to battle rising rents and operating costs, it has been able to push ahead using its versatility and creativity,\" said HKTDC Deputy Executive Director, Benjamin Chau. \"The mid-range affordable luxury products Hong Kong has launched, the smart watches and accessories it developed and the e-tailing channels it opened, have attracted global attention. Although the effects of the debt crisis still loom in Europe, the United States is steadily recovering, and we believe the outlook for Hong Kong's watch and clock industry remains steady.\" \n\nHong Kong independent watch brand ANPASSA showcased its latest watch series at Salon de TE for the second year in a row. Among the brand's offerings was the wedding watch collection, which is made from pure gold and is a combination of the traditional wedding bracelet and the modern watch. The bracelet and watch can be worn as a single unit on a wedding day or as individual units for different occasions. Gary Ching, ANPASSA's founder, said his brand is dedicated to producing custom-made watches for their clients. He said about 80 per cent of their watches are exquisitely crafted tourbillons. The company sold over 200 pieces of tourbillons at the fair last year. This year, Mr Ching hoped to leverage the fair to let global buyers know that Hong Kong too has an independent watch brand. He said many overseas buyers had enquired about the wedding watch collection and he expected good sales to follow. \n\nIndustry players eye the Asia-Pacific market \n\nAsia-Pacific consumers are becoming increasingly savvy about quality watch brands, and the European watch and clock industry - long revered for its design and craftsmanship - used the Watch & Clock Fair as a platform to develop the Asia-Pacific markets. First-time Danish exhibitor Copenhagen Watch Group owns two well-known Danish watch brands; Arne Jacobsen and Picto. The company joined the fair to find new distributors in markets they have not yet covered. Peter Henriksen, Copenhagen Watch Group CEO, said his company had met with buyers and distributors from Australia, the Chinese mainland and Singapore, and would be confirming the partnerships after further discussions. \n\nCatherine Chan, General Manager of Comtech Watches Company Limited, said the company expected to further expand its market through the fair. The company has successfully established contact with potential buyers from Korea, Japan, India, Myanmar and Russia. \n\nGlobal Buyers place on-site orders \n\nDuring the fair, the HKTDC organised close to 80 buying missions with nearly 4,200 buyers from around the world. Among them were many quality global buyers, such as US' Jorg Gray Timepiece, Switzerland's Swatch AG, Italy's Hausmann & Co., Germany's Junghans, Korea's LG Electronics and Japan's Neuve A. \n\nJames Schaefer, representative of US buyer Jorg Gray Timepieces, indicated that the company's sales network spans the US, Canada, Europe, Japan and the Chinese mainland. He had identified three suppliers and said the company would buy US$100,000 worth of mechanical watches, quartz watches and automatic watches. \n\nGerman buyer Unique Time had already placed orders with its existing suppliers after spending a few days in Hong Kong. Parham Shaghafi, the company's CEO, said he was going to place orders worth US$150,000 with a few existing suppliers for alloy watches, stainless steel basic watches and stainless steel mechanical watches. He expected total orders placed at the fair would reach US$350,000, which represented about 10 per cent of their annual buying budget. \n\nABISTE Corporation has 170 fashion outlets in Japan and its General Manager Naoko Gakuhari said they had met with 10 new suppliers and would place an order of US$200,000 of ladies' watches at the fair. \n\nIndustry optimistic about the market in 2016 \n\nTo understand the visitors' views on such issues as market outlook, sourcing patterns, market and product trends and e-tailing, the HKTDC commissioned an independent research agency to conduct surveys on-site. The agency interviewed more than 1,100 buyers and exhibitors during the first three days of the fair. \n\nThe surveys found that 40 per cent of buyers and close to 70 per cent of exhibitors anticipate the sourcing price or production/sourcing cost would increase next year. The majority of buyers and exhibitors are cautiously optimistic about the market situation in the coming year. \n\nOver 80 per cent of respondents expect the volume of products sold via Hong Kong to either remain the same or increase next year. Half of the buyers are currently sourcing from Hong Kong suppliers and 60 per cent said they would increase the sourcing volume in the next three years. The surveys also found that both buyers and exhibitors consider traditional markets such as Western Europe, North America, and emerging markets such as the Chinese mainland and ASEAN countries to be the major growth markets for the timepiece industry in the coming year. \n\nIn terms of product and market trends, both buyers and exhibitors surveyed expect smart watches and quartz analogue watches to be the most popular categories in the coming year. Meanwhile, smart watches, fashion watches and leisure watches are expected to have the highest market potential. With product development strategies, most respondents consider watches with smart devices, seasonal trend collections and limited edition collections to be the top three sectors. Over 70 per cent of buyers were satisfied or very satisfied with the quality of watches from Hong Kong. Exhibitors generally considered quality, durability and functionality to be the top three attributes of Hong Kong's timepieces. \n\nRegarding e-tailing, the surveys found that e-tailing accounted for over 20 per cent of the timepiece industry's total business. The respondents expect e-tailing to grow steadily by over 10 per cent in the next two years, and fashion watches, leisure watches and sports watches would lead the products sold through this channel. \n\nThe surveys also sought to understand the buyers' sourcing pattern and promotion channels. They found that most respondents consider trade fairs a major channel to contact new buyers and suppliers. In terms of sourcing pattern, buyers said they would now shorten the delivery lead-time, maintain a low stock level and place small orders. Some 60 per cent of respondents said they would place orders for 300 pieces or less. In terms of sourcing frequency, 40 per cent of buyers said they would place orders once every quarter. To cater to this sourcing pattern, the HKTDC set up an hktdc.com Small Orders display at the Watch & Clock Fair to feature more than 170 showcases offering products with minimum orders ranging from five to 1,000 pieces. The display attracted more than 7,000 buyers and generated around 12,000 business enquiries during the fair. \n\nWinning entries of the 32nd Hong Kong Watch & Clock Design Competition http://bit.ly/1XagAdX \n\nFair Website http://www.hktdc.com/fair/hkwatchfair-en/ \n\nPhoto Download: http://bit.ly/1FEPQY7 \n\nAbout HKTDC \n\nA statutory body established in 1966, the Hong Kong Trade Development Council (HKTDC) is the international marketing arm for Hong Kong-based traders, manufacturers and service providers. With more than 40 global offices, including 13 on the Chinese mainland, the HKTDC promotes Hong Kong as a platform for doing business with China and throughout Asia. The HKTDC also organises trade fairs and business missions to provide companies, particularly SMEs, with business opportunities on the mainland and in overseas markets, while providing information via trade publications, research reports and online. For more information, please visit: www.hktdc.com . Follow us on Google+, Twitter @hktdc, LinkedIn. \n\nGoogle+: http://plus.google.com/+hktdc \nTwitter: http://www.twitter.com/hktdc \nLinkedIn: http://www.linkedin.com/company/hong-kong-trade-development-council  \n\nSource: HKTDC \n\nContact: \nHKTDC\nCommunication and Public Affairs Department\nJoe Kainz\nTel: +852 2584 4216\nEmail: [email protected]", "source": "Ulitzer"}