{"published": "2015-09-23T15:33:15Z", "media-type": "News", "title": "Food Detective: Get a taste of Greek Festival with chicken and pilaf", "id": "76920ef4-9471-46f4-a38e-f0e3e4cad6fa", "content": "FOOD DETECTIVE: Getting recipes for your favorite dishes from area restaurants \n \nTo say that Birminghamians harbor an insatiable appetite for Greek food would be an understatement. Consider this: during the upcoming three-day Greek Festival diners will scoff down some 12,000 pieces of chicken, 9,000 grape leaves, 5,000 pounds of Greek rice, 22,000 pieces of baklava and 12,000 servings of Greek lasagna (pastichio). Wow! That's a whole lot of eating! \n\nHosted by members of Holy Trinity-Holy Cross Greek Orthodox Cathedral Church, the festival has been described as \"an act of love of Birmingham's Greek community going back to four generations.\" \n \nThe love will be well received when some 20,000 people turn out to hear Greek music, witness Greek dance performances and savor tempting Greek dishes prepared from recipes handed down for generations. \n \nChefs for the year's event have graciously shared their recipe for Greek chicken which has been served since the beginning 43 years ago. \n Greek chicken with Greek pilaf is the most popular entree served at the Greek Festival. (courtesy)    \n\"The Greek chicken is one of the most popular items on the menu,\" according to Kitchen Chairman Pete Graphos Sr. \n\nServed with rice pilaf, Greek salad and a roll, the Greek chicken plate sells for $11. While items are sold a la carte, many prefer the Deluxe Plate ($17) that includes Greek chicken, pastichio, rice pilaf, spanakopita, tiropita, Greek salad and a roll. \n \nSlated for Oct. 1-3 (10:30 a.m.-10 p.m. daily), the admission-free event is hosted at the church which is one of the nation's oldest Greek Orthodox parishes. Don't miss the chance during the festival to take a guided tour of the church (that dates to 1906) and see first-hand its stunning architecture. Also, don't miss the Greek Market Place which has such imported items as food, icons, fine jewelry and art. \n \nDuring the festival, you'll find free parking at the former Liberty National building on Third Avenue and 20th Street South. Drive-through and take-out are available for orders of 10 or more by calling 205-716-3086 or faxing 205-716-3085. \n \nGREEK FESTIVAL'S GREEK CHICKEN WITH GREEK PILAF \n \n(Serves 6 to 8) \n \nINGREDIENTS \n \n2 1/2 pound fryer, cut up \nJuice of 2 lemons \n2 sticks butter, melted \n2 teaspoons oregano \nSalt and pepper to taste \n1 cup water \n \nClean chicken and place in baking pan. Combine lemon juice, melted butter, oregano, salt and pepper. Brush mixture inside and out onto chicken. Pour remaining mixture and water into pan. Bake in 350 degrees for one hour, basting frequently. \n \nGREEK PILAF \n \nINGREDIENTS \n \n1/2 cup butter \n2 cups long grain rice \n1 quart hot chicken broth \nsalt and pepper to taste \n \nMelt butter in heavy skillet and sauté rice, stirring for 5 minutes or until brown. Add broth, salt and pepper. Cover and simmer, without stirring, until all liquid has been absorbed. \n \n Is there some special dish that you've tasted in a Birmingham-area restaurant that you'd like to try to duplicate? Email your request to  LGFullman@aol.com . Follow Lynn on Twitter @lynnfullman.", "source": "Birmingham News"}