{"published": "2015-09-23T05:00:00Z", "media-type": "News", "title": "Seeking Fresh Perspectives to Shape the Future of Food", "id": "a81b937b-bc62-4208-adde-cf56cc817e32", "content": "(StatePoint) No matter if you live in a suburban, urban or rural area, new farming innovations are putting food on your plate, clothes on your back and fuel in your tanks. And whether or not you’re a foodie, a gardener or a large scale grower, you’re benefiting from visionary leaders across the country who are changing the way we grow our food, fuel and fiber. \n  \nIn a constantly evolving economy, America’s farmers, ranchers and rural leaders face what experts call a daunting task: growing the food an expanding urban population needs and making sure that they’re able to continue doing so. \n \n“The future success of the agricultural industry relies on innovative leadership,” says Leigh Picchetti, senior vice president of national communications for the Farm Credit Council, which represents the nationwide network of Farm Credit lenders that provide financial services and loans to rural communities and agriculture. \n \nTo recognize those in the industry who are changing the future of rural enterprise and agriculture, and to celebrate its 100th Anniversary, Farm Credit has launched Farm Credit 100 Fresh Perspectives , a nationwide initiative to honor 100 leaders and innovators from across the country whose insights and influence are ensuring thriving rural communities for years to come. \n \n“This is a national search, and we’ve already received nominations from 40 states representing both urban leaders like chefs and academicians and rural producers farming the land,” says Picchetti. “We know there are additional worthy leaders out there and we’re hoping to receive many more nominations.” \n \nIndividuals, couples and groups are eligible for nomination in 10 categories. Ten of the 100 honorees will receive a $10,000 award to help further their leadership contributions, along with a trip for themselves and a guest to Washington, D.C., in 2016 to participate in a special recognition event. \n \nA panel of experts will evaluate the nominations, which can be submitted by anyone and are being accepted now through December 18, 2015. Winners will be announced in March 2016 in conjunction with National Ag Day. \n \nFarm Credit 100 Fresh Perspectives categories include: \n \n• Rural and Urban Connection \n \n• Mentoring and Volunteerism \n \n• Agriculture Education and Community Impact \n \n• Rural Policy Influence \n \n• Leadership (over 21) \n \n• Youth Leadership (21 and younger) \n \n• Beginning Farmer or Rancher Achievement \n \n• Entrepreneurship and Innovation  \n \n• Sustainability and Natural Resource Conservation \n \n• Financial Stewardship \n \nTo learn more or make a nomination, visit www.FarmCredit100.com . \n \nThe agricultural industry, perhaps more than any other, must constantly evolve in order to keep pace with a changing world. Consumers can thank top agricultural movers and shakers who are helping the industry stay up-to-date. \n \n***** \n \nPhoto Credit: (c) Scott David Gordon", "source": "High Plains Journal"}