{"published": "2015-09-12T11:00:02Z", "media-type": "News", "title": "Seahawks vs. Rams: What's the Gameplan for Seattle?", "id": "a007ca37-8ffa-4624-9b29-7094e5359d1c", "content": "Don't think the Seattle Seahawks weren't watching.  \n \nThey saw the Super Bowl XLIX banner unfurl. They saw the 60,000-plus  New England zealots worshiping in the House of Brady. They saw the Steelers do what they had done: lose.  \n \nThe Patriots began their path back to the Super Bowl the way Seattle hopes to begin theirs—with a victory. \n \nTo do so, the Seahawks will have to go through the Rams , and they'll have to do so on the road, in the Edward Jones Dome, a monolith which has treated Seattle poorly in recent years. \n \nThe Seahawks have come out the loser in three of their last five trips to St. Louis, notably falling in Week 7 last year, 28-26. \n \nRecords never seem to matter when these divisional foes meet, so seasonal expectations should be thrown out accordingly.  \n \nForget another NFC title. Forget another trip to the Super Bowl.  \n \nThis is about getting to 1-0, and this is how Seattle's going to do it.  \n Offensive Gameplan     Stephen Brashear/Associated Press    \nOf all the teams a reconfigured, unproven offensive line could debut against, St. Louis is the worst. And the best. \n \nThe Rams possess one of, if not the most, lethal front four in the NFL . \n \nChris Long and Robert Quinn on the edges. Aaron Donald and Michael Brockers inside. Nick Fairley—2010 SEC Defensive Player of the Year; No. 13 pick in the 2011 NFL draft—on the sideline, rotating in and out according to defensive coordinator Gregg Williams' scheme. \n \nAnd his scheme is  always hyper-aggressive.  \n \nThis is a defense that blitzes nearly as much as it breathes. \n \nThe offense is ultimately left to pick its poison. Who do you double? Can you double? Can the man in the backfield pick the extra man up? \n \nYou want Quinn on the outside: \n \nRobert Quinn doing Robert Quinn things... #SEAvsSTL  #rams  https://t.co/uRhgbyqr7t \n— Dan Doelling (@daniel_doelling) October 19, 2014  \nHow about Long: \n  [embedded content]   \nOr 2014 Defensive Rookie of the Year Donald: \n \nAaron Donald records yet another sack despite being held. Video here: https://t.co/PhzIIzstTz (h/t @Daniel_Doelling ) \n— Andrew Stern (@Andrew_Stern94) November 2, 2014  \nAnd maybe you stop them all, perfectly halt them in their tracks. Fantastic. But then linebacker James Laurinaitis busts through and it's all for naught. \n\n \nCan center  Drew Nowak—a converted defensive lineman—and left tackle Garry Gilliam—a former college tight end—really stop men like that all game? \n \nIf they can, it won't be for long. \n \nSt. Louis  blitzed on 45.3 percent of all opponent dropbacks last season, the highest rate in the NFL, per   Pro Football Focus . Their abundance of blitzes wasn't the most efficient—St. Louis ranked just 20th in pass rushing productivity, per  Pro Football Focus —but remember, Long played just six games. \n \nThe addition of Fairley coupled with another year under Williams' tutelage should only make this rushing rapid more difficult for the dam to hold.  \n \nSeattle needs to utilize quick, short passes against this menacing pass rush and plan to take advantage of blitzes when they come. And oh, will they come. \n \nThat means rookie Tyler Locket and Doug Baldwin could be in for a lot of action if Wilson's looking to rid himself of the ball quickly, while new weapon Jimmy Graham should be utilized heavily in the end zone and as a favorite play-action pass target. \n \nWilson already excels at the play-action, and with Graham's massive frame providing a target across the field, he could become even more adept. \n \nOh, and I think this time, when Seattle gets near the goal line, they'll remember to feed the Beast. \n Defensive Gameplan     Charlie Riedel/Associated Press    \nSeattle is almost an inverse of St. Louis in that, though the Seahawks rarely rely on belligerent blitzing, their forays into sending extra rushers tend to end in success. \n \nSeattle blitzed on 23.3 percent of opponent dropbacks last season, 24th in the NFL, but they were the second-most productive pass rushing unit when sending the blitz, per  Pro Football Focus . \n \nGoing against an offensive line featuring rookies Jamon Brown and Rob Havenstein and a fifth-year center with five career starts in Tim Barnes, defensive coordinator Kris Richard might be wrestling with the thought of relying a bit more on the blitz. \n \nHavenstein is a skyscraper (6'7\", 321-pounds), but he moves like one too. How is he going to contend with Michael Bennett and Frank Clark, two mobile, formidable ends capable of some truly fearsome feats: \n \nFrank Clark with the strip, Jordan Hill with the recovery for the touchdown http://t.co/FXkFMvh711 \n— Who is Jose Rivera? (@whoisjoserivera) September 4, 2015  \nHere's @TheRealFrankC_ showing absolutely no regard for human life: http://t.co/03KqSa70XA \n— Nicholas Shoemaker (@WeightRoomShoe) September 4, 2015  \nAnd Rams quarterback Nick Foles isn't exactly known for being fleet of foot. \n \nThis isn't the Legion of Boom of old, though.  \n \nKam Chancellor remains a spectator, with Dion Bailey making his first career NFL start at strong safety instead. Earl Thomas will be in a shoulder harness, per  The News Tribune 's  Gregg Bell . Cary Williams did enough in the preseason to ensure that his job  isn't  completely secure.  \n \nStill, this Rams team isn't one to air it out, and their core receiving weapons—Jared Cook, Brian Quick, Tavon Austin , Kenny Britt—are largely uninspiring. \n \nSeattle bringing pressure should be enough to lure Foles into making some mistakes, and the Seahawks won't have to worry too much about any of hits receivers making them pay for any miscues.  \n Key Players and Matchups  Russell Okung vs. Robert Quinn     Tom Gannam/Associated Press    \nA 6'5\", 310-pound left tackle that can rep a 225 pounds 38 times versus a 6'4\", 264-pound right end with a 4.60 40-yard dash. \n \nIt seems like they're being ripped from Greek mythology, but in the modern NFL, these are the men that man the lines. \n \nQuinn has 40 sacks over the past 3 seasons. Okung allowed just 22 total quarterback pressures in 462 passing plays last season, meaning he lost his battle just 0.04 percent of the time, per  Pro Football Focus . \n \nBut Quinn isn't always conventional in his business, so Okung and his fellow linemen will need to be on high alert for all types of movements. \n  [embedded content]   \nIn a game filled with crucial battles on the line, this may be the most fun to watch, the clash of titans which ultimately decides the outcome of the game. \n Tyler Lockett  \n. @TDLockett12 hits speed boost. (again) @TDLockett12 hits the endzone. (again)\n\nThat dance though... #OAKvsSEA  http://t.co/Duu595DTyL \n— NFL (@NFL) September 4, 2015  \nAfter an exhilarating preseason, the Lockett Rocket is ready for liftoff. \n \nThe rookie out of Kansas State is, simply, a playmaker. \n \nHis feats this preseason were well-documented and well-appreciated: \n \nPete Carroll knows what he has in Lockett, and he plans in getting the rook as many looks in as many places as possible. \n \n\"Really, we haven’t seen anything from him where we need to restrict him and not put him outside or match him up in certain ways,\" Carroll said, per ESPN's  Sheil Kapadia . \"We really like him all around, and he’s still developing with us. He’s still in a big process of developing the things that we can count on from him and learning him and all of that. But right now, we’re not restricting him anywhere. He’ll play in all spots in this game.\" \n \nHe's pegged as more of a slot receiver, but he's already proven how dangerous he can be outside. Carroll could employ some bubble screens or even end-arounds, given how quick and deceptive Lockett is when his eye catches even the slightest sliver of open turf.  \n \nOh, yeah, and he's already one of the most exciting return men in the league, and he hasn't even played a regular season game yet. \n  [embedded content]   \nGood things tend to happen when the ball falls in Lockett's hands. Expect Seattle to try and make that happen as much as possible this game. \n Tavon Austin  \nAustin occupies a strange NFL nether region when it comes to game planning.  \n \nHis production in the league has been lackluster, but his ability makes him as fearsome as ever, a name defensive coordinators circle and dream about. \n \nHis highlights? Football equivalent of an And1 mixtape. RT @NFL : C'mon, @Tayaustin01 . Chill. #KCvsSTL (go to :06) http://t.co/pjUya03sDB \n— Rand Getlin (@Rand_Getlin) September 4, 2015  \nHis  athleticism  and  4.34 40-yard-dash  ability hasn't abandoned him. It's still there, buried beneath the Rams' inability to figure out how to properly use their weapon. \n \nNewly promoted offensive coordinator  Frank Cignetti Jr. will look to utilize Austin's undeniable talent in open space by putting him in motion often. Austin is dangerous in the screen game and as a shifty runner out of the backfield, and it's likely St. Louis has several boom-or-bust plays drawn up for the Mountaineer. \n \nAustin has averaged just 5.7 yards per game in his career against Seattle, but Seattle must be wary. With Austin, any play could be the big play. \n Dion Bailey  \nDion Bailey is stepping into shoes he can't possibly fill, but he has no choice, because the sports world's  next-man-up  mantra means he'll have to. \n \nThe former USC Trojan's first regular-season NFL start will double as his first regular-season NFL game after the undrafted rookie spent 2014 on the practice squad.  \n \n. @dbailey_18 is legit. Natural hitter/tackler. Sees handoff, dips around blocker, hard hit on RB for no gain. https://t.co/IXF907AILg \n— HawksChronicle (@HawksChronicle) August 30, 2015  \nDespite his inexperience and unexpected promotion, Carroll has expressed the utmost confidence in Bailey. \n \n\"We feel very comfortable that he understands the principles and the fits and all the things he has to do,\" Carroll said Wednesday, per Seahawks.com . \"He’s a playmaker, and he’s a very aggressive tackler, so we’re going to count on him to do the things he does well, and hopefully fit him in with this group. We’re moving; we’re ready to go. We’ve had a long time getting ready with him, so we feel comfortable with that.” \n \nRichard on @dbailey_18 playing safety: \"He wouldn't be out there if we didn't think he could make an impact.\" #SEAvsSTL  #Kickoff2015 \n— Seattle Seahawks (@Seahawks) September 10, 2015  \nThe Seahawks will have DeShawn Shead, spelling Bailey from time to time, but the majority of the snaps will belong to Carroll's handpicked starter. \n \nFoles should look to attack the unproven Bailey as much as possible, utilizing the speed of Austin in a way that puts the 23-year-old in a position to either prevent or conceded the big play.  \n \nWhatever they throw out, he plans to be prepared. \n \n“I hope they plan to come at me,” he said. “It’ll make my coming-out party a lot more exciting. The more opportunities to make plays, the more plays I’ll make.\" \n Prediction  \nThere won't be a shootout in the Edward Jones Dome. \n \nThis is grit n' grind. This is trench warfare. This is divisional hospitality; that is, there's nothing hospitable about it. \n \nSeattle is accustomed to a harsh atmosphere in St. Louis, and this game will be no different. \n \nThis game hinges entirely on the success or failure of each team's respective offensive lines, two lines featuring turnover and uncertainty and, perhaps, a bit of nerves. \n \nThat's not a swell proposition for either when facing one of the NFL's most fearsome defensive fronts. \n \nNowak and Britt will have their hands full with Aaron Donald, who posted a sack in each game against the 'Hawks last season. Britt has roughly five inches and 30 pounds on Donald, but the athletic defensive tackle is slithery and strong and disruptive:  \n \nThe Rams' two offensive line rookies, Brown and Havenstein, will have to contend with Bennett, Clark, Avril, Brandon Mebane and coach Richard's perpetually fluctuating defensive looks. \n \nSt. Louis' secondary isn't nearly as intimidating or reliable its front, which should allow Wilson to find Jimmy Graham early and often in his Seahawks debut. \n \nWill outside linebacker Alec Ogletree—who allowed quarterbacks to complete 82.1 percent of ball thrown into his coverage, per  Pro Football Focus — be able to stop him in flat? History has shown us the answer to that will be an unpleasant one for Rams' fans. \n \nAnd Wilson, who rushed for 107 yards in the defeat last season, has proven he has the ability to carve up the Rams defense on the ground should he need to take off. His legs could prove up saving his life on more occasions than one in this contest, and it wouldn't be surprising to see Wilson top 70 rushing yards. \n \nIt's going to be a defensive struggle early, and one team will likely make a spectacular defensive or special teams play—pencil in Lockett for an awe-inspiring return or two—to bust the game open.  \n \nIf it comes down to a game of field goals and field position you'd be hard-pressed to find a better tandem than punter Jon Ryan and kicker Steven Hauschka. Ryan is one of the best in the business at pinning opponents, and Hauschka nailed a game-winning 60-yard field goal in preseason. If Lockett's hype train stays on the tracks, this could be a unit that truly is  special  in nature, not just name. \n\n \nIt will be a far more contentious game than some prognosticators believe, but St. Louis simply doesn't have the offensive fire power or ingenuity to score enough against Seattle, despite a Legion of Boom that isn't fully intact.  \n \nFoles is going to see more Seahawks than he'd ever hope in his backfield. The rush will come fast. It will come hard. It will envelope him, like a black hole, except angrier.  \n \nHe'll be left to tuck and take the hit or release and hope the Seahawks secondary doesn't make him pay with a pick. Either way, it's an unfortunate proposition for Foles in his first game as a Ram. \n \nSeattle's offense will do enough against St. Louis' questionable secondary to get down into the red zone, and when they do, Marshawn Lynch and Graham will deliver in the way we all expect. \n \nThe Rams defense will keep them in it throughout the entirety of the game, though. The aggressive blitzing should provide St. Louis with some strong field position, enough to slowly maneuver down to the red zone. \n \nRunning back Benny Cunningham and Cook seem like the most likely touchdown candidates, but Britt has a knack for the big play and he could bust one. But Foles won't have enough daylight to make strolling down the field a habit. \n \nBoth teams are going to walk away bruised and battered and dog-tired, but only one can walk away with a W: the Seattle Seahawks. \n Game Prediction: Seahawks 23, Rams 14  Offensive Prediction: Russell Wilson rushes for over 65 yards.  Defensive Prediction: Frank Clark registers at least one sack.   Special Teams Prediction: Steven Hauschka nails at least one 55+ FG.  Bonus Prediction: At some point, Tyler Lockett starts trending on Twitter.", "source": "Bleacher Report US"}