{"published": "2015-09-28T00:54:43Z", "media-type": "News", "title": "Jetstar ends A330 operations, moves to all-787 long-haul fleet", "id": "7ed369dd-e9a5-4014-a4c8-39c1c77e9a91", "content": "Airbus A330-200 VH-EBE touches down in Brisbane after operating flight JQ6 from Honolulu. (Daniel Foster) \nJetstar has completed the transition of its long-haul flying to an all-Boeing 787 operation, with its final Airbus A330 service touching down on Friday when VH-EBE operating flight JQ6 from Honolulu to Brisbane landed just before 1700 local time. \n \nIt marks the end of a two-year transition from the A330-200 to the 787-8, following delivery of Jetstar’s first Dreamliner in October 2013 . The A330s have been progressively transferred to parent Qantas as the 787s have entered servcie. \n \nJetstar now has 11 787-8s flying on international routes across the Asia-Pacic, as well as a few domestic services within Australia. The Qantas Group’s low-cost carrier also plans to use the 787 on trans-Tasman services  over summer . \n \nAnd the 787-8 will touch down in Wuhan, China on September 30 when Jetstar begins new twice weekly flights from the Gold Coast in partnership with Chinese conglomerate Wanda Group. \n \nJetstar said on Friday there would be more than 300 Chinese visitors on the inaugural Wuhan-Gold Coast service. \n \n“These new flights from Wuhan will be a boon for local tourism with some 70,000 seats a year on offer between the Gold Coast and one of China’s fastest growing cities,” Jetstar head of commercial for Australia and New Zealand Nigel Fanning said in a statement. \n \n“With a population of more than 10 million, Wuhan is the largest city in central China and it’s a great sign for the Gold Coast that we’re off to such a strong start with flight bookings.” \n Jetstar’s final Airbus A330-200 service lands in Brisbane on September 25. (Daniel Foster)", "source": "Australian Aviation Magazine"}