{"published": "2015-09-09T17:44:37Z", "media-type": "News", "title": "Christchurch class actions could shake up insurance industry", "id": "caa60e28-3fe3-4a6a-b5f8-b42183c8d56f", "content": "Share this story   \nThe ball's in EQC's court over a group action lodged against it by over 100 homeowners. \n \nLawyers delivered a letter on behalf of the group yesterday, who believes the Commission's fallen short of its obligations on earthquake repairs. \n \nThey're seeking three High Court declaratory judgments around the standard of repair offered by EQC. \n \nThe declarations cover EQC's liability when it decides whether to settle by payment, replacement or reinstatement. \n \nMeanwhile a class action's been launched by almost 50 Southern Response customers, claiming they've been offered well below what they're entitled too. \n \nCanterbury University Dean of Law Chris Gallavin said this could be the tipping point for the insurance industry. \n \n\"It might teach EQC, Southern Response, and also the wider insurance sector a lesson or two on how to treat people, in what has been a cataclysmic event, the likes of which was not seen in New Zealand,\" Mr Galvin said. \n \n\"I and many others believe it was mishandled.\" \n \nThe group of over 100 EQC Christchurch customers are hoping their group legal action will be the end of a five year battle.  \n \nGroup chair Warwick Schaffer said they're willing to discuss the issues. \n \n\"The offer has been put forward where if they make a public joint statement on the standards as we think they should be, then there's actually no need to go to court, and we can all sort it out. We're just asking the rules be clarified that we all have to play by.\" \n \nAnthony Harper Lawyers partner Peter Wood is calling for EQC to front up to possible under assessment of damage. \n \n\"If EQC agrees with our analysis, we will publicise that and that will enable people to move forward with confidence. If EQC doesn't agree, we'll apply to the High Court.\" \n \nThe Government's being told there's still time to avoid a court case if it gets involved. \n \nMinister Gerry Brownlee said it's now out of his hands, but Labour’s acting EQC spokesperson Megan Woods says he should be mediating. \n \n\"I didn't see the Minister rushing to act before they filed. We're five years after the first of the earthquakes - the Minister cannot simply continue to sit on his hands.\" \n \nAn EQC spokesperson said it has no comment while it's reviewing the letter.", "source": "Newstalk ZB"}