{"published": "2015-09-28T18:02:13Z", "media-type": "Blog", "title": "TOP U.S. COMPANIES AT WAR WITH CHRIST", "id": "d96df3b3-eecf-4772-a6e9-c0df1e04bdf9", "content": "WND EXCLUSIVE TOP U.S. COMPANIES 'AT WAR WITH RELIGIOUS PEOPLE' Apple, Frito-Lay, Procter & Gamble among many on battlefield In the 1960s, it was all about skin color. Fifty years later, it’s all about “alternative sexual lifestyles.” “What’s basically happened is that those who have conservative moral values and biblical values, they have become the new Ku Klux Klan,” said Michael Brown, an author and talk-radio host. “What’s happened is that gay activism is the new civil-rights movement. This is the new kid on the block that everyone’s standing with.” Among those standing with the “gay” rights movement are numerous businesses. In the 2015 Corporate Equality Index, compiled by the pro-homosexual Human Rights Campaign, a record 366 major businesses earned a perfect score of 100 percent, indicating HRC completely approves of their policies, practices and benefits for LGBT employees. In the first CEI in 2002, only 13 businesses earned a 100 percent score. And HRC claims the criteria have become more stringent over the years. Among the companies that earned a perfect 2015 CEI score were Chevron, Apple, General Motors, General Electric, Ford, AT&T, Hewlett-Packard, UnitedHealth Group and JP Morgan Chase. HRC recognizes businesses that achieve a 100 percent rating as “Best Places to Work for LGBT Equality” and welcomes companies to tout that distinction in their marketing efforts. But for corporate America, it’s not just about appealing to LGBT employees; many are trying to appeal to LGBT customers, as well. Frito-Lay launched a line of rainbow-colored Doritos last week, with proceeds going to support “It Gets Better,” a nonprofit founded by the radical homosexual activist Dan Savage. As of Tuesday, Doritos Rainbows had already sold out. At the same time, GOP presidential candidate Gov. Mike Huckabee was challenging the Frito-Lay board of directors to watch Dan Savage in action and decide whether his lewd and offensive comments fit their corporate image. Paul Kengor, a college professor and author of “Takedown: From Communists to Progressives, How the Left Has Sabotaged Family and Marriage,” believes Frito-Lay fears no backlash from conservative Christians. Instead, the company is afraid of offending gay activists. See “The Big List of ‘gayest’ companies in America,” where support for homosexual, bisexual and transgender causes is a priority. “From a purely marketing standpoint, one would think that corporate America might be concerned about offending traditional Christians,” Kengor said. “But I don’t think that’s so. Christians aren’t relentless and brutal like the liberal forces of ‘tolerance’ and ‘diversity’ who boycott, picket, protest, demonize, dehumanize, fine and even incarcerate those who dare to disagree with their new definitions of marriage, family and sexuality. So corporations are happy to outrage Christians. They won’t dare outrage the forces of ‘tolerance’ and ‘diversity.’” Brown, a WND columnist and author of “Outlasting the Gay Revolution,” said companies now see an advantage in becoming more LGBT-friendly. “This is now the big thing for big business,” he explained. “This is good business: Let’s recognize the giftedness of gays and lesbians, let’s promote them to the highest level, and let us rid ourselves of those that would oppose with their old, bigoted mindsets. “I have been overseas, and in other countries they’ve told me the pressure they are under. I was in Singapore, and business leaders told me they are under pressure from the big companies, the Googles, the Microsofts: ‘If you want to do business with us, then you are going to have to change your policy toward gays and lesbians.’” Tide recently jumped into the “gay marriage” debate with a new TV commercial featuring a “gay” couple on their way to a church for their wedding. A woman stops them at the church steps and exclaims: “How offensive! I won’t let you blemish the sanctity of marriage.” She then whips out a Tide to Go pen and removes a stain from the shirt of one of the men before allowing the couple to proceed. Tide’s parent company, Procter & Gamble, has publicly promoted LGBT rights on its Twitter account. When commercial director Mark Nickelsburg posted the ad to his Facebook page, he referenced embattled Kentucky county clerk Kim Davis, writing: “First a clerk in Kentucky, and now a church lady in Los Angeles! This same sex couple faces yet another obstacle on the way to marriage equality in this spec commercial I directed.” Brown does not see the “gay” rights movement as a simple plea for tolerance. He pointed to Apple CEO Tim Cook, who announced last October that he is “gay.” In his coming-out essay, Cook wrote he was “proud to be gay” and expressed hope that his announcement would “help someone struggling to come to terms with who he or she is, or bring comfort to anyone who feels alone.” But the following March, Cook went a step further by criticizing the religious freedom laws under consideration at the time in Arkansas and Indiana. He called the laws “very dangerous.” “So the CEO of Apple, Tim Cook, now he’s not just out and proud, he is at war with religious people,” Brown said. “We must recognize what’s happening. This is not a matter of ‘live and let live;’ this is a matter of the gay revolution pushing out all opposing views, and big business is helping lead the way.” Read more at http://www.wnd.com/2015/09/top-u-s-companies-at-war-with-religious-people/#citHiOBxuCP4oIZj.99\nMy comments: Homosexuality is Against God and His Word. These Major U.S. Corporations embracing Homosexuality are at WAR with God and His Word--Against Christ, Who tells them that what they do is Evil. (John 7:7)  ", "source": "Called By Christ To Be ONE"}