{"published": "2015-09-03T21:23:50Z", "media-type": "News", "title": "One wrenching photo could help decide Canada’s election", "id": "190a086d-ede2-4ce5-8529-0badfd78abd0", "content": "The international attention a photo of a dead Syrian child has drawn to Syria’s refugee crisis could help decide the Canadian election, political analysts say. \n\n“Visual images like that are extremely powerful,” said Darrell Bricker, CEO of Ipsos Public Affairs. “And people want their governments to deal with wrong. They don’t want their governments to turn a cold shoulder to the tragedies of the world.” \n Story continues below    \n“I think it’s inspired such an emotional response in Canadians that I don’t think it’s something that’s going to be soon forgotten,” said Greg MacEachern, vice-president of government relations for Environics Communications and a former Liberal strategist. \n\n“There is a high level of outrage and a lot of questions.” \n            \n Slide  \n     \nEven though the boy’s aunt did not sponsor that family to settle in Canada, as originally reported – the government rejected an application from other relatives, also fleeing Syria – the issue of Canada’s refugee policy had immediate effects on the campaign trail. \n\nCitizenship and Immigration minister Chris Alexander left his campaign in Ajax, Ontario to fly to Ottawa to look into the particulars of the family’s case early Thursday morning. Conservative Jason Kenney postponed a planned announcement on immigration policy. And Liberal leader Justin Trudeau, NDP leader Tom Mulcair and Conservative leader Stephen Harper all addressed the Syrian refugee crisis at campaign events. \n\nThe government, and Alexander in particular, are on the defensive, MacEachern said, adding that Alexander struck the wrong tone and made factually inaccurate statements in an interview on CBC Wednesday evening. This has coloured the impression people have of the government’s attitude towards refugees, MacEachern said. \n\n“That’s very challenging to try to come back from.” \n\nBut it’s too soon to see what effect this will have on the campaign, Bricker said. It’s a complicated, emotional issue. \n\n“It might prove to have some effect, particularly if there’s facts to come that demonstrate that this government has done something incorrect.” \n\n“There are so many foreign-born Canadians now, particularly in places that are key ridings like the 905, and suburban Calgary and suburban Vancouver. They could be looking at images like this saying, ‘There but the grace of God go I.’” \n\nMacEachern thinks that Canadians are paying attention, and it could affect how they vote. \n\n“Supposedly it’s a political idiom that foreign policy does not matter to the average Canadian, that it’s never an election issue. Well, in politics this is an example of how you should never say never.” \n\n“I don’t think many people would have predicted that our policy on refugees would have become this prominent.” \nHow to respond? \nPoliticians should tread carefully on this issue, MacEachern said. \n\n“There is a high level of awareness of this issue and people are watching very carefully and people don’t want to see anyone of any party use this for political points.” Opposition parties in particular need to be careful of being accused of using a tragedy for political gain, he said. \n\nCanadians want to see leadership from their politicians, he said. \n\n“I see a lot of Canadians on Twitter, on Facebook saying we need to do something. They need someone like our government to say, ‘This is a program you can support. This is a way you can sponsor refugees in your community.’” \n\nBut taking action on such a complicated issue is tough, Bricker said. \n\n“Okay so we’re all appalled, as we rightfully should be, about the images that we’ve seen. What exactly is the solution?” \n\n“Do we get into a bidding war about what would be the right number of refugees to bring into the country?”", "source": "Global News Canada"}