{"published": "2015-09-01T06:47:16Z", "media-type": "Blog", "title": "NSFW: Candice Swanepoel goes nude for Lui Magazine cover story", "id": "faffb0bf-c3e7-4914-b8e1-071d67d2a49a", "content": "Home News/Ent NSFW: Candice Swanepoel goes nude for Lui Magazine cover story\rNews/Ent\rNSFW: Candice Swanepoel goes nude for Lui Magazine cover story\rBy Flavourmag Team - September 1, 2015 SHARE\rFacebook\rTwitter\rtweet Following in the footsteps of Rihanna, Candice Swanepoel has done a nude photo shoot for Lui Magazine’s September 2015 cover story and the images are stunning. The cover story see’s Victoria’s Secret Angel Candice Swanepoel in very sexy VS lingerie looks as the bombshell shows a little bit more than usual in this sexy set of photos. Lui Magazine is a French publication and the photograph’s were captured by Luigi and Iango. Candice Swanepoel flaunts her almost perfect body and her super toned figure in swimwear, fur and an orange see-through coat, similar to the Victoria’s Secret umbrella campaign. Related: Oh no she didn’t, Oh yes she did. Rihanna goes topless and bottomless for Lui Magazine Keep up-to-date with the latest News, Entertainment and Fashion by subscribing to our newsletter - Simply click here\rShop new dresses\rMonochrome Peplum Dress – nude £20.00 BUY NOW\nMonochrome Dresses Lavish Alice Mini Dress with Scallop Lace Up Detail – Black £40.50 BUY NOW\nLittle Black Dress Sale! ‘Zoe’ Red & Black Cut Out Bandage Dress – SALE £99.00 £50.00 BUY NOW\nBandage Dresses ASOS Mini Dress with Soft Drape Pockets – Black £21.00 BUY NOW\nLittle Black Dress Red Monochrome Daisy Printed Smock Dress £12.99 BUY NOW\nMonochrome Dresses ALANNAH – Fuchsia Pencil Dress with Shaped Peplum Detail £137.50 BUY NOW\nForever Unique Favourites TAGSCandice SwanepoelCandice Swanepoel nudelui magazineNSFWRihannavictoria's secretVictoria’s Secret Angel SHARE\rFacebook\rTwitter\rtweet Flavourmag Team\nhttp://www.flavourmag.co.uk\nFlavourmag is your music, movies, fashion, news, entertainment and lifestyle website. Feeding your hunger with the latest breaking news & videos from the entertainment industry.\nRELATED ARTICLESMORE FROM AUTHOR\nRosie, Kate, Candice, Joan, Lily, Anja & Miranda strip for V Magazine NSFW: Rihanna Unleashes BITCH BETTER HAVE MY MONEY #BBHMM Candice Swanepoel rocks Victoria’s Secrets latest lingerie lines Rosie Huntington-Whitley Goes Nude for Lui Magazine Watch Rihanna stunting in Dior’s ‘Secret Garden’ video Rihanna goes glam for Dior’s Secret Garden Ads Stella Maxwell Revealed In Victoria’s Secret 10 New Supermodel Angels Rihanna is all butt, naked in latest V magazine shoot Rihanna shares her sunkissed beach photos from Hawaii INTRODUCING: New UK R&B Singer Raye Talks New Record Deal, Reality TV and Rihanna Comparisons Introducing London based RnB singer-songwriter Ayelle Victoria’s Secret Dream Angels Candice Swanepoel & Romee Strijd", "source": "FLAVOURMAG"}