{"published": "2015-09-24T05:17:36Z", "media-type": "News", "title": "Unidentified woman collapses in Rockhampton CDB last night", "id": "b95b6e84-98b8-4ac4-b61c-1827cb993cfc", "content": "A WOMAN, who had no identification on her, collapsed in the Rockhampton CBD at lunch time today, and police are now appealing to the public to help identify her. \n\nAt about 11.30pm last night, Rockhampton police were alerted to a female who was located collapsed at the intersection of East and Denham Streets. \n\nA review of the Rockhampton City Council CCTV camera network showed the lady walking around the CBD appearing disorientated prior to collapsing on the footpath at the intersection. \n\nThis female was transported to Rockhampton Base Hospital and is currently still unconscious. This unknown female had no identification on her and as such police are seeking assistance in identifying this woman. \n\nShe is described as being Caucasian, about 50-70 years of age with grey hair. \n\nShe was in possession of a set of keys that included a Toyota car key, 3 house keys and a plastic tab containing a photograph of a male in his early 20s. \n\nAnyone with any information as to the identity of this female is asked to contact Policelink on 131 444. Great views, cool breezes and peace & privacy can be enjoyed from the wrap around verandas of this Queensland inspired air-conditioned home. Very open plan living...\n\nWe've saved the best till last. Your chance to own front row beachfront land. Build your dream ........ An investment for life!!! This private estate has direct...\n\nLocated in ever popular Glenella this lowset, rendered 4 Bedroom home represents great value for the modern family. With a large open plan living and dining area...\n\nMagnificent 5 acre blocks of fertile country that are ideal for running a few head or a horse. The boundaries have been surveyed, power will be supplied to the...\n\nThis home is flooded with natural light, gentle breezes flow through and is very open plan. The spacious living area flows to the alfresco dining and lounge, pool...\n\nSet on a 792m2 block this character filled home is at the end of a no through road and has only one side neighbour so you get absolute privacy. The fully air...\n\nAn excellent opportunity exists to live or invest in popular West Mackay, positioned within walking distance to the base hospital, shops, schools and just 4 km's...\n\nLocated a leisurely 30 minute drive from Mackay and within close proximity to major coal ports sits this unit which offers beachside living at its best. Property...\n\nLocated in popular West Mackay this well constructed high set home which was built in the 1970's features three built-in bedrooms, polished timber floors, air...\n\nOn a large 1329 sq. m block near great Schools, shopping and only 7 minutes from Mackay's CBD, this contemporary residence boasts plenty of space for living and...\n\nGet your local news, your way.\n\nUpdate your news preferences and get the latest news delivered to your inbox.", "source": "Whitsunday Times"}