{"published": "2015-09-30T15:35:00Z", "media-type": "News", "title": "Research and Markets: Commercial Automotive Telematics Market 2015-2020 - By Vehicle Type, Components, Services, Subsystems, Geographic Analysis", "id": "d852a04d-4e99-45e5-a21b-1566c738fc32", "content": "Research and Markets ( http://www.researchandmarkets.com/research/dt4zzz/commercial ) \n      has announced the addition of the \"Commercial \n      Automotive Telematics Market (2015-2020);;By Vehicle Type, Components, \n      Services, Subsystems, Geographic Analysis (2015 - 2020)\" report \n      to their offering. \n\nAs a healthy growth has been forecasted for the commercial telematics \n      industry, it has generated a lot of interest in the automotive, \n      tele-communications and information technology segments as companies \n      look to gain a foot-hold in this market Major players in these \n      industries are either investing into the R&D of their own telematics \n      platform or are collaborating with already existing commercial \n      telematics suppliers to produce vehicular telematics systems. \n   \nCurrently some of the major players in this field include automotive \n      bigwigs like BMW, Ford, General Motors, Toyota, Daimler and also tech \n      giants such as Delphi, Robert-Bosch, Continental AG, telematics \n      suppliers including Omnitracs, Trimble Navigation Ltd, Octo Telematics, \n      Masternaut, MiX Telematics as well as telecom companies including \n      Verizon, Deutsche and AT&T. \n\nThe report also highlights the developments taking place in the market \n      such as improvement of security of telematics systems by identifying the \n      ad hoc security communication issues plaguing the market. In order to \n      assist Vehicle to Vehicle (V2V) and Vehicle to Infrastructure (V2I) \n      communication, a Vehicle Link layer standard was introduced. \n\nThis Link Layer enhances the geographical addressing, security of \n      communication and multihop forwarding feature thereby facilitating \n      improved intra vehicular wireless communication. Another key standard \n      introduced is a standard randomized MAC address in order to improve \n      privacy and security of information and the network. The co-operative \n      vehicle infrastructure (CVIS) project has focused on development of \n      standards for the components in a telematics system and various \n      initiatives that drive cooperation, communication, safety and efficiency \n      of vehicles and their movements. These standardizations and other \n      communication and integration platform unifications are analyzed to \n      understand the growth and opportunity prospects of the commercial \n      telematics market. \n\nKey Topics Covered: \n\n1. Commercial Automotive Telematics Overview \n\n2. Executive Summary \n\n3. Commercial Automotive Telematics Landscape \n\n4. Commercial Automotive Telematics - Market Forces \n\n5. Commercial Automotive Telematics Market - Strategic Analysis \n\n6. Commercial Automotive Telematics Market - by Vehicle Type \n\n7. Commercial Automotive Telematics Market - By Components \n\n8. Commercial Automotive Telematics Market - By Services \n\n9. Commercial Automotive Telematics for Remote Vehicle Diagnostics Market \n\n10. Commercial Automotive Telematics Communication and Integration \n      Platform Unification \n\n11. Commercial Automotive Telematics Market -Geographic Analysis \n\n12. Market Entropy \n\n13. Company Profiles \n\n14. Research and Standardization Bodies \n\n15. Appendix \n\nCompanies Mentioned \nActia AGM Telematics Airbiquity Applied Driving Techniques AT&T BMW Bosch Automotive Service Solutions Ltd CMS SupaTrak Continental AG Ctrack Daimler Group Delphi Automotive PLC Denso Corporation Descartes Transport Solutions Deutsche Telekom Ford Motor Company General Motors Honda Motor Company Hyundai Motor Group INIT Intelligent Telematics Magneti Marelli S.p.A. Masternaut Ltd. MiX Telematics Ltd. Octo Telematics Omnitracs LLC Orbcomm Inc. TomTom N.V. Toyota Motor Corp. Traffilog Trakm8 Trimble Navigation Ltd. Verizon Communications Volvo Group WirelessCar AB \nFor more information visit http://www.researchandmarkets.com/research/dt4zzz/commercial \n\n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150930006343/en/", "source": "Fat Pitch Financials"}