{"published": "2015-09-14T17:55:34Z", "media-type": "Blog", "title": "Liverpool Superstar: This Man Utd Wonderkid \"Killed\" Us On Saturday", "id": "f7a9288d-5e00-4e3e-a5fd-9be2712d352c", "content": "Christian Benteke has said that Manchester United’s third goal, scored by Anthony Martial, really killed off Liverpool’s hopes of coming back into the game, as per the club’s official website .  \n \nBenteke made it 2-1 on Saturday afternoon with a fantastic overhead kick that silenced Old Trafford and brought his team right back into the game. \n \nHowever, just minutes later Martial danced through the Liverpool defence and slotted home a fantastic goal on his debut to make the score 3-1. \n \nChristian Benteke’s acrobatic effort is one of the goals of the season so far. \n \nSpeaking to the club’s website, Benteke said that when he scored he felt that the team could come back and win it but the third goal killed those chances off. \n \n“It was a disappointment for us. In the first half, we didn’t play [well], the second half was a little bit better but in general we didn’t deserve a victory.” Benteke said. \n \n“When I scored, I thought in my mind that maybe we could come back, but they scored to make it 3-1 and that killed our hopes. \n \nThe goal was Benteke’s second since joining Liverpool over the summer from Aston Villa and it was a fantastic strike. \n \nThe challenge for the forward will be to try and go on and score 20 goals or more this season which would go some way to justifying the £32.5 million fee (fee via the Guardian ) that they paid for him. \n \nWith Luis Suarez having moved on to Barcelona and Daniel Sturridge suffering a number of injuries it is important that Benteke scores regularly. \n \nIf he doesn’t then it is hard to see how Liverpool are going to be able to challenge for a top four spot. \n \nChristian Benteke has a shot accuracy of 50% so far this season. \n \nThe post Christian Benteke: Martial’s goal “killed” us on Saturday appeared first on Squawka News .", "source": "Squawka News"}