{"published": "2015-09-30T16:38:00Z", "media-type": "News", "title": "2016 'River of the Year' Nominations Now Being Sought", "id": "9e76e034-cbd6-4e07-8fa5-123f62df5564", "content": "HARRISBURG, Pa. , Sept. 30, 2015 /PRNewswire-USNewswire/ -- Pennsylvania nonprofit organizations are invited to nominate waterways for consideration as the \"2016 Pennsylvania River of the Year,\" it was announced today by the Department of Conservation and Natural Resources and Pennsylvania Organization for Watersheds and Rivers. \n\nThe nomination period is open through Oct. 23, 2015 . Selected nominations then will be voted on by the general public beginning in early November. \n   \n\"These nominations demonstrate how so many waterways groups and individual supporters know and respect the many unique natural resources and recreational opportunities our wealth of stream and rivers represent,\" said DCNR Secretary Cindy Adams Dunn . \"They demonstrate just how willing Pennsylvanians are to support, protect and enhance them.\" \n\nFor more information about the River of the Year program or to nominate a river, visit www.pariveroftheyear.org . Nominations must be made by 5 p.m. Friday, Oct. 23 . \n\nAll Pennsylvania Rivers are eligible for nomination, with the exception of winning rivers since 2011. \n\nThe Pennsylvania Organization for Watersheds and Rivers (POWR) administers the River of the Year program with funding from DCNR. Pennsylvania's River of the Year is an honor designed to elevate public awareness of specific rivers and recognize important conservation needs and achievements. River of the Year designations have been presented annually since 1983. \n\nPennsylvania's 2015 River of the Year is the Conewango Creek in northwest Pennsylvania . \n\nOther recent selections: 2014, Schuylkill River; 2013, Monongahela River; 2012, Stonycreek River; 2011, Delaware River; and 2010, Lackawaxen River. \n\n\"Once again, Pennsylvanians get the chance to push for their favorite waterway in friendly competition with others across the Commonwealth,\" said Pennsylvania Environmental Council President Davitt Woodwell . \"With over 83,000 miles of rivers and streams in the state from which to choose, it is always fun to see folks come forward and advocate for their selection.\" \n\nAfter a waterway is chosen, local groups implement a year-round slate of activities and events to celebrate the river, including a paddling trip, or sojourn. The nominating organization of the winning river will receive a $10,000 leadership grant to help fund their River of the Year activities. \n\nThe River of the Year sojourn is just one of many paddling trips supported by DCNR and POWR each year.  An independent program, the Pennsylvania Sojourn Program, is a unique series of a dozen such trips on the state's rivers. These water-based journeys for canoeists, kayakers and others raise awareness of the environmental, recreational, tourism and heritage values of rivers. \n\nTo learn more about the River of the Year program, visit www.pariveroftheyear.org . \n\nMEDIA CONTACT : Terry Brady , 717-7772-9101 \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/2016-river-of-the-year-nominations-now-being-sought-300151749.html \n\nSOURCE  Pennsylvania Department of Conservation and Natural Resources", "source": "SearchBug"}