{"published": "2015-09-12T20:22:40Z", "media-type": "News", "title": "Yesterday Yemen's exiled government says to attend peace talks in Oman", "id": "ff9467d1-8fb0-4e6b-adde-fc6df0291789", "content": "Yemen's government in exile said Friday it has agreed to take part in UN-mediated peace talks next week in Oman aimed at reaching a ceasefire with Shiite Huthi rebels. \n\nHowever, in the absence of an announcement from the rebels, government spokesman Rajih Badi was unsure the rebels would attend. The talks \"may not take place\", he told AFP. \n\nYemen's exiled government of President Abedrabbo Mansour Hadi said in a statement late Thursday that a rebel pullback from areas seized since last year -- as outlined by a UN resolution -- remained a precondition for negotiations. \n\nAt a meeting in Riyadh, Yemeni government officials \"approved their participation in talks aimed at implementing Resolution 2216\", the statement said. \n\nThe UN's special envoy for Yemen, Ismail Ould Cheikh Ahmed, said Thursday that both the government and Huthi rebels had agreed to take part in negotiations that \"will convene in the region next week\". \n\nHadi's government called on Cheikh Ahmed to \"strive for a clear, public commitment from the Huthis\" and allied forces to withdraw from areas they have seized, including the Yemeni capital. \n\nPrevious diplomatic efforts to end Yemen's more than five-month war failed to bear fruit and a Saudi-led coalition backing Hadi has waged daily air strikes against the rebels. \n\nOn Friday, at least 20 people were killed as rebels fired Katyusha rockets at a busy market in the eastern city of Marib, medics and witnesses said. \n\nThe attack came hours after a Saudi-led coalition air strike killed seven rebels in Marib. \n\nAnd powerful explosions rocked Al-Hassaba area of Sanaa, where an arms depot was targeted by coalition warplanes, witnesses said. Medics said at least seven people were killed. \n\nThe UN estimates that more than 4,500 people have been killed in the conflict since March.", "source": "Your Middle East"}