{"published": "2015-09-05T01:30:08Z", "media-type": "News", "title": "San Francisco 49ers' Jarryd Hayne monsters San Diego Chargers cornerback in NFL trial | Videos, photos", "id": "c5fbec8f-a847-44d8-902a-d625bf4b07fb", "content": "By Sept. 5, 2015, 10:40 a.m. exit \nJarryd Hayne's shoulder charge in Thursday night's trial against San Diego has gone viral. \n\nThe official NFL Twitter account posted the video of Hayne's carry, flattening Chargers cornerback Lowell Rose, much to the delight of his pumped up teammates and coaching staff who were right next to Hayne when he sent San Francisco's Levi's Stadium into a frenzy. \n\nThe NFL posted video of Hayne monstering his opposition, saying: \"That's just former Rugby League star @jarrydhayne_1, turning NFL defenders into pancakes. #SDvsSF\". \n\nIt was another impressive night for Hayne in what was his final outing ahead of the September 5 deadline for the 49ers' 53-man roster. \n\nHayne finished San Francisco's leading rusher in the 14-12 win over San Diego with 10 carries for 58 yards and a long gain of 19 yards. Receiving, he made two catches for 17 yards and, punt returning, he averaged 14 yards across three returns. He also made a good punt cover tackle. \n\n\"I'm just trying to get better every game,\" he said in an on-field interview immediately after the game. \"I think tonight it was just about getting low and getting through tackles.\" \n\nAsked about his family attending the game, he said: \"It was great. They're very excited, so it was good to see them in America. It's their first time, so they've very excited.\" \n\nHayne saw limited opportunities in the first half but the Hayne Plane took off in the third quarter with a highlight reel play that makes it almost impossible for San Francisco to leave him out of their final roster. \n\nSan Francisco 49ers chief operating officer Al Guido said: \"It's really impressive ... The best analogy I can give it is that he's like Michael Jordan ... the best in his sport, taking on another sport.\" \n\n\"Jarryd laying that guy out on the 45 was impressive.\" \n\nThe Sydney Morning Herald", "source": "Cessnock Advertiser"}