{"published": "2015-09-04T13:34:06Z", "media-type": "Blog", "title": "Taylor & Francis Group enters agreement to publish Engineers Australia’s 7 technical journals", "id": "a3f3cf6d-bf29-4258-9c57-fb570c3ae63f", "content": "Milton, England – September 4, 2015 — Taylor & Francis Group and Engineers Australia are pleased to announce a new publishing partnership. Taylor & Francis will now publish and distribute Engineers Australia’s seven technical journals. \n \nStephen Durkin, Chief Executive Officer of Engineers Australia said “Engineers Australia’s strong commitment to the delivery of technical content and information to members in a contemporary way is a key element of our vision to be the global home of engineering professionals. Partnering with Taylor & Francis, a market-leading organisation that specialises in technical publishing, is an integral part of our Learned Society and a key element of our vision. We are delighted to be working with Taylor & Francis and look forward to a long and mutually beneficial partnership.” \n \nDr David Green, International Publishing Director for Taylor & Francis, added: “We are delighted to enter a publishing partnership with Engineers Australia from 2015 in the publication of their seven journals. These titles are welcome additions both to our global Engineering program, and our ANZ portfolio of more than 100 journals published on behalf of academic societies and institutions across Australasia.” Richard Delahunty, Editorial Director for T&F’s engineering journals and Sarah Blatchford, Australasian Regional Director for T&F Journals, noted that the T&F teams were very much looking forward to working with Engineers Australia and its editors, to enhance the visibility and discoverability of their journals in the global arena. \n \nThe post Taylor & Francis Group enters agreement to publish Engineers Australia’s 7 technical journals appeared first on Talking New Media .", "source": "Talking New Media"}