{"published": "2015-09-22T20:07:25Z", "media-type": "News", "title": "Why Do Rats Love Pizza?", "id": "dc0084bd-880d-461c-af78-76b7a30caec0", "content": "animalAnimalsbiologycuteEntertainmentfoodfunnynew york citynycnyc pizza ratpizzaPizza ratratSubwayurban centerurban wildlifeviral video \n\nThis article was originally published by popsci.com \n\n. \n\nPizza Rat brings home dinner \n\nAs delicious as NYC pizza is, you probably wouldn’t want to eat it after it’s been dragged down a flight of subway steps. But to Pizza Rat, of viral fame, it’s quite a treat! Pizza Rat claimed international attention earlier this week when Youtube user Matt Little posted a video of the ambitious animal attempting to carry a slice of pizza several times its size down the steps of an L train subway station. \n\nWe wanted to know more: What made this pizza worth the hassle when there is no shortage of smaller, more manageable trash in the subway? Where was Pizza Rat going? And most importantly, is this normal behavior for a rat? \n\n“Rats love pizza,” animal expert Bennet Galef told Popular Science. A former president of the Animal Behavior Society, and author of several books on animal learning, he has studied rat behavior since 1970. “They love fat and sugar, so pizza would be heaven to a rat.” \n\nGalef said Pizza Rat, like many other New Yorkers, was probably just schlepping dinner home at the end of a long night. Wild rats live in complex and sprawling burrow systems. They normally eat far from their burrows, but bring particularly tasty morsels home to store them. In the wild, this would be different kinds of grains, fruits, eggs, and, well, really anything they can get their furry paws on. They are voracious omnivores. In this case, Galef said, “given this is New York, it’s not too surprising it’s pizza.” \n\nNew York subway rats are mostly brown rats, Rattus norvegicus. They will find hidey-holes down on the tracks in the wall where they are out of the way and safe but can still easily come up to the station for food. \n\n“Pizza would be heaven to a rat.” \n\nGalef said it’s not typical behavior for a rat to let a human come as close as Little did, who shot this video in the wee hours of Monday morning. Rats typically avoid human contact. Pizza Rat may have been more used to humans than the average rat, and with an empty belly to bolster its courage. Even so, it abandoned the slice and scampered off with just two steps to go. \n\nAlthough they shy away from humans, their close relationship with us helped rats become one of the most abundant mammals on the planet. “Rats are tremendously successful at exploiting human beings,” Galef said. However unwittingly or unwillingly, we provide them with warmth, food, water and safe places to hide from predators. And pizza. \n\nVideo of New York City rat taking pizza home on the subway", "source": "MauritaniaVox.com"}