{"published": "2015-09-09T17:35:34Z", "media-type": "Blog", "title": "WOYWW #327 {today & before}", "id": "b61a711f-d715-44e8-9e22-baba4ad9750e", "content": "Welcome to the mess/ not so messy view of my table this morning ( and monday's views)  If you have not stopped by on a Wednesday before you can find out more how to play along and see other crafty spaces here where this blog hop starts on our hostess Julia's blog.   So, this is really clean actually. the new dies from last week are in sleeves with magnets. ( I have played with the oval woodland one so far) above that is something I was messing around with during the Christmas cards on dictionary pages phase from last week. piles of dictionary pages not used yet. some punchies from a Tim Holtz sizzix punchie.\n(I think Sizzix makes better dies than punchies if you are curious but, it could be the intricacy of the spring)\nNow this is happy mail from Magenta that arrived on tuesday and I carried it up the stairs with my coffee to shoot these today shots. the little pots are their version of brusho ( powder water colors) I did pick up a few in colors I do not have in brusho's or color burst's) and I am planning on copying Dina's idea and moving the ones in these style tubs to little bottles with dispenser tops (similar to the color burst packaging) (do you see how clean it is around the coffee mug??) So while I was cleaning on monday I made my scrap pile mostly dissappear by stamping newish stamp on it and ( mostly versafine) so they were left here to cure/dry. probably will be die cutting the words tonight.   Now this was a recent find these boxes of lace from a yard sale. they were sitting on the coffee table across the room and I had seen the boxes on monday and thought you should go through them so this is the before.\nand this is the during. so you can see all the piles of everything I had left out when we left for the wedding last Saturday. So, when I was done cleaning all this and putting it away and etc. it was too dark for my eyes to feel like playing monday night.\nooh and you can see what the tim holtz punchie looks like in this shot too.", "source": "Stacy's Memory Triggers"}