{"published": "2015-09-03T07:07:03Z", "media-type": "News", "title": "Inland port in Tauranga’s backyard", "id": "cbe7eea9-21f3-4359-bd9f-ba0c7d0c7012", "content": "Ports of Auckland have revealed their plans for a 1.4 hectare intermodal freight hub including rail connection, container handling facilities and other value-added logistics services. The hub will be constructed only a few kilometres from the Port of Tauranga’s gates.\n\nThe move is somewhat of a “return of serve” from the former in light of the latter having pioneered the inland port concept in New Zealand when establishing MetroPort Auckland 16 years ago.\n\nThe development, due to open in Triton Avenue towards the end of this year, will allow for wider competition and choice, said Ports of Auckland chief executive Tony Gibson.\n\n“Our Bay of Plenty freight hub will help make New Zealand exporters more competitive on the world stage by making their access to global markets more efficient and easy,” said Mr Gibson. \n\n“It also enables us to reduce excessive empty container movements and better balance the volume of exported goods with imported goods through our port. This is good for exporters, for New Zealand’s supply chain logistics and for the port.”\n\nNew Zealand Shippers’ Council chairperson Mike Knowles views the projeect as “further development in the competitive process”.\n\n“Both [ports] are major players in the New Zealand supply chain and both are important to many companies in our membership,” he says.\n\n“The ports do compete against each other and against other ports in New Zealand.” \n\nExportNZ executive director Catherine Beard sees the the development positively, stating it will “create good competition and prices for exporters and take cost out of the supply chain”.\n\n“We do know that it is a problem in New Zealand that we cart a lot of empties around and that costs money, so if we can do anything to reduce the cartage of fresh air, one would think that is going to translate into greater economies for exporters,” says Ms Beard.\n\nThe operation, on behalf of Ports of Auckland by Toll Group with land-owner Triton Pacific building the infrastructure required, will complement the port company’s existing inland freight hubs at Wiri (South Auckland) and Longburn (Manawatu).\n\nIain MacIntyre", "source": "Baird Maritime"}