{"published": "2015-09-14T21:00:51Z", "media-type": "News", "title": "Kansas Secretary of Agriculture Encourages Water Conservation Efforts", "id": "174a9dda-d641-4169-ad92-c5ab072df723", "content": "MANHATTAN, Kan. – In an effort help Kansans preserve our precious water resources, the Department of Agriculture continues working to provide flexible water management tools, like the new Water Conservation Areas (WCAs), to encourage reduced water usage while maintaining productive agricultural output. Updated information on these tools is available online at http://agriculture.ks.gov/wca . \n \nKansas Secretary of Agriculture Jackie McClaskey encourages water users to consider developing and implementing a WCA to further improve water conservation efforts. \n \n“WCAs are a central component of the 50-Year Vision for the Future of Water in Kansas and were created to provide water users a flexible tool to better manage and conserve valuable water resources,” said Secretary McClaskey. “It’s important for water users to understand how WCAs can be a part of their water management plans, and how this tool is different from other water conservation tools. KDA staff is working with water users across Kansas to develop and fully understand WCAs, and the information on the website will be another resource for them to use.” \n \nSigned into law in April 2015 by Governor Sam Brownback, WCAs are a simple and flexible tool help extend the usable life of the Ogallala-High Plains Aquifer, a key priority for the Governor. WCAs are 100 percent voluntary and are developed through a streamlined process. They provide additional flexibility for water users to better manage their water rights, including creating multi-year allocations, allowing the movement of allocations between enrolled water rights, or the allowing use of water for new uses. \n \nAny groundwater water right owner or group of water right owners in an area in need of conservation may form a WCA. Landowners with multiple water rights are eligible to group those rights into one WCA or multiple WCAs. For the purpose of a WCA, an area in need of conservation must meet one or more of the following conditions: \n Groundwater levels in the area are declining or have declined excessively;  Rate of withdrawal of groundwater within the area in question equals or exceeds the rate of recharge in the area;  Preventable waste of water is occurring or may occur in the area; or  Unreasonable deterioration of the quality of water is occurring in the area.  \n“Agriculture is the largest industry in Kansas, and in order for agriculture to continue being the economic driver in our state, we have to better conserve water resources,” said Secretary McClaskey. “Throughout the development of the 50-year Vision for Water in Kansas, we repeatedly heard a call for flexible water conservation tools. WCAs meet the need, and will play an important role in water conservation efforts. We encourage all water users to learn more about WCAs as they develop management plans for their water rights.” \n \nProtecting the state’s natural resources is one of KDA’s top priorities as the agency works to promote the agriculture industry and serve Kansas farmers, ranchers and agribusinesses. \n \nVisit http://agriculture.ks.gov/wca for more information.", "source": "KRVN 880 Rural Radio"}