{"published": "2015-09-14T16:20:13Z", "media-type": "Blog", "title": "Kris and Caitlyn Jenner Hug it Out-Meeting Ends With a Selfie", "id": "10e4b7ae-5ce6-4dad-9481-df723fdbdc57", "content": "Caitlyn Jenner saved her reunion with ex-wife Kris Jenner for the season finale of I Am Cait. After teasing the meeting for weeks, the conversation felt short, and like a bit of a let down. The two hugged it out though clearly there is a lot for them to work through. \n \nThe tense confrontation came after we’ve watched Caitlyn talk about the lack of private support from her family for weeks. While the Keeping Up With the Kardashian family has been supportive publicly through social media, Caitlyn has been hurt that the private support has been lacking. After discussing it with some of her trans friends, Caitlyn decided to reach out to Kris again. \n \n\n \nI Am Cait has taken a ratings hit with some believing that it was too much public service announcement and not enough drama or even Kardashian presence. Kim and Khloe appeared on the show and while Kim was supportive, Khloe was angry over the Vanity Fair article. Caitlyn was not having it and appeared to have difficulty understanding why Khloe would feel that Cait was trashing her mom. \n \nCaitlyn seemed to have the same trouble with Kris in the series finale. When Kris explained that it was an adjustment and that the Vanity Fair article hurt her, Caitlyn told her to stop being a martyr. Kris couldn’t help but cry despite initially saying she didn’t want to cry. The two were in agreement that they had a great relationship with a lot of love and happy memories. They also agreed that the last few years of their marriage were not happy for either of them, though they still seemed unable to see eye to eye on the reason. \n \nKris believes Caitlyn cast the family aside to transition and accused Caitlyn of supporting her new trans friends while forgetting her family, a charge Caitlyn rejected. Caitlyn is still adamant that she did not leave Kris to transition but rather because of the way Kris was treating her. Caitlyn was also very resistant to any idea that the transition could be tough on Kris in any way, whether their marriage was in a good place or not. \n \nCaitlyn claims that she did not leave Kris to transition, that it was just what happened. While she may believe that on some levels, she has spoken repeatedly about the lies and hiding she did before she chose to live her authentic self. Why is it so hard for her to believe that her internal struggle could have been a factor in the decline of what once appeared to be a happy union? Is there harm in admitting that she was miserable and wanted to live her life as a woman even if she wasn’t completely conscious of that? After all she had gone through steps to transition as early as the 80s. \n \nOne of Caitlyn’s friends and advisors, Jennifer Boylan, is a trans woman. Her wife stuck it out with her though even she spoke of the statistics with Caitlyn. Many marriages do not survive a spouse transitioning and Boylan did not blame Kris for not wanting to be married to Caitlyn though Caitlyn seems to want the acceptance from Kris that she feels she did not get. \n \nKris showed up at Caitlyn’s Malibu house to talk. One of the first things Caitlyn brought up was not being invited to Kylie’s graduation. Kris explained that she was hurt and not ready. Caitlyn called it a slap in the face after car pooling kids for 15 years. \n \nThe former spouses talked and Kris reminded Caitlyn that most divorced couples don’t do everything together though Caitlyn is still Kylie’s parent and had a right to be there. Still, they were like many divorced couples not seeing eye to eye. The only difference is that Caitlyn transitioned and they had cameras there for their meeting. \n \nThey ended their meeting with a selfie and Caitlyn sneaking a kiss on her ex-wife’s cheek, something that surprised Kris, though she didn’t seem unhappy. Ultimately they hugged it out and as we know went on to celebrate Kylie’s 18th birthday together. \n \nKris Jenner thinks that her and Caitlyn have made progress. What do you think? Was their truce just for the cameras or will we be seeing more of them together as a family? Was it worth waiting 6 episodes of I Am Cait to see that conversation or do you feel let down? Let us know what you think here at Haveuheard.", "source": "HaveUHeard"}