{"published": "2015-09-28T20:31:00Z", "media-type": "News", "title": "US STOCKS-Wall St drops as anxious investors eye China", "id": "c645dd67-cafd-4002-b259-e5fe62a2ac55", "content": "* China industrial profits fall, stoking economy fear \n\r\n\t\t\t\t\t\r \n* U.S. consumer spending rises more than expected in Aug \n\r\n\t\t\t\t\t\r \n* Biotech stocks continue their fall \n\r\n\t\t\t\t\t\r \n* Indexes end down: Dow 1.92 pct, S&P 2.57 pct, Nasdaq 3.04 pct \n\r\n\t\t\t\t\t\r \n(Updates to close) \n\r\n\t\t\t\t\t\r \nSept 28 (Reuters) - U.S. stocks finished sharply lower on Monday and were on track for their worst quarter in four years as investors worried about the health of China's economy and its potential impact on the timing of a U.S. interest rate increase. \n\r\n\t\t\t\t\t\r \nThe Nasdaq composite lost 3 percent and S&P 500 dropped more than 2 percent. \n\r\n\t\t\t\t\t\r \nMuch of the damage came from pharmaceutical and biotech stocks, including Allergan and Gilead Sciences, with the sector still bleeding a week after Democratic presidential candidate Hillary Clinton criticized drug pricing. \n\r\n\t\t\t\t\t\r \nFollowing its worst week in seven years, the Nasdaq biotechnology index fell 6 percent, its worst one-day drop since 2011. Among the S&P sectors, the health care index was the deepest decliner, down 3.84 percent. \n\r\n\t\t\t\t\t\r \n\"The broad healthcare sector and China are hurting the market. It's time for risk-off and there's no place to hide,\" said Richard Weeks, managing director at HighTower Advisors in Vienna, Virginia. \n\r\n\t\t\t\t\t\r \nProfits at Chinese industrial companies fell 8.8 percent, fresh data showed, pushing down shares of raw material producers and energy companies. Oil prices fell more than 2 percent. \n\r\n\t\t\t\t\t\r \nU.S. consumer spending rose more than expected in August, according to another report, appearing to add to the case for an interest rate increase this year. \n\r\n\t\t\t\t\t\r \nBut contracts to buy previously owned U.S. homes decreased, indicating the robust housing market could be losing some steam. \n\r\n\t\t\t\t\t\r \nThe Federal Reserve held off from raising rates at its September meeting, citing concerns about the global economy, notably China, among other factors. \n\r\n\t\t\t\t\t\r \nNew York Federal Reserve President William Dudley on Monday suggested the central bank could pull the trigger as soon as October. \n\r\n\t\t\t\t\t\r \n\"A lot of investors think the Fed is confused,\" said Mohannad Aama, Managing Director at Beam Capital Management LLC. \"They're putting themselves in a corner by saying they expect to raise rates between now and the end of the year when the economy every day is proving otherwise.\" \n\r\n\t\t\t\t\t\r \nSeveral other Fed officials are scheduled to speak during the week, including Chair Janet Yellen on Wednesday. \n\r\n\t\t\t\t\t\r \nInvestors will also scrutinize September non-farm payrolls data on Friday. \n\r\n\t\t\t\t\t\r \nThe Dow Jones industrial average fell 1.92 percent to end at 16,001.89 points. \n\r\n\t\t\t\t\t\r \nThe S&P 500 lost 2.57 percent to 1,881.77 and the Nasdaq Composite dropped 3.04 percent to finish at 4,543.97. \n\r\n\t\t\t\t\t\r \nBillionaire investor Carl Icahn said the Fed's low interest rates are creating bubbles in markets for art, property and \"junk\" bonds, in a video to be released on Tuesday. http://watch.reuters.tv/HBv \n\r\n\t\t\t\t\t\r \nAlcoa's shares jumped 5.73 percent after the aluminum producer said it would split into two publicly-traded companies. \n\r\n\t\t\t\t\t\r \nThe largest drag on the S&P 500, Apple fell 1.97 percent despite reporting that it sold a record number of its new iPhones in their first weekend. \n\r\n\t\t\t\t\t\r \nDeclining issues outnumbered advancing ones on the NYSE by 2,796 to 316. On the Nasdaq, 2,397 issues fell and 452 advanced. \n\r\n\t\t\t\t\t\r \nThe S&P 500 index showed no new 52-week highs and 80 lows, while the Nasdaq recorded 12 new highs and 358 lows. \n\r\n\t\t\t\t\t\r \nAbout 8.3 billion shares changed hands on U.S. exchanges, above the 7.2 billion daily average for the past 20 trading days, according to Thomson Reuters data. \n\r\n\t\t\t\t\t\r \n(Additional reporting by Abhiram Nandakumar and Sweta Singh in Bengaluru, and Sinead Carew in New York; Editing by Nick Zieminski)", "source": "CNBC"}