{"published": "2015-09-14T15:20:49Z", "media-type": "News", "title": "IFA President Calls for Corporate Taxpayer Bill of Rights in Thomson Reuters Tax Talk Segment", "id": "2b5bb31d-6ed1-4cc8-a8e6-519914c457a3", "content": "NEW YORK, September 14, 2015 - During an interview for Thomson Reuters Tax Talk web series, Porus Kaka, president of the International Fiscal Association (IFA), made the case for a taxpayer bill of rights to protect the interests of companies subject to international tax reform efforts. \n \nTax Talk is a series of exclusive interviews with leaders in the world of tax, accounting and finance. Reuters Editor-at-Large Axel Threlfall conducts the interviews. \n    \nIn two interviews conducted last week at the IFA's Annual Congress in Basel, Switzerland, Kaka discussed the challenges of complying with regulatory requirements likely to result from the Organization for Economic Cooperation and Development (OECD)'s action plan for addressing Base Erosion and Profit-Shifting (BEPS). \n \nThe interviews are posted tax.thomsonreuters.com/BEPS , along with these videos: \n Steve Mendelsohn, head of Knowledge Solutions in the Tax & Accounting business of Thomson Reuters, discusses the dominant topic at the IFA Congress: BEPS.   IFA delegates assess the impact of the Congress on BEPS' adoption.    June's Tax Talk segment in which Pascal Saint-Amans, director of the Centre for Tax Policy and Administration at the OECD, discusses the global rollout of BEPS.   \nThomson Reuters \n \nThomson Reuters is the world's leading source of intelligent information for businesses and professionals. We combine industry expertise with innovative technology to deliver critical information to leading decision makers in the financial and risk, legal, tax and accounting, intellectual property and science and media markets, powered by the world's most trusted news organization. For more information, go to www.thomsonreuters.com . \n \nContact \n Dana Greenstein \nPublic Relations Manager \nTax & Accounting \nThomson Reuters \n+1 201 536 4397 \ndana.greenstein@thomsonreuters.com  \n\n\nThis announcement is distributed by NASDAQ OMX Corporate Solutions on behalf of NASDAQ OMX Corporate Solutions clients. \nThe issuer of this announcement warrants that they are solely responsible for the content, accuracy and originality of the information contained therein. \nSource: Thomson Reuters Corporation  via Globenewswire \nHUG#1951929", "source": "Press-Telegram"}