{"published": "2015-09-29T15:26:45Z", "media-type": "News", "title": "South Jersey Industries Trading 1.6% Higher  (SJI)", "id": "a11e2345-805f-452c-b42d-5a5dc49f8803", "content": "South Jersey Industries (NYSE:SJI) traded up 1.6% on Monday , Analyst Ratings Network.com reports. The stock traded as high as $24.89 and last traded at $24.68, with a volume of 449,594 shares. The stock had previously closed at $24.29. \n \nSeveral equities research analysts recently weighed in on the company. Zacks raised South Jersey Industries from a “sell” rating to a “hold” rating in a report on Tuesday, June 2nd. Janney Montgomery Scott initiated coverage on South Jersey Industries in a research note on Thursday, June 18th. They set a “buy” rating and a $32.00 price target for the company. Finally, Hilliard Lyons upgraded South Jersey Industries from an “underperform” rating to a “neutral” rating in a research report on Monday, August 10th. \n \nThe company has a 50 day moving average price of $24.26 and a 200-day moving average price of $25.48. The company has a market capitalization of $1.69 billion and a PE ratio of 15.81. \n \nSouth Jersey Industries (NYSE:SJI) last posted its quarterly earnings results on Friday, August 7th. The company reported $0.03 earnings per share for the quarter, missing the consensus estimate of $0.12 by $0.09. During the same period last year, the company earned $0.30 EPS.  On average, equities analysts expect that  South Jersey Industries will post $1.50 earnings per share for the current year. \n \nThe firm also recently declared a quarterly dividend, which will be paid on Friday, October 2nd. Shareholders of record on Thursday, September 10th will be paid a $0.2513 dividend. This represents a $1.01 annualized dividend and a yield of 4.07%. The ex-dividend date of this dividend is Tuesday, September 8th. \n \nIn other news, Director Victor Fortkiewicz bought 1,000 shares of the company’s stock in a transaction dated Tuesday, August 18th. The shares were purchased at an average price of $25.82 per share, for a total transaction of $25,820.00. Following the completion of the purchase, the director now owns 19,002 shares in the company, valued at approximately $490,631.64. The transaction was disclosed in a legal filing with the SEC, which is available at the SEC website . \n \nSouth Jersey Industries, Inc. ( NYSE:SJI ) is an energy services holding company. The Company provides energy-related products and services through its subsidiaries. Its subsidiaries include South Jersey Gas Company (SJG), South Jersey Energy Company (SJE), South Jersey Resources Group, LLC (SJRG), South Jersey Exploration, LLC, Marina Energy LLC (Marina), South Jersey Energy Service Plus, LLC and SJI Midstream, LLC. It operates in several operating segments: Gas utility operations consist of natural gas distribution; Wholesale energy operations include the activities of SJRG and SJEX; SJE is involved in retail gas and retail electric activities; Retail gas and other operations include natural gas acquisition and transportation services; Retail electric operations consist of electricity acquisition and transportation; On-site energy production consists of Marina’s thermal energy facility and Appliance service operations include SJESP’s servicing of appliances.", "source": "SleekMoney"}