{"published": "2015-09-14T20:40:02Z", "media-type": "Blog", "title": "A Paleo Rehab Success Story", "id": "328b5f1c-2b52-4eac-916c-c7983d4882a4", "content": "I love health success stories. Who doesn’t?  \nMany of the “Before and After” stories we see online are related to weight loss. Getting that bikini shot after losing 50 pounds is fine and all, but I find the stories about overcoming chronic illness far more inspiring. \n \nThat’s why I’m stoked to share one of my student’s testimonials about her experience going through the Paleo Rehab: Adrenal Fatigue program. \n \nLeslie* contacted me after I asked the Paleo Rehab group to share their personal health journey related to their identification of HPA axis dysregulation (AKA “ adrenal fatigue “) and the health improvements they had after implementing the recommendations from the program. \n \nWhen Leslie told me our program “saved her life”, I had to find out more. Even I was in disbelief that our program could help someone achieve that level of health success from Paleo Rehab . \n \nHow could our online program have saved someone’s life? \n \nLeslie was kind enough to share her story publicly, for which I’m so grateful. I hope her experience gives you hope and confidence that you too can find the root of your health problems and begin overcoming them today . \n \nThank you for your story Leslie! <3 \n \n*Name has been changed for privacy. \n Leslie’s Story  \nThree years ago my health changed overnight, and my life went on hold. \n \nI would wake up every night around 1am with internal tremors in my neck, back and abdomen. They became progressively stronger throughout the night and I couldn’t sleep – sometimes for days at a time. They felt like I was having a seizure but I wasn’t. Occasionally the symptoms would happen during the day but for the most part it was at night. The conventional doctor initially thought it was a vitamin deficiency but I didn’t improve with supplementation. \n \nMonths passed living with these symptoms. The sleep deprivation was debilitating. I couldn’t understand why it was happening every night at the same time. The doctor thought it was stress and the only stress I had was from not knowing what was wrong with me. \n \nI thought my symptoms might be spine related so I went to see a Chiropractor and he was the first one to suggest “adrenal fatigue.”  He suggested I purchase Dr. Wilson’s book but when I read it the symptoms didn’t sound like mine, at the time, so I didn’t give it any more thought.  Over the years I forgot about it. \n \nNext I tried Osteopathy treatments for two years and I was told that I have a nervous system imbalance and could be fixed with osteopathy and acupuncture but it would take time. I was willing to give it time and went for treatment twice a week but there was no improvement.  During this time I decided to see a Naturopath and when I described my symptoms he looked at me with a little smile and said nothing. He offered no possible explanation. \n \nI went back to the conventional doctor who prescribed an MRI – the results were normal.  Then I had blood tests, x-rays and ultrasounds to rule out other conditions – they were normal. He thought the symptoms were probably menopausal and said that I am lucky because women who have hot flashes suffer more.  My condition was not considered as bad as hot flashes.  Basically, in a polite way, I was told to suck it up.  I didn’t know where to turn to for help. It was a terrible feeling to know that something was wrong and I didn’t know where to go for help. \n \nI felt abandoned and alone. \n \nI decided to try another Naturopath who said my symptoms were due to an underactive thyroid.  After a few months on thyroid supplementation there was no improvement and I was feeling worse with additional symptoms – severe muscular pain every morning for 2 to 3 hours, low blood sugar and lack of energy – almost bedridden. With each appointment I complained about them and one day she realized it was low cortisol, which she called Adrenal Fatigue.  She gave me an adrenal supplement but the other ingredients in this supplement didn’t agree with me and I had to stop taking it. \n \nShe offered little help with my diet even though she had a nutritional background.  When I explained that I was having a very difficult time controlling sugar levels and that I was eating almost every hour and a half during the day and several times throughout the night she gave me another supplement to balance sugar levels but it didn’t work. \n \nDesperate for answers I went to see an endocrinologist wondering if it really could be menopausal.  The endocrinologist said that I didn’t have an adrenal problem, that there is no precursor to Addison’s disease, that I didn’t have a blood sugar problem, and that what I have is a result of a stressful life. He said that those who have had a stressful life will have “one heck of a time when they reach menopause”.  He recommended hormone replacement therapy to get me over the hump for the next two years but I refused to take it because of the bad side effects. I didn’t need any more ailments to deal with. \n \nDuring the day I tried to get some sleep. I was lucky if I got an hour or two.  Any vitamins I tried to take made me severely dizzy for hours or made my hands tremble.  Walking across the room felt like I was going to drop to the ground from severe exhaustion and not only physical exhaustion but I felt an internal exhaustion like I was crumbling on the inside. All I wanted to do was stay in bed and rest. \n \nEvery night I was in survival mode.  Eat or pass out.  \n \nHungry or not I had to eat to keep my sugar levels up and most of the time – actually all of the time – I was not hungry at all and had to force the food down.  Eating several times during the night never gave me a restful sleep and I kept my husband awake too.  I had to get up so frequently that it would wake him.  Sometimes the sugar levels were so low that I’d be trembling and crying from fear and frustration. He’d get up to sit with me in the kitchen until my body absorbed the food and the symptoms settled down.  That was a regular event.  He was worried about my health, which then started to affect his. \n \nWhen I heard about the Paleo Rehab program I joined hoping that I could, at the very least, learn one or two things that would help me feel a bit better. \n \nThis program gave me much more than that. I am on my way to being normal again. \n \nAfter joining this program I made some diet changes: I increased protein, carb, fat and fiber intake in the recommended ratios.  I ate super foods, such as liver, and my muscular pain improved within a week while stabilizing my blood sugar.  To eliminate the muscle pain completely I increased soluble fiber and over a two-week period it worked – the pain is gone!  I’ve been pain-free for 6 weeks now and my blood sugar is stable.  I used to eat 8 meals a day plus 1 to 3 snacks throughout the night and now I am down to 5 meals and the occasional bedtime snack if I don’t eat enough calories during the day. \n \nI can finally sleep through the night. Finally. No more tremors. Adding meditation and a few, easy lifestyle changes to my daily routine has helped a lot too. \n \nI am also working one-on-one with Kelsey Marksteiner on individualized supplementation due to other health conditions that need attention. After 2 weeks of starting the new supplementation my blood sugar problems feel almost non-existent – the best they’ve ever been.  I know the sugar problem is there and I am in the healing stages so I won’t do anything crazy like go on a restrictive diet and act like it’s not a problem.  I know the problem is still there, but it does feel like it’s getting back to normal. \n \nI am healing. \n \nMy energy level is still low but I am confident that it will improve as well.  I know what and how much to eat to get and keep myself healthy. Today I understand that the tremors I had were caused from adrenaline peaks occurring around 1am and lowering blood sugar levels.   Cortisol is supposed to kick in to raise it but mine never did and my sugar levels remained low.  I was miserable every day from sleep deprivation, exhaustion and pain.  I stopped driving because I was afraid I’d fall asleep at the wheel. \n \nOnce I started sleeping through the night I was in a better mood – happier – and I could go out and do the things I used to do. My husband is so happy to see me getting back to normal – and so am I. \n \nWould you believe that I had spent close to $10,000 on healthcare practitioners with nothing to show for it?   \n \nIt’s hard to enjoy life when you don’t feel well and I was not going to give up on finding someone who could help me. I am so happy that I found the Paleo Rehab program .  The amount and the quality of the material are impressive and it is obvious how much time – and love – was put into it.  It is more than I ever expected. \n \nLaura and Kelsey – you saved my life. \n \nYes, that is exactly how I feel and I am not ashamed to say it even though it may sound exaggerated.  What I went through was horrible and only my husband knows the extent because he was there to witness it. \n \nYou helped me when no one else could and I don’t know where I’d be without you.    \n \nThank. You. So. Much. \n \n- Leslie", "source": "Ancestralize Me"}