{"published": "2015-09-27T11:01:00Z", "media-type": "News", "title": "Why Fregate Island in the Seychelles can only be described as the ultimate resort", "id": "674789dc-38ac-437c-becb-eca012168dc2", "content": "The remote island is the ideal location for honeymooners or families Villas are perched on cliffs overlooking the sea, with private beach below All guests will also be assigned a personal butler to look after their needs \nBy\n\nSandra Howard For The Mail On Sunday \n \n Published: 18:11 EST, 26 September 2015 |  Updated: 06:01 EST, 27 September 2015  \n   \nView \ncomments \n  \nIt must surely be the ultimate resort. No other word could do full justice to Fregate Island in the Seychelles, as ecological and nurturing of wildlife as it is luxuriously exotic. \n\nIt's a place for honeymooners and second-honeymooners, for celebrating anniversaries, birthdays that end with a nought, for any of those extra-special, once-in-a-lifetime holidays that come tied up with a romantic red bow. \n\nWe were flagging a bit after a connecting flight in Dubai at dawn, but what was another couple of hours of flying when our destination was a group of islands scattered like stars in the middle of the Indian Ocean? Any travel weariness fell away fast. \n \nFregate Island in the Seychelles is as well known for its ecological preservation as its exotic luxury \n\nAt Mahe international airport on the largest of the Seychelles islands, we were whisked through passport control and into a waiting helicopter, lifting off almost instantly for the 15-minute flight. Fregate doesn't do things by halves. \n\nThe depths and shallows of the sea below us were mapped out in a rainbow of blues – inky, indigo and azure. I almost felt able to make out the darting fish. \n\nThen the white fringes and forest-green interior of Fregate Island came into view, looming out of a wispy ring of sea mist; it looked remote from the world, like a Desert Island Discs island, a mirage. \n\nYet this is a mirage with a helipad, a landing strip, harbour, yacht club and a tiny historic chapel – not to mention sumptuous villas, each with an infinity pool, Jacuzzi, large sun terrace and shaded double day-bed. \n \nEach of the gorgeous villas on the island comes complete with an infinity pool, Jacuzzi and private beach \n\nOur villa was perched on a clifftop looking out over a sapphire sea, and a more romantic home for five days was hard to imagine. Rough-hewn steps led down to a tiny private beach where the sand was white and soft like tropical snow. \n  TRAVEL FACTS  \nAfrica Travel (africatravel.co.uk, 020 7843 3500) offers five nights at Fregate Island from £6,975pp.  \n\nThis includes return Emirates flights from London, Manchester, Birmingham, Newcastle or Glasgow, onward helicopter transfers, all meals, drinks, laundry, and nonmotorised activities. \n  \nWe had a butler, Jared, to look after us. He drove us everywhere in a buggy or we were free to drive it ourselves. He was from Mombasa and seemed chuffed to hear that I knew the Kenyan coast quite well; we were soon swapping stories of the joys of Kilifi Creek and of fearsome snakes – Jared's encounters were certainly closer and more deadly than mine. \n\nShowing us round the three-room villa, he explained its delights and luxuries – the flat-screen TVs, the music system, the outside and indoor showers – then suggested we must be ready for some food. He was right. It was mid-afternoon, a long time since our airline tray. \n \nSandra Howard visited the island with her husband, calling Fregate the 'ultimate' resort \n\nMeals, we soon discovered, could be taken whenever and wherever we chose: at Plantation House – the restored home of the island's original 19th Century planter that had a little museum attached – in The Pirate's Bar, the library, on any of the island's seven beaches, or even in a splendid treehouse high up in a banyan tree. \n\nJared wanted to bring whatever we fancied to the villa, but we chose to explore the Fregate House restaurant adjacent to the reception and boutique, effectively the island's hub.  \n\nWe ate delicious seafood and crab salads while marvelling at the view, before taking the steps down through terraced gardens and passing the two main pools on the way to the beach. It was exquisite, with loungers and towels and a beach bar. Best of all, we had the place to ourselves. \n\nThe watchword of Fregate is privacy: it is in the island's DNA. This wouldn't be the perfect holiday destination for clubbers, but nature-lovers, paparazzi-shy celebrities, honeymooners – who can request a distant villa – and seekers of sun and solitude would all be in seventh heaven. \n\nFamilies, too, would love it. The island, three miles square and the most isolated of the Seychelles granite islands, has species unique to its shores and is a natural playground. \n \nAround the island, 2,000 giant Aldabra tortoises roam free and there is a nursery dedicated to their protection \n\nAbout 2,000 giant Aldabra tortoises roam free, and during a tour of the island we were shown the nursery for the protection of the vulnerable baby tortoises. Children can adopt one of the older ones (with a little parental sponsorship), name it and then release it back into the forest. \n\n'The kids love to come back a year or two later and look for their chosen junior,' we were told. 'We can't honestly swear that the one they've seen is George, Henry or Elton, but they'll gladly believe it's theirs!' \n\nWe were shown a sign by the steps down to one of the beaches, Anse Maquereau, which read In Use. There was a telephone down there too, so as well as being private, you could ring for service. \n\nOur island tour had begun with a history lesson, taking us back a few million years to when India parted from Africa and floated north, leaving 115 scattered fragments that were to form the Seychelles. \n \nFregate has also saved the Seychelles magpie robin - a rare bird - from extinction \n\nThey were uninhabited until the 15th Century, when pirates became the first settlers – the famous Olivier Levasseur, 'La Buse', is said to have buried his treasure here, but it has still to be found. \n\nThe ancient tortoises provided meat and were almost wiped out over time, though happily numbers are healthier now, for which Fregate, committed to conservation, can take much of the credit. \n\nFregate has also saved the Seychelles magpie robin, one of the rarest birds in existence, from virtual extinction. It was the only place in the world where they could be found and numbers were down to seven pairs. Now you see them all over the island. \n\nThey are cute, cocky little birds – like a mini magpie, yet with none of a magpie's mean habits. We shared our sunny outdoor breakfasts with a covey of them every morning, along with a battery of other cheeky birds. \n\nWe learned a lot about the local birds, including the endemic Seychelles white-eye, another endangered species, and we fell in love with a brilliant little fellow, the Madagascar fody. Its black-ringed eyes distinguished it from the Seychelles fody who, as my husband Michael put it, seemed to have forgotten to apply its mascara. The tiny male fody turns vermillion when mating, which seemed to be most of the time. \n\nAs well as our tour, we went on a nature walk with Carl, one of the conservation team. He told us about the ground doves eating the fallen fermenting figs from the banyan trees and becoming tipsy – we enjoyed seeing them rolling around like drunken sailors on the paths. Carl plucked an enormous beetle off a tree and rested it on the back of his hand. \n\n'This,' he said, 'is the giant tenebrionid beetle, unique to Fregate and critically endangered. He's our signature species and we're extremely proud to be saving him.' Carl explained that the island was now rat-free, and the lack of predators was vital to the conservation plans. \n \nAs well as enjoying the stunning white sand (pictured), Sandra and her husband also explored the chef's organic market garden \n\nFregate has an organic market garden, the pride and joy of chef Arnaud. He oversees all the planting and rotation, sells surplus produce to Mahe, and experiments with exotic new seeds.  \n\nHe gave us a tour as well; up and down the rows of passion fruit, pawpaws, bell peppers, tomatoes – in fact every variety of fruit and vegetable you could name. He tested us on a few herbs. I'm the cook of the family, yet Michael scored better than I did.  \n\nArnaud's dishes were light and innovative. He prepared lunch using just-picked ingredients and, seated under a dainty pergola that Jared had erected for shade, we had an unbeatably healthy meal. \n\nThe night before, Jared and Arnaud had surprised us with a softly lit, romantic dinner à deux in the atmospheric library. We felt like a pair of honeymooning potentates (at our age?) and the menu was something else: yellow cherry tomato gazpacho; scallops flambeed with vermouth and served with oregano risotto; lobster mousse with caramelised fennel and a light lobster bisque; and a passion fruit sorbet for dessert. \n\nOn another night, Fregate's Creole chef, David, barbecued lobsters for us on a beach that was ours alone. We had a balmy stroll by the lapping waves, lounged in deckchairs while drinking cocktails and watching the rich red sun go down, before moving over to a candle-lit table with flowers and a crisp white cloth. Jared lit a small wigwam-style bonfire, the stars were out, the lobsters were meltingly tender, and a calorific Creole banana dessert was sinful to say the least. \n\nBut we did more than gorge on scrumptious food. There was almost too much to do in such a short space of time, including snorkelling with hawksbill turtles. \n \nAfter deep sea fishing, guests can indulge in a therapeutic massage at Fregate's picturesque spa \n\nOn another morning we went deep-sea fishing, first meeting James – the island's oldest giant tortoise who is much loved by everyone – by the marina. He is so tame that he takes titbits from your hands and has been known to clamber up over people like a dog greeting its master. \n\nThe fish weren't quite as obliging – we didn't catch anything – but we sailed round a granite island with its amazing rock formations, I swam in the exquisitely clear waters, and life felt pretty good. \n\nAnd afterwards, what could beat an indulgently therapeutic massage at a top spa? Ornamental ponds, lemongrass tea to greet us, fragrant aromas: oils of the local ylang-ylang fruit gently applied. Three hours in the hedonistic couples' room took my fancy. There's also a Chocolate Lovers Bliss, where the body is smothered with warm velvety Belgian chocolate, which stimulates circulation and is full of antioxidants, though that's probably one for the honeymooners… \n\nFregate has a slogan: Anything, Anytime, Anywhere. It's a fitting mantra. The island has just had a major refurbishment, and it's a haven devoted to conservation and luxury. \n\nWith winter on the way, we are already thinking back to our five heavenly days there, the scintillating water, tropical sun and sumptuous meals, the fabulous views of the Indian Ocean. It was a place of sensuous serenity. \n  Tagged : No tags for this article", "source": "UK Nigeria Online"}