{"published": "2015-09-16T02:15:38Z", "media-type": "Blog", "title": "At Alex Alioto's Nostra Spaghetteria – Divine Pasta, Celestial Libations, Angelic Pricing", "id": "a32b485e-892f-4e87-96ce-1af9841e4920", "content": "By Emma Krasov, photography by Yuri Krasov\n  In our town of staunch gourmands, if there ever was a restaurant serving upscale cuisine at everyday prices, the newly opened Nostra Spaghetteria would most likely put it to shame. Executive Chef/Owner, Alexander Alioto, a fourth generation restaurateur from a renowned San Francisco family, unveiled his new concept of affordable menu of high quality hand-made goodies and thoroughly selected wine, beer, and cocktail lists at his restaurant and bar (Bar Mia) on September 1.     \nGrowing up in the Italian food-focused family, and then spending years apprenticing in Italy, including at the two-star Michelin Ristorante San Domenico, Chef Alioto used to work in the kitchen at the world-famous French Laundry before opening his first Seven Hills, Zagat’s \"Best Italian Restaurant in the Bay Area,\" and now Nostra Spaghetteria in the Mission District.   Using fresh from the market local and seasonal ingredients, and making everything by hand, from mixing dough and cutting pasta with a knife to cooking a variety of delectable sauces from scratch, the kitchen at Nostra Spaghetteria extends its courtesy to allow for diner’s initiative. While the regular menu features old spaghetti favorites and newly popular dishes, the additional “custom pasta menu” lists nine kinds of handmade pasta, including a gluten-free variety; 10 house-made sauces (like arrabbiata, creamy tomato, white wine & garlic); eight veggie options (mushrooms, English peas, summer squash, etc.) and nine proteins from shrimp to turkey meatballs. If my school math memory serves me right this list of ingredients provides near infinite amount of possibilities for creating your own pasta dishes every day of the year for many-many years! For our first dinner at Nostra (“ours” in Italian) my dining companion and I picked several of the chef-recommended “simple dishes.” Grilled Octopus antipasto with heirloom cannellini beans, cherry tomato, frisee salad, and lemon vinaigrette was beautifully plated and perfectly balanced in tastes and textures. Raviolo al Uovo primo with parmesan cheese, Bloomsdale spinach, homemade ricotta cheese, brown butter, and truffle oil presented a rather substantial and easily shareable mama-dumpling topped with a soft cooked egg and stuffed to the brim with a delicious mixture of silky cheese and chewy greens. Another primo, which I wouldn’t think of ordering, but only because [uninitiated] I didn’t know better, was called Cold Spaghetti, and presented a hockey puck of tangled tender pasta in a pool of fresh heirloom tomato puree (just tomatoes and olive oil), topped with young pea shoots and sprinkled with micro greens. (When I peered into the open kitchen I saw those microgreens and other herbs grown in shallow boxes next to the prep table. Not a bad idea – a kitchen garden right in the kitchen! They can’t get fresher than that…) Then we finished our wonderful cocktails – Monkeys in Manhattan from Amaro Cocktails list, and Strawberry Basil Gimlet from House Cocktails – prepared by the Lead Bar Manager, Adam Mardigras, and the fun began! We asked our server and Sommelier Chevis Scott to recommend some wine for our customized pasta dishes we were about to consume. From a long list of sophisticated international labels compiled by the Master Sommelier Nunzio Alioto, he picked the utterly pleasing Sicilian Planeta, Cerasuolo di Vittoria (Nero d’Avola & Frappato Blend), and suggested we don’t go heavy-handed on creating our own pasta dishes, which was a great advice! I picked thin ribbons of tarjin pasta, substantial veal ragu sauce, and my favorite vegetable – eggplant. My husband picked light and airy gnocchi, basil pesto, and oxtail meat. Both our custom-made pastas turned out to be incredibly delicious, which was easily explained by the utmost freshness and the immediacy of preparation of all ingredients.     When it came time for dessert, we were actually full, but couldn’t resist Chef Alex’s Buttermilk Panna Cotta with Birbet wine gelee, nicely complimented by the sweet Moscato d’Asti from Piedmont. The contemporary “casual chic” design of the dining room and bar includes comfy tables and booths, a large-scale mural from local artist, Chris Lux, a few industrial accents, and bare Edison lamps of various forms and sizes. Reclaimed wood from a torn down barn, spotted in Half Moon Bay by the Chef’s mom, adds to the family feel of this tasteful and friendly place. Nostra Spaghetteria is located at 280 Valencia Street, San Francisco. Dinner 5:30 p.m. to 10:00 p.m. Tuesday – Thursday and Sunday and 5:30 p.m. – 11:00 p.m. Friday and Saturday. Brunch on Sunday 11:00 a.m. to 2:00 p.m. Bar Mia is open Tuesday – Saturday 3:00 p.m. to midnight and Sunday 3:00 p.m. – 10:00 p.m. with a special happy hour Tuesday – Sunday 3:00 p.m to 7:00 p.m. and late-night 10:00 p.m. – midnight Tuesday - Saturday. To make a reservation, call 415.655.9510 or visit: www.nostrasf.com.", "source": "Art and Entertain me"}