{"published": "2015-09-10T17:07:23Z", "media-type": "News", "title": "First Rocket Engine Test a Success for Firefly Space Systems", "id": "44611997-6d4b-4070-ba84-2cd46184b5b6", "content": "]]> \nCEDAR PARK, Texas , Sept. 10, 2015 /PRNewswire/ -- Firefly Space Systems, the Texas -based developer of dedicated launch vehicles for the small satellite market, announced today that it has successfully tested its first rocket engine, Firefly Rocket Engine Research 1 (\"FRE-R1\").  \n\n\"The successful testing of our first engine represents a quantum step in the technical maturation of our company.  We have demonstrated that our core engine design can reliably start, stop and operate at a steady state without combustion instabilities,\" said Firefly Co-Founder and CEO Dr. Thomas Markusic .  \n\nFirefly is developing one combustor design that will be utilized to power both stages of their small-sat launcher – \"Firefly Alpha.\"  The Alpha upper stage will utilize an engine (FRE-1) with a single combustor, whereas the first stage engine (FRE-2) will use an array of twelve of the same combustors arranged in an annular aerospike configuration. \n\nFRE-R1 is a propulsion pathfinder for both stages of Alpha.  It operates using LOx/ RP-1 propellants, but the basic combustor design can utilize either methane or RP-1 fuels.  The upper stage variant of the engine (FRE-1) will produce 7,000 lbf thrust, and the first stage cluster used in FRE-2 will produce 125,000 lbf thrust.  \n\nThe first test series successfully demonstrated startup, shutdown, and steady state combustion.  The test also served to prove the complete functionality of Firefly's new test site.  Upcoming engine tests will emphasize performance tuning and longer duration \"mission duty cycle\" runs.  The first hot-fire tests of the FRE-2 aerospike engine are expected to take place in early 2016. \n\n\"In only fifteen months, we have built our Texas team, constructed state-of-the-art engineering and test facilities, designed a complete rocket (Alpha) to PDR level, and built and tested key vehicle technologies, such as the FRE-R1 engine,\" added Markusic.    \n \n\"I'm incredibly proud of the innovative and hard-driving spirit of the Firefly team.  They are smart, hard-working and building momentum in hardware development, which will carry Firefly to space in short order.\" \n\nABOUT FIREFLY SPACE SYSTEMS \n\nFirefly is a small satellite launch company located in Cedar Park, TX which was created to provide low-cost, high-performance space launch capability for the under-served small satellite market, where secondary-payload launches are often the only option. The Firefly team consists of highly experienced aerospace engineers that have spent the better part of the past decade working at NASA and various New Space companies, including SpaceX, Blue Origin and Virgin Galactic. \n\nSimplified and optimized for least cost, and utilizing innovations such as a rethought engine design, Firefly has positioned itself to be the technological and cost effective solution leader for traditional manufacturers of small satellites for government agencies, earth observation, and constellation. \n\nVisit www.fireflyspace.com . \n\nPhoto - http://photos.prnewswire.com/prnh/20150910/265444   \nLogo - http://photos.prnewswire.com/prnh/20150910/265458LOGO   \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/first-rocket-engine-test-a-success-for-firefly-space-systems-300141007.html \n\nSOURCE  Firefly Space Systems", "source": "Sys-Con Media"}