{"published": "2015-09-13T17:36:31Z", "media-type": "News", "title": "For many, those familiar calls of: “Oh no he didn’t” and: “He’s behind you” are as much a part of Christmas as carol singers and turkey dinners.", "id": "ba6bb5ef-f74f-4cc2-aa79-1883d225cc96", "content": "By The Marina Theatre in Lowestoft: family pantomime Sleeping Beauty.\nRustie Lee (The Lilac Fairy).\n\nPicture: James Bass \n \n(C) Archant Norfolk 2015 Share link    The Marina Theatre in Lowestoft: family pantomime Sleeping Beauty.\nAsa Elliott (Prince Valiant) and Emily McAvoy (Princess Aurora) with Rustie Lee (The Lilac Fairy)\n\nPicture: James Bass \nAnd now the cast of this year’s pantomime at Lowestoft’s Marina Theatre has been announced, which signals the start of the festive countdown - for the actors at least. \n\nThe performance of Sleeping Beauty promises to be one to remember, with Rustie Lee - the much-loved TV cook who brought Caribbean delights to the audiences of TV-am in the 1980s - will be playing the Lilac Fairy. \n\n“I was so excited to come to Lowestoft as I had never been before. I will be spending my whole Christmas here and everyone has been so welcoming,” Ms Lee said. \n\nShe is also looking forward to sampling the town’s restaurants, especially for the fish. \n\n“I hope everyone will come along and enjoy themselves. It is such a great tradition we have in this country,” she said. \n\nJohn Lyons, who is most famous for his role as detective sergeant George Toolan in A Touch of Frost, will be playing King Crumble and Asa Elliott - who has appeared in the ITV series Benidorm - will take on the role of Prince Valiant. \n\nAsa Elliott said: “The panto is often children’s first time at the theatre so it is really special to be part of that. \n\n“It is great to come back to this theatre and see it is being restored when so many are shutting down.” \n\nThe pantomime opens on Tuesday, December 15 and runs until Saturday, January 2. \n\nGo to www.marinatheatre.co.uk or call 01502 533200 to book tickets. \n\nAre you part of a community group which is organising a pantomime for this festive season? Email george.ryan@archant.co.uk", "source": "East Anglian Daily Times"}