{"published": "2015-09-01T17:23:07Z", "media-type": "News", "title": "Escape the Oval Office Might be D.C.’s Hottest New Attraction", "id": "70ecb3ad-cbbe-4097-8608-e3373a34a728", "content": "The President of the United States accidentally left a copy of his White House Correspondents’ Dinner speech on his desk in the Oval Office. As a White House fellow, it’s your job to pick it up and bring it to him. Except when you get to the Oval Office, the door locks behind you. You can’t get out until you figure out what’s missing from the speech. What do you do? \n \nSo goes the scenario for Escape the Oval Office, one of two escape room-style games at D.C.’s brand new Escape Lounge , which opened in July on H Street NE. With roots in video game culture, escape rooms are cropping up in cities across the country. Aptly named, they are essentially rooms that you have to escape by answering clues, solving riddles, or finding hints that lead you to the key. They’ve become somewhat of a thing in the city in the past year, as WAMU noted last month , making the Escape Lounge the third to open since October. \n \nThis particular game lounge is also getting attention for having the city’s first escape room game set in the White House—though co-founder Ayanna Smith says that wasn’t the original intention. Smith, her husband, and their business partner wanted to launch a family entertainment business and, upon learning about escape rooms, decided to start the kid-friendly 30-minute-long Escape the Classroom game. They opened Escape the Oval Office at the same time, though, and it quickly become the main attraction. \n \n“The Oval Office is a little more popular now, because of the D.C. theme,” Smith says, adding that she’s noticed it’s an especially popular theme for tourists wanting to making their vacation as D.C.-centric as possible. \n \nEscape the Oval Office is a little bit different than some of the other escape rooms around town, which Smith warns visitors should know in advance. Rather than a linear style of play—where Clue #1 takes you to Clue #2, and so on, down a numbered list of clues—the Oval Office offers a lot of repeated clues in different locations around the office to help you find that missing piece from the president’s speech. \n \nAt first, this was hard for Washingtonians to grasp. Rare was the team that actually completed the puzzle and escaped the room, which led to some serious frustration in the Escape Lounge’s first weeks. Though Smith says that escape rooms “take a lot of pride in low escape numbers,” she acknowledged that frustration, especially among the competitive types these games attract. So in the past month, the Escape Lounge has started ramping up the last-minute hints the staff offers players. Now, about 50 percent of players escape before the end of the hour-long Escape the Oval Office game. \n \nEven if you do escape, these rooms are designed to allow you to come back for more. Every few months or so, The Escape Lounge intends to change up the scenario of both Escape the Oval Office and Escape the Classroom—keeping the themes, but changing the hints and the key needed to exit. \n \nBoth themed games are offered Wednesday to Sunday, 11 a.m. to 9 p.m.; it's $25 per person. Smith says Escape the Oval Office books up quickly for its weekend sessions, so get a jump on those reservations. Each game is meant to be played with five to 10 people, so if your group is smaller you might find yourself escaping the room with strangers. Given the popularity these games have as team-building exercises, though, those strangers might be new friends by the time you get out. \n \nAmy McKeever is on the D.C. beat for Travel + Leisure . You can follow her on Twitter and Instagram . \n   \nDid you enjoy this article? \n Share it.", "source": "Travel and Leisure"}