{"published": "2015-09-29T02:45:04Z", "media-type": "News", "title": "Derrick Johnson reaches top of Chiefs’ career tackle list", "id": "f1d87be6-b47c-407f-8747-08bafe1fc600", "content": "Linebacker Derrick Johnson hoped to arrive for the Chiefs’ “Monday Night Football” game against the Green Bay Packers as the team’s career leader in tackles. \n\nThat didn’t happen, but Johnson said he wouldn’t force the issue. \n\n“In some games there are many opportunities, in other games there are less,” Johnson said before the game. “My main focus can’t be on that. I can’t worry about it.” \n\nBut it didn’t take long for Johnson to match the record. It happened in the first half Monday with his fourth tackle. \n\nThe record-breaker — career tackle No. 1,000 — came early in the third quarter, when Johnson was the first to reach James Starks, who went down after a 2-yard gain. \n\nJohnson entered the night with 995 career tackles. Gary Spani, the former Kansas State star who played spent his entire NFL career with the Chiefs, retired in 1986 with 999 career stops. \n\nJohnson recorded three tackles in the first quarter on a rainy night Lambeau Field, all of which came at the end of big gains and prevented even bigger plays. \n\nThe tackle that tied the record was vintage Johnson. Late in the second quarter, he broke through, wrapped up Starks and dropped him for no gain on second and 1. \n\nThe record was his, a year after he figured to break it. \n\nLast season, Johnson, coming off his third straight Pro Bowl season, was fewer than 20 tackles away from the record. He recorded four in the opener against Tennessee before disaster struck. \n\nA torn Achilles’ ended Johnson’s year. He spent the season and months after recovering and thinking about returning to action and picking up where he left off. \n\nIn the season opener Sept. 13 at Houston, Johnson was on pace with eight stops. He wanted to break the mark in the home opener against the Broncos on Sept. 17, in a primetime spot before a national television audience. \n\nThe game remained tight throughout the second half before the Broncos won it 31-24 on a fumble return in the final minute. \n\n“I looked up late and saw I didn’t have many tackles, and I knew it was going to be difficult to get (the record) that night,” Johnson said. \n\nHe finished with two tackles against the Broncos. \n\nJohnson was the Chiefs’ first-round draft selection, 15th overall, in 2005 — the same draft that produced Chiefs quarterback Alex Smith at No. 1 with the 49ers and Packers quarterback Aaron Rodgers at No. 24. Johnson started from the outset, but in 2009, he went to the bench, starting three times in 15 games. \n\nThat season ended with perhaps the best game of his career, when he returned two interceptions for touchdowns in a victory at Denver. \n\nStarting in 2011, Johnson made three straight Pro Bowl appearances, and in 2011 was selected first-team All-Pro by The Associated Press. \n\nThe honors now include a position among the best players in franchise history, at least statistically, although tackles are not an official NFL statistic. \n\nTackle statistics are kept by the home team’s stats crew and, unlike interceptions or fumble recoveries, can be a judgment call and sometimes changed after film review by coaches. \n\nThat happened on Monday. It appeared Johnson would be given an assist on a tackle early in the second quarter. But the Packers’ statistics crew didn’t credit him, and the chase continued. \n\nThe Chiefs started keeping tackle stats in 1977, and they’re part of the team’s record book. Johnson holds the season record with 179 in 2011. \n\nHe’d have loved to have arrived in Green Bay with the record. But there’s something he wanted more. \n\n“It would have been better if we had won the game,” Johnson said. “I could have zero tackles, and if we win, that’s what I want.”", "source": "KansasCity.com"}