{"published": "2015-09-09T13:16:06Z", "media-type": "Blog", "title": "Iran deal reaches Congress: what happens next and why it matters", "id": "4551c1b5-93fe-4dff-b71d-523e53c1193e", "content": "With more than 40 Democrats lined up to support Barack Obama over the Iran nuclear deal, the outcome of a fiery Senate debate on the matter may look a foregone conclusion, but the manner in which it is resolved could yet have important bearing on the president’s ability to make the deal stick. What looks like an arcane row between Republicans and Democrats over process is instead a battle over how much political responsibility for the deal its supporters are prepared to assume and, perhaps, whether a future Republican White House would dare to seek to unpick it. It is a big day for the Senate. Majority leader Mitch McConnell has even requested that all 100 members be physically present in the chamber during the debate in order to hear what everyone has to say. For the vast majority of Americans, who perhaps occasionally catch glimpses of their lawmakers passionately holding forth in television close-ups on C-Span, it may come as a surprise to learn that this is a highly unusual development.\nThe self-styled “world’s greatest deliberative body” is often entirely empty; save for a lone speaker recording his or her thoughts on a given subject solely for the stenographers and unblinking lens of the TV camera.\nThe Senate’s ambiguous voting rules are also under scrutiny like never before thanks to a bitter row between Democrats and Republicans over exactly how many legislators are required to pass a law.\nIn theory, a simple majority of the 100 senators should be enough to pass a piece of legislation, such as the motion of disapproval in the Iran nuclear deal. This may even just mean 50 senators, since vice-president Joe Biden can cast a deciding vote in the event of a deadlock.\nIf a similar majority is achieved in the 435-seat House of Representatives, then the bill goes to the desk of the president, who can either choose to sign it into law or exercise his veto.\nBut in practice, a super-majority of 60 votes has long been seen as the threshold for most legislation. The reason is that in order for a vote to proceed, debate must first be brought to a close with a so-called “cloture” motion – a procedural hurdle that requires three-fifths of the Senate to approve.\nSince refusal to pass cloture allows an infinite period of debate to frustrate the passage of legislation, it is sometimes referred to as a “filibuster” – although it is rare that this involves senators physically holding the floor for hours by speaking and more usually is simply a refusal of one side to allow the necessary procedural steps toward a vote to take place.\nIn the case of the Iran bill, Democrats argue that the need for a super-majority was implicit in an agreement they reached in April with Republicans over how they would review the nuclear deal. Democratic minority leader Harry Reid offered on Tuesday to skip the remaining procedural steps and move directly to a vote, providing – and this is an important catch – that the Republicans agree that it have a 60-vote threshold.\nIf this were to happen, Republicans would almost certainly lose the vote. After Maria Cantwell of Washington became the last to express an opinion on Tuesday night, some 42 of the 46 Democrats (including two independents who normally vote with them) have now said they are in favour of the Iran deal.\nMany have said so reluctantly, however, fearful that the terms of the deal do not do enough to prevent Iran from developing nuclear weapons technology, and Republicans are nonetheless determined to extract maximum discomfort from the situation.\nBy insisting that normal rules are followed, Republican majority leader McConnell hopes to test whether these Democrats are not just willing to support the Iran deal but also be seen to use filibuster blocking tactics to prevent a vote from taking place at all.\nAt least one of the 42 – Delaware senator Chris Coons – has indicated he would be uncomfortable in doing this. If one more Democrat were to join him and vote in favour of cloture, then it is possible that Republicans still have enough support to end the debate, vote on the bill and pass the vote of disapproval of the Iran deal by a simple majority.\nFrom the outside, it can be hard to see why any of this matters. Obama has pledged to veto anything emerging from Congress that blocks the deal, insisting it is a presidential prerogative to conduct US foreign policy and refusing to treat the Iran deal as a formal treaty – something that would require express congressional ratification.\nCongress could override this veto, but only with a two-thirds majority in both the House and the Senate, so the short term survival of the Iran deal was assured as soon as the Democrats secured the support of 34 senators. But the way in which this end game plays out does matter – at least for US domestic politics, and possibly, ultimately, its foreign policy too. Many Republicans want Democrats – including presidential frontrunner Hillary Clinton, who speaks in favour of the Iran deal on Wednesday morning – to “own” what they believe to be a deeply unpopular policy.\nForcing Democratic senators to spell out their support in a formal vote is therefore some scant consolation to the deal’s critics, who are otherwise running out of options to frustrate the process directly.\nEven better, at least from the perspective of some Republicans, would be the sight of Democrats being forced to use filibuster tactics to block Congress from expressing its majority view.\nFew Democrats see it that way, of course, and many say this is always the way the Senate works.\nNevertheless, the battle to seize the moral high ground that will play out this week matters in the long run, particularly if a Republican president is elected in 2016.\nAs the deal’s opponents point out, most dramatically in a letter to the Ayatollah of Iran, executive actions are not binding on future presidents, who may choose to walk away from the deal after 2016.\nWhether this would have any impact on the international coalition behind the sanctions is a separate question, but it would be much easier for a future Republican president to justify reversing US policy if he or she can point to a vote of disapproval by the last Congress.", "source": "World news | The Guardian"}