{"published": "2015-09-30T17:06:59Z", "media-type": "News", "title": "SAS Recognized as One of the 100 Best Workplaces for Women", "id": "7d1a5f53-4bb3-43da-be32-c69e5d28b96a", "content": "Company News: Page (1) of 1 - 09/30/15     print\n\t    \tpage Professional Development, Resources and Amenities Cited   (September 30, 2015) \nCARY, NC--(Marketwired - September 30, 2015) - SAS, a pioneer in workplace culture, is one of the 100 Best Workplaces for Women, as ranked by Fortune magazine. The analytics leader has long been lauded for supporting work/life balance, family-friendly benefits and stimulating work. \n\nWomen, who represent almost half of the US SAS workforce, also make up nearly 40 percent of management and executive positions. SAS executives know the company's success relies on its ability to attract and retain these creative employees. \n\n\"SAS has always promoted an environment that gives employees a level of flexibility and support enabling them to do their best work. Whether for a young professional just starting her career or a working mom in a leadership position, we provide programs and services to help our employees balance the challenges of work and life,\" said SAS Vice President and Chief Human Resources Officer, Jenn Mann. \n\nCreating an environment for success \n\n \nSAS' many on-site benefits include a free recreation and fitness center and free health care center with adjacent pharmacy. Those, plus countless on-site convenience services, such as dry cleaning, alterations and subsidized cafs, explain why SAS appeals to male and female job seekers alike. But many SAS services specifically benefit working mothers, both on and off its main campus. Among them: subsidized child care, meals to go, parenting workshops, lactation consultants, and work/life counselors and seminars. \n\nFor SAS Principal Software Developer Michelle Barillaro, it goes way beyond convenience. Barillaro works on a product that helps SAS customers assess and avoid risk. SAS' on-site daycare centers also use it to track potential safety risks. \n\n\"My daughter attends SAS daycare here on campus, so I can check on her any time. That proximity and peace of mind helps me focus on my work. And knowing that SAS uses the software I work on for customers to protect my child makes me strive even harder to make sure the quality is there,\" said Barillaro. \n\nEncouraging professional development, leadership \n\nBeyond family-centric benefits, SAS continually adds programs to actively develop and engage women within the company. Its Women's Initiative Network (WIN), for example, empowers, encourages and inspires women to pursue excellence in their careers. By sharing time, expertise and passion, WIN members act as ambassadors for SAS and for careers in science and technology. \n\nStudies show that women are disinterested in STEM careers due to lack of job satisfaction, lack of advancement opportunities, and lack of reliable female role models. However, at SAS, this is not the case. \n\n\"Women in STEM bring a critical and unique perspective that is needed when innovating. Throughout my career at SAS, I've been continually supported and motivated to learn and apply new skills, take on new roles, and reinvent myself to stay relevant in our fast-paced industry. More tech companies should follow suit to make STEM careers more desirable for women,\" says Oita Coleman, SAS Vice President of Research & Development. \n\nSAS has a strong track record of developing female leaders, including two women recognized among the world's Premier 100 IT Leaders by Computerworld. The Premier 100 award shines a well-deserved spotlight on these talented, creative and hardworking women and men. \n\nSAS is widely recognized for its passion for education and support of STEM -related careers, and recently teamed with SoarTriangle , a Triangle-based organization aiming to close the funding gap for female entrepreneurs. \n\nAttracting new talent \n\nSAS' R3 summer student program is a cornerstone of the company's commitment to \"Recognize, Recruit and Retain\" women and minorities in fields of technology. R3 students gain real-world experience working with SAS managers on challenging projects. The ultimate goal is to pave a career path toward employment with SAS. \n\nSAS also was recently named among the 2015 Best Places to Work for Recent Grads and Fortune's 2015 Best Places to Work for Millennials . The business analytics leader has remained a staple on Fortune's list of Best Places to Work in the US since the list's inception. \n\nAbout SAS \n\nSAS is the leader in analytics. Through innovative analytics, business intelligence and data management software and services, SAS helps customers at more than 75,000 sites make better decisions faster. Since 1976, SAS has been giving customers around the world THE POWER TO KNOW. \n\nSAS and all other SAS Institute Inc. product or service names are registered trademarks or trademarks of SAS Institute Inc. in the USA and other countries.  indicates USA registration. Other brand and product names are trademarks of their respective companies. Copyright  2015 SAS Institute Inc. All rights reserved. \n \nShannon Heath \nshannon.heath@sas.com  \n919- 531-2676 \nwww.sas.com/news \n \nCopyright @ Marketwire \nPage: 1  \n \nRelated Keywords: USA, Marketwire,  Inc., Science, Medical, Business, Science, Other, Men, Women, \n\nSource:Marketwire.\n All Rights Reserved", "source": "Tutorial Finder"}