{"published": "2015-09-01T15:56:02Z", "media-type": "News", "title": "STOLEN JUSTICE - the True Story Behind the Howard Hughes Will", "id": "6f778cbc-343c-4194-8c92-ca538ef33c8f", "content": "Gary Magnesen, a retired FBI agent has resurrected the investigation and exposes the key figure in the conspiracy. In STOLEN JUSTICE - The True Story Behind the Howard Hughes Will, Magnesen lays out the case for the legitimacy of the Mormon Will by presenting previously unexplored evidence and citing numerous heretofore unknown witnesses who move the case well beyond the legal goalposts. \nLAS VEGAS, NEVADA - September 1, 2015 - ( Newswire.com ) \n\n\nHoward Robard Hughes Jr., the first American billionaire, famous industrialist, movie mogul, casino owner, and aviation pioneer passed away in April of 1976.  It was thought the eccentric, drug-addled genius had died without a will, but a three-paged handwritten will soon came to light.  A contentious fight over his vast estate was held in Las Vegas soon after his death and the document known as the “Mormon Will” was found to be fraudulent by a jury. \n\nAs a result, the central figure in the court battle, Melvin Dummar , was excoriated as a crook and conman.  He had testified that in late 1967 he had rescued an unconscious, hypothermic man in the desert of Western Nevada and the old-timer had confessed he was Howard Hughes. This unbelievable tale caused Dummar to be ostracized and mocked, and several universities, other organizations, and individuals were denied a substantial inheritance.  Hughes’ estranged family ended up with the vast fortune. \n   \nNow, 38 years later, Gary Magnesen , a highly decorated retired FBI agent has resurrected the investigation and pried open the dusty old case. He found a cesspool of treachery that rivals any work of fiction, including perjury, obstruction of justice, possible collusion by law enforcement officials, burglary, and even a murder.  He also exposes the key figure in the conspiracy to thwart justice. In his newly released book, STOLEN JUSTICE – The True Story Behind the Howard Hughes Will,  Magnesen lays out the case for the legitimacy of the Mormon Will by presenting previously unexplored evidence and citing numerous heretofore unknown witnesses who move the case well beyond the legal goalposts.​ \n \nContact Info: \nLVFP \n\nPress Release Service by Newswire.com \n\nOriginal Source: STOLEN JUSTICE - the True Story Behind the Howard Hughes Will", "source": "SearchBug"}