{"published": "2015-09-01T04:58:10Z", "media-type": "News", "title": "Black Armada exhibition at National Maritime Museum shows Australia's stand to support Indonesian independence on show", "id": "f83b4c8c-f356-4b38-877f-736123124289", "content": "In a period of history largely forgotten by both nations, Australians such as Fred Wong played a central role in the Indonesian fight for freedom from Dutch rule. \n\nAnthony Liem still has memories of the Indonesian war of independence.\n\nHe was barely three when a bomb exploded near his home in Semarang, on the north coast of Java, in late 1945.\n\n\"My father was a doctor, so he went out and treated the dead and wounded.\"\n\nLittle did Mr Liem know, more than 5000 kilometres away in Sydney, his future father-in-law, Fred Wong, was also doing his bit for Indonesian independence.\n\nIn a period of history that has largely been forgotten by both nations, Australians such as Mr Wong played a central role in the Indonesian fight for freedom from Dutch rule.\n\nThis remarkable connection between the two countries is explored in Armada Hitam (Black Armada), which opened at the Museum Benteng Vredeburg in Yogyakarta on Monday. It is simultaneously on display at the Australian National Maritime Museum in Sydney.\n\nThe Dutch administration had fled to Australia in 1942 after the Japanese occupation of what was then known as the Dutch East Indies.\n\nThey brought with them 10,000 Indonesians, including political prisoners.\n\nThat was something of a shock to Australians, Mr Liem wryly observes, given the White Australia policy.\n\nIn late 1945, when the war was over, the Dutch prepared to return to Indonesia in the Black Armada – ships loaded with military arms and personnel – in order to re-establish colonial control.\n\nHowever, Australian maritime workers sympathetic to the Indonesian independence cause boycotted the ships, refusing to supply them with coal, food and munitions.\n\n\"In fact, everything Dutch is black,\" a leaflet issued by the Trades and Labor Council said.\n\nSupport for Indonesian independence grew from the maritime workers to the Chifley government and Australia led the way in international political recognition of Indonesia.\n\nA decade ago, Mr Liem discovered his father-in-law's role in the struggle when he read a research paper, Unbroken Commitment: Fred Wong, China, Australia and a World to Win by University of Western Sydney academic Drew Cottle.\n\nMr Wong, a greengrocer from Leichhardt, helped organise meals for waterside strikers in Chinese cafes.\n\n\"The whole family didn't know anything about this political background,\" Mr Liem says.\n\nThe paper also mentioned a film, Indonesia Calling, which featured Mr Wong's best friend, Arthur. The film is based on a re-enactment of a mutiny by Indian seamen on board the Patras, a Dutch ship sailing for Indonesia that was forced to return to Sydney Harbour.\n\nMr Liem believed the fascinating story of this period of transnational co-operation needed to be told to a wider audience.\n\nIn 2008, he approached the Australian National Maritime Museum in Sydney and the Museum Benteng Vredeburg in Yogyakarta and suggested an exhibition.\n\n\"I thought it was an excellent story about the maritime connections between the two countries that has almost been forgotten in the public consciousness,\" Stephen Gapps, curator of the National Maritime Museum, says.\n\nArmada Hitam features Indonesia Calling on continuous loop. On display in the National Maritime Museum is also a gamelan (Javanese percussion instrument) made from sardine tins and cooking pots by an Indonesian political prisoner, Bapak Pontjopangrawit.\n\nThe Dutch brought the political prisoners with them to Australia, fearing the prisoners would establish a guerilla force if left behind that could make the Dutch return to Indonesia difficult.\n\nThey were initially interned in Australian camps with Japanese, German and Italian prisoners of war, where Pontjopangrawit entertained prisoners with his makeshift gamelan.\n\nHowever, the prisoners were released after unions lobbied then attorney-general Herbert Evatt, pointing out the Indonesians were not political enemies of Australia.\n\nMr Liem marvels at the Australian support for Indonesians at the time.\n\n\"Australia had just come out of a terrible war in Asia in 1945 and if a Chinese, Indonesian or Japanese person was walking down the street, people wouldn't have known the difference. This is a story about Australians 70 years ago who had the courage to stand up for their beliefs and their courage and foresight of a modern, multicultural, dynamic Australia.\"\n\nDr Gapps hopes Armada Hitam is just the tip of the iceberg.\n\n\"I see so much potential for a grander, larger exhibition about all the historical connections between the two countries that would suit the 75th anniversary of the Black Armada.\"\n\nBlack Armada is at the Australian National Maritime Museum until February 24, 2016. The story first appeared on The Sydney Morning Herald.", "source": "Warrnambool Standard"}