{"published": "2015-09-08T10:11:08Z", "media-type": "News", "title": "Iowa Employer Health Insurance Premiums Increase 7.7 Percent", "id": "2cec9213-47ba-4c3d-b733-3ac868c45bf3", "content": "Iowa employer health insurance premiums increased an average of 7.7 percent from 2014 to 2015.  This increase is an average that factors in employers receiving an increase, decrease, or no change in their premiums. The Iowa average represents the premium increase employers received prior to making design changes to their medical insurance plans. \n \nDes Moines, Iowa, \n\t\t\tSeptember 8, 2015\t(Newswire) - ​Due to rising health premiums, Iowa  employers are asking employees with single (employee-only) coverage to contribute 22.4 percent more in 2015 compared to the previous year. Employees with family coverage must also pay more, with an  increase of 5.5 percent. Deductibles paid by employees are also moving upward, with double-digit increases. \n \nThis is all according to the 2015 Iowa Employer Benefits Study ©, the 17th annual study conducted by David P. Lind Benchmark of Clive, an employee benefits research firm. One-thousand-one Iowa employers participated in this year’s survey. \n \nThe study also found that Iowa employer health insurance premiums increased an average of 7.7 percent from 2014 to 2015.  This increase is an average that factors in employers receiving an increase, decrease, or no change in their premiums. The Iowa average represents the premium increase employers received prior to making design changes to their medical insurance plans.  After the health plans were modified by employers, such as increasing employee cost-sharing arrangements, the increase over last year was 2.8 percent for single premiums and 4.6 percent for family premiums. During the similar period, wages for Iowans increased by 3.4% (source: Iowa Workforce Development).  The study also showed: \n \nThe combined average annual premiums for all types of medical plans offered by Iowa employers (HMO, PPO , Traditional Indemnity and Consumer-Driven Health Plans) were $6,143 (up 2.8% from 2014) for employee-only coverage and $15,668 (up 4.6%) for employees who include family members.  Since 1999, the year this study began, the single premium has increased by 198 percent while the family premium has increased by 184 percent. \n  \n \nEmployees are asked to contribute over $93 monthly for employee-only coverage, an increase of 22.4 percent compared to last year. Employees with family members are asked to pay over $417 a month, a 5.5 percent increase over last year ($395). Over the course of 17 years (1999-2015), employee contributions have increased by 140 percent for single coverage and 132 percent for family coverage.  In sharp contrast, the Iowa Workforce Development shows the average weekly wage (for all industries) earned in Iowa increased by 42.7 percent between 2000 and 2014. It is important to note that employers continue to pay about 82 percent of the total single premium and 68 percent of the family premium - similar to results from past studies. \n \nThe average deductibles that employees are required to pay has surpassed the 2014 deductibles by $252 for single coverage and $362 for family coverage, representing increases of 18 percent and 12 percent, respectively. The 2015 average deductibles are now $1,662 single and $3,381 family. \n \nAs health insurance costs continue to rise, employers vigilantly pursue different approaches to contain their health insurance costs by: \n  \n \nPassing some or all of the increased costs to their employees (54 percent) \n \nAbsorbing the entire cost increase (31 percent) \n \nIncreasing deductibles (18 percent) \n  \"Cost control through additional cost-sharing with employees, having more competition within the marketplace, and driving employee behavioral changes are just a few of the key desires that employers continue to have when offering health coverage.\"  \nDavid Lind,\n\t\tPresident of David P. Lind Benchmark \n   \nRaising employees’ out-of-pocket costs (15 percent) \n \nChanging insurance companies (13 percent) \n \nIncreasing co-payments for office visits (11 percent) \n \nIncreasing prescription drug co-payments (8 percent) \n \nReducing pay raises or bonuses (7 percent) \n \nOffering Consumer-Driven Health Plans (4 percent) \n \nHiring fewer new employees (4 percent) \n \nBeginning wellness program initiatives (3 percent)   \n \n\nThis year, 76 percent of employers reported offering health coverage, a slight decrease from 81 percent from last year.  The most apparent reason for this decrease is that fewer employers with less than 10 employees are reportedly offering health insurance. \n \nUsing a 6-point scale, where 1 means “not at all important” and 6 means “most important,” Iowa employers were asked to rate the importance of five key healthcare outcomes they hope to achieve. \n \nOverall, employers responded that “lowering the health risk of employees” was most important, scoring 4.9. “Reducing long-term healthcare costs” and “increasing employees’ awareness of health issues to enable them to make better decisions” followed closely at 4.8 and 4.7, respectively. The final two outcomes were “increasing participation in wellness and health improvement” at 4.3 and “increasing employee use of tools and information on provider price and quality,” scoring a 4. \n \nAs for challenges employers face when providing health coverage, “the unpredictability of healthcare costs” and “motivating employees to accomplish healthier behaviors” were two of the top challenges. \n \nMost Iowa employers - 61 percent - believe that having more insurance companies competing will keep health premiums lower. Interestingly, 80 percent of employers with over 1,000 employers felt more competition is necessary.  Asked if hospitals acting as insurance companies would have incentives to control costs, Iowa employers were evenly split, having no clear consensus that this would benefit the marketplace.", "source": "I-Newswire"}