{"published": "2015-09-06T17:12:55Z", "media-type": "Blog", "title": "World isn't for the weak.", "id": "0418db41-47b4-43fc-b384-e04c8b2202df", "content": "Ever since a little kid I was obese, in sixth grade my weight was 62kilograms, which when I recall is average weight of my classmates in engineering final year! It's not the weight that's important now, it's the humiliation I went through, every hallway I remember where I was ridiculed, people and my mates saying hey fatass, dumbo, motu! I cried, as I was publicly ashamed, both the weight and humiliation grew with my age, in my engineering first year, in the year 2012 I happen to reach my heaviest size and weight 118 kilograms, and yeah the amount of criticism I'd to face too increased exponentially, I was told right on my face that one day I won't fit through one of the class doors, they said to me I eat like elephant and look like elephant, well I'm talking about friends, who said all these right on my face. I was compared to all the funny looking things in the world which are heavy and huge, I cried! But, but, but.....  Posting this today, I currently weigh 90.7 kilograms, and lot leaner, and lot stronger, stronger physically and extremely mentally! I say, the world isn't for the weak minded, it's not about how strong you're either, it's about how deeper you dig in yourself and how hard were you pushed and how strong and tall you bounced back! It's still not how hard the opponent punches you and pushes you to ground, it's all about how much will power you still have to face him/her and say right on the face, \" I'm ready to tear you apart\", remember the opponent here can be anything, it can be the society, it can be your fears it can be the person who insulted you, it can be a disease! I was fighting with me, I was pushing myself to my extreme boundaries, my mind wasn't ready for all the treatment I was giving to my physical body, but still that drop of determination I always had and that mental ego that said, \" shut the hell up and move your ass!\". I am not weak, I'm the stronger me! If you're the one, you can, remember, you're not weak, if not you'll!", "source": "Mr.VReddy"}