{"published": "2015-09-13T18:29:47Z", "media-type": "Blog", "title": "Food for Thought with Alex Bielak - How I “cooked” with @CHEF_LYNN", "id": "031bb5bc-6d01-42a9-8166-a7c1c915b3d0", "content": "How I “cooked” with @CHEF_LYNN\nLife is good. Today is, of course, the 22nd anniversary of the official recognition of the baguette (thanks Mother Google), and I’m just back from the first ever Scottish Salmon Festival in Inverness. As noted in my last column, I took the opportunity of being in Scotland to partake of three splendid and educational tours: at the Scotch Whisky Experience in Edinburgh, and Glenfiddich and Abelour distilleries in the Highlands. I’ll be writing about them later and will provide links once the piece is published.\nRe-entry to the Southern Ontario food scene was swift. I received an invitation to participate in the 5th Stein and Dine in Waterloo. The main draw was Pitchin’ In star and Chopped Canada Judge Chef Lynn Crawford. (Readers may recall Food for Thought covered Crawford’s appearance at Denninger’s Diamond Anniversary about a year ago, but was unable to secure an interview at that time.)\nThe Waterloo gig was clearly going to be my chance!\nIn many ways the Kitchener-Waterloo food and drink scene is poised to take off the way Hamilton-Burlington has prospered during the past three years. KW has long been known for the bounteous St Jacob’s Farmers’ Market, and hosting what National Geographic crowned the best Oktoberfest outside of Munich, Germany. But there’s a lot else going on these days, with fine culinary talent being attracted to the area, new breweries abounding (as befits the area’s Germanic origins) and active social media devoted to the topic. I’ve often directed readers south toward St. Kits, Niagara and Halton: I can heartily recommend going a bit further northward as well. Dave MacNeil, Executive Director of Kitchener-Waterloo Oktoberfest told me the festival now counts four silos: Cultural and family activities, Sports, Business to Business, and Culinary. They’ve brought food “front and center” and while “there has always been the traditional foods like schnitzel, and sausage on a bun available at the fest halls, there will be more food events than ever this year.” There will be a Taste of Oktoberfest culinary series featuring Bavarian-inspired menus and beer pairings, Oktoberlicious (think Taste of Burlington’s prix-fixe menu program), and Oktoberfeast, a food truck gathering with trucks from all over Ontario. For full details see the Oktoberfest website. So there I was at the culinary kickoff, Stein and Dine, for a dinner prepared by Chef Lynn and the staff of the Waterloo Inn. When I finally got to eat it, it was pretty tasty. “My” salad with beer-pickled beets was light and well dressed. A trout schnitzel with pilsner remoulade was a standout, perfectly cooked, quite the trick given the number of portions served. The Applewood-smoked pork chop with sausage gravy was very tender and accompanied by an unusual side: a ham hock, apple and sauerkraut bread pudding.\nDessert was a signature dish from Crawford’s restaurant, Ruby Watchco, a sweet pretzel streusel with airy pumpkin cheesecake, served in a small mason jar. Each of the dishes were well-paired with a Molson product (Creemore Springs lager and pilsner, and Rickard’s Red and White) by Justin Lamontagne, one of only 8 Cicerones (think beer sommeliers) in Canada. You’ll note I said “My” salad. Yes indeed, I ended up on stage, endured a Survivor-style elimination (see photo by Sylvia Pond Photography), and was dressed by Chef so I could prep the salad with her. That involved more of the same, i.e. no, as in zero, handling of food, except for pieces of pickled beet stuffed in my mouth and a bit of jar shaking. Now I admit I had provoked Chef with my comment about silly hats (see photos again), and fully deserved the continuous ribbing I took from her, to the delight of the crowd. I departed the stage arms full: a jar of brown derby dressing, a spoon, a chef’s hat, a cleaning cloth, her book (At Home with Lynn Crawford), and a tube of Rub A535 to soothe my aching arms. As I said later on Twitter, I’m expecting the offers to come rolling in from the fest halls now I’ve proved my mettle as a beer carrier.\nThe thing I did not leave the event with was an interview with Chef Crawford. Third time lucky? To see more pictures, click here. To see all past columns please see (and “like”) the Food for Thought Archives Alex (Alex can be reached at fft@thehamiltonian.info or on twitter @AlexBielak)", "source": "The Hamiltonian"}