{"published": "2015-09-17T14:49:52Z", "media-type": "News", "title": "American Brain Tumor Association Names New Development Director", "id": "59923515-ebce-4f98-a720-4fbe2fb3ef97", "content": "SOURCE American Brain Tumor Association\n\nCHICAGO \n\nPhoto - http://photos.prnewswire.com/prnh/20150916/267378 \n\n\"Debbie is an extraordinary addition to the ABTA, as she joins us with a proven track record in fundraising for health and human service organizations and strong experience in scientific grants administration,\" said Elizabeth M. Wilson \n\nPrior to joining the ABTA, Robins was responsible for enterprise-wide grant efforts that included grant and contract research, collaboration/partnership development, application process, reporting and compliance on federal and private grants and government contracts for the College of American Pathologists (CAP) and the CAP Foundation. \n\n\"I was attracted to the ABTA's mission and the commitment the staff have to truly improve the lives of everyone touched by a brain tumor diagnosis,\" said Robins. \"I believe that through the ABTA's national expansion, more people will become engaged with the cause and support our efforts which is the greatest hope we have for ultimately transforming the brain tumor experience.\"\n\nRobins holds a master's degree in Nonprofit Management from Spertus Institute of Jewish Studies \n\nABOUT THE AMERICAN BRAIN TUMOR ASSOCIATION \n\nFounded in 1973, the American Brain Tumor Association was first and is now the only national organization committed to funding brain tumor research and providing education and information on all tumor types and for all age groups. For more information, visit http://www.abta.org or call 800-886-ABTA (2282).\n\nCONTACT:\n\nJulie Landmesser \n\nLogo - http://photos.prnewswire.com/prnh/20150901/262855LOGO\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/american-brain-tumor-association-names-new-development-director-300144557.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WSFX-TV"}