{"published": "2015-09-21T18:51:23Z", "media-type": "Blog", "title": "More weekend big show feedback", "id": "9d7c66a7-0038-4aa4-96d0-a17b63cb8985", "content": "More weekend big show feedback Monday, 21 September 2015 11:51\tROH- thumbs up\rBest match- fish vs lethal \rthis was a good show...i like the tag title change...i kind of thought the knights of krd flopped. I was at some of the shows they were introduced under the mask and the crowed was always groaning. Looking forward to aj and lethal that should be really good. Adam Cole vs Kyle o'Reilly is always awesome. \rCMLL- awesome main event best match of the weekend. \rla sombra with out the mask errr....i dont know about that. I think there was money left on the table with that one. I love dragon lee this guy is super underrated those matches with kamaitachi are some of the years best stuff. i wish there would be more mixing of njpw and cmll...i would have loved to see some njpw guys on this show and cmll guys on njpw shows. \rbelator dyninite thumbs in the middle 1- this felt like an early an early pride event with older guys fighting young guys, but nothing really stood out. kick boxing in america is always looking for that right match and its never came. \rnight of championships- thumbs up- best Cena vs Rollins  \rit was a good show and i didn't get boarded...I cant say i disagree with anything of the out comes. i thought Cena and Rollins was very good. \rjonathan juett\nWWE Night of Champions\rBest Match: John Cena vs Seth Rollins\rWorst Match: New Day vs Dudleys\rThe Seth Rollins show was quite amazing. Yes he lost to John Cena (and dropped the U.S. title back in the process) but he got to pin a legend, albeit one who has a tainted WWE record (0-2 in big shows). \rNOC was the occasion to have \"legends\" put over future talent. I have more faith in Rollins as a main eventer than I do in Bron Strowman however. Although Jericho does have the unbeatable aura, if they keep bringing him back only to job on PPVs, he'll lose that soon enough – shades of Mick Foley.\rOwens gains back momentum and the program with Ryback has a basis in reality (bashing the self-help books). But where does Owens go from here with a heel champ and Sheamus seemingly ready to cash in his shot at any turn?\rRusev is another heel treading water, doing jobs to Dolph Ziggler and apparently waiting for Lana to return to revive his heat (and his push).\rBravo to Charlotte for grabbing the Divas title. Now it's just a matter of time until they turn Paige and segue the Bellas back to reality TV fulltime (or revive the Divas tag belts for them).\rJeff Cohen\rFlushing, NY\rHow you doin' Dave,\n \nThumbs In The Middle\n \nNeville & Lucha Dragons vs. Stardust & The Ascension ***1/4\nThought the right team won with Cosmic Wasteland being a new faction, and I'm happy to see a feud between wrestlers this far down the card with some legs, as I presume this isn't the end.   \n \nOwens vs. Ryback ***1/2\nThought they rushed certain things but felt it was a good match. Also was very pleased/relieved with the result as they need some heels with some steam and I'm a big admirer of Owens. Having the IC title is seen as a curse nowadays but they looked after Ryback during his reign and hopefully they do the same with Owens.  \n \nZiggler vs. Rusev **3/4\nDidn't really care for most of the match, wasn't really much emphasis or dramatics on anything, was largely just a bunch of moves and didn't think the layout was very good either, it got better towards the end but also got botchy. Glad to see they went with Bryan's finish and interested to see where things go from here.\n \nWorst Match: Dudleys vs. New Day **3/4  \nThis has to be the worst match I suppose on account of the DQ finish, but I was probably the only person pleased to see it. I was hoping to see a three way on this show with The PTPs involved and getting beat, as I felt it was too early to beat The Dudleys or for New Day to lose the titles, this accomplished that. I guess I'm too old school, but the trombone has to go! Not that I don't find Woods entertaining, but the heat section of the match isn't supposed to be overly exciting, in one aspect to give the crowd an incentive to get behind the babyfaces, the trombone negates that. And much like Mizdow, Woods' antics are killing the babyface team.      \n \nNikki Bella vs. Charlotte ***\nI thought this was a good effort by the ladies and felt Charlotte performed very well in the match. However I will say I felt the story-spots ratio was a little off, thought the work on the leg was a bit heavy and feared at numerous points they would lose the crowd, but luckily they didn't. Also Nikki never really gave Charlotte any space to sell, she was just on her, on her, on her. On another note I'm gaining optimism for the divas revolution as it appears to have taken strides forward the last week or so.\n \nWyatts vs. Ambrose, Jericho & Reigns ***1/2\nThought this match was better than the feud's outing at Summerslam and thought Strowman's involvement was laid-out very well. Numerous thoughts went through my head towards the end of the segment as at one point I thought Strowman was getting beat and it was the end of him, then I was shocked to see Jericho get beat on his return as it takes the wind out of his sails, then I was/am interested to see whether this develops into a Jericho heel turn which would be beneficial to the roster, or, whether it was to establish the end of the alliance and Jericho's return was a one night thing.\n \nBest Match: Cena vs. Rollins ***3/4\nLots of nice pretty moves and sequences during the match and wasn't as irritating as some of Cena's recent PPV encounters, but still a little too much sizzle and not enough steak for me. However can't discount it was a very good match. Best part of the match for me was when the crowd started doing the Mexican Wave and the performers regained control by Rollins conducting the wave, whomevers idea that was whether it be Cena or Rollins it was excellent. Also a Japanese style finish where Cena hit three moves in a row before pinning the guy was nice to see.\n \nRollins vs. Sting ***3/4\nIf it wasn't for the unfortunate incident with Sting at the end of the match this would've been my match of the night easy. Yes, I realise Rollins was very much the glue in this match but at 56 years old Sting was absolutely incredible. Really good pacing, good fundamentals, good building, good layout, nice spots, thought it was very good. Plus, Rollins got a clean win!\n \nThanks Dave\n \nTom Griffiths\nThumbs Down, think every match under delivered...\rBest:  Rollins vs. Cena. (US)    ***1/4     same as we've seen on Raw multiple times over the past year, not as good as SummerSlam\rWorst:  Nikki Bella vs. Charlotte (Divas).   1/2*    Utter failure, felt like Charlotte would have accomplished something by both winning the title and denying the record, but just winning the title means nothing as we have another largely undeserving champion\rRyback v. Owens. (IC)   **1/2  (that this was the best match of the first half of the show is a big problem)\rZiggler v. Rusev.   **\rNew Day vs. Dudleys (Tag).   *3/4\rNikki Bella vs. Charlotte (Divas).   1/2*\rWyatt Family vs. Reigns/Ambrose/Jericho **3/4\rRollins vs. Cena. (US)    ***1/4\rRollins vs. Sting (WWE).   ***\nEd Branscomb\rWWE Night of Champions: Thumbs Up\rBest Match: Cena vs. Rollins\rWorst Match: Ryback vs. Owens\r \rThe preshow six man was a fun way to kick things off.  It's amazing how Neville was NXT Champion and now he is on the losing end of the preshow.  Not like I should have expected him to actually be treated somewhat better than this.  I guess this feud continues.\r \rKevin Owens winning the I-C Title sounds good in theory, but will he be like all the most recent Champs and actually be worse off in the end?  Match was okay and I'm getting real tired of the roll up finish.  It's being used far too often.\r \rZiggler vs. Rusev was mostly a good match and I hope this feud is over.  Looks like Summer Rae is back to no storyline and not sure where Lana fits in now.  Remember when Rusev wasn't in a meaningless undercard feud?  Oh wait I can say that about almost the entire roster at this point.\r \rTag Title match was fun and I guess they had to do the DQ to keep the program going since it was too soon to put it on the Dudley's.  I guess they will meet again.  It's not like there are any other real times on the horizon right now.\r \rWas nice to see Charlotte win the Divas Title and celebrate with Ric, but still not as good as the NXT women's matches.  I also didn't like how they talked about the history of the Divas title and forgot to mention that everyone they talked about was a Women's Champion before the Divas Title ever existed.  They need to split these teams up though as it isn't really helping anyone I don't think.\r \rSix man tag was fine and I was happy to see Chris Jericho, but had a feeling he was doing the job when he came out.  Not sure about his possible heel turn though unless he is sticking around to feud with Ambrose maybe. \r \rCena vs. Rollins once again top match on the show like last month, although not as good as Summer Slam.  I guess the U.S. Open Challenge will be back on Raw tomorrow.\r \rSting vs. Rollins was good overall.  Too bad Sting got hurt during the match and honestly not sure if Sting will ever have a victory in his WWE tenure.  I don't count that nonsense from Raw against the Big Show.  Not sure I want to see Kane vs. Rollins for the title however.\r \rWell at least Lesnar vs. Taker in Hell in a Cell next month so that should be good I guess.  It says it is the final time so I guess that means they have new plans for Taker at Mania next year.\r \rRobb Block\r \r \rTweet\nShare", "source": "WON/F4W - WWE news, Pro Wrestling News, WWE Results, UFC News, UFC results"}