{"published": "2015-09-22T16:53:00Z", "media-type": "News", "title": "Gallant right to nudge Ottawa about health, CMA says", "id": "448b226e-2b40-4ebf-9a1e-91a4a34dc60a", "content": "FREDERICTON , Sept. 22, 2015 /CNW Telbec/ - New Brunswick Premier Brian Gallant is right to demand a new deal on health transfer payments to the provinces and territories from the federal government, Dr. Chris Simpson , Past President of the Canadian Medical Association (CMA), said today. \n \nDr. Simpson was commenting on a speech by the premier Monday night before a public meeting on the state of seniors care in New Brunswick . The New Brunswick Medical Society (NBMS) and the CMA were joint hosts. \n \nGallant told the meeting it makes absolute sense to provide additional support to provinces so they can deliver quality care to their aging populations.  His province is tied with Nova Scotia as having the highest percentage of residents over age 65 in Canada at 18.3 per cent. \n \n\"When it comes to health we need a federal government that is going to help us,\" Gallant said. \n \nSaid Dr. Simpson: \"We couldn't agree more.\" \n \nAll levels of government need to be proactive about health care, Gallant said, especially with investments in long-term, community and home care to make seniors' hospital stays much shorter. \n \n\"We want to get seniors out of hospital when they should be at home,'' Gallant said, adding he supported the CMA's call to make tax credits for caregivers refundable in order to help seniors stay home longer. \n \nThe premier also said he very much appreciated the efforts of the CMA and the NBMS to make seniors care an issue in the Oct. 19 federal election campaign. \n \n\"The message we are hearing is that the provincial government and health professionals are both asking for partnerships – in our communities, provincially and even nationally,\" said Dr. Camille Haddad , President of the New Brunswick Medical Society. \"Just as seniors have supported our economy and families through difficult times, we need to work together to support them now.\" \n \nMonday was the first of two days of meetings on the future of seniors care in New Brunswick . Today doctors, government and health professionals are discussing solutions that will be turned over to the New Brunswick government for an emergency summit next month. \n \n\"These two days will show that doctors, patients, health professionals and public officials can work together for better health care,\" Dr. Simpson said. \n \nThe Canadian Medical Association (CMA) is the national voice of Canadian physicians. Founded in 1867, the CMA is a voluntary professional organization representing more than 80,000 of Canada's physicians and comprising 12 provincial and territorial medical associations and 60 national medical organizations. CMA's mission is helping physicians care for patients. The CMA will be the leader in engaging and serving physicians and be the national voice for the highest standards for health and health care. \n \n  \n \nSOURCE  Canadian Medical Association \n \nFor further information:  Email: mediainquiries@cma.ca, Tel: 613-806-1865 \nRELATED LINKS \nhttp://www.cma.ca", "source": "Canada NewsWire"}