{"published": "2015-09-04T15:24:50Z", "media-type": "News", "title": "TSX slides as rate moves uncertain following labor data", "id": "4ea08387-5df4-4539-816c-52c08fabb90a", "content": "Canada's main stock index fell broadly on Friday as mixed employment data provided little clarity for investors hoping to receive more guidance ahead of this month's central bank monetary policy meetings on both sides of the border. \r  \nJob growth in the United States slowed in August, rising 173,000, while the unemployment rate dropped to a near 7-1/2-year low and wages accelerated. Canada unexpectedly added 12,000 new jobs last month, versus the expected decline of 4,500, but the country's unemployment rate hit 7 percent, a one-year high. \n \n\"At the end of the day, when you look at the data release this morning, there isn't a clear answer and if there's one thing the market doesn't like, it's uncertainty,\" said Patrick Blais, senior portfolio manager at Manulife Asset Management. \n \n\"The market's just having trouble reading the timing of the (Federal Reserve's) rate increase. I think that's just throwing the market off. There's a little bit for everyone, but at the end of the day, no one's happy.\" \n \nBlais said the odds of the Bank of Canada cutting rates have dropped heading into the meeting next week, but added that headwinds in Canada remained fairly strong, and that the improving trends were not sustainable. \n \nAt 11:06 a.m. EDT, the Toronto Stock Exchange's S&P/TSX composite index <.GSPTSE> was down 119.1 points, or 0.88 percent, at 13,477.31. It weakened more than 1 percent earlier, to touch 13,445.72. Healthcare was the lone gainer among the index's 10 most significant sectors. \n \nThe biggest drags on the index were Royal Bank of Canada  ( >> Royal Bank of Canada ) , which fell 1.7 percent to C$70.76, and Toronto-Dominion Bank  ( >> Toronto-Dominion Bank ) , which declined 1.6 percent to C$50.98. \n \nThe hefty and influential financials retreated 1.4 percent, with seven of the top 10 losers all falling within the sector. \n \nDespite less volatility in crude prices on Friday, energy stocks were also performing poorly, slipping 0.8 percent. Canadian Natural Resources  ( >> Canadian Natural Resources Limited ) was down 2.9 percent at C$27.51. \n \nMaterials, home to mining companies, gave up 1.2 percent. \n \nIn corporate news, BlackBerry Ltd  ( >> BlackBerry Ltd ) said it will buy rival mobile software provider Good Technology Corp  ( >> Good Technology Corp ) for $425 million. Shares were up a modest 0.8 percent. \n \nDeclining issues outnumbered advancing ones on the TSX by 179 to 64, for a 2.80-to-1 ratio on the downside. \n \n(Reporting by Solarina Ho; Editing by Matthew Lewis) \n \nBy Solarina Ho", "source": "4 Traders"}