{"published": "2015-09-15T12:30:00Z", "media-type": "News", "title": "USDA and Department of Defense Announce Agriculture Education Effort that will Reach 200,000 Transitioning Military Service Members Each Year", "id": "e0917013-2c3a-4998-9db3-515fe0584a3d", "content": "WASHINGTON – Agriculture Deputy Secretary Krysta Harden and Dr. Susan Kelly, Director of the Department of Defense's Transition to Veterans Program Office, today announced the integration of agriculture into the career training and counseling programs Service members receive as they transition out of the military. Information about USDA resources and programs will now reach 200,000 transitioning Service members every year. \n\n\"Rural America disproportionately sends its sons and daughters to serve in the military. When Service members return home, we want them to know that rural America has a place for them --no matter where they're from,\" said Deputy Secretary Harden. \"This expanded collaboration between USDA and DOD will help to ensure that returning Service members know that there are a wide variety of loans, grants, training and technical assistance for veterans who are passionate about a career in agriculture, no matter their experience level.\" \n\n\"Our transitioning Service members leave the military with a variety of essential skills - including leadership and discipline - that could be directly applied to a career in agriculture,\" said Dr. Susan S. Kelly, Director of the Department of Defense's Transition to Veterans Program Office. \"For those members who are considering farming or ranching as a post-service career, I encourage them to learn more about the opportunities, preferences, and incentives offered by the USDA.\" \n\nEvery year, approximately 200,000 Service members complete the Transition Assistance Program as they prepare for civilian life. This partnership will help to ensure that returning Service members know about the incentives for military veterans in USDA programs, and the many ways USDA can support military veterans and their families, from farm loans to conservation programs to nutrition assistance to rural rental housing and homeownership opportunities. Veterans can also visit www.usda.gov/veterans , a website designed specifically to educate them about USDA programs. \n\nSince 2009, USDA has provided $438 million in farm loans to help more than 6,482 veterans purchase farmland, buy equipment and make repairs and upgrades. Our microloans, which offer smaller amounts of support to meet the needs of small- or niche-type farm operations, have also grown in popularity among veterans. Since it was launched in January 2013, USDA's microloan program has provided more than $22.6 million in support to help 1,083 veterans grow their farming businesses. \n\nToday's announcement reflects USDA's continued commitment to assisting veterans as they start or expand farming and ranching operations, in order to strengthen the American economy and provide livelihoods to our returning veterans. Today, more than 5 million veterans live in rural areas, a higher concentration than in any other part of the country. \n\nOur veterans have incredible stories to share, including: \n\nVeteran Farmers, In Their Own Voice \n\nPlanting Seeds for New Careers for our Veterans \n\nVirginia Farmer Balances Family, Farming and Flying with the Air National Guard \n\nRead more stories about veterans in agriculture at http://blogs.usda.gov/tag/veterans/ .", "source": "Prairie Star"}