{"published": "2015-09-25T00:45:45Z", "media-type": "Blog", "title": "Verizon begins offering annual iPhone upgrade plan", "id": "79f1959f-94f1-46ca-b37d-c1c4567b4108", "content": "Verizon begins offering annual iPhone upgrade plan Under the new arrangement, customers who buy one of Apple's newest smartphones on the monthly payment plan can get a newer iPhone model in a year. by Steven Musil @stevenmusil September 24, 2015 5:36 PM PDT Updated: September 24, 2015 5:45 PM PDT Verizon's new upgrade program promises a new iPhone every year. Andrew Hoyle/CNET Verizon is joining the move toward annual smartphone upgrades.\nThe largest US wireless carrier announced Thursday that customers who purchase Apple's smartphone when it goes on sale Friday will have the option of upgrading to the latest iPhone model each year. To qualify, customers must choose Verizon's monthly device payment option, rather than the device's full-cost option, and turn in their previous iPhone each year. Under the program, people who buy the iPhone 6S or 6S Plus through Verizon will be able to upgrade to an iPhone 7, or whatever the new iPhone is called, when it debuts next year, without having to worry about paying off the balance on their existing iPhone, a Verizon spokeswoman said. That means customers will be responsible for making only half the monthly payments for their existing iPhone when they're allowed to upgrade to the newer model, while still continuing their monthly payments.\n\"They get to upgrade and not worry about what they owe,\" a Verizon spokeswoman said. \"Alternatively, they can keep making payments for 24 months and when they have paid for the phone turn it in and get a trade-in value.\"\nThe New York-based wireless carrier's upgrade program comes as wireless operators are moving away from traditional two-year contracts and the device subsidies that come with those plans, and instead are requiring customers to pay full price for devices. T-Mobile was the first major US carrier to abandon contracts, more than two years ago. Verizon recently announced that it's doing away with the two-year contract for new customers. Though this is the first time Verizon has offered an iPhone upgrade program, it's not the first company to do so. Earlier this month, Apple unveiled its own device upgrade program for customers who want to buy a new iPhone 6S or iPhone 6S Plus without agreeing to a carrier contract. The new program will let customers upgrade to a new iPhone every year for a monthly fee. Apple will continue to offer iPhones for customers who still want traditional two-year contracts.\nCarriers have also started to promote no-interest payment plans for premium smartphones, which tend to come with hefty price tags. T-Mobile and Sprint also offer leasing programs. Sprint recently announced a plan that lets customers lease a new iPhone for $15 a month with the option to upgrade at any time.\nFollowing Apple's lead, Samsung is reportedly planning to introduce a program in the next couple of weeks that will lease its flagship Galaxy smartphones to customers in the US market. Tags: Mobile Verizon Previous Story Crave Ep. 220: Rescue drones build rope bridge strong enough for humans About the author Steven Musil Steven Musil is the night news editor at CNET News. Before joining CNET News in 2000, Steven spent 10 years at various Bay... See full bio Comments More From CNET", "source": "CNET News"}