{"published": "2015-09-24T20:00:22Z", "media-type": "News", "title": "Incarceration is not an American problem; It is a Black male American problem", "id": "a10ae4f5-e655-4610-b2f7-53797c3d3349", "content": "While I am understanding of the premise of the powerful new piece by Ta-Nehisi Coates in the Atlantic, “The Black Family in the Age of Incarceration ,”  in the article the core of the problem gets shaded with a color of shared struggle with the criminal justice system that fails before statistics. \n \nAs a former prosecutor, I believe in the end either through limitations on involved expertise, or simple lack of awareness, he like most writers misses the point on the issue of imprisonment. Incarceration is not an American problem; it is primarily a young Black male American problem. \n \nWhile Coates does later in the piece talk specifically about the issues faced by Black males within mass incarceration, by starting with the general position so often presented of incarceration as a national experience, it any many aspects diminishes the impact of this later analysis. \n \nTo say that the US accounts for 5 percent of the world’s population, and 25 percent of its incarcerated, is to in many ways deny the reality that young African American men are therefore over 12 percent of the world’s incarcerated, and are less than .25 percent of the world’s population. \n \nHow did we get here? To a place where a group that are descendants of American slavery somehow became the targets of the constitutional changes that allowed for a form of slavery only when imprisoned.  And further, how do we ever get away from its grips without true acknowledgment of the problem? That is the story; the generic version, is just generic. \n \nWe see the impact of this in media, from the differences between perceptions of Sean Penn and Terrance Howard as pointed out by Lee Daniels, producer of Empire when he stated \n \nHoward “ain’t done nothing different than Marlon Brando or Sean Penn, and all of a sudden he’s some f—in’ demon,” Daniels said . “That’s a sign of the time, of race, of where we are right now in America.” \n \nWhereas Penn can stand on never having been arrested, Penn fails to acknowledge why this is the case. How in application decisions are made with the same facts that allow for him as a White male to walk away unscathed socially from the same incident, that Terrance Howard cannot despite possible similar facts. When the cops come out to your home in the hills for a disturbance call, who has to go to the station, and who gets to go back inside is driven in large part by race and gender. It is this reality that Daniels attempted to compact into the opening scenes of Empire with the #freelusciouslyons scene. \n \nIn his piece Coates states: \n \nFrom the mid-1970s to the mid-’80s, America’s incarceration rate doubled, from about 150 people per 100,000 to about 300 per 100,000. From the mid-’80s to the mid-’90s, it doubled again. By 2007, it had reached a historic high of 767 people per 100,000, before registering a modest decline to 707 people per 100,000 in 2012. In absolute terms, America’s prison and jail population from 1970 until today has increased sevenfold, from some 300,000 people to 2.2 million. The United States now accounts for less than 5 percent of the world’s inhabitants—and about 25 percent of its incarcerated inhabitants. In 2000, one in 10 black males between the ages of 20 and 40 was incarcerated—10 times the rate of their white peers. In 2010, a third of all black male high-school dropouts between the ages of 20 and 39 were imprisoned, compared with only 13 percent of their white peers. \n \nOur carceral state banishes American citizens to a gray wasteland far beyond the promises and protections the government grants its other citizens. \n \nWhile I respectfully agree with the general premise, to say there is a banishment of American citizens is to deny the reality of the numbers. The numbers unequivocally show one group, among all others holds the weight of mass incarceration, and thus bears the brunt of its unforgiving social consequence, young black males. \n \nAs I showed in my piece Black Male Incarceration Problem is Real and Catastrophic “In fact, there are more African American men incarcerated in the U.S. than the total prison populations in India, Argentina, Canada, Lebanon, Japan, Germany, Finland, Israel and England combined .” \n \nWhile I do not think Coates is saying this is not the case, and later admits many examples of the systems impact on black males throughout his piece. I believe the failure in our analysis of incarceration has been to allow for it to be evaluated as though everyone goes to jail too much;Bblack males are just higher in rate. When in application, young Black males, or possibly those that are brown with the same attributes are the bulk of the imprisoned. This is the basic fact of the statistics, I have written on it on sites from the theGrio to the Huffington Post. \n \n\n \nThe numbers are so skewed, that most subgroups hardly go to jail at all, women of all races are incarcerated at a rate of about 200 per 100,000 on average, most Asians hold nearly the same rate or lower as all women for both genders. We all commit crimes, the question is about who is arrested, who is convicted and massive disparities in sentencing. If you take young black males out of the equation incarceration rates in America are much more in line with the rest of the world. How can a group that is 6 percent of the American population bear so much of the societal cost? \n \nIn the piece, “Men Sentenced To Longer Prison Terms Than Women For Same Crimes”, the role gender plays in sentencing after conviction was reviewed. \n \nSonja Starr, an assistant law professor at the University of Michigan, found that men are given much higher sentences than women convicted of the same crimes in federal court. The study found that men receive sentences that are 63 percent higher, on average, than their female counterparts. \n \nCompounding the above discrepancy in incarceration between genders, is a gap in punishment between black and white men . Black men often get longer sentences than white men for the same crime. The Wall Street Journal article, “Racial Gap in Men’s Sentencing” states, “… sentences of black males were 19.5 percent longer than those for whites.” \n \nThese disparities aren’t explained by genetic, or social variation between the genders and races. The differences are the result of systemic bias in arrest, convictions, and sentencing. African American men are largely incarcerated for poverty crimes such as low-level drug offenses, failure to make child support payments and driving without a license. As stated by Columbia University Professor of Education and African American Studies, Marc Lamont Hill on MSNBC. \n \nWe want be careful not to suggest mass incarceration is due to some kind of cultural poverty, as if poor people or black people are more prone to go to prison. The fact is black people are targeted to go to prison more. If I went to Harvard University or Princeton University on a Friday night I could arrest a lot of people for simple possession of drugs, for public drunkenness, public urination or disorderly conduct. But, were not looking at Harvard or Princeton. We go to poorer neighborhoods like in New York where 3 counties produce 70 percent of the state’s prisoners. \n \nIncarceration has been one of the most misused instruments in America’s social tool box. The question now is how to correct the problem and use it to properly punish those that are actually criminals regardless of race, gender or religious beliefs, and truly move past this dark unequal moment in time. To do that we have to get honest and acknowledge the problem to fix it. \n \n  Antonio Moore is a former prosecutor in Los Angeles. He is also one of the producers of the documentary on the Iran Contra, Crack Cocaine Epidemic and the resulting issues of Mass Incarceration “Freeway: Crack in the System presented by Al Jazeera” . Mr. Moore has contributed pieces to theGrio, Huffington Post and Eurweb on the topics of race, mass incarceration, and economics. \n \n[embedded content]", "source": "New Pittsburgh Courier"}