{"published": "2015-09-29T20:35:46Z", "media-type": "Blog", "title": "It’s Not Easy Being Green", "id": "b0181135-82e7-4a8a-9ee2-bb79dcd54f1a", "content": "Preservation versus conservation? To protect or to use wisely? Wilderness versus the nature in our own backyards? Dichotomies such as these demonstrate the often confused and polarizing relationships that humans have with nature. Throw in the words “business” or “profit” and you might just start an intellectual, if not an actual fist fight. So just how are businesses supposed to sincerely embrace the “green” revolution, while simultaneously striving to increase profitability? Before we tackle that conundrum of a question, let’s first take a brief look at how humans think about nature. \n \nIn the most basic sense, we often fall into one of two camps (although we often wander between them): One camp says that we have to preserve nature for its own sake – that the “value” in nature is intrinsic to itself, and that we tend to just destroy nature for our own selfish reasons. In this scenario nature is something to be fenced-off and protected from the onslaught of human greed. The other camp says no way, “tear down the fences,” nature is there for our use. Proponents of this conservation ideology say we should use natural resources carefully and wisely, but use them we must. In our increasingly polarized culture, even suggesting that there’s wisdom on both sides of the divide can be a tough sell. \n \nWhere does this leave businesses? Are the ideas of profitability and sustainability even compatible? Can a business exist in a kind of environmental demilitarized zone, where they unashamedly pursue profit, while in a real, tangible way seek to differentiate themselves as environmental stewards? At Taylor Studios we’ve embraced “green materials” throughout the processes of museum exhibit design and fabrication. \n \nAs the wood shop lead at Taylor Studios, I’m responsible for sourcing all the materials that come through our department. What are some examples of green materials that we use? Here are just a few: \n  Water-based contact adhesives: non-flammable and they don’t stink!  Water-based lacquers: no fire-related worries in the spray room, and they actually dry quicker than many solvent-based products.  “GreenGuard” certified traditional lacquers: While still being solvent-based, they have much less VOC content (volatile organic compounds) than traditional finishes.  Formaldehyde-free plywood & panel products: non-toxic adhesives eliminate off-gassing problems, and make an extremely strong bond.  Ultra-light panel products: also formaldehyde-free, with the benefit of being almost half the weight of traditional board.  FSC Certified (Forest Stewardship Council) hardwoods and plywood products from sustainably grown plantations.  Reconstituted Wood Veneers: several companies produce high-quality veneers from the waste products of traditional manufacturing. They look beautiful and perform very well in the real world.   \nThe key to enticing more companies to embrace “green” materials is to make those materials more available, higher in quality, and more competitively priced than their traditional counterparts. We’re seeing that happen at an accelerating pace. Over just the past five years green materials have improved to the point that operating with status quo, old-school materials is often simply a bad business idea. I think the next 5 years will bring even more innovation and green-profit potential. \n \nILLUSTRATIONS | MATT WILEY", "source": "Behind the Scenes at Taylor Studios"}