{"published": "2015-09-08T09:52:31Z", "media-type": "News", "title": "Refugee crisis raises issues of religious discrimination in wartime", "id": "d2ffac63-c9d8-40bb-89e0-b38f47bbe75a", "content": "Religious preferencing is only thinly removed from racial preferencing with refugees, and makes people in a pluralist democracy uncomfortable. \n\nOne of the legal arguments used to justify the extension of the Iraq bombing mission into Syria, is known as the responsibility to protect.\n\nWhile Canberra has been more inclined to the US-nominated justification of the \"collective self defence\" of Iraq – at whose invitation we and the US are waging war against Islamic State insurgents – the responsibility to protect has obvious attractions for any \"just\" society.\n\nThis most basic obligation owed by the strong to the vulnerable, is also a viable justification for a non-discriminatory crisis-based refugee policy.\n\nAnd right now, that is what the Abbott government is weighing. Within the question of how many to take – Labor says 10,000, the Greens nominate 20,000, and at least one Liberal, 50,000 – there are legitimate, and perhaps some less legitimate arguments to be mulled.\n\nOne such argument is the idea being pushed mostly (but not exclusively) from the conservative right, for a Christians-first policy. That is, if we must increase the intake from Syria, then we should do it with Syrians most like us.\n\nIt is an argument with some attractions - at least superficially. And it is one, which reading between the lines, seems to have found favour with Tony Abbott who says the people of Syria are caught \"between the hammer of the death cult and its mass executions and the anvil of the Assad regime and its chemical weapons\".\n\n\"What we need to do is to try to ensure that people can be safe in country as well as trying to ensure that people can be safe out of country and that people who are in camps, particularly persecuted minorities, women and children, have the prospect of a better life,\" he told parliament.\n\n\"Persecuted minorities\" is a term being read as code for Christians, and that inevitably will be read as a statement against Muslims.\n\nOther ministers have been more explicit with both Malcolm Turnbull and Eric Abetz - neither of whom is too fond of the other - specifically advocating a Christian bias. Julie Bishop has also noted the plight of Christian minorities in the Middle-East arguing their situation will remain precarious beyond the current war.\n\nThere is an argument that Christian minorities in Syria are among the most vulnerable and therefore deserve help. But there is also a suspicion that many on the right rather transparently use this argument ex post facto to bolster the view that Christians will be more easily integrated in Australia.\n\nIn any event, religious preferencing is only thinly removed from racial preferencing and thus makes people in a pluralist democracy uncomfortable. As NSW Premier Mike Baird has noted, the desirable approach is a non-discriminatory immigration policy based on the merits of each claim for safe haven.\n\nFollow us on Twitter The story first appeared on The Sydney Morning Herald.", "source": "Nambucca Guardian News"}