{"published": "2015-09-09T04:52:40Z", "media-type": "Blog", "title": "Sleep Apnea May Hurt Kids' Grades", "id": "7c76c5e0-b44b-43e8-a103-4b023f003820", "content": "smallermediumlarger\rSleep Apnea May Hurt Kids' Grades\rCauses of Fatigue Slideshow Pictures\rTake the Sleep Quiz\rFoods That Help or Harm Your Sleep Slideshow Pictures\rBy Tara Haelle\nHealthDay Reporter\nLatest Healthy Kids News\rMore High School Athletes Using 'Dip' and 'Chew'\rStrep Throat: How Soon Can Kids Go Back to School?\rHealth Tip: If Your Child Chooses Unhealthy Foods\r1/3 of U.S. Kids With ADHD Diagnosed Before 6\rDay Care Won't Cause Aggressive Behavior in Child\rWant More News? Sign Up for MedicineNet Newsletters!\rTUESDAY, Sept. 8, 2015 (HealthDay News) -- When children have sleep troubles due to breathing problems -- such as sleep apnea -- they may struggle in school, new research suggests.\n\"Sleep apnea may not be directly causing academic problems,\" said study lead author Barbara Galland, a research associate professor at the University of Otago in Dunedin, New Zealand.\n\"Instead, sleep apnea may interfere with getting a good night's sleep, which may, in turn, contribute to children having a hard time paying attention and being less ready to learn and perform academically during the day,\" she said.\nSleep apnea is a type of sleep-disordered breathing, or irregular breathing while asleep. A person with sleep apnea frequently stops breathing for short periods of time, according to the U.S. National Institutes of Health.\nThis new study looked at the results of more than a dozen individual studies. Although it couldn't prove cause and effect, most of the research accounted for other major factors that could influence school achievement, Galland said.\nThe findings were published online Sept. 7 in the journal Pediatrics.\nThe researchers reviewed the results of 16 studies dealing with sleep apnea or related disorders in children and academic achievement. The investigators found that children with sleep-disordered breathing did worse in language arts, math and science tests compared to those without such conditions. \"If a large sample of children without sleep-disordered breathing achieved an average 70 percent score for a test examination,\" Galland explained, \"a comparable sample of children of the same age with sleep-disordered breathing would be estimated to achieve an average score 11 percent below (59 percent).\"\nThe children with sleep apnea didn't have worse performance in school overall, but one reason for this result may be differences among the studies included in the analysis, the researchers suggested. Further, more of the children with sleep apnea had unsatisfactory progress or learning problems than kids without sleep apnea.\n\"Although many studies find that the average achievement of children with sleep-disordered breathing remains in the range of typical children, some children with sleep-disordered breathing may be performing less well on the tests,\" Galland said. \"What we do not know is, which children are more likely to do less well.\" If a child receives treatment for sleep apnea, it's unclear how much that might affect academics, Galland said. The research is mixed, with some studies suggesting children can focus better when their sleep apnea is treated, she said. Dr. Holger Link is a pediatric pulmonology and sleep medicine doctor at OHSU Doernbecher Children's Hospital in Portland, Ore. He said, \"How well an individual child will respond to surgery may vary depending on the severity and duration of sleep apnea and other factors like age, genetics, other health or mental problems, emotional and educational resources at home.\" The same is true for the condition itself, he added.\nLink said each child responds differently. \"You could have two children of the same age and gender with the same severity of sleep apnea and one of them will have minimal problems with academic performance and the other may suffer significantly,\" he said.\nSleep apnea that goes untreated can also increase the risk of high blood pressure, heart attack, obesity and type 2 diabetes, according to the U.S. National Institutes of Health.\n\"Given the potential adverse consequences of sleep-disordered breathing on health, behavioral and learning outcomes in children, it is important for parents and clinicians to recognize symptoms of sleep-disordered breathing,\" Galland said. One such symptom is snoring, said Dr. Danelle Fisher, vice chair of pediatrics at Providence Saint John's Health Center in Santa Monica, Calif. \"Children who snore should be monitored to see if the snoring turns into choking noises, pauses in breathing and sudden gasping for air,\" Fisher said. She recommends parents talk to their child's pediatrician about snoring or similar symptoms. Even a child without clear snoring may show others symptoms, however, Link said. For example: noisy breathing, sleeping with the mouth open, short pauses in breathing, restless sleep and awakenings from sleep.\n\"Some children will complain of sleepiness or decreased energy in the morning or during the day,\" Link said, though not all children will show that sleepiness. \"Some children will be very irritable and moody or have difficulty focusing at tasks at school or at home.\"\nThe American Academy of Pediatrics recommends that all children be screened for snoring, he said. And they should undergo additional evaluation and treatment if it appears that they have sleep apnea.\nCopyright © 2015 HealthDay. All rights reserved.\nSOURCES: Barbara Galland, Ph.D., research associate professor, department of women's and children's health, University of Otago, Dunedin, New Zealand; Danelle Fisher, M.D., vice chair of pediatrics, Providence Saint John's Health Center, Santa Monica, Calif.; Holger Link, M.D., pediatric pulmonology and sleep medicine, OHSU Doernbecher Children's Hospital, Oregon Health and Science University, Portland, Ore.; October 2015, Pediatrics\nNews Articles\r1\r2\r3\r4\r5\rNext Article: More High School Athletes Using 'Dip' and 'Chew' »", "source": "MedicineNet Daily News"}