{"published": "2015-09-29T19:47:01Z", "media-type": "Blog", "title": "The crazy, true-life adventures of Norway's most radical billionaire", "id": "35a5ae88-d671-4843-908e-6d412bd7e539", "content": "The crazy, true-life adventures of Norway's most radical billionaire: \nShawn Tully on Norwegian billionaire Fred Olsen:\nHis presence galvanized and terrified employees in equal measure. Each morning he’d race into the parking lot in a secondhand Oldsmobile 98 sedan, then sprint upstairs to his office. “It was like he never slept,” says one former employee. “He could be really rough when he was mad about something. He could shame you. But you knew why, and you knew you’d screwed up. If you were as passionate as he was, he loved you, but if not, you were gone.” In quieter moments Olsen would regale employees about the lost city of Atlantis or Heyerdahl’s discoveries. They called such sessions “going to the moon.”\n\nThe precursor to “moonshots”?\nAlthough former associates say Olsen is a brutally tough businessman, in our discussions he never mentioned profits and rarely cited numbers when talking about his latest investments. For Olsen, renewable energy is more an ethical calling than a business imperative. His long experience in petroleum production convinces him that the world isn’t facing a shortage of oil or even a future of ultrahigh prices. But renewables are essential, he says, to counter global warming. “If this warming continues, the oceans will rise, and the place we’re sitting now, and many cities, will be under water,” says Olsen, who drives a Tesla Model S. His principal crusade is protecting the Arctic from the drilling and shipping traffic that fracture the polar icecap. “I used to fly over the North Pole, and all you saw was thick, white ice, cracked like the surface of an old painting,” he says. “Now you see lots of black water, and that accelerates the heating of the oceans.”\n\nMaybe the last guy you’d expect to take up such a cause, and he truly champions it. \nBack in his office, Olsen is reflecting on his long career, in which change has been just about the only constant. “Both products and family businesses obey life cycles,” he says. “My mother’s family was in fishhooks and horseshoe nails. Those businesses came and went. That’s why it’s so important to catch the wave, to keep innovating, keep changing.” In Olsen’s case, that’s been the blueprint for a most interesting life. \n\nGreat advice. Also look for the part where Fortune debunks the notion that Olsen was the inspiration and model for C. Montgomery Burns – to which Olsen responds, “I’m thankful!”", "source": "ParisLemon"}