{"published": "2015-09-23T22:12:48Z", "media-type": "News", "title": "Pope Francis warns US bishops against 'divisive' language", "id": "24f4b50c-7e1a-44b4-b2b5-e18547b9c96a", "content": "Pope Francis told U.S. bishops Wednesday they should avoid \"harsh and divisive\" language and create a church with the warmth of a \"family fire,\" as he laid out a vision for American Catholicism far from the defensive stands on social issues that have put church leaders at the center of the culture wars. \n\nIn remarks at a prayer service at Washington's Cathedral of St. Matthew the Apostle, Francis told the bishops he was aware that \"the field in which you sow is unyielding\" and that there is a temptation \"to think back on bygone times and to devise harsh responses to fierce opposition.\" \n\nBut he urged the bishops to find ways to reach people \"with the power and closeness of love\" which he said \"counts more than their positions, distant as they may be from what we hold as true and certain.\" \n\n\"Harsh and divisive language does not befit the tongue of a pastor, it has no place in his heart,\" Francis said. \"Although it may momentarily seem to win the day, only the enduring allure of goodness and love remains truly convincing.\" \n\nThe pope's comments were the latest of his exhortations to throw open the doors of the church to all, no matter a person's beliefs and behavior, using the metaphor of a \"field hospital\" that healed wounds first before addressing other problems. But the talk Wednesday took on special emphasis, coming on the first full day of the pope's first U.S. visit, with the nation's bishops assembled before him. \n\n\"He just took the war out of the culture wars,\" said Christopher Bellitto, a church historian at Kean University in New Jersey. \n\nMany U.S. bishops have been unsettled by Francis' approach. Nearly all had been appointed by Popes John Paul II and Benedict XVI, who prioritized guarding orthodoxy against what they saw as an onslaught from secularism and doctrinal confusion sown by Catholics the bishops considered disloyal to the church. \n\nWhile bishops continued to aid the poor and immigrants through their massive network of social service agencies and schools, they increasingly put resources into high-profile fights against gay marriage, abortion and insurer-provided birth control. The bishops said they had no choice, given the advance of government policies they found immoral. As leaders of the largest denomination in the country, they became torchbearers for religious conservatives across faith traditions, and became embroiled in polarizing political fights. \n\nFrancis did not tell the bishops to abandon their priorities. He said he had no intention \"to offer a plan or to devise a strategy.\" \n\nIn a welcoming reception at the White House earlier Wednesday with President Barack Obama, Francis noted that religious freedom is \"one of America's most precious possessions,\" in a nod to the top concern for U.S. bishops seeking conscience exemptions from recognizing gay marriage. And at the cathedral service, Francis said attention should be paid to the \"innocent victim of abortion.\" But he listed abortion as one of many issues \"essential\" to the church's mission, including protecting children from hunger and war, caring for the elderly and sick and protecting the environment. \n \n\"Only a church which can gather around the family fire remains able to attract others,\" Francis said, otherwise bishops will \"end up being caretakers of ash.\" \n\nUsing a phrase with particular significance for Americans, Francis spoke of \"the seamless garment\" of the church, as he encouraged an end to divisions among Catholics. That Gospel phrase became identified with the late Chicago Cardinal Joseph Bernadin, who sought equal emphasis on church teaching about abortion and justice issues, such as poverty. \n\nConservative Catholics contended abortion was the most important issue of all, and dismissed Bernardin's approach as a capitulation to broader society. In an interview before the pope's visit, Archbishop Wilton Gregory of Atlanta, who worked under Bernardin as an auxiliary bishop, said Francis' approach \"is exactly what Cardinal Bernadin was saying years ago.\" \n\nThomas Groome, a Boston College theologian, noted that millions of Americans now call themselves former Catholics. \n\n\"What Francis wants to do is ask, 'How do we bring them along rather than drive them away?'\" Groome said. \n\n\"What are the fruits of the culture wars and what have they achieved? Essentially they've achieved nothing,\" Groome said. \"He's recommending a whole shift in attitude for U.S. Catholic bishops.\"", "source": "Montana Standard"}