{"published": "2015-09-03T18:30:57Z", "media-type": "News", "title": "5 Steps to Getting Your Partner On Board with Your Startup", "id": "10e3bf97-e8b1-41ea-b25d-2049c00a5548", "content": "You've decided to start your own business -- opening a shop, taking on consulting clients, writing that book, or any of a hundred other business ideas out there -- congratulations! You know it's going to take time, money, and a lot of hard work, but you're ready to go. You've got ambition and, most importantly, a plan for how to make it happen. \n\nThe only problem is, you've got a partner who doesn't have any clue what you're doing or why. Maybe they think that your idea is just a hobby. Maybe they want to support you, but don't know how. Maybe you've been so nervous to talk to them about it that they don't know you're thinking about starting your own business at all! \n\nIt's time to change that. But what if you're not sure how to start or nervous about what will happen? Try five ways to talk to your partner about starting your own business if you want them to fully understand and support your business goals. \n\n \n\n1. Give Them a Good Reason \nWhen you first talk to your partner about starting a business, don't just tell them what you want to do and leave it at that. Help them understand why this business is important to you and what you hope to achieve. This could be: \nI want to have portable work so that I don't have to be unemployed the next time we move.  I've always felt passionate about X and think these services can make a huge difference.  I think the extra income will make it easier for both of us to go back to school.  I want to challenge myself to turn my side hustle into a full-time, flexible career. \nWhatever your motivation for starting your business, make sure they understand all the reasons behind it -- professional, personal, and emotional. Once they get it, they'll be better able to support you and cheer you on when your motivation is flagging. \n\n2. Be Honest About Financial Logistics \nStarting a business is hard, especially from a financial perspective . When you talk about the logistics of starting your business, don't sugarcoat them in order to get your partner on board. Be honest about what this will take . Topics to cover include: \nAre you going to dip into your savings?  Will you spend several months not taking a paycheck?  Do the two of you need to cut back your expenses until things get off the ground?  How much do you expect to make? \nYou may not have specific answers to all these questions. That's okay. Do your best to address each one, and be willing to say that you don't know but you'll keep sharing as things grow and change. Your partner will appreciate your honesty, and it will lay the groundwork for further open communication about your business. \n\nBecause you've already shared why starting this business is important to you, they will be able to understand why any financial sacrifices are worth it in the long run. \n\n3. Give Them Something To Do \nStarting a business doesn't just affect you; it affects the future the two of you are building together. As a result, watching you work and struggle to grow your business may leave your partner feeling like they lack control over their own life. Combat this by talking about specific things they can do to support you. \n\nIs your partner an accountant? A graphics designer? An editor? Ask if they can help you out from time to time! Be careful not to demand too much -- they have their own schedule and work commitments to take care of, after all. But don't be afraid to ask for help . \n\nEven if your partner or spouse doesn't have a specific skill set that they can use to help out, you are still going to need their support, both emotional and practical. But don't just say, \"I need your support.\" Tell them exactly what they can do: \nI need you to give me a hug at the end of every day and tell me I'm doing a great job.  Once a week, I'd like to talk through my struggles and successes with you.  If you see me wasting time on Facebook, tell me to stop!  This week, I'd appreciate it if you handled groceries and dinner so I have more time for work. \nYour partner won't automatically know what you need, so don't be afraid to ask for it. \n\n4. Show Them Something Concrete \nYou know you are serious about your business, but you need to make sure your partner sees that too. You don't want your partner to think of your business as a hobby -- or worse, to think you are all talk. So when you sit down to talk about your business, have a real plan of action to share. Talk about: \n\nAny classes you've taken or training you plan on doing \nLogistics you have in place, like a website or industry contacts \nYour business plan for the first 6-12 months \nThe steps you plan to take to get started \n\nOnce your partner understands not just what you want to do, but how you plan to make it happen, it will be easier for them to support you and make any financial or logistical sacrifices necessary for you to achieve your goals. \n\nOnce you have things up and running, share your what's going on. If you land a new client or make a big sale, tell them! If you experience a setback, talk through how to recover from it. Don't be afraid to talk about both the good and the bad -- both will help show that you are serious about growing and developing as a businessperson. \n\n5. Give Them Space to Share Their Own Needs \nGrowing a business can make you a little selfish. You become incredibly focused, your free time is consumed by work, and your mental energy for anything not business related shrinks to almost nothing -- a recipe for a neglected relationship and a resentful partner. \n\nWhen you talk about starting your business -- and as things continue to grow -- give your partner room to contribute to the conversation. Ask: \nHow are you feeling about our financial situation ?  Am I making enough time for you?  What sort of emotional or practical support do you need from me?  Is there anything that makes you feel hesitant about my business plan?  Do you feel like my plans allow you to achieve your own goals? \nRemember, you need your partner to support your plans and dreams -- and you also need to support theirs! Leave room for talking about both sides of the equation. \n\nIt's Time To Talk! \nIf you've been putting off talking to your partner about your business, it's time to sit down and do some serious communicating . Remember, your partner is your first line of support, both emotional and practical. The two of you need to be on the same page if you want to move forward and see your business grow. \n\nGet more work and money news from GoGirl Finance delivered to your inbox every week: Click Here to Sign Up \n\nKatharine Paljug, the author if this article for GoGirl Finance , is a freelance lifestyle and health writer who specializes in online copy. Katharine writes about growing small business at her website, Katharine Writes .", "source": "Huffington Post"}