{"published": "2015-09-23T17:30:00Z", "media-type": "News", "title": "Minemakers Limited: Baobab Project Acquisition Completes", "id": "af7a325c-280f-4e79-9ac2-26aeb9cfc48a", "content": "PERTH, AUSTRALIA -- (Marketwired) -- 09/23/15 --   Minemakers Limited (\"Minemakers\") (ASX: MAK)( TSX: MAK ) is pleased to announce the completion of the acquisition of Baobab Mining and Chemicals Corporation SA (\"BMCC\"), a company which owns the Baobab Phosphate Project in the Republic of Senegal, from Baobab Partners LLC (\"Baobab Partners\") (an affiliate of Agrifos Partners LLC). \n\nOn 23 September 2015 the Company received approval, via receipt of an Amalgamation Certificate from the Registrar of Companies in Mauritius (\"Registrar\"), for the Reverse Triangular Merger involving the amalgamation of Baobab Fertilizer Africa, a wholly owned subsidiary of Baobab Partners and the parent company of BMCC, and Minemakers Baobab Mauritius, a wholly owned subsidiary of Minemakers, (\"Amalgamation\"). \n     \nFollowing the Amalgamation, Baobab Fertilizer Africa is the sole surviving company, with Minemakers as its sole shareholder. \n\nThe issue of the Amalgamation Certificate triggered Stage 2 Completion under the Merger Implementation Agreement (\"MIA\"). Stage 2 Completion was effected on the same day the Registrar issued the Amalgamation Certificate. \n\nIn accordance with the terms of the MIA, Mr Timothy Cotton (nominated by Baobab Partners) was appointed as a non-executive director of Minemakers at Stage 2 Completion. \n\nIn consideration for the acquisition and in accordance with the terms of the MIA, Minemakers will issue to Baobab Partners: \n--  100 million ordinary Minemakers shares;\n--  80 million Minemakers unlisted options with an exercise price of A$0.25\n    and a term of 4 years;\n--  40 million contingent share rights satisfied by the issue of Minemakers\n    shares upon the earlier of (i) achievement of a board-approved\n    preliminary feasibility study; (ii) the decision to proceed with the\n    construction of a phosphate rock mine; or (iii) first commercial\n    production of phosphate rock; and\n--  40 million contingent share rights satisfied by the issue of Minemakers\n    shares upon first commercial production of phosphate rock. \nCliff Lawrenson, Minemakers Managing Director and CEO commented: \"We are pleased that completion of the transaction has been achieved and would like to welcome Timothy to the Board and look forward to his contribution to the exciting future of Minemakers.\" \n\nABN 48 116 296 541 \n\nContacts: \nMinemakers Limited \nMr Cliff Lawrenson \nManaging Director and CEO \n+61 8 9264 7000 \n\nMinemakers Limited \nMr Rod Wheatley \nCFO and Company Secretary \n+61 8 9264 7000 \nfrontdesk@minemakers.com.au \nwww.minemakers.com.au", "source": "RCL Advisors"}