{"published": "2015-09-08T12:01:20Z", "media-type": "News", "title": "Jodi Eaton’s killer jailed for life", "id": "af8634d3-3e90-44da-a6a5-646b4dd1260a", "content": "Jodie Eaton went missing in February 2014 after a party in Bridgewater.  Source: Supplied  \n        \n JODI Eaton’s killer has earned a place among the state’s worst murderers ­because of his shocking crime, his efforts to conceal it and a brutal history of violence against women.  \n   \nDarren Michael Dobson, 38, has been sentenced to life imprisonment for the callous murder of the Sorell mother of two in February last year. \n\nChief Justice Alan Blow ordered he not be eligible for parole until 2029. \n\n“[Dobson’s] tendency to commit serious crimes of ­violence against women and his callous behaviour in hiding and disposing of [Ms Eaton’s] body during the 48 hours after the killing do place this case in the worst category of murder cases,” Chief Justice Blow said. \n\nDobson pleaded guilty to strangling Ms Eaton in the Gagebrook home of a mutual friend. No motive for the murder has emerged except that Dobson – an ice addict – flew into a blind rage after an argument with Ms Eaton, with whom he was socialising at a party that evening. \n  \nSoon after the murder he hid her body under the house. \n\nThe next night he took the body in a friend’s car to his uncle Maxwell Douglas Morrison’s farm at Pelham. \n\nThere he buried the body in a remote location. \n\nPolice found the shallow grave 19 days later and took Dobson, who was on bail at the time, into custody. \n\n“Those who were close to her underwent a terrible ­ordeal during those 19 days,” Chief Justice Blow said. \n\n“Her daughters were aged nine and five at the time. \n\n“They have lost their mother and their family home. \n\n“It has been a very disturbing time for both of them, in all sorts of ways. \n\n“The problems caused to them by their mother’s murder are many and ongoing.” \n\nMs Eaton’s partner at the time has been rocked by the murder. \n\nHe received several missed calls from Ms Eaton on the night of her death. \n\nOne call went through to his message bank and a distressed Ms Eaton can be heard saying “leave me alone” or “get off me”. \n\n“He says that he is haunted by what happened every day,” Chief Justice Blow said. \n\nThe victim’s mother has several psychological symptoms and “feels that her life is now meaningless”. \n\n“One should not overlook the impact that this crime may have had on the police officers who had the gruesome tasks of exhuming and photographing the decomposing body,” the judge said. \n\nSupporters of Ms Eaton described Dobson as a maggot as he was led away from the Supreme Court. \n\nChief Justice Blow also detailed Dobson’s disturbing history of domestic violence. \n\nOnce he chased his partner, who was five months pregnant, into the street where he choked her to unconsciousness. He kept punching her until police capsicum sprayed him to stop. \n\nIn 1998, he was sentenced to seven years’ jail for raping a woman – who woke to find Dobson strangling her – three times. \n\nSee Wednesday’s Mercury to read what Ms Eaton’s family had to say about the sentencing.", "source": "Tasmania Mercury"}