{"published": "2015-09-04T20:12:07Z", "media-type": "Blog", "title": "TYRANNY: New Track From Finnish Funeral Doom Duo Playing At Decibel; Aeons In Tectonic Interment Release Day Draws Near", "id": "f47af397-98be-44e4-b939-b187a0f2b69b", "content": "[photo by Peter Troest] \n \nWith the Dark Descent-bound release of Aeons In Tectonic Interment , the long-awaited new full-length from Finnish funeral doom duo, TYRANNY , now less than two weeks away, today the gloom-bringers at Decibel Magazine hurl forth second movement, “A Voice Given Unto Ruin” for communal depression. \n \nTYRANNY ’s first proper recording in a decade and third overall spews forth five decaying psalms of slow, tortured, soul-consuming grimness. Composed, performed and tracked by members Matti Mäkelä and Lauri Lindqvist with additional percussion by Jussi-Pekka Manner and mastered by D. Lowndes at Resonance Sound Studio (Absu, Pallbearer, Profetus, Sigh, Wodensthrone etc.), Aeons In Tectonic Interment is a traumatic, fifty-one-minute audio apocalypse where misanthropy, suffering and imminent ruin become one achieving purification through sonic degeneration. \n \n“ Aeons In Tectonic Interment  is an imperious, ambitious listen; the ‘death’ aspect of their corroded death/doom takes the reins, allowing the doomier tempo and atmosphere to decay around it,” issues Noisey of the opus, further noting “Its graceless, lumbering pace is almost unbearably slow, adding to the tension that hangs between the ringing notes and the pregnant pauses before each drawn-out roars erupts.” Elsewhere Decibel Magazine notes, “ TYRANNY have chosen to play all their music in the key of crushing.” Glacially Musical concurs, “The ringing, sludgy chords, the forlorn vocals, the wisps of melody, it all adds up to an immersing experience. TYRANNY has made a depressing, metal, vicious Pink Floyd album from their pre- Darkside Of The Moon  Era. Settle in, this ride will be long and bumpy, but worth it.” Abysmal Hymns calls the record, “heavy as fuck,” warning, “This album goes to the extreme to grind you down with its weight.” Metal Injection likens the band to the “crawl of a spider web-laden crypt, “ while We Love Metal adds, “It doesn’t get any darker than TYRANNY … The droning and depression ensuring tracks off… Aeons In Tectonic Interment cement the darkness… “ \n Get gloomy with a helping of “A Voice Given Unto Ruin,” courtesy of Decibel Magazine at THIS LOCATION .  \nAnd if you missed it, sample “Sunless Deluge” still streaming at Noisey at THIS LOCATION . \n \nForged in 2001 by Mäkelä and Lindqvist, TYRANNY was conceived under the strain of a Stranger Will to channel the Ageless resonations of Earth and Oceans and sonorous visions and fevered dreams by the means of epic, Funereal Soundscapes. \n \nAeons In Tectonic Interment will see release via Dark Descent Records on CD, double LP and digitally on September 18th, 2015. For CD preorders, point your browser HERE . For LP preorders go HERE . \n \n\n \nhttp://www.facebook.com/tyrannyfuneraldoom \n http://www.darkdescentrecords.com \n http://www.facebook.com/DarkDescentRecords \n http://www.twitter.com/DarkDescentRec", "source": "Earsplit Compound"}