{"published": "2015-09-09T15:01:41Z", "media-type": "Blog", "title": "Sachin Pilot slams Modi for twisting history, geography", "id": "1fed28da-5dbb-47b7-93d6-1f33cf1f943c", "content": "Raipur, November 13 Union minister for corporate affairs Sachin pilot on Wednesday slammed BJP’s prime ministerial candidate Narendra Modi for twisting history and geography in his speeches. “In his grandiloquence, Modi forgets to stick to facts and exaggerates. This shows how desperate he is to become PM,” said Pilot while interacting with the media persons at Raipur. He said in democracy a leader should possess qualities like humility and tolerance which Modi lacked. He said Modi would have to prove his capability for prime ministership as his speeches in rallies and meetings cannot earn him the coveted post. Questioning BJP’s credibility he said although it had changed its stance ahead of general elections by playing development card, it would never sway from its original ideology. “The BJP is suddenly talking on development, investment, GDP, industrial growth, etc. These stuffs might look better when published but behind the curtains this party still have same mindset what it had back in early 90s when its patriarch LK Advani had taken out Rathyatra to build Ram temple in Ayodhya,” he added. He said the Congress-led UPA government had never been partial in distributing funds to states. “We have always given more than what Chhattisgarh government had demanded, still problems like naxalism expanded in State,” he said. Claiming that Congress would form government in Chhattisgarh the young minister said though BJP looked over-confident about its victory, the poll result would startle it as his party was set to get clear mandate. “The youth have given chance to BJP twice and got no result. Now, they have decided to pick Congress,” he said. Comparing manifestos of Congress and BJP he said while his party had come up with difference by including entire spectrum in its vision document, the BJP simply copied its previous unfulfilled promises. Asked his take over opinion polls he said such reports were far away from ground reality. “In Delhi we will come to power for fourth term. In Rajasthan and Mizoram, we are winning again while we will get benefit of wind of change in Chhattisgarh and Madhya Pradesh,” he said. On party’s CM candidate in Chhattisgarh, he said Congress had always free from projection fever. “We do not believe in one-on-one match like media likes to see and compare between Rahul Gandhi and Modi. Instead of focusing on individuals, we pose united challenge and the CM is picked by our legislators’ party. Our leaders do not run behind posts like BJPians,” he said. When sought his stand on price rise he said it was surely a major challenge before the Centre, however, he felt the state governments too were responsible to some extent for it as they fail to deal artificial crisis created by hoarders and black-marketeers. He admitted that food inflation too had posed tough challenge to the Centre. Asked why prices did not lowered in Congress-ruled states he said his party’s governments in states did take effective steps like reducing value added tax (VAT) and increasing subsidies in domestic LPG cylinders to curb price rise. On host of scams at Centre he said his government had been prompt enough in taking action against tainted people and did not even hesitate in putting the ministers behind the bars by ordering inquiry against them.", "source": "Yogesh Mishra"}