{"published": "2015-09-16T20:28:10Z", "media-type": "News", "title": "Mentor Graphics Acquires Calypto Design Systems", "id": "c99a23b2-e875-497f-b97e-18de24758c31", "content": "SOURCE Mentor Graphics Corporation\n\nWILSONVILLE, Ore. \n\nCalypto will be merged into Mentor as a standalone business unit, an organizational decision demonstrating Mentor's commitment to the future potential of Calypto's products and technologies. \n\nBadru Agarwala \n\nAccelerating the Momentum\n\nWhen the Catapult® technology and resources were originally transferred to Calypto in 2011, it was with the goal of creating an integrated high-level synthesis (HLS) and C-to-RTL verification flow. Four years later this goal has been accomplished. During that time Catapult became the only HLS tool that can automatically generate production-quality RTL from a C/C++ and SystemC description, establishing Catapult as the technology and market leader. The readiness of customers such as Google, NVIDIA, Qualcomm, and ST Microelectronics to publicly discuss their production results using Catapult at events like the Design Automation Conference (DAC) shows just how impactful the technology is. \n\nThe successful integration of Catapult with Calypto's SLEC® technology will provide customers with the best solution for C-to-RTL verification regardless of their system-level design language of choice. \n\nCalypto's power optimization platform, PowerPro® is seeing strong adoption at leading edge semiconductor companies. PowerPro is a full suite of RTL power optimization tools featuring new RTL power analysis capabilities, production-proven optimization techniques for reducing dynamic and leakage power in the logic, memory, and embedded processor section of a SoC, and is the only solution that provides sequential formal equivalence checking. \n\n\"Calypto has been on a great path with its superior technology,\" stated Badru Agarwala \n\nAbout Mentor Graphics\n\nMentor Graphics Corporation (NASDAQ: MENT) is a world leader in electronic hardware and software design solutions, providing products, consulting services and award-winning support for the world's most successful electronic, semiconductor and systems companies. Established in 1981, the company reported revenues in the last fiscal year in excess of $1.24 billion \n\nMentor Graphics and Mentor are registered trademarks of Mentor Graphics Corporation. All other company or product names are the registered trademarks or trademarks of their respective owners.\n\nFor more information, please contact:\n\nLogo - http://photos.prnewswire.com/prnh/20140317/AQ83812LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/mentor-graphics-acquires-calypto-design-systems-300144394.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KSWO"}