{"published": "2015-09-28T16:45:48Z", "media-type": "News", "title": "Tensas sheriff: No choice in releasing accused murderer", "id": "a99ccfd2-d9ac-4c07-961c-9602efd5a8e1", "content": "Tensas Parish Sheriff Ricky Jones said his warden had no choice but to release an inmate accused of a first-degree murder committed in Abbeville after the Louisiana Department of Corrections issued the order to free him. \n\nJones said there had been no detainer placed on Derrick Mitchell, 24, who was arrested by the FBI in California last week after more than six months on the run. \n\n“I don’t have ESP and I’m not psychic,” said Jones, who said news reports made his department look incompetent. “I didn’t know he was wanted for murder and there was no detainer placed on this guy. So once we receive a diminution of sentence order, we don’t have a choice but to follow the law and release him.” \n\nMitchell had been transferred from Avoyelles Parish to the Tensas Parish Detention Center to serve out a sentence for drug and battery charges unrelated to the Abbeville murder. He was released from the Tensas jail March 1. \n\nBut Mitchell had also been indicted in the Dec. 20, 2012 killing of Darrell Broussard Jr., 25, of Abbeville, and should have been awaiting trail for that crime. \n\n“The bottom line is we didn’t make a mistake in Tensas Parish,” Jones said. “If there had been a detainer placed on him we could have held him for 10 more days until he could be picked up.” \n\nGannett Louisiana has reached out to the Louisiana Department of Corrections for comment. \n\nMitchell is now being held in the San Joaquin County Jail on a fugitive warrant, according to an Associated Press story. He will be transported back to Louisiana after he waives an extradition hearing or has a hearing this week. \n\nFollow Greg Hilburn on Twitter @GregHilburn1 \n\nRead or Share this story: http://www.dailyworld.com/story/news/local/2015/09/28/tensas-sheriff-choice-releasing-accused-murderer/72977118/", "source": "Opelousas Daily World"}