{"published": "2015-09-25T04:42:00Z", "media-type": "News", "title": "Cambridge News commented Boo-hoo: Clown's tears as he claims he's banned from Cambridgeshi...", "id": "d7b386aa-9020-40e9-9215-182be255cb8d", "content": "A member of a carnival committee in Cambridgeshire quit after he said he was banned from dressing as a clown to promote the event - and his clown mascot idea was panned. \n\nMichael Bates, of Kent Road, Huntingdon was a member of the town's carnival committee - formed this year to revive the carnival which had not taken place for more than a decade because of political in-fighting. \n\nHe created a clown style character called Charlie Carnival to be used to plug the event and to raise funds. \n\nBut the idea was ditched, Mr Bates claims. \n  \nHe said: \"In my absence at a meeting the character was deemed to be unsuited for promotional purposes as they have a carnival queen. The carnival queen is brilliant and is a great asset, but I would have thought that having clowns giving out sweets would have given the carnival a real lift. \n\n\"The committee said they thought that it was a brilliant idea why then did those in charge not adopt Charlie Carnival.\" \n\nMr Bates has made a formal complaint to Huntingdon Town Council over the affair. \n\nHe said: \"This is not some guy throwing his toys out of the pram the fact is that the carnival committee has lost other committee members because of similar or related issues. In fact the last two meetings have been cancelled because of low numbers. \n\n\"Charlie Carnival exists as a real person and as a digital character as well. Charlie has a Facebook page and is available to any event who would like to use him. He makes no charge for his services and will in fact create funds as there is related merchandise that is for sale. \n\n\"I understand that the reason the carnival committee banned Charlie was one of costs but actually there would have been no costs whatsoever as Charlie already exists and in fact the reverse is true as charlie was developed to create funding opportunities.\" \n\nMayor of Huntingdon, Cllr Bill Hensley, offered earlier this year to act as a peace broke r to ensure the town's carnival goes ahead next year after organisers were forced to cancel this year's even t. \n\nAt a meeting at Huntingdon Town Hall Cllr Hensley formed the Huntington Carnival Committee in order to revive the town's carnival, which has not taken place for 13 years. \n\nHe told the News he was not aware of Mr Bates' clown idea but said that as chairman of the committee, they would have to take into consideration people with full-blown phobia of clowns, or coulrophobia, which is relatively rare although others do recoil at the sight of clowns. \n\nCllr Hensley said: \"Sorry but I don't know anything about a clown idea for the carnival. We would have to consider that an awful lot of people have a phobia of clowns.\" \n\nA public meeting was held on July 30 at Huntingdon Town Hall and Cllr Hensley says he has the support of several local companies and organisations. \n\nThis year's carnival, which was due to take place on August 22, was cancelled amid political wrangles and splits in the town council.", "source": "Cambridge News"}