{"published": "2015-09-06T18:58:35Z", "media-type": "News", "title": "Price pipped at Burghley Trials", "id": "1f007c68-4adf-45ba-92a6-ad3b471031ba", "content": "New Zealand equestrian Tim Price and horse Ringwood Sky Boy have finished second in the presitigious Burghley Horse Trials in England after a fluent and foot perfect showjumping round. \n\n\"What can I say,\" a jubilant Price said immediately after the ride on Sunday. \n\n\"He's exceeded all expectations. It's his third or fourth attempt at four star [level] and to put all three phases together and come close to winning is amazing.\" \n\nRingwood Sky Boy never looked like taking a rail, jumping confidently and beautifully all the way around the course, finishing to huge cheers of joys from the Kiwi supporters. \n\nGerman world No 1 Michael Jung on La Biosthetique Sam put on a masterly display to maintain their lead after cross country and earn him a deserving Burghley title. \n\nEarlier, Jung opted not to lead Sam in the trot up as the reigning Olympic and European champion rider was still visibly sore from a fall off his second horse Fischerrocana FST during the cross-country phase. \n\nAs well as claiming £46,000 (NZ$111,000) as runner-up, Price picked up a US$5000 (NZ$8000) bonus through a sponsor promotion. \n\nSadly for Price's wife, Jonelle, Classic Moet hit the first combination of the treble, dropping them from third place overnight to fifth. \n\n\"It's one of those things – it could have stayed up or down,\" she said. \n\n\"I'm delighted with her performance. Finishing third would have been the ultimate but I said early in the week that to have two in the top five would be great and that's what we've got. \n\n\"It equals my previous best here,\" she said referring to her fifth on The Deputy last year. \n\nFellow New Zealander Sir Mark Todd on horse Leonidas produced a beautiful clear round to rise one place to sixth and earlier in the day the horse won the prize for best conditioned horse; a fitting nod to the horse's magnificent order. \n\n\"I was thrilled with him,\" said Todd. \n\n\"He's a very good jumper and just keeps getting better and better. He couldn't have done any more out there.\" \n\nKiwi Jock Paget and Shady Grey had one fence down to finish in 16th place delighting his rider. \n\n\"I'm really happy with him,\" Paget said. \n\n\"He was very calm out there and was very good.\" \n\nAustralian rider Chris Burton finished in third and fourth place – Classic Moet's dropped rail allowing him to sneak up the order. \n\nThe best British rider was Kristina Cook in eighth place. \n\nFinal results - Burghley Horse Trials: Michael Jung (GER) La Biosthetique Sam FW 40 1, Time Price (NZL) Ringwood Sky Boy 41.5 2, Christopher Burton (AUS) TS Jamaimo 45 3, Christopher Burton (AUS) Haruzac 47.6 4, Jonelle Price (NZL) Classic Moet 48.9 5, Sir Mark Todd (NZL) Leonidas II 50.5 6. Also: Jock Paget (NZL) Shady Grey 69.9 16. Ad Feedback - Stuff", "source": "Manawatu Standard"}