{"published": "2015-09-20T03:44:02Z", "media-type": "News", "title": "There should be no doubt that India won the war in 1965", "id": "1a25473e-0d9b-4361-9290-1201622e012e", "content": "Calcutta News.Net  Saturday 19th September, 2015  \n A leading Indian newspaper has published an article yesterday where a well-known strategic thinker Lt.-Gen. (Retired) V. R. Raghavan has stated that there were no winners in the 1965 India-Pakistan War. \n\"I disagree with this conclusion.\" Lt. Gen. Raghavan quotes a Prussian military theorist of the 18th century Carl von Clausewitz to conclude that \"while a war must be waged to gain a state's ends, the ultimate purpose of war is peace and not victory.\" India won both the war and peace. \n \nLt. Gen. Raghavan says, \"the 1965 war neither brought victory to Pakistan which initiated the war in the Rann of Kutch and later in Jammu and Kashmir, nor peace to India which fought back tenaciously after being surprised.\" \n \nWhat was Pakistan's performance in the war? As disclosed by a Pakistani author, Farooq Bajwa, in his recent publication \"From Kutch to Tashkent\", the Pakistan Army, which launched an attack in the Chamb- Jaurian sector on September 1, 1965, was on the verge of capturing Akhnoor. The force was commanded by General Akhtar Malik, an Ahmadiya. There were some in the Pakistan Army, who did not want General Malik to get credit for the 'victory', and overnight, he was transferred and the command was taken over by General Yahya Khan. \n \nThe change of command resulted in the delay of the attempt to capture Akhnoor. \n \nMeanwhile, the Indian Army, which was taken by surprise, asked the Indian Air Force for assistance. Lt. Gen. Raghavan says that then Indian Prime Minister Lal Bahadur Shastri trusted his Defence Minister Y. B. Chavan completely and allowed him to take critical decisions as the war developed. \n \nThe 1965 war, Lt.Gen. Raghavan says \"welded the Indian defence forces into a cohesive military machine. \n \nPakistan clearly lost the war. It has been clearly brought out in Farooq Bajwa's book that Pakistan was concerned that the Indian Army was strengthening itself after the humiliating defeat that it suffered in 1962, had gained the support of the United States, and was keen to bring India to the negotiating table to discuss the future of Jammu and Kashmir. \n \nThe first step was the attack in Kutch. India ordered a general mobilisation in the area. Concerned, the British Government intervened, and following negotiations, the Kutch Agreement was signed on 1 July, 1965 and a cease fire came into effect. \n \nPakistan had hoped that it would force India to the negotiating table to discuss Kashmir, but did not succeed. \n \nDisappointed, Pakistan took the next step in Jammu and Kashmir. Code named Operation Gibraltar' it sent thousands of Pakistani soldiers and paramilitaries from Pakistan occupied Kashmir into Jammu and Kashmir disguised as Kashmiri guerrillas, to engage Indian forces in the state. \n \nBajwa says 'the majority of Muslims and their leaders' in Kashmir did not rise up at the behest of the infiltrators. According to Gauhar, a Pakistani author, when the Gibraltar forces arrived in the Valley, \"they were met by a frightened and hostile population.\" \n \nUnsuccessful, Pakistan then decided to take the next step. As directed by General Ayub Khan in his letter to the Foreign Minister and the Commander in Chief, the aim was 'to take such action that will defreeze the Kashmir problem, weaken Indian resolve and bring her to the conference table without provoking a general war. \"Ayub Khan also cautioned his commander-in-chief that India may attack Pakistan elsewhere. \n \nThe task was given to General Akhtar Malik. \"Operation Grand Slam' launched by him was successful in capturing Chhamb. Akhnoor was the next target. But the Chief of the Pakistan Army, General Musa ordered a change of command and General Akhtar handed over command to General Yahya Khan. \n \nGeneral J. N. Chaudhri, the Indian Army Chief, asked the Indian Defence Minister for air support, which was readily given. \n \nThe new commander of the Pakistani forces, the author says, followed the advice of General Ayub Khan 'who decided to follow the advice of Musa rather than Malik and limit the offensive so as to avoid all out war with India. There was a delay in the progress of the Pakistani forces in capturing Akhnoor, which gave India time to reinforce the defences. \n \nFarooq Bajwa says, \"Despite its bold objectives and initial success, Operation Grand Slam failed in its military objectives.\" \n \nIndia then decided to attack Pakistan at its own place of choosing. The go ahead for the invasion was given by Prime Minister Lal Bahadur Shastri and Defence Minister Y. B. Chavan, and H-Hour for the attack on the Lahore front was fixed at 0400 hours on September 6. \n \nThe Indian Army attacked Lahore on three fronts - Wagah -Lahore, Harike-Khalra- Barki, and Khem Kharan -Kasur Axis. Pakistan had to redeploy its forces and the progress of its forces in Chhamb sector came to a virtual halt. \n \nIn the battles that followed the Indian Army troops, led by Lt. Gen. Joginder Singh Dhillon, reached the Icchogil Canal on the Grand Trunk Road (called the BBRD canal by Pakistan) on September 6, but was pushed back by the Pakistan Army. Pakistan lost Burki village and fierce battles took place in Asal Uttar in the Khem Kharan -Kasur axis. \n \nThe objectives of the Indian attack called \"Riddle\", the author says, was a mystery. The destruction of Pakistani armour was more important than the occupation of towns. \n \nThe author quotes General Chaudhri, as saying that the occupation of Lahore had never been an Indian objective and that once pressure on Akhnoor had been eased; India's objective was to degrade Pakistan's armour and capability of offensive action by drawing its forces into a battle and destroying them. \n \nPakistan's counter attack, called operation 'Mailed Fist' was a brave attempt to save the situation, but it also saw the abandoning of Patton tanks by its personnel. \n \nFarooq Bajwa also gives details of the Indian attack on Sialkot by a force commanded by Lt. Gen P.O. Dunn who had with him the 1 Armoured Division commanded by Maj.Gen. Rajinder Singh Sparrow. \n \nMeanwhile, international pressure was building up on India and Pakistan to stop the war. The United States had put in a freeze on military supplies. \n \nThe impact was more on Pakistan, but India too was in a difficult situation, considering that China was an adversary. \n \nA cease fire came into effect on 22 September 1965 at 0700 hours GMT. \n \nFarooq Bajwa has quoted British intelligence reports about the performance of the Indian and Pakistani army and air force units during the war. \n \nIt was estimated that Pakistan lost 250 tanks out of a total of 900, most of which were Pattons, while India lost 300 out of 1,500, mainly Centurions and Shermans of World War II vintage. \n \nPakistan reluctantly agreed to Soviet mediation. Tashkent was chosen as the place for mediation. Bhutto was sceptical about Tashkent producing anything useful and sarcastically commented that Shastri was 'quite the little Napoleon these days'. \n \nFarooq Bajwa gives details of the efforts made by Soviet Premier Kosygin. He also quotes what General Ayub Khan told Premier Lal Bahadur Shastri :\"Kashmir ke mamle men kuch aisa kar deejiye ki main bhi apne mulk me muh dikhany ke kabil rahoon\" (Please give me some assistance on the issue of Kashmir so that I may be able to show my face in my own country). \n \nThe Tashkent Declaration was signed in the afternoon of January 10. \n \nPremier Kosygyn persuaded Lal Bahadur Shastri to give up the captured areas, including those in Jammu and Kashmir like the Haji Pir Pass, and exchange prisoners of war. \n \nFarooq Bajwa says in his book says,\"There is little doubt that the declaration was a diplomatic triumph for India and a defeat for Pakistan. Whatever the ambiguity of the result on the battlefield, the only reference to Kashmir - for which the whole war had been fought - was a passing reference in Clause I which merely recorded that the issue of the Kashmir war was discussed'. The reality was the issue of Kashmir 'was simply not discussed by the Indian delegation at all'. \n \nAfter the signing of the declaration, a banquet was held on January 10. Lal Bahadur Shastri suffered a heart attack the same night and passed away. \n \nI had the opportunity to cover the war in the Lahore sector in 1965. People of this country should know that India won the war, won peace, and the Indian Armed Forces regained the confidence the nation had in its capability to defend the nation. \n \nI.Ramamohan Rao, was a former Principal Infomation Officer of the Government of India. He can be reached on his E-mail: raoramamohan@hotmail.com \n \nBy I.Ramamohan Rao (ANI)", "source": "Calcutta News.Net"}