{"published": "2015-09-18T07:00:00Z", "media-type": "Blog", "title": "Only Order What You Need - Don’t Waste Your Medicines", "id": "29a502b2-1261-4f41-8ee1-abd0397f2895", "content": "A campaign aimed at reducing unnecessary medicines waste has been launched by health commissioners in Sefton.\nNHS Southport and Formby CCG and NHS South Sefton CCG estimate that an incredible £2 million is lost each year through wasted medicines that could have otherwise been spent on health services for local residents.\nThe campaign calls upon patients and carers to:\rOnly order what they need\rReturn their unwanted medicines to their pharmacy for safe disposal\rTake their medicines with them when they go into hospital\rDr Rob Caudwell, chair of NHS Southport and Formby CCG, said:\r“ One of the biggest problems is repeat prescriptions, which are ordered and collected by patients but then not used.\n“Unwanted medicines in the home may mean that patients are not getting the full benefit they could from their prescriptions. It also represents a large amount of waste, with around £90 million worth of unused prescription medicines in people’s homes across the UK at any one time. With a few simple considerations, people could help save the NHS millions each year.”\rIn Sefton, the £2 million that could potentially be saved through better medicine management could be spent on:\r79 more nurses OR\r2,000 more drug treatment courses for Alzheimer’s OR\r132 more drug treatment courses for breast cancer OR\r539 more hip replacements OR\r2,081 more cataract operations\rDr Craig Gillespie, chair of NHS South Sefton CCG, added:\r“ We want patients on repeat prescriptions to think about what they are ordering and only ask for what they need and are running out of. Any of their medicines can be dispensed when needed at a later date, as once medicines have been dispensed, they cannot be recycled.\n“In addition, we are encouraging everyone involved in prescribing, dispensing or reviewing medicines to make sure that their patients are fully involved in making decisions about their treatment, to ensure that more people take their medicines correctly because they have a fuller understanding of why it’s important to take medications as they’re recommended to.”\rAround half of the UK population do not take or use their medicines as prescribed. This can occur for a number of reasons, including:\nPatients not believing the medicine is necessary\rPossible side effects\rFitting taking or using medicines into daily routines\rChoosing between medicines if patients’ feel they are taking too many\rCutting down or stopping medicines they have been taking for a long time\rHealth professionals across the region have joined forces in a bid to inform patients and carers about their treatment and to help people understand more about their medicines and the options they have.\nSusanne Lynch, head of medicines management for both CCGs, said:\r“This campaign is a great example of doctors, pharmacies, hospitals and care homes working together to raise awareness amongst patients and carers of this important issue, and people will be able to pick up a leaflet from their GP practice or local pharmacy to find out more.”\rShe concluded:\r“We’d also encourage anyone with questions about their medicines, no matter how small, to speak to their pharmacist or doctor who will be able to give help and advice about getting the most from their medicines. It’s so important that people take their medicines as directed to ensure they get the maximum benefit, and health professionals will be more than happy to answer people’s queries or concerns.”         \nPosters and leaflets are being displayed in pharmacies, GP practices and hospitals. You can find a list of your nearest participating venues by searching for Southport, Formby and South Sefton on the following website www.medicinewaste.com, where you will also find more information about the campaign. \r ", "source": "Formby First"}