{"published": "2015-09-18T15:52:18Z", "media-type": "Blog", "title": "Police blotter for Sept. 18", "id": "95fb88f8-728d-4df7-9480-57c220c67f36", "content": "The Bristol Police Department reported the following arrests last week. \n•Diane Brandi, 43, of 226 East Main St., Apt.  12, Bristol, was arrested Sept. 4 and charged with interfering with an officer. \n•James Gill, 42, of 525 Crown St., Apt.  134, Meriden, was arrested Sept. 4 and charged with interfering with an officer. \n•Daniel Henderson, 51, of 22 Lake Rd., Middlefield, was arrested Sept. 4 and charged with third degree assault, second degree breach of peace, interfering with an officer and violation of probation. \n•Heather M. Harris, 28, of 64 Birge Rd., Bristol, was arrested Sept. 4 and charged with sixth degree larceny and first degree criminal trespass. \n•Ryan Kaminski, 32, of 155 Sheffield Lane, Bristol, was arrested Sept. 4 and charged with no face protection of motorcycle, operation while registered licensed suspended/revoked, and fifth degree larceny. \n•Sean McPhee, 24, of 27 Burlington Ave., first floor, Bristol, was arrested Sept. 5 and charged with sixth degree larceny and conspiracy to commit sixth degree larceny. \n•Nicole Teardo, 19, of 153 Gridley St., Bristol, was arrested Sept. 5 and charged with sixth degree larceny, conspiracy to commit sixth degree larceny, possession of drug paraphernalia and illegal possession. \n•Melissa L. Sargent, 30, of no certain address, Bristol, was arrested Sept. 5 and charged with conspiracy to commit sixth degree larceny. \n•Stephen A. Hopkins, 25, of 197 East Main St., Bristol, was arrested Sept. 5 and charged with operation while registered licensed suspended/revoked and operation of a motor vehicle while using a handheld mobile telephone to engage in a call or while using a mobile electronic device. \n•Shane Harlow-Morrison, 28, of 47 Maywood Lane, Bristol, was arrested Sept. 5 and charged with operation of a motor vehicle while using a handheld mobile telephone to engage in a call or while using a mobile electronic device and no insurance. \n•Eric Mitchell, 38, of 124 Melrose St., Bristol, was arrested Sept. 5 and charged with sixth degree larceny. \n•Angel Martinez, 29, of 136 National Ave., Waterbury, was arrested Sept. 6 and charged with operation while under the influence and failure to comply with fingerprint requests. \n•Shawn P. Brown, 42, of 67 Haig Ave., Bristol, was arrested Sept. 7 and charged with unsafe movement of a stopped car, operating an unregistered motor vehicle, operating a motor vehicle other than motorcycle without a license, and interfering with an officer. \n•Nicholas Wentland, 26, of 147 Lexington St., Bristol, was arrested Sept. 7 and charged with second degree threatening and second degree harassment. \n•James L. Mulhern, 39, of 166 North St., Bristol, was arrested Sept. 8 and charged with criminal violation of restraining order. \n•Angel L. Roy, 28, of 198 Davis Dr., Bristol, was arrested Sept. 8 and charged with sixth degree larceny. \n•Dawn Roy, 23, of 198 Davis Dr., Bristol, was arrested Sept. 8 and charged with sixth degree larceny. \n•James S. Warkoski, 48, of 34 Sandra Ave., Terryville, was arrested Sept. 8 and charged with illegal possession of narcotics, possession of drug paraphernalia, operating an unregistered motor vehicle, no insurance and operation of a motor vehicle while using a handheld telephone. \n•Christy Rushlow, 37, of 38 Allen St., Terryville, was arrested Sept. 8 and charged with illegal possession of narcotics and possession of drug paraphernalia. \n•Luis Clarke, 22, of 41 Washington St., Apt.  202, Bristol, was arrested Sept. 9 and charged with interfering with a 911 call, second degree threatening and second degree breach of peace. \n•Brandon A. Medina, 21, of 132 Dorothy Rd., Bristol, was arrested Sept. 9 and charged with interfering with an officer. \n•Gordon Hood, 38, of 45 Hawthorne St., Apt.  A2, Bristol, was arrested Sept. 9 and charged with third degree assault, interfering with a 911 call, second degree breach of peace, and first degree criminal mischief. \n•Analicia Lachance, 31, of 502 South St., Apt.  C4, Bristol, was arrested Sept. 9 and charged with third degree assault, second degree breach of peace, and third degree criminal mischief. \n•Tonye Hernandez, 44, of 502 South St., Apt.  B4, was arrested Sept. 9 and charged with third degree assault and second degree breach of peace. \n•Michael C. Bourgoin, 43, of 366 West Washington St., Bristol, was arrested Sept. 9 and charged with interfering with an officer, operating an unregistered motor vehicle, following too close, and operating without a license. \n•Joseph Pantano, 22, of 280 Main St., Middletown, was arrested Sept. 9 and charged with criminal violation of protection order-nonthreatening, and first degree criminal trespass. \n•Michael R. Levesque, 25, of 41 Irving St., Bristol, was arrested Sept. 10 and charged with traveling too fast for conditions, failure to obey stop sign, operation while under the influence, no insurance, and second degree assault with a motor vehicle. \n•Marc J. Coleman, 32, of 351 Chestnut St., New Britain, was arrested Sept. 10 and charged with third degree burglary and second degree larceny. \n•Travis Owens, 27, of 42 Moris St., Bristol, was arrested Aug. 28 and charged with illegal operation of motor vehicle under suspension and two counts of violation of town ordinance. \n•Jonathon Gargano, 27, of 189 Laurel St., Apt.  2, Bristol, was arrested Aug. 28 and charged with two counts of first degree failure to appear, sixth degree larceny, interfering with an officer, criminal impersonation, and second degree failure to appear. \n•James Harrison, 24, of no certain address, was arrested Aug. 28 and charged with possession of drug paraphernalia and illegal possession of narcotics. \n•Shawn D. Beland, 26, of 25 Landry St., Apt.  3, Bristol, was arrested Aug. 28 and charged with illegal manufacture, distribution and sale of narcotics, illegal possession of narcotics, distribution of controlled substances less than 1500 feet from a school/high school, and illegal possession of hallucinogen. \n•Luis Paulino, 40, of no certain address, Bristol, was arrested Aug. 29 and charged with first degree criminal trespass. \n•Frank D. Mitte, 58, of 325 Main St., Bristol, was arrested Aug. 29 and charged with operation while under the influence. \n•Theodore Mayo, 48, of 178 Garden Circle, Waterbury, was arrested Aug. 29 and charged with operation while under the influence, evading responsibility, failure to drive in proper lane and no insurance. \n•Denise Villani, 50, of 193 East Main St., Bristol, was arrested Aug. 29 and charged with criminal violation of protective order and first degree criminal trespass. \n•Ronald Alvarez, 26, of 179 Lillian Rd., Bristol, was arrested Aug. 30 and charged with second degree threatening. \n•Luis Paulino, 40, of no certain address, Bristol, was arrested Aug. 30 and charged with first degree criminal trespass and second degree violating condition of release. \n•Antonio Lopez, 23, of 320 Queen St., Apt.  D14, Bristol, was arrested Aug. 30 and charged with disorderly conduct. \n•Jillian Ray, 22, of 320 Queen St., Apt.  D14, Bristol, was arrested Aug. 30 and charged with disorderly conduct. \n•Jirna Ruiz, 22, of 78 Davis Dr., Bristol, was arrested Aug. 30 and charged with third degree assault and disorderly conduct. \n•Jonathon R. Garcia, 34, of 76 Chestnut St., Apt.  2, Bristol, was arrested Aug. 30 and charged with third degree assault and disorderly conduct. \n•Yolanda Gonzalez, 53, of 100 Mark Lane, Apt.  B3, Waterbury, was arrested Aug. 30 and charged with fourth degree larceny and conspiracy to commit fourth degree larceny. \n•Rafael Alsina-Jimenez, 31, of 80 Brook St., Bristol, was arrested Aug. 31 and charged with engaging police in pursuit, second degree breach of peace, injury, risk, impairing morals, failure to obey stop sign, children under the age of four without restraint, failure to have lights lit/illuminated, second degree reckless endangerment and reckless driving. \n•Clayton Keyworth, 40, of 258 Queen St., Apt.  1, Bristol, was arrested Sept. 1 and charged with second degree larceny, third degree burglary, conspiracy to commit second degree larceny and conspiracy to commit third degree larceny. \n•Devon P. Crussana, 29, of 820 Stafford Ave., Bristol, was arrested Sept. 1 and charged with possession of drug paraphernalia and illegal possession of narcotics. \n•Nicole Belmonte, 40, of 895 Matthews St., Apt.  62, was arrested Sept. 1 and charged with second degree breach of peace and third degree assault. \n•Dalton Burke, 22, of 81 Bartholomew St., Bristol, was arrested Sept. 2 and charged with illegal possession of narcotics, possession of drug paraphernalia, weapons in a motor vehicle, carry and sale of a dangerous weapon, theft of no. plate/insert, misuse of plate and second degree failure to appear. \n•Jose A. Cosme, 30, of 160 Coventry Rd., Bloomfield, was arrested Sept. 2 and charged with disorderly conduct and interfering with a 911 call. \n•Lasondra M. Gainey, 24, of 149 School St., Bristol, was arrested Sept. 2 and charged with sixth degree larceny. \n•Luis D. Rivera, 28, of 31 Armand Rd., Bristol, was arrested Sept. 2 and charged with second degree breach of peace, interfering with an officer and failure to respond to payable violation. \n•Eric C. Norton, 20, of 42 Merriman St., Bristol, was arrested Sept. 3 and charged with illegal possession of marijuana less than four ounces, illegal manufacture, distribution and sale, and second degree failure to appear. \n•Alejandro A. Santiago, 33, of 19 William St., New Britain, was arrested Sept. 3 and charged with injury, risk impairing morals. \n•Bryon A. Chasse, 34, of 1388 Corbin Ave., New Britain, was arrested Sept. 3 and charged with fourth degree larceny. \n•Christopher J. Malino, 26, of 58 Divinity St., Bristol, was arrested Sept. 3 and charged with illegal possession of narcotics, possession of drug paraphernalia and failure to cross at crosswalk. \n•John P. O’Day, 38, of 112 Porter St., Waterbury, was arrested Sept. 3 and charged with failure to comply with fingerprint requests and operation while under the influence.", "source": "Bristol Observer"}