{"published": "2015-09-30T16:30:00Z", "media-type": "Blog", "title": "3 things you should know about 2016 open enrollment", "id": "beffb345-529e-4f45-8385-bef3b2c4b860", "content": "DELRAY BEACH, Fla. , Sept. 30, 2015  /satPRnews.com/ — Fall is in the air, our mornings and evenings are cooling down and health insurance open enrollment is upon us. \n \n“This year’s open enrollment will be one of the most tumultuous ever, as some of the most arduous health care reform requirements kick in for employers, and insurance companies raise premiums on individuals to be more in line with their expenses,” said Jim Jalil , of HealthCareForYouNow.com D.B.A. Access Medical Health Group. \n \nHere are three things to know as you prepare for open enrollment in 2016. \n \n1. Enrollment Period \n \nThis Year: \n \n2016 \n Open Enrollment Period is November 1, 2015 – January 31, 2016 . \n \nPrevious years \n \n2015  \nOpen Enrollment Period is November 15, 2014 – February 15, 2015 . \n \n2014  \nOpen Enrollment Period is October 1, 2013 – March 31, 2014 . \n \n  \n \n2. New Out of Pocket Limits \n\n \nThis Year \n \n2016 \n The maximum out-of-pocket cost limit for any individual Marketplace plan for 2016 can be no more than $6,850 for an individual plan and $13,700 for a family plan \n \nPrevious years \n \n2015 \nThe maximum out-of-pocket cost limit for any individual Marketplace plan for 2015 can be no more than $6,600 for an individual plan and $13,200 for a family plan \n \n2014 \nThe maximum out-of-pocket cost limit for any individual Marketplace plan for 2014 can be no more than $6,350 for an individual plan and $12,700 for a family plan \n \n  \n \n3. The Penalty for Not Having Coverage is Going Up \n \nThis Year \n \nThe fee for not having coverage in 2016 \n \nIf you don’t have coverage in 2016 , you’ll pay the higher of these two amounts: \n \nPrevious years \n \nThe fee for not having coverage in 2015 \n \nIf you don’t have coverage in 2015, you’ll pay the higher of these two amounts: \n \nThe fee for not having coverage in 2014 \n \nIf you didn’t have coverage in 2014, you’ll pay the higher of these two amounts: \n \nWith all the changes in 2016 open enrollment, from when you can enroll into a plan to what your out of pocket limit is or what penalty you will have to pay for not having coverage . We believe more than ever customers start compare their options sooner than later. \n \nHealthCareForYouNow.com is a leader in bringing innovation to the personal insurance industry. We strive to exceed our customers’ expectations by providing un-biased recommendations and high quality service. We have cutting edge technology, which allows us to provide our members the ability to compare all of their options. This gives our members the most up to date tools to make the best decision on the plans that fit their specific needs and budget. \n \nLogo – http://photos.prnewswire.com/prnh/20150224/177661LOGO \n \n ", "source": "Satellite News"}