{"published": "2015-09-23T17:04:51Z", "media-type": "Blog", "title": "On Blogging", "id": "bc315d43-8b28-4bdf-99ca-c801c97c665e", "content": "Recently, it seems to me, there are a lot of bloggers that have either suspended their blogs or stopped blogging altogether. It's possible that my impression is due to the selection of blogs that I look in on, which are mostly the blogs of RVers and travelers. But then again… perhaps not.\nBlogging went mainstream in the mid 2000s. When I started, in 2006, there were a good number of RV travelers that already had blogs. It was something new, something fresh, and the bubble of people getting into the RVing life in those years were quick to respond. In our first years on the road, (2007 – 2008-ish) the vibe was that every RVer needed a blog. In fact, there were seminars at rallies that expressed that very sentiment. Blogging rapidly became a fad, something expected, something assumed. But, like all fads and meteors, expect it to brighten and fade.\nSince many bloggers were/are in it for the social networking aspect, it seems a natural evolution for blogs to migrate to tools designed for this purpose. I'm referring to today's more convenient and less time consuming options for keeping in touch with your “peeps”... Facebook, Twitter, etc., which now seem to be the locus of the “look at what I did today” bunch. It's also possible that I'm looking at a generational phenomenon here. We've all seen a pickup in the number of younger working-age folks who have become RVers and are able to earn a living while they travel. Groups like RVillage and Xscapers are the new generation of travelers with their own methods of keeping in touch, while my circle of reference is a collection of old fuddy-duddy blogs.\nIn any case, it's not a surprise that the blogs of RVers are fading away. Sure, there will always be a hardcore few, but the bubble will deflate, and the world will continue to turn.", "source": "Thom and Dar's Sabbatical Journal"}