{"published": "2015-09-01T16:37:50Z", "media-type": "News", "title": "Dianne Williamson: No biz like ghost biz", "id": "ce407e65-50be-46a9-93cd-929140b62c91", "content": "One thing you can say about Vatican leaders — they show great faith in heavenly happenings, but rarely fall for the earthly ones. In this case, the Vatican has set its investigative sights on one of the biggest scams in the apparition business, long known to play parlor tricks on the desperate and faithful throughout the world. A popular shrine known as Our Lady of Medjugorje in Bosnia and Herzegovina is being investigated regarding claims that the Virgin makes regular and even prompt appearances, and has been hovering around the site since 1981, when she appeared to six children to reportedly convey the message that no one can pronounce Medjugorje and the name should be changed. She was ignored, which is probably why she’s still skulking around. No, I jest. She supposedly conveyed a message of peace to the kids, who are now adults and clearly know a good gig when they invent it, as Medjugorje has become a major tourist destination, and the kids aren’t doing too badly, either. In 1988, the shrine even attracted one of Worcester, Massachusetts’ better-known “victim souls,” the late Audrey Santo or “Little Audrey,” who was brought there by her mother. The enterprise I dubbed Audrey Inc. was also investigated by the local diocese and still seeks donations on social media. More on that later. In any case, the Vatican is due soon to reveal the results of its investigation into this popular religious destination, but Pope Francis recently injected some papal humor that leads one to believe it’s not looking good for the believers. In July, he said Catholics shouldn’t be expecting “visionaries who can tell us exactly what message Our Lady will be sending at 4 o’clock this afternoon.” Ha, ha! OK, so maybe Francis is no laugh riot. He’s the pope, for goodness sake, not Louie C.K. But if I were an apparition, I certainly wouldn’t want the leader of the Roman Catholic Church cracking jokes at my expense, especially when my very existence was in doubt. And it’s not only the apparition in jeopardy. Medjugorje was a poor village before the Virgin popped in, but now it’s home to hotels, restaurants and lots of souvenir shops. The active Medjugorje website says people “owe it to yourself and your loved ones” to check out the myriad healings and miracles that occur there. The Vatican, meanwhile, said dioceses shouldn’t organize official pilgrimages, although it’s basically OK to swing by if you happen to be in the neighborhood. Speaking of neighborhoods, Worcester, Massachusetts, is also home to some spiritual shenanigans over on South Flagg Street, headquarters of the Little Audrey Santo Foundation. Audrey was pulled unconscious from the family swimming pool in 1987 at age 3, rendering her in a state known as akinetic mutism. So the family turned the home into a popular shrine complete with a gift shop filled with Audrey memorabilia, such as refrigerator magnets and mousepads. The tragic girl, meanwhile, was placed on public display, amid typical claims of weeping statues, flowing mystery oil, bleeding Communion wafers and the like. Page 2 of 2 - As noted, Audrey’s mother tried to take the girl to Medjugorje in 1988, but Audrey suffered cardiac arrest near the site and had to be rushed home by air ambulance at a cost of $25,000, a bill her grandmother mortgaged her home to pay. Rather than conclude that this poor child couldn’t handle the strain of travel, her mother attributed the heart failure to the presence of a nearby abortion clinic. Audrey died in 2007 at 23, and her supporters have since launched a campaign to canonize her. The Santo Foundation is still active; calls placed to the listed number urge people to “save the date” of Dec. 19, Audrey’s birthday, for a healing Mass. It also accepts donations. But the phenomenon of Little Audrey, also known as Little Fraudrey by skeptics, made diocese leadership uncomfortable. A probe was launched, and a commission report concluded, “One cannot presume that the inability to explain something automatically makes it miraculous.” In other words, the commission may well have asked, “Were we the only ones who saw the lab analysis by The Washington Post that showed the ‘mystery oil’ actually contained soybean oil and chicken fat? Does that sound miraculous to you people?” I’m guessing that the report into Medjugorje reaches the same general conclusion. Religious apparitions may be big business, but they don’t have a ghost of a chance at Vatican validation. Dianne Williamson is a columnist for The Worcester (Mass.) Telegram & Gazette.", "source": "Wicked Local Mansfield"}