{"published": "2015-09-30T09:07:06Z", "media-type": "Blog", "title": "Slow cooker brisket and gravy", "id": "089b3d29-78fa-465f-91f2-d52e8ff45814", "content": "Slow cooker brisket and gravy is fast becoming my favourite lazy Sunday lunch. It’s just a matter of throwing a few ingredients into the slow cooker on Sunday morning, then going off for the day and coming home to delicious melt in the mouth brisket and a rich onion gravy. \n \nCouldn’t be easier, right? Here’s the how to make it… \n      Lightly grease the slow cooker pan. Throw in a handful of roughly chopped onions.  Add a handful of scrubbed carrots.  Place the brisket on top and season with salt and pepper.  Pour over the beef stock   \nThat’s it! Then just slow cook on low for around 8-9 hours until the meat is literally falling apart. Remove the meat and the chunky carrots from the slow cooker and thicken the onion gravy using a teaspoon of cornflour mixed into a drop of cold water. \n \nI serve the brisket with Yorkshire puddings, roast potatoes and a selection of vegetables, pour over the gravy and there you have a deliciously easy Sunday dinner. \n \n    Print Slow cooker brisket and gravy   \nPrep Time: 15 minutes \n\nCook Time: 8 hours \n \nYield: Serves 4-6 \n   \n  \n\nDeliciously easy slow cooker brisket in gravy. \n\nIngredients \nOlive oil 2 onions roughly chopped handful of carrots 1-1.5kg joint of brisket 300ml beef stock \nInstructions \nPreheat the slow cooker to low. Lightly grease the slow cooker pan with olive oil. Add the chopped onions and carrots. Place the brisket on top and season with salt and pepper. Pour over the hot beef stock. Cook in the slow cooker for around 8-9 hours until the beef is falling apart. Once the brisket is cooked remove it from the gravy along with the carrots, then thicken the onion gravy using a teaspoon of cornflour stirred into a drop of cold water. 3.1 http://daisiesandpie.co.uk/slow-cooker-brisket-and-gravy/ \n \nYou might also like our slow cooker hotpot , thrifty and yum.", "source": "Daisies & Pie"}