{"published": "2015-09-08T13:00:00Z", "media-type": "News", "title": "Neo4j Announces Star-Studded Speaker Lineup for GraphConnect San Francisco 2015", "id": "d5e0e131-b342-4d51-8cd8-fd56e178de90", "content": "Sessions by Cisco, Docker, Microsoft, Monsanto and the World Economic Forum Planned for Event Set to Draw a Record Number of Attendees \n  \nSAN MATEO, CA -- (Marketwired) -- 09/08/15 -- Neo Technology announced today speakers for its third annual GraphConnect conference, taking place October 21, with a training day set for October 22. GraphConnect is the world's only conference dedicated to the rapidly growing world of graph databases and will feature an all-star cast of speakers from Cisco, Docker, Microsoft, Monsanto, the World Economic Forum and other leading organizations. \n\n\"GraphConnect continues to be the single must-attend event for anyone interested in graph technology,\" said Emil Eifrem, CEO of Neo Technology. \"We look forward to this year's awesome agenda, which will deliver invaluable insight on how graphs are eating the world at leading organizations in every sector.\" \n     \nGraphConnect offers a rare opportunity to see and hear how some of the world's most recognizable brands are leveraging graph technology to solve their most critical connected data issues. Open to beginner and expert graphistas alike, this year's event is set to draw a record number of attendees, comprising of a mix of hackers, senior-level developers, IT architects, technical managers and CTOs. \n\nWith four tracks and more than 30 sessions, along with lightning talks, GraphConnect offers a rare opportunity for all, regardless of their familiarity, to learn about graph databases. Technology leaders will discuss the business value of graphs in the business impact track while solution architects will share application development best practices. The Neo4j learning track aims to provide valuable tips and tricks to developers who are actively developing an application. \n\nConfirmed GraphConnect San Francisco 2015 speakers include: \nPrem Malhotra, Director of Collaboration Architecture, Cisco Patrick Chanezon, Member of Technical Staff, Docker Karen Lopez, Senior Project Manager and Architect, InfoAdvisors Hamish Boland-Rudder, Online Editor, International Consortium of Investigative Journalists (ICIJ) David Makogon, Senior Azure Architect, Microsoft Tim Williamson, Data Scientist, Monsanto Josh Long, Spring Developer Advocate, Pivotal Scott David, Director, Head of Information Interaction, World Economic Forum Mahesh Chaudhari, Chief Architect, Zephyr Health \nThe conference will also feature presentations by Neo Technology's CEO Emil Eifrem, Chief Scientist Jim Webber and Senior Engineer Ian Robinson -- all graph database experts and co-authors of the popular O'Reilly Media book, Graph Databases . \n\nThis year's event sponsors feature an impressive list, including IBM, Tom Sawyer, GraphAware, GraphStory GrapheneDB, Linkurious, Structr and GraphGrid. \n\nRegister for GraphConnect San Francisco Today \nGraphConnect San Francisco 2015 will take place on Wednesday, October 21 at Pier 27 on The Embarcadero, with a training day set for Thursday, October 22. For more information and to register, visit: http://www.graphconnect.com \n\nUseful Links \n\nAbout Neo Technology \nNeo Technology is the creator of Neo4j, the world's leading graph database that brings data relationships to the fore. From companies offering personalized product and service recommendations; to websites adding social capabilities; to telecom providers diagnosing network issues; to enterprises reimagining master data, identity, and access models; organizations adopt graph databases as the best way to model, store and query both data and its relationships. Neo Technology researchers pioneered the modern graph database and have been instrumental in bringing the power of the graph to numerous organizations worldwide. Large enterprises like Walmart, eBay, UBS, Nomura, the InterContinental Exchange, Cisco, CenturyLink, HP, Telenor, TomTom, Lufthansa, and the National Geographic Society, as well as startups like CrunchBase, Medium, Polyvore, Zephyr Health and Elementum use Neo4j to unlock business value from data relationships. \n\nNeo Technology is a privately-held company funded by Fidelity Growth Partners Europe, Sunstone Capital, Conor Venture Partners, Creandum and Dawn Capital, and is headquartered in San Mateo, CA, with regional offices in Sweden, UK, Germany, France and Malaysia. For more information, please visit Neo4j.com .", "source": "MoneyShow.com"}