{"published": "2015-09-22T02:33:36Z", "media-type": "Blog", "title": "Lemon Drizzled Artichoke Bacon Galette", "id": "4dd2ed21-e784-4827-8a9b-d70fed127d49", "content": "Tags : None Lemon Drizzled Artichoke Bacon Galette\nIngredients: 1 Sheet Frozen Puff Pastry Dough 1 cup Marinated Artichoke Hearts, quartered and drained ¼ cup Oil Packed Sun-dried Tomatoes, drained 1 cup Grated Smoked Gouda Cheese 4 slices Crisp Bacon, cut in bite sized pieces Finely Grated Zest From One Lemon 1 Tbsp Olive Oil 1 tsp Crushed Garlic 2 Tbsp Fresh Lemon Juice ¼ tsp Hot Sauce or, to taste ½ tsp Agave Syrup or Honey 1 tsp Cornstarch 1 Tbsp Minced Parsley 1 Tbsp Minced Basil Plus Extra, for garnish ⅛ tsp Table Salt ¼ tsp Agave Syrup or Honey 8 oz Mascarpone Cream Cheese, softened 4 Tbsp Lemon Curd Directions: Heat oven to 400 degrees. Thaw puff pastry for 40 minutes, then unwrap and unfold onto baking sheet. Arrange artichokes and tomatoes on pastry sheet, leaving a 1 inch border around edge. If needed, cut artichokes into bite sized piece. Sprinkle with cheese, bacon, and lemon zest. Fold edge of dough over 1 inch of artichoke mixture, pleating dough. Bake the galette in oven for 22-25 minutes, or until pastry is golden brown. Meanwhile, in a small saucepan, heat olive oil and crushed garlic on medium until garlic is just turning golden, 1-2 minutes. Add lemon juice, hot sauce, and agave to garlic, stirring frequently. Mix cornstarch with 1/4 cup water, add to saucepan, then turn heat to medium high and cook until bubbly and thick. Turn heat off and stir in parsley, basil, and salt. Taste and adjust heat and saltiness with hot sauce and salt, then set aside. Prepare the Lemon Mascarpone Cheese by mixing mascarpone and lemon curd in a small bowl until smooth and set aside. Remove baked galette from oven and drizzle with lemon garlic sauce and a dollop in the center of lemon mascarpone cheese. Sprinkle with fresh basil. Serve immediately.", "source": "incrediblyfreefreebies.yuku.com/directory"}