{"published": "2015-09-18T04:12:06Z", "media-type": "News", "title": "Patent Issued for Light Guide Body with Continuously Variable Refractive Index, and Devices Using Such Body (USPTO 9128220)", "id": "65f09ba0-1ae6-4ef3-92ca-4afc465e7422", "content": "By a News Reporter-Staff News Editor at Journal of Engineering -- From Alexandria, Virginia , VerticalNews journalists report that a patent by the inventors Ochi , Takashi ( Osaka , JP); Shibasaki, Masakazu ( Osaka , JP); Aoyama, Iori ( Osaka , JP); Iyama, Yuichi ( Osaka , JP); Kikuchi , Katsuhiro ( Osaka , JP), filed on November 25, 2011 , was published online on September 8, 2015 . \n \nThe patent's assignee for patent number 9128220 is SHARP KABUSHIKI KAISHA ( Osaka , JP). \n \nNews editors obtained the following quote from the background information supplied by the inventors: \"A non-self-emitting display device, such as a liquid crystal display device, for example, includes an lighting device called a backlight or frontlight. The backlight is provided on the rear side of a liquid crystal display panel. Light which is emitted from the backlight and transmitted through the liquid crystal display panel is used for display. The frontlight is provided on the viewer side (front side) of the liquid crystal display panel. Light which is transmitted through a liquid crystal layer of the liquid crystal display panel and then reflected toward the viewer side is used for display. \n \n\"An example of these lighting devices is an edge light type lighting device. The edge light type lighting device includes a light source and a light guide plate (a light guiding element in the form of a plate). In recent years, particularly, lighting devices in which a LED is used as the light source have been widely used. One or a plurality of LEDs are provided at one lateral surface or corner of a transparent light guiding element. Light emitted from the LEDs enters the light guiding element at the one lateral surface and propagates inside the light guiding element, before outgoing from the light guiding element. The ratio between the light propagating inside the light guiding element and the light outgoing from the light guiding element is adjusted according to, for example, the shape and density of recessed or raised portions formed in the surface of the light guiding element. For example, a minute prism pattern is formed across the viewer side surface of the light guiding element of the frontlight, so that light which is totally reflected at the interface between the light guiding element and the air propagates inside the light guiding element, and light which does not meet the total reflection conditions outgoes to the viewer side. By adjusting the angle of the slope surface of the minute prism and the length of the slope surface, the ratio between the propagating light and the outgoing light is determined. \n \n\"Patent Documents 1 and 2 disclose light guiding elements which do not have a minute prism pattern in the surface. These light guiding elements have a plurality of light guiding layers (light guiding element pieces) which have different refractive indices, and the plurality of light guiding layers are arranged so as to form interfaces which are inclined with respect to the principal surface of the light guiding element. Part of light incoming from the lateral surface of the light guiding element is refracted at the interfaces so that the traveling direction of the light is changed, and for example, the light outgoes from the principal surface on the display panel side. Another part of the light incoming from the lateral surface of the light guiding element is reflected a plurality of times inside the light guiding element and by a reflection plate, and then refracted at the interfaces, before outgoing from the principal surface on the display panel side. \n \n\"On the other hand, the applicant of the present application developed an antireflection film which has a moth-eye structure (sometimes referred to as 'moth-eye type antireflection film'). The moth-eye structure has minute raised portions (which have a conical or bell-like shape), and the effective refractive index continuously varies. Therefore, the reflectance can be decreased to a level which is less than 1% and, furthermore, to a level which is not more than 0.2%. Further, the moth-eye type antireflection film is capable of preventing reflection over a wide wavelength range of light and has a wide incidence angle range as compared with an antireflection film which is manufactured with the use of a dielectric multilayer film (Patent Documents 3 to 6). One of the moth-eye structure fabrication methods which uses an anodized porous alumina layer that is obtained by anodization of aluminum is excellent in mass-productivity (Patent Documents 4 to 6). It is preferred that, in a moth-eye structure which is suitable for an antireflection film, the two-dimensional size of the raised portions (the diameter of the raised portions which have a conical or bell-like shape) is not less than 10 nm and not more than 500 nm, the distance between adjacent raised portions is also not less than 10 nm and not more than 500 nm, the height of the raised portions is not less than 100 nm and not more than 500 nm, and the two-dimensional distribution of the raised portions has no regularity. The entire disclosures of Patent Documents 3 to 6 are incorporated by reference in this specification. \n \n\"Patent Document 7 discloses a light guiding element for front light, which has a moth-eye structure over its surface.\" \n \nAs a supplement to the background information on this patent, VerticalNews correspondents also obtained the inventors' summary information for this patent: \"Technical Problem \n \n\"However, the light guiding element disclosed in Patent Document 1 or 2 utilizes not only refraction but also reflection at the interfaces inside the light guiding element, and therefore, disadvantageously, the light utilization efficiency cannot be improved. Particularly when the light guiding element disclosed in Patent Document 1 or 2 is used as a frontlight, light incoming from the viewer side to be incident on the light guiding element is reflected by the interfaces inside the light guiding element, and therefore, the light utilization efficiency is low. In the light guiding element disclosed in Patent Document 1 or 2, disadvantageously, it is difficult to control the light distribution. \n \n\"Even when a moth-eye structure is formed in the surface of the light guiding element as disclosed in Patent Document 7, only the surface reflection can be prevented while the reflection by the interfaces inside the light guiding element cannot be prevented. \n \n\"The present invention was conceived for the purpose of solving the above problems. One of the objects of embodiments of the present invention is to provide a light guiding element of high light utilization efficiency in which reflection by the interfaces inside the light guiding element is prevented, and an lighting device and display device which include such a light guiding element. \n \n\"Solution to Problem \n \n\"A light guiding element of an embodiment of the present invention is a light guiding element having a first principal surface, a second principal surface which opposes the first principal surface, a first lateral surface which intersects with the first principal surface and the second principal surface, and a second lateral surface which opposes the first lateral surface, the light guiding element being capable of allowing light incoming from the first lateral surface to propagate between the first principal surface and the second principal surface, wherein the light guiding element includes a portion in which a refractive index varies substantially continuously from the first principal surface toward the second principal surface. \n \n\"In one embodiment, the light guiding element has a plurality of raised portions which are two-dimensionally arranged between the first principal surface and the second principal surface. A two-dimensional size of the plurality of raised portions is not less than 10 nm and not more than 500 nm, and a distance between adjacent ones of the plurality of raised portions is not less than 10 nm and not more than 500 nm. \n \n\"In one embodiment, the plurality of raised portions are protruding from the second principal surface toward the first principal surface. \n \n\"In one embodiment, gaps between adjacent raised portions are filled with a material whose refractive index is lower than that of a material of the plurality of raised portions. In this case, it is preferred that the first principal surface is a flat surface. \n \n\"In one embodiment, gaps between plural ones of the plurality of raised portions which are provided on a side that is closest to the first principal surface are filled with air. \n \n\"In one embodiment, the light guiding element includes a plurality of light guiding layers between the first principal surface and the second principal surface, the plurality of light guiding layers including a first light guiding layer and a second light guiding layer which is provided on a second principal surface side of the first light guiding layer, wherein each of the first and second light guiding layers has the plurality of raised portions, and a refractive index n1 of the raised portions of the first light guiding layer is smaller than a refractive index n2 of the raised portions of the second light guiding layer (n1", "source": "4 Traders"}