{"published": "2015-09-06T03:30:46Z", "media-type": "News", "title": "Kyle Schwarber expected to miss Cardinals series   unless he doesnapos;t", "id": "9752fbe3-d9d8-42b1-83b4-d6a76aa6d695", "content": "Cubs center fielder Dexter Fowler, left, throws the ball to third baseman Kris Bryant after getting an out.Cubs center fielder Dexter Fowler, left, throws the ball to third baseman Kris Bryant after getting an out.Cubs center fielder Dexter Fowler, rear,  is congratulated by  third base coach Gary Jones  while rounding the bases after hitting a home run during the fifth inning.Cubs center fielder Dexter Fowler, rear,  is congratulated by  third base coach Gary Jones  while rounding the bases after hitting a home run during the fifth inning. Kyle Schwarber feels like he can play, despite a mild rib cage strain from Wednesday that has sidelined him.But the Cubs want the prize rookie to be 100 percent before he returns to the lineup, and won't evaluate him until Monday or Tuesday in St. Louis.Can Schwarber be back for the last game or two of the upcoming Cardinals series?\"That's my goal is to get back for that series,\" he said Friday.Manager Joe Maddon wouldn't budge when asked Saturday if Schwarber might return in St. Louis.\"I would say probably not, but I don't know that,\" Maddon said. \"I'd have to guess.\"Maddon knows Schwarber thinks he's ready to return and is not surprised.\"He does (think that), but listen, he's pretty tough,\" Maddon said. \"Nothing would surprise me, but mentally, preparation-wise, I would prepare to not have him available. … But you never know.\"In short, Maddon doesn't really want the Cardinals to know if Schwarber is available, even if he's not. Twenty-something: For the last year the question was who eventually would wind up at shortstop — Starlin Castro, Javy Baez or Addison Russell? It turned out to be Russell, though all three were together in Saturday's starting lineup, with Baez at third and Castro at second, while Kris Bryant moved to left.Maddon said he's impressed with how Baez has handled a difficult season at age 21.Cubs catcher David Ross talks about pitcher Jake Arrieta.Cubs catcher David Ross talks about pitcher Jake Arrieta.\"At 21?\" Maddon said. \"I'm just worried about where I'm going out Friday night (at 21). That's it. The weekend began Thursday. Speakers out the windows. A little party in the fraternity on a Friday night. That's when I was 21. That's it. That was all I was worried about.\" Time marches on: Former Cub Mark Grace, now a Diamondbacks' coach, believes the two new video boards fit in well at Wrigley Field.\"You still have the old stuff here,\" he said. \"You have two very important millennial things that every ballpark has had for years and years. I think it's a good change.\" Extra innings: The Cubs released reliever Rafael Soriano, who had been designated for assignment Monday. … The White Sox claimed third baseman Mike Olt on waivers. … With a 42-28 record at Wrigley Field, the Cubs have surpassed their total of home victories from 2014 (41-40). … Dexter Fowler's home run gave the Cubs at least one in the last 14 home games. The last time they did that in 15 straight home games was from April 14 to May 26, 1991.", "source": "LocalNews7.com"}