{"published": "2015-09-01T01:31:00Z", "media-type": "News", "title": "Todd Bowles says Redskins' Robert Griffin not his concern", "id": "ea1f04b4-9e46-4b72-bc88-6230a27936af", "content": "FLORHAM PARK, N.J. -- Redskins coach Jay Gruden on Monday officially named Kirk Cousins his starter over Robert Griffin III, the former Heisman winner and No. 2 overall draft pick in 2012 from Baylor. He still is recovering from a concussion, the latest in a long line of injuries that have stalled his career. \n \nTodd Bowles was asked if the Jets have interest in Griffin if he becomes available, and the coach sidestepped. \"He's on the Redskins, and we have our guys right now,\" Bowles said. \"That's not my concern.\" \n \nOne of Bowles' guys is rookie Bryce Petty, who was third- string at Baylor behind Griffin and Nick Florence as a freshman. Asked about the descending arc of Griffin's NFL career, Petty said: \"It's been unfortunate as far as the injuries. You never want to see a player crippled by injuries. \n \n\"He has a lot of faith. Wherever God puts him, he's going to be successful. It might not be with the Redskins. But Griff is going to attack everything with a full head of steam.\" \n \n\r\n\t        \t\t\t\t\t\t\r\n\t        \r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\t\r Snaps for Flynn, Johnson \n \n\r\n\t        \t\t\t\t\t\t\r\n\t        \r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t   Bowles said current Jets starter Ryan Fitzpatrick will not play in Thursday's preseason finale against Philadelphia. He's uncertain about Petty because veterans Matt Flynn and Josh Johnson, who were signed in training camp after starter Geno Smith suffered a broken jaw in a locker room incident, haven't played yet. \"As much as [Petty] needs playing time, I need to see the other two guys play, too,\" Bowles said. \n \nFlynn has recovered from hamstring and ankle injuries, and he practiced in full Monday. \"If he stays healthy this week and has a good week of practice, he'll play,\" Bowles said. \n \nUncertainty about Flynn's health led to Johnson's signing last week after he was released by Cincinnati. \"We were trying to have a Plan B,\" Bowles said. \n Jets streams\r\n\t        \t\t\t\t\t\t\r\n\t        \r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\t\r \n\r\n\t        \t\t\t\t\t\t\r\n\t        \r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t   For the first time since being injured, Smith practiced in a limited way. \"He threw the ball some,\" Bowles said. \"He took some center snaps, but nothing full speed.\" . . . WR Jeremy Kerley (concussion) no longer has headaches but still must pass tests of the concussion protocol . . . WR Eric Decker was excused from practice for personal reasons . . . WR Brandon Marshall, OG Willie Colon, OLB Calvin Pace and OT James Carpenter were given a \"rest day.\"", "source": "Newsday"}