{"published": "2015-09-28T14:36:20Z", "media-type": "Blog", "title": "To the Arctic with JacksGap", "id": "a3a59992-1635-433a-8a8e-f853d2182055", "content": "I’m in the Arctic with JacksGap and glaciologist Professor Alun Hubbard. JacksGap are twin brothers Jack and Finn, accompanied by award-winning cameraman Tim Kellner. They are an online blog and video sensation with a massive reach to a young audience and a zeal for telling stories well. Alun has been at the forefront of research on the Greenland Ice Sheet for the last decade, and shares my passion for both polar regions. \n Jakobshavn glacier, Arctic © Rod Downie  The Science and Communications Mission  \nWe’re here on a science and communications mission, to investigate and document the unprecedented rate of flow and melt of the Greenland ice sheet as a result of climate change. The Arctic is warming about twice as fast as the global average, and the ice sheet is losing mass at an accelerating rate. \n Jack and Finn filming on the greenland ice sheet, Arctic © Rod Downie  Phase 1: Downloading data on the Greenland Ice Sheet  \nPhase 1 of our mission involves flying up onto Russell Glacier and 100 km inland from the edge of the Greenland Ice Sheet. Underneath us, rumpled folds of crevassed glacier give way to smoother, gently sloping ice sheet. We’ve come here to dig out, service and download data from a transect of half a dozen GPS and weather stations. These simple, isolated instruments are almost indiscernible in the vast white landscape of the Greenland Ice Sheet, yet they play a critical role recording the rate of ice flow and how it is responding to the last decade of record climate warming of this seemingly slumbering beast. \n Rod at the camp, Arctic © WWF-UK  \nWe are overwhelmed by the sheer scale and stark beauty of the landscape.  At 1.7 million km2, the ice sheet is about 7 times the size of the UK, and in places, the ice below us is 3km deep. It looks deceptively static – yet it’s creaking and groaning as it advances imperceptibly towards the sea.  ‘It’s a vast frozen reservoir of water’ Alun explains. ‘The outlet glaciers transport ice to the coast where it melts or calves icebergs and the ice sheet is already contributing about 1 mm a year to global sea level rise’. \n \nIf carbon emissions continue unabated, the Greenland Ice Sheet has the capacity to raise sea levels by about six or seven metres, putting many of the world’s major cities like London, New York, Rio and Tokyo under water. This may become one of the biggest societal and economic challenges that humanity has to face in the future, yet it’s almost unimaginable outside a Hollywood film script. \n Phase 2: Timelapse images of the receding Jakobshavn glacier  \nPhase 2 of our mission takes us up the Ilulissat Icefjord, an UNESCO World Heritage Site, to Jakobshavn Isbrae. This is the biggest glacier in the northern hemisphere and probably the fastest flowing glacier in the world. It moves at a rate of up to 47 metres a day, and it has receded by more than 10 km since the start of the millennium. The ice front below is like a war-zone, a chaotic turmoil of bergs in all shapes and sizes that have broken off the glacier face and refrozen into the water below. \n Time lapse imaging, Arctic © Rod Downie  \nIn Greenland, the short summer season is over and we are on the cusp of winter, but temperatures have been mild, hovering just below zero as we set up camp on a newly exposed area of ground looking across the expanse of the glacier.  Three years ago, when Alun was last here, this was ice. Now it’s a barren ‘nunatak’ – an island of rock in the vast expanse of ice. \n \nWe download images from two Extreme Ice Survey time-lapse cameras, revealing dramatic images of the changing glacier front, including the calving of a massive 12.4 km2  section of the ice front in mid-August. These images will serve as an important archive of the history of this majestic glacier. It is reputed to have been an iceberg that calved off from where we are standing that sank the Titanic a century ago. \n The Future  \nI’m glad we took JacksGap to the Arctic to experience and document the effects of climate change. I feel inspired and invigorated by their youthful inquisitiveness, optimism and tenacity. They believe that they are the first generation to grow up with climate change and the last that can do anything about it. So working with them over the last 10 days has given me renewed hope that we can tackle climate change together. We already have much of the technology that we need to generate clean renewable energy and use it efficiently, and that will only improve with the innovation and design that Jack and Finns’ generation are driving forward. \n Jack, Finn and Rod Downie, Arctic © WWF-UK  \nIf they see themselves as the first generation to grow up with climate change, that means that my generation owes them a massive debt. Yes – a sustainable planet for the future will depend upon them, but it also depends upon the political will and financial backing of my generation – it’s time to get real and to deliver ambitious targets and meaningful action to tackle climate change.", "source": "WWF UK Blog"}