{"published": "2015-09-01T07:03:39Z", "media-type": "News", "title": "Neovacs Receives First Regulatory Approvals for a Phase IIb Trial of IFNa-Kinoid in Lupus", "id": "cfd6b317-97da-4261-932e-33ba7ef3f377", "content": "GlobeNewswire \n2015-09-01 \nIFN-K-002 Clinical Trial to Launch in Coming Weeks \nPARIS and BOSTON, Sept. 1, 2015 (GLOBE NEWSWIRE) \n-- NEOVACS (Alternext\nParis:ALNEV), a leader in active immunotherapies for the treatment of\nautoimmune diseases, today announced that it has been granted first\napprovals by regulatory agencies and ethics committees in several\nEuropean countries for a Phase IIb clinical trial of IFNalpha-Kinoid in\nSystemic Lupus Erythematosus (SLE) or lupus. \nThe upcoming trial was notably assessed favorably using the Voluntary\nHarmonization Procedure (VHP) of Europe's Heads of Medicine Agencies,\nwhich allows for a harmonized assessment of clinical trials by relevant\nnational health authorities. \n\nAcceptance by competent authorities enables Neovacs to initiate\nIFN-K-002, a Phase IIb clinical study to assess the biological and\nclinical efficacy of Neovacs' lead active immunotherapy product\ncandidate IFNalpha-Kinoid in patients suffering from lupus. Inclusion\nof first patients is expected to begin in the coming weeks. Approvals\nfrom other European, Asian and Latin American countries are expected in\nthe second half of 2015. \n\nPhase IIB trial design for IFN-K-002 in SLE \n\nIFN-K-002 is a double-blind, randomized, placebo-controlled\nmulticentric Phase IIb clinical trial designed to assess the efficacy\nand safety of IFNalpha-Kinoid in moderate to severe lupus patients. The\nstudy will recruit 166 patients across 19 countries in Europe, Asia and\nLatin America. \n\nThe co-primary endpoints for the trial are biological efficacy and\nclinical efficacy nine months after first immunization with\nIFNalpha-Kinoid. Biological efficacy is defined as IFNalpha-signature\nneutralization, while clinical efficacy will be measured by the\nBILAG-based1 Composite Lupus Assessment (BICLA) response. \n\nTimelines for the study \n\nRegulatory and ethics committee approvals pave the way for a rapid\ninitiation of the study IFN-K-002. These centers will begin screening\nand immunizing patients in the coming weeks. Results of the clinical\ntrial are expected in the first quarter of 2017. \n\nAbout Neovacs \n\nCreated in 1993, Neovacs is today a leading biotechnology company\nfocused on an active immunotherapy technology platform (Kinoids) with\napplications in autoimmune and/or inflammatory diseases. On the basis\nof the company's proprietary technology for inducing a polyclonal\nimmune response (covered by five patent families that potentially run\nuntil 2032) Neovacs is focusing its clinical development efforts on\nIFNalpha-Kinoid, an immunotherapy being developed for the indication of\nlupus and dermatomyositis. Neovacs is also conducting preclinical\ndevelopment works on other therapeutic vaccines in the fields of\nauto-immune diseases, oncology and allergies. The goal of the Kinoid\napproach is to enable patients to have access to safe treatments with\nefficacy that is sustained in these life-long diseases. \n\n1 The British Isles Lupus Assessment Group (BILAG) is a validated index\nto measure lupus disease activity listed in FDA guidance on lupus. See\nFDA Systemic Lupus Erythematosus working group report at:\nwww.fda.gov/downloads/Drugs/GuidanceComplianceRegulatoryInformation/Gui\ndances/UCM072063.pdf#sthash.qR2f2REj.dpuf \n\nFor more information on Neovacs, please visit www.neovacs.fr", "source": "BizWire Express"}