{"published": "2015-09-14T04:51:15Z", "media-type": "News", "title": "Domestic and Global Project Management", "id": "042d0c50-eb55-4349-82bb-5c323c44f8a9", "content": "There are many similarities and differences between domestic and global project management. A project manager must realize that what might work in their country may not work in a foreign environment. Project managers might find themselves using practices that have worked for them in the past, without even thinking of the new environment, and issues may arise. Project managers need to understand the differences in a different country's environment to avoid and reduce any obstacles that there may be. Some considerations global project managers must consider are the legal, political, security, geographical, economic infrastructure, and culture implications of working with different countries (Gray, 2006). \nSome legal and political issues project managers should consider are staying within the laws and regulations of the country they are looking to work in. The foreign environment usually has protection of local workers, and may strongly influence how the different types of projects can be implemented. In addition, security is a high risk factor and must be considered when going to a foreign country. \nThe geography of a country is also a consideration that one should make. It is necessary in this case to assess what the weather is like such as; does it rain often or is it extremely hot. These considerations must be made and planned into the overall projects, as some of these challenges could cause the project to be delayed if you are working on a construction project. In addition, one must consider the economic infrastructure. It is important to find out how the foreign country conducts business, and how it could influence the project's success or failure. The infrastructure is important, as the project manager would need to know if services required for the projects are available, such as communication. It is important to assess if the project manager needs to be fluent in the foreign language. In addition, it may be necessary to know if there will be resources... \nView Full Essay", "source": "TermPaperWarehouse.com"}