{"published": "2015-09-29T20:30:00Z", "media-type": "News", "title": "DuPont Fabros Technology, Inc. Announces Over $2 Billion Invested In Ashburn, Virginia Under Sales Tax Exemption Program", "id": "48e04639-7f9a-425d-9935-38134247edcb", "content": "WASHINGTON , Sept. 29, 2015 /PRNewswire/ -- DuPont Fabros Technology, Inc. ( NYSE: DFT ) today announced that the sales and use tax exemption on its Ashburn, VA , campus is encouraging investment and making Virginia more competitive in creating and retaining high-tech jobs. Since January 1, 2009 the Company and its participating customers have invested over $2.2 billion on the DFT Ashburn campus. \n\nDFT's entire Ashburn campus benefits from the sales tax exemption legislation.  The exemption is effective through June 30, 2020 , and applies to purchases of servers and other qualified equipment that are the heart of a data center operation.  To obtain this exemption, DFT, and its customers, committed to invest at least $150 million from January 1, 2009 to June 30, 2016 .  DFT must also create and maintain at least 50 qualifying jobs within the Ashburn campus from July 1, 2009 to June 30 , 2016.  As of June 30, 2015 , the investment is fifteen times over the minimum commitment and 72 new qualified jobs have been created. \n   \nChristopher Eldredge , President and Chief Executive Officer, said, \" Northern Virginia has become the strongest data center market in the United States in part due to this tremendous sales tax exemption program offered from the Commonwealth of Virginia.  To date, our customers at the Ashburn Campus have invested over $1.5 billion dollars in infrastructure, which has resulted in over $50 million in tax savings.  This exemption has helped us expand our data center portfolio by attracting new customers and expanding on our existing relationships.\" \n\nAbout DuPont Fabros Technology, Inc. \nDuPont Fabros Technology, Inc. ( NYSE: DFT ) is a leading owner, developer, operator and manager of enterprise-class, carrier-neutral, large multi-tenant wholesale data centers. The Company's facilities are designed to offer highly specialized, efficient and safe computing environments in a low-cost operating model. The Company's customers outsource their mission-critical applications and include national and international enterprises across numerous industries, such as technology, Internet content providers, media, communications, cloud-based, healthcare and financial services. The Company's 12 data centers are located in four major U.S. markets, which total 2.9 million gross square feet and 256 megawatts of available critical load to power the servers and computing equipment of its customers. DuPont Fabros Technology is a real estate investment trust (REIT) headquartered in Washington , D.C. For more information, please visit www.dft.com \n\nLogo - http://photos.prnewswire.com/prnh/20120104/MM29780LOGO  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/dupont-fabros-technology-inc-announces-over-2-billion-invested-in-ashburn-virginia-under-sales-tax-exemption-program-300151042.html \n\nSOURCE  DuPont Fabros Technology, Inc.", "source": "Good Day Sacramento"}