{"published": "2015-09-01T21:56:02Z", "media-type": "Blog", "title": "Coast Guard stops 2,900 pounds of marijuana south of Point Loma", "id": "421fe652-e279-4ea4-9a43-727642e658ad", "content": "SAN DIEGO – The Coast Guard, in coordination with the San Diego Regional Coordinating Mechanism, prevented an estimated 2,900 pounds of marijuana from reaching U.S. shores when they thwarted a smuggling attempt approximately one mile south of Point Loma, Saturday. \n \nDuring a routine boarding of the 43-foot sport-fishing vessel Pasa Tiempo, a boarding team from the Coast Guard Cutter Adelie discovered bales of suspected marijuana. \n \nThe Adelie crew escorted the vessel to the customs dock at Shelter Island, in San Diego, where an interagency boarding was conducted by the crew of the Adelie and U.S. Customs and Border Protection Offices of Field Operations, Office of Air and Marine interdiction agents. \n \nThe vessel, and a total of 168 bales of contraband was seized by CBP OAM. \n \nThe two people aboard the vessel were taken into custody by the Marine Task Force. \n \n“This interdiction demonstrates the determination of our crews, and efficacy of our strategy, to combat illicit smuggling,” said Capt. Jonathan S. Spaner, commanding officer of Coast Guard Sector San Diego. “Indeed, transnational organized crime poses threats of both safety and security to our Nation. With tremendous support from the community, the Department of Homeland Security and our partners in San Diego are working very hard to detect and diminish maritime trafficking in the region.” \n \nThe MTF and San Diego Regional Coordinating Mechanism are comprised of U.S. Customs and Border Protection’s Office of Field Operations, Office of Air and Marine, U.S. Border Patrol, Homeland Security Investigations, U.S. Coast Guard and other federal, state and local partners. Collectively, these regional partners conduct interagency operational planning and leverage agency authorities and jurisdictions to combat threat networks that seek to exploit the maritime approaches to the U.S. \n \nThe Adelie is an 87-foot Coast Guard cutter home ported in Port Angeles, Washington.", "source": "Coast Guard News"}