{"published": "2015-09-18T21:51:01Z", "media-type": "News", "title": "Dow sinks 290 points as Fed jitters swirl stocks", "id": "2fbc6511-4a1f-412a-948e-8d2686a40a51", "content": "Investors are suffering from a nasty Fed-fueled hangover. \n \nU.S. stocks retreated on Friday as frustration mounts over the Federal Reserve's vague plans to lift interest rates. The Dow declined 290 points points. The S&P 500 declined 1.6%, while the Nasdaq declined 1.4%. \n \nThe turmoil comes one day after the U.S. Fed announced that it was leaving its benchmark interest rate near 0%. Fed chief Janet Yellen said in explanation: \"The outlook abroad appears to have become more uncertain.\" \n \nShe was referring to the economic slowdown in China and its impact on the rest of the world, including the United States. \n \nHowever, the Fed's pronouncements -- and its focus on market turmoil -- had the effect of making investors even more nervous. Major stock markets in Europe, like Germany and France, fell over 2.5%. \n \n\"What the Federal Reserve has done is increase uncertainty,\" said David Kelly, chief global strategist at JPMorgan Funds. \"The stock market always hates uncertainty.\" \n \nFriday's selloff wiped out the stock market's gains for the week. The Dow is now down 8% on the year, while the S&P 500 is off 5%. Strong performance by tech and biotech stocks have kept the Nasdaq afloat. It's still up 2% this year. \n \nInvestors weren't quite sure exactly what signals were going to guide the Fed in the coming months. \n \nThe unemployment rate is already down to 5.1%, about half of where it was during the Great Recession. And the economy grew at a healthy clip of over 3% during the second quarter. \n \nGlobal market turmoil stayed its hand, the Fed said, even though the U.S. economy is growing nicely. \n \nThe Fed seems to be waiting \"for ideal conditions that realistically never seem to arrive,\" Rick Rieder, BlackRock's chief investment officer of fundamental fixed income, wrote in note to clients. \n \nBanking stocks continue to reel in the wake of the Fed decision as hopes that higher rates would translate to fatter profits on loans have been dashed. Shares of Regions Financial, KeyCorp and SunTrust Banks retreated more than 3% apiece. \n \nEnergy stocks are also sinking as crude oil plunged nearly 5% below $45 a barrel. Fears about global growth eating into oil demand have only been amplified by the Fed decision. \n \nCopper, another good gauge of economic sentiment, slid 3%. \n \nCommodity-centric stocks like Freeport McMoRan, Diamond Offshore Drilling and Transocean were among the biggest losers in the S&P 500 on Friday.", "source": "Social Dashboard"}