{"published": "2015-09-28T23:27:00Z", "media-type": "News", "title": "NFL backs ref in Cam Newton no-call", "id": "f0f000c5-443c-46b1-956e-51cdf43deae0", "content": "NFL vice president of officiating Dean Blandino said he trusts Ed Hochuli's version of events after Carolina Panthers quarterback Cam Newton claimed he was told by the veteran referee that he wasn't old enough to draw a personal-foul flag. \n \nNewton thought a penalty could have been called early in the fourth quarter when he was hit hard near the out-of-bounds marker by defensive tackle Tyeler Davison after throwing an incompletion in Sunday's 27-22 victory over the New Orleans Saints. \n\nNewton, 26, said Hochuli told him, \"You're not old enough to get that call.\" \n\n\"I was really baffled by what was said to me,\" Newton said Sunday of Hochuli. \"I was rolling out trying to string out the play and create some kind of opportunity to get a completion. The defensive lineman kind of hit me. It was close, right on the cusp, late hit, I don't know. \n\n\"The response I got was: 'Cam you're not old enough to get that call.' ... I didn't think you had to have seniority to get a personal foul.\" \n\nBlandino told NFL Network on Monday morning that Hochuli could be subject to discipline if it is proved the referee said what Newton claimed. \n\nBlandino said he talked with Hochuli, who denied uttering those words. \n\n\"I certainly wasn't there, but I've spoken with Ed,\" Blandino said. \"Ed was adamant that he did not say that. He told me that he said that 'the difference is you were running.' I think when you look at the tape it does look like Ed did say that, I think at one point. You can't see everything that Ed says, but he's adamant he didn't say it and I think that's where we are right now and we're just going to kind of move on from there. \n\n\"We would do an investigation, see if anybody was miked in the area, and we've had situations in the past where an official said something inappropriate to a player and we've disciplined them. So there is a process in place, and we would have to go through that process to see if we could pick up what was actually said.\" \n\nAn upset Newton continued to talk to reporters after the game. \n\n\"If he would have said he missed the call, that is one thing,\" the 6-foot-5 and 245-pound Newton said. \"But for his response to be what it was and I'm not old enough to get that call ... Geez! So heaven forbid he gets any rookies or they're gonna have a long day, man.\" \n\nPanthers coach Ron Rivera was not interested in discussing Newton's comments on the no-call. \n\n\"I've heard them,'' Rivera said. \"It was addressed by him yesterday and the league has addressed them, so we're going to leave it at that and move forward. \n\n\"I'm not going to address what was specifically was said. But certain situations, certain circumstances for a guy, the perception, the way it looks, could be different.'' \n\nBlandino supported Hochuli's decision not to throw a flag on the play. \n\n\"Cam was outside the pocket and he threw the ball on the run, so there are different protections for a quarterback that is running outside the pocket versus in the pocket,\" Blandino said. \"Outside the pocket you don't get the two-step protection, and so when you look at the play, Cam threw on the run, there was some contact, it wasn't late and it wasn't a foul.\"", "source": "KTXS-TV"}