{"published": "2015-09-16T19:43:31Z", "media-type": "Blog", "title": "Working With Books!", "id": "f556adb9-87d8-4f76-b122-321f7559229e", "content": "So, I was talking about starting new chapters in my last post and one of the very exciting and very new chapters that's started in my life is my new job.\n\nI've written about the physical struggle I've been through with my shoulders and arms the last year and it's been a whole lot of painful and not to mention, hard on me psychologically as well. It finally came to a point where I got the message that working in an office and sitting in front of the computer eight hours a day just wasn't going to work for me. My doctor and other specialists recommended me to end that chapter and start looking for a new one.\n\nHave you ever had that feeling that a particular opportunity was waiting for you to just open the door and let it in? This one felt kind of like that. Everything just happened so fast! I found a listing for a job at a bookstore very close to where I live and I just about had the time to send in my application before the deadline. Just a few days later I was called in for an interview and another few days later I was offered a job.\n\nI can't believe that out of the 400 people that applied for this job, I'm now the lucky one to be able to work with my passion and love. And that feeling of walking into my job and being surrounded by written words is such an amazing one.\n\nI now have a part time job that I really look forward to coming to and I have the time to work on getting even better physically. I also have time to work on the other sides of my book passion, like my writing, reading, blogging and YouTubing.\n\nI have a feeling that this is the start of something great! I can't wait to see what the future holds for me now!\n\nI'm very humble and grateful for everything. My new job, the people close to me, you readers and life in general! This life is such an amazing journey and even though parts of it is rough and messy, we must never give up!\n\nThat one amazing opportunity might be sitting around waiting for you too. You just have to take the chance, go out and go look for it!", "source": "GEEK HEAVEN"}