{"published": "2015-09-09T19:34:28Z", "media-type": "News", "title": "Never Be Late for Work by Riding Airwheel Intelligent personal transporter Standing electric scooter", "id": "8b562263-63bd-4383-9f52-0c1b8cc65b76", "content": "Cherry is an ordinary office worker who works in CBD. However, as a fresh graduate of college, she has to live far away from her office due to the high price of house in the city center. Every morning she must get up early and rush to the bus station. Because there are so many people waiting at the station, she have to spend nearly half an hour waiting for the bus. And the journey on the bus also takes her an hour or so. By the time she arrives at the office, she is already very exhausted and even late for work.\n\nHaving heard the complaint of Cherry, her friend recommended her a great transport that would help her weather the annoying situation. That is Airwheel electric scooter. This transport is not only small and portable but also has a strong power capacity. With the combination of the electric scooter and public transportation, it would take her less time to get to the office. So Cherry took the advice and bought one online. After she received the package, she only spent 10 minutes mastering the vehicle. Honestly, she found it very interesting to steer such a transport, for the riding mode felt like dancing somehow.\n\nWhen Cherry did use it for commutation, she realized how helpful the self-balancing scooter was. She rode the self-balancing scooter to the bus station and got off it ahead of time. If she took the short-cut from there, she would just need 10 minutes to get to the office. However, if she kept taking the bus, she had to spend another 50 minutes. So she took the previous option. Now every morning, she only spends 20 minutes on commutation and the time saved could be used for sleeping. Moreover, she is no longer late for work then. \n\nAs for office workers like Cherry, Airwheel electric two-wheeled scooter could be a great helper.", "source": "Digital Journal"}