{"published": "2015-09-12T16:24:52Z", "media-type": "News", "title": "Kelechi Iheanacho scores late winner as Manchester City beat Crystal Palace 1-0", "id": "cb108f46-ecb0-48b5-8c45-48add8074636", "content": "Kelechi Iheanacho scored a dramatic late winner within seconds of coming on against Crystal Palace to preserve Manchester City's 100 per cent record in the Barclays Premier League. \n \nThe 18-year-old Nigerian striker marked only his second senior appearance with an 89th-minute goal to sink Palace 1-0 at Selhurst Park. \n \nUntil the youngster's late arrival, City looked set to drop points for the first time this season, while an injury to Sergio Aguero added to what was shaping up to be a frustrating afternoon in south London. \n \nBut Iheanacho reacted first to bury the rebound from Samir Nasri's shot to keep City flying high at the top of the table. \n \nAguero had earlier limped off midway through the first half having failed to shake off the effects of a cynical trip by Palace skipper Scott Dann, and was replaced by £54million new boy Kevin De Bruyne. \n \nMoments later Yaya Toure's late tackle on James McArthur, for which he was only booked, angered Eagles boss Alan Pardew, who stormed past Manuel Pellegrini and was tugged back by the City manager. \n \nPardew, of course, has previous with Pellegrini following an infamous, foul-mouthed touchline spat when he was in charge at Newcastle two seasons ago. But he was less industrial with his language this time while insisting Toure should have been sent off for a \"terrible\" tackle, before the minor skirmish ended with a handshake between the rival bosses. \n   Promoted stories   \nPrior to that, Palace had been the more likely side to score with Yannick Bolasie firing over and forcing a low save from Joe Hart, Pape Souare's volley bouncing narrowly wide and Yohan Cabaye tumbling in the box under Fernandinho's challenge in what appeared a decent penalty shout, although the French midfielder did not appeal. \n \nAll City had to show for their endeavours was a Wilfried Bony header which was comfortably saved by Alex McCarthy. \n \nAguero's departure inevitably blunted City's attack still further for the rest of the first half, although De Bruyne did test McCarthy with one fierce drive in stoppage time. \n \nPalace could have gone in ahead at the interval, though, had Jason Puncheon's shot dipped a couple of feet lower or Bakary Sako hit the target with a presentable far-post volley. \n \nAfter the break De Bruyne gave a glimpse of his undoubted quality with a slide-rule pass which sent Jesus Navas racing clear. The Spanish winger appeared to have done the hard work by rounding McCarthy, but then shanked his finish into the side-netting. \n   \n Share article  \n   \nPalace's opportunity to nick the victory arrived 20 minutes from the end when Souare broke clear down the left and crossed for Puncheon, but England keeper Hart palmed his header clear to make it seven shut-outs out of seven for club and country this season. \n \nAs stoppage time, approached Nasri's shot was blocked by McCarthy but only into the path of Iheanacho, who made an instant name for himself by slotting home the winner.", "source": "Borehamwood Times"}