{"published": "2015-09-21T20:30:00Z", "media-type": "News", "title": "Number of Homes Gaining Value Falls to 57 Percent Nationwide", "id": "46b4ff8a-208b-4ef3-af5b-e2c9e636674f", "content": "NATICK, Mass. , Sept. 21, 2015 /PRNewswire-USNewswire/ -- The number of homes nationwide losing value on a monthly basis has more than tripled over the past year while the number of appreciating homes has fallen more than 12 percent, Allan Weiss , CEO of Weiss Residential Research reported today. \n\nDepreciating homes increased from 7.60 percent to 23.40 percent while the number of appreciating homes has fallen from 65.20 to 56.80 percent, according to an analysis of July data from \"canary homes\" that are indicators of price trends in Weiss Residential Research's databases of nearly 100 million homes. \n   \n\"While a majority of homes nationwide is still gaining value, the national trend is clearly downward.  With the decline in year over year prices in the existing home sales report released today by the National Association of Realtors, even the national median price reports are picking up on the trend, reflecting the growing of numbers homes that are changing from appreciation to depreciation.  In this environment buyers and investors should be careful to avoid buying properties that are losing value by reviewing metro and Zip code maps on Owners.com that show hyper-local trends in changing value,\" Weiss said. \n\nEven seven of the top ten Metro markets with the highest levels of appreciation in July saw a year over year decline in the percentage of homes gaining more than 1.5 percent. Reno, Nevada leads the nation in appreciating properties in July, with more than 91.4 percent gaining value on a monthly bases, though 93.7 percent were appreciating a year ago. Western and West Coast markets dominate the list of markets with the highest percentages of appreciating properties. \n\nBest Metros by Rising more than 1.5% \n\n2014 \n\n2015 \n\nReno, NV \n\n97.3% \n\n91.4% \n\nDenver-Aurora-Lakewood, CO \n\n96.9% \n\n90.0% \n\nPortland-Vancouver-Hillsboro, OR-WA \n\n95.5% \n\n86.8% \n\nFort Collins, CO \n\n96.0% \n\n86.5% \n\nFayetteville-Springdale-Rogers, AR-MO \n\n46.1% \n\n85.7% \n\nSan Jose-Sunnyvale-Santa Clara, CA \n\n93.6% \n\n81.1% \n\nDes Moines-West Des Moines, IA \n\n68.7% \n\n80.7% \n\nPort St. Lucie, FL \n\n92.5% \n\n78.7% \n\nStockton-Lodi, CA \n\n92.7% \n\n77.6% \n\nNashville-Davidson--Murfreesboro--Franklin, TN \n\n86.0% \n\n77.5% \n\nFayetteville, NC tops the list of the nation's ten worst metros in terms of the percentage of properties gaining value on a monthly basis in July.  Its percentage of appreciating homes fell from 22.9 percent in July 2014 to 18 percent in July 2015 . \n\nWorst Metros by Rising more than 1.5% \n\n2014 \n\n2015 \n\nFayetteville, NC \n\n22.9% \n\n18.0% \n\nLittle Rock-North Little Rock-Conway, AR \n\n30.1% \n\n20.4% \n\nBaltimore-Columbia-Towson, MD \n\n31.8% \n\n30.1% \n\nToledo, OH \n\n36.2% \n\n32.9% \n\nLancaster, PA \n\n42.5% \n\n39.4% \n\nGreensboro-High Point, NC \n\n43.6% \n\n40.9% \n\nChico, CA \n\n61.9% \n\n41.5% \n\nHartford-West Hartford-East Hartford, CT \n\n29.4% \n\n41.5% \n\nAugusta-Richmond County, GA-SC \n\n40.2% \n\n41.6% \n\nPeoria, IL \n\n26.5% \n\n41.7% \n\nConsumer seeking information about their homes and neighborhoods can see how values have changed and are forecasted to change in the next 12 months within 5500 Zip codes and 100 metros on Owners.com http://www.owners.com/  or http://www.weissindex.com/ . \n\nAbout Weiss Residential Research \nWeiss Residential Research LLC was founded to help fill the knowledge and innovation gap that lead to the great housing crash of 2007 as well as to help mitigate the financial risk of home ownership going forward.  WRR is a pioneer in next generation home price analytics.    Building on Weiss' unique expertise in repeat sales home price indexes, he has increased the resolution of market analysis by nearly 10,000-fold.  WRR has created nearly 50 million repeat sales indexes, one for each house, through the use of Big Data techniques, novel algorithms and by harnessing the power of massively parallel multi-CPU computing power.   \n\nWeiss' approach presents home price dynamics at the house level or any user defined aggregation. Instead of being forced to use arbitrary market definitions such as 'metro area', users can define their own markets such as 'all houses with a current value above $500,000 within a 50 mile radius of the Statue of Liberty.'  In some cases markets organically define themselves as can be seen by the clustering in our market maps and dynamic maps. New trends can therefore be discovered, new sub markets defined, compared and ranked.  \n\nFind out more about Weiss Residential Research:  https://www.weissindex.com \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/number-of-homes-gaining-value-falls-to-57-percent-nationwide-300146440.html \n\nSOURCE  Weiss Residential Research", "source": "U-T San Diego"}