{"published": "2015-09-24T10:39:20Z", "media-type": "News", "title": "4.2 billion people still don't have Internet access, and here's what might happen if they did", "id": "f09e8581-5df8-4db6-8f3d-227801086765", "content": "It turns out the world isn't as connected as most might have thought: 57 percent of people — or 4.2 billion — lack Internet access, according to findings by the United Nations Broadband Commission. \nAnd according to The Atlantic, the UN's stats uncover other interesting tidbits . \n\nOf the world's 7,100 languages, just five percent are represented on the Internet, and The Atlantic's article indicated 90 percent of people in the world's poorest 48 countries lack access. \n\nHowever, what's the largest takeaway? \n\nThe UN's goal to end 2015 with 60 percent of the world online isn't going to happen, according to Mic. \n\n\"Instead, they believe we'll be at 43.4% by the end of the year,\" Mic's piece read. \"That's 2.8% in growth since 2014, with that growth getting slower. Now they believe the world won't hit that 60% mark until 2021 at the very earliest.\" \n\nAccording to Mic, stalled growth in Internet access could prevent difference-makers in poor countries from achieving all they hope to: having Internet-connected phones that detect malaria and are used as fetal care monitors, textbooks and calculators. \n\nAn even smaller portion of women in developing countries utilize the Internet, and that stunts their potential to help lift communities out of poverty, a Project Concern International report stated. \n\nIf able to use the technology tools they need, 600 million women and girls could contribute to boosting the GDP \"across 144 developing countries by up to $18 billion,\" PCI reported. \n\nBoth prosperity and knowledge are at stake. \n\n\"One hundred eighty million women and girls would be able to generate more income, and nearly 500 million would improve their education level,\" according to PCI. \n\nThe UN's report seems grim, but Jon Fingas of Engadget pointed out a few positives . Fortunately, mobile data subscriptions should continue to increase, and by 2021, greater Internet access can complement that. \n\n\"That could prove to be particularly vital, since many of those who are still offline live in rural areas where telecoms can't (or simply won't) run landlines,\" Fingas wrote. \"While near-ubiquitous Internet is likely a distant prospect at best, it may not take long before high-speed data is the rule, rather than the exception.\" \n\nCNBC reported mobile cellular subscriptions exceeded 7 billion this year but like Internet access have \"slowed sharply.\" \n\nThe UN's report also informed readers of the importance of Internet \"landing\" in developing countries, showing how that led to economic promise in the likes of China and Brazil, Mic's article read. \n\n\"According to the report, countries where the Internet and mobile phones have taken hold — places like China, India and Brazil — market penetration has skyrocketed in just a few years,\" the piece stated. \"Others are left out entirely, creating a stark contrast between vividly networked countries and those still left out of the fruits of the Information Era.\" \n\nAccording to The Atlantic, 15 percent of Americans stated they don't use the Internet in a June study, compared with 48 percent who were asked the same question in 2", "source": "Coastal Courier"}