{"published": "2015-09-21T15:11:15Z", "media-type": "News", "title": "Pope Francis' gift to Castro: a challenging message from Cuban leader's old teacher", "id": "da53905b-45e7-4952-a79b-bec26d4687f7", "content": "fidelandfrllorentepublicdomain Staff  \r\n                    \r Monday, September 21, 2015 In Depth \r \r     Help us expand our reach! Please share this article on social media  \r  \n  \r \nThe Spanish-born priest emphasized that he maintained hope that he would be able to absolve Castro of his sins. He stressed the need for him to publically ask for forgiveness ¨because his sins were not only personal.¨ \n\r  \nHavana, Cuba, Sep 20, 2015 CNA.- Pope Francis met with Fidel Castro on Sunday and gave him a special gift: a book and two CDs with the homilies and songs of Father Armando Llorente, a Jesuit priest who was Castro’s school teacher. Before Father Llorente’s death, he publically asked for Castro’s conversion and repentance. \n\nFather Llorente was Castro’s teacher and mentor at Belen Jesuit Preparatory School, where Castro studied until he was 16 years old. \n\nIn 2007, in an interview given from exile in Miami, Florida, the priest asked to meet Castro and said he was willing to immediately go to Cuba and hear his confession. \n\n“The first thing that we would do would be to give each other a big hug, laugh and remember the adventures that we had together, which were many and very beautiful.” Then he would tell him: “Fidel, the moment of truth has arrived,” Llorent told the news agency Efe. \n\nThe Spanish-born priest emphasized that he maintained hope that he would be able to absolve Castro of his sins. He stressed the need for him to publically ask for forgiveness ¨because his sins were not only personal.¨ \n\nLlorente was a 24-year-old Jesuit novice when he was sent to Cuba in 1942 to finish his formation. When he was a teacher at the preparatory school, Castro was his best student and had many very good friends. \n\n \r\n\r \r \n\r Comments \r \n      Help us expand our reach! Please share this article on social media  \r  \n  \n\r\n                 \r Recent articles in the In Depth section", "source": "Boston Pilot"}