{"published": "2015-09-16T08:17:13Z", "media-type": "News", "title": "Guan Eng urges Sabah, Sarawak to unite in the name of democracy", "id": "81861707-4487-4202-8ce7-d880906880da", "content": "GEORGE TOWN : Malaysians in Sabah and Sarawak must unite with other democratic-minded countrymen to ensure the two states retain its right under the federal constitution, urged DAP secretary general Lim Guan Eng. \n \nAccording to Lim, peace-loving Malaysians must unite to defeat the racists and extremists so that Malaysia Day will be remembered as a holy day of unity and not disunity, where diversity is celebrated and not condemned. \n \n\"Sabahans and Sarawakians who love peace, freedom and justice must unite to defeat corrupt, racist and extremist. \n \n\"As one of the three entities that established Malaysia ,the battle begins today\", he said in his Malaysia Day message. \n \nThe Penang Chief Minister said  the provocation by the red-shirt rally by Umno members and supporters is a blatant campaign of hate and fear against non-Malays to divert attention from the corrupt practice of BN. \n \n\"By permitting this red-shirt rally that is filled with the rhetoric of threats of violence against non-Malays, the Prime Minister and BN is doing all they can to feed a sense of grievance, victimhood and resentment. \n \n\"However such rhetoric of hate can not solve our economic problems caused by GST and corruption as well as the increasing servitude to debt by Malaysian households, where our personal debt is now the second highest in Asia at 87% to our Gross Domestic Product (GDP)\", he said. \n \nHe added that Malaysian has sacral duty to the children to protect their future and that the same problems can only be resolved by collaborating together and not confronting each other with lies and hate. \n \n\"Only a democratic Malaysia can lift both Sabah and Sarawak out of poverty and fear of being overwhelmed by illegal foreigners and corruption,\" he said.", "source": "The Sun Daily"}