{"published": "2015-09-08T12:43:59Z", "media-type": "Blog", "title": "Celtics, Fox Reach Agreement", "id": "66206584-5906-4f42-a557-e4192f2bd599", "content": "July 1, 1991 There's nothing like a deadline to force action. The Celtics and Rick Fox faced one yesterday and, just after midnight, the two sides announced an agreement on a contract for the No. 1 pick.\nNo terms were announced, other than that it was the standard multiyear agreement. But Fox will get much more than the minimum $ 180,000 for first-round draft choices, a figure he stood to receive had he waited. The reason? The Celtics had $ 1.15 million available - the amount they paid Dennis Johnson in 1989-90 - until midnight. \nUnable to make a trade for someone to fit into that spot, the Celtics convinced Fox to sign now, or risk losing hundreds of thousands of dollars by waiting.\nWhile the signing means Fox will be eligible for rookie camp in three weeks, Celtics boss Dave Gavitt indicated recently that summer school at North Carolina will likely prevent Fox from attending.\nUntil the signing, the Celtics were prepared to use the money in another fashion. They were going to replace the 'base-year compensation' figure of a player to make him more valuable in a monetary sense.\nSome players have two numerical values; their salary and their base-year. In some instances, there can be a wide difference between the two and for a team over the salary cap, such as the Celtics, the lower, base-year figure comes into play when the player leaves the team, either via trade or retirement.\nBefore reaching agreement with Fox, the Celtics took care of one other important housecleaning as the club, literally, went on vacation for the week. It sent a qualifying offer to restricted free agent Kevin Gamble, maintaining his rights. That was a formality. But had they not done it, Gamble would have become an unrestricted free agent.\nThe qualifying offer was for $ 468,750 for the 1991-92 season, a figure that represents 125 percent of Gamble's 1990-91 salary. The figure does not, however, represent what the Celtics intend to pay Gamble or what the latter expects to receive. Negotiations between the two have not really started in earnest yet, but both sides want to make a deal and one should be completed before training camp.\nEven though the Celtics are well above the salary cap, they are not bound by any limits as to what they can pay to retain Gamble. Similarly, they can match any offer, regardless of the cost, to keep him. Gamble might attract a generous offer, but the threat of Boston's matching power might also dissuade a potential suitor.\nThe other two restricted free agents, A.J. Wynder and Dave Popson, were not tendered qualifying offers. That means that as of today, both players are unrestricted free agents and can sign with any team, Boston included. The Celtics, however, have no claim to their rights.\nPopson and Wynder would have had to receive $ 250,000 qualifying offers. If they make the team, it'll probably be for the $ 130,000 minimum.\nAlso today, unrestricted free agents can entertain bids and sign contracts. The Celtics are unable to do much of anything. Their payroll for next season is a staggering $ 20 million plus. And now that DJ's \"spot\" has been exhausted, they have no similar loopholes to sign players.\nThey can, however, attempt to re-sign any unrestricted free agent who last played with them, which means Popson, Wynder and Derek Smith.\nWhat also will happen today is that the recently rumored deals and personnel maneuvers will be consummated.\nAtlanta will say adieu to Moses Malone, Spud Webb and draftee Anthony Avent and bring in Blair Rasmussen and Travis Mays. The Nuggets will get Avent and then ship him to Milwaukee for the rights to Kevin Brooks, the 18th pick. The Hawks also will get Mays from the Kings in the Webb deal.\nThe teams had to wait until today to get the openings. Atlanta slides Rasmussen into Malone's slot and has Doc Rivers' slot available for Mays. Avent goes into Jack Sikma's spot in Milwaukee.", "source": "Lex Nihil Novi"}