{"published": "2015-09-03T06:14:32Z", "media-type": "News", "title": "Dalradian Announces Cost Saving Corporate Reorganization", "id": "c8c49e3e-5f46-4748-9b63-12c552f552f7", "content": "TORONTO, ONTARIO -- (Marketwired) -- 09/03/15 --   Dalradian Resources Inc. (TSX: DNA)(TSX: DNA.WT)(AIM: DALR) (\"Dalradian\" or the \"Company\") announced a downsizing and restructuring of the Company's management team and corporate office relocation. These changes are expected to result in annual savings of nearly 20% to the Company's general and administrative costs. \n\nTim Warman, President and Ruth Ives, VP Project Management, have left Dalradian, effective immediately. Their responsibilities have been assumed by Eric Tremblay, Dalradian's Chief Operating Officer (COO) and Patrick F. N. Anderson, Chief Executive Officer (CEO). In addition, Keith McKay, Chief Financial Officer (CFO), will be retiring during 2016 once a replacement has been found and a transition period is complete. \n\nDalradian's corporate office has been downsized and moved to a location further away from the financial centre in Toronto, cutting the annual lease approximately in half. \n\nPatrick F.N. Anderson, Dalradian's Chairman and CEO, commented: \n\n\"These changes show our commitment to becoming an even more streamlined development company and also reflect our understanding of the current market realities of our industry. These initiatives are part of our ongoing drive to effectively preserve and deploy our cash while continuing to move our high-grade Curraghinalt gold project toward production. I would like to thank Tim and Ruth for their contributions to Curraghinalt's growth and development and wish them all the best in their future endeavours. Our COO has been in place since March of this year and is well-positioned to take over their responsibilities, some of which he had assumed several months ago. Our CFO, Keith McKay, has been with us since the founding of the Company and we appreciate his willingness to extend his tenure in order to ensure a smooth transition.\" \n\nAbout Dalradian \n\nDalradian Resources Inc. is a gold exploration and development company that is focused on advancing its high-grade Curraghinalt Gold Project located in Northern Ireland, United Kingdom. The Company is in the midst of a work program in support of a planning (permitting) application for construction of an operating mine at Curraghinalt. Components of the program include a feasibility study, an environmental impact assessment, infill drilling and underground exploration (885 metres of development with two test stopes). \n\nFORWARD-LOOKING INFORMATION \n\nThis news release contains \"forward-looking information\" which may include, but is not limited to, statements with respect to the activities, events or developments that the Company expects or anticipates will or may occur in the future, including, without limitation, test work and confirming results from work performed to date, estimation of mineral resources, completion of the feasibility study, environmental impact assessment and underground program and the realization of the expected economics of Curraghinalt. Often, but not always, forward-looking statements can be identified by the use of words and phrases such as \"plans,\" \"expects,\" \"is expected,\" \"budget,\" \"scheduled,\" \"estimates,\" \"forecasts,\" \"intends,\" \"anticipates,\" or \"believes\" or variations (including negative variations) of such words and phrases, or state that certain actions, events or results \"may,\" \"could,\" \"would,\" \"might\" or \"will\" be taken, occur or be achieved. \n\nForward-looking statements are based on the opinions and estimates of management as of the date such statements are made and are based on various assumptions, such as continued political stability in Northern Ireland, that permits required for the Company's operations will be obtained in a timely basis in order to permit the Company to proceed on schedule with its planned development and exploration programs, that skilled personnel and contractors will be available as the Company's operations continue to grow, that the price of gold will be at levels that render the Company's mineral project economic, that the Company will be able to continue raising the necessary capital to finance its operations and realize on mineral resource estimates, and that the assumptions contained in the Company's preliminary economic assessment are accurate and complete. \n\nForward-looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements. Such factors include, among others, general business, economic, competitive, political and social uncertainties; the actual results of current exploration activities; actual results of reclamation activities; conclusions of economic evaluations; meeting various expected cost estimates; changes in project parameters as plans continue to be refined; future prices of metals; possible variations of mineral grade or recovery rates; failure of plant, equipment or processes to operate as anticipated; accidents, labour disputes and other risks of the mining industry; political instability; delays in obtaining governmental approvals or financing or in the completion of development or construction activities, as well as those factors discussed in the section entitled \"Risk Factors\" in the Company's annual information form. \n\nAlthough the Company has attempted to identify important factors that could cause actual actions, events or results to differ materially from those described in forward-looking statements, there may be other factors that cause actions, events or results to differ from those anticipated, estimated or intended. Forward-looking statements contained herein are made as of the date of this news release and the Company disclaims any obligation to update any forward-looking statements, whether as a result of new information, future events or results, except as may be required by applicable securities laws. There can be no assurance that forward-looking statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements. \n\nContacts: \nDalradian Resources Inc. \nMarla Gale \nVice President Communications \n+1 416 583 5622 \ninvestor@dalradian.com \n\nCanaccord Genuity Limited (Nominated Adviser and Broker) \nHenry Fitzgerald-O'Connor / Oliver Donaldson \n+44 20 7523 8000 \n\nFinsbury (UK financial communications) \nCharles O'Brien / Richard Webster-Smith \n+44 20 7251 3801 \nCharles.O'Brien@Finsbury.com \nRichard.Webster-Smith@Finsbury.com", "source": "Sys-Con Italia"}