{"published": "2015-09-24T14:35:30Z", "media-type": "News", "title": "Mecca: Saudis say 717 dead in hajj stampede, 805 injured", "id": "5fb7540a-8d77-455b-a601-ee47f7effa32", "content": "Iran blames Saudi for pilgrimage disaster \n  \nMECCA, Saudi Arabia -- The latest developments from a crush of Muslim pilgrims on the third day of the annual hajj pilgrimage in Saudi Arabia that killed hundreds of people. \n  \n------ \n  \n4:00 p.m. \n \n\r\r \n  \nThe head of Iran's hajj organization blames Saudi \"mismanagement\" for a crush of pilgrims outside Mecca that killed hundreds of people, including 21 Iranian pilgrims. \n  \nSaeed Ohadi told state TV by phone from Saudi Arabia that the incident might have been caused by the closure of a road. State TV says another 60 Iranian pilgrims were wounded in the incident. \n  \nSaudi authorities say at least 717 people were killed and at least 805 were injured. \n  \nThursday's disaster was the deadliest such incident on the annual hajj pilgrimage in more than two decades, and comes nearly two weeks after a crane collapsed in Mecca, killing 100 people. \n  \nIran and Saudi Arabia are fiercely divided on a host of regional conflicts, and back opposite sides in the wars in Syria and Yemen. \n  \n------ \n  \n3:45 p.m. \n  \nSaudi Arabia's civil defense directorate says 717 people were killed in a crush of Muslim pilgrims near the holy city of Mecca. \n  \nThursday's disaster was the deadliest such incident on the annual hajj pilgrimage in more than two decades, and comes nearly two weeks after a crane collapsed in Mecca, killing 100 people. \n  \nThe crush happened in Mina, a large valley about five kilometers (three miles) from Mecca that has been the site of past hajj stampedes. \n  \nMina is where pilgrims carry out a symbolic stoning of the devil by throwing pebbles against three stone columns. It also houses more than 160,000 tents where pilgrims spend the night during the pilgrimage. \n  \nThe civil defense directorate says at least 805 other pilgrims were injured. \n  \n------ \n  \n3:40 p.m. \n  \nSaudi authorities say 717 people were killed in crush of Muslim pilgrims near holy city of Mecca. \n  \n------ \n  \n2:40 p.m. \n  \nSaudi Arabia's civil defense directorate says at least 453 people were killed in a stampede on the outskirts of the holy city of Mecca during the annual hajj pilgrimage. \n  \nThursday's crush happened in Mina, a large valley about five kilometers (three miles) from Mecca that has been the site of hajj stampedes in years past. \n  \nMina is where pilgrims carry out a symbolic stoning of the devil by throwing pebbles against three stone columns. \n  \nThe Saudi civil defense directorate says the stampede occurred in a morning surge of pilgrims at the intersection of streets 204 and 223 as the faithful were making their way toward a large structure overlooking the columns. It says at least 719 other pilgrims were injured in the stampede. \n  \n------ \n  \n2:26 p.m. \n  \nSaudi authorities say death toll from stampede at hajj pilgrimage rises to 453. \n  \n------ \n  \n12:50 p.m. \n  \nSaudi Arabia's civil defense directorate says the death toll from a stampede at the annual hajj pilgrimage has risen to at least 310 people. \n  \nThe directorate says the victims in Thursday's stampede are of different nationalities, without providing details. It previously said at least 450 pilgrims were injured. \n  \nThe stampede happened in Mina, on the outskirts of the holy city of Mecca. Some 2 million people are taking part in this year's hajj pilgrimage, which began Tuesday. \n  \n------ \n  \n12:45 p.m. \n  \nSaudi authorities say the death toll from the stampede on the outskirts of the holy city of Mecca has risen to 310. \n  \n------ \n  \n12:00 p.m. \n  \nSaudi Arabia's civil defense directorate says the death toll from a stampede at the annual hajj pilgrimage has risen to at least 220 people killed. The directorate says at least 450 other pilgrims were injured in Thursday's stampede, which took place in Mina, on the outskirts of the holy city of Mecca. Some 2 million people are taking part in this year's hajj pilgrimage, which began Tuesday \n  \nAP-WF-09-24-15 13", "source": "Monterey Herald"}