{"published": "2015-09-30T17:12:29Z", "media-type": "News", "title": "Cleveland Clinic brings online doctor visits to Florida", "id": "b59ab07b-a630-412b-944e-a87a56d43fde", "content": "For a $49 credit charge card, Palm Beachers can use their computer, smart phone or tablet to get minor health issues — including earaches, urinary tract infections and abdominal pain — evaluated at any time and get a prescription ordered without having to drive to a doctor’s office or the hospital. \n\nCleveland Clinic Florida’s MyCare Online service made its debut Sept. 24. It uses a private, secure video line to connect patients with doctors, according to the nonprofit healthcare giant. A web camera is required. \n\nFloridians can use the service by downloading a free app, Cleveland Clinic MyCare from Google Play for Android and the iTunes App Store or by visiting www.Clevelandclinicflorida.org/mycare . \n\nThe service gives people the ability to decide when and how they receive health care, according to Dr. J. Gregory Rosencrance, chairman of internal medicine at Cleveland Clinic Florida. The nonprofit initiated the system in Ohio in October 2014. \n\n“Our experience at Cleveland Clinic shows that patient satisfaction has been the same or higher than face to face visits,” Rosencrance said. Millennials embrace technology, and this platform takes advantage of their desire for convenience, according to Rosencrance. \n\nThe service removes time and distance from a doctor as a barrier to care for patients who need to be seen right away, Matthew Stanton, director of distance health for Cleveland Clinic, said in a release announcing the program’s expansion. \n\nThere are limitations to the program. Physicians responding via MyCare will, of course, advise patients to visit their doctor or an emergency room when the initial online evaluation warrants it, Rosencrance said. \n\n“A good example of a gray area where a patient may be sent in for in person evaluation is when the clinician assesses a patient and feels their symptoms might be more serious … due to the complexity of the patient’s past history along with the examination and the patient’s body language — respiration, etc.,” Rosencrance said. \n\nAppendicitis, chest pain, severe headaches and broken bones are examples of conditions that clearly require on-site diagnosis and care, he said. \n\nIn addition to its hospital and clinic in Weston, Cleveland Clinic operates a 28,740-square-feet clinic at CityPlace Tower in West Palm Beach, a separate cardiology office in West Palm Beach, two medical offices in Palm Beach Gardens and one in Atlantis.", "source": "Palm Beach Daily News"}