{"published": "2015-09-30T15:22:38Z", "media-type": "News", "title": "Cosmetics firm puts fire safety first thanks to Hochiki Europe", "id": "0d2ddb57-7acd-4598-a115-921b9c563101", "content": "Estée Lauder is benefiting from fewer false alarms and streamlined maintenance at its Greek headquarters with a new high-performance fire safety system provided by Hochiki Europe. \n \nThe cosmetics firm’s base in the heart of Athens, Greece, is large and subject to heavy traffic, with more than 150 employees spread across five floors. As such, having a high-quality life safety system is crucial to protect the health and wellbeing of employees. \n \nIn such a busy building, the ageing fire detection system was growing costly and difficult to maintain. Moreover, the technology was becoming increasingly prone to false alarms, causing significant disruption to those in the office, and preventing workers doing their jobs. \n \n“The sheer number of false alarms was not just having a significant negative impact on the success of the company’s Greek operations, it was contributing to alarm fatigue among its workers,” explained Spiros Theodorou, sales manager at the firm leading the installation, IFSAS Fire and Security. “Their response times to alerts were deteriorating as they assumed they were not serious, which could have had disastrous consequences for their safety in the event of a genuine emergency.” \n \nWith the challenges of false alarms in mind, Estée Lauder called for a reliable solution capable of safeguarding its employees with minimal maintenance requirements or disruption. In addition, due to the high-profile nature of its offices, the company wanted products that would not impact on the aesthetics of the building interior. IFSAS Fire and Security was certain that Hochiki Europe had the right life safety solutions for the job, so recommended a number of its solutions for use throughout the building. \n \nALN-EN analogue optical smoke sensors from Hochiki Europe were installed throughout the building. Incorporating innovative High Performance Chamber technology, the solution optimises detection sensitivity for fires in their earliest stages, extending evacuation windows for workers in an emergency, while eliminating the issue of false alarms. The manufacturer’s ATJ-EN analogue heat detectors were also fitted in the kitchen area and medium voltage electric boards. The solution incorporates both variable temperature and rate-of-rise heat elements to increase sensitivity to both slow and rapidly developing fires, further improving worker safety. \n \nIn addition, Hochiki Europe’s YBO-R/SCI Short Circuit Isolator Bases were integrated into the fire safety network to protect the alarm systems from short circuits. CHQ-WSB Wall Sounder Beacons with YBO-R/3 (RED) Mounting Bases were included to alert occupants as quickly as possible to a fire incident, as well as HCP-E (SCI) Addressable Call Points to enable individuals to raise alarms manually. \n \nThe technologies chosen are small and unobtrusive, minimising their impact on the visual appearance of the office interior, and can be monitored and set up from a central control panel, streamlining operating and maintenance procedures for Estée Lauder’s facilities managers. \n \nMoreover, they feature Hochiki Europe’s cutting-edge open Enhanced System Protocol (ESP), making them compatible with standard components from other suppliers, and cutting the cost of aftercare. It also significantly reduced the duration and complexity of the installation project for installers, CORE Contractors, by simplifying the supply chain for parts. \n \nGeorge Lolis, project engineer at CORE Contractors, said: “The compatibility of Hochiki Europe’s systems with other products meant that we didn’t have to wait for any specialist components to become available before installing, enabling us to carry out the project without any delay or disruption. \n \n“This significantly reduced the duration of the project, allowing us to deliver well within the tight deadline specified by Estée Lauder.” \n \nDaniel Bon, regional sales manager at Hochiki Europe, added: “With so many workers using the building every day, not to mention visitors, Estée Lauder needed a life safety system that was reliable to keep any impact on its operations to a minimum and to protect its employees. \n \n“The solutions selected for the project delivered this reliability for the company, lowering aftercare needs and virtually eliminating false alarms. This has helped to save the facilities management team considerable time and money, while ensuring Estée Lauder’s team remains safe and well as they go about their working day.” \n \n\n \nFor more information, go to www.hochikieurope.com \n Share this", "source": "IFP Magazine"}