{"published": "2015-09-23T16:40:19Z", "media-type": "News", "title": "Alexa Chung flashes her lithe legs in an understated white mini dress and overcoat at Gucci's Milan Fashion Week show", "id": "149c34e8-41a9-4469-932f-9fe22f96364f", "content": "She was one of the leading lights at London Fashion Week. \n\nAnd Alexa Chung kept her superb display of fashion finesse on the roll as she arrived at Gucci's Spring Summer 2016 event at Milan Fashion Week on Wednesday. \n\nShowcasing her legs by donning a white button-up dress for the occasion, the 31-year-old fashion writer wore a huge smile on her face despite the rain as she braved the elements. \n\n    \n   \nSartorially swish: Alexa Chung kept her superb display of fashion finesse on the roll as she arrived at Gucci's Spring Summer 2016 event at Milan Fashion week on Wednesday \n\nFlashing her lithe legs in the fitted mini dress, which  featured frilled details, the model and TV presenter struck all the right notes as she put on a chic and understated display. \n \nAdding an Autumnal edge to her outfit the English beauty - who is a contributing editor to British vogue - wore a black overcoat. \n\nAlexa rounded off her high-fashion FROW ensemble with a pair of leather loafers featuring a fur fringe. \n   \nShowcasing her legs by donning a white button-up dress for the occasion, the 31-year-old fashion writer wore a huge smile on her face despite the rain as she braved the elements \n\nAccessorizing lightly for the tightly-packed event, she added a colourful spring flourish to her tonal outfit with a red rose broach, some rings and - of course - her trusty iPhone. \n\nWearing her brunette mane in a funky side-parted bob 'do', Alexa allowed her slightly tousled ombre tresses to frame her pretty face. \n\nWearing a minimal amount of make-up, the English rose showed off her striking natural features with a light dusting of flesh-toned foundation and pale pink lipstick. \n\nAnd clearly delighted by the new collection inside, the bubbly TV host posted as sneak peak of the collection with the model captioning the post excitedly: 'Gahhhhh @gucci.'   \n   \nPrepared for the worst: Adding an Autumnal edge to her outfit the English beauty - who is a contributing editor to British vogue - wore a black overcoat  \n  \nA leggy display: Flashing her lithe legs in the fitted mini dress, which feature frilled details, the model and TV presenter struck all the right notes as she put on a chic and understated display \n   \nPacking lightly: Accessorizing lightly for the tightly-packed event, she added a colourful spring flourish to her tonal outfit with a red rose broach, some rings and - of course - her trusty iPhone \n\nArriving to view the iconic fashion house's latest collection, Alexa was joined by other A-List fashionista beauties, including the likes of Salma Hayek and Dakota Johnson. \n\nSalma arrived in a baby blue overcoat, floral-print yellow jumper, shirt and hounds-tooth skirt. \n\nWith her brunette mane loosely tied back, the Mexican beauty looked stunning yet also channelled a demure vibe. \n\nMeanwhile Fifty Shades beauty Dakota slipped into a mid-length, layered claret dress, which she teamed with pale champagne heels and a dark overcoat.  \n\nWith her brunette tresses tied back in a ponytail, Dakota's naturally striking looks were further accentuated by the addition of a flattering box-style fringe. \n   \nAnother Hollywood beauty: Salma arrived in a baby blue overcoat, floral-print yellow jumper, shirt and hounds-tooth skirt \n   \nClassically stylish: Dakota Johnson didn't disappoint in the fashion stakes when she arrived at the Gucci Spring/Summer 2016 event at Milan Fashion Week on Wednesday \n  \nFlower power: The Gucci Spring/Summer 2016 collection featured a heavy influence of bright colours, feminine fabrics and floral-prints  \n   \nIn bloom: The Italian fashion house's catwalk show was typically elegant, colourful and set the bar for the rest of the major cat walk events at the Italian Fashion week", "source": "Mail Online UK"}