{"published": "2015-09-29T13:27:31Z", "media-type": "News", "title": "Resolve Systems and Zayo Group Launch Initiative to Reduce Downtime and Outages", "id": "6845cf12-f481-4943-a925-2f485e78bffa", "content": "Strategic partnership to streamline business continuity through high-availability architecture and disaster recovery  \nIRVINE, Calif. , Sept. 29, 2015 /PRNewswire/ -- Resolve Systems , the global leader in accelerating incident resolutions for IT operations, network operations, and customer care centers, today announced a strategic initiative with Zayo Group Holdings, Inc. (NYSE: ZAYO ), a global provider of bandwidth infrastructure services. Through this initiative, Zayo and Resolve will work together to reduce downtime, outages and support costs. \n \nZayo customers will soon be able to access real-time alarm views, troubleshooting wizards, testing, and interactive automations within the customer portal, reducing tickets handled by Zayo technicians. Escalated issues automatically trigger relevant alarms enriched with customer names, circuit IDs, and site locations that are immediately ticketed and directed to the appropriate fix agents. As a result, Zayo has integrated more fully automated troubleshooting, improving uptime and response. \n \n\"We've worked with Zayo since 2013 to empower its network control centers (NCCs) to resolve incidents faster, minimizing escalations to Tier-2 and Tier-3 engineers enabling them to achieve a zero downtime objective,\" said Larry Lien , vice president of product management and marketing at Resolve. \"Our platform together with Zayo's network management, customer care and customer self-services portal, supports our shared goal of outstanding system performance.\" \n \n\"Resolve is providing the solution to significantly decrease trouble tickets, which translates to better efficiency and productivity for us,\" said Greg Hadlock , senior vice president, network operations at Zayo. \"Most importantly, our initiative provides the foundation for an exceptional customer experience, which begins with a secure, reliable, high-performance network.\" \n \nAbout Resolve Systems \nResolve Systems is the global leader in accelerating incident resolutions for IT operations, network operations, and customer care centers. The Resolve Platform provides actionable dashboards and process guidance for end-to-end and human-guided automations.  Headquartered in Irvine, California with Operations in EMEA, Resolve Systems has Fortune 500 customers around the world. For more information, please visit www.resolvesystems.com/success/zayo/ . \n \nAbout Zayo Group \nZayo Group Holdings, Inc. (NYSE: ZAYO ) provides bandwidth infrastructure services, including fiber and bandwidth connectivity, colocation and cloud services to the world's leading businesses. Customers include wireless and wireline carriers, media and content companies and finance, healthcare and other large enterprises. Zayo's 85,500-mile network in the U.S. and Europe includes extensive metro connectivity to thousands of buildings and data centers. In addition to high-capacity dark fiber, wavelength, Ethernet and other connectivity solutions, Zayo offers colocation and cloud services in its carrier-neutral data centers. Zayo provides clients with flexible, customized solutions and self-service through Tranzact, an innovative online platform for managing and purchasing bandwidth and services. For more information, visit zayo.com . \n \nMedia Contact: \n \nTanya Shuckhart \nDirector PR & Marketing \nResolve Systems \nTanya.shuckhart@resolvesystems.com | 714.585.6663 \n \nLogo - http://photos.prnewswire.com/prnh/20150420/199820LOGO  \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/resolve-systems-and-zayo-group-launch-initiative-to-reduce-downtime-and-outages-300150183.html \n \nSOURCE Resolve Systems \n Back to top  \nRELATED LINKS \nhttp://www.resolvesystems.com", "source": "Michigan Live"}