{"published": "2015-09-10T06:55:22Z", "media-type": "News", "title": "Saudi-led coalition raids target Yemen bases, Houthi leaders' houses", "id": "69a256ce-9814-481c-91cf-bbdbd08d3529", "content": "Reuters  –  \nSANAA (Reuters) - War planes from a Saudi-led military alliance bombed targets throughout Yemen's capital Sanaa on Thursday, in what witnesses described as the fiercest series of attacks on the city in over five months of war. \n \nThe raids hit houses of political leaders in the Iran-allied Houthi movement and military bases, as explosions and wailing ambulance sirens forced a sleepless night on the city's nearly 2 million shell-shocked residents. \n \n\"The sick people fled the hospital in terror,\" an official at a private hospital said. \"They were afraid the building would collapse from the non-stop bombing of the army bases nearby.\" \n \nThere were no immediate reports of casualties, a day after medics said the bombing killed six civilians in the city. \n \nSaudi Arabia and other Arab states intervened in Yemen's civil war on March 26 to halt the nationwide spread of the Houthis, who seized Sanaa last year and forced the government into exile in Riyadh after the group advanced on its southern stronghold of Aden. \n \nThe Houthis, who hail from the Zaydi Shi'ite Muslim sect, view their rise as a revolution. But they are fiercely opposed by the Sunni Muslim Gulf Arab states who believe the group is bent on spreading Iran's influence. \n \nSince a Houthi missile attack killed at least 60 Gulf Arab troops east of Sanaa last Friday, the coalition has stepped up its air strikes on the capital and beefed up its deployment of troops, which Yemeni officials say number a few thousand, ahead of an eventual push towards Sanaa. \n \nFear is spreading that a decisive battle there may reek widespread destruction, as it has in the war-torn southern city of Taiz, where medics said 18 people were killed in an explosion on a residential area on Thursday variously blamed on Houthi artillery shelling and Saudi-led air strikes. \n \nMohammed Saleh, a Sanaa resident, said he wouldn't risk being pinned down as the bombing ramps up and soldiers advance. \n \n\"I've decided my family and I have to get out of Sanaa. There's nowhere left that's safe here, and neighborhoods are getting bombed every single day.\" \n \n(Reporting By Mohammed Ghobari; Writing by Noah Browning, editing by Sami Aboudi and Hugh Lawson)", "source": "Yahoo! India"}