{"published": "2015-09-16T03:46:33Z", "media-type": "News", "title": "India’s Most Trusted Brand", "id": "350f75d3-4834-4704-a8b9-217ecc0eaa8a", "content": "Hundreds of leading Indian brands will be evaluated by the esteemed International Brand Council and more than 100 of the highest scoring brands will be getting INDIA’S MOST TRUSTED BRAND 2015 status. \n\nBriefingWire.com, 9/16/2015 -   New Jersey,USA,10th Aug 2015 Mr. Hemant Kaushik, CEO,IBC InfoMedia mentioned to the Media in a press conference that in its role as a brand arbitrator, has been very successful in identifying the INDIA’S MOST TRUSTED BRAND AWARDS 2015 and will be honoring the brands that make them truly inspirational in an award function to be held on 28th Nov 2015 , Saturday at 6 pm,THE LEELA Hotel in Mumbai,India. \n\nHundreds of leading Indian brands will be evaluated by the esteemed International Brand Council and more than 100 of the highest scoring brands will be getting INDIA’S MOST TRUSTED BRAND 2015 status. Only brands that achieve the level of recognition set by the International Brand Council after winning in a consumer survey conducted by IBC InfoMedia will be eligible for inclusion in the INDIA’S MOST TRUSTED BRAND 2015 brand book, which traces the history and achievements of each of the brands. \n\nSome brands selected as a INDIA’S MOST TRUSTED BRAND 2015 are SAMSUNG, TATA, RELIANCE, LIC, SBI, VODAFONE, ICICI BANK, COCACOLA, HDFC BANK, ITC, TOYOTA, BAJAJ, COLGATE, GOOGLE, AIRTEL, INTEL, INFOSYS, HSBC, DABUR, APPLE, ROLEX, DISH TV, BIG BAZAAR, TIMES OF INDIA, MERCK, KODAK, KING FISHER, DAINIK JAGRAN, ABP NEWS, STAR TV,NESCAFE, ASIAN PAINTS, YOU TUBE, ACC CEMENT, FACEBOOK, INDIAN OIL , WIZCRAFT, BSNL, JUST DIAL, ZEE TV, HPCL, MAHINDRA SCORPIO, FAIR & LOVELY, PAN PARAG, TAJ HOTELS, INDIA TODAY, KWALITY WALLS, INDIAN RAILWAYS, USHA MARTIN, TATA STEEL, DELHI METRO, RELIANCE FRESH, LIFESTYLE, LINKEDIN, SOTC, APOLLO TYRES, LODHA, JET AIRWAYS, BISLERI, BLUEDART, FLIPKART, WESTSIDE, EXIDE, CITIBANK, CASTROL, KESH KING, INDIA BULLS, HERO, BRITANNIA, GILETTE, IDBI BANK, SURF EXCEL, NESTLE, MAGGI, HDFC LIFE, MC DOWELL, GOOD KNIGHT, ADITYA BIRLA GROUP, etc., among others. \n\nInternational Brand Council was founded by Mr. Hemant Kaushik to focus on promoting the discipline of branding and paying a tribute to exceptional brands. INDIA’S MOST TRUSTED BRAND 2015 will be a tribute event and a true celebration of many of the India's highest profile brands, who lived up to their global reputation. \n\nSpeaking with the press about the event, Mr. Hemant Kaushik, CEO, IBC InfoMedia said, \"We are delighted to host our event to celebrate the success of INDIA’S MOST TRUSTED BRAND 2015 which are also some of the most recognized brands in the world. INDIA’S MOST TRUSTED BRAND 2015 is glad to recognize the country's economy drivers and help today's judicious consumers make an intelligent and educated choice amongst the multitude of brands available today\" \n\nIf you want to know more about this event then please contact at contactibcmedia@gmail.com", "source": "BriefingWire.com"}