{"published": "2015-09-07T07:31:00Z", "media-type": "News", "title": "Showbiz News: Strictly beats X Factor in ratings war and Top Gear's final series nominated for TV Choice Award", "id": "4bfdf3d8-077e-438c-a46b-58536bf3c62f", "content": "JEREMY Clarkson and his Top Gear co-stars Richard Hammond and James May are hoping to go out on a high, after their final series of Top Gear was nominated for best entertainment show at the 2015 TV Choice Awards. \n \nTop Gear faces TV favourites Ant and Dec, whose show Ant And Dec’s Saturday Night Takeaway is also up for the prize, along with ITV2′s Celebrity Juice and The Graham Norton Show. \n \n Click here to read the full story.  \n \nFilming on the BBC Two motoring show was suspended after Clarkson was sacked for punching producer Oisin Tymon in a row over food in March. \n \nFOOTBALLER Steven Gerrard has said he is enjoying his “Z-list” celebrity status in America after moving to LA Galaxy. \n \nThe former England and Liverpool captain said his new life in the US was “mind-blowing” and he can now walk down the street “without being stopped every five minutes”. \n \n Click here to read the full story.  \n \nGerrard, 35, left Merseyside this summer after 17 years with the Reds – who he famously led to Champions League glory in 2005 – in order to play in America’s Major Soccer League. \n \nELLA Eyre’s rendition of rugby classic Swing Low, Sweet Chariot has been released as the official England Rugby song for 2015. \n   Promoted stories   \nThe Brit award winner, who scored a number one hit with Rudimental for Waiting All Night, lent her vocals to the rugby fan favourite, which is often heard echoing through the crowd during games. \n \n Click here to read the full story.  \n \nA donation from each purchase of the song, available on iTunes and Spotify, will be made to England Rugby’s All Schools programme, of which Prince Harry is a patron. \n \nSTRICTLY came on out on top in the ratings battle as it went head-to-head with rival X Factor for the first time this year, according to overnight figures. \n \nStrictly Come Dancing’s launch on BBC One attracted an average of 8.7 million viewers, a 41.7% share of the total audience, as fans tuned in to see this year’s celebrities paired up with their dancing partners. At its peak, 9.7 million people were watching. \n   \n Share article  \n   \n Click here for the full story.  \n \nThe X Factor pulled in an average 7.5 million viewers for the third show of the new series, representing a 32.8% share, and peaked at nine million.", "source": "Bromsgrove Advertiser"}