{"published": "2015-09-05T04:30:02Z", "media-type": "News", "title": "JoJo Domann interception return sparks Pine Creek win over Falcon", "id": "cee1f039-4e3a-415d-a344-f2b31008d3c1", "content": "Falcon was on the move. The Falcons had the ball inside Pine Creek territory with time winding down in the half. \n\nAnd then in stepped JoJo Domann. \n\nDomann intercepted Falcon quarterback Ty Murphy and took the ball 65 yards the other way to a score and sparked Pine Creek to a 35-13 victory on Friday night in a rematch of two Class 4A semifinalists from a year ago. \n\nDomann added two TD runs, Brock Domann - JoJo's younger brother - rushed for another, and the two-time 4A state champions' defense shut down Falcon in the second half. \n\n\"It was a pivotal point of the game,\" JoJo Domann said of his interception return. \"I just trusted the coverage and my technique and I made the play.\" \n\nPine Creek (2-0) had almost nothing going right for it offensively in the first half. Other than a 54-yard sprint by JoJo Domann that led to a Connor Miller 10-yard score, the Eagles managed fewer than 80 yards in the half. \n\nAnd with Falcon (0-1) on the move, already up 7-6, it looked like the Eagles might fall behind by more before the break. \n\nFalcon got to the Pine Creek 41 and faced a 4th-and-2. That's when Murphy threw the ill-timed pass. \n\n\"Huge, huge,\" Falcon co-coach Brian Green said. \"We just didn't execute right down the stretch when we needed to right before half.\" \n\nThe Falcon defense held Pine Creek to 125 yards in the first half, and only four first downs. They forced the Eagles to three three-and-outs. They kept the Falcons in the game until the end of the third quarter, when Murphy fired a strike to David Palmer that cut the gap to 21-13 after a missed extra point. \n\n\"Falcon's a hell of a defense,\" JoJo Domann said. \"They put it to us in that first half. We made adjustments at halftime and that's kind of how we got on a roll second half.\" \n\nJoJo scored on runs of 7 and 1 yard to finish the scoring. \n\nThe Eagles built a 21-7 lead on a 23-yard option-read by quarterback Brock Domann with 3:40 to play in the third. \n\n\"They're football savvy,\" Pine Creek coach Todd Miller said of the Domanns. \"And their knowledge, they understand what we're trying to do as coaches, but they also understand what defenses are trying to do. I'm not smart enough. They figure some things out on the field.\" \n\nFalcon grabbed a 7-0 lead with 3:18 to play in the first on a Matt Bastian 2-yard run. The play was set up by an interception, the Eagles' second turnover of the first half. \n\nPine Creek's defense held Falcon to 65 yards in the first half. In five second-half drives, Falcon crossed midfield twice. \n\nThe Eagles are 7-0 lifetime against Falcon. \n\nThey got to No. 7 by owning possession in the second half and pinning the Falcons in their own end. \n\nMiller liked seeing his team struggle early against the Falcons. \n\n\"This is good, we need to go through this,\" he said. \"We need to get punched in the mouth. You need to struggle a little bit as you grow as a team.\"", "source": "Colorado Springs Gazette"}