{"published": "2015-09-02T11:06:50Z", "media-type": "News", "title": "Worcester footballer Jamie Insall signs for Hibernian in Scottish Championship", "id": "9752f0cf-61ae-46ee-8494-6edb03b7d24d", "content": "WORCESTER'S Jamie Insall has secured his dream move into professional football after agreeing a three-year deal with Scottish Championship side Hibernian. \n \nThe pacy 23-year-old has moved to Easter Road following a prolific spell of 42 goals last season for Bromyard Town and Worcester Raiders in West Midlands League Division One. \n \nHe is determined to seize his opportunity after impressing during a month-long trial under manager Alan Stubbs and becomes the seventh striker on the Edinburgh club's books. \n \nIt represents a major rise for the former Kidderminster Harriers youth team player, who was also playing in Worcester and District League Sunday Division Two last season for WCT Youth Raiders. \n \nInsall, who had also impressed Northern Premier League side Stourbridge during pre-season, said: \"This is a great move for me. I'm absolutely delighted to have been given the chance to sign for Hibs. \n \n\"My aim now is to repay the faith the manager has shown in me by working hard, developing my game and ultimately helping the first team by scoring goals. \n \n\"It's a big step-up but I've waited a long time for my opportunity to step up to full-time football and I'm determined to make the most of it by doing everything I can to succeed. \n \n\"Playing in non-league football down south has given me a good grounding and, although I'm still quite raw, I've got a real hunger to kick on and make the most of my chance here at Hibs.\" \n \nStubbs, the former Celtic and Everton defender, said: \"We're pleased to have Jamie signed up for the next few years. \n \n\"Jamie has impressed on trial and he's earned his chance at taking the step-up to professional football. \n   \n Share article  \n   \n\"We feel he's got the potential to succeed at the club and he now has the opportunity to work hard and develop his game with us.\" \n \nThe move for Insall, who has played across the two counties for the likes of Stourport Swifts, Redditch United, Pershore Town, Littleton and Westfields, is subject to international clearance.", "source": "Tewkesbury Admag"}