{"published": "2015-09-01T16:25:25Z", "media-type": "Blog", "title": "London Film Festival 2015: Film Line-up: STEVE JOBS, SUFFRAGETTE, CAROL", "id": "fd2c5043-52ac-44e6-af50-9d3c32f6b4ce", "content": "Steve Jobs, Suffragette, Carol, and the other gala and competition films for 2015 London Film Festival have been announced. The 59th annual London Film Festival, run by the British Film Institute, “is the UK’s largest public film event,… screening a total of 238 fiction and documentary features, including 16 World Premieres, 8 International Premieres, 40 European Premieres and 11 Archive films including 5 Restoration World Premieres…There will also be screenings of 182 live action and animated shorts…The Festival showcases the best of world cinema to champion creativity, originality, vision and imagination, and presents the finest contemporary international cinema from both established and emerging film-makers…the festival hosts high profile awards contenders, screens recently restored archive films, champions new discoveries and combines curatorial strength with red carpet glamor. It also provides an extensive program of industry events, public forums, education events, lectures, masterclasses and Q&As with film-makers and film talent.” This year’s festival runs from October 7, 2015 through October 18, 2015. The films at the festival that I am looking forward to this year are Carol, Steve Jobs, Suffragette, Beasts of No Nation, Tangerine, and The Witch. These are the films that I know about and/or have seen trailers and reviews on. The full competition film lineup for the 2015 London Film Festival: Official Competition Jerzy Skolimowski, 11 MINUTES Cary Fukunaga, BEASTS OF NO NATION Apichatpong Weerasethakul, CEMETERY OF SPLENDOUR Athina Rachel Tsangari, CHEVALIER Simon Stone, THE DAUGHTER Jonás Cuarón, DESIERTO (European Premiere) Lucile Hadžihalilovi?, EVOLUTION Johnnie To, OFFICE (European Premiere) Lenny Abrahamson, ROOM László Nemes, SON OF SAUL Terence Davies, SUNSET SONG Sean Baker, TANGERINE Mir-Jean Bou Chaaya, VERY BIG SHOT (European Premiere) First Feature Competition Mai Masri, 3000 NIGHTS (European Premiere) Eva Husson, BANG GANG (A MODERN LOVE STORY) Magnus von Horn, THE HERE AFTER Trey Edward Shults, KRISHA Yared Zeleke, LAMB Esther May Campbell, LIGHT YEARS Ariel Kleiman, PARTISAN Eugenio Canevari, PAULA Bentley Dean, Martin Butler, TANNA Piero Messina, THE WAIT Nitzan Gilady, WEDDING DOLL (European Premiere) Robert Eggers, THE WITCH Documentary Competition João Pedro Plácido, (BE)LONGING Mor Loushy, CENSORED VOICES David Sington, THE FEAR OF 13 (World Premiere) Alexandria Bombach, Mo Scarpelli, FRAME BY FRAME (European Premiere) Alexander Sokurov, FRANCOFONIA Frederick Wiseman, IN JACKSON HEIGHTS Walter Salles, JIA ZHANGKE, A GUY FROM FENYANG Tomer Heymann, MR. GAGA (International Premiere) Patricio Guzmán, THE PEARL BUTTON Sarah Turner, PUBLIC HOUSE (World Premiere) Jennifer Peedom, SHERPA (European Premiere) Hanna Polak, SOMETHING BETTER TO COME Short Film Award João Paulo Miranda Maria, COMMAND ACTION Till Nowak, DISSONANCE Nina Gantz, EDMOND Peter Tscherkassky, THE EXQUISITE CORPUS Mees Peijnenburg, A HOLE IN MY HEART An van Dienderen, LILI (International Premiere) Maïmouna Doucouré, MOTHER(S) Shai Heredia, Shumona Goel, AN OLD DOG’S DIARY (European Premiere) Caroline Bartleet, OPERATOR (World Premiere) Jörn Threlfall, OVER Vivienne Dick, RED MOON RISING (World Premiere) Ziya Demirel, TUESDAY Love Love is a complex and many splendoured thing. The Love Gala is Luca Guadagnino’s feature A BIGGER SPLASH set on the volcanic, windswept Sicilian island of Pantelleria and starring Tilda Swinton as a rock star, Matthias Schoenaerts as her filmmaker lover, Ralph Fiennes as a cocky music producer and Dakota Johnson as his petulant, sexy daughter. Other titles in this section include: Naomi Kawase’s sweet, light and leisurely AN; Tom Geens’ COUPLE IN A HOLE, about a couple living in an underground forest dwelling to be left alone to deal with their mysterious grief; DEPARTURE, Andrew Steggall’s delicate first feature about longing, loneliness and nostalgia for a sense of family that may have never existed; Jacques Audiard’s Palme d’Or-winner about a makeshift family trying to cement their bonds, DHEEPAN; the World Premiere of Biyi Bandele’s FIFTY, a riveting exploration of love and lust, power and rivalry and seduction and infidelity in Lagos; the European Premiere of Maya Newell’s documentary GAYBY BABY, following the lives of four Australian children whose parents all happen to be gay; Mark Cousins returns to LFF with his metaphysical essay film I AM BELFAST, Stig Björkman’s documentary INGRID BERGMAN – IN HER OWN WORDS, a treasure trove of Bergman’s never-before-seen home movies, personal letters and diary extracts alongside archive footage; Hirokazu Kore-eda’s beautiful OUR LITTLE SISTER, focusing on the lives of four young women related through their late father in provincial Japan; the European Premiere of Mabel Cheung’s sweeping Chinese epic based on the true story of Jackie Chan’s parents A TALE OF THREE CITIES and Guillaume Nicloux’s VALLEY OF LOVE starring Isabelle Huppert and Gérard Depardieu in a tale of love, loss, memory and the mystical. Debate Debate thrives on conversation, which is never more engaging than when the world outside the cinema is reflected back at us. This year’s Debate Gala is Stephen Frears’s THE PROGRAM starring Ben Foster as cyclist Lance Armstrong, charting his rise to near canonization and his subsequent fall from grace. Other highlights in this section include: Pablo Larraín’s THE CLUB, a mordant morality tale set in a sleepy Chilean coastal town, which won Berlin’s Grand Jury Prize; CHRONIC, Michel Franco’s uncompromising study of grief and isolation, featuring a revelatory performance by Tim Roth; brothers Tarzan and Arab Nasser’s feature directorial debut, DÉGRADÉ, a smart drama that moves seamlessly between humour and despair, set in a women’s hair salon in Gaza; the European Premiere of George Amponsah’s intimate documentary THE HARD STOP, revealing the story of Mark Duggan’s friends and family following his death after being shot in a ‘Hard Stop’ police procedure in 2011; Jonas Carpignano’s engrossing feature debut, THE MEASURE OF A MAN which won Vincent Lindon Best Actor at Cannes Film Festival, MEDITERRANEA, an ultra-topical tale of two young African men from Burkina Faso who, in search of a better life, make the difficult and dangerous trip across the Sahara desert and Mediterranean Sea to reach Italy; the drama MUCH LOVED, Nabil Ayouch’s searing, no-holds-barred look at the world of prostitution in Morocco; David Evans’ thought-provoking documentary MY NAZI LEGACY, which raises the harrowing question, ‘What if your father was a Nazi?’; the World Premiere of John Dower’s MY SCIENTOLOGY MOVIE which features Louis Theroux as he heads to Los Angeles to explore the Church of Scientology; Sebastián Silva’s beguiling, seductive and confrontational NASTY BABY; PAULINA, Santiago Mitre’s intelligent parable for contemporary Argentina, which won the Critics Week Grand Prize in Cannes; TAKLUB, Brillante Ma Mendoza’s riveting ode to a Filipino city wreaked by a typhoon; and Jafar Panahi’s latest film, TAXI TEHRAN, winner of the Golden Bear at this year’s Berlinale and set and shot from inside a car. Dare Here you’ll find films that are in your face, up-front and arresting, taking you out of and beyond your comfort zone. The Dare Gala is Yorgos Lanthimos’ THE LOBSTER which stars Colin Farrell, Rachel Weisz, Olivia Coleman, John C. Reilly, Léa Sedoux and Ben Whishaw in a bleakly hilarious skewering of fundamentalist diktats and rituals that is also a tender plea for genuine intimacy amid society’s self-imposed absurdities. Other highlights in this strand include: Miguel Gomes’ mixes fantasy, documentary, docu-fiction, Brechtian pantomime and echoes of MGM musical in the epic ARABIAN NIGHTS; the World Premiere of William Fairman and Max Gogarty’s CHEMSEX, an unflinching, powerful documentary about the pleasures and perils associated with the ‘chemsex’ scene that’s far more than a sensationalist exposé; the European Premiere of CLOSET MONSTER, Stephen Dunn’s remarkable debut feature about an artistic, sexually confused teen who has conversations with his pet hamster, voiced by Isabella Rossellini; THE ENDLESS RIVER a devasting new film set in small-town South Africa from Oliver Hermanus, Diep Hoang Nguyen’s beautiful debut, FLAPPING IN THE MIDDLE OF NOWHERE, a wry, weird socially probing take on the teen pregnancy scenario that focuses on a girl whose escape from village life to pursue an urban education has her frozen in mid-flight; LUCIFER, Gust Van den Berghe’s thrillingly cinematic tale of Lucifer as an angel who visits a Mexican village, filmed in ‘Tondoscope’ – a circular frame in the centre of the screen; the European premiere of KOTHANODI a compelling, unsettling fairytale from India; veteran Algerian director Merzak Allouache’s gritty and delicate portrait of a drug addicted petty thief in MADAME COURAGE; Radu Muntean’s excellent ONE FLOOR BELOW, which combines taut, low-key realism with incisive psychological and ethical insights in a drama centering on a man, his wife and a neighbor; and QUEEN OF EARTH, Alex Ross Perry’s devilish study of mental breakdown and dysfunctional power dynamics between female best friends, starring Elisabeth Moss. Laugh This year’s Laugh strand encompasses richly diverse geography, subject matter and senses of humour, from gleeful to bittersweet and wickedly satirical. This year’s Laugh Gala is the European Premiere of BRAND: A SECOND COMING, an energetic, complex and frequently hilarious documentary about Russell Brand directed by Ondi Timoner. Other titles in this strand include: comic visionary Jaco Van Dormael’s scabrously provocative, philosophically asute parable THE BRAND NEW TESTAMENT, which poses the question ‘What if God were Belgian and a cantankerous, vindicative slob who runs the whole show from a dilapidated apartment in Brussels?’; the World Premiere of Chanya Button’s debut feature BURN BURN BURN starring Downton Abbey’s Laura Carmichael, which takes the road trip buddy movie on its own smart, female-centric spin; Ali F. Mostafa’s FROM A TO B, a ‘dramedy’ following three estranged childhood companions who embark on a road trip to commemorate the fifth anniversary of a friend’s death and offers a new perspective on life in the Gulf and Middle East; Paul Weitz’s GRANDMA, a supremely enjoyable ‘road movie’ starring Lily Tomlin as the gloriously profane septuagenarian whose curt words and emotional armour can’t quite mask her broken heart; Bao Nguyen’s Saturday Night Live documentary LIVE FROM NEW YORK!; MEN AND CHICKEN, Anders Thomas Jensen’s dark, twisted and extremely animalistic comedy as black as pitch, but with the sweetest heart, starring Mads Mikkelsen; Fernando León de Aranoa’s black comedy A PERFECT DAY, a freewheeling tale centering on two veteran aid workers starring Benico Del Toro and Tim Robbins; the International Premiere of Brendan Cowell’s debut RUBEN GUTHRIE about an advertising exec trying to quit the booze, which spikes social observations with dark, wounded humour and the European Premiere of Japanese auteur/icon Takeshi Kitano’s latest comedy, RYUZO AND HIS SEVEN HENCHMEN, about a group of elderly, retired Yakuza who reteam to take revenge on a younger rival gang. Thrill This year’s Thrill strand features nerve-shredders that’ll get your adrenalin pumping and will keep you on the edge of your seat. The Gala presentation for this strand is the International Premiere of Deepa Mehta’s BEEBA BOYS, an energetic gangster movie that also explores South Asian family values set in Vancouver’s Sikh immigrant badlands and starring Randeep Hooda. Other highlights in this section include: the European Premiere of Choi Dong-hoon’s colourful period bullet opera, ASSASSINATION; the European Premiere of Daniel Junge’s thrill-a-minute BEING EVEL about the legendary daredevil Robert Craig ‘Evel’ Knievel; the European Premiere of David Farr’s crafty and suspenseful study in paranoia, THE ONES BELOW starring David Morrissey and Clémence Poésy; Atom Egoyan’s latest drama REMEMBER, offering a provocative study of the nature of evil as well as serving as a stark reminder of the atrocities of 20th century history, starring Christopher Plummer and Martin Landau; Gabriel Clarke and John McKenna’s gripping documentary STEVE MCQUEEN: THE MAN & LE MANS, featuring unseen archive footage, contemporary interviews and previously unheard commentary from McQueen himself; Stephen Fingleton’s thrilling, post-apocalyptic debut THE SURVIVALIST; Sebastian Schipper’s exhilarating one-shot sensation, VICTORIA; and THE WAVE, Roar Uthaug’s high-octane and nerve-shredding portrayal of a potential catastrophe. Cult In the Cult strand, the dark side is welcomed with outcasts and reprobates taking centre stage in this year’s crop of films. The Cult Gala is the International Premiere of S. Craig Zahler’s gloriously imaginative genre hybrid BONE TOMAHAWK starring Kurt Russell in a film with enough surprises to satisfy even the most jaded horror hounds and western fans. Other highlights in this strand include: the World Premiere of Thierry Poiraud’s DON’T GROW UP, a stylish and inventive film about a group of teens on an unnamed island who wake up to find their youth facility eerily abandoned; the World Premiere of Jon Spira’s affectionate documentary ELSTREE 1976 about the bit performers who appeared in George Lucas’ box office behemoth Star Wars; GHOST THEATER, the latest film from director Hideo Nakata, the forerunner of J-horror; GREEN ROOM, Jeremy Saulnier’s latest exercise in edge of the seat suspense, starring Patrick Stewart, Imogen Poots and Anton Yelchin; returning for the third year running, Sion Sono screens LOVE AND PEACE, his tale of punk rock and talking turtles; and the fantastically prolific Takashi Miike’s riotous, unruly gangster vampire concoction YAKUZA APOCALYPSE. Journey Journey is all about the temporal voyage. This year’s Journey Gala is Hou Hsiao-Hsien’s breathtakingly elegant and mesmerizing first foray into wuxia (martial arts), THE ASSASSIN, which won him the Best Director prize at the Cannes Film Festival this year. Hou Hsiao-Hsien is the subject of retrospective – Also Like Life – at BFI Southbank this month in the lead-up to the Festival and will participate in a career interview on Monday 14 September at BFI Southbank. Other titles in this section include: Radu Jude’s vivid, Wallachian western AFERIM!, COWBOYS, the directorial debut of Jacques Audiard’s A Prophet and Rust and Bone co-writer Thomas Bidegain; the breathtaking ethnographic Colombian Amazon odyssey EMBRACE OF THE SERPENT; James Ponsoldt’s THE END OF THE TOUR starring Jason Segel as writer David Foster Wallace and Jesse Eisenberg as Rolling Stone journalist David Lipsky in this engrossing two-hander; Writer-Director Jayro Bustamante’s IXCANUL VOLCANO, the European Premiere Stevan Riley’s enthralling Marlon Brando documentary LISTEN TO ME MARLON; Jia Zhangke’s ambitious, astute and humane MOUNTAINS MAY DEPART; the European Premiere of Sylvia Chang’s often-ethereal magic-realist drama love story, MURMUR OF THE HEARTS; the European Premiere of THE NEW CLASSMATE about a single mum in India battling to ensure her daughter’s future; SEMBÈNE!, Samba Gadjigo and Jason Silverman’s incisive documentary on acclaimed African filmmaker Ousmane Sembène; Chloé Zhao’s SONGS MY BROTHERS TAUGHT ME; and Paolo Sorrentino’s deliciously bittersweet drama YOUTH, starring Michael Caine, Harvey Keitel, Rachel Weisz, Paul Dano and Jane Fonda. Sonic ‘We are the music makers, and we are the dreamers of dreams’, so goes Arthur O’Shaughnessy’s 1873 poem Ode, and so goes this year’s Sonic strand. The Sonic Gala is the European Premiere of two-time Oscar-nominated director Hany Abu-Assad’s new film THE IDOL, based on the incredible true story of Mohammad Assaf, winner of ‘Arab Idol’. Other highlights in this strand include: the World Premiere of Bernard MacMahon’s documentary THE AMERICAN EPIC SESSIONS, a haunting collision of past and present, presided over by the high priests of the great tradition of American music, Jack White and T Bone Burnett; the World Premiere of James Caddick and James Cronin’s documentary ELEPHANT DAYS, which charts The Maccabees creative process as they record their 4th album Marks To Prove It in an anonymous studio in Elephant and Castle; JANIS: LITTLE GIRL BLUE, Oscar-nominated director Amy Berg’s Janis Joplin documentary drawing on archival footage, contemporary interviews and the singer’s personal correspondences; punk filmmaker Khavn De La Cruz’s RUINED HEART: ANOTHER LOVE STORY BETWEEN A CRIMINAL AND A WHORE, an irreverent orgy of sex and crime with a banging soundtrack at its core; the International Premiere of Bobbito Garcia’s STRETCH AND BOBBITO: RADIO THAT CHANGED LIVES, a documentary about The Stretch Armstrong and Bobbito Show which broadcasted on New York’s WKCP radio in the 1990’s and featured unsigned at the time artists such as Jay Z, Nas and Eminem; and the European Premiere of THEY WILL HAVE TO KILL US FIRST: MALIAN MUSIC IN EXILE, Johanna Schwartz’s debut feature which intelligently captures the complexity and emotion of the life of musicians forced into exile and desperate to keep their music alive. Family Showcasing films for the young, as well as the young at heart, this year’s Family section is a truly international affair, kicking off with the Family Gala, the European Premiere of Rob Letterman’s GOOSEBUMPS, featuring Jack Black. Other highlights are ADAMA a deeply moving animation about the life of a young boy in West Africa in 1914; Mamoru Hosoda’s THE BOY AND THE BEAST, an exquisitely animated fable about a boy who has run away from home and is alone in the human world following the passing of his mother; Jury Feting’s CELESTIAL CAMEL, a fascinating and thrilling tale about a 12 year old herder whose father has sold a young colt who may be the fabled ‘celestial camel’; Academy Award® winner Gabriele Salvatores’ THE INVISIBLE BOY, a charming coming of age tale about a shy boy, picked on by his peers, who gets his wish to hide from the world when he discovers a Halloween outfit that makes him invisible; Alexandre Heboyan and Benoît Philippon’s hugely enjoyable CGI animated adventure MUNE, about a faun who lives in a faraway world; Studio Ghibli’s beautiful drama WHEN MARNIE WAS THERE, directed by Hiromasa Yonebayashi; and the World Premiere of Tim Clague and Danny Stark’s WHO KILLED NELSON NUTMEG?, featuring Bonnie Wright from the Harry Potter series. There is a dedicated section for animated shorts for younger audiences which bring together eclectic, exciting and colourful films from all around the globe. English language and subtitled, suitable for all ages. Amongst the highlights of this year’s 14 titles is director Sanjay Patel’s SANJAY’S SUPER TEAM from Pixar. Experimenta Experimenta, the LFF showcase of experimental cinema and artist moving image is programmed in partnership with LUX for a third year and is supported by the Arts Council England. Focused on films and videos by artists, it aims to screen films that use the moving image to change the way we think of film and how it functions. The Experimenta Special Presentation is THE FORBIDDEN ROOM, a gleeful, hypnotic and totally deranged epic directed by Guy Maddin and Evan Johnson. An extensive selection of work from across the world is presented including the World Premieres of William English’s HEATED GLOVES and THE HOST, in which director Miranda Pennell delves deeper into her past and her late parents’ involvement with the Anglo Iranian Oil Company (BP); Ben Rivers’ THE SKY TREMBLES AND THE EARTH IS AFRAID AND THE TWO EYES ARE NOT BROTHERS, the feature element of Ben’s current Artangel installation at BBC White City; EVENT FOR A STAGE by Tacita Dean, a filmed presentation of her live theatrical happening in collaboration with actor Stephen Dillane at the 2014 Sydney Biennial; the European Premiere of Omer Fast’s REMAINDER, a London-set thriller adapted from Tom McCarthy’s acclaimed novel of the same name; the European Premiere of INVENTION which highlights the possibilities of camera movement and the development of artistic apparatus and Kevin Jerome Everson’s PARK LANES, set in an American bowling alley over the course of a day. Shorts A hugely diverse range of original and exciting short films that will captivate audiences span the festival strands this year. Films of Love and Devotion explores and attempts to explain the old adage that the course of true love never did run smooth with Rob Savage’s ABSENCE starring Paul McGann as a grieving man and OFFLINE DATING, a documentary about a single man’s search for love without the use of the internet. The Last Man Standing is a Girl programme explores the role of young women in society with GROOVE IS IN THE HEART, a tale of music and memory revealed through a school girl’s mixtape and A GIRL’S DAY from German director Hannah Ziegler. The Family at War shorts attempts to show what families are really like and how we survive them with TAMARA by Sofia Safonova and VIDEO where we see Elaine having trouble balancing life between her teenage daughter and a secret evening job. Funny How? How am I Funny? explores the comedy in cultural misunderstanding with OTHRWISE ENGAGED and black comedy KUNG FURY. The Fight or Flight programme charts the human response to extreme situations and Wild at Heart and Weird on Top presents eleven shorts that explore the history of film. In the Neighborhood is human stories of love, death and life-changing moments and includes Oscar Hudson’s LORD AND LIDL, where God unexpectedly shows up at the supermarket. London Calling is a selection of shorts from some of the capital’s most exciting new filmmakers and is supported by Film London. Sound Mirrors features nine diverse shorts all on a musical theme and Animated Shorts for Younger Audiences bring together a mix of exciting stories from around the world to surprise and delight children and adults alike. Treasures Treasures bring recently restored cinematic riches from archives around the world to the Festival in London. The previously announced Archive Gala is the World Premiere of the BFI National Archive restoration of A.V. Bramble and Anthony Asquith’s silent film SHOOTING STARS (1928), presented with a new live score by John Altman, BAFTA and Emmy award-winning composer whose work includes Titanic and Goldeneye. Asquith’s feature debut not only announced the arrival of a significant new director, it is an exuberant, joyful pastiche of the movie industry and is a fascinating behind-the-scenes glimpse and searing comment on the shallowness of the star system. The film restoration and new score is supported by a number of generous individuals, trusts and organisations. A number of other major restorations will have their World Premieres at the Festival: Carol Reed’s atmospheric Graham Greene adaptation of OUR MAN IN HAVANA (1959), set in Cuba at the start of the Cold War, makes timely viewing as US/Cuba relations thaw; Ken Russell’s reworking of D.H. Lawrence scandalous classic WOMEN IN LOVE (1970) stars Oliver Reed, Alan Bates and Glenda Jackson and shows two couple’s contrasting searches for love, and was restored by the BFI National Archive working alongside cinematographer Billy Williams; A MAN FOR ALL SEASONS (1966) is directed by Fred Zinnemann from a script by great British screenwriter, Robert Bolt from Bolt’s play about Sir Thomas More, a perfect companion piece to Wolf Hall; Henry Fonda stars in the ripe-for-discovery WARLOCK (1959), a seething study of vengeance and repressed sexuality in a Utah mining outpost; and Bryan Forbes’ THE RAGING MOON (1971) starring Malcolm McDowell and Nanette Newman in a tender story between two young people in wheelchairs which was ahead of its time in its attempts to change attitudes to disability. From newsreels to comedy sketches, the 21 films that make up MAKE MORE NOISE! SUFFRAGETTES IN FILM (1934) are a historical accompaniment to our Opening Night film and a fascinating representation of women at the time that the battle for universal suffrage was being fought on the streets. Martin Scorsese said of Ousmane Sembène’s BLACK GIRL (1966): ‘An astonishing movie – so ferocious, so haunting and so unlike anything we’d ever seen. ’Sembène’s first feature, which tells the tragic story of Diouana, a young Senegalese women eager to find a better life, draws from the Nouvelle Vague, but the film’s heart and soul is definitely African. It is the perfect companion to Samba Gadjigo’s documentary SEMBÈNE! And for a lighter-hearted but no less majestic cinema experience, George Sidney’s breathlessly delightful KISS ME KATE (1953) brings the Cole Porter penned musical to screen, here in magnificent 3D. Rock and roll hall-of-famer Leon Russell is the heart of an ineffable, joyous collage of mesmerising live performance and vérité realism in A POEM IS A NAKED PERSON (1974), filmed between 1972-1974 by director Les Blank. Previously unavailable theatrically in the four decades since it was made. Other highlights include Mira Nair’s Oscar-nominated debut feature SALAAM BOMBAY! (1988); the Holy Grail of silent comedy shorts, a previously-thought-lost Laurel and Hardy THE BATTLE OF THE CENTURY (1927), and Luchino Visconti’s fully restored masterpiece ROCCO AND HIS BROTHERS (1960), starring Alain Delon in a grand emotional opus on imploding fraternal tensions. Leave your thoughts on the official film lineup for the 2015 London Film Festival (via Bfi) below in the comments section below. For more London Film Festival news coverage, images, videos, and information, visit our London Film Festival Page, subscribe to us by Email, “follow” us on Twitter, Tumblr, Google+, or “like” us on Facebook for quick updates.", "source": "FilmBook"}