{"published": "2015-09-11T05:14:29Z", "media-type": "News", "title": "Lululemon Athletica inc.  Shares Down 14.5%  Following Analyst Downgrade (LULU)", "id": "916eadc5-97d4-4ea2-8f0c-09d9b9fe997a", "content": "Lululemon Athletica inc. (NASDAQ:LULU) shares fell 14.5% during trading on Thursday after Wolfe Research lowered their price target on the stock from $65.00 to $54.00, Analyst Ratings.Net reports. Wolfe Research currently has a peer perform rating on the stock. Lululemon Athletica inc. traded as low as $54.67 and last traded at $54.75, with a volume of 17,393,816 shares trading hands. The stock had previously closed at $64.05. \n\nA number of other analysts have also recently weighed in on LULU. Mizuho cut their price objective on Lululemon Athletica inc. from $63.00 to $58.00 and set a “neutral” rating for the company in a research report on Thursday. Evercore ISI cut Lululemon Athletica inc. from a “hold” rating to a “sell” rating and cut their price target for the company from $60.00 to $48.00 in a report on Thursday. Guggenheim  reiterated a “buy” rating on shares of Lululemon Athletica inc. in a research note on Tuesday, July 7th. Susquehanna  set a $80.00 price target on Lululemon Athletica inc. and gave the stock a “buy” rating in a research report on Wednesday, June 10th. Finally, Canaccord Genuity  reiterated a “hold” rating and issued a $60.00 price objective on shares of Lululemon Athletica inc. in a research report on Tuesday. Three investment analysts have rated the stock with a sell rating, eleven have given a hold rating, twenty-one have issued  a buy rating and one  has assigned  a strong buy rating to the company. The company currently has an average rating of “Buy” and an average target price of $65.64. \n\nIn other Lululemon Athletica inc. news, Director Rhoda M. Pitcher sold 10,000 shares of the business’s stock in a transaction that occurred on Tuesday, June 16th. The shares were sold at an average price of $67.30, for a total transaction of $673,000.00. The sale was disclosed in a filing with the Securities & Exchange Commission, which is available through this link . \n\nThe firm has a market cap of $7.57 billion and a P/E ratio of 28.60. The firm has a 50 day moving average of $62.97 and a 200 day moving average of $64.25. \n\nLululemon Athletica inc. (NASDAQ:LULU) last released its quarterly earnings data on Thursday, September 10th. The apparel retailer reported $0.34 EPS for the quarter, topping the Thomson Reuters consensus estimate of $0.33 by $0.01. During the same period last year, the business posted $0.33 earnings per share. The business earned $453 million during the quarter, compared to the consensus estimate of $445.83 million. The firm’s quarterly revenue was up 15.9% on a year-over-year basis.  Equities analysts forecast that  Lululemon Athletica inc. will post $1.93 EPS for the current year. \n\nlululemon athletica inc. is a designer and retailer of technical athletic apparel. The Business offers a line of clothing and accessories for women, men and female youth. Its garments array comprises items, like coats, shorts, tops and pants designed for healthy lifestyle activities and athletic pursuits, such as yoga, running, general fitness and dance -inspired clothes for female youth. The Organization conducts its business through two stations: corporate-owned stores and direct to consumer. The Company markets its athletic attire under the lululemon athletica and ivivva athletica brand names. As of February 1, 2015, the Organization ‘s retail footprint contained 211 stores in the United States, 57 shops in Canada, 26 stores in Australia, five in New Zealand, two in the UK plus one in Singapore. The Business ‘s retail stores are located mainly on street places, in lifestyle centers and in malls.", "source": "WKRB News"}