{"published": "2015-09-01T13:42:20Z", "media-type": "News", "title": "Moogsoft Automates IT Incident Management Workflow for Teams", "id": "04e7339d-0794-4995-bea5-b4c2fa04031e", "content": "New Incident.MOOG Capabilities Allow Enterprises to Streamline Assignment of IT Issues to Multiple Support Teams to Speed Identification and Remediation (September 01, 2015) SAN FRANCISCO, CA -- (Marketwired) -- 09/01/15 -- Enterprise IT environments are growing more complex as hybrid cloud, software-defined networking (SDN) and virtualization adoption expands. A conducted by consulting firm eDiscovery Solutions Group reported that 78 percent do not have a single integrated view or control over all IT Operations and 72 percent struggle with IT automation silos. To help combat this data and collaboration management gap, Moogsoft, the leading provider of incident early warning and collaborative remediation, today announced new team automation capabilities in its Incident.MOOG service. For large organizations with potentially hundreds of IT situations to address daily, it is impractical and overwhelming to expose the entire support staff to each and every situation. Tailoring the IT event data shared across IT Ops and DevOps teams can support faster root cause analysis and weed out the \"noise\" from unrelated events. Team automation capabilities offer advanced policy and access control features to allow organizations to manage access to data in a simple and scalable way, assigning staff to teams (e.g. network, server, storage, etc.), automating data assignment to teams, and then offering views according to teams of work in progress and past issues resolved. \n\n\"The ability for teams to efficiently manage information sharing and collaboration to solve problems is at the heart of speeding identification and response of IT issues,\" said Phil Tee, CEO at Moogsoft. \"Incident.MOOG now offers additional new automation tools for IT Ops and DevOps teams to tailor the makeup of their teams and get a clear view of all situations relevant to a given team member based on their expertise and availability.\" \n\nIncident.MOOG's new team automation capabilities facilitate: Streamlined Onboarding: Enhance the onboarding experience for new operators. Once logged in, they are automatically presented with relevant situations for their domain. \n\nIncreased Productivity: Eliminate the unnecessary data obstructing supports teams' view. Ensure that the right information gets to the right people at the right time and track team performance to continuously improve productivity. \n\nSituational Awareness: All members of a team see their team's situations. This ensures a consistent view that all operators are working from. Additionally, by providing visibility into the set of teams that are impacted or interested in certain situations, teams now have a clear view of all parties that are potential owners or stakeholders so escalation can be conducted effectively. \n\nChange Tolerance: In response to changing IT infrastructures and incident types/frequencies, the support organization is constantly changing. Moogsoft allows support to keep up with changes by easily defining and modifying teams, members and their roles. \"Gathering, correlating and identifying IT issues is not enough for organizations to be effective,\" said Tee. \"Incident.MOOG continues to automate more tasks for IT team members to be more productive and get tailored views that match their internal structure.\" \n\nAvailability\n\nTeam automation capabilities are now available to all Incident.MOOG users with v.4.1.13 or later. \n\nAbout Incident.MOOG\n\nMoogsoft's flagship product, Incident.MOOG, is an IT incident early warning and collaborative remediation system used by web-scale enterprises and service providers within IT Operations Management (ITOM), IT Service Management (ITSM) and DevOps teams. Using patent-pending machine learning technology, Incident.MOOG automates the early detection of service failures, reduces the noise without dependence on preset rules or models, creates contextualized situations of related alerts, and then facilitates collaboration via its Situation Rooms, orchestrating rapid restoral of business services. \n\nAbout Moogsoft\n\nMoogsoft is the leading provider of operational intelligence for the new era of IT, merging adaptive machine learning and socialized workflows into next-generation IT incident detection and remediation management. Its flagship service, Incident.MOOG, detects anomalies in real time to reveal service-affecting incidents as they unfold, dramatically reducing Mean-Time-to-Repair (MTTR), and enables knowledge capture and reuse through collaborative \"Situation Rooms.\" Moogsoft's founders are the original team behind IBM Tivoli Netcool and RiverSoft. The company is backed by Wing Venture Capital, Redpoint Ventures, and others. For more information, visit www.moogsoft.com and follow us on Twitter at http://twitter.com/Moogsoft. Media Contact\n\nCaitlin Haskins\n\n10Fold\n\nmoogsoft@10Fold.com \n\n(415) 800-5369 Copyright @ Marketwire", "source": "Review Seeker"}