{"published": "2015-09-04T11:59:39Z", "media-type": "News", "title": "SEC Charges Advisory Firm With Fraud for Improperly Retaining Fees", "id": "bcb15182-adcc-41e9-8716-820b6d84544c", "content": "The Securities and Exchange Commission announced that an investment advisory firm in Philadelphia has agreed to pay more than $21 million to settle charges that it fraudulently retained fees belonging to collateralized debt obligation (CDO) clients.An SEC investigation found that Taberna Capital Management did not tell CDO clients it was retaining payments known as “exchange fees” in connection with restructuring transactions. Taberna’s retention of the exchange fees was neither permitted b… \r \nThe Securities and Exchange Commission announced that an investment advisory firm in Philadelphia has agreed to pay more than $21 million to settle charges that it fraudulently retained fees belonging to collateralized debt obligation (CDO) clients. \n\nAn SEC investigation found that Taberna Capital Management did not tell CDO clients it was retaining payments known as “exchange fees” in connection with restructuring transactions. Taberna’s retention of the exchange fees was neither permitted by the CDOs’ governing documents nor disclosed to investors in the CDOs. The fees rightfully belonged to the CDOs and created conflicts of interest that Taberna failed to disclose. \n\nThe SEC also charged Taberna’s former managing director Michael Fralin and former chief operating officer Raphael Licht for their roles in certain aspects of Taberna’s misconduct. \n\n“CDO managers have an obligation to act in the best interests of their CDO clients and communicate fairly with them. Taberna secretly diverted funds owed to CDO clients, and concealed that diversion and the conflicts it created,” said Michael J. Osnato Jr., Chief of the SEC Enforcement Division’s Complex Financial Instruments Unit. \n\nAccording to the SEC’s order instituting settled administrative proceedings: \n\nFrom 2009 to 2012, Taberna sought and retained millions of dollars in exchange fees paid by issuers of securities held by the CDOs when Taberna recommended exchange transactions to CDO clients. \n\nUnder the terms of the CDOs’ governing documents, Taberna was not permitted to retain the exchange fees. Instead, those fees belonged to the CDOs. \n\nTaberna obscured its misconduct by improperly labeling the exchange fees as “third party costs incurred” in various documents. But such costs comprised only a minimal portion of the overall exchange fees. \n\nIn quarterly reports that Taberna provided to investors, it omitted any mention of exchange fees in its detailed descriptions about the e…", "source": "MyInforms"}