{"published": "2015-09-29T18:47:42Z", "media-type": "News", "title": "Cops sued for racial slur facing new suit ...", "id": "b539b04b-3eee-49bf-8ef9-6c91cdd6eba3", "content": "A suburban Chicago man says police officers in his town arrested him and roughed him up last year as retaliation for an incident in 2009. \n \nAccording to CBS Chicago , George Taylor was first confronted by Montgomery, Illinois police in 2009 during a traffic stop. Video and accompanying audio of the stop clearly shows one of the officers calling Taylor, his then-girlfriend and his children a “bunch of f****** n******.” \n \nThat was after a one hour and 45-minute traffic stop in which police threatened to break the car’s windows, use pepper spray and “grab them by the head” to get the family out of the car. \n \n“Don’t worry, you’ll make up for it next time,” another officer can be heard saying as he laughs. Only a speeding ticket was issued for the incident. \n \nThat led to just a three-day suspension for one of the officers and an out-of-court settlement with the village, according to CBS. \n \nFast forward to 2014, and Taylor alleges that the same officers retaliated against him. In dash cam video of the arrest last year, Taylor can be seen approaching police who are talking to his girlfriend and her son. \n \nJust six seconds after approaching police, Taylor is taken down to the ground, kicked in the head and allegedly called racial epithets. \n \n“I had a tooth knocked out,” Taylor told CBS . “I had a bruise on the right side of my head.” \n \nJudge Phillip G. Montgomery agreed with Taylor and acquitted him of resisting arrest. \n \nNow Michael Schmiege, Taylor’s lawyer, has filed a federal lawsuit against the Montgomery Police Department on behalf of his client, saying that the case is “crystal-clear retaliation.” \n \nSchmiege told CBS that he thinks the Montgomery police officers didn’t think they were being filmed. However, the incident was recorded by Kendall County police who were assisting on-scene. \n \nCBS reports that Taylor no longer lives in Montgomery.", "source": "Chicago Sun-Times"}