{"published": "2015-09-08T20:12:10Z", "media-type": "News", "title": "Bank of Marin Bancorp : September 08, 2015: Bank of Marin Announces Winners of Annual Spirit of Marin Awards", "id": "d2782ed6-017a-4413-9f50-54c2ca5cfc11", "content": "Bank of Marin Announces Winners of Annual Spirit of Marin Awards  \n \n Amy \"G\" of the San Francisco Giants to keynote September 25 community leadership event  \n \nNOVATO, CA - (September 8, 2015) - Bank of Marin (NASDAQ: BMRC) has announced the winners of the 22nd Spirit of Marin Awards, one of the largest business events in the County and Bank of Marin's signature event.  The awards recognize the philanthropic leadership, volunteerism and success of Marin's businesses, business leaders and volunteers, as nominated by the Marin County Chambers of Commerce.  It will take place on Friday, September 25 from 11:30 am-1:30 pm at St. Vincent's School for Boys in San Rafael with local television personality and San Francisco Giants in-game reporter, Amy \"G\" Gutierrez as this year's featured speaker. \n \n\"Spirit of Marin is a very special celebration that recognizes local leaders for their commitment to our local communities,\" said Russell A. Colombo, Bank of Marin President and CEO.  \"We've been proud to partner with the Marin County Chambers for more than 20 years and are pleased to honor businesses and individuals who generously support and strengthen our communities through philanthropy, volunteerism and exemplary business practices.\" \n \nThis year's winners are: \n• Corte Madera Chamber of Commerce - Christine Bohlke, Marin Convention and Visitors Bureau \n• Fairfax Chamber of Commerce - Sustainable Fairfax, Jennifer Hammond \n• Hispanic Chamber of Commerce of Marin - Jose Varela, Marin County Public Defender \n• Larkspur Chamber of Commerce - Andrea Schultz, Greenbrae Management, Inc. \n• Mill Valley Chamber of Commerce - Paula Reynolds, Mill Valley Chamber of Commerce \n• Novato Chamber of Commerce - Blake's Auto Body, Blake Andros \n• Novato Chamber of Commerce -  Pacheco Ranch Winery,  Herb and Deb Rowland \n• San Anselmo Chamber of Commerce - Danielle Dinnerman, D.R. Dinnerman Insurance Services \n• San Rafael Chamber of Commerce - Working Solutions, Laurie O'Hara \n• San Rafael Chamber of Commerce - San Rafael Pacifics,  Mike Shapiro \n• Sausalito Chamber of Commerce - Sally Calef-Gebron (posthumous), Genworth \n• Tiburon Peninsula Chamber of Commerce -  Joan Palmero \n• West Marin Chamber of Commerce - Katie Beacock, Seadrift Realty \n \nIn addition to Amy \"G\" Gutierrez, this year's celebratory luncheon will feature entertainment by the Marin Girls Chorus.  Luncheon reservations are required and are $60 per person.  To make a reservation, go to: www.spiritofmarin.com or call 415.884.536", "source": "4 Traders"}