{"published": "2015-09-04T09:56:02Z", "media-type": "News", "title": "Biden cannot say yet whether he will run in 2016", "id": "26f2c280-92f3-4907-ba8b-2f00cde06354", "content": "ATLANTA - U.S. Vice President Joe Biden said on Thursday he is still trying to determine whether he has the emotional energy to mount a White House bid in 2016 but cannot say yet whether he will. \n \nIn his first extensive public comments about a possible run for the Democratic presidential nomination, Biden said, \"I can't look you straight in the eye now and say I know I can do it.\" \n \nBiden, 72, has been huddling with advisers for weeks to determine whether he will challenge Democratic front-runner Hillary Clinton, who has seen her favorability ratings plummet over her use of a private email server while working as the nation's top diplomat. \n \n\"The most relevant factor in my decision is whether my family and I have the emotional energy to run,\" Biden, who lost his son, Beau, to cancer earlier this year, said in response to a question. \n \n\"The factor is, can I do it?\" he said. \"The honest to God answer is I just don't know.\" \n \nBiden was in Atlanta on Thursday night to deliver a foreign policy lecture after concluding a two-day visit to the political battleground state of Florida, where he avoided any discussion of a possible White House run. \n \nBiden said he would not be swayed by questions about whether he could raise enough money or mount an effective organization after getting a late start. The only factor, he said, was his and his family's commitment. \n \n\"Can my family undertake what is an arduous commitment?\" he said. \n \n\"Unless I can go to my party and the American people and say I am able to devote my whole heart and soul to this endeavor, it would not be appropriate.\" \n \nBiden has stepped up his public schedule, and will travel to Pittsburgh on Monday for Labor Day celebrations and New York later in the week to appear on Stephen Colbert's talk show. \n \nBut he said he did not know when he would make a decision. \n \n\"There is no way to put a timetable on it,\" he said.", "source": "Niagara Advance"}