{"published": "2015-09-07T09:00:02Z", "media-type": "Blog", "title": "Marvelous Monday Giveaway & Winner!", "id": "5a7a291b-f724-45a9-9244-66a07ae04249", "content": "Happy Monday Everyone!\nPHEW!  It's been quite a busy weekend over here at the Cardon home.  My sweet little sister, Amber, and her husband have been staying with us and it's been awesome!  I've never spent so much time with my sister and it has been much needed.  We've talked a lot, done our nails a lot, and ate a lot!  LOL!\nAre you all ready for today's Stampin' Up! giveaway?!  I am giving away a Hostess stamp set from this year's catalog!  The only way to earn this stamp set is by putting in a $150 order, so I think it's a pretty sweet prize!  Just leave a comment on this post to enter with a way I can reach you when you win!\nSilhouettes & Scripts Hostess Wood Mounted Stamp Set Winner of Last Week's Giveaway: Tara Chalkley A little about my chickens!   I have been asked to post more about my backyard chickens!  You asked, here you go... We have 9 chickens that are now laying eggs.....  Gigi, Chloe, Emma, Pepper, Kendrick, Bella, Ella, Heather, & Butterscotch! We are having a special run made for them right now so pretty soon they will have a TON of room to run around and be crazy chickens!  I am so excited for them!   This is Gigi!  She loves me and sits on my lap when I am outside.  She is a Rhode Island Red and they are known to be a little grumpy but she is the sweetest.  At least to me.  :)\nWe also have another 2 groups of chickens.  4 will be laying in the next few weeks.  Princess, Olive, Lola, and Po!  We have 8 more who will not be laying eggs until November or early Spring.  We are going to have A LOT of eggs!  We have family & friends who are loving our farm fresh eggs.  Plus, it is so awesome going to the store and never having to buy any!  \nI thought I would throw in a family picture for you guys.  I am so thankful to live in Utah and be close to both sides of our family.  My kids are happy here and I am slowly getting used to it.  Lol!  I love it here but for some reason I haven't really made any close friends.  It's only been a year, I know, but I am ready for some crafty friends now!  Good thing people have been flying out to visit me or I would go stir crazy!\nThis past week has been VERY BUSY in My Pink Loft!  My Haunt Ya Later Class sold out and I had a ton of project packets to cut and prepare along with little gifts that I made for my class participants. I am so happy to say that everyone's classes are in the mail!  My next class will be posted soon.  I need to catch my breath first!  \nI forgot to post these super cute notebook sets!  I will have to make a video for you guys showing how I made them.  These were quick & easy and didn't take any time at all!  \nThis weekend has also been busy setting up my new Jamberry business!  I never realized how much fun I would have decorating my nails and teaching others how to do it, too!  I have started a Jamberry blog if you would like to check it out.  Click HERE to see what you think!  I am still sending out free samples.  Just let me know if you would like one at mypinkstamper@gmail.com.\nOkay!  We are back to our regular weekly schedule!  I will have a new video tutorial up for you tomorrow.  I am going to slip 1-2 days a week with Jamberry but I will make sure that I also do 4-5 days of Stampin' Up!  I promise to fill all your crafting and nail needs!  hee hee! •View 2015-2016 Stampin' Up! Online Catalog HERE •Request a Stampin' Up! Holiday Catalog HERE •Join my Stampin' Up! team HERE\n•Order Stampin' Up! Online HERE •Sign up for Paper Pumpkin HERE •Join my Jamberry Team HERE •Order Jamberry Nails HERE •Check out my Jamberry Blog HERE", "source": "The Pink Stamper"}