{"published": "2015-09-05T08:30:26Z", "media-type": "Blog", "title": "God-Size Goals", "id": "97016577-4691-409a-b1b2-d9ca5430ef46", "content": "Thoughts from daily Bible reading for today – September 5, 2015 \n \nJesus replied, ‘What is impossible with men is possible with God.’ Luke 18:27 \n \nGod-size goals are meant to challenge our thinking and further our faith. These Holy Spirit inspired ‘big ideas’ are crafted by our Creator to spur us on to good works and transformational living. God-sized goals make us uncomfortable at times. They are not guaranteed to happen, but they position us to pray more and believe in God better. \n \nIt is through prayerful planning and implementation that gigantic goals move from mere possibility to a more certain probability. Huge objectives are a hedge against mediocrity and a prod toward perfection. God-sized goals are given to govern your thinking and determine your time, so you are intentional and focused on His big picture. Otherwise you drift around without a rudder of reality, destined for disappointment. \n \nBest of all God-size goals get you to God. It is prayer and planning with significant progress that moves you from the realm of possibility to the place of probability. In most cases it is one man or woman’s passion and focus that proves catalytic to the creation and execution of the goals. The leader looks failure in the eye and extinguishes it by faith, wisdom, and hard work, which are all wrapped around a skilled and unified team. \n \nChrist-centered possibilities far outweigh man-centered probabilities. Perhaps you need to get away in solitude for several days to ask your Savior to sear your soul with His goals. Think outside the box of small belief, for the Lord is unlimited in His abilities and resources. God-size goals arrest your attention, adjust your attitude and accelerate your actions. \n \nSo prayerfully set great goals and He will grow your character in the process while influencing others for His glory. Trust Him to teach you the way; to show you with eyes of faith way beyond the bounds of your experience, for His plan will prevail. The Bible says, “I know you can do all things; no plan of yours can be thwarted” (Job 42:2). \n \nApplication: What goal is God giving me that I need to accept by faith and work hard towards its accomplishment? \n \nRelated Readings : Genesis 18:14; Jeremiah 32:17; Matthew 19:26; Ephesians 1:19-20 \n \nPost/Tweet this today : God size goals get us focused on God. #goals #wisdomhunters \n \nAdditional Resource : 3 minute music video- David Crowder: I Am \n \nToday’s reading is from our 30 day devotional book Wisdom for Work .  Order  Boyd’s new book. \n \nPlease consider this opportunity to support Wisdom Hunters as giving has dropped off over the summer. We are trusting the Lord for additional gifts over the next 30 days. Learn how to help . \n \nOur free Apple app      Our free Android app \n \n© 2015 by Boyd Bailey. All rights reserved. \nWisdom Hunters Resources / A registered 501 c3 ministry  info@mail.wisdomhunters.com \n \n ", "source": "Wisdom Hunters Daily Devotional"}