{"published": "2015-09-14T22:16:06Z", "media-type": "News", "title": "Professor shot, cops seek suspect", "id": "ef168955-a88c-41c8-9fd5-a62ba5f9e4cf", "content": "(CNN) -  \n[Breaking news alert, posted at 6:10 p.m. ET Monday] \n \nShannon Lamb, an employee of Delta State University in Mississippi, is a suspect in the shooting death of a professor there Monday, Cleveland Police Chief Charles Bingham told reporters. Lamb remains at large and is considered armed and dangerous, Bingham said. \n\nThe school remains on lockdown after the shooting, University President William LaForge told reporters, but buildings at the school have been cleared. \"We have checked the campus out thoroughly. We believe that our buildings are clear. And our students, most importantly, are safe,\" LaForge said. \n\n[Previous story, posted at 5:32 p.m. ET Monday] \n\nPolice are scouring a Mississippi college campus after a history professor was killed in his office Monday -- and investigators say another employee at the school could be connected to the case. \n\nDelta State University history professor Ethan Schmidt was shot in the head, Bolivar County Deputy Coroner Murray Roark said. The shooter remains at large, the coroner said. \n\nInvestigators say an instructor at the school in Cleveland, Mississippi, is a \"person of interest\" in the case, and police in a town 300 miles away described him as a suspect in another homicide there. \n\nAuthorities are searching for Shannon Lamb, Cleveland Police Chief Charles Bingham said. He described Lamb as an employee of the university and person of interest, but Bingham did not detail why investigators are calling him a person of interest or what his connection could be to the slain professor. \n\nThe person of interest could be driving a black Dodge Avenger, the school said on Twitter, asking anyone with the information to call police. \n\n\"At this time we don't think he's on campus,\" Bingham told reporters, \"but we're not taking anything lightly.\" \n\nThe university, which is about 115 miles south of Memphis, remained on lockdown hours after the shooting, and police were working to clear buildings on the campus, the school said in a statement. Officials canceled classes for the remainder of the day Monday and Tuesday. \n\nA biography of Lamb posted on the school's website says he received his Ph.D. from Delta State in 2014, and has taught geography and social sciences education courses there. \n\nConnected to another case? \n\nMeanwhile, police in Gautier, Mississippi, are investigating a homicide that happened in the area Monday morning that could be connected to the fatal shooting of the Delta State University professor, Detective Matt Hoggatt with Gautier Police told CNN. \n\nHoggatt said Lamb is a suspect in the Gautier shooting. He was last seen driving a green SUV, Hoggatt said, and that vehicle has also been linked to the Delta State University shooting. \n\nAuthorities have not named any suspects in the university shooting. Gautier is about 300 miles away from the university. \n\n'Beloved' professor \n\nAt Delta State, the hunt for Schmidt's killer brought together campus police and city police as well as the Mississippi Highway Patrol, Bolivar County Sheriff's Department and agents from the Bureau of Alcohol, Tobacco, Firearms and Explosives. \n\nThe school said it was scheduling a series of counseling sessions for Tuesday. \n\n\"We lost one of our beloved professors today,\" Michelle Roberts, vice president of university relations, told reporters. \"We are grieving on this campus.\" \n\nSchmidt's Delta State biography says that he taught undergraduate courses in American history, and completed his Ph.D. at the University of Kansas in 2007. Schmidt had written several books and scholarly papers and had expertise in Native American history. \n\nBefore working at Delta State, he taught for six years at Texas Tech University in Lubbock, where he received the President's Award for Excellence in Teaching in 2", "source": "Idaho8.com"}