{"published": "2015-09-04T08:48:05Z", "media-type": "News", "title": "Cameron Huang punts $1 million riding on Neil Armfield's Holding the Man", "id": "5f9e221c-6391-46ac-a329-05d026555ce2", "content": "A former property developer has spent eight years and a huge sum of money to see a hit play become an Australian film. \n\nMore on Holding The Man​Movie session timesFull movies coverage\n\nIt could be the biggest punt in Australia this weekend, racetracks and casinos included.\n\nFormer property developer Cameron Huang has more than $1 million of his own money riding on how director Neil Armfield's gay romance Holding the Man opens in cinemas then sells around the world.\n\nHuang, 43, knew nothing about the film industry when he saw Tommy Murphy's play of the same name, based on Tim Conigrave's memoir about his 15-year relationship with former schoolmate John Caleo, eight years ago.\n\n\"I was very touched by the story,\" he said. \"I knew instantly that the stage play had to be a movie.\n\n\"Every gay man in Sydney can probably identify with parts of that story.\"\n\nReady to move out of property development, Huang wanted the story about love enduring, despite the devastation of AIDS, to reach a wider audience.\n\n\"Had I been five years older, I would have been caught in the whole AIDS crisis and I'd be dead by now,\" he said. \"I'm very fortunate. That's why I think it's so important that this story be told.\"\n\nHuang formed a partnership with Murphy then set about learning filmmaking, finding many similarities to his former career.\n\n\"With property development, you have to start with a good piece of land in a good location,\" he said. \"In filmmaking, you start with a good story.\n\n\"Then you hire an architect to draw a beautiful building. In filmmaking, you hire a writer to write a script.\n\n\"Once you have the architectural drawings, you hire a builder to translate the drawings into a physical building. In film, you hire a producer and director to translate the words into pictures.\n\n\"At the end, you hire an agent to sell your property and you hire a distributor to distribute your movie. The process is similar; the product is different.\"\n\nAs a rare \"angel\" investor in an Australian film, Huang is executive producer of Holding the Man.\n\nProducer Kylie Du Fresne, best known for The Sapphires, said financing what she describes as a medium-budget Australian film was surprisingly smooth because of Huang's contribution.\n\n\"Cameron was putting up almost the same amount of money that Screen Australia was,\" she said. \"It wasn't because he saw himself making a career as a film investor. It was because he believed in the material.\"\n\nWhile he wanted creative input on the script, casting and editing, Du Fresne said Huang was highly respectful of the filmmakers' expertise.\n\n\"He spent a lot of time on set just quietly watching from the back.\"\n\nWhile Huang concedes there is a chance he could lose all his investment, he believes the quality of the filmmaking team has minimised the risk. And the positive early response to the film has eased his nerves.\n\n\"You could play this story with a different disease – it could be cancer – and it's still a beautiful love story,\" he said. \"It just happens that instead of Romeo and Juliet, it's Romeo and Romeo.\" The story first appeared on The Sydney Morning Herald.", "source": "Oberon Review"}