{"published": "2015-09-29T19:34:16Z", "media-type": "News", "title": "SMU Men's Basketball Team Banned From Postseason Over NCAA Violations", "id": "0f00323e-f62d-4aa6-8297-b66b1fafe68e", "content": "The NCAA has slapped sanctions on Southern Methodist University's men's basketball and golf programs for rule violations. Among other punishments, both teams have been banned from competing in their respective postseasons. \n\nAccording to the NCAA's report , SMU \"committed multiple violations, including academic fraud, unethical conduct and head coach control in the men's basketball program and recruiting and unethical conduct in the men's golf program.\" \n\nThe punishment for the men's basketball team was handed down after an NCAA investigation concluded that an assistant coach had done a player's schoolwork for him. The report states: \n\n\"A former assistant men's basketball coach encouraged a student-athlete to enroll in an online course to meet NCAA initial eligibility standards and be admitted to the university. After he enrolled in the course, a former men's basketball administrative assistant obtained the student's username and password then completed all of his coursework.\" \n\nIn addition, head basketball coach Larry Brown — who led his team to a stellar season last year that earned them a 6-seed in the NCAA tournament — has been suspended for nine regular-season games. \n\nIn a statement Tuesday, Brown said: \n\n \n\"Leading the SMU men's basketball program is an honor and a responsibility that I take very seriously. That duty incudes helping our young men develop into people of character and to ensuring that we pursue our goals with integrity. I am saddened and disappointed that the Committee on Infractions believes that I did not fully fulfill my duties and I will consider my options to challenge that assertion in the coming days. I truly believe that our program has dedicated itself unwaveringly to the ideals of academic integrity and NCAA compliance. Still, there was a violation in our program and I take responsibility for that and offer my sincere apologies to the University community.\" \n\n \nBrown coaching career is both studded with trophies and marred by scandals. The hall-of-famer coached 10 NBA teams and won the NBA title with the Pistons in 2004, making him the only coach to win both a college championship (he won with Kansas in 1988) and an NBA championship . Brown has also coached three college programs: SMU, Kansas and UCLA — Kansas and UCLA were also sanctioned by the NCAA while under Brown's leadership. \n\nThough the NCAA said that Brown had \"no direct knowledge\" of the assistant coach completing the player's homework, it said he failed to handle the situation appropriately. \n\n\"Upon learning of the misconduct in 2014, the head basketball coach did not report it to the compliance staff, conference office or enforcement staff for more than a month,\" the report stated. \"When asked by the NCAA enforcement staff about the potential violations, the head basketball coach initially denied having any information about the conversations with the former administrative assistant and student-athlete.\" \n\nThe golf team faces punishment for violating recruiting protocols. The former coach, Josh Gregory, who resigned in 2014 when the NCAA violations first came to light, was found to have improperly contacted potential players. \n\n\"He had 64 impermissible contacts with 10 prospects and seven parents of prospects over the course of 10 months. The majority of the contacts occurred a year or more before NCAA rules allow contact with prospects,\" according to the report. \n\nThe NCAA also concluded that a booster also facilitated contact between prospective players and Gregory. \n\nSMU President R. Gerald Turner and Director of Athletics Rick Hart were scheduled to address the media at 3 p.m. ET and Brown was set to speak at 4:30 p.m., according to the school's website .", "source": "WUNC"}