{"published": "2015-09-02T20:05:00Z", "media-type": "News", "title": "Farmer Bros. Co. to Present at the 4th Annual Liolios Gateway Conference on September 10, 2015", "id": "998e70a3-46ba-467b-897f-975a70acf9ac", "content": "TORRANCE, Calif., Sept. 2, 2015 (GLOBE NEWSWIRE) -- Farmer Bros. Co. ( NASDAQ:FARM ) (\"Farmer Brothers\", or the \"company\"), a coffee roaster and distributor with a history of more than 100 years, has been invited to present at the 2015 Liolios Gateway Conference being held September 9-10, 2015 at the Four Seasons Hotel in San Francisco, CA. \n\nMark Nelson, Treasurer and Chief Financial Officer of Farmer Bros. Co. is scheduled to present on Thursday, September 10 at 1:00 p.m. Pacific time, with one-on-one meetings held throughout that day from 8:00 a.m. \n   \nA copy of the presentation will also be available on the Investor Relations section of the Company's website at www.farmerbros.com at the time of the presentation. \n\nFor more information about the conference or to schedule a one-on-one meeting with Farmer Brothers management, please email gateway@liolios.com . \n\nAbout the Gateway Conference \n\nThe 4 th Annual Gateway Conference is an invite-only conference presented by Liolios, a comprehensive financial communications firm. Gateway was designed to bring together the most compelling companies with the nation's top institutional investors and analysts. This year's event features more than 90 companies from a number of growth industries, including technology, business and financial services, consumer, digital media, clean technology and life sciences. The format has been designed to give attendees direct access to senior management via company presentations, Q&A sessions and one-on-one meetings. For more information, visit www.gateway-conference.com or www.liolios.com . \n\nAbout Farmer Bros. Co. \n\nFounded in 1912, Farmer Bros. Co. is a manufacturer, wholesaler and distributor of coffee, tea and culinary products. The Company's customers are restaurants, hotels, casinos, offices, quick service restaurants (\"QSRs\"), convenience stores, healthcare facilities and other foodservice providers, as well as private brand retailers in the QSR, grocery, drugstore, restaurant, convenience store, and independent coffee house channels. The Company's product line includes roasted coffee, liquid coffee, coffee-related products such as coffee filters, sugar and creamers, assorted iced and hot teas, cappuccino, cocoa, spices, gelatins and puddings, soup bases, dressings, gravy and sauce mixes, pancake and biscuit mixes, and jellies and preserves. Headquartered in Torrance, Calif., Farmer Bros. Co. generated net sales of over $500 million in fiscal 2014 and has approximately 1,800 employees nationwide. The Company's primary brands include Farmer Brothers™, Artisan Collection by Farmer Brothers™, Superior®, Metropolitan™ , Cain's™ and McGarvey®. For more information, visit:  www.farmerbros.com . \nCONTACT: Farmer Bros. Co.\n         Mark Nelson (310) 787-5241", "source": "Market Pulse Navigator"}