{"published": "2015-09-24T20:50:55Z", "media-type": "News", "title": "Raiders' Smith, Tuck, Mack equal zero sacks", "id": "e1a64271-162d-4a4e-8b3e-f1835854369e", "content": "ALAMEDA -- If name power were enough to deliver a fierce pass rush, the Raiders would be covered.\n\nKhalil Mack, Justin Tuck and Aldon Smith make for an intimidating trio, but through two games Oakland has yet to record a sack. So far, that's the biggest point the Raiders and their foes are making: it's only two games.\n\n\"In our mind, that just means that they're going to be that much more hungry to get there,\" said Cleveland Browns quarterback Josh McCown, who will face the Raiders on Sunday. \"They've been close. They certainly got their fair share of hits on the quarterback.\"\n\nPro Football Focus lends some credence to that. The site rates the Raiders' pass rush as 15th in the league even without a sack. They credit Oakland with three quarterback hits and 13 hurries.\n\n\"These guys are good pass rushers,\" McCown said. \"They don't have sacks in two games. It doesn't mean anything to us because it's so early.\"\n\nSmith, in 79 snaps over two games, leads the team with two hits and six hurries. He's had some issues getting off or overpowering blockers like he did during his peak seasons with the 49ers, but all six of his hurries came in Sunday's win over the Baltimore Ravens.\n\nMack, second on the team with four hurries, has elevated himself to become the focus of opposing defenses, which adds its challenges as he faces his fair share of double teams.\n\nThe Raiders made more of an effort to blitz in Sunday's win. PFF charted them with 19 blitzes, compared to just three in the season-opening loss to the Cincinnati Bengals. Ravens' quarterback Joe Flacco completed just 10 of 19 passes for an average of 5.8 yards while being blitzed, compared to 22 of 26 for 10.5 yards per attempt when not blitzed.\n\nThose pressures and hits are important, but don't always provide the game-changing impact of a sack. And through two games, the Raiders are last in the NFL in defense, allowing 444.5 yards per game.\n\n\"It's still early in the season and we're learning who we are, learning what we do best,\" defensive coordinator Ken Norton Jr. said. \"I think that as the season grows, we'll mature and get better and we'll come into our own as the games go by.\"\n\nThe ability by veteran quarterbacks to release the ball quickly has no doubt been a big factor in these initial two games, but the Raiders know they need to find ways to mitigate that.\n\n\"It's not just them getting their rush,\" middle linebacker Curtis Lofton said. \"The secondary has to cover and those guys have to rush. It works hand in hand and when it works, good things happen.\"\n\nMaking Oakland's challenge tougher this week is an offensive line that's among the best in the NFL.\n\nIt's anchored by eight-time Pro Bowl left tackle Joe Thomas, who hasn't missed an offensive snap since being taken No. 3 overall in 2007. Center Alex Mack is a two-time Pro Bowler and left guard Joel Bitonio was an All-Rookie team selection last year.\n\nCleveland was rated as the second-best pass blocking team last year by PFF and was in the top-five the previous two years. The Browns have given up five sacks this year, all taken by Johnny Manziel. He returns to his backup role after starting last week's win over the Tennessee Titans.\n\nIn McCown, the Raiders face a player who was sacked 36 times in 11 games last season with the Tampa Bay Buccaneers and fumbled 10 times.\n\nMack, while speaking of his frustration after last week's game about the lack of a rush, simply hopes to see it get better.\n\n\"Move forward and hopefully next week (we'll) have a different outcome,\" he said, before catching himself. \"Well, a different outcome defensively, cause we want to win. Keep getting wins.\"\n\nFor more on the Raiders, visit the Inside the Oakland Raiders blog at ibabuzz.com/oaklandraiders. Follow Jimmy Durkin on Twitter at Twitter.com/Jimmy_Durkin.", "source": "Inside Bay Area"}