{"published": "2015-09-21T11:12:04Z", "media-type": "News", "title": "Fake Leaders for Fake People", "id": "36349778-9942-475d-bdf2-23b7372911c1", "content": "Lying hypocrites beg for votes from the misinformed and unenlightened  \n\nBy John Kaminski \n \nhttp://renegadetribune.com/author/kaminski/ \n \nhttp://therebel.is/kaminski \n \nAnyone who runs for president of the United States must supervise the robbery and murder of innocent countries, promise to maintain the unjust slave system of the international bankers, and lie about everything that pertains to the safety of the American people, because there is no safety for anyone in these desperate times as long as Jewish controlled puppets continue to wreak havoc on the entire world. \n \nAmong the hundreds of delusional demagogues who have run for president over the years, the most pathetic scene I ever witnessed personally was in the 2012 race when a large crowd of white-haired retirees gathered at Sarasota airport to enthusiastically welcome Minnesota Rep. Michelle Bachman, a pro-Israel shill who was later ridiculed for both her use of anti-depressants and her unflinching support for the international bankers who have deliberately sabotaged the American economy for more than a hundred years. \n \nThey loved her because she told them what they wanted to hear, and what she told them and what they wanted to hear was nothing but a garbled rant about American supremacy and the necessity to pay down the debt before any other money was ever spent. Some of us know now that the debt can never be paid off, which is the essence of the Jewish swindle of the whole world. \n \nHow could anybody with a brain have ever supported such a facile, drug-addled ignoramus as Bachman, who recently said the only way to avoid war with Iran is to bomb it? But it happens every election, with homicidal crazies urging war on the world to counter false flag threats that have been cynically engineered by the CIA and Mossad. Thanks to a war-mongering media run by the same money men who sell the weapons and commit the colossal crimes, Americans never learn. \n \nBut just as scary as the bizarre also-rans of history is the list of the people who have actually won presidential elections. Consider in recent years the immoral Bill Clinton, who gave America’s jobs away; George Bush the Younger, who was so dim-witted he had to be left out of the plot to wreck the World Trade Center lest through his stupidity he accidentally revealed the secret Jewish plan; and Barack Obama, who has no verifiable history at all except a suspicious trail of dead homosexual friends and a wife with a male physiognomy. \n \nSo I guess we shouldn’t be too surprised at the sudden emergence of megalomillionaire Donald Trump as the leader of this year’s pack. He has done what other early leaders have always done, told people exactly what they want to hear. \n \nThe dark side of this autumn romance, however, is that he is exactly like all the other would-be tyrant candidates — a diehard supporter of Israel, a great believer in a strong military, and a solid supporter of all the financial chicanery that has mired America in its deteriorating economic quagmire. Perhaps Trump’s expertise in the art of bankruptcy will provide a timely skill for the nation’s current and deepening depression. \n \nBut all of these observations are incidental. The facts on the ground are that none of the current candidates shows any indication of tempering the criminal policies of U.S. aggression against Israel’s enemies, or of addressing the intrinsically unfair policies of the Jewish central bankers who have fleeced America and the world since Woodrow Wilson promised to keep us out of World War I. \n \nAll the candidates show not a whit of genuine concern for the American people, but only obedience to the Jewish financial powers that make their candidacies possible. \n \nThen again, it seems to make a weird kind of sense that the candidates don’t display any verifiable competence and the electorate is predominantly out to lunch. It’s a perfect match. Fake leaders for fake people. From this match made in hell, nothing but further catastrophe can result. \n \n••• \n \nYour life is a lie, and the lives of your children are lies, based upon what you have told them about the way the world works, and how their futures will unfold. \n \nYou based your life on the lies you learned from your parents, received in school, and gleaned from the media and your friends, who have all been immersed in a sea of misinformation throughout their lives. \n \nBut now the grim fairy tales you have erected to justify your exploitation of the less fortunate of the world are beginning to crumble. The word bounceback has never been more apropos. The law of karma inflicts its deadly reward in the mirrored reflex of savages mimicking the heartless interlopers who have plundered them, desperate savages who now overwhelm the countries that have exploited them in the past. \n \nAnything goes, and money is all that matters. And on that day when the money is worth nothing, the world will implode. \n \nAnything that can be saved can also be stolen, as today’s Europeans are learning at their peril. \n \nEurope and America are about to be overrun by hungry slaves. Nothing can stop them, especially since the government is helping displace its own loyal citizens in a plot too wrenchingly macabre to even begin to comprehend. \n \nHow does it come to be that many of the refugees subjecting themselves to hardship and fleeing their war-torn homelands have thousands of dollars in their pockets, money which supposedly comes from American sources? How were these refugees able to pay the thousands of dollars for their precarious sea voyages from Turkey to some forlorn Mediterranean shore. \n \nPrecious few of us are strong enough, at least when we’re young, to discern between the truth and the lie, between the stark unadorned reality that nonplusses us and the fanciful fairy tale that beguiles us. More importantly, the young fail to realize that what we do to others inevitably comes back to haunt us. \n \nSo we get our news from the newspapers, or today the TV news, which, rather than being purveyors of the actual facts of the world, are rather the curators of the perpetual lies of the world, and in our reading of the news we become like those who have manipulated us always wanted us to become, namely, heartless killers, interested only in our own prospective fortunes. \n \nForced to defend our lives and our property, we will fight. And the Jews will have won, deploying their police to quell the unreasonable unrest. \n \nThe financial engine of the United States runs on killing people every day, which our candidates conveniently ignore as they prattle on about national security and the need to pay down a national debt that can never be repaid. \n \nWe have been taught to believe so many false things put forth by our fake media that we can’t hope to even discern what a genuinely altruistic candidate would actually say. We have been so convinced of the necessity of the income tax and the inevitability of inflation that we can no longer grasp the reality that existed in America for more than a hundred years that neither of these parasitic practices existed, and for a century inflation did not occur. \n \nWe listen to our doctors and the people in control of our children who swear on a stack of Bibles that what they’re doing is best for us, then react in tearful silence as our kids are returned to us at the end of the school day either half dead or totally deformed because of the medicines they were forced to take or the appalling lessons they were compelled to learn (like showing homosexual techniques to first graders to properly prepare them for molestation). \n \nThe one essential gauge that will indicate America is on the road to realism will be that one landmark day when we finally decided to address the festering lie of the 9/11 coverup. Until that happens we will continue on the road to ruin until America and the human race will run out of time, which will happen when we run out of air, which will happen a lot sooner than everyone thinks. \n \nFrom here on out, no person who refuses to address and overturn the lies that were told on September 11, 2001 can ever be a legitimate president of the United States. All those running now are merely cardboard cutouts furnished by the kosher tyrants who control our lives. They are all guaranteed to do nothing to improve our lives, only to fleece us thoroughly before harvesting our organs. \n \nThe savage rabble that now overruns the so-called civilized world only delivers the required cosmic payment for the mutilation of their innocence, the rape of their cultures, and theft of their precious possessions. They are here to return the favors. \n \nIn a country that ignores hapless victims of gratuitous violence lying in the street bleeding, one should not expect a functional response to one’s own misery and pain. That no candidate can realistically promise relief from our misery further indicates that whatever our presidential hopefuls are saying is merely meaningless rhetoric from the insane asylum our society has become. \n \nDonald Trump is a specialist in bankruptcy and casinos, which tells us a lot about the future he would guide us toward. Owner of golf courses and beauty contests, his television show featured his ability to fire people in an insulting way. The bottom line is that he has even been fired as boss of his own casinos and the people who invested in those casinos have lost 99 percent of their investments, according to CNN. \n \nI think it’s a fair rule of thumb that to vote for Donald Trump — or for that matter any of the announced candidates — that you will lose 99 percent of your investment. \n \nAnother loser trying to end her unemployment with a stint in the White House is Carly Fiorina, who was fired as president of Hewlett Packard after being labeled as one of the worst technology CEOs of all time. \n \nThen there’s Ben Carson, the vaunted neurosurgeon who advocates forced vaccinations despite the poisons in them. I’d mention the other Republican candidates but you could do better picking names at random out of the pages of a big city telephone book. \n \nAgainst this lineup of moribund Republicans, the Democrats counter with Bernie Sanders, an acknowledged Communist, and the old hag Hillary Clinton, who like so many other current American politicians, admittedly most of them Democrats, really ought to be serving life in prison for treason. \n \nEvery one of these brittle personas have their own quaint fairy tales about what is wrong with the U.S. government, but like the people whose votes they pursue, they all fail to understand the words of the philosopher Jiddu Krishnamurti, who once said: \n \nIt is no measure of health to be well adjusted to a profoundly sick society. \n \nTo cast your vote for any one of these announced candidates is to reveal your own blind psychopathology for all to see, assuming there is anybody left who actually can see in this fetid swamp of fake people known as the American populace. \n \nJohn Kaminski is a writer who lives on the Gulf Coast of Florida, constantly trying to figure out why we are destroying ourselves, and pinpointing a corrupt belief system as the engine of our demise. Solely dependent on contributions from readers, please support his work by mail: 6871 Willow Creek Circle #103, North Port FL 34287 USA. \n \nhttp://renegadetribune.com/author/kaminski/ \n \nhttp://therebel.is/kaminski \n \nhttp://johnkaminski.info/ \n \nhttp://www.rudemacedon.ca/kaminski/kam-index.html \n \nhttp://web.archive.org/web/20040323232319/http://johnkaminski.com/ \n \n#", "source": "Before It's News"}