{"published": "2015-09-22T09:49:53Z", "media-type": "News", "title": "TAT supports Street Food Bangkok app to promote the tastes of Thainess", "id": "22b63ce7-3550-4790-9e26-47ce00ade23f", "content": "The Thailand Foundation, a unit of the Ministry of Foreign Affairs, has launched an app to help visitors get access to some of the best street food in Bangkok. \n \nDeveloped with the support of the Tourism Authority of Thailand (TAT) and the Bangkok Metropolitan Administration, the “Street Food Bangkok” app was launched in a special event at the Ministry of Foreign Affairs on 21 September, 2015. Foreign ambassadors and senior officials from about 20 diplomatic missions in Thailand attended the event. \n \nThe app provides information on street food from 121 vendors and stalls across Bangkok, encompassing 25 tasty menus. It will soon be expanded to include street food vendors in Chiang Mai, Chiang Rai and other cities of Thailand. The aim is to bring street food to the attention of both Thais and foreigners and to promote Thai culture and tourism, which would help stimulate the national economy. \n \nIn his opening remarks, H.E. Norachit Sinhaseni, Permanent Secretary, Ministry of Foreign Affairs, said, “Thailand has long been regarded as the Kitchen of the World, not only because of her richness in agricultural and agro-industrial products that have been exported worldwide, but also of her cuisine that has always been ranked among one of the top ten food in the world. Thai cuisine has been recognised internationally for its unique taste as well as its gastronomic presentation that combines colours, aromatic components, and herbal and medical benefits. \n“In order to promote Thai food further and to correspond to the IT age, the Thailand Foundation has now developed the Street Food Bangkok mobile application to facilitate modern-day travellers, who prefer to use digital gadgets as a tool to explore their destination city and places to eat.” \n \nThe Street Food Bangkok app can be downloaded for free onto tablets and smartphones with Android and iOS operating systems and has a user-friendly, easy-to-navigate interface that shows users a range of dishes, sorted by location and type, with details of specialty dishes listed as well as preparation techniques and ingredients. There are also directions to each stall or shop and opening times. \n \nMr. Siripakorn Cheawsamoot, TAT’s Executive Director of the Information Technology Office, also spoke at the event. He highlighted the importance of Thai cuisine as one of the key factors that attracts visitors from all over the world, and thanked the Thailand Foundation and the Bangkok Metropolitan Administration for their support. \n \n“Street Food Bangkok” is the property of the Thailand Foundation, registered with the Department of Intellectual Property, Ministry of Commerce.", "source": "ETurboNews"}