{"published": "2015-09-10T12:21:28Z", "media-type": "News", "title": "Zesa's Debt Interest Poser", "id": "73844457-4e78-4341-b25a-761e9e3df1a9", "content": "GOVERNMENT is finally engaging ZESA Holdings over the proposed takeover of interest on a Federation-era debt to Zambia, the Financial Gazette's Companies &Markets (C&M) can report. The interest had ballooned to US$114,8 million. \n\nThe development comes after ZESA Holdings, through the Ministry of Energy and Power Development, last year requested that the interest payable be transferred to government as the liability was a government-to-government debt. \n\nBut for some reasons, more than a year after the request, government had not responded to the appeal. \n\nThe interest emanates from a US$70,8 million debt to Zambia which Zimbabwe inherited after taking over power generation assets that had been shared between the two countries. \n\nThe debt was for the shared cost of the Kariba Dam construction and associated infrastructure during the tenure of Central African Power Corporation (CAPCO), a power firm jointly owned by the governments of Zimbabwe and Zambia when they were still part of the Federation of Rhodesia and Nyasaland, which was dissolved in 1963. \n\nIt also included the sale of assets belonging to CAPCO. \n\nNow, secretary for the Ministry of Finance and Economic Development, Willard Manungo, revealed to C&M that talks are underway. \n\n\"We are now in discussions with ZESA over the interest component,\" said Manungo, adding: \"Check with me in the coming few weeks, we should have a position over this matter.\" \n\nC&M was the first to report on the interest payment which was due for payment last year. \n\nThe interest component was ratified by an inter-governmental committee of officials representing Zimbabwe and Zambia governments in February last year at a meeting in Livingstone. \n\nFinance Minister, Patrick Chinamasa, was part of that meeting. \n\nChinamasa was then requested by his Zambian counterpart to come up with a proposal on the interest payment schedule. \n\nIt was, however, not immediately clear whether Chinamasa had come up with the schedule or not. \n\nGiven the weight of debt the power utility is currently carrying, there are fears that ZESA could be forced to take the interest component into its books, a situation which would worsen the pressure on the integrated power generation and distribution company which has clearly struggled to service its foreign debts. \n\nIn May last year, the Ministry of Energy and Power Development wrote to Chinamasa, saying: \"Interest on the ex-CAPCO debt was agreed at US$114,827,778 by the two governments (of Zimbabwe and Zambia) through an established Council of Ministers. \n\nFinance Minister, Patrick Chinamasa \n\n\"The position of the Ministry of Energy and Power Development is that the responsibility to pay the interest on the government of Zambia debt rests with the government of Zimbabwe as the liability is a government to government debt. \n\n\"This position was communicated to the Ministry of Finance and Economic Development in a letter written to them on May, 29, 2014 and a formal response has not yet been received. \n\n\"It is the Ministry of Energy and Power Development's expectation that the liability for the interest will be accepted by the Ministry of Finance and Economic Development.\" \n\nCAPCO was running the Kariba power project for the two countries but was disbanded in 1987, and was succeeded by the Zimbabwe River Authority. \n\nIts assets were distributed to national power companies in the two countries, which are ZESA Holdings and Zambia Electricity Supply Corporation (ZESCO). \n\nAfter distribution of the assets, the government of Zimbabwe owed the government of Zambia US$70,807,000. \n\nThe amount remained outstanding, and Zimbabwe in February 2012 signed a new acknowledgement of debt with a payment plan. \n\nGovernment then transferred the debt to ZESA Holdings as it was the beneficiary of the distributed assets. \n\nZESA Holdings was, however, pressured to pay the principal amount after Zambia threatened to pull out of a deal for the two southern African countries to jointly construct the Batoka Gorge Hydro Power Station on the Zambezi River. \n\nZimbabwe and Zambia in February 2012 signed a Memorandum of Understanding to jointly construct Batoka Gorge Hydro Power Station with each country expected to get 800 megawatts of electricity from the project, a development which would help boost power supply in the two southern African countries. \n\nThe agreement on the Batoka project, situated about 54 kilometres downstream of Victoria Falls on the Zambezi River, was therefore dependent on Zimbabwe's commitment to pay off the US$70,8 million debt. \n\nPlans for the project were initially mooted in 1993, but the Zambian government was reluctant because of the outstanding debt which it wanted Zimbabwe to clear first. \n\nThe power utility, which is wholly-owned by government, has already paid off the principal of about US$71 million in accordance with the payment schedule as per the settlement agreement of February 9, 2", "source": "Individual.com"}