{"published": "2015-09-02T11:36:51Z", "media-type": "News", "title": "Wavestream Certified to ISO/AS 9100 Quality System Standard", "id": "6dc4aaf0-1066-451d-a2b9-d3b43c1d96be", "content": "SAN DIMAS, Calif., Sept. 2, 2015 (GLOBE NEWSWIRE) -- Wavestream, a wholly-owned subsidiary of Gilat Satellite Networks Ltd. ( NASDAQ:GILT ) (TASE:GILT) providing solid-state power amplifiers for mission-critical defense and broadcast satellite communications systems, announced today that it has been certified to the ISO/AS 9100 quality system standard. \n\nISO/AS 9100 certification is part of an extensive program Wavestream has implemented in order to meet the quality standards of aerospace companies and aircraft manufacturers. \n   \n\"With ISO/AS 9100 certification, we are well positioned to become the primary supplier for aerospace companies and aircraft manufacturers,\" said Bob Huffman, Wavestream's General Manager. \"I am proud of our team for their focus and commitment in achieving this important goal.\" \n\nAbout Wavestream \n\nWavestream designs and manufactures solid-state power amplifiers for mission-critical defense and broadcast satellite communications systems. The company's innovative, patented Spatial advantEdge™ technology provides higher output power, greater reliability and lower energy usage in more compact packages than traditional amplifier solutions. Wavestream's proven family of products meet the growing demand for greater efficiency and significant lifecycle cost reductions for satellite communications systems worldwide. Wavestream is a wholly-owned subsidiary of Gilat Satellite Networks Ltd. ( NASDAQ:GILT ). For more information, please visit the company's web site at www.wavestream.com . \n\nAbout Gilat \n\nGilat Satellite Networks Ltd ( NASDAQ:GILT ) (TASE:GILT) is a leading provider of products and services for satellite-based broadband communications. Gilat develops and markets a wide range of high-performance satellite ground segment equipment and VSATs, with an increasing focus on the consumer and Ka-band market. In addition, Gilat enables mobile SOTM (Satellite-on-the-Move) solutions providing low-profile antennas, next generation solid-state power amplifiers and modems. Gilat also provides managed network and satellite-based services for rural telephony and Internet access via its subsidiaries in Peru and Colombia. \n\nWith over 25 years of experience, and over a million products shipped to more than 90 countries, Gilat has provided enterprises, service providers and operators with efficient and reliable satellite-based connectivity solutions, including cellular backhaul, banking, retail, e-government and rural communication networks. Gilat also enables leading defense, public security and news organizations to implement advanced, on-the-move tactical communications on board their land, air and sea fleets using Gilat's high-performance SOTM solutions. Gilat controlling shareholders are the FIMI Private Equity Funds. For more information, please visit us at  www.gilat.com \n\nCertain statements made herein that are not historical are forward-looking within the meaning of the Private Securities Litigation Reform Act of 1995. The words \"estimate\", \"project\", \"intend\", \"expect\", \"believe\" and similar expressions are intended to identify forward-looking statements. These forward-looking statements involve known and unknown risks and uncertainties. Many factors could cause the actual results, performance or achievements of Gilat to be materially different from any future results, performance or achievements that may be expressed or implied by such forward-looking statements, including, among others, changes in general economic and business conditions, inability to maintain market acceptance to Gilat's products, inability to timely develop and introduce new technologies, products and applications, rapid changes in the market for Gilat's products, loss of market share and pressure on prices resulting from competition, introduction of competing products by other companies, inability to manage growth and expansion, loss of key OEM partners, inability to attract and retain qualified personnel, inability to protect the Company's proprietary technology and risks associated with Gilat's international operations and its location in Israel. For additional information regarding these and other risks and uncertainties associated with Gilat's business, reference is made to Gilat's reports filed from time to time with the Securities and Exchange Commission. \nCONTACT: Gilat Satellite Networks\n         Joelle Inowlocki JoelleI@gilat.com KCSA Strategic Communications\n         Phil Carlson, Vice President\n         (212) 896-1233 pcarlson@kcsa.com", "source": "Fat Pitch Financials"}