{"published": "2015-09-23T16:55:16Z", "media-type": "News", "title": "Importers of Building Materials Want Review of Lagos Policy On Truck Movement", "id": "83ae8619-fb4f-4e46-b6c6-1130a94ba8c1", "content": "Importers of building materials in the country have called for a review of Lagos State policy on movement of trucks, which led to a 10-day strike by truck owners, because it has increased their operational cost and that the cost will eventually be transferred to consumers, reports Bennett Oghifo There is keen competition among importers of building materials such that any unusual rise in price could tip the cost of their goods to the extent that they would be unable to compete in the market. After the 10-day strike by truck owners/drivers was called off at the weekend, some importers stated that as much as the policy on truck movement was legitimate, the government did not inform them of the impending action or institute a plan to ensure that it worked fluidly. They said if the government had informed them, then they would have made alternative plans or even adjusted their import schedule as well as reworked the booking of trucks. \n\nThe government, they said should have made arrangements for waiting areas for trucks that come from all over the country. For instance, they complained that there is no holding bay for these trucks, adding that a system of getting in and out of the Ports ought to have been devised prior to the enforcement of the policy to ensure smooth movement and to save them needless costs they have incurred on account of the sudden change in movement. \n\n\"None of these was done, and suddenly the government shutdown movement during the day time, throwing all of us off balance. As for me I have eight 40-foot containers ready to leave the Port before the change in truck movement; other importers have less or more containers. They are still at the Port. As things stand, I am incurring demurrage on my goods; I pay rent to the Port Operators; and pay stand-down time penalty fee to the truck owners that I already contracted,\" said an importer and vendor of building materials on Lekki-Epe expressway. \n\nNow that the 10-day strike has been called off, he said there would be congestion at the Ports from everybody trying to remove their goods, considering the holiday that comes up this week. \n\nAnother big importer in the VGC area said the government should always avoid situations that would make legitimate businesspeople feel targeted to fail. \"They know us and ought to call a meeting or inform us in whatever ways they can to prepare us for this situation. The essence of governance is for the wellbeing of the citizenry. In this case, it wasn't that we were breaking the law by carrying our goods during the day or that we were and after being warned to desist we refused; neither happened; they just shutdown movement; trucks already primed to leave the Ports or enter the Ports couldn't leave or enter. \n\nCBN currency policy... Importers, he said are also having difficult time sourcing foreign currencies and getting the Central Bank of Nigeria to sign some of their papers to enable them import goods. \"The CBN no longer signs Form M and they don't sell foreign exchange to us for some goods and when we source for funds elsewhere, they ask us to explain where we got the money and after that they still take a long time to sign our papers.\" \n\nFilling of Form 'M' is mandatory for all importers of physical goods into the country. The Customs Department in its regulations said \"Any person intending to import physical goods into Nigeria shall in the first instance process Form \"M\" through any Authorized dealer bank irrespective of the value and whether or not payment is involved; The initial validity period of an approved e-Form \"M\" for general merchandise shall be 180 days, which may be extended for 180 days by the Authorized Dealer. For capital goods, the initial validity of an approved e-Form \"M\" shall be 365 days subject to a maximum extension of another 365days. However, any subsequent request for subsequent revalidation of e-Form \"M\" shall be forwarded to the Director Trade and Exchange Department, Central Bank of Nigeria, for consideration. Supporting documents shall be clearly marked \"Valid for Forex/Not Valid for Forex\" as appropriate i.e. depending on whether or not foreign exchange remittance would be involved.\" \n\nThe regulation also specifies that \"The e-Form 'M' and the relevant pro-forma invoice (which shall have a validity period of three months) shall carry a proper description of the goods to be imported to facilitate price verification viz; Generic product name, i.e. product type, category; Mark or brand name of the product where applicable; Model name and or model or reference number, where applicable; Description of the quality, grade, specification, capacity, size, performance etc.; Quantity and packaging and/or packing; e-Form 'M' shall be valid for importation only after acceptance by the relevant Scanning /Risk Management Provider. Consequently, Authorized Dealers are to confirm acceptance of the Form M before proceeding with other import processes.\" \n\nIt also states that \"Documents in respect of each import transaction shall carry the name of the product, country of origin, specifications, date of manufacture, batch or lot number, Standards to which the goods have been produced (e.g. NIS, British Standards - PD. ISO, IES, DIN, etc).\" \n\nAny wrong or fraudulent misrepresentation of facts will result in delays and/or impoundment/seizures, the guidelines said. \n\n\"Importation of Blank products and/or without valid e-Form 'M' shall automatically qualify for seizure and destruction without warning, and subject to prosecution, the government said. \n\nUnder-declaration... Recently, the Federal Government listed the goods that can be imported and with specific duties but this policy is being circumvented by some importers with the help of some crooked Customs officers, he said. \"Some people are conniving with Customs officials to falsify their entries to lower their duties. \"They falsify their entries to read that they imported goods that carry lower duties rather than the ones they actually imported that should carry higher duties; they do this with all products with similar class like tiles.\" \n\nUntil recently, there was a vibrant tiles manufacturing industry in the country. These local tiles were made to specification with consideration for the nation's weather condition but because of unfavourable policies of government these factories turned off their fires one after another, laying-off their workers and reducing the ability of these families to adequately fend for themselves. \n\nNigeria, according to statistics is currently the 13th among the world consumers of ceramic products, mostly ceramics sanitary wares, ceramics spark plugs, ceramics porcelain, ceramics floor and wall tiles. \n\nAccording to Eguakhide Patrick Oaikhinan, a professor of material engineering, with specialisation in ceramics, \"In spite of the available indigenous potential for ceramics manufacturing business, the Nigerian government and the citizens have not shown much interest in its development. \n\n\"The negligence is due to lack of clear understanding of the meaning of ceramics; lack of significant number of professionals with appropriate skills and expertise in ceramics manufacturing business, and absence of avenues for people interested in ceramics manufacturing business to pursue their ambitions. \"Now, no university or higher institution in Nigeria offers training in ceramics science/engineering/technology. Thus, skill gap is a major problem. So, you cut imports by developing the sector locally addressing problems enumerated here.\" \n\nHe said the few surviving ceramics manufacturing companies in the country are producing far below their installed capacity because of problems related to processing of their feed raw materials. \n\nHe explained that in developed countries, there are industries that are processing raw materials (.i.e. clays, feldspars, quartz/silica, etc, for the ceramics manufacturing businesses. He said, \"Our local ceramics manufacturing businesses are struggling to process their own raw materials. This they do without knowledge of the chemical and mineralogical compositions, physical and mechanical properties of these raw materials. The absence of these data has led to low qualities of their ceramic products.\"", "source": "Individual.com"}