{"published": "2015-09-18T19:16:39Z", "media-type": "Blog", "title": "Lost In The Noise Of Budget Standoff, Funding For Volunteer Work Faces Huge Cuts", "id": "56af5cd5-f40b-4cc9-a593-ecc60a4e5759", "content": "With conservative assaults on Planned Parenthood funding threatening to cause another government shutdown in the coming months, it’s easy to lose track of less flashy programs that are set to be slashed even if lawmakers compromise to avoid another lights-out moment in federal offices. \n \nOne program that stands to lose ground is the nation’s primary official means of fostering volunteer work with public resources. The Corporation for National and Community Service, which funds AmeriCorps programs and volunteers among other service work, is facing drastic cuts in both the House ( 34 percent ) and Senate ( 20 percent ) budget packages. \n \nSuch cuts would yank vital support from beneath some of the country’s most vulnerable people, Ashley Bembry-Kaintuck told a crowd Wednesday at the Center for American Progress. She recounted her experience with a fifth-grader named Renija in a Washington, D.C. elementary school, during her time volunteering with City Year. \n \n“She was such a smart little girl but had a lot of behavior problems” that disrupted the whole class. Through close personal attention and open communication about the child’s frustrations, Bembry-Kaintuck said, “we built trust one day at a time. After a few months with Renija, I saw her behavior change dramatically. If she had a problem she would come to me and explain why she was upset.” Eventually all it took was a glance between the two of them, and Renija would refocus on her work instead of blowing up. Her grades improved along with her behavior. \n \nIt’s a radically different outcome than is often the case for troubled young people of color in primary and secondary schools in America, where administrators are so quick to discipline that experts have described a “ school-to-prison pipeline ” developing in American public education. The possibility of drastic reductions to the already-meager stipends that make experiences like Renija’s possible frighten Bembry-Kaintuck. “They mean less AmeriCorps members in our schools and communities, less support for fifth graders like Renija, less high school students who are college and career ready,” she said. \n \nThe program has already been savaged by cuts in recent years, losing about a seventh of its funding from 2010 to 2013 before the 2014 deal restored less than half of what’d been cut during the height of Tea Party budget fervor. Cutting CNCS is especially obtuse given both the size of the program – barely a billion dollars out of a budget measured in trillions – and the way community service programs return benefits to both the served and the servant. \n \n“It means less young people that have the opportunity to serve and find their career path like I did,” Bembry-Kaintuck, who now uses many of the personal skills she developed in City Year in her video production career, said of the possible cuts. \n \nThat positive feedback loop in service work means that programs like City Year have what business-oriented folks like to call a “double bottom-line.” One such person is Jonathan Levine, a Bain Capital veteran who’s passionate about the value of the work CNCS funds – and frustrated at how hard it already is to provide the support these programs need. \n \n“It is actually harder in the United States of America to get a slot in AmeriCorps and do national service than it is to get into many if not most competitive colleges in this country,” Levine said Wednesday at CAP, on whose board of directors he serves. “We do not have a problem of apathy in this country. We have a problem of access.” \n \nCity Year’s slogan is simple: “Give a year, change the world.” But few people can afford to just give away a year of their life to a cause, no matter how deeply they believe in it. The cuts currently pending in Congress “would significantly reduce the number of positions AmeriCorps could fund and threaten the modest educational stipend that AmeriCorps workers receive after completing a year of public service work,” the Center on Budget and Policy Priorities notes. \n \nService program funding has been a pawn in budget games before, as House Republicans have proposed to eliminate it entirely in recent years and the program survived a last-minute budget deal in 2014. All this comes despite broad bipartisan support for the concept of the CNCS, Levine said, pointing out that politicians from both parties showed up when the cameras were rolling for the signing of legislation to create the public corporation. \n \nThat reversal is evidence of more than just the standard elected official’s hypocrisy between public words and legislative acts, former AmeriCorps director John Gompertz said Wednesday. It’s an act of self-sabotage for a country where half of all public schoolchildren now live in poverty, and where non-profit service work of many other kinds is caught between high community demand and low resources to meet it. \n \n“The stories Ashley told, that’s exactly what needs to happen for tons and tons of kids,” Gompertz said, because many of them “have not only a money poverty but a relationship poverty. It’s not the absence of love, but the absence of people around them who can help navigate toward a brighter future.” \n  Tags   AmeriCorps Budget Budget Cuts K-12 Education public service    \nThe post Lost In The Noise Of Budget Standoff, Funding For Volunteer Work Faces Huge Cuts appeared first on ThinkProgress .", "source": "ThinkProgress"}