{"published": "2015-09-15T20:29:37Z", "media-type": "Blog", "title": "Why We Feel How We Feel About Clutch", "id": "e4f330b7-b0e1-4dcf-badb-bb45a3df21dd", "content": "Apologies for walking on trodden ground. None of what’s below is new. Many of you already know everything in here, but I feel like this is a good opportunity to review why our position is our position. I’ll do my best to keep this simple and short. Just like all the world’s best analysis! \n \nOver the last little while, I’ve written a few things about Clutch . The specific stat might be difficult to explain to the average fan, but the idea is a basic one. Teams with high Clutch scores have had really good timing. Teams with low Clutch scores have had really bad timing. Timing is important! This explains a lot of the difference we see between actual wins and BaseRuns wins, which you can just think of as “expected wins.” This year, the five most clutch teams in baseball so far have beaten their BaseRuns win total by a combined 45. The five least clutch teams in baseball so far have fallen short of their BaseRuns win total by a combined 43. It’s hugely important, and this isn’t a one-year phenomenon. \n \n\n \nI have BaseRuns information going back to 2002, so let’s plot team Clutch score and the difference between actual wins and expected wins. This’ll cover the completed seasons, between 2002 – 2014. \n \n\n \nIt’s clearly a strong relationship. Clutch doesn’t explain everything , but it explains an awful lot, and that’s just intuitive. Of course the teams that do the best at the right times will be more successful. If they do better than they usually do at the right times, they’ll look like an over-achiever. That’s how you can get a team to win more games than you’d think just based on the overall statistics. \n \nClutch can turn a mediocre team into a playoff team. Clutch can also turn a would-be playoff team into a mediocre team. Because it’s so important, it stands to reason teams would try to emphasize clutch performance, if they could. They’d try to gather clutch performers. There’s not a single analyst in the world who doubts the significance of clutch events. But that isn’t the problem. Let me show you some more information. We’ve got team batting Clutch, team starter Clutch, and team reliever Clutch. I decided to look at the window from between 2000 – 2014, splitting seasons by first and second halves. Here’s how batting Clutch has carried over, half to half: \n \n\n \nAn r-squared of literally 0.00. You can find numbers that aren’t 0 if you go to more decimals, but that doesn’t accomplish anything. It’s a nothing relationship. Here’s how starter Clutch has carried over, half to half: \n \n\n \nAn r-squared of literally 0.00. You get the point already, but let’s move on to reliever Clutch: \n \n\n \nAn r-squared of literally 0.00. So this won’t surprise you — putting it all together for team Clutch: \n \n\n \nAn r-squared of literally 0.00. No observed relationship. No observed hint of a relationship. The only relationship here is the one between Clutch and total randomness, and that’s not a relationship for anyone to rely upon. It would be one thing if there were no relationship between Clutch in Year 1 and Year 2 (and there isn’t). But this is looking at the same teams, within seasons. Even clutch teams are only temporarily clutch. Sometimes they remain clutch, but no less often do they do the opposite. \n \nThis is why I’m more down on, say, the Twins than other people might be. Not that it matters at this point, with the season almost over, but there’s trusting the Twins’ record, and there’s trusting the Twins’ other, underlying numbers. The underlying numbers have proven more trustworthy. If you want to argue a certain team is innately clutch or unclutch, that’s fine. Make the argument. You might very well be right. Just, understand what the argument is up against. Understand how hard it’ll be to convince someone of legitimate clutchness. The argument against this stuff is strong, and it’s tough to doubt a 0.00 r-squared. Factors you might think lend themselves to better or worse performance in clutch situations — there’s nothing convincing in the recent history. And teams would have a lot to gain from harnessing this. \n \nThe position is one against clutchness, because that’s what all the evidence points to. It’s not coming out of stubbornness. It’s not coming out of closed-mindedness. It’s just that nothing else has been sufficiently convincing. And, this is important — analysts would probably love to be wrong! It would be amazing if real clutchness could be proven. That would be a breakthrough, and if you’re just some person doing research, good research could get you hired by a club. It would be greatly significant if one could demonstrate reasons for under- or over-achieving, ahead of time. I think we’d all love to read that article. It would change the way we see the game. \n \nThat just isn’t where we are today. Today, it looks like near or total randomness. So it gets treated as such, and though the actual wins matter more than the expected wins do, as far as the World Series is concerned, one should understand why sometimes analysts think the expected wins are more meaningful, analytically. We’re always trying to drown out the noise.", "source": "FanGraphs Baseball"}