{"published": "2015-09-01T05:53:00Z", "media-type": "Blog", "title": "Industry: Austal Delivers Eighth Cape Class Patrol Boat", "id": "4cf87ce2-e1ff-4447-a898-a54244510e4c", "content": "A Cape class Patrol Boat (Image: Austal) Austal Limited (Austal) (ASX:ASB) is pleased to announce it has delivered Cape York the final of eight Cape Class Patrol Boats supplied to Australian Border Force (formerly Australian Customs and Border Protection) under a $330 million design, build and in-service support contract. Austal Chief Executive Officer Andrew Bellamy said that with eight boats successfully delivered within the original timeframe, Austal has demonstrated its credentials as a partner of choice for government defence vessel programs and a world leader in patrol boat design, build and sustainment. “The on-time and on-budget delivery of all eight Cape Class Patrol Boats is a credit to our highly skilled team at the Henderson shipyard, which has achieved valuable production efficiencies as the program progressed; clearly demonstrating the benefits of continuous shipbuilding and reinforcing Austal’s capability to successfully design, build and sustain multiple naval and border protection vessel programs.” “Austal has delivered one Cape Class Patrol vessel approximately every 10 weeks over 2014-2015; which has significantly increased Australian Border Force’s capability to reliably deliver on the Border Protection obligations it undertakes for the Commonwealth of Australia, ” Mr Bellamy said. “Our national sustainment team, services and facilities continues to grow in line with the Cape Class Patrol Boats coming into service; ensuring the operational availability of the Australian Border Force fleet around the country.” As the sole provider of the Commonwealth’s border patrol capability for the past 17 years and as a successful exporter, Austal has now delivered a total of 72 patrol boats. The company has recently submitted a tender for the Pacific Patrol Boat Replacement Program, comprising 21 vessels for delivery to Pacific Island nations from 2017.  Austal", "source": "Pacific Sentinel"}