{"published": "2015-09-22T12:57:00Z", "media-type": "News", "title": "Audi Introduces Its Latest Vehicle -- and It's Electric", "id": "78a14d17-73de-4f6d-bf40-15c1a901e47f", "content": "NEW YORK (TheStreet) -- Sales of electric cars have been gaining momentum, fueled by greater demand for more energy-efficient, greener products. The Audi all-electric, crossover SUV will arrive in dealerships in 2018. It will have an impressive 300-mile range . Most electric cars today offer a third that range, although ranges are going to increase as battery technology improves. \n Audi  recently showed the concept car for its crossover. \n \nThe Audi all-electric car will be in U.S. dealerships in early 2018. Audi recently showed the concept car. The Audi electric car has the size and appearance of a conventional crossover SUV . Crossover SUVs bear some similarities with both SUVs and rugged station wagons. The Audi crossover has been compared to the Tesla  Model X. \n \nBut unlike the Tesla Model X, which is a 3-row vehicle, the Audi is a strict 2-row one. It's also not nearly as tall. Therefore, there's less interior space. \n \nIt's like comparing a Range Rover Sport to a Chevrolet Suburban , while realizing that the analogy is far from perfect. One car is bigger and taller than the other. The Audi is closer to a Subaru Outback in appearance. \n \nAudi's said that the car's greenhouse and shoulders pointed inwards so that the car doesn't look top-heavy. It's a visual trick meant to instill confidence in handling, so that a buyer isn't afraid the car is going to tip over in extreme cornering. \n \nFurthermore, the front of the car is not as long as you will find in some luxury vehicles. The car is not meant to look like it's resting on its rear axle. It's more of a balanced 4x4 \"Quattro\" look, hearkening to the original Audi Quattro from the early 1980s. \n \nThe 2018 production car's interior is likely to see significant changes from the concept car. For starters, it will fit three people in the rear seat, instead of two. \n \nThe instrument panel and controls, as is typical of concept cars, will be a lot less futuristic. It will still have lots of displays and touch screens, but will likely be augmented by more knobs and dials. People tend to prefer traditional knobs and dials for temperature controls and radio functions such as volume and tuning. \n \nThe battery is positioned in the floor, just like any BMW i3 or Tesla Model S . It makes use of 95 kWh worth of LG prismatic battery cells. Audi has the option of offering a model with lower capacity at a lower price, if it thinks that would stoke demand. There is no downside in offering such a lower-priced version. \n \nUnlike Tesla, the Audi has two motors in the back of the vehicle. Why? Audi says that yields two benefits: No need for a differential and enhanced ability in extreme torque vectoring, the ability to vary power to each wheel. \n \nThe latter point will show in superior handling in turns. Audi felt so strongly about the handling characteristics of this solution, that it was willing to employ two motors instead of one, for the rear wheels. \n \nAudi said a U.S. product management team drove the design of the car. Originally, the first volume (i.e., not the R8-series) all-electric Audi was going to be a small hatchback, no larger than a Nissan LEAF, and possibly even smaller. That was a Euro-centric view. Tiny, narrow streets, lots of luxury taxes, expensive gasoline and diesel -- a small eco-car was the answer. \n    next   last »", "source": "Shoreline Times"}