{"published": "2015-09-06T17:21:56Z", "media-type": "Blog", "title": "Slim Down Sunday: Week 17", "id": "3f8e15c7-79ed-48d7-99dd-b2a64bfa4a23", "content": "After a huge 4lb loss last week, I feel like I've spent this week on a high.  As I have lost so much, particularly in this past four weeks I've lost a total of 12lb that I did tell myself that as long as I lost something this week I would be happy but as I was only a single pound off the next stone bracket, I was secretly hoping to smash that. I thought I'd change things up a little this week for my post and talk about the changes I've noticed.  Some of them are pretty embarrassing but not quite as embarrassing as having a huge stomach, a big round moon face and being out of breath with the slightest amount of exercise.  I'm going to try and jog my memory so here goes... All of a sudden I can cross my legs again, I'm not really a \"cross my legs\" kinda gal but previously the tops of my thighs had been stopping me from getting the other one up and over.  See?  I told you they were embarrassing but it's the truth!   I no longer analyse a chair to see if it will take my weight.  This is something I have done for so many years that I barely notice I did it but I don't bother now as I know I'm smaller, I also don't need to consider the width of a chair either.   My ear lobes don't stick out.  This is another odd but mortifying one.  It had been brought to my attention that effectively I had ear lobes that stuck out and I just figured it was how I am.  Now I have lost so much weight they just hang like normal people's lobes because the fat in my cheeks don't push them out anyway.  I actually can't believe I'm writing this but... This is my weight loss diary effectively and this is my truth. I don't have to struggle to take a good selfie.  Now this isn't a vain one like it sounds but previously I would have to take the photo at a really high up angle to try and flatter my huge moon face.  Now I don't, if I do it lower down my face still looks slim but I have a little extra chin at the moment which I'm fine with for now! I walk with my head up.  I should have always walked with my head up but now I do and no longer staring at the floor.  I actually feel taller as a part of that.   I can look at myself in the mirror.  I have grown so used to purposely not looking at reflections below my neck line because what I don't see won't upset me but then if I had I may not have gotten into the state I got in.  It was only yesterday that I realised I can look into a full length mirror.  I don't have one of these in my home however I do in my home salon for hairdressing and I was almost shocked at the results that I saw.   Clothes are literally falling off me.  It's sort of sad to see that some of my favourite clothes are too big now, it's okay as they represent an old me but it's a shame too.   I'm also finding things that I have that were snug or didn't really even fit are fitting me which is fantastic.   The distance I can walk now is incredible.  When I say I was unfit, I'm talking really severely out of shape.  I could probably manage a ten minute stroll and then my back and legs would seize up.  Now I've built myself up to do anything up to an hour and a half on my treadmill or evening walk and I know I could do longer without struggling at all or even being the slightest bit puffed.  The energy I have is unreal, it really is. I can see collarbones!  Only ever so slightly when I'm just stood straight.  It's nice to see a bit of definition and I'm sure more to come.  I can catch a glimpse of them sometimes and it shocks me as I haven't seen them in so long. This is actually my version of Nandos..!   So let's get into the weigh in as this week was a big one.  Last week I was one pound away from the next stone bracket down.  This stone bracket was particularly significant as I'm now getting into a more regular persons weight.  It's still heavy for my height but it's like I'm joining the world again with close to a more average size.  I shall always tell the truth, I did a sneaky weigh in on Thursday and I had lost the weight I needed to be in the stone bracket below, I was completely ecstatic.  For the next hour I actually just sat on my sofa in shock, and then the tears started as I sobbed at what I've achieved in just over four months.    Fast forward to today for the actual weigh in and I just cant believe it, I've lost another 4lbs in total!  It's actually 4lbs and a quarter but I'll count that off next weeks amount.  I absolutely didn't expect to have two weeks running with such a big loss which was just the icing on the low calorie cake(!)  This four 4lb loss brings me to a total of 3 stone 8lbs lost (50lbs!)  At this point I have dropped around 3 or 4 dress sizes, it's hard to tell with different brands and styles but I can definitely fit some clothes that are four sizes smaller.  I am also officially half way to wear I am going to be, that's such an exciting milestone to me.  My clients comment virtually every time they see me, they say I look so small at my nail desk.  My side profile is pretty decent now as well, wider than I want to be but that's okay.  Next week I definitely don't expect a big loss but I'm excited to get going with it!  If you want to lose weight, read this and believe you can do it like I am doing.﻿ Every day we have a choice, it's a fresh start and the most important part from any healthy eating plan is to just try and make as many days, good ones. Losing a pound a week is still over three and a half stone in a year! If you're feeling particularly down about your weight, remember that if you stick to a balanced diet then by this time next week you could have dropped quite a few pounds, just the kick start you need to get going!  Even just by cutting down on treats you could make a difference, how good would that feel?! Why not come and be my friend on the My Fitness Pal app - search for 'liverpoollashes' If you have a FitBit then why not be my friend on that and send me a challenge? click here.   If you want to read my previous Slim Down Sunday posts - click here. If you want to read my explanation of Slimming World - click here. If you want to read my explanation of calorie counting and basic weight loss methods - click here.", "source": "LiverpoolLashes Beauty Blog"}