{"published": "2015-09-17T15:43:37Z", "media-type": "Blog", "title": "Pondering the questions about college football’s upcoming games", "id": "d7dea130-d3f6-4cb0-9fa9-0e72a2b574fc", "content": "Ten questions for the upcoming college weekend: \n \nCan Florida slow down Kentucky’s passing game? \n \nAt this point, who knows? The Gators certainly didn’t slow down East Carolina’s, did they? The Pirates were driving toward a tying touchdown when quarterback Shane Carden simply dropped the ball. Still, Carden threw 66 times and amassed 467 yards in the loss. \n \nNow comes Kentucky quarterback Patrick Towles , who lit up Florida last year with 369 yards passing and three touchdowns. Wide receiver Garrett Johnson gained 153 of the yards. \n \nMuch of the Gators’ strength is cornerback Vernon Hargreaves , who missed last week’s game. But look for Kentucky coach Mark Stoops to throw early and often. \n \nFlorida threw the ball well last season, too. DeMarcus Robinson caught 216 yards worth of passes. \n \nCan Everett Golson please start quicker? \n \nIn two first halves, Golson hasn’t been what FSU needs him to be. In fact, he completed only one pass against USF. But Golson has been very good in his second halves. \n \nHe’ll have to be against Boston College, which has seven starters back from a year ago. Oh, you can’t tell much about the Eagles from their first two wins, but Boston College has played FSU close for the past two years. Golson needs to be sharp early. \n \nIs Dalvin Cook the best player in America? \n \nAfter two games, Cook has an argument. He missed most of camp, but he’s rolled for 422 yards in two games. Boston College, with a better from four than the Seminoles have faced, will be more of a challenge. \n \nRunning backs are at a disadvantage to quarterbacks when it comes to winning the Heisman, but already, Cook is drawing comparisons to former FSU great Warrick Dunn . \n \nWill Jim Elwain be a pussycat? \n \nMcElwain says he regrets his sideline tirade against running back Kelvin Taylor , but if the Kentucky game gets testy, might we see another outburst? Guys with tempers have a hard time backing off, and the inconsistent play of quarterbacks Will Grier and Treon Harris is sure to test a guy’s blood pressure. \n \nFor the Gators, who now play eight straight SEC opponents, this one is vital. \n \nDoes USF have the athletes to hang with Maryland? \n \nThe Bulls played solid first half in their loss to FSU. Caleb Rowe returns to lead the Terps (1-1), who should go to the air often. USF hopes to ride running back Milton Mack its chances of an upset over Maryland, which had a decent debut season in the Big 10. USF has had a problem offensively under Willie Taggart , however, failing to gain 300 yards in 17 of 26 games. \n \nWas Miami really just looking ahead last week? \n \nThere for a while, the Hurricanes f ound themselves in a game against FAU, and their vaunted defense wasn’t played as well as expected. Players said it was hard to concentrate on the Owls when Nebraska – an opponent in two national championship games – was on the horizon. This time, running back Terrell Newby leads the Cornhuskers. \n \nWill FAU quarterback Jaquez Johnson be able to play? \n \nJohnson, a three-year starter, injured his ankle early in the game against Florida. Backup quarterback Jason Driskel played well, but Buffalo is a testier opponent than you might think. Johnson is crucial to FAU’s ability to move the ball. \n \nWill FSU cornerback Jalen Ramsey ever give up a completion? \n \nOpponents don’t throw much toward Ramsey, but he has four pass breakups this year. That’s tied for the sixth-most nationally. \n \nIs Miami quarterback Brad Kaaya ready for Nebraska? \n \nHurricane quarterbacks have played well against the Cornhuskers when it mattered. In the 31-30 upset in the 1984 Orange Bowl, Bernie Kosar threw for 300 yards. In the 2002 Rose Bowl, Ken Dorsey threw for 362 and seven scores. Even in the 1995 Orange Bowl, in which Nebraska held off the ‘Canes for a national title, Frank Costa threw for 248. \n \nNow comes Kaaya, who has had the look of the next great Miami quarterback. We’ll see. BYU had some success thorugh the air against Nebraska. \n \nDoes UCF need an opponent such as Furman, or what? \n \nThe Knights are 0-2, the running game has yet to emerge, and they’ve lost their quarterback Justin Holman is injured. Why, it’s a perfect time for Knights – winners of 31 games the last seasons – to get it rolling. Freshman quarterback Bo Schneider was one of five true freshmen to play last week. \n \nUCF also started 0-2 last year and responded with a nice season. \n \nThe post Pondering the questions about college football’s upcoming games appeared first on SaintPetersBlog .", "source": "SaintPetersBlog"}