{"published": "2015-09-08T13:49:41Z", "media-type": "Blog", "title": "Wildfire smoke becomes the health threat that won’t go away – ‘This may be the new normal for us. Not just for a day or two, but for weeks on end.’", "id": "8369121c-7710-4518-87a7-b6bf77c31255", "content": "Wildfire smoke becomes the health threat that won’t go away – ‘This may be the new normal for us. Not just for a day or two, but for weeks on end.’ Posted by Jim at Tuesday, September 08, 2015 By Nancy Shute\n25 August 2015 (NPR) – I stepped out my parents' front door last Thursday, expecting a typically glorious summer day in southern Oregon. Instead, I was hit with acrid wood smoke that stung my eyes and throat. The air was thick with haze that obscured the mountains. I quickly retreated inside. Health departments across the West are mobilizing to protect residents from smoke generated by dozens of fires that have sent smoke as far east as the Midwest. \"It's really bad,\" says Janice Nolan, assistant vice president for national policy at the American Lung Association. \"I hadn't seen 'code maroon' days, which is the most hazardous air quality, in years.\" Lewiston, Idaho, is stewing under \"very unhealthy\" smoke, with older people, people with heart and lung disease and children urged to \"avoid all physical activity outdoors.\" And it's hardly the only city affected. Last weekend, Portland, Ore., which typically enjoys crystalline summer skies, was swathed in unhealthy levels of smoke that resembled wintry fog. It had drifted in from fires in Washington state. \"Unfortunately, this may be the new normal for us,\" says Jim Vannoy, program manager for environmental health programs at the Idaho Division of Public Health. \"Not just for a day or two, but for weeks on end.\" An extended drought and climate change mean more fires that burn longer, Vannoy says. The public health department is trying to get the word out through the state's smoke blog and social media, so people can learn how to protect themselves. For schools, that means indoor recess and no outdoor sports practice when air quality levels are unhealthy, according to an advisory the public health department sent to Idaho schools. Tiny particulates in smoke travel deep into the lungs, where they evade the body's defense systems, Nolen says. That poses an especially big threat to people with asthma, cardiovascular disease or lung diseases. Children are susceptible even if they're healthy, she says, because their lungs are still developing. [more] Wildfire Smoke Becomes The Health Threat That Won't Go Away Technorati Tags: wildfire,forest fire,pollution,North America,global warming,climate change,epidemic     Labels: climate change, epidemic, forest fire, global warming, Graph of the Day, North America, pollution, wildfire 0 comments: Post a Comment Older Post Home Subscribe to: Post Comments (Atom)", "source": "Desdemona Despair"}