{"published": "2015-09-30T05:45:37Z", "media-type": "Blog", "title": "How the Independend Parking Committee conned the DVLA into giving them ATA status", "id": "3e8cc482-7160-452a-a3dd-2e2d0d753a79", "content": "When the IPC originally formed their Code of Practice was quite progressive. The Prankster compared them favourably to to BPA in this blog. No doubt this conrtibuted to the DVLA awarding them provisional ATA status.\nSince then the BPA have made large steps to become fairer to the motorist. The IPC on the other hand, did a Jekyll and Hyde as soon as they were awarded full ATA status by the DVLA. Since then their appeals service has become a joke, serving up institutionally biased results with poor understanding of parking-related and consumer law. Operators are allowed to submit false evidence and the IPC turn a blind eye.\nCode of Practice\nThe IPC's true colours have emerged with the release of the latest version of their code of practice. It is worth comparing point by point with the previous version to show what happens when a rogue ATA is allowed to change its code without input or control from government.\nInitial Audit\n4.1 Initial compliance upon application for IPC membership is assessed by way of an Initial Audit\nwhich, will be followed by a period of ‘probationary membership’ for 6 months this is\ndetailed further in Schedule 4.\n4.1 Upon application for IPC Membership, compliance will be assessed by way of an Initial\nAudit during a period of ‘probationary membership’ for the first 6 months. This is\ndetailed further in Schedule 4.\nThe audit no longer takes place before the member joins, but up to six months afterwards. This means the member has up to six months to operate without audited signage contracts and correspondence templates. At least two court cases taken out by IPC members have failed because the operator could not show a valid contract with the landowner was in place.\nInvestigation of Complaints\n4.4 The IPC will investigate and record any complaints against members in order to ensure\ncompliance.\n4.4 The IPC may investigate and record any complaints against members in order to ensure\ncompliance.\nComplaints are not now always investigated. The Prankster has informed the IPC of several of their operators who breach the code of conduct. The IPC has refused to investigate. This can be contrasted with the behaviour our the BPA. When The Prankster informed them that UK PC were forging timestamps the BPA were reluctant to believe their members could do such a thing, but still investigated anyway. The IPC, according to their actions, are happy for their members to get away with whatever dodgy practice they like.\nANPR accuracy\n3.3 ANPR equipment must be maintained and calibrated appropriately to ensure accuracy so as\nto ensure that keeper data is not applied for without proper grounds for doing so. Where\nthere are manufacturer’s guidelines for the maintenance of equipment then this should be\nfollowed.\nThe requirement to have accurate ANPR has been removed.\nSub Contractors\n4.3 If you use sub-contractors or self-ticketing operators then you must ensure that they are\nfamiliar with this code and obtain signed confirmation by them to this effect. You must\nensure that such confirmation is made available to the IPC during any audit or upon request.\nThe requirement for sub contractors to be familiar with the code has been removed.\nData Protection\n5.2 Where required to do so you must provide the IPC with any such records in order that we\nmay monitor compliance with the Code and any applicable laws.\n5.3 Failure to provide any such document(s) within 14 days will be treated as an issue of noncompliance under the Sanctions scheme.\nThe requirement to allow data protection compliance to be checked has been removed.\nInternal Appeals\n6.1.d) Allow recipients of a parking charge notice the ability to make representations to you\nregarding the issue of the charge.\n6.1.d) Allow recipients of a parking charge the ability to make representations to\nyou regarding the issue of the charge.\nIt is believed this change is so that operators do not have to allow keepers the right to appeal. This is analysed later.\nChanges in terms and conditions\n9.1 Where there is any change in the terms and conditions that materially affects the motorist\nthen you should make these clear on your signage. Where such changes impose liability\nwhere none previously existed then you should consider a grace period to allow regular\nvisitors to the site to adjust and familiarise themselves with the changes. It is suggested that\na grace period of one month is appropriate and that during this period you should identify\nvehicles that would have incurred charges under the new system where they wouldn’t have\npreviously and inform the driver by notice affixed to the vehicle that in future they will incur\na charge. Vehicles that return having previously had notice of these charges can then be\nticketed in the normal way at your discretion. More guidance on signage is found in\nSchedule 1.\nThis protection has been removed.\nWarning and court letters\n15. Final Warning Letters\n15.1 Where the charge remains unpaid and no appeal is lodged you may send a final\nwarning letter.\n15.2 You must make it clear in the final warning what you will do next if payment is not\nreceived and how payment can be made.\n15.3 A final warning letter should not be sent until 14 days have passed since the\nnotification letter.\n16. Court Action or Charge Recovery\n16.1 When a final warning has been sent you must wait a further 14 days before you take\nfurther action such as debt recovery or court action.\nThis requirement has been removed\nGrace Periods\n17.1 Drivers should be allowed a sufficient amount of time in order to park and read any\nsigns in order that they may make an informed decision as to whether or not to remain on\nthe site before any enforcement action is taken by you or your agents.\n15.1 Drivers should be allowed a sufficient amount of time to park and read any signs so\nthey may make an informed decision as to whether or not to remain on the site.\nEnforcement action can begin during the grace period.\nNotice to Keeper\n6.4 The keeper must be told that the process of appealing within your internal appeals process\nand the IAS.\nThe requirement to allow keepers to be able to appeal has been removed. If a keeper appeals a notice to driver, they get this reply:\nLater on, when the notice to keeper arrives, the right to appeal is no longer present.\nThe right of a keeper to appeal is a fundamental protection. It was a clear condition of government that the motorists should have access as a condition of the Protection of Freedoms Act Schedule 4 going live. The Prankster believes that ATA status should be removed from the IPC until the right for keepers to appeal has been restored.\nEntrance Signs\nSigns must, where practicable, be placed at the entrance to a site.\nSigns should, where practicable, be placed at the entrance to a site.\nEntrance signage is no longer mandatory. A large number of IPC members do not bother with entrance signage. Standardised entrance signage is an important part of car park management, alerting motorists that terms and conditions apply and so they must look out for further signs. Doing away with this requirement boosts parking charge numbers and increases revenue for operators.\nThis is another huge retrograde step by the IPC, and shows their intention is not to provide a true car park management service, but to catch motorists out in order to make more money for their members.\nStandard Wording\nYou should endeavour to use the following standard wording on your entrance signs. You should\ninclude a minimum of one phrase from Group A (but no more than 3). Group A text should be before\nand more prominent than the Group B text. The signs must direct motorists to the more detailed\nsigns which display the full terms and conditions. This is important as it is these terms and conditions\nthat will provide the legal foundation to any charge.\nGroup A\nPay and display [free for blue badge holders]\n[x minutes/hours] free parking [for customers only]\nPay on exit\nPay [on foot/at machine] when leaving\nParking for [business name] customers only\nPermit Holders Only\nGroup B\nCharges apply [after this]\nPrivate land\nTerms and Conditions Apply\nSee the notice[s] [in car park] for conditions\nThis requirement has been removed. The use of standard wording helps motorists.\nText Size\nThe height of the capital letters in the text from Group A will be dependent on the anticipated\napproach speed of traffic. You should have reference to the table below in calculating the text size.\nGroup B text should be at least 50% of the size of Group A text. All other text should be smaller than\n50% of the text from Group A. The name of the site and a welcome message can also be displayed\non the sign but should not detract from the prevalence of the Group A and Group B text.\nThe sign must be readable from far enough away so that drivers can read all of the Group A and\nGroup B text without needing to look more than 10 degrees away from the road ahead. Any text on\nthe sign which is not intended to be read from a moving vehicle can be of a much smaller size.\nThe size of text on a sign will be determined by a number of factors such as the position of it,\nto whom it is aimed and the information that it needs to convey. Text should be of such a size\nand in a font that can be easily read by a motorist having regard to the likely position of the\nmotorist in relation to the sign.\nThe definition of text size has been removed so that members can use whatever size they like. Large numbers of IPC signs have tiny fonts containing onerous terms and conditions. Allowing their members to hide conditions like this boosts revenue at the expense of motorists.\nOne of the IPC's biggest customers is Excel Parking/Vehicle Control Services whose signs routinely fail these requirements. At one of their biggest money spinners, Liverpool Airport, the font size is 30mm instead of the previously required 120mm. It is of course, unreadable from a moving vehicle.\nUpsetting Excel would be a bad move for the IPC so it is a reasonable guess that this change was a result of a request by them.\nSignage in the Dark\nIf parking enforcement takes place outside of daylight hours, the sign itself is not illuminated or\nthere is not sufficient ambient lighting, it should be made of retro-reflective material meeting BS EN 12899-1:2007 class RA2 or higher (BS EN 12899-6:2012 class P3 or higher). Dark-coloured areas need not be reflective. You need to ensure that all signs are readable during the hours of enforcement as they form the legal basis of any charge. If signs cannot be read then resulting charges that depend upon their content will not be enforceable.\nIf parking enforcement takes place outside of daylight hours you should ensure that signs are\nilluminated or there is sufficient other lighting. You will need to ensure all signs are readable\nduring the hours of enforcement as they form the legal basis of any charge.\nThe requirement to conform to standards has been removed. The pesky condition that unreadable signs cannot be enforced has been removed.\nRepeater Signs\nYou are required to provide a sufficient number of signs on each site commensurate with its size and\nother characteristics to ensure that motorists can be under no doubt as to the fact that parking\nrestrictions exist.\nYou are required to provide a sufficient number of signs on each site commensurate with its\nsize and other characteristics to ensure that any parking conditions are adequately brought to\nthe attention of the motorist.\nThe requirements for repeater signs have been relaxed.\nOther Signs\n6) Contain text that is appropriate to the position of the sign and the relative position of the\nperson who it is aimed at. So, if a sign is at an entrance of a site and the vehicle is likely to be\nmoving, it must be sufficiently large so as to be clear from within the vehicle having regard\nto the likely speed that the vehicle will be travelling at that point.\n6) Contain text appropriate to the position of the sign and the relative position of\nthe person who it is aimed at.\nThese safeguards have been weakened.\nChanges in Operator’s Terms and Conditions\nWhere there is any change in the terms and conditions that materially affect the motorist then you\nshould place additional (temporary) signage at the entrance making it clear that new terms and\nconditions/charges apply. The signage should be in addition to the signage ordinarily required.\nWhere there is any change in the terms and conditions materially affecting the motorist you\nmay place additional (temporary) signage at the entrance making it clear that new terms and\nconditions/charges apply, such that regular visitors who may be familiar with the old terms\ndo not inadvertently incur parking charges. This signage should be in addition to the signage\nordinarily required.\nThe requirement has been weakened.\nSanctions\nUsing Predatory Tactics 8-12\nUsing Predatory Tactics 6-12\nSanction Points have been watered down\nAudit\nWhere an operator has more than 60% of their Parking Charge Notices dismissed on appeal within a\nrolling 3 month period, the IPC will investigate the operator and their practices to identify any areas\nof non-compliance and will report to the parking operator on their findings. The IPC will usually\nendeavour to work with the operator in resolving any compliance issues. The IPC may, whether or\nnot it assists in resolving issues with the operator, invoke compliance measures where appropriate.\nEach year the IPC will randomly select 20-50 Parking Charge Notices issued by an operator to check with compliance with the relevant legislation and the Code of Practice.\nWhere an operator has more than 60% of their parking charges cancelled on appeal to the IAS\nwithin a rolling 3 month period, the IPC may investigate the operator and their practices to\nidentify any recurring areas of non-compliance and will report to the parking operator on their\nfindings. The IPC will usually endeavour to work with the operator in resolving any compliance\nissues. The IPC may, whether or not it assists in resolving issues with the operator, invoke\ncompliance measures where appropriate.\nThe requirements have been weakened.\nParking Charges\nHowever, if the motorist uses the land other than in accordance with the terms and conditions then\nthey agree to pay a fixed fee by way of damages to the operator. This is based on a genuine preestimate of loss that flows from the breach of contract by acting otherwise than in accordance with the terms of the agreement the motorist entered into when deciding to park.\nAll parking charges must be reasonable.\nHowever, if the motorist uses the land in breach of the terms and conditions they thereby agree to pay a fixed fee by way of damages to the operator.\nAll parking charges must have good legal foundation\nThe requirement to be a genuine preestimate of loss has been removed. Parking charges noi longer need to be reasonable.\nConclusion\nIt is obvious that every change has been made to the detriment of the motorist and without good reason. This is what happens when the DVLA allows a rogue ATA to have full control of its code of practice. The Prankster therefore backs the BPA's call for a single industry-wide code of practice, maintained by an independent body.\nUntil the IPC gets its house in order and reverts back to a fair code of practice, restoring at least signage requirements, and the ability for keepers to appeal, the DVLA should suspend its ATA status.\nHappy Parking\nThe Parking Prankster", "source": "Parking Prankster"}