{"published": "2015-09-30T06:20:56Z", "media-type": "News", "title": "Volunteer blew charity cash at the bookies", "id": "e6a1365d-26bf-472a-a34d-334acb88bc79", "content": "A GAMBLING addict stole hundreds of pounds from a children’s charity while carrying out court ordered unpaid work.  \n\r\n\t\tSamuel James Price helped himself to the £728.54 takings from Barnardo’s in River Lane, Saltney and blew the majority in a bookmakers before returning to \n\r\n\t\tthe charity with £2, West Cheshire Magistrates Court heard. \n \n\r \n\r\n\t\tPrice, 25, who has a previous conviction for stealing from his employers along with a caution for the same offence, had been asked by staff at Barnardo’s to bank takings, but when he returned six and a half hours later he told them £42 of the money had “fallen out of his pocket” and he promised to repay the lost cash the next day. \n \n\r \n\r\n\t\tHe also professed to have banked the takings, but the charity later noticed the banking slips given to Price had been altered and he was confronted by employee Katie Dobson who asked him to send a picture via text message of the banking slips, but Price said he could not. \n \n\r \n\r\n\t\tPrice carried out the theft just three days in to 40 hours of unpaid work for Barnardo’s, as part of a 12-month community order imposed by magistrates in Chester after Price was convicted of a battery offence in June. \n \n\r \n\r\n\t\tRob Youds, prosecuting, said: “On August 13, the defendant began work at Barnardo’s and that day he complained that he was feeling ill and asked to take an hour for his lunch. While doing so, an employee from Barnardo’s Katie Dobson asked the defendant to do the banking and deposit the takings of £728.54 for them, along with completed banking slips. \n \n\r \n\r\n\t\t“The defendant left at 11.50am and by 2pm he had not returned. He was called by Barnardo’s and he later called back and said he had to do a few errands for his dad. \n \n\r \n\r\n\t\t“When he did return at 6pm, the defendant said he had lost £42 of the money after it had fallen out of his pocket and promised to give it back the next day. \n \n\r \n\r\n\t\t“The following morning, Katie Dobson noticed that the paying in slips had been amended and the matter was reported to police”. \n \n\r \n\r\n\t\tPrice was later arrested and he admitted to taking the money. A search of his property revealed a betting receipt for £600 Coral Bookmakers. \n \n\r \n\r\n\t\tPrice, of Stringers Lane, Higher Kinnerton, Flintshire, told police he was in a constant cycle of gambling and said he got “carried away”. \n \n\r \n\r\n\t\tHe admitted theft by his employee when he appeared before the Chester court on Tuesday. \n \n\r \n\r\n\t\tAdrian Evans, defending, said: “Although this is in no way seeking to blame the lady at Barnardo’s, Mr Price was surprised to have been given the takings to bank. The lady would not have known that Mr Price had a gambling problem for some time.” \n \n\r \n\r\n\t\tMr Evans said Price was remorseful over the incident which brought things to a head and Price was now seeking help from Gamblers Anonymous. \n \n\r \n\r\n\t\t“He is doing his best to tackle his demons,” said Mr Evans. \n \n\r \n\r\n\t\tMagistrates revoked the original community order and sentenced Price to a total of six months prison, suspended for 12 months. They also imposed a two-month electronic curfew and told Price to repay the £728.54 to Barnardo’s, and a total of £345 costs.", "source": "NewsNorthWales.co.uk"}