{"published": "2015-09-28T13:32:00Z", "media-type": "News", "title": "Celebrating National Honey Month with Honey Recipes", "id": "7c40fe8c-44a5-4aa3-aad7-0c5e4cbf37be", "content": "Monday, September 28, 2015 \n \n By: Sarah Myers, Apiarist at the Bayer Bee Care Center \n\nWe are continuing to celebrate National Honey Month with some of our favorite recipes from the National Honey Board.  Honey is nature’s natural sweeter and honey bees work hard for it! Check out the recipes (and facts) below to see why honey can be a wonderful addition to many of your favorite recipes.    \nWondering what to make for dinner tonight? Indulge in the grilled honey, almonds and brie burger .   This decadent burger includes a full cup of honey to make it extra savory and sweet.  An average hive of honey bees must fly over 40,000 miles to make this much honey.  To put that in context, the circumference of the earth is 24,901 miles.  That’s a lot of traveling for your burger! \nLooking for a delicious afternoon snack? Check out this refreshing honey glazed grilled fruit salad .  This recipe of six servings calls for one cup of honey.  Honey bees need to travel to roughly 1.5 million flowers to make this much honey! The honey brings out the natural sugars in the pineapple and honeydew in this sweet treat.  \n \nHeading into fall, it’s a great time for pumpkin bread.  Try this recipe for pumpkin honey bread , a sweet twist on a classic fall staple.  Enjoy it as coffee cake in the morning or a sweet dessert after dinner – and it’s the perfect food to bring as a housewarming gift this holiday season.  The flavor of honey depends on what the bees were feeding on when they produced it.  So try a couple of different “flavors” like blueberry, clover, and orange blossom to find your favorite! \nFeeling stressed after a long day (or week) at work? Treat yourself with this relaxing honey and avocado moisturizing mask .  This all natural beauty treatment uses 1 tablespoon of honey.  It might not seem like much – but on average, a worker bee produces only 1/12 of a teaspoon of honey in her lifetime.  So it would take about 36 worker bees their entire lives produce the honey for each mask.  Kick back and let the bees do the work for you. 10-15 minutes will leave you feeling refreshed and rejuvenated! \nHave a favorite honey recipe? Let us know in the comments below.   \nFor more delicious recipes, check out Bayer CropScience on Pinterest .  ", "source": "Bayer CropScience United States"}