{"published": "2015-09-14T16:23:43Z", "media-type": "News", "title": "New IDC Health Insights Research Director Spearheads Payer IT Market Research", "id": "114fb22e-1c79-445a-b196-cf3c00355daf", "content": "Seasoned former CareFirst enterprise architect brings more than \n      three decades of experience to bolster payer research offering  \n \n IDC \n      Health Insights today announced the appointment of Jeff \n      Rivkin to Research Director, Healthcare \n      Payer IT Strategies . In this role, Rivkin will focus his research on \n      healthcare reform business and technology priorities, constituent and \n      consumer engagement strategies, technology and business implications for \n      accountable care, risk, quality-based payment, and incentive programs, \n      among other trends and technologies important to the payer community. \n \nWith over three decades of strategic IT management experience, Rivkin \n      spent most of the last ten years at CareFirst Blue Cross Blue Shield, \n      where he most recently served as a senior advisor to the ACA/HIX Health \n      Care Reform Program. During his tenure at CareFirst, Rivkin invented \n      eight coordinated strategic conceptual designs to cover the entire \n      program's efforts in the areas of function, data, and technology. In \n      addition, he served as Enterprise Architect to the Provider Networks \n      Business Area, responsible for Credentialing, Pricing, Directory, and \n      Provider Contracting functions. \n \nWith deep industry expertise in melding and integrating top-down \n      enterprise architectures with bottom-up technologies and applications, \n      Rivkin is a published author with several certifications including: \n      Certified HealthCare Reform Specialist; Certified Professional, Academy \n      of Healthcare Management-PAHM; Certified Professional in Electronic \n      Health Records-CPEHR; and Harvard School of Public Health - Certificate, \n      Continuing Education: Leadership Strategies for Information Technologies \n      in Health Care. Throughout his career, Rivkin has held senior positions \n      at a number of leading organizations, including Magellan Health \n      Services, Teradata, and Verizon. Rivkin can be followed on Twitter at \n      @jrivkin1. \n \n\"We are thrilled to welcome Jeff to our team as we continue to expand \n      our coverage of the technologies and trends impacting the payer market,\" \n      said Lynne \n      Dunbrack , Research Vice President, IDC Health Insights. \"Jeff's long \n      history in the healthcare IT market make him an asset to our team and \n      our clients, who rely on IDC Health Insights to offer unmatched research \n      and analysis on best practices to maximize technology investments. We \n      look forward to his research contributions to support the payer \n      community and extend our value to this important industry.\" \n \nTo arrange a one-on-one briefing with Jeff Rivkin, please contact Sarah \n      Murray at 781-378-2674 or sarah@attunecommunications.com . \n \n About IDC Health Insights \nIDC Health Insights assists health \n      businesses and IT leaders, as well as the suppliers who serve them, in \n      making more effective technology decisions by providing accurate, \n      timely, and insightful fact-based research and consulting services. \n      Staffed by senior analysts with decades of industry experience, our \n      global research analyzes and advises on business and technology issues \n      facing the payer, provider and life sciences industries. International \n      Data Corporation ( IDC ) \n      is the premier global provider of market intelligence, advisory \n      services, and events for the information technology market. IDC is a \n      subsidiary of IDG , \n      the world's leading technology, media, research, and events company. For \n      more information, please visit www.idc-hi.com , \n      email info@idc-hi.com , or call \n      508-935-4445. Visit the IDC Health Insights Community at http://idc-community.com/health . \n \n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150914006007/en/ \n\nCopyright Business Wire 2015 \nSource: Business Wire\n\t\t\t\t(September 14, 2015 - 12:21 PM EDT) \nNews by QuoteMedia \nwww.quotemedia.com", "source": "InvestorPoint.com"}