{"published": "2015-09-17T23:00:00Z", "media-type": "News", "title": "HSMAI Announces New ROCET Program", "id": "a10c9623-1d20-4b5a-9ee0-694ca997cc2a", "content": "Fast-paced, one-day program delivers market specific tactical, strategic and leadership insights for hotel revenue managers. \n \n(PRWEB) September 17, 2015 \n \nThe Hospitality Sales & Marketing Association International (HSMAI), producer of the annual industry-leading Revenue Optimization Conference (ROC), is pleased to announce HSMAI’s ROCET, Revenue Optimization Continuing Education & Training, a fast-paced, one-day program designed to fuel revenue management. HSMAI’s ROCET will deliver tactical, strategic and leadership insights for hotel revenue managers in cities across the country, and is scheduled to take place on the following dates: \n   \n• November 2, Washington, DC, Cambria Hotel & Suites  \n• November 4, Orlando, FL, Loews Royal Pacific at Universal Orlando  \n• November 6, Chicago, IL, AC Hotel  \n \nHSMAI’s ROCET will feature Bonnie Buckhiester, ISHC, president & CEO, Buckhiester Management Limited, Kelly McGuire, Ph.D., executive director, Hospitality and Travel Global Practice, SAS Institute Inc., and leading industry experts from STR, TravelClick and local convention and visitors’ bureaus. \n \n“Our goal for the new ROCET program is to provide professionals with the latest trends, practical solutions and strategies for the future,” said Robert A. Gilbert, CHME, CHBA, president and CEO, HSMAI. “It’s a one-of-a-kind learning and networking opportunity for hotel revenue managers with direct responsibility for revenue optimization and pricing, and the desire to become a leader and expert in their industry.” \n \nThe one-day program provides in-depth education on trends in the market, analyzing forecast accuracy, evaluating pricing in a social world, data visualization and advances in total revenue management. Each session is geared specifically to provide strategies, cutting-edge knowledge and best practices for hotel revenue managers. \n \nRegistration is now open for the three HSMAI ROCET programs at http://www.hsmai.org/rocet .  Series partners are Booking.com, Rainmaker, TravelClick, and content partner STR. For information on becoming an event partner, contact Nora Cloherty at ncloherty(at)hsmai(dot)org. \n \nAbout HSMAI \nThe Hospitality Sales and Marketing Association International (HSMAI) is committed to growing business for hotels and their partners, and is the industry’s leading advocate for intelligent, sustainable hotel revenue growth. The association provides hotel professionals & their partners with tools, insights, and expertise to fuel sales, inspire marketing, and optimize revenue through programs such as HSMAI’s MEET, Adrian Awards, and Revenue Optimization Conference. HSMAI is an individual membership organization comprising more than 7,000 members worldwide, with 40 chapters in the Americas Region. \n \nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb12967892.htm", "source": "MySanAntonio"}