{"published": "2015-09-11T16:13:18Z", "media-type": "Blog", "title": "Current Events Overshadow Anniversaries in Central Asia", "id": "a14e0c13-564e-485c-a273-6cbd742402c3", "content": "Some weekend Central Asia reads: The manhunt for Tajikistan’s former deputy defense minister, Abduhalim Nazarzoda, is on. After the September 4 events that authorities report resulted in the deaths of nine police officers and 17 “terrorists,” the state formally charged Nazarzoda with “high treason, terrorism, sabotage, and creating an extremist group.” The authorities said on September 5 that the renegade general had fled to Romit Gorge, with seven to eight supporters. The numbers were arbitrary. The following days were filled with claims by the Tajik government to have arrested 17 members of Nazarzoda’s group “as a result of special operations” in Romit Gorge. As Asia-Plus reports, “According to official data, security forces have killed 22 members of Nazarzoda group and arrested more than 100 others, since the operation against the group was launched.” While the manhunt continues, read up on Nazarzoda to get a better picture of who the general is and what led up to the events of September 4. First check out Eurasianet’s profile of Nazarzoda. Then read Farangis Najibullah’s profile for RFE/RL, which goes deeper into explaining how Nazarzoda navigated the civil war and fit himself into the post-war peace arrangements. While Tajikistan’s September 9 Independence Day was marred by the ongoing manhunt, a different celebration in neighboring Uzbekistan also proceeded under significant gloom. The recently-fired director of the Nukus Art Museum which houses Igor Savitsky’s prized collection of banned Soviet art, Marinika Babanazarova, was absent from the museum’s centenary celebration of Savitsky’s birth. Agnieszka Pikulicka-Wilczewska wrote about the celebration for Eurasianet, noting that the the rainy day “felt like an omen.” In another art-related story in Uzbekistan, the European magazine Cafebabel interviewed Umida Akhmedova, an Uzbek photojournalist and documentary filmmaker who was convicted in 2010 of “defamation” and “insult” related to a documentary she had made with her husband about rural life in Uzbekistan. The government said they “had discredited and disrespected the traditions and values ​​of the Uzbek people.” While Akhmedova was quickly released, life remains difficult for her as an artist in the country. As Kyrgyzstan enters the month-long campaign season leading up to the October 4 parliamentary election, IWPR’s Timur Toktonaliev interviewed Tamerlan Ibraimov, director of the Center for Political and Legal Studies in Kyrgyzstan, about the development and evolution of rule of law in the country. While the Kyrgyz constitution enshrines the rule of law, Toktonaliev asks if that is really the case. In response, Ibraimov says right now the reality is that “ the law works in some cases, while elsewhere it is other things that prevail. Take what’s called ‘telephone law’ – when matters are resolved by a phone call from above. Or corruption, where what counts is who pays the most.” The interview dives into the erosion of the rule of law prior to Kyrgyzstan’s independence from the Soviet Union as well as the increasing role of religion in providing “answers to both spiritual and political questions.” Also a month away are Kazakhstan’s celebrations in Taraz of the 550th anniversary of the Kazakh Khanate. This weekend Astana is hosting a celebration of its own, part of an ongoing geopolitical and nationalistic statement. In August 2014, Putin responded to a question regarding Russian concern about nationalism in Ukraine and rising nationalism in Kazakhstan by saying that Nazarbayev had “created a state on a territory where there had never been a state. The Kazakhs had never had statehood. He founded it.” Nate Schenkkan translated the entire exchange and provided insightful commentary last year on Registan, writing that “this is an extraordinary event. I don’t know how the Kazakh government will respond to this, but assuredly there are people in Astana in very high places who are both scared and furious.”", "source": "The Diplomat"}