{"published": "2015-09-23T00:43:10Z", "media-type": "News", "title": "BHP Billiton and Rio Tinto shares plunge on China worries", "id": "ed2671ef-cae8-4c0e-9638-d528723ba5de", "content": "Blue chip miners share prices plummeted as soon as the Australian market opened after a horror night for resources stocks on the London exchange, as analysts warn it is particularly vulnerable to China's slowing growth and prices slump. Blue chip miners share prices plummeted as soon as the Australian market opened after a horror night for resources stocks on the London exchange, as analysts warn it is particularly vulnerable to China's slowing growth and prices slump. In early trade, BHP Billiton shares are down 3 per cent to $23.12 and Rio Tinto 2 per cent to $48.24.\n\nThe losses continue the declining trend this year in line with commodity prices. Rio Tinto has lost 14.9 per cent and BHP 22.7 per cent since January, and 5 per cent this month alone.\n\nThe decline could see BHP tumble below the year-low of $22.84 reached in August. A fall below this price would see it reach a new seven-year low.\n\nOvernight, BHP Billiton lost 5.1 per cent and Rio Tinto fell 3.2 per cent in London.\n\nThe falls come amid as global markets face the inevitable slowdown of the Chinese economy and its demand for industrial metals. On Tuesday the Asian Development Bank lowered its growth expectations for China.\n\nRatings agency Moody's described the resources sector as the most exposed to China's slowing growth, a call underscored by Credit Suisse, which cut its Chinese forecasts for demand.\n\n\"Much of this is a catch-up to current conditions, which remain highly uncertain, but until China demand and emerging market currencies find a floor, it will remain challenging to put an absolute floor on commodity prices,\" Credit Suisse research analyst Liam Fitzpatrick told The Financial Times.\n\nIn June, RBC Capital revised its ratings for BHP Billiton to underperform but maintained Rio Tinto at \"neutral\" and South32 at \"outperform\". South32 dropped 1.2 per cent on the London exchange over night.\n\nAt the time, EIM Capital's John Robertson warned BHP's had long been overvalued and that he expected it to continue to fall.\n\n\"BHP's value proposition has always been overestimated. It was in almost every fund, individual and institutional, and this demand saved it from the reckoning when the sector repriced, but now its day has come,\" Mr Robertson said.\n\nOn Wednesday, the company announced an upcoming vote that could see Australian shareholders sacrifice some of the company's franking credits to ensure it can meet its dividend requirements to UK shareholders. The story first appeared on The Sydney Morning Herald.", "source": "Narromine News"}