{"published": "2015-09-04T18:00:40Z", "media-type": "Blog", "title": "New York: Opt Out Parent Leaders Respond to Cuomo: \"We Won't Back Down\"", "id": "1b82c2cf-9d46-47a7-8a12-2722d524a75d", "content": "The following statement was released by the New York State Allies for Public Education:\n\n\n\nhttp://www.nysape.org/nysape-press-release---parents-respond-to-cuomo-tisch-elia.html\n\n \n\nFOR IMMEDIATE RELEASE: September 4, 2015\n\n\nMore information contact:\nLisa Rudley (917) 414-9190; nys.allies@gmail.com\n\n\nNYS Allies for Public Education www.nysape.org\n\n\nThe Message of 220,000 Opt-Outs Has Not Been Heard:  Elia Calls Opt-Out Parents “Unreasonable” and Cuomo Continues Trampling on the NYS Constitution\n\n\nFor over three years parents across New York have called on Albany to substantially change the direction of education reforms  built on the flawed Common Core, its intertwined high-stakes testing and fundamentally broken teacher evaluation system. \nDespite outrage with the appointment of an education commissioner without a public process, parents initially withheld their concerns with MaryEllen Elia and the reports of her support for Common Core reforms coupled with a heavy-handed, non-collaborative approach that factored in her firing in Florida.\n\n\nJust a few short weeks into her appointment in New York however, Elia has proven parent skeptics right.  She has adopted the “tough-talk” tactics of Andrew Cuomo and Merryl Tisch, apparently as cover for a governor and chancellor who have dramatically softened their education rhetoric to the public. Elia has labeled opt out parents as ‘unreasonable’, opt out supporting educators ‘unethical’ and threatened funding cuts if opt outs are not stopped.\n\n\nIn a press release yesterday expressing “sympathy” for parents, Cuomo called for a review of the Common Core in New York, blaming the State Education Department’s implementation while vowing to revive his Common Core panel to review the mess. \n\n\nParents across the state are not fools.  \n\nThey know the problems are hardly limited to implementation of the Common Core, but the actual Common Core itself, its excessive testing, and a fundamentally broken teacher evaluation system.  \nParents know that Andrew Cuomo is not part of the solution.  Cuomo is the problem.\n\n\nIt is Cuomo who forced his unproven teacher evaluation system down parents’ throats. \n\nIt is Cuomo who slashed and underfunded the State Education Department staffing. \n \nIt is Cuomo who accepted ‘Big Donor’ campaign money and enabled the build-up of a privatized, unaccountable shadow government within the State Education Department –The Regents Research Fellows—who created the “Implementation” mess Cuomo now blames.\n\nIt is Cuomo who repeatedly tramples on the New York State Constitution--which gives a NY Governor NO authority over education policy—with his serial habit of forming pro-corporate education reform stacked panels, complete with Washington lobbyists salivating to eliminate parental consent for data profiling of children.\n\n\nParents of New York are outraged and will continue the fight to take back their schools and classrooms from the Albany shenanigans of Andrew Cuomo, Merryl Tisch and MaryEllen Elia.\n\n\n “In New York, Governor Cuomo and Board of Regents Chancellor Merryl Tisch, teamed up for the past five years to turn theory and promise of the Common Core into a living nightmare for our children and their teachers. Parents see through the ploys and will not back down. We will continue to refuse to participate in the Common Core tests that are destroying our schools and our children's education. Governor Cuomo's role in this mess will not be ignored.”  - Jeannette Deutermann, Long Island public school parent and Long Island Opt Out founder. \n\n\n “The spirit of our children is being broken. When will Albany start really paying attention and make the changes that parents are asking? We want our classrooms back, we want our teachers to teach, and we want a well-rounded curriculum for all our children. More test prep or testing is not the answer to closing the achievement gap.” –Charmaine Dixon, Brooklyn public school parent and NYC Opt Out member.\n\n\n “Parents will not stop fighting for their kids.  Tests MUST be decoupled from teacher evaluations, state tests MUST be reduced, and student data MUST NOT be shared without parental consent.” –Eric Mihelbergel, Western NY public school parent and NYSAPE founding member.\n\n\n “The corrupt influence of ‘Big Money’ and ‘Big Data’ Collection in New York has ushered in the most destructive education laws and policies in the nation based on model American Legislative Exchange Council (ALEC) legislation and “pushed” by the privatized Regent Research Fellows think tank.  Parents very clearly see how profit motives are driving the loss of local control in their children’s classroom...and they reject it.”  -Lisa Rudley, Westchester public school parent and NYSAPE founding member.\n\n\n“The results of the recent annual PDK/Gallup education poll are telling.  An overwhelming majority (64%) of Americans say there is too much emphasis on testing in schools and a majority of public school parents oppose the Common Core.  How much longer will parents in New York tolerate what Albany is doing to their children’s classrooms?  The next election cycle will be very telling,” said Jessica McNair, Central NY public school parent, educator, and CNY Opt Out founder. \n\n\nNYSAPE, a grassroots organization with over 50 parent and educator groups across the state are calling on parents to continue to opt out by refusing high-stakes testing starting on the first days of school. Go to http://www.nysape.org/resources.html for more details on the how to be part of the Great Opt Out of this decade.\n \n###", "source": "Diane Ravitch's blog"}