{"published": "2015-09-07T09:00:47Z", "media-type": "Blog", "title": "#IAmMyUnion campaign ignores many non-conforming union members", "id": "18fa8b53-7488-45c7-9904-39813b21ce57", "content": "The American Federation of Teachers this Labor Day is running a Twitter campaign, #IAmMyUnion. “Members are the heart and soul of the union,” the union’s email announcement reads. “An attack on the labor movement is an attack on all of the people who make up this great union.” \n \nIt’s interesting considering how out of touch the union is with its own “heart and soul.” A colleague reported recently  the AFT’s endorsement of Hillary Clinton raised the ire of the “rank and file” members . The AFT’s own poll revealed 60 percent of its members are either Democrats or independents who plan to vote in the Democratic primary elections. Nothing is said about the other 40 percent, who are only barely a minority. \n \nHas anyone asked the rank-and-file what they think about union politics? \n \nWhat do they think? The National Education Association, the other major teachers union, hints at the reason in its discussion of right-to-work laws: \n \nSome oppose unions for political reasons: unions tend to support Democrats over Republicans, because Democrat lawmakers tend to support the kinds of legislation like pension-protection laws and raising the minimum wage that are important to union leadership. \n \nI can’t argue with anything there, but note that these left-wing issues are important to “union leadership.” Is anyone asking the rank-and-file? What about union members who don’t support union politics? There’s a lawsuit  now in Pennsylvania because a Catholic teacher doesn’t agree with her union’s support of Planned Parenthood. The teacher wanted to send her money instead to a charity of her choice, and the negotiations were such a headache that she filed a lawsuit. \n \nWhen Michigan passed its right-to-work law a few years ago — granting workers the right to choose whether to belong to a union, a move the AFT opposes — many teachers had a hard time getting out. I talked to two of them. Here’s what one said: \n \n(Lisa) Jelenek and some of her co-workers chose not to re-join the union for the 2013-14 school year, the first year in which right-to-work applied. They didn’t know about the August window until too late. \n \nJelenek tried in vain to leave the MEA before she retired. \n \n“Early September, we got an e-bill statement from the union treasurer, the dues statement for the year,” Jelenek said. “We said, ‘What? We’re not joining.’ We found it very convenient that we got it right at the beginning of September, when all the powers that be knew we had to do something in August.” \n \nJelenek unwillingly remained a union member before retiring, but her former co-workers — about a third of her district’s teachers — are still trying to leave the MEA. She didn’t pay her dues as requested and has been ignoring her monthly billing statements. \n \n“That’s what we were told initially by the unit director — If you don’t pay this, we’re going to send you to collections. We thought, ‘You’re representing me nicely,’” she said. \n \nRebecca Friedrichs, a California teacher, is technically not a member of a union, but she’s still required to pay 70 percent of union dues — she gets a rebate for the 30 percent the union says it spends on political activities such as lobbying — even though she’s lost almost all her member benefits. She’s arguing in her lawsuit, which the U.S. Supreme Court agreed to hear, that the 70 percent she’s paying is still being used politically, and therefore, she shouldn’t be required to pay it. She’s basing her argument on her First Amendment rights not to be forced to support political activity. She and fellow teacher Harlan Elrich had bad experiences with their unions in California, according to their interview with the Washington Post . \n \nFriedrichs: Around 2006 and 2007, we’d been having a lot of low morale issues in our district. I decided to serve on my union’s executive board as secretary for our local. Every month, I would bring up the same question: The teachers I’m representing and myself, we’re concerned about a lot of the things going on with our union. We’re concerned about tenure, we’re forced to fund politics against our will. Every time I would bring these things up I would just get shrugged shoulders from our union executive board. They wouldn’t even give me a response. \n \nIn the interview, Friedrichs says the 70 percent she pays for collective bargaining isn’t used to bargain for wages and benefits she asked for and agrees with. Why should she have to pay it? \n \nCertainly, many AFT members are happy to be AFT members, and they’re welcome to post their opinions on social media — that’s why social media exists. But the AFT shouldn’t pander to its members, many of whom can only choose between joining the union and leaving their jobs, and pretend they all support it. Some do, but many don’t, and their voices deserve to be heard, too. \n \n ", "source": "Watchdog.org"}