{"published": "2015-09-14T10:10:22Z", "media-type": "News", "title": "Young Reporter scheme goes London-wide with an exciting opportunity for students", "id": "1a2b7ed8-4bbe-4b47-8360-04378164a958", "content": "The Young Reporter scheme starts up again this month for the eighth year running and is open to students from years 10 to 13. This is a fantastic chance for young people  to write and publish their articles on a real live online newspaper, viewed by over 700,000 people per month worldwide. \n \nSchools have totally endorsed this scheme as it is hard to secure work experience placements in the media and it gives students a chance to start their ‘writing career’ under the guidance of professional journalists. \n \nDavid Plummer, principal, Notre Dame School, said: “Our students have found the scheme provides a superb outlet, somewhat different from their normal school work, to tackle issues pertinent to their own interests.” \n \nStudents are given deadlines and encouraged to write local articles and take photographs, all of which are published on News Shopper and also  This Is Local London , our online newspaper covering the areas around the capital. \n \nKatie Harris, from Croydon High School who was one of our top winners this year, said: \"The Young Reporter scheme has been such a rewarding and inspiring experience. I would recommend it to anyone who is interested in journalism.\" \n \nSupported by several universities, the scheme has grown in size from two schools, who piloted it back in 2008, to 93 schools who took part during this past year. \n   \n Share article  \n   \nStuart Bird, writer in residence, Surbiton High School, added: “Young Reporters is unique. It's independent, it's tough, it's real. It takes commitment and dedication to complete it. And for exactly those reasons, students respect it and love it.” \n \nSchools are now registering for this coming year and applications need to be submitted by October 9. For more information or to sign up for 2015/16, please contact Diana Jarvis – djarvis@london.newsquest.co.uk", "source": "St Albans and Harpenden Review"}