{"published": "2015-09-14T09:54:00Z", "media-type": "News", "title": "Mediterranean Diet With Extra Olive Oil May Lower Breast Cancer Risk", "id": "26ca04b3-4c0f-45f3-bec5-1c0bf70fffa1", "content": "By now surely you've heard of the Mediterranean diet. \n\nIt's a pattern of eating that emphasizes fish, nuts, legumes, fruits, vegetables, fruits and olive oil — lots of olive oil. \n\nThe evidence of its benefits has been piling up. For instance, a 2013 study in the New England Journal of Medicine showed that the diet can protect against heart disease. Another study published earlier this year revealed it can help fend off memory loss. \n\nNow, researchers say that eating a Mediterranean diet supplemented with four tablespoons per day of extra-virgin olive oil reduces the risk of breast cancer. \n\n\"We found a strong reduction in the risk of breast cancer,\" says Miguel Martinez Gonzalez , an author of the study and a leading researcher on the preventative health effects of the Mediterranean diet at the University of Navarra in Spain. \n\nFor his latest study, which appears Monday in JAMA: Journal of the American Medical Association , Martinez Gonzales assigned about 4,000 women between the ages of 60 and 80 to follow either the Mediterranean-plus-olive-olive-diet or a low-fat diet. \n\nHe found that the women following the Mediterranean diet had a 68 percent lower relative risk of developing breast cancer during a five-year follow-up period compared to women on the low-fat diet. \n\nAnd one of JAMA's editors, Mitchell Katz, weighed in on the study in a separate editor's note. \n\n\"Of course, no study is perfect,\" he wrote. And there are certainly limitations to this one, including the fact that this was a homogeneous group of white women. \n\nBut, Katz points out, the Mediterranean diet is known to reduce the risk of cardiovascular disease and \"may also prevent breast cancer.\" \n\nIn conclusion, he wrote, \"we hope to see more emphasis on Mediterranean diet to reduce cancer and cardiovascular disease and improve health and well-being.\" \n\nWhat's tricky about the findings, Katz tells The Salt in an interview, is that it's hard to know which compound, or compounds, in the Mediterranean diet could be most beneficial. \n\nBut given that the group of women with the lowest rate of breast cancer consumed about four tablespoons of olive oil in their diet each day, \"it makes you wonder whether it's something in the extra-virgin olive oil.\" \n\nAs we've reported, extra-virgin olive oil is, in essence, the fresh-squeezed juice of an olive. \"It's a fruit juice,\" Tom Mueller, author of the book on olive oil Extra Virginity , told us a few years back. \n\nAnd inside are a whole range of potentially beneficial compounds known as polyphenols. One of them is oleocanthal, which \"possesses similar anti-inflammatory properties to ibuprofen [pain reliever],\" according to a study published in 2011. \n\nAnd, as we've told you before: when it comes to choosing extra virgin olive oil, fresh is best, so look for a harvest date on the bottle.", "source": "KCUR 89.3 FM"}