{"published": "2015-09-29T16:53:00Z", "media-type": "News", "title": "SFX Entertainment, Inc. Shareholder Alert: Former SEC Attorney Willie Briscoe and Powers Taylor Investigate Possible Breaches of Fiduciary Duty by Officers and Directors", "id": "ccf1676a-d574-49e7-a847-70cc1a1b9a74", "content": "Former SEC attorney Willie Briscoe and the securities litigation firm of announce that a federal class action lawsuit has been filed against SFX Entertainment, Inc. \n\nFormer United States Securities and Exchange Commission attorney Willie Briscoe, founder of The Briscoe Law Firm, PLLC, and the securities litigation firm of Powers Taylor LLP announce that a federal class action lawsuit has been filed against SFX Entertainment, Inc. (“SFX”) (NasdaqGS: SFXE) and several officers and directors for acts taken during the period of February 25, 2015 and August 17, 2015 (the “Class Period”). \n\nIf you are an affected SFX shareholder with losses in excess of $50,000 and want to learn more about the lawsuit or join the action, contact Willie Briscoe at The Briscoe Law Firm, PLLC via email at shareholders@thebriscoelawfirm.com, Patrick Powers at Powers Taylor LLP via email at shareholder@powerstaylor.com, or call toll free at (877) 728-9607. There is no cost or fee to you. \n\nAccording to the complaint, the defendants are alleged to have violated certain provisions of the Securities Exchange Act of 1934. Specifically, the complaint alleges, among other things, that defendants issued a series of materially false and misleading statements in connection with a proposed acquisition of SFW by Robert F.X. Sillerman, the Company’s Chief Executive Officer and largest shareholder. According to the complaint, although Sillerman repeatedly affirmed his commitment to acquire SFW, he and other executive officers knew or recklessly disregarded, and failed to disclose to shareholders, that he did not have the requisite financing in place at the time he made his proposal to acquire the Company, and that he would not be able to obtain the required financing to consummate the transaction. The complaint alleges that, given SFX’s growing debt and decreasing margins, an acquisition by Sillerman was not feasible and that Sillerman initiated and maintained a sham process designed to lure third party buyout offers in an attempt to shed his personal investment before the truth about the deterioration of SFX’s finances could no longer be concealed. SFX stock dropped significantly immediately following the announcement of the deal termination. \n\nThe Briscoe Law Firm, PLLC is a full service business litigation, commercial transaction, and public advocacy firm with more than 20 years of experience in complex litigation and transactional matters. \n\nPowers Taylor LLP is a boutique litigation law firm that handles a variety of complex business litigation matters, including claims of investor and stockholder fraud, shareholder oppression, shareholder derivative suits, and security class actions. \n\nView source version on businesswire.com: http://www.businesswire.com/news/home/201509290066", "source": "Reliance Trust"}