{"published": "2015-09-28T20:00:18Z", "media-type": "News", "title": "Cavs, Thompson fail to reach deal", "id": "f5201eb8-cd77-46a6-b13e-a7d0f8b8b8a1", "content": "The Cleveland Cavaliers and restricted free agent Tristan Thompson are still at an impasse on a new contract with training camp starting this week. \n\nThompson missed the team's media day on Monday. \n\nThe Cavs did not accept Thompson's most recent offer of a three-year maximum contract that his side proposed last week, according to ESPN.com. Thompson likely will miss the start of practice on Tuesday. \n \n\"We love Tristan Thompson and we want him to be part of our future,\" general manager David Griffin said Monday. \"I think everything in our actions and our offer indicate that. ... We're excited about moving forward with him into the future in whatever form that may take. \n\n\"There's nothing lost by what Tristan is doing in this process. This is his right to do this. This system works for a reason.\" \n\nThe 6-foot-10 Thompson has until Thursday to accept the Cavs' one-year qualifying offer of $6.9 million to become an unrestricted free agent next year if no deal is reached. \n\nThe Cavs have made different offers over the summer, going as high as $16 million in an average annual salary, according to ESPN. Thompson wants a three-year, $53 million max contract or a five-year deal for $94 million. \n\nThe 24-year-old Thompson averaged 8.5 points and 8.0 rebounds during the 2014-15 regular season when he was the Cavs' sixth man. After Kevin Love was injured in the first round of the playoffs, Thompson started at power forward. In the NBA Finals against the Golden State Warriors, he averaged 11.6 points and 12.6 rebounds. \n\nCavs star LeBron James was asked about Thompson's situation at the team's media day. \n\n\"As the leader of this team, I understand how important Tristan is to this team,\" James said Monday. \"I think we all saw what he's able to do in the postseason, and not only the postseason but all throughout. ... He's a huge piece to the puzzle, to our success. Not having him here today, possibly tomorrow or however long it is, that the organization and Tristan, they'll get something done. We all know how important he is to our success.\"", "source": "Channel4000"}