{"published": "2015-09-28T15:57:55Z", "media-type": "News", "title": "CSX Given Consensus Recommendation of “Buy” by Brokerages (NYSE:CSX)", "id": "10fbaa55-7c48-4e3a-8000-51978757c35e", "content": "Filed Under: Consensus Rating Articles • Market News \n\nCSX (NYSE:CSX) has been assigned a consensus recommendation of “Buy” from the nineteen research firms that are presently covering the stock, MarketBeat reports. Seven research analysts have rated the stock with a hold rating and eleven have given a buy rating to the company. The average twelve-month target price among brokerages that have issued a report on the stock in the last year is $37.14. \n\nShares of CSX (NYSE:CSX) traded down 0.08% on Monday, reaching $26.50. 2,819,817 shares of the company’s stock were exchanged. The stock’s 50-day moving average price is $28.04 and its 200-day moving average price is $32.42. CSX has a 1-year low of $24.47 and a 1-year high of $37.99. The company has a market capitalization of $26.07 billion and a P/E ratio of 13.25. \n\nCSX (NYSE:CSX) last issued its quarterly earnings results on Tuesday, July 14th. The transportation supply company reported $0.56 earnings per share for the quarter, topping analysts’ consensus estimates of $0.53 by $0.03. The company earned $3.06 million during the quarter, compared to analyst estimates of $3.12 billion. The company’s revenue was down 5.5% on a year-over-year basis. During the same period in the prior year, the company posted $0.53 earnings per share. Analysts anticipate that CSX will post $2.02 EPS for the current fiscal year. \n\nThe company also recently announced a quarterly dividend, which was paid on Tuesday, September 15th. Investors of record on Monday, August 31st were given a dividend of $0.18 per share. This represents a $0.72 dividend on an annualized basis and a dividend yield of 2.71%. The ex-dividend date was Thursday, August 27th. \n\nA number of analysts have recently weighed in on the stock. Barclays dropped their target price on shares of CSX from $35.00 to $34.00 and set an “equal weight” rating on the stock in a report on Monday, June 8th. Zacks lowered shares of CSX from a “hold” rating to a “sell” rating in a report on Tuesday, June 9th. Susquehanna dropped their price objective on shares of CSX from $40.00 to $39.00 and set a “positive” rating on the stock in a research note on Wednesday, June 10th. Citigroup Inc. reissued a “buy” rating and issued a $37.00 target price (down from $38.00) on shares of CSX in a research report on Thursday, July 2nd. Finally, Credit Suisse reaffirmed an “outperform” rating and set a $36.00 price objective (down from $37.00) on shares of CSX in a report on Thursday, July 2nd. \n\nIn related news, Director David M. Ratcliffe bought 1,868 shares of the company’s stock in a transaction on Tuesday, September 1st. The shares were purchased at an average cost of $26.84 per share, for a total transaction of $50,137.12. Following the acquisition, the director now owns 1,868 shares of the company’s stock, valued at approximately $50,137.12. The purchase was disclosed in a filing with the SEC, which is available at this link. \n\nCSX Corporation (NYSE:CSX), together with its subsidiaries, is a transportation company. The Firm provides rail-based transportation services, including the transport of intermodal containers and trailers and also conventional rail service. The Company has three lines of business: coal business products company as well as the intermodal business. The Business’s merchandise business transports aggregates (which include crushed stone, sand and gravel), alloy, phosphate, fertilizer, food, consumer (manufactured goods and appliances), agricultural, automotive, paper and chemical products. Its coal business transports domestic coal, coke and iron ore to electricity-generating power plants, steel manufacturers and industrial plants, along with export coal to deepwater port facilities. Through a network of around 50 terminals, the intermodal business serves markets east of the Mississippi and transports manufactured consumer goods in containers, supplying truck- like services for shipments that are longer. \n\nReceive News & Ratings for CSX Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for CSX and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News"}