{"published": "2015-09-15T13:00:00Z", "media-type": "News", "title": "Boeing Begins Final Assembly of First 737 MAX", "id": "812122dc-8b55-4226-b424-15278e188246", "content": "RENTON, Wash. , Sept. 15, 2015 /PRNewswire/ -- Boeing [NYSE:   BA] employees in Renton, Wash. , have started final assembly on schedule of the first 737 MAX 8, the first member of Boeing's new, more efficient single-aisle family. \n \n\"We continue to meet our plan on the 737 MAX program thanks to the dedication of our employee team and our suppliers,\" said Keith Leverkuhn , vice president and general manager, 737 MAX program, Boeing Commercial Airplanes. \"We have a lot more work still ahead of us but we're very pleased with our progress to date.\" \n \nAfter the first fuselage arrived on Aug. 21 from Spirit Aerosystems in Wichita, Kan , mechanics began installing flight systems and insulation blankets. \n \n\"It's an honor. There is only one crew that gets to be that first crew that builds that airplane. I'm really excited,\" said Sean Christian , 737 MAX Electrical team lead.   \n \nCrews next moved the fuselage to the wing-to-body join position on the new production line where the first MAXs will be built. Mechanics then attached the wings to the body of the airplane. \n \nThe wings feature Boeing's new Advanced Technology winglets. Designed exclusively for the 737 MAX, they will give customers up to 1.8 percent additional fuel-efficiency improvement over today's inline winglet designs. \n \n\"Seeing the new winglet design we validated in the wind tunnel years ago now on the first new airplane is incredible,\" said Leverkuhn. \"It's just one of the features that differentiate the 737 MAX and make it an amazingly fuel-efficient machine.\"  \n \nBoeing will build the first 737 MAXs exclusively on the new production line in the Renton factory. Once mechanics prove out the production process, the team will extend MAX production to the other two final assembly lines in Renton . \n \n\"The opening of a brand new production line in Renton increases our flexibility and capacity, allowing this incredible team to continue to meet our customers' need for the world's most reliable single-aisle airplanes, well into the future,\" said Scott Campbell , vice president and general manager, 737 program and Renton site leader, Boeing Commercial Airplanes. \n \nThe 737 MAX team remains on track to roll out the first completed 737 MAX by the end of the year and fly it in early 2016. Launch customer Southwest Airlines is scheduled to take delivery of the first 737 MAX in the third quarter of 2017. In total, the 737 MAX family has 2,869 orders from 58 customers worldwide. \n \nContact:  \nLauren Penning  \n737 MAX Communications \n+1 425-306-3691 \nlauren.l.penning@boeing.com   \n \nwww.boeing.com   \n \n  \n \nSOURCE  Boeing \n \nRELATED LINKS \nhttp://www.boeing.com", "source": "PR Newswire"}