{"published": "2015-09-04T15:53:42Z", "media-type": "Blog", "title": "Money Management Tips From Seven Young Kapamilya Stars", "id": "9fab44c7-196d-4193-90af-9c4f8d1ae39b", "content": "The best people to ask about managing finances are the ones that make lots of it in the shortest amount of time like our well-known local showbiz personalities and big time athletes. Because they receive payments on a per-project basis, sound financial management is needed so that all their hard-earned money will not go to waste. We all know that managing money is not easy, especially with a lot of temptations around – from payday sales in malls to splurges for the must-see and must-haves of the season. A bright and secured future may seem hard to attain, but with self-discipline and enough knowledge on financial management, being money-wise is achievable at a young age-whether earnings are big or small. Other than the basic tip, “save for the rainy days,” here are money management tips from seven young popular Kapamilya Stars that anyone can try: Daniel Padilla In a KrisTV interview, Karla Estrada shared that Daniel’s earnings go to his mandatory savings account. A mandatory savings account will develop the habit of saving more than spending money, especially among young people. Kim Chiu Kim takes Daniel’s advice up a notch by saving half of her earnings. In a Philippine Star article, she revealed that she saves a big chunk from her earnings because she wants to secure her future. Julia Barretto At her young age, Julia is already learning the basics of investing from her mom, Marjorie Barretto. She shared in an online entertainment site that her mother is slowly teaching her on properly investing money. Julia also says that she dreams to establish her own business someday, which she says can be a clothing line or a restaurant franchise. Enchong Dee Enchong says that he once tried his luck in the stock market twice, but notes that after he earned, he pulled back his money since he is very careful with losing his hard earned cash, according to a news article. Robi Domingo “The Voice Kids” host Robi also shares the same view with Enchong in investing in stocks, but says in ANC’s “On The Money” that before thinking about growing your money, it is best to know how to manage it first. Robi reveals that he is meticulous with his expenses and keeps an excel file to take note of his expenditures so at the end of the day, he knows the numbers. Matteo Guidicelli Cinema One’s leading man for “Single/Single” and triathlete, Matteo Guidicelli comes from a family of entrepreneurs. In the Philippine Star, Matteo says that he asks advice from his parents on how to save and invest properly so that his money doesn’t go to waste. He is also thinking of starting his own business soon. Shaina Magdayao Matteo’s leading lady for “Single/Single,” Shaina Magdayao is a role model in managing finances wisely. At 25 years old, she already owns several businesses. Recently, Shaina launched an educational after school program called Engineering for Kids with fellow business partners. She shares with ABS-CBNnews.com that kids have a soft spot in her heart that is why she made a wise investment in an educational program that makes learning fun for kids.   About Latest Posts\nFollow Me\nraindeocampo\nTraining Facilitator at TeamCITE\nWriter, Wanderer, Child of God Follow Me\nLatest posts by raindeocampo (see all)\nMoney Management Tips From Seven Young Kapamilya Stars - September 4, 2015 JARDINE Joins Iloilo Construction Expo (ICONEX) 2015 - September 4, 2015 SNEAK PEEK | Asterix: The Mansions of the Gods - September 4, 2015 Money Management Tips From Seven Young Kapamilya Stars Related", "source": "rainCHECK"}