{"published": "2015-09-15T20:15:00Z", "media-type": "News", "title": "A-Mark Precious Metals Maintains $0.05 Per Share Quarterly Dividend for the Fiscal Fourth Quarter 2015", "id": "9d380b03-b93f-4d3b-8683-fe1ba5f688fd", "content": "The board of directors of A-Mark Precious Metals, Inc. (NASDAQ:AMRK), a full-service precious metals trading company, has maintained the company’s regular quarterly cash dividend of $0.05 per share. The cash dividend will be paid on October 5, 2015 to all stockholders of record as of September 24, 2015. \n  \nSANTA MONICA, Calif., Sept.  15, 2015  (GLOBE NEWSWIRE) -- The board of directors of A-Mark Precious Metals, Inc. ( NASDAQ:AMRK ), a full-service precious metals trading company, has maintained the company’s regular quarterly cash dividend of $0.05 per share. The cash dividend will be paid on October 5, 2015 to all stockholders of record as of September 24, 2015. \n\n\nAbout A-Mark Precious Metals \n    \nA-Mark Precious Metals, Inc. is a full-service precious metals trading company and an official distributor for many government mints throughout the world. The company offers gold, silver, platinum and palladium in the form of bars, plates, powder, wafers, grain, ingots and coins. Its Industrial unit services manufacturers and fabricators of products utilizing or incorporating precious metals, while its Coin & Bar unit deals in more than 200 coin and bar products in a variety of weights, shapes and sizes for distribution to dealers and other qualified purchasers. The company operates trading centers in Santa Monica, California, and Vienna, Austria, for buying and selling precious metals. \n \nIn addition to wholesale and trading activity, A-Mark offers customers a variety of services, including financing, consignment and various customized financial programs. As a U.S. Mint-authorized purchaser of gold, silver and platinum coins, A-Mark purchases bullion products directly from the U.S. Mint for sale to customers. A-Mark also has distributorships with other sovereign mints, including in Australia, Austria, Canada, China, Mexico and South Africa. Customers of A‑Mark include mints, manufacturers and fabricators, refiners, coin and metal dealers, banks and other financial institutions, jewelers, investors and collectors. For more information about A-Mark Precious Metals, visit  www.amark.com . \n \nThrough its subsidiary Collateral Finance Corporation, a licensed California Finance Lender, the company offers loans collateralized by numismatic and semi-numismatic coins and bullion to coin and metal dealers, investors and collectors. Through its Transcontinental Depository Services subsidiary, it offers a variety of managed storage options for precious metals products to financial institutions, dealers, investors and collectors around the world. \n \nImportant Causations Regarding Forward-Looking Statements \n \nStatements in this press release that relate to future plans, objectives, expectations, performance, events and the like are \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995 and the Securities Exchange Act of 1934. Future events, risks and uncertainties, individually or in the aggregate, could cause actual results to differ materially from those expressed or implied in these statements. Factors that could cause actual results to differ are identified in the Company’s public filings with the Securities and Exchange Commission (SEC) and include the following: our inability to execute our growth strategy; our inability to maintain the security of customer or company information; the impact of complying with laws and regulations relating to our trading and financing operations; changes in our liquidity and capital requirements; changes in the political or economic environments of the countries in which we do business; the loss of key management or trading personnel; our exposure to commodity price risks, concentration of credit risk, and the risks of default of our counterparties; the demand nature of our credit facility; the possible loss of a key government distributorship arrangement; potential losses in connection with our financing operations; the inability of our historical financial statements to be indicative of our future performance; the impact of increased costs associated with being a public company; our inability to maintain effective internal controls as a public company; our inability or determination not to pay dividends; low trading volume of our capital stock due to limited liquidity or a lack of analyst coverage; and the ability of our principal shareholders to exert substantial control over us or prevent a change of control. \n \nMore information about factors that could affect the Company’s business and financial results included in its public filings with the SEC, are available on the SEC’s website at www.sec.gov . \n \nThe words \"should,\" \"believe,\" \"estimate,\" \"expect,\" \"intend,\" \"anticipate,\" \"foresee,\" \"plan\" and similar expressions and variations thereof identify certain of such forward-looking statements, which speak only as of the dates on which they were made. Additionally, any statements related to future improved performance and estimates of revenues and earnings per share are forward-looking statements. The Company undertakes no obligation to publicly update or revise any forward-looking statements. Readers are cautioned not to place undue reliance on these forward-looking statements. \n \n  \n\nCompany Contact:\nThor Gjerdrum, EVP & COO\nA-Mark Precious Metals, Inc.\n(310) 587-1621 thor@amark.com Investor Relations Contact:\nMatt Glover or Michael Koehler\nLiolios Group, Inc.\n(949) 574-3860 AMRK@liolios.com", "source": "MoneyShow.com"}