{"published": "2015-09-29T01:00:00Z", "media-type": "News", "title": "Boeing, Cathay Pacific Airways Celebrate Milestone 70th 777 Delivery", "id": "81b78af5-f2db-4dbb-b012-59a160a8da94", "content": "EVERETT, Wash. , Sept. 28, 2015 /PRNewswire/ -- Boeing ( NYSE: BA ) and Cathay Pacific Airways celebrated a significant achievement today with the delivery of the airline's 70 th 777 aircraft – also the last and 53rd 777-300ER (Extended Range) of its confirmed orders – that has made Cathay Asia's largest operator of the 777 fleet. \n\nWith today's delivery, Cathay Pacific's 777 aircraft fleet comprises of 53 777-300ERs, 12 777-300s and five 777-200s. The airline is one of the launch customers for the 777X with 21 777-9 airplanes on order. \n   \nCathay Pacific took delivery of its first 777-300ER in September 2007 . This efficient aircraft allows the airline to modernize its long haul fleet with enhanced operational efficiency and extended range with more environmentally friendly features. \n\n\"The 777s have played an important role in Cathay Pacific's fleet modernization and network expansion strategy,\" said Ivan Chu , Chief Executive, Cathay Pacific Airways. \"We operate the largest 777 fleet in Asia , and these aircraft offer the range, reliability and flexibility to build multiple daily frequencies on trunk routes, both within the Asia-Pacific region and, with the 777-300ERs, on long-haul and ultra-long-haul routes. Our 777 fleet has helped in our efforts to reinforce Hong Kong's position as one of the world's most important international aviation hubs.\"  \n\nCathay Pacific group operates flights to nearly 200 destinations worldwide with its own fleet of more than 200 aircraft. \n\n\"We have enjoyed a long-standing relationship with Cathay Pacific on the 777 program,\" said Ihssane Mounir , senior vice president, Northeast Asia Sales, Boeing Commercial Airplanes. \"We are honored to celebrate the delivery of Cathay's 70th 777 and will continue to extend the fruitful partnership over the years with our next generation 777X.\" \n\nThe 777-300ER, which makes up the largest part of the Cathay Pacific fleet, is one of the most fuel and cost-efficient airplanes in its class as well as the most reliable twin-aisle aircraft in the world. It also has the highest cargo capability of any passenger airplane in service. The 777-300ER will receive further improvements in 2016 designed to reduce fuel use by 2 percent. \n\nThe 777-300ER has consistently won many accolades including \"Best Aircraft Type\" based on passenger preference polls, \"Best in Class\" based on fuel burn, passenger load cost and performance and \"Best Residual Value for a Twin Aisle Airplane\" among others. \n\nPhotographs are available here: http://boeing.mediaroom.com and www.cathaypacific.com . \n\nContacts: \n\n\n\n\nKevin Yoo \n\nThomas Lau \n\nInternational Communications \n\nCorporate Communication Manager International \n\nBoeing Commercial Airplanes \n\nCathay Pacific Airways \n\n+1 206 249 6372 \n\n+852 2747 5360 \n\nkevin.k.yoo@boeing.com  \n\nthomas_lau@cathaypacific.com  \n\n\nwww.cathaypacific.com \n\n\n\nYukui Wang \n\n\nChina Communications \n\n\nThe Boeing Company \n\n\n+86(10)-59255505 \n\n\nYukui.wang@boeing.com  \n\n\n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/boeing-cathay-pacific-airways-celebrate-milestone-70th-777-delivery-300150188.html \n\nSOURCE  Boeing", "source": "Vision Monday"}