{"published": "2015-09-08T16:09:15Z", "media-type": "News", "title": "Vancouver-born teenager forward learning with Manchester United under-21 team", "id": "0044e331-86fc-4abf-924b-52d3dbc0b65c", "content": "TORONTO - Just 18, Josh Doughty is rubbing shoulders with some of soccer's elite. \n\nThe Vancouver-born forward is honing his skills in England with Manchester United's under-21 team. Doughty signed in January 2014, eventually joining the storied club in November after getting his international clearance. \n\n\"It was a dream come true,\" Doughty said after a recent training session with the Canadian under-20 team. \"It's what I expected. It's really high-level, challenges you every day. It's a great place to learn. \n\n\"So it's the right place to be if you want to improve your game.\" \n\nPractice can involve lining up with members of the first team squad. \n\n\"You start to get used to it, but at the beginning I was thinking 'Oh my God.' You're in close proximity with all these great players and you can just learn off them, playing with and against them so it's great.\" \n\nBorn in Canada to British parents, Doughty was four when he moved to Arizona where he grew up. His father's work with an aerospace company took him to Canada and the U.S. \n\nAs a result, Doughty holds three passports. While he has joined Canadian age-group teams the last three years, he is not yet tied to a national program. \n\n\"I probably have some choices to make in the future but for now I'm just focused on Canada,\" he said. \n\nCanada clearly wants to keep the lanky Doughty wearing the Maple Leaf. \n\n\"He's very light of foot, a very technical player,\" said under-20 coach Rob Gale. \"Great in close quarters.\" \n\nThe teenager can also play a variety of roles, including forward, box-to-box midfielder and as a No. 10. \n\n\"He's almost in that Berbatov mould,\" he said, referencing Bulgarian and PAOK star Dimitar Berbatov. \"In close control, tight quarters, (he) works the ball very nicely.\" \n\nGale, who holds British and Canadian citizenship himself, says he has a good relationship with the Doughty family. He hopes Canada's commitment to and investment in Doughty and others will reap rewards. \n\nDoughty joined Real Salt Lake's residential developmental academy, which was based in Arizona. He spent two seasons there, helping Salt Lake to the U.S under-16 title in 2012-13, and was spotted by Manchester United at the Generation Adidas Cup, MLS's youth championship. \n\nHe went over for a trial and signed. His family is now in the process of joining him in England. \n\nIn addition to Canadian-based talent, Gale's under-20 player pool also includes Harry Paton from Fulham's under-18 academy and Yuri dos Santos, who is in the Ajax system. He also has players in the Chelsea and Stoke systems who were unable to attend the most recent camp. \n\nGale's team is working towards qualification for the FIFA U-20 World Cup Korea Republic 2017. \n\n——— \n\nFollow @NeilMDavidson on Twitter \n \n©", "source": "Estevan Mercury"}