{"published": "2015-09-21T11:38:02Z", "media-type": "News", "title": "Thousands of runners enjoy \"fantastic\" Worcester City 10k SUPER mum Jo Pavey lived up to her star billing by winning the women’s race as thousands of athletes and fun runners enjoyed the “fantastic” Worcester City 10k. (14)", "id": "5cb34899-1147-4dc8-a146-cdc77a0baf59", "content": "SUPER mum Jo Pavey lived up to her star billing by winning the women’s race as thousands of athletes and fun runners enjoyed the “fantastic” Worcester City 10k. \n \nThe European 10,000-metre champion, who crossed the finish line in 33 minutes 11 seconds, praised the city for providing an “amazing atmosphere” and a “brilliant event” on Sunday (September 20). \n \nShe beat local favourite and third placed Jenny Nesbitt, of Barbourne, by just 32 seconds while Kenyan Vincent Boit was overall winner in 28 minutes and 41 seconds. \n \n Click here for the Worcester City 10k photo gallery.  \n \nBut it wasn’t all about the elite runners. \n \nThousands of amateurs took part, achieving personal bests and raising money for charity, and the streets were lined with enthusiastic supporters cheering on their friends and family. \n \nOne romantic couple even got engaged on the finish line to cap off of a great day for the city of Worcester. \n \nJo Pavey, who celebrated her 42nd birthday with a win, said: “I really enjoyed it – the conditions were great and it was a competitive race. \n \n“The atmosphere was amazing and the people of Worcester really got behind the event, which offers a beautiful scenic course. \n   Promoted stories   \n“I’d like to say well done to everyone who took part. \n \n“It has been a fantastic day and being able to run in Worcester has been a lovely birthday treat for me.” \n \nWorcester’s own Jenny Nesbitt, who beat Paula Radcliffe in last year’s race, achieved a personal best of 33 minutes and 43 seconds, finishing as third fastest female behind Jo Pavey and Hildah Cheboi. \n \nShe said: “There’s been an absolutely amazing atmosphere – the crowds were really great. \n \n“I am so happy with my performance, which will put me in a great place for the season ahead. \n \n“To run with Jo, who has achieved so much and is a real inspiration, was also very special. \n \n“The people of Worcester have supported me brilliantly and it doesn’t get much better than racing in your home city.” \n \nMayor of Worcester Councillor Roger Knight, who sounded the buzzer to start the races, added: “This event has really put the pulse back into Worcester. \n \n“To see about two and a half thousand committed runners enjoying the day out has been great. \n \n“The mist lifted and the sun came out for a beautiful finish – this is Worcester at its best.” \n \nNumerous runners also took to social media to show off their personal bests and post 10k selfies. \n \nJack Styles posted an image of him celebrating at the finish with his medal, adding “Four or five months ago I couldn't comfortably run a kilometre - I will be milking this.” \n \nOn Twitter @MissPond wrote “the crowds in Worcester were amazing - so much support and a fab route” while @nickyprice summed it up with “perfect day, great course, big crowds - will definitely be back next year”. \n \nThe race however took on an even more poignant meaning for two participants. \n \nScott Maybury, 31, of Stourbridge, proposed to his partner Sarah Westwood, 33, at the finish line – and she said yes. \n \nMiss Westwood told the Worcester News : “It was a big surprise – I’m happy and excited. \n \n“We hope to get married abroad on the beach. \n \n“I have had some bad health problems in the past so to finish the 10k was a real accomplishment – and now with the engagement it’s like a double bonus. \n \n“It was a lovely course and it was great hearing the crowds cheer us on.” \n \nAnother heart-warming tale came from a Worcester-based charity. \n \nSixty-three runners took on the 10km course for the Worcestershire Association of Carers, representing the 63,000 unpaid carers across the county. \n   \n Share article  \n   \nThe participants wore distinctive branded t-shirts and were cheered loudly by the crowds, as the city of Worcester showcased its charitable side. \n \nMeanwhile children took centre stage during the young athletes run and fitness fanatics completed the epic 40km duathlon.", "source": "Droitwich Spa Advertiser"}