{"published": "2015-09-26T15:09:30Z", "media-type": "News", "title": "The Latest: Castro hails US-Cuba thaw", "id": "8b33e28d-31cd-4bd9-b996-5c96f4dc9f0b", "content": "UNITED NATIONS La\n\nLatest developments at the United Nations summit on the adoption of an ambitious blueprint to eradicate extreme poverty and other global goals. (All times local).\n\n---\n\n10:45 a.m.\n\nCuban President Raul Castro says the re-establishment of diplomatic relations between his country and the United States constitutes \"major progress,\" but the U.S. economic blockade against Cuba is the \"main obstacle\" to his country's development.\n\nCastro's speech to a gathering of world leaders at the U.N. General Assembly on Saturday was his first appearance before the world body. He spoke to a summit that adopted a sweeping agenda for global development includes the goal of eliminating poverty in 15 years.\n\nThe General Assembly will vote as early as next month to demand the American embargo's end. But this time, U.S. officials have told The Associated Press that the United States could abstain instead of voting against the resolution.\n\nCastro says the embargo \"is rejected by 188 U.N. member states.\"\n\n---\n\n9:55 a.m.\n\nPresident Hassan Rouhani of Iran is expressing regret over the \"heart-rending\" trampling to death of hundreds of Muslim pilgrims near a Saudi Arabia holy site this week and calling for a swift investigation into it and similar incidents.\n\nThe crush killed more than 700 people and was the worst hajj disaster in a quarter-century.\n\nRouhani addressed the U.N. General Assembly during a development summit Saturday and in advance of his address on Monday to world leaders, including President Barack Obama.\n\nRouhani also linked violence against man and violence against nature, saying that \"terrorists, in fact, tend to grow and thrive in lands deprived and damaged by environmental disasters and easily pour across borders like haze.\"\n\nHe said the recent Iran nuclear deal has created \"suitable conditions for regional and international cooperation.\"", "source": "Star-Telegram"}