{"published": "2015-09-22T14:02:29Z", "media-type": "News", "title": "Pancake Parlour employees win penalty rates for late nights, weekends", "id": "45771a20-f47b-44be-96ce-f67a39d00dbd", "content": "Hundreds of Pancake Parlour workers have won weekend and late-night penalty rates in a case that goes to the heart of a contentious national wage debate. \n\nThe pancake chain had its WorkChoices-era wage deal terminated last week in favour of the restaurant industry award, which is expected to raise the pay of up to 750 employees nationally. \n\nMost staff covered by the old deal have been paid flat rates between $13 and $23 an hour but miss out penalty rates for nights and weekends. \n\nAn analysis of pay rates shows some waiters could have been up to $2500 a year worse off compared to the award. \n\nThe case comes amid a tense feud over a proposed nationwide rollback of Sunday penalty rates, in which unions argue low-paid workers rely on the extra money for sacrificing weekends. Businesses say they struggle to keep operating under current costs in a seven-day-a-week economy and are urging new Prime Minister Malcolm Turnbull to aggressively advocate for reform before the next election. \n\nMr Turnbull has drawn attention over comments last year about the impact of penalty rates: \"You see businesses, particularly hospitality businesses like cafes and restaurants and so forth, closed on weekends ... because the penalty rates are so high,\" he said. \"Now that's nuts.\" \n\nUnion members will rally in Melbourne on Wednesday against what they say is a continued attack on low-paid workers. \n\nIn pursuit of better conditions, Pancake Parlour employee Tim Sarder, 21, launched legal action last month to replace the company deal with full award entitlements. The company did not oppose the application. \n\n\"Every day the current contract continues to operate, [we] are working under a contract that does not meet the safety net of minimum wages or employment conditions,\" Mr Sarder said. \n\nThe Pancake Parlour told the tribunal that scrapping the agreement would force it to review the trading hours of its 24-hour outlets and those that close at 3am. Management would also consider revoking free staff meals and warned it might be forced to lay off restaurant supervisors in favour of more casuals. \n\nPancake Parlour managing director Mandy David said the biggest challenge would be striving to offer the same level of work-pattern flexibility that employees wanted. \n\nShe said management was consulting every staff member individually as it moves off the old agreement. \n\n\"Paying our staff properly is a priority,\" she said. \"If our wage costs go up, they go up. \n\n\"We are proud of our strong relationship with our team.\" \n\nFair Work Commissioner Julius Roe said Pancake Parlour employees would be entitled to a range of benefits under the restaurant award that they were not receiving under the WorkChoices agreement, including penalty rates, greater certainty of working hours, minimum breaks between shifts and laundry costs. \n\nHospitality union United Voice said it was uplifting to see young workers such as Mr Sarder standing up for workplace rights. \n\n\"His courage means that hundreds of Pancake Parlour staff will now get the weekend penalty rates they deserve,\" union state secretary Jess Walsh said. \n\n\"The Pancake Parlour did not oppose Tim's campaign and that's a good thing ... other employers should follow their example.\" \n\nEmployer group Restaurant and Catering Australia said the existing penalty rates regime was causing business closures and suppressing productivity. \n\nn.toscano@fairfaxmedia.com.au", "source": "Stock Journal Australia"}