{"published": "2015-09-17T08:43:05Z", "media-type": "News", "title": "Young Liberal meeting boils over as verbal clashes turn physical after leadership spill", "id": "dbec7fe2-b3ff-4fac-b22f-77bfbf735edc", "content": "Politics is a blood sport in Canberra. But inside the Young Liberal movement it gets even more serious than that. Politics is a blood sport in Canberra. But inside the Young Liberal movement it gets even more serious than that. On the night after the Malcolm Turnbull v Tony Abbott leadership spill, a Young Liberal meeting in Sydney erupted into wild scenes, with allegations a member of the Abbott-backing conservative faction physically assaulted a Turnbull-supporting moderate.\n\nAn official complaint was lodged with the NSW Liberal Party on Thursday morning, following the event at the City Tattersalls Club on Pitt Street on Tuesday. A spokeswoman for state director Tony Nutt said: \"Sorry, we won't be saying anything.\"\n\nAlmost 100 people are said to have witnessed the altercation as the factions divided in support of the contenders in Canberra.\n\nFairfax Media has learned that James Camilleri, a member of the moderates, has claimed the hard-right's Jakov \"Jay\" Miljak grappled with him after a fiery debate over female quotas in the party.\n\nThe temperature in the room had already risen to boiling point as conservatives argued against a motion congratulating Mr Turnbull on becoming the new Prime Minister.\n\nMr Miljak, a staffer for the conservative senator Concetta Fierravanti-Wells, is alleged to have grappled with Mr Camilleri in a \"push punch\" incident against the wall of the meeting room.\n\nA Young Liberal in the room said there was some \"pushing and shoving\" before others intervened. \"The whole room had to stop. They were dragged apart by their colleagues,\" the source, who is not factionally aligned, said.\n\nMr Miljak, who has been asked for comment through Senator Fierravanti-Wells' office, had been arguing against quotas to raise the representation of females in the parliamentary ranks of the Liberals.\n\nIt is not the first Young Liberal event that has descended into ugly scenes and controversy.\n\nTuesday's meeting was the first under the presidency of Alex Dore, one of the organisers of the infamous 2012 Sydney University Liberal Club dinner at which broadcaster Alan Jones claimed former prime minister Julia Gillard's father had \"died of shame\".\n\nJones has compared Mr Dore to a young John Howard and backed him against moderate candidate Craig Laundy for preselection in the Sydney seat of Reid before the 2013 election. Mr Dore worked as a staffer to NSW minister Pru Goward.\n\nIn 2014, the stalls of the right-aligned Conservative Club and the moderate SULC had to be separated after an orientation week brawl at Sydney University.\n\nAnd in 2009, police had to break up a Young Liberal event amid brawling and claims former state upper house Liberal Marie Ficarra, a member of the hard right, had made a \"throat slitting\" gesture - an allegation she denied and called an \"outrageous slander\".\n\nAn attendee at Tuesday's function said the mood was \"particularly unruly\" after Mr Abbott lost his grip on the leadership.\n\n\"There was a lot more shouting than normal. Alex [Dore] obviously doesn't know how to control the room.\"\n\nMr Camilleri could not be reached for comment and Mr Dore declined to comment when contacted.\n\nFollow us on Twitter The story first appeared on The Sydney Morning Herald.", "source": "Port Macquarie News"}