{"published": "2015-09-29T12:00:00Z", "media-type": "News", "title": "Clean Coal Technologies, Inc. to Hold Business Update Call on October 13, 2015", "id": "40c0fab8-6880-4a73-8fe8-0c90d4d08689", "content": ") - . (OTCQB: CCTC) (\"CCTI\" or the \"Company\"), an emerging cleaner-energy company utilizing patented technology to convert raw coal into a cleaner burning and more efficient fuel, today announces that its management team will host a corporate business update conference call and webcast to review recent accomplishments and key near-term milestones related to the commercial validation of CCTI's Pristine-M coal dehydration technology. Details of the call are below: \n\n-------------------------------------------------------- Clean Coal Technologies Conference Call & Webcast -------------------------------------------------------- Date: 10/13/2015 -------------------------------------------------------- Time: 10:00 AM ET -------------------------------------------------------- Domestic Toll-Free Dial-In: (866) 373-3408 -------------------------------------------------------- International Dial-In: (412) 902-1039 -------------------------------------------------------- Conference Call Replay -------------------------------------------------------- Conference ID: 13621306 -------------------------------------------------------- Domestic Replay Dial-In: (877) 660-6853 -------------------------------------------------------- International Replay Dial-In: (201) 612-7415 -------------------------------------------------------- \n\nYesterday CCTI released the first photos of its assembled Pristine-M demonstration plant located at AES Corporation's Shady Point Facility, near Panama, Oklahoma. The pictures can be viewed on CCTI's website at www.cleancoaltechnologiesinc.com. \n\nIn the coming weeks CCTI will have the 2 ton/hour demonstration plant commissioned by Leidos and expects to fully validate the Pristine-M technology at commercial scale. \n\nAbout Clean Coal Technologies, Inc. \n\nClean Coal Technologies, Inc., a cleaner-energy technology company with headquarters in New York City, NY, holds patented process technology and other intellectual property that converts raw coal into a cleaner burning fuel. The Company's trademarked end products, \"Pristine(tm)\" coals, are significantly more efficient, less polluting, more cost-effective, and provide more heat than untreated coal. The principal elements of the Company's pre-combustion technology are based on well-proven science and tried-and-tested industrial components. The Company's clean coal technology may reduce some 90% of chemical pollutants from coal, including Sulfur and Mercury, thereby resolving emissions issues affecting coal-fired power plants. For more information about Clean Coal Technologies please visit: www.cleancoaltechnologiesinc.com \n\nForward Looking Statements \n\nThis release may include forward-looking statements related to CCTI's plans, beliefs and goals, which involve certain risks and uncertainties that could cause actual results to differ materially from those in the forward-looking statements. Such statements include, but are not limited to, statements about CCTI's plans, objectives, expectations and intentions with respect to future operations, its products, its ability to secure financing for its operations, the impact on the industry and other statements identified by words such as \"will,\" \"potential,\" \"could,\" \"can,\" \"believe,\" \"intends,\" \"continue,\" \"plans,\" \"expects,\" \"anticipates,\" \"estimates,\" \"may,\" and other words of similar meaning or the use of future dates. Additional details about CCTI's business and its operations that could affect CCTI's actual results are described in CCTI's filings with the Securities and Exchange Commission, including the \"Risk Factors\" that are part of its most recent annual report on Form 10-K for the year ended December 31, 2014 and in each of its subsequently filed periodic reports. All forward-looking statements in this release speak only as of the date of this news release. CCTI undertakes no obligation to update or revise any forward-looking statement, whether as a result of new information, future events or otherwise.", "source": "Reliance Trust"}