{"published": "2015-09-07T05:32:00Z", "media-type": "News", "title": "2GB Shock jock Alan Jones condemns the Abbott government's plan to change environmental law  ", "id": "3ae97c9c-1135-4b37-afaf-928a4b5429eb", "content": "Alan Jones  denounced Tony Abbott's government in a new campaign If passed, it will only allow people directly affected by land developments Mr Jones called the proposed change 'a decisive move' Tony Abbott says the changes are essential for jobs and economic growth   \nBroadcaster Alan Jones has criticised the Tony Abbott's  plans to introduce new environmental laws which favour mining companies over environmentalists. \n\nMr Jones, normally a staunch supporter of Mr Abbott and his Liberal government, is the figurehead of a new campaign against the proposed environmental legislation. \n\nThe proposed change will only allow those directly impacted by a proposed mine to challenge it in court, according to  The Guardian .  \n\n   \n   \nControversial 2GB broadcaster Alan Jones has been known to be a staunch political ally of Tony Abbott \n   \nMr Jones has become the face of a campaign against the Abbott government's proposed change to environmental legislat \n\nMr Abbott says the changes - which would limit the types of groups that could challenge major projects in the courts - are essential for jobs and economic growth.  \n\nBut in the advertisement, Mr Jones tears into the proposed changes as an assault on Australia's democracy.  \n\n'I may live nowhere near the Liverpool Plains or the Great Barrier Reef but I sure as hell am concerned that they are protected,' Mr Jones he says. \n\nMr Jones described the government's proposed changes to the Environmental Protection and Biodiversity Conservation Act as a 'simply unbelievable' attack on the environment. \n\n'This legislative restriction is divisive, it isolates us. It means we are not allowed to care,' Mr Jones said.  \n   \nMr Abbott believes that the change will be beneficial to jobs and economic growth \n   \nMr Jones has expressed that the removal of a section of the Environmental Protection and Biodiversity Conservation Act will be a bad move for the environment and democracy \n\nMr Abbott argues repeal of section 487 of the Environmental Protection and Biodiversity Conservation Act will stop environmental 'vigilantes'.  \n\n'We are determined to ensure that developments such as the Carmichael mine in Queensland can go ahead in Queensland because investment in jobs are absolutely necessary for our economy,' Abbott told reporters in Canberra on Monday. \n\nWhile this is an unusual move by Mr Jones, it is not the first time he has opposed the Liberal party in relation to environmental issues. \n\nIn the 2015 Queensland election Mr Jones was very outspoken about mining approvals in the agricultural region of Darling Downs made by the Newman Government, according to a report by SMH .   \n\nThe campaign, which began running on Sky News on Monday, was authorised by the Lock the Gate alliance and is seeking to protect prime agricultural land and water resources. \n   \nThe Lock the Gate alliance authorized the campaign which seeks to protect prime agricultural land and water resources  \n\n  \n\n  \n\n ", "source": "Mail Online UK"}