{"published": "2015-09-02T19:14:22Z", "media-type": "News", "title": "Southern Miss gets rare shot to host an SEC opponent", "id": "926c4345-b5c9-4254-a50a-c352075d5907", "content": "We also have more stories about: \n(click the phrases to see a list) \n \nPeople: \n\nOrganizations: \n\nSubjects: \n\nPlaces: \n   \nHATTIESBURG, Mississippi — Southern Mississippi is about to host a Southeastern Conference opponent for the first time in more than a quarter century. \n \nIt remains to be seen if the Golden Eagles are ready for it. \n \nThe game against Mississippi State — the first SEC foe to venture to Roberts Stadium since 1989 — is a crucial moment for a program trying to prove it's ready to be relevant again after suffering through a football nightmare the past three seasons. \n \n\"I've thought a lot about it,\" Southern Miss quarterback Nick Mullens said. \"It's not only a big football game, but it's a huge event for the community. For us to put on a good showing and play well would be awesome.\" \n \nIt won't be easy. \n \nMississippi State is a three-touchdown favorite on Saturday and has a Heisman Trophy candidate in quarterback Dak Prescott. The Bulldogs, which spent five weeks as the No. 1 team in the country last fall, embarrassed the Golden Eagles 49-0 last season in Starkville. \n \nThat afternoon was another harsh reminder of how far Southern Miss has fallen. In 2011, the Golden Eagles won a Conference USA championship, finished with a 12-2 record and were the No. 20 ranked team in the nation. \n \nSince then the numbers are ugly: A 4-32 overall record, including a winless season in 2012. \n \nBut third-year Southern Miss coach Todd Monken says his team has much more talent than it did a year ago. An influx of junior college talent and more depth along the offensive and defensive lines should help against the Bulldogs. \n \nA near capacity crowd of 36,000 at \"The Rock\" will be on hand to see if the Golden Eagles have improved. It's safe to say many won't be back if Southern Miss can't at least put up a fight. \n \nMonken is well aware this is one of the most important games of his tenure. \n \n\"Is it everything? No. Is it big? Yeah,\" Monken said. \"It's big in the fact that it's a barometer. It's a barometer to where you're at and what your fans can expect to see.\" \n \nMississippi State's players insist they have a healthy respect for the Golden Eagles even if last year's game wasn't competitive. \n \n\"It's not an SEC opponent but it's going to be a big stadium,\" Prescott said. \"They're going to fill it up and do everything they can to make it loud so they can get to us.\" \n \nSouthern Miss has slowly improved during Monken's time in Hattiesburg. The Golden Eagles had a 3-9 season last fall after a 1-11 mark in 2013. \n \nNow Monken and his players insist six wins and a bowl berth are a very realistic goal. Beating Mississippi State — or at least making the game competitive — would certainly serve notice that it's a possibility. \n \n\"I can tell you that I'm a better head coach — we have done better with things this offseason,\" Monken said. \"We have recruited better and we have more talent. Now we have to be able to put it on the field.\" \n \nFollow David Brandt on Twitter: http://www.twitter.com/davidbrandtAP", "source": "Greenfield Daily Reporter"}