{"published": "2015-09-02T22:42:30Z", "media-type": "News", "title": "Board Agrees With Vermont On Need For Hearing On Decommissioning Fund Use", "id": "bbdf5b27-fc30-4501-a636-91de0647321c", "content": "The Atomic Safety and Licensing Board has agreed with Vermont that a hearing is needed over the Vermont Yankee nuclear plant's use of money from its decommissioning fund for management of radioactive waste at the plant site. \n \nThe Nuclear Regulatory Commission panel of technical experts has ruled against claims by the NRC and Entergy, the owner of the Vermont Yankee Nuclear Power Plant, that the state of Vermont had no standing to demand a hearing.  Vermont officials have been complaining for the past year that Entergy has been pushing using decommissioning funds for a use that wasn't contemplated when the fund was set up.  The state says the plant wants to divert the money to pay for spent fuel storage. \n \nEntergy Vermont Yankee Spokesman Marty Cohn.  “What the situation is is that all that we are required to do is to notify that a withdrawal is being made and under what circumstances we are withdrawing the money.  What the ASLB admi-ah-said in determining that there should be a hearing, they did not give any judgments as to the actual arguments put forth by the state.  They simply said there’s enough there to warrant a hearing. They didn’t rule on whether or not the argument had any merit.” \n \nAmerican Nuclear Society retired nuclear engineer and consultant Howard Shaffer explains there are two separate streams of money – the decommissioning and the spent fuel storage funds — that are getting tangled in this argument.  “In the case of Vermont Yankee, which is a merchant generator as opposed to a utility where there are other owners and ratepayers that could provide additional funds if money ran out, the really only immediately available money is the decommissioning fund and the state is concerned that that might run out before the plant is decommissioned.” \n \nNew England Coalition Trustee Clay Turnbull says Entergy chose not to move the fuel into casks while the plant was in operation, where it would have been an operating cost.   “For Entergy to avoid paying the spent fuel management costs out of their own accounts to move that fuel, Entergy has asked the NRC for an exception to the rule that says the money in the decommissioning fund can only be used for decommissioning. So the only reason that the two get mixed up is that Entergy has requested permission to use the decommissioning money for the spent fuel.” \n \nCitizens’ Awareness Network Executive Director Deb Katz believes the NRC would violate its own regulations if it allows Entergy to use money that is not for radiological cleanup.   “This is a terrible precedent and the only reason it’s happening is because Entergy is a merchant plant.  It has no rate base to go back to.  And even though the corporation, the parent corporation Entergy, said if there was a shortfall they’d come through with the money to ensure Entergy’s operation whether it was operation or cleanup.  And instead they’re basically reneging on the deal.” \n \nEntergy estimates it will cost $817 million to decommission the plant and $57 million for site restoration.", "source": "WAMC.org"}