{"published": "2015-09-07T05:16:02Z", "media-type": "News", "title": "Families lash out at Roger Dean's appeal", "id": "341d7e29-796d-47c5-bac8-f412439bd769", "content": "Each time the murder of her mother at Quaker's Hill nursing home resurfaces in a court room, so do Elly Valkay's nightmares, stress and tension. \n\nMs Valkay's mother Neeltje Valkay was one of 11 nursing home patients who died after their carer Roger Dean lit two fires on November 18, 2011 at the facility in Sydney's west. \n\nDean, a registered nurse of 15 years, set the place alight after he discovered police were investigating his theft of 200 prescription pills from the home. \n\nThe 39-year-old is now appealing the 11 life sentences meted out to him in 2013 over the murders. \n\nMs Valkay labelled the appeal as \"ridiculous\" and said it was yet another hurdle for her to cross. \n\n\"We were hoping that after the inquest, that we would get back to a bit of a stable routine but I heard about the appeal about a month ago and out comes the sedatives, out comes the sleeping pills. \n\n\"The tension, the stress is so great just because he wants what he wants, and there is no consideration for the victims and the families and that is what hurts,\" she told reporters outside court on Monday. \n\nDean, the Court of Criminal Appeal heard, is appealing his sentences on a number of grounds. \n\nThey include that they were manifestly excessive and that Justice Megan Latham - now the ICAC commissioner - erred in concluding it was not possible to reflect Dean's culpability with any penalty less than life imprisonment. \n\nHis barrister Tim Game SC argued Dean had pleaded guilty and that the \"whole structure\" of the sentence was incorrect. \n\n\"You can't say, `X is for this, X is for this and it has got so large it now has to be a life sentence',\" he submitted. \n\nBut crown prosecutor Maria Cinque said 11 vulnerable people were murdered \"with the person responsible for their care, responsible for their deaths\". \n\nComparisons to other crimes where offenders were given life sentences \"don't exist\", she added. \n\nDean, she reminded the court, had lit a fire in a room where he knew two immobile and helpless residents - Dorothy Sterling and Dorothy Wu - were sleeping. \n\nWhen another resident saw the fire and begged him \"Please help them get out\", Dean replied: \"Don't worry darling you come with me, someone else will come and get them.\" \n\nBut Dean failed to tell firefighters battling his first blaze about this second one, and by the time it was discovered, the \"catastrophic\" blaze in Ms Sterling and Ms Wu's room was 10 metres high. \n\nPaul Cachia, whose mother Emmanuela Cachia was seriously injured in the blaze and died two and a half months later, said \"what gives him the right to appeal after what he did to our loved ones?\" \n\n\"He should be lit up 11 times for what he done to those people,\" he told reporters. \n\nThe decision on the appeal will be handed down at a later date.", "source": "Countryman"}