{"published": "2015-09-30T12:09:20Z", "media-type": "Blog", "title": "France opens probe into Assad regime for crimes against humanity", "id": "ac9b519d-4fbc-444b-8601-4835efc8572a", "content": "France has launched an inquiry into Syrian President Bashar al-Assad’s regime for alleged crimes against humanity, saying it was forced to act in the face of “systematic cruelty”. \n \nThe announcement Wednesday came after world powers sparred at the United Nations over the embattled Syrian leader’s fate. \n \nA judicial source told AFP that prosecutors in Paris, with the backing of the foreign ministry, had opened a preliminary inquiry on September 15 into alleged crimes committed by the Syrian government between 2011 and 2013. \n \nThe French investigation is largely based on evidence from a former Syrian army photographer known by the codename “Caesar” who fled the country in 2013, taking with him some 55,000 graphic photographs. He now lives in France under tight security. \n \nForeign Minister Laurent Fabius said France had a “responsibility” to take action. \n \n“Faced with these crimes that offend the human conscience, this bureaucracy of horror, faced with this denial of the values of humanity, it is our responsibility to act against the impunity of the killers,” Fabius said in a statement. \n \nHe said the “thousands of unbearable photos, authenticated by many experts, which show corpses tortured and starved to death in the prisons of the regime, demonstrate the systematic cruelty of the Assad regime”. \n \nThe inquiry will be led by France’s war crimes body. \n \nThe judicial source said the term “crimes against humanity” was used to include kidnappings and torture by the regime in the probe. \n \nThe Paris-based International Federation for Human Rights (FIDH) welcomed the announcement, saying the investigation was “a world first”. \n \nWhile Assad is unlikely to ever stand trial in a French court, the inquiry could add to political pressure on the Syrian leader in the midst of a diplomatic row between the West and Russia and Iran over his fate. \n \nThe Syrian conflict has taken centre stage at the UN General Assembly in New York, where US President Barack Obama and his Russian counterpart Vladimir Putin clashed over how to bring an end to Syria’s civil war. \n \n– ‘Assad’s secret killings’ – \n \nOn Tuesday, Obama said removing Assad was a vital step to defeating Islamic State jihadists who have taken advantage of the chaos in Syria to bring large parts of the country and neighbouring Iraq under its rule. \n \nFrench President Francois Hollande echoed Obama’s call in his UN speech, but Putin — a long-time Assad ally — dismissed their pleas, saying they “should not be involved in choosing the leadership of another country”. \n \nSyria’s four-year war has killed more than 240,000 people and Western diplomats have accused Assad’s regime of killing more of their own people than the Islamic State group by dropping barrel bombs — charges the government denies. \n \nThe brutal conflict has also displaced millions of people, a key driver behind Europe’s refugee crisis. \n \nThe photographs that Caesar brought out of Syria show people with their eyes gouged out, emaciated bodies, people with wounds on the back or stomach, and also a picture of hundreds of corpses lying in a shed surrounded by plastic bags used for burials. \n \nEntitled “Assad’s secret killings,” the dossier is being used by international bodies including the UN as part of an investigation into the regime’s role in “mass torture”. \n \nThe Syrian government has branded the report “political”. \n \nCeasar said in an interview with French magazine L’Obs released Wednesday that he wanted to “show the real face of Bashar al-Assad — that of a dictator who has caused a lot of blood to flow”. \n \nFabius said the opening of the French probe should not prevent the United Nations and particularly its International Commission of Inquiry on Syria to press on with their own investigations. \n \nThe post France opens probe into Assad regime for crimes against humanity appeared first on The Guardian Nigeria .", "source": "The Guardian Nigeria"}