{"published": "2015-09-10T03:11:18Z", "media-type": "News", "title": "Insider Buying: Violin Memory CEO Kevin A. Denuccio Acquires 50,000 Shares of Stock (VMEM)", "id": "a662a3b7-295e-474d-afb1-86e05eee943f", "content": "Violin Memory (NASDAQ:VMEM) CEO Kevin A. Denuccio acquired 50,000 shares of the firm’s stock in a transaction that occurred on Friday, September 4th. The shares were bought at an average price of $1.61 per share, for a total transaction of $80,500.00. Following the completion of the purchase, the chief executive officer now owns 271,054 shares in the company, valued at approximately $436,396.94. The transaction was disclosed in a document filed with the SEC, which can be accessed through this hyperlink . \n\nKevin A. Denuccio also recently made the following trade(s): \n\nSeveral equities analysts recently commented on the company. Zacks upgraded Violin Memory from a “hold” rating to a “buy” rating and set a $1.75 target price for the company in a report on Tuesday, September 1st. Deutsche Bank  reaffirmed a “hold” rating and set a $3.00 price target (down previously from $4.00) on shares of Violin Memory in a research report on Friday, June 5th. Finally, Maxim Group decreased their target price on Violin Memory from $8.00 to $7.00 and set a “buy” rating for the company in a research report on Monday, May 18th. \n\nShares of Violin Memory ( NASDAQ:VMEM ) traded down 4.55% on Wednesday, hitting $1.47. The stock had a trading volume of 1,827,536 shares. The company has a 50-day moving average of $2.05 and a 200-day moving average of $2.94. Violin Memory has a 52-week low of $1.45 and a 52-week high of $5.55. The company’s market cap is $141.98 million. \n\nViolin Memory (NASDAQ:VMEM) last announced its quarterly earnings results on Thursday, August 27th. The company reported ($0.19) EPS for the quarter, topping the Thomson Reuters consensus estimate of ($0.20) by $0.01. The company had revenue of $15.30 million for the quarter.  On average, equities analysts anticipate that  Violin Memory will post ($0.78) EPS for the current fiscal year. \n\nViolin Memory, Inc. is pioneering a new class of flash-based storage systems that are designed to bring storage performance in-line with high-speed applications, servers and networks. The Company’s Flash Memory Arrays are specifically designed at each level of the system architecture starting with memory and optimized through the array to leverage the inherent capabilities of flash memory and meet the sustained requirements of business-critical applications, virtualized environments and Big Data solutions in enterprise data centers. The Company’s Velocity Peripheral Component Interconnect Express ( NASDAQ:VMEM ), Flash Memory Cards leverage its persistent memory-based architecture in servers and are optimized for applications that require continuous access to quantities of low latency persistent memory located directly in servers.", "source": "WKRB News"}