{"published": "2015-09-23T19:47:26Z", "media-type": "News", "title": "How long will fossil fuels last?", "id": "1c0b29b1-f918-45b6-8d4a-62566ad297fb", "content": "It is argued that oil will run out in 53 years, natural gas in 54, and coal in 110. How likely is it?  The end, said a reincarnated Cassandra, is nigh. Abundant supplies of fossil fuels will end, bringing down the economic order with it. After all, she argued, at current rates of production, oil will run out in 53 years, natural gas in 54, and coal in 110. We have managed to deplete these fossil fuels – which have their origins somewhere between 541 and 66 million years ago – in less than 200 years since we started using them.  Cassandra – the Princess of Troy – had been blessed with the gift of prophesy by the Greek God, Apollo. In her modern avatar, she projected how many years these fuels would last by measuring the R/P ratios (that is the ratio of reserves to current rates of production) of fossil fuels. She juxtaposed it with the World Energy Outlook study by the International Energy Agency, which estimated that even with aggressive climate action policies; fossil fuels will constitute 59% of the total primary energy demand in 2040.  \nThis is partly because even though renewable sources such as wind and solar continue to become cheaper by the passing day; there are considerable roadblocks in the adoption of these sources. Among other impediments, we are yet to zero in on viable and scalable energy storage technologies that would address the intermittency issues of renewables. The sun, after all, doesn’t shine at night. Further, fossil fuel based technologies and institutions have been “locked in” to the economy: it would take decades to replace the oil, coal and gas guzzling infrastructure that continues to be added afresh today. \n \nThe link between energy poverty and human development is also strong, which has prompted nations to heavily subsidise fossil fuels. Weaning away from these subsidies will have political implications which governments will attempt to avoid or delay. To make matters trickier, developing nations, in particular India and those in Africa, will contribute to the growing thirst for energy. \n \nCould Cassandra then possibly be correct: will we run out of fossil fuels before we make a successful transition towards other sources of energy? This has been the conventional thinking among a set of scholars over the past few decades. In the 1950s, geoscientist M. King Hubbert proposed the Peak Oil theory that has gone on to influence thinking about resource production. According to Hubbert, as oil is a finite resource, the production of oil would peak at some point and ultimately decline and deplete. Many researchers, Hubbert included, postulated that peak production is already behind us, and that we are now seeing a decline. If indeed Peak Oil has passed us by, and if the R/P ratios indicate only five decades of oil and gas, and a century of coal remaining, then an energy-crunch awaits. \n \nFortunately, Cassandra was not only blessed with the gift of prophesy, she had also been cursed by Apollo: the curse being that no one would believe her prophesies. Just this once, it’s probably with good reason. Firstly, the R/P ratios only consider proven reserves, not probable or possible reserves of resources. New reserves continue to be added to the pool, and the R/P ratios have actually increased over the past few decades along with rising production. For instance, in 1980, the R/P ratio suggested only 32 years of oil production from existing reserves. With technological advances, reserves that were previously deemed unviable to tap have kept coming on board. Various studies show that the total remaining recoverable oil resources would last 190 years, natural gas 230 years, and coal, a whopping 2900 years. \n \nThese numbers apply if current rates of production hold for centuries to come, which may not be the case. Rather than Peak Oil (or Gas or Coal), a ‘Peak Demand’ of these resources is likelier to occur. Even though demand from growing economies will rise in the coming decades, fossil fuel demand from the largest economies in the world is already falling due to improving efficiencies and an on-going transition away from coal, which is a part of their climate strategies. A cultural shift is also being witnessed: for instance even in a very petrolhead nation like the United States, public transport use is now at a five decade high. Vehicle aggregator apps and automated cars in the future further promise energy saving. \n \nIn all likelihood, demand for fossil fuels will ultimately peak and then begin to fall – the big question is when. Just as the Stone Age did not end because we ran out of stones, the Fossil Fuel Age will not end because we will run out of fossil fuels. Reserves will likely stay in the ground, far after societies have moved on from them. \n \nbusiness-standard", "source": "Peak Oil"}