{"published": "2015-09-25T13:02:56Z", "media-type": "Blog", "title": "Highlights From Elon Musk’s “Future Economy” Speech In Germany – Video", "id": "f3fbf190-83fe-402f-8af1-16dfe73ec0de", "content": "Highlights From Elon Musk’s “Future Economy” Speech In Germany – Video\r4 mins ago\tby\rEric Loveday\r0Comments\tElon Musk In Germany As part of the “Economy Of Tomorrow” public debate series, Tesla CEO Elon Musk took to the stage in Germany to speak and to answer questions from conference-goers. Video description (translated from German): “In the fourth event of public debate series ” Economy for Tomorrow” discussed Federal Minister Sigmar Gabriel to the US – American entrepreneur , inventor and investor Elon Musk . Both are presented to interested questions of the numerous guests on the spot – and on social media.” Via Tesla Motors Club, here are some highlights on Musk’s speech: Next SpaceX launch will be in 68 days and they will try to land it. Elon says Germany is great in renewable energy generation but not so great in renewable energy consumption. For powerwall batteries Australia and Germany are the two important markets. Sigmar Gabriel, German Minister of Economics and Energy says they have spent €1.5 bn on EV research but now it is time to spend money on incentives. Elon says it would be better if there was a carbon tax and no EV incentives. Elon: The current refugee crisis is a taste of things to happen in the future if we don’t do something about climate change. Elon pushes the energy storage idea. A few times he emphasized the idea of combining solar with energy storage. Elon reconfirms superchargers can be used by other car makers as long as the car can take that power level and the cost is shared proportionally. Sigmar Gabriel: There is a conflict between Tesla and the EU about charging standards. We wanted to have a single charging standard in EU but Tesla has already built their chargers. We are working with Tesla to find a solution. Sigmar Gabriel: It is a good idea to have both incentives and carbon tax. Elon: Model 3 will be released in 2-2.5 years. One of the topics touched upon is Supercharger usage. Elon says that a European automaker recently approached Tesla in regards to using the Supercharger network.  According to Musk, Tesla is open to allowing other automakers to use the network, provided they cover their cost of usage of the network.  Musk wouldn’t say which European manufacturer approached Tesla. Tags: elon musk, supercharger, tesla\rGet Updates\rSubscribe to our e-mail newsletter to receive updates.\rTweet", "source": "Inside EVs"}