{"published": "2015-09-29T13:48:07Z", "media-type": "News", "title": "US stocks are stable in early trade; energy sector gains", "id": "4f802018-0e59-4e94-a45f-bd2858d71049", "content": "European stock markets recovered their poise Tuesday despite an earlier rout in Asia which featured a 4 percent slide in Japan's main index. \n\nKEEPING SCORE: In Europe, Germany's DAX rose 0.2 percent to 9,504 while the CAC-40 in France was steady at 4,357. The FTSE 100 index of leading British shares underperformed its main European counterparts, trading 0.5 percent lower at 5,929. U.S. stocks were poised for a solid opening with Dow futures and the broader S&P 500 futures up 0.5 percent. \n\nSOUR COCKTAIL: Over recent days, worries over China have resurfaced, not least in the impact the slowdown in the world's number 2 is having on commodity prices, many of which have fallen to multiyear lows. On Monday, commodities group Glencore saw its share price tank by around a third amid concerns over its ability to service its debts if commodity prices don't rise. The fallout from Volkswagen's emissions rigging scandal also remains with investors unsure of the impact on the industry. Fed officials, meanwhile, continue to signal they will raise U.S. interest rates this year, marking the beginning of the end of ultra-low interest rates that have underpinned stock markets. \n\nANALYST TAKE: \"At the risk of saying 'It's that time of year,' bearing in mind the timing of historical equity market crashes in September or October, there is no doubt that a confluence of events is unsettling investors,\" said Neil MacKinnon, global macro strategist at VTB Capital. \n\nGLENCORE BOUNCE: One of the reasons why the market mood has improved is that Glencore has seen its share price bounce back 6 percent from Monday's hammering. On Tuesday, analysts at Citibank said the fall in Glencore's share price — about 80 percent from its high in May — has been \"overdone\" and suggested the company could raise more money from the sale of investments than the $2 billion it has penciled in. Citibank analysts also said Glencore management could consider taking the company back into private hands. \n\nASIA'S DAY: The calmer backdrop in Europe was not anticipated after the earlier rout in Asia, which followed Monday's big down day on Wall Street. Japan's benchmark Nikkei 225 dropped 4.1 percent to 16,930.84 while Australia's S&P/ASX 200 declined 3.8 percent to 4,918.40. Hong Kong's Hang Seng ended down 3.0 percent at 20,556.60 while the Shanghai Composite in mainland China shed 2.0 percent to close at 3,038.14. \n\nENERGY: Benchmark crude rose 47 cents to $44.90 a barrel in electronic trading on the New York Mercantile Exchange. Brent Crude, a benchmark for international oils, was up 53 cents to $47.87. \n\nCURRENCIES: The euro was down 0.2 percent at $1.1225 while the dollar fell 0.1 percent to 119.83 yen.", "source": "Wichita Eagle"}