{"published": "2015-09-04T13:08:00Z", "media-type": "News", "title": "Kentucky clerk's office issues same-sex marriage license", "id": "43952783-8506-46da-89d1-df7ec85c16c9", "content": "In what was an emotional and contentious scene at the Rowan County, Ky., Courthouse this morning, one dramatic legal standoff came to an end, when a gay couple was issued a marriage license. \n \nJames Yates and William Smith, who had tried this five times before, arrived at the courthouse just as the sun started peeking out from under the mountains on the horizon. \n \nThey walked past protesters — condemning them and cheering them — and entered the clerk's office. \n \nKim Davis the county clerk who had five previous time stood in their way was in jail. She had been held in contempt by a federal judge for defying the Supreme Court by refusing to hand out marriage licenses. So, Yates and Smith walked up to Deputy Clerk Brian Mason. \n \nMason was all business. He checked their licenses asked them if they were related, took their $35 and in about five minutes, handed them an envelope and said, \"Congratulations.\" \n \nYates and Smith had become the first same-sex couple to receive a marriage license. \n \nThey exited to chants of, \"Love has won. Love has won.\" \n \n\"I don't want her in jail,\" Yates said, about Davis. \"No one wanted her in jail. We just wanted the licenses given out. This isn't a blessing. It's an official license.\" \n \nHe grew emotional. \n \n\"This means, at least for this area, civil rights are civil rights and they're not subject to beliefs.\" \n \nDavis' husband, Joe Davis, was also outside the courthouse with a group of protesters who called this a moral fight. \n \n\"We don't hate these people. That's the farthest thing from our hearts,\" he said. \"We don't hate nobody. We just want to have the same rights that they have. They're saying, 'Hey we're gonna make you accept us.' But they don't want to accept our beliefs. But they want us to accept theirs.\"", "source": "Minnesota Public Radio"}