{"published": "2015-09-24T10:18:13Z", "media-type": "News", "title": "Intermap Technologies® Makes Earthquake Data Available for Risk Scoring via InsitePro(TM)", "id": "a5e80a5f-f96b-40f5-aa82-db89655e7da4", "content": "- Intermap and Atkins sign licensing agreement for natural catastrophe hazard data - \n\nDENVER, Sept. 24, 2015 /PRNewswire/ - Intermap Technologies (TSX:IMP), (ITMSF:BB), a leading provider of location-based solutions, today announced that it has entered into an agreement with Atkins, one of the world's most respected design, engineering, and project management consultancies, to include their natural catastrophe risk and hazard data archives, including North American earthquake data, in its InsitePro software product. \n\nInsitePro is Intermap's cloud-based risk assessment software designed to help property insurance underwriters assess location-based risk. With its configurable analytic engine, InsitePro allows users to design risk scoring analytics that address specific business needs. InsitePro applies reliable peril and geospatial data in a way that fits a carrier's approach to risk. \n\n\"InsitePro's flood analytics are changing the way flood insurance is priced and delivered,\" stated Product Manager Ivan Maddox. \"With the Atkins agreement, Intermap will be offering risk scores for all natural perils, including earthquake, hail, tornado, and wind (straight-line and hurricane). InsitePro can now replicate the innovation brought to flood risk assessment across these other perils, delivering custom analytics to underwriters that are based on dependable data and their own view of risk.\" \n\nUsing InsitePro, carriers can automate the risk pricing activities that they are comfortable with and identify risks that need further analysis by an underwriter. It offers fast answers for most properties and allows the carrier to add value where appropriate. Including all perils will enable a carrier to write complete property coverage for homes and businesses to differentiate themselves from carriers that only offer standard coverage. \n\nFor more information, please visit http://www.intermap.com/software/insitepro. \n\nRegister for Intermap News Alerts at http://www.intermap.com/pressreleases. \n\nAbout Atkins \n\nAtkins (www.atkinsglobal.com) is one of the world's most respected design, engineering and project management consultancies, employing some 18,000 people across the UK, North America, Middle East, Asia Pacific, and Europe. They build long-term trusted partnerships to create a world where lives are enriched through the implementation of their ideas. \n\nAbout Intermap Technologies \n\nHeadquartered in Denver, Colorado, Intermap Technologies is an industry leader in geospatial solutions on demand with its secure, cloud-based Orion Platform®. Through its powerful suite of software applications and proprietary development of contiguous databases that fuse volumes of geospatial data into a single source, the Orion Platform is able to provide location-based solutions for customers in diverse markets around the world. For more information please visit www.intermap.com. \n\nIntermap Reader Advisory \n\nCertain information provided in this news release constitutes forward-looking statements. The words \"anticipate\", \"expect\",\" project\", \"estimate\", \"forecast\" and similar expressions are intended to identify such forward-looking statements. Although Intermap believes that these statements are based on information and assumptions which are current, reasonable and complete, these statements are necessarily subject to a variety of known and unknown risks and uncertainties. You can find a discussion of such risks and uncertainties in our Annual Information Form and other securities filings. While the Company makes these forward-looking statements in good faith, should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary significantly from those expected. Accordingly, no assurances can be given that any of the events anticipated by the forward-looking statements will transpire or occur, or if any of them do so, what benefits that the Company will derive therefrom. All subsequent forward-looking statements, whether written or oral, attributable to Intermap or persons acting on its behalf are expressly qualified in their entirety by these cautionary statements. The forward-looking statements contained in this news release are made as at the date of this news release and the Company does not undertake any obligation to update publicly or to revise any of the forward-looking statements made herein, whether as a result of new information, future events or otherwise, except as may be required by applicable securities law. \n\nSOURCE Intermap Technologies Corporation", "source": "IT News Online"}