{"published": "2015-09-14T13:11:59Z", "media-type": "Blog", "title": "Show Review: Tracy Reese Spring 2016", "id": "016607dc-24f8-4d67-8220-c63252bcc269", "content": "The post Show Review: Tracy Reese Spring 2016 appeared first on The Fashion Bomb Blog : Celebrity Fashion, Fashion News, What To Wear, Runway Show Reviews . \n \nWith Spring comes a sense of hope for warm weather ahead and anticipation for vacations and Summer Fridays to come. Tracy Reese played on that sense of elation and good cheer for her Spring 2016 collection which was downright pretty, chock full of girlishness, shimmer, and sheer detailing for a flash of skin. \n \n\n \n\n \n\n \nWe all know that florals for Spring aren’t groundbreaking (thanks Miranda Priestly), but they felt fresh here on an easy off-the-shoulder dress, leggy mini frock paired with a studded yellow coat and black sheer tights, a bold maxi number layered under a cropped leather biker jacket, and an easy camisole given added flair with a lace sheer blouse and easy rust trousers. \n \n\n \n\n \n\n \nLace overlays injected a dose of old school femininity to a glamorous sequin slipdress, a roomy printed coat, lime green bralette for a pop of color, and relaxed pants. \n \n\n \n\n \n\n \nSeparates made a huge impact with button-accented tops, flirty knee-length skirts, and printed jacket and trouser combinations that played on the pajama trend. The shoes were also a focal point of the looks— designed in collaboration with Sarah Jessica Parker. \n \n\n \n\n \n\n \nReese is best known for her dresses and there were some FLOTUS-worthy frocks in the collection. A printed short-sleeve crepe dress was pleasant and would work with the assortment’s icy blue booties or sneakers, while a white lace fishtail gown was one step away from bridal-perfect, save for its sheerness. \n \n\n \n\n \n\n \nMy favorite pieces on display were those that were simple in silhouette, but adventurous in color. A copper caped playsuit is standout enough to last in a modern-day woman’s wardrobe for years to come and a silver biker jacket will inject a rocker chic edge to everything from menswear-inspired suiting to the most prim and proper sheath. \n \n\n \n\n \n\n \nWhat do you think of Tracy Reese’s Spring collection? \n \nImages: VOGUE.com \n \nThe post Show Review: Tracy Reese Spring 2016 appeared first on The Fashion Bomb Blog : Celebrity Fashion, Fashion News, What To Wear, Runway Show Reviews . \n  Wait! There's More!    Show Review: Tracy Reese Fall 2014   Show Review: Tracy Reese Resort 2015   Show Review: Tracy Reese Pre-Fall 2015", "source": "The Fashion Bomb Blog : Celebrity Fashion, Fashion News, What To Wear, Runway Show Reviews"}