{"published": "2015-09-29T22:30:49Z", "media-type": "News", "title": "Calcium supplements 'have little effect on bone health'", "id": "adbc107f-4d15-4433-8c56-fd22cc0b1c36", "content": "Taking calcium supplements or eating more dairy to improve bone health has little or no effect, according to new research. \n\nThere is scant evidence that taking calcium supplements prevents fractures and no evidence that increasing calcium through the diet prevents fractures or breaks either, experts said. \n\nThe research, published in the British Medical Journal (BMJ), collected data from dozens of studies on the issue. \n\nAccording to the NHS, adults need 700mg of calcium a day. It is recommended that people get all the calcium they need from their daily diet. \n\nThe NHS Choices website warns that taking  high doses of calcium (over 1,500mg a day) could lead to stomach pain and diarrhoea. \n\nIt says taking supplements containing less than this amount are unlikely to cause any harm. \n\nIn the latest study, experts from New Zealand concluded that efforts to increase calcium intake to improve bone health had no overall effect. \n\n\"Our analyses indicate that dietary calcium intake  is not associated with risk of fracture, and there is no evidence  currently that increasing dietary calcium intake prevents  fractures,\" they said. \n\nThey said calcium supplements have \" an unfavourable  risk:benefit profile\", meaning they could do more harm than good. \n\n\"Collectively, these results suggest that clinicians, advocacy  organisations, and health policymakers should not recommend  increasing calcium intake for fracture prevention, either with  calcium supplements or through dietary sources.\" \n\nThe experts studied a range of trials on the issue, including people aged 50 and over getting their calcium from milk or dairy, or taking calcium supplements with or without vitamin D. \n\nIn an accompanying editorial, Professor Karl Michaelsson from Uppsala University in Sweden, said  most over-50s will not benefit from increasing their intake of calcium, particularly through supplements, as some recommendations suggest. \n\n\"The weight of evidence against such mass medication of older people is now compelling, and it is surely time to reconsider these controversial recommendations,\" he said. \n\nProfessor Juliet Compston, a National Osteoporosis Society trustee, said:  \"There is not much in these studies that is new. We already know that calcium supplements increase bone density, but on their own do not reduce fractures. \n\n\"However, a recent analysis concluded that calcium and vitamin D did reduce hip and non-vertebral fractures in postmenopausal women and older men.\"", "source": "Jersey Evening Post"}