{"published": "2015-09-21T12:17:25Z", "media-type": "News", "title": "Jude Kirton-Darling:  Putting the Young at the Heart of Policymaking Is the Key to Tackling Youth Unemployment", "id": "a5709715-f779-4797-910d-0a49eaa23225", "content": "\"What needs to be done to reduce record levels of youth unemployment, and how can we ensure that the young are equipped for the world of work?\" That was the question we asked ourselves this week, when 15 young people from the North East came to Brussels to hear what the European Parliament and Commission are doing to support their generation. \n\n'Youth Unemployment: What needs to be done?' was an ambitious initiative led by myself and two colleagues from the Socialists and Democrats group in the European Parliament, Miapetra Kumpula-Natri MEP from Finland and Eva Kaili MEP from Greece. With a fifth of young people currently out of work in Europe and rates as high as over 50% in Greece, Spain and Italy, youth unemployment is the most pressing challenge facing young people today, and improving the lives and prospects of the young is increasingly high on the agenda for the European Parliament and Commission. It is with this goal in mind that a 45-strong group of 18-25 year olds from the UK, Finland and Greece were invited to Brussels on Tuesday 15 September. \n\nBut this was not an occasion for European policymakers simply to congratulate themselves on their successes thus far, or to provide lectures on the core initiatives aimed at improving young people's lives and job prospects. Central to our aims was to hear the first-hand experience of young people from three countries, each with very different struggles and successes: presentations on long-term youth unemployment, precarious work and youth entrepreneurship, led by Greece, the UK and Finland respectively, formed the backbone of our afternoon's discussions, providing much needed clarity to the challenges that lie ahead. \n\nWhile youth unemployment is relatively stable and in general only temporary in Finland - hailed as the beacon for the implementation of the now Europe-wide Youth Guarantee - the UK government continues to refuse to implement a British equivalent, despite calls to the contrary from the European Commission, House of Lords , trade unions and civil society organisations. Yet under 25s in the UK are now more than three times more likely to be out of work than older generations, with more than a third subjected to the now infamous 'zero-hours' contracts plighting the lives of so many struggling to make ends meet. And the desperate situation facing young Greeks, as their country attempts to rebuild from the rubble of an ongoing economic crisis, is by now a familiar tale. The young in Greece have been the most adversely affected by the economic crisis in Europe: youth unemployment was at 50.1% in January this year, while one third of Greek youths are out of work for more than a year. It was a great privilege to be able to bring together young people from these three corners of today's EU, and to hear the lived experience behind the statistics. \n\nClearly our work is far from done, however unfortunately it is an all-too rare sight to witness a discussion between a large group of young Europeans and experts from the Commission, European Parliament, trade unions and pan-European youth organisations. So much of European legislation has a top-down approach that fails to involve the very people whose lives it will affect. This is no more so the case than when it comes to the young. \n\nWe want this to change, and will turn our words into actions: as such, the views of our young participants will be collated into a report that will be submitted to the Parliamentary committee on Employment and Social Affairs and the European Commission. As MEP for the region worst affected by youth unemployment in the country , I consider it my responsibility to make sure these voices are heard by the people that can make a real difference: last Tuesday was simply the start of that process. \n\n\nJude Kirton-Darling is Labour MEP for the North East of England", "source": "Huffington Post UK"}