{"published": "2015-09-22T06:50:50Z", "media-type": "News", "title": "Anas’ Judicial Corruption Video Shows Today", "id": "a96c6449-6d9f-4cc7-8eda-32abf640bf63", "content": "Citi News has gathered that despite an impending injunction against the premiering of the investigative piece by Anas Aremeyaw Anas and his team, Tiger Eye P.I will be premiering the video today as planned. \n\nThe said video captured more than 30 judges and about 100 court officials taking bribes. Hundreds of free tickets have already gone out for the premiering expected to take place at the Accra International Conference Center which has also been joined in the suit by one of the implicated judges. \n\nSome of the judges named in the video say it would be prejudicial for the video to be shown publicly especially when the same video will serve as evidence against them. Other legal practitioners say showing the video will dent further the image of the judiciary. According to a source from Tiger Eye P.I, the video tagged “Ghana in the Eyes of God” would be shown at the Accra International Conference Centre beginning today and on Wednesday September 23rd at 4pm and 8pm each day. \n\n“There is going to be a showing at 4:00pm and 8:00pm at the International Conference Center auditorium. It is strictly by invitation and we are not selling tickets. To the best of my knowledge we have made all the necessary arrangements at the conference center. All what he is doing is to make sure that he does what satisfies our constitution so for now he is going to show it in a legal way” the source hinted. Meanwhile the Fast Track Division of the High Court will today hear an application by the embattled high court judge Paul Dery for an order of substituted service of the their suits on investigative journalist Anas Aremeyaw Anas. \n\nIn their application for substituted services, lawyers for the judge argue that Anas and his investigative team Tigereyepi have been unavailable in their offices to be served the two writs, although the other defendants have all been served. \n\nJustice Paul Dery on September 14, 2015 filed a writ of summons and an interlocutory injunction seeking to stop the premier of the video. The judge will today be seeking leave of the court to serve Anas by posting on the door of the offices of Tigereye PI and also on the notice board of the High Court.", "source": "Peace FM"}