{"published": "2015-09-07T21:37:22Z", "media-type": "Blog", "title": "Wedding Time!", "id": "ca04b840-639b-417d-b284-4ebd5c663b13", "content": "What a beautiful weekend! My boyfriend and I went to his cousins wedding in Exeter. It was such a lovely day even if I ended up drinking a bit too much Prosecco on arrival at the reception! I think this triggered a migraine later in the evening unfortunately so I wasn't able to dance into the night as I had hoped. \nThe transition between my old job and new one has left my money situation a bit up the creek so I had no choice but to dig out an old outfit for the wedding, although I did treat myself to a new pair of shoes from M&S! I bought a pair almost identical to the M&S ones from Topshop a couple of months ago but they were so high I couldn't even walk 2 steps in them, I was devastated when I had to get a refund! But to my delight M&S have just brought out a lower more practical pair for cripples like me who struggle with heel height and have knee problems! Amazing!! Plus they were less than a third of the price of the Topshop ones so I was able to afford them with my discount on top! Perks of the job :)! \nM&S have just launched a new advertising campaign called 'the art of' it's a way of creating one message for the business and linking the food and GM adverts together. It concentrates on the way M&S makes clothing and what they offer over other retailers for example this past week has been about 'the art of Comfort' and showcases our beautiful bras which are luxurious and sexy yet incredibly comfortable! The other key message this week is 'the art of boho' and this nods towards the bohemian trend which is a key trend of the autumn season. My wedding outfit was inspired by this trend which is why I put the snakeskin shoes together with a floaty dress and weave bag. It created texture and a friendly clash of prints. The shoes feature in the TV advert as part of the campaign! The weather was ever so slightly chilly so I dug out an old Mac style coat with sheer sleeves to keep me warm! I will keep you updated with the latest M&S weekly campaign highlights, my outfit details are below: \nOutfit Details:\nDress - I genuinely can't remember where this is from as it's so old! \nMac - Bella Sorella\nShoes - Limited Edition at Marks and Spencer\nBag - Primark \nBelt - Topshop \nThe food was absolutely divine!!! \nStunning location in the sunshine the morning after the wedding..\nMy gorgeous partner in crime! \nHis outfit details:\nJacket - ASOS\nShirt - M&S\nTie - M&S\nTrousers - Next\nShoes - M&S\nThe flowers from the bridal bouquets were leftover the next day so we jumped at the chance to take some home and replace our usual 'fake' roses with some real beauties! One day I will be able to afford fresh roses for my vase each week!!! \nBack soon :) xxx", "source": "The Fashion Singer"}