{"published": "2015-09-15T00:10:00Z", "media-type": "News", "title": "New Type Of Personal Branding Offered By ABCI", "id": "7d9407ee-8a7a-4b89-90ec-cf8f9ff864a9", "content": "This article was originally distributed via SproutNews. SproutNews, WorldNow and this Site make no warranties or representations in connection therewith. \n\nSeptember 14, 2015 – /PressAdvantage/ – Aviation Business Consultants Intl. (ABCI), based in Tooele, UT, announced that they are offering a new type of personal branding. They want to help their clients find their inner ‘rock star’, methods that stand out as a personal brand. \n\n“Powerful marketing systems are all based around a personal brand,” says Paula Williams from ABCI. “We’re all familiar with the ‘rock stars’ of the aviation industry – the Richard Bransons, Elon Musks, Lynn Tiltons and Herb Kellehers – larger than life personalities whose personal brand propel the company into conversation in hangars, FBOs, and aviation conventions.”\n\nABCI’s product evaluates the current personal branding status of business people. They then look at methods to help their digital image gain more personal credibility. To achieve this, they offer a number of different tools, including the Aviation Marketing Master Class. The package also includes a 30-day advertisement, a review of the social media profiles of the people who would like to enhance their branding, a review on the best keywords to use, and an hour long consultation.\n\nFollowing this assessment, further services may be recommended, depending on the objectives and circumstances of the individual client. These may include social media coaching, website development, SEO, press releases, ghostwriting, graphic arts, and more. The assessment report will highlight which of these services are most recommended and how much they will cost.\n\n“We help our clients to become recognizable rock stars,” adds Paula Williams. “We show people how to create a carefully crafted first impression.”\n\nEssentially, ABCI uses proven marketing techniques. They start every new relationship with a full assessment that demonstrates where a business is now, from where the right tactics can be employed to propel it forward.\n\n###\n\nContact Aviation Business Consultants Intl. (ABCI) :\n\nPaula Williams\n\n702-987-1679\n\npaula@aviationbusinessconsultants.com\n\n1288 East 850 North\n\nTooele UT 84074\n\nReleaseID: 60", "source": "Fox 8 WVUE New Orleans"}