{"published": "2015-09-03T11:14:57Z", "media-type": "News", "title": "Slash GH¢2 million capital requirement- Association of Microfinance", "id": "baee3edf-88f9-4076-9aea-cc80094ec634", "content": "The Ghana Association of Microfinance Companies (GAMC) is asking for a downward review of the new minimum capital requirement of GHc2 million set by the Bank of Ghana for microfinance institutions. \n \nThe National Vice Board Chairman of GAMC, Ekow Boham said the association was discussing the new GHc2 million capital requirement with its members and will make a case to the central bank soon. \n \nHe said this on Citi fm business news Thursday. \n \n“GHc2 million is on the high side and we need to understand the industry we are playing in… But due to issues with most of the microfinance institutions in the country which resulted in most of them going down the regulator BoG also had to step in and first moved the requirement from 100,000 cedis to 500,000 cedis which was received with mixed reactions as some of the players thought it was good but others also in the industry said it was a bit on a high side…” Ekow Boham said. \n \nMeanwhile the Bank of Ghana has rejected suggestions that it should recede its functions of regulating the microfinance industry in the country to another institution since it is overwhelmed by the volume of work to be done in the sector. \n \nAlso speaking on the issue, the Head of Licensing and Resolution Office at the Bank of Ghana, Joseph Frimpong-Manso insisted that BoG had the legal backing to regulate the micro finance institutions in the country. According to him, the central bank is working hard to set up offices across all regional capitals in the country. \n \n“I think that the responsibility for regulating the financial system is actually a statutory on and it has been given to the bank of Ghana and we cannot move away from that responsibility, the law clearly mandates the bank of Ghana to do that but yes probably we could set up offices in all the regional capitals, may be centre to look at these issues and that is something that management is seriously considering but for now I think we are gradually putting up the structures to sort of ensure that we are almost everywhere to monitor and regulate the microfinance sector.” \n \nSource: Citifmonline \n   Share This Story, Choose Your Platform!    Related Posts", "source": "Business World Ghana"}