{"published": "2015-09-09T15:16:05Z", "media-type": "News", "title": "Amal Clooney continues to fight for human rights in the Maldives... as husband George admits to being a trophy husband George Clooney's wife", "id": "608271cc-051b-4adb-b0d3-69cd4a357ebc", "content": "She is currently working on a high profile case in the Maldives. \n\nAnd Amal Clooney looked like she meant business when she stepped out in Male to meet with Attorney General Mohamed Anil at his office on Wednesday. \n\nThe human rights lawyer is in the country to meet with former president Mohamed Nasheed and Maldivian authorities to discuss Nasheed's detention and jail sentence.   \n\n    \n   \nGirl power: Amal Clooney looked like she meant business when she stepped out in Male, Maldives, to meet with Attorney General Mohamed Anil at his office on Wednesday \n\nThe 37-year-old sported two different ensembles for her meeting, one of which was a retro-style cream and black skirt-suit and the other a black culotte-suit with large stitched detailing. \n \nOn her way into the venue, Amal was seen laughing and shaking hands with officials.  \n\nHer day at work came the day after her partner George Clooney admitted to being somewhat of a trophy husband during his appearance on The Late Show with Stephen Colbert on Tuesday night. \n   \nShe means business: The human rights lawyer is in the country to meet with former president Mohamed Nasheed and Maldivian authorities to discuss Nasheed's detention and jail sentence \n  \nFashionista: The 37-year-old sported two different ensembles for her meeting, one of which was a retro-style cream and black skirt-suit and the other a black culotte-suit with large stitched detailing \n   \nCool, calm and collected: On her way into the venue, Amal was seen laughing and shaking hands with officials \n   \n Serious: The intellectual business held a rapt facial expression as she exited her car \n\n'What is it like to be the arm candy in a relationship, because she’s the very serious person?' the new host cheekily asked. \n\n'She must say like, \"We’re going to meet extremely intelligent people tonight – these are not show folk. Just be shiny and pretty.\"' \n\nGeorge then conceded: 'That’s mostly what I do.'  \n\nAmal recently spent a number of hours with former president Nasheed in his high security prison, as part of her team's efforts to secure the release of the politician.   \n   \nHuge team: The lawyer was joined by her entourage on the trip \n   \nGot her covered: A member of Amal's entourage made sure to protect her luscious mane from the country's downpours beneath an umbrella  \n   \nCheeky! Her day at work came the day after her partner George Clooney admitted to being somewhat of a trophy husband during his appearance on The Late Show with Stephen Colbert on Tuesday night  \n   \nGetting to work: Amal Clooney visited Maafushi jail in the Maldives on Tuesday to meet with jailed former president Mohamed Nasheed \n\nAmal and her team arrived by boat to Kaafu Atoll, the administrative division and location of the prison, from the Maldives capital of Male. \n\nJoined by her co-counsel and members of her team, she made her way into the prison where she waited to meet with Nasheed, who is serving a 13 year jail term. \n\nA large crowd of cameras were outside to greet the London-based lawyer, with Amal giving a brief statement to the press before being escorted inside. \n   \nHigh profile case: A large crowd of cameras were outside the prison to greet the London-based lawyer, with Amal giving a brief statement to the press \n  \nNoted presence: Amal's visit drew attention from  locals as she arrived to meet with the ex Maldives leader \n   \nShe's arrived: Amal and her team arrived by boat to Kaafu Atoll, the administrative division and location of the prison, from the Maldives capital of Male \n\nDressed in a smart black dress and grey heels, it was Amal's first full day in the region after touching down in Male on Monday.  \n\nShe may have another difficult fight on her hands but the human rights lawyer received a warm welcome when she arrived in the Maldives to further pursue the case of Nasheed. \n\nThe intellectual beauty greeted a large crowd as she touched down in the capital Male. Amal is part of the ex-leader's high-profile legal team who are fighting for the release of the politician. \n   \nSpeaking out: The lawyer spoke to the cameras and members of the press before going inside \n   \nGood spirits: Dressed in a smart black dress and grey heels, it was Amal's first full day in the region after touching down in Male on Monday \n   \nWaiting game: The top human rights lawyer patiently waited for her meeting \n   \nOn Friday Nasheed's defence lawyer Mahfooz Saeed (pictured) was stabbed in the left side of his head while he was on his motorbike in capital Male, reports the Asian Tribune \n\nAlong with her legal team co-counsel Jared Genser, Amal has travelled to the island republic's capital to make the case heard. \n\nOn Friday Nasheed's defence lawyer Mahfooz Saeed was stabbed in the left side of his head while he was on his motorbike in capital Male, reports the  Asian Tribune. \n\nIt is not known who the two men are who attacked him, but the knife missed his eye-socket by a few millimetres.  \n\nHe remains in hospital after surgery to remove the knife. \n\nThe United States, the European Union and India have all expressed concern at the jailing of Nasheed for 13 years for ordering the detention of a judge in 2012 when he was still president. \n\nLast week the United States called for the Maldives government to release the former president after he was sent back to prison from house arrest.  \n   \nAnother international case: Amal and her team, who are based in London, tackle cases around the world \n   \nOutcry: The team are pressing for the release of  former president Nasheed, a case which has received international attention \n\nNasheed was Maldives' first leader after democratic reforms in 2008 but his presidency was cut short in February 2012 when, according to Amal and her team, 'he was forced to resign at gunpoint.' \n\nWriting in the Guardian  last month, under a piece titled 'Release Mohamed Nasheed – an innocent man and the Maldives' great hope', Amal called the 2013 conviction, 'a politically motivated show trial.' \n\n'Nasheed’s conviction for “terrorism” and the crushing 13-year sentence are a mockery of justice, designed to punish him for criticising the government and remove him as a political threat...Nasheed’s conviction sends a loud and clear message to the Maldivian people: opposition to the ruling regime will not be tolerated,' she added.  \n   \nFight on her hands: Amal  greeted a large crowd as she touched down in the Maldives capital of Male on Monday \n\nIn a new statement released just before her visit to Male, Amal said,  \n\n'President Nasheed's unjust imprisonment has led to the largest protest movement in Maldivian history, and protesters have in turn been added to the list of political prisoners in the country.' \n\n'My co-counsel and I will continue to pursue all legal and diplomatic strategies to secure our client's release, including through the UN Working Group on Arbitrary Detention.'  \n   \nVocal: The United States, the European Union and India have all expressed concern at the jailing of Nasheed for 13 years on terrorism charges \n   \nAnother high profile case: Dressed in a smart black shirt and white trousers, the lawyer looked in good spirits despite a difficult fight ahead \n   \nPassionate defence: Writing in the Guardian last month, under a piece titled 'an innocent man and the Maldives' great hope', Amal called the 2013 conviction of Nasheed 'a politically motivated show trial' \n\nAfter visiting the Maldives, Amal and her co-counsel will travel to Sri Lanka and India for further meetings regarding the case. \n\nAmal, who was dressed in a smart black shirt and white trousers, looked in good spirits on Monday despite a difficult fight ahead. \n\nShe has been juggling a number of high-profile international cases this summer. \n\nJust over a week ago the lawyer was representing Al-Jazeera journalist Mohamed Fahmy in an Egypt courtroom, who was charged, along with his colleagues Baher Mohamed and Australian Peter Greste, with operating without a press licence and broadcasting material harmful to Egypt. \n   \nStrong words: Amal has called the case and trial against the former president 'a mockery of justice' \n   \nLong battle: In a statement released just before she headed to Male, Amal promised she and her team 'will continue to pursue all legal and diplomatic strategies to secure our client's release' \n   \nBusy summer: Amal has been juggling a number of high-profile international cases over the past few weeks \n\nThe three men were each handed three-year jail terms at the hearing at Cairo’s Tora Prison. \n\nAfterwards Amal, whose presence in court received more attention than her client’s from photographers and TV crews, denounced the jail terms as ‘sending a dangerous message that there are judges in Egypt who will allow their courts to become instruments of political oppression and propaganda’. \n\nA week before that case, Amal was with her husband  as she joined the Hollywood star at a bash to launch his new tequila in Ibiza, after flying in from their home in Lake Como, Italy, where the couple have spent much of their summer.  \n\n   \nHoping for a win: Just over a week ago the lawyer was representing Al-Jazeera journalist Mohamed Fahmy in an Egypt courtroom, a case her team eventually lost \n   \nWork and play: The lawyer has also spent time with her husband George this summer, at their Lake Como home \n   \nMiles apart: While his wife was busy at work in the Maldives, George Clooney was in New York for a taping of the first episode of The Late Show  with Stephen Colbert \n   \nLaid-back: The actor wore a t-shirt promoting his tequila brand as he carried a smarter suit inside the studio \n   \nWhat a guy: George stopped and chatted with fans before being led inside by members of the team \n\n ", "source": "Mail Online UK"}