{"published": "2015-09-11T17:13:35Z", "media-type": "News", "title": "Obituary for Dolores Ann Wolf", "id": "a816fff1-0fae-490d-ba03-b63d0fe4330e", "content": "Obituary  \nSubscribe \n  Dolores “Tater” Ann Wolf  Tipton  June 12, 1937 - September 5, 2015  \nDolores (Tater) Ann Wolf, 78, of Tipton, Missouri, passed away on Saturday, September 5, 2015, at home, surrounded by her family. She was born June 12, 1937, in Frankenstein, at the home of her parents, Pete and Josephine Sampson Thoenen. On July 4, 1959, in Frankenstein, Missouri, she united in marriage to Gerald (Jerry) Wolf. Dolores worked in various jobs: Gerbes business office, United Telephone Company, Stride-Rite Shoe Factory. Fasco and as a homemaker. She was a member of the Altar Sodality and a heavenly duster for many years. Dolores is survived by husband, Gerald (Jerry) Wolf; son, Bryan Wolf and his wife Cheryl of Holts Summit; daughter, Debbie Mortenson of Boonville; daughter, Glenda Monachino and her husband Ono, Plattsburg, Mo.; several grandchildren: Melissa Stevens, Melanie Stevens, Maria Morrison and her husband, David, Matthew Stevens, Lori Williams and her husband Steffon, Tanner Wolf, Spencer Wolf and two great-grandchildren, Halle and Kaylee Morrison, along with numerous nieces and nephews. Other survivors include eight sisters, Helen Campbell of Westphalia, Mo., Sister Therese Thoenen of Milwaukee, Wis., Agnes Meyer of Lee's Summit, Mo., Florence Kever of Frankenstein, Mo., Wilma and Raymond Laughlin of Frankenstein, Mo., Mary Alice and Dave Wilde of California, Mo., Paula and Ted Boehm of Columbia, Mo., Francis and Don Draper of Holts Summit, Mo. and family friend, Sister Jamine Angelina. In addition to her parents, she was preceded in death by her in-laws, Albert and Bertha Wolf; sister-in-law, Agnes McPherson; brother-in-laws, Clinton Campbell, Jim Meyer, and Linus Kever. Visitation was held Monday evening, September 7, from 5:00-7:00 p.m., with Rosary at 4:30 p.m., at St. Andrew's Catholic Church, Tipton, Missouri. Memorial services will be Tuesday, September 8, at 10:00 a.m., at the church. The family suggests donations to St. Andrew's Catholic Church and Hospice Compassus. Arrangements made by Meisenheimer Funeral Home, Tipton, Mo. \nOnline condolences can be made at www.meisenheimerfuneralhomes.com \n Obituary Condolences  \nUse the comment form below to begin a discussion about this content. \n  \nPlease review our Policies and Procedures before registering or commenting \n  News Tribune - Obituary Condolences", "source": "Jefferson City News Tribune"}