{"published": "2015-09-25T00:35:17Z", "media-type": "News", "title": "Faith: A migrant dad and son in search of permanent refuge", "id": "f92727a0-0643-4878-887c-8285bd607a26", "content": "The tragic picture of Aylan Kurdi lying dead on the Turkish beach has one silver lining. \n \nIt has spurred the world to action in speeding up the long-awaited migrant-resettlement process. \n \nKurdi’s dad lost two of his precious sons and a wife. Even then, he undertook the trip to his native Qubani in Syria to bury the sons in their homeland. \n \nReading the touching anecdote reminded me of a Jewish dad who was about to give up his only one son, not because of migrant escapade, but under God-honouring compulsion. \n \nBut, in the nick of time, this lad’s life was spared. \n \nThis mobile and migrant dad was Abraham, the affluent patriarch who had his priorities straight. \n \nAbraham’s prosperity didn’t take him away from God to look for safer and secure pastures in far-off lands. \n \nEvery time he moved and pitched his tent, he also built an altar to the One under whose direction he was voyaging. \n \nTalking about his nomadic life, the writer of the Book of Hebrews says: “Because he looked for a city which has foundations, whose builder and maker is God.” \n \nAbraham sought a new world, more stable and much more eternal than Western Europe or North American shores, as his family’s permanent refuge. \n \nOne day a test came to him when God told him: “Take thy son and offer a sacrifice of him.” \n \nAnd, as if to rub into him precisely what He was asking, God added: “Thine only son, Isaac.” \n \nThat name reminded Abraham of his son of promise. \n \nGod had promised that through Isaac the world would be blest some day and the redeemer of mankind would come in his line. \n \nGod said to Abraham,: “Make an offering out of him. I am not asking you just to take him up on top of a mountain and stab him to death. \n \n“I’m asking you to do it as a religious act of devotion, of worship, of adoration, of love towards me. \n \n“It has to be a religious exercise. You are to make a real service out of it with the right attitude of heart.” \n \nThe Bible tells us that when Abraham heard that, the very next morning he started on his way. \n \nThat’s how quick he was to obey God. \n \nGod came before his family and before his children. \n \nIf the meaning of that is properly understood, it won’t bring problems; it would only bring blessings to our families and our children. \n \nSo, Abraham went up to that mountain, without wavering. \n \nAnd what had God promised? \n \nIt’s that through the son who was about to be sacrificed, the whole world was going to be blessed. Jesus was going to come down in his line. \n \nNow comes this paradoxical, contradictory command in which God said: “Put him on an altar and make him an offering.” \n \nWithout hesitation, Abraham went up to the mountain where this was to take place. \n \nHebrews , chapter 11, gives a beautiful insight into this story where it says: “By faith Abraham, when he was tried, offered up Isaac . . . accounting that God was able to raise him up even from the dead.” \n \nDo we get the picture? \n \nThe late V. Raymond Edman , president of Wheaton College, used to say: “Never doubt in the dark what God has promised you in the light.” \n \nIn the light, God said: “Abraham, Isaac is the man through whom the Messiah would come into the world.” \n \nAnd, when darkness came, Abraham held on to that promise and must have said: “Dear God, I believe you. \n \n“And I take my son up there and you allow me to take his life. You are going to have to raise him from the dead because I am holding you to your word.” \n \nHow’s that for real faith? \n \nAbraham had his priorities straight: God first \n \nNot like Eli, the high priest, the sweet old man who helped Samuel find the Lord. \n \nGod told him one time: “Eli, you prefer your sons above me because, when they do evil, you don’t restrain them.” \n \nEli’s sons, who were also priests, were tampering with offerings of the temple. This was a serious offence because those offerings pre-pictured Christ’s sacrifice on the cross. \n \nThe boys tampered with offerings of the Lord and, beyond that, they committed immorality with women worshippers in the precinct of God’s temple. \n \nAnd, instead of tearing their priestly robes off, all Eli would say was: “Naughty, naughty. Daddy wishes you won’t do that.” \n \nEli’s priorities were mixed up. God said: “You prefer your sons above me.” \n \nFathers, grandpas, let us remind ourselves we are the priests of the families we represent. \n \nAnd, it’s our job to raise children and grandchildren as His followers no matter what the cost may be. \n \nKTW welcomes  submissions to its Faith page. Columns should be between 600 and 800 words in length and can be emailed to editor@kamloopsthisweek.com .  Please include a short bio and a photo. \n \n ", "source": "Kamloops This Week"}