{"published": "2015-09-24T12:45:00Z", "media-type": "Blog", "title": "Inquiries into Islamic State intelligence scandal expand", "id": "19be8f69-709e-4ad8-8fbc-e7e41fc48510", "content": "There are now multiple investigations inside the intelligence community and on Capitol Hill into whether senior intelligence officers at U.S. Central Command altered intelligence assessments of the U.S. war against the Islamic State. The main whistleblower will meet with senior senators on the matter as early as next week.\rIn addition to the Pentagon inspector general's investigation into allegations by dozens of intelligence analysts, other inspectors general inside the intelligence community and two oversight committees in Congress have begun their own probes, according to senior lawmakers and intelligence officials.\rThe Congressional investigations will expand the scope of the existing inquiry by examining allegations of intelligence tampering that predate the war against the Islamic State, some dating back years.\rStaffers from the Senate Select Committee on Intelligence and the Senate Armed Services Committee have already met with the main whistleblower to discuss the allegations, Senate sources told us. The lawmakers in charge of those committees are working to schedule another meeting with him soon.\r\"We're on it,\" Armed Services Chairman John McCain, R-Ariz., told us. Asked if the allegations of intelligence tampering go beyond just reports on the yearlong war against the Islamic State, he said: \"That's my understanding, but I have no hard evidence of that. That's why we are going to have this meeting.\"\rDevin Nunes, chairman of the House Permanent Select Committee on Intelligence, said he and other relevant House committees are starting to probe the most recent allegations of intelligence manipulation as well as past charges that intelligence was suppressed at U.S. Central Command, also known as CENTCOM.\r\"We are encouraging additional whistleblowers to come forward,\" Nunes, R-Calif., told us. \"We are initiating a process to gather information about this, and we are working closely with all the committees of jurisdiction to have a coordinated effort.\"\rNunes also told us that there are now multiple inspectors general inside the intelligence community investigating the allegations made by CENTCOM analysts.\nOther lawmakers, such as Republicans on the Senate Select Committee on Intelligence, have urged the inspector general for the entire intelligence community, housed at the Office of the Director of National Intelligence, to open an investigation into the matter. Instead, that inspector general will be assisting the Pentagon inspector's inquiry, a senior intelligence official told us.\rAndrea Williams, the spokeswoman for the inspector general for the intelligence community, told us her office is \"not conducting a parallel or joint investigation into allegations raised concerning activities at CENTCOM. We are providing liaison assistance to the Department of Defense Inspector General.\" She added that when Defense Department's inspector general completes its report, her office will determine whether to further review the allegations.\r\"Our goal is to ensure that we know, at the end of this evaluation, whether the intelligence provided to senior federal decision-makers was analyzed according to the rules and regulations\" promulgated through relevant directives on such oversight.\rThe roots of the intelligence scandal go back to July when The New York Times reported that the Pentagon's inspector general had launched an investigation into allegations that intelligence products had been distorted by CENTCOM's top intelligence officer. The Daily Beast earlier this month reported that 50 CENTCOM analysts backed up the allegations in the initial complaint, an almost unprecedented revolt inside military intelligence.\rU.S. intelligence officials tell us the objections began when an analyst in charge of Iraq intelligence at CENTCOM for more than 13 years complained through intelligence community whistleblower processes that the assessments produced by his unit were being rejected or distorted before they reached decision makers.\rOne former senior U.S. military official familiar with the charges told us the frustrated analysts were being asked to assess progress in the war against the Islamic State based on statistics of airstrikes, vehicles hit, or enemy fighters killed, statistics that are meaningless without deeper context about the Islamic State's ability to recruit forces or hold territory.\rThe analysts also wanted to evaluate the adversary's core strength, command-and-control structure, and ability to recruit and move forces within its territory.\rTop officials like Secretary of State John Kerry have used isolated statistics to show progress, but those figures often do not stand up to scrutiny. Retired Gen. John Allen, who will resign this fall as the president's envoy to the collation against the Islamic State, used to say that half of the group's leaders in Iraq had been killed. That was an exaggeration.\rNunes told us that he was also looking into earlier complaints about pressure on intelligence analysts that predate the current war against the Islamic State. Last week, Fox News and the Weekly Standard reported that Nunes in 2012 arrived at the Tampa CENTCOM headquarters for a meeting with analysts on the documents seized in the 2011 raid on Osama bin Laden's compound in Pakistan, only to be told later that no analysts were working on that particular Saturday. Nunes said he learned later that this was not true.\r\"Dating back to 2012, people within Central Command came to me with very damaging allegations about the intelligence process and specifically as it related to access to the bin Laden documents,\" Nunes told us.\rNunes may end up learning that the problem was only within U.S. Central Command. But if his investigation also implicates other senior U.S. intelligence leaders, the issue could become sensitive for the White House. The Obama administration has not had a major intelligence scandal like the one that so weakened the administration of George W. Bush after the invasion of Iraq. But then again, the Obama administration has never before faced a revolt on the scale of what is happening inside CENTCOM now.\rEli Lake is a Bloomberg View columnist who writes about politics and foreign affairs. Josh Rogin is a Bloomberg View columnist who writes about national security and foreign affairs.", "source": "Daily Newsletter Feed"}