{"published": "2015-09-08T00:41:00Z", "media-type": "News", "title": "GLOBAL MARKETS-Asian shares wary ahead of China trade data, Shanghai open", "id": "9241e6f8-fdfa-4bf7-a1fb-4a8e48fd7795", "content": "* Asian shares edge up tad, eye on China trade data \n\r\n\t\t\t\t\t\r \nChina FX reserves highlight China capital outflows \n\r\n\t\t\t\t\t\r \n* Emerging currencies with limited FX reserves under pressure \n\r\n\t\t\t\t\t\r \nBy Hideyuki Sano \n\r\n\t\t\t\t\t\r \nTOKYO, Sept 8 (Reuters) - Asian shares edged higher on Tuesday and U.S. stock futures jumped following the lead of European stocks overnight, but investors were cautious ahead of China data which could give more clues on the health of the world's second-largest economy. \n\r\n\t\t\t\t\t\r \nMSCI's broadest index of Asia-Pacific shares outside Japan rose 0.1 percent in early trade but is still down 0.9 percent so far this week and is not far from a three-year low hit two weeks ago. \n\r\n\t\t\t\t\t\r \nU.S. stock futures jumped almost 1 percent after a market holiday on Monday, erasing a large part of gains made after Friday's mixed U.S. employment report. \n\r\n\t\t\t\t\t\r \nJapan's Nikkei rose 0.1 percent, extending its rebound from a seven-month low hit early on Monday. \n\r\n\t\t\t\t\t\r \nEuropean stocks rose on Monday, lifted by mining and commodities giant Glencore after it pledged to slash its debt by a third. \n\r\n\t\t\t\t\t\r \nStill, investors will be glued to China trade data at 0200 GMT, which is expected to show a further contraction in both imports and exports in August. \n\r\n\t\t\t\t\t\r \nChinese shares fell on Monday after a long weekend with tighter futures trading rules and supportive comments by China's central bank governor failing to stem selling pressure. \n\r\n\t\t\t\t\t\r \nAlso highlighting the sheer size of Beijing's market intervention to halt a slide in the yuan, China's foreign exchange reserves posted their biggest monthly fall on record, $94 billion, in August, data showed on Monday. \n\r\n\t\t\t\t\t\r \nThe drop revived concerns that the government may have to let the currency weaken further after its surprise devaluation in mid-August, adding to pressure on other emerging market currencies. \n\r\n\t\t\t\t\t\r \n\"The fall was larger than market expectations... Coupled with other data, it shows that the Chinese authorities have been intervening to support the yuan as capital outflow continues,\" said Shin Kadota, chief FX strategist at Barclays in Tokyo. \n\r\n\t\t\t\t\t\r \nOn Monday, Malaysia's ringgit plumbed fresh 17-year lows while the South African rand slipped to a record low, both under pressure because of relatively limited foreign currency reserves. \n\r\n\t\t\t\t\t\r \nWith U.S. financial markets shut for holiday on Monday, the dollar moved little against major currencies. \n\r\n\t\t\t\t\t\r \nThe dollar index stood at 96.206, little changed from late last week. \n\r\n\t\t\t\t\t\r \nAgainst the yen, the dollar ticked up slightly to 119.45 yen , still half-way in recovering its losses on Friday. The euro stood little changed at $1.1159. \n\r\n\t\t\t\t\t\r \nOil prices fell more than 3 percent on Monday, as the fall in Chinese share prices and record North Sea crude production added to global supply concerns. \n\r\n\t\t\t\t\t\r \nBrent crude futures rose 0.9 percent to $48.02 after a 3.7 percent fall on Monday. They still traded below the 50 percent retracement of their rally late August to $54.32 from 1/2-year low of $42.23. \n\r\n\t\t\t\t\t\r \n(Reporting by Hideyuki Sano; Editing by Eric Meijer & Kim Coghill)", "source": "CNBC"}