{"published": "2015-09-03T17:08:49Z", "media-type": "Blog", "title": "Simple Lang Restaurant Review", "id": "c8b2d2b9-488c-49fe-95b9-83e4f53b2717", "content": "Simple Lang Restaurant Review What can you expect from a restaurant with such a name as Simplé Lang? You’d think it’d be a pretty simple affair as their moniker suggests, but just look at the é at the end of the first word and you’d probably have a rethink coming. As one of the outside graffiti boldly states on one of their glass walls, Simple and yet so arte! Well, that’s a dead giveaway that we’re probably dealing with a conyo restaurant right here. SIMPLE RED AND WHITE INTERIORS As I flipped through their menu, it quickly became apparent that that é has everything to do with what Simplé Lang stands for. The restaurant serves classic Filipino comfort food, but with a not-so-very-slight twists that makes them more interesting than say, finding them on you usual favorite carinderia or gotohan. Take their Pancit Tinola for example. If I had to guess what the following hour would be from that alone, I would surmise we’re gonna be in for a surprising food session. THE RESTAURANT’S OPEN KITCHEN Simplé Lang is located at the strip of food venues along the Ayala Triangle. It’s relatively new in the scene, having just opened April last year. There are outside seats for people who prefer to dine al fresco and a mezzanine, for those wanting a bit of privacy. While these restaurants are usually filled to the rafters with diners during regular days, we went there on a Sunday; the whole of Ayala was a ghost town and we had the whole floor to ourselves. SOSI CONDIMENTS AND #TUSOKTUSOK (PHP130.00) We were quite a big group and it was decided that instead of each ordering a separate dish from their menu, we’ll simply consolidate all those we wished to have into one big order, that way we can taste most of what the restaurant has to offer. FRESH LUMPIA ROLLS (PHP95.00) + ILOCOS STYLE SISIG EMPANADA (PHP175.00) Soon, plates of familiar Filipino snacks, treated with that é flair started to fill our tables. For starters we had #tusoktusok, fresh lumpia rolls, Ilocos-style sisig empanada and totoong tokwa’t baboy. The #tusoktusok is basically a mix of skewered fried streetfood usually found on your favorite street corner. It has everything from isaw, squid balls, fish balls, kikiam and even pork ears! Unfortunately, I find it to be quite ordinary—well except that you’re pretty assured that they’re very clean compared to manong’s offerings outside. By contrast, the muscovado sugar used in the sauce to lather their lumpia and the special sisig sandwiched in between the crunchy outer shells of their empanada, made these other duo a more memorable afternoon delight.   CRISPY PALABOK (PHP275.00) + PANSIT TINOLA (PHP195.00) For our main course, we decided on Simplé Lang’s crispy palabok, simpleng arroz caldo, batchoy yan, pansit tinola, totoong tokwa’t baboy and gasp, sinigang na crispy bagnet sa watermelon! I can tell that their menu borders on the outrageous, but I never did mind. I remember what I always tell people who ask me what I want to order, Surprise me. BATCHOY YAN (PHP195.00) + TOTOONG TOKWA’T BABOY (PHP195.00) The arroz caldo and batchoy—which for some reason has chunks of chopped donuts floating among the mix of anchovies, chicharon and greens (and it amazingly works, by the way)—were quite traditional in a sense that they still capture the good qualities of these usual afternoon Filipino meriendas. The spicy tokwa’t baboy, compliments these extremely well. For the noodles, pansit tinola, which I was particularly intrigued didn’t quite made it in my book. While its spaghetti noodles did capture the tinola flavor, everything else seemed soggy. I’m thinking, if they used crispy fried chicken with a stronger flavor instead of the soft tinola chicken they top it with, this dish might actually work. Being a kid who grew up in Malabon, the palabok was quite a surprise. The atsuete sauce that completes this dish is provided on a separate bowl and is mixed with the crunchy rice noodles before consumption. While it has the usual shrimp, eggs and crushed pork rind toppings, and its sauce is spot on; It is the noodle’s crisp texture that made this stand out. Majority within our group actually voted this to be Simplé Lang’s best offering. SINIGANG NA CRISPY BAGNET SA WATERMELON (PHP395.00) The sinigang, I was actually dreading. I mean, I love sinigang and I love watermelons, but I just don’t see the two coming together! What made me dip my spoon, or rather my fork, over to this dish was actually the crisply fried bagnet portions that I saw swimming along its reddish soup. This is one of the weirdest, if not the weirdest, sinigang I’ve seen and had. And the taste? I actually didn’t find it anything like sinigang. It drew mixed reactions from my friends, some immensely liked it, a few immensely didn’t. HOT GINATAANG BILO-BILO (PHP150.00) TURON BITES (PHP95.00) And if you thought that our food odyssey ended there, well, there’s still dessert! Two Filipino staples again made it to our table, hot ginataang bilo-bilo and turon bites. The ginataan, we were told, are served hot during rainy days and cold during hot days. Genius! The turon, which looked like deconstructed versions of the popular merienda, was deceivingly simple-looking but was superlatively good. SIMPLE & YET SOOO ARTE! These two won our hearts completely, making us decide that this restaurant’s food, while conyotic, was much more than what its name suggest. Simplé Lang is anything but simple. Simplé Lang Address: Ayala Triangle Gardens, Ayala Avenue               Makati City, Metro Manila Contact Number: (02) 621-6162 Open Hours: 10:00 AM to 10:00 PM Daily Menu: Click Here Facebook: Click Here GPS Coordinates Map: 14.556303, 121.024072 For more restaurants and food finds, download OpenSnap app from App Store or Google Play. ´ Posted by Christian Sangoyo on Friday, September 4, 2015 0 comments categories: 2015, [FOOD TRIP], Makati City, National Capital Region, Restaurant", "source": "Lakad Pilipinas"}