{"published": "2015-09-02T16:11:33Z", "media-type": "News", "title": "New study upholds idea that gun deaths happen when it's easy to get guns", "id": "de41292e-7e4e-4fd0-aece-22fef70a1a56", "content": "Jim Young/Reuters \nA new study published in Preventive Medicine suggests the easier it is for a person to get a gun, the more likely he or she is to use it for deadly means. \nThe findings poke some holes in the idea that regulating gun sales through background checks and licensing aren't effective in reducing firearm death rates. \n\nThis news comes at a time when the national gun homicide rate is triple the second-leading industrialized country and suicide is the second-leading cause of death among people 15-34 years old. \n\nResearchers from Johns Hopkins University Bloomberg School of Public Health conducted the study. They drew data from Missouri and Connecticut, comparing how changes to each state's gun laws affected the suicide rate in that state. \n\nIn 1995, Connecticut began requiring a license or permit to buy a handgun in addition to passing the existing background checks. That extra hurdle, the researchers found, led to a 15.4% drop in firearm-related suicides. \n\nOn the other hand, in 2007 Missouri decided to repeal the part of its law that required people to have a license before buying a handgun. The team's analysis suggests that led to a 16.1% increase in suicides by guns. \n\n\"Contrary to popular belief, suicidal thoughts are often transient, which is why delaying access to a firearm during a period of crisis could prevent suicide,\" said Daniel Webster, study author and director of the Johns Hopkins Center for Gun Policy and Research. \n\nThe study follows up on other research from Johns Hopkins that found Connecticut's and Missouri's law changes led to similar effects on homicide rates by firearms: C onnecticut's newly toughened laws led to a 40% drop, while Missouri's relaxed laws led to a 25% increase. \n\nAndy Kiersz / Tech Insider \nA case study from Australia offers hope the Connecticut model could work over the long term. \nIn 1996, the country saw the worst massacre in its history. Immediately, the government banned the import of all automatic and semiautomatic weapons, and proposed a buyback for anyone who wanted to sell their guns to the Australian government. \n\nBetween October 1996 and September 1997, some 700,000 guns were destroyed. It was the single-largest destruction of civilian firearms of any country between 1996 and 2005. An estimated $500 million was paid back to former gun owners. \n\nIn 1996, the country saw 516 gun deaths. In 2012, it saw only 226. \n    Please enable Javascript to watch this video", "source": "Business Insider India"}