{"published": "2015-09-21T21:46:03Z", "media-type": "News", "title": "Gold falls from near three-week high", "id": "30293274-6fa9-4030-ad24-8be84fe976b9", "content": "GOLD has retreated from the previous session's near three-week high as strength in stocks and the US dollar dampen a rally fuelled by the Federal Reserve's decision last week to keep US interest rates on hold.  \n   \nWALL Street and European stocks rebounded more than one per cent in rallies that, along with gains in the US dollar and global oil markets, pointed to a tentative recovery in investor confidence after the Federal Reserve delayed an interest rate rise. \nSpot gold was down 0.5 per cent at $US1,132.80 an ounce at 3:06 pm EDT (0506 Tuesday AEST), while US gold futures for December delivery settled down 0.4 per cent at $US1,132.80 per ounce. \"The weaker euro and a little recovery in the equity markets has robbed it (gold) of a bit of its steam,\" said James Steel, chief metals analyst for HSBC Securities in New York. \"The fact that the Fed didn't raise rates last week is going to lend some sort of long-term support to the market.\" Gold held in a narrow range earlier this month on uncertainty over whether the Fed would hike rates for the first time in nearly a decade, lifting the opportunity cost of holding non-yielding bullion while potentially boosting the US dollar. It rose sharply after the Fed shied away from a hike on Thursday, peaking at $US1,141.50 the following day, but has now retreated below that level. With the Fed still expected to hike rates before the end of the year, gold could come under pressure again. \"My personal feeling is that the Fed still wants to raise rates and still expects to, but that there is still considerable uncertainty over the timing,\" Mitsui Precious Metals analyst David Jollie said. \"While the market expects rates to rise, any upside for gold should be somewhat limited.\" Later in the session, Atlanta Fed President Dennis Lockhart said that the six weeks until the Fed's next meeting in October may not be enough time to quell concerns about the global economy and possible risks to the US recovery. Silver rose 0.1 per cent at $US15.17 an ounce, while platinum was down 1.3 per cent at $US966.25 an ounce and palladium was up 1.3 per cent at $US610.75 an ounce. China's platinum imports rose 16 per cent in August, while palladium imports fell nearly 37 per cent and silver imports more than doubled. \"The silver price is clearly finding support from China again,\" Commerzbank said in a note.", "source": "Tasmania Mercury"}