{"published": "2015-09-26T16:16:10Z", "media-type": "News", "title": "Mauricio Pochettino tells Tottenham to keep calm after Manchester City win", "id": "20c1eb76-ca8c-4c45-bd1f-dc16048e27fd", "content": "Tottenham underlined their \"massive\" potential by comprehensively beating table-topping Manchester City, but head coach Mauricio Pochettino has told his players to keep calm and carry on. \n \nSpurs have endured a wretched recent run against Manuel Pellegrini's side and looked like they may fall to a fifth consecutive defeat to them when Kevin de Bruyne netted. \n \nHowever, an impressive comeback - thanks in part to a dollop of luck - saw the north Londoners secure a surprise 4-1 victory at White Hart Lane. \n \nEric Dier drew parity on the stroke of half-time by hammering home at the end of a move started by the clearly offside Kyle Walker - a strike added to after the break by Toby Alderweireld and Harry Kane's first club goal in 748 minutes. \n \nErik Lamela coolly rounded the goalkeeper to add extra gloss to a win secured by the Premier League's youngest line-up this season. \n \n\"We are very pleased and very happy,\" Spurs head coach Pochettino said. \n \n\"We have big potential, we are very young. I think that today was the (our) youngest team and this is important. \n \n\"The potential is massive but we need to keep the feet on the grass because you know always after a big win you need to keep your feet on the grass. \n \n\"Now, this is our tough job but I am very pleased with the result. We can discuss different things but in the end I think we fully deserved the victory.\" \n \nThe result moved Spurs within three points of Man City and afterwards talk quickly turned to a top-four tilt. \n \n\"We need to keep calm, like the shirt,\" Pochettino said. \"In Spain, a lot of the kids have 'keep calm', 'keep calm' on their t-shirts. \n \n\"This is true because we are very young. Now after three victories in a row in the Premier League, it is very important for us. \n   Promoted stories   \n\"It is important for them to believe in the way that we play and our philosophy of how we do our job, b ut remain calm because it is only the beginning of the season and nothing has happened yet. \n \n\"We have a long way ahead.  We are very young and sometimes we can confuse quick.\" \n \nAs well as joy, there was a palpable air of relief around White Hart Lane when fans' favourite Kane netted. \n \nThe England international has struggled to scale the heights he achieved during his exquisite breakthrough season, but his reaction strike after Christian Eriksen hit the bar ended a long, frustrating drought. \n \n\"It is very important for him, very important for us to help the team,\" Pochettino said. \"I think it was great for him to take off the pressure.\" \n \nPressure is something that is building at City after a third loss in four matches in all competitions, especially with injury problems mounting. \n \nJoe Hart and Yaya Toure are doubts for this week's Champions League tie at Borussia Monchengladbach, which captain Vincent Kompany will almost certainly miss with a calf complaint. \n \nThings could have been so different for City had they maintained their lead, which would have been easier had offside been called when Dier and Kane scored. \n \n\"It is difficult to stay despite those two goals, but I think we played very well in the first half,\" City boss Pellegrini said. \n \n\"We played very well but we just scored one goal and had two or three clear chances. \n \n\"Really, Tottenham only had one shot on our goal in the first 40 minutes and after that they scored that clear offside goal. \n   \n Share article  \n   \n\"And the second half, two set pieces - one of them was also offside - that decided the game. \n \n\"After that they played very well, we looked very bad.\"", "source": "Malvern Gazette"}