{"published": "2015-09-15T10:31:17Z", "media-type": "Blog", "title": "100M LCD Display Alarm Transducer Sonar Sensor Fish Finder Fishfinder B15", "id": "e38528e7-2c43-45ba-962d-e0af4d7d11a4", "content": "Click here to buy! \n \nbest2shop15 \nSpecifications \n \nFeatures:100M Portable Sonar Fish/Depth Finder Alarm Transducer Fishfinder Alarm Fishing1. Detect and display grass, short & tall weeds, sand, and rocks on seabed2. Get the approximate location of fish and the depth of water3. Round transducer sensor with 7.5 m cable, 45-degree beam angle4. With fish depth scale and audible fish alarm5. User selectable meter or feet readings6. Range of depth readout from 0.7 meters up to 100 meters7. Display bottom rock or grass8. Removable floatSpecification:Display : TN/ANTI-UV LCD with LED back-lightingDepth range :0.7m to 100m (2ft to 328ft)Sensor Beam Angle :45 degrees Package Content: 1 X Fish Finder 1 X Round transducer with 25ft Cable 1 X Stainless Bolt 1 X Stainless Wing Nut 1 X Neck Strap 1 X User Manual \n\n \nPictures \n \nShipping \n \n \nItem will be shipped from USA . \n \nYour item will be dispatched within 24hours(except weekend and holiday)after full payment is received . \n \nWe will ship your item with USPS,or DHL then transit to USPS, FedEx  then transit to USPS, package usually takes 3-10 business day(except holiday) .         Shipment Type      Tracking Number Type      Tracking Website          USPS       94001102008286902647099200190100075312813813      USPS             DHL¡ªUSPS      9374869903500479728604      Please go to ¡°DHL eCommerce¡± to check your order          FedEx¡ªUSPS      148685360219775      FedEx \nPayment \n \nWe accept PayPal only.          Payment must be received within 3 Days from the date of purchase.          Please leave note in PayPal when making the payment if you have any special request (colors/size).               Orders will be processed instantly and dispatched in same day normally, so we do NOT accept any Email/Message note before or after you place orders. \nRefund \n \nWe offer 14 days return policy. Please contact us within 14 days t from the date you receive your order if you have any issues with the product and would like to return.          All returned items MUST BE in the original packaging and you MUST PROVIDE us with the shipping tracking number, specific reason for the return, and your eBay ID .          We will refund YOUR FULL WINNING BID AMOUNT, upon receipt of the item in its original condition and packaging with all components and accessories included, AFTER BOTH Buyer and Seller cancel the transaction from eBay. OR, you may choose to have a replacement.               Buyer is responsible for return shipping cost. \nFeedback \n \nIf you have any questions, please feel free to email our service specialists 24 Hours a Day, 7 Days a Week.We will reply you ASAP. If no response within 24 Hours, please check the spam in your mail box.          We greatly appreciate your POSITIVE feedback. Please do NOT leave negative feedback without asking for help.          Our aim is to provide Top Level Customer Service, normally so we will try our best to solve any problem.               Please DON’T leave negative or neutral feedback if you haven’t received item in 30 days, because we have mentioned the shipping time repeatedly.", "source": "High Tech Fisherman"}