{"published": "2015-09-29T20:56:25Z", "media-type": "News", "title": "Australia takes another tilt at United Nations Security Council seat", "id": "a24e7681-2640-483f-81d5-b20d8ec7165a", "content": "Australia is to launch another bid for a seat on the United Nations Security Council, just a year after its last term on the Council expired. Australia is to launch another bid for a seat on the United Nations Security Council, just a year after its last term on the Council expired. The spot Australia is seeking will be open in 2029.\n\nThe Foreign Minister, Julie Bishop, is expected to make the announcement in her address to the General Assembly on Tuesday evening in New York.\n\nIn Opposition the Coalition , which was pursued by the Gillard and Rudd governments, saying it was a waste of money and would risk Australia having to compromise on foreign policy to woo votes, Fairfax Media reported at the time.\n\nThe bid cost around $25 million.\n\nBut in office the Coalition government effectively used its increased influence at UN to help drive the investigation of the downing of MH17.\n\n\"Australia served with distinction throughout our last two-year term, which ended in December 2014. We championed initiatives that directly supported our national security interests, taking the lead on a number of landmark resolutions,\" said Ms Bishop in a statement.\n\n\"Australia chaired the Al Qaeda, Taliban and Iran sanctions committees and coordinated the Council's work on Afghanistan. We pressed for a concerted international response to the rise of Da'esh and the threat of foreign terrorist fighters.\n\n\"Australia promoted the linkages between human rights protection and political stability and security, including putting the human rights situation in North Korea on the Council's formal agenda.\"\n\nAustralia won its last rotating seat on the body after an intensive lobbying effort.\n\nThe foreign minister at the time, Bob Carr, described it as a \"big, juicy, decisive win\".\n\nThe council, charged with maintaining global peace and order, is made up of five permanent members, with veto powers, along with ten non-permanent members.\n\nIn July Russia, a permanent member, blocked a proposal supported by Australia to have the Council establish a tribunal to prosecute anyone who might be charged as a result of the investigation into MH17.\n\nCountries normally announce their candidacies years in advance, and the 2029-2030 term is the first available seat that is not already being contested.\n\nThis gives Australia the greatest chance of success and minimises the cost.\n\nFollow FairfaxForeign on Twitter Follow FairfaxForeign on", "source": "Blayney Chronicle"}