{"published": "2015-09-30T15:44:26Z", "media-type": "News", "title": "Cloud Security Alliance Releases New Guidance for \"Identity and Access Management for the Internet of Things\"", "id": "39d69102-729c-4a24-8bd3-35174216eeb1", "content": "SOURCE Cloud Security Alliance\n\nInternet of Things (IOT) Working Group Provides Easily Understandable Recommendations for Securely Implementing and Deploying IoT Solutions\n\nLAS VEGAS \n\nThe IoT introduces the need to manage exponentially more identities than existing IAM systems are required to support. The security industry is seeing a paradigm shift whereby IAM is no longer solely concerned with managing people but also managing the hundreds of thousands of \"things\" that may be connected to a network. In many instances these things are connected intermittently and may be required to communicate with other things, mobile devices and the backend infrastructure. \n\n\"This document is the first in a series of summary guidance aimed at providing easily understandable recommendations to information technology staff charged with securely implementing and deploying IoT solutions,\" said Brian Russell \n\nTo help security practitioners ensure the integrity of their IoT deployments, the report details 23 recommendations for implementing IAM for IoT which are drawn from real-world best practices culled by CSA's IoT Working Group along with guidance from a number of other organizations including the Kantara Initiative, FIDO, and the IETF. Some of these recommendations include: \n\nAbout the Cloud Security Alliance\n\nThe Cloud Security Alliance is a not-for-profit organization with a mission to promote the use of best practices for providing security assurance within Cloud Computing, and to provide education on the uses of Cloud Computing to help secure all other forms of computing. The Cloud Security Alliance is led by a broad coalition of industry practitioners, corporations, associations and other key stakeholders. For further information, visit us at www.cloudsecurityalliance.org, and follow us on Twitter @cloudsa.\n\nLogo - http://photos.prnewswire.com/prnh/20130723/DC51526LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/cloud-security-alliance-releases-new-guidance-for-identity-and-access-management-for-the-internet-of-things-300151671.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WSFX-TV"}