{"published": "2015-09-17T12:03:58Z", "media-type": "News", "title": "QuickLogic Upgraded to Hold at Zacks (QUIK)", "id": "b905e8b2-d75b-4a84-9081-58bb7e283fb8", "content": "Zacks upgraded shares of QuickLogic (NASDAQ:QUIK) from a sell rating to a hold ratingin a research note published on Wednesday, Analyst Ratings Network.com reports. According to Zacks, “QuickLogic Corporation develops, markets and supports advanced Field Programmable Gate Array, or FPGA, and Embedded Standard Product, or ESP, semiconductors and the software tools that enable design engineers… \r \nZacks upgraded shares of QuickLogic (NASDAQ:QUIK) from a sell rating to a hold ratingin a research note published on Wednesday, Analyst Ratings Network.com reports. \n\nAccording to Zacks, “QuickLogic Corporation develops, markets and supports advanced Field Programmable Gate Array, or FPGA, and Embedded Standard Product, or ESP, semiconductors and the software tools that enable design engineers to use their products. Their ESP devices provide engineers with the ease-of-use, guaranteed functionality and high-performance of standard products, combined with the flexibility of programmable logic. \n\n“ \n\nShares of QuickLogic (NASDAQ:QUIK) opened at 1.68 on Wednesday. QuickLogic has a 12-month low of $0.95 and a 12-month high of $3.43. The company has a 50-day moving average price of $1.44 and a 200-day moving average price of $1.65. The company’s market cap is $95.07 million. \n\nQuickLogic (NASDAQ:QUIK) last issued its quarterly earnings results on Wednesday, July 29th. The company reported ($0.06) earnings per share (EPS) for the quarter, topping the Zacks’ consensus estimate of ($0.07) by $0.01. The company had revenue of $5 million for the quarter, compared to analyst estimates of $5.50 million. During the same period in the prior year, the company earned ($0.04) EPS. The company’s quarterly revenue was down 27.3% compared to the same quarter last year. On average, analysts predict that QuickLogic will post ($0.24) earnings per share for the current year. \n\nSeparately, Roth Capital reissued a buy rating and set a $2.00 price objective on shares of QuickLogic in a report on Wednesday, August 19th. \n\nQuickLogic Corporation develops and markets semiconductor and software algorithm solutions. The Company is a fabless semiconductor company that designs, markets, and supports primarily customer specific standard products (NASDAQ:QUIK), and field programmable gate arrays (FPGAs), sensor software algorithms, software drivers, associated design software and programming hardware. The Company’s CSSPs are customized semiconductor solutions created from the solution platforms, inclu…", "source": "MyInforms"}