{"published": "2015-09-30T14:00:00Z", "media-type": "News", "title": "Tom Cruise Sells Hollywood Hills Home for $11.4M", "id": "6ac4e382-4ef3-483a-995e-4e08bf86e676", "content": "Tom Cruise \n \nTom Cruise has sold his estate in Hollywood Hills for $11.4 million - almost two million less than the asking price. \n \nThe 53-year-old actor has managed to flog the luxurious property, situated in the heart of the Santa Monica Mountains, two years after it went on the market, but he was undoubtedly left disappointed when the luxury mansion failed to sell for the original listing price of $13 million. \n \nThe gorgeous home, which boasts stunning views of the city below, is complete with a huge outdoor paved terrace perfect for those warm evenings watching the sun go down. \n \nThree large bedrooms, each featuring en suite bathrooms, with high ceilings and stylish interiors make up the house, while the farmhouse-style kitchen with a white butler sink and plenty of storage space sits in the heart of the home. \n \nThe spacious living room comes with a large open fire and a white marble-effect surround, while the white wooden ceiling beams and light decor adds some character to the place. \n \nA large outdoor pool sits in the back garden, ideal for the summer months, and a luxury spa provides a relaxing environment after those long, tiring, days at work. \n \nA wine cellar is situated to the side of the house and provides plenty of storage for those bottles of booze, while the nearby tasting room offers a tranquil place for afternoon meetings and early evening gatherings. \n \nThe estate also comes with a huge guest house, boasting four bedrooms, four bathrooms and a kitchen, for when relatives stop by for a mini vacation, according to Zillow. \n \nMeanwhile, Tom seems to be going through a phase of selling his houses as he recently put his Colorado home, which he bought in the '90s during his marriage to Nicole Kidman, on the market for $59 million because he no longer uses it.", "source": "MaleFirst Mens Magazine"}