{"published": "2015-09-21T03:30:57Z", "media-type": "News", "title": "I have a malignant brain tumor. But it\\'s not really on my mind.", "id": "6b428a3a-a584-4ac7-a45f-46364ef6e3ab", "content": "Whitney Archer \n\r\nThe last time someone reminded me I have cancer was at a funeral. A woman I barely knew walked up to me, arms open wide. “Whitney, you look so good!” she said, fawning over me and assuring me that I was on her church’s prayer chain. \n\r\nI stood there, blinking and drawing a blank. What was she talking about? \n\r\nThen I remembered: Oh yeah, I have brain cancer. I carry a malignant tumor around everywhere I go. I’m 31 years old and have had brain cancer for five years. The doctors say I might live two years or 18. They have no idea. It’s entirely possible I will die of something else before my tumor kills me. Maybe. \n\r\nAs medical advances and oncological therapies continue to progress, more cancer patients are living longer, even somewhat normal lives. More people are discovering that their diagnoses may not lead to an eventual cure or a death sentence, but an unknown future for their lives and their diseases. We’re on a third path: We have cancer, but we’re mostly okay. For us, cancer begins with a traumatizing diagnosis but eventually becomes a regular part of life, with the occasional MRI squeezed in between kids’ birthday parties and dental appointments. And soon we realize that, not unlike asthma or diabetes, cancer can be a chronic condition. As time passes, a slow-learned truth begins to reveal itself: It is possible to live and die at the same time. \n\r\nI sit in the MRI waiting room next to a woman in a wheelchair. Her torso and arms are covered in a black, fuzzy blanket. She stirs when her husband gives her over-the-counter pain medication, and I catch a glimpse of her limbs: bird-like, with sagging skin. Her slim knit turban overstates the obvious. She’s a cancer patient. \n\r\nWe’re both here for the same reason: to see if we are losing the so-called fight. I know from the worn-out hospital bag, the refusal to take off her metallic earrings until the last second, the bleariness, that her story has more treatments, more suffering. \n\r\nI forget that I’m a member of this club. Despite the cancerous tumor, called an astrocytoma, in my brain, I’m the healthiest I’ve ever been. I have no visible scars, no baldness. I weigh 15 pounds too much. I go to work, save money, chase my red-headed son. I eat too much junk food and do penance with organic salad. But every four months, my butt is in that MRI waiting room, surrounded by people who are dying. \n\r\nIt was a fluke, a mistake that they found the tumor at all. An over-the-counter medication for vertigo would have stopped my headaches, but an overly cautious doctor saved my life. The tumor was partially removed, but 60 percent of it remains. It just sits there, causing no headaches or seizures but forcing a new life on my family. \n\r\nToday I’m a cancer patient again, heading back to Exam Room No. 2. A cute technician (normally, I would appreciate this detail, but when he’s staring at my brain tumor for an hour, it’s slightly awkward) hands me earplugs and industrial woodshop-style headphones. \n\r\nHe lowers a metal cage over my head and inserts foam wedges in any leftover spaces. “Don’t move,” the technician chirps as he hands me a panic button. Then the barrage of sounds begins. It goes like this: A crazy person forces me into a plastic barrel, which is then shoved into a metal one. Then, an army of lightsaber-bearing toddlers attacks. Zing! Next, a horde of crazed bees stings in perfect synchronization. Zap! Zap! The whole thing is sent down a waterfall, then surprised by a rib-jarring bear attack. The world’s biggest spring is bounced off the top, over and over. Boing! This goes on for an hour. Just as I’m about to scream, there is silence. \n\r\nDespite the actual test, I enjoy MRI days. They mean a day off work for me and my husband. We drop Nate off at school and brave rush-hour traffic to drive north to the National Institutes of Health in Bethesda, Md. Breakfast in hand, we happily chat in the car, not about work and not about doctors. How many times have we done this? Fifteen? Twenty? “It’ll be fine, right?” I ask. He assures me that yes, this scan too will be good. It always is. \n\r\nThe second a doctor walks into the exam room, she shakes my hand and says, “Your scans are fine.” They always are. \n\r\nCancer is as much a part of my life as the carpool line and grocery shopping; close friends are used to my casual references. They’ll even tease me about playing the tumor card for the last slice of pizza. But sometimes I forget that most people think of cancer as the last stop before imminent death. I’ll look up and notice everyone else standing there, shocked that I mentioned the C word over beers and chips. I’m a total hit at parties. \n\r\nWhile admiring some low-priced Swedish object at IKEA a couple of years ago, I turned to my friend. “Oh, I need that like I need a hole in my head,” I quipped. It took three seconds for us to realize how that line no longer applied. There we were, two grown women in the kids’ section, bent over in gusts of laughter and tears next to the LILLABOs and the DUKTIGs. \n\r\nAfter my surgery, I spent two years holding my breath, waiting for the next MRI to show growth, for me to sit on the crinkly-papered patient bed and listen to bad news. But it didn’t happen. And slowly, minutely, I began to live more and to realize that I felt, well, healthy. \n\r\nI have received no treatment other than surgery, and there were no complications. I have no side effects. There is only a scar underneath my hair. The doctors ask me if I have tremors or have lost any speech. No, I say, and go back to my reading. You’re not taking any medication, they marvel. I’m checking Instagram. \n\r\nFinally, the doctors sigh, “Go live your life.” \n\r\nYears of visits have taught me that they don’t say much. They can’t tell me how long I have, what treatments will work in the future, whether I will develop seizures. I have begged the nation’s best oncologists for information, details. But they all shake their heads. They don’t know. \n\r\n“Nobody knows the future,” one told me. Funny, that’s what my mother said. \n\r\nAnd that’s just it. Last year, one of my son’s first-grade friends lost her father to terminal cancer. “Why do people get cancer?” he asked from the back seat of our Corolla. I waited, terrified, for him to connect that outcome and mine. But he never did. “Cancer makes people die,” he concluded, and I tried to explain that no, not always. Some of us live. \n\r\nIt’s difficult for some people to understand that I’m not cured and I’m not dying. Like my son, many seem to have a binary understanding of this universally feared disease — either you’re cancer-free, or you’re Stage 4 and at death’s door. \n\r\nIf cancer has taught me anything, it’s that how we talk about something informs how we see it. Susan Sontag famously wrote in 1978 about how military terminology is used, wrongly, to discuss illness. With increased survival rates since her own diagnosis, and more people simply living with cancer rather than “battling” it, the metaphor is even less helpful. But the vocabulary persists: Cancer is an invasion; patients wage war against an army of rapidly multiplying cells. The words don’t square with my experience. How am I a conqueror if I’m both sick and healthy? How can I stop an invasion when my disease isn’t on the attack but lying in wait? And if cancer devours my mind, is it because I was a poor general? \n\r\nmy diagnosis, the only metaphor that made any sense was dual citizenship: belonging to both the world of the hale and hearty and the land of death and despair. I may not be fighting for each new day, each new breath, but I’m something of an expatriate from my former life. You could say that I was shanghaied from health five years ago in a cold hospital room in Manassas, Va. Those of us who have been transported step back and forth, with different degrees of agility, between this world and that of illness, while we strive for a regular life. I nearly lost the chance to watch my son learn to read, to go to work five days a week, to paint my bedroom Dew Drop. I revel in normalcy. I haven’t conquered a damn thing. \n\r\nBut being a cancer patient means inevitable loss. I’m more impatient than ever. My son mentioned me being a grandma, and I realized that I don’t picture myself growing old anymore. My timeline has inexorably shrunk to the next MRI and, if I’m being optimistic, next year. Despite my present health, the future holds both hope and terror. \n\r\nThe night before an MRI, I usually find myself in my holey pajamas, crying over work, over something stupid. What’s going on, I wail to my husband. Why do I just want to eat junk food? What kind of mother am I? He reminds me that I am allowed to grieve again and again, that if I feel down for three 48-hour periods every year and that’s as bad as it gets, I’m one of the luckiest ones. He buys me chocolate and pizza. \n\r\nMy son begs for a sibling, but for now, I can’t offer an alternative other than stuffed animals and best friends. Medical research suggests, ever so slightly, that for someone with my medical history, a pregnancy could be fatal. I feel no guilt, no wavering in my decision. \n\r\nStill, there are nights when I watch my son sleep, snoring while classical music plays quietly. Those are the nights I wish I could watch other children sleeping beside him, watch my grandchildren decades from now, and be amazed at the stillness and silence. And standing there, in between the light of the hallway and the shadows of the bedroom, the sorrow comes back, sitting on my chest, and I can’t breathe. \n\r\n— Washington Post", "source": "Frontier Post"}