{"published": "2015-09-14T03:11:04Z", "media-type": "Blog", "title": "After time out, Panthers killed time", "id": "7871c1d6-f1c8-4e20-800d-46d6b1859dd5", "content": "The Jaguars, trailing Carolina 17-9, seemed poised for a comeback with almost 11 minutes left in the game. They had the Panthers pinned on their seven-yard-line and stopped them on third down. The Panthers would be forced to punt from their own end zone — until the officials announced the Jaguars had called time out just before the previous snap and the Panthers would get another play on third-and-10. Carolina took advantage. Cam Newton then threw a 10-yard pass to Jerricho Cotchery, who fought through two tacklers for a first down. “We tried to switch personnel. That one was on us,’’ said Jaguars coach Gus Bradley. “We didn’t get it off fast enough, we called a time out and they converted on that one and kept it going. But we had other opportunities there with a couple of missed tackles that could have gotten us out of that drive.’’ Linebacker Dan Skuta was in the process off running the field, leaving the Jaguars with 10 men, prompting the time out. The Panthers would get three more first downs on the drive, twice converting on third down, before Graham Gano kicked a 47-yard field goal with 2:41 left. The drive took 8:07 off the clock. And it gave the Panthers a 20-9 lead and a two-score margin. And when Blake Bortles threw his second interception of the game on the next possession, that would be the final score. “That’s one of those things. You almost wish you just let them play the third down and we would have gotten off the field,’’ Jaguars linebacker Paul Posluszny said of the timeout. “That stuff happens.’’ Posluszny, though, was frustrated the Jaguars defense allowed the Panthers to extend the drive into a 15-play marathon. Aside from that 64-yard march, the defense allowed the Panthers only 199 yards of offense. It was a methodical drive — the Panthers didn’t have a play that gained more than 12 yards. Newton completed three passes and ran four times. “You say, ’OK, it’s time to move onto the next play when something like that happens,’ ’’ Pozluszny said. “We can’t let that bother us moving forward. It happens. Now it’s time go on to the next play. That’s the disappointing thing about that drive.’’ Veteran Chris Clemons, who had a sack, batted down a pass and blocked a field goal attempt, said: “There were a few things that happened during the course of that drive. “They broke the huddle with 12 men and we don’t complain about that. It won’t mean anything if the refs don’t call it.’’ But Clemons added, “They executed the plays they needed, got the first downs they needed and ran the clock.’’   Vito Stellino: (904) 359-4279", "source": "Jacksonville's Most Recent Headlines - Jacksonville.com and The Florida Times-Union"}