{"published": "2015-09-15T08:43:45Z", "media-type": "Blog", "title": "When Žižek says, “When I was in India…”", "id": "c5d263f5-0c42-4ce7-b28d-56256b2f1363", "content": "Remember the time when Slavoj Žižek delivered the Navayana Annual Lectures in 2009–10, hopping from Delhi to Kochi and then to Hyderabad? He seems to remember it very well, and quite often too. Friends often write in to tell us how he digresses, as is his wont, to say, “When I was in India…” He did that, for instance, in February 2013 in Heidelberg , when in the middle of his ingenious thoughts on Hegel, Marx, Capitalism and Democracy, he spoke of his new hero: Ambedkar. \n \n  \n \nHe did this again at a public lecture delivered at the Institute of Public Affairs in LSE in November 2014. Ten minutes into the talk, “The Need to Censor our Dreams” , he mounted an attack on “the brahmin cultural studies people” who do not shy away even from glorifying the Hindu caste system and discount its critics for their Western imperialist perspective. \n \n  \n \n  \n \n  \n \nŽižek jovially denounced the postcolonial critique of “Western cultural values” for their pretension to be universal. For, he claimed, it has become commonplace to decry egalitarianism, freedom, the welfare state, “and so on” as these words had become emptied of meaning in the cavernous mouths of Western powers trying to gobble up the world in one gulp. And the fortification of Fortress Europe and its paltry and prized possessions of freedom and welfare benefits against the influx of Muslim refugees do not help the case of Western moral superiority either. But instead of devaluing the “Western cultural values”, it is now time to critically reinterpret them and make them “serve as weapons” against the “universalism of capital”. \n \n  \n \nAnd where does Žižek draw inspiration for a more egalitarian tradition? He speaks of his understanding of the Gandhi­–Ambedkar debate and recalls how he immediately felt at home among dalits and their viewpoint. Of Gandhi he said, “You know I have troubles with Gandhi. He was a great guy, he did many great things, but his attitude towards caste was what I’m tempted to call ‘proto-fascist’. He was not for the abolition of castes, his motto was, ‘every caste is divine and they have their own role to play’.” \n \n  \n \nWhen Žižek recalled the members of the Safai Karamchari Andolan telling him that people who clean dry latrines do not want to keep their specific caste identity, the irony of Gandhi’s views was not lost on the audience.  \n \n  \n \n\n \n  \n \n  \n \nŽižek’s exclusive book with Navayana, Agitating the Frame: Five Essay on Economy, Ideology, Sexuality and Cinema , threads its way through topics ranging from Daphne du Maurier, through The Dark Knight Rises , to M.K. Gandhi and attempts to psychoanalyse the whole world. \n \n  \n \n ", "source": "Navayana"}