{"published": "2015-09-23T13:23:08Z", "media-type": "News", "title": "Overhead Door Takes Garage Door Customization To The Next Level With New DoorView® Visualizer", "id": "4bb3c82b-eafa-43ad-801c-7e4e2c36de09", "content": "SOURCE Overhead Door Corporation\n\nLEWISVILLE, Texas \n\nDesigned with homeowners in mind, the DoorView tool gives you the ability to \"try on\" garage doors virtually, and then save, print, send and share your favorite garage door selections. The tool is easy to use and enables you to mix and match from a variety of garage door models and colors, as well as window, glass and decorative hardware options. You can then apply the finished door to a photo of your home or use one of the home images in the DoorView gallery. \n\n\"The new DoorView tool redefines garage door 'customization,'\" said Ali Isham \n\nUsing the DoorView design tool is easy. Just follow these steps:\n\nReplacing an outdated garage door is not only affordable, but it is one of the most prudent projects homeowners can undertake in 2015. According to Remodeling magazine's 2015 Cost vs. Value study, which compares the value of popular home renovation projects, improving the perceived value of a home is as simple as giving the garage a makeover. \n\nThe study evaluated the average $2,944 \n\n\"The DoorView tool helps homeowners enhance their home's curb appeal and takes the guesswork out of choosing the right garage door for their home,\" continued Isham. \"Customers are always amazed with the vast number of possibilities and design options Overhead Door offers.\"\n\nFor more information on DoorView, Overhead Door garage doors and openers, or to find an Overhead Door distributor, visit www.OverheadDoor.com, like Overhead Door on Facebook, follow Overhead Door on Twitter or find us on Google Plus.\n\nAbout Overhead Door Corporation Overhead Door Corporation, based in Dallas, Texas \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/overhead-door-takes-garage-door-customization-to-the-next-level-with-new-doorview-visualizer-300147468.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KUSI.com"}