{"published": "2015-09-05T11:49:49Z", "media-type": "News", "title": "13 killed in Tajikistan crackdown after police station attacks: govt", "id": "f8cdcc03-8c46-49a6-bdb5-d329322a6cd6", "content": ":59 \n\nThe operation by both the army and police follows Friday attacks that saw eight policemen and nine militants killed and which the government said were orchestrated by former deputy defence minister Abduhalim Nazarzoda. \n \n“At this time, 32 members of Nazarzoda’s criminal group have been detained, 13 of whom have been eliminated,” the ministry said in a statement. \n \nFour policemen were killed in a shootout with militants on the outskirts of the capital Dushanbe on Friday and another four officers were killed in an attack in the town of Vahdat just outside the capital, the interior ministry said. \n \nA large-scale security operation was underway to find the assailants, who seized a “large amount of weapons and ammunition” during Friday’s attacks, the ministry said. \n \nMore than 500 weapons and ammunition have been seized from group during the operation, authorities said. \n \nThe government has said that 51-year-old Nazarzoda — relieved of his duties on Friday “in connection with a crime committed” — fought on the side of the United Tajik Opposition during a civil war that lasted between 1992 to 1997. \n \nAuthorities have also claimed that the former deputy defence minister was a member of the opposition Islamic Renaissance Party of Tajikistan (IRPT) that the government effectively shut down last week. \n \nThe IRPT has denied that Nazarzoda is one of its members. \n \nNazarzoda and up to eight of his accomplices have fled to the mountains northeast of the capital, the ministry said. \n \nAuthorities have launched a massive air and ground search operation in the area, dispatching military helicopters and additional army units. \n \nNazarzoda — who had served as deputy defence minister since last January — had worked at the ministry since 1999, when anti-government fighters were integrated into state institutions after the civil war. \n \n© 2015 AFP", "source": "Roodepoort Record"}