{"published": "2015-09-08T22:34:05Z", "media-type": "News", "title": "Erin Brockovich accuses feds of lying about mine waste spill", "id": "22f1dc3d-d57e-4806-a01d-00015a3dbe05", "content": "SHIPROCK, N.M. — Environmental activist Erin Brockovich, made famous from the Oscar-winning movie bearing her name, on Tuesday accused the U.S. Environmental Protection Agency of lying about how much toxic wastewater spilled from a Colorado mine and fouled rivers in three Western states. \n \nHer allegation came during a visit to the nation's largest American Indian reservation, where she saw the damage and met with Navajo Nation leaders and farmers affected by last month's spill, which was triggered by an EPA crew during excavation work. \n \nBrockovich said she was shocked by the agency's actions leading up to the release of waste tainted with heavy metals and its response afterward. \n \n\"They did not tell the truth about the amount. There were millions and millions of gallons,\" she said while speaking to a crowd of high school students in Shiprock, New Mexico. \n \nThe EPA did not immediately respond to email and telephone requests for comment Tuesday. The agency initially pegged the spill at 1 million gallons but later said it was likely three times that amount given the readings of stream gauges that recorded a spike in river flows. \n \nThe revision only added to the suspicion of local officials that were criticizing the agency for failing to notify them sooner that the contaminated plume was headed downstream. \n \nUncertainty lingers over the long-term dangers to public health and the environment from the spill, which contaminated rivers in Colorado, New Mexico and Utah. EPA says the threat has eased, allowing treatment plants to start drawing water from the rivers again and ending warnings against recreational activities. But Navajo leadership is skeptical. \n \nA series of congressional hearings investigating the spill will begin Wednesday. Republican committee leaders in the House and Senate say that EPA officials have withheld documents that could explain what went wrong. \n \nNavajo President Russell Begaye also questions the number of gallons released. He recounted for Brockovich what he saw during an unannounced visit to the Gold King Mine near Silverton, Colorado, days after the spill. He said he saw a wide gully that was several feet deep and water continuing to pour out of the mine. \n \nSome Navajo irrigation systems remain shuttered until the tribe receives results from its own water and sediment testing. As a result, Begaye has said thousands of acres of crops have gone dry. \n \nBegaye and Brockovich met with farmers to discuss the effects of the spill on irrigation as well as the legacy of contamination left behind by decades of uranium mining. \n \nDuring the stop in Shiprock, they told the students that it will be up to the next generation to hold government and private industry accountable. \n \n\"It's a terrible disaster, and unfortunately it's a situation we see playing itself out not only on the Navajo Nation, but across the United States of America,\" Brockovich said, referring to pollution and lax enforcement. \n \n\"You are the future and you will be the answers,\" she told the students. \n \nBrockovich was portrayed in the 2000 movie, \"Erin Brockovich,\" which earned actress Julia Roberts an acting Oscar. The environmental advocate helped investigate a major case of groundwater contamination in California in the early 1990s that inspired the film. \n \nAs for the Gold King spill, Brockovich said the federal government needs to clean up the mess. \n \nNavajo officials say the Federal Emergency Management Agency and the EPA have declined the tribe's requests for continued help, including the appointment of a federal recovery coordinator. \n \nA FEMA spokeswoman said the EPA was the lead agency and would be responsible for coordinating with the tribe and other local governments.", "source": "Minneapolis Star Tribune"}