{"published": "2015-09-10T10:15:03Z", "media-type": "News", "title": "Wanted: Bright young brains for national competition", "id": "b3cb631a-c424-47e8-a5b9-cffa032c973f", "content": "A competition has been launched to find the country's best young mathematicians. \n \nThe sixth annual National Young Mathematicians’ Awards offers youngsters aged 9-11 the chance to show of their maths skills in front of the country’s leading mathematicians. \n\nIt is open to teams of four children from schools all over the UK and consists of three rounds, the first of which is a knockout contest from November 10-12. \n\nSchools face off against each other in the regional semi-finals in November 25, with the brightest maths brains making it through to the grand final at the University of Cambridge on December 8. \n\nThe contest is run by tuition provider Explore Learning and Cambridge University's NRICH Project. \n\nLast year more than 1,300 schools entered the competition, which was won by Holbrook Primary School in Horsham. \n\nCarey Ann Dodah, head of curriculum at Explore Learning says: “We had such an overwhelming response to last year’s National Young Mathematicians’ Awards and the enthusiasm, ambition, determination and creativity from all the children that took part in the Grand Final was wonderful to see. \n\n\"Maths is so often regarded as a subject that can put children off their studies but this competition shows that not only is it fun and engaging, but a fantastic opportunity to build on teamwork, reward children’s success, develop their confidence and realise their skills for numbers. \n\n“In all the rounds children are challenged to solve a multi-layered, high-level problem. Teams are assessed on their ability to get to the root of the problem, teamwork and their true mathematical thinking.” \n\nThe deadline for schools to submit a team is October 9. For more information and examples of other past problems visit explorelearning.co.uk/youngmathematicians", "source": "West Midlands Express & Star"}