{"published": "2015-09-29T14:12:07Z", "media-type": "News", "title": "St. Louis mayor pledges more police after post-game shooting", "id": "379a807f-7622-47de-8e91-395e57138d5a", "content": "St. Louis' mayor says police will be out in full force near Busch Stadium as the Cardinals enter the postseason, after a fan was shot and possibly paralyzed following a game.\n\nMayor Francis Slay said he will give Police Chief Sam Dotson \"unlimited overtime\" to put more police on the streets. He said he was concerned about \"a higher level of boldness\" by criminals who show little regard for consequences.\n\nPolice say two men in a car drove up to 43-year-old Christopher Sanna and his girlfriend, and demanded their belongings after the Friday game. The woman gave up her purse and the couple turned to run.\n\nOne of the gunmen fired several shots, hitting Sanna in the back. Doctors believe he likely won't walk again, his mother told the St. Louis Post-Dispatch (http://bit.ly/1KPAd2r ).\n\n\"They said it was shattered, and no surgery could repair it,\" said his mother, Candis Sanna. \"They said he could eventually get a little feeling back, but there was no hope for him to walk. It's horrible.\"\n\nChristopher Sanna, of House Springs, was shot in a parking lot after leaving a game at which he and his siblings celebrated his mother's 60th birthday.\n\nSanna's girlfriend called 911 after the shooting. While on the pavement, he called his mother's cellphone and left a message saying, \"Mom, I've been shot.\"\n\nDotson, the police chief, said police have little to go on in their effort to catch the gunman. No surveillance camera caught the robbery, and the description of the shooter is vague. Still, Dotson called the case a priority and has asked the FBI for help.\n\nSanna manages an automotive store and served six years in the Army. Relatives set up a fundraising site to help with medical bills. As of Tuesday morning, nearly $60,000 has been raised.\n\nCandis Sanna said she expects to be safe when coming and going from a baseball game.\n\n\"You think you're safe after a Cardinals game, and you'd think there are police down there and you wouldn't have to worry,\" she said. \"But there were no police there. I don't know why. You get past Fourth Street and there was nobody around.\"\n\nThe Cardinals hire off-duty police officers to work at the stadium during games, with as many as 25 working inside the ballpark. More are expected for the postseason.\n\nStill, Dotson said the department will increase its presence downtown going into the playoffs.\n\n\"People have to feel safe when they come to a baseball game, and they are,\" he said.", "source": "Modesto Bee"}