{"published": "2015-09-17T21:30:54Z", "media-type": "News", "title": "Report: Federal Air Marshals solicit prostitutes", "id": "91cd77e8-9c75-47ba-b46c-3672a7873c81", "content": "(CNN) -  \nAt least two Federal Air Marshals are at the center of a prostitution investigation by the Transportation Security Administration. \n \nThe TSA's Office of Professional Responsibility and Office of Inspections has launched a probe into allegations two air marshals engaged in sexual activity with prostitutes and recorded the acts on government issued cell phones. In early September the House Oversight Committee received a briefing on the matter from Federal Air Marshal Director Roderick Allison. \n\nA spokeswoman for the House Oversight Committee said the case is out of Chicago and involved three air marshals, but only two have been accused in the prostitution probe. \n\nAccording to Henshaw, \"Agent A\" filed a worker's compensation claim saying they were injured on the the job. \n\n\"Agent B,\" in an effort to disprove \"Agent A's\" workers compensation claim showed investigators footage they captured on a government issued cell phone. Video allegedly shows \"Agent A\" was hurt at a sporting event and not at work. In the process of showing the cell phone video to investigators, video of \"Agent B\" and \"Agent C\" engaging in sexual activity with a prostitute is discovered. \n\nHenshaw cannot confirm where this sexual activity happened and whether the air marshals were on duty when it happened. Members of the oversight committee say they do know the sexual activity involving two federal air marshals and prostitutes was recorded with a government issued phone. \n\nMore questions about this will be asked at Thursday's House Oversight Committee hearing at 2 p.m. on Capitol Hill. The committee will examine personnel actions taken at the Federal Air Marshal Service to address improper behavior, as well as managerial decisions to prevent further misconduct. \n\nTSA spokesman Bruce Anderson said the agency will not comment on the specifics of this case and only provided a statement to CNN. \n\n\"TSA demands the highest standards of integrity and professionalism from its employees,\" Anderson said in the statement. \"When criminal behavior or misconduct is substantiated, TSA vigorously holds its employees accountable. Even though constrained from commenting on an active investigation, we can confirm that two of the employees involved have been placed on an indefinite suspension without pay, and the third employee has resigned from the agency.\"", "source": "Idaho8.com"}