{"published": "2015-09-23T18:10:51Z", "media-type": "Blog", "title": "Nova Scotia political thread", "id": "c711aeb5-6961-4d4a-bbe8-8df7a6dfc527", "content": "Rather than add noise to the Canadian Political Thread, if y'all don't mind, here's a Nova Scotia-specific thread.\nYou'd have thought that Nova Scotian politicians would have learned from the lessons from the 1992 privatization of Nova Scotia Power (i.e., a freakin' disaster). That was the provincial Progressive Conservatives' attempt to balance a budget by selling off a profitable crown corporation.\nNow we have the Liberals in power. They've shown an astounding ability to make all the wrong moves since coming into office, and this is the latest stupidity: more sell-offs of profitable crown agencies, with no small amount of controversy in a situation involving lobbyists and conflict-of-interest allegations:\nNova Scotia registry privatization evaluation moves ahead\nTwo Nova Scotia Liberal operatives \u0097 including Premier Stephen McNeil's former campaign manager \u0097 have ended their lobbying efforts on behalf of an Ontario company pursuing the potential privatization of provincial business, land and motor vehicle registries.\nWinning 2013 campaign manager Chris MacInnes and another Liberal, Jamie MacNeil of Group M5, terminated lobbying activities on behalf of Teranet Inc. on Sept. 22.\nIt comes just days after CBC News revealed MacInnes had lobbied on behalf of Toronto-based Teranet which has won exclusive long term contracts to operate provincial registries in Ontario and Manitoba.\nMacInnes began lobbying on behalf of Teranet Inc in August 2014 as the cash-strapped McNeil government began exploring the idea of privatization.\nExclusive, long-term contracts\nIn Ontario and Manitoba, Teranet made large, upfront payments to provincial governments in exchange for exclusive long-term contracts to operate the land and property registries.\nIn 2010 Teranet paid Ontario $1 billion upfront for a 50-year deal. In Manitoba, the company got a 30-year deal for an upfront payment of $75 million.\nMacInnes lobbied on behalf of Teranet, introducing the company to Service Nova Scotia Minister Mark Furey, after the government began pursuing the privatization option.\n* * * Nova Scotia Association of Realtors said it is concerned a move to privatize the land registry would mean more fees for home buyers in the province.\n\"We've been monitoring this issue since it was brought to our attention earlier this year,\" said NSAR president Gord Burns in the release.\n\"And frankly, we're concerned that privatization of a public service like the land registry could result in higher fees, less publically available data, and reduced access to services.\"\nBased on what happened in Ontario and Manitoba after the land registry was privatized, NSAR said it's concerned the costs for home purchase-related services such as legal and surveyor fees could go up.\n\"If service providers need to pay increased fees to access the registry, then that will be passed on to consumers,\"\n* * * The Opposition NDP focussed on another element in the document.\n\"Respondents may propose a fee increase model. However, in any ASD arrangement the province would establish the parameters for fee increases or changes to balance the respondent's reasonable needs against the financial impact on citizens of the province,\" said a news release.\nNDP Service Nova Scotia critic Sterling Belliveau demanded the McNeil government tell the public what level of fee increase they can expect as a result of privatization.\n\"It's bad enough the privatization of registries will cost the province hundreds of millions of dollars in future revenue along with jobs, but now we learn the McNeil government plan could end up costing Nova Scotians more for basic things like renewing a driver's licence,\" Belliveau said in the second NDP release issued Tuesday on the potential registry privatization. (CBC) via ehMac.ca http://ift.tt/1Kvf67x", "source": "Apple Mac iPod and iPhone"}