{"published": "2015-09-29T09:56:16Z", "media-type": "News", "title": "Volkswagen to refit cars affected by emissions scandal", "id": "8077d12c-c8fa-4820-9895-89ae73537825", "content": "Reuters/Berlin \n\nVolkswagen signalled on Tuesday it would recall up to 11 million vehicles as it tries to address the scandal over its admission that it cheated U.S. diesel emissions tests. \nNew Chief Executive Matthias Mueller said the German carmaker had drawn up a \"comprehensive\" refit plan to be submitted to regulators aimed at ensuring its diesel models complied with emissions standards. \nIt will ask customers \"in the next few days\" to have diesel models equipped with manipulated software refitted and brief authorities on technical fixes in October, Matthias Mueller told a closed-door gathering of about 1,000 top managers at Volkswagen's Wolfsburg headquarters late on Monday. \nThe company is under huge pressure to tackle the biggest business-related crisis in its 78-year history. Germany's KBA regulator had set an Oct. 7 deadline for it to present a plan to bring diesel emissions into line with the law. \nVolkswagen has said previously about 11 million vehicles were fitted with software capable of cheating emissions tests, including 5 million at its namesake brand, 2.1 million at luxury brand Audi, 1.2 million at Czech division Skoda and 1.8 million light commercial vehicles. \n\"We are facing a long trudge and a lot of hard work,\" Mueller, appointed CEO of Europe's biggest automaker last Friday, said in the speech text seen by Reuters. \"We will only be able to make progress in steps and there will be setbacks.\" \nSeparately, Mueller said Volkswagen's troubled core VW division, struggling with high fixed costs and low profit margins, would in future be able to act as independently as premium flagship brands Audi and Porsche. \n\"The new company structure is a first step and the basis for a modernization of VW, for a new and better company,\" he said.", "source": "Gulf Times"}