{"published": "2015-09-09T16:16:07Z", "media-type": "Blog", "title": "Back in the News: Walker “Worst” Candidate on Wind, Solar?", "id": "829b3d0a-e894-4b43-b052-3ccd278d35d2", "content": "Scott Walker and Energy \n \nScott Walker isn’t open for business when it comes to solar and wind power. \n \n“As far as wind and solar developers are concerned, the Wisconsin governor may be the worst man for the job,” a recent story in Bloomberg.com notes. “Five years after Walker took office, renewable energy in Wisconsin is lagging the boom in the rest of the country and industry blames the two-term governor for the shortfall.” \n \nAmong six midwestern states, Indiana has increased the use of solar power the most, adding more than 115 megawatts in the last five years, compared to about 20 megawatts for last place Wisconsin, the story reports. In wind power for the period 2011 to 2014, top state Iowa added more than 5,500 megawatts, compared to little or no growth for Wisconsin. \n \nThe upper Midwest has been a boom area for wind power except in Wisconsin. As I reported in January of last year, “in 2012 seven percent of the entire world market of wind energy was developed in America’s upper Midwest, but 99.4 percent of this development occurred outside Wisconsin.” \n \n  “Walker and his appointees have pushed new restrictions on windmills, cut tax incentives and research funding and last year imposed the nation’s highest fees on rooftop solar owners,” Bloomberg reporter Alex Nusbaum notes. \n \nThe Alliance for Solar Choice is suing Wisconsin over the new fees, which its spokesperson Amy Heart blames for “the worst” environment in the nation for home solar owners, while increasing revenue for public utilities in Wisconsin. \n \nHeart told Bloomberg that Republican primary voters “won’t support Governor Walker,” because he’s “a politician who supports state-sponsored monopolies who are killing competition.” \n \nWhile utilities nationally have made the argument that home solar users should pay something to help maintain the electric grid they also depend on, the $30 monthly fee for the typical solar customer of Milwaukee-based We Energies Corp.  makes Wisconsin “an outlier” on solar energy nationally, as Ben Inskeep , an analyst at North Carolina State University’s Clean Energy Technology Center, told Bloomberg. “Among all the cases we’ve seen in the country, this is probably one of the top ones in terms of reducing the value proposition for residential customers.” \n \nLaurel Patrick , the governor’s spokeswoman, didn’t respond to questions from Bloomberg about the new solar fee or wind-siting rules that have helped retard wind power growth in Wisconsin and instead pointed to other “alternative energy” measures: “The administration has backed tax breaks and loans for biodigesters that create power from farm waste as well as small-scale generators that let diesel trucks reduce idling.” \n \nWisconsin’s potential to become a wind and solar power state is considerable. Wisconsin ranks 17th highest in wind power potential, according to the American Wind Energy Association, with enough wind power to produce four times more total energy than the state’s current electrical needs. \n \nAnd this area compares favorably to Germany, which now gets more than 50 percent of its electricity through solar power, in the amount of solar radiation it receives. \n \nBut instead of doing all he can to develop the state’s solar and wind power industries, Walker has done his best to keep the state a net energy importer; Wisconsin spends an estimated $12 billion annually to purchase coal and gas and other fossil fuels from other states. \n \n“Critics look at Walker’s record and see the ideological imprint of Charles and David Koch , the billionaire Republican campaign donors,” Nusbaum writers. “The Koch-backed Americans for Prosperity provided funding and volunteers during Walker’s rise to power in Wisconsin.” \n \nIn fact, David Koch has  made it clear that Walker is one of his favorite candidates running in Republican presidential primary.", "source": "Urban Milwaukee"}