{"published": "2015-09-15T10:27:30Z", "media-type": "News", "title": "Great Lakes: More Than $12 Billion in Project Kickoffs in Fourth Quarter, Fueled by Natural Gas, Auto Growth, an Industrial Info News Alert", "id": "0a6ae8cd-8c14-48c4-aeab-5f65070573a9", "content": "SUGAR LAND, TX -- (Marketwired) -- 09/15/15 -- Researched by Industrial Info Resources (Sugar Land, Texas) -- A rapidly recovering automotive market and the benefits of natural gas growth are propelling construction projects in the U.S. Great Lakes region. The U.S. auto industry saw the strongest sales in a decade in August, and leading manufacturers are exporting more cars than ever. Industrial Info is tracking $12.08 billion in projects set to begin construction in the region from October through December, although $3 billion of that amount is attached to a project with high uncertainty. More than 75% of the total is attributed to four industries: Alternative Fuels, Power, Industrial Manufacturing, and Metals & Minerals. \n\nWithin this article: Details on the 10 highest-value projects in the Great Lakes region, including those from major companies such as: \n\nPure Energy Resources LLC \n\nClean Coal Refining Corporation \n\nSunCoke Energy (NYSE:XSC) \n\nGeneral Motors Corporation (NYSE:GM) \n\nNTE Energy \n\nDuke Energy Corporation (NYSE:DUK) \n\nNiSource Incorporated \n\nMarkWest (NYSE:MWE) \n\nTo view the 10 highest-value projects set to kick off in the U.S. Great Lakes region in the fourth quarter, with data such as locations and investment values, view the entire article by subscribing to Industrial Info's Premium Industry News, or browse other breaking industrial news stories at www.industrialinfo.com. \n\nIndustrial Info Resources (IIR), with global headquarters in Sugar Land, Texas, five offices in North America and 10 international offices, is the leading provider of global market intelligence specializing in the industrial process, heavy manufacturing and energy markets. Industrial Info's quality-assurance philosophy, the Living Forward Reporting Principle, provides up-to-the-minute intelligence on what's happening now, while constantly keeping track of future opportunities. To contact an office in your area, visit the www.industrialinfo.com \"Contact Us\" page. \n\nWilliam Ploch \n\n713-783-5147 \n\nPublished Sep. 15, 2015 \n\nCopyright © 2015 SYS-CON Media, Inc. — All Rights Reserved. \n\nSyndicated stories and blog feeds, all rights reserved by the author. \n\nCopyright © 2009 Marketwired. All rights reserved. All the news releases provided by Marketwired are copyrighted. Any forms of copying other than an individual user's personal reference without express written permission is prohibited. Further distribution of these materials is strictly forbidden, including but not limited to, posting, emailing, faxing, archiving in a public database, redistributing via a computer network or in a printed form. \n\nSOA World Latest Stories \n\nBy Liz McMillan \n\nIn his session at 17th Cloud Expo, Phil Jackson, Lead Technology Evangelist at SoftLayer, an IBM Company, will provide an introduction to IBM Cloud's SoftLayer platform, including some of the most useful services and how to best make use of them in your projects. He will walk you throu... \n\nBy Elizabeth White \n\nChef, the leader in automation for DevOps, today announced it has closed a $40 million Series E funding round. The round was led by DFJ Growth and included Millennium Technology Value Partners, as well as all existing investors: Battery Ventures, Citi Ventures, DFJ, Ignition Partners, ... \n\nBy Carmen Gonzalez \n\nWith major technology companies and startups seriously embracing IoT strategies, now is the perfect time to attend @ThingsExpo in Silicon Valley. Learn what is going on, contribute to the discussions, and ensure that your enterprise is as \"IoT-Ready\" as it can be! Internet of @ThingsEx... \n\nBy Pat Romanski \n\nJFrog has announced a powerful technology for managing software packages from development into production. JFrog Artifactory 4 represents disruptive innovation in its groundbreaking ability to help development and DevOps teams deliver increasingly complex solutions on ever-shorter dead... \n\nBy Liz McMillan \n\nDatapipe has acquired AWS assessment, automation, and migration company DualSpark. DualSpark’s AWS consulting services simplify the experience of moving apps and critical infrastructure to the AWS cloud. “DualSpark has extensive cloud-native experience helping enterprises modernize a... \n\nBy Liz McMillan \n\nTestPlant has released the results of its annual user survey, now in its fifth year. Its 2014 survey revealed user experience as a top theme for test teams, but this year the focus is firmly on a shift happening among many companies who are actively integrating their quality assuranc... \n\nSubscribe to the World's Most Powerful Newsletters \n\nSubscribe to Our Rss Feeds & Get Your SYS-CON News Live! \n\nClick to Add our RSS Feeds to the Service of Your Choice: \n\nView Additional SYS-CON Feeds \n\nPublish Your Article! Please send it to editorial(at)sys-con.com! \n\nAdvertise on this site! Contact advertising(at)sys-con.com! 201 802-3021 \n\nSYS-CON Featured Whitepapers \n\nMost Read This Week \n\nBy Carmen Gonzalez \n\nBy Carmen Gonzalez \n\nBy Carmen Gonzalez \n\nBy Carmen Gonzalez \n\nBy Carmen Gonzalez \n\nBy Carmen Gonzalez \n\nBy Pat Romanski \n\nBy Liz McMillan \n\nBy Elizabeth White \n\nBy Pat Romanski \n\nBy Elizabeth White \n\nBy Pat Romanski \n\nADVERTISE |  MAGAZINE SUBSCRIPTIONS |  FREE BREAKING-NEWSLETTERS! |  SYS-CON.TV |  BLOG-N-PLAY! |  WEBCAST |  EDUCATION |  RESEARCH \n\n.NET Developer's Journal - .NETDJ |  ColdFusion Developer's Journal - CFDJ |  Eclipse Developer's Journal - EDJ |  Enterprise Open Source Magazine - EOS \n\nOpen Web Developer's Journal - OPENWEB |  iPhone Developer's Journal - iPHONE |  Virtualization - Virtualization |  Java Developer's Journal - JDJ |  Linux.SYS-CON.com \n\nPowerBuilder Developer's Journal - PBDJ |  SEO / SEM Journal - SJ |  SOAWorld Magazine - SOAWM |  IT Solutions Guide - ITSG |  Symbian Developer's Journal - SDJ \n\nWebLogic Developer's Journal - WLDJ |  WebSphere Journal - WJ |  Wireless Business & Technology - WBT |  XML-Journal - XMLJ |  Internet Video - iTV \n\nFlex De", "source": "Sys-Con India"}