{"published": "2015-09-14T23:29:47Z", "media-type": "News", "title": "Life expectancy rising but bad diet and smoking still 'big risks to health'", "id": "c9ec7c18-8383-44ca-8a7b-01f1e96cb64d", "content": "Poor diet and smoking are the biggest risks which may cause premature death or disability among people living in England, according to a new study led by Public Health England (PHE). \n \nResearchers found that 40% of the NHS's workload is due to potentially preventable factors and that the impact of an unhealthy diet accounted for 10.8% of the disease burden while tobacco accounted for 10.7%. \n \nThe life expectancy of people in England has risen from 75.9 years in 1990 to 81.3 years in 2013. \n \nA slowdown in the number of deaths from cardiovascular disease, stroke, chronic obstructive pulmonary disease and some cancers in this period  meant that people in England could expect to live 5.4 years longer. This happened  despite and increase in the number of deaths from liver disease. \n \nThe figures, published in The Lancet, use data from The Global Burden of Diseases, Injuries, and Risk Factors Study 2013 (GBD 2013). \n \nPHE Professor John Newton and colleagues analysed patterns of ill health and death in England, calculated the links of preventable risk factors, and ranked England compared to 14 European Union countries along with Australia, Canada, Norway and the USA. \n \nThe gains in life expectancy were greater for men than women. \n \nMen in England could expect an extra 6.4 years of life expectancy to reach 79.5 years of age, putting them level with Finns but behind the expected life span of a man from Luxembourg. \n \nThe average national life expectancy increased by 4.4 years to 83.2 years for women in England, which still placed them ahead of all other nations surveyed except Finland, Germany, Ireland, Luxembourg and Portugal. \n \nPeople were living longer but were also surviving longer with illnesses, according to Prof Newton. \n   Promoted stories   \nA larger older population also meant that conditions linked with old age such as dementia and injuries to the joints, ligaments, muscles and nerves were more common. \n \nLow back and neck pain, along with hearing and vision loss and depression were among the illnesses faced by people who lived longer. \n \nCo-author Dr Adam Briggs noted that life expectancy is increasing across the country but large inequalities still remain. \n \nHe said: \"Life expectancy in 2013 for those living in the most deprived areas was still lower than those in less deprived areas enjoyed in 1990. \n \n\"How deprived you are is the key driver of these differences rather than where you live and therefore deprivation and its causes need to be tackled wherever they occur.\" \n \nIllnesses such as heart disease and lung cancer along with factors such as smoking and alcohol misuse had a greater impact in the more deprived population, it was found. \n \nMen living in south-west England, east England and south-east England could expect to live to more than 80 years of age - the highest life expectancy of all the nations studied. \n \nThe survey found that despite having the same health and social care system, some English regions such as the North East and North West were ranked among the worst performing nations. \n \nWomen living in Spain, Italy, and France had the highest life expectancy and could expect to hit 84.4 years or above.  Women in Australia and south-east England had the  next highest life expectancies  of 84 years. \n \nProf Newton described wide-ranging causes of inequality as \"deep-rooted and persistent and lie largely outside the healthcare system\", adding that they  touch on giving every child the best start in life, education for children, employment opportunities. \n \nHe said: \"Preventative services do help. In terms of the NHS, we need to make sure that preventative services are available to people regardless of their circumstances so that we do not get differences in uptake, vaccination and screening. \" \n \nOn the need for a better diet, Prof Kevin Fenton, of PHE,  said: \"As a nation we are eating far too many fats and far too much sugar. Our salt intake, although it has been decreasing over time, is still at a level where we would like to see further decreases because that is going to have a huge impact on cardiovascular disease, blood pressure and stroke outcomes. \n \n\"We do recognise that this is not going to be down to families alone. We have much greater gains that can be made in working with the industry.\" \n \nProf Newton argued that \"investment should be made in prevention in order to reduce the cost to the NHS going forward.\" \n \nHe added: \"This data really does emphasise the scale of the opportunity to prevent workload for the NHS as well as improve health for the population.\" \n \nProfessor John Ashton, president of the Faculty of Public Health, said: \"Healthy life expectancy powerfully reflects our social environment: having a living wage, living in decent housing and eating healthy food. \n \n\"The shocking regional variations in healthy life expectancy dramatically demonstrate how these powerful factors which affect our health are controlled by national and local governments, rather than being a simple matter of individual 'choice'. \n \n\"We urgently need government to make people's social environments healthier. Only government has the power to introduce measures like minimum unit pricing for alcohol, increases duties on tobacco, sugary drinks taxes and subsidies on fruit and veg. Such measures will then empower councils and individuals to tackle the socio-economic reasons why there are 'health haves' and 'have nots'.\" \n \nProfessor Peter Weissberg, the British Heart Foundation' s medical director, said: \"The burden of disease remains high in the most disadvantaged sectors of our society and our ageing population is increasingly facing multiple medical problems. \n \n\"Much would be gained if public health strategies could be devised to address this inequality and raise standards in all regions to match those of the best regions in the UK.\" \n   \n Share article  \n   \nA Health Department spokesman said:  \"This report shows that England has had one of the biggest increases in life expectancy in Europe, and that some areas now have life expectancies above the average for comparable European countries. \n \n\"However, we must work to ensure that these improvements can be seen across the country, so that everyone has the opportunity to live a long and healthy life, no matter who they are or where they live.\"", "source": "Surrey Comet"}