{"published": "2015-09-16T00:17:23Z", "media-type": "Blog", "title": "The Ninth Month", "id": "c1633168-3281-4eb0-aae7-37cd1cb898e1", "content": "The feelings of grief are like the waves of the ocean.  Sometimes the feelings are big and it’s high tide, and sometimes they are small and it’s low tide. Sometimes the feelings are stormy, and sometimes they’re calm.       Towards the 9 month mark, you start to confront the reality of your loss and your more intense feelings of sadness, anger, heartbreak, fear, guilt and depression.  Somewhere in the second year you start to accept your loss and start to make accommodations in your life for your loss.  Your feelings begin to feel less intense and you experience more moments of peace and happiness.  As you feel and express your feelings during the different phases of your grief, remember:  it is not that you are having a bad day, but a grieving day.  Just as you cannot stop the waves in the ocean, you cannot stop the feelings of grief.  You can only ride the wave of your grief and find a comfortable place to express it.  Find time to be with your pain now; postponed grief returns later.  Connect yourself with what you have lost, your old sense of self or the person you lost.\nWendy Feiereisen describes how grief changes as we embrace it in her poem, “Grief”:\nYou don’t get over it. You just get through it. You don’t get by it. Because you can’t get around it. It doesn’t “get better”. It just gets different. Every day, grief puts on a new face. Yearning and searching for what you lost is another way of protesting the loss. It is typical during this time to review many of the “If only…” thoughts.   Again there are no answers to these thoughts. “If  only…I should have…I could have…” are phrases that reflect our intense desire to have control over what happened.  When you hear yourself using these phrases, picture a barrier at the top of a slope and stop yourself from finishing the thought.  Remember, at the bottom of this slippery slope is a dead end and if you continue your “if only” and “should have”  thoughts, you will slide down the slope and then need to climb back up.   \nDuring this phase there is the sensation that it was a mistake; everything will go back to the way it was, my loved one is going to walk through the door any minute or my health will return.  This sensation is usually gone by the 9th month and many people experience this as a particularly intense period of grieving.  Somewhere around this time, you begin to move in and out of the avoidance phase and into the confrontation phase as you confront the reality that you will not find what you lost.\nConfrontation Phase\nThis phase starts with the recognition that your life will not return to the way it was.  You have moved beyond feeling that your life is surreal and into recognizing that the way your life is now is your new normal.   Your grief during this time is very intense with your feelings being very acute and at times overwhelming, resulting in a state of disorganization.    \nYES!  This helps explain why I've been feeling so emotional  and at such \"loose ends\" lately. This ninth month brings with it the excruciating  labor pains of birthing a new normal.", "source": "Just M.E."}