{"published": "2015-09-13T18:56:20Z", "media-type": "News", "title": "It's a cat's life at complex", "id": "9368642a-7196-40ff-8427-f0af8e79fe59", "content": "The world-wind tour of Charlie Mopps made a stop at the civic complex over the weekend. \n \nIt’s easy travelling: he gets carried around, gets plenty of attention, grooming and even some socializing. \n \nThe only thing Charlie is required to do is be on good behaviour — no scratching or biting — when handled by one of a select few people he’s come to know over the past few years. \n \nCharlie is a Persian cat — he and 88 other cats were judged at the first annual Cats without Borders show. \n \nCharlie was already well-travelled before he joined the cat show tour with owner Nancy Watts of Quebec City. \n \nWatts said she travelled to St. Louis, U.S. to buy Charlie Mopps, from a breeder who named their kittens after beer varieties. \n \n“I like to pick up my cats — it’s better for them than to ship them as cargo,” Watt said. \n \n“I’ve even travelled to Europe to buy a show cat.” \n \nWhen a fine breed costs at least as much as $2,000 then it’s usually money well spent. \n \nWatts takes Charlie and her other cats up to 35 shows during a year, so a shorter trip to Cornwall was easier than most. \n \n“It’s all about improving the breed,” she said, of the competition. \n \nIndeed, Judge Gary Powell made a point of explaining the various features of combining stocky, flat-faced Persians with the sleek Siamese cats to create a relatively newer breed, the Himalayan. \n \nThe Saturday show, which is sanctioned under the Canadian Cat Fanciers, is a way for organizer Michelle Beaudry to network with other breeders. \n \nHer club, based out of Morrisburg, has about a dozen members, but she’s already recruited members from as far away as Massachusetts. \n \nA second show was held by the Montreal-based Alouette Cat Club on Sunday that kept Watts and other breeders in Cornwall for another night. \n \ngreg.peerenboom@sunmedia.ca \n \ntwitter.com/GregPeerenboom", "source": "Cornwall Standard-Freeholder"}