{"published": "2015-09-24T08:07:00Z", "media-type": "News", "title": "First Choice Emergency Room Announces Dr. Alexandre F. Migala as Medical Director of Highland Village, Texas Facility", "id": "6497cea2-33a2-4dce-9152-e6bea62107f8", "content": "Alexandre F. Migala, DO, FAAEM to Lead Facility\n\nLewisville, TX (PRWEB) September 24, 2015 \n\nFirst Choice Emergency Room, the largest network of independent freestanding emergency rooms in the United States, named Alexandre F. Migala, DO, FAAEM as theMedical Director of its new Highland Village facility. \n\n“We are pleased to announce Dr. Migalawill be the facility medical director of our new Highland Village location,” said Dr. James M. Muzzarelli, Executive Medical Director of First Choice Emergency Room. \n\nDr. Migala received his undergraduate degree from The University of Texas at Arlington and his medical degree from the Texas College of Osteopathic Medicine in Ft. Worth, TX. Before joining First Choice Emergency Room, Dr. Migala served as the Director of EMS & Prehospital Care as well as the Director of Disaster Preparedness and Bioterrorism at John Peter Smith Hospital in Fort Worth, TX. He also served as Deputy JIEDDO Surgeon in the Department of the Army, Director of Prehospital Care/Emergency Medical Services at Fort Hood, and as the Medical Director/Adjunct Director of the Disaster Medical Specialist Course Texas Engineering Extension at Texas A&M University. Dr. Migala is board-certified in emergency medicine and has over 15 years practicing emergency medicine. \n\nAll First Choice Emergency Room facilities are open 24 hours per day, 7 days per week. The facilities are staffed exclusively with board-certified physicians and emergency trained registered nurses. First Choice Emergency Room facilities are equipped with a full radiology suite, including CT scanner, Digital X-ray, Ultrasound, as well as on-site laboratories certified by the Clinical Laboratory Improvements Amendments (CLIA) and accredited by the Commission on Office Laboratories Accreditation (COLA). \n\nThe Highland Village facility will be located at 3160 Justin Rd., Highland Village, Texas 75077. For more information, visit http://www.fcer.com/locations/dallas-map/highland-village/. \n\nAbout First Choice Emergency Room First Choice Emergency Room (FCER.com) is the nation’s leading network of independent freestanding emergency rooms; it is both the largest and the oldest. First Choice Emergency Room is revolutionizing the delivery of emergency medical services for adult and pediatric emergencies by offering patients convenient, neighborhood access to emergency medical care. First Choice Emergency Room facilities are innovative, freestanding, and fully equipped emergency rooms with a complete radiology suite of diagnostic technology (CT scanner, Ultrasound, and Digital X-ray) and on-site laboratory. All First Choice Emergency Room locations are staffed with board-certified physicians and emergency trained registered nurses. First Choice Emergency Room has facilities in Austin, Dallas/Fort Worth, Houston, and San Antonio. According to patient feedback collected by Press Ganey Associates Inc., First Choice Emergency Room provides the highest quality emergency medical care and received the 2013 and 2014 Press Ganey Guardian of Excellence Award for exceeding the 95th percentile in patient satisfaction nationwide. First Choice Emergency Room is an Adeptus Health (NYSE:ADPT) company.\n\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb1298192", "source": "WTRF"}