{"published": "2015-09-05T22:33:00Z", "media-type": "News", "title": "Cryptzone Addresses Changing Cybersecurity Threats", "id": "65d5bf26-4326-445f-9e05-0f05182fc946", "content": "Former FBI Special Agent in Charge Leads Cybersecurity Discussion Series across North America and Europe\n\nWaltham, MA (PRWEB) September 03, 2015 \n\nCryptzone, a provider of dynamic, context-aware network, application and content security solutions, today announced its ‘Let’s Talk Cybersecurity Seminar Series’ multi city tour, where the company’s CSO, Leo Taddeo and former FBI agent in the Special Operations/Cyber Division and invited guests will discuss the changing landscape of cybersecurity, how cyberattacks have increased and evolved to include organized crime, technical hackers, hacktivists, terrorists and nation-states - penetrating crumbling perimeter defenses. He'll take a close look at the evolution of network security and how companies like Google are changing how they address access, as well as how to combat threats from the outside and within. \n\n“Organizations are recognizing that they need to fundamentally re-architect their security infrastructure, and are eager to discuss with their peers and industry experts the best practices for doing so,” said Kurt A. Mueffelmann, President and CEO of Cryptzone. “With the addition of experts like Leo Taddeo, our new CSO and former FBI agent in the Special Operations/Cyber Division, Cryptzone is excited to provide thought-provoking dialogue to help solve the problems that exist today, and help enterprises plan for what’s coming tomorrow.”\n\nCryptzone’s leadership team will travel to Boston (Sept. 10), Toronto (Sept. 16), Chicago (Sept. 17) and New York City (Oct. 1), Dallas (Oct. 20), Washington, DC (Oct. 22) and London (Nov. 13) to lead a day of security discussions in each city. Spaces are limited and RSVP is required https://www.cryptzone.com/lets-talk-security-seminar-series-2015. \n\nLeo Taddeo, Chief Security Officer (CSO), Cryptzone and former Special Agent in Charge of the Special Operations/Cyber Division of the FBI’s New York Office, will lead the discussions. His expertise and past experience speaking to audiences of all expert levels, including shows such as American Bankers Association Securities Association (ABASA) Board of Directors Meeting, International Conference on Cyber Security at Fordham and Association of Bioscience Financial Officers allows for him to draw upon a broad industry perspective to cyber security.\n\nPrior to joining Cryptzone, Taddeo led more than 400 agents and professional support staff in cyber investigations, surveillance operations, information technology support and crisis management for the FBI. He oversaw high profile cases, including Silk Road, Blackshades and JP Morgan.\n\nCryptzone’s solutions begin by protecting at the network level to determine access to applications and services and provide an additional layer of security to control what authorized users can and can’t do with content. The portfolio includes AppGate®, a dynamic, context aware security gateway that prevents unauthorized access; HiSoftware Security Sheriff® an integrated classification, encryption and content protection solution for SharePoint®, Office 365 and File Shares; Simple Encryption Platform TM, which secures data in email, removable storage, files and folders; and Compliance Sheriff TM, which provides content governance for public websites, intranets and extranets.\n\nAbout Cryptzone \n\nCryptzone secures the enterprise with dynamic, context aware security solutions that protect critical services, applications and content from internal and external threats. For over a decade, enterprises have turned to Cryptzone to galvanize their Cloud and network security with responsive protection and access intelligence. More than 450 public sector and enterprise customers, including some of the leading names in technology, manufacturing and consumer products trust Cryptzone to keep their data and applications secure. For more information go to http://www.cryptzone.com or follow us @Cryptzone.\n\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb12941084.htm", "source": "WSFA"}