{"published": "2015-08-18T19:03:01Z", "media-type": "Blog", "title": "Fula Flute plays for the JJA Awards at the Blue Note, NYC", "id": "39289ed4-36fc-4afa-a63a-331a241def8b", "content": "x  \nKudos to Howard Mandel for booking this act to open the Jazz Journalists Association Awards 2015 at the Blue Note Jazz Club. The focus of the evening was on Jazz piano, with Randy Weston receiving a lifetime achievement award, Women in Jazz (with Mimi Jones and Antoinette Montague performing) and African-Jazz ties (Fula Flute, made up of Bailo Bah –the master– and Sylvain Leroux, both playing the tambin.) \nI asked Sylvain to write about Fula Flute, and he was so eloquent, there was little for me to add: \n \n“Bailo and I have gone through many incarnations as Fula Flute and this time around we are going back to the fundamentals: the sound and energy of the tambin. Bailo and I have known and worked together since 1999—16 years now. We have gone through many phases and our relationship is strong. I consider him the way a martial arts student considers his master. I am good, but he is superior. However, although I am a student of his style of flute playing, I also have to some extent integrated the language of the Fula flute into my own expression which itself is informed with classical and jazz training and some wider World music experience and this gives me an ability to innovate in ways that he cannot. But it is very doubtful that I can ever approach his power, steeped as he is in the culture of his traditional village, located in the heart of the ancient and profound Fulani culture of Guinea, high in the mountains of the “Fouta Djallon.” \n \nIn any case, I feel it is a privilege to be allowed to keep an accompaniment while he solos… to be like Noel Redding to Jimi Hendrix (to whom Bailo is often compared). Bailo respects me sufficiently to allow me to take solos and, from time to time, I play something that challenges him, which inevitably stimulates him to go further and then we see amazing fireworks as he is capable of playing at the highest level. He’s a “karamoko,” a sorcerer, and can generate real magic. Great African players are master of “nyama,” the life energy (kudalini, chi…) that they know how to stimulate and bring on the nirvanas that we experience as listeners. \n \nBailo is an incredible person, he has had an amazing life—worth a book, at least—and is heir to profound knowledge, inherited as a child from his grandfather, of a rich but deeply different nature than what we normally refer to as “knowledge.” In his playing and in the message of the Fula flute is a hint of ancient ways that we would all be improved as a species if we integrated their lessons.” \n \nWell said, Sylvain! \n \nThe post Fula Flute plays for the JJA Awards at the Blue Note, NYC appeared first on InterMuse .", "source": "InterMuse » InterMuse"}