{"published": "2015-09-01T11:10:48Z", "media-type": "News", "title": "This Is What People Think When You Wear Black", "id": "0563503c-f4a0-4fc2-b917-8426c1948b67", "content": "When it comes to no-fuss dressing, there's no denying that opting for all black can often be the safest (and chicest) option.\n\nAnd now, a new survey has revealed just what people think of you when you step out in head-to-toe noir... And surprisingly, the results are overwhelmingly positive.\n\nSome people prefer to be colour chameleons when it comes to their clothes, but celebrities like Victoria Beckham and Angelina Jolie have been flying the flag for all-black outfits for years. Olivia Palermo loves black, and is known for being one of the most attractive women in fashion \n\nTurns out, they were right to. Because apparently, wearing black makes you come across as more confident, intelligent and sexy. Hooray for gothic chic!\n\nOur of the 1,000 people surveyed, black was the most popular choice when it came to attractiveness: it was the colour most men preferred women to wear, whilst 66 % of women liked to see men in black.\n\nMore than half of the people (56%) said they wore black when they wanted to feel more confident, eg. to an interview or on a first date, so it was the overall winner in that category too.\n\nEmma Watson's chic black outfit is making her look more intelligent, apparently \n\nAnd when it came to intelligence, black came out on top once again, with 45% of the respondents saying that they associated black with the wearer being clever.\n\nThe only category in which black didn't perform well was genorosity, where it came second from bottom after brown. Hmm. We'd always thought VB looked like a total sharer!\n\nOn the other end of the colour spectrum were orange and brown, which were both seen as the worst choices for making a good first impression and for attractiveness. Uh oh.\n\nSee: We're Loving: Leather\n\nAngelina Jolie's one savvy lady. She's barely ever seen NOT in black! \n\nPink, yellow and orange didn't fare well either in the intelligence stakes, although yellow was seen as a colour of generosity. Interesting.\n\nRed was associated with arrogance, although also with sexiness and confidence. But only 12% viewed the colour red as signifying that the wearer was intelligent.\n\nOne thing's for sure – we're going to be planning way more all-black combos after this one...", "source": "Look"}