{"published": "2015-09-16T00:38:37Z", "media-type": "News", "title": "Aerojet Rocketdyne says new AR-1 engine timetable could slip", "id": "a28a629c-9211-4837-93bd-1491760c28a8", "content": "Reuters \r \r \r \r \r\n\t\t\tPosted: \r Tuesday, September 15, 2015, 8:38 PM \r \r \r \n \nBy Andrea Shalal \n \nNATIONAL HARBOR, Md., Sept 15 (Reuters) - Aerojet Rocketdyne\nHoldings Inc on Tuesday said it expected to complete\nits new AR-1 rocket engine by 2019 to replace a soon-to-be\nbanned Russian engine, but the date could slip if it does not\nreceive enough U.S. government funding. \n \nAerojet Vice President Julie Van Kleeck declined comment on\nreports that Aerojet has offered $2 billion to acquire United\nLaunch Alliance (ULA), a 50-50 rocket launch venture of Lockheed\nMartin Corp and Boeing Co. \n \nAnalysts say the bid is a strategic move by Aerojet to shut\nout rival Blue Origin, a company owned by Amazon.com founder\nJeff Bezos, that is developing a new engine favored by ULA for\nuse in its new Vulcan rocket. ULA has said Blue Origin's engine\nprogram is about two years ahead of Aerojet's work on the AR-1\nengine, a claim Aerojet disputes. \n   \nWork on the new engines gained urgency after U.S. lawmakers\npassed a ban on use of Russian RD-180 engines for launches of\nU.S. military or spy satellites following Russia's annexation of\nthe Crimea region of Ukraine last year. \n \nVan Kleeck said the company was testing hardware for the\nengine, which is being designed with 3D-printed parts to fit\ninto both ULA's Atlas 5 rocket, now powered by the RD-180\nengine, and the new Vulcan rocket that ULA is developing at a\ncost of about $1 billion. \n \nAerojet says it would be less costly and risky to integrate\nits engine into the Atlas 5 rocket than to develop a wholly new\nengine and rocket, as ULA currently plans. \n \nVan Kleeck said Aerojet planned to begin testing full scale\nengines in 2017, followed by certification in 2019, but the date\ncould slip if the company did not receive enough funding from\nthe Air Force in contract awards expected late in the first\nquarter of fiscal 2016, which begins Oct. 1. \n \nShe said the company was eager to see how the Air Force\nsplit funding of about $160 million among rival bidders. She\nsaid Aerojet was also exploring other private funding options\nfor the engine but gave no details. \n \nThe Air Force competition is a public-private partnership,\nwith each of the bidders asked to provide one-third of the\nfunding, with the Air Force to provide a two-thirds share. \n \nSpace Exploration Technologies, or SpaceX, and Blue Origin,\nboth of which are privately held, have self-funded their engine\nwork, and say they are not necessarily looking for government\nfunding.  \n\n (Reporting by Andrea Shalal; Editing by Ken Wills)", "source": "Philly.com"}