{"published": "2015-09-23T21:47:20Z", "media-type": "News", "title": "UPDATE 1-SEC accuses consultant, friend of insider trading before P.F. Chang deal", "id": "2f3ab1d4-6a9e-468e-a75a-9297edece73f", "content": "(Adds case details, comment from Richard Condon's lawyer) \n\nBy Nate Raymond \n\n(Reuters) - U.S. securities regulators on Wednesday\naccused a Los Angeles-based \"life coach\" of tipping two friends\nincluding a producer on \"Extreme Makeover\" to confidential\ninformation about P.F. Chang's China Bistro before its sale in\n2012. \n\nIn a lawsuit filed in federal court in Los Angeles, the U.S.\nSecurities and Exchange Commission sued Richard Condon, an\nexecutive coaching consultant to Panda Restaurant Group, which\nwas involved in the bidding process for P.F. Chang's. \n \nThe SEC said Condon, 66, repeatedly shared information he\nlearned about the potential acquisition of the restaurant chain\nwith Jonathan Ross, a friend, and Howard Schulz, who produced\n\"Extreme Makeover\" among other shows and who died in 2014. \n\nThe SEC said Ross, Schultz and a third trader tipped by\nRoss, Ali Sagheb, made about $300,000 following the announcement\nin May 2012 that P.F. Chang's would sell itself to Centerbridge\nPartners for $1.1 billion. \n \nAli Sagheb, a friend of Ross's, agreed to settle with the\nSEC for $19,829, which comprised his profits plus interest, the\nregulator said. \n \nMatthew Umhofer, Condon's lawyer, in a statement called the\nSEC's allegations \"speculative,\" adding that his client \"made no\nmoney on a corporate deal that analysts and media sources had\npublicly predicted.\" \n\nLawyers for Ross, 66, and Sagheb, 43, did not immediately\nrespond to requests for comment. Lighthearted Entertainment,\nwhich Schultz founded, had no immediate comment. \n\nThe case is Securities and Exchange Commission v. Condon,\nU.S. District Court, Central District of California, No.\n15-07443.\n\n (Reporting by Nate Raymond in New York; Editing by Matthew\nLewis and Tom Brown )", "source": "Reuters"}