{"published": "2015-09-30T07:40:00Z", "media-type": "News", "title": "Research and Markets: Private Banker International - the \"Bible\" of the Wealth Industry", "id": "ded6f7de-35c2-4ab0-8601-8fde290523e9", "content": "Research and Markets ( http://www.researchandmarkets.com/research/p4tdqc/private_banker ) \n      has announced the addition of the \"Private \n      Banker International\" newsletter to their offering. \n\nPrivate Banker International (PBI), the oldest and most authoritative \n      international wealth publication, tracks the changes affecting the \n      industry, giving subscribers unique international coverage and triple-A \n      analysis. \n   \nWith its expert blend of news, profiles and case studies, along with \n      high-quality research and analysis, Private Banker International has \n      become the \"bible\" of the wealth industry, read widely across the \n      business. \n\nIt is the benchmark title for providing the vital information necessary \n      to make the key strategic decisions the wealth industry is now facing. \n\nOur editorial team have unsurpassed contacts within the industry and \n      regularly bring you interviews with some of the industry's senior \n      figures to provide valuable insights into their thinking. \n\nPrivate Banker International is recognised as the most authoritative \n      title on developments within the private banking industry. This sector \n      is growing, but not as quickly as the multitude of organisations with \n      ambitions to capture business. \n\nPBI covers the continuing battle between onshore and offshore private \n      banking, new regulations and analysis on the products and services being \n      offered by the key players to capture and retain customers. \n\nEvery month, Private Banker International delivers its readers: \n\n- Wealth and private banking strategies, from the mass affluent through \n      to the ultra high net worth \n\n- Profiles of key players focusing on their core business strategy and \n      the associated products and services \n\n- Updates on the continued battle between the offshore and onshore \n      providers \n\n- Wealth management mergers, partnerships and alliances \n\n- Growth of hedge funds and other alternative investments \n\n- Key regulatory changes and issues \n\n- Wealth flows and investment patterns in major economies \n\n- Analysis of new emerging wealth centres, like Singapore \n\n- Tracking the new wealth, in Asia and elsewhere, and the old wealth, as \n      the US family-style office goes global \n\n- People movement \n\n- Performance and fees updates and analysis \n\nSubscribers to Private Banker International include: \n\n- ABN Amro - Banque General \n\n- Barclays Private Clients du Luxembourg \n\n- BNP Paribas - Deutsche Bank \n\n- Citibank - HSBC \n\n- EFG Private - Lloyds TSB \n\n- ING - NM Rothschild \n\n- Merrill Lynch & Sons \n\n- Schroders Private Bank - Unicredito Italiano \n\n- Stanford Financial Spa \n\n- Standard Bank - United Euro Bank \n\nFor more information visit http://www.researchandmarkets.com/research/p4tdqc/private_banker \n\n\n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150930005635/en/", "source": "CEOWorld Magazine"}