{"published": "2015-09-25T01:38:45Z", "media-type": "News", "title": "May needles Harper on niqab, economy, rights", "id": "53fedf62-5aa6-41a3-a0de-383cfb7989f2", "content": "OTTAWA — Elizabeth May repeatedly needled Conservative Leader Stephen Harper early in the French-language debate as she touted the Green party's vision for a more co-operative federation.\r \n\r \n\r\n                            May dismissed concern over face coverings at citizenship ceremonies as a \"false debate,\" stressed revitalizing the economy with municipal infrastructure spending and denounced the concentration of power in the Prime Minister's Office.  \r \n\r \n\r\n                            The Green leader chided Harper for not working with his provincial counterparts and she had the prime minister shaking his head as she attacked the federal record on environmental stewardship.\r \n\r \n\r\n                            The debate might have been in French, but May clearly saw the exchange in Montreal as a chance to reach a broad sweep of Canadians with the Green message.\r \n\r \n\r\n                            The evening was especially important to the party since it could be May's last opportunity to stand alongside the other leaders before the Oct. 19 election.\r \n\r \n\r\n                            May took part in a debate sponsored by Maclean's magazine early last month. But she was excluded from the recent Globe and Mail debate on the economy — though she did light up Twitter with video retorts — and she isn't invited to one sponsored by the Munk Debates on foreign policy.\r \n\r \n\r\n                            In addition, it looks like the sort of widely broadcast English debate seen in previous campaigns may not happen this time since Harper has refused to take part and NDP Leader Tom Mulcair has said he won't participate if Harper doesn't.\r \n\r \n\r\n                            The Greens held just two seats in the last Parliament — neither in Quebec. But May is enthusiastic about her candidates in the province, including environmental scientist Daniel Green in Montreal and long-time eco-activist Andre Belisle in the riding held by Conservative cabinet minister Steven Blaney.  \r \n\r \n\r\n                            As the debate unfolded, May made good on her promise to go after Harper, leaving the other leaders relatively unscathed.\r \n\r \n\r\n                            She believes her presence in the 2008 televised English debate was a factor in holding Harper's Conservatives to a minority. She wasn't invited to the 2011 exchange.\r \n\r \n\r\n                            \"The real dynamic is that when Greens are in the debates, Conservatives don't do as well,\" she said this week in an interview.\r \n\r \n\r\n                            Follow @JimBronskill on Twitter\r \n\r \n\r\n                            By Jim Bronskill, The Canadian Press", "source": "Orangeville Banner"}