{"published": "2015-09-21T18:54:52Z", "media-type": "News", "title": "Victims recall salmonella outbreak at sentencing for peanut company executives", "id": "be334097-8a7a-460e-86d7-4d1485f457a9", "content": "1:54 p.m. CDT \n \nBy Rich McKay \n \nALBANY, Ga. (Reuters) - A man whose mother died from eating tainted peanut butter was among those who told a federal judge on Monday that the former owner of the peanut company in Georgia responsible for a massive salmonella outbreak should receive stiff prison time. \n \nIn a rare case of criminal prosecution linked to food contamination, Stewart Parnell, the former owner of Peanut Corporation of America, and his brother, Michael Parnell, who was a food broker on behalf of the company, were convicted on federal conspiracy charges in September 2014 for knowingly shipping salmonella-tainted peanuts to customers. \n \nJeff Almer, of Brainerd, Minnesota, said his mother, Shirley Almer, was among the nine people killed in the salmonella outbreak linked to the company in 2009. Hundreds more were sickened. \n \n\"My mother died a painful death from salmonella, and the look of horror on her face as she died shall always haunt me,\" Almer said during the Parnells' sentencing hearing on Monday in Albany, Georgia. \n \nStewart Parnell could be sentenced to life in prison in connection with the contamination at his company's plant in Blakely, Georgia, which led to one of the largest food recalls in U.S. history and forced the company into liquidation. \n \nMichael Parnell faces up to about 24 years in prison for his role in the case. Mary Wilkerson, a former quality control manager at the plant who was found guilty of obstruction, could be sentenced to up to five years in prison. \n \n\"I just hope they ship you all to jail,\" Almer said. \n \nJacob Hurley and his father, Peter, from Wilsonville, Oregon, testified how terribly ill Jacob got from eating salmonella-tainted peanut butter crackers at age 3. \"Because people died, I think it's OK if he spends the rest of his life in prison,\" Jacob said of Michael Parnell. \n \nDuring the seven-week trial last year, prosecutors said the Parnell brothers covered up the presence of salmonella in the company's peanut products for years, even creating fake certificates showing the products were uncontaminated despite laboratory results showing otherwise. \n \nThe Parnells have said they never knowingly endangered customers, and their supporters asked a judge on Monday to show mercy. \n \n\"No one thought that the products were unsafe or could harm someone,\" said Stewart Parnell's daughter, Grey Parnell. \"Dad brought them home to us. We all ate it.\" \n \nAn official with the Centers for Disease Control and Prevention testified at the trial that the company's peanut products sickened 714 people in 46 states, including 166 of whom were hospitalized. \n \nThe Parnells also were convicted of charges including mail fraud, wire fraud and introducing misbranded food into interstate commerce with the intent to defraud or mislead. \n \n(Additional reporting by David Beasley in Atlanta; Editing by Colleen Jenkins and Leslie Adler)", "source": "WHBL"}