{"published": "2015-09-03T07:00:30Z", "media-type": "News", "title": "TV & Media Report 2015: 35 percent of all TV, video viewing now watched on-demand", "id": "b2dd987e-9ce8-48c3-805c-eb4707287318", "content": "Ericsson ConsumerLab TV & Media Report 2015 shows consumers embracing video on-demand services like never before; every third viewing hour now spent watching on-demand TV and video    Report reveals a 71 percent increase in watching video on smartphones since 2012; nearly two thirds of teenagers' total TV and video viewing time spent on a mobile device    Viewing user-generated content also on the rise; almost one in 10 watch YouTube for more than three hours per day   \nEricsson ( NASDAQ: ERIC ) has today launched the latest edition of the annual Ericsson ConsumerLab TV & Media Report, representative of the views and habits of 680 million consumers making it one of the largest studies of its kind. \n \nA key finding is that Video-on-Demand (VOD) services are succeeding in meeting consumer needs, thus allowing consumers to change their viewing habits. Consumers now spend six hours per week watching streamed on-demand TV series, programs, and movies - this has more than doubled since 2011. With recorded and downloaded content added to the equation, today 35 percent of all TV and video viewing is spent watching VOD. \n    \n\n \nFurther findings highlight the considerable growth in consumers watching video on a mobile device: 61 percent watch on their smartphones today, an increase of 71 percent since 2012. When taking tablets, laptops, and smartphones into consideration, nearly two thirds of time spent by teenagers' watching TV and video is on a mobile device. \n \n\n \nAt the same time, user-generated content (UGC) platforms account for a growing share of consumers' TV and video viewing. Close to 1 in 10 consumers watch YouTube for more than three hours per day, and one in three now consider it very important to be able to watch UGC on their TV at home. In addition, the study finds that the increasing prominence of UGC-rich platforms, like YouTube, has resulted in a popularity boost for educational and instructional videos, with consumers watching an average 73 minutes of these videos per week. \n \nAnders Erlandsson, Senior Advisor, Ericsson ConsumerLab, says: \"The continued rise of streamed video on demand and UGC services reflects the importance of three specific factors to today's viewers: great content, flexibility, and a high-quality overall experience. Innovative business models that support these three areas are now crucial to creating TV and video offerings that are both relevant and attractive.\" \n \nOther significant findings from the Ericsson ConsumerLab TV & Media Report 2015 include: \n \nBingeing is changing the game : Watching multiple TV episodes in a row has rapidly become a key part of the TV and video experience. This habit is prominent among Subscription Video-on-Demand (S-VOD) users of services such as Netflix, Amazon Prime, and HBO, of whom 87 percent binge-view at least once a week. \n \nThe difficulty of finding content : Half of consumers watching linear TV say they can't find anything to watch on a daily basis. Consumers feel that recommendation features are simply not smart or personal enough. \n \nDifferent bundles, different attitudes: Twenty-two percent of consumers who have never had a pay-TV subscription are already paying for over-the-top (OTT) content services. \n \nLinear TV remains key: The popularity of linear TV remains high, mainly due to the access it gives to premium viewing and live content, like sports, as well as its social value. In this respect, linear TV often acts as a 'household campfire'. \n \nAbout this report \n \nBased on interviews with over 22,500 people, findings in the Ericsson ConsumerLab TV & Media Report 2015 are representative of 680 million consumers, making it the largest study of its kind in the TV industry. With supporting data and insight from on-device measurements and qualitative research, the report details the latest consumer behaviors, attitudes and demands in relation to TV and media, and the potential impact these trends can have on current industry business models. \n \nInterviews were undertaken with consumers aged 16-59 and 60-69, across 20 markets: Brazil, Canada, China, Colombia, France, Germany, Greece, Ireland, Italy, Mexico, Portugal, Russia, Spain, South Korea, Sweden, Taiwan, Turkey, UK, Ukraine and the US. All respondents have a broadband internet connection at home, and watch TV/video at least once a week. Almost all use the internet on a daily basis. \n   \nNOTES TO EDITORS \n \nEricsson ConsumerLab TV & Media Report 2015  \n \nSlideShare: presentation of TV & Media Report findings \n \nEricsson ConsumerLab reports can be found at www.ericsson.com/consumerlab \n \nDownload high-resolution photos and broadcast-quality video at www.ericsson.com/press \n \nEricsson is the driving force behind the Networked Society - a world leader in communications technology and services. We are in a uniquely strong position to understand how the worlds of media and telecoms are converging. Our heritage in TV and media spans more than 25 years of cutting-edge innovation, enabling many of the milestone shifts. Our services, software and infrastructure - especially in mobility, broadband and the cloud  - are enabling the telecom industry and other sectors to do better business, increase efficiency, improve the user experience and capture new opportunities. \n \nWith approximately 115,000 professionals and customers in 180 countries,  we combine global scale with technology and services leadership. We support networks that connect more than 2.5 billion subscribers. Forty percent of the world's mobile traffic is carried over Ericsson networks. And our investments in research and development ensure that our solutions - and our customers - stay in front. \n \nFounded in 1876, Ericsson has its headquarters in Stockholm, Sweden. Net sales in 2014 were SEK 228.0 billion (USD 33.1 billion). Ericsson is listed on NASDAQ OMX stock exchange in Stockholm and the NASDAQ in New York. \n \nwww.ericsson.com  \nwww.ericsson.com/news  \nwww.twitter.com/ericssonpress \nwww.facebook.com/ericsson  \nwww.youtube.com/ericsson  \n \nFOR FURTHER INFORMATION, PLEASE CONTACT \n \nEricsson Corporate Communications \nPhone: +46 10 719 69 92 \nE-mail: media.relations@ericsson.com  \n \nEricsson Investor Relations \nPhone: +46 10 719 00 00 \nE-mail: investor.relations@ericsson.com  \n \nGraph (pg 4)_Increase in watching on-demand TV series & movies \nGraph (pg 15)_Percentage using coping methods while adverts play \nGraph (pg 5)_Percentage of consumers watching YouTube \nPress release - TV & Media Report 2015 \nGraph (pg 4)_Frequency of binge viewing \nImage_child playing on a device \nImage_front cover of report \nReport - Ericsson ConsumerLab TV & Media 2015 \nImage_woman playing on device \nImage_using different screens \nImage_family watching TV \nGraph (pg 9)_Total TV time by age group and device \nGraph (pg 8)_Percentage watching each content type on smartphone \n\n\nThis announcement is distributed by NASDAQ OMX Corporate Solutions on behalf of NASDAQ OMX Corporate Solutions clients. \nThe issuer of this announcement warrants that they are solely responsible for the content, accuracy and originality of the information contained therein. \nSource: Ericsson via Globenewswire \nHUG#1948571", "source": "Marketplace"}