{"published": "2015-09-16T15:00:50Z", "media-type": "Blog", "title": "Shining Positive Light on Oilers’ Scouting", "id": "d6bf5f55-181b-4fb2-a875-e59baf2417cc", "content": "It’s time to give credit where credit is due. \n \nThe Edmonton Oilers’ amateur scouting department — and that of the AHL’s Bakersfield Condors — deserves some praise for finding a handful of free-agent talents this summer to improve the organization’s overall depth at every position. \n \nIt starts up front, with a trio of new forwards signed to AHL-only contracts in Braden Christoffer, Alexis Loiseau and Connor Rankin. Josh Winquist, who led the Oilers’ prospects in scoring (4-1-5) at this past weekend’s Young Stars tournament, also re-upped with the Condors this summer after an impressive debut last season. Christoffer (3-1-4) was the biggest revelation in Penticton, looking like a legitimate prospect as opposed to fodder for the ECHL’s Norfolk Admirals, while Loiseau (2-2-4) and Rankin (2-0-2) also had their shining moments. \n \nBraden Christoffer may have been the Oilers best player here with 3-2-5. Comes out of nowhere. Well, Sherwood Park and REG Pats, actually \n \n— Mark Spector (@SportsnetSpec) September 14, 2015 \n \n\n \nIn goal, Eetu Laurikainen, a 22-year-old from Finland who previously played major junior in Canada with the WHL’s Swift Current Broncos, was another standout (at times) during the four-team showcase that also featured rookies representing the host Vancouver Canucks, Calgary Flames and Winnipeg Jets. \n \nEvery team earned at least one win, but Edmonton won the tournament with a 2-0-1-0 record thanks in large part to those unheralded prospects. The Oilers were also the only team with a positive goals for-against ratio (18-10). Connor McDavid (1-1-2) played just one game and wasn’t a huge factor in an 8-2 blowout victory. Leon Draisaitl (2-3-5) was the more dominant force, while Darnell Nurse (1-0-1) scored a power-play goal and led the way physically. \n \nHere's the beauty goal by Braden Christoffer to give the #Oilers Rookies a 1-0 edge in the opening frame! pic.twitter.com/p04oqm47lJ \n \n— Edmonton Oilers (@EdmontonOilers) September 12, 2015 \n \n\n \nPenalty shot perfection courtesy @Drat_29 ! #YoungStars  https://t.co/ci6RBeRd8B \n \n— Edmonton Oilers (@EdmontonOilers) September 13, 2015 \n \n\n \n\n \nOn defence, the intriguing name was Loik Leveille, an undrafted tryout from the QMJHL who turns 19 next Friday but is already built like an NCAA linebacker. He had a mixed-bag showing, but could still earn an entry-level contract from the Oilers depending how he fares at training camp back in Edmonton this weekend. \n Give these guys the credit  \nThree men, in particular, should be commended for these signings to date. The first is Condors GM Bill Scott — the lucky man who helped land Connor McDavid at the NHL draft lottery — for getting those prospects to put pen to paper on AHL-only deals. The second is Oilers director of player personnel Bob Green, who was promoted to that position in January and effectively replaced the since fired Stu MacGregor, formerly Edmonton’s director of amateur scouting. Green is a great talent hawk, specializing in Western Canada and the WHL where he cut his teeth with the Edmonton Oil Kings and Medicine Hat Tigers. Green and the third man, amateur scout Jim Crosson, who was among those retained in Edmonton’s staffing overhaul, have their fingers on the pulse of the WHL and certainly had a hand in the additions of Winquist, Christoffer and Rankin. \n \nThat trio may never develop into NHL impact players or even full-time big-leaguers — Condors coach Gerry Fleming compared Christoffer to retired role-player Bob Bassen — but they will be pushing Edmonton’s drafted prospects every step of the way and forcing them to step up in order to earn their keep. That’s called healthy competition, something the Oilers have been lacking at every level in recent years. It bodes well for the future, especially in terms of helping the higher-profile prospects reach their potential. If they don’t, this next wave will be nipping at their heels and capable of overtaking them going forward. \n \nIve enjoyed Josh Winquist tonight, game has evolved since Jr, has played well so far.. #YoungStars  #Oilers \n \n— Andy Levangie  (@AndyLevang) September 13, 2015 \n \n\n \nConnor Rankin, sweet move. It's okay to be the 2nd best Connor on the #Oilers . \n \n— Jim Roepcke (@JimRoepcke) September 13, 2015 \n \n\n \nThe Oilers may get a bad rap for their drafting record — which is full of well-documented failures from the last decade — but they do seem to be making strides in identifying late-bloomers and developing them into possible steals. Edmonton’s brass may not be discovering these diamonds in the rough when they are draft-eligible, but if the Oilers can manage to land them when they are ready to turn pro, that still makes for a happy ending. Perhaps subscribing to the better-late-than-never theory, Edmonton’s persistence appears to be paying off as evidenced by this latest haul. \n \nGranted, a guy like Christoffer had more to prove at the Young Stars tournament than a guy like Vancouver’s Hunter Shinkaruk, but when your free-agent signings are outperforming the opposition’s first-round picks, that’s an endorsement of your aptitude. A source of pride for Scott, Green and Crosson — they had to be all smiles from their lookout points at the South Okanagan Events Centre. \n Getting personal with Crosson  \nThe latter is somebody I’ve got to know well since getting my start in this business a decade ago. In fact, Crosson is a reference on my resumé from his days as general manager of the AJHL’s Lloydminster Bobcats (2005-08) during my time as the team’s beat writer and local newspaper’s sports editor. We’d talk multiple times a week back then — off the record at length on some occasions — and even though the team didn’t achieve much success during his tenure there, I got an appreciation for Crosson’s scouting ability and knowledge of the game. I still run into him from time to time in the press box at Prospera Place — home of the reigning WHL champion Kelowna Rockets — but the Oilers keep Crosson and all of their scouts more tight-lipped, especially around draft time. What little tidbits I can glean from him always prove invaluable and his insights tend to be accurate. \n \nEdmonton #Oilers hire Jim Crosson as scout for AJHL, CIS, and WHL. He is a former prospect of the Oilers from 1980. \n \n— The Oilers Report (@OilersReport) September 9, 2010 \n \n\n \nCrosson is very connected in the Edmonton-area hockey scene and he would have been familiar with Winquist, from St. Albert, and Christoffer, from Sherwood Park, since before their bantam draft year. Crosson likely built relationships with their fathers and families over the course of their junior careers as well. That they are both essentially local products and probably grew up idolizing the Oilers makes for an easy sell, but establishing and maintaining those connections goes a long way in securing commitments too. So give props to Crosson, whose opinions are obviously trusted by Green and all the way up the line to new Oilers GM Peter Chiarelli. \n \n\"I've dreamt of playing in this jersey for a long time, so I'm having a lot of fun.\" #Oilers Braden Christoffer pic.twitter.com/tfvb8NBh5H \n \n— Edmonton Oilers (@EdmontonOilers) September 12, 2015 \n \n\n \nI was happy to see Crosson keep his job amidst that turnover, even if my redrafting of the Oilers came across as an indictment of his work and that of his associates, some of them now former associates. Reality is, they are employed in a results-driven, cutthroat environment that relies on accountability. \n \nThings are finally trending in the right direction for Edmonton — knock on wood — and the right people appear to be in place. That includes Scott, Green and Crosson, who together have a knack for finding prospects who can play at the next level — free assets that are flying under the radar on other teams. One of them will eventually boom and Edmonton’s scouts will go from goofs to geniuses. That’s just how the hockey world works. \n \nLarry Fisher  is a sports reporter for The Daily Courier in Kelowna, British Columbia, Canada. Follow him on Twitter:  @LarryFisher_KDC .", "source": "The Hockey Writers"}