{"published": "2015-09-05T17:14:14Z", "media-type": "News", "title": "Thousands of migrants pour into Austria", "id": "28e9f8d9-e173-426c-8249-71361978341c", "content": "'Exceptional response' as thousands of migrants pour into Austria \nSubscribe today for full access on your desktop, tablet, and mobile device. \nSubscribe Now \n598 \n368 2 Share This Story! \nLet friends in your social network know what you are reading about \n'Exceptional response' as thousands of migrants pour into Austria \nMany quickly jumped on trains for Germany, which has agreed to take in tens of thousands. \nPost to Facebook \nTry Another \n\nAudio CAPTCHA \n\nImage CAPTCHA \n\nHelp \n{#\n                    \n                    #} \nCancel Send \nSent! \nA link has been sent to your friend's email address. \nPosted! \nA link has been posted to your Facebook feed. \n\nDoug Stanglin and Jessica Estepa, USA TODAY 12:54 p.m. EDT September 5, 2015 \nUP NEXT 03 \nThousands of exhausted, surprised and relieved migrants reached Austria on Saturday, clambering off a fleet of Hungarian buses to find a warm welcome from charity workers offering beds and hot tea. (Sept. 5) AP \n\nA refugee child looks out of a city train window at the central station in Munich, Germany, Sept. 5, 2015. Several refugees who arrived on a train from Salzburg were directly transferred to a waiting city train. (Photo: Nicolas Armer, EPA) \n\nThousands of migrants arrived in Austria and many more were heading there on foot Saturday as European countries broke a stalemate and began finding ways to take in the masses of humanity. \n\nHungary, which had spent days stopping migrants from leaving by train, provided buses to take them into Austria. The government relented under international pressure and after desperate refugees who had camped out at the Budapest train station simply began walking toward the border. \n\nAustria opened the floodgates by announcing that \"every refugee in Austria can apply for asylum.\" By early afternoon Saturday, about 6,500 migrants had crossed into the country, Austrian Interior Minister Johanna Mikl-Leitner said. \n\n\"Given the challenges facing our German friends as well, all of Europe needs to wake up. (The time for) reverie is over,\" she said, according to Reuters. \"Now the continent of Europe is challenged. In this great challenge the entire continent has to give a unified answer. Whoever still thinks that withdrawal from the EU or a barbed wire fence around Austria will solve the problem is wrong.\" \n\nThe migrants are mainly from Syria, Iraq and Afghanistan and have endured hardships for months, often traveling overland after lengthy stays in Turkish refugee camps or crossing the Balkans after landing in Greece. Hundreds of thousands of them have fled war, persecution and other hardships this year alone. \n\nIn jubilant scenes on the border, hundreds of migrants walked off buses and into Austria, where volunteers at a roadside Red Cross shelter offered them hot tea and handshakes of welcome. Many collapsed in exhaustion on the floor, smiles on their faces, the Associated Press reported. \n\nAustrian Foreign Minister Sebastian Kurz, arriving for talks with his EU counterparts in Luxembourg, said the refugee crisis \"has to be an eye opener about how messed up the situation in Europe is now.\" \n\nAustrian police say they expect 10,000 arrivals out of Hungary now that Hungary has allowed migrants held up there for almost a week to travel further west.   (Photo: Roland Schlager, EPA) \n\n\"I hope that this serves as a wake up call that (the situation) cannot continue,\" he told reporters, according to The Guardian . \"Thank god, the problem could be solved yesterday evening in a humanitarian way. Anyone who believes that you can sit out this problem is wrong.\" \n\nMigrants had the option of traveling onward to Germany, which also announced that it would take them in. German police said they expect to receive 10,000 migrants from Hungary on Saturday, Reuters reported. \n\nIn Munich, where more than a thousand refugees began arriving Saturday afternoon, some Germans offered small toys to young refugees, Sky News reports.  Arabic-speaking translators were also on hand to help at emergency registration centers. \n\nThe German rail company Deutsche Bahn also announced on Saturday that it would be adding extra carriages to its trains to cope with the huge influx from Hungary, Deutsche Welle reported . The company said it was also adding more staff to help the refugees to get to reception center as quickly as possible. \n\nGerman Chancellor Angela Merkel said there is no legal limit to the number of migrants her country can receive. \"As a strong, economically healthy country we have the strength to do what is necessary\" and ensure every asylum seeker gets a fair hearing, she told the Funke consortium of newspapers in an interview published Saturday. \n\nAt a meeting of European foreign ministers in Luxembourg, the policy shift was almost palpable as states began bracing for a steady stream of migrants. \n\n\"This is not an emergency,\" said Federica Mogherini, the European Union's high representative for foreign affairs and security policy. \"It is an urgency that we are facing. It is not something that starts one day and ends that day.\" \n\nShe said the sooner that Europe accepts this \"psychologically,\" the sooner it will find ways to effectively address the problem. \n\nMogherini said European countries need to work together in five key areas — protection of asylum seekers, combating human trafficking, control of borders, addressing the root causes of the refugee crisis, mainly the instability in Libya and Syria, and helping those countries outside of the EU deal with the flood of refugees across their territories. \n\nAutoplay \n\nShow Thumbnails \n\nShow Captions \nLast Slide Next Slide \nThe U.N. refugee agency welcomed the decision by Austria and Germany to receive thousands of migrants, but warned that a longterm solution is needed. \n\nAntónio Guterres, the U.N. High Commissioner for Refugees, said Friday that the biggest influx of refugees into Europe in decades required a \"massive common effort.\" \n\n\"Europe cannot go on responding to this crisis with a piecemeal or incremental approach. No country can do it alone, and no country can refuse to do its part,\" he said in a statement issued ahead of a key round of EU meetings on the crisis. \"Exceptional circumstances require an exceptional response. Business as usual will not solve the problem.\" \n\nRead or Share this story: http://usat.ly/1EH2fQd \nMore Stories 0) { %> \n0) { %> \n\n0) { %>", "source": "Mansfield News Journal"}