{"published": "2015-09-04T03:25:46Z", "media-type": "News", "title": "Andy Murray takes pride in comeback win over Adrian Mannarino", "id": "a0f9b103-38cf-4c49-823a-6e4bcb7f8cd1", "content": "Andy Murray is proud of his fightback from two sets down against Adrian Mannarino and believes winning in five will give him extra confidence for the rest of the US Open. \n \nIn temperatures pushing 33 degrees Celsius in New York, Murray looked in trouble for the best part of two hours against the world number 35, but the Scot found his groove when it mattered most to go through 5-7 4-6 6-1 6-3 6-1. \n \n\"I'm proud of the way I fought,\" Murray said. \n \n\"It was not an easy match to come through at all. He was making it extremely difficult for me, I thought he played some really, really good tennis. \n \n\"He has such an unorthodox game, I didn't really feel that comfortable at many points out there but I was very happy with the way I fought through that and finished the match stronger than him.\" \n \nMurray was sluggish from the start as Mannarino dictated the rallies and broke the Briton's serve three times in the opening two sets. \n \nOn course for his first grand slam exit before the third round since January 2008, Murray jolted himself into life, playing with more urgency, purpose and precision to wrap up the third set in just 31 minutes. \n \nThe momentum had shifted and the world number three never looked back as he cruised through the last two sets for the loss of just four games to secure a hard-fought win. \n \nIt means Murray has now won 40 of his 48 five-set matches and he admits his strong record gives him belief when matches go the distance. \n \n\"When you're not playing your best, you find a way to come through matches like that and it can give you confidence,\" Murray said. \n \n\"You feel a little bit like you're fortunate to still be in the event and you're a bit more relaxed going into the next matches. \n   Promoted stories   \n\"I've come through many tough matches in my career, and I think that's why when you are behind like that in the scoreline, when you've done it in the past, you have the belief that you can come through and do it again.\" \n \nIt is the 30th consecutive grand slam in which Murray has made at least round three and he will now play Brazilian left-hander Thomaz Bellucci for a place in the last 16. \n \nThe pair have only met once before, in Madrid in 2011, when world number 30 Bellucci won 6-4 6-2 as Murray returned from an elbow injury. \n \n\"I expect a tough match,\" Murray said. \n \n\"I would imagine he's pretty close to his career-high ranking just now. He's played well this year.\" Bellucci's ranking peaked at 21 in July 2010. \n \nMurray added: \"He's got a good serve, he plays predominantly from the back of the court but he's an aggressive player. \n   \n Share article  \n   \n\"He likes to try and dictate the points from the back and he's had some good results this year - he's won two matches here very comfortably. \n \n\"I expect a tough match and one that I'll need to play very well to win.\"", "source": "News Shopper"}