{"published": "2015-09-18T14:28:51Z", "media-type": "News", "title": "Luxury holidays with a low Australian dollar: Why you don't have to give up on luxury", "id": "e0052ef2-a10c-4589-8ef6-ba3f856199ba", "content": "Even with a falling dollar, you don't have to give up on all of travel's 'luxuries'.  Photo: iStock  Luxury in travel is a matter of how you look at it, writes Lee Tulloch.  \nAustralian travellers have become rather fond of the comforts that a strong dollar has bought but the recent currency free fall has had quite a few of us doing our sums and trying to work out how we can continue to travel in the manner to which we have become accustomed. \n\nI'm off to the Republic of Ireland, a Eurozone country, but counting my blessings I'm not going to Northern Ireland, a pound country. The daily exchange rate has suddenly become my obsession. With every euro cent we plunge, I'm thinking: goodbye good times. \n \nIf it's a once-in-a-lifetime experience, or even just the best experience available, go for it, and spend modestly on something else. \n  \nBut of course that is ridiculous. It's possible to have \"champagne wishes and caviar dreams\" (to quote a popular 1980s TV show) when the dollar buys less than 48 pence or US65¢. \n\nThe first thing that needs to be rebooted is the concept of luxury. \n\nI'm always suspicious of the word 'luxury'. Often it's just a description of a bland, mediocre service that has a few frills more than basic. True luxury might be about many other things, according to personal taste - privacy, tranquillity or enriching experiences, perhaps. The dollar value on it is becoming increasingly irrelevant. \n\nThe word is becoming irrelevant and meaningless too. \n\nOne man's luxury might be gold taps and a plethora of cushions and obsequious service. Another's might be downtime in a beautiful, remote location where you can go off the grid. Still another might be a resort or cruise where you can leave the children in the hands of others. Or sleeping in a villa with an amazing history. \n\nThe most \"luxurious\" hotel suite I've ever seen didn't have a whisper of gold or any hint of dazzle – it was exquisitely simple, created by one of the world's most notable designers. Luxury can be what is not as much as what there is. Simplicity can be as costly as ornamentation. \n\nDegrees of opulence never determined luxury for me. Often I'm more impressed with the small details, like pure cotton pyjamas provided at a Vietnamese resort, or a bath filled with rose petals in Bali. \n\nThe greatest luxury for me in travel, what gives me my biggest kicks, is not wallowing in a bed with millions of pillows or sitting up the front of a plane, it is making friends with strangers, spending time with the great characters that populate our world, the thrill of discovering differences but also fellow feeling in the way we all look at the world. \n\nLeisure travel is luxury. We are fortunate to be able to do it. \n\nTravelling thriftily for me is not about cutting corners but about enhancing the experience and not giving in to false economies. I've learnt over the years by the mistakes of made, such as denying myself the restaurant where I'd really like to dine in favour of a cheaper one, and finding that, in the run of things, that extra $100 hasn't mattered one bit. \n\nIf you wish it, small luxuries are perfectly possible at any time. Siphon off a day or two for a splurge on a pricey hotel or set aside funds for a lavish night out. Divert to a less expensive city, like Budapest, which is as opulent as Paris or London. You can have a little bit of luxury every day if you play your cards right. \n\nSomeone once gave me some very good advice – travel with an evening gown or something dressy, because you never know who you might meet and where you'll be invited. So I always travel as if that invitation to someone's palace or villa is just around the corner. And if it isn't, I make my own glamour. \n\nCocktails may cost upwards of 25 euro ($40) in the bars of some of Europe's luxury hotels, but you can nurse one for hours. The bar somewhere classy like Le Meurice in Paris is fascinating, full of diplomats, celebs and eccentrics. Even if you're staying somewhere that's nowhere near as salubrious, no one need know. You'll remember the night you lived it up at a swank hotel. \n\nSimilarly, if you're dressed for it, the sales assistants of the world's expensive boutiques will let you play with their clothes and shoes for hours and you don't have to buy a thing. \n\nIf it's a once-in-a-lifetime experience, or even just the best experience available, go for it, and spend modestly on something else. The nickels and dimes don't matter. It's the memories that count.", "source": "WA Today"}