{"published": "2015-09-15T06:08:22Z", "media-type": "News", "title": "HIV, hep C and STI cases increase in Indigenous communities, remain stable in the broader population", "id": "5419ffff-ba03-4681-aa2d-baef8d9fe261", "content": "Cases of HIV, hepatitis C and other sexually transmitted infections are increasing in Aboriginal and Torres Strait Islander communities. Cases of HIV, hepatitis C and other sexually transmitted infections are increasing in Aboriginal and Torres Strait Islander communities, despite declining or stabilising in the broader population, a new report has found.\n\nThe Kirby Institute's annual surveillance report showed the rate of HIV diagnosis among Indigenous people had climbed to 5.9 per 100,000, compared to 3.7 for non-Indigenous Australians. Ten years ago there was little difference.\n\nLikewise, the rate of hepatitis C has increased in Indigenous communities despite falling over the past 10 years in the general population. There were 300 more diagnoses among Aboriginal and Torres Trait Islanders in 2014 than 2005, but 1300 fewer among non-Indigenous people.\n\nIndigenous health researcher James Ward, an adviser to the Kirby Institute, said the trends were concerning and required immediate action. Aboriginal people were between three and 50 times as likely to be diagnosed with an STI, he said.\n\n\"That's not because they're any more promiscuous, it's about a high burden of disease that primary healthcare hasn't been able to bring under control,\" he said.\n\nAssociate Professor Ward said the link between injecting drug use and infections was \"really worrying\", and Australia risked the same fate as Canada, where First Nations people accounted for 20 per cent of HIV diagnoses each year, despite being only four per cent of the population.\n\nFears that needle use would spread HIV in Aboriginal communities were voiced at the annual Australasian HIV/AIDS Conference five years ago. Higher rates of STIs also made HIV easier to transmit, Associate Professor Ward said.\n\nBut other health experts suggested the higher rates of infection reflected the fact that more Indigenous people were seeing doctors.\n\n\"There's a greater likelihood that people will be tested, so of course the numbers will jump, but it's a false jump,\" said Aunty Kerrie Doyle, Associate Professor of Indigenous health at RMIT.\n\nResearch director at the Poche Centre for Indigenous Health, Jon Willis, said the number of HIV diagnoses in Indigenous communities was still low (33 in 2014), meaning that small increases could appear more significant than they should. \"It's not cause for a panic,\" he said.\n\nThe Kirby Institute report also showed that substantially more people were being tested for HIV nationwide. Between 2011 and 2014, the number of tests among gay and bisexual men attending sexual health clinics doubled to 26,000.\n\n\"There has been an increased effort to make testing more attractive for people,\" said the report's author, Rebecca Guy. Rapid testing now takes as little as 20 minutes, and pre-exposure prophylaxis (PrEP) is available for people who think they may have contracted HIV.\n\nOverall, the report found HIV diagnoses had levelled off over the past three years, although the 1081 new cases recorded in 2014 was still higher than the record low of 714 in 1999. The main route of transmission was sex between men, which accounted for 70 per cent of cases.\n\nSyphilis and gonorrhoea remained conditions that were mostly associated with heterosexual Aboriginal people and homosexual men in urban areas, the report found.\n\nExperts blamed cuts to communicable disease services in Queensland under the former Newman government for the failure to contain a syphilis outbreak that began around the same time.\n\nAssociate Professor Ward said there were now 500 cases of infectious syphilis in regional and remote northern Australia and a handful of babies born with congenital syphilis.\n\n\"That is totally unacceptable in the Australian community,\" he said. Attempts to combat the infection were having marginal success but \"the outbreak is exceeding the efforts\", he said. The story first appeared on The Sydney Morning Herald.", "source": "Northwest Tasmania Advocate"}