{"published": "2015-09-22T05:06:11Z", "media-type": "News", "title": "In clash with pope's climate call, U.S. Church leases drilling rights", "id": "4700674c-07e0-4290-85b6-612fcb85212d", "content": "By Richard Valdmanis \n\nBOSTON, Sept 22 ( ) - Casting the fight against\nclimate change as an urgent moral duty, Pope Francis in June\nurged the world to phase out highly-polluting fossil fuels. \n\nYet in the heart of U.S. oil country several dioceses and\nother Catholic institutions are leasing out drilling rights to\noil and gas companies to bolster their finances, Reuters has\nfound. \n\nAnd in one archdiocese -- Oklahoma City -- Church officials\nhave signed three new oil and gas leases since Francis's missive\non the environment, leasing documents show. \n\nOn Francis' first visit to the United States this week, the\nbusiness dealings suggest that some leaders of the U.S. Catholic\nChurch are practicing a different approach to the environment\nthan the pontiff is preaching. \n\nCatholic institutions are not forbidden from dealing with or\ninvesting in the energy industry. The United States Conference\nof Catholic Bishops' (USCCB) guidelines on ethical investing\nwarn Catholics and Catholic institutions against investing in\ncompanies related to abortion, contraception, pornography,\ntobacco, and war, but do not suggest avoiding energy stocks, and\ndo not address the ownership of energy production interests. \n\nA Reuters review of county documents found 235 oil and gas\nleasing deals signed by Catholic Church authorities in Texas and\nOklahoma with energy and land firms since 2010, covering 56\ncounties across the two states. None of the Texas leases in the\nreview were signed after the pope's encyclical. \n\nThose two states have been at the forefront of a boom in\nU.S. energy production in recent years, often through the\ncontroversial hydraulic fracturing production method, known as\nfracking. \n\nIt was not clear whether production on the Church leases was\nthrough fracking - a process that involves injecting sand, water\nand chemicals underground to crack open rock formations -- or\nmore conventional drilling methods. \n\nThe Church authorities receive a royalty ranging from 15 to\n25 percent of the value of what is taken out of the ground,\naccording to the leases, which are public documents filed with\ncounty clerk offices. Reuters' search method did not capture\nleases signed before 2010 but which may still be in force. \n\n(Click here for a graphic: http://reut.rs/1JcaVcB) \n\n\"There may be some kind of inconsistency here between what\nthe pope has said and what the Church is doing in U.S. oil and\ngas country,\" said Mickey Thompson, a consultant and former\ndirector of the Oklahoma Independent Petroleum Association. \n\nHe added that since the Church often acquires its mineral\nrights through donations from parishioners, there could be\n\"legal or fiduciary reasons\" it has sought to lease them out. It\nwas unclear if that was the case with the leases signed by\nChurch institutions in Texas and Oklahoma, including the three\nleases signed in Oklahoma since June. \n\nA USCCB official and a spokeswoman for the Oklahoma City\narchdiocese both declined to comment. \n\nThe Vatican does not have direct power over investment\ndecisions taken by dioceses in the United States, a\nresponsibility reserved for their bishops. \n\nMembers of the U.S. Catholic hierarchy have fallen out of\nline with papal administrations before. Last year, for example,\nU.S. Cardinal Raymond Burke was moved out of a senior post in\nthe Vatican after clashing with Francis' more liberal views on\nhomosexuality and Catholic re-marriage. \n\nMORAL DISSONANCE \n\nA Reuters examination of financial disclosures by U.S.\nCatholic institutions in August found that they have millions of\ndollars invested in energy companies, from hydraulic fracturing\nto oil sands producers. One U.S. archdiocese,\nChicago, told Reuters it planned to review its energy\nshareholdings in light of the pope's June message. \n\nBut the Church's direct links to the fossil fuels industry\nthrough the Oklahoma and Texas lease deals highlight a\npotentially deeper moral dissonance in the wake of the pope's\nunambiguous attack on human-caused climate change. \n\nFrancis makes his first visit to the United States from\nTuesday through Sept. 27 with stops in Washington, New York and\nPhiladelphia. \n\nIn Texas, dioceses that granted oil leases in recent years\nincluded Dallas, Fort Worth, Austin, and San Antonio. \n\nPat Svacina, a spokesman for the Diocese of Forth Worth,\nsaid the diocese received $31,661 from its leases in fiscal year\n2015. He declined to say whether the diocese was considering\nreviewing its oil and gas leasing program in light of the pope's\nencyclical. \n\n\"The way the leases are written it is very difficult to\ncancel a lease that is in production,\" Svacina said. \"The\nDiocese always reviews the viability and desirability of\nrenewing a lease at the conclusion of a current lease,\" he\nadded, without elaborating. \n\nIn Oklahoma, about one quarter of the roughly 165 Church\nlease deals signed since 2010 were granted by the Archdiocese of\nOklahoma City, with most of the rest granted by the Catholic\nFoundation of Oklahoma and the St. Gregory's Catholic University\nof Oklahoma. \n\nDONATED RIGHTS \n\nOklahoma City Archbishop Paul S. Coakley signed the most\nrecent deal on Sept. 3, giving privately held oil company\nComanche Resources rights to operate on 160 acres in Major\nCounty in exchange for 18.75 percent of the value of the oil and\ngas produced. \n\nThe two-year extendable lease also permits Comanche to lay\npipes, build storage tanks, power stations, and other\ninstallations. (Click here to see the lease: (http://reut.rs/1F9DdcM) \n\nCoakley signed similar deals with energy companies\nContinental Resources and Lance Ruffell Oil in July and\nAugust, with royalties of 25 and 20 percent respectively. \n\nA spokeswoman for the archdiocese declined to comment, and\nefforts to reach Coakley were not successful. The spokeswoman\nalso declined comment on behalf of the Catholic Foundation,\nwhere Coakley serves as chairman. \n\nAn official at St. Gregory's said the university had been\ngiven significant mineral rights by donors, adding that the\nroyalties collected had averaged about $405,000 over the past\nthree years, or 3.7 percent of revenue. The official asked not\nto be identified. \n\nWhile the Church provides little data on its finances,\ninformation from other Catholic institutions in Oklahoma and\nTexas showed oil and gas royalties yielded a small portion of\noverall revenue in recent years, partly reflecting a slide in\nenergy prices. \n\nA review of audited statements issued by the Archdiocese of\nOklahoma City between 2010 and 2013 showed that the oil and gas\nroyalties made up 2 percent of total revenue, or $1.6 million,\nover that period. That share peaked in 2012 at 5 percent, or\n$704,399, according to the audited statements. The other\nOklahoma institutions did not provide data. \n\nA spokesman for the Archdiocese of San Antonio, Jordan\nMcMurrough, said the archdiocese had been collecting small\nenergy royalties on its mineral rights since the 1950s, but that\nthey currently make up less than 1 percent of revenue. \n\n\"The archdiocese currently does not plan changes to its\nlong-standing practice of granting oil and gas leases,\" he said,\nadding that Archbishop Gustavo García-Siller \"is well aware of\nand deeply respects\" Pope Francis' encyclical. \n\nHe said one-third of the archdiocese's mineral rights were\ndonated, with the rest \"by acquisition for church purposes over\nthe years.\" \n\nOfficials at the other dioceses in Texas did not respond to\nrequests for comment. \n\nOther companies that have signed energy leasing deals with\nthe Church in recent years include Apache Corp, Cabot\n, Chesapeake, Devon Energy, and Range\nResources. \n\nAll have been active in a fracking boom over the past\nseveral years. \n\nA spokeswoman for Apache Corp confirmed the company has \"a\nvery limited\" number of leases with the Church, but declined to\ncomment further. The other firms did not respond to requests for\ncomment. \n\nFracking has led to a surge in U.S. production by making new\nreserves available to the industry, and contributed to the slump\nin world energy prices. But the drilling boom has raised worries\nabout pollution, climate change, and potentially damaging\nearthquakes from wastewater injection -- fears that the oil\nindustry says are overblown. \n\nThe American Petroleum Institute has said technological\nadvances and efficient regulation have allowed drillers to raise\nproduction without contaminating water supplies or increasing\nemissions of methane, a greenhouse gas.\n\n (Editing by Stuart Grudgings)", "source": "Mail Online UK"}