{"published": "2015-09-18T11:47:29Z", "media-type": "Blog", "title": "Five Ways to Stay on Top of Debt", "id": "26097aa6-72ea-49ad-a6a5-d15c3ad194d2", "content": "This post is brought to you by Interac® Association and SheKnows Media. When’s the last time you used your credit card? Yesterday? The day before that? While credit cards make life easier, they also make it easier to accumulate debt. Debt is the enemy of financially savvy Moms and Dads. With news that Canada is now in an official recession your personal household debt is now more than ever something you really need to pay attention to. Here are a few ideas for ways to help stay on top of debt this season. Five Simple Ways to Stay on Top of Debt 1. Cancel the credit cards. This is going to be hard, but take it from me. Nothing generates a bigger debt load faster than credit card use. Pick one credit card and keep it for emergencies. That’s it. Pay it off every month if able. (That’s the best option). When we upsized to a new home last year and we applied for a new mortgage the bank asked us to get rid of all but one of the credit cards. That was hard for me because strange as it sounds I had a small emotional attachment to one of the cards that I received as a student and often charged BIG purchases like trips to. They were right. I cut up and cancelled all the credit cards but one and our new home was much easier to pay for. Plus really nobody needs more than one credit card. It should be your emergency card only. It’s easier to enjoy life without a huge debt hanging over your head. 2. Stop Impulse Buys When Able. The smallest things done daily cost a lot of money (and really aren’t very good for your health sometimes either.) I just returned from a week at the cottage and I bought two specialty coffees while there on vacation. Prior to that, I had not bought a specialty coffee in about 6 months. I stopped purchasing expensive handmade cappuccinos and things like that when I committed to saving and also taking control over my weight. So financial health and physical health in one fell swoop. I also allow myself a treat on vacation because that keeps me better able to adhere to my plan the rest of the year. 3. Bundle and Negotiate People don’t believe me sometimes when I tell them this, but I negotiate everything. EVERYTHING. I bundle services to get better deals. I switch providers if I want to save money. I occasionally call places like my bank, or my Internet and cell phone provider and say – “I have been your loyal customer since 1985…what can you do for me?” When we moved to London several years ago I asked the bank to waive all service fees on my new account. They did that for one year. I saved a lot that year. It was important then because we had just bought our first house. I do the same thing when negotiating mortgage. I am never afraid to walk. I can take my mortgage and move it to the next guy who offers lower rates. Saving money matters more than my loyalty to one bank or mortgage agent. 4. Keep a Few Rewards Cards on Hand for Purchases I think I have talked about this before. I have a mad love for a couple of specific rewards cards here. One is Shoppers Optimum. I accumulate points there fast and have used that card to buy many big birthday presents and Christmas presents. The rewards pay out fast. Right now I have over $200 in free product waiting for me there again. An Air Miles card comes in handy too. Pick a maximum of five. PC is a good one here in Canada too. I saved $20 on my groceries yesterday with that reward card. The rest of those rewards cards are not always useful and they add clutter to your wallet sometimes. I can live without that. Just keep the ones that pay out quickly. 5. Use Interac®  Debit.  Take the Interac® 21 Day Credit-Free Challenge With Me I carry a small amount of cash. I use my Interac® Debit card otherwise. Right now you can join me in the Interac 21 Day Credit-Fee Challenge. This challenge is aimed at helping Canadians live better by being debt free. Life is better when you don’t have to worry about debt. The easiest way to avoid debt is by using your own money. Avoid using credit cards to make purchases. The credit card bill is a budget killer and it can also be a punch in the gut. That’s what the Interac® 21 Day Credit-Free challenge is all about – avoiding the sucker punch. Living well and within your means is possible. Disclosure: This post was part of a sponsored collaboration between Interac® Association and SheKnows  Related PostsSix Cruise Hidden Extras #TravelTuesdayFamilies Are the Future of Alberta: Public Funding For In Vitro Fertilization Is Efficient #abhc4ivf #abpoliMy Ontario Valentine Or Ten Reasons We Stay #ohip4ivf #onpoliTen Things Kids Can Do on a Cruise #TravelTuesdayWhy I am Speaking Martian Again: FASD Looks Like This and I am Still Proud to be a Health and Special Needs BloggerAdoption and Family Tree Free Printable Activity for Kids", "source": "Thrifty Mommas Tips"}