{"published": "2015-09-04T06:37:27Z", "media-type": "Blog", "title": "Detroit, Red Stitch, 3 Sept 2015 ***1/2", "id": "ba689223-299d-4edf-b1ea-824c0b7bc133", "content": "By Lisa D’Amour, Red Stitch Actors’ Theatre\nRed Stitch Theatre, St Kilda, 28 Aug to 26 Sept, 2015\nReviewer: Kate Herbert\nStars:***1/2 Full review also published in Herald Sun online today, Fri 4 Sept, 2015, and in print later. I am hoping to see Betrayal (MTC) some time soon, too.  K8\nSarah Sutherland & Ngaire Dawn Fair In Lisa D’Amour’s grim comedy, Detroit, the lives of a suburban couple aspiring to The American Dream hurtle into chaos when they befriend their new neighbours. While Ben (Brett Cousins) struggles with his recent redundancy from his job as a loans officer at the bank, his wife, Mary (Sarah Sutherland), becomes increasingly reliant on vodka and resentment. Their elusive neighbours seem to be a suitable distraction from Mary and Ben’s economic downturn and the isolation of the suburban sprawl in which no one talk to the neighbours any more. ‘Everybody needs good neighbours’, preaches that soap opera theme, but volatile Kenny (Paul Ashcroft) and his ditzy girlfriend, Sharon (Ngaire Dawn Fair), are fresh from rehab programs and clearly new to the concept of suburban delights – they have no furniture and dead end jobs. As these two dysfunctional couples clutch at mutual friendship in a disquieting parody of backyard barbecue bliss and suburban decorum, they reveal shattered dreams, lost opportunities, fragile deceptions and frayed nerves. However, despite the unsettling sense of impending devastation, perhaps a phoenix will be reborn out of the ashes of their lives. D’Amour’s script is not perfectly structured but her dialogue captures the comic pandemonium that occurs when these four lives collide over a grilled burger and lapse into barbecue bacchanalia. The performances by all four actors are strong although Tanya Dickson’s direction occasionally loses control of the necessary, onstage bedlam. Sutherland is a delight to watch as the prim but sozzled Mary as she slurs her words, teeters on her heels and snipes at the soft target that is her husband, Ben, whose wide-eyed naiveté and fading optimism Cousins captures with warmth and sensitivity. As recovering addict Sharon, Fair explodes on the stage with cheerful mania and a seductive but alien quality, while Ashcroft gives Kenny an unpredictable, quietly dangerous edge. Detroit may not be an American classic but it prods at these mutilated lives until we must laugh or cry – or both. Kate Herbert Cast: Paul Ashcroft, Brett Cousins, Ngaire Dawn Fair, Sarah Sutherland & Chris Wallace Director Tanya Dickson Assistant Director Sam Russo\nSet & Lighting Designer Matt Adey – House of Vnholy\nSound Designer Russell Goldsmith\nCostume Designer Jack Grifford\nChoreographer Helen Duncan\nVocal Coach Les Cartwright\nStage Manager Elizabeth Downes", "source": "Kate Herbert Theatre Reviews"}