{"published": "2015-09-21T11:00:00Z", "media-type": "News", "title": "Brivo Launches Brivo Mobile Pass to Open Doors Using Smartphones", "id": "995397a4-c1f0-4af1-b899-f1fb07522f17", "content": "BETHESDA, Md. , Sept. 21, 2015 /PRNewswire/ -- Brivo Inc, the worldwide leader in cloud-based physical access control systems, today announced the release of Brivo Mobile Pass, a digital credential solution that lets users unlock doors with their smartphones. As an enhancement to the existing Brivo OnAir ® access control system, customers can immediately distribute mobile credentials to their entire user population without any on-premise equipment changes.   \n\nAvailable now on both iOS and Android, Brivo's Mobile Pass Application revolutionizes physical security by immediately delivering access control via smartphones without having to install new door readers. Brivo Mobile Pass serves as a mobile complement to physical keycards and readers, and is fully interoperable with existing door reader technologies. \n   \n\"We are giving all of our customers five free Brivo Mobile Passes so that they can use it immediately,\" said Steve Van Till , CEO of Brivo. \"Mobile credentials are changing the way access control works. It's not just about convenience and improved security—although that's a huge part of it. It's that we are improving the relationship with the people who come and go from the spaces we protect.\" \n\nBrivo's previously released Brivo OnAir Mobile Application already provides administrators full accessibility to manage their system from a smartphone; now with Brivo Mobile Pass, all users can open doors using their smartphone. \n\n\"Our customers have been requesting the ability to open doors with their phone,\" said Taylor Carr, Sr. Vice President of Business Development at Securadyne Systems. \"With Brivo Mobile Pass, we now have the means to service that need, all without changing any hardware or sending out a technician. It's proof of the value of a true cloud solution.\" \n\nHow Brivo Mobile Pass Works \n\nBrivo Mobile Pass is a cloud-based mobile credential system that is part of the Brivo OnAir platform.  From a workflow perspective, the Brivo OnAir administrator selects a user and creates a Brivo Mobile Pass invitation that is delivered via email. The user then clicks the \"Add\" button in the email to activate Brivo Mobile Pass on their phone. The user can now open doors as they would have with a keycard, however, Brivo's cloud authentication is far more secure because of the cloud-based authentication. As with keycards, Brivo Mobile Passes can be revoked at any time by the administrator. \n\nFor users, the Brivo Mobile Pass Application is much more convenient and secure than traditional keycards. It travels with them wherever they carry their phone, and it's protected by passcode and biometric capabilities built into the smartphone. When the user wants to open the door he/she simply opens the Brivo Mobile Pass application. It communicates with the cloud using the smartphone's capabilities and requests that the door be opened. No keycard is needed. Brivo Mobile Pass also operates across multiple, unaffiliated Brivo-equipped facilities such as offices, gyms and parking garages. Users can add Brivo Mobile Passes from an unlimited number of Brivo OnAir accounts via email. \n\n\"Naturally, we've invested a lot in encryption and cyber security for this new service,\" said Van Till . \"When designing it, we recognized that cloud-based authentication is a very well understood field, with rich solutions that work very well for banking, electronic signatures, and the like. We chose to adopt these proven secure approaches over the much less developed technologies that are utilizing Bluetooth door readers.\" \n\nThe Brivo Mobile Pass app is available for download from the App Store and Google Play. For a quick video overview, check out brivo.com/brivomobilepass . \n\nFor more information on Brivo's physical security offerings, please visit www.brivo.com . \n\nAbout Brivo Inc. \n\nBrivo Inc. is the worldwide leader of cloud-based physical access control systems.  Currently servicing nearly 7 million users, the company's award-winning Brivo OnAir® provides unmatched scalability and centralized security management for global enterprises, while retaining the ease of use for small and medium sized customers. The Brivo OnAir security management system is unique in providing combined access and video management in a single cloud platform. Headquartered in Bethesda, MD , Brivo was founded in 1999. \n\nPhoto - http://photos.prnewswire.com/prnh/20150918/268140  \nLogo - http://photos.prnewswire.com/prnh/20150203/173143LOGO  \nPDF - http://origin-qps.onstreammedia.com/origin/multivu_archive/ENR/268139-Brivo-Frequently-Asked-Questions.pdf  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/brivo-launches-brivo-mobile-pass-to-open-doors-using-smartphones-300145805.html \n\nSOURCE  Brivo Inc.", "source": "Vision Monday"}