{"published": "2015-09-11T04:15:58Z", "media-type": "News", "title": "Gibson Southern must deal with Carter, again", "id": "40c3f9e0-9067-4807-8bee-8c17d41bfbcc", "content": "HENDERSON, Ky. - Even though his team has outscored its opponents 189-7, Gibson Southern coach Nick Hart is having nightmares about Henderson County running back Damion Carter. \n\n“He is causing me a lot of sleepless nights this week,” said Hart, who remembers the Colonel running back well even though the school’s have never met in varsity competition. \n\n“We began playing Henderson County on the freshman level my first year here,” said Hart, who is in his fourth season as Gibson Southern’s head coach. “These seniors were freshmen then. Henderson County beat us that night and Carter torched us pretty good. I remember leaving the game that night saying, ‘I’m glad I’ll never have to try to stop that kid again.’” \n\nCarter, who is closing in on Henderson County’s career rushing record, is averaging 145.3 yards rushing a game this season for the Colonels. \n\nThe Titans, who are 3-0 and ranked second in Indiana’s Class 3-A, typically enjoy a speed advantage over most of their opponents. “I think we’re going to be on the wrong end of the speed mismatch this Friday,” Hart said. But that was one of Hart’s reasons in wanting to add the series with Henderson County. \n\n“Henderson County has had a great program for a long time. They have the type of athletes that we won’t see until we are deep into the playoffs,” he said. \n\nGibson Southern has a history of deep playoff runs in Hart’s three years with the program after four straight losing seasons before Hart’s arrival. He guided them to the state semifinals in his first two seasons. Last year, Gibson Southern lost to Heritage Hills 14-13 in the sectional finals. \n\nThe Titans’ 32-member senior class includes 10 players who started as sophomores and three who started as freshmen. Senior quarterback Nick Sellers is one of those three-year starters. He threw for 2,336 yards last season but has only 42 attempts so far this season mainly because all three of the team’s games have been blowouts. \n\nSenior Griffin Scheller has been an all-state selection the last two years — once at defensive back and once at receiver. Scheller is primarily a defensive back this season as Gibson Southern will two-platoon as much as possible. Scheller, who enters the game on offense in certain situations, is still a big-play threat as he has taken four of his eight catches this season into the end zone. \n\nGibson Southern’s pass-oriented attack spreads the ball around among several receivers. Running backs J.J. Miller and Dylan Stefanich are averaging around 100 yards rushing per game. \n\nThe Titan defense, which gave up its first points of the season last week to North Posey in a 63-7 win, is led by senior lineman Cory Klem. “He has nine or 10 tackles for loss. He’s very disruptive,” Hart said. \n\nOpening the season with 63-0 wins over Pocket Athletic Conference opponents Forest Park and South Spencer, Hart is certain his team will face its toughest test of the season so far on Friday. \n\n“It’s not even close. Henderson may be 1-2, but they’d be 3-0 too if they had played our schedule,” Hart said. \n\nFriday’s game is the first game in a four-year contract between Henderson County and Gibson Southern. Hart, who is the son of former Reitz coach John Hart, played at Reitz for one season when Henderson County coach Tony Lewis was the defensive coordinator on his father’s staff. Lewis left after the season for his first head coaching position at Wheelersburg, Ohio.", "source": "The Henderson Gleaner"}