{"published": "2015-09-03T11:10:58Z", "media-type": "News", "title": "LHC Group to Acquire Halcyon Hospice", "id": "fc1ed579-e618-4d8f-a0e2-2bb45d40bfee", "content": "LHC Group, Inc. (NASDAQ:LHCG), a national provider of comprehensive post-acute healthcare services, announced today that it has entered into a definitive agreement to acquire Halcyon Hospice LLC for approximately $58.5 million in cash. As a result of the acquisition, LHC Group expects to receive a step up in tax basis, resulting in anticipated cash tax savings to LHC Group over the next 15 years, the net present value of which is approximately $7 million. Therefore, the adjusted purchase price, net of tax benefits, is $51.5 million. The transaction, which has been approved by the Boards of Directors for both companies, is expected to close on or around October 1, 2015, subject to certain customary closing conditions. Halcyon was founded in 2010 by Dan Kohl and Jack Draughon with a private equity partner. Based in Cumming, Georgia, Halcyon is one of the largest independent providers of hospice services in the southeastern United States. It operates 16 hospice locations across three states, including two inpatient hospice facilities, and has approximately 400 employees. Halcyon's service area covers 183 counties across Georgia, Mississippi and South Carolina, including 59 counties in which LHC is licensed for home health. Annual revenue for Halcyon is approximately $41 million. Upon completion, this acquisition will increase LHC's hospice service line to 53 locations in 12 states with over $110 million in annual revenue. \n\nThis acquisition is anticipated to be dilutive to LHC Group's fourth quarter 2015 earnings per share by approximately $0.06 due to transaction and integration costs, but accretive to LHC Group's 2016 earnings by between $0.15 and $0.20 per diluted share. LHC Group is raising its full year 2015 guidance for net service revenue to a new range of $800 million to $815 million from the previous range of $780 million to $795 million and is reaffirming its 2015 fully diluted earnings per share in the range of $1.70 to $1.80 to incorporate the impact from this transaction. \n\n\"Two of our stated strategic objectives are to grow our hospice operations into new geographical markets and to expand our hospice footprint in specific markets where we have home health operations,\" said Keith G. Myers, LHC Group's chairman and CEO. \"Halcyon's expertise and service area complement LHC's extensive home health market presence in the Southeast. Halcyon's strong culture and track record of successfully providing high-quality, end of life care have positioned the company as a leader in the hospice industry. When we combine the Halcyon operations with our current LHC hospice operations, we are confident we will not only have one of the largest hospice platforms in the country, but also one of the industry leaders in care and service. We welcome the healthcare professionals at Halcyon to the LHC Group family and look forward to combining the best practices of each organization to deliver high-quality care that allows patients to remain in the comfort of their homes.\" \n\nDan Kohl, CEO of Halcyon Hospice, added, \"We know and respect LHC Group as a strong provider of high-quality healthcare services. LHC Group has a stellar reputation for the compassionate care provided to patients and families throughout its current hospice operations. We are very pleased to be combining with an organization that we are confident will continue to provide our patients and their families outstanding care and service, while giving our agency employees a great place to continue their careers.\" \n\nLHC Group also announced today that it has acquired a home health and hospice provider in Louisiana and a home health provider in Arkansas. The annual combined revenue for these transactions are $3.8 million. \n\nAbout LHC Group, Inc. \n\nLHC Group, Inc. is a national provider of post-acute healthcare services, providing quality, cost-effective healthcare to patients primarily within the comfort and privacy of their home or place of residence. LHC Group provides a comprehensive array of healthcare services through home health, hospice and community-based services agencies and long-term acute care hospitals. \n\nCertain matters discussed in this press release constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, such as statements about the Company's future financial performance and the strength of the Company's operations. Such forward-looking statements may be identified by words such as \"continue,\" \"expect,\" and similar expressions. Forward-looking statements involve a number of risks and uncertainties that may cause actual results to differ materially from those expressed or implied by such forward-looking statements, including changes in reimbursement, changes in government regulations, changes in LHC Group's relationships with referral sources, increased competition for LHC Group's services, increased competition for joint venture and acquisition candidates, changes in the interpretation of government regulations and other risks set forth in Item 1A. Risk Factors in LHC Group's Annual Report on Form 10-K for the year ended December 31, 2014, filed with the Securities and Exchange Commission. LHC Group undertakes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. \n\nhttp://media.globenewswire.com/cache/8948/small/7253.jpg \n\nhttp://www.globenewswire.com/newsroom/ti?nf=MTMjMTAxNDgxMzIjODk", "source": "Individual.com"}