{"published": "2015-09-07T05:15:45Z", "media-type": "News", "title": "Basilea announces development of inhaled dosage form of its Gram-negative antibiotic BAL30072 as part of European iABC program", "id": "459ed322-8ce9-495b-a546-5020f83418ea", "content": "Basilea Pharmaceutica AG /\nBasilea announces development of inhaled dosage form of its Gram-negative \nantibiotic BAL30072 as part of European iABC program \n. Processed and transmitted by NASDAQ OMX Corporate Solutions.\nThe issuer is solely responsible for the content of this announcement. \n Start of \"inhaled Antibiotics in Bronchiectasis and Cystic fibrosis\" (iABC) program to develop new antibiotic treatments for cystic fibrosis and bronchiectasis   \nBasel, Switzerland, September 7, 2015 - Basilea Pharmaceutica Ltd. (SIX: BSLN) announced today that an inhaled formulation of its antibiotic BAL30072 will be developed as part of a new Europe-wide program focusing on new antibiotics that could improve the lives of patients with cystic fibrosis and bronchiectasis. BAL30072 is an investigational monosulfactam antibiotic with in-vitro and in-vivo activity against many clinically relevant multidrug-resistant Gram-negative bacteria. \n    \nThe iABC (inhaled Antibiotics in Bronchiectasis and Cystic fibrosis) consortium, which includes world-leading lung specialists from across Europe, will develop new inhaled antibiotics to manage chronic lung infection, the main cause of disease and mortality in patients with cystic fibrosis and bronchiectasis. \n \nThe new drugs are being developed in response to an urgent need for new forms of inhaled antibiotics. They are expected to improve patients' quality of life by reducing lung infections and flare-ups, improving lung function, and overcoming antibacterial resistance which frequently occurs in patients with these conditions. \n \nProf. Achim Kaufhold, Basilea's Chief Medical Officer, stated: \"We are pleased to work with the iABC consortium within the European IMI, focusing on the high medical need associated with resistant Gram-negative infections that affect cystic fibrosis and bronchiectasis patients.\" He added: \"The development of an inhaled version of BAL30072 as a targeted treatment option for chronic lung infections may provide a new treatment option for these patients. The project will initially include pre-clinical development activities in preparation of clinical phase 1 studies.\" \n \nThe five-year iABC program is part of the European New Drugs for Bad Bugs (ND4BB) program and will also establish the first European patient register for bronchiectasis, providing a platform to improve the quality of care for patients across Europe as well as making it easier to develop and trial new drugs. \n \nThe iABC consortium, which is led by researchers from the School of Medicine, Dentistry and Biomedical Sciences, and the School of Pharmacy at Queen's University Belfast with EFPIA * partners Basilea and Novartis is funded by the European Commission through the Innovative Medicines Initiative (IMI) and through contributions by EFPIA companies. The total funding for BAL30072 related work will be approximately EUR 11 million of which Basilea contributes about half. The consortium involves researchers from 20 organizations in eight countries across Europe. \n \nAbout cystic fibrosis and bronchiectasis \n \nCystic fibrosis (CF) is a genetic disease that blocks a patient's lungs and digestive system, affecting approximately 36,000 people in the European Union. Chronic bacterial pulmonary infection leading to an irreversible decline in lung structure and function is the main cause of mortality and morbidity in patients with CF. Pseudomonas aeruginosa is the most frequently isolated pathogen, chronically infecting up to 80% of adult patients. More than 95% of deaths in patients with cystic fibrosis are due to respiratory failure, often as a result of chronic lung infection. \n \nBronchiectasis (BE) is a group of diseases in which a person's airways become damaged and scarred. In developed countries, BE affects from 4 per 100,000 young adults to nearly 300 per 100,000 persons 75 years and older. In 2012 it was calculated that 2.4 million of patients worldwide were affected by BE, and estimated to grow to 3 million in 2020. Patients with BE suffer from similar symptoms as patients with CF. Estimates suggest that the airways of almost all patients with bronchiectasis are chronically infected with pathogenic bacteria. More than 30% of the BE patients suffer from chronic Pseudomonas aeruginosa infections. \n \nAbout the iABC consortium \n \nThe iABC consortium involves researchers from Northern Ireland, Scotland, England, Spain, Germany, France, Italy, Belgium, the Netherlands and Switzerland. \n \nOrganisations involved in the iABC consortium are Queen's University Belfast, Belfast Health and Social Care Trust, University Medical Center Utrecht, Fraunhofer-Gesellschaft zur Förderung der angewandten Forschung e. V., Hannover, Rijksuniversiteit Groningen, Servicio Madrileño de Salud, Madrid, Universitair Ziekenhuis Antwerpen, University of Dundee, Institut National de la Santé et de la Recherche, Poitiers, Università degli Studi di Milano, Hospices Civils de Lyon, Medizinische Hochschule Hannover, Universiteit Antwerpen, University of Edinburgh, Royal Brompton and Harefield NHS Foundation Trust, Fundació Clínic per a la Recerca Biomèdica, Barcelona, Papworth Hospital NHS Foundation Trust, Erasmus Medical Center, Rotterdam, and the EFPIA companies Basilea Pharmaceutica International Ltd., and Novartis Pharma AG, Basel. \n \nAbout IMI, ND4BB and EFPIA \n \nIn November 2011, the European Commission launched its Action Plan against the rising threat from Antimicrobial Resistance, and called for \"unprecedented collaborative research and development efforts to bring new antibiotics to patients.\" The New Drugs for Bad Bugs (ND4BB) program was launched within the Innovative Medicines Initiative (IMI) in direct response to this call. IMI is a joint undertaking between the European Union and the European Federation of Pharmaceutical Industries and Associations (EFPIA); it constitutes Europe's largest public-private initiative aiming to accelerate the development of better and safer medicines for patients. More information: www.imi.europa.eu . \n \nThe EFPIA brings together 33 European national pharmaceutical industry associations as well as 40 leading companies undertaking research, development and the manufacture in Europe of medicinal products for human use. More information: www.efpia.eu . \n \nAbout Basilea \n \nBasilea Pharmaceutica Ltd. is a biopharmaceutical company developing products that address increasing resistance and non-response to current treatment options in the therapeutic areas of bacterial infections, fungal infections and cancer. The company uses the integrated research, development and commercial operations of its subsidiary Basilea Pharmaceutica International Ltd. to discover, develop and commercialize innovative pharmaceutical products to meet the medical needs of patients with serious and potentially life-threatening conditions. Basilea Pharmaceutica Ltd. is headquartered in Basel, Switzerland and listed on the SIX Swiss Exchange (SIX: BSLN). Additional information can be found at Basilea's website www.basilea.com . \n \nDisclaimer \n \nThis communication expressly or implicitly contains certain forward-looking statements concerning Basilea Pharmaceutica Ltd. and its business. Such statements involve certain known and unknown risks, uncertainties and other factors, which could cause the actual results, financial condition, performance or achievements of Basilea Pharmaceutica Ltd. to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements. Basilea Pharmaceutica Ltd. is providing this communication as of this date and does not undertake to update any forward-looking statements contained herein as a result of new information, future events or otherwise. \n \nFor further information, please contact: \n Media Relations Investor Relations Peer Nils Schröder, PhD \nHead Public Relations & \nCorporate Communications \n+41 61 606 1102 \nmedia_relations@basilea.com  Barbara Zink, PhD, MBA \nHead Corporate Development \n+41 61 606 1233 \ninvestor_relations@basilea.com  \n\nThis press release can be downloaded from www.basilea.com . \n \nReferences \n * European Federation of Pharmaceutical Industries and Associations  \nPress release (PDF)", "source": "Tacoma News Tribune"}