{"published": "2015-09-19T06:49:01Z", "media-type": "News", "title": "Robbie Williams 'in secret talks to reunite with Take That for 25th anniversary celebrations'", "id": "09b8c1f6-0f0a-4ee5-8d42-eaa5d683c418", "content": "The Angels singer is reportedly keen to get back with his former bandmates to celebrate the group's milestone He shattered the hearts of teenage girls everywhere when he announced he was quitting Take That in 1995.\n\nRobbie Williams briefly reunited with the boys back in 2010 - and now it looks like he could be welcomed back into the fold once more.\n\nAccording to reports, Robbie is having 'secret talks' about getting back with his former bandmates - minus Jason Orange - to celebrate the group's 25th anniversary.\n\nA source told The Sun: \"Robbie's first return to Take That was never going to be a one-off. He feels passionate and proud of the band's achievements and still wants to be part of it. ITV Jason Orange, Howard Donald, Robbie Williams, Gary Barlow and Mark Owen of Take That \"He loves the big tours and being in the studio with the lads. His comeback will be a great way to mark their anniversary.\"\n\nIn June Robbie proved he still firmly supports the boys as he posted a picture with his arms around Gary Barlow, Mark Owen and Howard Donald following a show at London's O2 Arena.\n\nHe wrote: \"I've just been to see the show of the year @ the O2. I love my boys. Pride, nostalgia, entertained, happy #LETMEBACKIN x\"\n\nBut a rep for Robbie told Mirror Celebs: \"Robbie’s plan for 2016 is to make his next solo album. He then hopes to subsequently tour that album.\n\nIve just been to see the show of the year @ the o2. I love my boys. Pride,nostalgia, entertained,happy #LETMEBACKIN x pic.twitter.com/HYwdEOLvdV\n\n— Robbie Williams (@robbiewilliams) June 15, 2015 \"These are his only plans in terms of recording and touring.\"\n\nAccording to reports, any reunion is unlikely to feature Jason, who quit in September last year.\n\nA source said: \"He has no wish to return and is happy to do his own thing.\" VIEW GALLERY", "source": "Mirror.co.uk"}