{"published": "2015-09-15T13:46:30Z", "media-type": "News", "title": "TinderBox Launches TinderBox Signals to Provide Sales Teams, Execs...", "id": "61cfef77-ace5-4ffb-9387-bce11643414c", "content": "Indianapolis, Indiana (PRWEB) \r September 15, 2015 \r \n\nTinderBox, a leader in sales productivity technologies, launched its new TinderBox Signals alerting tool today, expanding the company’s capability to create and automate email and mobile alerts that identify when customers interact with sales proposals, contracts and presentations. \n \nTinderBox Signals extends the company’s real-time alerting capabilities by enabling customers to define specific triggers, such as deal size, location, reviewer title, products proposed, and action taken on any TinderBox document, to power mobile and email alerts – either in real-time or in a daily or weekly digest. \n \n“As b-to-b sales rapidly move online, executives and sales teams need a better way to understand what digital interactions signal a deal is moving,” said Dustin Sapp, TinderBox co-founder and chief executive officer. “With TinderBox Signals, we’re making it easy for executives and sales teams to identify in real time which buyers are engaged and what specifically they’re viewing to prioritize follow up and close deals faster.” \n \nTinderBox Signals provides an online interface to create, define and subscribe to personalized alerts that identify specific action taken on any online proposal, contract or presentation powered by TinderBox.  Customers can identify who within the organization should receive alerts via email or mobile, the frequency with which alerts are sent and what specific actions trigger alerts. \n \n“Great sales teams blend speed, precision and accuracy to connect with customers and anticipate their needs throughout the buying process,” said Matt Gvazdinskas, director, Salesforce.com platform team at ZirMed. “With TinderBox Signals, we’ll give our team a powerful new solution that they can control to better understand how and when customers interact with sales materials to prioritize follow up and keep the sales process moving.” \n \nTinderBox Signals will be generally available to all TinderBox customers at no additional cost Oct. 12. \n \nTinderBox Signals is the latest innovation in the company’s expanding suite of online sales productivity technologies. The announcement follows the launch of TinderBox Close™ – its online contracting solution that embeds the strength of Digital Transaction Management leader DocuSign with TinderBox’s workflow, automation and analytics to provide a faster way to create, redline and close contracts online. \n \nAbout TinderBox\r \nTinderBox transforms how companies sell with a cloud-based sales productivity suite that powers personalized sales proposals, contracts and presentations entirely online. Through automation, workflow and analytics, TinderBox makes it possible for sales teams to sell smarter and close deals faster from any device, anywhere. Visit http://www.GetTinderBox.com and follow @GetTinderBox for more information. \n  \nShare article on social media or email", "source": "PRWeb"}