{"published": "2015-09-18T17:51:33Z", "media-type": "News", "title": "CITGO Continues its Caring for Our Coast Program as Regional Gulf Coast Sponsor of National Estuaries Week", "id": "c82d5d2c-c32c-4765-b54a-0e5fd8af3ad1", "content": "SOURCE CITGO Petroleum Corporation\n\nHOUSTON \n\nThis year, National Estuaries Week falls on a significant date for the Gulf Coast region, with September 26 \n\nCITGO supports National Estuaries Week through its environmental stewardship initiative, Caring for Our Coast. This initiative, launched to commemorate the 10 years since Hurricanes Katrina and Rita struck the region, focuses on volunteer programs that advance natural habitat restoration and wetlands conservation along the Gulf Coast, as well as the enhancement of science, technology, math and engineering (STEM) education. Thus far in 2015, CITGO has committed resources for projects targeted to involve more than 2,500 volunteers contributing 12,000 hours of their personal time, with the goal of restoring nearly 4,000 acres. \n\nAs the Regional Gulf Coast Sponsor for National Estuaries Week, CITGO will gather volunteers for several conservation events throughout the Gulf, both preceding and following National Estuaries Week, these include:\n\n\"With two refineries, eight terminals and 1,360 independently owned gas stations and a workforce of nearly 4,000 employees and contractors throughout the region, our commitment to the Gulf Coast runs deep,\" said CITGO President and CEO Nelson P. Martinez \n\nEstuaries are a crucial natural resource in the United States \n\n\"National Estuaries Week projects focus on improving water quality, rebuilding shorelines and opening up passages for fish in our nation's estuaries,\" said Jeff Benoit \n\nThroughout the year, CITGO partners regularly with several organizations affiliated with Restore America's Estuaries, including the Alabama Coastal Foundation, Coalition to Restore Coastal Louisiana, Galveston Bay Foundation, Land Trust for the Mississippi Coastal Plain and Tampa Bay Watch to lead the Gulf in environmental protection and restoration efforts. To learn more about Caring for Our Coast and the company's larger commitment to environmental stewardship, please visit www.citgocaringforourcoast.com or follow @CITGO on Twitter. \n\nFor more information on National Estuaries Week, including a calendar of events, you can visit: www.estuaries.org/national-estuaries-week, follow @RAEstuaries on Twitter or Restore America's Estuaries on Facebook. \n\nAbout CITGO\n\nCITGO, based in Houston \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/citgo-continues-its-caring-for-our-coast-program-as-regional-gulf-coast-sponsor-of-national-estuaries-week-300145648.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KSWO"}