{"published": "2015-09-13T10:35:44Z", "media-type": "Blog", "title": "With only 3 days left, Pakistan votes for Sabeen’s T2F for Dutch human rights prize", "id": "0999c2a0-2f07-4f84-ac8a-c08304af1ab9", "content": "Sabeen Mahmud, founder of The Second Floor (T2F), had dedicated her life to providing a space for open expression for everyone – from artists and musicians to those who were persecuted or dispossessed in Pakistan. \n \nShe eventually laid down her life for what she believed in; however, her memory still lives on and her efforts will not go in vain. \n \nT2F has been nominated for the Dutch Human Rights Tulip 2015 award and if it wins, the grant will allow the organisation to keep its doors open for her work to go forward. \n \nPublic voting  for the award started on September 9 and will go on till September 16. The winner will be announced on December 10. \n \nT2F, which was on fourth place on September 10, has dropped down two places with 1,476 votes. You can cast your vote here . \n \n\n \nRead: T2F nominated for Dutch human rights award \n \nThe award  is presented by the Netherlands Ministry of Foreign Affairs to those who promote and support human rights in innovative ways. The winner is awarded a prize worth €100.000 to further help their cause. \n \nMahmud’s NGO is among 30 other organisations that have been selected for public voting. After the voting period, only six candidates will be left, of which three will be public favourites and three wild cards selected by the Dutch Ministry of Foreign Affairs and Hivos, a non-governmental organisation. \n \nT2F was established in 2007 as the first project of PeaceNiche and was the brainchild of Mahmud. It is a community space for open dialogue which provides a platform for people aiming for social change and it features a coffeehouse, bookshop, and exhibition gallery. \n \nRead: A step ahead: Sabeen’s mother takes the torch forward \n \nMahmus was shot dead by gunmen on April 24, 2015 as she left T2f. \n \nThe post With only 3 days left, Pakistan votes for Sabeen’s T2F for Dutch human rights prize appeared first on The Express Tribune .", "source": "The Express TribuneThe Express Tribune"}