{"published": "2015-09-25T17:25:49Z", "media-type": "News", "title": "Radiant Logistics to Host Investor Call to Discuss Financial Results for Fourth Fiscal Quarter and Year Ended June 30, 2015", "id": "974ea4b4-2d33-4f28-95ac-0ee8be3bee5a", "content": "Call Scheduled for Monday, September 28, at 4:00 PM Eastern \n\nBELLEVUE, Wash., Sept. 25, 2015 /PRNewswire/ -- Radiant Logistics, Inc. (NYSE MKT: RLGT), a third party logistics and multimodal transportation services company, will host a conference call on Monday, September 28, at 4:00 PM Eastern to discuss the Company's financial results for the three and twelve months ended June 30, 2015. \n\nThe conference call is open to all interested parties, including individual investors and press.  Bohn Crain, Founder and CEO will host the call. \n\nConference Call Details \n\nUS (877) 407-8031; Intl. (201) 689-8031 \n\nSeptember 29, 2015 at 9:30 AM Eastern to October 12, 2015 at 11:59 PM Eastern \n\nUS (877) 660-6853; Intl. (201) 612-7415                         \n\nConference ID number: 13620540 \n\nWebcast Details \n\nThis call is also being webcast and may be accessed via Radiant's web site at www.radiantdelivers.com or through www.InvestorCalendar.com. \n\nAbout Radiant Logistics (NYSE MKT: RLGT) \n\nRadiant Logistics (www.radiantdelivers.com) is a comprehensive North American provider of third party logistics and multimodal transportation services.  As a non-asset provider, with minimal investment in equipment, the company delivers advanced supply chain solutions through a network of company-owned and strategic operating partner locations across North America under the Radiant®, Wheels™, On-Time™, Airgroup®, Adcom®, Distribution by Air™ and Service by Air™ network brands.  Through its comprehensive service offering, the company provides domestic and international freight forwarding services, truck and rail brokerage services and other value-added supply chain management services, including customs brokerage, order fulfillment, inventory management and warehousing to a diversified account base including manufacturers, distributors and retailers using a network of independent carriers and international agents positioned strategically around the world. \n\nLogo - http://photos.prnewswire.com/prnh/20110606/CL14193LOGO \n\n  \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/radiant-logistics-to-host-investor-call-to-discuss-financial-results-for-fourth-fiscal-quarter-and-year-ended-june-30-2015-300149264.html \n\nSOURCE Radiant Logistics, Inc. \n\n© 2015 Canjex Publishing Ltd. All rights reserved.", "source": "Stockwatch"}