{"published": "2015-09-16T09:57:11Z", "media-type": "Blog", "title": "Ferrari opens up on the 488 Spider, a 661 horsepower drop-top", "id": "c42dde59-fad8-47a2-896a-3bda28aec5d2", "content": "Editors' take User Reviews Specs Shop 1 of 15 2 of 15 3 of 15 4 of 15 5 of 15 6 of 15 7 of 15 8 of 15 9 of 15 10 of 15 11 of 15 12 of 15 13 of 15 14 of 15 15 of 15 Previous Next Ferrari opens up on the 488 Spider, a 661 horsepower drop-top Pricing is currently unavailable. By Tim Stevens / Sep 16, 2015 / @Tim_Stevens CNET Editors' Rating 0 stars Not yet rated Average User Rating 0 stars Be the first to review! Preview FRANKFURT -- It's a story that's been told time and time again, yet with each telling it gets more and more exciting. It goes something like this: Ferrari unveils a new generation of V-8 supercar, then maybe a year later comes the convertible version. In the early days, there were compromises to be made -- extra weight from the folding roof and compromised handling from the flexier chassis and so forth. But with each generation those compromises are minimized. In this new 488 Spider, the decision between hard-top and drop-top will be more difficult than ever.\nLike the 458 before, the 488 Spider eschews a traditional fabric convertible top, instead going with a retractable hard unit that splits into two pieces before tucking itself neatly and dutifully into the trunk. That retraction or erection takes just 14 seconds, the same as the 458 Spider that came before, and even while the car is in motion -- though Ferrari isn't saying how fast you can be going while doing it.\n33 Photos Ferrari 488 Spider is drop-top perfection (pictures) Ferrari also isn't saying how much of a weight penalty buyers of the new Spider will pay versus the normal GTB, but the outgoing 458 Spider gained about 100 pounds over its hard-top predecessor. Look for a similar figure with the 488.\nPower still comes from that new, twin-turbo V-8, a whopping 661 horses worth at 8,000 rpm. That's up 100 from the old 458, enough to sprint from zero to 60 in less than 3 seconds, while a new exhaust will ensure the Spider has a distinctive sound compared to the coupe. The Spider also gets all the GTB's aerodynamic tweaks, including an advanced diffuser and a sculpted under-tray designed to keep the thing planted to the road without any unnecessary wings and fins. The top drops on the 488 Spider in just 14 seconds. Ferrari Ferrari has not announced a price premium for the Spider over the 488 GTB, nor any immediate availability, but if you want to be anywhere near the top of the waiting list, you'd best call your local Ferrari dealership soon. About The Author\nTim Stevens Tim Stevens got his start writing professionally while still in school in the mid '90s, and since then has covered topics ranging from business process management to videogame... Read More Don't Miss Samsung Galaxy S6 Starting at: $0.00 4.5 stars The first great smartphone of 2015 Cree Connected LED Bulb 4.5 stars The right smart bulb for the right price 2015 Subaru Outback Starting at: $35,191.00 3.5 stars New Subaru Outback could be best family wagon ever Apple iPhone 6 Plus Starting at: $0.00 4.5 stars The most serious Apple smartphone yet Comments", "source": "CNET Reviews - Most Recent Reviews"}