{"published": "2015-09-05T21:13:31Z", "media-type": "News", "title": "Brewers 8, Reds 6", "id": "0a7487ce-077b-428e-bc8a-72c72d5ce3bf", "content": "CINCINNATI - Elian Herrera homered and Jean Segura and Domingo Santana each collected two RBIs, lifting the Milwaukee Brewers to an 8-6 victory over the Cincinnati Reds in the first game of a day-night doubleheader on Saturday.Milwaukee (59-75) won for a fifth straight time at Great American Ball Park, but the Reds made it interesting in the ninth against Francisco Rodriguez. Back-to-back one-out singles by first baseman Joey Votto and second baseman Brandon Phillips brought the winning run to the plate as Phillips tied a career-high with four hits. But Rodriguez retired the final two batters for his 34th save.Right-hander Jeremy Jeffress (5-0) earned the victory despite allowing a run on three hits in one inning.Shortstop Eugenio Suarez went 3-for-4 with a double and two RBIs for Cincinnati (55-78) and J.J. Hoover (7-1) earned his first defeat.Brewers right-hander Matt Garza posted a 7.84 ERA this season in two prior starts against the Reds, who didn't waste much time getting to him Saturday. Cincinnati grabbed the lead in the second when Suarez delivered an RBI single. Left field Skip Schumaker singled prior to Suarez and later scored from second on a throwing error by shortstop Segura to make it 2-0.Right fielder Jay Bruce singled and scored on Phillips' shard single to center, putting the Reds up 3-0 in the third.Milwaukee had runners on first and second with no outs in the fourth, but Reds starter John Lamb retired the next three batters to preserve the shutout. Lamb allowed six runs in 5 2/3 innings.The Brewers broke through in the fifth when Herrera, who played second base Saturday, doubled and scored on Segura's single to make it 3-1. But Bruce threw out Segura trying for a double.Suarez tied a career-high with his third hit, an RBI single in the fifth to put Cincinnati ahead 5-1. That ended the afternoon for Garza, who allowed five runs (four earned) and seven hits along with four walks in 4 2/3 innings.Milwaukee took Garza off the hook by scoring five times in the sixth, highlighted by pinch-hitter Adam Lind's two-run double to center. Lind scored on Segura's single to put the Brewers ahead for the first time 6-5. With the score tied 6-6 in the eighth, Herrera launched a 407-foot solo shot on Hoover's first pitch to put Milwaukee ahead to stay. It was his sixth homer this season. NOTES: It is the first time the Brewers and Reds have played a doubleheader. Milwaukee's last twin bill came on July 30, 2014 at Wrigley Field. It was the third doubleheader this season for Cincinnati, resulting from five weather postponements. ... The Reds will face teams currently holding postseason spots in 20 of their last 29 games. ... Cincinnati OFs Billy Hamilton (Double-A Pensacola) and Brennan Boesch (Triple-A Louisville) began three-day rehab assignments on Saturday. ... Brewers C Jonathan Lucroy went 0-for-5 to halt his career-high 11-game hitting streak.", "source": "WDSU New Orleans"}