{"published": "2015-09-09T01:00:00Z", "media-type": "News", "title": "Steve Smith says 2013-14 Ashes heroics will be fondest Brad Haddin memory", "id": "18b12585-59ac-4a03-9962-729a5f70864e", "content": "New Australia captain Steve Smith will look back on the 2013-14 Ashes series as the greatest example of Brad Haddin's positive impact on the Australian team. New Australia captain Steve Smith will look back on the 2013-14 Ashes series as the clearest and greatest example of Brad Haddin's positive impact on the Australian team. When Smith made his first-class debut in early 2008 for NSW their gloveman was Haddin. Later that year he succeeded Adam Gilchrist in the Test team, a role current coach Darren Lehmann said he handled deftly despite the lofty expectations.\n\nSmith, 26, said the now-retired Haddin had been a \"great mentor\" for him at state level, and had been even better when he progressed to the national team where Haddin was entrenched as first-choice wicketkeeper.\n\n\"In the Australian set-up as well he was always took me under his wing and helped me develop as a player and as a person. I'm very thankful for that,\" Smith said in Manchester on Tuesday evening, after learning of Haddin's announcement.\n\nSmith marvelled at Haddin for making 493 runs at an average of 61.63 to, with Mitch Johnson, spearhead Australia's successful bid to regain the Ashes at home in 2013-14.\n\n\"The [2013-14] home Ashes, where we won 5-0, he was a massive part of that. I think he scored [at least] 50 in the first innings in all five of those Test matches,\" he said.\n\n\"Batting at No.7, I think he really came out and played positively. I think there were a lot of [instances] where he got us back into the game, just from sheer [will] and taking the game on. He was magnificent at that, and I think a lot of keepers around the world can learn from the way he played.\"\n\nSmith also hailed Haddin as \"certainly one of the best team men I've ever been around ... always put the team first in every aspect\".\n\nCoach Lehmann, who first played against Haddin almost 15 years ago when the wicketkeeper was just 22, said Haddin was not only a fantastic player but also \"a fantastic mentor for a lot of young players [and] a great mentor for me as coach\".\n\n\"He's a fantastic human being and he'll be welcome in our change rooms all the time, because he's an absolute superstar,\" said Lehmann, who was part of the selection panel that excluded Haddin for the second half of the just-completed Ashes series.\n\n\"He made some crucial runs for us in Ashes series, and in different series all round in all formats. For us, his keeping was exceptional, his batting was very good. It was a case of him being able to turn a game very quickly for you. That's what [Adam] Gilchrist did exceptionally well as well.\"\n\nLehmann said Haddin would leave a vast and diverse legacy: \"The baggy green, the way he wore it with pride. The way he helped younger players. The way he helped drive the team as a whole. The way he helped coaches. The way he helped mould the team. The way we play today is an exceptional legacy for him. The way he thought about his family and helped his family through difficult times, and the way he helps other people's family and friends,\" he said. The story first appeared on The Sydney Morning Herald.", "source": "Yass Tribune"}