{"published": "2015-09-23T10:55:24Z", "media-type": "News", "title": "The Death of the University Lecture", "id": "838e02ec-2341-4880-87be-75ebccbc2264", "content": "Methods of studying for students have changed very little for many years - though The Internet  has given us access to a wealth of unfiltered information, traditionally the university experience has revolved around sitting in lectures, sitting in the library, cramming revision in, re-writing notes and highlighting textbooks. \n\nWhen revising for exams, 80% of students choose these passive methods of studying . They are simply accepted as the best way to learn and until now, this way of thinking has been allowed to go unchallenged. \n\nHowever, over the last couple of decades, more and more research has been conducted into how we learn, how the brain retains knowledge, and the best ways to enhance it. These studies clearly show that we retain information and improve our memory more effectively when using shorter 'training' sessions of as little as five to 10 minutes at a time . Students who used active methods such as spaced repetition and participatory revision techniques achieved a 50% increase in exam performance compared to those who studied with passive methods. \n\nThe term 'spaced repetition' describes a learning technique that revolves around the spacing effect. This is a phenomenon observed in educational psychology where people find it easier to remember something when they are studied a few times spaced out over a period of time Presenting the topic to be learned in an active, rather than passive, way - for example, in short quizzes or tests - makes the process more memorable than simply reading a passage of text over and over again. \n\nOf course, there is a growing degree of scepticism in the media applied to techniques that claim to improve your learning ability. There is a growing pocket of tech companies too that are using 'brain science' as the foundation of their propositions - brain training apps and even games claim to improve information retention and brain functionality - but their methods tend to based on carefully selected, marketing-based research. \n\nHowever, the evidence for spaced repetition is based on much more solid foundations. There is plenty of compelling, peer-reviewed research from the fields of neuroscience and educational psychology telling us how the brain consolidates and stores knowledge. But current educational practice just isn't taking advantage of it, and students are still stuck using outdated and ineffective study methods. Students would be better off spacing their learning out over time to retain information more effectively, and engaging in participatory learning methods, since this stimulates the development of new neuronal pathways, enhances memory and allows students to recall information more effectively. \n\nThe problem is compounded by a higher education system which is failing many students, pushing them into years of crippling debt, with increasing numbers of students even resorting to off-license prescription drugs in an attempt to learn more in less time. So while students are under more pressure than ever to perform well at university, running the risk of wasting considerable time and money if they don't, it seems odd that they're still being encouraged to continue to study the old way. \n\nOnce the education sector catches on to the fact that there are better ways of learning than what we are told is the best, these passive methods could be phased out in the future - no more cramming and no more note taking. Subjects and revision could be done remotely from home. And - as far-fetched as it may seem - lectures could become extinct in years to come. \n\nBut the adoption of technology in the higher education system is often painfully slow and patchy - especially when compared to how fast it changes in other areas of our lives,. The UK education system is old-fashioned and outdated, and needs to change if we want our graduates to compete in the 21st century.. We need to introduce evidence-based technology into educational practice quickly to get the best out of these participatory learning methods. \n\nAt Synap , we are developing a platform that combines this research with AI (artificial intelligence) to use methods that give the best results when it comes to information retention and brain function, delivered in a highly personalised way. Our vision is to revolutionise the traditional education system, and deliver the Holy Grail of education: personalised, adaptive learning for all. \n\nSynap is currently raising investment on Crowdcube until September 3", "source": "Huffington Post UK"}