{"published": "2015-09-10T01:24:18Z", "media-type": "News", "title": "Private sector sees erosion of Nigeria’s goodwill on FX challenges", "id": "4964e1ab-6d93-4c8d-9f36-629bc4b6d63f", "content": "as LCCI advocates heavy infrastructure investment to boost productivity \n \nThe Organised Private Sector (OPS) says the goodwill Nigeria enjoyed at the inception of President Muhammadu Buhari’s administration is beginning to wane on back of foreign exchange challenges, which crimp businesses and the economy. \n \nThe OPS, however, said there had been positive developments such as improved power supply, aggressive war against terrorism and anti-corruption crusade. \n \nAt the third quarter press conference and economic review held on Wednesday in Lagos, Remi Bello, president, Lagos Chamber of Commerce and Industry (LCCI), said the monetary measures so far adopted were taking a huge toll on investors in the free trade zones, saying there was a risk of international isolation of Nigeria if current policies were not reversed. \n \nSo far, the CBN has taken a number of monetary measures to save the naira and the foreign reserves, which have been on the downward spiral. The apex bank has restricted use of export proceeds and importers of 41 items from accessing foreign exchange (FX) from the Nigerian markets. The bank has also tightened the FX procedures and set rules on domiciliary account to save the economy. \n \nBut the economy is now faced with a scenario where there is a much greater pressure to move funds out of the economy than bring funds into the economy, Bello said. \n \n“Round tripping of forex has continued to flourish because of the disparity in the exchange rate between the official and parallel market. \n \n“Small businesses have moved to neighbouring countries to effect transfers to their suppliers abroad. Many companies are on the brink of collapse because of failure to access FX for raw materials and other critical inputs. Even companies whose inputs are valid for FX also suffer the same fate,” the LCCI boss said. \n \nHe urged the president to intervene before further damage was done to the private sector and the economy, suggesting that the naira exchange rate should be allowed to reflect the fundamentals of the market. \n \n“A rate that market fundamentals cannot support would not be sustainable. We suggest the adoption of a market approach with a periodic intervention by the CBN as the capacity permits,” he suggested. \n \nHe said exporters should be allowed to have unfettered access to their proceeds, saying that the current policy regarding export proceeds was a disincentive. \n \nHe further pointed out that the apex bank should engage with relevant economic ministries in order to bring about coherence in the management of the Nigerian economy. \n \nSome of the problems the country faces relate to the problem of poor productivity, he said, urging the Federal Government to accelerate investment in infrastructure and build quality institutions for better productivity in the country. \n \nSource: Business Day", "source": "NewsNG.com"}