{"published": "2015-09-14T12:49:20Z", "media-type": "News", "title": "Kenney McCafferty Secures Multiple IRS Whistleblower Awards, Assists IRS In Collecting Over $48 Million", "id": "b55d46a9-9f75-4a7c-b2ca-681c3c21ba72", "content": "SOURCE Kenney & McCafferty, P.C.\n\nPHILADELPHIA \n\nK&M has represented tax whistleblowers for more than ten years, and has obtained numerous awards for its clients, including under the pre-2006 tax code where the payment of whistleblower awards was purely discretionary. With this recent round of successes, K&M has secured its place among the elite tax whistleblower law firms in the country. In comparison, the IRS paid a mere 11 whistleblower awards under the mandatory award provision through the Fiscal Year ended 2014. \n\nThe IRS Whistleblower Program, as amended in 2006, provides for mandatory, \"shall pay\" financial awards to whistleblowers whose information substantially contributes to the IRS's detection and recovery of $2 million \n\nK&M secured upper limit award percentages for all three clients, with one K&M client receiving the maximum 30% award percentage. A second K&M client received the second largest whistleblower award the IRS has paid to date. Each of the whistleblowers in these cases has chosen to remain anonymous. Whistleblower anonymity is a key protection afforded in most cases by the IRS Whistleblower Program.\n\n\"We have been fortunate to represent clients who not only possess substantial evidence supporting their allegations, but who are also resolute in their efforts to assist the IRS in halting these tax avoidance or tax fraud schemes,\" commented K&M's Kathryn Schilling \n\nCongress enacted the IRS Whistleblower Program as a means to incentivize integrity, and to encourage those who witness tax fraud to step forward and report it. Added Lambert, \"The Whistleblower Program advances a significant public interest by incentivizing private citizens to report tax fraud. Without whistleblowers, particularly insiders who possess first-hand knowledge of the tax scheme, to alert IRS agents to major tax fraud and to explain the particulars of the scheme, most tax underpayments go undetected.\" Deming supplemented, \"Tax fraud is rampant. As testament to that fact, the volume of inquiries from potential tax whistleblowers who possess compelling insider evidence of multi-million dollar tax avoidance schemes of all varieties and levels of complexity is as strong as ever. Tax schemes have become increasingly complex, and more skillfully disguised, rendering them impervious to IRS detection absent the cooperation and insights of an insider. In these times of economic uncertainty, government deficits, and a $450 billion \n\nAlthough criticism has beleaguered the IRS Whistleblower Program in the past, K&M lawyers foresee that recent developments suggest the logjam is beginning to loosen, paving a bright road ahead for the program. Brian McCafferty \n\nAbout Kenney & McCafferty, P.C.:\n\nKenney & McCafferty is a nationally recognized law firm that has specialized in whistleblower litigation for over a decade, with emphasis on bringing cases under the IRS and SEC whistleblower programs and the False Claims Act. The firm's attorneys and consulting expert, who is a former IRS agent, possess a depth and breadth of skills and expertise that equip the firm to handle even the most complex and demanding whistleblower cases. K&M has achieved exceptional results in whistleblower cases, including a sustained line of record-setting whistleblower settlements. In total, K&M has recovered more than $6.5 billion \n\nAdditional information about the firm is available at http://www.quitam-lawyer.com and http://www.tax-fraud.net. \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/kenney-mccafferty-secures-multiple-irs-whistleblower-awards-assists-irs-in-collecting-over-48-million-300141904.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "CW Richmond WUPV"}