{"published": "2015-09-10T06:01:00Z", "media-type": "News", "title": "Hezbollah voices hope that dialogue will end crisis during Rai meet", "id": "58d2847b-3cca-454d-a7f4-0173f9d51b11", "content": "Home News Article S\n\nSep 10 2015 10 September 2015\n\nBEIRUT: A Hezbollah delegation voices hopes after meeting Maronite Patriarch Beshara Rai Wednesday that ongoing dialogue would bring an end to Lebanon’s political crisis, reiterating its support for MP Michel Aoun’s presidential bid. “We tackled the importance of national work, especially dialogue, whether as a group or in pairs ... in the hope that dialogue will help cement a unifying national will and solve problems, whether political or those related to people’s socioeconomic needs,” said Sayyed Ibrahim Amin al-Sayyed, Hezbollah’s politbureau chief, after meeting with the patriarch.\n\nThe delegation also included Mahmoud Qmati, who is charged with managing relations with Christian groups in Lebanon, and party members Mustafa al-Hajj Ali and Bilal Lakkis. \n\nSayyed said that the visit was “within the framework of continued communication with his eminence [Rai] and [in light of] what’s happening in the region and its repercussions on Lebanon.”\n\nIn the meeting several issues were discussed, including the presidential deadlock, regional developments and the National Dialogue. \n\nSpeaker Nabih Berri launched dialogue sessions in Parliament Wednesday with the aim of ending the presidential vacuum, reviving Parliament and Cabinet’s work.\n\nSayyed stressed the importance of electing a president, and the need for the next president to be “qualified to become a main player in resolving national crises and [confronting] current challenges in the region.”\n\n“In our opinion, Gen. Michel Aoun is the figure who is qualified to play this role.”\n\nLebanon has been without a president since the term of Michel Sleiman ended in May 2014, leading to the paralysis of state institutions.\n\nAsked whether Rai voiced any reaction to Hezbollah’s support for Aoun during the meeting, Sayyed affirmed that although the party supported the candidacy of Aoun, they were not the group which proposed his nomination. “He is a presidential candidate and we support him as presidential candidate ... it is not true that Gen. Aoun does not want to be president of the republic and that we have convinced him to be president.” \n\n“It is true that the patriarch is insisting on the election of a president and this is his opinion, and we believe that this is possible given Gen. Aoun’s presidential candidacy.”\n\nSayyed dismissed claims that Hezbollah was now handling negotiations to secure the release of 25 Lebanese servicemen kidnapped by ISIS and the Nusra Front during a five-day battle in the northeastern town of Arsal in August 2014. \n\n“This file is in the hands of the state and will remain in the hands of the state,” he said.\n\n© Copyright The Daily Star 2015. © Copyright Zawya. All Rights Reserved.", "source": "Zawya.com"}