{"published": "2015-09-23T14:17:00Z", "media-type": "News", "title": "Tattered, torn and in fashion", "id": "7216fcb6-e24a-437b-b6f4-e39d94bd55ec", "content": "Long, ugly tan socks held up at the thigh with an elastic band that cut off circulation kept my legs warm during the cold Nebraska winters when I was a kid. Not only were they uncomfortable, they caused problems on other fronts, especially when the elastic band slipped and the socks fell down around my ankles or worse yet, when a desperate rush for bathroom visit was called for because I played too long and the bulk of the socks got in the way of the job. \n\nThose miserable socks were part of my wardrobe until mid-adolescence when my mother finally bought me a pair of cotton slacks, Jeans didn’t enter the picture until I was in junior high, and then only to be worn on cold winter days. \n\nI still recall the sick feeling I had when I caught my new jeans on a barbed wire fence and tore a hole in the knee. Those were my jeans for the year, and I didn’t get another pair until the following fall. \n \nEven so, I didn’t wear those torn jeans after mother mended them. To have done so would have been socially degrading. It would have been as bad as today’s adolescent admitting he didn‘t understand social media. \n\nI didn’t wear my torn or even mended jeans because it was a sign that we may have been poor. Never mind that I had no idea what that meant in a small school where everybody was neither rich nor poor, just part of being. \n\nA few years ago a close friend told me she loves being around her teenage granddaughter, but she can’t help commenting on her torn jeans and sweatshirts with torn necklines and drooping cuffs. \n \n“I want to stand there and shout,” ‘Hey, she has a closet full of nice clothes. Her parents have good jobs. She doesn’t have to look like this’.” \n\nNow, the more torn, ripped, tattered looking, the more affluent appears the wearer. The look isn’t just reserved for the young. Today, the ragged edges, the holes in the seat, tears in the knees know no age, They are worn by the toddlers, adolescents, on dates, at social affairs, by celebrants and the elderly. \n\nWell, maybe not the elderly. Most likely they just haven’t taken the time to get rid of them. \n\nOne thing is for certain. I bet you won’t ever catch any of them wearing ugly long cotton socks with elastic bands holding them up. But then, one never can be sure.", "source": "Hastings Tribune"}