{"published": "2015-09-12T06:25:21Z", "media-type": "News", "title": "Johnny Depp would 'assault' Barnaby Joyce if Amber Heard is jailed after dogs fracas", "id": "dca82e33-3d53-4023-967f-3d181be9a994", "content": "Johnny Depp says he may have \"smuggled other things\" into Australia during his dogs' quarantine drama. \n\nJohnny Depp​ says if his wife Amber Heard is jailed over their dogs' quarantine fracas, he would \"assault\" Barnaby Joyce.\n\nSpeaking to TV host Jimmy Kimmel on Jimmy Kimmel Live, Depp said this would allow him to join Heard, his wife, in prison.\n\n\"I'd just fly to Australia and assault that man,\" he says. \"So that I could go to jail.\"\n\nHeard has been ordered to face a Gold Coast court on November 2 on charges of illegally bringing Pistol and Boo into Australia in May. She could face up to 10 years jail time and a fine of $100,000 if found guilty.\n\nDepp, who was in the country filming Pirates of the Caribbean, has not been charged.\n\nAsked if he had \"smuggled\" the pair's dogs, Pistol and Boo, into Australia in May, Depp said he and Heard were under the impression they \"had all the paperwork done for the dogs\".\n\n\"We were there with the dogs in front of everybody,\" he says.\"There might have been other things smuggled. Well they seemed to miss that bit. Might have been. Could have been.\"\n\nThe feud between the Pirates of the Caribbean star and the Abbott government minister, which sparked international furore and became known as \"The War on Terrier\", began after the two Yorkshire Terriers arrived in Australia via private jet.\n\nJoyce said Depp would have to take his dogs back home, because they breached biosecurity laws, \"or we're going to have to euthanise them.\"\n\nKimmel showed a clip of Agriculture Minister Barnaby Joyce making the threat during a doorstop interview at Parliament House.\n\n\"What kind of a maniac is this?\" Kimmel says. \"He's going to kill your dogs if you don't send them back to California.\"\n\nDepp nods placatingly.\n\n\"You know, maybe, maybe, he's just doing his job,\" he says. \"You know this, sort of, weird, sweaty-pated gut man man who decided that two five-, six-inch Teacup Yorkshire terriers would harm the country in some way.\n\n\"'He's got a point. Especially when you consider that Australia has the most poisonous creatures on earth. Everything will kill you in minutes.\" \n\nSpeaking about the incident during a press conference at the Venice Film Festival on September 4, Depp joked: \"I killed my dogs and ate them, under direct orders of some kind of, I don't know, sweaty, big-gutted man from Australia.\" The story first appeared on The Sydney Morning Herald.", "source": "Western Magazine"}