{"published": "2015-09-16T21:23:39Z", "media-type": "Blog", "title": "Improved Gareon Conley leaves no safe place to throw against Ohio State", "id": "34c6744e-0d0e-445e-b39c-e842d4bdd2ee", "content": "0 Shares Print COLUMBUS, Ohio — Gareon Conley couldn’t shake the memory, and that was the problem. With the Ohio State cornerback dwelling on one mistake, suddenly he was making more of them, adding even more negative thoughts in his head and leaving the coaching staff no choice but to send him to the bench. Conley clearly wasn’t ready mentally for the pressure that came with being forced into the starting lineup late last season, and it didn’t take long for Michigan State to figure that out and focus its attention on him early, often and with plenty of success last November. Nearly a year later, opponents are still likely to target Conley given how many elite players surround him for the top-ranked Buckeyes, but it’s quickly becoming clear that he’s no longer somebody to pick on and is poised to become yet another defensive bully. Gareon Conley called his first career interception last week and the celebration that followed ‘the best feeling ever.’ Jason Mowry/Icon Sportswire“Last year I was a thinker,” Conley said. “I thought a lot about making mistakes and worrying about what-if this, what-if that. Now I just play to my ability and I know that my coaches and my teammates are confident in me. “I felt down in the dumps [at Michigan State], and I know I can’t get that play back, but I just kept thinking about it over and over again. That led to more bad plays. I’m probably going to have more bad plays because nobody is perfect, I just know now after every bad play you have to snap and clear, play the next play.” The same principle applies to the positive plays, too, and so far that’s pretty much been the only test for Conley’s new and improved mental approach this season. Firmly entrenched as the starter opposite Eli Apple instead of just merely filling in for him due to injury, Conley is making it less and less appealing to test his side of the field as he develops into the shutdown cornerback Ohio State anticipated when it signed him in 2013. And while Apple and the presence of playmakers Tyvis Powell and Vonn Bell at safety will still make Conley seem like the safest place for opposing quarterbacks to try to attack, the early returns suggest it’s every bit as dangerous. … Continue Reading: Improved Gareon Conley leaves no safe place to throw against Ohio State", "source": "BucksInsider.com - Ohio State Buckeyes News, Videos, Schedules"}