{"published": "2015-09-03T05:12:57Z", "media-type": "News", "title": "Floyd Mayweather ready to hang up gloves as 'the best ever'", "id": "d71d2b6a-51c6-4f57-8c1e-c34144a8eef1", "content": "Floyd Mayweather Jr. plans to go out unbeaten and on his own terms, as 'The Best Ever', when he ends his boxing career in Las Vegas next week with his welterweight title defence against fellow American Andre Berto. \n\nShould Mayweather win, as is widely expected, he would match the 49-0 record of former heavyweight great Rocky Marciano but says he would not be tempted to come out of retirement for a 50th fight. \n\nImage Credit: . \n\r \n\"Forty-nine is my last fight,\" the five-division world champion, aged 38, told reporters on a conference call on Wednesday before saying that self-preservation in the ring had always been a top priority. \n\n\"My health is more important. Anything can happen (in boxing). I am not really worried about losing. You can make a lot of money but you still won't be able to talk, walk and have a sharp mind. \n\n\"Of course, it's always about self-preservation. I come first but I appreciate the fans. I do. The only thing I can do is believe in myself. I'm going to be TBE (The Best Ever) until the day I die.\" \n\nMany pundits have doubted Mayweather's claim that he will end his career after the Sept. 12 bout, pointing to the American's U-turn when he came back from a 21-month retirement to fight Mexican Juan Manuel Marquez in September 2009. \n\n\"Like I have said and Floyd has said a number of times, this will be his last fight,\" Leonard Ellerbe, CEO of Mayweather Promotions, said on Wednesday's conference call. \n\n\"Why can't a man go out when he has had an illustrious career, accomplished everything that he needed to accomplish and be done? And he has done it his way. \n\n\"Over the last week, I have received three major movie offers. We fully expect Floyd to be heavily, heavily involved in the entertainment industry because this is what he does right now ... that is going to occupy a lot of his time.\" \n\nMayweather, whose 48-0 record includes 26 knockouts, is renowned for his brilliant defence in the ring though he has often been criticized for selecting easy opponents while building his impressive resume. \n\nAsked what he regarded as the greatest achievement of his career, he replied: \"Every fight played a major key ... and number 49 is going to be important also. But my career's not over yet.\" \n\nBerto, a twice former welterweight world champion, will step into the ring as a heavy underdog after losing three of his last six fights but Mayweather is wary of underestimating his opponent. \n\n\"When you've got a guy that's put in a situation with nothing to lose, it makes him work that much harder,\" said Mayweather. \"He has a chance to be one of the top guys in the sport when I am through. You never overlook anyone.\" \n\r\n           \t\r\n\r\n\r\n\r \r \r \r\n\r  More from this Section", "source": "IBN Khabar"}