{"published": "2015-09-29T12:47:09Z", "media-type": "News", "title": "Overkill for Little Max's Leash Law Violations", "id": "6644f2de-0619-42ba-8a5a-5c1ca2a7783e", "content": "By BRITAIN EAKIN  \n \nALEXANDRIA, Va. (CN) - Virginia sheriff's officers stormed the home of a severely disabled man, knocked him down and seized his 18-lb. service dog at gunpoint - for leash law violations, the man claims in court. \n     In addition to prostate cancer and degenerative bone disease, William Selepack has gone through hip and shoulder replacement surgeries, removal of his large intestine, removal of several spinal discs, and septum reconstruction. He has balance problems, \"extremely low manual dexterity,\" short- and long-term memory loss and dementia, according to his Sept. 24 lawsuit in Federal Court. \n     Selepack has a doctor's note stating that his disabilities preclude him from using a leash, or from lifting more than 10 pounds. \"Even the slightest tug of a leash would be sufficient to unbalance Mr. Selepack, causing him to fall, or to pull Mr. Selepack to the ground,\" the complaint states. A leash would also create a tripping hazard. \n     But around 9 p.m. on Oct. 1, 2013, five officers with the sheriff's Rapid Response Unit barged into Selepack's home with guns drawn and threw him onto the stairs. \n     \"When Mr. Selepack tried to stand up, he was thrown onto the stairs a second time,\" the complaint states. Officers held him at gunpoint while they searched for and seized Max. \n     Max has been in custody of Loudoun County Animal Control since he was seized, and the county refuses to let Selepack visit him, according to the complaint. Since the county seized Max, Selepack has fallen several times and bruised and broken ribs. One time he lay in the cold for hours because he couldn't get help. He has wandered into traffic, spent hours riding the Metro aimlessly and has gone outside improperly dressed looking for Max. \n     Selepack had had previous run-ins with Animal Control because he did not keep Max on a leash, but controlled him with voice commands. But Loudoun County allows no exceptions to its leash law, which raises its seizure of Max and excessive and unreasonable force against Selepack to constitutional violations, according to the complaint. As a service dog, Max should be exempt from leash laws under the Virginians With Disabilities Act and the Americans With Disabilities Act. \n     Selepack offered documentation of his disabilities to Animal Control, to no avail. In September 2013, a Loudoun County judge found Max a \"public nuisance,\" and ordered him seized, though Max had been trained as a service dog, graduated from obedience school and had no behavioral issues, according to the complaint. Selepack got him in 2005, when Max was 8 weeks old. \n     He sued Loudoun County and three of its Animal Control officers. He names but did not sue five members of the Loudon County Sheriff's Rapid Response Unit who allegedly stormed his house to seize his miniature Doberman Pinscher, Max. \n     Miniature Dobermans are feisty, intelligent little fellows, generally no bigger than a miniature poodle. \n     Selepack's attorney says it's unclear why Animal Control felt it needed the sheriff's help to seize Max. He says Animal Control's response to a FOIA request did not disclose any policies outlining when it would call in the sheriff to execute a search warrant. \n     The sheriff's office did not respond to a request for comment. Nor did Selepack's attorney, Joshua Erlich. \n     Selepack seeks declaratory judgment and punitive damages for illegal search and seizure, excessive force, violations of state and federal disabilities laws, illegal taking, other civil rights violations, and failure to train and supervise. He also wants the county's leash law, or its interpretation of the leash law, enjoined, and attorney's fees and costs of suit. ", "source": "Courthouse News Service"}