{"published": "2015-09-24T07:51:39Z", "media-type": "News", "title": "Siblings burnt in Osogbo petrol station fire disaster", "id": "5650b2dd-549a-4783-bf23-5371aba8d977", "content": "Osogbo - An outbreak at 'Bovas' petrol station in Osogbo on Wednesday caused pandemonium as two children of the same mother were burnt to death. \n\nAn eyewitness who spoke on condition of anonymity disclosed that the victims were children of the owner of the station located in front of Osogbo Grammar School. \n\nHe said that the mother of the children also suffered burns in the process of trying to rescue her children. \n\nThe Director of the state Fire Service, Michael Ogundipe, who confirmed the incident while speaking with journalists said that two lives were lost in the fire and that the cause of the fire had yet to be determined. \n\n“We responded immediately we were called and sent two vehicles. We have equipment but there was congestion on the road which slowed down our movement. \n\nAlso read: \n\n“We met the fire burning and observed that the construction of the building did not follow the guideline. \n\n“There was no exit route. No fire extinguisher was there. They would have been able to battle the fire if they had extinguishers,” he said. \n\nThe director said that the remains of the children had been deposited at the Ladoke Akintola University of Technology morgue while their mother was also receiving treatment at the same hospital. \n\nSome other eyewitnesses said the woman and her three children were inside the mini market attached to the filling station when the fire started, adding that she succeeded in rescuing one of the children. \n\nFire-fighters were still battling to put off the fire which also destroyed a Toyota Corolla car as at the time of filing this report. \n\nSome sympathisers who spoke to correspondents at the scene described the owner of the station was one of the most honest petroleum marketers in the state. \n\nThey called on security agencies to conduct proper investigation to know the cause of the fire.", "source": "News24"}