{"published": "2015-09-28T19:42:21Z", "media-type": "News", "title": "High Tech Pearls Are Captivating the Younger Jewelry Consumer", "id": "42d00ff5-c8f7-4899-ab8f-cb9cbb0a26f3", "content": "( NewsUSA ) - Pearls are the perfect, malleable medium for today's ever-changing fashions. But don't mistake some of today's modern pearls with Grandmother's simple strands. Add a little tech, color and carvings, and you take that classic right into the 21st century. Yes, it's true: Today's pearls are appealing to a new generation that is discovering their beauty and luster while enjoying some amazing new characteristics. \n  \nThink pearls can't be high tech? Think again! One designer in California, Chi Huynh of Galatea Jewelry by Artist, is known for creating numerous variations on the cultured pearl. His latest invention (patent pending) is called the Momento Pearl. To make it, Huynh inserted a tiny NFC chip into a cultured pearl. When you use it in combination with the company's proprietary Galatea App, you can upload voice and text messages, images and web links. Simply tap the pearl against an Android phone to hear the voice message and see what you've uploaded. \n \nHow about a little color in your pearl? Huynh has also patented a cultured pearl with a colored stone bead inside. When the pearl exterior or nacre (pronounced \"nay-ker\") is carved, the color is revealed. Described as one of the greatest developments in pearl culturing since Kokichi Mikimoto invented the process in the early 1920s, the \"Galatea Pearl\" is one of the rarest pearls in the world. They are available as pendants, earrings and rings in 14k gold. \n \nWhy not carve pearls like marble to make miniature sculptures? Hand-carving pearls have always been a hallmark of Huynh's Galatea jewelry designs. More than 75 percent of the company's jewelry use carved pearls rather than the more traditional smooth-surfaced pearls. Normally, pearls are valued for their color, luster (the \"shine\" on its exterior), uniform and blemish-free surface. Huynh revolutionized traditional beliefs about cultured pearls, calling his carved pearls, \"Pearls without Boundaries.\" They may not be for pearl traditionalists, but that's what makes them so appealing to a younger audience. \n \nAnd speaking of that younger audience, the company's \"King Pearls\" are large, dark Tahitian pearls with unique carvings depicting dragons, dolphins, crosses and other modern designs. \n \nAll in all -- with pearls on center stage with fashionistas -- pearls are a jewelry mainstay whose time it is to break out of the box. And Galatea is just one company that has proven this to be true. \n \nFor more information, please visit www.galateausa.com .", "source": "Bedford Times-Mail"}