{"published": "2015-09-23T03:46:26Z", "media-type": "News", "title": "Happy Birthday To Us All Judge Rules Tune Is Public Domain", "id": "2e27d7ed-aa79-4a6d-a664-a1ea4241fd09", "content": "No more sitcom characters standing around a cake, singing “For He’s a Jolly Good Fellow.” No more Applebee’s servers clapping along to “Happy happy birthday, from Applebee’s to you!” \n\nWell, they can if they want, but not because they’d have to pay the copyright holders of the popular “Happy Birthday To You” song. A federal judge in Los Angeles has ruled that Warner/Chappell Music’s claim to the rights, which earned them an estimated $2 million dollars a year, is not valid. \n\nWarner had been collecting royalties on the song since the 1980s when it bought Birch Tree Group, the successor to Clayton F. Summy Co., which claimed the original copyright. \n\nAccording to the Los Angeles Times: \n\nJudge George H. King ruled Tuesday afternoon that a copyright filed by the Summy Co. in 1935 granted only the rights to specific arrangements of the music, not the actual song itself. \n\n“Because Summy Co. never acquired the rights to the Happy Birthday lyrics,” wrote King. “Defendants, as Summy Co.’s purported successors-in-interest, do not own a valid copyright in the Happy Birthday lyrics.” \n\nTo arrive at his decision, the judge considered a 1922 songbook which features a version of the birthday song called “Good Morning and Birthday Song,” written by sisters Mildred and Patty Hill. That iteration of the tune includes the familiar “happy birthday to you” lyrics and is listed as appearing through “special permission” of the Summy Company with no mention of a copyright. \n\nThe lawsuit was filed against Warner by two filmmakers making a documentary about the song’s origins. The publisher charged $1,500 to use it. \n\nClick here to read full story »", "source": "997WTN.com"}