{"published": "2015-09-27T13:51:01Z", "media-type": "News", "title": "TV Guide, Sunday, 27 September 2015", "id": "3e056bac-d3bb-44d2-85c5-4c771821b07e", "content": "Be sure to catch these on TV tonight: \n \nIdols SA \n Mzansi Magic (DSTV channel 161) 17:00 \nSouth Africa’s biggest reality show, Idols, is back for season 11. Idols judges Randall, Gareth, Unathi and Somizi along with host Proverb start for the search for the next Idol. Who will it be? \n \nSA’s Got Talent \n eTV (DSTV channel 194) 18:05 \nA country-wide talent search for South Africa’s next biggest talent. Any act, of any age, is allowed to enter, including singers dancers, comedians, variety acts and more. \n \nOur Perfect Wedding \nMzansi Magic (DSTV channel 161) 19:00 \n Millicent & Lucas.  Millicent and Lucas met at a wedding in 2013. With nine children between the two of them, this couple shows us how they make this work. \n \n \nDevious Maids \n Vuzu  Amp (DSTV channel 114) 20:00 \n Suspicion.  Marisol believes Taylor is hiding something about the murders; Ernesto sets a plan into motion that could have dangerous consequences for Rosie; Zoila struggles to adapt to a big change in her job; Adrian’s past actions come back to threaten his happy family. \n \n \nDate My Family \n Mzansi Magic (DSTV channel 161) 20:00 \n The show helps singles find love by sending them on dates with their potential partner’s family. \n \nInterface \n SABC 2 (DSTV channel 192) 20:30 \nHosted by Tembisa Marele. This interactive discussion programme focuses on current affairs of the week. Guests will be invite d according to the issue discussed. It aims to allow people of SA a platform to view their opinions. Topics range from sports to news. \n \nFriday (1995) \n MNet Movies Comedy (DSTV channel 104) 21:40 \nStarring Ice Cube & Chris Tucker.  It’s Friday and Craig Jones has just gotten fired for stealing cardboard boxes. To make matters worse, rent is due, he hates his overbearing girlfriend and his best friend, Smokey, owes the local drug dealer money – and that’s all before lunch. \n \nWhy Do Fools Fall In Love (1998) \n MNet Movies Romance (DSTVchannel 107)  21:50 \nStarring Halle Berry & Vivica A. Fox. The former lead singer of a popular band overdoses and  leaves behind thre e women, and each believes she’s owed his song royalties: Platters singer Zola Taylor, prostitute Elizabeth Waters and schoolteacher Emira Eagle.", "source": "Drum"}