{"published": "2015-09-03T21:13:03Z", "media-type": "News", "title": "Wales move a step closer to Euro 2016 thanks to Gareth Bale's winner in Cyprus", "id": "e7434825-7d5b-4cd2-a4fc-055b5b0a283b", "content": "Wales are poised to end their 58-year wait to play at a major tournament after Gareth Bale's late winner on a balmy night in Nicosia. \n \nBale struck eight minutes from time - his sixth goal in seven games in Euro 2016 qualifying - when he met Jazz Richards' cross with a thumping header to give Cyprus goalkeeper Antonis Georgallides no chance. \n \nThe 1-0 triumph puts Wales within touching distance of a place at next summer's European Championship in France - a feat that would be confirmed by beating Israel in Cardiff on Sunday night. \n \nBut in warm conditions and on a difficult hard surface, it was anything but easy for Wales, who had to grind out a victory as precious as any in recent times. \n \nWales started the day in buoyant mood, having moved above England in the FIFA rankings for the first time in their history; they ended it by completing their best ever run in competitive fixtures without defeat - nine games. \n \nBoth sides carried moments of danger in a high-energy start, but it was Wales who had the first opportunity when Bale drew defenders for Aaron Ramsey to fire just over the crossbar from 18 yards. \n \nWales were even closer to taking the lead after 10 minutes when Georgallides made a hash of Bale's 30-yard free-kick before redeeming himself by blocking Neil Taylor's follow-up effort. \n \nThere were Cypriot howls for a penalty when Nestoras Mitidis tumbled in the box under Ashley Williams' challenge and the Wales captain was in the right place to cut out a near-post cross as the hosts threatened. \n \nBale had uncharacteristically been guilty of a couple of misplaced passes but he sprang to life after 27 minutes when he toyed with a couple of defenders before crossing from the right. \n \nEdwards met it to head home, but Polish referee Szymon Marciniak had spotted a push on a Cyprus defender with Hal Robson-Kanu, perhaps harshly, judged to be the guilty man. \n   Promoted stories   \nThe incident, however, sparked Bale into life and a clever interchange with Robson-Kanu presented an opportunity for the Real Madrid forward to bear down on the home goal. \n \nBale looked as if he had got away until a terrific sliding intervention from Constantinos Laifis stopped him in his tracks. \n \nWales breathed a sigh of relief five minutes before the break when Constaninos Charalambidis' free-kick picked out Andreas Makris, but his rising drive cleared the bar by some distance. \n \nThe visitors needed to establish their authority on the contest but Cyprus almost took advantage when the visitors again coughed up possession straight after the re-start. \n \nMarios Nicolaou took aim from 25 yards and Wayne Hennessey could only shovel the ball out in front of him for the outstanding Williams to clear. \n \nBale was dropping deeper in a bid to influence proceedings and he slipped through Robson-Kanu who tried to round Georgallides, but the goalkeeper was off his line quickly and got a vital touch on the ball. \n \nWales were desperately in need of inspiration and it came after Georgallides had batted away Ramsey's close-range efffort after Taylor had made inroads down the left. \n   \n Share article  \n   \nThis time it was the right-sided wing-back Richards who was the provider and Bale lost his marker to power home his 18th goal for his country. \n \nHennessey saved from substitute Pieros Sotiriou at the death, but Wales had done enough to take another massive step on the road to France.", "source": "Borehamwood Times"}