{"published": "2015-09-02T04:00:00Z", "media-type": "Blog", "title": "Toddler Tips: The Foundation", "id": "ed73f466-0c6c-48f9-ba20-0c73694533b6", "content": "Before I begin with some toddler tips I want to start out with sharing five things I have found that serve as the foundation to having happy, settled toddlers each day-I have noticed that if I keep each of these things in mind, we (my toddlers and I!) can have the best shot at enjoying these years.  (I think these could be applied to all stages of development but never is it more important than in toddlerhood.)\n1. Routine\n2. Food and Sleep\n3. Consistency\n4. Attention\n5. Expectation\nRoutine-Toddlers crave routine, they need it, and we need it also.  The world is so big for them and they are really at our beck and call, completely relying on us to form their days, but torn because they also wish to be more independent.  A routine allows them to stretch their independent spirit in little ways throughout the day, but also feel safe and secure.  If a routine to the day is in place, when life calls us off of it, most toddlers, if they have the base of routine to begin with, can cope with this change.  But only to a point-we all know this if we've taken vacations, or have had visitors in the house, or a new baby, etc. Toddlers can only take so much, and they will rebel. They crave that routine back!\nFood and Sleep- \"Never let them get tired and never let them get hungry.\" I am going to link to this very short article from a very experienced mother, that says it all.\nConsistency-This might seem like a repeat of number one, but they are different and compliment each other in many ways.  Oh, how consistency with toddlers makes OUR lives easier.   I can sum it up: Do the same thing almost all the time-react the same way-don't say no once, and then say yes the next, etc.  Some toddlers are very sensitive to this (they want the same plate at lunch, they notice every little thing), some are more flexible and easy-going, but consistency cultivates a certain calmness and predictability.\nAttention-Children want, need and crave attention, REAL, reliable attention, from their parents. I feel like they have an inner measuring device for this-when they need more, they will find a way to get it,and that is when those toddler behaviors can rear their ugly heads! And no substitute for parental attention is sufficient. We must find the time in our day to be quiet with them, to listen to them, or to play with them, or engage them in a new activity. If we moms are busy with other little children or a new baby, please know that often our presence in a room with them is enough sometimes-knowing we are there and available, and interested in what they are doing is enough.\nExpectation-We must teach proper behavior every day-but we must not expect too much out of toddlers. We can not drag them through days of errands and high stimulation activities and not expect backlash.  We can not expect them to sit still in a room full of interesting things and hear one thousands no's.  There is nothing wrong with a no, and a firm voice with strong direction, but their learning spirit that requires movement and touch should not be constantly oppressed.", "source": "Clover Lane"}