{"published": "2015-09-16T14:05:00Z", "media-type": "News", "title": "CCA Bahamas Ltd. Comments On Memorandum Regarding Motions To Dismiss Baha Mar Chapter 11 Cases", "id": "10a666de-bfc0-47a1-b198-6a7addd8675a", "content": "NASSAU, Bahamas , Sept. 16, 2015 /PRNewswire/ -- CCA Bahamas Ltd. (CCA Bahamas), a wholly owned indirect subsidiary of China State Construction Engineering Corporation Limited (CSCEC) and the construction manager/general contractor for the $3.5 billion Baha Mar resort project, today issued the following statement in response to The United States Bankruptcy Court for the District of Delaware's memorandum regarding motions to dismiss Baha Mar Ltd.'s Chapter 11 cases. \n\n\"CCA Bahamas welcomes Judge Kevin Carey's ruling to dismiss the vast majority of Baha Mar Ltd.'s Chapter 11 cases and supports the Court's decision that issues concerning the Baha Mar Resort Project are best resolved within The Bahamas . This decision protects the interests of all principal stakeholders and provides greatest certainty to the future of the Baha Mar Resort. \n   \n\"CCA Bahamas remains committed to working with the Provisional Liquidators appointed by The Bahamian Supreme Court as this process moves forward. We possess unique expertise and understanding of the project, and we stand ready, willing and able to re-mobilize the appropriate resources to complete the Baha Mar Resort as soon as possible.\" \n\nEstablished in 1985, China Construction America (CCA) is the North American and South American subsidiary of CSCEC. CSCEC is a public company listed on the Shanghai Stock Exchange with a total market capitalization of $48 billion as of June 2015 . Ranked 37th among Fortune Global 500 companies in 2015 and no. 1 on the ENR Global Contractors list in 2014,  CSCEC is unrivaled by any other construction company in the world. \n\nCCA Bahamas is a wholly owned indirect subsidiary of CSCEC with founding principles of integrity and innovation with quality assurance and value creation.  With revenue of approximately $2 billion in 2014, CCA is ranked no. 32 top contractor in the US. In accordance with its core values, CCA is committed to creating value for all stakeholders and building a better Bahamas and a better world. \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/cca-bahamas-ltd-comments-on-memorandum-regarding-motions-to-dismiss-baha-mar-chapter-11-cases-300144109.html \n\nSOURCE  CCA Bahamas Ltd.", "source": "U-T San Diego"}