{"published": "2015-09-07T08:27:16Z", "media-type": "News", "title": "Glencore surges lifts FTSE following debt cut plan", "id": "99a20e9b-2c51-4998-b877-50e1e9582c7c", "content": "A man walks past the London Stock Exchange in the City of London October 11, 2013. REUTERS/Stefan Wermuth  \nBy Alistair Smout \n\nLONDON (Reuters) - Britain's top share index rose on Monday, led higher by Glencore after the mining and commodities trading firm announced a plan to cut billions of dollars in debt in the face of weakening metals prices. \n\nGlencore rose 11.8 percent after it said it will suspend dividends, sell assets and raise $2.5 billion (1.65 billion pounds) in a new share issue as it aims to cut its debt by a third to $20 billion by the end of next year. \n\nThe firm was set for its biggest one-day gain ever, having hit an all-time low in the previous session. Glencore's share price has suffered as the price of copper and coal has slid to more than six-year lows, but brokers welcomed the move. \n\n\"This significantly improves the balance sheet of the company (and) it comfortably places Glencore in investment grade territory by rating agencies under most commodity scenarios,\" analysts at Citi wrote in a note. \n\n\"(It) gives the company flexibility to weather any downcycle and is likely to remove the markets concern on the downside.\" \n\nGlencore was upgraded to \"neutral\" from \"underperform\" by Bank of America/Merill Lynch following the announcement of the plan. \n\nOther miners also rallied, with Antogafasta up 7 percent, Anglo American up 2.1 percent and BHP Billiton up 1.7 percent. \n\nIn all, the mining sector rose 3 percent, with the price of copper supported as China's top state planner said that some key economic indicators were improving. \n\nTraders were wary ahead of a deluge of Chinese economic data following a two day market holiday at the end of last week, with a U.S. holiday on Monday expected to keep volumes low. \n\nThe British FTSE 100 was up 56.73 points, or 0.9 percent, at 6,099.65 points by 0800 GMT, rallying after a 2.4 percent fall on Friday. \n\nThe index remains 14.4 percent below a record high hit in April. It has been hit in recent weeks by escalating concerns over the strength of China's economy. \n\nOne of only seven fallers on the index, Associated British Foods dropped 2.4 percent after a corporate update. \n\nAlthough it maintained its full-year earnings forecast on Monday, as progress at budget retailer Primark helped to offset declines in its sugar unit, it said the strengthening pound would hit its results by more than previously expected. \n\n(Reporting by Alistair Smout; Editing by Toby Chopra)", "source": "Yahoo! News Australia"}