{"published": "2015-09-27T12:30:50Z", "media-type": "Blog", "title": "Pochettino: 'This' Is How Spurs Want To Play", "id": "e560f764-6394-429b-a1f1-4d5530e78458", "content": "Tottenham Hotspur manager Mauricio Pochettino was delighted in his side’s 4-1 win over Manchester City on Saturday but believes that they can still improve.  \n \nMauricio: \"I'm delighted with this brilliant result. I'm delighted for the players and fans who deserve this win.\" pic.twitter.com/zcqpzvdUSk \n \n— Tottenham Hotspur (@SpursOfficial) September 26, 2015 \n \n\n \nMauricio: \"We keep our feet on the ground. This is how we want to play. We can still improve & have more potential.\" pic.twitter.com/xUzS4XQc49 \n \n— Tottenham Hotspur (@SpursOfficial) September 26, 2015 \n \n\n \nGoals from Eric Dier, Toby Alderweireld, Harry Kane and Erik Lamela cancelled out an earlier effort from Kevin De Bruyne to hand Spurs a vital victory over Manuel Pellegrini’s men, a side they have struggled against in previous seasons. \n \n Pochettino: I’m “very happy” for Kane following his first Premier League goal of the season \n \nThe victory provided the North London club their third successive win in the top flight this term. Pochettino’s men finally appear to be turning a corner in the division after an inconsistent start, which saw them fail to win their first four games. \n \nSpurs have now scored nine goals and conceded only five, which is the fewest in the league so far, level with Everton, Manchester United and Watford. The Lilywhites looked more dynamic and threatening against City and scored more than two goals in a game for the first time this season. \n \nSpurs have conceded the fewest goals in the league this season. \n \nSupporters will also be encouraged to have seen Kane score his first goal of the new term as he looks to build upon the success that he experienced last season. Lamela’s goal was also significant as it was the first time the much-maligned midfielder has scored in the division since April 25th. \n \nTottenham have created 89 chances in the league this season. \n \n\n \nThe post Pochettino on Man City victory: “This is how we want to play” appeared first on Squawka News .", "source": "Squawka News"}