{"published": "2015-09-07T15:41:04Z", "media-type": "Blog", "title": "FIFA 16: 14 Striker Wonderkids You Should Think About Signing", "id": "a6b4ca0e-34bd-46c0-b908-151441b1e54b", "content": "Emilio Morenatti/AP  \nThe modern game has a shortage of world class strikers. That was the sentiment of Arsene Wenger this year at least, and many other managers look to be in agreement as Europe’s elite spend extortionate amounts of money on the few players available. \n \nThe result of this shortage is managers looking to theirs and others’ youth squads. Plucking out the hottest attacking talent and moulding them into the next superstar. Henry, Ronaldo and Messi cost less than £25million combined and almost single-handedly revolutionised their respective teams. And so we come to one of the greatest FIFA challenges for any burgeoning career manager to take on: developing a wonderkid into a superstar. \n \nOnly those in it for the long haul need apply. It will take multiple seasons of meticulous training, using the new FIFA 16 training system and lots of game time with the first team. And that has to come after you have scouted the world to find that special youngster. \n \nTo make things a little easier for those taking on the challenge, here are some of the top talents to have emerged in recent years who could fit into any top tier side as well as those fighting it out in the lower leagues. And some of them may be closer to home than you think. \n \n  \n 14. Chuba Akpom – Arsenal  Nick Potts/EMPICS Sport  \nPace, finishing and technique. The trio of traits that underpin the likes of Messi, Ronaldo and Aguero can all be found in young Chuba Akpom. While he still needs plenty of refining and some experience before he is ready to compete in the top flight, Akpom is a talent well worth developing. \n \nAssuming that the FIFA game play doesn’t alter too much for 2016, pace will be a dominant force in the game and Akpom has bags of it. Along with some impressive dribbling and balance skills to take advantage of those good positions that he can get into. \n \nFIFA 15 started Akpom with a 58 rating and a potential of 75 but after another season of scoring for fun in the U-21’s, a great pre season and start to his loan spell in the Championship, it is highly likely that the young striker will see a points bump in both starting and potential for FIFA 16.", "source": "WhatCulture.com » WhatCulture.com"}