{"published": "2015-09-10T14:01:39Z", "media-type": "News", "title": "Efforts to clean 2013 oil spill hampered by lack of natural gas", "id": "1f131cb5-200c-4f21-9356-e4d17318991d", "content": "BISMARCK, N.D.—The cleanup of a massive 2013 oil spill in northwestern North Dakota is being hampered by a lack of natural gas needed to power special equipment that cooks hydrocarbons from crude-soaked soil, a state regulator said. \n \nCrews have been working around-the-clock to deal with the Tesoro Corp. pipeline break that spilled more than 20,000 barrels of oil into a Tioga wheat field two years ago this month. \n \nBill Suess, an environmental scientist with the state Health Department, said Sept. 9 that workers will be at the site at least another two years baking oil from the soil using a process called thermal desorption, which involves excavating contaminated soil and heating it before putting it back in place. \n \nWorkers are trying to bring a second thermal desorption machine online but there is not enough natural gas available commercially in the area to power it, Suess said. A pipeline that feeds the primary unit does not have enough pressure to run a second unit that vaporizes contaminants through heat and pressure, he said. \n \n“The biggest issue is there is not enough gas to run a second thermal desorption unit,” he said, calling it “an irony” due to the high amount of natural gas in the region that is being burned off as a byproduct of oil production. \n \nTesoro and federal regulators have said a lightning strike may have caused the rupture in the 6-inch-diameter steel pipeline, which runs from Tioga to a rail facility outside of Columbus, near the Canadian border. The spill has been called one of the largest onshore spills in U.S. history, covering 7.3 acres of land, about the size of seven football fields. The incident exposed that North Dakota regulators had known about the spill but failed to notify the public _ or even some top state officials _ until The Associated Press asked about it. \n \nRegulators have said the spill caused no damage to water or wildlife. The pipeline was restarted about a month after the spill, after Tesoro accepted a federally imposed safety plan, which requires frequent aerial and ground inspections and additional leak-detection equipment. \n \nThe company initially estimated cleanup would take two years and would cost $4 million. The cost is now pegged at more than $20 million. \n \nTesoro said in a statement that about 6,000 barrels of oil have been recovered. \n \nCrews initially burned oil from the surface and later used vacuums to recover it. That proved ineffective after the oil seeped far underground, officials said. Workers have excavated more than 333,000 tons of soil and treated it using the thermal desorption technology, Suess said. \n \nThe company declined to say whether it would add a second thermal desorption unit. The sole unit at the site is “operating 24 hours a day, seven days a week to systematically burn the hydrocarbons from the contaminated soil,” Tesoro said. \n \n“We routinely evaluate our options in cleanup efforts and have not yet completed an evaluation of the use of a second desorption unit,” the company said.", "source": "Canadian Manufacturing"}