{"published": "2015-09-21T07:43:34Z", "media-type": "News", "title": "Domestic violence crisis: Women abused during pregnancy speak out", "id": "0d25ebac-299e-47d2-a76b-03e3cb069222", "content": "The risk of enduring another premature birth is very real for Martine*, who is six months pregnant with her second child.\n\nHer first was born seven weeks too early after a beating from her ex-partner forced her into a hospital bed and consequently labour.\n\nSix years later Martine, 29, has a new relationship and a new baby on the way but the abuse has not stopped from her ex-partner, who continues to harass her daily.\n\nMartine is just one of the many women in Australia whose pregnancy has triggered years of domestic violence against them and their child.\n\nDespite leaving the man who beat her into early labour, Martine fears his constant harassment could force another premature birth.\n\n\"He has threatened my life, killed animals in my yard, threatens any new relationship I start to the point where partners have left me,\" she says.\n\nMartine has a domestic violence order in place, but says her ex-partner has changed his methods of harassment to avoid getting caught.\n\n\"My tyres have been let down, his car constantly drives past my home, and I keep getting private numbers calling my phone. Just this morning I had a call and I know it's him,\" she says. \"I have had to change my phone number six times.\"\n\nHaving already been through a pre-term birth and living with endometriosis, Martine's pregnancy is classified as being high-risk. However, at six months pregnant she has to defend herself in court from her ex-partner, who has made allegations about her fitness to parent their child.\n\n\"I'm scared the stress of all the court cases could trigger another pre-term labour,\" she said.\n\n\"He said 'I cannot wait until you die so I can piss on your grave'. I know he wants me out of the picture any way possible.\"\n\n\"He has made my life hell, and I don't know why.\"\n\nA string of women's deaths caused by domestic violence in early September has prompted more women to speak out for the first time about their own experiences.\n\nSarah*, 26, fought back tears as she described hearing about the recent spate of attacks against women.\n\n\"It could have been me,\" she says, referring to Karina Lock who was shot dead at a McDonald's restaurant on the Gold Coast. Lock's was one of three lives lost to domestic violence in a horror week for Queensland.\n\nSarah is permanently disabled from her abusive ex-partner and, like many women, the violence was experienced throughout pregnancy.\n\n\"It just didn't stop. He pushed so hard one time that when I hit the floor I tore discs in my spine. I had to have disc replacement and a spinal fusion. I had to learn to walk again,\" she says, her voice breaking as she describes her daily struggle.\n\n\"I wake every day in pain. I will never run comfortably. And when my kids want me to play, I can't. I'm in too much pain.\"\n\nSarah says she is harassed daily and admits she fears for her life; she says the police have ignored her concerns.\n\n\"He [ex-partner] has told me he wants to kill his ex-wife. He has told me the ways he wants to do it. But when I went to the police they said it's normal for people to say they want to kill their ex-partners, and it is a common figure of speech.\"\n\nNearly a quarter of Australian women say they have experienced some form of domestic violence whilst they were pregnant and half of them experienced abuse for the first time during that period.\n\nJulie-Ann, 28, is one of those women who experienced domestic violence for the first time during pregnancy.\n\n\"The abuse began nine years ago when I was 12 weeks pregnant,\" Julie-Ann says, speaking out about her domestic violence for the first time.\n\n\"Things were fine in our relationship until the 12 week mark and then, I don't know, it just went downhill from there.\"\n\nStatistics show leaving an abusive relationship and pregnancy are the most dangerous times for a woman experiencing domestic violence.\n\nJulie-Ann experienced abuse for nine and a half years following the first pregnancy through fear of leaving. Eventually she escaped and moved interstate.\n\n\"It felt safer to stay,\" she says about her nine years of abuse. \"Because he would lose control. If I was away I wouldn't know where he was, what he was thinking, or what he was going to do.\"\n\nFamily violence academic Deborah Walsh has specifically studied the relationship between pregnancy and domestic violence and says pregnancy often offers hope that an abusive partner will change.\n\n\"A baby offers hope for the future and a hope for change,\" Ms Walsh said.\n\nMs Walsh said due to this hope women have while pregnant many processes involved in screening for domestic violence would not be totally effective.\n\n\"We need to support men in our community to manage their feelings appropriately, safely, and non-violently, in a way that it is not seen as an attack on masculinity, but instead a part of masculinity,\" Ms Walsh said.\n\n\"Unless we support our men (to) deal with their emotions, feelings and associated behaviours, this is going to continue.\"\n\nDomestic Violence Prevention Centre director Amy Compton-Keen said pregnancy and post-birth were both vulnerable times for women and it was common for domestic violence to occur at these times.\n\n\"Many pregnant women do not report, disclose, or seek help due to feeling vulnerable and uncertain of the future,\" Ms Compton-Keen said.\n\n\"The cycle of violence may include periods where their partner is optimistic about the future, their child, and becoming a parent, and they may make promises.\n\n\"These promises are powerful and may contribute to a woman remaining in an abusive relationship.\"\n\nPeople who may be distressed can phone Lifeline on 131 114.\n\nPeople concerned about domestic violence threatening themselves or family can phone DV Connect on 1800 811 811.\n\n*Pseudonyms used to protect identity.\n\nFor independent news coverage, be sure to follow our", "source": "Melbourne Age"}