{"published": "2015-09-01T23:46:22Z", "media-type": "News", "title": "Jason Floros' competitve upbringing primed him to play", "id": "599cdc32-952d-4a32-9867-3682895170b4", "content": "BRISBANE Heat and Queensland Bulls all-rounder Jason Floros believes a competitive upbringing with three star younger brothers while growing up in Canberra has him primed to become a regular in both teams this summer. \n\nFloros, 24, has a difficult assignment ahead of him if he wants to play often for both the Brisbane Twenty20 franchise and in the domestic competitions with Queensland. \n\nThere's Ben Cutting who holds the all-rounder's spot across all three formats and leg-spinner Cameron Boyce - both of which the off-break bowler will be competing against. \n\nBut fresh after signing a contract extension with the Heat, Floros revealed the tough upbringing he had in the nation's capital. \n\nIt was that upbringing that has him mentally prepared to battle it out with his higher-profile squad mates - including Australian representatives Boyce and Cutting - for a regular spot in both the Brisbane and Queensland first XI outfits. \n\n\"My younger brothers Matthew, Timmy and Benji all play for ACT in indoor cricket and they recently won the national title,\" Floros told APN. \n\n\"Dad owns an indoor centre in Canberra, so we spent a lot of time there. \n\n\"Things got very competitive growing up - there was a lot of fighting but we're a real tight-knight family. \n\n\"Mum and Dad would always give up their weekend to drive us to whatever we were playing, whether it was footy or cricket.\" \n\nThat selfless hard work from his parents should pay off this season, as Floros will have an amazing opportunity to further his game at the Heat alongside the world's No.1 ranked T20 spinner, West Indian Samuel Badree. \n\nIf that's not enough, former New Zealand off-spinner Daniel Vettori will coach the men in teal in the Big Bash League this summer. \n\n\"I'll certainly be asking both guys a lot of questions - it's a really exciting opportunity for me to learn off two of the best,\" Floros said. \n\nThe Canberra product - who impressed with figures of 0-18 and 2-35 from his two bowling appearances in three games for the Heat last season - also believes he can perform with the bat in 2015/16. \n\nThe Matador Cup next month will be his first chance to impress, after toiling his way through the pre-season over the past few months. \n\n\"I want to bat higher up the order this season and I'm confident I can do well - it'll just be a matter of using that first opportunity (the Matador Cup) to put my name in front of the selectors,\" Floros said. \n\nTOP STORIES ONLINE \n\nReal Estate Real Estate Real Estate", "source": "The Daily Examiner"}