{"published": "2015-09-16T21:20:31Z", "media-type": "Blog", "title": "Bless (affectionately and gratefully praise) the Lord", "id": "2babddf5-5af2-4d6a-ae7b-e170f20bdad9", "content": "BEHOLD, BLESS (affectionately and gratefully praise) the Lord, all you servants of the Lord, [singers] who by night stand in the house of the Lord.\nLift up your hands in holiness and to the sanctuary and bless the Lord [affectionately and gratefully praise Him]!\nThe Lord bless you out of Zion, even He Who made heaven and earth.\nPsalm 134 Amp\nWe often pray for God's blessing on people. They may be our family, friends and ourselves. It may be a more general prayer for blessing on our church, workplace, school, neighbourhood, city and nations. And let's not forget God commands us to pray for blessing on people who have wronged us.\nFinally, all [of you] should be of one and the same mind (united in spirit), sympathizing [with one another], loving [each other] as brethren [of one household], compassionate and courteous (tenderhearted and humble).\nNever return evil for evil or insult for insult (scolding, tongue-lashing, berating), but on the contrary blessing [praying for their welfare, happiness, and protection, and truly pitying and loving them]. For know that to this you have been called, that you may yourselves inherit a blessing [from God—that you may obtain a blessing as heirs, bringing welfare and happiness and protection].\n1 Peter 3:8-9 Amp\nBut how often do we pray asking God how we can be a blessing to Him? I clearly remember a conversation I had with a mature Christian not long after I was saved. We were staying with him and his wife for the weekend. As we were driving to church he was talking about the worship time in the service being a time when we had an opportunity to bless God, rather than a time of asking God to bless us. That conversation started a thought path that continues today, how can I be a blessing to God, not to gain His approval or love, as Jesus has already done that on my behalf. But rather as an act of appreciation and gratitude.\n​O GOD, You are my God, earnestly will I seek You; my inner self thirsts for You, my flesh longs and is faint for You, in a dry and weary land where no water is.\nSo I have looked upon You in the sanctuary to see Your power and Your glory.\nBecause Your loving-kindness is better than life, my lips shall praise You.\nSo will I bless You while I live; I will lift up my hands in Your name.\nMy whole being shall be satisfied as with marrow and fatness; and my mouth shall praise You with joyful lips\nWhen I remember You upon my bed and meditate on You in the night watches.\nFor You have been my help, and in the shadow of Your wings will I rejoice.\nMy whole being follows hard after You and clings closely to You; Your right hand upholds me.\nPsalms 63:1-8 Amp\nFrom reading this passage from Psalm 63, we can see some ways we can bless the Lord\n1. Earnestly seek Him (don't get distracted by other things and people)\n2. Look upon Him ( keep our eyes focused on Him, no matter what is going on)\n3. Praise Him (even when you don't feel like it)\n4. Lift up my hands (an act of complete surrender to Him and His ways)\n5. Remember (remember all that He has done for you, with a grateful heart)\n6. Rejoice (in all He has done, is doing and has promised to do)\n7. Follow hard (always look to Him purposefully to see where the next step is to be)\n8. Cling closely ( as if your life here and for eternity depends upon Him, because it does)\nAnd in desiring to bless the Lord, let's always remember\nWe love Him, because He first loved us. \n1 John 4:19 Amp\nWe are abundantly blessed, so today let's seek God on how we can be a blessing to our Him, and the world we live in.\nAnd let us not lose heart and grow weary and faint in acting nobly and doing right, for in due time and at the appointed season we shall reap, if we do not loosen and relax our courage and faint.\nSo then, as occasion and opportunity open up to us, let us do good [morally] to all people [not onlybeing useful or profitable to them, but also doing what is for their spiritual good and advantage]. Be mindful to be a blessing, especially to those of the household of faith [those who belong to God’s family with you, the believers].Galatians 6:9-10 Amp", "source": "Wendy, A God Girl"}