{"published": "2015-09-01T13:35:20Z", "media-type": "News", "title": "EU Bank appoints Mikołaj Dowgielewicz as new EIB Representative to the EU institutions and…", "id": "2a46c7bd-a1e2-4c68-800b-8edf79330adc", "content": "MIL OSI – \n \nMIL OSI – Source: European Union – Press Release/Statement \n \nHeadline: The European Investment Bank has appointed Mikołaj Dowgielewicz (43) as the bank’s Brussels Representative with a rank of Director General, to strengthen engagement with institutional and political partners. Mikołaj Dowgielewicz´s previous experience covering foreign affairs, European policy making and multilateral development will make a significant contribution to reinforcing the effective engagement of the European Investment Bank, as Europe’s long-term lending institution. \n \n“The EIB is delighted to have Mikołaj Dowgielewicz join as Head of its Brussels Office and Representative to the EU institutions. Mikołaj brings a great experience of European politics and a wide-ranging network within the EU institutions to his new role and will make a valuable contribution to our cooperation with EU institutions. This appointment reflects the increased commitment of the EU Bank to provide additional input to the European economy as part of the ´Investment Plan for Europe´. My colleagues and I look forward to working closely with Mikołaj in this new role.” said European Investment Bank President Werner Hoyer. \n \n“Throughout my professional life, I have been a committed European who strongly believes in the added value of the European project. In these tough times for the European integration, the EIB brings a real added value to the EU economy and economic and social development. I am honored to help achieving this by strengthening EIB´s cooperation with the other EU institutions, Member states, European partners, business groups and key stakeholders. I very much look forward to working with my new colleagues in ensuring that long-term investment creates innovation, jobs and growth in Europe and beyond”, said Mikołaj Dowgielewicz. \n \nMikołaj Dowgielewicz (Polish citizenship) graduated in law and politics from the University of Hull and in Advanced European Studies from the College of Europe. \n \nFrom 1998 to 2000, he worked in the Cabinet of the Minister of Foreign Affairs, Bronislaw Geremek. In 2003, he began to work in Brussels as an adviser on enlargement to Pat Cox, President of the European Parliament. In 2004, he became European Commission spokesman for Institutional Relations and Communication Strategy and, in 2007, entered the Cabinet of the Vice-President of the European Commission, Margot Wallström. \n \nIn December 2007, he was appointed Secretary of State in the Office of the Committee for European Integration (OCEI). As of July 2008, he was appointed to the position of Government Plenipotentiary for Presidency of the EU Council. In January 2010, after the OCEI and the Ministry of Foreign Affairs were merged, he became Secretary of State for European Affairs and Economic Policy at the Ministry of Foreign Affairs. \n \nBetween 2007 and 2012, he chaired the Polish Government’s Committee for European Affairs. While in government, Mikołaj Dowgielewicz represented Poland on the EU General Affairs Council, which he chaired in the second half of 2011 during the Polish Presidency of the Council. In March 2012, he was unanimously elected Vice-Governor of the Council of Europe Development Bank (CEB) by the Bank’s 40 Member States. \n \nMikołaj Dowgielewicz will resume his new post as EIB´s Representative to the EU and Head of Brussels office as of today. He follows Ben Knapen, who returned to the Netherlands, where he became member of the Senate. \n \n— \n \n© Multimedia Investments Ltd Terms of Use/Disclaimer . \n \n© Multimedia Investments Ltd Terms of Use/Disclaimer.", "source": "Foreign Affairs.co.nz"}