{"published": "2015-08-11T00:00:00Z", "media-type": "Blog", "title": "English teacher", "id": "ac00ca64-5ee0-45cc-b21b-c8ef8d239290", "content": "Beijing Zhirui Interaction International Culture Exchange Corporation jybsxs123@tom.com Published: 11 Aug, 2015 Job location China Job Type Full time Description Beijing Zhirui Interaction International Culture Exchange Corporation is a professional organization engaged in the introduction of the foreign talents and international educational exchange services. Zhirui is Located in the Haidian District, Beijing, nearby Tsinghua University, Peking University and the Renmin University of China. Being within an easy reach of these key universities enables us to share a variety of educational resources with them in Beijing and surrounding areas. We have professional educators with years of educational experience in the company enabling us to provide excellent foreign talents and leading international educational services. With the continuous Exploration and innovation, we have developed a domestic top-ranked organization providing foreign talents with high qualification; these include an International culture exchange service center, Verbal Learning Services Outsourcing Center. Our company participates in various international exchange activities bringing together foreign teachers building a strong and professional talents pool. A number of public schools and training institutions have cooperated with us. So we can provide positions and placement for these high-quality foreign oral English teachers with full-time and part-time jobs. Requirements 1.Willing to stay for at least 3 months; 2.No younger than 19;\n3. Native English speaker or near; 4.Formal teaching qualifications are desirable, but not necessarily required;\n5.Pre-existing Chinese language skill is desirable,but not necessarily required;\n6. Having English teaching experience would be preferred, but not necessarily required;\n7. A spirit of adventure and a sense of humor!\n8. Native English speakers from USA, Canada, UK, Australia, Ireland, New Zealand. ;\n9.Featuring good-looking, good communication,optimistic character.(4..5..6..) How to apply Mail:jybsxs123@tom.com\rSkepe:zhangj@5ispeak.com Other jobs in China EF English First Xi'an Xi'an Foreign teacher Baoji ESL Teachers for beautiful coastal city of Qinghuangdao Qinhuangdao Excellent English teacher wanted! Changchun Public Schools in Beijing Chaoyang District Advice to jobseekers You should fully research any employer before accepting a job offer. If you have any concerns about an advert or a communication from an employer check the scams forum and read our guide to avoiding scams. You can also ask a question about a specific school or about teaching in China in the forum. Disclaimer Eslbase is not responsible for the accuracy of the information in this job advert or for the outcome of any application or communication made in relation to it. Please see our full disclaimer. Get job alerts by email  -  Guide to finding a job", "source": "TEFL jobs - Eslbase"}