{"published": "2015-09-03T23:51:11Z", "media-type": "Blog", "title": "Reading Roundup: What’s New in Blogging Lately", "id": "2667278d-422d-44c4-8bc0-e226176c283c", "content": "So many handy tips to help you on your way this week! Hope it’s been a good one for you. \n How to Hire a Team to Help (Delegating Parts or the Whole of a Process to Someone Else) // Entrepreneur on Fire  \nIn episode 40 of the ProBlogger Podcast, Darren spoke about his 7 productivity tips for bloggers – and one of them was the recommendation to outsource or delegate where you can. I think it’s a fabulous idea (except slightly harder for those folk who have personal blogs). Kate Erickson has given an excellent overview for someone thinking of getting started. \n 9 Steps to Better Welcome Emails // Kissmetrics  \nI know, I suck at these too. \n Why You Should Blog Before Breakfast // Jeff Bullas  \nI actually started doing this a few months ago, then all the wheels fell off. It’s time to screw them back on! \n Facebook is Testing Out a Pop-Out Video Viewer For its iOS App // The Next Web  \nIt’s not available to everyone, but it appears some users are seeing a “more videos” scroll function when viewing videos on their mobile devices. As we know, Facebook is pushing video , so perhaps this might come into full effect after all? \n Facebook Pushing Users to Blog  // CBS News  \nIt also appears Facebook has revamped the long-unused notes section in an attempt to get more people to blog on the platform. Trying to become a one-stop shop for all your online needs, maybe? \n \n  \n \nSo what are your thoughts? Have you been one of the users to see the new video pop-out? Would you blog on the Facebook platform? When is your best time to write? \n \nStacey Roberts is the Managing Editor of ProBlogger.net: a writer, blogger, and full-time word nerd balancing it all with being a stay-at-home mum. She writes about all this and more at  Veggie Mama . Chat with her on Twitter  @veggie_mama  or be entertained on  Facebook . \n \nOriginally at: Blog Tips at ProBlogger \n \n\nReading Roundup: What’s New in Blogging Lately \n \nThe post Reading Roundup: What’s New in Blogging Lately appeared first on @ProBlogger .", "source": "@ProBlogger"}