{"published": "2015-09-14T03:45:06Z", "media-type": "News", "title": "CH BIO CASSAVA (08129) has significantly fluctuated 17.341%. The last price is HK$0.167", "id": "ce951992-dc07-4a63-9e7c-eab81ff43fab", "content": "[Fluctuating Stock] CH BIO CASSAVA (08129)'s price significantly fluctuated 17.341% at 10:38a.m . Its last price is HK$0.167, down 3.468%. Today's highest price is $0.194 and lowest price is $0.164. Total volume is 1.7M shares and total turnover is HK$293.36K. \n\nMost Read News \n\nSITEMAP \n\nAASTOCKS.com \n\nProducts \n\nMarket \n\nQuotes \n\nAnalysis \n\nNews & Research \n\nCommentary \n\nWarrants \n\nCBBCs \n\nMPF \n\nUS Stocks \n\nForex \n\nFund \n\nMembers \n\nAbout Us \n\nAASTOCKS \n\nFinancial Information \n\nHK Stocks | HK Futures | HK Options | Warrants | CBBCs | Forex | Gold | Hong Kong Indices | World Indices | Shenzhen A-shares  | \n\nShenzhen B-shares | Shanghai A-shares | Shanghai B-shares | US Stocks \n\nMember Services \n\nFree Services | Streaming Quotes | Technical Analysis | Charts | Real-time Snapshot | Company Profile | Market News \n\nInformation Provided \n\nQuote | Technical Analysis | Charts | Announcements | Company Profile | IPOs | Market Calendar | A.I | Block Trades | Research | \n\nMarket Reports | Market News \n\nStock Quote \n\nReal-time Quote|  Latest Quote |  Real-time Chart |  Real-time Top 20 |  Portfolio Anywhere |  Investment Advice \n\nAbout US| Register | Advertisements | Help | Disclaimer | Privacy Policy  | Contact Us | Careers \n\nEmail support@aastocks.com \n\nCopyright@2014 AASTOCKS.COM LIMITED (阿斯達克網絡信息有限公司) All rights reserved. \n\nDisclaimer \n\nAASTOCKS.com Ltd, HKEx Information Services Limited, China Investment Information Services Limited, its holding companies and/or any subsidiaries of such holding companies endeavour to ensure the accuracy and reliability of the Information provided but do not guarantee its accuracy or reliability and accept no liability (whether in tort or contract or otherwise) for any loss or damage arising from any inaccuracies or omissions. \n\nThe information and contents contained in this website are based on the analyses and interpretations of publicly available information obtained from sources believed to be reliable. Such analyses and information have not been independently verified and AASTOCKS.com Limited makes no guarantees to their accuracy, completeness, timeliness or correctness. The quotes, charts, commentaries and buy/sell ratings on this website should be used as references only with your own discretion. AASTOCKS.com Limited is not soliciting any subscriber or site visitor to execute any trade. Any trades executed following the commentaries and buy/sell ratings on this website are taken at your own risk for your own account. \n\nAASTOCKS.com Limited provides the information and services on an \"AS IS\" basis. The information and contents on this website are subject to change without notice. \n\nAASTOCKS.com Limited reserves the right, in its sole discretion but without any obligation, to make improvements to, or correct any error or omissions in any portion of this website at any time. The subscriber or site visitor agrees not to reproduce, retransmit, disseminate, distribute, broadcast, publish, circulate, sell or commercially exploit the information and contents on this website in any manner without the express written consent of AASTOCKS.com Limited. Investing and trading in stocks, currencies and other securities are very risky. AASTOCKS.com Limited encourages you to use the risk management and educational tools on this website. AASTOCKS.com Limited cannot and does not give any assurance that the present or future buy/sell commentaries and signals on this website will be profitable. AASTOCKS.com Limited cannot guarantee, and the subscriber or site visitor should not assume, that the future performance will equal past performance. \n\nAASTOCKS.com Limited may point to other sites that may be of interest to the subscriber or site visitor but for which AASTOCKS.com Limited has no responsibility and only provides this as a service to the subscriber or site visitor. \n\nAASTOCKS.com Limited does not represent or endorse the accuracy or reliability of any information, advertisements or contents contained on, distributed through, or linked, downloaded or accessed from any of the services on this website. AASTOCKS.com Limited cannot and does not guaranty the quality or reliability of any products or information purchased or obtained by you as a result of an advertisement or any other information displayed on this website. \n\nRemarks: All HK and China Indices are real time. World indices are at least 30 – 60 minutes delayed.", "source": "Aastocks.com"}