{"published": "2015-09-24T08:00:20Z", "media-type": "News", "title": "Woman says Mounties threatened to seize her kids", "id": "527b50f6-7d8a-4aad-880a-1e347d579351", "content": "BELLA COOLA, B.C. - A First Nations woman from British Columbia's central coast is suing the province after two Mounties allegedly threatened to seize her three young children if she didn't let them search her vehicle for marijuana and crack cocaine. \n\nKimberly Mack will appear in provincial court in Bella Coola Thursday asking to be compensated $15,000 for what she alleges was an illegal search that failed to turn up any drugs. \n\n\"When I meet up with the cops now I feel a lot of anger,\" said Mack in an interview. \"When I think they can get away with so much I feel angry towards them. \n\n\"I would just like an apology. That's my main thing.\" \n\nRCMP Cpl. William Wallace, Const. Nick Jenkins and B.C.'s attorney general are named in the lawsuit. \n\nA notice of civil claim states Mack was driving back to Bella Coola on May 28, 2010, with friends and family from a potlatch in Vancouver, when she parked outside a grocery store close to home for a washroom break. \n\nActing on an anonymous tip, police pulled alongside the vehicle and asked Mack for permission to search her vehicle, the notice states. \n\n\"They said, 'Kim, if you do not let us search your van we will get the (Ministry of Children and Family Development) involved. We'll get the dogs to search your van if you're not going to help us,'\" said Mack in an interview. \"I felt that I had to say yes to them.\" \n\nThe notice states the officers arrested Mack in front of her eight-, four-year-old and 15-month-old children and searched the entire van, even tearing off the vehicle's panelling. \n\n\"I was scared,\" she said, about the public search. \"I felt embarrassed. Very embarrassed.\" \n\nMack said she later lost customers from her home-based convenience store and kept her eldest daughter out of school for a month, until life returned to normal. \n\n\"I didn't even want to walk into the grocery store,\" she added. \n\nThe RCMP and the province's Ministry of Justice and Attorney General said they couldn't comment because the case was before the court. \n\nThe ministry also referred questions to the federal Department of Justice because the RCMP was involved in the case. \n\nDoug King, a Pivot Legal Society lawyer, is representing Mack and her co-plaintiff, Demi King. \n\nHe said they made a conscious decision to try the case in Bella Coola circuit court and not in a larger city, such as Vancouver. \n\n\"The heart of the case is about small communities — especially aboriginal communities — and how they're policed by the RCMP,\" he said. \"This is really a case about a family that was totally innocent and had their life turned upside down.\" \n\nThe police allegedly didn't have a warrant, despite having ample time to secure one, said King. \n\nMack said she wasn't read her rights, either. \n\nKing said he hopes the case highlights the importance of legal mechanisms that keep police accountable. \n\nHe said the biggest issues in the case was the officers' threat to remove Mack's children, especially given the fraught history that exists between the state and aboriginal communities. \n\n\"A threat to take away somebody's children is not a minor threat,\" said King. \"Historically, it's something that's happened and is a real part of people's lives in communities like this.\" \n\nA date has not been set for the defendants to present their case, but that stage is expected to take place in Vancouver. \n\n— By Geordon Omand in Vancouver \n\n— Follow @gwomand on Twitter", "source": "BlackburnNews.com"}