{"published": "2015-09-29T06:15:46Z", "media-type": "News", "title": "Big weekend for Oddball, Blinky Bill take Australian box office to the brink", "id": "04045aec-ab7f-4ed0-940a-e7e374e064ef", "content": "After a couple of dismal years, Australian movies have bounced back, posting the second-highest total ever, with more to come. \n\nMovie session timesFull movies coverage\n\nA bumper weekend for Oddball has propelled Australian movies to their biggest year at the box office since 2001, when they took a record haul of $63.4 million.\n\nBox office receipts for Australian movies in 2015 passed $59 million on the weekend, with family film Oddball and children's animation Blinky Bill both increasing their haul compared to their opening weekends – an almost unheard of feat.\n\nOddball took $1.796 million on its second weekend, up from $984,958 on its first, an 81 per cent lift. Total box office for the based-on-fact film about a chicken farmer (Shane Jacobson) whose dog helps save a penguin colony from foxes now stands at $4,561,000.\n\nBlinky Bill lifted even more as the school holiday effect kicked in. Its take increased 117 per cent, taking it to a total of $1,373,000.\n\nLittle more than a year ago, you couldn't pay Australians to go and see an Australian movie at the cinema, despite the quality of some of the films on offer.\n\nThe local take for 2014 was just $26.2 million, almost a quarter of it going to Russell Crowe's The Water Diviner in the five days between its Boxing Day opening and the end of the year. The 2.4 per cent share of the box office was the lowest in a decade, and barely one-tenth of the best year on record, 1986 (the year of the freakishly popular Crocodile Dundee). While that 23.5 per cent share is unlikely ever to be equalled, the trend this year is extremely positive.\n\nFour of the weekend's top 20 movies were Australian, with Last Cab to Darwin (total $7,056,000) and Holding the Man ($1,082,000) rounding out the numbers.\n\nOn the limited release chart, Tony Ayres' Cut Snake made a fair debut with $16,133 on just six screens.\n\nWith Jocelyn Moorhouse's period black comedy The Dressmaker, Brett Lee's leading-man debut in UnINDIAN, and Now Add Honey, the big-screen debut from writer-director-actor husband-and-wife team Robyn Butler and Wayne Hope (The Librarians, Upper Middle Bogan), just around the corner, the chances of setting a new record in dollar terms are looking good.\n\nThe federal screen agency Screen Australia is certainly feeling optimistic. \"The box office figures speak for themselves,\" says Richard Harris, head of business and audience. \"The local appetite for Australian film is stronger than ever, and people are loving the diversity of product at the cinema this year.\n\n\"Whether it be a family film like Oddball, a drama like Holding the Man or an international blockbuster like Mad Max: Fury Road, movie-goers may well deliver a record year for Aussie film.\" Catch it while you can: Australian movies now showing\n\nOddball (on 293 screens)\n\nBlinky​ Bill: The Movie (290 screens)\n\nLast Cab to Darwin (54 screens)\n\nHolding the Man (29 screens)\n\nCut Snake (6 screens)\n\nGayby​ Baby (4 screens) And just around the corner\n\nUnINDIAN (October 15; 80 screens)\n\nAlex & Eve (October 22; 30 screens)\n\nThe Dressmaker (October 29; 315 screens)\n\nNow Add Honey (November 5; screens undisclosed)\n\nFollow Karl Quinn on twitter: @karlkwin \n\nOn", "source": "Riverina Rural"}