{"published": "2015-08-07T13:00:29Z", "media-type": "Blog", "title": "Managing Malignant Pleural Effusions: Tunneled Pleural Catheter", "id": "5660d762-a377-41e0-b374-fa1d211e76c6", "content": "Managing Malignant Pleural Effusions: Tunneled Pleural Catheter\nPublished August 7, 2015 | By GRACE Video\tDownload PDF of this page\n  A tunneled pleural catheter is an excellent way to manage the symptoms of a recurrent malignant pleural effusion. Dr. Jed Gorden describes how it is placed and how it works. Podcast: Play in new window | Download (Duration: 7:40 — 95.9MB) Download Transcript How Did You Like This Video?\nPlease feel free to offer comments and raise questions in our Discussion Forums.   Transcript So we’re talking today about pleural fluid — fluid that resides around the lung, in-between this space that we’re calling the double plastic bag. But what we’re talking about is the evolution from symptoms associated with pleural fluid, to diagnosis of the pleural fluid, to, now, how do we manage it long-term, because my goal for you is that you recognize that you have options for independence, and independent living despite the fact that the fluid may be building up. So what I’m going to talk to you about right now is called tunneled pleural catheters. Tunneled pleural catheters is a generic name, it is not like what you typically think about when drains are placed in the chest, and I want to sort of dispel that myth right up front, because often times when people are told, “well, we’re going to put a drain in,” people think about people that they’ve known who’ve had operations and have drains hanging out, and constant drainage. What I’m talking about is something that is designed that only you and your loved ones will have to know about, things that can allow you to go back to work, to enjoy sports and travel — things that really give you independence.  So what are these tunneled pleural catheters? They fall under many brand names, and depending on who your practitioner is, you may find that they may use something called PleurX, or they may use something called Aspira, or they may use something called Rockets (Rocket Medical) — they’re just different names all for the same thing. These are all devices that allow you to go home and manage your pleural fluid on your own. So, these are catheters that are typically placed in your side. We already know, when we put them in, a couple of really important things: number one, that you have pleural fluid, number two, that that pleural fluid comes back, and that unfortunately, that we can only temporarily relieve the symptoms, because until we have better treatments, at this time it is something that’s going to cause you symptoms, and that when you drain it, you get relief of those symptoms. So, that’s the triad that’s really important — that you have fluid, that the fluid recurs, and that if that fluid is drained, you get relief of your symptoms. If that triad is present, we need to come up with a system for you to live independently at home, and a common system that we use right now is placed in the side, and it’s the tunneled pleural catheter.  Typically these are placed in a sterile environment to minimize the risk of infection. We place them by ultrasound guidance, again, a safe way to identify the structures. We typically place them with you under a little bit of sedation — something to just take the edge off so you’re not aware of the surroundings. We instill a lot of local medications; typically we’ll put your arm behind your head and ultrasound in this plane right here on your side. The reason that we go into the side is because we don’t want you to have something in your back that does not allow you to lay in your bed, or sit on a chair, or drive a car and have pressure. We typically find that people have much more freedom when their side has a catheter and not their back.  The catheter is tunneled, just like the name says. That means that it goes under the skin, and then into the pleural space here on the side. There are specific advantages of that — that allows you to be at home with it, it minimizes the risk of infection, and it minimizes the catheter’s being dislodged, and it allows it to be more comfortably placed in the side pocket here. So, one end of this catheter is sitting within that fluid that’s in the chest — it’s in the plastic bag. When you’re not using these, when you’re at work, or like I have patients who play tennis, or golf, no one has to know you have this catheter. The catheter has a one-way valve on the end — that does not drip, it does not leak, it is wound up like a pretzel, there’s a gauze pad and a Tegaderm tape — the clear plastic bandages that you often see in the hospital, goes on top of it. That allows it to be on your side, and for you to be free to do what you want. The only restriction that we often ask is that you not go underwater, so it does limit scuba diving, snorkeling, hot tubs, and swimming, but other than that we encourage people to be active. The whole goal of this is for you to be out enjoying life; this is not a scenario that should make you feel home-bound — this should liberate you. The second advantage of these tunneled pleural catheters is that it gives you control back. So often with cancer, you’re reliant on your physicians — your oncologist, your pulmonologist, the nurses, the infusion center. The tunneled pleural catheter gives you and your loved one control over your pleural fluid. If you feel short of breath, you can drain your catheter. You don’t have to make a phone call to your doctor, you don’t have to go to the emergency room. The kit comes with vacuum bottles that hold between 500 cc’s and one liter, there are two sizes, typically for the vacuum ones — there are other kits that are slightly different. When it comes time to drain, you’ll be taught how to do simple, sterile technique. It is a very simple process that should not give you anxiety, but it will require a partner — it’s just an awkward location. And this allows your loved one to actually participate in your care and help you. The catheter and the drainage kit are hooked together, and the fluid is removed. This is the most important point here: the fluid that makes you feel better is what’s removed — never feel compelled to take as much fluid as you can. Sometimes people feel a little bit of pain as the fluid is being drained. The goal here is to remove fluid, have you feel better, relieve the symptoms, and get you back to doing what you want to do. You don’t get points for extra volume — draining a liter is not better than draining 500 cc’s if it’s just going to make you uncomfortable. When you’re done with that drainage, it’s taped back up, and you go about your business. So how often do you drain? It’s a common question that we’re asked. Well, typically what we do is we put people on a schedule. We say, “listen, we want you to be proactive. I don’t want you to wait until you’re short of breath. My goal is actually for you never to feel better when you drain your pleural catheter because you never allowed enough fluid to build up, and that you were ahead of it, and you maintained an excellent performance status.” So we start off typically with draining about every three days, and that may vary depending on how much fluid you build up, but from there you should feel comfortable coming up with a schedule that works for you. So these are not like taking blood pressure medications or chemotherapy that you need to adhere to a rigid schedule. Remember, this is your home device for you to feel better, and you get control over when you want to drain that catheter. So what are other things that you should feel free to do? Well, despite the fact that you have something in your side and I said you couldn’t take a bath, you’ll be happy to know that you could, and should, take showers, right? So, you should freely allow fluid and water to run over the bandage, or take the bandage off and allow fluid to run, as long as it’s dry before you rebandage it. So most of the activities that you do normally, you should feel free to continue doing. So the goal for you and your practitioner once you’re identified as having pleural fluid is not to have a conversation about how often you’re going to have your pleural fluid drained, but how few times you’re going to have to come to the hospital and have this managed, and when can you get on with managing this at home, and not have to keep coming back and having to deal with it. Related Posts:Managing Malignant Pleural Effusions: Thoracentesis by GRACE Video August 5, 2015 Managing Malignant Pleural Effusions: Pleurodesis by GRACE Video by GRACE Video August 10, 2015 Introduction to Malignant Pleural Effusions by GRACE Video by GRACE Video by GRACE Video August 3, 2015 The Challenge of Assessing Response in Malignant Pleural… by GRACE Video by GRACE Video by GRACE Video by Dr West January 10, 2013 Improved Survival in Malignant Pleural Mesothelioma with… by GRACE Video by GRACE Video by GRACE Video by Dr West by GRACE Video July 15, 2015 Posted in A Reference Library on Lung Cancer, Core Concepts, GCVL-Lung, General Lung Cancer Issues, GRACE Cancer Video Library, GRACEcast, Lung Cancer, Lung Cancer, Management of Pleural Effusions, Non-Small Cell Lung Cancer (NSCLC), Small Cell Lung Cancer (SCLC), Supportive care | Tagged Denver catheter, GCVL, GCVL-Lung, malignant pleural effusion, MPE, pleural effusion, pleurodesis, Pleurx, thoracentesis, tunneled pleural catheter", "source": "GRACE :: Lung Cancer"}