{"published": "2015-09-30T10:54:33Z", "media-type": "News", "title": "Germany Sulfuric Acid Market Review 2009-2019", "id": "7b41b76e-b263-4430-8d68-4ff53c54c351", "content": "Research and Markets (http://www.researchandmarkets.com/research/4qwptv/sulfuric_acid) has announced the addition of the \"Sulfuric Acid Market in Germany: 2015-2019 Review\" report to their offering. The report brings together facts and figures about sulfuric acid market in Germany covering period of 2009-2019. Statistics, experts' opinions and estimations are given. The report about sulfuric acid market in Germany covers: - manufacturers capacity, production volumes - company profiles - consumption structure, trends - end-users segments - prices - market forecast Buying the report means: - availability of key statistics about sulfuric acid market in Germany (historical and forecast) - allocation of country market players, their role in the market - provision of data on demand characteristics - identification of market potential Key Topics Covered: 1. OVERVIEW OF SULFURIC ACID MARKET IN GERMANY 2. CAPACITY IN GERMANY 2.1. Nameplate capacity, shares in global and regional markets (2014) 3. SULFURIC ACID SUPPLY IN GERMANY 3.1. Germany output in 2009-2014 3.2. Germany production shares in global market and in regional market (2009-2014) 4. SULFURIC ACID MANUFACTURERS 4.1. Sulfuric Acid manufacturers' profiles 4.2. Plants capacity, shares in local and world markets 5. SULFURIC ACID DEMAND IN GERMANY 5.1. Demand structure, consumption (2009-2014) 5.2. Germany demand shares in regional market and in global market (2009-2014) 6. SULFURIC ACID TRADE IN GERMANY 6.1. Export, export share in production (recent years) 6.2. Import, import share in consumption (recent years) 6.3. Annual prices (recent years) 7. FUTURE TRENDS IN SULFURIC ACID MARKET TO 2019 7.1. General market forecast 7.2. Sulfuric Acid output forecast to 2019 7.3. Sulfuric Acid consumption forecast to 2019 8. SUPPLIERS IN GERMANY 9. SULFURIC ACID END-USERS IN GERMANY For more information visit http://www.researchandmarkets.com/research/4qwptv/sulfuric_acid CONTACT: Research and Markets, Laura Wood, Senior Manager. press@researchandmarkets.com Fax from USA: 646-607-1907 Fax from rest of the world: +353-1-481-1716 Sector: Chemicals (http://www.researchandmarkets.com/categories.asp?cat_id=63&campaign_id=4qwptv) \n\n((M2 Communications disclaims all liability for information provided within M2 PressWIRE. Data supplied by named party/parties. Further information on M2 PressWIRE can be obtained at http://www.m2.com on the world wide web. Inquiries to info@m2.com.", "source": "Individual.com"}