{"published": "2015-09-18T04:00:00Z", "media-type": "News", "title": "Editorial: Getting down to substance", "id": "f3e147c9-4c0b-4cfd-8dea-eff226cf89cc", "content": "When all the hoop-de-do of the last Republican presidential debate is put aside, voters are still left to figure out not who is the best showman, but who will make the best commander in chief. \n\nIn a dangerous world where one terrorist group claims huge sections of Iraq and Syria, where Iran makes no secret of its nuclear ambitions, where Russia’s thug-in-chief feels free to gobble up territory, knowledge about and a passion for foreign policy does matters. \n\nSo it isn’t just that Donald Trump is flummoxed by all those “Arab names” he’s expected to know. It’s that promising to “know more about the problems of this world when I sit” in the Oval office, as Trump said Wednesday night, isn’t good enough. \n\n“There is a lunatic in North Korea with dozens of nuclear weapons,” said U.S. Sen. Marco Rubio. “A gangster in Moscow is not just threatening Europe, he’s threatening to destroy and divide NATO.” \n\nAnd, he might have added, we’ve had seven years of an administration that just lets it all happen. \n\n“Weakness is provocative,” U.S. Sen. Ted Cruz said during one of his better moments. \n\nFormer Hewlett-Packard CEO Carly Fiorina had a detailed, rapid-fire cure for that problem. \n\n“We need the strongest military on the face of the planet and everyone has to know what that means,” she said. She also supported rebuilding missile defense programs in Poland, a larger U.S. military presence in Europe, an expanded Navy and an updated nuclear arsenal. \n\nSomewhere Ronald Reagan would be smiling. \n\nAnd the underrated Jeb Bush had his moment too — even if it was in defense of his brother, who he has spent time distancing himself from. \n\n“He kept us safe. ... He sent a clear signal the United States would be strong and fight Islamic terrorism,” Bush said of George W. Bush. \n\nYes, there was indeed substance in this debate. Sure, sometimes you have to listen a little harder for it. But there is a richness to this GOP field — blowhard billionaires notwithstanding.", "source": "Boston Herald"}