{"published": "2015-09-25T13:34:17Z", "media-type": "Blog", "title": "Day 6: Thursday 24th September 2015 – Taitung to Hualien", "id": "a2af57df-09e6-4b6c-86c3-ae8aff7c5578", "content": "Before we left Taitung, we returned to the International Landmark we had visited the previous evening. In the daylight it didn’t look quite as impressive, but the view of the shoreline from the structure was worthwhile.It was a lovely fine, warm day as we entered the beautiful East Rift Valley, between the Coastal and Central mountain ranges. The wide valley contains some of Taiwan’s best farming country so we were treated to stunning views all day.  \nNot far along, we turned off the main road, wound through small plots of intensive agriculture and climbed into the foothills of the Central range to see the Liji Badlands. Once mudflats, this severely eroded landscape has been uplifted and folded by the action of the two continental plates that collide in this valley (the Philippine Sea Plate sliding under the Eurasian one).From one side of the valley we crossed the vast watercourse of the Beinan River and ascended the other range to Luye Gaotai, the place where the Hot Air Balloon festival takes place. There against the spectacular mountain backdrop we watched paragliders swoop and swirl before coming in to land. This vantage point also provided a wonderful overview of the extent of the valley and of the confluence of the Beinan and Luye rivers. A fabulous place.We continued through the valley, passing through an area of extensive rice cultivation. The paddies, both large and small, covered all available space and even came into town.At Chishang, considered to the Taiwanese ‘home of rice’ because of its prize-winning varieties and high productivity, we stopped to sample some of the champion produce, in the form of a lunch box. We also visited a display of old rice-growing equipment – the wooden husker, the raincoat made of straw, the tools that showed just how hard the farmers worked.On we went, the cloud now spilling over the mountains. Again we turned off the main road on to another twisting and winding road that climbed steeply, taking us to the peak of 60 Stones Mountain. Once again, the views of the valley were fantastic, but the real purpose of the visit was to see the remainder of the bright orange flowers, known to the Taiwanese as Golden Needle flowers. These flowers bloom only at the Autumn equinox and a few days ago would have blanketed the mountaintop.Back down on the mountain and further up the valley, we stopped at the marker for the Tropic of Cancer (no wonder it has been so hot an humid) then later at icecream o’clock, at a former sugar cane factory.The weather had closed in by this stage and we passed through showers, but by the time we reached Liyu (Carp) Lake it merely looked threatening. The cloud cover, in fact, was appreciated as it made it rather pleasant for the bicycle ride we made (with compulsory tea stop) around the pretty lake. What fun!As we approached Hualien, we stopped for a meal of fried noodles, before entering the city (pop about 100,000) to check in at the hotel.It had been a quieter day, but one full of amazing sights.", "source": "Gotta travel:"}