{"published": "2015-09-16T00:15:17Z", "media-type": "News", "title": "Senate Dems beat back GOP on Iran deal, again", "id": "f7fb7d52-30c6-4ca3-949b-99372e19ceee", "content": "WASHINGTON (CNN) – For the second time in two weeks, Senate Democrats Tuesday blocked a Republican push for a final vote on the Iran nuclear deal, which was negotiated by President Barack Obama and is uniformly opposed by congressional Republicans. \n\nThe procedural vote, which needed support from 60 senators to pass, fell four votes shy: 56-42. \n\nGOP Sens. Lindsey Graham and Rand Paul — who both oppose the Iran deal — missed the vote, thanks to Wednesday’s CNN-hosted debate at the Ronald Reagan Library in Simi Valley California. The measure fell two votes short last week. \n\nGOP leaders had hoped that two of those Democrats would buckle to pressure from constituents and flip their votes, but that was not the case. \n\nThe vote means the historic Iran deal, which lifts economic sanctions against Iran in return for it curbing its nuclear ambitions for the next several years, is set to be implemented despite majority votes in the House and Senate against it. \n\nFrustrated Republicans refused to give in and said they would force another vote on the issue this week. Senate Majority Leader Mitch McConnell planned a vote Thursday that would require Iran to recognize Israel and return American prisoners before U.S. sanctions against the country could be lifted. \n\n“The Republicans have lost,” Senate Democratic Leader Harry Reid said in response to McConnell’s latest maneuver. “We should move onto something else.” \n\nGOP senators argued that an international accord of this magnitude deserved a final up or down vote by Congress. \n\n“Do senators think it’s right for the world’s leading sponsor of terror to be able to maintain an American-recognized nuclear program?” McConnell asked, questioning the legitimacy of a Democratic filibuster of a resolution of disapproval against the deal. \n\nBut Reid countered that the vote last week was evidence that Democrats support the deal because they believe it will prevent Iran from getting nuclear weapons. \n\n“The outline he just gave has nothing to do with intellectual credibility. The agreement that was finalized last week dealt with one subject and one subject only. Whether or not Iran should have a nuclear weapon and the answer was resoundingly no,” Reid said. \n\nSenate Republican leaders have hinted there could be more votes this week before the Thursday deadline for congressional action against the deal. The House also plans votes this week.", "source": "KFRU-AM"}