{"published": "2015-09-10T17:11:26Z", "media-type": "News", "title": "Swedish group wants to fly Syrian refugees to Europe, avoiding danger", "id": "22ffa673-9889-45e9-b079-1105c0d1eca4", "content": "By Joseph D'Urso \n\nLONDON, Sept 10 (Thomson Foundation) - Instead of\nrefugees crossing stormy seas in a dinghy, then burrowing under\nborder fences and dodging hostile guards, a Swedish group wants\nthem to come to Europe in an easier, safer and cheaper way - by\nplane. \n\nRefugee Air wants to fly people to Sweden directly from \ncountries bordering Syria like Lebanon, Jordan and Turkey, where\nmost of the 4 million Syrians who have fled their homes and\ntheir country are living. Only a fraction have reached Europe. \n\n\"The first flight will be in the air before the first snow\nfalls over Stockholm this winter,\" the group said in a\nstatement. \n\nPeople fleeing Syria's civil war spend thousands of dollars\non the dangerous journey to Europe, far more than a plane ticket\ncosts, but airlines prevent refugees from boarding flights\nbecause of a 2001 EU directive. \n\nThe EU \"carriers' liability\" rule makes airlines responsible\nfor the costs - such as deportation - associated with passengers\nwho seek asylum when they arrive at their destination but have\ntheir claims rejected. \n\nThis means that even those with strong claims cannot travel\nby air to European countries which would grant them asylum\nbecause airlines do not want to take the risk. \n\nRefugee Air plans to start with a single flight to prove the\nscheme is possible, then hopes to encourage groups in other\nEuropean countries to do the same thing, said co-founder Emad\nZand, a Swedish businessman. \n\nMany refugees trying to reach Europe by other means have\ndied this year, either on flimsy, overcrowded boats or while\ntravelling overland. Police found a truck in Austria last month\nwhich contained the bodies of 71 refugees, many of them Syrian. \n\n\"WATCH PEOPLE DIE\" \n\n\"It's senseless, we can't just sit and watch people die.\nWe're going to show that it doesn't have to be this way,\" said\nZand. \n\nThe text of European Council directive 2001/51/EC states\nthat \"carriers' liability\" should not undermine refugees' right\nto flee persecution under the United Nations 1951 convention on\nthe status of refugees. \n\nBut in practice, governments delegate enforcement of the\ndirective to airlines, which bar people without visas from\nboarding flights because of the financial risk, said Zand. \n\n\"These policies push refugees into the hands of smugglers\nwho take advantage of their desperation,\" Zand said. He thinks\nthat by taking people with strong asylum claims directly to\nSweden, his group can bypass this bureaucratic hurdle. \n\n\"There is still enough room in the current legal framework\nfor people to get in by plane.\" \n\nAround 81,000 people sought asylum in Sweden last year, a\nbigger proportion of the population than in any other nation in\nEurope, with Syrians making up the biggest group. \n\n\"SLAP IN THE FACE\" \n\nHalf a million refugees may have arrived in Europe so far\nthis year, European Union chief executive Jean-Claude Juncker\nsaid on Thursday. EU officials want to introduce mandatory\nresettlement quotas, but some member states have resisted this. \n\nRefugee Air says it is working with NGOs to conduct \"careful\npre-screening\" of passengers to ensure travellers have a viable\nasylum claim in Sweden. The group will take financial\nresponsibility for those whose applications are rejected. \n\nThe organisation plans to charge for seats on the plane,\nnoting the cost will be far lower than what refugees would spend\non the deadly journey over land and sea, but will provide\nfinancial help to those who lack the funds for a ticket. \n\nThe group says it has financial backing from private and\ncorporate donors and is hoping to persuade an airline to lend a\nplane or to charter an aircraft. \n\nZand and co-founder Susanna Najafi were interviewed on\nSwedish television on Thursday morning, while Swedish\nbroadcaster Hans Rosling and Angus Macneil, a Scottish\nnationalist member of Britain's parliament, have supported the\ncampaign on Twitter. \n\n\"We want to show our solution works,\" Zand told the Thomson\nReuters Foundation. \"It's a slap in the face for everyone who\nsays it can't be done.\" \n\n(Reporting By Joseph D'Urso, editing by Tim Pearce. Please\ncredit the Thomson Reuters Foundation, the charitable arm of\nThomson Reuters, that covers humanitarian news, women's rights,\ntrafficking, corruption and climate change. Visit www.trust.org)", "source": "Mail Online UK"}