{"published": "2015-09-22T14:47:33Z", "media-type": "News", "title": "Germany’s Five-Year Yields Drop Below Zero as Equities Tumble", "id": "f71b89ee-ebbc-4da9-a245-dd3a6dbcadf8", "content": "(Bloomberg) -- European government bonds surged, pushing German five-year yields below zero for the first time in almost a month, as a slide in equity markets boosted demand for fixed- income assets. \n\nBenchmark German 10-year bunds led gains as European stocks fell the most in more than two weeks, underpinning the region’s benchmark sovereign securities. Speculation of extended stimulus from the European Central Bank increased after Executive Board member Peter Praet said on Monday that policy makers would “forcefully react” to defend their inflation objective. Since the ECB started its 1.1 trillion-euro ($1.2 trillion) bond- buying program in March, inflation in the currency bloc has slowed to a near standstill, compared with the ECB’s goal of just below 2 percent. \n\nThe U.S. Federal Reserve’s decision to refrain from increasing interest rates last week has bolstered the prospect of the ECB extending its “easy-monetary policy stance,” according to Rabobank International. \n\n“We are seeing softness in European equities and that provides a conducive backdrop for fixed income,” said Richard McGuire, head of European rates strategy at Rabobank in London. He added that “ongoing speculation of additional central-bank support in Europe and beyond, in the wake of the Fed’s steady rate decision, may be also playing a part here.” \n\nGermany’s five-year note yields declined five basis points, or 0.05 percentage point, to minus 0.015 percent at 3:15 p.m. London time. That’s the first time the yield has fallen below zero since Aug. 25. The 0.25 percent security due October 2020 climbed 0.285, or 2.85 euros per 1,000-euro face amount, to 101.34. The nation’s 10-year bund yield dropped eight basis points to 0.61 percent. \n\nSimilar-maturity French bond yields fell seven basis points to 0.99 percent, and those on Italy’s declined five basis points to 1.76 percent. \n\nDutch Auction \n\nThe Netherlands sold 2.8 billion euros of three-year debt at a record-low yield. The Dutch State Treasury Agency allotted the notes due in April 2018 at an average yield of minus 0.156 percent, down from minus 0.032 percent at a previous auction on June 9. Yields on Dutch two-year notes fell to a record low of minus 0.246 percent. \n\nA negative yield means investors buying the securities now will get back less if they hold them until maturity than they paid. \n\nThe primary focus for European bond markets will be economic data, according to Luca Cazzulani, senior fixed-income strategist at UniCredit SpA in Milan. \n\n“Right now we have to look at the data because that will tell you where the momentum is going,” Cazzulani said. “The ECB is saying they will intervene and do more if needed and that ultimately depends on the data.” \n\nAnalysts said a report on Wednesday will show that a gauge of euro-area manufacturing growth slowed this month. Markit Economics’ Purchasing Managers’ Index fell to 52 from 52.3 in August, according to a Bloomberg survey of economists. That would be the lowest reading since April.", "source": "La Repubblica"}