{"published": "2015-09-29T20:30:00Z", "media-type": "News", "title": "Tangoe Announces Appointment of New Chief People Officer", "id": "9f0bfebe-3fdc-44f0-a52c-64213a084f97", "content": "Tangoe, \n      Inc. ( NASDAQ:TNGO ), a leading global provider of Connection \n      Lifecycle Management (CLM) software and related services, today \n      announced the appointment of Manuel N. Sousa as its Chief People Officer \n      reporting to Al Subbloie, the company’s President and CEO. With a \n      workforce of over 2,300 employees worldwide, attracting and developing \n      top talent, and fostering a high performance culture have become key \n      differentiators for Tangoe and Sousa brings over 30 years of experience \n      to this new executive leadership role. \n\nSousa joins Tangoe following his most recent role as Chief Human \n      Resources Officer of OpenText Corporation, a multi-billion dollar \n      enterprise software company with over 8,000 employees globally, where he \n      led the implementation of workforce management strategies to improve M&A \n      integration, organizational performance and leadership pipeline programs \n      to scale the company’s aggressive growth. Prior to OpenText, he worked \n      at RBC Royal Bank, Canada’s largest bank, as the Head of Human \n      Resources, International Banking, and at T-Mobile USA, one of the \n      world’s largest wireless carriers, as Chief People Officer. In these \n      positions, Sousa led the development and execution of performance \n      management processes, compensation design, leadership development and \n      talent acquisition activities. Sousa also served as Chief Human \n      Resources Officer for Saks Fifth Avenue and Invesco Incorporated. \n   \n“We are very pleased to add such an experienced executive to our \n      leadership team. Manny brings a great wealth of human resource \n      experience in growing multi-billion dollar organizations globally, which \n      ideally positions him for this role,” said Al Subbloie, president and \n      CEO of Tangoe. “We believe that his strong track record in building high \n      performance organizations that attract, develop and retain talent will \n      position Tangoe for its next stage of growth.” \n\nAbout Tangoe \n\nTangoe ( NASDAQ:TNGO ) is a leading global provider of Connection \n      Lifecycle Management software and services to a wide range of global \n      enterprises and service providers. The company's Connection Lifecycle \n      Management platform, Matrix, is an on-demand suite of software and \n      services designed to turn on, track, manage, secure, and support various \n      connections in an enterprise's connection lifecycle, including mobile, \n      fixed, machine-to-machine, cloud software and services, enterprise \n      social, and IT connections. Additional information about Tangoe can be \n      found at www.tangoe.com . \n\nTangoe is a registered trademark of Tangoe, Inc. \n\n\n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150929006471/en/", "source": "Concord Monitor"}