{"published": "2015-09-18T22:08:00Z", "media-type": "News", "title": "Expanded scope of SPIE meeting reflected in new Defense and Commercial Sensing name", "id": "7cad4ee0-98c4-4e15-941e-d5ebdfbc6aaa", "content": "The new name of Defense and Commercial Sensing for a long-standing conference and exhibition sponsored by , reflects the continuing outgrowth of the event’s technologies into new applications and markets. For 2016, SPIE has broadened the scope to better serve sectors as wide-ranging as oil and gas exploration, healthcare, homeland defense, food safety, terrorism countermeasures, and the Internet of Things, and is accepting abstract submissions through 5 October.\n\nBELLINGHAM, Washington, USA (PRWEB) September 17, 2015 \n\nThe defense and security conference sponsored by , has for more than 20 years been the cornerstone event for optics and photonics researchers and engineers in the field. The meeting’s continuous growth into new areas reflects the evolution and development of these technologies — infrared, laser, terahertz, multi- and hyperspectral imaging, to name a few — as they quickly spin out into new applications for commercial products and scientific research capabilities.\n\nFor 2016, the event is expanding again, with a new name reflecting enhanced content and expanded markets.\n\nNow called SPIE Defense and Commercial Sensing (DCS), the meeting will include a major exhibition and two parallel, co-located conferences: Defense and Security (DS) and Commercial + Scientific Sensing and Imaging (CSSI). DCS 2016 will run 17-21 April in the Baltimore Convention Center.\n\nIn line with the rapid growth of underlying technologies into new commercial and scientific markets, SPIE has broadened the scope of topics across applications such as oil and gas exploration, healthcare, wearable sensors, the Internet of Things, autonomous vehicles, and drones; for markets as wide-ranging as homeland defense, food safety, terrorism countermeasures, machine vision, robotic vision and imaging, precision agriculture, and standoff detection. \n\n“SPIE has always focused on promoting real-world applications of technologies in optics and photonics,” said Andrew Brown, SPIE Senior Director. “The name change reflects the natural expansion into and cross-fertilization of defense and security technologies with commercial and scientific arenas – in fact, many of these applications were already being addressed at the event.”\n\nWhat is new, Brown said, is that “we are providing a higher level of focus to aid with the transition and adoption of mature technologies into new markets.” \n\nThe scope of the meeting creates a rich multidisciplinary mix, organizers say.\n\nLei Tian (University of California, Berkeley) is chair of a new conference on Computational Imaging with interdisciplinary connections among optics, sensor designs, signal processing, and algorithms. \n\n“In conventional imaging, one of the prime goals is to design ‘perfect’ lenses, mirrors, etc., to get an ideal replica of the object or scene of interest,” Tian said. “This design philosophy results in many well-known limitations. For example, one has to give up resolution for wide field of view in both photography and microscopy.”\n\nComputational imaging is a new design frontier, he said, “that emphasizes the tight integration of physical optical design and computational post-measurement processing to yield imaging capabilities far beyond what conventional imaging can achieve. Applications are many and varied, in fundamental science as well as biomedical, industrial, defense, and security.”\n\nLong-time attendee, exhibitor, speaker, and conference chair Eric Kelmelis (EM Photonics) is organizing another new conference.\n\n“Improvements in sensor systems are constantly extending the distance from which we can image objects,” Kelmelis said. “The new Long-Range Imaging conference will address sensors, optics, systems, processing, and applications related to imaging from far away.”\n\nAmong high-level speakers booked for DCS 2016 is plenary speaker Bradford Tousley, Director of DARPA’s Tactical Technology Office. Previously, Tousley was responsible for unmanned airborne sensor technology, advanced imaging science, space situational awareness and sensors, and software development at Logos Technologies. He has held other positions at DARPA, the National Reconnaissance Office, U.S. Army Armor (Cavalry) and Acquisition, and the U.S. Military Academy at West Point.\n\nThomas George (ChromoLogic LLC), chair of the well-attended conference, noted the high-quality keynote talks engaged by his session chairs.\n\nAmong them, Colonel (Ret.) Ron Poropatich, executive director of the Center for Military Medicine Research, professor, and senior advisor for telemedicine at the University of Pittsburgh Medical Center, will be the keynote speaker for a session on Smart Service Systems for M-Health and Telemedicine, chaired by Wolfgang Fink of the University of Arizona, Visual and Autonomous Exploration Systems, and Caltech. \n\nAbstract submissions will be accepted through 5 October. New conferences being offered are: \n\nMore information is at http://www.spie.org/DCS.\n\nAbout SPIE\n\nSPIE is the international society for optics and photonics, an educational not-for-profit organization founded in 1955 to advance light-based science and technology. The Society serves nearly 264,000 constituents from approximately 166 countries, offering conferences and their published proceedings, continuing education, books, journals, and the SPIE Digital Library in support of interdisciplinary information exchange, professional networking, and patent precedent. SPIE provided more than $4 million in support of education and outreach programs in 2014. SPIE is a Founding Partner of the International Year of Light and Light-based Technologies and a Founding Sponsor of the U.S. National Photonics Initiative. http://www.spie.org\n\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb129700", "source": "WTRF"}