{"published": "2015-09-14T01:01:40Z", "media-type": "News", "title": "The NFL's New Extra Point Rule Is Great", "id": "49fc55a4-0585-4b5f-a373-551bcc83e8ca", "content": "For all the worried exegesis of the NFL’s corn-fed rulebook this offseason, not much of it was aimed at football’s best rule change in years: the new extra point. Read mor… \r \nFor all the worried exegesis of the NFL’s corn-fed rulebook this offseason, not much of it was aimed at football’s best rule change in years: the new extra point. \n\nFor this season, the NFL moved the line of scrimmage for extra point tries to the 15-yard line; defenses would also be awarded two points for returning a blocked kick or turnover on a two-point try. Last year, in 1230 extra point attempts, there were just eight misses—that’s a make-rate of 99.3 percent. This year, through Sunday’s afternoon games, there have been 63 attempts (with six two-point attempts) and three misses, but the Chargers, Jaguars, and Texans. (We also got a 48-yard attempt in Browns-Jets, for the longest extra point attempt in NFL history.) That’s 95.2 percent, right around where the number was predicted before the season. That makes a bigger difference than it sounds like it should, at least while watching the games. \n\nWe’ve known since the rule was announced what the numbers look like: kickers made 91.6 percent of their kicks from 32 yards in the last 10 years, 94.4 percent in the last three years, and 96.7 last year. Here’s a chart from an article by FiveThirtyEight’s Ben Morris predicting how kickers will adapt to the change: \n\nAll of this math is correct, with a minor allowance for the fact that penalties from the 32-yard range affect a kick’s chances much more dramatically than from the old 19-yard range. And so far, the change hasn’t been enough to shift calcified football stratagem, and likely won’t. The Chargers even elected to kick while down five points in the fourth quarter, after eating a five-yard penalty that put them at the 7. \n\nBut while pushing the kicks back far enough to incentive two-point tries into common use would be great, the stats don’t entirely pick up a separate shift here, which …", "source": "MyInforms"}