{"published": "2015-09-21T13:20:42Z", "media-type": "News", "title": "No bail for 1985 Glen Ellyn murder suspect", "id": "07028e47-48ad-4363-b1dd-78ff8d064ae9", "content": "The 62-year-old suspect in the 1985 slaying of Kristina Wesselman was ordered held without bail this morning. \n \nMichael R. Jones faces two counts of murder and one count of aggravated criminal sexual assault stemming from the July 21, 1985 killing of 15-year-old Kristina, who lived near Glen Ellyn. \n \nJones appeared in court in a yellow prison jumpsuit amid extreme courthouse security; nine sheriff's deputies were present in the courtroom. \n \nThe 15-year-old sophomore at Glenbard South High School was attacked in broad daylight about 4 p.m. on a path that was a popular shortcut for children to get to a Jewel store at Butterfield Road and Route 53 from their Valley View subdivision. Her body, nude from the waist down, was found in a pile of leaves by a sheriff's deputy about 11 a.m. the following day. She had been stabbed eight time and sexually assaulted, authorities said. \n \nAuthorities say Jones, of Champaign, was linked to the crime through a DNA sample he was required to give after pleading guilty to a sexual assault in downstate Champaign County. His DNA matched samples on file in a state database. \n \nJones was on parole at the time Kristina was murdered. He had served seven years of a 10- to 20-year term for an August, 1977 Schiller Park sexual assault. In that case, authorities said he ran his car into a 27-year-old bicyclist, knocking her to the ground. He then forced her into the car, bound her wrists and put a wool stocking cap over her head. He then drove to a family member's home in Schiller Park, and assaulted her there. \n \nDuPage County Judge Daniel Guerin denied Jones' bail this morning. He is scheduled to be arraigned Oct. 13 before Judge John Kinsella. \n \nThe 30-year-old cold case broke Sept. 10, when the DNA match came to light. A search warrant was conducted at his Champaign address on Friday, police said, and Jones was arrested Sunday. \n \nChampaign County court records indicate Jones was required to give blood, saliva or tissue samples and ordered to pay a fee for DNA analysis after he pleaded guilty July 2 to a felony domestic battery charge. Four years ago, in an effort to reinvigorate their investigation, authorities for the first time disclosed that they believed Kristina's killer removed a pearl ring from her body after the slaying.", "source": "Chicago Daily Herald"}