{"published": "2015-09-14T01:31:09Z", "media-type": "News", "title": "Wedding couple ‘trying to move on’", "id": "10f166d6-b1ac-490f-9f0e-a882e452fe56", "content": "Tenille and Adam Bradley’s wedding in Camden took a shocking turn when a guest tried to run over the bride and a number of guests at the end of the evening.  Source: Supplied  \n         \nIT was supposed to be Tenille Eyles and Adam Bradley’s happiest day. \n\nThe couple had just got married in front of family and friends and were posing for photographs near a fountain, at the Harrington Grove Country Club in Camden, south of Sydney when the unthinkable happened. \n\nA 55-year-old partner of a guest was “agitated” after an argument, and drove his vehicle towards the bridal couple and other guests. \n\nIt is alleged the man became involved in an argument with two female guests at the reception about 9.30pm Saturday evening, before getting into his Mazda 3 and driving at them. \n\nGuests scrambled out of the way, with some diving into the garden, but the car missed all of them. \n \nA guest then frantically attempted to take the keys from the ignition — but the man then reversed at high speed towards another group, which included the bride and groom. \n\nLuckily again, no one was hit and the man fled the venue. He was arrested while walking along a footpath on Camden Valley Way at midnight. \n     \n Tenille Eyles and her father at her wedding to Adam Bradley on Saturday.  Source: Supplied  \n         \n Tenille and Adam Bradley didn’t let the incident ruin their wedding day.  Source: Supplied  \n    \nMrs Bradley posted several happy pictures of the day on her Facebook page thanking everyone for their support \n\nOne friend thanked her for allowing her to be part of her “special day” although there was no mention of the dangerous scene. \n\nWedding photographer Warren Donovan told The Daily Telegraph the couple were “stressed” when the incident happened. \n\n“Tenille and Adam are good. They were a bit stressed when it happened but everyone helped to calm them down and we got back into the party. \n\n“I think now they just want to get on with things and enjoy being newlyweds.” \n\nThe man was charged with driving in a dangerous manner, menacing driving, disqualified driving, and possessing a prohibited drug. \n\nHe was granted conditional bail, to appear at Picton Local Court on 29 September 2015. \n Originally published as Wedding couple ‘trying to move on’", "source": "Geelong Advertiser"}