{"published": "2015-09-14T12:29:00Z", "media-type": "News", "title": "Frost & Sullivan Applauds Cloudnexa's vNOC Platform for Meeting Client Expectations for a Robust Cloud Management Platform", "id": "4599d354-b895-4648-9e57-82ca6c91c2c5", "content": "SOURCE Frost & Sullivan \n\nvNOC provides customers with a clear and intuitive interface, enhanced visibility and the control needed across their AWS environments \n\nMOUNTAIN VIEW, Calif., Sept. 14, 2015 /PRNewswire/ -- Based on its recent analysis of the cloud management services market, Frost & Sullivan recognizes Cloudnexa with the 2015 North American Frost & Sullivan Award for Competitive Strategy Innovation and Leadership. Cloudnexa showed great vision in identifying a need among customers to better manage their Amazon Web Services (AWS) infrastructure resources. Customers often require management assistance that allows them to aggregate visibility and control of their AWS deployments on a single management platform. In response, Cloudnexa developed a utility-based, fully managed cloud management platform, vNOC. \n\nPhoto - http://photos.prnewswire.com/prnh/20150911/265868 \n\n\"Cloudnexa has designed its vNOC Management Platform as a stateless, single-page application that presents a global view of the customer's AWS architecture, regardless of the number of AWS accounts the customer maintains,\" said Frost & Sullivan Industry Analyst, Karyn Price. \"The platform is heavy in features, but light in density.\" \n\nMany competitors in the cloud management space have focused on the actual infrastructure resources they deliver instead of the management of those resources. However, if the management platform is not intuitive, or does not feature the desired functionality or automation, it may prove less effective, as the cloud management platform is the primary interface that the customer has with the cloud. \n\nvNOC enhances the user's interaction with AWS service offerings through its automated functionality for provisioning and management of services; more robust search, sort and filtering capabilities; as well as enhanced reporting abilities. vNOC enables customers to manage multiple AWS accounts by aggregating them on a single management platform, which gives them visibility across geographies and business units. \n\nFurthermore, the vNOC platform has value-added general management capabilities through the use of historical data to improve future performance. Cloudnexa places no limitations on the amount of data that can be reviewed and analyzed in order to improve the customer's cloud configuration and performance. \n\nUnlike several other platforms that require the user to switch between different screens to view more than the basic dashboard information, Cloudnexa's dashboard presents details about many different aspects of the cloud service, from instances deployed to alerts to usage and billing, right on the homepage. The dashboard is also graphically pleasing, easy to navigate and highly customizable, making it favorable within the cloud management market. \n\nCloudnexa's utility-based pricing model for value-added, managed cloud services such as vNOC is unique in the market today. While peers are signing longer-term contracts that entail monthly recurring revenues for services rendered, Cloudnexa has both free and self-service versions of its vNOC product. Cloudnexa is one of very few providers that have been able to effectively extend the consumption or utility-based pricing model to managed services such as billing and management support.  \"Leveraging its rich experience as a systems integrator, Cloudnexa has systematized its processes for on-boarding new customers, making the entire on-boarding process smooth and easy,\" observed Price. \n\nSince inception, Cloudnexa has grown to manage more than 3 million customer instance hours per month on the AWS platform through its vNOC cloud management platform. Its 100 percent focus on a single provider has allowed Cloudnexa to hone its service offering to fully deliver on a utility cloud computing model, even for cloud management services. \n\n\"We have always strived to deliver the value-added tools and services clients need to be successful in the cloud.  If we can continually deliver innovative solutions to this marketplace, which is growing exponentially, success will surely follow,\" said Joel Davne, CEO and Founder of Cloudnexa. \"Receiving this award from an organization with such deep forward-looking market expertise further validates our technology and business strategy.\" \n\nEach year, Frost & Sullivan presents this award to the company that has leveraged competitive intelligence to successfully execute a competitive strategy that results in stronger market share, competitive brand positioning and customer satisfaction. \n\n\"Competitive advantage can be derived by identifying and addressing unique, unmet needs for target customers, as Cloudnexa has done in the Cloud Management Services market,\" said Frost & Sullivan Global President & Managing Partner, Krishna Srinivasan. \"Frost & Sullivan is pleased to recognize Cloudnexa for its strategic focus in creating an innovative solution for effective AWS resource deployment, and thereby strengthening its competitive position in the market.\" \n\nFrost & Sullivan Best Practices Awards recognize companies in a variety of regional and global markets for demonstrating outstanding achievement and superior performance in areas such as leadership, technological innovation, customer service and strategic product development. Industry analysts compare market participants and measure performance through in-depth interviews, analysis and extensive secondary research to identify best practices in the industry. \n\nAbout Cloudnexa \n\nFounded in 2012, Cloudnexa deploys and manages cloud infrastructure for clients who want to realize the full power of cloud computing. With proven experience in deployment and management of scalable, secure cloud infrastructures across public and government clouds, Cloudnexa provides the necessary value-added services customers need to realize the true cost savings and technical value proposition of the cloud. As an AWS Channel Reseller Partner and APN Premier Consulting Partner, Cloudnexa has been leading the Cloud Service Provider (CSP) experience with its revolutionary cloud management tool (vNOC) and managed services solution on Amazon Web Services (AWS). For more information on Cloudnexa, visit www.cloudnexa.com. \n\nAbout Frost & Sullivan \n\nFrost & Sullivan, the Growth Partnership Company, works in collaboration with clients to leverage visionary innovation that addresses the global challenges and related growth opportunities that will make or break today's market participants. \n\nOur \"Growth Partnership\" supports clients by addressing these opportunities and incorporating two key elements driving visionary innovation: The Integrated Value Proposition and The Partnership Infrastructure. \n\nThe Integrated Value Proposition provides support to our clients throughout all phases of their journey to visionary innovation including: research, analysis, strategy, vision, innovation and implementation. \n\nThe Partnership Infrastructure is entirely unique as it constructs the foundation upon which visionary innovation becomes possible. This includes our 360 degree research, comprehensive industry coverage, career best practices as well as our global footprint of more than 40 offices. \n\nFor more than 50 years, we have been developing growth strategies for the global 1000, emerging businesses, the public sector and the investment community. Is your organization prepared for the next profound wave of industry convergence, disruptive technologies, increasing competitive intensity, Mega Trends, breakthrough best practices, changing customer dynamics and emerging economies? \n\nFrost & Sullivan Contact: \n\nMireya Espinoza \n\nP: 210. 247.3870 \n\nF: 210.348.1003 \n\nE: mireya.espinoza@frost.com \n\nCloudnexa Media Contacts: \n\nLisa Brown \n\nVice President, Marketing \n\nP: 215.346.7878 \n\nElaine Ordiz \n\n10Fold \n\nP: 415.800.5375 \n\n  \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/frost--sullivan-applauds-cloudnexas-vnoc-platform-for-meeting-client-expectations-for-a-robust-cloud-management-platform-300141899.html \n\n©2015 PR Newswire. All Rights Reserved.", "source": "WFMJ 21 - TV"}