{"published": "2015-09-17T05:17:20Z", "media-type": "News", "title": "Firm Moves to Deepen Entrepreneurs' Capacity", "id": "56666f5c-b224-482e-a80c-e65ede50cdae", "content": " Majestically Rare Limited \n\nMajestically Rare Limited has concluded plans to organise a high impact business growth workshop for business managers and entrepreneurs. \n\nThe firm noted that due to the overwhelming interest in   the training, the event will hold in Lagos on September 23, 2015. \n\nThe Chief Executive Officer of  Majestically Rare Limited, Mrs Rita Okoye said: “This highly sort after workshop allows business managers and entrepreneurs from a diverse range of experiences to knock heads, learn and discover new marketing techniques.  Participants learn from real examples and case studies that demonstrate how to put the latest marketing techniques into practice and gain results. \n\n“In addition they engage with likeminded delegates and work in teams to gain more knowledge.  By the end of the workshop participants  would have a deeper understanding of marketing and clear strategies that they can start implementing immediately.” \n\nOkoye, who has been in marketing for over 20 years, said she was passionate and committed to helping businesses grow through applying effective marketing strategies. She said that over 80 per cent of businesses fail because of ineffective marketing strategies, adding that some businesses have no plan at all. \n\n“It is  no wonder they fail, especially if due to lack of planning  because their competition are always on the lookout to grab market share when they are not looking. There are always great reviews and feedback with the high impact business growth workshop because it addresses the basic marketing loop hole expressed in the industry. \n\n“The delivery is always captivating and engaging and makes delegates think of the box which allows for creative thinking and innovation. In addition, the brain storming sessions really create a collaborative environment,” she added.", "source": "This Day Online"}