{"published": "2015-09-24T17:14:57Z", "media-type": "News", "title": "Remington College Provides More than 1,200 Free Back-to-School Haircuts in August", "id": "e6ccf43c-fc36-4d72-9c12-d9c467127d2f", "content": "Remington College “Cuts for Kids” has now provided \r\nmore than 15,000 free back-to-school haircuts\r  \nHeathrow, Fla. – (Sept. 24, 2015) – Remington College has passed a major milestone with its annual Cuts for Kids promotion, which provides complimentary back-to-school haircuts for kids. This summer, Remington College cosmetology programs provided 1,247 free haircuts through Cuts for Kids, pushing the total number past 15,000 haircuts provided since the inception of the program. \n  \nDuring the month of August, Remington College students and instructors provide free haircuts to students 17 years old and younger. The goal is to send kids back to school looking and feeling their best – and saving their parents some money. \n  \n“We’re very proud of the effort that all our students and instructors have put into Cuts for Kids,” said Bob Lutz, Vice President of Remington College. “It’s a real milestone that we’ve now been able to provide our services at no charge more than 15,000 times.” \n  \nThe Remington College Cosmetology Programs also collected school supplies, which were donated to local schools. \n  \nThe Remington College Cosmetology Program takes a hands-on approach to teaching students the art of hair, skin and nail care. Cuts for Kids allows students, under the supervision of instructors, to have the opportunity to work with real clients in a salon setting. The program is available at eight Remington College campuses: Houston (two locations), Cleveland, Mobile, Lafayette, Dallas, Columbia (South Carolina) and Honolulu. \n  \nFor more on the Remington College Cosmetology Program, visit remingtoncosmo.com or call \n1-800-448-6405. \n  \nAbout Remington College:  Non-profit Remington College, headquartered in Heathrow, FL operates 16 college campuses throughout the United States offering career focused diploma, bachelor and associate degree programs in a variety of career fields. For more information, please visit remingtoncollege.edu . For the latest news about Remington College, visit  facebook.com/remingtoncollege . Remington College does not discriminate on the basis of race, color, national and ethnic origin in administration of its educational policies, admissions policies, scholarship and loan programs and other school administered programs. \n  \nMedia contact: \n  \nFrank Wolff \nWellons Communications \n407-339-0879 office \n407-637-6000 cell \nFrank@wellonscommunications.com \n  \n Contact  \nRemington College \n Frank@wellonscommunications.com", "source": "Press Release Ping"}