{"published": "2015-09-16T17:01:05Z", "media-type": "News", "title": "City approves budget, levy", "id": "08082b3d-9abf-45d2-8dfb-c135d9b4cb5e", "content": "WAHOO – A valuation that is largely unchanged and a reduction in debt service had led the City of Wahoo to a new tax levy rate that is about the same as the past year. \n  \nThe Wahoo City Council met Sept. 10 and approved the budget and levy for the new fiscal year. \n \nThe new levy is .58372, or about 58 cents per $100 of property valuation. The new levy is a .9 percent drop from this past year’s rate of .58912. \n \n“Your taxes are going to change very minutely, as far as the city is concerned,” Wahoo City Administrator Melissa Harrell said. \n \nHarrell told the council last week that property valuation inside city limits did increase from $242,006,114 in 2014 to $249,865,261 in 2015. \n \nBut, about $7,747,000 of that valuation came from growth and new developments. \n \n“So, not really much changed to existing homes,” Harrell said. \n \nUsing an average increase of 1.2 percent valuation, property owners can expect to see a few more dollars coming out of their pocketbooks this coming year. \n \nOn a $100,000 property, 2014 taxes were $589.12. Calculating the new levy and valuation, 2015 taxes on that same property will go up to $590.73. \n \nOther than property taxes, revenue for city operations comes from local sales tax, state and federal highway allocations, occupation taxes and local fees. \n \nPrior to the approval of the levy, the council also approved the new fiscal year budget. \n \nHarrell said the bottom line of the budget does take into account that the city has commitments to the costs for a trail project and the Safe Route to School project. The total expense line on the budget rose from the estimated $5,222,836 this past year to a budgeted $7,362,956 in 2015-2016. \n \nOne of the changes to the budget include adding wages for a new position in the street department. \n \nHarrell said there would be some adjustments to a part time, seasonal position in the street department and a new full time position would be created. \n \nDue to annexations and new developments over the past decade, Harrell said the number of streets that need to be maintained has increased. \n \n“We’ve added a lot more streets, without really adding more people,” she said. \n \nMoney for a new vehicle has also been budgeted. The rescue department has requested the purchase of a new ambulance this year to replace its oldest unit.", "source": "Wahoo Newspaper"}