{"published": "2015-09-01T13:19:52Z", "media-type": "News", "title": "Mailbag: Who Starts At RB? Is The Fifth WR On The Roster Right Now?", "id": "42e09008-0a80-420b-8988-8f3ef67be8cf", "content": "PAUL MEEK\n\nSAN ANGELO, TX\n\nI was impressed with the acceleration and cutting D-Mac showed (albeit limited number of runs) in this last game. On the heels of this performance, how do you feel the RB competition shakes out?\n\nDavid: Am I alone in thinking that it really and truly doesn’t matter? No matter who the Cowboys send out for the first snap on Sept. 13, he isn’t going to get 392 carries like DeMarco Murray did last fall. I really do believe this will be a committee. Maybe McFadden will lead the team in carries, maybe it’ll be Randle – maybe there’ll even be a new running back in the mix. But multiple ball carriers are going to have a chance to make an impact, one way or another.\n\nBryan: I have gone on record in saying that I believe that Darren McFadden CLINT BOYTE\n\nLEXINGTON, KY\n\nWith no single receiver really stepping up this offseason to grab the No. 5 spot, could you see the Cowboys bringing in someone like Ryan Broyles in a case of maybe he just was never really given a chance?\n\nDavid: I can’t say for sure whether the Cowboys have looked at Broyles – sorry, Sooner fans. That said, I won’t be remotely surprised if the Cowboys’ No. 5 receiver is not currently with this team. None of the guys on the roster have done a great job of stepping up and claiming the job, in my opinion. Jason Garrett and Stephen Jones love to talk about how they’re always looking to improve the roster. If there’s a guy out there who’s a step up from the current options, it’s a safe bet they’ll take a look.\n\nBryan: I am going down that road that the 5th receiver on this club is on another team. As far as it being Ryan Broyles – I don’t think that’s the case. What needs to happen is for this front office located a guy much like they had in Laurent Robinson. To make that happen, this front office might have to flip a draft pick, which I would be willing to do. ©2014 Dallas Cowboys. All rights reserved. Do not duplicate in any form without permission of the Dallas Cowboys.", "source": "Dallas Cowboys"}