{"published": "2015-09-08T13:34:35Z", "media-type": "News", "title": "Kaiser Permanente Launches Newest Advertisements in Thrive Campaign", "id": "c61a305e-2630-4b1b-82ab-d1fb3116bec7", "content": "OAKLAND, Calif., Sept. 8, 2015 /PRNewswire/ -- For Kaiser Permanente, health is not an industry, it is a lifelong cause. Pursuing that cause has often required forging a new road, one that improves upon the old, worn path followed by other health care organizations. It has meant going against the flow. But Kaiser Permanente's difference also has a purpose — to support the total health of each of its more than 10 million members. \n \nThese are the themes of Kaiser Permanente's latest installment of its award-winning Thrive advertising campaign , which debuts today across TV, radio, online, print and outdoor platforms in markets throughout the country. In addition to advancing the ideal of total health, the ads tell the story of where the pioneering health care organization started, where it has been, and where it plans to go. \n \n\"The new Thrive campaign illustrates our core beliefs as an organization and represents our goal of a long, healthy, thriving life for each of our members and for the communities we serve,\" said Christine Paige, senior vice president of Marketing and Digital Services at Kaiser Permanente. \"The ads focus on Kaiser Permanente's 70 years of leadership in promoting total health, and reinforce our promise to be the trusted health partner for our members.\" \n \nThe ads focus on Kaiser Permanente's dedication to preventive medicine, and the goal of keeping its members healthy by being accessible to them anytime, anywhere. The historical images of Henry J. Kaiser featured in one ad are poignant and illustrate how Kaiser Permanente today remains true to its roots, and continues to grow and evolve to meet the demands of the modern consumer. \n \nThe stories told in the campaign, now in its 12th year, feature individuals and families at all stages of life – of varying age, race, abilities and background – a fitting reflection of Kaiser Permanente's vibrant and diverse membership, now more than 10 million strong. The range of individuals featured in the TV spots provides context for Kaiser Permanente's steadfast commitment that health care should be affordable and accessible for every person and every family. The stories also convey that even as Kaiser Permanente becomes the leader in leveraging technology to maximize quality and convenience, our care will remain as personalized as ever. \n \nThe Thrive campaign has been widely recognized and emulated throughout the marketing and advertising space. Over the past decade, the campaign has garnered eight Gold Healthcare Public Relations and Marketing Association awards, and more than 11 ADDY Awards in various categories. \n \nThe multi-year Thrive campaign was created in partnership with advertising agency Campbell Ewald, which has worked with Kaiser Permanente since the rollout of the first Thrive ads in 2004. \n \nTelevision, print and outdoor versions of the ads will appear in English and Spanish throughout the states where Kaiser Permanente provides health care services: California, Hawaii, Colorado, Oregon, Washington, Virginia, Maryland, Georgia and the District of Columbia. \n \nAbout Kaiser Permanente \nKaiser Permanente is committed to helping shape the future of health care. We are recognized as one of America's leading health care providers and not-for-profit health plans. Founded in 1945, Kaiser Permanente has a mission to provide high-quality, affordable health care services and to improve the health of our members and the communities we serve. We currently serve more than 10 million members in eight states and the District of Columbia. Care for members and patients is focused on their total health and guided by their personal physicians, specialists and team of caregivers. Our expert and caring medical teams are empowered and supported by industry-leading technology advances and tools for health promotion, disease prevention, state-of-the-art care delivery and world-class chronic disease management. Kaiser Permanente is dedicated to care innovations, clinical research, health education and the support of community health. For more information, go to: kp.org/share . \n \nFor More Information \nMarc Brown, 510-271-6328 \nmarc.t.brown@kp.org \n \nLogo - http://photos.prnewswire.com/prnh/20130718/SF49717LOGO \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/kaiser-permanente-launches-newest-advertisements-in-thrive-campaign-300138471.html \n \nSOURCE  Kaiser Permanente \nhttp://www.prnewswire.com/news-releases/kaiser-permanente-launches-newest-advertisements-in-thrive-campaign-300138471.html", "source": "International Business Times"}