{"published": "2015-09-27T03:36:43Z", "media-type": "News", "title": "Five for Families: Films that tell emotional true stories", "id": "d53f3623-8de8-4844-88cd-0277d6788dfa", "content": "Here are five movies from various platforms families may want to consider. Because not all are appropriate for younger children, age recommendations are included. \n  \nHollywood often turns to real-life events as subject matter to take to the big screen, as with the recently released \"Everest.\" Here are five films based on true stories that carry emotional impact. \n \nIn theaters: 'Everest' \n \nA group of climbers gets caught in a severe snow storm while on Mount Everest. MovieGuide.org calls the film “a stunning, thrilling, tragic true story.” The website states that while anyone familiar with the real-life events that inspired the film knows it “isn’t a totally happy movie,” the film still contains “inspiring moral points” as “people risk their lives, love their families and try to inspire others.” Objectionable content is minimal but intense peril is shown throughout, so caution is advised. Ok.com recommends the film for viewers ages 13 and older. \n \nAmazon Instant: 'Miracle' \n \nA hockey coach leads the U.S. team to an unlikely victory against the Soviet Union during the 1980 Winter Olympics. While the story is one of hard work, Parent Previews warns that the film contains “beer guzzling young adults, some mild locker room banter and profanities, as well as hard on-ice hits.” Ok.com recommends the film for viewers ages 8 and older. \n \nRedbox: 'McFarland, USA' \n \nA coach at a predominately Latino high school in 1987 beats the odds and turns the cross country team into one of the best. Catholic News Service’s John Mulderig calls it an “uplifting tale that can be enthusiastically recommended for moviegoers of almost all ages.” Ok.com recommends the film for viewers ages 8 and older. \n \niTunes: 'October Sky' \n \nThe first Sputnik launch in the 1950s inspires a young man to build his own rocket. Common Sense Media says the film is “about following your dreams, no matter how unachievable they might feel,” but cautions that much of the film centers on a “tense father-son relationship.” Ok.com recommends the film for viewers ages 8 and older. \n \nAmazon Instant: 'The Rookie' \n \nA high school baseball team encourages its coach to try out for the major leagues. According to The Dove Foundation , viewers will find themselves cheering for the coach’s success, and while “there is some mild language in the film ... overall this is a very good film with positive elements in it.” Ok.com recommends the film for viewers ages 7 and older.", "source": "OurTownJohnstown.com"}