{"published": "2015-09-24T08:00:00Z", "media-type": "News", "title": "Baltimore bike shop setting itself apart, earning national acclaim", "id": "5e7a035e-3a52-4133-afb7-564423d6b1b0", "content": "Stu Waring's bike-fitting area in the back of Parvilla Cycle & Multisport could be confused with a doctor's office or a physical therapy center. \n\nThere's a skeleton. There's a foldup massage table. And then there's Waring, guiding his clients through an array of movements while discussing the health of their body. \n\nBut Waring isn't a doctor or a physical therapist. He's a bike fitter, who adjusts bikes by discovering riders' best possible position on the cycle for comfort and speed. \n\nIt's Waring and this back area that has made Parvilla Cycle & Multisport a premier bike shop on the East Coast. After just four years in operation, the store has been ranked one of the top 50 bike shops in the country by Active Times and was one of six nominated for best pro road shop in the nation by Interbike Awards. \n\n\"This is the store,\" said Waring, who started the shop with Iain Banks. \"Fitting is our store and why we are doing as well as we are four years into a brand-new business.\" \n\nWhile the store has garnered a strong local presence for its bikes and accessories, riders from around the country flock to the shop to get a fitting. Waring and his colleagues said he is typically booked about four weeks in advance for his fittings. \n\nHe does one fitting a day Monday through Friday. Each one takes about four hours and costs $350 for the standard package and $500 for the premium. \n\n\"1/8Waring's3/8 one of the best fitters on the East Coast, so that brings in a broader range of customers,\" service manager Joseph Sikorski said. \n\nBike fitting wasn't Waring's first job, though. He got his degree in naval architecture and spent about 20 years in the industry, but he later got his fitting education through Retul, which is based in Boulder, Colo. \n\nHe has since become an instructor for the company and is its only fitter on the East Coast. Waring brings his engineering background to help his understanding of bikes, but he also enjoys studying the body and said he has picked up on things from chiropractors and physical therapists. \n\nIt's Waring's blend of the two aspects that allows him to best suit his clients. He can tell when customers need to correct their back problems, but rather than do it himself, he recommends them to a specialist and then has them come back once they are healthy. \n\n\"There are fitters out there that will make the computer look good,\" Waring said. \"They'll work the numbers and do all kinds of stuff and it looks good on the screen, but they get out there and they are jacked. The problem is it's the hips or the knees. They don't know enough or care enough about the body.\" \n\nThat's where Waring looks to set himself apart. And once he has a healthy client, he is able to turn to his machinery and knowledge to help improve a person's position on a bike. \n\nSituated in the back room, Waring has a \"Guru Dynamic Fit Unit,\" which amounts to being a machine bike that is adjustable. Waring said he has used it roughly 2,000 times and credits it for generating about $350,000 a year, thus deeming it his \"printing press.\" \n\nSurrounded by TV monitors, the machine allows Waring to adjust his client's position on the bike while still riding instead of having to manually change the bike over and over until the correct spot is found. \n\nHis background and equipment recently helped get an individual with cancer in his neck into a position where he can ride. He was previously having trouble looking up because of his limited mobility, but his position has changed that and he asked Waring whether he could go for a ride to coach him. \n\nWaring doesn't coach anymore, but instead, he plans on just enjoying a nice day with him. \n\n\"We are just going to go and have a coffee and have a ride some time,\" Waring said. \"I get a kick out of that. That, to me, is what it's all about.\" \n\nIt's that family attitude, beyond just the fitting, that has helped build the store, the employees said. \n\nBanks' wife, Sarah, who co-owns the store with Waring, said it comes down to knowing customers' names and chatting with them when they stop by. \n\n\"We are able to cater to everyone at the same time, whether it is someone getting into it or someone that wants a $20,000 bike,\" Sikorski said. \"We treat everyone the same. We are small group of people. We are like a family.\" \n\nThe store holds weekly rides that allow it to not only grow a customer base, but also build a community around the store. On Mondays, it offers about a 20-mile co-ed bike ride that leaves from the store. Then Wednesdays, it has a ladies-only ride followed by a barbecue. \n\n\"It brings more people to the area,\" Sikorski said. \"It's a friendly atmosphere, just everyone hanging out having a hot dog and a beer.\" \n\nBanks said he and Waring set out to make the business something different to separate it from other independent bike stores. Waring and his bike fitting has done that for Parvilla. \n\nBut there is more to the store than just that back room. Bikes line the wall, helmets rest on shelves, and now there's also triathlon equipment. \n\nThe bike fitting might be the main revenue stream and what draws outsiders in, but Parvilla Cycle & Multisport prides itself on everything else it offers the community, too. \n\n\"As much as we still do the high-end, custom, niche items, we are still that neighborhood bike store as well,\" Banks said. \"We will still work on everybody's bike.\"", "source": "Wichita Eagle"}