{"published": "2015-09-25T06:03:00Z", "media-type": "News", "title": "Former Canberra Raider Troy Thompson appointed West Belconnen coach", "id": "5ba147f2-09b6-436c-b4f7-f5a4296d9467", "content": "It's where he first developed his passion for rugby league and former Canberra Raider Troy Thompson has earmarked restoring West Belconnen's history after signing on as head coach. It's where he first developed his passion for rugby league and former Canberra Raider Troy Thompson has earmarked restoring West Belconnen's history after signing on as head coach. The joint Raiders player of the year in 2005, Thompson joins the Warriors after a one-year stint with Gungahlin, where he formed a coaching partnership with past Raiders David Howell and Lincoln Withers.\n\nHis predecessor at the Warriors, Justin Giteau, rebuilt the club from winless in 2013 to a preliminary final this year, giving Thompson a good base to work from.\n\nThompson also has previous coaching experience in the Melbourne Storm junior ranks, and said returning to his junior club proved too hard to resist.\n\n\"It was a really tough decision. The [Gungahlin] Bulls have been awesome to me and I've met some great people, I just thought moving back to my home club was the right move,\" Thompson said.\n\n\"Justin Giteau and [former West Belconnen assistant] Jeremy Braun have done a fantastic job the last couple of years to get them off the bottom of the ladder.\n\n\"We've just got to build on what they've done and hopefully retain most of the guys they had there this year. I thought they were the most improved side this year, apart from maybe Woden.\n\n\"There's a lot we can work with, the nuts and bolts are already there, we just have to tweak a few things.\"\n\nWest Belconnen will celebrate their 40th anniversary this weekend and Thompson is keen to get the \"old boys\" back involved.\n\n\"We're going to try and get back some of the old blokes who were there years ago to get back into the mix,\" he said. \"We're trying to make it like it used to be with a a really good culture, and players wanting to come there because of that.\"\n\nThompson is one of a number of former NRL players in the local coaching ranks, including Aaron Gorrell (Queanbeyan Kangaroos), Mick Picker (Goulburn), Simon Woolford (Queanbeyan Blues) and Withers and Howell (Gungahlin). The story first appeared on Brisbane Times.", "source": "Bayside Bulletin / Redland Times"}