{"published": "2015-09-24T14:56:56Z", "media-type": "News", "title": "Emissions scandal expands as BMW X3 accused of also failing test", "id": "ba8760b4-47d3-4335-9cfb-67f02cbf204f", "content": "A German magazine reported on Thursday that a BMW X3 also failed an emissions test, something the automaker denies. (Supplied) \n  \nThe ongoing scandal at Volkswagen widened today to include another automaker, as BMW denied a report in a German magazine that its X3 sport utility vehicle also failed an emissions test, reportedly spewing out 11 times the legal level of pollutants while in operation. \n \nShares in BMW were down almost 10 per cent on the report in Auto Bild that the four-wheel-drive version of the X3 emitted 11 times the legal European limit of nitrogen oxide when tested by the International Council on Clean Transportation (ICCT), the same group that alerted U.S. regulators to the discrepancy between emissions levels on Volkswagens on tests versus in real-world scenarios. \n \nThat's worse than the Passat did, but better than the Jetta, which belched out 22 times the acceptable level of nitrogen oxides, the magazine said. Thirteen other BMW models, meanwhile, passed the test. \n \n\"All measured data suggest that this is not a VW-specific issue,\" ICCT managing director Peter Mock was quoted by the magazine as saying. \n \nBMW denied the report, saying while it was not aware of the ICCT's specific tests, it did not \"manipulate or rig any emissions tests,\" the automaker said in a statement. \"We observe the legal requirements in each country and adhere to all local testing requirements. When it comes to our vehicles, there is no difference in the treatment of exhaust emissions whether they are on [a test] or on the road.\" \n \nBMW shares lost almost 10 per cent before recovering somewhat, but late in the trading day in Frankfurt BMW shares were off by about seven per cent, at €74.20 (about $112 Cdn). A day earlier, the shares closed at just under the €80 level (just over $120 Cdn). \n Much uncertainty  \nAnalysts say a dark cloud is likely to hang over virtually all German automakers until the reality of what exactly happened inside Volkswagen comes out.  \n \n\"Restoring the credibility of diesel engines likely will hinge on whether or not VW is alone in acting in this manner,\" Nomura analyst Manabu Akizuki said in a research note. \"However, the BMW X5 cleared the aforementioned tests, so at this stage it seems premature to assume the problem is more widespread.\" \n \nGerman Transport Minister Alexander Dobrindt says the governmental probe into the issue will look at all car models, not merely Volkswagens. \n \n\"It is clear that the Federal Office for Motor Traffic will not exclusively concentrate on the VW models in question but that it will also carry out random tests on vehicles made by other carmakers,\" he said Thursday. \n \nFor its part, the board at Volkswagen says it will on Friday name a successor to ex-CEO Martin Winterkorn, who resigned yesterday, but it will also start naming names of people who bear responsibility for the emissions scandal, Reuters reported, citing unnamed sources familiar with the situation. \n  \n For more detail please click here", "source": "Social Dashboard"}