{"published": "2015-09-02T03:48:56Z", "media-type": "News", "title": "Largest wildfire in Washington State history claims 176 homes", "id": "faf7fa91-b358-4870-9792-bacc9ab74188", "content": "As of Tuesday, at least 305,000 acres have burned while property losses were put at over $10 million. \n\r\n\r\n                            \r\n\r\n                            \r\n                            \r\n                            \r\n\r\n\r\n\r\n                            \r\n                            \r \n\r \nWASHINGTON – Crews battling the largest array of wildfires in Washington state history gained more ground against the flames on Tuesday, as property assessors reported the deadly conflagration had destroyed more than 170 homes and dozens of other structures. \n\nContainment of the sprawling cluster of blazes dubbed the Okanogan Complex, roaring through north-central Washington since mid-August, was estimated at 40 percent on Tuesday, up from 30 percent a day earlier, as firefighters capitalised on cooler, damper weather and lighter winds, authorities said. \n\n“We’re making headway,” said Bernie Pineda, a spokesman for the command center managing more than 1,200 firefighters assigned to the blaze. “But it’s not done yet.” \n\nAt least 305,000 acres have burned as of Tuesday, and property losses were put at more than $10 million, including 90 single-family dwellings, 86 cabins and nearly 100 outbuildings reduced to ruins, according to Okanogan County Assessor Scott Furman. \n\nBy comparison, last year’s Carlton Complex fire, previously the state’s largest on record, consumed more than 250,000 acres and leveled about 350 dwellings east of the Cascade range. \n\nThe human toll of the Okanogan Complex was higher, however. Three firefighters perished and four others were injured in the early days of the disaster. \n\nThe most seriously hurt survivor, burned over 60 percent of his body, was upgraded from critical to serious condition on Tuesday but remained hospitalised in intensive care, doctors said. \n\nThe Okanogan was one 16 active conflagrations in Washington state that have charred more than 900,000 acres, an area larger than Rhode Island, said the National Interagency Fire Center in Boise, Idaho. \n\nThe nearby North Star Complex, which has scorched about 205,000 acres of timber, mostly on the Coleville Indian Reservation, was reported at 25 percent containment. \n\nIn southeastern Washington, crews also aided by improved weather conditions had contained half of the 92,000-acre Chelan Complex, which has injured eight people and gutted more than 20 homes. \n\nA total of 64 large wildfires or clusters of fires were under attack throughout Washington and several other Western states on Tuesday, including Idaho, Montana, Oregon and California, according to the Interagency Fire Center. \n\nThose blazes were reported to have blackened more than 1.9 million acres of the drought-stricken region.", "source": "Eye Witness News"}