{"published": "2015-09-22T14:15:00Z", "media-type": "News", "title": "Yooralla offers ex-headquarters opposite Melbourne's Flinders Street station", "id": "ee7fb0d5-e4f4-41e9-a6c8-f43121c3e73e", "content": "A six-level, 3391-square-metre building at 244-248 Flinders Street is offered with near total vacant possession \n\n﻿ \n\nYooralla, the state's largest non-profit disability service provider, can expect at least $20 million – or 12 times what it paid 20 years ago – for a Melbourne CBD office opposite Flinders Street train station.\n\nThe six-level, 3391-square-metre former Yooralla headquarters at 244-248 Flinders Street, which is also opposite a tram super stop, is offered with near vacant possession, except for some small leases expiring in 2017.\n\nIn that period, a new owner could push through a major planning proposal for the 853-square-metre development-sensitive block, provided it did not block sunlight around the banks of the Yarra River.\n\nAt 108 Flinders Street, developers recently completed a 12-level, 191-unit building opposite Federation Square.\n\nHowever, earlier this year, a proposal to replace airspace atop the Fletcher Jones building on the north-west corner of Flinders and Queen streets with a 26-level apartment tower was rejected by Planning Minister Richard Wynne.\n\nSavills directors Clinton Baxter and Nick Peden​ are expecting local, interstate and offshore interest in the Yooralla site.\n\n\"This is an extremely well-located CBD building which offers exceptional upside,\" Mr Baxter said. \"It presents a tremendous value-add opportunity with a number of options including redevelopment, repositioning, owner-occupation and change of use.\"\n\nMr Peden added that the tightly held precinct historically provided owners with solid rental and capital growth over a long-term period because of ever increasing residents and shopping traffic.\n\n\"City of Melbourne studies confirm this to be the busiest pedestrian location in Melbourne's CBD and one of the busiest in Australia, with over 10 million tourists visiting the immediate area annually.\"\n\nIn 2001, the organisation then known as the Yooralla Society of Victoria quietly sold the historic estate it occupied in Flete Avenue, Armadale, for $7 million. The buyer, businessman David Crammond, sold his National Waste interest to Kerry Packer in the late 1980s.\n\nMr Crammond sold off a slice of the estate's yard for $2 million. In 2006, he traded the renovated period home for $14 million, setting an Armadale record.\n\nA few weeks ago, one of the modern mansions developed on a small block around Yooralla's former building at 2-6 Flete Avenue was sold for more than $8 million. The story first appeared on The Sydney Morning Herald.", "source": "Town & Country Magazine"}