{"published": "2015-09-19T15:24:53Z", "media-type": "News", "title": "Labour to review tax legislation, says John McDonnell", "id": "f5aa6da9-e9db-4813-a97e-66b85cd4cf16", "content": "Labour will perform a full review of tax legislation and the Treasury as part of a bid to clamp down on big business tax avoiders, shadow chancellor John McDonnell announced as he laid out his party's plans for the economy. \n \r\n\t\t\r \nMr McDonnell said there would be an \"institutional review\" of a \"whole range\" of organisations to see whether they are fit for purpose, and called for renewed investment in the tax office to close down loopholes that allow large corporations to pay minimal tax. \n\r  John McDonnell called for the introduction of a new 'national bank' \r \r \nThe MP for Hayes and Harlington called for the introduction of a new \"national bank\" to help the UK's long-term investment infrastructure. \n\r\n\t\t\t\r \nMr McDonnell also said he wants a return to separate government departments to manage public expenditure and help drive economic growth. \n\r\n\r\n\r\n\r \nThe new shadow chancellor highlighted an annual tax gap of £120 billion, saying that a \"significant proportion\" of that should be collected. \n\nHe told LBC radio: \"What we need to do now is invest in HMRC, get the tax inspectors to work and start closing down some of these loopholes. \n\n\"It is appalling that actually some of the biggest corporations are not just having their corporation tax cut by (Chancellor George) Osborne to the lowest level we have ever seen, at 18%, but in addition to that, even with low levels of taxation, they are not paying their way. I find that appalling.\" \n\nMr McDonnell added: \"We have put together a group of economists that will come together as an economic advisory council. \n\r\n\t\t\t\r \n\"One of the tasks I am going to be giving them is a review of all tax legislation and a review of the role of HMRC so we can get back to the state doing what it should do, (which) is making sure we collect our taxes.\" \n\nThe chairman and make-up of the new body will be announced within the next fortnight, he said. \n\nMr McDonnell added: \"I am looking to have an institutional review of a whole range of organisations to see whether or not they are fit for purpose at the moment and how they can be improved, and that includes a review of the Treasury itself.\" \n\nAnd he called for a reorganisation of government departments to focus on long-term growth. \n\r\n\t\t\t\r \nHe said: \"I would like to see the current BIS (Department for Business, Innovation and Skills) actually transformed into an economic development department. \n\n\"I think what we should be doing is saying to the Treasury, 'do your job', about managing monetary and fiscal policy alongside the Bank of England, which will remain independent but should have a new mandate, but also making sure the Treasury does its job about monitoring properly efficient public expenditure. \n\n\"But let's have a department that actually drives economic growth and investment.\" \n\nLabour is also arguing for the launch of a new state investment bank, Mr McDonnell said, to stabilise long-term investment infrastructure. \n\nHe said: \"That would be a state bank, a nationalised bank, if you like, exactly the same as they have in Germany and elsewhere. \n\r\n\t\t\t\r \n\"What I would like to do as well is build up a state sovereign fund.\" \n\nMr McDonnell vowed that Labour would tackle the nation's financial deficit. \n\nHe said: \"What George Osborne is doing is basically loading the payment on the deficit on middle and low earners and some with no earnings at all, those on welfare benefits. \n\n\"It is disgracefully unfair, so what we are saying is, we will tackle the deficit first of all by making sure corporations and the rich pay their taxes, full stop. \n\n\"Secondly we will not be making the tax cuts to the corporations that the Government is now planning, and we will make sure as well that we start preparing a long-term investment plan that gives us prosperity. \n\n\"If we can get reasonable growth back into the economy we can tackle the deficit, as long as we make sure people are paying their taxes.\" \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Spenborough Guardian"}