{"published": "2015-09-06T14:15:00Z", "media-type": "News", "title": "Teachers accuse global education giant of profiting out of conflict of interest", "id": "47974ba7-03f3-4961-bfd1-a36223208281", "content": "NSW teachers and politicians have lashed out at the potential conflict of interest that a multi-billion dollar British private education firm has in the state's education system. NSW teachers and politicians have lashed out at the potential conflict of interest that a multi-billion dollar British private education firm has in the state's education system. Pearson, the world's largest education business has held the $41.6 million contract for marking NAPLAN in NSW since 2011. The $10 billion global business generates millions of dollars out of text-book sales every year.\n\nAt the state's budget estimates last week, Greens MP John Kaye said that the conflict of interest between holding a contract that allows Pearson to mark NAPLAN tests and generate revenue out of the same exams was obvious.\n\n\"This is a live issue in NSW. It is critical that the government erects barriers in education to the interests of private companies,\" he said.\n\nThe company also holds the contract for printing, distributing and capturing data on the test, while the Australian Curriculum, Assessment and Reporting Authority develops the exams.\n\nUniversity of Queensland professor Bob Lingard said the contract potentially amounted to state-sponsored market research.\n\n\"The support by the state of these functions gives companies the business intelligence to dominate the market,\" he said.\n\nNSW Teachers Federation President Maurie Mulheron said that NAPLAN marking was just the tip of the iceberg and that company was positioning itself to control the entire education supply chain.\n\nThe company is involved in teacher training in Australia and curriculum development and assessment overseas. It recently established hundreds of for-profit low cost private schools across the developing world, including South-America and Sub-Saharan Africa, where educators are concerned it will have an impact on the principles of universal free education.\n\n\"We are very, very worried about the aggressive influence that the company has,\" he said. \"It is the number one concern of international education unions.\"\n\nDespite dedicating an entire section of its website to \"exclusive custom NAPLAN chapters,\" Pearson Australia's managing director, David Barnett, said the company had not sold a \"single resource related to NAPLAN test preparation.\"\n\nAccording to its inventory it currently sells 3686 textbooks directly related to the NSW curriculum, among them NAPLAN products for year 7 and year 9.\n\n\"The idea that we are somehow benefiting commercially from NAPLAN delivery is wrong,\" said Mr Barnett. \"They are totally separate parts of the business.\"\n\nA spokesman for the Department of Education said that Pearson was required to inform the department itself whether it had a conflict of interest in 2011. A probity adviser found that a conflict of interest did not exist.\n\nThe former British construction giant turned owner of the Financial Times and the Economist has controversially lost several multi-million dollar international contracts over the past year, most recently in New York where it administered its K-12 common-core tests, a US version of NAPLAN, after it allegedly inappropriately contacted teachers and botched several test questions.\n\nThe $44 million hit in New York came after it lost a contract in Florida, worth $220 million, as well as another in Texas worth $400 million. Last year it lost a $1.3 billion contract to distribute an interactive iPad curriculum throughout Los Angeles, after administrators were \"extremely dissatisfied\" with the work of the company.\n\nPearson Australia would not comment on the activities of its overseas branches, but it has long advocated for the role that private-public partnerships (PPP) can play in the education sector in Australia.\n\nMr Barnett was a member of the former Federal Education Minister's Digital Education Advisory Group and the Federal Government's Book Industry Strategy Group.\n\n\"There was major commercial development to the digital education advisory report,\" said Mr Barnett. \"Including the value of PPP partnerships and the skills we can bring to those sorts of projects.\"\n\n\"If we lobby the government, we do it to make a contribution. We don't lobby to push politics or products,\" he said. The story first appeared on The Sydney Morning Herald.", "source": "Singleton Argus"}