{"published": "2015-09-16T00:00:00Z", "media-type": "News", "title": "Ideal Implant Incorporated Release: The IDEAL IMPLANT Is Now Available: Introducing The FDA-Approved Breast Implant Inspired By Women", "id": "3e2587c6-6df1-4f87-b4ca-45627e63ba2f", "content": "DALLAS , Sept. 16, 2015 /PRNewswire/ -- Ideal Implant Incorporated announced today that the FDA-approved IDEAL IMPLANT ® Structured Breast Implant is now available for use in the United States and Canada . The IDEAL IMPLANT is the first implant to provide women with the natural feel of silicone gel-filled implants combined with the safety of only saline inside. \n\n\"After years of dealing with ruptured silicone gel implants and listening to patient complaints about the unnatural feel of original saline implants, I realized that women were looking for a new type of breast implant. This led me to develop the IDEAL IMPLANT,\" said Robert S Hamas, MD, a Dallas plastic surgeon. \"Now, for the first time, women can have a breast implant that offers them a natural feel without silicone gel.  It has only saline inside for their safety and peace of mind. Unlike silicone gel implants that have a high incidence of silent rupture that requires an MRI scan for detection, with the IDEAL IMPLANT, a women can look in the mirror each day and have the confidence of knowing her implants are intact.\" \n\nThe IDEAL IMPLANT has a simple, but unique, internal structure consisting of two saline-filled chambers and a series of implant shells of increasing size nested together.  This internal structure is designed to control the movement of the saline filler, giving the implant a natural feel.  The IDEAL IMPLANT has undergone over 10 years of development and refinement, with input from many breast implant experts, as well as clinical expertise from top practicing plastic surgeons across the country. \n\n\"Many women considering breast augmentation were not satisfied with the silicone gel and original saline implants currently available. IDEAL IMPLANT provides women the natural feel they demand, combined with peace of mind from only saline inside,\" said one of the lead clinical investigators for the IDEAL IMPLANT, Larry S. Nichter , MD, Voluntary Clinical Professor of Plastic Surgery at University of Southern California and University of California, Irvine and Immediate Past Chairman of the Department of Plastic Surgery at Hoag Memorial Hospital in Newport Beach, California . \"Of the 472 women who came in for two-year follow-up examinations, patient satisfaction for those who received the IDEAL IMPLANT as their first implants was 94.3%. Satisfaction among women who received the IDEAL IMPLANT as replacements for their previous implants was 90.6%. Surgeon satisfaction with the results was also high (95.9% for primary implants and 91.7% for replacements).\" \n\nThe Food and Drug Administration (FDA) and Health Canada approved the IDEAL IMPLANT  in 2014, based on results from a multi-center US clinical trial with 502 women that started in 2009, and now has over 5 years of follow-up data. The IDEAL IMPLANT is made in the USA at an FDA inspected facility that has been manufacturing silicone medical devices for over 30 years. \n\nWomen interested in seeking a consultation about the IDEAL IMPLANT can locate physicians who are part of the IDEAL IMPLANT Network of board-certified and board-eligible plastic surgeons by visiting the IDEAL IMPLANT website at www.idealimplant.com . \n\nABOUT IDEAL IMPLANT \nThe IDEAL IMPLANT is a structured breast implant made from the same safe and proven breast implant materials and manufacturing processes as other breast implants.  It contains no silicone gel or new materials and has a natural feel because of its unique design.  It is made entirely in the United States at an FDA inspected manufacturing facility.  And because the design is patented, no other breast implant company can manufacture or sell the IDEAL IMPLANT.  The IDEAL IMPLANT is only available through a limited network of board certified or board-eligible plastic surgeons. \n\nRefer to the FDA-approved IDEAL IMPLANT Patient Information Booklet at idealimplant.com for information about the risks and benefits associated with the IDEAL IMPLANT ® Structured Breast Implant. Additional information may be obtained at idealimplant.com. \n\nContact: Adeena Fried , 917-633-4380, idealimplant@evolvemkd.com \n\nLogo - http://photos.prnewswire.com/prnh/20150915/266652LOGO \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/the-ideal-implant-is-now-available-introducing-the-fda-approved-breast-implant-inspired-by-women-300143589.html \n\nSOURCE  Ideal Implant Incorporated", "source": "BioSpace"}