{"published": "2015-09-02T21:35:50Z", "media-type": "News", "title": "Freedom Solar Deploys Drones To Reduce The Soft Costs Associated With Going Solar", "id": "fbf04582-2ec5-4a1c-bf30-769fda0d5f09", "content": "  View as PDF    Print View      \nAs equipment costs have plummeted in solar over the last few years, attention now turns towards the install costs, to make solar more affordable for more home owners. \n\nAustin, U.S.A. - September 2, 2015 /MarketersMedia/ -- \n\nFreedom Solar, recently recognized as one of Austin's \"Fast50\" began conducting solar site assessments last month using drones from HoverStat technologies, in order to provide better service and pricing to their growing customer base. \n \nOperating since 2007, Freedom Solar has installed over 15 megawatts of solar panels for residential and corporate customers in Central Texas including Whole Foods, Austin Children's Museum, and the University of Texas.  Recently recognized in Solar Power World Magazine as the largest solar contractor in Texas, Freedom Solar has been innovating in the solar space to provide better solutions and delighted customers. \n \n\"We are in a race against the clock,\" says Kyle Frazier, Director of Sales for Freedom Solar.  \"As incentives burn off for solar we are relying more and more on driving cost from the equation.  And this must be done without compromising the products or services that we deliver to the end customer. When you are installing one new residential system every day of the week as we are, you need a scalable solution.\" \n \nCommonly referred to as \"soft costs\", the design, permitting, and install costs associated with a solar project are the focus of attention for many installers.  As manufacturers work to drive costs from the products they make, Installers must also do their part to improve efficiency.  \"Nearly 6% of our revenue goes towards Indirect costs,\" Says Chad Preece, COO for Freedom Solar.  \"This includes site technicians and QC techs who drive all over Texas measuring roof tops and evaluating them for solar.  There has to be a better way, there is a better way, and we think we've found it.  We're excited to partner with HoverStat and their innovative roof mapping technology, and couldn't think of a better technology partner to help Freedom Solar deliver industry leading solutions for home owners and businesses.\" \n \nAbout Freedom Solar \n \nFounded in 2007, Freedom Solar started as an installation company, constructing some of the largest solar projects in Texas. After establishing themselves as a leading photovoltaic (PV) panel installer, Freedom Solar expanded their business model to offer services directly to residential, commercial, and institutional markets. Since that time, they have installed over 15megawatts of solar panels, including hundreds of residential customers and well known corporate clients such as Whole Foods, Office Depot, Lake | Flato, and the University of Texas to name a few.  Individuals interested in buying or financing a solar PV system can visit http://www.freedomsolarpower.com/ \n \nFor more information about us, please visit http://freedomsolarpower.com \n\nContact Info: \nName: Kyle Frazier \nEmail: kyle@freedomsolarpower.com \nOrganization: Freedom Solar Power \nAddress: 4111 Todd Lane, Suite 100 Austin, Texas 78744 \nPhone: (800) 504-2337 \n\nVideo URL: https://www.youtube.com/watch?v=GPbrbyg94xU \n\nSource: http://marketersmedia.com/freedom-solar-deploys-drones-to-reduce-the-soft-costs-associated-with-going-solar/90422 \n\nRelease ID: 90422 \n Recent Press Releases By The Same User \nSmall Business Group Health Insurance Lower Cost Alternative Released (Wed 2nd Sep 15) \n\nESFS Improves Coverage of Michigan Kitchen Remodeling Services (Wed 2nd Sep 15) \n\nAward-Winning Injury Attorney Opens Torrance, CA Office (Wed 2nd Sep 15) \n\nToking Guru Publishes New Reviews As Marijuana Legalization Spreads (Wed 2nd Sep 15) \n\nVoodoo Creative Places as Finalist for Avant Card's Postcard of the Year Awards (Wed 2nd Sep 15)", "source": "Free Press Release Center"}