{"published": "2015-09-12T13:59:57Z", "media-type": "News", "title": "US Federal Business Opportunity: Department of Commerce: Repair and/or Reconditioning of the following equipment: CROSSARM ASSEMBLY, ASN: S100-2MT5A2, ELECTRONIC SET, GOES, ASN: J500-5A1 and SENSOR, DAY/NIGHT, ASN: S100-2MT5A5", "id": "9d28fa19-f63c-4ff1-b877-7d940d9d5ac1", "content": "Agency: Department of Commerce \nOffice: National Oceanic and Atmospheric Administration (NOAA) Location: National Weather Service \nDate you need to respond by: 15-September-2015 \nSolicitation Number: NWWG3401-15-213-226-242 Naics code: 334519  Computer and Electronic Product Manufacturing \n\n Description: \nNotice Type: Combined Synopsis/Solicitation. Set Aside: Total Small Business \n\nThis is a combined synopsis/solicitation. The U.S. Department of Commerce (DOC), National Oceanic and Atmospheric Administration (NOAA), National Weather Service (NWS), National Reconditioning Center (NRC) intends to send out for repair and/or reconditioning of the following equipment: 16 each CROSSARM ASSEMBLY, W/END CAPS, BELFORT PN: 33135-2, ASN: S100-2MT5A2, 5 each ELECTRONIC SET, GOES, CONTAINS POWER SUPPLY 3489A TRANSMITTER 3421A, MASTER CONTROL MODULE 3401B, ASN: J500-5A1 and 25 each SENSOR, DAY/NIGHT AAI PN: 62828-90111-4; BELFORT PN: 31924-2, ASN: S100-2MT5A5. This is a 100% Set-Aside for a Small Business. The intended acquisition is for repair and/or reconditioning service to furnish labor and material to place in like new operating condition and good appearance to meet the original manufacturer's specifications and/or tolerances of the equipment listed above. After repair and/or reconditioning, if the equipment does not meet these conditions, it will be returned to the vendor for rework at no additional cost to the government. Only firms that can provide the exact repair and/or reconditioning service described herein will be considered. This acquisition is being processed under the procedures of Federal Acquisition Regulation (FAR) Part 13, Simplified Acquisition Procedures. This constitutes the only Request for Quotation (RFQ) written offers are being requested; and a written solicitation will not be issued. This notice is hereby issued as RFQ No. NWWG3401-15-213-226-242. This RFQ and the incorporated provisions and clauses are those in effect through Federal Acquisition Circular (FAC) 2005-36. The line items shall be provided in accordance with the specifications listed below. The price shall be all inclusive of costs including return shipping costs. The FAR clauses incorporated into this acquisition shall be the following: 52.203-99 Prohibition on Contracting with Entities that Require Certain Internal Confidentiality Agreements (DEVIATION 2015-02, Feb 2015), 52.204-18 Commercial and Government entity Code Maintenance (Jul 2015), 52.212-4 Contract Terms and Conditions-Commercial Items (Dec 2014), 52.212-5 Contract Terms and Conditions Required to Implement Statutes or Executive Orders-Commercial Items (Apr 2015), (Clauses Only if Applicable: 52.204-10, 52.209-6, 52.219-6, 52.219-13, 52.219-28, 52.222-3, 52.222-21, 52.222-26, 52.222-36, 52.222-50, 52.223-18, 52.225-13, 52.232-33, 52.222-51), 52.232-40 Providing Accelerated payment to Small Business Subcontractors (Deviation)(Dec 2013), 52.247-65 F.O.B. Origin, Prepaid Freight - Small Package Shipments (Jan 1991), 52.252-2 Clauses Incorporated By Reference (Feb 1998), 52.252-6 Authorized Deviations in Clauses (Apr 1984). The CAR clauses incorporated into this acquisition shall be the following: 1352.201-70 Contracting Officer's Authority (Apr 2010), 1352.209-73 Compliance with the Laws (Apr 2010), 1352.209-74 Organizational Conflict of Interest (Apr 2010), 1352.233-70 Agency Protest (Apr 2010), 1352.233-71 GAO and Court of Federal Claims Protests (Apr 2010) and 1352.246-70 Place of Acceptance (Apr 2010). The FAR provisions are incorporated into this acquisition by reference as follows: 52.203-98 Prohibition on Contracting with Entities that Require Certain Internal Confidentiality Agreements-Representation (DEVIATION 2015-02, Feb 2015), 52.204-7 System for Award Management (Jul 2013), 52.204-16 Commercial and Government Entity Code Reporting (Jul 2015), 52.204-17 Ownership or Control of Offeror (Nov 2014), 52.212-1 Instructions to Offerors-Commercial Items (Apr 2014) and 52.212-3 Offeror Representations and Certifications-Commercial Items (Mar 2015). FAR clauses and provisions are available on the Internet Website http://www.acquisition.gov/far/. All contractors doing business with the Federal Government must be registered in the System for Award Management (SAM). For information and to register, please access the following website: https://www.sam.gov/. In order to register on the SAM website, offerors must have a Dun & Bradstreet number. A Dun & Bradstreet number may be acquired free of charge by contacting Dun & Bradstreet on-line at http://fedgov.dnb.com/webform or by phone at (800) 333-0505. The Government intends to make an award to the responsive responsible quoter(s) providing the best value to the Government, price and non-price factors considered. \"Best value\" means the expected outcome of an acquisition that, in the Government's estimation, provides the greatest overall benefit in response to the requirement. The Government reserves the right to make a comparative evaluation of quotes in determining best value in accordance with FAR 13.106-2(b)(4)(ii). \nThe NAICS code for this requirement is 334519. All responses must be in writing and may be mailed to the National Reconditioning Center, ATTN: William N. Roberts, 1520 East Bannister Road, Kansas City, Missouri 64131 or sent to the email address William.Roberts@noaa.gov. Quotes submitted in response to this notice shall also include the following in order to be considered responsive to this request: \n\n1. DUNS number, company name, address, point of contact, email address, telephone number \n2. Brief statement regarding its capability to repair and/or recondition the specified equipment. \n3. Include the name, telephone number and point of contact for past performance of businesses or other Government agency to which it has previously repaired and/or reconditioned these items. \n4. Delivery Schedule. Provide a proposed delivery date for the repair and/or reconditioned return of the equipment. \n5. Completed price schedule for the repair and/or reconditioning of the line items identified in this notice including the return shipping cost. This is a firm-fixed price request. \n6. Completed, signed and dated copy of FAR 52.212-3 Representations & Certifications-Commercial items or certification of registration with the System for Award Management (SAM) database. \n7. Completed, signed and dated copy of Representation by Corporations Regarding an Unpaid Delinquent Tax Liability or a Felony Conviction Under Any Federal Law (Class Deviation) (March 2015). \n\nS100-2MT5A2 \nMultiple searches of the Small Business Administration (SBA) Dynamic Small Search did not identify any additional small businesses available to compete for this required repair and reconditioning service. Search parameters included: NAICS code 334519 with key words ‘repair, Belfort, visibility, cross-arm assembly'; and just key words: ‘repair, Belfort, visibility, cross-arm assembly'; and ‘repair, visibility, cross-arm assembly'. A search of ‘visibility cross-arm assembly' in GSA's eLibrary returned no matches. \n\nJ500-5A1 \nMultiple searches of the Small Business Administration (SBA) Dynamic Small Search failed to identify any additional small businesses available to compete for this repair service. Search parameters included a combination of NAICS code ‘334519' with key words: ‘repair, Synergetics, GOES, Satellite Radio'; and just key words: ‘repair, Synergetics, GOES, Satellite Radio' and ‘repair, GOES, Satellite Radio', and ‘repair, Synergetics, Satellite Radio'. Searches of the GSA's eLibrary for ‘repair Synergetics GOES Radio' and ‘repair GOES Satellite Radio' returned no matches. \n\nS100-2MT5A5 \nMultiple searches of the Small Business Administration (SBA) Dynamic Small Search failed to identify any additional small businesses available to compete for this repair and reconditioning service. Search parameters included a combination of NAICS code ‘334519' with key words: ‘repair, Belfort, visibility, day/night sensor'; and just key words: ‘repair, Belfort, visibility, day/night sensor', ‘repair, Belfort, day/night sensor' and ‘repair, day/night sensor'. Searches of the GSA's eLibrary for ‘Belfort day/night sensor' and ‘repair day/night sensor' returned no matches. \n\nAdditional Info can be found at: \nhttps://www.fbo.gov/spg/DOC/NOAA/OCSNWS/NWWG3401-15-213-226-242/listing.html Contact details for this United States Federal Business Opportunity: \nWILLIAM N ROBERTS, Phone 816-926-3217 X237, Fax 816-926-3105, Email WILLIAM.ROBERTS@NOAA.GOV \nContracting Office Address: \n1325 East West Highway, SSMC2, Room 11226 Silver Spring MD 2", "source": "ITbriefing"}