{"published": "2015-09-30T03:27:51Z", "media-type": "News", "title": "Julie Bishop: ending death penalty worldwide on Australia's UN agenda", "id": "52694bdb-3710-4780-b657-899e433486e4", "content": "Former treasurer, Joe Hockey, Prime Minister Malcolm Turnbull and Foreign Affairs Minister Julie Bishop in Parliament House in Canberra. Photo: Alex Ellinghausen \nexit \nAustralia would use a seat on the United Nation's chief human rights body to wage a tireless campaign to end the death penalty around the world, Foreign Affairs Minister Julie Bishop said during a speech to the UN's General Assembly. \n\nAs she spoke on Tuesday evening in the US, the state of Georgia was preparing to execute a woman despite a direct appeal from the Pope , who left America after his visit earlier this week. \n\nMs Bishop's speech was in effect a ringing endorsement of the UN. Aside from the decision to bid for a seat on the UN's Human Rights Council for the 2018-2020 term, Ms Bishop formally announced Australia's decision to run again for a seat on the Security Council in 2029. \n\n\"Australia's recent experience as a Security Council member confirmed that the council's role is more essential than ever,\" she told the General Assembly. \n\nShe said the UN carries out crucial work in an increasingly hostile world, and is often not recognised for its successes. \n\nShe offered her support for the 17 Sustainable Development Goals, unanimously adopted by the UN, saying that should they be realised, \"we will transform our world\". \n\nShe also emphasised the importance of gender equality, saying it must be fully achieved by 2030. \n\n\"We must step up the fight against the global scourge of violence against women and girls,\" she said, informing the assembly about the $100 million women's safety package the government had announced domestically. \n\nSpeaking earlier Ms Bishop said concerns of the UN's special rapporteur on the human rights of migrants, Francois Crepeau, about Australia's mandatory detention policy did not conflict with the bid to secure a seat on the Human Rights Council. She said she had spoken with Mr Crepeau and made the government's case that Australia's policy of deterrence saved lives by tackling people smuggling. \n\nThe government's engagement with the UN has apparently ticked up since Malcolm Turnbull became Prime Minister. \n\nIt is understood that planning for Australia's bid for the Human Rights Council began under the previous government, but that Tony Abbott had instructed to Ms Bishop to abandon the effort. \n\nShe had not yet informed the UN of that order before he left office. \n\nMs Bishop said she proposed to Mr Turnbull that Australia run again for the Security Council and he had immediately approved the bid. \n\nMs Bishop earlier attended a leaders summit on countering Islamic State chaired by US President Barack Obama on the sidelines of the General Assembly. \n\nShe told the meeting of about 100 leaders that the coalition fighting IS had brought the terrorist group's expansion in Iraq to an end and forced it to change tactics. \n\nAs a result the coalition's strategy must respond. \n\n\"Colleagues, our campaign must continue to evolve and our strategy adapt as the situation changes,\" Ms Bishop said. \n\nAs Russia has stepped up its engagement in the region, the US and allies including Australia have come to accept that Syrian President Bashar al-Assad may have to remain in place as part of a political deal to restore peace to the region and prosecute the war on IS. \n\nThe US is still casting this as a possible temporary measure, while Ms Bishop has said no potential political solution should be discarded. \n\n\"In Syria, as I said yesterday, defeating ISIL requires, I believe, a new leader and an inclusive government that unites the Syrian people in the fight against terrorism groups,\" Mr Obama told the summit. \n\n\"This is going to be a complex process and as I've said before we are prepared to work with all countries, including Russia and Iran, to find a political mechanism in which it is possible to begin a transition process.\" \n\nMr Obama now appears to be caught between European allies who believe there should be more co-operation with Russia – which backs Mr Assad – and Middle Eastern allies, including Saudi Arabia, who still insist he must go. \n\nRussia refused to send a senior diplomat to the summit, dismissing it as American grandstanding. \n\n\"This initiative seriously undermines UN efforts in this direction,\" Russia's UN envoy Vitaly Churkin was quoted as saying by Russian news agencies. \n\n\"The UN has its own anti-terror strategy and everything could easily be done within the UN framework. \n\n\"But Americans would not be Americans if they did not seek to demonstrate their leadership.\" \n\nThe Russian and American presidents traded barbs about the causes of the Syrian war in their speeches to the General Assembly a day earlier, with Mr Putin saying it had been provoked by American attempts to \"export democracy\". \n\nFollow FairfaxForeign on Twitter \n\nFollow FairfaxForeign on Facebook \n\nThe story Julie Bishop: ending death penalty worldwide on Australia's UN agenda first appeared on The Sydney Morning Herald .", "source": "Cessnock Advertiser"}