{"published": "2015-09-18T22:00:19Z", "media-type": "Blog", "title": "Robotech Rewatch 66: The Great Reflex Point Conspiracy", "id": "e91fa50a-3e87-460b-8d07-42143322f838", "content": "Keep your scanner tuned to this station. Robotech is back! \n \nChapter 83: Reflex Point \n \nThis is exciting! Reflex Point! The whole story has been heading towards this point for so long! My expectations are very high. \n \nThe Regis muses on irony, and how protoculture allows the Invid to change into any form they like, but their extensive research has concluded that HUMANS, HUMANS ARE THE BEST DESIGN. \n \n“We are Invid, we cannot fail, I will not allow it.” \n \n \n\n \nA group of troublemakers, AKA our heroes, are startled by an explosion nearby. Hoping it might be that spunky Rick Hunter, they head towards it only to find some damaged mecha in a smoking crater. \n \nScott carefully surveys the damaged mecha and pronounces that there are no survivors. \n \n“Nobody said war was pretty.” The narrator, setting the tone as always. \n \nProving that Scott is an idiot, a survivor promptly turns up – an intelligence agent called Sue Graham, who looks a lot like Marie Crystal but isn’t. Her assignment is to record the mission for Admiral Hunter and send him information. \n \nScott is furious to find out that Sue filmed the deaths of her colleagues instead of joining in the battle and getting killed alongside them. He and Lancer get aggressive and judgy at her. \n \nHundreds of Invid are approaching. Sue tells them all to deactivate their protoculture cells and abandon the mecha so the Invid think everyone is dead, but they are so busy not trusting her that they leave it to the last minute and only just make it into the woods. \n \nTheir Cyclones have a near miss, but the jeep and the Beta are both knocked into a ravine by the stompy Invid. Aww, ships, no. (Don’t worry, they’re fine later) \n \nSue has some good news, at least: there is a force of Admiral Hunter’s fleet, called shadow fighters, hanging around the dark side of the moon, ready to launch an assault against the Invid when “the time is right”. Scott repeatedly challenges her about doing her job (passing information to the local fighters to give them hope, and collecting data to send back to the fleet) rather than going rogue freedom fighter like him, which is the Only Correct Moral Choice. \n \nScott needs to not be in charge any more. \n \n#TeamSue \n \nThe crew all have adorable space sleeping bags that make them look like caterpillars. Scott is angsting about Marlene Mark I, and Marlene Mark II suggests that he’s never going to be over her. She has a good point considering that he NAMED HER AFTER HIS DEAD GIRLFRIEND. \n \nScott and the crew are reluctantly going on a mission to collect a magic special space cannon that Sue told them about. Scott suspects that Sue has set them up so she can get some amazing footage of them getting “creamed” by the Invid. \n \nI’m confused by their lack of distinction between a spy collecting necessary war intelligence, and a paparazzo-style media bunny. Mind you, Sue doesn’t help the situation by saying things like “Admiral Hunter’s going to love this footage” which implies she is creating entertainment for the poor bored Admiral instead of, you know, helping the war effort. \n \nOn the other hand, maybe Rick is just super bored. It’s not easy at the top. \n \nEven the narrator complains that Sue is shooting nothing but film footage, when the Invid attack. Annie isn’t shooting anyone either! Because it’s NOT HER JOB OR HER SKILLSET. \n \nI can’t help noticing that this episode called Reflex Point does not seem to actually have anything to do with Reflex Point. Surely they’ll get there soon, right? Right? \n \nThe leader of this particular Invid battalion is a glam rock style blond who bleeds green when he is killed. Sue is delighted to have proof that the Invid are turning themselves into humans – but Marlene is less than delighted, because she is bleeding green from a scratch on her arm. \n \nYOU GUYS I THINK MARLENE IS AN INVID! \n \nMarlene flees in horror, and Scott is surprisingly calm and forgiving about the whole thing, thinking more about how upset she must be than worrying about whether she was spying on them. It’s his one moment of being pretty awesome in an episode that is mostly all about him being a dick. \n \nSue drops dead from, I don’t know, irony, I guess, and Scott gives a grave speech about how she was the most dedicated professional he ever met in the REF, which goes to show that even when he’s being nice, he’s also a massive hypocrite. \n \nAs the episode closes without any sign of Reflex Point, the narrator works harder to get up our hopes that Admiral Hunter will be turning up any minute. \n \nI… don’t think he can be trusted… \n \nBut they wouldn’t keep mentioning Admiral Hunter this much if he wasn’t going to turn up in the final episode, right? RIGHT? \n \nThis weekly rewatch of classic animated space opera Robotech is brought to you as bonus content for the Musketeer Space project. \n \nThanks to everyone who has linked, commented, or sponsored me. \n \nYou can support the blog at Patreon .", "source": "tansyrr.com"}