{"published": "2015-09-23T12:11:04Z", "media-type": "News", "title": "#PopeinDC: 5 things to watch on Wednesday", "id": "cccffefb-e579-49fc-a8d9-5b0a79a32c8e", "content": "Pope Francis landed on U.S. soil for the first time Tuesday evening. On Wednesday, the Pope will hold his first public events in Washington. \n \nHere are five things to watch on this historic day. \n\n1. A political Pope \n\nFrancis has sharp political opinions on many of the most pressing issues facing the world today, from climate change to immigration and religious freedom. \n\nThe question is: How deeply will he delve into domestic U.S. politics? \n\nThe Pope is scheduled to make a short speech at the Rose Garden in the White House on Wednesday morning, and Vatican sources say we can expect him to outline the major themes of his five-day visit to the United States. \n\n2. The Pope and the President \n\nAfter the Rose Garden ceremony, Francis and President Barack Obama are expected to meet privately in the Oval Office. \n\nThere are many issues on which both men agree -- and they seem, personally, to get along well. \n\nBut there are also issues on which the Pope and President disagree, and it will be interesting to see the statements that emerge from the private meeting. \n\nWatch, in particular, to references to religious freedom, a big area of contention between the U.S. Catholic bishops in the White House, who have battled over the contraception mandate in Obama's signature health care law. \n\n3. Crowds, crowds and more crowds \n\nBy early Wednesday morning, crowds had already lined up along the route Pope Francis is expected to tour in his \"popemobile.\" \n\nLaw enforcement sources call the level of security around the papal visit unprecedented. But we also know that Francis is an unpredictable Pope, who loves mingling among the faithful and getting up close and personal with his many fans. \n\n4. A good scolding? \n\nCatholic Church sources are keen to hear what Pope Francis will tell a big meeting of bishops Wednesday morning at St. Matthew's Cathedral in Washington. \n\nThe Catholic Church in the United States has been struggling in recent years, losing many members in part because of self-inflicted injuries like the clergy sex-abuse scandal. \n\nWill Pope Francis give them a papal pep talk or take them to task? \n\n5. A controversial saint \n\nIn his last planned event on Wednesday, Pope Francis will canonize Junipero Serra at a large Mass outside Washington's Basilica of the National Shrine of the Immaculate Conception. \n\nThe canonization is a huge point of pride for Latino Americans, and Serra, an 18th-century missionary from Spain, will be the first saint ever canonized on American soil. But to Native Americans, Serra was no saint. They say he came to conquer and convert their communities.", "source": "WBAL Channel"}