{"published": "2015-09-22T13:29:38Z", "media-type": "News", "title": "Bibby launches safety documentary after diver’s incredible rescue", "id": "9cc1775e-8d2a-4151-9a92-191a0ecfbe11", "content": "A new documentary that recounts the rescue of a stranded diver will offer valuable insight that will help the industry deal with similar events in the future. \n \nThree years ago a rare sequence of events left one of Bibby Offshore’s saturation divers stranded in complete darkness, 90 metres below the surface of the North Sea and without any gas to breathe. \n \nThe diver was rescued and recovered fully, but Bibby Offshore wanted to share its experience and the lessons learnt. In collaboration with floating Harbour Productions, it created a documentary-style film – Lifeline – using real time footage and reconstruction to recount the remarkable events that took place in September 2012. \n \nDiving Bell inside one of Bibby Offshores DSVs \n \nLifeline demonstrates how personnel react in a crisis and how training, procedures and emergency response actions can tip the balance in a life and death scenario. \n \nDue to the combined effects of unique faults in the dynamic positioning system, Diving Support Vessel (DSV) Bibby Topaz was left 190 metres off position. \n \nAt the time, diver Chris Lemons and his colleague were deployed subsea working in a drilling template. Although both divers got out of the template safely, Chris’s umbilical, which provided him with breathing gas, hot water for his suit and communications, became trapped and subsequently parted, leaving him alone and in complete darkness on the seabed. \n \nAfter 40 minutes in life-threatening conditions, Lemons was rescued and returned to the bell, unconscious, but alive. \n \nHe made a full recovery, and the incident provided the unique opportunity to improve and enhance diver safety across the entire industry. \n \n\n \nLead QHSEaAdvisor at Bibby Offshore, Chris Cleghorn, who was on-board the vessel on the night of the incident, said: “Whilst technical safety films are hugely valuable tools, Lifeline does not set out to address safety issues from this point of view, rather it focuses on the human response and personal impact. \n \n“In addition to the many lessons to be learned from the incident, its aim is to make us consider the consequences of things going wrong, and Lifeline is a vivid reminder of the preciousness of a human life.” \n \nBibby Offshore has used Lifeline extensively to engage with the industry, through regular communication with operators, subsea contractors and industry bodies. \n \nThe lessons learnt from the incident and the initiatives identified, are also continually addressed through the company’s Diving Safety Workgroup (DSW). \n \nDirectly after the incident, Sir Michael Bibby and Bibby Offshore chief executive Howard Woodcock took the decision to form the DSW to take every step possible to identify how the diving operations can be made safer and reduce the risk as much as possible. \n \nThe DSW was formed after the incident, and the means by which Bibby Offshore has continued to engage with the industry since. \n \nIts scope covers safety in diving operations, technological development in diving equipment, gaining feedback from offshore teams and assisting with the implementation of identified enhancements while monitoring the effectiveness of them. \n \nThe workgroup, which includes representation from the Diving and QHSE departments, was set up to identify opportunities for improvement in diving operational practices, equipment, and procedures for use not only by Bibby Offshore, but across the wider oil and gas subsea sector. \n \nThe DSW has been instrumental in identifying improvement and enhancement opportunities to ultimately make diving operations safer. \n \nThe post appeared first on Energy Voice .", "source": "Energy Voice"}