{"published": "2015-09-22T12:00:38Z", "media-type": "Blog", "title": "UofL Beatings Will Continue Until Morale Improves. In Other Words? Told Ya So Years Ago, Nothing Has Changed", "id": "88567227-2360-4de8-9e0d-016c9e651277", "content": "Who could have known, over the past eight years, that there’s a morale problem with faculty and staff at the University of Louisville??? Vicious and disrespectful: that’s how some faculty and staff describe the work environment at the University of Louisville. [WDRB]\nAfrican Americans living in Kentucky saw their average yearly incomes drop by more than 11 percent in one year, according to U.S. Census Bureau data released this week. The poverty rate also rose for black Kentuckians at a rate four times more than the rest of the state from 2013 to 2014. [C-J/AKN]\nWHAS11 has learned, through MetroSafe, there is a shooting in the 3800 block of Vermont Avenue, in the Shawnee area. [WHAS11]\nThe University of Kentucky and the University of Louisville have won a $3.76 million grant to create a national center of excellence in micro/nanotechnology, one of just 16 awarded by the National Science Foundation. [H-L]\nMetro police said a 66-year-old man found dead last week was slain. Police said Michael Davis was killed sometime last Monday. [WLKY]\nSeventy-three law enforcement agencies across the country will receive $20 million in federal grants to help them purchase and implement the use of body cameras, the Justice Department’s Bureau of Justice Assistance announced Monday. [HuffPo]\nCrowds rallied together Sunday near the corner of 17th and Broadway with concerns of a new biodigester planned for the West Louisville neighborhood that would deal with methane gas. [WAVE3]\nTime Warner Cable Inc’s shareholders approved the company’s $56 billion takeover by Charter Communications Inc, according to preliminary votes at a special shareholder meeting. [Reuters]\nU.S. Education Secretary Arne Duncan touted two Louisville educational institutions Thursday during a stop in the city. [WFPL]\nAs temperatures start to cool down and the leaves begin to fall, Norma Justice and others are gearing up for the annual Flatwoods Fall Festival. [Ashland Independent]\nFloyd Memorial Hospital and Health Services is updating and expanding its surgical facilities in a $2.4 million project. [Business First]\nShane Corbin said his role as Jeffersonville Planning and Zoning director has been an exciting one. [News & Tribune]", "source": "The 'Ville Voice"}