{"published": "2015-09-09T17:10:50Z", "media-type": "News", "title": "How to complain the right way", "id": "b2a8e231-0920-4cab-9208-d9d4676eb3ee", "content": "Call it Murphy’s Law as it relates to consumers: No matter what, sooner or later most everything we buy goes kaput in some manner. What’s less certain is the outcome of dealing with the company made the thing in the first place. Whether it involves a warranty dispute or a repair issue whose resolution moves with the speed of erosion, consumers routinely have to talk with a manufacturer to solve a problem. That means more than a rambling, heated rant if you want to get results. “Complaining is really an art,” said Katherine Hutt, a spokesperson for the Better Business Bureau . And it pays to know a few guidelines that underscore the fine art of effective complaining. Your ideal resolution When your six-month-old refrigerator suddenly turns your ice cream into vanilla-flavored gazpacho, it’s hard to focus on anything except getting it fixed as quickly as possible. But, if you decide to take the matter up with the refrigerator manufacturer, it’s important to first define your long-term goals. Knowing precisely what sort of resolution you’d ideally like to get — as well as what you’d be willing to settle for —can keep you more focused and persuasive. “The problem is that most people get stuck on describing the problem,” said Anchorage, Alaska, mediator Christian Muntean. “What would be my ideal solution? What is the least I am willing to accept? What do one or two middle options look like?” That attitude opens up more possibilities than a rigid \"either/or\" approach that often leads to a dead end of either the company replaces the item or denies any responsibility. “Sometimes, the item can't be replaced but it can be repaired. Sometimes a gift certificate can be sent. Sometimes credit towards a future purchase. Perhaps an additional warranty or service or upgrade can be added,\" Muntean said. \"Try to be creative in options.” Lastly, keep your expectations realistic and honest. For instance, don’t ask a television manufacturer to replace your set when you know your kids were using the screen as a bounce back for tennis balls. “Am I disputing this in good faith? Is there any aspect of the problem that may be my responsibility?” asked Muntean. “It doesn’t work if all you’re trying to do is game the system.” Who to talk to? One obvious question at the outset of a product or service issue is who best to contact. A number of possibilities exist. For instance, most companies offer a customer support service or some other similarly titled department to handle customer issues. Page 2 of 3 - Experts urge consumers to make contact via telephone or, if possible, in person. Emails, online live support and other similar options lack the persuasive impact that in-personal conversation can provide. “My preference is to contact the company by phone first,” said Randi Busse, author of \"Turning Rants Into Raves: Turn Your Customers on Before They Turn on YOU!\" “Getting a human being on the other end of the line and calmly explaining the situation could be all it takes to resolve the issue.” If contacting customer support gets you nowhere, another strategy is to effectively leapfrog the rest of the organization. That can mean crafting a thoughtful letter to the company’s president or CEO to outline the situation and voice your frustration in a constructive, respectful manner. “My father taught me to start at the top, writing a letter to the company principal,” said consultant Wilson Black. “First, acknowledge he may be very busy and express your trust in him to delegate the matter to the proper authority. This intro is followed by a detailed description of the problem, written in a matter-of-fact style, without accusation or belligerence.” Manners, please Black’s strategy highlights a central feature of pursuing an effective product service complaint. However tempting it may be to explode at anyone within earshot, it’s essential to keep all communication respectful, constructive and dignified. “When dealing with a company, bear in mind the Three Ps: polite, persistent and patient,” said Christopher Elliott, author of “ Scammed .\" “As a business owner, I see the issue from both sides,” added Izzy Goldman of CSS Digital, a computer supply company. “No matter what the issue, there is never a call to be insulting. What's more, insulting someone is almost a guarantee that your issue will not be addressed properly.” Goldman also suggested starting the conversation with a compliment, such as how you generally enjoy the company’s products or services. That establishes a positive history, which in most cases companies will be eager to continue. Another strategy is to reframe the nature of the complaint. Rather than dealing with a company representative in an accusatory or aggressive manner, simply outline the problem and ask for their assistance: “Who doesn't want to assist someone that specifically asks for help?” said Busse. Ratcheting it up Page 3 of 3 - However diplomatic you may be, an initial effort to reach a reasonable solution to an issue may not render the result you want. If that’s the case, ask to talk with someone higher up in the authority chain. “Always talk to a decision maker,” said Muntean. Another option is to go as public as possible. While one obvious tactic is to leverage Facebook, Twitter and other forms of social media merely to blast a company and its products, a more subtle and possibly more effective approach is to trust that your posts may catch the attention of sympathetic eyes. “If everything I try doesn't work, I will take to social media, most often Twitter, and tweet to the company asking for their assistance,” said Busse. “It's amazing how quickly you can elicit a response when the whole Web is watching. Or the opposite happens and no one responds.” Still another choice is to file a complaint with the Better Business Bureau. Complaints may be submitted online at bbb.org/complain . If the situation warrants it, the BBB also offers mediation and arbitration services. While some issues don’t warrant relentless determination to win, be as persistent as necessary if you feel you’ve been genuinely wronged. Just ask Chris van Greunen, who once spent several months trying to resolve an issue over a single package of rice. Granted, it turned out that there was a dead mouse mixed in with the grains, but van Greunen never lost sight of the underlying principle. “Too many people just leave this kind of situation alone. Shops are seeing that they get away with it nine out of 10 times,” he said. “I think if more of us stand up and fight for our rights then we will be treated with more respect.”", "source": "Flora County Advocate-Press"}