{"published": "2015-09-04T22:28:47Z", "media-type": "News", "title": "How To Be The Perfect Weekend Guest", "id": "b4273b2f-3bf3-46de-be40-04990aae6d5e", "content": "Photographer: Gaelle le Boulicaut \n\nLabor Day is oh-so bittersweet — everyone tries to wring the last bits of summer fun out of the weekend while getting in gear for the season ahead. If you are lucky enough to play the role of guest at someone's vacation home, you've got a particular set of responsibilities to uphold. Your host is sure to provide a weekend filled with great food, laughs, and relaxation and in return, provided that everyone follow these best (guest) practices. \n- Continue Reading Below \nWhat to Bring \nBring something to be enjoyed that weekend and that weekend alone. Even people who own their country homes are emptying the refrigerator of summer staples, so a tin of caviar or a 30 portion layer cake are not great ideas. Try and steer clear of traditional hostess gifts ; something that has to be carted home from a rental house won't seem like a \"gift\" at the time. But if you want to add a more personal touch than a bottle of wine, a photo book filled with memories of the weekend is my favorite form of gratitude, particularly as the fall approaches and we look wistfully at any shots of us without ear muffs and scarves. Use your phone to chronicle the small joys over the weekend, and then have the photos printed or made into a hardcover book . \nBest Behavior \nBe particularly low maintenance as a house guest. Switching homes, getting kids back to school and the revving up of the fall work schedule will most likely make your hosts preoccupied. Don't take it personally; just fend for yourselves. My favorite guest experiences have been when generous souls avail me of their bedroom and beach and leave me to my own devices 'til dinner time. \n \n William Abranowicz \nTravel Plans \nPlan on arranging your own transportation unless you want to be stuffed in the back of a vehicle with the dogs, linens and cookware returning to the city. And travel light ; anything left behind will not be retrieved before the spring.  \nA Relaxed Environment \nDon't expect the works; Labor Day is the time to kick back. This year, I am helping a friend host a party at her beach house, and she cleverly chose to have it on Sunday night. This way, just as everyone is starting to come to terms with the end of season blues, they'll have somewhere to go and cheer up without worrying about the next day being a \"School Day.\"  Lots of other parties compete for the Saturday night, but Sunday will belong to us. Billed as the most simple, unstylish party possible, it's a relaxation fest and an aid to gear shifting that requires nothing dressy and no pretension, just a quintessential lawn party/barbecue that will surely cure the end of summer blues!", "source": "Elle Decor"}