{"published": "2015-09-23T11:10:42Z", "media-type": "News", "title": "Shoppers Stop Logs On To FreeCharge Wallet", "id": "f837e7c9-4fa6-4ac6-8f06-b3ee8d889ca6", "content": "Customers can soon make payments through the FreeCharge Wallet across all Shoppers Stop, HyperCity, Crossword and HomeStop stores as well as on its webstore. Shoppers Stop currently has 74 retail stores across the country as well as its online store. The partnership will also extend to the Shoppers Stop Ltd. group companies such as 17 outlets of HyperCity, 95 stores of Crossword and 19 stores of HomeStop across India. \n \nShoppers Stop’s recently announced partnership with Snapdeal has already paved the way for its omni-channel journey.  This partnership with FreeCharge will further amplify the efforts in narrowing the gap between online and offline shopping experience for customers. FreeCharge with its proven expertise in the digital world will help enhance the payment experience of Shoppers Stop customers. \n \nCommenting on this exclusive partnership, Govind Rajan, COO, FreeCharge and Chief Strategy Officer, Snapdeal said, “It is an honour to partner with a hallowed brand like Shoppers Stop. We are excited to redefine the shopping experience at Shopper Stop with the FreeCharge Wallet. FreeCharge Wallet is a step jump in the payment experience - faster, more secure and more rewarding than any other form of payment including cash. This partnership will allow our 87 million users to get the best of shopping experience at Shoppers Stop. We envision the future of payments to be digital and it is going to be all pervasive.” \n \n“We have partnered with FreeCharge to offer our customers the option to use a mobile wallet to complete their shopping journey,” said Govind Shrikhande, Customer Care Associate & Managing Director, Shoppers Stop Ltd. The popularity of Digital Wallets has been on the rise and we are delighted to partner with India’s leading digital payment platform. With the addition of the FreeCharge wallet, our customers will now have multiple payment options for a smooth, fast and convenient shopping experience. We strongly believe that this alliance with FreeCharge will give a significant fillip to the growth of our omni-channel business, he added. \n \nThe company said that the FreeCharge Wallet integration will be rolled-out within a few weeks. Elaborating on the partnership Sudeep Tandon, Chief Business Officer, FreeCharge said, “ With this partnership we bring together the best of retail and digital payments to create a seamless transaction experience for consumers both in the online and offline world. We plan to roll out some exclusive customer experience and customer delight features never before seen in the market.” \n \nFreeCharge is focused on changing consumer habits in the digital space and understand that the world will embrace habit commerce in future. Digital Wallets will play an important role in driving habits especially in the offline space.", "source": "CXOtoday"}