{"published": "2015-09-30T13:12:32Z", "media-type": "Blog", "title": "Fuji launches the new instax mini 70!", "id": "e75fff67-9f9f-4fcc-89cf-d0888bb9d911", "content": "Fuji announced the new instax mini 70. And you can already buy it at Amazon US (Click here) .  Don’t know if you know this but Fuji makes more money with these gadgets than with their digital cameras! And it’s constantly on top of the camera sales rankings at Amazon (full list here) . \nAll that thanks to one feature that never stops to be intruiguing: Having a real developed picture in your hand and not on your LCD screen!   Here is he full instax mini 70 press release:  \nFUJIFILM Corporation (President: Shigehiro Nakajima) is proud to announce that it will release the instax mini 70, a new model to join the ‘instax mini’ series of instant cameras which produce credit-card-size photos instantly, on October 23. The instax mini 70, which comes in three new colors including “Canary Yellow,” “Island Blue,” and “Moon White,” features the Auto Exposure Control Function to capture both the main subject and background in natural brightness as well as the newly added ‘Selfie’ mode. With its modern design the instax mini 70 broadens its appeal to not only young women, but also men in their 20s and 30s, making it a perfect fashion statement at any scene for any occasion at any time. \n \nThe instax mini 70 has a variety of shooting modes which allow the user to enjoy photography in a variety of situations. While taking ‘selfie’ shots, users can choose the ‘Selfie’ mode to provide the appropriate brightness and shooting distance for their ‘selfie shots’ and use the Selfie mirror beside the lens to check their framing. Features such as the tripod mount and the self-timer function are perfect for group shots. In addition, the ‘Macro’ mode can be used for shots at a minimum of 30cm from the subject and the ‘Landscape’ mode is suitable for far away landscape pictures. \n \nThe instax mini 70 also features the Auto Exposure Control Function to capture both the main subject and background in natural brightness. Without having to configure a special setting, users only need to press the shutter button and the camera can automatically detect the surrounding brightness and adjust the shutter speed and flash amount accordingly. This function delivers images with a natural brightness even for indoor shots, which normally tend to have a dark background. The ‘instax mini’ series is especially popular among teens and women in their 20s and 30s as a camera that produces analog photos instantly. While digital photographs have been preferred with the proliferation of digital cameras and smartphones, the analog approach of instantly producing real photos has sparked interest and inspiration, with sales growing quickly not only in Japan, but also in over 100 countries and regions around the world including East Asia, Europe and the United States. \n \nFujifilm is committed to the attractive features of instax cameras that offer enjoyable instant photography and printing, while communicating the intrinsic values of photography in the different aspects of “taking, preserving, decorating and sharing.” \n Main features  \n(1) Modern and simple design \n \nThe three new colors (“Canary Yellow,” “Island Blue,” and “Moon White”) and the modern, stylish design of the instax mini 70 appeal to all demographics , making it a perfect fashion statement at any scene for any occasion at any time. \n \n(2) Automatic Exposure Control \n \nThe instax mini 70 features an Automatic Exposure Control, which captures both the subject and the background in beautiful clarity. When the user presses the shutter button, the camera automatically detects the amount of ambient light and adjusts the shutter speed and flash amount accordingly. It delivers photos with a natural brightness even for indoor or wedding shots, which tend to have dark backgrounds when captured with conventional cameras. \n  \n(3) Versatile shooting modes \n \nThe camera is equipped with the new ‘Selfie’ mode for taking ‘selfies.’ Users can press the selfie button when shooting, so that the camera can automatically adjust the focal length and brightness to the level optimized for selfie shots. The selfie mirror beside the lens is useful to check the framing to achieve the best angle. Other convenient shooting features include the ‘Self-timer’ for group shots, ‘Macro’ mode for close-up shots at a minimum of 30cm from the subject, and the ‘Landscape’ mode for landscape pictures. \n \n\n \n\n\nThe post Fuji launches the new instax mini 70! appeared first on mirrorlessrumors .", "source": "mirrorlessrumors"}