{"published": "2015-09-19T14:00:46Z", "media-type": "Blog", "title": "From Pastor Greg's Desk", "id": "e62b92f1-8d1b-42fb-a995-73b9432c6806", "content": "Have bottles and cans? We'll gladly take them off your hands!\n\nYes, families at EGC are collecting bottles and cans as a way to raise funds for the REACH project. Check out our progress meter to the left—we're just over half our fundraising goal!\n\nDesignated drop-off containers can be found in the Grade School classroom at our Lima campus. For questions, please contact Emily Seymour at emilyseymour@elimgospel.org.\n\n\n\nTake a look below to see what our Kids Ministry is teaching this week!\n\nIn the Lima Campus 34's classroom: I Can Obey—Solomon Obeys\n\nTalk About It: God knew Solomon would obey, so He gave him a very important job. When we obey, our leaders will trust us to obey with even bigger things.\n\nBible Connection: \"You will be blessed if you obey the commands of the Lord your God…\" Deuteronomy 11:27 \n\nChallenge for families: Get out some building blocks or a Lego set. Build a house together. Talk about house Solomon built a house for God. Think together about what a house for God might be like. Tell your child that God is with you right now, and that He can come and make His home in our hearts. \n\n\n\nIn the Lima Campus 5K's classroom and the Henrietta Campus Preschool classroom: Jesus Shows Me How to Live—The Lost Coin\n\nTalk About It: Jesus told a story about a woman who searched for a lost coin. His story shows us that we should tell those who don’t know Jesus all about God’s love. \n\nBible Connection: “Follow My teachings and learn from Me...” Matthew 11:29\n\nChallenge for families: Whenever you find some loose change, remind your child that just like this change, Jesus is always looking for those who don’t know Him.\n\n\n\nIn the Grade School classrooms: God's House—Wrap-Up\n\nThis week's main point: God is speaking to all of us about our relationship with Him. What's He saying to you?\n\nMain verse: Luke 14:15-24 (The Parable of the Great Banquet)\n\nChallenge for Kids: Take time to listen to God this week about your relationship with Him, and then take action on what He says!", "source": "EGC Kids"}