{"published": "2015-09-19T21:04:39Z", "media-type": "News", "title": "Energen PT Lowered to $56.00 at Citigroup Inc. (EGN)", "id": "f1712fcd-8dd8-4e17-945d-3f54f7bff06c", "content": "Filed Under: Analysts Price Targets • Market News \n\nCitigroup Inc. reduced their price objective on shares of Energen (NYSE:EGN) from $59.00 to $56.00 in a research note issued on Monday, Market Beat Ratings reports. The brokerage presently has a “neutral” rating on the stock. Citigroup Inc.’s price objective would indicate a potential upside of 9.78% from the company’s previous close. \n\nEGN has been the topic of a number of other reports. KeyBanc cut their target price on Energen to $76.00 and set an “overweight” rating on the stock in a research note on Wednesday, August 26th. Deutsche Bank reissued a “buy” rating and issued a $77.00 price objective on shares of Energen in a research note on Monday, August 10th. Raymond James upgraded Energen from a “market perform” rating to an “outperform” rating and set a $70.00 target price for the company in a report on Monday, August 10th. Cowen and Company reiterated a “market perform” rating and set a $54.00 price objective (down previously from $60.00) on shares of Energen in a report on Tuesday, September 8th. Finally, Global Hunter Securities reduced their target price on Energen from $80.00 to $65.00 and set a “neutral” rating for the company in a research note on Tuesday, July 21st. One research analyst has rated the stock with a sell rating, six have given a hold rating and ten have assigned a buy rating to the company’s stock. The stock has a consensus rating of “Buy” and a consensus price target of $75.25. \n\nShares of Energen (NYSE:EGN) traded down 2.69% on Monday, reaching $51.01. The company’s stock had a trading volume of 1,081,227 shares. The firm has a market capitalization of $4.02 billion and a PE ratio of 9.46. Energen has a one year low of $43.75 and a one year high of $77.12. The firm has a 50-day moving average price of $51.11 and a 200 day moving average price of $62.69. \n\nEnergen (NYSE:EGN) last issued its quarterly earnings data on Thursday, August 6th. The company reported $0.10 earnings per share (EPS) for the quarter, missing analysts’ consensus estimates of $0.22 by $0.12. The business earned $168.30 million during the quarter, compared to analyst estimates of $273.68 million. Energen’s revenue for the quarter was down 37.9% on a year-over-year basis. During the same quarter in the previous year, the business posted $0.48 EPS. On average, analysts anticipate that Energen will post $0.83 earnings per share for the current fiscal year. \n\nThe firm also recently announced a quarterly dividend, which was paid on Tuesday, September 1st. Stockholders of record on Friday, August 14th were given a dividend of $0.02 per share. This represents a $0.08 dividend on an annualized basis and a dividend yield of 0.16%. The ex-dividend date of this dividend was Wednesday, August 12th. \n\nEnergen Corporation (NYSE:EGN) is an oil and gas exploration and production firm with headquarters in Birmingham, Alabama. The Company has 1.1 billion barrels of oil-equivalent proved, probable, and possible reserves and another 2.2 billion barrels of oil-equivalent contingent resources. These all- domestic reserves and resources can be found mainly in the Permian Basin in west Texas. Energen also has operations in the San Juan Basin in northern New Mexico. \n\nReceive News & Ratings for Energen Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Energen and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News"}