{"published": "2015-09-23T04:33:39Z", "media-type": "News", "title": "Why Power Plant Executives Should Be Involved in Regulatory Climate Discussions", "id": "3c38e3b7-b408-4d84-86b6-b53de2660eda", "content": "Robert C. Flexon, President and Chief Executive Officer of Dynegy, a speaker at the marcus evans Power Plant Management & Generation Summit Fall 2015, discusses the challenges of the current regulatory climate in the U.S. \n\nInterview with: Robert C. Flexon, President and Chief Executive Officer, Dynegy \n\nTOKYO, Sept 23, 2015 - (ACN Newswire) - \"Companies must focus on what they are good at and make sure they run plants safely, environmentally responsibly and cost effectively. Plants need to be well maintained and companies should not accept periods when their plants go down for extended maintenance because of unplanned outages and things of that nature,\" advises Robert C. Flexon, President and Chief Executive Officer, Dynegy. \n\nFlexon is a speaker at the marcus evans Power Plant Management & Generation Summit Fall 2015 taking place in Houston, Texas, October 25-27. \n\n- What is your outlook on the future of fossil based energy? \n\nEven though the U.S. government seems to be pushing towards natural gas, we will continue to need a diversified fuel base since natural gas is an intermittent resource and fossil based or nuclear based energy sources are needed to provide true baseload capability not dependent upon the sun shining or the wind blowing. \n\nThe environment for power generators has been very challenging, and we have seen a lot of retirements because of either economic or environmental reasons. Through the decades reserve margins are tightening, and we are currently seeing a rationing of supply; so assets in the ground are becoming more valuable. Power plant success really boils down to if companies have the right assets in the right markets; if they meet the environmental requirements, and if the market they are in compensates them adequately for their assets in the ground. \n\n- What are the challenges of the current regulatory climate? \n\nThe regulatory environment attracts a lot of politics. The market was designed to be a competitive market which should be free of political interference, but that is not the case. We have been witnessing companies that were once advocates for the competitive market, now that the times are tougher, trying to get special deals from the state; and in doing so they disrupt the economics of the market and the most efficient generators are the ones that suffer. The regulatory environment of creating special deals for individual companies is a threat to the competitive model. \n\nFurthermore, the U.S. Environmental Protection Agency has been very aggressive, making it pretty clear that there is a war on coal in this country, which puts a lot of added cost and burden on the generators. In addition, the regulatory environment is very volatile. A law can be issued one day, and it gets repealed the next day. Then another law comes in the following day. So there is a lack of stability and long term planning around the regulatory environment. We need a national policy, instead of the approach we currently have, where every state has different laws. \n\n- How should power plant executives tackle these challenges? \n\nSafe, reliable, and efficient operations are the first order of business. Second, we need to be involved in the market design issues, concerning the regulatory environment for the markets in which we operate; so we can help shape the market design laws and try to keep it competitive and free of special deals for individual companies. Also, when it comes to environmental policy, we need to have a voice at the table to help shape environmental rules and regulations that are cost effective and meet the objectives of what is trying to be accomplished rather than try to make political statements. \n\nAbout the Power Plant Management & Generation Summit Fall 2015 \n\nThe Power Plant Management & Generation Summit is the premium forum bringing senior power generation executives, plant managers and solution providers together. Taking place at the Omni Houston Hotel, Houston, Texas, USA, October 25-27, 2015, the Summit includes presentations on analyzing the challenges and opportunities for fossil-fired generation, keeping track of regulatory climate obligations, and looking at strategies to minimize environmental impacts. \n\nFor more information please send an email to info@marcusevanscy.com or visit the event website at www.ppmgsummit.com/RobertCFlexonInterview \n\nmarcus evans group - environment/utilities/ energy - www.marcusevans.com/reviews/energy \n\nThe Energy Network - marcus evans Summits group delivers peer-to-peer information on strategic matters, professional trends and breakthrough innovations. \n\n- LinkedIn: www.linkedin.com/groups?gid=3792251&trk=hb_side_g \n- YouTube: www.youtube.com/MarcusEvansEnergy \n- Twitter: www.twitter.com/meSummitsEnergy \n- SlideShare: www.slideshare.net/MarcusEvansEnergy \n\nPlease note that the Summit is a closed business event and the number of participants strictly limited. \n\nAbout marcus evans Summits \n\nmarcus evans Summits are high level business forums for the world's leading decision-makers to meet, learn and discuss strategies and solutions. Held at exclusive locations around the world, these events provide attendees with a unique opportunity to individually tailor their schedules of keynote presentations, think tanks, seminars and one-on-one business meetings. For more information, please visit www.marcusevans.com. \n\n- Twitter: www.twitter.com/meSummitsGlobal \n- YouTube: www.youtube.com/user/MarcusEvansGroup \n- SlideShare: www.slideshare.net/MarcusEvansSummits \n\nAll rights reserved. The above content may be republished or reproduced. Kindly inform us by sending an email to press@marcusevanscy.com. \n\nSource: marcus evans Summits \n\nContact: \nLuzdary Hammad, \nPress Manager, marcus evans, Summits Division\nTel: +357 22 849 385\nEmail: press@marcusevanscy.com", "source": "Benzinga.com"}