{"published": "2015-09-21T05:30:24Z", "media-type": "News", "title": "imortgage Promotes Dan Pena to Senior Vice President, National Joint Ventures", "id": "301d6cf8-ba1d-45c8-aad6-8e858fa88339", "content": "]]> \nSCOTTSDALE, Ariz. , Sept. 21, 2015 /PRNewswire/ -- imortgage, a national retail mortgage lender and division of loanDepot LLC, today announced the promotion of Dan Peña to senior vice president of national joint ventures. In this newly created executive role, Peña will be responsible for providing leadership, guidance and operations oversight for imortgage's fast-growing joint venture partnerships that have funded nearly $1 billion in home loans to date in 2015. \n\nA 20-year lending industry veteran, Peña was formerly vice president of operations at imortgage, where he managed the daily loan processing function for imortgage in the division's centralized and branch locations.  \n\n\"Dan's deep knowledge and experience in mortgage lending, coupled with his 15-year tenure at imortgage where he excelled in a variety of roles, uniquely qualifies him to deliver our service-driven and customer-focused culture to our joint venture business partners,\" said Dean Bloxom , president of imortgage. \"We're very fortunate to have Dan as part of our senior leadership team. He has played a pivotal role in our organization's growth for many years, helping make our joint venture business one of the finest in the nation. I'm confident his success will carry over into his new, broader role for the organization.\" \n\n\"I'm extremely proud to champion imortgage's unrivaled customer experience to our homebuilder and real estate broker partners,\" Peña said. \"Today, imortgage has a stellar reputation for highly successful working relationships with some of the nation's largest builders. My passion has always been matching individual home buyers with specific loan services that meet their unique needs.\" \n\nPeña joined imortgage in September 2000 . During his 15 years, he gained experience in originations, fulfillment and operations. Peña built his career on providing clear direction and overseeing departmental management that continually maintained low turn times and on-time closings. \n\nPeña is a graduate of Northern Arizona University with a degree in Business and Economics. \n \nABOUT IMORTGAGE  \nimortgage is a leading private nonbank national retail mortgage lender based in Scottsdale, AZ. Established in 1999, imortgage operates 90+ local lending stores throughout the United States and is one of the fastest-growing, most well-respected retail lenders in the country today. imortgage delivers a service-driven, customer-focused home loan purchase experience which has earned the company the exclusive Eliant Certification for Customer Service Excellence. imortgage is a division of loanDepot, LLC operating under NMLS# 174457. Learn more about imortgage at  imortgage.com . \n\nABOUT LOANDEPOT  LLC \nLaunched in 2010, loanDepot LLC is an emerging-growth nonbank consumer lender and market leader offering mortgage and nonmortgage lending products in all 50 states. Founded in 2010 by industry pioneer and innovator Anthony Hsieh , loanDepot LLC operates under the brand names loanDepot.com, imortgage, Mortgage Master, and LDWholesale. The company maintains headquarters in Foothill Ranch, CA , operates 139+ local loan stores offering lending products to consumers nationwide, and generates loan production from five technology-enabled business centers. More than 4,500 people are employed by loanDepot, including 1500+ licensed loan officers. As America's lender, loanDepot is disrupting consumer finance and redefining the market with less division between mortgage and nonmortgage credit amid changes in consumer behavior and technology, access to credit, economic cycles and market consolidation. loanDepot LLC is an approved seller and servicer for Fannie Mae, Freddie Mac and Ginnie Mae . loanDepot.com, LLC, NMLS # 174457 Learn more at loanDepot.com. \n\nContact: \nJulie Reynolds | loanDepot, LLC \n949.595.7110 | [email protected] \nJennifer DuBois | loanDepot, LLC \n949.470.6355 | [email protected] \n\nPhoto - http://photos.prnewswire.com/prnh/20150918/268159  \nLogo - http://photos.prnewswire.com/prnh/20140821/138627  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/imortgage-promotes-dan-pena-to-senior-vice-president-national-joint-ventures-300145782.html \n\nSOURCE  imortgage", "source": "Sys-Con Media"}