{"published": "2015-09-07T09:55:49Z", "media-type": "News", "title": "Bazaarvoice makes some progress, but loses Chief Revenue Officer", "id": "10e8f4f3-7eeb-4006-8067-05604c1fd7ed", "content": "SUMMARY: Social shopping tools provider Bazaarvoice is making some progress on getting back on track, but will Wall Street’s patience hold out? \n  \nGene Austin \n \nWhen we last touched on Bazaarvoice , CEO Gene Austin was urging everyone to move forward from the unfortunate position in which the social shopping tools provider had found itself. \n \nThe firm had been ordered in 2013 by the US Department of Justice (DOJ) to divest the PowerReviews business that had been acquired in 2012, on the grounds that the deal broke antitrust rules. That situation was settled in April last year, but the negative knock-on impact still needed shaking off. \n \nFlash forward to this month and there’s some small sign of improvement as losses at the firm narrowed to $10.24 million for the quarter ended 31st July 2015 against a loss of $11.56 million year-on-year. Revenue during the quarter grew 6.31% to $48.88 million from $45.98 million in the previous year period. \n \nBut for every step forward, there’s a stumble it seems – and the loss of Chief Revenue Officer Kelly Connery might well be read as pretty major stumble at that. (Connery’s moving on to a 6 month contract worth $26,000 a month while a successor is found.) \n \nAustin, to whom the sales team will now report directly, tries to put a philosophical spin on this: \n \nWe’ve had a number of executives both come and go in the business and I think that’s a healthy part of any company that’s evolving, especially that a company that’s transforming. In the case of our CRO, he was one of our sales leaders for the last four years, being CRO for the last 15 to 18 months. [It’s been a] very tough four years for the company and we got to a point where we decided that a transition was the right thing for everybody involved. \n \nBut Connery’s departure certainly contributed to Morgan Stanley’s Stan Zlotsky arguing that it’s likely to take longer now for Bazaarvoice to hit its 15-25% revenue growth ambitions. \n \nAustin certainly is aware that the firm has tried the patience of Wall Street, but insists that progress is being made: \n \nEighteen months ago I seized the reins of Bazaarvoice. Our business predictability was not strong, our client satisfaction low and we lacked a plan in product development. Since that time we’ve worked tirelessly to right the ship in client’s satisfaction, reintegrate innovation products in both products and services and drive stronger operational cadence throughout the business. \n \nWe are returning to a normal competitive environment. The DOJ stipulation requiring us to release our clients from their contract without penalty, should they move to PowerReviews expired on July 8, for the majority of our clients. As a result we are seeing a much more normal competitive environment unfold, where we expect to win and retain our clients due to our strong line-up of solutions, services and overall value. \n Back to basics – and evolution  \nThe key now is a combination of ‘back to basics’ running tandem with reinvention and expansion of the business model. Austin argues: \n \nFrom our origins as a leader in ratings and reviews for brands and retailers we’ve added additional products and services like Curations, Local Sampling and now Spotlights to provide an unparalleled portfolio versus our competition. We are fortunate to have over 1,300 retailers and brands as active clients and through the power of our Brand Invite and Syndication services we have created a large dynamic network of active shoppers. \n \nLike any network the more it grows, the more valuable it becomes for all parties involved; retailers, brands and shoppers.Our network is the foundation of our future and here are some statistics which speak to its size and scale. Over 625 million active shoppers each month, 71 billion impressions in the first quarter, an increase of approximately 16% year-over-year, hundreds of thousands of reviews syndicated daily across the network, over a 100% year-over-year growth in syndication relationships within the network. The total number of brands and retailers now totals more than 5,500, thanks in large part to our Brand Invite program. \n \nAs our network grows, not only do we have more opportunity to expand our SaaS based solutions, but we believe we have a very compelling opportunity to help brands and retailers reach in-market shoppers. We call this initiative Shopper Marketing and while we’re early, we are optimistic about the opportunity. Shopper Marketing allows brands to reach a particular segment of shoppers with the right content at the right time whether that be in a digital display ad on a desktop or as part of their in-store experience with product promotions and purchase recommendations served directly to their mobile devices. \n \nBazaarvoice \n \nThere’s also a major new data-centric initiative coming into play, says Austin: \n \nWe see significant value in our shopper data. Over 625 million unique in-market shoppers engage with the content provided by our solutions each and every month. As such we are now able to construct segments such as big screen TV shoppers, or Pet Food shoppers. We are now testing the efficacy of our data versus data from other sources and while it is early our first test results were very positive. \n \nHe adds: \n \nThe performance of our data so far has been significantly better than what we’ve seen from other sources for ad-targeting. We’ve got more work to do, but the indications are that we have the value in our data that we’ve always talked about. \n \nWe as a company have been in the process of acquiring rights to the data inside the network. It was something that was not part of our standard contracts. We’ve been working on that, we’ve made tremendous progress with a number of well-known retailers and brands to acquire rights for the data. \n \nSo, now we have a critical mass that we can actually do some nice testing and we’re actually selling the opportunity to do shopper advertising or shopper targeting for in-market shoppers to certain segments. At this point we don’t have material revenue to discuss on that but we are excited about what we’re seeing and we are beginning to target certain members of our customer base to begin pilots, which would be low revenue but will give us continuingly (sic) more information about the strength of our data. \n My take  \nSlowly, slowly, but some moves forward. But there’s a very long way to go yet. The question is whether Wall Street’s going to give Austin time to execute fully on his turnaround strategy. \n     \nStuart Lauchlan \n\nStuart Lauchlan has been tracking and commenting on the enterprise IT market for 23 years during which time he's managed to amuse, inform and irritate buy and sell side participants in equal and appropriate measure. Lauchlan also helps companies understand the needs of technology readers. \n       @whostu \nTech journalism - the accident from which I've never recovered \n       Latest posts by Stuart Lauchlan ( see all )", "source": "Diginomica"}