{"published": "2015-09-19T14:28:08Z", "media-type": "News", "title": "Vladimir Putin and Silvio Berlusconi named in criminal case over 240-year-old bottle of wine", "id": "04f06dad-bbe8-4766-a1f0-1787848aae45", "content": "Ukrainian prosecutors are preparing criminal charges against a woman who allegedly uncorked a 240-year-old bottle of wine for Vladimir Putin and Silvio Berlusconi. \n    \nThe Russian President and former Italian Prime Minister, said to be firm friends, were on a tour of Crimea when they visited the famous Massandra estate. \n\nThe pair spent the weekend together on the peninsula, which was annexed by Russia more than a year ago as the Ukrainian crisis continued.  Vladimir Putin on a tour of the Massandra Winery in Crimea   \n\nOne of their trips was to the Massandra winery, the oldest in Crimea, which has gained a global reputation for its fine products since it was founded in the 1890s. \n\nFootage broadcast on Russian television showed Mr Berlusconi examining a vintage bottle from its vast cellars during a tour, and asking the winery's director if he could try it. \n\nYanina Pavlenko duly obliged, Russian newspaper Promyshlennie Vedomosti reported, with a witness describing how she uncorked a precious bottle of Jeres de la Frontera. \n\nAlso known as Massandra Sherry 1775, it is one of the oldest and most expensive wines in the world, according to the winery’s website.  Mr Berlusconi in the cellars of the Massandra Winery   \n\nUkrainian prosecutors for Crimea, who are working in exile, say the bottle was worth more than $90,000 (£58,000), Radio Free Europe reported. \n\nWhen the peninsula was annexed, Massandra only owned five of the famous bottles, after two were sold at Sotheby's auctions, with the personal authorisation of then Ukrainian President Leonid Kuchma. \n\nThe successful bidder paid almost $50,000 (£32,000) at the 2001 auction, which then went to the government to fund the development of Massandra and wine-making in Crimea. \n\nUkrainian prosecutors are reportedly looking into filing embezzlement charges against Ms Pavlenko, who is also wanted for alleged “treason” after voting in favour of the Russian annexation of Crimea. \n\n“This is one of the five bottles that constitute not only Massandra's or Crimea's heritage, but the heritage of all Ukrainian people,'' Nazar Kholodnytsky, first deputy prosecutor for Crimea told the Associated Press in Kiev.  Vladimir Putin and Silvio Berlusconi walking along a seaside esplanade in Yalta, Crimea   \n\nMr Putin and Mr Berlusconi are both reportedly named in the case over “large-scale misuse of property”. \n\nDuring the two-day trip to Crimea, they also laid flowers at a war memorial, toured the seaside, inspected an archaeological dig and visited three palaces and a cathedral. \n\nMassandra was Ukrainian government property before Russia's annexation of Crimea in March 2014, but has since been nationalised by the Kremlin. \n\nAdditional reporting by PA", "source": "The Independent"}