{"published": "2015-09-08T16:24:11Z", "media-type": "News", "title": "UBS Reveals Refreshed Brand Strategy and Identity Developed With Prophet", "id": "21ad02fc-e54f-4a4b-b22f-a814b35dc0ed", "content": ") - Following a successful restructure over the past few years, UBS, the world's leading wealth manager and number one bank in Switzerland, has unveiled refreshed brand values, identity and strategy. \n\nGlobal brand consultancy Prophet worked with UBS's top management team and employees to devise the brand proposition. The new direction conveys a renewed brand personality that focuses on being optimistic by nature, purposely intelligent and confidently human. \n\n\"We surveyed more than 7,000 internal and external stakeholders of UBS and found that they particularly value the close relationship and partnership that the bank brings to the table, its exceptional expertise and flawless execution as well as the long-term approach that it applies. We used these insights to craft a new positioning for UBS,\" said Tosson El Noshokaty, Partner at Prophet.\n\n\"We also conducted several initiatives to ensure UBS's employees were engaged with the new brand strategy. In fact, the bank chose to launch its refreshed approach with a three month internal campaign before going public -- proving how strongly it believes in its employees as ambassadors of the brand,\" added El Noshokaty.\n\nThe new brand identity, developed by teams in Prophet's Berlin and San Francisco offices, focuses on bringing customer centricity and emotion to the center of the campaign. UBS is committed to providing private, institutional and corporate clients worldwide, as well as retail clients in Switzerland, with superior financial advice and solutions, while generating attractive and sustainable returns for shareholders. Its strategy centers on its Wealth Management and Wealth Management Americas businesses and its leading universal bank in Switzerland, complemented by its Global Asset Management business and its Investment Bank. These businesses share three key characteristics: they benefit from a strong competitive position in their targeted markets, are capital-efficient, and offer a superior structural growth and profitability outlook. UBS's strategy builds on the strengths of all of its businesses and focuses its efforts on areas in which it excels, while seeking to capitalize on the compelling growth prospects in the businesses and regions in which it operates. Capital strength is the foundation of its success.\n\nUBS is present in all major financial centers worldwide. It has offices in more than 50 countries, with about 35% of its employees working in the Americas, 36% in Switzerland, 17% in the rest of Europe, the Middle East and Africa and 12% in Asia Pacific. UBS Group employs about 60,000 people around the world. UBS Group AG shares are listed on the SIX Swiss Exchange and the New York Stock Exchange.", "source": "Wall Street Select"}