{"published": "2015-09-02T17:09:40Z", "media-type": "News", "title": "NSF International Strengthens Medical Device Consulting With Acquisition of Avarent LLC", "id": "0e5e3005-1485-4786-bf9a-939573618709", "content": "PRWeb \nNSF International, a leading provider of regulatory compliance, quality systems, analytical testing, education and consulting services for the medical device sector, has acquired Avarent LLC, a consulting firm with expertise in medical device products/processes development, design control, validation, quality assurance and regulatory compliance. Avarent will be renamed NSF Avarent. \n\nThe addition of Avarent expands NSF International's portfolio of medical device services to both NSF International and Avarent clients, combining Avarent's expertise with NSF International's experience in regulatory compliance and quality management systems throughout the medical device product lifecycle. \n   \nThe acquisition was made through NSF International's Global Health Sciences Division, and builds on NSF's 2012 acquisition of Washington D.C.-based regulatory compliance consulting firm Becker & Associates and UK-based medical device training and consulting firm Pink Associates, as well as NSF's 2011 acquisition of Pharmalytica, a GLP and GMP contract laboratory. \n\nBenefit of acquisition to NSF medical device clients. As a result of the acquisition, current clients of NSF Medical Device Consulting will gain access to world-class expertise in device products/processes, design control and validation that will help them implement efficient, streamlined and cost-effective manufacturing processes while achieving optimal quality and regulatory compliance. This includes a global network of 80 expert consultants with experience in U.S. Food and Drug Administration (FDA), International Standardization Organization (ISO), Good Automated Manufacturing Practice (GAMP), Health Insurance Portability and Accountability Act (HIPAA) and Sarbanes-Oxley standards and regulations. \n\nServices offered via the Avarent acquisition include: \n\nProduct/Process Development, Delivery and Commercialization - Avarent helps improve and manage development processes and technologies that support and simplify medical device manufacturing and commercial operations.  This includes assistance in design and development planning, design review and design transfer, and process analysis to identify, plan and enact improvements and determine the best approach for project delivery and optimized return on investment (ROI). \n\nRegulatory Submissions - As part of the development process, Avarent ensures requirements for regulatory submission are addressed during design and development planning for software, electromechanical and sterile medical device products, including 510(k) premarket, EU medical device directive/technical file and unique device identifier (UDI) submissions. \n\nUnique Device Identifier (UDI) - Regulatory consulting and management of the UDI program includes program management support, labeling change control management, Global Unique Device Identification Database (GUDID) management and master product tracker management.  Avarent has implemented UDI/GUDID requirements for approximately 2,000 regulated U.S. medical devices across various facilities. \n\nQuality Management System Development - Avarent helps companies establish and maintain tailored quality systems, including compliance with ISO 13485, U.S. FDA Quality System Regulation and other global quality requirements. \nCommissioning, Qualification and Validation - Avarent helps assess a company's current state of compliance and develop a more robust commissioning, qualification and validation practice to support the operational systems. \n\nProject Management - Avarent's experienced project managers possess expertise in the mechanics of building teams, plans, budgets and schedules for global compliance and regulatory projects that involve multiple cross-functional teams. \nBenefit of acquisition to Avarent clients. Avarent clients will gain access to NSF International's team of experts in the regulatory, scientific, analytical testing and compliance fields to bring medical devices to market and sustain them throughout their lifecycle.  NSF Medical Device Consulting assists companies in navigating U.S. and international regulatory hurdles from product inception through product marketing. \n\nNSF's current medical device services include quality systems implementation, remediation and auditing services; regulatory and clinical strategy consulting for medical devices including in vitro diagnostics and combination products; clinical and biological evaluations; and GLP and GMP contract laboratory services such as extractables and leachables testing, clinical and non-clinical bioanalysis, oligonucleotide analysis, biocompatibility testing and toxicological risk assessments. NSF's medical device team also provides essential quality and regulatory training courses taught by some of the most experienced professionals in the industry. \n\nAdditionally, Avarent clients will gain access to other NSF capabilities: \n\nGlobal client support in more than 160 countries, including across Asia, the Middle East, Africa, Europe and Central and Latin America \n\nA global network of ISO 17025-accredited laboratories in Europe, Asia, North and South America \n\nGlobal IT infrastructure with key tools to aid client engagement \n\nAvarent was founded in 2003 by Ian Fleming, with Thomas Dzierozynski joining in 2006. Both Fleming and Dzierozynski will join NSF International as Executive Vice Presidents, reporting to Elaine Messa, President of NSF Health Sciences Medical Device Consulting, and will lead the integration of Avarent services into NSF Medical Device Consulting. \n\n\"The addition of Avarent's technical production process and validation services and technical compliance consulting allows us to go beyond traditional consulting services to reduce costs for our medical device customers through improved operational efficiency,\" said Messa. \"Together, we will provide our clients with more comprehensive solutions that ensure the design and manufacture of safer, higher quality medical devices.\" \n\n\"NSF International and Avarent share the same commitment to delivering smart solutions focused first on patient safety and regulatory compliance. By combining our expertise, Avarent and NSF clients will have access to leading edge consultants dedicated to optimizing medical device design and manufacturing while mitigating risk and ensuring quality and regulatory compliance throughout the product lifecycle,\" said Ian Fleming, Executive Vice President, NSF Avarent, now part of NSF Medical Device Consulting under NSF International's Global Health Sciences Division. \n\n\"The client value of our combined organizations extends beyond strategic consultation to offer delivery of optimized solutions that synchronize business goals with compliance needs.  We will work together to increase awareness at all levels of an organization to drive client buy-in and ownership of the enacted solutions,\" said Tom Dzierozynski, Executive Vice President, NSF Avarent. \n\nIan Fleming has over 18 years' experience working in FDA-regulated industries to deliver system and process improvements for medical device and pharmaceutical companies challenged in balancing business and compliance needs. His experience includes auditing and risk analysis from a compliance and operational perspective as well as assessment, remediation and implementation of quality systems. He has led software/computer system development, remediation and validation efforts as well as 21 CFR Part 11 compliance efforts for ERP/MES systems, relational and object oriented databases, SCADA and process control systems, medical device software, clinical data systems, sample accountability systems, in vitro diagnostics and laboratory data management. Earlier in his career, Mr. Fleming held various roles at Packard BioScience, most recently as Senior Product Specialist, and was a Microbiology Technologist at North American Science Associates. \n\nTom Dzierozynski has over 20 years' experience in the pharmaceutical, medical device and biologics industries. Through comprehensive and practical knowledge of operations, regulatory affairs and quality systems, he has developed and implemented risk-based strategies that integrate varying business functions to drive ownership and improve operational and quality performance.  He's led numerous, technically-oriented projects focusing on design controls, verification and validation, process improvement, regulatory market clearance, risk management and implementation of corrective actions to address/avert enforcement actions. Earlier in his career, Mr. Dzierozynski was Vice President of Validation Services for Quintiles Consulting, and worked at Baxter Healthcare Corporation in diverse quality, engineering and management positions. \n\nFor more information about NSF International Medical Device Consulting, please contact Pete Langlais at hs(at)nsf.org or call +1 734-545-2023. \n\nEditor's note: To schedule an interview with an NSF International medical device expert, please contact Liz Nowland-Margolis at media(at)nsf.org or +1 734-418-6624. \n\nAbout Avarent: Avarent was founded in 2003 on the basis that business and compliance are not mutually exclusive goals. Their staff has direct experience in working in operations and compliance to deliver value-based consultancy that includes: Quality System audits, strategic and tactical execution of worldwide quality system and validation projects, project management, technology solutions and regulatory submissions. They are actively involved in assisting regulated clients worldwide in meeting the current regulatory trends specific to quality management systems, risk management, supplier quality, software and process validation, and medical device regulatory submissions. More information on Avarent is available at http://www.avarent.com . \n\nAbout NSF International ( http://www.nsf.org ): NSF International is a global independent organization based in Ann Arbor, Mich., that writes standards, and tests and certifies products for the water, food, health sciences and consumer goods industries to minimize adverse health effects and protect the environment. Operating in more than 160 countries, NSF is accredited by the American National Standards Institute (ANSI) and is a Pan American Health Organization/World Health Organization Collaborating Center on Food Safety, Water Quality and Indoor Environment.  The NSF Health Sciences Division offers training and education, consulting, auditing, GMP and GLP testing, certification, R&D and regulatory guidance for the pharmaceutical, medical device and dietary supplement industries throughout the product life cycle. ISO 13485 registrations for medical devices and CE marking are delivered through NSF International Strategic Registrations, Ltd. (NSF-ISR). \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12939150.htm \nPRWeb.com", "source": "Wall Street Business Network"}