{"published": "2015-09-21T21:24:20Z", "media-type": "News", "title": "Journalist reports threats from Sanstha", "id": "a916bfb1-c050-467b-a609-69bfe0f1bd4e", "content": "02:57 am Mumbai : Journalist Nikhil Wagle, known for his aggressive stance on various public issues, says he has received threats from Hindu group Sanatan Sanstha. Maharashtra Police have offered him security cover, which he has declined saying as a media person he would not be able to work under such measures.\n\n“Last week, four police officers visited me to offer security and have given a letter to this effect, but I have rejected. I am a journalist. How will I function with security? Moreover, it is the duty of the government to ensure security of all people, not just mine,” Wagle said on Monday. Wagle said he received threats from Sanatan Sanstha on Twitter and also through its mouthpiece Sanatan Prabhat. Last week, the Sanatan Prabhat penned an article warning Wagle on airing his views. Around four years ago, Sanatan Sanstha’s office-bearer Abhay Vartak staged a walkout from a television show hosted by Wagle.\n\nThe Sanatan Sanstha has shot into prominence after one of its activists, Samir V Gaikwad, was arrested from Sangli in Maharashtra and two others from Karnatata in connection with the murder of Communist leader Govind Pansare in February.\n\nPansare, 81, and his wife Uma were shot at by two motorcycle-riding attackers on February 16 near their home. While Pansare died from his injuries four days later, Uma survived but has been left a cripple.\n\nPress Club asks police to take note of threat\n\nThe Mumbai Press Club has called upon Maharashtra Police and the state to take a serious note of the alleged threats issued to senior journalist Nikhil Wagle by Sanatan Sanstha. The Club also expressed concern over Sanatan targeting Shaymsundar Sonnar, a senior journalist with newspaper ‘Prahaar’.\n\nShare this Post: «\n\n« Previous Article Next Article »", "source": "The Freepress Journal"}