{"published": "2015-09-22T01:16:05Z", "media-type": "News", "title": "REVIEW: Depp impresses in ‘Black Mass’", "id": "982e33c6-2c28-489d-aa35-9d093441899b", "content": "As often as Johnny Depp transforms into different characters, very rarely do we forget it’s actually Depp under that ridiculous hat or makeup. What makes his performance in “Black Mass” so outstanding is that he easily hides behind the cold distant eyes of James “Whitey” Bulger. \n \nAudiences should expect no less from director Scott Cooper, after turning out Woody Harrelson’s most menacing performance in “Out of the Furnace,” but it’s not just Depp that brings his acting A-game to the film — just about everyone involved follows suit. \n \n“Black Mass” chronicles the criminal enterprise of Boston’s notorious gangster Whitey Bulger as well as his alliance with friend and FBI agent John Connolly, played by Joel Edgerton. The film shows the partnership from both Bulger and Connolly’s sides while they try to justify their actions to their respective peers. \n \nBulger sees the alliance with Connolly as a way to use the FBI to take out any criminal adversaries that he may otherwise be unable to take on himself. Connolly sees a quick route to the top of the FBI chain of command by using his friendship with Bulger as a way to bring him into the informant program, and the film shows that perhaps Connolly is tempted by the outlaw lifestyle as well. One of the only terms of the deal is that Bulger can’t kill anyone, which of course he quickly disregards. \n \nWhat follows is an interesting look at the good and evil present in just about every character as well as shining a spotlight at a not-so-shining moment in the FBI’s history. \n \nCooper drapes the visuals of this gangster film in a ’70s-era filter and unlike other films which attempt to glamorize thug life, “Black Mass” does not follow their footsteps. The audience will never truly see Bulger as anything other than a thug, and many times may find themselves doubting his humanity at all given his frightening stare, vampire pale skin and unnerving mannerisms. \n \nHis character brushes nicely against Edgerton’s more affable and weak-willed character in Connolly. When confronted with any sort of negative feedback from peers regarding his treatment of Bulger as an informant, he quickly backs down until he begins receiving actual information he’s quick to rub in everyone’s faces. It’s not until later in the movie, after many a rendezvous with Bulger, that he begins to stand his ground, which ultimately leads to more problems and concerns for the character. \n \nWith the exception of these two characters, the rest of the film acts as a revolving door of supporting characters. All of them expertly act but have very little to do in the larger scheme of the movie. Many have at least one great scene but their characters never seem to formally exit the movie, but instead vanish after serve their purpose like many witnesses to Bulger’s enterprise. \n \nThe film also takes its time explaining a good portion of the start of the FBI alliance but then quickly fast forwards through two scenes that could have used a lot more breathing room for the audience to fully grasp the severity and importance of what happens. The ending is also quickly swept under the rug and Bulger’s fugitive status is only addressed in titles passing by on the screen. \n \nThe film as a whole is highly entertaining and that’s due in large part to the performances of the entire cast. Even though certain characters definitely required more screen time, the overall cast fleshed out the world and made other flaws easy to overlook. It may not be as enjoyable as the more popular gangster movies of the ’90s, but “Black Mass” provides a dark and interesting mirror to the films many have grown to love. \n \nBrent Bader is a senior journalism major and a features reporter for The Vidette. He can be reached at vidette_babader@ilstu.edu. Follow him on Twitter at @baderwrites.", "source": "Daily Vidette"}