{"published": "2015-09-02T12:28:30Z", "media-type": "News", "title": "Where's Joe Oliver? Finance minister cancels events, not commenting", "id": "031c52fc-8a6f-4c21-9db2-00541fb0b282", "content": "Former Progressive Conservative prime minister Joe Clark may remain the most famous Joe in Canadian election annals, but the \"Joe Who?\" moniker that followed the underdog Clark may be about to get a run for its money from current Finance Minister Joe Oliver.\n\nWith the 2015 election trail ablaze with talk of recession and the significance of Tuesday's latest economic growth numbers, Oliver is being ridiculed by New Democrats as \"Joe Where?\"\n\nOliver, 75, has been all but absent from the Conservative party's campaign so far, although he's running for re-election in Toronto, the country's media and financial mecca. He cancelled scheduled talks at two Toronto clubs last week and this week without explanation.\n\nHis office did not respond to an interview request from The Canadian Press again Tuesday following the release of second-quarter GDP numbers by Statistics Canada that showed two consecutive quarters of negative growth, the technical definition of a recession.\n\nNDP candidate Andrew Thomson, a former NDP finance minister in the provincial Saskatchewan government of Lorne Calvert, is running against Oliver in Eglinton-Lawrence and used Tuesday's no-show to hammer Conservative economic management.\n\n\"As a candidate who is campaigning actively against Mr. Oliver, I do have to say: Joe, where are you? We're starting to worry about you,\" Thomson said at an Ottawa news conference, as NDP finance critic Peggy Nash chimed in, \"Joe Where?\"\n\n\"I do think it's interesting that the finance minister is missing in action on this file,\" added Thomson.\n\n\"It is an important issue. I think Canadians deserve a response from the senior economic minister of this government and it's a concern that they are instead putting out the spin doctors instead of the man responsible.\"\n\nDefence Minister Jason Kenney was put forward by the Conservatives over the weekend to discuss this week's economic statistics, which are being used to frame the campaign choices on offer by all the major political parties.\n\nPatricia Best, a spokeswoman for Oliver's campaign, derided Thomson as a \"parachute\" candidate in Eglinton-Lawrence commenting from Ottawa.\n\n\"Joe Oliver has been out in the riding knocking on doors and meeting voters several times a day since the beginning of the campaign,\" Patricia Best said in an email.\n\n\"He is receiving an enthusiastic welcome from every community in his wonderfully diverse riding.\"\n\nLiberal candidate Chrystia Freeland, who is running in the Toronto riding of University-Rosedale, called it \"really astonishing\" that the finance minister has been \"invisible\" to journalists given the importance of economic management to voters' decision-making.\n\nBut Freeland said it follows on Oliver's question period performances in Parliament, where she said opposition MPs dubbed him \"No-show Joe\" because questions on his portfolio were fielded by other Conservative ministers.\n\nOliver's most direct, immediate contribution to Tuesday's debate over the economy amounted to a single Twitter post, where he asserted that \"GDP increased in 2nd quarter by almost $4 billion - from beginning of April to end of June, a result of a buoyant month of June, up 0.5%.\"\n\nBy way of explanation, Best pointed to Statistics Canada charts that show an increase of almost $4 billion in GDP between March's figures and June's. Those same charts show GDP down more than $2 billion from January to June and down more than $6 billion from December's figure.\n\n\"There's a reason that economists have a technical definition of recession: To prevent politicians from cherry-picking and so that there can be an agreed upon standard of saying 'this is a recession',\" said Freeland, a former financial journalist.\n\nOverall second-quarter GDP numbers were down 0.5 per cent on an annual pace, according to Statistics Canada, following a decline of 0.8 per cent during the first three months of 2", "source": "CBC"}