{"published": "2015-09-12T04:20:24Z", "media-type": "News", "title": "Public health district approves budget, closes navigation program", "id": "09b7f55d-d627-46b0-986a-b28de921a399", "content": "A new board member has been approved and a navigation program closed following the Public Health District meeting held at the Montgomery County Hospital District administration building in Conroe on Thursday. \n  \nThe Board unanimously approved the Commissioners Court nomination of Precinct 3 Commissioner James L. Noack as a Board member. \n      \nMCHD Chief Executive Officer Randy Chief said Noack will replace former County Judge Alan Sadler on the board. He said the members also approved the 2015-2016 Board budget. \n \n“Our expenses went down about 36 percent,” Chief Financial Officer Brett Allen said. “We have a budgeted surplus of about $416,000.” \n \nAllen said about 75 percent of the revenue is derived from the Medicaid 1115 Waiver that is funding the community paramedicine program. The decrease in expenses is a result of closing two of the Public Health District’s waiver programs. \n \n“We had three programs last year, the navigator, community paramedicine, and health and wellness,” Allen said. “As we went along, we really saw the navigator program as being duplicative with our community paramedicine program.” \n \nThe navigation program “focuses on reaching out to the underserved and providing the necessary link to healthcare services, as well as assist in securing a medical home for them,” according to the MCHD website. \n \nTo prevent the overlap, the CFO said the district rolled the navigation and paramedicine programs together. He said no jobs or services will be lost. \n \n“Rather than getting funding separately for those from the state, we rolled those together, closed the program,” he said. “That relieves the state the burden of having to match funding with us. That was in our mind a good thing and being a good steward of those dollars.” \n \nAllen said the state was impressed that the Board was being “good stewards” with the funds. \n \n“They’ve now come back and given us some options on some additional projects,” Allen said. “They’ve seen how successful the community paramedics program is, so we are looking at some options and we will come up with some recommendations for some projects that would be of value to the community.” \n \nDetails were not immediately available as the projects are still in the discussion phase.", "source": "Houston Villager"}