{"published": "2015-09-25T13:55:00Z", "media-type": "Blog", "title": "Focus helps Electrolux to clean up with Supplier-Enabled Innovation", "id": "6157c05c-dc5c-438b-beb3-c51a8675d944", "content": "MEMBER RESEARCH & CONTENT\nCOMMUNITY & CONNECT\rCOLLABORATE\rCASE STUDIES & INTERVIEWS\rMAGAZINE\rEVENT WRITE-UPS\rTHOUGHT LEADERS\rNEWS\rANALYSIS\rPROCUREMENT INTENTIONS\rCOMMODITY WATCH\rPROCUREMENT STRATEGY\rCATEGORY MANAGEMENT\rCOST & CASH MANAGEMENT\rCSR\rGLOBAL SOURCING\rPROCUREMENT TECHNOLOGY\rOUTSOURCING\rRISK\rSRM\rTALENT & LEADERSHIP\rCATEGORY INTELLIGENCE\rCONSULTING & PROF. SERVICES\rFACILITIES\rENERGY & UTILITIES\rHUMAN RESOURCES\rINFORMATION TECHNOLOGY\rLOGISTICS\rMARKETING\rMRO\rPRINT & PACKAGING\rRAW MATERIALS\rTELECOMMUNICATIONS\rTRAVEL & FLEET\rEVENTS\rACADEMY\rBLOG\rMAGAZINE\rSUCCESS STORIES\rPARTNERS\rSearch:\nABOUT\rCONTACT US\rMEMBERSHIP\rLOGIN\r \r Remember Login Request new password\rDavid Rae Focus helps Electrolux to clean up with Supplier-Enabled Innovation 25-Sep-15 13:55\rIn a previous post, I discussed the concept of idea generation and suggested that CPOs shouldn’t view the process as an end in itself – metrics shouldn’t be in place to track the number of ideas, for example, and nor should CPOs be rewarding staff based on the volume of ideas generated.\r \rRather, Supplier-Enabled Innovation (SEI) is a culmination of several activities: idea generation being just one of them; idea screening and challenging, for example, are just as important as the original idea generation, yet we are unlikely ever to incentivise our staff in this area.\r \rRather, our focus should be on generating ideas and attracting proposals in the right areas – and aligning procurement with business stakeholders is key in this respect.\r \rWith this in mind, I’d like to take you to Stockholm, where I was in town to take part in a Procurement Leaders’ Summit and to present on SEI to a group of senior procurement executives from Northern Europe.\r \rOur chairman for the day, Olle Tholander, VP Group Sourcing and Partnering at Ericsson, asked each of the attendees to offer an insight into what they wanted to get from the session, and I was pleased that a significant number mentioned innovation as being a major focus. Maybe a third of the room said so. Whether that number increased by the end of the session, I don’t know, but I would certainly like to think so.\r \rOne of the attendees was Gregoire Letort, CPO of Electrolux, and someone who ‘gets’ the whole SEI concept. He said that a key driver of SEI at his organisation was competitive pressures from Asia, combined with the fact that his suppliers were spending proportionally more on R&D than Electrolux itself. It would be crazy not to tap into that resource, he said.\r \rWithout going into detail on how Electrolux does that (you can read about how the company structures SEI and works with open innovation and R&D here) I thought it was worth pulling out just one aspect of the SEI process at Electrolux – how it guarantees a focused approach to idea generation and new business proposals.\r \r“It comes from two angles – one is the consumer and marketing one, where we look at megatrends and consumer-useful features,” he told me. “And the other one is the R&D and technology angle, where we are focusing on the roadmap for the technologies we want to work on for the future. The key really is to narrow a little bit which technology you want to focus on.”\r \rThis focus allows Electrolux to then select a reasonable number of suppliers for input and proposals, and means that its foray into the world of universities, start-ups and even individual inventors is both targeted and efficient.\r \rOne example of pure SEI that has come through the Electrolux programme is a newly developed “easy lift dish” for its dish washers, which uses a mechanism attached to the lower drawer that brings it to the height of the upper drawer when it is pulled out of the washing machine, for easier loading and unloading. The product will launch early next year, with the solution having already been revealed to the trade.\r \rWhat’s great about this example is that the mechanism didn’t come from a supplier serving the relevant category, but from a different supplier that was only given the opportunity to work on the project because Electrolux’s innovation programme is in place.\r \rIt’s a clear example of SEI delivering tangible value to an organisation – and for procurement, that is surely where we want to be.\r \rFind more blogs on Supplier-Enabled Innovation (SEI) at our Ovation site. To register your interest or to find out more about our Supplier-Enabled Innovation Compass, contact us here. David Rae is Content and Community Director at Procurement Leaders. He is responsible for content strategy and community-driven initiatives and draws on 18 years covering procurement, finance and technology, for senior business leaders.\rFollow David on Twitter: @david_rae\rTags:\rInnovation, Supplier Collaboration, Supplier Development, Supplier Performance, Supplier relationship management, Value creation, advanced  \rSubscribe to feed Print page\rTopics\rInnovation\r |  Supplier Development\r |  Supplier Performance\r |  Supplier Relationship Management\r |  Value Creation\rSUBSCRIBE TO NEWSLETTER FREE  SUPPLEMENTS PREDICTIVE INSIGHT TO FUEL WORLD-CLASS DECISIONS\nUnique, high value research and analysis provides CPO's with the information they need to make the right strategic choices. FREE  WHITEPAPERS OFFERINGS   ABOUT MEMBERS FOLLOW US AWARDS MEMBERSHIP   COMMUNITY   MAGAZINE   EVENTS   ACADEMY   RESOURCES CONTACT US   ABOUT US   ADVERTISE WITH US   FREQUENTLY ASKED QUESTIONS SIGN IN   BECOME A MEMBER   REQUEST A DEMO   JOB SEARCH LINKEDIN   TWITTER   GOOGLE+   RSS   NEWS ARCHIVE TERMS OF USE . PRIVACY POLICY . COOKIE POLICY", "source": "Procurement Leaders Blog"}