{"published": "2015-09-09T22:29:00Z", "media-type": "Blog", "title": "Spotlight on... Artbooty, Brixton", "id": "9f9a607d-8b1c-4dbb-93f1-8a480c953894", "content": "London Design Festival looms and details of interesting events are popping into my inbox.\nIf you've never been, the main thing to know is that, aside from the main events (the likes of Design Junction, Tent and 100% Design) it's pretty much an excuse for the design-inclined to show off and have visually stimulating parties for the best part of a week in September. What's not to love?\nOne such event, Artbooty, part of Brixton Art Trail as well as the London Design Festival (LDF) and hosted by local design shop, BRIXI, is on my doorstep in south London – and if you're in the capital for the festival, it promises to be worth the trip to these parts.\nThe event – an art sale with booze, installations and performances and food – runs for one afternoon/evening and you should take cash for beer (and, quite possibly, spontaneous art purchases). Here are some of the highlights in pictures.\nNigerian-born folk painter and architect, Abe Odedina, was a BP Portrait Award nominee in 2013 with his painting The Adoration of Frida, a self-portrait and tribute to the Mexican artist. He works in London and Salvador, Brazil.\nObedina has been inspired by \"the expressive figurative paintings found in the streets in cities like Lagos, Salvador, or Port-au-Prince adorning the sides of lorries, the walls of temples, beer parlours, love motels or advertising the services of barbers, vulcanisers, healers and other specialists'.\nOver the years I've been going to BRIXI to browse the always-intriguing and beautiful and frequently joyfully unusual selection of wares on sale, Obedina's paintings have often hung huge from the walls and totally sucked me in. They're pretty special. www.abeodedina.com\nAlso...\nThese humorous pieces – named (clockwise from main image) Atkins Day (a diet themed sculpture); GGrrrrrrr and I Lost My Head – are by ceramics restorer and artist, Amy Douglas. As well as offering her artworks for sale Douglas, I believe, will be touting cabaret from a golden horsebox on the night.\nDouglas also does 80s themed linocuts (this one will only make sense if you know the lyrics to Wham Rap). Check her out at www.theartofsalmagundi.co.uk\nThere's also some of this.\nStephen Wright is so much more than a mosaic artist, as you'll know if you read this previous post on his quite astonishing home/museum, the House of Dreams. For the Artbooty, Wright will be taking the quirky creatures he creates on a road trip.\nOther artists will be: recycler, Jo Gibbs (see her lacy tiles, above); Soozy Lipsey; textile artist, Brian Merry; surrealist printmaker, Lizzie Learman plus her printing press for demos; sculptor and inventor Stephen Stockbridge, who's offering confessions; Jamie Palmer (AKA Pen & Gravy, whose work, pictured below, is for sale on Etsy and is written about in this previous post).\nWhich artist's work do you most like? Do share your comments below.\nARTBOOTY takes place on Tuesday 22 September 2015, 4-11.30pm, Brixton East 1871, Barrington Road, Brixton, SW9 7JF. See more about what's going on in the area at www.brixtondesigntrail.com or check out the city-wide events at London Design Festival www.londondesignfestival.com. Read about the Artbooty organiser in this previous post.", "source": "Your Home is Lovely: interiors on a budget"}