{"published": "2015-09-12T23:19:55Z", "media-type": "News", "title": "Kenyan boxers lose to settle for bronze medals", "id": "e36f5610-dca6-42eb-b24d-1170b52b3f91", "content": "Nick Okoth (R) of Kenya defence forces trade punches with Kennedy Onyango of Ken Track in their 60kg lightweight bout at Kaloleni Social hall in Nairobi on July 02, 2015 during the All Africa Games team trials. Kennedy Onyango won on points.Photo/Stafford Ondego/www.pic-centre.com. (KENYA) \nBoxers added two bronze medals to Kenya’s haul at the All Africa Games although Nick Okoth and Elly Ajowi lost their semi-final bouts at the Talangai Hall on Friday evening. Light weight Okoth lost to Algerian Reda Bendaziz on points while Ajowi lost on a third round technical knock out to Nigeria's Efe Tobor Apochi, ending boxers’ ambition at the Brazzaville Games. \n \nMen’s beach volleyballers upset home team from Congo 2-0 to take third position in Group 4, while the women lost 1-2 to Nigeria and were in second position in their group. Women are still on course for a medal, going by their performance so far. \n\nMale handballers lost 35-9 to Angola in another bad outing for the team only 24 hours after Kenya's women went down 42-12 to Angola. \n\nTable tennis team won one game against Gabon 3-1, but lost 3-0 to Angola and 3-2 to Uganda in the women’s team event. The men lost to Ghana 3-0. John Gicaci, the team manager, said classification will be done on Saturday before doubles, singles and mixed doubles start next week. \n\nIn cycling, Kenya finished fifth in the men’s team time trial (25km) on Thursday, finishing in 2:29.21. South Africa won and were followed by Algeria, Rwanda, and Burkina Faso. Ethiopia, Libya, Egypt, Nigeria and Cote D’ivoire completed the top 10 positions. \n\nJudoka begin their competition today, with Collins Oloo in under-60 and Peterson Gathiru in under-66. The event will be at the Talangai Hall. \n \nAs a precursor for a possible good outing, their team manager Johnson Mwadime was awarded class B referee license, which is among the highest in the region.", "source": "East African Standard"}