{"published": "2015-09-10T20:59:28Z", "media-type": "Blog", "title": "In Deep with Andy Aledort: Major Pentatonic Soloing Patterns, Part 2 — Video", "id": "d23e4a20-f523-4bcc-a8f8-6811b54e9935", "content": "In Deep with Andy Aledort: Major Pentatonic Soloing Patterns, Part 2 — Video Posted 09/10/2015 at 4:59pm | by Andy Aledort 0\nComments Related Content In Deep with Andy Aledort: Using Various Major-Pentatonic Shapes for Soloing — Video In Deep with Andy Aledort: Using Voice Leading and Close Voicings to Devise Improvised Rhythm Guitar Parts — Video Freddie King Lesson: Going In Deep with a Blues Guitar Legend — with Video and Tab Robert Johnson Lesson: How to Unlock the Guitar Mysteries of the Delta Blues Great Willie Dixon at 100: 10 Essential Willie Dixon Covers — Video When soloing, many guitarists often find themselves being stuck in a musical rut by playing the same old phrases all the time. I have found that a good way to get out of such a rut is to practice improvising while restricting oneself to a specific scale position, especially one that is newly learned, as this can increase the potential to yield new melodic phrasing ideas. Last month, I illustrated a couple of useful E major pentatonic (E F# G# B C#) scale patterns as a means to unlock fresh, new soloing ideas, and we looked at patterns played in first and fourth positions. We’ll now move further up the fretboard and check out some other useful E major pentatonic scale positions. FIGURE 1 illustrates E major pentatonic played in sixth position. Use your index finger to fret any notes that fall at the sixth fret and your remaining three fingers to grab the notes at the seventh, eighth and ninth frets. Play through this pattern several times until you have it memorized and comfortably under your fingers. When practicing any scale, a great exercise is to apply a specific note-grouping scheme and rhythm to it. For example, FIGURE 2 illustrates E major pentatonic played in sixth position with a “groups-of-three” phrasing pattern, played in an eighth-note-triplet rhythm. In FIGURE 3, we take a similar idea approach using four-note groupings and a 16th-note rhythm. When practicing both exercises, remember to adhere to the prescribed fingering assignments detailed earlier. Quickly alternating between your middle finger and pinkie may feel awkward at first, but with practice you’ll find that it gets easier to do and that accommodating yourself to this fingering is very beneficial. The next step is to try and freely “wander” through the notes of this scale position, applying hammer-on and pull-off techniques while not necessarily planning exactly which note to play next. In FIGURE 4, I begin with a hammer-on on the B string and then use a “rolling” technique of laying any fretting finger across a pair of adjacent strings in order to consecutively sound notes that are at the same fret. A good approach is to focus on a specific string pair, then work the ideas across lower or higher pairs of adjacent strings. FIGURE 5 illustrates E major pentatonic in ninth-position. You’ll most likely recognize this shape as being identical to one for C# minor pentatonic (C# E F# G# B). This is because the two scales are made up of the very same five notes. C# minor pentatonic is considered the relative minor of E major pentatonic, which is the relative major of C# minor pentatonic, the only difference between the two scales being the root-note orientation. Play through the notes in groups of threes (see FIGURE 6) and fours, and then try soloing with a similar “wandering” approach as demonstrated in FIGURE 4. Related Artists: Andy Aledort\tTopics: Andy AledortIn DeepNovember 2015VideosLessonsMagazine 0 Comments + Add a Comment", "source": "Guitar World"}