{"published": "2015-09-02T03:59:04Z", "media-type": "News", "title": "UFC 191 Predictions: Part II - Johnson vs Dodson", "id": "40a9c053-9b30-4731-8a26-eab7bf1ece92", "content": "In Part II, we will look at the three remaining fights on the Main Card including a Light Heavyweight Title Contender Fight, The Heavyweight Fight that never happened and The Main Event, which sees Mighty Mouse put his title on the line against challenger Dodson. \n Anthony Johnson v. Jimi Manuwa  \nOne things for sure, the judges need not keep score for this one. Two of the most clinical strikers in the Light Heavyweight Division. Anthony 'Rumble' Johnson (19-5) is coming off his first loss in ten, losing out to Daniel Cormier for the vacant title at 205lbs. He'll be looking to return to challenge for the title with a win over Manuwa. \n \nManuwa (15-1) is a very dangerous striker who's only loss is to Alexander Gustafsson. With 13 KO finishes in 15 victories he won't be afraid to stand with Rumble. Manuwa famously turned down the UFC the first time they came knocking citing that he wasn't ready. It was a big gamble which has paid off big. \n SIGN UP NOW  \nWant to become a GMS writer? Sign up now and submit a 250 word test article: http://gms.to/haveyoursay4 \n \nPrediction: Johnson by KO \n Co-Main Event:  Andrei Arlovski v. Frank Mir  \nTwo former UFC Heavyweight Champions collide in a match that came so close to happening eleven years ago. Mir (18-9) was the reigning Champion in 2004 and Arlovski (24-10, one no contest) was the next in line after winning three in a row. Unfortunately Mir was badly injured in a motorcycle crash and the fight never materialised. Arlovski went on to win the belt and the two have never crossed paths since. \n \nArlovski is on a five fight win streak in what is one of the greatest comebacks in history. His career looked to be over after a succession of knockout losses outside the UFC. During this five fight streak he holds two amazing KO victories over Travis Browne and Antonio 'Bigfoot' Silva. \n \nTwo time Heavyweight Champion Mir is making a career comeback of his own with two knockout victories of his own against Todd Duffee and Bigfoot. These wins come off the back of four straight losses in the UFC. The winner will be right in the title picture. \n \nPrediction: Mir by KO \n Main Event:  Demetrious Johnson v. John Dodson  \nJohnson (22-2-1) is one of the most dominant champions in the UFC right now. He has beaten all challengers to his title which he has held since the weight class began in the UFC. He seems to be improving with every performance. He is currently riding an eight fight win streak, which includes four stoppages in his last five. \n \nDodson (17-6) earned a close decision loss to Johnson the last time the two met. Dodson himself is on a three fight win streak and his only loss in his last nine is the loss to Johnson. Dodson has knockout power which he demonstrated when he beat TJ Dillashaw (current Bantamweight Champion) in the final of TUF 14. \n \nPrediction: Johnson by Decision \n Leave your predictions in the comments section below...  \nDo YOU want to write for GiveMeSport? Get started today by signing-up and submitting an article HERE: http://gms.to/writeforgms", "source": "GiveMeSport.com"}