{"published": "2015-09-16T23:44:00Z", "media-type": "News", "title": "Bendigo reacts to council shutdown | ROLLING COVERAGE", "id": "a4067cdf-1bd9-42ae-888f-b494d9653309", "content": "12.15pm: Mayor flags fines, increased security to prevent repeat of councils shutdown LAST NIGHT: PERISCOPE: Rewatch the live feed from today’s press conference below\n\nMayor Peter Cox has denied Bendigo City Council cannot continue to get on with its job of governing the city despite the fact that two councillors were not invited to a press conference this morning to condemn the anti-Islamic protest which shut down a council meeting last night.\n\nCr Cox described the events of last night as unprecedented and that a vocal minority were damaging Bendigo’s reputation as a welcoming community in the press conference at which seven of nine local councillors were present.\n\n“I feel well supported by councillors, by the staff and very proud to be the mayor of Greater Bendigo, particularly in a situation like this because it allows me to express the firm policy that we are a welcoming city and we can grow to greater strengths in situations like this,” the mayor said.\n\nHowever, Cr Cox confirmed that councillors Elise Chapman and Helen Leach were not invited to the press conference.\n\nBoth were given standing ovations by the crowd of protesters who forced a shutdown the council meeting last night. In contrast, the mayor, other councillors and members of the executive, were forced to leave in a police escort for their own safety.\n\nThe mayor said that he was not currently aware if council would be looking to press charges against members of the public gallery who physically intimidated councillors and hurled abuse, shouting things such as “Islam wants you dead Cox,” and “there’s worse to come yet”.\n\nHowever, Cr Cox said the city was currently investigating how it could prevent such an incident from occurring again, such as increasing security at public meetings, issuing fines of up to $350 and his right as chair to name and shame individuals who engaged in disruptive behaviour.\n\nREWATCH THE LIVE PRESS CONFERENCE HERE:\n\nCity of Greater Bendigo councillor James Williams has condemned the actions of protesters at Wednesday night's council meeting, describing it as \"over the top\".\n\n\"It’s very disappointing and certainly not the way to voice your opinion and not the way democracy works, it’s fine to have a view but it needs to be expressed in a reasonable way and it didn’t happen last night,\" he said.\n\n\"In regards to the mosque we ruled on matters of law and they’re trying to make points and issues that aren’t relevant to the decisions made.\"\n\nCr Williams said the council would continue to govern effectively despite the interruption.\n\n\"We’ll try to get on with our business as much a possible, this is a distraction and always has been and should be seen as such,\" he said.\n\n\"The city’ll just band behind the council.\"\n\nBendigo Sergeant John Dalton has responded to the circumstance at the Bendigo council meeting last night.\n\n“Because of the circumstances and the volatile situation last night they cancelled the meeting and we asked some people to leave, which they did,” he said.\n\n“There were no crimes committed.\n\n“The crowd was boisterous but there was no violence.\n\n“I just dont think its good for the image of the town.\n\n“It doesn’t shed a good light on the town.\n\n“We have got so many good positive things happening for the town.”\n\nMayor Peter Cox says it would be a shame to have to close public question time but that he will be considering all options after anti-Islamic protesters stormed a council meeting last night.\n\nCr Cox will be addressing the media at 11am and the Bendigo Advertiser will be streaming the conference via a link on this page.\n\nSpeaking to the Bendigo Advertiser shortly the meeting which he was forced to adjourn and from which he had to be escorted by police, along with other members of council and the executive, the mayor said he was a great believer opening up council to the public.\n\n“[But], clearly we had a council meeting, an agenda of about 190 pages of reports to consider tonight which we do in a democratic forum – and that was shut down,” he said last night,” he said.\n\nCr Cox said he was “shocked” that council would have to consider closing public question time, saying he believed the public should be given an opportunity to hold council accountable over issues of local government. \n\n“I’ll be inquiring tomorrow what are the process, how we might manage council meetings from now and where we take it from here,” he said.\n\nFor more from that interview, see the coverage from last night. \n\nBENDIGO East MP Jacinta Allan says she was “greatly distressed” after anti-Islamic protesters stormed a council meeting last night and has called on all community leaders to unequivocally condemn their actions. \n\n“I think anyone who is in a leadership role in the Bendigo community who is passionate about seeing Bendigo progress and seeing Bendigo represented in best way would condemn this behaviour as insult to councillors who were carrying out their duty,” she said. \n\n“The behavior displayed last was greatly distressing to me and I know with absolute certainty that this is behaviour that does not represent the vast majority of our community and it is behaviour that I’m certain will be condemned by the vast majority of our community.”\n\nThe state parliamentarian praised the police for their efforts in maintaining order in a night in which threats were hurled from the public gallery towards elected officials and members of the public physically intimidated the town’s elected representatives. \n\n“There are two issues here, one is behaviour of people attending council meeting and holding protests and how they conduct themselves in those forums and clearly some of these issues rest with Victoria Police who – whether it was couple weeks ago or last night – are doing an excellent job in supporting our community,” she said.\n\nMs Allan said the Victorian government also had a role to play in responding to the incident, referring to , which would strengthen councillor conduct standards.\n\n“Then the other set issues is how councillors conduct themselves and how they behave and we will be debating in parliament today a bill which goes to these issues and, if successfully passed, these reforms are about giving council and government a broader range of powers then they have at moment to deal with councillors who breach their code of conduct,” she said. \n\nAmong other disciplinary measures, the Improved Governance Bill would enable conduct panels to suspend councillors for six months in instances of serious misconduct.\n\nMs Allan said something needed to be done to allow the functioning of council after the protesters – many of whom were wearing signs with Bendigo postcodes to refute claims anti-mosque demonstrators were coming from out of town – prevented elected representatives from doing their jobs. \n\n“I have no problem with people having different views and expressing those views in different forums but with the right to expression comes responsibility to behave appropriately and to show respectful behaviour and last night that was clearly not on display,” Ms Allan said. \n\n“Last night it incredibly disappointing, to see a group of people not being way respectful towards elected representatives carrying out their duty as required under our democratic system, with no regard to the role they were playing and no regard for the democratic process.\n\n“These actions shut down the opportunity for other members to participate and other people in the gallery who wanted to have their say from putting forward their views – they were denied that because of disgraceful behavior of these people.”\n\nREWATCH THE EVENTS FROM LAST NIGHT HERE: The story first appeared on Bendigo Advertiser.", "source": "Eden Magnet"}