{"published": "2015-09-29T05:12:25Z", "media-type": "News", "title": "Zealand informs that Sanofi's New Drug Application for lixisenatide (Lyxumia(R)) has been accepted for review by the FDA", "id": "250a48be-3138-468a-9b38-3e2392dbd2ac", "content": "COPENHAGEN, Sept. 29, 2015 (GLOBE NEWSWIRE) -- Zealand informs that Sanofi today announced that the U.S. Food and Drug Administration (FDA) has accepted for review the New Drug Application (NDA) for lixisenatide in the U.S. As stated earlier, Sanofi submitted the NDA at the end of July 2015, and the FDA's acceptance of the application is an important milestone in the U.S. regulatory review process for lixisenatide. \n\nLixisenatide is an investigational once-daily prandial GLP-1 receptor agonist invented by Zealand for the treatment of patients with Type 2 diabetes. Lixisenatide is currently available for adult patients in over 40 countries outside the U.S., marketed as Lyxumia (r) by Sanofi under a global license agreement with Zealand. Sanofi has announced that the proprietary name for lixisenatide is under consideration in the U.S.  \n   \nBritt Meelby Jensen,  President and Chief Executive Officer  of Zealand, commented:                      \n\n\" Zealand has already cleared a number of significant clinical and corporate milestones in 2015. The FDA's acceptance of the lixisenatide application is an important step in the U.S. regulatory process for the product and underpins this positive momentum. If approved, lixisenatide will be the first Zealand invented medicine to be made available for patients in the U.S.\" \n\n ***** \n\nFor further information, please contact: \n\nBritt Meelby Jensen, President and Chief Executive Officer \n\nTel: +45 51 67 61 28, email: bmj@zealandpharma.com \n\nHanne Leth Hillman, Senior Vice President, Investor Relations & Communications \n\nTel: +45 50 60 36 89, email: hlh@zealandpharma.com \n\nAbout Zealand Pharma \n\nZealand Pharma A/S (Nasdaq Copenhagen: ZEAL) (\"Zealand\") is a medicinal biotech company with leading expertise in the identification, design and development of novel peptide medicines. Zealand has a proprietary pipeline of novel drug candidates and a portfolio of products and projects under license collaborations with Sanofi, Helsinn Healthcare and Boehringer Ingelheim - primarily in the fields of cardio-metabolic diseases and acute care indications. \n\nThe proprietary pipeline includes; danegaptide for ischemic reperfusion Injuries in Phase II development, ZP1848 for Short Bowel Syndrome in Phase II development and the stable glucagon analogue ZP4207 as a single-dose rescue pen for severe hypoglycemia in preparation for Phase II, and ZP4207 as multiple-dose use for the correction of mild to moderate hypoglycemia in evaluation for the next clinical development step after Phase I, as well as several preclinical peptide therapeutics . \n\nZealand has invented lixisenatide, a once-daily prandial GLP-1 agonist, which is marketed globally (ex-US) by Sanofi for the treatment of Type 2 diabetes and since end September 2015 has been under review by the FDA in the US. The license agreement with Sanofi also covers a single-product combination of lixisenatide and insulin glargine (Lantus (r) ) which is on track for regulatory submission in the US in Q4 2015 and in Europe in Q1 2016. \n\nThe company is based in Copenhagen (Glostrup), Denmark. For further information about Zealand's business and activities, please visit: www.zealandpharma.com or follow us on Twitter @ZealandPharma", "source": "Market Pulse Navigator"}