{"published": "2015-09-04T08:20:56Z", "media-type": "News", "title": "'My players are chosen on merit'-Ackermann", "id": "dc8906e2-a7a5-41b5-b5bc-56ffe59f06d6", "content": "Ezekiel Kekana\n\nAfter long talks of transformation in Rugby that nearly prevented the Springboks from going to participate in the upcoming IRB Rugby World Cup, Lions coach Johan Ackermann has decided to name centre Howard Mnisi as the team captain ahead of their clash against Eastern Province Kings.\n\nMnisi will lead the side for the first in his career when they welcome EP Kings at the Emirates Airlines Park in their Absa Currie cup round four match. The 26 year old Mnisi, takes over the captaincy duties from Warren Whiteley, who was expected to lead the team upon his arrival from the Springboks,but was ruled out after he sustained a calf injury. The former Pumas centre Mnisi says he is excited to be given the captaincy role and he does not see his appointment as a result of the hotly debated transformation issue in the sport. “With all the talk around transformation, I can't get swept up in that. I need to focus on the team and play well,” Mnisi said. Mnisi sentiments were echoed by his coach Ackermann, who stated that the appointment of Mnisi had nothing to do with transformation as he treats his players with the same respect. “My players are chosen on merit, I'm proud to say that. Howard is my captain because of how he has been playing,” Ackermann said. Lions host EP Kings brimming with confidence, following their bonus point victory over Pumas in their last match and Ackermann has maintained they will continue with the same performances against seventh placed EP Kings side. “We sympathise with the Kings, but we need to prepare regardless. On the field it's all business and we can't let that affect us. We need to carry on as usual. The 45 year-old Ackermann has retained most of the players that did the business against Pumas last week, with Fabian Booysen shifting to No.8 to take Whiteley's place, while Kwagga Smith has been given a starting berth and Andries Coetzee starts at number 15. “It's great to have Andries Coetzee back at 15. He's an experienced player who brings stability and confidence.” The Johannesburg based outfit are currently topping the log with 20 points, tight with rivals Blue Bulls and they are firm favourites to win this clash against win-less Eastern Province based outfit.", "source": "The New Age Online"}