{"published": "2015-09-24T12:00:00Z", "media-type": "Blog", "title": "DIY Pumpkin Crayons", "id": "e5768663-e2f4-4c82-871a-8e685d005f4a", "content": "Homemade pumpkin crayons are a fun non-candy Halloween treat to give out to trick or treaters.  DIY pumpkin crayons are also a great addition to kids Thanksgiving place settings to keep them busy before dinner. \n \n\n \nLast year I ran across the Teal Pumpkin Project on Facebook.  I am blessed with two healthy kids with no food allergies and I try not to take that for granted. It broke my heart to think of a little kid not being safe to go to trick or treating for fear of dying from eating the wrong candy.  Even though it was just a few days before  Halloween, I made sure to have a non-candy options for kids with allergies.  This year, though, I thought we’d make a cute little bag for non-candy options and include a coloring sheet and these adorable homemade pumpkin crayons! \n \nThese little crayons just take a few minutes to make.  Not only are they great for non-candy trick or treating, they would also be adorable at the kids table at Thanksgiving! \n \n\n \nSupplies needed: \nAssorted orange/tan/dark yellow crayons \nSmall donut tin \nNon stick cooking spray \nOven \n \nDirections: \n \n1. Begin by breaking your crayons in half and removing all of the paper coverings. \n \n  \n \n2. Break the crayons into smaller segments. You should be able to get 4 segments or so out of each crayon. \n \n3. Preheat your oven to 350 degrees. Spray your pan of choice with a mist of non stick cooking spray. \n \n4. Add the broken crayons pieces into the tray. You want to fill each cup about half full. \n \n\n \n5. Bake at 350 degrees for 10-15 minutes or until the wax is liquefied. \n \n6. Remove and allow to cool. Place in the freezer for 10 minutes to help loosen the wax. \n \n7. Gently turn over the pan and allow the crayons to fall out. \n \n8. Tie a length of green felt or ribbon through each crayon for a stem. \n \n\n \nYour pumpkin crayons are now ready to be used and enjoyed. \n\nThe post DIY Pumpkin Crayons appeared first on Growing Up Gabel .", "source": "Growing Up Gabel"}