{"published": "2015-09-15T11:26:34Z", "media-type": "News", "title": "Salient Federal Solutions and CRGT Announces Closing of the Merger Transactions", "id": "e613e997-acbc-499d-aa6c-c2d9a909b3ec", "content": "SOURCE Salient Federal Solutions, Inc.\n\nThe Combined Company Will Benefit New and Existing Customers through Greater Technical Expertise, Enhanced Mission Capabilities, and Broader Resources\n\nFAIRFAX, Va. \n\nBrad Antle \n\n\"Today begins an exciting chapter in our company's history,\" said Mr. Antle. \"We are pleased to announce the close of this transaction and the formation of Salient CRGT. This merger is a powerful combination in the Federal IT services industry. Together, we bring a more robust set of capabilities, and have greater overall experience with and depth of knowledge in technologies that matter most to our customers. Our experiences in Agile Software Development, Data Analytics, Cyber and Mobility position Salient CRGT for the growing needs in our market, and we look forward to working together as a powerful force in the market, leveraging our expertise to deliver a broader portfolio of innovative solutions across the entire federal IT market.\"\n\n\"We are very excited to bring this transformative merger to completion. We are positioned to be the partner of choice for agency customers demanding value and successful outcomes,\" said Mr. Ferrando. \"The two companies have exceptional past performances in delivering capabilities and solutions that significantly enhance the mission and provide high return on investment to our customers. Our focus on key technologies that deliver critical capabilities and solutions distinguishes Salient CRGT in the federal services industry. These also include highly specialized C4 Engineering, infrastructure, and mission specific training capabilities that are uniquely valued by our customers.\" \n\nSalient CRGT is positioned for leadership in IT modernization and business intelligence. \n\nAbout Salient Federal Solutions\n\nSalient is a leading provider of information technology and engineering services that include data analytics, Agile development, mobility, training, and cyber security solutions to the intelligence, defense, homeland security, and federal civilian markets. Recognized by Forbes Magazine as one of America's Most Promising Companies and named Contractor of the Year, Salient's customer base includes the United States Office of Personnel Management, Patent and Trademark Office, Department of Defense, Pension Benefit Guaranty Corporation, Department of Homeland Security, and more. For additional information on Salient, please visit www.salientfed.com.\n\nAbout CRGT\n\nCRGT is a full life-cycle IT services provider for the Federal Government, offering customers Agile Software Development, data analytics, and cyber security & infrastructure support. Working as a partner with government agencies that span civilian services, national defense, and domestic security, CRGT has earned a record of success with integration and operations of large-scale, high-volume solutions. CRGT's customer base includes the United States Postal Service, Securities and Exchange Commission, Patent and Trademark Office, Department of Defense, Department of Justice, Department of Homeland Security, and more. For additional information on CRGT, please visit www.crgt.com \n\nLogo - http://photos.prnewswire.com/prnh/20150914/266395LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/salient-federal-solutions-and-crgt-announces-closing-of-the-merger-transactions-300142727.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KWES NewsWest 9"}