{"published": "2015-09-29T22:48:41Z", "media-type": "News", "title": "Infocus M808 review: Scores high on looks and performance at an affordable price", "id": "dfd59e17-be0d-48cd-ae48-c298e45e4fc8", "content": "Price: Rs 12,999 \n\nSpecifications: 5.2-inch IPS LCD (1920 x 1080), 1.3Ghz octa core processor, 2GB RAM, 16GB storage, microSD slot, 13MP rear + 5MP front cam, dual SIM, 4G, WiFi, Bluetooth 4.0, Android 5.1, 2450mAh battery, 155 grams \n\nPositive: Metal unibody design, full HD display with plethora of settings, good day to day performance \n\nNegative: Average battery life, front camera lacks details, tends to heat up quickly \n\nAmerican smartphone brand InFocus is trying to gain a foothold across different price brackets in the Indian smartphone market. After the budget M370, they have launched a mid-range offering called the M808. At this price, the M808 competes with the likes of Xiaomi's Mi 4i and the popular Moto G. \n\nThe first thing that sets the InFocus M808 apart from the others in this price range is the all-metal unibody design. Plus, the phone is just 7mm slim and surprisingly lightweight for a phone with all-metal construction. Thanks to the texture, it did not feel slippery in the hands but we did not much like the key placement. Contrary to conventional designs, both the power and volume keys of the M808 are on the left instead of the right. \n\nOne impressive feature of the phone is the display. The M808 has a 5.2-inch IPS display with a resolution of 1920 x 1080 pixels — it's one of the few phones to offer a full HD display at this price. The screen is beautiful with sharp details, rich colours and excellent viewing angles. There is even a bluelight filter setting and an option to adjust the colour temperature. InFocus has also added a dynamic screen mode option in display settings that boosts contrast — great for watching videos and playing games. \n\nSpecifications include a Mediatek octa core MT6753 processor with support for 4G bands in India. You also get 2GB RAM and 16GB of internal storage. About 10.5GB is available to you at the start. Thankfully, you can expand the memory using a microSD card and it has USB OTG support too (to connect a USB flash drive with an adapter). \n\nPerformance from the phone is excellent. We did not see any slowdown or lag with day-today use, with full HD videos or while playing demanding games. The issue is that the device tends to heat up quickly. Within 5 minutes of gaming, the phone started to heat up. Battery life was one day with regular usage. \n\nThe InFocus user interface is clean and simple to use. There is no app drawer so all icons are on multiple home screens. There is a preloaded mobile assistant app which offers help with clearing the internal storage, managing the power saving settings, app permission manager, device accelerator, backup, app data control as well as battery usage. \n\nThe 13MP rear camera offers mixed results. While outdoor photos have good details and natural colour, indoor and low light images have a fair bit of noise and lack details. The front camera suffers from washed out colours and also has visible noise. We hope InFocus fixes some issues with a software update. \n\nAt this price, the InFocus M808 scores high on looks, build quality, features and performance. However, the lacklustre camera performance is the main issue, especially considering that both its competitors, the Moto G (3rd gen) and Xiaomi Mi 4i offer good camera performance and better battery life.", "source": "Economic Times"}