{"published": "2015-09-22T07:00:00Z", "media-type": "News", "title": "Vols prepare to face tough Gators' secondary", "id": "74c78901-6402-4069-9dac-0156dc654f58", "content": "It’s a fact that Vol fans can’t avoid: the team who has the most rushing yards in the Tennessee-Florida rivalry has won the past 12 meetings. \n  \nThat team for the last 10 years has been Florida. \n \nThe Vols have only mustered 128 yards on 101 carries in their last four meetings against the Gators, averaging 1.3 yards per carry. \n \nHowever, Tennessee (2-1, 0-0 SEC) has been just as inept passing the ball against Florida. In those same four games, Vols’ quarterbacks have completed just 53.3 percent of their passes and have thrown 10 interceptions and only six touchdowns. \n \nIf the Vols want to end the 10-year losing streak to the Gators Saturday at Ben Hill Griffin Stadium (TV: CBS, 3:30 p.m.), they are most likely going to have to improve in the passing game. \n \nAnd that is not going to be an easy challenge against the Gators’ secondary. \n \nFlorida (3-0, 1-0 SEC) has limited its opponents to 202.7 passing yards per game and its cornerback Vernon Hargreaves III is widely regarded as one of the best players in the nation at his position. The Gators held their latest victim, the Kentucky Wildcats, to only 126 passing yards and picked off two passes. \n \n“What can I say about their defense? I don't know if there are one or two adjectives that could describe it,” Tennessee head coach Butch Jones said in a Monday press conference at Ray and Lucy Hand Digital Studio. “The word that comes to my mind is impressive. Last week, they held a team to eight completions. They are number one or two in every statistical category, and deservingly so. \n \n“They are deep. I believe they play 10 on the defensive line. They have the ability to play press-man coverage. They are as good of a defense that we have seen since we have been here. They are active, explosive and get after it. I think that the results speak for themselves.” \n \nThe fate of the passing game falls mainly on the shoulders of junior quarterback Joshua Dobbs, who has completed 43 of his 74 passes for 474 yards and five touchdowns in the first three games of the season. \n \nDobbs knows about the Vols’ quarterbacks' recent struggles against the Gators, but that hasn’t changed the way he plans to prepare for Florida. \n \n“It’s the same preparation that goes into any week getting ready for a game,” Dobbs said. “Understanding schemes, understanding what the defense is giving me and understanding our game plan.” \n \nFor Dobbs to succeed, his offensive line will have to give him time to spot open receivers and his receivers will have to find ways to get open. \n \nHow well his receivers escape Florida’s press coverage will help determine the success of the passing game. \n \n“At the end of the day, when you play a man-coverage football team, it comes down to me against you and being able to adapt and adjust to the ball in the air,” Jones said. “We need to have some different flood routes and things that every offense tries to create during the course of a game.” \n \nJones guaranteed last Wednesday that the Vols will win a game by passing the ball. That moment might arrive sooner rather than later. \n \nThe Vols defense should contain the Gators’ offense. The Gators defense will likely exert their efforts in stopping the run, daring Dobbs to throw downfield. \n \nThe outcome of the game and the fate of the 10-game losing streak to the gators, then, might fall into Dobbs’ hands. \n \nBut Dobbs isn’t concerning himself about the streak. He is just focused on winning the next game. \n \n\"I'm here to win every game, so I don't really think about (the streak),” Dobbs said. “You know, history's history. Our goal is to go out there and make new history this weekend. I play to win every game, and I'm excited to play (Florida) again.\"", "source": "Daily Beacon Online"}