{"published": "2015-09-27T04:20:32Z", "media-type": "News", "title": "·China pledges 2 bln USD to support South-South cooperation, calls for equitable development", "id": "0df8aa49-7f45-405c-b2ff-4f1df991e23b", "content": "Chinese President Xi Jinping addresses the United Nations Sustainable Development Summit 2015 at the UN headquarters in New York, Sept. 26, 2015. (Xinhua/Ma Zhancheng) \n \nUNITED NATIONS, Sept. 26 (Xinhua) -- Chinese President Xi Jinping announced here on Saturday that China will provide 2 billion U.S. dollars to support South-South cooperation, and called for an equitable development path for all countries. \n \nChina will set up a fund, with initial contribution of 2 billion dollars, to support South-South cooperation and assist developing countries in implementing their post-2015 development agenda, Xi told the United Nations Sustainable Development Summit at the UN headquarters in New York. \n \nXi said China will also do its best to raise its investment in the least developed countries (LDCs) to 12 billion dollars by 2030. \n \nIn addition, China will exempt the debt of the outstanding intergovernmental interest-free loans due by the end of 2015 owed by the relevant LDCs, landlocked developing countries and small island developing countries, the president said. \n \nXi's announcement of those support and assistance measures met with warm applause from the audience. \n \nAs part of China's plan in implementing the post-2015 development agenda adopted by the UN summit, Xi also announced that China will establish an international development knowledge center to facilitate studies and exchanges by countries on theories and practices of development suited to their respective national conditions, and will propose discussion on establishing a global energy network to facilitate efforts to meet the global power demand with clean and green alternatives. \n \nThe president added that China is ready to work with other relevant parties to move forward the implementation of the Belt and Road Initiative, achieve an early operation of the Asian Infrastructure Investment Bank and the BRICS New Development Bank, and contribute to the economic growth and people's well-being of the developing countries. \n \nXI'S OUTLINE FOR POST-2015 DEVELOPMENT \n \nSharing his view on the post-2015 development agenda, Xi called for an equitable, open, all-round and innovation-driven development path, stressing that no country should be left behind. \n \n\"We need to ensure equitable development to make access to development more equal,\" Xi told the audience. \n \n\"Countries may differ in capacity for and achievement in development, but they have common yet differentiated responsibilities with shared objectives,\" he said. \n \nHe called for improving global economic governance, increasing the representation and voice of developing countries, and giving all countries equal right to participating in international rule-making. \n \n\"We need to ensure open development to deliver its benefits to all parties,\" Xi said, noting that all countries should uphold the multilateral trade system, build an open economy and come to share its benefits through mutual consultation and joint collaboration. \n \nThe president also asked for ensuring \"all-round\" development to make the groundwork of development more solid, stressing the need to uphold equity and social justice, and to achieve harmonious coexistence between man and society and between man and nature. \n \n\"We also need to ensue innovation-driven development to fully tap the development potential,\" Xi said. \n \nAll countries should look to reform and innovation for ways to bring out their development potential, build stronger engines for growth, and cultivate core competitive edge that they have not had before, he said. \n \nTo well implement the post-2015 development agenda, Xi put forward a four-point proposal for the international community: building up the development capacities; improving the international environment for development; updating the partnership for development; and strengthening the coordination mechanisms for development. \n \n\"The international community has a duty to help developing countries with capacity building and provide them with support and assistance tailored to their actual needs,\" the president noted. \n \nHe called on all countries to work together to maintain international peace for the sake of development. \n \nMeanwhile, international institutions should step up governance reform, and multilateral development agencies should increase their supply of development resources, he said. \n \nXi proposed that the international community, while maintaining the role of South-North cooperation as the main channel, should work to deepen South-South and tripartite cooperation. \n \nIn addition, Xi said, countries need to step up their macroeconomic policy coordination to avoid as much as possible negative spillover effects, and regional organizations should accelerate their integration process and build their overall competitiveness by mutually complementing intra-regional advantages. \n \nCHINA'S ROLE IN MDGS \n \nDuring his address, the president briefed the audience on the role and contributions of China in implementing the Millennium Development Goals (MDGs) laid down 15 years ago. \n \nChina has lifted 439 million people out of poverty and made remarkable progress in areas of education, health and women's welfare over the past 30-plus years since the country embarked on reform and opening-up, Xi said. \n \nOver the past 60-plus years, China has provided 166 countries and international organizations with nearly 400 billion yuan (about 63 billion dollars) worth of assistance, and dispatched over 600,000 aid workers, over 700 of whom have laid down their lives in helping the development of other countries, he said. \n \n\"Looking to the future, China will continue to take a right approach to justice and interests by putting justice before interests and join other countries in the concerted efforts to realize the post-2015 development agenda,\" the president stressed.", "source": "Tianshannet"}