{"published": "2015-09-16T00:14:00Z", "media-type": "News", "title": "Oklahoma football: OU's defense enjoys proving critics wrong", "id": "e5b9751e-25a7-43c1-8631-6ac60e667b3d", "content": "All it took was one play for junior Zack Sanchez to give Oklahoma a massive road win in Knoxville, Tennessee. \n  \nIn Saturday’s second overtime period, Tennessee quarterback Josh Dobbs telegraphed a pass to Marquez North, and Sanchez picked it off to secure Oklahoma’s 31-24 victory. \n \nAccording to Sanchez, the pick itself was, without question, his career favorite. \n \n“Easy. To end the game like that is obviously a great feeling,” Sanchez said. “The Sugar Bowl was nice and sweet, but to be the one to end the game had a lot more meaning to it.” \n \nThe route North ran was one Sanchez and the defense saw all week. The junior cornerback credited the scout team for preparing Oklahoma’s secondary for the Vols’ passing game. \n \nThe Sooner defense wasn’t always in a position to help OU win last season, however. \n \nThey held off Tennessee’s offense Saturday while Baker Mayfield and Oklahoma’s offensive attack slowly found its groove, but junior linebacker Dominique Alexander knows the defense didn’t play as well it was supposed to a season ago. \n \n“We got a lot of bad talk last year,” Alexander said. “If we’re not putting it out there on the turf, anybody can say what they want. But we’ve been putting it out there on the turf and that’s why the stories have been changing.” \n \nOklahoma’s pass defense ranks second-best in pass completion percentage against and sixth in passing yards allowed. Last year, it ranked 44 th and 120 th in those categories respectively. \n \nThe players aren’t oblivious to the criticism. However, they’re working to change their perception with being on the same page and create more consistency. \n \n“We knew what we’re capable of,” Sanchez said. “Obviously we have to get better every week. That’s something we’ve been stressing; never get too high, never get too low. As high as you can get. You can get low real fast. You can get humbled real quick.” \n \nSanchez feels the defense is competing more as a whole, and they’re ready to showcase it. \n \nHe even says there’s a new swagger to Oklahoma football. \n \n“I think it started in the offseason,” Sanchez said. “We knew we had a lot of work to do. We put in a lot of work. When you get talked bad about for nine months, it’s always fun to come out and shut people up as much as you can.” \n \nSenior Charles Tapper likes the position his team is in as an underdog. \n \nHe said OU was in the same spot when he was a sophomore, and he’s ready to do the same this season. \n \n“It’s good that we’re slept on,” Tapper said. “We want to be under the radar. We don’t want to be the spotlight team. As the season goes on, we want to get there. We’re going to start from the bottom and show that Sooner Magic that we have.”", "source": "Oklahoma Daily"}