{"published": "2015-09-01T22:24:18Z", "media-type": "News", "title": "Thousands Of Prisoners Could Be Moved Out Of Solitary", "id": "aebc3b41-a156-43c2-875b-f6f0c5397cda", "content": "Thousands of prisoners could be moved out of solitary confinement in California after legislators agreed to end long-term isolation in state prisons. \n \nThe state settled a class action lawsuit Tuesday brought by prisoners at California’s Pelican Bay prison, home to the state’s largest segregation unit. When the case was filed in 2012, 78 prisoners had been held in isolation for more than 20 years, with 500 of them held for over 10 years. \n \nPrisoners were often put in solitary solely because of gang affiliations, not based on any behavioral reasons. The prisoners had argued that being held in isolation had caused “severe physical and psychological harm,” according to the Center For Constitutional Rights, which helped argue their case. \n \nThe agreement filed Tuesday  will replace indeterminate stays in solitary confinement with a more robust behavior-based infraction system. Prisoners found guilty of serious offenses while incarcerated will serve a fixed term in insolation, and enter a two-year step-down program before returning to general population. \n \nHowever, most prisoners found to be not guilty of solitary-eligible offenses within the previous two years, which include murder and weapons possession, will be immediately released into general population within one year. \n \nThe Center For Constitutional Rights told Vocativ almost 10,000 prisoners remain under some form of isolation in California state prisons today. However, the state corrections office said that number is closer to 6,400. \n \nAs part of the case, six Pelican Bay prisoners filed depositions in which they described the effects of living in solitary confinement, some of them for as many as 25 years, excerpts from which are featured below. \n Gabriel Reyes: 17 years in solitary confinement  \nReyes (49), from Palmdale, California , who was placed in solitary confinement after being identified as a member of a Mexican mafia prison gang, said he begun hearing voices in his head. “Sometimes when I hear my name being called, I may yell out to my neighbor and ask him if he heard somebody call me. And when he says no, I mean, it’s kind of humiliating.” \n Todd Ashker: 22 years in solitary confinement  \nAshker (51), who received a GED and associates degree in paralegal studies while incarcerated, and was a lead plaintiff in the class action lawsuit , claimed: “I’ve been basically forced to withdraw from being any type of normal social human being, through my incarceration in the Security Housing Unit (SHU).” \n George Franco: 23 years in solitary confinement  \nFranco (49) said “you ain’t really get no counseling” which encouraged him to “hold everything inside.” He said in his deposition in July : “If you let it all out…you’re going to get in trouble and end up hurting somebody. So you just keep it all inside. That’s not supposed to be healthy…for a person…to be holding everything in.” \n Jeffrey Franklin: 23 years in solitary confinement  \n“The food we get is terrible. It is not enough. It is often cold and served on dirty, disgusting trays. Hardly a fresh vegetable or piece of fruit,” said Franklin (55), from New Orleans , adding in finer detail: “We had canned fruit at breakfast and I guess it was some type of…looked like tangerines or something like that. Well I ate it and when I went out to the yard…it all came right back up. It didn’t take right with my system.” \n Paul Redd: 14 years in solitary confinement  \nRedd claimed being held in isolation had resulted in violent thoughts . Complaining of short and long-term memory loss, Redd said before being placed in solitary confinement: “I never had thoughts that a cop may come to work uncontrolled, might just be mad and go postal and just start shooting all of us in our cell. You know, I never used to have them kind of thoughts.” \n Ronnie N. Dewberry: 25 years in solitary confinement  \nDewberry (57) said that despite suffering from chronic lower back problems and pain, stomach problems and swollen thyroid glands, he tells family members “not to worry about me.” He said in his deposition : “My family members, like any other family members, worry about their sons and daughters in prison. I am no different. I try to protect my family from the harsh treatment that one receives here.”", "source": "Vocativ"}