{"published": "2015-09-19T01:15:08Z", "media-type": "News", "title": "Scientist told to innovate on solar", "id": "557730bd-fedc-40c6-a294-fad62196179c", "content": "Vellore : Former Indian President, Dr A.P.J. Abdul Kalam's chief scientific advisor Dr V. Ponraj, at his inaugural address to the two-day SAE student national convention-2015, that began on Friday in VIT university here, urged the scientists, research scholars and students to focus their attention in producing solar-energy, with their innovations. He said that the research should be made based on the fact that with coal and petroleum products becoming scarce, the country needed an alter ego to produce energy. \n\nThe two-day convention was a part of Gravitas-2015, slated to take place in VIT university, from September 25 to September 27. Dr Ponraj, said that the interlinking of rivers taken up by the Narendra Modi government would boost agriculture, food products and value added agri-products, thus making India self-sufficient in the sector to help feed the expected growth of nine billion world population by the year 2050. \n\nHe said the linking of rivers for a distance of 900 km would cost approximately Rs 6,000 crore, which might take a minimum period of five to seven years. He asked the students to be prepared to undertake the task readily to make the country prosperous. \n\nHe lauded the TN government on its recent Global Investors Meet. VIT university chancellor Dr G.Viswanathan in his presidential address said around 2,300 participants including 600 VIT students and faculty members, and students and faculty from 80 universities and 54 delegates from various industries would attend the national convention. He said that the time had come for India to compete with other countries’ automotive manufacturing industries. \n\nBriefing about the two-day convention, the SAE VIT chapter had successfully furthered the ultimate cause of implementing and developing newer automotive technologies, Dr Viswanathan said. He said in the convention, in addition to the 20-Tier-II events, 23 new events were to be conducted. He added that the 'convention 2015' had never before been conducted on such a grand scale. \n\nIn his felicitation speech, SAE's southern section chairman N. Balasubramanian said, that the convention expected flowering of entrepreneurial skills from the participants. He said the convention would take up the subjects of employability, creating entrepreneurs and culmination of linking all the automotive industries.", "source": "Deccan Chronicle"}