{"published": "2015-09-16T00:13:51Z", "media-type": "News", "title": "Contribution halt hits Super Fund", "id": "de3ccf17-6553-4f20-89dc-841e416721a2", "content": "NZ Super Fund chairman Gavin Walker said double-digit results couldn't be expected to continue indefinitely. \n             \nNew Zealand has missed out on adding billions to its retirement savings pot over the past year because the Government is not contributing to the NZ Superannuation Fund. \n \nThe NZ Super Fund  revealed it returned 14.6 per cent after costs and before tax in the year to June 30. It finished the year at $29.5 billion, up $3.1b on the year before. \n \nThe fund's results show that the Government would have been 11 per cent better off if it had made contributions over the year, instead of using the money to pay down its debts. \n \nThat outperformance, compared to the cost of debt servicing, was worth $2.9b to the fund in the 2015 year. \n \nNZ Super Fund chairman Gavin Walker said the result was an excellent one. \n \n\"The past year has continued a pattern of very strong, above-market returns.\" \n \nSince the Government stopped contributions  in 2009,  the fund has gone through a period of double-digit returns, averaging 16.8 per cent over the past five years. \n \n READ MORE: Government should restart contributions  \n \nThe fund calculated it would now have at least $17.8b more in its coffers if the contributions had continued through that period, and would be closing in on $50b. \n \nThe Government would have been $6.2b better off over the past five years if it had paid contributions rather than using the money to service debt. \n \nBut Walker said the double-digit results could not be expected to continue indefinitely. \n \nHe said the fund was expected on average to earn 8 per cent to 9 per cent a year. \n \nChief executive Adrian Orr acknowledged global markets were experiencing increased volatility and uncertainty. \n \nGlobal equity markets fell 6.49 per cent in August. \n \nOrr said the volatility would inevitably have an impact on  returns in the short term. \n \n\"It is normal to see considerable volatility in our monthly and indeed annual returns. We remain focused on our long-term strategies. \n \n\"As an agile and highly liquid investor, we are well positioned to manage short-term volatility, and will look to take advantage of market disruptions as they occur.\" \n \nThe fund also exceeded its passive reference portfolio benchmark by $1.15b, or 4.45 per cent, over the year. \n    \n- Stuff \n             \r     Comments", "source": "Southland Times"}