{"published": "2015-09-11T16:04:58Z", "media-type": "News", "title": "Air Force decides to condemn private land near Area 51", "id": "ad729c25-3c84-4938-8042-456ba6aa9f08", "content": "With no counteroffer on the table, the Air Force let  its final $5.2 million offer expire at 3 p.m. Thursday and asked the Justice Department to condemn the Sheahan family's Groom Mine property and claims near the classified Area 51 installation.   Groom Mine co-owners Joe and Ben Sheahan had sent an email Thursday morning to an Air Force real estate chief saying they \"are willing to sit down and negotiate\" a counteroffer for sale of their 400 acres of property and mining claims, within sight of the remote Air Force location. But at 2:18 p.m., David Walterscheid, real estate transactions chief at Lackland Air Force Base, Texas, replied to the Sheahans, saying that according to a July 2014 letter from Joe Sheahan \"the owners did not want to make a counteroffer or grant access to the property\" for an appraisal. \"We are not prepared to offer more than $5.2M for the property,\" Walterscheid said in his reply Thursday to the Sheahans. Nellis Air Force Base later released a statement from Jennifer Miller, assistant secretary of the Air Force for installations, saying, \"After exhausting all reasonable efforts to negotiate a sale and  the landowners' rejection of the Air Force's offers , the Air Force requested the Department of Justice file a condemnation action in Federal District Court.\" She said an appraisal wasn't made because the Air Force wasn't permitted to enter the property. \"The Air Force will pay just compensation for the claims as determined by the court based on evidence submitted by the parties. We are proceeding in a manner consistent with the law that will strike an appropriate balance in protecting the rights of the landowners while recognizing the demands of national security,\" Miller's statement reads. The facility and airstrip known as Area 51 are where cutting-edge spy planes and stealth jets have been tested for six decades on restricted government land along the remote Groom Dry Lake bed, 90 miles north of Las Vegas. Joe Sheahan said the family interpreted the Air Force's Aug. 11 final-offer letter to be \"an ultimatum. It didn't leave us much room for a counteroffer.\" He cited a 2014 letter to the Air Force in which he said \"we left the door wide open\" for a counteroffer. \"Clearly in their statement today they were never interested in negotiations,\" he said after receiving Walterscheid's email Thursday afternoon. In a statement Feb. 22, 2014, by \"Groom Mine Owners\" about the criteria affecting the sale of the mine, they wrote, \"The bottom line is we really are not selling a mine. No, what we are selling is our view and our access. My home is worth a couple hundred thousand dollars give or take, but put that same home on a beach in California and the value sky rockets. Page 2 of 2 - \"We're selling a vacation estate with a great view, a view and access you wish to buy. (location, location, location)!!,\" the owners' statement reads. Joe Sheahan has said the family  feels the negotiations have been disingenuous  since they learned recently that Air Force officials had received authorization to condemn their property before a meeting to discuss a possible sale of it in 2014. Nellis officials said, however, that wasn't the case. \"The Air Force is required by law to notify Congress and receive approval when it intends to buy property; we received that authorization to buy the property,\" a Nellis spokesman wrote in an email Thursday. \"However, we did not formally notify Congress about the potential for condemnation until August 2015 when we sent the best and final offer. \"All along, our hope has been a negotiated settlement,\" reads the email from Nellis Master Sgt. Sanjay Allen. Joe Sheahan said that's not what Walterscheid told him during a speaker-phone conversation Wednesday. \"He stated that they had gone to Congress for approval to condemn our property. When asked when this was done, he replied, it was done before the first meeting with us.\" The Air Force contends the family's activities over the past several years have impeded its effort to use the range for flight tests. The Sheahans say the Air Force has been the intruder since U-2 spy plane tests were launched in 1955. Prior to that nuclear weapons tests by the Atomic Energy Commission at the Nevada Test Site showered their property with radioactive fallout. About 20 family members have stakes in the property and 21 mining claims, of which six are patented, meaning the mineral rights are on private property owned by the claimant. Their ancestors mined for silver, lead, copper, zinc and gold at Groom Mine, dating to 1889. This is a developing story. Check back for updates. Contact Keith Rogers at  krogers@reviewjournal.com  or 702-383-0308. Find him on Twitter:  @KeithRogers2", "source": "Wicked Local Acton"}