{"published": "2015-09-14T17:18:50Z", "media-type": "News", "title": "The declining scandal of nude photos", "id": "54ad97ec-22a8-43f6-9c20-f2c5e3994815", "content": "When nude photos of a celebrity surface nowadays, it's often rumored that the star may have \"leaked\"… \r \nVanessa Williams stepped down in 1984 as the first black Miss America after nude photos of her appeared in Penthouse magazine. She went on to have a successful singing and acting career and has written a memoir. In September, Sam Haskell, executive chairman and CEO for Miss America, apologized to Williams on behalf of the organization. \n\nCarrie Prejean was stripped of her Miss California USA title in 2009 after a long legal battle with the contest. The contest dethroned her and said lingerie-modeling photos emerged that breached her contract. Prejean sued, claiming that her firing was religious discrimination because of her opposition to same-sex marriage, and the pageant countersued. The conflict ultimately ended after the revelation of a \"sex tape.\" \n\n(CNN) When nude photos of a celebrity surface nowadays, it's often rumored that the star may have \"leaked\" them. \n\nThat was far from the case in 1984, when Vanessa Williams resigned as Miss America after Penthouse magazine published nude photos of her that had been taken before her 10-month reign. \n\nOn Sunday night, at this year's contest, Miss America CEO Sam Haskell took to the stage with Williams to offer her a public apology. \n\n\"Though none of us currently in the organization were involved then, on behalf of today's organization, I want to apologize to you and to your mother, Miss Helen Williams,\" Haskell said as he hugged a tearful Williams. \"I want to apologize for anything that was said or done that made you feel any less than the Miss America you are and the Miss America you always will be.\" \n\nWilliams, who had been Miss New York, made history as the first African-American Miss America. She stood on the brink of obscurity after the scandal but battled back to have a successful career in music and television. \n\nIn today's society, nudity is much more common for celebrities and is often celebrated. From Kim Kardashian's \"breaking the Internet\" in 2014 with her nude photo spread in Paper magazine to Sharon Stone's more recent baring it all in Harper's Bazaar, there seems to be hardly anyone left who hasn't stripped down. \n\nSome argue that Kardashian wouldn't even be famous were it not for her appearance in a sex tape, and most actors barely blink an eye at doing nude scenes in movies or in magazines. \n\nRelationship expert Kimberly Moffit told Fox that baring it all can have a positive effect. \n\n\"Some psychological benefits of posing nude can include a feeling of empowerment, increased confidence and body image, and an overall feeling of pride,\" she said. \"Women, like Sharon Stone, may pose nude to feel empowered and in control of their bodies, especially if they are proud of the way it looks or confident in who they are as a person. Some women take pride in demonstrating to other women that all body types are beautiful and that beauty can take form in many ways.\" \n\nSocial media has also helped. \n\nThose who follow Justin Bieber on Instagram were recently treated to a shot of a totally nude Biebs from the back. Comic and late-night talk show host Chelsea Handler has posted topless photos of herself on the social media…", "source": "MyInforms"}