{"published": "2015-09-16T15:51:39Z", "media-type": "News", "title": "Mayor: Save items from old Kaufmann's building before Macy's closes", "id": "fe028334-2fdc-475a-9072-0f97b431888c", "content": "Pittsburgh's mayor wants to make sure holiday window relics, an icing bag that was used to make thumbprint cookies, and other artifacts from the downtown Macy's store live on after it closes later this month. \n \nMayor Bill Peduto wrote a letter to the department store chain last week saying he wants all artifacts of historic value to be preserved, maintained and made available for public view, the Pittsburgh Post-Gazette reported . \n     \nPeduto's chief of staff, Kevin Acklin, said the mayor stepped in after the city was notified that Macy's and its contractor were attempting to sell off some historical items from the landmark building, where the now-defunct Kaufmann's chain ran its flagship store for more than a century. \n     \nBut Macy's spokeswoman Elina Kazan said it was always the chain's intent to preserve the building's artifacts. Macy's has its own archivist sorting through the material and is working to safeguard the items, she said. \n     \n\"We knew the store housed a lot of history in it and it is an ongoing process,\" Kazan said. \"We respect the legacy of Kaufmann's and what the downtown building signifies. We are exploring every avenue to allow Pittsburghers to still experience and enjoy it.\" \n     \nAmong the items the city is trying to preserve are Tic Toc and other Kaufmann's restaurant menus, an exterior brass store plaque, a salon chair and employee name tags. \n     \nThe building was acquired a decade ago by Macy's, which sold it to Core Realty for $15 million because it was only using a third of the space. The Philadelphia developer plans to convert it to apartments, a hotel and retail space. \n     \nRandy Mineo, Core's executive vice president of leasing, said the firm is interested in setting aside a place in the building to display Kaufmann's and Macy's artifacts.", "source": "WTAE.com"}