{"published": "2015-09-22T22:42:55Z", "media-type": "News", "title": "News Analysis: Americans still know little about Republican candidates' policies, even after 2nd debate", "id": "9c2dc212-a0ef-4e99-aaf4-8af0ca831c91", "content": "by Matthew Rusling \n\nDespite the fact that U.S. Republicans have already had two nationally televised debates, Americans still know very little about their policies, as the candidates have stuck to vague generalities and canned talking points, experts said. \n\nWhile the second debate aired on CNN earlier this month, was somewhat more substantial in terms of policy discussion than the first, candidates still engaged mostly in rhetorical jabs, rather than serious policy discussions or outlining their own plans to boost an economy that, while getting better, is still plagued by millions of unemployed and underemployed Americans. \n\n\"There was more discussion of policy, though it tended to revolve around pretty simplistic promises without much follow up about how it would work,\" Julian Zelizer, professor of history and public affairs at Princeton University, told Xinhua. \"A number of Republicans called for huge overseas military commitments without anyone asking how this would be paid for and how it would actually be achieved.\" \n\nThere were discussions of the economy without any sense of the very real improvements we have seen, so there was more policy (than the first debate), but it remained a thin discussion, according to Zelizer. \n\nHe reckoned it is unlikely that any candidates will spell out many specific policy measures in the lead-up to the 2016 race for the White House. Candidates feel that the fewer specifics they give, the less ammunition opponents have to pick them apart, he added. \n\nAnd that's why the insults and accusations continue to fly. \n\nIndeed, dominating the debate earlier this month was the personal animosity between billionaire mogul Donald Trump and former Hewlett-Packard CEO Carly Fiorina, as Trump had previously made negative remarks about her physical appearance and Fiorina told him off during the debates. \n\nFiorina came out swinging during the nationally televised Republican debate, hitting her opponents hard and emerging as a candidate to be taken very seriously. \n\nIn the second debate among more than a dozen Republican candidates vying for their party's nomination, Fiorina stood out the most, experts said. \n\nFront-runner and billionaire mogul Donald Trump was given passing marks for his performance as he had no shining moments. \n\nFiorina hit Trump with a series of stiff jabs, blasting his business performance in recent years and pointing out that he has lost money in his well-known Atlantic City casinos, though ironically many experts said Fiorina was a poor CEO during her time at HP. \n\nFiorina seemed to have the night's best performance, but some experts hesitated to give her a perfect score, as she expressed mostly intensity and rarely smiled, which is something that voters like to see once in a while, as it makes candidates seem more approachable.", "source": "Individual.com"}