{"published": "2015-09-30T19:46:12Z", "media-type": "News", "title": "Japan Tobacco Buys Assets from Reynolds American for $5 Billion", "id": "65923165-2537-47ce-8a40-0a73ac1c7a0f", "content": "Japan Tobacco Buys Natural American Spirit's International Assets \nReynolds American sells tobacco assets to Japan Tobacco \nOn September 29, 2015, Japan Tobacco (JAPAF) (JAPAY) announced that it has entered into an agreement with Reynolds American (RAI) to acquire international rights to the Natural American Spirit brand in an all-cash transaction valued at ~$5 billion. \n \nAlong with international rights, Reynolds American will also sell to Japan Tobacco the brand name, associated trademarks, and international companies that distribute and market the brand outside the United States. \n \n \nAfter the news, RAI stock rose 0.1% to close at $43.47. JAPAF stock fell 2.9% to close at $32.85. \nAbout JAPAF and RAI \nJapan Tobacco is a diverse group with leading tobacco brands and a presence in the pharmaceutical and processed food businesses. The company has operations in more than 70 countries and sells its products in more than 120 countries. \n \nIn 1999, Reynolds American’s subsidiary R.J. Reynolds Tobacco Company sold its international rights to several brands, including Winston and Camel, to JAPAF to conduct business outside the United States. \n \nReynolds American is the second-largest US tobacco company. It’s the parent company of R.J. Reynolds Tobacco Company, American Snuff Company, Santa Fe Natural Tobacco Company, Niconovum USA, Niconovum AB, and R.J. Reynolds Vapor Company. \n \nAccording to RAI’s CEO (chief executive officer) Susan M. Cameron, Santa Fe’s Natural American Spirit, backed by Japan Tobacco Group’s international distribution, sales force, and manufacturing facilities, will accelerate the company’s growth trajectory. We’ll learn more about JAPAF’s shrinking home market and Santa Fe’s Natural American Spirit brand in the rest of this series. \nAcquisitions by both companies \nEarlier this year, JAPAF bought Florida-based e-cig (electronic cigarette) maker Logic Technology Development for an undisclosed price. RAI also completed its acquisition of Lorillard Tobacco and related divestitures, including the sale of blu eCigs, Winston, Kool, and Salem brands to Imperial Tobacco Group (ITYBY) for $7.1 billion in June 2015. \n \nCompetitors are also expanding into the e-vapor innovative products. Vype (BTI), Zoom (VGR), and MarkTen (PM) (MO) are e-vapors produced by other companies. \n \nRAI and PM have exposure in the iShares Core High Dividend ETF (HDV) with 1.0% and 4.8% weight, respectively, as of September 25, 2015. \n \nContinue to Next Part \n\nBrowse this series on Market Realist", "source": "Yahoo! Finance"}