{"published": "2015-09-22T21:04:00Z", "media-type": "News", "title": "Global Biodegradable Packaging Solutions - By Industry, Geography And Vendors- Forecasts, Trends And Shares (2015- 2020)", "id": "5a8bc4d5-f9af-4b09-9ba1-02b563ee6aac", "content": "LONDON , Sept. 22, 2015 /PRNewswire/ -- The Global Bio-Degradable Packaging market is estimated at $4.92 billion in 2015 and is projected to reach $10.97 billion by the end of 2020 at a Compound Annual Growth Rate (CAGR) of 17.40%. This market is mainly driven by the growing conscientious population and government regulations who have started focusing towards the reduction of wastage and usage of Bio-Degradable packaging materials. However the lack of supply of Bioplastics and the higher cost of materials are hindering the growth of this market. The two major segments of this market includes Bio-Degradable Plastic Packaging and Bio-Degradable Paper Packaging market. The Bio-degradable Plastic Packaging accounts for more than 95% of the market but however the Bio-Degradable Paper packaging market is showing traction and is expected to witness high growth over the forecast period. Asia Pacific region dominates the Bio-Degradable Paper packaging market followed by North America and European regions. Food Packaging is a major segment accounting for more than 65% of Bio-Degradable Plastic & Paper packaging market. \n\nThe Global Bio-Degradable Packaging Market is segmented on the basis of Type: Plastic (Starch, Cellulose, PLA, PHA, PHB), Paper (Kraft, Flexible, Corrugated, Box Board), Region ( North America , Europe , Asia Pacific , Rest of World). The market is also segmented on the basis of applications such as Food, Beverage, Pharmaceutical, Personal/Homecare and others. This report also describes a detailed study of the Porter's five forces analysis of the market. All the five major factors in these markets have been quantified using the internal key parameters governing each of them. It also covers the market landscape of these players which includes the key growth strategies, geographical footprint, and competition analysis. \n   \nThe report also considers key trends that will impact the industry and key profiles of leading suppliers of Global Bio-Degradable Packaging Market. Some of the top companies mentioned in the report are Tetra Pak, Amcor, Mondi Group, Imex Packaging, McNichols Co, Kruger Inc., Biopac, Smurfit Kappa Group, Berkley International Packaging, EarthFirst Brand Films, GreenBlue, Inernational Paper, Ranpak Corp and Others. \n\n\nWhat the report offers \n\nMarket Definition for Bio-Degradable Packaging Market along with identification of key drivers and restraints for the market. \nMarket analysis for the Global Bio-Degradable Packaging Market, with region specific assessments and competition analysis on a global and regional scale. \nIdentification of factors instrumental in changing the market scenarios, rising prospective opportunities and identification of key companies which can influence the market on a global and regional scale. \nExtensively researched competitive landscape section with profiles of major companies along with their strategic initiatives and market shares. \nIdentification and analysis of the Macro and Micro factors that affect the Bio-Degradable Packaging Market on both global and regional scale. \nA comprehensive list of key market players along with the analysis of their current strategic interests and key financial information. \nDownload the full report: https://www.reportbuyer.com/product/3281871/ \n\nAbout Reportbuyer \nReportbuyer is a leading industry intelligence solution that provides all market research reports from top publishers \nhttp://www.reportbuyer.com \n\nFor more information: \nSarah Smith  \nResearch Advisor at Reportbuyer.com \nEmail: query@reportbuyer.com  \nTel: +44 208 816 85 48 \nWebsite: www.reportbuyer.com \n\n\n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/global-biodegradable-packaging-solutions---by-industry-geography-and-vendors--forecasts-trends-and-shares-2015--2020-300147455.html \n\nSOURCE  ReportBuyer", "source": "Indianapolis Business Journal"}