{"published": "2015-09-18T10:54:13Z", "media-type": "News", "title": "Tony Abbott and his old boys party at Kirribilli House", "id": "399f8535-6c45-4c16-832e-5296a482be2c", "content": "Tony Abbott almost had us fooled when he said he was about to say his final farewells to Sydney's prime ministerial pad on Friday afternoon. Tony Abbott almost had us fooled when he said he was about to say his final farewells to Sydney's prime ministerial pad on Friday afternoon. \"Shortly, Margie and I will be driving out of Kirribilli House for the last time as residents,\" he told reporters at the gate of the austere mansion.\n\nBut just two hours later Mr Abbott was back, if not as a resident then as a very familiar guest, welcoming more than 50 St Ignatius old boys for their 40th reunion.\n\nThe class of 1975 arrived at the prime ministerial pad in two bus loads, ferried from a North Sydney pub where they had been wetting their whistles before the main event.\n\nMr Abbott greeted every one of the \"Old Ignatians\" at the door of Kirribilli House, beaming as he shook hands, patted backs and bear hugged his old school pals.\n\n\"How are you, mate,\" Mr Abbott said jubilantly and repeatedly.\n\nRaucous laughter drifted from the house as Mr Abbott lingered at the front door until all his guests had arrived.\n\nThe timing could not have been worse for Mr Abbott, who was ousted as prime minister just four days before he was due to host the reunion at the PM's Sydney lodgings.\n\nThe reunion had been in the planning stages for months and was supposed to be a very covert operation.\n\nWith Monday night's leadership challenge seeing Abbott out of the big gig, organisers were frantically trying to work out what to do, but all were assured that the party would continue as planned, despite Margie Abbott being photographed packing up the family's Tupperware in preparation for eviction and their return to Forestville.\n\nAnd in a move completely at odds with Australia's revolving door PM policy, they did not scramble for a replacement, but stuck with their original plan.\n\nEarlier on Friday afternoon Abbott and Margie packed up the family cars, loading up a canoe, a surfboard, a bike and their dog.\n\nThey looked like any couple about to take a family holiday.\n\nPerhaps tomorrow, nursing a hangover, that's exactly what Abbott will do. The story first appeared on The Sydney Morning Herald.", "source": "Bombala Times"}