{"published": "2015-09-05T20:58:30Z", "media-type": "News", "title": "Top 25 roundup: Northwestern upsets No. 21 Stanford", "id": "44674d1b-8dad-4de7-b9c9-34165502651e", "content": "EVANSTON -- Northwestern got three field goals by Jack Mitchell and a touchdown run by quarterback Clayton Thorson to upset No. 21 Stanford 16-6 in a season-opening game for both teams Saturday. \n \nThorson, a redshirt freshman making his first career start, completed 12 of 24 passes for 105 yards. The 6-foot-4, 220-pound quarterback rushed for 68 yards on eight carries, including a 42-yard touchdown run in the second quarter. \n\nSophomore Justin Jackson rushed the ball 28 times for 134 yards to lead the Wildcats, while Stanford starting running back Christian McCaffery carried 12 times for 66 yards and fumbled once. \n\nSenior Christian Jones, who missed last season with a knee injury, caught five passes for 52 yards to lead Northwestern receivers. \n\nGeorgia 51, Louisiana-Monroe 14 \n\nATHENS, Ga. -- Although the ninth-ranked Bulldogs weren't perfect and mistakes were made, they simply had too much offensive firepower and used it to roll over the Warhawks. \n\nGeorgia sophomore Heisman Trophy candidate Nick Chubb picked up where he left of, rushing 16 times for 120 yards and two touchdowns while Greyson Lambert made his debut as the Bulldogs' starting quarterback and completed 8 of 12 passes for 144 yards and two scores, including one each to Malcolm Mitchell and Jeb Blazevich. \n\nKeith Marshall also enjoyed a big day. After playing in just three games last year after tearing his ACL in 2013 against Tennessee, Marshall rushed 10 times for 73 yards with two touchdowns. \n\nOle Miss 76, UT-Marin 3 \n\nOXFORD, Miss. -- Chad Kelly threw two touchdowns in the first half and the No. 17 Rebels rolled to a convincing win. \n\nKelly dazzled the crowd of 60,186 fans at Vaught-Hemingway Stadium from the start, completing pass after pass to a wide array of weapons at his disposal. Kelly, the nephew of NFL Hall of Fame quarterback Jim Kelly, completed his first touchdown pass to Markell Pack. It covered 56 yards, with the majority of it coming through the air down the middle of the field. Kelly finished the first half 6-for-10 for 178 yards and he made up for an interception he threw in the third by running for a score a few minutes later. \n\nKelly wasn't the only Rebel skill player who shined Saturday. Running back Jaylon Walton scored the first two times he touched the ball, while wide receiver Laquon Treadwell returned from a season-ending injury in 2014 in seamless fashion. \n\nClemson 49, Wofford 10 \n\nCLEMSON, S.C. -- Sophomore Deshaun Watson, playing in his first game since suffering a torn ACL last November, got off to a solid start, completing 18 of 22 passes for 194 yards and two touchdowns in limited duty as the No. 12 Tigers rolled past Wofford. \n\nWhile Watson appeared completely healed from ACL surgery last December, the Tigers' post-game concern focused on the health of junior wide receiver Mike Williams. He snagged a 4-yard touchdown pass from Watson to cap Clemson's game-opening drive, but suffered a neck injury on the play when he collided with the goalpost support. Williams remained on the ground for approximately 15 minutes before being placed on a stretcher and carted off the field. \n\nWilliams, who led Clemson with 1,030 receiving yards last season, raised his right arm as he left the field, but was hastened to a nearby hospital for evaluation.", "source": "WYFF4.com"}