{"published": "2015-09-19T00:02:33Z", "media-type": "News", "title": "U.S. grains: Soybeans fall as harvest looms; wheat firms", "id": "0d6d8c1e-3629-42cc-9114-d3b3bb3a7657", "content": "Chicago | Reuters – – U.S. soybean futures fell on Friday and were down about 0.8 per cent for the week as farmers prepared to harvest a bumper crop in the Midwest, traders said. \n \nCorn followed soybeans lower while wheat futures firmed on short covering, despite ample global supplies. \n \nAt the Chicago Board of Trade, November soybeans settled down 17-1/4 cents at $8.67-1/4 per bushel after hitting $8.66-1/2, a one-week low (all figures US$). \n \nDecember corn ended down 2-1/2 cents at $3.77-1/4 a bushel and December wheat rose 5-1/4 cents to $4.86-3/4 a bushel. \n \nSoybeans slid on expectations that farmers will soon begin harvesting what is projected as the second-largest U.S. soy crop in history. Harvest is under way in the mid-South and a few parts of the Midwest, including top states Illinois and Iowa, brokers said. \n \n“The yield reports that have been coming through on beans (are) generally looking better than they have on corn,” said Rich Feltes, vice president for research with R.J. O’Brien. \n \nForecasts called for mostly dry weather next week and for the rest of the month, with no frost, Feltes noted, which should help crops to mature and promote fieldwork. \n \nCash soybean values have been falling in the Midwest this week as processors brace for the influx of new-crop supplies. \n \nAlso bearish were early prospects for record-large crops out of South America, where farmers are planting. Brazilian analyst Safras + Mercado raised its forecast for the country’s 2015-16 soybean crop to a record 100.54 million tonnes, from 99.3 million in July. \n \n“Most of the big-picture stuff is pretty negative,” said Joe Vaclavik, president of Standard Grain, Chicago brokerage. \n \nCorn followed soybeans lower on seasonal U.S. harvest pressure and sluggish export demand. \n \nWheat futures climbed on what appeared to be fund short covering. Commodity funds hold a net short position in CBOT wheat, leaving the market open to short-covering rallies. But ample world wheat supplies hang over the market. \n \nUnderscoring strong competition for exports, a wheat tender from Egypt’s General Authority for Supply Commodities attracted offers of about 945,000 tonnes from the Black Sea region and France. No U.S. wheat was offered. \n \nEgypt bought a total of 230,000 tonnes of Ukrainian, Russian and French wheat. \n \n— Julie Ingwersen is a Reuters correspondent covering grain markets from Chicago. Additional reporting for Reuters by Nigel Hunt in London and Naveen Thukral in Singapore . \n Tagged  cbot , closing markets , corn futures , soybean futures , wheat futures", "source": "AGCanada.com"}