{"published": "2015-09-13T13:17:54Z", "media-type": "News", "title": "Lambie’s son ‘exploited’", "id": "bb4590fa-2ffa-4d15-bc00-d6f579f596d3", "content": "TASMANIAN independent Senator Jacqui Lambie claims her son was used as a political chess piece in an alleged attack via mainstream media. TASMANIAN independent Senator Jacqui Lambie claims her son was used as a political chess piece in an alleged attack via mainstream media. Senator Lambie on Sunday announced she would pursue an Australian Press Council investigation into the alleged ‘‘exploitation’’ of her son, Dylan Milverton, in a News Limited article.\n\nMr Milverton’s use of the drug known as ice was made public by Senator Lambie in national media.\n\nIn the News Limited article, Mr Milverton said he was now only known for his drug use and that Senator Lambie did not hold his wellbeing as a priority.\n\nSenator Lambie claims the article was part of a strategy to ‘‘goad’’ her into a response.\n\n‘‘Last Friday the 11th of September I was warned that the media was going to use my son to politically attack me,’’ she said.\n\n‘‘I didn’t think they would stoop so low. However, I was wrong. The warnings were correct.’’\n\nSenator Lambie said the interview for the article was held on the same day her son had appointments to meet with an ice rehabilitation and detoxification group, and a barrister.\n\n‘‘My son failed to keep that appointment where arrangements were being finalised with medical professionals and the police, in order to transport him to a rehab centre on the mainland,’’ she said.\n\n‘‘There are many questions that need to be answered by the journalist – but one fact is clear, when (the journalist) conducted the interview, my son was vulnerable, drug affected, with diminished capacity and officially part of a drug rehab program – having signed official documents two days earlier.’’\n\nSenator Lambie said she requested a full transcript of the interview, which was refused, and that the journalist approached her officer for comment less than two hours before deadline.\n\n‘‘These are matters I hope the Australian Press Council will take up on my behalf,’’ she said.\n\n‘‘In the meantime I will work closely with the professionals at Teen Challenge, my legal advisors and the police in order to help my son beat his addiction and put his life back together.’’", "source": "Tasmanian Examiner"}