{"published": "2015-09-15T06:34:58Z", "media-type": "Blog", "title": "8 Genius Eyeliner Hacks Every Woman Needs to Know", "id": "4642988c-5b9a-46e4-936a-c2863437d956", "content": "Twitter Facebook Google + Linkedin Comments 1. Make your eye makeup last longer by setting your eyeliner with a matching eye shadow. Make your eye makeup last longer by setting your eyeliner with a matching eye shadow\nFirst, line your eyes with a pencil liner, and then lightly dust eye shadow in the same shade on top to hold the liner in place.\n2. Use a pencil liner as a guide for tricky liquid liners. Use a pencil liner as a guide for tricky liquid liners\nIf your hand isn’t steady enough for liquid eyeliner, line your eyes first with a pencil liner, and then trace over it with liquid.\n3. Make a less pigmented eyeshadow more vibrant by covering your eyelid with a white eyeliner first. Make a less pigmented eyeshadow more vibrant by covering your eyelid with a white eyeliner first\nThis will help cancel out the color of your skin, creating an even base for the shadow and making the color pop.\n4. Create your own custom eyeliner with a wet liner brush and eyeshadow. Create your own custom eyeliner with a wet liner brush and eyeshadow\nThe wet brush will darken the pigments a bit and create a sharp look like a liner.\n5. If you have monolids, use a gel or liquid liner and draw a thick arch to create the perfect line. If you have monolids, use a gel or liquid liner and draw a thick arch to create the perfect line\nIf your eyelids hide your eyeliner, try drawing an arched line above your lash line a little thicker than you think. When you open your eyes, you’ll have perfect-size lines.\n6. Use white eyeliner as a brow highlighter for an instant eye lift. Use white eyeliner as a brow highlighter for an instant eye lift\nLine below and above your eyebrows with a thick white liner, and smudge it out with a sponge brush to define your brows.\n7. Make your own gel liner by warming the tip of a kohl liner with a lighter. Make your own gel liner by warming the tip of a kohl liner with a lighter\nHold the tip of the liner right above the flame for a few seconds, and then test the pencil on the back of your hand before lining your eyes.\n8. If getting a perfect line is too challenging, draw a rough line first, and then sharpen it with a cotton swab and petroleum jelly. If getting a perfect line is too challenging, draw a rough line first, and then sharpen it with a cotton swab and petroleum jelly\nSometimes erasing mistakes is easier than trying to nail it the first time.\nTwitter Facebook Google + Linkedin Comments", "source": "Fashion Central India"}