{"published": "2015-09-18T07:44:03Z", "media-type": "News", "title": "Johnny Depp, Alice Cooper and Co. Raise Dead at Hollywood Vampires' Debut 14 hours ago", "id": "ab3c1e73-efb9-4f62-80fe-615693bbe879", "content": "Much has been made of the Sunset Strip's demise. Pay-to-play has ruined legendary venues, and the House of Blues is no more. It took a bunch of old, death-obsessed  Hollywood Vampires at the Roxy Theatre Wednesday night to prove that live rock's traditional epicenter is still as vital as ever. \n Sidebar    Inside Hollywood Vampires' Drunk History With Alice Cooper »  \nThe Vampires are to supergroup what Roman is to empire, the players so storied that band member Johnny Depp is just another face onstage. Ditto for surprise guest vocalists Kesha and Perry Farrell, and for Black Sabbath bassist Geezer Butler and drummer Zak Starkey (the Who, Oasis), both of whom sat in last night. There were 11 people onstage, including Farrell's wife, Etty Lau Farrell, at one point in the Vampires' hourlong set to celebrate this month's covers-heavy self-titled debut album . There was actually discernible disappointment that the likes of Vampires collaborators Dave Grohl, Sir Paul McCartney, Joe Walsh and Slash didn't appear on the two-foot high stage. Yeah, seeing Johnny Depp, in a black vest and eyeliner, push his ax into descending madness for a solo on \"Raise the Dead,\" was just ho-hum for an industry-heavy audience of leather-skinned folks with expense accounts. \n \n[embedded content] \n \nBut when the Vampires tore into the Who's \"My Generation\" the sold-out audience was there, simmering to a pounding bass line that communicated urgency, strength and youth. Lead vocalist Alice Cooper is the God-voice of rock, with a deep, paternal sound that says, \"Oh, yes, you will come along for this ride.\" One black glove squeezed a mic, the other chopped at his mates behind him as he orchestrated bridges and breakdowns. \n\nThe fashion of the affair could suggest a rock & roll wake, and Cooper dedicated a song, \"My Dead Drunk Friends,\" to all his \"brothers who drank until they died.\" \n\nIndeed, respect for Sunset Strip's fallen heroes is the morbid theme of the Vampires, a rebirth of Cooper's Seventies-era drinking clique called, yes, the Hollywood Vampires. As darkly impressive as that sounds, the Lair of the Hollywood Vampires next door at industry haunt the Rainbow Bar and Grill is really just a cubbyhole of a space. Cooper's original Vampires included John Lennon, Harry Nilsson and Keith Moon, and they stalked the night in an era when you could still proudly party yourself to death. \n\nHollywood Vampires, the band, was formed three years ago by Alice and Depp. Joe Perry, Aerosmith's lead guitarist, completed the triumvirate. Adding to the scrum Wednesday were Guns N' Roses' old rhythm section — Matt Sorum on skins, Duff McKagan on bass — plus Tommy Henriksen on guitar, and Bruce Witkin on keys and guitar. \n \nThe seven all-stars played mean and tight. If you closed your eyes, you wouldn't know the median age onstage was well over 50. Sorum's double bass on Spirit's \"I Got a Line on You\" was straight-up punk rock. The driving, 4/4 kick on John Lennon's \"Cold Turkey\" was booming enough to be worthy of any big-stage dance festival. The sheer, angry energy on \"Break on Through\" (the Doors) was worthy of a mosh pit. Cooper is known for his glam-rock antics, but the only prop onstage during the show was a beer mug he turned upside down to show that the fake brew didn't spill. (The now-sober veteran pawed it during \"My Dead Drunk Friends.\") \n \nThe Vampires are pretty serious rock & roll business. Even founding member Depp, who is getting rave reviews for his portrayal of Whitey Bulger in Black Mass , was a verified rocker before he ever hit the big screen. \"This guy could play,\" Cooper told Rolling Stone earlier this month. \n\nA little bit more than midway through the set, Cooper returned to the Dia de Los Muertos–like theme. He asked if the audience could relate to the end game of drugs and alcohol. \"Half of us are dead,\" he said, \"and some of us are still here.\" \n\nAs if to prove it, he brought on Tom Morello (Rage Against the Machine) for an epic rendition of \"Manic Depression.\" Morello demonstrated sonic bipolar disorder in a short, twisted solo that had him bending his strings in ways that made his ax sound almost like a theremin. Then he used his teeth. Morello, low key in his trademark baseball cap, is an absolute monster onstage. In a room filled with boldface names, he almost stole the show. \"Tommy, thank you,\" Cooper said in a rare acknowledgement of a fellow collaborator. The crowd roared. \n\nPerry Farrell  peacocked around the stage for Nilsson's \"Jump Into the Fire.\" His voice is almost indigenous to Los Angeles rock; he should be the city's rock laureate. His wife, Etty Lau Farrell, her red lipstick shimmering from a rear corner of the stage, sang back-up on \"School's Out,\" when all the players joined in. (The track morphed into \"Another Brick in the Wall (Part 2)\"). Kesha belted out \"Whole Lotta Love\" like she grew up on Zeppelin and the blues. And Starkey, appropriately, destroyed the kit on the Who's \"I'm a Boy.\" \n\nThis wake for the boys of yore sounded more like the resurrection of serious musicianship on the Strip. The Hollywood Vampires almost raised the dead. Next door, at the Rainbow, manager Dane De Lucchi kept the original Lair and its adjacent, nautically themed bar reserved just in case the Vampires wanted to return to this cradle one more time. He wasn't sure if the band would show, but he did say Cooper was always game for a Rainbow afterparty. \n\n\"They called us Hollywood Vampires,\" Cooper explained earlier in the night, \"because we didn't see daylight.\" \n \nSet List: \n\n\"Raise the Dead\" \n\"My Generation\" \n\"I Got a Line on You\" \n\"Cold Turkey\" \n\"Five to One\"/\"Break on Through\" \n\"Manic Depression\" \n\"One\"/\"Jump Into the Fire\" \n\"7 and 7 Is\" \n\"Whole Lotta Love\" \n\"Jeepster\" \n\"I'm a Boy\" \n\"School's Out\"/\"Another Brick in the Wall (Part 2)\" \n\"My Dead Drunk Friends\"/\"Billion Dollar Babies\"/\"Train Kept A-Rollin'\" \n\"Brown Sugar\"/\"Honky Tonk Women\"", "source": "Rolling Stone"}