{"published": "2015-09-22T15:08:32Z", "media-type": "News", "title": "New HD Scaler From Atlona Features Built-In 3x1 Switching for HDMI and VGA Sources", "id": "d642aa36-7002-492d-b07f-c0397fef3266", "content": "9/22/2015 10:02 AM \r \n \nAddressing the frequent need for simple, reliable switching and scaling of digital and analog inputs to office and classroom AV systems, Atlona has introduced the AT-HD-SC-500 , a three-input HD scaler which can select input signals through auto-sensing, front panel control, or remotely via RS-232 or IP control. \n\nThe new scaler, designed to take video signals from AV sources, switchers, or computers, can scale them to an HDMI output in a wide-range of HDTV and PC resolutions, up to 1080p/60Hz and WUXGA (1920×1200).  Audio features include a stereo input for the VGA source, de-embedded audio from the HDMI inputs, and a balanced stereo output. \n\n“In many commercial and classroom settings, the requirement for video scaling is often accompanied by the need for signal switching as well as some audio processing,” said Bill Schripsema, senior product manager.  “From a practical perspective, the auto-switching capability of the HD-SC-500 makes selecting the AV input as simple as turning on the source equipment.  For more robust systems, the remote control features ensure installers can configure solutions that address wide-ranging customer needs.” \n\nThe new scaler accommodates two HDMI sources and one VGA source and provides one HDMI output.  In addition to RS-232 and TCP/IP control, the device features a built-in webserver with a GUI, allowing rapid, remote configuration.  LEDs indicate power state and active input source, and front panel controls include manual source selection and volume adjustment, including mute.   The HD-SC-500 can be rack-mounted (I RU height, ¼ RU width), or located adjacent to source or display devices.  Power is provided by an included 5V power supply. \n\nThe AT-HD-SC-500 has an MSRP of $449.99 and is available immediately. \n\nLink to high res-image: AT-HD-SC-500 \n\nAbout Atlona \n\nAtlona is a leading provider of innovative, reliable AV and IT distribution and connectivity solutions. Since 2003, the company has been designing and engineering award-winning products for a diverse range of residential and commercial AV and IT markets, including education, business, government, entertainment, and healthcare. \n\nAtlona’s products and services enable system designers, integrators, consultants, and installers to simplify installation, minimize maintenance, and maximize the versatility of premier automated control solutions. Atlona’s vision is simple: deliver customer-driven products designed and developed with the features, performance, and reliability that industry leaders demand; and deliver the best value in the industry.  More information about Atlona is available at  http://www.atlona.com or follow Atlona on Twitter at @Atlona. ", "source": "Sound and Video Contractor"}