{"published": "2015-09-16T19:38:14Z", "media-type": "News", "title": "Is Your Child in the Correct Car Seat? Join Alaska Injury Prevention Specialists & Anchorage Fire Department this Friday PM to make sure", "id": "394dc030-5ff6-4a3b-94dd-9e36d525ec7b", "content": "Parents Offered Free Resources to Ensure Children’s Safety\r\nAFD, AIPC & SK Alaska Will Check Car Seats During Child Passenger Safety Week  \nAnchorage Fire Department \n \nPublished: September 16, 2015 \n \nEvent: Friday, September 18, 2015 3:00-5:00 p.m. \n\r\nAt: Anchorage Fire Station Training Center – 1150 Airport Heights \n\r\n\r \nEvery day in America, too many children are riding in the wrong car seats or are completely unrestrained. To help combat the issue, AFD, AIPC & SK Alaska announced today its participation in Child Passenger Safety Week, a campaign dedicated to helping parents and caregivers make sure their children ride as safely as possible, every trip, every time. Child Passenger Safety Week runs September 13-19 and is sponsored by the U.S. Department of Transportation’s National Highway Traffic Safety Administration (NHTSA). \n\r\n\r \n“Every 34 seconds a child under the age of 13 is involved in a crash,” said Seethaler “Using car seats that are age- and size-appropriate is the best way to keep your child safe.” Motor vehicle crashes are a leading killer of children. Car seats, booster seats, and seat belts, she said, can make all the difference. “In 2013, 263 children under age 5 were saved because they were in child restraints. Cars seats matter, and having the right car seat installed and used the right way is critical.” \n\r\n\r \nShe added that too often, parents move their children to the front seat before they should, which increases the risk of injury and death. The safest place for all kids under 13 is in the back seat of the car. Also, according to NHTSA, about 24 percent of children ages 4 to 7 (who should be riding in booster seats), were prematurely moved to seat belts, and 9 percent were unrestrained altogether. \n\r\n\r \n“It’s our job to keep our children safe,” She stressed. “Get your car seats checked. Make certain they’re installed correctly, that your kids are in the right seat and are buckled in the right way. Even if you think your child is safe, check again, so you can be sure that your child is the safest he or she can be while traveling. According to NHTSA, 59 percent of car seats are misused.” \n\r\n\r \nNHTSA recommends keeping children rear-facing as long as possible up to the top height or weight allowed by their particular seats. Once a child outgrows the rear-facing only “infant” car seat, he/she should travel in a rear-facing “convertible” or all-in-one car seat. Once your child outgrows the rear-facing size limits, he or she is ready to travel in a forward-facing car seat with a harness and tether. After outgrowing the forward-facing car seats, children should be placed in booster seats until they’re the right size to use seat belts safely. \n\r\n\r \nAlways remember to register your car seat and booster seat with the car seat manufacturer so you can be notified in the event of a recall. Parents and caregivers can view more information on car seat safety and locate a certified technician at www.safercar.gov/parents .", "source": "Alaska Business Monthly"}