{"published": "2015-09-09T08:05:00Z", "media-type": "News", "title": "Pluristem Completed Successful Meeting With the U.S. FDA in Preparation for Filing an IND for PLX-R18 to Treat Incomplete Hematopoietic Recovery After Bone Marrow Transplantation", "id": "63effbd3-6c27-49af-91d0-a026410b0d15", "content": "HAIFA, Israel, Sept. 9, 2015 (GLOBE NEWSWIRE) -- Pluristem Therapeutics Inc . (Nasdaq:PSTI) (TASE:PSTI), a leading developer of placenta-based cell therapy products, today announced that it has completed a successful meeting with the U.S. Food and Drug Administration (FDA) regarding the initiation of a Phase I clinical trial for its PLX-R18 cells in the treatment of incomplete hematopoietic recovery following hematopoietic cell transplantation. Hematopoietic stem cells, which produce the body's blood cells, are transplanted in various settings to facilitate regeneration of the hematopoietic system, for example in the context of certain cancers or immune-mediated bone marrow failure. \n\nDuring Pluristem's meeting with the FDA, the regulatory agency communicated that the preclinical data presented by the company would support an Investigational New Drug (IND) application to test PLX-R18 in humans. The Company also presented the design of its proposed Phase I study to the FDA. Pluristem anticipates initiating the Phase I trial in the U.S. in early 2016.   \n\n\"We were very pleased with the positive outcome of our recent FDA meeting. The timeline for our IND submission and anticipated clearance by the FDA are in line with the timetable and strategy we outlined earlier this year regarding the development of PLX-R18,\" stated Pluristem CEO Zami Aberman.  \n\nIncomplete hematopoietic recovery following hematopoietic cell transplantation marks the first indication to be pursued in human trials for PLX-R18, Pluristem's second cell therapy product in development. PLX-R18 is also being developed, in partnership with the U.S. National Institutes of Health, as a potential treatment for Acute Radiation Syndrome. \n \n About Hematopoietic Cell Transplantation \n\nHematopoietic stem cells, which can be obtained from bone marrow, peripheral blood, or umbilical cord blood, are transplanted into patients with damaged, dysfunctional or ablated bone marrow in order to restore normal production of white and red blood cells and platelets. Successful engraftment of transplanted hematopoietic cells can take weeks, but in some cases recovery of the bone marrow can be delayed for many months, or remain insufficient indefinitely. During that time, patients are at substantial risk of death from hemorrhage, infection, or even severe anemia. Building on the positive preclinical data showing that PLX-R18 can significantly increase the production of all blood cell types, Pluristem believes that PLX-R18 may become a transformative treatment option for patients with insufficient hematopoietic function. \n \n About Pluristem Therapeutics \n\nPluristem Therapeutics Inc. is a leading developer of placenta-based cell therapy products. The Company has reported robust clinical trial data in multiple indications for its patented PLX (PLacental eXpanded) cells. The cells release a cocktail of therapeutic proteins in response to inflammation, ischemia, hematological disorders, and radiation damage. PLX cell products are grown using the Company's proprietary three-dimensional expansion technology. They are off-the-shelf, requiring no tissue matching prior to administration. \n \nPluristem has a strong intellectual property position; Company-owned, GMP-certified manufacturing and research facilities; strategic relationships with major research institutions; and a seasoned management team. \n\n Safe Harbor Statement \n\nThis press release contains forward-looking statements within the meaning of the \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995 and federal securities laws. For example, we are using forward-looking statements when we discuss the expected timing for submitting our IND application to the FDA and commencing a Phase I/II multi-site trial in the U.S. for our PLX-R18 cells in the treatment of insufficient engraftment of transplanted hematopoietic cells, when we discuss the anticipated clearance by the FDA to our expected IND submission, and when we discuss our belief that PLX-R18 may become a transformative treatment option for patients with insufficient engraftment of hematopoietic stem cells. These forward-looking statements and their implications are based on the current expectations of the management of Pluristem only, and are subject to a number of factors and uncertainties that could cause actual results to differ materially from those described in the forward-looking statements. The following factors, among others, could cause actual results to differ materially from those described in the forward-looking statements: changes in technology and market requirements; we may encounter delays or obstacles in launching and/or successfully completing our clinical trials; our products may not be approved by regulatory agencies, our technology may not be validated as we progress further and our methods may not be accepted by the scientific community; we may be unable to retain or attract key employees whose knowledge is essential to the development of our products; unforeseen scientific difficulties may develop with our process; our products may wind up being more expensive than we anticipate; results in the laboratory may not translate to equally good results in real clinical settings; results of preclinical studies may not correlate with the results of human clinical trials; our patents may not be sufficient; our products may harm recipients; changes in legislation; inability to timely develop and introduce new technologies, products and applications; loss of market share and pressure on pricing resulting from competition, which could cause the actual results or performance of Pluristem to differ materially from those contemplated in such forward-looking statements. Except as otherwise required by law, Pluristem undertakes no obligation to publicly release any revisions to these forward-looking statements to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events. For a more detailed description of the risks and uncertainties affecting Pluristem, reference is made to Pluristem's reports filed from time to time with the Securities and Exchange Commission. \nCONTACT: Pluristem Therapeutics Inc.\n         Karine Kleinhaus, MD, MPH\n         Divisional VP, North America\n         1-914-512-4109\n         karinek@pluristem.com", "source": "Reuters"}