{"published": "2015-09-07T15:33:34Z", "media-type": "News", "title": "Nicole Kidman says her return to the West End is a tribute to her late biochemist father", "id": "f7f6a472-fbc1-4c2a-aeaf-2d115c0341dc", "content": "Nicole Kidman has said that her return to the West End is a tribute to her biochemist father and other research scientists whose contributions to vital discoveries are often overlooked by… \r \nAdam Sherwin \n\nAdam Sherwin is Media Correspondent at The Independent and an award-winning writer who specialises in covering the entertainment, broadcasting, music and popular culture industries. Previously Media writer and diarist at The Times, he was a co-founder of the Beehive City media and entertainment website. As regular contributor to BBC London 94.9 Radio station, he was named Music Business writer of the year at the awards of influential music industry site Record of the Day in 2006. \n\nThe Oscar-winner stars in Photograph 51 as molecular biologist Rosalind Franklin, who played a crucial role in identifying the structure of DNA but never received the same recognition as James Watson, Francis Crick and Maurice Wilkins. \n\nMs Kidman, who takes to the stage 17 years after her acclaimed performance in The Blue Room, had discussed the play with her father, Dr Antony Kidman. \n\nThis is my way of acknowledging him and acknowledging people in science who quietly go about their work and aren't acknowledged a lot of the time,” she said. “My father was a biochemist. As a kid me and my sister used to go to the laboratory and wait for him – we were given test tubes and Bunsen burners to play with. But he was a doctor of research into muscular dystrophy. \n\n“He was Dr Kidman but as a child, I had to learn very early on, when people asked if my dad was a medical doctor, to say: ‘No, he’s just a research doctor. \n\n’” \n\n“That was not considered impressive. It would have been far more impressive if I could have said he was brain surgeon. As a child I was aware that research scientists are not honoured on the same level as brain surgeons. \n\n” \n\nPhotograph 51 is the name given to an x-ray image taken by Franklin at King’s College London, which revealed the double-helix shape of DNA. \n\nRead more: Dr Antony Kidman dies after tragic accident \n\nNicole Kidman is back in the West End in Photograph 51 \n\nNicole Kidman faces feminist pressure from union \n\nFranklin wanted to use the picture for further research but her colleague Wilson showed the image to Crick and James Watson, who then identified how DNA was structured. The male trio were awarded the Nobel prize for physiology in 1962. Franklin had died of cancer four years earlier. \n\nThe row over Sir Tim Hunt’s unguarded comments about “the trouble with girls” in science demonstrated that the battle for equality in the laboratory has not yet been won. “There is still an enormous amount of inequality for women,” Ms Kidman said. “One of the reasons for doing the play was to shine a light on that. \n\n“Rosalind was not an extrovert. She did not trust other people with her work. She was a quiet, methodical, brilliant person whose massive contribution went unacknowledged. That’s not right. \n\n” \n\nHer mother encouraged her to take the role when the actress was wavering. “I told her ‘I’m scared.’ She said ‘So what, you’ve been scared befo…", "source": "MyInforms"}