{"published": "2015-09-28T20:51:10Z", "media-type": "News", "title": "Polpharma Has a New CEO", "id": "97620332-567d-4b24-9d07-729da81c7386", "content": "Dr Maurice Chagnaud will be appointed as the new Chief Executive Officer of Polpharma, the largest Polish pharmaceutical group. Dr Chagnaud, who has over twenty years' experience in top management positions in the European pharmaceutical industry, is expected to further accelerate the development of Polpharma to become a regional leader in CEE, CIS and Central Asia. \n\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/793d84b7-01d5-4bc5-a149-db9dcd51e65c\n\nThe Polpharma Group is among the top 20 generic drug manufacturers in the world. It is a leading generics player based in Poland, operating across Europe, CIS and Central Asia, with manufacturing subsidiaries in Poland, Russia and Kazakhstan. It actively invests in biologics, building a strong internal organization as well as external partnerships for global development and the commercialization of biosimilars. \n\n\"Polpharma's strategic goal is to become a regional leader and grow outside of our current boundaries. We are impressed by the extensive experience of Mr Chagnaud, gained in international companies such as Merck Generics, Teva and Lupin, where his achievements included building regional strategies and transforming organizations to meet new challenges. I am confident that he will manage Polpharma effectively, identify and pursue new opportunities, and motivate our team to deliver outstanding performance to secure the long-term growth of our group,\" says Jerzy Starak, Chairman of Polpharma's Supervisory Board. \n\nMaurice Chagnaud has over 20 years' experience in generics, OTC medicines, and biosimilars gained in international companies, where his achievements included building regional strategies and transforming organizations to meet new challenges. He worked for Merck Generics (Merck KgAa) for twelve years, responsible for its all commercial operations (retail, hospital and export) in France and as General Manager of Merck Generics Italia. Over the next seven years, he held several positions at TEVA: he was General Manager of TEVA and Ivax France, Chief Commercial Officer of TEVA Europe, and Senior Vice President in Central and Eastern Europe, running several acquisitions and integrations of companies. More recently, he served as President Europe - Russia & CIS and Global Head of Inhalation Strategy at Lupin, where he developed a European strategy including new geographies, reshaping the portfolio, and new commercial initiatives. He is a doctor of medicine, and holds an MBA degree in marketing, finance and administration. \n\nAs the new CEO of Polpharma, Dr Chagnaud will succeed Markus Sieger, who has been delegated by the Supervisory Board to exercise supervision over the company for the last six months, and who will remain a Member of Polpharma's Supervisory Board.\n\nAbout Polpharma Group\n\nPolpharma Group is a leading generics player based in Poland, operating across Europe, the Caucasus and Central Asia, with manufacturing subsidiaries in Poland, Russia and Kazakhstan. It is among the top 20 generic drug manufacturers in the world with annual sales of approximately $1 billion. The Polpharma Group portfolio includes nearly 600 products with another 200 in development. It is also one of the leading European API producers, delivering products for pharmaceutical companies worldwide. In order to provide patients with more affordable access to modern biologic drugs, Polpharma Group has decided to focus on biosimilar products. It has created a state-of-the-art R&D and production centre and established strategic partnerships in addition to expanding its capabilities in the development and commercialization of biosimilars. For more information visit the Polpharma Group website at www.polpharma.pl/en. \n\nContact information\n\nMagdalena Rzeszotalska, Corporate Communications and CSR Director, Polpharma, phone: +48 607 696 473, magdalena.rzeszotalska@polpharma.com\n\nThis announcement is distributed by NASDAQ OMX Corporate Solutions on behalf of NASDAQ OMX Corporate Solutions clients.\n\nThe issuer of this announcement warrants that they are solely responsible for the content, accuracy and originality of the information contained therein.\n\nSource: Polpharma via Globenewswire \n\nHUG#1955", "source": "EuroInvestor"}