{"published": "2015-09-19T12:15:32Z", "media-type": "News", "title": "Egypt keeps key interest rates unchanged", "id": "49ec4b23-0a2e-429a-a1b7-5e9b35c29e2c", "content": "Egypt’s central bank kept its benchmark interest rates unchanged at a monetary policy committee meeting on Thursday, citing the need to balance inflation risks with economic growth. \n\nThe overnight deposit rate stayed at 8.75 per cent and the overnight lending rate was held at 9.75 per cent, the bank said in a statement. \n\n“...while investments in domestic mega projects are expected to contribute to economic growth, the downside risks and uncertainty that surround the global economy... could pose downside risks to domestic GDP,” the central bank said. \n\nThree of five economists surveyed by Reuters said they had expected the central bank’ monetary policy committee (MPC) to keep rates on hold as part of its effort to keep inflation under control. “...we suspect that policymakers were swayed from cutting rates as they, along with many other [emerging market] central banks, await greater clarity on the next move from the U.S. Federal Reserve,” Capital Economics said in a research note on Thursday. \n\nDeposit rates \n\nAt its last meeting on July 30, the central bank held deposit rates steady at 8.75 per cent and its lending rate at 9.75 per cent for the fourth consecutive meeting after a surprise 50 basis-point cut in January. \n\nEgypt’s economy has been struggling with sluggish growth after more than four year of political instability. The government projects growth of about 5 per cent this fiscal year, compared with estimated growth of 4.2 per cent in 2014/15. \n\nAnnual inflation accelerated after the government slashed subsidies last year but has since been slowing. It dropped for the third consecutive month in August to its lowest level in more than two years, with urban consumer inflation dropping to 7.9 per cent in August. \n\nThe overnight deposit rate stayed at 8.75 per cent and the overnight lending rate was held at 9.75 per cent, the bank said in a statement. \n\n(gulftoday)", "source": "Egypt Commercial News"}