{"published": "2015-09-28T18:56:34Z", "media-type": "News", "title": "Jose Mourinho: No Chelsea player is untouchable", "id": "5de7a214-1c77-4ae3-a797-a03f3df6860d", "content": "Jose Mourinho has told his Chelsea players they are far from untouchable as he prepared to unleash Diego Costa on his former club Porto. \n\nThe Blues boss memorably described the nucleus of his first Chelsea side as permanent names on the team-sheet, but believes his underperforming players are short of that status this term. \n\n\"Untouchables in football, only consistency can give you that status,\" said Mourinho, whose champions are 15th in the Premier League after two wins in the opening seven games. \n \n\"In this moment we have fantastic players, the players that gave us the title last season. \n \n\"But football is about today, it's not about yesterday. In football you have to be consistent in your performance, in your emotion. \n \n\"To be a winner you don't need to win all the time, but to be a winner you must have a strong mentality every game, every day. At this moment I don't have untouchables.\" \n \nMourinho had a strong core to his Premier League and Capital One Cup-winning side last term, which included Costa. \n \nThe striker is two matches into a three-match domestic suspension, but is available for Tuesday night's Champions League Group G clash at Estadio do Dragao. \n \nMourinho lauded Costa's performance in the win over Arsenal, when the Brazil-born Spain striker was a nuisance and retrospectively banned for grappling with Laurent Koscielny. \n \nAsked if he would like 11 players to show the same desire of Costa after Chelsea's stuttering start, Mourinho could not resist a dig at the Football Association for the ban. \n \n\"I think we would lose every game, because the desire to suspend him is so big that we wouldn't have players to start the game,\" Mourinho said. \n   Promoted stories   \n\"I'm happy to have only one and let him play until they decide to suspend him again.\" \n \nMidfield playmaker Cesc Fabregas, who enjoyed a fruitful partnership with Costa last term, believes it was wrong for the striker to be banned. \n \n\"He's frustrated, obviously, and rightly so. It's very unfair what's happened to him,\" Fabregas said. \n \nChelsea's core players have so far struggled to hit the heights of last term and former Arsenal and Barcelona midfielder Fabregas says more is required - and not just when Mourinho demands it, as the manager did at half-time of Saturday's abject draw at Newcastle. \n \n\"We're not babies. It has to come from us,\" Fabregas added. \n \n\"We have to perform because we are winners and because we play for Chelsea. \n \n\"Not because the manager has to come to us and be upset and then yes, we perform, like what happened on Saturday at Newcastle. \n \n\"Maybe things are not going the way we want at the moment, but I'm sure we'll turn it around. \n \n\"We won the league last year, there's no reason why we shouldn't do it again this year. We have to start performing from now.\" \n \nMourinho will attempt to put sentiment to one side against Porto, whom he guided to the 2003 UEFA Cup and the 2004 Champions League titles. \n \nIt is not his first return - he made an immediate Champions League return in the 2004-05 season with Chelsea - but he is honoured to feature in the Portuguese club's museum. \n \nMourinho visited the museum prior to undertaking his media duties on the eve of the match, reminding him of his affinity to the club. \n \n\"When you are lucky to be part of it, when you are not just a simple visitor, you are somebody that did something that deserve to be part of that museum, it's very emotional,\" the 52-year-old added. \n \n\"You realise that you did something important, something time will not delete. \n \n\"It's the kind of visit that makes my heart a bit softer and I have now to go to the hotel and make it hard again, because tomorrow I have a big game.\" \n \nThere are numerous sub-plots in the encounter, not least the one which sees Mourinho face Iker Casillas, the goalkeeper with whom he had a rotten relationship at Real Madrid. \n   \n Share article  \n   \nMourinho interrupted the first question on the subject. \n \n\"If you're going to ask me about Casillas, I'm going to greet him at the beginning and the end. No more questions about it,\" he said.", "source": "Northern Echo"}