{"published": "2015-09-22T20:11:33Z", "media-type": "News", "title": "Armenian Central Bank leaves refinancing rate at 10.25%", "id": "e9fb1f9d-017f-46d5-88e6-3950524f736b", "content": "by\nGayane Isahakyan \n  Tuesday, September 22, 20:08   \nThe\nCentral Bank of Armenia has left the refinancing rate unchanged -  10.25%, the press- office of the Central\nBank told ArmInfo on September 22. \n \nAccording\nto the source, the CB's rate on Lombard REPOs and the deposit rate were left\nunchanged too  -  11.75% and 8.75%, respectively. \n \nAccording\nto the Central Bank, inflation in the consumer market of Armenia totaled 0.1%\nin August (versus 0.7% in Aug 2014). Eventually, the inflation slackened to 3.6\nas of late August.  There is still slow\nupward trend in the global economy and deflation in the international commodity\nmarkets.  In this light, the Armenian\nCentral Bank Council anticipates no influence on inflation from the external\nsector within the coming months. \n \nAccording\nto the Central Bank, in Q2 the economic activity rate was higher than\nanticipated due to supply factors. The stimulating fiscal policy helped\ncertainly restore the domestic demand and partially neutralize deflation\nenvironment. As volatility grows in the world financial and foreign exchange\nmarkets, inflation expectations are relatively high. In this light, the CB\nconsiders it unreasonable to maintain the fiscal terms.  Due to it, by the end of the year, the\n12-month inflation will decrease to the minimum permissible limit.  Such fiscal policy will allow not only\nreducing the inflation expectations, but also suspending them within the near\nfuture to achieve the mid-term target. \n \nTo recall, on Augu 11, the Central Bank of Armenia\nreduced the refinancing rate by 0.25pp from 10.5% to 10.25% at its August 11\nmeeting, the press- office of the Central Bank told ArmInfo.  According to the source, the CB's rate on\nLombard REPOs was reduced from 14.5% to 11.75%, while the deposit rate was\nreduced from 9% to 8.75%.  At the June\n24 session, the Board of the Central Bank of Armenia took a decision to retain\nthe refinancing rate at 10.5%.  On Feb\n10, 2015, the CB raised the refinancing rate from 9.5% to 10.5%, at the same\ntime reducing the lombard repo rate from 17% to 14.5% and raising the deposit\nrate from 5.25% to 9%. At the March 24 session, the Board of the Central Bank\nof Armenia (CBA) took a decision to retain the refinancing rate at 10.5% and to\nreduce the lombard repo rate from 13.5% to 12%.  Previously, on March 12, the CB reduced the lombard repo rate by\none pct point from 14.5% to 13.5%. Earlier, the refinancing rate was raised on\n22 Jan 2015 - from 8.5% to 9.5%. On 23 Dec 2014, it was increased from 6.75% to\n8.5%. On 3 Dec 2014, the CBA raised the lombard repo rate from 10.25% to 21%,\non Dec 23 it reduced the rate to 20%, and on Jan 22, 2015, the rate was\ndecreased to 17%.", "source": "ARM Info"}