{"published": "2015-09-12T07:14:26Z", "media-type": "News", "title": "For Syrian refugees in Italy, Israel remains enemy #1", "id": "b663ac2c-b9eb-4b43-ac22-942e0b1dc487", "content": "MILAN — At a migrant reception center near Milan’s central train station, two-year-old Mahmoud sleeps on a pillow in a pair of patched-up grey pajamas, exhausted after fleeing Damascus a month ago with his parents and relatives. \n\nTheir nightmarish journey across the Mediterranean Sea from Libya was marred by beatings, starvation and dehydration, and the fear of drowning in rough waters. Yet despite the cruelty at the hands of Libyan smugglers, despite the suffering that was inflicted upon them by their own government that forced them to flee for their lives, Mahmoud’s family and other Syrian refugees I met still view Israel as their real enemy.\r \r \n \n“First of all I respect all religions, including Judaism… In Syria we have all races and religions living together, we are all brothers… but Israel, Israel is the ultimate enemy, that’s what we’ve been told since we were kids,” said baby Mahmud’s cousin Adman, 21, who studied tourism in Syria. “But I want to stress something: Jews are not my enemy. Zionists are my enemy.” \n \nAdman was surprised that he was being interviewed by a Jewish reporter, and, more so, for an Israeli newspaper. \n \nHe jumped. \n \n“Wow, I’m almost shaking. I’ve never met a Jew before,” he said and paused. “Why would an Israeli paper be interested in stories about Syrian refugees,” he asked. \n \nTwo-year-old Mahmoud sleeps on a pillow in a Milan shelter after fleeing Damascus a month ago with his parents and relatives. (Rossella Tercatin/The Times of Israel) \n \nHe was amazed after I told him about the current debates in Israel concerning the absorption of refugees from Syria, and how the Israeli military was treating wounded Syrians in makeshift field hospitals near the border. \n \nDespite his surprise and interest, he still warned me not tell the other refugees that I was Jewish. “Some of them could react badly,” he said. \n \nSitting with her parents and brother, Mais, 21, is another refugee from Syria whose family also harbors strong resentment towards Israel. \n \n‘Israel is a colonial power, that’s it. They stole the Palestinian’s land’ \n \n“Israel is a colonial power, that’s it. They stole the Palestinians’ land,” her mother Inaia was quick to respond when asked her thoughts on the subject. \n \nBeneath her bright purple headscarf, Mais smiles sweetly, looking a bit tired, but relieved that the horrific journey from Syria was behind her. \n \n“Our house was bombarded three times and the road my brother and I used to take to go to university does not exist any more,” she said. “There was no future in Syria.” \n \nMais’s family tried fleeing to Egypt two years ago but without success. \n \n“We wanted to be in a fellow Arab country, we felt it was important. But they treated us extremely badly,” explained her father Imad, who worked in olive production back home in Idlib. “We could not work, we could not do anything.” \n Lending a helping hand  \nAs the night goes on, many refugees leave for designated shelters. Each are provided with a bright orange cloth bag of toiletries and other basic goods from donors and organizations. \n \nTwenty-eight-year-old Rima works for one of those organizations — Arca, the Italian NGO, which was chosen by Milan’s municipality to run the migrant registration facility. Since 2013, Arca has registered and assisted about 87,000 migrants, most of them Syrians and Eritreans. \n \nTwenty-eight-year-old Rima registers an Eritrean migrant. Rima works for Arca, the Italian NGO which was chosen by Milan’s municipality to run the migrant registration facility. (Rossella Tercatin/The Times of Israel) \n \nRima moved to Italy from Syria in 2004 with her family but moved back to Syria in 2009 because of the economic crisis. With the start of the Syrian civil war, they moved yet again to Italy. \n \nRima is a veteran at the center. She registers the migrants, jokes with them, listens to their requests, translates, talks on the phone and organizes their accommodations for the night in one of the several shelters set up in the city. \n \n“Since the beginning of the war I have lost an uncle, some cousins, a baby nephew. This is why working in this center for me is so important,” she said. “It’s the one thing I can do for my people. Everyone here could be my family. Their pain is my pain.” \n \n‘For Syrians, Israel is Palestinian territory. Palestinians are our relatives, our friends, our neighbors’ \n \nWhen she finds out that I am interested in understanding what Syrians think about Israel, she hesitates but is willing to engage. \n \n“For Syrians, Israel is Palestinian territory,” she explained. “Palestinians are our relatives, our friends, our neighbors, because a lot of them flee to Syria. My paternal grandmother is Palestinian, she left Haifa in 1948, when she was 10.” \n \nBut, she insisted that she isn’t in any way against Jews. \n \n“It’s written in the Quran, we must respect Jews,” she said. \n \nAsked about her perspective on the war in Syria, she says that the war will end when Russia and Iran will stop giving arms to the regime, and America will decide that they have had enough. \n Acknowledging the Holocaust  \nOnly a few hundred feet away from the shelter providing temporary refuge for the migrants is Milan’s Holocaust Memorial. So, it is only natural for the Holocaust to come up in conversation. \n \n“I know about the Holocaust and when I was in Italy I always took part in the ceremonies for [Holocaust] Memorial Day at school. It was terrible,” said Rima. “In Syria, we don’t study it in the same way, it’s only a couple of lines of the textbooks. That is why I wanted to find out more about it, and I saw some movies on the topic, like ‘The Pianist.'” \n \nHowever, when asked if she would be willing to read or explore different perspectives on Middle East issues and the Israeli-Palestinian conflict, she simply said, “Not really, I don’t read too much.” \n \nA similar reaction arose when I brought up the possibility of a two-state solution for Israelis and Palestinians. \n \n“I don’t think that Jews should have a state. They are a religion, not a people,” Rima explained. “They can be Syrian Jews, German Jews, Italian Jews. But I don’t think a Jewish state has any reason to exist.” \n \nMoroccan immigrant Adil Khabi has lived in Italy for the past 13 years. Today he volunteers at Milan’s Holocaust Memorial where he is pictured on June 22, 2015 against its Wall of Indifference, to help with the African refugees sheltered there. (Rossella Tercatin/The Times of Israel)", "source": "The Times Of Israel"}