{"published": "2015-09-11T20:10:36Z", "media-type": "News", "title": "Rep. Liberati pleased with deal for MSP to investigate Courser, Gamrat", "id": "a3fd28b8-c385-4226-8db4-33759dd66da0", "content": "After a long stalemate in the House of Representatives, Rep. Frank Liberati (D-Allen Park) is pleased there will now be a full investigation of whether Rep. Todd Courser (R-Lapeer) and Cindy Gamrat (R-Plainwell) misused state funds.Both representatives in question have also lost their positions. Courser ultimately resigned and the House achieved a two-thirds majority vote to expel Gamrat. It is alleged the two had an affair along with other misconduct.Liberati was among , leading to a stalemate, in hopes of forcing more investigation.It was a long night in the House, as a first session Thursday, Sept. 10, went all the way to midnight and a second session opened and went until about 4:30 a.m. Friday, Sept. 11.Courser decided to turn in his immediate resignation at about 3:30 a.m.Before the House voted to expel Gamrat, Liberati said Democrats made a deal with Republicans for there to be a full, independent investigation by Michigan State Police on the misuse of state resources. He said that is what made all the difference in how the vote went compared to the stalemate in the vote on Courser.“It’s what we were hoping for all along,” Liberati said.If the MSP determine funds were misused, he said he wants the state to be able to recover any lost funds, regardless of how much it might be.This has been the central point on this issue, Liberati said, the question of whether state funds were misused. He said it was about Courser and Gamrat’s actions, and about how their actions affected the House. The question of whether or not they were fit to remain in office was pretty obvious after looking at all the information, he said.Gov. Rick Snyder released a statement in support of the requested MSP investigation.“I support the Michigan State Police in opening an investigation into any criminal activity by state Reps. Courser and Gamrat as requested by the Legislature in House Resolutions 141 and 145,” the governor said. “This matter needs to be resolved and an investigation by MSP will provide even further clarity.“I hope this investigation helps bring closure to the issue for all involved.\"Liberati, Rep. John Chirkun (D-Roseville) and four Republicans were appointed to the select committee directed to make a recommendation on whether or not to remove Courser and Gamrat from office.Earlier Sept. 10, the select committee voted 4-0 to recommend expelling Courser and Gamrat, with Chirkun and Liberati abstaining.Liberati said he abstained then for the same reason, because he feels there is still important information to come. In particular, he had central to the whole issue.“All in all, it worked out,” Liberati said. “Now we can get along to more important matters.”A resolution for MSP to do an independent investigation was introduced earlier in the week by Rep. Sam Singh, House Democratic floor leader. He also made a motion during the Sept. 10 session to refer the question back to the select committee, although this motion failed.", "source": "Heritage News-Herald"}