{"published": "2015-09-30T13:30:00Z", "media-type": "News", "title": "Interaxon Establishes Advisory Board and Appoints Patrick J. Kennedy and Amy Kennedy", "id": "5ae10593-e83e-43e5-a528-5ee65629d3e3", "content": "Interaxon, Toronto-based brain health technology company and creator of \n      Muse, a sensory headband that makes meditation easy, today announced the \n      establishment of the Interaxon Advisory Board and the appointment of \n      former U.S. Representative Patrick J. Kennedy and his wife, Amy Kennedy \n      as board members. \n\nThe Interaxon Advisory Board will augment the Interaxon executive team \n      and provide leadership, guidance and expertise on trends and issues \n      within the brain health and technology industries. It will also act as a \n      leading voice for the company's interaction with the research, clinical, \n      wellness and performance communities and assist in evaluating new \n      product developments. \n   \n“We are building our robust Interaxon Advisory Board of experienced \n      professionals to help guide the growth of our company as we continue to \n      improve people’s lives through wearable brain sensing technology,” says \n      Ariel Garten, co-founder and CEO of Interaxon. “We are thrilled to be \n      joined by Patrick J. Kennedy and Amy Kennedy, two experienced \n      professionals and strong voices in mental health and wellness advocacy, \n      who will be valuable as we continue our rapid growth.” \n\nAs founding members, Patrick J. Kennedy and Amy Kennedy bring a passion \n      for mental health and wellness to the Interaxon Wellness Advisory Board. \n      Patrick J. Kennedy is a pioneer in mental health policy and advocacy. He \n      served Rhode Island’s First Congressional District for 16 years and \n      developed two innovative organizations: One Mind for Research and The \n      Kennedy Forum on Community Mental Health. Amy Kennedy, education \n      director for The Kennedy Forum on Community Mental Health, is an \n      activist for mental health education and leads the organization’s \n      objective to improve brain fitness and resilience. \n\n“I am pleased to be joining forces with Interaxon and partnering on \n      important advancements in brain health and wellness, a topic that is \n      near and dear to me,” said Patrick J. Kennedy. “Amy and I strongly \n      support the Interaxon mission to enable people to live happier, \n      healthier lives and we are looking forward to the benefits of this \n      relationship and the positive impact for the mental health and wellness \n      as well.” \n\nAbout InteraXon \n\nAt Interaxon, we develop engaging experiences using brainwave-sensing \n      technology that frees you from physical, emotional and mental obstacles \n      so you get more out of every moment. Our mission is to enable you to \n      live a happier, healthier and more connected life with leading brainwave \n      technologies and experiences. Our flagship product is the Muse headband, \n      a sensory headband that makes meditation easy and provides real-time \n      audio and visual feedback on your the meditative state through the Muse \n      companion app. More information about Muse is available at  www.choosemuse.com . \n\n\n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150930005564/en/", "source": "CEOWorld Magazine"}