{"published": "2015-09-03T16:56:38Z", "media-type": "Blog", "title": "25 Fascinating Photos Collected From History", "id": "e4304e4e-a09f-4053-acb4-f1042e5f132e", "content": "Salvador “I don’t do drugs I am drugs” Dalí painting The Face of War, 1941  \n\n \n  \n Portrait of three newsboys smoking outside Skeeter’s Branch, at Jefferson near Franklin Avenue at 11 in the morning, St. Louis, MO, May 9, 1910.  \n\n \n\n \n  \n Princess Diana shakes hands with an AIDS patient without gloves, a profound gesture that made her a gay hero. “It is hard to find words to express the aching loneliness and rejection I have found them experiencing as they approach the end of their lives…How will we treat them?”  \n\n \n  \n Hitler hated this photo and felt his knees were too knobby and his legs hairless and pale, and ordered the photo and negatives destroyed.  \n\n \n  \n Dr. Oilver Sacks, neurobiologist and author of “The Man Who Mistook His Wife For a Hat”, does a full squat with 600 pounds, setting a state record back in 1961.  \n\n \n  \n Franz Reichelt attempts a Base Jump from the Eiffel Tower and falls to his death 1912 ( video )  \n\n \n  \n A “Bathing Machine”. If people were shy about walking from the changing room down to the beach in these (very revealing) bathing suits, you could get in a bathing machine which would be winched down into the ocean, from which you could then exit into the water.  \n\n \n  \n Mary Hemingway with some more of Ernest’s 23 cats.  \n\n \n  \n “Momma Ruth,” a seamstress who makes robes for the Ku Klux Klan in the process of taking an robe order for an Imperial Wizard (an officer within the KKK).  \n\n \n  \n Brigitte Bardot in a pub in London (1968), snapped by a paparazzo.  \n\n \n  \n Synthetic Street in Seattle, Washington. An entire fake street and park built to camouflage an underground B-17 factory during WWII.  \n\n \n  \n German guns pounding Dover, WWII.  \n\n \n  \n Harvey Ball, creator of the Smiley Face  \n\n \n  \n WWI: A German member of a “Trench Attack Squad” poses in steel body armor and two stick grenades. The armor, capable of stopping a pistol round but only superficially helpful against rifle fire, also helped protecting against bayonet and other edged weapons thrusts. The additional weight though fatigued the wearer quickly and defeated any tactical advantage he might have wearing it.  \n\n \n  \n A police officer on a Harley-Davidson transports a prisoner in a mobile holding cell (1921)  \n\n \n  \n A 1890’s telephone tower  \n\n \n  \n Housewife Barbara Dunlap under the effects of LSD. She is a volunteer in a psychiatric research study regarding the effect of LSD conducted by the International Federation for Internal Freedom, Cambridge, Massachusetts, February 1963.  \n\n \n  \n Musician Kurt Cobain with poet William Burroughs, 1993  \n\n \n  \n Marilyn Monroe wearing the (sheer, tight, skin-color) dress that made the audience gasp when she sang “Happy Birthday, Mr. President”. It was so tight fitting, that she reportedly wore nothing underneath. May 19, 1962  \n\n \n  \n The Mona Lisa is stolen from the Louvre in Paris by museum worker Vincenzo Peruggia who hid in a broom closet and walked out with it hidden under his coat. August 1911  \n\n \n\n \n  \n Behind the scenes of 2001: A Space Odyssey (1968)  \n\n \n  \n The1958 Hong Kong Cha-Cha Champion: Bruce Lee  \n\n \n  \n Osama Bin Laden and his judo masters  \n\n \n  \n The early Micky Mouse drawing by Walt Disney  \n\n \n  \n The Beatles’ last concert 1969 ( video )  \n\n \nThe post 25 Fascinating Photos Collected From History appeared first on Caveman Circus .", "source": "Caveman Circus"}