{"published": "2015-09-21T14:16:09Z", "media-type": "News", "title": "Huntington Ingalls' shipbuilding diversification won't stop layoffs, but 'smooths' revenue", "id": "68eed632-d191-4b92-be4c-d6e4feba8c1c", "content": "Navy gray is still the dominant shade at Huntington Ingalls Industries, but that hasn't stopped the shipbuilding giant from adding a bit more color to its portfolio. \n\nSince early 2014, the company has made forays into the energy and petroleum industries in hopes of bettering its bottom line. It hasn't stopped layoffs at its Newport News Shipbuilding division, but that was never the expectation. The revenue from acquiring smaller companies can't match money that pours in from billion-dollar Navy contracts. \n\nAnalysts say the moves, which have produced mixed results, should eventually smooth the flow of revenue at the nation's largest military shipbuilder. In recent conference calls with analysts, company executives have used the term \"lumpy\" to describe the workflow going forward. \n\n\"What diversifying gets a company like Huntington Ingalls is a smoothing out of revenues and returns over time,\" said Loren Thompson, CEO of the Lexington Institute, a public policy think tank in Arlington. \"To the extent that the defense and energy business is cyclical, the cycles do not coincide. You get kind of a leveling effect.\" \n\nAt first blush, diversifying might seem like a tall order for Huntington Ingalls. Its Newport News shipyard is highly specialized, the only builder of nuclear-powered aircraft carriers and one of two yards that builds nuclear-powered submarines. Its Ingalls Shipbuilding division in Mississippi manufactures amphibious warships and destroyers for the Navy, as well as Coast Guard cutters. \n\nBut the experience in building large, floating cities and handling nuclear fuel can be exported. \n\n\"The skill sets they bring to that, which are really large, complex program-management skills, and a lot of knowledge about nuclear, those should be portable skills,\" said Byron Callan, an analyst at Capital Alpha Partners. \n \nNot only will it smooth out the revenue picture, it may help ease the uncertainty that comes from depending on Congress to pass a defense budget on time. \n\nThe Newport News shipyard announced 480 layoffs last week and could cut 1,000 jobs next year before hiring again in 2017. The \"workload valley,\" as Newport News Shipbuilding President Matt Mulherin calls it, is partly due to an aircraft carrier refueling project delayed by congressional inaction. \n\nThat's not just bad news for the 22,000 people who work at the yard, but for the region and state. Newport News Shipbuilding is Virginia's largest industrial employer. \n\n\"If you have the flexibility to move your engineers from defense work to commercial and back again, that ultimately should be a good thing,\" Callan said. \n\nThe purchases \n\nIn January 2014, HII acquired Colorado-based S.M. Stoller, a company that manages cleanup sites containing radioactive waste — in some cases doing the actual cleanup — and also performs environmental monitoring. Huntington Ingalls has since created Stoller Newport News Nuclear, which combined Stoller with an existing HII subsidiary. \n\nIn June, HII purchased UniversalPegasus International, a Texas-based energy firm that provides engineering and management services to the oil and gas markets. \n\nUPI has become a financial drag on HII due to the plummeting price of oil. UPI recorded an operating loss of $64 million for the 2015 second quarter. That came on top of a $47 million write-off in the fourth quarter of 2014. HII has now written off almost half the price it paid for the business. \n\nStill, Thompson said the move should pay off in the long run. The petroleum business is a roller-coaster that will eventually climb again. \n \n\"A year from now, Huntington Ingalls' diversification efforts are going to look a lot better than they do now,\" Thompson predicted. \"They're really just trying to take the skills they have and use them more broadly.\" \n\n\"The timing of this in hindsight was unfortunate,\" said Callan. \"But Huntington Ingalls was not the only company to get surprised by the bottom dropping out of oil prices. I think, unfortunately, they were caught off guard by circumstances they could not control.\" \n\nPetters has faced questions about the purchase of UPI, but moving into something other than energy would have been worse. \n\n\"If Petters had gotten up and said, 'we're going to get into the retail clothing business . . . or we're going to run an airline, I think everybody would have said, 'you're out of your mind,'\" Callan said. \n\nShipbuilding comes first \n\nAt Huntington Ingalls, Chris Kastner is responsible for strategy and development as well as the analysis and entrance into new markets. \n\n\"The first thing you have to remember is that we are a shipbuilder,\" he said. \"The majority of our investments are always going to be to improve the efficiency of our ships.\" \n\nBut going back to the idea of portable skills, Kastner said the company can sell its experience in fabricating large structures, managing complex, big-budget projects and handling nuclear materials. \n\nThe marriage with Stoller made sense because of HII's nuclear expertise, Kastner said. It complemented Stoller's experience in cleanup and monitoring radioactive waste sites. \n\nThey also saw commonalities with UPI. \n\n\"When we thought how to enter the oil and gas market, it made sense to enter through engineering,\" he said. \"We understand engineering. It's a lower risk type of thing. We weren't going to buy a big, old construction company that took firm, fixed-price contracts. We started a review of companies, and we found UPI.'\" \n\nThe challenge \n\nUPI was formed in 2008 from four companies. Its logo depicts portions of four globes coming together. UPI President Philip Luna said the fit with HII was \"very comfortable from a cultural standpoint\" as well as a technical one. \n\nUPI is an engineering and construction management company that serves the upstream and mid-stream markets in oil and gas. Upstream is everything from the well head to the first processing point. Mid-stream is from that first processing point to a refinery or chemical plant. The company has onshore and offshore business. \n\nBut right now, the petroleum industry roller-coaster is headed down. \n\nThe company is down \"thirty to forty percent, total head count,\" Luna said. \"That's been across each of our offices, each of our skill sets.\" \n\nLuna said he is happy that UPI is part of a larger company that has a long-term strategy. Before joining HII, customers would ask to see UPI's financial information or request letters of credit during the bid process. \n\n\"Today we're able to do that same work with parent company guarantees, or customers just know we're part of Huntington Ingalls,\" he said. \"That has opened up a lot of doors for us.\" \n  \nThe technical skill that HII brings to Luna's operation is invaluable, he said. \n\n\"From an understanding of our business, Huntington Ingalls designs and builds the most complex things in the world,\" he said. \"If you go through an aircraft carrier, you see, at the foundation, a fantastic engineering job.\" \n\nLuna said he was also comfortable with HII's company culture. Analysts can't put a dollar amount on comfort level, but they say it matters — especially in hard times. Callan has watched closely as HII has cut jobs at UPI. He hasn't heard that people are leaving because HII is \"ham-handed in the way they're dealing with it.\" \n\n\"Personally, I would be a lot more critical of this if I heard of those sorts of conflicts,\" he said. \n\nWork on the horizon \n\nNick Lombardo, president of Stoller Newport News Nuclear, cited the same cultural comfort with HII. In his case, it came from previous experience. \n \nStoller and HII were partners in seeking Department of Energy contracts. They didn't win the work, but established a comfort level that led to the acquisition. Stoller's staff included geologists, chemists, chemical engineers and other specialists. HII had nuclear engineers that worked with the Navy. \n\n\"The benchmark, or gold standard, in the nuclear arena is the Navy nuclear program,\" Lombardo said. \"If you think about it, the Navy runs nuclear reactors on many ships and boats in an amazingly safe and successful fashion. Whereas the commercial nuclear industry, as we all know, struggles with the image they have and some of the problems they have.\" \n\nLombardo said the marriage with HII has not yet paid big dividends, but that could change. The government work Stoller seeks goes in cycles. \n\n\"What we're seeing is a tidal wave of procurements coming in our direction,\" he said. \"There are always procurements out there. But over the next five years, there is something like sixty to seventy billion dollars in Department of Energy procurements.\" \n\nThe company has already formed \"capture teams\" to target specific work, he said. \n\nLessig can be reached by phone at 757-247-7821 . \n Copyright © 2015, Daily Press", "source": "Hampton Roads Daily Press"}