{"published": "2015-09-10T05:39:45Z", "media-type": "News", "title": "Attempted kidnapping in Sedge", "id": "fce4b9c0-c9c6-4738-8466-7a70842c5209", "content": "Generic image. \n  \nSEDGEFIELD NEWS - Many residents of the picturesque village of Sedgefield, believe that they are losing the battle against crime after Christiaan Opperman reported that his toddler of one year and nine months was nearly pulled through an open window of their Sedgefield home on Monday, September 7. \n\n\"A black man tried to pull my daughter through our window this afternoon,\" wrote Opperman on Sedgefield Locals Facebook page. Opperman told the Knysna-Plett Herald that he was \"in a ceiling\" working when his fiancée tried to contact him with the horrific news of their daughter's near kidnapping. \n\n\"I am so angry that I wasn't there. When I got to my phone there were so many messages from my fiancée saying that she heard our older child scream and when she got to the lounge she saw the black man's hands holding onto our toddlers arms. He was busy pulling her through the window.\" \n\nHe explained that he had not immediately called the police as he doesn't have much faith in their ability. \"To tell you the truth I don't want them on my property. I did however immediately call Mike Hofhuis of COP [Sedgefield's Community Orientated Policing]. He and all the vehicles arrived shortly after my call and they started looking for the man.\" \n\nHofhuis confirmed that they had rushed to the scene. \"Unfortunately, nobody fitting the description could be found anywhere in the area despite having five cars and several members searching,\" he said. He added that they eventually called off the search. \n\n\"Unfortunately, there was not enough description given to us by the mother, except that the male involved smelt of alcohol and was wearing a white cap and black top and had facial hair.\" \n\nOpperman said that he understood completely why his fiancée could not provide a better description of the suspect. \n\n\"The shock of what she saw made her only concentrate on the safety of the children. She was cooking when she heard the scream and then she saw our daughter's arms being pulled through the lounge window. Seeing her nearly kidnapped made her scream at the man and rush for the pepper spray. There was no time to study the face of the man,\" said Opperman. \n\nAccording to him a neighbour had seen the suspect wander onto Opperman's property and had driven slowly to keep an eye on him. Sadly the suspect fled without being seen. \n\n\"Thank God we taught our children not to speak to strangers and to scream loudly if they are touched by anybody they don't know,\" Opperman explained. It was obvious that he did not want to dwell on what might have happened if his elder child had not screamed. \n\nHofhuis said that COP is of the opinion that the suspect was probably a local who was under the influence and had wandered onto the residents property. \"We often have complaints of individuals under the influence wandering onto unsecured properties and causing problems.\" \n\nOpperman said that he had posted details of the incident on the Facebook page to alert the community. \"I wanted people to hear what had happened to us. If somebody had experienced a similar incident they could contact us and together we could possibly provide a better description of the man. \n\n\"Also, I would hate for this to happen to anybody else, so it was important to warn the community of the dangers right on our doorstep. Hopefully we can stand together as a community and stop the increase in crime in our area. I want this to act as a wake-up call to all,\" explained Opperman. \n\nIn closing he said that although he did not trust the police he felt it was best to report the incident. \"I understand that it is necessary to report the matter and will be doing this later today [Tuesday, September 8]. Hopefully, the more people report crime in Sedgefield the sooner those in power will help us fight it.\" \n\nAt time of going to print, Knysna Police liaison, Sergeant Chris Spies said: \"The Knysna Police is aware of this alleged incident.\" \n\nARTICLE: FRAN KIRSTEN, KNYSNA-PLETT HERALD - CORRESPONDENT       \n\n'We bring you the latest Sedgefield, Garden Route news'", "source": "Knysna-Plett Herald"}