{"published": "2015-09-20T23:43:14Z", "media-type": "News", "title": "Heavy drinking before wombats killed: witness", "id": "dd4a7e8f-c8cc-4b92-abd4-de35c302950e", "content": "NSW: Camper who saw 10 wombats run over says he watched drunk man kill animals deliberately. \n\nA long-term visitor to Bendeela has given a shocking eye-witness account of the slaughter of wombats over the weekend.\n\nMatthew Thorn, from Waterfall, has been camping at Bendeela with his family for 15 years and said he had never seen anything like it before. \n\n“We came in Saturday afternoon and saw the remains of a number of wombats along the road,” he said.\n\n“They were in various states and Sydney Water Authority staff were picking them up at the time. The staff said they had trouble here Friday night and guys in a white four-wheel-drive had come here and run over the wombats.\n\n“Saturday night we went to bed and about 11pm. I heard screaming and a car being driven very loudly.\n\n“I heard a man screaming stop, he was trying to get the keys off the driver to stop them from driving. \n\n“They had all been drinking very heavily and I heard the car take off up the road. \n\n“I watched through the window of the tent and I saw a male driving a car off the road onto the grass where the campers were. I saw the headlights of the car change direction dramatically in which he did a doughnut and collided with the tree. \n\n“He continued back down the road and I heard the thump when he hit a wombat. \n\n“We’ve been coming here about 15 years and have never seen anything like this before. The wombats are quiet and come right up to the campsites. It’s very distressing to see people do that.\n\n“I was concerned for my safety, my family’s safety and everybody else’s safety. It was very confronting,” he said.\n\nPolice are now investigating the deaths of 13 wombats.\n\nOn Friday night eight wombats were killed with campers waking to find their bodies scattered around the popular family camping site.\n\nAnother body was found three kilometres away on Jacks Corner Road on the lawn outside the Kangaroo Valley Pumping and Power Station.\n\nOn Sunday morning a further two dead wombats carrying joeys were found dead on the campsite lawn.\n\nSecurity personnel were on site performing vehicle checks on Sunday which is normal protocol for the holiday period.\n\nPolice are being supported by NSW National Parks and Wildlife Service and Sydney Water Authority in their investigation.\n\nSouth Coast Register, NSW", "source": "Coly Point Observer"}