{"published": "2015-09-03T02:01:41Z", "media-type": "Blog", "title": "Yet another new Keysight power product family - this time, compact bench-top DC power!", "id": "d05b15e8-1099-487e-9bea-99dfa8f6d9ba", "content": "Last week, I posted about our new photovoltaic (PV) array simulators, models N8737APV and N8757APV. These power supplies can produce an I-V curve as their output characteristic and provide up to 15 kW, 1500 V, and 30 A. Today, I am posting about yet another new series of Keysight power products (wow, our R&D team has been busy!). This new family is at the opposite end of the power spectrum compared to the 15 kW PV array simulators. The new family consists of five models in the 30 to 40 W range with voltages up to 100 V and currents up to 5 A all providing a standard rectangular output characteristic. Click here for the press release that just went out yesterday!\nI really like this new family of power supplies and I think you will too!\nWhy?\nBecause….\nYou can choose from a variety of voltage and current combinations to meet your needs.\nYou can save space on your bench with these very compact models that are only 2U high and ¼-rack-width wide.\nYou can set and read back very accurate voltage and current values with a basic accuracy of 0.05%.\nYou can view the high visibility OLED display from nearly any angle.\nYou can regulate your set voltage at your load to make up for voltage drop in your load leads with remote sense terminals and leads.\nYou can communicate with these power supplies with either LAN or USB since both interfaces are included.\nYou can protect your device under test with the built in overvoltage protection and overcurrent protection.\nAnd you can easily access all of the other beneficial features in this tiny package with the on-screen menu system.\nSo you can see that there is a lot you can do with these compact power packages!\nHere is a listing of the models:\nBelow is a picture of the family showing each of the five new models. So the next time you have to equip your bench with DC power that goes beyond a basic power supply, consider the new E36100 Series Programmable DC Power Supplies from Keysight Technologies. I know I would (but then again…..look where I work…..)!", "source": "Watt's Up?"}