{"published": "2015-09-30T15:53:00Z", "media-type": "News", "title": "New Urban Land Institute Semi-Annual Forecast For Real Estate Market Less Bullish, But Still Foresees Continued Economic Expansion Through 2017", "id": "b57a7dd9-c4c0-4251-825b-87bfed4194c3", "content": "WASHINGTON , Sept. 30, 2015 /PRNewswire-USNewswire/ -- The real estate market is projected to continue expanding at healthy and fairly steady levels for 2015 through 2017, according to a new three-year economic forecast from the Urban Land Institute (ULI) Center for Capital Markets and Real Estate. The latest ULI Real Estate Consensus Forecast, a semi-annual outlook, is based on a survey of 49 of the industry's top economists and analysts representing 36 of the country's leading real estate investment, advisory, and research firms and organizations. \n\nCompared to the previous forecast conducted in April 2015 , the new Consensus Forecast is slightly less bullish on its outlook; however, it predicts three more years of favorable real estate conditions. The new survey forecasts real estate indicators to be better than their 20-year averages in 2015, with the exception of four indicators expected to be worse: the Consensus Forecast respondents predict that commercial property price growth, equity REIT returns, NCREIF returns for the four major property types, retail availability rates, and single-family housing starts will be worse than their 20-year averages. \n   \n\"The latest Consensus Forecast has picked up on recent growth concerns and stock market corrections around the world,\" said ULI leader and survey participant William Maher , director of North American strategy for LaSalle Investment Management in Baltimore . \"The US economy and real estate markets are in much better shape than most other countries, but global economies and capital markets are increasingly inter-related. Still, the vast majority of indicators in the forecast indicate favorable economic and capital markets in the U.S., as well as moderately strong real estate fundamentals and investment returns.\" \n\nOther key findings of the Consensus Forecast include: \nCommercial property transaction volume is expected to increase for another two years and then level off at a robust $500 billion by 2017. Commercial real estate prices are projected to rise by 10.0 percent in 2015 and to slow to a 6.0% percent increase in 2016. Price growth is expected to drop to 4.5 percent in 2017, below the long-term average growth rate. Institutional real estate assets are expected to provide total returns of 11.7 percent in 2015, moderating to 9.0 percent in 2016 and 7.0 percent in 2017. By property type, returns are expected to be strongest for industrial and retail, followed by office and apartments, in all three years. Vacancy rates are expected to continue to decrease modestly for office and retail over all three forecast years. Industrial availability rates and hotel occupancy rate are forecasted to improve modestly in 2015 and essentially plateau in 2016 and 2017. Apartment vacancy rates are also expected to decline slightly in 2015 but reverse direction and rise slightly in 2016 and 2017. Commercial property rents are expected to increase for the four major property types in 2015, ranging from 2.0 percent for retail up to 4.6 percent for apartments and 4.9 percent for industrial. Rent increases in 2017 in these four types will range from 2.8 percent for retail to 4.0 percent for office. Hotel RevPAR is expected to increase by 7.9 percent in 2015 and 4.2 percent in 2017. \nAdditionally, the Consensus Forecast predicts that single-family housing starts will increase to 745,000 in 2015, 842,000 in 2016, and 900,000 in 2017, but still remain below the 20-year average. Home price increases are expected to moderate to 5.0 percent in 2015, 4.3 percent in 2016, and 3.9 percent in 2017. Compared to six months ago, forecasts for housing starts in 2015 and 2016 are more optimistic, while the forecast for 2017 remains unchanged. \n\nRegarding real estate capital markets, commercial real estate transaction volume is expected to remain stable at around $500 billion in all three forecast years. Issuance of commercial mortgage-backed securities (CMBS) is expected to continue to grow steadily through 2017, with projected increases to $110 billion in 2015 to $130 billion in 2016 and to $140 billion in 2017. \n\nConsensus Forecast survey predictions by commercial property type include: \nOffice – Office vacancy rates are expected to continue declining, bringing the vacancy rate below the 20-year average, to 13.3 percent in 2015, 12.7 percent in 2016, and 12.3 percent by the end of 2017.  Rental rate growth is expected to increase at a consistent pace of 4.0 percent in all three forecast years. All forecasted rates are above the 20-year average. The forecast for office vacancy rates is slightly less optimistic than the forecasts of six months ago. The outlook for rental rate growth in 2015 and 2016 remain about the same, while the forecast for 2017 is more optimistic.  Apartments – Vacancy rates are expected to increase slightly to 4.8 percent in 2016 and 5.0 percent in 2017; however, these forecasts remain below the 20-year average vacancy rate. Apartments are also expected to show consistent rental rate growth above the 20-year average of 2.7 percent. Rents are expected to rise by 4.6 percent in 2015, then moderate to 3.5 percent in 2016 and 3.0 percent in 2017. The outlook for vacancy rates for the next three years are lower, and the forecasted rental rate changes ae all higher, when compared to six months ago. Retail – The Consensus Forecast anticipates on-going improvements over the next three years, with year-end availability rates expected to decline to 11.1 percent by 2015, 10.7 percent by 2016, and 10.4 percent by 2017. Still, these rates remain above the 20-year average. Rental rates are expected to sustain this growth, increasing by 1.5 percent in 2015, 2.5 percent in 2016, and 2.8 percent in 2017.Compared to six months ago, the outlook of availability rates and rental rate growth for the next three years is less optimistic. Industrial/warehouse – Availability rates are expected to continue to decline in 2015 and 2016, with year-end vacancy rates at 9.7 percent and 9.5 percent, respectively, and remain steady in 2017 at 9.5 percent. Forecasts are for healthy rental rate growth to continue, with increases of 4.9 percent in 2015, 4.0 percent in 2016, and 3.0 percent in 2017. These forecasts are all above the 20-year average growth rate. The forecasts for industrial/warehouse availability rates and rental growth rates in 2015, 2016 and 2017 are all more optimistic than the Consensus Forecast of six months ago. Hotel – The Consensus Forecast projects that occupancy rates will improve even more in 2015, reaching 65.3 percent and then nearly plateauing at 65.4 percent in 2016 and 65.3 percent in 2017. Hotel revenue per available room (RevPAR) is expected to remain strong, but at a decelerating rate. RevPAR is expected grow by 7.9 percent in 2015, 5.9 percent in 2016, and 4.2 percent in 2017. These projections are all above the 20-year average. \nThe market survey, conducted last month, is the eighth in a series of polls conducted by ULI to gauge sentiment among economists and analysts about the direction of the real estate industry. The next forecast is scheduled for release in April 2016 . \n\nAbout the Urban Land Institute \nThe Urban  Land  Institute ( www.uli.org ) is a nonprofit education and research institute supported by its members. Its mission is to provide leadership  in the responsible use of land and in sustaining and creating thriving communities worldwide. Established in 1936, the Institute has more than 36,000 members representing all aspects of land use and development disciplines . \n\nLogo - http://photos.prnewswire.com/prnh/20100310/ULILOGO  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/new-urban-land-institute-semi-annual-forecast-for-real-estate-market-less-bullish-but-still-foresees-continued-economic-expansion-through-2017-300151696.html \n\nSOURCE  Urban Land Institute", "source": "U-T San Diego"}