{"published": "2015-09-03T17:47:37Z", "media-type": "Blog", "title": "How to get live web data into a spreadsheet without ever leaving Google Sheets", "id": "4194e5c4-fcee-415c-8887-6df6ee7426a0", "content": "We are super excited to announce that Blockspring have just released an integration with us to let you automatically pull data from the web into a spreadsheet. They’ve created an awesome solution that lets you use a range of great APIs using only a spreadsheet. Their Excel and Google Sheets plugin enables you to bring data into your spreadsheet, run text-analysis and much more. \n\nSo today we want to show you how you can use live web data from a spreadsheet to do a bunch of cool things in just a few minutes. Currently Blockspring is using our Magic API , which automatically generates a table of data from a URL. You just have to provide the Blockspring integration a URL and it pulls the data from that site into a nice, orderly table - all without leaving your spreadsheet. \n\n  \nPulling live data into a spreadsheet \nIn this example we’ll use Magic and Blockspring to pull in data from Ikea’s rugs . \nWhat you’ll need: \nFree Blockspring account \n\nFree Import.io account \n\nYour Import.io API Key \n\nA Google spreadsheet with the Blockspring Add-on installed (You can also use Excel) \n\nA URL you want to pull data from (or you can use our example) \nStep 1: Set-up the spreadsheet \nOpen a Google spreadsheet and sign into Blockspring, which is found under Add-ons. \n  \n  \nStep 2: Choose Import.io \nOnce you’re logged in, the Blockspring console will open on the right. Scroll down until you find Import.io. \n  \nThe first time you do this, you’ll need to put in your Import.io API Key (which you can find on your account page ). \n\n  \nStep 3: Extract data from a URL \nClick on “Extract Data from URL” and then click “Insert into selected cell”. Blockspring will insert this formula into that cell: =BLOCKSPRING(\"extract-data-from-url-importio\", \"url\", \" http://www.ikea.com/us/en/search/?query=chair \") \n  \nAnd you should see data on Ikea chairs brought straight from the website into the sheet! \n\n  \nStep 4: Change the URL \nThe URL Blockspring inserts is just a placeholder. To change it, simply replace it with whatever URL you want and hit Enter. \n  \nYou can also change the URL in the formula to be a cell reference to make it easier to change the URL. \n\n  \nManipulating your data \nLive data in Google Sheets is pretty exciting, but where the Blockspring integration gets really cool, is how you can use the data you’ve pulled in with other API integrations. Here are three quick examples to get your wheels turning. \n\n  \n  Get Product Color Trends \nLet’s say you’re in product development and you want to know what the hot colors of the season are. \n\nIf we take the Ikea data set we created earlier, we can apply the Blockspring Color integration to pull out the primary color from each image. Everyday you could have a fresh data output of all the products on the website and colors for each product. \n\nSee the full step by step here \n\n  \n  Compare Product Prices Across Sites \nWhether you’re doing competitor pricing analysis or just a little comparison shopping, it’s helpful to know which sites have the best prices. \n\nUsing the Import.io integration with the Amazon Products integration, you can pull in the Ikea products and look them up on Amazon and pull in the corresponding prices. Voila! Simple price comparison, all without leaving your workbook. \n\nSee the full step by step here \n\n  \n  Identify Core Company Team \nBefore you approach a new company – whether you’re selling something, asking for a job, offering a partnership, etc – it’s a good idea to know who the major players are. \n\nUsing the Import.io and Bing integrations, you can easily pull in the core team from a company’s Crunchbase page. The Bing integration will allow you to search for a company’s page and the Import.io integration will take that URL and extract all the relevant information from it. \n\nSee the full step by step here \n\n\n\nWhat will you create? \nWe’d love to know what other uses you can find for Import.io in Blockspring. Tell us about them in the comments or on Twitter ( @importio  @blockspring ).", "source": "import.io blog"}