{"published": "2015-09-09T13:00:22Z", "media-type": "Blog", "title": "Reese Witherspoon's Style Is Inspired by Everyone from a Country Singer to Elle Woods", "id": "e8435ee9-c535-405f-956b-539261ba03dd", "content": "Even style icons have style icons. And People’s Best Dressed 2015 star Reese Witherspoon has at least half a dozen women on her own best dressed list. \n \nRex \n \n\n\n \n“I have many different women because I like how they express themselves; and it doesn’t necessarily mean that’s how I want to look but I like the way that it’s essentially a look that they look good in,” she tells PEOPLE. “People who know who they are, it’s interesting to see how they style themselves.” \n \nSo who are these incredibly awesome women? For starters, there’s Lou Doillon, a French model, singer, actress and all around cool-girl fashion muse. \n \nRex \n \n\n\n \n“She always looks so great. She looks like herself. I wouldn’t wear those clothes, but she looks beautiful like that.” \n \nRELATED: Everything You Need to Know About PEOPLE’s Best Dressed List  \n \nNext up is country singer Nikki Lane, “who just dresses in country western wear, but she makes it look so cool,” says Witherspoon. \n \nFrazer Harrison/Getty \n \n\n\n \nAt just 5’2″, the actress pays attention to how other petite stars dress. “I always look at other short girls like Natalie Portman and Rachel Bilson and I’m like ‘What’s she wearing?'” says Witherspoon. “There are a few of us shorties out in the world.” \n \nGetty (2) \n \n\n\n \nAnd it’s not just fellow celebs who catch Witherspoon’s eye. “There’s a mom in my school who’s incredibly stylish. My friend Marlien Rentmeester, she has a blog called Le Catch. She puts an H&M skirt with a T-shirt and a more expensive shoe and she looks great. And everybody’s always like, ‘Marlien where did you get that?'” \n \nStefanie Keenan/Getty \n \n\n\n \nShe’s also a fan of style bloggers. “I love this blog Gal Meets Glam by Julia Engel. And then this girl Carly who does the College Prepster or Ashley Brooke Designs because she does such funny little text things. These are the girls that I love their blogs. It’s fun to see them mention Draper James.” \n \n\n \nRELATED PHOTOS: 8 Reese Witherspoon Style Facts That Made Us Love Her Even More \n \nSpeaking of Witherspoon’s successful clothing line, it was the star’s grandmother Dorothea Draper (along with her grandfather, Williams James) who not only supplied the name, but also the overall vibe of the preppy, colorful collection. \n \n“She was just sort of this quintessential Southern lady,” Witherspoon explains. “She didn’t leave the house without feeling somewhat put together. That doesn’t mean she was dressed to the nines at all moments, but she pulled herself together and her presentation to the world was like, ‘I’ve got my stuff together.’ But it’s a good lesson as a young person: It doesn’t matter what’s going on in your life, but you’ve got to show your best self to the world.” \n \n\n \nBut her grandmother isn’t the only person to teach Witherspoon the importance of dressing up. Her famous Legally Blonde alter ego also shared a similar style mindset. “When you look good, you feel good,” the actress says. “I know that’s what Elle Woods says, but it’s true! When you look good, you feel good.” \n \nTracy Bennett \n \n\n\n \nFor all of Reese Witherspoon’s best looks of the year, plus more stylish stars and tons of amazing fall fashion, pick up the new issue of PEOPLE, on stands everywhere Friday \n \nRELATED VIDEO: Watch Reese’s Changing Looks \n  \n–Andrea Lavinthal", "source": "Style News - StyleWatch - People.com"}