{"published": "2015-09-10T14:09:26Z", "media-type": "News", "title": "Daikin Offers Worldwide Free Access to Patents for Equipment Using Next-Generation Refrigerant", "id": "db0f4df3-a979-45b2-bbce-a2f2af6968a1", "content": "Daikin Offers Worldwide Free Access to Patents for Equipment Using NextGeneration Refrigerant Tweet OSAKA, Japan and WASHINGTON and BRUSSELS, Sept. 10, 2015 /PRNewswireUSNewswire/ Daikin Industries, Ltd., the world's leading air conditioner and refrigerant manufacturer based in Osaka, Japan, announced today it is offering companies worldwide free access to 93 patents, to encourage companies to develop and commercialize air conditioning, cooling and heat pump equipment that use HFC32 as a single component refrigerant. Daikin's action is aimed at encouraging manufacturers worldwide to adopt sustainable comfort cooling and heating technologies that use HFC32, a refrigerant with a lower global warming impact than commonlyused refrigerants. HFC32 (difluoromethane) is a next generation refrigerant that addresses a range of environmental considerations in a balanced manner. It is a nonozone depleting substance, is energy efficient, affordable, is easier to recycle, and has a globalwarming potential (GWP) that is onethird of that of R410A, the most commonly used refrigerant. These advantages make it the most balanced and promising nextgeneration refrigerant solution to reduce the environmental footprint of residential and commercial airconditioning, cooling and heat pump equipment. \n\nThe avoided carbon emission benefits of a transition to HFC32 would be very significant. If all presently used R410A refrigerant is replaced by HFC32, the total CO2 equivalent impact of HFCs could be reduced by up to 24% in 2030, compared to usiness as usual scenarios. \"Daikin has been offering free access to these patents in emerging markets since 2011 to accelerate the phaseout of ozonedepleting refrigerants, such as HCFC22,\" said Shinya Okada, Daikin's Senior Executive Officer. \"Given the urgent need to address climate change, Daikin believes that this is the right time to extend free access to these certain HFC32 equipment patents to manufacturers worldwide.\"\n\nThere is no patent that covers the HFC32 chemical itself and it is readily available from suppliers other than Daikin. This free access to certain patents allows manufacturers to utilize Daikin's technologies for airconditioning, cooling and heat pump equipment using HFC32 single component refrigerant and encourages the global industry to grow responsibly as well as meet rising demand.\n\nConversion from highGWP refrigerants is already underway. Last year, the European Union enacted the revised Fgas regulation* to reduce the globalwarming impact of refrigerants. In the United States, the Environmental Protection Agency (EPA) is in the process of revising its regulations that establish acceptable alternatives for ozone depleting and high GWP refrigerants. In addition, Japan's Act on Rational Use and Proper Management of Fluorocarbons, which came into force in April 2015, encourages conversion from highGWP refrigerants. \"Sharing environmentally beneficial air conditioning technologies without royalty payments can speed up environmental gains at a time when fast action is essential for climate protection,\" said Durwood Zaelke, president of the Institute for Governance & Sustainable Development. \"Free access to patented technologies sets a powerful precedent for other companies aiming to be environmental champions.\"\n\nCompanies interested in obtaining access to these patents should contact Daikin Legal.\n\n*EU Regulation 517/2014 of 16 April 2014 on fluorinated greenhouse gases\n\nAbout Daikin\n\nDaikin Industries, Ltd. is the world's leading manufacturer of air conditioners and refrigerants. The company, leveraging its advanced core technologies for refrigerant control, inverters and heat pumps, develops innovative, highquality airconditioning solutions for homes, offices and industrial facilities. Founded in Osaka, Japan in 1924, Daikin and its affiliates now operates more than 70 production bases worldwide and employs a global workforce of 59,000. Daikin products are available in more than 140 countries. For more information please visit, http://www.daikin.com/ \n\nPress release:\n\nhttp://www.daikin.com/press/2015/150910/index.html Logo http://photos.prnewswire.com/prnh/20150909/265128LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/newsreleases/daikinoffersworldwidefreeaccesstopatentsforequipmentusingnextgenerationrefrigerant300140486.html SOURCE Daikin Industries, Ltd. [ Back To TMCnet.com's Homepage", "source": "TMC Net"}