{"published": "2015-09-22T01:55:24Z", "media-type": "News", "title": "New One Direction album Made In The A.M to be released in November", "id": "9e75bc8a-f724-4297-9149-0d6164107335", "content": "Left to right: Niall Horan, Harry Styles, Liam Payne and Louis Tomlinson of One Direction are playing the Roundhouse in Camden during the Apple Music Festival \n\nOne Direction have announced their fifth album Made In The A.M will be released on November 13.\n\nThe title and release date of the new album, which is available to pre-order now, was unveiled via a video message featuring the band.\n\nMade In The A.M follows the massive success of Drag Me Down - the first single released from the album - which topped the UK Singles Chart, climbed to third spot in the Billboard Chart in the US and broke streaming records globally. \n\nHarry Styles said Infinity, another track from the album, has also been released \"as a little treat\" for anyone who pre-orders the album or streams through online retailers. \n\nThe song is written by John Ryan, Jamie Scott and Julian Bunetta, the team behind One Direction smash Story Of My Life.\n\nIt is said to showc ase a more mature sound for the band which fans can expect from the new album. \n\nLiam Payne tweeted the album name to fans, adding: \" Can't wait for you all to hear it!\" \n\nOne Direction will kick off the UK and Irish leg of their On The Road Again Tour with six nights at London's O2 Arena from Thursday, September 24, as well as headlining the Apple Music Festival at the Roundhouse in London tonight, supported by special guests Little Mix.\n\nNiall Horan tweeted his excitement about the gig, writing: \"really can't wait for the apple music festival... at the roundhouse. My favourite London venue ... Looking forward to seeing you all.\"\n\nLast month the band hit the headlines over rumours about their future - shocking millions of devoted fans. They have confirmed they are taking a break.\n\nBoth One Direction and Little Mix found fame on The X Factor, with the boy band having gone on to enjoy global success, acquiring millions of fans who are known as ''Directioners''.\n\nLittle Mix, who won the ITV talent show in 2011, have also had success on both sides of the Atlantic.\n\nThe bands have been linked due to former One Direction star Zayn Malik having been engaged to Perrie Edwards from Little Mix.\n\nBut reports that the pair had split emerged in August. The pop star duo got engaged in 2013 but had never publicly announced a wedding date. \n\nThe Apple Music Festival, which offered fans the opportunity to win free tickets to see their favourite performers, has already featured concerts by Ellie Goulding, Take That and Carrie Underwood.\n\nOne Direction fans turned up 24 hours before the show to set up camp in a bid to get last-minute tickets.\n\nEmily Davis, 20, and Megan Hilson, 19, from Manchester, did not have tickets so arrived at 8.30pm on Monday night to get to the front of the standby queue. \n\nMiss Davis, who has previously travelled to Brussels and New York to see the band, said: \"It has been raining all day, it has been wet, we are soggy, I am cold, but it's worth it.\"\n\nTickets for the gig are more in demand than ever as the boy band announced they will be taking a hiatus for at least a year from March so this will be one of their final shows.\n\nAlthough tickets could be won through competitions, super-fans, also known as Directioners, camped overnight in the rain in the hope of getting any tickets not used by competition winners.\n\nNenah Kedman, 23, from London, has a ticket but arrived at 4am to make sure she was at the front of the audience.\n\nShe said: \"This is probably the smallest venue I will ever see them in and especially as they are now doing an arena tour it is going to be impossible to ever get this close to them again so I thought if I am going to come here, I am going to come here and do it in style and be right at the front and just have a great experience.\"\n\nMiguel Tello, 31, from London, put up a tent during the early hours, next to others who took it in turns to save each other's places while they had toilet breaks at nearby businesses.\n\nHe said: \"It is hard because it was raining last night. It was really cold but this show is really special because actually it is like you never know when it is going to happen again because they are having a break in March.\"", "source": "Congleton Guardian"}