{"published": "2015-09-02T11:11:20Z", "media-type": "News", "title": "Problems plague Tigers men’s soccer in 0-2 start", "id": "8234a966-4aeb-4c6b-b34a-38306456eea2", "content": "Freshman midfielder Mason Morise (number #17 in the photo) has scored the lone goal for Memphis in two games this season. Photo by Joe Murphy \n   \nThe Memphis Tigers men’s soccer team knew they were in for a challenge in Friday night’s season opener against UAB, so while the 3-1 loss wasn’t what the Tigers hoped for it wasn’t any cause for concern either. \n \nThat may have changed a little bit Monday afternoon following Memphis’ 1-0 loss at home to Northern Kentucky, who finished 6-10-4 against a relatively weak schedule a season ago. The loss gives Memphis an 0-2 record on the young season, and with three road games against difficult teams coming up next on the schedule the Tigers will have to figure things out sooner rather than later. \n \nPerhaps the most notable issue with the Tigers in the early goings of the season has been the team’s finishing ability, or lack thereof. In both losses Memphis has out-shot their opponents — 21-8 vs. UAB and 13-9 against Northern Kentucky. However, of those 34 shots only one has resulted in a goal.  \n \n“The quality in the final third again for the second straight game wasn’t there, and I think to correct that you just get on the practice field and work on crossing and finishing, as basic as that is,” head coach Richard Mulrooney said about the team’s finishing in the first two games. “We are creating the opportunities. It’s just a matter of finally putting the ball in the back of the net.” \n \nDespite scoring only one goal in two games, Memphis’ offense has actually been pretty solid. The Tigers are controlling possession for stretches and are able to set up goal-scoring opportunities. Once the U of M is able to actually finish those opportunities they should be fine, but until that happens they’re going to need spectacular performances from the defense to have a shot at winning games. \n \nMuch like the offense, the defense has been doing its job outside of one glaring weakness — set pieces. Of the four goals given up by the Memphis defense, three have come as a direct result of a corner or free kick.  \n \nIn the opener, the Tigers were tied 1-1 with UAB until the Blazers scored twice in two minutes off of two set pieces. Set piece offense is something of a specialty for the Blazers — Mulrooney likened it to the NBA’s Golden State Warriors and three-point shooting — but then Monday afternoon the Blue and Gray found themselves victims of a set play score yet again when Northern Kentucky’s Calvin Murphy headed in a free kick in the 64th minute for the game-winner, signaling that it could be a problem with Memphis’ defensive execution rather than just the opponent’s proficiency. \n \n“In the box we have to be tighter and fight for the ball, because obviously we are being beaten to the ball and physically beaten in getting on the end of those, and it’s just a matter of that’s unacceptable,” Mulrooney said. “You have to have a will to stop the other team, and obviously we haven’t gotten that yet.” \n \nMulrooney is also experimenting with making personnel changes on the defensive end, with sophomore Jake Leeker earning the start in goal Monday afternoon in place of incumbent senior Cody Uzcategui. The head coach noted that there was a close race between the two in preseason for the starting goalkeeper job, and he could continue to give both players looks until one asserts himself as the man for the job. \n \nOutside of small mistakes the Tigers played well enough to win both of their first two games, and with a difficult upcoming schedule failure to capitalize on those opportunities could come back to bite them. \n \nMemphis’ next four games all come on the road, and each is against a 2014 NCAA Tournament team. The U of M will face No. 14 Saint Louis, SIU-Edwardsville, Kentucky and No. 15 Louisville in the difficult stretch, and if the current issues aren’t corrected the Tigers could easily see their two-game slide snowball into a much longer streak. \n \nThe Tigers are familiar with each of their next four opponents except Kentucky, having faced Louisville in an exhibition last season and defeated both SIU-Edwardsville and Saint Louis in the regular season. \n \nAccording to Mulrooney, both the familiarity with the opponents and the added pressure of needing a win could bring the best out of the Tigers in the difficult games this weekend. \n \n“I see it as just a big challenge, I really do,” the second-year head coach said. “I don’t see it as something that we can’t overcome. These next two games are teams that we beat last year, and I know that’s last year and I know it was at home, but the confidence should be there that we can play with these teams because we did it last year.” \n \nMemphis will travel to St. Louis to take on the Billikens Friday evening, with kickoff set for 7 p.m. The Tigers will then have a quick turnaround before playing SIU-Edwardsville at 1 p.m. Sunday.", "source": "Daily Helmsman"}