{"published": "2015-09-26T22:44:58Z", "media-type": "Blog", "title": "Mae", "id": "d3bb7220-e4fe-4deb-af54-beadc650842a", "content": "Mae ...\nToday Mae proudly walked 5km for her sister Phoebe and all of the kids at St.Jude. She raised close to $1500 by making and selling rainbow loom bracelets. We are very proud of her. \nMae was just 23 months when her baby sister was diagnosed with cancer and like Phoebe, she has grown up and experienced many firsts and milestones in the hospital. \nDespite the struggles and heartache that has shaped her life, Mae shines. She is like a breath of fresh air and although she is only 6 years old, she is wise beyond her years. If you ask her, she will tell you everything you ever wanted to know about the immune system, blood, children's hospitals and her sister Phoebe. \nThis year has been so hard. It has been by far the most difficult despite everything we had already been through. Mae has been witness to too many traumatizing and devastating things. She has sat quietly as doctors have discussed infections, strokes, seizures, cancer, and terrible odds. She has seen her baby sister scream in pain. She has walked beside us the many times Phoebe has been transferred to the ICU. She has seen Jon and I completely broken. She has asked if Phoebe will ever come home. She has watched as Phoebe is sedated. She has wondered out loud if the Phoebe that she loves so much would come back to her after a stroke and fungal infection in the brain caused her to be unrecognizable. She has sat by and held her little sister's hand through days that would cause the strongest people to completely break down. Despite a fungal infection that has left marks and scars on Phoebe's skin that are most likely permanent - Mae sees nothing but pure beautiful and brave Phoebe. Unlike some adults who have asked, \"what is wrong with your baby\", Mae chooses kindness and focuses on what is important. \nMae talks about her dreams - she too dreams of cancer and of Phoebe. She says that \"the guys with swords are the bad guys, but then there are good guys with shields and they are protecting Phoebe\". I hope the good guys win, she says. \nShe worries about Phoebe and has asked me the most heartbreaking things these past few months. Words that I can't bring myself to write down because it makes all of this even more real and heartbreaking. Questions about life and death and heaven. No six year old should dream of cancer and wonder where her friends have gone and if they are hurting. \nThroughout all of this heartache and trauma, time and time again, Mae chooses hope.\nShe has helped Phoebe learn to walk again after strokes and too much time in the hospital. She is the first to cheer her sister on as she tries something new. She has patiently waited for Phoebe to be well enough to play. Time and time again. She will do anything and everything for Phoebe and she knows that she helps Phoebe to heal and thrive. Despite many opportunities to go home - Mae chooses to stay in Memphis, \"because Phoebe needs me\". \nI have never seen love like the love that Mae has for her sister. It breaks my heart and fills me with pride all at the same time. \nSeptember is childhood cancer awareness month - and a childhood cancer diagnosis affects the entire family. Siblings, like our sweet Mae, are often the unsung but very brave heroes. ", "source": "Phoebe Rose Rocks"}