{"published": "2015-09-16T15:25:46Z", "media-type": "News", "title": "\"Pope Radio\" Channel to Launch on SiriusXM September 21-27", "id": "1eb27b5c-6005-4586-8d56-2ab0e1a50216", "content": "NEW YORK , Sept. 16, 2015 /PRNewswire/ --SiriusXM announced today that it will launch a special channel entitled \"Pope Radio\" that will be entirely dedicated to Pope Francis's first visit to the United States next week. \n  \n\"Pope Radio\" will be a special production of The Catholic Channel and will be an exclusive collaboration between SiriusXM and the Archdiocese of New York. The channel will launch on Monday, September 21 , at 6:00 am ET and air 24 hours a day until after the Holy Father departs the country. It will be available to SiriusXM subscribers on channel 129  the regular home of The Catholic Channel - on satellite radios, on the SiriusXM app and at SiriusXM.com. \n \nPope Francis will first visit Washington DC ( Sep. 22-24 ), then New York ( Sep. 24-26 ) and finally Philadelphia (Sep. 26-27). \n\n \nPope Radio will cover the Holy Father's journey every step of the way and will give listeners nationwide a unique perspective on the religious, social and political impressions felt in the U.S. and abroad. Coverage will include live broadcasts of all of the major events during the Pope's visit including his address to a joint session of Congress, a first for a Pope, his visits to the World Meeting of Families and Ground Zero, the Papal Masses and much more. Click here for an itinerary of the Pope's travels. \n \nA host of commentators  those in studio as well as those on site at every venue - will broadcast throughout the day to provide listeners with up-to-the-moment reports and analysis through Pope Francis's travels. SiriusXM subscribers will have the most comprehensive access available on radio and will hear from a remarkably knowledgeable lineup of hosts. These include Cardinal Timothy Dolan , Archbishop of New York ; Fr. Dave Dwyer , CSP; 'The Catholic Guy' Lino Rulli ; Jennifer Fulwiler ; Gus Lloyd ; Fr. Gabriel Gillen ; SiriusXM political host Tim Farley ; special White House correspondent Jared Rizzi ; and others. \n \nAmong the highlights for the week on Pope Radio will be a special edition of Cardinal Dolan's weekly show, Conversation with Cardinal Dolan , which he will host live on Tuesday, September 22 ( 2:00 to 3:00 pm ET ). \n \n\"I am excited and honored that The Catholic Channel will become Pope Radio for a week, to carry every moment of the Holy Father's visit to Cuba and the United States ,\" said Cardinal Timothy Dolan of New York . \"Anyone who wants to really follow Pope Francis has only place to turn: Pope Radio on SiriusXM.\" \n \n\"Pope Francis's first visit to the U.S. is a historic event and we have created special programming for our listeners nationwide,\" said Scott Greenstein , SiriusXM's President and Chief Content Officer. \"SiriusXM and the Archdiocese have created this channel to cover virtually every minute of the journey not only to give people around the country access to these events as they happen, but also to give them a platform to discuss what the Holy Father's visit means to them personally.\" \n \nOn September 19 and 20, the days leading up to the launch of Pope Radio, The Catholic Channel will present a two-day special that will preview the Pontiff's visit. Prelude to the Pope will air throughout the day this Saturday and Sunday and will include live coverage of select events from Cuba , where Pope Francis will be before travelling to the U.S. Listeners will also hear specials that will inform them about Pope Francis's background and his elevation to the Papacy, and examinations of the social and political impact he has had on the world as the Holy Father. \n \nVisit www.siriusxm.com/pope for more info on Pope Radio. \n \nFollowing the conclusion of the Papal Visit, and throughout the year, listeners can tune in daily to The Catholic Channel - a collaboration between SiriusXM and the Archdiocese of New York - on SiriusXM channel 129. The channel is designed to appeal to a multigenerational audience and provide listeners across the country with a place to share their faith and discuss modern day news and issues from a Catholic perspective. \n \nAbout SiriusXM \n \nSirius XM Holdings Inc. (NASDAQ: SIRI) is the world's largest radio broadcaster measured by revenue and has 28.4 million subscribers. SiriusXM creates and broadcasts commercial-free music; premier sports talk and live events; comedy; news; exclusive talk and entertainment; and the most comprehensive Latin music, sports and talk programming in radio. SiriusXM is available in vehicles from every major car company in the U.S. and on smartphones and other connected devices as well as online at siriusxm.com . SiriusXM radios and accessories are available from retailers nationwide and at shop.siriusxm.com . SiriusXM also provides premium traffic, weather, data and information services for subscribers in cars, trucks, RVs, boats and aircraft through SiriusXM Traffic, SiriusXM Travel Link, NavTraffic, NavWeather, SiriusXM Aviation, SiriusXM Marine, Sirius Marine Weather , XMWX Aviation, and XMWX Marine. SiriusXM holds a minority interest in SiriusXM Canada which has more than 2 million subscribers. SiriusXM is also a leading provider of connected vehicles services to major automakers, giving customers access to a suite of safety, security, and convenience services including automatic crash notification, stolen vehicle recovery assistance, enhanced roadside assistance and turn-by-turn navigation. \n \nOn social media, join the SiriusXM community on Facebook , Twitter , Instagram , and YouTube . To view and download SiriusXM logos and artwork, please visit SiriusXM.com/LogosAndPhotos . \n \nThis communication contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about future financial and operating results, our plans, objectives, expectations and intentions with respect to future operations, products and services; and other statements identified by words such as \"will likely result,\" \"are expected to,\" \"will continue,\" \"is anticipated,\" \"estimated,\" \"believe,\" \"intend,\" \"plan,\" \"projection,\" \"outlook\" or words of similar meaning. Such forward-looking statements are based upon the current beliefs and expectations of our management and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are difficult to predict and generally beyond our control. Actual results may differ materially from the results anticipated in these forward-looking statements. \n \nThe following factors, among others, could cause actual results to differ materially from the anticipated results or other expectations expressed in the forward-looking statements: our competitive position versus other radio and audio service providers; our ability to attract and retain subscribers, which is uncertain; our dependence upon the auto industry; general economic conditions; changes in consumer protection laws and their enforcement; the security of the personal information about our customers; other existing or future government laws and regulations could harm our business; failure of our satellites would significantly damage our business; the interruption or failure of our information technology and communications systems; royalties we pay for music rights, which increase over time; the unfavorable outcome of pending or future litigation; our failure to realize benefits of acquisitions or other strategic initiatives; rapid technological and industry changes; failure of third parties to perform; failure to comply with FCC requirements; modifications to our business plans; our indebtedness; and our principal stockholder has significant influence over our management and over actions requiring stockholder approval and its interests may differ from interests of other holders of our common stock. Additional factors that could cause our results to differ materially from those described in the forward-looking statements can be found in our Annual Report on Form 10-K for the year ended December 31, 2014 , which is filed with the Securities and Exchange Commission (the \"SEC\") and available at the SEC's Internet site ( http://www.sec.gov ). The information set forth herein speaks only as of the date hereof, and we disclaim any intention or obligation to update any forward looking statements as a result of developments occurring after the date of this communication. \n \nP - SIRI \n \nMedia contact: \nAndrew FitzPatrick \nSiriusXM \n212-901-6693 \nandrew.fitzpatrick@siriusxm.com \n \nLogo - http://photos.prnewswire.com/prnh/20101014/NY82093LOGO  \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/pope-radio-channel-to-launch-on-siriusxm-september-21-27-300144078.html \n \nSOURCE  Sirius XM Holdings Inc. \n \nCopyright 2014 PR Newswire.  All Rights Reserved \n\nHome, Internet, Security, Family, Communications, Movies & Music, Web, Smart Phone, Accessories, Security, Music, Social Media, Security, Internet, Business Issues, Security, Social Media, Social Network, Law & Regulations, Management, USA, IT (Information Technology), Business, Science, Sports, \n\nSource:PR Newswire.\n All Rights Reserved", "source": "Storage"}