{"published": "2015-09-26T02:17:00Z", "media-type": "Blog", "title": "A Quick insight on Secretarial Audit", "id": "7382548a-ef3a-4bad-a9f1-3a5279a9b4cd", "content": "CS Vikas Gupta What is Secretarial Audit? Secretarial Audit is a process to check compliance with the provisions of various laws and rules/regulations/procedures, maintenance of books, records etc., by an independent professional to ensure that the company has complied with the legal and procedural requirements and also followed due processes. It is essentially a mechanism to monitor compliance with the requirements of stated laws and processes. Which companies are required to undergo Secretarial Audit? As per section 204(1) of Companies Act, 2013 read with rule 9 of the Companies (Appointment and Remuneration of Managerial Personnel) Rules, 2014, the following companies are required to obtain Secretarial Audit Report: – Every listed company; or Every public company having a paid-up share capital of fifty crore rupees or more; or Every public company* having a turnover of two hundred fifty crore rupees or more. *Public Company includes a private company which is a subsidiary of a public company. (My view: However, it is recommended that it should be adopted voluntarily. It can be an effective multi-pronged weapon to assure the regulator, generate confidence amongst the shareholders, the creditors and other stakeholders in companies, assure FIIs/FIs/SFCs/SIDCs/Banks and instill self regulation and professional discipline in companies. It is a tool of risk mitigation and will allow companies to effectively address compliance risk issues. It helps the companies to build their corporate image. Secretarial Audit thus provides necessary comfort to the management, regulators and the stakeholders, as to the statutory compliance, good governance and the existence of proper and adequate systems and processes.) Who can conduct Secretarial Audit? Only a member of the Institute of Company Secretaries of India holding certificate of practice (company secretary in practice) can conduct Secretarial Audit and furnish the Secretarial Audit Report to the company. [Section 204(1) of Companies Act, 2013] How is the Secretarial Auditor appointed? As per Rule 8 of the Companies (Meetings of Board and its powers) Rules, 2014, Secretarial Auditor is required to be appointed by means of resolution passed at a duly convened Board meeting. What is periodicity of Secretarial Audit? Proactive Secretarial Audit on a continuous basis would help the company in initiating corrective measures and strengthening its compliance mechanism and processes. It is therefore, advisable that the Secretarial Audit is carried out periodically (quarterly / half year / annually) and adverse finding if any, is reported on interim basis to the Board immediately. The Secretarial Audit Report to be annexed with Board’s report is required to be submitted before the preparation of Board’s Report. What are the laws which need to be examined while conducting the Secretarial Audit? The Secretarial Auditor needs to examine and report on the compliance of the following laws: (i) The Companies Act, 2013 (the Act) and the rules made thereunder; (ii) The Securities Contracts (Regulation) Act, 1956 (“SCRA”) and the rules made thereunder; (iii) The Depositories Act, 1996 and the Regulations and Bye-laws framed thereunder; (iv) Foreign Exchange Management Act, 1999 and the rules and regulations made thereunder to the extent of Foreign Direct Investment, Overseas Direct Investment and External Commercial Borrowings; (v) The following Regulations and Guidelines prescribed under the Securities and Exchange Board of India Act, 1992 (“SEBI Act”):- (a) The Securities and Exchange Board of India (Substantial Acquisition of Shares and Takeovers) Regulations, 2011; (b) The Securities and Exchange Board of India (Prohibition of Insider Trading) Regulations, 1992; (c) The Securities and Exchange Board of India (Issue of Capital and Disclosure Requirements) Regulations, 2009; (d) The Securities and Exchange Board of India (Employee Stock Option Scheme and Employee Stock Purchase Scheme) Guidelines, 1999; (e) The Securities and Exchange Board of India (Issue and Listing of Debt Securities) Regulations, 2008; (f) The Securities and Exchange Board of India (Registrars to an Issue and Share Transfer Agents) Regulations, 1993 regarding the Companies Act and dealing with client; (g) The Securities and Exchange Board of India (Delisting of Equity Shares) Regulations, 2009; and (h) The Securities and Exchange Board of India (Buyback of Securities) Regulations, 1998; (vi) Secretarial Standards issued by The Institute of Company Secretaries of India and approved by the Central Government. (vii) The Listing Agreements entered into by the Company with Stock Exchange(s), if applicable; (viii) Other laws as may be applicable specifically to the company. Tags: Companies Act, Companies Act 2013", "source": "TaxGuru.in - Daily Tax and Corporate Law Update"}