{"published": "2015-09-07T17:42:53Z", "media-type": "News", "title": "Elderly man ‘on trolley for five days waiting for hospital bed’", "id": "f3cfed45-27f3-4866-9747-6f64a982082b", "content": "An elderly man has been on a trolley in an emergency department waiting for a hospital bed for five days. \n\nThe cancer patient was one of 40 people in need of a bed in the severely overcrowded A&E unit in Our Lady of Lourdes Hospital, Drogheda with medics warning the crisis will only get worse in the autumn and winter unless dramatic steps are taken. \n\nSeveral other people have spent four days on trolleys. \n\n\n\nThe Irish Nurses and Midwives Organisation (INMO) described chaotic scenes in Drogheda’s emergency department with two patients in every cubicle designed for one in the unit and three corridors packed with trolleys head to toe. \n\n“It’s completely intolerable for staff and patients,” INMO industrial relations officer Tony Fitzpatrick said. \n\nThe union accused hospital management of reneging on a deal dating back to February this year which committed them to hiring an extra nurse for every admitted patient who had to wait in the emergency unit for a bed. \n\nMr Fitzpatrick also warned many of those on trolleys are suffering sleep deprivation as they are being forced to lie under fluorescent lights 24 hours a day. \n\n“There is also the significantly increased risk of adverse medical outcomes or worse something being missed as a result of overcrowding,” he said. \n\nThe INMO said the emergency department in Drogheda is short of five nurses in a hospital that this year recorded its highest level of overcrowding since 2006. \n\nAnd the union also warned the dangerous conditions were being created by a combination of factors after the Government took decisions to close services in hospitals in Monaghan and Dundalk and move them to Our Lady of Lourdes without ensuring adequate resources. \n\n“Members of the INMO are at breaking point and will not tolerate the incessant overcrowding and unsafe conditions for patients,” Mr Fitzpatrick said. \n\nThe INMO’s daily trolley watch report revealed 40 patients in need of a bed on a ward were on trolleys in Drogheda’s A&E and another eight were lying on trolleys in corridors elsewhere in the hospital. \n\nIt said 5,480 patients have spent time on trolleys in the hospital’s emergency unit or in overcrowded wards from January to August this year – an unprecedented level of overcrowding for the usually quieter summer months and a level not seen in nine years. \n\nMr Fitzparick said he was tired of hearing claims that the situation in emergency units was improving. \n\n“It is imperative that additional resources are provided to ease this crisis,” he said. \n\nNationwide there were 282 people on trolleys awaiting transfer to beds in wards with 214 of them lying in A&E units.", "source": "Waterford News & Star"}