{"published": "2015-09-01T13:38:00Z", "media-type": "News", "title": "Internap Exploring Strategic Alternatives", "id": "7faf97a5-da97-4e01-b8a8-7b461f1cb3f6", "content": "SOURCE Internap Corporation\n\nATLANTA \n\n\"Internap is well positioned in an industry that is rapidly consolidating,\" said Michael Ruffolo \n\nThere can be no assurance that the Company's review of strategic alternatives will result in any transaction. The Company does not intend to make further public comment regarding these matters during the strategic review and exploration process.\n\nAbout Internap \n\nInternap is the high-performance Internet infrastructure provider that powers the applications shaping the way we live, work and play. Our hybrid infrastructure delivers performance without compromise – blending virtual and bare-metal cloud, hosting and colocation services across a global network of data centers, optimized from the application to the end user and backed by rock-solid customer support and a 100% uptime guarantee. Since 1996, the most innovative companies have relied on Internap to make their applications faster and more scalable. For more information, visit www.internap.com. \n\nForward-Looking Statements \n\nThis press release contains forward-looking statements. These forward-looking statements include statements related to our expectations regarding strategic alternatives to maximize shareholder value. Because such statements are not guarantees of future performance and involve risks and uncertainties, there are important factors that could cause our actual results to differ materially from those in the forward-looking statements. These factors include our the ultimate result of our exploration of strategic alternatives; our ability to execute on our business strategy and drive growth; the robustness of and current trends in the IT infrastructure services market; our ability to achieve or sustain profitability; our ability to expand margins and drive higher returns on investment; our ability to sell new data center space; the actual performance of our IT infrastructure services; our ability to maintain current customers and obtain new ones, whether in a cost-effective manner or at all; our ability to correctly forecast capital needs, demand planning and space utilization; the actual performance of our Internet infrastructure services; the reaction and behavior of customers and the market to our company, including our data centers; our ability to react to trends and challenges in our business and the markets in which we operate; the availability of services from Internet network service providers or network service providers providing network access loops and local loops on favorable terms, or at all; failure of third party suppliers to deliver their products and services on favorable terms, or at all; failures in our network operations centers, data centers, network access points or computer systems; our ability to provide or improve Internet infrastructure services to our customers; and our ability to protect our intellectual property, as well as other factors discussed in our filings with the Securities and Exchange Commission. Given these risks and uncertainties, investors should not place undue reliance on forward-looking statements as a prediction of actual results. We undertake no obligation to update, amend or clarify any forward-looking statement for any reason.\n\nLogo - http://photos.prnewswire.com/prnh/20150319/183128LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/internap-exploring-strategic-alternatives-300135894.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "CW Richmond WUPV"}