{"published": "2015-08-31T20:18:21Z", "media-type": "Blog", "title": "HELP Californians Get a PEOPLE’S VETO and Overturn SB277!", "id": "074b4064-7ae9-40fe-b253-a50b2f493f45", "content": "HELP Californians Get a PEOPLE’S VETO and Overturn SB277! Preserve Our Human Right to Make Our Own Vaccine Decisions.   There are less than 30 days to get Qualifying Referendum Signatures to put SB277 on the 2016 Ballot. Help overturn this law that denigrates human and parental rights by helping get this law put up for a vote in a Ballot Referendum. Californians are working for a People’s Veto. If not vetoed by the people SB277 plans to take away the right of California parents to decline vaccines based on personal beliefs or religious convictions, beginning July 2016.   Click Here to find a place to immediately sign if you live in California. Qualifying signatures have to be given in person from California registered voters. Click Here to Sponsor a Signature Collector for the Referendum.  For every $2.50 donated gets another signature closer to the goal of 450K signatures. Click Here to find them on Facebook! Click Here for the main SB77 Referendum page. A Message from California Coalition for Vaccine Choice: “We are knee-deep in our ground battle to qualify the SB 277 Referendum for the November 2016 ballot. You are a fierce and motivated army who refuse to be cowed by a government bent on controlling you. You have built a strong network of allies and have garnered tremendous results. We’re in the homestretch now with less than 30 days to go and we need to back up your efforts with paid signature collectors. This egregious bill needs to go!”. “ By successfully qualifying the SB 277 Referendum, we will ALL send a resounding message that WE THE PEOPLE will not give up our freedoms without a fight “ A message from our legal staff at NHFA on CA SB277: SB277 fundamentally alters the relationship between government and citizens in CA! Californians would lose the essence of Diane Miller JD American liberty regarding their health choices. The government plans to coerce citizens into forced medical treatments by withholding the ability to attend schools if they do not comply.   Mass vaccination policies are made at the state level – where your action to protect your rights are urgently needed now!   Defend the right to make informed voluntary decisions about vaccinations.  Help overturn SB277!   Thank California Senators Voting to Protect Human Rights and who opposed SB277: Anderson, Bates, Fuller, Gaines, Leyva, Moorlach, Morrell, Nielsen, Roth, Runner, Huff.   Send This Alert to your California Contacts!   Click Here for NVIC, the National Vaccine Information Center   Click Here to read SB277 that repeals Californians’ right to a personal belief and religious exemption for the use of vaccines. Support National Health Freedom Coalition\nPMD 218\n2136 Ford Parkway\nSt. Paul, MN 55116-1863\n507 663 9018\ninfo@nationalhealthfreedom.org Like NHFC on Facebook! www.nationalhealthfreedom.org  ", "source": "aircrap.org"}