{"published": "2015-09-20T22:37:42Z", "media-type": "News", "title": "Dozens of ACC claims rejected for pregnancy due to failed sterilisations", "id": "b982a1c4-c48c-4c16-badb-a4a0f16a83a5", "content": "Dozens of women have been denied ACC after they became pregnant due to failed sterilisation operations. \n \nFigures released under the Official Information Act reveal ACC received 62 claims relating to failed sterilisations between July 1, 2005, and June 30, 2015. \n \nThe majority of those claims were for pregnancy due to failed female tubal ligation surgery – a procedure to close both fallopian tubes so sperm could not reach an egg to fertilise it. \n \nFour claims were for pregnancy due to failed male vasectomy and were all declined \"as there is no personal injury to the male client\", an ACC spokeswoman said. \n \nOf the 62 claims, 17 were accepted and while 45 were declined. \n \nThe total paid was $153,125 for the period ending July 31, 2015. \n \nFailed sterilisation claims made before May 2012 might have been declined because ACC did not consider pregnancy a personal injury, the spokeswoman said. \n \nThat was before a  2012 Supreme Court decision  ruled a woman who became pregnant following a failed sterilisation should have ACC cover, rather than sue the surgeon. \n \nGynaecologist Dr Keith Allenby, of the Counties Manukau District Health Board, denied any negligence, with his counsel arguing he had explained the risk of the procedure to his patient. \n \nThe failure rate for tubal ligation is one in 200. \n \nAs a result of the Supreme Court decision, ACC cover must be available to the mother for the physical effects of pregnancy as a result of treatment injury or sexual abuse. \n \nA breakdown of claims showed that just 10 claims had been accepted, while 24 had been declined since 2012. \n \nNo successful claims were made in the year to June 2015, while four claims were declined. \n \nAuckland region had the highest number of claims with seven, followed by Counties Manukau (6), Canterbury (5), Southern (5), Northland (5), and Waitemata (4). \n \nAll other regions recorded fewer than four claims, apart from South Canterbury, which recorded none. \n \nClaims were made at the district health board region where the treatment was provided and included both public and private facilities. \n \nFigures supplied by the Ministry of Health showed there were 1970 publicly-funded tubal ligation surgeries in 2013/14, down from 2674 in 2009/10. \n \nA spokesman said the ministry did not keep information on the number of failed sterilisation operations and referred inquiries to individual DHBs. \n \nOf the Official Information Act requests sent to all South Island-based DHBs on August 21, only one – the Southern DHB – responded with an answer as of Friday, saying it did \"not currently hold\" the requested information.  \n    \nLast month,  ACC confirmed it was appealing a decision awarding compensation to a woman who gave birth following a botched sterilisation operation. \n \nThe woman, who has permanent name suppression, gave birth to a son in June 2006, despite having a sterilisation procedure eight years earlier. \n \nThe surgeon clamped her bladder instead of a fallopian tube, resulting in the unwanted birth, and she was forced to give up work to care for the child. \n \nPeter Sara, a specialist in accident compensation law, won a  landmark decision against ACC  that effectively awarded her weekly compensation, as the 2012 Supreme Court decision meant she could not sue the doctor or DHB. \n \nHe had since been contacted by other women in a similar position. \n \nSara did not agree with how ACC interpreted the Allenby case. \n \n\"This was a landmark decision, which determined that pregnancy was a personal injury which was able to be covered. It was not confined to just the physical effects of pregnancy.\" \n \nHe said ACC wanted to treat such cases as being confined to the literal state of pregnancy, so that entitlements were limited to those which might arise during the gestation period. \n \nThe product of pregnancy was the birth of a child or children but the Allenby decision did not address the issue of entitlements following birth, such as child care costs, because that was not before the Court. \n \n\"Just as an injured person is entitled to be covered for the physical and mental consequences of accidental injury, so too is the woman whose pregnancy is covered,\" Sara said. \n \n\"ACC is not entitled to cherry pick which entitlements it will provide.\" \n  \n- Stuff \n             \r     Comments", "source": "Timaru Herald"}