{"published": "2015-09-22T09:03:03Z", "media-type": "News", "title": "Broadway art dealership announces its partnership with WellChild", "id": "adfdc23f-131d-41a5-aad3-507c17a03294", "content": "BROADWAY-based art dealership Trinity House Paintings has chosen Cheltenham-based charity for sick children, WellChild, as a chosen charity. \n \nTrinity House will be donating art pieces to WellChild events, giving tickets to exclusive exhibitions, supporting WellChild through their own events as well as organising ‘meet the artist’ sessions. \n \nTo celebrate the launch of the partnership contemporary British artist Neil Heylard held an art tutoring session on Friday September 18, for two of WellChild’s young ambassadors, Lydia Mena and James Bayliss at Trinity House Art Gallery. Both are studying A level Art at Balcarras School in Cheltenham and were delighted to spend time with and learn from such a successful artist. \n \nTrinity House is an international art dealership specialising in Impressionist, Post-Impressionist, Modern British and 19th century works. It has built up a strong reputation both for the quality of the paintings, drawings and sculpture that it exhibits and for the expertise that it can offer to clients. \n \nNeil Helyard was in the Trinity House Broadway gallery on September 18 and 19 for the preview of ‘In the Eye of the Beholder’, an exclusive exhibition of his works. The exhibition continues until 25th October. \n \nTrinity House Director Steven Beale said: “We are thrilled to announce our partnership with WellChild. The Neil Helyard art tutoring session for these WellChild Young Ambassadors provided a wonderful opportunity to celebrate this new partnership. We look forward to continuing to support this fantastic charity in the future in many different ways.” \n   \n Share article  \n   \nColin Dyer, WellChild chief executive said: “We are delighted to have the support of Trinity House, it is fantastic to have such a high-profile and successful organisation behind us that is based in our home area. And we can’t wait to see how the partnership develops.” \n \nWellChild provides essential and practical support to ensure that the increasing number of seriously ill children and young people in the UK have the best possible quality of care.", "source": "Worcester News"}