{"published": "2015-09-03T08:00:46Z", "media-type": "Blog", "title": "How to sell a tale: the power of stories in marketing", "id": "7101bef3-b0fa-4c74-b38d-4fec7eea9db5", "content": "C ustomers want to know they are making ‘the right decision’ with each purchase, but deciding what’s ‘right’ isn’t just about facts and figures. People also make decisions based on feelings and instincts that you can’t address with a bullet point  or sales brochure. \n \nSometimes you can address these feelings and instincts with statistics and case studies. More often, however, a story, fictional or otherwise, can persuade in ways which facts won’t and communicate brand value that case studies can’t. \n I second that emotion: the power of fiction  \nBen Settle, in his article for Copyblogger , uses the movie Top Gun as an example of a story with power. While the movie played in theatres, sales of aviator sunglasses skyrocketed along with U.S. Air Force and Navy recruitment levels. \n \nThis wasn’t because the movie told people they should wear aviators or sign up to serve in the military. Not one case study or statistic was written into the script. Rather, the story influenced the audience. But how? \n \n‘Fiction seems to be more effective at changing beliefs than writing that is specifically designed to persuade through argument and evidence,’ explains Jonathan Gottschall in his article,  Why storytelling is the ultimate weapon . \n \nHe goes on to say that, according to studies, when we read facts, we keep our guard up, looking for inconsistencies and missteps. However, a story disarms us and we ‘drop our intellectual guard.’ When we hear a story, we look for ways to map it to our own experience. \n Storytelling for marketers  \nAccording to Entrepreneurial Insights , for marketers, storytelling is ‘the process of making a connection with the customer first, and selling a product second.’ \n \nStories in marketing, where the customer is first and selling is secondary, take a few different forms  such as: \n  Origin stories of your company, its people or it products  Customer experience stories like case studies, testimonials and reviews  Stories in ads and campaigns which showcase your brand values   \nThe first two types, the non-fiction, are easier to create. It’s the fictional stories, the creative works, which require a little more attention. Take a moment to watch the Google ad below (one of my favourite brand stories) from 2013: \n  \nNot one feature is listed and no pitch is made, but that doesn’t render the message ineffective – quite the contrary. You’ve probably heard the phrase ‘show, don’t tell.’ When we use creative stories in marketing, we show, instead of telling customers why our brand is the right decision. \n \nAs Christopher Penn puts it , ‘No child will ever ask you to read them a press release at bedtime. They want you to tell them a story. So do your customers.’ \n What gives a story its power?  \nIt’s one thing to know that stories have power and that stories sell. You also have to know how to practically apply this to your marketing campaigns. Stories in marketing, whether fiction or non-fiction, require a few foundational elements of story to carry weight: character, conflict and theme. \n \nQuestions of character \n \nIn Top Gun, Ray-Ban didn’t sell aviators –  Maverick did . Stories are nothing without characters. Additionally, stories are nothing if their characters are not strong and dynamic. So, how do you build character into your marketing campaigns? \n  Characterise the customer. Toby talked about marketing to people, not stereotypes . It starts with how you use your buyer persona. Customers are not just spectators of your campaigns. They should play a central role in them. Otherwise, how do you expect the customer to map your stories to their own experience and engage with your brand?  Characterise your brand. Is your brand the hero of the story? Or does your product enable you customer to be the hero? Is your brand the sage providing guidance or the funny sidekick? What part does your brand play in the customer’s story?  Characterise the pain points. Consider the character Mayhem in Allstate’s long-running campaign in the U.S . He personifies the natural disasters, accidents and mishaps that happen to the company’s customers. Can your customer’s pain points manifest themselves as a character in your story?   \nIt’s important to note that your brand plays the supporting role . The customer should always be the focus. \n \nKnow the struggle \n \n‘Every character should want something,’ according to Kurt Vonnegut. ‘Even if it is only a glass of water.’ Your customers, the main character in any marketing story you tell, want something and you should be talking about this in every campaign. \n \nIn stories, the conflict, whether it’s man v. man, man v. society or otherwise drives the plot. In the same way, the conflict, pain point, need or want your customer faces should drive your campaign. In marketing, this typically appears as: \n  Brand v. brand  Customer v. pain point  Customer v. need   \nYour job as a marketer is to identify the conflict whether it’s finding the better brand or resolving pain point x, y or z. You form stories by introducing the conflict, showing the adoption of your product or service and then the benefits gained by doing so. \n \nSend a message \n \nThe theme of the story is the underlying message. For marketers, theme matters in campaigns because it speaks to your brand’s values. You might identify your campaign themes by looking at your: \n  Brand slogan. In 1988, Nike formed the ‘Just do it’ campaign . The simple, but powerful message, still found in their campaigns, took them from millions in profits to billions in ten years. Every campaign tells a story of an athlete pushing through pain and obstacles to ‘just do it.’  Campaign tagline. Consider Volkswagen’s 1959 campaign which used the slogan ‘Think small.’ That phrase tells the story of a brand that bucked the tradition of luxury cars of the time and wanted buyers to do the same.  Product benefits. Why does your brand do what it does? How do they do it better? It cannot be stressed enough that features don’t sell, but stories which convey the benefits of your brand do .   \nOnce you know what message you want to convey, you can ensure each chapter of each story in each campaign reinforces that message. \n Stories in marketing can change the world  \nLists of products, features and prices are forgettable. Characters connect with customers, the conflicts relate to their needs and the themes remind them why your brand is one they can get behind. \n \nFact or fiction, stories connect with your customers’ emotions and persuade in a way that facts can’t. Gottschall writes , ‘We are creatures of story, and the process of changing one mind or the whole world must begin with “once upon a time”.’ \n \n \n \n \n(Hat tip to Christian Schnettelker for the photo)", "source": "Articulate"}