{"published": "2015-09-04T05:09:21Z", "media-type": "News", "title": "Mental glitch that’s making us spend", "id": "f08d7091-5bbd-4bcd-9144-2924754ae88a", "content": "Psychologists have identified a mental glitch that exposes us financially. Photo: Robert Zuckerman Touchstone Pictures and Jerry Bruckheimer, Inc.  Source: Supplied  \n        \n THOUSANDS of struggling Australians are trapped in a debt vortex with cards maxed out and no way of getting out of the red.  \n   \nThe Consumer Action Law Centre’s financial counselling helpline receives more than 5000 calls a year from people struggling with credit card debt, with 50 per cent facing bills of more than \n\n$10,000. \n\n“Every week, we hear from someone with credit card debt exceeding $100,000,” said the centre’s policy officer Katherine Temple told the Federal Government’s credit card inquiry, which held its second hearing in Melbourne yesterday. \n\nAnd it’s not just the vulnerable or uneducated who are at risk of being sucked in, she said; a simple psychological glitch puts us all at risk. \n\nThe “optimism bias” kicks in when we are weighing up our options to make a purchase or financial decision. \n      \n That Gucci bag isn’t going to pay for itself.  Source: Supplied  \n    \nPut simply, it means that we over-estimate our ability to pay for something in the future if we don’t have to worry about it for the time being. \n\nIt makes us less likely to care about a higher interest rate that will kick in 12 months down the track, or to factor in the possibility that an unforeseen disaster could obliterate our ability to pay. \n\n“It’s quite calculated,” said Ms Temple. \n\n“We need structural change, to make sure people aren’t being given credit cards that they can’t afford to repay.” \n\nMs Temple said tougher lending rules were needed, to stop banks from heaping massive debt on people who would never be able to pay them off. \n\n“The optimism bias means that we have a tendency to over-estimate our capacity to pay,” she said. \n\n“That’s why balance transfers are so attractive — it’s basically free money (in people’s minds).” \n\nThe Australian Securities and Investments Commission acknowledged this phenomenon in its submission to the inquiry, noting: that “people with strong optimism or present biases might begin with the intention of always paying off their balance in full and, based on this intention, may disregard the interest rate on a card in the belief they will not need to pay any interest.” \n     \n If Carrie Bradshaw was real, there’s a fair chance she’d be calling a debt crisis line.  Source: News Corp Australia  \n    \nConsumer advocates say the banks are taking advantage of human nature, profiting from the mental glitch that leaves us vulnerable. \n\nMs Temple said that along with clearer product descriptions, credit card providers should be forced to base their eligibility assessment on whether the customer can pay off the maximum limit in full, to account for consumers’ behavioural biases. \n\n“At the moment, it’s based on whether you can pay the monthly minimum,” she said. \n\n“So if something happens — like job loss, or you get sick, or you have a relationship breakdown — you can find yourself in trouble.” \n\nLike Carl Cavarra, the out-of-work tradie who is facing potential bankruptcy over a $90,000 debt. \n\nThe 34-year-old owes thousands on five different credit cards, on top of a hefty car loan, all approved while he was working fulltime as a bricklayer. \n\nAnd while he was able to afford the minimum payments on these debts while employed, a bad turn of luck left him stuck in a debt spiral. \n\nAfter seven years of physical labour, the bricklayer suffered a triple hernia that required surgery, bed rest — and left his earning capacity in limbo. \n\nDespite incurring the injury through repeated heavy lifting on the job, Mr Cavarra said, WorkCover deemed his case one of “wear and tear”, so he received no compensation. \n\nOn doctor’s orders, he abandoned his career, moved back in with his parents and started an unsuccessful 10-month search for a new job. \n     \n Melbourne’s Carl Cavarra is facing potential bankruptcy over his $90,000 debt.  Source: NewsComAu  \n    \nUnable to make his $1600 monthly loans repayments while living on a $489 a fortnight Centrelink allowance, Mr Cavarra found himself racking up even more debt by putting his living expenses on his credit cards — which have interest rates of between 18 and 23 per cent. \n\nIn the end, the cards were maxed out and the creditors came knocking. \n\n“I’ve asked to consolidate my debts so I can make one payment, but the banks refuse,” he said. \n\n“They want it paid off in five years, but that’s impossible.” \n\nWithout a job — despite having applied for hundreds this year — he was not eligible for a balance transfer. \n\n“I reckon if I don’t find a job by the end of this year, I will have to go bankrupt. I don’t want to do that.” \n\nIt’s this situation that the Consumer Action Law Centre argues should be prevented by more stringent lending rules. \n\nWhile it may have been imprudent for Mr Cavarra to saddle himself with so much debt, not giving himself leeway for unforeseen circumstances that could impact his ability to pay, he is far from alone. \n\nAustralians owe a collective $32 billion on their credit cards , with the average card holder paying $700 a year in interest on debts that hover around $4,300. \n\nAnd many of them have no idea how much interest rate they are paying; a survey of 2200 credit card users by ME bank found that 73 per cent did not know their interest rate and 40 per cent did not know if their card had an annual fee. \n\nInquiry chairman and Labor senator Sam Dastyari accused the banks of running a “confusopoly”, with credit cards marketed in a way that makes it hard for consumers to work out whether they are getting a good deal, amid all the bells and whistles of reward points schemes and promotions. \n\nConsumer group Choice called for credit card advertising to include the monthly cost for a consumer with an average card balance, in dollars, based on the interest rate and annual fee. \n\nThe credit card inquiry will report its finding to the Senate Economics References Committee by November 24. \n\nIf you are struggling to pay your debts, you can speak to an independent financial counsellor free of charge by phoning 1800 007 007. \n\ndana.mccauley@news.com.au \n Originally published as Mental glitch that’s making us spend", "source": "Geelong Advertiser"}