{"published": "2015-09-04T16:00:27Z", "media-type": "Blog", "title": "Sherman: Yankees not looking to add first base help this month", "id": "f8b351a3-9b1a-4b17-b632-6a2f3131a9be", "content": "(Jim Rogash/Getty)  \nEven though Mark Teixeira will be sidelined for at least another two weeks and Greg Bird occasionally looks like he’s in over his head as a big league regular, Brian Cashman told Joel Sherman he is not looking to add first base help right now. Cashman essentially said they won’t be able to find anything better than what they currently have. \n \nNow that we are in September, any player the Yankees acquire will not be eligible for the postseason roster. There are no exceptions whatever. The deadline to acquire a player and have him be postseason-eligible was midnight Monday and the Yankees did not add anyone. Their only notable in-season trade pickup this year was Dustin Ackley . \n \nThat said, the Yankees could still make a trade and add a player to help for the rest of the regular season. You’ve got to first get to the postseason before you can worry about the postseason roster, right? The Yankees have done this recently too — two years ago they acquired Brendan Ryan from the Mariners in mid-September when Derek Jeter went down with an injury. \n \nAt this point though, the trade market is barren. Sherman tossed out the idea of Chris Carter or Casey McGehee as potential platoon partners for Bird, but yuck. Mike Olt was designated for assignment a few days ago and could be another option, but again, how much is he moving the needle? Acquiring any of those three guys would be trying to catch lightning in the bottle, nothing more. \n \nHopefully Teixeira’s bone bruise heals up soon and he can return to action within that two-week timetable. Until then, I say stick with Bird. He’s held his own against lefties so far. The alternatives are not good at all. Cashman’s not looking for first base help and there’s no first base to be had anyway. Let the kid show what he can do.  This is Bird’s time to shine. \n \n\n \n(The GIF was dumped in the comments a few weeks ago and I have no idea who to credit.) \n \nThe post Sherman: Yankees not looking to add first base help this month appeared first on River Avenue Blues .", "source": "River Avenue Blues"}