{"published": "2015-09-13T15:34:11Z", "media-type": "Blog", "title": "Please. Come home.", "id": "28c78c76-6b29-47d1-9e1e-f33fc7a2307b", "content": "Next week it's one year since we were told there was no hope. Sure, we'd been told that since day 1. But on the 16th of September 2014 it became real. The doctor said the dreaded words: \"I think it's time to stop all treatments. We've bought all the time we could.\" After that my mum said the words that broke my heart into a million pieces. \"So now all we can do is wait.\" I will never forget my stupid, philosophical attempt at being positive: \"No mum, now all we can do is live.\"\nI do this thing when. I am absolutely obsessed with tv-shows. And I can re-watch some of my favourite shows over and over again. Sometimes in full. Sometimes I fast forward through the boring parts of various episodes. And then I can re-watch one scene several times. I just keep rewinding, and watch it again. To keep that moment alive just for a few seconds longer. I wish I could do that. I try to do that. Sometimes, when I'm lying on my sofa, or walking in the forest, I will re-live those days. Those months. The laughs and the tears, between the 16th of September and the 19th of November. Those two months are so unreal to me. So much happened. But at the same time everything was paused. There are certain moments during those two months that I wish I could re-live again, and again, and again. And it's not just the good parts. I want to have the bad ones too. I want all of it. The pain. The tears. The screams.\nBecause that would mean that I wouldn't walk around town searching for her face. It would mean that I wasn't desperate to hear her voice. It would mean that she'd be here.\nI went to the cemetery today. And I cannot get it through my head that that is the place I go to visit my mum. It's soon been a year. But I just can't get used to it. So instead I beg. I beg for her to come home soon. Because I miss my mum. And my heart is shattered in a million pieces because she's not here. And I don't know how to live my life anymore. I need my mum. And please, please, please. come home soon.", "source": "Timon's Nest"}