{"published": "2015-09-21T05:43:59Z", "media-type": "News", "title": "Vegas-bound for local bodybuilder", "id": "708337eb-6abc-4633-a122-16f82cf851da", "content": "Mandurah personal trainer Steve Morley is on his way to Las Vegas after impressing at recent body building competition. \n\nMANDURAH personal trainer Steve Morley is on his way to Las Vegas after impressing at recent body building competition. \n\nAfter finishing first in three categories at an International Natural Bodybuilding Association event on September 5, the 22-year-old tried his luck at the Professional Natural Bodybuilding Association (PNBA) Qualifier event the following week.\n\nOnce again Morley impressed, placing third to book a place in an international event in Las Vegas in November.\n\nIt was a great achievement for someone who is only in his first year of body building.\n\nMorley said he was excited to be travelling to America, just the second time he has been outside of Western Australia.\n\n“I just wanted to see how far I could go,” he said.\n\n“After winning the INBA competition I got talked into entering the following week [PNBA competition].”\n\n“I don’t know what to expect, I will just go over to Las Vegas and see how I go.”\n\nMorley said he got involved in the sport through his girlfriend.\n\nHe said she was entering her first competition in May and was going through the full 12-week training program.\n\n“She has organised to do a photo shoot and wanted me in them as well so I thought I better get leaner,” the Body-a-Peel personal trainer said.\n\n“From there I got talked into getting up on stage [at the competition in May].”\n\nMorley placed third and fourth in the competition, his first, which prompted him to continue in the sport.\n\n“I’ve always been into the fitness industry and like a challenge,” he said.\n\nThis time Morley completed the 12-week program, training seven days a week, with the results paying off.\n\nAt competition on September 5 Morley placed first in the men’s fitness novice division, the men’s fitness open division and won overall.\n\nMorley’s sister Sarah also competed in her first event on the day, placing fifth, fourth and second.\n\nThe story first appeared on Mandurah Mail.", "source": "Collie Mail"}