{"published": "2015-09-18T16:03:12Z", "media-type": "News", "title": "Lowe's Donates $250,000 To Red Cross Disaster Relief To Help Communities Impacted By California Wildfires", "id": "a62ab2d9-916c-42db-95a2-e4440fa01ab8", "content": "]]> \n\n\n\n\n\nMOORESVILLE, N.C. , Sept. 18, 2015 /PRNewswire/ -- In response to the wildfires in California , Lowe's announced today it will donate $250,000 to American Red Cross Disaster Relief . The donation will help provide food, shelter and comfort to those impacted by the growing wildfires and countless other disasters big and small. \n\nTwo of the largest fires in the state, the Valley Fire and the Butte Fire in Northern California , have collectively burned more than 144,000 acres in less than a week; they have destroyed nearly 1,000 structures, including many homes, and displaced more than 20,000 individuals. Thousands of structures are still at risk. \n\n\"Our thoughts are with the thousands of residents, including Lowe's employees, who've been affected by the widespread fires,\" said Joan Higginbotham , Lowe's director of community relations. \"We'll continue to work internally and through great partners like the American Red Cross to be there to help them recover and provide relief.\"  \n\nRed Cross volunteers are working around the clock to help, including 250 Red Cross volunteers and staff members. As of Friday, September 18 , the Red Cross has served more than 32,000 meals and snacks and supported nearly 5,500 overnight stays in shelters. Local Lowe's Heroes employee volunteers stand ready in the affected communities to support recovery efforts. \n\n\"Lowe's is a longtime supporter of the American Red Cross, and we are so grateful for its ongoing support of our disaster relief operations,\" said Brad Kieserman , vice president, disaster services operations and logistics. \"The devastation of this wildfire season – particularly the latest fast-moving, all-consuming fires in California – required an immediate response by the Red Cross and will necessitate an ongoing delivery of humanitarian services; we simply couldn't do this work without the generosity of donors like Lowe's.\" \n\nAs a member of the Red Cross' Annual Disaster Giving Program, Lowe's pledges donations on an ongoing basis in advance of disasters to help ensure the Red Cross can take immediate action. Individuals can team with Lowe's and the American Red Cross to provide assistance by donating at Lowe's American Red Cross Online Donation Site , by texting the word REDCROSS to 90999 or calling 1-800-RED CROSS (1-800-733-2767). Since partnering with the Red Cross in 1999, Lowe's and its customers have contributed more than $25 million for disaster relief. \n\nDonations to Red Cross Disaster Relief are used to help people affected by disasters big and small. Gifts enable the Red Cross to prepare for, respond to and help people recover from disasters. \n\nABOUT LOWE'S IN THE COMMUNITY \nLowe's, a FORTUNE ® 50 home improvement company, has a 50-year legacy of supporting the communities it serves through programs that focus on K-12 public education and community improvement projects. Since 2007, Lowe's and the Lowe's Charitable and Educational Foundation together have contributed more than $225 million to these efforts, and for more than two decades Lowe's Heroes employee volunteers have donated their time to make our communities better places to live. To learn more, visit Lowes.com/SocialResponsibility and LowesInTheCommunity.tumblr.com . \n\nABOUT AMERICAN RED CROSS : \nThe American Red Cross shelters, feeds and provides emotional support to victims of disasters; supplies about 40 percent of the nation's blood; teaches skills that save lives; provides international humanitarian aid; and supports military members and their families. The Red Cross is a not-for-profit organization that depends on volunteers and the generosity of the American public to perform its mission. For more information, please visit redcross.org or visit us on Twitter at @RedCross . \n\nPhoto - http://photos.prnewswire.com/prnh/20150918/268028 \nLogo - http://photos.prnewswire.com/prnh/20131007/MM93272LOGO   \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/lowes-donates-250000-to-red-cross-disaster-relief-to-help-communities-impacted-by-california-wildfires-300145617.html \n\nSOURCE  Lowe's", "source": "Sys-Con Italia"}