{"published": "2015-09-11T18:02:00Z", "media-type": "News", "title": "SBA Economic Injury Disaster Loans Available in Vermont Following Secretary of Agriculture Disaster Declaration", "id": "1b0e71f9-ceb2-485f-8a17-3fdec2d4d385", "content": "ATLANTA , Sept. 11, 2015 /PRNewswire-USNewswire/ -- The U.S. Small Business Administration (SBA) announced today that federal Economic Injury Disaster Loans are available to small businesses, small agricultural cooperatives, small businesses engaged in aquaculture and private nonprofit organizations located in Vermont  as a result of excessive rain, high winds, hail, lightning, and a tornado from May 1 through July 14, 2015 . \n\nThe disaster declaration includes the following counties: Addison , Chittenden and Grand Isle in  Vermont . \n   \n\"These counties are eligible because they are contiguous to one or more primary counties in New York .   The Small Business Administration recognizes that disasters do not usually stop at county or state lines. For that reason, counties adjacent to primary counties named in the declaration are included,\" said Frank Skaggs , director of SBA's Field Operations Center East in Atlanta . \n\nUnder this declaration, the SBA's Economic Injury Disaster Loan program is available to eligible \nfarm-related and nonfarm-related entities that suffered financial losses as a direct result of this disaster.  With the exception of aquaculture enterprises, SBA cannot provide disaster loans to agricultural producers, farmers, or ranchers.  \n\nThe loan amount can be up to $2 million with interest rates of 2.625 percent for private nonprofit organizations and 4 percent for small businesses, with terms up to 30 years.  The SBA determines eligibility based on the size of the applicant, type of activity and its financial resources.  Loan amounts and terms are set by the SBA and are based on each applicant's financial condition.  These working capital loans may be used to pay fixed debts, payroll, accounts payable, and other bills that could have been paid had the disaster not occurred.  The loans are not intended to replace lost sales or profits. \n\nApplicants may apply online using the Electronic Loan Application (ELA) via SBA's secure website at https://disasterloan.sba.gov/ela . \n\nDisaster loan information and application forms may also be obtained by calling the SBA's Customer Service Center at 800-659-2955 (800-877-8339 for the deaf and hard-of-hearing) or by sending an email to disastercustomerservice@sba.gov .  Loan applications can be downloaded from the SBA's website at www.sba.gov/disaster .  Completed applications should be mailed to: U.S. Small Business Administration, Processing and Disbursement Center, 14925 Kingsport Road, Fort Worth, TX 76155.  \n\nCompleted loan applications must be returned to SBA no later than May 9, 2016 . \n\nFor more information about the SBA's Disaster Loan Program, visit our website at www.sba.gov/disaster . \n\nRelease Number: 15-363, NY 14464 \n\nContact:  Michael Lampton \nEmail: Michael.Lampton@sba.gov \nPhone : (404) 331-0333 \n\nLogo - http://photos.prnewswire.com/prnh/20110909/DC65875LOGO \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/sba-economic-injury-disaster-loans-available-in-vermont-following-secretary-of-agriculture-disaster-declaration-300141694.html \n\nSOURCE  U.S. Small Business Administration", "source": "SearchBug"}