{"published": "2015-09-03T09:37:33Z", "media-type": "News", "title": "SP walk-out of Grand Alliance: More psychological dents than physical", "id": "498d665b-1b97-4e23-b8d7-23e4bd6abdbf", "content": "The Samajwadi Party (SP) does not have a presence in Bihar and Nitish Kumar and Lalu Prasad could not have afforded to give the party more than 10+ seats for practical reasons.… \r \nThe Samajwadi Party (SP) does not have a presence in Bihar and Nitish Kumar and Lalu Prasad could not have afforded to give the party more than 10+ seats for practical reasons. \n\nWritten by Santosh Singh | Patna | Updated: September 3, 2015 3:01 pm \n\nSP was not given any seat in the first seat-sharing exercise; it was given five seats on second thoughts which led to the state unit’s open rebellion. \n\nSamajwadi Party walking out of Janta Parivar or Bihar’s Grand Alliance will create more psychological dents than physical ones. The Samajwadi Party (SP) does not have a presence in Bihar and Nitish Kumar and Lalu Prasad could not have afforded to give the party more than 10+ seats for practical reasons. SP was not given any seat in the first seat-sharing exercise; it was given five seats on second thoughts which led to the state unit’s open rebellion. \n\nHowever, this is not about the Bihar polls: the bigger message is about the dismantling of the Janta Parivar that had not taken off despite SP chief Mulayam Singh Yadav being declared president of the unnamed and non-merged unit. SP was upset at more than one thing – there was no poster of Mulayam Singh Yadav on the Grand Alliance posters, he was not consulted before seat-sharing, he was not kept in the loop about the first Grand Alliance rally and he was not asked if his party was comfortable sharing dais with Congress president Sonia Gandhi \n\n. \n\nFor precisely these reasons, Mulayam Singh Yadav chose to back out of Patna rally and send his brother Shivpal Yadav to represent him. The SP chief had sent a message with his absence but Lalu and Nitish camp did not get the message. \n\nRJD and JD (U) leaders have gone into rapprochement mode. It is possible that the SP could be conce…", "source": "MyInforms"}