{"published": "2015-09-02T16:17:07Z", "media-type": "Blog", "title": "How to Get the Best Seat on the Plane", "id": "f8ce2cfd-95f7-44ec-ae5b-330d24eb75c1", "content": "Traveling on a plane can come with a slew of seat-based comfort challenges, whether you’re assigned to a seat that doesn’t recline or located just adjacent to the bathroom. If you want to get the best seat without having to pay extra cash, there are a few simple tips to follow. While you might not feel like you’re lounging in a featherbed in one of the many luxury hotels in Milan, you will optimize your chances of having a travel experience that’s comfortable, pleasant and relaxed. 1. Don’t Pre-Select Seats Many flyers are tempted to pre-choose seats when they book their plane flights on Hipmunk. However, it’s best to actually let the airline assign you seats when you check in; particularly for full flights. Airlines cannot require you to pay for premium seats if they are the only spots available. If you wait until everyone else on the plane has chosen a seat, there’s a good chance that one of the premium seats will be assigned to you at no cost. 2. Volunteer to Sit in an Emergency Exit Flight attendants need to fill emergency exit rows with capable passengers who can assist in an emergency. If you feel physically fit, you can volunteer to move to an exit row if flight attendants are looking to fill the seats (or swap someone out who is not qualified). Sitting in an exit row affords you a lot of extra leg room. It’s also often is an emptier row, as airlines usually pre-charge an extra fee to sit there. 3. Fly During the Middle of the Week Statistics show that the smallest number of travelers fly on Tuesdays and Wednesdays. To ensure you have the most room on the plane–and the biggest selection of great seats–fly during the work week. 4. Take Seats Freed by Upgrades Once you board a plane, some may opt to pay extra for first class or business class seats. Ask if you can take the seats they left empty. Many of these seats will have been occupied by frequent flyers or business travelers, which means that you might earn yourself a premium seat with extra legroom, greater recline or other great features. No matter whether you’re crossing a few state lines or the Pacific Ocean, having a comfortable seat can ensure you have a restful and pleasant flight. By following a few simple tips, you can find yourself the best seat possible without forking over any extra dough.", "source": "Tailwind by Hipmunk"}