{"published": "2015-09-13T16:27:51Z", "media-type": "News", "title": "China unveils details of state-firm reforms as growth sputters Reuters", "id": "c6017582-3fa5-49a2-891a-986aae1c2cad", "content": "By Kevin Yao and Lei Wang \n \nBEIJING (Reuters) - China unveiled details on Sunday of how it would restructure its state-owned enterprises (SOEs), including partial privatization, as data pointed to a cooling in the world's second-largest economy. \n \nThe guidelines, jointly issued by the Communist Party's Central Committee and the State Council, China's cabinet, included plans to clean up and integrate some state firms, the official Xinhua news agency said. It did not elaborate. \n \nReform of underperforming state-owned enterprises is one of China's most pressing needs. But if not handled well, the restructuring could lead to hundreds of thousands of people being laid off and social instability. \n \nXinhua said the plans included introducing \"mixed ownership\" by bringing in private investment, and \"decisive results\" were expected by 2020. \n \nThe government will not force \"mixed ownership\", nor will it set a timetable, giving each firm the go-ahead only when conditions are mature, it said. \n \n\"This reform will be positive for improving the impetus of the economy and making growth more sustainable,\" said Xu Hongcai, director of the economic research department at the China Centre for International Economic Exchanges (CCIEE), a Beijing-based think-think. \n \nPartial privatization, he added, would help establish \"check-and-balance and incentive systems\" at state firms. \n \nChina's government manages 111 companies centrally under the State-owned Assets Supervision and Administration Commission, or SASAC. Local governments own and manage around 25,000 state-owned companies and the sector employs nearly 7.5 million people. \n \nState firms will be allowed to bring in \"various investors\" to help diversify share ownership, and more state firms will be encouraged to restructure to pave the way for stock listings, Xinhua said. \n \nPrivate investors will be encouraged to buy stakes in state firms, buy convertible bonds issued by state firms, or swap shares with state firms, it said, adding steps will be taken to curb corruption during reforms. \n \nSOEs will be divided into commercial and public welfare-related businesses during the reform process. Oil and gas, electricity, railways and telecommunications were identified as sectors that could be suitable for limited non-state investment. \n \nHowever, Beijing will have to persuade entrenched interests at local, provincial and national governments to relinquish some control over state enterprises and attract investors to buy shares after one of the worst stock market crashes in China's history. \n \n \nMISSED FORECASTS \n \nAnd Xinhua indicated full-scale privatization was not on the cards, saying the government was aiming to \"cultivate a large number of state-owned backbone enterprises with innovation capability and international competitiveness\". \n \nThe guidelines called for a flexible and market-based compensation system at state firms by linking pay with company performance. \n \nThe details were issued after the government said growth in China's investment and factory output missed forecasts in August. The data followed weak trade and inflation readings, raising the chances that economic growth may dip below 7 percent in the third quarter for the first time since the global financial crisis. \n \n\"Overall, the economy is very weak and the central bank may have to continue cutting interest rates and banks' reserve requirement,\" said Zhou Hao, senior economist at Commerzbank AG in Singapore. Zhou says growth would probably dip below 7 percent in the July-September quarter. \n \nSome economists believe growth is already much weaker than official data suggests. \n \nAugust power output, for example, rose just 1 percent year-on-year, and production of key industrial commodities such as steel and coal weakened. \n \nGrowth in fixed-asset investment, a crucial economic driver, slowed to 10.9 percent in the first eight months of 2015 - the weakest pace in nearly 15 years, National Bureau of Statistics data showed on Sunday. \n \nAnalysts in a Reuters poll had forecast an 11.1 percent rise, compared with 11.2 percent in January-July. \n \nFactory output rose a weaker than expected 6.1 percent in August from a year earlier. Markets had expected a 6.4 percent increase, up from July's 6.0 percent. \n \nAnnual growth in real estate investment also continued to cool to 3.5 percent in the first eight months, the weakest since early 2009, from 4.3 percent in January-July. \n \nWhile home sales and prices are slowly recovering from a slump last year - property area sold rose at a slightly faster pace of 7.2 percent in January-August - analysts say it will take time for developers to work off a huge overhang of unsold houses. \n \n \nSINGLE POSITIVE \n \nRetail sales were the single positive surprise, growing 10.8 percent in August from a year earlier and above forecasts of 10.5 percent, the same as July. \n \nBut the increase did not appear to chime with corporate reports of slowing sales. \n \nChina's yuan devaluation in August and a plunge in stock markets since June have fueled fears of more economic shocks, although Premier Li Keqiang has brushed off concerns of a hard landing. \n \nMost analysts say the economy is slowing gradually, but not facing a hard landing. \n \nChina's central bank has cut interest rate five times since November and repeatedly relaxed banks' reserve requirements (RRR) to try to boost the sputtering economy. \n \nFurther policy easing is widely expected and the government is trying to boost infrastructure investment. \n \nThe government is aiming for 2015 economic growth of around 7 percent, which would be the slowest in a quarter century. \n \n \n(Writing by Raju Gopalakrishnan; Editing by Neil Fullick and Greg Mahlich)", "source": "Yahoo! Finance"}