{"published": "2015-09-18T18:48:00Z", "media-type": "Blog", "title": "9 design and animation skills you can learn for $29", "id": "f8befcba-b2b5-4e8c-aebb-6cec91d8fa99", "content": "9 design and animation skills you can learn for $29\rCategory: Uncategorized\rTags: animation, design, learn, skills\rLeave a Comment\rUltimate Design + Animation Bundle Facebook\nTwitter\nPintrest\nLinkedIn\nGoogle+\nMail Comment Whether you want to start a career in design, computer animation, or game development, just want to round out your skillset, knowing your way around industry-standard programs is essential. So we’re offering a deal that makes it easier (and cheaper). Pick up access to eduCBA’s library of design and animation courses taught by industry pros for just $29 (£19) at Pocket-lint Deals. Saving you 98 per cent off the usual price for eduCBA’s courses, this deal is one you can’t miss if you work in the design, animation, or game development industries. Grab it now and get over 60 courses on: Photoshop InDesign MAYA Flash Audition AutoCAD Cinema 4D Unity 5 ZBrush …and more! This deal gets you lifetime access to the courses currently available, as well as any that eduCBA adds in the future, so you’re always adding new skills and sharpening old ones. All courses give you access to industry experts via online support, so you can ask real people (not Google) for help when stuck. Don’t miss your chance to launch – or supercharge – your career with lifetime access to these courses at Pocket-lint Deals. Published: 18 September 2015 23:48\nComment\nFacebook\nTwitter\nPintrest\nLinkedIn\nGoogle+\nMail Pocket-lint Promotion Articles 9 design and animation skills you can learn for $29 Best TV and movies to watch this weekend on Netflix, NOW TV and more: Gamechangers, Narcos… Pay what you want for 12 essential WordPress courses This is the first Apple Store designed by Jony Ive Popular In Online On Pocket-lint 9 design and animation skills you can learn for $29 Pay what you want for 12 essential WordPress courses This is the first Apple Store designed by Jony Ive A Facebook dislike button is actually happening Browse the web securely for life Even Flickr is jumping on the VR bandwagon, view 360-degree photos on Oculus Got $50? Supercharge your IT, programming, or design career Thank you interwebs for this brilliant Jony Ive soundboard iOS 9.1 includes new emoji like a taco and the middle finger BBC's Make it Digital season opens: Here's what's coming to TV, radio and online iOS 9 tips and tricks: See what your iPhone and iPad can do now Best TV and movies to watch this weekend on Netflix, NOW TV and more: Gamechangers, Narcos… Google Chromecast 2 release date, rumours and everything you need to know Google's LG and Huawei Nexus phones to be called Nexus 5X and Nexus 6P Amazon Fire TV 4K Ultra HD: Embracing a new age for entertainment Apple iOS 9 review: New and innovative, or more of the same? We've only gone and built the Lego Mercedes-Benz AROCS 3245 Best smartwatches to look forward to in 2015 BlackBerry Venice: The story so far on the Android BlackBerry You can buy Microsoft's Xbox One Elite controller starting next month Comments Source: www.pocket-lint.com", "source": "GADGET REVIEWS"}