{"published": "2015-09-10T20:52:04Z", "media-type": "News", "title": "Reynolds driven ‘crazy’ by need to...", "id": "5ba57b1f-e9a9-4ebd-8ea0-b8a9c2f2c029", "content": "MOTORSPORT: Larger than life larrikin David Reynolds admits he feels at ease when he's surrounded by \"crazy\" people. \n \nWhen you carry the nickname \"Crazy Dave\" though, that makes sense. \n \nThe 30-year-old sits in fourth position on the V8 Supercars drivers championship heading into the first of the Enduro Cup meets at Sandown this weekend. \n \nWhile most professional athletes these days prefer to relax away from their chosen sports - and speak in clichés to the media in order to maintain their focus - Reynolds loves to get a little mad. \n \nHis girlfriend - none other than former Big Brother housemate, model Tahan Lew Fatt - interrupted APN's interview with Reynolds, barking high-pitched instructions at the two-time V8 winner. \n \nBut that's exactly the way \"Crazy Dave\" likes it. \n \n\"She's crazy, but I love it. Gotta keep the missus happy,\" he said with a laugh, referring to the partner he met when she was a V8 Supercars grid girl. \n \nReynolds also enjoys plenty of chemistry in his friendship with co-driver Dean Canto, who will assist him during the Enduro Cup. \n \nThe long-distance schedule starts this weekend at Sandown, before heading to the famous Bathurst 1000 and Gold Coast 600, both next month. \n \nReynolds believes Canto is one of the best co-drivers not racing full-time. \n \nThey also get along like a house on fire. \n \n\"Dean's a lot shorter than me so it always looks a bit funny when it's time for a driver change. But he's great - this year will be his 17th start at Bathurst, so he's got a lot of experience,\" Reynolds said. \n \nHe also said the biggest challenge about racing at Sandown was the weather. \n \n\"It usually rains every couple of hours in Melbourne, but this weekend should actually be all right,\" he said. \n \n\"Sandown is a hard track to pass people on so you've got to be brave.\" \n \nReynolds has plenty of confidence the Enduro Cup can assist his campaign for a maiden V8 Championship title. \n \nHe sits only 282 points behind fellow Ford driver and series leader Mark Winterbottom, with the winner of Sunday's feature 161-lap race at Sandown to receive 300 points. \n \n\"I'm only 27 points off third place (Craig Lowndes), and the tournament is still up for grabs,\" Reynolds said. \n \nOff contract at the end of the season, he said he was confident of securing a new deal with Prodrive Racing Australia for next season, despite PRA's young gun Cameron Waters gunning for a seat. \n \n\"We're working on trying to cement something,\" Reynolds said. \n \n LEADING DRIVERS  \n \n1: Mark Winterbottom (Ford) 1915 \n \n2: Chaz Mostert (Ford) 1741 \n \n3: Craig Lowndes (Holden) 1660 \n \n4: Dave Reynolds (Ford) 1633 \n \n5: Fabian Coulthard (Holden) 1580 \n \n6: Jamie Whincup (Holden) 1466", "source": "Gatton Star"}