{"published": "2015-09-03T07:06:53Z", "media-type": "News", "title": "BOJ's Kiuchi warns Japan won't hit inflation goal even by early 2018", "id": "07256fa9-1ddd-4aa1-94a0-e3cceaad6cc3", "content": "By Leika Kihara\n\nAOMORI, Japan (Reuters) - Japan is unlikely to see inflation hit the central bank's 2 percent target over the next 2-1/2 years, Bank of Japan board member Takahide Kiuchi said, warning that China's slowdown has become a huge risk to global growth.\n\nThe former market economist said inflation has been dampened by weak consumer confidence and faltering exports as China's growth engine sputters.\n\nKuichi, however, dismissed the chance that problems in China could trigger a global financial crisis.\n\n\"With China's property market showing signs of a pick-up and authorities showing readiness to take policy measures, I expect the economy to stabilise over the course of time,\" he told reporters on Thursday after meeting with business leaders in Aomori, northern Japan.\n\nKiuchi - among those in the nine-member board wary of the rising costs of the BOJ's radical stimulus - stuck to his lone proposal to taper the bank's asset purchases and allow itself more time to hit its 2 percent price target.\n\n\"Consumer inflation ... is unlikely to reach 2 percent even in fiscal 2017\" ending in March 2018, Kiuchi said.\n\n\"I think the price target of 2 percent is well above the level consistent with Japan's current growth potential,\" he said, adding that it was difficult to hit the price target unless the BOJ's efforts were accompanied by structural reforms to boost the country's productivity.\n\nDON'T EXPECT MORE STIMULUS\n\nWhile acknowledging that Japan's economy was in a lull, Kiuchi said he was against expanding stimulus further given the limited effect it would have on boosting growth.\n\n\"Focussing too narrowly on pushing up prices doesn't make sense,\" he said.\n\nThe world's third-biggest economy slipped into a contraction in April-June and inflation has ground to a halt, keeping the BOJ under pressure to expand stimulus to meet its pledge to accelerate inflation to 2 percent by around September next year.\n\nBOJ Governor Haruhiko Kuroda has voiced confidence that Japan is on track to hit the price target. But some board members, including Kiuchi, share doubts held by private analysts on whether the ambitious target can be met so soon and with monetary stimulus alone.\n\nKiuchi has been the lone board member to advocate tapering the BOJ's massive asset purchases on concern the cost of the programme, such as drying up bond market liquidity, was already exceeding the benefits. He was among the four board members who voted against the BOJ's decision last October to ease policy.\n\n(Reporting by Leika Kihara; Editing by Chris Gallagher & Shri Navaratnam)", "source": "Yahoo! Finance UK and Ireland"}