{"published": "2015-09-15T12:01:10Z", "media-type": "News", "title": "Paul Gambaccini tells of 'rage attacks' over dropped sex allegations", "id": "560be0e0-f0d2-460d-b3d3-f5277422de0f", "content": "Broadcaster Paul Gambaccini has told how he suffered up to six \"rage attacks\" a day while he was under investigation for allegations of historical sex abuse, before they were eventually dropped. \n \r\n\t\t\r \nThe DJ has released a memoir about the 12 months he spent on bail before the case against him was dropped by police in October last year. \n\r  Paul Gambaccini wrote a memoir about the 12 months he spent on bail before charges were dropped \r \r \nHe told BBC Radio 4's Today programme: \"My problem was rage. I would have rage attacks, about six a day. \n\r\n\t\t\t\r \n\"In my case there could be no remorse because not only did I not know these two people but the police were accusing me of having sex in the decade before I started having same-sex relations. \n\r\n\r\n\r\n\r \n\"So much for 'where were you on the night of April 23?' - they were not only on the wrong day, the wrong year, they were in the wrong decade.\" \n\nCriticising  Metropolitan Police Commissioner Sir Bernard Hogan-Howe over the long investigation, he added: \"Here is a man whose organisation attempted to destroy my life and my career, and when they failed, as they had to fail, they would not admit error, they would not apologise, they would not say, 'you're innocent'.\" \n\nHe claims his bail was repeatedly extended until the end of high-profile cases involving other showbusiness figures because detectives working on Operation Yewtree - the police investigation into historic sex offences launched in the wake of the exposure of Jimmy Savile's crimes - did not want juries to hear that a former Radio 1 DJ had been cleared of sexual wrongdoing. \n\nGambaccini, who has been a fixture on UK radio for decades, has been calling for law reform including anonymity for those accused of sex abuse before they have been charged, and has backed  a 28-day limit on the use of police bail. \n\r\n\t\t\t\r \nHe also  believes  the justice system should consider how it treats false accusers. \n\n\"They need to either be prosecuted or offered medical attention,\" he said. \n\nHis memoir Love, Paul Gambaccini, is out now. \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Worksop Guardian"}