{"published": "2015-09-02T14:33:23Z", "media-type": "News", "title": "Cigna expanding sales to Africa with new expat product", "id": "69070873-417d-40b7-ad81-448a3eb4123e", "content": "Designed for expat employees of multinational companies with offices in \n      Africa, Cigna Global Health Benefits ® is now offering its new \n      Cigna Africa product. Expats in regions of Africa will benefit from \n      Cigna's local experience and facilities, global medical network, and \n      ongoing commitment to investments in this region. \n \nCigna Africa has been designed specifically for multinationals’ globally \n      mobile, key local and third-country nationals (TCN) staff in Africa. The \n      product has been tailored to the needs and local practices of the \n      region, making the plan affordable and giving multiple options to \n      individual preferences such as area of cover, cover levels and \n      supplementary coverages. It includes health benefits, dental and vision \n      cover, evacuation and health management services. \n \n“Africa is an emerging economy, with significant growth of almost 1,000 \n      billion US$ over the last decade 1 . This trend makes it an \n      attractive expansion target for us. With our already existing \n      infrastructure and experience in Africa, we are in a good position to \n      give regional expats and key nationals a premium service,” says Bart \n      Jordens, General Manager International Organisations and Africa at Cigna. \n \nCurrently, Cigna Global Health Benefits already supports the health, \n      well-being and sense of security for numerous customers in Sub-Saharan \n      Africa, employed by multinationals, non-profits and intergovernmental \n      organizations (IGOs). It employs local communication officers and \n      medical consultants in key hubs and claims intake office in Kenya. \n \nCigna recognizes the business potential in the area with the new \n      dedicated product and sales team. \n \n About Cigna  \n \nCigna Corporation (NYSE: CI ) is a global health service company \n      dedicated to helping people improve their health, well-being and sense \n      of security. All products and services are provided exclusively by or \n      through operating subsidiaries of Cigna Corporation, including \n      Connecticut General Life Insurance Company, Cigna Health and Life \n      Insurance Company, Life Insurance Company of North America and Cigna \n      Life Insurance Company of New York. Such products and services include \n      an integrated suite of health services, such as medical, dental, \n      behavioral health, pharmacy, vision, supplemental benefits, and other \n      related products including group life, accident and disability \n      insurance. Cigna maintains sales capability in 30 countries and \n      jurisdictions, and has more than 88 million customer relationships \n      throughout the world. To learn more about Cigna®, including links to \n      follow us on Facebook or Twitter, visit www.cigna.com . \n \nAfrica is emerging as a significant point of growth, making it an \n      attractive expansion target for companies in search of new markets. The \n      EY attractiveness index 2013 for Africa shows that Africa’s growth is \n      real and sustainable, with the economic output of Sub-Saharan Africa \n      having grown strongly from US$344.1 billion in 2000 to US$1 334.2 \n      billion in 2012. Sub-Saharan economic output is projected to reach US$1 \n      844.6 by 2017. \n \n 1 Source: EY 2013/14 Sub-Saharan Africa talent trends and \n      practices survey report. \n \n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150902005968/en/ \n\nCopyright Business Wire 2015 \nSource: Business Wire\n\t\t\t\t(September 2, 2015 - 10:29 AM EDT) \nNews by QuoteMedia \nwww.quotemedia.com", "source": "InvestorPoint.com"}