{"published": "2015-09-15T23:51:52Z", "media-type": "News", "title": "Liberal Leadership: Malcolm Turnbull's reforms - and which stocks they affect", "id": "67fa7372-42d5-4536-af85-6720b43ee06c", "content": "The reform agenda in Australia will accelerate under Malcolm Turnbull's leadership and boost the sharemarket, Credit Suisse says. \n\nMalcolm Turnbull's turn as prime minister will reduce the risk of the nation falling into recession and boost the sharemarket, Credit Suisse says, blaming his predecessor's economic bungles for setting off his downfall.\n\nThe demise of Tony Abbott's government began with its 2014 budget, which was regressive and austere at a time when Australia needed fiscal expansion to bolster growth, according to the bank's research analyst Hasan Tevfik.\n\nNow Mr Turnbull has the mandate for reform, and counter-cyclical policy is urgently needed to reduce the risk of recession. The bank warns real GDP growth could fall to 1 per cent. By this measure, raising the budget deficit by 1.5 per cent would be needed to achieve 3.5 per cent growth.\n\n\"We believe the reform agenda in Australia will accelerate under [Turnbull's] leadership, which should be positive for equities as an asset class,\" Mr Tevfik said.\n\nHowever, while the sharemarket overall may get a boost, reforms would both have positive and negative implications for individual companies.\n\nThe Credit Suisse team analysed potential reform measures and their effects on Australian shares. Media's reach rules\n\nThe abolition of the audience reach rule, which limits media ownership to 75 per cent coverage of all Australian audiences, could open the floodgate for mergerr and acquisitions among metro and regional media companies.\n\nAs communications minister, Mr Turnbull was championing this reform, making a policy recommendation in March to change what The removal of this rule would open the door for Nine Entertainment to acquire Southern Cross Media, Credit Suisse said. Penalty rates\n\n\"Our retail and REITs [real estate investment trusts] analysts suggest penalty rates need to be addressed,\" Mr Tevfik said.\n\nA hotly debated reform topic, Credit Suisse said Mr Turnbull's progressive reform approach could lead to a review in penalty rates, benefiting the likes of Westfield shopping mall owner Scentre Group, Federation Centres and retailers. Negative gearing\n\n\"An economic liberal would consider negative gearing as an inefficient policy, which attracts capital to an unproductive asset,\" Mr Tevfik said.\n\nWhile it was a tall order both politically and economically to remove negative gearing, Mr Turnbull may consider grandfathering or scaling back negative gearing on Australian housing.\n\nThat would hurt a long list of companies exposed to the housing market including Mirvac Group, Stockland, Lend Lease, Boral, CSR, Adelaide Brighton and the banks. GST hike\n\nTo help fund fiscal stimulus measures, the GST could rise under Mr Turnbull, Credit Suisse says. This would likely deter people from shopping and negatively affect retailers.\n\nBut this could be partially offset by lowering the online GST threshold, rather than abolish altogether the $1000 GST-free threshold for goods and services purchased online from abroad as planned by Mr Abbott's government.\n\nThe days of tax-free online shopping seem to be numbered after Treasurer Joe Hockey moved to whack the 10 per cent GST on all online imports from July 2017.Corporate tax\n\n\"Australians have to endure some of the highest corporate tax rates in the world,\" Mr Tevfik said, noting Australian tax rates were almost 10 per cent higher than the average in Europe and Asia.\n\n\"This is potentially impinging on Australia's competitiveness.\" Australia's than his predecessor.\n\nLowering the corporate tax rate could result in tougher policing of companies attempting to avoid paying tax in Australia such as BHP Billiton and Rio Tinto, Mr Tevfik said. Online betting\n\nA move to legalise online live betting would put a dampener on Tabcorp and Tatts Group's competitive advantage, but would likely grow the market, Mr Tevfik said. The story first appeared on The Sydney Morning Herald.", "source": "Coly Point Observer"}