{"published": "2015-09-17T12:28:44Z", "media-type": "News", "title": "Neil Jenkins sure Biggar boot can be Wales World Cup weapon", "id": "2c0c493a-0ca2-46ec-aa84-0f62bc2f529d", "content": "14:21 Thursday 17 September 2015 Wales' record international points-scorer Neil Jenkins has backed Dan Biggar to relish the role of principal World Cup goalkicker.\n\nBiggar will step up as first-choice Wales marksman after Leigh Halfpenny - who has amassed more than 500 points in 62 Tests - was ruled out of the tournament by a serious knee injury suffered against final tournament warm-up opponents Italy 12 days ago.\n\nBut Jenkins, who has worked closely with both players during their rise through the ranks, believes fly-half Biggar offers a seamless transition.\n\n\"We have lost one of the best (goalkickers) in Leigh Halfpenny, but between him and Dan it is probably touch and go between them anyway,\" Jenkins said.\n\n\"Leigh took over the (Wales) kicking four years ago and deserves his place as one of the best in the world, if not the best. Dan is incredibly close, if not on a par with him.\n\n\"We are very lucky in that regard to have someone like Dan to come in and be able to do the job that he does with the Ospreys week in, week out, and do a very good job for us.\n\n\"Throughout his career, Dan has matured greatly, and the last couple of years he has been outstanding for us. He has led the team incredibly well, and he is a navigator who has been playing exceptional rugby himself.\n\n\"He has matured into a world-class 10, and that shows in the way he is performing and conducts himself on the pitch. Any 10 in any side is generally the leader and who the players look to, and he has certainly given us that.\n\n\"He knows the patterns inside out and the way we want to play the game, and he understands the game.\"\n\nWales open their World Cup campaign against minnows Uruguay on Sunday, and while a player of Halfpenny's star quality is certain to be missed, the Pool A challengers know they have to get on with life without him.\n\n\"They (Halfpenny and Biggar) are both very accurate and rarely do they miss,\" Wales assistant coach and kicking specialist Jenkins added.\n\n\"They are both world class and want to be the best, and that's something I enjoy.\n\n\"As a kicking coach you can't ask for anything more. I have known them both for a long time - when they were 14 or 15 in the academies - and seen them progress to where they are now.\n\n\"It's great to see that progression into two of the best players and kickers in the world.\"", "source": "Derbyshire Times"}