{"published": "2015-09-22T17:50:00Z", "media-type": "News", "title": "2nd Annual Federal Nurses Week Focuses on Key Legislative Steps Needed to Support Nurses", "id": "ad068780-bce6-4cda-8869-ffeb496c75f6", "content": "SOURCE American Federation of Government Employees\n\nFederal Nurses: Protecting Patients At Every Step of Care\n\nWASHINGTON \n\nMore than 100,000 registered nurses, nurse practitioners, licensed practical nurses, licensed vocational nurses and nursing assistants are providing services to our nation's veterans, active duty troops and their families, and some of our most vulnerable populations. They serve a critical role in health care practices nationwide and are conducting their work in agencies such as the Department of Veterans Affairs, Department of Defense, National Institutes of Health, Indian Health Service and the Bureau of Prisons. The depth of the services provided is highlighted in this year's theme: Honoring Those Who Protect Patients at Every Step of Care. \n\n\"AFGE is honored to celebrate the work, dedication and passion of public servants in nursing positions,\" said AFGE National President J. David Cox Sr. \n\nCurrent legislation that addresses key issues facing nursing professionals in the federal sector is the Nurse Staffing Standards for Patient Safety and Quality Care Act of 2015 (H.R. 1602), introduced by Rep. Jan Schakowsky \n\n\"The AFGE Nurse Steering Committee plays a key role in educating the public about registered nurses, nurse practitioners, licensed practical nurses, licensed vocational nurses and nursing assistants in the federal sector,\" said AFGE District 8 National Vice President Jane Nygaard. \"We're dedicated to the missions of our agencies and most of all delivering world-class care to the patients we serve. As advocates for working families, we know the importance of supporting legislation that keeps the patient and the worker in mind.\" \n\n\"The care delivered to our nation's veterans would not be possible without those serving in nursing positions,\" said AFGE National VA Council President Alma Lee \n\nTo learn more about AFGE's Federal Nurses Week campaign visit www.afge.org/federalnursesweek. \n\nThe American Federation of Government Employees (AFGE) is the largest federal employee union, representing 670,000 workers in the federal government and the government of the District of Columbia. For the latest AFGE news and information, follow us on Facebook and Twitter. \n\nLogo - http://photos.prnewswire.com/prnh/20131120/MM21150LOGO\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/2nd-annual-federal-nurses-week-focuses-on-key-legislative-steps-needed-to-support-nurses-300147226.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KYTX CBS 19"}