{"published": "2015-09-08T07:30:56Z", "media-type": "News", "title": "Taking another direction – how to handle a business break-up", "id": "ab03eff3-599c-47da-b6eb-79d6c4d3199b", "content": "Soldiers Waited Days Weeks for Counseling at Fort Hood  \nNBC 5 - Tuesday 8th September, 2015 \n \nNew Army records obtained by NBC 5 Investigates show active duty soldiers including those returning from combat have had to wait days or even weeks to make appointments with mental health counselors  ... \n   Vandals Splatter Black Paint on Personalized Parking Spots  \nNBC 5 - Tuesday 8th September, 2015 \n \n\"I was pretty mad because I put all this time and work into it. And then someone comes up and decides to vandalize it,\" said Erick Lemke, a Joshua High Senior about the black paint he  ... \n   Man Starts Fire by Pouring Hot Coals Down Trash Chute DFR  \nNBC 5 - Tuesday 8th September, 2015 \n \nA resident was using a charcoal grill inside an apartment in the 1400 block of Belleview Street in the Cedars neighborhood. He later disposed of the still-smoldering coals by pouring them down a  ... \n   Police Firefighters Rescue Dogs From Extreme Heat  \nNBC 5 - Tuesday 8th September, 2015 \n \nA concerned neighbor called police after noticing the three animals were left out on a third floor balcony in the above 100 degree weather with no shade and one small bowl of water.  ... \n   Mosquitoes May be Resistant to Chemical Used in Spray Trucks  \nNBC 5 - Tuesday 8th September, 2015 \n \nOn Tuesday, Dallas County Commissioners could vote on a plan to study whether the chemicals used to control mosquitoes remains the best one in the fight against West Nile virus. (Published Monday,  ... \n   Dallas Anti-Trump Rally Draws Crowd  \nNBC 5 - Tuesday 8th September, 2015 \n \nHundreds of North Texans gathered in downtown Dallas on Monday afternoon to protest presidential candidate Donald Trump's upcoming visit. (Published Monday, Sept. 7,  ... \n   Movie Star Joins Fight to Save Lakewood Theater  \nNBC 5 - Tuesday 8th September, 2015 \n \n\"I love that area and the Lakewood Theater has been part of my life,\" Gilliam said. \"I used to get on my bicycle, ride my bicycle across town about 3 miles to go to the theater  ... \n   UNT Named Best Home-Field Advantage in College Football  \nNBC 5 - Tuesday 8th September, 2015 \n \nIn a new study published by the Wall Street Journal the Mean Green, unexpectedly for many, bested every other team in college football when it comes to having the edge on their home turf. (Published  ... \n   Person of Interest in Arlington Hit-and-Run Cleared  \nNBC 5 - Tuesday 8th September, 2015 \n \nArlington police released these photos showing what they call a vehicle and person-of-interest involved in the fatal hit-and-run crash from Saturday. Police were quick to point out that the man was  ... \n   Three TCU Students Beaten Robbed  \nNBC 5 - Tuesday 8th September, 2015 \n \nThree tall, college-aged \"muscular\" men beat and robbed three TCU students outside a party just off campus Friday night, police say. The crime happened outside a house near the  ... \n   Back the Blue Event Takes Over Fort Worth  \nNBC 5 - Tuesday 8th September, 2015 \n \nCitizens wearing a sea of blue gathered in Fort Worth on Labor Day to thank law enforcement during an event called \"Main Street Back the Blue.\"  ... \n   4 Women Killed in Dallas Crash Saturday Identified  \nNBC 5 - Tuesday 8th September, 2015 \n \nDallas police told NBC DFW they arrested a 19-year-old man in connection with a crash that killed four women late Saturday night. The victims, were all women, all related, and aged 38, 42, 55 and  ... \n   Cowboys Claim Offensive Tackle Jordan Mills LB Brinkley Waived  \nDallas Cowboys - Tuesday 8th September, 2015 \n \n- The Cowboys continued to tweak the bottom of their 53-man roster Monday, adding depth to their offensive line by claiming two-year veteran  ... \n   Eatman Trading For Veteran RB Seems More About Trust Than Competition  \nDallas Cowboys - Tuesday 8th September, 2015 \n \n? There's a popular phrase often used regarding competition in the NFL, usually at the quarterback spot. It's been said many times that if a team has two or three quarterbacks, that really  ... \n   Dez Bryant Expected To Practice Fully Wednesday Martin Healthy  \nDallas Cowboys - Tuesday 8th September, 2015 \n \n(hamstring) to be a full participant when the Cowboys get back to practice Wednesday in preparation for the Sunday night regular-season opener against the Giants. Bryant returned to full practice in  ... \n   Cowboys Taking Patient Approach With Arrival Of Christine Michael  \nDallas Cowboys - Tuesday 8th September, 2015 \n \nwould shine the spotlight even brighter. It's also understandable that, with his team beginning preparations for its season opener, Cowboys coach Jason Garrett was quick to pump the brakes on  ... \n   Nuevo Segmento Para Los Fanáticos De Los Cowboys  \nDallas Cowboys - Tuesday 8th September, 2015 \n \n?Hola amigos! Antes que nada quiero darle las gracias a todos los fan?ticos de los Cowboys que nos siguen desde M?xico, Argentina, Espa?a, Costa Rica, Brasil y todos los dem?s pa?ses en donde  ... \n   Cowboys Turn Attention To Practice Squad QB Kellen Moore  \nDallas Cowboys - Tuesday 8th September, 2015 \n \n- With 53-man rosters announced Saturday, the Cowboys and the rest of the league now turn their attention to filling out their respective 10-man practice squads following the waiver process. The  ... \n   Faulkner steps up to help Rangers grab key win  \nTexas Rangers - Tuesday 8th September, 2015 \n \nAndrew Faulkner made his third appearance in a Major League game on Monday. This time it wasn't in a mop-up role with the Rangers trailing by 6-7 runs. This time, manager Jeff  ... \n   DeShields sprains left knee on slide into third  \nTexas Rangers - Tuesday 8th September, 2015 \n \nDelino DeShields for at least one game and maybe more because of a mild sprain of his left knee. The Rangers are hopeful that DeShields won't be out too long, but they will know more on  ...", "source": "Thedallasnews.net"}