{"published": "2015-09-28T10:44:23Z", "media-type": "News", "title": "Positive Sentiment Sustained With N72 Billion", "id": "1b0510d5-370d-4231-bd8b-50d51a657537", "content": "Lagos — It was a three-day trading week as the Federal Government of Nigeria declared Thursday 24th and Friday 25th of September, 2015 as Public Holiday in commemoration of the Eid-el-Kabir Sallah Celebration.\n\nTransaction in equities segment of the Nigerian Stock Exchange (NSE) ended the week with N72 billion gains.\n\nThe index movement indicates that the NSE All-Share Index and market capitalization appreciated by 0.69 per cent to close on Wednesday at 30,543.17 and N10.497 trillion respectively. Similarly, all the indices finished higher during the week with the exception of the NSE Banking and NSE Pension Indices that shed 0.66 per cent and 0.28 per cent respectively, while the NSE Alternative Securities Market Index closed flat.\n\nAnalysts at Meristem Securities Limited opined that the positive mood in the market may not be unrelated to the Monetary Policy Committee (MPC) resolutions to reduce the cash reserve ratio by 6 per cent, to enhance liquidity in the system.\n\n\"We expect profit taking to dominate activities in the coming week, given the positive run in the market lately.\"\n\nWhile analysts at APT Securities and Funds Limited expected the index to remain stable, maintaining the current trend and with greater possibilities of closing positive in the next trading week (four trading sessions) on expected activities in the nation's governance and fiscal frontlines.\n\nWhen the trading resume on Monday, speculative activities stopped the upward movement of the local bourse, as investors booked profit from previous gains.\n\nAt the end of trading, equities value depreciated by N23 billion, while All Share Index decline by 66.78 basis points represented 0.22 per cent.\n\nThe market capitalization of 190 listed equities on the exchange slumped to N10.402 trillion from N10.425 trillion it opened, while the All Share Index dropped to 30,265.90 points from 30,332.68 points it opened.\n\nMarket activity as measured by volume and value traded on low level seeing that volume decreased by 47.35 per cent to 175.564 million units while value declined by 55.69 per cent to N1.556 billion.\n\nThe financial services sector dominate volume and value, driven by transactions in Unic Insurance Plc which traded 30.003 million shares worth N19.002 million, followed by UBA Plc with 18.809 million units of share valued at N78.858 million, Access Bank Plc with 18.268 million shares at N95.116 million, Zenith Bank traded 17.006 million shares worth N307.825 million and Guaranty Trust Bank Plc with 14.274 million shares worth N349.689 million.\n\nHowever, transaction on the bourse resumed positive trading on Tuesday with N55 billion gained.\n\nThe market capitalization of 190 listed equities on the exchange rose to N10.4057 trillion from N10.402 trillion it opened, while the All Share Index dropped to 30,426.10 points from 30,265.90 points it opened.\n\nMarket activity as measured by volume and value traded close higher with 207.591 million shares valued at N3.136 billion transacted in 3,262 deals compared to 144.421 million shares worth N1.133 billion in 2,403 deals recorded on Monday.\n\nThe financial services sector dominate volume and value, driven by transactions in UBA Plc which traded 341.729 million shares worth N176.514 million, followed by Guaranty Trust Bank Plc with 32.152 million units of share valued at N786.294 million, Zenith Bank Plc with 22.576 million shares at N408.532 million and FBN Holdings traded 19.989 million shares worth N125.997 million.\n\nLocal bourse sustained the positive ride on Wednesday on the back of MPC's easing stance which ultimately improved market liquidity and a better outlook for the banking stocks.\n\nConsequently, the benchmark index gained 38 basis points to close at 30,543.17 points; market capitalization also gained N40.3 billion to settle at N10.497 trillion. Market activity increased as volume traded rose 138.9 per cent to 466.9 million units while value traded improved 40.3 per cent to N4.4 billion. Market breadth increase as 22 stocks advanced while 24 stocks declined.\n\nOil & Gas sector emerged top gainer as share price appreciation in Forte Oil supported gains in the Oil & Gas sector, emerging the top gainer for day with a return of 1.3 per cent. The Industrial sector returned 0.8 per cent on the back of gains in Dangote Cement. The financial services sector returned 0.2 per cent while consumer sector closed flat.\n\nMeanwhile, a turnover of 850.095 million shares worth N9.060 billion in 9,414 deals were traded this week by investors on the floor of the exchange in contrast to a total of 1.384 billion shares valued at N13.862 billion that exchanged hands last week in 17,984 deals.\n\nThe Financial Services Industry (measured by volume) led the activity chart with 726.294 million shares valued at N6.058 billion traded in 5,086 deals; thus contributing 85.44 per cent and 66.87 per cent to the total equity turnover volume and value respectively. The Consumer Goods Industry followed with a turnover of 38.681 million shares worth N1.790 billion in 1,895 deals. The third place was occupied by the Conglomerates Industry with 37.874 million shares worth N224.698 billion in 538 deals.\n\nTrading in the top three equities namely Zenith Bank Plc, United Bank for Africa Plc and Sterling Bank Plc (measured by volume) accounted for 334.012 million shares worth N3.674 billion in 1,472 deals, contributing 39.29 per cent and 40.56 per cent to the total equity turnover volume and value respectively.\n\nAlso traded during the week were a total of 11,454 units of Exchange Traded Products (ETPs) valued at N449,180.74 executed in 13 deals compared with a total of 1,189 units valued at N1.282 million transacted last week in 24 deals.\n\nThere was no bond trade recorded this week under review. However, a total of 3,750 units valued at N3.299 million transacted last week in 4 deals.\n\nSummary of price changes shows that 29 equities appreciated in price during the week, lower than 56 equities of the preceding week. Thirty-six equities depreciated in price, higher than 22 equities of the preceding week, while 125 equities remained unchanged, higher than 112 equities recorded in the preceding week. E-Tranzact International Plc led gainers chart with 13.17 per cent per share to close at N2.75 kobo, followed by NEM Insurance Company Nigeria Plc with 7.69 per cent to close at N0.70 kobo, Seplat Petroleum Development Company Plc with 6.25 per cent to close at N255.00 kobo, Axamansard Insurance Plc with 5.00 per cent to close at N2.73 per share and UACN Property Development Company Plc with 4.99 per cent to close at N7.79 kobo per share.\n\nOthers on the chart are, Forte Oil Plc with 4.89 per cent to close at N239.99 kobo, Portland Paints and Products Nigeria Plc with 4.87 per cent to close at N4.31 kobo, Paints and Coatings Manufactures Plc with 4.84 per cent to close at N1.30 kobo, Custodian and Allied Plc with 4.68 per cent to close at N4.25 kobo, and Cutix Plc with 4.38 per cent to close at N1.67 kobo.\n\nOn the other hand Trans Nationwide Express Plc led on the losers table with9.09 per cent loss to close at N1.20 kobo, Flour Mills Nigeria Plc lost 6.86 per cent to close at N22.00 kobo, Honeywell Flour Mills Plc with 6.12 per cent to close at N2.30 kobo, UAC of Nigeria Plc with 5.72 per cent to close at N30.00 kobo per share Eterna Plc with 5.64 per cent to close at N1.84 kobo.\n\nOthers on the chart are, Vitafoam Nigeria Plc with 5.13 per cent to close at N5.55 kobo, Champion Breweries Plc with 4.97 to close at N4.40 kobo, Interlinked Technologies Plc with 4.97 to close at N4.21 kobo, Morison Industries Plc with 4.95 per cent to close at N1.73 kobo per share and National Aviation Handling Company Plc with 4.85 per cent loss to end the week with N4.51 kobo per share.", "source": "AllAfrica.com"}