{"published": "2015-09-04T18:54:55Z", "media-type": "News", "title": "Great derby clash delivers", "id": "585e9603-50d0-40aa-b429-fcb43e59d344", "content": "If you think that a big fuss is being made of the Dale and Queen’s College rugby derby, then you clearly do not know the rich history of the fixture.  \nLast week we started looking into the match that has taken place since 1891 and this week we continue with the story on these two great “Border” and South African schools teams. \n \nThe great history of the Dale Rugby College and Queen’s College clash began after an exciting first game on August 30 1891. \n \nThis important rugby game is recorded as the first at schoolboy level for Dale College and established Queen’s as Dale’s oldest schoolboy rivals. \n \nThis rivalry is still jealously guarded by all Dalians, Queenians and Old Boys of both schools. \n \nThe schools have never had reason to ever consider breaking off rugby-playing traditions, regardless of any tension on or off the playing fields. Though this tradition is of huge sentiment to past pupils of both schools, who pride themselves on winning, the sport of rugby has always been the winner in these clashes. \n \nAfter the 174th game at first team level, we are mindful of the history of sporting and rugby contacts between Dale and Queen’s and reaching this milestone, is as important today as that first-ever game in 1891 in Queenstown. \n \nAfter this first game in 1891 (won 19-3 by Dale) the next game was played only in 1926 at home in King William’s Town. \n \nDale lost this game 6-0. \n \nThe only time where the rugby tradition was brought to a temporary halt, as we are told, was when football was established at Queen’s as the main winter sport, alongside cricket for summer. \n \nHowever, at Dale, rugby continued unofficially against the rules of the headmaster – Rev J G Sutton. Association football replaced rugby as the official sport at Dale in 1892. \n \nDuring 1906 a group of Std 4 boys held a meeting in their classroom after school on a Saturday morning. The purpose of the meeting was to endeavour to start rugby to keep the boys busy on Saturday mornings, when there was nothing to do. Humble beginnings for what has become a present-day derby day rugby fixture!", "source": "ShowMe East London"}