{"published": "2015-09-24T21:46:36Z", "media-type": "News", "title": "Heart Failure Society Of America Kicks Off Its 19th Annual Scientific Meeting", "id": "f550ce98-7401-46cd-9b06-a235d9161463", "content": "Advancing Excellence in Patient Centered Science (September 24, 2015) NATIONAL HARBOR, Md., Sept. 24, 2015 /PRNewswire-USNewswire/ --The Heart Failure Society of America (HFSA) will convene its 19th Annual Scientific Meeting Saturday, September 26 at the Gaylord National Harbor Convention Center and expects over 2000 registered attendees. This four-day meeting will highlight emerging therapies and new developments in science and research in order to improve patient outcomes and the quality of life for patients in all stages of heart failure (HF). \n\nHeart Failure, the silent epidemic, is a rising and often misunderstood disease. In the US, approximately 5.7 million patients aged 20 years have HF, with 870,000 new cases diagnosed each year. The \"Heart Disease and Stroke Statistics2015 Update\" from the American Heart Association (AHA) estimated that the 2012 total (direct and indirect) cost for HF was $30.7 billion, of which 68% was due to direct medical costs. \n\nThe HFSA Annual Meeting seeks to educate multi-disciplinary clinicians, administrators, researchers, and patients. This year's program has 75 educational sessions, 280 faculty, 350 abstract posters, and nearly 50 exhibitors. The program reflects the excitement for new medical and device therapies approved in the past year, and is designed to provide up-to-date summaries of new therapies as well as stimulate discussion. In conjunction with the 2015 Annual Meeting, HFSA and the American Association of Heart Failure Nurses (AAHFN) will kick off the inaugural collaborative HFSA- AAHFN Patient Day Health Fair, also at the Gaylord. The Patient Day Health Fair will be held on Saturday, September 26, and will give patients and caregivers an opportunity to participate fully in a variety of educational and interactive sessions that allow participants' access to leading experts, new developments in HF, and the current information in the HF community.\n\nThe burden of HF will continue to increase as the population ages. By 2030, it is estimated that the number of Americans living with HF will increase 46% to 8 million. \n\nFor a complete list of HFSA 19th Annual Scientific Meeting sessions, visit hfsa.org or download the mobile app by searching for HFSA. There is no registration fee for accredited journalists. Call for details on registering. A press room is located on site. You may follow news on #HFSA and #HFSA15.\n\nAbout HFSA\n\nThe Heart Failure Society of America, Inc. (HFSA) represents the first organized effort by heart failure experts from the Americas to provide a forum for all those interested in heart function, heart failure, and congestive heart failure (CHF) research and patient care.\n\nAbout Heart Failure\n\nDespite the phrase's sound, heart failure does not mean that the heart has suddenly stopped working or that you are about to die. Rather, heart failure is a common condition that usually develops slowly as the heart muscle weakens and must work harder to keep blood flowing through the body. Heart failure develops after injury to the heart such as the damage caused by a heart attack, long-term high blood pressure, obesity, diabetes, or an abnormality of one of the heart valves. The weakened heart must work harder to keep up with the demands of the body, which is why people with heart failure often complain of feeling tired. Heart failure is often not recognized until a more advanced stage of heart failure, commonly referred to as congestive heart failure, in which fluid may leak into the lungs, feet, legs, and in some cases, the liver or abdominal cavity. There is a 50% mortality within five years of diagnoses. New and emerging therapies are increasing the quality of life and extending life expectancy.\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/heart-failure-society-of-america-kicks-off-its-19th-annual-scientific-meeting-300148870.html\n\nSOURCE Heart Failure Society of America Copyright 2014 PR Newswire. All Rights Reserved\n\nFB.init(\"4112331804fd1df554354de5f28d86f9\", \"/xd_receiver.htm\");", "source": "Review Seeker"}