{"published": "2015-09-03T20:10:00Z", "media-type": "News", "title": "Shares of BP Prudhoe Bay Trust Couldn't Stop Their Long Decline in August", "id": "8f5d804e-321a-4563-ae4b-4015f2f34e4b", "content": "What: Shares of BP Prudhoe Bay Trust  ( NYSE:BPT ) declined 11% in August as oil and gas prices and rising operational costs are biting into the trust's ability to generate royalty revenue from its properties. This past month's decline is part of a year-long slide that has coincided with oil prices almost the entire time.  \n \nSo what: Royalty Trusts are about the closest thing an investor can come to actually owning and selling oil. So, as you can imagine, royalty stocks such as BP Prudhoe Bay Trust will track the price of oil and gas quite closely. With oil prices taking a pretty sharp decline in August, it would be safe to assume that BP Prudhoe Bay did the same thing. \n \n\n \nBPT data by YCharts . \n \nThe results of this relationship were quite clear when it released its financials on August 10. Compared to the same time last year, the average realized price for oil extracted from the trust's properties was 50% less than it was the same time last year. To add insult to injury, the operator of the Prudhoe Bay field, BP  ( NYSE:BP ) , increased its per-barrel operational charges to $17 per barrel, which meant that the average per-barrel royalty for shares of the trust was just $16.41 for the past quarter compared to $50.42 in the second quarter of 2014. \n \nThe one aspect that may encourage holders of the trust is that average production on its properties was actually up from this time last year. However, looking deeper into the numbers, it appears that the production increase consisted of some accounting adjustments made because last year's results were underpaid. The managers of the Trust's believe that production will remain steady as natural decline is offset by some investments made across the field by BP. \n \nNow what: Unlike other royalty trusts where the operator has an obligation to drill a certain number of wells then call it a day, the BP Prudhoe Bay Trust is entitled to a certain amount of production on the property regardless of what wells are drilled. This means that production may not see the declines that make investments in other trusts unappealing. However, BP Prudhoe Bay Trust's results are still subject to the whims of the market, and operational costs from BP are slowly on the rise. \n \nIf oil prices were to rise significantly, then shares of BP Prudhoe Bay Trust may look tempting. Then again, without a clear indication that may happen, there are other investments in the oil and gas space that look to have better prospects today. \n \nThe next billion-dollar iSecret  \nThe world's biggest tech company forgot to show you something at its recent event, but a few Wall Street analysts and the Fool didn't miss a beat: There's a small company that's powering their brand-new gadgets and the coming revolution in technology. And we think its stock price has nearly unlimited room to run for early in-the-know investors! To be one of them, just click here .", "source": "Motley Fool"}