{"published": "2015-09-24T02:38:00Z", "media-type": "News", "title": "Pope Francis gets a warm welcome in Washington", "id": "d3844a52-9f13-448c-b5fb-488bc2d588bf", "content": "Making his debut in the center of United States politics Wednesday, Pope Francis delivered a message to make both liberals and conservatives squirm and dabbled in controversy throughout the day. \n\nCheered by a throng of 11,000 on the South Lawn of the White House, Francis touched on immigration and climate change -- issues where he agrees with Democrats -- but also religious liberty and marriage, where he sides with Republicans. \n\n\"I look forward to these days of encounter and dialogue in which I hope to listen to and share many of the hopes and dreams of the American people,\" Francis said in his first remarks of a six-day trip that will also take him to New York City and Philadelphia. \n\nIn addition to the flourish of a White House welcome, Francis spent Wednesday parading through parts of the city, holding a prayer service with U.S. bishops and canonizing a new saint at the Basilica of the National Shrine of the Immaculate Conception. He mingled with the crowd and hugged children outside his temporary residence at the Vatican Embassy. \n\nIt was a busy start to the first U.S. visit of the Argentine pope's life. Known for his unusual humility, the pope even made a statement with his transportation choices. Francis eschewed luxury brands as he arrived at the White House in a compact Fiat, and he later blessed parade crowds from a customized Jeep Wrangler popemobile. \n\nThursday he will address Congress, a first for any pope, but he did not wait to delve into the political issues that have divided the nation. \n\nThe pontiff and politics \n\nSpeaking in English, not his native tongue, Francis told President Barack Obama: \"I find it encouraging that you are proposing an initiative for reducing air pollution.\" It was a reference to Obama's policies through the Environmental Protection Agency, which have drawn heated criticism from conservatives and industry. \n\nThe pope this year issued an encyclical, Laudato Si, on the threat of climate change, urging nations to act to save the planet. Most Republicans in Congress reject plans to mandate emissions reductions for fear of stifling the economy, and many insist that climate change, if it's happening, is not the fault of humans. \n\nAs Republican presidential hopefuls debate whether to keep \"birthright citizenship\" for people born to immigrants here illegally, Francis referenced his own upbringing. \n\n\"As a son of an immigrant family, I am happy to be a guest in this country, which was largely built by such families,\" he said. \n\nBut lest Obama and his fellow Democrats get too comfortable, Francis also more obliquely mentioned issues on which they disagree. \n\nThe Obama administration and the Catholic Church have sparred in court over the mandate that health insurance plans under Obamacare cover contraceptives. Catholic organizations and other companies and groups have said they should not be forced to pay for services to which they have a religious objection. \n\n\"With countless other people of goodwill, (American Catholics) are likewise concerned that efforts to build a just and wisely ordered society respect their deepest concerns and the right to religious liberty,\" Francis said. \n\nObama, speaking before Francis, gave a defense of religious liberty as a founding principle of the nation. \n\nThe issue of religious liberty was raised anew after the U.S. Supreme Court this year legalized same-sex marriage throughout the nation, raising concerns that some Christians could be persecuted for disagreeing with the practice. The issue has raged from the presidential campaign trail to Congress to Atlanta's Gold Dome, where religious liberty bills have sparked conflict between conservative activists and big business in Georgia. \n\nFrancis used the type of language Christian conservatives have used to criticize the court without directly doing so. He mentioned his Philadelphia appearance at the World Meeting of Families to \"celebrate and support the institutions of marriage and the family at this critical moment in the history of our civilization.\" \n\nObama lavished his guest with praise for his \"humility, your embrace of simplicity, the gentleness of your words and the generosity of your spirit.\" \n\nThe two met one-on-one for 40 minutes in the Oval Office, a meeting the White House later described as focusing on areas of agreement, such as fighting poverty, opening relations with Cuba and accepting refugees. Obama presented Francis a sculpture of an ascending dove -- a symbol of peace and the Holy Spirit -- and a key from the Maryland home of Elizabeth Ann Seton, the first U.S.-born saint. \n\n'Generous commitment' to healing \n\nAt the meeting with American bishops, Francis addressed the open wound of the priest sex abuse scandal that has rocked the church in the U.S. and worldwide, but he had a positive message. \n\nThe pope lauded the bishops' \"generous commitment to bring healing to victims.\" He praised them for having courage and acting, as he saw it, \"without fear of self-criticism.\" \n\nThe remarks drew criticism from a prominent group of victims of abuse. \n\n\"His remarks today confirm what we've long said and suspected: This pope, like his predecessors, is doing and will do little if anything to bring real reform to this continuing crisis,\" said Barbara Blaine, the president of the Survivors Network of those Abused by Priests. \"Those who care about kids must focus on secular authorities, not church figures (however popular they may be).\" \n\nAt the basilica, Francis canonized a new saint, Junipero Serra, another controversial move. A Spanish missionary, Serra introduced Christianity to California in the 18th century, but Native Americans claim the brutality of the colonists is hardly deserving of sainthood. \n\nCrowds pour out for pope \n\nStill, everywhere he went through the city, Francis was greeted by adoring crowds. \n\nThe White House ceremony was stocked with dignitaries of many faiths. U.S. Reps. Buddy Carter, a Pooler Republican, and Rick Allen, an Evans Republican, were among them. \n\nCarter, a Methodist, was careful to say his appearance at the White House was not necessarily an endorsement of what the pope might say there or in Congress. \n\n\"I'm obviously interested in his views,\" Carter said. \"He represents a lot of people. But at the same time, I'm here more out of respect than anything.\" \n\nWhen talking about climate change, Francis referenced one of Atlanta's most famous citizens. \n\n\"To use a telling phrase of the Reverend Martin Luther King, we can say that we have defaulted on a promissory note, and now is the time to honor it,\" the pope said. \n\nKing's daughter Bernice, the head of the King Center, was on hand for the moment. \n\n\"I was deeply moved,\" King said in a written statement, \"to hear Pope Francis quote my father's words and invoke his name.\" \n\nPhoto Credit \n Distributed by Tribune News Service", "source": "Styrk.com"}