{"published": "2015-09-04T04:12:28Z", "media-type": "Blog", "title": "OSSTF Deal: Vote No?", "id": "228422e7-bc4a-45f5-bac7-e9eb8d6aaeec", "content": "This is a newly revised + expanded guest blog from our OSSTF Activist readers:\nWhy it may be worth “gambling” on a NO vote:\nIt means agreeing to a continued decline in our real incomes!!! The Memorandum of Settlement is not a net gain as would appear on first glance.  Consider the following realities of accepting the proposed contract: The “lump sum” of 1% during the 2015-2016 does not work to increase our base salary.  In effect, our salaries are s for another year. That set-back will be compounded for the remainder of our respective careers (i.e. we lose that 1% for each year following the 2015-2016 year). In 2012 our salaries were frozen for three years – that set-back is already “in the mix”.  In comparing our salary to the Cost of Living Increases since 2012, and an estimated yearly increase of 1.6% over the duration of the proposed contract we will observe significant gross losses in salary. (See Calculation Summary below) If we account for the cost of living over the 5 years (2012 - 2017) we will have worked ¼ of a year for free!!\nTHAT IS EQUIVALENT TO A HALF SEMESTER FOR FREE! Here are two examples of a teacher on the salary grid: “Level 3” Teacher who started working in 2003 School Year Gross Earnings (incl. delayed grid movement) Contract Gain % CPI % Salary with  grid movement and indexed to CPI Difference Total Loss 2011-12 $80, 256 We’ll use this salary as our base value of the last negotiated salary. 2012-13 $81, 641 0 1.5% $85, 111 $3, 470 $3, 470 2013-14 $85, 651 0 1.2% $89, 826 $4, 175 $7, 645 2014-15 $87, 449 0 2% $91, 622 $4, 173 $11, 818 2015-16 $88, 323 0 + 1% Lump 1.6%* $92, 539 $4, 215 $16, 033 2016-17 $88, 544 1% + 0.5% on 98th day 1.6%* $94, 019 $5, 475 $21, 508 * Estimates based on the average of the CPI% from previous three years. “Level 4” Teacher who started working in 2005 School Year Gross Earnings (incl. delayed grid movement) Contract Gain % CPI % Salary with  grid movement and indexed to CPI Difference Total Loss 2011-12 $76, 600 We’ll use this salary as our base value of the last negotiated salary. 2012-13 $78, 063 0 1.5% $81, 460 $3, 397 $3, 397 2013-14 $82, 055 0 1.2% $86, 132 $4, 078 $7, 475 2014-15 $85, 861 0 2% $91, 622 $5, 971 $13, 446 2015-16 $90, 140 0 + 1% Lump 1.6%* $96, 345 $6, 205 $19, 651 2016-17 $94, 007 1% + 0.5% on 98th day 1.6%* $101, 753 $7, 746 $27, 397 * Estimates based on the average of the CPI% from previous three years. It fails the fairness test:\nTeachers have been told that wage increases for us would be unjust to taxpayers.\nGiven that real incomes are rising across the province, and are expected to continue to do so, this austerity-based reasoning questionable.\nWe have already paid through a 5% decline in our real incomes between 2012 and 2014.  Under the proposed contract, the total decline in our real salaries (2012 and 2017) would, in all likelihood, exceed 10%.\nIf we continue to bear the financial burden, through decreasing real wages, the Provincial Government has little incentive to resolve its cash flow problem in other ways.\nAgreeing to this deal sends some troubling messages about what we think is OK: Shocking us with blatantly unacceptable demands (and then removing them) works, because we are so shocked that we will then accept anything. It is OK for the Province to arrive at the bargaining table empty handed. The enforced contract strips from 2012 will become permanent. There is a viable alternative: The negotiation process is equipped to cope with the rejection of a tentative deal. When negotiation recommenced, OSSTF would return with a mandate to raise the bar.\nSuggested Contractual/Bargaining Position(s) in terms of Compensation:      Immediate Lump Sum to off-set the freeze since 2012.          A provision of a cost of living adjustment as the minimum salary adjustment.  (See the accompanying Excel file to track other examples, noting that the calculations do not adjust  for movement across grid levels or leaves of absence.) [Ed: Most regretfully, Excel documents are not  compatible with my blog program. Ditto embedded charts and varied indentation features. In solidarity! David C]\nThe new teacher contract deals: How will you vote?!?\nPS: Guest blogs welcome!!! More info @ Link ]  COMMENTS:", "source": "David Chiarelli - Latest Edition!"}