{"published": "2015-09-27T00:00:00Z", "media-type": "News", "title": "India: Govt proposes panel to decide MPs’ pay and perks", "id": "d2b83e6f-7017-42b2-9704-16c5b381599b", "content": "Says the salary should reflect the level of responsibility and those with outside interests should not be deterred from entering Parliament \n\nNew Delhi: Amid demands that MPs should not be allowed to decide their salaries, the government has proposed to set up a three-member panel to recommend pay and perks of lawmakers. \n\nThe Ministry of Parliamentary Affairs has proposed a 3-member independent Emoluments Commission to recommend salaries and other allowances for the Members of Parliament. The proposal is part of the agenda notes prepared for the two-day All India Whips’ Conference to be held at Visakhapatnam, next week. \n\n“The setting up of an independent Emoluments Commission for recommending the salaries and allowances of the Members of Parliament will not only put to rest the public outcry and media criticism over MPs themselves deciding their salaries, it will also provide an appropriate opportunity to take into consideration the huge responsibilities and the important role they play in our representative democracy. \n\n“It would ensure that recommendations on Parliamentary salary are reached in a fair, transparent and equitable way. Once there is consensus on setting up of the Commission, the Salary, Allowances and Pension of Members of Parliament Act, 1954 will be suitably amended,” it said. \n\nThe general principles suggested by the Ministry for determination of salary are: it should not be so low as to deter suitable candidates or so high as to make pay the primary attraction for the job. It says the salary should reflect the level of responsibility and those with outside interests should not be deterred from entering Parliament. \n\nOne of the principles suggested is that those who choose to make Parliament a full-time career should be adequately rewarded to reflect their responsibilities. \n\nAs per Article 106 of the Constitution, salaries of MPs are determined by an Act of 1954, amended from time to time. The last revision in salary of MPs was made in 2010 during UPA II rule and the lawmakers at present get a basic salary of Rs50,000 (Dh2,774) per month. Salaries of Members of State Legislatures are decided as per Article 195 of the Constitution. \n\nAs per a comparative analysis of Members of Parliament in 37 developing and developed countries, basic salary of MPs are in the range of a meagre Rs7,952 in Tunisia to a high of Rs6,16,675 per month in Israel. MPs of only six countries — Tunisia, Venezuela, Sri Lanka, Nepal, Haiti and Panama are drawing salary less than that of Indian MPs. \n\nAccording to a survey conducted by Inter-Parliamentary Union (IPU) of 138 chambers from 104 Parliaments, 69 chambers indicated that it is Parliament which determines the salaries of members. 31 of these stated that MPs’ salaries are determined in reference to the Civil Service salary scale. In case of Bhutan, Namibia and the UK House of Commons, salaries are determined by independent bodies. \n\nAn MP in India gets a salary of Rs50,000 per month. In addition, Rs2,000 per day is paid as daily allowance when the MP signs the register while attending Parliament sessions or House committee meetings. The MP is entitled to Rs45,000 constituency allowance every month — Rs15,000 for stationery and Rs30,000 to employ secretarial assistance staff. \n\nMPs are also entitled for a government accommodation, air travel and train travel facilities, besides three landline and two mobile phones. \n\nThey also get a loan of Rs400,000 to buy a vehicle. \n\n— PTI", "source": "Gulf News"}