{"published": "2015-09-04T18:03:28Z", "media-type": "News", "title": "Executive of the Month: Gordon, senior vice president of Westcor: Leads fifth largest underwriter into the commercial market", "id": "d80ecc2a-dea3-4737-ba84-289f80279933", "content": "Jason Gordon, Westcor Land Title Insurance Company \n\n\r\n\t\t\t488 Madison Avenue - New York, NY \n \nNew York, NY Westcor senior vice president Jason Gordon is taking on New York City's commercial market. \n\nThese days Gordon co-heads the newly opened New York office of Westcor Land Title Insurance Company, the nation's fifth largest underwriter - that announced this spring it is entering the commercial market. He shares the responsibility with Westcor's senior vice president/director Carmel Caramagna. \n\nIndustry Leaders \n\nBoth are industry leaders who bring years of experience and solid relationships in the title industry. \n\n\"We are excited to enter the large national commercial marketplace and grow Westcor's reach,\" said Gordon. \"What's unique about Westcor is that we do not compete with our agents. We have local expertise in each jurisdiction and offer personalized, timely and responsive service to all our clients.\" \n\nThe opening of Westcor's New York City commercial office supports Westcor's 13 regional offices nationally, explained Gordon, who along with Caramagna, supervise a growing staff at the company's new office at 488 Madison Ave. where they and other Westcor agents work on some of the largest commercial deals in the city \n\n\"The New York City office is designed to support both our agents in the red-hot New York City commercial market as well as commercial work across the country,\" said Gordon. \"Each regional office supervises a staff of sophisticated title experts that operates in 48 states across the U.S.\" \n\nUntil now, the Florida-based company specialized primarily in residential transactions, but now they are taking on several larger players in the competitive and highly regulated title industry. \n\nWestcor is led by CEO Mary O'Donnell, who has transformed the title company over the last ten years from a regional west coast company to a national powerhouse. O'Donnell focused on growing the company using a tried and true method, one agent at a time and one employee at a time. \n\nWestcor's Growth \n\n\"We grew the company with the most experienced title professionals who had strong, local contacts that the company requires to penetrate the residential market in each region,\" said Gordon. \"During the downturn in 2008, we added employees while the rest of the industry worried about the bottom line. As a result, we have achieved all of our internal goals and now want to focus on the next logical step...the national commercial market.\" \n\n\"With our new commercial program we plan to significantly increase the company's revenue while maintaining the lowest average paid loss ratio in the industry,\" said Gordon, who said Westcor has seen commercial volume rise 300% over the last year. \n\nIn the New York office Westcor recently obtained reinsurance from a group of multi-billion dollar international reinsurers on transactions up to $100 million, and the commercial market in New York City has embraced the risk diversity Westcor brings to the commercial market, according to Gordon. \n\n\"Up until now, four companies essentially insured all of the commercial business in the United States,\" said Gordon. \"There was a dearth of capacity in the commercial market. Westcor fills the gap that existed...and approaches the business from a different perspective. Westcor leverages its balance sheet using reinsurance. The rest of the industry focuses on filling up all the risks it insures on a few small balance sheets.\" \n\nTop Credentials \n\nGordon, who is also a lawyer, came to Westcor from Fidelity National Title Insurance Company where he was vice president and counsel in the National Commercial office located in New York City. He also served on the board of directors for Fidelity National Title de Mexico and FNF Title Insurance Company Ltd (Malta). \n\nCaramagna joined Westcor from Houston Casualty Company where she was a senior vice president in the New York City office for the past eight years in charge of HCC's title reinsurance program. Before joining Westcor, Caramagna worked for Houston Casualty Company, ACE Capital Re and Chicago Title. She is also licensed to practice law in New York, New Jersey and Massachusetts. \n\nGordon and Caramagna have put a great team in place. They recently hired Michael Alfieri, Esq. as a senior commercial underwriter in the New York City office. \n\nAt Westcor, Alfieri will have senior approval authority over New York and national commercial transactions, coordinate multi-site transactions and approve high liability transactions for the company's 1,000 agents across the United States. Alfieri has over 20 years of commercial underwriting experience as well as his work with the county clerk's office. \n\nWestcor has also engaged McGladrey, LLP., a CPA firm and leading provider of assurance, tax and consulting, to assist with evaluation and enhancement of Westcor's new agency internal audit program for the benefit of lenders and consumers. The internal audit program, which would normally cost agents thousands of dollars on average, said Gordon, will be totally financed and supported by Westcor, the \"first such initiative by a major title insurance company.\" \n\nThe audit program gives banks and lenders comfort that the title industry professionals satisfy the criteria set forth under new regulations coming out this fall that will significantly affect the way real estate transactions are regulated and conducted going forward. Westcor created the innovative program to support its national agency base. \n\nWestor Land Title Insurance Company, the country's fifth largest underwriter, was founded in 1993 and headquartered in Maitland, Florida. It is a privately owned national title insurance underwriter with over 1,000 agents in 48 states and 11 regional offices. \n\nLast year Westcor wrote approximately $300 million in gross premium revenue. \n\nA California Native \n\nGordon earned his law degree at Southwestern University School of Law and attended UC Santa Barbara where he graduated with a bachelor's degree in psychology. He currently lives in Westchester County, in the town of Chappaqua, but he grew up in Calabasas, California. \n\nThese days when he's not closing commercial deals, Gordon, an avid sports fan, coaches several youth sports teams and is involved in charities with his wife and children. He also volunteers for VIP Sports, an organization which helps children with mental disabilities acclimate to traditional sports. \n\nGordon also gives his time and helps support UJA, Playworks, a youth activities program for underprivileged schools and the Storefront Academy in Harlem. \n  \nStory ran in the Owners, Developers & Managers / Design-Build section on 09/08/2", "source": "New York Real Estate Journal"}