{"published": "2015-09-14T08:00:00Z", "media-type": "News", "title": "The Journey: Tips to help teachers with retirement planning", "id": "4c23d4f8-d8fc-4c0f-ba1c-23e444b317b6", "content": "As teachers head back to class this fall, they may want to brush up on their own retirement picture. \n\nA report this year by the National Council on Teacher Quality found some grim financial statistics behind the $499 billion teacher pension system debt: \n\nPension funding ratios have declined in all but seven states since 2008. \n\nIn 29 states, teachers have been required to boost their pension contribution rates since 2008. \n\nIn 15 states, it takes 10 years for teachers to vest in their pension plans. Across all states, fewer than half of teachers stay in their districts long enough to vest in a pension, and just 20 percent stay long enough to achieve full retirement benefits. \n\nSo let's recap: Despite the financial recovery, teacher pension systems are on shaky financial footing, teachers are paying more into them and most won't see those coveted defined benefit paychecks at the end of their careers. Little wonder that college degrees related to teaching jobs dominated a recent CareerBuilder list of the degree completions with the greatest declines between 2010 and 2014. \n\nDave Grant, a financial planner and founder of Finance For Teachers, has been telling clients to prepare for retroactive cuts in retirement benefits, even once they are already retired. \n\n\"Be mindful of potential cutbacks and make sure you're not spending the entire pension\" on living expenses, said Grant, who is married to a middle school math teacher. \n\nFor teachers still on the job, he recommends saving 15 percent of pay, including employer contributions to retirement plans. \n\nHere are a few other homework items for teachers to consider: \n\nThat summer job is even more important now. Teachers have a long history of moonlighting in second jobs or over the summer months, and those extra funds are even more important now given the shaky hiring outlook and pension funding shortfalls. \n\nMelissa Scott, a 48-year-old private school teacher in Charlottesville, Va., has worked as a tutor on the side for several years, but recently signed on to a new service, Moonlighting (www.moonlightingapp.com which she says makes the payment system smoother and helps get her name out to a broad swath of potential clients. \n\nThe extra income helps her afford a 5 percent-of-pay contribution in a 403(b) plan at work, which her employer matches. \n\nShe doesn't have a traditional pension, and she's playing catch-up after depleting her retirement account more than 15 years ago to pay for some medical expenses for her daughter. \n\n\"My friends in public school are closer to being able to retire, but I love what I do,\" she said, citing more academic freedom in her current environment. \n\nYou still need to scrutinize your 403(b) plan. Despite federal regulations in place since 2010 that were supposed to tighten standards on these workplace retirement plans in which many teachers participate, there are still many plans offering annuities that charge expenses of 2.5 percent annually and carry 10-year surrender charges, said Dan Otter, founder of www.403bwise.com a website specializing in these accounts. The website offers a fiduciary pledge savers can copy and ask their advisers to sign. \n\nCalculate your Social Security income. This is more complicated for some teachers and other government workers because of the windfall elimination provision, which adjusts Social Security benefits if workers spent time in a public system where they and their employers didn't contribute. Knowing how much you'll actually collect in benefits will help you make more informed decisions about how much income your savings will need to generate in retirement. \n\nFinally, Grant said, consider your teaching career in context with the rest of your life. Married to someone who works in a corporate environment? Pick and choose among the best benefits at each employer, and explore the idea of diverting some savings to a Roth IRA, he said. \n\nMarried to another teacher and you both have traditional defined benefit pensions? Think critically about whether you need any more annuities in your 403(b) plan, he said. \n\nDivorced or widowed? Social Security could be a major component of your retirement income, so be sure to study the best claiming strategies for someone in your situation. \n\nABOUT THE WRITER \n\nJanet Kidd Stewart writes The Journey for the Chicago Tribune. Share your journey to or through retirement or pose a question at journey@janetkiddstewart.com.", "source": "Belleville News Democrat"}