{"published": "2015-09-16T20:12:07Z", "media-type": "News", "title": "Lakeland Industries, Inc. Reports Fiscal 2016 Second Quarter Financial Results", "id": "7d6cb4c1-b918-40dd-8455-69ede566c475", "content": "RONKONKOMA, N.Y., Sept. 16, 2015 /PRNewswire/ -- Lakeland Industries, Inc. (NASDAQ: LAKE), a leading global manufacturer of protective clothing for industry, healthcare and to first responders on the federal, state and local levels, today announced financial results for its fiscal 2016 second quarter ended July 31, 2015.\n\nFor financial reporting presentation purposes, the operating results in Brazil are excluded from many of the statements in this announcement because the Company's recent determination to exit Brazil has resulted in discontinued operations accounting. Commencing with its first fiscal quarter 2016 ended April 30, 2015, historical and future financial results from the Brazilian operations are reflected as discontinued operations in accordance with accounting principles generally accepted in the United States of America (\"GAAP\"). Discontinued operations accounting entails the reclassification of all of the financial results of the Brazil operations within the consolidated financial results of the parent company, and a restatement of prior periods to reflect the same treatment. The global operations of Lakeland Industries excluding Brazil are shown in financial reports as Continuing Operations. All information below has been restated to exclude Brazil, except where noted. On July 31, 2015, the Company completed a conditional closing of the sale of its wholly-owned Brazilian subsidiary (\"Lakeland Brazil\"), to Zap Comercio de Brindes Corporativos Ltda (the \"Transferee\"), a company owned by an existing Lakeland Brazil manager. This sale is pursuant to a Shares Transfer Agreement entered into on June 19, 2015. The transactions contemplated by the Shares Transfer Agreement, which shall be deemed to have been consummated as of July 31, 2015, are subject to acceptance of the shares transfer on the Commercial Registry by the Brazilian authorities, which is expected to be completed shortly. Although no assurances can be given in that regard, the Company expects the Commercial Registry processing of the shares transfer will not adversely affect the closing. Pursuant to the Shares Transfer Agreement, the Transferee will acquire all of the shares of Lakeland Brazil owned by the Company, and effective with the fiscal 2016 third quarter beginning August 1, 2015 the Company expects no further significant losses from discontinued operations, charges or expenses relating to Brazil beyond the existing accrual of $900,000 which was recorded in the fiscal second quarter financial results.\n\nFiscal 2016 Second Quarter Financial Results Highlights (from Continuing Operations, unless otherwise noted) Revenue Growth Sales were $29.5 million (\"M\") this year and $22.8M last year, an increase of 29.2%, with a portion of the growth resulting from orders received by Lakeland due to its unique operating platform during a period of industry capacity constraints. Margin Improvement and Expense Management Gross profit increased by 58.6% as compared to last year. Gross margin was 40.0%, compared to 32.6% last year, driven by a more favorable product mix including demand for disposable and chemical garments in response to a lack of industry capacity. Operating expenses worldwide increased by $0.5M and decreased as a percent of sales to 20.7% from 24.7% last year as a result of higher volume and Selling, General and Administrative Expenses (\"SGA\") largely being fixed other than freight out and commissions. Significant Increases in Operating Income, Adjusted EBITDA and Free Cash Flow.* Operating income increased to $5.7M from operating income of $1.8M last year. Operating income as a percentage of sales increased to 19.3% this year vs. 7.9% last year. Adjusted EBITDA worldwide this year was $6.1M vs. $2.1M last year. Free cash flow (defined as adjusted EBITDA less cash paid for taxes and less capital expenditures) increased from $1.5M last year to $5.5M this year. Excluded from free cash flow is a non-cash charge of $1.2M in connection with the Discontinued Operations in Brazil. Net Income Growth** Net income of $3.6M or $0.50 per share vs $0.6M and $0.09 per share for the three months ended July 31, 2015 and 2014, respectively. Net loss from discontinued operations, as of July 31, 2015 of $(1.6)M or $(0.22) per share vs. $(0.9)M and $(0.16) per share last year. Net income (loss) this year of $3.3M or $0.46 per share vs. $(0.4)M and $(0.07) per share last year for the six months ended July 31, 2015 and 2014, respectively. Balance Sheet Strengthened Cash and cash equivalents decreased by $1.6M from $6.7M at end of Q4 last year to $5.1M at end of Q2 with the payment of the arbitration settlement of $3.4M in cash while the revolver balance held steady. Net book value per share at July 31, 2015 was $9.34. We reached a settlement and paid off the remaining Brazil Arbitration debt yet ended the quarter with essentially the same revolver loan balance as at prior quarter end. Stockholders' equity increased by 6.8% from the beginning of the fiscal year.\n\n*Includes non-GAAP measures – see table included herein for reconciliation to GAAP measures\n\n**All shares presented are Basic, unless otherwise noted.\n\nManagement's Comments\n\nChristopher J. Ryan, President and Chief Executive Officer of Lakeland Industries, stated, \"The second quarter of fiscal 2016 marked the second consecutive quarter in which we reported a 500% increase in net income from continuing operations as compared with the respective prior year periods. Free cash flow from continuing operations in the second quarter of this year increased by 267% from the prior year, which followed a 105% increase for the first quarter. We attribute this growth to the hard work of our growing worldwide team along with organic growth from our recurring base of customers and our unique operating platform which has provided us with the ability to deliver large quantities of protective apparel for emergency and crisis situations where there are global capacity shortages. Simply put, we believe that no other protective apparel manufacturer in the world can be as responsive to market demands as Lakeland and still provide a high quality garment. We have continued to prove that we have the ability to scale production and have the manufacturing capacity and operational expertise to respond to market demand. Our consecutive quarterly growth rate, while not sustainable at the very high levels achieved during the first half of this fiscal year, demonstrates the leverage in our business and our enhanced presence in a total addressable market valued at nearly $7 billion globally. \n\n\"Lakeland's brand is increasingly being recognized around the world for the quality of its garments and the ability to deliver large quantities in periods of exigent demand. In the past twelve months alone, Lakeland has responded to the Ebola crisis in West Africa and the bird flu crisis in the United States, among other less significant events of incremental demand. Emergency requirements are nothing new to our industry but Lakeland is now better positioned than ever to participate in this unpredictable demand as \"the new go-to manufacturer\" for distributors, end users and government and military customers around the world. In turn, we are gaining market share and successfully executing on an organic growth initiative to convert these emergency customers into recurring buyers of our broad and expanding portfolio of protective apparel. \n\n\"Over the past several years we have continued to report annual sales growth from our traditional, non-emergency activities which we view as somewhat recurring in nature. We believe the quality of our revenues from continuing operations benefits from a growing global customer base where we estimate that approximately 90% of sales are for recurring demand. In the second quarter, our order flow reflected the quality and defensibility of our revenue base, which was evident despite seasonality and periodic slowdowns such as the current economic circumstances in China and the reduced demand globally within the oil and gas industry resulting from low oil prices. We have experienced increases in unit volume sales in most of our international businesses in the second quarter, although the impact of this demand has been muted by the strong dollar against most foreign currencies which reduces our reported financial results. In the US alone, sales in the fiscal 2016 second quarter of $19.5 million increased from the prior year period by 55%, driven by approximately $4 million in orders for disposable and chemical garments in response to the bird flu epidemic. Excluding this non-recurring demand, US sales grew by 23%. On a consolidated sales basis excluding orders relating to the bird flu epidemic, revenues during a strong quarter increased by nearly 12% as compared to the second quarter of fiscal 2015, despite the negative foreign currency impact.\n\n\"The turnaround strategy that we implemented nearly three years ago, including the steps to complete our exit from Brazil that we recently announced, has been executed with success. The strong improvement in our financial position and our exit from Brazil has provided us with the ability to direct our attention to global organic growth initiatives. We are now in our next phase of planning which includes the development of our management and sales teams, new product launches in response to customer demand, implementation of information systems and technologies to enhance performance, and capital investments to accommodate increased manufacturing capacity and distribution requirements. This plan is focused on long term growth in sales and profitability. Supported by the visibility afforded by our recurring customer base, our goal is to deliver an approximate double digit compounded annual revenue growth rate for the foreseeable future, which may further increase with the contributions of emergency events in any given year.\" Operating Results as Restated for Discontinued Operations ($ 000)\n\nReconciliation to GAAP Results Quarter Ended \n\nJuly 31, 2015 Quarter Ended \n\nJuly 31, 2014 Net sales from continuing operations $29,465 $22,812 Year over year growth 29.2% ----- Gross profit from continuing operations 11,795 7,437 Gross profit % 40.0% 32.6% Operating expenses from continuing operations 6,095 5,639 Operating expenses as a percentage of sales 20.7% 24.7% Operating income from continuing operations 5,700 1,798 Operating income as a percentage of sales 19.3% 7.9% Interest expense from continuing operations 210 517 Other (income) expense from continuing operations ----- 42 Pretax income (loss) from continuing operations 5,490 1,239 Income tax expense (benefit) from continuing operations 1,902 677 Net income from continuing operations 3,588 562 Non-cash reclassification of Other Comprehensive Income to \n\nStatement of Operations with no impact on stockholder's equity (1,286) ----- Loss from discontinued operations (837) (948) Loss before taxes for discontinued operations (2,123) (948) Income tax expense (benefit) from discontinued operations (569) ----- Net (loss) from discontinued operations (1,554) (948) Net income (loss) $2,034 $(386) Weighted average shares for EPS-Basic 7,145,418 5,924,524 Net income per share from continuing operations $0.50 $0.09 Net loss per share from discontinued operations $(0.22) $(0.16) Net income (loss) per share $0.28 $(0.07) Operating income from continuing operations $5,700 $1,798 Depreciation and amortization 228 258 Other income from continuing operations ----- (18) EBITDA from continuing operations 5,928 2,038 Equity Compensation 127 25 Adjusted EBITDA 6,055 2,063 Cash paid for taxes (foreign) 391 365 Capital expenditures 167 149 Free cash flow $5,497 $1,549 Operating Results as Restated for Discontinued Operations ($ 000)\n\nReconciliation to GAAP Results Quarterly results Six-Months \n\nEnded July 31, \n\n2015 Six-Months \n\nEnded July 31, \n\n2014 Net sales from continuing operations $54,284 $44,570 Year over year growth 21.8% ----- Gross profit from continuing operations 21,073 13,942 Gross profit % 38.8% 31.3% Operating expenses from continuing operations 12,154 11,286 Operating expenses as a percentage of sales 22.4% 25.3% Operating income from continuing operations 8,919 2,656 Operating income as a percentage of sales 16.4% 6.0% Interest expense from continuing operations 393 1,003 Other (income) expense from continuing operations 16 (37) Pretax income (loss) from continuing operations 8,542 1,616 Income tax expense (benefit) from continuing operations 2,794 700 Net income from continuing operations 5,748 916 Non-cash reclassification of Other Comprehensive Income to \n\nStatement of Operations with no impact on stockholder's equity (1,286) ----- Loss from discontinued operations (1,868) (1,302) Loss before taxes for discontinued operations (3,154) (1,302) Income tax expense (benefit) from discontinued operations (669) ----- Net (loss) from discontinued operations (2,485) (1,302) Net income (loss) $3,263 $(386) Weighted average shares for EPS-Basic 7,104,471 5,923,885 Net income (loss) per share from continuing operations $0.81 $0.15 Net loss per share from discontinued operations $(0.35) $(0.22) Net income (loss) per share $0.46 $(0.07) Operating income from continuing operations $8,919 $2,656 Depreciation and amortization 474 558 Other (income) expense from continuing operations (25) 23 EBITDA from continuing operations 9,368 3,237 Equity Compensation 255 49 Inventory reserve in USA and China – discontinued product lines \n\nraw material/finished goods ----- 300 PA plant shutdown costs ----- 235 Adjusted EBITDA 9,623 3,821 Cash paid for taxes (foreign) 995 672 Capital expenditures 474 238 Free cash flow $8,154 $2,911\n\nFinancial Results Conference Call\n\nLakeland will host a conference call at 4:30 pm eastern today to discuss the Company's fiscal 2016 second quarter financial results. The call will be hosted by Christopher J. Ryan, Lakeland's President and CEO, and Teri W. Hunt, Lakeland's Acting Chief Financial Officer. Investors can listen to the call by dialing 888-347-6609 (Domestic) or 412-902-4291 (International) or 855-669-9657 (Canada), Pass Code 10071831.\n\nFor a replay of this call through September 23, 2015, dial 877-344-7529 (Domestic) or 412-317-0088 (International) or 855-669-9658 (Canada), Pass Code 10071831.\n\nAbout Lakeland Industries, Inc.:Lakeland Industries, Inc. (NASDAQ: LAKE) manufactures and sells a comprehensive line of safety garments and accessories for the industrial protective clothing market. The Company's products are sold by a direct sales force and through independent sales representatives to a network of over 1,000 safety and mill supply distributors. These distributors in turn supply end user industrial customers such as chemical/petrochemical, automobile, steel, glass, construction, smelting, janitorial, pharmaceutical and high technology electronics manufacturers, as well as hospitals and laboratories. In addition, Lakeland supplies federal, state, and local government agencies, fire and police departments, airport crash rescue units, the Department of Defense, the Centers for Disease Control and Prevention, and many other federal and state agencies. For more information concerning Lakeland, please visit the Company online at www.lakeland.com.\n\n\"Safe Harbor\" Statement under the Private Securities Litigation Reform Act of 1995: Forward-looking statements involve risks, uncertainties and assumptions as described from time to time in Press Releases and Forms 8-K, registration statements, quarterly and annual reports and other reports and filings filed with the Securities and Exchange Commission or made by management. All statements, other than statements of historical facts, which address Lakeland's expectations of sources or uses for capital or which express the Company's expectation for the future with respect to financial performance or operating strategies can be identified as forward-looking statements. As a result, there can be no assurance that Lakeland's future results will not be materially different from those described herein as \"believed,\" \"projected,\" \"planned,\" \"intended,\" \"anticipated,\" \"estimated\" or \"expected,\" or other words which reflect the current view of the Company with respect to future events. We caution readers that these forward-looking statements speak only as of the date hereof. The Company hereby expressly disclaims any obligation or undertaking to release publicly any updates or revisions to any such statements to reflect any change in the Company's expectations or any change in events conditions or circumstances on which such statement is based.\n\nNon-GAAP Financial Measures \n\nTo supplement its consolidated financial statements, which are prepared and presented in accordance with Generally Accepted Accounting Principles (GAAP), the Company uses the following non-GAAP financial measures: EBITDA, Adjusted EBITDA and Free Cash Flow. The presentation of this financial information is not intended to be considered in isolation or as a substitute for, or superior to, the financial information prepared and presented in accordance with GAAP. The Company uses these non-GAAP financial measures for financial and operational decision making and as a means to evaluate period-to-period comparisons. The Company believes that they provide useful information about operating results, enhance the overall understanding of past financial performance and future prospects, and allow for greater transparency with respect to key metrics used by management in its financial and operational decision making. The non-GAAP financial measures used by the Company in this press release may be different from the methods used by other companies.\n\nFor more information on the non-GAAP financial measures, please see the Reconciliation of GAAP to non-GAAP Financial Measures tables in this press release. These accompanying tables include details on the GAAP financial measures that are most directly comparable to non-GAAP financial measures and the related reconciliations between these financial measures. LAKELAND INDUSTRIES, INC. AND SUBSIDIARIES\n\nCONDENSED CONSOLIDATED BALANCE SHEETS\n\n(UNAUDITED)\n\nJuly 31, 2015 and January 31, 2015 ASSETS July 31, January 31, 2015 2015* Current assets ($000's) ($000's) Cash and cash equivalents $5,065 $6,709 Accounts receivable, net of allowance for doubtful accounts of $446 and \n\n$484 at July 31, 2015 and January 31, 2015, respectively 15,711 13,277 Inventories, net of reserves of approximately $2,605 and $2,454 at July 31, 2015 and January 31, 2015, respectively 41,902 37,092 Deferred income taxes 84 1,144 Assets of discontinued operations in Brazil ----- 6,335 Prepaid VAT tax 1,657 1,717 Other current assets 2,773 2,361 Total current assets 67,192 68,635 Property and equipment, net 9,696 10,144 Assets held for sale 881 ----- Deferred income tax, noncurrent 13,101 13,101 Prepaid VAT and other taxes 173 173 Security deposits 80 113 Intangibles, prepaid bank fees and other assets, net 141 171 Goodwill 871 871 Total assets $92,135 $93,208 LIABILITIES AND STOCKHOLDERS' EQUITY Current liabilities Accounts payable $8,508 $7,763 Accrued compensation and benefits 1,047 1,120 Other accrued expenses 1,696 1,462 Liabilities of discontinued operations in Brazil 753 6,574 Current maturity of long-term debt 50 50 Current maturity of accrued arbitration award ----- 1,000 Short-term borrowing 2,746 2,611 Borrowings under revolving credit facility 8,897 5,642 Total current liabilities 23,697 26,222 Accrued arbitration award, less current portion ----- 2,870 Long-term portion of Canada loan 759 800 VAT taxes payable long term 118 60 Total liabilities 24,574 29,952 Stockholders' equity Preferred stock, $.01 par; authorized 1,500,000 shares\n\n(none issued) ----- ----- Common stock, $.01 par; authorized 10,000,000 shares,\n\nIssued 7,590,235 and 7,414,037; outstanding 7,233,794 and 7,057,596 \n\nat July 31, 2015 and January 31, 2015 respectively 76 74 Treasury stock, at cost; 356,441 shares at July 31, 2015 and January 31, 2015 (3,352) (3,352) Additional paid-in capital 64,130 64,594 Retained earnings 7,917 4,654 Accumulated other comprehensive loss (1,210) (2,714) Total stockholders' equity 67,561 63,256 Total liabilities and stockholders' equity $92,135 $93,208\n\n* Restated for discontinued operations\n\nNumbers may not add due to rounding LAKELAND INDUSTRIES, INC. AND SUBSIDIARIES\n\nCONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS\n\n(UNAUDITED)\n\nThree and Six Months Ended July 31, 2015 and 2014 Three Months Ended Six Months Ended July 31, July 31, ($000's)\n\nexcept for share information ($000's) except for share information 2015 2014* 2015 2014* Net sales from continuing operations $29,465 $22,812 $54,284 $44,570 Cost of goods sold from continuing operations 17,670 15,375 33,211 30,628 Gross profit from continuing operations 11,795 7,437 21,073 13,942 Operating expenses from continuing operations 6,095 5,639 12,154 11,286 Operating profit from continuing operations 5,700 1,798 8,919 2,656 Other income (loss), net from continuing operations ----- (42) 16 (37) Interest expense from continuing operations 210 517 393 1,003 Income before taxes from continuing operations 5,490 1,239 8,542 1,616 Income tax expense from continuing operations 1,902 677 2,794 700 Net income from continuing operations $3,588 $562 $5,748 $916 Non-cash reclassification of Other Comprehensive \n\nIncome to Statement of Operations (no impact on \n\nstockholder's equity) (1,286) ----- (1,286) ----- Loss from operations from discontinued operations (322) (948) (1,253) (1,302) Loss from disposal of discontinued operations (515) ----- (515) ----- Loss before taxes for discontinued operations (2,123) (948) (3,054) (1,302) Income tax benefit from discontinued operations (569) ----- (569) ----- Net loss from discontinued operations (1,554) (948) (2,485) (1,302) Net income (loss) $2,034 $(386) $3,263 $(386) Net income (loss) per common share – Basic: Income from continuing operations $0.50 $0.09 $0.81 $0.15 Loss from discontinued operations $(0.22) $(0.16) $(0.35) $(0.22) Net income (loss) $0.28 $(0.07) $0.46 $(0.07) Net income (loss) per common share – Diluted: Income from continuing operations $0.50 $0.09 $0.79 $0.15 Loss from discontinued operations $(0.22) $(0.16) $(0.34) $(0.22) Net income (loss) $0.28 $(0.07) $0.45 $(0.07) Weighted average common shares outstanding: Basic 7,145,418 5,924,524 7,104,471 5,923,885 Diluted 7,167,123 5,924,524 7,191,469 5,923,885 *Restated for discontinued operationsNumbers may not add due to rounding\n\nLogo - http://photos.prnewswire.com/prnh/20120611/NY21959LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/lakeland-industries-inc-reports-fiscal-2016-second-quarter-financial-results-300144306.html\n\nSOURCE Lakeland Industries, Inc.", "source": "Sys-Con Australia"}