{"published": "2015-09-06T22:36:43Z", "media-type": "News", "title": "Car show attracts thousands to Marshfield", "id": "a35bb657-8854-4639-9cb1-7634f3d10185", "content": "By \r \r\n\tJordan Tillery\r \nThe Patriot Ledger\r \r \r \r Posted Sep. 6, 2015 at 5:24 pm \r Updated at 6:01 PM \r \n  MARSHFIELD – Dinah Shore’s commercial jingle “See the U.S.A. in Your Chevrolet” poured through the speakers at the 35th annual Spindles Car Show. Thousands traveled to the Marshfield Fairgrounds on Sunday to see more than 700 old, restored, and custom cars and trucks. “There’s something for everyone,” Spindles Auto Club member, Chris Perrotta said. Thunderbirds, Mustangs, Camaros, and recently “tricked-out” cars lined up to be viewed and judged. Peter Anderson was just there to look, but is considering purchasing an older car. “I really like the look of that SS Chevelle,” Anderson said pointing to a shiny orange 1970’s Chevrolet. Many were there to admire the vintage vehicles, purchase cars for sale or parts at the swap-meet, but some were there for another reason entirely. Marshfield artist Ted Polomis attended the car show to get inspiration for his new paintings. Every angle of a metallic Tiffany-blue Corvette was photographed for Polomis’ newest endeavor. Last year’s show attracted more than 6,000 spectators, Spindles Auto Club member, Chris Perrotta said. “Usually people get into this because of their families,” Perrotta said about restoring cars. Nostalgia is the reason he got involved restoring old Ford station-wagons, which is what his father drove. The majority of the proceeds from the show’s entry fee and prize giveaways will go towards Dana-Farber Cancer Institute’s Jimmy Fund and Weymouth High School scholarship fund. Trophies were presented to the best-in-show vehicles and D.A.R.E. officers presented a trophy to the car voted “most likely to get pulled over.”", "source": "Wicked Local Marshfield"}