{"published": "2015-09-22T14:07:53Z", "media-type": "Blog", "title": "A Muted Secular Welcome for Pope Francis", "id": "a93ce04d-8f50-45d3-b668-e7d46e1076a3", "content": "Pope Francis will be arriving in the U.S. today, Tuesday. He has a crowded schedule ahead of him this week, with stops in Washington, D.C., New York, and Philadelphia. Among his other events, on Thursday he will be addressing a joint session of Congress--the first religious leader to do so.\n \n I sincerely hope the pope's trip goes well. His visit means a lot to millions of my fellow Americans. Although I do not share their religious beliefs, I can understand their enthusiasm and I respect their right to practice their religion, including holding mass events to celebrate the presence of the leader of their church.\n \n Sure, getting around the D.C. area, which is where I live and work, will be a nightmare, but given the traffic congestion we normally have, as well as our dysfunctional subway system, the difference in the level of gridlock will be a difference in degree rather than a difference in kind. We'll survive.\n \n And, as surveys confirm, even those of us who are not Catholic seem to like Pope Francis. He doesn't appear to be as much of a scold as Pope Benedict or John Paul II. Moreover, although he has not undertaken anything resembling a radical reform of the Church's antiquated, rigid doctrines or its ossified structure, he does seem to be a more compassionate figure, as indicated, for example, by his taking steps to make the Catholic Church more welcoming to gays and lesbians.\n \n That said, there is one aspect of his visit which bothers me, namely, the aforementioned address to a joint session of Congress. This sets an unfortunate and dangerous precedent. A religious leader has no business addressing the legislature of a secular nation.\n \n Please don't try to diminish the significance of this precedent by saying that Pope Francis is just another head of state. Everyone knows that the sovereignty of Vatican City is a legal fiction. Like many legal fictions it has served a useful purpose. Its creation in 1929 resolved a long-running dispute between the Catholic Church and Italy. (Indeed, it may be one of the few good, creative ideas that Mussolini had.) But the pope is not here because he is the theocratic ruler of 100 acres, nor was he invited to speak before Congress because of the tremendous power that Vatican City has as a nation. Pope Francis is here on a visit to the faithful of his church, and he was invited to speak before Congress because he is a spiritual leader of over 1 billion people, including about 70 million Americans.\n \n A bedrock principle of our secular democracy is that the government has no business interfering in religious matters, and it certainly has no right to show preferential treatment to a religious leader simply because many more Americans belong to his religious body. The truth of religious claims is not resolved by a popular vote. If we invite Pope Francis, the alleged Vicar of Christ, to address Congress, why not Thomas Monson, the Prophet who leads the Church of Jesus Christ of Latter-Day Saints? \n \n Furthermore, on what authority is Pope Francis going to predicate his address to Congress? When leaders of foreign states (real, not fictional states) address Congress, they provide the perspective of their country on matters of interest to the Congress of the United States. Pope Francis is going to present the perspective of -- who? God?\n \n Just as it is a cornerstone of our democracy that the government does not interfere with religious matters, likewise it is a fundamental principle of our democracy that religious doctrine should play no role in shaping government policy. The religious views of Pope Francis, whether laudable or lamentable, have no relevance to the policies and legislation of a secular state. At some point, you can bet Pope Francis is going to reference his understanding of God's word and the implications this has for our policies. But he has no standing to tell Congress or us what we should do based on his religious beliefs.\n \n Congress should never have invited Pope Francis to speak, and, to show respect for our secular democracy, he should have declined the invitation. \n-- This feed and its contents are the property of The Huffington Post, and use is subject to our terms. It may be used for personal consumption, but may not be distributed on a website.", "source": "Politics Blog on The Huffington Post"}