{"published": "2015-09-26T13:59:06Z", "media-type": "News", "title": "Natasha Dowie: Liverpool Ladies want silverware - we're used to winning", "id": "7b277b48-a0ce-4169-8f2c-1fa2dc82ac01", "content": "Striker admits it's been a tough season for Reds   \nLiverpool Ladies will take to the field for their final home Women’s Super League (WSL) game of the season on Sunday knowing they could have the destiny of the title in their hands. \n \nSadly this year – unlike the previous two – it will only be the Reds’ opponents Chelsea who have the chance of lifting the silverware. \n \nLiverpool pipped Chelsea to the title on a dramatic last day last season but it is the Londoners who are two points clear of Manchester City with just two games left this term. \n \nThe Reds can finish no higher than fifth in an eight-team league, an undoubted disappointment for a squad that was chasing a hat-trick of league titles. \n \nA scorer on that dramatic day in 2014 was Natasha Dowie and she comes into the end of this season in similarly good form. \n \nThe striker scored all four as Liverpool eased past Bristol 4-1 in the quarter final of the Continental Cup, setting up a home semi-final with Notts County Ladies. \n \nDowie has been a huge asset to Liverpool again this season, scoring 13 goals when no other player has managed more than three. \n \nShe told the ECHO: “It was great to get the win, to get through to the semi final. And it was brilliant to get four, against good tough opposition too. \n \n“In the first half of the season I felt my performance levels were good but I wasn’t scoring as many goals as I’d have liked. \n \n“It’s been different in the second half of the season. The arrival of (New Zealand striker) Rosie White has really helped me and my game has come on as we’ve clicked. I think I’ve got 10 of my goals in the second half of the season.” \n \nWith the league gone, Liverpool Ladies have placed a huge amount of focus on the Continental Cup and Dowie says any of the teams left would have been a difficult match. \n \n“Every team in the league is strong now. Look at Birmingham beating Chelsea, not many people would have seen that coming. Every team has top quality players. \n \n“But we really as players want to achieve something and bring silverware back to Liverpool. \n \n“We’re used to winning things every season. This is the furthest we’ve progressed in any of the cups so far and we want to go on and win it.” \n \n Natasha Dowie of Liverpool Ladies celebrates after scoring during the Women's Super League match between Liverpool Ladies and Sunderland AFC Ladies at Select Security Stadium on August 26, 2015 in Widnes, England. (Photo by Andrew Powell/Liverpool FC via ) \n \nInjuries to the likes of England World Cup star Farah Williams and world player of the year Asisat Oshoala – amid many others - have had a huge impact on Liverpool’s season. \n \nDowie says it has meant senior players like herself, Gemma Bonner and Becky Easton (now injured herself) have had to step up but she reserved special praise fro the youngsters who have come in for the Reds. \n \n“Ashley Hodson, Katie Zelem, Maz (Pacheco) at left back, they’ve done brilliantly, they’ve stood up and haven’t looked out of place. We’re not feeling sorry for ourselves.” \n \nChelsea’s visit to the Select Security Stadium on Sunday will be live on TV and Dowie is fully aware they will face a stern test from the Champions elect. \n \n“They’re a top team and have had a great season. But we want to finish as high up the table as we can. We’ll have a game plan and we’re in confident mood. We’ll have to be at out best and but we’re winners.” \n \nThe big news of the week for Liverpool Ladies has been the announcement of the departure of manager Matt Beard at the end of the season. \n \nHe has led them to two league titles and Dowie paid tribute on her Twitter page. \n \n“Played under Matt Beard when I was 18 at Charlton and now at LFC Ladies. He always believed in me and we have made memories for life. Good luck.” \n \nThe Liverpool striker is also hoping that her superb form can once again take the eye of England coach Mark Sampson after she narrowly missed out on the World Cup squad which finished third in Canada. \n \nShe said: “It’s England, I’ve had a taste of it and it’s a great honour. The most important thing is just to enjoy my football, keep scoring goals and play with a smile on my face. If I’m scoring goals he can’t ignore me. I’ll keep positive.” \n LFC Ladies v Chelsea: 7pm on Sunday at Halton Select Security stadium in Widnes. Tickets £5, £2.50 concessions. Anyone at Anfield for Liverpool v Aston Villa can enjoy free admission with their ticket stub or season ticket.", "source": "Liverpool Echo"}