{"published": "2015-09-18T12:25:00Z", "media-type": "News", "title": "L-A Hawks Football Tangle With Warriors", "id": "38fb0bc8-ad50-411f-b05f-ecaca005df53", "content": "CIBOLA COUNTY - The talk around the Laguna-Acoma huddle was all about preparing for the next upcoming game. Team captains Jacob Gallegos and Jacob Aragon expressed their desire to see their team ready for tonight’s game at Socorro. \n  \nTheir second road swing in three weeks, the Hawks have a lot to prove after last week’s loss to the West Las Vegas Dons. \n \nThe Hawks secondary was gassed and beaten on several plays that cost the team win number two. Tonight Socorro and its offense will test the Laguna-Acoma defense and it could look last week’s game. \n \nHead coach Rogrer Cordova understands his defense will face an offense the goes on the attack with a hurry-up no-huddle offense. \n \n“They like to throw the ball around a little and mix it up with a run,” Cordova said after seeing the Warriors on film. \n \nSenior quarterback Ricky Silva leads an experience team that is getting more comfortable running its offense every week. The Warriors will test the Hawks speed and depth with balls thrown down the field. \n \nIf Silva’s arm does not beat the Hawks, he can hand the ball off the junior running Mike Armijo who will happy to do it for him. Silva also has a downfield threat in 6-foot 3-inch Jonah Mauldin. \n \n“They will be a very formidable opponent,” Cordova added. \n \nMauldin a big target and could have a break out night against the Laguna-Acoma secondary. It will be up to the Hawks defense to limit Silva’s time and force him out of the pocket and having to make a play on the run. \n \nSecond year coach Quevin Redding brings some stability to a teams that had its last win against Academy in the 2012 season before defeating Shiprock in their first game of the season. Last week Socorro gave up 52 points in a loss to Bloomfield. \n \nLaguna-Acoma needed to figure out what Bloomfield did and attempt to recreate that magic in Socorro tonight. \n \nLast week the Hawks’ offense produced a few big plays, but they were few and far between while the other team found some magic of own beating Laguna-Acoma at home. \n \nCordova said Kameron Joe will have another week practicing with the first-team offense and will be ready to go. \n \nJacob Gallegos is a little banged up after last week, but Cordova said he will be ready to go come game time. \n \nSince the second quarter against Santa Fe Indian School, Gallegos is the Hawks dual offensive threat. However, every player wears down and Gallegos may be danger of doing just that after two weeks of carrying the bulk of the offense and also anchoring the Laguna-Acoma defense. \n \nCordova expressed earlier in the season that the Hawks would be thin in many positions and he is looking to see which back-up player can step in play at a high level. \n \nDefensively, Laguna-Acoma is going to get tested with every weapon Socorro has. It will be up to the Hawks defense to keep Silva on the move and not let him get set and throw the ball down field. \n \nThe Hawks offense will suffer if Gallegos is forced to make a play downfield on defense and then turn around be expected to do it again on offense. Joe’s big challenge tonight will be keeping the Socorro offense off the field and managing the game by producing long drives. \n \nKickoff is scheduled for 7 p.m. at Socorro High School. \n \n-3", "source": "Cibola County Beacon"}