{"published": "2015-09-09T10:31:48Z", "media-type": "News", "title": "Refugee crisis: Community rallies together at first collection in Stroud for Calais refugees", "id": "679167e1-5793-4bcc-b651-067ddf4eaf99", "content": "By Saul Cooke-Black  \n \n HUNDREDS of people across Stroud are offering their help to refugees fleeing war-torn nations.  \n \nDozens of bags full of clothes and other items were donated at Trainspotters in Libby’s Drive, off Slad Road, Stroud, yesterday as people from across the district rallied together. \n \nThe collection, organised by the group Stroud Supporting Calais Refugees, will continue at the same place this Saturday and Sunday from 10am. \n \n“It’s wonderful to see so many families and young people down here today,” said Bob Hilliard yesterday, who brought clothes and blankets for the collection. \n \n“I remember working with refugees in Austria in 1956, after the Second World War. I had hoped I would never see this type of crisis again.” \n \nAmongst those from the community who pitched in were a group of artistic children from a home-school group in Stroud. \n \nOn Monday they spent the day decorating a painted banner with their colourful footprints, highlighting the plight of refugees who had travelled thousands of miles to reach safety in Europe. \n \nAmong the creators of the banner were seven-year-olds Kaesha Sellors and her brother Flynn and Serena Moffet, three. \n \nNearly 2,000 people have joined Facebook groups which organise donations in Stroud since they were launched, with many saying they would offer a spare bedroom to refugees. \n \nItems collected will be taken to refugees in Calais in October, with a group currently fundraising to pay for the cost of the trip. \n \nEmma Bergsaurd said: “The amount of people getting involved in Stroud the last few days has been amazing. It was one of those things that just needed one person to get the ball rolling.” \n   \n Share article  \n   \nSarah Lunnon, who was there yesterday, added: “The response we’ve seen has been inspiring – it shows what a great community we live in.” \n \nFor more information on the collections, visit the", "source": "Milford Mercury"}