{"published": "2015-09-21T09:31:31Z", "media-type": "Blog", "title": "Turkey police block new migrant march to Greek border", "id": "4f42d160-2452-4e96-8247-afb32f8b237a", "content": "ISTANBUL:  A new march by migrants trying to reach Europe overland from Turkey was blocked by police outside Istanbul Monday. \n \nAround 700 mostly Syrian men, women and children from a group that had been blocked for the past week at Istanbul’s main bus station set out overnight on footfor the northwestern city of Edirne, 250 kilometres (150 miles) away. \n \nAfter spending the night camped on the hard shoulder of the motorway, some of the migrants, who carried bags over their shoulders, managed to clamber aboard buses or private vehicles. \n \nRead: 30,000 migrants now on Greek islands, 20,000 on Lesbos: UN \n \nBut a few hundred continued to walk along the emergency lane, in the midst of snarling morning traffic, before being brought to a halt by police about 50 kilometres (31 miles) from Istanbul, an AFP photographer witnessed. \n \nSituated around 10 kilometres (six miles) from the Greek border and 20 kilometres (12 miles) from the Bulgarian frontier, Edirne has become a new rallying point for migrants trying to reach Europe. \n \nEncouraged by the #Crossingnomore social media campaign, which calls for migrants to be allowed to travel overland to Europe rather than risk their lives at sea, around 2,000 refugees flocked to the city last week. \n \nRead: UN voices deep disappointment at lack of EU consensus on migrants \n \nHundreds more who attempted to follow in their path found themselves stuck in Istanbul after bus operators, acting on orders from the authorities, refused to sell them tickets for the journey. \n \nEdirne’s governor has warned that any migrants trying to smuggle illegally into Europe through his province will be returned to refugee camps in southern Turkey. \n \nOn Saturday, a group of migrants that spent five days camped behind police lines on the road outside Edirne, under a scorching sun, agreed to disperse after talks between a group of refugees and Prime Minister Ahmet Davutoglu. \n \n“We are ready to send people to countries who open their doors to them, but unfortunately no country has given a favourable response so far,” Davutoglu wrote afterwards on Twitter. \n \nRead: Migrants storm Budapest train as horror of crisis hits home \n \nMany of the Syrians pouring into Europe have been living in Turkey for months, sometimes years. \n \nTurkey has taken in over two million Syrians since 2011, of whom around 260,000 live in refugee camps. \n \nTheir “guest” status in Turkey gives them limited access to basic services and jobs, fuelling the current exodus to the European Union. \n \nThe post Turkey police block new migrant march to Greek border appeared first on The Express Tribune .", "source": "The Express TribuneThe Express Tribune"}