{"published": "2015-09-02T15:28:39Z", "media-type": "News", "title": "Presidential hopeful Rubio wants to lift 'outdated' oil export ban", "id": "f56dfb7d-ea60-4686-a89b-1a18fd1fd3dd", "content": "11:28 a.m. EDT \n \nWASHINGTON (Reuters) - Republican presidential candidate Marco Rubio would lift the ban on exporting crude oil soon after taking office if he is elected, the Florida senator will say Wednesday in a speech previewing his energy strategy. \n \n\"This ban is a perfect example of just how outdated Washington has become. Lifting the crude-oil export ban will be an immediate boon to our economy,\" Rubio will say, according to excerpts of his speech to the Oklahoma Independent Petroleum Association released by his campaign. He was due to give the speech in Oklahoma City at 2:30 p.m. EDT. \n \nRubio plans to lay out a more detailed energy agenda this autumn but will highlight some of his priorities, including lifting the four-decade ban on exporting domestic crude oil overseas, and blocking the Obama administration's new carbon emission limits on power plants and other regulations. \n \nOil producers are pressing for a full repeal of the crude export ban to keep the domestic drilling boom alive, in addition to recent steps by the Obama administration to allow some exports of ultra-light crude oil and exports of lighter U.S. crude oil in exchange for imports of heavier Mexican oil. \n \nThe issue will be debated in Congress this fall, but sponsors of legislation to lift the ban – Republican Senator Lisa Murkowski of Alaska and Democratic Senator Heidi Heitkamp of North Dakota – need to secure more Democratic votes. \n \nRubio will take aim at Democratic rival Hillary Clinton in his speech and say she will only continue the country's outmoded energy policies. \n \nClinton has declined to reveal her position on the proposed and controversial Keystone XL oil pipeline from Canada, but has said she would go further than President Barack Obama in supporting clean power, and has parted with his administration's position favoring Arctic drilling. \n \n\"Unfortunately, what we hear from Hillary Clinton are more of the same ideas from yesterday – and that's when she speaks up on the issue at all,\" Rubio will say, according to his prepared remarks. \n \n(Reporting By Valerie Volcovici; Editing by Jonathan Oatis)", "source": "WHTC.com"}