{"published": "2015-09-14T04:39:35Z", "media-type": "News", "title": "$A to push down towards 60 US cents", "id": "443c6246-5a21-4351-9d72-73bd46d78030", "content": "That trip to the US is going to get more expensive because the Aussie dollar is headed downwards toward 60 US cents in the coming year. \n\nRecent share market turmoil, worries about the Chinese economy and the looming interest rate rise by the US Federal Reserve have sent financial institutions scrambling to downgrade their Australian dollar forecasts. \n\nAll of the big four banks, and most of the others, now say it will drop well below 70 US cents in the coming six months. \n\nThe Aussie dollar has lost around a quarter of its value in the past 12 months, from 94 US cents last September. \n\nAMP Capital chief economist Shane Oliver is one of the many predicting the Aussie dollar could fall further. \n\n\"Notwithstanding occasional bounces, the broad trend in the Australian dollar is likely to remain down as the Fed is still likely to raise rates sometime in the next six months,\" he said. \n\n\"The Australian dollar is expected to fall to 60 US cents in the next year or so, with the risk that it will go even lower.\" \n\nDr Oliver said the large share market falls of late aren't over, which will put added downward pressure on the local currency. \n\nThe good news is that a lower Australian dollar boosts exports by making them cheaper, increases tourism from overseas and makes locally produced goods more competitive with imports. \n\nUBS economists Scott Haslem and George Tharenou said tourism was already emerging as one of the economy's bright spots. \n\n\"The Australian dollar's steady move lower from over parity with the US dollar in mid-2011 has been a key driver, and its sharp decline over the past month is likely to underpin a further pick-up in tourism activity,\" UBS said. \n\n\"For overseas arrivals, growth has picked up from being flat in 2011 when the Australian dollar was near parity.\" \n\nSt George was the only institution surveyed by AAP to say that the Aussie dollar would be above its current level of 71 US cents by the end of the year. \n\n\"In our view, markets have taken an overly pessimistic view on the outlook for China, the domestic economy and interest rates,\" senior economist Janu Chan said. \n\n\"We are maintaining our end-of-year forecast at 73 US cents, but we recognise that downside risks exist for our forecast while sentiment remains fragile.\" \n\nMs Chan said that while a rebound in the Australian dollar was likely, she didn't expect a sustained rally. \n\n\"It will likely come under downward pressure over the course of 2016, as the tightening cycle of the Federal Reserve takes hold and we expect the Australian dollar to track close to 70 US cents throughout early next year.\"", "source": "NineMSN Finance"}