{"published": "2015-09-21T21:01:45Z", "media-type": "News", "title": "Aberdeen Greater China Fund, Inc. Announces Change In By-Laws And Corporate Governance Guidelines", "id": "f11655cd-f181-450f-b2dc-3309b11feeeb", "content": "PHILADELPHIA, Sept. 21, 2015 /PRNewswire/ -- Aberdeen Greater China Fund, Inc. (NYSE:GCH) (the \"Fund\"), a closed-end equity fund, announced today that the Fund's Board of Directors (the \"Board\") approved enhancements to its corporate governance to align with best practices for Board election and ongoing service.  Specifically, the Board approved an amendment to the Fund's By-Laws, to become effective on September 30, 2015, to provide for the election of the directors by a majority of the votes cast at a meeting of shareholders at which a quorum is present, except in contested elections, where a director shall be elected by a plurality vote. The Fund's By-laws previously provided that directors be elected by a plurality vote in all director elections. \n\nAt the same time, the Fund's Board of Directors approved amendments to certain corporate governance guidelines for the Fund to become effective on September 30, 2015.  The corporate governance guidelines include (i) a resignation policy, which generally provides that a director who does not receive a majority of votes \"For\" his or her election at a meeting of shareholders shall be deemed to have tendered his or her resignation, subject to the Board's acceptance or rejection of such resignation, which Board determination will be disclosed publicly to Fund shareholders; and (ii) a policy requiring that after an Independent Director has served on the Board for three full terms of three years following the later of the appointment of the Fund's then-current investment manager of the Fund or the initial election of the director by the Fund's stockholders to the Board, the Director will be put forth for consideration by shareholders annually. The failure to obtain a majority of votes cast will trigger the resignation policy described above. \n\nClosed-end funds are traded on the secondary market through one of the stock exchanges. The Fund's investment return and principal value will fluctuate so that an investor's shares may be worth more or less than the original cost. Shares of closed-end funds may trade above (a premium) or below (a discount) the net asset value (NAV) of the Fund. There is no assurance that the Fund will achieve its investment objective. Past performance does not guarantee future results. \n\nIf you wish to receive this information electronically, please contact InvestorRelations@aberdeen-asset.com \n\naberdeengch.com \n\nLogo - http://photos.prnewswire.com/prnh/20121106/NE07292LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/aberdeen-greater-china-fund-inc-announces-change-in-by-laws-and-corporate-governance-guidelines-300146484.html \n\nSOURCE Aberdeen Greater China Fund, Inc. \n\nPublished Sep. 21, 2015 \n\nCopyright © 2015 SYS-CON Media, Inc. — All Rights Reserved. \n\nSyndicated stories and blog feeds, all rights reserved by the author.", "source": "Virtualization Conference & Expo"}