{"published": "2015-09-11T02:04:54Z", "media-type": "News", "title": "Mandarin Oriental Launches Think Pink Campaign", "id": "e0481984-c5b8-46be-9f31-4d25fe807d2a", "content": "This October, think pink for a good cause by supporting art talents and indulging in the delightful afternoon tea With October arriving in a blink of an eye, Hong Kong will transform into a pink city by all the creative initiatives and campaigns in support of the Breast Cancer Awareness Month. \n\nThink Pink campaign returns to Mandarin Oriental for the second year from September 29 to October 27, featuring a plethora of activities ranging from art exhibitions, dining and auctions. \n\nGuests can appreciate the works of more than 30 participating local and international art talents in the art exhibition, which also includes artists from around the world, ranging from the US, UK, Kenya and Mexico. \n\nThink Pink was created in 2014 by The Antithesis, a Hong Kong-based creative studio headed by Ann Tsang. Paying tribute to the themes of “love”, “pink”, and “women”, the exhibition this year will showcase a spectacular range of artworks that celebrate womanhood and the alluring colour. \n\nAn online auction will also be held throughout October. Taking center stage in this project will be a pink-themed auction evening on the evening of October 29 at The Space. Funds raised from the auction will be donated to the Hong Kong Breast Cancer Foundation. \n\nGourmets will also be delighted by the Think Pink afternoon tea set created by Executive Pastry Chef Yves Matthey, which is available throughout the same period as the art exhibition. \n\nClipper Lounge, Mandarin Oriental, 5 Connaught Road Central, Central; +852 2825 4007\n\nTags: Mandarin Oriental, Afternoon Tea, Clipper Lounge, Think Pink, Breast Cancer Awareness Month, The Antithesis Have a moment? Tell us a little more about yourself below (optional)\n\nJavascript is disable!\n\nPlease enable Javascript and refresh to access the site.", "source": "Hong Kong Tatler"}