{"published": "2015-09-17T17:16:00Z", "media-type": "News", "title": "Enter for Your Chance to Win a Resilient Roof Upgrade from the Great Hurricane Blowout and BASF Corporation", "id": "0f04243a-0d66-48c2-862b-7c02f61a8025", "content": "TALLAHASSEE, Fla. , Sept. 17, 2015 /PRNewswire-USNewswire/ --  BASF Corporation is providing one resilient roof upgrade through the Great Hurricane Blowout . With peak hurricane season upon us, the time is now to protect your home from high wind and rain. One lucky family will win a resilient roof upgrade that includes a closed-cell spray polyurethane foam insulation application, and meal and lodging accommodations for the date of installment. \n \n\"The roof of a home is one of the most crucial pieces to the overall security of a structure in a weather event,\" said Engineer and Federal Alliance for Safe Homes SVP Tim Smail. \"A resilient roof upgrade provides peace of mind and can help keep families safe and secure no matter where they live.\" \n \nVisit the Great Hurricane Blowout before November 30, 2015 to enter online. Please view the full sweepstakes rules and eligibility requirements prior to entering. \n \nAbout the Great Hurricane Blowout \nThe Great Hurricane Blowout is a first-of-its-kind hurricane preparedness campaign presented by the Federal Alliance for Safe Homes (FLASH), and designed to help families prepare in advance for hurricane season. \n \nAbout FLASH \nFederal Alliance for Safe Homes (FLASH), a 501(c)3 nonprofit organization, is the country's leading consumer advocate for strengthening homes and safeguarding families from natural and man-made disasters. FLASH collaborates with more than 120 innovative and diverse partners that share its vision of making America a more disaster resilient nation including: BASF, Federal Emergency Management Agency, Florida Division of Emergency Management, The Home Depot®, International Code Council, Kohler® Generators, National Weather Service, Portland Cement Association, Simpson Strong-Tie®, State Farm™, and USAA®. In 2008, FLASH® and Disney opened the interactive weather experience StormStruck: A Tale of Two Homes® in Lake Buena Vista, FL. Learn more about FLASH and gain access to its free consumer resources by visiting www.flash.org or calling (877) 221- SAFE (7233). Also, get timely safety tips to ensure that you and your family are protected from natural and man-made disasters by subscribing to the FLASH blog – Protect Your Home in a FLASH , and following the FLASH Twitter and Facebook accounts. \n \n  \n \nSOURCE  Federal Alliance for Safe Homes (FLASH) \n \nRELATED LINKS \nhttp://www.flash.org", "source": "PR Newswire"}