{"published": "2015-09-23T21:44:42Z", "media-type": "News", "title": "Sausalito and Sustainable Tourism", "id": "38b5c863-ab47-462f-8306-3f46679fe713", "content": "How does a small town like Sausalito (7,000 residents) take advantage of tourism and the economic benefits it generates, but also manage the influx of visitors? How do we provide the infrastructure to support and welcome a million visitors every year, but not be overwhelmed by them? It’s called “sustainable tourism” and in my opinion it is an attainable state; it has in fact been very successful in other communities. There are lessons to be learned. \n\r\n\r \nThe tourists are not going to go away. Sausalito is a world class destination. No one wants to be the “anti-tourist, unfriendly” Marin County city. Even Sausalito civic leaders will say they are not opposed to tourism as they recognize the fiscal benefits associated with it. But most agree it needs to be better managed; whether it’s the bicyclists descending into town after an iconic ride across the Golden Gate Bridge, the hundreds of thousands getting off the ferry from San Francisco every year (it is, after all ranked by travel writers as the second most spectacular ferry ride in the world) or those arriving by car to dine along the waterfront, or catching a shuttle to the legendary Muir Woods. Sausalito is a gateway to the famous California wine country and west Marin. It is a popular and much heralded destination – by land or by sea. \n\r\n\r \nTo be clear, I am not opposed to tourism. I am proud of what Sausalito has to offer and believe our city could not thrive as it does without the dollars these visitors bring to town. Between the Transient Occupancy Tax (TOT) that the city collects from restaurants, hotels and retailers (over a $1 million a year) and the other taxes and fees that businesses in Sausalito generate, it is estimated that 50% of the City’s operational budget is derived from local business, specifically the tourist/hospitality industry in town. Sausalito would be hard pressed to find alternative resources to fund their infrastructure improvements, parks, libraries and other city services if it weren’t for the income our visitors generate. \n\r\n\r Managing Not Deterring Tourism \r\n\r \nI do believe that Sausalito needs to manage its tourism industry better and not deter it. A bike valet program is great, but right in the middle of an already congested three-block area in the center of town? The city needs to move the masses from this crowded area of downtown where the ferry lands, the buses park and the taxis wait. Spreading the transport support system even a few blocks further north would ease the current grid lock. \n\r\n\r \nDriving more commerce to Caledonia and other parts of town is not a bad idea as it expands Sausalito’s corridor of commerce. Staging shuttles and bike parking at Cavallo Point or further north, offering ferry and water taxi service in other areas, taking advantage of bicycle trailers where tourists can drop their bikes and not worry about getting them back to the city are all possible solutions. Even investing in infrastructure and improvements in the Marin Ship (red flag, red flag!) would all be wise considerations. I am not suggesting we pave paradise and put up a parking lot, but a walking and bike path along the shoreline would help relieve some of the downtown congestion. \n\r\n\r \nNo one wants taxis and tour buses taking over neighborhoods or souvenir shops and bars displacing pharmacies and green grocers as they have in Venice and Barcelona. Sausalito has done a decent job of controlling growth through their zoning – no big box stores or “chain stores” have been allowed for years; ostensibly, only independent retailers are allowed (although the formula retail ordinance is often loosely interpreted and needs revision). Tour buses are required to exit town to the north, not the south; there are more bike racks; there are bicycle ambassadors. The Chamber has done a stellar job of assisting with the downtown congestion via their information kiosk and working with Golden Gate Transit to manage the bicycle loading on and off the ferries. \n\r\n\r \nI am not suggesting that nothing has been done. There is at long last even a Marin Ship Steering Committee to suggest revisions to the Marin Ship plan which is seriously outdated.  Strides have been made; just not enough or fast enough. \n\r\n\r Low Volume-High Value Tourism \r\n\r \nIn a great New York Times article by Elizabeth Becker (July 17, 2015), the author chronicles how other cities are tackling the problem. Denmark, she notes, welcomed over 9 million tourists last year; they have a population of fewer than 6 million. They have “quiet zones” in residential sections of Copenhagen; they have prohibited foreigners from buying vacation homes in their coastal areas and they have a bicycle-friendly transportation system to include tourists and locals alike. \n\r\n\r \nIn France, the most visited country in the world, tourism has actually contributed to the protection and nurturing of the country’s culture, landscape and quality of life. As Becker writes: “In practical terms, that means tourism is promoted and subsidized, but also regulated, at all levels of government, in all matters of policy.” \n\r\n\r \nThe Effiel Tower is the most heavily visited paid attraction in the world, with 7 million visitors a year. Tickets are limited and timed, security it discreet but significant, loitering is forbidden and street vendors are strictly regulated. Paris is first and foremost for Parisians but still welcomes and manages its tourists. Sausalito should do the same. \n\r\n\r \nGranted these are larger cities, but the issues are the same and perhaps more dramatic in a smaller town such as Sausalito. \n\r\n\r \nThe key concept is low volume, high value tourism quality vs. quantity. More discerning visitors who spend more time and more money in town and low impact local businesses that drive high-volume dollars. Clearly there needs to be more conscientious consideration at City Hall when it comes to what sorts of businesses are let into town. Business should be resident serving as well as tourist friendly. \n\r\n\r \nCampaigns that target more high value tourism and generate tourist traffic during off-seasons and mid-week could help, as would special events in slower seasons that bring well-heeled visitors to town. Sausalito has a limited number of hotel rooms and even fewer large event spaces, but by targeting corporate meeting planners, destination management companies and bringing in small to medium groups on expense accounts who stay for more than an ice cream cone and a day seems to be a viable approach for cultivating a different tourist clientele. \n\r\n\r Leadership at City Hall \r\n\r \nMost importantly, as I have noted in previous blog posts, there needs to be more leadership at City Hall, more governance and more effort to promote sustainable tourism. There is a city appointed Hospitality Committee, a Business Advisory Committee, a Chamber of Commerce – there are many bodies in place that can work together to better balance the impact of tourism. And they need to be supported by our civic leaders.  \n\r\n\r \nWhile I am all for managing tourism in a sustainable fashion, I am not an advocate of the current petition circulating in Sausalito which calls for a ballot initiative next year which would force City Hall to adopt a plan for dealing with tourism. In my mind, tourism is a constant issue for the city, it should always be on their agenda and a serious budget issue based on the demand it places on city services, but not something forced by the voters in an election year. City Hall should always be working on striking a balance and achieving sustainable tourism. \n\r\n\r \nThe City of Sausalito should adopt a better plan, as residents have argued, but making it a ballot issue politicizes an already divisive town further in my mind. I do however agree with local resident Russ Irwin however, when he says “tourism will shape us if we don’t shape it.”", "source": "Marin Magazine"}