{"published": "2015-09-08T07:00:00Z", "media-type": "News", "title": "Southport mum-of-two is trekking 200 miles to the North Pole in a recording breaking expedition", "id": "66e01519-4b45-4958-b47d-ce35bc72d599", "content": "Southport mum, Moira Bowen, has been selected to take part in one of the most ambitious polar expeditions to date. \n \nAs part of the Ice Warrior project, led by Arctic Explorer Jim McNeill, Moira will trek for 20 days in an attempt to become the first team in history to reach the Northern Pole of Inaccessibility. \n \nIn aid of Library in the Gardens (a charity launched after Sefton Council closed 13 of its libraries) and Girls Out Loud charity, Moira, 49, needs to raise £25,000 before the end of the year. \n \nMoira said: \"I applied earlier in the summer and was selected last month after an intense selection camp in Dartmoor. \n \n Photo of a previous Ice Warrior exhibition \n \n\"The expedition is an 80 day trek split into quarters so I am doing 20 days of it, leaving in the spring next year. \n \n\"When I was 24, I sailed across the Atlantic and the year after I cycled across America. I love these sorts of things, and now as my girls are 12 and nine-years-old and I am turning 50 next year, I thought now is the perfect time to get back into it.\" \n \nDefined as the furthest point from land on the Arctic Ocean, the Northern Pole of Inaccessibility remains the last significant place in the Polar Regions to be reached by man. \n \nIt sits over two hundred miles further north than the Geographic North Pole and 800 miles from the northern shores of Canada. \n \n Moira Bowen with her two daughters \n \nMoira, who works as a cognitive behavioural therapist for Access Sefton , said “I am incredibly excited at this chance to be part of something so momentous and adventurous. \n \n\"Even before we leave for the Arctic, it’s going to be a real challenge to get myself fit enough and prepare for the rigours of being in the intense cold. \n \n\"At home I keep fit by running around after my kids, but the quest for the Last Pole takes the concept of challenge to a whole new level.\" \n \nIn preparation Moira is undergoing a comprehensive and intensive training programme. \n Moira has launched a website for friends, family and those interested to track her progress and donate to two worthy causes. Go to \"Mum in the Arctic\" here .", "source": "Southport Visiter"}