{"published": "2015-09-12T21:35:23Z", "media-type": "Blog", "title": "ASSPUK, JISGE and UK KFA support statement of DPRK History Society", "id": "46c26006-4a6b-488c-8e8f-79d53af9fa36", "content": "ASSOCIATION FOR THE STUDY OF SONGUN POLITICS UK http://www.uk-songun.com/index.php email juche007@yahoo.co.uk                London 12th of September Juche 104(2015)\nThe Association For the Study of Songun Politics UK(ASSPUK), the Juche Idea Study Group of England(JISGE) and the UK Korean Friendship Association(UK KFA) today issued a joint statement in support of the statement of the DPRK History Society concerning the \"Korean Provisional Government in Shanghai\";\nFirstly , it ill becomes the current south Korean ruler to comment on the \"Korean Provisional Government in Shanghai \" as the puppet regime established by the US suppressed those associated with the \" \"Korean Provisional Government in Shanghai\" and even went to the extreme of murdering its prime minster Kim Ku. Thus is a case of double standards by the south Korean puppet regime.\nSecondly, the south Korean puppets are trying to elevate the so -called \" \"Korean Provisional Government in Shanghai \" as some kind of force for the salvation of Korea and a \"\"base for struggle for independence\", whereas in reality the \"Korean Provisional Government in Shanghai \" was a few bourgeois nationalists divorced and isolated from the masses. In actual fact, as the DPRK History Society  correctly points out, the Korean Provisional Government in Shanghai was heavily dependent on the reactionary Kuomintang (Chinese nationalist party ) . As the statement says \" It is a well-known fact that since its establishment in Shanghai, China in April 1919 till its disbandment in August 1945 the \"Korean Provisional Government in Shanghai\" barely kept its existence under the care of the Chiang Kai-shek-led Nationalist Party\". It is pure nonsense for the south Korean puppets to try and promote the provisional government as some kind of liberation force. This is a grave distortion of history .\nWe condemn the south Korean puppets for the distortion of history as well as fraudulent hypocrisy .\nASSPUK\nJISGE\nUK KFA", "source": "Anglo-Peoples Korea/Songun"}