{"published": "2015-09-03T03:55:35Z", "media-type": "News", "title": "Lake Tyers father of six Martin Townsend jailed for manslaughter", "id": "a4da5159-4cbe-4e62-869e-c7803c8c2387", "content": "A father of six to three different women who killed a man he wrongly suspected of being a love rival has been jailed for seven years. A father of six to three different women who killed a man he wrongly suspected of being a love rival has been jailed for seven years. Supreme Court Justice Stephen Kaye said Irishman Martin Townsend, 58, had moved to Lake Tyers in East Gippsland after retiring as a truck driver and formed a close relationship with highly respected Indigenous elder Gina Wilkinson.\n\nJustice Kaye said Ms Wilkinson, who played a central supporting role for the Lake Tyers Aboriginal community, had vowed to continue to support Townsend despite what he had done.\n\nTownsend, a chronic alcoholic suffering from depression, pleaded guilty to the manslaughter of Ronald Wilson on April 1, 2014.\n\n\"I accept that the assault by you on Wilson was not premeditated,\" Justice Kaye told Townsend on Thursday when jailing him for seven years with a non-parole period of five years.\n\n\"Rather, it was fuelled by your state of intoxication, and by your misconceived anger and jealousy in respect of the friendliness which Ronald Wilson showed to Gina Wilkinson.\"\n\nJustice Kaye said that during Townsend's pre-sentence hearing, Ms Wilkinson had described how he had been very supportive and caring in helping her look after a frail family member at home.\n\n\"You have never been physically or verbally violent towards Ms Wilkinson, or any member of her family,\" the judge said. \"You respect Ms Wilkinson's Aboriginal heritage, and have properly contributed to the running of her household.\"\n\nTownsend killed Mr Wilson when staying at a property owned by Ms Wilkinson which was part of Lake Tyers Aboriginal Trust.\n\nMs Wilkinson had invited a group of friends, including Mr Wilson, to her home to celebrate her daughter's 40th birthday.\n\nThe judge said Mr Wilson had been drinking quite heavily in the afternoon before he approached Ms Wilkinson and propositioned her.\n\n\"Apparently, you and Ronald Wilson had previously got on quite well together, and you were on quite friendly terms with each other,\" the judge told Townsend. \" However, you tended to be protective of your relationship with Gina Wilkinson. Gina treated Wilson like a nephew, and as a result you were prone to become very jealous when Wilson was with her.\"\n\nHaving gone inside to have a sleep after being reassured by Ms Wilkinson that she only cared for him, Townsend went out into the backyard at about 7pm to find Mr Wilson being very affectionate towards her.\n\n\"When you saw Wilson talking to Gina, you approached them. You warned Wilson to stay away from Gina, and you said that you would hit him if he did not stay away from her,\" the judge said.\n\nTownsend again approached Mr Wilson about 20 minutes later, called him a dog and punched him in the face. Wilson was stunned, and said, \"What the f--- are you doing?\"\n\n\"You walked in front of him, and punched him (again) with your right fist to his left temple. As a result of the force of the punch, Wilson fell backwards and landed heavily on his back close to a fire hydrant on the grass. After Wilson fell, he was motionless. Then he started to convulse.\"\n\nMr Wilson was taken by ambulance, which had arrived an hour after being called, to Bairnsdale Hospital where he was pronounced dead on arrival. The story first appeared on The Age.", "source": "Bendigo Advertiser"}