{"published": "2015-09-16T20:08:36Z", "media-type": "News", "title": "NASA pushes 1st flight of Orion spacecraft with crew to 2023", "id": "693be7db-9e99-4d6a-ae42-175699d8e8c6", "content": "CAPE CANAVERAL, Fla. – NASA’s newest spacecraft, the Orion , won’t be flying astronauts as soon as anticipated. \n\nOn Wednesday, top NASA officials said there isn’t much confidence in the original 2021 launch date. That’s because of the space agency’s history of running into unexpected problems in new programs, like Orion. \n Story continues below    \nManagers set 2023 as the new official launch date for the capsule, although they said they haven’t entirely given up yet on 2021. \n\nOrion is meant to expand human exploration in space, principally Mars. The 11-foot capsule will blast off atop a megarocket still under development by NASA, called SLS for Space Launch System. An unmanned test flight of Orion and the new SLS rocket is still on schedule for 2018. \n\nThe spacecraft sailed through its first test flight in December. Nonetheless, managers said they want to be conservative in what lies ahead. \n        \nOrion lifts off from Cape Canaveral on Dec. 5, 2014, for its first test flight. \n Joe Raedle/    \nNASA Associate Administrator Robert Lightfoot said there were too many variables ahead to calculate the chance of meeting a 2021 launch. But he noted during a teleconference with reporters: “It’s not a very high confidence level, I’ll tell you that, just because of the things we’ve seen historically pop up.” \n\nSoftware development typically can cause delays, as can the reuse of test hardware. While there are no setbacks in these areas yet, Lightfoot said, “but we have to account for those because we’ve got a lot of runway in front of us here before we get there, and those things could pop up.” He called these “unknown unknowns.” \n\nNASA is committing to a $6.77 billion development cost between this October and Orion’s first crewed flight, no later than 2023. That first flight with astronauts will be to check out Orion’s crew systems close to Earth, especially the life-support equipment. The capsule is designed to hold four astronauts. \n\nOn the second crewed mission, NASA will push deeper into space, perhaps the far side of the moon, said William Gerstenmaier, associate administrator for human exploration and operations. \n\nThe ultimate prize is Mars — and, eventually, beyond. \n\nNASA is focusing on Orion and SLS, while letting commercial space companies handle routine supply runs to the International Space Station. The goal is to get private companies — specifically SpaceX and Boeing — to start delivering American astronauts as well in 2017. Until then, Russia is doing all the crew transport. \n\nOrion is NASA’s first new spacecraft for humans in more than a generation, succeeding the now-retired space shuttles.", "source": "Global News Canada"}