{"published": "2015-08-20T09:31:53Z", "media-type": "Blog", "title": "Foreign Investors Enabled to Own Shares in UAE’s National Telecommunication Company", "id": "8c062a0d-3a53-4464-ac85-9b12adf09e3c", "content": "FinanceInvestments Foreign Investors Enabled to Own Shares in UAE’s National Telecommunication Company\nAugust 20, 2015\nShare on Facebook Tweet on Twitter In an historic move, UAE Federal Law No. 01 of 1991 has been amended by Federal Decree by Law No. 03 of 2015, and new Articles of Association have been issued by the UAE Cabinet of Ministers. The amendments introduce momentous changes, including the possibility of foreign investors owning shares in Etisalat Group, while Etisalat’s legal name will change to Emirates Telecommunications Group Company PJSC, but will continue to be known as Etisalat Group.\nThese changes allow for legal persons, including institutions, in the United Arab Emirates, or UAE government agencies, or other legal persons, to own shares in Etisalat. Also, non-national individuals and entities may own up to 20 percent of Etisalat Group’s shares, subject to the approval of the Etisalat Group Board of Directors. However, restrictions in respect of voting rights shall be applied to the shares owned by non-nationals and such shares shall not hold any voting rights at Etisalat Group’s general assembly although holders of such shares may attend general assembly meetings.\nCommenting on the changes, Eissa Al Suwaidi, Chairman, Etisalat Group, said, “The approval to allow institutional and foreign ownership of Etisalat Group’s equity will have a positive impact for both Etisalat Group’s shareholders and the Stock Exchange. It also sends out a strong signal that the UAE is open for business and will enhance Etisalat brand recognition around the world.”\nIn addition to ordinary shares, a “Special Share” will be issued to the Federal Government of the UAE (the “Special Shareholder”), pursuant to the approval of Etisalat Group’s Board of Directors. Etisalat Group will also be entitled to issue different classes of shares. Other than the issuance of the Special Share, Etisalat Group does not intend to issue any additional shares at this time.\nAhmad Julfar, Group Chief Executive Officer, Etisalat, added that the move will enable Etisalat to continue to invest in the innovative products and services which customers demand and are vital in the highly competitive global telecommunications sector.\n“As a result, I am confident that Etisalat will go from strength to strength and continue delivering long-term value to our shareholders,” he said.\nSome of the other material changes include the ability for Etisalat Group to establish a new operating company for the purpose of operating its telecommunications network business and providing telecommunication services in the UAE, subject to Special Shareholder approval, and establishing a share buyback programme at any time in accordance with the conditions and procedures set out in the relevant law and subject to the prior approval of the Emirates Securities and Commodities Authority.\nIn accordance with the new law, Etisalat Group will carry out the procedures required to implement and align its status with the provisions of the new law within one year from the date of its issue.\nTAGSEtisalatEtisalat GroupInvestment OpportunityMarketsShares\nSHARE\nFacebook Twitter Editor RELATED ARTICLESMORE FROM AUTHOR\nRepositioning Private Capital: Money Movements Around The Globe\nEmirates Celebrates Listing of a $913 Million Sukuk on Nasdaq Dubai\nUAE GDP rose more than 236-fold in 2014\nEmirates set to close US$913 million Sukuk\nSmart Real Estate Investing: Where to Spend in 2015?\nGlobal Investors Now Bullish on Europe, Inflation and Gold\nReal Estate Still Top Investment for UAE Residents\n2015 Market Outlook: Bull Market Slows to a Jog\nDubai 3rd Investment Destination Worldwide; 2nd in Economic Potential among 62 ‘Major’ cities\nDubai Parks and Resorts Announces IPO Subscription Rates\nDubai Parks and Resorts Closes the UAE Tranche of its IPO\nHedge Funds in India, MENA gain despite currency, commodity volatility", "source": "Dubai Chronicle"}