{"published": "2015-09-06T00:00:00Z", "media-type": "News", "title": "Refugees arrive in Germany to cheers, 'welcome' signs", "id": "f68e5f7b-5efe-4456-99ff-918357866e94", "content": "6th September 2015, 0 comments \n \nHundreds of migrants streamed into Germany on Sunday to cheers and \"welcome\" signs, joining the thousands who arrived the previous day as Austria called for an emergency EU summit on the continent's worst refugee crisis since World War II. \n\nAustrian Chancellor Werner Faymann warned his country's admittance of thousands of refugees crossing from Hungary was just a \"temporary\" measure and urged the 28-member European Union to collectively deal with the record numbers. \n\nMasses of people fleeing war and misery from Syria, Iraq and beyond have rushed from Hungary through Austria into Germany, which expects to take in 800,000 refugees this year at a cost of 10 billion euros ($11 billion). \n\nIn moving scenes the newcomers, clutching their children and sparse belongings, stepped off trains in Munich, Frankfurt and elsewhere to cheers from well-wishers who held balloons, snapped photos and gave them water and food. \n\n\"The people here treat us so well, they treat us like real human beings, not like in Syria,\" said Mohammad, a 32-year-old from the devastated town of Qusayr, his eyes welling up with tears. \n\nWith the EU divided along east-west lines on how to handle the record numbers, Pope Francis called for every Catholic parish to take in a refugee family. \n\nOn Saturday alone about 8,000 migrants crossed German borders, federal police told AFP. \n\nIn Munich, some 1,200 came in early Sunday, a day after trains brought 6,800 to the southern German city. \n\nAs refugees got off trains, police directed them to waiting buses bound for temporary shelters, which have been set up in public buildings, hotels and army barracks across the country. \n\n\"Say it loud, say it clear, refugees are welcome here,\" crowds chanted at the Frankfurt railway station overnight. \n\nWhile Germany has seen a spate of ugly xenophobic rallies and attacks against foreigners, it has also seen an outpouring of support, donations and volunteer efforts by people who believe the country, given its dark history and current wealth, has a special obligation to help refugees. \n\n- Humanitarian emergency - \n\nNonetheless, politicians in Germany and elsewhere in Europe have voiced growing concern about the record numbers, and warned the influx would spell both logistical and political problems. \n\nIn Austria, Faymann said that Vienna's assistance was a temporary manifestation of Vienna's \"goodwill\" in the face of a humanitarian emergency. \n\n\"There is no alternative to a common European solution,\" said Faymann, calling for a summit of EU leaders \"immediately after\" an interior ministers' meeting on September 14, the APA news agency reported. \n\nGerman Chancellor Angela Merkel on Saturday spoke by phone with Hungary's Prime Minister Viktor Orban, who has called the refugee wave a \"German problem\" caused by Berlin's public statement saying it would welcome Syrians. \n\n\"Both sides agreed that both Hungary and Germany must meet their European obligations, including their obligations under the Dublin agreement,\" said Merkel's spokesman Georg Streiter. \n\nUnder the EU's so-called Dublin rules, asylum applications must be processed by the country where a person first arrives. \n\nOrban and Merkel had agreed that the weekend influx was exceptional, due to the emergency situation in Budapest, Streiter said. \n\nMerkel also faces political pressure at home, where her Bavarian sister party CSU criticised the eased travel rules as \"a wrong decision\", according to its party secretary Andreas Scheuer. \n\nMembers had warned that this had created \"an additional pull-factor\" - aside from push factors such as war, poverty and repression in their home countries. \n\nMerkel was set to hold a crisis meeting on the refugee issue later Sunday with her coalition partners. \n\n- Europe divided - \n\nEurope is deeply divided over how to handle the continent's biggest refugee crisis since the end of World War II, and Hungary's and other eastern European nations' hard line has contrasted with a show of solidarity elsewhere in Europe. \n\nFinnish Prime Minister Juha Sipila has evern offered to put up refugee families in his country home. \n\nUnder intensifying pressure at home and abroad, British Prime Minister David Cameron is set to admit 15,000 refugees from Syria, the Sunday Times reported. \n\nPope Francis called for \"every parish, every religious community, every monastery, every sanctuary in Europe take in a family.\" \n\nThe UN refugee agency UNHCR on Saturday said 366,402 migrants had crossed the Mediterranean to Europe this year, with 2,800 dying or going missing en route. \n\nEuropean Commission President Jean-Claude Juncker has proposed relocating 120,000 refugees from overstretched Italy, Greece and Hungary, a European source has told AFP. \n\nThe plan -- which comes on top of a Commission proposal in May for the relocation of 40,000 migrants -- is expected to be formally unveiled by Juncker on Wednesday after being approved by Commissioners, the source said. \n\nGermany's Welt am Sonntag newspaper reported that under Juncker's plan, Germany would take in about 31,000 people, followed by France with 24,000 and Spain with almost 15,000. \n\nburs-fz/yad \n \n\n© 2015 AFP", "source": "Expatica Germany"}