{"published": "2015-09-16T15:15:00Z", "media-type": "News", "title": "CORRECTION - Major League Football, Inc. Shares Begin Trading on OTC Markets''(R) ''QB''", "id": "25b15a13-d02f-41a3-9a91-11b61a659e74", "content": "ID: 1385913 \n   \n   \n(businesspress24) - LAKEWOOD RANCH, FL -- (Marketwired) -- 09/16/15 --  In the news release, \"Major League Football, Inc. Shares Begin Trading on OTC Markets''® ''QB''\" issued earlier today by Major League Football, Inc. (OTCQB: MLFB), we are advised by the company that \"Our recent closing of our follow-on $15.0 financing\" in the first sentence of the second paragraph has been removed from the originally issued release. Complete corrected text follows. \n\nLAKEWOOD RANCH, FL Sep 16, 2015 Major League Football, Inc. (OTCQB: MLFB) (\"MLFB\" or the \"Company\"), a new, professional spring-football league scheduled to kick off in 2016, today announced the Company''s shares have completed its application process and upgrade to OTC Markets'' ''QB'' designation. MLFB shares will begin trading on OTC Markets'' QB today, September 16, 2015. \n\n\"Our ever-improving liquidity required that we consider upgrading our listing to a higher tier on OTC Markets'' platform. We expect this will facilitate greater ease in acquiring our shares and development of an increased following of shareholders and brokers who prefer the QB''s listing standards,\" began Michael Queen, EVP of Major League Football, Inc. \"Among the Management Team and our Board, this decision was simple and a step in the process of future exchange upgrades on OTC Markets or other exchanges we plan to achieve in the near term. OTC Markets'' QB maintains a set of criteria ranging from stock price to increased disclosure practices which we have met and will continue to uphold for our current and prospective shareholders. We also understand our newly achieved QB designation will facilitate increased presentation of our shares as an investment option and its ease in acquiring our shares through retail platforms and brokerage accounts.\" \n\nThe OTCQB® Venture Marketplace is for entrepreneurial and development stage U.S. and international companies. To be eligible, companies must be current in their reporting and undergo an annual verification and management certification process. These standards provide a strong baseline of transparency, as well as the technology and regulation to improve the information and trading experience for investors. Companies must meet a minimum $0.01 bid price test and may not be in bankruptcy. OTCQB criteria include: \n   \nCompanies are current in their reporting to a U.S. regulator or are listed on a \n\nMinimum bid price test of $0.01 removes companies that are most likely to be the subject of dilutive stock fraud schemes and promotion \n\nImproved investor confidence through verified information, confirming that the Company Profile displayed on  is current and complete \n\nAnnual management certification process to verify officers, directors, controlling shareholders, and shares outstanding \n\nGreater information availability for investors through the OTC Disclosure & News Service \n\nTransparent prices for investors through full-depth of book with Real Time Level 2 quotes \n\nMajor League Football Inc. is a publicly traded, professional spring football league. MLFB is dedicated to creating an innovative, accessible, and fan-owned game, which is scheduled to kick off in 2016. MLFB''s strategically placed spring / summer season will fill a critical need for outdoor football at that time of the year when sports content is in high demand. The league''s teams will focus on emerging markets in select US cities in order to grow the overall popularity of the sport. \n\nFor additional information on MLFB''s nationally accessible ticket database and our sponsorship opportunities, go to  or call 855-MLF-BTIX (855-653-2849) to sign-up for your tickets now. \n\nFor more information about Major League Football, please visit . \n\nSafe Harbor \nThe information posted in this press release may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements involve risks and uncertainties, such as statements about our plans, objectives, expectations, assumptions or future events. In some cases, you can identify forward-looking statements by terminology such as \"anticipate,\" \"estimate,\" \"plan,\" \"project,\" \"continuing,\" \"ongoing,\" \"expect,\" \"we believe,\" \"we intend,\" \"may,\" \"should,\" \"will,\" \"could\" and similar expressions denoting uncertainty or an action that may, will or is expected to occur in the future. These statements involve estimates, assumptions, known and unknown risks, uncertainties and other factors that could cause actual results to differ materially from any future results, performances or achievements expressed or implied by the forward-looking statements. You should not place undue reliance on these forward-looking statements. Factors that that are known to us that could cause a different result than projected by the forward-looking statement, include, but are not limited to; lack of available funding; general economic and business conditions; competition from third parties; intellectual property rights of third parties; regulatory constraints; failure to market and sell team franchises; failure to establish viable marketing campaigns such as televised programming, radio broadcasting, internet websites, and other mediums; those events and factors described by us in Item 1.A \"Risk Factors\" contained within our latest Annual Report on Form 10-K filed with the SEC; other risks to which our Company is subject; and other factors beyond the Company''s control. Any forward-looking statement made by us in this release is based only on information currently available to us and speaks only as of the date on which it is made. We undertake no obligation to publicly update any forward-looking statement, whether written or oral, that may be made from time to time, whether as a result of new information, future developments or otherwise. \n\nContacts: \nMichael Queen \nEVP of Finance \nMajor League Football \n2601 Annand Drive Wilmington, DE 19808 \n774.213.1995 ext.1007 \n\nJohn Mattio \nVP of Communications and Investor Relations \nMajor League Football \n2601 Annand Drive Wilmington, DE 19808 \n774.213.1995 ext.1013 \n\nKeywords (optional): \n\n\nUnternehmensinformation / Kurzprofil: \n\nLeseranfragen: \nPresseKontakt / Agentur: \n\nbereitgestellt von: Marketwired \n \nDatum: 16.09.2015 - 15:15 \nSprache: Deutsch \nNews-ID 1385913 \nAnzahl Zeichen:  \ncontact information: \nCompany: Major League Football, Inc. \nContact person:  \nTown: LAKEWOOD RANCH, FL \nPhone: \n\nAnmerkungen: \n\nDiese Pressemitteilung wurde bisher 0 mal aufgerufen. \n\n \nVerlinkung-Tipps: \n\nDirekter Link zu dieser Pressemeldung: \n\n\nÜber einen Link auf Ihrer News-, Presse- oder Partner-Seite würden wir uns sehr freuen.", "source": "BusinessPress24"}