{"published": "2015-09-06T07:10:37Z", "media-type": "Blog", "title": "Mizrahi poet is a thorn in Israeli Left's side", "id": "f8b5ee93-61f2-4340-a238-43d864070691", "content": "A poem by Roy Hasan (pictured), a Mizrahi leftist criticising the Ashkenazi Left for being hypersensitive to Palestinian historical grievances against the Israeli state, but dismissive of the religious, cultural, and historical grievances of Mizrahi Jews, is getting hundreds of 'shares' online. Hasan inveighs against 'Arsophobia', the Ashkenazi prejudice against the Israeli equivalent of  'Chav' - people of  low education and social class. Article by Madison Margolin in the Forward:\nRoy Hasan has been described as the Israeli Eminem. The subversive, indignant, radical 32-year-old Mizrahi poet from a housing project outside Haifa received the prestigious Bernstein Prize and an award of 50,000 NIS from the Israeli Publishers Association this past July.\nHis provocative poem “ If There’ll Be Peace, All the Arsim Will Come ” sheds light on the complex dynamic in Israel between the white Jewish left and Mizrahim, Jews of Middle Eastern descent. The poem calls out Ashkenazim — Jews of European origins — for “hypocrisy, hegemony, and all around ass-hole-itude,” as it has been described by the radio station TLV1.\n“In order to fully understand [the poem] you need to have grown up here or live the reality of Israeli society,” Hasan told me in an email exchange.\nThe poem focuses on local, everyday Israel through Hasan’s point of view. He criticizes privileged “socialists” who participate in capitalism, and leftist atheists who scorn religious Judaism, but ostensibly respect Islam.\n“I just love those / sensitive Jews who demonstrate against the Occupation / and go home to their / Arab house in Yaffo / which they call Yaffa / with a melancholy glance of / shared fate over hummus / at Abu something-or-other / licking their lips with every / wipe of the pita and / murmuring about ending the Occupation, / dreaming of two states for two nations / because— walla —/ (they fumble for the Arabic) / Occupation Occupation / (or nakba nakba ): / next to them but not with them / they’re Arabs after all. / An Arab friend said about them once / that they’ll never make peace / because if there’ll be peace / all the arsim will come.” \nMizrahim, or “Arab Jews” as many call themselves, already comprise more than half the Israeli population. “Peace will mean that all the Arabs will come, and then the country will be full of arsim,” Hasan said, explaining the last stanza.\nTo understand the poem is to comprehend the meaning of “ars” (plural: “arsim”) and its fraught significance in Israeli society and politics. “Ars” is a widely known derogatory and racist term in Hebrew slang often used to describe young Mizrahim of low socioeconomic status. Derived from Arabic, “ars” originally meant “pimp,” “shepherd,” or “bad guy.” In English, it’s comparable to “thug.” The female counterpart is “frecha” (plural: “frechot”), a term borrowed from a Moroccan first name popular in the 1950s and ’60s.\n“I would say there’s ‘arsophobia,’” said Henriette Dahan Kalev, a professor of politics and gender at Ben Gurion University. “Ars” is a politically loaded word, but now many Mizrahim are reclaiming it, she explained. “It’s like reclaiming the word ‘queer’ in English.”\nDahan said that creative protest like Hasan’s has always been on the margins of the main discourse in Israel, overshadowed by the Israeli-Palestinian conflict or inter-party politics in the Knesset.\n“As someone who holds radical leftist views I am constantly facing an internal struggle,” said Hasan, “and I know that until a different kind of left is created here, one that understands the complexities and the ethnic Israeli-Arab diversity and can allow people from the bottom rungs of society to reach the top, I will never have a real political home.”\nAs Hasan’s translator Ron Makleff points out, his poem addresses the fact that the Ashkenazi left has continually failed to win a majority in the Knesset and bring about change.\nBut the poem also calls into question the place of Mizrahi identity in terms of the conflict itself, explained Makleff, a historian at UC Berkeley. With many Mizrahim willing to call themselves “Arab Jews,” he said, “the binary of national identities in the Israeli-Palestinian conflict becomes more complex.”\nEspecially for a non-Hebrew speaking audience, the poem bluntly broaches complexities that are crucial to understanding Israel today, said Makleff. While our grandparents’ generation brought the idea that “we are all just Israeli,” a few generations in, that idea is falling apart, he said.\n“I think the poem’s importance is in its criticism of how the secular Ashkenazi left is simultaneously hypersensitive to Palestinian historical grievances against the Israeli state, but dismissive of the religious, cultural, and historical grievances of Mizrahi Jews against the Israeli state,” said Makleff. “The poem juxtaposes those two aspects of old-school Ashkenazi leftism in a way which, to me, reveals just how deeply implicated that Ashkenazi left is in creating an unequal, occupying, intolerant Israel.”\nRead article in full", "source": "Point of No Return: Jewish Refugees from Arab Countries"}