{"published": "2015-09-30T07:44:22Z", "media-type": "News", "title": "Indian Creek Fire is nearly out", "id": "13e2acdc-e2c1-406e-b60d-e6ab1107d0a4", "content": "Photo by Kirby  Neumann-Rea .\r\n          \r\n        \r \nODF firefighters climb down the ravine at about 9 p.m. Sunday to spray flames just below the trail. Other firefighters geared up to go farther down the slope with shovels, saws and other tools. \r \n  \nThis one could have been far worse. \n \nIndian Creek Trail fire is all but out. Fire crews are continuing to fight tough terrain on the Indian Creek fire, but the blaze that erupted Sunday night is 95 percent contained as of Tuesday morning. \n  \n   \n  \nTwo hand crews remain in the Indian Creek ravine, dousing hot spots and checking for fire-damaged snags that need removal. No structures or power poles were damaged by the fire, which remains under investigation. The cause and location of its source have not been determined. \n \nIndian Creek trail remains closed between 12th Street and Hazel Street. Power shutoff was avoided when Pacific Power was able to reroute the current to downtown and the Heights. \n \n“A fire in the Indian Creek canyon is my worst nightmare,” said Hood River Fire Chief Devon Wells. Conditions were favorable for firefighters, with high humidity and little to no wind on Sunday night. \n  \n   \n  \n“We’re lucky,” HRFD firefighter Adam Wheat said standing on the trail Sunday night. “If this had happened in those hot days in July, with low humidity and the winds, we’d be backing up out of here in full defensive mode.” \n \nWells credited the Oregon Department of Forestry and National Scenic Area wildland crews as well as the support of all agencies in the county. Husum, Bingen and White Salmon departments also sent equipment and volunteers. \n \n“They did a great job in knocking down the fire and protecting structures,” Wells said. \n  \n   \n  \n‘The community has also been supportive,” Wells said on scene Tuesday just as walkers approached and asked how long the trail would be closed. \n \n“One more day,” he told them. Of peak concern are damaged trees around the trail that might need to be removed to avoid them falling on trail users. \n \nThe fire reached 3.6 acres in size and burned trees and brush below the Indian Creek Trail. Structure firefighters were in place Sunday and all day Monday as a precaution and wildland fire agencies provided suppression. \n  \n   \n  \nWater on the fire came from three sources: hydrants on Third, Fifth and Seventh streets, agency tankers, and helicopter. The chopper flew dousing routes for several hours on Monday. The power lines that run through the fire scene were shut off to eliminate the hazard to the helicopter and ground crews, who were contending with smoke and fire directly beneath the lines. \n \nGravity also helped, as the hydrants were all located above the fire, enhancing the flow of water in the main hose line and the laterals rigged up from the trail. ODF crews and local department volunteers ran hundreds of feet of hose down the trail, starting at the Fifth Street and Seventh Street dead-ends, as well as from Third and Pine. \n \nA pall of white smoke hung over downtown Hood River on Monday, the result of a new push by the fire after morning sun warmed up the fuels and down-canyon winds fed flames and hot spots on the north side of the creek. Additional personnel and engines were being staged at Third and Pine and other locations, as the fire briefly intensified. It was under control by afternoon, with the help of the helicopter-borne water. \n \nThe fire broke out at about 7:15 p.m. Sunday, according to a report by the Hood River County Sheriff’s Office. Hood River Fire Department responded to the fire at the eastern edge of the Indian Creek Trail, which runs in a Northeast to Southwest direction through part of the city limits. \n \nWells said once the fire is out, investigators will be able to survey the spread of the fire to determine how and where it started. “It will be tough to find considering it covers 3.6 acres and much of it rough and steep.” He will also interview the original 9-1-1 caller to get a better sense of how far down the canyon the fire might have started.", "source": "Hood River News"}