{"published": "2015-09-14T09:57:14Z", "media-type": "News", "title": "BURSA MALAYSIA: Bursa Ends On High Note", "id": "0b035d02-8918-4c61-af19-323c85f4f274", "content": "KUALA LUMPUR, Sept 14 (Bernama) -- Bursa Malaysia finished higher Monday spurred by the measures announced by Prime Minister Datuk Seri Najib Tun Razak to boost the economy and restore investor confidence, a dealer said. \nAt 5 pm, the benchmark FTSE Bursa Malaysia KLCI (FBM KLCI) was 36.03 points better at 1,639.63, after moving between 1,600.70 and 1,645.49 throughout the day. \n\nThe measures included asking both international and local Malaysian companies to repatriate profits and reinvest in Malaysia and to reactivate ValueCap Sdn Bhd with a RM20 billion injection to boost underperforming shares. \n\nHowever, the dealer said overall sentiment was still cautious ahead of the  uncertainty over the outcome of the Federal Open Market Committee meeting (FOMC) beggining Wednesday. \n\nMarket breadth was positive with gainers outpacing decliners 469 to 342, while 304 counters were unchanged, 701 untraded and 20 others were suspended. \n\nVolume, however, eased to RM2.20 billion units, valued at RM2.34 billion, from 2.23 billion units, valued at RM1.86 billion, recorded on Friday. \n\nThe FBM 70 was 196.24 points firmer at 12,086.80, the FBM Ace fell 51.47 points to 5,427.16, the FBM Emas Index perked 219.72 points to 11,248.84, the FBMT100 Index advanced 226.91 points to 10,979.68 while the FBM Emas Shariah Index soared 277.68 points to 11,829.02. \n\nThe Finance Index climbed 233.43 points to 14,239.33 and the Plantation Index chalked up 172.00 points to 7,062.07 and the Industrial Index added 59.91 points to 3,144.77. \n\nAmong heavyweights, Maybank increased 10 sen to RM8.51, Public Bank appreciated 24 sen to RM18, TNB expanded 74 sen to RM11.96 and Axiata rose 16 sen to RM6.06. \n\nAmong actively-traded stocks, Felda Global Ventures improved 37 sen to RM1.64, UEM Sunrise gained one sen to RM1.07 while KNM inched down half-a-sen to 50 sen. \n\nMain Market volume fell 1.22 billion units, worth RM2.03 billlion, against Friday's 1.57 billion units worth RM1.73 billion. \n\nTurnover on the ACE Market trimmed to 260.68 million units, valued at RM59.06 million, from 289.95 million units, valued at RM57.26 million, recorded on Friday. \n\nWarrants perked to 720.07 million units, worth RM141.37 million, from Friday's 366.55 million units worth RM76.18 million. \n\nConsumer products accounted for 84.11 million shares traded on the Main Market, industrial products (210.61 million), construction (44.75 million), trade and services (498.84 million), technology (24.93 million), infrastructure (15.49 million), SPAC (43.30 million), finance (61.69 million), hotel (567,100), properties (155.10 million), plantations (71.47 million), mining (15,900), REITs (6.93 million) and closed/fund (15,000). \n\n-- BERNAMA", "source": "Bernama"}