{"published": "2015-09-26T18:06:01Z", "media-type": "Blog", "title": "10 technologies that have already destroyed civilization", "id": "a4180362-96ec-4693-82cf-568a5fdeec77", "content": "Yes, virtual reality technology will turn us all into drooling idiots and destroy civilization — but it won’t be the first. Here are ten other technologies that have already destroyed civilization. 10. The Internet (Image courtesy Ministerio TIC Colombia via Flickr.) The Internet is more addictive than cocaine. Back in 1995, fewer than 15 percent of Americans used the Internet, and those who did, spent less than 30 minutes a month online. Today, 87 percent of us are online, and spend an average of 11 hours a day staring at a screen. Eleven hours! That can’t be right! I don’t know about you, but I’m never away from the Internet. If I’m not sitting at my computer — and also when I am — my smartphone is always within reach. Any dumb question that comes into my head — a quick “Hey, Siri” or “OK, Google” and I’ve got the answer. If someone pings me or pokes me or Skypes me or texts me or emails me, my phone will let me know. It’s the last thing I look at at night, and the first thing I check in the morning. It’s my radio station and my alarm clock. Eleven hours. More like 24 hours! Now, you might have heard about that McKinsey report that shows that the Internet adds more than 3 percent to GDP, that 75 percent of the benefits go to non-tech companies, and that 2.6 jobs are created for every job lost to technological progress. They call the Internet a “vast mosaic of economic activity.” Hah! Those of us who have ever been on the Internet know the truth: it is a vast wasteland of cat videos, porn, and Kardashian gossip. It rots minds, corrupts youth, promotes alternative lifestyles and gay marriage, and destroys our health. I myself have gained several pounds over the past twenty years, and the Internet is totally at fault. Also, the Kardashians. Without the Internet, would any of us have heard about that sex tape? The Internet has clearly destroyed civilization — and continues to destroy it. 9. Television (Image courtesy Paul Townsend via Flickr.) The original “vast wasteland,” television has been turning us into drooling idiots for more than fifty years. With shows like “Gilligan’s Island,” “Three’s Company” and “Keeping up with the Kardashians,” television has rotted our brains, destroyed our ability to communicate with other humans in any meaningful fashion, and eroded both our imaginations and our muscle tone. Television has destroyed the movie industry. Other than the record-breaking audiences who have been going out to the theaters in recent years, who really goes to the movies these days? After all, you can watch it on television for free? Television has destroyed radio. Why listen to something when you can see it, too? And books and newspapers — reading is just too hard when you can get your information pre-chewed and hand-fed to you. It destroyed friendships. After all, who are better friends — your actual friends, or “Friends”? It destroys families. Watching family life on television is much more compelling than having your own. Even sex pales in comparison. Is it any wonder that birth rates drop in every country that gets televisions? It’s a miracle that any humans are left on the planet at all. 8. Telephones (Image courtesy Seattle Municipal Archives via Flickr.) There used to be a time when talking to another human being meant that you would go out and meet them, face to face. Then every teenager got his or her own line, and hide in their rooms all night, talking to their friends. Both at work and at home, if we need to reach someone, we pick up the phone, instead of going outside and actually finding them. Telephone addiction is a real thing. And it requires a growing army of telephone operators. Pretty soon, we’ll all be working on telephone switchboards. Telephones contribute to inactivity and social isolation. They bring us fake psychics and phone sex lines and telemarketers. And speaking of telemarketers — think of how much easier it is to hang up on a sales call and it is to get rid of a door-to-door salesmen. Telephones have not only destroyed our society, but our economy, as well. 7. Electricity (Image courtesy Micolo J via Flickr.) Electricity kills. Literally, it can kill you. It is a gateway technology for radios, telephones, televisions and the Internet. It makes us lazy and stupid. By making refrigeration easy and convenient it has helped allow the movement of food across vast distances. Instead of eating locally grown, in-seasons food we can now eat a variety of fruits and vegetables from all sorts of exotic locations, and stretches of bad weather no longer cause widespread famines. And without a good famine once in a while, the human race has become weak. And when’s the last time you heard about someone dying from scurvy, polio, mumps, smallpox or the Black Plague? It used to be that a scratch could get infected and kill you. Before modern medicine, people had to be tough to survive. But as a result of electricity, we can keep our vaccines refrigerated, can keep hospitals lit at all hours of day and night, can light up the sirens on the roofs of ambulances. Our doctors get to use all kind of fancy medical equipment that is powered by electricity, or manufactured with the help of electricity. Electricity lights our homes and our cities, allowing us to work longer hours and stay up later. And, worst of all, it has led to the explosion of white-collar jobs. These are not real jobs for real men and real women. Jobs where you make something or grow something. With white collar jobs, you’re creating and managing information instead of things. It used to be that you could put a kid to work as soon as they could walk. Now, they’ve got to go to college — or, at least, finish high school. Real humans make things. We don’t push paper around. Every year we’re moving further and further away from the core of what it is to be a human being. And electricity is helping power that devolution. 6. Cars (Image courtesy Pedro Ribeiro Simões via Flickr.) Also moving us away? Cars. It used to be that going somewhere required that you walked, or hitched up your wagon to your horse. You were connected to your own body, to weather, to nature. Now, you get in your car and just drive there. When was the last time you were trapped by a storm and had to eat your companions to survive? And cars destroy social ties. Back when it took days, weeks, or months to visit your relatives, you didn’t just drop in for a few minutes. You came and you stayed. You really got to connect with people on a very deep level. 5. Steam power (Image courtesy Barry Lewis via Flickr.) Speaking of each travel, trains also destroyed civilization. And the industrial revolution permanently changed who we were. Before, almost all of us worked as farmers, growing the food we needed to survive. If we needed something, we made it ourselves, or turned to one of the few craftsmen around to make it for us. Physical objects were rare, and valuable. Clothing, furniture, decorations and accessories were all painstakingly hand made. They were treasures, passed down from generation to generation. The industrial revolution, by allowing for the mass production of everything from farm implements to clothing may have improved our standard of living — but at the cost of our civilization. We left the farms and started working grubby, dangerous, unnatural factory jobs. Subsistence farms turned into professionally-run agribusinesses. We weren’t dying of hunger as often as before, but the cost was too high. We lost our humanity. 4. Books (Image courtesy Becca Swift via Flickr.) Humans invented the first kind of virtual reality — literature — thousands of years ago. And it has been rotting our brains ever since. Instead of listening to each other, and passing stories along in an oral tradition the way we’re supposed to, we started writing them down. We no longer had to have personal relationships with experts and mentors. We could just read their books. We no longer had to travel and meet with people face-to-face. We could just send them letters. We no longer had to memorize the information we needed to survive. We could just look it up. In fact, we no longer even had to remember the things that happened to us and the people we met. We could write things down in diaries, instead. The invention of writing was the worst thing that could have happened to our brains, to our social connections, to our civilization. But there’s more. Books allowed us to travel to new and imaginary worlds that were infinitely better than our own. Worlds with heroes and knights and romance, where good always triumphed and everyone lived happily ever after. Given the choice, who wouldn’t want to live inside books? People turned into bookworms, and cut themselves off from society. Others went insane due to their inability to tell reality from fiction, as in the tragic case of Don Quihote, who started to believe that knights and dragons were real and went off to joust with windmills. Even to this day, you can find books everywhere. Global literacy is at an all-time high and fantasy authors can become billionaires by creating imaginary worlds. And almost every supermarket checkout offers spy and romance novels, newspapers, and magazines featuring the Kardashians. 3. Cave paintings (Image courtesy Wikimedia Commons.) It used to be that if I found a particularly good hunting ground, or did something particularly heroic, I would tell my fellow tribesmen all about it around our campfire. But then they had to go and invent cave paintings, and now our teenagers, instead of paying attention to their elders, just sit around in the cave all day staring at the paintings. And it would be bad enough if the painters stopped at geography lessons and hunting stories, pleas to Gods, and territorial markings. But no, they also paint sexy women. Who wants to bother with real females when they can see the curviest curves on their walls? Cave paintings destroyed our civilization. And we still have drawings on our walls to this day, a sign that you just can’t keep a good civilization-destroying technology down. Also — posters of the Kardashians. They pop up everywhere. 2. Fire (Image courtesy Matthew Peoples via Flickr.) Back in the old days, we chewed our food, like real people. Enough said. 1. Language (Image courtesy Wikimedia Commons.) According to some scientists, we evolved larger brains in order to have nuanced language. Language that did more than allow us to give directions or warn our fellows about threats. Most animals can do that much. No, we needed complex language in order to describe complex social connections and emotional ties, to enforce social mores, to help group cohesion, and to improve our chances of survival. Gossip. They’re talking about gossip. Any one of us who has ever used language to communicate immediately knows that this just isn’t true. Gossip destroys civilization. Real men grunt and point. Politicians and busy bodies chatter away. Before language, we could only communicate about things that actually were there. Physical things. Things we could point to or imitate. Language allowed us to get more creative. To talk not just about our emotions, like whiny babies, but to talk about what-ifs and possibilities and alternatives and all kinds of imaginary stuff that previously we just kept to ourselves instead of sharing it and embarrassing everybody. Language was our first virtual reality. It destroyed our idyllic pre-Neanderthal civilization and led us down that slippery slope straight to the Kardashians.", "source": "Hypergrid Business"}