{"published": "2015-09-24T00:55:08Z", "media-type": "Blog", "title": "Blog Post 4", "id": "6c46bbe6-474e-4195-9e3d-a94e133c5bca", "content": "This week in class we continued our discussion of the Koran, specifically in regard to its editing/compilation and subject. I found the five different “stages” of the Koran’s history to be very interesting, especially Stage 2 (Abu Bakr). Before taking this class, I would have never thought that the writing down of the Koran was at one time up to debate; I would have thought that people would want their religious texts preserved in writing, without question. However, after discussing why Abu Bakr questioned whether or not the Koran should be written down – how could he do something even Prophet Muhammad hadn’t even done? – I feel as though I have a much better understanding of Islam and its prophet’s role within the religion. It has become very clear to me that Muhammad was/is greatly revered by followers of Islam; while this was something was was aware of before taking this class, I never realized to what extent. As a non-religious person, I find this type of devotion to be unfamiliar yet fascinating.\n\nI agree with @freebird27's opinion on the movie A Separation. I think the film provided a great look at the culture of Iran and its people. I was especially interested in the movie’s take on women’s roles in the family and the differences between social classes. A Separation certainly seemed to assert the idea that women in the upper class, such as Simin and even Termeh, are given more respect than those in the lower class, such as Razieh. For example, Simin’s husband remains relatively calm towards her throughout the movie (most of it, anyway) despite their impending divorce. In contrast, Razieh’s husband is quick to anger and accuse her of wrongdoing. Simin, as part of the upper class, also has more autonomy; I highly doubt Razieh’s husband would have let her leave the house as Simin did (and not only because he has major anger issues). Overall, the contrasts made between the classes in A Separation provided interesting social commentary and added to the depth of the film and its meaning(s).", "source": "Islam students at LUC"}