{"published": "2015-09-18T12:06:14Z", "media-type": "News", "title": "Harry Kane pleased to see Tottenham team-mate Son Heung-min shine on home debut", "id": "da86215a-fa5d-4a83-ad11-353cb601ace3", "content": "Tottenham striker Harry Kane has praised Son Heung-min for his two-goal home debut, and insisted he was unconcerned by his own goalless run.\n\nThe England international was rested for Thursday night's visit of Qarabag with summer signing Son scoring twice as Spurs came from behind to win their Europa League opener 3-1.\n\nAn early penalty had seen Mauricio Pochettino's side fall behind, but Son notched twice in three minutes to turn the tide before Erik Lamela added a late third.\n\nKane came off the bench for a late cameo, having been left out of the starting line-up for the first time in almost seven months, and was pleased to see Son get off the mark.\n\n\"Obviously there's been a lot of talk but the manager's happy with his squad,\" Kane said when asked if was good to see someone else take on the goalscoring burden.\n\n\"Sonny did a great job up there and we're delighted for him to get the two goals. We've got a great squad, a lot of players in a lot of positions so we've no worries.\n\n\"I'm delighted for him - he played very well. He ran in behind, he got two good finishes and he created a lot as well. We're all delighted for him, with it being his home debut, so hopefully there's more to come.\"\n\nKane scored twice for England during the international break, but is without a goal for Tottenham so far this season having notched 21 in the Barclays Premier League last year.\n\nHe is likely to return to the starting line-up for Sunday's visit of Crystal Palace and remains untroubled by his lack of club goals.\n\nWhen asked if was becoming a worry, he replied \"No, not at all.\n\n\"Obviously I came on against Qarabag for 30 minutes. It was a good run-out, good for the fitness. I've just got to keep doing what I'm doing. I'm playing well so I'll keep getting in the right positions and the chances will come and I'll take them.\"\n\nSon may have grabbed the all-important goals on Thursday night, but Dele Alli also impressed on his European debut.\n\nThe 19-year-old signed for Spurs from MK Dons in January but remained at stadium:mk for the remainder of last season.\n\nHe has since settled quickly at White Hart Lane and provided the assist for Son's second against Qarabag as he enjoyed a budding understanding with the South Korean.\n\n\"He is a really good guy and really easy to get along with,\" Alli said of Son.\n\n\"I think we think a lot the same and you can see it on the training pitch and it's really good to have that natural chemistry with someone.\n\n\"There are a lot of players here that are all intelligent and want to play the same way, so that naturally links in together.\"\n\nAlli has been playing further forward since coming into Pochettino's side but the England Under-21 international is happy to play anywhere having made the step up from League One.\n\n\"It is different but when you are playing with players like this and with the team we have got here I am happy to play wherever, even if it's in goal. I am just happy to be on the pitch,\" he added.\n\n\"I'm confident in my ability and I can't thank the fans and the staff and all the players here enough for how they have helped me settle in and the way we have started the season. I can't thank them enough for how they have helped me settle in and the way I am performing.\"\n\nCopyright PA Sport 2015, All Rights Reserved", "source": "Bognor Regis Observer"}