{"published": "2015-09-28T22:21:32Z", "media-type": "Blog", "title": "NEW YORK -- Well, you know what they say: The 10,000th win is the hardest. The New York Yankees will have three more cracks to make history at Boston's expense, but it didn't come Monday night at Yankee Stadium, where the Yankees fell 5-1 to a brace", "id": "e2f2d1fb-46e5-468e-805d-387f5b385753", "content": "Gordon Edes, ESPN Staff Writer CloseHas covered Red Sox for 15 years Award-winning beat reporterJoined ESPNBoston.com in 2009\nFollow on Twitter0 Shares\nEmailPrint\nComment\nNEW YORK -- Well, you know what they say: The 10,000th win is the hardest. The New York Yankees will have three more cracks to make history at Boston's expense, but it didn't come Monday night at Yankee Stadium, where the Yankees fell 5-1 to a brace of Red Sox hatchlings.\nThe Yanks had a chance to become the first American League franchise to win 10,000 games. They also had an outside chance to clinch a wild-card spot, though three pursuers would have had to lose.\nNeither happened, as those wacky Red Sox kids wreaked havoc all game long on a Bronx playground they claimed as their own Monday night -- and some folks thought the Yanks were catching a break when interim manager Torey Lovullo gave slugger David Ortiz the night off.\nRookie left-hander Eduardo Rodriguez, in his final start of 2015, held the Yanks to seven hits (six of them singles) and a run in six innings. He became the first Sox rookie left-hander since John Curtis in 1972 to win 10 games.\nRookie first baseman Travis Shaw, batting in Ortiz's cleanup spot, hit a two-out, first-pitch, two-run home run off Ivan Nova in the sixth to give the Sox their first lead, 2-1.\nStill-cutting-his-teeth Jackie Bradley Jr., playing left field with Rusney Castillo out because of a tight quad muscle, made two terrific catches and hit a two-run home run that just cleared the short fence in left to make it 4-1 in the seventh. The home run was Bradley's 10th of the season.\nRookie Noe Ramirez, embracing interim manager Torey Lovullo's vision of him as a right-handed specialist, came on to coax a double-play ball out of Alex Rodriguez to end the seventh.\nRookie Deven Marrero, playing third base because Pablo Sandoval has been declared a casualty of pneumonia, hit his first big-league home run in the ninth to stretch the Sox's lead to 5-1, with a fan undermining the hard-earned Bronx tradition of nothing but contempt for the opposition by actually tossing the ball back onto the field.\nThe Yanks have had their way with the Sox for much of this season -- they've won 10 of 16 meetings -- but not Monday night. With the Blue Jays rallying to beat Baltimore, Toronto's magic number for clinching the AL East is down to two games.\nA Red Sox victory and Yankee loss Tuesday, and the Sox could be the catalyst for a celebration north of the border.", "source": "ESPN Feed: - blog"}