{"published": "2015-09-25T23:14:34Z", "media-type": "News", "title": "Irwin Jacobs buys back company from Liquidity Services", "id": "50e37081-a7e3-4657-8e6c-ca5a9e182d4b", "content": "The $13 million deal is expected to close… \r \nFeed Loader GLEN STUBBE ï gstubbe@startribune.com -- Tuesday , June 16, 2009 -- Minneapolis, Minn. -- ] Irwin Jacobs, chairman of VEC Technology. He intends to open a factory that will produce fiberglass blades for wind farms. Jacobs said the blades that he will manufacture will be made with a closed mold process so the blades will be stronger and more durable than current blades on the market. \n\nTalk about a classic case of sell high and buy low. \n\nWell-known Twin Cities business man Irwin Jacobs has agreed to buy back Jacobs Trading from Liquidity Services Inc. for at least $13 million, just four years after Liquidity paid Jacobs over $140 million for the business. \n\nLiquidity Services, a Washington, D.C.-based surplus goods dealer, announced the sale Friday, and it’s expected to close Wednesday. \n\nJacobs Trading, which sells closeout merchandise, is the original business that Irwin Jacobs and his father started decades ago. He sold it to publicly traded Liquidity Services for $140 million in cash, though Jacobs said the proceeds eventually totaled about $200 million. \n\nThat amount includes payments Jacobs received after Jacobs Trading met some post-deal financial goals, as well as profits from Liquidity Services stock that Jacobs obtained in the transaction. \n\nLiquidity Services could stand to get $4 million in proceeds beyond the $13 million price tag if the Jacobs-owned Jacobs Trading meets certain financial goals in the next few years. \n\n“We will grow the company again, I’m certain of that,” Jacobs told the Star Tribune. “I believe we can turn it around quickly. \n\n” \n\nJacobs Trading historically had a vital relationship with Wal-Mart, reselling goods that had been returned, were damaged or were obsolete. Liquidity Services, which already had a relationship with Wal-Mart, bought …", "source": "MyInforms"}