{"published": "2015-09-23T05:38:56Z", "media-type": "News", "title": "Australian band Thirsty Merc stage manager killed in car crash, drummer Mick Skelton in hospital", "id": "222ce379-f5ce-4eb3-a2b7-9997043427e3", "content": "Australian band Thirsty Merc is mourning the death of their stage manager Shane Cooper who was killed in a car crash in western Victoria on Tuesday afternoon.\n\nDrummer Mick Skelton was also injured in the crash near Streatham about 2.30pm.\n\nSkelton was flown to The Alfred hospital, where he reportedly remains in intensive care.\n\nMr Cooper was driving the band's van en route to a gig in Warrnambool when it collided with a ute. Skelton was the only passenger in the van.\n\nTheir grieving bandmates, lead singer Rai Thistlethwayte, bass player Phil Stack and guitarist Matt Smith posted a statement on Wednesday afternoon to the band's Facebook page saying they were shattered.\n\n\"With the heaviest of hearts, we share this utterly tragic news. While in transit to our show yesterday, our Stage Manager, Shane, and Touring Drummer, Mick, were involved in an horrific car accident which killed Shane and seriously injured Mick.\n\n\"The band is absolutely shattered. We have returned to Melbourne to stay near Mick who is in ICU and are rescheduling the rest of this week's shows.\n\n\"No further decisions have been made and we will let everyone know about future shows as soon as we can. Our deepest thoughts and prayers are with Shane and Mick's Families [sic] in this time.\"\n\nThe male driver of the ute was taken to Ballarat Hospital with non-life threatening injuries. \n\nThistlethwayte, Stack and Smith are believed to have been travelling in another vehicle at the time of the crash.\n\nThe band cancelled their show at The Loft in Warrnambool on Tuesday night. \n\nTheir Wednesday night gig at Geelong's Barwon Club Hotel has also been cancelled.\n\nThirsty Merc are touring Australia for their new album, Shifting Gears, which was released this month following a crowd-funding campaign to pay for the recording.\n\nThe future of their national The Good Life Tour remains uncertain.\n\nThe band's Facebook page has been flooded with condolences for the crew member, as well as well wishes for Skelton.\n\n\"Found out this morning about the horrible news.. So many fans devastated at your loss. Wishing Mick a speedy recovery and the thoughts of many are with the entire Merc family. and respective family and friends. RIP,\" one fan wrote.\n\n\"Condolences to the band, and here is hoping that Drumming legend Mr Mick Skelton is back behind the skins in no time!,\" another said.\n\nA third fan said: \"Sending love & support to you all. Wishing Mick a speedy recovery . I'm so sorry for your loss. Stay strong . Condolences to all family and friends at this sad time.\"\n\nThirsty Merc's hit single, In the Summertime, has been the theme song for the Network Ten show Bondi Rescue.\n\nMore to come.\n\nFucking horrible news about @ThirstyMerc Our sincerest condolences, and best wishes for recovery.\n\nAll my thoughts right now are with my good mate Mick Skelton and @ThirstyMerc. Tragic news. Be strong brother pic.twitter.com/Qv09RLnoh8\n\nThoughts and prayers are with they @ThirstyMerc boys. Such devastating news\n\nThinking of my mate Mick /Skelton, who's been in a terrible accident. http://t.co/0EztDHxwrj", "source": "Sydney Morning Herald"}