{"published": "2015-09-07T17:46:13Z", "media-type": "News", "title": "Rowers target at least one Rio gold", "id": "c981cde2-d7e4-49ff-ae29-8ffad52479ac", "content": "Led by world champion Kim Crow, Australia is on target to claim at least one rowing Olympic gold medal at next year's Rio Games.\n\nThe Australian rowers found gold elusive in London in 2012, settling for three silver and two bronze.\n\nBut Crow will start raging favourite in Rio after crushing her rivals in the single scull at the world rowing championships in Aiguebelette, France.\n\nThe 30-year-old Victorian finished almost three seconds clear of reigning Olympic champion Czech Mirka Knapkova.\n\nRowing Australia's high performance director Chris O'Brien said the world title capped a stunning year for Crow and she was right on target to improve on her bronze single scull medal in London, when she also competed in the double scull, winning silver.\n\n\"She's had a pretty stellar year and is undefeated so that sets her up for a good campaign next year leading into Rio,\" O'Brien said.\n\nLast year's world champion New Zealand's Emma Twigg didn't compete in France after taking a year off to study.\n\nO'Brien said Crow had improved so much in the past 12 months he thought she would have Twigg's measure should the Kiwi qualify through a regatta early next year.\n\n\"I think Kim has made significant steps this year and she's in career best form.\n\n\"She has been dominant ... and is really comfortable with where she's up to.\"\n\nApart from Crow, Australia's strongest medal chances in Rio lay with the men's quad scull and the men's four who both won silver at the world championships.\n\nO'Brien said another crew that should challenge for a top-three finish was the women's quad scull who had some bad luck in France.\n\n\"Our women's quad won their heat and in the next race there was a gust of wind across the whole course at the start and our girls managed to hook a buoy,\" he said.\n\n\"They had beaten the US in the heat and then the US went on to win the gold medal so it was disappointing there; it was a missed opportunity but the girls have handled it really well.\n\n\"What we'll get out of those three boats are some really strong medal chances for next year so that's really pleasing.\"\n\nAustralia qualified seven Olympic boats from 11 hopefuls while two Paralympic crews won gold to book their place in Rio.\n\nO'Brien said the results of the women's and men's double scull disappointed, with Sally Kehoe and Olympia Aldersey only managing fourth in the B final after winning bronze in the event last year.\n\nAlex Belonogoff and James McRae slipped to fifth after also winning bronze, however both crews qualified their boats for Rio.\n\nThose who missed qualification, such as the men's and women's eight crews, will be assessed at the Australian selection trials in Sydney next February and if deemed a medal chance than may be given another chance at a world cup regatta.", "source": "Sydney Morning Herald"}