{"published": "2015-09-16T23:45:57Z", "media-type": "Blog", "title": "“Hybrid” healer for “horrors”", "id": "6b03eda4-1d48-42eb-b389-7e9ea79f24f5", "content": "Thursday, September 17, 2015\nUnited Nations Human Rights Chief Zeid Ra’ad Al Hussein at yesterday's briefing on UNHRC Report on Sri Lanka. Dharisha Bastians \nreporting from Geneva\nThe United Nations Human Rights Chief Zeid Ra’ad Al Hussein has called for the setting up of a special ‘hybrid court’ comprising international judges and prosecutors after a report by his Office revealed “horrific” violations strongly indicating that war crimes were most likely committed by both government forces and the LTTE and declared the country’s justice system incapable of dealing with the seriousness of the crimes.\nThe UN High Commissioner for Human Rights yesterday released the long awaited report of an investigation by his office, into allegations that war crimes had been committed during the final stages of the Sri Lankan conflict.\nIndiscriminate shelling, extra judicial killings, enforced disappearances, “harrowing accounts” of torture and sexual violence, recruitment of children and other grave crimes had been laid bare in the report, the UN High Commissioner said.\nAs he made the 261 page report public, Zeid said Sri Lanka’s justice system was not up to the task of dealing with such grave violations.\n“The inescapable reality is that Sri Lanka’s criminal justice system is not ready to handle these types of crimes,” High Commissioner Zeid told a news conference at the Palais des Nations in Geneva yesterday. Zeid said the report had highlighted “years of denials and coverups”, the failure to carry out investigations and reprisals against those calling for justice. The High Commissioner said that domestic mechanisms of the past had suffered ‘repeated failures” to bring justice to victims, leading to skepticism, anger and mistrust on the part of victims. “Many of the structures responsible for the violations and crimes remain in place,” the High Commissioner noted.\nThe hybrid special court would deepen national importance while at the same time maintain international focus on Sri Lanka, High Commissioner Zeid explained.\nThe commitment by the new Government to pursue accountability through a domestic process was commendable, Zeid said, adding that “unfortunately, Sri Lanka’s criminal justice system is not yet ready”.\nThe High Commissioner told reporters that the absence of reliable witness protection, the inadequacy of the country’s legal framework and the “degree to which the country’s security sector and judicial system had been corrupted by decades of emergency, conflict and impunity” posed challenges to achieving justice for victims.\nThe High Commissioner noted that the investigation had been hindered by the fact that the Sri Lankan Government did not support the probe for almost entire length of the inquiry.\n“We were hampered by the inability to access the very people we needed to meet the most - victims in Sri Lanka,” Zeid said.\nHailing victims and survivors for the courage of their testimony that contributed to the 261 page, two-part report, the UN High Commissioner said he hoped the report would inspire change that many Sri Lankans had been “aching” for.\n“Sri Lanka will never escape the stinging tentacles of its past unless victims receive justice and redress,” the UN Rights Chief told journalists.\nThe High Commissioner said he hoped the UN Human Rights Council which is sitting in its 30th Session this month, will endorse the recommendations in the report. In response to a question posed by Daily FT about whether his office would urge the inclusion of the hybrid court in the draft resolution on Sri Lanka at the end of the session, Zeid said consultations on the draft were not yet underway.\nI will expect that there will be a careful reading of the report the shorter summary and the longer report. My hope is that the Human Rights Council will endorse the recommendations we have placed in our report. Since we have not had consultations on the draft yet, it is a discussion to come. Our hope is that the recommendation will be accepted and adopted by principally by the Government of Sri Lanka but that the Human Rights Council will see fit to support the recommendations,” he said.\nZeid strongly recommended vetting for security and military officials from Sri Lanka proposed for international peacekeeping missions or military exchanges. “It is absolutely clear given the findings in this report that there must be a great deal of soul-searching if the Sri Lanka is going to ensure non-recurrence. One would hope that within the security services, there will be a recognition that these methods were they to be proven in a court of law, do not bring greater stability to a country. It only brings more suffering and creates more victims,” the High Commissioner said.\nThe High Commissioner took pains to note that the investigation carried out by his office was a human rights investigation and not a criminal investigation. But he said it marked the beginning of a judicial process to confirm that war crimes and crimes against humanity had been committed by state actors and the LTTE and paramilitary groups during the Sri Lankan war.\nZeid said his office hoped this report would lead to efforts to end impunity for these crimes and create “a most intense reckoning with the past.”\n“The recognition that there are simply too many families throughout Sri Lanka that have suffered appallingly, too many who have disappeared, too many pushed into exile, too many funerals organised, too much pain felt and too much lost in terms of Sri Lanka’s human and economic potential, for the past not to be stared down, not to be learnt from and atoned for,” the High Commissioner said.\nThe OHCHR Investigation on Sri Lanka (OISL) conducted by a team of seven investigators and three special advisors, found evidence of extra-judicial killings and indiscriminate shelling by Government forces with the use of long range weapons. The report said investigators also found evidence that top LTTE commanders had prevented civilians from leaving the battle zones in the Northern Province and said the Tigers had repeatedly set up military fortifications near civilian areas and medical facilities. In a particularly interesting finding, the OISL report revealed that it had documented extensive recruitment of children in armed conflict by the LTTE which intensified during the final months of the conflict. The OISL also found that the Karuna group had recruited children after its split from the LTTE in 2004.\n“Based on the information gathered by OISL there are reasonable grounds to believe that Government security forces may have known that the Karuna group recruited children in areas under their control,” the report states.\nThe findings, if proven amount to a contravention of the UN convention on rights of the child and its optional protocol and would constitute a war crime if proven in a court of law, the report said.\nAs the High Commissioner issued his statement about the release of the report, victim families from North, East and South of Sri Lanka sat outside Press Room III of the Palais des Nations, watching his remarks on the live webcast. Zeid acknowledged the women as he left the press room following his news conference. Govt. assures ‘due attention’ to UN war crimes report In what the Office of the High Commissioner for Human Rights Spokesman Rupert Colville called a “cordial response”, the Government of Sri Lanka replied the OISL report, noting that it was not a criminal investigation and pledging to give it “due attention”.\nThe communiqué expresses the Government’s commitment to ensuring non-recurrence and pledges wide consultations with stakeholders and victims.\nThe following is the full text of the Government’s response to the UN report.\nThe Ministry of Foreign Affairs of the Democratic Socialist Republic of Sri Lanka presents its compliments to the Office of the United Nations High Commissioner for Human Rights (OHCHR) and with reference to the latter’s Note dated 10 September 2015 conveying an unedited advance copy of the Report of the Office of the High Commissioner for Human Rights (A/HRC/30/61) and the Report of the OHCHR Investigation on Sri Lanka (OISL) (A/HRC/30/SRP.2) has the honour to submit the following comments:\nThe Government of Sri Lanka,\n*Takes note of the Report of the Office of the High Commissioner for Human Rights (A/HRC/30/61), and the recommendations made by the High Commissioner;\n*Is pleased and encouraged by the High Commissioner’s recognition of the efforts of the new Government since the Presidential election of 8 January 2015 in dealing with issues of concern for the people of Sri Lanka relating to human rights, rule of law, governance, justice, institutional and legal reform and reconciliation;\n*Appreciates the due recognition given to the Government’s constructive engagement with the High Commissioner and OHCHR aimed at addressing post-conflict issues that impact on achieving reconciliation;\n*Remains firm in its conviction to take all possible measures to ensure non-recurrence in keeping with the mandate given by the people of the country twice this year, 2015, at the Presidential election in January and the Parliamentary election in August;\n*Will ensure dialogue and wide consultations with all stakeholders especially the victims of conflict, communities, political parties, civil society representatives, the military as well as the High Commissioner and his Office, bilateral partners, and other international organistions in putting in place mechanisms and measures that will facilitate the right to know, right to justice, reparations and guaranteeing non-recurrence with the aim of achieving reconciliation and durable peace to ensure long-term progress of all her citizens;\n*Takes note also of the Report of the OHCHR Investigation on Sri Lanka (OISL), recognises fully that this Report represents a human rights investigation and not a criminal investigation, and will ensure that its content as well as recommendations receive due attention of the relevant authorities including the new mechanisms that are envisaged to be set up;\n*Remains open to continuing its engagement with the High Commissioner and his Office as well as the systems and procedures of the Human Rights Council, aimed at taking steps to safeguard and uphold the human rights of all her citizens.\nThe Ministry of Foreign Affairs of the Democratic Socialist Republic of Sri Lanka avails itself of this opportunity to renew to the Office of the United Nations High Commissioner for Human Rights (OHCHR), the assurances of its highest consideration. TNA hails report; calls for introspection within Tamil community The Tamil National Alliance strongly welcomed the OISL report released yesterday, particularly the report’s recommendation for the establishment of a hybrid court and the incorporation of international crimes into Sri Lanka’s laws so that prosecutions could take place. TNA Lawmaker and Spokesman M.A. Sumanthiran told Daily FT at the Palais des Nations in Geneva that the party hoped the Government would accept the UN report.\nSumanthiran said the Foreign Minister in his address to the Human Rights Council this week had noted that that there was a new Sri Lanka in which things would be different.\n“Sri Lanka must now stand up and accept this report and work with the world community. To that extent, we ask the 47 Member States in the Human Rights Council to adopt all the recommendations in the OISL report as a resolution. We ask the Government of Sri Lanka to agree to that so that we can go forward with one aim. To deal with the past properly, in a manner that will assuage the feelings of the victims and having dealt with the past in a meaningful way to move forward into a bright future for all of Sri Lanka’s people,” the TNA Parliamentarian urged.\nHe also urged soul-searching within the Tamil community, about the community’s own failures. “We ask the Tamil people of Sri Lanka also to use this moment as a moment of introspection into our own community’s failures and create the right culture and atmosphere in which we can live with dignity and self-respect, as equal citizens of Sri Lanka,” Sumanthiran said. (DB) Namal claims UN suggestion an insult   MP Namal Rajapaksa yesterday in a tweet claimed that the OHCR’s call for the creation of a hybrid court in Sri Lanka was a “complete insult to the entire legal system of the country.” He said Sri Lanka is fully capable of conducting any domestic inquiry that is needed.\n“The double standards practiced by sections of the international community is injustice in itself. Sri Lanka courts have already demonstrated they have resources and capability to conduct credible investigations within existing legal framework,” he added. - See more at: http://www.ft.lk/article/471779/“Hybrid”-healer-for-“horrors” #sthash.1GL12x9S.dpuf", "source": "Poonththalir-பூந்தளிர்!!!"}