{"published": "2015-09-16T12:30:00Z", "media-type": "News", "title": "NGINX Launches NGINX Plus Release 7", "id": "6bf2d0b7-3b92-4bcc-8de5-f5fdd21a66a8", "content": "NGINX's Application Delivery Platform Delivers Full Support for the HTTP/2 Web Standard Alongside Dynamic Performance and Security Enhancements \n  \nSAN FRANCISCO, CA -- (Marketwired) -- 09/16/15 --  NGINX, Inc., the engine delivering sites and applications for the modern web, today announced the availability of NGINX Plus R7, the latest release of its application delivery platform. The update provides a fully supported implementation of the new HTTP/2 web standard, the first of its kind for a leading web server. This new release comes just days ahead of the company's second annual user conference, nginx.conf 2015, taking place September 22-24 in San Francisco. \n\nNGINX Plus can be deployed as a front-end HTTP/2 gateway and accelerator for both new and existing web services. With HTTP/2 support, organizations can now adopt the latest web standard without having to change any of their existing applications. NGINX Plus users will also benefit from the performance and security enhancements built into the new protocol, which was first made available in August as an early alpha-level patch enabling HTTP/2 support in NGINX. Based on user testing from the alpha-level patch, and with the early support from corporate co-sponsors Automattic and Dropbox, the final open source version will become available following the release of R7. \n     \nThe latest update also adds dramatic improvements to ensure organizations can deliver their applications with the performance, security, and reliability required for enterprise applications. These include significant enhancements to make application monitoring, management, and debugging easier, and additional security and performance-optimizing features. \n\n\"We have helped hundreds of new customers deploy their applications with NGINX Plus in the past year, and our latest release is about providing them with even more tools to ensure the best possible experience for their users,\" said Gus Robertson, CEO at NGINX, Inc. \"We are the fabric of our customers' infrastructure, and that puts us in a unique place to be able to provide unparalleled visibility and control over the applications they deploy. We take our critical role in our customers' business seriously, and the new capabilities in NGINX Plus R7 reflect that.\" \n\nIn addition to HTTP/2 support, new and updated features include: \nSignificantly improved performance: NGINX Plus R7 now includes the ability to use socket sharding optimizations to increase the performance of your servers, and thread pools for reducing workloads like content caching that involve high levels of disk I/O. NGINX's benchmarking has shown socket sharding to increase requests per second and reduce latency by more than 3x each, and the use of thread pools has been proven to drive a more than a 9x increase in server performance. Access control and security enhancements: New and extended features in NGINX Plus help improve the security and reliability of enterprise applications. Access controls and connection limits for TCP services allows organizations to apply protection rules for all NGINX-managed services, while support for NTLM authentication means that NGINX Plus can be deployed in front of legacy Microsoft applications. Improved management and diagnostics for visibility and control: NGINX Plus adds even more detailed monitoring and statistics data to the existing status and dashboard tools. Organizations can more easily track client errors, internal NGINX activity and the SSL load on their services to help identify problems and tune their configuration. Additionally, the new '-T' flag displays a consistent, complete view of complex NGINX configurations. Updated, interactive NGINX Plus dashboard: NGINX Plus' status dashboard has been significantly extended; now providing a tabbed interface to provide more detailed views of NGINX performance and health. Enterprises can drill down to identify and understand problems with their infrastructure and make rapid changes to their configurations. \nAdoption of NGINX has grown considerably in recent months. NGINX is now the #1 web server in the top 100,000 websites, with nearly half of the world's busiest sites using NGINX to deliver their experiences to billions of users. NGINX, Inc. continues to invest heavily in both its open source and commercially supported tools to make flawless application delivery easy for everyone -- from the smallest, lightest apps up to the world's largest platforms and experiences. \n\nFor more information, and to register for nginx.conf 2015, please visit: https://www.nginx.com/nginxconf/ \n\nTo learn more about NGINX Plus R7 and its features visit: https://www.nginx.com/blog/nginx-plus-r7-released/ \n\nAbout NGINX, Inc. \nNGINX is the heart of the modern web -- helping some of the world's most innovative companies deliver their sites and applications with performance, reliability, security, and scale. The company offers an industry award-winning, comprehensive application delivery solution in use on more than 120 million sites worldwide. Companies around the world rely on NGINX for ensuring a seamless web and mobile user experience through advanced load balancing, content caching, media streaming, application monitoring, and more. More than 40 percent of the Internet's largest websites rely on NGINX, including Airbnb, Box, Instagram, Netflix, Pinterest, SoundCloud, Zappos, and more. The company is headquartered in San Francisco with offices in Moscow and London.", "source": "Renewable Energy World"}