{"published": "2015-09-28T05:00:00Z", "media-type": "News", "title": "Combating next spring's grass allergies: Why now is the time for action", "id": "71c1a58f-8bdf-438f-b49a-fc26abcfe562", "content": "(BPT) - Many people are surprised to learn that grass allergies are the most common seasonal allergy in the United States [i] , [ii] and that most people are allergic to more than one type of grass. [iii] John Mueller, a father of three, is all too familiar with the consequences of severe grass allergies. “When I was younger my doctor wouldn’t allow me to play soccer outside; I had to play indoors since my allergy symptoms were so bad,” said Mueller, who lives in Pittsburgh. “As I got older, it got worse - I couldn’t cut the grass since my eyes would get really watery and itchy.” \n \nAs a kid, he went to the doctor’s office every two weeks to get allergy shots, but eventually stopped due to the inconvenience. Earlier this year, he asked his allergist if there was anything different he could try. David Skoner, MD, an allergy specialist at Pittsburgh’s Allegheny General Hospital, part of the Allegheny Health Network, suggested ORALAIR ® (Sweet Vernal, Orchard, Perennial Rye, Timothy, and Kentucky Blue Grass Mixed Pollens Allergen Extract). ORALAIR is a prescription medicine used for sublingual (under the tongue) immunotherapy prescribed to treat allergy symptoms like sneezing, runny or itchy nose, nasal congestion or itchy and watery eyes. These symptoms must be confirmed to be due to allergy to grass pollens from any of the grasses contained in ORALAIR. ORALAIR may be prescribed for people 10 to 65 years of age whose doctor has confirmed are allergic to any of the grass pollens contained in ORALAIR. ORALAIR is NOT an allergy medication that gives immediate relief of allergy symptoms. \n \n“To receive the effect of allergy immunotherapy, patients should start taking sublingual immunotherapy tablets before the grass allergy season begins,” said Dr. Skoner. “People who suffer from grass allergies need to remember year-round the severity of their symptoms each spring – something that is easy to forget once you’re in the fall and winter months.” \n \nORALAIR may be the right treatment choice for many people who have grass allergies, including those who have stopped taking allergy shots or do not want to take allergy shots because of cost, inconvenience or fear of needles. ORALAIR is a tablet that dissolves under the tongue. The first dose is taken in the allergist’s office under the supervision of a physician with experience in the diagnosis and treatment of severe allergic reactions. The patient is observed for at least 30 minutes for symptoms of serious allergic reactions. If the patient tolerates the first dose, the remaining doses are administered once a day by the patient or the patient’s caregiver. ORALAIR can cause severe allergic reactions that may be life-threatening. Please see important safety information below. \n \nORALAIR is taken for about four months before the expected start of the grass pollen season and is continued throughout the grass pollen season. That’s why it’s important for patients to see their allergist in the fall and winter, long before the grass allergy season begins. \n \nThe change in treatment has opened up new possibilities for Mueller and his family. “I was finally able to go outside and build a swing set for my kids to play on,” he said. “Getting that time back to enjoy being outside with my sons means a lot to me.” \n \nFor more information on ORALAIR, please see Important Safety Information below and talk to your doctor, or visit http://oralair.com/ . \n \nImportant Safety Information \n \nWARNING: SEVERE ALLERGIC REACTIONS \n ORALAIR can cause life-threatening allergic reactions such as anaphylaxis and severe laryngopharyngeal edema. Do not administer ORALAIR to patients with severe, unstable or uncontrolled asthma. Observe patients in the office for at least 30 minutes following the initial dose. Prescribe auto-injectable epinephrine, instruct and train patients on its appropriate use, and instruct patients to seek immediate medical care upon its use. ORALAIR may not be suitable for patients with certain underlying medical conditions that may reduce their ability to survive a serious allergic reaction. ORALAIR may not be suitable for patients who may be unresponsive to epinephrine or inhaled bronchodilators, such as those taking beta-blockers. \nORALAIR is contraindicated in patients with severe, unstable or uncontrolled asthma, patients with a history of any severe systemic allergic reaction or severe local reaction to sublingual allergen immunotherapy or of eosinophilic esophagitis, or patients who are hypersensitive to any of the inactive ingredients. \n \nORALAIR can cause systemic allergic reactions, including anaphylaxis, and severe local reactions, including laryngopharyngeal swelling, which may be life-threatening. Severe and serious allergic reactions may require treatment with epinephrine. Patients who have a systemic allergic reaction to ORALAIR should stop taking the product. Eosinophilic esophagitis has been reported in association with sublingual tablet immunotherapy. Discontinue ORALAIR in patients with persistent symptoms of eosinophilic esophagitis, including dysphagia or chest pain. ORALAIR treatment should be withheld if the patient is experiencing an acute asthma exacerbation. Re-evaluate patients who have recurrent asthma exacerbations and consider discontinuation of ORALAIR. Concomitant dosing with other allergen immunotherapy may increase the likelihood of local or systemic adverse reactions to either subcutaneous or sublingual allergen immunotherapy. \n \nIn case of oral inflammation or wounds, such as following oral surgery or dental extraction, ORALAIR treatment should be discontinued to allow complete healing of the oral cavity. The risk of ORALAIR may be increased when treatment is initiated during the grass pollen season. \n \nThe most common adverse events reported in ≥5% of patients were oral pruritus, throat irritation, ear pruritus, mouth edema, tongue pruritus, cough, and oropharyngeal pain. Patients who have escalating or persistent local reactions to ORALAIR should be reevaluated and considered for discontinuation of ORALAIR. \n \nORALAIR should be used during pregnancy or breastfeeding only if clearly needed. \n \nMPN 091515H1708 \n \n[i] Salo PM, Calatroni A, Gergen PJ, et al. Allergy-related outcomes in relation to serum IgE: results from the National Health and Nutrition Examination Survey 2005-2006.   J Allergy Clin Immunol.  2011;127(5):1226-1235. \n \n[ii] Arbes SJ Jr, Gergen PJ, Elliott L, Zeldin DC. Prevalences of positive skin test responses to 10 common allergens in the US population: results from the third National Health and Nutrition Examination Survey.   J Allergy Clin Immunol. 2005;116(2):377-383. \n \n[iii] Esch RE. Grass pollen allergens. In: Lockey RF, Bukantz SC, eds.   Allergens and Allergen Immunotherapy . 2nd ed. New York, NY: Marcel Dekker; 1999:103-12", "source": "Imperial Valley Press"}