{"published": "2015-09-15T18:29:40Z", "media-type": "News", "title": "How Regular People Are Helping Refugees In One Of Western Europe’s Largest Camps", "id": "4caf2601-4da7-4b13-8b79-ea57a6ef7e9b", "content": "Tweet [embedded content] \r Tweet [embedded content] \nPositive News: Five ways ordinary people are helping refugees in Calais \n      \nFor Middle Eastern refugees living in the makeshift camp in Calais, France, known as “the Jungle,” living conditions are poor and tensions with the port town’s residents are high.  \n \n“The Jungle” is at least a temporary home to an estimated 5,000 refugees who come from conflict-torn countries such as Eritrea, Afghanistan and Syria and are trying desperately to enter the U.K. in search of a better life. Their push has been met with a security crackdown that has resulted in increasing numbers of refugees to attempt to enter England from other ports. The camp has been described as one of the largest of its kind in Western Europe.  \n \nAlthough few Brits across the English channel are supportive of taking in the refugees, many of their compatriots are finding ways to improve the lives of those living there. Their stories have received less attention than the conflict between the French and British government over how to handle the region’s migrant crisis.  \n \nIn an effort to counter that, Positive News, a U.K.-based, solutions-oriented news outlet, outlined a number of efforts from everyday people who are trying to make even a small positive impact on refugees’ lives. \n \nOne group, Jungle Books, was founded by British teacher Mary Jones. Jones created a library stocked with more than 200 books, which help the refugees learn how to read and write in English, thereby improving their employment prospects, according to Positive News. A school has also been created. \n \nIn addition, a Facebook group, People to People Solidarity, is serving as an online hub for Brits looking to coordinate taking action. It has more than 26,000 members. \n \nAnother group, Bikes Beyond Borders, has donated bikes and supplies like sleeping bags and tents to those living in the camp. The bikes allow for a less time-consuming trip into town for refugees to apply for jobs or fill out forms. \n \nRosie Strickland, a participant in a recent “critical mass” bike ride to deliver bikes and supplies to the Calais camp, wrote of the experience in a followup piece on Positive News: \n \n ”We left the camp with a deep sense of irony and of our own privilege. How can it be possible that we can walk away, board a ferry, and reach England so easily when our friends fend for their lives in a lawless, sometimes ruthless, and filthy camp, fighting to be recognised as human?” \n \nMORE: \n \nEnsia: Surprising ways Kenyans are embracing climate-smart agriculture \n \nNPR: Alabama’s Science Standards Get A Makeover \n \nThe What’s Working Honor Roll highlights some of the best reporting and analysis, from a range of media outlets, on all the ways people are working toward solutions to some of our greatest challenges. If you know a story you think should be on our Honor Roll, please send an email to editor Joseph Erbentraut at joseph.erbentraut@huffingtonpost.com with the subject line “WHAT’S WORKING.”     \n \nAlso on HuffPost: \n \n– This feed and its contents are the property of The Huffington Post, and use is subject to our terms. It may be used for personal consumption, but may not be distributed on a website.", "source": "Free-i-News"}