{"published": "2015-09-30T12:52:00Z", "media-type": "News", "title": "The Creative Momentum Earns 17 W3 Awards in AIVA's Best of the Web", "id": "3d4d5206-ff65-4299-8cff-cb6a60aabf79", "content": "SOURCE The Creative Momentum\n\nOut of 5,000 entries, agency earns one Gold and 16 Silver web competition awards for best web design and development\n\nATLANTA \n\n\"We are absolutely blown away to be distinguished among thousands of top-tier agencies,\" said The Creative Momentum's President Michael White \n\nThe W3 Awards recognize the people behind award-winning sites, marketing programs, social content, mobile site/apps and online video. In the tenth year of the W3 Awards, The Creative Momentum earned 16 Silver Awards and one W3 Gold Award for a video in the category of Branded Content: Promotional/Branding. Of this year's 5,000 entries, less than 10 percent were selected as Gold Winners. The AIVA is made up of executives at acclaimed media, interactive, advertising and marketing organizations including: Agencynet, AvatarLabs, Big Spaceship, Brandweek, Code and Theory, Disney, HBO, Microsoft, Monster.com, MTV, Sesame Workshop, Victoria's Secret, Wired and Yahoo!\n\nFind the 2015 W3 winners list and additional information on the AIVA W3 Awards.\n\nLearn more about The Creative Momentum at thecreativemomentum.com or call 678-648-1445.\n\nAbout The Creative MomentumThe Creative Momentum is an Atlanta-based, full-service creative and digital marketing agency, specializing in custom web design and development for businesses. The Creative Momentum provides custom Web/Interactive, Marketing, SEO, Custom Graphic/Logo Design, Branding, Advertising, Media, Mobile Design and Strategic Planning to clients in high-tech B2B, B2C, consulting, security and non-profit industries. Learn more at thecreativemomentum.com or call 678-648-1445.\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/the-creative-momentum-earns-17-w3-awards-in-aivas-best-of-the-web-300151462.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WXTX Fox 54"}