{"published": "2015-09-21T13:08:56Z", "media-type": "News", "title": "Army says NPA recruiting lumad", "id": "87e2fe71-a8d9-4eab-bd71-f27aa7e3418c", "content": "MANILA - The head of the Philippine Army on Monday said soldiers are not involved and will never be involved in any abuse or killings of the Lumad of Mindanao.\n\nPhilippine Army chief Lt. Gen. Eduardo Ano said that as members of the Armed Forces, a soldier's duty is to protect the people.\n\nHe said there should be emphasis on caring for the Lumad and indigenous people because they are the most marginalized sector in our society.\n\nHe said the campaign plan of the Armed Forces in Mindanao is very IP-centric meant to uplift and protect the rights of the Lumad.\n\nHe said that based on their study and research, it is the New People's Army that has been taking advantage of the Lumad by using their dire situation to recruit them and fight against government.\n\nHe said based on their research, three out of four members of the NPA in Eastern Mindanao were recruited from the Lumad and now belong to the Pulang Bagani Command I that was once headed by Commander Parago.\n\nThe statement was made after the closing ceremony of the Malaysia Philippines land training activity, which highlighted the sharing of the best practices in humanitarian response and disaster response.\n\nPublic outrage over the plight of the lumad reached its peak after three IPs, including a school head, were gunned down in Lianga, Surigao del Sur last September 1.\n\nThe fatalities were identified as Emerito Samarca, executive director of lumad school Alternative Learning Center for Agriculture and Livelihood Development; Manobo leader Dionel Campos; and his cousin Bello Sinzo.\n\nHuman rights group Karapatan accused the paramilitary group Mahagat-Bagani of being behind the killing. It likewise accused the military of causing the displacement of lumads in Mindanao.\n\nThe military has denied the existence of the paramilitary group and said several lumad are empathizing with communist rebels.", "source": "ABS-CBN News"}