{"published": "2015-09-10T05:00:44Z", "media-type": "News", "title": "Incap and Comsel System launch co-operation in equipment manufacture for Internet of Things (IoT)", "id": "a9d3af7e-83d1-40ac-9976-e84c2f452961", "content": "Incap Corporation    Press release            10 September 2015 at 8:00 (EET) \n \nINCAP AND COMSEL SYSTEM LAUNCH CO-OPERATION IN EQUIPMENT MANUFACTURE FOR INTERNET OF THINGS (IoT) \n    \nEMS provider Incap Corporation and developer of Internet of Things (IoT)-solutions Comsel System Ltd have signed an agreement on the manufacture of IoT-equipment. Devices to be manufactured by Incap are among others communication modules used for remote data acquisition and control for the energy sector. Besides the manufacture Incap will also take care of the final assembly (Box-Build) and delivers the products directly to the customers of Comsel System. \n \nIoT-solutions are to be used in the energy sector where data needs to be collected and analyzed in real time so that energy can be produced more accurately, supplied and used more efficiently, and resources used more economically and environmental friendly. TeliaSonera and the consultancy firm Arthur D Little estimate the total Nordic IoT- market, including all kinds of IoT-solutions, to reach 100 million connected objects by 2018 according to a recent report. \n \nTeemu Pokela, Director of Business Development at Incap: \"We are very pleased that Comsel has chosen us as their manufacturing partner. Being a member of their innovative and continuously improving supply chain is an inspiring task for us, also because Internet of Things is highly interesting business with great potential and exciting outlook. The partnership provides us with steady revenue and new opportunities for further expansion of our business.\" \n \nKristian Heimonen, CEO of Comsel: \"For Comsel it is important to team up with a partner who is willing to understand our customers needs and demands, today and tomorrow. In the rapidly changing field we operate in, we continuously need to improve ourselves and this can only be done in the right partnership. Important qualities we looked for in a partner included the ability to combine flexibility with high quality deliveries to the right price at the right time, and to do so with the lowest possible environmental impact. In Incap, we have found a partner with these abilities, and a desire for continuous improvement. We are looking forward to a long-term partnership together with Incap.\" \n \nINCAP CORPORATION \n \nFurther information: \nTeemu Pokela, Director, Business Development Europe \nTel. +358 40 347 2073 \nteemu.pokela@incapcorp.com \n \nVille Vuori, President and CEO \nTel. +358 400 369 438 \nville.vuori@incapcorp.com \n \nCOMSEL SYSTEM Ltd \nFurther information: \nKristian Heimonen, CEO \nTel. +358 50 383 0001 \nKristian.heimonen@comsel.fi \n \nDISTRIBUTION \nMajor media \nwww.incapcorp.com \n \nMORE ABOUT INCAP \nIncap Corporation is an international contract manufacturer whose comprehensive services cover the entire life-cycle of electromechanical products from design and sourcing to actual manufacture and further to maintenance services. Incap's customers are leading suppliers of high-technology equipment in their own business segments, and Incap increases their competitiveness as a strategic partner. Incap has operations in Finland, Estonia, India and China, and the company currently employs approximately 400 people. Incap's share has been listed on the NASDAQ OMX Helsinki Ltd since 1997. Additional information: www.incapcorp.com. \n \nMORE ABOUT COMSEL \nComsel System is a product design and development company specialized in development and industrialization engineering for the energy sector. Comsel offers its customers a full range of Internet of Things products and services. More than one million metering points in the Nordic countries are today using TCP/IP-communication technology previously developed by Comsel. The Comsel head office is located in Vasa, Finland. Comsel System Ltd operates on the Finnish, Swedish, Norwegian and Danish markets.Comsel System Ltd, additional information: www.comsel.fi.", "source": "WRAL"}