{"published": "2015-09-01T02:17:17Z", "media-type": "News", "title": "Overweight pup gets second chance at life", "id": "e11ce6a7-b138-44fa-8341-cccf5d234bd2", "content": "(CNN) -  \nObese, unhealthy and mourning the loss of his owner, Vincent was surrendered to a county animal shelter in Houston two weeks ago. His prospects didn't look good. \n \nHe weighed in at 38 pounds, double the healthy weight for a 7-year-old dachshund. He had high cholesterol and his back dipped from the extra weight, putting him at risk of nerve damage. Mary Tipton, the intake coordinator for K-9 Angels Rescue, and a member of the board of directors for Harris County Animal Shelter, happened to be at the shelter for a meeting when she spotted him. \n\n\"Vincent was just enormous,\" Tipton said. She took a picture and posted it on Facebook to find him a foster parent. Within 15 minutes, dachshund rescuer Melissa Anderson volunteered to take Vincent in. \n\nVincent's case is extreme, but obesity affects a lot of pets. In 2014, an estimated 52.7% of U.S. dogs were overweight or obese, according to the National Pet Obesity Awareness Day Survey. \n\nNow Anderson is slowly bringing Vincent back to health. \n\nThe first week wasn't easy for either Vincent or his foster parent. When leaving the vet with such a large dog, Anderson said she felt fat-shamed by someone walking on the sidewalk. \n\n\"They told me, 'Now that's just abuse,' and acted like they had to go out of their way to walk around Vincent,\" said Anderson. \"Some people just don't know other people's story. They just make assumptions by their appearances.\" \n\nWhen she took him home, Vincent got sick, both vomiting and upset bowels, when he ate the healthy dog foods she gave him. Anderson could tell he was despondent. \n\n\"I am not sure what the previous owner fed him, but I think it was all fast food. He was literally detoxing the first week,\" she said. \n\nAnderson said when she went to a Starbucks drive-thru one day, Vincent got really excited by the sound of the intercom. \"He jumped on my lap and stuck his nose outside the window, just sniffing away.\" \n\nBut after just two weeks, Anderson said Vincent is well on his way to a healthier lifestyle. \n\nVincent eats a special dog food; Anderson offers him green beans or carrots as \"treats\" but he hasn't really gone for those yet. \n\nHe's on a pretty rigorous exercise regime, participating in water aerobics five times a week and playing with her others dogs in the yard. The water aerobics help take pressure off Vincent's strained joints. Plus, with the 100-degree weather in Texas, it offers a nice cool-down for both Vincent and Anderson. \n\nAt first, Vincent would just float in his life jacket. But his endurance is growing. Vincent can now paddle in the pool for about 15-20 minutes, five days a week. Before, he could only waddle around the yard with the other dogs. Now he is able to jog. \n\n\"He is really happier now then he was,\" said Anderson. She said he keeps a positive attitude and seems to know they are trying to help him. \n\nK-9 Angles Rescue is hoping to get him to a healthy weight so he can be ready for adoption, but they aren't opposed to him being adopted in his current condition. \n\n\"We take adoptions case by case. If there was a perfect home that wanted to take over his weight loss journey we may take that into consideration,\" said Tipton. \"We are in no hurry to get rid of him but there are other dogs at the shelter that are ready to be saved.\" \n\nNow, Fat Vincent is on his way to become Skinny Vinnie. He was 38-pounds and two weeks later weighs in at 35.2. His weight loss will be a slow process but with the help of K-9 Angles Rescue he is on his way to his new life.", "source": "Channel 3000"}