{"published": "2015-09-11T18:33:00Z", "media-type": "Blog", "title": "Kobach's office acknowledges hosting Bible sessions but says worker was not fired for failing to attend", "id": "63101a3d-1d50-40e2-a83b-d8a12c9250f2", "content": "Wichita \u0097 The Kansas secretary of state’s office acknowledged Friday in a court document that it sporadically hosts Bible study sessions, but denied firing an employee for not attending them. The court filing comes in the office’s formal answer to the civil lawsuit that Courtney Canfield filed last month in U.S. District Court in Topeka. Canfield alleges she was terminated from her clerk’s job after declining to attend prayer services held in the office. In its response, the state told the court that all were welcome to attend the Bible study, but no staff member was required to attend. It noted that the majority of the staff did not attend the sessions. Canfield also contends in her lawsuit that invitations to the religious services at the office were distributed during normal business hours, and that they included a “prayer guide” to be used at that week’s meeting. Kansas responded that it had “insufficient information” to determine whether the invitation was distributed during business hours, but said those who chose to attend were provided a devotional booklet to be used during the Bible study. Canfield, who was hired in January 2013 as an accounts clerk, contends in her lawsuit that before Assistant Secretary of State Eric Rucker ousted her in November 2013, he “repeatedly and emphatically indicated a basis for her termination as the fact that, ‘She just doesn’t go to church.’” Rucker denies in the court filing that he had any knowledge of Canfield’s religious habits while she was employed by the secretary of state’s office. The state rejected the claim that Canfield was discriminated against because of her perceived lack of “religious zeal,” telling the court that she was fired due to her poor work performance and her inability to work productively with others. Canfield’s attorney did not respond to email and phone messages Friday, and Canfield did not immediately respond to a phone message left with a relative. Secretary of State Kris Kobach also did not immediately return a phone message seeking comment. But Vickie Stangle, president of the Great Plains Chapter of Americans United for Separation of Church and State, said the hosting of Bible study sessions in the workplace by the Kansas secretary of state’s office “crosses the line.” She said employees feel peer pressure to participate even if are not required to attend. Stangle said having the sessions creates the perception that government is promoting and endorsing a religion. “I look at these places as places we are conducting public business and they are not supposed to be houses of worship, and yet it seems to be happening more and more under the guise of so-called religious freedom,” she said. Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. We strive to uphold our values for every story published.", "source": "LJWorld.com stories: News"}