{"published": "2015-09-24T12:18:11Z", "media-type": "News", "title": "BioLight’s Eye-D Technology to be Featured at the 5th Annual Partnership Opportunities in Drug Delivery Conference in Boston", "id": "c66d4c47-9bdd-488d-b9c7-d48f40907d87", "content": "By PR Newswire  \nArticle Rating: \n   September 24, 2015 08:18 AM EDT       \nTEL-AVIV, Israel , September 24, 2015 /PRNewswire/ -- \n\nBioLight Life Sciences Investments (OTCQX: BLGTY, TASE: BOLT) (\"BioLight\" or the \"Company\"), a firm that invests in, manages and commercializes biomedical innovations in ophthalmology and cancer diagnostics, announced today that its Eye-D platform insert will be presented at the 5 th Annual Partnership Opportunities in Drug Delivery (\"PODD\") conference on Monday, October 5, 2015 at 2:00 p.m. Eastern Time at the Boston Intercontinental Hotel in Boston, MA. \n\nThe Eye-D is BioLight's platform insert for controlled release ophthalmic medications. The Eye-D is designed to address the known poor compliance of eye drops administration. The first Eye-D indication, the VS-101, contains the market leading glaucoma drug, latanoprost  (Pfizer Inc.'s Xalatan ® ).  Utilizing a simple in-office procedure, the VS-101 is intended to release prostaglandin analog (PGA) drug in a controlled manner over time, providing 100% patient compliance to drug therapy. \n\nPODD 2015 seeks to foster a meeting place that inspires innovation and advancement of drug development and delivery as well as providing support for the leaders behind the movement.  For more information on the conference, please visit http://theconferenceforum.org/conferences/partners-in-drug-delivery/agenda/ . \n\nAbout BioLight Life Sciences Ltd.   \n  \nBioLight invests in, manages and commercializes biomedical innovations grouped around defined medical conditions - ophthalmology and cancer diagnostics. The ophthalmic technologies include IOPtiMate™, a laser-based non-invasive surgical treatment for glaucoma; TeaRx™, a point-of-care multi-parameter diagnostic test for dry eye syndrome; Eye-D, a subconjunctival platform insert for controlled release of eye drops for the improvement of ocular molecule transmission; and OphRx, a drug delivery technology platform for ocular uses. The cancer diagnostic technologies include proprietary tests that are designated for bladder, cervical, multiple myeloma and other cancers. \n\nLeading key investors are Mr. Israel Makov , Chairman of Sun Pharmaceuticals, former CEO and President of Teva Pharmaceuticals and former Chairman of Given Imaging, Mr. Dilip Shanghvi , founder of Sun Pharmaceuticals, India's largest pharmaceutical company, and Mr. Dan Oren , founder and CEO of Dexcel Pharma, the second-largest pharmaceutical manufacturer in Israel . \n\nFor more information please visit the Company's website at http://www.bio-light.co.il . \n\nCONTACTS: \nBioLight \nItai Bar-Natan , CFO \nEmail: [email protected] \nTel: +972-73-2753400 \n\nSOURCE  BioLight Life Sciences Investments", "source": "Ulitzer"}