{"published": "2015-09-15T23:31:07Z", "media-type": "News", "title": "Demand for diesel 'leaves UK at mercy of global market'", "id": "51ce29b6-1dce-4d14-b9d0-c0938a6e8691", "content": "The growing gulf between the UK's demand for diesel and what it can produce is leaving motorists \"at the mercy of the global market\", a report has warned.\n\nDiesel use has risen by 76% over the past 20 years and is twice as popular as petrol, according to a study by motoring research charity The RAC Foundation. \n\nSome 45% of the UK's diesel demand is already met by foreign suppliers whereas the UK is a net exporter of petrol. \n\nThe report, entitled Readdressing The Balance Between Petrol And Diesel Demand, stated that this reliance on imports was partly down to the declining number of refineries - from nine in 2009 to six today. \n\nThe imbalance was also found to be a result of some of the older refineries being configured to produce petrol rather than diesel. Retrofitting for the latter is hugely expensive.\n\nRAC Foundation director Steve Gooding said: \"That leaves us at the mercy of the global market and much of the rest of Europe is in the same boat. We are having to look further and further afield for the fuel we need. \n\n\"Recently motorists have benefited from falling forecourt prices. We should be concerned about the potential for things to go the other way.\"\n\nThe report noted that t he number of diesel cars has soared from 1.6 million in 1994 to 11 million in 2014. \n\nIt predicted that diesel fuel will be four times more popular than petrol by 2030. \n\nMr Gooding said: \" Today every other car bought is a diesel, but our refineries have struggled to keep pace with demand and have not attracted the investment they need to switch over from petrol production. \n\n\"Most of our refineries - some of which are more than half a century old - were built when diesel was a niche product.\n\n\"Retrofitting them is a billion-pound decision that has failed to stack up for investors who see refining as a low margin business despite our sky high pump prices.\"\n\nDrivers of diesel vehicles could face restrictions on going into city centres under recent Government proposals to improve air quality. \n\nA consultation document named six cities including Birmingham, Leeds and Southampton where measures should be considered in a bid to reduce nitrogen dioxide (NO2) emissions. \n\nMayor of London Boris Johnson has already announced plans for an ''ultra-low emission zone'' in the capital from 2020.\n\nCopyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Bognor Regis Observer"}