{"published": "2015-09-10T13:38:22Z", "media-type": "News", "title": "Hotel operators are urged: help keep children safe from sexual abuse in Worcestershire", "id": "b3b07cc7-e038-4352-ad8c-5ef9978b0fd7", "content": "HOTEL operators are being urged to spot the signs of child sexual abuse in Worcestershire - ramping up the battle to weed out sick predators. \n \nTwo months after council chiefs vowed to ensure taxi drivers get new training to report any suspected abuse victims, safeguarding experts now want to extend the remit. \n \nYour Worcester News can reveal how a mystery hotel in the county recently became aware of possible abuse inside one of its rooms and contacted police. \n \nNow hotels across Worcestershire are being encouraged to do the same to ensure the county doesn't fall into the same trap as areas like Rochdale, Rotherham and Oxford, where abusers were allowed to get away with it for so long. \n \nDianna Fulbrook, the independent chair of the safeguarding children board, attended a meeting at Worcestershire County Council  today to discuss it. \n \nDuring the debate councillors told her they believed the more \"ordinary people\" are aware of child sexual abuse, the better. \n \nCouncillor Paul Denham, speaking during a meeting of the children and families overview and scrutiny panel, said: \"A lot of abuse is best prevented by having the biggest possible number of ordinary people aware of the signs of abuse. \n   Promoted stories   \n\"And that depends on having those with the knowledge and enthusiasm training people.\" \n \nHe reminded the panel about taxi driver training, again highlighting the success of a scheme in Scarborough where hundreds of cabbies must spend two hours getting compulsory training, led by experts, to spot the signs of child abuse in return for a licence - and asked Mrs Fulbrook for her views on expanding the theme. \n \n\"Clearly it's a crucial issue, part of our child sexual exploitation 'action plan' is about raising awareness of abuse and the police I know, are looking at a specific public awareness campaign,\" she said. \n \nShe said the county's regulatory services are looking into training for taxi drivers before moving onto the role hotels could play. \n \n\"There was one incident recently where one hotel receptionist wasn't happy with something, shall we say, and called the police,\" she said. \n \n\"That was a very positive response and what we're looking for is more of that.\" \n   \n Share article  \n   \nAs we revealed in July, an action plan has been drawn up to get assurances that 'large scale and organised child sexual abuse is not present in Worcestershire'. \n \nIt includes better training for schools so staff can spot signs of sexual abuse and the creation of a checklist for Worcestershire pharmacies to also identify abused children.", "source": "Evesham Journal"}