{"published": "2015-09-23T19:27:54Z", "media-type": "Blog", "title": "tamaranth @ 2015-09-23T20:26:00", "id": "96efe032-131c-4f52-aaae-6a30b732fdd9", "content": "2015/18: Vicious -- V. E. Schwab\nBy the time the first bell rang, signaling the end of Victor’s art elective, he’d turned his parents’ lectures on how to start the day into: Be lost. Give up. give In. in the end It would be better to surrender before you begin. be lost. Be lost And then you will not care if you are ever found. He’d had to strike through entire paragraphs to make the sentence perfect after he accidentally marked out ever and had to go on until he found another instance of the word. But it was worth it. The pages of black that stretched between if you are and ever and found gave the words just the right sense of abandonment. [loc. 141]\n\nVictor and Eli are roommates at college. Victor is somewhat introverted, prone to brooding and scheming and taking a Sharpie to the pages of books by his self-help guru parents. His friendship with Eli (political-candidate smile and general wholesomeness) seems mostly founded on the moments where Eli's cheerful, normal facade seems to crack. They are both intelligent, arrogant and competitive. And kind of doomed.\n\nIt's time for the two to declare their senior theses. Victor picks 'adrenal inducers' (fight or flight etc) but Eli, more ambitiously, decides to study ExtraOrdinaries: \"An argument for the theoretical feasibility of the existence of ExtraOrdinary people, deriving from laws of biology, chemistry, and psychology\". EOs are, effectively, superheroes: people with unusual gifts. None of them are familiar by name, though Spiderman and Superman are cited as examples of nurture and nature. Eli thinks that there is a very specific set of circumstances that will create an EO. Victor, more or less on the spur of the moment, offers to be the first experimental subject.\n\nVicious alternates between the events of a decade ago -- when Victor and Eli performed their experiments and Victor was imprisoned for murder -- and the 'now' in which Victor is ... keen, shall we say ... to meet up with his old college friend. Cue much discussion of heroes and villains, and the recruitment of former cellmate Mitch and 12-year-old runaway Sydney Clarke to Victor's team. We don't get to see much of Eli and his cohorts, which is a shame, because the novel does occasionally feel imbalanced. But Vicious is nevertheless a well-paced, well-plotted novel with a lot of dark humour (and dark stuff that isn't at all funny) and an interesting spin on the notion of the superhero -- and the inevitable inverse, the supervillain. Is Victor a villain? He does some things that are not at all nice. Is Eli a villain? But he seems so wholesome. \n\nI think I probably picked this up as part of my 'pictureless books about superheroes' kick. I'm glad I got around to reading it.\n\nThis entry was originally posted at http://tamaranth.dreamwidth.org/945524.html. Comment wherever you wish (though my preference is for There, rather than Here).", "source": "Tamaranth"}