{"published": "2015-09-04T22:24:17Z", "media-type": "News", "title": "Jessica Alba’s Honest Company sued for alleged false labeling", "id": "1d84f6dd-46e8-40d5-83f1-55c5b7406602", "content": "The lawsuit alleges the Honest Company falsely says its products are “natural.” It further says that Honest’s sunscreen isn’t “effective.” \n\n“The allegations against us are baseless and without merit.We strongly stand behind our products and theresponsibilitywe have to our consumers,” Alba said in a statement to CNNMoney. \n\n“I am very proud that we have built this company into an industry leader focused on using natural ingredients and developing products that people love,” she added. \n\nEarlier this year, the company vowed publicly to “do what it takes to make it right” after facing complaints for supposed problems with its sunscreen. \n\nCustomers had taken to social media, posting pictures of sunburns they say they got wearing the Honest Company’s SPF 30. The company said the sunscreen is effective. \n\nThe lawsuit was filed in federal court in California this week on behalf of one customer. \n\nAttorney Nicholas Carlsin said he would ask a judge to certify the suit as a class action, which means other customers with similar claims could participate in it. \n\nThe complaint claims the Honest Company’s marketing and online messages are misleading, even as it vows to be “transparent.” \n\n“The ‘honestly FREE guarantee’ states: ‘Providing clear, credible, transparent information. No smoke and mirrors. No confusion,'” the suit states. \n\nThe suit also cites a CNNMoney video interview from last month. In the interview, Honest Company CEO Brian Lee said he would “welcome” it if larger companies would ban the “1,200 chemicals we do not use in our products.” The video goes on to note that the Honest Company’s website lists only about 40 products that it says it excludes from its products. \n\nClick here to read full story »", "source": "997WTN.com"}