{"published": "2015-09-17T20:30:00Z", "media-type": "News", "title": "TeleTech's Board of Directors Declare Semi-Annual Cash Dividend", "id": "13073a61-69ae-4792-9e7a-c96fbeb100b4", "content": "SOURCE TeleTech Holdings, Inc.\n\nDENVER \n\nABOUT TELETECH\n\nTeleTech (NASDAQ: TTEC) is a leading global provider of customer experience, engagement and growth solutions. Founded in 1982, the Company helps its clients acquire, retain and grow profitable customer relationships. Using customer-centric strategy, technology, processes and operations, TeleTech partners with business leadership across marketing, sales and customer care to design and deliver a simple, more human customer experience across every interaction channel. Servicing over 80 countries, TeleTech's 40,000 employees live by a set of customer-focused values that guide relationships with clients, their customers, and each other. To learn more about how TeleTech is bringing humanity to the customer experience, visit TeleTech.com.\n\nFORWARD-LOOKING STATEMENTS\n\nStatements in this press release contain \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, Section 21E of the Securities Exchange Act of 1934, and the Private Securities Litigation Reform Act of 1995, relating to our operations, expected financial position, results of operation, and other business matters that are based on our current expectations, assumptions, and projections with respect to the future, and are not a guarantee of performance. We use words such as \"may,\" \"believe,\" \"plan,\" \"will,\" \"anticipate,\" \"estimate,\" \"expect,\" \"intend,\" \"project,\" \"would,\" \"could,\" \"target,\" or similar expressions, or when we discuss our strategy, plans, goals, initiatives, or objectives, we are making forward-looking statements. \n\nWe caution you not to rely unduly on any forward-looking statements. Actual results may differ materially from what is expressed in the forward-looking statements, and you should review and consider carefully the risks, uncertainties and other factors that affect our business and may cause such differences as outlined but are not limited to factors discussed in the sections entitled \"Risk Factors\" included in TeleTech's filings with the US Securities and Exchange Commission (the \"SEC\"), including our most recent Annual Report on Form 10-K and subsequent quarterly financial reports on Form 10-Q. TeleTech's filings with the SEC are available in the \"Investors\" section of TeleTech's website, www.teletech.com and at the SEC's public website at www.sec.gov. Our forward looking statements speak only as of the date of the press release and we undertake no obligation to update them, except as may be required by applicable laws.\n\nLogo - http://photos.prnewswire.com/prnh/20140717/127860 \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/teletechs-board-of-directors-declare-semi-annual-cash-dividend-300145174.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WMCTV.com"}