{"published": "2015-09-06T01:44:24Z", "media-type": "Blog", "title": "Quick look at the Raiders’ 53-man roster", "id": "17feb952-5450-44a7-b681-9d1d3706ce91", "content": "Here’s a look at the Raiders’ current 53-man roster. It’s always a fluid situation, especially with some areas that could use an upgrade (secondary, backup offensive line being the biggest needs).  \n\n Quarterbacks  Derek Carr, Matt McGloin: McGloin beat out Christian Ponder to serve as the backup and the Raiders have too many other needs elsewhere to have three QBs. If the Raiders have to go beyond these two, they’re in trouble already and Ponder or someone else out there of his caliber would probably be available.   Running backs  Latavius Murray, Roy Helu Jr., Taiwan Jones: Murray’s the lead back, Helu’s the third-down back, Jones is the change of pace and probably handle kick returns.   Fullbacks  Marcel Reece, Jamize Olawale: Reece also provides protection at tailback and Olawale is the true fullback and has special teams value.   Wide receivers  Amari Cooper, Michael Crabtree, Rod Streater, Andre Holmes, Brice Butler, Seth Roberts: Cooper and Crabtree are your starters. Who’s the No. 3? Still up in the air. Holmes is coming back from a broken hand and Butler and Roberts have looked good. Streater is still getting back up to speed. Any way it’s sliced, this group is solid and has great depth.   Tight ends  Lee Smith, Mychal Rivera, Clive Walford, Gabe Holmes: Didn’t expect the Raiders to keep four, which might not be a great sign about Walford’s health.   Offensive line  Donald Penn, Gabe Jackson, Rodney Hudson, J’Marcus Webb, Austin Howard, Khalif Barnes, Jon Feliciano, Matt McCants, Tony Bergstrom: Bergstrom may have been a surprise, but not so much when you consider he played the whole game Thursday at center. Feliciano can play there, but doesn’t look like the Raiders think he’s ready. McCants had an awful final preseason game, but had been pretty good before then.    Defensive line  Khalil Mack, Justin Tuck, Dan Williams, Justin Ellis, Denico Autry, Benson Mayowa, Mario Edwards Jr., Stacy McGee: The Raiders still list Mack at LB, but that’s not fooling anybody. A guy like Autry may not start, but he can be impactful. Mayowa is a good depth guy who is gaining experience playing SAM linebacker too. Edwards has a chance to develop into a good pass rusher.   Linebackers  Curtis Lofton, Ray-Ray Armstrong, Malcolm Smith, Lorenzo Alexander, Ben Heeney, Neiron Ball: Not a group to get wildly excited about. Could be another area to try to upgrade.   Cornerbacks  TJ Carrie, DJ Hayden, Keith McGill, Neiko Thorpe, Dexter McDonald, SaQuan Edward, Chimdi Chekwa: The fact that none of the other five CBs on the roster have provided a serious threat to supplant Hayden tells you what you need to know. Help is needed here.   Safeties  Charles Woodson, Nate Allen, Larry Asante: Anybody really think the Raiders go into the season with just three safeties?   Specialists  K Sebastian Janikowski, P Marquette King, LS Jon Condo: Solid group there. No return specialists, meaning for now it’s probably Taiwan Jones and TJ Carrie.", "source": "Inside the Oakland Raiders"}