{"published": "2015-09-08T15:08:29Z", "media-type": "Blog", "title": "Find Courage in your Indisbelief .", "id": "0bcdf6f9-6a15-46c5-9d7c-ade80bdc66e1", "content": "At times we need to take away our circumstances and forget it, to unlock our greatness, so that you can see the power of God manifesting in your live.\nJohn 11:38-44 , we learn about the story of Lazarus who Jesus raised from the dead .\nJesus, once more deeply moved,came to the tomb. It was a cave with a stone laid across the entrance. “Take away the stone,” he said. “But, Lord,” said Martha, the sister of the dead man, “by this time there is a bad odor, for he has been there four days.”\nThen Jesus said, “Did I not tell you that if you believe, you will see the glory of God?” So they took away the stone. Then Jesus looked up and said, “Father, I thank you that you have heard me. I knew that you always hear me, but I said this for the benefit of the people standing here, that they may believe that you sent me.”\n\nWhen he had said this, Jesus called in a loud voice, “Lazarus, come out!” The dead man came out, his hands and feet wrapped with strips of linen, and a cloth around his face. Jesus said to them, “Take off the grave clothes and let him go.”\n\nInterestingly , we learn about disbelief of Lazarus's sister Martha .\n\nJesus told her to remove a stone that from where Lazarus was \"sleeping\" , but she failed to see or acknowledged the presence of the son of the living God , who came to raise her brother from where he was sleeping.\n\nLet's learn more about the stones in our lives :\nSTONE - can represent our fear , can represent our sickness, trouble and our unbelief .\n\"If you believe, you would see the Glory of God in your life , working tremendously in every corner of your life\".\nSometimes we tend to measure things that God can perform or make us achieve.\nWe must know that God can perform any miracle , your situation can be turned to blessing, just believe in Him.\nThere are things, situation, circumstances that are preventing you from seeing the Glory of God in your life because of your attitude towards God, it's because of your unbelief and disbelief.\n\nThat which cannot be performed or done my a man , God can do it.\n\nThat particular situation, you feeling that God has deserted you, He can turn it, into greatness.\n\nRemember, if you believe you shall be saved , you shall see the greatness of God.\n\nTo cut the long story short. \nJohn 11: 25-26 , believe in God , your blessing , breakthrough and all that your heart desires, shall come to pass.\nJesus said to her, “I am the resurrection and the life. The one who believes in me will live, even though they die; and whoever lives by believing in me will never die. Do you believe this?”.\n\nNow it's all in your hands.\n\nI choose peace to feel my heart and put the rest to God the father.", "source": "Mpho Mathoho"}