{"published": "2015-09-14T13:45:15Z", "media-type": "Blog", "title": "Pac-12 Notes", "id": "0398008e-a58b-4c48-8ff8-499c3dc58c1d", "content": "– \n Pac-12 Notes  \n—– \n \n  \n \nSeptember 14th \n \n… Foe Pause …  \n \nNo DirecTV deal with Pac-12 this season \n \nFrom Jon Wilner and the San Jose Mercury News … The Pac-12 Networks won’t be on DirecTV anytime soon. \n \nThe conference has rejected a proposal by DirecTV’s parent company, AT&T, that would have allowed carriage on the satellite provider but come at an enormous cost to the conference, a source said Saturday. \n \nThe league’s presidents and chancellors determined that AT&T’s requests would have compromised the networks’ business model and long-term profitability without granting enough in return. \n \nThe networks are wholly owned by the league, in contrast to counterparts at the Big Ten (co-owned by FOX) and SEC (co-owned by ESPN). \n \nThe proposal by AT&T, which took control of DirecTV this summer,  likely would have forced the Pac-12 Networks to redo their existing distribution deals (with Comcast, DISH, etc.) at a lower subscription rate, jeopardizing future profits. \n \n… Continue reading story here … \n \n— \n \n  \n \nColorado remains at No. 11 in ESPN Power Rankings …  \n \nFrom ESPN … The bottom three (CU jumped over Oregon State, which lost to Michigan, but was jumped by Washington State, which defeated Rutgers) … \n \n10. Washington State Cougars : Oh Cougs … what to make of you. You lose at home to an FCS team. Then you go on the road and beat a Big Ten team. Football totally makes sense. Glad you took last week’s advice. \n \n  \n \n11. Colorado Buffaloes : The Buffs snapped a nine-game losing streak and did so with one of their best rushing outputs in almost a decade. I think we got a glance of what this team could be. Question is, can it do it consistently against stiffer competition? \n \n12. Oregon State Beavers : They looked great on their opening drive … and then it all went to Hades. That was a tough encore for a team trying to rebuild its identity under a new coach. Best to learn from mistakes (and some would include the coaches in that conversation ) and move on. The San Jose State game is more than winnable with Stanford and conference play on the horizon. \n \n—– \n \n  \n \nSeptember 13th \n \n… Foe Pause …  \n \nOhio State loses two No. 1 votes to Michigan State in latest poll … Oregon out of the top ten; UCLA in \n \nFrom ESPN … Three Southeastern Conference teams fell out of the Associated Press Top 25 on Sunday, and the Auburn Tigers dropped 12 spots after the league that set a record for most teams in the college football rankings last week had a rough weekend. \n \nArkansas, Tennessee and Mississippi State all fell out after losses Saturday. The Tigers needed overtime to beat Jacksonville State of the FCS; they slipped from No. 6 to No. 18. \n \nAuburn will get a chance at redemption next week as the Tigers visit No. 13 LSU. \n \nThe SEC was down to seven ranked teams, still the most of any conference. The Pac-12 was next with five. \n \nOhio State remains No. 1, but the Buckeyes are no longer unanimous. No. 4 Michigan State receives two first-place votes after beating Oregon  31-28 . Alabama remains No. 2. TCU is 3. \n \n… The Pac-12 … Five Pac-12 teams are ranked in the Associated Press Top 25 poll for the second consecutive week, with USC moving up to No. 6, UCLA claiming the No. 10 spot, Oregon falling to 12th, Arizona jumping to 20th and Utah to 21st. \n \nHere’s the AP Top 25 in full: \n  Ohio State (59 first-place votes)  Alabama  TCU  Michigan State (2)  Baylor  USC  Georgia  Notre Dame  Florida State  UCLA  Clemson  Oregon  LSU  Georgia Tech  Ole Miss  Oklahoma  Texas A&M  Auburn  BYU  Arizona  Utah  Missouri  Northwestern  Wisconsin  Oklahoma State   \nOthers receiving votes: Temple 38, West Virginia 37, Mississippi State 32, Tennessee 30, Toledo 29, Kansas State 26, Arizona State 20 , Boise State 16, Houston 16, NC State 14, Florida 12, Minnesota 9, Arkansas 6, California 5 , Iowa 5, Miami (FL) 3, Stanford 3 , Western Kentucky 2, Virginia Tech 2, Duke 1 \n \n—– \n \n  \n \nSeptember 12th \n \n. .. Foe Pause … \n \nOregonian: Missed pass in the final minute “changes course of Oregon’s season” \n \nFrom the Oregonian …  It wasn’t the play that lost the game that rolled through Vernon Adams Jr.’s head like a skipping record, spitting phrases like, “I got to be better,” from his mouth on repeat in the postgame. \n \nIt was two plays before he threw an incomplete pass to Bralon Addison on fourth-and-long that sealed up Michigan State’s 31-28 victory Saturday night at Spartan Stadium. \n \nIt was the play that should have won it for the Ducks that will stick with Adams long after the biggest game of his college football career. \n \n“Definitely that one to Byron when he was wide-open,” Adams said. “You know, I can’t stop thinking about that. He was wide-open and you got to make that throw and the game is different.” \n \nThe fifth-year senior, in his first month with the Ducks, wasn’t underselling it. The Ducks were down by three in the final minutes of the game and charging up field. The defense, the gassed and battered defense, made the stand it needed to make and the Ducks were facing second-and-six with a host of options and a bag of timeouts. \n \n… Continue reading story here … \n \n— \n \n  \n \nOregon State starts fast, but then is dominated by Michigan in 35-7 loss \n \nFrom ESPN … Michigan (1-1) looked much better as a team than it did in last week’s loss at Utah. \n \nThe Wolverines also got some breaks in the pivotal second quarter against the Beavers (1-1). \n \nSmith gave the Wolverines a running game they lacked in the opener, but like his coach, he wouldn’t take credit. \n \n“Want to give a shout out to my offensive line,” Smith said. “They opened some holes you could drive a bus through.” \n \nDefensively, Michigan put pressure on Oregon State’s quarterbacks and didn’t give up a lot on the ground — much to the delight of nearly 110,000 fans who filled the Big House with hopes the sagging program’s new leader will make a difference. \n \nHarbaugh was quietly pacing the sideline for much of the first quarter and early in the second, rarely saying anything to players, coaches or officials. \n \nThat changed when he saw a penalty he didn’t like. The game changed, too. \n \nMichigan’s Jeremy Clark was called for roughing the kicker, setting off Harbaugh. \n \nThe former San Francisco 49ers coach shouted at officials, flailed his arms and threw laminated sheets behind him because he thought Nick Porebski lost his protection as a punter after bobbling the ball and zig-zagging before kicking the ball. \n \nA little later, Oregon State coach Gary Andersen made a curious decision by choosing to punt instead of going for it on a fourth-and-3 from the Michigan 39 while trailing 10-7. \n \n“Never thought to not punt quite frankly,” Andersen said. \n \nThen, the long snap from midfield sailed over Porebski’s head and bounced back to the Beavers 3. \n \n“That happens once in a half-century,” Harbaugh said. “That was a heck of a good break for us, but we’ll take it.” \n \nSmith scored his second TD with 12 seconds left in the first half to put Michigan up 17-7 and the Beavers never got back in the game. \n \n— \n \n  \n \nWashington State bounces back with a 37-34 win over Rutgers with touchdown in final minute \n \nFrom ESPN …   Luke Falk led a 10-play, 90-yard touchdown drive, finding River Cracraft with an eight-yard strike with :13 left to lift Washington State past Rutgers, 37-34 Saturday. \n \nFalk threw for 468 yards and four touchdowns. \n \nWhile Janarion Grant tried to be the hero for Rutgers, returning two kicks for touchdowns, he couldn’t return the final kickoff for a touchdown. The ball was kicked to Leonte Carroo and Rutgers tried to do their Stanford vs. California impression, before the ball was thrown forward after several laterals. \n \nGrant had the best game of his collegiate career, returning a kickoff and a punt for late touchdowns. With Rutgers trailing 30-27 with 1:45 left, Grant returned a punt 55-yards for a touchdown to give Rutgers the 34-30 lead. The playmaker returned a kickoff 100 yards to give Rutgers its first lead of the game, 27-23 and finished a school record 339 total yards. \n \nWashington State answered Grant’s 100-yard return with an eight play, 82-yard drive in 2:59. Falk hit Gabe Marks, who made a dazzling 23-yard touchdown catch. \n \nOn its next two drives Rutgers negated two touchdowns with penalties. Rutgers running back Josh Hicks fumbled on the ensuing drive after catching a screen pass and Isaac Dotson recovered for the Cougars. That came one play after a 21-yard touchdown was negated on a holding penalty on Chris Muller. \n \nThe Scarlet Knights defense stopped Washington State on fourth down with 6:10 left, but Justin Goodwin’s offensive pass interference penalty negated a 29-yard touchdown catch by Grant. \n \nThe high-scoring second half came after just one touchdown in the first. \n \n— \n \n  \n \nPac-12 proposes athletes profiting off of their own names (in non-athletic ventures) \n \nFrom CBS Sports … The Pac-12 has submitted a proposal that would allow college athletes to use their names, images and likenesses to “promote their own non-athletic business ventures,” the conference said in a news release Friday. \n \nIn light of the pending Ed O’Bannon lawsuit, the Pac-12 idea appears to represent an incremental step by college sports leaders to adopt bylaws allowing players to make money off their name, but with a qualifier. Pac-12 deputy commissioner Jamie Zaninovich said athletes would be able to promote themselves without identifying themselves as an athlete. \n \nUnder current NCAA rules, athletes are prohibited from accepting any money for or permitting the use of their name or picture to advertise or promote directly the sale of a commercial product or service. The eligibility of athletes is not affected if they participated in the promotional activity prior to enrollment and meet certain conditions. \n \nThe Pac-12 submitted the NILs idea to the NCAA last week as part of the Power Five’s proposals for consideration at the NCAA convention in January. The conferences have until Nov. 15 to amend or finalize their concepts for proposals. NCAA autonomy allows the 65 schools from the ACC, Big Ten, Big 12, Pac-12 and SEC, plus Notre Dame, to create their own legislation that the rest of Division I can elect to follow. \n \n  \n \n—– \n \n  \n \nSeptember 11th \n \n… Foe Pause … \n \nExperts split on outcome of Oregon/Michigan State \n \nThere is no lack of attention being paid to the game between No. 7 Oregon and No. 5 Michigan State (6:00 p.m., Saturday, ABC): \n \n“Numbers show importance of rushing game for Oregon, Michigan State” … From ESPN \n \n“Oregon will have to have ducks in a row to beat Michigan State on road” … From ESPN \n \n“Pick Six: Michigan State to get best of Oregon in rematch” … From CBS Sports \n \n“College football picks Week 2: Experts favor Michigan State in Oregon rematch” … From The Sporting News \n \n“Michigan State looks to improve on poor Week 1 play-action numbers: Oregon Ducks quick hits” … From the Oregonian \n \n  \n \n—– \n \n  \n \nSeptember 10th \n \n… Foe Pause … \n \nESPN: CU one of five Pac-12 teams which need to “bounce back” in Week Two \n \nFrom ESPN … Week 1 was not what many people thought it would be for the Conference of Champions. But Week 1 is just that — Week 1 — with plenty of time brush a shaky 7-5 performance under the rug and move on to the next one. \n \nFive teams — Arizona State, Colorado, Stanford, Washington and Washington State — are looking to do just that. Here’s what they have coming up. \n \n… \n \nCOLORADO \n  Next opportunity : vs. UMass  What went wrong in Week 1: There are the turnovers, the two missed red zone opportunities, the special teams breakdowns … and, of course, the clock management at the end of the game — which, yes, some of the blame does go to the officials.  What needs to happen in Week 2 : Believe it or not, I still think Colorado is a decent football team — when the Buffaloes are consistent. Eliminating mistakes is easier said than done. We get that. But when everything is clicking, this team still has potential.  Coach speak, Mike MacIntyre : “They saw the bone-headed mistakes. Hopefully they understand the mistakes that we made that cost us the football game. It wasn’t anything Hawaii did. It was what we did. If they can understand that and get things done, we’ll keep playing good.”   \n—– \n \n  \n \nSeptember 8th \n \n… Foe Pause …  \n \nSEC has ten teams ranked in the top 25 (first time that’s ever happened) \n \nStanford and Arizona State dropped out of the poll this week from the Pac-12, but Utah jumped in. \n \nThe AP poll for Week Two \n     1         -     Ohio State Buckeyes (61) \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/07 defeated Virginia Tech 42-24 \n09/12 Hawaii 3:30 PM EDT    1525     2         (1)     Alabama Crimson Tide \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/05 defeated Wisconsin 35-17 \n09/12 Middle Tennessee 4:00 PM EDT    1420     3         (-1)     TCU Horned Frogs \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/03 defeated Minnesota 23-17 \n09/12 Stephen F. Austin 3:30 PM EDT    1365     4         -     Baylor Bears \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/04 defeated Southern Methodist 56-21 \n09/12 Lamar 7:30 PM EDT    1252     5         -     Michigan State Spartans \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/04 defeated Western Michigan 37-24 \n09/12 Oregon 8:00 PM EDT    1198     6         -     Auburn Tigers \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/05 defeated Louisville 31-24 \n09/12 Jacksonville State 12:00 PM EDT    1166     7         -     Oregon Ducks \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/05 defeated Eastern Washington 61-42 \n09/12 at Michigan State 8:00 PM EDT    1081     8         -     Southern California Trojans \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/05 defeated Arkansas State 55-6 \n09/12 Idaho 8:00 PM EDT    1074     9         (2)     Notre Dame Fighting Irish \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/05 defeated Texas 38-3 \n09/12 at Virginia 3:30 PM EDT    1061     10         (-1)     Georgia Bulldogs \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/05 defeated Louisiana-Monroe 51-14 \n09/12 at Vanderbilt 3:30 PM EDT    981     11         (-1)     Florida State Seminoles \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/05 defeated Texas State 59-16 \n09/12 South Florida 11:30 AM EDT    942     12         -     Clemson Tigers \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/05 defeated Wofford 49-10 \n09/12 Appalachian State 12:30 PM EDT    862     13         -     UCLA Bruins \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/05 defeated Virginia 34-16 \n09/12 at UNLV 10:30 PM EDT    833     14         -     LSU Tigers \n Overall: (0-0) \n Statistics | Schedule | Roster \n09/05 McNeese State Cancelled    653     15         (1)     Georgia Tech Yellow Jackets \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/03 defeated Alcorn State 69-6 \n09/12 Tulane 3:30 PM EDT    636     16         (11)     Texas A&M Aggies \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/05 defeated Arizona State 38-17 \n09/12 Ball State 7:00 PM EDT    629     17         -     Ole Miss Rebels \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/05 defeated UT Martin 76-3 \n09/12 Fresno State 3:30 PM EDT    600     18         -     Arkansas Razorbacks \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/05 defeated Texas-El Paso 48-13 \n09/12 Toledo 4:00 PM EDT    480     19         -     Oklahoma Sooners \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/05 defeated Akron 41-3 \n09/12 at Tennessee 6:00 PM EDT    469     20         (3)     Boise State Broncos \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/04 defeated Washington 16-13 \n09/12 at Brigham Young 10:15 PM EDT    279     21         (3)     Missouri Tigers \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/05 defeated Southeast Missouri State 34-3 \n09/12 at Arkansas State 7:00 PM EDT    274     22         -     Arizona Wildcats \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/03 defeated Texas-San Antonio 42-32 \n09/12 at Nevada 7:00 PM EDT    259     23         (2)     Tennessee Volunteers \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/05 defeated Bowling Green 59-30 \n09/12 Oklahoma 6:00 PM EDT    169     24         (6)     Utah Utes \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/03 defeated Michigan 24-17 \n09/11 Utah State 9:00 PM EDT    137     25         (1)     Mississippi State Bulldogs \n Overall: (1-0) \n Statistics | Schedule | Roster \n09/05 defeated Southern Mississippi 34-16 \n09/12 LSU 9:15 PM EDT    104    Others Receiving Votes: Wisconsin (0-1) 79; Brigham Young (1-0) 74; Northwestern (1-0) 72; Arizona State (0-1) 49; Oklahoma State (1-0) 30; West Virginia (1-0) 23; Temple (1-0) 8; Florida (1-0) 8; Kansas State (1-0) 7; Cincinnati (1-0) 7; Minnesota (0-1) 5; NC State (1-0) 4; Louisville (0-1) 4; Western Kentucky (1-0) 3; California (1-0) 2; Stanford (0-1) 1     \n— \n \n  \n \nESPN Pac-12 Power Rankings … Colorado No. 11 \n \nFrom ESPN … We now have tangible data to work with. It’s not great. But we have a better picture than we did when we came out with the preseason power rankings. As always, if you don’t like where you’re ranked, play better. \n \nThe Bottom Two (just behind No. 10 Stanford) … \n \n11. Colorado Buffaloes: Once again, we were willing to give the Buffs the benefit of the doubt heading into Week 1. Once again, the Buffs disappointed. Say what you want about how that game ended. Colorado should never have been in that spot to begin with. I do think Colorado is better than the product in Hawaii. But the benefit of the doubt is quickly slipping away. \n \n12. Washington State Cougars: Want people to stop saying “They Coug’ed it”? Then stop Coug’ing it.\\ \n \n— \n \n  \n \nArizona linebacker Scooby Wright out “three-to-four weeks” … (Game against CU October 17th) \n \nFrom CBS Sports … Arizona star linebacker Scooby Wright III might only miss “three to four weeks” after undergoing minor knee surgery to repair damage from an injury suffered in the Wildcats’ season opener against UTSA on Thursday. \n \nWright underwent a procedure to repair a lateral meniscus tear in his left knee over the weekend, and on Monday Rich Rodriguez delivered the official timetable for his return. \n \nWright will still travel with the team, according to Rodriguez, while he recovers. If the timetable works out in Arizona’s favor, Wright could be back on the field for Arizona’s Pac-12 opener against UCLA. Given what we saw from the Bruins, Arizona may need its most aggressive defensive performance to disrupt Josh Rosen’s rhythm under center. \n \nStill, the most important news is that this is expected to be a minor injury that will allow Wright to return to the field this season. Wright has only been playing college football for two years and has already assumed the role of one of the sport’s most exciting playmakers. Last season, he ranked in the top five nationally in tackles, sacks and forced fumbles … and perhaps No. 1 nationally in terrorizing opposing offensive coordinators. \n \n  \n \n—– \n \n  \n \nSeptember 7th \n \n… Foe Pause … \n \nCoug Center – Loss to Portland State “it’s incredibly hard to watch, think about or root for this team” \n \nA good essay from Brian Floyd for Coug Center. It really speaks to fans of teams like Washington State (and Colorado), who continue to believe, and yet are not being rewarded for their continuing devotion. \n \nThe full essay (which I recommend) can be found here . Some excerpts: \n \n… Which brings us to Saturday’s season opener. The first game of the season is supposed to be fun, a celebration of college football’s return. Everyone is a blank slate, filled with hope stemming from unknowns. We default to the positive side of those unknowns, no matter how bad the previous season was. Saturday’s game against Portland State was supposed to be easing into the schedule, a tuneup before a road test against Rutgers. College football was coming back, and it was an exciting time. \n \nI was excited about Washington State football this year. It seemed possible that last year was a tad bit of regression after going to a bowl game well ahead of schedule the year before. There was talent, on paper, and a better understanding of the system. The defense was new and fresh, and hey maybe a change at the top of the org chart was needed on that side of the ball. \n \n… There was no reason for the Cougars to get completely gashed on defense. The new look on that side of the ball appears to be “dumpster fire that takes half an hour to get roaring.” The offense still isn’t clicking, and receivers as experienced as Washington State’s shouldn’t be letting so many balls hit the turf (and don’t use weather as an excuse). \n \n… This, however, is about as low as it gets, for me. Losing to an FCS team on opening weekend in a season we were hoping would be a bounce back is a punch in the gut right off the bat. Maybe it gets better and this was a hiccup. But right now, it’s incredibly hard to watch, think about or root for this team. And it’s nearly impossible to believe Leach has this team on the right track. \n \nWelcome back to college football. \n \n— \n \n  \n \nUCLA loses star defensive lineman to a torn ACL \n \nFrom Fox Sports …  Eddie Vanderdoes standout on the UCLA D-line, suffered a torn ACL in the Bruins’ win over Virginia on Saturday, a source told FOX Sports Sunday. Vanderdoes will miss the rest of the 2015 season. \n \nUCLA spokesman Josh Rupprecht confirmed the injury to The Associated Press later Sunday night. \n \nThe 6-foot-4, 305-pound junior had a team-high eight tackles in the Bruins’ 34-16 win vs. the Cavaliers. Vanderdoes, who has played in every one of UCLA’s 27 games since arriving on campus, was an honorable-mention All-Pac-12 Conference selection last season. \n \nThe Bruins still have All-American candidate Kenny Clark to anchor the D-line, but now 305-pound junior Eli Ankou and 275-pound sophomore Matt Dickerson need to step up in Vanderdoes’ absence. \n \n— \n \n  \n \nWashington State, Colorado and USC in USA Today “Misery Index”  \n \nFrom USA Today … (Disclaimer: This isn’t a ranking of worst teams, worst losses or coaches whose jobs are in the most jeopardy. This is simply a measurement of a fan base’s knee-jerk reaction to what they last saw. The way in which a team won or lost, expectations vis-à-vis program trajectory and traditional inferiority complex of fan base all factor into this ranking.) \n \n6. Washington State : Despite his feel-good second season in which he beat Southern California and took the Cougars to a bowl game, Mike Leach’s record at Washington State is 12-26 after Saturday’s loss to FCS member Portland State. \n \nBut here’s the really scary thing for Washington State fans: If he can’t fix it, who can? Bottom line: The Cougars don’t have any real excuse for losing to an FCS team in Leach’s fourth season. \n \nIt’s not their facilities, which are marvelous. It’s not their head coach, who is accomplished. It’s not their schedule, which has been manageable. And given the way Leach talked about his team in the preseason, it shouldn’t be the talent level. But something is missing, and the Misery Index grants Washington State fans free reign to freak out over the state of this program now that 2015 is already on track to be a disappointment. \n \n7. Colorado : The non-conference trip to Hawaii is among the most alluring setups for a major football program. The idea is to go get a relatively easy win, be able to play a 13th game (an obscure NCAA rule) and enjoy a couple days of paradise with your players, fans and administration. \n \nOf course, that requires you actually winning the game, which Colorado was unable to accomplish in a 28-20 loss. Forget the specifics of what happened at the end — and yes, Colorado fans will forever complain about how quickly the ball was spotted by the officiating crew and the inability to get off one final play that might have given the Buffaloes a chance to tie the game. \n \nBut if you take a step back, Colorado probably should be better than a life-or-death struggle at Hawaii if the program is progressing as quickly as Mike MacIntyre hoped. It’s not, and that’s a problem as the Buffaloes face one of the most difficult Pac-12 schedules in league history, facing Oregon and Stanford in crossover games as well as the loaded South division. Colorado’s bowl-less streak of seven seasons appears likely to become eight. \n \n8. Southern California : Few were as critical of head coach Steve Sarkisian’s drunken appearance at the program’s “Salute to Troy” preseason event as USC fans themselves, which is a refreshing departure from the typical mindless fandom the Misery Index sees on a daily basis. But the truth is USC fans know more than anyone that Sarkisian, whether he actually has a drinking problem, most certainly has a propensity to act like a 21-year-old frat boy problem. \n \nAnd that feeds into the narrative that Sarkisian’s teams will chronically underachieve because they lack the focus, discipline and seriousness to make it through a taxing 12-game schedule without a couple of unnecessary hiccups. So while the Trojans did what was expected in waxing Arkansas State 55-6, it’s a victory that does little to calm the nerves about what’s in store this season. And it certainly doesn’t help that USC fans now realize what they’ll have to deal with in UCLA freshman quarterback Josh Rosen for the next three years. \n \n—– \n \n  \n \nSeptember 5th \n \n… Foe Pause …  \n \nArizona linebacker Scooby Wright may be back … in time to play Colorado October 17th \n \nFrom ESPN … Arizona Wildcats linebacker Scooby Wright had his left knee scoped to repair a lateral meniscus tear, a source confirmed to ESPN’s Brett McMurphy. \n \nThe Wildcats hope to “have him back in a month,” the source said. \n \nWright injured the knee in the first quarter of Thursday night’s 42-32 win over Texas San Antonio. \n \nHe hobbled off the field midway through the first quarter. Television cameras later caught trainers icing Wright’s knee on the sideline, where he later walked with a limp and a cane. \n \nArizona coach Rich Rodriguez is expected to give an update on Wright on Monday, a school spokesman said. The Wildcats visit Nevada on Sept. 12. \n \nOther games Wright is likely to miss include home dates with Northern Arizona on Sept. 19 and No. 13 UCLA on Sept. 26. \n \n… Arizona plays at Colorado on October 17th … \n \n— \n \n  \n \nWashington State falls to Portland State, 24-17 \n \nWhile no Pac-12 coach was considered to be on the hot seat heading into the 2015 season, the seat just got a little warmer for Mike Leach at Washington State. In his first three seasons, Leach posted a 12-25 record, failing to generate the success he had at Texas Tech. \n \nMake that 12-26. \n \nPortland State from the Big Sky Conference, which had an 0-14 all-time record against FBS schools, defeated the Cougars, 24-17. Washington State had a 10-0 lead at halftime, but the Vikings scored 17 straight points to take the lead early in the fourth quarter. After the Cougars mounted a drive to tie the game, Portland State put together a 14-play, 69-yard touchdown drive to take a 24-17 lead. With less than a minute to play, the Vikings picked off a tipped ball, giving Washington State its first-ever loss to an FCS team \n \n— \n \n  \n \nNo. 21 Stanford the first ranked team of the falls to Northwestern \n \nFrom ESPN …  Northwestern wanted to prove a point against No. 21 Stanford, and the Wildcats drove it home with a strong running game and solid defense that produced a season-opening surprise. \n \nFreshman Clayton Thorson ran for a 42-yard touchdown while playing turnover-free ball at quarterback, Justin Jackson added 134 yards rushing, and the Wildcats beat the Cardinal 16-6 on Saturday afternoon. \n \nAnthony Walker broke up two passes and had a fumble recovery, and Kyle Queiro intercepted Kevin Hogan in the end zone with about a minute left to seal the win. \n \nThorson scored the game’s only touchdown in the second quarter. He also threw for 105 yards, completing 12 of 24 passes. \n \nJackson rushed 28 times. Jack Mitchell kicked three field goals, including a career-long 49-yarder that made it 16-6 with 3:38 left in the game, and the Wildcats started the season on a winning note for the first time against a ranked team since 1995. \n \nIt was just what they needed after back-to-back 5-7 finishes, a run that followed five straight bowl appearances. \n \nStanford, coming off an 8-5 season that snapped a string of four consecutive BCS bowls, clearly has some work to do. \n \nHogan had a rough afternoon, going 20-of-35 with 155 yards and an interception. He was sacked three times. \n \nChristian McCaffrey ran for 66 yards, but the Cardinal managed just 240 yards on offense and scored their fewest points since 2007. \n \n—– \n \n  \n \nSeptember 4th \n \n… Foe Pause … \n \nChris Petersen falls to former school in Washington’s loss to Boise State … “I feel physically sick” \n \nFrom the Seattle Times … So successful at keeping the identity of their starting quarterback a secret all week, the Washington offense was only suspect in the first half of their season opener Friday night. \n \nSo to see that offense suddenly find itself driving in the final minute of a dramatic comeback bid, with a chance to tie No. 23 Boise State, well, it was at least a little encouraging. \n \nRight? No, Jake Browning didn’t want to hear it. \n \n“I feel physically sick right now,” he said moments after the Huskies’ 16-13 defeat in Chris Petersen’s return to Boise. \n \n“I mean, it’s hard to answer a question about encouragement when you just lost,” Browning added. “Yeah, there encouraging things there, but at the end of the day you lost. … We only lost by three to a good team, but we want to win. There’s no pity points.” \n \nThe Huskies, down 16-0 at halftime, got back in the game thanks key special-teams performances from Dante Pettis (76-yard punt return for a touchdown), Jaydon Mickens (blocked punt) and Cameron Van Winkle (two made field goals). \n \nWashington’s comeback bid ended, however, when the offense stalled at the 29-yard line and Van Winkle missed a 46-yard field-goal attempt wide right with 21 seconds left. \n \n… Continue reading story here … \n \n— \n \n  \n \nReport: Injury to Scooby Wright will not be season-ending \n \nFrom ESPN … Arizona linebacker Scooby Wright’s left knee injury is not season-ending, sources told ESPN’s Brett McMurphy. \n \nWright, who injured the knee in the first quarter of Thursday night’s 42-32 win over Texas San Antonio, underwent an MRI after the game. Results indicate Wright’s injury will not cause him to miss the rest of the season, sources said. \n \nWright hobbled off the field midway through the first quarter. Television cameras later caught trainers icing Wright’s knee on the sideline, where he later walked with a limp and a cane. \n \nArizona coach Rich Rodriguez is expected to give an update on Wright on Monday, a school spokesman said. The Wildcats visit Nevada on Sept. 12. \n \nWright led the nation in tackles, tackles for loss and forced fumbles last season. \n \n—– \n \n  \n \nSeptember 3rd \n \n… Foe Pause  … \n \nUtah spoils the debut of Michigan head coach Jim Harbaugh \n \nFrom ESPN … Jim Harbaugh was swarmed by cameramen from the moment he stepped off the bus at Rice-Eccles Stadium. College football’s newest rock star had finally arrived to play a game after eight months of hype. \n \nAnd Utah was sick of hearing about it. \n \nThe Utes felt disrespected despite being favored and spoiled Harbaugh’s Michigan coaching debut with a smothering defense, beating the Wolverines 24-17 on Thursday night in the opener for both teams. \n \n“We beat Michigan for the third time in a row,” Utah coach Kyle Whittingham said. “That’s a heck of an accolade for our program.” \n \nHarbaugh came as advertised — blue long-sleeved shirt, blue cap with the block “M,” khakis and lanyard with whistle attached. \n \nUnfortunately for Michigan fans, the team didn’t look drastically different from the 2014 version. The quarterback struggled, and the run game was nonexistent. That spelled trouble for the offense. \n \n“I thought we were playing a little bit tentative in the first half and not coming off the ball like we need to,” Harbaugh said. “We did miss some holes, backs missed some holes. All things to grow and improve on, and I thought we did that as the game went on.” \n \nHarbaugh, the former Michigan quarterback who returned to his alma mater eight months ago after leaving the NFL’s San Francisco 49ers, faced many of the same issues that plagued former coach Brady Hoke. \n \nQuarterback Jake Rudock beat out Shane Morris for the start. An Iowa transfer, Rudock had a reputation for limiting turnovers but promptly threw three interceptions against Utah and finished 27-for-43 for 279 yards and two touchdowns. Michigan was held to 355 yards, gaining only 76 on the ground. Eighty of those yards came on Michigan’s final drive of the game. \n \n— \n \nNo. 22 Arizona gets by UTSA in opener, but may have lost star linebacker Scooby Wright \n \nFrom ESPN … Arizona struggled defensively, was uneven on offense and had trouble putting away a smaller-conference team at home. \n \nThat wasn’t even close to the worst news of the night. Losing All-American linebacker Scooby Wright to a knee injury early in the game trumped it all. \n \nAnu Solomon threw four touchdown passes to help No. 22 Arizona beat UTSA 42-32 Thursday night, but the Wildcats suffered a big blow when Wright went out with a left knee injury. \n \nWright, who swept the major defensive player of the year awards last season, went out in the first quarter, tried to return and went back out after one play. He spent the second half in street clothes, walking with a cane, and was scheduled to have an MRI Thursday night. \n \n“I don’t think it’s bad — MCL, ACL, whatever — but I don’t want to speculate,” Arizona coach Rich Rodriguez said. “We’ll see what happens.” \n \nEven before Wright went down, Arizona’s defense struggled. The Wildcats scored two defensive touchdowns, but gave up 525 total yards to UTSA, which returned two offensive starters. \n \nThe offense was good at times, sputtered others, finished with a pedestrian-for-them 392 total yards. Solomon had with 229 yards on 22-of-26 passing, and Nick Wilson added 97 yards rushing. \n \n— \n \n  \n \nUniversity of Washington sells naming rights for Husky Stadium to Alaska Airlines for $41 million \n \nFrom seattlepi.com … The University of Washington announced a proposal to sell naming rights at Husky Stadium to Seattle-based Alaska Airlines. \n \nThe agreement, which is still subject to approval to UW’s Board of Regents, would make the official name of the Huskies’ football home “Alaska Airlines Field at Husky Stadium.” \n \nThe airline will pay $41 million for the naming rights for the field, as well as the adjoining “University of Washington Athletic Village presented by Alaska Airlines.” They will also continue their naming rights for Alaska Airlines Arena at Hec Edmundson Pavilion, as well as serve as the official airline of all three UW campuses for the next decade. \n \n“I am thrilled that we can expand on a local connection and enhance a long-standing relationship with a Seattle company who shares our values so deeply,” UW Director of Athletics Scott Woodward said in a statement. “As the costs of funding a first-class student-athlete experience continue to rise, it is critical that we seek new and creative funding opportunities with partners who share our values, and I am pleased because that is exactly what we have done with Alaska Airlines. \n \n“This exciting new agreement will work directly to fund our student-athlete experience and allow us to stay in front of the rising costs of funding student-athlete recruitment, scholarship, travel and competition.” \n \n— \n \n  \n \nColorado to face ten USA Today preseason All-Americans; Nelson Spruce 2nd-team \n \nThe USA Today has published its preseason All-American teams. The full list can be found here . \n \nPac-12 honorees (along with one other Buff opponent in 2015) \n \nFirst Team: \n \n– WR: Rashard Higgins, Colorado State \n \n– OL: Joshua Garrett, Stanford \n \n– LB: Scooby Wright, Arizona \n \n– LB: Su’a Cravens, Southern California \n \nSecond Team: \n \n– RB: Devontae Booker, Utah \n \n- WR: Nelson Spruce, Colorado \n \n– OL: Isaac Seumalo, Oregon State \n \n– DL: DeForest Buckner, Oregon \n \n– LB: Myles Jack, UCLA \n \n– CB: Adoree’ Jackson, Southern California \n \n– P: Tom Hackett, Utah \n \n—– \n \n  \n \nSeptember 2nd \n \n… Foe Pause …  \n \nJon Wilner … Buffs will not only beat the Rainbow Warriors, but will cover the 7.5-point spread \n \nJon Wilner at the San Jose Mercury News has published his Pac-12 picks for the week, both picking the winners and whether the Pac-12 team will cover the spread for the game. \n \nFor straight up winners, Wilner has the Pac-12 going 10-2, with only Arizona State (Texas A&amp;M) and Washington (Boise State) losing. \n \nThe full article can be found here . \n \nAs to the Buffs: \n \nCOLORADO (minus-7.5) at HAWAII (Friday): Rare deviation from policy of using the opening line, but this swing is too severe to ignore: Colorado opened as a 2.5-point underdog and is now favored by more than a touchdown. And for good reason. Count on a jump in performance from the Buff now that Mike MacIntyre’s recruits occupy more of the 2-deep. Pick: Colorado \n \n— \n \n  \n \nESPN’s Ten Bold Predictions include a CU upset of “someone they shouldn’t” \n \nESPN has published its “ Ten bold Pac-12 predictions for 2015 “, which can be found here . \n \nAs to Colorado: \n \n9. Colorado will upset someone: The Buffs might not quite be at bowl-berth level yet. But they are good enough to put a scare into a few teams. And at least once this season, they are going to knock off someone that folks like us say they shouldn’t. I don’t know who. It could be a team from the South or North. But you need only to look at how close Colorado was last year to breaking through. This year, one of those close games will go the Buffs way. – Kevin Gemmell \n \n— \n \n  \n \nOregon State and former head coach Mike Riley sued for “failing to correct a hostile and sexually violent culture” \n \nFrom the Oregonian … A former student at Oregon State University has filed a federal Title IX lawsuit that accuses the school’s former head football coach Mike Riley of failing to correct a hostile and sexually violent culture among football players that contributed to her being raped. \n \nThe woman alleges that she was raped on Oct. 9, 1999, while a freshman at OSU. The Oregonian/OregonLive is not naming her because she claims to be the victim of sexual assault. \n \nSteve Clark, OSU’s vice president of university relations, said Tuesday that the school generally refuted claims made by the woman in her lawsuit. \n \n“We’re not responsible for her very unfortunate sexual assault,” he said. \n \n… Continue reading story here  … \n \n… And here is a statement released by Mike Riley, now the coach at Nebraska … “Yesterday, I was made aware of a complaint filed in the State of Oregon concerning a previously unknown incident to me in October 1999.  I cannot comment on any matter in the legal process.  However, I am committed to a harassment-free culture in our football program and I am continually seeking ways to expand our student education program.  Sexual assault is a horrendous crime and has no place in our society.” \n \n—– \n \n  \n \nSeptember 1st \n \n… Foe Pause …  \n \nUSC athletic director Pat Haden: In the “best interests of the university” not to suspend Sarkisian from coaching \n \nFrom ESPN … Speaking publicly for the first time since Steve Sarkisian’s erratic display at a recent school event, USC Athletic Director Pat Haden said Monday that his decision regarding the Trojans coach was “in the best interest” of the university and its players. \n \nHaden condemned Sarkisian’s behavior in a statement but ultimately decided not to suspend him. Sarkisian will coach USC in its season opener Saturday against Arkansas State. \n \nDuring an appearance on the “Trojans Live” radio show on ESPN Los Angeles 710, Haden said he had “thoughtful conversations” with medical professionals and staff members and that “a lot of careful thought was given” before deciding on a course of action for Sarkisian following the now-infamous incident at the school’s annual “Salute to Troy” event on Aug. 22. \n \n…  “I understand a lot of people are going to disagree with my decision — it happens all the time,” Haden told the station. “I believe the course of action we chose was really in the best interest of USC and Steve Sarkisian and maybe just as important, or more importantly, our players.” \n \nHaden said he was not involved in Sarkisian’s decision to relinquish play-calling duties to offensive coordinator Clay Helton . \n \n“Those aren’t my kind of decisions to be made,” Haden said. “They’ve been talking about it for a while. Clay has been intimately involved in play calling [during his career]. \n \n“He’s a very innovative coach. I think we’ll be balanced, which I like. And I think it gives Steve a chance to do a lot more. … I think it’s great for Clay, and I really think it’s good for Steve, too.” \n \n—– \n \n  \n \nAugust 31st \n \n… Foe Pause …  \n \nStar UCLA defensive back arrested, held on $100,000 bond \n \nFrom CBS LA … UCLA defensive back Ishmael Adams has been arrested on suspicion of robbery on campus, school officials said Monday. \n \nAdams was taken into custody by UCLA police shortly after 3:30 a.m. Sunday for allegedly using force to take a cell phone from an Uber driver, according to UCLA spokesman Tod Tamberg. \n \nThe Daily Bruin reported Adams allegedly tried to take the cell phone outside of UCPD headquarters on campus. \n \nHe was being held on $100,000 bail following his arrest, Tamberg said. \n \nStarting all 26 games for the Bruins over the past two seasons, Adams led UCLA with four interceptions in 2013 and returned two intercepted passes for touchdowns in 2014, tying the school record. \n \nHe also scored a touchdown on a 100-yard kickoff return against Arizona State. \n \n—– \n \n  \n \nAugust 30th \n \n… Foe Pause … \n \nWashington to keep name of starting quarterback a secret for opener against Boise State \n \nFrom ESPN … Washington has found its starting quarterback, but coach Chris Petersen said the Huskies will keep that information under wraps until Friday’s season opener at No. 23 Boise State. \n \n“Because it’s so late, we think [keeping it private] helps us a whole lot,” Petersen said. \n \n“Our guys know what’s going on and that’s the important thing,” Petersen said. “We’re five days before the game, [naming a starter] doesn’t help us a whole lot.” \n \nTrue freshman Jake Browning, redshirt junior Jeff Lindquist and redshirt freshman K.J. Carta-Samuels have been in competition for the job since January when Browning enrolled early. Browning, who threw for 16,775 yards and 229 touchdowns during a record-setting career at Folsom (Calif.) High, has received strong reviews and is generally considered the favorite to win the job. \n \nThe team’s previous starter, Cyler Miles, retired from football due to a chronic hip injury. \n \nPetersen left Boise State after 13 seasons, the final eight as head coach, for the Huskies before the 2014 season. Kickoff is set for 10:15 p.m. ET on ESPN. \n \n—– \n \n  \n \nAugust 29th \n \n… Foe Pause … \n \nReport: DirecTV deal with Pac-12 a done deal \n \nFrom Pacific Takes … It sounds like the impasse between the Pac-12 and DirecTV will come to an end.  It was reported that DirecTV was testing the Pac-12 Network on Channel 612 , which was usually the precursor to the channel becoming available on a satellite or cable carrier. DirecTV will make a deal that should come into play in time for the start or near the start of the 2015 college football season.  BruinReport has learned this through their sources . \n \nDirecTV is the last major carrier that the Pac-12 has wanted to get on board, their proverbial white whale so to speak.  DISH signed up years ago ,  Comcast, Time Warner, Bright House and Cox were the first to get on board, AT&T also recently joined up, and plenty of local cable carriers on the West Coast also have the conference channel. But DirecTV makes the Pac-12 Network a true national network, like with the SEC and Big Ten Network. It should ensure long term visibility and give the conference coast-to-coast viewing ability for any sports fan. Because NFL Sunday Ticket is exclusively carried by DirecTV, it remains the best option for all sports fans across the country. Now the Pac-12 doesn’t have to worry about that anymore. \n \n—– \n \n  \n \nAugust 28th \n \n… Foe Pause … \n \nFormer Eastern Washington quarterback Vernon Adams named starter at Oregon \n \nFrom the Oregonian …  It took Vernon Adams Jr. two months to pass one final math class before he could complete his transfer from Eastern Washington and enroll at Oregon. \n \nOnce he got on campus, however, acing the Ducks’ quarterback test took just two weeks. \n \nOregon’s first depth chart of the 2015 college football season, released Friday afternoon, listed Adams as the starter and Jeff Lockie his backup for the Sept. 5 season opener against Eastern Washington — his former team. \n \nThe race to replace Heisman Trophy winning quarterback Marcus Mariota came down to Adams, the dynamic playmaker who accounted for 121 touchdowns in three seasons as Eastern Washington’s starter at the Football Championship Subdivision, and Lockie, the career backup who even Adams acknowledged knows the UO playbook better than anyone. \n \nYet Adams appears to have won the job decisively. Oregon typically adds an “OR” next to a player’s name on a depth chart when a competition is close, but no such distinction separates Adams and Lockie. \n \nGiven Adams’ FCS-level accolades — a two-time runner-up for the Walter Payton Award, along with a stunning victory over top-25-ranked Oregon State in 2013 — Friday’s decision wasn’t unexpected. But his late arrival to camp cast doubt as to whether he’d fit into Oregon’s offense quickly enough in order to start the first game. \n \nFriday’s announcement answered that loud and clear, even if coaches and players were unavailable for comment. \n \n— \n \n  \n \nDirecTV deal with Pac-12 may finally be a done deal \n \nThere have been no official announcements, but the Twitter universe seems to believe it is actually coming to fruition. \n \n… Here is an example … \n \nMore this afternoon when (hopefully not “if”) there is an announcement \n \n  \n \n— \n \nStewart Mandel from Fox Sports projects Colorado to be bowl eligible this fall \n \nWhile Mandel has Colorado playing in the Birmingham Bowl as a fill-in for an SEC team, it’s heady stuff to have a national columnist to actually project the Buffs to be bowl eligible. \n \nOverall, Mandel has nine Pac-12 teams being eligible for bowl bids (including all of the Pac-12 South, and excluding Oregon State, Washington, and Washington State. Counting the Rose Bowl/playoffs, the Pac-12 has seven bowl tie-ins. In Mandel’s projection, a second Pac-12 team, Arizona State, earns a Fiesta Bowl bid, with Colorado filling a vacancy when not enough SEC teams are eligible for bowl bids. \n \nThe entire list can be found here . The Pac-12 bowl projections can be found below (you have to like the idea of pitting Utah against BYU in a bowl game (the teams don’t meet up in the regular season this year): \n \nPlayoff bowls \n    Dec. 31  Peach  Atlanta  Notre Dame (at-large) vs. Boise State (Group of 5)    Dec. 31  Cotton  Arlington, Texas  Texas A&M (CFP No. 2) vs. TCU (CFP No. 3)    Dec. 31  Orange  Miami  Ohio St. (CFP No. 1) vs. Auburn (CFP No. 4)    Jan. 1  Fiesta  Glendale, Ariz.  Virginia Tech (ACC) vs. Arizona State (at-large)    Jan. 1  Rose  Pasadena, Calif.  Michigan St. (B1G) vs. Oregon (Pac-12)    Jan. 1  Sugar  New Orleans  Alabama (SEC) vs. Baylor (Big 12)     \nOther Pac-12 bowl projections: \n    Dec. 19  Las Vegas  Las Vegas  BYU (MWC No. 1 or BYU) vs. Utah (Pac-12 No. 6)        Dec. 26  Sun  El Paso, Texas  Clemson (ACC Nos. 3-6) vs. Arizona (Pac-12 No. 5)        Dec. 26  Foster Farms  Santa Clara, Calif.  USC (Pac-12 No. 4) vs. Northwestern (B1G Nos. 5-7)        Dec. 30  Birmingham  Birmingham, Ala.  Houston (American) vs. Colorado *+ (SEC No. 9-10)        Dec. 30  Holiday  San Diego  UCLA (Pac-12 No. 3) vs. Wisconsin (B1G Nos. 2-4)        Jan. 2  Alamo  San Antonio  Oklahoma (Big 12 No. 2) vs. Stanford (Pac-12 No. 2)        Jan. 2  Cactus  Tempe, Ariz.  Kansas State (Big 12 No. 6) vs. Cal (Pac-12 No. 7)     \n—– \n \n  \n \nAugust 27th \n \n… Foe Pause …  \n \nPac-12 Networks announce on-air talent for upcoming season … Jeremy Bloom to work the CU home opener \n \nFrom the Pac-12 … With the 2015 college football season just days away, Pac-12 Networks has made its on-air broadcasting assignments for its live football game telecasts for the first three weeks of season, available on Pac-12 Networks and online at Pac-12.com. \n \nOver the three-week span, the Networks will televise an unprecedented 17 games – more Pac-12 football action than ESPN and FOX combined. The early slate features home openers for nine schools: Arizona, Arizona State, California, Colorado, Oregon, Oregon State, Washington, Washington State, USC. \n \nAs an added bonus to fans, the nation’s biggest cable providers will offer a ‘free preview’ of Pac-12 Networks September 1 – September 20. In addition to covering all 17 football games, fans will have access to 27 Olympic sports including men’s and women’s soccer, women’s volleyball and field hockey, plus original programming such as: Pac-12 Sports Report , Inside Pac-12 Football , One-on-One , Pac-12 Football in 60 and Pac-12 Classics . \n \nThe free preview of Pac-12 Networks will be available to DISH Network and Time Warner Cable subscribers nationwide, plus Cox customers in Southern California and Las Vegas markets, as well as Comcast customers across California. \n \nPac-12 Networks’ full slate of live football game telecasts in 2015 once again will be voiced by a team of veteran broadcasters including: Ted Robinson , Kevin Calabro , Roxy Bernstein , JB Long , Jim Watson , Guy Haberman and Josh Lewin . Glenn Parker , Yogi Roth , Jeremy Bloom and Mike Pawlawski return as game analysts with two former offensive standouts – Washington’s Lincoln Kennedy and former Stanford TE Evan Moore – making their debut in the booth this season. \n \nJill Savage , Lewis Johnson , Ashley Adamson and Drea Avent all return to provide reports from the sidelines. \n \nOne-hour prior to every football game, the Pac-12 Football Pregame Show features new host Anthony Herron , alongside a rotation of analysts including Curtis Conway , Nick Aliotti and Ronnie Lott setting the stage on game day each week from San Francisco. Mike Yam takes over at the end of the night for Pac-12 Final Score , to put a bow on all the day’s action with Nigel Burton and Kennedy. \n \nBelow are the announcing teams for the first three weeks of the football season. Assignments for the rest of the season will be announced along with the game selections and times six to 12 days in advance of each week. \n \nSeptember 12 · Massachusetts at Colorado · 11:00 a.m. \n \nJosh Lewin – play-by-play \n \nJeremy Bloom – analyst \n \n—– \n \n  \n \nAugust 26th \n \n… Foe Pause …  \n \nUCLA names freshman Josh Rosen starting quarterback \n \nFrom CBS Sports … So it seems that if your coach rips you in practice, it doesn’t mean you can’t start for him. \n \nA week after UCLA coach Jim Mora gave freshman quarterback Josh Rosen an earful in front of the media , Rosen has been named the starting quarterback for the Bruins in 2015. \n \nThe decision doesn’t come as a huge surprise, as Rosen was a highly-touted recruit out of St. John Bosco in Bellflower, California. The five-star prospect was rated as the top pro-style quarterback in the 2015 recruiting class by 247Sports. \n \nStill, no matter how many stars a kid has coming out of high school, Rosen will still be a true freshman quarterback starting for a Bruins team that enters 2015 with high expectations. UCLA enters the season ranked No. 13 in the AP Poll, and No. 14 in the Coaches Poll, and has won a total of 20 games the last years. \n \nBut that was with Brett Hundley running the show. \n \nIt will be interesting to see if UCLA can live up to the hype while also dealing with the bumps in the road that come with playing a true freshman at the most important position on the field. That being said, it’s clear that Mora believes in Rosen, or else he wouldn’t be giving him the job. \n \n— \n \n  \n \nESPN: Sefo Liufau 8th-best quarterback in the Pac-12 \n \nFrom ESPN … We’re ranking the Pac-12’s quarterback situations entering the 2015 season. Not all starting battles are set yet, but here’s our first stab at it: \n \n8. Colorado: Buffs coach Mike MacIntyre recently said this: “After this year is over, I think people are going to say Sefo Liufau is one of the best junior quarterbacks in America.” That statement will obviously be received with skepticism, but Liufau certainly wasn’t an absolute weakness on a bad 2014 Colorado team. He did throw 15 interceptions, but expect that number to drop if the Buffs’ defense improves and doesn’t force Liufau to play nearly constant desperation football. \n \nTeams ranked below Colorado … 9. Utah (somewhat of a surprise, considering the success Travis Wilson has had over his career); 10. UCLA (drama in the choice between freshman Josh Rosen and Jerry Neuheisel; 11. Oregon State (already announced the Beavers will alternate quarterbacks during non-conference play); and 12. Washington (uncertainty as to when a starter will even be named). \n \n—-", "source": "CU At the Game"}