{"published": "2015-09-30T22:08:32Z", "media-type": "News", "title": "Greenberg Traurig Shareholder Troy A. Eid Elected to Serve on the Navajo Nation Judicial Conduct Commission", "id": "c22e6525-3ab4-4274-af89-f6518aab39e1", "content": "Troy A. Eid, a shareholder with the international law firm Greenberg Traurig, LLP, was recently elected to serve on the Navajo Nation Judicial Conduct Commission as a representative of the Navajo Nation Bar Association (NNBA).\n\nDENVER (PRWEB) September 30, 2015 \n\nTroy A. Eid, a shareholder with the international law firm Greenberg Traurig, LLP, was recently elected to serve on the Navajo Nation Judicial Conduct Commission as a representative of the Navajo Nation Bar Association (NNBA). Eid, who previously received the Navajo Nation Bar Association's Member of the Year Award, was elected by a vote of the membership of the NNBA, the largest legal association directly serving a Native American tribal government. His appointment was effective Sept. 11, 2015 and the term will be determined by the Chief Justice of the Navajo Nation Supreme Court.\n\nThe commission is charged with the duty to strengthen the courts by providing guidelines and procedures for handling judicial misconduct or impropriety and creating a system of accountability for the Navajo Nation Justices and Judges. \"Congratulations are due to Mr. Eid,\" said Michael J. Barthelemy, President, NNBA, Inc.\n\nEid, a shareholder in the firm's Denver office, co-chairs the firm's American Indian Law Practice, and is a former United States Attorney for Colorado. He has wide-ranging experience in complex federal, state, and tribal litigation as well as environmental investigations and compliance matters.\n\nAbout Greenberg Traurig, LLP – American Indian Law\n\nGreenberg Traurig provides comprehensive, multidisciplinary legal and governmental affairs representation to American Indian, Alaska Native and Native Hawaiian governments, associated enterprises and other entities, as well as to private and public institutions that do business with Indian Tribes and Nations or invest in Indian country. The firm's American Indian Law practice encompasses litigation and dispute resolution; corporate and transactional structuring; advice and counsel; banking and finance; civil and criminal investigations and compliance; and governmental affairs representation at the tribal, state and federal level.\n\nAbout Greenberg Traurig, LLP Greenberg Traurig, LLP, is an international, multi-practice law firm with approximately 1800 attorneys serving clients from 37 offices in the United States, Latin America, Europe, Asia, and the Middle East. The firm is among the 2015 BTI Brand Elite and among the most \"Tech Savvy.\" It was on the 2013-2015 BTI Client Service 30 listings of firms \"most recognized by clients for providing excellent client service,\" and one of the 2014 BTI Client Relationship Scorecard \"Power Elite,\" based on the nature and strength of its client relationships. More information at: http://www.gtlaw.com.\n\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/10/prweb12995467.htm", "source": "Benzinga.com"}