{"published": "2015-09-11T15:39:53Z", "media-type": "News", "title": "Find this man: Toy poodle brutally killed by dog in Loxford Park, Ilford", "id": "65550593-a3d8-4e06-a18b-7cd7f6015b85", "content": "Man and dog wanted in connection with Milo's death, left, and Milo following the attack \n\nArchant \n\nRedbridge Police are appealing to find this man, after his dog allegedly mauled a toy poodle to death in Loxford Park, Ilford. \n\nMilo at the vets after he had died. \n\nThe distraught owners of the dead dog, Milo, who was just 14 months old, told the Recorder of their horrific ordeal. \n\nLisa Reeves, 42, of Jasmine Close, Ilford, was walking Milo and her other pet dog, Lexi, with her daughter Nicole around the park, off Loxford Lane on Monday. \n\nLisa said: “The dog, who I think was a pitbull crossed with a staffie, came running over from the other side of the park. \n\n“The man was shouting at him, and started running after it. \n\nToy poodle Milo at the vets after he had passed away. \n\n“The dog had got Milo in his mouth, and was biting him in the stomach. \n\n“He was shaking Milo around like a rabbit.” \n\nThe tiny toy poodle started bleeding from his chest. \n\nLisa continued: “I was screaming, I was shouting, the man was trying to get his dog off. I was hysterical.” \n\nToy poodle Milo (left) with the Reeves' other dog Lexi. \n\nEventually the man got his dog to release Milo. \n\nThe attack, which happened at about 4.15pm, in front of a number of children who were standing nearby. \n\nShe said: “There were lots of kids, they were screaming, they were all so scared of the dog.” \n\nLisa said she had to carry Milo past the school children, with blood spilling onto her jacket. \n\nLisa's clothes after she had carried Milo across the park. \n\nHe was taken to the Pets at Home veterinary surgery, in Horns Road, Newbury Park, but sadly died shortly after arriving. \n\nYuvani Bandara, the vet who saw Milo, said: “It had puncture wounds on its chest and cuts to its abdomen - the injuries were fatalistic.” \n\nLisa said the whole family is distraught and her 7-year-old son has not been able to sleep since Milo died. \n\nShe said: “Everyone is so emotional, everyone who knew Milo said he was such a sweet dog.” \n\nRedbridge Police is urging anyone who can help identify the owner of the dog to call 101 or Crimestoppers on 0800 555 111 quoting the reference METCU 188981. \n\nNo arrests have been made and enquiries are ongoing.", "source": "Ilford Recorder"}