{"published": "2015-09-22T12:21:00Z", "media-type": "News", "title": "Givex Soars to New Heights with Delta Air Lines and UATP", "id": "63f80a3f-e463-4b15-99c6-89e8ce660d5b", "content": "SOURCE UATP\n\nWASHINGTON \n\nGift cards, already a $124 billion \n\n\"UATP recognized that Givex's global presence, dynamic currency conversion capabilities and their ease in working in multiple languages would suit our international client list. We also saw that their expertise in technology and over 15 years of experience would make them a reliable and resourceful partner,\" said Ralph Kaiser \n\n\"UATP's expansive Network provides Givex with opportunities to quickly connect with all major airlines for gift cards. Airlines can drive sales and modernize purchasing methods via Givex products, making buying and gifting their products and services a breeze,\" said Debbi Blackburn \n\nUATP is the low cost payment network privately owned by the world's airlines. Givex is the expert in gift cards and stored value tickets (as well as loyalty and POS). Together Givex and UATP can provide airlines with innovations such as gift cards towards airline tickets and ancillaries.\n\nAbout UATP \n\nUATP is a global payment solution owned and operated by the world's airlines and accepted by thousands of merchants for air, rail and travel agency payments. UATP offers easy-to-use data tools, DataStream(SM) and DataMine(SM), which provide comprehensive account details to Issuers and Corporate Subscribers for accurate travel management.\n\nAccepted as a form of payment for corporate business travel worldwide by airlines, travel agencies and Amtrak®; UATP accounts are issued by: Aeromexico; Air New Zealand (ANZFF.PK); Air Niugini; American Airlines (NASDAQ: AAL); Austrian Airlines; China Eastern Airlines (NYSE: CEA); Delta Air Lines (NYSE: DAL); EL AL Israel Airlines; Etihad Airways; GOL Linhas aereas inteligentes S.A. (NYSE: GOL and Bovespa: GOLL4); Hahn Air; Heli Air Monaco; Japan Airlines (9201:JP); Lufthansa German Airlines; Malaysia Airlines; Qantas Airways (QUBSF.PK); Qatar Airways; Shandong Airlines; United Airlines (NYSE: UAL); and US Airways.\n\nAbout Givex \n\nGivex is a technology company offering clients a global reach with cost-effective gift card, omni-channel loyalty, analytics, stored value tickets, and cloud-based POS systems. Our core distinction is taking on the tough task of managing all aspects of the transaction to ensure companies can deliver maximum customer satisfaction. Givex products and services give you insight into your data to enable you to better drive sales growth, customer relationship management and enterprise resource planning. \n\nFor more information or media inquiries, please contact: \n\nSaema Nasir \n\nCommunications Specialist \n\nGivex\n\nPhone: 416.350.9660 x 363\n\nToll free: 1.877.478.7733\n\nFax: 416.350.9661\n\nEmail: saema.nasir@givex.com\n\nWebsite: http://www.givex.com\n\nUATP Corporate Communications \n\nWendy Ward \n\nUATP.com\n\nLogo - http://photos.prnewswire.com/prnh/20081118/NETU022LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/givex-soars-to-new-heights-with-delta-air-lines-and-uatp-300146639.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WFMJ 21 - TV"}