{"published": "2015-09-02T08:00:00Z", "media-type": "News", "title": "Diesel dependability in Chevrolet’s best-selling car — Chevy Cruze", "id": "e829e062-60cf-437a-8998-41fb3d56b133", "content": "Now here’s something we don’t see in Canada every day - a diesel-powered compact car from a domestic car company.\r \n \n\r\n                            And it’s one that is actually edging the performance numbers and fuel efficiency ratings of the German competitors who have always dominated the automotive diesel niche.\r \n \n\r\n                            The Chevrolet Cruze 2.0TD diesel model was added to the lineup last year as yet another step in the multi-pronged GM approach to fuel efficiency. \r \n \n\r\n                            GM engineers from Torino, Italy, and Russelheim, Germany, worked in conjunction with colleagues in Pontiac, Michigan to adapt a proven powertrain already used in Europe, where 40 per cent of all Cruze models sold feature diesel engine power. \r \n \n\r\n                            The resulting Clean Turbo Diesel for North America is a 2.0-litre turbocharged unit that makes 151 hp at 4,000 rpm and 264 lb/ft of torque peaking at 2,600 rpm. \r \n \n\r\n                            The prodigious amount of torque in particular - at least 250 lb/ft peaking early between 1,750 and 3,000 rpm with short bursts of overboost power at nearly 280 lb/ft - makes for a strong, linear acceleration feel and 0-100 km/h times of 8.7 seconds. \r \n \n\r\n                            This engine is also B20 rated, meaning it will take a mix of 20 per cent bio diesel mixed with 80 per cent normal diesel fuel.\r \n \n\r\n                            GM claims the 8.7/5.1L/100km (city/hwy) fuel economy rating (with emphasis on the highway numbers) makes the Cruze 2.0TD the most efficient non-hydrid car in Canada, edging out the Golf, Jetta and Beetle models in VW’s TDI lineup. \r \n \n\r\n                            Of course, before anyone starts crowing about beating the best German imports, we should acknowledge that the Cruze diesel engine itself is actually built in Kaiserslautern, Germany.\r \n \n\r\n                            The Euro-sourced engine is mounted in an American-built body that has undergone updates for 2015.\r \n \n\r\n                            An exterior facelift adds styling cues that have trickled down from the critically-acclaimed Impala and Malibu, mainly a new dual-port front fascia design and LED daytime running lamps that complement the Cruze’s swept-back headlight assemblies.\r \n \n\r\n                            Inside, all 2015 Cruze models continue to boast quality interior treatments, tweaked this year with revised cupholders, a trunk release switch moved to the centre console, and door lock switches that have moved from the console to the front doors. \r \n \n\r\n                            The Cruze’s suite of available technologies has also been bolstered with connectivity upgrades like Text Message Alerts, Apple Siri integration and a new OnStar 4G LTE system with a Wi-Fi hotspot.\r \n \n\r\n                            The Cruze lineup starts with a very basic 1LS ($16,075) model powered by a 138 hp 1.8-litre four-cylinder with no air conditioning, a manual six-speed and 16-inch steel wheels with disc/drum braking. It does, however, start with 10 airbags, ABS braking, Stabilitrak, tilt/telescoping steering, power windows, remote keyless entry and six-speaker audio.\r \n \n\r\n                            The lineup builds on that foundation as you move up the trim level ladder to 2LS ($18,775), 1LT ($20,040), Eco ($21,740), 2LT ($22,140), 2.0TD ($25,295) and LTZ ($27,195).\r \n \n\r\n                            If we follow that progression of pricing, the 2.0TD diesel seems to take a significant jump in cost but it should be noted that the price includes a standard six-speed automatic, normally a $1,450 - $1,675 option.\r \n \n\r\n                            GM execs figure the diesel engine actually adds about $1,500 but it’s hard to pin down because of the 2.0TD’s apples-and-oranges mix of equipment, blending the upscale, leather appointed amenities of LT and LTZ models with the fuel-efficient technologies of the Eco model including a special Aero Package with grille shutters, rear spoiler and body kit, low resistance rolling tires on special 17-inch alloy wheels and a tire inflator kit instead of compact spare.\r \n \n\r\n                            Unique add-ons for the diesel include a 17-litre diesel exhaust fluid tank, remote vehicle start and specially adapted MDK Hydra-Matic six-speed automatic tranny.\r \n \n\r\n                            Is the diesel worth it? Well, I hate to fudge the answer, but that depends.\r \n \n\r\n                            The strength, simplicity and durability of a diesel always appeals to high-mileage commuters. There’s a bit of the usual clatter on cold startup but, at cruising speeds, the diesel engine is muted, as civilized as it is strong.\r \n \n\r\n                            The 8.7/5.1L/100km (city/hwy) rating may be the lowest of the lineup but a gasoline-powered ECOTEC 1.4-litre turbo offered with the LT, LTZ and Eco models makes the same horsepower, less torque but with fuel econ numbers close to the diesel rating.\r \n \n\r\n                            My real world results after a mixed bag of driving conditions with the 2.0TD diesel worked out to a still excellent 6.8L/100km (comb). Those numbers would translate into an 850 km plus range on a tank of gas.\r \n \n\r\n                            You might also save on less expensive diesel fuel, about a dime cheaper per litre during my test period, but I have seen diesel bounce up and down on either side of the regular gas price over the last few years, so that’s a bit of a crapshoot. There’s also always the caveat of fewer diesel gas pumps and, usually, dirtier diesel gas pumps.\r \n \n\r\n                            And I’ll add one more complication to the decision process - a brand new, larger, lighter, tech-loaded and more fuel-efficient 2016 Cruze that will go on sale early next year, followed a year later by a brand new 2017 diesel version.\r \n \n\r\n                            Ah, yes. Decisions, decisions.\r \n \n\r\n                            There’s no shortage of choices in the Chevrolet’s best-selling Cruze lineup, both now and in the future, but, for 2015, the 2.0TD model offers strong, thrifty performance and civilized upscale amenities blended into a handsome package with all the usual hallmarks of award-winning diesel dependability.\r \n \r\nWHAT’S BEST: The Chevrolet Cruze 2.0TD (diesel) is claimed to be the most fuel-efficient non-hybrid car on the road today. \n\r WHAT’S WORST: The diesel engine should be available at lower price/trim levels.\r \n \n\r WHAT’S INTERESTING: Even after a recent 2015 makeover, a brand new lighter, larger and more technically enhanced 2016 Cruze is set to debut next year with a 2017 Cruze diesel model slated to follow a year later.\r \n CHEVROLET CRUZE 2.0TD 2015 AT A GLANCE  \n\r\n                            \r BODY STYLE: Compact five-passenger sedan\r \n \n\r\n                            \r DRIVE METHOD: Front-engine, front-wheel-drive\r \n \n\r\n                            \r ENGINE: 2.0-litre DOHC turbo diesel (151 hp, 264 lb/ft with 280 lb/ft overboost)\r \n \n\r\n                            \r FUEL ECONOMY: 8.7/5.1L/100km (city/hwy); As tested 6.8L/100km (comb)\r \n \n\r\n                            \r CARGO: 377 litres (13.3 cu ft)\r \n \n\r\n                            \r PRICE: MSRP $25,295. As tested $28,175, includes Sun & Sound Pkg ($1,100) with Power Sunroof and 250W Pioneer Premium Speaker System; Enhance Safety Pkg ($885) with Rear Ultrasonic Park Assist, Rear Cross Traffic Alert and Side Blind Zone Alert; Chevrolet MyLink Navigation ($795) not including $1,600 destination fee \r \n \n\r\n                            \r WEB:  www.chevrolet.gm.ca", "source": "Northumberland News"}