{"published": "2015-09-20T22:40:01Z", "media-type": "News", "title": "New Zealand zoo says it wont euthanize tiger that killed keeper", "id": "ee290500-1e34-4c79-875f-093b181863ae", "content": "A New Zealand zoo decided Monday that it won't euthanize a Sumatran tiger that attacked and killed a veteran zookeeper. \n\nThe male tiger named Oz killed 43-year-old Samantha Kudeweh Sunday morning inside the animal's enclosure at the Hamilton Zoo. Kudeweh had been a zookeeper for more than 20 years and was the mother of two children, aged nine and three. \n\nThe zoo, which houses five Sumatran tigers, is owned and operated by the Hamilton City Council. Lance Vervoort, the council's general manager for the community, said in a statement there was always a risk for zoo staff in managing big animals like Oz but the tiger didn't pose a wider risk. \n\n\"Oz is a significant animal for his species,\" Vervoort said. \"He is the father of our two cubs, and he is vital to the ongoing breeding program to conserve this rare species.\" \n\nSumatran tigers are considered critically endangered, with less than 400 of the tiger subspecies still living in the wild on the Indonesian island of Sumatra. \n\nVervoot said the view of zoo professionals was that the attack was in line with the tiger's natural instincts. \n\nThe zoo was closed after the attack. It will reopen Thursday. \n\nVervoot said the zoo wouldn't comment on what went wrong until an investigation is completed. \n\nKudeweh was the zoo's curator, responsible for organizing what animals the zoo obtained and how it looked after them. She had worked at several zoos before starting at the Hamilton Zoo in 2005. She wrote about her job on the zoo's website: \n\n\"For me the best thing about my role is the opportunities to interact with other species one to one, but there is a downside and that is having to say goodbye to animals,\" she wrote. \"That part never gets any easier.\" \n\nShe was married to another zoo professional. \n\nCouncil spokesman Jeff Neems said the public was never in danger during the incident and that all animals had remained contained in their enclosures. \n\nNeems said the zoo has 128,000 visitors a year, making it about the fourth most popular zoo in New Zealand.", "source": "DailyNews724.com"}