{"published": "2015-09-01T14:48:10Z", "media-type": "Blog", "title": "Illinois Football: 5 Questions to Start the 2015 Season", "id": "ab2099ac-92fc-4410-aadb-f62c9c0c98cc", "content": "Next1 of 6Prev post\nUse your ← → (arrows) to browse\nMandatory Credit: FightingIllini.com The Illinois football team is entering the 2015 season with expectations that have been lowered by many because of recent issues that have gone on in the program.  Well, some people like me expect a lot more out of the Illini this year. Illinois isn’t bringing back their head coach from last season, but they are bringing back the same team. Wes Lunt will be under center again this season and hopefully he will be able to stay healthy.  Josh Ferguson is once again starting at running back.  He seems like he has been around since 1902.  Illinois is bringing back the same wide receiving core from last year as well.\nMore from Writing IlliniIllinois Football: Offensive Depth Chart Against Kent State21h agoIllinois Football: Brandon Jones Commits to Play for the Illini1d agoIllini News: Simpson and Sneed Wrap Up Visits, Simpson Decision May Come Soon1d agoIllini Volleyball: Illinois Sweeps Illini Classic for Second Year1d agoIllinois Football: Nathan Scheelhaase to be Named Running Backs Coach2d ago\nThe defense hasn’t changed much either.  Mason Monheim will hold his familiar spot at middle linebacker, while the defensive line remains solid. The Illini also have their offensive coordinator from last season, Bill Cubit, leading the team onto the field this season.  He is taking over the duties and that is great because the team is already familiar with how he coaches. Some people may be looking down on Illinois this season, but what they don’t realize is how experienced and talented this team truly is.  They are a great group that has a great coach leading the way.  I look forward to the 2015 season. Here is what the Writing Illini staff thinks of the upcoming season. Next: Question #1 Stay connected with Writing Illini\nFollow @WritingIlliniFS\nWant more from Writing Illini?  \nSubscribe to FanSided Daily for your morning fix.\nEnter your email and stay in the know. Next1 of 6Prev post\nUse your ← → (arrows) to browse", "source": "Writing Illini"}