{"published": "2015-09-04T06:32:01Z", "media-type": "News", "title": "Clerk jailed for refusing to issue marriage licences for gay couples", "id": "5e7e440d-2f5c-45bd-9087-f3e82e806b0b", "content": "Video will begin in 5 seconds. \n   More video  Recommended   Replay video       US clerk refuses gay marriage under 'God's authority'  \nA county clerk in the US state Kentucky refuses to issue a marriage licence to same-sex couples on religious grounds. \n PT1M2S   620  349    \nAshland: A county clerk in Kentucky was held in contempt of court and jailed on Thursday for failing to issue marriage licences to gay couples in defiance of the US Supreme Court. \n\nBut five of Rowan County Clerk Kim Davis' six deputies later told the judge in a second hearing that they were willing to issue the licences. \n\nIt remained to be seen whether US District Judge David Bunning, at a third hearing later on Thursday, would grant a request by Ms Davis' lawyers to release her. \n \nRowan County Clerk Kim Davis listens to a customer following her office's refusal to issue marriage licences at the Rowan County Courthouse in Morehead, Kentucky. Photo: AP  \n  \nThat hearing was scheduled for Thursday afternoon (US time) to determine Ms Davis' fate. Judge Bunning earlier said he was not inclined to release her on Thursday. \n \n \n \nMs Davis, who broke down crying, was led away by US Marshals after the first hearing. \n\nThe 49-year-old woman, who has emerged as a darling of social conservatives, has refused to issue licences to any couples, gay or straight, since the US Supreme Court in June ruled that same-sex couples have the right to marry under the US Constitution, citing her beliefs as an Apostolic Christian. \n \nRowan County Clerk Kim Davis, right, talks with David Moore following her office's refusal to issue marriage licences at the Rowan County Courthouse in Morehead, Kentucky, on Tuesday. Photo: AP  \n  \nThursday's proceedings were the culmination of months of legal wrangling and refusals to abide a judge's order to do her job that had drawn national attention from those both for and against gay marriage rights. \n\n\"Marriage is a union between one man and one woman,\" she told the court under questioning by her attorney.  \n\nReuters \n\nFollow FairfaxForeign on Twitter \n\nFollow FairfaxForeign on", "source": "Daily Life"}