{"published": "2015-09-17T15:53:06Z", "media-type": "News", "title": "Tampa council to discuss 10 Investigates story 1 hour ago", "id": "f350211a-d508-45bb-a9dc-c0801659523f", "content": "Beth Leytham (Photo: WTSP) \n\nTAMPA, Florida  - Following a  10 Investigates series into the behind-the-scenes influence of a top political adviser to Mayor Bob Buckhorn and other local politicians, Tampa's city council is following the lead of the Hillsborough County Commission and discussing some of the the issues identified in the reports. \n\nAt the start of Thursday morning's meeting, councilwoman Lisa Montelione asked for a reconsideration of the city's contributions toward the \"Go Hillsborough\" project, a series of public meetings designed to gauge public interest on transportation expansion in Hillsborough County. The council is expected to address her request later this morning. \n\nThe city is contributing $75,000 toward the $1.35 million public outreach contract ahead of a possible transportation tax referendum.  And even the total cost of the outreach project, paid mostly by county tax dollars, is just a tiny percentage of the $4-to-$7 billion that could be raised by a successful transportation referendum in 2016. \n\nBut with a good portion of the outreach contract going straight to The Leytham Group, a public relations firm run by Beth Leytham, the controversial political adviser to Mayor Bob Buckhorn and Commissioner Ken Hagan, several officials have suggested putting some distance between Leytham and the process to restore public trust. \n\nWATCH: Raw reactions from politicians who declined interviews \n\nOn Monday, 10 Investigates used public documents to show what appeared to be Leytham improperly lobbying on the Go Hillsborough issue and other public contracts around Tampa Bay. \n\nAnd on Wednesday, the county commission ordered an independent audit of how the contract was procured, with some officials suggesting a \"pause\" or \"reset\" on the process to restore trust in transportation expansion in Hillsborough County. \n\nCity councilwoman Montelione has expressed her frustrations to the county's Metropolitan Planning Organization (MPO) in recent months about the escalating costs of Go Hillsborough's public outreach, but appeared especially frustrated Thursday morning when she requested council reconsider its resolution from two weeks ago. { READ: Tampa council's resolution on pg. 347 } \n\nStay tuned for more updates on this story throughout the day. \n\nPREVIOUS COVERAGE: \n9/16/15 - Hillsborough Commission orders review after 10 Investigates story \n9/15/15 - Hillsborough County fails to police lobbyists \n9/14/15 - How a political consultant is calling the shots; and getting your tax dollars \n\nRead or Share this story: http://on.wtsp.com/1KiY", "source": "10connects.com"}