{"published": "2015-09-02T16:23:25Z", "media-type": "News", "title": "Transfer Window Analysis: Top 3 Premier League Signings", "id": "6450703b-1fef-459a-95a8-d1fdc9c0e212", "content": "As the transfer window slammed shut last night, we look at top 3 Premier League transfers to watch out for in the seasons ahead.   \nManchester United shocked everyone by completing the signature of French teenage forward Anthony Martial from Monaco for a fee of 50m Euro that could rise up to 80m Euro. \n \nFollowing the move, Arsenal FC manager Arsene Wenger, who had come under criticism for not signing any outfield player, said that the Martial transfer indicates that there is a genuine shortage of players that can improve the top sides. \n \nHowever, we pick out top 3 transfers across the Premier League that one can expect to set the league on fire in the coming years and will also be good value for the money. \n 1 – Pedro  \nChelsea FC secured the signature of the pacey FC Barcelona winger under the noses of Manchester United for a fee of £21m. Given some of the other deals that have happened in the window, this looks like an absolute steal. \n \nPedro had signed a new deal with FC Barcelona, but following the signature of Arda Turan, he felt that his chances might be restricted at the club. While Manchester United were in pole position to sign the Spanish international, Chelsea FC swooped in the 11th hour to sign him. \n \nPedro is a winger who will create chances and score, as evident from the fact that he has already made two goals and scored one in his two starts for Chelsea FC. \n \nVerdict: 5/5 – The best signing of the transfer window. Chelsea FC have a gem in their rank. \n \n[embedded content] \n 2 – Dimitri Payet  \nWest Ham signed Payet from Marseille for £10m amidst much fanfare. Payet set up 51 goals over the past six Ligue 1 seasons, having created the most chances of any player across the top 5 leagues. The only thing holding back Payet from signing for a bigger club is his inconsistency. However, at £10m, he is an absolute steal, as is evident from his first few performances. \n \nWith the new West Ham stadium on the verge of being ready, the club cannot afford to get relegated. And from his past performances and the first few games in the Hammers shirt, it looks like the London side have made a wise decision to sign the Frenchman. \n \nVerdict: 4/5 – At £10m, the player is a steal. Without a doubt one of the deals of the summer. \n \n[embedded content] \n \n3 – Roberto Firmino \n \nLiverpool FC’s capture of the Hoffenheim man was lauded as a coup for the club, especially because they had been missing out on a lot of good players off late. The Brazil international, however, was swooped away by the Merseysiders, that too under the noses of Manchester United and Manchester City , who were both interested in the player. \n \nLiverpool moved quicker and as told by the player, made him feel wanted. \n \nThe Brazil man was signed in a £29m deal. Firmino scored 23 goals in his last 66 appearance in the Bundesliga. In the last two years in Germany, he has created the most chances from open play (140) and completed the most dribbles (291). His 10 assists last season was bettered by Kevin de Bruyne in Germany. The Brazilian had 11 assists in the season before last. \n \nFirmino’s talent is there to be seen in the cameos for Liverpool FC so far. He is yet to score a goal or grab an assist, but is slowly building up his fitness and EPL fans got a glimpse of what he could do in the game against West Ham, when a thundering shot from 25 yards from his weaker foot hit the post. \n \nShould he adapt to the league, Liverpool FC have a very good and young player in their ranks who could set the league alight. \n \nVerdict : 3/5 The fee involved is high, but, Firmino is just 23 years of age and should he continue to progress the way he has in the past two years, Liverpool FC have a real player on their hands. \n \n[embedded content] \n \nOther mentions:  \n \nSince we had to pick only three, Kevin de Bruyne misses out alongside Nicolas Otamendi . Both the players come to Manchester City on the back of tremendous seasons with Wolfsburg and Valencia. While de Bruyne was the Bundesliga Player of the Year and broke the league record for the most assists, Otamendi was the only non-Barcelona or Real Madrid player alongside Atletico Madrid star Antoine Greizmann to make the La Liga Team of the Year. Matteo Darmian , who was the best right-back in the Italian Serie A, as well as Memphis Depay,  who was the Eredivisie top scorer are also great purchases by Manchester United. Petr Cech was hailed by many as a potentially title winning signing, but, we just don’t share the view that he is a major upgrade over Ospina. Besides Darmian, we felt, none of these players, while superb signings in their own right, were as much value for the money as the above three. Darmian may be a bit unlucky to miss out. \n \nLet us know your views by voting below \n\r\n\r Take Our Poll", "source": "The Hard Tackle"}