{"published": "2015-09-19T21:37:45Z", "media-type": "Blog", "title": "Legalize It: Medicine Struggles With Marijuana Epilepsy Cures", "id": "c4557d19-2af7-4dde-a23b-2fd3dc104122", "content": "Epilepsy sufferers may find relief from seizures thanks to a chemical found in marijuana, but the nation’s drug laws are preventing doctors from conducting important research. \n \nCannabidiol, an active ingredient in marijuana that doesn’t get smokers high, has been proven to prevent epilepsy seizures, but researchers are having difficulty conducting large scale studies , according to a study published by WebMD . \n \nEven though four states and the District of Columbia have legalized marijuana and 23 other states have eased restrictions, cannabis remains a Schedule 1 controlled substance by the Drug Enforcement Agency. The federal government considers marijuana to have no redeeming medical value. \n \nThose restrictive laws are hindering scientists’ research into anti-seizure marijuana drugs Dr. Daniel Friedman, a neurologist and epilepsy specialist at NYU Langone Medical Center in New York City told WebMD . \n \nWhile we don’t know all of the long-term and short-term side effects of using cannabis and cannabidiol, we do know the impact of uncontrolled epilepsy, and that must be considered when looking at the use of cannabis. \n \nMany epilepsy patients can control their disease with diet and one of the 20 different existing drugs, but 30 percent of epilepsy sufferers still suffer from seizures, each of which causes loss of cognitive functions, according to the Atlanta Journal-Constitution . \n \nIn the United States about 1 in 26 people will develop some type of seizure related epilepsy disorder, a central nervous system disorder characterized by brain cell disruption, according to the Mayo Clinic. \n \nSome states, like Texas, have legalized the use of cannabis oil for epilepsy patients like 5-year-old Hanna who was diagnosed with epilepsy when she was 11 months old. \n \nHer father, Tim McMorris, told KXAN-TV the family had tried every conventional medicine on the market with no success. \n \nHearing her doctor say that we are on the last medication, that this is pretty much the last straw for her. It really starts sinking on kind of hopelessness almost. \n \nAbout two out of every five patients who received compassionate waivers from the government allowing them to use cannabis oil have experienced less frequent seizures. \n \nCannabis oil isn’t the same as medical marijuana; patients can’t get high from it. Its sole purpose is to ease the suffering of epilepsy patients and prevent seizures. \n \nMore clinical trials and research studies are needed, however, to determine medical strategies, effective treatment and discover any harmful side effects. \n \nLegalize It: Medicine Struggles With Marijuana Epilepsy Cures is an article from: The Inquisitr News", "source": "The Inquisitr News"}