{"published": "2015-09-17T16:45:02Z", "media-type": "News", "title": "What were the “bad” women doing during the Civil War?", "id": "8b559b3b-10ed-4471-a8b9-7c3f9f8c8a60", "content": "Arts & Events  \n 10 questions for Civil War spy expert Karen Abbott  \n September 17, 2015 Tess Malone  \n Photo by Nick Barose \nIn historian Karen Abbott’s newest book,  Liar, Temptress, Soldier, Spy , we meet four women who defied gender expectations and their respective governments to spy during the Civil War. Before her lecture  at the Margaret Mitchell House tonight, she discussed diving into the Civil War from a Yankee perspective, what she’s working on now, and her favorite places in Atlanta. \n \nAs a New York–based writer, was it daunting to tackle the Civil War? \nIt really was. I lived in Atlanta for six years.  When I first moved down there, it was a huge culture shock. The Civil War seeps into the Southern culture more than Northern. I was stuck in traffic on 400 and saw a pickup truck with a bumper sticker that said, “Don’t blame me; I voted for Jeff Davis.” Driving behind this pickup for two hours got me thinking about the Civil War. In my mind I always go to: What were the women doing? What were the “bad” women doing? \n\n \nWhat was the research process like? \nI sort of has to start at the beginning and remind myself who the generals were and refresh myself on the battles. And no one agrees on the details. What was the Civil War about—nobody even has a consensus on that. What people omit or choose to omit is as interesting as what the truth is. The idea of self-mythology in the Civil War was interesting to me. Everyone who wrote about themselves engaged in some embellishment and some self-aggrandizing. Writing it was a five-year process. I had to write as I was researching or I would’ve been researching forever. \n \nYour book is incredibly detailed, so did you pick the four women based on their stories or your access to primary sources? \nNumber one it was primary sources. I like to read nonfiction that reads like a novel, so it's a question of how many primary resources would I have to draw from. Luckily, the four women I picked were prolific writers: Rose and Belle had memoirs; Emma wrote her books, so you could see where she was embellinshing and where she was being factual; but Elizabeth was the best spy, and like any good spy didn’t want to leave too much of trail so she wasn’t caught. I wanted women who were coming at war from different perspectives and had different motivations. I wanted women whose stories would intersect and affect each other; for example, Rose’s spying affects Emma. Their stories were interwined in interesting ways. \n \nHow did these women defy both 19th century and contemporary gender stereotypes? \nElizabeth Van Lew was Ulysses S. Grant’s most important spy. He definitely needed her input to win war. The fact she’s not a household name is such a tragedy to me. If she had been man, he probably would be a household name.  The gender fluidity about them is fascinating to me. Belle was a seductress but occasionally dressed like a man, carried her own weapons, and got into altercations. If Sarah Palin and Miley Cyrus had a 19th-century baby, it would be Belle. Make what you will of her politics, but I really admired her brazenness. With Emma, her gender fluidity was intriguing because she was living as a man but allowed herself to develop romantic feelings for another soldier. It's her mixture of strength and vulnerability. I didn’t want it to be women running around in skirts. This was bloody. This was devastating. I wanted the blood and guts to be evident. \n \nDespite how your books are historical nonfiction, they read like novels. What's your writing background? \nI am not an academic. My background was in journalism. My favorite thing to do was to write really long profile pieces, taking something small and blowing it up. I remember taking a name out of phone book of this poor woman and writing a whole feature. My editor gave me the freedom to explore mundane topics, which honed my storytelling ability. With journalism, it’s all about the detail. You can’t try to be funny, charming, or poignant; you have to let those details do the work for you. \n \nHow did you switch from journalism to historical nonfiction? \nI was in Philly, and I was getting burned out. I had the horrible task of reporting on all of the layoffs and buyouts at the  Inquirer . I was constantly reading about the attrition. Around that time, my husband got a transfer to Atlanta, so it was a good time to see something new and try book-length writing. I had an idea and spent two to three years on it, and it didn’t sell. Being on submission for the first time was one of the worst experiences. I blew up in hives. \n \nWhat are you working on next? \nI am working on a magazine piece that might turn into book on a modern day murder. If not that, I’m going to start diving into novel. \n \nWho are your favorite writers? \nGary Smith was a Sports Illustrated journalist. His magazine pieces are never just about sports; they give you an insight into an experience. I recommend Beyond the Game . \n \nI have to ask about the parrots mentioned in your author bio. \nI have two African Greys, Edgar Allan Poe and Pete Dexter.  They’re excellent mimics but crap on my files. They’re great company. \n \nAs a former Atlantan, what are your favorite places in the city? \nCakes & Ale , I used to love the Clermont Lounge and  Majestic Diner . \n \nTags: books , Civil War , history , Karen Abbott", "source": "Atlanta Magazine"}