{"published": "2015-09-17T13:00:01Z", "media-type": "News", "title": "Social media dilemma: Love me, love my selfie?", "id": "466907f8-d0f3-4d4f-9c77-b0cabbcf8489", "content": "Technology is great; that’s a fact. In seconds we can know the answer to any question, visit any place in the world, buy anything we need or make new friends. But in a world where we all are connected online, what has that done to our “real-life” selves? I’m talking to you 20-somethings. We grew up with Xanga, Myspace, Twitter and Facebook. We’ve had “About me”s, status updates and posts to define ourselves and to tell people anything they’d need to know about us. With the Internet, you can see how someone is doing without really seeing how they’re doing. The truth is that our online selves are a better, funnier, prettier, have-my-s***-together-er versions of who we really are.  In 2014, on average, we spent TWO hours on social media alone every single day. That’s up a half  hour from 2013. \n\nScroll. \n\n    Smirk. \n\n         Like. \n\n             Repeat. \n\nAll while we ignore the real world around us. We care more about likes, comments and views than we do conversations. Why is it necessary for us to be reminded constantly that these things aren’t important? How many times have you found yourself “creeping” someone on Facebook to find out information instead of just asking them? Face-to-face interactions have become awkward, all while a quick text is nothing to us. All of this leads me to the question: What in the hell is wrong with us? In a room full of real, live, breathing people, we focus all our energy on a tiny computer in our pockets. We say to our friends: put that on Facebook!  We take 35 pictures just to get “the right one.” We play out our lives in 15-second intervals for anyone to see. Privacy is somewhat a thing of the past. If we didn’t share it online, did it really even happen? In most cases, we have turned all-important personal skill building digital. Swipe left or right on someone instead of walk up to them; press the add button instead of inviting them over; send a message instead of talking.  If we continuously are more concerned with what people think we are doing versus what we actually are doing, then what do we have left? – hundreds or thousands of “friends” and no one to really talk to?  As a generation of innovators, we should take a second to ask ourselves: Do I want my son or daughter to live vicariously through a computer? Do I want real memories, or do I want valencia-filtered ones? Do I love myself or just my selfie?", "source": "Amarillo College Ranger"}