{"published": "2015-09-20T14:43:45Z", "media-type": "News", "title": "Brokerages Set Baker Hughes Price Target at $77.26 (NYSE:BHI)", "id": "514dca6d-7ca1-4b54-bf27-4c5d8b11adb6", "content": "Baker Hughes (NYSE:BHI) has earned an average recommendation of “Buy” from the twenty-seven ratings firms that are covering the firm, MarketBeat reports. One investment analyst has rated the stock with a sell recommendation, eight have given a hold recommendation, fourteen have given a buy recommendation and one has assigned a strong buy recommendation to the… \r \nBaker Hughes (NYSE:BHI) has earned an average recommendation of “Buy” from the twenty-seven ratings firms that are covering the firm, MarketBeat reports. One investment analyst has rated the stock with a sell recommendation, eight have given a hold recommendation, fourteen have given a buy recommendation and one has assigned a strong buy recommendation to the company. The average 1 year target price among brokers that have issued ratings on the stock in the last year is $76.31. \n\nShares of Baker Hughes (NYSE:BHI) traded down 3.29% during trading on Thursday, reaching $53.47. 4,364,462 shares of the company’s stock were exchanged. Baker Hughes has a 52 week low of $44.11 and a 52 week high of $70.45. The firm has a market capitalization of $23.31 billion and a PE ratio of 89.56. The company’s 50-day moving average price is $54.38 and its 200 day moving average price is $61.18. \n\nBaker Hughes (NYSE:BHI) last issued its earnings results on Tuesday, July 21st. The oilfield services provider reported ($0.14) earnings per share for the quarter, missing the Zacks’ consensus estimate of ($0.13) by $0.01. During the same quarter last year, the business earned $0.92 earnings per share. The business had revenue of $3.97 billion for the quarter, compared to the consensus estimate of $3.88 billion. The business’s revenue for the quarter was down 33.1% compared to the same quarter last year. Analysts predict that Baker Hughes will post ($0.32) EPS for the current fiscal year. \n\nThe company also recently announced a quarterly dividend, which will be paid on Wednesday, September 23rd. Investors of record on Wednesday, September 2nd will be given a $0.17 dividend. The ex-dividend date of this dividend is Monday, August 31st. This represents a $0.68 annualized dividend and a yield of 1.27 \n\n%. \n\nA number of analysts have weighed in on the stock. Howard Weil lowered their price target on shares of Baker Hughes from $75.00 to $62.00 in a research report on Thursday. Jefferies Group decreased their target price on shares of Baker Hughes to $68.00 in a research report on Friday, September 11th. JPMorgan Chase & Co. cut their price target on shares of Baker Hughes from $69.00 to $65.00 and set a “neutral” rating for the company in a report on Wednesday, August 26th. Iberia Capital raised shares of Baker Hughes to a “conviction list” rating in a research note on Wednesday, August 26th. Finally, Susquehanna reduced their price target on shares of Baker Hughes from $72.00 to $68.00 and set a “positive” rating for the company in a research report on Monday, August 24th. \n\nIn other news, VP Khalid M. Nouh sold 16,937 shares of the firm’s stock in a transaction on Wednesday, July 22nd. The stock was sold at an average price of $60.73, for a total value of $1,028,584.01. The sale was disclosed in a document filed with the Securities & Exchange Commission, which can be accessed through the SEC…", "source": "MyInforms"}