{"published": "2015-09-23T07:09:58Z", "media-type": "News", "title": "Parking, street barricades designated at Fort Washington SEPTA station area for papal visit (updated) (1175)", "id": "9e1d60ab-ecd2-4961-8600-ca0d930e7447", "content": "An updated map of parking available for the papal visit near the Fort Washington train station. Courtesy Upper Dublin Police Department \n FORT WASHINGTON >> Almost 2,000 parking spots have been identified for those planning to take SEPTA Regional Rail into Philadelphia from the Fort Washington Train Station during Pope Francis’ two-day visit, according to Upper Dublin and Whitemarsh police. \nThe Sept. 26-27 Papal Visit in Philadelphia is expected to draw more than 1 million people. Special one-day papal passes are needed to use the Fort Washington Train Station — one of 18 on the Regional Rail R5 line designated to operate express trains from 5:30 a.m. to noon during those two days to Jefferson Station. \n\n“People should be pre-planning where they’re going to park,” Whitemarsh police Lt. Fran Wheatley said. Also, “They need to be patient; they will get to where they need to be.” \n\nSEPTA has made available 10,000 tickets for each day to and from Philadelphia from Fort Washington, but actual ticket sales as of Sept. 8 were “significantly below that maximum allocation in the area of 5,000, but could increase between now and the event,” the Upper Dublin Township website says. \n\nAccording to SEPTA, as of Sept. 15, 4,380 passes had been sold for Sept. 26 and 5,382 for Sept. 27 at the Fort Washington station. Passes will remain available for purchase through Friday, Sept. 25. \n\nTo put the numbers in perspective, SEPTA spokeswoman Jerri Williams said, the average number boarding at Fort Washington is 167 for Saturdays and 182 for Sundays, with average daily boards of 904 for an entire day. \n\nPolice, volunteers and signs will direct visitors to legal parking areas, which do not include parking in the neighborhoods of old Fort Washington and Elliger Park, where barricades will be set up to permit access for local traffic only in an effort to minimize the impact to those residents, the township said. \n\nEveryone is urged to carpool and use mass transit as available — including private buses — to reduce the number of vehicles. The township has created a map showing parking areas as well as the streets that will be barricaded and open only for local traffic. \n\nThe train station itself will be used for queuing riders, handicapped parking and support agencies. Summit Avenue in Whitemarsh Township (the driveway leading from Pennsylvania Avenue into the station) will be for buses only to enter the station. Station Avenue in Whitemarsh (the driveway from Bethlehem Pike into the station) will be open for pedestrians only. Pennsylvania Avenue and Bethlehem Pike will remain open to traffic. \n\nFor those driving private vehicles, passengers may be dropped off at two locations – the Fort Washington Train Station parking lot for vehicles approaching from the west or Bethlehem Pike side of the station by using the east end entrance on Pennsylvania Avenue; and the Holiday Inn parking lot, using the west end entrance, for vehicles approaching from the east (Commerce Drive and Turnpike) side of the station. Handicapped parking is also available at the Holiday Inn lot. Continued... \n Approved papal parking areas range from walking distances to the train station of 0.3 miles at Germantown Academy to 2.6 miles at Temple University Ambler. Germantown Academy has almost 1,000 parking spots, weather dependent, and will charge $30/day or $50 for the two days. There will be limited shuttle buses from Temple Ambler (900 spaces) — drivers may want to park there after dropping off passengers at the train station. \nParking at Fort Washington Elementary School (1.1 miles) and select lots at Upper Dublin High School (1.6 miles) — about 565 spaces total — is available for $20 per day per vehicle plus a small processing fee through the online purchase of vouchers at http://www.brownpapertickets.com/event/2224097 or search “Upper Dublin School District Parking - Papal Visit Weekend.” Comfort stations will be available in the Fort Washington Elementary School parking lot. There is no multi-day discount. A maximum 500 vouchers per day will be sold. Those completing the online purchasing process will be notified by email with a list of days, times and location for pickup of parking vouchers. \n\nOther designated parking include some areas in the Fort Washington Office Park: 550 Pinetown Road (1.4 miles); 440 Virginia Drive (1.4 miles); 580, 1015, & 1035 Virginia Drive (1.8 miles). The cost for parking will be up to those who own the lots. SEPTA’s 201 bus that goes through the office park will operate on a modified weekday schedule. \n\nFor drivers picking up passengers on the return trains, from 5:30 p.m. to 1 a.m. each day, a cellphone lot to wait has been set up at Executive Plaza, 540 Pennsylvania Ave. \n\nSign boards and police from several jurisdictions will be directing traffic both morning and night to keep traffic moving and ensure people get to their destinations. Comfort stations will be at the train station along with emergency services that may be needed. \n\nLocal streets in the old Fort Washington/Elliger Park neighborhoods will be barricaded and monitored from 4:30 a.m. to 12:30 p.m. Sept. 26 and 27. All residents and their guests are being asked to use Prospect Avenue (at Fort Washington Avenue or Bethlehem Pike) and Madison Avenue (at Highland Avenue) to come and go from the neighborhood during those hours. \n\nFire police will be manning those intersections to allow residents and their guests to enter and exit the neighborhoods. \n\nPennDOT and the Pennsylvania Turnpike have launched a detailed travelers’ website with real-time traffic conditions on highways in the Philadelphia region and details on how to reach the papal venues or take diversion routes for those who are merely traveling through or around the region. The site at www.papal511.com is linked both to PennDOT’s 511PA site and the Turnpike’s travelers’ information site and is accessible from both desktop and mobile interfaces. \n\nEditor’s Note: A previous version of this article stated there would be open parking at 185 Commerce Drive during the papal visit. That is not the case. Parking at 185 Commerce Drive will only be available to employees and customers of the businesses located on the property. \r \nFORT WASHINGTON >> Almost 2,000 parking spots have been identified for those planning to take SEPTA Regional Rail into Philadelphia from the Fort Washington Train Station during Pope Francis’ two-day visit, according to Upper Dublin and Whitemarsh police. \nThe Sept. 26-27 Papal Visit in Philadelphia is expected to draw more than 1 million people. Special one-day papal passes are needed to use the Fort Washington Train Station — one of 18 on the Regional Rail R5 line designated to operate express trains from 5:30 a.m. to noon during those two days to Jefferson Station. \n\n“People should be pre-planning where they’re going to park,” Whitemarsh police Lt. Fran Wheatley said. Also, “They need to be patient; they will get to where they need to be.” \n\nSEPTA has made available 10,000 tickets for each day to and from Philadelphia from Fort Washington, but actual ticket sales as of Sept. 8 were “significantly below that maximum allocation in the area of 5,000, but could increase between now and the event,” the Upper Dublin Township website says. \n\nAccording to SEPTA, as of Sept. 15, 4,380 passes had been sold for Sept. 26 and 5,382 for Sept. 27 at the Fort Washington station. Passes will remain available for purchase through Friday, Sept. 25. \n\nTo put the numbers in perspective, SEPTA spokeswoman Jerri Williams said, the average number boarding at Fort Washington is 167 for Saturdays and 182 for Sundays, with average daily boards of 904 for an entire day. \n\nPolice, volunteers and signs will direct visitors to legal parking areas, which do not include parking in the neighborhoods of old Fort Washington and Elliger Park, where barricades will be set up to permit access for local traffic only in an effort to minimize the impact to those residents, the township said. \n\nEveryone is urged to carpool and use mass transit as available — including private buses — to reduce the number of vehicles. The township has created a map showing parking areas as well as the streets that will be barricaded and open only for local traffic. \n\nThe train station itself will be used for queuing riders, handicapped parking and support agencies. Summit Avenue in Whitemarsh Township (the driveway leading from Pennsylvania Avenue into the station) will be for buses only to enter the station. Station Avenue in Whitemarsh (the driveway from Bethlehem Pike into the station) will be open for pedestrians only. Pennsylvania Avenue and Bethlehem Pike will remain open to traffic. \n\nFor those driving private vehicles, passengers may be dropped off at two locations – the Fort Washington Train Station parking lot for vehicles approaching from the west or Bethlehem Pike side of the station by using the east end entrance on Pennsylvania Avenue; and the Holiday Inn parking lot, using the west end entrance, for vehicles approaching from the east (Commerce Drive and Turnpike) side of the station. Handicapped parking is also available at the Holiday Inn lot. \n\nApproved papal parking areas range from walking distances to the train station of 0.3 miles at Germantown Academy to 2.6 miles at Temple University Ambler. Germantown Academy has almost 1,000 parking spots, weather dependent, and will charge $30/day or $50 for the two days. There will be limited shuttle buses from Temple Ambler (900 spaces) — drivers may want to park there after dropping off passengers at the train station. \n\nParking at Fort Washington Elementary School (1.1 miles) and select lots at Upper Dublin High School (1.6 miles) — about 565 spaces total — is available for $20 per day per vehicle plus a small processing fee through the online purchase of vouchers at http://www.brownpapertickets.com/event/2224097 or search “Upper Dublin School District Parking - Papal Visit Weekend.” Comfort stations will be available in the Fort Washington Elementary School parking lot. There is no multi-day discount. A maximum 500 vouchers per day will be sold. Those completing the online purchasing process will be notified by email with a list of days, times and location for pickup of parking vouchers. \n\nOther designated parking include some areas in the Fort Washington Office Park: 550 Pinetown Road (1.4 miles); 440 Virginia Drive (1.4 miles); 580, 1015, & 1035 Virginia Drive (1.8 miles). The cost for parking will be up to those who own the lots. SEPTA’s 201 bus that goes through the office park will operate on a modified weekday schedule. \n\nFor drivers picking up passengers on the return trains, from 5:30 p.m. to 1 a.m. each day, a cellphone lot to wait has been set up at Executive Plaza, 540 Pennsylvania Ave. \n\nSign boards and police from several jurisdictions will be directing traffic both morning and night to keep traffic moving and ensure people get to their destinations. Comfort stations will be at the train station along with emergency services that may be needed. \n\nLocal streets in the old Fort Washington/Elliger Park neighborhoods will be barricaded and monitored from 4:30 a.m. to 12:30 p.m. Sept. 26 and 27. All residents and their guests are being asked to use Prospect Avenue (at Fort Washington Avenue or Bethlehem Pike) and Madison Avenue (at Highland Avenue) to come and go from the neighborhood during those hours. \n\nFire police will be manning those intersections to allow residents and their guests to enter and exit the neighborhoods. \n\nPennDOT and the Pennsylvania Turnpike have launched a detailed travelers’ website with real-time traffic conditions on highways in the Philadelphia region and details on how to reach the papal venues or take diversion routes for those who are merely traveling through or around the region. The site at www.papal511.com is linked both to PennDOT’s 511PA site and the Turnpike’s travelers’ information site and is accessible from both desktop and mobile interfaces. \n\nEditor’s Note: A previous version of this article stated there would be open parking at 185 Commerce Drive during the papal visit. That is not the case. Parking at 185 Commerce Drive will only be available to employees and customers of the businesses located on the property.", "source": "Ambler Gazette"}