{"published": "2015-09-10T18:19:07Z", "media-type": "News", "title": "Shoddy Plymouth pavements an 'insurance risk'", "id": "9053912c-ad48-406e-9b30-bc64906fbb63", "content": "PAVEMENTS in the city's suburbs are in such shoddy condition that they are putting the council at risk of insurance claims due to residents' falling over, a councillor has warned.\n\nEggbuckland councillor Lynda Bowyer said repairs to pavements in her ward had been a long time coming and called upon Plymouth City Council (PCC) to shape up.\n\nThe Conservative flagged-up Fort Austin Avenue and Goosewell Hill as being in especially dire need of attention.\n\n\"The situation is deplorable and the risk to residents of trips and falls is not acceptable, particularly with the winter months ahead,\" she said.\n\n\"The old adage applies that prevention is better than the cure and it is no consolation to my residents if they become embroiled in long-winded accident insurance claims.\"\n\nShe told The Herald she had personally inspected both Fort Austin Ave and Goosewell Hill where residents told her that a team from Amey, the council's highways contractor, visited and marked areas with white paint - but nothing more had been done.\n\n\"The paint has now actually worn away,\" added Mrs Bowyer.\n\nFellow Eggbuckland councillor and Tory group leader Ian Bowyer added: \"We made a manifesto pledge earlier this year to bring forward an improvement programme to tackle this increasing problem and we will do so again in 2016. In the meantime we will continue to press the council for action.\"\n\nLabour's Cllr Brian Vincent, responsible for the city's street environment, said Fort Austin Avenue was on the council's \"to do\" list for last month but repairs were pushed back due to the wet summer.\n\n\"Fort Austin Avenue is on our current footway resurfacing programme and work is scheduled for early October. Repairs were originally planned for the end of August but heavy rainfall over the summer caused delays to the programme,\" he explained.\n\n\"Goosewell Hill is on the list for future footway resurfacing programmes but we will send an inspector out and if there are any defects requiring immediate attention we will arrange for them to be repaired.\"", "source": "Plymouth Herald"}