{"published": "2015-09-02T16:13:00Z", "media-type": "News", "title": "Cloud Carib Deploys OnApp's VMware Portal to Cut Customer Onboarding Time by 50%", "id": "3aa20750-0127-4cfb-a255-85c571fbde45", "content": "SOURCE OnApp\n\nOnApp portal enhances vCloud Director and transforms the user experience for leading VMware vCloud Air Network provider\n\nVMworld, SAN FRANCISCO \n\nOnApp has announced that Cloud Carib is the latest cloud provider to deploy OnApp as its customer portal for VMware-based cloud services. Cloud Carib needed to replace the native VMware user interface to reduce customer onboarding time, simplify the user experience and ensure it could continue to deliver the latest VMware vCloud Director features to its clients. Cloud Carib chose OnApp after considering solutions from AirVM and Cloud Assert. Using OnApp's intuitive portal for VMware-based cloud services, Cloud Carib has cut the time needed to onboard new clients by 50%.\n\n(Logo: http://photos.prnewswire.com/prnh/20150723/240725LOGO )\n\nCloud Carib specializes in offshore cloud hosting from datacenters in Nassau, Bahamas \n\n\"A lot of customers struggle to get to grips with the native VMware interface, so we'd spend a great deal of time helping them learn how to manage their cloud service,\" said Stelios Xeroudakis, Director of Cloud Carib. \"OnApp has enabled us to cut our onboarding time in half. OnApp is intuitive and very robust. It's highly extensible and was easy to integrate with our statistics database, backup and disaster recovery solutions, billing and customer support systems. OnApp's portal stood well above the rest in terms of stability, maturity and ease of use - plus, OnApp's subscription based model is very cost-effective.\"\n\nAt the end of 2014, VMware announced that all new vCloud Director functionality would be accessible only via third party portals. The OnApp portal for vCloud Director has been in development since early 2014, and is now growing with support for a wide range of VMware vCloud Air Network applications, including vCenter and vCloud Air.\n\nCommenting on the news, OnApp CEO Ditlev Bredahl \n\n©2015 PR Newswire. All Rights Reserved.", "source": "KRHD TV"}