{"published": "2015-09-24T21:18:56Z", "media-type": "News", "title": "WABCO Holdings Now Covered by Barclays (WBC)", "id": "4464549a-40d7-4f7c-a4ca-a91299a74a18", "content": "Filed Under: Analysts New Coverage • Market News \n\nEquities research analysts at Barclays began coverage on shares of WABCO Holdings (NYSE:WBC) in a research report issued on Thursday, The Fly reports. The firm set an “equal weight” rating on the stock. \n\nShares of WABCO Holdings (NYSE:WBC) traded down 0.27% during trading on Thursday, hitting $104.15. The stock had a trading volume of 396,644 shares. The stock’s 50-day moving average is $115.96 and its 200-day moving average is $121.67. The stock has a market capitalization of $6.03 billion and a P/E ratio of 21.64. WABCO Holdings has a 12-month low of $85.22 and a 12-month high of $133.31. \n\nWABCO Holdings (NYSE:WBC) last announced its quarterly earnings data on Friday, July 24th. The company reported $1.40 earnings per share for the quarter, missing the Thomson Reuters’ consensus estimate of $1.44 by $0.04. The firm earned $661.10 million during the quarter, compared to the consensus estimate of $663.15 million. During the same period last year, the firm earned $1.42 EPS. WABCO Holdings’s quarterly revenue was down 10.1% compared to the same quarter last year. Analysts predict that WABCO Holdings will post $5.71 EPS for the current fiscal year. \n\nA number of other equities analysts have also recently commented on WBC. Zacks cut WABCO Holdings from a “hold” rating to a “sell” rating in a report on Tuesday. JPMorgan Chase & Co. lifted their price target on shares of WABCO Holdings from $111.00 to $131.00 in a research report on Friday, September 11th. Finally, Piper Jaffray restated an “outperform” rating and set a $137.00 price objective on shares of WABCO Holdings in a research report on Monday, June 22nd. One research analyst has rated the stock with a sell rating, four have given a hold rating and four have issued a buy rating to the company. The company currently has an average rating of “Hold” and an average price target of $130.45. \n\nWABCO Holdings Inc. is a worldwide provider of electronic, mechanical and mechatronic products. The Business develops, makes and sells control systems, including innovative braking, stability, suspension, transmission automation, air compression and processing. Its product groups contain actuator, air compressor and air processing/air management system, foundation brake, anti-lock braking system (NYSE:WBC), traditional braking system, electronic braking system (EBS), electronic and normal air suspension systems, transmission automation, vehicle electronic construction, vehicle electronic stability control and roll firmness support. Its alternatives include TX TRAILERGUARD fleet management solution, mBSP braking system platform that is modular, OptiPace, OptiFlow Tail alternative, OnGuardPLUS AEBS and OnGuardPLUS, amongst others. It sells its merchandises to truck and bus original equipment manufacturers (OEMs), trailer OEMs, commercial vehicle aftermarket vendors and car manufacturers. \n\nReceive News & Ratings for WABCO Holdings Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for WABCO Holdings and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News"}