{"published": "2015-09-30T07:00:00Z", "media-type": "News", "title": "Gorge Quilt Show moves to October", "id": "1245dc62-9c1a-4431-a529-942cf835e0a8", "content": "The Columbia River Gorge Quilters’ Guild (CRGQG) will be presenting its annual Quilt Show at a new place and date, the Hood River Armory, Oct. 23-24. \n \n“We have moved the show from August to October because we felt the colorful, warm nature of quilts is a perfect fit with the autumn harvest events in Hood River. Plus the Armory is right on the Fruit Loop scenic drive so visitors can easily find our show,” said Guild president Kim Vogel. \n \nThe Guild is bringing highly qualified teachers to Hood River for three classes open to everyone. Space is still available in the classes offered. You can find class descriptions and enrollment information at www.gorgequiltersguild.org. \n \n“We’ve titled this year’s show ‘Discover Quilting!’ because so much is changing in quilting today,” Vogel said. “Young people around the world have created a whole new modern quilt movement. And artists who want more texture and dimension are producing outstanding abstract and representational work in the form of wall quilts. We find viewers are both surprised and delighted by these new directions.” \n \nThe show features the current traditional and contemporary work by local quilt makers in communities throughout the Columbia River Gorge and will exhibit more than 100 quilts representing all forms of quilting. The show will also include demonstrations, vendors and Quilters’ Market. Guild members clean out their sewing rooms and show attendees get great deals on fabric, magazines, books, patterns, tools and more. The market also features new items made by our members. \n \nHarvest Quilt fundraiser: The Harvest Quilt is a yearly community fundraiser for a local non-profit. This year, Hood River Adopt A Dog is is the recipient of the quilt and is raising money by selling raffle tickets. The quilt is being shown around town and tickets are being sold at ETC — Every Thread Counts, Gorge Dog, and Hood River Adopt A Dog, 3910 Heron Drive, in Odell. Tickets are 1 for $2, 3 for $5, or 7 for $1", "source": "Hood River News"}