{"published": "2015-09-15T10:56:14Z", "media-type": "News", "title": "There Was A Street Party In Support Of A Prisoner Who's Been Protesting On A Prison Roof For Two Days", "id": "f0b1e5e0-9523-4ac1-b3ca-9952efd795b5", "content": "A man serving life in prison for killing his uncle has been on the roof of a maximum security prison in Manchester for almost 48 hours in protest at the conditions prisoners live in.    \nView this image › \n  \nStuart Horner, on the roof of HMP Manchester  Oli Scarff / AFP /  \n   Stuart Horner, 35, has been on the precarious rooftops of HMP Manchester – locally known as Strangeways – since Sunday night and shows no signs of giving himself up.        \nOli Scarff / AFP /  \n        \nOLI SCARFF / Stringer \n      When he first took to the roof in the Manchester drizzle, Horner was wearing just boxer shorts, but he did later put on his prison issue pyjamas.    \nView this image › \n  \n Peter Byrne / PA WIRE \n     \nInmates shouting to Horner to 'get on the roof for a picture'. This was him last night \n— Katie Butler (@KatieButlerMEN)      Prison guards scaled ladders and used a cherry picker in an attempted to talk him down, but their efforts were met with Horner climbing higher and into more precarious positions.    \nView this image › \n  \n Peter Byrne / PA WIRE \n   On Monday night there was an impromptu “street party” in support of Horner outside the jail.    \nStill a big crowd gathered for this 'street party' outside #Strsngeways but the rain is coming down heavily now. \n— Chris Slater (@chrisslaterMEN)      There was even a soundsystem and fireworks.    \nParty time outside strangeways tonight !! \n— Darren Seville (@dseville76)        \nOnly Manchester can make a street party with fireworks and music for a Strangeways prisoner that's escaped and protesting on the roof  \n— tmaze_x (@TMAZE_SIMMS)      From behind the prison wall reporters heard shouts of encouragement from other prisoners for Horner’s protest, which is related to conditions in the category A prison.  \nPrisoners were heard chanting “We shall not be moved” and “There’s only one Stuart Horner” the Manchester Evening News  reported . \n \nHe was seen smashing skylight windows and damaged plastic corrugated roofing. At one point he was seen shimmying up a pole then dangling from it, despite later shouting that he was “afraid of heights”. \n \nStrangeways was the scene of major rioting in 1990. \n \nHorner was sentenced to 27 years in jail in 2012 at Manchester Crown Court for the murder of his uncle, Ian Taylor, who was 44. \n \nAfter 11 hours’ deliberation, a jury decided he shot Taylor in the chest with a sawn-off shotgun in June 2011, but Horner protested his innocence in court. \n   Speaking to an MEN reporter, Horner said the prison needed to “Get more fucking staff!”    \nHorner taking to the MEN \n— Todd Fitzgerald (@TFitzgeraldMEN)      Shouting from the roof, Horner claimed that prison staff had handed him food, drinks, blankets and a tracksuit. He said he would stay for 40 days and 40 nights.    \nView this image › \n  \n Peter Byrne / PA WIRE \n   By Monday night he had scrawled on to a t-shirt: “It’s not 1990 – tell the government we’ve all had enough – sort the whole system.”    \nStuart Horner, the Strangeways protester, on the aim of his roof-top demonstration \n— Todd Fitzgerald (@TFitzgeraldMEN)      By Tuesday morning, he was wearing a shirt emblazoned with just one word: “INNOCENT”.    \nPic by @sean_hansford \n— Katie Butler (@KatieButlerMEN)      A crowd – including friends and relatives of other inmates – has been gathering at the prison north of Manchester city centre to watch his next move.    \nView this image › \n  \n Peter Byrne / PA WIRE \n     \nCrowds watching \"Spider-Man\" Stuart Horner from outside the walls of Strangeways jail. \n— Patrick Hurst (@paddyhurst)      Roads surrounding the jail have been closed and a local solicitors firm tweeted that visits to the prison had been cancelled while the stand-off continues.    \nNo visits to Strangeways while this goes on. https://t.co/7WpfIOcNKu \n— Olliers Solicitors (@ollierssltd)      Early on Tuesday morning, Horner had found refuge in the Victorian prison’s central tower by smashing a window.        \nGoogle Maps \n        \nGoogle Maps \n      But later on he was still going strong, smashing roof tiles with a pole.    \nHorner smashing jail roof \n— Patrick Hurst (@paddyhurst)      \nGreater Manchester police said in a statement: “Police were called to HMP Manchester shortly after 3.30pm on Sunday 13 September to reports a prisoner was on the roof. \n \n“The man is conducting a lone protest and has managed to get onto the top of the main building and cause damage to the roof. Staff at the prison are working to engage with the prisoner and resolve this situation, but he has remained on the roof overnight.” \n \nA Prison Service spokesperson said: “An incident at height involving a prisoner is ongoing at HMP Manchester. Negotiators are at the prison and are working to safely resolve the situation.” \n   \nCheck out more articles on BuzzFeed.com!", "source": "BuzzFeed"}