{"published": "2015-09-16T19:03:44Z", "media-type": "News", "title": "For mildly obese diabetics, weight loss surgery may be helpful", "id": "d0d9899c-dfac-49ea-9041-b22ca5bcae64", "content": "3:03 p.m. EDT \n \nBy Andrew  M. Seaman \n \n(Reuters Health) - The benefits of weight loss surgery for mildly obese people with type 2 diabetes can last at least five years, according to a new study. \n \nIt's still to early to say whether mildly obese people with diabetes live longer after weight loss surgery than those who receive non-surgical treatments, however. \n \n\"The mortality data take a long time to show up,\" said Dr. Robin Blackstone, a weight loss surgery expert who wrote an editorial on the new study in JAMA Surgery. \n \nWeight loss operations, or bariatric surgery, use various methods to shrink the size of the stomach. They reduce hunger and limit the body's ability to absorb food. \n \nOver the years, bariatric surgeries have proved effective for treating type 2 diabetes, but most studies were done in people who are morbidly obese, with a body mass index (BMI) of 35 or above. \n \nBMI, a measure of weight in relation to height, is considered normal between 18.5 and 24.9. A BMI of 25 or higher indicates that someone is overweight, and people with a BMI over 30 are considered obese. (You can calculate your BMI here:  http://1.usa.gov/1D0ZqDv.) \n \nFor the new study, researchers from Taiwan's Min-Sheng General Hospital used data collected since 2007 in a trial comparing two kinds of bariatric surgery - gastric bypass and sleeve gastrectomy - to medical treatments for type 2 diabetes in people who were mildly obese. \n \nThe average BMI among those who had surgery fell from 31 to 24.5 by the end of their fifth year in the study. Meanwhile, the BMI among those receiving non-surgical diabetes treatments stayed about the same at 29. \n \nAmong those who had surgery, diabetes resolved completely in 36 percent and partially in 28 percent. In the medically-treated group, by comparison, diabetes resolved completely in only 1 percent and partially in only about 2 percent. \n \nIn addition, control of blood pressure, triglycerides, and \"bad\" LDL cholesterol \"was generally better in the surgical group,\" the authors found. \n \nThe researchers also monitored patients' blood levels of hemoglobin A1c, which reflect blood sugar levels over time. Hemoglobin A1c is best kept below 7 percent, the researchers write. After surgery, the average hemoglobin A1c level fell from about 9 percent to about 6 percent. In the medical therapy group, however, it remained steady at about 8 percent. \n \nBut this better \"glycemic control\" - as reflected by the improved hemoglobin A1c levels - did not reduce the mortality rate at five years, according to lead researcher Dr. Chih-Cheng Hsu and colleagues. \n \nThe research team also compared average outcomes with the two types of surgery. At the fifth year, compared to the sleeve gastrectomy group, the bypass surgery group had lost more weight (18.7 vs 14.2 kg), achieved larger drops in BMI (7.4 vs 5.1) and in hemoglobin A1c (3.1 percent vs 2.1 percent) and were more likely to have complete diabetes remission (46.9 percent vs 16.7 percent). \n \nWhile the new study does not show a survival benefit or surgery after five years, there is evidence from a study of heavier people in Sweden that surgery does lead to a longer life, says Blackstone, of the University of Arizona College of Medicine–Phoenix. \n \nIn the Swedish study, obese people who had bariatric surgery were about 29 percent less likely to die over 15 years, compared to a group who tried more conventional methods. \n \nThough the new study didn't show a benefit in survival among surgery patients, Blackstone said it's reassuring for people with a BMI under 35 interested in the procedure. \n \n\"This is where this paper is critical, because it says this surgery is safe in that lower BMI group,\" with no increased risk of death or renal disease, she said. \n \nBlackstone added that people and their doctors should start taking weight seriously once the patient's BMI falls between 27 and 30. \n \n\"I think we wait too long to get people to be serious about this,\" she said. \"I think that once they’ve accumulated these genetic changes that hardwired their bodies into obesity and diabetes, reversing that is really hard.\" \n \nSOURCE: http://bit.ly/1Lyse9K and http://bit.ly/1LyshCl JAMA Surgery, online September 16, 2", "source": "WHTC.com"}