{"published": "2015-09-30T01:13:14Z", "media-type": "News", "title": "Money crunch means fewer road projects", "id": "6ecc6060-61e3-422a-abe1-e9655cb0baea", "content": "Road and bridge improvements will continue and, occasionally, a new project, such as the new Interstate 57 interchange in Bourbonnais, will happen, but projects like that will be the exception rather than the rule. \n  \nAs the Illinois Department of Transportation rolls out its proposed five-year, $8.3 billion plan, the 2016-21 Highway Improvement Program, officials admit it falls far short of what is needed and they are bracing the public for even darker days ahead. \n \nAt its first meeting with the public regarding its proposed infrastructure plan on Monday afternoon in Bourbonnais, Thomas Magolan, programming engineer for District 3, the district including Kankakee, Will, Iroquois and Grundy counties among others, said money is in short supply while potential projects continue to mount. \n \nIDOT notes 83 percent of the state’s highways and 93 percent of its bridges are in acceptable condition. Without some new infusion of money, those percentages will fall — or more fittingly, crumble. \n \nBy 2021, the department estimates only 62 percent of the highways and 86 percent of the bridges will be rated acceptable. \n \nMagellan said the present funding system, mainly the taxes from fuel sales and vehicle registration, are not increasing. \n \n“There’s less coming in than you want from fuel taxes as vehicles become more efficient and people are driving less,” he said. “Registration revenues are flat.” \n \nThat leaves not just this region in a difficult position, but the entire state as well. \n \n“It’s very hard to keep up with the needs, but you plow forward with the money you have,” he said. \n \nSo, while projects, such as the recently started 6000N Road interchange, begin in Bourbonnais, plans for redevelopment of the I-57 interchange at East Court Street remain in the engineering stage as there are no funds — easily $30 million to $40 million — for reconstruction of the out-of-date interchange. \n \n“I couldn’t speculate when that could be funded,” Magolan said. “It depends on our revenue sources.” \n \nSo, as current funding streams remain flat at best, what options are available? \n \nIncrease of the state’s 19-cent-per-gallon gas tax is an option. The tax hasn’t been increased for 25 years. Developing a formula to tax motorists on how much they drive is another. Selling government bonds is yet another. \n \nNone of them, however, will be met with cheers from the public. \n \n“The state won’t be able to do what it needs to do with the available funds,” he said. “These are interesting times.” \n \nConcerning the five-year improvement plan, $7.5 billion comes from federal government and the remainder from state and local sources. \n \nOf the approximate $301 million proposed for District 3 in the five-year plan, Interstate 57 from near Iroquois County to Illinois Route 50 at Bourbonnais will be resurfaced, a total of 11.6 miles. The project includes a new bridge deck under Waldron Road and a new bridge at North Street. Projected cost is $41.5 million. \n \nIllinois Route 102 at Rock Creek, about 6.5 miles northwest of Bourbonnais, also is planned for a new bridge at a cost of $4.3 million. \n \nI-57 from the Champaign County line to the Iroquois County line at Ford County will be resurfaced, a distance of 6.4 miles, and includes bridge and curb repairs at a cost of $15.5 million.", "source": "InOttawa.com"}