{"published": "2015-09-16T19:17:36Z", "media-type": "News", "title": "Review: Chris Brown wins over Phoenix crowd", "id": "66e5e86a-58fc-4527-8745-80b7ed89a5d0", "content": "Chris Brown performs at US Airways Center, Tuesday, September 15, 2015, in Phoenix. (Photo: Jeffrey Lowman/The Republic) \n\nChris Brown belongs on that rarefied list of celebrities who have gone from media darling to public-relations nightmare and come out on the other side of a controversy as popular as ever with his fans. No one could forget the events of 2009 and the horrifying TMZ image of Brown’s then-girlfriend Rihanna taken after his 2009 domestic violence arrest but given the way his career only suffered a minor speed bump before returning to its previous ascendant trajectory, fans seemed more willing to forgive, as did Rihanna herself, who reunited with him for a time. Subsequent violent altercations with Drake and Frank Ocean also appeared to have no lasting effect. Fighting with fellow artists? That just what hip-hop artists have always done. \n\nAnd judging from Tuesday’s triumphant and densely populated show at US Airways Center, the events of 2009 would seem a lifetime ago to an audience of mostly women in their early 20s. (Brown himself is in fact is a mere 26.)  What they squealed and cheered at for the near two-hour show was a performer who seemed genuinely happy and humbled to be doing his job (the concert opened with a film of Brown and his troup of dancers and musicians engaged in a pre-show prayer, shot in black and white so you know it was real.)  and a performer at the peak of his powers. \n\nJust think of what thousands of hours of community service and anger-management courses could do for you! \n\nThe spectre of Michael Jackson, another tarnished star who never got to a concert-stage reconciliation with his constituency, hung over the proceedings. Jacko was the ultimate inspiration for Brown, who was discovered at age 13, and the preshow music was wall-to-wall Michael with nothing past \"Dangerous\" making the Brown playlist. In the aisles, a fan began popping and moonwalking as well as Brown would do later in the show and getting almost as loud and appreciative recognition from the filled-up arena until security ordered him back to his seat (insert your boos and catcalls here). \n\nStarting \"Run It!\" against a backdrop of oversized beat boxes and a bed of flames, Brown raced through his discography with all the time management of a tourist trying to cover the Louvre in two hours. Not that all of Brown’s songs are masterpieces. When someone of Prince's caliber truncates a \"Little Red Corvette,\" people get mighty upset. But since Chris Brown songs rarely venture to someplace different than their starting point, getting a verse and a chorus of \"Deuces\" or \"Poppin\" or \"Take it to the Head\" is enough of a sampler to keep fans satisfied that he did the whole song. \n\nAnd rather like speed-dating, his interaction with the audience was limited to quick queries of \"Are you ready to rock?” and \"Would you like to hear some more?\" Whereas most performers milk running into the audience for a good 15 minutes of Instagram photo opportunities, Brown stayed and danced onstage throughout (even during French Montana’s miniset at the end of his set). Only once did his head venture over the first row. \n\nHe worked and he worked, accepted every twerk in the graciousness that it was delivered and sang with prerecorded duet partners (like Lil Wayne in the hilarious encore \"Loyal\") like they were there. All the performances were to pre-recorded tracks. Although a live rhythym section was present and obscured above the lights and the dancers, their contributions were hardly noticed. \n\nThe AV team behind this show really earned their merit badge during what I like to call the \"Salute to Inebriation\" portion of the show, starting with \"Liquor,\" where Brown sang while two dancers in black lingerie groveled at his feet and the video feed showed the images back to the audience filtered through glazed-over, slurred vision. Then during \"Drunk Texting,\" the words to the song about \"burning up your line\" covered the backdrop in text bubbles, looking like something out of a telecom convention's dream. \n\nOnce the drowsy intro to this number started, a young woman in the row behind me screamed -- and I mean SCREAMED -- \"THAT'S MY SONG!\"  If ever you’ve gotten a glimpse into a life you're glad you didn't live, this was it. And in that moment of solidarity with an arena full of hit-send regretters singing his words back to him, Chris Brown could truly be called the spokeperson of his generation. \n\nSetlist \n\nRun It! \n\nMedley: Excuse Me Miss/ Poppin'/ Deuces \n\nStrip \n\nCame To Do \n\nLove More \n\nLook At Me Now \n\nShe Ain't You \n\nMedley: Wet the Bed/ 2012 \n\nTake You Down \n\nMedley: Another Round/ Body 2 Body/ Don't Judge Me \n\nWith You \n\nLiquor \n\nDrunk Texting \n\nMedley: Don't Think They Know/ All Eyes on You/ Take It to the Head/ How Many Times \n\nNew Flame \n\nFive More Hours \n\nShow Me (w/ Kid Ink) \n\nFrench Montana Set: Ocho Cinco/ Off The Rip/ Pop That /Ain't Worried About Nothin' \n\nEncore \n\nAyo \n\nLoyal \n\nRead or Share this story: http://azc.cc/1iPwASS", "source": "AZCentral.com"}