{"published": "2015-09-24T20:35:40Z", "media-type": "News", "title": "Intrepid Potash Sets New 52-Week Low at $5.40 (IPI)", "id": "c93d6bdc-63c3-4fa8-8a9f-2c0cf4693620", "content": "Intrepid Potash (NYSE:IPI)’s share price hit a new 52-week low during trading on Thursday , MarketBeat reports. The stock traded as low as $5.40 and last traded at $5.77, with a volume of 616,831 shares trading hands. The stock had previously closed at $5.56. \n\nIPI has been the subject of several recent analyst reports. Susquehanna reduced their price target on shares of Intrepid Potash from $14.00 to $12.00 and set a “neutral” rating on the stock in a research report on Wednesday, July 22nd. Zacks upgraded shares of Intrepid Potash from a “hold” rating to a “buy” rating and set a $12.00 price objective on the stock in a report on Tuesday, July 14th. Finally, Scotiabank cut their price target on shares of Intrepid Potash from $13.00 to $10.50 in a report on Wednesday, July 29th. Six analysts have rated the stock with a hold rating, Intrepid Potash currently has a consensus rating of “Hold” and an average price target of $11.92. \n\nThe company has a market cap of $453.44 million and a P/E ratio of 74.88. The firm’s 50-day moving average price is $7.51 and its 200 day moving average price is $10.43. \n\nIntrepid Potash (NYSE:IPI) last released its earnings results on Tuesday, July 28th. The company reported ($0.08) earnings per share (EPS) for the quarter, missing the Zacks’ consensus estimate of $0.01 by $0.09. The firm had revenue of $73.65 million for the quarter, compared to analyst estimates of $78.99 million. During the same period last year, the firm earned $0.07 earnings per share. The firm’s quarterly revenue was down 33.6% on a year-over-year basis. Analysts expect that Intrepid Potash will post ($0.01) EPS for the current year. \n\nIn other news, CEO Robert P. Jornayvaz III bought 39,968 shares of Intrepid Potash stock in a transaction that occurred on Wednesday, September 23rd. The shares were purchased at an average price of $5.87 per share, with a total value of $234,612.16. Following the completion of the acquisition, the chief executive officer now directly owns 118,476 shares in the company, valued at $695,454.12. The acquisition was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through this hyperlink. Also, CEO Robert P. Jornayvaz III bought 15,720 shares of Intrepid Potash stock in a transaction that occurred on Tuesday, September 22nd. The stock was purchased at an average cost of $6.16 per share, for a total transaction of $96,835.20. Following the acquisition, the chief executive officer now owns 118,476 shares of the company’s stock, valued at $729,812.16. The disclosure for this purchase can be found here. \n\nIntrepid Potash, Inc. is a manufacturer of muriate of potash (NYSE:IPI) and langbeinite (sulfate of potash magnesia) in the United States. The Organization sells potash and Threesome to the agricultural marketplace as a fertilizer. The Company also sells create salt, magnesium chloride and metal recovery salts from its potash mining procedures. The Business possesses two standard underground facilities which might be utilized for making potash and three solution mining facilities. Its solution mining generation comes from the HB solar solution mine near Carlsbad, New Mexico, a solar solution mine near Moab, Utah and a solar evaporation shallow brine mine in Wendover, Utah. The Company’s conventional generation comes from its underground West and East mines near Carlsbad, New Mexico, which services the HB and West mines. \n\nReceive News & Ratings for Intrepid Potash Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Intrepid Potash and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News"}