{"published": "2015-09-16T15:10:23Z", "media-type": "Blog", "title": "New Porous Hydrogel Could Improve the Success of Stem Cell Tissue Regeneration", "id": "6987adbd-31ce-4e3b-84f7-af6e2a795a1c", "content": "New Porous Hydrogel Could Improve the Success of Stem Cell Tissue Regeneration\tGreetings, New Porous Hydrogel Could Improve the Success of Stem Cell Tissue Regeneration A New Porous Hydrogel Could Boost the Success of Stem-Cell Tissue Regeneration\nIn this image, new bone structure has formed after stem cells were transplanted using the novel hydrogel strategy developed at the Wyss Institute.\nUsing a new porous hydrogel, scientists have experimentally improved bone repair by boosting the survival rate of transplanted stem cells and influencing their cell differentiation. Possible stem cell therapies often are limited by low survival of transplanted stem cells and the lack of precise control over their differentiation into the cell types needed to repair or replace injured tissues. A team led by David Mooney, a core faculty member at Harvard’s Wyss Institute, has now developed a strategy that has experimentally improved bone repair by boosting the survival rate of transplanted stem cells and influencing their cell differentiation. The method embeds stem cells into porous, transplantable hydrogels.\nIn addition to Mooney, the team included Georg Duda, a Wyss associate faculty member and director of the Julius Wolff Institute for Biomechanics and Musculoskeletal Regeneration at Charité – Universitätsmedizin in Berlin, and Wyss Institute founding director Donald Ingber. The team published its findings in today’s issue of Nature Materials. Mooney is also the Robert P. Pinkas Family Professor of Bioengineering at the Harvard John A. Paulson School of Engineering and Applied Sciences. Stem cell therapies have potential for repairing many tissues and bones, or even for replacing organs. Tissue-specific stem cells can now be generated in the laboratory. However, no matter how well they grow in the lab, stem cells must survive and function properly after transplantation. Getting them to do so has been a major challenge for researchers…..More Related", "source": "Hiram's 1555 Blog"}