{"published": "2015-09-25T14:28:06Z", "media-type": "News", "title": "Man waits 18 days to be first in line to buy new iPhone6s", "id": "03dcfbc1-dd95-4bdd-9547-42e69da6e000", "content": "How many iPhones can Apple Inc. sell? \n \nWith the company hitting sales records with each annual release, that’s a question facing Chief Executive Officer Tim Cook as the latest batch of handsets began landing in stores Friday around the world. The newest models, following a hugely popular design overhaul last year that added bigger screens, may not match the success of previous releases, according to analysts. \n\nDemand for the new iPhones appears lower than last year, “possibly meaningfully so,” said Andy Hargreaves, an analyst at Pacific Crest Securities who studied Google search data, shipment times and third-party surveys. Analysts at Sanford C. Bernstein & Co. and RBC Capital Markets also raised concerns about iPhone growth. Since 2013, iPhone sales have increased an average of about 35 per cent each quarter. In October to December last year, Apple sold 74.6 million iPhones—about 34,000 iPhone purchases per hour. \n\nExpectations are tempered partly because the gadget is at the point in its two-year design cycle that entails less dramatic changes. In the first year, Apple generally overhauls the device’s hardware, including its look and feel. For the following year’s model, designated with an “s” tacked on to the number, the Cupertino, Calif.-based company makes more subtle improvements. \n\nThe iPhone 6s and 6s Plus resemble last year’s versions but sport new features such as 3D Touch, which provides a shortcut for checking mail, taking pictures and other functions when the user presses down on the screen. Apple also added an improved camera and zippier processor. \n\nWhether Apple can match last year’s demand will be determined as handsets hit stores Friday in New Zealand, Australia, Japan, Singapore, China, Hong Kong, France, Germany, the U.K., Canada, the U.S. and Puerto Rico. They will go on sale in more than 130 countries by year-end, according to Apple. \n\nCustomers around Asia again lined up to be among the first to get their hands on the device. Stores in China—Apple’s largest market outside the U.S.—drew faithful buyers like Wu Kai, who picked up two phones from a packed Apple outlet at Beijing’s Xidan Joycity mall. \n\n“Apple products are becoming family members,” the 17-year- old student said, explaining how he and his parents rely on every Apple product from the Mac Pro to the iPad. “It’s just good product that’s shaping our everyday life.” \n\nCook has said he expects the world’s second-largest economy to eventually become Apple’s largest market. Greater China accounted for 27 percent of revenue in the June quarter, more than all of Europe, and remains a swing factor for the company’s iPhone-reliant earnings. \n\nThere were signs however that iPhone sales there may have slowed, after Apple reported moving 47.5 million units in the latest quarter, missing analysts’ projections for 48.8 million. \n\nIn Sydney, hundreds braved heavy rain outside Apple’s city-centre store. Freelance technology journalist Lindsay Handmer, 32, waited for 18 days in front of the shop to be the first, showering at a local gym and using the toilets at a McDonald’s. He plans to auction his two new phones for a charity that helps the homeless. \n\nOver in Berlin, about 400 people waited under clear skies on the main shopping boulevard Kurfuerstendamm. First in line was Helge Bruhn, a 47-year-old Berliner who had camped outside the Apple store for seven days. \n\n“It’s the atmosphere, and about meeting new friends,” he said, shortly before the shop opened to cheers from the customers. \n\nAbout 200 people waited outside Apple’s store on London’s Regent Street, then cheered and applauded as the doors opened. First customers sported beaming smiles and gave out high-five’s, hugs and handshakes while pumping their fist in the air and holding up their purchase proudly. \n\n“I’ve queued up for past iPhone launches all around the world—last time it was in New York,” said Moey Shawash, 31, who flew in from South Africa to be the first in line. “I am so excited about its new color, re-engineered model, 3D Touch and camera.” \n\nA smooth release is critical for Apple, which generates more than 60 per cent of its revenue from the phone. Cook is attempting to expand other businesses, but the portion of sales coming from the iPhone continues to grow. The Apple Watch hasn’t become a mainstream success and iPad sales are in decline. \n\nThe iPhone’s weight in Apple’s results has put further investor focus on the device’s performance. The stock through Thursday was down 14 per cent from its high in February, in part because of concerns that the device can’t sustain its run of unprecedented growth. The shares rose 0.6 per cent to the equivalent of $115.68 in German trading at 10:08 a.m. in Frankfurt. \n\nApple last week predicted it would top last year’s opening- weekend sales record of 10 million units, although that figure is boosted by availability this year in China, which wasn’t part of the initial rollout last year. A better gauge for how the device is selling will come in January, when the company reports sales for the holiday quarter. \n\n“The biggest area of interest for investors is the December quarter. The major concern is whether they won’t be able to grow off that very difficult comparable to last year,” said Walter Piecyk, an analyst at BTIG LLC in New York, who is predicting an 8 per cent rise in shipments to 80 million. “If you can’t grow the number of phones you’re selling, you’re not going to grow earnings.”", "source": "MSN Money Canada"}