{"published": "2015-09-29T16:23:18Z", "media-type": "News", "title": "Wanted fugitive captured in Mexico", "id": "ccafd27b-5b2a-4129-89d8-f0a542e8fa12", "content": "A fugitive accused of kidnapping women off the streets and raping them has been arrested in Mexico after 24 years on the run, authorities said. \n\nPaul Jackson was recently featured on CNN's \"The Hunt With John Walsh.\" He was arrested Monday in Guadalajara, where he had reportedly adopted the name Paul Bennett Hamilton, the U.S. Marshals Service said. \n\nHe was indicted by a Washington County, Oregon, grand jury on the rape and kidnapping charges in June 1990. His half-brother, Vance Roberts, was also accused. \n\nA trial date was set, and Roberts and Jackson were released on bond. But in February 1991, the two men fled. \n\nRoberts, who was profiled on \"America's Most Wanted\" over a decade ago, turned himself in after 15 years on the run. A jury found him guilty and sentenced him to 108 years in prison. \n\nBut Jackson had been much more elusive. \n\n'A modern-day dungeon' \n\nWalsh, who has spent over a decade trying to help find violent fugitives, described Jackson as \"one of my most wanted guys.\" \n\n\"He and his pervert, creepy brother kidnapped women off the streets and kept them in their house -- tortured them, locked them in the closet, kept them in like a modern-day dungeon,\" he said. \n\nAndrea Hood was one of those women. She was only 17 when she was abducted by Jackson and Roberts. For two days she was tortured, repeatedly raped and sometimes chained to a bed. \n\nHer captors had wanted her to read a book about subservient women. She told them she would, and they unchained one of her hands to turn the pages. \n\nAfter she was left alone, she quickly freed her arm and other legs, grabbed one of the many firearms around the house. Hood smashed a window with the gun, climbed through the broken glass and ran for her life. \n\n\"I ran down the street hysterically crying, and bleeding all over,\" she told \"The Hunt with John Walsh.\" \n\n\"I was scared that they were literally right behind me.\" \n\nTwo years before Hood's ordeal, Michaelle Dierich went through almost the same experience: abducted by two men in a pickup truck, chained up in a closet, sexually tortured and brutalized for days. \n\nDuring Roberts' sentencing, Dierich took the stand and described the torment in the house. \n\n\"You brutalized me; you terrorized me,\" she said. \"You left me mentally and emotionally crippled beyond words or expression.\" \n\nFinally captured \n\nAlmost a decade after his half-brother turned himself in, Jackson was arrested on his way to work at an electronics store, Deputy Eric Wahlstrom of the U.S. Marshals Service Oregon Fugitive Task Force told CNN. \n\nA date has not yet been set for Jackson's return to the United States. Authorities believe he has been living in Mexico for several years. \n\nWahlstrom said the episode of \"The Hunt\" played \"a significant role\" in his capture. \n\n\"It's what started this,\" he said. \"It was a specific tip that came in right after (the episode) aired that led authorities to him in Guadalajara.\"", "source": "KODE TV"}