{"published": "2015-09-17T11:56:01Z", "media-type": "News", "title": "Today’s Pre-Market Information: Power Solutions International, Inc. (PSIX), Flanigan’s Enterprises Inc. (BDL), Ceres, Inc. (CERE), Albemarle Corporation (ALB), Cencosud S.A. (CNCO)", "id": "46080110-f484-4121-b6fa-c524e9362296", "content": ": \n \nPower Solutions International, Inc. ( PSIX ) finished up on Wed with a 7 day performance of 9.19% ending the day at $30.9, up 1.51%. Wallstreet sold at a volume of 92,313 shares and relative volume of 0.74. Power Solutions International, Inc. ( PSIX ) is at a quarterly performance of -40.73% and is performing from the company’s 52 week low by 13.64% with an overall debt to equity ratio of 1.67. Power Solutions International, Inc. ( PSIX )’s monthly performance comes in at -1.59%, with a profit margin of 4.70%, total insider transactions 0.22% with 10.75 million shares outstanding. Power Solutions International, Inc. ( PSIX ) is a good stock in the Diversified Machinery industry with an polled analyst rating of 1.8 and EPS growth this year of 210.90% \n \nFlanigan’s Enterprises Inc. ( BDL ) of the Specialty Eateries sector closed out the day Wednesday at $26.94, a loss of -3.44% with a return on investment of 14.10% trading at a volume of 262 shares. Flanigan’s Enterprises Inc. ( BDL ) is performing below average with a weekly performance of -1.86% moving into this week with a quarterly performance of -6.36% and a 52 week low of 59.29%. Flanigan’s Enterprises Inc. ( BDL )’s monthly performance sits at -0.41%, profit margin 3.20%, -0.83% insider transactions. Flanigan’s Enterprises Inc. ( BDL ) is a good stock in the Specialty Eateries industry and EPS growth this year of 40.60% \n \nCeres, Inc. ( CERE ) ended the day Wednesday at $1.11, a gain of 0.91%, after trading at a volume of 173,695 shares and market cap of 9.81. Ceres, Inc. ( CERE ) is performing above average at a weekly performance of 0.00% and a quarterly performance of -51.53% off their 52 week low by 23.33%. Ceres, Inc. ( CERE )’s monthly performance is -28.85%, 0.00% insider transactions and for the upcoming day, Ceres, Inc. ( CERE ) is a good stock in the Agricultural Chemicals industry with an averaged analyst rating of 1 and EPS growth this year of 38.20% \n \nAlbemarle Corporation ( ALB ) of the Basic Materials sector closed Wed. at $44.74 with a gain of 1.06%, trading at a volume of 1,408,842 shares. Albemarle Corporation ( ALB ) is performing above average with a weekly performance of 4.70% moving this week with a quarterly performance of -22.92% performing off their 52 week low by 8.30%. Albemarle Corporation ( ALB )’s monthly performance is -12.98% , profit margin 4.90%, 2.06% insider transactions and, Albemarle Corporation ( ALB ) is a good stock in the Specialty Chemicals industry with an averaged analyst rating of 2.4 and EPS growth this year of -47.20% \n \nCencosud S.A. ( CNCO ) closed at $6.82 Wednesday, a gain of 5.41%, trading at a volume of 32,781 shares. Cencosud S.A. ( CNCO ) is performing above average at a weekly performance of 8.95% moving into today with a quarterly performance of -8.46% and against their 52 week low by 31.15%. Cencosud S.A. ( CNCO )’s monthly performance of 17.59% . Cencosud S.A. ( CNCO ) is a good stock in the Specialty Retail, Other industry with an averaged analyst rating of 2", "source": "WallStreetScope.com"}