{"published": "2015-09-08T16:12:09Z", "media-type": "News", "title": "GE wins U.S., European antitrust approval to b...", "id": "78b2a7a3-f42e-4f4e-b9d7-d51ee1f2afe7", "content": "10:11 a.m. EDT \n \nWASHINGTON (Reuters) - General Electric won U.S. and European antitrust approval to buy Alstom's power unit on condition that some of the French company's assets would be sold. \n \nBoth the U.S. Justice Department and European Union announced on Tuesday that they would approve the 12.4-billion-euro ($13.9 billion) deal on condition that Alstom subsidiary Power Systems Manufacturing would be divested. \n \nThe unit, which provides aftermarket parts and services for gas turbines, will be sold to Ansaldo Energia, which is 40 percent owned by Italian state-backed investment fund Fondo Strategico Italiano and another 40 percent by China's Shanghai Electric . \n \nAccording to the U.S. Justice Department’s complaint, only three competitors, including GE and Power Systems Manufacturing, develop, manufacture and sell new aftermarket parts to repair and service GE 7FA gas turbines installed in the United States. \n \nEuropean Competition Commissioner Margrethe Vestager told a news conference that Ansaldo was already an established player in the heavy duty gas turbine market and, with the addition of Alstom's assets, would be able to replace Alstom in the market. \n \nWithout this divestiture, Alstom turbines risked disappearing from the market which could result in less choice and higher prices, with an impact on the cost of electricity, she said. \n \n\"It (the merger decision) illustrates that Europe is open for business, you can invest your money here, you can do a very good deal,\" Vestager said. \n \nRenata Hesse, a top official in the U.S. Justice Department's Antitrust Division, said that she appreciated the \"close cooperation\" of the European Commission. \n \n\"The acquisition as originally proposed would have eliminated General Electric’s primary competitor in the supply of aftermarket parts and services for GE gas turbines in the United States,\" Hesse said in a statement. \n \nIn May, GE told investors it expects $3 billion in cost reductions over the next five years as it combines its operations with those of Alstom, amounting to more than double the previous target when the deal was announced in April 2014. \n \nGE has also projected the deal would add 15 to 20 cents per share to earnings in 2018, or nearly 10 percent of GE's overall profit expected that year by Wall Street, according to Thomson Reuters I/B/E/S. \n \nGE's own cost-cutting plans aim to reduce industrial sales and administrative expenses to 12 percent of revenue, from just under 16 percent in 2013, while improving gross margin by about 0.5 percentage points in 2015 and 2016. \n \n(Reporting by Diane Bartz and Foo Yun Chee; Editing by Lisa Lambert)", "source": "WHTC.com"}