{"published": "2015-09-08T14:30:00Z", "media-type": "News", "title": "Humacyte Founder Dr. Laura Niklason and Board Director Dr. Robert Langer to Address the 4th TERMIS World Congress in Boston", "id": "6dccdf11-90a8-467e-bd44-f128df836a94", "content": "RESEARCH TRIANGLE PARK, N.C.--( BUSINESS WIRE )--Humacyte, Inc., a pioneer in biotechnology and regenerative medicine, \n      announced today that company founder, Laura Niklason, M.D., Ph.D., and \n      Robert Langer, Ph.D., Humacyte Board Director and Massachusetts \n      Institute of Technology (MIT) Institute Professor, will deliver keynote \n      addresses at the 4 th TERMIS World Congress. The event, held \n      every three years, brings together researchers, scientists, trainees, \n      and students from academia and healthcare to discuss critical \n      developments in regenerative medicine. \n  \nThe TERMIS World Congress will take place September 8-11, in Boston, \n      Mass., at the Boston Marriott Copley Place. The theme for this year’s \n      meeting is, “Past, Present, Future: The Evolution of Regenerative \n      Medicine,” reflecting the impact of tissue engineering throughout the \n      past two decades, and highlighting future developments. Drs. Niklason \n      and Langer will each present their success to date in the field of \n      tissue engineering and organ regeneration and applications of their work. \n \nDr. Langer, a world-renowned scientist and engineer, whose laboratory’s \n      research at MIT focuses on biotechnology and materials science, will \n      deliver a keynote lecture titled ‘Biomaterials and Tissue Engineering’ \n      on September 9 from 8:00 a.m. to 9:00 a.m. in the Ballroom. Dr. \n      Niklason, a pioneer in the development of an investigational tissue \n      engineered blood vessel with potential to help patients in need of \n      vascular replacements, will address the conference on September 11 from \n      8:00 a.m. to 9:00 a.m. in the Ballroom, through a presentation entitled, \n      “Platforms and Complexity in Tissue and Organ Regeneration.” \n \nA visionary leader in the field of regenerative medicine and cellular \n      therapies, Dr. Niklason is a Professor at Yale University in Biomedical \n      Engineering and Anesthesia, and also serves as Vice-Chair for Anesthesia \n      at Yale. She is a world-leader in the development of investigational \n      engineered blood vessels, as well as the engineering of whole \n      implantable tissue-engineered lungs. Dr. Niklason’s research focuses \n      primarily on regenerative strategies for cardiovascular and lung \n      tissues, and the impact of biomechanical and biochemical signals of \n      tissue differentiation and development. \n \n“TERMIS brings together world-class scientists and researchers who are \n      working towards the common goal of delivering transformative \n      applications to improve patient care and quality of life,” said Dr. \n      Niklason. \n \nIn 2004, Dr. Niklason founded Humacyte, Inc., which has developed an \n      investigational off-the-shelf bioengineered blood vessel for \n      implantation in hemodialysis applications. The human acellular vessel is \n      made by cultivating donated human cells on a tubular scaffold. The \n      vessel is then decellularized, with the goal of removing the qualities \n      that might trigger an immune response. In 2014, the Food and Drug \n      Administration granted ‘Fast Track’ designation for this investigational \n      vessel for vascular access in hemodialysis patients, expediting the \n      regulatory review process. \n \nA foremost authority in the biotechnology field, Dr. Langer has authored \n      more than 1,280 articles, and has nearly 1,050 patents worldwide. Dr. \n      Langer is the most cited engineer in history, with his patents having \n      been licensed or sublicensed to over 250 pharmaceutical, chemical, \n      biotechnology and medical device companies. \n \n“It’s apropos that the TERMIS Congress is taking place in Boston, which \n      has been in many respects, the epicenter of many noble scientific and \n      drug discoveries and advances in regenerative medicine,” said Dr. \n      Langer. “This conference is a culmination of decades of work, excellence \n      in scientific discovery, which has led us to a place where regenerative \n      medicine is positively changing patient care from the lab to hospitals.” \n \nTo access the full TERMIS World Congress program, visit http://www.termis.org/wc2015/program.php . \n \n About Humacyte  \n \nHumacyte, Inc., a privately held company founded in 2004, is a medical \n      research, discovery and development company with clinical and \n      pre-clinical stage investigational products. Humacyte is primarily \n      focused on developing and commercializing a proprietary novel technology \n      based on human tissue-based products for key applications in \n      regenerative medicine and vascular surgery. The company uses its \n      innovative, proprietary platform technology to engineer human, \n      extracellular matrix-based tissues that can be shaped into tubes, \n      sheets, or particulate conformations, with properties similar to native \n      tissues. These are being developed for potential use in many specific \n      applications, with the goal to significantly improve treatment outcomes \n      for many patients, including those with vascular disease and those \n      requiring hemodialysis. The company’s proprietary technologies are \n      designed to create off-the-shelf products that, once approved, can be \n      utilized in any patient. The company web site is www.humacyte.com .", "source": "Business Wire"}