{"published": "2015-09-04T11:28:00Z", "media-type": "News", "title": "Fans want a party but we still have a job to do, says Aaron Ramsey", "id": "23d6d685-0a18-4f10-80c3-00d491500589", "content": "AARON Ramsey plans to fulfil a career ambition when Wales seek to end 58 years of hurt against Israel on Sunday. \n \nWales stand on the brink of reaching a major tournament for the first time since the 1958 World Cup after beating Cyprus 1-0 in their Euro 2016 qualifier on Thursday night. \n \nThe Nicosia victory left unbeaten Wales top of Group B with 17 points from seven games and needing only three more from their final three matches to reach the European Championship in France next summer. \n \nIsrael's visit to the Cardiff City Stadium offers Wales their first chance to secure qualification and Arsenal playmaker Ramsey appreciates the magnitude of the occasion. \n \n\"It's always something I've wanted to try and do, to take Wales to a major championship,\" Ramsey said. \n \n\"We know what's on the line for Sunday. So hopefully we will take that opportunity, put on a show and get the three points because it will mean the world to me. \n \n\"The fans want a party but we have to do the job on the pitch first. \n \n\"We need to get rest in, recover and hopefully put in a performance which is better on the ball than we were in Cyprus.\" \n \nWales struggled at times in Nicosia to cope with energetic opposition, a difficult dry playing surface and the oppressive heat and humidity at the GPS Stadium. \n   Promoted stories   \nBut Gareth Bale's towering 82nd-minute header - his sixth goal of the campaign - gave Wales three more points and equalled the nation's best-ever run of nine unbeaten games in competitive football. \n \n\"It was a difficult game and at times we struggled to keep the ball, but we were very solid defensively and kept ourselves in the game,\" Ramsey said. \n \n\"But we'll take the win and we're in a great position. \n \n\"We are defensively very solid and when you can do that you will always have a chance. \n \n\"Ashley Williams has had a great campaign and the defenders play as a unit. \n \n\"They really put their bodies on the line and throw themselves in front of the ball, they put in these last-ditch tackles to stop goals and they've done it again.\" \n \nWales manager Chris Coleman said the final 10 minutes underlined the change in his side's mentality over the past 18 months. \n \n\"If we had come to Cyprus in the last campaign and it was 0-0 we would be thinking: 'Let's see it out. We've got a point to take back, it's a clean sheet'. \n   \n Share article  \n   \n\"But it's different now, expectations are different, and we could sense that with 4,000 supporters willing us on. \n \n\"We know what's at stake now and we must handle the situation we find ourselves in.\"", "source": "South Wales Argus"}