{"published": "2015-09-04T05:01:48Z", "media-type": "News", "title": "Never cared for snide comments: Manabi Bandopadhyay", "id": "49da5204-b880-4427-9450-0ec927a7e986", "content": "KOLKATA: Manabi Bandopadhyay, the country's first transgender college principal, has said she never cared for snide comments directed at her over the years and her job as a teacher was the best way to work for the \"underprivileged sections\" who look up to her. \n\n\"My battle had started long before the Supreme Court verdict on third gender last year. I had weathered brickbats from the people which have now turned accolades. \n\n\"The verdict might have made me more acceptable to people. So if I am praised and showered with accolades or if I get awards now, I don't get overwhelmed any more\" she said. \n\n\"May be those who are honouring me are themselves obliged by their own act,\" she said. Also read: Manabi (53), who was a teacher of English at Vivekananada Centenary College at Jhargram for about 20 years before taking up her present assignment as principal of Krishnagar Women's College, said her aim is to inspire those who look up to her to emerge out of their confinements and \"embrace the outer world\". \n\n\"I believe in Tagore's vision which was behind setting up of Visvabharati,\" Manabi, who penned numerous articles on the gender and other issues, said. \n\nShe said there had been numerous offers for her from reputed NGOs but teaching gave her more acceptability. \n\n\"While I will have more exposure to the bigger world as an NGO official, the underprivileged people who look up to me will not be able to identify if I leave my present job,\" Manabi, who had taken over as principal three months ago, said. \n\nThe West Bengal government had helped her \"a lot\" and she now wants to do something for transgenders and a census of the community in the state, she said. \n\nManabi was present at the announcement of Indoor Celebrity Cricket Match, a fund raising event for the underprivileged children initiated by her colleague Mahesh Jalan in the Bigg Boss show in Bengali.", "source": "Economic Times"}