{"published": "2015-09-26T15:54:37Z", "media-type": "News", "title": "Bride-to-be is the 11th woman in her family to wear 120 year-old heirloom wedding dress on big day", "id": "64b93e34-ac4e-4c21-90a4-ff1fd90e6ba4", "content": "First worn by her great-great-grandmother, then by a further NINE relatives, the Victorian dress needed rescuing, and Abby is determined to preserve it for the future It's a decision no bride-to-be takes lightly. \n\nWhen choosing a wedding dress , nothing other than 'the one' will do, something which will flatter you, make you feel beautiful and stand the test of time. \n\nThere's also the age-old tradition of \"something old, something new, something borrowed and something blue\" to take into account.\n\nWith this in mind, Pennsylvania bride Abby Kingston has found a unique and poignant way of combining tradition and looking her best - and it's been a labour of love.\n\nAs reported in the NY Daily News , on 17 October, Abby will become the eleventh woman in her family to walk down in the aisle in a 120 year-old heirloom wedding dress first worn by her great-great-grandmother in 1895 . \n\nWhat made your wedding day special? Email YourMirror@mirror.co.uk or fill in the form at the bottom. Barcroft Abby and her mother Leslie, who also wore the special dress on her wedding day Since then, the Victorian two-piece ensemble (made up of a bodice and skirt) has been worn by her mother and eight other female relatives.\n\nOnce she got engaged, Abby knew she wanted to continue the lovely custom, and the dress was located in the care of her great aunt Sarah \"Sally\" Seiler Ogden.\n\nHowever, the years had taken their toll on the antique garment - and some drastic alterations needed to be made. Barcroft Leslie goes through the photos documenting the dress' outings Describing the first time she saw the the dress to the NY Daily News, Abby said: \"It was a dingy brown and had all this lace appliqué all over it to cover damage from wear and tear over years.\n\n\"I put on the top, and it was almost a crop top on me. And the skirt had been cut short.\"\n\nIt seemed as if there was nothing that could be done to save the dress, until Abby was introduced to bridal dress designer Deborah LoPresti. Barcroft The antique gown is made of silk-satin and required highly-specialised care It was a departure from the usual restoration she did, but working with a well-practised dry cleaner, Deborah was able to bring the dress back to life.\n\nExplaining to The News how it's enabled her to share the hope and excitement of her relatives, Abby says:\n\n\"I'll be thinking about my great great grandmother and honoring the other family members who aren't with us, feeling their love on our wedding day.\" Barcroft The antique lace appliqué which is incorporated in the dress She hopes, with some love and care, the dress can now be handed down in better condition to future generations, telling The News:\n\n\"One of my mom's cousins has talked about her interest in the dress. And I hope one day maybe a daughter of my own would have an interest.\"", "source": "Mirror.co.uk"}