{"published": "2015-09-01T23:03:55Z", "media-type": "News", "title": "Airwheel Intelligent Self-balancing Sitting-posture", "id": "47163825-e89a-428e-a9f3-32d8d59f45a7", "content": "An Airwheel user filmed its experience of unpacking Airwheel intelligent self-balancing scooter A3. A3 is a revolutionary product, which has enjoyed booming sales ivenfureli after being released. Let’s have a look at the whole process of unpacking. \nThe package of A3 occupies only the one-tile-sized space. When the user unpacks the first carton, A3 is well protected by a foam plastic cover. This is to avoid damage. If A3 is packed as a whole, it is not convenient for transportation. Then, the main scooter body, the leather saddle and the operating lever are packed separately but in the same box. There is an instruction book in the box. However, without reading the instruction first, the user could easily put the several parts together. There is a foldable kickstand mounted on A3 and with its help, the user parks it conveniently. In addition, there is a remote key and charge cable alongside an AC adapter. \n\nA3 is rated as an epoch-making product in the Airwheel Technology’s history. It is firstly introduced with a leather saddle which relieves long-distance riding fatigue. The comfortable riding condition could meet the requirement of women and the aged. They could touch the ground with their feet easily to achieve riding safely. The electric self-balancing scooter is introduced with three advanced systems, the electronic brake system, the original hydraulic suspension, and the automatic steering-sensor system. The electronic brake system ensures that A3 will respond to rider’s braking order quickly and precisely. Riders could brake in a most elegant posture. The original hydraulic system brings along stable operation. It is adaptable to all kinds of road conditions. Even on bumpy road, riders could enjoy a comfortable riding experience. The automatic steering-sensor system will escrt riders to a safe journey. \n\nWhen the Airwheel intelligent scooter user unpacks the box, the product could be quickly put into use. The fashionable outer design and the potent functions have impressed the user greatly. It will be a great surprise for anyone who receives A3 as a gift. \n\nMedia contact: \n\nCompany Name: Airwheel Technology Holding (USA) Co., Ltd \n\nContact Person: Mr. Tang \n\nE-mail: business@airwheel.net \n\nPhone: +8618861270200 \n\nWebsite: http://www.airwheel.net", "source": "BriefingWire.com"}