{"published": "2015-09-25T07:00:50Z", "media-type": "News", "title": "Cops quickly nab 2 men in Jersey City car wash attack", "id": "2aeffe17-61cb-42a4-a533-de3ee204b813", "content": "Two Jersey City men armed with a handgun were arrested Wednesday afternoon and charged with a brazen daylight attack at a car wash, Jersey City spokeswoman Jennifer Morrill said. \n \nJersey City Police responding to the report of an aggravated assault at a car wash on Broadway at around noon quickly identified and arrested the two men, and also recovered a loaded handgun and drugs, Morrill said. \n \nJohnny Rojas, 33, of Romaine Avenue, was charged with aggravated assault with a deadly weapon, terroristic threats, possession of a handgun, and numerous narcotics charges, including possession and possession with intent to distribute. \n \nAlexis Diaz, 33, of Duncan Avenue, was charged with possession of a handgun, terroristic threats, and numerous narcotics charges, including possession and possession with intent to distribute. \n \nThe victim, a 26-year-old Griffith Street resident, told police two men approached him while he was washing a black SUV and asked him the whereabouts of his cousin, whom they claimed owed them money, Morrill said. \n \nRojas and Diaz then attempted to punch the man, with Rojas lifting his shirt and showing a black handgun to the victim. The Griffith Street man then fled to the entrance of the business and called police, Morrill said. \n \nThe man provided a description of his attackers to a police dispatcher, as well as the white Infiniti they fled the scene in. Plainclothes officers in the Street Crimes Unit who were working in the area, as well as West District patrol, responded to the Romaine Avenue address to which the vehicle was registered, Morrill. \n \nPolice saw the vehicle parked at the home and eventually spotted Rojas and a third individual, Hector Poll-Ortiz, walking on Broadway. When officers approached the two men, they saw the handle of a handgun sticking out of Rojas' waistband, Morrill said. \n \nWhen one officer yelled \"gun,\" Rojas attempted to turn around and flee but was forced to the ground. A loaded, black Remington semi-automatic handgun was recovered from Rojas, who was also in possession of $468 in cash and the keys to the Infiniti, the spokeswoman said. \n \nMeanwhile, Diaz was spotted walking nearby with cuts on his hand. Due to the proximity of the crime location and the apprehension of Rojas, officers detained Diaz, who was later identified as the second attacker from the car wash. \n \nWhile the car was being impounded, officers found six bags of suspected CDS cocaine in the cup holder in the middle console, Morrill said. \n \nPoll-Ortiz, who was not charged in connection with the car wash attack, was arrested on an open Hudson County Sheriff's Office warrant and was turned over to that agency for processing, Morrill added.", "source": "Jersey Journal"}