{"published": "2015-09-22T14:46:27Z", "media-type": "News", "title": "Silvio Calabi: Explorer raises the SUV bar to Platinum", "id": "7dd25cea-692f-4e00-82d1-27e181fe8d62", "content": "There was a moment outside Ouray, Colorado, when I forgot what I was driving. Yes, this is stupid. But we’d been waiting an hour and a half for a road crew to clear away that day’s rockslides, and my brain was elsewhere. When it finally came time to fire up the motor and move ahead, my eyes dropped back into the cockpit and . . . wow, look at this brushed-aluminum trim and these stitched-and-quilted cowhides, the warm fabrics, the rich wooden wheel with its pebble-grain leather wrap. Oh, right — this is a Ford Explorer! The new 2016 Explorer Platinum, that is. Its interior is so tasteful and restrained that it seems more Coventry or even Crewe than Detroit. The pierced-steel speaker grilles neatly radiused into the door panels say “Jaguar,” while that knurled alloy knob in the console is rather Bentley-ish. Even the oval badge set into the steering wheel is satin-metallic, not Ford blue. (Heresy!) Moreover, while waiting for the road to re-open we’d been zonking out on the Clear Phase/Live Acoustics audio system that Sony created for the Platinum Explorer. Its 500-watt amplifier drives four tweeters, four woofers, a subwoofer and three surround speakers precisely placed throughout the cabin, which itself has been extra-sealed against road noise. (The very same music playing on my desk speakers, as I write this, doesn’t sound half so deep, crisp and enveloping.) I wanted a slammed Civic to pull up alongside with “My Humps” blaring, so I could run down the windows and counter-blast him with a Vivaldi violin concerto. Meanwhile, we studied the spec sheet: in-and-out park assist 2.0, forward and side sensors, voice GPS, active lane-keeping, smart wipers, smart USB ports, steering-wheel heat, adjustable pedals, foot-operated liftgate, 180-degree cameras in both bumpers — with washers, no less — and more. All standard. Then it was time to go. This part of Colorado’s San Juan Skyway, dubbed the Million Dollar Highway, snakes back and forth through the high peaks between Ouray and Silverton before diving down into Durango. Much of the traffic that had backed up during our delay was from out of state, and the drivers were plainly intimidated by the paperclip bends and thousand-foot drops, especially where the guardrails had been swept away. But not the Explorer. With 365 turbocharged, altitude-proof EcoBoost horsepower funneled through a six-speed SelectShift automatic transmission and out to an all-wheel-drive system with settings for four different kinds of surface, the Ford just wanted to pick up the pace. While we waited for an opening to pass, I set the active cruise control to 45 miles per hour and the tightest interval. But whenever our speed dropped below about 20 MPH, the system shut down; and whenever the car ahead swung through a hairpin corner, our radar could no longer see it and we automatically sped up. Whoa! Sometimes we have to shut off the gadgets and do it ourselves. Page 2 of 2 - Which is no hardship. Ford calls this the sixth generation of America’s best-selling SUV, and clearly it learned something while building the seven million or so examples that went before. Not only does the Explorer resemble a Range Rover, the Platinum edition drives much like one too: serenely and capably, at least on pavement (no off-roading this time), and it may be the most comfortable Ford ever. The driver’s seat motors through an unusually wide range of movement — the bottom cushion can tilt way back — and, along with heat and ventilation, it offers three levels of massage. (The passenger’s chair gets all the same features, which is unusual in mass-market vehicles.) The Explorer is a three-row vehicle, too, with plenty of space for six or seven people, and the Platinum’s rear seats move forward or fold up at the touch of a button. Base, XLT and Limited 2016 Explorers are available with front- or all-wheel drive and a 3.5-liter V-6 or a 2.3-liter EcoBoost Four. Sport and Platinum Explorers get AWD and the EcoBoost Six. Ordering Platinum is easy: Pick a color, decide between bucket seats or a bench in the second row, and hand over about $55,000; everything else is standard. This Ford was designed not to a price but to an expectation — an expectation that was met. Plus - Mileage-conquering comfort - Mountain-pass power & handling - Stunning sound system - Brit sophistication at Yank prices Minus - Cruise control needs fine-tuning - A foot-pedal e-brake? Really? Silvio Calabi reviews the latest from Detroit, Munich, Yokohama, Gothenburg, Crewe, Seoul and wherever else interesting cars are born. Silvio is a member of the International Motor Press Association whose automotive reviews date back to the Reagan administration. He is the former publisher of Speedway Illustrated magazine and an author. Contact him at calabi.silvio @gmail.com.", "source": "Ardmoreite.com"}