{"published": "2015-09-25T14:46:34Z", "media-type": "Blog", "title": "Emma Watson: \"I did a silent retreat for my yoga instructor certificate\"", "id": "3b5c1aab-608b-4a50-afa0-71d3fb68f03b", "content": "Badly translated by Watsonuncensored. Credit if you use it. Nicole Kidman, Rachel Weisz and now Emma Watson. The new 'Amenábar girl' is another star 'stolen' to Hollywood. With her frail appearance, the girl who conquered the world since a famous school of wizards, introduces us to the darkest secrets of the human mind in the last intrigue of the Spanish director. At 25, it's been a long time since Emma Watson left behind the little Hermione Granger, the character in the Harry Potter saga that catapulted her to fame. Back now to the film listing with Regression (Release: October 2), the latest film by Alejandro Amenabar, recently presented out of competition at the San Sebastian Festival. The actress talks to XLSemanal in a central Madrid hotel. With her loose hair, black shirt and an elegant brown skirt, she answers with the maturity of someone who has grown up in the industry. XLSemanal. This is a film about our deepest fears. What are yours? Emma Watson. Uh, wow! [Laughs, and thinks before answering]. Usual things like injections, I don't like anything! It's one of my biggest fears. And scary movies, I get terrified! [Laughs]. XL. Anyone whose fortune is estimated at $ 60 million has the same fears as the rest of us? EW [serious]. In my case, absolutely. I think my fears are universal, I don't think I'm anything special in that regard. XL. In the film there is a criticism of certain therapies, called 'regression techniques'. Do you share that view? EW Wow, good question! I think the mind is very powerful. And we better be careful with people who we give access to our minds. Like everything in life, there are multiple interpretations. Religion can have brilliant powers, but also exert a devastating and terrible influence. The same applies to psychology. XL. Hey, and how do we know who to shut the door of your mind to? EW. It's best to trust yourself, your intuition. And do not get carried away by anyone or by any ideology, religion or therapy. XL. Angela, her character in the film, takes refuge in a certain way in the Church. You have chosen ... Does yoga help? EW Yoga brings me a lot of balance. It's a physical exercise, but also it's also meditation. It's not only good for my body, it also is to my mind. I like this holistic approach, which helps me in every way. It has been very helpful. XL. She even made ​​a silent retreat for a week. How is that not talking for days? EW I did that because I'm training for the yoga instructor certificate. It was part of my studies. XL. ¿Instructor? Are you looking for a plan B? EW [Laughs]. No, no. It's for personal interest. I want to delve into yoga, go beyond class and I think, when you reach that level that allows you to teach others, also I don't plan on practicing professionally, you really understand what's going on. XL. The film is also very critical of the powers of the media. Something that you have suffered in your own flesh ... EW The media have enormous power and often don't use it with the responsibility they should. They can have a huge impact on someone's life, they can do lots of damage. We return to the same thing we said when speaking of religion or psychology: all power must be exercised by people with integrity and responsibility. XL. Something that does not always happen ... EW. Unfortunately XL. How has it affected you? EW I've tried to take it the best I could. It's difficult, because as human beings we aspire to feel understood. You want to think people really know you as you are. So, when they have a false idea or when what you said is has been misquoted or taken out of context, it is very hard not to be hurt. XL. Do you think people know the 'true' Emma Watson? EW Yeah, I think throughout my career people got an idea of what is really important for me: who I am and what I try to say. I think the public is able to filter the messages they receive and to not believe everything they read. I trust them! XL. And you're committed to gender equality ... EW I became a very famous person very young and I take this attention to enlighten certain issues. I am a goodwill ambassador for the UN for a matter I have always been very sensitive to. XL. She gave a moving speech at the UN ... EW: I was very nervous! Besides, I'm no expert, nor have great skills in certain subjects, such as gender. But I'm a curious person, eager to learn and to ask questions. In addition, it is better not to be an expert. Most people are not in Davos or speak before the UN representatives, but want to feel included in a way of understanding the world. In a way, I feel like a window for them. XL. But you yourself wrote your speech and hardly showed to anyone before the D-day ... EW I wrote it, yes. For me it was important to get my own words. I'm a good actress, but I didn't want to give that speech if I had not written it. XL. Want to change the world? EW [Laughs]. Hopefully! There is a saying in English that says that if you want to eat a whole elephant, the way to get it is bite by bite. In this I am! [Laughs again]. This is my life project and not something I plan to forget after a few months. XL. You speak directly to the industries of film and fashion. EW Yes! And I think there will be changes in both cases, the key is to see how fast they occur. Change is inevitable. XL. In the UN she said, when little, if she showed her ideas, she was called 'bossy'. EW. Yes. It happens a lot to women. It's a shame. Having your own opinion or clear ideas not supported by many. Women are put in a decorative category. It is difficult not to be affected, not to be discouraged. XL. Has it affected you? EW Of course. This has affected me psychologically and, like me, millions of other women worldwide. It's a shame! And it makes us think that many women do not reach their full potential because of things like that. XL. She has 30 million followers on Facebook, 17 million on Twitter ... But no selfies! EW No! I do not identify with the level of vanity that is in social networks. I do not consider myself infinitely interesting for humanity! [Laughs]. And I think there are more important things to talk about, about Emma Watson. XL. She also said she felt sexualized at an early age. EW Yes! I have been very exposed since childhood. And at just 14 or 15 some sections of the press began to give a very sexualized version of my image. Even now, as the UN ambassador, I constantly feel obliged to resist the sexualization of me. It's very widespread, but I think that will change. XL. Although that fight is not incompatible with her passion for the world of fashion, with her friendship with the likes of Karl Lagerfeld ... EW More than the great creators, I turn to the consumer: question, check how what you're buying was made, under what conditions people working in the company ... We do not realize the power we have as consumers . Our decisions have an impact on the market. Be curious, be aware! That is my message. XL. A few weeks ago a casting was held for the spin off of Harry Potter, with 9-years-old presenting themselves. Will there be a next Emma Watson? EW I do not know! But it reminded me of that time in my life when I was that age and introduced myself to casting. It is very strange to see how everything emerges. I think they will do a great job. XL. Although you will not participate ... EW No, no. [She smiles and is silent]. XL. Let's talk about Alejandro Amenabar. How was it working with him? EW. Wonderful. It is so sensitive, creative and passionate you just want to be with him. He is very respectful and get out the best in each of us. XL. Did he get it? EW Got the better of me, yeah! XL. Who went looking for who? EW Someone said that it was I who went to look for him but did not. He sent me the script to London, I met with him and, from there, everything was smooth sailing. XL. Are there other Spanish directors you would like to work with? EW Wow, good question! I love many Spanish directors ... and Mexicans too. He had a project with Guillermo del Toro, but it did not go ahead. I would love to. I hope to have another opportunity to work with him. But Alexander is the best, I do not know if you can find better. XL. The film goes to San Sebastian out of competition, but many see the film as a candidate for an Oscar ... EW I wish! I would love it, of course. It is a very interesting thriller approach, which is similar to the classics of the genre. But while adding something new. XL. If it is, will you come to the Oscars? EW I do not see why not! [Laughs]. XL. When Amenabar mentions his references to the film, he talks about films shot before you were born. How do you connect with those references? EW I have been curious, because it is not the genre I see most. And I haven't seen many of these films he mentioned. But I think he has managed to give the film an air of classic sixties and seventies. It shows that he is a big fan of the genre and has included small tributes. The scary movies lovers will love it. finanza", "source": "Emma Watson Updates"}