{"published": "2015-09-03T10:36:15Z", "media-type": "Blog", "title": "Dick Cheney: Everyone should accept that same-sex marriage is ‘the law of the land’", "id": "b87695d7-7324-478a-ae3b-3fff721f9808", "content": "Dick Cheney: Everyone should accept that same-sex marriage is ‘the law of the land’ September 3, 2015 Gay, News Former Vice President Dick Cheney has said that people must accept that same-sex marriage is now the law of the land. The Republican politician served as Vice President under George W Bush for eight years, from 2001 to 2008, as the administration took a hardline stance on gay issues. He backed equal marriage in 2009, though a split in his family became clear when lesbian daughter Mary Cheney slammed her sister Liz Cheney, for opposing her right to marry. This week, Cheney suggested that following the Supreme Court ruling bringing same-sex marriage, to all 50 states, people must “go forward” rather than continue to resist. Referring to a clerk who is still resisting the ruling, he told Newsmax: “I don’t know the details of the case, but the Supreme Court has ruled on the subject of same-sex marriage. “It’s the law of the land and as a general proposition, it seems to me you’ve got to go forward with it.” In the same interview, Liz Cheney added: “As my dad said, it is the law of the land. “The court has ruled… [the clerk] is not an employee of a church or synagogue, she’s a government employee. So, she has an obligation to uphold the law.” Liz Cheney’s own turn-around on the issue comes despite the fact she opposed her own sister’s right to marry less than two years ago, when she said “the people themselves” should decide. She said in 2013: “I believe the issue of marriage must be decided by the states, and by the people in the states, not by judges and not even by legislators, but by the people themselves.” Mary Cheney and her partner Heather Poe hit back: “Liz has been a guest in our home, has spent time and shared holidays with our children. To have her now say she doesn’t support our right to marry is offensive to say the least.” The family now appears happily united in favour of equality. Anti-gay, Bush, Civil Partnership, civil union, Dick Cheney, entertainment, Equal Marriage, gay, gay weddings, George W. Bush, homophobic, Lesbian, lesbian wedding, Marriage, Marriage Equality, Republican, same-sex weddings, Union, US, wedding", "source": "Musings of a Mild Mannered Man"}