{"published": "2015-09-07T10:00:03Z", "media-type": "Blog", "title": "We guess it is OFFICIAL... we are Moving to Pencil Vane E Ah...", "id": "2bf61e80-9a2d-475e-9883-764b6106131f", "content": "HELLO DEAR FURENDS....\n   It seems like 87 YEARS since we have been able to Post and Read all about Blogville...  We REALLY do MISS everybuddy...\n   BUTT,  we guess that we are Soon to be Pencil Vane E Ah Pups...    we knew it fur SURE when we found THIS in our Mail Box..\n      We RIPPED the Letter open to see WHO had left Snacks fur US....    \nOMD OMD   it was Our ADORED... and BESTEST in the whole UNIVERSE ... MISS PATTI the Letter Lady...   and LOOK she gave us this Grand Card...\nAnd she Wrote NICE STUFFS about US in there....\nWe think we will MISS our MISS PATTI Almost as much as we will miss all the stuffs in our yard... like the Moles and the Bunnies and the deer... and our collection of HOLES.   And when we made our LAST trip to Our Beloved Dr. Hustey's Office fur our STUFF IT UP OUR NOSE... Sniffy  Kennel Cough prevention thingy, the other day...   we saw something...     Look at THIS...\n This one is a bit Blurry...  butt that CAT... can actually make the MOUSE work and he can make the Screen change and stuffs like that...\nYEP....  we are gonna be SAD to leave our MISS PATTI the Letter Lady... and everybuddy at Dr. Hustey's office...       We don't think that the peeps in Pencil Vane E Ah are gonna be SUPER like they are here...  HECK SAKES...    they don't EVEN know how to SPELL the place...  \nthey do PA   not PAw... and  Pennsylvania      ....    guess we will have our  PAWs Full trying to teach them the RIGHT way.  \nWe want to THANK Amber Da Weenie and her Crew fur the FABULOUS Birfday card that they sent to Ernie...  It is covered in pictures that Look EXACTLY like HIM...      We had Mom Pack it away VERY carefully so that once we get settled in   PENCIL VANE E Ah..    Cooperstown, PAw.. to be exact...    we will show you pictures of it...  \nHappy Labor Day weekend to our furends in the U.S.\nMuch LOVE from US....      TO ALL OF YOU...\nF.n E.", "source": "FRANKly and ERNESTly Speaking"}