{"published": "2015-09-16T13:11:08Z", "media-type": "News", "title": "Take the right kind of break to rejuvenate yourself at work", "id": "d53fbb91-bb0e-4115-ab37-99ae53bd7042", "content": "Back in June, during my first few weeks in my new job , my days were busy. Extremely busy. So busy, in fact, that pretty much every minute of every workday was filled with a meeting to attend or a task to accomplish. Other than the occasional quick restroom break, I spent all of my time those days either at my desk or in a meeting room. I even ate lunch at my desk while trying to catch up on work. Anytime you start a new job, you spend the first few weeks drinking from the proverbial firehose, so I wasn't surprised by how busy I was. And to be honest, I found the learning process exhilarating and exciting, if also a bit exhausting. Now that I'm about three months into the new gig, the days are still quite busy, but they have grown more manageable. That means I'm able to take short breaks during the day, sometimes escaping our freezing office space to thaw out with a walk around the block or stretching my legs with a quick jaunt through the hallways of the building. These breaks always help me gather my thoughts, refocus on the tasks I've got to do next and prepare mentally for the coming block of work time. Personal experiences like these have made me a big believer in the benefits of breaks. I see them as little opportunities to build work-life balance in the middle of an average day at the office. As such, I was interested to read the results of a new study on work breaks from two researchers in Baylor University’s Hankamer School of Business. According to a Baylor press release about the study, researchers Emily Hunter and Cindy Wu, associate professors of management, surveyed 95 employees (ages 22-67) over a five-day workweek. Each person was asked to document each break he or she took during that time, excluding bathroom breaks. Hunter and Wu then analyzed a total of 959 break surveys, or an average of two breaks per person per day. They said in the press release that the results of the study should be beneficial to both managers and employees. “We took some of our layperson hypotheses about what we believed were helpful in a break and tested those empirically in the best way possible,” Hunter said in the release. “What we found was that a better workday break was not composed of many of the things we believed.” Page 2 of 3 - For example, many residents of Cubeville like to push through their mornings, staying busy and delaying any breaks until lunchtime . I often find myself in that situation. But Hunter and Wu found that a break earlier in the workday replenishes more of an employee's resources of energy, concentration and motivation. “We found that when more hours had elapsed since the beginning of the work shift, fewer resources and more symptoms of poor health were reported after a break,” the study said. “Therefore, breaks later in the day seem to be less effective.” They also found that better breaks incorporated activities that employees preferred, even if those activities were work-related. “Finding something on your break that you prefer to do — something that’s not given to you or assigned to you — are the kinds of activities that are going to make your breaks much more restful, provide better recovery and help you come back to work stronger,” Hunter said in the press release. I've definitely found this to be true. If I'm working on an assigned task during a break — like reading a report during lunch — it doesn't feel like a break at all. But if I spend that downtime on a work or personal project of my choice, I'm much more refreshed and rejuvenated when the break is done. And that's important, because the study also found that taking good breaks led workers to experience fewer maladies like headaches, eyestrain and lower back pain at work. Employees who took good breaks also had better job satisfaction and less burnout, according to the study. This is definitely information bosses should ponder. The team I manage is an incredibly hard-working group, and I worry that they're going to get burned out . If I pay more attention to their schedules and encourage them to take breaks — and model that behavior myself — perhaps I can help them avoid that problem. But how long should breaks last to be beneficial? Unfortunately, the Baylor study didn't have a solid answer to that question, although the research did seem to find that more frequent, shorter breaks were associated with more positive outcomes for workers. “Unlike your cellphone, which popular wisdom tells us should be depleted to zero percent before you charge it fully to 100 percent, people instead need to charge more frequently throughout the day,” Hunter said in the press release. That makes sense to me. After all, no one likes a dead battery. I'd be interested to hear your reactions to this study. How often do you take breaks during the workday, and when do they usually occur? How long do they last? What kinds of breaks are most beneficial to you? What suggestions would you offer to people who aren't sure how to manage their work breaks? Page 3 of 3 - Send me an email or leave a comment online, and I'll share some of your responses in a future column. And one more thing. If you're looking for a quick break every Tuesday morning, reading my column would probably give you a solid 5-7 minutes away from the daily grind. Just saying.", "source": "Sulphur Southwest Daily News"}