{"published": "2015-09-03T12:39:55Z", "media-type": "News", "title": "Muslims Having More Than Two Kids Should Be Criminalised: Togadia", "id": "7f94eddd-f115-488c-a559-a0aab19237a1", "content": "Two senior Hindutava leaders have sought curbs on Muslims in view of the increasing population of the community as revealed in the recent census report. \n\nWhile VHP Working President Pravin Togadia has gone to the extent of demanding punitive measures against Muslims having more than two children for engaging in \"population Jihad\", BJP MP Sakshi Maharaj said the community should be stripped of its minority status as it no longer deserved it due to its growing share in the population. \n\nMaharaj, who has sparked controversies in the past with his hardline Hindutva views, said Muslims were a majority in many districts and there number had risen to such a extent that there was no reason to accord them minority status. \n\n\"They are no longer a minority. They say they are over a quarter of the population. In Kashmir, they are more than 90 per cent. There are many districts where they are 70, 80, 90 per cent, so what is minority about them,\" he said. \n\nHis comments came in the wake of the latest census figures which showed that Muslims' share in the population had grown, while that of Hindus had fallen, inviting extreme comments from a number of right wing leaders. \n\nAlleging that \"extinction\" of Hindus could happen due to the \"population jihad\" of Muslims, Togadia has said having more than two children should be declared a criminal offence. \n\n\"Rather than subsidising each birth of a Muslim kid, it is must that after two children, there has to be the strictest curb. Perhaps a punishable criminal offence and stopping rations, jobs, educational facilities will streamline the population facilitation towards better development,\" he said in an article in RSS mouthpiece Organiser. \n\n\"A serious extinction seems to be on the anvil. And it is of Hindus. There is method in the systematic growth of Muslims... Now, if we do not stand up against the 'Population Jihad', Bharat will soon be an Islamic state. It is also must to strictly implement two children norm irrespective of the political pressures ... The latest Census figures are a wake-up call,\" he had said. \n  \n\r\n                    © Copyright PTI. All rights reserved. Republication or redistribution of any PTI content, including by framing or similar means, is expressly prohibited without their prior written consent.", "source": "Outlook India"}