{"published": "2015-09-30T16:19:56Z", "media-type": "News", "title": "USA TECHNOLOGIES ALERT: National Securities Law Firm Announces Investigation of Potential Accounting Irregularities, and Encourages Investors With Losses to Contact Law Firm for More Information.", "id": "93082e29-67da-4e28-9ea3-ede6afcd3d99", "content": "NEW YORK , Sept. 30, 2015 /PRNewswire/ -- Tripp Levy PLLC, a leading national securities law firm, announces that it is investigating potential securities claims on behalf of investors of USA Technologies Inc. (NASDAQ: USAT) (\"USAT\" or the \"Company\") resulting from allegations that USAT may have issued materially misleading business information to the investing public. \n\nOn September 29, 2015 , the Company announced that it is unable to file its annual report for the fiscal year ended June 30, 2015 within the prescribed time, having \"identified deficiencies in both the design and operating effectiveness of the company's internal control over financial reporting, which when aggregated represent a material weakness in internal control.\" The company stated that the most significant weaknesses related to \"certain customer accounts and receivable balances related to customer processing and service fees. The procedures in place did not identify a large number of small balance accounts that may be uncollectible,\" and, as a result, the company has \"increase[ed] its bad debt reserve by approximately $450,000 , resulting in an after-tax charge of approximately $270,000 .\" \n\nUSAT stock has since fallen considerably following the announcements of its financial irregularities thereby damaging investors.\n\nIf you purchased shares of USAT and have suffered a loss from your investment in Liquid common stock and would like to learn more about this investigation, including your ability to potentially recover your losses, please contact us either by email at contact@tripplevy.com or by telephone at (800) 511-7037 or visit our website at www.tripplevy.com/participate-in-an-action . \n\nTripp Levy PLLC is a leading national securities and shareholder rights law firm representing both individual and institutional shareholders and, along with its affiliate, have recovered billions of dollars for shareholders. Tripp Levy PLLC is affiliated with Milberg LLP. The National Law Journal has named Milberg one of the \"50 Elite Trial Lawyer Firms\" and one of the \"50 Leading Plaintiff Firms in America.\"\n\nAttorney advertising. Prior results do not indicate a similar outcome\n\nTripp Levy PLLC \n\nNew York, New York \n\nToll free: 800-511-7037 \n\nInternational: 602-241-2841 \n\nEmail: contact@tripplevy.com \n\nwww.tripplevy.com \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/usa-technologies-alert-national-securities-law-firm-announces-investigation-of-potential-accounting-irregularities-and-encourages-investors-with-losses-to-contact-law-firm-for-more-information-300151723.html \n\nSOURCE Tripp Levy PLLC", "source": "Barchart"}