{"published": "2015-09-04T01:23:54Z", "media-type": "Blog", "title": "Ripper Street", "id": "fcf9a749-dda5-4079-b6f9-df970d3ebfde", "content": "What to watch on Friday, September 4th, 2015TodayTomorrowSunMonTueWedThu\nSubscribe to see up to 30 days\rRipper StreetBBC 1 at 9:00pm (Other show times...)\rAlso recommended...\nThe PinkertonsLady Chatterley's LoverThe Trials of Jimmy RoseDoc MartinBallersDoctor FosterSecrets and LiesYou may also like...\nFrom HellPeaky BlindersBoardwalk Empire\nThe crime drama set in Victorian Whitechapel continues. The dark and corrupt streets of Whitechapel are witnessing a new breed of tourist - one from the higher realms of society wanting salacious entertainment. Yet Lady Montacute's curiosity means she now stands before the men of Leman Street charged with the vicious stabbing of a local woman. Over one long rainy night, H Division must unearth the true culprit before the weight of the authorities bears down upon them.\nSubscribe to digiguide.tv Premium and set email or SMS alerts for Ripper Street\nCastMatthew Macfadyen...Det. Insp. Edmund ReidJerome Flynn...Det. Insp. Bennet DrakeAdam Rothenberg...Cap. Homer JacksonDavid Wilmot...Sgt. Donald ArthertonClive Russell...Ch. Insp. Fred AbberlineJosh O'Connor...PC Bobby GraceDirected byAntony ByrneWritten byRichard Warlow\rDigiguide.tv Editor's Picks' RSS feed\rDAGSky Arts at 9:00pm\nThe hit Norwegian comedy returns for series two and marriage counselor Dag Refsnes finds himself a little worse for wear after hitting the bottle in a big way....\nRipper StreetBBC 1 at 9:00pm\nThe crime drama set in Victorian Whitechapel continues....\nPiers Morgan's Life Storiesitv Anglia at 9:00pm\nLionel Richie talks to Piers Morgan about his lengthy and successful career....\nThe Great British Bake Off: An Extra SliceBBC 2 at 9:00pm\nSister series to The Great British Bake Off, in which Jo Brand is joined by three celebrity fans to take a look at the most recent episode, with interviews and unseen footage....\nRise of the Planet of the ApesFilm4 at 9:00pm\nDirector Rupert Wyatt's contribution to the iconic sci-fi saga is an origins story in which compassionate scientist Will Rodman finds that testing a cure for Alzheimer's on apes ha...", "source": "UK TV Programme Highlights"}