{"published": "2015-09-02T03:14:00Z", "media-type": "News", "title": "News - Plant Panthers Reload for 2015 - DyeStatFL 2015", "id": "92bf7a36-310d-4d47-8c26-c80f724ee6b2", "content": "Plant Panthers Re-load for 2015 \n \nBoth boys and girls squads look to climb the ladder in 2015. \n \nThe Panthers lost arguably their greatest runner in school history when UF athlete Jack Guyton graduated. Guyton owns every school record at Plant from the 800m all the way up to the 5000m cross country record. Guyton was a finish-line stumble away from winning the Class 4A 1600m title in back-to-back seasons. Guyton was also fifth at the state cross country meet last November. Athletes like Guyton don't emerge every year and head coach Bryan Garcia knows it. Yet Garcia, now in his third year as head coach of the boys team, thinks that a pair of athletes that cut their teeth during Guyton's reign, make the 2015 Panthers even more formidable as a group than last year where they placed 10th in Class 4A. \n \nThose two athletes are seniors Rob Leverone and Quasan Markowski . \n \n\"Jack was not the vocal leader that Rob (Leverone) and Q (Markowski) are,\" Garcia said. \"Jack was a great runner but Jack only had to worry about Jack. With Rob and Q, it's a totally different mindset. If they see someone fading back (at practice), they'll go get them and bring them up.\" \n \nThe tandem senior leadership is something Garcia values highly. \n \n\"It makes my job that much easier to where I don't have to coach 25 kids,\" Garcia said. \"They're responsible and they make others on the team more responsible - I'm really going to miss them next year.\" \n \nWhile Leverone and Markowski come in as Plant's top runners, their paths took very different courses. For Leverone, it's progression. Leverone has knocked a minute off his top time each year he's been on Plant's Varsity team from freshman on up. \n \n\"He (Leverone) is the consummate hard worker that plans to run in college,\" Garcia said. \"He won that state medal in the 3200m last year and that's part of his fire - he belongs here now and believes he can run with anyone on any given day.\" \n \nMarkowski exploded onto the scene last year. Having never run on a Varsity track or cross country team, Markowski medaled at state in the 1600m. \n \n\"What he (Markowski) lacks in experience, he makes up for with pure guts,\" Garcia said. \"Q is more the speed and Rob is more strength, it's so good to have them here even if they're two totally different athletes.\" \n \nThat team mentality is just what Garcia thinks may improve this year's team over 2014's. Last year's state meet might have shown some disparity between the two with Leverone 19th in 16:16.80 and Markowski way back in 81st at 17:09.40 but Markowski's newness to the sport leaves a higher ceiling and everything Garcia says has the pair faster and closer together than last year. Look for the gap between them to close and for them both to climb the Class 4A leader board this year. \n \n\"Now, I just have to manage the team, I don't have to ride them, ask them if they ran over the weekend because I know they did,\" Garcia said. \"I'm grateful to have them, they take half the headache away from me.\" \n \nThe Plant girls cross country team is downright legendary. Coach Roy Harrison and his Panther girls have 10 state titles to their credit, most of any team in state history. The Panthers' last title was in 2011 and they were runners up in 2012 to West Palm Beach's Saint Thomas Aquinas. Since then, the Panthers have trended down, slipping to sixth in 2013 and failing to make the state meet at all in 2014. It snapped a 28-year streak where Harrison took his girls team to state. \n \nNothing great lasts forever. Nothing great stays down forever. \n \nHarrison and the Plant girls are re-loaded for 2015 and while they don't quite have aims at their 11th state title. Harrison is confident his squad will be relevant this season. \n \n\"It seemed like last year illness really took its toll,\" Harrison said. \"It just seemed like it was always something.\" \n \n2014 junior and top runner, Abby Crowder spent 10 days in the hospital last year and never ran at all. Current junior Gillian Minnehan , the Panther's number two runner in 2014, passed out 200 yards from the finish line at regionals. It torpedoed the Panthers' state aspirations and made them want to quickly turn the page to 2015. The Panthers made a resounding statement to start the 2015 season by winning the 50-team Jim Ryun Invitational in Lakeland; Crowder and Minnehan in particular. \n \nThe Panther girls easily out-distanced second-place Circle Christian School 68 to 108 and Crowder ran a 20:47.50 taking sixth, while Minnehan ran a 20:52.90 to take ninth place. The rest of the Panther pack was close behind, junior Laura Jones in 11th at 20:54.70, 14th place Ariana Makar in at 21:29.10. \n \n\"I think we surprised some people at Jim Ryun,\" Harrison said. \"I was curious to see how we'd do, I knew our top three would be together but we got a great run from our number four, Ariana (Makar).\" \n \nThe Panthers seem to be back with a chip on their shoulder. Crowder has a sub 20-minute mark from 2013 and got a great start to 2015. Minnehan ran a 5:14 1600m at regionals last year and came in at Jim Ryun just 10 seconds off her career personal record. \n \n\"If she (Minnehan) gets used to running a 5k, she'll drop a lot of time,\" Harrison said. \n \nJones, Harrison describes as a, \"workhorse that runs all year\". Jones was a state qualifier in the 3200m in 2014. Number five runner, Nadia Stratton didn't run at all in 2014 but took 29th (22:15.50) at Jim Ryun. \n \nHarrison didn't change much in the offseason. He's the most decorated coach in the state and he believes in doing what works. \n \n\"We put the mileage in this summer,\" Harrison said. \"I still have no clue how we'll do this year, we have Wharton and Sarasota in our region so we'll see.\"", "source": "RunnerSpace.com"}