{"published": "2015-09-20T01:11:01Z", "media-type": "News", "title": "Afghan Music Producer Has Sights Set on Making National History with Second Album", "id": "17843f19-24a4-4497-9a41-edc313b2dde5", "content": "Press Releases USA, 20 September 2015 -- An Electronic Dance Music (EDM) producer is spearheading the Afghan music evolution with the release of his second album set to hit stores later this year. As a blend of Progressive House, Electronica and Dubstep, Shuja Rabbani pioneers a sound that’s energetic, upbeat and enlightened. \n\nBorn in Afghanistan, raised in Australia and currently living in Dubai, Rabbani is a well-travelled individual with a lifelong passion for electronic dance music. He kicked off his career with a self-produced album titled 'Afghan Provocateur' and is now working on a follow up record. The wild global success of his first album saw Rabbani make history as the first Afghan EDM producer to be widely distributed in over 200 digital stores across 100 countries. \n\nSince the USA invaded Afghanistan in 2001, the country has endured a violent stigma and next to no attention from the Western music industry. Determined to expose Afghanistan beyond the war scenes, Rabbani represents a new era of artist for the Afghan music scene. While most musicians in Afghanistan still embrace traditional sounds and instruments, Rabbani is pioneering a new kind of sound. Through his global success he hopes to introduce the younger Afghan generation to the EDM genre. As well as familiarising Afghanistan with the EDM genre Rabbani also has his sights set on going down in history as the country’s best-selling artist. \n\nWhile Rabbani expresses himself through high energy EDM beats, his album represents so much more than simply a collection of tracks. By infiltrating Afghanistan’s borders with EDM sounds Rabbani is advocating for the creation of a modern and open minded nation. He is an invaluable part of the cultural reform and hopes that his beats will showcase that there’s more to Afghanistan than the scenes of terror so ruthlessly portrayed by the media. \n\n“I have a fervour for both EDM beats and the modernisation of my native country. By pursuing my love of creating wicked electro dance beats I’ve managed to blend both these passions into a meaningful second career that I hope will change the face of contemporary Afghanistan and inspire the Afghan youth to go beyond Afghanistan’s borders in pursuit of artistic success,” says Rabbani. \n\nThroughout 2014 Rabbani worked on completing his first album while juggling a full time job as a Human Resources professional, and becoming one of the most influential bloggers and highly outspoken social media personalities in Afghanistan. For young Afghans wanting to pursue both lucrative careers and a love for music, Rabbani is an inspiration. He is a prime example of how the right mind-set can foster the achievement of multiple goals. \n\nSince launching on iTunes, Beatport, Amazon, Spotify and Google Play alongside international artists earlier this year, Rabbani’s debut album has already drummed up over 100,000 Facebook viewers, with tracks such as 'Agent Provocateur,' 'Basement Dance Floor' and 'Juice' emerging as instant favourites. \n\nRabbani keeps his fans in the loop via an active SoundCloud channel where he regularly releases free music tracks. All are recorded at 120 bpm which makes them ready to spin by club DJs in search of unique sounds. \n\nTo find out more about Shuja Rabbani and how the EDM producer is set to revolutionise the Afghan music industry, go to: http://www.shujarabbani.com  \nFacebook: https://www.facebook.com/ShujaRabbaniPage  \nTwitter: https://twitter.com/ShujaRabbani \nYouTube: https://www.youtube.com/user/shujarabbani  \n\nDakota Digital for Shuja Rabbani \nAccount Manager: Rebecca Appleton \nEmail: rebecca@dakotadigital.co.uk  \nTel UK: 01623 428996 \nTel US: 917-720-3025 \n# # # \nSubmitted by datwriterguy on Sunday, 20 September 2015 at 5:11 PM \nCategory: Arts & Entertainment", "source": "Scoop Asia"}