{"published": "2015-09-24T13:30:00Z", "media-type": "News", "title": "Stocks Fall as Caterpillar Shares Weigh on Dow", "id": "cba0e493-98d9-47f0-b574-384a6167c562", "content": "U.S. equity markets saw a sharp move lower at the opening bell on Thursday as investors parsed economic reports and news from Caterpillar. \n\nAs of 9:30 a.m. ET, the Dow Jones Industrial Average futures dropped 136 points, or 0.83% to 16145. The S&P 500 shed 12 points, or 0.64%, while the Nasdaq Composite declined 32 points, or 0.68% to 4720. \n\nAs Caterpillar shares plunged, so too did the industrials sector, which saw the biggest declines. Utilities was the only sector in the green, rising 0.15% in recent action. \n\nToday’s Markets \n\nThe industrials sector dropped more than 1% at the opening bell as Caterpillar (CAT) shares plunged more than 7%, weighing heavily on the sector. The manufacturing giant announced on Tuesday it planned to slash its workforce, with a total possible reduction of more than 10,000 people. The company also lowered its 2015 outlook. It now sees sales and revenue around $48 billion compared to a previous estimate of $49 billion. \n\nThe company’s chief executive, Doug Oberhalman said Caterpillar is “facing a convergence of challenging marketplace conditions in key regions and industry sectors – namely in mining and energy.” \n\nWall Street prepared to follow global markets lower, though there wasn’t a particular catalyst driving momentum. As with the last week of trading since the FOMC’s decision to hold short-term rates at historic lows, markets have been searching for information to give them a direction. \n\nLarry Shover, chief investment officer at Solutions Funds Group, said the fundamental landscape isn’t as gloomy as it’s sometimes made out to be, but the markets are still moving on two issues on which it needs to see more clarity: China’s economic growth and liftoff timing for the Fed. \n\n“Remember the recent bout of instability can trace its bloodline back to the August 17 yuan devaluation while the Fed’s indecisive and muddled message on September 17 only exacerbated the market’s angst,” he said. \n\nAt 5:00 p.m., Fed Chief Janet Yellen was scheduled to speak at the University of Massachusetts to deliver the annual Phillip Gamble Memorial Lecture. The appearance will be Yellen’s first since the FOMC’s decision last Thursday. While there won’t be time for a question-and-answer session, any clues on when the central bank might hike rates would be welcome from the markets. \n\n“I believe the committee intended the no-hike decision to be a simple matter of prudent risk management, not a significant change in the rate normalization strategy, and I thus expect Yellen’s speech will attempt to reinforce this message,” Shover said. \n\nIn recent action, the yield on the benchmark 10-year U.S. Treasury bond declined 0.028 percentage point to 2.114%. \n\nIn the hours leading up to the Fed Chief’s speech, markets will closely monitor economic reports as the central bank has reiterated time and again its dependence on data before it decides to raise rates. \n\nTraders got the latest look at weekly jobless claims data, which showed an increase to 267,000 claims last week from an unrevised 264,000 the week prior. Wall Street had forecast a steeper rise to 271,000. The latest data on durable goods from the Commerce Department, meanwhile, showed a 2% drop in August, matching expectations. Excluding the volatile transportation component, orders were unchanged from the month prior, compared to expectations for a 0.1% tick higher. \n\nNew home sales data due at 10:00 a.m., also out from the Commerce Department, is expected to show an increase of 515,000 in August. \n\nElsewhere in equity markets, European stocks were lower amid reports other auto makers could feel pain from emissions-related headlines that forced Volkswagen’s CEO to leave his post on Wednesday. \n\nThe Euro Stoxx 50, which tracks large-cap companies in the eurozone fell 1.53%, while the German Dax dropped 1.85%, the French CAC 40 declined 1.46%, and the UK’s FTSE 100 slipped 0.71%. \n\nAsia markets were mixed after a reading on Japan’s preliminary manufacturing PMI came in under expectations, though still in expansion territory, at 50.9 from 51.7 in August. \n\nJapan’s Nikkei dropped 2.76%, while China’s Shanghai Composite, however, rose 0.86%, while Hong Kong’s Hang Seng paced 0.97% lower. \n\nIn commodities, global crude oil prices sagged after a sharp decline in the prior session. U.S. crude fell 0.50% to $44.26 a barrel, while Brent, the international benchmark, declined 0.21% to $47.65 a barrel. \n\nMetals were mixed as gold rose 0.34% to $1,135 a troy ounce. Silver declined 0.26% to $14.75 an ounce, while copper fell 0.81% to $2.28 a pound. \n\nThe dollar rose against a basket of global currencies while the euro advanced 0.62% against the greenback.", "source": "FOXBusiness.com"}