{"published": "2015-09-17T14:44:00Z", "media-type": "News", "title": "BrandShop's Consumer Focused Survey Reveals Shortcomings In The Current Online Shopping Experience", "id": "d1835a46-720f-4779-9e82-1f1487959ec8", "content": "SOURCE BrandShop\n\nIn order to meet evolving consumer demands, brand manufacturers must focus on their direct-to-consumer e-commerce efforts\n\nNEW YORK \n\n\"Our survey reveals that transacting is a vital part of how consumers want to engage with a brand, and DTC brand marketplaces are the best destinations for consumers to experience a brand and its products in a way that only a brand can deliver,\" said Reuben S. Hendell, CEO of BrandShop. \"Currently, brands are underinvesting in direct to consumer initiatives, but are starting to catch up to these changes in the marketplace.\" \n\nAccording to the survey, 82% of consumers surveyed expect to be able to transact directly with their favorite brands--in fact, 88% of those surveyed prefer it as a trusted alternative to transacting with third party etailers. It is imperative for brands to recognize the value of building closer relationships with their consumers through DTC e-commerce channels. Brands who meet the desires and expectations of consumers stand to gain increases in revenue and brand loyalty while conveying a clear, omnichannel voice. \n\nA recent Forrester report states that US businesses spent just $6 billion \n\n\"For years, brands have invested in engaging with consumers across a host of mediums only to forget that true consumer engagement happens when they interact directly with a brand. BrandShop's survey results demonstrate how new consumer preferences are changing the paradigm of e-commerce and there's a much needed return to focusing on direct consumer engagement and transaction,\" said Greg Johnson, EVP, co-ECD at Swirl\n\nFurthermore, the report provides valuable insights on how brands can better engage with digital shoppers and the underlying significance of enabling DTC e-commerce, including:\n\n\"Brands have historically operated as marketing machines that didn't take part in the point of purchase. However, BrandShop's findings reveal the benefits of interlocking brand marketing and content with digital commerce to provide the best customer experience -- regardless of where the end transaction occurs,\" said Voxx CEO, Pat Lavelle. \"Expanding brand involvement in the purchasing process increases brand awareness, builds customer loyalty and strengthens the entire channel ecosystem, benefiting retail partners and consumers alike.\"\n\nTo download a free copy of BrandShop's 2015 Digital Consumer Preferences Survey, please visit: http://brandshop.com/consumer-preferences-survey-2015/ \n\nAbout BrandShop\n\nBrandShop is the leading provider of branded digital commerce solutions for Fortune 1000 companies. Powering the growth of direct-to-consumer Brand Marketplaces, BrandShop fuses technology, design and fulfillment capabilities to streamline the way products are discovered and purchased. Co-founded by Brian F. Martin \n\nFor more information, visit www.brandshop.com.\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/brandshops-consumer-focused-survey-reveals-shortcomings-in-the-current-online-shopping-experience-300144875.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KRHD TV"}