{"published": "2015-09-19T15:02:00Z", "media-type": "News", "title": "Vettel surprised by pole margin", "id": "f886bb6e-ca4f-433c-b0df-8e374272f74d", "content": "Paul di Resta analyses both Sebastian Vettel and Lewis Hamilton's qualifying for the Singapore GP \n\nSebastian Vettel has admitted his surprise at defeating Mercedes and Lewis Hamilton by over a second in qualifying for the Singapore GP to claim Ferrari's first dry pole in five years. \n\nThe four-times world champion produced one of the laps of the year to register the Scuderia first pole position since 2012 and the team's first in dry conditions since F1 visited Singapore in 2010. It was also the German's first pole since Brazil 2013. \n\nRemarkably, not only did Vettel claim pole by half a second from Daniel Ricciardo with his Ferrari team-mate Kimi Raikkonen a further two tenths adrift, but he beat the fifth-placed Lewis Hamilton, chasing a record-equalling eighth consecutive pole in F1, by over 1.4 seconds. With Nico Rosberg a place behind Hamilton, it was, by a distance, Mercedes' worst result of F1's new turbo era. \n\n\"It's a surprise. I thought they were sandbagging because there's no doubt they have the strongest package this year,\" said a startled Vettel. \"They must have some issues. \n\n\"But I wouldn't rule them out for tomorrow. It's not the easiest circuit to overtake, but if you have the pace you can come through. So I expect them to be strong tomorrow.\" \n\nIt would certainly be foolish to write off Mercedes but Ferrari, closely followed by Red Bull, appear to have boasted a significant pace advantage all weekend with Vettel consistently a step ahead of Raikkonen and the chasing pack. \n\nBut why? Ferrari introduced a brand-new upgraded engine two weeks ago at Monza, a change which immediately coincided with better single-lap pace from the Scuderia. However, the team are adamant that their new engines couldn't have been a factor in their unexpected superiority under the Marina Bay lights. \n\n\"The effect of horsepower around here is about point one of a second so it's inconceivable you could make that sort of difference with horsepower,\" a bemused but delighted James Allision told Sky Sports F1. \"The gap to Red Bull is more or less what it should be around this sort of track but the strange thing is how slow the Mercs were.\" \n\nSebastian Vettel celebrates after landing his first pole for Ferrari in Singapore \n\nSo was it a case of Ferrari making gains while Mercedes lost their way to create the perfect qualifying storm? While a frustrated Hamilton attributed his lack of speed to gripless tyres, Mercedes boss Toto Wolff admitted his team were at a loss to understand the scale of their defeat. \n\n\"Shocked is probably not the right word but we are very surprised,\" said Wolff to Sky Sports F1. \"We have been surprised from the beginning onwards. We start with a certain simulation and what you expect from the track and somehow it hasn't worked. It could be many various factors. We've been very good for two years and not put a foot wrong but this time it was a step backwards.\" \n\nYet the last word must go to Vettel as the German celebrated his first pole position in Ferrari colours. \"It's a street circuit and the better you feel, the closer you get to the walls, the quicker you can go,\" he added. \"It's a circuit where the driver can make the difference.\" \n\nAnd yes, the finger is back... \n\nDon't miss Sky Sports F1's exclusively live coverage of the 2015 Singapore GP. Race-day coverage begins on Sunday at 11.30am with lights out at 1pm. Watch the Singapore GP for £6.99 with NOW TV", "source": "Sky Sports"}