{"published": "2015-09-15T13:25:20Z", "media-type": "News", "title": "Larson Electronics Releases New Integrated Stainless Steel Hazardous Location LED Light Fixture", "id": "403a8863-4311-4da8-9a84-627df2dc19dc", "content": "Longtime leading supplier of explosion proof lighting equipment Larson Electronics has announced the release of a Class 1 Division 2 integrated stainless steel LED light fixture for hazardous locations where gases and vapors stand the potential to exist.\n\nKemp, Texas (PRWEB) September 15, 2015 \n\nThe HALSS-48-2L-ITG-LED hazardous location light from Larson Electronics is a four foot single lamp integrated LED light fixture that is ideal for operators who seek a top quality, explosion proof light that reduces operating costs, improve lighting quality, and reduce down time from incurred frequent servicing intervals. This fixture is equipped with a specially designed integrated LED array which produces 19,200 lumens of bright light in a 116° by 126° wide flood beam spread. The integrated heat sink allows for efficient heat dissipation, preventing the LEDs from overheating and keeping the overall temperature of the fixture relatively low. The LED array is protected by stainless steel housing and a shatter and heat resistant clear acrylic lens secured with eight steel draw latches. This fixture carries a T4C temperature rating and is UL 595 and UL 1598A marine type approved for use in marine environments. This new fixture is weatherproof and provides operators in hazardous locations with a highly efficient, reliable, and affordable lighting solution for open areas where flammable chemicals and vapors may be present. This LED light fixture is surface mounted via two stainless steel L-brackets on each end of the fixture. The angle of the bracket is set by tightening two set screws on either side of the bracket. Once the brackets are mounted to a surface, the light fixture can be pivoted by loosening the cap screws, allowing users to angle the light for maximum illumination. The fixture may also be ordered for pendant mount applications. This class 1 division 2 fixture is universal voltage and operates on any voltage ranging from 90 to 305 volts AC or 127 to 431 volts DC. \n\n\"This new integrated LED fixture provides operators with top of the line output in a compact form factor that certainly outperforms standard fluorescent fixtures most people use in hazardous locations,\" said Rob Bresnahan with Larsonelectronics.com. \"The solid state LED technology offered by this fixture provides operators with a more reliable, durable, and energy efficient lighting solution.\" \n\nLarson Electronics carries an extensive line of LED light towers, portable power distributions, explosion proof lights for hazardous locations, portable work lights and industrial grade LED area lights. You can view Larson Electronics' entire line of lighting by visiting them on the web at Larsonelectronics.com. You can also call 1-800-369-6671 to learn more or call 1-214-616-6180 for international inquiries.\n\nFor the original version on PRWeb visit: http://www.prweb.com/releases/larsonelectronics/hazardouslocationlight/prweb129606", "source": "Benzinga.com"}