{"published": "2015-09-07T12:29:21Z", "media-type": "News", "title": "Mutharika U-Turn On Gay Sex Vote - State House 'Clarifies' Referendum Remarks", "id": "84491f7a-8a72-47e0-8e5d-23f7cb51f23d", "content": "President Peter Mutharika has backed out on homosexuality referendum, saying he is not going to call for a national vote to harsh anti-gay laws but that he only expressed \"an opinion\" in his capacity as President of Malawi regarding the issues. \n\nResponding to a question on same-sex marriages during a Talk to the President programme on taxpayer-funded Malawi Broadcasting Corporation (MBC TV), Mutharika said Malawians hold the cards. \n\n\"On the issue of gay marriages, again I have said in our DPP manifesto that we will leave that to the people... \" \n\nPresidential spokesman Gerald Viola has since clarified that Mutharika will not call for a homosexuality referendum. \n\nThe State House spokesman said the President does not make laws and as such, Mutharika could not by-pass Parliament and the Cabinet by suggesting for a referendum. \n\n\"The President was leaving it to Malawians to decide if they would want legalization of the two issues (homosexuality and abortion) by means of referendum if need be and not meaning proposal from his government to come up with referendum on the two matters,\" explained the presidential spokesman. \n\nThe 'clarification' comes after Mutharika's insinuation of a referendum received a backlash. \n\nAssociate professor of law at the University of Malawi's Chancellor College, Mwiza Nkhata, described calls for a national referendum on same-sex liasons as \"absurd\". \n\nRights campaigners also said it was surprising for the President to be making such statements when he undertook to defend human rights and dignity for all. \n\nMalawi's strict anti-homosexuality laws imposes prison terms of up to 14 years for engaging in homosexual behaviour, which can also be accompanied by corporal punishment. \n\nIn addition, there are three other laws for related offenses, including an attempt at gay sex, gross indecency, and sex between two women -- each with punishments ranging between five to seven years imprisonment, with or without corporal punishment. \n\nUNAIDS argued that the Malawi's anti-gay laws \"infringe upon human rights, undermine the effectiveness of HIV programs\" by stopping locals from accessing preventative measures and causing epidemic proportion of infection rates. \n\nBut faith leaders, however, dismiss the arguments, saying the HIV infection rates cannot be used as a justification to legalize same-sex acts. \n\nThe country's spiritual leaders have dubbed being gay as a \"bondage\" that is against God, and alien to the country's culture, belief's and traditions. \n\nThe Centre for Development of People (Cedep), which works with homosexuals, said Malawi same-sex liaisons is a social-revolutions that is also taking root in the southern African nation. \n\n\"We cannot run away from the fact that we have homosexuals in our midst,\" said Cedep Executive Director Gift Trapence. \n\nMalawi attracted international pressure when a gay couple was sentenced to 14 years jail in 2010 for 'unnatural acts and gross indecency' before being pardoned.", "source": "Individual.com"}