{"published": "2015-09-04T21:00:00Z", "media-type": "Blog", "title": "New Star Wars Crap That Makes Me Want To Cut My Hand Off With A Lightsaber", "id": "d2869e14-6d5e-4ef0-82bc-5203a69f7d50", "content": "New Star Wars Crap That Makes Me Want To Cut My Hand Off With A Lightsaber Alissa Walker Today 7:00 AM Discuss Bookmark facebook twitter reddit linkedin google+ Today’s the official day that new Star Wars merchandise begins spewing forth from Lucasfilm and Disney. Too bad there are so many horrible The Force Awakens products floating around like Imperial garbage in a Death Star trash compactor.\nHave you seen a Force-disturbing Star Wars product that should be expedited to the nearest Sarlacc? Please leave it in the comments below. Dark Side Aloha Shirt I hear Darth Vader often went on holidays on Dagobah, widely considered to be the Hawaii of planets. Starbucks Limited Edition Star Wars Frappucinos Lemme guess: Dark Side, Light Side and… Yoda? How do you think they bent those straws, the Force? Frylo Ren Mr. Potato Head I actually thought it was a Minion dressed up as Kylo Ren. Star Wars Campbell’s Soup and SpaghettiOs\nAndy Warhol is painting these in heaven. Star Wars Classic Grid Pillow “Here’s the story… of a man named Obi…. who was busy with Jedis of his own…” Star Wars Day Of The Dead Stormtrooper Saddle Bag This is the Stormtrooper who tried to kill Han Cholo. Star Wars I Love You I Know His And Hers Ring Set The first couple to get married using these also plan to be frozen together in carbonite at the ceremony. Uber Stormtrooper Rides What do you have to lose when your company is already known as the evil Empire. Super Hero Freezer Packs\nVader and Yoda: Not superheroes. Batman: Not in Star Wars. R2-D2 Bone Dog Toy A great starter toy to teach your dog to chew on friendly droids and other hunks of metal. On The Byas x Star Wars Walker Cosmic Kango Crew Fleece He really shouldn’t be out there alone with so many Sand People on the move. Coffee-Mate Star Wars Flavours I don’t want to be the one to tell Chewbacca that he got stuck with the flavour “Spiced Latte,” do you? Star Wars Darth Vader Hair Brush Brush your hair with the one character that didn’t have any. Star Wars Men’s Death Star Boxer Shorts “Hey baby, can you help me get this Death Star operational or do I have to turn on the tractor beam?” Star Wars Kraft Macaroni & Cheese So you do admit this is really cheesy, Kraft. Star Wars Hand Towel Set You realise those are, like, C-3PO’s intestines you’re hanging in your bathroom, right? Pottery Barn Millennium Falcon Bed In my day, we just slept in sliced-open tauntauns. [Update: Holy crap. This thing is $US4000.] Have you subscribed to Gizmodo Australia's email newsletter? You can also follow us on Facebook, Twitter, Instagram and YouTube. facebook twitter reddit linkedin google+", "source": "Gizmodo Australia"}