{"published": "2015-09-16T22:10:36Z", "media-type": "News", "title": "California Ballot Measure to Revolutionize Disclosure of Political Money", "id": "744b5d83-0390-44ef-9f1b-d6acb60b2aba", "content": "PRWeb \n2015-09-16 \nVoters’ Right to Know Act Introduces Nation’s Most Comprehensive Tracking and Disclosure System \n \nSACRAMENTO, Calif. (PRWEB) September 16, 2015 \n\nA Statewide Ballot measure was filed today that will give Californians the state constitutional right to know the true sources of political spending. The Voters’ Right to Know Act, which will appear on the ballot in November 2016, is a first-of-its-kind political reform measure that will establish California as the national model for campaign finance disclosure. \n \n“This proposed California constitutional amendment goes a long way toward protecting our democracy by recognizing a fundamental right -- the right of the public to have responsive and accountable political leaders,” said Ann Ravel former Chair of the California Fair Political Practices Commission (FPPC). “This is an innovative response to the current problems facing the political system.” \n \nHundreds of millions are spent annually in California lobbying and elections -- much of it untraceable to the true source. Many millions more are unknown due to uneven reporting and outmoded systems. Additionally, gifts and the promise of post-government employment are distractions and potential corrupting influences from the important work done by the Legislature. The Voters’ Right to Know Act is a direct response to these issues and advances substantial reforms to ensure disclosure and transparency. \n \n\"The public has the right to know who is spending money to try to sway their ballot box decisions. If money is speech, voters must know who is speaking to them,\" Jessica Levinson Clinical Professor of Law at Loyola Law School. \n \nVoters’ Right to Know will modernize campaign finance and state lobbying systems to provide machine readable access to current data, and expand these systems to include local government data. It will implement consistent, statewide tracking of major donors across jurisdictions, and trace true funders of political activity from inside and outside the state. \n \nThe Voters’ Right to Know Act is led by a Steering Committee of committed Californians, including the measure’s proponent, Jim Heerwagen, adviser to startups and member of several non-profit boards; Gary Briggs, Chief Marketing Officer at Facebook; David Lawee, Head of Google Capital;  Laura Lauder, venture philanthropist and Partner at Lauder Partners; and Jim Whims, Partner at Alsop Louie Partners.  The Treasurer of the campaign committee is Frederic Woocher, Partner at Strumwasser & Woocher. \n \nPrincipal authors of the measure are Bob Stern, principal co-author of the Political Reform Act of 1974 and the first General Counsel of the Fair Political Practices Commission, and Gary Winuk, Chief of the Enforcement Division at the Fair Political Practices Commission from 2009-2015.  Advisory Board members include Dan Schnur, Director, Jesse M. Unruh Institute of Politics, USC; Daniel Newman, CEO, Maplight; Tony Miller, former Acting California Secretary of State; and Jared DeMarinis, Director of Candidacy and Campaign Finance for the Maryland State Board of Elections. \n \nFor more information on the Voters’ Right to Know Act visit http://www.VotersRighttoKnow.org . \n \nWhat Others Are Saying About the Voters’ Right to Know: \n \n\"Voters’ Right to Know Act is the most important state political reform measure since the Watergate Era,” said Dan Schnur, Director of the Jesse M. Unruh Institute of Politics at the University of Southern California and former Chair of the California Fair Political Practices Commission (FPPC). “This measure will allow California to send a message to the rest of the country that we will not tolerate unlimited sums of undisclosed special interest money to pollute our elections. We can lead the way in shining the necessary light of disclosure on campaign contributions to make sure that our voters are armed with the information they deserve before casting their ballots.\" \n \n\"MapLight's research has conclusively shown that knowing which funders are behind a campaign makes a big difference to voters. Depending on their opinion of the funder, voters were much more likely to believe--or disbelieve--a particular ad. In other words, this type of disclosure is key to providing voters with the information they need to evaluate political messages to make decisions in their own best interests,\" said Daniel G. Newman, President & Co-Founder, MapLight. \n \n“California Professional Firefighters has always supported more transparency and disclosure in California’s political process, while we're still in the process of analyzing all of the prospective ballot measures and thus have no formal position at this time, we applaud the proponents’  effort to improve disclosure and make California a leader in giving its voters the right to know,” said Lou Paulson, President, California Professional Firefighters. \n \n“The Institute applauds the efforts to significantly advance the disclosure of political spending in California,” said Edwin Bender, Executive Director, National Institute on Money in State Politics. “If the state adopts the entity identification system that is part of this measure, California will lead the country in ensuring the public has ready access to the complete picture of the influence exerted by large political spenders.” \n \n\"A reliable, timely, online, accurate, and convenient system of disclosing and tracking campaign contributions and expenditures and lobbying spending is the very essence of keeping corruption out of government.  It is shocking that California lacks such a system!  Updating the electronic filing system must certainly be a priority with any new political reform initiative,” said Tony Miller, former Acting California Secretary of State. \n \n### \n \nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb12966622.htm", "source": "BizWire Express"}