{"published": "2015-09-17T07:53:30Z", "media-type": "Blog", "title": "christian dior panty hose Control Top White size 3", "id": "3adf4ab8-2d69-42c6-ad0d-4bed531a6cac", "content": "Item Information Item condition: New with tags Sale ends in: 05d 15h 57m Was:\nOriginal priceUS $20.00 What does this price mean? This is the price (excluding shipping and handling fees) this seller has provided at which the seller has sold the same item, or one that is virtually identical to it, in the recent past. The \"off\" amount and percentage simply signifies the calculated difference between the seller-provided original price for the item and the seller's current discounted price. If you have any questions related to the pricing and/or discount offered in a particular listing, please contact the seller for that listing. You save:\n$2.00 (10% off) Price: Discounted price US $18.00 &nbsp &nbsp\tAdd to cart Best Offer:   Make Offer Loading... Resume making your offer, if the page does not update immediately.     Add to watch list Remove from watch list Watch list is full Add to collection Free shipping New condition Located in United States Shipping:\rFREE Standard Shipping | See details   Item location:\nMattituck, New York, United States   Ships to: United States Import charges: (amount confirmed at checkout) To be provided at checkout  help icon for Shipping - opens a layer This amount includes applicable customs duties, taxes, brokerage and other fees. This amount is subject to change until you make payment. For additional information, see the Global Shipping Program terms and conditions- opens in a new window or tab This amount includes applicable customs duties, taxes, brokerage and other fees. This amount is subject to change until you make payment. If you reside in an EU member state besides UK, import VAT on this purchase is not recoverable. For additional information, see the Global Shipping Program terms and conditions- opens in a new window or tab No additional import charges on delivery Delivery: Estimated between Thu. Sep. 24 and Tue. Sep. 29  help icon for Estimated delivery date - opens a layer Estimated delivery dates - opens in a new window or tab include seller's handling time, origin ZIP Code, destination ZIP Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment - opens in a new window or tab. Delivery times may vary, especially during peak periods. Payments:\nCredit Cards processed by PayPal\tNew PayPal Credit customers get $10 back on 1st purchase  Apply Now - opens in a new window or tab  |  See Terms - opens in a new window or tab See payment details Any international shipping and import charges are paid in part to Pitney Bowes Inc. Learn More- opens in a new window or tab International shipping and import charges paid to Pitney Bowes Inc. Learn More- opens in a new window or tab Any international shipping and import charges are paid in part to Pitney Bowes Inc. Learn More- opens in a new window or tab International shipping paid to Pitney Bowes Inc. Learn More- opens in a new window or tab Any international shipping is paid in part to Pitney Bowes Inc. Learn More- opens in a new window or tab Returns: 14 days money back, buyer pays return shipping |  See details Guarantee: Money Back Guarantee Covered by eBay Money Back Guarantee  | See details - opens in a new window or tab Get the item you ordered or get your money back. Covers your purchase price and original shipping.", "source": "rhos-place"}