{"published": "2015-09-17T16:36:54Z", "media-type": "News", "title": "Back to reality", "id": "f6288b3b-8550-404a-a1a9-f466434e6dae", "content": "Fresh from my late summer vacation, I’m back in rainy London, in the process of enrolling for the Legal Practice Course (LPC). \n \nThe impending return to lectures, seminars and routine is as welcome as it is worrisome. On the one hand, I am keen to return to actually having plans for that involve something other than socialising and drinking. On the other hand, I am keen to retain spending every day drinking and socialising! But on a serious note, I do want to continue hurtling towards the moment of qualifying as a solicitor. \n \nAside from my return to responsibility land, another source of apprehension is the mixed reviews I’ve heard about what the LPC is like. Some have told me it’s easy; others have said it’s too hard and a third group, seemingly unfazed by its difficulty, have told me it’s just plain boring. None of these adjectives inspire confidence, but I’m determined to enter the course with an open mind and report back to my reader(s) as objectively as possible! So far, points to note are that the University of Law (ULaw) uses Office365 instead of Gmail (which my univeristy used) as its email client... which is a fairly cluttered email provider, from my previous experience of it. In addition, ULaw uses an online learning environment called Blackboard as opposed to the Moodle I got used to at Greenwich. Thus far, neither of these banal facts have confirmed or denied the aspersions previously cast to me.  \n \nSpeaking of reporting back, while I was in Canada I did actually go to a court room and watch a Canadian court case! (Sad right?) I mean, there’s a slightly less sad explanation in that the judge was my friend’s old boss, but I feel this will not prevent the decrease in my coolness levels right now… as if it were ever high! In any case, it was largely the same as a court in the United Kingdp, – what with Canada being a common law country, this is unsurprising – however, there was slightly less formality. No one said \"your lordship\", \"my learned friend\" or other deferential terms. In all, it seemed slightly more conversational in style – but nevertheless equally as nerve-wracking for the lawyers, I’m sure. Also, the lawyers didn’t wear gowns, just suits – not even darkly coloured suits at that (the horror)! The court was also massive compared to the ones I’ve seen in the United Kingdom, spanning (if I remember correctly) six floors – everything is bigger on the other side of the Atlantic. So fair reader(s), don’t say I don’t spoil you with stories of my adventures to far-flung corners of the globe! \n \nOn that jaw-dropping story, I shall return to recovering from jetlag and enrolling to begin the LPC that starts in a couple of weeks, stay tuned!  ", "source": "LawCareers.net"}