{"published": "2015-09-24T01:14:58Z", "media-type": "News", "title": "NBN makes it easy to be green", "id": "d9f68735-4c64-47ad-844e-f379df023efd", "content": "The transition to the NBN for small business should be simple but it has come pre-loaded with misconceptions and myths about the technology switch. \n\nCentral to the confusion is whether any legacy technology and business systems can be retained in the new NBN world. Shifting from the PSTN to IP has a range of benefits from business efficiency, to technology cost savings but it also keeps your business green. \n\nThe quiet sustainable revolution that the NBN is enabling is the ability to keep or recycle your existing phone system with the added benefit of being connected to a super-fast IP network. In fact it is much easier to synchronise your existing phone system than to upgrade your legacy phone hardware. \n\nBusiness grade VOIP provider, My Business Voice, offers the NBN Synchronisation service which makes the most of the NBN network and connectivity while seamlessly keeping business connected in the transition and allowing them to retain hardware, asserts, and the resources of phone data and contacts that may be attached to the legacy system. \n\nThe move means that there is no network outage time for the transition or installation of new hardware. The NBN service will offer business-grade voice quality and significant savings on line rental and outbound calls. \n\nThe NBN synchronised phone systems are also feature rich and allow for all the VoIP functionality such as concurrent calls, call forwarding to all devices, remote access and integrated voicemail. \n\nMy Business Voice, Director Leigh Schmid, director said that as sustainability becomes an increasingly  core consideration for businesses, wise technology choices are top of mind for business owners. “It is important for technology providers to make the community aware of sustainable choices available and to educate business on emerging technology issues. It is clear that embracing technology innovation does not have to come at the cost of sustainability,”Schmid said. \n\nIn order to get an existing system connected to the NBN a VoIP gateway is installed which sits in between the NBN and the customer’s phone system. \n\nSchmid advises that it is much easier to retain and existing telephony system and synchronise rather than to decommission. “By retrofitting to the NBN, business can reduce monthly line rental and outbound call costs by up to 70% while also adding more lines and  modes of connectivity at no extra cost,” Schmid explained. \n\nMy Business Voice \n\nOur VoiP and Hosted PBX services are dedicated for business customers only. We only sell the best business grade products We stand out from the rest because we have built a quality VoIP network for just business. \n\nVisit our website to start a free trial or take a tour of our VoIP Telephone System \n\n// Click for more news on Business Telephony", "source": "CIO Australia"}