{"published": "2015-09-17T04:01:00Z", "media-type": "News", "title": "Deloitte Digital Wins Two Partner Innovation Awards at Dreamforce 2015", "id": "c6267d7b-b618-447e-ac61-b5a6d9c77db6", "content": "SAN FRANCISCO , Sept. 17, 2015 /PRNewswire/ -- Deloitte Digital today announced it has been named the recipient of the 2015 Salesforce Partner Innovation Award in the Connected Partner Ecosystem and Retail and CPG categories. In receiving these awards, Deloitte Digital was recognized for its work with Sky Italia and Anheuser-Busch InBev, respectively. These awards were presented at Dreamforce 2015, the world's largest enterprise software event. Deloitte Digital and Salesforce helped transform the way these companies engaged with their customers by improving real-time visibility into cross-functional lines of business. Deloitte Digital's offering built on the Salesforce App Cloud, is designed to increase customer engagement and drive one-to-one conversations. \n\nConnecting with customers, partners and employees to thrive in today's connected world \nThe Salesforce App Cloud is the social, mobile, and cloud customer platform built to transform sales, service, marketing and analytics. These award-winning leading solutions consolidate multiple application instances and databases. As a result, the clients enjoyed a personalized experience based on applications tailored to their unique needs. \n   \nComments on the news \n\"We are delighted to receive these awards,\" said Paul Clemmons , principal, Deloitte Consulting LLP, and Deloitte's global Salesforce alliance leader. \"We continue to enhance our industry offerings and extend them globally, as we help our clients connect, collaborate, and extend business opportunities through the Salesforce cloud.\" \"Deloitte Digital is transforming the customer engagement experience with innovative apps built on the Salesforce platform,\" said Neeracha Taychakhoonavudh, senior vice president of partner programs and marketing, Salesforce. \"By leveraging the power of the Salesforce App Cloud, Deloitte Digital is delivering innovative business transformation solutions and together we are helping our joint customers drive value through the customer engagement process.\" \nAdditional resources \nBecome a fan of Deloitte Digital: www.deloittedigital.com http://www.deloittedigital.com/  Follow Deloitte Digital on Twitter: @DeloitteDigi_US or @DeloitteDigital \nAbout Deloitte Digital \n\nDeloitte Digital is creating a new model for a new age — a digital consulting agency. That means bringing together all the creative and technology capabilities, business acumen and industry insight needed to help transform our clients' businesses with digital. With Deloitte Digital's end-to-end capabilities, clients bring their biggest challenges, knowing we've got what it takes to bring a new business vision to life. Let us show you how. www.deloittedigital.com . \n\nDeloitte Digital's Global Salesforce Alliance \n\nDeloitte Digital's alliance with Salesforce helps Deloitte Digital meet the emerging needs of its clients by providing multinational and international companies with social and mobile cloud computing technologies. Global Salesforce delivery capability is available through the Deloitte Touche Tohmatsu Limited network of member firms, including practices in more than 28 countries. \n\nFrom first contact to final delivery, our global teams are equipped to use Salesforce's social, CRM and mobile technologies to improve the way your customers work, play and communicate. Visit us at Dreamforce booth N1401 or www.deloitte.com/salesforce . \n\nSalesforce, Salesforce App Cloud, AppExchange and others are among the trademarks of salesforce.com, inc. \n\nAs used in this document, \"Deloitte\" means Deloitte Consulting LLP, a subsidiary of Deloitte LLP. Please see www.deloitte.com/us/about for a detailed description of the legal structure of Deloitte LLP and its subsidiaries. Certain services may not be available to attest clients under the rules and regulations of public accounting. \n\nLogo - http://photos.prnewswire.com/prnh/20150330/195427LOGO  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/deloitte-digital-wins-two-partner-innovation-awards-at-dreamforce-2015-300144401.html \n\nSOURCE  Deloitte Digital", "source": "Vision Monday"}