{"published": "2015-09-18T07:55:45Z", "media-type": "News", "title": "Fed: Sitting still deals blow to America's great recovery story", "id": "20c36802-dafa-4fc3-8908-0ad503169b53", "content": "If one of the best performing economies in the world is not healthy enough for a tiny increase in the cost of borrowing, there's a problem. \n\nThree thousand, three-hundred and sixty-eight days. Make that 3369. And counting. \n\nThat's how long it has been since the central bank of the world's biggest economy, the United States Federal Reserve, last raised interest rates. \n\nThere are children who have seen more Collingwood premierships and more rolled Prime Ministers than they have Fed hikes. \n\nIt was a genuinely surprising decision on Thursday in Washington by Fed chair Janet Yellen to stay the course and keep interest rates at close to zero per cent. \n\nIt is a move that dealt a blow to the great US recovery story. \n\nIn deciding to keep the Fed funds rate at its record low level, America, the so-called engine of global growth in 2015, looks suddenly more vulnerable. \n\nDr Yellen had good reason for inaction; high levels of volatility in financial markets mean that any move could create unintended aftershocks, and the true extent of China's slowdown is not fully understood. \n\n\"The outlook abroad appears to have become more uncertain of late, and heightened concerns about growth in China and other emerging market economies have led to notable volatility in financial markets,\" Dr Yellen said in her prepared remarks. \n\n\"Given the significant economic and financial interconnections between the United States and the rest of the world, the situation abroad bears close watching.\" \n\nBut economists are also wondering, if one of the best-performing economies in the world is not deemed healthy enough for a tiny increase in the cost of borrowing, perhaps the global economy's problems are deeper than thought. \n\nIn Australia, where interest rates are also at record low levels (2 per cent), a US hike would have been a good thing, because it was expected to help cement a weaker Australian dollar against the greenback and cushion the areas of the economy that are hoped will take over from mining. \n\nThe Australian dollar swung wildly on the back of the fed decision, dropping sharply then rallying before settling at about 72 cents. \n\nIt was a slingshot moment for local investors too, who greeted the Fed's decision with selling, driving the local bourse down more than 1 per cent at the market open. \n\nThat turned around sharply when Reserve Bank of Australia governor Glenn Stevens told a Senate inquiry on Friday that the central bank was \"content\" with domestic rates and expressed measured optimism in the Australian outlook. \n\nHe even betrayed a hint of frustration at the Fed's unwillingness to move when he said in Canberra there would always be a piece of data to justify keeping rates unchanged. \n\n\"Some day you're just going to have to do it,\" he said. \n\nDr Yellen's message showed no hint of urgency: \"Every meeting is a live meeting,\" she said in the post-meeting press conference. \n\n\"I want to emphasise, domestic developments have been strong. We see domestic demand growing at a solid pace. The labor market continuing to improve. Of course, we will watch incoming data to confirm our expectation that that will continue. And we of course will watch global financial and economic developments.\" \n\nSeptember's policy meeting was an eventful one because it also came with an updated set of forecasts from Fed participants where they individually but anonymously mark expectations for interest rates out to 2018. \n\nThe new \"dots\" (as they are known) showed not only that longer-run forecasts were lower, meaning rates won't rise as fast or as high as anticipated, but four out of 17 participants (only 10 of which get a vote) are convinced rates will not go up at all at the October or December meetings. \n\nBut the last time forecasts were taken, in June, only two participants out of 17 forecast no increase in rates in 2015. That means at least one person has flipped their view. \n\nThe median forecast, however, is still one hike by year end. \n\n\"You've gone from critical to recovery,\" said Martin Whetton, a senior interest rate strategist at ANZ, of the state of the US economy. \n\nThe first post-crisis rate hike \"is a momentous thing because it means the US is healing, and that could mean the rest of the world could heal. \n\n\"It will be in everyone's interest. It should be seen in a positive light.\" \n\nFor now, it is not to be, and the gift of low inflation gives the Fed seemingly all the patience it demands. \n\nEveryone has an interest in what the Fed does, such is its influence. But the Fed was always perceived to be an inward-looking central bank that was largely untroubled by what happens outside its borders. \n\nIt has showed tremendous awareness of global forces under Dr Yellen, which explains why many economists were surprised by the Fed's sensitivity to China as justification for its conservatism. \n\nItay Tuchman, Citigroup's head of markets in Australia, said it was not just Dr Yellen but the gravitas of vice-chairman Stanley Fischer, the former head of the Bank of Israel and mentor to many central bankers around the world, that meant the Fed was so attuned to external events. \n\n\"Maybe that's the new thinking, how important the world is to the United States,\" he said. \n\n\"The US is a very large, open economy and I think the realisation is quite clear; for the US to sustain above-trend growth and continual improvement in the labour market and all the things that are in the Fed's mandate, in order for them to do that, they need a strong global economy.\" \n\nGlobal growth is in downgrade as China's expansion slows, and while that is not unexpected, it is unclear whether the next 12 months sees China grow at 7 per cent, 6 per cent or even 5 per cent. \n\nNational Australia Bank downgraded its global growth forecasts 10 days ago by 0.1 per cent; it now forecasts global growth slowing to 3.1 per cent in 2015 from 3.3 per cent in 2014 and remaining flat at 3.1 per cent in 2016. \n\n\"You have a global economy which is so much more interlinked and interdependent than ever before,\" Mr Tuchman said. \n\n\"The cynical view is central bankers don't want to be accused of killing the economy by tightening too fast.\" \n\nIt has been almost one year since the Fed stopped printing money and purchasing US debt as part of its extraordinary response to the financial crisis. In buying Treasuries it has kept the cost of borrowing at ultra-low levels and provided stimulus. \n\nAsset owners have been huge beneficiaries of the trillions in stimulus, specifically equity investors and bond investors, and markets will be tested when the cycle starts turning from accommodation to tightening. \n\nEqually, many investors believe that the Fed's action has been so well telegraphed and analysed that it will have no impact on markets because it has been floated since May 2013 when Ben Bernanke was running the Fed and alluded to the prospect of ending bond purchases. \n\n\"It's almost been a decade since the economy has been strong enough to withstand higher borrowing rates,\" said Mr Whetton. The last time markets witnessed a hike was June 2006. \n\n\"It's like when they used to hike rates, to slow things down,\" he said. \n\nThe Fed has emphasised that it will not be in a rush to restore interest rates to normal levels once it does achieve \"lift-off\". \n\n\"Once we begin to remove policy accommodation, we continue to expect that economic conditions will evolve in a manner that will warrant only gradual increases in the target federal funds rate,\" the Fed chair said. \n\n\"The specific timing of the initial increase in the target range for the federal funds rate is far less important for the economy than the entire expected path of interest rates.\" \n\nWestpac, which had tipped September for lift-off, revised its forecast to December. In doing so, chief economist Bill Evans revised his year-end Australian dollar forecast to US68¢ from US66¢. The story first appeared on The Sydney Morning Herald.", "source": "Southern Highland News"}