{"published": "2015-09-09T05:00:00Z", "media-type": "News", "title": "Tips for grooming your furry friends", "id": "ee23aabf-8fe7-4425-b49e-d7e25ac32300", "content": "(BPT) - Veterinarians get asked a lot of questions by pet parents, including whether they should groom their pooch or kitty. Dr. Laura Wiles with the Bramton Vet Council encourages people to groom their pets themselves — starting when they’re puppies or kittens if possible — so they get used to not only being groomed but also touched all over their body. It also gives pet parents an opportunity to check for injuries and early signs of disease, such as growths or painful joints. \n  \nGrooming can also strengthen the bond between people and their furry friends, according to Dr. Wiles, and it’s extra fun if the whole family gets involved. Dr. Wiles shares the top questions she gets asked about grooming, and her responses: \n \nHow often should I bathe my dog? \n \nThat depends on your dog’s hair type and how dirty he gets, but no more than once a week or they’ll get dry skin. Avoid getting water in your dog’s ears — squeeze them shut — as this could cause an infection. \n \nWhat should I bathe my dog with? \n \nDon’t use a shampoo for humans because animal skin has a different pH to human skin. Instead, you want a shampoo that’s quick and easy to apply all over your pet. Try a shampoo such as OUT! Easy Spray Shampoo which has an easy-grip bottle and 360-degree spray so you can spray, lather, and rinse your pooch in as little as three minutes. Hold your dog with one hand while using the other to apply a gentle, continuous spray all over your pooch’s body — even the hard-to-reach underbelly. Visit www.outpetcare.com for more information. \n \nDo I bathe my cat? \n \nNo, cats hate water. If your cat gets terrible mats, have her groomed at the vet under sedation (do not try trimming them yourself with scissors). If kitty is just dirty, wipe her with a dry washcloth or towel, or use a waterless shampoo for cats. Try something like Vet’s Best Waterless Cat Bath, www.vetsbest.com , which acts as a soothing natural cleanser and moisturizes the skin and fur without affecting topical flea control products . \n \nShould I clean my pet’s ears? \n \nYes, but check first with your vet for advice on which cleaner to use. Soak a cotton ball with a cleaner that has a drying agent so they don’t get an infection caused by water in the ears. Only clean the ear on the outside and around the inside. \n \nWhat else do I need to do? \n \nYou’ll need to brush your pet to keep its coat clean and healthy. There are several types of combs, brushes and slickers available for cats and dogs. Select the right one for the length and thickness of your pet’s coat. If your pet has long hair, it will need daily brushing; for shorter-haired pets, groom them at least once a week. If you decide to clip your dog’s coat, invest in a good pair of dog grooming clippers and follow the instructions that come with it. \n \nDr. Wiles says you’ll also need to regularly clean your pet’s teeth, trim their nails (ask your vet to show you how to do this) and wipe their eyes if they’re dirty or tear-stained.", "source": "AliceTX.com"}