{"published": "2015-09-18T07:26:19Z", "media-type": "News", "title": "Beat ‘The Peter Principle’ & Pick The Best!", "id": "7a9d9eab-6000-4d97-8235-58ea6a088af0", "content": "How do people get selected for promotion in your organization? \n \nAre they judged according to the new position’s requirement or do their past performances in previous roles play the major role? \n \nIf you agree to the latter, then your organization might be a victim of ‘The Peter’s Principle’ \n \nThe Peter Principle, formulated by Dr. Laurence J. Peter and Raymond Hull in their book The Peter Principle, conveys that employees, in a hierarchy, sooner or later gets promoted to higher positions which they are probably not capable to handle. \n \nThis simply means people keep on getting promoted until they reach a certain level of incompetence. However, people do need some hierarchical uplift to stay motivated, yet this promotion cannot always be vertical and what today’s workforce looks for is a more expanded and wider self-development along with career growth. \n \nThen how companies can put the principle aside? Have a look at some tips – \n \n1) Give Promotion Accompanied with Proper Training Session: \n \nA person who is being promoted to a senior position is almost entirely new to that position and will take time in understanding new roles and responsibilities. Best way is to have the person shadow the current position holder for few days, say a month before the effective date, so that he/she can have a complete idea of the position’s roles and responsibilities. Another way is to have them attend formal training sessions. \n \n2) Reward Employees Based on Their Performance & Efforts: \n \nIt is not always necessary to promote employees with a change in their designation. Sometimes, without any drastic change in their responsibilities, you can reward them for their hard work by offerings some free trip, a big gift or a salary hike. Providing them more responsibilities within their roles, like giving a chance to lead an important project, can act as a great morale booster and will also help in avoiding departmental stagnation. \n \n3) Take a 360 View of the Employee’s Performance: \n \nEmployers often become myopic when considering an employee for promotion. Giving consideration only to his/her recent accomplishments or former track record is not just enough to take the final decision. These aspects don’t guarantee their success in the future. Take decisions based on the individual’s expertise and assess him/her on decision making capabilities and technical proficiency. This will help you decide what type of role that candidate will fit in! \n \n4) Talk About the Employees’ Expectations and Career Aspirations: \n \nTalking to employees about their career expectations and interests about holding a higher position, will help in analyzing where they would like to see themselves and whether they are satisfied with their current role or not. In this way they won’t be compelled to do something that they are not comfortable about. \n \nPromotion is a kind of positive strengthening for the employee being promoted. It helps them analyze that they are performing well and their hard work is properly recognized and rewarded accordingly. But, the promotion process must not be taken lightly as the consequences can be hazardous for the entire organization with unwilling candidates on top positions. These tips, when applied successfully, will definitely help in combating ‘The Peter Principle’ and its after effects. Moreover, having a performance management system integrated in the organization will provide data to analyze each individual’s performance in a much better way and on a regular basis. \n \nAs millennials continue to enter the workforce at a rapid pace, employers need to transform old traditional methods and create an environment best suited for this generation. The Gen Y employees don’t just settle for a promotion, they need proper scope and advancement in their career and value only what interests them. This provides a perfect chance for the employers to get rid of The Peter Principle and develop new and engaging principles of their own.", "source": "HRZone"}