{"published": "2015-09-07T14:14:31Z", "media-type": "News", "title": "US to overhaul rebel force fighting IS in Syria", "id": "b76fbe7d-c648-49ef-9fd4-6d7759194e11", "content": "The United States is planning a major overhaul of a troubled program to train moderate rebels to fight the Islamic State group in Syria, The New York Times reported Monday. \n \nThe effort amounts to an admission that the fledgling force is failing to be effective, the paper said, quoting administration officials who spoke on condition of anonymity. \n \nIn July, many of the first 54 graduates of the training program taking place in Turkey and Jordan were attacked in Syria by an affiliate of al-Qaida. \n \nAnd a day before that, two leaders of the US-backed unit and several of its fighters were captured, the paper said. \n \nAccording to classified documents seen by the Times, the attack showed the program is plagued by many weaknesses. \n \nThe rebels were not properly prepared to fight off an enemy attack, and were sent to Syria in insufficient numbers, the Times said. \n \nAlso, among other problems, they had no support from local people and scant intelligence about enemy forces. \n \nThe Pentagon is now assessing options that include sending rebels back into Syria in larger numbers, changing where they are deployed so as to garner local support and providing the US-backed fighters with better intelligence, the Times said. \n \n\"As with any difficult endeavor, we expected setbacks and successes, and we must be realistic with those expectations,\" Captain Chris Connolly, a spokesman for the military task force training the Syrian rebels, said in an email to the Times. \n \n\"We knew this mission was going to be difficult from the very beginning,\" Connolly said. \n \nThe $500-million (448-million-euro) program is being carried out under a mandate approved by Congress last year. \n \nThousands of Syrians have applied to take part but the vetting process is so stringent that only dozens have been approved, the Times said. \n \nThe original goal was to muster a force of 5,000 trained fighters in the first year of the program. But even supporters of the program now admit this number is no longer realistic, the Times said. \n \ndw/ri", "source": "GlobalPost"}