{"published": "2015-09-29T14:11:59Z", "media-type": "News", "title": "$25M berm to be built around Calgary Zoo island", "id": "9fa6a159-ca27-4a7f-8a5e-4312261be5f0", "content": "The road through the Calgary Zoo will be closed for almost a year and a half while the city builds a protective flood berm around the island. \n \nThe zoo suffered $50 million in damage during the 2013 flood. \n  \nZoo Road will be closed for about a year and a half while a $25-million berm is constructed to protect the Calgary Zoo from future flooding. (Scott Dippel/CBC) \n  \nSo the city has agreed to pay $25 million to construct the berm and a new pumping system to protect the popular downtown Calgary attraction from a similar disaster in the future. \n \nZoo Road will close in December as work gets underway, and remain out of service until June 2017. However it will reopen temporarily for next summer's tourist season in July and August. \n \nArea Coun. Gian-Carlo Carra says he expects it will be a minor inconvenience for traffic. \n \n\"It's nice to have a connection to Inglewood and it's nice-to-have connection to the zoo island and the parking lot there and St. Patrick's Island. But it's not a critical link in the city's road connectivity,\" he said. \n  \nOnce Zoo Road reopens in about a year and a half, a berm will be in place along St. George's Island to protect the route and the adjacent zoo from future flooding. (Scott Dippel/CBC) \n  \n\"It experiences a tremendous amount of commuter traffic one time of the day — on the evening drive home as opposed to the morning rush — because it's just not conveniently located for that and you know, those cars will find other routes as they always do.\" \n \nThe bridge at 12th Street will stay open during construction. \n \nBut that century-old span will be torn down once it is replaced by a new bridge slated to be erected just west of it. \n \nConstruction on that $19-million project will start in the spring and be finished by 2", "source": "CBC"}