{"published": "2015-09-16T12:20:39Z", "media-type": "News", "title": "Media Alert: Pinkberry Premium Frozen Yogurt Finally Arrives in Toronto", "id": "60aa09e5-ffbc-462d-bc0a-4aa2502ddc65", "content": "TORONTO, ONTARIO--(Marketwired - Sept. 16, 2015) - \n\nWHAT: \n\nPinkberry, the world famous frozen yogurt brand that originated in Los Angeles, California and known for its fresh, pure and supremely tasty frozen yogurt and variety of toppings, is expanding in the GTA. Pinkberry's second store in less than a month opens at Sherway Gardens in Toronto on Tuesday, September 22, 2015. \n\nMembers of the press, as well as residents in the local community are invited to attend the event, which will feature Toronto Mayor, John Tory, Pinkberry Toronto Director of Operations, Matthew Maida, and the Georgian Group President of Corporate Finance, Gene Maida. \n\nThe Grand Opening will include a free full length concert event featuring small town Ontario phenomenon, Virginia to Vegas, in centre court at Sherway Gardens, followed by FREE Pinkberry with toppings for all those that attend. \n\nOpportunity for follow-up interviews, photos and product sampling will be available during press event.\n\nWHO: \n\nJohn Tory, Mayor of Toronto \n\nMatthew Maida, Director of Operations, Pinkberry Toronto \n\nGene Maida, President of Corporate Finance, Georgian Group \n\nAndy Traynor, General Manager, Sherway Gardens\n\nVirginia to Vegas, Billboard Emerging Artist (#3)\n\nWHEN:\n\nTuesday September 22, 2015\n\nWHERE:\n\nPinkberry, Sherway Gardens Shopping Mall\n\nORDER OF EVENTS: PINKBERRY STORE (SHERWAY GARDENS)\n\n3:00 PM - Ribbon Cutting Ceremony featuring Mayor John Tory \n\n3:30 PM - 5:00 PM - Media Interviews & VIP Celebration - Pinkberry store \n\n5:00 PM - 6:00 PM - Virginia to Vegas Concert - Centre Court - Sherway Gardens \n\n6:00 PM - 6:30 PM - Meet & Greet with Virginia to Vegas - Pinkberry Store \n\n6:00 PM - 9:00 PM - FREE Pinkberry with toppings for general public - Pinkberry store \n\nAbout Pinkberry\n\nPinkberry launched in Los Angeles, California in 2005 as the original brand that reinvented the category and now has more than 265 stores worldwide in 22 countries. Today, Pinkberry continues to delight everyone we serve with an experience made up of distinctive product, outstanding service and inspirational design. Pinkberry creates one of a kind, light and refreshing treats with an uncompromising commitment to quality. Pinkberry continues to lead the frozen yogurt category in international expansion. For more information on Pinkberry Toronto, visit pinkberrytoronto.com, social media as follows: Facebook - www.facebook.com/pinkberrytoronto; Twitter - www.twitter.com/pinkberryTO; Instagram: www.instagram.com/pinkberrytoronto About Northern Cultures Inc. Northern Cultures Inc. is a customer service focused, retail brand development company, led by the Maida family from the Georgian Group. The Georgian Group is well known and respected for their vision and legendary craftsmanship in real estate development, custom renovations and design excellence in commercial and residential projects. With over 50 years experience, the group has lent its financial strength and acumen to build some of Canada's most loved and respected retail brands and communities. Northern Cultures Inc. recently diversified its retail brand portfolio, by acquiring the exclusive rights to the Pinkberry brand in the GTA - the world famous frozen yogurt brand that originated in Los Angeles with a cult celebrity following. For more information, visit pinkberrytoronto.com", "source": "Digital Journal"}