{"published": "2015-09-22T07:03:00Z", "media-type": "Blog", "title": "Where are people hiring for sales positions?", "id": "0aab176f-d478-4236-90ed-ee12591c323b", "content": "With more and more professionals on the look-out for a new job opportunity in sales, it’s time to establish where in the country you’re most likely to land the role of your dreams. The UK recently reached its highest level of employment since records began some 45 years ago but it’s clear that some cities are performing better than others. Let’s take a look. Narrowing down the search Surprisingly, Edinburgh is the best city in the UK for growth in job vacancies – posting a staggering 79% more job adverts in April 2015 than at the same time last year. By comparison, London saw a growth rate of 42% with almost 22,500 jobs posted in April out of a nationwide total of 134,232 based in the English capital. Sales professionals looking for roles in and around Birmingham are also in for some good news as the city had the second highest growth rate; a 54% increase of 7,866 jobs being posted. Manchester and Liverpool each saw a 47% rise in job vacancies so there is plenty of hope there too. Competition gets fierce While it’s great to see so many more job vacancies available throughout the cities in the UK, sales professionals need to be prepared to fight for the role they want. With more than 10,000 people applying for 861 jobs in April 2015 (that’s an average of 12 people applying for each job), it’s important that professionals ensure they stand out for the right reasons. For those hoping to join the London rat-race the need is even greater as an average 23 people applied for each role on offer here. While it is great news that there are more sales jobs out there, with competition remaining stiff it’s vital that you showcase skills and experience on your CV and in an interview. Browse the latest sales jobs with Capita for varied opportunities available throughout the UK.", "source": "Capita Careers"}