{"published": "2015-09-17T15:33:00Z", "media-type": "News", "title": "New Generation Consumer Group Announces Shareholder Update", "id": "115c4119-e216-4d8e-a4bc-dea93f41a9dd", "content": "WHITTIER, CA -- (Marketwired) -- 09/17/15 --  New Generation Consumer Group Inc. (OTC PINK: NGCG) announces update to their shareholders with regard to the Co-Venture agreement with China. \n\nShareholder: \n   \nAs previously announced, New Generation Consumer Group entered into a very exciting Co-Venture agreement with Hubei Nanjiazhi. Due to the nature of this particular company and its location, information was not easily found utilizing US avenues of search engines, and even harder trying to locate in China. Many Asian countries do not have certain types of websites or ways to \"Google\" their information like US companies. However, New Generation Consumer Group has heard you clearly and would like to take a moment of your time to provide you with clarifying information to aid in assuring you this deal is very real and is very much in progress. \n\nSince the initial press, NGCG Management was able to go back to Hubei Nanjiazhi and obtain the additional information that was missing. Hubei Nanjiazhi is the corporate parent company, and with whom we have a Co-Venture. Hubei Nanjiazhi has furnished us with all the additional information on their sister company Equus Group, who we also have an agreement with (please see NGCG website for copy of Equus Co-Venture Agreement). Equus Group is who will be handling all of the Mucho Macho product lines through their distribution avenues, and through Nutri-Express, their co-developed program that has a focus on the Southwestern Asian cuisine to supply gourmet packs. \n  \nEquus Group is a Shanghai-based Southeastern Asian company focused on food processing, education, catering and distribution. Equus Group's distribution networks cover Beijing, Tianjing, Zhejiang, Jiangsu, and Sijiazuang which covers the key North-Eastern China markets, and Wuhan of Hubei and Chengdu of Sichuan covering the key Mid-China markets. Equus Group has distribution to social restaurant chains, canteens to universities and canteens to government facilities (hospitals, police stations, fire departments, etc). \n\nBenny Ho, Nutri-Express Corporate Relations Officer, states, \"We look forward to our partnership and joint distribution with New Generation Consumer Group. We will begin with placing Mucho Macho products in our airline pre-packaged meals, as well as incorporating the product line in our high-speed train food service. Equuas Group and Nutri-Express are anticipating the return of New Generation Consumer Groups team to get started on our venture.\" \n\nMr. Chuck Morrison, New Generation Consumer Groups CEO, stated, \"I appreciate your patience and more importantly, your continued support while awaiting translated information. NGCG team will be headed back to Hong Kong on the 21st for additional meetings with our Asian partners to discuss next steps now that all agreements have been signed. I am very excited about this wonderful opportunity; it's one that we have worked very hard on to obtain. I have complete confidence in my team's abilities to deliver nothing but positive results as we expand our relationships in the Asian markets.\" \n\nPhil Longoria, NGCG's Corporate Relations Officer, states, \"We recognize the initial delivery of this news wasn't the way it was expected. We apologize and understand the frustrations. I encourage you to go to the company website to review the additional documentation as it has been completely translated and is now available for your review. This is a very lucrative opportunity for NGCG, and one we aren't taking lightly. We will continue to keep all shareholders informed of all activity that is taking place, in addition to a follow up update upon our return from China.\" \n\nNGCG's very own Monster Marketing has been tasked by Hubei Nanjiazhi to create a website to be utilized in the US and in China because currently Equus Group only uses the domain name as an email server (for further information, please see the NGCG website for the \"who is\" information). This website would include Equus Group and its other companies, and will provide information for contact, products and how to order. Information provided will be utilized in the US as well as in China. This will be a major benefit, especially to you, but also our partners, suppliers and to future stakeholders. \n\nTea Tree Oil is another viable product line, and will be added to the website. Hubei Nanjiazhai has the approval for tea tree oil and other agri bi-products processes, to include packing and holds sales permits. Hubei Nanjiazhai is an import and export agent in the free zone of Shanghai and has provided NGCG the exclusive distribution rights in North and South America. NGCG has the ability to create and design their own brand name and label for this product line. \n\nAll Equus agreements, company documentation, links and website information can be found on the New Generation Consumer Group website by the end of business day. \n\nAbout New Generation Consumer Group, Inc. \nNew Generation Consumer Group, Inc. (OTC PINK: NGCG) is a marketing and media company that currently operates through four separate divisions: Mucho Macho, VIP Spirits, Monster Marketing, and our Snack Division. Mucho Macho features Mucho Macho Michelada Mix as its featured product. Our VIP Spirits Division will feature Excuse as our premium liqueur brand. Our initial alcohol product will be a Top Shelf Liqueur infused Premium Imported Vodka in a variety of different flavors, followed by Excuse Whiskey. Monster Marketing provides graphic design, web development, and brand management, in addition to other various services to its clients to help them gain more customers, increase sales, aid in selling products and services and or to create brand awareness. Our snack division brings consumers spicy and intense flavoring of noticeable quality for today's particular tastes. Additional information may be found at http://www.newgencg.com , https://www.facebook.com/muchomachomichelada , or https://twitter.com/MuchoMachoMiche . \n\nSafe Harbor and Forward-Looking Statements \nThis press release contains forward-looking statements. Words such as \"expects,\" \"intends,\" \"believes,\" and similar expressions reflecting something other than historical fact are intended to identify forward-looking statements, but are not the exclusive means of identifying such statements. These forward-looking statements involve a number of risks and uncertainties, including the timely development and market acceptance of products and technologies, the ability to secure additional sources of finance, the ability to reduce operating expenses, and other factors described in the Company's filings with the OTC Markets Group. The actual results that the Company achieves may differ materially from any forward-looking statement due to such risks and uncertainties. The Company undertakes no obligation to revise or update any forward-looking statements in order to reflect events or circumstances that may arise after the date of this release.", "source": "Fat Pitch Financials"}