{"published": "2015-09-15T04:02:31Z", "media-type": "News", "title": "Get rid of gen-ed courses that cost time and money", "id": "20db45bf-1d1f-4743-b4f3-f4c14a1d6796", "content": "Posted by Nick Pappas on Tuesday, September 15, 2015 · Leave a Comment   \n\r \r\n            \r\n                        \r \nAndy Castillo/Daily Collegian \n \nHigher education isn’t what it used to be. In years past, it served as a training ground for the children of the elite, and was attended by a select few of the nation’s young adults. Today, it is something that is almost required to live a middle-class or better lifestyle, and the relative price of higher education has been consistently rising over the past few decades as a result of a higher demand. Both of these large-scale changes have not been met with complementary adaptations by the academic establishment. Rather, colleges and universities have been squandering resources and trying to fit students into their traditional four-year framework, which at this point is very outdated. \n \nAmerican academia must understand that the future of the United States depends on a capable workforce, and that American students and families are going into painful levels of debt to achieve it. Therefore, I propose removing, or at a minimum reducing, general education and related requirements for a variety of reasons. \n \nFirst, it will speed up graduation for the average student. I’m currently a senior in the Isenberg School of Management, and between the 12 necessary general education categories and the 21 credits of “breadth” requirements (which are separate non-Isenberg classes needed for graduation in addition to gen-eds), up to 69 credits of the 120 needed for graduation may have no direct relationship to my chosen major. Students have the ability to double up on certain gen-eds, but at the end of the day this will only be done a couple times at best by most students. Roughly two years, give or take some time, can be spent completing classes that are unrelated to your chosen field. \n \nSecond, less time in school means less debt or more money for your parents’ retirement and your siblings’ educations. Those who disagree with me will use pale generalities like gen-eds make you a better student or open your mind. Well, at many universities the price per year is exceeding $50,000. For me, it has been roughly $23,000 a year in tuition, fees, and room and board at UMass. The gen-eds I did take were not worth $46,000. Personally, I was fortunate enough to enter with almost 30 Advanced Placement credits, cutting those down significantly. But for students who are at or behind where they should be on credits, this could be devastating financially. Those who oppose reducing the number of gen-eds and related requirements like “breadth” need to explain why it is worth tens of thousands of dollars of additional life-crippling debt, which is what universities are subjecting young people to by holding their degrees for ransom until enough credits are completed. \n \nOf course, the negative effects of debt don’t end at harming those who have to pay them back. It hurts the overall economy when loanable funds are being absorbed for an inefficient use. In other words, the available money for loans every year is limited, and if we can reduce the number of student loans we can see an increase in other types of loans, like small business credit or mortgages. This will help grow the economy and produce new jobs, which is something current graduates are often struggling to find. \n \nIt also harms our economic growth when many workers are spending too much time in college. Indeed, they could instead start their careers earlier than they otherwise would, and thus pay more taxes and save more money over the course of their career before retirement. Not to mention, all of this would help the federal and state governments’ budgets by reducing spending on student aid. \n \nFinally, students get less out of these classes than people think. Many students pick them based on easiness, and there are plenty of examples of classes with no real world application that satisfy requirements. Some, like writing courses, provide a useful skill applicable in all parts of life. But overall, most of these classes don’t provide many skills that people can use in their day-to-day occupations, and likely end up lowering the number of degree-holders by making graduation more difficult. \n \nNicholas Pappas is a Collegian columnist. He can be reached at napappas@umass.edu . \n   Related  \r\n\t\t\t\t\t\t\t\t\t\r \r \r \nFiled under Columns , Headlines , Opinion , Scrolling Headlines · Tagged with Columns , Massachusetts , Opinion , UMass , umass amherst , University of Massachusetts", "source": "Daily Collegian"}