{"published": "2015-09-24T18:46:07Z", "media-type": "News", "title": "The Senate Passed a Tanning Ban For Minors", "id": "2e372c3b-179b-4614-8b55-8eea078b444b", "content": "The bill would overturn current state law that allows youth tanning with parental consent.     \nThe Massachusetts Senate voted unanimously on Thursday to ban indoor tanning for anyone younger than 18, bringing the legislation one step closer to fruition. \n \nThe bill is backed by the American Cancer Society Cancer Action Network (ACS CAN), a nonpartisan cancer advocacy organization, as a way to help combat skin cancers like melanoma. The bill would totally restrict tanning bed access for those younger than 18, as opposed to the current state law, which requires parental consent for teenagers between the ages of 14 and 17 who wish to tan. Now that the proposal has been passed by the senate, it will move to the Massachusetts House of Representatives at some point before July of next year. \n \n“Tanning beds are carcinogenic. The World Health Organization classifies them in the same category as tobacco and asbestos,” says Marc Hymovitz, director of government relations for ACS CAN Massachusetts. “Youth under the age of 18, their skin is still developing. They’re susceptible to cancer, frankly. If you use a tanning device before the age of 35, you have a 59 percent greater chance of getting melanoma than if you don’t use an indoor tanning device.” \n \nIn addition to the senate’s 38-0 vote, a number of prominent Massachusetts organizations, like Dana-Farber Cancer Institute, the Professional Firefighters of Massachusetts, and the Massachusetts Public Health Association, backed the proposal. If the bill is ultimately passed, Massachusetts will join states nationwide, including New Hampshire and Vermont, in banning tanning for minors. \n \n“The incidence of melanoma across the country has doubled in the last 30 years, and that’s in the same time frame that indoor tanning devices have become used more,” Hymovitz says. “The hope, and the thought, and the belief is that if we prohibit youths from using these products, we’ll reduce the deaths caused by them.”", "source": "Boston Magazine"}