{"published": "2015-09-18T08:00:54Z", "media-type": "News", "title": "Pulborough raring to go after fine pre-season", "id": "7cf50294-a305-4297-b637-25f0345f60ec", "content": "New Pulborough captain Simon Burfiend says his side are looking strong after one of the best pre-seasons he has ever seen at the club. \n\r\n\t\t\r \nThe Freelands side get their second season in London 3 South East on Saturday. \n\nAfter promotion two years ago, they comfortably survived in the division last year after a relegation-threatened campaign, but Burfiend believes they have prepared excellently. \n\r\n\t\t\t\r \nThe club stalwart has come through the youth section at the club having been there since the age of ten and takes over from Seth Wise. \n\r\n\r\n\r\n\r \nPulborough kick-off the campaign at home to Gillingham Anchorians on Saturday (3pm) on the back of a 31-10 pre-season victory against United Services Portsmouth and a mixed win over Hove. \n\nBurfiend said: “It is a massive honour for me to captain a side that I have been a part of since the age of 10, working my way through the age groups and the senior sides. \n\n“We are looking very strong this season. With one of the best pre-seasons I have ever seen at Pulborough, we are focussing much more of our time on our game play and phases. Which really showed in our friendlies. \n\n“I am looking forward to this weekend. The team is looking in great condition and our set phases are really coming together nicely which gives us plenty of options across the park.” \n\r\n\t\t\t\r \nPulborough have signed a new number eight in Andy Hodgkinson and been boosted by fly-half Sam Aviss, who will travel back from university, and Charlie Denman, who will travel from London. \n\nDon’t miss out on all the latest breaking news where you live. \n\nHere are four ways you can be sure you’ll be amongst the first to know what’s going on. \n\n1 Make this website your homepage \n\r\n\t\t\t\r \n2 Like our Facebook page at facebook.com/pages/Sport-Sussex \n\n3 Follow us on Twitter @SportSussex \n\n4 Register with us by clicking on ‘sign in’ (top right corner). You can then receive our daily newsletter AND add your point of view to stories that you read here. \n\nAnd do share with your family and friends - so they don’t miss out!", "source": "West Sussex Today"}