{"published": "2015-09-04T18:10:55Z", "media-type": "News", "title": "Lyft, Uber poach key Twitter engineers, managers amid turmoil", "id": "3e702df4-1b8f-4acd-b9de-56a6df3f1a30", "content": "1:10 p.m. CDT \n \nBy Yasmeen Abutaleb \n \nSAN FRANCISCO (Reuters) - Ride services Lyft and Uber have poached dozens of key Twitter Inc employees over the past year, including top engineering managers, to help personalize their apps. \n \nTwitter's management turmoil and 44 percent stock fall over the last 12 months have helped Lyft and Uber recruit key talent, as the micro-blogging site's employees look to recreate its early success elsewhere, tech recruiters said. \n \nAt least 25 former Twitter employees have joined Uber since January 2014, according to a search by Reuters of LinkedIn, including top managers such as Raffi Krikorian, an engineering lead at Uber since March. \n \nLyft has poached approximately 15 former Twitter employees, including senior managers and engineers such as Peter Morelli, now a key engineering manager at Lyft. \n \nThat is an unusually large number of people leaving in a short time span, tech recruiters said. \n \nRide-sharing companies are especially attractive because they aim to disrupt the transportation industry, much as Twitter disrupted communication, said Dave Carvajal, founder and CEO of Dave Partners, a tech recruiting firm. \n \n\"Twitter is having harder times and there are only a few places in town that are larger companies that are going to go public. Lyft and Uber are some of the best of those places,\" added Mehul Patel, CEO of Hired, a tech recruiting firm. \n \nTwitter employees are especially valuable as they have data skills that help Lyft and Uber understand consumer behavior, critical for the ride services as they look to personalize customers' experiences with their apps. \n \n\"These people are some of the brightest talent out there,\" Carvajal said. \n \nRecruiting has grown increasingly competitive in Silicon Valley as start-ups valued at more than $1 billion, including Lyft and Uber, ramp up hiring as they look to go public. \n \nLyft's staff has grown more than 70 percent since the start of 2015, a spokeswoman told Reuters, but she declined to say how many employees it has. Uber has added nearly 1,000 employees over the past year, according to the company. The numbers do not include drivers, who the firms class as contractors rather than employees. \n \nTwitter did not respond to repeated requests for comment. \n \n(Reporting by Yasmeen Abutaleb, editing by Stephen R. Trousdale and Andrew Hay)", "source": "WHBL"}