{"published": "2015-09-22T13:06:58Z", "media-type": "News", "title": "IFC, TSKB Boost Lending to Energy Efficiency and Sustainable Energy Projects in Turkey", "id": "c277002f-845e-415f-99e9-21e43e1f44d2", "content": "IFC, a member of the World Bank Group, is providing a $75 million loan to the Industrial Development Bank of Turkey , the country’s largest private investment and development bank, to boost lending for renewable energy and resource efficiency projects in Turkey. The loan is expected to help develop sustainable finance and energy investment projects across all sectors in Turkey, and improve the environment by cutting greenhouse gas emissions. It will also help reduce Turkey’s dependence on fossil fuel and natural gas imports. “With the $75 million from IFC, our total loan volume for sustainable projects in Turkey reached $630 million last year,” said Ozcan Turkakin, Board Member and CEO of TSKB. “We will continue to extend our financing and advisory services to support investments in renewable energy, energy and resource efficiency.” \nWith this project, IFC will surpass the $1 billion mark (including mobilization) on climate change-related finance through financial institutions in Turkey. Edward Strawderman, IFC Regional Head for Financial Institutions Group for Europe , Middle East, and North Africa , said: “TSKB is a long term partner for IFC in addressing the needs for climate-related investments in Turkey, and boosting economic development. We hope to encourage more Turkish banks to provide much-needed renewable energy, resource and energy efficiency financing to local companies.” TSKB is one of Turkey’s leading providers of energy efficiency finance, leading the way for the country’s othe r banks, and winning the FT/IFC Sustainable Bank of the Year award in Southern Europe three times to date. IFC has supported private sector development in Turkey for 50 years. With a portfolio of around $4.3 billion, Turkey is the third-largest country exposure for IFC globally. In line with the World Bank Group Turkey Country Partnership Strategy for fiscal years 2012 to 2016, IFC has so far invested approximately $2.8 billion in private sector projects in Turkey over the last three years.", "source": "EQ International"}