{"published": "2015-09-10T16:51:31Z", "media-type": "News", "title": "Leadspace Expands Israeli, US Teams to Drive Growth for B2B Predictive Analytics Platform", "id": "0d4c3904-9a70-4f8b-9660-25793135657b", "content": "SOURCE Leadspace\n\nAs Leadspace Continues to Grow, Data Intelligence Expert Assaf Monsa Bolsters the Company's Analytics & Modeling Expertise; David B. Thomas to Spearhead Content, Growing Awareness in the U.S.\n\nSAN FRANCISCO and TEL AVIV, Israel \n\nIn the new position for both Leadspace and Monsa, the entrepreneur and former CEO and COO will oversee R&D, product development, analysis and support for Leadspace's B2B predictive analytics platform. Leadspace gives marketing and sales teams the power to enrich, score and discover net-new buyers at both the individual and company level to fill their sales pipeline.\n\nWith deep expertise in statistical modeling, algorithm-based Big Data analysis and data intelligence, Monsa brings over 20 years of enterprise experience from across multiple industries to Leadspace. As a Major in the Israel Defense Forces, Monsa served as an R&D officer in one of the IDF's elite units, graduated from the renowned Talpiot program and led numerous teams in high-profile projects.\n\n\"Assaf's superb technical background and proven experience in building great companies made him a perfect fit to lead our elite technical teams,\" said Leadspace CEO Doug Bewsher \n\n\"I've been incredibly impressed with Leadspace's technology and innovative approach to fulfilling a huge market void,\" Monsa said. \"It's a privilege to join this world-class team and lend my expertise to build the next generation of the Leadspace platform.\"\n\nIn the U.S., David B. Thomas \n\n\"Inbound marketing and content marketing may be popular buzzwords today,\" Thomas said, \"but they are proven disciplines built on solid and tested marketing principles: help your community solve the business problems that are keeping them awake at night and they will remember you when it's time to make a purchase decision. We have a tremendous opportunity at Leadspace to help educate customers about the power of predictive analytics to give them an edge over their competition.\"\n\n\"We are extremely pleased to welcome this incredible talent to our team,\" said Bewsher. \"Suffice to say, the combination of their technical expertise and executive leadership is a powerful advantage for Leadspace in the global marketplace.\" \n\nAbout Assaf Monsa\n\nMonsa brings deep technical expertise, a proven track record for leading large, international teams with technological vision, and an eye toward product-market match to Leadspace. He has overseen day-to-day operations, product management, R&D, quality assurance and marketing as both a senior VP and CEO. As an entrepreneur, Monsa co-founded a casual games development studio, which he led from its inception through international expansion, multiple investment rounds and deals with more than 20 publishers and portal partners.\n\nAbout David B. Thomas\n\nThomas joins Leadspace from Salesforce, where he built and led successful content marketing and social media teams for Radian6, Salesforce Marketing Cloud and Salesforce corporate. He has more than 20 years' experience in marketing and marketing communications with technology companies including SAS, Geomagic and Nortel. He is co-author of \"The Executive's Guide to Enterprise Social Media Strategy,\" published in 2008. \n\nAbout Leadspace\n\nLeadspace is the only end-to-end predictive analytics platform built from the individual up, leading to real actionability and dramatic improvements in B2B sales & marketing effectiveness. The Leadspace platform combines extensive social, web, intent, and structured data to enrich, discover and score in real time both companies and individuals who have the greatest intent to buy. Leadspace is trusted by over 100 of the leading B2B brands such as Oracle, Autodesk, Microsoft and Five9. The company is based in San Francisco and Tel Aviv and backed by Battery Ventures, JVP and Vertex. www.leadspace.com \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/leadspace-expands-israeli-us-teams-to-drive-growth-for-b2b-predictive-analytics-platform-300140327.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KSWO"}