{"published": "2015-09-01T08:47:02Z", "media-type": "News", "title": "Judge Uses Unusual Punishments to Keep People Out of Jail", "id": "4f8517ba-540b-46cc-8121-521a4c0d76e6", "content": "Judge Michael Cicconetti has become a viral sensation for his unique method of sentencing from his Painesville, Ohio, courtroom.  ABC News                                                Share        \nABC Breaking News | Latest News Videos Copy          \nFor this judge, justice is best served unconventionally. \n\nFrom making a man wear a chicken suit to having a woman get sprayed in the face by what she thought was pepper spray , Judge Michael Cicconetti has become a viral sensation for his unique method of sentencing. \n\nJust last month, the municipal court judge got international attention for giving 18-year-old Victoria Bascom the choice between 30 days in jail or walking 30 miles after she didn’t pay a cab driver for a 30-mile trip. \n\n \nWalk 30 Miles Or Do Jail Time, Judge Tells Ohio Teen Who Didn't Pay Cab Fare  \n \n \n \nJail or Pepper Spray: Judge Dishes Out Unusual Sentence  \n \n \nBut creative punishments are not new to the judge, who can see 30 to 40 cases a day from his Painesville, Ohio, courtroom. Cicconetti said he doesn’t believe the law as it is written can really be the only way to serve justice. \n\n“A judge can simply follow the law and if somebody committed the crime, here are the possible penalties,” Cicconetti told ABC News’ “Nightline.” “How much of that do I impose? Sure, you can do that and you go home and you can rest easy. Or you can take each case a little more personal and still apply that same law.” \n\nAnd for the most part, Cicconetti’s type of justice appears to be working in Painesville. Nationally, the recidivism rate after incarceration is over 75 percent, with close to 50 percent of ex-convicts committing a new crime that can land them back within a year, according to a 2014 report by the U.S. Department of Justice . But Cicconetti claims to have a recidivism rate of only 10 percent. \n\nHe believes the key to his low number is his approach on making the punishment fit the crime. \n\n“When you talk about state prisons and federal prisons, their problem started way back here with my court, with municipal courts, with the minor offenses. Most people don’t start out with a felony case,” Cicconetti said. “It starts small, and it gets bigger, so my whole train of thought here is that we have to stop them or prevent them -- that conduct -- from going further at the beginning stages. They get in jail. They get smarter criminally, and as they get smarter criminally, the offenses become greater.” \n\nFor Alyssa Morrow and Jordan Walsh, Cicconetti’s sentencing is a better alternative to jail time. \n\n \nABC News Judge Cicconetti ordered Jordan Walsh, pictured here, to ride a bike on behalf of a local charity in a parade as one of his ten days of community service instead of spending 60 days in the county jail.  \n \n \nMorrow recently pleaded guilty to animal neglect and cruelty after she said she left her 7-year-old pit-bull mix named Moose for a week in a house that could be described as belonging to a hoarder. Moose is now up for adoption. \n\nInstead of spending 90 days in jail, Morrow chose Cicconetti’s other punishment of spending eight hours in a dump picking up garbage. \n\n“I definitely didn’t think I’d be here [at a dump], but I’d rather be here than jail. I can’t complain,” Morrow told “Nightline.” \n\nAnd Walsh, who pleaded guilty to stealing a bike, avoided spending 60 days in Lake County Jail by choosing the alternative sentence of ten days of community work service. Cicconetti ordered Walsh to ride a bike on behalf of a local charity in a parade for one of the days of service. \n\n“I think it’s better than going to jail because I can show people that I can do better in my community and show them I’m not just another person that will make a stupid mistake or do dumb decisions. And I want to show my community I can do better,” Walsh told “Nightline.” \n\n \nABC News Instead of spending 90 days in jail, Judge Michael Cicconetti gave Alyssa Morrow the choice of spending eight hours in a dump picking up garbage.  \n \n \nThanks to Cicconetti’s sentence, Walsh was also happy to have a second chance. \n\n“I’m [going to] make sure to not make mistakes or never do something like this or ever take a bike again and show people I can do better and make a better living for my life,” said Walsh. \n-- This embed didnt make it to copy for story id = 3344", "source": "ABC News"}