{"published": "2015-09-17T13:00:27Z", "media-type": "Blog", "title": "Amazon Has 6 New Devices—And an Actual Plan for Hardware", "id": "aca309d7-10ba-4d7c-a33c-63c739eb57b0", "content": "Skip Article Header. Skip to: Start of Article. Author: David Pierce. David Pierce\tGear\tDate of Publication: 09.17.15. 09.17.15 Time of Publication: 9:00 am. 9:00 am Amazon Has 6 New Devices—And an Actual Plan for Hardware Slide: 1 / of 6\t. Caption: The Fire HD 8 comes in a bunch of funky colors, and a slimmer plastic body. Amazon\tSlide: 2 / of 6\t. Caption: The Fire Kids' Edition has a big bumper on it, plus a two-year replacement guarantee if it breaks. Amazon\tSlide: 3 / of 6\t. Caption: The 7-inch Fire is low-end, but it's ridiculously cheap: just $49.99. Amazon\tSlide: 4 / of 6\t. Caption: The Fire HD 10 has a 10-inch screen designed specifically for watching movies. Amazon\tSlide: 5 / of 6\t. Caption: The Fire TV Stick now comes with voice search, and new capabilities with Alexa. Amazon\tSlide: 6 / of 6\t. Caption: The Fire TV does voice search, has lots of content...and will stream in 4K. Amazon\tAdvertisement Related Galleries The Oddly Beautiful Artificial Light of the World's Cities What It's Like to Stare a Hurricane Wave in the Face You Can't Understand Design Without Experiencing These 14 Classic Works Amazon announced six new devices this morning—and not one of them is a phone. In fact, all seven are staunchly not the kind of do-everything device the company attempted with the Fire Phone. With four tablets and two set-top boxes, Amazon made a single statement: We win at entertainment. You want to draw, futz with spreadsheets, or map the human genome? Great. Buy an iPad (preferably on Amazon.com!). But if you’re a Prime member looking for a way to watch movies, read books, or listen to music, Amazon believes firmly there’s no better way than with Amazon. And honestly, it makes a pretty compelling case. Before we go further, here are the seven new devices: • A faster Fire TV box with 4K support: $99.99 • A new Fire TV Stick with Voice Search and Alex voice control: $39.99 • A 10.1-inch Kindle Fire HD tablet: $229 • Same thing, 8 inches: $149.99 • A 7-inch Fire tablet for the super-cheap: $49.99 • The kids’ version with a bumper and a two-year replacement guarantee: $99.99 Whew! There are a few highlights worth pointing out: The Fire TV’s 4K support (and Amazon’s impressive selection of 4K content) is a huge upgrade, not to mention a pointed victory over the new Apple TV. Alexa integration means you get almost all the capability of the voice-powered Amazon Echo box, right on your TV. The tablets have bigger screens than before, but are thinner and still pretty easy to hold. Everything—everything—is created with reading and watching in mind. The new tablets also come with a completely redesigned version of their operating system called Fire OS 5. Next to the carousel-filled, dark-on-dark interfaces Amazon’s built before, Fire OS 5 is a refreshing and desperately needed change. Now, you get a light background and a grid of content; your favorite stuff on one page, your recent stuff on another, all your movies on another yet. It feels usable, really for the first time. And there’s a reason: Amazon has finally figured out exactly what the Fire devices are about. Remember that old maxim “tablets are for consumption?” As other big companies like Apple and Microsoft have fought tooth and nail to prove they’re more than just movie-watching devices, Amazon’s leaning into the idea. These are devices for watching movies. And reading books, and watching TV shows, and listening to music. Thing is, Amazon is really, really good at those things. And there are lots of people who want them. Amazon’s proven it can make good hardware and sell it for less than most of its competitors. That’s true here too: the new Fire HD tablets are thin and light, and still impressively durable. During his demonstrations, Dave Limp, Amazon’s head of devices, pulled out an iPad Air and a Fire HD that had gone through equivalent tests. The iPad’s screen was shattered; the Fire’s plastic was scuffed but the device was otherwise perfect. They have decently loud speakers, lots of nice accessories, the whole nine yards. Even the $50 model looks pretty good! On the TV side, the Fire TV has been maybe the best set-top box on the market since the day it came out. (Or at least since whatever day it finally got HBO.) Now, with Alexa, the voice search should be even more useful. There’s a new controller for gaming, a bunch of upgraded hardware inside the box, and improvements to the ASAP feature that pre-caches video to make it play faster. And not only do the new set-top boxes offer 4K streaming, they use a better kind of video encoding (called HEVC) that uses less bandwidth to stream video. That means you’re more likely to get a high-def stream, even when you have a bad connection. Every good new feature of the new devices exists in service of one single thing: content. Books, music, movies, TV shows, games, all the things you do when you’re not doing the work everybody else wants you to do on their tablets. When Amazon does its job well, it makes finding and consuming stuff easier than anyone else. There are plenty of gaps in Amazon’s content ecosystem, sure. And let’s not forget that you’re still paying $99 a year for access, on top of the price of your device. (If you’re not already a Prime subscriber, any Fire device basically morphs into one unending Prime commercial.) But Amazon has integrated so many other sources—there are 3,000 channels, apps, and games for Fire TV, they say—that anything you can’t find from Amazon you can probably get from Netflix, Hulu, HBO Now, Sling, or, I don’t know, the Red Bull channel. It’s tough to beat the Fire ecosystem when it comes to the size of the content firehose. Now, the products are finally focused on this core competency and little else. Rather than blindly assume everyone lives entirely within Amazon’s ecosystem—which has proven a road to ruin—the company’s just hoping people want to watch some movies. After years of trying to find itself, Amazon finally seems to have a clear sense of what its own devices are for. It’s finally not competing with the iPad and Rokus of the world. These devices are mostly just another benefit to Prime customers, like two-day shipping or the super-cheap grocery shopping options. That clarity of purpose seems to have come with a certain clarity of execution, too. Amazon’s devices should be good enough to make that content easy to access, and as cheap as physically possible. (Someday, we’ll all get these devices free with our Prime subscriptions.) Amazon’s software should be insanely easy to use, and its recommendations should be so good you never run out of stuff to do. Once all that happens—and the new devices are a pretty big step in that direction—Amazon’s going to have a hell of a device lineup on its hands. Just as long as it doesn’t try making any more phones. Go Back to Top. Skip To: Start of Article. Amazonfirefire hdgalleryKindlestreaming tvtablets\tSkip Social. Skip to: Latest News. Share Share Tweet Pin Comment Email Skip Social. Skip to: Latest News. Share Share Tweet Pin Comment Email Skip Latest News. Skip to: Comments. Latest News Here Is Your WIRED Star Wars Challenge for Day 137\tMovies\tHere Is Your WIRED Star Wars Challenge for Day 137 1 hour This Is Clearly the Best Street Fighter Product Ever\tChris Kohler\tThis Is Clearly the Best Street Fighter Product Ever 8 hours Inside Sony’s Very, Very Japanese PlayStation VR Booth\tChris Kohler\tInside Sony’s Very, Very Japanese PlayStation VR Booth 8 hours Sega Is Back, In Shoe Form\tDaniel Feit\tSega Is Back, In Shoe Form 9 hours Hands On: Hyrule Warriors Gets Toon Makeover On 3DS\tChris Kohler\tHands On: Hyrule Warriors Gets Toon Makeover On 3DS 9 hours More News", "source": "WIRED"}