{"published": "2015-09-29T03:07:04Z", "media-type": "News", "title": "NASA's Mars rovers can't explore wet Martian sites for fear of contaminating them", "id": "f0e7b753-2351-497a-a861-75ca339432c8", "content": "NASA has a Mars explorer about 50 kilometres from a site that shows promise it holds Martian water, but the US space agency can't send it there to find out. \n\nHow it happened: NASA announcement NASA has a Mars explorer about 50 kilometres from a site that shows promise it holds Martian water, but the US space agency can't send the rover there to find out.\n\nWhy not? The rover is not sterile enough.\n\nIn a revealing response during an \"ask me anything\" session on website Reddit, NASA's chief scientist for its Mars program, Rich Zurek, said: \"Because liquid water appears to be present ... we have to take extra precautions to prevent contamination by Earth life. Our current rovers have not been sterilised to the degree needed to go to an area where liquid water may be present.\"\n\nThat's a long way to go without having the right sort of shower.\n\n\"All of our spacecraft carry microbes from Earth,\" Swinburne University astronomer, Alan Duffy, told Fairfax Media. \"We try our best to sterilise them by putting them in an ultraviolet tanning salon - but a very intense one.\"\n\nWhen preparing spacecraft for Mars missions, scientists have to get the balance right between this sterilisation and protecting the delicate electronics on board.\n\n\"In order to be completely sterile, they'd have to use really powerful ionising radiation or heat, both of which would damage the electronics,\" UNSW astrobiologist Malcolm Walter told Fairfax Media. \"So they go as far as they dare.\"\n\nOn Tuesday NASA announced that dark, narrow gullies on the Martian surface contain water-bearing salts that formed from flowing water flowing during warmer periods.\n\nWhile it wasn't part of the study published in Nature Geoscience on Tuesday, very similar slope activity has been identified about 50 kilometres from the Mars Curiosity rover.\n\nDr Zurek said: \"There are no confirmed brine flows (RSL) near Curiosity nor Opportunity [rovers]. There are in Gale crater some interesting slope streaks but they are several km away from the Curiosity's present path.\"\n\nThe Curiosity rover has been exploring the Gale crater on Mars since it landed three years ago.\n\nDr Zurek's revelation that the Mars Curiosity rover might be contaminated with Earth-origin microbes caused a flurry of questions on the Reddit AMA.\n\n\"If the rovers haven't been properly sterilised already, will this throw doubt upon any possible future discovery of Mars-based microbes? Wouldn't detractors be able to claim that they are microbes that somehow survived from Earth?\" asked one participant.\n\nDr Zurek's response should satisfy most, except the most ardent conspiracy theorists: \"The rovers have been sterilised for their particular landing sites where there's been no evidence of present day liquid water. To go to the RSL [sites] rovers will be required to be sterilised to a higher level. We also take samples of microbes that might be on the spacecraft before they're launched, so we can compare with any future discoveries.\"\n\nTwo other problems mean Curiosity can't go taste the water to test for life. The slopes are too steep and, anyway, there are no DNA sequencers on board.\n\n\"These features are on steep slopes, so our present rovers would not be able to climb up to them,\" Dr Zurek told Reddit. He also said: \"The Curiosity rover does not have life-detection instruments.\"\n\nThe next generation of NASA's Mars rovers are due to be sent to the red planet in 2020. New Scientist reported that some astrobiologists have criticised NASA for not including DNA sequencers and other life-detecting instruments in its plans for these planetary explorers.\n\nProfessor Malcolm Walter is the founding director of the Australian Centre of Astrobiology at the University of NSW. He told Fairfax Media that it's too late to modify the 2020 missions to take into account Tuesday's announcement.\n\nBut he said of the discovered water locations: \"They'd have to be high-priority sites now.\"\n\nThe European Space Agency's ExoMars mission in 2018 will launch a Mars rover with an organic molecule analyser to continue the hunt for life on Mars. The story first appeared on The Sydney Morning Herald.", "source": "The Stawell Times-News"}