{"published": "2015-09-30T16:45:55Z", "media-type": "Blog", "title": "Saying goodbye to September 2015", "id": "34b558fc-be8a-4f28-b33a-0ac162ab0acc", "content": "Blast from the Past..\nThere is a song...  \"Morning Train\" by the 80's Scottish singer, Sheena Easton.   \"My baby takes the morning train.  He works 9 to 5...\".  It was originally entitled \"9 to 5\", but when it was released in the States, they re-titled it to \"Morning Train\" so the Easton's song would not be confused with another singer Dolly Parton's song \"9 to 5\".\nAt some point, I had talked about taking on another person's 'personality' - likes, dislikes, favorites, and aversions, etc.  This is another story.  Someone else's requirement on themselves to maintain a certain look, follow certain fashion, read certain authors, read certain sub-genre of novels, or like certain performers (pop or 'classical')...\nThere are quite a number of things that define (if you would do that) a person's psychology.  How about being the eldest child, the middle child or the youngest child?  Having a brood of siblings or being a single child?  Divorced or single parents or an 'intact family'?  So many factors we need to cull from, and we need to focus on how the factors inter-relate and what counts as a 'personality factor'?  Back to \"Morning Train\" and it was....\nWho would have thought I have such depth in popular culture?  Moreover, I would have these 80's songs?   I was like.... Molly Ringwald \"Sixteen Candles\" and \"The Breakfast Club\".  No, \"it is not that long ago.\"\nFarewell to this specific point in time.. September 30th, 2015. \nI am a big Halloween candies person.  (Yes there was a hiccup with a Halloween party back in my days from 2005 to 2010.  Does that reverberate still?) From the time I started living on my own, I have been making certain each Halloween I have candies handy for those kiddies trick-or-treaters.  I hope that October 31st, 2015 would be propitious. ", "source": "First Blog Date"}