{"published": "2015-09-11T07:00:50Z", "media-type": "Blog", "title": "Get Hands-On With Oculus Rift, Cool People And Mtn Dew At DBNGamers Tonight", "id": "f77f34cc-4769-4b78-907f-5f20ecc7e760", "content": "Durban is the oft-neglected middle child as major South African cities go but thankfully there are folks in that godforsaken place who simply won’t stand for Durban not having cool events to call its own. Enter DBNGamers. Wait. Let’s try that again. \n \nSay hello to DBNGamers Isolation – Enter the Vault. \n \nDBNGamers is a meeting point for anyone with a passion for gaming and geek culture in general. It’s a chance to meet new people and argue why gaming is continually bashing feminism over the head break bread (or clink cans) over your shared passions. \n  Popular Articles  Recent Articles     Be Quiet, Stop Telling Creators What They Can And Can’t Do | 6 days ago    WhatsApp “VirusCard” Vulnerability Allows Attackers To Compromise WhatsApp Web Users | 7 days ago    Review: Metal Gear Solid V: The Phantom Pain Will Divide Die-Hard Fans | 7 days ago    Review: Mad Max Is A Moronically Serious Heap Of Scrap | 7 days ago       CD Projekt Red Isn’t Being Taken Over By EA, Go Thank Your Deities | 14 hours ago    TGS 2015: Sony Press Conference Round-Up | 15 hours ago    AMD Possibly Readying A R9 380X Full Tonga GPU | 16 hours ago    Super Mario Maker Builds Its Way Into Smash | 17 hours ago      \nCreepily titled DBNGamers Isolation (we assume people will be herded into individual cells as part of an entirely different sort of ‘game’) and dated for tonight (September 11), the latest DBNGamers event has a lot to offer. \n \nSpecial guests include MWeb GameZone’s Desmond Kurz from way down under (Cape Town) and a couple of plucky local devs who are excited to show off their work. \n \nThere will be prizes abound with PlayStation hampers and lovely goodies from The Unseen Shoppe . that last one has our own Paul Nain foaming with jealousy but also possibly dementia? He is getting on in his years. \n \nDid we mention Mountain Dew will be providing tasty liquid cancer straight to your lips? We have now. \n \nCosplayers pay attention. DBNGamers is looking for the best talent that Durban has to offer and will be holding a cosplay competition. the winner will receive free entry into the main cosplay event hosted The Legionink Cosplay Page at rAge Expo 2015 as well as two weekend passes to rAge. Flights and accommodation not included. \n \nThe big attraction though is the chance to get your hands and face on an Oculus Rift VR headset. A setup will be available at DBNGamers Isolation for you to experience what some call the future of gaming and others call a headache. \n \nThe best part? Entry is absolutely free. \n \nThere is absolutely no reason to not attend DBNGamers Isolation tonight. \n \nDBNGamers Isolation is taking place at The Green Door (it isn’t in the side of a hill unfortunately) at 298 Cato Road, Glenwood tonight. Doors open at 7PM and entry is free. \n \nCheck out the event on Facebook for more info. \n \nBring a friend, bring a war party, bring your cat, bring your love of gaming. \n \nThe post Get Hands-On With Oculus Rift, Cool People And Mtn Dew At DBNGamers Tonight appeared first on #egmr .", "source": "#egmr"}