{"published": "2015-09-20T14:09:11Z", "media-type": "News", "title": "Contaminated Aviation Fuel - Expert Urges FG to Expose Culprits", "id": "2d936564-2d2b-4c3a-b238-9e8472498d4d", "content": "The Founder and Executive Director, Centre for Aviation Safety and Research (CASR), Engr. Shery Kyari, has called on the Federal Government to fish out the oil marketers that were allegedly selling kerosene to airline operators as aviation fuel. Kyari, who is also an Aircraft Maintenance Engineer, made the call at the third Engr. Zakari Haruna Memorial Lecture at the Nigerian Civil Aviation Authority (NCAA) Annex, international wing of the Murtala Muhammed Airport (MMA), Lagos. \n\nHe wondered why oil marketers would go to the extent of selling kerosene to unsuspecting airlines, thereby compromising safety of the passengers and the aircraft itself. \n\nAccording to him, \"I wonder why oil marketers will sell kerosene to airline operators as kerosene for their operations. We want to believe that the Federal Government will react to this by fishing out the marketers who did this and deal with them decisively.\" \n\nHe continued, \"It is dangerous to the industry. It undermines safety as well as threaten safety.\" \n\nThe Chief Executive Officer of Alpha First Aviation School, Elder Soji Amusan, who spoke on the topic, \"Expanding Air Passengers Base In Aviation\" stated that air transport is a very important base of the global economy. \n\nHe stated that less than 10 percent of Nigerians travel by air, adding that to increase the number of people travelling by air in the country, Nigeria must have a coherent transport policy. \n\nAmusan argued that if there had been coherent transport policy most of the airports in the country would have witnessed a lot of expansion. \n\nHe listed some of the factors militating against the increase in air passenger traffic to include bad managers, adding that most Nigerian airlines were prone to bad management just like the liquidated Nigeria Airways Limited (NAL). \n\nHe added that bad managers brought about the short life span of NAL in the country. \n\nOther factors according to him are decaying facilities, insecurity and intermittent air crashes, a situation he said scared away those who would have loved to go by air transport.", "source": "Individual.com"}