{"published": "2015-09-20T16:15:10Z", "media-type": "News", "title": "Sumatran tiger kills woman at zoo in New Zealand - prompting fears cat will be destroyed", "id": "b60a5b3b-0a98-4db5-80c1-50a74dca1240", "content": "Clashes erupt in Israel after call for ‘day of rage’  \nTaipei Times - Sunday 20th September, 2015 \n \nPalestinians on Friday clashed with Israeli security forces in Jerusalem and the occupied West Bank after the Muslim movement Hamas called for a \"day of rage\" over tensions at  ... \n   Two Israeli Air Raids Target Gaza Strip  \nPalestine Chronicle - Sunday 20th September, 2015 \n \nIsraeli fighter jets launched two attacks on the Gaza Strip on Saturday. Eyewitnesses told Anadolu Agency that an Israeli warplane fired a missile at a military training site belonging to Ezzedin  ... \n   Seven Detainees Mark 30th Day on Hunger Strike in Israeli Jails  \nPalestine Chronicle - Sunday 20th September, 2015 \n \nSeven Palestinian administrative detainees currently held by Israeli authorities in solitary confinement continued a hunger strike for the 30th day in a row Saturday, the Prisoners’ and Former  ... \n   Egypt floods people-smuggling tunnels leading from Sinai to Gaza Strip  \nDaily Mail - Sunday 20th September, 2015 \n \nAuthorities feared the tunnels, which lead from Sinai to the Gaza Strip, would allow for smuggling by Islamist militants between the blockaded Palestinian enclave, according to a report  ... \n   Israel UN’s Temple Mount Stance Ignores Palestinian Violence Jewish History  \nAlgemeiner - Sunday 20th September, 2015 \n \nIsrael blasted a United Nations Security Council statement about the ongoing tension at the Temple Mount, saying the statement ';completely ignores'; both Palestinian violence and Jewish  ... \n   Israel arrests Palestinians for stone throwing  \nHindustan Times - Sunday 20th September, 2015 \n \nIsraeli police arrested seven Palestinians, including five youths, in another day of violence sparked by tensions over the flashpoint Al-Aqsa mosque compound in Jerusalem's Old City.  ... \n   Palestinian Hunger Striker Re-Detained After Hospital Release  \nImpunity Watch - Sunday 20th September, 2015 \n \nImpunity Watch Reporter, The Middle East JERUSALEM, Israel - Mohammad Allaan, a Palestinian lawyer, was re-arrested by Israel on Wednesday after being discharged from the hospital. Allaan was in the  ... \n   Pharrell Williams cant avoid Palestine protest in South Africa judge rules  \nElectronic Intifada - Sunday 20th September, 2015 \n \nPharrell Williams will not be able to avoid a large Palestinian rights protest in South Africa, a judge has ruled. Last week, the \"Happy\" singer’s promoters Sun  ... \n   Gaza Protesters Denounce Israeli Attacks on Al-Aqsa Mosque  \nFars News Agency - Sunday 20th September, 2015 \n \nTEHRAN (FNA)- Hundreds of protesters marched in Gaza City against the continued Israeli raids on the al-Aqsa Mosque in Jerusalem. Protesters marched holding pictures of the mosque and carrying Hamas  ... \n   Icelands Capital Declares Boycott of All Israeli Goods  \nFars News Agency - Sunday 20th September, 2015 \n \nThe Reykjavik municipality passed the motion, which approved a boycott of Israeli goods \"as long as the occupation of Palestinian territories continues,\" Iceland Magazine  ... \n   Reykjavik mayor scraps plan to boycott Israeli goods  \nYahoo!7 News - Sunday 20th September, 2015 \n \nView Photo Reykjavik's council had approved a motion to halt the city's purchase of Israeli products until the occupation of the Palestinian territories ends  ... \n   Israeli airstrikes target Hamas after rocket attacks  \nThe Guardian - Saturday 19th September, 2015 \n \nPalestinians look at the damage at the Hamas training camp after it was hit by an Israeli airstrike in the northern Gaza Strip. Photograph: Mohammed Salem/Reuters  ... \n   Egypt Says it Has Started to Flood Gaza Smuggling Tunnels  \nAlgemeiner - Saturday 19th September, 2015 \n \n?The Egyptian military said it has started flooding tunnels used by the Hamas terrorist group and other Palestinians to smuggle weapons and goods into Gaza, the  ... \n   Gaza Rocket Strikes Open Area in Southern Israeli City of Sderot  \nRapid News Network - Saturday 19th September, 2015 \n \nreported , but light damage was caused to a vehicle. Three rockets were fired on Friday night from northern Gaza into southern Israel, residents and security officials in Gaza said.  ... \n   Kasrils slams Lekota over Israel trip  \nIOL - Saturday 19th September, 2015 \n \nRonnie Kasrils has lambasted his former comrade and fellow cabinet minister Mosiuoa Lekota for accepting a free trip to Israel. File picture: Ross  ... \n   Israeli war jets strike on Gaza in response to rockets firing  \nFinland Times - Saturday 19th September, 2015 \n \nPalestinians look at the damage following an Israeli air strike overnight in the northern Gaza strip of Beit Hanun on September 19, 2015. Two rockets were fired into southern Israel by Palestinian  ... \n   Israel Launches Air Strikes on Gaza After Rockets Fired  \nNBC News - Saturday 19th September, 2015 \n \nTEL AVIV - Israel carried out three air strikes on Gaza Saturday, in response to rockets fired by Palestinian militants into southern Israel, officials said.   ... \n   Israeli Forces Shoot 3 Palestinians in Bethlehem  \nFars News Agency - Saturday 19th September, 2015 \n \nThe clashes erupted between Palestinian youths and Israeli soldiers at the vicinity of Bilal Bin Rabah Mosque in Northern Bethlehem city on Friday evening, PIC reported.  ... \n   Lebanese Analyst Blasts Israel-PLO Accord on Al-Aqsa Mosque  \nFars News Agency - Saturday 19th September, 2015 \n \nTEHRAN (FNA)- A prominent Lebanese analyst underlined that the al-Aqsa mosque is the victim of a plot hatched by Israel after signing an accord with the Palestine Liberation Organization (PLO) in  ... \n   Israel Carries Out Airstrikes against Gaza Saturday  \nFars News Agency - Saturday 19th September, 2015 \n \nTEHRAN (FNA)- The Israeli warplanes early Saturday carried out several airstrikes targeting different locations in the Gaza Strip, injuring at least a Palestinian and causing destruction to  ...", "source": "Palestiniannews.net"}