{"published": "2015-09-16T13:17:00Z", "media-type": "News", "title": "A.M. Best Affirms Ratings of MVP Health Plan, Inc. and Its Affiliate; Upgrades Ratings of Subsidiary", "id": "fd1ef652-6ed4-4412-9dd2-0e363d45918d", "content": "OLDWICK, N.J.--(BUSINESS WIRE)-- \n\nA.M. Best has affirmed the financial strength rating (FSR) of B+ (Good) and the issuer credit ratings (ICR) of \"bbb-\" of MVP Health Plan, Inc. and its affiliate, MVP Health Service Corp. Additionally, A.M. Best has upgraded the FSR to B+ (Good) from B (Fair) and the ICR of \"bbb-\" from \"bb\" of MVP Health Insurance Company. Concurrently, A.M. Best has withdrawn the FSR of B (Fair) and the ICR of \"bb\" of MVP Health Insurance Company of New Hampshire, Inc. (Bedford, NH). The outlook for all ratings remains stable, except for the outlook on MVP Health Services Corp’s ratings, which was revised to stable from negative. Collectively, all companies are subsidiaries of their direct parent, MVP Health Care, Inc., and are domiciled in Schenectady, NY, unless otherwise specified. \n\nThe upgrading of the ratings of MVP Health Insurance Company reflects its revised strategic role within the group, with greater emphasis on commercial large group business in Vermont. Moreover, significant improvement in operating results has been recorded through mid-2015 and is projected to continue into 2016. \n\nThe outlook revision to stable for MVP Health Service Corp reflects its change in strategic direction, resulting in favorable growth in premium and recent improvement in operating results that is projected to continue into 2016. A.M. Best will continue its discussions with the management team about its revised strategy for this entity, while assessing the capitalization, premium leverage and future direction within the group. A.M. Best anticipates that the parent organization will continue to implicitly and explicitly support the entity to fund its future growth initiatives. \n\nThe rating affirmations of MVP Health Plan, Inc. and its affiliate reflect the companies’ strong brand recognition in New York and well-established network with geographic outreach activities throughout the state, which enhances each entity’s stand-alone assessment as well as the group’s ongoing consolidation of operations and overall sound capitalization. The group gained a larger increase in individual membership due to some carriers not originally being as active in the exchange marketplace. A.M. Best notes that while the group has reported consistent net income over the past three years, it has recorded underwriting losses over the past two years. Management has implemented strategic initiatives to return the group to profitable trends, and through mid-2015, the consolidated operating results have been very favorable. Due to these initiatives, A.M. Best expects the organization to return to its historical level of profitability and maintain a steady growth across its various business lines. The sound but declining level of risk-adjusted capital levels is primarily the result of previous cumulative retained earnings. \n\nA.M. Best believes that the organization has been pressured by the competitive nature of the commercial market, which is driving significant margin compression on existing and new business. Additionally, the continued shift toward government-sponsored lines of business has been challenging. Moreover, the organization faces continued challenges in the operating performance of its Medicare Advantage business line, which is government-funded and heavily impacted by reimbursement cuts. \n\nOf note is the considerable contribution of the Medicaid product line to the organization’s consolidated operating performance, driven by strong results produced through its acquisition of the Hudson Health Plan (HHP). In August 2013, MVP Health Plan, Inc. acquired HHP, a Tarrytown, NY-based Medicaid managed care organization. As this entity continues to be integrated into MVP Health Plan, Inc., A.M. Best will continue to assess the ultimate impact of the HHP acquisition on the organization and its overall operations, strategic plans, earnings and capitalization. \n\nThe withdrawal of the ratings on MVP Health Insurance Company of New Hampshire, Inc. reflects management’s decision to exit the New Hampshire market and place its relatively small remaining policies into run-off. The run-off and completion of the withdrawal from New Hampshire is expected to be completed by early 2016. \n\nA.M. Best believes that positive rating movement is unlikely in the near to medium term. Key rating drivers that could lead to a negative rating action include further deterioration in operating performance in any of its core lines of business, a substantial decline in the consolidated risk-adjusted capitalization or any reimbursement issues surrounding its government-sponsored products. \n\nThis press release relates to rating(s) that have been published on A.M. Best's website. For all rating information relating to the release and pertinent disclosures, including details of the office responsible for issuing each of the individual ratings referenced in this release, please visit A.M. Best’s Ratings & Criteria Center. \n\nA.M. Best Company is the world's oldest and most authoritative insurance rating and information source. For more information, visit www.ambest.com. \n\nCopyright © 2015 by A.M. Best Company, Inc. ALL RIGHTS RESERVED. \n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150916005930/en/ Contact:A.M. Best Company\n\nJennifer Afriyie\n\nFinancial Analyst\n\n(908) 439-2200, ext. 5203\n\njennifer.afriyie@ambest.com\n\nor\n\nJoseph Zazzera, MBA\n\nAssistant Vice President\n\n(908) 439-2200, ext. 5797\n\njoseph.zazzera@ambest.com\n\nor\n\nChristopher Sharkey\n\nManager, Public Relations\n\n(908) 439-2200, ext. 5159\n\nchristopher.sharkey@ambest.com\n\nor\n\nJim Peavy\n\nAssistant Vice President, Public Relations\n\n(908) 439-2200, ext. 5644\n\njames.peavy@ambest.com", "source": "Yahoo! Finance UK and Ireland"}