{"published": "2015-09-24T12:41:15Z", "media-type": "News", "title": "Higher Spending on Coagulation Disorders to Push Global Heparin Market to US$14.3 bn by 2023: Transparency Market Research", "id": "fe1213f4-63e3-401c-a773-d4a81a25e43a", "content": "/PRNewswire/ -- \n\nAccording to a new market report published by Transparency Market Research \"Heparin Market (By Product: Unfractionated Heparin, Low Molecular Weight Heparin, Ultra-Low Molecular Weight Heparin; By Geography: North America, Europe, Asia Pacific and Rest of the World) - Global Industry Analysis, Size, Share, Growth, Trends and Forecast 2015 - 2023\" the global heparin market was valued at US$8.2 bn in 2014 and is estimated to reach US$14.3 bn by 2023 growing with 6.3% CAGR from 2015 to 2023. \n\nGet Sample Report Copy of Heparin Market:http://www.transparencymarketresearch.com/sample/sample.php?flag=S&rep_id=803 \n\nAnticoagulants as a medicine either work by altering or inhibiting steps in the coagulation cascade. Heparin is administered intravenously or subcutaneously which functions by inhibiting the effects of antithrombin and Factor Xa. Patients suffering from stroke and unstable angina are usually recommended heparin therapy owing to rapid onset of anticoagulation activity. Additionally, heparin is also advised to patients suffering from stroke or transient ischemic attack. Heparin is also among the most widely used anticoagulant after warfarin during surgical procures and treatment of coagulation disorders such as deep vein thrombosis (DVT) and pulmonary embolism (PE). \n\nBrowse Market Research Report on Heparin Market: http://www.transparencymarketresearch.com/heparin-market.html \n\nThe report on global heparin market by products has been studied for unfractionated heparin, low molecular weight heparin (LMWH) and ultra-low molecular weight heparin (ULMWH). Unfractionated heparin is one of the most primitive forms of heparin commonly used during dialysis and in heart lung machines as a measure to prevent blood clots. Unfractionated heparin has variable anticoagulant effect with limited bioavailability which is a major drawback affecting sales and acceptance with heparin base products. However, heparin overdose associated with unfractionated heparin can be easily reversed with protamine sulfate as compared to LMWHs and ULMWHs. Due to its large molecular size and anionic structure, unfractionated heparin is not absorbed reliably in the gastrointestinal tract when administrated orally. Heparin induced thrombocytopenia and hemorrhage are some of the major adverse effects of unfractionated heparin therapy. \n\nBrowse Press Release of Heparin Market: http://www.transparencymarketresearch.com/pressrelease/heparin-market.htm \n\nLMWH products have smaller and more uniform molecular weights than unfractionated heparin leading to greater affinity for Factor Xa than Factor IIa. Compared to unfractionated heparin, LMWHs have enhanced safety and efficacy. LMWHs accounted for the largest market share in 2014 owing to its broad applications and consumption. LMWHs are produced by depolymerization of unfractionated heparin. Each LMWH product has a specific molecular weight distribution which determines its anticoagulant activity and duration of action. Majority of the branded LMWH drugs in the global heparin market have gone off patent, thereby offering market access to generic manufacturers. However, manufacturing of LMWH entails harsh enzymatic and/or chemical processes that lead to a few structural changes in the final product. Thus, specific guidelines laid by the regulatory authorities are to be met for final approval of the generic heparin product. Additionally, regulatory agencies such as the U.S. FDA and World Health Organization (WHO) consider each LMWH as a distinct drug requiring clinical validation data for specific indications. In Europe and the U.S., several pharmaceutical giants have applied for the marketing rights of Enoxaparin (Sanofi-Aventis U.S. LLC) and the Dalteparin (Pfizer, Inc. / Eisai Co., Ltd) brands. \n\nOther Reports Published by Transparency Market Research: \n\nUltra-Low Molecular Weight Heparins (ULMWHs) have molecular weight lower than 4000 Da, and are available with enhanced anti-factor Xa activity compared to LMWHs. Over the past decade, ULMWHs such as Arixtra (GlaxoSmithKline) have been widely used across the globe. However, chemical-based methods for processing and synthesizing ULMWHs have increased the overall cost of product becoming a major drawback in this product segment. Additionally, low yield and the possibility of contamination during manufacturing also adversely affects the overall demand for ULMWHs. As a measure to overcome restraints associated with ULMWHs, researchers at University of North Carolina have developed novel method to produce two new ULMW heparins through series of bio-enzymatic process. Such advancements will positively affect the market growth and demand in forthcoming years. Moreover, advent of generic versions of Arixtra are expected to propel the market growth with possible price containment. \n\nBrowse Upcoming Market Research Reports: \n\nSome of the key players profiled in this report encompasses Dr. Reddy's Laboratories Ltd., Fresenius Kabi AG, LEO Pharma A/S, Mylan N.V., Pfizer, Inc., Sanofi S.A., Syntex S.A., and Teva Pharmaceutical Industries Ltd. \n\nThe global heparin market is segmented into the following categories: \n\nGlobal Heparin Market, by Product Global Heparin Market, by Geography \n\nBrowse All Other Pharmaceutical Research Reports: http://www.transparencymarketresearch.com/pharmaceutical-market-reports-1.html \n\nAbout Us: \n\nTransparency Market Research (TMR) is a U.S. based provider of syndicated research, customized research, and consulting services. TMR's global and regional market intelligence coverage includes industries such as pharmaceutical, chemicals and materials, technology and media, food and beverages, and consumer goods, among others. Each TMR research report provides clients with a 360-degree view of the market with statistical forecasts, competitive landscape, detailed segmentation, key trends, and strategic recommendations.", "source": "Individual.com"}