{"published": "2015-09-22T12:00:00Z", "media-type": "News", "title": "Strive Fuel Celebrates One Thousandth Tree Planted in New Mexico to Reduce Tailpipe Emissions", "id": "68bedfba-814f-44b6-b785-b44b7bb3c70c", "content": "More Than Five Thousand Carbon Metric Tons Offset During First Three Months of Reduced Emissions Fuel Program in Albuquerque \n  \nALBUQUERQUE, N.M. , Sept. 22, 2015 /PRNewswire/ -- In less than three months since its launch in Albuquerque the STRIVE™ - Reduced Emissions Fuel Program is making great strides in greening tailpipe emissions for drivers in the Duke City. The first-of-its-kind program announced today the planting of its 1,000th tree in New Mexico , and the offsetting more than 2.25 million gallons of fuel purchased at ALON owned 7-Eleven stations. A ceremonial tree-planting event was held in partnership with the City of Albuquerque's Open Space Division and Tree New Mexico on Saturday, Sept. 19 at Woodward Nursery at Candelaria Farms in recognition of the milestone. \n\nPhoto - http://photos.prnewswire.com/prnh/20150921/269040  \n   \n\"Preserving our environment and the natural beauty of Albuquerque is very important to our community. The vast quantity of trees and shrubs that have been planted as a result of STRIVE Fuel will have a positive impact on our overall air quality while leaving a lasting footprint on our greenspace,\" said Matthew Peterson , Forestry Supervisor for the City of Albuquerque . \"We're honored that STRIVE selected Albuquerque as its launch market and look forward to continuing our relationship as the program flourishes.\" \n\nCreated through a partnership between ALON Distributors and GreenPrint, the STRIVE Fuel program reduces carbon emissions in a sustainable way and counteracts the negative effects emissions can have on the atmosphere, climate and lifestyles. Drivers automatically can offset harmful emissions by pumping the same high-quality ALON fuel as always at no additional cost or effort. For every gallon of fuel pumped at an ALON 7-Eleven, STRIVE will calculate the tailpipe emissions and invest in projects that reduce it by up to 30 percent. The 1,000 trees planted in New Mexico is one of the many local, regional and global initiatives STRIVE has invested in to reduce emissions.  \n\n\"Since its launch, we have offset 5,000 carbon metric tons as a direct result of STRIVE Fuel purchases,\" stated Jonathan Ketchum , senior vice president of retail for ALON Brands. \"The 1,000 trees planted locally in New Mexico is a great way for customers to see first-hand how their fuel purchases benefit their community. Our employees have also had a chance to join the fun by helping plant the trees and shrubs.\" \n\nAt Saturday's event, the 1,000th tree was planted by Rudy Arviso of Navajo, N.M. , who was the winner of one year's worth of free STRIVE Fuel during the company's gas giveaway this summer. In addition to the grand prize, four participants of the sweepstakes received $100 gift cards for STRIVE Fuel. \n\nSTRIVE Fuel is available at 122 pumps across 23 ALON owned 7-Eleven stations in Albuquerque, N.M. For additional information on the reduced emissions fuel program and a store locator, visit www.StriveFuel.com  \n\nAbout Alon/7-Eleven \n\nHeadquartered in Dallas , ALON Brands markets ALON motor fuel products at more than 800 locations and is the largest 7-Eleven licensee in North America . \n\nFor more information about ALON Brands, visit www.alonbrands.com . \n\nAbout GreenPrint \n\nHeadquartered in Atlanta , GreenPrint is the world's leading innovator of carbon neutral fuel solutions. GreenPrint enables consumers to drive their cars, heat their homes, and live their everyday lives without leaving a carbon footprint. The company's patent-pending solutions also provide municipal and commercial fleet managers and petroleum retailers the ability to build goodwill, enhance brand loyalty, and/or increase market share.  \n\nFor more information visit http://www.GreenPrintCorp.com . \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/strive-fuel-celebrates-one-thousandth-tree-planted-in-new-mexico-to-reduce-tailpipe-emissions-300146710.html \n\nSOURCE  GreenPrint, LLC", "source": "BioSpace"}