{"published": "2015-09-23T06:42:18Z", "media-type": "Blog", "title": "Wondering What a Trip to Massage Envy is Like?", "id": "7416cbc3-2c68-4768-b2a0-6267bdd6474a", "content": "Back to school has always been an emotionally charged time for me. While I was teaching it is the bittersweet end of Summer paired with a slew of new beginnings.   Now that I am at home with my kids, I eagerly await back to school after three weeks of down time between school and camp. But I also am not always ready to say goodbye to the daytime adventures and outings I have with my kids or the long summer afternoons at the pool that are not yet hindered by the need for early bedtime on a school night. This year my oldest began first grade and we were both feeling stressed. With first grade comes homework and the end of early childhood. When the first day of school ended with a two hour long quest for a lost bus that could not be located or contacted, my stress level was through the roof! Lucky for me I had the opportunity to unwind with a massage at Massage Envy Spa River Edge located in River Edge, NJ. \n \n \n \nI was completely new to the Massage Envy franchise, but the white glove treatment that I received even before I received my massage left me feeling highly optimistic about the experience. I was contacted by the extremely courteous and professional Sabrine Din who spoke with me about my hopes for my massage experience. She was extremely receptive to everything that I had to say and helped me devise a plan that would best suit my needs. As a mother of three young children, the youngest of which insists on being held as much as possible,   I was in need of some relaxation with some extra focus on the back and shoulders.   Sabrine made sure my request for a female massage therapist was fulfilled and even explained the modest draping procedures to me.  \n \nWhen I arrived at the shopping center that housed   Massage Envy Spa River Edge, I was not quite sure how spa like my experience was going to be.   My doubts were promptly pushed aside as Sabrine greeted me and ushered me into a lovely and serene waiting room. As I filled out paper work about my medical history and massage preferences I enjoyed the Zen ambiance with delicate lighting, comfortable furnishings and soothing music.   Sabrine came to speak with me again and helped create a relaxing environment while my excitement built.   I would also be the lucky recipient of a sugar foot scrub! \n \nWhen I met Karon, my massage therapist, we discussed which body parts I wanted included and excluded, any pain I was having and what I was hoping for.   The massage room was cool and the ambiance level was high. It was cozy, inviting and relaxing. There was a comfortable table that felt like a bed and a plush blanket over the sheet . The customizability of my massage continued as Karon asked me what level pressure I preferred and checked in with me as she switched body parts that the pressure was alright.   I was quickly able to relax as Karon did an outstanding job balancing friendliness with limited conversation to ensure that I had the most relaxing experience possible. \n \nThe massage itself was excellent. Karon made sure I was comfortable the entire hour long session and I was truly able to relax at an entirely new level. My sore and tense body parts from working out and carrying children quickly let go of any tension and I felt great.   The sugar foot scrub, available in both lavender and unscented, was icing on the cake for my feet and toes that needed some TLC from a summer of flip flops and running shoes.     \n \nWhile the purpose of my massage was for relaxation, Massage Envy does offer many types of massages and treatments. An older woman in chronic pain entered the spa while I was leaving and Sabrine and the staff were doting and attentive to her specific needs.   I believed that a plan could be created for anyone’ s needs as I was presented with a summary of my appointment as well as recommendations for next time.   For   those of you lucky enough to go for massages on a regular basis, Massage Envy does offer monthly memberships that provide you with discounts and other benefits. If only I could cancel my gym membership and go for massages instead…… \n \n All in all, Massage Envy Spa River Edge left me extremely relaxed and happy with my experience. I would definitely go back there for another massage. The entire staff was attentive, professional and caring. It was wonderful from start to finish and left me feeling amazing.  \n \nThank you to Massage Envy for providing complimentary services in exchange for an honest review.  \n \n\nShare and Enjoy  • Facebook • Twitter • Delicious • LinkedIn • StumbleUpon • Add to favorites • Email • RSS   \nThe post Wondering What a Trip to Massage Envy is Like? appeared first on The Mama Maven Blog .", "source": "The Mama Maven Blog"}