{"published": "2015-09-07T17:34:49Z", "media-type": "News", "title": "26-Year-Old Shoots-Down Sephora Stores Offer To Carry Handmade Organic Skincare Products Worldwide", "id": "899f3095-7456-4f9e-9635-35aceb0aa472", "content": "Los Angeles, CA, Sept. 7, 2015 (GLOBE NEWSWIRE) -- Carrying thousands of brands and selling hundreds of millions of dollars per year in products, Sephora can now be found in almost every city across the globe. The large chain retail store, specializing in cosmetics and perfumes, has become a corporate leader in the cosmetics industry.  \n\nRyan Zamo, the 26-year-old creator of the organic skincare line ' Z Skin Cosmetics ', has officially denied Sephora's offer to carry his line of organic products. Zamo's' decision was announced after his return from a 4-month hiatus, the 26-year-old took a break from 'Z Skin Cosmetics' after his mother and co-founder of the company was found dead in her Florida home earlier this year . His mother, Karen Zamo, was a long time plant biologist and horticulturist, specializing in exotic herbs and oils from around the world, the 26-year-old commented \"My mom was a huge part of the developmental process of the products, our products have won so many awards because of the unprecedented ingredients we use, and that is all thanks to my mom.\" \n   \n3 weeks prior to the unexpected death of his mother, Sephora approached Zamo with an offer to carry his products in stores around the world, Zamo commented \"I would love to have taken the offer, but after these past few months, I realized that I should take more time for myself. I don't mind working 19 hour days and answering each phone call and email inquiry personally, but without my mom here, I know I have to take on a much larger work load. I turned down Sephora's offer to work on rebuilding the companies infrastructure instead, I've brought in new team members to help out with branding and marketing, and I really want to zero in on fine-tuning my current products.\" The 26-year-old has already launched a new custom e-commerce store, a user-friendly company website and has hired new team members to manage customer accounts, social media outreach and brand marketing. \n\nThe company started in Zamo's kitchen last year, after creating organic acne products for himself, he said \"I struggled with acne since a teenager and I tried everything possible, from the prescription creams to the expensive products on television. The reason I started selling the products was to help others the way I wish I could've been helped, I wanted to bring the changes I wanted to see in the market, to my own company. Part of the reason I priced all the products under $25, is so that anyone can afford them, because I know how it feels to spend exuberant amounts of money on products that don't work.\" Z Skin Cosmetics has now expanded from a few products being made in Zamo's' kitchen, to an internationally selling line of organic skincare, hair care and mineral makeup products. Z Skin Cosmetics was started in Zamo's kitchen just last year, and in the past 11 months, the company has skyrocketed to an international leader in the organic cosmetics market. \n\nFor An Additional 25% Limited-Time Discount On All Orders From The New Z Skin Cosmetics Online Store , Enter Promo Code \"GROUP3\" At Checkout \n\nFor the full Z Skin Cosmetics company story, please visit: http://www.zskincosmetics.com/#!whoweare/m3tqp \n\nPress Contact: \n\nRyan Zamo, CEO \n\nRyan@ZskinCosmetics.Com \n\n973 851 8573 ", "source": "Vision Monday"}