{"published": "2015-09-03T02:45:30Z", "media-type": "News", "title": "Telling porkies: Pork brands caught making false 'free-range' claims", "id": "5ccdc413-d0c3-45f1-8924-380d0d1e2bd4", "content": "If you buy 'free-range' pork believing it's from pigs that can move about in a paddock, the ACCC says you have most likely been misled. \n\nIf you buy \"free-range\" pork, believing it's from pigs that can move about in a paddock, the consumer watchdog says you have most likely been misled and wasted your money.\n\nThe companies behind popular supermarket brands Primo Smallgoods, KR Castlemaine and Otway Pork have conceded to the Australian Competition and Consumer Commission they may have breached the law by spruiking products with \"free-range\" and \"bred free-range\" claims.\n\nSince 2009, Primo Smallgoods has labelled its pork \"free-range\" when the pigs, from Denmark, were confined to roofed areas with solid or partially slatted floors.\n\nFor most of the past 15 years, Otway Pork, which prides itself on farming \"naturally\", promoted its products as \"bred free-range\" when the pigs were born outdoors but raised indoors to straw-based shelters from the age of 21 days. KR Castlemaine committed the same offence.\n\nAll three have given court enforceable undertakings to the consumer watchdog, following an extensive investigation.\n\n\"The producers have committed not to use the same descriptions unless their farming practices are such that, at a minimum, the pigs are able to move about freely in an outdoor paddock on most ordinary days,\" said ACCC chairman Rod Sims.\n\n\"They have also agreed to implement consumer law compliance programs and publish corrective notices.\"\n\nThe industry's peak body Australian Pork Limited has also been criticised by the ACCC for using the term \"outdoor bred\" in the title and logo of one of its production standards. Mother pig\n\nSome traders were deceptively using the terms \"outdoor bred\" and \"bred free-range\" to describe the living conditions of the mother pig, rather than the pigs raised and slaughtered for consumption.\n\nThe ACCC said the terms were misleading as consumers were unlikely to link the marketing terms to the sow.\n\nAustralian Pork has agreed to change the term to \"outdoor bred, raised indoors on straw\" to make it clear the pigs are raised indoors from weaning to slaughter.\n\n\"When claims such as 'free-range' or 'bred free-range' are misused, consumers may be misled into paying more for a product feature that doesn't exist,\" Sims said.\n\n\"Competitors are also harmed as legitimate free range producers unfairly lose their competitive advantage. Innovation suffers when consumers and business lose trust in the integrity of claims.\"\n\nOn Thursday, Australian Pork told Fairfax Media that extending the term \"outdoor bred\" reflected the industry's aim to give consumers complete certainty \"they are buying what they think they are buying\".\n\n\"The co-operative nature in which the industry and the ACCC have resolved this issue will certainly go a long way to giving clear direction to suppliers of pork products who use this form of production method as to how their products should be labelled in the future,\" said Australian Pork's communications manager, Emily Mackintosh. The story first appeared on Good Food.", "source": "Riverina Leader"}