{"published": "2015-09-21T16:52:40Z", "media-type": "Blog", "title": "Mad Catz Ships the R.A.T. PROX Gaming Mouse", "id": "029a3a78-920b-4fb4-adf8-18b165561411", "content": "Mad Catz Ships the R.A.T. PROX Gaming Mouse Sep 21, 2015 Bob Buskirk All News, Gaming News, Hardware News, Press Releases 0 Mad Catz Interactive, Inc. (“Mad Catz”) announced today the shipping of the R.A.T. PROX, the next generation of adjustable PC gaming mice compatible with Windows 10. Designed to be the world’s most advanced gaming mouse, the R.A.T. PROX durable magnesium alloy chassis anchors a high performance gaming mouse that combines groundbreaking features, patent-pending technology and a level of customization never before seen. Conceived as a wholly unique and future-proof gaming mouse, gamers can upgrade and customize key components of their R.A.T. PROX, thanks to the Modular Sensor Units (MSU). Offering a choice of optical and laser sensors, each with built-in memory profiles, the R.A.T. PROX allows gamers to hot-swap the Modular Senor Units to suit their individual style of play or when new sensor technologies become available. In addition, the R.A.T. PROX innovative Scroll Wheel system allows gamers to adjust the click force of the wheel, swap out the wheel itself and even utilize a new analogue strafe feature, giving gamers analog control over the horizontal movement on the scroll wheel for the first time. “Since launching our flagship R.A.T. range some five years ago, we have been working hard on what comes next and today we’re excited to announce the official debut of the game changing R.A.T. PROX. Designed for passionate PC Gamers, who demand high performance and a level of customization that suits their individual style of play, the R.A.T. PROX represents the next generation of gaming mice.” said Darren Richardson, President and Chief Executive Officer of Mad Catz. “PC gaming continues to represent a sizable segment of our business, and one which we feel is poised to grow further. We believe the introduction of the R.A.T. PROX, will connect with core gamers around the world, enabling us to expand our market share and appeal to an ever widening audience.” For additional information or to order your R.A.T. PROX please visit the product page. Gaming, Gaming mouse, Mad Catz, Mouse, R.A.T. PROX", "source": "Computer Hardware Reviews - ThinkComputers.org"}