{"published": "2015-09-01T22:05:56Z", "media-type": "News", "title": "Eagle Growth and Income Opportunities Fund Declares Monthly Distribution of $0.109 Per Share and Announces Investor Call", "id": "434c5c15-be07-481c-a960-8f421e5a47a0", "content": "NEW YORK--(BUSINESS WIRE)-- Eagle Growth and Income Opportunities Fund (the “Fund”) (NYSE:EGIF) today announced the declaration of its monthly distribution of $0.109 per common share, payable September 30, 2015. Based on the Fund’s current share price of $17.10as of its close on September 1, 2015, the distribution represents an annualized yield of 7.65%. Information regarding the distribution rate is included for informational purposes only and is not necessarily indicative of future results, the achievement of which cannot be assured. The distribution rate should not be considered the yield or total return on an investment in the Fund.\n\nRead additional information\n\nThe following dates apply to this distribution:Ex-Dividend Date:September 16, 2015Record Date:September 18, 2015Payable Date:September 30, 2015 A portion of each distribution may be treated as paid from sources other than undistributed net investment income, including but not limited to short-term capital gain, long-term capital gain or return of capital. As required by Section 19(a) of the Investment Company Act of 1940, a notice will be distributed to the Fund’s stockholders in the event that a portion of a monthly distribution is derived from sources other than undistributed net investment income. In January or February of each year, investors will be sent a Form 1099-DIV for the previous calendar year that will define how to report these distributions for federal income tax purposes. The Fund today also announced that it will hold an investor call on Thursday, September 3, 2015 at 4:15 pm ET to discuss its business outlook. James C. Camp, Managing Director and Portfolio Co-Manager of Eagle Asset Management, Inc., the Fund’s subadviser, Kevin Kelly, Chief Investment Officer of Recon Capital Partners, and Steven Baffico, CEO of Four Wood Capital Advisors LLC, the Fund’s investment adviser, will host the call.", "source": "Investor's Business Daily"}