{"published": "2015-09-23T22:20:12Z", "media-type": "News", "title": "SHAREHOLDER ALERT: Rigrodsky & Long, P.A. Announces A Securities Fraud Class Action Lawsuit Has Been Filed Against Northwest Biotherapeutics, Inc.", "id": "e15f1da5-4de5-4f71-b002-6c2dc39bd226", "content": "SOURCE Rigrodsky & Long, P.A.\n\nWILMINGTON, Del. \n\nRigrodsky & Long, P.A. announces that a complaint has been filed in the United States District Court for the District of Maryland \n\nIf you purchased shares of Northwest Biotherapeutics during the Class Period, or purchased shares prior to the Class Period and still hold Northwest Biotherapeutics, and wish to discuss this action or have any questions concerning this notice or your rights or interests, please contact Timothy J. MacFall, Esquire or Peter Allocco \n\nThe Complaint alleges that throughout the Class Period, defendants made materially false and misleading statements, and omitted materially adverse facts, about the Company's business, operations and prospects. As a result of defendants' alleged false and misleading statements, the Company's stock traded at artificially inflated prices during the Class Period.\n\nAccording to the Complaint, on August 21, 2015 \n\nOn this news, shares in Northwest Biotherapeutics dropped over 21%, closing at $6.96 \n\nIf you wish to serve as lead plaintiff, you must move the Court no later than October 26, 2015. A lead plaintiff is a representative party acting on behalf of other class members in directing the litigation. Any member of the proposed class may move the court to serve as lead plaintiff through counsel of their choice, or may choose to do nothing and remain an absent class member.\n\nAttorney advertising. Prior results do not guarantee a similar outcome.\n\nCONTACT: \n\nRigrodsky & Long, P.A.\n\nTimothy J. MacFall, Esquire \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/shareholder-alert-rigrodsky--long-pa-announces-a-securities-fraud-class-action-lawsuit-has-been-filed-against-northwest-biotherapeutics-inc-300148207.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KYTX CBS 19"}