{"published": "2015-09-04T05:21:00Z", "media-type": "News", "title": "I’m one of the people you would prefer to see dead", "id": "ec287c3d-efc0-426f-912d-734fea4092af", "content": "Before I go to bed, I will take a moment to thank the universe my parents moved to Australia long before I was born, just as I have done every single night of my life since I was a child. (Pic: Supplied) Source: Supplied DILVIN YASA Source: News Corp Australia You and I have never met but you’re probably frightened of me. At the very least you’re almost certainly frightened by the idea of me. If you look closely at my photo however, you might have trouble placing exactly what it is that you should be frightened of. And perhaps this is my biggest point, because usually it isn’t obvious — not even if you’ve worked by my side for a solid decade.\n\nThose people currently threatening to swarm our nation to bleed our country dry and destroy our unique way of life? Yep, I’m one of them and not only that, I’m ticking every box in that great list of People You Would Rather See Die Than Come Live In Our Country. Middle-Eastern, Muslim — once I finish writing this, you probably think I’m going to studiously stockpile my ammo as I rant to Centerlink about increasing my payments. Then I’m going to make a detailed plan on how to turn Australia into the next Iran. There won’t be many words — just a lot of pictures using the words “Ka-Pow” — ammiriiight?\n\nLet me tell you what I’ll really be doing. I’ll be finishing off a feature on the future of breast cancer research, speaking to a few TV producers about some segments I’ll be filming later this month and then I’ll be enjoying a cold hard drink with mates at the end of the day.\n\nThere’s one thing that differentiates the two of us however — before I go to bed, I will take a moment to thank the universe my parents moved to Australia long before I was born, just as I have done every single night of my life since I was a child. And that they were able to do so in a way where there was little risk of my brothers’ tiny bodies washing up on a random beach.\n\nIt’s at this point you’re probably thinking — but you’re nothing like those people on the news! You don’t wear a headscarf! You were born here! And I’m here to tell you that the only difference between me and those dead children is mode of transport.\n\nI’m fortunate that my parents were able to come here — by plane — 45 years ago and be welcomed with open arms. I’m lucky that they chose a time when the common local sentiment wasn’t “turn back the boats” and the remedy to leave people like my parents to die or rot behind bars.\n\nThe key fear is that “these people” will bleed our welfare system dry and trample all over our way of life. I have no doubt in my mind that had little Aylan and his mother and brother lived and they’d miraculously been given asylum in Australia, they would have eventually blended in so that you would never have guessed their background.\n\nLike my parents, they would have worked 15 hour days and paid their taxes to contribute to the country sheltering their babies. They would have assimilated like my parents did — putting up Christmas trees and dressing up as the Easter bunny so that their children didn’t grow up feeling like Syrian kids growing up in Australia, but feel like regular Australians.\n\nAnd the kids? They would have worked bloody hard to create the kind of life that would make their parents proud. One that made their parents glad they left everyone they ever loved behind in their home country. Like me and my brothers, the kids would probably have married Australians and raised children who are unable to speak their grandparents’ mother tongue.\n\nAnd you know what? I have no doubt that every night before each member of Aylan’s family went to sleep, they would thank the universe that a country like Australia existed and that they could make their home in it. Just as we’ve always done.\n\nSo the next time you’re looking at images of desperate asylum seekers and you find yourself thinking you don’t want “them” in your country, that they’re too different and that they’ll never fit in, take another look at my photo and reconsider your position.\n\nOriginally published as", "source": "Brisbane Courier-Mail"}