{"published": "2015-09-26T21:13:00Z", "media-type": "News", "title": "Woman's art, nonprofit offers support to cancer patients", "id": "245b0fb6-cd43-40ff-b134-1f33c1a32d02", "content": "GAINESVILLE, Ga. \n\nA mother caring for her disabled son pinches and saves every penny to feed her family.\n\nA grandmother raising her grandchildren struggles to pay for their everyday needs.\n\nThe women and more like them share two common bonds: Each is battling cancer and each has been helped by ovarian cancer survivor Sue Sigmon-Nosach.\n\nThe catch is Sigmon-Nosach does not know their names, and she plans to keep it that way.\n\nFor nearly three years, Sigmon-Nosach has helped 363 Northeast Georgia women through the Partnership for Gynecological Cancer Support. The nonprofit organization supplies women with gift cards to use for their everyday needs, ranging from money to buy groceries and gas to purchasing medications to stave off the side effects of chemotherapy treatment.\n\n\"Some of our patients are uninsured,\" said Elida Lopez, an oncology patient navigator with Dr. Andrew Green's office in Gainesville. \"Getting the medications they need to help them feel better is paramount. It's critical to making them have a better outcome.\"\n\nAnd Sigmon-Nosach knows first-hand about striving for a better outcome.\n\nIn 2004, she was diagnosed with ovarian cancer. Her doctor told her she would \"be dead within a year.\" The statistics stood by her doctor's diagnosis.\n\nOvarian cancer accounts for more deaths than any other cancer of the female reproductive system, according to the American Cancer Society website (www.cancer.org). This high mortality rate reflects, in part, an absence of early symptoms and a lack of effective screening tests, according to the National Cancer Institute website (www.cancer.gov). A woman's chance of dying from ovarian cancer is about 1 in 100.\n\nSigmon-Nosach is one of the lucky ones who survived the diagnosis and bypassed her prognosis. Along the way, she found a way to heal from her battle wounds through art and cultivated a new friendship that blossomed into something bigger than the both of them.\n\nIn 2009, Sigmon-Nosach and her friend and fellow ovarian cancer patient, Debbie Torbett, formed an art business, 2 Broken Broads. It was an outlet for their artistic skills as well as a way to raise money and awareness for ovarian cancer.\n\nThen in March 2013, the women designed a new business plan. They founded A Partnership for Gynecological Cancer Support, a nonprofit geared to help women undergoing treatment of the disease. Its mission is to assist with living expenses not covered by insurance.\n\nIn its first year, the organization helped about 50 women who suffered from ovarian cancer. Both women were thrilled at the results.\n\nHowever, the bond and business the women formed experienced a hard blow less than a year later. Torbett lost her battle to cancer and died in January 2014. In the time since, Sigmon-Nosach has carried on, coveting the final words of her friend and keeping a promise at the same time.\n\n\"She asked me how long I would do this,\" Sigmon-Nosach said, recalling her final visit to see her friend. \"I told her 'As long as I have breath in my body, I will do this.\"\n\nAnd she has.\n\nSigmon-Nosach is busily preparing for the third annual fundraiser \"A Broad's Brush: the Art of Survivors,\" set for Sept. 27 at Quinlan Visual Arts Center in Gainesville.\n\nThe one-of-a-kind aspect at the auction is the 11 artists featured is either an ovarian cancer survivor or has been touched by the disease. The art donated to the auction helps raise money for the Partnership.\n\nArt from women who survive cancer has a special place in Sigmon-Nosach's heart. She said art therapy helped her survive the aftermath of ovarian cancer.\n\nTherefore, Sigmon-Nosach enrolled in an art course at Brenau University. She tried watercolors at first, but the medium \"didn't drive fast enough.\"\n\nShe switched to glass mosaics and found her niche. Torbett joined her in the practice, which led them to form 2 Broken Broads.\n\n\"We decided to call ourselves the Broken Broads because we took things that were discarded, like broken glass, and made art,\" Sigmon-Nosach said.\n\nOne of her pieces will be up for auction at the event. Other items have been separated into three divisions: a Chinese raffle, silent auction and live auction.\n\nAll proceeds from the event go to A Partnership of the Gynecological Cancer Support group, which helps women who are suffering from the disease. Last year's event raised $47,000.\n\nSigmon-Nosach does not know how much they will raise this year, but she hopes for more, especially since most of the money is given to an area woman in need.\n\n\"We want to put money in the hand of people here who need it,\" she said.\n\nBut of course, she does not even know their faces or names. And she thinks that's best.\n\n\"For their sake, it's easier for them to take (the gift),\" she said. \"They know where it comes from.\"\n\nIt comes from a fellow ovarian cancer survivor. \n\nInformation from: The Times, http://www.gainesvilletimes.com", "source": "Idaho Statesman"}