{"published": "2015-09-09T18:56:24Z", "media-type": "News", "title": "Expert: Sleep deprivation is 'torture' 1 hour ago", "id": "aadf14b2-0e3f-4dc6-b750-fbe114dad5c0", "content": "Expert says sleep deprivation is 'torture,' calls for later work day \n43 \n51 1 Share This Story! \nLet friends in your social network know what you are reading about \nExpert says sleep deprivation is 'torture,' calls for later work day \nIf you need validation that being at work before 10 a.m. feels like \"torture,\" here it is. \nPost to Facebook \nTry Another \n\nAudio CAPTCHA \n\nImage CAPTCHA \n\nHelp \n{#\n                    \n                    #} \nCancel Send \nSent! \nA link has been sent to your friend's email address. \nPosted! \nA link has been posted to your Facebook feed. \nUP NEXT 03 \nAn Oxford University researcher says forcing ourselves to work before 10 a.m. doesn't line up with our bodies' circadian rhythms.\r\nVideo provided by Newsy Newslook \n\nTired person sleeping in the car. (Photo: Ximagination, /iStockphoto) \n\nIf you need validation that being at work before 10 a.m. feels like \"torture,\" here it is. \n\nEarly schedules go against the body's natural \"clock\" and can impact learning and health, Paul Kelly, an honorary clinical research fellow at Oxford University's Sleep and Circadian Neuroscience Institute said, BBC reported. \n\nKelly addressed a crowd at the British Science Festival in Bradford, England, and said making people under age 55 work before 9 a.m. is not conducive to a productive work force. \n\n'We cannot change our 24-hour rhythms,\" Kelly said. \"You cannot learn to get up at a certain time. Your body will be attuned to sunlight, and you're not conscious of it because it reports to the hypothalamus, not sight.\" \n\nHe noted that staff and students are usually sleep deprived and called the problem an \"international issue.\" \n\nKelly and researchers at Oxford University are currently recruiting 100 schools around the United Kingdom to take part in a study on delayed school start times and student performance. \n\nFollow @MaryBowerman on Twitter.  \n\nRead or Share this story: http://usat.ly/1EVoT7E \nTOP VIDEOS 0) { %> \n0) { %> \n\n0) { %>", "source": "13NewsNow.com"}