{"published": "2015-09-01T19:28:28Z", "media-type": "News", "title": "SHAREHOLDER ALERT: The Law Offices of Vincent Wong Notify Investors of Class Action Involving Investment Technology Group, Inc. and a Lead Plaintiff Deadline of October 5, 2015 - ITG", "id": "ccf8b62c-e4c4-4a3f-b4b3-ff30706ca3e6", "content": "NEW YORK, Sept. 1, 2015 (GLOBE NEWSWIRE) -- The Law Offices of Vincent Wong announce that a class action lawsuit has been commenced in the USDC for the Central District of California on behalf of investors who purchased Investment Technology Group, Inc. ( NYSE:ITG ) securities between February 28, 2011 and July 29, 2015. \n\nClick here to learn about the case: http://docs.wongesq.com/ITG-Info-Request-Form-875 . There is no cost or obligation to you. \n   \nThe complaint alleges that throughout the Class Period defendants issued materially false and misleading statements and/or failed to disclose that: (a) the Company's AlterNet Securities, Inc. subsidiary operated a proprietary trading operation in 2010 through mid-2011 inside of Investment Technology's POSIT dark pool, a private stock trading platform, against some of its broker clients; (b) the proprietary trading operation used information from customer stock orders within Investment Technology's dark pool, as well as information from clients that used the firm's algorithms to execute trades on other trading platforms, which should not have been available; and (c) as a result, the Company's public statements were materially false and misleading at all relevant times. \n\nIf you suffered a loss in Investment Technology you have until October 5, 2015 to request that the Court appoint you as lead plaintiff. Your ability to share in any recovery doesn't require that you serve as a lead plaintiff. To obtain additional information, contact Vincent Wong, Esq. either via email vw@wongesq.com , by telephone at 212.425.1140, or visit http://docs.wongesq.com/ITG-Info-Request-Form-875 . \n\nVincent Wong, Esq. is an experienced attorney that has represented investors in securities litigations involving financial fraud and violations of shareholder rights. Attorney advertising. Prior results do not guarantee similar outcomes. \nCONTACT: Vincent Wong, Esq.\n         39 East Broadway\n         Suite 304\n         New York, NY 10002\n         Tel. 212.425.1140\n         Fax. 866.699.3880\n         E-Mail: vw@wongesq.com", "source": "CEOWorld Magazine"}