{"published": "2015-09-22T09:00:00Z", "media-type": "News", "title": "EPA report on fracking hangs on a single word", "id": "d17ca61c-5e48-4ea1-b90a-427ee6ddfceb", "content": "When the Environmental Protection Agency published its recent draft report saying fracking is not a “widespread” hazard to drinking water, industry supporters grabbed onto the statement like a Florida alligator grabbing dinner. \n  \nAmerican Petroleum Institute Upstream Group Director Erik Milito declared “the evidence gathered by EPA confirms … hydraulic fracturing is being done safely under the strong environmental stewardship of state regulators and industry best practices.” \n      \nSierra Club Executive Director Michael Brune said the report showed: “dirty oil and gas fracking contaminate drinking water.” \n \nThe report made both points — and neither of them. In an excellent example of political obfuscation, carefully created with “more than five years and millions of (taxpayer) dollars,” the report hangs on one word: “widespread.” In other words, fracking in one section of a state probably does not directly affect water supplies in another. \n \nFor example, there are tens of thousands of fracking wells in Pennsylvania alone. Some have leaked, some may eventually, and some may never. The lack of decisive findings, the agency reports, may “be due to a lack of data collected, inaccessible information or other limiting factors,” including a lack of full disclosure by the industry. \n \nIn 2010, an Exxon subsidiary spilled 57,000 gallons of used fracking water that was later discovered in a tributary of the Susquehanna River. \n \nA driller in Clearfield County continued to use a wastewater injection well four months after it knew the toxic fluid was leaking into area groundwater. It stopped using the well only after the EPA acted on proof provided by area citizens. \n \nAnother company was fined for multiple cases of insufficient erosion and sedimentation controls in Potter County — revealed not by a Pennsylvania Department of Environmental Protection inspector but by heavy rains washing fracking pollution into the Right Branch of Wetmore Run, a state-designated “high-quality” stream. \n \nLast month, the DEP levied a record (for the agency) $8.9 million fine against natural gas giant Range Resources for refusing to fix bad cement work on a natural gas well, and allowing methane to migrate into private water supplies. The fine is more than double the DEP’s previous record fine, a $4.15 million sanction, also against Range Resources, for violations at a half-dozen wastewater impoundments. \n \nA recent study has linked fracking to increased radon exposure, and we so far have no understanding of what effects may be caused by earthquakes resulting from the deep injection of chemical-laden fracking water. \n \nMeanwhile, commercial water companies already have proven their capability and willingness to move water from where it is clean to where it has been made undrinkable, and since they own the water, they do not have to ask permission or pay for the new supply. The ploy allows us to pretend the water supply is endless, when nothing could be farther from the truth. \n \nThe DEP lists 256 incidents in which private water supplies have been impacted by either conventional or unconventional drilling. In some cases, the impact has been wells that have run dry. In others, they have been contaminated. What we do not know is how much time must elapse for a spill to pass through the ground into our water supply, or how many such leaks might prove too great a cumulative effect for the water supply to effectively overcome. \n \nWe do know that when we finally discover fracking pollution in our water, there will be no valve by which we can turn it off. The best we can do is patiently hope it will run its course, like a fever from a particularly virulent virus. \n \nThe EPA says its study “advances scientific understanding of the potential impacts of hydraulic fracturing.” But the report also proves that we need to adequately fund the DEP and the EPA to ensure studies and inspections are accomplished quickly and constantly, so that the first indication of poison headed for our waters is caught and, to the extent possible, stopped. \n \nThe gas producers are not responsible for proving their product will destroy drinking water supplies. Instead, they hope that by the time harm to the water is demonstrated, the profits will have been harvested and the companies will have moved on to other endeavors, leaving taxpayers to clean up the mess, and buy clean water from commercial companies trucking and piping it from where it still exists. \n \nReaders may contact John Messeder at john@JohnMesseder.com.Distributed by Bay Journal News Service.", "source": "Pearland Journal"}