{"published": "2015-09-24T06:33:57Z", "media-type": "Blog", "title": "New retail landscape could favour health stores and eco brands", "id": "d5f22844-432d-493d-98f7-6f2515f05797", "content": "  \n The rapidly changing retail market could favour independent health retailers and eco brands, a leading retail analyst has suggested.  \nMartin Watkins, head of retail and business insights at analysts Nielsen, said there was “no going back” to the retail model that dominated the pre-internet era. \n \nSpeaking at a recent Soil Association Trade briefing, Watkins said that the new landscape was characterized by features such as ‘Channel shifts’, ‘retailer disruption’, ‘small store shopping’, ‘digital and disloyal’, ‘low growth in FMCG’ and ‘spending less, saving less’. \n \nThe single biggest change in retail, he said, was “the shift of spend away from large store formats”. That change in behaviour is boosting footfall on local high streets to the potential benefit of independents. \n \nMeanwhle, with an improving economic outlook, health has been rising up the consumer agenda. 60% of shoppers polled by Neilsen said they were “actively looking for healthier options” when food shopping, with 33% saying their main focus is “longevity and maintaining good health” (tellingly, in 2015 “reducing sugar intake” has replaced “getting my five-a-day” as consumers’ number one health priority). \n \n“34% would be willing to switch to a more environmentally friendly brand, and 23% to more a environmentally friendly retailer” \n \nEco and organic brands are also likely to benefit from shoppers’ “wider ethical expectations”, says Nielsen. 67% of shoppers said they like to support local businesses and farmers, while 34% would be willing to switch to a more environmentally friendly brand, and 23% to more a environmentally friendly retailer.", "source": "www.naturalproductsonline.co.uk"}