{"published": "2015-09-04T12:26:31Z", "media-type": "News", "title": "Fuhu Brings the Power of The Force to nabi as it Unleashes The Force Star Wars™ Accessory Bundle with the Collector's Edition nabi Tablet", "id": "c839cb17-52fb-4c3b-9fa6-37a067f09af5", "content": "EL SEGUNDO, Calif. , Sept. 4, 2015 /PRNewswire/ -- May The Force be with your tablet. Today, Fuhu, the creator of the award-winning nabi ® tablet -- the world's first Android tablet built just for kids -- and the foremost innovator in technology for kids and their families, has released The Force Star Wars ™ accessory bundle with the Collector's Edition nabi tablet.  The Force Star Wars ™  accessory bundle  enables the next generation of Star Wars fans to showcase their fandom across the ultimate next generation kids' tech product: the nabi tablet. The accessory bundle will feature an array of physical and digital products and experiences for kids to fully customize their nabi tablet in Star Wars style.  \n  \nTwo very special The Force Star Wars accessory bundles will duel it out at retail — a \"Light Side\" version and a \"Dark Side\" version – each equipped with authentic sound effects and themed wallpapers to customize kids' on screen experience, as well as tablet stickers and themed bumpers to personalize the exterior of the tablet. The Star Wars Light Side accessory bundle will first be available at Best Buy and will feature a \"Jedi-worthy\" glow-in-the-dark Drop Safe ® bumper as well as an R2-D2 frame and sticker wrap. Meanwhile the Star Wars Dark Side bundle, available widely at retailers including Walmart, Target, Toys \"R\" Us and nabiShop.com, will include a menacing Vader-like black bumper and striking Stormtrooper frame and exterior sticker wrap to show allegiance to the Dark Side. \n \nBoth will come packaged with a Collector's Edition nabi 7\" tablet, featuring a new sleek design and containing the latest Android OS with Fuhu's groundbreaking Blue Morpho OS overlay -- including more than 400 kid-safe, parent-approved features and digital experiences. Each tablet will be individually stamped with a holographic mark identifying it as one of a finite number of tablets as part of the Star Wars bundle from Fuhu. The Force Star Wars ™ accessory bundle with the Collector's Edition nabi tablet will carry a MSRP of $169.99 . \n \n\"The special Star Wars accessory bundles and the Collector's Edition nabi tablets have been designed in line with Fuhu's vision of providing enriching experiences for kids that surprise and delight,\" said Jim Mitchell , CEO of Fuhu. \" STAR WARS:  The Force Awakens will undoubtedly ignite the next generation of Star Wars fans, and The Force Star Wars bundles will allow kids to express their love of all things Star Wars in a very tangible way, all contained in a tablet that is both kid-friendly and parent-approved.\" \n \nThe Force Star Wars accessory bundles provide a very special way for kids to bring a little bit of The Force into their everyday lives.  Both packages include access to download a digital suite of authentic Star Wars visuals and sound effects from the Star Wars movie franchise to customize the on screen experience.  These include", "source": "Virtual Strategy Magazine"}