{"published": "2015-09-01T12:05:59Z", "media-type": "News", "title": "Why Kitchensurfing made its independent contractors into employees", "id": "faf70823-6db7-4e5a-887c-65d31ff80414", "content": "Kitchensurfing launched in 2013 as a platform for hiring private chefs for dinner parties. Customers could choose their chef from a list of in-depth profiles, each one listing the chef’s own menu and personal connection to the food.\n\nThat, it seemed, had limited appeal, so the company shifted from a chef-driven platform to one that aims to solve a problem. Namely, the weeknight dinner problem. Kitchensurfing still offers private chefs, but customers no longer pick which chef they want to hire, nor do they plan too far in advance. Now, in Manhattan and Park Slope, Brooklyn, at least, Kitchensurfing is pitched as an in-home alternative to eating out or ordering takeout. The chef comes to your home, cooks and serves you a meal, and cleans up—with the whole process taking less than 30 minutes. It costs an average of $25 per person.\n\nThat pivot happened at the beginning of this year, not long after the company’s co-founder and CEO Chris Muscarella stepped aside and Zynga SVP Jon Tien took the reins. (The dinner party service is still available in six U.S. cities, but it is not Kitchensurfing’s focus.) Without revealing any business metrics, Tien says the change in strategy has paid off, with rebooking rates significantly higher than the dinner party service.\n\nNow, Tien is making a proactive step that many on-demand startups are likely also pondering: He’s making Kitchensurfing’s chefs, who previously worked as independent contractors, into employees.\n\nThis move comes in the wake of a California ruling which stated that car service platform Uber must classify its drivers as employees, rather than independent contractors. It has set off a debate among the burgeoning class of on-demand startups, which save money by not having to provide benefits for the workers on their platforms.\n\nThe ruling set off a wave of predictions that this issue would reshape the sharing economy. But the sharing economy may be reshaping itself on its own to fend off future lawsuits. Several startups have already proactively made the switch including Shyp, Sprig, Instacart, and Luxe.\n\nKitchensurfing has joined that club. Tien says Kitchensurfing can provide higher consistency of service and quality training to its chefs if they’re employees. It also helps with scheduling to meet demand, he says.\n\nTien won’t reveal how high the demand is, or how many chefs are active on Kitchensurfing’s platform. He will only say that Kitchensurfing has more chefs than \"the largest restaurant in New York City.\" In addition to the chefs, the company has 30 employees.\n\nKitchensurfing has raised almost $20 million in venture funding from Box Group, Spark Capital, Tiger Global and angel investors.", "source": "Fortune"}