{"published": "2015-09-09T11:00:00Z", "media-type": "News", "title": "Microsemi Aims to Solve Most Challenging Cyber Security Issues with Formation of a Security Center of Excellence", "id": "42abd1ff-47ac-47c0-9dcb-d7d279225445", "content": "ALISO VIEJO, Calif. , Sept. 9, 2015 /PRNewswire/ --  Microsemi Corporation ( Nasdaq: MSCC ), a leading provider of semiconductor solutions differentiated by power, security, reliability and performance, today announced the formation of a Security Center of Excellence in response to rapidly evolving cyber security threats in the connected world. Staffed with a team of security and systems analysts, as well as cryptography, hardware and software engineers, the Security Center of Excellence proactively addresses the most critical security issues across multiple vertical markets to provide additional value for its customers, while also taking a leadership role to create a safer, more secure world. \n\n\"Our comprehensive security product portfolio coupled with our security team's capabilities in system analysis, threat vulnerability identification and analysis, and ability to create highly tailored solutions have enabled Microsemi to expand our security presence in multiple markets,\" said Paul Pickle , president and chief operating officer (COO) at Microsemi. \"In today's cyber hacking world, it is essential for every public and private organization to proactively address security issues. Our customers in the communications, aerospace, automotive, industrial and Internet of Things (IoT) markets are benefitting from Microsemi's broad range of security offerings and security system expertise to provide them higher level solutions addressing today's increasing security threats.\" \n   \nMicrosemi's rich heritage in security technologies was founded from its long-term efforts in providing high-grade security solutions for defense-based applications, with a focus on cryptography and security firmware, software and hardware solutions for the most challenging information assurance and anti-tamper needs. The company's capabilities have expanded significantly over time to also include the industry's most secure field programmable gate arrays (FPGAs) with differential power analysis (DPA)-certified countermeasures and layered cryptographic controls, allowing for true supply chain assurance and system authentication. Microsemi's security solutions include cryptography and the company's enhanced WhiteboxCRYPTO™ software providing even greater security, anti-tamper and key management IP, secure and rugged solid state drives (SSDs) protecting data at rest, secure synchronous time-generating solutions to protect critical communications infrastructure, and Ethernet security products to protect data in motion. \n\nMore information on the Security Center of Excellence is available at http://www.microsemi.com/product-directory/services/3606-security-center-of-excellence-scoe . All Microsemi security products and services are now available to customers in every market through the Security Center of Excellence, including: \n\nMicrosemi's Risk Assessment Services \nMicrosemi's system penetration testing evaluates a customer's system in detail to access critical system data/functions, discover vulnerabilities, enumerate threats, and outline the likelihood and consequence of system compromise. These services, performed by engineers experienced in attack tree modeling, reverse engineering and exploitation tools and techniques, provide the basis for protection planning and security engineering services. System risk assessments supply information helpful in analyzing costs and benefits, and assist in making critical security decisions to mitigate threats with minimal impact to program cost or schedule. \n\nMicrosemi's Protection Planning Services  \nUsing a risk assessment and any other compiled data, customers receive a report with protection implementation cost estimates, presentation materials and a protection design document. This report describes how to mitigate identified system vulnerabilities and ensure successful verification and validation of the system. All possible mitigations will be considered and proposed including hardware, firmware / IP, or software. In addition, protection evaluation services review the security of customers' protection designs to document residual vulnerabilities in the exposed system. \n\nMicrosemi's Red and Blue Teaming Services  \nThe company's red teaming services start with a black-box approach, pitting experienced reverse engineers with state-of-the-art attack tools against a customer's system in a deployed setting. Results from a red teaming services engagement can reveal vulnerabilities not otherwise found during most other evaluation exercises. Blue teaming services use the same experienced engineers, but provide them with full access to documentation, architecture diagrams and other engineering expertise. A blue teaming approach typically reveals flaws in protection design or protection implementation. \n\nMicrosemi's Security Engineering Services  \nMicrosemi's dedicated engineering team specializes in tools, processes and methods required to design, implement, test and adapt existing systems to ever-changing environments. The company's services may be employed to implement protection designs or to consult with government information assurance and anti-tamper experts within Microsemi's resource network. Additionally, engineers can develop custom security solutions and novel protection mechanisms unique to a customer's product. \n\nMicrosemi's Side-channel Analysis & Mitigation  \nMicrosemi utilizes a DPA testing framework and workstation platform for evaluation of side-channel threats. The testing platform offers measureable, objective and repeatable testing for resistance to side-channel attacks across all applications where tamper resistance is critical. Microsemi has the only Cryptography Research, Inc. (CRI)-accredited independent DPA testing laboratory headquartered in the U.S. \n\nUpcoming Microsemi Security Forum & Webinars \nAs defense-grade services are an important aspect of security design, Microsemi is offering a Security Forum on Oct. 1 at the Hilton Baltimore BWI Airport, as well as a series of webinars on the subject to its broad array of current and future customers across multiple markets, including industrial and commercial, automotive, medical and aviation. To register for Microsemi's Security Forum, visit http://www.microsemi.com/microsemi-security-forum?cm_mid=4902762&cm_crmid=434f1f0a-8187-e411-9a27-005056ae010b&cm_medium=email . For more information on Microsemi's security webinars, email sales.support@microsemi.com . \n\nAbout Microsemi's Defense and Security Product Portfolio \nMicrosemi is a provider of defense and security products and services, including secure FPGAs and system-on-chips (SoCs), secure SSDs, security software, anti-tamper solutions, FIPS-197 certified 1 Gigabit Ethernet and 10 Gigabit Ethernet PHYs with AES-256 MACsec support (IEEE 802.1AEbw-2013). Microsemi security services include risk assessment, protection planning, red teaming, blue teaming, security engineering and side channel analysis and mitigation. For more information about Microsemi's portfolio for defense applications, visit http://www.microsemi.com/applications/defense . For more information on Microsemi's security capabilities, visit http://www.microsemi.com/applications/security .   \n\nAbout Microsemi \nMicrosemi Corporation ( Nasdaq: MSCC ) offers a comprehensive portfolio of semiconductor and system solutions for communications, defense & security, aerospace and industrial markets. Products include high-performance and radiation-hardened analog mixed-signal integrated circuits, FPGAs, SoCs and ASICs; power management products; timing and synchronization devices and precise time solutions, setting the world's standard for time; voice processing devices; RF solutions; discrete components; security technologies and scalable anti-tamper products; Ethernet solutions; Power-over-Ethernet ICs and midspans; as well as custom design capabilities and services. Microsemi is headquartered in Aliso Viejo, Calif. , and has approximately 3,600 employees globally. Learn more at www.microsemi.com . \n\nMicrosemi and the Microsemi logo are registered trademarks or service marks of Microsemi Corporation and/or its affiliates. Third-party trademarks and service marks mentioned herein are the property of their respective owners. \n\n\"Safe Harbor\" Statement under the Private Securities Litigation Reform Act of 1995: Any statements set forth in this news release that are not entirely historical and factual in nature, including without limitation statements related to the formation of a Security Center of Excellence in response to the rapidly evolving cyber threats in the connected world, and its potential effects on future business, are forward-looking statements. These forward-looking statements are based on our current expectations and are inherently subject to risks and uncertainties that could cause actual results to differ materially from those expressed in the forward-looking statements. The potential risks and uncertainties include, but are not limited to, such factors as rapidly changing technology and product obsolescence, potential cost increases, variations in customer order preferences, weakness or competitive pricing environment of the marketplace, uncertain demand for and acceptance of the company's products, adverse circumstances in any of our end markets, results of in-process or planned development or marketing and promotional campaigns, difficulties foreseeing future demand, potential non-realization of expected orders or non-realization of backlog, product returns, product liability, and other potential unexpected business and economic conditions or adverse changes in current or expected industry conditions, difficulties and costs of protecting patents and other proprietary rights, inventory obsolescence and difficulties regarding customer qualification of products. In addition to these factors and any other factors mentioned elsewhere in this news release, the reader should refer as well to the factors, uncertainties or risks identified in the company's most recent Form 10-K and all subsequent Form 10-Q reports filed by Microsemi with the SEC. Additional risk factors may be identified from time to time in Microsemi's future filings. The forward-looking statements included in this release speak only as of the date hereof, and Microsemi does not undertake any obligation to update these forward-looking statements to reflect subsequent events or circumstances. \n\nLogo - http://photos.prnewswire.com/prnh/20110909/MM66070LOGO  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/microsemi-aims-to-solve-most-challenging-cyber-security-issues-with-formation-of-a-security-center-of-excellence-300139457.html \n\nSOURCE  Microsemi Corporation", "source": "Vision Monday"}