{"published": "2015-09-17T18:40:01Z", "media-type": "News", "title": "City welcomes Scotland before Rugby World Cup kicks off tomorrow", "id": "9b261fee-27b5-4bc8-b08d-6d16069e441b", "content": "Scotland rugby players were greeted with music from school pupils and given tournament caps during their official welcome ceremony at Gloucester Cathedral this afternoon. \n \nThe team will be based at Hartpury College for the next few days ahead of the start of their World Cup campaign at Kingsholm Stadium in Gloucester on Wednesday when they face Japan. \n \nThe ceremony was a celebration of Scotland Rugby's achievements and included their friends and family as well as members of the local community. \n \nThey arrived to a greeting from a choir from Isbourne Valley School performing official tournament anthem `World In Union` in front of an audience including figures from World Rugby, England Rugby 2015 and the Rugby Football Union. \n \nPaul James, leader of Gloucester City Council, presented the team with a special mini Scrumpty as a gift from the city. \n \nHe said: \"It is an immense honour to welcome the Scotland Rugby team to the city and a huge privilege for Gloucester to be a host city for the third largest sporting event in the world.\" \n \nFollowing welcome speeches from chairman of England Rugby 2015 Andrew Cosslett and Scotland manager Gavin Scott, each member of the team was presented with a Tournament cap and Rugby World Cup 2015 participation medal. \n \nThere were four cap and medal bearers who were selected from local clubs and educational institutions, representing the legacy of Rugby World Cup 2015. \n \nSpeaking during the ceremony, Scotland captain Greig Laidlaw who also plays for Gloucester Rugby, said: \"I am so proud to stand here as Scotland captain. It has been months, if not years, of hard work in preparing for this event. \n \n\"To all the people of Gloucester it is great to be here. I joined the club just over a year ago and I have really enjoyed getting to know the city. \n \n\"I have been explaining to the boys how much you love rugby and they could see it as we drove through the city. But I have one small plea. \n \n\"Japan will be playing in cherry and white on Wednesday so for once please could you put that to one side. It would be much appreciated. \n \n\"We look forward to seeing you all at Kingsholm on Wednesday.\" \n \nThe ceremony culminated with a beat-boxing performance by local act Duke. \n \nGloucester Cathedral is among 17 landmark venues across England and Wales chosen to host Welcome Ceremonies. \n \nIt is predicted to be the biggest boost for the UK's travel and tourism industry since the London Olympics three years ago, pumping almost £1billion into the economy during the next month and a half.", "source": "Punchline"}