{"published": "2015-09-01T09:02:30Z", "media-type": "News", "title": "Ukraine Anti-Autonomy Protest Outside Parliament Turns Violent As Country Votes On Decentralization Bill; 2 Police Officers Dead", "id": "c45c194e-9df2-42b9-b343-7e1aaed29315", "content": "Update as of 5:13 a.m. EDT: Two police officers have succumbed to injuries following clashes with protesters in Kiev, Ukraine, Monday while over 140 people are being treated at a hospital, Agence France-Presse reported Tuesday, citing Interior Minister Arsen Avakov. Both officers were reportedly members of Ukraine's national guard. \n \nOriginal story: \n \nViolent protests in Ukraine outside the country’s parliament killed one member of the National Guard and injured at least 69 others on Monday, as fighting broke out between protesters and authorities, following a controversial constitutional vote. \n \nThe Ukrainian National Guard reportedly said that a young conscript had died due to shrapnel wounds from a major blast that rocked the area outside Kiev’s parliamentary building. Police said that some people in the crowd were seen lobbing live grenades at officers. At least four of those injured were said to be in serious condition, and the casualties included troops who had fought against pro-Russia separatists in eastern Ukraine. \n \nThe violence occurred after a vote to amend Ukraine’s constitution to allow greater autonomy for local governments was introduced Monday. Ukraine’s President Petro Poroshenko has backed the deal -- negotiated in February with the help of several Western countries -- as a key part of a peace agreement between Kiev and the breakaway regions in the country’s east. \n \nHowever, nationalists and other opponents of the bill said that it would grant too much autonomy to the rebel-held regions of Donetsk and Luhansk. In a video address after the incident, Poroshenko praised the vote as a step toward the peace agreement and condemned the violence as a “stab in the back,” promising tough security measures against those involved, BBC reported . \n \nThe protesters were reportedly affiliated with the populist Radical Party movement and the ultranationalist Svoboda (Freedom) Party. \n \nUkrainian Interior Minister Arsen Avakov reportedly said that about 30 people had been detained, including one Svoboda member who had confessed to throwing a grenade. \n \nHowever, Svoboda said in a statement that the police had initiated the fighting, and that the government had “provoked Ukrainians to protest” against the proposed bill, according to the Wall Street Journal. \n \nAt the end of the debate, 265 of 450 lawmakers backed the first reading of the bill, which must get a constitutional majority of at least 300 votes in its second reading before it can come into effect. The date for the next reading has not been decided yet.  \n \nHowever, the bill’s passage is far from certain. Three parties in Poroshenko’s own ruling coalition voted against the bill, including the party of former prime minister Yulia Tymoshenko. The debate over the bill turned rowdy when opposing lawmakers attempted to disrupt the vote by chanting slogans and drowning out the discussion with an amplified siren.", "source": "International Business Times"}