{"published": "2015-09-04T10:48:10Z", "media-type": "News", "title": "Liberal MP's impassioned plea for refugees", "id": "0ae023c5-7c4c-48d4-8ac6-4521015f539a", "content": "  A Coalition MP has made an impassioned plea to the Abbott government to consider taking more refugees from Syria in response to the growing humanitarian crisis in Europe. \n\nCraig Laundy made the call to Julie Bishop and Immigration Minister Peter Dutton after being shown the harrowing picture by his 16-year-old daughter of a young boy whose body had washed up on a beach in Turkey. \n\n\"Can we please do more?\" the MP from western Sydney asked Ms Bishop on Friday morning. \n\nForeign Minister Julie Bishop later told reporters the question of an increased intake was \"under consideration\", although Tony Abbott suggested a further increase was unlikely. \n\nThe Abbott government is being urged to take an extra 20,000 Syrian refugees to demonstrate Australian compassion in response to the largest movement of people since the Second World War. \n\nGlobal aid agencies have backed a call by the Greens to approve the temporary increase, grant asylum to Syrian refugees already in Australia or in offshore detention and make an emergency contribution to the United Nations refugee agency to address the crisis. \n\nSeveral government MPs, including Mr Laundy, Barnaby Joyce and Russell Broadbent, are supporting an increase in the intake as well as a skewing of the existing intake toward Syrian refugees. \n\nDeclaring \"we can do better\", World Vision's Tim Costello has urged the government to take more refugees as it moves to approve bombing of Islamic State targets in Syria. \n\n\"When you are bombing, people are fleeing and you have a clear ethical responsibility as you fight ISIS to treat this as a human security issue, not as some leave pass not to shoulder some of that burden,\" Mr Costello told Fairfax Media. \n\nThe Refugee Council of Australia is backing the call for an increased intake, saying Australia has contributed to the flow of desperate people by \"closing our borders in the way that we have\". \n\n\"Australia has a responsibility, capacity and the resources to be able to scale up our refugee intake generally, but the scale of the humanitarian crisis in Syria provides additional urgent impetus for us to act,\" said the council's chief executive, Paul Power. \n\nWhile Ms Bishop said Australia would play its part and that \"this matter is under review by the Minister of Immigration\", Mr Abbott suggested no further increase was being contemplated. \n\nMr Abbott said Australia had already agreed to take an extra 4400 refugees from Syria and Iraq, saying the success of its actions to stop boat arrivals had made this possible. \n\nMr Laundy, a father of three, said that after seeing the photograph of the dead child \"we broke down as a family around the dinner table thinking, 'There but for the grace of god go any of us'\". \n\n\"I say this to the Australian people: 'Put yourself in these people's position. lf you were faced with what they are faced with, would you put your life at risk to give your children a chance?'. My answer is yes.\" \n\nThe Prime Minister was untroubled by a scathing attack on Australia's approach to border protection by The New York Times newspaper, saying the most compassionate thing a country could to in the medium to long term was shut down the people smuggling trade. \n\n\"It's obviously a crisis right now on the borders of Europe and I think a lot of people right around the world are looking at what we've done and said, 'Well, if Australia can stop the people smuggling trade, if Australia can end the deaths at sea, perhaps we can learn from them'.\" \n\nAn editorial in the newspaper described Mr Abbott's policies as \"inhumane, of dubious legality and strikingly at odds with the country's tradition of welcoming people fleeing persecution and war\". \n\nGreens leader Richard Di Natale has written to Ms Bishop and  Mr  Dutton requesting the increase. \"Four million people are fleeing war in Syria. Two million of those are children. To welcome 20,000 of them into our community would be such an honourable and dignified response from Australia,\" Senator Di Natale said. \n\n\"Australia has an opportunity to do something great here. We have the strength, the capacity and the generosity to support people who are seeking safety,\" said Greens immigration spokeswoman Senator Sarah Hanson-Young. \n\nAnoop Sukumaran, executive director of the Asia Pacific Refugee Rights Network, said a substantial increase in Australia's refugee intake would help rebuild the credibility lost as a result of this country's \"extreme\" and \"draconian\" refugee policies. \n\nOxfam Australia's Dr Helen Szoke backed the intake increase and called on governments to improve infrastructure and support local economic development, education and health programs in neighbouring countries, to ensure people living in crisis-affected communities and refugees can access basic services. \n\nMr Joyce was touched by the personal story of a man whose plastic bag of water bottles and a packet of biscuits were his only possessions in the world. \n\n\"As an accountant myself, when you see an accountant walking across the border into Hungary from Syria when his life has been destroyed I feel a sense of empathy for him,\" Mr Joyce told The West Australian . \n\nFollow us on Twitter \n\nThe story first appeared on The Sydney Morning Herald .", "source": "Cessnock Advertiser"}