{"published": "2015-09-24T22:38:11Z", "media-type": "News", "title": "Towboat's new engines may herald cleaner industry in MN", "id": "95255509-fb3d-44fa-8407-2ab86a994f87", "content": "The 56-foot Mississippi River towboat Becky Sue got a heart transplant Thursday, when a pair of 600-horsepower diesel engines were lowered into her hull. \n \nTowboats are big and rusty and wet, covered with clanking hardware and cable and rope. Engines the size of chest freezers roar and strain below decks. Exhaust spouts from the boats' stacks as they churn along the river. \n \nBut the modification to the Becky Sue represents a new effort to curb pollution and carbon emissions. The vessel's new engines were subsidized in part by the Minneapolis-based Environmental Initiative and Flint Hills, which owns the oil refinery in Rosemount. \n \nMike Harley is executive director of the nonprofit Environmental Initiative, whose Project Green Fleet just finished retrofitting more than 3,000 school buses in Minnesota. \n \n\"We're one of the first states to do that,\" Harley said. \"And so now, we're moving on to heavy-duty diesel equipment. That's construction equipment, marine engines, railroad equipment, the really big engines that power our economy.\" \n \nThe pair of really big engines hoisted into the Becky Sue weigh about 5 tons and cost more than $80,000 each. They burn diesel fuel by the barrel. \n \nBut not as much as the old engines. \n \n\"This one swap-out is going to remove the pollution equivalent of taking 12,000 cars off the road a year,\" Harley said. \n  The tow boat Becky Sue is getting new, cleaner burning engines like the one at right, to replace its old, dirtier engine, left.   Tim Nelson | MPR News  \nLee Nelson, president of Upper River Services, the company that offers towing and barge services on the Mississippi and Minnesota Rivers in the Twin Cities, said barges are already an efficient way to ship commodities like cement, steel and road salt. But Nelson said his company moved up its overhaul of the Becky Sue to take advantage of new engine technology sooner. \n \n\"We will see a savings in fuel consumption,\" he said. \"If it's not consuming the fuel, then you're not emitting pollutants. Additionally, these will more completely combust the fuel. And thirdly, these are going to have a little bit more horsepower, such that we believe we will see at times very significant operational efficiencies. So we will be moving more with less.\" \n \nThe towboat is also getting a new transmission, cooling system and controls, among other things. All told, the upgrade will run about $360,000.  About a quarter of that is being paid by the Green Fleet program. \n  Workers lower the second of two engines into the tow boat Becky Sue, part of an upgrade funded by Minneapolis-based Environmental Initiatives intended to curb pollution.   Tim Nelson | MPR News  \nState environmental officials say such upgrades aren't just feel-good gestures toward curbing fine particles and other air pollution. \n \nThe U.S. Environmental Protection Agency is poised to set new health-based air quality standards next week. Minnesota Pollution Control Agency assistant commissioner David Thornton said it isn't clear Minnesota will meet the new standards without changes like the engines on the Becky Sue. \n \n\"We've been fortunate here in the Twin Cities to be in compliance with these standards, although we've only been barely in compliance as they keep tightening them down,\" he said. \"And it's projects like this that have been helping us keep ahead of air quality standards.\" \n \nWere Minnesota to fall behind, there could be real costs, Thornton said. \n \n\"It's been estimated that if we ended up in violation of air quality standards here, the cost of regulation on the business community in the Twin Cities would be well in excess of $200 million a year,\" he said. \n \nThe Environmental Initiative has spent about $10 million since 2005 cleaning up school buses, trucks and fire engines. It hopes the Becky Sue will help push another wave of change in heavy industry across the state.", "source": "Minnesota Public Radio"}