{"published": "2015-09-05T14:59:32Z", "media-type": "News", "title": "Taylor Swift brings 1989 party to Salt Lake City", "id": "1a8dcb88-2e5d-44ca-a4a8-d083229cf1cd", "content": "Taylor Swift performed before a sold-out show at EnergySolutions Arena Friday night.\n                                                                   … \r \nSALT LAKE CITY — \"Good evening Salt Lake. I'm Taylor,\" the pop superstar introduced herself Friday night to a roar of applause. \n\nTen years ago, Taylor Swift was driving through Salt Lake City with her mother, making stops on her radio promotion tour and hoping to get stations to play her songs. \n\nFriday, it was hard to find anyone in Salt Lake City who didn't know Taylor Swift was in town, or to find a top 40 station that didn't play her music. Swift's show sold out within minutes of going on sale months ago. \n\nArguably the biggest pop star in the world currently, Swift brought her massively successful, big-budget \"1989 Tour\" into Salt Lake City. \n\nAnd it was everything fans hoped it would be. \n\nThe shrills from the audience, made up of mostly pre-teen and teenage girls, was deafening when the lights went down, signaling the start of the show. Some young girls actually cried as their pop hero appeared on stage for the first time. Many held signs, some decorated with battery-powered lights, all with phrases representing some part of the \"1989\" album. Some waved large cardboard \"1989\" numbers. \n\nOpening with \"Welcome to New York,\" Swift entered onto a Big Apple-esque stage setting. The massive bi-level stage included a large digital screen in the back and two screens on either side so every person in the house could get a close-up look at Taylor. A catwalk stretched out to about three-quarters of the arena floor. \n\nLike her last tour, Swift's set list Friday concentrated heavily on her most recent album, the namesake of her tour, including \"Out of the Woods\" and crowd favorite \"Style.\" \n\nAnd while there weren't as many stage props as her last tour, Swift's show included high-tech cameras that are traditionally only seen at major sporting events, and wristbands that were handed out to all 15,000 people in the arena. The wristbands were programmed to light-up in certain colors during different points of the show to complement the music, making the entire arena part of the stage show. \n\nJoining Swift on stage were her band, backup singers and a highly talented dance troupe of about a dozen men who performed with her for nearly every song, turning each number into a mini-theatrical production. \n\n\"I Know Places,\" from \"1989,\" incorporated several doors as part of the dance number. Illuminated umbrellas were used for \"How You Get The Girl\" in a \"Singing in the Rain\"-type of setting. \"Wildest Dreams\" was made to resemble an u…", "source": "MyInforms"}