{"published": "2015-09-23T06:00:00Z", "media-type": "News", "title": "How a wedding uplifted Blackall", "id": "05fd7061-9c7b-4b92-b6a0-88ebdfaa4682", "content": "The story behind the wedding photo that went viral, scoring $15,000 for Tie Up The Black Dog. \n\nWHEN Ingrid Uebergang (nee Wood) decided to return to her hometown of Blackall for her wedding earlier this month, it couldn’t have come at a more difficult time.\n\nBull dust swept across the red plains; untouched by decent rainfall for far too long.\n\nSince her father passed away six years ago, it had been up to Ingrid’s mother to run the family property, Koondoo, a 16,187-hectare sheep-turn-beef operation.\n\nLike many livestock producers in the region, she watched as her mother let go of parts of their herd as the drought took its grip.\n\nThen the week before the wedding, they were forced to destock the final numbers – eight cows in calf.\n\nBut despite the dry conditions, Ms Uebergang was always set on returning home for a wedding.\n\n“Blackall is a pretty important place for me; I’ve grown up there my whole life,” Ms Uebergang said.\n\n“It’s such a beautiful place as well even in the middle of a drought, it really comes alive…And I was really hoping it would rain.”\n\nThe bridal party. Picture: EDWINA ROBERTSON PHOTOGRAPHY. \n\nAnd despite the trying times, it took an age-old ritual to reflect the warmth in a strong, but battered rural community.\n\n“Having our wedding at Blackall was really about involving the whole community so all the people I used were local,” Ms Uebergang said.\n\nThe alcohol was bought from the Blackall pub.\n\nCaterers hired a van from nearby Longreach and purchased meat and vegetables locally.\n\nThe bride’s aunties helped fold serviettes.\n\nThe floral arrangements – in their rich, native beauty – were collected by various members of the Blackall community.\n\n“Everyone went around their paddocks and just cut down anything they could find that looked half pretty. Everyone chipped in and helped,” Ms Uebergang explained.\n\nThe bride's bouquet. Picture: EDWINA ROBERTSON PHOTOGRAPHY. \n\nThe bride and groom wrote a list of sights to see and things to do for their 160 guests to do on arrival to the 1600-population town.\n\nThey were excited to share a part of their world with their closest friends and family.\n\n“I think my family were really conscious to involve the community,” Ms Uebergang said.\n\n“I know all the shops in town were just nuts on Saturday morning [of the wedding].”\n\nWhen Ms Uebergang’s wedding photographer, Edwina Robertson, approached her about using her photo in a social media post to raise awareness for a rural mental health organisation, she was wrapped.\n\nThe wedding photo that went viral. Picture: EDWINA ROBERTSON PHOTOGRAPHY\n\n“I felt so touched she had obviously felt the importance of the community and how much joy a wedding had brought to our community when she was out there,” Ms Uebergang said.\n\nOn Tuesday at 8pm, photographer Edwina Robertson posted on her Facebook page an offer to personally pledge $3 to the Tie Up the Black Dog (TUBD) organisation for every share of the picture within 24 hours.\n\nThe photo went viral, receiving 4974 shares and reaching 430,000 people on the social media network.\n\nMs Robertson has since confirmed she’ll donate $15,000 to TUBD.\n\n“It’s such a fantastic cause. Everyone knows about the drought, but you just hear all the bad and this is a good thing that has come out of it,” Ms Uebergang said.\n\n“I’ve been able to take 160 guests to the Blackall community any they’ve been able to be part and spend money in my community for a few days.\n\n“Now, Eddie has been able to share it with everyone else.”\n\nThe story first appeared on Queensland Country Life.", "source": "Lithgow Mercury"}