{"published": "2015-09-30T18:21:49Z", "media-type": "News", "title": "Are calcium pills any good at preventing bone fractures?", "id": "33fed637-928e-4b5d-9f8d-df32a6f8a83f", "content": "“Calcium supplements don’t work, say experts,” The Daily Telegraph reports. \n \nWhile this headline is not strictly true, new research has shown that for most healthy people, calcium supplements will make little difference to your bone health or risk of breaking a bone. \n \nThe researchers looked at the best studies they could find that had looked at the relationship between calcium and bone fracture.  \n \nFor many years, older people have been advised to increase their dietary calcium intake or take a calcium supplement, as calcium is a building block of strong bones. Vitamin D is often recommended alongside calcium, as the body can’t absorb calcium without vitamin D. \n \nHowever, the researchers found that increasing calcium to the high levels recommended in some countries (although not the UK) did not make much difference to the chances of breaking a bone, even when taken alongside vitamin D.  \n \nCalcium pills did increase bone strength by about one to two per cent, but the researchers say this is unlikely to make a difference to fracture risk. \n \nPrevious studies have shown that calcium supplements may cause side effects, including constipation.  \n \nHowever, there’s no need to stop taking calcium and vitamin D supplements if you’ve been advised to take them by your doctor, as there is little doubt they can help people who are deficient in these nutrients. As for everyone else, it seems that taking these pills is an unnecessary expense.  \n \n Where did the story come from?  \n\nBoth studies were carried out in New Zealand by researchers from the University of Auckland and the University of Otago – plus researchers from the Starship Hospital involved in the bone density study. They were funded by the Health Research Council of New Zealand. \n \nThe studies were published in the peer-reviewed  British Medical Journal (BMJ) on an open-access basis, so are free to view online. \n \nThe main messages of the studies came across in the media reports, although they did not go into detail about the different findings for supplements and dietary calcium, or the problems with some of the studies.  \n \nThe Mail Online focused on the potential harms of calcium supplements, such as stomach upsets and heart problems, which were not included in this research. \n \n What kind of research was this?  \n\nThe researchers carried out two systematic reviews . The first looked at the effect of increased calcium on people’s bone strength, the second looked at the effect of increased calcium on people’s risk of having a fracture. \n \nSystematic reviews are the best way of summarising the evidence on a topic at any one time. However, the results are only as good as the trials done so far. \n \n What did the research involve?  \n\nResearchers searched for all the good quality studies they could find that looked at calcium intake and subsequent fracture or bone strength in people over 50.  \n \nWhere possible, the researchers pooled the results to get an overall answer to the question of whether increasing calcium intake, from pills or food, had an effect on either fracture or bone strength. \n \nThe researchers began by looking at randomised controlled trials (RCTs) of increased dietary calcium or calcium supplements (including studies with calcium plus vitamin D). They did not find enough RCTs looking at the effects of dietary calcium on fracture to answer the question, so they also included cohort studies exploring this relationship. \n \nThe researchers pooled all the results from RCTs to give an overall figure for the effect of calcium on bone strength, measured as bone mineral density (BMD) and the chances of having any fracture, or a specific fracture of the wrist, hip or spine. They then looked at the range of results to see whether they showed the sort of spread you would expect to see by random chance. \n \nFor the cohort studies, the researchers found that the studies didn’t report their results in a consistent way. This meant they could not combine the figures in one pooled analysis. Instead, they looked at how many studies reported any effect of increased calcium intake on fracture risk. \n \n What were the basic results?  \n\nThe researchers found 59 RCTs looking at the effect of calcium on bone mineral density, including 13,790 people. The effect of increased calcium after one year was a 0.6% to 1% increase in BMD. \n \nWhen they looked at the effects of eating more calcium in the diet, the researchers found 14 out of 22 cohort studies (covering 291,273 people) did not show that calcium had any effect on the chances of breaking any bone. Of those studies that found people with a higher intake of calcium were less likely to have had a fracture, most showed only a small effect. \n \nThe 26 RCTs of calcium supplements, which covered 69,107 people, showed a small effect. They appeared to reduce the risk of fractures by 11% ( relative risk 0.89, 95% confidence interval 0.81 to 0.96). \n \nHowever, when they looked at the overall range of results, the researchers said there were more positive results from small studies than you would expect to see by chance. They say this shows evidence of “publication bias”, where only positive studies are published and studies with negative outcomes aren’t.  \n \nThey looked at the results again, including only the bigger, more reliable studies. This analysis did not show an overall protective effect from calcium supplements. \n \nOnly in one big study of frail elderly women living in nursing homes, who had very low levels of calcium and vitamin D at the outset, did supplements make a difference to the risk of hip fracture. \n \n How did the researchers interpret the results?  \n\nThe researchers say their results show that increasing calcium in the diet is not likely to decrease risk of broken bones, on current evidence.  \n \nThey say the benefits found from calcium supplements are small and inconsistent, and “probably have an unfavourable risk benefit profile” given the known side effects of taking calcium. \n \nTalking about the one study that showed a significant reduction in hip fracture, the researchers say this group of elderly women were known to have been deficient in vitamin D, and therefore to have been at higher risk of breaking bones.  \n \nThey said this study should not be included in the same analyses as other studies of generally healthy people living in the community, nor should it be used to come up with calcium recommendations for the general population. \n \n Conclusion  \n\nThese two studies pour cold water on the idea that most healthy people aged over 50 need to eat more calcium than they currently do, or that they need to take calcium supplements. They found that, for most people, increased calcium has little effect on bone strength or chances of breaking a bone. \n \nHowever, the research is based on available studies, of which there were only two small randomised controlled trials with a combined total of 262 people that looked at calcium intake and risk of fracture.  \n \nThe cohort studies found are not able to show cause and effect as they are subject to confounding , so the combination of these limitations reduces the strength of the results found in this systematic review. \n \nThe UK government currently recommends getting 700mg of calcium daily – and says a healthy, varied diet is likely to provide this for most people.  \n \nGood sources of dietary calcium include dairy products such as milk, cheese and yoghurt; oily fish such as sardines and anchovies; or nuts and seeds such as almonds and sesame seeds. To get higher levels of calcium, recommended by some organisations, calcium supplements may be needed. \n \nThe results of this study suggest most people are unlikely to benefit from taking additional calcium. \n \nWe know from previous studies that calcium supplements can have side effects in some people, including constipation and kidney stones . Calcium supplements have also been linked to an increased chance of having a heart attack. You are unlikely to get these side effects from eating a normal amount of calcium as part of a healthy diet. \n \nIt’s important to remember that most of these studies were looking at generally healthy older people, not people who had a medical reason for taking calcium supplements.  \n \nIf you’ve been advised by your doctor to take calcium and vitamin D supplements because you have weak bones (osteoporosis) , or because you are deficient in these nutrients, you should continue to take them.  \n \nLinks To The Headlines \n \nHow calcium tablets can do more harm than good: Pills can increase risk of stomach upsets and heart problems while not cutting the risk of broken bones . Mail Online, September 29 2015 \n \nCalcium supplements don’t work, say experts . The Daily Telegraph, September 29 2015 \n \nLinks To Science \n \nBolland MJ, et al. Calcium intake and risk of fracture: systematic review . BMJ. Published September 29 2015 \n \nTai V, et al. Calcium intake and bone mineral density: systematic review and meta-analysis . BMJ. Published September 29 2", "source": "Before It's News"}