{"published": "2015-09-17T16:00:00Z", "media-type": "News", "title": "Brutally Honest Emmys Ballot: Producer Skewers 'House of Cards,' 'Homeland' (\"I Wrote 'WTF?'\")", "id": "783b29ce-92bb-4924-a4e0-70f9f2e3d7aa", "content": "This story first appeared in the Sept. 25 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe . \n\r \nAll of the roughly 19,000  members of the TV Academy belong to one of 29 \"peer groups\" (i.e., actors, writers, etc.) and are entitled to vote for the nominees — and, as of this year, also the win­ners — in the categories that pertain to their specific area of expertise; for series categories, all members vote. THR 's awards analyst Scott Feinberg spoke with one producer who has won an Emmy himself but who has no ties to this year's nominees to learn how he voted — and why. \n\r \nOUTSTANDING DRAMA SERIES \n\r \nI would have dumped Homeland , House of Cards and Downton Abbey and put in Bloodline , which was incredibly well done; The Good Wife , which made a really strong comeback this year and would have been nominated if it was on cable or a streaming service; and — don't laugh — Daredevil , a comic book show done ridiculously well that features the most watchable actor on television, Vincent D'Onofrio — in $5,000 suits! Downton Abbey , I confess, is not a show I watch; I've sampled it but I cannot get through it — I'd rather have hemorrhoid surgery. I wrote \"WTF?\" next to Homeland 's nomination; its first two seasons were as good as anything on television, but as soon as they — spoiler alert — hanged [ Damian Lewis during season three], it stopped being watchable and sort of became the drama version of the Tim Robbins show [ The Brink ]. I'm glad Orange Is the New Black , which has incredibly fresh performances and direction, was moved to the drama category; shows written in a room by comedy writers should compete against each other, but Orange isn't written that way and isn't that kind of a show. \n\r\n\r \nKudos to Netflix for giving really creative people free range, which is how the best work gets made — although it also can go terribly wrong, as in the case of House of Cards . I binge-watched the first season in two days and was a huge fan; then it had a weak second season; and then it totally jumped the shark this season — I was literally looking around for Henry Winkler , a small pool, a shark and a motorcycle. They just lost their way with a Sam and Diane moment: [ Kevin Spacey 's Frank Underwood] wants to be president in the worst way — and they made him president! Don't. Do. That. (It did have one good episode, the season finale, thanks to Michael Kelly , who was the only reason I kept watching.) I did not expect Better Call Saul to get nominated, but it absolutely deserves to be in there. Mad Men will probably win for its last season, which was very good — I liked that they didn't wrap everything up in a bow but also didn't just cut to black like The Sopranos . But Game of Thrones is the most important show on television. The scale of it and the amount of talk it generates is unparalleled; nobody wants to get to Monday without having seen what happened on Sunday, and that takes me back to the way TV was when I was growing up. \n\r \nMY VOTE Game of Thrones (HBO) \n\r \n\n\r \nOUTSTANDING COMEDY SERIES \n\r \nI'm delighted Parks and Rec was nominated — there's an unfortunate prejudice against broadcast network shows, but Amy Poehler 's work was outstanding and the cast is extraordinary. Silicon Valley and Transparent should have been nominated — [ Silicon 's] T.J. Miller plays one of the funniest characters on television and [ Transparent 's] Judith Light is one of the most underappreciated actresses out there. Unbreakable Kimmy Schmidt is terrific, but I was surprised it made it. I adore Modern Family and would have voted for it for the first three seasons, but it's now being nominated on its reputation — it did not have a very good season. Veep is a nice comedy — Julia Louis-Dreyfus is amazing — but I don't think the show is Emmy-worthy. (I would've taken out Modern Family and Veep and replaced them with Black-ish and Jane the Virgin .) But the bottom line is, there's Louie and then there's everything else. I don't understand how it hasn't already won. It's so groundbreaking and original; we'll look back on it as one of the great comedy series of all time. \n\r \nMY VOTE Louie (FX) \n\r \n\n\r \n'Louie' \n\r \nOUTSTANDING LIMITED SERIES \n\r \nFirst of all, it's nice to see a limited series category, but they still need to figure out what it means — it's like the three-card monte game of the Emmys. It should be easy to distinguish a limited series from a series: If you have a giant staff of writers and you're putting out a show with a different director every week, and you have actors who have contracts with options for multiple seasons, you're a series, and you shouldn't be able to compete as a limited series; if one or two guys are doing six or eight or 10 hours, you're a limited series. American Horror Story , which is not really my thing, is an out-and-out series — it's had a continuous writing staff, supervising director and EP. The same actors appear in every season and know, when they wrap one, that they're coming back for another — maybe as a different character in a different story, but so what? The same was true for The Twilight Zone , which was a drama series. Putting a colon in the title and changing the subtitle every year does not make you a limited series — and gives you the same sort of unfair advantage that putting \" Hallmark Hall of Fame: \" at the front of titles used to, which is frustrating for people who actually make limited series. \n\r \nAmerican Crime is coming back, so it should be a drama series, but I liked it very much. I would never have nominated Wolf Hall or The Honorable Woman — they were like watching paint dry. HBO shows get nominated because they're on HBO, which spends an enormous amount of money telling America: \"We're not TV. We're HBO.\" And it has worked — people internalize that and then vote for something in a category like this solely because it aired on HBO. There is no way Olive Kitteridge , with its pedantic pacing and obtuse storytelling, would have gotten the number of nominations it did — or would win, which it's going to — if it was on any other network. I'm going with American Crime , mainly because I can't vote for The Missing , which was the best thing on television this year. The fact that it wasn't nominated illustrates why it was a mistake to get rid of the blue-ribbon panels, which I used to serve on, for the nominations phase of voting. I didn't even know The Missing existed until someone told me to watch the screener, and thankfully Starz sent screeners of the whole thing, unlike some networks that send episodes one and seven or whatever ran­dom selections. \n\r\n\r \nMY VOTE  American Crime (ABC) \n\r \n\n\r \n'American Crime' \n\r \nOUTSTANDING TV MOVIE \n\r \nThere are a lot of really hard-working TV movie producers out there and the mission of the Television Academy is to celebrate people like them who work in television every day — come to work, put on their headset and do everything they can to make movies in probably the most difficult genre left in our business. I think about the number of places that made TV movies 10 years ago and the number of places that make them now, and I take my hat off to the people who are still doing it. So what do they do? They nominate two feature films [ Grace of Monaco and Nightingale ] that just couldn't get theatrical releases and give them two slots that could have gone to people who actually make TV. Furthermore, are we really still so in love with the Brits that we're nominating stuff like Agatha Christie's Poirot: Curtain, Poirot's Last Case ? Prime Suspect is one thing, but are you kidding me — Poirot for the 400th time? I watched 15 minutes of it and fell asleep. Peter Ustinov put that to bed. I didn't care for Hello Ladies or Killing Jesus — I wish they had nominated Whitney , which had a stunning main performance. That leaves Bessie , which is absolutely a deserving winner. \n\r \nMY VOTE Bessie (HBO) \n\r \n\n\r \n'Bessie' \n\r \nOUTSTANDING VARIETY SKETCH SERIES \n\r \nI think SNL had a really off year — they're obviously the institution, but they're slacking. I love [ Inside Amy Schumer 's ] Amy Schumer  — she goes right out to the edge of the diving board every episode and never falls off, and her 12 Angry Men parody was the best episode of any of these shows. Portlandia and Drunk History are hit or miss. I voted for Key & Peele because it's the funniest show on television and I am so crushed they are going off the air — they are completely original, completely without parameters and will go after anyone in an unbelievably clever way. \n\r \nMY VOTE Key & Peele (Comedy Central) \n\r\n\r \nOUTSTANDING VARIETY TALK SERIES \n\r \nI can't quarrel with any of these nominees. [ Jimmy ] Kimmel and [ Jimmy ] Fallon are really good and reshaping the format — and I don't know why anyone would ever host an Emmys or an Oscars with some­one other than one of them. With [ Stephen ] Colbert , [ Jon ] Stewart and [ David ] Letterman all saying goodbye this year, this is sort of the farewell-tour category. I'm a dedicated Stewart fan — he changed the game and will always be the gold standard — but I think he was sort of mailing it in this year, as Letterman has been doing for several years. (I would have been happy to replace Letterman and Colbert with Conan [ O'Brien of Conan ] and [ Real Time 's Bill ] Maher .) But in my opinion, the best show, week to week, was John Oliver 's. Granted, he has a whole week to prep his show, while the others have to do four or five a week — but I imagine all those other guys also work with much bigger writ­ing staffs, which sort of evens the playing field. \n\r \nMY VOTE  Last Week Tonight With John Oliver (HBO) \n\r \n\n\r \nOUTSTANDING REALITY COMPETITION PROGRAM \n\r \nBoring. These are the same nominees every year and I wouldn't choose to watch any of them — I have never seen So You Think You Can Dance or Project Runway , but I have watched Amazing Race , Dancing With the Stars and The Voice because they have been on in my house. I called up my family and asked them what I should vote for and they told me The Voice , which I found acceptable because I do think [creator] Mark Burnett is the Ed Sullivan of our day. But at the end of the day, does anyone besides the people who make these shows really care? The Amazing Race has won 10 out of the 12 years: They're like the Celtics in the '60s — I don't know why anybody else bothers to suit up. \n\r \nMY VOTE The Voice (NBC) \n\r \n\n\r \nOUTSTANDING STRUCTURED REALITY PROGRAM \n\r \nI have seen every one of the nom­inated shows except Property Brothers . I'm a fan of MythBusters , but it's been on a long time and they've sort of run out of myths. There have been episodes of Undercover Boss that I've liked, but each one really depends on whether or not they've found a great boss. Nothing comes close to Shark Tank . I'm a huge Mark Burnett fan, and this one is so well done that its title has now become part of the lexicon. And any time I can see Mark Cuban berating other billionaires, how would I not be into that? \n\r \nMY VOTE Shark Tank (ABC) \n\r \nOUTSTANDING UNSTRUCTURED REALITY PROGRAM \n\r \nI don't watch any of these reg­ularly. I saw two episodes of Wahlburgers on an international flight when there was nothing else left to watch on my little TV. And I've seen a few episodes of Intervention and I respect what they do for people battling addiction. \n\r \nMY VOTE  Intervention (A&E)", "source": "Hollywood Reporter"}