{"published": "2015-09-20T03:05:54Z", "media-type": "Blog", "title": "Film:North Korean Authorities Want The Interview Stopped", "id": "1fefcb39-3346-4b44-aec0-9dc601077d9d", "content": "Bala  \nTHE Interview, a movie starring James Franco and Seth Rogen as goofballs that clearly draws on stereotypes about North Korea, is currently circulating in Nigeria and the North Korean authorities wants the National Film and Video Censors Board (NFVCB) to discourage further illegal circulation of the film in the country. They complain that the film is in bad taste and that it promotes terrorism. \n \nIn the film that was produced in the mould of the 1988 feature The Naked Gun in which Leslie Nielsen gets in a brawl with the Ayatollah Khomeini, Mikhail Gorbachev, Yasser Arafat, Moammar Gaddafi, Fidel Castro and Idi Amin, a TV host and his producer secure an interview with the leader of North Korea – only to find themselves hired by the CIA to assassinate him. \n \nThe North Korean authorities have since lodged a formal complaint to the United Nations where they decried the distasteful nature of the film. They feel strongly that to allow the production and distribution of such a film on the assassination of an incumbent head of a sovereign state should be regarded as the most undisguised sponsoring of terrorism as well as an act of war. \n \nThe North Korean Ambassador to Nigeria Mr. Jong Choi had previously lodged compliant with the National Film and Video Censors Board (NFVCB) over the illegal distribution of a film which it regards as provocative and targeted at inciting the assassination of the North Korean supreme leader, Kim Jong-Il. Choi who recently paid a courtesy call to the Board expressed displeasure with the movie, which, according to him, not only misrepresents the strides and developments achieved by his country, but also seeks to portray and instigate negative global opinion against the leadership of the DPRK. \n \nThe Ambassador pleaded with the NFVCB to initiate action to mop the movie out of the Nigerian market and also cut the supply source. He revealed that a formal complaint had earlier been lodged at the Nigeria Police headquarters over the issue. He underscored the long-standing friendly relations between Nigeria and North Korea and emphasized the need to deepen existing ties. \n \nIn her response, the Director General of the Board, Ms Patricia Bala, informed the Ambassador that as a regulator, the agency had carried out due diligence in investigating the matter and established that the movie in question was never submitted to be considered for distribution in Nigeria and that its illegal sale was within underground markets in breach of the law. \n \nMs Bala stressed that the rules and regulations guiding the distribution and exhibition of movies in the country frown at any content capable of causing a breach of public order or subjecting any individual or nation to ridicule. She assured the North Korean envoy that the agency had already swung into action against the illegal distribution of the said movie, adding that the monitoring and enforcement operatives of the Board were under clear directives to track and bring those involved to face the full weight of the law. \n \nThe post Film:North Korean Authorities Want The Interview Stopped appeared first on The Guardian Nigeria .", "source": "The Guardian Nigeria"}