{"published": "2015-09-15T03:33:00Z", "media-type": "Blog", "title": "Vodafone UK will be getting a special Bond Edition Sony Xperia Z5", "id": "dc04cf74-b8c6-41f8-b3e9-01fec1ae6a14", "content": "The Sony Xperia Z5 was just announced not too long ago and already special editions are being made. This one is a James Bond special edition to celebrate the new movie SPECTRE, offered exclusively from Vodafone UK. Anyone who buys the Bond Edition Z5 will have the chance to download some special edition SPECTRE themes and content. Not only that, but there are also prizes and special offers to make this deal even more exciting. The 007 edition Xperia Z5 will still feature all the same features that make it just as great as the normal one such as: 23 MP camera, 2-day battery life, world’s fastest autofocus, and more. However, the exclusive content this Bond version will have are: official Bond themes, wallpapers, and a behind the scene blog from Miss Moneypenny herself which can all be downloaded from the Xperia Lounge. Nice so far, but that is not the best part. Anyone who pre-orders will be entered into a draw to win one of 50 Aston Martin experience days, that allows you to drive a variety of Aston Martin cars. Plus, Vodafone UK say if you pre-order or buy the Bond phone you can get a huge savings on a Sony Action Cam Mini so you can film your trip. But that’s not all! If you pre-order or order the Xperia Z5 Bond phone on one of our £49 Red 4GB Value 4G bundles, you’ll be able to buy a Sony AZ1VR Action Cam Mini for just £49, saving you a massive £200 on the RRP and letting you film your exploits in style. The Bond Xperia Z5 will be available for pre-order September 16th, at Vodafone UK. Source: Vodafone UK Come comment on this article: Vodafone UK will be getting a special Bond Edition Sony Xperia Z5\nVisit TalkAndroid for Android news, Android guides, and much more! from Android News, Rumours, and Updates http://ift.tt/1Kc8MSe", "source": "We Tech-Geeks"}