{"published": "2015-09-04T14:05:06Z", "media-type": "Blog", "title": "Liverpool FC fan in court over alleged disturbance with disabled supporters at Steven Gerrard's Anfield farewell", "id": "7781d366-1a23-49d5-8de1-613bde5b09ac", "content": "Liverpool FC fan in court over alleged disturbance with disabled supporters at Steven Gerrard's Anfield farewell 15:05, 4 September 2015 Updated 15:05, 4 September 2015 By Jonathan Humphries, Jonathan Poulter denies public order office at Steven Gerrard's last home game Liverpool FC v Crystal Palace FC Premier League Match at Anfield Stadium Liverpool. Steven Gerrard A Liverpool supporter has denied a public order offence involving disabled fans during Steven Gerrard’s last home game. Jonathan Luke Poulter, 20, of Chapel Road, Anfield, is alleged to have been involved in a disturbance in the Anfield stands as Liverpool faced Crystal Palace on May 16. The game was the last time Liverpool legend Steven Gerrard appeared for the club, before moving to LA Galaxy after an illustrious 17-year-career. Sefton Magistrates’ Court heard the incident occurred after a complaint by disabled fans that a Gerrard banner waved by Poulter was blocking their view. Poulter pleaded not guilty to using threatening, abusive or insulting words or behaviour to cause harassment, alarm or distress under Section 4 of the Public Order Act 1986. District Judge Richard Clancy set a trial date for November 3 at Sefton Magistrates’ Court. This week, it emerged that Liverpool FC are in discussion with supporters group Spion Kop to discuss potential improvements to the match day process for flagbearers. theliverpoolecho Related : Courts, Steven Gerrard, Liverpool FC, Sefton, Anfield, Get Liverpool FC news by email Invalid e-mail Subscribe Thanks for subscribing! Could not subscribe, try again later next article Related Articles Popular in News Recap: efforts to recover sunken Tall Ship Zebu in Albert Dock Netherton shooting 'could be linked to Vinnie Holligan case' Vinnie Holligan murder trial: Witnesses could face criminal charges after admitting lying to police Giant Liver bird landmark idea: how the internet reacted Historic tall ship Zebu sinks in Albert Dock", "source": "liverpoolecho - Home"}