{"published": "2015-09-23T14:58:45Z", "media-type": "Blog", "title": "Stitch Fix #3 Reveal", "id": "f5ae5406-88cf-4dbd-82c3-c83975763ca6", "content": "I received my third Stitch Fix over the weekend and it did not disappoint!  Per usual, my mom came over and helped me decide what to keep.  A also provided his input.  In the note to my stylist, I mentioned that I had pinned lots of styles I liked.  I could definitely tell that she had consulted my Pinterest board.  I love that each item sent was completely different and unlike anything I already had in my closet.  I even took real photos!!!  Holy moly!  Too bad I never stood in the same spot so the top of my head is cut off in some photos and my feet are cut off in all of them… oopsies.  And I probably chose the worst spot in the house for photos.  It’s clearly a work in progress. First up – the Tracy Dot Print Cross Back Knit Top.  That’s a mouth full of a description.  I thought the dots were cute and the crisscross in the back (which you can’t see – sorry) gave this top a little something extra. Next – the Kathy Striped Fit and Flare Dress.  This was super flattering.  It made my waist really tiny – after 2 babies (including one 10 pounder), anything that makes my waist look tiny is a keeper!  I think this would be really cute with a jean jacket for fall.  I think I got rid of my jean jackets so hoping to find a cute cardigan to pair with it.  I need to experiment. I then tried on the Fetra Scoop Neck Blouse and Dayna Skinny Jean.  First of all the blouse is a Daniel Rainn blouse and anything from Daniel Rainn is an automatic keeper for me.  I LOVED it.  And the jeans were so fun.  I don’t have any colored jeans.  These fit like a glove and were super soft.  Also, I thought I could get away with wearing them to work because they didn’t scream denim.  Love and love.  I’m actually wearing this outfit today. Finally, the Amari Jacket.  This was a tad big on me, but I thought it was really cute and the striped sleeves added something unique.  I’m wearing it with the red jeans in the picture and I think it would look much better with dark denim, but you get the idea. So when I was done trying everything on, I asked my mom and A what they thought I should keep.  It was unanimous – EVERYTHING.  The awesome perk with Stitch Fix is that if you keep everything, you get 25% off.  So I kept it all and I’ve already worn three of the five items.  Super impressed with this Stitch Fix!! J", "source": "Westy Side Story"}