{"published": "2015-09-10T14:15:00Z", "media-type": "Blog", "title": "Like magic, Dodgers have turned into thieves on the bases", "id": "3395e874-1711-4507-9c59-f564c136fff9", "content": "Ron Roenicke, magic man? Well, no, but it certainly can’t be mere chance that the Dodgers’ newfound ability to run the bases happens to pretty much coincide with Roenicke’s arrival as their new third base coach.\nNor is it coincidence that it happened as Carl Crawford was coming off the disabled list and speedster Jose Peraza was called up from the minors. Yet there’s no denying the Dodgers have become a more aggressive team on the bases of late. Get news and notes on all the Dodgers matchups Open link In their last 12 games they’ve stolen 20 bases. They’ve been caught stealing once. No other team in baseball has more than 10 steals in that stretch.\nIt took them their 85 previous games to steal 20, and during that stretch they were caught stealing 14 times.\nThat is some kind of turnaround. Certainly the return of Crawford and the addition of Peraza were a major boost, but Justin Turner has three stolen bases in that run. Scott Van Slyke stole a base, Austin Barnes picked one up and so did Corey Seager. Scott Schebler stole two and Jimmy Rollins three. cComments Got something to say? Start the conversation and be the first to comment. Add a comment 0 Suddenly everyone wants in on the act. The Dodgers have gone 9-3 since discovering that they too can steal a base.\nBaserunners on the move mean infielders are too. Gaps are created, infielders are not necessarily in a set position to retrieve a grounder. It just makes for a more aggressive team, one that can actually manufacture runs and not simply rely on a home run to produce offense.\nThe Dodgers’ struggles on the bases had been clear all season, though it came as a surprise that the front office brought in Roenicke on Aug. 17 to take over for Lorenzo Bundy as the third base coach.\nBut Roenicke, the former Brewers manager, had been third base coach for the Angels when they were running wild and capturing their only World Series in 2002. He knows how to direct an aggressive team on the bases.\nAnd right now, unexpectedly, that’s what the Dodgers are.\nCopyright © 2015, Los Angeles Times", "source": "L.A. Times - Lakers Blog"}