{"published": "2015-09-03T02:17:07Z", "media-type": "News", "title": "'This year will be tougher for Dorking'", "id": "2c8507fd-cd8c-4544-87dc-250aa0b2aba5", "content": "READY TO GO: Dorking's Richie Andrews \n     Comments (0)   \nRICHIE ANDREWS says Dorking are looking in good shape as they prepare for their second season in National League Two South. \n\nThe Red & Whites host Cambridge in their opening game of the season on Saturday as they look to build on a fourth-place finish in an impressive debut campaign at step four. \n\nIt could have been even better, with Dorking falling out of play-off contention in the latter stages of last season, with three defeats costing them dearly in the winter months. \n\nBut while Dorking's director of rugby (pictured) says it would be good to push for promotion again this time around, he says he is realistic about the competition from other ambitious clubs at the level. \n \n\"We are looking forward to it and it would be nice to go better than last year, but we know it will be tough,\" he said. \n\n\"We are an amateur team among a division of semi-professional sides at a very good level and we did a good job last season in getting to where we did. \n\n\"It would be disappointing to do worse than last season, but there are several teams like Worthing [Raiders], Old Albanians, Chinnor and Cambridge who are really hoping to be in with a shout at the end of the year.\" \n\nDorking welcome one of the much-fancied sides to the Big Field this weekend, with Andrews expecting a much different Cambridge side to the one they faced in the division last season. \n\n\"Cambridge will be a tough test,\" he said. \"They have been quite vocal about the calibre of players they are recruiting and I am expecting a lot tougher test than last year. \n\n\"It is nice to be starting at home and we are looking forward to getting started.\" \n\nAnd Andrews is happy with how his squad is shaping up for the new campaign, despite picking up a few knocks in pre-season. \n\nDorking have welcomed Benji Marfo, Mofe Wilkey, Harry Elbrow and Matt Betty into the squad over the summer, while Zach Woodcock and Stuart Watkins are set to make the step up to the senior squad this season. \n\nAnd although senior duo Will Crow and Ross Grimstone have departed for pastures new, Andrews is hoping a reasonably settled squad can work to their advantage. \n\n\"Our new players are looking good and have settled in well,\" he said. \n\n\"They are looking comfortable with how we play and the structures in place. \n\n\"We are also still producing homegrown talent and we have options for selection this week, and it is about getting the right combinations. \n\n\"Yes, there are other teams who have gone out and recruited big numbers and experienced players, but I genuinely believe that it will help us in the first few weeks to have a settled squad that knows each other and how they play. \n\n\"We will do our best to go out there and win every Saturday, but there is no pressure on us to get promoted.\"", "source": "Dorking and Leatherhead Advertiser"}