{"published": "2015-09-16T11:09:35Z", "media-type": "News", "title": "Online safety for adults", "id": "c5207037-82b9-4d13-93a9-2487849ca02d", "content": "Making sure our children know how to stay safe online is more important than ever, and luckily there's heaps of information out there for parents on how to best protect them. But it's not only our kids who are at risk. \n\nWhile we can all spot the most common online scams by now (most of us know not to give our bank details to the nice man who wants to share his £3.5bn inheritance) you should make sure you're up to speed on the major dangers. \n\nMeeting people from the internet | Phishing scams | Passwords | Spyware \n\nMeeting people from the internet \n\nPossibly the single greatest thing about the internet is that it allows us to communicate with people anywhere, at any time, from all walks of life, on almost any topic – as Mumsnet Talk proves. For many of us, there comes a point where we want to move the conversation from screen to real life. While this can in many cases be the start of a fantastic friendship, unfortunately, the fact is you can't trust everyone you meet online. As tempting as it may be to take someone's words at face value, it's crucial to remember that you have no way of telling for sure if they're being honest. \n\nIf, for example, the person you're talking to is describing some kind of hardship or loss it's natural to want to help; Mumsnetters regularly offer each other extraordinary support through horrible times. But remind yourself that there's always a possibility the events they're describing aren't the full story. It's not unheard of for posters to deliberately lie about hardship or bereavement. So do, please, ALWAYS report any threads that you think ought to be looked into, whether here or on any other site you're using. You should never feel obliged to give more of your time, attention, or material resources than you can afford - and remember: it's never rude to err on the side of suspicion and be a bit guarded about what you share. \n\nWith all this in mind, we've written up a couple of basic guidelines: \n\nMumsnet's line on staying safe online \n\n\"We do advise all our members to be aware that not everyone on t'internet is who they say they are, and that, although we're awed daily by the astonishing support our members give each other through life's trickier twists and turns, we'd always caution anyone never to give more of themselves to another poster, emotionally or financially, than they can afford to spare.\" \n\nAlways remember that people may not be who they say they are. Although the person you're chatting to may very well be the real deal, it's very difficult to tell if someone is lying - even more so when they're the other side of a keyboard. \n\nGuard your identity and remain anonymous until you feel comfortable. Don't give out your name, phone number, or anything that you wouldn't give to a stranger in the street, until a reasonable level of trust has been established. \n\nIf you're meeting up, the classic rule of meeting in a public place and telling a friend where you're going always applies. \n\nIt goes without saying, never transfer money to someone you don't know - you have no protection if they turn out to be a fraudster. \n\nNone of this is to say there aren't many wonderful people out there who can become friends for life - but it's better to stay on the safe side and be careful than to find out the hard way. \n\nPhishing scams \n\nSometimes, you may receive an email that seems a little unusual, because it demands an action or requests information that you wouldn't normally give. A few examples of the forms that phishing emails can take are: \n\nAn email from a friend on holiday who has been mugged and needs an urgent transfer. \n\nYour PayPal account is expiring, and to reactivate it you need to enter your password. \n\nYour bank needs you to confirm your identity or account details. \n\nIf you get an email like this, your first step should be to check the authenticity of the sender. Investigate the email address: if it's abe4563gdpa234@apple.apple.com, for example, or anything else that looks autogenerated, it's not likely to be legitimate. \n\nSecondly, check the content of the mail. Phishing emails often use phrases such as \"verify your account\" and ask for log in details, or pressure you to act out of panic with statements such as \"if you don't respond within XX hours, your account will close\". Plus, of course, anything that tells you \"you have won\" without your having entered a competition in the first place is very unlikely to be genuine. \n\nPhishing emails may carry links that purport to click through to a relavant site, but these could actually be masked links pointing you to viruses, spyware and other nasties. Before clicking, you can check where a link is taking you by hovering your cursor over the link text. If that doesn't work, right click, copy the link, and paste it into your browser to see if it matches the site address you're expecting. \n\nIf you have any doubts whatsoever about the authenticity of a mail, don't interact with it at all. Instead, visit the website the mail claims to be from by finding the address yourself, or typing it in manually, log in safely, and check to see if your account is really in trouble via those methods. \n\nSpyware \n\nAlong with viruses and phishing mails, the other sneaky internet scam is spyware. Spyware is a programme that is installed on your computer, with or without your knowledge, and then monitors your activity to gather information on you to send to a person or organisation. \n\nMuch like with a virus, this can happen when you download a file by mistake, or interact with a dodgy email. It can also happen when you give permissions to a suspicious programme or download when you're installing it to add toolbars or other 'helpful' add-ons. \n\nSpyware prevents you from knowing how much, if any, of the information you're sharing on the internet is secure – including passwords, bank details and so on. It's crucial to keep an eye on it and be diligent about what you allow to run on your computer. Keep an eye out for .exe files that you didn't expect in particular. \n\nImage: Shutterstock \n\nLast updated: 9 days ago", "source": "MumsNet"}