{"published": "2015-09-03T05:15:00Z", "media-type": "News", "title": "Kris Lees believes more mature Lucia Valentina is ready for big campaign", "id": "1daa6797-0361-4f9e-b82e-b0f26e73e9ed", "content": "Kris Lees is happy with the starting point for Protectionist and Lucia Valentina in the Saturday's Tramway Quality but the star pair's preparation still remain flexible in the Melbourne spring. Kris Lees is happy with the starting point for Protectionist and Lucia Valentina in Saturday's Tramway Quality at Randwick, but the star pair's preparation still remains flexible heading into the Melbourne spring. Melbourne Cup winner Protectionist is heading towards the first Tuesday in November \"whether it is through the Caulfield Cup or Herbert Power [Handicap] has to be decided\" after a couple of runs in Sydney, Lees said.\n\nLucia Valentina could earn her way to the Cox Plate if things go to plan. The mare returns in the same race as last year, where she dominated with an electrifying turn of foot on a wet track in a preparation in which she went on to win the Turnbull Stakes and finished third in the Caulfield Cup.\n\n\"She is probably not going to get the conditions she got last year but she is more mature and I'm very happy she is where she needs to be,\" Lees said. \"It is a tough race but she has shown in the past she can sprint well fresh.\n\n\"There are plenty of options for her in the spring and I think we are going to see a better mare this time, so we are no tying ourselves down. I haven't mapped out a preparation for her yet, but I think she is in for a big preparation the way she is going.\"\n\nThe 1400m of the Tramway is short of the best distance for Protectionist but Lees believes he will have enough fitness to run competitively.\n\n\"We had a little setback with him, so the 1400m will suit him better than the Chelmsford Stakes. This will give him a good blow-out before he starts to step [up] in trip,\" Lees said. \"He is a stayer but I think he will be on their tails on Saturday. We just need to get a grounding for him to get out in journey.\"\n\nThe pair are likely to be Lees' only runners at Randwick as Marple Miss and Oriental Lady will run in the features at Wyong on Friday.\n\nThe blinkers go onto Marple Miss as she drops back in distance, after being placed in town last start, in the Mona Lisa Stakes.\n\n\"We just thought the blinkers would sharpen her up as she steps up to black type. I think she could stretch out to a mile this time but she is still good enough from that draw [of five] to give that race a shake,\" Lees said.\n\nOriental Lady will take advantage of being the limit weight of 54kg in the Wyong Cup, where Lees will also have Slow Pace.\n\n\"She has been able to run good races at that level before so it's worth giving her a chance,\" he said. \"Slow Pace, at his best, would be up to winning the Wyong Cup but he tends to mix his form, so we are hoping he will put his best foot forward.\" The story first appeared on The Sydney Morning Herald.", "source": "Leeton Irrigator"}