{"published": "2015-09-03T05:59:43Z", "media-type": "News", "title": "Devastated: Cannabis operation leaves couple’s investment in tatters | Photos", "id": "a039bae7-d980-4d9c-ad1f-6846ff38fdc3", "content": "Town centre drug lab leaves couple's investment in tatters. \n\nTHE bookstore was supposed to be celebrating its grand opening this month. \n\nThe community had come together and donated what they had so that Collie could once again have a store for the avid reader. \n\nInstead, the Forrest Street building got a hydroponic marijuana make over. \n\nThe brazen set-up in the middle of town was discovered by Collie Police after a tip-off in August. \n\nMore than 50 cannabis plants were discovered and 45-year-old Northam man Brett Scott was charged over the incident. \n\nThe Collie Mail under stands Scott has missed his court appearance and is now wanted by police. It is thought he has fled to NSW after swapping some property for cash. \n\nAs the crime is not an extraditable offence police now have to wait until Scott returns to WA. \n\nThrough tears and broken English building owners Adonna and Frank De Angelis said they had no idea how to move forward. \n\nThe couple were devastated to see their hard work laying in ruin. \n\n“Look what they have done to this place,” Mrs De Angelis said. \n\n“We worked hard to build this place, often working until the early hours of the morning. \n\n“Now someone has destroyed it in a matter of weeks.” \n\nTwo weeks after the police raid, the remnants of the set-up still remain. \n\nHose, aluminium, plant feed and empty pots litter the places where bookshelves should have been. \n\nThe De Angelis family came to Collie 54 years ago and owned the Forrest Street block for 30 years. \n\n“The animals involved need to be locked up,” Mr De Angelis said. \n\n“They have lied and destroyed our little place.” \n\nWhat happens next is unclear as the couple try to sort out insurance and the hefty utility bills left behind. \n\n“Collie people have given us a beautiful life,” Mr De Angelis said. \n\n“But we have never seen anything like this before. \n\n“I don’t know what we’ll do.” The story first appeared on Collie Mail.", "source": "Esperance Express"}