{"published": "2015-09-01T15:16:03Z", "media-type": "News", "title": "WoodWing Software; Scott A. Smith", "id": "f42799bc-3da1-4a93-bd7c-6a0a1f6b873f", "content": "All content published by MediaPost is determined by our editors 100% in the interest of our readers ... independent of advertising, sponsorships or other considerations. \n\nLeave a Comment \n\nSign in to post your comment. Not a member? Join here for free \n\nUsername \n\nPassword \n\nRemember me \n\nM&C Saatchi LA hired Mandy Graham as director of strategic planning and promoted Maria Smith to creative director, up from associate creative director. Graham previously served as planning director for 180 Amsterdam, where she managed the global brand identity campaign for DHL Express and led projects for Opel, SIRE, ASICS, ... \n\nAug. 28, 12:06 p.m. \n\nDevin Reiter rejoined CP+B Boulder as managing director. Reiter will work with existing managing director Danielle Whalen, who has held the position since it was created in 2014. Recent new business wins created the opportunity for an additional managing director. Together, Reiter and Whalen will focus on CP+B's clients, employees, ... \n\nAug. 27, 1:36 p.m. \n\nDavid Duncan joined BBDO MPLS as chief strategy officer. He joins the agency from Smiths Communications in New York, which he helped found and manage. While there, Duncan managed clients including IHOP, Hershey's EGShares, Shaklee and Everlast. His prior experience includes serving as managing partner, Grey Worldwide, global planning director ... \n\nAug. 26, 2:56 p.m. \n\nMoroch Partners hired Yolanda Alarcon Cassity as chief integration officer for McDonald's account. Cassity joins the agency from KFC, where she served as global marketing, chief advertising officer. Prior to that, she worked agency-side at FBC and DIESTE on brands like Taco Bell and Pizza Hut. \"We are thrilled to ... \n\nAug. 25, 2:50 p.m. \n\nCampbell Ewald named Jo Shoesmith as executive creative director of the Los Angeles office. Shoesmith will lead creative for Covered California, Energy Upgrade California and Kaiser Permanente. She will report to Mark Simon, chief creative officer. Prior to Campbell Ewald, Shoesmith was senior vice president, creative director at Leo Burnett ... \n\nAug. 25, noon \n\nSheau-ming Ross was named chief financial officer of Mattersight. \n\nAug. 25, noon \n\nApester named Ran Peled as chief marketing officer. \n\nAug. 25, noon \n\nScripps Networks Interactive promoted Burton Jablin to chief operating officer and Kathleen Finch to chief programming, content & brand officer. \n\nAug. 25, noon \n\nJennifer Catto was named senior vice president of integrated marketing at Evolve Media. \n\nAug. 25, noon \n\nInnovid named Scott Clark as vice president, head of brand partnerships.", "source": "Media Post"}