{"published": "2015-09-29T11:00:01Z", "media-type": "News", "title": "Plant debris decomposition tied to manganese", "id": "5508a972-5fc8-4976-81c7-3b2494d44691", "content": "Lab researchers have shown that manganese plays a strong role in plant debris decomposition in forest ecosystems. \nThe decomposition of plant debris (litter) is a fundamental process that regulates the release of nutrients for plant growth and the formation of soil organic matter in forest ecosystems. \n  \nA strong correlation has previously been observed between litter manganese (Mn) content and decomposition rates across a variety of forest ecosystems . However, the mechanisms underlying Mn's role in litter decomposition were not well understood. Until now. \n\r \nIn a recent article in Proceedings of the National Academy of Sciences ( PNAS ), Livermore Graduate Scholar Marco Keiluweit and LLNL scientist Jennifer Pett-Ridge show that long-term litter decomposition rate in forest ecosystems is tightly coupled to manganese (Mn) redox cycling. (Redox reactions include all chemical reactions in which atoms have their oxidation state changed). \n\r \nThe work has implications to the understanding and prediction of carbon cycling in terrestrial ecosystems . \n\r \nLitter decomposition rates are strongly influenced by climatic factors such as temperature and moisture, but also are linked to litter chemistry. \n\r \nThe team's results suggest that the litter-decomposing machinery in the coniferous forest site they studied depends on the ability of plants and microbes to supply, accumulate and regenerate short-lived Mn species in the litter layer. \n\r \n\"This implies that the bioavailability, mobility and reactivity of Mn in the plant–soil system have a profound impact on litter decomposition rates, and therefore the overall global carbon cycle,\" Pett-Ridge said. \n\r \nOver seven years of litter decomposition, the observed microbial transformation was strongly correlated to variations in Mn oxidation states and concentration. A detailed chemical imaging analysis of the litter revealed that soil fungi incorporate unreactive Mn provided by fresh plant litter to produce and redistribute reactive (oxidizing) Mn species at sites of active litter decay.  Formation of reactive Mn species coincided with the generation of oxidation breakdown products of aromatic organic compounds, providing direct proof of the role of Mn-based oxidizers in the breakdown of litter. \n\r \n\"Incorporating the coupling of litter decomposition and other elemental cycles into conceptual and numerical models may significantly improve our mechanistic understanding and prediction of carbon cycling in terrestrial ecosystems,\" Pett-Ridge said. \n\n  Explore further:  Predators have outsized influence over habitats, research says  \n \n More information: \"Long-term litter decomposition controlled by manganese redox cycling.\" PNAS 2015 112 (38) E5253-E5260; published ahead of print September 8, 2015, DOI: 10.1073/pnas.1508945112  \n\n  \nJournal reference:  Proceedings of the National Academy of Sciences  \n \n Provided by:  Lawrence Livermore National Laboratory", "source": "PhysOrg.com"}