{"published": "2015-09-27T03:44:33Z", "media-type": "Blog", "title": "Student Organizations Encourage Voter Registration", "id": "50b6542e-7a3f-4c6c-ab73-170ba7fd964d", "content": "David Thornton\nCopy Editor With the clock ticking down until Oct. 13, the last day for voter registration, a number of ODU student organizations are making it their goal to register as many student voters as possible. On Nov. 3, Virginia will be holding elections for numerous seats in both houses of the state legislature. On Tuesday, Sept. 22, ODU’s Student Government Association led by example. During their “SGA Day” event, each committee of the student government operated a booth that informed students about their individual roles and missions. The committee for Legislative Affairs and Diversity used theirs to inform students about the upcoming election, test their general knowledge of voting and register students to vote. Rachael Edmonds, director of the committee, quizzed students about elections and voting, handing out t-shirts for correct answers. Monique Williams, another member of the committee, walked students through the process of registering on a laptop. Together, they helped 250 students learn how to register to vote. They used a system known as TurboVote, which not only aids people in registering to vote, but also sends out alerts via text and email reminding voters of upcoming elections. It can also walk voters through the process, informing them what identification to bring, where their polling place is located and helping to obtain absentee ballots. Other organizations use this program as well, including the ODU College Democrats. “It’s a nice program for letting students know about upcoming elections,” Charles Christie, president of the ODU College Democrats, said. This year, they’ve helped register about 150 students to vote. “It’s good for an off-year election,” Christie said. In the recent weeks, they have set up a table in the main lobby of the Webb Center during activity hour. Many ODU students were not old enough to vote in the 2012 presidential election. The voting process is foreign to them. In addition, a great deal of them are unaware that an election is even occurring this year. “Some of them, I’m confused when they don’t know,” Williams said, referring to the number of students who could not answer the general election questions. Some of the questions included naming the date of the next election, or the name of a candidate. One student at the SGA Day event was aware of the Nov. 3 elections, and planned to vote absentee. “We have a small town,” Elizabeth Heath, a sophomore, said, noting that she personally knew some of the local candidates. However, she said that she didn’t know much about the state-level candidates. “The media that most people engage with is national, so not a lot of people know about these smaller Virginia state elections,” Christie said. “What really affects you most are these small decisions in Richmond.” In addition to helping students register to vote, he’s encouraged students to get involved in the campaigns. So far, he’s helped students become volunteers or interns with three different campaigns. The College Democrats are also hosting phone banking events for some of the campaigns before the presidential debates. They provide scripts, and teach students how to campaign for candidates over the phone. “It’s one big democratic call-fest,” Christie said. Another student organization, the National Association of Blacks in Criminal Justice, will be hosting multiple voter registration events in the month of October. The biggest obstacle to encouraging students to vote in off-year elections is the lack of information and general sense of apathy. “If you want a progressive president with a progressive agenda, they can only be as successful as states allow them to be,” Christie said. “The progressive policies can or can’t happen depending on how involved you are in the years leading up to an election.”    ", "source": "Mace & Crown"}