{"published": "2015-09-25T19:48:36Z", "media-type": "News", "title": "The 35 most expensive tasting menus on the planet, ranked", "id": "b36e98d4-eb4e-4821-9f5c-132c6ff59014", "content": "Restaurant de L’hotel de ville \n \nSwitzerland’s Restaurant de l’Hôtel de Ville ranks No. 11 with a  $773 tasting menu. \n    \nOne of the best ways for foodies to truly experience the world’s best restaurants is by ordering a multi-course tasting menu. \n \nBut it’s not for everyone — these carefully crafted and elaborate meals can sometimes cost as much as $1,000 a head. \n \nFrom the experimental Sublimotion restaurant in Spain to the innovative Noma in Denmark, here are 37 restaurants with the priciest tasting menus in the world. \n \nNOTE: We calculated the cost of a meal for two people, and included the price of a wine pairing where applicable. Unless otherwise indicated, the listed cost does not include gratuity or tax. Foreign prices were converted at today’s conversion rates. \n\n  \n   35. Eleven Madison Park, New York, New York (TIE)   \n \n$450 for two; 12-16 courses \n \nDespite the grandeur of Eleven Madison Park , which is set in a dazzling room with white tablecloths and high ceilings, the food here is anything but stuffy. \n \nChef Daniel Humm creates playful and interactive dishes like the “Name That Milk” dessert, which comes in a wooden box with four specially commissioned Mast Brothers chocolate bars. \n \n  \n \n  \n \n  \n \n   35. The Restaurant at Meadowood, St. Helena, California (TIE)   \n \n$450 for two people; 9-10 courses (wine pairing additional $225 per person) \n \nThe Restaurant at Meadowood caters to every guest’s individual preferences so that the tasting menu perfectly suits your palate. \n \nAnd even though the dishes may vary from night to night (or from customer to customer), they are all guaranteed to be presented and cooked by Chef Christopher Kostow and his team with impeccable attention to detail. \n \n  \n \n   35. Quay, Sydney, Australia (TIE)   \n \n$470 for two people; eight to nine courses (wine pairing additional $105 per person) \n \nAustralian Chef Peter Gilmore’s Quay serves a tasting menu that combines classic dishes with new seasonal additions. The meal flows flawlessly from the delicious starters to the guava snow egg — one of Gilmore’s signature desserts. \n \nThe intimate dining room has crisp white linens that only add to the ambience of this serene meal. \n \n   35. Addison at the Grand Del Mar, San Diego, California (TIE)   \n \n$470 for two people; 10 courses   \n \nAddison  has a four-course tasting menu that costs $98 per person, but it’s the $235 10-course tasting menu that’s truly unforgettable.  \n \nThe chef’s tasting includes an array of signature delights — duck with port wine, for example — and the dishes served change depending on the ingredients that are in season.  \n \n   31. La Pergola, Rome, Italy   \n \n$496 for two people; nine courses  (wine pairing addition $157) \n \nLa Pergola  has some gorgeous decor, with an elegant array of candles, trompe l’oeil ceilings, sliding glass walls, and views of Monte Mario.  \n \nChef Heinz Beck’s menu takes Italian food to new heights, with dishes like s ea bass paired with liquorice, tomato, dehydrated olives, and coffee water. \n \n   30. Minibar by José Andrés, Washington, DC (TIE)   \n \n$500 for two people; 25 to 30 courses (wine pairings range from $85-$200 per person) \n \nWith around 30 courses to enjoy, the tasting menu at  José Andrés’s Minibar  takes diners on a culinary journey. \n \nThe courses on the tasting menu aren’t revealed until guests arrive, which keeps an element of surprise to the experience.  \n \n  \n \n   30. O Ya, Boston, Massachusetts (TIE)   \n \n$500 for two; 20 courses (wine or sake pairing an additional $250 per person) \n \nRun by Chef Tim Cushman and wife Nancy, O Ya  offers imaginative combinations like sesame-chicken-skin nigiri with schmaltz powder. \n \nThe small and welcoming space of its original Boston location is a comfortable setting for enjoying the various plates of seafood delicacies.  \n \n   28. Sukiyabashi Jiro, Tokyo, Japan   \n \n$503 for two people (not including tax); 20 sushi courses \n \nThe 87-year-old Jiro Ono is the most famous sushi master in the world. His sushi prix fixe is impeccable, and watching him work behind the counter at Jiro is worth the ¥30,000 price tag alone. \n \nAfter gorging themselves on the freshest sushi courses, like hirame and kuruma-ebi, diners can enjoy melon and tea for dessert. \n \n   27. Noma, Copenhagen, Denmark (TIE)   \n \n$514 for two people; 18 courses (wine pairing additional $165 per person) \n \nNoma serves reinvented Nordic cuisine in surprising ways. For instance, the first appetizer is actually hidden in a table arrangement, and for dessert, toffee is served inside bone marrow. \n \nExecutive Chef René Redzepi is known for using ingredients foraged from the nearby forests and shores, and he keeps guests guessing throughout each of the courses. \n\n \n   27. Schauenstein Schloss Restaurant Hotel, Fürstenau, Switzerland (TIE)   \n \n$514 for two; six courses \n \nChef Andreas Caminada experiments with innovative molecular dishes inside a  historical castle in Fürstenau.    \n \nDiners can sit on a charming outdoor patio as they enjoy dishes like lobster chips with mustard and bite-sized Bloody Mary rolls with goose liver. Don’t be surprised to find iPads incorporated into your dining experience. \n \n  \n \n  \n \n   25. Reflets par Pierre Gagnaire, Dubai, UAE   \n \n$517 for two people (including service and gratuity); seven courses  ( wine pairing additional $106 per person) \n\n \nA carpaccio of wild seabass, ricotta tortellini, and roasted veal chop smoked in hay are just a few of the fabulous offerings to grace the table at Reflets. \n \nAnd it’s not just the food that’s decadent — expect pink damask chairs, Murano glass chandeliers, and mother-of-pearl-adorned walls. \n \n   24. Amber, Hong Kong, China (TIE)   \n \n$564 for two; six courses \n \nAmber  welcomes diners to an elegantly low-lit bar with leather sofas and bronze rods suspended along the ceiling. \n \nFor meat lovers, the Game Menu includes everything from pheasant cooked with sea urchin and caviar to a pie made from succulent duck and mushrooms. There’s also a nine-course tasting menu at $256 per person for those who might want to take it easy on the meat. \n \n   23. Alinea, Chicago, Illinois (TIE)   \n \n$590 for two people; 18 courses \n \nAlinea is a three-Michelin-star restaurant with avant-garde dishes that showcase the molecular gastronomy skills of Chefs  Grant Achatz, Mike Bagale, and Simon Davies. \n \nDiners are constantly surprised by the delicious creations, from a DIY ravioli course to a hot potato that’s been topped with a slice of black truffle and suspended above cold potato soup. Tasting menu prices range from $225 to $295 per person, depending on the time of the booking. \n \n   23. The French Laundry, Yountville, California (TIE)   \n \n$590 for two people (service charge included); nine courses \n \nThe French Laundry , Chef Thomas Keller’s iconic Napa Valley restaurant, is a foodie mecca because of its stunning location, amazing service, and outstanding dishes. \n \nIt’s famous for the salmon cornets, cauliflower panna cotta with caviar , and perfectly presented sorbets, but every dish here is truly a knockout. \n \n   21. Restaurant Frantzén, Stockholm, Sweden   \n \n$598 for two; 14 courses \n \nRestaurant Frantzén offers a multi-course tasting menu that references Asian cuisine in a playful presentation. \n \nDishes include scallops cooked in their own shell, goose egg yolk sabayon, and the signature “satio tempestas” dish, which includes as many as 40 different seasonal vegetables cooked in a variety of ways. \n\n \n  \n \n   20. Kurumazushi, New York, New York   \n \n$600 for two; courses vary \n \nKurumazushi is a traditionally-styled Japanese sushi restaurant run by Chef Toshihiro Uezu. Centered around the sushi bar, visitors sample omakase from one of the earliest destinations in NYC. \n \nThe restaurant opened in the late 1970s and has been serving outstanding Japanese cuisine ever since. \n \n  \n \n  \n \n   19. Dinner by Heston Blumenthal, London, UK   \n \n$611 for two people; eight courses \n \nHeston Blumenthal brought in Executive Chef Ashley Palmer-Watts to oversee Dinner . \n \nAt the chef’s table, guests can watch the team create some of their amazing dishes, such as tea-infused salmon and “meat fruit,” a foie gras and chicken liver mouse stuffed in a mandarin jelly shell that mimics an orange.  \n \n   18. Chef’s Table at Brooklyn Fare, Brooklyn, New York   \n \n$612 for two people; 15+ courses \n \nAt three-Michelin-starred restaurant  Brooklyn Fare , the tasting menu is focused on seafood, with both raw fish and shellfish options. It changes daily to reflect the freshest ingredients of the season and lasts approximately two hours.  \n \nSit back and watch as Chef Cesar Ramirez and his team prepare the elaborate courses right in front of you.  \n \n   17. Per Se, New York, New York   \n \n$620 for two people; ten courses \n \nThe sister restaurant of The French Laundry, Per Se has one of the most exquisite tasting menus in the US. Every course is rave-worthy, the service is flawless, and the menu changes daily based on the freshest ingredients available. \n \nBut it’s Chef Thomas Keller’s butter-poached Nova Scotia lobster that always keep guests coming back for more. \n \n   16. Le Pré Catelan, Paris, France   \n \n$632 for two; seven courses \n \nAt Le Pré Catelan , diners can enjoy immaculate dishes prepared by Chef Frédéric Anton while sitting underneath the chestnut trees that rest on the restaurant’s terrace. \n \nThe seven-course tasting menu includes savory dishes like lobster ravioli, foie gras cream, and an incredibly fresh basil sorbet. The restaurant also offers a five-course tasting menu at $496 per person. \n \n   15. Ithaa Undersea Restaurant, Alifu Dhaalu Atoll, Maldives   \n \n$640 for two; six courses \n \nEnclosed by glass and submerged more than 16 feet in the water, Ithaa Undersea Restaurant  has a six-course tasting menu and a setup that lets diners gaze out at stunning views of the ocean. \n \nThe tasting menu includes everything from lobster carpaccio and reef fish tartare to saffron champagne risotto. There is also a lighter four-course menu that’s offered at lunchtime and costs $195 per person. \n \n   14. Le Louis XV, Monte Carlo, Monaco   \n \n$699 for two people; six courses \n \nOne of several Alain Ducasse establishments, Le Louis XV has resided in Monte Carlo’s Hôtel de Paris for the last 25 years. \n \nIts three-star rating in the Michelin Guide is well-deserved, with decadent Mediterranean dishes like a roasted Pyrenean baby lamb and a rum baba served with rum and whipped cream. \n \n   13. Maison Pic, Drôme, France   \n \n$722 for two; nine courses  \n \nChef Anne-Sophie Pic is one of few female chefs to run a Michelin three-star kitchen.  At Maison Pic , the nine-course Essential Menu includes an array of simplistic modern dishes that range from an herb-infused parmigiano consommé to a beeswax panna cotta wild honey mousse. \n \nWith round tables that offer privacy and large sofas for an intimate experience, diners can enjoy a delectable meal in an inviting setting.  \n \n  \n \n   12. L’Arpège, Paris, France   \n \n$766 for two people; 12 courses \n \nAlain Passard’s  L’Arpège centers most of his courses around vegetables from his garden — and by garden, we mean five acres of farmland. \n \nHis entrées all live up to the three-Michelin-star rating, but it’s the Oeuf à la Coque that’s the signature dish. It’s a lightly cooked egg yolk with crème fraîche, maple syrup, vinegar, and spices. \n \nIt may sound complicated, but some diners will make a special trip to Paris just for this amuse-bouche. \n \n   11. Restaurant de l’Hôtel de Ville, Crissier, Switzerland   \n \n$773 for two; 10 courses \n \nLed by Chef Benoît Violier, this three-starred Michelin restaurant  takes diners through a culinary journey of caviar, mussels marinated in saffron, turbot with crushed star anise, and hearty dishes like roasted rack of lamb with a violet mustard jus. \n \nA selection of fine cheeses offers a light change of palette before diving into dessert — a frozen duo of apricots doused in caramel almonds and hazelnut. \n \n  \n \n   10. Urasawa, Beverly Hills, California   \n \n$790 for two; 30 courses \n \nUrasawa ‘s Michelin-starred chef Hiroyuki Urasawa is known for his outstanding sushi courses prepared in his intimate, 10-seat restaurant. \n \nSome have an inventive blend of ingredients — like shabu shabu with foie gras, lobster, and scallop — but most are simple and rely on the freshest ingredients available. \n \n   9. Saison, San Francisco, California   \n \n$796 for two; 15-20 courses (wine pairing additional $248 per person) \n \nSaison offers a playful and inventive tasting menu, with the dishes changing nightly based on the local ingredients and what’s available from their own garden. \n \nSome sample courses from Chef Joshua Skenes ‘ menu include foie gras toffee, oyster leaf with cream, and thin slices of beef aged for eighty days and complemented with soy vinaigrette. \n \n   8. Alain Ducasse au Plaza Athenee, Paris, France (TIE)   \n \n$856 for two people; five courses \n \nOne of France’s finest restaurants, the food at Alain Ducasse at the Plaza Athénée  is made with  simple yet unforgettable ingredients. \n \nFavorite dishes include a langoustines served cold with caviar and foie gras ravioli. \n \n  \n \n   8. Restaurant Le Meurice Alain Ducasse, Paris, France (TIE)   \n \n$856 for two; six courses \n \nRestaurant Le Meurice Alain Ducasse , run by Chef Alain Ducasse and Executive Chef Christophe Saintagne, serves up grand French cuisine. \n \nSet within luxurious decor that resembles the royal apartments of Versailles, the restaurant offers diners a collection menu that currently includes staples like lobster, vegetables cooked in a salt crust, and farm hen with savory mushrooms. \n \n   6. Joël Robuchon, Las Vegas, Nevada   \n \n$890 for two people;  18 courses \n \nEven the butter will blow away your taste buds at Joël Robuchon . Each dish prepared by Chef Robuchon is richly flavorful, with every ingredient contrasted expertly. \n \nLe Caviar (a trio dish of thin couscous) and Osetra caviar (with smooth cauliflower cream and gelée of green asparagus) are both particular favorites. \n \n   5. Masa, New York, New York   \n \n$900 for two people; 20-25 courses \n \nMasa Takayama is the famed sushi chef behind this New York restaurant , and he delivers some of the highest quality Japanese food America has to offer. \n \nIf you go, try and sit at the bar and watch Masa himself create the dishes, from risotto folded with uni and truffles to slabs of foie gras cooked in a shabu-shabu pot. \n \n   4. Kitcho Arashiyama Honten, Kyoto, Japan   \n \n$905 for two; 12 courses \n \nKitcho is run by Chef Kunio Tokuaka, who serves every dish as a work of art. Plates are served in priceless antique tableware with local and seasonal ingredients, and the restaurant offers beautiful views of the nearby river and sloping hills.  \n \nInside, there are several private tatami rooms with separate gardens for a more intimate experience. \n \n  \n \n   3. Guy Savoy, Paris, France   \n \n$1,1o4 for two people; 18 courses \n \nGuy Savoy runs his eponymous restaurant with the precision, service, and finesse worthy of one of the most expensive tasting menus in the world. \n \nHis 18-course, €490 “Innovations, Inspirations” menu includes an artichoke black truffle soup and lobster served in its shell with cooked heart of palm. \n \n   2. Ultraviolet, Shanghai, China   \n \nStarts from $1,254 for two; 20 courses  (including beverage pairing) \n \nUltraviolet is an experimental restaurant by Chef Paul Pairet, where a four-hour meal is served with accompanying sounds and visuals.  \n \nPairet’s plate of fish and chips emerges as raindrops fall on the walls and music from the Beatles plays in the background.  \n \n  \n \n  \n \n  \n \n   1. Sublimotion, Ibiza, Spain   \n \n$3,377 for two; 20 courses \n \nSublimotion , located at the Hard Rock Hotel in Ibiza, is run by Chef Paco Roncero and includes an extensive three-hour-long tasting menu for 12. \n \nWith around 25 staff members catering to diners, the tasting experience includes everything from DIY cocktails, 360-degree projections, neon dining tables, and dishes that incorporate experimental techniques. \n \n   \nRead more stories on Business Insider , Malaysian edition of the world’s fastest-growing business and technology news website.", "source": "Business Insider Malaysia"}