{"published": "2015-09-25T23:36:24Z", "media-type": "News", "title": "You’re  my father -Student; No, I’m not, please  – Ex -Lawmaker", "id": "da4de5dd-21a2-4f71-9df4-873601c6a89c", "content": ".Row over paternity of 21-year-old boy even after DNA test \n \nBy Demola Akinyemi \n \nILORIN- For  shola Olusola Warah, 21, a student of Federal College of Technology,Akure,these are not the best of times. The absence of a fatherly care over the years,didn’t really mean much to him until recently when he was offered admission to College of Technology Akure,in Ondo state and he started mingling with friends and other course mates. \n \nBoy, Shola Olusola Warah, 21 claims Honourable Sulyman Warah is his father but Mr. Warah says he is not his son. \n \nShola Olusola Warah, a native of Ilorin in Ilorin West local government area of kwara state, in company of his mother Sarah and other members of the family was looking psychologically distraught when they visited Saturday Vanguard office in ilorin last week to narrate their dilemma. \n \nBut Honourable Sulyman Warah,immediate past member of Kwara state house of assembly ,now married to another woman with four girls still denied that Sola is his biological   son even though he admitted that he dated her mother several years ago. \n \nThe pressure being mounted on him at critical moment of his political life,according to him, prompted him to accept to do a DNA test so as to put the case behind him once and for all. Confusion followed when the result did not confirm him as Shola’s father. Hon Sulyman Warah also said he was ready to follow them to carry out another DNA test elsewhere. \n \nShola suspected   a strong foul play that his father had used his political influence against them and therefore   brought a petition over DNA test carried out by one diagnostic centre in Ilorin  which stated that Warah was not his father. During clarification with Saturday Vanguard,with nostalgia, Sola said he could have possibly poisoned himself among other nasty things he thought about if not for the strong faith he had in God which has been keeping him going in life. \n \nAccording to him,”Many times when I’m among my friends in school,and they begin to tell stories of what their fathers did for them I always feel terrible that I don’t have such stories to tell,” he said, his eyes heavy with tears. “Many times I’m frustrated but my faith in God and the knowledge about life  have kept me alive because I have a very strong hope that I will make it in life”.he says. \n \n“At 23, I don’t want anything from him,just for him to accept me as his son. I know that my God that had kept me till now will see me to the top. I want to know my biological father so that I can be psychologically balanced for life. I won’t be an outcast whenever I’m in the midst of people discussing their fathers. For all I know, I did not drop from heaven, I have never heard or read anything like that across the globe. Somebody must have been responsible for the pregnancy that led to my birth.” \n \n•Sola’s mother, Aishat \n \nOn how he knew that, Honourable Warah is his father,he quipped,”Its only a woman that can tell the real father of a child,so when my mother told me about the whole scenario, I believed her” The mother now in tears being consoled by relations who accompanied them recalled her love life with the former member of kwara state House of Assembly some twenty nine years ago which later culminated into the birth of Sola. \n \nIshola’s mother, Afusat is a businesswoman in Ilorin who has also married another man with children.  Madam Afusat told Saturday Vanguard that she had a love relationship with Honourable Sulyman Warah, when she was in Ilorin Grammar School, (IGS), Ilorin, while Alhaji Warah was in a university some 29 years ago. \n \nShe said that Warah’s people and friends knew about their relationship and her pregnancy, adding that later Warah denied responsibility till date, “because of the fear that his parents could stop financing his education”. Recently, when the agitation from the young man becmae unbearable to the mother, Afusat said she met with Warah on the need to have a DNA test conducted to finally resolve the age-long and lingering argument. \n \nThus, they collectively agreed to approach the Diagnostic Centre in Ilorin, where sample was collected and test conducted to decide the matter once and for all.  Interestingly, the result allegedly showed that Warah is not the biological father. However, Shola, his mother and the people from his side smelt a rat and suspected foul play in the manner the test was conducted. \n \nTherefore, the boy, Shola and his people have petitioned the diagnostic centre, and copied the medical and dental council of Nigeria, Abuja, Correspondents Chapel of the NUJ in the state and Legal Aid Council, Kwara state chapter on the alleged unethical practice/breach of agreement of the Centre and its staff. \n \nThe petition reads as follow: This is to bring to the knowledge of the management and the public a case of unethical practice / breach of agreement by the (name withheld) centre, Ilorin. \n \nOn September 3, 2015, myself, my mother and two other witnesses from my end, as a party, my alleged father, Engr. SHEU Sulyman Warah who denied my paternity for 23 years, his new wife and one Mr. Idris as another party were present at the diagnostic centre for DNA test to determine my paternity that has been in dispute. \n \nThe sample of our saliva were taken (myself and Engr. Sulyman Warah) and the doctor on duty immediately sent for a courier service rider to dispatch the specimen to Lagos for a laboratory test and he informed that the result shall be opened in the presence of all the witnesses in a few days time. We all departed in good faith. \n \n“I was called to show up at the centre and all the parties involved, we showed up and my grandfather, Alhaji Ajamajebi who was not initially present showed up but one of my witnesses could not be present. In line with our earlier agreement, I thought the result would be brought in sealed envelope but the doctor merely read from his laptop a mail sent to his e-mail box. \n \n“This negates our earlier agreement, there is a foul play, we left our e-mail behind on the first day, no messages was sent to me. “Thus, I am not convinced that the samples were sent anywhere. “The result was printed on the letterhead paper of the diagnostic centre in our presence. “We politely protested but the doctor on duty simply told us he had a right to do whatever he liked. \n \n“There is a compromise between the doctor and my alleged father. This is fraudulent and unethical of a supposed reputable diagnostic centre. “I therefore want to implore the management of the centre to : Investigate this matter with a view to redeeming the image of the organization. \n \nThe doctor on duty should be questioned because something is definitely wrong. There is a compromise along the line. I hereby demand that another test be done on a neutral ground”, the petition read. But,in his own explanation,Honourable (Engr)Sulyman Warah said he is not the biological father of the young man, adding that he would make himself available at any time for the DNA test at any other place they choose. \n \nHis words: “Let me first commend you for your sense of professionalism. Having heard from the other party, you thought it wise to hear from me as well. To put the record straight, fine I knew this girl some 24 years ago or there about. I was in the university then. Shortly after, I didn’t hear anything from her until about two years later. I was even away. I was not in Ilorin then. She took a kid to my family house. \n \nA two-year old kid. And of course, my parents protested, saying how could they accept that when their son was not even around. Anytime he’s in town they would look for her and that two of us would see eye to eye to straighten things between two of us. And we never saw her again until years later. \n \n“When she came around again, I said it’s ok, let’s go for a test. And that was all. When I was preparing to contest for an election then in 2007, she came briefly. I was not around. She was asked where she had been all along since we’ve agreed to run a test. So, that was it until, I think, early this year. That was the first time I was seeing the son in question. \n \n“We now agreed,thank God we now have a reputable diagnostic centre where we can have that test done. Appointment was fixed, we went there. I paid the fee of N75, 000 for the test. Sincerely speaking, the first time I entered that place was the first time I met the guy that conducted the test. And the second time I was meeting him was when we went for the result. \n \n“We went there and the man asked us salient questions; are we conducting the test for peace of mind or judicial purposes? And the two parties agreed that it was just to clear our conscience. I didn’t know there were different types of tests for different purposes. The test was done and some few days later, I was called by the man that the result was ready. The other party was called too. We attended. \n \n“And the guy opened his e-mail, having made us to realise that they have a partner in the US and that they don’t run the test in their own lab there. He said the specimen would be taken and through courier to their partner in the US. Which was what the guy did. He said that the result would be sent to his e-mail. \n \n“ In our presence, he opened his e-mail and read the result out to us all. I have a copy here. I am not a medical doctor. The result said that the alleged father is not the biological father of the tested child. The conclusion is based on the non-matching of the specimen etc. \n \n“When the aunt of the mother of the boy said she suspected foul play, sincerely speaking, what I said was that, if you are not comfortable with this result, I am available. Let’s go somewhere else and re-do it. If the son is mime, I will accept him. But I can’t take whats not mine. Since then, you have not come back to me to say we should do it somewhere else. \n \n“The next thing I was seeing was social media attack as if there’s something sinister or they were being sent by some political opponents. I have started to think of probably there are some other matters behind all this. Because, if not having given you my words, why all this? They were just cooking up story for people to attract   pity. If they want to go anywhere else, I am ready.", "source": "Vanguard"}