{"published": "2015-09-17T00:00:00Z", "media-type": "News", "title": "How mixologists use technology to create better bars", "id": "70319f91-0507-45c9-8220-5020fb7685bc", "content": "The consumer experience at the bar looks completely different than it did just a few years ago, from tablets that serve as virtual sommeliers to self-serve tap systems. But technology also has changed the experience for those pouring and mixing the drinks behind the bar. Mixologists and bartenders have an ever-growing arsenal of innovative tools that not only benefit guests, but maximize profit, minimize waste and solve other challenges for operators.  \n1. Cost control \nGarnishes and individual ingredients can add up without an operator realizing the extent of the dent on the P&L. When Cameron Bogue began as a beverage consultant with Earls Kitchen + Bar, which operates 65 restaurants in the U.S. and Canada, one of the first things he did was add cocktail recipes to the POS system. “I can track exactly how much citrus, herbs and other ingredients are impacting my costs and red-flag which drinks are the highest,” says Bogue. By tracking ingredient costs by drink, he quickly learned premade fruit purees were a significant expense, even for non-alcoholic drinks. He changed vendors and was able to cut costs by more than 30 percent.  \n2. Waste reduction \nFresh lime juice has the double whammy of being labor intensive and costly, in addition to having a short shelf life. Todd Maul, co-founder and bartender at Boston’s Café ArtScience, spins all the solids out of his fresh-squeezed juices using a centrifuge. “Now my juices last six days, and I’m using 90 percent of the product,” he says. “The lime and lemon juice also has a drier, brighter acid note, and it makes better drinks.” \n\nMaul’s machine has quickly paid for itself. “The cross-pollination of using it in pastry and [elsewhere in] the kitchen is fantastic,” he says. “It gets the staff discussing things outside their comfort zone and enhancing the overall business.” \n3. More effective products \nThe blast freezer at Café ArtScience holds ice at -40 degrees, which keeps drinks cold longer and creates less dilution—benefiting the customer by keeping the drink from getting watered down quickly, Maul says. For some cocktails, he uses ice cubes made from the centrifuge’s leftover citrus solids, cut with rum, vodka or another spirit. “The ice cubes collapse and change the flavor of the drink [as they melt] without diluting it,” he says.  ", "source": "Restaurant Business Magazine"}