{"published": "2015-09-19T19:24:48Z", "media-type": "News", "title": "Harper makes campaign appeal to new Canadians", "id": "50c8d504-c9f6-4773-95c9-d9c3ce1de532", "content": "OTTAWA — The Conservatives are continuing their campaign efforts to shore up electoral support among new Canadians with the announcement of a new award for people who foster links between Canada and their country of origin.\r \n \n\r\n                            Stephen Harper announced in a press release that a re-elected Conservative government would create something called a \"Maple Leaf\" designation, to be awarded to no more than five to seven individuals per year.\r \n \n\r\n                            The release from the prime minister says new Canadians are great ambassadors, while noting that one in five Canadians — some 6.8 million — are foreign born.\r \n \n\r\n                            The announcement Saturday came a couple of hours before Conservative candidate Chris Alexander, acting in his role as minister of citizenship and immigration, was to announce new measures for Syrian refugees at a news conference in Toronto.\r \n \n\r\n                            Harper created something of a social media storm during an election leaders' debate Thursday in Calgary when he referred to \"old stock\" Canadians while defending his government's cuts to refugee health care.\r \n \n\r\n                            New Democrats and Liberals jumped on the comment, alleging it is evidence that Harper is playing divisive, wedge politics.  \r \n \n\r\n                            \"We're lucky to have millions of people who come to Canada to build a new life and also maintain close ties with their birth country,\" Harper said in Saturday's news release.\r \n \n\r\n                            \"In a global economy, we have an opportunity to draw on the connections that new Canadians have to build social, cultural and economic ties to developing economies.\"\r \n \n\r\n                            Harper, NDP Leader Tom Mulcair and Liberal Leader Justin Trudeau are back out on the campaign trail Sunday after a down day Saturday to regroup.\r \n \n\r\n                            The three major parties are locked in a statistical dead heat in public opinion surveys with two more leaders' debates — one in French in Montreal and a second on foreign affairs — scheduled over the next eight days.\r \n \n\r\n                            Canadians go to the polls on Oct. 19.\r \n \n\r\n                            Follow @BCheadle on Twitter\r \n \n\r\n                            By The Canadian Press", "source": "My Kawartha"}