{"published": "2015-09-17T11:00:00Z", "media-type": "News", "title": "Vector Software Launches Webinar Series to Advance Software Test and Certification", "id": "ace067fd-5ceb-47e3-81f6-c515d1011076", "content": "PROVIDENCE, RI -- (Marketwired) -- 09/17/15 -- Vector Software , the world's leading provider of innovative software solutions for robust embedded software quality, announced today its webinar series to help organizations optimize software test and certification. The need for better quality and compliant software has never been greater. Software engineering management and staff will learn tools and techniques necessary for higher quality software that meets regulatory compliance and increases profitability. \n\nEvent One - Five Ways to Turbocharge Your Software Testing \nJoin Vector Software's Sr. Field Application Engineer, Tim Schneider as he discusses ways for faster, better software testing including test automation, change-based testing, testing applications in multiple configurations, massively parallel testing, and analyzing code for problem areas. \n   Wednesday, September 23, 2015 - 11:00 AM and 4:00 PM (EDT) Registration: https://www.vectorcast.com/news/vector-software-webinars/2015/webinar-five-ways-turbocharge-your-software-testing  \n\nEvent Two - How to Achieve Stress-Free Certification \nIn this webinar with Vector's partner CRITICAL Software, certification expert João Esteves will provide technical guidance on regulatory compliance. This webinar is key for organizations faced with regulatory mandates for Avionics DO-178B/C and DO-278; Automotive ISO 26262 and MISRA; Industrial Controls IEC 61508; Medical Devices FDA and IEC 62304; and Railway CENELEC. Esteves will provide insights into the tools and methods needed to effectively comply with these standards. The webinar will look at defining system, high-level, and low-level requirements; using software modeling; characterizing software \"parameters\" to avoid certification rework; and establishing an effective, scalable and compliant-friendly software test infrastructure. \nWednesday, October 21, 2015 - 1:00 PM (EDT) Registration: https://www.vectorcast.com/news/vector-software-webinars/2015/webinar-how-achieve-stress-free-certification  \n\nEvent Three  - How to Get Your Team to Speak the Language of Test for Software Quality \nEngineering management will benefit from this webinar where Vector Software's CTO, John Paliotta will provide thought leadership on the importance of software testing early in the software development life cycle and how organizations can implement a software development process that spreads testing responsibilities across the entire organization and life cycle to improve software quality. Paliotta will also outline how quality requires the mastery of DevOps (continuous integration, testing, and release), and while software testing has traditionally been viewed as an \"expense,\" done right, tests become an asset that pays dividends for years while improving customer satisfaction and brand value. \nThursday, November 12, 2015 - 11:00 AM and 4:00 PM (EST) Registration: https://www.vectorcast.com/news/vector-software-webinars/2015/webinar-how-get-your-team-speak-language-test-software-quality  \n\nAbout Vector Software, Inc. \nVector Software is the world's leading provider of software testing solutions for safety and business critical embedded applications. Companies worldwide in the automotive, aerospace, medical devices, industrial controls, rail, and other business critical sectors rely on Vector Software's VectorCAST test solution. The VectorCAST environment enables software development teams to easily automate complex testing tasks to improve software quality, using Test-Driven Development, Continuous Integration, and Change Based Testing processes to engineer reliable software for accelerated time-to-market release cycles. Vector Software is headquartered in East Greenwich, Rhode Island USA with offices worldwide, and a world-class team of support and technology partners. To learn more, visit: www.vectorcast.com . Follow Vector Software on Facebook , Google+ , LinkedIn , Twitter , and YouTube . \n\nContact: \nAnna Barcelos \nVector Software, Inc. \n401.398.7185 \nEmail Contact \n\n1351 South County Trail, Suite 310 \nEast Greenwich, RI 02818 USA \nwww.vectorcast.com", "source": "Good Day Sacramento"}