{"published": "2015-09-29T13:15:27Z", "media-type": "News", "title": "Regis Corporation's Clip for the Cure - Saturday, October 17, 2015", "id": "57f9bf37-b9b5-4652-ac35-e7e45a9376ad", "content": "As part of their effort to help raise money and awareness for breast cancer research, Regis Corporation's (NYSE:RGS) 47,000+ stylists who work at the company's salon brands are joining forces for the annual Clip for the Cure haircutting event on Saturday, October 17, 2015. \n\nhttp://photos.prnewswire.com/prnvar/20130912/CG78396LOGO \n\n\"Clip for the Cure is an important event for our stylists, staff and guests,\" said Regis Corp. President and CEO Dan Hanrahan. \"Too many of our family and friends have been touched by this disease, and for our company, this campaign is a meaningful opportunity to come together and raise money to find a cure for breast cancer.\" \n\nEvery year, stylists at nearly 7,000 participating Regis salons host Clip for the Cure during October, which is Breast Cancer Awareness month. Guests from around the country will visit their favorite Regis salon brand on Saturday, October 17 and get a haircut. The company donates 10% of proceeds from each haircut to the Regis Foundation for Breast Cancer Research. The foundation supports regional and national organizations that focus on early diagnosis, prevention, treatment and finding a cure for breast cancer. \n\nParticipating Regis salons also offer other opportunities to take part. Throughout September and October, guests can purchase pink breast cancer awareness products including brushes and hair extensions. In addition, guests and businesses may also make cash donations to the Foundation. \n\nTo date, Regis stylists and guests have raised more than $11 million for the Regis Foundation for Breast Cancer Research. The foundation funds breast cancer research projects at nationally recognized centers, including Mayo Clinic and the Masonic Cancer Institute, University of Minnesota. The foundation also supports institutions throughout the country that assist and treat patients with breast cancer. For more information or to find participating salons, visit ClipForTheCure.org. \n\nThis year, the following Regis Corp. salon brands are participating in the annual campaign. \n\nPlease call your local salon for more details. \n\nThe Regis Foundation for Breast Cancer ResearchThe Regis Foundation for Breast Cancer Research funds groundbreaking research at nationally recognized centers. The focus of this research is on prevention, early diagnosis, treatment and finding a cure. In addition, the Foundation supports institutions that assist and treat patients with breast cancer. Since it was founded in 1994, the Foundation has raised over $11 million. More information is available at ClipForTheCure.org and Facebook.com/ClipForTheCure. \n\nAbout Regis CorporationRegis Corporation (NYSE:RGS) is the leader in beauty salons and cosmetology education. As of June 30, 2015, the Company owned, franchised or held ownership interests in 9,556 worldwide locations. Regis' corporate and franchised locations operate under concepts such as Supercuts, SmartStyle, MasterCuts, Regis Salons, Sassoon Salon, Cost Cutters and First Choice Haircutters. Regis maintains ownership interests in Empire Education Group in the U.S. and the MY Style concepts in Japan. For additional information about the Company, including a reconciliation of certain non-GAAP financial information and certain supplemental financial information, please visit the Investor Information section of the corporate website www.RegisCorp.com. \n\nhttp://photos.prnewswire.com/prnvar/20140303/LA74567LOGO \n\nLogo - http://photos.prnewswire.com/prnh/20130912/CG78396LOGO \n\nPhoto - http://photos.prnewswire.com/prnh/20140303/LA74567LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/regis-corporations-clip-for-the-cure--saturday-october-17-2015-300150057.html \n\nSOURCE Regis Corporation \n\nhttp://rt.prnewswire.com/rt.gif?NewsItemId=CG13243&Transmission_Id=201509290907PR_NEWS_USPR_____CG13243&DateId=2015", "source": "Individual.com"}