{"published": "2015-09-02T18:47:23Z", "media-type": "News", "title": "Ways to Welcome a Shelter Dog", "id": "236201a0-9c67-443c-8ac4-d98847d322ab", "content": "MISSION, Kan., Sept. 2, 2015 /PRNewswire/ -- (Family Features) Animal shelters are full of lovable dogs of all breeds, sizes and ages deserving of a good home and ready to become your next four-legged family member. In fact, according to the American Society for the Prevention of Cruelty to Animals, nearly 2 million dogs are adopted into new families each year. \n\nPhoto - http://photos.prnewswire.com/prnh/20150902/263209 \n\nHowever, choosing the right dog is just the beginning. The first weeks after bringing home an adopted pet are critical. It's a time to get to know one another and build a lifelong connection. Here are some steps to help ease the transition: \n\nCreate a pet-friendly environment. Keep items that are unsafe, such as chemicals and certain house plants, out of reach. Cords and objects that invite chewing also should be tucked away. If certain areas will be off limits, use baby gates to block them. \n\nExpect accidents. While house training a puppy is to be expected, you may find that an older dog needs help in this area as well. The stress of transitioning into a new household can lead to accidents, so keep this in mind and be sure to provide your new pet with lots of potty breaks, patience and instruction. \n\nStart with smart nutrition. Providing your new dog with a high-quality diet from the beginning can contribute to a lifetime of whole body health. Chose a complete, balanced food with real meat as the No. 1 ingredient, such as Purina ONE SmartBlend, so that you can be confident you're giving them the best nutrition available. \n\nIntroduce a schedule. Providing dogs with a consistent routine right off the bat can help ease their stress during the transition. Set a schedule for walks, feeding time and training so he can settle into a routine that feels a bit more familiar. \n\nApproach training with patience. Without knowing how your pet was trained, it can be difficult to predict how he will respond in his new environment. For example, he may be used to receiving treats for good behavior, while you prefer to reward with praise. Plan to be flexible, and soon you'll come to a shared understanding. \n\nEmmy-nominated actor Jesse Tyler Ferguson recently began putting these tips into practice after adopting his new dog, Fennel. The television star partnered with Purina ONE to promote its ONE Difference campaign, which celebrates those making a positive difference in the life of shelter dogs, and he ended up finding a forever friend in the process. The 8-month-old Cockapoo mix joins Ferguson's 3-year-old Maltese-Yorkie mix, Leaf. The pair are currently taking the Purina ONE 28 Day Challenge, and encouraging others to do the same. \n\nLearn more, and find out why more than 90,000 dog owners have decided to switch to Purina ONE, by visiting www.PurinaONE/MakeONEDifference. \n\nVickie Rocco \n\n1-888-824-3337 \n\nAbout Family Features Editorial Syndicate \n\nThis and other food and lifestyle content can be found at http://www.editors.familyfeatures.com. Family Features is a leading provider of free food and lifestyle content for use in print and online publications. Register with no obligation to access a variety of formatted and unformatted features, accompanying photos, and automatically updating Web content solutions. \n\n  \n\n  \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/ways-to-welcome-a-shelter-dog-300137066.html \n\nSOURCE Family Features Editorial Syndicate", "source": "Ulitzer"}