{"published": "2015-09-06T03:59:10Z", "media-type": "News", "title": "Global markets on tenterhooks awaiting China data", "id": "da98c14f-4ce8-478c-86dc-f70c6a4e0dd7", "content": "The government is scheduled to release monthly trade and inflation figures. \n\nSHANGHAI (AFP) - Global stock markets will be on edge this coming week as China announces a slew of data investors will comb for clues about slowing growth in the world s second-largest economy. \n\nThe government is scheduled to release monthly trade and inflation figures, as well as industrial output, fixed-asset investment and retail sales in the coming days. \n\nAn official Chinese manufacturing survey last week sent world markets into a tailspin, as investors gave vent to worries China s economy is headed for a \"hard landing\". \n\nAlthough analysts cautioned not to read too much into the monthly release of the Purchasing Managers  Index (PMI), Chinese growth is clearly slowing and more weak data could be an excuse to sell. \n\n\"There is a risk (of overreaction) because investors  confidence level is at a very fragile stage. Any data that s not on the good side, investors will react more than they should,\" Jackson Wong, associate director at Simsen International Financial Group in Hong Kong, told AFP. \n\nChina s economy expanded 7.0 percent in each of the first two quarters, slowing from 7.4 percent growth last year, which was its weakest since 1990. \n\nBut investors were alarmed by authorities  surprise lowering of the yuan currency s central rate against the US dollar by nearly five percent in a single week last month. \n\nIn a bid for more sustainable growth, Chinese policymakers are seeking a tectonic shift to domestic consumption and away from state-led investment. \n\n\"Pessimism over China s short-term outlook is overdone and a growth pick-up in the second half is already in the pipeline,\" ratings agency Fitch said in a report Friday. \n\n\"But expectations for the economy s growth potential in the medium term are shifting lower as the scale of the restructuring challenge becomes clearer.\" \n\nANZ Banking Group forecasts China s gross domestic product (GDP) growth will slump to an annual 6.4 percent in the third quarter, before rebounding to 6.8 percent in the October to December period -- but still below the government s full-year goal of around 7.0 percent. \n\n\"Further aggressive monetary easing and proactive fiscal policy, along with financial liberalisation, are needed to maintain GDP growth\" at the official target, it said in a research report. \n\nMarket bottom \n\nChina last month reduced interest rates and cut the amount of money banks must hold in reserve to try to bolster its economy and end the country s worst stock market rout in almost two decades. \n\nJapanese bank Nomura is forecasting \"weak\" trade data for August with exports falling 7.0 percent year-on-year and imports dropping 10 percent. Consumer price inflation could tick up to 1.8 percent for the month on higher pork prices, though the threat of deflation remains, it said. \n\nBut many analysts expect China to avert a hard landing, even though economic growth will definitely slow this year. \n\n\"China s economy has certainly been weak this year and still faces further downward pressures, but we think fears of an economic hard landing due to stock market gyrations are exaggerated,\" UBS economists Donna Kwok and Wang Tao said in a research report. \n\n\"While it is difficult to confirm whether GDP growth was really close to 7 percent as reported, it has certainly not grounded to a halt. Neither is it in the process of falling apart as widely proclaimed by some China bears.\" \n\nEven so, China s stock market, which was down nearly 40 percent from its recent peak by Wednesday -- the last day of trading before a holiday for Japan s defeat in World War II -- could fall further in the coming week. \n\nAfter a debt-fuelled rally that sent the market up 150 percent in a year, shares have room to go lower. \n\n\"The (Chinese) market is likely to fall after it opens on Monday to release accumulated risks during the holiday,\" Phillip Securities analyst Chen Xingyu told AFP. \n\n\"The market still has risks because there is an argument on where the market bottom is.\"", "source": "Dunya News"}