{"published": "2015-09-11T18:00:38Z", "media-type": "Blog", "title": "Our Stay at the Denver Grand Hyatt Hotel", "id": "47a2fb5b-9dc7-4c92-9176-2a7e10fad84c", "content": "0 Flares\rFilament.io\r0 Flares\r×\rI met my husband and daughters in Denver after the D23 Expo as were were headed to Vail for vacation. We wanted to stay over for a couple of nights to see Denver, so we booked a night at a hotel that had a shuttle from the airport. The shuttle was free, and ran until midnight. My flight was due in at 11:45, and as typical for that kind of situation, I was delayed. $50 later, I met my family at a hotel that was adequate, but not memorable. The next day we checked into Denver’s Grand Hyatt. I later found out you can book a shuttle for $25 that will take you downtown. Sometimes a free shuttle seems like a bargain, but I sure wish we had been able to spend two nights at this fabulous hotel. If you are looking for a hotel in Denver, this is the one! It was gorgeous and centrally located so you have access to all the city has to offer. Our room was beautiful and so comfortable. If you’ve stayed at a Hyatt, I don’t have to tell you how much we love the Grand Bed Hyatt is famous for! The contemporary design is gorgeous with deluxe amenities like a safe that’s big enough for your laptop, a 42-inch flatscreen TV, a lovely bathroom with a Rain shower head and upscale bath products, plus free internet, which is always a big bonus for me. We also had large closet with robes, which I always appreciate. My husband took over the desk. It’s great when you aren’t tripping over each other! Some rooms just don’t give you enough space. The Hyatt does a great job of designing rooms so you can spread out. Including the Grand Club access is also totally worth it, in my opinion. We enjoyed the fabulous complimentary drinks and hors d’oeuovres before we went out to dinner, and came back for decaf and dessert before turning in for the night. The next morning, breakfast was outstanding. Not your typical continental breakfast, but cheeses and meats, lox, breads and muffins, eggs and all the fixings for breakfast burritos. Coffee, a huge assortment of juices, chocolate milk, and other drinks were available as well. The room is large and bright with a perfect view of the city, and there were a couple of TVs as well as the Wall Street Journal and other papers to catch up on the news. You also have access to the Grand Club suite during the day to grab cold bottles of water and other drinks or a piece of fruit. Though we didn’t eat at the hotel, we did have a glass of wine before we headed out for the evening. and the wine collection is pretty outstanding. I hope we get a chance to visit again. There will be no question about where we’ll be staying. Visit the Grant Hyatt website to book your room when visiting Denver.   Please like & share:\n0 Flares\rTwitter\r0\rFacebook\r0\rGoogle+\r0\rStumbleUpon\r0\rPin It Share\r0\rReddit\r0\rFilament.io\r0 Flares\r×", "source": "Virtually Yours"}