{"published": "2015-09-30T04:38:15Z", "media-type": "News", "title": "The Intern: chivalry, suits and the work-life balance", "id": "abe7b395-83e9-4f23-b5d7-b0d06ac1865b", "content": "The Intern, starring Anne Hathaway and Robert De Niro, might look like a comedy about age, youth and work but it feels more like a hymn to chivalry and the good-quality attache case. \n\nFull movies coverage\n\nMovie screening times\n\nTHE INTERN M ★★☆\n\nGeneral release 121 minutes\n\nThese days, you could be forgiven for wondering if the pairing of Anne Hathaway​ and Robert De Niro​ is another example of the Hollywood idea of an appropriate relationship gap. But The Intern isn't taking us there. It's not a romantic comedy – it's a romance of another kind, an ode to a certain type of masculinity and its redemptive powers.\n\nThe Intern is written and directed by Nancy Meyers (It's Complicated, Something's Gotta Give) - a writer turned writer-director with a strong commercial track record and a focus on female central characters. Hathaway plays Jules Ostin, a driven young internet entrepreneur; De Niro is Ben Whittaker, a widowed retiree who finds himself at something of a loss. The company has a mature-age intern program, and Ben is taken on. Jules isn't particularly keen on the intern idea, but Ben, a low-key, genial, quietly determined figure, flourishes in his new role. He also becomes her booster, playing a supportive role in her working life and her private life.\n\nThe Intern is a double portrait of life and work. Jules still likes to be involved in every aspect of her company's operations, but its rapid growth is putting all kinds of pressure on her in the office and at home. For Ben, work is still part of his identity, and the internship offers him a fresh start. He brings the old ways – mostly surface details, such as suit, tie, attache case – to the job, and many of the other employees respond to them and are charmed by him. But he's also prepared to embrace the new – which in this context, means little more than going on Facebook.\n\nThis pairing has potential: Hathaway's brittle quality works quite well here, and De Niro (not the obvious choice to play a gentlemanly ideal) seems utterly at ease in the role of a digital convert and besuited champion of women's rights. If there had been more to and fro, more tension, more at stake between the pair of them, this would be have been a much more interesting movie. But there's something skewed about their situation, about the predictable way the needy Jules learns work-life balance through Ben's helpful, low-key interventions. Jules speaks wistfully at one point of Jack Nicholson and Harrison Ford as examples of the way men used to be, but it's hard to know what qualities they (or the characters they embody) would bring to this situation.The Intern might seem to be a film about working women and their discontents, or what experience can teach enthusiasm, but it feels more like a hymn to old-school chivalry and good-quality attache cases. The story first appeared on The Sydney Morning Herald.", "source": "Barossa & Light Herald"}