{"published": "2015-09-17T07:26:51Z", "media-type": "News", "title": "$1.2 Million Jackpot Hit on Scientific Games' Shuffle Master Let It Ride Table Game at Mohegan Sun", "id": "c3d06b1e-826a-42fc-8c0d-55e99f83ce97", "content": "09/15/2015 10:00 AM ET \n\n09/14/2015 10:22 AM ET \n\n09/14/2015 10:00 AM ET \n\nLas Vegas - Scientific Games Corporation (\"Scientific Games\" or \"the Company\") today announced that a lucky player at Mohegan Sun in Uncasville, Connecticut, won $1,248,644 while playing the Shuffle Master Let It Ride proprietary table game on Saturday, Aug. 22. \n\nThe huge table game win was made possible by the Company's Shuffle Master Game Manager 2 software that tracks progressive jackpots at 148 tables across Mohegan Sun's casinos: Casino of the Earth, Casino of the Sky, and Casino of the Wind. Game Manager 2 enables multi-level jackpots and multiple fully configurable reserve pools, and allows players to compete for multiple real-time incrementing meters with just one wager. \n\nThe winner chose to remain anonymous. \n\n\"This is certainly one of the largest jackpots ever hit on a table game,\" said Roger Snow, Senior Vice President of Tables and Shufflers at Scientific Games. \"Jackpots of this size are truly life-altering, adding dramatic new levels of excitement in the table games pit. We congratulate this winner and Mohegan Sun on the amazing win. We're proud our games and casino systems could help make this happen.\" \n\nAbout Scientific Games \n\nScientific Games Corporation (NASDAQ: SGMS) is a leading developer of technology-based products and services and associated content for worldwide gaming, lottery and interactive markets. The Company's portfolio includes gaming machines, game content and systems; table games products and shufflers; instant and draw-based lottery games; server-based lottery and gaming systems; sports betting technology; loyalty and rewards programs; and interactive content and services. For more information, please visit http://www.scientificgames.com. \n\nTrademarks are owned in the US or elsewhere by, or under license to or from, Scientific Games Corporation or one or more of its directly or indirectly owned companies. 2015 Scientific Games. All Rights Reserved. \n\nCompany Contacts \n\nInvestor Relations: \n\nScientific Games: Bill Pfund 1-702-532-7663 \n\nVice President, Investor Relations \n\nMedia Relations: \n\nScientific Games: Mollie Cole +1 773-961-1194 \n\nDirector, Corporate Communications \n\nScientific Games: Mike Trask +1 702-532-7451 \n\nSenior Manager, Gaming Marketing \n\nForward-Looking Statements \n\nIn this press release, Scientific Games makes \"forward-looking statements\" within the meaning of the U.S. Private Securities Litigation Reform Act of 1995. Forward-looking statements describe future expectations, plans, results or strategies and can often be identified by the use of terminology such as \"may,\" \"will,\" \"estimate,\" \"intend,\" \"plan,\" \"continue,\" \"believe,\" \"expect,\" \"anticipate,\" \"target,\" \"should,\" \"could,\" \"potential,\" \"opportunity,\" \"goal,\" or similar terminology. These statements are based upon management's current expectations, assumptions and estimates and are not guarantees of timing, future results or performance. Actual results may differ materially from those contemplated in these statements due to a variety of risks and uncertainties and other factors, including, among other things: competition; U.S. and international economic and industry conditions, including declines in or slow growth of lottery retail sales or gross gaming revenues, reductions in or constraints on capital spending by gaming or lottery operators and bankruptcies of, or credit risk relating to, customers; limited growth from new gaming jurisdictions, slow addition of casinos in existing jurisdictions and declines in the replacement cycle of existing gaming machines; ownership changes and consolidation in the casino indus", "source": "Bloomberg"}