{"published": "2015-09-12T12:45:56Z", "media-type": "News", "title": "Govt to complete e-commerce roadmap by end of month", "id": "c7b5ae95-135d-4e28-ba95-7a4451ced01b", "content": "roadmap by end of month \n\nBusiness News \n\nIn order to support the country’s burgeoning e-commerce industry, the government is expected to complete its e-commerce roadmap by the end of this month, a top official has said. \n\nCommunications and Information Minister Rudiantara said that the roadmap, which had been developed since February, was so far 95 percent complete. \n\n“About 20 initiatives will be included in the roadmap. It’s more of a guiding set of ideas rather than a list of details, but factors such as investment, tax and accreditation will be included,” he told reporters at his office on Friday. \n\nRudiantara argued that shoring up a solid roadmap was crucial to unleashing the potential of the rapidly growing sector \n\nIndonesian e-commerce transactions reached US$12 billion at the end of 2014, a significant surge from the $8 billion listed in 2013. Some venture capitalists have said that e-commerce start-ups top their list of desired investments for this year. The Indonesian E-Commerce Association (idEA) expects the market to be worth Rp 295 trillion ($24.6 billion) by 2016. \n\nThe government planned to unveil the roadmap last month, but the plan seemed to be hampered by complexity arising from discussions regarding taxation and funding issues. The roadmap involves eight ministries, namely the Ministry of Communication and Information, the Ministry of Trade, the Ministry of Finance, the Ministry of Transportation, the Investment Coordinating Board and the Creative Economy Agency. \n\nRudiantara was reported by local media as saying that imposing a tax of 10 percent on e-commerce transactions would be too burdensome for e-commerce startups. He also admitted that regulating taxes on e-commerce would be more complicated than regulating offline businesses. \n\nReferring to the funding issue, Rudiantara said that e-commerce should be taken off the country’s negative investment list in order to provide wider funding sources for start-ups willing to expand their businesses. \n\nAccording to Rudiantara, foreign investment in e-commerce was still necessary amid the limited domestic investment available for the sector at the moment. \n\nUnder Presidential Decree No. 39/2014, the government included e-commerce among the industries closed to foreign investment, requiring e-commerce businesses to be wholly owned by local players. \n\nRudiantara argued that Indonesian e-commerce currently lacked sufficient infrastructure for online transactions. \n\n“Around 70 percent of online payments are made through ATMs and then the parties show the receipts to each other through instant messaging. With this roadmap, we can figure out how to develop the infrastructure to help that become easier,” the minister said on Friday. \n\nRudiantara added that his ministry also planned to establish an accreditation institution to help set benchmarks for local e-commerce startups. \n\nSeparately, Alexander Rusli, the CEO of publicly listed telecommunications firm Indosat, said that he was optimistic about the sustainable development of e-commerce in Indonesia. \n\n“The journey toward a solid national e-commerce platform is a long one. Even Silicon Valley took years and years from the 1960s to become what it is today. It’s a complex road filled with multiple setbacks, but with the burgeoning rise in e-commerce startups in Indonesia, I think we are ready to take that journey,” Alexander said. \n\n------------------------- \n\nTo receive comprehensive and earlier access to The Jakarta Post print edition, please subscribe to our epaper through iOS' iTunes, Android's Google Play, Blackberry World or Microsoft's Windows Store. Subscription includes free daily editions of The Nation, The Star Malaysia, the Philippine Daily Inquirer and Asia News. \n\nFor print subscription, please contact our call center at (+6221) 5360014 or [email pr", "source": "Jakarta Post"}