{"published": "2015-09-01T00:19:34Z", "media-type": "News", "title": "State govt. nod for setting up K-GIS", "id": "c8529adf-e62f-4e45-a430-effc2280ea91", "content": "Comment  ·  print ·  T  T \n\nT+·  T- \n\nThe estimated cost of the project is Rs. 149.59 crore \n\nThe State government has given its nod to set up a Karnataka Geographic Information System (K-GIS) to ensure better planning, development, and governance and citizens’ empowerment. \n\nOfficial sources told The Hindu that although the Union government had given permission to provide 50 per cent of the cost, the State government decided to go ahead with the setting up of the system at a cost of Rs. 149.59 crore using its own funds. \n\nKarnataka was one of the five States identified by the Union Ministry of Science and Technology to develop a national geographic information system. However, as the proposal was still in the examination stage, the State government decided to set it up with its own funds. Sources said that the funds provided by the Union government later would be adjusted to the annual maintenance cost and operation cost. \n\nThe State government would meet the recurring expenditure of Rs. 33.24 crore every year from 2018-19 by the time the K-GIS would be operational. \n\nThe sources said that the K-GIS would be implemented by the Karnataka State Remote Sensing Application Centre in association with the Karnataka State Council for Science and Technology and Karnataka State Natural Disaster Monitoring Centre. A Karnataka GIS Council would be set up under the chairmanship of a renowned GIS expert to guide its functioning, define procedures, and suggest a detailed plan of activities. \n\nSome of the benefits of the K-GIS included creation of a common State-wide authoritative GIS –a platform of constantly updated, standardised and seamless GIS data of 53+ layers of map data; latest satellite images and geo-linked departmental data sets that could be used by everybody; enabling of GIS applications’ decision support modules of governance for all departments as per their requirements and also for citizen GI services; and enhancing of the efficiency of governance, decision making, and planning and development on the Karnataka GIS applications engine. \n\nAssets of the entire State would be readily available and accessible as a collection of standardised, inter-operable, seamless and regularly maintained GIS datasets. \n\nThis would also push Karnataka to a leading position as far as nation-wide GIS is concerned and enable it to play a larger role in the critical technology arena in the country. It would also accelerate the development of a number of private sector GIS solutions and help align these to the State’s development, the sources added. \n\nIt is to ensure better planning, development, and governance and citizens’ empowerment \n\nThe Union government will bear 50 per cent \n\nof the c", "source": "The Hindu"}