{"published": "2015-09-11T01:03:59Z", "media-type": "News", "title": "Phillies elect not to extend Amaro's contract 9/10/2015 8:06 PM ET", "id": "28494e14-ad37-4f70-9705-23de1bde7791", "content": "Amaro left Citizens Bank Park a short time later. Assistant general manager Scott Proefrock will be interim general manager until Amaro's replacement is hired. \n \n\"I didn't think this one was going to be as hard as it turned out to be,\" MacPhail said. \"I've read everything I could read. I've listened to try to help me understand as much as I could about the past, and I've learned as much as I think I could over a two-month period about an organization and those changes that have impacted the game over the last few years, all with the intent of finding a way to return the Phillies to consistent contenders, a place they enjoyed in the not-too-distant past. Unfortunately to accomplish that goal, the conclusion that I reached was that we needed a fresh perspective in the baseball operations department, a fresh approach.\" \n \nHagen: Phils' foundation gives GM successor leg up \n \nMacPhail said he made up his mind to remove Amaro two or three days ago. After informing Amaro and then meeting with the baseball operations staff, MacPhail and Phillies owner John Middleton answered questions about the decision during a news conference. \n \n\"You look at any business, the decisions made are made not exclusively by one person in isolation, but from everybody else in the organization,\" said Middleton, who revealed the conversation about Amaro's fate began in December or January, when ownership interviewed MacPhail for the job. \"But that doesn't mean in well-run and successful companies there isn't accountability. So even though people are making decisions in groups, there is still a person who is primarily responsible for that decision and has to be held accountable. So I think we recognize that we had a problem and we're trying as fast as we can to get out of that problem and get back to winning.\" \n Amaro's legacy in Philly \nMLB Central discusses Amaro's legacy in Philly \n\nMLB Central discusses the Phillies' decision to not extend the contract of Ruben Amaro Jr., ending his time as the team's general manager \n\nMacPhail said it would be ideal, but ambitious to hire a GM before the team's organizational meetings at the end of next month. He said he had not contacted any potential candidates, although he certainly has been thinking of them. \n \nHe should have no shortage of interest. The Phillies are a team willing to spend money, and MLBPipeline.com ranked their farm system as the seventh-best in baseball, which means talent is percolating to the big leagues. \n \nAmaro played a role in resurrecting the once-barren farm system with a slew of trades in the past nine months, deals Amaro finally got permission to make once Gillick issued the order to rebuild in August 2014. But before that, the Phillies fell from a franchise-record 102 victories in 2011 to a team on pace for the worst record in baseball, despite one of the highest payrolls. \n \nAmaro could not escape that. \n \nFans' sentiment turned against him as the team continued to lose. He also made comments regarding the fan base and iconic players like Chase Utley and Ryan Howard , which Middleton said ownership noticed. \n \n\"We were certainly aware of the fans' feelings,\" Middleton said. \n Duquette on Phillies' GM move \nDuquette on Phillies' decision to replace Amaro \n\nMLB.com analyst Jim Duquette discusses the Phillies' decision not to extend the contract of Senior VP and general manager Ruben Amaro Jr. \n\nSo who is the ideal candidate to replace Amaro? \n \n\"He needs to hire himself,\" Middleton said of MacPhail. \"And I say that because, 30 years ago, a very young Andy MacPhail was general manager, a newly minted general manager [with the Twins]. This guy was sitting in an office in Minneapolis and he was playing with mathematical, statistical, analytical tools. And he was using them to try to figure out how he could make better evaluations, therefore, better personnel decisions.\" \n \nMackanin, Phils' operations staff likely to return \n \n\"I intend to look at a wide spectrum of candidates,\" MacPhail added. \"I would think it would be a mistake if we pigeonhole ourselves into saying, 'We're going to go for young analytics,' or 'We're going to go for an experienced baseball guy.' I see that out there with other clubs. Why would you restrict your ability to talk to whoever you want? I think you have a responsibility. Like I said two months ago, let's look at everything. And it's the same philosophy here. Let's look at a wide spectrum of candidates. You might be surprised.\" \n Zolecki on Amaro's dismissal \nZolecki on Phillies' decision to search for new GM \n\nMLB.com Phillies reporter Todd Zolecki discusses the club not extending the contract of general manager Ruben Amaro Jr. \n\nBut once a new GM is hired how will it work? The Phillies hired MacPhail to mostly work with the baseball operations staff. He will make the final decisions on major matters, although ownership always has the final say when it comes to payroll, etc. \n \n\"I'm not here because of any marketing acumen,\" MacPhail said. \n \nMacPhail insisted the next GM would not be his subordinate. \n \n\"I've been in this role before,\" MacPhail said. \"I've had GMs under me before. If you talk to them I think they feel like they had a fair amount of autonomy.\" \n \nRegardless, change is coming to an organization many think has been slow to adapt to change. \n \n\"When Tiger Woods decided to change his golf swing in the prime of his career and people were going, 'Are you crazy? You're the best golfer in the world,'\" Middleton said. \"He said, 'Well, I need to be better.'  Their questioning was about the risk associated with somebody at that level going out and trying to do something different. So it's hard sometimes to convince people when they are highly successful as the Phillies have been that maybe the world is changing and maybe you need to look at it a little differently and do some things differently, and that's a hard thing to do.\" \n\nTodd Zolecki is a reporter for MLB.com. Read his Phillies blog The Zo Zone , follow him on Twitter and listen to his podcast . This story was not subject to the approval of Major League Baseball or its clubs.", "source": "Major League Baseball"}