{"published": "2015-09-22T15:13:00Z", "media-type": "News", "title": "Applied TAMOnline to Increase Automation for Hencilla Canworth", "id": "e2156dc8-977c-41d1-85ec-35ae02d5bf27", "content": "Most widely used brokerage management system in the world from Applied Systems to drive leading brokers technology integration strategy\n\nBrighton, UK (PRWEB) September 21, 2015 \n\nApplied Systems today announced that Hencilla Canworth has moved to Applied TAMOnline, the online version of the most widely used brokerage management system in the world, to increase automation and drive integration across its business operations. With Applied TAMOnline, Hencilla Canworth will further streamline business operations, automate reporting, and increase integration across systems to drive business growth and profitability. \n\n“To further enhance our online customer experience, we required a back-office system that could seamlessly integrate with our front-office client services,” said David Pollard, chief executive of Hencilla Canworth. “Working with Applied, we expect to benefit from superior technology guidance and solutions that improve productivity and increase client service through streamlined workflows and increased connectivity across our business.” \n\nApplied TAM allows brokerages to automate daily operational processes, client policy information, and insurer connectivity, enabling users to be more productive and focus on the core business of selling insurance and servicing their insured. Through an automated and easy-to-navigate interface, Applied TAM provides deep visibility into day-to-day brokerage operations to reduce time spent on administrative tasks, decrease errors and omission risk, provide a seamless employee onboarding and training experience, and better respond to client needs. Applied TAM automates the business operations for more independent insurance brokerages than any other broker management system.\n\n\"To drive organic growth in today’s increasingly competitive marketplace, leading brokers require advanced software to automate operations and provide multichannel servicing for their clients,” said Jeff Purdy, senior vice president of International Operations, Applied Systems. \"With Applied TAMOnline, Hencilla Canworth will be able to leverage the latest, modern capabilities to automate operations and focus more time on client service and selling the business of insurance, increasing retention and driving growth. We look forward to continued collaboration as Hencilla Canworth’s trusted technology advisor.\"\n\nAbout Applied Systems \n\nApplied Systems is a leading provider of software that powers the business of insurance. Recognised as a pioneer in insurance automation and data exchange between brokerages, insurers and their clients, Applied is the world’s largest provider of agency and brokerage management systems. Automating the insurance lifecycle for more than 12,000 agencies and brokerages and 450 insurers worldwide, Applied enables millions of people around the world to safeguard and protect what matters most.\n\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb1297288", "source": "KYTX CBS 19"}