{"published": "2015-09-23T14:15:00Z", "media-type": "News", "title": "Natural disasters: locals save more lives, says Red Cross before UN summit", "id": "706595ef-709a-470d-a37a-c1c35087c079", "content": "The Red Cross says one factor makes all the difference in the fight against natural disasters. \n\nMore lives are saved and casualties rescued by local people than outsiders in disasters around the world, a new report says.\n\nThe 2015 World Disasters Report by the International Federation of Red Cross and Red Crescent Societies (IFRC) found there is an increasing need to balance the relationship between international aid agencies and locals in order to guard communities against disasters.\n\n\"There are far more lives saved and casualties rescued by local people than by outsiders,\" Australian Red Cross International programs operations manager Natasha Freeman said. \"Time and again we see local first responders saving lives and digging through the rubble. Graphic: Piktochart. \"We saw local people playing a major role in the Ebola health emergency last year. They are the ones who brought the disease under control.\"\n\nLast year, the deadliest natural disasters to hit the world took place across Asia, with earthquakes, floods and drought in China claiming more than 1900 lives, and floods and landslides in India killing 1432 people.\n\nIn total, more than 8100 people were killed and 107 million people were affected by disasters.\n\n\"So much money is pumped in in times of disaster, rather than in times of preparing for disaster ... every dollar spent in preparing for disasters will save around $18 in responding,\" Ms Freeman said. Graphic: Piktochart. Robert Butal is a local from White Sands Village in Tanna and a Red Cross project manager in Port Vila, Vanuatu, where he now lives.\n\nHe says a local understanding is critical to a disaster response, pointing to Cyclone Pam in March this year.\n\n\"Our community used us like a middle man,\" he said. \"We understand the context and the existing community structure which already exists from generation to generation.\"\n\nThe annual report has been released before the first World Humanitarian Summit next year, a call to action by United Nations Secretary-General Ban Ki-moon to reduce human loss and suffering from crises.\n\nChief of the World Humanitarian Summit secretariat Dr Jemilah Mahmood says the report makes a timely contribution to the discussion around the capacity of local actors, including women and youth.\n\n\"It calls for us to re-examine the often oversimplified assumptions that underpin relationships between domestic and external humanitarian actors,\" she said.\n\nWhile it is important to acknowledge the thousands of deaths that occurred last year, Ms Freeman said it should also be noted that it was the lowest disaster death toll since 1986.\n\n\"We should take heart,\" she said, \"we are getting better at this.\"\n\nIncreased awareness and community preparedness have improved, while advancements in technology have also assisted in times of disaster.\n\nThe report referred to Kathmandu Living Labs (KLL), a Nepali technology and mapping collective that was founded in 2013 by local Nama Raj Budhathoki, who studied mapping in the aftermath of the Haiti earthquake.\n\nKLL's primary tool is OpenStreetMap, which works like Wikipedia, allowing people to contribute maps. By the time the devastating earthquake struck Nepal in April this year his program had already mapped much of Kathmandu.\n\n\"This is one of the benefits of the modern age, communicating with local people through technology...and trying to leverage those technologies in the best way to benefit them in the future,\" Ms Freeman said. The story first appeared on The Sydney Morning Herald.", "source": "Mandurah Mail"}