{"published": "2015-09-16T13:00:36Z", "media-type": "News", "title": "Say 'I do' to these 5 classic poses you'll want in your wedding photos", "id": "2eaf0aa3-8776-4dfb-b391-fe88151a2daf", "content": "Your wedding day is commonly referred to as the best day in your life. A whirl of people, photos, flowers, food, and music will swirl past as you celebrate marriage. What an exciting and memorable experience! Your wedding photo album will live as a reminder of those happy moments. Since you will be busy staring into your new spouse’s eyes, plan ahead with your photographer to capture these 5 essential wedding poses. The Ring Shot A wedding ring symbolizes the eternal unity of the couple, as there is no beginning and no end to its perfect circle. Wearing a wedding ring shows the world that you are married, so show off those beautiful symbols of your wedded bliss. There are countless ways to photograph just your wedding rings such as showing the rings near a scripture verse, inside the flower bouquet, or on the ring pillow, but make sure you let your photographer capture the rings on your fingers. View a beautiful example on Pinterest . The Blissful Hug Amidst the hustle and bustle of welcoming guests, dancing, cutting the cake, and smiling for hours, take some time to relax with your new spouse. Celebrate that you two are finally married and simply hold each other. (Make sure your photographer tags along during these quiet moments.) As you enjoy your wedding festivities, you’ll find you are continually drawn to be in your spouse’s loving arms. Enjoy those calm moments of simple closeness. Bridal Guide offers a lovely example of this photo. Happy Faces Wedding photographers capture all kinds of candid photos throughout your wedding celebration. Candid photos show the movement and joy around the entire day, and these photos are not staged. In most of your photos, you’ll find that neither of you look at the camera often. You’ll be looking at each other or the guests more than the photographer. Occasionally the two of you will both need to look at the photographer at the same time. The “happy faces\" photo shows the world your joy at becoming man and wife, so remember to smile for the camera. See an example on Pinterest . Swept Away Every wedding album needs a photo of the groom sweeping his bride off her feet. Some grooms sweep their bride down into a loving dip. Some grooms carry their brides off in their arms. The \"swept away\" photo can be a humorous event, a romantic gesture or a choreographed dance move. Whatever the groom decides to do in your wedding, make sure your photographer is primed to capture those precious smiles and kisses, like in this lovely example photo from Love This Pic. Page 2 of 2 - Seasonal Memories If your wedding celebration takes place during seasonal weather, ask your photographer to include some seasonal pictures. For example, an autumn wedding could include some pictures with falling leaves or harvest pumpkins. See an example on Pinterest . A winter wedding could show the couple dancing in lightly falling snow or the groom placing a warm shawl over his wife. The day of your wedding includes the weather of the actual day, and photographs will help you remember the details. Whichever poses you decide to incorporate into your wedding, make sure you hire a professional photographer with whom you feel comfortable. Wedding Paper Divas offers some expert advice for choosing the perfect photographer for your wedding.", "source": "Gurdon Times"}