{"published": "2015-09-16T22:50:53Z", "media-type": "News", "title": "The obese THREE-year-old who has type 2 diabetes: 70lb girl from Texas is thought to be youngest ever to suffer from the disease", "id": "701c6d87-61f5-44e9-807a-e6662143a52c", "content": "Unidentified patient, from Houston, Texas, weighed five-and-a-half stone Doctors treating her discovered both her parents were also obese - and the  family had 'poor nutritional habits' and 'uncontrolled' calorie intake Her type 2 diabetes has been reversed with medication and better diet Doctors warn of an explosion on diabetes among obese young people   \nA three-year-old girl has been diagnosed with diabetes caused by obesity, in what is thought to be the youngest ever case of the disease. \n\nThe unidentified patient, who lives in Houston, Texas, weighed five-and-a-half stone (35kg) and was in the heaviest 5 per cent of her age group. \n\nAccording to World Health Organisation weight charts, a three-and-a-half-year-old on the 50th percentile, where many children fall for weight, would weigh around 2st 7lb (15kg).  \n\nSome 90 per cent weigh around 40lb (18kg) - almost 3st - or less.  \n   \nThe unidentified patient (file picture of a model is shown here), who lives in Houston, Texas, weighed five-and-a-half stone (35kg) and was in the heaviest five per cent of her age group. She has since had her condition temporarily reversed thanks to medication and a low calorie diet  \n\nDr Michael Yafi, of the Department of Paediatric Endocrinology at the University of Texas, who saw the child in his clinic, said the case highlighted the extent of global epidemic of diabetes. \n\nHe said that both the child's parents were also obese and that the family had 'poor nutritional habits' and 'uncontrolled' intake of calories and fats. \n\nThere has been an explosion in cases of type 2 diabetes, which is usually caused by being overweight, and doctors say this form is becoming increasingly common in teenagers and children. \n \nThe youngest known case in Britain was a seven-year-old, although around 1,300 under 18s have been diagnosed with the illness. \n\nDr Yafi, who is presenting details of the patient at the European Association for the Study of Diabetes in Stockholm, Sweden, said the illness was becoming increasingly common in very young children. \n\nThe three-and-a-half-year-old girl attended his paediatric clinic for evaluation of obesity. \n\nShe was suffering excessive thirst and going to the toilet a lot and, while both her parents were obese, there was no family history of diabetes. \n   \nThere has been an explosion in cases of type 2 diabetes, which is usually caused by being overweight, and doctors say this form is becoming increasingly common in teenagers and children (file image)  \n\nExperts reviewed the girl's diet and took blood tests and found 'poor family nutritional habits with uncontrolled counting of calories and fat'. \n\nDr Yafi said he had successfully treated the Hispanic girl over the past six months with the drug Metformin to control her blood sugar levels, a low calorie diet and regular weight loss. \n\nShe has since lost enough weight to enable her blood sugar levels to return to normal so her diabetes has been reversed, or temporarily cured, although it may return. \n\nDr Yafi said: 'Based on symptoms, physical findings of obesity and laboratory results the diagnosis of type 2 diabetes was made. \n\n'The incidence of type 2 diabetes has increased dramatically worldwide in children due to the epidemic of child obesity. \n\n'Clinicians should be aware of the possibility of type 2 diabetes even in very young obese children. \n\n'Reversal of type 2 diabetes in children is possible by early screening of obese children, early diagnosis, appropriate therapy and lifestyle modification.' \n   \nDoctors treating the girl said both her parents were also obese and that the family had 'poor nutritional habits' and 'uncontrolled' intake of calories and fats (file image) \n\nDouglas Twenefour, clinical advisor at Diabetes UK, said: 'This is clearly a sad case but we are pleased to hear this girl's blood glucose level has now returned to normal. \n\n'It is important to emphasise that Type 2 diabetes is very rare in young children, with most children with diabetes having Type 1, which is not related to weight or lifestyle in any way. \n\n'But there are a small number - probably less than 100 - children aged under 10 in the UK who have Type 2 diabetes. \n\n'This highlights how important it is that children get a healthy start to life, which includes a healthy diet and regular exercise, both to prevent ill-health in childhood but also to reduce their risk of developing Type 2 diabetes and other serious health conditions much later in life.' \n\nLast month campaigners warned that type 2 diabetes threatened to bankrupt the NHS, highlighting figures showing it had increased by 60 per cent in the last decade. \n\nThe charity Diabetes UK said if the Government does not take action to prevent the condition and improve care, the costs will 'spiral out of control' . \n\n ", "source": "Mail Online UK"}