{"published": "2015-09-22T16:04:00Z", "media-type": "News", "title": "Stern Pinball Announces New Expanded Partnership with Digital Game Developer FarSight Studios", "id": "762e45ca-a2a4-418f-91bc-d23dad2e5549", "content": "ELK GROVE VILLAGE, Ill. , Sept. 22, 2015 /PRNewswire/ -- Stern Pinball, Inc., the world's oldest and largest producer of arcade-quality pinball games, announced a new expanded partnership with FarSight Studios, a developer and publisher of multi-platform digital games including The Pinball Arcade. FarSight will develop a new digital platform called the Stern Pinball Arcade that will feature exact virtual replicas of Stern Pinball's hottest terrestrial pinball machines. \n\nFarSight Studios has been developing top videogame products across platforms for more than two decades. From movie licensed strategy games and hardcore sports titles to edutainment games for kids and mass-market software. Over the years, FarSight has developed many best-selling franchises, such as Game Party, Sega Sports' NFL games for the Genesis, NCAA college football games for EA, Backyard Sports for Atari, PlayTV for Radica/Mattel and the Pinball Hall of Fame for Crave. \n   \n\"At Stern, we're always looking for new ways to excite our existing fans and gain new ones,\" said Gary Stern , CEO of Stern Pinball. \"Expanding our partnership with FarSight Studios is helping us do just that. Both gamers and pinball enthusiasts of all stripes and abilities will love the new products we create together.\" \n\n\"Anyone in the gaming world knows Stern Pinball, which is why we are so pleased about the renewal and expansion of this partnership,\" said Jay Obernolte , CEO of FarSight Studios. \"We always want to be offering our customers more and we think our fans will love the pinball titles that Stern has to offer.\" \n\nPricing and Availability \nAvailability of the new products and pricing will be announced later this fall. To learn more about the partnership please visit www.SternPinball.com . \n\nAbout Stern Pinball, Inc.  \nStern Pinball, Inc., headquartered just outside Chicago, Illinois , is the oldest and largest producer of arcade-quality pinball games in the world.  Stern's highly talented creative and technical teams design, engineer and manufacture a full line of popular pinball games, merchandise and accessories.  Recent Stern titles include KISS, WWE WrestleMania, The Walking Dead, Mustang, Star Trek, Metallica, The Avengers, X-Men, AC/DC, Tron, Transformers, Avatar, Iron Man, Batman, Spiderman and many more!  All of Stern's pinball games are crafted by hand and assembled by Stern's expert team.  A broad range of players enjoy Stern's games from professional pinball players that compete in high-stakes international competitions around the globe to novice players who are discovering the allure of the silver ball for the first time. To join the fun and learn more, please visit www.SternPinball.com . \n\nAbout FarSight Studios \nFarSight Studios started developing pinball video games in 2004 with the critically acclaimed Pinball Hall of Fame games.  G4TV awarded Best Mobile Game of 2012 to FarSight's Pinball Arcade.  Pinball Arcade features exact recreations of the all-time greatest pinball tables from Williams®, Bally®, Stern Pinball®, and Gottlieb® together in one game with a new table added each month. Pinball Arcade has been downloaded over 12 million times across mobile, console and PC platforms, and has over one million active players each month. Check out FarSight Studios and The Pinball Arcade for more details. \n\nAll trademarks and product names are the property of their respective companies. \n\nMedia Contact \nKaycie East \nFortyThree, Inc. \n831-401-3175 \nSternPinball@43pr.com  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/stern-pinball-announces-new-expanded-partnership-with-digital-game-developer-farsight-studios-300146391.html \n\nSOURCE  Stern Pinball, Inc.", "source": "Indianapolis Business Journal"}