{"published": "2015-09-08T22:50:22Z", "media-type": "News", "title": "Bigger doesn't mean better in Coles-Woolies trolley war", "id": "ddc2f651-1b19-4682-8911-3b136f68ad8a", "content": "Wayne Sully, director of QHDC Australia, says retailers are upgrading shopping trolleys more frequently. Photo: Supplied  \n  \nThe battle for market share between Woolworths, Coles and independent supermarkets has been a boon for family-owned shopping trolley supplier QHDC Australia. \n\nSupermarkets are spending millions of dollars a year upgrading their 1.5 million fleet of shopping trolleys to cater for changing grocery shopping habits and to avoid \"trolley rage\" triggered by wobbly wheels and misshapen baskets. \n\n\"I don't think the supermarket chains saw the trolley as important – it wasn't the top priority when capex had to be spent,\" said QHDC Australia director and co-owner Wayne Sully. \n\n\"Now they recognise the fact that it's the first thing the customer touches when they go into a supermarket,\" he said. \n \nThe major supermarket chains and independent retailers are now upgrading trolleys every three or four years instead of every five to seven years, reducing the number 212-litre trolleys and adding more 70- and 100-litre models to cater to more frequent shopping trips, the growing popularity of self-scanning checkouts and an ageing population. \n\nThe big weekly food and grocery shop is becoming a thing of the past – just 34 per cent of the average shopper's weekly food budget is spent on a primary shopping day – and most consumers are shopping two to three times a week for fresh food. \n\n\"There are more of the shallow trolleys around now because people are doing smaller and more frequent shops,\" a Coles spokesman said. \nBigger was better \nSmaller trolleys now account for between 40 and 50 per cent of the fleet at major chains such as Woolworths and Coles, compared with just 20 per cent previously. The average store has 300 to 400 trolleys. \n\n\"Five or six years ago bigger was better – the chains went to 240 litre trolleys because they had feedback from the market the bigger the trolley the more groceries people put in,\" Mr Sully said. \n\n\"But the trend in Australia at the moment is that people are shopping once or twice a week, they're using a smaller trolley, and the major supermarket chains are now recognising that fact,\" he said. \n\nThe Sullys – directors Wayne and David and their sister Carol Schulze – were running the family's powder-coating business at Burleigh Heads about 18 years ago when one of the major supermarket chains asked them to recoat its fleet of 165-litre trolleys. \n\nFive years later, when the retailer decided to upgrade its fleet to 212 litres, the Sullys were invited to tender for the job, even though they had no source of supply. \n\n\"There was no manufacturer in Australia and the cost of setting up in Australia was far too prohibitive, so we had to go offshore,\" Mr Sully recalled. \n\nAfter sourcing trolleys from a major supplier in Guangzhou for many years, QHDC established its own manufacturing facility in Suzhou, west of Shanghai, in August last year. \n\nThe company, Suzhou QHDC Metal Products, now produces between 120,000 and 150,000 trolleys a year, supplying the major grocery and discount department store chains and independent retailers in Australia, as well as other local suppliers and retailers in the United States, Thailand, and Malaysia. \n\nSuzhou QHDC is also working with retailers to improve shopping trolley design, improving the shape of baskets and handles and adding features such as coffee cup holders, branding, twin seats and specialised seats for parents with disabled children. \n\n\"We have some new concepts we are working on with customers – they'll be easier to push and more friendly to the eye,\" said Mr Sully.", "source": "Brisbane Times"}