{"published": "2015-09-11T04:12:07Z", "media-type": "News", "title": "Japan flooding: 3 deaths, dozens missing", "id": "ec2a5190-0416-4e0d-a031-5cbaa0e8f89b", "content": "More than 1.6 feet of rain have fallen in 25 hours   TOKYO (CNN) -  \nHeavy flooding over eastern Japan has caused three deaths, almost two dozen unaccounted for and houses washed away as residents were forced to their rooftops, desperate for rescue by military helicopters. \n \nIn Miyagi Prefecture, one woman was found dead in her floating car, and in Tochigi Prefecture, to the north of the capital Toky, two deaths were reported, one in a landslide and another who had drowned. At least 22 people are missing since floods inundated parts of eastern Japan. \n\nJapan's Yomiuri Shimbun newspaper cited authorities in reporting the landslide death of a 63-year-old woman in Kanuma, Tochigi Prefecture. \n\nThe raging brown floodwaters spawned from Tropical Storm Etau, which has dumped 60 centimeters (2 feet) of rain over some areas since Monday. \n\nCombine that with several weeks of near-daily rainfall, and swaths of eastern Japan are now deluged. \n\n\"Tochigi Prefecture is facing a grave danger and is in an emergency situation,\" Japan Meteorological Agency Spokesman Takuya Deshimaru said Thursday. \"It is experiencing unprecedented downpour.\" \n\nJoso: At the heart of the floods \n\nAt daybreak Friday in the city of Joso, Ibaraki Prefecture, CNN saw Japan Self-Defense Force (SDF) helicopters land on the roof of a shopping center where dozens of people had been stranded overnight. \n\nIn a rare break from the almost-daily rains, a hot sun has allowed flood waters to visibly recede, but many roads remain impassable. Drivers who attempted to ford the inundated streets were forced to abandon their broken down vehicles. \n\nAdditionally, local firefighters rescued 20 people, an official from Joso City's Information Office said. Nine people were reported missing in that city, authorities said. \n\nHundreds were reportedly left stranded overnight in the city, after the Kinugawa River burst its banks. \n\nThe Miyagi prefectural office told CNN that 181 people are still waiting for rescue in the stricken city. \n\nHundreds of thousands evacuated \n\nMore than 400,000 people have been evacuated, officials said. Almost a million, including in Tokyo, and in seven other prefectures, have been issued evacuation advisories -- where residents have been warned they may need to leave their homes because of rising water. \n\nSome of those who didn't leave found their houses submerged within minutes. \n\nMembers of the Japanese Self Defense Forces dropped from helicopter lines to pluck stranded residents from their roofs. Two by two, they swung precariously over the raging currents as they were pulled back up to the aircraft. \n\nThe Self Defense Forces had rescued 101 people by Thursday afternoon, a spokesman said. \n\nIbaraki prefecture said 70 people out of the 176 there who had called for help had been rescued. \n\nSUBHED \n\nIn parts of Tochigi, more than 50 centimeters (1.6 feet) of rain fell in 24 hours, Japanese broadcaster NHK reported. That's about double the amount that typically falls in the region for all of September, it said. \n\nFukushima prefecture, which was devastated by the 2011 tsunami, saw more than 30 centimeters (1 foot) of rain in 48 hours -- the heaviest downpour there in 50 years, NHK said. \n\nTEPCO, the company that operates the failed reactors in Fukushima that at the time caused one of the biggest nuclear accidents in history, said it detected slightly tainted \"rainwater flowing out into the ocean\" from the site earlier in the week. \n\nAnd the disaster is far from over. Inundated parts of eastern Japan will get another 5-10 centimeters (2-4 inches) of rain over the next 36 hours, CNN meteorologist Derek Van Dam said Thursday. \n\nThe mountains will help induce more rain and will funnel the precipitation -- intensifying flooding and causing an even greater risk of mudslides.", "source": "KESQ"}