{"published": "2015-09-11T21:18:55Z", "media-type": "Blog", "title": "DENVER BRONCOS WEEK ONE - Baltimore at Denver, September 13, 2015", "id": "4b3322ae-2294-408e-bd77-d377eba7ef44", "content": "Baltimore Ravens (0-0)\nat\nDenver Broncos (0-0)\nBACKGROUND\n\nIn the national media, the Baltimore Ravens are a popular pick to go to the Super Bowl this year. That same national media doesn't seem to know what to make of the Denver Broncos. The recently dominant Broncos seem as though they might be poised to come back to the pack.\n\nI am not so sure, but I understand the questions. Was the end-of-the-season Peyton Manning an injured player or a player showing his age? Can Manning and new coach Gary Kubiak co-exist? Will the Denver defense be one of the best editions of this unit ever?\n\nHere's what I think: Manning, though older, is still a Top Ten (at minimum) quarterback. Kubiak and Manning are smart dudes and they will put together an offense that might look different from we've seen from the Broncos in recent years but will be an efficient scoring machine. CJ Anderson will have a break out season and Von Miller will dominate the league.\n\nIt all starts in this game. Manning has been brilliant in openers. Joe Flacco doesn't have many quality targets to throw to and Denver's defense looks hungry out of the gate.\n\nKEY MATCH UP\n\nThis has to be the revamped Denver offensive line vs. the typically monstrous defensive line of the Ravens. If Manning gets a lot of pressure up-the-middle, it could be a long afternoon for the orange and blue. That said, Kubiak's zone blocking system has been successful wherever he's been and it's difficult to pin back your ears and gun for Manning if Anderson is gashing you for 5 and 10 yards at a clip.\n\nX-FACTOR\n\nEmmanuel Sanders debuts this weekend as the Broncos' punt returner and I wouldn't be surprised to see him take a punt to the house. He's an exciting player and electric with the ball.\n\nPREDICTION\n\nDenver will be a work in progress on offense for a while, but I think they will have themselves together enough to handle a Ravens team that doesn't always perform well on the road.\n\n\nBaltimore Ravens 20\nDenver Broncos 31", "source": "And There Came a Day..."}