{"published": "2015-09-30T04:26:17Z", "media-type": "News", "title": "Uber says ACT regulation is on right road", "id": "37c30b24-aa8b-4ac1-aa2e-1f013f5b22dd", "content": "UBER Australia hopes other states follow the route mapped out by the ACT to regulate ride-sharing services. \n\nTHE ACT government will legalise Uber and similar services in Canberra from October 30, with new regulations in place for drivers. \n\nAt the same time, it's easing restrictions and drastically cutting fees for taxis and hire cars. \n\nOther states playing catch-up with Uber already operating in their area have been left \"looking like a bunch of slack-jawed banjo-playing yokels\", Liberal Democrat senator David Leyonhjelm says. \n\nUber congratulated the ACT government for showing \"global leadership\". \n\n\"It's exactly what we've been asking for,\" Uber Australia boss David Rohrsheim told AAP on Wednesday. \n\n\"There's reviews underway across Australia and we hope this sets a good template.\" \n\nRead more \n\nThe ride-sharing company will start operating in Canberra from October 30, when the first tranche of regulations come into place. \n\nRide-share drivers must have government accreditation, pass criminal and driving history checks and have safety checks done on their cars. \n\nThey'll have to be alcohol and drug free, the same as taxi drivers. \n\nA second stage of regulation, starting once legislation is passed, will require ride-share drivers to have compulsory third party and property insurance as well as training. \n\nThey'll have to pay $150 each year in licence and accreditation fees, plus charges for vehicle inspections and background checks. \n\nPassengers won't be allowed to pay cash unless cars are fitted with security cameras. \n\nTaxi drivers facing increased competition will see their licence fees halve on October 30 from the $20,000 charged now, and then drop again to $5000 in 2017. \n\nOnly taxis will be able to pick up people from cab ranks and off the street - all other drivers must arrange pre-booked fares. \n\nMr Rohrsheim said Uber complied with these regulations already. \n\nThe ACT government believes its regulations strike a balance between allowing the sharing economy to thrive in Canberra while recognising the pressure it puts on existing taxi drivers and owners. \n\nThe Victorian government is also preparing a ride-sharing regulatory scheme to address passenger safety, driver and vehicle standards and insurance issues and NSW is also looking at introducing similar rules. \n\nSenator Leyonhjelm said resolving the problem was a serious issue for tourism. \n\nAnd NSW opposition leader Luke Foley wondered on Twitter why his state was lagging behind. \n\n\"If NSW Govt sources quietly claiming @Uber will be regulated in next 6 mths, why the bizarre public crackdown?\" he said, referring to NSW Roads and Maritime Services suspending the vehicle registrations of 40 UberX drivers this week. \n\nThe NRMA has urged all state governments to legalise ride-sharing services, saying Uber is \"here to stay\".", "source": "Geelong Advertiser"}