{"published": "2015-09-20T10:00:00Z", "media-type": "News", "title": "Groundbreaking pontiff will challenge us to love", "id": "82db37c3-7c90-4e66-9f5c-2f3ea7be534f", "content": "In polite society, one never discusses money, politics, religion or sex. Pope Francis talks about all of them. \n\nRather than causing alienation, the pope’s discussion of such taboo subjects has endeared him to both Catholics and non-Catholics alike because of his honesty and humility. \n\nHe is so popular, in fact, that 30 seconds after the sale of bus passes began for the Sept. 27 Papal Mass, all 10,000 were sold out — 30 seconds. \n \nUnfortunately, I was not one of the people who managed to acquire tickets. Disappointed, I consoled myself with plans to watch Pope Francis on TV. Several weeks later, though, my mom surprised me with bus passes to see this groundbreaking pope. The Diocese of Harrisburg, responding to popular demand, decided to send additional buses, allowing us to obtain these tickets. \n\nWhile I am undeniably ecstatic to see the leader of the Roman Catholic Church in person, I feel as if I already know him. I think one of the reasons Pope Francis is so beloved is because social media have made him more accessible than past popes. \n\nWhile all popes are shepherds of the people, because of their different personalities, this may not have always been as apparent. And while I do admire all the popes, it is Pope Francis’ loving and welcoming nature in particular that draws me to see him. \n\nThe pope’s role is sometimes described simplistically. Yet he is more than the highest-ranking official in the Catholic Church. The church is apostolic, which means, in part, that all popes throughout history can be traced back to St. Peter, whom Jesus appointed to lead his church. One source of motivation for me to see Pope Francis, then, is to connect with and be a part of church history. \n\nAdditionally, Pope Francis is a kind of father figure. He provides love and comfort, while also guiding and challenging us. He welcomes us and offers the love of Christ to all people. \n\nThe Holy Father has been known to break with convention and surprise us with his actions, so I am eager to see what he does during his time in Philadelphia. No matter what happens, I know that it will be a spiritually fruitful experience. In addition to the Pope’s presence, the sheer size of the faithful who will gather to see the Holy Father will be breathtaking in and of itself. \n\nI am especially interested to hear what Pope Francis talks about in Philadelphia. Because there is so much turmoil in the world, and more specifically in the United States, there are many issues he could choose to discuss. With the recent deluge of videos revealing Planned Parenthood’s acceptance of fees for the tissue of aborted babies, I expect the sanctity of life will, in some way, be a theme. \n \nPope Francis could speak about abortion, the death penalty, immigration or the growing income gap. Of course, these are all quite different though equally controversial subjects, yet they all share the same theme of “the sanctity of life.” \n\nIn our throwaway, “me-centered” culture, we need constant reminding of the innate value of each person. The pressure to look at people as statistics or as a means to an end rather than fellow humans can be overwhelming. I look to Pope Francis to remind and encourage us — not only as a nation, but as individuals as well — to recognize our own sinfulness and dependence on God’s mercy and God’s call to offer that mercy to even the most hardened, unrepentant person. \n\nIt is my wish that the example of the pope helps me extend love and forgiveness to those who have wronged me. Hate begets hate, and love begets love, but it is a thousand times easier to say that than to practice it. I pray, and expect, that the pope will inspire me to turn this adage into action. \n\nWhile there are matters I would like to hear the pope discuss, I don’t want to limit my expectations. \n\nInstead, I simply expect God to use the pope and his visit to the United States however he chooses so as to build up his kingdom. For as God says in Isaiah 55:8, “My thoughts are not your thoughts, nor are your ways my ways.” \n\nKristen Orlandi is a senior at Lancaster Catholic High School and a parishioner of St. James Catholic Church in Lititz. She plans to attend Steubenville Franciscan University next year.", "source": "Lancaster Online"}