{"published": "2015-09-30T14:37:07Z", "media-type": "Blog", "title": "Easy Weeknight Dinner: Sausage & Kale Sauté", "id": "52338a09-45bd-487c-b979-d52dd6cdd4f5", "content": "*Sheri McShane is a contributor for MomGenerations.com! Sheri has the blog: When the Kids Go to Bed . \n \nBetween soccer, fall ball, tutoring, swim practice and everything else, evenings can be pretty hectic, right? Planning is definitely key to balancing everything, but sometimes we just forget to plan. I know I can’t be the only one. This weeknight dinner was concocted on one such evening where I just threw what I had into a sauté pan and hoped for the best. Well, it was delicious and done in 20 minutes. \n \n\n \nIngredients: \n \n2 tbsp olive oil \n1lb Sweet Italian turkey sausage (removed from casing) \n½ a yellow onion (diced) \n1 package of fresh baby kale (roughly 4 large handfuls) \n½ lb cooked pasta of your choice \n1 tbsp butter \nSalt & pepper \n \nFirst, get that water going for your pasta. \n \nNow heat up the olive oil in a large sauté pan. Toss in your onion and sausage. Check your pasta water, it should be about done. Get your pasta cooking! \n \nOnce the sausage is browned, the onions are translucent, and your pasta is near done, toss in the kale and add some salt and pepper. Cover and turn down the heat. \n \nAdd the cooked pasta and tablespoon of butter to the sausage and kale, toss and serve. So delicious and filling! Hope you enjoy! \n \nABOUT SHERI MCSHANE: \n \n Hello All. My name is Sheri. I am a working mother of 3 pretty darn fabulous little boys. I’m trying very hard to handle the stresses of working, being a mother, being a wife, keeping house, and finding the time to just laugh and enjoy life. A few things you should know about me: I’m an iced-coffee addict, I love to organize, and I love my wine. I am also a master at fort-building and being the belly-eating monster. Fitness and healthy eating habits are important to me so you may hear a little about that too. Here you will read about my daily musings and of course my venting, wine glass in hand. Hope you find something you can relate to. Cheers. If you’re a crafty kind of person, come visit me over at The Crafty Collaborative . Here you will find a group of us ladies reviewing and test driving all the fabulous recipes and DIYs we find on Pinterest. We’ll let you know if they’re worth diving into. \n \nThe post Easy Weeknight Dinner: Sausage & Kale Sauté appeared first on Mom Generations - Mom Fashion and Beauty - Creating a Stylish Life for Moms .", "source": "Mom Generations - Mom Fashion and Beauty - Creating a Stylish Life for Moms"}