{"published": "2015-09-03T22:01:35Z", "media-type": "News", "title": "STATEMENT BY SENATOR JOHN McCAIN ON VA INSPECTOR GENERAL REPORT CONFIRMING 300,000 VETERANS DIED AWAITING CARE", "id": "a22acc97-f109-4503-9cc3-baa20384d78f", "content": "Washington, D.C. ­– U.S. Senator John McCain (R-AZ) released the following statement today on the Department of Veterans Affairs (VA) Inspector General report confirming that more than 300,000 veterans have died after applying for health care benefits through the agency: \n \n“I am deeply disturbed that the VA Inspector General’s report released yesterday substantiated allegations that over 300,000 veterans have died after applying for health care benefits through the VA. It is extremely troubling that there are another 500,000 veterans who have also applied for their health care benefits and are languishing in a bureaucratic black hole awaiting their care. \n \n“VA Secretary Bob McDonald was brought on board over a year ago to fix these problems. Despite Congress providing tens of billions of dollars to the VA in additional funding for more employees and information systems, it is clear that he has not done so. \n \n“It is astounding that the VA IG’s report substantiated such horrific mismanagement at the VA on the determination of eligibility for benefits at a time when the VA recently claimed historic progress on its disability backlog. It is more disappointing that the IG only investigated this allegation at the direction of Congress. I commend House Veterans Affairs Committee Chairman Jeff Miller for demanding answers to this problem at the VA. \n \n“It is absolutely clear that the way ahead for reform of the VA must be to empower all veterans to immediately get the care they need where and when they need it – regardless of the location – and never allow bureaucrats to deny our nation’s heroes the benefits they deserve.” \n###", "source": "U.S. Senator John McCain"}