{"published": "2015-09-07T13:00:57Z", "media-type": "Blog", "title": "Pre-Operative/Neoadjuvant Therapy: Rationale and Indications", "id": "9f64c1f0-7002-48b7-ae41-f040fc1ab8c5", "content": "Pre-Operative/Neoadjuvant Therapy: Rationale and Indications\nPublished September 7, 2015 | By GRACE Video\tDownload PDF of this page\n  Thoracic Surgeon Dr. Eric Vallieres reviews the principle of giving chemotherapy prior to lung cancer surgery in order to improve survival and potentially make it possible to do a smaller lung surgery. Podcast: Play in new window | Download (Duration: 5:03 — 34.7MB) Download Transcript How Did You Like This Video?\nPlease feel free to offer comments and raise questions in our Discussion Forums.   Transcript Another topic that is of interest is the fact that, since 2004, we now know that there is a rule to treat individuals after surgery with chemotherapy, that’s called adjuvant chemotherapy, if they had evidence of nodal metastases in the specimen that was removed. So, if they were stage 2 or stage 3 tumors, we now have a fair amount of data to support that these individuals should be considered for chemotherapy after surgery, or adjuvant chemotherapy. There’s more of a debate for the stage 1b tumors, which have not spread to lymph nodes, but some of those can be fairly sizable, and at around 4 cm it’s worth a discussion that maybe tumors that are 4 cm or larger, even if the lymph nodes are not involved, maybe these individuals should be considered for chemotherapy, but that’s a topic by itself. The advantage of adding chemotherapy after surgery is statistically real, and we’ve had four trials, two in North America and two in Europe, that have shown this, but the advantage is not… In baseball terms, it’s not a home run — it’s a single, maybe a double, but it’s real. So, I think it’s reasonable to tell your patients that if you’re going to have chemotherapy after surgery, in those situations, you can expect a 5%, as high as a 14, so between 5 and 14%, improvement in your odds of curing the cancer by adding chemotherapy. Chemotherapy should be three or four cycles of treatment after surgery, with cisplatin being one of the agents. Now, one of the debates or questions is, why couldn’t we give the chemotherapy before surgery? Why do we have to do it after surgery? Well, that’s a topic that was very close to my heart for years, and we actually were studying this concept of giving chemotherapy before surgery at a time where the data to support post-operative chemotherapy became the standard of care, and as a result of that, almost everywhere, we stopped studying the concept of giving chemotherapy upfront. There are potential, theoretical advantages of giving the chemotherapy upfront, before surgery, and that’s called induction chemotherapy. The first one is that you, potentially, may control the micro-metastatic disease, the little cells that are floating around, early on, before it’s too late. You may potentially take a tumor that’s fairly large, shrink it down, and allow you to do less than a major resection — maybe you do a lobectomy instead of a pneumonectomy, but that’s debatable. You have an idea of whether your drugs are working because you can follow the tumor on x-ray or PET scan to see if the tumor is shrinking as a response to chemotherapy, which is potentially an advantage to the oncologist, particularly when the chemotherapy is a little hard on the patients, because once you do your chemotherapy after surgery, the x-rays are now normal, there’s no tumor around, so we’re doing it, but it’s kind of a shot in the dark because you can’t see whether the tumor is responding or not. The final potential advantage is that there may be more easiness in giving the chemotherapy before surgery, because that has always been a bit of an issue when you’re trying to give it after surgery, your intentions are there, the patients start it, but they’re still recovering from surgery, and you’re not able to give it. So maybe, what we call, the delivery of chemotherapy, may be in the 70-75% range after surgery at best, and if you give it before surgery, it’s probably 10-15 points higher. Whether or not that translates into better results, we don’t know right now. So these are advantages, and the fact is that, when we look at the studies that were done studying the question of induction chemotherapy, and we group them all together, we come up with what’s called a hazard ratio, which evaluates the effect of your treatment, very, very similar to the hazard ratio of giving the chemotherapy after surgery. So, there are those who believe that these two strategies are very equivalent. There are those who also believe that maybe, actually, induction is a little bit better, but right now it’s a subject of debate. Related Posts:Assessing the “flight risk” of a lung cancer:… by Dr West December 6, 2013 Basic Principles of Managing Locally Advanced NSCLC by Dr West by GRACE Video September 9, 2015 Special Considerations for Lung Cancer Surgery in the… by Dr West by GRACE Video by GRACE Video August 19, 2015 What is a Pancoast Tumor and How is it Best Treated? by Dr West by GRACE Video by GRACE Video by GRACE Video September 11, 2015 Targeted Therapy as Adjuvant Treatment: Should We… by Dr West by GRACE Video by GRACE Video by GRACE Video by Dr West February 2, 2014 Posted in A Reference Library on Lung Cancer, Chemotherapy, Core Concepts, Early Stage NSCLC & Surgery, GCVL-Lung, General Lung Cancer Issues, GRACE Cancer Video Library, GRACEcast, Lung Cancer, Lung Cancer, Non-Small Cell Lung Cancer (NSCLC), Surgery Issues, Treatment | Tagged early stage lung cancer, GCVL, GCVL-Lung, lung cancer surgery, neoadjuvant chemotherapy, NSCLC, pre-operative chemotherapy", "source": "GRACE :: Lung Cancer"}