{"published": "2015-09-05T09:22:51Z", "media-type": "News", "title": "Vince Cable hits out at 'ugly tribal prejudices' of Tories in memoir", "id": "12d95568-b2a9-4d97-8f51-81717fa656c2", "content": "Vince Cable has lifted the lid on working with the Tories - describing them as \"collectively appalling, with ugly tribal prejudices\". \n \nThe former Liberal Democrat politician, who was business, innovation and skills minister in the coalition, revealed that relations in the alliance could sometimes be strained. \n \nHe said that while many of his Conservative colleagues were \"invariably courteous, professional, often likeable\" individuals, as a group they could be vicious. \n \nIn an extract from his upcoming book printed in The Guardian, he wrote: \"The Tories collectively could be appalling, with some ugly tribal prejudices, and when their party interests were directly challenged, they could be vicious.\" \n \nHe claimed that during the 2011 alternative vote referendum the Conservatives channelled funds to groups that \"specialised in scurrilous personal attacks on Nick (Clegg), which led to one of the few cases of real verbal fisticuffs in Cabinet\". \n \nMr Cable revealed he worried his party lacked the political ruthlessness to stay in power. \n \nHe said: \"But the Tories appeared to have an exceptional ability to compartmentalise, to commit political murder with a charming smile. \n \n\"I worried that, in its rapid ascent from the Championship to the Premier League, my party hadn't acquired this ruthlessness, and has now paid the price.\" \n \nMr Cable was one of the highest profile scalps of the general election, losing his Twickenham seat to the Conservatives. \n \nIt was a disastrous election for the Lib Dems, who were left with just eight MPs - going from coalition partners to near electoral wipe-out in just a few hours. \n \nHaving turned down an offer to sit in the House of Lords, Mr Cable has instead gone back to his other passions - writing and dancing. \n   \n Share article  \n   \nHe famously starred in the 2010 Christmas special of Strictly Come Dancing, which returns to television screens tonight, and is reportedly preparing for the national ballroom championships. \n \nHis book, After The Storm: The World Economy & Britain's Economic Future, is published later this month.", "source": "Stroud News and Journal"}