{"published": "2015-09-17T03:36:00Z", "media-type": "News", "title": "NRL Premiership Tournament: Quarter Finals", "id": "873c77cd-475e-49b1-9478-4b98126573c6", "content": "VideoImageTaupau should remain a Tiger4:01\n\nNRL: Steve Roach joins Fox Sports News to discuss the NRL Finals and the situation surrounding the possible release of Martin Taupau.\n\nSeptember 17th 20153 hours ago/video/video.news.com.au/Sport/NRL/ Nick CamptonThe Daily TelegraphShareShare on FacebookShare on TwitterShare on Google+Share on RedditEmail a friend\n\nTHE votes are in, the surveys have been tallied and the first round of the NRL Premiership Tournament is in the bag.\n\nThere were a couple of shock losses, a couple of big wins and a couple of match ups that went right down to the wire.\n\nWe’ll kick off the quarterfinals with a quick recap of Round 1 before diving into the new match ups.\n\n• The closest match of the first round was the 2007 Storm and the 2013 Roosters. The Roosters lead for most of the voting period but Melbourne surged back over the weekend to take out the match with a 50.18% share of the vote — or by a margin of just nine votes.\n\n• The 2002 Roosters also went down in their other clash against the 2003 Panthers with Penrith winning another nail biter after getting 50.88% of the vote. In something of a shock result, both Roosters teams have been bounced in the first round.\n\n• Newcastle enjoyed the most lopsided victory in Round 1 when they belted the 1999 Storm after gaining 71.88% of the vote.\n\n• When our Random Match Generator (also known as picking the teams out of a hat) threw up the Manly vs. Manly clash in Round 1 it raised more outcry than a Daly Cherry-Evans backflip, but in the end the people of the Northern Beaches voted with their clicks and sent the 2008 Sea Eagles through to the quarterfinals. They trashed their 2011 counterparts after gaining 70.74% of the vote and given the feedback on Facebook and Twitter they’d be considered one of the favourites to go all the way.\n\n• Brisbane fans came out in force with the 2006 Broncos earning 62.66% of the vote to smack the 2005 Tigers, the 1998 premiers downing the 2014 Rabbitohs after getting 59.44% of the vote and the 2000 Broncos bringing the pain against the 2012 Storm, running away with 62.27% of the vote.\n\n• True to form, the 2004 Bulldogs are flying right under the radar and got past the 2010 Dragons with 55.38% of the vote.\n\nOn to the quarterfinals VETERAN: OUT: Pearce succumbs to hamstring injury\n\n2003 Penrith Panthers vs. 2006 Brisbane Broncos 2003 Penrith Panthers Season record: 21-6\n\nWins by 1-12: 12\n\nWins by 13+: 9\n\nAverage winning margin: 11.76\n\nWins over top eight teams: 13\n\nDespite surging to the minor premiership and winning an incredible 20 of their last 23 games, the 2003 Panthers were counted as title outsiders right up until grand final day. Their average winning margin of 11.76 is the lowest of any team still in contention but they have the equal highest number of wins over top eight sides.\n\n2006 Brisbane Broncos\n\nSeason record: 17-11\n\nWins by 1-12: Five\n\nWins by 13+: 12\n\nAverage winning margin: 17.47\n\nThe 2006 Broncos have the worst overall record of any of the teams remaining and are the only team left who lost more than 10 matches. They also boast the longest losing streak of any team left in the tournament after they dropped five matches on the trot between Round 18 and Round 23. Their average margin of victory is a respectable 17.47, which places them firmly in the middle of the pack, but the 2006 Broncos have the look of a team that was competitive without being dominant in the regular season who managed to hit form at just the right time to surge into the title picture.\n\n1998 Brisbane Broncos vs. 2007 Melbourne Storm 1998 Brisbane Broncos Season record: 21-6-1\n\nWins by 1-12: Seven\n\nWins by 13+: 14\n\nAverage winning margin: 24.48\n\nWins over top eight teams: 10\n\nAfter the first week of the Premiership Tournament it was clear that the 1998 Broncos were overwhelmingly strong title favourites and when we dig into the stats we can see why. They have the third greatest number of 13+ wins among remaining teams and the highest average winning margin. While these numbers are impressive, it’s worth remembering what kind of competition the NRL was in 1998. In the bloated, newly united competition there were 20 teams, which meant that the footballing talent was spread way too thin. This created a serious world of the haves and the have nots, and nobody had more than Brisbane. That’s not to say the 1998 Broncos were flat track bullies, but all stats need to be examined in the proper context.\n\n2007 Melbourne Storm\n\nSeason record: 24-3\n\nWins by 1-12: Nine\n\nWins by 13+: 15\n\nAverage winning margin: 19.21\n\nThe decision to include a Melbourne team that was over the salary cap was controversial to say the least, but their clash with the 1998 Broncos promises to be one for the ages. This Storm side have the best record of all remaining teams and the second highest number of 13+ wins. Throw in an equal-highest 13 victories against top eight teams and its easy to see why they’re one of the stronger teams still in contention. Winning 16 of their last 17 and outscoring their finals opposition 100-18 wasn’t too shabby either. MAGIC: SHARKNADO: Cronulla charter fan flight to Townsville \n\n2008 Manly Sea Eagles vs. 2001 Newcastle Knights \n\n2008 Sea Eagles\n\nSeason record: 20-7\n\nWins by 1-12: Three\n\nWins by 13+: 17\n\nAverage winning margin: 21.85\n\nWins over top eight teams: Nine\n\nWith the exception of the 1998 Broncos, no team got more love in Round 1 than the 2008 Sea Eagles. While they weren’t able to snag the minor premiership, they did record the highest number of 13+ wins among active teams with an incredible 17. They also have the second highest average margin of victory with 21.85, but notably only beat nine top eight teams all season, the lowest total among teams still in contention. One of the real strings to their bow remains their imperious run through the finals, where they outscored their opposition 110-12 in possibly the most dominant finals series ever.\n\n2001 Newcastle Knights\n\nSeason record: 19-9-1\n\nWins by 1-12: 10\n\nWins by 13+: Nine\n\nAverage winning margin: 19.23\n\nWins over top eight teams: 10\n\nStatistically, the 2001 Knights were the second best attacking team of all time (trailing only the team the beat in the grand final, the 2001 Parramatta Eels) but their pointscoring aptitude isn’t really reflected in the stats. Their average winning margin of 19.23 is good without being great and their 10 wins over top eight teams is of similar standard. This team definitely had an attitude that the best form of defence was more offence, while their 19-9-1 record is the second worst of any of the teams still in contention.\n\n2000 Brisbane Broncos vs. 2004 Canterbury Bulldogs 2000 Brisbane Broncos Season record: 21-6-2\n\nWins by 1-12: Nine\n\nWins by 13+: 12\n\nAverage winning margin: 19.05\n\nWins over top eight teams: 11\n\nThe 14-team competition that came about in 2000 meant that talent was more highly concentrated and, on the whole, teams had much more depth than they had in the chaotic Super League years. As a result, the 2000 Broncos average winning margin of 19.05 and 11 wins over top eight teams, which are both good enough for fourth among remaining teams, are ever more impressive. Minor premiers by six points, they might not have the prestige of their 1998 counterparts but they might fly under the radar and run all the way to the title.\n\n2004 Canterbury Bulldogs\n\nSeason record: 22-6\n\n1-12 wins: Nine\n\n13+ wins: 13\n\nAverage winning margin: 18.14\n\nWins over top eight teams: 12\n\nWith the second highest number of wins over top eight teams and the fourth most wins by over 13 points, the 2004 Bulldogs are arguably the most underrated team still in the tournament. While they finished second after losing the minor premiership to the Roosters on for and against, their 22 wins is the second highest among the remaining teams.", "source": "NEWS.com.au"}