{"published": "2015-09-26T07:02:44Z", "media-type": "News", "title": "India's Modi set to woo tech companies in Silicon Valley", "id": "7f38d555-5337-4978-8a54-7aa6113b5a9a", "content": "2:02 a.m. CDT \n \nBy Yasmeen Abutaleb \n \nSAN FRANCISCO (Reuters) - Indian Prime Minister Narendra Modi has documented his push to bring U.S. investments and jobs back to India on his Facebook and Twitter pages since landing in the United States this week, posting photos with the likes of former New York City Mayor Michael Bloomberg and group shots with Fortune 500 CEOs. \n \nThis weekend, his followers can expect a flurry of photos with tech leaders as he visits Silicon Valley and is due to meet with executives from Google Inc, Facebook Inc, Apple Inc and Tesla Motors. \n \nMuch of his agenda, aimed at deepening ties with the U.S. tech sector, will also focus on connecting with Silicon Valley's Indian diaspora. \n \nWhile Modi is likely to be received like a rock star in an area that is home to many of the world's biggest high-tech firms, some groups have protested his arrival and urged tech companies to boycott the visit. \n \nThe groups include Sikhs for Justice, which has called on its members to picket Facebook headquarters during a Facebook town hall, and the Alliance for Justice and Accountability. \n \nModi has been criticized for not doing enough to stop 2002 religious riots in the Indian state Gujarat that killed about 1,000 people, mostly Muslims, when he was chief minister of the state. He has vehemently denied any wrongdoing. \n \nModi is the first Indian leader to visit the U.S. West Coast in more than 30 years. His trip follows one by Chinese President Xi Jinping, who met with several tech leaders in Seattle earlier this week. \n \nThe Indian leader has said he sees the digital economy as crucial to bringing more growth and tech jobs to India. \n \nModi boasts an average 87 percent approval rating in India and he has more than 30 million \"likes\" on Facebook and 15 million Twitter followers, making him the second-most followed world leader after U.S. President Barack Obama. \n \nOn Saturday, he was scheduled to attend a dinner with 350 business leaders to discuss the world economy and its impact on India. \n \nSatya Nadella, Sundar Pichai and Shantanu Narayen, the Indian-born CEOs of Microsoft Corp, Google and Adobe Systems Inc, respectively, were among those due to moderate a panel discussion before Modi delivers a speech at the dinner. \n \nModi is also expected to meet with Apple CEO Tim Cook and visit Tesla headquarters. On Sunday, he was to visit Facebook and Google headquarters before appearing at an event at the San Jose Convention Center. \n \n(Reporting By Yasmeen Abutaleb; Editing by Tom Brown)", "source": "1440 WNFL"}