{"published": "2015-09-25T04:57:50Z", "media-type": "News", "title": "Memphis outlasts UC despite Moore's huge offensive night", "id": "8cc45a38-1851-4adc-95f6-3c89403f0afc", "content": "Autoplay \n\nShow Thumbnails \n\nShow Captions \nLast Slide Next Slide \nBearcats quarterback Hayden Moore (8) during the game against the Memphis Tigers at Liberty Bowl Memorial Stadium. (Photo: Justin Ford-USA TODAY Sports) \n\nMEMPHIS, Tenn. – Redshirt freshman Hayden Moore broke the 47-year-old University of Cincinnati single-game passing mark held by Bearcats great Greg Cook, but the bottom line was a 53-46 UC loss to Memphis here Thursday night. \n\nMoore completed 31-of-53 passes for 557 yards, four touchdowns and two interceptions in playing just over three quarters, in relief of injured starter Gunner Kiel. \n\nCook's record was 554 yards against Ohio University in 1968. UC had 752 total yards overall, breaking the school mark of 711 set against UConn in 2009. UC also set a school mark with 38 first downs. \n\nScoring summary, stats: Memphis 53, UC 46 \n\nMemphis running back Sam Craft scored from 3 yards out with 53 seconds left, breaking a 46-46 tie in the game-long shootout. It was the 12th lead change of the zany game. \n\nMoore quickly marched UC from its own 25 to the Memphis 19-yard line in the waning seconds. Then, Moore was spun around while attempting to pass and flung a pass forward, which hit the hands of UC running back Tion Green and then was intercepted by Memphis defender Leonard Pegues. \n\nWith 10 seconds left, that was that. \n\nMoore relieved Kiel, who was knocked out of the game with a head injury late in the first quarter . This injury one appeared more serious than the hit that took Kiel out of UC's last game. \n\nA crowd of 45,172 was watching at Liberty Bowl Memorial Stadium, along with a national television audience on ESPN. \n\nKiel left with 3:25 remaining in the first quarter, after a hit to his head by Memphis cornerback Chauncey Lanier. Memphis led 14-10 at the time. \n\nKiel was hurt while rushing for a 3-yard gain. Replays showed Lanier hit Kiel with his shoulder, and there was no targeting foul called. Meanwhile, Kiel was down on the field for several minutes before being taken off on a cart. \n\nUC spokesman Ryan Koslen said Kiel later was awake and moving all four limbs in the Bearcats locker room. Kiel was taken to a Memphis hospital for further evaluation and his parents were with him, but there was no further update from UC. \n\nKiel's playing status had been uncertain this week, after he also left with an injury during UC's 37-33 win at rival Miami University last Saturday. \n\nUC coach Tommy Tuberville initially indicated Kiel had suffered a head injury against Miami, but later said it was more to Kiel's shoulders. \n\nThursday's game matched the preseason favorites to win the American Athletic Conference East (UC) and West (Memphis), as voted by league media. UC also was voted to win the inaugural AAC championship game, which will be Dec. 5. \n\nUC fell to 2-2 overall and 0-2 in the AAC East. Memphis is 4-0 overall and 1-0 in the AAC West, and the Tigers were a 10-point favorite. \n\nMemphis also entered with a 10-game overall winning streak, dating back to last year. \n\nUC entered with a seven-game winning streak in road AAC games, dating back to 2013. \n\nKiel scored on a 4-yard run as UC took a 7-0 lead just 1:44 into the game. The score came shortly after a fumble by Memphis running back Craft, with the recovery by UC linebacker Eric Wilson at the Memphis 36-yard line. \n\nMemphis answered with a 59-yard interception return for a touchdown by defensive back Arthur Maulet, as Kiel threw the ball short. \n\nMaulet had nothing but open field ahead, and the Liberty Bowl crowd leaped to its feet as Maulet raced home to tie it 7-7 with 10:34 left in the first quarter. \n\nAndrew Gantz put UC back ahead 10-7, with a 35-yard field goal with 5:07 left in the first quarter. \n\nMemphis went up 14-10 on an 82-yard pass from quarterback Paxton Lynch to wide receiver Anthony Moore with 8:42 left in the first quarter. \n\nKiel was knocked out with 3:25 left in the first quarter. Redshirt freshman Hayden Moore replaced Kiel, as he did last week against Miami. \n\nMoore threw a 68-yard touchdown pass to UC senior wide receiver Chris Moore (no relation) to give UC a 17-14 lead with 14:06 left in the second quarter. \n\nMemphis went back ahead 21-17 on a 9-yard run by receiver Mose Frazier, off of a straight handoff with 11:03 left in the second quarter. \n\nGantz drew UC within 21-20 on a career-long 49-yard field goal with 9:14 left in the second quarter. \n\nGantz put UC ahead 23-21 on a 32-yard field goal with 5:02 left in the second period, but that lead did not last long. \n\nMemphis went ahead 28-23 on a 4-yard TD run by Jarvis Cooper less than a minute later, set up by a 61-yard pass play. \n\nUC regained the lead at 30-28 on a 21-yard pass from Moore to Shaq Washington, with 1:46 left in the second quarter. \n\nMemphis put more defensive pressure on Moore in the second half, as the scoring pace slackened for both teams. \n\nMoore threw an interception that put Memphis at its own 48, and the Tigers took a 31-30 lead when Jake Elliott hit a 40-yard field goal with 3:36 left in the third quarter. \n\nUC regained the lead 33-31 on the fourth field goal of the game by Gantz, this one from 36 yards with 1:27 left in the third quarter. \n\nMemphis took the lead again, 38-33 on an 8-yard TD pass from Lynch to tight end Alan Cross with 13:30 left in the game. That was the ninth lead change of the night. \n\nUC marked the 10th lead change on a 40-yard pass from Moore to wideout Max Morrison with 10:02 left. A two-point conversion pass failed, leaving UC up 39-38. \n\nLead change No. 11: Memphis with a 5-yard TD run by running back Sam Craft, and a two-point conversion run by Lynch gave the Tigers a 46-39 lead with 7:07 left. \n\nUC tied it 46-46 on a 30-yard TD pass from Moore to Morrison with 5:56 left, with Gantz adding the tying point with his PAT kick. \n\nWith 2:22 left, UC's Mike Tyson appeared to force and recover a fumble at the Memphis 33-yard line. But, a replay review awarded the ball back to Memphis. \n\nUC entered the night ranked No. 7 nationally in total offense and Memphis was No. 8. The Tigers also were No. 5 nationally in scoring offense at 54.0 per game. \n\nBOONE OUT: UC sophomore running back Mike Boone (ankle) did not make the trip. Boone led UC last week with 118 yards rushing against Miami University, but he left that game with a tender ankle. \n\nEntering Thursday, Boone was No. 2 on the team in rushing with 220 yards and tied for the team lead with three touchdowns. \n\nRead or Share this story: http://cin.ci/1FkcYkh", "source": "Cincinnati Enquirer"}