{"published": "2015-09-05T06:00:11Z", "media-type": "News", "title": "Lotus denies reports of pre-Singapore team collapse", "id": "61b5e0f0-b0fa-45ee-8fd1-af7a5d53d235", "content": "Sep.5 (GMM/Inautonews.com)  Lotus has hit back at reports Monza could be the last race in the Enstone team’s long history. \n \nNeither side can hide now that discussions about a buyout by Renault are taking place, as many of the details are being leaked to the media. \n \nFrance’s RMC Sport, for instance, is reporting that alongside Alain Prost at the helm of the new Renault works team could be Frederic Vasseur, the current boss of the GP2 team ART. \n \nVasseur “refused to confirm this information,” RMC insisted. \n \nThat is because Renault CEO Carlos Ghosn is yet to give his definitive “yes” to the buyout, even though detailed negotiations were reportedly taking place as recently as late this week. \n \nMeanwhile, it is said that time is running out for the now cash-starved Lotus team, with some saying Enstone does not even have the money to travel from Monza to Singapore for the next race. \n \nBut team CEO Matthew Carter said at Monza: “I can guarantee you that we’ll be at Singapore.  The sea freight container has left, our air freight will leave next week. \n \n“We will be in Singapore,” he insisted.  “As far as the rest of the races this season, we have a budget in place and we will operate to that budget and will be at all the races.” \n \nDeputy boss Federico Gastaldi, meanwhile, told Speed Week he is confident good news about the Renault talks will soon be forthcoming. \n \n“This is no official statement,” he said, “but my own gut feeling is that the parties could and should be able to announce something (soon). \n \n“If Renault has made the decision, then the official confirmation should not be long in the coming.  We need to work as quickly as possible on the new car,” added Gastaldi.", "source": "Inautonews"}