{"published": "2015-09-26T08:00:21Z", "media-type": "News", "title": "Record total handed out for annual Community Chest Awards", "id": "5c0a0d4f-bf15-4721-8ba9-ea7d061c19d3", "content": "Some of the most inspirational volunteers in Sussex received their share of £21,500 at the Community Chest Awards 2015 last night (Friday September 25).\n\nThe chest is funded by brewer Hall & Woodhouse, which owns a string of pubs in the county, and is supported by Sussex Newspapers, the publisher of this newspaper.\n\nLast week the Hangleton Manor in Hove hosted the eighth annual awards which were attended by 80 people from across East and West Sussex including dignitaries, volunteers and representatives from more than 30 charities and good causes.\n\nHall & Woodhouse chairman Mark Woodhouse led the proceedings on the night revealing that his company, which has been in his family for seven generations since its foundation, had decided to aid more groups than ever before.\n\nHe said: “It was a record night as we have never given away as much money to as many organisations as we have tonight and that record will be in place until next year.\n\n“Across our areas in Dorset and Sussex we have gone from a pot of £35,000 to £50,000. We have been able to help some really good organisations who are doing some really good work.\n\n“It is always nice to see people from these organisations collecting their awards and enjoying good food and drink.”\n\nThe grants given out ranged from £300 to £1,500 with organisations pledging to spend the cash on anything from play equipment to chair trolleys for a village hall.\n\nOne of the largest awards went to Chichester Down Syndrome Support Group, which will be spending the money on speech therapy for some of the young people it supports.\n\nPresent on the night were Nick and Kath Lake, parents of a child with Down’s Syndrome, one of 60 families across the Chichester, Bognor Regis and Midhurst areas to be supported by the group.\n\nMrs Lake said: “We are delighted to get such a big award as it will make a real difference for our children.”\n\nSafe in Sussex, which runs two refuges in the Worthing area for victims of domestic violence and their children, was handed £1,000 which will spent to buy new playroom equipment.\n\nJanet St Pierre, who collected the award with fellow child support worker Tara Gambling, said children were sometimes the forgotten victims of domestic abuse.\n\nShe said: “The women get an awful lot of support but sometimes the children just have to get on with it. They have been affected by it and what they have seen and have had to move from outside the area. They have been taken from friends, families and schools.\n\n“We give them one to one support.\n\n“We told the children where we coming tonight and and said we might get some money and we asked them what they would like to spend the money on.”\n\nPerhaps the newest organisation to receive an award was Oaktree Farm Care in Copsale near Horsham, which received £500 just one month after being granted charitable status.\n\nAmanda and Andrew Churcher set it up as a social enterprise after being frustrated by the lack of support for young adults with special learning needs. Their centre in the middle of the West Sussex countryside allows those they support to learn new skills.\n\nAn emotional Mrs Churcher revealed it was the first grant they had received.\n\nShe said: “We are so pleased, we just can’t believe it.”\n\nGary Shipton, editor-in-chief of Sussex Newspapers, said: “We have always supported what Mark Woodhouse and his team do with the community chest as it is such a wonderful initiative.\n\n“I have met so many people tonight who are genuinely touched by the awards they have received for their organisations. It is us who should be thanking them.”\n\nClubs and organisations which received awards this year are:\n\n1st Langley Green Scout Group £750; \n\n5th/10th Horsham Scouts £300; \n\nAdur Special Needs Project £750; \n\nThe Arundel Players £600; \n\nThe Base Skatepark CIC £1,000; \n\nBell Tower Drop In £800; \n\nBlueprint 22 £1,500; \n\nBognor Regis District Scout Council £700; \n\nBognor Regis Stroke Support Group £500; \n\nCancer United £750; \n\nChichester Down Syndrome Support Group £1,500; \n\nChichester Stroke Club £500; \n\nContact the Elderly £400; \n\nDavison Worthing Youth Concert Band £500; \n\nElectric Storm Youth Ltd £400; \n\nEpilepsy Lifestyle £700; \n\nFriends of Wrenford £300; \n\nHorsham & District and Billingshurst Bar Billiards Leagues £500; \n\nChichester Information Shop for Young People £300; \n\nNASS Bognor Branch £500; \n\nOaktree Farm Care £500; \n\nThe Point, Scope West Sussex £1,500; \n\nRedford Village Hall £1,000; \n\nRipe and Chalvington Village Hall £500; \n\nRudgwick Friendly Club £400; \n\nSafe in Sussex £1,000; \n\nSouthwater Village Hall £300; \n\nStorrington Area Help Scheme £500; \n\nSasbah £1,000; \n\nYapton & Ford Village Hall £500; \n\nYoung At Heart Over 60s Club £500; \n\nYouth of Bognor £500\n\nDon’t miss out on all the latest breaking news where you live.\n\nHere are four ways you can be sure you’ll be amongst the first to know what’s going on.\n\n1) Make our website your homepage \n\n2) Like our Facebook page \n\n3) Follow us on Twitter\n\n4) Register with us by clicking on ‘sign in’ (top right corner). You can then receive our daily newsletter AND add your point of view to stories that you read here.\n\nAnd do share with your family and friends - so they don’t miss out!\n\nAlways the first with your local news.\n\nBe part of it.", "source": "Bognor Regis Observer"}