{"published": "2015-09-25T18:43:00Z", "media-type": "News", "title": "Postiga looks forward to his ISL debut", "id": "1beea6ed-1533-4a1b-9d30-da9cd55583ac", "content": "Comment  ·  print ·  T  T \n\nT+·  T- \n\nPTI \n\nHelder Postiga. \n\nTOPICS \n\nAtletico de Kolkata introduced the Portuguese World Cupper Helder Postiga as the “co-striker with (Cristiano) Ronaldo and the youngest marquee player among the Hero Indian Super League teams.” \n\nThe 33-year-old striker, who played the European championship final in 2004 and the 2006 World Cup alongside Cristiano Ronaldo, is looking forward to his ISL debut. “I have enjoyed a good partnership with (Iain) Hume in the pre-season training. He is a good player and works very hard. I hope to see our partnership helping the team in the tournament,” Postiga said. \n\nPostiga said he was eager to emulate the deeds of Spanish World Cupper Luis Garcia, whose exploits last season earned him the award ‘Most Exciting Player’ of the tournament. Garcia, then aged 36, encountered some injury problems and missed a few matches which apparently prompted the defending champion ATK seek a younger marquee player. \n\nPostiga, who played for a prominent Spanish La Liga club Deportivo La Coruna in the previous season, said he felt fit and enjoyed the month-long pre-season training in the high altitude venue in Segovia in Spain. \n\n“(Luis) Garcia had good season and helped the team to the championship last year. I look forward to do something better,” Postiga said as the team prepared to start its training at the Mohun Bagan ground on Friday. \n\n“I find my Indian colleagues quite good. I was surprised at the way they performed and the hard work they put in during the pre-season training,” Postiga said. \n\nAttacking football \n\nHead coach Antonio Habas was categorical about his approach as the defending champion and said his team would play attacking football. “We will take each match at a time and progress accordingly. My immediate plan is to play against Chennaiyin FC (on October 3 in Chennai) where we look to start with a win,” Habas said. \n\n“My team has shaped up well in the pre-season training where I found the Indian players showing fantastic attitude and fitness. This is a very good combination and I hope it will be carried well into the tournament,” Habas said. \n\nKeywords: Indian Super League 2015, ISL 2015, Postiga, Atletico de Kolkata", "source": "The Hindu"}