{"published": "2015-09-08T08:58:00Z", "media-type": "News", "title": "CU fin. advisers more productive than bank counterparts: study", "id": "11ac8246-0c9b-4510-b93b-19f6564dbbfb", "content": "CHAPEL HILL, N.C. (9/8/15)--For the first time, financial advisers in credit unions have averaged more investment revenues than brokers owned by large banks, according to a study released last week by Kehrer Beilan Research & Consulting (KBR&C). \n \nIn 2014, the average credit union financial adviser produced $444,873 in investment services revenues, slightly more than in-house brokers at large banks, the Chapel Hill, N.C.-based firm said in The 2014-2015 Kehrer Bielan Credit Union Investment Services Benchmarking Study. \n \nIt was the first time in the three years the study has been conducted that credit union advisers out produced bank advisers. \n \n“Although unprecedented, we could have seen this coming,” said Tim Kehrer, director of the survey and senior research analyst at KBR&C. The average financial adviser productivity of credit unions has improved three years in a row, increasing by 27% since 2012 and outpacing the banks’ growth, he said. \n \nGross investment service revenues per adviser improved 16% in credit unions, compared with 6% in banks, from 2013 to 2014, \n \nDriving the growth was referrals of credit union members to financial advisers in credit unions. The average number of referrals per adviser rose 41% over 2013 referrals. Credit unions in the top quartile of adviser productivity provided 19% more referrals relative to their size than those with less productive advisors. \n \nIn the study, the typical credit union referred just 1.5% of its member households to its advisors during 2014, indicating that “the number of advisers is not keeping with the growth in membership,” said Kehrer. \n \nThe average credit union surveyed deployed one financial adviser for every 20,457 member households, a 9% increase from 2013. \n \nThe study is based on data from 917 credit unions with investments services and an in-depth study of 46 credit unions about how their investment services work. The results were compared with a similar study of 17 large banks that own broker dealers.", "source": "CUNA News Now"}