{"published": "2015-09-29T13:30:00Z", "media-type": "News", "title": "PE Pulse Network helps ACT teachers deliver quality physical education", "id": "31513ca4-5bd2-4a44-a144-5429a5d7512b", "content": "The PE Pulse Network connects teachers to external program providers in a bid to get – and keep – more youngsters moving. \n\nConfidence is key and, along with skill level and knowledge, teachers need it to deliver the highest-quality physical education.\n\nThis is Macquarie Primary School teacher Amanda Hawkins' philosophy.\n\nShe believes the recently launched PE Pulse Network will help ACT teachers provide engaging and effective physical activity options.\n\nIt comes as polls show . The PE Pulse Network was formed by government and non-government organisations from the sport, recreation and education sectors. Its new website connects teachers to external program providers in a bid to get – and keep – more youngsters moving.\n\n\"What it has really done for us is provide a tool for us to access resources as well as different sporting agencies within the ACT,\" Ms Hawkins said.\n\n\"So, for instance, if I wanted to teach some rugby skills and I wasn't sure on how to do that, I could contact the website, which would put me in touch with different rugby organisations within Canberra that offer resources or clinics at the school.\"\n\nIt linked users to quality agencies that offered lesson plans and skills activities for all year groups, \"so you're not having to scroll through Google searches\", she said.\n\nA crucial part of tackling childhood obesity in schools was teacher participation, Ms Hawkins said.\n\nThe PE Pulse program has partnered with national health promotion charity Blue Earth, which stresses the benefits for children when teachers work alongside them.\n\n\"That's setting the model and it's also a fun way for teachers and kids to interact; it builds relationships with them,\" Ms Hawkins said.\n\nThe website updates teachers on sporting events and challenges in the ACT, such as the . Macquarie Primary School took part in the challenge, which encouraged children to do 60 minutes of exercise a day, along with 54 other ACT primary schools.\n\nIts completion coincided with the launch of the ACT government and Physical Activity Foundation's Active Workplace Challenge, urging adults to get fit.\n\nParents can also use the PE Pulse website, which was launched by Recreation Minister Shane Rattenbury and Education Minister Joy Burch in August, to contact sports agencies and learn about events. The story first appeared on The Sydney Morning Herald.", "source": "Naracoorte Herald"}