{"published": "2015-09-10T11:35:20Z", "media-type": "News", "title": "British grocer Waitrose sees some light amid sector gloom", "id": "0335e39b-dbc3-408e-8bbc-7d21a0804d1c", "content": "LONDON British retailer John Lewis's upmarket grocer Waitrose reported on Thursday that trade was slowly improving as new loyalty offers, cafes and online click-and-collect demand helps attract shoppers in an industry besieged by a price war. \n\nBritain's big four grocers Tesco ( TSCO.L ), Asda ( WMT.N ), Sainsbury's ( SBRY.L ) and Morrisons ( MRW.L ) are all being squeezed at one end by Waitrose and upmarket rival Marks & Spencer ( MKS.L ) and at the other end by discounters Aldi and Lidl [LIDUK.UL]. \n\nAs a result the major players are improving service and cutting prices to stay competitive, much to the detriment of profits, but Waitrose said on Thursday cost controls and market share gains had helped keep underlying operating profits broadly flat at 135.5 million pounds in the six months to Aug. 1. \n\n\"We are on a slowly improving trajectory, both in terms of average item price and in terms of customer spend and confidence,\" Waitrose Managing Director Mark Price said, pointing to an average of 280,000 more customer transactions a week than a year ago. \n\n\"We are not going to see a big spike all of a sudden but I would say it is gradually improving,\" Price said, in contrast to gloomier outlooks from its bigger rivals. \n \nBritain's sixth biggest grocer, Waitrose has grown its market share to 5.1 percent while others have lost ground, retaining its wealthier middle class clientele and pulling in others with offers and price matches on products sold elsewhere. \n\nPrice cuts pushed underlying sales down 1.3 percent in the half, though the trend was improving week by week the firm said. \n\nThat compared to a 2.7 percent fall at Britain's fourth biggest supermarket Morrisons ( MRW.L ), which reported a 35 percent drop in profit on Thursday. \n \n\"Waitrose should continue to out-perform the market with its new stores, strengthened online presence and ongoing innovative approach seemingly pleasing the majority of its customers,\" Shore Capital analyst Clive Black said. \n\nIn July Waitrose launched a scheme whereby loyalty customers can choose 10 products from a list which they can save 20 percent on, with 700,000 shoppers now signed up. \n \nWaitrose's half-year results were part of those published on Thursday by parent group John Lewis Partnership[JLPLC.UL], which warned pension charges could cut the group's full-year profits by up to 21 percent, forecasting a range of 270 and 320 million pounds. It made a profit in the previous year of 342.7 million pounds. \n\nIts first-half pretax profit before exceptional items fell 26 percent to 96.7 million pounds due to the pension problem and higher costs at the John Lewis department stores business. \n\nUnderlying trade at John Lewis was solid, up 3 percent in the half, as strong demand for fashion and home products offset weakening demand for items such as tablets and TVs. \n\n(Editing by Sarah Young and Greg Mahlich)", "source": "Reuters UK"}