{"published": "2015-09-02T13:39:17Z", "media-type": "News", "title": "Dad's exchange with stranger about paint for his daughter's room goes viral", "id": "9019e802-7063-4b97-947a-e82c1b8ddb68", "content": "Dad texted a stranger by accident about painting daughter's room blue Anonymous correspondent gave him advice on interior design  Father finally decided between turquoise and periwinkle for three-year-old Their exchange has been viewed 500,000 times on Imgur   \nDeciding a colour for a child's bedroom can be a challenge for many parents as they bicker over whether yellow is gender neutral, or if they should stick to traditional pink or blue. \n\nBut one father, from the US, was in luck when a complete stranger offered him interior decorating advice after texted the wrong number by accident. \n\nAnd realising he had messaged someone with great taste, this dad, who hasn't been identified, continued to press for more advice about the best shade for his three-year-old's room.   \n  \nA father sent a frustrated message to what he thought to be his friends number explaining that the mother of his child wouldn't allow him to paint their daughter's room blue and a stranger picked up the text \n\nThe exchange began after the angry dad expressed irritation that he was being told he couldn't paint his little girls' room in the hue he wanted.    \n\nHell bent on painting his little girl's room blue, he texted a friend to vent his frustration after his daughter's mother said his favoured colour wasn't right for a girl's room. \n \nThe thread of texts has since been shared on Imgur by an unknown user.  \n\nIn initial message he writes to a companion: 'D tryna tell me I can't paint Tamiya's room blue cuz she's a girl. F*** this.' \n\nThe stranger then responds: 'Wrong number but hell yeah. Paint that girl's room blue.' \n  \nThe recipient was happy to offer advice on decorating and encouraged the dad to paint the room blue \n\nAfter apologising to the recipient the dad then takes the opportunity to ask the benevolent stranger for some interior decorating tips. 'Hey can I ask a real quick? You think turquoise or that periwinkle for a 3yr old?' \n\nThey respond: 'I think more a toned down turquoise. Not too loud, because bedrooms are supposed to be chill, you know?' \n\nThe father then goes as far to send the receiver a colour swatch asking their opinion on the shade of blue.  \n\nThey remark: 'That's pretty. It could be a little dark though, depending on the size of room and furniture.' \n\nTo which he responds: 'Room's okay size. There's a big window on one wall and just got her some white furniture. The kind that looks woven together.' \n   \nThe father seemed extremely grateful for the stranger's interior decorating advice  \n\nThis is a red flag to the interiors-minded stranger who asks, 'wicker?' \n\nThe dad replies that it is and it's going to get dusty, but his anonymous correspondent replies, 'Probably but it's cute.'  \n\nThe stranger suggests a certain colour way: 'I'd do the colour you picked on the wall across from the window and maybe a lighter colour on the other three walls?' \n\nThe father agrees with the suggestion adding: 'My baby girl's gonna have her blue room and it's gonna look tight as hell.  \n\n'Yo thanks for your help. Sorry for keeping you up.' \n\nThe stranger finishes the conversation: 'No problem! I hope everything goes well. Night!' \n\nThe amusing exchange has since been shared across several social media platforms including Twitter and", "source": "Mail Online UK"}