{"published": "2015-08-15T22:44:45Z", "media-type": "Blog", "title": "Door Color Ideas: 10 Pretty Blue Doors", "id": "add3b30c-9a07-454b-a08f-400d3a55a8ea", "content": "I love a pretty statement door.  So a few years ago, I wrote a post about front door color ideas that’s still popular this time of year.  (See: Front Door Color: 10 Fabulous Front Door Colors (& their paint names!)) Since then, I’ve been obsessed with blue doors in particular. Actually, I’m kinda coo-coo crazy about them. Last year, I painted our front door a pretty shade from Behr called Dayflower (MQ3-54). Blue is such a great statement colour for a door, and it looks great with so many different exterior textures and colors. For curb appeal, you just can’t go wrong with a blue door.   So this time around, I thought I’d round up 10 pretty blue door color ideas, including everything from airy aqua to stately navy blue – and everything in between. (A word about pinning: If you plan to pin any of these pretty doors to Pinterest, pop of over to the source (just click each image), and pin from there.  That will send any Pinterest traffic directly to the photo owners’ blog!) 10 Pretty Blue Door Color Ideas:   1. Behr Marquee Dayflower Behr Marquee Dayflower 2. Behr Evening Hush Behr Evening Hush from HouseTweaking (Click image for source) 3. Behr Harbor Behr Harbor, from iheartorganizing (Click image for source) 4. Behr Club Navy Behr Club Navy, from Migonis Home (Click image for source) 5. Behr Oslo Blue Behr Oslo Blue, from diynetwork (Click image for source) 6. Behr Cool Jazz Behr Cool Jazz, from This Old House (Click image for source) 7. Behr Dragonfly Behr Dragonfly, from Magnolia Bend Drive (Click image for source) 8. Behr Whipped Mint Behr Marquee Whipped Mint, from Liz Marie Blog, (Click image for source) 9. Behr Mermaid Net Behr Mermaid Net, from The Painted Chandelier (Click image for source) 10. Behr Viking Behr Viking, from Lola’s Key (Click for image for source) So, pretty -right? Here are the paint names / codes:   Summer is winding down, but there’s still plenty of time to paint if you’ve been inspired by one of these cuties. Personally, I’m loving on that Oslo Blue door, so there might be a door update in my future too! Until next time, K. P.S.: Sponsored Content – As part of the 2015 Behr DIY Expert Blogger Program, Behr Paint compensates me for my time to prepare blog posts about my experience with and/or opinions on their products. However, the idea for this article – and all viewpoints expressed here – are my own, and have not been directed by Behr in any way.   Related", "source": "A Pop of Pretty Blog (Canadian Home Decorating Blog - St. John's, Canada)"}