{"published": "2015-09-10T11:59:47Z", "media-type": "Blog", "title": "2015 Fantasy Football IDP Sleepers", "id": "0e5117bb-6027-4b6a-aa69-a31e80c0f9e6", "content": "View image | gettyimages.com At this point, I'm assuming you've already drafted your fantasy teams for the 2015 NFL season. Did you miss out on the IDP you wanted? Does your team look weak at one of the IDP position groups? Maybe you waited on LB to snag J.J. Watt? Maybe you went best player available and ended up with some low ceiling players at the DB position? Fear not! I've got your lottery ticket right here. Following are some players from each position group who may not have been drafted at all in your league who I feel are flying under the radar and are prepped for big seasons. Dump one of your low ceiling guys and take a chance on one of these fellas. Defensive Backs Bradley McDougald - S - TB The third year McDougald racked up 36 solo tackles over the final 6 games of the 2014 season. 36! Now the full time starter at free safety for the Bucs, this guy is primed for a HUGE year. If we extrapolate last year's numbers to a full season, that's over 90 tackles! You can also expect a handful of interceptions to be sprinkled in. I don't think the ceiling is super high for this guy, but I do think you will get a steady stream of tackles throughout the season. Drop one of your more high-variance DBs and take a chance on Bradley stepping up his game even further. Travis Carrie - CB - OAK The Raiders cut Trindon Holliday. You know what that means, right? We've got a full-time CB who returns both KICKS and PUNTS! Not often are we seeing that in today's NFL, compared to days past. If your league grants return yardage points, then I'm assuming Adam Jones may have already been selected. Well, joke's on that owner, as Pac Man Jones is no longer returning kickoffs this year. If you drafted Jones expecting last year's production, I highly suggest dropping Jones and adding Carrie. I'm also guessing Carrie will chip in with about 55 tackles this season. Defensive Linemen Jacquies Smith - DE - TB Already a favorite of Tampa Bay beat writers, Smith is a sure to find his way into the hearts of those fantasy owners in sack-heavy leagues. If you missed out on a top-tier DE in a sack heavy league, I think I may have found an adequate replacement for you. After bouncing around the NFL for his first couple seasons, Smith started 7 games for the Buccaneers last season and recorded 6.5 sacks. He flashed serious dominance View image | gettyimages.com and all reports are that that trend is going to continue. Demarcus Lawrence - DE - DAL A lot of the focus on the Dallas Cowboys defensive line has been aimed at controversial 2015 2nd round draft pick Randy Gregory and the \"troubled\" Greg Hardy. Let's not forget Lawrence, who was drafted in the 2nd round of the 2014 draft, but suffered an injury in training camp that caused him to miss valuable development and playing time. Now, the broken foot is all healed up. Furthermore, Lawrence had a strong showing in the playoff last year and is looking to build on that success. But wait, there's more! He's being moved to the left side this season, as Gregory and Hardy are both natural right ends. Did I fail to mention that Lawrence loves rushing from the left edge? If that doesn't scream \"Breakout!\", I don't know what does. Linebackers Alex Okafor - LB - ARI The Will linebacker in Arizona's 3-4 scheme, Okafor is going to do a lot of things this season for the Cardinals. The thing I'm most excited about are his sack numbers. In 12 games last year, he recorded 8 sacks. His tackle numbers weren't the greatest, but I expect that to rise this year. Okafor has had to fight hard to stay on the Card's roster, and I believe that drive is really going to pay off this year. The coaching staff loves him, and he's been a beast so far against opposing one's in the preseason. Okafor is a player who has shown steady growth since an injury kept him off the field nearly his entire rookie season two years ago and the early part of last year. His production has been sporadic, but when he has showed up it has been a sight to see. I expect more consistency from him this year in what is essentially his sophomore season. Bonus   Jabaal Sheard - DE - NE The Patriots were high on Sheard when Cleveland selected him in the 2011 NFL Draft. How things would have been different for Jabaal... It's a bit sad to imagine. Instead of Sheard, the Patriots ended up with Chandler Jones and Rob Ninkovich bookending their defensive line. Needless to say, the Pats probably didn't regret missing out on Jabaal as much as Jabaal wished he was drafted by New England. Stuck in Cleveland, Sheard's numbers have gone down each season since his first. But you can hardly blame the guy; he was on horrible teams that changed defensive schemes numerous times. He was moved around unnaturally and stifled when his talent would have been surely maximized by the likes of New England. Well, he's there now and although he's behind Rob and Chandler he will see playing time. Do you like taking chances? If you do, here is your super sleeper IDP. He's one injury away from beasting all over opposing offensive lines.", "source": "We Talk Fantasy Sports"}