{"published": "2015-09-19T12:23:57Z", "media-type": "News", "title": "Rugby World Cup 2015: Jack Lam completes worldwide journey for World Cup dream", "id": "33d13440-8fce-4d16-b4aa-592702807c6c", "content": "By Sept. 19, 2015, 10 p.m. Living the dream: Jack Lam, of Samoa, dives over for a try during a World Cup warm-up match against the Barbarians. Photo: David Rogers \nexit \nBATH: He was one of Australia's best juniors and played with Quade Cooper, Kurtley Beale and David Pocock, but Jack Lam thought his World Cup dreams were dead when two countries passed by. \n\nThe former Queanbeyan Whites star and St Edmund's College graduate grew up wanting to play for the Wallabies before switching allegiances to his country of birth, New Zealand. \n\nBut when both failed to recognise his international talent, a twist of fate and family ties landed the hard-hitting flanker a spot in Samoa's World Cup campaign. \n\nLam is gearing up for his first World Cup and says the Samoans are driven by the belief they can go on a giant-killing run in the tournament to shock their more fancied rivals. \n\nLam's journey to the World Cup has taken him around the globe and it has made his arrival in England even sweeter. \n\n\"I'm still pinching myself, but it's finally starting to sink in,\" Lam said. \n\n\"I grew up wanting to play for the Wallabies and then when I moved to New Zealand and joined the [Wellington] Hurricanes I wanted to play for the All Blacks. \n\n\"But my uncle was playing for Samoa and he would always have a quiet word to me about it … he asked if I would come across and play for Samoa and in 2013 I got my chance.\" \n\nHad things been different, Lam could have been competing with Pocock and Michael Hooper for the Wallabies' openside flanker spot. \n\nHe was picked in the same Australian under-20s team as Pocock, Cooper, Beale and best mate Christian Lealiifano and went to school with Anthony and Saia Faingaa. \n\nLam was part of the ACT Brumbies' academy but was overlooked for a Super Rugby contract. \n\nThat's when he decided to move back to New Zealand and his form saw him land a deal with the Hurricanes. \n\nHe has since moved to England to join Bristol and says his rugby grounding with the Whites and St Edmund's has been the driving force in achieving his rugby goals. \n\n\"My whole family is still in Canberra, it's still my home,\" Lam said. \n\n\"There will be a little pocket of Samoan support cheering during the World Cup … well it won't be so little when the family and aunties and uncles get together.\" \n\nSamoa has a reputation of being World Cup specialists and causing upsets. \n\nThey toppled Wales in the 1991 tournament and beat the Wallabies in the lead-up to the 2011 campaign. \n\nSamoa is in the same pool as two-time champions South Africa, Scotland, Japan and the United States. \n\n\"We have to aim high, our goal is to win the pool and get to the next stage,\" Lam said. \n\n\"We can't take the big hits and flamboyance away from our game, but we need some smarts and wit about what we're doing. \n\n\"We've got to change the perception around the world that we don't just put on hard tackles for 20 minutes. We want it for the whole game.\" \n\nThe only thing that could make Lam's debut tournament better would be having Lealiifano playing for Australia. \n\nThe pair forged a bond as teenagers, despite living in different cities, and their friendship grew after Lealiifano's father, Tavita, died on the eve of an Australian schoolboys tour. \n\nLam provided Lealiifano with the support he needed and he hasn't given up hope that the Brumbies playmaker will get a late call if the Wallabies are hit by injuries. \n\n\"I thought Christian had a strong season, I was disappointed for him but he's not one to dwell on things,\" Lam said. \n\n\"You never know, he might be Australia's version of [All Blacks 2011 World Cup-winning flyhalf] Stephen Donald and get the last-minute call to get here.\" \n\nThe story Rugby World Cup 2015: Jack Lam completes worldwide journey for World Cup dream first appeared on The Sydney Morning Herald .", "source": "Central Western Daily"}