{"published": "2015-09-03T00:36:00Z", "media-type": "Blog", "title": "Dozens killed or injured in bombings at mosque in Yemen", "id": "03faae28-b9ac-4cfa-9a66-24dc7cc01fcf", "content": "A suicide bombing in a Shiite Muslim mosque and a car bomb blast outside killed at least 35 people in Yemen’s capital and injured more than 100 on Wednesday, officials said, and Sunni Muslim Islamic State militants claimed responsibility. The carnage came amid the continuing campaign of airstrikes by a Saudi-led military coalition, now in its sixth month. Bombardment and ground clashes have killed more than 4,500 people, about half of them thought to be civilians. Dozens killed amid airstrikes and fighting in key Yemeni city Zaid al-Alayaa and Laura King Fierce fighting in the crossroads city of Taizz in Yemen killed dozens of people, officials and aid groups said Friday, with airstrikes by a Saudi-led military coalition and shelling by Houthi rebels blamed for deaths. Fierce fighting in the crossroads city of Taizz in Yemen killed dozens of people, officials and aid groups said Friday, with airstrikes by a Saudi-led military coalition and shelling by Houthi rebels blamed for deaths. ( Zaid al-Alayaa and Laura King ) Sana, Yemen’s capital, remains under the control of Shiite-rooted Houthi rebels, although the Saudi-led coalition has managed to wrest some territory from the insurgents in recent weeks.\nWednesday’s attack, which took place during evening prayers at a mosque in the Jiraf district near the international airport, came hours after unknown assailants killed two Yemeni Red Cross workers in an attack north of Sana.\nThe car bomb was apparently timed to kill and maim would-be rescuers arriving at the scene, said Tamim Shami, a spokesman for the Ministry of Health. As darkness fell, searchers were still digging in the rubble for bodies or survivors. cComments Got something to say? Start the conversation and be the first to comment. Add a comment 0 The claim of responsibility by Islamic State, which considers Shiites to be heretics, was circulated on social media. Both the extremists of Islamic State and militants of Yemen’s Al Qaeda affiliate have sought to consolidate their strength as fighting between Houthis and pro-government forces has raged across the country. Officials called urgently for blood donations, as hospitals are desperately short of blood as well as vital medical supplies. A witness who was close by when the twin explosions occurred described a nightmarish episode, with injured and bloodied worshipers staggering out of the ruins of the mosque only to be caught up in the second blast.\n“When the first explosion happened, people and ambulances rushed to the area,” he said. “And moments later we heard another explosion.” At least two ambulances were destroyed by the car bomb, he said.\nEarlier Wednesday, several civilians were killed and injured in airstrikes not far from the site of the mosque bombing, apparently aimed at Houthi targets in the capital, including an air base, officials and witnesses said. Human rights groups have repeatedly denounced combatants for indiscriminate attacks in densely populated civilian areas.\nHeavy fighting also continued in the crossroads city of Taizz, south of the capital, while in the southern port city of Aden – seized by pro-government forces this summer – a military officer was assassinated, the fourth such killing in three days. The coalition led by Sunni Muslim-dominated Saudi Arabia is trying to restore exiled President Abdu Rabu Mansour Hadi to power and shatter the Houthi rebel movement, which it considers a proxy of Shiite Iran. Hadi fled Yemen nearly six months ago as rebels closed in on Aden, where he had taken refuge after Sana fell to the Houthis.\nSpecial correspondent Al-Alayaa reported from Sana and Times staff writer King from Cairo.\nCopyright © 2015, Los Angeles Times", "source": "latimes.com - Los Angeles Times"}