{"published": "2015-09-30T22:47:22Z", "media-type": "News", "title": "Action (14.65 ft) - Observation - RENV2 - Rappahannock River at Remington (Virginia)", "id": "679b38ac-b205-4f3e-b415-ed1d11ac8bbc", "content": "Search by city or zip code. Press enter or select the go button to submit request \n             Notice: New features, functions, and enhancements to AHPS pages as of 8/11/2015. Click here for details        \n\r Auto Refresh: OFF \r \r \n  \r         \n NOTE: Forecasts for the Rappahannock River at Remington are issued routinely year-round. \n            Flood Categories (in feet) \n Major Flood Stage:  25  Moderate Flood Stage:  20  Flood Stage:  15  Action Stage:  12  \nHistoric Crests \n(1) 30.00 ft on 10/16/1942 \n(2) 29.20 ft on 04/26/1937 \n(3) 26.70 ft on 06/02/1889 \n(4) 24.82 ft on 06/22/1972 \n(5) 24.04 ft on 09/07/1996 \nShow More Historic Crests  \n(P) : Preliminary values subject to further review. \n\nRecent Crests \n(1) 19.36 ft on 05/17/2014 \n(2) 18.36 ft on 05/01/2014 \n(3) 16.96 ft on 07/12/2013 \n(4) 16.11 ft on 06/10/2013 \n(5) 17.01 ft on 01/31/2013 \nShow More Recent Crests  \n\n(P) : Preliminary values subject to further review. \n\nLow Water Records \n(1) 2.28 ft on 08/15/1999 \n(2) 2.30 ft on 09/13/1966 \n\n    \n Show FEMA's National Flood Hazard Layers  \n   \nFEMA's National Flood Hazard Layers not showing? \n  \nNote: Your zoom level may have changed. ESRI's zoom levels must be between 14 and 16 to show National Flood Hazard layers. \n       \nZoom Level:14 \n    \n  Legend   \n   \n  FEMA Layer   \n      Gauge Location    Disclaimer   Latitude/Longitude Disclaimer: The gauge location shown in the above map\n                is the approximate location based on the latitude/longitude coordinates\n                provided to the NWS by the gauge owner.      If you notice any errors in the below information, please contact our Webmaster 33  Water reaches the bridge over the Rappahannock on James Madison Street.  25  Portions of downtown Remington, near the railroad tracks, begin to flood. Once water breaches the railroad tracks, major flooding begins in portions of the city.  20  A few homes south of Remington are flooded along with adjacent roads.  18  Water approaches homes south of Remington.  15  Tin Pot Run Road and Sumerduck Road near Remington are flooded.  12  Due to backwater effects on Tin Pot Run, water may begin to cover portions of Tin Pot Run Road and Sumerduck Road near Remington.  10  Farmland south of Remington begins to flood.  8  The left bank of the river begins to overflow near Remington.  5  The Friends of the Rappahannock recommend that river levels greater than this are unsafe for recreational use.   \nLatitude: 38.530556° N,\n          Longitude: 77.813889° W,\n          Horizontal Datum:\n          NAD83/WGS84 \n  River Stage \nReference Frame  Gauge Height  Flood Stage  Uses  NWS stage  0 ft  15 ft  Interpreting hydrographs and NWS watch, warnings, and forecasts, and inundation maps  Vertical Datum  Elevation \n(gauge height = 0)  Elevation \n(gauge height = flood stage)  Elevation information source  NAVD88  Not Available  Not Available  Survey grade GPS equipment, FEMA flood plain maps, newer USGS topographic maps  NGVD 29  252.53 ft  267.53 ft  Older USGS topographic maps, NGVD29 benchmarks  MSL  Not Available  Not Available  Older USGS topographic maps, MSL benchmarks  Other  Not Available  Not Available     \nCurrent/Historical Observations: \n     The National Weather Service prepares its forecasts and other services in collaboration with agencies like the US Geological Survey, US Bureau of Reclamation, US Army Corps of Engineers, Natural Resource Conservation Service, National Park Service, ALERT Users Group, Bureau of Indian Affairs, and many state and local emergency managers across the country. For details, please click here .", "source": "National Oceanic and Atmospheric Administration"}