{"published": "2015-09-27T07:24:51Z", "media-type": "Blog", "title": "Berra's best World Series unrewarded", "id": "0c980b62-2244-464d-b104-3cf2dd567ea0", "content": "Nobody in baseball history had as many choices in World Series jewelry as Yogi Berra, who died Tuesday at age 90. Berra won a record 10 championship rings, and the one he wore most often in later years was from 1953. It had the number 5 on its face -- with the lower part of the numeral encircling a diamond -- to signify the Yankees' fifth title in a row. Berra said he wore that ring because no other team, before or since, had accomplished that feat. Berra had 71 hits in the World Series, a record, and nine of them came against the Brooklyn Dodgers in 1956. He hit a grand slam off Don Newcombe in the Yankees' Game 2 loss, went 5 for 15 over the next four games, and then hit two more home runs off Newcombe in Game 7. Berra drilled two-run home runs in the first and the third innings, propelling the Yankees to a 9-0 victory. It was a bitter end to a dream season for Newcombe, who was 27-7 and won the Cy Young Award (then given to only one pitcher in the majors) and the NL Most Valuable Player Award. When Newcombe came to bat after the second home run, Berra consoled him from behind the plate. \"I hit a pretty good pitch, Newk,\" Berra told him, according to an account in The New York Times. \"Yes, you did,\" Newcombe replied. Berra remains the only player to hit two home runs in a winner-take-all World Series game, and his 10 runs batted in and .800 slugging percentage in 1956 were career highs in his 14 Series appearances. But the car presented to the World Series MVP went to Don Larsen for his perfect game in Game 5. It was Berra, though, who gave us an indelible snapshot of that moment by leaping into Larsen's arms after the final out. The unforgettable image of spontaneous joy defined the boyish enthusiasm for baseball that Berra kept all his life. Late arrival A baby boy was born at Petco Field during the third inning of Thursday night's Padres-Giants game. \"This would never have happened in Los Angeles,\" wrote Janice Hough of leftcoastsportsbabe.com, \"in the third inning Dodgers fans are still in the car on the way to the stadium.\" It's all nunsense In honor of the pope's U.S. visit, the Philadelphia Phillies gave out \"Pope Francis rookie cards\" during a game. \"Don't laugh,\" wrote RJ Currie of sportsdeke.com, \"Word is he's a real pray-maker.\" Headlines From theonion.com: • \"Dolphins trying to fix Ndamukong Suh's quarterback-throwing mechanics\" • \"Cowboys confident they have enough pieces of Tony Romo to win\" Sports quiz Who is the last National League player to hit a grand slam in a World Series game? Sports answer Lonnie Smith of the Braves on Oct. 22, 1992. Sports on 09/27/2015 Print Headline: Berra's best World Series unrewarded", "source": "Arkansas Online stories"}