{"published": "2015-09-22T23:29:35Z", "media-type": "News", "title": "Free forum to be held Oct. 1", "id": "0cdcb893-fad7-4705-ae80-bc3f8f068c3a", "content": "Members of the St. Landry Parish Democratic Executive committee discuss details for the Oct. 1 candidate forum at the Delta Grand Theatre in Opelousas (Photo: Jordan Arceneaux, Daily World) \n\nThe St. Landry Parish Democratic Executive Committee is planning a forum titled, “Democratic Forum 2015,” which will give voters a chance to hear from democratic candidates in multiple races before the Oct. 24 election. \n\nThe free forum is scheduled for Oct. 1 at the Delta Grand Theatre, 120 S. Market St. The event will kick off with a social, which starts at 5:30 p.m. and the forum will begin at 6:15 p.m. \n\nThe event will highlight the two candidates running for state senator in District 24 and the seven candidates vying for the District 40 seat in the Louisiana House of Representatives. \n\n\"This (forum) is to educate voters on the philosophy and issues by which the candidates base their platforms,\" said committee member Hazel Red at the organization's meeting Monday evening. \"Candidates have the opportunity to let the voters know what they're all about. It gives them (voters) something to think about.\" \n\nBecause of time constraints, Democratic candidates seeking the office of governor, lieutenant governor, attorney general, state treasurer and commissioner of insurance will have about five minutes to address the audience. \n\nThe format for the event is as follows: \n\nRepresentatives from the Daily World newspaper, a local radio station and the University of Louisiana at Lafayette political science department will ask the candidates three questions and each candidate will be given the opportunity to respond. The candidates will get a minute and a half to respond to each question. \n\nFollowing the question-and-answer period, the candidates will have two and a half minutes to provide closing remarks. \n\nOpelousas native Marcelle Fontenot from KATC 3 will be the moderator. \n\nFree food and refreshments will be served. \n\nFor additional information, contact Hazel Red at 337-826-7503 or 713-410-1870 or Bambi Polotzola at 337-945-0979. \n\nRead or Share this story: http://www.dailyworld.com/story/news/local/2015/09/22/free-forum-held-oct-1/7261836", "source": "Opelousas Daily World"}