{"published": "2015-09-12T04:52:46Z", "media-type": "News", "title": "Northeast puts Kenwood away with first half surge", "id": "f279d2a4-322e-436c-ad41-f1eb66cf943a", "content": "Turnovers plague Kenwood in loss \nBuy Photo \nNortheast's Quinton Cross (Left) scored two touchdowns and Gus Antoine (right) scored one in a 34-6 win over the Knights Friday night. (Photo: Tony Centonze/For The Leaf-Chronicle) Buy Photo \n\nCLARKSVILLE, Tenn. — The Kenwood Knights faced a Northeast High football team that seemed to be firing on all cylinders Friday night. Turnovers and penalties plagued the Knights as the Eagles posted a 34-6 win to move to 2-2 on the season. \n\nNortheast scored two touchdowns in the first quarter and two in the second and led 27-0 at the half. Alex Martinez took in a 13-yard run for Northeast's opening touchdown followed by Derecus Washington's 27-yard catch for a touchdown with 2:13 still on the clock in the first quarter. \n\nThe Eagles didn't let up as Gus Antoine sprinted for a 32-yard touchdown with 8:10 left in the half and Quinton Cross scored on a 17-yard run with less than a minute left in the half. \n\nNortheast's Jailyn Ferguson had an interception to end an impressive first half drive by Kenwood. The Knights managed two takeaways on the night, an interception by Nicolas Williams and a fumble recovered by Coreon Jackson, which he ran 87 yards for a touchdown, Kenwood's only score of the night. \n\nNortheast's coach Terry Arrington was happy with his team's offensive effort. \n\n“We executed for the first time,” Arrington said. “This is the first time in the last two weeks we've done what we're supposed to do. I thought offensively we were good. I told the kids, the biggest thing I was pleased with was when we came out in the first series and had a couple of touchdowns called back, we didn't quit, we didn't give up. We actually buckled down, we executed and we scored some touchdowns, so I was very pleased with that.” \n\nArrington said that he felt the team didn't play well against Henry County the week before, but that the defense has played well in the other three games. \n\nThe Knights looked more focused in the second half. They put together some drives and their defense did a better job of holding the Eagles. \n\nKenwood's coach Brian Beaubien spoke after the game about his team's performance. \n\n“Where do I start,” Beaubien said. “To a certain extent, we were our own worst enemy tonight with the penalties and silly mistakes. Northeast is very well prepared; tonight they were just a better football team than we were. We had some turnovers and penalties, both hurt us on offense. And at times we were a step slow on defense. We just weren't playing at a fast enough tempo, not reacting and seeing things quite fast enough. We had a lot of tackling issues as well. We've been working hard to fix these issues we're just not there yet.” \n\nFriday's loss drops Kenwood to 1-3 on the season. \n\nRead or Share this story: http://leafne.ws/1F3oqjN", "source": "Leaf Chronicle"}