{"published": "2015-09-16T20:02:28Z", "media-type": "News", "title": "Beer's Decline Inspires a Merger", "id": "0e70cae4-7ebb-426d-a521-405040b2c586", "content": "The biggest beer maker in the world wants to buy the second-biggest.  The second-biggest appears to be game . There are antitrust concerns, especially in the U.S., but also obvious ways to assuage them.  At the moment it looks like this merger stands a good chance of happening. \n\nBut why is it happening? Here’s one key reason: \n \nIn the U.S. and lots of other developed economies, per capita beer consumption is on the decline. As you can see from the chart, these things can go up and down and up again. Looking even farther back, per capita beer consumption (measured, as in the chart, in gallons of ethanol consumed in the form of beer) hit its all-time high in the U.S. in the early decades of the 20th century. It then rebounded to similar levels in the 1970s before beginning another decline. I happen to think we'll never again approach peak beer, but I could be wrong, and there's definitely still growth potential for beer in emerging markets. \n\nBut many emerging markets are being hit by the global economic slowdown. As Bloomberg’s Paul Jarvis points out , Anheuser-Busch InBev and SABMiller, the two beer giants in question, are both heavily exposed to South America and its growing economic troubles. For the foreseeable future, things aren’t looking up for beer, especially mass-market beer (craft beer is something of a different story ). \n\nThis is exactly the kind of situation that 3G Capital , the Brazilian private-equity firm behind AB InBev, thrives on. 3G takes on mature or declining businesses, cuts out everything that doesn’t contribute to the bottom line, then buys other companies in the same industry and repeats the process. Yes, sometimes they invest some of the money saved in new initiatives -- as with Heinz and its big push into mustard . But in general the priority is making existing operations more efficient. \n\nIn August, Annie Gasparro of the Wall Street Journal examined the sales of leading brands at Heinz and AB InBev, and found that most had lost market share since 3G took over. This demonstrates that the 3Gers aren’t magicians, but I don’t know that it’s really an indictment of their approach. Ore-Ida frozen potatoes and Budweiser beer were in decline long before 3G got involved. These are “industries where long-term growth is slow, where internally generated funds outstrip the opportunities to invest them profitably, or where downsizing is the most productive long-term strategy.” \n\nThat quote is from Michael C. Jensen’s classic, if controversial, 1989 Harvard Business Review article on the “ Eclipse of the Public Corporation .” Jensen, now an emeritus professor at Harvard Business School, wrote the piece as a sort of manifesto for the then-nascent private-equity industry and its potential to make the U.S. economy more efficient. 3G is an interesting case because it generally doesn’t take its targets private -- AB InBev, Heinz and Restaurant Brands International, 3G’s 2014 combination of Burger King and Tim Horton’s, have all remained publicly traded companies. But the overall approach is exactly what Jensen described. \n\nNo, it’s not exactly exciting or inspiring. But neither, apparently, is a can of mass-produced beer. \n\nThis column does not necessarily reflect the opinion of the editorial board or Bloomberg LP and its owners. \n\nTo contact the author of this story: \n Justin Fox at justinfox@bloomberg.net \n\nTo contact the editor responsible for this story: \n James Greiff at jgreiff@bloomberg.net", "source": "Bloomberg View"}