{"published": "2015-09-21T17:05:26Z", "media-type": "News", "title": "No. 4 Mahnomen completes fifth straight blowout win", "id": "502d06f9-9f34-424e-9408-c62c0c530aa8", "content": "Mahnomen has outscored their opponents 264-23 this year and have scored at least 47 points in each game. \n\n“Offensively, we are executing at a high level right now,” head coach John Clark, Jr. said. “Both our running and passing games have been excellent.” \n\nMahnomen’s starters have been putting games away in the opening minutes and continued to do so scoring three times in the first quarter. \n\nTom Pavek opened the scoring at 10:33 on a 23-yard run, followed by Kody Lefebvre on a 50-yard pass from Pavek two minutes later for a 14-0 advantage less than four minutes into the contest. \n\nMitch Foss scored from the six-yard line at 3:25 for a 20-0 lead at the end of the first quarter. \n\n“Our offensive line continues to improve each week as evident by the yardage we are putting up,” said Clark. “Several backs are making plays throughout the game. It's a lot of fun when you have several kids that can run, catch, and throw the ball.” \n\nMahnomen eclipsed 500 yards of total offense in the game with 503 – 151 passing and 352 on the ground. The Indians did that without a 100-yard rusher sharing the load between 12 rushers and backup quarterback Brian Schoenborn joined Pavek with a touchdown pass at the quarterback position. \n\nSchoenborn hit Lefebcvre on a 33-yard touchdown pass nine seconds into the second quarter. Lebebvre scored three times in the game when he scampered in from the 10 at 6:31 for a 33-0 lead. \n\n“It has to be tough on opposing defenses to try and stop us right now,” said Clark. \n\nJake Worms scored on a 48-yard run for the final touchdown of the first half and found the end zone again early in the third quarter from 26 yards and a 46-0 lead. \n\nJon Starkey rushed 26 yards for Mahnomen’s final score and 52-0 lead with three minutes remaining. \n\nThe Rebels negated a shutout on special teams when Charlie Coleman returned the ensuing kickoff 79 yards for the 52-6 final. \n\n“Defensively, we were very good again,” Clark said. “I really like how our kids are starting to make adjustments as the game goes along. We gave up some yardage in the first half, but our first group really shut them down in the second half.  Again, we have several kids making plays on defense. Nick Podlak, among others, had a tremendous game from his nose guard position. He seemed to be in the backfield and around the ball all night. This was a good test for our defense and they did a great job of playing team defense all night. The young guys continue to get a lot of playing time and are showing big improvements as well.” \n\nThose backup players will likely get plenty of more playing time as Mahnomen’s next two opponents have combined for one victory. Badger/Greenbush-Middle River is 0-5 and New York Mills is 1-4. The Indians may get a game where their starting players can get a full four quarters of play in the season finale at Polk County West. The Thunder currently has a record of 5-0. \n\nIndians results \n\nMahnomen at Red Lake County Central, Friday, Sept. 18 \n\nMAH  20 19 7 6 — 52 \n\nRLC     0   0 0 0 —  6 \n\nScoring: \n\n1st quarter \n\nMAH – Pavek 23 run; Schoenborn kick \n\nMAH – Lefebvre 50 pass from Pavek; Schoenborn kick \n\nMAH – Foss 6 run; kick blocked \n\n2nd quarter \n\nMAH – Lefebvre 33 pass from Schoenborn; Schoenborn kick \n\nMAH – Lefebvre 10 run, kick failed \n\nMAH – Worms 48 run, PAT failed \n\n3rd quarter \n\nMAH – Worms 26 run, Schoenborn kick \n\n4th quarter \n\nMAH – Starkey 34 run, kick failed \n\nRLC – Coleman 79 kick return, PAT failed", "source": "DL-Online"}