{"published": "2015-09-14T19:02:14Z", "media-type": "News", "title": "2Diane von Furstenberg Spring 2016: New York Fashion Week", "id": "9f730e3c-c2e9-4c6d-a266-98ab22c59795", "content": "View Slideshow    Kendall Jenner, Karlie Kloss and Gigi Hadid at Diane von Furstenberg's spring '16 runway show.  .   \nDiane von Furstenberg  had a major shoe moment during New York Fashion Week, for her spring ’16 show. \n \nThe designer debuted her first shoe collection with new partner Caleres – including strappy sandals with iridescent block heels, unique floral prints on wood bottoms, flat sandals and gold touches throughout. \n \n“I love this shoe. Isn’t it gorgeous?” she said, scooping up a strappy style with an iridescent block heel. “I love crisscross in general — it makes your foot look good, and it carries you. And I love gold — I give as much attention to it as possible. We have different versions [of similar styles] so you can walk in the street and also have a party shoe.” \n  Diane von Furstenberg spring ’16 runway collection. \n.   \n“This is the first time I’m showing flats on the runway. Flats are ‘in’ right now, and I think it’s very much about comfort [being so important]. Comfort has to be a big part of it. What does this brand do? We celebrate freedom. We empower women. We better deliver this promise in our shoes.” \n \nDVF  also had impressive models walk down the runway – including Gigi Hadid, Karlie Kloss and Kendall Jenner. \n \nAnd Malin Akerman and Irina Shayk were a few of the famous faces in the front row. \n \nDVF’s earliest footwear memory?  “When I was growing up, being a ballerina was a big thing. And I remember when I bought my first high heels at boarding school — I bought them without my mother knowing. They were the most beautiful pair of shoes. I was probably woken up with Charles Jourdan shoes in the ’70s,” she told FN. \n \nClick through the gallery below for all the runway shots and shoe highlights. \n \n\n \nWant More NYFW Spring ’16 Coverage? \n \nGivenchy New York Fashion Week Spring 2016: Front Row Highlights \n \nBetsey Johnson New York Fashion Week Spring 2016: Front Row Highlights \n \nGivenchy Spring 2016: New York Fashion Week \n \nPaul Andrew For Tanya Taylor Spring 2016 New York Fashion Week \n \nNew York Fashion Week Shoe Of The Runway: Spring 2016 Collections  \n \nVisvim Spring 2016: New York Fashion Week", "source": "Footwear News"}