{"published": "2015-09-24T17:29:14Z", "media-type": "News", "title": "Trams, maps and Bargain Buys: £12.49m of MSPs' expenses published", "id": "01c00555-4b51-48f4-9795-ab7bd44d86af", "content": "Only the former transport minister who signed off the billion-pound Edinburgh tram scheme uses it regularly, the latest MSPs expenses show. \n \nLiberal Democrat Tavish Scott, the Shetland MSP who piloted the final Tram Bill through Holyrood in 2006, has claimed for 11 £5 journeys from Edinburgh Airport to the city centre while his fellow island Lib Dem MSP Liam McArthur has used it twice. \n \nThe Lib Dems devised the trams with Labour in the first coalition Scottish Government against steadfast opposition from the SNP, who refused to devote any more public money when it went off the rails in 2011. \n \nSNP MSP Mike MacKenzie has since used it once while former SNP education secretary Mike Russell was so impressed with his £1.50 trip from Ingliston to York Place he tweeted about its \"modern European ambience\". \n \nMr MacKenzie claimed for seven Ordnance Survey maps at a cost of £55.93 - while fellow SNP MSP Stuart McMillan claimed £9 for a Greenock street map despite being based in the town for four years. \n \nLabour MSPs have yet to use the trams - with Claudia Beamish preferring to cycle round Edinburgh and claim 60p a time in \"member's pedal cycle\" costs. \n \nTory MSP Jamie McGrigor claimed £263.87 for a staff member to travel to Brussels by Eurostar plus £346 for two nights in Brussels' \"luxury\" four-star Thon Hotel. \n \nFellow Tory Jackson Carlaw claimed £173 for a night in the five-star Radisson Blu Edwardian Hampshire in London's Leicester Square while Labour MSP Anne McTaggart paid £346 for two nights in London's four-star Strand Palace. \n \nTaxis remain a popular travel choice, with current SNP transport minister Derek Mackay paying £40 for a 10-mile taxi ride from Glasgow to Inchinnan, and former SNP transport minister Stewart Stevenson taking regular £30 taxi trips home from Huntly railway station. \n   Promoted stories   \nCurrent fair work minister Roseanna Cunningham has taken several £28 taxis from her home to various locations in her constituency. \n \nSNP MSP Fiona McLeod tops the bill for the most expensive dinner at £43.40 during a one-night stay in Edinburgh while her SNP colleague Angus Macdonald plumped for a £3 hotel meal. \n \nRural affairs minister Richard Lochhead is no luddite when it comes to technology, claiming £1,289 for a 27-inch Mac Computer - although he did need a £12.99 Switch To Mac manual to learn how to use it. \n \nMr Russell paid £1,399 for a top-of-the-range MacBook Pro while his SNP colleague David Stewart settled for a £319 budget Acer Aspire. \n \nLabour backbencher Margaret McCulloch also claimed £1,399 for 27-inch Mac desktop, but all of these Macs combined would not pay for SNP MSP Colin Keir's £4,194 digital printer. \n \nPaper folding machines remain popular office expenses, from the £899 model claimed by Labour MSP Mary Fee to SNP MSPs Stewart Maxwell and Stuart McMillan's £500 folders. \n \nAt the other end of the office equipment scale, SNP MSP and former banker Colin Beattie, who has registered income of up to £35,000 a year from property on top of his £59,000 MSPs salary, claimed for a £1 bowl from Bargain Buys. \n \nTory MSP Elizabeth Smith claimed £157.50 for Who's Who 2015 - \"the essential directory of the noteworthy and influential people in all walks of life\". \n   \n Share article  \n   \nThe party leaders' allowance has doubled from £17,957 to £38,750 and the total amount claimed by all MSPs was £12.49 million. \n \nA Scottish Parliament spokeswoman said: \"Figures published today show a 0.2% decrease on the previous year. This is a fall of £25,238.\"", "source": "Braintree & Witham Times"}