{"published": "2015-09-10T17:30:11Z", "media-type": "News", "title": "Russia’s Nemtsov, Saudi’s Badawi, listed for EU rights prize", "id": "8232180c-01ce-44c7-aaea-fcf66b44c02e", "content": "The prize is awarded every year to honour individuals who combat intolerance, fanaticism and oppression, often falling foul of their governments as a result. \n\nNemtsov, a 55-year-old former deputy prime minister turned critic of President Vladimir Putin, was gunned down on a bridge just steps from the Kremlin in late February. \n\nHis murder sparked global outrage and condemnation as evidence that Putin’s Russia would not tolerate dissident voices. \n\nAuthorities have so far failed to track down his killers. \n\nA Saudi Arabian court sentenced Badawi, 31, to 1,000 lashes and 10 years in jail last year for insulting Islam but halted the whippings after a first round. \n\nThe European Union condemned the sentence, saying “corporal punishment is unacceptable and contrary to human dignity.” \n\nThe Russian authorities meanwhile put helicopter pilot Nadiya Savchenko on trial in July for her alleged involvement in the killing of two Russian journalists in war-torn eastern Ukraine last year. \n\nAmong the other nominees were US intelligence whistle-blower Edward Snowden whose name was also put forward in 2013; Antoine Deltour who leaked details on Luxembourg’s controversial tax break deals with huge multinational firms; and Stephanie Gibaud, who uncovered tax evasion and money laundering at Swiss banking giant UBS. \n\nAlso listed were Edna Adan Ismai, a Somali campaigner against female genital mutilation and the Mesa da la Unidad Democracia which represents political prisoners and opposition groups in Venezuela. \n\nThe winner will be announced in October. \n\nLast year, the Parliament awarded the prize to Congolese doctor Denis Mukwege for helping victims of gang rapes by soldiers. \n\nPast winners include Pakistani education campaigner Malala Yousafzai, late South African rights icon Nelson Mandela and Myanmar activist Aung San Suu Kyi. The prize carries an award of 50,000 euros ($56,000). \n\n© 2015 AFP", "source": "Roodepoort Record"}