{"published": "2015-09-22T13:58:52Z", "media-type": "News", "title": "EnerSys Announces Organizational Changes", "id": "272c030d-8578-4b8a-9605-c68efc4cc64b", "content": "READING, Pa. , Sept. 22, 2015 /PRNewswire/ -- EnerSys (NYSE: ENS) the world's largest manufacturer, marketer and distributor of industrial batteries announced that John D. Craig , Chief Executive Officer will be retiring as Chief Executive Officer effective March 31, 2016 . David M. Shaffer has been named President, Chief Executive Officer and Chief Operating Officer effective April 1, 2016 . Mr. Shaffer will become a member of the board of directors of the Company on April 1, 2016 . \n \nMr. Craig joined the Company's predecessor in 1994 and was named Chairman, President and CEO in 2000 when he led the management buyout of the Company forming EnerSys. Since that time the Company's revenue has grown from $400 million to $2.5 billion while completing 33 acquisitions. Mr. Craig will continue as non-executive chairman of the board of directors of EnerSys following his retirement. \n \nMr. Shaffer joined EnerSys in 2005 serving most recently as President and Chief Operating Officer since November 2014 , prior to that he served as President of the Company's Europe , Middle East & Africa (EMEA) business and as President of Asia prior to that. He has held positions with increasing responsibility in the battery industry since 1989. Mr. Shaffer holds a Master in Business Administration degree from Marquette University and a Bachelor of Science degree in Mechanical Engineering from the University of Illinois . \n\n \nRichard W. Zuidema , Executive Vice President of the Company, has announced his retirement as of December 31, 2015 . Todd M. Sechrist , President EMEA will assume the role of Executive Vice President effective January 1, 2016 . \n \nMr. Zuidema joined the Company's predecessor in 1998 and was a member of the group who completed the 2000 management buyout. He has been a significant contributor to the success of the Company and to assure a smooth transition he intends to assume a consulting role with the Company effective January 1, 2016 . \n \nMr. Sechrist joined EnerSys' predecessor company in 1993 and currently serves as President EMEA. Prior to that he served as President of the Company's Americas business. He has held several positions with increasing responsibilities with the Company. Mr. Sechrist received his Master of Business Administration degree in Finance from St. Joseph's University and a Bachelor of Science degree in Finance from Pennsylvania State University . \n \nHolger P. Aschke , Vice President Reserve Power Sales and Marketing for EMEA, has been appointed President EMEA effective January 1, 2016 replacing Mr. Sechrist. Mr. Aschke joined a predecessor company in 1996 and has held a wide range of operational and sales roles in the Company's EMEA business. \n \nAlso effective January 1, 2016 , Michael J. Schmidtlein will be appointed Executive Vice President Finance and Chief Financial Officer. Mr. Schmidtlein has served as Senior Vice President Finance and Chief Financial Officer since 2010, having previously been Vice President Finance and Chief Financial Officer. \n \nEDITOR'S NOTE : \n \nEnerSys, the global leader in stored energy solutions for industrial applications, manufactures and distributes reserve power and motive power batteries, battery chargers, power equipment, battery accessories and outdoor equipment enclosure solutions to customers worldwide. Motive power batteries and chargers are utilized in electric forklift trucks and other commercial electric powered vehicles. Reserve power batteries are used in the telecommunication and utility industries, uninterruptible power supplies, and numerous applications requiring stored energy solutions including medical, aerospace and defense systems. Outdoor equipment shelter products are utilized in the telecommunication, cable, utility, transportation industries and by government and defense customers. The company also provides aftermarket and customer support services to its customers from over 100 countries through its sales and manufacturing locations around the world. \n \nFor more information contact: \nRichard Zuidema , Executive Vice President, EnerSys, 2366 Bernville Road, Reading, PA , 19605, USA , Tel: 800-538-3627 \n \nWebsite: http://www.enersys.com \n \nCaution Concerning Forward-Looking Statements \n \nAlthough EnerSys does not make forward-looking statements unless it believes it has a reasonable basis for doing so, EnerSys cannot guarantee their accuracy. The foregoing factors, among others, could cause actual results to differ materially from those described in these forward-looking statements. For a list of other factors which could affect EnerSys' results, including earnings estimates, see EnerSys' filings with the Securities and Exchange Commission, including \"Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations,\" including \"Forward-Looking Statements,\" set forth in the Company's Quarterly Report on Form 10-Q for the period ended June 28 , 2015. No undue reliance should be placed on any forward-looking statements. \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/enersys-announces-organizational-changes-300146941.html \n \nSOURCE  EnerSys", "source": "IT Business Net"}