{"published": "2015-09-20T08:06:12Z", "media-type": "News", "title": "Malcolm Turnbull's reshuffle: Fortune favours the brave", "id": "eb4499c3-c4ce-47fb-a33c-62ffdf5acbe6", "content": "Malcolm Turnbull needed to be brave to move on Tony Abbott last Monday, and has had to be similarly brave in ringing in the changes to a government that had become sclerotic with Howard government relics helping it to look prematurely old. \n\nCabinet reshuffle winners and losers\n\nMalcolm Turnbull needed to be brave to remove Tony Abbott last Monday, and has had to be similarly brave in ringing in the changes to a government that was sclerotic, weighed down with Howard government baggage, and looking prematurely old.\n\nAfter just two years of office, the Abbott government was not merely on the nose with voters, but, embarrassingly, it was out of reform puff too. Ideas had either dried up, or were ruled out for partisan gain.\n\nTurnbull's diagnosis was blunt: its condition was terminal. Failure to remove Abbott and modernise the government would simply make Bill Shorten the next prime minister of Australia.\n\nHis remedy was brutal. First, an all-or-nothing pitch for the leadership and second, a proper merit-based reshuffle of the executive, with changes significant enough to honour the trauma of that upheaval and hopefully lift the fortunes of the country.\n\nTwo key reasons for the government's failure were manifest: its woeful under-representation of women in the cabinet - remember, there had been just one in Abbott's first cabinet, which had grudgingly improved to just two under duress - and, its overweening focus on the past rather than the future.\n\nAbbott had retained a brace of time-serving Howard government ministers, some of whom had been there since the 1990s. It was an abrogation of leadership, and it showed in the failure of imagination the government had displayed at almost every turn. Even reform areas that had been flagged were being progressed only in lip-service - think tax, industrial relations, marriage equality.\n\nThe new Prime Minister's team is a different story. People have been chosen, not with an eye to the past, but with a mind to the future. Youth, ideas, energy, and articulation, have been rewarded over past contribution, and the right to rule.\n\nTurnbull has sent a message to the party he now confidently leads, that promotion to cabinet is not a reward in itself, but an invitation to step forward and make a bigger contribution.\n\nBut politics remains the art of the possible. There both are speed limits to change, and debts to be paid.\n\nWith just five females in the cabinet, women are still dramatically under-represented despite their numbers being more than doubled. This is a lesson about the long-term damage that can be done by going backwards. Coming off such a low base has set back the cause considerably.\n\nTurnbull has passed the first big test of leadership simply by showing some.\n\nFollow us on Twitter The story first appeared on The Sydney Morning Herald.", "source": "Hawkesbury Gazette"}