{"published": "2015-09-01T13:45:20Z", "media-type": "Blog", "title": "How to Book Award Flights with Alaska Airlines Mileage Plan", "id": "5d646fa1-899e-400c-b499-f0ac47c1afee", "content": "Earning points and miles is the surprisingly easy part of award travel; it’s learning how to maximize value when redeeming that takes practice. In this post, TPG Senior Points & Miles Correspondent Jason Steele explains how to use your Alaska Airlines Mileage Plan miles to book the flights you want. \n \nDon’t let the name fool you — Alaska Airlines is no longer a small regional carrier focused on our 49th state. It’s now a major domestic airline for flights to and from the Pacific Northwest, and its importance is bolstered by numerous partnerships with larger international carriers. \n \nIn this post, I’ll explore how you can book award flights with Alaska’s Mileage Plan frequent flyer program, continuing my series on award flight booking from previous guides for Delta , American , and United . \n Alaska’s route network is pretty big, and these are just the nonstop flights from its Seattle hub.  \nEarning Miles with Alaska Mileage Plan \n \nOne of the strengths of Alaska’s Mileage Plan is that miles aren’t difficult to acquire. First, you can earn Mileage Plan miles from paid flights on Alaska and its many partners. Unlike Delta and United, Alaska Airlines passengers still earn miles based on 100% of the actual miles flown, plus the following bonuses for elite status and higher fare classes: \n  M and B classes of service earn a 25% bonus.  Y and S classes of service earn a 50% bonus.  Mileage Plan MVP members earn a 50% elite bonus.  Mileage Plan MVP Gold members earn a 100% elite bonus.  Mileage Plan MVP Gold 75K members earn a 125% elite bonus.   \nTo earn the most miles, you can also take advantage of the program’s  many bonus mileage offers , like double miles for flights between Seattle and New York-JFK , as well as between Los Angeles and Baltimore . Note that you must typically register for these promotions in advance of any qualifying flights. \n Alaska offers many routes with double miles promotions, but you have to remember to register first.  \nAlthough Alaska isn’t part of a major global airline alliance, it does have 15 different airline partners you can earn miles on, depending on the fare class purchased: \n  AeroMexico  Air France  American (and US Airways starting October 18)  British Airways  Cathay Pacific  Delta  Emirates  Fiji Airways  Hainan Airlines  KLM  Korean Air  LAN  Qantas  PenAir  Ravn Alaska   \nIn addition, Alaska is known for frequently offering miles for sale at a discount. Currently, you can get  up to a 40% bonus when you buy Mileage Plan miles  through October 6, 2015. If you maximize the promotion, you’d end up paying $1,182.50 for 56,000 miles, or approximately 2.1 cents per mile. Although this is just slightly more than TPG’s latest valuation  of 2.0 cents per mile, it’s a quick and easy way to earn miles that can easily be worth far more than two cents when you redeem for premium international partner awards. \n \nNote that payment for mileage purchases is made to Points.com, so it won’t be recognized as an airline purchase. That means you won’t earn extra miles for this purchase by using a co-branded Alaska Airlines card (or another credit card that earns bonus rewards for airfare or travel ). \n \nFinally, Alaska offer numerous rental car , hotel  and shopping partners that can help you can earn miles. \n The Alaska Airlines Visa Signature Card offers a lucrative companion ticket.  \nCredit Cards, Transfers and Other Partners \n \nAlaska Airlines is a transfer partner of the Starwood Preferred Guest program . If you signed up for the Starwood Preferred Guest credit card from American Express — with its current sign-up bonus of 30,000 points  when you spend $3,000 within three months of account opening — you could have a total of 38,000 Mileage Plan miles after you meet the minimum spending requirement and earn the 5,000-mile bonus for transferring 20,000 Starpoints. \n \nAlaska offers its own co-branded credit cards from Bank of America, including the Alaska Airlines Visa Signature Card , which currently offers a sign-up bonus of 25,000 miles upon approval. You also get perks like a free checked bag, a $99 coach companion pass  and 3 miles per dollar spent on Alaska Airlines purchases. There is a $75 annual fee for this card that’s not waived for the first year. \n Emirates is just one of Alaska’s valuable partner airlines.  \nAward Charts and Sweet Spots \n \nRather than offering a single award chart, Alaska publishes multiple charts depending on the region you’re traveling to and the airline partner you’re flying with. Here are links to all the charts: \n  Continental US and Canada  Intra-State  Hawaii  Africa, Middle East, India  Asia  Australia, New Zealand, South Pacific  Central and South America  Caribbean  Mexico  Europe   \nTo determine how many miles are required for a particular flight, you select the mileage chart for the region you’re traveling to, and then select from the appropriate partner. \n \nHere are some of the top redemption opportunities in the Mileage Plan program: \n \nCathay Pacific is renowned for having one of the best first-class products in the world , and you can use Alaska miles for flights to Asia, Africa, India and the Middle East for just 70,000 miles each way, with Australia and New Zealand costing 80,000 miles each way. If you can find award space (and don’t mind the extra travel time), you can stop in Cathay Pacific’s Hong Kong hub before continuing on to destinations in Asia and Africa for no additional miles. Even its business-class awards are a good value, at 50,000 miles to Asia, 62,500 miles to Africa, India and the Middle East, and 60,000 miles to Australia and New Zealand. \n \nEmirates  funnels enough traffic through Alaska’s Seattle hub that it was able to justify  adding a second daily flight to and from Dubai . As with Cathay Pacific, using Alaska miles for premium flights on Emirates can be a fantastic deal. First-class awards to India and the Middle East are 90,000 miles each way, with business-class awards at 72,500 miles. You can reach Asian and European destinations for 100,000 miles in first and 75,000 miles in business, while Africa is 100,000 miles in first and 77,500 in business. Once again, you can add flights to further destinations for little or no additional cost. \n Qantas offers another good redemption option for Alaska miles, even if first-class awards are nearly impossible to find.  \nQantas first-class awards would also be a great deal at 70,000 miles each way if they were ever released. You might find business-class award seats , which are also quite reasonable at 55,000 miles each way. Fiji Airways is another option for award flights to Australia, New Zealand and the South Pacific, with business-class awards for 55,000 miles each way. \n \nLAN (soon to be rebranded LATAM) is a partner that lets you fly to South America in business class for 45,000 miles each way. LAN has a newly refurbished business class featured on its 787 fleet . \n \nAmerican Airlines  off-peak awards can be booked through Mileage Plan, with economy flights to Europe for 20,000 miles each way from October 15 to May 15, and economy flights to South America from 15,000 – 20,000 miles (depending on the destination) during various off-peak dates. Flights to Japan and Korea are 25,000 miles each way in coach from October 1 to April 30. \n \nFinally, you can get good value when you use Mileage Plan miles to fly on Alaska Airlines itself. Deals include flights within Alaska (the largest state in the US), which start at just 7,500 miles each way. Alaska also offers extensive service to Hawaii starting at 20,000 miles each way. While that’s not a spectacular deal, it’s reasonable considering how much service Alaska offers to Hawaii from its West Coast hubs. \n \nFor more ideas on how to maximize Mileage Plan miles, check out Nick Ewen’s post on  7 Great Alaska Airlines Mileage Plan Award Redemptions . \n Alaska’s favorable routing rules allow stopovers and open jaws.  \nBooking Process \n \nAlaska has a very good award search engine, which includes nearly all partners except Cathay Pacific and LAN. Unfortunately, you’ll have to call to book awards on those two partners. \n \nWhen putting together an award itinerary, consider Alaska’s quirky routing rules. You’re not allowed to put together an award flight that uses multiple partners; however, you can use flights on Alaska to reach a domestic gateway, and then continue on with a single partner. \n \nAlaska is also unique in that it always allows a free stopover (a change of planes greater than 24 hours) in each direction, even on one-way awards. So you can use these miles to visit as many as three different destinations on a round-trip flight. You’re also allowed to include a double open jaw, which gives you even more opportunities to travel flexibly. For more comprehensive information, check out TPG Special Contributor Eric Rosen’s  Overview of Alaska Airlines Award Routing Rules \n \nOther Tips \n \nAlaska won’t impose fuel surcharges on its awards with the exception of those on British Airways, which are in line with what American and other carriers charge. Unfortunately, Alaska does charge a handful of other fees that you should be prepared for, including a “Partner Award Booking Fee” of $12.50 each way for partner awards, and a $15 per ticket “call center ticketing fee.” If you have to cancel or change a reservation  within 60 days of your flight, be ready for the steep $125 fee, which is waived for Mileage Plan MVP Gold or 75k members. \n \nFor ticketing a lap child on an award reservation, Alaska charges the customary 10% of the paid fare, but that might be the least of your problems. One TPG reader had to spend about a dozen hours on the phone with Alaska and British Airways before he could figure out a way to ticket his infant for an upcoming award flight. Ultimately, he had to engage Alaska’s Director of Customer Support to make it happen, so be prepared for a bit of an ordeal if you decide to travel with your little one. For more information about lap child ticketing, read my comprehensive guide on How to Plan Award Travel with an Infant or Lap Child . \n \nUse the British Airways website to search for Cathay Pacific and LAN award space. Although Cathay doesn’t release much first-class award space in advance, you can often find seats within two weeks of departure. Cathay’s business-class award space is significantly more generous. \n \nBottom Line \n \nAlaska’s Mileage Plan program offers a tremendous amount of value thanks to lucrative airline partners and flexible routing rules. It’s no surprise that TPG has developed a crush on Alaska Airlines , and that he lists Alaska miles near the top of his monthly valuations. \n \nIf you have questions about how to book Mileage Plan awards, or want to share your own tips and strategies for maximizing Alaska miles, please post in the comments below! \n \nWhat’s your favorite way to redeem Alaska miles?", "source": "The Points Guy"}