{"published": "2015-09-22T05:41:00Z", "media-type": "Blog", "title": "Baylor assistant football coach makes potential NCAA rules violation", "id": "387878b9-4f6c-4f8f-8fd4-fd6bd8733cb8", "content": "Baylor Coach Art Briles said Monday that he was embarrassed to find out that one of his assistant coaches was on the sideline during an Oklahoma home game, the second potential NCAA rules violation by his staff to be disclosed in as many weeks.\nBriles said he wasn't aware beforehand that passing game coordinator Jeff Lebby, who is also his son-in-law, was going to be at the Sooners' game against Tulsa. When he found out, Briles said he called Oklahoma Coach Bob Stoops after Saturday's game and apologized. Stoops alluded to an NCAA rule that prohibits off-campus, in-person scouting of future opponents.\nUCLA quarterback Josh Rosen gives opponents, and teammates, a different look Chris Foster UCLA's offense has a different way of doing business with freshman Josh Rosen at quarterback instead of Brett Hundley, the team's starter the previous three seasons. UCLA's offense has a different way of doing business with freshman Josh Rosen at quarterback instead of Brett Hundley, the team's starter the previous three seasons. (Chris Foster) \"That seems to be — that's a pretty fundamental rule. That's not allowed, so I don't know what he was doing here,\" Stoops said in Norman, Okla. \"It's something that needs to be reported and needs to be dealt with through the Big 12 office and our people. I'm sure they will.\"\nFirst-year Tulsa Coach Philip Montgomery, a former Baylor assistant, also apologized. \"Obviously, it was a mistake and a poor decision on my part to leave a credential for Jeff and his wife,\" Montgomery said in a statement. \"They were in the Oklahoma City/Norman area for a wedding and came to the game to support me. There was no malicious intent on my part. I've known Jeff since he was in the sixth grade. I called Coach Stoops today and apologized for this situation.\"\nThere was no immediate response from Big 12 officials.\n::\nFresno State quarterback Zack Greenlee, 20, was arrested on suspicion of disorderly conduct and drinking in public and released from jail hours later, authorities said. Greenlee was arrested early Sunday after police responded to a disturbance call about a loud party and officers saw him toss a beer bottle on a nearby yard, Fresno Police spokesman Lt. Joe Gomez said. Bulldogs linebacker Brandon Hughes, 21, was also arrested on suspicion of obstructing a public officer after Hughes refused to leave the area. He too was released from jail a short time later, Gomez said. Arizona State's Mike Bercovici hopes for another big day against USC Gary Klein Mike Bercovici did more than beat USC with a Hail Mary pass last season. Mike Bercovici did more than beat USC with a Hail Mary pass last season. (Gary Klein) ::\nMissouri will be without wide receiver DeSean Blair when it opens Southeastern Conference play at Kentucky.\n::\nArizona hopes to have All-American linebacker Scooby Wright back for Saturday's game against UCLA. Wright had surgery for a torn meniscus after injuring his left knee in the first quarter of the Wildcats' opener.\n::\nClemson kicker Ammon Lakip was reinstated after serving a three-game suspension for an off-season drug arrest, but Coach Dabo Swinney said that walk-on kicker Greg Huegel will remain the starter.\n::\nTennessee defensive tackle Danny O'Brien was reinstated after serving a two-game suspension for what Volunteers Coach Butch Jones described as a violation of team rules and policies.", "source": "Breaking Sports - Chicago Tribune"}