{"published": "2015-09-06T06:31:12Z", "media-type": "News", "title": "Godolphin eyes Joao Moreira for regular spring visits before Golden Rose tilt", "id": "e35823e3-32dd-4b05-8e1c-55ff686d878b", "content": "Godolphin has flagged using Hong Kong-based gun-for-hire Joao Moreira on a more regular basis throughout the spring carnival as the Brazilian jets in to partner one of their three runners in the Golden Rose on Saturday. \n\nFollow SMH Sport on Twitter\n\nGodolphin has flagged using Hong Kong-based gun-for-hire Joao Moreira on a more regular basis throughout the spring carnival as the Brazilian jets in to partner one of its three runners in the Golden Rose on Saturday.\n\nMoreira will unite with Shards in the $1 million race, the first group 1 of the Sydney carnival, and it is a first foray with the royal blue brigade, having been lured to Australia by Nathan Tinkler's Patinack Farm and Chris Waller in the past. \"We had to put a pattern in place for him to do some riding for us during the spring,\" Godolphin's head trainer John O'Shea said. \"[Retained rider] James [McDonald] struggles with anything under 54 [kilograms] and we need somebody to get that done.\n\n\"We've got multiple group runners in Melbourne and Sydney and there's an opportunity for lighter-weight rides in group 1 races wherever we may need him. Some days we might have Sammy [Clipperton] and James in Sydney and need someone in Melbourne and some days [it might be the opposite]. But I think there's sufficient enough rides there now and we probably didn't have the firepower last year. There's enough there now to warrant a few rides for Joao.\"\n\nMcDonald will partner $2.60 favourite Exosphere in the Golden Rose, with Clipperton to be legged aboard Holler and Moreira on Shards as Godolphin flexes its considerable muscle at Rosehill. The Golden Rose is unlikely to attract a field of double-digit runners after losing drawcard Vancouver last week in favour of a Caulfield Guineas campaign.\n\nIt will do little to deter Exosphere's backers after the colt blitzed his four rivals in a muddling Run To The Rose. \"Until we see the make-up of the field we'll just play it by ear and concentrate on getting the horses ready,\" O'Shea said. \"We'll worry about what happens during the race on raceday. Exosphere looks really good, Holler has made dramatic improvement and I'm really happy with where Shards is at. He's got Press Statement form so it's not too much different to a lot of the others.\"\n\nMoreira won't potentially be the only Hong Kong-based jockey flying in for the Golden Rose, with Brett Prebble on standby to ride Furious Stakes winner Speak Fondly after Gai Waterhouse gave the nod for the filly to start on Saturday.\n\nThe Golden Rose is one of the few group 1s missing from Waterhouse's resume. Waller has already won the race with Zoustar and will rely on Press Statement (Tye Angland) to give him a second Golden Rose success in three years as he leans towards bypassing the race with Japonisme and Wudang Mountain.\n\n\"When you've got a horse you really think can win the race you put them back in, but they [Japonisme and Wudang Mountain] are extremely unlikely,\" Waller said.\n\nSebring Sun (Jim Cassidy), Gold Symphony (Tommy Berry) and Rageese (Brenton Avdulla) are other confirmed starters. Ron Quinton will wait until Monday before deciding whether Let's Make It Rain will take his place in the field.\n\n\"He's a chance of running, for sure,\" Quinton said. \"We'll be making a decision [on Monday] at some stage and he'll just gallop like normal on Tuesday.\" The story first appeared on The Sydney Morning Herald.", "source": "Inverell Times"}