{"published": "2015-09-24T13:49:23Z", "media-type": "News", "title": "Employer-Supplied Financial Education Is The New Job Benefit", "id": "88948028-8ca3-4835-a9ff-89b6f4e90191", "content": "NEW YORK ( MainStreet ) — If you want a paycheck, get a job. If you want benefits, get a job. If you want financial education, get a … job? Yes, that is correct. One of the fastest-growing perks of employment today is employer-supplied financial advice. And it’s going to continue growing, because evidence is that it works for employees and employers alike. \n \nThis is no ripple, but a full-fledged groundswell of change. Some 93% of big employers surveyed by Aon Hewitt in 2015 said they want to do more to help employees’ financial well-being than just sponsoring retirement plans. They plan to do that by adding new plan features, mobile apps or online tools that will help participants grasp financial concepts and do their own financial planning, according to the survey. \n \nEmployers give all kinds of financial advice to employees, according to Rob Austin, Aon Hewitt ’s director of retirement research. Some is elementary market intelligence, like the difference between a stock and a bond. Other companies help employees learn personal finance skill such as budgeting. “We really find it running the gamut,” Austin said. \n \nThe quality of the information and manner of instruction also vary. Some companies may do little more than invite a local stockbroker to give a lunchtime sales pitch thinly disguised as an investment seminar. Others provide one-on-one time with a financial planner. \n \nEmployers typically make an effort to give employees useful, unbiased advice, according to North Carolina State University researcher Robert Clark, who examined employer financial wellness programs for a 2012 research study . Clark said typical participants in his study did half-day to two-day programs. Some used outside providers and others had employees put on the programs, but quality was generally good, Clark said. “The companies we worked with seem to be taking the whole process seriously,” he said. \n \nThe companies aren’t breaking the bank to do this. The Consumer Financial Protection Bureau in 2014 reported that the U.S. Army spent just $22 per soldier for an eight-hour financial wellness training program, and the average private employer who did financial wellness spent $144 per year per worker. From these modest investments, employers report significant benefits. Essentially, several studies have found that financial wellness education pays for itself and then some. \n\n   next   last »", "source": "Leavenworth Times"}