{"published": "2015-09-08T16:40:17Z", "media-type": "News", "title": "Dear Monty: Property owner questions eminent domain offer", "id": "54ef1df0-a471-405b-bdb1-048a0ff07aa9", "content": "Reader question: We are in the middle of the eminent domain process. Our rental house is being taken for a new highway. We have 101,685-square-foot property with a 1,466-square-foot, three-bedroom, two-bath house. The Department of Transportation (DOT) offer came in at two hundred thousand dollars. Based on other sales we are aware of in the neighborhood we feel that their offer is quite low. What are the average prices DOT pays for a property under these circumstances? Thanks, Mike and Joan C. Monty’s answer: The state has an obligation to treat its taxpayers fairly in an eminent domain transaction, often called a condemnation. There are cases where the property owner contests the state’s offer and the court orders them to pay more. There are cases where the court agrees with the DOT, and the property owner receives no additional compensation. And, there are property owners who do not question a DOT offer. In practice, the state is no different than any other buyer; they want to acquire your property as reasonably as they can. Checking averages is dangerous in any real estate transaction. Every property is unique and only sales of comparable properties should be considered. And those sales have to be adjusted for differences from the property in question. The adjustments on comparable properties can add up to significant dollar amounts. No property has an exact price. They all have a “range of value.” Were you furnished with a packet of information that explains how the condemnation process works? Check to see if the state will fund a second appraisal if you are not in agreement on the price they have offered. If you did not receive such a packet, call the representative you are working with and request this information. Check out the information packet first. You may hear from an appraiser or an attorney if you have not already. Condemnations are a steady source of business for appraisers and attorneys. In some states, DOT bids out the necessary appraisals in a package. The appraisals are necessary to initiate an offer to the property owner. The lowest bidder wins all the appraisal business. Some attorneys and appraisers believe: The DOT bidding process attracts appraisers seeking a continuing relationship with the DOT. Conservative appraisals tend to foster more appraisal opportunities from the state. Bidding the appraisals in a package incentivizes the appraiser to spend less time on each appraisal to improve their profit margins. By spending less time, the chance of error increases. Interview both appraisers and attorneys Conduct an Internet search for “condemnation attorneys .” Do the same search for appraisers. The appraisers often have a designation such as Member Appraisal Institute (MAI) or Society of Real Estate Appraisers (SREA) that indicate they have completed advanced study courses in the field. An experienced condemnation attorney may have a recommendation or will assist you in selecting an appraiser, or vice versa. These attorneys may work on a success only fee. You will be asked to share the state appraisal with them before they can decide you have a case they are willing to defend. If they do not take your case, it could be a signal they do not believe you can win, or win enough to pay the legal fee and still come out ahead. Appraisers will not work on a success only fee. They are being paid for their opinion of value. Page 2 of 2 - Find a qualified attorney to help you with this process. Contact some them to learn if they are seeking opportunities in the freeway project. Or seek an appraiser that specializes in condemnation appraisals. Condemnation Law is complex. Appraisals are prepared using techniques unique in the appraisal industry. The expertise between appraisers varies just like any other service providing business. Many residential home appraisers will not accept an appraisal for condemnation purposes for this reason. Here are a few starter questions What percentage of your business is eminent domain? ​​Are you working with other property owners in the same project? Will having other clients in the project reduce our expenses? Will your project learning curve be shorter by virtue of other clients here? Will you take this case on a success-only fee? How many eminent domain cases have you handled? Can you share your sense of the value we can attain based on your appraisal review? ​These steps are the best method to ensure you receive just compensation. Richard Montgomery gives no-nonsense real estate advice to readers’ most pressing questions. He is a real estate industry veteran who has championed industry reform for over a quarter century. Send him questions at DearMonty.com .", "source": "Fairport-East Rochester Post"}