{"published": "2015-09-24T08:16:06Z", "media-type": "News", "title": "The usually glam GMB ladies got mucky with some tough mothers.", "id": "69421619-1485-4aeb-b5ec-9da8a8954376", "content": "Good Morning Britain presenters Susanna Reid and Kate Garraway proved they weren’t afraid to muck in as they joined in the Tough Mums challenge.\n\nAHEAD: Find out how our presenters and mums got on in the #toughmums challenge…now that's teamwork guys! pic.twitter.com/HRo8ewXLWN\n\n— Good Morning Britain (@GMB) September 24, 2015\n\nThe TV stars – usually seen with perfectly blow-dried hair, pristine make-up and glamorous dresses on the ITV breakfast show – slid down mud banks, waded through filthy water and swung through the air on ropes as part of the gruelling obstacle course.\n\n@kategarraway @susannareid100 you go girls!!! pic.twitter.com/HlELX6sYxi\n\n— Eᴍᴍᴀ❣ (@_EmmaLW_xo) September 23, 2015\n\nGMB chose 50 inspirational mothers to join the presenters and celebrity guests including Pussycat Doll Kimberly Wyatt and X Factor winner Sam Bailey on the 5km challenge, designed by obstacle course organisers Tough Mudder.\n\nSo proud of you @susannareid100 ❤️ pic.twitter.com/FUGY7YDuMy\n\n— Jess… (@Guest11Jessica) September 23, 2015\n\nSusanna Reid said: “A lot of fears were conquered out there today. Every single one of the awesome women taking part had already overcome obstacles in their lives. It was an inspiration.\n\n.@kategarraway and @susannareid100 Reid take part in a Tough Mums obstacle course for #GMB http://t.co/AL8xM8RHsm pic.twitter.com/TnNeFkICka\n\n— REX (@rexfeatures) September 23, 2015\n\n“It was hard but was all about team work and helping and encouraging each other. No one was alone – and at every obstacle along the course, as I thought, ‘I can’t do this’ there was a mum doing something that scared her whether it was heights, or deep water or tunnels. And they all did it! And that made us all tougher.”", "source": "Community Newsgroup"}