{"published": "2015-09-08T00:36:11Z", "media-type": "News", "title": "Communities ready to open their doors after pope’s refugee appeal", "id": "764c15e9-363f-44ac-944b-4609aa8a0a2a", "content": "Vatican City (AFP) – Campaigners have warmly welcomed Pope Francis’s call for every Catholic parish in Europe to take in a refugee family to help ease the continent’s unprecedented migrant crisis. \n \nFrancis, giving the Angelus blessing in Saint Peter’s Square on Sunday, urged “every parish, every religious community, every monastery, every sanctuary in Europe” to take in migrants in need. \n \nSome see the proposal as over-ambitious but many groups called it a useful blueprint that draws on the formidable organising skills of the Catholic Church. \n \n“There are tens of thousands of parishes in Europe,” said Father Peter Balleis, international director of the Jesuit Refugee Service (JRS). \n \n“And in each one, hundreds of families are able to organise and take turns welcoming refugees.” \n \nAccording to the UN refugee agency, it takes about six to eight months to process an asylum application in Europe, sometimes longer if legal issues arise. During this time, many refugees are in desperate need of a place to stay. \n \n \n \n \n \n– Increasing efforts – \n \nThe JRS has already been working with refugees looking for a temporary home, and plans to expand its efforts. \n \nFive years ago the group launched a programme in the Paris area called “Welcome”, under which around a hundred families and religious communities house refugee families for five weeks. \n \nThe programme has been successful in helping migrants integrate and is now being rolled out to several other French cities, as well as to other countries, such as Spain. \n \nJRS says the five-week time limit is to encourage the refugees to be independent — without leaving any of the refugees on the street. \n \n \n \n \n \n“After a while, you need the person to enter into the society” of the host country, said Jean-Marie Carriere, regional director of the JRS. \n \nOther European communities have also already welcomed thousands of asylum seekers and are preparing for more. \n \nCardinal Angelo Bagnasco, chairman of the Italian bishops’ conference, told the country’s La Repubblica daily there was evidence “of an important movement in all dioceses”. \n \nItaly’s Catholic organisations have already taken in between 15,000 and 20,000 asylum seekers. \n \nIn Austria too, dioceses have offered thousands of places for migrants to stay and several have announced plans to do more. \n \n \n \n \n \nPannonhalma Abbey in northwest Hungary, which is run by the Benedictine Order, has also opened its doors to Syrian families trekking across the country to western Europe, and said it is prepared to repeat the experience. \n \nCarlotta Sami, spokesperson in Italy for the UN refugee agency, said that the pope’s calls to action supported the agency’s goals. \n \n“The pope’s voice has helped us for years to strongly support the welcome of those fleeing war and violence,” she said. \n \n– Opportunity for interreligious dialogue – \n \nOne detail the pope didn’t mention in his appeal is that the majority of the 336,000 migrants who arrived this year on Europe’s shores are Muslim. \n \nFather Balleis saw it as a chance for foreign and local families to “get to know and understand” one another. \n \nThe Catholic Church isn’t the only church appealing for greater solidarity. \n \nThe archbishop of the Finnish Lutheran Church, Kari Mäkinen, called Saturday for the country’s parishes to open up their centres for retreats and summer activities to refugees. \n \nThere has also been an outpouring of solidarity from groups with no religious affiliation, in Germany and elsewhere. \n \nIn France, the Singa foundation said it had received more than 1,000 offers of accommodation in just a few days, and in the UK more than 2,000 residents have said they are ready to welcome refugees as well. \n  Religion  Beliefs  Politics  Government  Catholic Church   \n\n \nArticle source: Article Source \n\nThe post appeared first on .", "source": "RocketNews"}