{"published": "2015-09-19T07:13:00Z", "media-type": "News", "title": "The harder they fall - Yuma Catholic downs Dysart with ease", "id": "1003b02c-791b-45d9-913f-651a90473d5c", "content": "On paper this battle of undefeated teams seemed like an intriguing litmus test of a football classification system that considers socioeconomics and on-field success. \n  \nDysart came into Friday 3-0 in its first season of Division IV play. The El Mirage school has around 1,600 students but has rarely competed in football since the 1980s  and was butting up against a wall of more experienced, deeper teams in Division III. \n \nVisiting Yuma Catholic entered 4-0 and the polar opposite. The private school has around 350 students but has become the top small school program in Arizona. Winning the last two Division V state titles pushed the Shamrocks up to Division IV. \n \nBut as Friday night reminded observers, you can only put 11 of your student body on the field at a time. If you factor in special teams and two-way starters, that's around 20 players seeing the bulk of the action. \n \nAnd not too many Arizona schools of any size have a top 20 as skilled or well-drilled as Yuma Catholic. The Shamrocks proved that again by blitzing the Demons 58-20 Friday behind five touchdowns by junior Jaylen Barnes. \n \n\"(Barnes) is a good dual-threat kind of kid,\" said Yuma Catholic coach Rhett Stallworth. \"He's got some gifts too. He's not overly a burner on the straightaway but he's very shift, can catch the ball well and runs hard.\" \n \nYuma Catholic (5-0, 2-0) scored less than two minutes in as Stallworth's nephew, senior quarterback Stetson Stallworth tossed a 37-yard touchdown to wide-open junior tailback Jaylen Barnes. \n \nA fumble by senior quarterback Tyree Taylor had the visitors in business again. Penalties wiped out touchdown passes to junior tight end Blake Sandoval and Barnes. \n \nBut on fourth and 22 Stallworth tossed a textbook post to Barnes for a 30-yard touchdown. \n \nEven after three straight Dysart sacks on the next Yuma Catholic drive, a helmet-to helmet hit made it fourth and manageable. Tailback Wyatt Skurski tossed a 16-yard pass to senior receiver Brandon Hunter for a first down. \n \n\"That's a good team. They're a defending state champion for a reason,\" Dysart coach Manuel Alcantar said. \n \nThat set up a 13-yard Barnes touchdown run to open the second quarter. Hunter shook the defense with a double move and caught Stallworth's 35-yard touchdown pass for a 28-0 lead. \n \nHunter caught six passes for 104 yards in the first half. Barnes added touchdown runs of 1 and 16 yards, sandwiched around a safety when Taylor pitched the ball wildly to avoid a sack in the end zone. \n \nYuma Catholic led 44-0 at the half. And the offense was humming with new parts like Stallworth and Skurski (transfers from Las Vegas giant Bishop Gorman) and 2014 reserves Barnes and Hunter. \n \n\"They work hard and we spend a lot of time on running the system we run,\" Stallworth said. \"They take it to heart and watch film. They take direction well and it shows on the field.\" \n \nDysart senior receiver/defensive back Isaiah Hall fumbled the opening kickoff of the second half about 10 yards forward. He regained it on the dead run and sprinted 72 yards for a touchdown. \n \nHall could be the Demons' impact transfer, after playing a bit late last season at Goldwater. \n \n\"Isaiah's a stud. He's a true 4.4 40(meter-dash) kid,\" Alcantar said. \"That's his second kickoff return this year.\" \n \nStallworth hit junior receiver Julian Aitken for a 26-yard score to make it 51-7 and both teams began to empty their benches. \n \nAnother Demon fumble set up a one-yard bootleg score by freshman quarterback John Henderson. \n \nDysart (3-1, 0-1) played with pride in the fourth quarter. Senior tailback Pedro Banda rushed for a 3-yard touchdown. \n \nJunior quarterback Mackinnley Halla dropped in a pretty 33-yard touchdown pass to Banda to complete the scoring. \n \nAny chance the Demons had to make this competitive probably went out the window Thursday. That's when three senior starters - receiver/cornerback Kwasi Okafor, two-way lineman Cesar Lopez and offensive lineman Tommy Lopez) were suspended for a violation of team rules. \n \nFollowing the adrenaline rush of Dysart's first 3-0 start in 15 years, it's Alcantar's mission to refocus his group following two tough days. \n \nAnother top five Division IV team in the Arizona Varsity media poll, Goodyear Estrella Foothills, hosts the Demons next week. \n \nBut the third-year coach said all the big goals remain for a program without a winning season in more than 15 years. \n \n\"I told the boys, 'you played without ever practicing as this team before tonight,'\" Alcantar said. \"It was a bad week but there's no excuses for it. We're going to put our foot back in the ground and get grinding again. We're not going to give up. We're 3-1.\"", "source": "Daily News-Sun"}