{"published": "2015-09-24T17:49:25Z", "media-type": "News", "title": "Big Chill Ushers in a New Era of Style to the Kitchen", "id": "94d687b3-7e3e-4469-a0f8-c7c60b29f9e1", "content": "SOURCE Big Chill\n\nIntroducing the Big Chill Classic: Industrial Style, American by Design\n\nCharting a new course for industrial chic design, the Big Chill Classic Series mixes rugged metals, distinctive finishes and rich colors, making it easy for style-hungry cooks to turn up the heat.\n\nBOULDER, Colo. \n\nThe Classic Series is the newest addition to the Big Chill product portfolio, which features multiple eras of style for the home kitchen, including whimsical Retro-inspired designs as well as contemporary and colorful Pro-style appliances. The new Classic Series pushes beyond the bounds of historicism - a fresh analysis of function and form, a new aesthetic.\n\nHandcrafted in Reading, PA \n\n\"Design is as important as function, which is why at Big Chill we are obsessed with creating appliances that offer exceptional, unexpected style,\" says Orion Creamer \n\nIndustrial Chic: The New/Old Decor Trend\n\nThe new Big Chill Classic Series was inspired by American industrial chic design, a movement that finds beauty in aged, utilitarian design. Characterized by reclaimed woods, exposed brick, ductwork on the ceiling and worn textures mixed with hardy metals, this aesthetic works either as an all-encompassing design or just as a small accent mixed with another style. With the Classic Series, Creamer created a new utilitarian design that is timeless, simple and natural in any type of kitchen design.\n\n\"We designed the Classic line as a unique interpretation of industrial chic designs, but with a purely American feel. Neither vintage nor overly designed, the Classic fits effortlessly into a variety of different decors, from traditional to modern and everything in between,\" says Creamer. \n\nA Home Chef's Dream: the Quality behind the Craftsmanship \n\nEach Classic 1900 Series stove is built to order in Pennsylvania \n\nBig Chill Classic hoods are designed to match the stove in both color and design. Handcrafted with commercial-grade stainless steel with the largest filtered capture in the industry, these hoods are designed to perform as well as those in commercial kitchens. Big Chill's Classic stainless steel hoods are effective and stylish, with dishwasher safe stainless steel filters, variable blower control, and commercial grade 18 gauge 300 stainless steel construction. The Classic Series features two hood styles: the Classic 1900 Series hood is available with a metal trimmed utensil rail to match the stove, and the Classic hood features a clean profile. Both are available in all six Classic series colors.\n\nBig Chill was founded in 2001 in Boulder, Colorado \n\nThe Big Chill Classic Series can be purchased online. For more information visit www.bigchill.com. \n\nAbout Big Chill\n\nBig Chill was founded by Orion Creamer \n\nPhoto - http://photos.prnewswire.com/prnh/20150918/268211 Photo - http://photos.prnewswire.com/prnh/20150918/267884\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/big-chill-ushers-in-a-new-era-of-style-to-the-kitchen-300148660.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KWES NewsWest 9"}