{"published": "2015-09-16T20:10:57Z", "media-type": "News", "title": "Kenny meets campaigners over disability proposals", "id": "31d22c44-ba2b-4096-8d43-a0b5d8aa0f0f", "content": "Taoiseach Enda Kenny and Minister of State Kathleen Lynch have held a meeting with a group campaigning for better services for people with disabilities who have been protesting outside Government Buildings for the past day and a half. \n \nA spokesperson for the Taoiseach said the meeting lasted an hour and a half and that the Taoiseach and the Ms Lynch, Minister of State at the Department of Health with special responsibility for Primary Care, had listened carefully. \n \nThe spokesperson said the Government will be giving careful consideration to the important points raised and would be publishing its comprehensive employment strategy for people with disabilities shortly. \n \nActivists say they are disappointed they have not achieved anything concrete. \n \nHowever, they said they will not be protesting overnight. \n \nThey plan to stage a demonstration outside the Dáil at 10am tomorrow. \n \nTánaiste and Minister for Social Protection Joan Burton earlier said proposals by disability campaigners for how services should be funded will be examined very seriously by Government. \n\nShe was responding to questions about a protest by people with disabilities outside Government Buildings, and about their call for funding to be made available to the individual to access services, rather than to service providers. \n \nThe Tánaiste said that over a number of years the Government should give consideration to the points that had been made for some time by organisations representing those with disabilities. \n \nShe said she was conscious of the need and that as resources became available it was a very important target area. \n \nShe said she welcomed the focus on the issue. \n \nMs Burton said she was happy last year to reintroduce on a partial basis the Christmas Bonus payment for social welfare recipients, and her department hoped to do more on that in the forthcoming budget. \n \nResponding to queries regarding cuts to disabilty services since 2008, the Health Service Executive said it is committed to enhancing care for clients right across the health service and seeks to provide the best level of care.  \n \nIn a statement, the HSE said it is working closely with all service providers to ensure that the provision of services is effectively managed. \n \nIt said the funding allocation for 2016 has not yet been finalised. \n \nBut it said it should be noted the HSE disabilities 2015 allocation increased by 2.1% over the 2014 allocation.", "source": "RTE Online"}