{"published": "2015-09-28T22:24:29Z", "media-type": "News", "title": "Georgia Plans To Execute Its Only Woman On Death Row On Tuesday", "id": "693ae030-4239-4291-b248-dbf7c1696ff2", "content": "Georgia is set to execute its only woman on death row Tuesday evening. If all goes according to the state’s plan, Kelly Gissendaner will be the first woman the state has executed in 70 years. She was sentenced to death in 1998 for plotting the death of her husband, Douglas Gissendaner, with her boyfriend. \n \nGissendaner drove her boyfriend, Gregory Owen, to her house, gave him the murder weapons — a nightstick and a hunting knife — and then went to a nightclub with friends, according to court documents. Owen ambushed Douglas and forced him to drive his car to a remote location that Gissendaner chose beforehand. \n \nOnce they arrived, Owen beat Douglas and stabbed him. Owen took Douglas’s wedding ring and watch to make it look like a robbery. Gissendaner later arrived at the scene and helped her boyfriend burn her husband’s body and car. Law enforcement was unable to find Douglas’s body for weeks. \n   \nOwen accepted a plea deal and testified against Gissendaner. In exchange, he received a life sentence without the possibility of parole. Gissendaner refused to take a plea and lost when she went to trial. \n \nAs Gissendaner’s execution date nears, two of her and Douglas’s children are calling for her life to be spared. \n   “We’ve lost our dad. We can’t imagine losing our mom too,” daughter Kayla Gissendaner said.  \n youtube.com \n   \nIn response, Gwinnett County District Attorney Danny Porter told the Atlanta Journal-Constitution that it was “manipulation.” \n \n“The case began with manipulation by Kelly Gissendaner and it appears it will end with manipulation by Kelly Gissendaner,” he said, adding that Douglas’s parents have wanted the execution to go forward. \n \nOn Monday, the Georgia Board of Pardons and Paroles announced that it will meet on Tuesday to “receive and consider supplemental information” about the case. Previously, the board had denied clemency. The board has the option to allow the denial of clemency to stay, to grant a stay of up to 90 days, or to grant clemency. The board has the sole authority to grant clemency in Georgia. \n \nThis is the third time the state has set an execution date for Gissendaner. The first time, it was called off because of the weather. The second time, it was called off after the execution drugs were found to have particles floating in them. \n           \nView this image › \n  \nGeorgia’s pentobarbital on the date it was scheduled to be used.  Georgia Department of Corrections \n   \nGeorgia, like some other death penalty states, obtains its execution drugs from a compounding pharmacy that mixes the drug up in secret. \n \nThe state concluded that the likeliest cause was that the drugs were stored at too cold of a temperature, although its expert floated the possibility that there was a problem with how it was mixed, and the state attempted to withhold test results that disagreed with its narrative. \n \nGissendaner’s attorneys argued that the hours she waited not knowing if the “cloudy” drugs would be used on her amounted to cruel and unusual punishment, and that it showed the state was likely to use questionable drugs on her in the future. \n \nBut U.S. District Judge Thomas Thrash disagreed, finding that the state “did not intentionally subject [her] to uncertainty for the sake of inflicting more pain upon her.” \n \n“It is not enough to show that the State may obtain defective lethal injection drugs,” the judge wrote when he dismissed the case in August. Gissendaner “must show that there is a substantial risk that the defective drugs will be used on” her in the future. \n \nHe added that “if anything, the March 2 incident shows that the state is unlikely to use defective drugs on” her. \n \nGissendaner asked him to reconsider his ruling, which the judge declined to do. On Monday, Gissendaner notified the court that she was appealing the decision to the 11th Circuit Court of Appeals. \n \nGeorgia intends to use compounded drugs again, but this time plans on storing the drugs in a new refrigeration unit to regulate its temperature. \n \nGissendaner also has a petition at the Supreme Court seeking a stay of execution based on her claim that prison officials violated her rights by having “thwarted” the clemency process. \n \nClaiming that officials “actively frustrated the [clemency] procedures established by Georgia law,” Gissendaner’s lawyers write that such actions violated her constitutional due process rights. \n   \nCheck out more articles on BuzzFeed.com!", "source": "BuzzFeed"}