{"published": "2015-09-25T15:26:18Z", "media-type": "News", "title": "Body Language Expert Picks Debate Winner", "id": "4c1f6359-ba5a-4420-9f1e-6794269e6368", "content": "Unconscious body movements during the first televised French-language debate were very revealing of each leader's state of mind. The leader with the most convincing and spontaneous body language was clearly NDP Leader Thomas Mulcair , according to Christine Gagnon, an expert in non-verbal communication. \n\n\"It's plain as day! Mr. Mulcair is much more spontaneous and at ease than the others!\" Christine Gagnon exclaimed, staring at the screen. Watching the debate with the Huffington Post Quebec, the President of the Nonverbal Communication Consulting Firm evaluated the gestural performance of the leaders live during the debate, broadcast on Radio-Canada and on the La Presse website. \n\nHere is what caught her attention in each leader's body language: \n\nMulcair, irritated and on the offensive \n\n\n\nThomas Mulcair's palms were almost always turned downwards. \"It's a sign of domination. He is trying to silence his opponents,\" the expert said. He frequently turned his face towards the left, the \"more emotional\" side of the body that allows you to maintain a connection with your interlocutor. He made many arm movements, showing he is at ease improvising, that he's adapting as he goes. \n\nOn several occasions, especially when Liberal Leader Justin Trudeau was speaking to him, Mr. Mulcair showed signs of \"irritation,\" bordering on anger. \"His skin is becoming flushed, his nostrils flared, his eyebrows furrowed. He is very annoyed,\" Ms. Gagnon said. \n\nDuceppe, directive and defensive \n\n\nBloc Quebecois Leader Gilles Duceppe missed his chance to establish a visual connection with viewers. \"He never looks into the camera. That's a shame. If you want votes, you have to create a strong visual and emotional connection with voters,\" the synerologist observed. His eyes and finger pointed at his opponents, Duceppe spent the time replying and arguing, she added. \"He put himself in a defensive position.\" \n\nUnlike the others, Duceppe fully occupied his space, holding his podium with a firm grip. \"This non-verbal gesture indicates he is trying to occupy his place, give himself importance.\" The finger pointing means he is very directive. \n\nHarper, neutral and cerebral \n\n\nGagnon didn't beat around the bush: \"Stephen Harper lacks all spontaneity in his gestures.\" The Conservative leader endlessly repeats the same gestures, which are all very symmetrical, almost robotic. This symmetry indicates a desire to control the debate. \n\nHe frequently looked into the camera, which is a good thing for creating a connection with the audience, but his smile was very unnatural. \"His eyebrows never move, and the rest of his face doesn't follow. That's why you have a hard time believing his smile,\" said the expert in non-verbal communication. Mr. Harper keeps his \"fake\" smile when criticized by his opponents, which communicates both unease and arrogance. \n\nMay, stressed and overshadowed \n\n\nDespite her laudable efforts to take part in a debate in a language she doesn't have a firm grasp of, Green Party Leader Elizabeth May was not very convincing. At least, in terms of her body language. \"Her feet are turned inward, she is not occupying the space behind the podium, her hand is moving but her lips are closed,\" noted Ms. Gagnon. She gave all the signs of being unable to stand up to her opponents. \n\nThe clearest sign: \"Ms. May almost always has a pen in her hand, which shows she is looking for something to help ground her, assert herself. Her closed right hand also shows she's looking to exert control... and that she's stressed,\" she observed. \n\nTrudeau, a good student, but stiff \n\n\nThe Liberal party leader is standing straight, straight, straight... \"Too straight, too stiff, too perfect,\" she said. He's trying to convince viewers that he embodies change, but he seems very orderly, \"a good student who's by the book.\" \n\nThese stiff gestures betray the stress in the Liberal leader's performance. However, she noted that he had excellent visual contact with viewers, and that his speech was calm and deliberate, more or less similar to that of Harper. \n\nA debate mostly… between Mulcair and Harper \n\nHarper seemed almost entirely focused on Mulcair, Ms. Gagnon concluded. Avoiding almost all eye contact with his other opponents, Harper focused all his energy on replying to Mulcair, and vice-versa. \n\nLike Us On", "source": "Huffington Post Canada"}