{"published": "2015-09-02T13:19:12Z", "media-type": "News", "title": "W.K. Kellogg Foundation invests in workforce development programs to help families across the U.S. increase workforce mobility and achieve economic security", "id": "948be22e-28c0-42c4-ade7-2c56ec32be5c", "content": "SOURCE W.K. Kellogg Foundation\n\nFoundation grants $11.6 million for two pilot programs to give communities more access to job training and upskilling resources.\n\nBATTLE CREEK, Mich. \n\n\"All parents deserve the opportunities and training to obtain good jobs, advance in their careers and provide financially secure homes for their children,\" said La June Montgomery Tabron, president and CEO of WKKF. \"We believe working with these 14 organizations and their supporting partners in the community will provide greater access to safe, quality jobs and the skills and training to help parents earn a family-sustaining income and increase the opportunities for their children to succeed in school and in life.\"\n\nQuality, affordable and flexible child care is one of the critical support services that parents need in order to succeed at work. The seven STEPS grantees include workforce development organizations that are leading and formally partnering with early childhood education providers, identifying unemployed mothers who are seeking jobs and already have their children enrolled in early child care, pre-K programs or elementary schools. Designed to change conditions for both parents and their children, this effort provides unemployed mothers with access to short-term, demand-driven, sector-based workforce training, education and support that can lead to employment. \n\n\"United Way of Greater Cincinnati \n\nThe seven MOVE UP grantees include workforce development organizations that are partnering with employers to offer incumbent working parents in low-wage, entry-level jobs access to training programs, career development and work supports, like child care and transportation, so that they can move up in their careers and provide better opportunities for their children. \n\n\"We are excited to have the opportunity to partner with the Kellogg Foundation on this important pilot initiative, which is very much in line with our mission of transforming lives through employment,\" said Phil Weinberg \n\nBoth pilot study programs are grounded in WKKF's commitment to supporting community-led solutions that help remove the barriers to economic security faced by lower-income families and families of color. Parents who are financially secure can better support their families and help ensure their children can succeed in school and in life.\n\nSTEPS and MOVE UP are part of the foundation's efforts to increase opportunities for employment in quality jobs. Another recent example is the foundation's participation in the 100,000 Opportunities Initiative, an employer-led coalition designed to create meaningful employment for America's opportunity youth. There are currently 5.5 million opportunity youth in America – those youth ages 16-24 who are neither employed nor in school.\n\nThrough these and other community partnerships, WKKF aims to ensure that parents have access to every available resource – including job training, opportunities for growth and family-friendly work environments – that helps them better support their families and save for their children's futures. \n\nA complete list of the 14 organizations is provided below. Details for each grant are available.\n\nSTEPS Grantees: \n\nAlbany Community Action Partnership \n\nAlbany, New York \n\nBrighton Center Inc. \n\nNewport, Kentucky \n\nFamily and Workforce Centers of America \n\nSt. Louis \n\nGoodwill Industries of Central Michigan's Heartland \n\nBattle Creek, Michigan Tacoma, Washington \n\nJane Addams Resource Corporation \n\nChicago \n\nUnited Way of Greater Cincinnati\n\nCincinnati \n\nMOVE UP Grantees: O\n\nOakland, California \n\nSTRIVE International\n\nNew York \n\nHealthcare Career Advancement Program (H-CAP) \n\nNew York \n\nMetropolitan Career Center (MCC) \n\nPhiladelphia \n\nProject QUEST \n\nSan Antonio \n\nTowards Employment \n\nCleveland Grand Rapids, Michigan \n\nAbout the W.K. Kellogg Foundation\n\nThe W.K. Kellogg Foundation (WKKF), founded in 1930 as an independent, private foundation by breakfast cereal pioneer Will Keith Kellogg \n\nThe Kellogg Foundation is based in Battle Creek, Michigan \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/wk-kellogg-foundation-invests-in-workforce-development-programs-to-help-families-across-the-us-increase-workforce-mobility-and-achieve-economic-security-300136636.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KRHD TV"}