{"published": "2015-09-23T09:49:19Z", "media-type": "News", "title": "No place for Bismarck in World Cup test against Samoa", "id": "5416f450-be4d-4e8e-b5ee-81a117d3e1db", "content": "Duanne Vermeulen will play in his first Test for the Springboks on Saturday against Samoa after his serious neck injury earlier this year, while Heyneke Meyer could find no place for Bismark du Plessis in his 23-man squad. The Springboks have made eight changes to the starting line-up and included two new players on the bench to meet the challenge of a talented Samoan team in their second match of the Rugby World Cup at Villa Park in Birmingham on Saturday.\n\nAdriaan Strauss, who will win his 50th cap, is the starting hooker, while Duane Vermeulen will make his first Test appearance of the year in the No 8 jersey as coach Heyneke Meyer reacted swiftly to the shock of defeat against Japan.\n\nWillie le Roux, JP Pietersen and Damian De Allende return in the backline – with skipper Jean de Villiers shifting to outside centre – while there are new halfbacks in Handré Pollard and Fourie du Preez. In the pack, Eben Etzebeth returns to the starting line-up with Vermeulen and Strauss. On the bench, Schalk Brits and Frans Malherbe make their first appearance on a Rugby World Cup teamsheet.\n\n“It’s been a very tough week after the massive disappointment of last weekend and we owe our supporters a winning performance on Saturday,” said Meyer.\n\n“The last few days have been a time for retrospection and the team this week has been selected specifically with Samoa in mind, as we know we’ll have to be at our very best to succeed.\n\n“They will pose a massive challenge and I think it’s fair to say that it’s the biggest game of the season for us. They have a very strong team with players plying their trade all over the world.\n\n“Four years ago in the World Cup pool match in New Zealand, the Samoans pushed the Boks close and we’re expecting more of the same this weekend. It will be brutally physical and we have to be 100% focused and ready.”\n\nMeyer congratulated Strauss on his 50th cap: “Adriaan is not only a great ambassador for South Africa and the Springboks, but also someone who isn’t shy to put in the dirty work without saying too much.\n\n“He leads by example and has shown a lot of resilience in coming through trying times. It’s well-deserved and a privilege only a very small percentage of Springboks have achieved. He is a true leader and was an inspirational vice-captain of this team in 2012 and 2013.”\n\nMeyer said it’s also very good to see Vermeulen back in the team. It will be the current South African Rugby Player of the Year’s first Test of 2015 after he underwent neck surgery early in July.\n\n“Duane has been one of the stalwarts of this team and it’s great to have him back in the mix. He is one of the best loose forwards in the world and apart from being a superb ball-carrier and also a great line-out option, he is also good on the ground and brings leadership to the team”, Meier said.\n\nHe also explained that they decided to also give Le Roux, De Allende, Malherbe and Schalk Brits, who was impressive in the second half against Argentina in Buenos Aires last month, a well-deserved run this week to bring some energy and unpredictability to the team. Jesse Kriel and Lood de Jager have proven themselves this season and according to Meier they will need them to also make a massive impact off the bench on Saturday.\n\n“It means some players have dropped out of the squad altogether but this is a 31-man campaign and they will have other chances, but we needed to make changes after Saturday’s performance”, he concluded.\n\nWillem Alberts was the only player not considered because of injury – he picked up a calf strain during the captain’s run in Brighton last Friday and will be reassessed early next week.\n\nThe team is: 15. Willie le Roux Toyota, 14. JP Pietersen, 13. Jean de Villiers (captain), 12. Damian De Allende, 11. Bryan Habana Toulon, 10. Handré Pollard, 9. Fourie du Preez, 8. Duane Vermeulen, 7. Schalk Burger, 6. Francois Louw, 5. Victor Matfield (vice-captain), 4. Eben Etzebeth, 3. Jannie du Plessis, 2. Adriaan Strauss, 1. Tendai Mtawarira.\n\nReplacements: 16. Schalk Brits, 17. Trevor Nyakane, 18. Frans Malherbe, 19. Lood de Jager, 20. Siya Kolisi, 21. Ruan Pienaar, 22. Pat Lambie, 23. Jesse Kriel.", "source": "Rekord Pretoria North"}