{"published": "2015-09-08T21:41:30Z", "media-type": "Blog", "title": "SNAPPED & CAUGHT: JOHN STEWART", "id": "43fce2cf-5fe0-41d7-b6eb-f653500a4a15", "content": "When our team thinks about the Fashion Forward Man,  various aspects other than personal style sometimes come into play.  Personality, Points of View, and Beliefs are also traits that we want to  learn about, and then reveal to you.  Back in March when we decided to  ask for your submissions to become part of our  Snapped & Caught Series,  we put the ball in our readers court. We were open for almost anything  that came our way, and we welcomed it with open arms. What we didn't  expect was a submission from New York native (and friend to FFM) John Stewart. \nFor  those of you that were heavily involved in that downtown, meets lower  east side, meets antique boutique, meets diesel, meets robots, and sugar  babies era of the mid 90's in NYC, chances are you have met John. Once  a heavily pierced face lad, the John Stewart of the past may be gone,  but the underbelly of this intriguing man still lies within.\n\n\nSo how did the coming of \"John\" begin??? Our inductee recalls it all began with his father taking him to The Village. Surrounded by eccentrics, and the carefree, this trip into the city would be one that he would never forget. One can only imagine the feeling of excitement and dare we say a hint of fear the young J.S. was experiencing.   \n\n\"The freedom that people displayed was crazy, the unbothered attitude, the fearlessness, struck a cord. I knew I was gonna dress village, work in the village, and BE the village. I never looked back from that mindset\" he shares.\n\nAs if his venture into town weren't enough, the final destination would be. His father was taking him to see The Rocky Horror Picture Show at the 8th Street Playhouse. \n He was celebrating his 13th birthday...\nPivotal points arise in all of our lives,  and in most cases, they happen several times throughout. It can be  visiting a foreign place for the first time, experiencing a breakup, or  receiving a miraculous blessing. How we choose to receive and react to  these moments mold us into the beings that we are today. For John, it  just so happens that one of his life changing moments involving seeing a  man prance on stage in panties and garter belts.  \nThough  the famous musical may have effected our latest Snapped and Caught  inductee to an extent, that doesn't mean that he chooses to mimic the  wardrobe choices of the show.  As always, we ask the question, how do  you define your personal style? \n\"Hmmmm. Kinda definitely bohemian,urban ,nomadic,future vintage,sporty spice realness, lol. I cant really define it other than to say \"I know what I like,\" he responds. As long as we have known John, his approach to fashion has been rather consistent. That doesn't mean that there hasn't been any mishaps along the way. Stewart shares a story of him being a little boy and wearing bell bottoms. As if to personalize his look, John explains that he would purposely sag the pants to give the illusion they wear drop crotch. But the primary purpose of doing this was to have the widest portion of the pant, completely cover his shoe. (Lets give that a moment...) Yes  John, we agree with you when you say that wasn't one of your better  looks. To pour salt onto the wound, John also shares that he used to  wear bulky sweaters, that he would tuck into his pants with a belt... Welp, we are happy that you left that behind too mister.  \n\n We know that we are sounding a bit tough on John, but for those of you who doesn't actually know him, we should only be fair and inform you that he would have it no other way. John himself is very witty, humorous,sometimes dark, and most of the time very direct. \nSlightly more evolved and more defined John recognized that he needed to tweak a little of his approaches to his personal style and how he wanted to be seen.  \n \"I completely know my body now. I know how something is gonna fall, sloach, drape, whatever...When I see something, I know immediately if thats my look. I know how something should fit to fit my temperment.... Its a FEELING!!! A bold POW WOW feeling,'' he laughs. \n\n\n\n\n\n\n\n\n\n\n\n\n\nWhat is you current occupation/field of work?Freelance brand specialist\n\n\nHow would you define your personal style?HummmKinda definately bohemian,urban ,nomadic,future vintage,sportyspice realness¿ lollI cant really define it other than to say\"I know what i like\"\n\nLooking back at your past, is there a period you now regret fashion wise?LolllWhen  i was a lil boy i used to pull my bellbottoms down dropcrotch style cuz  i thought it was the shit to have the bottom of the pant cover your  shoesAnd wear my sweaters tucked in my pants with a beltWheretheydothatat????....\nHow would you say that your taste have evolved. I completely know my body,how  something is gonna fall,sloach,drape,whatever...When i see somethingI know immediately if thats my #lookI know how something should fit to fit my temperment....Its a FEELING- A bold pow wow FEELING..lolll. But a FEELING\nName 3 to 5 public figures (men) whose style you appreciate. Why?Love Pherell-freestyle\nJeff Goldblum-Mens chic/legendaryJared Leto-ANDROGYNY meets life.Brad Pitt-chameleon Nick Wooster-Turned turning it into a businessWhere do you like to shop?All over, thrifshops,sample sales, lil honeycombhideouts for those unsaturated pieces .AtriumUntitledAtmosProbusTarget[sox only]\nWhen did you remove your piercings? Why? It was 1997A year in at Diesel Superstore andIt just wasnt the look anymore\nWhat trends in mens fashion are you currently seeing but strongly dislike? Not for nothing[Everybody cant wear SKINNY jeans]I mean reallly gurl..I love the step outa your comport zone Norma Rea attitude but jeeez Louise\nWhat do you do for fun?These days; work on d.i.y. home projects.,love my dog,health/health and more health  \n\nWhat are you favorite movies? :Sparkle:Agnes Of God:The Wiz:Liquid Sky\nUse 3 words to describe yourself?Happy/Animated/Restless\n\nHave you traveled lately? Where?No not latelyI mean no further than Vegas\nWhat is your ideal vacation place (or place that you would love to see)?AfrikaI would love to go on a Safari \nWhat are some of your vices?Researching obscure fashion and lifestyle events,Iced tea and playing the tv and radio at the same time\n\nWhat are some of your bad habits?Over analysing  Cigarette smokingDrinking too much iced tea loll\nDo you think that you will always call New York home?Thats soo funny,i just had this conversation not too long ago.I've always thought i would but not anymore.N.Y. is still percolating but the quality of life has changed.People are acting StupidFor the first time,i dont feel safe. It keeps you on your toes but i like people who GET IT...Just fuckin GET IT\nAre you single? Yassss\n\nWhats the most expensive article of clothing you've ever purchased?LOLLLThese gladiator sandals from Tootsie Plohound years ago..I couldn't  wait for them to go on sale$800 on some damn sandals?My father would kill me\nDo you still own it? No\n\nWhat prompted you to create Gagworthy?I figure if im gonna chronicle my likes and dislikes does and donts on fashion,style and lifestyle I might as well join the matrix and start a page lollll..I  like the idea of like a magazine or newsletter..At the end of night I  like to go on my page and scroll the days madness and crack my self up\nWhats your opinion about the current state of menswear?Love the bold stance thats happening now.It seems like for all the years people like Rudy and I have been teased for simply being a lil #fashionforward .Now all these MEN wanna be kung fu fighting!!!!!- hay-ya!!!-----!!!-!Love it though....love itSelf expression,Fabrics,textile,silhoettes [#yasssssss]\nName 3 to 5 designers/brands (or more) that you keep a close eye on. Why?HoodByAir-Pushing urban market out of comfort zone.Boris Saberi-Very hi-tech menswearDemobaza-The best #walkingdead collection out....[favorite]Jianhui-Accessories line made from nature out of London very #forward Vivienne Westwood-#mothaofthehouseAlways fresh/political/NewNowNext\nIs there anything exciting that you are currently working on, or preparing for? (Doesn't have to be work related)Im working on branding,I've always been a go to person and would love to provide that service in the market.ConsultingSalesPromotionsProduct placement Overall perspective on how to kick start Your kick start...\nWhat are a few goals that you would like to achieve in the next five years?Make some fuckin MONEYIM BROKEHave an established service that i can rely on both creately and financially.And good health to start over if it doesnt work out...\n \n\n\n ", "source": "FASHION FORWARD MEN"}