{"published": "2015-09-27T00:05:58Z", "media-type": "News", "title": "Buhari needs Nigerians’ help to fight corruption – Hon. Odeneye", "id": "8994a0f1-7ca5-45a7-88c6-35bb98e89c95", "content": "Hon. Odeneye Kehinde, popularly called ‘’Ok is Okay’’, represents Ijebu Central Federal Constituency comprising Ijebu Ode, Odogbolu and Ijebu North East, at the House of Representatives. He hails from Ogbogbo and graduated from Lagos State University. He is a Fellow of the Institute of Chartered Accountants of Nigeria, ICAN.  In this interview, he speaks on  pay cut for lawmakers among other issues. Excerpts;\nThe post Buhari needs Nigerians’ help to fight corruption  – Hon. Odeneye appeared… \r \nBy Bose Adelaja \n\nHon. Odeneye Kehinde, popularly called ‘’Ok is Okay’’, represents Ijebu Central Federal Constituency comprising Ijebu Ode, Odogbolu and Ijebu North East, at the House of Representatives. He hails from Ogbogbo and graduated from Lagos State University. He is a Fellow of the Institute of Chartered Accountants of Nigeria, ICAN. In this interview, he speaks on pay cut for lawmakers among other issues. Excerpts \n\n; \n\nCan you tell us about your journey into politics \n\nBefore 2011, I hated politics with passion but, one day, I realised I could continue to stay at the background criticising politicians for no cause and I made up my mind to identify our problems and proffer solutions. \n\nIn September 2010, we attended a social function in the village where I met some of our zonal leaders and the first thing that came to mind was to advise them on the need to choose the right candidates for the 2011 elections. All I told them was ‘I hope you guys will choose those who can represent us well this time around,’ but to my astonishment, one of them said, ‘look, we have been discussing you all this while and we feel you have all it takes to represent us at the House of Representatives’’. My intention was to assist them in my own capacity to get the right candidate but I ended up being picked as the candidate and this beat my imagination. I told my wife what transpired thinking she will kick against the idea but, to my consternation, she gave me her support. Another interesting part of it is that, I could not boast of N100,000 in my bank account but, miraculously, I ended up spending millions of Naira for my campaign. \n\nPresident Muhammadu Buhari apparently began his fight against corruption by advocating for a special court to try offenders. What is your take? \n\nI want to congratulate Nigerians for having President Muhammadu Buhari who has something in mind that he was unable to complete before his regime was overthrown in 1985. God intentionally allowed him to be voted into power at a time Nigerians have lost hope of a better tomorrow. It is true that many people have tagged him ‘’Baba go slow’’ all in his bid to fight corruption. \n\nThe issue is that he came at a time Nigeria cannot boast of any meaningful development than oil and, gradually, the nation has grown from boom to doom. I wholeheartedly support his war against corruption and I know this will attract criticism because Nigerians are not used to this kind of war having been governed by one party for over 16 years. Many Nigerians have resigned to fate and this gave PDP members the opportunity to rule the way they liked. \n\nWe have been putting our trust in the cloud but God later blessed us with President Buhari. We must wage war against corruption and that is what Buhari is doing. \n\nThe special court is necessary to give room for accelerated hearing, the President wants incorruptible judges to this effect. If we don’t fight this war now, when are we going to do so \n\n? \n\nThis is a country where an individual can boast of foreign currencies which can compete with the budget of a nation. \n\nMr President made some promises during his campaign. Do you see him fulfilling them by 2019? \n\nI can assure you he is going to fulfil them but Nigerians should exercise patience with him because there are so many projects to work on. I am so glad to work with such a man who appreciates the problems on ground and takes time to study them. There are many companies who want to partner Nigeria in some programmes but they want to be assured of our readiness. They want to be convinced their investment will grow well before investing their resources. If those platforms are not provided, how will such partnership come into being? All what he is doing is to prepare the minds of Nigerians that he is in for a change. When everybody follows the rule of the law, Nigeria will be safe for all of us. \n\nSome people are of the opinion that some of those around Mr President also have their hands soiled. Do you agree? \n\nYou cannot judge a person as being corrupt without presenting the evidence but he has assured there won’t be sacred cows as th…", "source": "MyInforms"}