{"published": "2015-09-17T01:11:00Z", "media-type": "Blog", "title": "How and Where to Buy Silver in Big Rock, Illinois", "id": "17e039d5-f6db-4442-90cc-e8a09289d6f9", "content": "Just as is the case with gold and other precious metals, silver has long been used as money. Silver also has many industrial uses. Silver is often purchased in large quantities as a hedge against inflation. Many people in places like Big Rock, Illinois collect and stack silver and keep it for trading. Another technique is to set-up a self-directed IRA to own and hold silver for the long-term as a form of “wealth insurance”. If you are interested in investing in silver you need to know where to start and how. Working with a top-tier and trustworthy silver dealer is very important when you purchase silver. This article provides the information you need to get started. \n Consider Your Silver Purchase  \nBefore you actually get started with silver investing, the first thing you should do is determine what kind of silver you want to buy. There are three general ways of investing in silver. The first way is to buy the actual physical silver for yourself. This involves finding silver in various forms and purchasing it. This can be either scrap or bullion. There’s also paper silver, which means to purchase the rights to silver that you don’t physically possess. This is a way to gain exposure to the price movements of the metal without actually holding it. The third is silver futures, which means that you are making a purchase of silver with a view to the price of silver in the future. The CME Group is the best place to see quotes for silver futures. \n Find a Reputable Precious Metals Dealer  \nFinding a reputable dealer to buy your silver from is perhaps one of the most important steps to making a purchase of silver. Working with a reputable dealer can prevent a lot of the pain and overpricing that can occur when working with a bad or untrustworthy dealer. Perhaps the best way to find a top-tier dealer is to read the silver dealer reviews and compare how they are rated by independent rating agencies and actual customers. You can see all the top-tier precious metals dealers by clicking here . It is important that you do your due diligence from your home in Big Rock, Illinois to find the best precious metals dealer for your needs. There are a few very good dealers and there are many not so good ones. This is your money, so you want to ensure you work with a top-tier dealer. That ensures you get the right product for your needs at a fair price. Take the time to look over the dealers before you make a purchase. Find the dealer who is most reputable and trustworthy, and be sure to look at the customer reviews. Those customer reviews will tell you what to expect. Every buyer of silver from Illinois should follow this process. \n Determining the Market Price of Silver  \nBefore you buy silver, make sure you check the spot price of a troy ounce. The troy ounce is the reference size that the spot price is based upon. Keeping this price in mind will help you make your silver product purchase at a fair price. Never pay more than a small premium above the current spot price when you buy silver bullion bars, coins or rounds.  A “round” is the term used to describe silver coins that are not marked as having currency value. The rounds are made by refiners in many decorative designs but they are not marked as having a particular US currency value. \n Negotiate Terms  \nAnother matter to consider before you actually buy silver is to make sure you understand the terms of your purchase. Buyers of silver from Big Rock should always do this. These terms can include the following: \n \n* If you are buying paper silver, make sure you are clear who has physical possession of the silver itself. \n \n* Avoid the purchase of numismatic coins. These “collector” coins are priced on factors such as rarity and condition, not the value of the metal they are made from. These coins are often sold for very high premiums over the value of the metal itself. Too many buyers overpay for these coins and make a very bad investment. Dealers make tons of money selling these overpriced numismatic “collector” coins. Buyers from Illinois or elsewhere often pay way too much and make a very bad investment. Avoid the purchase of numismatic or collector coins. Buy the bullion coins from the mints that are priced on the value of the metal itself. If you buy numismatic silver coins, remember that there is a difference between the raw value of the silver the coin is made from and the price of that collector coin. The numismatic coin is not a good way to own silver. Buy bullion bars or bullion coins from the mints instead.  Be very careful here, and do not allow yourself to be talked into buying those numismatic coins by some slick salesman. \n \n* Ask about fees. Some silver sellers, especially banks, often charge a premium fee for the sale of silver. This almost always results in a buyer from Big Rock, Illinois being underwater for the purchase. \n \n* Ask about buybacks. Some sellers will buy-back silver and others won’t. It is important to understand that if you buy silver from a seller who won’t buy it back, you could suffer significant losses when selling to others in the market. Likewise with a buyer who won’t honor fair market values when they buy. \n Make Sure You Record the Cost Basis Information for Taxes  \nWhen you buy silver, make sure you get receipts for what you paid for your silver. This is so you can declare the cost basis of your purchase when you sell the silver later on. Without proof of this the IRS can cause some real problems when you sell to another buyer. Keep those purchase records in a safe place in or near your Big Rock home. Make copies too. This will save you from getting into a painful dispute with the IRS if there ever is a question about the purchase price of your silver. \n How to Find and Buy Scrap Silver  \nKnow How to Identify Silver. It should be unnecessary to say, but it bears repeating that you should always make sure you are buying real silver when you buy silver. For this reason you should know that real silver, whether it be jewelry or silverware, will be stamped with the numbers 800 or 925, or with a certification that the silver is sterling (ex. Sterling, Ster, or Stg). Further, flicking a silver coin or ring into the air will cause it to ring. You can also place a real silver object on a piece of ice, which will cause it to melt faster than under normal conditions. Click here to read more. \n \nAsk Friends and Family in Big Rock, Illinois. You might want to try asking friends or family if they have silver they would like to sell. Chances are good that they will sell it to you at a very fair price.  This is a good way to start building your silver holdings. \n \nPlace Ads. Placing an ad in a publication or an online source such as Craigslist might bring you silver sellers. But you have to be very careful of cheats and scammers. \n \nFind Reputable Dealers. Just as is the case above, a reputable dealer will sell you silver at a fair price or even direct you to other sources if they cannot fill your order.  See this list for the top-tier precious metals dealers. \n \nLook For Yourself. You can often find silver that is for sale at bargain prices online or in second hand shops. Look for it in broken jewelry, silverware, rings, and bracelets. \n \nCheck Your Pawn Shops. Pawn shops in and around Big Rock, Illinois can be an excellent source of silver. But remember that pawn shops often charge a premium that might end up making your purchase underwater from the start. \n \nLook For Silver in Unexpected Places. Silver is used as an ingredient in many things. These include cameras, circuit boards, photographic plates and other sources where you can remove it. Many people in Illinois make a good supplemental income by recovering silver and other precious metals from old electronic equipment. \n Coins, Bars, and Rounds  \nBuying silver can be very tricky. For example, collector coins are valued not primarily on their silver content but rather for their “numismatic” value, which includes provenance, quality, rarity and condition which all influence the price of these types of coin. As noted earlier, the numismatic or collector coin is often very overpriced and not a good investment for the buyer. If you want to buy silver coins, then buy bullion coins that are valued based upon their metal content.  These include coins from the US Mint. \n \nSilver bars are almost pure silver, which makes them excellent investments, often trading at small premiums above the spot price. They are a form of silver that is very good for investment purposes. The 1 oz silver bar enjoys a liquid market. \n ETFs  \nETFs, or Exchange Rated Funds, are a silver investment that is traded like stock. You can buy a silver ETF easily for your investment portfolio. Some of the most popular silver ETFs include: SIVR – ETFS Silver Trust, AGQ – ProShares Ultra Silver, SLV – iShares Silver Trust, USLV – VelocityShares 3x Long Silver, ETN – linked to the S&P GSCI Silver Index, and the ZSL – ProShares UltraShort Silver. To see more silver ETFs click here . \n \n. \n \n\n \nHow To Get The Most For Your Money When Buying Silver \n \n. \n Mining Company Stock  \nIf you want to invest in silver without buying the actual product, you can invest in a silver mining company. This can be very risky. If you own stock in a silver miner even when the price of silver goes up, the price of a mining company’s stock can go down. Take the time to research the mining companies carefully before making a purchase of their stock. \n Self-Directed Silver IRA  \nOne very popular method for investors from Big Rock or anywhere is to own and hold silver through a self-directed silver IRA. This is an IRA that is set-up with a custodian specifically to own and hold physical precious metals such as silver. The IRA can also hold other precious metals such as gold, platinum or palladium, It is important to work with a top-tier precious metals dealer for this. If you can invest $10,000 or more in an IRA the top dealer to work with for a Silver IRA is Regal Assets. \n \n. \n Understand the Investment Risks  \nThere are many ways in Big Rock, Illinois to invest in silver, some better than others. Regardless of how you choose to invest in silver, make sure you understand the risks. As is the case with any investment, risk will always be there. Prices can rise or fall, and especially so over the short-term. Many investors in silver from Illinois are buying now at what appears to be lower prices and holding for that time when the value of silver leaps up above the long-term trend price. This is simply investing in an attempt to buy low and sell high. Don’t speculate with money you can’t afford to lose. After you know more about the silver markets and what you are doing – and have gained experience as a buyer and seller of silver – making an investment in silver can be an excellent method to protect your wealth over the long-term. Many people have set-up a self-directed IRA to buy and hold physical silver as a long-term play to preserve wealth. If the price of silver spikes up during some period of financial distress or uncertainty, that may be a great time to then sell your IRA silver and enjoy the increase in wealth. \n \nBuying silver is something many Big Rock investors find fun and exciting. There are a number of links on this page to other sites to help you get started in whatever way suits your interests and needs. Check-out the links. Everything is here to help you. \n \nThe post How and Where to Buy Silver in Big Rock, Illinois appeared first on Buying Silver .", "source": "Buying Silver"}