{"published": "2015-09-19T01:50:34Z", "media-type": "News", "title": "New regulations for marijuana ahead", "id": "1cf4d2c5-0b32-4b1f-bab5-51979ec3832e", "content": "In the same week, the California Assembly approved the first new medical cannabis regulations in almost twenty years, and the State Water Resources Control Board established the fee structure for the first established environmental regulations for cannabis cultivation. \n\nMany aspects of the new legislation remain unclear, and the governor has until October 11 to sign it or request modifications.  However, all around the Emerald Triangle this week, at events organized to celebrate the starting harvest season, local cannabis cultivators, industry members, and regulators discussed the potential implications of the bill. Although many expressed a mixture of excitement over the promise of greater clarity in future regulations, others weren’t convinced these requirements would improve the industry in a way that met the needs of north coast farmers and communities, or cannabis cultivators and patients statewide. \n  Legislative overview \nThe new legislation is a combination of three different proposed bills (AB 266, SB 243, and SB643), merged during an 11th hour negotiation between state representatives, industry stakeholders, and the governor’s office. Much of the specifics outlined in the law are left to be detailed by state agencies prior to the law’s implementation in 2017. \n\nThe legislation will reclassify cannabis cultivation as agriculture, and be regulated under by the Department of Agriculture, along with the Board of Equalization and the Department of Public Health, which will establish standards for patient safety such as testing and manufacturing requirements for medicinal cannabis. \n  \nThe regulations will establish a set of licenses, with types ranging from small cultivator to dispensary to transporter to mixed used (indoor/outdoor), determined by size and activity type. For the most part, license holders cannot hold multiple licenses, effectively preventing full vertical integration in the industry: for example, one cannot hold both a dispensary and a cultivation license. However, license holders will need to comply with both state and county requirements. Counties can still ban cannabis activity or enact taxes on it and retain control over local regulations. \n  \nIn addition, the legislation will create a Bureau of Medical Marijuana Regulation (BMMR) under the Department of Consumer Affairs, to act in coordination with various state and local agencies to oversee the statewide industry. A tracking system will be implemented, and licenses fees and other monies would go into a fund to mitigate the impact of cannabis on the environment. Environmental regulations will be overseen by the state water boards and CA Fish & Wildlife, a component of north coast assemblyman Jim Wood’s to protect water quality. \n \n\r\r \n  Local response \nHow exactly this legislation will affect Mendocino county and others in the northern California’s “Emerald Triangle” remains uncertain, and changes made to the legislation itself and many specifics are yet to be determined, but these have sparked intense discussion amongst many local residents, particularly in light of the process used to merge the three bills. \n\nThe Willits News spoke with Mike Geniella of the Mendocino District Attorney’s office, who said that while the DA was still reviewing the legislation, it was important that locals understand that current enforcement and prosecution policies will not change for at least a year. \n  \n“Beginning in 2017, I believe, there will be legal protections from arrests and asset seizures, those will be greatly expanded,” said Geniella, emphasizing it will take some time for state regulators to determine further specifics, “but if it brings some uniformity statewide that’s a step forward.” \n\nGeniella continued, “from an enforcement and prosecution standpoint in Mendocino, whatever the changes will be, until the law goes into effect our current prosecution policies will be in place. People need to understand you can’t put the cart before the horse, you can’t come in and say ‘we’re operating under what we think the laws will be.’ When we understand what those laws will mean in the county, the DA will put that out there locally so people can clearly understand it.” \n  \nMendocino marijuana farmer Casey O’Neill, Board member of the Emerald Growers Association, a farmers group that is transitioning to the “California Growers Association,” and participated in the legislative discussion. O’Neill said he’s pleased with the bill’s passage, and particularly the reclassification as agriculture, but “as farmers, we have much work to do to continue to organize ourselves. There will be tremendous challenges and we must be united to meet these challenges. As we move forward, cooperation between farmers and government agencies can be facilitated by 3rd party consultants, reducing government interface.” \n  \nStating that local farmers create high quality artisanal and craft cannabis products with a place in the market, O’Neill said:  “These bills create the potential for farms to navigate compliance; how we do so will depend on how well we organize into cooperative units and maintain our representation in political and regulatory processes. These are the traditional challenges of industry; we have an added layer because of Prohibition.” He reiterated the EGA/CGA’s commitment to supporting craft and small farms under the new standards. \n  \nAnother local group involved in legislative stakeholder discussions is the Small Farmers Association, made up of marijuana growers. Representative Julia Carrerra said the SFA is “working directly with the governor’s office to make final adjustments to further protect small farms in the state regulatory structure. His office understands one of the issues is market share.” \n\nCarrera articulated one component of the legislation the SFA hopes to see change, saying “we’ve been vocal about not seeing any benefit to a distribution license, because a farmer can’t take their product to market or distribute - we believe that detrimentally affects small farmers’ ability to compete.” She also highlighted the importance of effective county and local regulations: “we are also working with Mendocino County and other county officials to help bring county guidelines to be consistent with the newly passed state regulatory scheme, and we are dedicated to getting the plant count raised in Mendocino.” \n  Water Board cannabis cultivation permit fees \nOn Wednesday, the State Water Resources Control Board unanimously approved the tiered fee structure for the newly developed regional water quality control board permit fees, which create the first environmental regulations for cannabis cultivation in the state. These regional permit programs are a component to the environmental standards referenced in the newly approved statewide legislation. \n\nThe fees will apply to the permit approved for the North Coast District 1 - which runs from Sonoma to the Oregon border and includes Mendocino County - and will apply to the program being developed by the Central District 5, which runs from Redding to the Grapevine in Southern California. North coast cultivators have until February 2016 to enroll in the program. The tiered fee schedule reflects the structure established in the permit, which assess a cultivated site based on its threat to water quality, which “better aligns the systems being developed in Regions 1 and 5,” according to Tim Moran, Public Information Officer. Statewide fees can be re-adjusted every several years. \n  \nDistrict 5 ended the public comment period on their cannabis cultivation draft program on September 7, and the regional board is scheduled to consider those comments and potential approve that permit during a meeting on October 1 &2. “It appears we have support from the cannabis community and watershed groups,” said Clint Snyder, Assistant Executive Officer. \n\nThe ruling establishes a set of baseline fees for three tiers, with a discount given for enrollees who are also a member of a third party group. The role of third party organizations was included in the cultivation program in part as a privacy protection for participants who may not want to provide the state agency with all of their parcel and cultivation information. The discount in the fee structure is intended to recognize that such cultivators will likely pay additional fees for third party participation. \n  \nHowever, if any cultivator is required to take corrective action, they are required to pay the full fee for at least one year, and third tier cultivators must pay the full fee regardless of third party membership unless approved by the regional water quality control board for a lower tier. \n\nThe annual fees for the tiers are: first tier (lowest threat): $1,000 or $700 (3rd party members), second tier (moderate threat): $2,500 or $1,750(3rd party members), third tier (serious threat and requiring corrective action): $1", "source": "Ukiah Daily Journal"}