{"published": "2015-09-30T19:37:09Z", "media-type": "News", "title": "WOLTERS KLUWER : CCH IntelliConnect Browser Search Wins Silver Stevie Award in 2015 American Business Awards", "id": "510e57a9-3803-4a03-ad27-062b92d4476f", "content": "​ CCH ® IntelliConnect Browser Search , from Wolters Kluwer Tax & Accounting US, has been named the winner of a Silver Stevie® Award for the New Product/Service of the Year - Solution for Integrating Content into the Workflow category in the 13 th Annual American Business Awards SM . \n \nCCH IntelliConnect Browser Search is the latest addition to the award-winning CCH IntelliConnect® research platform and continues to earn significant industry praise. In addition to being the platform that won Wolters Kluwer Tax & Accounting the prestigious 'Americas Tax Innovator of the Year' award by International Tax Review, CCH IntelliConnect Browser Search was also named the winner of a 2015 SIIA CODiE Award, a finalist in CPA Practice Advisor magazine's 2015 Tax & Accounting Technology Innovation Awards and a top new product of the year by Accounting Today magazine. \n \nCCH® IntelliConnect® subscribers can download CCH IntelliConnect Browser Search as a free add-on, allowing them to get access to Wolters Kluwer's world-class content directly on the Google® , Bing® or Yahoo!® results page. This provides easy access to their favorite search engines with the expertise and reliability of Wolters Kluwer - all in one step - without having to log in and alternate between research tools. \n \n Customers agree that CCH IntelliConnect Browser Search has helped them transform research: \n \n'CCH IntelliConnect Browser Search allows us to access important tax research right where we search from the most [in Google®]. This allows us to be more efficient and responsive to our clients, making it a great and necessary feature to have.' \n \n-     Joshua V. Azran, CPA/ABV/CFF, CMA, CGMA, CFE Founder, Azran Financial APC, Los Angeles, CA \n \n'I have been using CCH IntelliConnect Browser Search regularly, and I really like it. CCH IntelliConnect Browser Search has saved me a lot of time and increased visibility into my Wolters Kluwer content.' \n \n-     Lucy Brenner, Senior Accountant, Kerkering, Barberio & Co., Sarasota, FL \n \n'I think CCH IntelliConnect Browser Search is great because it gets me quick answers to my questions by aligning with my workflow.' \n \n-     Matt Grodin, CPA, Grodin CPA, San Mateo, CA \n \nThe American Business Awards are the nation's premier business awards program. All organizations operating in the United States are eligible to submit nominations - public and private, for-profit and non-profit, large and small. More than 3,300 nominations from organizations of all sizes and in virtually every industry were submitted this year for consideration in a wide range of categories. Winners were selected by more than 200 executives nationwide who participated in the judging process. \n \nAbout Wolters Kluwer Tax & Accounting US \n \nWolters Kluwer Tax & Accounting US ( CCHGroup.com ) is a leading provider of tax, accounting and audit information, software and services. It has served tax, accounting and business professionals since 1913. Among its market-leading solutions are The CCH® ProSystem fx® Suite, CCH Axcess™, CCH® IntelliConnect®, CCH® IntelliConnect Direct, CCH® Accounting Research Manager® and the U.S. Master Tax Guide®. Wolters Kluwer Tax & Accounting US is based in Riverwoods, IL. Follow us on Twitter @CCHMediaHelp .  \n \nWolters Kluwer Tax & Accounting US is part of Wolters Kluwer ( www.wolterskluwer.com ), a market-leading global information services company. Wolters Kluwer had 2014 annual revenues of €3.7 billion ($4.2 billion), employs approximately 19,000 people worldwide, and maintains operations in over 40 countries across Europe, North America, Asia Pacific, and Latin America. Wolters Kluwer is headquartered in Alphen aan den Rijn, the Netherlands. Its shares are listed on NYSE Euronext Amsterdam (WKL), on Bloomberg (WKL NA) and are included in the AEX and Euronext 100 indices. Wolters Kluwer has a sponsored Level 1 American Depositary Receipt program. The ADRs are traded on the over-the-counter market in the U.S. (WTKWY).", "source": "4 Traders"}