{"published": "2015-09-05T13:06:47Z", "media-type": "Blog", "title": "Massaman Curry Dressing Salad", "id": "72bd6472-cb31-42fb-91d1-5c9937cbd4cb", "content": "[caption id=\"attachment_2015\" align=\"aligncenter\" width=\"500\"] Massaman Curry Dressing Salad[/caption]\n\nIf you love Massaman curry. you will love this salad!  If you have never had Massaman curry, what are you waiting for? This dressing is so good on a pile of healthy veggies that you will find it hard to stop munching on it!\n\nMassaman curry is a rich but milder Thai curry, which was influenced by Indian and Malaysian cuisine. This salad dressing is adapted from the curry, simplified by using the peanut butter and shortening the cooking time to be appropriate for a dressing.\n\nServing: 2-3 person\nPrep time: 10 minutes\nCooking time: 10 minutes\n\nIngredients:\nDressing:\n2 Tbsp. Mussaman curry paste (Each brand has a different level of spiciness.)\n1 cup coconut milk\n3 tablespoons peanut butter\n3 tablespoons fresh lime juice\n3 tablespoons brown sugar\n1 tablespoon Thin soy sauce, Dragonfly brand\n1/2 teaspoon tumeric powder\n1/4 cup water\n\n[caption id=\"attachment_2020\" align=\"aligncenter\" width=\"300\"] Massaman Curry Dressing[/caption]\n\nSalad:\n2 cups lettuce; romaine, butter heard, or mixed salad green\n1/2 cup sliced cucumber\n1/2 cup sliced tomato\n2 hard boiled eggs, sliced (and/or fried cubed tofu)\n1/4 cup julienned carrots (or beansprouts)\n1 tablespoon sliced red onion\n\nInstructions:\n1. In a sauce pan, over medium heat, add the coconut milk. When it starts bubbling, add the curry paste. Reduce the heat to medium-low and simmer for 5 minutes. Stir occasionally.\n2. Add the rest of ingredient and whisk well until the sugar dissolves and the peanut butter is well blended. Remove from the heat and set aside.\n3. Arrange the salad ingredients into layers for a nice presentation or just put them in a salad bowl. Top generously with the dressing.\n\nNotes:\n- Please feel free to substitute the salad ingredients with any Asian salad goodies you prefer or have available.\n- The dressing can be stored in an airtight container in the refrigerator for up to a week. It will turn into peanut-butter like paste so warm it up with a little water, in microwave or over the stove, before serving.", "source": "A Taste of Thai and More!"}