{"published": "2015-09-24T11:55:00Z", "media-type": "News", "title": "PowaPOS Expands Global Footprint Through Partnership with Canadian Leader CT-Payment", "id": "9bd843a6-6eec-4e8c-b199-383464bf4362", "content": "World News: 12:55 GMT Thursday 24th September 2015 . [ Powa Technologies via Businesswire via SPi World News ] \n    This story   \nPowa Technologies today unveils its partnership with Canada’s leading       independent Canadian payment processor, CT-Payment. At CT Payment’s       2015-2016 ISO Event this week, the PowaPOS T25 is being introduced to       the CT-Payment’s ISO and software developer partners as a preferred       tablet-based POS platform for meeting the growing demand from their       retail clients. With this relationship, POS software developers can now       directly connect to CT-Payment’s advanced payment processing solutions,       which provides full authorization and settlement services for credit       card payments as members of the VisaNet, MasterCard and American Express       networks and Interac Direct Payments as a Direct Connector to the       Interac Inter-Member Network. \n\nThis Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20150924005183/en/ \n \n“As a company, CT-Payment understands the very specific needs that make       ISOs successful, and has always been focused on helping them easily       access our full range of payment services,” said Denis Robert. President       and CEO of CT-Payment. “Now, with this integration with the PowaPOS T25       platform, we are enabling more of these ISOs to be able to provide a       fully integrated, advanced tablet-based solution to their merchant       clients, with ‘plug and pay’ capabilities right out of the box.” \n \nPowaPOS is the first point of sale platform purpose built for       tablet-based payments. Its fully integrated design rids merchants of the       need for mismatched peripherals and provides industry-leading ease of       set-up. Features include a built in thermal printer, 2D barcode scanner,       universal tablet mount, orientation sensor, USB ports, as well as the       optional PowaPOS Cash Drawer – all in a sophisticated, compact form       factor and powered by a single cord. With its advanced PowaPOS       SDK, it is the only tablet-based platform to easily integrate with       all POS software applications across all operating systems: iOS, Windows       and Android, and is the first to provide merchants with the option to       use their choice of payment processor. \n \n“By integrating CT-Payment into our SDK, our companies have removed the       burden from the ISV and ISO of becoming payments experts, and provided       them with a value-added service they can use to get their merchants to       market faster,” said Jeff Dumbrell, CEO, PowaPOS. “And, with       CT-Payment’s Interac certification, we both dramatically simplify the       transition to tablet POS that Canadian merchants are seeking; while also       ensuring that the most advanced, secure payment processing is available.” \n \nWith CT-Payment, ISVs and ISOs gain access to Canada’s largest debit-       and credit-card processing company to be fully independent of Canadian       financial institutions and acquirers. The company is a member of       Interac® and an experienced multi-acquirer service provider, offering       transaction processing for point-of-sale terminals. Because PowaPOS was       designed to work with any operating system and any mobile or       tablet-based POS application, reaction from across the payments industry       has been overwhelmingly positive. In the short time since the       introduction of the PowaPOS SDK, more than 75 ISVs across the globe have       successfully integrated their applications. The PowaPOS       SDK also supports third party payment devices, including NFC, and       enables instant integration with PowaTag,       Powa Technologies’ innovative mobile commerce app. \n \n About CT-Payment Inc . (www.ct-payment.com) \n \nCT-Payment (CTP) has been setting the pace in electronic POS transaction       since 2002. It is the North American leader in EMV compliant payment       services and is Canada’s largest debit- and credit-card processing       company to be fully independent of Canadian financial institutions and       acquirers. As a member of Interac® and a debit acquirer, CT-Payment       delivers integrated debit authorization and settlement services on       behalf of its customers and business partners. As an experienced       multi-acquirer service provider, CTP offers transaction processing for       point-of-sale debit and credit terminals, customized web-payment       integration solutions, and the management of loyalty programs.       CT-Payment further specializes in the development of platforms for       emergent technology in the Global payment-processing ecosystem. It fully       complies with PCI international security standards. \n \n About Powa Technologies () \n \nPowa Technologies is an international commerce specialist that creates       technologies that enable a seamless consumer experience across all       purchase channels: online, offline and everywhere. With its       next-generation solutions PowaTag, PowaPOS and PowaWeb, Powa removes the       final barriers to instant global transactions through a revolutionary       instant mobile payment technology, the first fully integrated tablet POS       platform, and advanced cloud-based ecommerce solutions. Significant       investment capital has accelerated company growth, attracting the       industry's finest subject matter experts to conceive, build and deploy       innovative commerce technology at the heart of both merchants' and       brands’ future omnichannel selling strategies. Powa Technologies is       headquartered in London, UK, with offices in New York, Atlanta, San       Diego, Miami, Toronto, Tokyo, Paris, Madrid, Stockholm, Milan, Hong       Kong, Singapore, Taiwan and Shanghai. Follow Powa on Twitter @PowaTechLtd \n \n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150924005183/en/ \nPublished By: \nBusiness Wire: 12:55 GMT Thursday 24th September 2015 \n\nPublished: 2015-09-24T12:55", "source": "SPi World News"}