{"published": "2015-09-20T18:24:04Z", "media-type": "News", "title": "Salesforce CEO Marc Benioff takes potshot at Oracle with a PTSD joke about his president", "id": "a25d668e-706e-445c-a79d-0dbf9478e8bb", "content": "YouTube \n \nSalesforce president Keith Block \n    \nIf you’ve been following Salesforce CEO Marc Benioff, you’re probably familiar with his trash-talking  habits over his former employer Oracle. \n \nBut when it comes out at Dreamforce, Salesforce’s massive, week-long customer conference, and involves Oracle’s VP-turned-Salesforce president Keith Block, it only adds extra mustard. \n \n“Keith has been going through a very dramatic transformation during his time at Salesforce,” Benioff quipped after someone asked why Block’s not wearing a tie at Dreamforce on Friday. “You can see him today wearing jeans, his sports coat, looking actually somewhat relaxed.” \n \nHe continued, “We get these guys who get shot out of the Oracle cannon. They show up at Salesforce, ready to go, filled with a very deep PTSD (post traumatic stress disorder), and our job is to kind of shake them down.” \n \n    \nBusiness Insider \n \nSalesforce President Keith Block speaking at Dreamforce \n    \nBlock was a bit of a controversial figure when he joined Salesforce over two years ago. He had left Oracle the year before joining Salesforce, after court documents revealed him saying nasty things about  then Oracle’s president and current co-CEO Mark Hurd, and Sun Microsystems, a company Oracle acquired for $7.3 billion under Hurd’s watch. \n \nSince hiring Block in 2013, Benioff has been all praise about his president. Last year, at a press event, he went as far as to say , “[Block's]  probably the best sales executive the enterprise software industry has ever seen.” \n \nIn fact, Salesforce has seen nothing but growth since Block’s appointment. It’s been consistently beating earnings guidance, while hitting record-high share prices. Coincidentally, Oracle  has missed sales expectations in five of the past six quarters. \n \nThere’s been some reports that Block’s arrival and his more rigorous sales culture has caused some long-time executives to leave Salesforce. But regardless, investors largely seem impressed with his results. \n \n“The kind of things that Salesforce is telgegraphing to the Wall Street community is that it’s broadening out it’s suite, it’s increasing deal sizes, it’s going after larger customers, and it’s revamped its whole sales structure — and in large part, it’s around the hiring of Keith Block of Oracle,” Deutsche Bank analyst Karl Keirstead told us in a previous interview. \n  NOW WATCH: New aerial footage shows aftermath of explosion in China      \n \n   \n   \nRead more stories on Business Insider , Malaysian edition of the world’s fastest-growing business and technology news website.", "source": "Business Insider Malaysia"}