{"published": "2015-09-29T08:00:00Z", "media-type": "News", "title": "Greg Cote: Miami Heat and Dwyane Wade enter season of Great Unknown", "id": "aa30b6ee-1a4b-4c6d-9187-690914164627", "content": "Dwyane Wade has met every challenge Miami and the NBA have tossed his way, so what's one more? \n\nHe was the rookie out of Marquette who not only made it in pro basketball but became a superstar. He adjusted his ego to accommodate the eclipse of the sun named Shaquille O'Neal. He suffered through a 15-67 season. He proved selfless again in welcoming to his team LeBron James. He became a champion - three times over. \n\nNow, at age 33 and entering his 13th Heat season, Wade is trying on a new role: Elder statesman, a player fighting to stave off the inexorable encroachment of decline and hang onto the diminishing prime of his career as if it were the precious thing it is. \n\n\"I'm a different ballplayer than I was. There's no secret about that,\" Wade said Monday, an admission that even one year ago his pride might have kept bottled up. \"I've been broken, broken, broken ... but I'm still here.\" \n\nHe has been broken by various injuries and ailments and been invited to feel broken by the increasing reminders his career clock is ticking, yet Wade is back to lead what figures to be a last hurrah - a final shot at one last championship with this latest incarnation of the Heat. \n\nWade said he is driven \"to prove I'm still an elite player, maybe not SportsCenter Top 10 elite but you-still-better-look-at-me-in-the-scouting-report elite.\" But he also knows he is a part of the whole now more than the force driving it. \n\nI'd suggest he is stepping into the Great Unknown, except we don't know about the great part yet. We do know about the uncertainty that assures this season will be interesting long before we find out how close to great it might get. \n\nThe Heat opens training camp Tuesday at Florida Atlantic University in Boca Raton, lifting the lid on the franchise's 28th year. On Monday, it held an annual media day event at the downtown bayside arena, and anticipation for what's ahead is what you felt as players spoke. \n\nOne year ago at this event, it was all about the gloom of what Miami had lost. James had just defected back to Cleveland, and his absence was all anybody talked about. On Monday, Wade heard only one question that mentioned the word \"LeBron,\" and not until late in his media session. \n\nHe smiled. Called that progress. The post-LeBron hangover is over. \n\n\"Last year we were talking about what we lost,\" he said. \"This year we're talking about what we added.\" \n\nMiami's presumed starting five of guards Wade and Goran Dragic, forwards Chris Bosh and Luol Deng and center Hassan Whiteside did not play a single minute together all on the floor at once last season. \n\n\"Everything that could possible go wrong did,\" said Bosh, missing the playoffs the capper after four consecutive NBA Finals appearances. \n\nNow the Heat has added health - the return of Bosh from the blood clots that ended his season early last year. \n\nThe Heat has added a full season of Dragic, acquired last February just as Bosh was diagnosed and lost. \n\nMiami has added a full year of Whiteside, who opened last season on Memphis' roster and didn't start playing significant minutes for Miami until around Christmas. \n\nThe Heat also has fortified its bench by adding Gerald Green, Amar'e Stoudemire, a healthy-again Josh McRoberts and No. 1 draft pick Justise Winslow. \n\nNow all they have to do is make it all work, especially those five starting pieces that were never on the floor together last season. \n\nWill Miami reassert itself as an Eastern power and challenge to meet LeBron's Cavaliers in the conference finals? Or will Miami be just another second-tier East team that fights for a lower playoff seeding? \n\nThis is the Great Unknown. \n\nBeyond good health, the key might be Whiteside. Will he blossom into a reliably dominant, shot-blocking force to take advantage of a contract year for him? Or will he regress? More Great Unknown. \n\nCoach Erik Spoelstra was exuding rote confidence and optimism Monday, talking about reclaiming championship expectations that have become seen as a franchise birthright, and \"not running from those expectations.\" \n\nThen again Wade, savvy elder statesman that he is, cut through the coach speak with a smile and a couple of NBA truisms. \n\n\"It's a great starting lineup on paper, but that doesn't guarantee anything,\" he said. And: \"Everyone loves their team right now.\" \n\nBut that's enough for now - that positive anticipation and good feeling. \n\nWe welcome back the Heat as the elixir for what ails us as a sports community. \n\nThe Dolphins are coming off one of the worst and most ill-timed home losses in the franchise's 50 seasons. Hurricanes football coach Al Golden sees a small air force of flyovers calling for his job. The Marlins are winding up a 21st season out of the playoffs in 23 years. The Panthers, about to start up, have missed the hockey postseason 13 of the past 14 seasons. \n\nDespite last year's aberrant hiccup, we know the Heat will win - it's just a matter of how much. \n\nThat has been the case almost nonstop ever since the kid from Marquette showed up. \n\nABOUT THE WRITER \n\nGreg Cote is a columnist for the Miami Herald.", "source": "Belleville News Democrat"}