{"published": "2015-09-03T11:52:14Z", "media-type": "News", "title": "Ai Weiwei Chinese artist gives first public talk since 2011 – and becomes a selfie Santa Claus", "id": "47f6fbfc-a837-4e83-b9b5-2ad53f539c0f", "content": "The dissident Chinese artist wades in on the migration crisis, state censorship and dropping his drawers on Instagram at the Berlin literature festival, his first public appearance since his detention The first thing Chinese artist Ai Weiwei did as he stepped on stage last night at the Berlin Philharmonic was take a picture. Before him stood an audience of hundreds roaring with applause as a scrum of photographers snapped shutters like machine guns.\n\nIn blue cotton trousers, a button-up olive green shirt and rubber-soled shoes, Ai put his iPhone back in his shirt pocket, pleated his hands Angela Merkel-style and discussed China in a Berlin international literature festival talk alongside Chinese dissident poet Liao Yiwu, in what was called “a conversation between friends.”\n\nIt was Ai’s first public appearance since his detainment in 2011. He arrived in Berlin soon after having had his passport returned without warning by Chinese authorities on 22 July. He had been arrested without charge and held in solitary confinement, and fined $2.4 million for tax evasion, but the artist sees the episode as retaliation for criticising the government. For the past two years, Ai protested his travel ban with a fresh batch of flowers in a bicycle basket outside his Beijing studio.\n\nThe 58-year-old artist spoke slowly through a German translator as Liao played devil’s advocate with his line of questioning. It was such a monotone affair that an audience member interrupted, asking them to speak up.\n\nThe philosophical discussion ran from Confucius to censorship. Ai cleared the score when it came to hearsay. “This audience expects me to speak about this sentence that I allegedly said, the arrest of lawyers is not a big deal,” said Ai. “When I said the arrest of all lawyers is not a major topic, I did not want to insinuate this is to be seen in the context of today’s laws. I meant it in the context of history. It has not been a major topic in our history. When you live in a centralised regime, people feel powerless. They feel they don't have the possibility to change things “Lawyers are defending law, but law in a country where the system is not a healthy one, the lawyer could be arrested,” said Ai. “This will be the case until we have the rule of law.” Ai’s lawyer Pu Zhiqiang, who was arrested, still awaits trail.\n\n“When you live in a centralised regime, people feel powerless,” the artist said. “They feel they don’t have the possibility to change things; that is the intention of the regime.”\n\nFacebook Twitter Pinterest Ai Weiwei, left, and Chinese poet Liao Yiwu take part in a discussion at the Berlin international literature festival. Photograph: Adam Berry/ Liao asked about the feeling of guilt for political prisoners. “There is always a feeling of guilt,” said Ai, who cited his own jail time, and works inspired by his time in detention. \n\n“I never felt my freedom completely taken away from me.”\n\nWhen asked the price he had paid to overcome censorship, Ai said: “He who does not play along is presented as enemy of the state.”\n\nWatching artists talk politics is always a bit elliptical. Liao, who was jailed for his poetry, and has written books about Chinese Christianity, asked about fear as a motivator for art. Ai said: “He who lives in a dictatorship fears he cannot express his joy or happiness and fears he cannot prove himself. A nation can't think freely any more. Censorship means barriers are built so people can't move on; there is no hope “A nation can’t think freely any more, which is tragic,. Such a censorship system means barriers are built so people can’t move on; there is no hope any more.”\n\nSome questions were paradoxical, sounding a bit like haikus. “A German journalist said you live in freedom but you’re not free: I wonder what that means,” said Liao. “I feel you are free. Why do they say you’re not?”\n\nLiao may have been referring to Ai’s recent kerfuffle with German newspaper Die Zeit on Instagram, in which Ai said the paper misquoted him and “dramatically altered the character and context of the interview”.\n\nAi said he found it difficult to talk about freedom after coming to Germany. “I feel calm,” he said, skirting the issue. “I try to approach things in a rational way.”\n\nOn the influx refugees to Germany, he said: “It’s global policy, religion, ethnic groups, races and attitudes; everybody is responsible here for finding a solution.”\n\nLiao suggested Ai’s large Berlin studio could house refugees. “My studio should be a studio,” Ai retorted. The audience applauded.\n\nThere were some comical moments. Liao quipped about Ai’s online photos, some of which have him “with his drawers dropped.”\n\n“There is no hero in the world born with his trousers on,” said Ai. “A person without trousers is not a dangerous person, but when the police consider him a criminal, he finds it difficult to get a passport in China later and a UK visa.”\n\nFor the last question, Liao asked if Ai thinks he’ll be able to leave China again. “You should not ask at all if I can re-leave China again,” said Ai.\n\nFacebook Twitter Pinterest Ai Weiwei signs books in Berlin. Photograph: Adam Berry/ After the talk, hundreds of fans queued through the theatre for a book signing, which became a selfie session. Mostly everyone who bought a collection of his banned blog posts wanted a photo with the artist.\n\n“It’s an autograph session! Not a selfie session!” hollered German writer Wolfgang Herles, who introduced the talk.\n\nHe was right, but nobody listened. Cellphones waved through the air. Ai, a social media veteran, didn’t refuse either. He became the selfie Santa Claus of the night as he scribbled through paperbacks and posed. Instead of buying books, people paid for selfies. Not a bad deal for ₤7.35.", "source": "Guardian.co.uk"}