{"published": "2015-09-14T12:01:25Z", "media-type": "News", "title": "Liberal leadership: Malcolm Turnbull defeats Tony Abbott to become PM", "id": "ef951427-72b7-4cf9-9be4-cd0a3121dfb0", "content": "Malcolm Turnbull has been elected as the nation's 29th Prime Minister, after launching an all-or-nothing leadership challenge on Monday afternoon in which he quit the front bench, declared Tony Abbott had failed as leader, and told colleagues that sticking with him would only make Bill Shorten the next prime minister of Australia. Malcolm Turnbull has been elected as the nation's 29th Prime Minister, after launching an all-or-nothing leadership challenge on Monday afternoon in which he quit the front bench, declared Tony Abbott had failed as leader, and told colleagues that sticking with him would only make Bill Shorten the next prime minister of Australia. The more moderate Mr Turnbull emerged victorious from a tense late-night meeting of the Liberal party room and has been reunited in the leadership team with the deputy with whom he served as opposition leader until 2009, Julie Bishop.\n\nDespite inflated claims of support by both sides as they sought to create momentum, the outcome in the end was decisive, with Mr Turnbull winning 54 votes to 44.\n\nAn attempt by Abbott loyalist Kevin Andrews to knock off Ms Bishop as deputy was also spectacularly unsuccessful with Ms Bishop strongly re-endorsed 70 votes to 30.\n\nThe result came at the end of an acrimonious day after Ms Bishop confronted Mr Abbott with the news he had lost the confidence of the majority of the party room and would face an imminent challenge from his communication minister, Mr Turnbull.\n\nThat came within hours after Mr Turnbull made his move following question time.\n\nThe leadership change-over, which came just days before a hard-fought byelection will be decided in the Perth seat of Canning, was designed to reconfigure the government ahead of a general election due within a year, but has left it riven with divisions.\n\nAmong a slew of casualties from the meltdown of the Abbott operation were some of the federal government's most senior and prominent figures including Treasurer Joe Hockey, Senate leader Eric Abetz, and Defence Minister Kevin Andrews.\n\nThe end to Mr Abbott's troubled 24-month stint as prime minister concluded a dramatic day in federal politics which saw the more popular Mr Turnbull resign as Communications Minister and launch a full frontal challenge for the top job.\n\nThe decision immediately sparked bitter recriminations and plunged the Coalition government into a full-blown crisis threatening by implication to prematurely end to the careers of several senior Liberals including Mr Abbott, Treasurer Joe Hockey, Senate leader Eric Abetz, Defence Minister Kevin Andrews, and others.\n\nIn response a defiant Mr Abbott attempted to wrong-foot his critics arranging a snap evening party room meeting in which he declared he would be a candidate and would survive.\n\nHe said he had been \"heartened\" by the support flooding in to Liberal MPs' offices, as he called on colleagues not to succumb to the Labor disease.\n\n\"We are not the Labor Party,\" he said, stressing that the party, the government and the country were \"better than that\".\n\nThe showdown came to a head after a brace of senior ministers were understood to have shifted away from Mr Abbott, led crucially by Ms Bishop.\n\nPromising a more consultative style devoid of Mr Abbott's slogans and captain's picks, Mr Turnbull's decision was announced via a live press statement at 4pm.\n\nIt came after key ministers, marginal seat MPs, and even some in relatively safe safe seats around the country, previously loyal to Mr Abbott, had decided they were heading for defeat under his leadership.\n\nMr Turnbull advised the Prime Minister he no longer enjoyed his confidence at a 3.30pm meeting in which he advised he intended to contest the leadership, and requested that the position be declared vacant to facilitate a ballot.\n\n\"This is not a decision that anyone could take lightly,\" Mr Turnbull said.\n\n\"I have consulted with many, many colleagues, many Australians, many of our supporters in every walk of life. This course of action has been urged on me by many people over a long period of time.\"\n\nIn a critical precursor to that discussion, Ms Bishop had called on Mr Abbott prior to question time. According to the Turnbull camp, Ms Bishop had asked him to stand down. However versions differ on that meeting with the Abbott camp advising the meeting had been sought to advise Mr Abbott that Mr Turnbull was about to move and would likely have the numbers to succeed.\n\nThe high-risk showdown came five days before a crucial byelection in the Perth seat of Canning, catching many observers and pro-Abbott MPs off-guard.\n\nIt was announced within hours of a Fairfax-Ipsos poll revealing Canning voters are lining up to hammer the government in a massive 10 per cent swing against them, making the seat ultra-marginal.\n\nAs both deputy Liberal leader and the government's most senior minister on the ground in Canning, Ms Bishop's intervention was crucial. It is understood she told Mr Abbott his government had utterly failed to communicate its key economic message to voters and was heading for electoral defeat at the general election whenever it was held.\n\nExplaining his move, Mr Turnbull unloaded on Mr Abbott, declaring the government was drifting without economic leadership, and had offered slogans rather than explanations for policy.\n\nIn a statement aimed as much at party room doubters as the public, Mr Turnbull said the government had not been successful in \"providing the economic leadership that we need\".\n\n\"It is not the fault of individual ministers,\" he counselled.\n\n\"Ultimately, the Prime Minister has not been capable of providing the economic leadership our nation needs. He has not been capable of providing the economic confidence that business needs.\n\n\"We need a different style of leadership. We need a style of leadership that explains those challenges and opportunities, explains the challenges and how to seize the opportunities. A style of leadership that respects the people's intelligence, that explains these complex issues and then sets out the course of action we believe we should take and makes a case for it. We need advocacy, not slogans.\"\n\nCalling for a new style of governing in which the intelligence of voters is respected, he said it was not clear that could occur under Mr Abbott.\n\n\"He will cease to be Prime Minister and he'll be succeeded by Mr Shorten.\"\n\nAs relations within the government turned toxic, Mr Hockey hit back publicly at Mr Turnbull, declaring his statements about economic policy were \"wrong\" and claiming Mr Turnbull had never questioned the economic direction and had never raised objections in cabinet.\n\nIn a strategic move designed to placate right-wing Liberals worried about his social progressivism, Mr Turnbull has assured Liberals he will not seek to introduce an emissions trading scheme, will not seek to increase Australia's emissions reduction targets, and will not seek to overturn the recent party room decision to put same-sex marriage reform to a plebiscite.\n\nMr Turnbull gave no hint of favouring an early election if elected, but the new dynamic has made the timing of that impossible to predict.\n\nClarification: An earlier version of this story incorrectly said Social Services Minister Scott Morrison was supporting Mr Turnbull in the ballot. The story first appeared on The Sydney Morning Herald.", "source": "Augusta Margaret River Mail"}