{"published": "2015-09-04T12:00:00Z", "media-type": "News", "title": "Henry Schein's 18th Annual \"Back To School\" Program Helps More Than 5,000 Children Return To The Classroom Ready To Succeed", "id": "fe8a7a27-f51e-44ab-bf09-62a396d365d6", "content": "MELVILLE, N.Y., Sept. 4, 2015 /PRNewswire/ -- To help build the confidence of many underserved children who would otherwise return to the classroom without essential school supplies or new clothes, Henry Schein, Inc. ( HSIC ), the world's largest provider of health care products and services to office-based dental, animal health and medical practitioners, has launched its annual \"Back to School\" program.   This year, more than 5,000 children will participate in the program. Since the program's inception in 1998, more than 32,000 children have headed back to school equipped for success. \n  \nHenry Schein \"Back to School\" events are taking place at 29 Henry Schein locations this year. In 2014, the program expanded beyond the United States and Canada to Spain, and this year includes Scotland.  Participating children will be provided with school essentials, including backpacks filled with classroom supplies, books and hygiene products donated by Henry Schein. At many \"Back to School\" locations, children also will receive new first-day school outfits, personally selected and paid for by Team Schein Members. \n \n\"Our 'Back to School' program has been one of Henry Schein's longest-running and largest community service events, during which enthusiastic Team Schein Members make a significant difference in the lives of underserved children, boosting their confidence from the first day they walk through the classroom doors,\" said Gerry Benjamin, Executive Vice President and Chief Administrative Officer of Henry Schein. \"Giving back to society is a core value of Team Schein, and we are proud to host 'Back to School' every year, having grown the program from one event at our Company's headquarters in Melville to now 29 events worldwide.\" \n \nAt Henry Schein's worldwide corporate headquarters in Melville, N.Y., more than 600 children and their families pre-selected by local social service agencies received school supplies and clothes at a \"Back to School\" event yesterday. Dinner, games, balloon animals, face-painting and music were among the fun-filled activities. \n \nTo help identify participating children and families in the Henry Schein \"Back to School\" program, Henry Schein partners annually with local social service organizations. For the event at the Company's headquarters, Henry Schein partnered with 11 social service organizations, including Bethany House; Madonna Heights; Espoir Youth Program, Inc.; the Nassau County Department of Social Services; Family Service League; YES Community Counseling Center; MPowering Kids; Family and Children's Association; Hispanic Counseling Center; Pederson-Krag Center, Inc.; and The Raymar Children's Fund. \n \n\"For more than a decade, our families have participated in 'Back to School,' and it is always a pleasure to see the smiles on the children's faces as they excitedly receive brand new clothing, sneakers and more,\" said Donna Teichner, Assistant Director, Family Ties, Family and Children's Association. \"Self-esteem and resources are major components to academic success, and with the school supplies and clothing the children receive thanks to Henry Schein, we are better able to ensure that our families – many of them enduring a variety of crises – can have their children return to school feeling empowered to do well and feel well.\"  \n \n\"Back to School\" is a flagship initiative of Henry Schein Cares, the global corporate social responsibility program of Henry Schein, and is supported by the Henry Schein Cares Foundation, Inc., a 501(c)(3) organization that works to help increase access to health care in underserved communities around the world. \n \nAbout Henry Schein Cares \n \nHenry Schein Cares stands on four pillars: engaging Team Schein Members to reach their potential, ensuring accountability by extending ethical business practices to all levels within Henry Schein, promoting environmental sustainability, and expanding access to health care for underserved and at-risk communities around the world. Health care activities supported by Henry Schein Cares focus on three main areas: advancing wellness, building capacity in the delivery of health care services, and assisting in emergency preparedness and relief. \n \nFirmly rooted in a deep commitment to social responsibility and the concept of enlightened self-interest championed by Benjamin Franklin, the philosophy behind Henry Schein Cares is a vision of \"doing well by doing good.\" Through the work of Henry Schein Cares to enhance access to care for those in need, the Company believes that it is furthering its long-term success. \"Helping Health Happen Blog\" is a platform for health care professionals to share their volunteer experiences delivering assistance to those in need globally. To read more about how Henry Schein Cares is making a difference, please visit our blog: http://helpinghealthhappen.org/ .  \n \nAbout the Henry Schein Cares Foundation \n \nEstablished in 2008, the Henry Schein Cares Foundation, Inc., a 501(c)(3) organization, carries out its mission through financial and health care product donations that support health care professionals and community-based programs focused on prevention, wellness, treatment, and education; disaster preparedness and relief; and capacity building of health institutions that provide training and care. To learn more about the Henry Schein Cares Foundation, please visit: www.hscaresfoundation.org . \n \nAbout Henry Schein, Inc. \n \nHenry Schein, Inc. ( HSIC ) is the world's largest provider of health care products and services to office-based dental , animal health and medical practitioners. The Company also serves dental laboratories , government and institutional health care clinics , and other alternate care sites. A Fortune 500® Company and a member of the S&P 500® and the NASDAQ 100® indexes, Henry Schein employs more than 18,000 Team Schein Members and serves more than one million customers. \n \nThe Company offers a comprehensive selection of products and services, including value-added solutions for operating efficient practices and delivering high-quality care. Henry Schein operates through a centralized and automated distribution network, with a selection of more than 100,000 branded products and Henry Schein private-brand products in stock, as well as more than 150,000 additional products available as special-order items. The Company also offers its customers exclusive, innovative technology solutions, including practice management software and e-commerce solutions, as well as a broad range of financial services . \n \nHeadquartered in Melville, N.Y., Henry Schein has operations or affiliates in 33 countries. The Company's sales reached a record $10.4 billion in 2014, and have grown at a compound annual rate of approximately 16 percent since Henry Schein became a public company in 1995. For more information, visit Henry Schein at www.henryschein.com , Facebook.com/HenrySchein and @HenrySchein on Twitter . \n \nPhoto- http://photos.prnewswire.com/prnh/20150904/263738 \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/henry-scheins-18th-annual-back-to-school-program-helps-more-than-5000-children-return-to-the-classroom-ready-to-succeed-300138159.html", "source": "Yahoo! Finance"}