{"published": "2015-09-07T09:44:46Z", "media-type": "News", "title": "Is Ledbury the capital of h.Art?", "id": "b1bc409f-4a42-489a-a14e-c3251da1b9fb", "content": "AS HEREFORDSHIRE Art Week approaches, people are asking if Ledbury is the most arty town in the county. \n \nThe cluster of open studios around Ledbury is second to none, and artists are even crossing the border from Worcestershire to take part. \n \nLedbury-based artist, Peter Arscott of the Bankside Studios said: \"Ledbury has the highest concentration of studios open to the public, more so than Hereford. We have 14 shows in town and just outside.\" \n \nMuch of the work this year is inspired by plants and the natural world, and in a wide range of media. \n \nValerie McLean has been painting through the year in the garden of her home in The Garth, Ledbury, and she has a series of paintings relating to walks over the hills and along the footpaths around Ledbury. \n \nOther local exhibitions include textiles by Amanda Wright and Jill Exell at Weavers Gallery in Church Lane and out at Bankside Studios, Little Marcle Road, Wendy Houghton is producing abstract sculptures from porcelain paper clay. \n \nA group of local artists who met on courses at Malvern School of Art are preparing to take part in h.Art for the first time. They are showing their work as part of a mixed media exhibition at the newly opened arts and crafts venue Studiocrafts, in Ledbury. \n   Promoted stories   \nAll seven members of the group work from home studios in and around Malvern and include Ruth Bowden who paints bold flower canvases, Jamie Cramp with his architectural studies, Julie Lloyd Roberts with handmade books, Geraldine Poole who creates hand- and machine-embroidered art, Jane Saunders’ linocut prints, Rae Stevens with mixed media artworks featuring local buildings and veteran h.Arter, Sarah Walker who designs and makes lampshades from stitched paper and OS maps. \n \nRae Stevens said: \"Preparing a body of work for h.Art has been both inspiring and challenging. We’re all excited and a little apprehensive to hear what visitors have to say about it.\" \n \nStudiocrafts is located beside the Royal Oak hotel at 5A The Southend in Ledbury. \n \nillustrator, author and artist Jackie Morris is at Blue-Ginger Gallery in Cradley to launch this year’s h.Art festival this year. \n \nThe author, who lives on the Pembrokeshire coast, will read from her book ‘Queen of the Skies’ and from her very latest book “The Wild Swans’ during an informal evening with a light supper and refreshments. \n \nBlue-Ginger has many artists in residence during Herefordshire Art week, and the gallery will be open every day, from September 12 to September 20, from 10am to 5pm each day \n \nRowan McOnegal will be opening his studio and garden at Castle Orchard, Putley, for the charity, Concern Universal. \n \nHe said: \"I will be showing new work and maybe demonstrating too. \n \n\"I recently won an award from the prestigious worshipful company of glaziers and painters of glass at North Lands glass Centre in Lybster, Scotland.\" \n \nHerefordshire Art Week is in its 14th year and this year’s event has 150 artists and designer makers throughout Herefordshire. All 92 venues offer free entry to all visitors for the 9-day event. \n   \n Share article  \n   \nHerefordshire Art Week runs from September 12 until September 20. \n \nFurther details on the website, www.h-art.org.uk", "source": "Stourbridge News"}