{"published": "2015-09-08T11:18:22Z", "media-type": "News", "title": "RBC Capital Mkts Maintains PPG Industries (NYSE:PPG) As Outperform; Has PT Of $126", "id": "89525079-88b4-43ee-a487-9ff2d4cae7cb", "content": "PPG Industries (NYSE:PPG) Rating Maintained  \nRBC Capital Mkts have a $126 price target on the stock. The price target suggests a potential upside of 35.03% from PPG Industries (NYSE:PPG)’s current price. This rating was released in analysts report on 8 September. \nNYSE:PPG is at the moment trading -0.71% lower at $93.31 as of 07:18 New York time. PPG Industries’s stock is down -9.95% in the last 200 days. It has underperformed the S&P 500, which has dropped -6.36% in the same time. \n \nOut of 16  brokers covering PPG Industries, 14 rate it a Buy, 5 indicate a Hold while 0 suggest a Sell. The highest target is $145 and the lowest is $107 according to Thomson/First Call. The 12-month mean target is $127.47, which means upside potential of 36.61% over the current price. \n NYSE:PPG Price Chart & Trend  \nThe stock price of PPG Industries is down 9.95% over the last 200 days, and is in unsteady down trend. In the last 50 and 100 days, PPG Industries is down 20.75% and down 17.62%, respectively. Our stocks momentum model is shown on the price chart below.  \nSource: RightEdge Systems , Yahoo Split & Dividend Adjusted Data and OctaFinance Trading Models \n Institutional Ownership  \nGallagher Fiduciary Advisors Llc had the largest stake with ownership of 442,195 shares as of q2 2015 for 47.84% of the equity exposure. Alleghany Corp De is another bullish fund who is owning 1.35M shares of PPG Industries or 5.3% of their equity exposure. Further, Suvretta Capital Management Llc have 5.1% of their equity exposure invested in the company for 941,100 shares. The France-based fund Natixis Asset Management disclosed it had acquired a stake worth about 5.05% of the fund’s stock portfolio in PPG Industries. The Georgia-based fund Boulegeris Investments Inc. is also positive about the stock, possessing 354,498 shares or 4.96% of their equity exposure. \n Insider Activity  \nOver the last six months, PPG Industries NYSE:PPG has seen 0 buying transactions, and 1 insider selling transaction. The net result was for 1 transaction, worth $1.32 million. \n PPG Industries (NYSE:PPG) Profile  \nPPG Industries, Inc. (PPG) manufactures and distributes a range of coatings, optical and specialty materials and glass products. The Company operates business through three segments: Performance Coatings, Industrial Coatings and Glass. The Performance Coatings segment consists of the refinish, aerospace, architectural coatings-Americas and Asia Pacific, architectural coatings-EMEA, and protective and marine coatings operating businesses. \nPPG Industries (NYSE:PPG) traded down -0.71% on 8 September, hitting $93.31. A total of shares of the company’s stock traded hands. This is down from average of 2.19M shares. PPG Industries has a 52 week low of $85.78 and a 52 week high of $118.95. The company has a market cap of $25.26B and a P/E ratio of 23.07. \n \nGet the latest PPG Industries (NYSE:PPG) Stock Ratings at Octafinance. Completely free access to our Analyst Ratings Database for 6000+ stocks. \n \nThe post appeared first on Octafinance .", "source": "Octafinance"}