{"published": "2015-09-02T04:39:07Z", "media-type": "News", "title": "Celebrating 20 Years of Supporting Stronger, Healthier Babies, Publix Raises More Than $6 Million During Annual March of Dimes March for Babies Campaign", "id": "0ba7baaa-ce05-4b92-9be9-6265fc206ac3", "content": "SOURCE March of Dimes\n\nMAITLAND, Fla. \n\n\"We are thankful for the opportunity to partner with the March of Dimes, an organization whose mission is at the heart of every expectant parent, sibling, family member and friend,\" said Maria Brous \n\n\"We are grateful to Publix, their associates, and customers for supporting the March of Dimes for two decades so that we can give a fighting chance to every baby,\" said Julie Laird \n\nSince Publix joined the March of Dimes in 1995, there has been many great successes, including:\n\nMarch for Babies is the March of Dimes largest fundraiser and America's favorite walking event. Money raised in March for Babies supports the March of Dimes mission for stronger, healthier babies and funds important research and community programs. Since 1970, the event has raised an incredible $2.3 billion \n\nFounded in 1930, Publix Super Markets is the largest and fastest-growing employee-owned supermarket chain in the United States \n\nThe March of Dimes is the leading nonprofit organization for pregnancy and baby health. For more than 75 years, moms and babies have benefited from March of Dimes research, education, vaccines, and breakthroughs. For the latest resources and information, visit marchofdimes.org or nacersano.org. March for Babies is sponsored nationally by the March of Dimes number one corporate supporter Kmart, and top sponsors Famous Footwear, Macy's, Cigna, United Airlines, and Mission Pharmacal.\n\nPhoto - http://photos.prnewswire.com/prnh/20150901/262937 \n\nLogo - http://photos.prnewswire.com/prnh/20150409/197662LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/celebrating-20-years-of-supporting-stronger-healthier-babies-publix-raises-more-than-6-million-during-annual-march-of-dimes-march-for-babies-campaign-300136356.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KWES NewsWest 9"}