{"published": "2015-09-30T05:46:21Z", "media-type": "News", "title": "Poker player killed love rival's friend, court hears", "id": "f18bbd65-57a4-414a-b78b-356b9ecb65f0", "content": "A poker player attacked and murdered the close friend of his former girlfriend's suspected lover, a court has heard. A poker player attacked and murdered the close friend of his former girlfriend's suspected lover, a court has heard. Crown prosecutor Tom Gyorffy, QC, told a Supreme Court jury on Wednesday that Collin Thomas became angry when George Anagnostellis refused to tell him where he could find his love rival.\n\nMr Gyorffy said Mr Thomas attacked Mr Anagnostellis, who was separated from his wife and living at his parents' home in Malvern East, before setting fire to the garage on April 11, 2014.\n\nMr Thomas has pleaded not guilty to one count of murder and one count of arson.\n\nMr Gyorffy said that at the time of his death, Mr Anagnostellis was an avid poker player who played and organised poker tournaments at local hotels.\n\nThe prosecutor described Mr Anagnostellis as a gentle man who was never violent or threatening to anyone.\n\nMr Gyorffy said Mr Thomas and his girlfriend, Tina Thwaites, who were both poker players, had been in a relationship for about a year when Ms Thwaites ended it some time before the alleged murder.\n\n\"Mr Thomas believed that she'd been having an affair with another poker player, Mr Billy Theoharis, and he was angry about that,\" the prosecutor told the jury.\n\n\"He was trying to track him (Mr Theoharis) down and was texting and calling his phone.\n\n\"Mr Theoharis was a good friend of the deceased man (Mr Anagnostellis).\"\n\nAfter playing poker at the Sandown Hotel, Mr Anagnostellis invited Mr Thomas, Andrew Heke and Scott Sullivan back to his parents' Malvern East home just after 1am on April 11.\n\nThe men went into the garage and sat around a table playing cards and drinking home-made ouzo and wine.\n\nBy 4.30am, Mr Sullivan became unwell and left the garage in a severely intoxicated state and was later picked up by his partner. Mr Heke was asleep at the table when Mr Sullivan left.\n\nMr Thomas then allegedly confronted Mr Anagnostellis about where he could find Mr Theoharis.\n\nMr Thomas later told police he assaulted Mr Anagnostellis about 20 to 30 times involving \"a mixture of punches, elbows, kicks, knees, head butts\" to the face, head and body.\n\n\"It's a bit of a blur,\" Mr Thomas told police.\n\n\"I'm not really too sure about how that went down. All I remember is getting to the point where I obviously felt angry enough to assault him.\n\n\"I was just not getting anywhere and just getting sandbagged and basically being treated like an idiot, like I didn't know anything. I wasn't getting the information, obviously, that I was after and I was getting frustrated.\"\n\nMr Thomas wanted to find Mr Theoharis because there were accusations he had \"slept with my girlfriend (Ms Thwaites) at the time\" in late 2013.\n\nMr Gyorffy said Mr Anagnostellis suffered a number of serious head and neck injuries from the beating which led to his death.\n\n\"The Crown says Mr Thomas then poured petrol on the floor and over Mr Anagnostellis' body and set it alight before he left the scene.\"\n\nDefence barrister Colin Mandy told the jury Mr Thomas did not deny assaulting Mr Thomas but claimed the last time he saw him he was alive and about to set fire to himself and the garage.\n\n\"He (Mr Thomas) told the police that he dragged Andrew Heke out of there and was blown out of the door by the explosion that happened,\" Mr Mandy said.\n\nThe trial, before Justice Jack Forrest, continues. The story first appeared on The Age.", "source": "Bendigo Advertiser"}