{"published": "2015-09-22T08:01:00Z", "media-type": "News", "title": "Snoop Dogg launches his own Marijuana-based media company", "id": "b2407c16-7f1a-4129-bd9d-5bac21900dab", "content": "The Merry Jane media platform will feature an array of original content including a marijuana cooking show and an interview series with innovators in the cannabis industry. \n\nRap icon Snoop Dogg has launched his own media company called Merry Jane which he has promised will be centred entirely on marijuana. \n \nSnoop Dogg - whose real name is Calvin Cordozar Broadus - formed the company with media entrepreneur Ted Chung as a means of providing a news and information platform for the expanding cannabis industry in the US. \n \nThe co-founders described Merry Jane as a “premier media platform at the intersection of cannabis and pop culture”. \n \nThe pair said Merry Jane will be a website based media platform that will publish a comprehensive array of cannabis related information and original content including a cooking show covering edibles and weed pairings. The media platform will also produce a video interview series called Deflowered that will profile innovators in the industry, cultural and lifestyle features and the latest news on cannabis policy, business and economics. Information on marijuana products and a location mapping service for dispensaries will also be published on the website. \n \nSpeaking at the launch Snoop Dogg said after watching how the cannabis industry had developed since legalisation in a number of states “I wanted to create a platform that will take this movement further by creating a destination where people could find fresh content”. He described Merry Jane as “a game-changing platform for pop culture. It’s a new frontier y’all!” \n \nThe 43 year-old rap and film star also said he hopes it will give people “an opportunity to come out of the closet and just admit they like to smoke”. \n \nMarijuana is now a multibillion dollar industry and the Merry Jane brand will look to tap into the retail side of it too according to Chung who hopes the brand can become a leading destination for brands and retail businesses. \n \nThe platform is scheduled to launch in October and is currently sending invitations to a select number of beta testers; 420 according to Snoop. \n \nSnoop Dogg is not the only musician to attempt to build a brand around the bustling cannabis industry. Willie Nelson recently partnered with Tuatara Capital LP, a New York-based investment firm focused on the legal cannabis industry. The deal will help support and expand the launch of Nelson’s marijuana brand, Willie’s Reserve, which is due to launch this month. Willie’s Reserve will be grown distributed and sold in Colorado and Washington, where marijuana has been legalised, with plans to expand to other states who legalise it for recreational use.", "source": "The Drum"}