{"published": "2015-09-21T10:30:35Z", "media-type": "Blog", "title": "Call Center Agents Jobs in Kenya", "id": "7f27ced0-4a30-4645-9c7a-0fb49043904f", "content": "StarTimes Media seeks to appoint suitably qualified individuals to assume the role of Telesales Call Center Agents. Department: Call Center\nReports to: Call Center Manager\nObjective of the position:\n As the first line customer liaison, the primary role is to:-\nMake contact with businesses with full information on service / program. Make sales by offering the correct information and enrolling new customers. Handle customers enquiries promptly, efficiently and professionally to fulfill the call center’s expectations and meet the set service and sales target Qualifications / Skills / Competencies Diploma in sales and marketing or any other related fields. Excellent telephone communication skills. Agility; The ability to think on your feet. Active listening/ Analytical thinker i.e. listening and thinking at the same time At least 1-2 years working within a sales environment preferably in a proactive telemarketing role. Previous experience is an added advantage. Duties and Responsibilities Contact dormant customers directly by telephone to make sales by setting appointments or qualifying prospects. Resolve customer dormancy issues and leave them satisfied. Use a database to identify customers who have bought a product in the past. Build repeat sales through strong customer relationships by focusing on customers’ wants and needs. Check customer satisfaction degree after a sale. Improve customer relationships and increase customer retention. Gather and document information about the customer and the product. Perform any other duties that may be assigned. Increase company revenue Appointments or qualifying prospects. Remuneration: An attractive and competitive salary structure on offer.\nQualified candidates should send their application letters and CV’s quoting relevant skills and experience to jobs@startimes.co.ke\nKindly include names of three referees and a daytime telephone contact.\nInterviews will be done on a rolling basis until the position is filled.  Only shortlisted candidates will be contacted.", "source": "JOBS AND VACANCIES IN KENYA"}