{"published": "2015-09-21T05:20:05Z", "media-type": "News", "title": "Alzheimer’s Disease: Causes, Symptoms and Treatment", "id": "02d120f7-aaea-4695-801f-d0ca530ec3d3", "content": "It started with seemingly simple instances of forgetfulness — not remembering where the house keys were, or difficulty in recalling the names of some relatives. But over time when her mother, who lived alone, started asking the same questions over and over again, and sometimes forgot that she had had her meal just an hour back, alarm bells started ringing for Rama Venkatesh. Her doubts proved right when the doctor confirmed it was Alzheimer’s Disease (AD). \n \nAD is the most common type of dementia, in which the mental ability of a person declines and gradually reaches such a stage that it becomes difficult for them to lead a normal life. It is an incurable disease with a long and progressive course. \n \nIn India there are more than 50 lakh people suffering from dementia, of which nearly 80 percent have Alzheimer’s. According to doctors, this number is expected to double by 2030. \n \n“As compared to a few years back, more people are aware about Alzheimer’s Disease, which is a good thing, as it leads to early detection and support of the patient. But even then, more awareness is required because many times the immediate care-givers, the family, has no understanding about the ailment or are ill-informed,” said Swati Shah, a Kolkata-based neurologist. \n \nThe disease throws up a lot of early signs, which one can read by careful observation of a person’s day-to-day behaviour. \n \n“Shrinking of one’s vocabulary; disorientation with regards to time, place; asking the same question again and again; loss of short-term memory; inability to carry out simple calculations; forgetting names of relatives; and bad mood swings leading one to be temperamental are all early signs of AD,” J.D. Mukherji, director and head of the Neurology department in Max Hospital, in New Delhi, said. \n \nWhat causes AD is the deposit of a protein, Amyloid, in the brain which renders parts of it responsible for memory, thinking, calculation, and vocabulary non-functional. The threat of the disease progressively increases with increasing age, Mukherji said. \n \nWhile there is no ‘prevention’ as such, one can keep the disease at bay as much as possible with certain changes in lifestyle. “Sleep well,” Mukherji said, adding: “Being physically and mentally active, reading and writing, and even taking turmeric have shown to be of help.” \n \nAlzheimer’s is also one of those diseases where the immediate family suffers just as much, or sometimes even more, because they see their loved one lose their ability to remember and function normally over time. \n \n“It’s not easy being a care-giver. You get irritated despite yourself because a seemingly healthy person is behaving illogically; refusing to dress properly or asking weird questions. Then, over time, you realise that the person becomes completely dependent on you,” said Saima Khan whose father suffers from AD. \n \n“It’s like taking care of a baby. They are not aware of their mistakes. But it’s a challenge getting through day-to-day affairs along with the rest of the family,” she added. \n \nRobi Das, whose mother is an Alzheimer’s patient, shares a similar story. \n \n“It’s not easy taking care of an AD patient. Both I and my wife work in the corporate sector, and we have no relatives who would take the responsibility of looking after my mom. So we’ve found a good day care centre for such patients in our vicinity; in the evenings we get her back.” \n \n“It’s been like that for two years now. Sometimes I feel guilty that I am not there all the time… she needs help to change her diaper and to eat, so we have a nurse to look after her at night. I am doing the best I can,” he added. \n \nDoctors agree. “And apart from being an emotional upheaval, it takes a toll on one’s finances. The disease lasts for years,” said Nahid Alam, a psychotherapist. \n \n“Since most patients live with their families, the need of the day is, therefore, to train community and institutional care-givers who can help these patients and share the work of the family.” \n \nSource: IANS \nImage:", "source": "Sify"}