{"published": "2015-09-14T22:42:03Z", "media-type": "News", "title": "Australian PM-elect Turnbull to focus on the economy", "id": "9ce1347f-4874-4fd1-b28a-d69bba9de7d7", "content": "CANBERRA (Reuters) – Australian prime minister elect Malcolm Turnbull promised to focus on improving the country’s faltering economy as the public woke up on Tuesday to its fourth leader in two years. \n \nThe ruling Liberal Party voted to oust Tony Abbott as prime minister in favor of Turnbull, a multi-millionaire former tech entrepreneur who is hugely popular with the electorate, in a secret ballot late on Monday. \n \n“I’m filled with optimism and we will be setting out in the weeks ahead … more of those foundations that will ensure our prosperity in the years ahead,” Turnbull told reporters as he headed to parliament on Tuesday. \n \nAbbott was deposed following months of opinion polls that showed his popularity with the public near rock bottom as Australia’s $1.5 trillion economy struggles to cope with the end of a once-in-a-century mining boom. \n \nTurnbull, toppled as leader of the conservative Liberal Party by Abbott in 2009, has consistently been seen as a preferred prime minister. However, his support for a carbon trading scheme, gay marriage and an Australian republic have made him unpopular with his party’s right wing. \n \nTurnbull is widely expected to overhaul the cabinet, with current Treasurer Joe Hockey, who has been battling a backlash against a deeply unpopular budget, likely to be replaced by Social Services Minister Scott Morrison. \n \nDefense Minister Kevin Andrews, who is overseeing a A$50 billion ($35.70 billion) submarine tender, is also expected to be replaced when Turnbull unveils his ministry later this week. \n \nForeign Minister Julie Bishop, who won the party room vote to retain her additional position as deputy prime minister, said she had spoken with international leaders overnight about the leadership change. \n \nThe opposition Labor Party was quick to label Turnbull a “multi-millionaire who lives in a pink mansion on Sydney Harbour” who was out of touch with everyday Australians. \n \nThe change of leaders is the latest sign of political instability in Australia, which has in recent years been convulsed by backroom machinations and party coups that have shaken public and business confidence in government. \n \nLabor’s Kevin Rudd, elected prime minister with a strong mandate in 2007, was deposed by his deputy, Julia Gillard, in 2010 amid the same sort of poll numbers that Abbott faced. Gillard was in turn deposed by Rudd ahead of elections won by Abbott in 2013. \n \n($1 = 1.4006 Australian dollars) \n \n(Reporting by Jane Wardell; Editing by Dean Yates)", "source": "SRN News"}