{"published": "2015-09-03T12:00:04Z", "media-type": "Blog", "title": "Rectify: Drip, Drip", "id": "3a6ef380-2526-4ae3-9a90-a66c15a351df", "content": "\"I'm not even sure that I'm alive.\"\nI usually become annoyed when I'm not sure what actually happened in an episode. But 'Drip, Drip' was so outrageously weird that I loved it, almost in spite of myself.\nFantasy and reality and goats\nWhat happened, and what didn't? I think that the prison sequences had to be a dream because sadly, it's unlikely that Kerwin was ever in Daniel's cell. I will also bet that the cell doors don't have line of sight to other cell doors, so that man banging himself bloody against the glass probably didn't happen, or Daniel didn't see it happen. I could be wrong.\nDid Daniel really get up at 3:14 a.m. and go to Hanna Dean's house and look in the window? I think so. Did an actor from Deadwood pick up Daniel by the side of the road and take him off somewhere to steal a barn full of goats? Well, the wad of money was real. Where else would it have come from?\nThat experience with the wrestling goat-stealer was so surreal that Daniel thought it was a hallucination. Maybe part of it was, because Daniel kept falling asleep. It certainly felt like Biblical symbolism. Was \"The Stranger\", as W. Earl Brown was billed, supposed to represent the Devil trying to tempt Daniel before his baptism? Were the goats just an obvious metaphor for Daniel himself as a scapegoat? What did the statue of the goat woman in the field actually mean? Alternative worship? \"Somebody made that up. It's the beauty that hurts the most, son, not the ugly.\"\nSeriously. If any of you readers have a theory about what this episode meant, what was real and what wasn't, I'd love to hear it.\nGood and evil and family\nThe Stranger led Daniel to a sign -- his father's tire store and the red dancing man thingy that looked a bit like a crucifix. Daniel told Ted Senior that he'd never wanted to work at the store even before his father died, and I'll give Ted Senior some credit for asking if \"someone\" (as in Teddy Junior) had had something to do with Daniel's decision, although Daniel didn't answer him. The ugly ceramic mechanic was very obvious symbolism for Daniel's late father, and the love and security that no longer exists for Daniel.\nLooking very much like he'd been up all night stealing goats, Daniel then went to the high school. Now why would teachers and administrators be freaked by a disheveled convicted murderer carrying an ugly ceramic statue, hanging around outside the high school? That almost made me laugh out loud. Fortunately, Jared was there in the clinch.\nAnd then Daniel rejected his mother and sister, which was a bit sad. Amantha in particular went through hell to get Daniel out of prison, but she didn't think about him having needs and desires of his own. Maybe she thought he'd be like an extension of herself, doing what she thought he should do, not going to the Jubilee and getting baptized.\nBaptism and Tawney and the Prodigal Son\nI loved how they did the baptism: the dishwashing tub that Daniel had to rinse his bare feet in, his obvious fear of letting a couple of strange men hold him under water, the gospel singers singing \"There ain't no grave gonna hold my body down\", and his euphoria after he staggered out, all wet. The joyous hugging of the lovely Tawney, who I just realized is a pretty young woman who dresses and acts like a middle-aged church lady. Tawney's faith is so sweet and so is her belief in actual miracles, but Daniel is definitely not Job. I think Daniel needs comfort and peace so much that he convinced himself that he felt what she said he would feel during the baptism. Tawney got wise to that when he asked if he could kiss her. Oops.\nBiblically, Daniel is the prodigal son, and Teddy is the underappreciated son that stayed home and worked. Teddy has zero empathy for what Daniel has gone through. Daniel is a threat to Teddy's job, Daniel took Teddy's lucky ceramic mechanic, Daniel took back the place in the family that Teddy considered his. And now Teddy thinks Daniel is after Tawney, too. (Actually, Teddy is probably right about that one.)\nMaybe what's truly real for Daniel isn't his surreal existence in prison or the magical experience of baptism, but the contempt and rejection he keeps getting from Teddy. I almost couldn't believe what Teddy said to Daniel about how if he didn't fight, he must have enjoyed being raped. Daniel responded by grabbing Teddy in a choke hold, which I think was Daniel demonstrating what he himself had experienced, that sometimes it's not possible to fight back. I'm not sure what it meant that Daniel defeated The Stranger in much the same sort of choke hold, though. Not that I believe for a moment that Daniel enjoyed being victimized.\nFor me, what this episode established, in a confusing sort of way, is that Daniel is no saint. Although he might not have realized it, he probably chose baptism to please Tawney, not to please God or himself. Daniel is an angry, confused, unhappy man who has endured terrible hardships for way too long, and he just lashed out in a great big way. Here's assuming he won't kill Teddy. What a mess that would be.\nBits:\n-- It's been six days since Daniel was released. I seem to remember something about six days in the Bible. -- Daniel's guest bedroom is much like his cell, a depersonalized space that isn't really his.\n-- Teddy even experienced rejection with the tire fliers. Don't you hate it when you find those things on your car?\n-- Teddy went right to Janet and Amantha to cause trouble for Daniel. The fact that Tawney's monkey bread was there on the counter must have made him even angrier.\nQuotes:\nThe Stranger: \"Not all who wander are lost.\"\nKerwin: \"It's weird, isn't it?\"\nDaniel: \"What is?\"\nKerwin: \"That I know exactly when I'm going to die.\"\nDaniel: \"It's very sad, Kerwin.\"\nKerwin: \"It has its pluses. You can grieve your own death.\"\nDaniel: \"You gonna run them off a cliff, like swine?\"\nThe Stranger: \"You read too much.\"\nDaniel: \"Hey, are you real?\"\nThe Stranger: \"Am I real? I want some of what you're taking.\"\nDaniel: \"You remember when you were a kid, and you came back to that place you were years later, and everything seemed so small?\"\nTed Senior: \"Yeah.\"\nDaniel: \"It seems bigger now.\"\nTed Senior: \"He came by here. He looked kind of pitiful, too.\"\nTeddy: \"Yeah, he's got that look down.\"\nAmantha: \"So what do we do, call the men in white coats? Are there still men in white coats?\"\nJanet: \"I hope not.\"\nAmantha: \"What about the men in white hats?\"\nJanet: \"They never existed.\"\nAmantha: \"Deep down you're darker than I am, Mother. Admit it.\"\nJanet: \"I don't think I want to do that, Amantha.\"\nTawney: \"God is releasing your pain.\"\nDaniel: \"Where does it go?\"\nTawney: \"He takes it.\"\nTeddy: \"So all your sins are forgiven now, huh? That must be load off.\"\nThis episode is sort of awesome. Four out of four men in white coats,\nBillie\n---\nBillie Doux is the founder of Doux Reviews and has been reviewing her favorite shows for quite some time. More Billie Doux.\nRectify season 1\nRectify home\nWatch this episode or the entire season now", "source": "Doux Reviews"}