{"published": "2015-09-11T03:48:46Z", "media-type": "News", "title": "50,000 flock to Galician octopus festCarballiño", "id": "e84b4100-aa43-4f55-95bf-273ac0f015b4", "content": "More than 50,000 people descended on the small town of O Carballiño in Orense (Galicia) today to take part in the now traditional, annual \"Festa do Pulpo\" - octopus fest - eager to taste this typical Galician dish cooked in traditional copper pans.\n\nShoulder to shoulder with thousands of other octopus fans, the town's mayor, Francisco Fumega, told journalists that people's expectations \"have been met several times over\" at this year's gourmet festival. In contrast to last year, the sun has shone on proceedings, meaning more people than ever have turned up to enjoy a tasty octopus snack.\n\nFrom first thing this morning, dozens of octopus sellers were cutting, chopping and serving the \"pulpo á feira\" delicacy at their stalls, each adding just the right amount of oil, salt and paprika to suit each individual diner's tastes.\n\nVisitors filled the gardens and picnic tables, to the sound of lively music from a variety of different bands and orchestras, and tucked into the exquisite cephalopod, the star dish of the event, but by no means the only delicacy on offer.\n\nIn the historic centre of O Carballiño, the bars and restaurants had to organise a number of separate sittings in order to be able to feed all the hungry mouths in the town today and what has been declared a fiesta of National Tourist Interest.\n\nApart from the large number of visitors from all over Galicia, the mayor pointed out the healthy representation of visitors from Latin America, presumably the result of the emigration of such large numbers of 'gallegos' to that part of the world.\n\nThe mayor proudly presented this 53rd edition of the fiesta as \"the collective creation of the people of O Carballiño, who knew how to recognise the dynamic economic, social and cultural power of such an important product as pulpo á feira.\"\n\nThe town had a another reason to celebrate today, having set a new record for the biggest octopus 'tapa' last week, beating their great rivals in Ponferrada with a single dish measuring 5.13 metres in diameter and containing 500kg of octopus.", "source": "Think Spain"}