{"published": "2015-09-18T17:30:45Z", "media-type": "News", "title": "Rule 'fair' even if No. 99 can't vote: Harper", "id": "e2d9a240-d5c2-439d-aacc-93416dd55551", "content": "TORONTO — Conservative Leader Stephen Harper did some deft skating Friday when he was told hockey legend Wayne Gretzky would be unable to vote for him Oct. 19 thanks to rules barring long-term Canadian expats from casting a ballot.\r \n \n\r\n                            Harper was unapologetic about the law, which has effectively disenfranchised about 1.4 million Canadians who have lived abroad for more than five years and sparked anger among many of them.\r \n \n\r\n                            \"Obviously, we're going to make sure that we have, I think, fair rules to make sure Canadian elections are decided by Canadian residents,\" Harper said during a campaign event in Calgary.\r \n \n\r\n                            \"I've never heard Mr. Gretzky challenge that particular notion.\"\r \n \n\r\n                            Gretzky, who was raised in Brantford, Ont., but has lived for years in the United States, was slated to appear with Harper at an evening event Friday in Toronto.\r \n \n\r\n                            While Harper may not have heard from the Great One about losing his right to vote, other Canadians have been far more vocal, including actor Donald Sutherland, who denounced the law in a recent opinion piece.\r \n \n\r\n                            \"I'm an expatriate and the Harper government won't let expatriates participate in Canadian elections,\" Sutherland wrote in the Globe and Mail.\r \n \n\r\n                            Two other expats have begun a crowdfunding effort to allow them to ask the Supreme Court to take up the case after Ontario's top court upheld the law as constitutional.\r \n \n\r\n                            In a tweet Friday, Gill Frank, who helped launch the constitutional challenge, wondered why Gretzky would be campaigning for Harper if he's precluded from voting for him.\r \n \n\r\n                            Another expat, Nicolas Duchastel de Montrouge, is running against Harper in his Calgary riding to highlight what he considers absurd rules that prevent him from voting, but not from running as a candidate.\r \n \n\r\n                            Harper is effectively \"modifying\" the Constitution, Duchastel de Montrouge said.\r \n \n\r\n                            \"The Constitution doesn't have any residency requirements,\" he said. \"It says every single of citizen of Canada is entitled to vote.\"\r \n \n\r\n                            Duchastel de Montrouge, now of suburban Seattle, is trying to get the required 100 signatures from residents he needs to become an official candidate — although he is discouraging people from voting for him if he does run.\r \n \n\r\n                            The first signature he got, he said, came from a fellow passenger on the flight to Calgary — a self-described Conservative.\r \n \n\r\n                            Gretzky, who recently endorsed Patrick Brown in his successful bid to lead Ontario's Progressive Conservative party, nevertheless won praise from Harper for representing more than just great hockey.\r \n \n\r\n                            \"He has been, even as an expat, a fantastic ambassador,\" Harper said, \"not just for our great national winter sport but for this country.\"\r \n \n\r\n                            Besides Sutherland and Gretzky, disenfranchised expats with strong ties to Canada could include such well-known figures as Neil Young, Celine Dion, William Shatner or even Sidney Crosby, another NHL superstar who lives in the U.S.\r \n \n\r\n                            The NDP, Liberals and Greens all say they believe the expats should be able to vote.\r \n \n\r\n                            By Colin Perkel, The Canadian Press", "source": "Niagara This Week"}