{"published": "2015-09-07T07:39:04Z", "media-type": "News", "title": "Huge buried neolithic monument found near Stonehenge", "id": "f0cac58a-7385-4931-9fda-36ce96906a14", "content": "HIDDEN remains of an extraordinary neolithic monument have been found buried beneath the ground a mile from Stonehenge . \n \nMore than 4,500 years ago, at least 90 huge stone monoliths lined an impressive \"arena\" that may have been used for religious rites or solstice rituals. \n \nNow lying on their sides covered by three feet of earth, they remained undiscovered until archaeologists equipped with ground-penetrating radar probed the area around the famous stone circle on Salisbury Plain. \n \nThey are the most important find to emerge so far from the Hidden Landscapes project which is using state-of-the-art technology to map \"invisible\" archaeological features embedded in the Wiltshire countryside. \n \nThe stones, some measuring nearly 15ft, were placed along the south-eastern edge of what later became the Durrington Walls \"superhenge\" - a circular enclosure ringed by a ditch and bank that at nearly a mile across is the largest earthwork of its kind in the UK. \n \nExperts believe the stones, which may have been thought to have magical properties, were not originally part of the henge but were deliberately toppled before being incorporated into it. \n \nProfessor Vince Gaffney, from the University of Bradford, one of the archaeologists leading the project, said: \"We're looking at one of the largest stone monuments in Europe and it has been under our noses for something like 4,000 years. \n   Promoted stories   \n\"It's truly remarkable. We don't think there's anything quite like this anywhere else in the world. \n \n\"This is completely new and the scale is extraordinary.\" \n \nHe added: \"We presume it to be a ritual arena of some sort. \n \n\"These things are theatrical. They're designed to impress and impose; to give the idea of authority to the living and the dead. \n \n\"It really does create a massive impression, and was clearly important enough to have been drawn into the developing landscape.\" \n \nNinety stones have been discovered so far, and there may be more. \n \nWhat kind of material they are made of is unknown, but they could be similar to the giant sandstone \"sarsens\" of Stonehenge. \n \nProf Gaffney believes the stones may have been planted by the same people who built Stonehenge, but is sceptical about a direct link between the two monuments. \n \nThey were placed along a steep slope, or scarp, cut into a natural dry valley to form a C-shaped feature. \n \nPrecisely why the stones were put there remains a mystery. \n \nPart of Durrington Walls is aligned with the rising sun on the winter solstice, the shortest day of the year, which may be significant. \n \nThe archaeologists believe that at some stage the stones were pushed over and incorporated into the emerging henge. \n \nThis was not an act of vandalism but a deliberate attempt to preserve whatever it was about the stones that seemed so important. \n \n\"There was a transformation in the landscape that we do not understand,\" Prof Gaffney said. \n \n\"The stones had significance. These are special places. \n \n\"Societies are mobilised, as with the great cathedrals, to create these things.\" \n \nThe discovery at Durrington Walls was unveiled at the British Science Festival, taking place this week at the University of Bradford. \n \nAt the same event last year, the international team revealed a host of previously unknown archaeological features that had been hidden in the landscape around Stonehenge. \n \nThey included a 108ft long burial mound containing a massive wooden building whose timber foundations lay under the soil. \n \nThe ongoing survey is using a suite of technologies to peer below the ground, including penetrating radar, electromagnetic induction, magnetometry, electrical resistance mapping, and lasers. \n \nDr Nick Snashall, National Trust archaeologist for the Avebury and Stonehenge World Heritage Site, said: \"The Stonehenge landscape has been studied by antiquaries and archaeologists for centuries. \n \n\"But the work of the Hidden Landscapes team is revealing previously unsuspected twists in its age-old tale. \n   \n Share article  \n   \n\"These latest results have produced tantalising evidence of what lies beneath the ancient earthworks at Durrington Walls. \n \n\"The presence of what appear to be stones, surrounding the site of one of the largest Neolithic settlements in Europe adds a whole new chapter to the Stonehenge story.\"", "source": "Wiltshire Times"}