{"published": "2015-09-04T20:51:37Z", "media-type": "News", "title": "Hillary Clinton Tells NBC News She Is 'Sorry' for Email Confusion - NBCNews.com", "id": "ce73a3bc-76a4-49fa-b504-4a42aac70249", "content": "In an exclusive interview with NBC News/MSNBC's Andrea Mitchell on Friday, Hillary Clinton said she's \"sorry\" there's been so much controversy over her private email server, but declined to apologize for the decision to use it. She also suggested that GOP front-runner Donald Trump is unqualified to be president and weighed in on the surprisingly robust challenge to her candidacy from Democratic primary rival Bernie Sanders. \n \n\"At the end of the day, I am sorry that this has been confusing to people and has raised a lot of questions, but there are answers to all these questions,\" Clinton said of her email server after being pressed by Mitchell on whether she should apologize for the controversy that has dogged her campaign from the outset. \"And I take responsibility and it wasn't the best choice.\" \n \nIt was just the third nationally televised interview for Clinton, the former secretary of state and Democratic 2016 front-runner, since announcing her campaign in April. Beset by flagging approval ratings, the Sanders challenge and the possibility that Vice President Joe Biden may enter the race, Clinton's interview with Mitchell appeared to be part of her campaign's latest effort to offer more access to the candidate. \n \nYet as her own campaign chairman John Podesta acknowledged in a conference call with reporters Thursday, Clinton's campaign has faced \"headwinds\" since March, when her private email server was first revealed. Her poll numbers have fallen as the number of people who consider her untrustworthy has risen. \n \n\"Certainly, it doesn't make me feel good,\" Clinton said when asked by Mitchell about those who find her dishonest. \"But I am very confident that by the time this campaign has run its course, people will know that what I have been saying is accurate.\" \n \nAfter laughing off questions about her server for months, Clinton has begun to strike a more contrite tone. \n \nShe explained that she had used a personal email account as a senator from New York and didn't spend much time considering alternatives when she became secretary of state in 2009. \"I did all my business on my personal email [in the Senate],\" Clinton said. \"I was not thinking a lot when I got in [to the State Department]. There was so much work to be done. We had so many problems around the world. I didn't really stop and think what kind of email system will there be.\" \n \n\"This was fully above board, people knew I was using a personal email, I did it for convenience. I sent emails that I thought were work related to people's dot gov accounts,\" she added. \n \nAsked by Mitchell about Trump's attacks on longtime Clinton aide Huma Abedin, Clinton said the Republican's candidacy is \"a bad development for our American political system\" and that his bravado could have dangerous repercussions if he became president. \n \n\"Loose talk, threats, insults -- they have consequences,\" she said. \"The president of the United States needs to be careful about what he or she says. \n \nShe went to say that Trump is \"great at innuendo and conspiracy theories and really defaming people.\" \n \n\"He is the candidate of being against,\" she continued. \n \nTrump and fellow Republican candidate Ted Cruz will hold a rally opposing President Barack Obama's nuclear agreement with Iran next week at the same time Clinton will be defending it in a speech in Washington. Asked about that, Clinton suggested that Trump and Cruz \"don't believe in diplomacy\" and said Americans want a president who does. \n \nClinton planned to deliver remarks on the Iran deal next week in Washington. \"It is by no means perfect, but it's an important step,\" Clinton told Mitchell, adding that Iran \"can never, ever have a nuclear weapon.\" \n \nThe Democratic front-runner has avoided getting into tangles with her primary opponents, and refused to weigh in on the political ramifications of Vice President Joe Biden's potential decision to the enter race. \n \nBut asked about why voters find Biden and challenger Bernie Sanders more authentic than Clinton, the former secretary of state seemed to take subtle dig at Sanders. \"I started out listening because I think you can come with your own ideas and you can wave your arms and give a speech, but at the end of the day, are you connecting with and really hearing?\" she said. \n \nAides have promised that Clinton in the coming weeks would take on a greater focus on women and stress her own role as a potential woman president. She appeared to make good on that promise with Mitchell, saying her candidacy was part of an career-long commitment to help women and girls around the world. \n \n\"My running for president is a way of sending a message -- we have an opportunity to lift up everyone,\" Clinton said.", "source": "Mount Olive Tribune"}