{"published": "2015-09-23T13:43:37Z", "media-type": "News", "title": "Manhattan Associates Downgraded by Zacks to Hold (MANH)", "id": "d4d3c021-5dd8-44df-a2a3-46d59fc57453", "content": "Zacks downgraded shares of Manhattan Associates (NASDAQ:MANH) from a buy rating to a hold rating in a research report released on Tuesday, MarketBeat.Com reports. \n \nAccording to Zacks, “Manhattan Associates is a leading provider of technology-based solutions to improve supply chain effectiveness and efficiencies. The company’s solutions enhance distribution efficiencies through the integration of supply chain constituents, including manufacturers, distributors, retailers, suppliers, transportation providers and end consumers. Their solutions consist of software; services, including design, configuration, implementation, and training services, plus customer support and software upgrades; and hardware.   “ \n \nMANH has been the subject of a number of other reports. Benchmark Co. boosted their target price on shares of Manhattan Associates from $65.00 to $67.00 and gave the stock a buy rating in a report on Wednesday, July 22nd. Raymond James downgraded shares of Manhattan Associates from a strong-buy rating to an outperform rating and upped their price objective for the company from $63.00 to $69.00 in a report on Wednesday, July 15th. \n \nShares of Manhattan Associates ( NASDAQ:MANH ) opened at 62.30 on Tuesday. The firm’s 50-day moving average is $61.99 and its 200-day moving average is $57.78. Manhattan Associates has a 1-year low of $31.53 and a 1-year high of $69.81. The company has a market capitalization of $4.57 billion and a price-to-earnings ratio of 50.65. \n \nManhattan Associates (NASDAQ:MANH) last released its quarterly earnings data on Tuesday, July 21st. The company reported $0.37 earnings per share for the quarter, topping the Zacks’ consensus estimate of $0.33 by $0.04. The business earned $139.11 million during the quarter, compared to analysts’ expectations of $135.47 million. During the same period last year, the company earned $0.29 earnings per share. The firm’s revenue was up 13.5% compared to the same quarter last year.  Analysts forecast that  Manhattan Associates will post $1.41 earnings per share for the current fiscal year. \n \nManhattan Associates, Inc. ( NASDAQ:MANH ) is a developer and provider of supply chain commerce solutions. The Company is engaged in developing, selling, deploying, servicing and maintaining software solutions designed to manage supply chains, inventory and Omni-channel operations for retailers, wholesalers, manufacturers, logistics providers and other organizations. The Company’s solutions consist of software, services, and hardware, which coordinate people, workflows, assets, events, and tasks across the functions linked in a supply chain. It offers its solutions in three areas: supply chain, Omni-channel and inventory. Its solutions enable coordinating the actions, data exchange, and communication of participants in supply chain ecosystems, such as manufacturers, suppliers, distributors, trading partners, transportation providers, channels (such as catalogers, store retailers, and Web outlets), and consumers. It has operations in North America, Europe, and the Asia/Pacific region. \n \nTo get a free copy of the research report on Manhattan Associates (MANH), click here . For more information about research offerings from Zacks Investment Research, visit Zacks.com", "source": "SleekMoney"}