{"published": "2015-09-08T08:09:00Z", "media-type": "News", "title": "Improving the Environment Condition of Modern City with Airwheel intelligent personal transportation Standing electric scooter", "id": "3b6d1350-b567-44af-a7a0-dbbabbb1aa3e", "content": "Environmental problem has become a great issue for modern city and the whole society. With the alarming development of modern urbanization, people’s life in modern city is getting more and more convenient and comfortable day by day. People’s unlimited demands about automation lead to the alarming consumption of carbon and coal which made the environmental condition of modern city more and more terrible. Airwheel electric self-balancing scooter is going to help people solve this problem.\n\nAfter the triggering of industrial revolution in England in 17th century, people started to move towards modern cities to seek for a better living condition. The development of modern city has been established upon the consumption of carbon and coal. From steaming age to electricity age, carbon and coal has been regarded as the most valuable natural resources for the development of a city or even a country. Nevertheless, the unlimited consumption of carbon and coal has brought people more and more irreversible illness and defects on the environment. In these several decades, people in the west and east are starting to realize the problem and try to make efforts to improve the environmental condition of modern city. In the transportation field, Airwheel electric self-balancing scooter is making efforts to lead an environmental protection tendency in modern city.\n\nImage: \n\nAirwheel electric self-balancing scooter, with its tiny and simplified structure, is consuming much less electricity compared with conventional transportation tools. Small size and less weight has become a tendency for the whole transportation. Airwheel electric unicycle does well in shrinking the size and reducing the weight of the vehicle. One can even pack an Airwheel electric self-balancing scooter into a bag and take it anywhere he wants. So the designing concept of Airwheel electric self-balancing scooter has given it a great advantage competed with other transportation tools. Image: \n\nFurthermore, Airwheel electric self-balancing scooter is motivated by pure electricity without any air pollution released during traveling. According to some scientific researches in Europe, Airwheel electric scooter is even more environment protecting than bicycles in the aspect of air pollution. Airwheel electric self-balancing scooter, as high technological product, will help people improve the environmental condition of modern city.\n\nMedia Contact \n\nSource: ABNewswire\n\nReleaseID: 36967", "source": "KHQ Right Now"}