{"published": "2015-09-09T20:42:38Z", "media-type": "News", "title": "Guest Opinion: With fewer ﬁres, why are there far more ﬁreﬁghters?", "id": "df6f9c81-e37f-474e-94d0-26623eb24812", "content": "Rapid improvements in fire safety have caused a dramatic drop in the number of blazes, according to the National Fire Protection Association. Buildings are constructed with fire-resistant materials; clothing and curtains are made of flame-retardant fabrics; and municipal laws mandate sprinkler systems and smoke detectors. The striking results: On highways, vehicle fires declined 64 percent from 1980 to 2013. Building fires fell 54 percent during that time. There are half as many fires as there were 30 years ago, but about 50 percent more people are paid to fight them. This is no secret. Across the country, cities and towns have been trying to bring firefighting operations in line with the plummeting demand for their services. Many solutions have been attempted: reducing the length of firefighters’ shifts; merging services with neighboring towns; and instituting brownouts, which temporarily take an engine out of service. But often, these efforts have failed against obstinate unions and haven’t reversed the national increase in fire department payrolls. Instead of addressing this municipal waste with patchwork plans to cut overtime and shrink staffs, many cities and towns should consider throwing out the very concept of the career firefighter and return to the tradition of volunteers. For fire departments, building blazes — catastrophic or not — have become infrequent. Firefighters responded to 487,500 structure fires across the United States in 2013, which means each of the nation’s 30,000 fire departments saw just one every 22 days, on average. And yet, taxpayers are paying more people to staff these departments 24/7. As a result, the amount of money shelled out for local fire services more than doubled from 1987 to 2011, to $44.8 billion, accounting for inflation. To be fair, fire departments have shouldered additional responsibility since the attacks of Sept. 11, 2001, and are expected to have the training and equipment necessary to respond to various types of terrorism, including biological and chemical attacks. Still, in a November report, the National Fire Protection Association blamed the surge in fire department funding on ballooning staffs, overtime pay and retirement and health benefits — things that have nothing to do with the threat of terrorism. Firefighters earned a median salary of $45,250 in 2012, according to the U.S. Bureau of Labor Statistics, but overtime can more than double that. Exorbitant overtime costs are fueled by union-negotiated minimum-staffing levels that often mandate four firefighters per engine be on duty at all times, regardless of the cost or workload. At the national level, the International Association of Fire Fighters has an annual budget of nearly $60 million, most of it derived from its 278,000 members. IAFF calls itself “one of the most active lobbying organizations in Washington,” advocating for pension, safety and overtime laws. Its political action committee, FIREPAC, spent nearly $6.4 million in 2014, according to OpenSecrets.org . The union’s constitution forbids members from serving as volunteer firefighters, under penalty of fines or expulsion. Page 2 of 2 - Today, fewer than 4 percent of fire department calls are for fires. Meanwhile, requests for medical aid more than quadrupled between 1980 and 2013, to more than 21 million, according to the National Fire Prevention Association. In other words, for every structure fire a fire department responds to, it receives 44 medical calls, on average. So “fire” department has become a misnomer. In practice, these agencies have become emergency medical responders. The problem with that? Most communities already have ambulance services, whose staffs are less expensive and more highly trained in medical aid. Many cities mandate that their firefighters be certified EMTs, which requires about 120 to 150 hours of training in basic emergency medical care. That’s far less than the up to 1,800 hours of training for the paramedics who staff emergency medical services. Yet paramedics are cheaper than firefighters, earning a median of $31,020 in 2012. Still, you’ll often see a large ladder truck respond to medical calls along with an ambulance, resulting in multiple uniformed cadres when just one person needs attention. To justify this, firefighters have touted themselves as “first responders” who can answer a medical emergency faster than paramedics in an ambulance. But when they arrive without the training and equipment to deal with severe medical emergencies, they are of little use. Recognizing the overlap, some cities have merged their fire and EMS services, over union objections. Some require that all members of the newly combined agency be certified to respond to both types of crisis, which improves efficiency and lowers costs. But other cities have struggled to merge the cultures and operations of the departments. About 69 percent of all firefighters in the country are volunteers. It is mainly larger cities and towns that have been burdened by union staffing and salary demands that are incompatible with their declining firefighting needs. The number of volunteer firefighters fell by 3 percent in the time paid firefighters grew by nearly 50 percent. This is not to say that our largest cities could operate with volunteer firefighters alone. Sheer population size may necessitate a core group of full-timers. But payrolls certainly shouldn’t be growing as fires are decreasing. Nor is this to say that professional firefighters are not heroic. They are and have repeatedly proved as much, most notably during the Sept. 11 attacks. But volunteers also are capable of such bravery. When we entrusted them with protecting our largest cities from blazes, they showed up and courageously put their lives on the line. Today, heroism isn’t what our firefighting services need most. As the risk of massive infernos declines, what we really need is to rethink our entire firefighting model — and how much we should be paying for it. Fred S. McChesney is a professor of law and economics at the University of Miami who studies the intersection of economics and public institutions.", "source": "Wicked Local North Attleborough"}