{"published": "2015-09-26T05:23:03Z", "media-type": "News", "title": "Whitemoor prisoner 'kept in solitary for more than two years'", "id": "395f554e-3406-482c-afb9-a353ad070e44", "content": "An inmate at a maximum-security prison has been kept in segregation for two-and-a-half years, according to a report. \n \r\n\t\t\r \nThe Independent Monitoring Board (IMB) for HMP Whitemoor revealed that it detained seven of the 24 prisoners held in segregation for more than six months across England's high-security jails as of June 1 this year. \n\r  Whitemoor prison near March, Cambridgeshire \r \r \nInspectors said a staffing \"merry-go-round\" meant inexperienced staff were needed to work on the segregation unit and management was \"poor\". \n\r\n\t\t\t\r \nPrison rules enable a governor to arrange for a prisoner to be segregated - kept away from other inmates - for up to 72 hours before seeking authorisation from the secretary of state. Inmates can be segregated if they are deemed to be in danger, to prevent danger to other prisoners or as punishment for disruptive behaviour. \n\r\n\r\n\r\n\r \nThe IMB cited a United Nations protocol which defines solitary confinement for more than 22 hours a day as torture and said m any inmates in segregation at the Cambridgeshire jail were often confined for longer. \n\nThe report, covering the year to May 2015, said: \"Although often faced with challenging prisoners, requiring officers to get into and  out of personal protection equipment, on most days staff were able to offer a full  regime. \n\n\"It was not however unusual for some curtailment to be necessary,  meaning that residents might miss showers, corporate worship, phone calls and  exercise. At its worst, for example on 10 occasions in April, the Seg (segregation unit) had to be  locked down.\" \n\nThe regime in place was \"much the same\" as that which HM Inspectorate of Prisons found in 2011 to be \"inadequate\", inspectors added. \n\r\n\t\t\t\r \n\"One of the other problems noted by Inspectors was the poor management  arrangements for the Seg. Whilst there have been definite improvements, with  greater adherence to procedures and standards, and consistency of decision-making,  new prison-wide staffing arrangements meant that the custody manager  responsible for the Seg was more frequently away from the unit, for example  acting as orderly officer, managing detail or on nights,\" the report said. \n\n\" We do not blame  Whitemoor managers for this merry go-round, which results from centrally-imposed  staffing norms.\" \n\nA high-profile terrorist prisoner recently won a legal challenge at the UK's highest court against his segregation at HMP Whitemoor. \n\nKamel Bourgass, an Algerian who is serving 17 years for conspiracy to commit public nuisance by using poisons or explosives in relation to the 2002 Ricin terrorist plot, was segregated for extended periods. \n\r\n\t\t\t\r \nThe Supreme Court ruled in July his confinement, for periods or more than a month, was unlawful beyond the initial 72-hour period. \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Ripley and Heanor News"}