{"published": "2015-09-30T09:21:45Z", "media-type": "News", "title": "Wulff-Yhtiöt Oyj: Decisions of Wulff Group Plc’s Extraordinary General Meeting on September 30, 2015", "id": "44ed1daf-58de-432e-8c1d-d5cf9b27facc", "content": "HELSINKI--( BUSINESS WIRE )--Regulatory News: \n \nWulff-Yhtiöt Oyj (HEX:WUF1V): \n \nSTOCK EXCHANGE RELEASE September 30, at 12 a.m. \n \nHeld on Sep 30, 2015, Wulff Group Plc’s extraordinary general meeting \n      decided that the number of board members is four. Johanna Marin, Ari \n      Pikkarainen, Andreas Tallberg and Heikki Vienola were elected as members \n      of the Board of Directors. The organizing meeting of Wulff Group Plc’s \n      Board of Directors, held after the extraordinary general meeting, \n      decided that the Chairman of the Board is Heikki Vienola. \n \nThe extraordinary general meeting decided that the members of the Board \n      of Directors will receive a monthly fee of EUR 1,250. \n \nThe extraordinary general meeting decided to change the Articles of \n      Association regarding the delivery of the invitation, so that the \n      invitation shall be published on Wulff Group Plc’s website. Articles of \n      Association 9 § was decided to be changed as follows: \n \n”The invitations to the General Meeting are published on the company’s \n      website at the earliest two months and not later than 21 days prior to \n      the General Meeting, but not later than nine days before the General \n      Meeting record date. In addition, the Board of Directors may decide to \n      publish the notice in some other manner. \n \nTo be entitled to participate in a General Meeting, the shareholder \n      shall notify the company of participation by the date indicated in the \n      invitation, which may be at the earliest five days before the meeting.” \n \nIn Helsinki on September 30, 2015 \n \nWULFF GROUP PLC \n \nBOARD OF DIRECTORS \n \nDISTRIBUTION \n \nNASDAQ OMX Helsinki Oy \n \nKey media \n \n www.wulff-group.com  \n \nIt all started from a small stationary store. This year Wulff celebrates \n      125 years of success. \n \nWulff Group Plc is an increasingly international listed company as well \n      as the most significant Nordic player in office supplies and an industry \n      pioneer. Wulff sells and markets office supplies, facility management \n      products, IT supplies as well as ergonomics and first aid products. \n      Customers can also acquire international fair services from Wulff. \n \nThis information was brought to you by Cision http://news.cision.com", "source": "Business Wire German"}