{"published": "2015-09-23T03:30:00Z", "media-type": "Blog", "title": "Don't Buy The Bullshit This Indiegogo Campaign Is Selling", "id": "569aceec-6340-4972-b083-499e636f7b1e", "content": "Batteriser is a crowdfunding campaign for a magical little sleeve you pop over your AA batteries, extending their useful life by ‘up to 800%’. Sound a little too good to be true? That’s because it 800% is*. The science behind the Batteriser isn’t actually pure crap. The premise is this: a new AA battery starts life producing a voltage of 1.5V. That voltage decreases over time, until the battery eventually has no more juice in it. But below a certain cut-off threshold, different for every device, the battery is no longer able to produce enough voltage, even if there’s plenty of energy left in a cell. Confused? Put it this way: an Apple Wireless Keyboard requires 1.075V or more from its batteries to function. So if the batteries inside drop below that level — and they will — the keyboard will tell you to replace them. But there’s still juice left in the batteries — pop them in an old-school flashlight, and you’ll get a dim but very real light coming out of the bulb. Advertisement This is the problem the Batteriser sleeve seeks to solve: using a miniature DC - DC converter, it provides a constant 1.5V from the AA battery for its entire life, before it finally drops dead when there’s actually no more juice to give. So Does It Actually Work? And Batteriser actually works! As far as we can tell without any conclusive testing, Batteriser does make a battery produce a constant 1.5V output, using the majority of the energy in the cell (minus some inefficiencies in power conversion). But the problem comes in the form of the company’s marketing, which uses a perfect combination of techno double-speak and ‘creative’ statistics to make you think you need its $20 gadgets. Batteriser has two main claims: that a ‘significant number’ (this used to say ‘all’, before it was quietly changed) of batteries you throw away have only used 20% of their capacity; and that by throwing on a Batteriser sleeve, you can improve the battery life of your devices by up to 800%. Let’s ignore the obvious math flaw here (if you can regain that ‘missing’ 80% of capacity, that’s a 500% increase, not 800%) and focus on that first claim. Dr Bob Roohparvar, the CEO of parent company Batteroo, told me that number comes from this 2003 study from ETH Zurich. The study collected batteries from recycling points around Switzerland, and tested them for remaining capacity. It’s a solid methodology, but Roohparvar twists the results. He displays a table for ‘accumulated average’ rather than a straight percentage, which makes it seem like far more batteries have a higher capacity remaining. You can see the difference pretty well in this graph from the original study: the upper grey line is the accumulated average, quoted by Roohparvar; the lower line shows the actual distribution. More important than Roohparvar’s twisting the stats, though, is the difference in device you use the Batteriser with. For some particular high-power devices (really, the only example are old-skool cameras that run on AAs), the cut-off voltage will be as high as 1.4V (remember, those batteries only start at 1.5V). In those rare devices, Batteriser will make a difference — who knows, maybe even the 800% difference claimed! But in most things you use batteries in, like remote controls or keyboards, the cut-off voltage is much lower, and therefore any potential Batteriser savings are much lower. What Other People Say A handful of electrical engineers extensively debunked Batteriser’s claims when the product was first announced — the most thorough is probably this 40-minute YouTube video from Dave Jones, which takes apart the science and claims behind the Batteriser. He attacked their claims further in a blog post, as did others. One of Batteroo’s only solid bits of evidence to back up its claims is a test, conducted by an independent lab (but designed by Batteroo). It compared a Garmin GPS’s run time with and without Batteriser. The GPS has a cut-off voltage of 1.1V, meaning that according to Batteriser’s haters, there should only be a modest increase in runtime (if at all). On the face of it, the results are good for Batteroo: without Batteriser, runtime is 1 hour 43 minutes; with it, it’s 10 hours 12 minutes. That sounds like a huge improvement, but really it’s because of a tiny condition in the testing parameters: the test ended when the GPS died, or when a low-battery message is displayed. TechnologyCatalyst replicated the experiment on video, and (surprise!) found the test to be bullshit: with regular AAs, you get a low-battery message at an hour or two in, saying that the backlight can’t be turned on. But tap that message away, and the GPS will keep working just fine — in the video above, it ran just fine on normal AA batteries, for 17 hours. The wave of bad publicity led to a few changes: Batteriser changed its website and video, to remove the claim that ‘all’ batteries have 80% capacity remaining (a mistake Roohparvar told me was because of a “miscommunication” between the engineers and the “website guys”); and Roohparvar accusing detractors like Jones of being paid by ‘big battery’ to take down his disruptive product. When I outright asked Roohparvar about his company’s claims, and all the accusations against it, I got the same kind of run-around: a five-minute explanation about peak voltages, followed by an incredibly bizarre parable about a snail and a well, stolen from his brother’s video: It’s all a shame, because if Batteriser was honest about its product — a tiny little device that stabilises voltage over the life of a battery — it would still sell. But instead, it’s using bad math and sketchy marketing to dupe people into thinking it’s some kind of magic battery-saving panacea.", "source": "io9"}