{"published": "2015-09-18T19:26:43Z", "media-type": "Blog", "title": "Parsha Perspective", "id": "d11c26c7-a6b4-4909-a8ef-4f32a374c201", "content": "By Rabbi Yisroel Shusterman\nWe have now ushered in a new Jewish year, having taken on new resolutions and goals with which to enhance our lives, spiritually and meaningfully. Cheder Chabad of Monsey hopes that these weekly Torah thoughts will help inspire to achieve those goals. The entire  Cheder Chabad of Monsey family, wish you and your dear ones a year replete with goodness, prosperity and good health. As the High Priest blessed the Jewish people on Yom Kippur in the Holy Temple, may we too all be blessed from A to Z with…Abundance,Bounty, Caring, Devotion…and everything good in between, until we reach… Zion, May all Israel be redeemed in peace, speedily in our days. This week’s Parsha Perspective is dedicated by Mr. Binyomin Philipson in memory of his late mother Mrs. Ellen (Elka bas Zisel) Philipson OBM At its core, Judaism is about unity: the unity of the one G‑d, the universe and the unity of all people created in the image of G‑d. And yet, Judaism also gives the ordinary man an irrevocable right to his own property—as we see in the Torah’s division of the Land of Israel to tribes and families, as well as in the command to celebrate the Jubilee year (where all property is returned to its original owners every 50 years). The idea of land ownership by definition creates separation and division within society, contradicting the ideal of unity. How is it possible for us to live with these opposing ideals in our philosophy and practice? This week’s Torah portion, VaYelech, (Devorim [Deuteronomy] 31:1-30) tells of the last days of Moses’s life.  Moses is well aware of this seeming contradiction between the individual’s right to personal property and the notion of unity. His people are about to transition from life in the desert, where there is no ownership of land, to an agrarian life in Israel, where for the first time, they are to become landowners. Moses knows he has one final opportunity to teach his people how to balance these opposing ideals. That is why, on the last day of life, he commands his beloved nation regarding the Mitzvah of “Hakhel” – the gathering of all Israel to the holy Temple in Jerusalem on the eighth year, immediately after the Shmittah (sabbatical) year. In these verses Moses is describing a way to instill the fundamental message of unity into the hearts and minds of a people who will spend most of their time, energy and effort working their land. This is done through two commandments: Shemittah, the sabbatical year during which we are forbidden to work the land for an entire year, and Hakhel, the gathering in the Temple after the sabbatical year, when the people are headed back to work for the next six years. During the Shemittah year, the seventh year, every land owner takes a year-long break from working the land, devoting his time to spiritual pursuits. During that year, all produce that grows in the field is legally ownerless, and anyone is free to enter any orchard or field to enjoy its produce. This mitzvah serves as a powerful reminder to the people that there is more to life than amassing wealth, that their true essence is the soul not the body, and they have to devote time to feeding the soul, just as they devote time to feeding the body. And then, at the end of the long sabbatical, just as everyone is anxious to get back to working the land, comes the mitzvah for all the nation to gather in the Temple to hear the words of the Torah. Moses is telling the people that if they want to be able to juggle the blessings of private property and the unified existence that is the core truth of Judaism, then before they get back to the field, they have to reenact the giving of the Torah at Sinai. They have to gather together—men, women and children—as at Sinai, when all the children of Israel stood around the mountain \"as one person with one heart,\" united around the words and teachings of the Torah. Moses understood that the children, the future generations, also need to experience this powerful feeling of unity which comes through the unifying teachings of the Torah, rather than through material blessings, which can sometimes cause division. Through these commandments, the people learned that although they may each possess property and material wealth, they are not defined, and should therefore not define themselves, by their material possessions and achievements. Moses was telling each individual: “Although your house may be nicer than your neighbor's, you are still one. You are one, because your soul, the core of who you are, is one with your neighbor’s soul. The material possessions that divide you are nothing more than an external garment. They are not who you are, and therefore cannot separate you from your friend.” And then there is us. We, whose bodies did not stand at Sinai, who did not stand shoulder to shoulder with the entire nation of Israel at the reading of the Torah in the Temple, we too must meditate on this message each year, when the story of Moshe's last day on this earth is read in the Torah. We must close our eyes and imagine standing with all our brothers and sisters at the foot of Sinai, listening to the words of G‑d and taking the message of Sinai to heart. If, with all our differences, we can define ourselves as souls sent to this world for a spiritual purpose; if the society we create values the individual for his or her spiritual essence, then we can have a unified society. Our homes, fields, cars and retirement accounts may look different, but we know that we are one, \"like one person with one heart.\"   (Excerpts from Chabad.org - by Rabbi Menachem Feldman) May you have a meaningful and uplifting Shabbos And inspiring Yom Kippur !", "source": "Chabad of Greater Monsey"}