{"published": "2015-09-13T18:56:37Z", "media-type": "News", "title": "Unions pledge to fight reforms 'tooth and nail'", "id": "aea7fa7e-0096-466e-ab1c-83ff6c5872ba", "content": "The Government is facing a storm of protest over controversial trade union reforms as it was revealed that a partnership agreement affecting hundreds of thousands of NHS workers will collapse if a proposed law is passed. \n \r\n\t\t\r \nUnion officials pledged to fight the Trade Union Bill with political, industrial and other action, with one senior leader saying he would be prepared to go to jail. \n\r  Unison leader Dave Prentis said there is no need for the Bill \r \r \nSir Paul Kenny, general secretary of the GMB, said if someone had to go to jail over the Bill, he would be the first, while other leaders warned of co-ordinated action. \n\r\n\t\t\t\r \nThe Bill, which receives its Second Reading in the Commons tomorrow, introduces a 50% threshold for participation in strike ballots, stops union subscriptions being taken directly from wages, and introduces new restrictions on picketing. \n\r\n\r\n\r\n\r \nUnions have described the legislation as \"draconian\" and warn it would criminalise ordinary workers and shatter civil liberties. The issue will dominate the TUC Congress, which opened in Brighton today. \n\nGeneral secretary Frances O'Grady said unions will \"chuck the kitchen sink\" at a campaign to oppose the Bill. \n\n\"People know that the right to strike is an important democratic right. Every fair-minded MP should vote against this.\" \n\nUnison leader Dave Prentis warned that his union would withdraw from partnership working in the NHS if the Bill becomes law, a move he said would affect talks on issues such as equal pay. \n\r\n\t\t\t\r \n\"We would then take legal cases rather than reach agreements. There is just no need for this Bill and we will fight it tooth and nail.\" \n\nMr Prentis said around a million Unison members paid their union subs through the so-called check-off system, warning that scrapping it could lead to a loss of 30% of his members. \n\n\"We would have to manage a smaller union. But we are not sitting back - we will drastically increase the number of full-time officials dealing with membership. \n\n\"The Bill would have an incredibly bad impact on industrial relations in this country and takes away the ability of workers to have a voice. It will bring in a police state. We would also not be able to reach an agreement with employers to collect subs from wages - for which we pay them.\" \n\r\n\t\t\t\r \nSir Paul hit out at provisions in the Bill on picketing, including fines for those not wearing an official armband, as well as pickets having to give their names to police. \n\n\"If they are criminalising peaceful picketing to the point where someone not wearing an armband gets fined £20,000, then I will turn up without an armband. If someone has to go to prison, I would go first. It would not worry me in the slightest.\" \n\nMark Serwotka, leader of the Public and Commercial Services union, said the Bill offered the best reason for mass demonstrations on picket lines. \n\nPCS members at the National Gallery are on all-out strike over privatisation and the dismissal of a union rep and Mr Serwotka warned that thousands of people will turn up at their picket line if the Bill becomes law. \n\n\"I think people will refuse to abide by the law,\" he told a press briefing in Brighton. \n\r\n\t\t\t\r \nConservative MP David Davis criticised parts of the Bill. \n\nHe told Sky's Murnaghan programme: \"I agree with most of the Trade Union Bill, I think it's very sensible, but there are bits of it which look OTT, like requiring pickets to give their names to the police force. \n\n\"What is this? This is not Franco's Britain, this is Queen Elizabeth II's Britain. \n\n\"So we've got to be very, very careful in how we manage policy, in how we take Corbyn's Labour Party on. \n\n\"We take it on on topic and issue by issue, not ad hominem. \n\n\"And we've got to be not complacent about the meaning of this.\" \n\nThe Scottish National Party (SNP) said it will strongly oppose the \"regressive\" Bill. \n\nSNP MP Chris Stephens said: ''The SNP is committed to protecting the rights of workers and ensuring fair and equitable employment practices. \n\n\"That's why SNP MPs are doing everything we can to fight the introduction of this Dickensian Tory trade union Bill, which contains regressive policies more suited to the 19th century than the 21st. \n\n\"This Bill will further roll back the rights of working people across the country, despite the UK already having some of the weakest labour laws and some of the toughest legislation towards trade unions in the western world.\" \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Sunderland Echo"}