{"published": "2015-09-14T01:30:00Z", "media-type": "News", "title": "Cinema: Irrational Man is peculiarly forgettable", "id": "3b529b07-95dc-4b68-bb57-0bfd6e1d6178", "content": "Reviewed this week are Irrational Man, The Visit, Dope, Pasolini and Maze Runner: The Scorch Trials. Reviewed this week are Irrational Man, The Visit, Dope, Pasolini and Maze Runner: The Scorch Trials. Abe Lucas (Joaquin Phoenix) is rakish, dark, deep and, naturally, irresistible to women. His self-loathing and mysterious past catch the eyes and imaginations of two such females at a college campus where he has arrived to lecture in philosophy. Jill (Emma Stone) is the impressionable star student gravitating from her long-term boyfriend towards Abe, while Rita (Parker Posey) is a more senior fellow lecturer also straying for Abe's glum appeal. \n\nThat Woody Allen would pen such a premise is not a stretch - Allen loves nothing more than throwing promising but flighty protagonists into chases for false idols. Nor is it that bizarre to see Irrational Man, Allen's 50th film as director in as many years, descend into the realm of murder-tinged morality tale. What makes this undercooked film so peculiarly forgettable is its tonal disarray.\n\nJill's wide-eyed idealism and Abe's cliched intellectual grumbling hint at the world-weary Allen bullshit radar acting to perfect comic effect. The problem is, it's not very funny. Abe's release from stupor through a Dostoevsky-like murder plot and the ethical maze it lands him in are reliable dramatic intrigues. The problem is this never feels intriguing. Soundtracking all this with Ramsey Lewis's perky The 'In' Crowd doesn't help the disharmonious narrative rhythms.\n\nIt leaves little, bar perfectly fine performances from Phoenix and Stone (Allen's latest youthful muse) and some musings on Arendt and Kierkegaard to sustain us. This, alas, is insufficient return. For a director known for his final-act twists, perhaps the greatest mystery of M Night Shyamalan is that he still seems to be entertained by Hollywood studiodom as a respectable film-maker worth throwing money at. To this day, critics and audiences alike shiver at the mention of Lady In The Water (2006), The Happening (2008) and After Earth (2013). \n\nIn terms of his roots (The Sixth Sense and The Village remain classics), Shyamalan's latest could be titled \"The Re-Visit\" as it sees him return in his career to the horror origins that made him one of the biggest box office concerns of the early noughties.\n\nOlivia De Jonge and Ed Oxenbould play siblings Rebecca and Tyler, both precocious and lively despite the absence of their father in their lives. Their mother (Kathryn Hahn) is going on holiday with her new beau and ships the pair off to stay with her estranged parents whom she has not seen for 15 years following a family row.\n\n\"Nana\" (Deanna Dunagan) and \"Pop Pop\" (Peter McRobbie) meet them off the train and seem the picture of grandparental sweetness, all gentle chuckles and freshly baked cookies. And then everything goes very odd indeed, with the behaviour of the two elderlies veering from bemusing to eerie to all-out sinister.\n\nThe found-footage format is nothing new and will raise the usual scepticism as Rebecca and Tyler insist on filming every trauma at the isolated farmhouse. But The Visit succeeds for the most part, muddling the exuberance of its young leads with backwoods tension and basement horror. The obligatory twist is also well camouflaged. Welcome back, M. What passes for a geek in one borough might be the height of fashion in another. LA high-schooler Malcolm (Shameik Moore) is in the former camp, but his primary-coloured shirts and double-strapped rucksack wouldn't see him out of place frowning at a laptop screen down in the Fumbally. \n\nLife for Malcolm is a world away from hipster coffee joints, however, largely because he and his two pals Jib (Tony Revolori) and Diggy (Kiersey Clemons) don't fit in. They style themselves obsessively on 90s hip-hop, play in a punk three-piece and stay on the sidelines of the type of high school in which students undergo a security check on their way to class. The route home, meanwhile, is mired with gangs and bullies out to ruffle their fey feathers.\n\nAn opportunity for validation arrives when the trio land an invite to a local dealer's party. For Malcolm, the main draw is the attendance of the lovely Nakia (Zoe Kravitz, daughter of Lenny) but a shoot-out sees him accidentally scram with a big haul of MDMA in his rucksack. After a meandering mid section, writer-director Rick Famuyiwa finally gets to the nub of his racial politics by charting how Malcolm makes use of the stash. A disparity between ambition and execution is felt.\n\nLee Haugen won an award for editing at Sundance and Dope's slick and sassy movements are delightful in its more cartoonish moments. An ebullient but uneven film. Pier Paolo Pasolini is one of the less well-known Italian film-makers of his generation but the provocateur, poet, writer and director is revered in certain circles. Director Abel Ferrara is clearly one of these admirers, and in this film he recreates the last day of Pasolini's life, casting Willem Dafoe in the title role. It's a great piece of casting, however the film doesn't bring Pasolini to a broader audience but instead caters to those who know something about him already.\n\nThe opening scenes show Pasolini being interviewed in French - about his film Salo or 120 Days of Sodom, which caused a huge furore - and feature a young man fellating a group of young men. It moves on to Pasolini waking at home in Rome where he lives with his mother (Adriana Asti). Amongst scenes of their daily life, work with his assistant, lunch, visitors, another interview, the voiceover is a letter about a novel, Petrolio, that he is in the process of writing.\n\nHe decides to make another film and has dinner with a young actor and his wife and baby to discuss this project. Pasolini himself never got to make the movie and Ferrara creates a version of it for his film, it stars Ninetto Davoli, frequent Pasolini collaborator, and these scenes are intercut with the rest of the film. Meanwhile Pasolini's own life moves inexorably towards its violent end, one which has been disputed, one which Ferrara has said he knows the truth about but the mystery around it is not presented at all in the film.\n\nThere is a lot going on, some in English, some in Italian, some of that subtitled and some not. It is difficult for anyone unfamiliar with Pasolini to keep track and to appreciate all of the details in what is undoubtedly a lovingly researched but ultimately hard-to-grasp homage. Last year's first instalment of the Maze Runner trilogy was an enormous success worldwide, especially in the young adult market at which it and similar teen adventure series like The Hunger Games and Insurgent are pitched. In a post-apocalyptic world certain young people are immune to 'the flare', the disease which makes zombies of everyone else. A sinister organisation called WCKD is looking to harness this immunity.\n\nThis next episode takes up straight after the last ended, when the surviving 'Gladers' are rescued from WCKD and transported to a shiny new, comfortable facility where Janson (Aidan Gillen) assures them he is on their side. But at the behest of loner Aris (Jacob Lofland), Thomas (Dylan O'Brien, above right) investigates Janson's true motives and discovers that they are once again in the clutches of WCKD and evil doctor Ava Paige (Patricia Clarkson).\n\nThe group, including lone female Teresa (Kaya Scodelario) escapes, making off into the Scorch, as the outside world is now known. They're hoping to meet up with alleged freedom fighters the Right Arm but along the way meet obstacles like the zombies, or Cranks, and pirates led by Jorge (Giancarlo Esposito).\n\nFrom the beginning it is high action, with lots of pursuit and danger for the gang (including Thomas Brodie-Sangster, Ki Hong Lee, Dexter Darden and Alexander Flores) to face and endure. It feels like there are scenes recreated from almost every movie you've ever seen from The Matrix to I am Legend and Indiana Jones, all patched together with a new cast to make one big film. And this is a big film at well over two hours long, one situation leads straight into the next but it is more action- than plot-driven so the plot is thin and predictable, bar a very late twist that is a set up for the final instalment, due in early 2017.\n\nThe script is weak, there are a few dark scenes and relatively few light-hearted ones. Still it moves along well, is visually spectacular, it is in 3D and is CGI-heavy, and there are some good, if derivative, set pieces. It should make the target audience happy.", "source": "Irish Independent"}