{"published": "2015-09-10T13:15:00Z", "media-type": "News", "title": "A Step Towards Innovation - Report on JPMorgan Chase", "id": "4006c3dd-0b05-4c7f-9083-b466a0ac4ad2", "content": "ACI Association has initiated research coverage on JPMorgan Chase & Co. (NYSE: JPM). Select highlights from the internally released reports are being made available to the general public (included below), with access to the entirety of the research available to new members.\n\nToday, membership is open to readers on a complementary basis at the following URL: http://www.aciassociation.com/?c=JPM \n\nHighlights from our JPM Report include:\n\nCompanies receiving awards of $100,000 \n\nTo find out how this influences our rating on JPMorgan Chase & Co. read the full report in its entirety here: http://www.aciassociation.com/?c=JPM About ACI Association: \n\nActive Charter Investors Association (\"ACI Association\") produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. ACI Association has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below. ACI Association has not been compensated; directly or indirectly; for producing or publishing this document.\n\nPRESS RELEASE PROCEDURES: \n\nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third party research service company (the \"Reviewer\"). Rohit Tuli ACI Association, the Author, the Reviewer and the CFA® (collectively referred to as the \"Publishers\") are not responsible for any error which may be occasioned at the time of printing of this document or any error, mistake or shortcoming. No liability is accepted by the Publishers whatsoever for any direct, indirect or consequential loss arising from the use of this document. The Publishers expressly disclaim any fiduciary responsibility or liability for any consequences, financial or otherwise arising from any reliance placed on the information in this document. Additionally, the Publishers do not (1) guarantee the accuracy, timeliness, completeness or correct sequencing of the information, or (2) warrant any results from use of the information. The included information is subject to change without notice.\n\nNOT AN OFFERING \n\nThis document is not intended as an offering, recommendation, or a solicitation of an offer to buy or sell the securities mentioned or discussed, and is to be used for informational purposes only. Please read all associated disclosures and disclaimers in full before investing. Neither ACI Association nor any party affiliated with us is a registered investment adviser or broker-dealer with any agency or in any jurisdiction whatsoever. To download our report(s), read our disclosures, or for more information, visit http://www.aciassociation.com/. ACI Association is not available to residents of Belarus \n\nCFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.", "source": "Wall Street Select"}