{"published": "2015-09-09T18:45:56Z", "media-type": "News", "title": "Zeekoevlei upgrade a boost for touris ...", "id": "9a0cca90-ae99-412f-bf3a-0bc6edfedc6c", "content": "Cape Town - Millions of rand have been invested in the False Bay Nature Reserve to boost tourism and create employment opportunities. \n\r\n\t\t\t\t\t  \t\t    \r \nVisitors will be able to cycle, walk, braai and picnic along the eastern shore of Zeekoevlei following a R28-million injection. \n\r\n\t\t\t\t\t  \t\t    \r \nAlan Winde, the MEC for Economic Opportunities, said the project was a catalyst for the development of the False Bay coastline, which is being developed as a major tourist destination from Muizenberg to Gordon’s Bay. \n\r\n\t\t\t\t\t  \t\t    \r \nNearly 250 local people were employed over 2½ years to complete the project that had the support of all three spheres of government. \n\r\n\t\t\t\t\t  \t\t    \r \nOn Tuesday, national Minister of Tourism Derek Hanekom, Winde and Cape Town’s deputy mayor, Ian Neilson, unveiled a plaque and planted a Milkwood tree during the official launch. \n\r\n\t\t\t\t\t  \t\t    \r \nHanekom said most of the workers had previously been unemployed… so the project had brought real benefits. \n\r\n\t\t\t\t\t\t  \t\t\t\t  \t\t        \t\t    \t\t  \t\t    \r \nHe added that it might be the beginning of further partnerships as the Department of Tourism was working on the notion of Working for Tourism – along the lines of Working on Water and Working on Fire – to provide permanent, part-time jobs. \n\r\n\t\t\t\t\t  \t\t    \r \nHanekom said it was a new programme and still in development. \n\r\n\t\t\t\t\t  \t\t    \r \nHowever, it could develop “to involve people being employed to protect sites, keep them clean and safe, and provide information to visitors”. \n\r\n\t\t\t\t\t  \t\t    \r \nThe False Bay Nature Reserve, which is between Grassy Park and False Bay, is a designated Ramsar site – a wetland of international significance and the only one in Cape Town. \n\r\n\t\t\t\t\t  \t\t    \r \nGillian Davids, the office manager for contractors Designscape Architects, described the project as a “labour of love”. \n\r\n\t\t\t\t\t  \t\t    \r \nShe said the concept of upgrading “the community, by the community, for the community” was a winning recipe. \n\r\n\t\t\t\t\t\t  \t\t\t\t  \t\t        \t\t    \t\t  \t\t    \r \n“It created an opportunity to better the circumstances of our community.” \n\r\n\t\t\t\t\t  \t\t    \r \nDavids said about 240 people had been employed over the 2½ years, and had received training in plastering, paving, security, office management and life skills. \n\r\n\t\t\t\t\t  \t\t    \r \n“The transformation of the facilities is visible but the biggest transformation was the work done by the people who had a great work ethic and did the work with pride and dedication.” \n\r\n\t\t\t\t\t  \t\t    \r \nNeilson said the reserve was a unique national asset with prolific birdlife and critically endangered Cape Flats sand fynbos. \n\r\n\t\t\t\t\t  \t\t    \r \nEnvironmental education was a key focus. \n\r\n\t\t\t\t\t  \t\t    \r \nHe said it was an intergovernmental project, which had worked well. \n\r\n\t\t\t\t\t\t  \t\t\t\t  \t\t        \t\t    \t\t  \t\t    \r \n“When there is goodwill and we all agree on an approach, we get good results.” \n\r\n\t\t\t\t\t  \t\t    \r \nCape Argus  \n\r\n\t\t\t\t\t  \t\t  \t\t  \r \nFollow IOL Travel on Twitter \n\r \nGet our new, free Travel newsletter - subscribe here...", "source": "IOL"}