{"published": "2015-09-15T14:00:00Z", "media-type": "News", "title": "Mobeam Partners With Mobiquity Networks to Launch Retail's First Fully Integrated Beacon-Barcode Shopping App That Geo-Targets Shoppers With Relevant Offers Redeemable Directly From Smartphones", "id": "e1992a57-2e31-45c2-86c1-85e04f934322", "content": "PALO ALTO, CA -- (Marketwired) -- 09/15/15 -- Mobeam , the global leader in mobile barcode beaming technology, today announced it has finalized plans to partner with Mobiquity Networks , a subsidiary of Mobiquity Technologies Inc. ( OTCQB: MOBQ ), to integrate Mobiquity's location-based advertising and app engagement software into its Beep'nGo app, enabling it to deliver highly targeted, barcoded offers to shoppers, which they can redeem at in-store checkouts directly from their smartphones. \n\nMobeam's patented light-based beaming technology overcomes historical technical barriers and enables point of sale (POS) red laser scanners to read barcodes on Android mobile devices. Popular and emerging \"mobile payment\" apps rely on NFC or other technologies that communicate with credit card payment terminals, but not with scanners. Mobeam enables true mobile \"wallets\" and not just NFC-based card payment substitutes, meaning payment apps can now carry barcoded loyalty cards, membership cards, gift cards, tickets, vouchers and coupons, providing them with universal POS access at retailers. Shoppers use Mobeam's Beep'nGo app to easily scan the cards into the app using the camera or by manually entering the barcode numbers on the cards, thereby eliminating the need to carry plastic cards or paper coupons. Shoppers can access hundreds of discounts from stores where they shop and beam those discounts to any store checkout in the world. \n     \nBy integrating the Mobiquity Networks' SDK, Beep'nGo gains the potential to reach 260+ million monthly shoppers in Mobiquity's network. The Beep'nGo app will detect Mobiquity Networks' beacons, which are placed in the common areas of malls, such as food courts, corridors and walkways, and will deliver highly targeted offers to users' smartphones at the moment when they are the most impactful. \n\nMobeam technology has been used for more than 23 million beaming transactions since its launch. The company sought to extend the reach and targeting capabilities of Beep'nGo beyond the store, which led to the collaboration with Mobiquity Networks. \n\n\"Our goal is to make the shopping experience for consumers as easy as possible using mobile technology, which enables true digital wallets, not simply digital credit card alternatives,\" said George Garrick, CEO of Mobeam. \"We chose to work with Mobiquity Networks because it powers the largest shopping mall-based beacon advertising network in the U.S., and is known for delivering proximity marketing without compromising the user experience. By joining Mobiquity Networks' publisher network, we can improve the shopping experience even more by enabling shoppers to redeem their Mobiquity offers by simply beaming them into the checkout scanner. We complete the 'last mile' of capturing valuable targeted retail deals and enabling the shopper to easily transmit those savings into the checkout POS for an instant redemption.\" \n\nJosh Glantz, senior vice president of Strategy for Mobiquity Networks, added: \"Reaching shoppers when they are in mall common areas is just as important as reaching those who are in-store. This is the moment when they are deciding what stores to visit and what to buy. Now, Mobeam's Beep'nGo app will be able to reach consumers at these powerful moments of influence with relevant offers,\" he said. \n\nIn addition, the location awareness enabled by Mobiquity Networks provides Beep'nGo with much more granularity with respect to user activity, which will lead to better targeting and monetization opportunities. \n\nAbout Mobiquity Technologies \n\nMobiquity Technologies, Inc. ( OTCQB: MOBQ ) (\"Mobiquity\"), parent company of Mobiquity Networks, operates a national location-based mobile advertising network that has developed a consumer-focused proximity network which we believe is unlike any other in the United States. Mobiquity's integrated suite of leading-edge location based mobile advertising technologies allows our clients to execute more personalized and contextually relevant experiences, driving brand awareness and incremental revenue. Mobiquity Technologies will continue to attempt to expand its location-based mobile advertising solutions to create \"smart malls\" in retail destinations across the U.S. using Bluetooth-enabled iBeacon technology. Please visit the Company's corporate websites at: www.mobiquitytechnologies.com and www.mobiquitynetworks.com . \n\nAbout Mobeam \n\nMobeam is a global leader in mobile enabling technology. Mobeam technology allows laser scanners to read 1D barcodes from mobile devices, using patented technology that sends pulses of light or audio pulses to the sensor in scanners mimicking the black-and-white sequencing of standard barcodes. Mobeam is currently pre-loaded on more than 200 million mobile devices and enables retailers, CPGs and other companies to uniquely engage with consumers while increasing revenue opportunities. Mobeam was named a Red Herring Top 100 2015 award winner in the mobile industry segment. Additional information is available at www.mobeam.com . \n\nContact: \nScott Phillips \nScott Phillips + Associates, Inc. \nEmail Contact \n312.943.91", "source": "Town Hall"}