{"published": "2015-09-05T14:04:45Z", "media-type": "News", "title": "British sailor Andrew Ashman dies after being hit by sail amid yacht race", "id": "163589d1-58e9-45a9-bd7b-81ad860733a0", "content": "A British amateur sailor has died after being hit by a sail while competing in a yacht race. \n \nAndrew Ashman, 49, was less than a week into the year-long Clipper Round the World Yacht Race when he was struck unconscious while sailing off the coat of Portugal. \n \nVeteran sailor and Clipper race founder Sir Robin Knox-Johnston paid tribute to Mr Ashman, who worked for many years as a London Ambulance paramedic. \n \nSir Robin, the first person to sail non-stop single-handedly around the world, said: \"This is extremely sad news and my heart goes out to his bereaved family and friends, and to his fellow crew who have come to know Andrew with great affection during his training and the early days of this race. \n \n\"Safety is always our utmost priority, as our record shows, and we shall investigate the incident immediately in full co-operation with the authorities.\" \n \nMr Ashman, an \"experienced yachtsman\" from Orpington, Kent, was adjusting the sail of his team's boat just after midnight last night when he was knocked unconscious by the sail and possibly the boom, race organisers said. \n \nHe was given immediate medical assistance and attempts were made to resuscitate him, but he never regained consciousness and died in the early hours of this morning. \n   Promoted stories   \nThe vessel was in moderate seas when it was hit by a Force Six strong breeze (24-30 mph / 21-27 knots) and the tragedy happened. \n \nA spokesman for race organisers Clipper Ventures said: \"At this stage it looks like a tragic accident as far as we can see, but obviously there will be a full assessment. \n \n\"The skipper and crew have been very upset.\" \n \nHis boat, sponsored by South African firm IchorCoal, had been sailing around 120 nautical miles off the Portuguese coast heading towards Brazil in the first leg of the race. \n \nMr Ashman's boat, known as CV21, was part of a fleet which set sail from Tower Bridge last Sunday for the year-long race. \n \nThey were in the midst of the first of 14 mini-races and just under a week into the competition when Mr Ashman died. \n \nHis team have now diverted to Portugal are expected to arrive near Porto in the early hours of tomorrow morning. \n \nIt is the first death in the history of the Clipper Race, which was established nearly 20 years ago. \n   \n Share article  \n   \nMr Ashman had enjoyed sailing since joining the London Sailing project when he was 16 and was experienced on the seas, having completed his competent crew, day skipper, yachtmaster theory and coastal skipper courses. \n \nThe Clipper Race fleet is run by Clipper Ventures and comprises twelve identical yachts under the command of highly experienced professional skippers.", "source": "Stourbridge News"}