{"published": "2015-09-13T10:14:41Z", "media-type": "News", "title": "G4S launches ground-breaking product to revolutionise business travel safety", "id": "74d4c4e3-34e5-48bb-9c0c-2f5d3d6fd60f", "content": "13 September 2015 \n \nG4S, the world's leading security company, today launches the G4S TravelAware app, a ground-breaking security tool designed to inform business travellers across the globe. \n    \nTravelAware will revolutionise the way organisations protect their employees by providing travellers with critical and reliable, location-specific security information through a smartphone app, while managers have access to precise tracking of app users in real-time. Through an online portal and via the app, TravelAware enables two-way communication, keeping employees and managers connected and informed at all times. \n \nIn the event an employee is at risk, the system automatically alerts the management team of the app user's situation and provides the critical information and tools to coordinate an effective response. \n \nSwedish partner, Global Warning System, has already demonstrated the effectiveness of its patented technology, for example, during the Fukushima tsunami in 2011. App users received a SMS alert about the tsunami 47 minutes before it hit the east coast of Japan; a clear demonstration of how early warning alerts can save lives.. \n \nThe product is supported by G4S's Global Intelligence System (GIS), which combines analysis and advanced data mining technology to keep business travellers informed. G4S's team of risk experts has unique access to ground truth intelligence from employees in over 100 countries. \n \nMore companies than ever are seeking opportunities in emerging markets. Yet one in three companies have limited knowledge regarding how it would take to locate their overseas employees should an incident occur, and over two thirds of companies admit they could not locate their travelling employees within an hour of a major incident. G4S TravelAware addresses these challenges. \n \nAnne Tiedemann, Managing Director of G4S Risk Consulting commented: \n \n\"Travelling to remote locations or outside the usual tourist infrastructure means it is vital that employees are prepared and that employers know exactly where their employees are should an incident occur.  This product will completely change the way companies approach the safety of their travelling employees. \n \n\"The unique technology brings location-specific incident alerts to travellers in real-time, so employees are safeguarded wherever they are and should the worst happen, employers have the information to get their employees to safety.\" \n \nThe TravelAware app and portal are part of G4S's suite of travel risk management services, G4S TravelAware, which cater for all travel security needs, from bespoke pre-travel training and journey management to close protection and emergency response. \n \nENDS \n \nNotes to editors \n \nFor more information and images please contact Matt Magee on 07841 982 838 or matthew.magee@g4s.com \n \nOr visit www.g4sriskconsulting.com \n \nAbout G4S \nG4S is the leading global security company, specialising in the provision of security services and solutions to customers. Our mission is to create material, sustainable value for our customers and shareholders by being the supply partner of choice in all of our markets. \n \nG4S is quoted on the London Stock Exchange and has a secondary stock exchange listing in Copenhagen. G4S is active in over 100 countries and has 623,000 employees. \n \nG4S Risk Consulting is an integral part of G4S, operating across its entire international network. We provide solutions for our clients' varied, complex and changing needs by delivering first-class insight and analysis to secure environments, people, data and assets. \n \nOur industry-leading expertise is supported by our ability to mobilise the best people in the industry - specialists in everything from threat and risk mitigation, cyber security, training and investigations. \n \nAbout GWS Production AB \nGWS, Global Warning System, was founded in 2009, triggered by the experience with a global SARS epidemic, the 2004 Indian Ocean tsunami and the Mumbai terror attacks. GWS is listed on Nasdaq First North Stockholm. \n \nImages can be found here : \n \nhttp://hugin.info/136766/R/1612653/Ed_Robinson-OneRedEye-0668.jpg \nhttp://hugin.info/136766/R/1612653/Ed_Robinson-OneRedEye-0685.jpg \nhttp://hugin.info/136766/R/1612653/Ed_Robinson-OneRedEye-0593.jpg \nhttp://hugin.info/136766/R/1612653/Ed_Robinson-OneRedEye-0662.jpg \n \nCompulsory credit to EdRobinson/OneRedEye \n \n\nThis announcement is distributed by NASDAQ OMX Corporate Solutions on behalf of NASDAQ OMX Corporate Solutions clients. \nThe issuer of this announcement warrants that they are solely responsible for the content, accuracy and originality of the information contained therein. \nSource: G4S plc UK DK via Globenewswire \nHUG#1951606", "source": "Contra Costa Times"}