{"published": "2015-09-02T07:05:14Z", "media-type": "News", "title": "Q&A: What are the signs of a 'bear market' for stocks", "id": "c92ca520-2bd2-43e9-a8b1-37abbe4004c9", "content": "The stock market's sharp downturn in recent weeks has pulled the three major stocks indexes into what is known as a \"correction.\" But when does a market correction effectively end a bull market and usher in a full-blown bear market? Here are some common questions asked about bear markets, corrections and what they mean to average investors: ___\n\nHOW IS A BEAR MARKET DIFFERENT FROM A MARKET CORRECTION?\n\nA correction is a Wall Street term for when an index like the Standard & Poor's 500 index, the Dow Jones industrial average, or even an individual stock, falls 10 percent or more from a recent high. A bear market occurs when the index or stock falls 20 percent or more from the peak.\n\nThe three major U.S. stock indexes briefly fell into correction territory early last week, then came out, then fell back into correction on Tuesday. However the declines are still far short of what would be considered a bear market.\n\nThe Dow fell 469.68 points Tuesday to 16,058.35, which is 12.3 percent below its record close of 18,312.39 set on May 19. The Standard & Poor's 500 index slumped 58.33 points to 1,913.85. It's now down 10.2 percent from its high of 2,130.82 on May 21.\n\nThe Nasdaq slid 140.40 points to 4,636.10. That's down 11.2 percent from the index's high of 5,218.86 on July 20.\n\n___\n\nHOW OFTEN DO MARKET CORRECTIONS BECOME BEAR MARKETS?\n\nIn the S&P 500, the index that investors pay the most attention to, there have been 19 corrections since 1945, not including the current one, and 12 bear markets, according to S&P Dow Jones Indices.\n\nThat works out to corrections becoming bear markets a little less than 40 percent of the time, says Sam Stovall, managing director of equity strategy at S&P Capital IQ.\n\n___\n\nWHEN WAS THE LAST TIME WE HAD A BEAR MARKET?\n\nThe S&P 500 entered its most recent bear market on Oct. 9, 2007, as the U.S. housing downturn and mortgage crisis erupted, triggering a credit crunch. It ended on March 9, 2009. In that 17-month period, the index fell 56.8 percent.\n\n___\n\nHOW LONG DO BEAR MARKETS LAST AND HOW DEEP DO THEY GO?\n\nOn average, bear markets have lasted 14 months in the period since World War II, while market corrections have lasted an average of five months, Stovall said. The S&P 500 index has fallen an average of 33 percent during bear markets in that time. The biggest decline since 1945 occurred in the 2007-2009 bear market.\n\n___\n\nWHAT ARE THE SIGNS THAT A CORRECTION OR A BEAR MARKET HAS ENDED?\n\nGenerally, investors look for a 20 percent gain from a low point as well as sustained gains over at least a six-month period.\n\nOn average, bull markets end after 4.5 years. The current bull market has been going on for almost 6.5 years.\n\n\"We're in rarefied territory,\" Stovall said. \"We have gone most recently 44 months without a decline of 10 percent of more, versus an average of 18 months.\"\n\nThe shortest bear market for the S&P 500 was in 1990. It lasted 2.9 months, sliding 20 percent in that period, Stovall said. The longest was a 61-month bear market that ended in March 1942 and reduced the index by 60 percent.\n\nIn the 12 bear markets for the S&P 500 since World War II, only one failed to recoup everything it lost. It was the bear market that ended in May 1946.\n\n\"Yet every other bull market exceeded the prior bull market's high,\" Stovall said.", "source": "Clarksburg Exponent Telegram"}