{"published": "2015-09-12T07:50:35Z", "media-type": "News", "title": "Cizre curfew to end, mayor dismissed", "id": "554c990e-8bb8-486e-963a-da48a1d80733", "content": " Cizre's eight-day curfew will end at 7 a.m. local time (0400GMT) Saturday, Turkey’s Sirnak governorate announced on Friday. \n \nAccording to an official statement the curfew, which came into effect on September 4, will end as of 12 September. \n \nThe news comes on the same day Turkey's Interior Ministry revealed that the town’s mayor has been dismissed. \n \nSirnak governorate said: “Our security forces have conducted a successful operation against the members of [a] separatist terror organization. And we offer our sincere gratitude to our valuable citizens of Cizre who have been acting with patience and sensibility.” \n \nSirnak governorate also stated the operations will continue in order to protect security, life as well as restore public order. \n \nCizre mayor dismissed \n \nMeanwhile, Turkey’s Ministry of Interior Affairs announced that Cizre mayor Leyla Imret has been removed from office. \n \nCizre's chief prosecutor's office is to open a case against Imret on charges of \"provoking the public to armed rebellion against the government of Republic of Turkey and carrying out propaganda for a terrorist organization and inciting people to hostility and hate\". \n \nTurkish security forces are conducting an anti-terror operation around Cizre town to counter PKK attacks; the violence ramped up at the end of July following a suicide bomb attack -- blamed on Daesh -- in Sanliurfa province that killed 33 pro-Kurdish activists. \n \nThe renewed violence ended the “solution process” officially initiated in early 2013, aimed at ending the 30-year conflict between the PKK and the Turkish state. \n \nSince July, more than 100 members of the security forces have been martyred and hundreds of PKK terrorists killed in operations across Turkey and northern Iraq, including airstrikes.", "source": "Turkish Weekly"}