{"published": "2015-09-09T16:18:44Z", "media-type": "Blog", "title": "James Madison U start-up gets seed funding for observation platform technology", "id": "856b77ac-0569-4549-96ba-c9083a27bd23", "content": "James Madison U start-up gets seed funding for observation platform technology\rBy David Schwartz\nPublished: September 9th, 2015 A Harrisonburg, VA-based company spun out of James Madison University (JMU) has closed a $250,000 seed round to commercialize a tethered, hovering observation platform technology. Blue Vigil’s innovation is designed to provide a low altitude vantage point while carrying a wide variety of cameras, sensors or radio equipment. The technology is mobile, lightweight and easy to use, removing the need for additional manpower or training. “Blue Vigil will offer a powerful observation and communications platform to law enforcement officials, first responders, event organizers and others,” says the start-up’s CEO Todd Stave. “The support from the Harrisonburg investment community and James Madison University is allowing us to rapidly bring this valuable technology to the markets.” InnovateTech Ventures, a Herndon, VA-based firm specializing in developing early-stage tech companies, and a small group of regional investors worked with JMU’s Office of Technology Innovation and Economic Development to identify the technology, recruiting Stave, an experienced entrepreneur, to serve as CEO. “Bringing together people to create locally based technology companies is a great example of how JMU is engaged with the community,” says university president Jonathan Alger. The university has signed an agreement with Blue Vigil to provide the start-up with office space as well as access to interns and resources for research and development. The company has committed to keeping at least half of its jobs in Harrisonburg for the next three years. “The launch of Blue Vigil through the collaboration of JMU, InnovateTech and Harrisonburg private investors is a private-public partnership enabling the commercialization of a disruptive technology in a manner which supports regional economic development goals,” says Dr. Yvonne Harris, JMU Vice Provost for Research and Scholarship. “JMU plans to continue working with these partners to develop more start-ups using this model.” Source: PR Newswire Posted under: Tech Transfer e-News", "source": "Tech Transfer Central"}