{"published": "2015-09-18T00:45:19Z", "media-type": "News", "title": "Emily Blunt apologizes for citizenship joke - USA TODAY", "id": "9d6bd6a5-9f0f-4a06-82d1-ae766a4b2561", "content": "Newly minted U.S. citizen Emily Blunt, the British actress who once played Queen Victoria to a petulant T, must not have read the fine print on the citizenship oath. Surely it says somewhere: Don't joke about American politics in public — leave that to the Yanks. \n\nSo she found herself apologizing Thursday for something she thought was a throwaway line but which sent some Twitter users and Fox News pundits into a patriotic fury. \n\n\"It was so not my intention to hurt anybody or cause offense, and I really apologize to those I caused offense,\" she told Savannah Guthrie on the Today show. \"It was just an offhand joke. I think I’ll probably leave the political jokes to late night or something.” \n\nProbably wise, at least for the time being. \n\nBlunt just took the naturalization oath and became an American by virtue of her marriage to actor John Krasinski. \n\nIn the midst of promoting her forthcoming action-thriller, Sicario , in which she plays an FBI agent involved in the drug-war, Blunt was asked about GOP frontrunner Donald Trump by  The Hollywood Reporter  during a session at the Toronto International Film Festival. She joked that she watched the first Republican debate the night she was sworn in \"and I thought, 'This was a terrible mistake. What have I done?' \" \n\nShe told a similar joke to People at a screening of the movie in New York on Tuesday. \n\nSome Americans were not amused. \n\nLater, on Jimmy Kimmel Live ,   she also said she was a little sad about having to renounce allegiance to \"foreign princes,\" as the citizenship oath calls for, because she didn't want to renounce Queen Elizabeth II, who's the great-great-granddaughter of the queen she played in Young Victoria . Besides, she said, \"I like being British.\" \n\n(For the record, Brits who become American citizens are dual citizens, because under British law anyone born British stays British no matter how many other citizenships they may take up.) \n\nBut on Fox & Friends , the conservative network's morning show, her jokes were taken as a slam at Republicans and at citizenship. On Tuesday, co-host Anna Kooiman was blunt about Blunt: Get out, she said. \n\n\"Well you know what, then why don't you leave Hollywood, California, and let some American women take on the roles that you're getting, because Americans are watching your movies and lining your pockets,\" Kooiman said. \n\nAdded Steve Doocy: \"You know what Emily Blunt just did? She just Dixie Chicked herself. She has alienated half the country, that now will think twice about going to one of her movies.\" \n\nThere was some sympathy for Blunt on Twitter after that. \n\nStill, some repair work was necessary. Thus, the chat with Guthrie on  Today . Besides apologizing, Blunt said her swearing-in ceremony was important to her. \n\n\"It was really meaningful — my two favorite people in the world are Americans, my husband and my daughter,\" she said. \n\nAnd, she added, having taken the citizenship test, she now knows more about American history than British history.", "source": "Kenly News"}