{"published": "2015-09-09T07:20:08Z", "media-type": "News", "title": "Ryde's Jerome Laxale is mayor after name drawn from a hat - twice", "id": "91e62755-bede-4d79-8f74-b5663c718efd", "content": "A Sydney councillor who pulled only one-quarter of the vote in the first round of mayoral elections has nonetheless walked away with the top prize after becoming the city's newest lucky-dip mayor.\n\nPulling a mayor's name out of a hat is a little-known but not infrequently used means of resolving deadlocked council elections.\n\nBy that method Jerome Laxale is Ryde's newest – and youngest-ever – mayor. He joins a rich history of Sydney mayors who owe their position to good luck (the first recorded case is the mildly controversial 1886 election for the Mayor of Camperdown).\n\nBut His Worship may be the first-ever mayor to have had his name drawn out twice.\n\n\"It's quite ridiculous that it's come to this,\" said Mr Laxale, who has previously backed a reform to council laws to have the mayor popularly elected. \"It's not ideal but I'll have to run with it.\"\n\nMr Laxale, is one of just two ALP members of perhaps Sydney's most scandal-ridden council.\n\nRyde's meetings are famously acrimonious and have been known to bring some participants to tears.\n\nIt was unlikely Mr Laxale – who has made much political hay from Liberal Ivan Petch's appearances before a corruption commission – could ever have hoped to win a vote from the six Liberals who make up half of council.\n\nIn the end he didn't have to.\n\nThe first round of voting was split mostly along party lines. Liberal candidate Artin Etmekdjian won his colleagues' votes but was one vote shy.\n\nRemaining votes divided evenly between Mr Laxale and independent Terry Perram. By dint of the hat, Mr Laxale was through to the second round.\n\nThe Liberal vote didn't shift. But Mr Laxale won support from the independents and claimed six votes for himself.\n\nAnother draw (a box stood in for the proverbial hat) had Mr Laxale claiming the right to wear the mayoral wool and gold robes.\n\nThe 31-year-old Mr Laxale said he was hoping to \"represent the growing number of Gen Y ratepayers who call Ryde home\" and improve the availability of open space, housing and after-school care.\n\nHe now faces an uphill battle to do so with only one other party ally.\n\nBut if recent history is any judge, the helm of Ryde council is a job that comes with bigger problems than a lack of numbers.\n\n(The outgoing mayor, Bill Pickering, was recently knocked out cold without warning by a punch thrown by another former mayor at a campaign event. His predecessor, Ivan Petch, will this month answer to charges of blackmail and misconduct in public office).\n\n\"I'll try to avoid both scenarios,\" Mayor Laxale said.\n\nHis next job will be to respond to another pressing threat: the Baird government's looming plan to merge the city's council.", "source": "Sydney Morning Herald"}