{"published": "2015-09-18T09:55:00Z", "media-type": "News", "title": "Tribune Publishing Company Provides Updated FY2015 Financial Guidance", "id": "f871cb9e-4480-4e93-a4e9-1085eaa5a585", "content": "CHICAGO--(BUSINESS WIRE)-- Tribune Publishing Company (NYSE:TPUB) today announced that based on preliminary results through the end of August and the Company's outlook for the balance of the year, the Company now expects the following full year 2015 results: \n\nTribune Publishing's Chief Financial Officer Sandra J. Martin said, \"Revised guidance reflects lower forecasted revenue estimates for the year, concentrated in Southern California. Expense mitigation efforts partially offset this decline, but are expected to be unfavorably impacted by the delay of implementation of these efforts, principally in Southern California.\" Tribune Publishing's Chief Executive Officer Jack Griffin said, \"Our Board of Directors and management are fully committed to executing the five-point transformation plan that we launched last year when Tribune Publishing became a publicly traded company. We have made substantial progress, and continue to believe that it well-positions our Company to create value for our shareholders while continuing to produce editorially excellent publications that serve our readers and their communities with distinction.\" \n\nAbout Tribune Publishing Company Tribune Publishing Company (NYSE:TPUB) is a diversified media and marketing-solutions company that delivers innovative experiences for audiences and advertisers across all platforms. The company's diverse portfolio of iconic news and information brands includes 11 award-winning major daily titles, more than 60 digital properties and more than 180 verticals in markets, including Los Angeles; San Diego; Chicago; South Florida; Orlando; Baltimore; Carroll County and Annapolis, Md.; Hartford, Conn.; Allentown, Pa.; and Newport News, Va. Tribune Publishing also offers an array of customized marketing solutions, and operates a number of niche products, including Hoy, El Sentinel and VidaLatina, making Tribune Publishing the country's largest Spanish-language publisher. Tribune Publishing Company is headquartered in Chicago. \n\nCautionary Statements Regarding Forward-looking Statements\n\nThis press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934 that involve risks and uncertainties, including, without limitation, statements regarding Tribune Publishing's expectations regarding its expense mitigation efforts, revenue softness, and 2015 guidance. Statements containing words such as \"may,\" \"believe,\" \"anticipate,\" \"expect,\" \"intend,\" \"plan,\" \"project,\" \"will,\" \"projections,\" \"continue,\" \"business outlook,\" \"estimate,\" \"outlook,\" or similar expressions constitute forward-looking statements. Differences in Tribune Publishing's actual results from those described in these forward-looking statements may result from actions taken by Tribune Publishing as well as from risks and uncertainties beyond Tribune Publishing's control. These risks and uncertainties include competition and other economic conditions including fragmentation of the media landscape and competition from other media alternatives; changes in advertising demand, circulation levels and audience shares; the Company's ability to develop and grow its online businesses; the Company's reliance on revenue from printing and distributing third-party publications; changes in newsprint prices; macroeconomic trends and conditions; the Company's reliance on third-party suppliers for various services; the Company's ability to adapt to technological changes; adverse results from litigation, governmental investigations or tax-related proceedings or audits; the Company's ability to realize benefits or synergies from acquisitions or divestitures or to operate its businesses effectively following acquisitions or divestitures; execution and integration of management changes; the Company's ability to attract and retain employees; the Company's success in implementing expense mitigation initiatives, the Company's ability to satisfy pension and other postretirement employee benefit obligations; changes in accounting standards; the effect of labor strikes, lockouts and labor negotiations; regulatory and judicial rulings; the Company's ability to satisfy future capital and liquidity requirements; the Company's ability to access the credit and capital markets at the times and in the amounts needed and on acceptable terms, and other events beyond the Company's control that may result in unexpected adverse operating results. The Company's actual results could also be impacted by the other risks detailed from time to time in its publicly filed documents, including in Item 1A (Risk Factors) of its most recent Annual Report on Form 10-K and Quarterly Report on Form 10-Q. The Company undertakes no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by law. \n\nUse of Non-GAAP Financial Measures\n\nTo provide investors with additional information regarding Tribune Publishing's financial guidance, this press release includes references to Adjusted EBITDA. This is not a measure presented in accordance with generally accepted accounting principles in the United States (US GAAP) and Tribune Publishing's use of the term Adjusted EBITDA may vary from that of others in Tribune Publishing's industry. Adjusted EBITDA should not be considered as an alternative to net income (loss), income from operations, revenues or any other performance measures derived in accordance with US GAAP as a measure of operating performance or liquidity. \n\nAdjusted EBITDA is defined as net income before income taxes, interest income, interest expense, depreciation and amortization, income and losses from equity investments, corporate management fee from Tribune Media Company (formerly Tribune Company), pension credits, stock-based compensation, certain unusual and non-recurring items (including spin-related costs) and reorganization items. Tribune Publishing's management uses Adjusted EBITDA (a) as a measure of operating performance; (b) for planning and forecasting in future periods; and (c) in communications with Tribune Publishing's Board of Directors concerning the company's financial performance. Management believes the presentation of Adjusted EBITDA enhances investors' overall understanding of the financial performance of the company's business as a stand-alone company. In addition, Adjusted EBITDA, or a similarly calculated measure, is used as the basis for certain financial maintenance covenants that Tribune Publishing is subject to in connection with certain credit facilities. Since not all companies use identical calculations, Tribune Publishing's presentation of Adjusted EBITDA may not be comparable to other similarly titled measures of other companies and should not be used by investors as a substitute or alternative to net income or any measure of financial performance calculated and presented in accordance with GAAP. Instead, management believes Adjusted EBITDA should be used to supplement Tribune Publishing's financial measures derived in accordance with GAAP to provide a more complete understanding of the trends affecting the business. \n\nAlthough Adjusted EBITDA is frequently used by investors and securities analysts in their evaluations of companies, Adjusted EBITDA has limitations as an analytical tool, and investors should not consider it in isolation or as a substitute for, or more meaningful than, amounts determined in accordance with GAAP. Some of the limitations to using non-GAAP measures as an analytical tool are: they do not reflect Tribune Publishing's interest income and expense, or the requirements necessary to service interest or principal payments on Tribune Publishing's debt; they do not reflect future requirements for capital expenditures or contractual commitments; and although depreciation and amortization charges are non-cash charges, the assets being depreciated and amortized will often have to be replaced in the future, and non-GAAP measures do not reflect any cash requirements for such replacements. \n\n(TPUB-F) View source version on businesswire.com: \n\nSource: Tribune Publishing Company", "source": "Nasdaq"}