{"published": "2015-09-09T02:00:00Z", "media-type": "News", "title": "Pope approves 'fast-track' marriage annulments", "id": "3f3205df-315c-4e2c-b0ba-20eac2df6095", "content": "Pope Francis has radically reformed the Catholic Church's process for annulling marriages, allowing for fast-track decisions and removing automatic appeals in a bid to speed up and simplify the procedure. \n\nFrancis issued a new law regulating how bishops around the world determine when a fundamental flaw has made a marriage invalid. \n\nCatholics must get this church annulment if they want to remarry in the church. \n\nBut the process has long been criticised for being complicated, costly and out of reach for many Catholics, especially in poor countries where dioceses don't have marriage tribunals. \n\nReasons for granting annulments vary, including that the couple never intended their marriage to last or that one of the spouses didn't want children. \n\nAdulterers \n\nWithout the annulment, divorced Catholics who remarry outside the church are considered to be adulterers living in sin and are forbidden from receiving Communion - a dilemma at the core of a current debate roiling the church that will come to the fore next month at a meeting of the world's bishops. \n\nFrancis's new document will likely add to the debate, given that as recently as a three years ago, conservatives in the Vatican were pondering a tightening of annulment norms. \n\nFrancis's biggest reform involves a new fast-track procedure, handled by a bishop, that can be used when both spouses request an annulment or don't oppose it. It can also be used when other proof makes a more drawn-out investigation unnecessary. \n\nIt calls for the process to be completed within 45 days. \n\nAnother reform is the removal of the appeal that automatically took place after the first decision was made, even if none of the parties wanted it. \n\nAn appeal is still possible, but one of the parties must request it - a simplification that was used in the US for many years. \n\nThe reform also allows the local bishop, in places where the normally required three-judge tribunal isn't available, to be the judge himself or to delegate the handling of the cases to a priest-judge with two assistants. \n\nThat measure is aimed at providing Catholic couples with recourse to annulments in poorer parts of the world.", "source": "Evening Herald"}