{"published": "2015-09-20T23:40:00Z", "media-type": "News", "title": "Colombian peace talks must not fail, Pope says during Cuba trip", "id": "7a405783-cdc6-4083-ad5d-d23144e89da3", "content": "Pope Francis prayed for the ongoing negotiations between FARC rebels and the Colombian government happening in Cuba right now saying that “another failure” is not an option.     “Please, we do not have the right to allow ourselves yet another failure on this path of peace and reconciliation,” he said following the Sept. 20 Sunday Angelus in Revolution Square.     Since 1964, more than 200,000 people have been killed in Colombia’s civil war. For the past three years, Revolutionary Armed Forces of Colombia (FARC) rebels and the Colombian government have been engaged in peace talks in Cuba, but an outcome has not yet been reached.     “At this time I feel bound to direct my thoughts to the beloved land of Colombia,” he said, “conscious of the crucial importance of the present moment when, with renewed effort and inspired by hope, its sons and daughters are seeking to build a peaceful society.”     Although much innocent blood has been shed in the decades of armed conflict, he hopes that their sacrifice, united with Christ’s, may “sustain all the efforts being made, including those on this beautiful island, to achieve definitive reconciliation.”     “Thus may the long night of pain and violence can, with the support of all Colombians, become an unending day of concord, justice, fraternity and love, in respect for institutions and for national and international law, so that there may be lasting peace,” the Holy Father said.     Turning his attention to the example of the Blessed Mother, the pontiff urged those present to “place all our concerns and hopes before the heart of Christ.”     “We pray to her in a special way for those who have lost hope and find no reasons to keep fighting, and for those who suffer from injustice, abandonment and loneliness,” he said.     Like Mary, we must learn to “keep our hearts awake and attentive to the needs of others” and the “little details of life” so that no one will lack “the joy which Jesus brings us.”     Pope Francis then prayed for all those experiencing difficulty, especially the Cubans whom he called the “sons and daughters” of Mary.", "source": "Angelus The Tidings Online"}