{"published": "2015-09-25T13:48:40Z", "media-type": "News", "title": "How to Treat Hypothyroidism Naturally with Flaxseed", "id": "f7c8fb2a-96bc-456b-889a-5ded386accbb", "content": "The other day my dad asked if I could recommend a food that would help relieve a variety of symptoms he had recently been experiencing. He had high cholesterol, anxiety, depression, carpal tunnel syndrome, and headaches.\nHe also had a terrible memory, began experiencing hair loss, and had trouble sleeping at night, despite being exhausted. Some of his other symptoms included bruising fairly easily, dry skin and hair, sensitivity to heat and cold, tingling in his feet and hands, and dry… \r \nThe other day my dad asked if I could recommend a food that would help relieve a variety of symptoms he had recently been experiencing. He had high cholesterol, anxiety, depression, carpal tunnel syndrome, and headaches. \n\nHe also had a terrible memory, began experiencing hair loss, and had trouble sleeping at night, despite being exhausted. Some of his other symptoms included bruising fairly easily, dry skin and hair, sensitivity to heat and cold, tingling in his feet and hands, and dry eyes with blurry vision. \n\nI thought about it for a minute. It sounded like he had several signs that can indicate an underactive thyroid—also called hypothyroidism. A comprehensive blood thyroid panel and saliva test would both confirm that low thyroid function was the issue. \n\nI recommended that my dad start eating flaxseed and flaxseed oil every day. It is also known by the plant name Linum usitatissimum and is sometimes called linseed. Nutritionally, you can’t go wrong with flaxseed. These brown or yellow seeds are loaded with fiber, protein, manganese, magnesium, phosphorus, selenium, folate, and vitamin B1 and B6. \n\nFlaxseed is also by far one of the best plant-based sources of essential fatty acids you can get. These many nutritional qualities make flaxseed perhaps one of the first cultivated superfoods. Flaxseed has been cultivated for thousands of years, including in places such as India, China, and Greece. The ancient Egyptians also considered flaxseed a sign of purity. \n\nWhat Is Hypothyroidism? \n\nThe health benefits of flaxseeds are seemingly endless. They are among the best natural remedies for hypothyroidism. \n\nHypothyroidism is a condition that occurs when thyroid hormone levels are low and thyroid stimulating hormone (TSH) levels are high in the blood. The normal range for TSH is considered between 0.35 and 5.00 milli-international units per liter (mlU/L). Based on TSH blood test results, it is estimated that five percent to 10% of the adult population have hypothyroidism. Among seniors, more than 20% have the condition. It is also eight times more prevalent in women. \n\nDr. Broda Barnes wrote a hypothyroidism book in the 1970s called Hypothyroidism: The Unsuspected Illness. In his book, Dr. Barnes estimated that 40% of adults would be diagnosed with hypothyroidism when symptoms and basal body temperature are considered. \n\nWhat is basal body temperature? \n\nLowering of basal body temperature is another extremely important symptom of hypothyroidism. To take your basal body temperature is easy and it can be done in the comfort of your home. It is best to perform the procedure after a good night’s rest, since it should be taken without food, excitement, or exercise for 12 hours. \n\nTo test your basal body temperature, place the thermometer firmly under the armpit for 10 minutes while lying still for the entire time period. Normal readings are considered between 97.8 to 98.2 degrees Fahrenheit. Hypothyroidism is indicated when readings are below 97.8 degrees Fahrenheit. \n\nPrecautions to Take While Using Flaxseed for Hypothyroidism \n\nFlaxseeds are considered safe on the thyroid; however, they may lead to digestion-related side effects such as nausea, constipation, abdominal pain, excessive gas, bloating, and diarrhea. It is also important to note that flaxseed contains glycosides known as cyanogen. They are safe in small amounts, but consumption of over two tablespoons may prevent the thyroid from obtaining the proper iodine intake. \n\nLuckily, you can inactivate the cyanogen in flaxseed by cooking with it. Flaxseed also contains goitrogens that are thought to suppress thyroid function, but many individuals with hypothyroidism can tolerate foods containing it without harm. \n\nHow to Implement Flaxseed in Your Diet \n\nHow do you implement flaxseed in your diet? It can be an easy addition to your green smoothie or yogurt. To prepare your flaxseed, it is best to first grind them with a coffee grinder. Freshly ground flaxseed is actually better digested than whole flaxseed. It also retains more nutrition and contains greater amounts of omega-3 and conjugated linoleic acid (CLA). Pre-ground flaxseed can become rancid from longer exposure to heat and oxygen. (It tastes rancid as well). \n\nFlaxseed oil is a great addition to salad dressings. A healthy salad dressing you can make yourself would include two parts extra virgin olive oil, one part flaxseed oil, and one part sesame oil or sunflower oil. Half of the dressing would also conta…", "source": "MyInforms"}