{"published": "2015-09-16T16:48:23Z", "media-type": "News", "title": "Patterson out as Texas' athletic director", "id": "03fd5f6f-12d8-47bf-b24b-58bd2b2989ba", "content": "The University of Texas accepted the resignation of athletic director Steve Patterson on Tuesday, calling the parting a mutual decision. \n \nBarring a buyout agreement, Patterson is owed the $5.6 million remaining on his contract. \n\nSchool president Gregory Fenves led a conference call with the university board of regents on Monday night, when it was determined Patterson would be let go. Patterson was hired by Texas in November 2013. \n\nFenves said in a statement, \"Steve brought important ideas and changes to our athletics program, and I appreciate the good things he accomplished in his time at UT. I wish him the best in his future endeavors. ... \n\n\"Athletics is vitally important to the Longhorn nation, shining a bright light on the university. I look forward to continued success in our programs and seeing you all at games this year, supporting our teams and our student-athletes.\" \n\nThe university released a statement from Perrin that said, \"I'm honored to be asked by President Fenves to serve as interim men's athletic director. I will focus on helping the university find the best fit in a future director while listening to all the needs of the Longhorn family. As a former UT student-athlete, long-time fan and volunteer with Texas Athletics, I've worked closely with faculty, students, alumni, coaches and administrators. I will continue to do so in an effort to bring the Longhorn nation together.\" \n\nPatterson said in a statement, \"As a Longhorn myself, a graduate of the University and its law school, I want nothing but the best for my alma mater, and I wish President Fenves and everyone at UT-Austin well as we continue the journey. I leave behind a motivated and dedicated team committed to the world-class standards that all Longhorns expect.\" \n\nThe Austin American Statesman reported that several donors have told Texas officials that they would no longer donate money to Longhorns athletics as long as Patterson was the athletic director. \n\nHouston attorney Michael Perrin was immediately installed as the interim athletic director on Tuesday. He will make $750,000 in a contract that runs through August 2016. \n\nFenves was promoted from provost to university president in June. Reports regarding complaints about Patterson began to surface not long after. \n\nAmong those complaints against Patterson were poor communication with donors, department employees and coaches. Other complaints involved the financing of a new tennis facility and the lack of transparency in the method used to deal with football season-ticket holders. \n\nAmong his major decisions were parting with longtime football coach Mack Brown and basketball coach Rick Barnes, who was in Austin from 1998-2015. \n\nThe coaches of major sports at Texas report to associate athletic director Arthur Johnson, who relays concerns or problems to Patterson. \n\nAnother issue according to HornsDigest.com was that Patterson had not talked with his coaches regarding his decision on a new shoe contract. Nike is in the final month of a period of exclusive negotiation with Texas, and starting in October, Nike and Under Armour could engage in a bidding war to be the school's shoe and apparel sponsor. \n\nPatterson was in the third year of a guaranteed five-year deal paying him roughly $1.4 million annually. He was the athletic director at Arizona State before being hired by Texas.", "source": "KION 46"}