{"published": "2015-09-21T18:20:57Z", "media-type": "News", "title": "Stanfords Kevin Hogan moves to top of Pac-12 QB power rankings", "id": "496b92dd-e86d-4e07-86f3-158262cdfd37", "content": "It's time to look at the top Pac-12 quarterback performers after the third week of play. We'll revisit this ranking each Monday. Remember that we're weighing the past weekend's performance more heavily than an overall season track record, so expect some variation here every week. \n\n1. Kevin Hogan , Stanford: It's important to consider the emotional magnitude of what happened for the winning quarterback at the Coliseum Saturday -- this was the best performance of Hogan's career, and it came less than a year after the death of his father. Hogan's joy was palpable after a sterling 18-for-23, 279-yard effort that singed USC's defense. \nKevin Hogan efficiently picked apart USC, delivering perfect throws in and out of the pocket.  Jayne Kamin-Oncea/USA TODAY Sports \nA second-half hit bent Hogan's leg to an ugly angle, but he remained in the game -- hobbled -- and continued to move the chains with devastating efficiency. Stanford converted 67 percent of its third downs, a credit to Hogan's field mastery that utilized both tight ends and speed weapons on the perimeter. Perhaps most significantly, Hogan again proved that he can be an effective college quarterback when the game plan puts him in motion: He rushed for a critical first down late and delivered perfect throws while moving out of the pocket. \n\n2. Jared Goff , Cal: He's been on top of these rankings throughout the first two weeks of the season. Goff almost stayed at No. 1 in this edition, but Hogan's gutsy turnaround performance was simply too strong to withstand. Still, Cal's offense continued to impress, this time in a wild 45-44 win at Texas. Goff's passing line was solid: 27-for-37, 268 yards, two touchdowns. The film is even more impressive, as it features him repeatedly avoiding the Longhorns' pass rush to throw lethal darts downfield. \n\nGoff also did an excellent job managing the game at the line of scrimmage. He helped put Cal in position to rack up 280 rushing yards even without top back Daniel Lasco . \n\n3. Anu Solomon , Arizona: The Wildcats obviously were leagues ahead of FCS opponent Northern Arizona talent-wise, but their offense still gets a tip of the cap for breaking school records in points (77), total yardage (792) and rushing yardage (499). Solomon was the captain of the effort, though he didn't play the entire game. He finished 25-of-35 for 285 yards, four touchdown passes and one touchdown run. \n\nIt's time for conference play so we can finally get a firm gauge on what the Wildcats -- and the now-sophomore Solomon -- will bring to the table this season. Good thing UCLA visits Tucson next weekend. \n\n4. Jake Browning , Washington: The true freshman has registered consecutive impressive games. Browning threw for 368 yards and three touchdowns on 11.9 yards per attempt in the Huskies' 31-17 win over Utah State. The details were impressive here too: He placed several excellent throws downfield, including one from the near-side hash mark to the far sideline -- 30 yards downfield. \n\nBrowning also discovered Dwayne Washington to be a much-needed explosive option in the passing game. Five passes and 131 yards of production went his way. Browning let out a roar of emotion after delivering a pretty touchdown pass to Drew Sample while rolling right in the third quarter. \n\n5. Luke Falk , Washington State: Should USC's Cody Kessler get the final spot? Possibly -- he was efficient to the tune of 272 yards and three touchdowns against Stanford. But his Trojans lost, so we'll give this last nod to Falk instead. He finished 37-of-45 for 303 yards in the Cougars' 31-14 win over Wyoming. It was Washington State's first home win in more than a year, and their first victory over an FBS opponent at Martin Stadium since 2013. \n\nFalk threw an interception, but he overcame that by tossing for a pair of scores and running for another. In the end, this was a solid follow-up performance to the Cougars' massive comeback win at Rutgers a week prior. A bye week is next for Falk, followed by a trip to Cal. Quarterback production galore will be expected in that game. Just remember last year's record-breaking 60-59 barnburner.", "source": "ESPN.com"}