{"published": "2015-09-05T15:40:10Z", "media-type": "Blog", "title": "Nourishment for the Hungry Soul", "id": "4b24dd7f-3fef-49ec-bfa7-ad27b520c25f", "content": "Greencrest Manor in Battle Creek Linda and I are just outside Battle Creek at Greencrest Manor for the wedding of Kim Cooke and Josh Thomas. This is such a beautiful bed-and-breakfast place (Grant Hill was married here). \nI woke up this morning and walked around taking photos. I also brought my copy of Thomas Merton's Thoughts in Solitude. I read it long ago, in 1988. I'm doing a slow-cook re-read. Merton is a discerner, a deep-dweller who lingers in life tasting and savoring it. \nMerton understood spiritual realities and their importance. He writes:\n\"There is no greater disaster in the spiritual life than to be immersed in unreality, for life is maintained and nourished in us by our vital relationship with realities outside and above us. When our life feeds on unreality, it must starve. It must therefore die.\" (p. 17)\nI see America as largely a nation of spiritually hungry, starving people who have mistaken material things for spiritual food. Acquisition of and investment in unrealities only leave people empty. We are the perpetually dissatisfied. \nFor Merton the answer is to begin \"by renouncing the illusory reality which created things acquire when they are seen only in their relation to our own selfish interests.\" (Ib.)\nTomorrow morning at Redeemer I'm preaching out of Revelation 11:15-19. Verse 15 reads:\n15 The seventh angel sounded his trumpet,  and there were loud voices in heaven, which said: “The kingdom of the world has become     the kingdom of our Lord and of his Messiah,     and he will reign for ever and ever.” \"The heavenly voices shout out the turning point that the entire Bible has waited for - the arrival of the kingdom! Their song celebrates the reversal of the tragic earthly situation during the age of sin... Now that dichotomy [between the kingdom of earth and the kingdom of God] has ended, and the heavenly kingdom has replaced the earthly as the true reality.\" (Grant Osborne, Revelation)  At this point the true nature of things will be clearly seen. Merton writes: \"The \"unreality\" of material things is only relative to the greater reality of spiritual things.\" (Ib.) In other words, material things are created things; therefore their essence is discerned in and through their creators (either God, or persons). Think of the word 'inspiration' here; viz., 'spirit'... 'in'.  Reality is fundamentally spiritual. This morning my soul feeds on this, and I am nourished.", "source": "John Piippo"}