{"published": "2015-09-25T17:55:01Z", "media-type": "News", "title": "How is the Speaker of the House picked?", "id": "78a7c3d2-ab13-4551-a80d-fd16d63259fa", "content": "John Boehner’s plan to resign from Congress at the end of October leaves a pretty big seat open on America’s totem pole of elected officials. \n\nThe Speaker of the House is second in line after the vice president in the presidential line of succession. \n\nJames K. Polk is the only Speaker of the House to serve as president. But how does someone become the Speaker of the House and who makes the decision? \n\nWho can be Speaker of the House? \n \nLegally, the Speaker of the House does not need to be a member of Congress . \n\nBut in practice, every Speaker of the House has been a member of Congress. \n\nHow is the Speaker of the House chosen? \n\nEach major party conference or caucus nominates a candidate, and the nomination process is typically where the decision is made. \n\nHouse members can vote for whomever they like, but they typically vote for the person nominated by the party conference or caucus. Historically, the majority party normally holds the Speaker of the House spot. \n\nThe candidate must get the absolute majority of the votes cast, though vacancies, absentee members and/or House members who vote “present” do not count toward the votes cast, so a candidate does not need a full majority of the full House. \n\nIf no one emerges with an absolute majority, then the votes are recast. \n\nHow long does the Speaker of the House serve? \n\nThe Speaker of the House is elected to a two-year term, but there is no term limit. \n\nWho could follow Boehner as Speaker? \n\nBoehner's surprise announcement means there is no public succession plan. Kevin McCarthy (R-Calif.) is the favorite to replace Boehner. As House Majority Leader, McCarthy is the second-ranking House Republican. \n\nIn the press conference to announce his resignation, Boehner said McCarthy “would make an excellent Speaker.” ", "source": "KSHB"}