{"published": "2015-09-23T06:45:14Z", "media-type": "Blog", "title": "Draft Duel: Where Winning Is Fantasy", "id": "49011354-37d5-4154-8b4c-f96e7939fb4e", "content": "Draft Duel: Where Winning Is Fantasy By Funny Or Die, more » Sign up for Draft Duel today, and your life could be ruined by tomorrow! Published September 22, 2015 2.6k views More Info » Full Credits Funny Or Die Uploader Carlos Santos Actor Michael Cassady Actor Will Hines Actor will_mclaughlin Actor Travis Helwig Writer/Director Aaron Ulrich Director of Photography Matt Sweeney Gaffer Shawn James Visual Effects Additional Credits Additional Credits: Starring - Carlos Santos, Michael Cassady, Will Hines and Will McLaughlin\nWritten and Directed by Travis Helwig\nDirector of Photography - Aaron Ulrich\nGaffer - Matt Sweeney\nVisual Effects - Shawn James\nEditor - Pascal De Maria\nProducer - Sean Boyle Stats & Data 196 Funny Votes 122 Die Votes 2,610 Views Published September 22, 2015 Categories: Parody Keywords: draft duel fan duel parody draft kings parody fantasy football gambling addiction Transcript NARRATOR: Draft Duel's one week leagues for real money are the hottest thing in fantasy football. Will McLaughlin: On Draft Duel I won over $62,000 dollars, is what I would've been saying if I had made some slightly different choice in players. NARRATOR: Draft Duel is easy. Just choose a league, pick a team, and throw your money into a cyber garbage bin of hope. Michael Cassady: Thanks to a loop whole in the Unlawful Internet Gaming Enforcement Act, this isn't gambling. It's just wagering money on sports. Carlos Santos: There's dollar games, $2 dollar games. Will Hines: I spent $150 dollars on draft duel which I was going to use to take out my wife, but I didn't win. Then my wife left me, which means I have more to spend on next week. I got my friends at work to join, and I made 6 grand in one week, mostly off of them. NARRATOR: Leagues last one week so you can choose when you play. You can play during the day. You can play in the middle of the night when your wife screams, \"Seriously, Derek, get out of my life!\" NARRATOR: Over one million people have already won money on Draft Duel, and you get your money right away so you can bet it again, and lose it all the following week. Each player has a value. You just pick your team, and you make your bet. Week one, you may win 20 bucks. Week 2, doesn't go so hot. Week 3, you double down, and it also doesn't go so hot. I won $2000 dollars from a pawn shop where I sold my wedding ring. Jocelyn just needs to trust me more. I mean, that's what a wife does, ex-wife. Ex, that's the first time I said that out loud. My God. Does anybody want to buy my car? Week 5, you've thrown your phone into the river, because you're tired of your friends calling up and asking for their money back. NARRATOR: And with Draft Duels money back guarantee, you have nothing to lose. I have nothing left to lose. I have nothing left to lose. I have, nothing. NARRATOR: So head over to DraftDuel.com for a free $200 dollars. Type in the promo code, \"ThisIsAGoodIdea69\". Up Next: NFL Fantasy Football Commissioners Resign AUTOPLAY Up Next In: 10 NFL Fantasy Football Commissioners Resign You're Welcome: Fantasy Football Fever Lindsay Lohan's eHarmony Profile Funny Or Die Beats Weird Al at Twitter Follow Facebook Twitter Tumblr Instagram Browse Related Comments Videos Recommended by FOD Staff Pics & Words Recommended by FOD Staff 3100+ more View All  ▶ Funny Or Die 20+ more View All  ▶ Will Hines 40+ more View All  ▶ Travis Helwig 150+ more View All  ▶ Aaron Ulrich 200+ more View All  ▶ Matt Sweeney 20+ more View All  ▶ Shawn James Advertisement Funny Or Die Advertisement Featured Today More", "source": "Funny Or Die | Funny Videos, Funny Video Clips, Funny Pics"}