{"published": "2015-09-17T20:34:34Z", "media-type": "Blog", "title": "Interbike 2015: Wethepeople, Eclat, Salt Plus, Fuse Protection", "id": "28229ff9-09c0-4522-a60b-8f072676ce36", "content": "Interbike 2015: Wethepeople, Eclat, Salt Plus, Fuse Protection\nPosted: September 17th, 2015\n   ⤹ Please share!\nNext up, we made our way over to the Wemakethings booth to visit our good friends from Germany and to get a full look at what they have cooking for Wethepeople, Eclat, Salt Plus and Fuse Protection (We’ll have a separate post for Almond Footwear next)! As always, they always have a TON of new products to check out, so let’s see all of the BMX goodness!\nThe new Alex Kennedy signature AK Guard Sprocket features a nylon removable guard that can be rotated and changed out. Definitely a unique design and it makes it easier and more affordable than replacing your entire sprocket after a lot of grinding.\nThe new Bruno Hoffman grip that is in the works. It features a mushroom style pattern but the ribs are offset thickness to give it a softer feel. It also features the Cologne skyline which is a nice touch.\nHere’s a sample of a new tire they’re working on. I want to say this is a Bruno Hoffmann tire, but I might be wrong. Took in a lot of info for their new line.\nThe new Cortex freecoaster is a new addition to the Eclat line. It features a clutch system but it’s different than the KHE design. Expect more details closer to its release.\nHub guards to fit all of the Eclat and Wethepeople hubs.\nThe Blind freecoaster got a little bit of an update after having issues with the spring they originally used. Now they have individual springs on each pawl to resolve the problem.\nEclat and Wethepeople have a number of new stems, most of which utilize these small cuts to give the bars a little more to grab on to.\nThe latest version of Sean Burns’ signature stem.\nCan’t go wrong with a metal pedal. They have made the ends stick out a little further to protect the outside end of the pedal for this year.\nThat new camo color looks good.\nThe Alex Kennedy pedal which eliminates bearings and uses an over sized spindle should be out soon.\nAnother look at the AK sprocket.\nThe Universal guard that fits over the outside of the drop out.\nNew black and anodized silver color looks so good.\nThe Brock Olive signature bars from Eclat are big and strong. They use straight gauge tubing to keep it strong throughout.\nNew seat color options.\nThe new tan peg color for the Eclat plastic pegs.\nNew purple colorway on their new rim.\nHere’s a look at two of the new rims that Eclat are working on. Not the best photo, but we’ll be hearing more soon.\nRed, black and polished will be the main focus colors, but there are a few others that will be available as well.\nGo through a lot of wax? This new block of wax comes with a few blocks all connected and wrapped up tight like a burrito. Break a piece off, drop it in the session bag and go get your grind on.\nEclat Pulse hubs in red.\nHere’s a look at the latest version of the Grippin’ tire to give you street guys plenty of grab.\nThe Feelin’ tire has been gaining popularity so they have made it a little bigger to give you even more grip.\nHere’s a prototype Wethepeople 4-piece bar that utilizes the new 25.4mm diameter tubing at the clamping area that tapers to a regular size at the grips.\nTripod and Pivotal seat options from Wethepeople.\nHere’s a look at a new 2-piece crank that Wethepeople are working on. This is a true 2-piece because the arm is welded to the spindle eliminating the extra material needed when you have a 3 or 2.5-piece design. Those pedal and spindle gussets look good.\nEd Zunda signature 2.5 piece cranks in the works. You know if Ed’s name is on it, it will be sturdy!\nWethepeople have a new top load stem that will be available with 3 different rises and 3 different color options. So, yeah, 12 options total to choose from. They also utilize the ridges to keep your bars from slipping.\nClean new sprocket. Nice and simple.\nThe reptile grip.\nThe Helix freecoaster has a slimmer shell and a new hub guard to keep it from breaking.\nThey have made it so these hub guards come with all the different cones for all their different hubs to ensure compatibility. Pretty rad.\nThey have been working on an updated version of their cassette with a 15mm female axle and bearings to go with the Q-Lite driver.\nTripod and Pivotal post.\nThe Mike Curley signature Switch fork looking dialed with the CNC machined drop outs that are inserted into the legs and welded, tapered legs and the boxed steer tube / leg junction. Clean and sturdy.\nThe new Dillon Lloyd signature Buck frame.\nEd Zunda’s new signature frame!\nFresh paint on Dan Foley’s Cadence frame.\nPatron and Scorpio frame.\n18″ Envy frame and fork for the young guns.\nThey have beefed up the Utopia frame a bit to be more for the flatland / street guys versus just flatland. That green color looks amazing too.\nDillon Lloyd Buck bars have 25.4mm clamping area and the traditional size. Dillon runs the bigger version for those of you wondering.\nSterling four-piece bars. Straight gauge tubing, 25.4mm clamping area and wider radius bends.\nDigging that new tan colorway for the Patron frame. The Patron fork will match that color as well.\nPatron stems.\nNew barends made from stainless steel. Looks good!\nIf you notice… the 30 tooth is coming back!\nWethepeople have a HUGE range of completes from the 12″ bikes all the way up to the top of the line 20″ as expected and these bikes are DIALED.\nFuse Protection helmet and pads. Those shin pads with the longer top to partially cover the knee are rad.\nThe new Delta bike bag from Fuse. Learn more about that here — Fuse Protection – Delta Bike Bag\nWrist wraps!\nFloor and hand pumps to keep those tires filled.\nNew Salt Plus tire. Similar to the Eclat Fireball, but more affordable.\nSalt Plus freecoaster. Similar design as the new Eclat freecoaster, but with a regular axle, bolts, etc. to help keep the costs down. This is available as a complete wheel as well.\nDigging that black and blue swirl color on the Salt Plus stem.\nNew mushroom style grip.\nSalt Plus Chain Breaker!\nSalt Plus 4-piece bars.\nRegular and guard sprocket. That black and blue swirl to match the stem.\nWoof! That was A LOT to cover! If you have any questions, let us know in the comments below. That wraps up Wethepeople, Eclat, Salt Plus and Fuse Protection!\nCheck out more from Interbike 2015 – Interbike 2015\n   ⤹ Please share!\nNEXT PAGE →\n⤺ Random Page ⤻\nRelated\nPrevious\n⬆ BACK TO TOP OF PAGE ⬆\nTags: Eclat BMX, Fuse Protection, Interbike 2015, Must See, Salt Plus, Wethepeople BMX\nPosted by Kurt with No Comments »", "source": "bmxunion.com"}