{"published": "2015-09-10T08:37:09Z", "media-type": "Blog", "title": "Cameroon to Pay Soldiers Protesting for Payment", "id": "91ed3889-7c0e-4a14-a674-0b7029fec60b", "content": "Africa Cameroon to Pay Soldiers Protesting for Payment September 10, 2015 Moki Edwin Kindzeka FILE - Cameroon President Paul Biya speaks at the presidential palace in Yaounde. Share Share on Facebook Share on Twitter Share on Google+ Email to a Friend See comments Cameroon's government says it has disbursed $12 million to calm angry soldiers protesting the non-payment of their dues for service as international peacekeepers in the Central African Republic. At least 200 soldiers blocked traffic on some streets in the capital, Yaounde, Wednesday before moving to the National Assembly and the Defense Headquarters. They demanded that all money owed them for their service in the C.A.R. be paid. Cameroon’s minister of communication, Issa Tchiroma, said Cameroon had paid all the salaries of the soldiers and what is remaining are allowances the African Union has yet to pay. \"The minister delegate at the presidency in charge of defense went to the headquarters of the African Union at Addis Ababa to clarify this very serious issue with the Peace and Security commission of the African Union. Assurances were then given that all measures were taken to finalize the procedure for the full payment of these arrears,\" said Tchiroma. In the meantime, Tchiroma said, Cameroon President Paul Biya has ordered that $12 million be withdrawn from the public treasury to pay the soldiers’ dues. Tchiroma asked the soldiers to return to their barracks. Cameroon has deployed 1300 troops to the C.A.R. since 2014 as part of a U.N. peacekeeping mission to calm sectarian violence that began in 2013. Related Cameroon Cleans Payroll of 'Ghost Workers' Cameroon Battles Terror Threats as School Year Begins You might like also Middle East Health Professionals Using Social Media in Europe’s 'Slow-Moving Disaster' USA Battling Youth Suicide on Pine Ridge Indian Reservation USA House Republicans Shake Up Plans on Iran Deal Vote", "source": "Voice of America"}