{"published": "2015-09-17T05:37:51Z", "media-type": "News", "title": "INNATE PHARMA : 1ST HALF OF 2015: LANDMARK AGREEMENT WITH ASTRAZENECA AND STRONG FINANCIAL POSITION", "id": "f9be9b41-c849-485b-9137-8f08e20a8f62", "content": "Landmark co-development and commercialization agreement with AstraZeneca for IPH2201 in immuno-oncology   Cash and cash equivalents amounting to €279 million * following initial payment of $250 million from AstraZeneca   Programs progressing as planned; first clinical data on lirilumab expected in 2016   \nMARSEILLE, France, Sept. 17, 2015 (GLOBE NEWSWIRE) -- Innate Pharma SA (the \"Company\" - Euronext Paris: FR0010331421 - IPH) reports today its consolidated financial results for the first half of 2015. \n\nHervé Brailly, Chief Executive Officer of Innate Pharma, commented: \"This first half of 2015 marked a major milestone in Innate Pharma's corporate development with the signature of a landmark co-development and commercialization agreement in April with AstraZeneca to broaden and accelerate the development of IPH2201. \n\n This agreement is a major step towards our corporate goal of further maturing the Company and developing capabilities in late stage development and potential commercial stage by keeping some co-development and co-promotion rights. \n\n In the second half of 2015, additional Phase II clinical trials for IPH2201 will be opened and IPH4102 will start a multi-centric Phase I trial, becoming our third first-in-class, clinical-stage asset. With our increased financial flexibility, we are intensifying our efforts in R&D to enrich our pipeline of first-in-class proprietary antibodies. \n\n As important new clinical data on lirilumab is generated, Innate Pharma is on track to leverage its unique positioning in the very promising area of immuno-oncology.\" \n\n A conference call will be held today at 2:30pm (CET)  \n\nDial in numbers: France: + 01 70 77 09 37 / International: +1 855 402 77 61 \n\nA replay will be available on Innate Pharma's website after the conference call. \n\n Financial highlights of the first-half of 2015 : \n\nThe key elements are as follows: \nCash, cash equivalents and current financial instruments amounting to €279m (million euros) at June 30, 2015 (€69m at December 31, 2014), following the receipt on June 30, 2015 of $250m (€223m) relating to the co-development and commercialization agreement signed on April 24, 2015 with AstraZeneca. At the same date, the financial liabilities amounted to €4.0m (€4.2m at December 31, 2014).   Revenue and other income amounting to €6.4m (€4.1m for the first half of 2014). This amounts results from licensing revenue (€3.1m) and from research tax credit (€3.3m). Revenue related to the licensing agreements mainly results from spreading the initial payment received by Innate Pharma in the context of the agreement signed in April 2015 with AstraZeneca over the costs of the clinical trials the Company is in charge of.   Operating expenses amounting to €15.5m (€13.2m for the first half of 2014) of which 82% related to research and development. The increase of these expenses mainly results from the rise of the staff (110 employees on June 30, 2015 to be compared to 90 on June 30, 2014).  As a consequence of the items mentioned previously, the net loss for the first half of 2015 amounts to €7.0m (€9.0m for the first half of 2014).  \nThe table below summarizes the IFRS consolidated financial statements for the six-month period ended June 30, 2015, with a comparison to the same period in 2014: \n    6-month period ended June 30   In thousands of euros (IFRS)   2015   2014           Revenue from collaboration and licensing agreements  3,092  1,027  Government financing for research expenditures  3,344  3,110   Operating revenue   6,436   4,137  Research and development expenses  (12,754)  (10,890)  General and administrative expenses  (2,728)  (2,310)   Operating expenses   (15,482)   (13,200)   Operating income / (loss)   (9,046)   (9,063)  Financial income (expenses), net  2,072  195  Share of profit (loss) of associates and joint ventures  -  (170)   Net income / (loss)   (6,974)   (9,039)  \n Update on R&D portfolio: \n\n Lirilumab (anti-KIR antibody), partnered with Bristol-Myers Squibb:  \nEffiKIR (double-blind placebo-controlled randomized Phase II trial of lirilumab as maintenance treatment in elderly patients with Acute Myeloid Leukemia in first complete remission - study IPH2102-201):  \nIn March 2015, the Data and Safety Monitoring Board (\"DSMB\") completed its fourth assessment of the EffiKIR study and recommended to stop treatment in one arm and continue the trial with the remaining two arms as per protocol. There was no concern with tolerance. The DSMB considered that treatment in the stopped arm could not be superior to placebo. The trial remains blinded. \n\nIn September 2015, the DSMB completed its fifth assessment of the EffiKIR study and recommended continuation of the trial without modification. \n\nThe Company expects that analysis on the primary efficacy endpoint, Leukemia-free survival, will occur in Q2 2016.  \nTwo new Phase II trials started with lirilumab in hematological malignancies in H1 2015:  \nIn the first semester of 2015, two new clinical trials were started by Bristol-Myers Squibb and are being performed by the MD Anderson Cancer Center: a trial testing lirilumab in combination with rituximab in relapsed/ refractory or high-risk untreated Chronic Lymphocytic Leukemia, and a trial of lirilumab in combination with Vidaza in relapsed/refractory Acute Myeloid Leukemia. \nMultiple combinations of lirilumab, including with nivolumab, are currently being explored in four trials in different  hematological malignancies; in addition, the combination of lirilumab and nivolumab is being investigated in various solid tumors.  \n IPH2201 (anti-NKG2A antibody), partnered with AstraZeneca/Medimmune:  \n\nOn April 24, 2015, Innate Pharma and AstraZeneca/Medimmune announced the signature of a co-development and commercialization agreement to accelerate and broaden the development of Innate Pharma's proprietary anti-NKG2A antibody, IPH2201, including in combination with durvalumab (MEDI4736), an anti-PD-L1 immune checkpoint inhibitor developed by MedImmune. \n\nThe financial terms of the agreement include cash payments of up to $1.275 billion to Innate Pharma as well as double digit royalties on sales. The initial payment is $250 million to Innate Pharma. In addition, AstraZeneca will pay to Innate a further $100 million prior to initiation of Phase III development, as well as regulatory and sales-related milestones of up to $925 million. AstraZeneca will book all sales and will pay double-digit royalties on net sales to Innate. The arrangement includes the right for Innate to co-promote in Europe for a 50% profit share in the territory. \n\nThe initial development plan includes: Phase II combination clinical trials with durvalumab in solid tumors; multiple Phase II trials planned by Innate to study IPH2201 both as monotherapy and in combination with currently approved treatments across a range of cancers; and the development of associated biomarkers. \n\nIn June 2015, the agreement received HSR clearance ** , allowing the companies to start working together. On June 30, 2015, Innate Pharma received the initial payment of $250m from AstraZeneca. \n\nAs part of Innate's initial development plan, IPH2201 is currently tested in a Phase II trial as a single agent in a pre-operative setting of squamous cell carcinoma of the oral cavity, a tumor type representative of the larger group of squamous cell cancer of the Head and Neck, performed in Germany. Innate Pharma expects to start three additional trials in 2015, testing IPH2201 as a single agent in Ovarian Cancer, in combination with ibrutinib in Chronic Lymphocytic Leukemia, and in combination with cetuximab in Head and Neck Cancer. The trial testing IPH2201 in Ovarian cancer will be conducted by NCIC Clinical Trials Group in Canada. \n\n IPH4102 (anti-KIR3DL2 antibody):  \n \nIPH4102 is a first-in-class cytotoxic antibody in development by Innate Pharma for the treatment of some types of KIR3DL2-expressing cancers, such as cutaneous T-cell lymphomas and in particular their aggressive forms Sezary Syndrome (\"SS\") and Transformed Mycosis Fungoides (\"TMF\"). \n\nIn 2015, Innate Pharma submitted a first clinical trial application for IPH4102 in Europe and the US for an international Phase I trial involving referral expert centers. First approvals have been received from French, UK and US regulatory authorities and enrolment is expected to start by the end of the year. \n\n Antibody-drug conjugate technology:  \n\nOn April 16, 2015, Innate Pharma announced that it has entered into a collaboration agreement with Sanofi to apply Innate Pharma's site-specific conjugation technology to the development of new Antibody Drug Conjugates. \n\n Corporate update: \n\n Translational research agreement with IPC:  \n\nIn July 2015, Innate Pharma and the Paoli Calmettes Institute (IPC), a private not-for-profit comprehensive cancer center in Marseille, France, signed a collaboration agreement to conduct translational research aimed at identifying specific populations of patients with hematological cancers who may benefit most from treatment with Innate Pharma's novel proprietary antibodies, and at identifying associated biomarkers. \n\n Unsponsored ADR program:  \n\nIn September 2015, Citi launched an unsponsored ADR of Innate Pharma. An ADR (American Depositary Receipt) is a security designed to facilitate the ownership of shares in non-US companies by investors based in the United States. An ADR is quoted in dollars and is traded like any other security. \n\n Innate Pharma ADR: \nSymbol                        INNTY \nCUSIP                         45781k105 \nPlatform                      OTC \n\nThis security gives the right to attend the General Shareholders' Meeting provided that Innate Pharma or Citi are informed of your intention by the relevant deadline. Any questions, and particularly those regarding the management of ADR accounts, should be forwarded directly to Citibank . \n\n Nomination:  \n\nOn April 27, 2015, Véronique Chabernaud was appointed as a new member of the Supervisory Board. Véronique Chabernaud, oncologist and ESSEC graduate, occupied for 20 years both national and international top-ranked positions in the pharmaceutical industry notably at Sanofi-Aventis. \nThe Supervisory Board of Innate Pharma is composed of: \n- Gilles Brisson, Chairman, Independent member; \n- Irina Staatz-Granzer, Vice-Chairman, Independent member; \n- Novo Nordisk A/S, represented by Karsten Munk Knudsen, Non-independent member; \n- Patrick Langlois, Non-independent member; \n- Philippe Pouletty, Independent member; \n- Michael Caligiuri, Independent member; \n- Véronique Chabernaud, Independent member; \n- Bpifrance Investissement, represented by Olivier Martinez, Observer. \n\n About Innate Pharma: \n \nInnate Pharma S.A. is a biopharmaceutical company discovering and developing first-in-class therapeutic antibodies for the treatment of cancer and inflammatory diseases. \n\nIts innovative approach has translated into major alliances with leaders in the biopharmaceutical industry such as Bristol-Myers Squibb, AstraZeneca and Novo Nordisk A/S. \n\nThe Company has two clinical-stage programs in immuno-oncology, a new therapeutic field that is changing cancer treatment by enhancing the capability of the body's own immune cells to recognize and kill cancer cells. Innate Pharma's science also has potential in chronic inflammatory diseases. \n\nListed on Euronext-Paris, Innate Pharma is based in Marseille, France, and had 110 employees as at June 30, 2015. \n\nLearn more about Innate Pharma at www.innate-pharma.com \n\n Practical Information about Innate Pharma shares: \n ISIN code \nTicker code  FR0010331421 \nIPH  \n Disclaimer: \n\nThis press release contains certain forward-looking statements. Although the company believes its expectations are based on reasonable assumptions, these forward-looking statements are subject to numerous risks and uncertainties, which could cause actual results to differ materially from those anticipated. For a discussion of risks and uncertainties which could cause the company's actual results, financial condition, performance or achievements to differ from those contained in the forward-looking statements, please refer to the Risk Factors (\"Facteurs de Risque\") section of the Document de Reference prospectus filed with the AMF, which is available on the AMF website or on Innate Pharma's website. \n\nThis press release and the information contained herein do not constitute an offer to sell or a solicitation of an offer to buy or subscribe to shares in Innate Pharma in any country. \n\n For additional information, please contact: \n Innate Pharma   ATCG Press  Laure-Hélène Mercier \nDirector, Investor Relations  Marie Puvieux \nMob.: +33 (0)6 10 54 36 72  Tel.: +33 (0)4 30 30 30 87      investors@innate-pharma.com   presse@atcg-partners.com  \nInterim Financial Statements and Notes \n\nConsolidated Interim Balance Sheet \n(in thousands of euros) \n     June 30, 2015   December 31, 2014               Assets                  Current Assets        Cash and cash equivalents  274,767  64,286  Current financial assets  4,158  4,952  Current receivables  15,525  10,075   Total current assets   294,450   79,314            Non-current assets        Intangible assets  4,732  5,362  Tangible assets  5,816  5,931  Other non-current assets  84  84   Total non-current assets   10,632   11,377             Total assets   305,083   90,690   Liabilities         Current liabilities        Trade payables  57,372  10,322  Financial liabilities  462  453   Total current liabilities   57,834   10,775            Non-current liabilities        Financial liabilities  3,521  3,753  Defined benefit obligations  1,203  1,094  Other non-current liabilities  173,347  441   Total non-current liabilities   178,071   5,289             Capital and reserves attributable to equity holders of the Company        Share capital  2,676  2,648  Share premium  183,306  181,746  Retained earnings  (109,527)  (89,881)  Net income (loss)  (6,974)  (19,647)  Other reserves  (303)  (241)   Total capital and reserves attributable to equity holders of the Company   69,178   74,626               Total liabilities and equity   305,083   90,690  \nConsolidated Interim Income Statement \n(in thousands of euros) \n     June 30, 2015   June 30, 2014                      Revenue from collaboration and licensing agreements  3,092  1,027  Government financing for research expenditures  3,344  3,110            Revenue and other income   6,436   4,137           Cost of supplies and consumable materials  (1,179)  (788)  Intellectual property expenses  (513)  (265)  Other purchases and external expenses  (7,214)  (7,358)  Employee benefits other than share-based compensation  (5,114)  (3,556)  Share-based compensation  (272)  -  Depreciation and amortization  (977)  (1,082)  Other expenses  (215)  (150)            Operating expenses, net   (15,482)   (13,200)                        Operating income (loss)   (9,046)   (9,063)           Financial income  2,370  338  Financial expenses  (298)  (143)  Share of profit (loss) of associates and joint ventures  -  (170)                        Net income (loss) before tax   (6,974)   (9,039)                       Income tax expense  -  -            Net income (loss)   (6,974)   (9,039)            Net income (loss) per share attributable to the equity holders of the Company:         (in € per share)        - basic  (0.13)  (0.19)  - diluted  (0.13)  (0.19)  \nConsolidated Interim Statement Of Cash Flows \n(in thousands of euros) \n     June 30, 2015   June 30, 2014      Net income (loss)   (6,974)   (9,039)  Depreciation and amortization  977  1,082  Provisions for charges and defined benefit obligations  76  41  Share-based payments  272  -  Share of profit (loss) of associates and joint ventures  -  170  (Gains) / losses on disposal of fixed assets  13  2  Gains on assets and other financial assets  (351)  (242)  Net interests paid  72  86   Operating cash flow before changing in working capital   (5,915)   (7,900)  Changing in working capital  214,506  (859)   Net cash generated from / (used in) operating activities:   208,590   (8,759)  Acquisition of property, plant and equipment  (233)  (230)  Acquisition of intangible assets  -  (2,023)  Disposal of fixed assets  -  -  Acquisition of current financial assets  -  (1,955)  Disposal of current financial assets  800  -  Gains on assets and other financial assets  351  242   Net cash generated from / (used in) investing activities:   918   (3,967)  Transactions on treasury shares  101  11  Capital increase  -  47,807  Issue of own shares  1,213  1,003  Repayment of financial liabilities  (223)  (394)  Net interests paid  (72)  (86)   Net cash generated from financing activities:   1,020   48,340  Effect of the exchange rate changes  (47)  (5)   Net increase / (decrease) in cash and cash equivalents:   210,481   35,609  Cash and cash equivalents at the beginning of the period:  64,286  38,360   Cash and cash equivalents at the end of the period:   274,767   73,369     \n Revenue and other income  \n\nThe following table summarizes operating revenue for the periods under review: \n In thousands of euros   June 30, 2015   June 30, 2014  Revenue from collaboration and licensing agreements  3,092  1,027  Government funding for research expenditures  3,344  3,110   Revenue and other income   6,436   4,137   \nThe rise in revenue and other income at June 30, 2015 results from the start of the recognition of the initial payment in relation with the co-development agreement signed with AstraZeneca in April 2015. This revenue is spread over the costs of the clinical trials the Company is in charge of. \n\nAt June 30, 2014, this line item only came from the licensing agreement signed with Bristol-Myers Squibb in July 2011 (€24.9m). This recognition is almost completed. \n\nGovernment funding for research costs is mainly composed of the research tax credit (€3.3m for the six-month period ended June 30, 2015 compared to €3.1m for the same year-ago period). The 2014 research tax credit should be received by the end of the fiscal year (€6.5m). \n\n Operating expenses, by business function \n\nThe following table breaks down the net operating expenses by function for the periods under review: \n In thousands of euros   June 30, 2015   June 30, 2014  Research and development expenses  (12,754)  (10,890)  General and administrative expenses  (2,728)  (2,310)   Operating expenses   (15,482)   (13,200)  \nResearch and development (\"R&D\") expenses include the cost of employees assigned to research and development operations (including employees assigned to work under the collaboration and licensing agreements), product manufacturing costs, subcontracting costs as well as costs of materials (reagents and other consumables) and pharmaceutical products. \n\nThe variance in R&D expenses between the two periods under review (€12.8m at June 30, 2015 versus €10.9m at June 30, 2014, or +17%) mainly results from the staff costs (+€1.4m), consumables (+€0.4m) and intellectual property costs (+€0.3m). The reason of these variances is explained in the next page. \n\nR&D expenses accounted for 82% of operating expenses for the six-month period ended June 30, 2015 (2014: 83%). \n\nGeneral and administrative (\"G&A\") expenses mostly comprise costs of the \"support\" staff as well as external expenses for the management and development of our business. The rise of these costs mainly results from an increase in staff costs (€0.4m). \n\nG&A expenses accounted for 18% of operating expenses for the six-month period ended June 30, 2015 (2014: 17%). \n\n Operating expenses, by business nature \n\nThe following table breaks down the net operating expenses by nature of expense for the periods under review: \n In thousands of euros   June 30, 2015   June 30, 2014  Costs of supplies and consumable materials  (1,179)  (788)  Intellectual property expenses  (513)  (265)  Other purchases and external expenses  (7,214)  (7,358)  Employee benefits other than share-based compensation  (5,114)  (3,556)  Share-based payments  (272)  -  Depreciation and amortization  (977)  (1,082)  Other income and (expenses), net  (215)  (150)   Operating expenses   (15,482)   (13,200)  \nThe changes in the most significant line items can be analysed as follows: \nCosts of supplies and consumable materials: the rise in these expenses between the two periods (€1.2m at June 30, 2015 compared to €0.8m at June 30, 2014, or +50%) mainly results from the increase of the discovery activities;  Intellectual property costs: this increase mainly results from the costs in relation to IPH2201 bought in February 2014;  Other purchases and external expenses: the variance of the line item between the two periods results from the decrease of the subcontracting costs (-€0.4m) partly offset by legal costs in relation to the AstraZeneca agreement (€0.2m);  Employee benefits other than share-based compensation: the increase in these expenses between the two periods (€5.1m at June 30, 2015 compared to €3.2m at June 30, 2014, or +44%) mainly results from the recruitment of around 20 employees (€0.9m) and an increase of the collective bonus following the agreement with AstraZeneca.  \n Balance sheet items: \n\nCash, cash equivalents and financial instruments amounted to €278.9m at June 30, 2015, as compared to €69.2m at December 31, 2014. Cash and cash equivalents do not include the reimbursement of the 2014 research tax credit which will be received during the second half year (€6.5m).  \n\nSince its incorporation in 1999, the Company has been primarily financed from revenue from its licensing activities (mostly in relation to the agreements with Novo Nordisk A/S and Bristol-Myers Squibb) and by issuing new securities. The Company also generated cash from government financing for research expenditure and repayable advances (BPI France). At June 30, 2015, these repayable advances amount to €1.5m euros booked in non-current financial liabilities. \n\nThe other key balance sheet items at June 30, 2015 are as follows: \nDeferred revenue for €219.1m relating to the remaining of the initial payment from Astra-Zeneca not yet recognized as turnover (including €173.3m booked as 'Other non-current liabilities');  Receivables from the French government in relation to research tax credit for the year 2014 and the six-month period ended June 30, 2015 (€9.7m);  Intangible assets for a net book value of €4.7m, corresponding to the rights and licences relating to the acquisition in February 2014 of the anti-NKG2A antibody;  Shareholders' equity of €69.2m including the net loss for the period (€7.0m).  \n Cash-flow items:  \n\nThe net cash flow generated over the six-month period ended June 30, 2015 amounted to €210.5m, compared to a net cash flow of 35.6 million euros generated for the same year-ago period. \n\nThe cash flow generated during the period under review mainly results from the following: \nA loss of €7.0m for the six-month period ended June 30, 2015, including amortization for an amount of €1.0m;  The proceed of the initial payment relating to the agreement signed with AstraZeneca on April 24, 2015 (€223.5m);  The net proceed from the issuance of new shares corresponding to the exercise of equity instruments (€1.2m).  \n Key events since January 1, 2015  \nOn April 24, 2015, Innate Pharma SA signed a co-development and commercialization agreement with AstraZeneca, along with MedImmune, to accelerate and broaden the development of its proprietary anti-NKG2A antibody, IPH2201, including in combination with MEDI4736, an anti-PD-L1 immune checkpoint inhibitor proprietary of AstraZeneca. The financial terms of the signed agreement include cash payments of up to $1.275 billion (including a $250 million initial payment) as well as double digit royalties on sales.   \n Precisions:  \n\nThe interim consolidated financial statements for the six-month period ended June 30, 2015 have been subject to a limited review by our Statutory Auditors and were approved by the Executive Board of the Company on September 16, 2015. They were reviewed by the Supervisory Board of the Company on September 16, 2015. They will not be submitted for approval to the general meeting of shareholders. \n\n Risk factors:  \n\nRisk factors identified by the Company are presented in paragraph 5 of the \"Document de Référence\" submitted to the French stock-market regulator, the \"Autorité des Marchés Financiers\", on March 12, 2015. The main risks and uncertainties the Company may face in the six remaining months of the year are the same as the ones presented in the reference document available on the internet website of the Company. \n\n Related party transactions:  \n\nTransactions with related parties during the periods under review are disclosed in Note 20 to the Interim consolidated financial statements prepared in accordance with IAS 24 revised. \n\n * Cash, cash equivalents and current financial instruments. \n\n ** Hart-Scott-Rodino Antitrust Improvements Act, a set of amendments to the antitrust laws of the United States . \n\nINNATE PHARMA: 1ST HALF 2015 RESULTS http://hugin.info/155662/R/1952599/710262.pdf \n\nHUG#1952599", "source": "Reuters"}