{"published": "2015-09-05T15:14:12Z", "media-type": "News", "title": "Full Steam Ahead: Piecing together clues about the Andrea Doria's demise", "id": "d0a9ec1e-b93b-4ee2-859f-2f7d334683d4", "content": "Recently, another scuba diver was lost attempting to explore the wreckage of the Andrea Doria, a passenger ship considered one of the safest ships ever built when launched in 1951. It raises questions about what makes a ship safe and why are some deemed unsinkable. Two other notable ships considered unsinkable are lying on the ocean floor. In 1909, the 570-foot RMS Republic was rammed by the 381-foot SS Florida in dense fog south of Nantucket. It sunk after 39 hours while being towed to New York. In 1912, the Titanic hit an iceberg in the North Atlantic and sank 2 hours and 40 minutes later, taking 1,500 passengers with it. The Andrea Doria had a double hull with 11 watertight compartments and enough lifeboats to accommodate all passengers and crew. She also was equipped with the latest early warning radar system. However, she had a tendency to list, especially when struck by a hard object such as a large wave. On July 17, 1956, she left her home port of Genoa, Italy for another routine trip to the United States. After picking up passengers at three foreign ports, she sailed for America with 1,706 people on board. On July 26, when she entered the waters on a westerly path south of Nantucket she became encased in dense fog. The area was a heavily traveled shipping lane, the site of shipwrecks caused by frequent periods of dense fog with nearly zero visibility. The captain maintained a speed of approximately 22 knots, but took precautionary measures such as closing the watertight doors and activating the fog warning whistle. Meantime, the MS Stockholm was traveling east from New York in the same shipping lane under sunny skies. A passenger ship of the Swedish American Line, the Stockholm had been overhauled in 1953 to accommodate more passengers. At 525 feet, she was about half the length of the Andrea Doria, but gained the reputation for opulence and luxury. Carrying 534 passengers with a crew of 208, she was sailing under sunny skies at a speed of 18 knots with a visibility of 6 nautical miles. As she approached the edge of the fog bank the radar showed the presence of another ship, as did the Andrea Doria’s radar. However, there was no communication between the ships. The Andrea Doria steered to its port side, contrary to the rules of the road. The Stockholm steered to its starboard side, essentially torwards the direction of the Andrea Doria. When the ships became visible to each other, it was obvious they were on a collision course at a combined speed of 40 knots. The Stockholm began putting its engines in reverse attempting to stop, while the Andrea Doria maintained its speed hoping to outrun the Stockholm. The Stockholm’s ice breaking bow hit the Andrea Doria at a 90- degree angle, penetrating about 40 feet into seven of 11 decks on her starboard hull. The fuel tanks on the Andrea Doria’s starboard side were filled with tons of seawater after being torn open, while the port side tanks were empty and full of air, although they should have been filled with water for ballast. This acccelerated the ship’s list, the tanks with air acting like balloons. The severe list enabled seawater to flow down corridors, stairwells and any compartment in its path, including the generator room and tank compartment containing the controls for the pumps, causing the ship to lose its electricity. The Andrea Doria sank 11 hours after being hit, coming to rest on the ocean floor 240 feet below. Page 2 of 2 - Approximately 30 feet of the Stockholm’s bow had been torn away, making it periously low in the water in danger of sinking. Quick action of emptying the fresh water tanks raised the bow enough to keep it afloat and in no imminent danger. Subsequent hearings demonstrated that ships thought to be unsinkable are vulnerable to the actions of captains and crews. Errors and misjudgment can spell disaster, which became painfully clear in the sinking of the Andrea Doria. Her officers did not realize the Stockholm’s size, speed and course because they had not followed proper radar procedures or used the available plotting equipment. Contrary to the rules of the road, Andrea Doria veered to port instead of starboard, drawing the two ships closer on a collision course. The Andrea Doria was speeding in dense fog in violation of navigational rules. Andrea Doria’s port side fuel tanks were empty and had not been filled with seawater for ballast as required, contributing to the ship’s severe list. The Stockholm’s navigation officer misread his radar, thinking he was on a 15-mile setting although the radar was set for 5 miles, causing him to believe the Andrea Doria was much further away than she was. The collision claimed the lives of 52 people on the Andrea Doria and five crewmen on the Stockholm. Since then, more than 15 divers have lost their lives while attempting to search the wreckage, including seven during the past decade. It is believed that the wreckage does not contain much of significant value because most passengers had emptied the safes in anticipation of their pending arrival in New York. However, there remains a fascination with the worst maritime disaster to occur in United States waters since the 1915 sinking of the SS Eastland, which rolled over while tied to a dock in the Chicago River, claiming the lives of 844 passengers and crew. The summer is coming to a close, but the Marine Museum is open and continues to hold events for the young and not so young. Sept. 13 is Pirate Day, Sept. 19 is Life of a Sailor Day, Sept. 24 is a Teachers Social, and Sept. 26 is Smithsonian Museum Day Live. Check our website at marinemuseumfr.org or call 508-674-3533. We’re located at 70 Water St., Fall River, just south of the Battleship. Consider being a volunteer, sharing your expertise with us as we strive to enrich the museum. Phil Hudner retired from Bank of America and lives in Westport, where he was a member of the Planning Board. He currently serves as a trustee of the Marine Museum.", "source": "Wicked Local Rehoboth"}