{"published": "2015-09-25T07:58:35Z", "media-type": "News", "title": "AOI system delivers camera clearance for single pass inspections", "id": "a835b7de-c588-499e-a3db-dcdcbb1bb79b", "content": "Additions to Mek’s SpectorBOX AOI systems include a 5inch camera clearance that enables complete single pass inspection of virtually any assembly. \n \nThe modular AOI systems have been optimised for the inspection of THT components to identify defects such as presence/absence, wrong polarity, colour, type, and bent pins. The top clearance of 130mm allows the Top-Down SpectorBOX to inspect virtually any completed electronic and electro-mechanical assembly — even when the tallest of components are present, claims the company. \n \nThe modules can be equipped with eight wide field of view side cameras in addition to top view camera on the FWAz optical unit. Its large 18,8?² pixel capturing sensor delivers smooth and detailed images, says the company, with dynamic range. \n \nThe z-axis adjustable optical head can adapt to any PCB thickness, and automatically compensates for warpage. The text and polarity inspection on tall components enables the inspection of complex, completed assemblies without the need for fixtures or multiple inspections. \n \nThe addition of eight simultaneously operating multiplexed angular side cameras which are available for the FWAz model, facilitate active automatic inspection, classification and repair, as the system displays and also stores nine brilliantly clear defect review angles in full colour. \n \nThe configuration complements the company’s THT bottom-up modular AOI, a system that can be positioned at any conveyor location. Typically, bottom side PCB inspection requires flipping units combined with a standalone inline AOI. The slim design allows it to be positioned below existing return and/or feed conveyors, saving space and money. \n \nThe Nutek main frame is a cost-effective way to combine bottom-up and/or top-down inspections, says the company. The turnkey solution enables simple integration of one or two SpectorBOX systems into a production line. It can be configured to the output of any wave or selective soldering system. The ergonomic design is optimised for operators to have eye-height monitors as well as wrist height keyboard and mouse control. A manual mode allows for smooth offline programming preparation. \nhttp://www.marantz-electronics.com \n   Share This Story, Choose Your Platform!", "source": "Softei.com"}