{"published": "2015-09-10T12:26:28Z", "media-type": "News", "title": "Blueprint Medicines Receives FDA Authorization to Advance Novel Drug Candidate into Clinical Trial for Systemic Mastocytosis", "id": "934a2c82-e8d8-40db-a18c-417e1060df6c", "content": "SOURCE Blueprint Medicines\n\n- Company on track to advance three programs into Phase 1 trials this year -\n\nCAMBRIDGE, Mass. \n\n\"BLU-285 has the potential to be a highly targeted therapy for patients with severe forms of SM who lack effective treatment options,\" said Jeffrey Albers \n\nBLU-285 is a potent and highly selective inhibitor of the KIT D816V mutant, the primary driver of disease in more than 94 percent of SM patients. SM is characterized by the abnormal accumulation of mast cells. In patients with advanced forms of the disease, mast cells accumulate in organs, such as the bone marrow, intestines, spleen and liver, compromising organ function. There are no approved targeted therapies for SM patients with KIT D816V-driven disease.\n\nIn this Phase 1 trial, Blueprint Medicines plans to enroll approximately 60 patients with advanced SM, which includes aggressive SM with associated hematological non-mast cell disorders (SM-AHNMD) and mast cell leukemia (MCL), and other relapsed or refractory myeloid malignancies at multiple sites in Europe \n\nIn July, Blueprint Medicines also announced the acceptance of INDs to advance BLU-285 into a Phase 1 trial for unresectable, treatment-resistant gastrointestinal stromal tumor (GIST) and BLU-554 into a Phase 1 trial for advanced hepatocellular carcinoma (HCC). \n\nAbout Blueprint Medicines Blueprint Medicines makes kinase drugs to treat patients with genomically defined diseases. Led by a team of industry innovators, Blueprint Medicines integrates a novel target discovery engine and a proprietary compound library to understand the blueprint of cancer and craft highly selective therapies. This empowers the Blueprint Medicines team to develop patient-defined medicines aimed at eradicating cancer. \n\nForward-Looking Statements \n\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, as amended, including, without limitation, statements regarding Blueprint Medicines' ability to craft highly selective therapies and deliver targeted medicines for patients with genomically defined diseases and its planned Phase 1 clinical trials for BLU-554 and BLU-285. The words \"may,\" \"will,\" \"could,\" \"would,\" \"should,\" \"expect,\" \"plan,\" \"anticipate,\" \"intend,\" \"believe,\" \"estimate,\" \"predict,\" \"project,\" \"potential,\" \"continue,\" \"target\" and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words. Any forward-looking statements in this press release are based on management's current expectations and beliefs and are subject to a number of risks, uncertainties and important factors that may cause actual events or results to differ materially from those expressed or implied by any forward-looking statements contained in this press release, including, without limitation, risks and uncertainties related to the delay of any planned clinical trials and/or development of Blueprint Medicines' drug product candidates, including BLU-554 and BLU-285; Blueprint Medicines' ability to successfully demonstrate the efficacy and safety of its drug product candidates; the pre-clinical and clinical results for Blueprint Medicines' drug product candidates, which may not support further development of such drug product candidates; and actions of regulatory agencies, which may affect the initiation, timing and progress of clinical trial. These and other risks and uncertainties are described in greater detail in the section entitled \"Risk Factors\" in Blueprint Medicines' Quarterly Reports on Form 10-Q for the quarters ended March 31, 2015 \n\nLogo - http://photos.prnewswire.com/prnh/20150605/221118LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/blueprint-medicines-receives-fda-authorization-to-advance-novel-drug-candidate-into-clinical-trial-for-systemic-mastocytosis-300140600.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WFMJ 21 - TV"}