{"published": "2015-09-05T13:49:16Z", "media-type": "News", "title": "BJP defends decision, slams Congress for failing to implement OROP", "id": "9129b4ed-40ce-45b6-93c5-8553d4d9f1ea", "content": "With veterans not fully satisfied with the government’s formulation of the One Rank One Pension (OROP), the ruling BJP claimed it sent the “right signals” to an overwhelming majority of retired jawans and only a “small group” of politically motivated ex-officers were refusing to accept the announcement. \n\r \n“The announcement will benefit more than 95% of ex-servicemen, who mostly retired as Personnel Below Officer Rank (POBR). The decision for one-time payment of arrears to widows and disabled jawans is being appreciated. Only some politically motivated people, who retired as officers, have decided to continue the protest,” a BJP leader said. \n\r \nThere are about 24 lakh ex-servicemen; the POBR make up the overwhelming majority. The number of widows is nearly six lakh. \n\r \nEarlier in the day, defence minister Manohar Parrikar briefed BJP spokespersons on the contours of the OROP decision, requesting them not only to defend the government’s decision but also attack the Congress’s failure to implement the decision. \n\r \nAfter the announcement, BJP chief Amit Shah thanked Prime Minister Narendra Modi for the implementation. \n\r \n“Every year, Rs 9,000-10,000 crore more will go to the ex-servicemen. The Modi government has given economic security to them as well as the serving personnel who will retire later. The BJP hails the Prime Minister for this,” Shah said. \n\r \nShah attacked the Congress for sitting over the demand and reducing their pension from 70% to 50% of the salary in 1973 (when it was in power). “The previous Congress government, in its last moments, made an allocation of Rs 500 crore for it and this was a joke with servicemen,” Shah said. \n\r \nBJP secretary Shrikant Sharma accused the Congress of playing negative politics over the issue after having failed to resolve in the last 40 years, and appealed to it to act as “constructive” opposition. \n\r \nIn tweets, Shah said the historic decision is a “big step for the welfare of soldiers, the real life heroes”. “The decision will go a long way in boosting the morale of our soldiers and their families,” he said.", "source": "Hindustan Times"}