{"published": "2015-09-22T09:27:02Z", "media-type": "News", "title": "Tiny chihuahua gets stolen 'to order' from Bristol Dogs and Cats...", "id": "e7498bc3-669c-4705-b15f-cb263c17698a", "content": "A tiny chihuahua has been stolen 'to order' from a rescue centre by a gang of professional thieves. \n\nRaiders used sophisticated tools to access a secure part of the complex and ignored other animals in favour of the five-month-old puppy called Fox. \n\nIt is believed she was stolen to use in breeding - but the chihuahua-Jack Russell cross has recently been spayed and is likely she will be dumped when the thieves realise. \n\nJodie Hayward, manager of Bristol Dogs and Cats Home, said the burglary had been a \"highly skilled operation\" which succeeded despite the charity's 24/7 security. \n \nShe said: \"They used professional tools to break in, and knew exactly which kennel they were aiming for. \n\n\"Our fear is that she has been stolen to be used for breeding, however she has only recently been spayed and is still recovering from that operation. \n\n\"We do not know what condition little Fox is being kept in, if that operation wound gets infected it could make her seriously ill and she would need veterinary attention. \n\n\"It is sickening to think that these heartless people have planned this operation so carefully and now one of our special dogs has been stolen and we are terrified for her safety. \n\n\"We have done everything possible to prevent this from ever happening, but as you will all know, no place, property or area is ever completely safe from these criminals.\" \n\nThe theft from the centre in St Philip's, Bristol, happened on Saturday night or Sunday morning, and forensic teams have since been to the animal shelter looking for clues. \n\nThe adorable pup, who has distinctive pointy ears, was kept in a non-public area of the centre as she was not ready for rehoming. \n\nShe is described as a very timid dog who has been with the shelter for two months, after coming in as part of an unwanted litter. \n\nPuppies like handbag-sized Fox can sell for around #350 online, while pedigree Chihuahuas can reach upwards of #1,500. \n\nA spokesman for Avon and Somerset police said: \"The kennel section of the dogs' home had been broken into and a Chihuahua puppy has been stolen. \n\n\"The puppy is black and tan in colour. This is still being investigated.\"", "source": "Western Daily Press"}