{"published": "2015-09-29T20:29:36Z", "media-type": "News", "title": "EPA grant to will help buy 15 cleaner school buses in Utah", "id": "977b5f67-57fb-433c-9ea8-926243cec4db", "content": "Davis County School buses at the Bus Farm in Farmington on Sept. 13, 2013. A $500,000 grant will help five school districts in Utah cut costs to replace older school buses with a fleet of cleaner vehicles. \n \nMatt Gade, Deseret News \n \nEnlarge photo» \n   \nSALT LAKE CITY — The school bus fleet in five districts is about to get less polluting due to a $500,000 grant from the U.S. Environmental Protection Agency to help shave costs on 15 new buses. \n \nThe Utah Department of Environmental Quality announced Tuesday it was awarded the money through the EPA's National Clean Diesel Campaign. \n \nMoney will pay for 25 percent of the costs associated with the bus purchases made by the Davis, Granite, Provo, Tooele and Weber school districts. \n \n“Weber School District has tried diligently to keep up with our transportation needs since the downturn of the economy, and it has been a struggle. This grant assistance gives us a much-needed boost to help us get back on track,” said Jeff Stephens, district superintendent. “Not only does it help us to keep up with an aging fleet, but taking these older buses off the road will improve the air for our schoolchildren.” \n \nAgency estimates show that buses that meet the latest EPA standards result in emission reductions of up to 95 percent, in addition to saving 53,690 gallons of diesel fuel. \n \nAs part of the grant requirements, buses from model years 1995-2000 will have to be permanently disabled before the new fleet goes into service. \n \n“The districts will need to provide proof that the engine and chassis have been permanently disabled,” said Lisa Burr, grant coordinator for the Division of Air Quality. “This will ensure the project results in emissions reductions.” \n \nThe Utah Department of Environmental Quality has been participating in the EPA’s National Clean Diesel Campaign since 2008. Since that time, more than $10 million in state and federal grants have helped 53 small businesses, 34 school districts, two government entities, and one university purchase cleaner and more fuel-efficient equipment. \n \nDistricts throughout the state have been trying to keep up on school bus replacements as a way to reduce pollution and protect children's health, but the costs can be prohibitive, particularly for smaller districts. \n \nRep. Stephen Handy, R-Layton, has tried during the past two legislative sessions to provide state matching funding for school bus replacement — his bill sat aside $20 million for the effort — but the measure has failed. It is likely he will bring it back in 2016. \n \nEmail: amyjoi@deseretnews.com  \n\nTwitter: amyjoi16", "source": "Deseret Morning News"}