{"published": "2015-09-24T19:24:52Z", "media-type": "News", "title": "Call for payday loans overhaul after teenager killed himself on the day Wonga emptied his bank account", "id": "d320a8b3-60f7-482c-b40b-1c206dbcf227", "content": "A coroner has called for an overhaul of the rules on payday loans after a mentally ill teenager killed himself on the same day that lender Wonga emptied his bank account, leaving him… \r \nKane Sparham-Price, 18, who had spent much of his life in care, hanged himself after he was left pennyless when Wonga took out a payment due under his debt agreement with the company. \n\nHis death prompted the South Manchester Coroner John Pollard to write to the Financial Conduct Authority warning that he believed there may be future similar deaths unless action was taken. \n\nMr Pollard called for the introduction of a minimum sum which lenders must leave in a client’s accounts by law to “avoid absolute destitution \n\n”. \n\nThe financial watchdog said such a rule would be “undesirable” but underlined that it had brought in new measures, including controls on how often lenders can access customers’ funds, to help minimise the risk of people being left with empty accounts. \n\nRead more: Payday lender Wonga tries damage limitation \n\nNew Wonga adverts target 'hard-working people' \n\nPayday lenders slammed for 'misleading' claims \n\nPayday loan companies and brokers have been criticised in recent years for charging high interest rates and one-off fees to customers who are often the poorest in society. \n\nThe FCA was forced to intervene last year when it banned seven loan brokers from taking on new business after it emerged they were charging arrangement “fees” of up to £75 and in some cases making repeated attempts to take the money straight from the same bank accounts. \n\nMr Sparham-Price, from Ashton-under-Lyne, took out an unspecified number of loans with Wonga when he turned 18 and left local authority care. Shortly before his death in February 2013 he had posted on Facebook about his excitement at moving to a flat and said he was waiting for a deposit to be organised. \n\nThere is no suggestion Wonga acted unlawfully or knew that it had left Mr Sparham-Price pennyless. \n\nMr Pollard, who found that the teenager took his own life, invoked a rule which requires coroners to demand action to be taken by organisations when they fear future similar deaths. The case was heard a year ago but has only come to light after it was reported by the Disability News Service. \n\nThe coroner was disturbed …", "source": "MyInforms"}