{"published": "2015-09-24T00:34:00Z", "media-type": "Blog", "title": "A busy week in America: Playing host to 3 world leaders with 3 billion followers", "id": "c9ee56d6-13e3-4b2d-9aa8-58de46b29660", "content": "Traffic ahead: The leaders of at least 3 billion of the planet's people are stopping by for a visit.\nAmerica is playing host to an impressive glut of dignitaries in the next several days as the United Nations convenes high-level General Assembly meetings in New York -- and that doesn't even include the three top world leaders set to tour the U.S., leaving snarls of traffic in their wake.\nPope Francis is already drawing huge crowds as he visits Washington Wednesday and heads to New York and Philadelphia later in the week. Chinese President Xi Jinping Mark Ralston / Pool / Getty Images Chinese President Xi Jinping speaks beside Boeing executives after his tour of the Boeing assembly line on September 23, 2015, in Seattle, Washington. Chinese President Xi Jinping speaks beside Boeing executives after his tour of the Boeing assembly line on September 23, 2015, in Seattle, Washington. (Mark Ralston / Pool / Getty Images)\nChinese President Xi Jinping landed in Seattle on Tuesday, where he was visiting business leaders and touring a nearby Boeing factory before heading for Washington.\nThen, this weekend, Prime Minister Narendra Modi will tour Facebook's offices and meet other Silicon Valley leaders for the first visit to California by an Indian leader in 33 years. On Sunday, he'll also give a speech in a stadium in San Jose. Each man leads at least 1 billion people around the world. (Only a small portion of the world's 1 billion Catholics live in India and China.) \nThey are all here in part because of the annual U.N. General Assembly gathering in New York.\n “You do always see it this time of year, a lot of heads of state coming in [because of the U.N.],\" said Kal Raustiala, director of the Burkle Center for International Relations at UCLA.  \"It makes sense for them to tack on something else.” The General Assembly has created a cottage industry of sorts of international events happening alongside the U.N. meetings. “Everybody’s in New York because everybody’s in New York,” Raustiala said.\nXi, Modi and the pontiff will all be delivering speeches at a U.N. global development summit beginning Friday that is expected to attract a record 150 heads of state and government,  U.N. spokeswoman Francyne Harrigan told the Los Angeles Times.\nOther notables expected in New York next week include Russian President Vladimir Putin, Iranian President Hassan Rouhani and Cuban President Raul Castro. cComments Got something to say? Start the conversation and be the first to comment. Add a comment 0 Pope Francis is expected to use the platform to urge action on the environment and migrants. Xi and Modi are more interested in deepening commercial ties. \"They are two of the fastest growing economies in the world. At the same time, China’s economy is 4.5 times as large as India’s because it’s grown much faster over the last 25 years,\" Anil Gupta, an expert on the U.S.-India-China triangle and chair in strategy and entrepreneurship at the University of Maryland's Robert H. Smith School of Business, told The Times this week.\nIn the technology sector, \"Under Xi Jinping, China has become decidedly unfriendly to multinational companies while India has become more fundamentally open to multinationals, not just in technology but in sectors like autos and telecoms,\" Gupta said.\nState Department historians weren't sure whether this week's simultaneous visits by world leaders were unusual, a spokeswoman said. The department tracks historical data on visits by foreign leaders here.\nAnother event that drew a large roster of foreign dignitaries to the U.S. was former President Ronald Reagan's funeral in 2004. Nearly 40 current and former world leaders attended the service at the Washington National Cathedral.\nFollow @MattDPearce for national news\nCopyright © 2015, Los Angeles Times Privacy Policy", "source": "latimes.com - Los Angeles Times"}