{"published": "2015-09-24T15:58:19Z", "media-type": "Blog", "title": "Proposed Bill regarding Electricity Generated by Methane Digesters in PA", "id": "7d167156-4364-4253-8e1d-d8fb4120ae5f", "content": "A recent LNP article explains manure digesters, the ways in which they benefit the environment and farmers, and a proposed bill that would ensure farmers can sell the excess electricity they generate .    The recently proposed state regulations could affect farmers across the state.  In today’s environment, one of the factors that limit a farm operation is how to handle manure from the operation.  Some farmers have installed “digesters” which take methane gas produced by the manure and turn that methane gas into electricity that is used to operate the farm.  The manure that comes out of the digesters is safer for the environment, and is easier to manage by the farmers.  The use of manure digesters is good for farmers and is good for the environment as well. In addition, if the digesters produce more electricity than the farm needs, the farmer sells that electricity to the electric company.  This helps pay for the cost and maintenance of the digester. \n \nThe proposed state regulations deal with what happens when the farmer makes more electricity than is needed on the farm.  Electric companies are not very eager to buy this electricity – which is a smaller amount, can be intermittent or unpredictable, and is more expensive than buying it from a big wind or solar farm.  It also doesn’t always “enter the grid” in the spot that electric companies would prefer.  Because of these issues, electric companies would like to limit the amount of electricity that farmers can sell back.  The proposed regulations would protect a farmer’s ability to sell some of their extra electricity produced from these digesters. \n \nOne of our friends, John Williamson, an agriculture consultant with TeamAg in Ephrata is quoted in this article.  TeamAg is a leader in the design and permitting of agricultural projects throughout the Northeastern United States. \n Aaron Marines  is an attorney at  Russell, Krafft & Gruber, LLP , in Lancaster, Pennsylvania. He received his law degree from Widener University and practices in a variety of areas including Land Use, Land Planning and Zoning matters.", "source": "Lancaster Law Blog"}