{"published": "2015-09-18T04:09:52Z", "media-type": "News", "title": "Detained children tripping Transfield", "id": "b5a2865e-9655-4e76-adb8-36d26a92b3d3", "content": "This is the Melbourne mum who has corporate giant Transfield Services extremely nervous as it negotiates a new contract to run Australia's offshore immigration detention centres. \n\nTransfield is preparing to sign a multibillion-dollar, five-year deal to continue operating the Manus Island and Nauru camps on behalf of the federal government, and Shen Narayanasamy wants to put the release of children at the forefront of the company's mind. \n\nAnd Transfield is taking her and the newly formed group she helped create, No Business In Abuse (NBIA), very seriously. \n\nNBIA, whose members come from religious groups, unions, left-wing law firms and human rights bodies, has stunned Transfield and the top end of town with the effectiveness of its - until today - publicly silent campaign targeting the company's investor base. \n\n\"There is clearly considerable disquiet across the boardrooms of this country regarding our abuse of people detained in offshore camps,\" said Ms Narayanasamy, who devised the campaign while on maternity leave last year.  Tactics borrowed \n\nBorrowing from the playbook used by activists to target tobacco and fossil fuel companies, NBIA has been quietly meeting -- often by way of invitation -- with Australia's biggest investors, banks, superannuation funds, institutions and analysts. \n\nIn those meetings, the group highlights instances of alleged rape, violence and other adverse incidents that it claims shows Transfield's complicity in human rights abuses. \n\nIt is this complicity, the group argues, that poses serious legal, financial and reputational consequences for Transfield, and a likely loss of value for shareholders. \n\nBy using language easily understood by the investment sector, which has a fiduciary duty to put financial returns to members ahead of ethical concerns, NBIA's campaign has proved persuasive. \n\nLeading industry super fund HESTA recently divested $23 million of Transfield stock after meeting with Ms Narayanasamy. HESTA said it made its decision on a financial basis and that it had been seeking answers from Transfield about its immigration work a year ago.  Divestment causing stir \n\nStill, its divestment caused a stir in financial circles and was greeted with scepticism from Assistant Treasurer Josh Frydenberg, who wants to rein in union influence on industry fund boards. UniSuper and NGS Super have also sold out of Transfield. \n\nSeveral other big investors, including Transfield's major shareholder, funds manager Allan Gray, are reviewing their holdings amid concerns about events on Manus Island and Nauru. \n\nIn an indication of the success of NBIA's campaign, Transfield has circulated a nine-page letter around the investment community rebutting the group's claims.  Transfield Response \n\nHaving achieved much without any publicity, Ms Narayanasamy has chosen to speak publicly today as her group intensifies its campaign to have children released and to counter Transfield's statements to investors. \n\nWith Transfield having until October 31 to sign off on its new contract, NBIA has presented the company's top executives with four non-negotiable conditions it wants built into the deal. The release of children tops the list.  Turnbull targeted \n\nMalcolm Turnbull's ascension to the prime ministership has proven timely for NBIA, which has not forgotten his February comment that \"one child in detention is one child too many\". \n\n\"Transfield can choose to demand that children be released immediately as part of the current contract negotiation process,\" Ms Narayanasamy said. \n\n\"It must accept the responsibilities for what its choice means to vulnerable men, women and children, as well as to investors relying on Transfield as a legitimate and respectable actor in Australian business.\" \n\nMs Narayanasmy is not in the business of making empty threats. She said NBIA was weeks away from publicly releasing a report detailing every human rights abuse that has occurred under Transfield's watch at the detention centres. It will include fresh data on sexual assaults. \n\nRecent reports by Senate Select Committee, the Australian Human Rights Commission and the Moss independent review have included widespread allegations of abuse at the offshore camps, including instances of rape and criticism of Transfield and its sub-contractor, Wilson Security. \n\nThe findings of such reports have been accepted by Labor and the Greens, but are disputed by the Coalition and Transfield, who claim the allegations lack specific evidence.  Investors reassured \n\nTo assuage nervous investors, Transfield has offered to take them on tours of the camps. In its letter to investors, Transfield accused NBIA of basing its claims on outdated information and said the targeting of its investor base was not \"in the interest of the welfare of asylum seekers\". \n\nIt also played down the threat of litigation by pointing out that the human rights conventions highlighted by NBIA were voluntary and not legally binding on companies. \n\nThe company declined to answer specific questions from Fairfax Media on whether it would raise the issue of children in contract talks with the government. It instead released a statement reinforcing its commitment to \"the highest standards of probity and transparency\", its \"zero tolerance for abuse\" and welcoming the regular visits to the camps by the Commonwealth Ombudsman, Red Cross and UN representatives. \n\nFairfax Media understands that Transfield privately believes releasing children is a matter for government and that Australians should remember that people inside the camps are free to leave anytime. \n\nChief executive of the Australian Council of Superannuation Investors, Louise Davidson, said campaigns such as NBIA's which target investors instead of politicians will become increasingly common in Australia. \n\n\"There's no doubt we will see more of the targeting of investors by non-government organisations rather than policy makers,\" she said. \n\n\"NGO's are a really good source of information for us but it has to be remember that there are political ends they are trying to achieve.\" \n\nHaving met with NBIA, Ms Davidson's organisation and some of its individual members have been in talks with Transfield. \n\nMs Davidson said some super funds were eager for Transfield to provide \"a greater level of disclosure about activities and more transparency\".  Children were motivation \n\nSo what motivated Ms Narayanasamy to do all this while on maternity leave? \n\nShe said it was the memory of visits to outback detention centres more than 10 years ago where she was struck by the \"dead-eyed children and the young men slowly going mad being held in remote dusty camps\". \n\nA stint in corporate law and mining litigation in Africa gave her the skills to communicate with the corporate sector. She credits refugee organisation RISE with being the first to recognise Transfield's vulnerability as a corporate entity. \n\nAs the date for Transfield's contract renewal draws nearer, NBIA has partnered with GetUp and the noise for children to be released will grow louder. \n\n\"People might not be swayed by the Stop the Boats rhetoric, but they draw the line at child abuse. We saw that with the little Syrian boy, sooner or later, humanity triumphs. If I was an investor, I'd put money on that probability,\" Ms Narayanasamy said.", "source": "Farm Weekly"}