{"published": "2015-09-03T13:30:00Z", "media-type": "News", "title": "The Center for Personalized Education Celebrates 25th Anniversary", "id": "b365694e-a4b8-490f-b542-638ff66c3c61", "content": "DENVER , Sept. 3, 2015 /PRNewswire/ -- CPEP, The Center for Personalized Education, is celebrating 25 years of promoting quality patient care and safety by enhancing the competence of physicians and other healthcare professionals. More than 4,000 healthcare professionals have participated in CPEP's programs ultimately improving the care of more than four million patients. \n\nCPEP launched in Colorado in 1990 with the goal of providing in-depth assessment and education to objectively address physician performance concerns. Within its first year, CPEP had participants from four other states and has since gone on to serve a national audience. \"I don't think anyone ever imagined that CPEP would have the impact and national reach that it has today\" said Beth Korinek , chief executive officer for CPEP. \n   \nJandel Allen-Davis , vice president of government, external relations, and research, Kaiser Permanente Colorado observed, \"I think CPEP has only become more vital in the world of healthcare today.\" \n\nCPEP offers comprehensive seminars and courses on a variety of topics, including communications, medical record keeping, prescribing prescription drugs and professional ethics. It also offers a Reentry to Clinical Practice program for those healthcare professionals who have voluntarily taken time off from practice and need to update their skills before returning to the workplace. \n\n\"Over the last 25 years, CPEP has been able to adapt and thrive in a rapidly changing healthcare landscape and has successfully filled a significant need in the medical community,\" noted Korinek. \"CPEP helps prevent the loss of educated physicians from our healthcare system – a very valuable resource during a time of a considerable physician shortage.\" \n\nCPEP is also growing its operations to help meet the nation's increasing demand for more healthcare professionals. In 2014, CPEP opened a satellite office in Raleigh, North Carolina to better serve physicians and healthcare professionals across the U.S. and in Canada . \n\nIn July 2015 , CPEP formed a partnership with the Massachusetts Medical Society to ensure that programs are available for Massachusetts physicians who need to update or document their skills and competence as well as those who have taken extended time off from clinical practice. \n\nCPEP's 2014 Annual Report highlights some of its recent growth and accomplishments. To learn more about CPEP's 25 th Anniversary, visit www.cpepdoc.org . \n\nContact: \nErich Kirshner \nEvolution Communications Agency \n303.921.6733 or erich@becausemessagematters.com \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/the-center-for-personalized-education-celebrates-25th-anniversary-300137456.html \n\nSOURCE  CPEP", "source": "A.M. Best"}