{"published": "2015-09-20T11:00:26Z", "media-type": "News", "title": "13:54Crimean Tatars launch economic blockage of occupied Crimea", "id": "3e986049-a9af-4a5c-8a63-c22ccf844bcd", "content": "On Sunday noon, Crimean Tatars and other activists from Ukraine blocked checkpoints at the administrative border between mainland Ukraine and occupied Crimea to prevent trucks with commodities from entering the peninsula.\r  \nThe blockade will be held in three stages / Photo from Ayder Muzhdabaev \n  \nAt least 1,000 people are expected to participate in the blockade of the administrative border with occupied Crimea on the first day of the campaign, according to leader of the Mejlis of the Crimean Tatar People Refat Chubarov . \n \n\"I expect at least about one thousand people will come today. These are those we know about. We are blocking all the three directions ‒ Kalanchak, Chaplynka and Chonhar (all in Kherson region, Ukraine) ‒ as of noon sharp,\" he said at a meeting prior to the launch of the blockade, according to Ukrainian news agency RBC Ukraine. \n \nChubarov announced that the campaign would be held in three stages. \"A rally has begun. The rally is the first stage. There will be the second and third ones. As for duration and formats, we'll be in consultation with all those who have come here, with the headquarters and representatives of the Mejlis,\" he said. \n \nIn his words, the campaign will depend on many factors. \n \nChubarov also called on the Ukrainian Cabinet to address the issue of creating the so-called food hubs in Ukrainian territory close to the administrative border with occupied Crimea. In his words, this will allow entrepreneurs to work transparently, and money will remain in Ukraine, namely in Kherson region. \n \nAs was earlier reported, the blockade concerns only trucks with goods running between Ukraine and Crimea. Thus, all the four roads will be blocked not to let their movement. However, the campaign will not concern individuals and passenger cars, which will be able to move freely. \n \nThe leaders of the Crimean Tatars announced on September 8 that they would block the administrative border between mainland Ukraine and Crimea to prevent Ukrainian commodities from being delivered to the occupied peninsula. \n \n[embedded content]", "source": "UNIAN"}