{"published": "2015-09-14T03:35:18Z", "media-type": "News", "title": "Public servant loses compo claim after prolonged sitting", "id": "aa12b8cd-eb3f-4069-863e-08cd6bf56ac4", "content": "A Department of Defence employee has lost a compensation battle after claiming she suffered chronic back pain as a result of prolonged sitting and computer work.\n\nKate Farrer, 44, joined the department in an administrative role in 2007 after serving with the Royal Australian Air Force.\n\nAccording to court documents, Mrs Farrer experienced five years of debilitating pain and was treated with physiotherapy and anti-inflammatory medication so she could continue working.\n\nIn August 2011, she had a desmoid tumour surgically removed near the bottom of her spine to ease the pain but it continued and spread down her left thigh.\n\nA year later she developed a distinct limp with pain spreading to her toes. She took extended leave from December 2012 but the pain continued so she reduced her hours of work to 20 per week.\n\nMrs Farrer lodged her claim for compensation in February 2013 supported by a report from her general practitioner, Dr Leisa​ Andrews, who described her condition as neuropathic pain.\n\nBut her claim was rejected by Comcare, despite her ailment being recognised, and the decision was later upheld in the Administrative Appeals Tribunal of Australia. \n\nAATA deputy president Phillip Hack SC accepted Mrs Farrer was convinced her injury was caused by her work, but said the the evidence did not sufficiently demonstrate this.\n\n\"Ultimately the problem for Mrs Farrer is not the absence of a precise diagnosis, it is the absence of any reliable evidence pointing to the necessary connection between her collection of symptoms, however described, and her employment,\" he said.\n\n\"The specialist practitioners who have examined her, Dr [John] Cameron and Dr [David] Douglas, each rejected any connection for reasons that appear quite sound.\"\n\nDr Scott Masters, who treated the applicant in November 2012, said her pain could be linked with prolonged sedentary office employment.\n\nBut Mr Hack said there was no evidence Mrs Farrer was required to maintain a constrained or awkward position while working with the department.\n\n\"Common sense suggests that in her employment setting she relieved any pain or discomfort by altering her posture,\" he said.\n\n\"That is the conventional and learned response of humankind.\"\n\nDr Cameron, a consultant neurologist, was unable to offer a diagnosis despite accepting the applicant was in serious pain and initially expected her condition would have improved when she stopped working.\n\n\"The absence of that improvement led him to conclude that her employment did not cause, or play any significant part in, the development of the pain disorder,\" Mr Hack said.", "source": "Canberra Times"}