{"published": "2015-09-30T13:51:27Z", "media-type": "News", "title": "NDTV Convergence inks deal with Taboola for Rs. 90-100 crores", "id": "4291a36b-516f-4bc1-8139-1b583a38e784", "content": "By ANI | ANI  –  \nNew Delhi, Sept 30 (ANI-NewsVoir): NDTV Convergence the digital arm of NDTV group entered into a strategic three-year partnership with Taboola to enable content recommendations across all its digital platforms today. \n \nNDTV, which owns and operates the flagship portal, www.ndtv.com and all other digital properties of the Group signed one of the largest deals in new media space with Taboola to power content recommendations across their entire network of desktop and mobile sites. \n \nWith an estimate worth Rs. 90-100 crores (approximately USD 13-15 million), Taboola will serve as the exclusive multi-platform content discovery partner across all its properties. \n \nIn an interview, Vikram Chandra, Group CEO & Executive Director, NDTV said, \"We are really happy to extend this partnership with Taboola who have been great partners over the last year. This truly is a landmark deal given its size and scale, making it the largest and one-of- its kind in the Indian digital media eco-system. \"This association further re-inforces our leadership position in the digtal space: something that has been built through credible content and great user experience\" he added. \n \nTaking about the deal, Suparna Singh, CEO and Managing Editor, NDTV Convergence also said that they have always strived to provide our consumers with high-quality and the best possible content. Today as social media feeds continue to fragment the user base, we need to customize content based on user interest. \n \n\"It's an incredible honour to work with such a highly respected global publisher as NDTV, and we look forward to working with Vikram, Suparna, and the entire NDTV editorial team in continuing to boost overall audience engagement and revenue,\" said Adam Singolda, Founder and CEO of Taboola. \n \nHe further added that \"We see India as a massive opportunity for marketers to reach new audiences since so many citizens are accessing the Internet for the first time via mobile, and this partnership is a testament to our commitment to providing Indians with high quality content they may like and never knew existed.\" (ANI-NewsVoir)", "source": "Yahoo! India"}