{"published": "2015-09-17T11:00:00Z", "media-type": "Blog", "title": "All Hail THE CHIMNEYMASTER!", "id": "74e5bc2d-6324-4332-a980-6770a27d5927", "content": "The Chimney is done and the self-made Chimney Cap is in place!  It took me less time than I had thought, but more work than I had thought.  A little background for our new readers:  Over a year ago, I had to attack my living room and tear out a section about 12 x 12 feet.  I worked most of the summer tearing out and then replacing joists, floor and walls. It was long hard work and my wife and I did it alone. The stress landed me in the hospital exactly 1 year ago this last weekend, which caused me to have to put a hold on these final parts of the project. Most importantly, was the chimney to my fireplace.\nYou'd think I would have got to that this summer, but if you'll read last week's post you'll see references to rain, and slippery roofs and reasons to put off the chimney install to the right weekend. Ok, so now we're caught up and you, like me, can marvel at the wonder the concept: This last weekend, the chimney was installed!  (Yes, I'm going to say that a few more times, I'm very proud of my accomplishment, so bear with me.) I thought I'd share my efforts in preparation for the install.  Y'see, I needed a part to finish the chimney (look up there, ain't it keen?) and couldn't seem to find one anywhere. The part I needed was the ring that held the chimney pieces together.  (You can see it as it originally was installed here.) I had spent the day in the hardware store looking at 're-workable' stovepipe parts and found this:  This is  a piece of stove pipe made for standard wood burning stoves which I knew I could use.  You see those three ends each has a separate collar held on with just a couple of rivets. It's a simple job for me to cut those rivets off and refashion the collars for my own use in assembly of a triple wall chimney (yeah, no one carries them anymore and the company has changed owners, so there's no way to find one, let alone replace it. Gotta re-manufacture it - a Southern Tradition in itself.) One collar for the inner chimney, one for the center chimney and the third to help the other two fit properly. Like this:    Inner Chimney w/collarCenter Wall w/collar And then of course the outer wall.   There is still a lot to do on this project, but for the moment I'm going to be insufferable.  I've been walking around work showing off my pictures of the chimney like a new father showing off his offspring.  (I'd hand out cigars if they weren't so expensive!) In truth, I feel I may have garnered more points to become a true Good Ol' Boy, a card carrying member of the True South. I showed off my ability to think through a problem, refashion something for my own use and I got a chance to fix things up right!  But more than that, I got to use an angle grinder to cut metal and throw a large plume of sparks out across the roof of my house. Very satisfying.   The next day I took this pic of the storm collar and chimney cap combination with the rising sun shining off them.  I can hardly wait for the next rain storm!  ", "source": "Southern Life at The Marvinator's Place"}