{"published": "2015-09-09T13:31:14Z", "media-type": "Blog", "title": "Hospitality, catering and foodservice : The social media crusade heads north and support grows", "id": "d2061972-aea0-460b-b573-de5159a8e6c6", "content": "Hospitality, catering and foodservice : The social media crusade heads north and support grows by James on September 9, 2015 in featured item, Latest News, Lead Article, Northern England, Social Media The #HandCSocial Crusade to share knowledge and learning in social media across the hospitality, catering and foodservice industry is gaining influential new followers. Regular readers of TheMarketingblog will know that we have been following the development of the #HandCSocial campaign from Hospitality & Catering News with enthusiasm. We picked up a tweet earlier today from one of the leading marketing agencies in the hospitality, catering and foodservice industry who seem to share our enthusiasm, The Hub.\nNews & Views from the #HandCSocial team @thehubpr http://t.co/YM5587zhBs great Burger Shack @YoungsPubs interview pic.twitter.com/nUlHoI64vQ — HandCNews.com (@HandCNews) September 9, 2015 Seems they have attended one of the London social media roundtable events and are now heading to Hotel Football in Manchester to take part in looking at what’s happening socially in the vibrant northern hospitality scene. The decision to extend the #HandCSocial RoundTable to Manchester came through one of the event sponsors Peter Kitchin, MD of C&C Catering and then backed by another, Daniel Nevitt, Group Marketing Director at Armourcoat. It now already looks like that decision has paid off through support from across the industry. We spoke earlier with Denis Sheehan at Hospitality & Catering News who organised the events. “The roundtables bring together like minded users of social media from every sector across our industry. When Peter came up with the idea to additionally locate in the north widening the scope and reach of #HandCSocial it made complete sense. Daniel supported the idea immediately and the wider support that we are now getting from previous attendees like The Hub is very encouraging. We are gathering data from a survey that in part will in part set the agenda at Daniel Nevitt,on the night. Although most seats at the table are now taken the survey does offer those that complete the opportunity to join us. All that complete the survey will also receive a copy of the report before we publish it.” TheMarketingblog will also publish the report so that our readers can also see the results as well as a full review of the #HandCSocial roundtable at Hotel Football on October 1st. Tags: #HandCSocial, #HandCSocial Crusade, Armourcoat, C&C Catering, catering, Daniel Nevitt, Denis Sheehan, foodservice, hospitality, Hotel Football in Manchester, Peter Kitchin, Social Media\tPrint article", "source": "TheMarketingblog » Regional"}