{"published": "2015-09-10T18:55:27Z", "media-type": "News", "title": "From a mistake to a dream meeting: Jackky Bhagnani meets his hero Malala Yousafzai", "id": "df1d3dac-23fe-4e98-8691-6bb5cd6fb827", "content": "Mumbai: Bollywood actor Jackky Bhagnani, who made a faux pas last year when he misspelt Nobel Peace Prize winner Malala Yousafzai's name as 'Masala' in a tweet, got a chance to meet the Pakistani activist in London on Thursday. He considered the meeting as his “dream” and called Malala his “hero”. \n\nJackky, who has appeared in films like “F.A.L.T.U” and “Welcome to Karachi”, earlier apologised to the 18-year-old by making a satirical six-minute video with live video entertainment platform #fame for writing her name incorrectly. \n\nThe response to the video was so overwhelming that it urged Malala and her father, Ziauddin Yousafzai to invite Jackky over to meet them. The video went viral on social media a few weeks ago on the occasion of Malala’s 18th birthday on July 12. \n\n“For me things have come a full circle. From an auto-correct mistake to a birthday video tribute to a dream meeting with one of my heroes. Malala is not just an inspiration but a living example of how to fight with courage and determination,” Jackky, who left for London on Monday, said in a statement. \n\n“Her humility is touching and her sincerity is what makes her the leader that she is. Malala is a celebration of the human spirit and this meeting was an opportunity for me to experience that,” he added. \n\nMalala says Jackky's video was the “first thing” she saw on her birthday, which “made my day.” \n\n“The support encourages me to go on further as I know I'm not a lone girl in this mission of wanting girls to get quality education. I'm very thankful to Jackky and the team that made this video.” Malala said. \n\nJackky also took to Twitter and shared a photograph of the meeting. He captioned it: “From a mistake to a dream meeting! To my hero, thank you #Malala @ZiauddinY.” \n\n\n\nJackky further tweeted, \"No family upholds the message of #BetiBachaoBetiPadhao better than @ZiauddinY & #Malala @PMOIndia @narendramodi\" \n\n\nMalala Yousafzai's message to India \nHe also shared a video message from Malala in which she can be heard saying: “Hello! Namaste and As-salamu alaykum to all my friends in India, all my brothers and sisters. I would like to say a big thank you to all of you for your kind support and encouragement to me and my campaign for education and it's your prayers and words that gives me strength to work even harder to ensure that every girl goes to school. \n\n“It's my ambition to work for that in Pakistan, in India and ensure that girls are working that hard and they will contribute to their society. So I'm putting forward to coming to India Inshallah and working there. Thank you.” \n\nWatch here: \n\n[embedded content] \n  \nFor latest news on mobile and tablet, download IndiaTV Android app and iOS app. \r\n                Also like IndiaTV's official Facebook page and follow us on Twitter to stay tuned to latest news.", "source": "India TV"}