{"published": "2015-09-30T18:48:00Z", "media-type": "News", "title": "TFO launches an all-video platform: A one-stop destination for audiences seeking educational content for the digital age", "id": "da2460b3-d89a-4515-9a11-a5101c40d6b2", "content": "Netflix: 65 million subscribers watch more than 100 million hours of video every day[i]. \n\nCanadians come in 2nd globally for the highest monthly number of videos watched online[ii].  \n\nTORONTO, Sept. 30, 2015 /CNW/ - That is the setting in which Groupe Média TFO releases tfo.org, a web platform that offers video on demand and allows web users to engage in a new digital experience specialised in playful, educational content. \n\n\"Of course, we considered children, who can find the entire Caillou series on our website, but we also thought about their parents, who will be delighted to view our playlist '10 Tips to Make Your Kid Ask for More Fruits and Veggies'. Playlists are one of the main features of the new platform, thematically organizing tfo.org's content library,\" said Laurent Guérin, Chief Content Officer. \n\nWith the knowledge that online TV watching will overtake traditional TV watching in 2016, it is crucial to introduce a video content platform that evolves according to users' consumption habits. That is what we offer today[iii]. \n\nAll the Content in One Place \n\nThe new interface, created by Turbulent, is much more than a mere website. Navigation is more dynamic and more intuitive and it offers an enriched catalogue of content: over 9 000 videos and games, 5 600 pieces of educational content for children between 2 and 6 years, mobile applications, colouring spaces, lighthearted skits, reports on different topics and musical sessions by Francophone artists. \n\n\"The launch of this new platform is a key step in our digital strategy and reflects our desire to reach out to new French-speaking audiences, wherever they are. This way, we look forward to better understanding their needs and to offering them content they can identify with. Indeed, Groupe Media TFO produces and acquires exclusive productions such as BRBR (currently filming across Canada), Carte de visite, Mini TFO, FLIP, 24.7, Ciné TFO, #ONFR,\" said Magalie Zafimehy, digital content manager at Groupe Média TFO. \n\nAside from a more user-friendly navigation system, TFO.org offers a more complete selection than ever before, including complete series like Motel Monstre, Caillou, Barbapapa, Subito Texto, Les Doozers, ZoubiDoubi, and many more. Additionally, faithful fans of our cinema programming will be able to access a selection of some hundred classic and contemporary films that have been acclaimed in the world's greatest film festivals. \n\nIncreased Accessibility \n\nIn order to provide an accessible platform to all, content can be played back with subtitling and video description for users with hearing or visual impairments. Additionally, a secure, ad-free space exists for children between 2 and 6 years, as well as a parental control module with a timer to monitor children's video consumption. Furthermore, the platform offers a reserved area for members that will allow our audience to subscribe for free to exclusive video content like \"Le Rêve de Champlain\", which will be available online today. And for Francophiles, we've prepared a navigation menu in English to make searching and accessing content easier. \n\nKnown for Its Innovative Spirit \n\nCommitted to implement an innovative over-the-top television strategy, Groupe Média TFO and its production partners, Slalom, Fairplay and Turbulent, recently produced the captivating docu-drama series \"Le Rêve de Champlain\" as well as a suite of digital products including revedechamplain.com, which was awarded a Prix Gémeaux for best digital production on September 20th this year. \n\nExperience something new: tfo.org \n\nWatch a clip introducing the new platform.  \n\nAbout Groupe Média TFO \n\nGroupe Média TFO is an essential destination for audiences seeking innovative educational and cultural content in French. It offers stimulating experiences and acclaimed content at the vanguard of digital learning, which have received recognition and awards in Austin and in Amsterdam.  \n\nSources \n\n[i]https://pr.netflix.com/WebClient/loginPageSalesNetWorksAction.do?contentGroupId=10476&contentGroup=Company+Facts \n\n[ii] http://cira.ca/factbook/2014/fr/the-canadian-internet.html \n\n[iii] http://tbivision.com/news/2015/07/online-tv-will-overtake-linear-2 016/465021/ \n\nSOURCE Groupe Média TFO", "source": "Fat Pitch Financials"}