{"published": "2015-09-25T07:41:57Z", "media-type": "News", "title": "South: Shake-up of termination payments could cost employers, warns Baker Tilly", "id": "e84f9835-def0-486a-9066-169006831766", "content": "Accountancy firm Baker Tilly is warning that HMRC’s planned changes to termination payments to staff could end up being expensive for employers in the south, and risk many more being caught up in the employment tribunal process. \n\nCurrently, termination payments can be used as a tool for employers where staff are required to leave in cases other than redundancy – for instance where a contract is ending, where a role no longer exists, or where an employee has performance issues.\n\nThese payments can be tax-free up to £30,000 for employees, with employers also avoiding paying the 13.8% National Insurance contribution (NI). Nor does the employee pay any NI on the payment. This £30,000 exemption makes it easier for employers and employees to negotiate an amicable split, with the employee receiving a tax-free sum, and the employer not required to go through the formalities of a redundancy or disciplinary process. Such settlements have recently been approved under the Employment Rights Act.\n\nHowever, the Office of Tax Simplification (OTS) has recommended that where termination payments aren’t made in the case of genuine redundancy, then a ceiling should be imposed on what amounts could be paid tax-free, and this would also depend on how long the employee has been in the job.\n\nThis move could prove considerably more expensive for employers used to being able to pay off under-performers quickly and quietly, and without having to invoke any long-winded formal processes in order to exit them from the company.\n\nThe OTS also recommends that payments in the case of genuine redundancy would remain tax-free to a limit, and although this limit hasn’t been specified, it has been suggested that it could be a fixed sum or a multiple of statutory redundancy pay.\n\nJohn Taylor, Baker Tilly tax partner in the south, said: “These proposals will have an effect on the way some employers in the south deal with cases where termination payments are usually made.\n\n“If these new changes are introduced, it could end up being costly for employers, and with the potential for many more to find themselves caught up in the employment tribunal process.”", "source": "Business Magazine"}