{"published": "2015-09-10T16:33:00Z", "media-type": "Blog", "title": "Shorter Days", "id": "d2c3c330-f073-485c-a7ac-c471a5ec1b0d", "content": "Even though the autumnal equinox is a few weeks away, I'm already aware of the shorter days. When I get up early, the sun isn't up yet. And all too often, dusk has fallen before I complete my errands. And it will get worse in the months ahead.\rI find that the shorter days make me want to hibernate, so I have to adjust my routine a bit.\rIt's time to start leaving an outside light on when you go to work (if you don't have motion detection light) and to set a timer on an inside light so that you don't come home to a dark house.\rI hate waking up to darkness. It's a lot harder for me to get moving when it's still dark outside. So I try to do more of my morning chores in the evening, so I can afford to stay in bed a bit longer.\rYou may need to alter your routine so that you can use the limited daylight as efficiently as possible. For example, do all of your indoor chores (laundry, ironing, unloading the dishwasher, vacuuming, etc.) at night. That way, you have the limited light before and after work and on the weekends to do outdoor chores and to get out and enjoy the fall weather.\rAs the light grows less, I find it harder to make time to run outside. I just don't have much daylight after work and I need to walk the dog. (Picking up dog poop by flashlight is not fun.) So, I will sometimes do a short run (interval training anyone?) immediately after work so  can get home when there's still twilight. I save my longer runs for weekends. Or I have to get myself to the gym since it's always well-lit there.\rUltimately, there won't be enough light for even a short evening run or dog walk. That makes it a good idea to invest in a good flashlight or head lamp, a reflective vest, and other safety equipment.\rIf you organize your time well, you can make the best possible use of these shorter days -- even if you wish you could hibernate!", "source": "The Elf Blog"}