{"published": "2015-09-11T00:14:35Z", "media-type": "News", "title": "Hunting season brings focus on gun safety", "id": "9e98fdbc-1511-43d0-aaa6-d8c56565efff", "content": "Logging in from multiple locations may be the cause.\n\nPosted: Thursday, September 10, 2015 3:28 pm Hunting season is upon us and within the week will be in full swing. That idea may never be more obvious, at least in certain rural areas, than Saturday at noon with the opening of dove season.\n\nThe continuous coughing of shotguns in the dove fields should remind everyone that some game season will be open for the next eight months or so.\n\nI make these statements with this exact idea in mind: With the right to hunt and with the right to bear arms also comes the responsibility to handle guns safely.\n\nThe standard rules apply:\n\nn Treat every gun as if it’s loaded.\n\nn Point a gun only where intended (control the muzzle of the gun).\n\nn Identify a target and what’s around it.\n\nn Shoot with a backstop in the background, especially with a rifle or a pistol.\n\nThis list is not all-inclusive, and hunters should logically take into account every scenario for safety before pulling a trigger. They should be versed in all phases of gun safety.\n\nSome rules apply more to hunter behavior than to actual gun handling. For example, in a crowded dove field Saturday, will the shooting rules be posted in a conspicuous place?\n\nAre hunters allowed to randomly choose spots or are they strategically placed in safe increments and at safe angles? Is a system in place for hunter movement, including the retrieval of birds? Will hunter orange be required by the landowner even if it’s not required by law?\n\nOf course, the state requires that hunters of a certain age, those born on or after Aug. 1, 1977, must be certified through an approved hunter education program. The options, either a traditional face-to-face class or an online program, are discussed at www.outdooralabama.com, the official website of the Alabama Department of Conservation and Natural Resources. Follow the links or go directly to outdooralabama.com/hunter-education-alabama. A schedule for traditional classes is found there as well as links to online courses. The traditional programs are free; the online ones will cost at least $25.\n\nRegardless of which option you choose, the price for being better educated about gun safety is minimal. It’s not just smart. Handling weapons safely is an innate responsibility that goes along with hunting and with gun ownership.\n\nGreg McCain is a freelance writer and retired English teacher from Russellville. Contact him about this column or with other outdoors-related information at gmccainoutdoors@gmail.com.\n\nPosted in Florence, Outdoors, on Thursday, September 10, 2015 3:28 pm. Or, use your linked \n\nNews Galleries Sports Galleries All Galleries Tweet your comments to #ddopinion\n\nTotal Votes: 7 \n\n©", "source": "Decatur Daily"}