{"published": "2015-09-21T13:10:00Z", "media-type": "News", "title": "(REOPEN DEL 38)", "id": "5449fc50-0ce3-44c9-ba6f-5f5a7f8df549", "content": "Mani Ram was first to be taken out through  m deep\nand 1.2 m diameter tunnel after 211 hours and 47 minutes\nfollowed by Satish Tomar who came out eight minutes later. \n\nThe three employees of Himalayan Construction\nCompany(HCC) were trapped at Tehri, 13 km from Bilaspur, on\nthe night of September 12 and round the clock rescue\noperations were conducted by engineers of HCC, SJVNL, HP Power\nCorporation, NHAI , NDRF and the district administration. \n\nBoth Tomar and Ram were in high spirits and waved to the\npeople and were taken to hospital in the ambulance along with\na team of doctors. \n\nThey wore goggles as sudden exposure to light after nine\ndays in a dark and dingy tunnel could have caused damage to\neyes. \n\nThree NDRF team members including a sub-inspector entered\nthe main tunnel but could not reach the trapped employees as\nthe tunnel was not wide enough and was zig-zag. The rescue\noperations were again impeded and finally the tunnel had to be\nwidened to bring out the trapped persons. \n\nFurther the water level in the tunnel was rising and\npumps were deployed to drain out the water before taking the\nfinal leap. \n\nThe rescue managers decided not to put the thin iron\ncoating and took extra precautions to ensure no injury was\ncaused while taking out the trapped persons from the tunnel. \n\nThe construction company had completed work upto 275 m of\nthe 1.4 km long tunnel and the employees were trapped at 70 m\nfrom the entry point. The tragedy struck at the time of change\nof evening shift and only three employees were in the tunnel\notherwise number of persons trapped in the tunnel could be\nbetween 20 and 25. \n\n\"It was a massive operation and we had put all our\nresources and sought help from Border Roads Organisation,\nNational Highway Authority of India, Army, SJVN, HPPCL and\nNational Disaster Response Force (NDRF) and finally two\nemployees have been saved,\" said D D Sharma, Special\nSecretary(Disaster Management and revenue).", "source": "Sify"}