{"published": "2015-09-22T13:55:36Z", "media-type": "News", "title": "Volga Dnepr’s new air cargo carrier set for take-off and eyes partnership with ABC", "id": "7ce9c709-a7a3-4bb7-b70c-f97d3ed179db", "content": "Cargologicair, the new all-freighter airline set up in the UK by Volga Dnepr Group, is expected to be operating by mid-November, using an AirBridge 747-400F, according to a source. \n \nWhile there still appears to be a veil of secrecy over the operation, Denis Ilin, executive president of sister airline AirBridgeCargo (ABC), confirmed that the two carriers will be working in partnership. \n \n“Cargologicair will present ABC with a significant opportunity to extend our network beyond what we can do alone,” he told The Loadstar . “It will be a good vehicle for interlining.” \n \nMr Ilin added that ABC had made no secret of the fact it is looking for partnerships with EU-registered airlines. Most notably, it has continued to state its interest in Martinair, on either a partnership level or as a stakeholder, but had been rebuffed by Air France-KLM, which has said it wants to focus on internal issues at the moment. \n \n“We are looking at European carriers,” said Mr Ilin. “There are some routes we are unable to operate, so we will ask Cargologicair if it will be able to instead.” \n \nWhile the new airline is incorporated at Stansted, sources indicate that it is in talks to operate out of Manchester, from where it is expected to fly to the US, although this has not been confirmed. \n \nHowever, one air cargo executive questioned whether a transatlantic route would be financially viable. \n \n“It just doesn’t pay. I would expect to see flights to Africa perhaps. \n \n“A UK AOC has good credibility and good traffic rights, but it’s a bit pricey,” he added. \n \nMr Ilin says that even once Cargologicair (CLA) is flying, it will take some time for it to develop a partnership with ABC, while ABC continues to be interested in another partnership. \n \n“We have a network from Amsterdam and we see mutual benefits with a Dutch national carrier which can fly to Africa and Latin America. Those routes are of interest, but the opportunities and traffic rights of ABC are limited.” \n \nHe added, however, that even with limited rights, ABC “can’t go everywhere. It’s physically impossible.” \n \n“But our existing network complements Martinair very well. It’s a natural choice. If not Martinair, then CLA is a longer way to achieve this. But we need a partnership with a European-registered carrier.” \n \nMr Ilin added: “We are open to partnerships with other airlines, and I’ve said so publicly. But I can’t get in touch with all of them. And it’s not that urgent, it’s just something we’d like to look at.” \n \nSee also, on People: Cargologicair recruitment drive under way as CEO and CCO join \n \nLater this week: more on ABC", "source": "Loadstar"}