{"published": "2015-09-07T14:47:21Z", "media-type": "News", "title": "Hughes admits she tested positive for substance", "id": "9b9f196b-b963-4588-9873-b56f0bfcd7e0", "content": "Clara Hughes, a six-time Olympic medallist for Canada in speed skating and cycling, shocked the country Sunday night by admitting she tested positive for the banned substance ephedrine back in 1994. \n \nThe 42-year-old made the stunning revelation on CBC’s The National in advance of Tuesday’s release of her memoir Open Heart, Open Mind. \n \n“I do know that I didn’t cheat,” she said. “I can look anyone in the eye, and I can look myself in the eye and know that that is my truth.” \n \nHughes is one of Canada’s most beloved athletes and a member of the Order of Canada. On top of her sporting achievements, she is also the public face of the campaign to speak out about depression and other mental illnesses. \n \nThe positive test came at the 1994 world cycling championships in Sicily where Hughes came in a disappointing fourth place in the time trial after finishing first in the event all year long. \n \nA few months after the world championships, Pierre Hutsebaut, Canada’s national team director, called to break the news. \n \n“I didn’t know what ephedrine was,” she said. ”I asked him what it was and he said, `it’s a stimulant and it’s found in cough medicine. Did you take any cough medicine or cold medication?’ And I hadn’t… \n \n“You can’t take anything that’s going to help you get over a cold or a lung infection or pain medication. You can’t take that as an athlete.” \n \nHughes said she has no idea how the ephedrine got in her sample, although she knows some scoff at that explanation. \n \nFor she once did the same when she heard athletes offer similar protests. \n \n“I’ve also never been publicly outspoken about people who do test positive, because you never know,” says Hughes, who now lives in Canmore, Alta. \n \nShe quietly served a three-month suspension during the off-season and said she was advised to keep her mouth shut. \n \nBehind her trademark smile, Hughes did just that until Sunday night, some 21 years after it all went down. \n \n“There’s a big risk,” she said, about going public. “This is not something I have to talk about. This could have been a secret to my grave, but I just felt that I couldn’t not. \n \n“People are going to judge me over this. There are people that are going to say that everything I did, I cheated. And I can’t control that.” \n \nOn Sunday night, Cycling Canada issued a statement saying Hughes contacting the organization in late August and warned of the revelation coming out in her book. \n \n“Cycling Canada cannot condone how this matter was handled at the time by any of those involved,” the statement said. “Regardless of the practices of the day, Cycling Canada believes in full, fair and open disclosure of all doping offences. We remain fully committed to the principles of fair play and rigid compliance with the WADA (World Anti-Doping Agency) code. \n \n“Cycling Canada is proud of its current role as a leader in the anti-doping movement and remains committed to learning from the mistakes of the past, so we don’t make them again.” \n \nHughes won two bronze in road cycling at the 1996 Summer Olympics in Atlanta and captured four medals (one gold, one silver and two bronze) over the course of three Winter Olympics.", "source": "Cold Lake Sun"}