{"published": "2015-09-04T06:32:33Z", "media-type": "News", "title": "Sport24.co.za | No excuses for wilting in heat: Federer", "id": "1eae168b-4f5d-4921-92b4-2be099b07372", "content": "New York – Roger Federer insists there are no excuses for players wilting in the US Open heat after the number of retirements reached a Grand Slam record 12. \n \nAfter 10 men quit in the first round, Jack Sock of the United States and Uzbekistan’s Denis Istomin retired on Thursday. \n \nDespite temperatures rocketing to over 30 degrees over the first four days, in harness with crushing levels of humidity at Flushing Meadows, Federer offered no sympathy. \n \n“We’ve been here in North America for some time. It’s not like, all of a sudden, hot. I mean, it was more on the warmer side, but it’s not like impossible, to be quite honest. Really no excuse for that,” said the 34-year-old. \n \n“I think everybody should be well-prepared. I know we don’t play many best-of-five-set matches all the time, so of course the body can react funny once you exceed the two-and-a-half to three-and-a-half hours of play. \n \n“Maybe some guys already came in too tired, whatever it was. I think you have to analyze case by case. But I think other players should be so fit that heat really shouldn’t matter at that point, the ones we’ve been playing in.” \n \nThe 22-year-old Sock was leading Belgium’s Ruben Bemelmans 6-4, 6-4, 3-6, 1-2 when he started cramping and was forced to retire. \n \nSock, the 28th seed, then collapsed on court, where he was treated with ice packs and cold towels by US Open medical staff before being carried off to the shade of the Grandstand Court. \n \nJust hours later, Istomin also called it quits on Court Seven against Austrian 20th seed Dominic Thiem, who was 6-4, 6-4, 1-0 up at the time. \n \nTwo women also retired in the first round, taking the total for this year’s US Open to 14. \n \nThe carnage led again to suggestions that the men, who play the best of five sets, should be accorded the same protection as women players. \n \nThe WTA allows a 10-minute break between the second and third sets of women’s matches when the mercury bursts through 30.1 degrees. \n \nThird seed Andy Murray, who battled through five sets to beat France’s Adrian Mannarino on Thursday, believes there is scope for men to have a similar time-out. \n \n“When it’s extremely hot and humid, it helps to have that break,” said Murray of the 10-minute rest that women players take between the second and third sets when the temperature goes above 30.1 degrees. \n \n“I don’t know exactly what it’s for. But I guess you get the chance to sort of go off and change, get under a cold shower if you want to.” \n \nThis entry passed through the Full-Text RSS service – if this is your content and you’re reading it on someone else’s site, please read the FAQ at fivefilters.org/content-only/faq.php#publishers. \n \nSource:: 24 sport", "source": "The World 247.com"}