{"published": "2015-09-10T11:21:06Z", "media-type": "News", "title": "Pluristem Provides Corporate and Financial Highlights for Fiscal Year 2015", "id": "459b8768-2c1d-4089-8166-ea7c4350a747", "content": "HAIFA, Israel, Sept. 10, 2015 (GLOBE NEWSWIRE) -- Pluristem Therapeutics Inc. (Nasdaq:PSTI) (TASE:PSTI), a leading developer of placenta-based cell therapy products, reported yesterday financial results for its fiscal year ended June 30, 2015, and provides corporate and financial highlights for fiscal year 2015.\n\n\"During fiscal 2015 we executed our strategy to shorten the time to commercialization for PLX-PAD, our lead product, and significantly advanced the development of PLX-R18, our second product,\" said Zami Aberman, Pluristem's Chairman and CEO.\n\n\"We achieved a major milestone when our clinical development program for PLX-PAD in critical limb ischemia (CLI) was selected for Europe's Adaptive Pathways pilot project. Only a handful of programs were chosen worldwide. Pending a single successful Phase II trial, PLX-PAD could enter the European market in 2018 with conditional approval to treat a type of CLI. Another important milestone was safety clearance of PLX-PAD cells for use in clinical trials in Japan.\"\n\n\"We also advanced our U.S. program for PLX-R18 in the treatment of incomplete hematopoietic recovery following hematopoietic cell transplantation. This year we also announced an important new clinical finding from our Phase I/II trial in muscle injury, suggesting that treatment with PLX-PAD could also significantly strengthen muscle force in the contralateral leg.\n\n\"During fiscal 2015, we strengthened our valued partnerships with United Therapeutics, Cha Bio and the U.S. National Institutes of Health, and finished the fiscal year with a robust balance sheet. We look forward to a very productive fiscal 2016 on all fronts,\" Mr. Aberman concluded.\n\nClinical and Corporate Highlights for Fiscal Year 2015 Include:\n\nDuring fiscal 2015, Pluristem raised net cash of $17.2 million from issuance of common stock, and from exercises of outstanding warrants and options. The fundraise marked the accomplishment of a goal to increase US institutional ownership. In addition, the Company was awarded $2.9 million grant from the Office of the Chief Scientist (OCS) of Israel's Ministry of Economy to support R&D programs, as well as a \"Smart Money\" grant from Israel's Ministry of the Economy to support marketing activities in Japan. As of June 30, 2015, Pluristem had $53.1 million in cash and cash equivalents, bank deposits, restricted deposits and marketable securities. The Company expects this will support its activities for the next two years.\n\nAbout Pluristem Therapeutics Pluristem Therapeutics Inc. is a leading developer of placenta-based cell therapy products. The Company has reported robust clinical trial data in multiple indications for its patented PLX (PLacental eXpanded) cells. The cells release a cocktail of therapeutic proteins in response to inflammation, ischemia, hematological disorders, and radiation damage. PLX cell products are grown using the Company's proprietary three-dimensional expansion technology. They are off-the-shelf, requiring no tissue matching prior to administration.\n\nPluristem has a strong intellectual property position; Company-owned, GMP-certified manufacturing and research facilities; strategic relationships with major research institutions; and a seasoned management team.\n\nSafe Harbor Statement\n\nThis press release contains forward-looking statements within the meaning of the \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995 and federal securities laws. For example, we are using forward-looking statements when we discuss PLX-PAD's potential to enter the European market in 2018 with conditional approval to treat a type of CLI, when we discuss our preparation for submission of an Investigational New Drug application to FDA for PLX-R18 in the treatment of incomplete hematopoietic recovery following hematopoietic cell transplant, when we discuss PLX-R18's potential to improve the outcome of bone marrow transplantation, and when we discuss our expectation that our current cash and cash equivalents, bank deposits, restricted deposits and marketable securities will support its activities for the next two years. These forward-looking statements and their implications are based on the current expectations of the management of Pluristem only, and are subject to a number of factors and uncertainties that could cause actual results to differ materially from those described in the forward-looking statements. The following factors, among others, could cause actual results to differ materially from those described in the forward-looking statements: changes in technology and market requirements; we may encounter delays or obstacles in launching and/or successfully completing our clinical trials; our products may not be approved by regulatory agencies, our technology may not be validated as we progress further and our methods may not be accepted by the scientific community; we may be unable to retain or attract key employees whose knowledge is essential to the development of our products; unforeseen scientific difficulties may develop with our process; our products may wind up being more expensive than we anticipate; results in the laboratory may not translate to equally good results in real clinical settings; results of preclinical studies may not correlate with the results of human clinical trials; our patents may not be sufficient; our products may harm recipients; changes in legislation; inability to timely develop and introduce new technologies, products and applications; loss of market share and pressure on pricing resulting from competition, which could cause the actual results or performance of Pluristem to differ materially from those contemplated in such forward-looking statements. Except as otherwise required by law, Pluristem undertakes no obligation to publicly release any revisions to these forward-looking statements to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events. For a more detailed description of the risks and uncertainties affecting Pluristem, reference is made to Pluristem's reports filed from time to time with the Securities and Exchange Commission.\n\nCONTACT: Pluristem Therapeutics Inc.\n\nKarine Kleinhaus, MD, MPH\n\nDivisional VP, North America\n\n1-914-512-4109\n\nkarinek@pluristem.com", "source": "Consumer Electronics Net"}