{"published": "2015-09-23T12:20:50Z", "media-type": "News", "title": "Atmel Ships World's Lowest Power Bluetooth Smart Solution in Volume Production", "id": "7ba5dad0-32fb-41f8-9c38-0b63e4922db9", "content": "SOURCE Atmel Corporation\n\nTaking Internet of Things and Wearable Applications to a New Level, Atmel SmartConnect Bluetooth Platform Solutions Deliver Industry's Lowest Power, Smallest Footprint and Most Integrated System Solution\n\nSAN JOSE, Calif. \n\nPushing the limits of space constrained areas, the Atmel SmartConnect Bluetooth Smart BTLC1000 solution footprint, in an unparalleled 2.2mm X 2.1mm Wafer Level Chipscale Package (WLCSP), is significantly smaller than what is available on the market today. The extremely tiny, low-power solution takes the rapidly growing IoT and wearable markets to the next level in power consumption and form factor enabling extraordinary applications for smart wearables such as fitness trackers and medical devices, along with human Interface devices, asset trackers, beacons and much more. The new solutions support beacons and other application standards for leading smartphone operating systems.\n\nThe BTLC1000 is an ultra-low power Bluetooth SMART system-on-a-chip (SoC) with an integrated Atmel | SMART ARM® Cortex®-M0 MCU and Bluetooth transceiver. The solution can be used as a Bluetooth Low Energy (BLE) link controller that connects as a companion to any Atmel AVR or Atmel | SMART MCU. It can also be used as a standalone applications processor with embedded BLE connectivity and external memory for a variety of applications like beacons, mobile and human interface devices. Also available as a production-ready and fully-certified module for FCC ETSI/CE and IC regulations, the BTLC1000 solution significantly facilitates product design and reduces overall time-to-market. \n\nAtmel's BTLC1000 can be powered by a number of different battery types, ranging from coin cell, AA and AAA batteries to Lithium polymer batteries, without the need for external power management circuitry. The BTLC1000 uses an innovative radio and DSP architecture that delivers extremely low power consumption along with high performance. The BTLC1000 provides a cost-effective solution for many Bluetooth Smart-based applications by integrating the Bluetooth Low Energy Radio and Baseband with an ARM® Cortex®-M0-based MCU. The need for very few external components minimizes the total system solution cost.\n\nTo accelerate a designer's development, an all-inclusive Atmel BTLC1000 XSTK starter kit is available today to evaluate the Atmel BTLC1000 with the Atmel | SMART ultra-low-power SAM L21 Xplained PRO host MCU evaluation board. The BTLC1000 XPRO extension board can also be ordered individually and can be plugged into any of the supported Atmel host MCU Xplained boards to easily add Bluetooth Smart connectivity.\n\nAvailability\n\nProduction devices are available now. To purchase, please go to: http://www.atmel.com/devices/ATBTLC1000.aspx. \n\nAtmel's ATBTLC1000A-MU-T SoCs are available for $1.59 USD \n\nAbout Atmel \n\nAtmel Corporation (NASDAQ: ATML) is a worldwide leader in the design and manufacture of microcontrollers, capacitive touch solutions, advanced logic, mixed-signal, non-volatile memory and radio frequency (RF) components. Leveraging one of the industry's broadest intellectual property (IP) technology portfolios, Atmel is able to provide the electronics industry with intelligent and connected solutions focused on the industrial, consumer, communications, computing and automotive markets.\n\n©2015 Atmel Corporation. All Rights Reserved. Atmel®, Atmel logo and combinations thereof, and others are registered trademarks or trademarks of Atmel Corporation or its subsidiaries. ARM® and Cortex® are registered trademarks of ARM Ltd. Other terms and product names may be trademarks of others.\n\nPress Contact: \n\nAgnes Toan, Sr. \n\nPhoto - http://photos.prnewswire.com/prnh/20150923/269683 \n\nLogo - http://photos.prnewswire.com/prnh/20120530/SF15228LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/atmel-ships-worlds-lowest-power-bluetooth-smart-solution-in-volume-production-300147603.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WTRF"}