{"published": "2015-09-28T04:00:00Z", "media-type": "News", "title": "The DOL’s Fiduciary Rule: What We Can Learn from the U.K.", "id": "daf5b00c-c5a1-4763-9f4b-0c2f8dafecaf", "content": "The Department of Labor’s proposed fiduciary rule has led to a furious debate over whether low- and middle-income Americans will be deprived of financial advice. Three years ago the U.K. made similar changes affecting the delivery of financial advice, and those changes were studied in detail. I’ll assess what we can learn from the British studies and give my views on additional steps the U.S. should take to improve financial outcomes. \n \nThe DOL proposal \n \nThe fiduciary rule requires that investment recommendations be in the client’s best interest rather than meeting a weaker standard, such as being “suitable” for a particular client. The DOL proposes expanding ERISA’s fiduciary rules to cover a broader range of retirement advice. Rollovers from 401(k)s and IRAs are a particular area of its focus because today such transactions are rarely covered under fiduciary rules. Advisor compensation is a specific target of the proposed rules, which would prohibit advisors from receiving sales commissions unless the advisor and client both sign a “best interest contract exemption” (BICE). This exemption allows commissions, but requires that advisors’ product recommendation be made “without regard” to compensation. \n \nMany in the financial services industry have argued that the BICE rules are too cumbersome and the effect will be to eliminate commissions and create a shift to fee compensation. They further argue that the demise of commission-based sales will result in the advice business shifting exclusively to upscale clients, and low- and middle-income segments will lose out. \n \nThe U.K. approach \n \nIn 2006 the United Kingdom’s Financial Services Authority (FSA) established a Retail Distribution Review (RDR) to evaluate how advice was being provided, and at the beginning of 2013 the recommendations of the review were implemented. The biggest change was a banning of advisors receiving commissions, requiring that clients be charged fees. Advisors were also required to make it clear whether they were offering independent advice or restricted advice, i.e., advising on products from a single provider. Finally, the qualifications for practicing as a financial advisor were made more stringent. \n \nSimilar to the U.S., concerns were raised that the RDR changes would have an adverse impact on low- and middle-income individuals. The U.K. has now had a few years to assess the effects. It’s still too early to gauge full impacts in the U.K., but the research so far can still provide useful insights. Professor Andrew Clare of London’s Cass Business School has been the principal author of two studies: “The Guidance Gap” and “The Impact of the RDR on UK’s Market for Financial Advice.” Both studies involved interviews with financial industry executives and surveys of financial advisors and individuals. \n \nFindings \n \nThe first study found clear evidence that the RDR would increase the “guidance gap,” or the numbers of individuals operating without financial advice but lacking confidence to be do-it-yourself investors. They estimated that 43 million of the 50 million U.K. adults would fall in this guidance gap because of insufficient assets, an unwillingness to pay the level of fees advisors charge and advisors being driven out of the business (higher qualifications, loss of commission charging). \n \nSeparate surveys of advisors and individuals showed stark disconnections. Pre-RDR, only 50% of individuals realized that the cost of commissions was passed onto them. There were 29% who thought the advice was free even though they realized advisors received commissions, while 9% thought the advisors were salaried. Only 19% of those individuals currently saving and investing said they would be likely to seek financial advice in the future if charged explicit fees for the advice. The average hourly fee advisors planned to charge in the post-RDR world was £165 ($265), whereas the vast majority of individuals surveyed felt that an appropriate fee would be less than £50 ($8", "source": "Advisor Perspectives"}