{"published": "2015-09-30T03:59:32Z", "media-type": "News", "title": "Vietnamese movie named Best Film at international festival", "id": "7d048f40-12b2-4c5f-96d9-cf7c0e931f90", "content": "Beijing, September 30 (VNA) - Vietnamese movie Hoa Vang Tren Co Xanh (Yellow Flowers on the Green Grass) has won the best film award at the Silk Road International Film Festival in Fujian province, China. \n\nIt shares the Best Feature Film of the Year title at the second edition of the festival with Russian movie Puppet Syndrome and China's Saving Mr Wu. \n\nHoa Vang Tren Co Xanh is Victor Vu's latest movie, based on the novel Toi Thay Hoa Vang Tren Co Xanh (I See Yellow Flowers on the Green Grass) by best-selling author Nguyen Nhat Anh. \n\n\"After the screening in Fuzhou city, people came to me, held my hand and said the movie moved them because they saw their childhood in it,\" Director Vu told Tuoi Tre (Youth) newspaper. \n\n\"I'm glad to win the big prize. However, the most important thing is how the movie will be received when it is released in Vietnam next week. It's a simple movie and I hope it will be a significant gift to the audience,\" Vu said. \n\nYellow Flowers on the Green Grass is a state-commissioned film, produced by Vietnam's Galaxy Media and Entertainment and the Culture, Sports and Tourism Ministry's Cinematography Department. \n\nSet in the mid-1980s in rural Vietnam, the film follows the story of two young brothers who share everything, but compete for the affection of the same girl. \n\nThe nostalgic drama reveals the realities of life in Vietnam in that era, before the country's current economic boom began. \n\nThe movie will be released in Vietnam on October 2. \n\nLaunched in 2014, the second Silk Road International Film Festival was held from September 22 to 26. About 950 films from about 30 Silk Road countries, such as Russia, India, the Republic of Korea and Egypt, were submitted. \n\nIt was the first time an official competition section was formed, for which 24 entries were selected. \n\nThe Best Animation of the Year title went to Monkey King and Hero is Back, while In the Underground won the Best Documentary of the Year award. Hong Kong's Andy Lau won the Favorite - Male of the Year award and India's Swara Bhaskar won the Favorite - Female of the Year award.", "source": "Organization of Asia-Pacific News Agencies"}