{"published": "2015-09-09T05:07:37Z", "media-type": "Blog", "title": "MoI Officers: UAE Martyrs Embodied Glorious Tales of Sacrifice", "id": "14b145e3-3f77-4ba9-b6a3-5056fb61710a", "content": "Abu Dhabi, United Arab Emirates - Tuesday, September 8th 2015 [ME NewsWire]\n\nOfficers from the Ministry of Interior continued to express their pride towards the martyrs of the UAE, who died while defending the right and justice. They asserted that the UAE is proud of its martyrs, who have embodied the most glorious tales of sacrifice for their nation. They also stressed that their martyrdom is an honor that bestows pride upon the nation, it unifies the UAE in support of their leadership and in defense of their homeland, which takes pride of its brave sons and daughters..\n\nAli Khalfan: Bright Pages in Our History\n\nBrigadier Ali Khalfan Al Dhaheri, Director General of the Headquarters Affairs at Abu Dhabi Police said: “'You reap what you sow’; we have inculcated our people with national values, and now, through their sacrifice in defense of what is right, our sons and bothers, martyrs of the UAE, have given the most precious gift, and wrote their names with letters of light on the bright pages of the UAE history.”\n\nBrigadier Al Dhaheri prayed to God Almighty to shower the pure martyrs with his mercy, place them in heaven, and grant their families patience and solace.\n\nAl Hajiri: Examples of Sacrifice and loyalty\n\nBrigadier Staff Abdulaziz Ahmed Al Hajiri, Commander of the Special Security Forces expressed his deepest condolences to the families of the martyrs. He prayed to God Almighty to shower them with his mercy and grant them immortal life in heaven.\n\nHe said: “Our brave martyrs have set the ultimate example in sacrifice in defense of their homeland. They embody national cohesion by standing by their brothers against evil powers. They stood united, with a firm belief in their cause, determined to achieve a glorious victory.”\n\nAl Amimi: Honor and Dignity\n\nBrigadier Hamad Ajlan Al Amimi, Director General of the Federal Criminal Police at the Ministry of Interior said: “The bravery shown by the brave UAE servicemen on the battlefield is a clear testament of the authentic values and noble-mindedness that the founders of this glorious nation have instilled in their people, in defense of the nation against forces of evil and in support of the oppressed. In this spirit, we will certainly achieve victory, God willing.”\n\nBrigadier Al Amimi also expressed his deepest condolences to the families of the martyrs, praying to God Almighty to shower them with his mercy, reward them with paradise, and grant their families patience and solace.\n\nAl Farsi: UAE People and Leadership Stand United\n\nBrigadier Fares Al Farsi, Director General of Central Operations at the Ministry of Interior said: “The sacrifices made by the martyrs in the line of duty embody the cohesion among the UAE people, in defense of their nation and its achievements, standing untied against aggressors. They also embody the UAE’s humanitarian role in helping people in need both in war and peace.\n\nHe expressed his heartfelt condolences and most sincere sympathy to the families of the martyrs, praying to God Almighty to grant them heaven.\n\nBu Dhufaira: Bright Marks in History\n\nBrigadier General Dr. Saif Bu Dhufaira Al Ameri, Head of Police Judiciary at the Ministry of Interior prayed for the souls of the martyrs, asking God Almighty to reward them with paradise and to place them among the saints and righteous, and grant their families patience and solace.\n\nHe also asserted that the pure blood of the martyrs will be forever engraved in the hearts and minds of our people. Through their martyrdom, our proverbial martyrs reflect the ultimate love to the UAE and its people, and their determination to sacrifice their most valuable possession, their life, for the sake of their values and to defend the oppressed against evil.\n\nAhmed Nehkairah: Heroic Stance\n\nBrigadier Ahmed Mohammed Nehkairah, Head of Human Rights Department, Ministry of Interior said: “National service is a great honor, which reflects the values of giving, loyalty, and belonging to the UAE and its leadership. Our leadership spares no effort to make people happy, maintain safety and security of the UAE, and protect that national resources and cultural achievements that we leverage to bring happiness to all humans.”\n\nHe also expressed his pride for the heroic stance of the brave servicemen, and said that the UAE has sacrificed scores of its purest sons and men, who have died in a position that is no stranger to the people of the UAE, as they have laid down their lives to fulfill their scared duty in defense of truth and justice and in support of the oppressed. He added: “We are convinced that the Emirati heroes will carry out their mission to the end. We extend our deepest condolences and sincere sympathy to our country and to the families of the martyrs, praying to God Almighty to rest them in peace, to grant them mercy, and to place them in heaven among the saints and martyrs”.\n\nAl Ketbi: Our Martyrs’ Sacrifice in Defense of what is right and just\n\nBrigadier Mohammed Ghadir Al Ketbi, Deputy Director General of the Federal Criminal Police at the Ministry of Interior said that the martyrs have given us a lesson in sacrifice and loyalty, in defense of what is right and just. He expressed his pride for those martyrs who have made the finest examples of what it means to sacrifice one’s life and shed one’s blood to safeguard truth and justice. He prayed to God Almighty to shower them with his mercy and to accept them among his faithful servants. \n\nAbdul Hakim Al Suwaidi: A lesson in sacrifice\n\nBrigadier Abdul Hakim Al Suwaidi, Head of the Abu Dhabi Police Cases Affairs Department at the General Secretariat of the Office of H.H Deputy Prime Minister & Minister of Interior; praised the heroic sacrifices made by the righteous martyrs, to uphold truth and safeguard the homeland’s dignity.\n\nHe also said that the martyrs gave the world a lesson in sacrifice, and embodied the meaning of fighting to the end to provide assistance and ensure victory to our brethren. He expressed his heartfelt condolences and sympathy to the families of the martyrs, praying to God Almighty to bestow His mercy upon them and that their souls forever dwell in peace.\n\nAl Suwaidi: A national epic made by the martyrs\n\nColonel Saeed Abdullah Al Suwaidi, Director General, Anti-Narcotics Federal Directorate General at the Ministry of Interior said that the UAE has written a great national epic, which will remain engraved in the history of heroic actions. It was written with the blood of the virtuous martyrs of duty while defending truth, dignity, and legitimacy.\n\nHe expressed his sincerest condolences to the families of the martyrs, praying for God Almighty for the martyrs to rest in peace and to shower them with ample blessings in paradise.\n\nFor more information about:\n\nThe Ministry of Interior, please click HERE\n\nAbu Dhabi Police, please click HERE\n\nFollow us and check our Social Media feeds on: YouTube, Facebook and Twitter\n\nThe Arabic-language text of this announcement is the official, authoritative version. Translations are provided as an accommodation only, and should be cross-referenced with the Arabic-language text, which is the only version of the text intended to have legal effect.\n\nContacts\n\nThe UAE Minister of Interior's General Secretariat, Tactical Affairs and Security Media Department \n\nAbu Dhabi Police GHQ - Security Media\n\nChris Cron +971-(0)-50-987-1317\n\nE-mail: cron.media@hotmail.com\n\n\n\n ", "source": "Business News In Africa"}