{"published": "2015-09-01T12:53:51Z", "media-type": "News", "title": "GOL announces conclusion of USD 300 million Term Loan", "id": "bd8ebc65-cd11-4e63-a907-709803c7367c", "content": "SAO PAULO, Sept. 1, 2015 /PRNewswire/ -- GOL Linhas Aereas Inteligentes S.A. (BM&FBOVESPA: GOLL4 and NYSE: GOL), (S&P: B-, Fitch: B-, Moody's: B3), the largest low-cost and best-fare airline in Latin America, announced that on August 31, 2015, in compliance with CVM Instruction 358/2002, as amended (\"INCVM 358\"), hereby informs its shareholders and the market the following, in complement to the material fact published on July 10, 2015.\n\nOn August 31, 2015, our subsidiary Gol LuxCo S.A. (\"Gol LuxCo\") has entered into, acting as borrower, the \"Credit and Guaranty Agreement\" together with Morgan Stanley Senior Funding, Inc., (\"Morgan Stanley\"), acting as administrative agent and representative of the interests of the creditors, with an aggregate principal amount of U.S.$ 300,000,000 (three hundred millions US Dollars), with remuneration of 6.5 % per year and maturity date of five years (\"Credit Agreement\"). The Company and VRG Linhas Aereas S.A. (\"VRG\" and, together with the Company, the \"Guarantors\") granted personal guarantee in order to guarantee the fulfillment of the obligations assumed by Gol LuxCo under the Credit Agreement.\n\nBesides the guarantee granted by the Guarantors, Delta Air Lines, Inc. (\"Delta\") granted a backstop guaranty, in order to guarantee the fulfillment of the obligations assumed by Gol LuxCo under the Credit Agreement.\n\nIn order to guarantee the fulfillment of obligations assumed by Gol LuxCo, it was granted a personal guarantee by the Company and VRG and a pledge of ordinary shares issued by Smiles S.A. (\"Smiles\") and owned by the Company, as well as its economic rights.\n\nThe above transaction is part of the strategic transactions agreed by the Company and Delta, as disclosed in the material fact published by the Company on July 10, 2015.\n\nFor further information visit www.voegol.com.br/ir\n\nCONTACTS\n\nINVESTOR RELATIONS\n\nPhone: +55 (11) 2128-4700\n\nE-mail: ri@golnaweb.com.br \n\nCORPORATE COMMUNICATIONS\n\nPhone: +55 (11) 2128-4183\n\nE-mail: comcorp@golnaweb.com.br \n\nABOUT GOL LINHAS AEREAS INTELIGENTES S.A.\n\nGOL Linhas Aereas Inteligentes S.A. (BM&FBOVESPA: GOLL4 and NYSE: GOL), the largest low-cost and best-fare airline in Latin America, offers around 900 daily flights to 73 destinations, 17 international, in South America, the Caribbean and the United States, using a young, modern fleet of Boeing 737-700 and 737-800 Next Generation aircraft, the safest, most efficient and most economical of their type. The SMILES loyalty program allows members to accumulate miles and redeem tickets to more than 700 locations around the world via flights with foreign partner airlines. The Company also operates Gollog, a logistics service which retrieves and delivers cargo and packages to and from more than 3,500 cities in Brazil and six abroad. With its portfolio of innovative products and services, GOL Linhas Aereas Inteligentes offers the best cost-benefit ratio in the market. \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/gol-announces-conclusion-of-usd-300-million-term-loan-300135943.html\n\nSOURCE GOL Linhas Aereas Inteligentes S.A.", "source": "TickerTech.com"}