{"published": "2015-09-01T11:30:59Z", "media-type": "Blog", "title": "Review: Chris Evans’ ‘Before We Go’ Starring Alice Eve Is Like Dating Someone Who Only Talks About Their Ex", "id": "fa176154-554d-41da-a4f0-d9dffdb70d05", "content": "Mon Aug 31 18:48:00 EDT 2015 \n \n\n The plight of the actor-turned-director is an unpredictable one. The desire to tell your own story, direct and write or star in it (or sometimes take on all of those roles) is a attractive lure, and can turn out very well. But as Ryan Gosling learned at Cannes earlier this year with “ Lost River ,” ambition, if not matched by execution, can come at a steep critical cost. So credit to Chris Evans for keeping his goals modest with his directorial debut “ Before We Go ,” but unfortunately he can’t clear the low bar he sets for himself with this strained romantic drama that struggles desperately to be engaging, charming or relatable.  \n \nREAD MORE: Chris Evans On His Directorial Debut ‘Before We Go,’ Filming In New York, & ‘Avengers: Age Of Ultron’ \n \n\n  \nThings kick off with a pretty decent meet cute: in a rush to grab the last train to Boston from Grand Central Station, Brooke ( Alice Eve ) drops and breaks her cell in front of busking jazz musician Nick (Chris Evans). She’s already gone before he can flag her down, but he gets another shot to return her mobile when, having missed the train, she comes back to the main terminal. It’s very late, and with the doors being closed for the night, both are forced outside. Sensing that she’s a bit adrift, Nick becomes the Captain America of chivalry, and upon learning her purse was stolen, which included her wallet and credit cards, he’s determined to help her get home. And so follows one night in Manhattan, with Brooke and Nick becoming drawn to each other, while harboring secret pains from their past, that will start being healed over the next few hours together. \n \nEvans clearly aspires to make a breezy and relatable, Richard Linklater -esque walk-and-talk movie, but lacks the skills to make it feel natural. The script for the 89-minute film is somehow credited to four different writers ( Ron Bass, Jen Smolka, Chris Shafer and Paul Vicknair ) which might explain why the film feels so clumsy and leaden as it contrives to keep the more sensible solutions to get Brooke to Boston out of reach. Not only are her resources gone, but conveniently, Nick’s cell phone has just run out of power, one credit card is overdrawn, the other is expired, and he’s got a limited amount of cash in his wallet. But one thing he does have in spades is resourcefulness. \n \n\n \n“I’ve got an idea,” Nick says a handful of times in the film. Eager to avoid a wedding reception where he’ll face an ex-girlfriend that’s still the love of his life, and with Brooke on a ticking clock to get back to Boston by 7 AM before her husband returns from a business trip at 8 AM (for reasons revealed later), Nick openly says he wants to be a hero and does everything he can, within his meagre means, to make that happen. But it really leads to a series of not very amusing or appealing misadventures, designed to force Nick and Brooke to face the problems they are trying to put behind them or ignore, while also realizing the future may lie with each other. \n \n“ Before Sunrise ” is an obvious touchstone and influence on “Before We Go,” right down to a running device involving pretend phone calls (except Nick and Brooke call their past selves), but it severely lacks that film’s heart and soul. What made Linklater’s film(s) work so well, and the characters feel so real, was that we learned everything about them. Celine and Jesse’s journey through Vienna was partially about escaping their respective breakups, but their discussions centered on all the things people connect over—love, life, religion, philosophy—and made them complex, compelling people you wanted to spend time with and know more about. By contrast, Brooke and Nick are not even half as interesting. “Before We Go” is like going on a date with someone who only talks about their ex; indeed, much of Brooke and Nick’s time together is spent focused on people who have hurt them, so when we’re supposed to believe during the third act that they are being drawn to each other, it’s a bit mysterious why they find each other interesting, beyond having a mutual shoulder to cry on. Their passions, motivations, dreams and thoughts never surface to help suggest why there is something more to their brief nighttime odyssey. \n \n\n \nREAD MORE: Berlin Interview: Richard Linklater Talks Making ‘Before Midnight’ & The 14-Minute-Long Shot \n \nBut one thing they do talk about a lot is love and fate, fighting for love and finding love. And it’s here where the movie, without spoiling anything, is curiously old-fashioned. Brooke in particular comes to a conclusion about what she needs to do about her marriage that is not the empowering or romantic notion the screenwriters might think it is, but that may also be because the details of what’s happening between her and her husband are also both cliché and underdeveloped.  \n \nMeanwhile, when the script isn’t working, Evans turns towards the soundtrack and leans on indie rock when he can (and when the low-budget picture can afford it) to attempt to do some of the emotional lifting. But when those cuts includes overused or outdated choices like “Song For Zula” by Phosphorescent (see also “ The Amazing Spider-Man 2 ” and “ The Spectacular Now “) and Bloc Party ‘s “So Here We Are” (used on “ One Tree Hill ” twice, Katherine Heigl ‘s “ 27 Dresses “), not to mention a closing credit song by omnipresent soundtrack emotional shorthand Bon Iver . And it’s even more frustrating because the snatches of score by Chris Westlake , when used, are actually quite good and more effective than the safe indie rock selections. \n \n\n  \nThe final indignity committed by “Before We Go” is setting a movie in Manhattan that looks like it could’ve taken place anywhere. For a city that is alive late at night like no other, and offers endless possibilities for unique places for these characters to go, the screenwriters and Evans (perhaps due to budgetary reasons) keep most of the action on anonymous streets, and even less familiar bars (though hey, Cup And Saucer). We’re not sure who was doing the second unit work, but someone should’ve provided them with a tripod as the shots of the New York City skyline look mistakenly shaky, and we’re pretty certain it had nothing to do with the digital projection. \n \nIf there is anything Chris Evans can take away from “Before We Go,” it would be to treat the film as a tremendous learning experience. Making a good film requires more than simply aping the structure and superficial qualities of better movies, and that there is much to be learned by digging deeper into the technical and emotional mechanics of what makes them work. Otherwise, you end up with an effort like this: a movie so firmly convinced it has all the moving parts, it never investigates whether they work well together. While Nick and Brooke might walk away from the evening wondering if those few hours together stoked something that’s real, for the audience, those 89 minutes will feel like an eternity that they’ll be ready to be divorced from. [D] \n \nThis is a reprint of our review from the 2014 Toronto International Film Festival. \n  \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n  \nThis article is related to: Before We Go, Chris Evans, Alice Eve, Reviews, Review \n   \n\n The Playlist", "source": "NextNewMovies"}