{"published": "2015-09-29T07:09:03Z", "media-type": "News", "title": "Warp 9 Completes Name Change to CloudCommerce", "id": "1e53d5a8-5bff-499b-8ec5-3189b5109489", "content": "Warp 9, Inc. (OTCQB: WNYN), a leading provider of cloud-driven e-commerce and mobile commerce solutions, today announced the completion of its corporate name change from Warp 9, Inc. to CloudCommerce, Inc., effective immediately. The new stock symbol for the company will be: (OTC: CLWD). The company also launched a new corporate website at: http://www.CloudCommerce.com. \n\n\"We previously announced our strategy to acquire profitable companies in the growing online commerce industry,\" stated Andrew Van Noy, CEO of the company. \"We believe our new name better reflects our new plan and will help us integrate a number of strategic subsidiaries under the CloudCommerce brand.\" \n\nVan Noy continued, \"We are currently underway with closing our first acquisition, Indaba Group, which has offices in Denver and the U.K. Our next step will be to aggressively seek other companies to acquire and consolidate into a large global provider of cloud-driven e-commerce and mobile commerce solutions. I have traveled throughout the country and have met with the management teams of a substantial number of target companies, many of whom have expressed interest in our strategy.\" \n\nThrough its wholly owned subsidiaries, CloudCommerce will provide online merchants and leading brands with complete solutions for successfully conducting business with customers anytime, anywhere, and on any device. CloudCommerce will focus intently on four main areas to deliver exceptional value to customers: Engaging Frontend Design, Robust Backend Integration, Effective Digital Marketing & Analytics, and Complete Solutions Management. \n\nTotal worldwide business-to-consumer (B2C) e-commerce sales were $1.5 trillion in 2014, and are projected by eMarketer to grow to $2.4 trillion by 2017. B2C sales in the United States are projected to be almost $500 billion by 2018. Additionally, business-to-business (B2B) e-commerce sales will grow to $6.7 trillion by 2020. \n\n\"Given this tremendous market opportunity, we believe our new acquisition strategy will better serve our customers and create significant and lasting value for our shareholders,\" Van Noy concluded. \n\nAbout CloudCommerce \n\nCloudCommerce, Inc. is a global provider of cloud-driven e-commerce and mobile commerce solutions. Through our wholly owned subsidiaries, we provide online merchants and leading brands with complete solutions for successfully conducting business with customers anytime, anywhere and on any device. Whether it is selling products or services online or making business processes available on the cloud, we deliver solutions that maximize user experience with real-time integration to enterprise applications. We focus intently on four main areas to deliver exceptional value to our customers: engaging frontend design, robust backend integration, effective digital marketing and analytics, and complete solutions management. To learn more about CloudCommerce, please visit http://www.CloudCommerce.com. \n\nSafe Harbor Statement \n\nMatters discussed in this press release contain statements that look forward within the meaning of the Private Securities Litigation Reform Act of 1995. When used in this press release, the words \"anticipate,\" \"believe,\" \"estimate,\" \"may,\" \"intend,\" \"expect\" and similar expressions identify such statements that look forward. Actual results, performance or achievements could differ materially from those contemplated, expressed or implied by the statements that look forward contained herein, and while expected, there is no guarantee that we will attain the aforementioned anticipated developmental milestones. These statements that look forward are based largely on the expectations of the Company and are subject to a number of risks and uncertainties. These include, but are not limited to, risks and uncertainties associated with: the impact of economic, competitive and other factors affecting the Company and its operations, markets, product, and distributor performance, the impact on the national and local economies resulting from terrorist actions, and U.S. actions subsequently; and other factors detailed in reports filed by the Company. \n\nFOR FURTHER INFORMATION PLEASE CONTACT: \n\nMedia Contact: \n\nMatthew Bretzius FischTank PR and Marketing matt@FischTankPR.com \n\nCorporate Communications: \n\nZack Bartlett Tel: 805-964-3313 Email: zack@cloudcommerce.com \n\nSOURCE: CloudCommerce, Inc.", "source": "Individual.com"}