{"published": "2015-08-17T13:00:45Z", "media-type": "Blog", "title": "Double Chocolate Chip Caramel Cookies", "id": "ed618d17-73db-4a01-8b57-cd8d09bafefb", "content": "We’re gearing up for another cross country flight next week and we need sustenance!! This time around it comes in the form of Double Chocolate Chip Caramel Cookies!\nThomas and I are heading to Germany in a week! It will be his first time to Europe and I’m pumped to bring him back to my kinda-sorta home! We spent a decent amount of time in Germany growing up because that’s where my family is from. We’ll be running around Southern Germany for 10 days but before we get there we have a loooooooong flight. In order to make it through without losing our minds, I’ll be bringing Double Chocolate Chip Caramel Cookies. It’s a take on my favorite trail mix which combines almonds, chocolate and little chocolate covered caramels – but I’ve turned them into cookies because it’s the right thing to do! Made with chocolate chips, chopped up caramels and Oven Roasted Sea Salt Blue Diamond Almonds and then dusted with Maldon sea salt for an extra punch of flavor – these really can’t be beat!\nPrint\nDouble Chocolate Chip Caramel Cookies\nIngredients2 1/4 cups all-purpose flour1/2 cup cocoa powder1 teaspoon baking soda1/2 teaspoon salt1 cup butter, softened1 cup packed brown sugar3/4 cup granulated sugar1 teaspoon vanilla extract2 large eggs1 ½ cup dark chocolate chocolate chips½ cup caramel bites1/2 cup Oven Roasted Sea Salt Blue Diamond Almonds, choppedMaldon salt for dusting\nInstructionsPreheat oven to 375° F.Combine flour, cocoa, baking soda and salt in a small bowl. Beat butter, brown sugar, granulated sugar and vanilla extract in a large mixing bowl until creamy. Beat in eggs for about 2 minutes or until light and fluffy. Gradually beat in flour mixture. Stir in chocolate chips, caramel bites and chopped almonds. Drop by rounded tablespoon onto parchment lined baking sheets and dust with Maldon salt.Bake for 8 to 10 minutes or until cookies are puffed. Cool on baking sheets for 2 minutes; remove to wire racks to cool completely.Enjoy immediately, or store in an airtight container in the freezer for up to 3 weeks.\n3.0http://whatsgabycooking.com/double-chocolate-chip-caramel-cookies/\nPhoto by Matt Armendariz / Food Styling by Adam Pearson / Recipe by What’s Gaby Cooking** This post is brought to you by Blue Diamond Almonds. All content, ideas, and words are my own. Thanks for supporting the sponsors that allow me to create new and special content like this for What’s Gaby Cooking**", "source": "What's Gaby Cooking"}