{"published": "2015-09-10T03:24:16Z", "media-type": "News", "title": "After tough year, Cinco Ranch kicker delivers game-winning heroics", "id": "10ff07dc-acb3-47cd-9829-496743fd98bb", "content": "Donny Smith disregarded the fact a lot of the text messages were coming from unknown numbers. \n\nA few minutes earlier, his 25-yard kick sailed through the Berry Center uprights with no time left on the clock. He won Cinco Ranch's season opener against Cypress Ranch two weeks ago, and teammates, friends and fans - including those he didn't know by their phone numbers - wanted to show their gratitude. \n\nSmith, who had an illness that cost him his junior year of football and nearly missed a chance to play in the state soccer tournament, took it all in. Chances like these don't come around too often. \n\nThen another one did. \n\n\"To be quite honest, I never came down (from cloud nine),\" said Smith, whose 41-yard field goal with three seconds left Friday lifted Cinco Ranch to a 30-27 win over Jersey Village. \"At school, when anyone saw me, they would say, 'Oh, what's up, Mr. Clutch?' or 'What's up, Mr. Cinco?' \n\n\"I'd be walking down the halls, and people I've never seen before knew me and were giving me congratulations.\" \n\nAs good as the game-winners felt in the moment, getting there was just as good for the senior. \n\nSmith kicked for Cinco Ranch as a sophomore but couldn't do anything last fall when he came down with mononucleosis, which eventually affected his liver. All he could do was watch. \n\nCinco Ranch won nine games and made the playoffs for the ninth year in a row. The team's first loss was to Jersey Village, and it came on a field goal - Jordan Henderson made the 25-yarder as time expired. \n\n\"Being a kicker isn't as easy as everyone wants to make it seem,\" Smith said. \"I give a lot of respect to the Jersey Village kicker and what he did last year. But it was hard.\" \n\nSoccer success \n\nSmith turned his attention to soccer in the spring and quickly became a go-to player for Houston's best team. Cinco Ranch reached state for the first time in six years, fulfilling a personal goal for Smith - he changed the background on his phone to Georgetown's Birkelfield Field, which hosts the tournament. \n\nEvery time he looked at his phone, he was reminded of where he wanted his season to end. \n\nAdversity wasn't far away, however. \n\nSmith picked up two yellow cards in the regional final against Aldine, equaling a red card. He left the game in extra time - Cinco Ranch prevailed despite being a man down - and had to sit out the state semifinal against Arlington Sam Houston. \n\n\"That was probably the hardest time I've ever had, just knowing the stage of where we were,\" said Smith, an all-district forward. \"Part of me felt like I let the team down, but then the other part knew I had confidence in them to get the job done and let me play the next day.\" \n\nSmith played in the Class 6A final, a 2-0 loss to Brownsville Rivera and the Cougars' only setback of the season. \n\nUnder pressure \n\nThe elation returned moments after his last-second kick against Cypress Ranch cleared the uprights. Creating a pressure kick is difficult in practice - teammates don't really try to block it, and there aren't thousands of screaming fans in the stands. \n\nSo both times Smith took his time, just as he does on penalty kicks in soccer. He felt a little rushed against Jersey Village after missing an extra point earlier in the game, but the Falcons called two timeouts to try to ice him. \n\nThe time was just what he needed, and he made the kick count. \n\n\"It was incredible (to do it once),\" Smith said. \"After that first game, I didn't think I was going to relive that moment because it's so rare. … But I'm glad I did.\"", "source": "Houston Chronicle"}