{"published": "2015-09-06T09:13:33Z", "media-type": "Blog", "title": "The Best! Kale Pate and Spread (nut-free, dairy-free, keto, low-carb + garlic-free)", "id": "3e14f88c-c7fd-40ca-8d0e-535b1c30235f", "content": "An inexpensive way to make eating raw vegetables fun with this flavorful 6-ingredient kale pate and spread that’s low-FODMAP. No garlic or nuts! \n \nI’m thankful to have a handful of very close girlfriends that motivate me to be the best version of myself, help me see the world in a new way, and inspire me to do good for myself and those around me. Lesley (we call her Sprout) is one of these friends for me. Every time I see her, I leave feeling refueled and inspired. \n \n\n \nDuring my last visit, she reminded me of my love for herb pate (remember my Sweet Almond Pate from 4 years ago?). Every meal, Sprout served a bowl of fresh-cut veggies with oodles of mason jars filled with nut-free spreads adorned with little spoons. We were free to fill our plates with zucchini sticks, carrot sticks and cucumber rounds, then slather them in the various vegetable spreads she’d made fresh that morning. \n \n\n \nMy vegetable intake skyrocketed that week! All I wanted to do was eat raw vegetables slathered in herb pate. And it goes beyond that. This pesto-like spread is great as a topping for roasted vegetable and meat bowls, a dip for plantain chips or added to scrambled eggs. \n \nLesley graciously agreed to let me me share this recipe with you. She rarely measures anything; she has a knack for knowing exactly how to make something without needing to measure, so it took me a bit of time to recreate the recipe when I came home. After a couple of versions, this is the closest I could get to the real thing. \n \n   Print   The Best! Kale Pate and Spread    Author:  Leanne Vogel  Recipe type:  Vegan, Paleo, Gluten-free, Dairy-free, Sugar-free, Yeast-free, Corn-free, Grain-free, Nut-free, Egg-free, Low-Carb, Keto    Prep time:  10 mins   Cook time:  5 mins   Total time:  15 mins     Serves:  10      An inexpensive way to make eating raw vegetables fun with this flavorful 6-ingredient kale pate and spread that’s low-FODMAP. No garlic or nuts!   Ingredients   1 head (6 cups) green, purple or dino kale, chopped  1 tablespoon extra-virgin olive oil  ⅔ cup raw organic sesame seeds or hemp hearts  ⅔ cup extra-virgin olive oil or MCT oil  8 green onions, green part only  3 tablespoon apple cider vinegar  1 ¼ teaspoon grey sea salt      Instructions   Add chopped kale and 1 tablespoon olive oil to a cast iron pan and heat on low, covered, until slightly crispy, about 7 minutes.  Transfer to your high-powered blender or food processor with “S” blade .  Add remaining ingredients. Blend until smooth, using the blenders’ tamper to push the ingredients down to the blade.  Spoon into a mason jar and store in the fridge for 4-5 days.      Notes  FODMAP: to make even lower FODMAP, use less sesame seeds. You could go down to ¼ cup sesame seeds and an equal amount of oil.    3.3.3077  \n View Nutrition Information (one on page, scroll down) \n \n\n \nBegin by sauteing the kale in a cast iron pan with a tablespoon of olive oil. You could also use avocado oil here (and it’s more heat stable). Saute until crisp. \n \nMeanwhile, you could add the remaining ingredients into the blender. \n \n\n \nOnce the kale is done, add it to the jug of your blender. Turn on and blend until smooth. I like it a little chunky, so I didn’t let it get too smooth. \n \n\n \nThis kale pate is one of many spread recipes I’ve created for my newest book, Fat Fueled. Coming October 2015. \n \nFrom in-depth plans and support for eating high-fat with thyroid imbalances, adrenal fatigue, anxiety, pregnancy, fertility… addressing keto rash, brain fog, plateaus, workouts, fasting, training, 4 strategies (with meal plans) on carb ups, superfoods, weight loss, weight gain, complications/frustrations, and the most exciting: intuitive eating with high-fat living. \n \nThe program is filled with simple actions that you can incorporate into your life, step by step. Along with a 4-week meal plan to continue on your fat-burning journey. It’s about creating balance, a healthy relationship with your body and healing ourselves. Yeah, weight loss will likely come as a result, but it’s not the main focus. Why? Because 95% of the women I’ve worked with in the last year were so focused on losing weight that they lost sight of taking care of their bodies and in turn, couldn’t lose weight to save their life. \n \nGet a sweet early bird discount, early access to the Fat Fueled program + an invitation to an exclusive private online event. Sign up below… \n \n  First Name * Email *                 \nYour body wants to be healthy, it wants to look good and be balanced. By getting out of our head and letting our body flow through the Fat Fueled program, we provide ourselves with the resources we need to create a life (and body) that we love while sliding into fat-burning mode and totally becoming a lady boss ;)", "source": "Healthful Pursuit"}