{"published": "2015-09-17T05:50:35Z", "media-type": "News", "title": "Children found unnattended", "id": "18362c3d-bdac-4a88-bfb1-37c08b954d39", "content": "The parents of two Logan County children were arrest Sept. 5 after they were allegedly found to have left two children unattended in a vehicle at Walmart at the Fountain Place Mall in Logan. \n \nTrooper S.M. Thompson, with the West Virginia State Police, reports he responded to a complaint of two young children left unattended in a car in the parking lot at Walmart. Upon arrival, Thompson reports he was able to find several witnesses who stated the children had been left unattended for nearly an hour. The criminal complaint filed by Thompson says, “…the children (ages one and two) were covered in makeup and the youngest had a very full diaper.” The children were also allegedly unrestrained in the vehicle and could have easily left the vehicle at any time. \n \nThompson was able to locate the parents. The father, Stephen Wayne Stacy, 33, of Kistler, W.Va., allegedly stated to Thompson he had gone to into the store to use the restroom and had gotten sidetracked. The mother, Emily Eden Stacy, 21, of Kistler, W.Va., reportedly stated she had gone into Walmart to cash a check and had gotten preoccupied. \n \nBoth Emily Stacy and Stephen Stacy were arrested Sept. 5; both parents have been charged with misdemeanor counts of child neglect creating risk of injury. If they are found guilty, Emily Stacy and Stephen Stacy could each be forced to spend up to six months in a state correctional facility and pay up to $1,000 in fines. Bond for both Emily and Stephen Stacy was set to $10,000, and on Sept. 8, the pair were able to post bond and are free pending trial. \n \n— — — — \n \nCriminal complaints are public information. Charges listed in a complaint are merely accusations; defendants are presumed innocent until proven guilty. \n   \n Emily Stacy    http://loganbanner.com/wp-content/uploads/2015/09/web1_Emily-Stacy-CMYK.jpg  Emily Stacy   \n Stephen Stacy    http://loganbanner.com/wp-content/uploads/2015/09/web1_Stephen-Stacy-CMYK.jpg  Stephen Stacy    Parents arrested for child neglect   \nBy Owen Wells \n \nowells@civitasmedia.com \n \n  \nOwen Wells is a reporter for Civitas Media. He can be reached at 304-752-6950 ext. 1729 or by email at owells@civitasmedia.com.", "source": "Logan Banner"}