{"published": "2015-09-09T09:26:04Z", "media-type": "News", "title": "2016 Toyota Prius Hybrid: World's Least Dramatic Car Gets a Dramatic Makeover", "id": "e624822d-38eb-4f51-81ec-bc881e90daf7", "content": "It’s never been easy being green, but over the last few years it’s gotten increasingly difficult. Between dropping fuel prices and rising SUV demand fewer consumers are shopping hybrids, driving the segment down over 18 percent in 2015 even as the overall new car market is up 4 percent. Toyota’s Prius, by far the most successful hybrid of all, is actually fairing better than most. It’s “only” down 17 percent this year (the Lexus CT is down 20 percent, the Ford C-Max is down 23 percent and the Honda CR-Z is down 30 percent). At Kelley Blue Book we’ve watched shopper interest in hybrids and alternative energy vehicles drop for over a year now. Does that make this the best or worst time for Toyota to introduce an all new 2016 Prius?\n\nIt doesn’t matter, because the new Prius is coming. Toyota unveiled it tonight in Las Vegas while touting a list of upgrades that range from better fuel efficiency to better driving dynamics. It’s also got a slightly larger body sporting a new exterior design. This is the most dramatic shift in the Prius’ look since the second-generation model debuted in 2003, but it’s still clearly a Prius. That’s probably a good thing, because even with the drop in volume over the past year Toyota still sells between 15,000 and 20,000 units a month. That’s more than the Kia Soul, Mazda 3, Subaru Impreza or Volkswagen Jetta, confirming an ongoing audience for the Prius even in the face of cheap gas and America’s growing love affair with the SUV.\n\nUnder its new look the 2016 Prius sits on a the Toyota New Global Architecture (or TNGA), which isn’t the most creative naming convention but does include benefits like a double wishbone rear suspension and lower center of gravity, both of which should give the new Prius better ride and handling characteristics. Drivetrain details remain unknown, though Toyota says fuel efficiency will increase by 10 percent. The new Prius will also feature the Toyota Safety Sense package of advanced technology, including a pre-collision system with pedestrian detection, lane departure warning, radar cruise control and automatic high beams. LED exterior lightings will also contribute to the new Prius’ safety pedigree.  PREVIOUS SLIDESLIDE 1 of 4NEXT SLIDE  It doesn’t matter, because the new Prius is coming. Toyota unveiled it tonight in Las Vegas while touting a list of upgrades that range from better fuel efficiency to better driving dynamics. It’s also got a slightly larger body sporting a new exterior design. This is the most dramatic shift in the Prius’ look since the second-generation model debuted in 2003, but it’s still clearly a Prius. That’s probably a good thing, because even with the drop in volume over the past year Toyota still sells between 15,000 and 20,000 units a month. That’s more than the Kia Soul, Mazda 3, Subaru Impreza or Volkswagen Jetta, confirming an ongoing audience for the Prius even in the face of cheap gas and America’s growing love affair with the SUV. © Provided by Forbes\n\nAfter briefly sitting in the 2016 Toyota Prius we can confirm an improvement in seat comfort (particularly lateral support) along with upgraded control placement and visibility. The gauge cluster remains in the center of the dash and now has a brighter, full-color display. We’re not fans of the bright white interior panels around the shifter and center console, thinking these won’t work any better in the new Prius than they did in the old Chevrolet Volt (probably why they were removed during the Volt’s 2016 redesign). Panel color aside, the new Prius is clearly a step up in every way. These enhancements may not reverse the car’s waning demand, but if the new Prius simply stabilizes around 150,000 sales a year it will be among the best selling cars in a country where hybrid cars are increasingly difficult to sell.", "source": "MSN News US"}