{"published": "2015-09-24T03:00:00Z", "media-type": "Blog", "title": "Do We Worship Words or The Word?", "id": "daee969c-4317-4d35-a535-16eb20801d29", "content": "The Bible is an undisputed masterpiece of literature. The authors weave a grand narrative and an intricate plot of love, redemption, and reclamation that has baffling depth. For example, we see how a lamb’s blood spread on a doorpost in Egypt foreshadows Christ’s blood spilled out to declare sinners justified and free from judgment. Or, how a promise to King David around 1,000 B.C. would be fulfilled on a joyous Sunday morning with a resurrected Messiah who now reigns eternally. Or how the Psalmist speaks of the Messiah’s pierced hands and feet, long before the crucifixion happened, perfectly describing what would take place at Golgotha. Technically, we can look at the genius writing style of Isaiah or Luke or Paul and see their use of irony, poetry, logic, and numerous other literary devices, which demonstrate a mastery of language, intertwining and mingling with the themes, imagery, and storyline from writers who preceded them by hundreds of years to develop a fully unified narrative of redemption history. We can see all these things working in conjunction in an unparalleled fashion and see that the complexity and simplicity and beauty of Scripture surpasses any piece of literature the world has ever known. However, we can see and wonder at all these things—yet completely miss the point. \n A High View of the Word  \nIn many traditions that hold to a high view of Scripture and its authority such as my own, we are even more susceptible to miss the point. We easily fall into the trap of worshipping the Bible’s stories and authority, but forget who the Bible points us toward. Often, we think of the Bible as the ultimate foundation of our faith; however, when we do so we fashion the Bible into an idol. Tim Keller undresses our tendency to idolatry when he says, “[Idolatry] means turning a good thing into an ultimate thing .” We’re not alone in this tendency. Even Israel turned good things—the temple, tradition, and the law—and made them ultimate—what they worshipped, rather than the God all those things were intended to point them towards. None of these things, the Bible included, is the ultimate foundation of our Christian faith. Jesus, the Son of God and God himself, is the ultimate foundation and the cornerstone of our faith. When he is pushed aside, even for good things like the Bible, we miss the point and become idolaters. When we worship words instead of the Word we have completely lost the meaning of the Bible. \n \nMost importantly, Jesus Christ deserves every ounce of our devotion and worship. We cannot serve two masters—either Jesus receives all our worship or we slip into idolatry. The Bible is our important, but it cannot usurp from Jesus Christ the role of Master of our lives. Certainly, the Bible is our way of knowing and seeking Christ, but it is a means to an end, not the end himself. Let me give you an example: Have you ever wondered what heaven will be like? Of course you have, we all do! Now, when thinking about heaven have you ever thought to yourself that you cannot wait to be there so you can read your Bible for eternity? I know that I haven’t, not once ! In Christ’s Kingdom Jesus will be physically with us, the Word of God living and breathing, and we will dwell in his presence, basking in his glory. We seek the Kingdom of Heaven because it is where his presence is. If we remove the King from the Kingdom and are left with only the Scriptures, what would be the point? To have the best reading for an infinite amount of time? \n The Purpose of the Scriptures  \nIn John 5, Jesus deals with this same issue of identifying the purpose of Scripture. He tells his audience, “You search the Scriptures because you think that in them you have eternal life; and it is they that bear witness about me.” Again, as he covertly walked with the disciples on the road to Emmaus, he taught them “beginning at Moses” concerning himself. Why? Because we can read the Scriptures and still not have any idea who Jesus is. To know Scripture but to not know Jesus is a failure. \n \nJesus is trying to get his audience to understand that the Scriptures point to a person. Someone who lived and walked this earth and felt human emotions and hunger and pain. Someone who shed tears over a dead friend and was amazed at the faith of a soldier despised by Jews. Someone who healed the sick and raised the dead and comforted the oppressed and hurting. Someone named Jesus Christ who desires that all who come humbly to the words of Scripture to know him! He is the ultimate foundation and cornerstone of our faith and the thread that holds the grand narrative together. He is the very reason for Scripture’s inspiration to mankind! So, when the Bible’s stories and wisdom come before Jesus we sell ourselves drastically short of what God intends for us. When this happens, we practice idolatry and, instead of being about Jesus, Scripture becomes a how-to or self-help book. God desires to be known and went to immeasurable lengths for us to know him, and not just to have general ideas, but also to know him personally and intimately. If we are not careful, the Bible can even hurt this relationship. \n Life in Christ  \nIf the Bible does not point us to the life that is found in Christ then it is simply empty words on a page. If it does not cause us to confess that Jesus is Lord then it is merely scribbled ink. If it does not point to the Word of God, Jesus Christ, then you may as well place your Bible in the fiction section of your bookshelf and move on to the next thing in your reading list. If it is not God’s word revealing the Word then it is merely idle words.  However, since we have a Bible pointing to the life that is found in Christ, that leads sinners to confess Jesus is Lord, and declares that the Word of God has been made flesh and died and rose from the dead, we have reason to treasure it and cling to it as it steers us towards our Lord and Savior Jesus Christ. We have hope that all the promises God makes in Scripture are “Yes, in Christ! ” He is the Living Word, he has fulfilled Scripture in His life, and he shall be forever exalted. Therefore, we worship him and him alone. \n \n— \n \nMark Hampton is currently pursuing a Master of Divinity degree from Duke Divinity School with a focus in theology and history. He also works as a Graduate Assistant in the America Reads and Counts program at Duke University reaching the schools in Durham, North Carolina to promote education. Outside of school and work he likes to read, cycle, and travel. You can follow him on twitter here: @ma rkismoving", "source": "gcdiscipleship.com"}