{"published": "2015-09-02T03:38:26Z", "media-type": "Blog", "title": "Quick n' Easy Vegan Veggie Pasta", "id": "223db763-4777-485d-8c2e-3adf5aef4575", "content": "Hello Lovelies! Since making the transition from being vegetarian to being vegan I often have people ask me how I make my meals from the images I share on Instagram (lovely20somethings) so I figured from time to time I should post some of these quick meals I make on my blog!  Since I am a full-time university student who works, blogs and also does freelance art work on the side, cooking is really not an activity I have a lot of time for so my meals have to be quick, simple and filling. Over the course of being vegan for a year I have finally figured out what works for me and what does not, an aspect of any lifestyle change, and with this post I want to share one of my favourite dishes that I literally came up with when I realized I had a very limited selection in my fridge and had to make the most of it...pretty much the description of the average college student... translation: I hadn't gone shopping in two weeks and was also too lazy to go shopping so this happened because laziness.  QUICK N' EASY VEGAN VEGGIE PASTA for the lazy vegan, vegetarian,student,working adult, human. Or robot.  Because I don't discriminate. Look at all the pretty... INGREDIENTS 1 tablespoon of Olive Oil Handfull of chopped broccoli Half a green pepper (sliced) Half a tomato (diced) Half a cup of black beans (cooked) Diced onion (whatever amount you'd prefer) Quarter cup of bean sprouts Half a cup of mushrooms Rice pasta linguini (or whatever pasta you prefer and cooked) COOKING TIME Now this dish is really simple so I am not going to write this out as beautifully as a chef might (or angrily if you are Gordon Ramsey) so bear with me. First off you are going to boil the linguini, and while that is happening you heat a skillet on medium and then add the olive oil. Once the olive oil is heated (and it will heat really fast) your going to add the diced onions. Once the pinions are a golden colour add in the mushrooms. It would be helpful to cover the skillet with a large pan cover to speed up the cooking process. After the mushrooms have also turned a golden colour add the rest of the ingredients. Once the broccoli and green pepper has turned a bright green colour and the bean sprouts are a slightly darker colour you can add in the linguini.  It helps to put a little bit of water on the skillet to keep the pasta from sticking to the bottom. Pour another table spoon of oil onto the linguini and add whatever spices you prefer (pepper, cajun, paprika, whatever floats your boat. I personally put on the spice \"vegeta\"). Then mix the pasta and veggies together, let it heat up a bit together and the viola~ you have a quick and filling pasta that is full of nutrients and protein.  Protein- Beans and bean sprouts are amazing sources for protein that the body easily breaks down. Overall this meal has: Fibre, Vitamin C, A & E, Folic Acid, Calcium, Iron, Biotin, Magnesium, Potassium (via  green peppers, onions, tomatoes)  Well there you have it my lovely readers. I know this post is a little different from my previous ones and that I am posting less \"self love\" posts then usual but I have written over 120 posts pertaining to self love, acceptance, following your dreams and so many other topics that I personally needed to change things up a bit. So I hope you enjoyed this post and if you end up making this recipe let me know what you think of it! And feel free to make any adjustments...like I said this recipe was made up due to a scarce fridge and a lazy university student. XOXO Nicola", "source": "The Lovely Twenty Somethings"}