{"published": "2015-09-04T00:41:52Z", "media-type": "News", "title": "EPA assesses animal agriculture in three Bay states - September 02, 2015", "id": "3b71c515-3b2d-402c-a163-eddb7f7b3f09", "content": "Animal agriculture programs in Delaware, Maryland and West Virginia have had varying degrees of success as they work toward meeting pollution-reduction goals for the Chesapeake Bay, according to evaluations released by the U.S. Environmental Protection Agency (EPA). \n \n \n \nUnder the Clean Water Act, the EPA periodically reviews state programs and policies related to water quality, and these reviews are typically not focused solely on animal agriculture. But the agency chose to conduct individual animal agriculture assessments for the six Bay states to ensure each state has the programs, policies and resources they need to achieve the goals of the Chesapeake Bay Total Maximum Daily Load (TMDL). \n \nEPA found the states to be successful in certain areas: Maryland , for instance, was found to have a “robust and well-implemented state program.” But other aspects of the states' animal agriculture programs need further development—including improving data collection in Delaware and ensuring compliance with voluntary nutrient management plans in West Virginia . \n \nAnimal agriculture—such as poultry and livestock operations—can be a major source of pollution in the Bay. Excess nutrients and sediment have long impaired the estuary: nitrogen and phosphorous can fuel the growth of harmful algae blooms, while sediment can smother shellfish and block sunlight from reaching underwater plants. But practices like streamside fencing and proper management of animal manure can help prevent excess nutrients and sediment from reaching local waters. \n \nSimilar reports for animal agriculture programs in New York, Pennsylvania and Virginia were released earlier this year. \n \nThe reports are available on the EPA’s Chesapeake Bay TMDL website .", "source": "Chesapeake Bay Program"}