{"published": "2015-09-15T07:33:54Z", "media-type": "News", "title": "Dollar snaps six-day skid against euro ahead of Fed : September 15, 2015, 11:10 am", "id": "1cd3b838-e532-471e-b0a6-28e1e774eecc", "content": "NEW YORK – The dollar snapped a six-day skid against the euro but dropped against the yen Monday as currency traders girded for a major US Federal Reserve decision later this week. \n\nAnalysts offered a wide range of readings of potential currency market outcomes from Thursday's Fed policy decision – which could result in the first US interest rate hike in over nine years. Although the Fed has signaled its plans to lift benchmark interest rates in 2015, turbulence in global financial markets could prompt the US central bank to push back its time frame. \n\nThe Fed's decision and economic projections released at the same time will give traders a clearer view on when and how many times the US could raise rates in the next six months,” said Joe Manimbo – senior market analyst at Western Union Business Solutions. \n\n“If the Fed does decide to hike this week, the cost of buying US dollars could spike very sharply.” But Christopher Vecchio – currency analyst at DailyFX, said even a rate hike could lead to weakness in the US currency if the Fed signals a one and done\" policy with no intention to hike again anytime soon. \n\nTrading foreign exchange this week is not a simple binary bet, said Kathy Lien of BK Asset Management, offering several possible scenarios. For example, she said, the Fed could opt not to hike and not to give any outlook for doing so, which would spark a multi-day decline in the dollar. But ont he contrary, Lien said, the dollar could also rally for several days if the Fed raises the rate and indicates it could go ahead with a second increase in 2015 if economic growth accelerates. \n\n2100 GMT     Monday         Friday \n\nEUR/USD     1.1317         1.1333 \n\nEUR/JPY     136.01         136.64 \n\nEUR/CHF     1.0960         1.0979   \n\nEUR/GBP     0.7337         0.7347 \n\nUSD/JPY     120.18         120.57 \n\nUSD/CHF     0.9685         0.9687   \n\nGBP/USD     1.5423         1.5427  ", "source": "Daily Times"}