{"published": "2015-09-29T14:34:11Z", "media-type": "News", "title": "San Francisco-Based PresenceLearning Named Finalist in the Salesforce...", "id": "84ed9e25-a7f5-474c-a2cc-479d8b4091a9", "content": "PresenceLearning \n  These outcomes have been a key part of our growth. We’ve delivered more than one million sessions to date, and are on track to bill 16 million minutes of therapy this year alone.  \n\r SAN FRANCISCO, CA (PRWEB) \r September 29, 2015 \r \n\nPresenceLearning, a San Francisco-based telemedicine company that delivers live, online clinical services such as speech and occupational therapy in schools nationwide, was named a top five finalist in Salesforce’s Small Business Big Impact Contest, which recognizes distinctive businesses with fewer than 100 employees that demonstrate excellence in innovation, leadership and impact. Out of a total of 659 applicants, the five finalists were awarded the opportunity to pitch their stories to celebrity judges and industry insiders at Salesforce’s annual Dreamforce event for a chance to win a grand prize valued at $25,000. During the pitch session at the conference, judges Russell Simmons, Lisa Chow, Daniel Debow and Kristina Shen selected the winning company. \n \nFounded in 2009, PresenceLearning has built a powerful video platform and the country’s largest professional network for delivering live, online special education and related services to school districts and families nationwide. The company’s online speech and occupational therapy, behavioral interventions, mental health services, special education academic instruction, and clinical assessments have provided school districts with a practical, effective, and affordable option for meeting students’ needs, connecting highly qualified, fully licensed professionals to students whenever and wherever they are needed. \n \n“Our results have been phenomenal with PresenceLearning students beating national averages for several years running,” said Clay Whitehead, Co-CEO and Co-Founder of PresenceLearning. “These outcomes have been a key part of our growth. We’ve delivered more than one million sessions to date, and are on track to bill 16 million minutes of therapy this year alone.” \n \nDreamforce was held on September 15-18, 2015 in San Francisco, CA. To learn more about the event and the Salesforce’s Small Business Big Impact Contest, visit http://www.salesforce.com/campaigns/smb-contest/ . To learn more about PresenceLearning and its award-winning services, visit http://www.presencelearning.com . \n \nAbout PresenceLearning\r \nPresenceLearning ( http://www.presencelearning.com ) is the leading provider of online speech and occupational therapy , behavioral and mental health services , and assessments for educational and health care organizations, and families of children with special needs. PresenceLearning’s nationwide network of online professionals and telehealth providers includes hundreds of highly qualified speech language pathologists (SLPs), occupational therapists (OTs), behavioral and mental health professionals as well as special education teachers. Live interactive sessions are delivered “anytime anywhere” via videoconferencing using the latest in evidence-based practices combined with powerful reporting. \n \nBy partnering with PresenceLearning, organizations can fill service gaps related to acute and chronic shortages of clinical and special services personnel, reduce high caseloads for onsite personnel, reduce their backlog of assessments, improve outcomes, and improve efficiency. Since 2009, PresenceLearning has delivered more than 1 million live, online therapy sessions to students in public, charter, and virtual schools across the U.S. and globally, proving that online delivery of special services is practical, convenient, and highly effective. \n \n### \n  \nShare article on social media or email", "source": "PRWeb"}