{"published": "2015-09-24T10:26:14Z", "media-type": "News", "title": "BreakThrough Physical Therapy to Sponsor Twin Bridges 8K Road Race on October 3, 2015 September 24, 2015Clinic To Prepare Runners for Twin Bridges 8K Road Race in Morehead City", "id": "30fd0fbe-3ec5-4417-9f3b-35afee4c3d5a", "content": "We look forward to being a part of the Twin Bridges 8K Road Race for the second year in a row.  \n\r (PRWEB) \r September 24, 2015 \r \n\n BreakThrough Physical Therapy (BTPT) is pleased to announce they will be one of the sponsors of the Morehead City’s Twin Bridges 8K Road Race for the second year on October 3, 2015. \n \nOn race day, BTPT’s Pevlic Health Specialist Katie Knight, PT, DPT , will be on site to talk about stress incontinence, which can cause leakage while running.  Additionally, members of the BTPT staff will be present at the finish line to answer post-race musculoskeletal or training questions and for screening and stretching as needed. \n \n\"We look forward to being a part of the Twin Bridges 8K Road Race for the second year in a row,” said Knight. “The North Carolina Seafood Festival is a wonderful community event and we look forward to seeing healthy, familiar faces at the race and throughout the course of the weekend.” \n \nFor more information on the race, which is part of the North Carolina Seafood Festival from October 2-4, 2015, please visit http://ncseafoodfestival.org/ .  Registration for the 8K can be completed through October 2 and costs $30. \n \nAbout BreakThrough Physical Therapy (BTPT): \r \nBreakThrough Physical Therapy (BTPT) is a private physical therapy practice with seven locations in Cameron, Greensboro, Fayetteville, Morehead City, Raleigh, and Winston Salem, North Carolina. BreakThrough Physios pride themselves in having advanced training in delivering hands-on treatment to achieve optimal results in a shorter timeframe for patients suffering from all orthopedic conditions. Common conditions treated include sports and work related injuries, neck and back pain, headaches, and muscle and tendon disorders. For more information visit BreakThroughPTclinics.com. \n  \nShare article on social media or email", "source": "PRWeb"}