{"published": "2015-09-07T22:00:00Z", "media-type": "News", "title": "Qihoo 360 Announces Exercise of Put Option with Respect to Joint Venture with Coolpad", "id": "4edaedb5-13e5-4285-b0b0-8859e3d70c28", "content": "BEIJING , Sept. 7, 2015 /PRNewswire/ -- Qihoo 360 Technology Co. Ltd. (\"Qihoo 360\" or the \"Company\") ( NYSE: QIHU ), a leading Internet company in China, today announced that it has issued a notice to Coolpad Group Limited (\"Coolpad\") (HKSE: 2369) to exercise its put option to require Coolpad to purchase the Company's entire 49.5% stake in Coolpad E-Commerce Inc., a joint venture between the Company and Coolpad set up in December 2014 to focus on mobile terminal products that are distributed through Internet as the primary channel, in accordance with the shareholders agreement relating to the joint venture. \n\nUnder the shareholders agreement, the Company has a put option to sell its entire stake in the joint venture to Coolpad at a total price equal to twice its fair market value, exercisable if Coolpad breaches its non-compete obligations under the shareholders agreement.  The Company issued the notice to Coolpad to exercise this put option based on a series of breaches by Coolpad of its relevant non-compete obligations.   \n   \nIn the notice, the Company has proposed a fair market value of US$742.5 million for the 49.5% stake, based on a US$1.5 billion valuation of the entire share capital of the joint venture.  Accordingly, the purchase price payable by Coolpad would be US$1.485 billion .  \n\nThe Company cautions its shareholders and others considering trading in the Company's securities that it cannot give any assurance that the transfer of the Company's 49.5% stake would close on the terms outlined above or that Coolpad would not dispute, in legal proceedings or otherwise, the Company's right to exercise the put option of the 49.5% stake. \n\nAbout Qihoo 360 \n\nQihoo 360 Technology Co. Ltd. ( NYSE: QIHU ) is a leading Internet company in China . The Company is also the number one provider of Internet and mobile security products in China as measured by its user base, according to iResearch. Qihoo 360 also provides users with secure access points to the Internet via its market leading web browsers and application stores. The Company has built one of the largest open Internet platforms in China and monetizes its massive user base primarily through online advertising and through Internet value-added services on its open platform. \n\nForward-looking Statements \n\nThis press release contains statements that express the Company's current opinions, expectations, beliefs, plans, objectives, assumptions or projections regarding future events or future results and therefore are, or may be deemed to be, \"forward-looking statements\" within the meaning of the U.S. Private Securities Litigation Reform Act of 1995 (the \"Act\"). The following cautionary statements are being made pursuant to the provisions of the Act and with the intention of obtaining the benefit of the \"safe harbor\" provisions of the Act. You can identify these forward- looking statements by terminology such as \"will,\" \"expects,\" \"believes,\" \"anticipates,\" \"intends,\" \"estimates,\" or in each case, their negatives or other variations or comparable terminology. These forward-looking statements include all matters that are not historical facts. They appear in a number of places throughout this press release and include statements regarding the Company's intentions, beliefs or current expectations concerning, among other things, its results of operations, financial condition, liquidity, prospects, growth, strategies and the industry in which it operates. \n\nBy their nature, forward-looking statements relate to events that involve known and unknown risks and uncertainties and are based on current expectations, assumptions, estimates and projections about Qihoo 360 and the industry in which it operates. Potential risks and uncertainties include, but are not limited to, those under \"Risk Factors\" in the Company's most recent annual report on Form 20-F filed with the SEC, and the following: the Company's ability to continue to innovate and provide attractive products and services to attract and retain users; the Company's ability to keep up with rapid changes in technologies and Internet-enabled devices; the Company's ability to leverage its user base to attract customers for our revenue-generating services; and the Company's dependence on online advertising for a substantial portion of our revenues; and the Company's ability to compete effectively. Although the Company has based these forward-looking statements on assumptions that it believes are reasonable when made, it cautions you that forward-looking statements are not guarantees of future performance and that the Company's actual results of operations, financial condition and liquidity, and the development of the industry in which it operates may differ materially from those made in or suggested by the forward-looking statements contained in this press release. In addition, even if the Company's results of operations, financial condition and liquidity, and the development of the industry in which it operates, are consistent with the forward-looking statements contained in this report, those results or developments may not be indicative of results or developments in subsequent periods. \n\nGiven these risks and uncertainties, you are cautioned not to place undue reliance on these forward-looking statements. Any forward-looking statement that the Company makes in this press release speaks only as of the date of such statement, and the Company undertakes no obligation to update any forward-looking statements or to publicly announce the results of any revisions to any of those statements to reflect future events or developments. \n\nFor investor and media inquiries, please contact: \n\nQihoo 360 Technology Co. Ltd. \nIn China : \nTel:  +86 10-5878-1574 \nE-mail:  ir@360.cn \n\nIn the U.S.: \nThe Piacente Group, Inc. \nDon Markley \nTel: (212) 481-2050 \nE-mail: qihu@tpg-ir.com \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/qihoo-360-announces-exercise-of-put-option-with-respect-to-joint-venture-with-coolpad-300138662.html \n\nSOURCE  Qihoo 36", "source": "Good Day Sacramento"}