{"published": "2015-09-03T04:00:00Z", "media-type": "News", "title": "Jailhouse care: The county will spend more but keep control", "id": "0b6e5cc0-4a4f-4b4a-bd68-f4867633af46", "content": "You get what you pay for. Allegheny County learned that expensive lesson when it hired Corizon Health Inc. in 2013 to provide care for inmates in its jail. What followed was trouble that included inmates unable to get their prescription medications on time, too little staff on duty and an inmate mortality rate that was double national norms — 11 inmates in two years.\n\nThe county’s decision in June to get rid of the Tennessee-based company and create a new, in-house system with medical professionals from the Allegheny Health Network was a smart choice, but the price tag was unknown until this week.\n\nOn Monday, county manager William McKain and hospital administrators spelled out the details. The county will pay $2 million to $3 million a year more than the $11.5 million it was paying Corizon, but it will get an improved system including:\n\n• Three full-time physicians, two full-time psychiatrists and eight full-time nurse practitioners or physician assistants from Allegheny Health for $4 million;\n\n• Specialized services from the hospital on-site, including treatment for inmates who are HIV-positive or pregnant;\n\n• An administrator and deputy, hired from Corizon, to manage the jail medical staff, which will include nursing, mental health services and drug and alcohol abuse programs;\n\n• Use of the John J. Kane Regional Centers’ system that already distributes medication for the county’s nursing homes;\n\n• A staff of four full-time and five part-time nurses, five full-time and four part-time substance abuse counselors, with more hires anticipated;\n\n• One-year contracts for dental, dialysis and vision care as needed.\n\nAlso, the county’s computer services department is developing an electronic medical records system.\n\nThe experiment with Corizon went very wrong. Although the county has hired two officials from the company, the county will be directing operations now. As long as that continues, with assistance from a regional expert in Allegheny Health Network, the new arrangement should be money better spent.\n\nMeet the Editorial Board.", "source": "Pittsburgh Post-Gazette"}