{"published": "2015-09-05T18:03:31Z", "media-type": "Blog", "title": "Dairy Alternatives", "id": "8a07c34b-227d-4a41-af70-e5c4d5a6deb8", "content": "Tags : None In place of animals milk:  try soy, rice, almond, coconut, hemp, hazelnut, and oat milks in plain or original, chocolate, vanilla, unsweetened, and other varities.  Also try seasonal flavors such as Silk Nog, Silk Pumpkin Spice, Westosy Chocolate Peppermint Stick and others. Try coffee creams from Silk and MimicCreme, Soyatoo, MimicCreme, and Rod's make non-dairy whipped cream toppings.\nIn place of butter: for dairy-free margarines, try Shedd's Willow Run (palm oil-free), Earth Balance, Nucoa, Saffola, and Smart Balance Light.  You may find other varieties of vegan margarines: be sure to check ingredients for whey, a dairy product in many margarines.\nIn place of yogurt: Try soy, coconut and almond yougurt in plain, vanilla, chocolate, and a variety of fruit flavors from Silk, WholeSoy, Trader Joes, Wildwood, Stonyfield Farms, Nancy's and others.\nIn place of cheese:  vegan cheeses come in a variety of flavors and forms (such as blocks, slices, and shreds).  Try Daiya, VeganRella, Follow Your Heart Vegan Gourmet, Tofutti, Tease, Galaxy Nutritional Foods, Soymage Vegan Parmesan, Trader Joe's and Sheese.  Check Indredients for casein, a dairy protein in many non-dairy cheeses.     Try Road's End Organics Shells and Cheese of make your own vegan mac and cheese with nutritional yeast \"cheese\" sauce.  (Search online for recipes.)  Try Better Than Cream Cheese and Sour Supreme from Tofutti, and Cream Cheese Alternative and Sour Cream Alternative by Follow Your Heart Vegan Gourmet.\nIn place of ice cream:  Vegan ice creams are made from soy, rice, hemp, coconut or almond milk.  Try So Delicious, Purely decadent, Tofutti,m Soy Dream, Rice Dream, Trader Joe's Soy Creamy, Tempt, Coconut Bliss, and Doubloe Rainbow.  Rice Dream offers moon pies and nutty bars, and Tofutti and So Delicious have vegan ice cream sandwiches and fudge bars.  Most sorbets and popsicles are also vegan.", "source": "incrediblyfreefreebies.yuku.com/directory"}