{"published": "2015-09-15T11:51:34Z", "media-type": "News", "title": "That's a high-wire act! Amazing drone footage shows Chinese engineers converting a 980ft wooden bridge into a glass walkway above a 590ft canyon", "id": "824b02f5-ec1a-4c3c-8ec1-b2ea26ad3b8a", "content": "Engineers are transforming wooden suspension bridge into see-through mountain pass in Hunan, central China Bridge connects two peaks in Stone Buddha Mountain in Shiniuzhai Geopark. Work to be finished by October 1 It will be the world's longest glass bottomed walkway once completed. Such platforms are very popular in China  \nA drone has captured a series of terrifying footage of Chinese engineers working 590 feet above a steep canyon. \n\nThey are working hard to transform a wooden suspension bridge in Hunan, central China, into a glass walkway. \n\nCurrently, a wooden overpass links two peaks of Stone Buddha Mountain in Shiniuzhai Geopark. After completion, the 984 foot long construction will become the world's first suspension made entirely of glass, reported People's Daily Online .   \n\nIt is scheduled to be completed by October 1, when China celebrates its National Day with a week-long public holiday. \n\n    \n   \nSuspended: Bridge connects two peaks of Stone Buddha Mountain in Shiniuzhai Geopark. It's 590 above the bottom of the canyon \n   \nSmall team: 11 engineers are part of the project to transform a wooden suspension bridge in Hunan, central China, into a glass walkway \n \nReinforcement: Engineers are having to strengthen the bridge before replacing the wooden planks with panes of glass to form the walkway \n   \nDangerous: At times the engineers are working over the sheer drop with only the bridge's steel suspension wires below their feet \n \nPart of the bridge had already been replaced with a glass walkway in 2014, attracting hoards of fearless tourists. \n\nHowever, the whole bridge will now be converted into a see-through mountain pass.  \n\nDrone footage of the bridge shows that the walkway towers above the canyon floor below. \n\nIt looks dangerously small compared to the vastness of the mountains around it. \n\n11 people are part of the engineering team in charge of converting the bridge, which has to be completed entirely by hand. \n\nTo make the transformation, the engineers must reinforce the bridge structure with additional steel cables, remove the existing wooden planks and secure the double-thick glass panes into place.  \n\nAt times, the only thing that separates them from the plunge below are the suspension wires under their feet. \n\nThe arduous project is incredibly difficult thanks not only to its height but also because the structure is based on a suspension bridge. \n\nThis means that every time someone walks along the bridge, it will wobble slightly, potentially causing discrepancies in measurements. \n       \nAttraction: Sections of the bridge had already been replaced with glass panes in 2014. It was open to the public who flocked to the site \n   \nExtension: All 984 feet of the bridge will be replaced with the glass panes. It will become the longest glass suspension bridge in the world \n   \nLong hours: The team is currently working from 7am to 7pm daily to complete the project in time and to the high safety standards required \n   \nDeadline: Work is expected to be finished by October 1, in time for China's National Day celebrations when there's a public holiday \n\nAccording to the engineers, the team is working from 7am to 7pm daily to complete the project in time and to the high safety standards required. \n\nOne engineer, Yang Guohong said: 'No matter how the tourists jump on the bridge we built, it will be fine. \n\n'The steel structures beneath the bridge is incredibly dense so even if the glass gets broken, visitors won't fall down.' \n\nTo show this, the engineers are even happy to have their photos taken while lying down on the bridge for a rest.  \n\nIn fact, the special glass is 25 times stronger than regular window glass and weighs a hefty 140 kilograms (22 stones). Four people are required to lift each pane as it's created to stay in shape and withstand impact. \n\nThe amazing construction has already been dubbed 'hero bridge' because of the amount of courage required to cross it.  \n\nIn recent years, glass-bottomed walkways have become incredibly popular for Chinese thrill-seekers. \n\nMore and more tourism sites are constructing viewing platforms over steep vertical drops to attract visitors. \n\nEarlier this year, a viewing platform in Chongqing, south-western China, became the world's longest cantilever walkway with a glass bottom. \n\nIt's a breath-taking 2,356 feet drop to the ground below. \n\nAnother bridge is currently under construction in Zhangjiajie, Hunan. It will be an astounding 984 feet above the canyon. \n\nThe 1,247 foot long bridge will be able to accommodate 800 people at any one time when complete. \n   \nSafety: Above, an engineer feels completely safe while lying above a section of the walkway that they've just replaced with a glass pane \n   \nDifficult: The project is incredibly hard thanks not only to its height but also because the structure is based on a suspension bridge \n   \nHeavy work: Double-thick glass panes are used. They weigh about 140kg (22 stones) and require four people to lift into place \n   \nStrong: Glass panes are also said to be able to withstand impact and resist bending - very important for the safety of visitors to the bridge", "source": "Mail Online UK"}