{"published": "2015-09-14T23:13:16Z", "media-type": "News", "title": "ValueCap boosts market", "id": "c1ecdc85-40dc-45e6-a6d2-688078856716", "content": "PUTRAJAYA: A RM20bil package to support undervalued stocks through ValueCap sent the local bourse 36 points or 2.25% higher to 1,639.63, thanks to strong buying from local funds. \n\nThis is one of the biggest single-day gains for the FBM Kuala Lumpur Composite Index in recent months after the Prime Minister announced several measures to stabilise the money markets. \n\nAccording to statistics, local institutions were net buyers of RM1.36bil worth of stocks and they sold RM1.26bil, a net investment of RM102.7mil. Foreign funds, however, continued to cash out, being net sellers to the tune of RM86mil. \n\nFund managers felt the move to revive ValueCap which was set up in 2002, had improved confidence in the market. \n\n“The Government’s announcement has clearly boosted investors’ confidence,” said Etiqa Insurance and Takaful research head Chris Eng. \n\nThe daily average value traded since 2013 was about RM2bil while net outflows as of end-August was RM16bil. \n\n“With RM20bil, they can support the market,” he explained. \n\nBut there is also a view that the revival of ValueCap is only to send the signal that there are undervalued stocks in the market that has a capitalisation estimated at RM1.3 trillion. \n\nAmong the blue chips, Tenaga Nasional Bhd was one of the biggest gainers, rising 6.6% or 74 sen to RM11.96 after Datuk Seri Najib Tun Razak said the divestment of Edra Global Energy would be done through an open bidding process. \n\nOther significant holdings by ValueCap had also gained traction. \n\nAmong others, Sime Darby Bhd jumped 7.4% or 53 sen to RM7.70. The conglomerate is the biggest holding – representing 12.3% of MyETF Dow Jones Islamic Market Malaysia Titans 25 managed by ValueCap. \n\nNajib also gave an assurance that issues involving 1Malaysia Development Bhd and Bandar Malaysia would be handled in a market-friendly and transparent manner. \n\nEng said that the positive momentum should be sustainable for the year if the Federal Reserve updates the interest rate hike with a dovish tone. The decision should be known by Friday after a two-day meeting by the Federal Open Market Committee from tomorrow. \n\nDomestically, the outcome of the “red-shirt” gathering will also have an impact on the direction of the equities market. \n\nOne research head, however, opined that it would take a while to restore foreign investor confidence. \n\n“We have to take into consideration of the overall trend of the emerging markets and economies that are highly-dependent on commodities,” he said. \n\nBecause of that, he said the rally might be short-lived as the additional fund would not change the fundamentals of the economy. \n\nHe expected domestic consumption to remain weak due to the implementation of the goods and services tax as well as the weak ringgit. Prolonged soft prices of commodities will also continue to drag while all eyes are also on China’s growth. \n\nBrent crude oil traded slightly lower at US$47.69 per barrel while crude palm oil was up by RM18 to RM2,050 per tonne. \n\n“That said, any support measure is good to reduce market volatility,” he said. The year-end target of the KLCI for most research houses fall between 1,600 points and 1,700 points. \n\nValueCap, which was set up to support underperforming shares, had proven to be effective in stabilising the equity market. \n\nThe entity is owned by Khazanah Nasional Bhd, Permodalan Nasional Bhd and Kumpulan Wang Persaraan Diperbadankan with a fund size of RM10bil when it was set up. The KLCI was at the range of 635 points then. \n\nIn addition, the Government had taken new measures to support business activities for the small and medium enterprises (SMEs). \n\nThe Working Capital Guarantee Scheme will be raised by RM2bil more to help SMEs from other sectors. That’s on top of the existing RM5bil guarantee that is allocated for the services sector. \n\nImport duty exemption will also be given for 90 tariff segments that make up of spare parts, finished goods and research equipment for the manufacturing sector until the global economy recovers. \n\nThis is besides the existing 319 line tariffs that were given import duty exemptions. \n\nHe estimated that some 900 factories would be able to save annual operating costs of between RM100,000 and RM500,000. \n\nSMEs can apply to restructure and reschedule their business loans from their creditors or through the Small Debt Resolution Scheme provided by Bank Negara. To stimulate domestic and foreign investments in the country, the strategic domestic investment fund will be continued with an extra RM1bil allocation in the 11th Malaysia Plan.", "source": "TheStar.com.my"}