{"published": "2015-09-17T23:13:10Z", "media-type": "News", "title": "Fed angst gives stock traders more reason to doubt profit bounce", "id": "91020150-ae26-4f93-93f4-82aedfa88073", "content": "They didn't raise rates. Do they know something investors don't? They didn't raise rates. Do they know something? \n\nOn Wall Street, imaginations are racing over whether the Federal Reserve's refusal to boost interest rates says more about their view of the world economy than they are letting on. While equity bulls are happy for more months of zero-percent stimulus, a bigger issue is whether inaction bespeaks deeper concern about global growth at a time when corporate earnings have stopped going up in the US. \n\nIn typically frenetic trading, the Standard & Poor's 500 Index ended Thursday with a loss, declining 0.3 per cent to 1990.2 and erasing a rally that reached 1.3 per cent at the beginning of Janet Yellen's press conference. Gains evaporated as the Fed chair spoke about the potential for stress in emerging markets to spill into the US. \n\n\"That they didn't start today and continue to wait still gives caution that the underlying economy around the world isn't as strong as they like to see,\" said David Lyon, global investment specialist at JP Morgan Private Bank, which oversees about $US1 trillion. \"This becomes three months of additional time where the Fed decision is still the black cloud overhanging the market.\" \n\nAnother black cloud is not what equity traders were hoping for after corporate profits fell in the second quarter even as profit-based valuations reached the highest in five years. Since the third quarter of 2014, companies' quarterly profit growth has averaged 3 per cent in the S&P 500, down from 17 per cent since the bull market began. Focus is back on China \n\nAmong other things, inaction by the Fed puts the focus back on concerns such as China's economy and plunging commodities, stresses that sparked a selloff in mid-August that at its worst erased more than $US7 trillion from global equity values. \n\n\"The market will quickly turn around and say, hold on a minute, if they can't raise rates with unemployment where it is, then you're really worried about the potential impact with what's going in emerging markets and commodities and so on,\" said Stewart Richardson, chief investment officer at RMG Wealth Management in London. \"If they cant do it now, they'll never be able to do it.\" \n\nThe Fed's statement warned that economic and financial developments around the world may restrain economic activity and curb inflation. Yellen mentioned the outflow of capital from developing countries and pressures on emerging market currencies in her Q&A session. Bad news\n\nThe refusal to hike was bad news for a significant constituency of traders who hoped Yellen and her colleagues would get the first rate increase over with as a way of affirming faith in the US. No increase underpins concern that policy makers doubt that momentum seen in everything from American gross domestic product to retail sales will prove durable. \n\n\"I'm completely and utterly bored sick of the whole thing and I think that it's completely irrelevant whether the Fed raises rates by 25 basis points,\" David Hussey, head of European equities at Manulife Asset Management in London, said before the decision. \"What is important is, is China really blowing up, is a recession about to happen in emerging markets, what's going to happen to commodity prices?\" \n\nHike or not, the outcome of Thursday's meeting is sure to test resolve in an the world's biggest sharemarket, where the third- longest bull market on record has recently ground to a halt. The S&P 500, up almost 200 per cent in the 70 months through December, has fallen 3.3 per cent this year, including its first 10 per cent correction since 2011. Also-rans \n\nAs the trend turned, US shares have changed from being among of the world's best investments, from 2010 to 2014, to rank also-rans. Over the first 5 1/2 years of the bull market the S&P 500 beat the MSCI All-Country World Index by more than 60 percentage points, rallying 204 per cent through 2014. Since the start of 2015, the US index is down about the same as the global gauge. \n\n\"There could well be fears that it is due to a weakening growth environment, which will send a negative tone to equity markets,\" said Pau Morilla-Giner, the chief investment officer at London & Capital Group. \"This feels like a Catch 22 situation especially when one considers the low sentiment-high fear factor dominating equity markets currently.\" \n\nThursday's reaction extended the worst equity rout since 2011, a stretch dating to mid-August that began with concern over China's market meltdown and worsened as commodity prices tumbled and the dollar surged, potentially crimping profits at exporters. Even after rising in four of the five days before Thursday, the S&P 500 has lost 5.3 per cent over the past month. Equity rout continues \n\nInvestors in the pro-rate hike camp point out that stocks have weathered Fed tightenings in the past. Since 1946, following the initiation of 12 tightening cycles defined by Ned Davis Research, the S&P 500 was higher a year later eight times and posted an average 12-month return of 2.5 per cent. \n\nBut past tightenings also began when the stock market was much less turbulent than it is now. Over the month leading up to the 12 cycles since World War II, the S&P 500's average daily move, a rough measure of volatility, was less than 0.6 per cent - - 15 per cent lower than usual. While some investors said that meant markets were too unsettled to hike, the alternative could be worse. \n\n\"The Fed's mandate isn't to cause stock returns,\" said George Schultze, who oversees $US200 million as founder and managing member of Schultze Assset Management in Purchase, New York. \"We're due for a higher rate now. If inflation continues to climb because interest rate policy is too aggressive for too long, it's a bigger risk for stocks.\"\n\nBloomberg The story first appeared on The Sydney Morning Herald.", "source": "Bombala Times"}