{"published": "2015-09-16T12:17:37Z", "media-type": "News", "title": "Arcis Resources Corporation signs agreement with the first US Bud+Breakfast place with locations in San Ayre, Colorado Springs and Denver.", "id": "9ea6a3d7-089e-45c8-ba64-56c8d5e62847", "content": "SOURCE Arcis Resources Corporation\n\nWEST PALM BEACH, Fla. \n\nCEO Chris Margait \n\nAbout Arcis Resources Corporation by and through its wholly owned subsidiaries is a technology solution provider with strong focus on software, web, mobile apps, and social media. We specialize in developing online information and directory portals for markets that strategically bring revenue, and growth. Our goal is to serve as a platform for software, web, mobile app, and social media development used for licensing, and distribution worldwide.\n\nSafe Harbor Statement \n\nThis release contains forward-looking statements within the meaning of Section 27a of the Securities Act of 1933, as amended and section 21e of the Securities and Exchange Act of 1934, as amended. Those statements include the intent, belief or current expectations of the company and its management team. Prospective investors are cautioned that any such forward-looking statements are not guarantees of future performance and involve risks and uncertainties, and that actual results may differ materially from those projected in the forward-looking statements as a result of various factors. Accomplishing the strategy described herein is significantly dependent upon numerous factors, many that are not in management's control. Some of these factors include the ability of the company to raise sufficient capital, attract qualified management, attract new customers and effectively compete against similar companies.\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/arcis-resources-corporation-signs-agreement-with-the-first-us-budbreakfast-place-with-locations-in-san-ayre-colorado-springs-and-denver-300143800.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WSET"}