{"published": "2015-09-16T07:57:03Z", "media-type": "News", "title": "Yemen's PM, ministers return to Aden", "id": "6f7db203-e622-4df4-8564-0fc606c47c82", "content": "Yemen's exiled prime minister returned to the country's southern port city of Aden on Wednesday, as anti-Houthi forces are pushing toward the capital Sanaa, government officials told Xinhua.\n\nPrime Minister Khaled Bahah returned along with seven members of his cabinet and a team of top security officials. He will hold a meeting in the next two days in Aden, the government source said on condition of anonymity, adding that reconstruction and humanitarian relief top the agenda.\n\nBahah, who is also the vice president, announced that his cabinet will resume work in the temporary capital Aden, pledging to continue restoring stability to the city and neighboring provinces that were taken from the Shiite Houthi group.\n\nIt's Bahah's second visit to Aden since President Abd-Rabbu Mansour Hadi and the cabinet fled to Saudi Arabia to take refuge in March.\n\nOn Wednesday, after four days of fierce battles against Shiite Houthi gunmen and their allied forces, Gulf-backed government forces are advancing in the oil-rich province of Marib. Dozens from both sides have been killed in action.\n\nMilitary officials said heavy airstrikes on Houthis in Marib help pro-Hadi forces to enter Serwah district which was captured by Houthis months ago.\n\nOn Sunday, thousands of Yemeni soldiers trained in Saudi Arabia, together with troops from the coalition and hundreds of tribesmen, participated in large military operations against Houthis in Marib, Yemen's most important oil-producing province, some 170 km northeast of the capital Sanaa.\n\nEarlier in the day, Saudi-led airstrikes pounded the general command of the Armed Forces in Yemen's capital Sanaa and several military bases controlled by Houthis. Huge explosions were heard across the city, according to local residents.\n\nThe Saudi-led airstrikes also destroyed all main roads and bridges leading to Sanaa in an attempt to cut off supplies and besiege pro-Houthi forces.\n\nYemen, an impoverished Arab country, has been engulfed in a civil war between the Shiite Houthi group, which is supported by army units loyal to former President Ali Abdullah Saleh, and Saudi-backed government forces.\n\nIn late March, the Saudi-led coalition began airstrikes against the Houthis in Yemen at the request of President Hadi. The campaign aims to prevent the Houthis from seizing power in Yemen. Endit", "source": "China.org.cn"}