{"published": "2015-09-03T05:10:34Z", "media-type": "News", "title": "Missing bus threatens Day Care services", "id": "3b569561-9586-4faa-bffb-314812db0379", "content": "A COMMUNITY mini bus promised by the Government for Tenbury has been delayed and this is threatening services at a day care centre in the town. \n \nTenbury Transport Trust thought it was just the ticket when it learned that it was to receive a new mini bus under a Government community transport initiative. \n \nIt had been expected that the bus would be in service by July but the latest news is that it has not even left the depot. \n \nThe story is getting worse because John Driver, who runs the Tenbury Transport Trust, has no idea when it will arrive. \n \nNeither does he know what kind of bus the Trust will be getting when it eventually arrives or what the conditions of use will be. \n \nThe implications of this are very serious as the Trust struggles to meet its obligations and has already told the Kyrebrook Day Care Centre that it will have to terminate an agreement at the end of September. \n \nAs a consequence of this, the centre will have to turn away a large number of elderly and disadvantaged people who are dependent upon bus transport. \n \nRia Baxter, a director of the Day Care Centre, fears that unless a solution can be found, at least 17 of the 60 people who attend the Day Care Centre each week will have to be turned away. \n   Promoted stories   \n“This is a desperate situation and it means that we will simply not be able to take the people who depend upon a bus and cannot be transported by car,” she said. \n \n“We have an agreement with Tenbury Transport Trust but they say this will have to come to a finish at the end of September. \n \n\"They have already had to take the bus off us on one occasion which caused very serious problems for one of our elderly clients.” \n \nShe said that an attempt is being made to see if an alternative bus can be secured from Worcestershire County Council. \n \nIn the meantime, an appeal is being made for volunteers who might be able to help either at the day centre or with transport. \n \nCar drivers are needed and they would get a mileage allowance - someone with a mini-bus would be like Christmas coming early for the centre but it would need to have a wheelchair lift. \n \nJohn Driver from Tenbury Transport Trust said that the situation is very frustrating and that help would be provided to the day centre on an ‘ad-hoc’ basis but without the new bus a regular contract is impossible. \n \nHe said that, during August, there had also been a dip in demand for the five scheduled services operated by the Trust. \n \n“I take a longer term view and the summer is usually a slow period,\" said Mr Driver. \n \n\"But things will need to pick up as with the number of passengers in August some of the routes are not viable.” \n   \n Share article  \n   \n“At the moment it is tough keeping the show on the road,” he added. \n \nAnyone who can help volunteer at the Kyrebrook Day Centre should contact 01584 318", "source": "Redditch Advertiser"}