{"published": "2015-09-20T04:32:37Z", "media-type": "News", "title": "Farm fisherman remanded on wounding charge", "id": "5ad0b816-3536-4d6c-a6c1-a6f6617b5110", "content": "A charge of unlawful and malicious wounding was read to a 45- year-old fisherman when he appeared in the Georgetown Magistrates’ Courts on Thursday.\n\nAppearing before City Magistrate Faith McGusty was Mohan Deonarine, of Farm Sea Dam, East Bank Demerara.\n\nDeonarine is accused of unlawfully and maliciously wounding Brian North, on August 24, at Stabroek Market. He pleaded not guilty to the charge.\n\nPolice Prosecutor, Corporal Seon Blackman, did not relate any facts about what transpired on the day in question. Blackman, however, objected to bail citing the nature of the offence and punishment it attracts.\n\nFurther, the Prosecutor pointed out that the defendant should not be granted pre-trial liberty because he has no fixed place of abode and might not return to court.\n\nBlackman also noted that if the defendant should be granted bail there is a likelihood that he may tamper with the prosecution’s witness (North).\n\nWhen given a chance to explain his side of the story, Deonarine told the court that North had assaulted him several times before. He said that the incident occurred three weeks ago.\n\nThe defendant added that on the day in question, “He (North) cuss me up about me mother, put two cuff in me face and tek way me $100.”\n\nDeonarine continued, “I had a knife in me hand and the knife cut he. He had an umbrella in he hand and he keep advancing to me.”\n\nAfter listening to his explanation the Magistrate requested Deonarine to provide the court with an address. He told the court that he lives in a squatting area close to the Demerara River. The defendant was subsequently remanded to prison after the Magistrate upheld the prosecutor’s request.\n\nIn addition, the prosecutor requested two weeks to serve statements in the matter, which was adjourned to October 2.", "source": "Kaieteur News"}