{"published": "2015-09-23T02:50:17Z", "media-type": "News", "title": "Will Prime Minister Turnbull be the first Australian PM to visit Australia’s offshore detention centres?", "id": "1eb14c5b-7d21-48c3-a3c5-e1f6dbc4475e", "content": "Demonstrating the irrationality of a then popular phobia, Gough Whitlam was the first Australian Prime Minister to visit China. Will Malcolm Turnbull have the courage to face a similar contemporaneous issue head on and be the first Australian Prime Minister to visit an offshore detention centre?\n\nIf the late writer Albert Camus was right, one cannot put oneself in the service of those who make history but must remain at the service of those who suffer it. If that is correct there are certain advantages in a Prime Minister not personally visiting and confronting the sinister crimes and suffering described by the United Nations, Amnesty International and other humanitarian organisations in various reports which examine the circumstances faced by asylum seekers in Australia’s offshore detention centres. Once a person bears witness it becomes personally (one hopes) and politically difficult to deny allegations made about the conditions or to remain pragmatic in one’s advocacy for Australia’s policy position.\n\nPrime Minister Turnbull is being pressed to urgently address the significant issues faced by women. This shouldn’t end at our borders. If that is not reason enough then surely a fiscally responsible leader would want to see how every year $1.2 billion of taxpayers’ money is being spent.\n\nThrough their skilful, passionate, persistent and courageous political defiance, the health professionals who, despite the Border Force Act coming into effect in July, have ignored Australia’s gagging law and continue to speak out, can give Prime Minister Turnbull a briefing on the more salient features he should look for on a visit to Nauru.\n\nUpon arrival, he will see Australia’s detention centre constructed in the middle of the island on top of the old phosphate mines stripped of soil and vegetation. This, of course, has created a landscape (or what is more accurately described as a pit) with a hot interior. The rising hot air prevents rain clouds from forming over the island and the temperatures reach an insufferable 50 degrees. \n\nHe would be greeted by high rise metal fences and rows and rows of military green tents. On a guided tour he would no doubt be interested to see the family room which accommodates families with children under 5. There he would see an entrance – covered by a flimsy curtain – to a shower facility devoid of any doors.\n\nHe may even care to strike up a conversation with the three male guards, two of whom sit directly behind, and one who sits on a desk located directly in front of, women who are naked and showering themselves and their babies. At that point Prime Minister Turnbull might ask himself whether such conditions potentially encourage abuse.\n\nPassing through to the area where single women stay with the rest of the families he will notice some of their tents located in the distance. He might look back and consider the 120 metre walk some women have to make, past the male guards, if they need to use toilet facilities in the middle of the night, particularly if they’re menstruating.\n\nPerhaps it would occur to him that this could be the reason for reports of adult Muslim women who are so frightened by the guards that they would rather wet their bed or use material from their tent during menstruation than use the facilities provided by his government. Prime Minister Turnbull may even be empathetic enough to understand the indignity suffered by any women forced into a situation where menstrual blood may fall to the ground in front of male strangers.\n\nMoving on to the medical centre, he may appreciate why its location 4-5 kms away from the detention camp creates access issues for families, particularly if their children have a medical issue.\n\nAs a special treat he may hear patients being called by their boat number because, after all, there are so many people named Mohammad on the Island.\n\nPrime Minister Turnbull may even be introduced to the six year old girl who was treated for burns around her neck because she was attempting to commit suicide with a piece of fence tie, or to the children who are wondering what crimes they have committed that they are imprisoned, or to the families in despair because of their unknown fate. In a reflective moment Prime Minister Turnbull may well ask to what extent he now bears responsibility for the savage assaults on the human rights of asylum seekers and refugees. Prime Minister Turnbull is on the public record defending Australia’s harsh asylum seeker measures on the basis that they stop the people smuggling business. Political pragmatism devoid of balanced consideration of moral and ethical issues? Is it just a coincidence that he was also a vocal critic of the artists who forced a withdrawal of Transfield as a Bienale sponsor, completely ignoring the historical role that artists have played as lightning rods in identifying the need for and facilitating social change. Prime Minister Turnbull asserts that there has never been a more exciting time to be Australian with great opportunities, but it’s a sad day when you discover that your country is not unique in its malefaction. The United Kingdom is the only country in the EU which has no limit on the length of time that asylum-seekers can be detained in conditions tantamount to high-security prison settings, yet even it still manages to immediately screenchildren who arrive without visasand release them into the community while their asylum status is determined. We do not.\n\nMany of the health professionals who speak out continue to be personally surveilled and intimidated by government authorities yet surveillance can't capture the metadata of their nightmares. Upon returning from a visit to Nauru at least Prime Minister Turnbull could sleep soundly with the comfort of knowing that he has the power to change the culture of implementing otherwise impossibly inhumane policies by deceiving the voting public, by imposing a cloak of secrecy and gagging people who wish only to disseminate the truth; and more importantly he has the power to change the lives of those people who are personally suffering from our now internationally notorious history of barbarous oppression.", "source": "On Line Opinion"}