{"published": "2015-09-15T14:15:00Z", "media-type": "News", "title": "Australian Catholic University shows faith in North Sydney with campus buy", "id": "f0f73947-06f5-4b57-81ed-1d53a7847239", "content": "The Australian Catholic University has built up its North Sydney campus with a new purchase. The Australian Catholic University is expanding its higher education and research presence in North Sydney with the purchase of an older-style office building at 33 Berry Street.\n\nThe price was not disclosed. However, market speculation indicates a value of about $100 million for the 13-storey site on the prime corner of Pacific Highway and Berry Street.\n\nColliers International's Henry Burke and Jon Chomley​ advised in the sale and declined to comment on the price.\n\nPrivate investor Horaco Property had bought the property in 1994 for about $24 million.\n\nThe acquisition of the property, which was keenly sought-after by developers for potential residential conversion, will allow the ACU to cut the cost of leasing space in the area as it meets demand from a growing student population.\n\nACU chief operating officer Stephen Weller said there had been a 53 per cent increase in student numbers at the university's North Sydney campus over the past three years.\n\nStaff numbers had also increased by 35 per cent in the same period.\n\n\"ACU's expansion reflected the university's overall strategic plan for sustainable growth and the purchase consolidated its place as part of North Sydney's thriving education precinct,\" Mr Weller said.\n\nMr Burke said being fully leased and with a mixed-use zoning, there was strong interest from investors and developers but the ACU property requirements prevailed.\n\nIn its latest research, Colliers International said the suburbs had come alive amid demand for office space because of the shrinking supply in capital cities prompted by the increased developer appetite for residential conversions.\n\nSales in the metropolitan markets, including the city fringes, have reached about $2.8 billion. Offshore investors have bought about $2.63 billion worth and private investors about $1.15 billion.\n\nColliers International's associate director of research, Anneke Thompson, said the demand for metropolitan office investments was strongest in Sydney, where in the 2015 financial year, metropolitan office sales volumes outperformed Melbourne CBD sales volumes. Colliers International's managing director of capital markets and investment sales, John Marasco​, said in North Sydney, four office assets were sold to Chinese investors for a total of almost $500 million in 2015.\n\nMr Marasco said all the buyers were major Chinese institutions. The story first appeared on The Sydney Morning Herald.", "source": "The Hepburn Advocate"}