{"published": "2015-09-12T20:17:14Z", "media-type": "Blog", "title": "The All-New No Meat Athlete Shirts are Finally Here!", "id": "4b56b865-a71f-4e9e-a8e3-b9decd2009a2", "content": "  \n \n\n \nIt’s here! The new look of No Meat Athlete has made its way to our shirts … but not without some drama. \n \nAlmost three months ago, along with a brief history of the running carrot , I announced that it was time for him to hang up his shoes. \n \nHe would be replaced by something new, something just slightly more serious and a tad bit tougher, to better convey what this plant-based athlete lifestyle and our No Meat Athlete movement is all about — on the shirts, website, and everything else. \n \nUp until then, my wife and I had folded and shipped almost every shirt, all 25,000+ of them, by hand. But with the retirement of the running carrot, we decided it was finally time to pass that job off to someone who actually knows what they’re doing when it comes to managing inventory and fulfillment. (And you know what I mean if you ever waited months for a certain style and size of shirt to be back in stock. :)) \n And it’s a good thing we did …  \n\n \nJust a few weeks after we cleared out the last of the shirts, we went to Italy on an incredible  vegan tour . \n \nBut while we were sipping Barbera and eating more homemade pasta than anybody needs to eat, a leaky refrigerator back in Asheville was slowly and perniciously flooding our house and destroying our things. \n \nMold flourished in our kitchen and basement, and I’m told a plant even grew out of our kitchen rug (no joke). Had the running carrot shirts not been retired just days before we left, what was left of the poor guy would have come to a much wetter and moldier demise. \n \nUnfortunately, the mold issues forced us to vacate our house, and for the past month my life has been turned upside down. \n \nOur family has been living with friends while we’ve looked for a new place to live, and with our daughter still in diapers and our son just starting kindergarten, I’m completely unable to think about anything except getting these guys settled again. You might have noticed a sudden drop-off in the frequency of new blog posts and podcast episodes, and I apologize for that. I’m hopeful that things will be back to normal soon. \n \nBut I only write this now because things are looking up. We’ve signed a new lease, and we’ll have a home again in a few weeks. And as for the shirts — well, since Erin and I aren’t in charge of shipping them anymore, the show can go on. \n \nWhich, of course, brings me to the reason for this post — to announce that our new shirts are now available for pre-order ! \n \nThey’re scheduled to be delivered in about three weeks, in time for you to sport the new look and show your plant-based pride at fall races. \n The Spiffy New NMA Carrot (and Nicer Shirts, too)  \nI’m thrilled with how the new logo turned out. \n \nIt’s simpler than before. It still features a carrot, but one that’s just a little bit badass. And the hidden V’s in the carrot leaves, for me, are a subtle little way of saying that as much as we try to be low-key and laid-back about the decision to eat and live this way, deep down we do take it seriously, and we’re proud to represent. \n \nI also love our new shirts themselves. We’ve replaced our most popular style — the women’s racerback — with a softer, higher-quality version made by Alo Sport: \n \n\n \n  \n \nAnd we’ve upgraded our already-soft, casual shirts (the ones I wear most often) to Next Level Apparel, a brand whose combed, ring-spun cotton makes for a difference you can feel when you touch them; they’re the softest shirts I’ve worn. \n \n\n \nWe’ve added some fun new colors, too (neon yellow, anyone?) — many which will only be available during this pre-order. Once the pre-order period is over, we’ll streamline the offerings to the handful of styles and colors that are most popular, and stock those going forward. But of course whatever is ordered now will be printed and delivered, so you just might end up with a shirt that nobody will be able to get ever again. (Wouldn’t you be the cool kid on the block, then …) \n \nAnd finally, for the die-hard running carrot fans out there — many of whom emailed me in dismay when I announced that a new logo was in the works — I have good news. The cute, classic NMA logo lives on, thanks to a new, special, limited-time shirt available only in flashy orange: \n \n\n \nI’m not sure how long this one will be around either, but I’m hoping we’ll always have at least one throwback carrot shirt in a fun color on offer, for those who remember NMA’s humble roots. \n Onward!  \nI sure hope you’ll enjoy these new shirts. They’ve taken way longer than I ever anticipated, but they’re certainly worth the wait. \n \nYou can see all the new shirts here , and pre-order yours by the end of the day on Tuesday, September 15th (to make sure you get exactly what you want). Again, the shirts are scheduled to be delivered in roughly three weeks. \n \nAnd of course, look for the new logo to become a part of the website design, which is being completely redone, along with all our social media profiles and everything else. That’s all happening now, and should be finished in the next month or so. \n \nTo the next phase of running on plants … and not having them grow out of your kitchen rug. \n \nThe post The All-New No Meat Athlete Shirts are Finally Here! appeared first on No Meat Athlete .", "source": "No Meat Athlete"}