{"published": "2015-09-17T03:16:19Z", "media-type": "News", "title": "Zoning Board rejects plan for Family Dollar store at Main and East Amherst streets", "id": "8480d240-e802-4132-8c17-e42be4d54ad0", "content": "A city panel Wednesday rejected a plan for a Family Dollar store at Main and East Amherst streets that a group of residents, as well as a prominent Buffalo developer, didn’t want in the neighborhood.\n\nThe Zoning Board of Appeals voted, 3-1, against the discount store that Hutchinson Commercial Real Estate Services of Williamsport, Pa., proposed building at 2675 Main St., site of the now-vacant former Eckerd drugstore building.\n\n“The overwhelming response to the community – so many were against it,” the Rev. James Lewis, board chairman, said in explaining why he voted against the plan.\n\nBoard member Anthony Diina, the only vote in favor, said he supported the project, given the unusual shape of the lot and the failure of the existing zoning for the property. He referred to disparaging comments made by opponents of the store as “outrageous” and also was critical of those who criticized a community organization that supported the project.\n\n“It’s clear the Zoning Board of Appeals capitulated to community opposition of a vocal minority,” said attorney Corey A. Auerbach, representing Family Dollar.\n\nThe board was being asked to approve zoning variances addressing issues including signage, parking, building size and front and side yard placement. Auerbach argued that any new construction on the irregularly shaped site would face similar zoning issues.\n\nOpposition to the Family Dollar plan, nonetheless, was strong and vocal.\n\nSome 18 people lined up in the boardroom Wednesday to speak against the plan. Among them were John A. Ciminelli, of LPCiminelli, whose company is in the process of redeveloping the nearby Central Park Plaza into a $70 million apartment complex.\n\n“It doesn’t fit here,” Ciminelli said of the store, arguing that it goes against the city’s efforts to promote a Green Code and transit-friendly development. “You don’t want to walk out of the subway station and see this,” he said.\n\nAssemblywoman Crystal D. Peoples-Stokes, D-Buffalo, also spoke against the proposal.\n\n“I represent both sides of Main Street,” the assemblywoman told the board. “What is proposed is not something people want.”\n\n“Masten constituents do not want this,” Common Council Member Ulysees O. Wingo of the Masten District.\n\nAmber Small, executive director of Parkside Community Association, also opposed the plan. The zoning changes requested are severe, she said.\n\nMelissa Brown, of FLARE Community Center on nearby Leroy Avenue, said that the group distributed surveys and that only 46 people opposed the project. About 3,000 residents live in the immediate area, she said. She didn’t have the surveys with her, but offered to provide them in the future. Wednesday, however, was the last of several Zoning Board meetings on the issue.\n\nPreviously, FLARE had been accused of supporting the project only after the developer offered a $100,000 donation. FLARE denied the accusation.\n\nemail: sschulman@buffnews.com", "source": "Buffalo News"}