{"published": "2015-09-14T14:07:27Z", "media-type": "News", "title": "Santander hikes fee on 123 current account by 150%", "id": "4ac5fbb1-8239-42c2-83f8-95b1ecf7f9e6", "content": "Santander is to dramatically hike the fees on some of its most popular products in a move that has been described as a \"kick in the teeth\" for customers. \n \nFrom January the annual cost of its 123 current account will soar from £24 to £60, while for the 123 credit card this jumps from £24 to £36. \n \nThe bank will also introduce a cap on the amount of cashback new customers can earn on the credit card. \n \nMillions of people have flocked to Santander in recent years due to the popularity of these products - and the current account in particular, which allows savers to earn up to 3% interest on balances of up to £20,000. \n \nThe bank claims it was forced to make the changes as a result of the rising cost of banking in the UK. \n \nHowever, Nicolas Frankcom, of uSwitch, noted that the timing of the announcement is odd given that a host of other banks are currently increasing their incentives to attract new customers. \n \n\"An almost threefold increase in fees is a huge kick in the teeth for Santander 123 customers,\" he said. \n \n\"Many will feel cheated by Santander moving the goalposts, and those drawn in by tempting cashback offers will have to spend more on household bills just to break even. \n \n\"It may be time for their customers to check how much they are earning on the account and vote with their feet if they are not seeing value for money. Competition in the current account market is hotting up with more banks like Halifax, TSB and Clydesdale bringing in switching incentives, and lots of accounts on the market still offering high interest on balances.\" \n   \n Share article  \n   \nWhile the increased fees mean that fewer customers will benefit from having a 123 product, they will still prove attractive to many - specifically those with a lot of savings. \n \nBy making use of the full £20,000 allowance on the current account for example, customers would be able to earn £600 interest a year before tax.", "source": "This is Local London"}