{"published": "2015-09-16T01:45:55Z", "media-type": "News", "title": "Report: Most restaurant chains receive 'F' for antibiotic use", "id": "f4dd24cc-192d-415b-b0c5-c12dc07a669d", "content": "A newly released consumer report warns about a concerning amount of antibiotics present in meat served by 20 of the 25 largest U.S. fast food and \"fast casual\" restaurants, according to CNN and other sources. \n \nWhile fast-food giants like Burger King, Domino’s and Wendy’s got failing grades, restaurants like Chipotle Mexican Grill and Panera Bread received high marks -- they received A grades, more specifically. \n \nThat’s because Chipotle and Panera – along with others like, Chick-fil-A, Dunkin' Donuts and McDonald's -- have adopted policies that either limit or prohibit the use of antibiotics in their meats.  \n USA Today details, “The report gives an F grade to 20 of the top 25 restaurant chains — including Burger King, Wendy's and KFC — because they have no disclosed policy on antibiotics use or have policies that the group deemed allow for the routine use of antibiotics in the meats they serve.”  \nChains like Starbucks and Subway also received failing grades, despite publicly stating they would limit antibiotic use. \n \nThe alarming report comes at a time when fast-food chains are facing pressure to eliminate use of human antibiotics to treat animals raised for food. \n \"When livestock producers administer antibiotics routinely to their flocks and herds, bacteria can develop resistance, thrive and even spread to our communities, contributing to the larger problem of antibiotic resistance,\" according to the “Chain Reaction” report , which was released Tuesday. \"The worsening epidemic of resistance means that antibiotics may not work when we need them most: when our kids contract a staph infection (MRSA), or our parents get a life-threatening pneumonia.\"  Citing the report by Friends of the Earth, CNN notes that most top restaurant chains in the U.S. have no publicly available policy limiting use of antibiotics in their meat and poultry supply chains.", "source": "KTNV"}