{"published": "2015-09-03T14:30:12Z", "media-type": "News", "title": "Former Yugoslav Republic of Macedonia: IMF Executive Board Concludes 2015 Article IV Consultation", "id": "c5df18e6-dfcb-4ace-9506-f244d5fe7b11", "content": "MIL OSI – \n \nSource: International Monetary Fund – Press Release/Statement: \n \nHeadline: Press Release No. 15/399 \n\r \nSeptember 3, 2015  \n \nOn August 28, 2015, the Executive Board of the International Monetary Fund (IMF) concluded the Article IV consultation 1 with the Former Yugoslav Republic of Macedonia. \n \nThe economic recovery has strengthened. Real GDP growth accelerated to 3.8 percent in 2014, from 2.7 percent in 2013. Strong growth was attributed to double-digit growth in investment driven by activities in the Technological Industrial Development Zones and public infrastructure, as well as strong private consumption supported by robust credit growth and improving labor market conditions. Facing imported deflationary pressures, monetary stance has been broadly accommodative. The decline in associated bank lending rates has helped revive credit growth to over 9.5 percent y-o-y in May 2015 from the trough reached two years ago. Exports grew robustly following a pick-up in automobile, chemical and plastic products, although net exports’ contribution to growth remained negative due to high investment-related imports. \n \nHowever, GDP growth in 2015 is expected to moderate to 3.2 percent, with significant downside risks. A derailment of recent political agreement could negatively impact economic sentiment and growth. In the medium-term, this may also complicate the opening of negotiations for the EU accession, which remains deadlocked for nine years due to the name dispute with Greece. In addition, spillover risks from a prolonged and deep crisis in Greece could weigh down growth significantly. \n \nFiscal policy space has largely been depleted since 2008. Entering the global financial crisis with one of the lowest public debt to GDP ratios in emerging Europe served FYR Macedonia well, but public sector debt since then has nearly doubled reaching 43.3 percent of GDP in 2014. In 2014, fiscal deficit widened to 4.2 percent of GDP, mainly due to a shortfall in both non-tax and capital revenues. For the first half of 2015, profit and excise taxes outperformed due to the removal of exemptions on non-reinvested profits and higher cigarette production from the government’s strategic partnership project with Philip Morris. Nevertheless, the under-performance of VAT and non-tax revenues together with wage increases for the police force and additional capital expenditures entailed by the worsened security situation are likely to result in a deficit of around 4 percent of GDP in 2015, compared to 3.4 percent targeted in the budget. \n \nMacroeconomic stability on both domestic and external fronts was sound. Deflation, mostly reflecting external prices and cuts in administered prices, ended in April 2015. Current account strengthened further in 2014 aided by strong export growth and resilient private transfers. FDI inflows held up and more than covered the current account deficit. A successful euro bond issuance in 2014 improved reserves coverage, allowing FYR Macedonia to pre-finance its 2015 external fiscal financing needs and repay the Fund earlier than scheduled. \n \nThe financial sector is well-capitalized, liquid, and profitable. Non-performing loans have stabilized at relatively low levels by regional standards, and remain fully provisioned. The steady decline in local currency to FX interest rate spreads shows improved confidence which has helped the de-euroization of both deposits and loans. Spillover risks from Greece to the financial sector are being closely monitored. \n \nExecutive Board Assessment 2 \n \nExecutive Directors praised the authorities’ efforts to promote broad-based growth, noting the support provided by public investment, improved credit conditions, and robust exports and foreign direct investment. At the same time, Directors cautioned that downside risks to the outlook include domestic political uncertainties and regional pressures. Against this background, they encouraged the authorities to strengthen fiscal policy performance and enhance policy buffers, while promoting greater private-sector-led job growth. \n \nDirectors stressed the need for further fiscal consolidation, in light of the sharp rise in public debt and limited policy space. They stressed that further measures would be needed to achieve the target set in the 2015 supplementary budget, including by collecting tax arrears and scaling back the planned increase in goods and services spending. Looking ahead, Directors welcomed the authorities’ intention to reduce the overall deficit to below 3 percent of GDP in line with their medium-term fiscal strategy and enshrine sustainability in fiscal rules. They recommended that the planned debt ceiling of 60 percent of GDP should be complemented by a lower operational threshold or debt brake to create adequate space for fiscal policy to counter macroeconomic and demographic shocks. Directors also encouraged greater efforts to strengthen public finance management, improve revenue efficiency, and rationalize expenditures. \n \nDirectors considered the conduct of monetary policy to be appropriate and welcomed the authorities’ efforts to preserve financial stability and contain possible spillovers from the crisis in Greece. They recommended that the authorities stand ready to tighten policies, including using macro-prudential instruments, in case of demand pressures or financial stability risks. Directors praised the authorities’ efforts to strengthen the supervisory framework and crisis management tools, as well as the enhanced communication and exchange of information within the European Single Supervisory Mechanism. Given the limitations of the capital flow management measures including the possibility of circumventions, they viewed the enhanced monitoring and strengthened prudential measures currently in place as warranted to counter possible regional contagion effects. \n \nDirectors welcomed the authorities’ efforts in attracting FDI and boosting exports and employment. They urged the authorities to continue with structural reforms to ensure stronger job creation and a broader sharing of prosperity through greater spillover into the domestic economy. Directors advised further efforts to ensure easier access to credit for firms, shorter delays in collecting payments, a more predictable legal and regulatory framework, better skills match, and streamlining of the numerous inspection bodies. \n \n— \n \n© Multimedia Investments Ltd Terms of Use/Disclaimer.", "source": "Foreign Affairs.co.nz"}