{"published": "2015-09-17T13:56:56Z", "media-type": "News", "title": "Magician and Stay At Home Dad Finds Success As Inventor", "id": "3515863e-524a-4770-937e-6f2b1a5cc952", "content": "Brian Foshee may be the most interesting man in the world because he successfully tackles the role of a professional magician, stay at home father, amateur hang glider, and is now tackling the role as a successful inventor of the Empower Sound product line.\n\n“I have always enjoyed watching the smile on the face of my audience when I perform magic,” Foshee says. “After inventing the Empower Sound line, I now have the pleasure of hearing so many positive responses from performers across the country that use my high quality products.”\n\nFoshee’s Empower Sound product line can best be described as mobile, convenient, and built with the performer in mind. Whether someone performs comedy, magic, or does speaking engagements, Empower Sound provides a solution. The Empower Sound line includes, but is not limited to: all in one portable PA systems; wireless microphones; speakers; special music players with secret remote controls; and numerous accessories that are great for performers of all skill levels.\n\n“As a performer, I know a little about all that can go right, but even more about what can go wrong when you are standing in front of a crowd. I decided to make the Empower Sound line based on the experiences I have had and the need to control all aspects of the performance myself.”\n\nIn addition to the Happie Amp/Amazing Amp, Jr. Pro, and UHF Pro, Foshee will be releasing his newest product soon. The newest product is the cutting edge, Empower Sound Ultimate Control BT. It combines an Mp3 player with secret remote control and Bluetooth connectivity. This device will have techies raving because of its iPhone/iPad/Android app capability. It will also be battery powered for use anywhere.\n\nFoshee says, “Performers everywhere should know Empower Sound has their back. The MP3 player is just another example of me bringing control back to the performer so they do not have to worry as much about unexpected, technical difficulties. I am sure it will be magical, pardon the pun.”\n\nThe Empower Sound products are equally as interesting and creative as their inventor. To learn more about Empower Sound, visit http://EmpowerSound.com.", "source": "Pettinga Financial Advisors"}