{"published": "2015-09-11T00:00:00Z", "media-type": "News", "title": "Ince is confident  the goals will flow", "id": "04075750-b5e8-4cb9-9e09-985c7e1de28d", "content": "TOM Ince is confident the goals and points will soon starting coming for Derby County. \n     Comments (0)   \nTOM Ince wasted no time in impressing during his loan spell at Derby County last season. Five goals in his first three games made him an instant hit. \n\nHe went on to score 11 in 18 appearances and was an obvious transfer target for the Rams, who splashed out a then club record fee of £4.75m to land him from Hull City this summer. \n\nDerby's slow start to this season has seen them fail to win in five league games and they also crashed out of the Capital One Cup at the first-round stage. \n\nInce has made five starts and one appearance as a substitute. He has yet to find the net, but the 23-year-old forward is not too worried. \n \n\"I feel all I need is a goal to get me up and running,\" he said ahead of the game at Preston today (3pm). \n\n\"I came in on loan last season and scored two straight away, and 11 in 18. I will be looking to reach that standard again,\" he added. \n\n\"I have no worries. There are 41 games to go, a long season ahead.\" \n\nInce admits there is more expectation on him this season. \n\n\"I think there is, but I can handle that,\" he said. \n\n\"I put more pressure on myself than anyone else does. I know my capabilities, I am confident in my own ability. \n\n\"Once kick off comes I try my best for the team. I work hard and try  my best defensively, but I know what I can do if I get in the final third. \n\n\"People saw what I could do last season and I have to make sure I do that again.\" \n\nInce played predominantly on the right in a 4-3-3 last season. \n\nWe have seen him in that role again this season but also at the tip of a midfield diamond in a 4-4-2. \n\n\"I just prefer being involved.  I will play where I am asked,\" he said. \n\n\"A lot of my success last season came from the right, but playing in the hole and  off Chrissy Martin allows me to be more central. \n\n\"There is no real issue for me over where I play.\" \n\nHead coach Paul Clement hoped to have nine or 10 points at this stage, and Derby have four. \n\nThey now face back-to-back away fixtures at Preston and then Reading on Tuesday, and Ince said: \"We have two games in quick succession to put that right. In this league, when you put two wins together the table can soon change. \n\n\"We have played well in spells in games and we have been on top. It is just about maintaining that consistency throughout games. \n\n\"Teams have been coming to the iPro Stadium, sitting back, playing for draws and hitting us on the counter-attack or from set pieces. \n\n\"We have to learn from that. It is a new regime here, new ideas, and the lads are starting to bed in. \n\n\"It always takes a good 10 games at the start of a season to  get into it. \n\n\"Our performances have not been bad. It is disappointing not getting any wins but you can see that is coming.  We cannot dwell on what has happened. \n\n\"We are a positive team, we believe in each other and we have to make sure we go into the next batch of games and do better. \n\n\"Everyone knows it was not the start we wanted, but sometimes these things happen.\"", "source": "Burton Mail"}