{"published": "2015-09-09T20:44:58Z", "media-type": "Blog", "title": "Introducing Bunkr: An Exciting PowerPoint Alternative", "id": "697c3510-fbe9-4b70-a54b-fb6a8881c736", "content": "Bunkr had one goal: Kill PowerPoint.  \n \nBunkr’s plans  however did not unfold as intended.  Bunkr is nothing like PowerPoint. And that is a good thing. Bunkr is designed to display web content in a presentation format, and that is it. \n \nDescribed on the Bunkr website as the first presentation tool that displays any online content,  it is clear that Bunkr’s is designed  solely to help presenters bring content from the web into a presentation.  Period. Nothing else. End of story. \n \nWith Bunkr , you will not be distracted with lots of design options to customize your slides, or various other functions that can cause you to spin your wheels in PowerPoint. Sometimes those extra features are valuable, but sometimes there are just too many bells and whistles on apps and software.  The simplicity and clarity of purpose of Bunkr is refreshing. \n \nSee for yourself… \n Read more about the Bunkr story here:  \nB unkr Is The PowerPoint Killer We’ve All Been Waiting For \n \nBunkr Is Now The Definitive PowerPoint Alternative Designed For The Web \n See inside the Bunkr platform by watching these demo videos:    \n1. Introducing BUNKR – The Presentation App That Almost Killed Powerpoint \n   \n\n \nThis video was created by the Ethos3 presentation design team to introduce you to the Bunkr features. \n \nSubscribe to the Ethos3 YouTube channel for additional tech reviews, presentation tips, and other recommendations for presenters. \n  \n2. Bunkr: Present Everything \n \n\n \nThis video was created by the Bunkr team. Here is their description for the video: \n \nWhat is Bunkr? Business Reports Made Easy! (Presentations as a Service) \n \nProblem:  Everyday, professionals create business reports with content and data coming from online platforms.They do screenshots and add them one by one into their presentation. \n \nSolution:  Bunkr is the standard presentation software that displays any data coming from online Platforms. Bunkr helps SaaS companies and their customers by providing Presentations as a Service. \n • Easy \n • Live \n • And Interactive \n \nBunkr will become the standard to present any online data from any sources. #powerpointkiller \n  \n3. Bunkr in 2 minutes \n \n\n \nThis video was also created by the Bunkr team to give you a quick but helpful tutorial for Bunkr. \n  Conclusion:  \nAre you ready to give Bunkr a try? Try it for free here: http://bunkrapp.com/  Let us know what you think! We would love to hear your thoughts. \n Additional Resources:  \nPresentation Demo – from the Prezi Team \n \nMicrosoft Sway Demo: 5 Features Of The Presentation App \n \nFlowvella Demo: 5 Features of the Presentation Software", "source": "Ethos3 - A Presentation Design Agency"}