{"published": "2015-09-07T07:00:00Z", "media-type": "News", "title": "Loan Easy Launches New Website", "id": "bf7bb058-3046-48a4-bebf-c48efbc7481a", "content": ") Sydney, New South Wales -- Australian based Loan Easy has launched a new Website to ensure an enhanced user experience and full compliance with Google's ' Mobile friendly' algorithm update. \n   Google telegraphed to business owners late last year that they wanted all websites appearing in search results to be easily viewed on mobile and tablet devices. They said it can be a \"frustrating experience for mobile searchers\" to end up on a web page that is not mobile responsive. In November 2014, they added the label 'mobile-friendly' to their mobile search results to communicate this to searchers. \nWebsites that achieved this rating have had the GoogleBot screen the Website detecting the following: if they contain software that is not common on mobile devices, the use of text that is readable without zooming, if links are far enough apart so that the correct one can be easily tapped and if content sizes to the screen so users don't have to scroll horizontally or zoom. \n\nMr Justin Doyle, principal of Loan Easy said, \"We have worked hard to ensured we provided the very best website for visitors to it and to ensure it was Fully compliant with the Google's new mobile algorithm rolled out on 21st April this year.\" He went on to say, \"We have always used the latest technology to meet the ever changing needs of our customers and worked with our web developer to ensure our website appears well on all devices.\" \n\nThose wishing to learn more about Loan Easy and visit the new website are invited to do so at http://loanseasy.com.au/ \n\nAbout Loan Easy: \nLoans Easy provides unsecured fast loans solutions at competitive easy loans rates for those who find themselves in emergency financial situations. They offer an alternative to dealing with banks and other financial institutions. \n\nThey offer fixed interest rates and easy repayment options with weekly or fortnightly payment options. \n\nLoans Easy are a member of the Credit Ombudsman Service and the Financiers Association of Australia, which means they adhere to strict codes of conduct. \n\nLoan Easy \n\nJustin Doyle \n\n0414 867 288 \n\nsales@loanseasy.com.au \n\nThis is a press release. Press release distribution and press release services by EmailWire.Com: http://www.emailwire.com/us-press-release-distribution.php. \n\nSource: EmailWire.Com", "source": "Good Day Sacramento"}