{"published": "2015-09-29T13:36:38Z", "media-type": "News", "title": "Brookwood Financial Partners, LLC Continues to Build its Property Management Team in California and Florida", "id": "4e5bd0e8-8246-48aa-85cd-47c79c0d2321", "content": "Brookwood Financial Partners, LLC Continues to Build its Property \n      Management Team in California and Florida  \n \n Brookwood \n      Financial Partners, LLC (“Brookwood”), a leading real estate \n      investment and asset management company, today announced that Delio D. \n      Contreras, Deborah D. Java, Joseph L. Lesley, Rachel Olmeda-Rodriguez \n      and Shannon R. Sarmiento have joined Brookwood Management Partners, LLC \n      (“Brookwood Management”) in its south Florida and San Diego, CA property \n      management offices. Brookwood Management is a wholly-owned subsidiary of \n      Brookwood and provides property management services for the firm’s \n      portfolio in the United States. \n \n“By adding these employees to our expanding property management team, we \n      continue to enhance our ability to provide best in class service to our \n      tenants in California and Florida,” stated Jonathan K. Dayton, \n      Brookwood’s Director of Property Management. “Delio, Deborah, Joseph, \n      Rachel and Shannon are experienced property management professionals, \n      and we are very pleased to welcome them to our team.” \n \n Mr. Contreras serves as an Operating \n      Engineer and is responsible for providing maintenance and repair work \n      and supervising vendors at Lakeside Office Center in Plantation, FL. \n      Prior to joining Brookwood, Mr. Contreras was an Operating Engineer for \n      Assesso Partners where he handled all tenant service requests and \n      provided HVAC, electrical and plumbing work to two office buildings in \n      the Fort Lauderdale area. Previously, Mr. Contreras was a Maintenance \n      Mechanic for two buildings in the Fort Lauderdale area for over 10 \n      years. Mr. Contreras holds an ESCO Institute – Universal Technician \n      Certification. \n \n Ms. Java serves as an Assistant Property \n      Manager and is responsible for providing support to the property \n      management team at Bernardo Executive Center, Four Points Office Park \n      and Mission Valley Crossroads in the San Diego area. Most recently, Ms. \n      Java was an Assistant Property Manager for Parallel Capital Partners, \n      Inc. where she assisted with property operations including property \n      maintenance, tenant requests and capital projects. Previously, Ms. Java \n      was an Operations Manager for PM Realty group where she helped managed a \n      15-story Class A office building, retail center and parking garage in \n      San Diego, CA. Ms. Java is a graduate of Humboldt State University. \n \n Mr. Lesley serves as an Operating Engineer \n      and is responsible for providing maintenance and repair work and \n      supervising vendors at Lakefront I & II in Orlando, FL. Prior to joining \n      Brookwood, Mr. Lesley was an IT Technician for the Good Samaritan \n      Society where he performed general maintenance, plumbing and electrical \n      work. Previously, Mr. Lesley was a Purchasing Assistant and Maintenance \n      Technician for the Good Samaritan Society. \n \n Ms. Olmeda-Rodriguez serves as a Property \n      Assistant and is responsible for supporting the property management \n      staff at Lakeside Office Center and Plaza 100 located in Plantation and \n      Fort Lauderdale, FL, respectively. Most recently, Ms. Olmeda-Rodriguez \n      was an Assistant Property Manager for the Lincoln Property Company where \n      she assisted with the daily management and operations of office and \n      retail space consisting of over 465,000 square feet. Previously, Ms. \n      Olmeda-Rodriguez was an Assistant Real Estate Manager for CBRE where she \n      managed all building service requests and processed account payables. \n      Ms. Olmeda-Rodriguez is a graduate of the Rochester Business Institute \n      and is a Licensed Real Estate Salesperson in Florida. \n \n Ms. Sarmiento serves as a Property Manager \n      and is responsible for overseeing the operations and maintenance of \n      Bernardo Executive Center, Four Points Office Park and Mission Valley \n      Crossroads in the San Diego area. Prior to joining Brookwood, Ms. \n      Sarmiento was a Property Manager for Davlyn Investments where she \n      managed five office buildings consisting of 380,000 square feet in \n      suburban San Diego, CA. Previously, Ms. Sarmiento worked as a \n      Transaction Coordinator with Marcus and Millichap Real Estate Brokerage \n      Company and as an Executive Assistant at Chicago Title Insurance \n      Company. Ms. Sarmiento is a graduate of California State University San \n      Marcos. \n \n About Brookwood Financial Partners, LLC – Brookwood is a \n      Massachusetts-based private investment firm founded in 1993 that \n      specializes in acquiring and managing commercial real estate and \n      corporate securities on behalf of a select group of institutional and \n      high net worth investors, family offices and trusts. Since its \n      inception, Brookwood has invested over $780 million of equity to acquire \n      a portfolio of 187 assets with a realized and unrealized value in excess \n      of $2.2 billion that has spanned multiple asset classes, geographical \n      markets and industries across the United States. \n \n \n \n\n \nView source version on businesswire.com: http://www.businesswire.com/news/home/20150929006141/en/ \n \nBrookwood Financial Partners, LLC \nJayne M. Rice, 978-927-8300 \njrice@brookwoodfinancial.com", "source": "Reuters"}