{"published": "2015-09-30T14:12:43Z", "media-type": "News", "title": "Making sustainability sexy, with Laura Wells", "id": "2b36f98d-df05-45a9-b789-4566ead35a12", "content": "IS it possible to be serious about sustainability and indulge your passion for fashion at the same time? IS it possible to be serious about sustainability and indulge your passion for fashion at the same time? Plus-sized model and environmental scientist Laura Wells certainly thinks so.\n\nIt’s all about embracing the value of vintage and pre-loved clothing and accessories.\n\nAs a Garage Sale Trail ambassador in 2015, Laura is keen to show people that reuse can be stylish as well as sustainable.\n\nWhen it comes to shopping for an amazing bargain at a garage sale, Laura says anything designer never really loses its value.\n\n“Some items even become more expensive with age! In New York City I scored an amazing vintage YSL bag for $40. It was such a great find; it really pays to sift through!”\n\nMore than 400,000 Australians are expected to hit the streets for the fifth annual Garage Sale Trail on Saturday, October 24.\n\nAn award-winning sustainability and community building campaign, Garage Sale Trail was founded in 2010 by Andrew Valder and Darryl Nichols and has grown from its humble beginnings to become a truly national phenomenon.\n\nIt’s a fun and social way to promote reuse and reduce the amount of waste going to landfill.\n\n“The excessive strain we are putting on our landfills with items that can be either reused or avoided altogether is creating a huge environmental problem especially in terms of increasing greenhouse gas emissions,” Laura said.\n\n“Many people don’t understand the correlation between landfill and climate change and then the subsequent effect this all has on the ocean. We can all do our part by limiting what we send to landfill and by recognising the value other people see in our items that we eventually deem as worthless once they have served their purpose.”\n\nAccording to Planet Ark, fabrics represent a large investment in water, energy and raw materials – with reuse having the largest environmental benefit. In fact, if every garage sale this year sold just one pair of jeans, the Garage Sale Trail would save enough water to fill over 3000 backyard swimming pools!\n\n“There are fantastic reusable options out there that will last a lifetime if looked after well,” Laura says.\n\nAnd what types of items catch Laura’s eye when she’s out on the Garage Sale Trail? “Bags, books, photographs, things that tell a story are always interesting to me. Something with an interesting history that can still be enjoyed by someone else – these are the best finds”.\n\nIf you’re planning on hosting a garage sale, Laura says the key to success will be creating a fun, friendly atmosphere.\n\n“Having music is a total must” she advises. “Also make sure everything is set out neatly and is easily accessible”.\n\nRegistration for this year’s Garage Sale Trail is now open at garagesaletrail.com.au. Fairfax Media is a partner of the Garage Sale Trail for 2", "source": "Merredin Wheatbelt Mercury"}