{"published": "2015-09-21T03:46:58Z", "media-type": "News", "title": "'Veep,' 'Game of Thrones' big winners at Emmys", "id": "cb5313ed-e5fe-48ec-8faf-fb21d57930c8", "content": "Viola Davis, Jon Hamm win lead actor in drama awards \n\nUpdated 09/20 2015 09:10PM \n\nCopyright 2015 Cable News Network/Turner Broadcasting System, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. \n\n(CNN) \n\nThe comedies \"Transparent\" and \"Veep\", as well as the drama \"Game of Thrones\", were big winners Sunday night at the 67th Primetime Emmy Awards in Los Angeles. \n\n\"Game of Thrones\" won final Emmy of the night for outstanding drama series, while \"Veep\" won for outstanding comedy series. \n\nViola Davis won outstanding lead actress in a drama series for \"How to Get Away With Murder\", and Jon Hamm wins outstanding lead actor in a drama series for \"Mad Men.\" \n\nActor Jeffrey Tambor won best actor in a comedy for Amazon's groundbreaking \"Transparent,\" about a middle-aged dad who transitions to life as a woman. Tambor, who had been nominated for six prior Emmys but had never won, dedicated his award to the transgender community. \n\n\"Thank you for your courage. Thank you for your stories. Thank you for your inspiration,\" he said. \n\nHis award came after Jill Soloway won an Emmy for directing a comedy series, again for \"Transparent.\" In accepting the award, Soloway noted that despite recent gains, many transgender people still face discrimination and violence. \n\n\"We don't have a trans tipping point yet,\" she said. \"We have a trans civil rights problem.\" \n\nFor the fourth consecutive year, Julia Louis-Dreyfus won the Emmy for lead actress in a comedy series for her starring turn in HBO's \"Veep,\" about a neglected female vice-president who ascends to the Oval Office. \n\nHer castmate Tony Hale won best supporting actor in a comedy series for playing her loyal political aide. The show also won a writing award. \n\nBut the night's biggest winner may have been \"Olive Kittredge,\" the acclaimed HBO miniseries about 25 years in the life of an acerbic, retired schoolteacher in a seemingly placid Maine town. \n\nIt took home Emmys for best limited series, best actress in a limited series (Frances McDormand, who played the title character), best actor in a limited series (Richard Jenkins, her kindly on-screen husband) and best supporting actor in a limited series (Bill Murray, who didn't show up to claim his award, unfortunately). \n\n\"Kittredge\" director Lisa Cholodenko and screenwriter Jane Anderson were also honored. \n\nEarlier, actress Allison Janney won best supporting actress in a comedy for her role in \"Mom,\" in which she plays the overbearing mother of a young adult daughter played by Anna Faris. It was Janney's sixth Emmy; she won five times before for \"The West Wing.\" \n\nThe award was presented by Amy Poehler and the ever-provocative Amy Schumer, who quipped, \"Let's not forget what this night is really about -- celebrating hilarious women and letting the Internet weigh in on who looks the worst.\" \n\nSchumer won an Emmy for best variety sketch series for her Comedy Central show, \"Inside Amy Schumer,\" which tackles such hot-button topics as misogyny and female sexuality. \"This show fights for what we believe in,\" Schumer said. \n\nIt was also a good night for retiring fake-newsman Jon Stewart, whose \"The Daily Show\" won Emmys for best variety talk series and for its director, Chuck O'Neill. \n\nActor-comedian Andy Samberg is hosting the live show, expected to run til about 11 pm ET on Fox. \n\nThe show opened with Samberg in a video that poked fun at TV's overabundance of buzzed-about shows. After being mocked by friends for not keeping up with popular new series, Samberg locks himself in a bunker and watches nothing but TV for a year until he emerges, hairy and wild-eyed, to annoy everyone around him. \n\nSamberg then did a brief monologue in which he cracked jokes about diversity in Hollywood, Paula Deen on \"Dancing With the Stars\" and -- inevitably -- presidential candidate Donald Trump. \n\n\"Donald Trump is running for president, to the delight of uncles everywhere,\" Samberg said. \"And is it just me, or does Bernie Sanders always look like his flight is delayed?\" \n\nThe Television Academy will hand out awards in 25 categories, culminating with the night's two biggest prizes: outstanding comedy and drama series. \"Game of Thrones,\" \"American Horror Story: Freak Show,\" \"House of Cards\" and \"Transparent\" top the list of shows with the most nominations. \n\nFor those keeping score, HBO leads all networks with 126 nominations (HBO is a unit of Time Warner, as is CNN). Far behind in second is ABC with 42, followed by CBS and NBC with 41 each. \n\nThe Television Academy announced new rules this year that allows all 15,000 academy members, not just smaller groups, to vote for awards -- a change some observers believe could benefit shows with large fan bases such as \"Game of Thrones.\"", "source": "WYOU"}