{"published": "2015-09-29T08:23:55Z", "media-type": "Blog", "title": "Tuesday Already ... and Feeling Fine ... How About A Chicken Bake?", "id": "be5f7d66-087d-494b-ac3d-6572f9aa018f", "content": "Do you often feel Tuesday's can be a funny day? The day after Monday and the day before mid-week, what do we do with Tuesday's?\nWhereas, Thursday's feels completely different, it is after all ... almost the end of the working week!\n... but anyway I woke up this morning feeling fine ... I looked out of the window and saw the making of a glorious sunny day ... so I'm wishing everyone a Happy Tuesday...\nI hope you may be feeling 'sparkling' as the image shows but if not, I hope you feel better as the day goes on ... and perhaps you may wish to consider this tasty dish for dinner tonight!\nChicken, Leek and Cheddar Bake\nEasy to make and ready in half an hour, this chicken, leek and Cheddar bake recipe is the perfect Tuesday evening (or midweek) chicken bake for the family. This delicious recipe serves 4 people and will take about 35 mins to rustle up. Packed with plenty of flavour, thanks to the buttery Cheddar cheese sauce and tangy leeks. This recipe uses chicken breasts but you could use other cuts of chicken too including thigh or wings to cut the cost down.  Ingredients: 1tbsp oil 4 chicken breasts, diced 2 leeks, washed and sliced 25g butter 150ml double cream 150ml full fat milk 125g Cheddar cheese, grated Method: Heat the oil in a large, non-stick frying pan and fry the chicken for 5 mins. Add the leeks and fry for 10 mins, covered. Meanwhile, melt the butter in a small saucepan (low heat) and stir in the cream. Cook for about 1 min. Off the heat, gradually whisk in the milk then bring to the boil, keep stirring. Season and add half the cheese and stir until melted. Place the chicken in a heatproof serving dish and pour over the cheese sauce. Sprinkle over the remaining cheese and place under a preheated grill for 2-3 mins until golden and bubbling. Serve with a green salad. Recipe adapted from original idea here Such an easy bake recipe - hope you enjoy it ! All the best Jan", "source": "The Low Carb Diabetic"}