{"published": "2015-09-22T19:40:59Z", "media-type": "News", "title": "Big bills for apartment owners", "id": "861464c0-1255-4f30-bb9f-5d795348e6ca", "content": "JASON DORDAY/FAIRFAX NZ    \nJohn Gray of HOBANZ says he's never seen an apartment building with an adequate long term maintenance plan. \n             \nUnderfunded apartment buildings around the country are set to fall into disrepair unless owners stump up the thousands of dollars required to fix them. \n \nThe law requires unit title complexes to have long term maintenance plans (LTMPs), but not long term maintenance funds to back them up. \n \nAs a consequence most apartment and townhouse bodies corporate will not have the money when it comes to big bills such as replacing the lift, the air conditioning, or re-roofing, property experts say. \n \nMany LTMPs are also inexpertly done, leaving out even urgently required work, they say. \n \nIt means owners will be hit with huge special levies, or face the prospect of crumbling and devaluing properties. \n \nIt is more and more of an issue as Auckland in particular intensifies, according to Home Owners and Buyers Association (HOBANZ) president John Gray. \n \n\"Not only have we got the legacy issues related to the buildings that have already been built and are now not being properly maintained, now we're also looking at this explosion in the number of unit title complexes that are being built,\" he said. \n \n\"We're just going to repeat the same mistakes all over again.\" \n \nHe had reviewed in excess of 200 LTMPs and was yet to see an adequate one, he said. In some cases they even excluded weathertightness issues. \n \n\"That has meant that bodies corporate have fallen off the 10-year cliff (timeframe for taking legal action), because they thought there was nothing wrong with their building.\" \n \nProperty law expert Joanna Pidgeon said the biggest issue was that the Unit Titles Act allowed owners to opt out of funding their LTMPs. \n \nThe act was \"a toothless tiger\", she said. \n \n\"I have seen a building going without air conditioning for a month and people installing fans to try and cope. It's not ideal in the middle of summer. \n \n\"I would say the majority (of apartment buildings) don't fund properly and lurch from special levy to special levy.\" \n \nShe added that because many apartments were sold at auction, buyers often bought without knowing this background. \n \nThey wouldn't see the LTMP documentation until after the contract was signed, and some vendors even charged to provide it. \n \n\"Really if the act had been designed better, you'd say, 'well, surely that LTMP should be part of that bundle of information that the agent has to disclose to a purchaser'.\" \n \nThe Ministry of Business, Employment and Information (MBIE), which now encompasses the old Department of Building and Housing, was failing in its duty, Gray said. \n \n\"They should be stamping on this,\" he said. \n \nIn 2012 HOBANZ asked the department to review the LTMP of the ShoalHaven Apartments in Takapuna, on Auckland's North Shore. \n    \nUnder the act MBIE has the power to \"monitor and report on the financial and maintenance planning regimes of bodies corporate\". \n \nAt the time the 134-apartment complex's maintenance plan said it should have $1.3 million in its fund. It had $110,000. \n \nThe department refused to investigate, saying \"monitor and report\" refers to checking whether bodies corporate have a LTMP and fund, not assessing how adequate they are. \n \n Fund controversy at ShoalHaven   \n \nTakapuna's ShoalHaven Apartments is a modern development of 134 units near the bus station and supermarket, and within striking distance of the beach. \n \nIts residents range from young families to retired people and the pleasant communal area of pool, petanque court and lawn appears well used. \n \nThe body corporate fees are reasonable, ranging from $3500 to $5500 a year depending on the size of apartment. \n \nThere has been controversy over its governance, not least the funding of its Long Term Maintenance Plan (LTMP). \n \nIn 2012 the 30-year plan said it should have $2.1 million in the kitty by this year. At the time it had $110,000. \n \nThe funding is not adequate, said real estate agent Lyn Lockwood who has advised some owners. \n \n\"It's a concern of several owners I've had dealings with, a very big concern.\" \n \nMany owners are absentee, she said. \"They do not attend the (body corporate) AGM to hear any discussion, and they're not given any wider explanation except a sentence of choice, which way to go.\" \n \nThings have changed from when the complex was first built in 2007 and around 40 owners are now resident, current body corporate committee member Duncan Erasmus says. \n \nThey have made a decision to be \"lean and mean\", he says. \n \n\"We had a body corporate meeting in 2013 and we made the call that we'd rather run on a reasonable amount and not accumulate huge piles of money, with the idea that there's no sense in having $4 million sitting there for decades with no clear purpose.\" \n \nA revised 15-year LTMP was done, and the fund is currently 44 per cent funded - amounting to around $400,000 in the pot, he says. \n \nShoalHaven's body corporate manager, Sharron O'Sullivan of About Body Corporates, says very few buildings in Auckland have fully funded long term maintenance funds. \n \n\"It's really up to the owners what they choose to do, it's their property.\" \n              \r     Comments", "source": "Southland Times"}