{"published": "2015-09-16T06:55:06Z", "media-type": "News", "title": "ECB says QE relatively small so far, has scope - Constancio", "id": "6ffee02b-6282-4461-8b26-f136dc855d3e", "content": "By By | Reuters  –  \nBy Balazs Koranyi and John O'Donnell \n \nFRANKFURT (Reuters) - The European Central Bank has scope to buy more assets as its quantitative easing has been small compared to similar schemes elsewhere, ECB Vice President Vitor Constancio said, adding that Europe also needs the U.S. and Chinese economies to motor ahead. \n \nThe asset buys, started in March to lift the bloc out of deflation, helped Europe to weather the Greek and Chinese turmoil but euro area inflation could turn negative again in the coming months so the bank stands ready to increase the size, composition and duration of the scheme, if necessary, Constancio said. \n \nDrawing a comparison with other major central banks around the globe, Constancio said the European scheme is dwarfed by past asset buys, particularly by the U.S. Federal Reserve and the Bank of Japan. \n \n\"The total amount that we have purchased represents 5.3 percent of the GDP (gross domestic product) of the euro area, whereas what the Fed has done represents almost 25 percent of the U.S. GDP, what the Bank of Japan has done represents 64 percent of the Japanese GDP and what the U.K. has done 21 percent of the UK’s GDP,\" Constancio told Reuters in an interview. \n \n\"So we are very far from what the major central banks have done,\" Constancio, 71, said. \"This is not a benchmark ...(but) there is scope, if the necessity is there.\" \n \nBut Constancio also dismissed criticism from some that quantitative easing was not working, pointing to improved inflation expectations, growth in bank lending and a drop in borrowing costs despite the anxiety in financial markets. \n \nHe also said that the bank needs to look through volatility even if market turbulence is now more prevalent than in the past. \n \n\"Monetary policy is not about fine tuning volatility in financial markets,\" he said. \"Central banks should be independent from financial markets and not follow all their fluctuations.\" \n \nThe ECB's 1 trillion-euro plus asset-buying programme is set to run for another year but the majority of analysts polled by Reuters expect the scheme to be expanded as sharply lower commodity prices dampen long term price expectations and as inflation, now at 0.2 percent, takes years to pick up. [ID:nL4N11G3IE] \n \nIndeed, one of the ECB's top measures of long-term inflation expectations, the five-year, five-year euro zone breakeven forward has fallen to below 1.7 percent, short of the ECB's inflation target of just under 2 percent. \n \nPointing to uncertainties, Constancio said much depended on  the United States and China. \n \n\"We need a strong recovery in the U.S.,\" Constancio said. \"China can still stabilise its situation and to keep growth above 6 percent is achievable in the short term.\" \n \nChina cranked up fiscal spending by 26 percent in August compared to a year earlier as recent data provided further evidence that world's second-largest economy continues to lose momentum. [ID:nL4N11L12I] \n \nConstancio also urged Europe to accept immigrants to keep its workforce from shrinking further, saying it needed more workers to boost economic growth. [ID:nL5N11L0UF] \n \nGREECE \n \nAlthough the Greek crisis shook confidence in the euro area, Constancio said ejecting Athens from the currency was \"never for real\" because it would not be legal and Europe now has to erase any lingering doubts about the bloc's viability. \n \nThe new Greek government, due to take office after elections this month, must commit to the 85 billion euro bailout deal and if the programme stays on course, the easing of capital controls may not be far off. \n \n\"The stage is set for a gradual dismantling of the capital controls,\" Constancio said. \"They will be eliminated as they were in Cyprus.\" \n \nHe added Greek debt should not be viewed in simple ratios and he expects views, including those of the International Monetary Fund, to converge when debt sustainability is discussed in the first review. \n \n\"A haircut has been refused by the member states and I certainly hope it will not be necessary in view of the numbers,\" Constancio added. \"The more one digs into the numbers, the more that sort of conclusion seems to emerge.\" \n \n(Editing by Ruth Pitchford)", "source": "Yahoo! India"}