{"published": "2015-09-28T01:15:00Z", "media-type": "News", "title": "LETTER TO THE EDITOR: Letter from one mother to another", "id": "1cb74d5d-7011-4788-b13b-2c90c0e8f2e5", "content": "To the Stay-at-Home Mom, \n  \nI see you with your hair perfectly straightened and your cute jeans. I see you with your newest baby on your hip or in the stroller out and about during the week day. I know the wonderful dinner that awaits your husband and children after school. I smell your freshly laundered clothes that were folded as soon as the dryer was finished. I see the hours you spend working on homework with your child and reading books. I know the grocery shopping that you are able to do during the day. \n      \nDo you see me with my hair in a ponytail because I woke up late for work? Do you see my kids with papers stuffed in their backpacks because I was too tired to look at everything? Do you know my kids ate something frozen for dinner because it was almost bedtime by the time I got home? Do you know I rushed my child through her homework because I wanted to see her for a while with her eyes opened? Did you see me run hurriedly through the grocery store with my list of other errands that needed to be made before finally heading home? Do you know I look at you with jealousy because I wish I were you? \n \nI just wish someone had told me how hard being a working mom would be. Yes, I chose my career. Yes, I chose to have kids. When my kids were little, I didn’t realize how precious the time was that was being lost. I didn’t realize I would turn around and my kid would be 13 years old. I didn’t know I would look back at pictures and remember the days through a fog of exhaustion and work consumption. \n \nYoung woman, pursue your degree, reach for the stars, but don’t define your life by your career status. Look carefully at your choices as you navigate the course of life. Understand that life is fleeting and moments turn into days that turn into years. \n \nLooking back, I would have easily traded the new car, expensive beauticians and Macy’s to spend time with my beautiful kids. My career would have been waiting for me underneath the piles of laundry and restless nights worrying about work. I just didn’t realize how quickly time would go by. \n \nI see you, stay-at-home mom. I long for a few more minutes of cuddle time with my 9-year-old. I wish I could have a nice hearty dinner every night for my 13-year-old football player. I desire to pay more attention to my husband, but deadlines, bosses and time keep me from noticing how great he is. I stare at my children every morning before waking them, wishing I could steal away a few extra minutes to talk to them. \n \nWorking moms, if you must work-work, but don’t let the career that you so desperately desire keep you from soaking up every moment with your kids. The deadlines and pressures of the job will try to rob you of joy and peace. Live in this moment — right now. \n \nStay-at-home mom, think of the rest of us pulling hours at work wishing we were at home with our kids or preparing for their arrival at home. As you spend your days focused on the home and your family, think of us moms out there working — by choice or by desire, and count yourself blessed. Blessed by the opportunity to pay attention to the small things, blessed by the moments spent rocking your baby to sleep, and blessed knowing your minutes and hours are spent investing in the lives of your family. \n \nTo all the working moms, be encouraged. Be encouraged in knowing you are doing what you can to be the best mom for your child. Be encouraged that your children know you love them. Be encouraged knowing we are all on a journey spent loving our families. \n \nTo the working mom and stay-at-home mom, our kids will grow. Their faces will change, their interests will vastly change, but their need for mom only grows bigger. Listen to the giggles and stay calm through the eye rolls. Moms on the other side of the journey would tell us to slow down and live in the moment — without regret and without regard for what’s next on the agenda for the day. Enjoy today. It only comes around once. \n \nCarrie Garza \n \nSplendora, Texas", "source": "Dayton News"}