{"published": "2015-09-30T12:40:11Z", "media-type": "News", "title": "Jeremy Corbyn on Labour collision course after ruling out nuclear strike", "id": "9f3ce7b3-e154-4cf4-a913-58d5579761fb", "content": "Jeremy Corbyn has put himself on collision course with his own Labour shadow cabinet over defence policy by declaring he would never launch a nuclear strike if he was prime minister. \n \r\n\t\t\r \nThe Labour leader, who said he could \"obviously\" imagine being in Number 10, stressed he has a mandate from party members for his opposition to renewing the Trident nuclear deterrent. \n\r  Labour leader Jeremy Corbyn said he would not press the nuclear button if he was in Downing Street \r \r \nBut his comments were described as unhelpful by shadow defence secretary Maria Eagle, who said they  \"undermined to some degree\" the review she is carrying out of the party's defence policy. \n\r\n\t\t\t\r \nMs Eagle told the BBC that L abour's current policy is in favour of retaining a nuclear deterrent, adding: \"I don't think that a potential prime minister answering a question like that, in the way in which he did, is helpful.\" \n\r\n\r\n\r\n\r \nResponding to Ms Eagle's comment, Mr Corbyn told reporters: \"We will be having a discussion and a debate about nuclear weapons. We are going to have discussion and a debate about how we fulfil our obligations under the Nuclear Non-Proliferation Treaty and we will go forward from there. \n\n\"There's no decision required until probably next summer on this. \n\r  Labour leader Jeremy Corbyn ahead of day four of the annual party conference at the Brighton Centre in Brighton \r \r \n\"I hold a view which is well known on nuclear weapons and it is a view which I have held all my life.\" \n\nAsked whether he stood by his statement that he would not use nuclear weapons as PM, he replied: \"Would anybody press the nuclear button?\" \n\r\n\t\t\t\r \nHe added: \"Nuclear weapons are weapons of mass destruction that take out millions of civilians. They didn't do the USA much good on 9/11. The problems of this world are not huge wars in that way, the problems are much more from random acts of terrorism.\" \n\nShadow transport minister Jonathan Reynolds made clear that the Labour front bench team is divided on Trident and said the party needs a \"national debate\" on the issue, telling BBC Radio 5 Live: \"There's lots of different views on this and we'll obviously have to have a policy (debate), perhaps a free vote, on what that decision should be.\" \n\nAsked if he could serve in a front bench team which chose to scrap Trident, Mr Reynolds said: \"It depends on the outcome of that debate and conversation. I'm very cautious about giving it up. It's been the cornerstone of our security for so long.\" \n\nSpeaking on BBC Radio 4's Today programme, Mr Corbyn said \"we are not in the era of the Cold War any more\" as he defended his stance on Trident but insisted Labour is not a \"divided party\". \n\r\n\t\t\t\r \nHe said: \"There are five declared nuclear weapon states in the world. There are three others that have nuclear weapons. That is eight countries out of 192.\" \n\nAsked if he would use nuclear weapons if he was in Downing Street, he said: \"No. 187 countries don't feel the need to have a nuclear weapon to protect their security, why should those five need it themselves? We are not in the era of the Cold War any more. \n\n\"I am opposed to the use of nuclear weapons, I am opposed to the holding of nuclear weapons. I want to see a nuclear-free world. I believe it is possible.\" \n\nMr Corbyn also insisted a political solution rather than military action against Islamic State in Syria is needed because \"you don't solve every problem necessarily by going in and bombing\". \n\n\"There are people in the party who have different views, but what we are all united on is that Isil's behaviour, its actions and its brutality are totally appalling,\" he told ITV's Good Morning Britain. \n\r\n\t\t\t\r \n\"There has to be an end to the fighting. There also has to be a cutting off of the funds and the arms that Isil are using, there has to be a ceasefire amongst the other forces within Syria. \n\n\"Maybe some progress has been made on that. You don't solve every problem necessarily by going in and bombing. Basically all wars have to end with a political solution.\" \n\nMr Corbyn said it is too early to say whether Labour MPs would be given a free vote in the Commons on military action in Syria, and indicated he still hopes to reach consensus on the issue within his shadow cabinet. \n\nThe Labour leader told the Press Association: \"We will have a discussion both here in the conference and within the parliamentary party and, of course, within the shadow cabinet. Maybe we will reach an agreement - I hope we will. \n\n\"This is obviously a central and crucial issue. I think what's at the background to this is that many, many people in the Labour Party have dreadful memories of what happened over the war in Iraq in 2003 and the mission creep that's accompanied by what starts off as a simple process - you do some bombing and maybe that doesn't work and then the whole thing gets worse and worse from there. \n\n\"I think there's quite a long way to go before we actually reach that conclusion and a decision.\" \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Mirfieldtoday"}