{"published": "2015-09-04T07:05:08Z", "media-type": "Blog", "title": "Boom on the Rose: Hayne caps huge preseason by decking Chargers CB", "id": "5a6dd8f7-b02e-4f21-b657-65a449cdc4fc", "content": "Boom on the Rose: Hayne caps huge preseason by decking Chargers CB By Eric Branch on September 4, 2015 12:05 AM Jarryd Hayne ended the preseason with a bang.\t49ers0904\nNiners running back Jarryd Hayne levels Chargers cornerback Lowell Rose at the end of a 12-yard reception Thursday. (Scott Strazzante/The Chronicle) Just ask Chargers cornerback Lowell Rose. Hayne, 6-foot-2, and 220 pounds, lowered the boom on Rose (6-1, 192) at the end of a 12-yard reception in the third quarter of the 49ers’ 14-12 win over San Diego on Thursday night. Hayne remained upright. Rose did not. And the players on the 49ers sideline, who had a front-row seat to the collision, erupted. What did head coach Jim Tomsula see from his vantage point? “I’m not going disrespect any other player,” Tomsula said. “But I can tell you, Jarryd is a tough guy.” And he’ll also be a part of the 53-man roster, which will be made official when the 49ers pare the roster from 75 to 53 players by 1 p.m. Saturday. The former Australian rugby league star capped a surprisingly sensational summer with a strong all-around performance. He rushed for 58 yards on 10 carries, had two receptions for 17 yards and returned three punts for 43 yards. He also sprinted downfield and dropped Javontee Herndon for a one-yard loss after a 39-yard punt by Bradley Pinion. Hayne finished the preseason ranked second in the NFL in rushing yards (175) and he averaged a league-best 7.0 yards a carry. He also averaged 18.1 yards on nine punt returns and had a 33-yard kickoff return. He also learned how to lower his shoulder – unfortunately for Rose.\t“You know, technique and just working every week about lowering my pads and playing through someone,” Hayne said. “To understand it tonight and really lower my pads, it was exciting.” Hayne wasn’t the only returner to excel. Rookie wide receiver DeAndrew White had a 36-yard punt return, while wideout Bruce Ellington had a 26-yard return and another runback of about 60 yards nullified by a penalty. Ellington handled kick returns last year as a rookie and he hopes to reprise the role this season. However, he seems to understand Hayne is likely to assume that duty. “He can help us a lot,” Ellington said. “He knows how to set it up and make big plays. Special teams, that’s something we didn’t have last year. So I think with him, he can help us out a lot.” Twitter: @Eric_Branch\tCategories: 49ers Tags: San Francisco 49ers Eric Branch", "source": "Niner Insider"}