{"published": "2015-08-13T00:54:55Z", "media-type": "Blog", "title": "MAMER MOTORSPORTS TAKES ON CARNAGE AT INAGURAL LOORRS BAJA RACE ROUNDS 11&12", "id": "29e0ed1f-47b6-42b7-9961-087728f1035c", "content": "MAMER MOTORSPORTS TAKES ON CARNAGE AT INAGURAL LOORRS BAJA RACE ROUNDS 11&12 \nCole Mamer and his team were prepared as they could be as they went south of the American border and pulled into the new Lucas Oil Off Road Race Series course at Estero Beach. The new course was located just miles outside of Ensenada, Baja California. \n \nLOORRS added in the new race course to this season race schedule and as many teams were nervous about taking the series to a new stop, Mamer Motorsports was excited for the change of pace, new fans and a new course to race the #35 Mamer Motorsports Pro-Lite on. \n \nIt wasn’t long before the trucks were on the course running down four practices just in one day. The course provided the drivers with nearly a mile long of door to door opportunities to attempt a pass. The key to this course was to stay out of the dust, keep clean through the turns and keep on the gas you went through the rhythm section. \n \n\nWhen race day came Saturday, fans were lined at the gate waiting in anticipation to see a new form of off-road racing that hasn’t been to Baja since 2002. The thrill of meeting new drivers, seeing crews work on the trucks and witnessing first hand the carnage that can go into short course racing had the fans on their feet all day. \n \nThe Pro-Lite race was the second race of the day and Mamer had to line up at the back of the stacked class after qualifying didn’t go his way. This didn’t stop Mamer though as that green flag dropped he immediately made 3 passes right out of turn one. When a wreck on the first lap brought out a full course yellow the trucks had to restart the race and Mamer had to go back to his original starting position. \n \nThe 15 trucks took on the restart and once again Mamer went for multiple passes and pulled it off, this time passing 4 trucks on the restart lap. This was great momentum for Mamer as he let the race come to him. \n \n\nA dusty course didn’t distract the driver as he battled with Creed looking to take over the 6th place position. The 10 lap race was ticking down and once Creed crashed it moved Mamer up to that 6th place. He was on the tail of DeBerti as they were coming through the rhythm section when he found himself and DeBerti both getting sideways and with a quick reaction Mamer steered out of the way as DeBerti was spinning through the air and wrecking. \n \nEven though Mamer managed to avoid a major accident, his truck didn’t make it out alive as he fell to the back of the pack with broken front end of the truck. Mamer pushed through the rest of the race with a limp truck in 10th, but still was able to salvage some points. \n \n\nMamer rounded out the weekend with a 9th place finish in round 12 and will be heading to Reno, NV for rounds 13&14 sitting 10th in points. Reno will provide the racers with many elevation changes, high speed sections and one last chance to really fight for a higher points standing before they head into the final stretch of the season. \n \nThe post MAMER MOTORSPORTS TAKES ON CARNAGE AT INAGURAL LOORRS BAJA RACE ROUNDS 11&12 appeared first on race-deZert.com .", "source": "race-deZert.com"}