{"published": "2015-09-25T20:44:25Z", "media-type": "News", "title": "U.S., China make progress; differences lurk", "id": "6920a209-0b2c-48e6-8e2b-14f7f0f9de8c", "content": "President Barack Obama said Friday that China and the United States had agreed to work to avoid military misunderstandings and desist from cybertheft for commercial gain during a state visit with Chinese President Xi Jinping. \n\nFirst Lady Michelle Obama and China's first lady Peng Liyuan announced Friday that the panda born last month in Washington, D.C., has been named \"Bei Bei,\" which means \"precious treasure,\" according to the Smithsonian's National Zoo. \n\nChinese President Xi Jinping has faced a barrage of criticism from U.S. presidential hopefuls recently, but American and other foreign students living in China think he's a handsome, wise and humble leader, who's strong on foreign policy. \n\nAt least th...\n\nDuring his second day in Seattle, Chinese President Xi Jinping met Wednesday with some of the biggest names in tech and then toured a Boeing airplane factory.\n\nThe aerospace and defense giant has a history of close ties to China. Boeing helped develop ...\n\nChinese President Xi Jinping arrives in Washington on Thursday for his first official state visit, and his interactions with President Barack Obama are sure to include some awkward conversations.\n\nXi will be welcomed to the White House at two dinners -...\n\nA key measure of China's all-important manufacturing sector has nose-dived to its lowest level in 78 months, yet another sign that the country's factories are running out of steam. \n\nThe \"flash\" measure of sentiment among manufacturing purchasing manag...\n\nPresident Xi Jinping said that China is ready to open a \"high-level\" dialogue with the U.S. to fight cybercrime, while insisting that his government has never engaged in hacking.\n\n\"Commercial cybertheft and hacking against government networks are crime...\n\nBut his guest, appearing beside him at a news conference in the White House Rose Garden, staunchly defended China's territorial claims, which are inflaming tensions in Asia and testing China's ties with Washington, a security guarantor in the region since World War II.\n\nThe summit, which opened with a 21-gun salute and later Friday will feature a state dinner, comes at a time when the two great powers are seeking to find areas of cooperation on issues like climate and terrorism. But the effort comes amidst rising tensions on subjects including territorial claims and cyberhacking that have fueled fears that the two countries are destined for a new era of confrontation.\n\n\"Even as our nations cooperate, I believe, and I know you agree, that we must address our differences candidly,\" Obama told Xi.\n\nThe Chinese leader, speaking through a translator, also admitted that the nations do not see eye-to-eye on everything and told Obama they needed to \"respect each other's interests and concerns, (and) be broadminded about our differences and disagreements.\"\n\nThose differences were on display as Obama announced a deal under which the two sides agreed not to conduct cybertheft against one another but warned that he was still ready to impose sanctions against Chinese entities proven to have taken part in such activity -- a threat that overshadowed the runup to the summit.\n\n\"I indicated that it has to stop,\" Obama said. \"What I've said to President Xi and what I say to the American people is, the question now is, are words followed by actions? And we will be watching carefully to make an assessment as to whether progress has been made in this area.\"\n\nThe announcement comes on the heels of the massive Office of Personnel Management hack announced in June -- which officials have blamed on the Chinese. On Wednesday, OPM said that up to 5.6 million fingerprints were among the more than 21.5 million current, former and prospective federal employee records stolen in the hack. \n\nThere was no undertaking by the two countries not to conduct cyber espionage by intelligence agencies, however.\n\nObama and Xi also discussed rising regional tensions in Asia sparked by Beijing's construction of military installations on man-made islands and disputed reefs in the South China Sea.\n\n\"We agreed to new channels of communication to reduce the risk of miscalculations between our militaries,\" Obama said.\n\nThe deals require captains of naval vessels to ensure prompt communication, to make their intentions clear, to maintain a safe distance and to avoid \"uncivil language\" or \"unfriendly physical gestures\" to head off collisions that could mushroom into national security standoffs.\n\nThe agreement also says that aircraft flying in international airspace have the right to defend themselves but should respect the rights of the other side as well.\n\nIn addition, the United States and China also reached an agreement to facilitate crisis communications between the U.S. and Chinese militaries meant to defuse tensions and to avoid escalations after any incidents between their armed forces.\n\nThe moves come amid rising tension in the South and East China seas over China's territorial claims and after U.S. officials this week accused a Chinese jet pilot of making a unsafe pass near a U.S. aircraft over the Yellow Sea.\n\nThe intercept follows a more dangerous maneuver last year when an armed Chinese fighter jet came within approximately 20 feet of a U.S. Navy P-8 aircraft, at one point rolling to its side to show the U.S. plane its weapons load, Pentagon officials said at the time.\n\nBeijing has taken an increasingly aggressive posture in the South China Sea and disputes over territories in the East China Sea continue to cause tension between Beijing and its neighbors, many of which are close U.S. allies. In the South China Sea, China is building a series of man-made, militarized islands 600 miles off its coastline and then claiming the surrounding air and sea rights. In the East China Sea, China has claimed sovereignty over islands -- some uninhabited -- that Japan also claims.\n\nBut Xi made clear that despite U.S. concerns and rising anger among Washington's allies in the region, China has no intention of ceding ground on its territorial claims.\n\n\"Islands in the South China Sea since ancient times are China's territory. We have the right to uphold our own territorial sovereignty and lawful and legitimate maritime rights and interests,\" Xi said.\n\nHe said that China was entitled to build structures on disputed atolls in the Spratly Islands in the South China Sea but did not intend to militarize them. In May, a U.S. surveillance plane carrying a CNN crew was warned eight times by the Chinese navy after it flew over Chinese installations in the area.\n\nThe United States does not take a position on the sovereignty of disputed islands in the area but wants the issue resolved multilaterally, officials have said.\n\nChina, seeking to exploit its size and influence, prefers the disputes to be resolved one-on-one with nations involved and rejects a role four what it sees as outsiders, like the United States.\n\nObama, who has been criticized, including by Republican 2016 presidential candidates, of doing too little to pressure China over its human rights record, pointedly brought up the issue in front of Xi at the news conference.\n\n\"We recognize that there are real differences there, and President Xi shared his views in terms of how he can move forward in a step-by-step way that preserves Chinese unity,\" he said.\n\nObama also mentioned the name of Tibet's spiritual leader -- who is regarded by China as a separatist. \n\n\"Even as we recognize Tibet is part of the People's Republic of China, we continue to encourage Chinese authorities to preserve the religious and cultural identity of the Tibetan people, and to engage the Dalai Lama or his representatives,\" he said.\n\nXi said he was willing to have a human rights dialogue with the United States, but as is customary with Chinese leaders, he pointed out that the concept of human rights was seen differently in Beijing\n\n\"We must recognize that countries have different historical processes and realities, that we need to respect people of all countries in the rights to choose their own development independently,\" he said.\n\nAnd with the eyes of the world on China's economy, amid fears that a slowdown and a stock market clump could tip the world into recession, Xi promised a \"proactive fiscal policy and prudent monetary policy\" to restore growth rates to around 7%.", "source": "KCRA.com"}