{"published": "2015-09-29T08:04:35Z", "media-type": "News", "title": "Diet Doc's Customized Diet and Nutrition Plans Target Trapped Abdominal Fat, Thought to Help Sharpen Cognitive Skills, Increase Brain Power and Reduce Dementia Risk", "id": "fba6d238-6e1e-46b4-a348-900017d82685", "content": "LOS ANGELES, Sept. 29, 2015 (GLOBE NEWSWIRE) -- Alzheimer's disease affects about 5 million Americans. Researchers continue to seek out the reason why these numbers are so high and why they continue to rise. Scientists are finally understanding the link between what people put in their bodies and cognitive decline. Because Diet Doc is a medical weight loss program and nutrition plan, they too understand the correlation between dietary nutrition and brain power. And, for this reason, they have researched various diets that have proven to be healthy. They sought out and sliced the most important elements of each of these diets, including the Mediterranean Diet, to create their diet and nutrition plan that enables people throughout the country to shed excess fat safely, quickly and comfortably while reducing the risk for countless weight-related diseases and conditions and providing optimal nutrition to the brain for increased cognition and reduced dementia risk. And, because research indicates that effective weight loss is determined to be the most proactive method to prevent obesity-linked cognitive decline, Diet Doc offers its most advanced diet and nutrition plans, capable of melting up to 20 pounds or more per month. \n\nDiet Doc offers people in any part of the country the most advanced and modern weight loss approach that includes unlimited consultation with their specially trained doctors, nurses, nutritionists and weight loss coaches. They work closely with each patient to create diet and nutrition plans that are unique to each patient's personal age, gender, activity level and medical conditions. They monitor each patient's progress through online weekly checkup calls and are always only a phone call or an email away for questions, concerns and support. Their diet plans are capable of safely and successfully burning 20 or more pounds per month while reducing the risk for countless weight-related diseases and conditions. And, because Diet Doc is a medical weight loss program they understand how and why the body and the brain respond to specific foods and which foods work most effectively to, not only melt excess fat, but also keep the brain optimally nourished for improved cognitive function and a reduced risk for dementia and Alzheimer's disease. \n\nNew patients should call 888-934-4451 or simply visit www.dietdoc.com to complete a health questionnaire and schedule an online personal consultation with a Diet Doc physician. Qualified patients who desire to see faster weight loss results may be prescribed one or more of the company's safe and powerful diet products, including their hormone diet treatments that work to seek out stored fat from the most difficult to lose areas of the body, triggering its release into the bloodstream to be burned and quickly flushed from the system. Their impressive stable of safe and effective diet products also include their exclusive diet pills, appetite suppressants and powerful fat burners and fat blockers that, not only melt fat faster, but also help patients over the initial weight loss hurdles by controlling hunger, cravings, headaches and fatigue during dieting. Over 97 percent of Diet Doc patients across the country report the very noticeable loss of pounds and inches within days of beginning the program. \n\nAvailable nationwide via telemedicine, Diet Doc's medical weight loss programs are a safe, effective and affordable alternative to invasive, expensive, and risky surgical procedures and ineffective yo-yo diets. By formulating a safe method for fast weight loss, patients throughout the country are looking and feeling better than ever before, decreasing their risk for countless weight-related diseases, improving their brain power and cognition and reducing their dementia risk. Call today to schedule a no-cost, confidential consultation. \n\nAbout the Company: \n\nDiet Doc Weight Loss is the nation's leader in medical, weight loss offering a full line of prescription medication, doctor, nurse and nutritional coaching support. For over a decade, Diet Doc has produced a sophisticated, doctor designed weight loss program that addresses each individual specific health need to promote fast, safe and long term weight loss. \n\nDiet Doc Contact Information: \n\nProviding care across the USA \n\nHeadquarters: \n\nSan Diego, CA \n\n(888) 934-4451 \n\nInfo@DietDoc.info \n\nhttp://www.dietdoc.com  \n\nTwitter: https://twitter.com/DietDocMedical \n\nFacebook: https://www.facebook/DietDocMedicalWeightLoss?ref=hl \n\nLinkedin: https://www.linkedin.com/company/diet-doc-weight-loss?trk=biz-brand-tree-co-logo \nContact: Jwright@dietdoc.com", "source": "Yahoo! 7 Finance"}