{"published": "2015-09-05T01:00:00Z", "media-type": "News", "title": "Deputies testify in trial of Los Alamos standoff suspect", "id": "979f232a-810b-4fa4-8032-430156103ec8", "content": "Santa Barbara County Sheriff's deputies testified Friday that they were aware that a Los Alamos man accused of making threats against his sister owned multiple guns when they went to his house to interview him in March, an incident that turned into an hourslong standoff with the department's special enforcement team. \n\nRonald Joseph Carrari, 56, is charged with making criminal threats and resisting arrest stemming from the March 20 incident. His sister, Christina Carrari, had called the Sheriff's Department to report that he had threatened her. \n\nFour deputies responding to the report went to Ronald Carrari's house south of Los Alamos, where he refused to come out of the house because the deputies did not have a warrant. Two of the responding deputies testified Friday that Ronald Carrari had said he was going to get his guns. \n\n\"I heard him say, 'You got your guns, I'm getting mine,'\" Deputy Jonathan Fleming said. \n\nHowever, Fleming and Deputy Bobby Fortier also testified that they had actually seen him holding a gun. A search of his home yielded eight guns, including one that is apparently illegal under California law, a Taurus handgun that fires .410 shotgun shells, making it a short-barreled shotgun. \n\nAt some point during the incident, Ronald Carrari, audibly upset, called 911, expressing fear that deputies were going to kill him and saying that the Sheriff's Department had a \"vendetta\" against him. \n\nAfter being arrested under suspicion of making criminal threats and resisting arrest, Ronald Carrari bailed out of jail. He was rearrested after being accused of threatening his sister again several days later. \n\nThe two incidents apparently stemmed from Christina Carrari limiting the hours that her brother could visit their ailing mother, although Ronald Carrari had a history of not getting along with other members of the family, and his father and his developmentally disabled brother had recently obtained restraining orders against him. \n\nChristina Carrari testified that her brother was allowed to visit their mother between 10 a.m. and 2 p.m., which she said were \"her best hours.\" \n\nOther family members were not subject to the visitation hours. Christina Carrari testified that this was due to Ronald Carrari's prior behavior. \n\n\"He was upsetting mom as well as wreaking havoc with all of us,\" she said. \n\nTheir mother died March 18. \n\nThe second incident in which Ronald Carrari is accused of threatening his sister occurred at a memorial service for their mother. Ronald Carrari allegedly placed a memorial planter box with threatening messages written on it outside of the Union Hotel, where the service was being held.  \n\nTestimony will continue Wednesday morning.", "source": "Santa Ynez Valley News"}