{"published": "2015-09-15T01:42:12Z", "media-type": "News", "title": "CJ dedicates new judicial year to self-accountability", "id": "a3f0292f-7570-449d-9ab5-92b033f0a676", "content": "ISLAMABAD: The new judicial year 2015-16 commenced on Monday with the newly elevated Chief Justice Anwar Zaheer Jamali expressing a resolve to dedicate the period to self-accountability by reactivating the Supreme Judicial Council (SJC) – a constitutional body that holds the superior court judges accountable. \n\n“The SJC is being activated in view of the pending complaints before it under Article 209 of the Constitution against different judges,” the chief justice said. \n\nRight activists Asma Jehangir had on a number of occasions drawn the apex court’s attention to the complaints pending before the SJC against different judges. \n\nAlso read: Justice Anwar Zaheer Jamali sworn in as country's top judge  \n\nSpeaking at the opening ceremony of the new judicial year at the Supreme Court, Chief Justice Jamali, in his speech in Urdu, expressed the hope that the process of self-accountability would not be a one-sided affair and that bar councils would also revive their disciplinary committees for accountability of delinquent lawyers in accordance with the law. \nAnnounces reactivation of Supreme Judicial Council  \nReferring to a heavy backlog of 26,000 cases in the Supreme Court despite the fact that the judges had been continuously trying to clear the pendency of 15,000 cases, the chief justice blamed a number of factors, including last year’s sit-ins by the PTI and PAT on the Constitution Avenue blocking the easy access of litigants as well as counsel to the courts and resulting in unnecessary delay in hearings of different cases for several months. \n\nThe other factors include lengthy proceedings on important petitions against the 18th and 21st amendments by a full court as well as preoccupation by a bench of the Supreme Court which investigated allegations of rigging in the 2013 general elections. \n\nThese factors, the CJ said, had resulted in accumulation of a large number of cases in the apex court. \n\nReferring to the court’s Human Rights Cell (HRC), he said the cell had disposed of 28,034 complaints generally against police excesses, insensitivity and lack of governance by the administration, trampling the rights of women and minorities and delay in issuance of pension to retired employees. \n\nAt present, he added, the HRC was seized with 11,002 complaints and the cell set up to also look into the complaints of overseas Pakistanis had cleared 1,394 of the 2,055 cases. \n\nThe chief justice said the offices falling vacant because of recent retirement of two judges would be filled soon. \n\nThe Law and Justice Commission of Pakistan (LJPC) has formed committees under two retired judges of the Supreme Court – Justices Mian Shakirullh Jan and Khilji Arif Hussain – to prepare recommendations for improving and simplifying the existing laws for the benefit of common citizens. “Being chairman of the LJCP, it will be my endeavour to bring reforms by ending malpractices and corruption in the judiciary for better results,” the CJ said. \n\nHe expressed the hope that the recent judgments by the Supreme Court, especially on the poll rigging case, would help bring reforms and eliminate social evils from society. \n\nEarlier, Attorney General Salman Aslam Butt drew the attention of the Supreme Court to a recent tendency of suspending laws made by parliament, especially on imposition of taxes, by courts at an interim stage and sometimes without even issuing a notice to the government side. \n\n“Taxation is a sovereign function of the state and the constitution guarantees that no tax will be levied except under a law,” he said. He stressed the need for following the mandate of the constitution in letter and spirit as laid down by the apex court to overcome this problem. \n\nThe attorney general said the government had submitted a bill to parliament for reforming the civil justice system which also aimed at discouraging frivolous litigations. He regretted that despite stressing the importance of fundamental rights of access to justice, “we are still struggling to enforce it for the benefit of the common man”. \n\nPakistan Bar Council’s Vice Chairman Azam Nazeer Tarar said the Supreme Court was a seat of justice, but not a seat of power. The resolution of delicate political issues is not the domain of the apex court even if a constitutional garb allows it. \n\nThe judgments by the court, he said, must be based on strong legal foundations and address grievances or violations of rights, adding that a number of sound judgments might be unpopular but they were judged as upright, while others were sadly perceived to be populist and pandering to personal desires of judges. \n\nEthnic and linguistic rights are among the most delicate political issues in the country and cannot be resolved with the stroke of a pen but through a political consensus. \n\nReferring to the upholding of military courts set up under the 21st Amendment, Mr Tarar expressed scepticism over the logic that there were basic features of the constitution, including the fundamental rights, but at the same time these fundamental rights were not offended by the trials of civilians in the military courts. \n\nHe said the holding of courts till late evening would not end the backlog of cases and denying lawyers their legitimate need to take off during vacations would not add to efficiency. \n\nThe Supreme Court Bar Association president urged the chief justice to consider and rectify what he called horrible effects of the July 31, 2009, judgment whereby more than 100 judges had been removed against the norms of the constitution. \n\nPublished in Dawn, September 15th, 2015 \n\nOn a mobile phone? Get the Dawn", "source": "DAWN Group"}