{"published": "2015-09-23T21:19:12Z", "media-type": "News", "title": "CHINO HILLS: Report finds issues with death penalty trial, attorneys...", "id": "81d27097-3f04-4d7e-a85c-754763f5848a", "content": "CHINO HILLS: Report finds issues with death penalty trial, attorneys plea for retrial \n\nPin It \n\n1 of 2 \n\nConvicted killer Kevin Cooper listens as a judge in San Diego, Calif., sentenced him to death in this file photo taken May 15, 1985. Lawyers for Cooper declared him a victim of a police frame job for the 1983 hatchet murders of four Chino Hills residents while state prosecutors portrayed him as a cold-blooded killer, with forensic evidence putting him at the San Bernadino County crime scene and in the getaway car. Those were the arguments presented Jan. 9, 2007, to a three-judge panel of the 9th U.S. Circuit Court of Appeals in San Francisco. \n\nAP Photo \n\nAttorneys for Death Row inmate Kevin Cooper are asking Governor Jerry Brown to grant their client a retrial in the wake of a scathing report released Wednesday, Sept. 23, by the Inter-American Commission on Human Rights. \n\nThe Inter-American Commission on Human Rights, an organ of the international human rights advocacy group the Organization of American States, in its report found \"multiple violations of Cooper's human rights during his prosecution, conviction and sentencing.\" Cooper's attorney's from the Orrick, Herrington & Sutcliffe law firm plan to present the report to Brown in hopes that he will grant their client a new trial which will include forensic testing, according to a statement issued by the law firm. \n\n\"Before an innocent man is executed, we urge Governor Brown to take the steps that the (report) recommends: to review Mr. Cooper’s trial and sentence,’’ said Norman Hile, one of Cooper's lawyers. “Mr. Cooper deserves the chance to prove that he is innocent.” \n\nCooper was convicted in the 1983 Chino Hills slayings of four victims that included two children. Throughout the trial and appeal process, Cooper has maintained that evidence was planted or contaminated, that he was framed for the murders, and the real killer or killers have escaped justice. \n\nThe Inter-American Commission on Human Right's report found eight instances of \"the denial of Cooper's right to due process\" during the trial and appeals processes. Those instances include evidence mishandling, evidence destruction and evidence tampering by law enforcement and the prosecution, according to the report. \n\nThe report also found \"ineffective assistance by Cooper's trial counsel,\" as well as instances of racism during evidence gathering, Cooper's prosecution and in the imposition of the death penalty. \n\nThe report recommends that Cooper be granted \"effective relief, including a review of his trial and sentence in accordance with the guarantees of due process and a fair trial... \"", "source": "Riverside Press Enterprise"}