{"published": "2015-09-16T14:25:42Z", "media-type": "News", "title": "Nick Grimshaw For Topman Is Finally Here!", "id": "9a318073-d599-4e67-93b7-5de4f8f2e085", "content": "It's official: Nick Grimshaw has turned designer for Topman. We've known it's been in the works, as Nick held a super starry party back in June to celebrate his collection for the high street hot spot, attended by all his A-list pals.\n\nCheck prints and denim make for a seriously cool off-duty wardrobe \n\nNow though, the official campaign shots are in, and the launch date has been revealed. As of October 14th, we can all shop the slouchy shirts and awesome jackets we've been catching glimpses of on the likes of Harry Styles and Grimmy himself. We know it's a TopMAN collection, but trust us when we say that you're going to want it ALL for yourself. \n\nNick shows off his modelling skills like a pro in the sultry black and white shots, sporting fringed jackets, varisty cover ups and ripped jeans. We're pleased to say even his beloved dog Pig gets a starring role, showing up in both the campaign shots and also on one of the knits. \n\nNick Grimshaw's beloved dog Pig also stars in the campaign \n\n\"I've always loved clothes and I love these ones so much that I asked Topman to make them for me! They said yes- so here they are, hope you love them too!\" Nick said. We do love them. We just hope that the boys are ready to fight us for them. \n\n31/07/15:\n\nYesterday, the Radio 1 DJ got us all excited with a sneaky Instagram pic that gave us a glimpse of the new range, along with the caption 'coming soon.' \n\nShowing off part of a black jacket with fringe detail, the Insta snap is not the first look we've had; at the glitzy bash a month ago, Nick was sporting some of his designs along with BFF Harry Styles. In fact, the two of them were pretty much twinning in monochrome printed shirts, black jeans and brown boots. And from what we've seen so far, we predict that this collab is going to be a sell-out. READ: Nick Grimshaw has been spotted in this shirt from his upcoming Topman collection, which was also worn by Harry Styles at a party to celebrate the collaboration back in June \n\nWhile in theory we'll be bagging these buys for our boyfriends, we're probably more likely to be keeping them for ourselves. Oversized man shirts and fringed jackets? Sounds like just what our wardrobe needs. And, given that Nick is one of Kate Moss' best pals, we reckon she's probably been giving him some tips, which makes the prospect of this collection even more exciting.\n\nThis might be Nick's first turn as a designer, but he's certainly no stranger to the fashion scene. As well as all his model friends (Cara D, Daisy Lowe and Pixie Geldof, to name a few), Nick has been an ambassador for London Collections: Men for a couple of years now, and is often seen sitting FROW-side with the likes of David Gandy and Tinie Tempah. What with all this and his new X Factor role as a judge, Nick's one very busy guy. \n\nSee: 6 Times Cheryl Fernandez-Versini Proved She's The Nation's Sweetheart\n\nNick is a judge on the latest series of X Factor, along with Cheryl, Rita Ora and Simon Cowell \n\nKeep your eyes peeled for more Instagram revelations- we have a feeling this collection will be landing in stores sooner than you think. You'll just have to fight your boyfriend for it.", "source": "Look"}