{"published": "2015-09-16T20:32:01Z", "media-type": "News", "title": "Waxahachie starting QB Jordan Kitna out 6-8 weeks with broken collarbone", "id": "19700d3a-e553-4171-a548-b054aabff2de", "content": "Waxahachie starting quarterback Jordan Kitna is expected to be sidelined for six to eight weeks with a broken collarbone, his father, Waxahachie coach Jon Kitna, said Wednesday. \n\nWaxahachie (3-0), No. 4 in the Class 5A area rankings , has seven regular-season games remaining. When asked if his son would miss the rest of the season, Kitna said, \"I'll never say definitely. He's excited about attacking the rehab, and we'll just see what happens from there.\" He said his son had surgery Tuesday night. \n\n\nThe Waxahachie coach said it hasn't been decided whether junior Tyler Navarro or sophomore Bryce Salik will take over as the starting quarterback. Navarro had been the varsity backup, and Salik had been on the junior varsity.      \n\n\nJon Kitna, a former NFL quarterback, said his son was injured on his 28-yard touchdown run in the second quarter of Friday's 38-20 win over Ennis, then the state's fifth-ranked 5A team. But the younger Kitna kept playing, and it wasn't discovered that he had a broken collarbone until Saturday morning. \n\n\"They did all the tests on it. They didn't know it was broken [during the game], because he had full range of motion and he was still throwing the ball 50 yards,\" Jon Kitna said. \n\n \nAfter being injured, Jordan Kitna scored on a 1-yard run in the third quarter. He completed 15 of 28 passes for 155 yards in the game and ran for 48 yards and two touchdowns on nine carries in Waxahachie's win over Ennis .  \n\n\nJordan Kitna was an all-state quarterback in Tacoma, Wash., and threw for 3,702 yards and 55 touchdowns last season before transferring to Waxahachie when his father became the coach. This season, he ranked fourth among area 5A players in passing yards (786) and had completed 63 percent of his passes while throwing for eight touchdowns. \n\n\nFriday marked Waxahachie's first victory over Ennis since 2012 and the first time it has scored over 30 points in a game since 2009. \n \nOn Twitter: \n  @DMNGregRiddle", "source": "Dallas Morning News"}