{"published": "2015-09-06T13:33:06Z", "media-type": "Blog", "title": "Leaders should know lotus and cactus...a HR insight", "id": "5898a13b-0cef-46c6-a730-af6f5acc0118", "content": "Who suffers the most, the water plants or cactus? Plants in general struggle both to retain and obtain water for its survival. The aquatic plants wants easily loose water from their leaves but never want to loose water from their habitat.\nOn the other hand, the cactus plants store and retain water in their body but never want water in their habitat.\nLook at the contradiction. Water plants cannot afford to accumulate too much of water in their body. To get rid of excess water only the aquatic plants have stomata in the upper surface of leaves, quite opposite of other plants. When they have evolved to loose water from their body so easily, they cannot afford to loose water in their habitat.\nThe management message is that the individual needs and collective needs are always different. The collective need can be quite opposite of individual need. Therefore every form of life has evolved to protect both collective and individual need however contradictory and paradoxical they may appear. This paradox only brings sense of responsibility to oneself and to his or her ecosystem.\nThe irony is that only when the aquatic plants survive, they can protect the water body from evaporation. Similarly, only when the water body thrives, the aquatic plants can thrive.\nThe mechanism of their survival can be different, but the ultimate purpose is mutual dependency and mutual protection. Dependency must make one to protect and not destroy. This sense of responsibility every corporate employee must inculcate. Contradiction should not be always seen as something negative but only the end result must be seen.\nOn the contrary, the cactus struggles a lot to protect water in its body. But the same cactus may not grow well if water is available in plenty in its habitat. The marvel of nature is mind boggling.\nThe corporate people must understand the meaning from paradox and not the contradictions and must be very responsible.\nMany corporate employees wish to enjoy all comforts from the organization and would expect huge salary but never wish the organization to do well. If possible they might even secretly work against the organization. The question they need to understand is that how they can fulfill all their desires when the organization fare bad?\nAlthough the individual and collective needs of plants may although appear quite opposite to each other, but still we can see a sense of responsibility among plants.\nEvery plant when they protect own interest also protect their ecosystem where they live. The corporate employees must learn this fact that only when they work towards the goal of the organization, both the organization and the employees can find success.\nDr S Ranganathan, ClinRise Derma Pvt., Ltd., Chennai Comments:\nThis article has 0 comment, leave your comment.", "source": "ModernGhana News"}