{"published": "2015-09-24T14:31:00Z", "media-type": "News", "title": "Woahstork  $900000  Financing. Niccolo Reggente  Filed Sep 23 Form D", "id": "8f50c985-9eb6-4aec-b2b0-990f3392ba5d", "content": "Woahstork  Financing  \nWoahstork, Inc., Corporation just  filed form D  regarding $900,000 debt financing. This is a new filing. Woahstork, Inc. is expected to  fundraise $900,000 in this  fundraising offer. The total  fundraising amount was $900,000.  The financing form was filed on 2015-09-23. The reason for the financing was: unspecified. The fundraising still has about $900,000 more and is not closed yet. We have to wait more to see if the offering will be fully taken.  \nWoahstork  is based in California. The  company’s business is not disclosed. The  form D was  filed by Niccolo Reggente CEO/President.  The company was incorporated in 2015. The filler’s address is: 1127 21St St., Unit 2, Santa Monica, Ca, California, 90403.  Niccolo Reggente is the related person in the form and it has address: 1127 21St St., Unit 2, Santa Monica, Ca, California, 90403. Link to Woahstork  Filing: 000106594915000238 . \n Analysis of Woahstork  Offering  \nOn average,  companies in the not disclosed sector, sell 67.77% of the total offering  amount . Woahstork  sold 0.00% of the offering.  The fundraising is still open. The average  investment floor size for companies in all industries in our database is $3.05 million. The offering was 100.00% smaller than the average of $3.05 million.  Of course this should not be  interpreted as negative.  Firms  get financed for  different  needs and reasons. The minimum investment for this  offering  was set at $10000. If you know more about the reasons for the  fundraising, please comment below. \n What is Form D? What It Is Used For  \nForm D disclosures could be used to track and understand better your competitors. The information in Form D is usually highly confidential for ventures and startups and they don’t like revealing it. This is because it reveals amount raised or planned to be raised as well as reasons for the financing. This could help competitors. Entrepreneurs usually want to keep their financing a ‘secret’ so they can stay in stealth mode for longer. \n Why Fundraising Reporting Is Good For Woahstork  Also  \nThe Form D signed by Niccolo Reggente might help Woahstork, Inc.’s sector. First, it helps potential customers feel more safe to deal with a firm that is well financed. The odds are higher that it will stay in the business. Second, this could attract other investors such as venture-capital firms, funds and angels. Third, positive PR effects could even bring leasing firms and venture lenders. \n \nThe post appeared first on Octafinance .", "source": "Octafinance"}