{"published": "2015-09-04T18:51:00Z", "media-type": "Blog", "title": "Inbox - The Week's Whisky News (September 4, 2015)", "id": "0d105326-1a62-48e2-a0f9-4216f2c29549", "content": "You are here Inbox - The Week's Whisky News (September 4, 2015) Published by Whisky For Everyone on Friday, September 4, 2015 - 2:51pm\nWelcome to this week's Inbox.  For those that have recently discovered us, Inbox is our weekly round up of whisky news and PR material that has found its way in to our email inbox. It was created as we cannot write full articles or do justice to every piece received. It features items from around the world of whisky and is published by us each Friday.\nWithin Inbox we aim to write a few lines detailing each press release/piece of news/PR event that we have received and provide links, where possible, for you to find out further information. Here is what has caught our attention this week.  There is quite a bit ...\n________\nDeveron - The Last Great Malt\nJohn Dewars & Sons, the owners of the Macduff distillery in northern Aberdeenshire, have announced that the first ever range of single malts from the distillery are to be released this October.  These will be bottled as The Deveron, the name of the river while runs next to Macduff and then out in to the North sea.  The new range will feature expressions of 10, 12 and 18 years of age with all bottled at 40% ABV.  The price of the 10 years old is still to be confirmed but the 12 years old will be £39 and the 18 years old £79.\nThe Macduff distillery is relatively modern and was founded in 1962.  The Deveron 10 years old will be exclusive to France with the 12 and 18 years old being available in selected world markets including Canada, France, Germany, Japan, Russia, Sweden, Taiwan, the UK and the USA. The range is the last to be released in Dewars' series called The Last Great Malts.  This has seen whiskies released from their five Scottish distilleries.\nGlenfiddich - Gets a reboot\nThe world's best selling single malt has announced that it will be releasing new packaging for the remainder of its core range.  The new bottle design and presentation tube for the Glenfiddich 12 and 15 years old expressions will appear in retailers worldwide from mid-September.  This joins the 18 years old Small Batch single malt, which appeared on the market back in November last year.  The bottle and packaging feature a more prominent and evolved stag logo, gold trim, bolder type and a cream band around the base.\nSarah Harding, the Senior Brand Manager for Glenfiddich, commented: “We are thrilled with the refreshed core range. Glenfiddich is a superior whisky, so naturally we want its presentation to match the quality of the award winning liquid. The prestigious new look will hopefully capture and reflect our whisky making credentials and the brand’s authenticity and family heritage.” Gordon & MacPhail - Generations in the making\nOne of Scotland's largest and leading independent whisky bottlers has unveiled its oldest and most unique single malt to date - the Mortlach 75 years old.  The bottling is the latest in Gordon & MacPhail's Generations series, which has seen them showcase some of their oldest casks. Third and fourth generations of the Urquhart family, the owners of Gordon & MacPhail joined distinguished guests at the launch held at The Royal Opera House in London.\nThe whisky was distilled at the Mortlach distillery in Speyside and then laid down to mature in a first-fill ex-sherry cask in November 1939.  It has been under the careful watch of Gordon & MacPhail ever since and has been bottled at the natural cask strength of 44.4% ABV after 75 years.  There are just 100 bottles available and these will be priced at £20,000 each.\nThe Mortlach 75 years old Generations comes presented in a bespoke crystal decanter featuring 75 cuts to represent each year of maturation, a presentation plinth and two crystal glasses.  This sits in an Aniline leather bag, which includes a special book written by Charles Maclean and Alexander McCall Smith.\nRoyal Brackla - The Last but one Great Malt\nJohn Dewar & Sons have announced a range of single malts from its Royal Brackla distillery in Speyside.  The distillery was founded in 1812 and was the first Scotch whisky distillery to receive a Royal Warrant (by William IV in 1835).  The new range forms part of Dewars' larger range called The Last Great Malts, which showcases whisky from each of their five distilleries.  Ranges from Aberfeldy, Aultmore and Craigellachie are already on the market with Macduff (bottled under the Deveron name) to follow this Autumn (see above).\nThe Royal Brackla range features expressions of 12, 16 and 21 years of age.  They will be priced at £46, £85 and £175 respectively.  All are bottled at 40% and will be available from mid-September in 10 worldwide markets - Canada, France, Germany, Japan, Russia, Sweden, Taiwan, the UK and the USA, plus Global Travel Retail. Stephen Marshall, Global Marketing Manager for The Last Great Malts, said: “This was described as ‘The Drink Divine’ by the Royal household in the 1830s, so we had to take our time and the entire team have done an amazing job that really does justice to Royal Brackla’s incredible heritage. There’s only one whisky in the world that can be the first Royal whisky and I feel privileged to have worked on this”.  Speyside - Back in black\nThe Speyside distillery near Kingussie in the Cairngorm mountains has launched a new 'black whisky' named Beinn Dubh.  This translates as 'black mountain' from Gaelic and refers to the mountain Ben Macdui, which is the highest in the Cairngorms and also known as Beinn Dubh by locals.  The whisky has been finished in toasted ex-Port casks from the Douro Valley in Portugal and this is what is said to give the very dark colour.  It was launched at the Thunder In The Glens, Europe's largest Harley Davidson festival, in Aviemore earlier this week.  Beinn Dubh is bottled at 43% ABV and has a recommended price of £50 a bottle. Patricia Dillon, the Managing Director for Speyside Distillers Ltd, said: \"Like the mountain, the whisky is dark and mysterious. It is very much the whisky of the Cairngorms – the water used in its production is from the Black Mountain itself, and the malted barley is sourced locally. We are passionate about the Cairngorms and they are very much part of the distillery’s story.\" Read more about Inbox - The Week&#039;s Whisky News (September 4, 2015)", "source": "ForWhiskeyLovers"}