{"published": "2015-09-07T03:34:21Z", "media-type": "News", "title": "Iraq to use new warplanes acquired from US against Islamic State", "id": "9ca0cc7c-f387-4a8b-b745-2e88ebaf8c59", "content": "Commander of the Iraq air force said that they have put F-16 warplanes, acquired from the United States, into use against the Islamic State group for the first time. \n\r \n\"Fifteen air strikes were carried out in the past four days,\" staff lieutenant general Anwar Hama Amin told AFP following a news conference in Baghdad. \n\"Smart weapons\" were used in the strikes, Amin said, without specifying the type. \n\r \nDefence minister Khaled al-Obaidi told the news conference that the strikes had achieved \"important results\" and that the jets will have \"an impact on the conduct of operations in the future.\" \n\r \nAmin told the news conference that the F-16 strikes had taken place in Salaheddin and Kirkuk provinces, north of Baghdad. \n\r \nThe first four Iraqi F-16s arrived from the United States in mid-July, out of a total of 36 Washington has agreed to sell to Baghdad. \n\r \nThe purchase had been a source of tension, with Baghdad repeatedly complaining that they have not been delivered quickly enough. \n\r \nInsecurity in Iraq, where IS seized significant territory in June 2014, had delayed the delivery of the jets, with the first batch being sent to Arizona, where Iraqi pilots have been training. \n\r \nAn Iraqi pilot was killed when his F-16 crashed during training in Arizona earlier this year. \n\r \nF-16 jets are much more sophisticated than other aircraft in Baghdad's arsenal and will boost Iraq's capacity for air strikes, which are currently carried out by ageing Sukhoi Su-25 jets, Cessna Caravan turboprop aircraft and various helicopters. \n\r \nBut with foreign aircraft from the international anti-IS coalition also carrying out strikes against the jihadists on a daily basis, the delivery is not seen as a game changer in the war against the militants. \n\r \nIn Washington, Pentagon spokesman Peter Cook said the United States \"commend the Iraqi Air Force for its successful use of this cutting-edge aircraft in the international campaign to degrade and ultimately defeat\" Islamic State. \n\r \n\"The United States is committed to building a strategic partnership with Iraq and the Iraqi people and we will continue to work with the government of Iraq on the delivery of the remaining aircraft as they become available within the framework of the production schedule,\" Cook said.", "source": "Hindustan Times"}