{"published": "2015-09-03T00:57:47Z", "media-type": "Blog", "title": "\"Large Number of Inmates in Solitary Poses Problem for Justice System, Study Says; Supreme Court justices, lawmakers and corrections officials have criticized the practice\"", "id": "9011124b-d53a-41b0-ab3d-8e22bc04b6a3", "content": "Wednesday, September 2, 2015\n\"Large Number of Inmates in Solitary Poses Problem for Justice System, Study Says; Supreme Court justices, lawmakers and corrections officials have criticized the practice\": Jess Bravin of The Wall Street Journal has this report.\nPosted at 08:57 PM by Howard Bashman \"Possible 'Coming Liberal Disaster' on Class Actions, Too\": Patricia W. Moore has this post today at the \"Civil Procedure & Federal Courts Blog.\"\nPosted at 03:24 PM by Howard Bashman \"Judge eager to re-enter NSA surveillance fight\": Josh Gerstein has this blog post online today at Politico.com.\nPosted at 03:21 PM by Howard Bashman \"Texas Two-Steps All Over Voting Rights: It says it can make voting as difficult as it wants to, and any law that says otherwise is unconstitutional.\" Law professor Richard L. Hasen -- author of the \"Election Law Blog\" -- has this jurisprudence essay online today at Slate.\nPosted at 01:32 PM by Howard Bashman \"FAN 75 (First Amendment News) Justice Kagan & the future of Abood, the strength of stare decisis, & the relevance of Garcetti\": Ronald K.L. Collins has this post today at \"Concurring Opinions.\"\nPosted at 10:15 AM by Howard Bashman \"The Coming Liberal Disaster at the Supreme Court\": Jeffrey Toobin has this post online today at The New Yorker.\nPosted at 08:37 AM by Howard Bashman \"A Supreme Court Justice Will Appear as Guest on Stephen Colbert's Late Show\": Mediaite has this report.\nPosted at 08:35 AM by Howard Bashman \"Clerk in gay marriage fight once unlikely to wage moral war\": The Associated Press has this report. The Lexington Herald-Leader has a front page article headlined \"Judge orders Rowan clerk to appear in court Thursday after she again denies marriage licenses.\" And The Louisville Courier-Journal has a front page article headlined \"Kim Davis gets Matt Bevin's 'absolute' backing.\"\nPosted at 08:21 AM by Howard Bashman \"Sands China recruits Alan Dershowitz for lawsuit appeal\": The Associated Press has this report.\nPosted at 08:07 AM by Howard Bashman \"Alabama's gay marriage loss could cost taxpayers $200,000\": Casey Toner of The Mobile Press-Register has this report.\nPosted at 08:00 AM by Howard Bashman \"Court says Shelby County can't collect $2 million in legal fees for voting rights lawsuit\": Kent Faulk of The Birmingham News has this report. Lawrence Hurley of Reuters reports that \"U.S. court denies $2 million legal fees to conservatives in voting rights case.\" And at \"SCOTUSblog,\" Lyle Denniston has a post titled \"When is a Supreme Court victory not a win?\" You can access yesterday's ruling of the U.S. Court of Appeals for the D.C. Circuit at this link.\nPosted at 07:56 AM by Howard Bashman", "source": "How Appealing"}