{"published": "2015-09-03T11:03:37Z", "media-type": "Blog", "title": "Saeed Ajmal optimistic over ‘limited-overs’ career", "id": "ceb3eebd-8d4d-4277-b55e-524311be55ae", "content": "Pakistan’s man-to-go in recent past, off-spinner Saeed Ajmal, believes he will hang his boots with ‘respect’ and ‘honour’ after he discusses his future with the national selectors. \n \nThe 37-year-old was optimistic that he still has the mettle to be a ‘good limited-overs bowler’ while dismissing the speculation that he might retire soon. \n \nAfter being banned and making a comeback with a remodelled action, Ajmal’s recent stint with English county Worcestershire ended and he opined that he still has ‘two years of competitive cricket’ left in him. \n \n“I never wanted to retire in obscurity as I have done enough for Pakistan to win matches singlehandedly,” Ajmal said, while to ESPNcricinfo in an interview. \n \n“I want to retire with respect and honour. I will definitely sit with the selectors and discuss my future plan with them.” \n \nAjmal’s career took a fall when he was banned in September last year. He worked five month on his action and made a comeback but only to see his effectiveness wither. \n \nHis stats against Worcestershire are also not enough evidence to prove that he still has got that sting before he was made to change his action and bowl within the allowed 15 degree limit. After playing nearly the entire season, Ajmal bagged 16 wickets with an average of 51.25. \n \n“Obviously I needed some time to settle down with my bowling action,” Ajmal said. \n \n“I could have persisted for the national selection earlier but it might have been a risky case as we have seen [Mohammad] Hafeez is reported again after been cleared. So it’s a matter of getting things right and wait for the right time.” \n \nAjmal, who made his debut at the age of 31, made up for the time he had missed out in the middle by bagging nearly 400 scalps across all formats. His bowling miracles earned him a chance to lead the T20 side as well which he declined gracefully saying that he was happy as a ‘team player’. \n \n“Cricket is cruel sometimes but I always said one can’t relax,” Ajmal said. \n \n“People forget the good and make the bad part our defining feature. There are ups and downs in cricket and you can’t deny the fact every day is a new day and you can’t be taking five or ten wickets in every match. We are human and it is natural to have good days and bad days. \n \n“Regardless of being reported, there were odds that I might have faced a dip in form, could have struggled taking wickets with previous action as well and then what? Actually it’s not really a case that I am not effective, it’s a matter of form and confidence that I just need to hit and I have started to get flow. \n \n“I know I am not able to get wickets in four-day cricket maybe because the pitches [in England] are green, soft and it rains a lot but at the same time I am still a better limited-overs bowler and taking wickets in the shorter format. I was assured that I will be considered and won’t be discarded. I also understand that Yasir and Zulfi are doing very well and I don’t want to dislodge their place but I think there is some room for me in limited-overs cricket and I will prove that in the T20 cup in Pakistan.” \n \nPakistan chief selector Haroon Rasheed admired Ajmal’s persistence and said he was ready to assess his performance in the upcoming National T20 tournament. \n \n“I understand Ajmal has been a number one bowler and has been a great servant for Pakistan cricket and we never wanted to discard him. But we want an effective Ajmal and we are always open for any discussion with him,” said Rasheed. \n \n“We are not asking him to retire or stay away but he needs to realise the situation realistically where he stands and what is the requirement. \n \n“We have created such an environment for anyone to come to us and discuss with us about anything. But at the same time he has a opportunity to play in the T20 cup next week and there we will consider his performance.” \n \nThe post Saeed Ajmal optimistic over ‘limited-overs’ career appeared first on The Express Tribune .", "source": "The Express TribuneThe Express Tribune"}