{"published": "2015-09-22T20:06:04Z", "media-type": "News", "title": "Let’s try to live together in peace", "id": "9c82740d-f4ae-497e-8d7b-f626185b8115", "content": "HOPE: A boy holds onto a fence as he waits with other migrants and refugees to register at a camp after crossing the Greek-Macedonian border near Gevgelija. PICTURE: AFP/NIKOLAY DOYCHINOV  Source: AFP  \n        \n TWO weeks ago I wrote about compassion, and was lambasted by some readers.  \n   \nI expected that. \n\nMy subject was refugees, and how we should be taking them in, not turning them away. \n\nOn the day the piece appeared, former Prime Minister Tony Abbott bowed to public pressure, and agreed to accept a few thousand of those people fleeing from Islamic State in Syria. \n\nHowever, my Facebook news feed over the last week has been full of hatred and fear, both in Australia and in the UK. \n\nI’ve found out that some of my friends, especially in the UK, are racist, sharing photos and videos purporting to show that the refugees are actually members of ISIS, put there to infiltrate other countries. \n \nOther pictures show families heading to a place called “Benefits”. \n\nI’m disappointed in these friends. \n\nI thought they would show compassion. \n\nInstead they’re showing fear and hatred. \n\nTheir fear is that Islam is suddenly going to take over the world. \n\nI find it sad that there’s such intolerance. \n     \n ALL YOU NEED IS LOVE? John Lennon and Yoko Ono staged “love-Ins” during the 1960s, as they strived for a peaceful future. PICTURE: SUPPLIED  Source: News Limited  \n    \nI was a child of the 1960s, and grew up with the phrase: “Make Love, Not War”. \n\nI watched as John Lennon and Yoko Ono staged “love-Ins”, and hippies in San Francisco put flowers in their hair, all in the name of world peace. \n\nI look back on those days fondly. \n\nHere’s an edited version of the sort of Facebook post I’m talking about. \n\n“Muslims who want to live under Islamic Sharia law need to get out. \n\n“We speak English as our common language not any other language. Therefore, if you wish to become part of society, learn the language and speak it. \n\n“If God or other parts of British culture offend you, then I suggest you consider another part of the world as your home, because God and Christian values are a major part of our culture.” \n\nAs I wrote a couple of weeks ago, we’re all migrants or refugees here in Cairns. \n\nI think back to my home town in the UK, which was host to French prisoners of war in the Napoleonic wars, and then in the Second World War, Polish refugees arrived. \n\nAfter they proved to be no danger, the French were allowed to wander around town freely, and after the Second World War, many of the Poles stayed, making great contributions to the town’s industries and culture. \n     \n NOT THE PROBLEM: Refugees should not be treated with fear and hatred. PICTURE: DAVID RAMOS/GETTY  Source:   \n    \nWhen we arrived in Australia back in 1992, we came here for a better life for our children, and part of the appeal was to live in a truly multicultural society. \n\nMy children have undoubtedly had a better life than they would have had in the UK. \n\nFinally, I’ve had two GPs since moving to Cairns six years ago. \n\nThe first was from Iran, and my current GP is Irish. \n\nBoth migrants, and on Monday I saw a different doctor, who was obviously Indian or Pakistani, yet another migrant, and I was happy to put my healthcare into his hands. \n\nI reiterate, if it wasn’t for migrants and refugees, Cairns would be a very different place than it is today. \n\nA friend works for a Catholic aid agency in town. \n\nOne of their core values is: “Solidarity … everyone belongs to one human family, regardless of their national, religious, ethnic, economic, political and ideological differences.” \n\nSounds good to me. \n\nWe only live once, let’s try and live that life in peace, not war. \n\nwww.christopherellis.net", "source": "Cairns Post"}