{"published": "2015-09-20T02:15:34Z", "media-type": "News", "title": "Red Sox Notebook: Bogaerts makes adjustment against Dickey", "id": "e1836eb5-f721-4f41-923d-a0aa6ecbf2aa", "content": "TORONTO — Xander Bogaerts struck out twice in his first two at-bats against R.A. Dickey on Saturday evening, equaling the number of times he'd struck out the first 26 times he'd faced Dickey in his young big-league career — more than any other pitcher. When he came back to the dugout after his second strikeout, he declared that all he wanted to do in his third at-bat was make contact. \"We kind of laughed it off,\" interim manager Torey Lovullo said. On the first pitch Dickey threw Bogaerts in his third at-bat, Bogaerts made contact — and he launched a knuckleball over the left-field fence. It was his sixth home run of the season, and it gave Boston its first lead of what turned out to be a wild game. Bogaerts now is slugging .571 in his career against Dickey. Though Bogaerts has long been projected as a future power hitter, that power has shown itself only rarely this season. He'd hit just three home runs all season by the end of July. His home run Saturday was his second of the month of September — the first time he'd hit two home runs in a month all season. That's not to say he hasn't been a productive hitter. Two hits on Saturday pushed his batting average to .321, second-best in the American League, to go along with a .352 on-base percentage. \"He’s one of the best hitters in the American League,\" Lovullo said. But even Bogaerts knows that the relatively meager power output looks even more meager against Jackie Bradley Jr., a line-drive hitter who has hit nine home runs and is slugging .554. \"That guy don't hit singles, you know what I'm saying?\" Bogaerts said with a grin. \"And all I do is hit singles.\" Pitching plan Eduardo Rodriguez and Henry Owens will pitch for the Red Sox on Monday and Tuesday, respectively, back at Fenway Park against the Tampa Bay Rays. No starter has been announced for Wednesday or Thursday, and the possibility remains that one could be a patched-together bullpen game. Rodriguez appears to be in line to make one more start after Monday, perhaps over the weekend against Baltimore, before his season comes to an end. Lovullo said that Rodriguez has 10-14 innings left before the team expects to shut him down. The rookie lefty has pitched 158 innings this season, already a substantial jump over the 133 2/3 innings he pitched last season, including the minor-league playoffs. Owens pitched 167 innings last season, including the International League playoffs, and so the Red Sox are less concerned about limiting his innings in the final two weeks of the season. He has thrown 166 innings this season and could make a total of three more starts, including Tuesday's start at Fenway Park. Page 2 of 2 - Wild night On a night that saw Noe Ramirez give up the tying run, Tommy Layne escape a bases-loaded jam and Robbie Ross Jr. shrug off a home run to close the game out, it was Jean Machi who had the wildest night among Red Sox relievers. Machi was on his way out to the mound to relieve Ramirez, who had allowed four straight batters to reach and the tying run to score to start the eighth inning, when he tripped and fell on the steps in the bullpen, suffering a cut on his left ear. He still managed to strike out Russell Martin before giving up a single to Kevin Pillar . \"I told the guys on the mound, 'This is going to be a great story — the guy trips and falls, comes to the mound and gets us out of the jam,'\" Lovullo said, \"while he's bleeding as I'm talking to him on the mound.\" Brian MacPherson writes for the Providence Journal of GateHouse News Service.", "source": "Wicked Local Somerville"}