{"published": "2015-09-01T10:00:00Z", "media-type": "News", "title": "Former U.S. Senator Ben Nelson, CEO of NAIC, to Keynote National Risk Retention Association 2015 Conference in Chicago", "id": "6146a813-23cc-45be-88ee-b0f3b5e9494e", "content": ") - The National Risk Retention Association (NRRA) has announced former U.S. Senator and NAIC CEO, Ben Nelson, as the keynote speaker for the organization's annual conference, to be held at the Sofitel Chicago Water Tower Hotel, September 29 through October 1, 2015. To register, visit www.riskretention.org . \n\nSen. Nelson is CEO of the National Association of Insurance Commissioners (NAIC), a focal point of NRRA regulatory advocacy in recent years. After two terms as Governor of Nebraska and two terms in the U.S. Senate, Nelson was named CEO of NAIC on Jan. 23, 2013. Before entering politics, he served as CEO of the Central National Insurance Group and Chief of Staff and Executive Vice President of NAIC. Sen. Nelson is slated to speak at the NRRA conference on September 30, 2015 at 12:45 p.m. \n   \n\"Since the law was passed in 1986, Risk Retention Groups (RRGs) have become a major industry with approximately 240 companies generating about $3B in premium. The Purchasing Group (PG) sector has also grown dramatically, now standing at well over 900 entities,\" said NRRA Board Chair Dan Labrie, CEO of HAI Group. \"Because NRRA is committed to protecting RRGs and PGs, as well as the Liability Risk Retention Act, there are times when we have to challenge various states based upon the industry's interpretation of the Act. With that in mind, Senator Nelson's appearance at our 2015 conference should make for a lively dialogue.\" \n\nThe NRRA 2015 Conference is a 3-day event, filled with fast-paced educational sessions, an impressive slate of speakers, and the most current information about the regulatory, judicial and legislative issues facing risk retention groups and purchasing groups today. \n\nRRGs and PGs have made a valuable contribution to the marketplace by providing viable insurance and risk management options to groups that need insurance, including health care providers, educators, public housing authorities and transportation, just to name a few. NRRA's 2015 Conference aims to unify the industry, while educating the insurance world, regulators, and groups in need of nontraditional insurance options on the value of and need for RRGs. \n\nThis year's conference program further develops popular conference topics and maintains a distinctively fast-paced, integrated-schedule. Attendees have the opportunity to participate in all sessions and panels, which will address issues such as cyber-security and liability, regulatory developments, risk management, reinsurance, health care, and NRRA's successful government affairs initiatives that have spearheaded numerous judicial decisions favoring the industry. \n\n\"This year, we have a very heavy focus on the regulator and state captive association issues, and in fact are dedicating three panel discussions as to these issues alone,\" said Joe Deems, NRRA Executive Director. \"We anticipate more regulators in attendance than ever before and have specifically invited leaders of state captive insurance associations to participate in our 2015 conference.\" \n\nOther unique panel sessions include: \nHot Topic: Cyber Security Liability Insurance for Risk Retention Groups Foreign v. Domestic Reinsurance Placement: Which is Right for You? Building a Health Insurance Plan Owned by RRG Members Soft Market Survival Guide Best Practices for Enterprise Risk Management RRG Executive Leadership: Leading By Example Amicus Curiae Update: a Refresher Course on NRRA's Toolkit for Your Risk Management Strategies (tricks and strategies to use in preparing a case for potential amicus brief settings) \nThe NRRA 2015 Conference is made possible in large part due to the generous support of our sponsors. This year, premium sponsors include JLT, Imperial PFS, Besso Re, Johnson Lambert Co., Marks, O'Neill, O'Brien, Doherty & Kelly, P.C. and Crowe Horwath LLP. \n\n\"NRRA's sponsors seem particularly pleased with their inclusion year-round in the ' Sponsor Gallery ' on our website, and on our mobile app,\" said Deems. \"We are truly focused on making our 2015 conference a great opportunity to do business with everyone who is anyone in the RRG and PG industry.\" \n\nThe conference program and speakers are subject to change. For information and to register for the NRRA 2015 Conference, visit www.riskretention.org . \n\nABOUT NATIONAL RISK RENTENTION ASSOCIATION \n\nThe National Risk Retention Association (NRRA) was formed in September 1987 as a 501(c)(6) non-profit trade association and is the only national association dedicated to the successful development, education and promotion of U.S. domiciled alternatives to traditional liability insurance. NRRA provides a forum where the country's most knowledgeable individuals in risk retention insurance may exchange valuable and timely information. For more information, visit www.riskretention.org . \n\nCONTACT: \nStephanie Holbrook \ninfo@riskretention.org \n(818) 995-3274", "source": "SearchBug"}