{"published": "2015-09-25T14:00:30Z", "media-type": "Blog", "title": "Newspaper column: Whether you get to vote on tax hike will be up to the courts", "id": "ff7823ea-7197-4924-b92b-5054a727cda5", "content": "One of these days, perhaps, you will be able to go online and download and sign a petition calling for the repeal of the $1.4 billion in tax hikes — a nearly 17 percent increase in state spending — approved by your Republican-majority Nevada Legislature and signed by your Republican governor just months after the voters rejected two tax hikes at the ballot box — one of them by a margin of 4-to-1.\n\nEarlier this summer a group calling themselves the We Decide Coalition filed such an initiative with Republican Secretary of State Barbara Cegavske, asking that the matter go before the voters in November 2016.\n\nThe filing included a verbatim copy of the 100-page Senate Bill 483, which created a commerce tax (similar to the voter-rejected margin tax), hiked the cigarette tax $1 a pack, adjusted the payroll tax, made permanent certain “temporary” taxes, hiked business license fees, changed taxes on mining (a version of which was also rejected by voters), etc.\n\nKnowing full well the initiative would be challenged in court because it addressed more than a single subject as required by law, a legislative land mine that has blown up many a petition effort, the group filed a pre-emptive lawsuit asking that the petition be declared a single subject because it addresses only one bill or, in the alternative, that SB483 be jettisoned as unconstitutional.\n\n[caption id=\"\" align=\"alignright\" width=\"220\"] Brian Sandoval[/caption]\n\nThe state Constitution requires: “Each law enacted by the Legislature shall embrace but one subject, and matter, properly connected therewith, which subject shall be briefly expressed in the title …”\n\nRepeal proponents point out that SB483 amends 41 chapters and hundreds of sections, and amends, adds or deletes more than 87 separate freestanding sections of state law.\n\nThe status of that lawsuit is unclear since a group calling itself the Coalition for Nevada’s Future filed another suit in another state court challenging the legal standing of the petition over the single-subject law and over its “Description of Effect” filed with the repeal effort. Instead of describing the effect of repealing the law or letting it stand, the We Decide Coalition simply cut and pasted SB483’s title.\n\nThe suit points out that Nevada law “requires that an initiative petition set forth, in not more than 200 words, a ‘description of the effect of the initiative or referendum if the initiative or referendum is approved by the voters.’ The purpose of the description of effect is to help prevent voter confusion and promote informed decisions. The description of effect cannot be materially misleading, nor fail to identify the consequences of a referendum’s passage, and it must be straightforward, succinct, and nonargumentative.”\n\n[caption id=\"\" align=\"alignleft\" width=\"200\"] Chuck Muth[/caption]\n\nOne of the instigators of the petition, Chuck Muth, conceded the latter point and said the group plans to refile its petition with a new and improved description of effect.\n\nOnce that is done, the other coalition is expected to file suit against that petition and start the whole process over again.\n\nThere is a possibility somewhere along the line that someone might raise the issue of whether every state judge has a conflict of interest. Were the voters to get a chance to slash the state budget by nearly 17 percent, who knows where the cuts in spending might trickle down. To the courts, perhaps? But it is hard to see how federal courts could have jurisdiction in what are basically conflicts under state law and constitution.\n\nGov. Brian Sandoval has promised to fight the repeal effort tooth and nail, calling the petition “a wrongheaded attack on the children and families of Nevada. Supported by more than seventy percent of legislators, the revenue the petition seeks to eliminate will go directly to the classroom and give teachers the resources to deliver a quality education.”\n\nOf course, the governor fails to note that the state has increased education spending 80 percent per pupil, adjusted for inflation, over the past 40 years with no detectible effect on student test scores.\n\nMore than a few legal knots will have to be untangled before we find out whether the voters themselves will get a chance to say whether they agree or not with this massive increase in spending and taxation.\n\nA version of this column appears this week in the Battle Born Media newspapers — The Ely Times, the Mesquite Local News, the Mineral County Independent-News, the Eureka Sentinel, the Lincoln County Record and the Sparks Tribune — and the Elko Daily Free Press.", "source": "4TH ST8"}